{"title": "Chapter 221: A Newcomer to the Dao of Alchemy", "id": 221, "volume": 3, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-221-a-newcomer-to-the-dao-of-alchemy", "volume_title": "Volume 3", "body": "<h1>Chapter 221: A Newcomer to the Dao of Alchemy</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span style=\"\"></span></p><br/><p><strong>Chapter 221: A Newcomer to the Dao of Alchemy</strong></p><br/><p>Time flashed by. Soon two months had passed. Meng Hao still resided in District One Valley One. However, he was no longer located next to the stream. On one of the mountains that formed the valley, a narrow path wound up to the peak, where there was an Immortal’s Cave.</p><br/><p>Clouds drifted past its green, stone door. Standing there, one could see the entirety of the valley below. The spiritual energy was much thicker, and within the mountain itself was a vein of fire.</p><br/><p>This was the Immortal’s Cave that had been bestowed upon Meng Hao after he was raised to master alchemist.</p><br/><p>Only master alchemists could live in the upper reaches of the mountains. There, separated from the apprentice alchemists, they could enjoy the special privileges they had earned as master alchemists. For example, they could seek apprentice alchemists to serve as assistants. Furthermore, for slight compensation, they could acquire various pill formulas and even medicinal plants from the Sect.</p><br/><p>The only demand placed upon master alchemists was that they meet the monthly quota of medicinal pills.</p><br/><p>In order to receive less common medicinal plants and pill formulas, they would have to turn over a greater quantity of medicinal pills. The more they provided, the more they were rewarded.</p><br/><p>After becoming a master alchemist, it was also possible to engage in trade with other master alchemists. All of this was designed to improve knowledge and familiarity with alchemy, and to increase the quality of the medicinal pills produced.</p><br/><p>On this particular day, a roaring sound filled Meng Hao’s Immortal’s Cave. Despite the door being sealed, the sound still echoed out far and wide. Down in the valley, the apprentice alchemists held their tongues. They looked up toward Meng Hao’s Immortal’s Cave, unable to contain their admiration and envy.</p><br/><p>During the two months since Meng Hao became a master alchemist, this type of roaring sound could be heard frequently.</p><br/><p>Inside, Meng Hao was covered with filth and grime. It was with a bitter laugh that he watched the pill furnace in front of him explode. He sighed, flicking his sleeve to collect up the bits of the broken pill furnace, and the remnants of the medicinal pill he had been concocting. He frowned as he sat there on the stone platform.</p><br/><p>“Concocting pills is not easy,” he said. “The slightest lack of control of the earthly fire can ruin the pill and stress the pill furnace to the point of destruction. In the past two months, I’ve already blown up forty seven pill furnaces….” The sleeve of his long, black gown was embroidered with a tiny pill furnace. This set of clothing representing his status as a master alchemist.</p><br/><p>“I’ve improved quite a bit, though. In the past two or three days I’ve only exploded one.” He looked at the seven or eight pill bottles lined up next to him, and his eyes shined contentedly. The pills inside these bottles were the accumulation of his two months of practice. They were only useful for the Qi Condensation stage, but the feeling of making something with his own hands left Meng Hao feeling very happy.</p><br/><p>“Concocting pills is definitely not easy, and is clearly connected to latent talent. What’s even more important though is… concocting pills is expensive! No wonder there aren’t very many master alchemists….” Meng Hao sighed emotionally. He hadn’t felt this way back when he was an apprentice alchemist. When he had worked with Li Tao, he had only seen the respect given by outsiders, as well as Li Tao’s profits when he concocted pills for Inner Sect disciples.</p><br/><p>After becoming a master alchemist, though, he realized that behind every truly successful alchemist existed a mountain of spent Spirit Stones. That was the only way to achieve true success. Of course, latent talent was also necessary; with only ordinary latent talent, the Spirit Stones necessary to succeed as a master alchemist could fund a small Sect.</p><br/><p>“A pill furnace costs twenty thousand spirit stones… and that’s for the lowest level pill furnace provided by the Sect. And I’ve destroyed forty seven….” When Meng Hao thought of this, and the fact that he had to pay for all the pill furnaces, his heart ached.</p><br/><p>“Pill furnaces are only one aspect,” he thought. “Concocting pills requires medicinal herbs, which are even more costly. Sometimes a single pill requires a combination of dozens of medicinal herbs. When you add them all together, it’s not cheap. That’s not the worst, though… What’s really killing me is… my success rate is only one in ten….” He took a deep breath as he thought of the whole situation. “The more expensive the medicinal plants, the more ancient the pill formula, the higher quality the pill… the more likely I am to fail.” He sighed emotionally.</p><br/><p>“However, now that I’m a master alchemist, there are also a lot of perks. For example, this medallion.” He slapped his bag of holding to produce a white medallion.</p><br/><p>It felt cold in his hands, and seemed to be made of jade… and yet not. A pill furnace was carved on one side, along with calligraphy that read “Blacklist.”</p><br/><p>“Pill Blacklist!” Meng Hao looked at the command medallion, and his eyes filled with a strange light. This wasn’t the first time he had taken out the medallion to look at. Every time he did, his heart filled with a feeling of veneration for the position of master alchemist.</p><br/><p>The Pill Blacklist medallion was a right given to all master alchemists by the Sect. Only one was distributed per alchemist, and could be used twice. It was the ultimate expression of the respect demanded by master alchemists, and was enough to strike fear into the heart of any member of the Violet Qi Division.</p><br/><p>One of the main reasons that master alchemists had such a high position compared to the Violet Qi Division was because of the Pill Blacklist. The thought of being added to the Pill Blacklist would cause most Cultivators to feel an intense terror.</p><br/><p>There was only one purpose to the Pill Blacklist. Any Violet Qi Division disciple whose name was added to the list, would be refused service by all master alchemists for a time period of one hundred years.</p><br/><p>This had been a Sect rule for countless ages, and a power possessed solely by the East Pill Division. This arrangement caused master alchemists to command incredible respect within the Violet Fate Sect.</p><br/><p>Because of this, few would dare to offend a master alchemist. To offend one master alchemist was equivalent to offending them all.</p><br/><p>The rule had existed since ancient times, and in the past one thousand years, had not been exercised by very many master alchemists. During that time, the list had never exceeded a few hundred people. Considering there were nearly ten thousand disciples within the Inner Sect, that wasn’t a very large number.</p><br/><p>To master alchemists, NOT using the Pill Blacklist made it that much more of a deterrence. After all, after the second usage, its effectiveness vanished.</p><br/><p>The names of everyone on the one hundred years Pill Blacklist were branded onto the medallion. After becoming a master alchemist, Meng Hao earned the right to use the power of the medallion, but of course, was also required to respect the arrangement. Currently, there were thirteen people who had been Pill Blacklisted; for one hundred years, no master alchemist, Meng Hao included, would concoct pills for these thirteen people.</p><br/><p>He looked at the Pill Blacklist medallion for a moment longer, then put it away. After a moment’s thought, he retrieved a jade slip and branded it with some information. Then he ignited it; in the blink of an eye, it disappeared.</p><br/><p>Not much time passed before he heard a voice from outside the Immortal’s cave. He lifted a finger, and the door to the Immortal’s Cave opened. A pretty girl entered who appeared to be about eighteen or nineteen years old. As soon as she entered the Immortal’s Cave, her nose wrinkled as if she were gagging on the odor of the exploded pill furnace.</p><br/><p>“Alchemist Fang,” she said, smiling, “I was feeling a bit confused yesterday. I was wondering why so many days had passed since you asked me for a replacement furnace….” She produced a brand new pill furnace from her bag of holding and handed it over to Meng Hao with a smile.</p><br/><p>The girl’s name was Lin Rui, and she was in charge of daily affairs for master alchemists. Her Cultivation base was not very high, but according to the rumors, one of her Clan members was a Violet Furnace Lord. Furthermore, she had a pleasing personality. Therefore, many of the master alchemists had taken a liking to her. Over time, she came to take care of whatever the various master alchemists needed.</p><br/><p>For example, during the past two months, she had delivered pill furnaces to Meng Hao on forty six different occasions. Today would be the forty seventh.</p><br/><p>Feeling slightly embarrassed, Meng Hao cleared his throat. He accepted the pill furnace, along with a jade slip that she handed over. Now that he was a master alchemist, he didn’t actually have to pay up front for pill furnaces, medicinal pills, pill formulas. The Sect would provide them willingly. However, that didn’t mean that they were free. They could be acquired on credit. But eventually, he had to provide compensation in the form of medicinal pills.</p><br/><p>“How much do I owe?” he asked, looking at the jade slip with a frown.</p><br/><p>“Including today, you owe 6,757 Qi Condensation Pills to the Sect.” She winked at him, and covered her mouth as she laughed. Then she continued on in a conciliatory tone: “It’s not a big deal. You actually don’t owe very much. The most I’ve seen someone owe is 1,730,000. That much… would probably require a lifetime of pill concocting to pay back….”</p><br/><p>Hearing the enormous number caused Meng Hao to stare in shock. Then he smiled wryly, shook his head, and sighed. He took out his own jade slip and inscribed the information on it, then handed the original back to the girl.</p><br/><p>“Alchemist Fang, just keep working hard. Um… the most recent Pill Delivery Day has already passed. Do you think you could provide a bit more than the quota? If you do, it will make it easier to make an explanation.” Lin Rui’s smile was like a flower. It was little wonder the master alchemists all liked her. Of course, Meng Hao was the youngest master alchemist by far, so every time she came here she would find opportunities to make fun of him a little. She seemed to love it when Fang Mu blushed with embarrassment.</p><br/><p>Meng Hao sighed, then picked up one of the pill bottles. Inside were five Qi Condensation Pills. He handed them to the girl. It was his first time turning over pills toward his quota.</p><br/><p>The girl covered her mouth as she giggled. She took the pills and left. Meng Hao watched her depart, after which he sealed the cave door. He held the pill furnace up in his hand and sighed.</p><br/><p>“If things keep going like this, considering the level of my pill concocting, there won’t be any Inner Sect disciples from the Violet Qi Division who come looking for me. I’m not going to make any profits whatsoever, and I won’t be able to get any new pill formulas.”</p><br/><p>The most important thing was to get invitations from Violet Qi Division Inner Sect disciples to concoct pills. Doing so would provide more chances to encounter new pill formulas. The more invitations, the more pill formulas. Over time, his skill in alchemy would grow increasingly high. Not only would he be using medicinal pills that weren’t essentially on loan from the Sect, but also, he would make a handsome profit.</p><br/><p>As far as the embezzlement factor, well that had basically become a rule. What could the Violet Qi Division do about that?</p><br/><p>Meng Hao took a deep breath as he put the pill furnace down and picked up one of the pill bottles. He opened it up and looked at the medicinal pills inside. They were smooth and round, and spiritual energy wafted up from them. Meng Hao slowly began to frown.</p><br/><p>“Perhaps there are some mistakes with my concoction techniques. If there aren’t, then how come it takes so much effort to concoct pills? When Li Tao does it, it seems so much easier.” Lost in thought and muttering to himself, Meng Hao stood up and began to pace around the Immortal’s Cave. Suddenly, he stopped, and his eyes began to glitter.</p><br/><p>He lifted his right hand, and the pill furnace floated over. Eyes shining brightly, he slapped his bag of holding, and ten medicinal plants emerged. His hands flew as he catalyzed them and then extracted the sap from them. In the space of about ten breaths, he prepared all the ingredients and then placed them in the furnace.</p><br/><p>He stamped his foot lightly on the ground, after which an area just in front of him began to glow red. An intense heat emanated out. He suspended the pill furnace about three inches above the bright red spot and began to gesture incantation symbols. The pill furnace then floated up a bit higher, and then lower, going back and forth at various intervals. Soon, a medicinal aroma filled the Immortal’s Cave.</p><br/><p>As it did, Meng Hao sat down cross-legged. His right hand then reached out and pushed down onto the pill furnace. He closed his eyes and began to pour spiritual energy into it, beginning another catalyzing process.</p><br/><p>This catalyzing technique he had learned from Li Tao. Not only did it increase the medicinal age, it… was actually required for the pill concocting process.</p><br/><p>Soon, Meng Hao’s eyes glittered even more brightly. According to the changes occurring within the pill furnace, he adjusted things here and there. He occasionally added some medicinal plants, or removed sediment from the pill furnace. Previously, he had required ten or twelve hours to finish concocting, but this time, after only six hours, he flicked his sleeve and removed the pill furnace from the heat. He opened the lid, and as the medicinal aroma brushed across his face, he removed four Qi Condensation Pills from inside.</p><br/><p>The pills were still soft, but as he removed them, they quickly began to harden, dried by the air.</p><br/><p>“I was wrong….” He looked carefully at the relatively crude pills he had just produced, and picked up one of the pill bottles which contained another set of pills, ones he had painstakingly made to be as perfect as possible. After comparing the two types of Qi Condensation Pills, his eyes suddenly filled with enlightenment.</p><br/><p>“These exquisitely produced pills wore me out. The medicinal strength is clearly much higher, perhaps seventy or eighty percent. The crude pills, on the other hand, only have a medicinal strength of about thirty or forty percent.</p><br/><p>“My previous refining technique was too strenuous. If I had known that I could make pills like I did today, then I wouldn’t have wasted so many pill furnaces.” He was lost in thought for a moment as he put away the Qi Condensation Pills.</p><br/><p>“Such a large difference in quality, about double…. Perhaps it has something to do with the time spent refining the pills. However, it shouldn’t have that much of an effect. After all, I’ve seen Li Tao concoct pills both for himself and others, and there is never much of a difference.”</p><br/><p>Meng Hao frowned and muttered to himself for a moment, before his eyes finally glittered again.</p><br/><p>“Could it be that it has something to do with my Perfect Foundation? My spiritual power belongs to me and does not circulate back into Heaven and Earth. It’s branded as being mine alone. My five Dao Pillars can trample upon the Foundation Establishment stage. When I use it to concoct pills, it’s infected with my aura…. Maybe that’s why the pill furnaces kept blowing up, because the medicinal pills I was refining could be classified as Perfect?” His eyes continued to shine as he pondered the matter, eventually coming to the conclusion that his theory was correct.</p><br/><p>He continued to think about the matter for some time, when suddenly, his expression flickered. He looked down at the bag of the Cosmos. From within the blood mask, the voice of the meat jelly transmitted into his mind. It sounded weak.</p><br/><p>“I can’t hold on any longer! I can’t continue to support your transformation! Damn me, I knew I shouldn’t have lent my transformation power to others. Meng Hao, I need to shed. I’m finished! Finished! Ah, one month. I need one month. You need to … make sure to … be careful….”</p><br/><p>The meat jelly’s voice grew weaker and weaker and then finally faded into nothing. As it did, Meng Hao’s features flickered, and his real face returned.</p><br/><p>As luck would have it, it was at this exact moment that the voice of Chu Yuyan could be heard outside his Immortal’s Cave.</p><br/><p>“Fang Mu! Open up your Immortal’s Cave, I want to talk with you about something!”</p><br/><p>-----</p><br/><p><em>This chapter was sponsored by Quentin Nivon, Robert Kunzi, and DS</em></p><br/>\n</div>"}