{"title": "Chapter 240: Screw This", "id": 240, "volume": 3, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-240-screw-this", "volume_title": "Volume 3", "body": "<h1>Chapter 240: Screw This</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span style=\"\"></span></p><br/><p><strong>Chapter 240: Screw This</strong></p><br/><p>“Third bite! I’m gonna take a third bite!” Filled with determination, Fatty used one hundred percent power to bite down. A roaring filled his head, and his teeth ground down onto the medicinal pill so hard it seemed like sparks would fly off of it.</p><br/><p>The medicinal pill’s incredible elasticity pushed back against his teeth. The feeling was impossible to describe, and caused Fatty to begin to tremble. His face drained of blood, and sweat began to pour down.</p><br/><p>Gritting his teeth against the pain, he called out in a loud voice, “See how I keep my word!? Hahaha! I’m even sweating to add to the illusion… Okay, time for the fourth bite, kid. After this one, I won’t be able to hold back any more.”</p><br/><p>How could the onlookers not pick up any clues as to what was really going on? Strange looks began to appear on their faces; they could see how twisted he was at heart. The Golden Frost Sect disciples had especially strange looks, considering how well they knew Li Fugui.</p><br/><p>Eternal Mountain’s eyes narrowed. He frowned and began to mutter to himself.</p><br/><p>Everyone could see the determination filling Fatty’s eyes; he was obviously going all out. He switched the medicinal pill to the other side of his mouth and bit down viciously.</p><br/><p>“Your granny! There’s no way I can’t bite it to pieces!”</p><br/><p>A cracking sound rang out as Fatty’s teeth pierced deep into the pill. However, as soon as they did, a foul, fishy, incredibly spicy fluid sprayed out from the hole that had been punched into the pill.</p><br/><p>Fatty’s face suddenly went pale white. His body began to tremble, and his eyes went wide, and filled with veins of blood. Tears began to stream out of his eyes, and a roaring filled his mind. It seemed as if his soul were about to fly out of his body. The feeling in his mouth was impossible to describe.</p><br/><p>“You… you….” Body trembling, face pale, he involuntarily leaped back and was just about to spit the pill out when he realized that everyone was looking at him. He quickly closed his mouth shut tight, refusing to spit the pill out.</p><br/><p>The situation didn’t seem to be very complicated, but to Fatty, it seemed as if he were in a living nightmare. Sweat poured off of his body. He could handle foul odors. He could handle fishy flavors. But what he hated more than anything else, was spicy food.</p><br/><p>His mouth felt as if it were on fire, and it seemed about to drive him insane.</p><br/><p>Meng Hao felt even more guilty. He had learned of Fatty’s hatred of spicy food back in the Reliance Sect. Fatty had accidentally revealed the matter to him personally. During the pill concoction process just now, he had intentionally added some medicinal plants which would create spiciness….</p><br/><p>The pill was an amalgamation that included the meat jelly skin powder, which was virtually indestructible. However, Meng Hao was worried that Fatty’s teeth would exceed his own powers of prediction, and had therefore included a backup contingency…. spiciness.</p><br/><p>Fatty’s face was bright red as he glared at Meng Hao. His tongue was numb, and his head was buzzing. “I still have one bite left…. you… you little…. you just wait, this time, I’ll crush the pill to pieces!”</p><br/><p>Everything was quiet. The surrounding Cultivators looked on with strange expressions.</p><br/><p>Li Hailong’s eyes were wide. Next to him, An Zaihai gaped for a moment, then began to shake his head with a wry smile.</p><br/><p>Fatty was just about to go all out as he took his final fifth bite. Meng Hao could no longer hold back. “It’s even more spicy the deeper you go…” he blurted.</p><br/><p>When Fatty heard this, it hit him like a bolt from the blue. A tremor ran through his body, and it seemed he was too frightened to take another bite, and perhaps would give up. The people who had been repulsed by Fatty before, now seemed to be feeling a bit bad.</p><br/><p>“What do you want…?” said Fatty. He looked like he was about to cry.</p><br/><p>“I….” Meng Hao sighed. He really felt guilty at this point.</p><br/><p>“Screw this!” Fatty opened his mouth to spit out the medicinal pill. However, the pill was now stuck on one of his teeth, which had punctured the pill but not bitten all the way through it.</p><br/><p>Fatty quickly plucked the pill off of his tooth and tossed it back to Meng Hao. Eyes glowing with hatred, he retreated back to his place among the Golden Frost Sect disciples.</p><br/><p>Currently, his lips and tongue were completely numb. The words he had spoken just now had been a bit slurred, and his face was bright red. Sweat continued to pour off of him, and the roaring sound continued to fill his head. Tears streamed down his face, and he felt as if his mouth might begin to emit flames at any moment.</p><br/><p>Everything was quiet. Who could possibly have imagined or predicted that Li Fugui would hate spicy things so much? Cultivators are not mortals, and should be able to prevent such things from affecting them. Fatty’s reaction was therefore a testimony to the pill itself.</p><br/><p>“What sinister spiciness does that pill contain to be so effective!?!?”</p><br/><p>“So that medicinal pill… was actually vastly more powerful than a poison pill!”</p><br/><p>“That pill… was so bizarre!!”</p><br/><p>Everyone’s attention was completely focused on the medicinal pill in Meng Hao’s hand. Two lines of teeth marks could be seen on either side, and in one spot was a tiny hole where Fatty’s tooth had punctured the pill. It was no longer round, but flat.</p><br/><p>Whichever way you looked at it, though, the pill had not been crushed into pieces!</p><br/><p>Soon all eyes moved from the pill, to Meng Hao’s face. The East Pill Division, the Violet Qi Division, and the Golden Frost Sect were all looking at Meng Hao.</p><br/><p>There were a variety of expressions: looks of confusion, wry smiles, glares of envy. Everyone who knew him suddenly decided that in the future, they should be very cautious about consuming pills he had concocted.</p><br/><p>Meng Hao was used to being stared at. His expression was the same as ever, but his heart began to beat faster. He put his pill away, then looked at Lin Hailong, and An Zaihai, who was still shaking his head and laughing.</p><br/><p>Grandmaster Eternal Mountain’s archaic voice broke the silence. “Kid, would you mind giving me that pill to examine for a moment?”</p><br/><p>Meng Hao hesitated, then shyly asked, “Um… Elder, didn’t I just win?” With his pale skin and scholarly appearance, he really looked like a defenseless young animal. It was the kind of look that made people instantly sympathetic.</p><br/><p>Meng Hao’s question actually didn’t sound like a question. Were it anyone other than him who responded in such a way, Eternal Mountain might take offense.</p><br/><p>Seeing Meng Hao’s expression caused Fatty’s hair to stand on end. His eyes went wide, and he stared. His tongue was still numb, his vision was still blurry with tears. But seeing what was happening now caused a face to appear in his mind.</p><br/><p>The expression on this master alchemist’s face, and his words, were exactly like what he remembered from the Pill Cultivation Workshop Outlet back in the Reliance Sect! [1. Meng Hao started the Pill Cultivation Workshop Outlet in chapter 11. Fatty joined the operation in chapter 18]</p><br/><p>“He’s… he’s….” The more closely he looked, the more confused he got. This was especially so as he thought to how Meng Hao had disappeared without a trace a few years before. No matter what inquiries Fatty made, he hadn’t been able to turn up a single clue. But Fatty just couldn’t believe that Meng Hao would have left the Southern Domain.</p><br/><p>“Don’t tell me… dammit… if that’s really him…. Only Meng Hao knows that I hate spicy food!!” Fatty’s eyes went wide, and he began to breathe heavily. He felt even more wronged now. If this person wasn’t Meng Hao, then he would definitely figure out some way to get revenge on him. If it was Meng Hao, though, he obviously wouldn’t.</p><br/><p>Grandmaster Eternal Mountain smiled as he looked at Meng Hao. Inwardly, he smiled. He felt as if he were looking at himself all those years ago. He didn’t care whether or not spiciness had been added into the medicinal pill. The fact that Li Fugui couldn’t crush the pill in four bites was testament to its strength and resilience.</p><br/><p>“It appears I’ve lost the wager,” said Grandmaster Eternal Mountain, smiling. With that, he flicked his sleeve, and the pill bottle with the ancient medicinal pill flew over to Lin Hailong. “Kid, are you going to give me that pill to have a look at?”</p><br/><p>“I’m afraid not,” replied Meng Hao, his expression no longer bashful. “Without the express approval of the senior generation of the East Pill Division, junior doesn’t dare to allow others to appraise the pill.” Meng Hao couldn’t possibly hand the pill over; as soon as Grandmaster Eternal Mountain got his hands on it, he would definitely be able to detect the meat jelly skin powder. Then, Meng Hao’s position would be compromised, which would lead to all sorts of trouble.</p><br/><p>Eternal Mountain stared in shock at Meng Hao’s reply. It had been many years since he had requested to appraise a pill. Never before had any master alchemist refused. Considering his status, each and every one would hand over the pill eagerly. One word from him could cause the name of an alchemist to spread throughout the Southern Domain.</p><br/><p>Meng Hao’s response caused Lin Hailong’s face to soften a bit. He smiled at Meng Hao, and nodded slightly. “What’s your name?” he asked.</p><br/><p>“Disciple Fang Mu,” Meng Hao replied with a start.</p><br/><p>“What I said just now was no joke,” he said with a smile. “Fang Mu, from this day forward, you are a Furnace Lord. I will send people for you shortly to complete the Furnace Lord branding process.” With that, he looked over at Eternal Mountain. “What now, Grandmaster Eternal Mountain?”</p><br/><p>Eternal Mountain gave Meng Hao a long, deep look. Then, smiled and rose to his feet, shaking his head.</p><br/><p>“I’ve lost,” he said, “but I have no regrets. With a kid like this, the East Pill Division could last forever. However, first there was Elder Brother Liu, then me. Who knows when the third person to forsake the Sect will appear?” He gave Meng Hao a final smile, then turned and left.</p><br/><p>The rest of the Golden Frost Sect followed him. Tang Shicang gave Wu Dingqiu a smiling bow, then left with his disciples.</p><br/><p>Before leaving, Fatty turned back with a pitiful expression to look at Meng Hao. Seeing his wronged expression, Meng Hao felt extremely guilty. He also realized that Fatty most likely knew his true identity.</p><br/>\n</div>"}