{"title": "Chapter 253: Primordial Heavenly Replenishing Pill!", "id": 253, "volume": 3, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-253-primordial-heavenly-replenishing-pill", "volume_title": "Volume 3", "body": "<h1>Chapter 253: Primordial Heavenly Replenishing Pill!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span style=\"\"></span></p><br/><p><strong>Chapter 253: Primordial Heavenly Replenishing Pill!</strong></p><br/><p>In the time it takes for half an incense stick to burn, a hundred different types of medicinal pills had been “delivered” over. Chen Jiaxi trembled; his face was ashen. His madness had reached an explosive height as he found that there wasn’t a single medicinal pill he could produce that his opponent couldn’t identify.</p><br/><p>This level of skill left Chen Jiaxi in despair. He wanted to cry that his opponent was wrong, but he didn’t dare. If Fang Mu then used the formula to concoct an identical copy of the pill, Chen Jiaxi’s entire reputation would be in ruin.</p><br/><p>Li Yiming stood off to the side, watching bitterly as Chen Jiaxi handed over pill after pill, and Meng Hao put pill after pill into his bag of holding. His scalp was numb, and his heart had filled with an indescribable fear.</p><br/><p>The surrounding Black Sieve Sect disciples watched the scene in astonishment. From their perspective, Chen Jiaxi wasn’t competing with Fang Mu, he was just giving him pills.</p><br/><p>On the other hand, Meng Hao’s actions left them buzzing with shock. His unfathomable skill with plants and vegetation, his irrefutable logic regarding the Dao of alchemy, and his fearsome Instantaneous Formula Scrying just added layer after layer of mystery. As they watched him, their faces filled with continuously growing amazement.</p><br/><p>From beginning to end, Meng Hao didn’t pull out even a single medicinal pill. This was because he never misidentified any of the pills that were produced. Eventually, he started to feel a little bit embarrassed.</p><br/><p>Chen Jiaxi, of course, had the worst of it all. His heart bled, his eyes were growing dry, and his body trembled. Everything seemed to be going black.</p><br/><p>However, he continued to pull out medicinal pills. He had utmost confidence in each pill, and yet they all ended up in his opponent’s bag of holding.</p><br/><p>There was no way to put an end to it. Just now, he had said, ‘I won’t stop until I win.’ He wouldn’t be able to end until he ran out of medicinal pills.</p><br/><p>As he pulled out the one hundred and twenty seventh pill, he suddenly lifted his head to look at Meng Hao. Then, he radiated madness as he slowly put the pill back into his bag of holding and instead retrieved a jade box.</p><br/><p>The jade box was covered with black splotches, as if it had been entombed in the earth for countless years. This was an object that Chen Jiaxi originally hadn’t intended to reveal. To him, it was a precious treasure of a lifetime. In fact, when he had uttered the words ‘I won’t stop until I win,’ he hadn’t even considered to include this item in the statement.</p><br/><p>Suddenly, he realized that if he wanted to gain complete victory, he would have to win at least one time. And if he wanted that, then he must use the item in the jade box. After all the fierce struggle now, pulling out this object finally gave him hope.</p><br/><p>The instant the box appeared, all eyes came to rest upon it. Anyone could tell that the pill inside this box would most certainly determine victory or defeat!</p><br/><p>The black stains on the box made it obvious to all the onlookers that the box was so old it was beginning to decay. There was even a faint, gruesome death aura wafting out from the box.</p><br/><p>A serious look filled the eyes of Patriarch Violet Sieve and his two companions.</p><br/><p>Chen Jiaxi gritted his teeth and slowly said, “If you know the formula to this pill, then I, Chen Jiaxi, will admit defeat and, if I ever meet your excellency in the future, will immediately fall to the ground and kowtow to you! If you don’t know the formula, then I will not cause any further trouble for you. I will only require that you return all the pills I produced just now. Then, this matter will be concluded!”</p><br/><p>Zhou Dekun’s eyes narrowed, and before Meng Hao could say anything, he strode forward and beratingly said, “Chen Jiaxi, you are a scarlet-robed master alchemist of the World Pill Division. Do you have any face? This is obviously an ancient medicinal pill whose pill formula has been lost for countless ages. How could a modern-day alchemist possibly be able to identify it!?” He was obviously worried about Meng Hao leaping to accept the challenge.</p><br/><p>A buzz rose up from the surrounding Black Sieve Sect disciples. “An ancient medicinal pill!” Such pills from ancient times were very rare. Even one would be enough to cause an incredible stir. Furthermore, the formulas for most ancient pills were lost. Even the three great alchemists might have trouble identifying an ancient pill. Each and every such pill could be considered a consummate pill.</p><br/><p>“Where did Grandmaster Chen get an ancient medicinal pill? You almost never see something like that! If it were auctioned off, the price it would get would be unimaginable!”</p><br/><p>“Could it be one of Grandmaster Eternal Mountain’s treasures that he bestowed upon Grandmaster Chen as a gift?</p><br/><p>As the conversations broke out, Li Yiming took a deep breath. Even he never imagined that Chen Jiaxi would possess an ancient medicinal pill.</p><br/><p>“Do you dare?!” shouted Chen Jiaxi, glaring at Meng Hao.</p><br/><p>Meng Hao looked at the jade box, and his eyes filled with imposing aura. He had seen an ancient medicinal pill before, the day Grandmaster Eternal Mountain had visited the Violet Fate Sect. That pill had been an Entrancement Pill.</p><br/><p>Meng Hao thought for a moment, and then his eyes flickered with resolve. He made a grasping motion, and the jade box in Chen Jiaxi’s hand flew over to him.</p><br/><p>Seeing Meng Hao agree to the challenge caused Zhou Dekun’s heart to fill with anxiety. Li Yiming also appeared shaken. Chen Jiaxi, on the other hand, let out an inward sigh of relief. His eyes filled with a cold sneer. He knew from the moment his opponent had agreed, that victory was his!</p><br/><p>He had acquired this treasured ancient medicinal pill a few years ago from some old painter. It had nearly left him in poverty, and he had been forced to concoct pills like a slave for three years as part of the deal to acquire it.</p><br/><p>He didn’t dare to casually consume it; he planned to wait until his longevity was reaching its end before doing so. Or perhaps he would trade it for some incredibly priceless treasure. As a matter of fact, the pill’s appearance had already caught the attention of the Black Sieve Sect; it seemed they already were interested in acquiring it.</p><br/><p>Meng Hao took hold of the jade box. His expression was serious as he slowly opened it. As he did, a reddish glow shined up from within. Faint strands of celestial music drifted about, and within the glow, the phantom image of a young boy could be seen. He appeared to be dancing in pleasure.</p><br/><p>The image instantly caused Patriarch Violet Sieve and his two companions to gasp. The beautiful woman immediately rose to her feet.</p><br/><p>The amazement of the surrounding Black Sieve Sect disciples was really at its peak. Buzzing conversations filled the air, and Zhou Dekun’s face went pale white.</p><br/><p>“An ancient medicinal pill which can create illusory images, this pill… is even surrounded by celestial sound. Just… just what pill is this?”</p><br/><p>Li Yiming was also completely shocked as he stared at the glowing red light emanating up from Meng Hao’s hands.</p><br/><p>As for Chen Jiaxi, a fresh breath of life seemed to have washed over him. He was in high spirits, and gave a cold laugh as he looked at Meng Hao. Seeing Meng Hao’s look of intense concentration, he lifted his chin.</p><br/><p>“Grandmaster Fang, considering your skill in the Dao of alchemy, don’t tell me that you can’t identify this pill? Ah, forget about it. I’ll just explain it for you. You know what pill this is? The name of this pill should be known to all alchemists. This is one of the three great medicinal pills of the ancient Dao of alchemy. Primordial Heavenly Replenishing Pill!!”</p><br/><p>The Black Sieve Sect Cultivators didn’t seem to be familiar with the name of the pill. However, upon hearing the name Li Yiming immediately stood up. A look of disbelief filled his face as he stared at the glow rising up into the sky.</p><br/><p>“Primordial… Heavenly Replenishing Pill….”</p><br/><p>Zhou Dekun was panting, and his body shook. He took a few steps forward, breathing raggedly, staring at the medicinal pill in Meng Hao’s hands. Suddenly, his voice rang out through the Black Sieve Sect’s massive square: “Crimson glow, a dancing child accompanied by celestial music…. This… this is most certainly one of the three great ancient medicinal pills! Primordial Heavenly Replenishing Pill!! According to the legends, anyone who consumes this pill can steal luck from the heavens and increase their longevity by one thousand years!!” The audience buzzed in excitement. A medicinal pill which can increase longevity, even if only by a sixty-year cycle, would be incredibly rare. The price people would be willing to pay for such a thing would be unthinkable.</p><br/><p>A consummate pill which could increase lifespan by one thousand years was even more incredible!</p><br/><p>Patriarch Violet Sieve’s eyes shined with unprecedented brightness. The only other time a glow like this had been seen in his eyes was when he had been about to snatch Ultimate Vexation. After all, his longevity had long since been approaching its end.</p><br/><p>The ruddy-faced old man next to him also looked at the jade box with profoundly glowing eyes. He began to mutter to himself.</p><br/><p>With his chin set complacently, Chen Jiaxi looked at Meng Hao and said, “Primordial Heavenly Replenishing Pill. The word Primordial includes ten thousand variations of plants and vegetation. As for the words Heavenly Replenishing, it is just as Grandmaster Zhou just said. It can increase longevity by one thousand years!” Chen Jiaxi was now completely back in control of himself. He had suffered defeat before, but with the appearance of this pill, he now viewed himself as having already won.</p><br/><p>“Grandmaster Fang,” he continued, “I believe it’s now your turn. Please, tell me the pill formula for the Primordial Heavenly Replenishing Pill, if you’re able!” He glared at Meng Hao aggressively.</p><br/><p>Everything went quiet, as all eyes focused on the crimson glow emanating out of the jade box, and the red pill which rested inside.</p><br/><p>Li Yiming also seemed to have recovered his wits. He took a deep breath, and his eyes began to shine. He knew in his heart that there was no way Fang Mu could achieve victory now.</p><br/><p>Zhou Dekun cursed silently. This was an ancient pill, one of the three great miraculous pills. Its name was majestic, and there was definitely no modern-day alchemist who could know the formula.</p><br/><p>He took a step forward. Glowering at Chen Jiaxi, he said, “Chen Jiaxi you are a scarlet-robed alchemist of the World Pill Division. Such tactics as this are contemptible! People like us, even people like your Master, Grandmaster Eternal Mountain, could never identify the formula of the Primordial Heavenly Replenishing Pill! Furthermore, the contest just now was to identify pills that you had concocted. Did you concoct the Primordial Heavenly Replenishing Pill? Even you don’t know the formula, yet you dare to bring it out as part of this contest?!?!”</p><br/><p>Chen Jiaxi laughed coldly. “This was agreed upon by Grandmaster Fang,” he said in a growling voice. “You can’t claim that I’m breaking the rules.” He ignored Zhou Dekun, and stared again at Meng Hao. “Grandmaster Fang, I’m not the only person awaiting your answer. There are tens of thousands of others who are all eagerly awaiting to hear the pill formula. Haven’t you been looking at the Primordial Heavenly Replenishing Pill for long enough!?” He took a step forward and, seeing Meng Hao’s brow furrowed as it was, felt all his previous feelings of depression melting away. “If you can’t identify it, then so be it. However, you must produce all of my pills from just now and return them immediately.</p><br/><p>“Fang Mu!” he shouted, his voice echoing throughout the square. “Can you, or can you not identify the pill formula!” Meng Hao slowly raised his head. His gaze moved from the medicinal pill and came to rest on Chen Jiaxi.</p><br/>\n</div>"}