{"title": "Chapter 257: Soul Refining", "id": 257, "volume": 3, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-257-soul-refining", "volume_title": "Volume 3", "body": "<h1>Chapter 257: Soul Refining</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span style=\"\"></span></p><br/><p><strong>Chapter 257: Soul Refining</strong></p><br/><p>Meng Hao hesitated for a moment but then seemed to have made his decision.</p><br/><p>“Sir,” he said, his voice resolute, “since you seem to place such faith in me, then… I will do the concocting! I will use everything I have learned to concoct the Soul Refining Pill for your honored Sect!</p><br/><p>“As for your kindness, it will be engraved upon my mind forever. How about this. I’m sorry to say that I can’t do a bulk concoction. Concocting the pills that way might simplify things on my part, but the medicinal strength would be average, and the pills wouldn’t be as effective. Each person’s soul has slight differences. If I adjust each medicinal pill based on those differences, then I can concoct pills with maximum possible medicinal strength!”</p><br/><p>Patriarch Violet Sieve looked at Meng Hao thoughtfully for a moment. From the moment Fang Mu had entered the Sect, Patriarch Violet Sieve had not noticed anything about him that was amiss.</p><br/><p>As far as his background, his identity, his skill in the Dao of alchemy, there was nothing at all to cause him to be suspicious. He had been a bit skeptical regarding the matter with the Primordial Heavenly Replenishing Pill, but after thinking about it for a long time, he couldn’t come up with any evidence of anything fishy.</p><br/><p>The matter of the Soul Refining Pills was currently of extreme importance to the Black Sieve Sect. However, the alchemy Cultivators of the Black Sieve Sect were incapable of concocting such pills.</p><br/><p>Only the East Pill Division and the World Pill Division were skilled enough to handle matters related to souls. With the World Pill Division gone, and Fang Mu being so prominent, Patriarch Violet Sieve only had to think for a moment before nodding.</p><br/><p>“There are thirteen Conclave Disciples in the Black Sieve Sect who, because they cultivate a special type of divine ability, ended up injuring their souls. The symptoms are dementia and hallucinations, as you saw that day with Zhou Jie. Ai….” Patriarch Violet Sieve sighed, and then stared solemnly at Meng Hao.</p><br/><p>“We can rely only on you, Grandmaster Fang, to concoct the pills we need. I will arrange for the thirteen Conclave disciples to be sent here one at a time for you to examine and concoct pills for.” When he finished speaking, Patriarch Violet Sect turned to leave. Meng Hao clasped hands and bowed as he did so.</p><br/><p>Not much time passed before a bag of holding was delivered to Meng Hao. Inside were a large amount of Spirit Stones, roughly one hundred thousand. Seeing this caused Meng Hao’s heart to start pounding.</p><br/><p>In addition, there was a vast collection of medicinal plants, as well as the formula for the Soul Refining Pill.</p><br/><p>Last of all was a pill furnace. Meng Hao took it out, and immediately his eyes began to shine.</p><br/><p>The pill furnace was completely white, seemingly jade, and yet not. There were no carvings on its surface, and was a very unusual shape. Not a bit of medicinal aroma wafted out from it. However, what Meng Hao did see were strands of white colored Qi circulating around inside.</p><br/><p>“Ten Thousand Refinements furnace!” murmured Meng Hao, palpitating with eagerness. Back in the East Pill Division he had studied a jade slip with introductions to all the various types of pill furnaces. There was one type which, after having successfully concocted ten thousands batches of medicinal pills, would gain sentience because of all of the nourishment it had received from the Qi of the medicinal pills.</p><br/><p>Such a furnace would have been constructed from incredible materials to begin with. After the ten thousand concoctions, it would become even more incredible. Such pill furnaces were rarely seen in the world. Generally speaking, pill furnaces are viewed as consumable items, and will explode after one hundred uses or so.</p><br/><p>For a pill furnace to survive for ten thousand batches placed its value at an incredible level.</p><br/><p>Meng Hao took a deep breath and then swirled his hand about inside of the furnace, grasping one of the strands of Qi and pulled it out to examine. After a moment, he sighed, sounding somewhat regretful. It seemed this pill furnace had been used to concoct ten thousand of the exact same type of medicinal pill.</p><br/><p>In this case, it couldn’t quite measure up to some of the other of this type of furnace which had been used to concoct countless different types of medicinal pills. However, as far as Meng Hao was concerned, this furnace far exceeded his Blood Crane furnace.</p><br/><p>Putting away the Ten Thousand Refinements furnace, Meng Hao stood and then looked outside. A group of dozens of Black Sieve Sect disciples had surrounded the mountain and were now sitting cross-legged in meditation. Bluish light flickered around them. Clearly, once Meng Hao began his concocting, they would employ the full power of the light to create a shield around the mountain, ensuring that he wouldn’t be disturbed.</p><br/><p>Meng Hao muttered to himself for a moment, then decided to prepare for any emergencies which might arise. He lifted his Furnace Lord medallion, then branded it with some information. It immediately flickered. Moments later, Zhou Dekun flew toward him in a beam of colorful light.</p><br/><p>Having received Meng Hao’s transmitted message, he ended his alchemy lecture and immediately came to Black Welcoming Peak. Sensing the dozens of Black Sieve Sect disciples meditating in the area, he felt a bit of surprise.</p><br/><p>Meng Hao went out to meet him and explain the situation. Furthermore, he asked Zhou Dekun to stay behind as Dharma Protector, and to act as his assistant.</p><br/><p>Some time ago, Zhou Dekun would surely have refused. However, his attitude toward Meng Hao had completely changed recently. Hearing all the information, he nodded solemnly and pulled out his Furnace Lord medallion. Meng Hao felt much more reassured now, and handed over the bag of holding with all the medicinal plants.</p><br/><p>With the protection of two Furnace Lord Medallions, no matter what the Black Sieve Sect did, he would have temporary protection from any sort of Divine Sense.</p><br/><p>As far as the discarnate souls went, Meng Hao had some methods that would prevent them from noticing anything untoward. In any case, he did not plan to do anything too noticeable. In this whole matter, caution would be of the utmost importance.</p><br/><p>Not much time passed before two Cultivators appeared, carrying between them a young man in a blue robe as they hurried over.</p><br/><p>When they arrived, Meng Hao and Zhou Dekun both took a close look at the young man, and then frowned.</p><br/><p>His face was pale white, seemingly without any trace of blood. His eyes were vacant and blank, and his body was emaciated, his skin so thin that you could see the bones sticking out from within. It was obvious that his Qi passageways were not even moving. He was almost like a mortal.</p><br/><p>One of the middle-aged men supporting him said, “This is Conclave disciple Huang Zhongxi. While cultivating a secret magic, the technique backfired, weakening both his body and soul. If the Sect Elders didn’t maintain his life with magical power, he would have long since died.” The man sighed, and then bowed deeply to Meng Hao.</p><br/><p>“Muscle atrophy and a weakened body,” said Zhou Dekun, his voice soft. “The soul is spilling out and the mind is dying. This man….”</p><br/><p>Meng Hao looked closely at the young man, who clearly seemed to have lost his spirit. After a long moment, he approached the young man and placed his fingers onto his neck.</p><br/><p>He muttered to himself for a moment, then moved his hand to grasp the young man’s arm, after which he closely inspected the faint blue veins visible in his skin.</p><br/><p>“First we will concoct a Spirit Fusing Pill to see how much damage has been inflicted on his mind. Elder Brother Zhou, what do you think?” Meng Hao looked over at Zhou Dekun, who nodded.</p><br/><p>“Three Yellows grass, Seven Souls spice, Hundred Years flower….” Meng Hao slowly listed out several dozen kinds of medicinal plants. Zhou Dekun recognized many of these plants as being very rare. All were related to recovering mental faculties. He quickly retrieved the medicinal plants from the bag of holding provided by the Black Sieve Sect and began to catalyze and prepare them according to Meng Hao’s directions.</p><br/><p>Meng Hao pulled out the Ten Thousand Refinements furnace. When he saw it, Zhou Dekun’s eyes went wide. However, he knew that now was not the time to ask about it, and suddenly understood why Meng Hao attached such importance to this job….</p><br/><p>After placing the various medicinal plants into the pill furnace, Meng Hao performed a catalyzing incantation with his left hand, and then pressed a finger from his right hand directly into the forehead of the young man, opening up a small wound and retrieving a drop of blood.</p><br/><p>The drop of blood floated in front of Meng Hao for a moment, and then flew into the pill furnace.</p><br/><p>A few moments later, a black-colored medicinal pill appeared. With the flick of a sleeve, Meng Hao sent it into the mouth of the young man. About ten breaths passed, and then suddenly, the young man’s body began to tremble. He let out a miserable howl, which caused the faces of the two middle aged Cultivators to flicker.</p><br/><p>Meng Hao’s expression was the same as ever, completely calm.</p><br/><p>The blood curdling screaming lasted for the time it takes half an incense stick to burn, after which a black Qi began to emanate out from the top of the young man’s head. Within the black Qi was also a white-colored mist. The two seemed to be fused together. However, neither seemed to be able to make use of the other, and were attempting to disperse.</p><br/><p>However, it was as if some power were preventing them from separating. The more they fused together, the more they attempted to separate. From the look of it, they would only be able to stay fused together for a limited time, before completely separating.</p><br/><p>“I’m not sure what technique this person cultivated, but it caused Death Qi to enter his body, which then began to consume his life force. It was suppressed, but that will not last forever. Unless something is done to save him, he will definitely die within three months.</p><br/><p>“I, Fang Mu, can attempt to save him,” said Meng Hao coolly. “I’m fifty percent confident that I can succeed. However, his blood vessels are already in ruin. I need three generations of blood from his ancestors to create a Blood Vessel Pill. With that, I can reconstruct his blood vessels, and afterward, give birth to a new soul for him. Souls are birthed from the blood, so after this has been accomplished, I can concoct the Soul Refining Pill. At that point, success should be assured.”</p><br/><p>Hearing this, one of the middle-aged Cultivators supporting the young man turned and left. After the time it takes two incense sticks to burn, he returned and handed three jade bottles to Meng Hao.</p><br/><p>Inside were three generations of blood from the young man’s ancestors. In addition to the requisite latent talent, most Conclave disciples had ancestors who attained high positions within the Sect. As such, acquiring three generations of blood was not difficult.</p><br/><p>Meng Hao indicated for the Black Sieve Sect Cultivators to take the possessed young man inside the residence. Then he asked them to leave, and produced his Furnace Lord medallion. Zhou Dekun did the same, and immediately the glowing shield appeared to lock down the area. Outside, another shield appeared to cover Black Welcoming Mountain. Everything was sealed down.</p><br/><p>The only people in the building now were Meng Hao, Zhou Dekun and the pale-faced young man with the lost mind.</p><br/><p>Meng Hao’s expression was the same as ever as he looked thoughtfully at the young man.</p><br/><p>“This person has been possessed by a discarnate soul evading the reincarnation cycle of Heaven and Earth…. After possession, if the body does not contain its original soul, it will become like a walking corpse. Without the ability to sustain itself, the body will begin to decay in a matter of days.</p><br/><p>“Therefore, the discarnate soul is incapable of consuming the body’s original soul. Instead, it must exist as a parasite that controls the body!</p><br/><p>“Originally, there was balance, but due to some unexpected circumstances, the balance was broken. Thus, the current situation arose.” A barely detectable glitter appeared in Meng Hao’s eyes.</p><br/><p>“The discarnate soul is already damaged. The thing to do is to transform Yin into Yang… turn misfortune into the opposite! As the Demon Sealing Jade said, either seal it so that it cannot see the summer sun, or assist it with the blood will of the Demon Sealer!” Meng Hao’s eyes shone with a cold light. He wasn’t sure if the Soul Refining Pill would have any effect. But what he did know was that the will contained within his blood was the only hope the young man had of living, either now, or in the future.</p><br/><p>-----</p><br/><p><em>This chapter was sponsored by Nadav Ben Yehuda, Christopher Choi, Jiashen Chen, Rudolph Arreola, and Sunny Goela</em></p><br/>\n</div>"}