{"title": "Chapter 262: First Battle with Core Formation!", "id": 262, "volume": 3, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-262-first-battle-with-core-formation", "volume_title": "Volume 3", "body": "<h1>Chapter 262: First Battle with Core Formation!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span style=\"\"></span></p><br/><p><strong>Chapter 262: First Battle with Core Formation!</strong></p><br/><p>A shocking roar sounded out in all directions. At the same time, an icy coldness raced toward Meng Hao.</p><br/><p>Thirty breaths had passed since Meng Hao used the Furnace Lord robe displace himself for the second time.</p><br/><p>Before he could fly much further away, the azure-masked Cultivator was in hot pursuit. In this instance, the man was clearly some distance away; however the light yellow glow continued to emanate from the top of his head. In it, the image of a sword was faintly visible.</p><br/><p>It appeared illusory, but even glancing at it from this distance caused Meng Hao’s heart to tremble. An intense feeling of danger filled his heart and mind.</p><br/><p>“This guy has cultivated Core Qi!” thought Meng Hao. He was no longer a newcomer to the Cultivator World. He had seen and experienced many things, and had learned long ago of the fearsomeness of Core Formation, especially the shocking Core Qi.</p><br/><p>Back in the state of Zhao, none of the Core Formation Cultivators he had met had been able to utilize Core Qi, except perhaps for the old woman. All of this was information Meng Hao had deduced from reading the ancient records of the East Pill Division. [1. The reference to the old woman is from way back in chapter 81, when Meng Hao led the people into Patriarch Reliance’s Immortal’s Cave]</p><br/><p>“Core Qi has ever-changing forms. However, it has a nucleus which does not change. I wonder what the essence of this guy’s Core Qi is….” His heart trembled, but suddenly an idea flickered into his mind.</p><br/><p>At the same time, he unhesitatingly used the Furnace Lord’s ability to warp away to another location. As soon as his body disappeared, the sword image appeared, with its power to shake Heaven and Earth. The aura rose up, a sealing force that locked down the entire area. However, Meng Hao’s illusory body was able to slip past it.</p><br/><p>“What a nimble and crafty alchemist,” said the azure-robed Cultivator. “However, you can only use that robe three times, and it won’t take you more than fifty kilometers away. Let see… how you plan to escape next time!” The Cultivator closed his eyes, and the light yellow Core Qi spread out. The illusory sword flickered and began to rotate. After the space of three breaths, it began to hum, and the tip pointed north.</p><br/><p>The azure-masked Cultivator’s eyes snapped open, and his body flickered as he shot off toward the north.</p><br/><p>Forty kilometers away, Meng Hao reappeared. As soon as he did, blood began to seep out of the corners of his mouth. There was a sword wound on his chest, from which blood flowed out. If he had teleported away even a tiny bit slower, the sword just now would have cleaved him in half.</p><br/><p>He didn’t take the time to wipe the blood from his mouth. His body flashed like lightning as he shot away.</p><br/><p>“A phantom sword. I wonder if this guy’s personal Core Qi is a sword….” A grim look appeared on Meng Hao’s face. A Core Formation Cultivator who had not cultivated Core Qi wouldn’t cause Meng Hao to be in such a tight spot. However, Core Qi is the most powerful tool of Core Formation Cultivators. Meng Hao knew that for this azure-masked Cultivator to have cultivated Core Qi in the early Core Formation stage, indicated that he had incredibly high latent talent.</p><br/><p>After becoming a Furnace Lord, Meng Hao had done quite a bit of research in the ancient records about the Core Formation stage. Therefore, he was quite familiar with things such as Core Qi. Generally speaking, Core Qi is cultivated in the late Core Formation stage, or occasionally the mid Core Formation stage. Only a small group of Chosen can cultivate Core Qi in the early Core Formation stage.</p><br/><p>Such Cultivators are very rare. The rarest of all are those who seem to innately possess Core Qi from the moment they step into early Core Formation.</p><br/><p>Within the ever-changing forms of Core Qi is a form that does not change. This is a personal form related to the individual Cultivator, which is different for every Cultivator.</p><br/><p>Meng Hao’s face was dark as he charged forward. He popped a medicinal pill into his mouth. As it dissolved, warmth filled his body, and his speed increased.</p><br/><p>“Thirty breaths left….” The good luck charm in his hand had been warming up from the moment he began to fight the black-robed men. As of now, there were still thirty breaths left before he could activate it.</p><br/><p>When that happened, Meng Hao would disappear, and the azure-masked Cultivator would have no way to track him down.</p><br/><p>However, after eighteen breaths passed, the glow of the light yellow Core Qi filled the sky. The bitter coldness appeared again. Off in the distance, the thin frame of the azure-masked Cultivator could be seen in mid-air. The surroundings seem to be shaken into a jumble as he approached relentlessly.</p><br/><p>As soon as Meng Hao sensed his approach, he slapped his bag of holding to produce a jade pendant, which he smashed between his fingers.</p><br/><p>“I, Yang, already said that you can’t get away,” the azure-masked Cultivator said coolly. “You’re a trifling Foundation Establishment Cultivator. You should feel proud that you managed to scurry around for this long.” The sword image in the Core Qi emitted an ear-piercing scream. Emanating an icy coldness, it shot directly toward Meng Hao.</p><br/><p>Its speed was incredible, and in the blink of an eye… was directly in front of him.</p><br/><p>It sped directly toward his forehead, and was about to pierce it through. There was absolutely no time for Meng Hao to dodge. The difference between their two Cultivation bases was too great. Death approached.</p><br/><p>However, at this exact moment, a glow shot out from Meng Hao’s palm. A rippling, water-like glow flowed out to cover Meng Hao’s body. It expanded out, forming a greenish-blue shield, which the Core Qi phantom sword slammed into.</p><br/><p>The azure-masked Cultivator’s eyes went wide underneath his mask when he saw the shield. His pupils constricted, and an expression of disbelief appeared in his eyes. He was about to recall his Core Qi phantom sword, but was too late.</p><br/><p>The Core Qi phantom sword, seemingly infinitely sharp, noiselessly slammed into the greenish-blue shield. Instantly it weakened and then began to break into pieces. In the blink of an eye, it was transformed into dust.</p><br/><p>Seeing the Core Qi phantom sword disappear into powder caused the azure-masked Cultivator to give an irritated harrumph. Beneath his mask, blood oozed out of his mouth. His eyes filled with fury. He was a Core Formation Cultivator who had cultivated Core Qi. However, during this attempt to toy with a measly Foundation Establishment Cultivator, his Core Qi had been shattered, causing him injury.</p><br/><p>“Nascent Soul Cultivation blood…. Let’s see how many times you can pull that off!” The killing intent in the azure-masked Cultivator’s eyes grew more intense. He shot toward Meng Hao, his right hand flickering an incantation gesture. Magical power erupted, transforming into ten dragons and ten phoenixes, which spiralled toward Meng Hao.</p><br/><p>At the same time, the greenish-blue shield began to shrink, returning into Meng Hao’s palm and transforming into a jade pendant. This pendant was one of the spoils of his victory in the Solitary Sword Sect. It was a life-saving treasure that contained blood from the Cultivation base of Chen Fan’s Master, Zhou Yanyun, and could defend against an attack from a Nascent Soul Cultivator. [2. Meng Hao won the pendant in chapter 185. And in case you forgot, Zhou Yanyun is the guy who took Chen Fan from the Reliance Sect way back in Chapter 43.]</p><br/><p>It could defend against an attack by a Nascent Soul Cultivator, but could only be used once at a time. Defending against a Core Formation Cultivator caused its glow to weaken, and it still could be used again, just not right now.</p><br/><p>The azure-masked Cultivator’s mouth was oozing with blood. He had been injured, and the Core Qi above his head was unstable. However, he continued to advance toward Meng Hao, the ten dragons and ten phoenixes howling as they shot through the air. Suddenly, an intense killing intent appeared in Meng Hao’s eyes.</p><br/><p>He did not flee, but instead lifted his hand and pointed toward the azure-masked Cultivator.</p><br/><p>“Eighth Demon Sealing Hex!” Veins of blood shot through his eyes. As he pointed his finger out, Heaven and Earth shook, Meng Hao’s body moved, everything moved. Even the ten dragons and ten phoenixes moved. Ghost images sprang up and pressed down toward the azure-masked Cultivator.</p><br/><p>The azure-masked Cultivator’s expression flickered. The ten dragons and ten phoenixes began to tremble, as if they were being held down. The world seemed to turn upside down; everything in the area was sealed.</p><br/><p>The sealing was such that the azure-masked Cultivator seemed incapable of controlling his Cultivation base.</p><br/><p>“What magic is this?!” he said, his heart shaking.</p><br/><p>Veins of blood filled Meng Hao’s eye, and he coughed up a mouthful of blood. Using the sealing hex on a Core Formation Cultivator was an incredible load; all the blood vessels in his body seemed on the verge of bursting. Meng Hao’s killing intent soared. He flicked his sleeve, and a red powder flew out, filling the area, transforming into a red mist. The mist roiled, and as Meng Hao moved forward, it shot toward the azure-masked Cultivator.</p><br/><p>At the same time, Meng Hao placed the life-saving jade pendant into his robe. His left hand rose up, and he slashed one finger, two fingers, three fingers… all five fingers! Blood flowed down all five of his fingers, forming… the Blood Palm!</p><br/><p>When the Blood Palm appeared, the red mist around him seethed even more violently, seeming to transform into a mist of blood. The mist began to erode everything in the area; it seemed to be hyper toxic, adding thirty percent power to Meng Hao’s attack.</p><br/><p>All of this takes a long time to describe, but actually occurred in an instant. As Meng Hao’s multiple killing attacks descended upon the azure-masked Cultivator, the man’s eyes went wide. Suddenly, he was able to move again; after all, he was a Core Formation Cultivator. The Eighth Hex was beyond ordinary, but couldn’t keep the man sealed for more than two breaths.</p><br/><p>“Insignificant skill! DIE!” howled the azure-masked Cultivator. His right hand flickered in an incantation gesture and then pushed out toward Meng Hao. Instantly, a roaring filled the air, and an illusory, ten-headed dragon appeared. Snarling fiercely, it shot to meet Meng Hao’s magical attack. A boom rang out.</p><br/><p>The red mist collapsed. The Blood Palm disintegrated. Blood sprayed from Meng Hao’s mouth as he was tossed backward like a kite with its string cut. The azure-masked Cultivator was about to shoot after him. However, the man’s eyes went wide as Meng Hao, even in the midst of being seriously injured and tossed backward, suddenly slapped his bag of holding. He flicked his sleeve, sending more powder out to fill the air. It was thin, but it was enough to cause the azure-masked Cultivator to pause momentarily.</p><br/><p>Moments ago, he had prevented the blood mist from entering his lungs. However, he had still been able to sense the terrifying power of the mist. That was because he had a tiny cut on the pinky of his right hand which had been slightly infected. That tiny bit caused an intense pain to shoot through him.</p><br/><p>Even as blood sprayed from Meng Hao’s mouth and he toppled backward, his pupils began to glow with a violet light. His skin and Qi passageways also began to glow violet, making his entire body glow.</p><br/><p>This was the Violet Pupil Transformation! [3. Meng Hao learned Violet Pupil Transformation in chapter 242]</p><br/><p>Within Violet Pupil Transformation, Meng Hao’s body began to recover rapidly. Surrounded by poison mist, he glared at the azure-masked Cultivator and the Core Qi which emanated from his head. The man was stabilizing rapidly. Within ten breaths at the most, he would be able to release his Core Qi.</p><br/><p>Meng Hao didn’t hesitate a moment longer. He immediately pressed down on the good luck charm, activating the teleportation ability.</p><br/><p>Instantly, a black hole appeared, a massive mouth which consumed Meng Hao. This turn of events caught the azure-masked Cultivator completely by surprise. His face flickered, and he shot forward in pursuit.</p><br/><p>He was too late.</p><br/><p>-----</p><br/><p><em>This chapter was sponsored by Caleb Gleason</em></p><br/>\n</div>"}