{"title": "Chapter 270: Battling Core Formation!", "id": 270, "volume": 3, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-270-battling-core-formation", "volume_title": "Volume 3", "body": "<h1>Chapter 270: Battling Core Formation!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span style=\"\"></span></p><br/><p><strong>Chapter 270: Battling Core Formation!</strong></p><br/><p>The azure-masked Cultivator, who was surnamed Yang, glanced coldly at Meng Hao. Meng Hao had left a deep impression on him; it was extremely shocking that not only was he not dead, he had actually made a breakthrough in his Cultivation base. It left the man with an uncomfortable sense of danger.</p><br/><p>It was actually very humiliating. This was a late Foundation Establishment Cultivator, and yet he felt a sense of danger because of him. Beneath his mask, the man’s face was grim. Almost the same instant that the words left his mouth, he began to move forward.</p><br/><p>His foot descended, sending ripples out into the air. An indescribable roaring sound rose up which vibrated inside the hearts of the tens of thousands of Cultivators. Only the azure-masked Cultivator and Meng Hao were up in the air. The man’s first step seemed to be reverberating around throughout the entire area, but in fact, was aimed directly at Meng Hao.</p><br/><p>Meng Hao’s face was the same as ever. The roaring inside him wasn’t bothersome in the slightest. His eight Perfect Dao Pillars rotated with power of the Violet Qi from the East technique, causing Meng Hao’s body to glow with a violet aura. It spread throughout him and out, causing his azure garment to suddenly appear violet-colored!</p><br/><p>The air around him filled with a violet glow, causing him to appear anything but ordinary to the surrounding Cultivators!</p><br/><p>“Violet Qi from the East! That’s the Violet Fate Sect’s Violet Qi from the East!”</p><br/><p>“Furnace Lords from the East Pill Division can cultivate that! He really is Fang Mu!” Everyone was completely focused on what was happening. Before, there had been some who suspected Meng Hao wasn’t who he said he was. However, the buzz of conversation washed away any such doubts. After seeing the violet glow, everyone was certain about his identity.</p><br/><p>“I let you go last time, and now you’re back looking to die!” The azure-masked Cultivator gave a cold snort, then advanced further. His right hand suddenly lifted up, flashing an incantation and then pointing forward. It seemed like a very casual movement, but actually, this was not the first time the azure-masked Cultivator had faced off against Meng Hao. Their battle a year ago had left quite the impression on him. That, combined with the sense of danger he currently felt, made him feel very uneasy. Therefore, he attacked with full force.</p><br/><p>Howling sounds like those of phoenixes filled the air. In the blink of an eye, ten massive dragons appeared in front of the azure-masked Cultivator, followed by ten illusory phoenixes. Their appearance caused everything to begin to shake. They carried a frigid iciness with them that seemed capable of freezing everything around them. The azure-masked Cultivator waved his finger, sending them racing toward Meng Hao.</p><br/><p>Meng Hao took a deep breath. His Cultivation base roared into action; his Perfect Dao Pillars fully rotated emitting boundless power to fill his body. The violet glow around him grew thicker, and his eyes filled with the desire for battle.</p><br/><p>This battle was of utmost importance to him!</p><br/><p>This battle was the key to completing the great circle of Foundation Establishment!</p><br/><p>This battle was the result of a year of waiting! He had been defeated a year ago, and now, he would turn the tables and… battle Core Formation!</p><br/><p>Meng Hao’s right hand shot up, and he quickly used his thumb to slice his four fingers. Blood flowed down as he extended his hand forward.</p><br/><p>One finger, two fingers… in the blink of an eye, five illusory fingers appeared. Meng Hao’s vision turned the color of blood and a roaring filled the air as the five fingers formed together into the Blood Palm.</p><br/><p>The massive, blood-colored palm emanated a reddish glow, along with a shocking killing aura. It was filled with the power of Meng Hao’s eight Perfect Dao Pillars, as well as a violet aura, then shot forward with indescribable speed.</p><br/><p>A roaring like that of thunder filled the sky. At the same time that the palm appeared, Meng Hao bit down on the tip of his tongue and spit out some blood. The blood drop shot out to merge into the Blood Palm.</p><br/><p>“Blood Palm!” bellowed Meng Hao. His left hand lifted up and he quickly formed another massive Blood Palm, this one of a left hand. It also shot forward.</p><br/><p>The power of the two Blood Palms, filled with blood from Meng Hao’s Cultivation base, began merging together. It was a shocking sight. It only took a moment for them to reach the ten phoenixes and ten dragons. They all slammed into each other.</p><br/><p>A shockingly loud boom rattled out like thunder. The ten dragons and ten phoenixes howled. They were formed from the power of a Core Formation Cultivation base, and were virtually invincible. Meng Hao’s first Blood Palm immediately disintegrated.</p><br/><p>As it did, the blood from Meng Hao’s Cultivation base burned away. The second Blood Palm roared in. There was a massive boom as six dragons and seven phoenixes were exterminated!</p><br/><p>The remaining four dragons and three phoenixes screamed through the air toward Meng Hao, slamming into him, submerging him. However, the roaring sound soon dissipated, and the ripples in the air ceased. Everything became calm again, and Meng Hao emerged, the violet light emanating from his body rising up to the heavens.</p><br/><p>A bit of blood seeped down the corner of his mouth. His eyes were violet-colored, as were all the veins in his body, and a powerful aura emanated from him. All of this demonstrates that Meng Hao had just used his own power to stand up against the magical technique of a Core Formation Cultivator!</p><br/><p>Violet Pupil Transformation flowed rapidly through Meng Hao’s body, healing his injuries. Meng Hao didn’t care about the injuries, of course. The desire for battle grew even stronger within his eyes as he stared at the azure-masked Cultivator.</p><br/><p>Beneath the mask, the man’s face was extremely unsightly. He knew that his opponent was not ordinary, and had experienced an increase in his Cultivation base. But how could he possibly have predicted that the increase would be so shocking?</p><br/><p>This first exchange of blows between the two opponents caused the surrounding Southern Domain Cultivators to reel in shock. This included Wang Lihai, Han Shandao, and all the other Chosen.</p><br/><p>“Foundation Establishment battling Core Formation!!”</p><br/><p>“Fang Mu is in late Foundation Establishment, but his divine abilities and magical techniques are almost the same as a Core Formation expert with no Core Qi!! But… that azure-masked man from the Black Lands hasn’t utilized his Core Qi yet….” The buzz of conversation filled the air. Before, they had voiced their support for Meng Hao in the belief that he dared to battle Core Formation because he had some treasured item.</p><br/><p>The shocking scene which had unfolded in front of them, however, had nothing to do with any treasured item, but rather, a magical technique!</p><br/><p>This clearly showed that he was by no means weak. He had directly resisted a Core Formation Cultivator’s magical technique. Granted, his opponent hadn’t employed Core Qi, but even so, Meng Hao was clearly qualified to challenge Core Formation!</p><br/><p>Meng Hao advanced, lifting his right hand. As he did, the violet light emanating from his body seemed to transform into liquid, which flowed toward his hand. There, it coalesced into something that looked like a blinding, violet sun.</p><br/><p>His eyes glittered brightly as the power of his eight Perfect Dao Pillars catalyzed the Violet Qi from the East technique. As the Violet Pupil Transformation healed his body, Meng Hao used the power of Violet Qi from the East to unleash the most powerful magical technique he had learned.</p><br/><p>“Violet Qi Guillotine!” [1. Meng Hao learned the Violet Qi Guillotine (along with another technique called Violet Pupil Transformation) in chapter 242]</p><br/><p>The Qi in Meng Hao’s hand transformed into a long, violet-colored blade. The curving blade expanded out, trailing wisps of violet smoke, seeming to take all of Meng Hao’s violet aura with it. Soon, it was dozens of meters long. Suddenly, it shot forward with indescribable speed toward the azure-masked Cultivator.</p><br/><p>“What an insignificant skill,” said the azure-masked Cultivator with a cold snort. “You overestimate yourself.” To be pestered by a Foundation Establishment Cultivator, even one with clearly extraordinary abilities, was nothing more than a humiliation to this man. From the moment their battle had begun, he had felt shame.</p><br/><p>He was filled with intense desire to kill Meng Hao. A virtually imperceptible light glittered in his eyes as his Core Qi suddenly appeared. The light yellow light roiled out, and within could be seen the indistinct shape of a sword. It emitted a fierce sword aura, along with an icy coldness.</p><br/><p>Even as Meng Hao’s Violet Qi Guillotine approached, the azure-masked Cultivator’s Core Qi exploded out. The sword shot forward, transforming into a blinding beam of light.</p><br/><p>It slammed into the Violet Qi Guillotine, and a booming roiled out. The strands of Violet Qi trembled, then collapsed into pieces. The blinding sword continued on, speeding directly toward Meng Hao’s head.</p><br/><p>Meng Hao’s pupils constricted as a sudden sense of intense danger filled him. Even as the Core Qi sword destroyed the Violet Qi Guillotine and shot toward him, a greenish-blue shield appeared around him. This was none other than his protective jade pendant.</p><br/><p>A boom filled the air as the azure-masked Cultivator’s Core Qi sword collapsed into pieces. When that happened, the azure-masked Cultivator let out a grunt and slapped his bag of holding. Immediately, a black flying sword appeared in his hand. He tossed it up, fusing it with Core Qi. The process seemed to backfire somewhat, diminishing his Core Qi momentarily before it restored itself.</p><br/><p>“In terms of stances, how could I possibly meet defeat a second time!” The man’s eyes filled with ridicule as he waved his right hand. From the Core Qi above his head, the black sword shot out toward Meng Hao.</p><br/><p>“Let’s see how long your Nascent Soul Cultivation blood can resist for this time!” The black sword emitted a piercing shriek as it approached Meng Hao.</p><br/><p>Suddenly a massive boom filled the air, and Meng Hao was shoved backward. His expression never changed, though; in fact, his desire for battle grew even more intense. At the moment, Meng Hao could clearly sense the Qi inside of him that would help him break through in his Cultivation base. It was fairly bursting with activity, constantly rotating, faster and faster. He could sense the imminent appearance of his ninth Dao Pillar!</p><br/><p>“Almost there, but not quite enough battle Qi!” His eyes shining brightly as he watched the flying sword slam into the shield, which then filled with cracks. As he retreated, he slapped his bag of holding to produce a large collection of bottles.</p><br/><p>The azure-masked Cultivator’s eyes were grim as he sent another black flying sword slamming into Meng Hao’s greenish-blue shield. He wanted the shield broken as soon as possible, and to do so, had already wasted several of the specially crafted life swords.</p><br/><p>“Once your Nascent Soul blood protection is gone, you’re dead,” he said coldly. “It will only take one slash of my Core Qi sword.” His voice was filled with intense killing intent.</p><br/>\n</div>"}