{"title": "Chapter 272: Massive Cultivation Base Breakthrough!", "id": 272, "volume": 3, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-272-massive-cultivation-base-breakthrough", "volume_title": "Volume 3", "body": "<h1>Chapter 272: Massive Cultivation Base Breakthrough!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span style=\"\"></span></p><br/><p><strong>Chapter 272: Massive Cultivation Base Breakthrough!</strong></p><br/><p>This sword could rock Heaven and Earth!</p><br/><p>This sword shook the tens of thousands of Cultivators!</p><br/><p>This sword embodied the fury of the azure-masked Cultivator. His desire to kill Meng Hao could grow no higher!</p><br/><p>A sense of danger had existed in Meng Hao’s heart since the beginning of the battle. However, the moment it had appeared, the Qi strand inside of him had begun to grow rapidly. Soon he would be able to experience a Cultivation base breakthrough.</p><br/><p>Currently, Meng Hao had a very strong feeling that if he could stand up to this attack… then he would be able to have that breakthrough. The ancient battle Qi would give rise to his ninth Perfect Dao Pillar; he would be the first Cultivator in ages to be of the great circle of Perfect Foundation Establishment!</p><br/><p>Determination filled Meng Hao’s eyes. The Soul Sword approached, splitting the air as it raced toward him. Meng Hao suddenly stretched out both of his arms. His eyes were crimson as he called:</p><br/><p>“Five Clones of Blood! Come!” Five blood-colored figures suddenly appeared around him. These were none other than the five Blood Clones Meng Hao had created.</p><br/><p>The instant they appeared, ghost images sprung up around them as they transformed into their clone essence: the meat jelly skin!</p><br/><p>They transformed at almost the same instant as the azure-masked Cultivator’s Soul Sword arrived, filled with killing intent. Instead of slamming into Meng Hao’s forehead, it hit the meat jelly skin!</p><br/><p>A massive explosion filled the air. The five pieces of meat jelly skin were sent flying back, undamaged, but unable to control the force of the impact. They slammed into Meng Hao, causing him to spin backward like a kite with its string cut, blood spraying from his mouth.</p><br/><p>The Soul Sword whistled through the air, looking a bit dimmer than before. Obviously the obstruction of the meat jelly skin had shaken it; however, it was nothing more than a pause before it once again shot toward Meng Hao.</p><br/><p>Although Meng Hao coughed up some more blood, everything was actually happening just as he had predicted. He retreated backward and, having no time to wipe the blood from his mouth, drew out the Wooden Time Sword.</p><br/><p>A ferocious look covered his face, and intense killing intent radiated out. On the surface, it seemed that this battle with Core Formation was an even match; only he knew that the slightest mistake on his part would result in instant death.</p><br/><p>It was astounding that he had been able to last as long as he had. The most critical aspect of the fight had of course been when he used the jade pendant to nullify his opponent’s powerful Core Qi!</p><br/><p>The resulting temporary weakness in his opponent was what had allowed Meng Hao to hold on to this point.</p><br/><p>The resulting life-or-death battle was causing the Cultivation base breaking Qi inside him to grow. Every attack he had made caused the Qi strand to grow many times faster than it had in his previous fights with Foundation Establishment.</p><br/><p>Therefore, he would not flinch from this battle.</p><br/><p>The Time Sword had arrived in the Southern Domain; exactly how powerful it was, Meng Hao wasn’t sure. It had whittled away some of Luo Chong’s longevity, but he was merely a Foundation Establishment Cultivator, and Meng Hao had expended almost no effort in the attack. He had not even attempted to draw more power out of the sword. But now, he was up against Core Formation…. Meng Hao’s eyes filled with decisiveness; the entire battle now rested upon this treasure!</p><br/><p>As he lifted up the Wooden Time Sword, he zoned out everything around him. All of his concentration was focused upon the sword. It was as if he were the sword, and the sword were him!</p><br/><p>It was hard to tell whether his body followed the movements of the sword, or if the sword followed the indications of his will. Right now, Meng Hao had complete and utter faith in the sword. He had faith that the sword could turn the tide of death!</p><br/><p>This faith seems fantastic, but actually, after his mind entered the sword, he underwent a type of spontaneous enlightenment. It was like he was practicing cultivation… that resulted in faith!</p><br/><p>The wooden sword did not emit any kind of brilliant light, nor did it send out shocking ripples. It merely rose up and then slashed toward the incoming Soul Sword.</p><br/><p>The azure-masked Cultivator’s Soul Sword shook.</p><br/><p>For the first time in the battle, the azure-masked Cultivator sensed a profound feeling of danger. As he floated there within the soul, he suddenly thought about what had happened to Dao Child Luo Chong.</p><br/><p>And yet, he didn’t retreat. He was unwilling to retreat, because if he didn’t slay Fang Mu, then it would be hard to recall the soul. So he pushed forward at top speed, slamming into the descending Wooden Time Sword.</p><br/><p>There was no roaring sound. No boom. Instead, a shocking wind of Time rose up, filling the entire area. It was a song of ages, a glow of life that seemed like some kind of illusion.</p><br/><p>An archaic Qi filled the air and then melded with the surroundings. When the Soul Sword and the Wooden Time Sword collided, the azure-masked Cultivator’s soul emitted a blood-curdling shriek that no one but he could hear. He had suffered no wound, but instead, was filled with indescribable pain. It was as if… his life force had been injured, as if life itself had been sucked away. Suddenly, he was incomparably weak.</p><br/><p>The feeling of weakness filled him with unprecedented fear. It only took an instant for him to realize that the Wooden Time Sword had caused him to lose a full sixty-year cycle of longevity!!</p><br/><p>This was the result of only one blow of the sword. Before a second blow could land, the azure-masked Cultivator’s soul let out a fierce shout. The Soul Sword shot forward, stabbing completely through Meng Hao’s chest and then disappearing in the resulting shower of blood.</p><br/><p>Blood sprayed from Meng Hao’s mouth, and his face went pale white. His body turned into a beam of colorful light as he fell down toward the Dao Geyser, and the glowing screen.</p><br/><p>When the Soul Sword disappeared, the azure-masked Cultivator’s body shook. Blood sprayed from his mouth as his eyes opened. As he staggered backward, his body aged. He coughed up more blood. His mask suddenly fell off, revealing the pallid face of an old man, completely devoid of blood.</p><br/><p>After entering the Core Formation stage, this man had never met someone as difficult to slay as Meng Hao. He panted, his face pale. He didn’t let his guard down at all, though, and was just about to charge again. This was because he knew… the sword had not pierced through Meng Hao’s heart. At the last minute, Meng Hao had moved to the side, causing the sword to miss the vital spot.</p><br/><p>Suddenly, shock covered his face as he looked toward Meng Hao.</p><br/><p>Below, the tens of thousands of Cultivators also looked shocked. They saw everything that had happened, including the sword piercing Meng Hao through the chest. Now, though, their eyes went wide with disbelief.</p><br/><p>All eyes were fixed on Meng Hao!</p><br/><p>He had been falling, but then he stopped in mid-air. He floated there, and when his eyes opened, they radiated an icy glow. His wound was serious, and even the restorative power of the Violet Pupil Transformation wouldn’t enable him to recover in a short period of time.</p><br/><p>What was so shocking to the unmasked Cultivator and the other tens of thousands of Cultivators, had nothing to do with that. What shocked them to core was that Meng Hao was currently floating… in the exact same position as the figure on the glowing screen! Their bodies were superimposed.</p><br/><p>A powerful feeling suddenly surged through Meng Hao. He could clearly sense the Qi strand exploding out with the power to cause Cultivation base breakthrough.</p><br/><p>This explosive Qi caused incredible shock to fill all hearts: that of the unmasked Cultivator, Wang Lihai, the Black Lands Dao Children, and everyone else!</p><br/><p>A Cultivation base breakthrough in the midst of battle!</p><br/><p>Even as everyone felt shock running through them, Meng Hao took a deep breath. He had been waiting for this moment for a long time. In order to achieve this breakthrough, he had even been willing to battle against the Core Formation stage. Finally, the ancient battle Qi erupted within him. Finally, Meng Hao could sense the indescribable speed with which his ninth Dao Pillar was forming.</p><br/><p>Ten percent, twenty percent, thirty percent….</p><br/><p>He didn’t need the approval of Heaven and Earth to form his ninth Dao Pillar. However, he needed Spiritual Energy. At the moment, the eight Dao Pillars within his body were emitting shocking amounts of spiritual power, all pouring into the ninth Dao Pillar.</p><br/><p>Forty percent, fifty percent, sixty percent….</p><br/><p>Meng Hao’s aura grew more and more powerful. As it did, his body emitted a blinding violet light that shot up into the sky and filled the surroundings. A mighty pressure emerged from him, pressing down onto the tens of thousands of Foundation Establishment Cultivators, shaking their minds and spirits. Their Cultivation bases became unstable, and their Dao Pillars trembled. It was beyond their control! It was as if Meng Hao’s presence was causing all of the other Dao Pillars to bend in worship of him.</p><br/><p>It seemed as if Meng Hao were the sovereign of the Foundation Establishment stage. The massive pressure he exuded seemed capable of causing the rest of Foundation Establishment to be nothing more than mortals.</p><br/><p>The aura grew more and more intense, causing everyone's minds to reel. The heart of the now unmasked Cultivator filled with an intense feeling of danger.</p><br/><p>“I can’t let him get any stronger,” he thought, his face twisting. “Dammit, he’s in the midst of the Dao Geyser enlightenment!” Without hesitation, he began to fly toward Meng Hao at top speed.</p><br/><p>However, as he neared, a roaring sound suddenly rose up from the Dao Geyser. In front of the shocked tens of thousands of Cultivators, it erupted with boundless spiritual energy!</p><br/><p>Massive amounts of it shot up, and the nexus of the eruption was none other than Meng Hao himself. Immediately, the unmasked Cultivator was forced to stop. He didn’t dare to approach, and could only watch as Meng Hao was enveloped by the spiritual energy, and then disappeared.</p><br/><p>“Fang Mu gained enlightenment! The Dao Geyser only erupts with spiritual energy when someone gains enlightenment!!”</p><br/><p>“But… it’s erupting with so much spiritual energy….”</p><br/><p>“When Li Shiqi advanced to the Core Formation stage, there was only about thirty percent as much spiritual energy as this. It was the same with Li Daoyi. Fang Mu… just what stage is he breaking through to? There’s so much spiritual energy!!”</p><br/><p>The tens of thousands of Cultivators were in an uproar as they watched the spiritual energy exploding out and then pouring into Meng Hao’s forming Dao Pillar.</p><br/><p>It seemed as if this spiritual energy no longer belonged to Heaven and Earth, but to Meng Hao himself!</p><br/><p>Seventy percent, eighty percent, ninety percent….</p><br/><p>Finally… one hundred percent!</p><br/><p>However, just as the ninth Dao Pillar was complete, a tremor of shock ran through Meng Hao. He had assumed everything was over. He felt an unprecedented amount of power inside of him. However….</p><br/><p>A look of shock and disbelief filled his face as he noticed that the spiritual energy coursing through his body was actually forming…</p><br/><p>A tenth Dao Pillar!</p><br/>\n</div>"}