{"title": "Chapter 275: The Difference Between Meng Hao and Fang Mu!", "id": 275, "volume": 3, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-275-the-difference-between-meng-hao-and-fang-mu", "volume_title": "Volume 3", "body": "<h1>Chapter 275: The Difference Between Meng Hao and Fang Mu!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span style=\"\"></span></p><br/><p><strong>Chapter 275: The Difference Between Meng Hao and Fang Mu!</strong></p><br/><p>Meng Hao hovered in mid-air, his eyes closed, concealing the veins of blood which filled his eyes. His mind was reeling; he’d never imagined that taking out the flag of three streamers would unleash such heaven-shaking power.</p><br/><p>Furthermore… this was only one streamer. In addition, the full flag of three streamers hadn’t truly been unfurled; this was only a shadow of the treasure, projected by means of Meng Hao’s Spiritual Sense.</p><br/><p>However, even this projected power of the dilapidated flag was able to blot out the sky and cover the entire land. It completely filled the vision of the tens of thousands of Cultivators. Heaven and Earth were filled with darkness.</p><br/><p>At this moment, Heaven and Earth seemed to be split in two. Heaven was Heaven, Earth was Earth. The flag existed beneath the Heavens, an Earth of its own, and above the Earth, a Heavenly Flag!</p><br/><p>The world was covered with darkness; spirits faded, the Cosmos itself was pitch black.</p><br/><p>An indescribable pressure roiled out, and an unprecedented sense of calamity filled the hearts of all the Cultivators. It was impossible to dispel, as if an enormous boulder was crushing down onto their bodies.</p><br/><p>The entire world was suddenly plunged into deathly silence.</p><br/><p>A gray aura began to emanate from the bodies of everyone present. It curled up into the air, forming a mist, outside of which only the fluttering, dilapidated flag was visible. It twisted beneath the Heavens and the Earth, stretching out seemingly for hundreds of kilometers in all directions. It seemed as if it had replaced the Heavens, changed its will….</p><br/><p>This dilapidated flag used one side to change the Heavens, and the other side to change the Earth.</p><br/><p>A long time passed, or perhaps it was only a moment; the sky’s normal color returned, and that which covered the earth disappeared. The gray mist dissipated, and the shocking flag that had appeared in the sky… disappeared without a trace.</p><br/><p>Only Meng Hao remained floating in mid-air. No living thing existed alongside him. The Black Lands Cultivators remained, as did those from the Southern Domain. However, the appearance of the undulating flag up in the sky had caused their bodies to tremble and begin to sink down into the ground.</p><br/><p>In addition to Meng Hao, the only thing left in the sky was a headless corpse which was slowly beginning to fall down to the ground. This corpse was none other than the unmasked Cultivator!</p><br/><p>As of this moment, everything was over.</p><br/><p>In the space of a breath, all eyes came to rest on Meng Hao. And then, the astonishment in everyone’s hearts exploded out.</p><br/><p>“The azure-masked Black Lands Cultivator… is dead….”</p><br/><p>“A Foundation Establishment Cultivator just exterminated a Core Formation Cultivator. This is… this is….”</p><br/><p>“How can Fang Mu possess such battle power? He dried up the Dao Geyser! Just what kind of good fortune was he able to seize?!?!”</p><br/><p>“He’s an alchemist, a Furnace Lord of the East Pill Division. But he was able to challenge Dao Children. In the future, he’ll… he’ll definitely be the number one figure of his generation in the Southern Domain!”</p><br/><p>“More importantly, just what magical technique did Fang Mu just use? It’s a technique that can slay Core Formation!”</p><br/><p>Conversations buzzed. The Black Lands Cultivators, Luo Chong and Xu Fei, were pale-faced beneath their masks. They stared blankly at Meng Hao. Before this battle, they had believed themselves to be Chosen of Heaven; they truly thought that few people within the Foundation Establishment stage in the Southern Domain could possibly exceed them. At the most, perhaps someone existed who could match them in battle.</p><br/><p>But now, they found that it didn’t matter if it were them, or other Chosen from the Southern Domain, they were are all simply foils that accentuated the magnificence of Fang Mu.</p><br/><p>Even if they grew more powerful, even if they could be considered Chosen within their various Sects, all of them… were merely ordinary when compared to Fang Mu.</p><br/><p>Fang Mu floated like a blazing sun in the sky. He was too bright, dazzling, causing all the surrounding stars to fade. They might be unwilling, they might be unconvinced, but it didn’t matter. They had no choice….</p><br/><p>An inhuman Cultivator had appeared in the Foundation Establishment stage who could exterminate Core Formation Cultivators. Everyone of his generation had no choice but to be shaken and feel suppressed.</p><br/><p>Wang Lihai’s face was pale, and he stood there silently. Han Shandao shook his head with a bitter smile and sighed inwardly. The Golden Frost Sect Dao Child, Song Yunshu of the Song Clan, and the others of various clans who considered themselves to be at the peak of Foundation Establishment, all looked up at Meng Hao, their eyes filled with deep veneration.</p><br/><p>They were in awe of his Cultivation base, and they revered him for his status as a Furnace Lord of the East Pill Division. Because of all of this, it was impossible for them not to understand that in the future, the name of Fang Mu would be matchless in the Southern Domain. From now on, he would be a critical element within the Southern Domain!</p><br/><p>Fame had come with one battle!</p><br/><p>All eyes were fixed upon Meng Hao as he floated there in mid-air. No roars filled the air, only silence.</p><br/><p>Such silence, such deathly emptiness, usually represents intense fear….</p><br/><p>The various Cultivator’s eyes’ were filled with conflict, shock, reverence, admiration, and envy….</p><br/><p>Such a variety of looks seemed to transform into a sharpness which circulated around Meng Hao. In fact, if Meng Hao hesitated at all, it seemed like the sharpness might transform into killing.</p><br/><p>Meng Hao’s astonishing power caused many hearts to fill with a disastrous level of jealousy. This was one of the reasons he had chosen to change his appearance so often in the past, and had been so careful to not accidentally reveal himself.</p><br/><p>If it weren’t for the fact that this battle had been key to his breakthrough, then he would never have openly revealed so much about himself.</p><br/><p>The death of the azure-masked Cultivator would not be closely investigated. Neither the Black Lands Dao Children nor the azure-masked Cultivators would look into the matter too closely, not with Meng Hao at the height of his power, and surrounded by the shocked Southern Domain Cultivators.</p><br/><p>However… he was in a precarious situation. The looks being cast by many of the surrounding Cultivators caused the two azure-masked Cultivators’ eyes to glitter slightly.</p><br/><p>Their gazes came to fall on Meng Hao. So did that of Wang Lihai, Dao Child of the Wang Clan. His right hand seemed to be resting casually at his side, but only he knew that he was slowly preparing the Wang Clan’s Vermillion Bird Three Fingers.</p><br/><p>Han Shandao of the Solitary Sword Sect narrowed his eyes. Even his normally forthright face began to fill with a slightly sinister expression.</p><br/><p>The Golden Frost Sect Dao Child, as well as the Chosen from the other Sects, had all been defeated by Meng Hao recently. Their eyes began to flicker as they looked at him too.</p><br/><p>They didn’t dare to attack… although, if they knew he was Meng Hao, then surely they wouldn’t have so many misgivings. The Black Lands Cultivators would have none whatsoever, and would definitely immediately attack. However, this wasn’t Meng Hao… this was Fang Mu!</p><br/><p>A Furnace Lord from the East Pill Division of the Violet Fate Sect!</p><br/><p>As people grow in life, they form nets to fall back on. To avoid the problems that result from killing someone, you must first sever that person’s nets. That is the only way to prevent future consequences. Acting in any other way is equivalent to killing oneself.</p><br/><p>Before, Meng Hao was only Meng Hao. He had no such nets, and as such, anyone who wished to kill him could simply attack.</p><br/><p>But now, his identity as a member of the East Pill Division was his biggest safety net.</p><br/><p>Meng Hao gained enlightenment of this when he had first joined the Reliance Sect. Having someone to rely on is in fact one of the greatest safety nets that can exist in a person’s life.</p><br/><p>Wang Lihai didn’t make a move. However, one of the other Wang Clan Chosen suddenly took a step toward Meng Hao.</p><br/><p>That step seemed to fall upon the hearts of the surrounding Cultivators. Luo Chong suddenly moved!</p><br/><p>The two Black Lands azure-masked Cultivators also began to advance…</p><br/><p>Amidst the stifling deathly silence, the seemingly peaceful scene was actually filled with incredible danger. As Meng Hao floated in mid-air, his closed eyes suddenly snapped open.</p><br/><p>The instant this happened, the Wang Clan Chosen stopped in his tracks. Luo Chong also stopped moving, as did the two azure-masked Cultivators.</p><br/><p>Everyone looked at Meng Hao, their looks even more thoughtful than before.</p><br/><p>His expression was the same as ever, cold and detached. The coldness of his gaze was even thicker than before, and deep within could be sensed an aura of ridicule.</p><br/><p>Not even the slightest injury could be seen on his body, making it seem as if this wasn’t his first time exterminating a Core Formation Cultivator!</p><br/><p>He suddenly spoke, his voice cool: “My enlightenment from the Dao Geyser included a divine ability. I am a Furnace Lord of the East Pill Division, unfamiliar with magical battle. However, because of the profundity of the enlightenment, I was unable to control myself. Fellow Daoists from the Black Lands, please forgive me.” With that, he waved his hand, causing his azure-colored robe to disappear. It was replaced with the alchemist’s robe of a Violet Fate Sect Furnace Lord, black, with a faint violet aura glowing within. The sight of it instantly caused everyone to be filled with shock.</p><br/><p>He floated there in mid-air, looking coolly about at the crowds of people.</p><br/><p>It seemed as if an appointed time had arrived. The two azure-masked Cultivators gave deep looks to Meng Hao, then turned and transformed into beams of light that shot off into the distance. Apparently, Meng Hao’s identity as a Furnace Lord was their greatest misgiving. It was well known that anyone who trifled with one of Pill Demon’s alchemists could arouse the wrath of the entire Sect!</p><br/><p>Luo Chong and Xu Fei gave a final glance at Meng Hao, and then departed.</p><br/><p>The departure of the Black Lands Cultivators caused the previously stifling atmosphere among the Southern Domain Cultivators to slowly relax. The pressure eased, and they began to grow excited. Even as everyone began to discuss this Fang Mu, Meng Hao clasped hands and bowed deeply to everyone.</p><br/><p>“Many thanks for your assistance, Fellow Daoists,” he said. “I, Fang Mu, am very moved. Now, I need to deeply analyze and meditate upon my recent enlightenment. Furthermore, I recently received orders from the Sect, calling me back. Next time you are able, call on me in the Violet Fate Sect, I will most happily receive and entertain you.” With that, he gave another deep bow. Most of the surrounding Cultivators understood that as a Foundation Establishment Cultivator, it was an astonishing thing to have slain a Core Formation Cultivator. Of course, the divine ability which had appeared was a projection of some magical item that no one had actually seen. Clearly, he had incredibly mysterious magical techniques and divine abilities at his disposal.</p><br/><p>The confidence instilled by this achievement in battle would give birth to an ever-present confidence. It would help in everything in the future, be it in terms of cultivation or magical techniques.</p><br/><p>As they digested his words, Meng Hao once again clasped hands to the Dao Children of the various Sects and Clans, thanking them deeply for their assistance. Clearly having no intention of staying behind any longer, he turned into a beam of light that shot off into the distance.</p><br/><p>Wang Lihai and the others frowned as they watched Meng Hao disappear. They had no choice but to eventually just look away. Now as before, there was no way for them to truly understand the level of Meng Hao’s profundity. Because of the Violet Fate Sect, it was impossible for them to make any rash moves. They could only sigh inwardly.</p><br/><p>Meng Hao flew away at top speed. After a day passed, his face was completely pale, and he coughed up a mouthful of blood. His aura was incredibly weak. Gritting his teeth, he found the mountain where… he had just recently spent so much time in secluded meditation.</p><br/><p>He entered the Immortal’s Cave, coughing up more blood, and immediately sat down cross-legged. Popping a medicinal pill into his mouth, he waved his sleeve, sending out a vast amount of poison pills. They immediately turned into a mist which completely surrounded him.</p><br/><p>-----</p><br/><p><em>This chapter was sponsored by Samaksh Gollen, Victor Mbulungeni, Dainius Gliebus, and Caleb Gleason</em></p><br/>\n</div>"}