{"title": "Chapter 296: Another Encounter with Ji!", "id": 296, "volume": 3, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-296-another-encounter-with-ji", "volume_title": "Volume 3", "body": "<h1>Chapter 296: Another Encounter with Ji!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span style=\"\"></span></p><br/><p><strong>Chapter 296: Another Encounter with… Ji!</strong><span></span></p><br/><p>The mark looked like a magical symbol. It didn’t exist on top of his skin, but rather inside his flesh. Meng Hao was not unfamiliar with it; the moment he had reached Foundation Establishment, he had seen this exact same mark.</p><br/><p>Today was the second time!</p><br/><p>Meng Hao looked at the mark, his mind buzzing.</p><br/><p>After a long time, the shaking disappeared. The strange sign which had filled half of the Southern Domain caused even more attention to be drawn to the Immortal’s corpse.</p><br/><p>Meng Hao stood there within his Immortal’s cave for a long time before he lifted his head. His eyes were now filled with a sharp light.</p><br/><p>“Just… who is he? Why was I able to see him that year? Why did he fall into the Southern Domain? And why is he able to affect my blood flow, and give rise to this mark…. Was the mark placed upon me by him that year? Or was it part of me all along, there within my flesh from the beginning?” Meng Hao silently thought about the night his father and mother went missing, and the violet wind which had blown outside.</p><br/><p>If Meng Hao remembered correctly, when that wind arose, it had swirled around his body. He remembered that it was no ordinary wind, but that it contained some type of power.</p><br/><p>Meng Hao thought for a long time, all the way until it was dark outside. A bright light began to shine in his eyes, as well as resolve.</p><br/><p>“Regardless of whether this person’s words are true or false… I’m going!” Determination gleamed in his eyes. Great reward only comes by taking risks. Cultivators cultivate self-confidence! When a decision has been made, it must be pursued with determination, and without the slightest thought of wavering!</p><br/><p>He flicked his right sleeve as he walked out of the Immortal’s cave.</p><br/><p>Several days later, the sixth group of Cultivators left the Violet Fate Sect. It consisted of thirty people, who transformed into thirty prismatic beams that shot off into the air. In front of this group was none other than Meng Hao.</p><br/><p>He wore the robe of a Violet Furnace Lord, and his long hair whipped about behind him as he shot forward. All of the people behind him looked at him with expressions of veneration, regardless of whether they were from Violet Qi Division or the East Pill Division.</p><br/><p>Together, they shot off into the distance at top speed.</p><br/><p>Meng Hao was quiet during the entire trip. He didn’t speak; within his mind spun the echoing beckons of the Immortal’s corpse.</p><br/><p>This sixth group of Violet Fate Sect Cultivators teleported three times and spent half a month before arriving in the vicinity of the Rebirth Cave. Once more during that time period, the vibration echoed out.</p><br/><p>When the vibration hit them, everyone dropped to the ground, where they sat cross-legged. Only Meng Hao floated in mid-air, looking off into the distance. Once again, he felt the beckoning.</p><br/><p>“Come to me…. I’m here… waiting for you…. All the truth… all the answers….”</p><br/><p>Meng Hao’s mind spun. Of the hundreds of thousands of Cultivators in the region of the Rebirth Cave, the voice within the beckons could only be heard by Meng Hao. His eyes glittered even more relentlessly than before.</p><br/><p>There are three Danger Zones in the Southern Domain: the Primordial Dao Lakes, the Ancient Temple of Doom and finally, the Rebirth Cave. At a glance, it looked like an enormous depression in the ground. Multitudinous volcanoes could be seen in the area, so many that they were impossible to count. They seemed to never end.</p><br/><p>What was visible was the black sky, and the thick black fog that covered everything.</p><br/><p>This was the region of the Rebirth Cave.</p><br/><p>According to the legends, people who were nearing death could enter the Rebirth Cave at the right moment, and if they succeeded, could get a chance to live another life!</p><br/><p>Whether this was true or false, since ancient times, many, many almighty Cultivators, unwilling to pass into death, had entered the Rebirth Cave. Throughout the countless years, only three people had ever emerged successfully.</p><br/><p>Without exception, after leaving the Rebirth Cave, those three people never once talked about what had happened inside. Eventually, they had disappeared, never to be heard from again.</p><br/><p>Despite that, the legends regarding the mysteries of the Rebirth Cave continued to grow more and more exaggerated. Regardless of anything, stories about the Rebirth Cave had been circulating for tens of thousands of years, which was sufficient to show that… it had some astonishing properties.</p><br/><p>Meng Hao understood that by proceeding forward, he would be entering the region of the Rebirth Cave. Upon entering, the level of danger would be extreme.</p><br/><p>As for the Immortal’s corpse, it had fallen directly in front of the Rebirth Cave, no more than fifty kilometers away.</p><br/><p>Currently, the vibrations were slowly fading away. As they did, one figure after another shot up from the ground into the air.</p><br/><p>Currently, hundreds of thousands of Cultivators from all over the Southern Domain were gathered in a thousand kilometer radius of the Rebirth Cave, forming a perimeter around it. In this area, the Cultivators had established temporary strongholds representing the various Sects and Clans.</p><br/><p>Every stronghold contained members of the elder generation of the various Sects. It seemed that every day, more people from a variety of Sects entered this huge region. Many would face the danger and approach the corpse, hoping to seize some good fortune. Some came back, some never did.</p><br/><p>Because of the accumulation of so many hundreds of thousands of Cultivators, it was impossible to avoid the eruption of various feuds. Therefore, magical battle was not uncommon, and every day at least a few people were killed.</p><br/><p>As for the great Sects and Clans, they were under the protection of the elder generation; there was a bit of chaos, but it was kept under relative control.</p><br/><p>After the shaking vibration faded away, Meng Hao led the group of dozens of Violet Fate Sect Cultivators into the area. This of course attracted quite a bit of attention, and many people looked over to see what was happening.</p><br/><p>When they saw Meng Hao, and recognized his Violet Furnace Lord’s robe, a great buzz of discussion rose up.</p><br/><p>“That’s Fang Mu from the Violet Fate Sect!”</p><br/><p>“That’s the Dao Child of the East Pill Division, Fang Mu!”</p><br/><p>Meng Hao heard some of these words, but his expression was always the same as ever. He continued onward, leading his group further inward toward the area near the Rebirth Cave.</p><br/><p>As they flew along, he scanned the area with Spiritual Sense. He could immediately sense a vast amount of Cultivators there. There weren’t as many as outside the inner perimeter, perhaps only around ten thousand.</p><br/><p>Compared to the area outside, inside the perimeter, the fog was denser, thicker, exerting pressure on Spiritual Sense and making it more difficult to hear and see.</p><br/><p>Eventually, Meng Hao caught sight of an enormous basin. Hovering in mid-air above the basin was a roiling black fog that rose up high into the sky.</p><br/><p>Beneath the fog, the basin had a perimeter of about 500 kilometers. It was enormous, and within that enormity, was the Southern Domain’s mysterious Rebirth Cave.</p><br/><p>This was the nucleus of the Rebirth Cave. Surrounding this nucleus were a dozen or so pillars of light which rose up into the sky. Each and every pillar undulated shockingly, making it impossible for anyone to not notice them.</p><br/><p>They embodied shocking power; the existence of these more than ten pillars of light made the huge area surrounding the Rebirth Cave seem a bit less dangerous.</p><br/><p>Many of the strange creatures that lived in the area hid away, and would not emerge to harm people.</p><br/><p>Each one among the dozen or so pillars of light was fixed at a stationary point. There, large groups of Cultivators sat cross-legged, meditating. Only the five great Sects and three great Clans were capable of creating strongholds like this near the nucleus of the Rebirth Cave region.</p><br/><p>As Meng Hao approached, he immediately caught sight of one of the pillars of light that was violet-colored, and emanated an oppressive, pressure-filled energy. Because of this violet pillar of light, not a scrap of black fog could be seen anywhere nearby. Even the ground was a violet color because of it.</p><br/><p>Wu Dingqiu [1] was there inside, as well as Chu Yuyan, An Zaihai, Lin Hailong, and the other Cultivators from the Violet Qi Division. There were roughly a hundred people, all sitting cross-legged, eyes closed in meditation.</p><br/><p>Included in the number were two old people, meditating cross-legged in the very center of the glowing pillar. They wore long, white robes, and their countenances were ancient. Meng Hao could sense a fearsome pressure contained within their bodies.</p><br/><p>Wu Dingqiu was obviously much weaker than these two old people, by about an entire stage!</p><br/><p>“Spirit Severing stage….” Meng Hao took a deep breath. As he continued toward them, his eyes flickered about, glancing toward the other pillars of light. He saw the Solitary Sword Sect, the Black Sieve Sect, the Golden Frost Sect, the Blood Demon Sect, as well as Cultivators from the three great Clans including Han Bei, Chen Fan, Zhou Jie, Wang Lihai, Li Daoyi and others. [2. Okay here’s a quick refresher. Han Bei, sexy schemer. Chen Fan, protective talkative brother. Zhou Jie, possessed Dao Child. Wang Lihai, brother of Wang Tengfei. Li Daoyi, fought Meng Hao in the Blood Immortal Legacy]. Meng Hao’s gaze finally came to fall upon a white-robed woman in the Black Sieve Sect group.</p><br/><p>Xu Qing.</p><br/><p>He stared at her for a moment and then looked away. There were other pillars of light. One was orange-colored, and filled with an air of potency and dignity. Sitting cross-legged within were a few dozen Cultivators upon whose skin were tattooed depictions of various totems. They were tall, and did not look like people from the Southern Domain.</p><br/><p>“Western Desert Cultivators….” thought Meng Hao, his eyes narrowing. This wasn’t his first time seeing Cultivators from the Western Desert. The first time he’d arrived in the center of the Southern Domain, he’d seen these strange, tall Cultivators.</p><br/><p>Meng Hao also knew that the actual name of the Western Desert was the Barbarian West. In fact, that was the name that was written on the map he’d seen years ago. However, the people from the Western Desert felt that the word Barbarian was too belittling, and therefore took up the name Western Desert. At one time that had corresponded with the original name of the Northern Reaches, which had long ago been called the Northern Desert. Despite this, there were still people who called them Western Devils.</p><br/><p>As he proceeded onward, Meng Hao’s gaze fell upon two other pillars of light. One of them glowed with a light as blue as the sky. Next to it, a large flagpole had been stabbed into the ground. Floating in the wind was a flag embroidered in gold with the character…</p><br/><p>Ji!</p><br/><p>When he saw it, Meng Hao’s pupils constricted, and he began to breathe heavily. There were over ten Cultivators sitting beneath the pillar of light, meditating. One of them was a young man with thin lips, a lofty air, and impatience written on his face. He seemed to have sensed Meng Hao’s gaze. He turned and looked over, then gave a cold snort. Contempt flickered within his eyes.</p><br/><p>The cold snort immediately entered Meng Hao’s mind, causing him to pause momentarily. He quickly rotated his Cultivation base to disperse the uneasy feeling.</p><br/><p>“Core Formation stage.” His expression was the same as usual as he looked away. The young man’s eyes flashed as he examined Meng Hao for a moment, and then ignored him.</p><br/><p>Meng Hao next looked at the other beam of light, which was a greenish color and emanated terrifying power. The Black Sieve Sect’s pillar was also greenish, but this color was different, deeper.</p><br/><p>Beneath the green pillar, three people sat cross-legged. One was a middle-aged woman, another was an old person, and the third was young woman. The young woman wore a green robe, and her long hair cascaded down over her shoulders. She was rather beautiful, but she also possessed a cold, proud air. She seemed to be the kind of person that had a short temper, and wasn’t easy to approach.</p><br/><p>As he looked over everyone, Meng Hao stayed calm and collected. He led his group directly toward the Violet Fate Sect’s violet pillar of light, and as he neared, quite a few people opened their eyes vigilantly. When they saw Meng Hao, expressions of respect filled their faces.</p><br/><p>As for Chu Yuyan, a complicated look appeared in her eyes. Ye Feimu simply lowered his head silently.</p><br/><p></p><div class=\"footnotes\"><ol><li><span id=\"footnote-1\">Wu Dingqiu was the guy who made the bet with Eccentric Song about the spear. He was also present when Grandmaster Eternal Mountain visited the Violet Fate Sect, and Meng Hao competed against Fatty<i class=\"fa fa-hand-o-left\"></i></span></li><li><span id=\"footnote-2\">Okay here’s a quick refresher. Han Bei, sexy schemer. Chen Fan, protective talkative brother. Zhou Jie, possessed Dao Child. Wang Lihai, brother of Wang Tengfei. Li Daoyi, fought Meng Hao in the Blood Immortal Legacy<i class=\"fa fa-hand-o-left\"></i></span></li></ol></div><br/>\n</div>"}