{"title": "Chapter 303: The Bloodline of the Ji Clan", "id": 303, "volume": 4, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-303-the-bloodline-of-the-ji-clan", "volume_title": "Volume 4", "body": "<h1>Chapter 303: The Bloodline of the Ji Clan</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span style=\"\"></span></p><br/><p><strong>Chapter 303: The Bloodline of the Ji Clan</strong></p><br/><p>“Xu Qing!” Li Daoyi’s eyes glowed brightly. He was not unfamiliar with Xu Qing; back in the western region of the Southern Domain, he had fought against her.</p><br/><p>During that fight, he had suffered a great defeat!</p><br/><p>Later, he was able to make a breakthrough and enter the Core Formation stage, but the loss that day had been extremely irritating. Seeing Xu Qing again now caused his eyes to fill with coldness. Killing intent flickered inside of him, and he lifted his hand. Power of Core Formation emanated out.</p><br/><p>Xu Qing’s expression never changed from being cold. Her eyes glittered as a white colored Qi emanated out from her body, transforming into threads which shot toward Li Daoyi.</p><br/><p>A boom echoed out immediately. Meng Hao’s eyes were closed, and he was completely focused on rotating his Cultivation base. His third Dao Pillar began to melt, sending Violet Qi surging through his body, permeating it. Meng Hao’s entire body was now violet-colored.</p><br/><p>Xu Qing and Li Daoyi were locked in a magical battle. Xu Qing obviously had the upper hand; in reality, in terms of Cultivation base, she had fused with Matriarch Phoenix, making it impossible for Li Daoyi to even compare to her. She was essentially at the level of a Sect Patriarch.</p><br/><p>However, even if Xu Qing actively attempted to meld, she would be unable to do so in a short period of time. Currently, she was only able to wield about one percent of the full power. Even that small amount still placed her above Li Daoyi.</p><br/><p>No matter what methods Li Daoyi employed as they fought, Xu Qing’s expression was the same as ever. Were she able to leave Meng Hao’s side, to pursue Li Daoyi and use all the magical techniques she possessed, then she would easily be able to defeat him.</p><br/><p>However, she didn’t want to take such a risk. She was worried that if she fully engaged in the battle, Li Daoyi would use some trick or another to affect Meng Hao’s Cultivation base.</p><br/><p>As the two of them fought, Meng Hao’s second Dao Pillar began to melt, and after it disappeared, the first. In the space of ten breaths, the Flying Rain-Dragon Core was visible in his Core Sea. It immediately moved into the violet mist.</p><br/><p>The Demonic Core was already small; after merging into the violet mist, the mist globule began to rotate even faster. It was very obviously congealing into a Core at this point.</p><br/><p>It was at this very moment that Ji Hongdong appeared off in the distance, flying in their general direction at high speed. His eyes were actually closed, as if he were following the trail of an aura.</p><br/><p>His face was pale; obviously he had been injured while battling with the young Fang woman. Having shaken her off, here he was now, an intense light glittering underneath his eyelids.</p><br/><p>“I’m not sure how that lowbrow Cultivator managed to pierce the Immortal Sense and acquire the Immortal Qi that the Patriarch talked about. Well, it doesn’t matter. With his Cultivation base, he won’t be able to absorb it very quickly. As long as I’m able to kill him, then I can take the Immortal Qi and absorb it myself. Once I do, then I’ll definitely be able to be promoted out of the Quasi-Array. Then I can be a true member of the Clan Array!” As he reached this point in his train of thought, he opened his eyes. They gleamed with intense anticipation.</p><br/><p>He suddenly turned his head and looked toward Meng Hao. “Found you!” he said, flying directly toward him.</p><br/><p>As for Meng Hao, cracking sounds could be heard within his body. The violet mist globule within his Core Sea was shrinking. As it did, it began to grow more solid; it emanated a brilliant violet light as a thick exterior began to form.</p><br/><p>Once it was completely solid, the Violet Core formed, then Meng Hao’s Cultivation base would rocket up. He would leave Foundation Establishment and enter Core Formation, and the ranks of the truly powerful experts!</p><br/><p>Ten percent, twenty percent, thirty percent…. The rotation of the violet mist globule inside of him began to slow, and looked more and more solid. It was shrinking also; all that remained was about the size of a fist.</p><br/><p>It didn’t take long before the Violet Core truly began to emerge. As of now, Meng Hao could feel a throbbing power pulsing through him; far, far greater than anything he had felt before.</p><br/><p>This was not a normal Violet Core, but one formed from the ten Dao Pillars of a Perfect Foundation. The moment it appeared, it became the most powerful Violet Core ever seen in the tens of thousands of years that made up the history of the Violet Fate Sect.</p><br/><p>This level of power was unheard of. Furthermore, after merging with the Demonic Core of the Flying Rain-Dragon, the Violet Core was even more brutally powerful.</p><br/><p>No one in the Violet Fate Sect had even come close to touching such a level of power; even Reverend Violet East, when he was in the Core Formation Stage, had never reached this astonishing level.</p><br/><p>In addition to all that… Meng Hao’s Violet Core was formed with the assistance of the breath of Immortal Qi. This Core… was something that had never been seen in the Violet Fate Sect, the Southern Domain, the Western Desert, the Northern Reaches or the Eastern Lands!</p><br/><p>Forty percent, fifty percent, sixty percent…. Meng Hao could sense the aura of the violet mist within him growing stronger. His heart began to beat faster, his body grew stronger, the range of the Spiritual Sense grew greater. He could sense all these constant changes.</p><br/><p>It was at this moment that Meng Hao suddenly caught sight of Ji Hongdong with his Spiritual Sense. He approached rapidly; in one breath, he was far off in the distance, a moment later he was upon Meng Hao and the others.</p><br/><p>At the same time that Ji Hongdong appeared, a boom filled the air. Li Daoyi coughed up some blood as he staggered back several paces to stand next to Ji Hongdong. He glared at Xu Qing, his eyes full of murder.</p><br/><p>Xu Qing’s face was a bit pale, but her expression was cold as she stared at Ji Hongong.</p><br/><p>“Excellent job, Li Daoyi,” said Ji Hongdong coolly. “I will notify my Clan regarding this matter, and tell them that your Li Clan performed a meritorious deed.”</p><br/><p>“Please don’t be so polite, young master Ji. It is my honor to be able to assist the Ji Clan. Young master Ji, please allow me to take this woman away. She has attacked me twice so far, and today I plan to help her understand what it means to live a life worse than death!” A vile, licentious look shone in his eyes. He liked cold women like this.</p><br/><p>“Do as you wish,” replied Ji Hongdong coolly. He glanced at Xu Qing, then looked at Meng Hao, who was still sitting there cross-legged, meditating.</p><br/><p>Looking at his Cultivation base, and seeing that he was forming his Core, caused a look of derision to appear in his eyes.</p><br/><p>“If Fang Yu hadn’t appeared, I might have been fooled by you. Since you have the Immortal Qi in your body, then I have no choice but to slay you and refine it out of your corpse.” With that, he took a step forward. A massive power emerged from his body. An image appeared behind him, that of mountains and rivers and a great land. It was a strange scene; it made it seem as if he were an emperor, and that the land he stepped on was part of his empire.</p><br/><p>As he proceeded forward, the violet mist within Meng Hao reached eighty percent completion, and headed toward ninety percent. The powerful aura within him didn’t emanate out from him at all. Instead, it surged throughout his body, filling him.</p><br/><p>Xu Qing set her gaze, and then stepped in front of Meng Hao to block Ji Hongdong’s way.</p><br/><p>“You overestimate yourself!” said Ji Hongong with a cold snort. He took another step, and the massive image behind him of the mountains and rivers suddenly expanded, exerting pressure down into Xu Qing.</p><br/><p>This was the manifestation of Ji Hongdong’s Core Qi. The mountains and rivers made him seem like an emperor exuding a royal aura. Xu Qing’s face went pale under the pressure; her eyes suddenly shined with a blackness that completely covered over the whites of her eyes. Anyone who looked at her eyes now would see only dark emptiness.</p><br/><p>Suddenly, the aura emanating from her body was no longer white, but black. Strands of blackness emerged, transforming into a host of vicious, demonic faces. The faces congealed together above her face to form into… a black phoenix!</p><br/><p>It immediately charged directly toward the royal will embodied by the mountains and rivers.</p><br/><p>Ji Hongdong’s eyes narrowed, shocked by what had just happened. A boom rattled out, and blood sprayed from Xu Qing’s mouth. She staggered backward, then grabbed Meng Hao. It was the same way she had grabbed him all those years ago when she took him from Mount Daqing. [1. This, of course, happened in chapter 1] Holding him at her side, she shot off into the distance.</p><br/><p>Her face was pale, and blood seeped from the corners of her mouth. Just now, she had used the power of Matriarch Phoenix, a power which did not fully belong to her; as a result, she had significantly injured herself.</p><br/><p>She was willing to take the risk, but in truth, she could not employ too much of the power, only a bit of it.</p><br/><p>At the same time as she sped away with Meng Hao, Ji Hongdong, his face pale white, looked down and pulled a damaged jade pendant out from near his chest.</p><br/><p>His face was unsightly, his eyes filled with killing intent as well as astonishment.</p><br/><p>“Just now, she erupted with power similar to that of a Nascent Soul Cultivation base. She even crushed my life-saving jade…. This girl’s aura… is interesting. It must be the power of a discarnate soul. Now I just have to see which discarnate soul of the Southern Domain dares to take shape before me, Ji Hongdong of the Ji Clan. Who is it exactly that dares to attack me!?” A cruel smile twisted his face as he shot forward in pursuit.</p><br/><p>Li Daoyi followed him, sighing inwardly. Now he knew that Xu Qing hadn’t been using her full power during their fight. If she had, he would without a doubt be dead already.</p><br/><p>“Obviously, she didn’t use her full power when she attacked just now. That would cost her too much….”</p><br/><p>Meng Hao couldn’t physically see what was happening, but because of his Spiritual Sense, he was aware of all the changes in the situation. In fact, things were even clearer than if he had seen it with the naked eye. He saw Xu Qing’s blood, saw her risking her life.</p><br/><p>He felt a stab of pain in his heart, and waves of anger surged up in his heart. By the time she coughed up blood for the third time, the violet mist inside of Meng Hao was ninety percent complete and closing in on one hundred percent.</p><br/><p>“Elder Sister,” he said, opening his eyes. “Put me down, okay?”</p><br/><p>Xu Qing didn’t say anything. She ignored him, speeding forward as quickly as possible.</p><br/><p>He looked at her, warmth filling his eyes.</p><br/><p>Suddenly, a whistling sound could be heard as Ji Hongdong appeared, flying through the air. By now, the walls in the area were more than half crumbled to pieces. It wouldn’t be long before they completely disintegrated.</p><br/><p>When Ji Hongdong appeared, a look of determination appeared in Xu Qing’s eyes. She waved her left hand, and her body trembled as massive amounts of black aura shot out, forming into the shape of a black phoenix, filled with countless discarnate souls. Shrill screams filled the air as it shot toward Ji Hongdong.</p><br/><p>“Are you blind?!” said Ji Hongdong with a cold snort. “Do you really dare to offend the bloodline of the Ji Clan?!” He continued forward without hesitation.</p><br/><p>-----</p><br/><p><em>This chapter was sponsored by Bornemisza Peter, Justus Saman Zokaie, Dennis Andersen, Jiashen Chen, Alex Facklam, and ExtremeGTP</em></p><br/>\n</div>"}