{"title": "Chapter 315: The Immortals Cave of Huang Daxian", "id": 315, "volume": 4, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-315-the-immortals-cave-of-huang-daxian", "volume_title": "Volume 4", "body": "<h1>Chapter 315: The Immortals Cave of Huang Daxian</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span style=\"\"></span></p><br/><p><strong>Chapter 315: The Immortal’s Cave of Huang Daxian</strong><span> [1]</span></p><br/><p>It was dusk in the Black Lands. The sky was pocked with darkness, the land beneath was pitch black. Everything felt desolate.</p><br/><p>No mortals could be seen; it was difficult for them to survive in an environment like this. This area was occupied for the most part by Cultivators. If you did occasionally encounter mortals, they would be descendants of Cultivator Clans, powerfully built, with hearty Qi and blood.</p><br/><p>When Meng Hao entered the Black Lands, he looked back for a moment, and a flash of suspicion appeared on his face. For some reason, he had the feeling that upon entering this land, there was some sort of invisible thread attached to his body that had been covered up.</p><br/><p>Before entering the Black Lands, he had been unable to detect it; however, as soon as it was covered up, he could.</p><br/><p>Meng Hao muttered to himself thoughtfully as the vines carried him forward at high speed. Moments later, he cleared his thoughts. His eyes glittered as he cast his Spiritual Sense about.</p><br/><p>The region three hundred meters in all directions suddenly appeared in his mind.</p><br/><p>“I need to find a quiet place where I can recuperate…. I remember that Zhou Dekun[1. Zhou Dekun was the old Furnace Lord from the Violet Fate Sect that Meng Hao initially hated but eventually befriended. He was kidnapped by Black Lands Cultivators and never seen or heard from again.] was taken to the Black Lands…. Furthermore, there should be information about the Eyeless Larva[2. The Eyeless Larva was talked about mostly in Chapter 165] here. I wonder if I’ll be able to refine one.” Meng Hao once again produced Ji Hongdong’s bag of holding. The magical symbol on it was by no means weak. Meng Hao was able to suppress it slightly, but was unable to open the bag. He could tell that if he was able to suppress the seal for long enough, then he would be able to.</p><br/><p>A long time passed, after which Meng Hao once again closed his eyes. He allowed the vines to continue forward without rest. Soon, more than a month had passed.</p><br/><p>Occasionally he would encounter some Black Lands Cultivators. They were for the most part skinny and bony, with an intensely fiendish aura. They were usually alone, or rarely, in groups of three or five. To Meng Hao, most of them seemed like lone wolves.</p><br/><p>This was very different than the Southern Domain.</p><br/><p>It seemed people here were used to treading the line between life and death. The only way to ensure continued existence was to soak one’s hands in blood.</p><br/><p>However, despite their ferocity, when the local Cultivators saw Meng Hao, their pupils would constrict. Meng Hao’s white hair was very conspicuous as it billowed around his head. Combined with the paleness of his face, it left people with a very ghastly impression.</p><br/><p>When you added the vicious-looking vines, the entire picture was one of powerful maliciousness. Meng Hao emanated the aura of Core Formation, as well as the reek of blood. Anyone who saw him would immediately come to the conclusion that he was someone not to be trifled with.</p><br/><p>Even some Cultivators of the same level as he, after sensing the aura of his Cultivation base, would hesitate for a moment and then get out of his way.</p><br/><p>In the Black Lands, killing was a constant part of life, and it was common to see bodies laying about.</p><br/><p>As Meng Hao traveled, he saw dozens of vicious magical battles between Cultivators. He also saw quite a few deaths. Based on his observations, he quickly came to a better understanding of the Black Lands.</p><br/><p>What he found the strangest was that after a month passed, despite his constant vigilance, no one from the Ji Clan came in pursuit of him. He couldn’t help but think of the invisible thread that had been covered up the moment he entered the Black Lands.</p><br/><p>He hesitated for a moment, uncertain of exactly what was going on. “Could it be that the thread appeared after I killed Ji Hongdong? Is it a mark that the Ji Clan can use to track me down? If that’s the case, why would it be covered up when I entered the Black Lands?”</p><br/><p>Time slowly passed. Soon, another month had gone by. Compared to the Southern Domain, the Black Lands wasn’t very large. As he traveled, though, Meng Hao found that there weren’t very many cities, which made everything seem much further spread out.</p><br/><p>Nearly everything was empty and desolate. The soil was pitch black, permeated with oppressive, deathly stillness. Even fewer places were filled with spiritual energy. Thankfully, Meng Hao currently didn’t have any strong requirement for spiritual energy. One day as he sat cross-legged on the vines, he suddenly opened his eyes to look off into the distance.</p><br/><p>With his Spiritual Sense, he could see a short mountain about forty kilometers away, as well as a simple Immortal’s cave. The Immortal’s cave wasn’t located within the mountain, but rather, underneath it, almost like a burrow. Next to the mountain was a spring, the waters of which had pooled together to form a cistern.</p><br/><p>The waters of the cistern were muddy and foul, and the whole area was littered with animal droppings and weeds. The place looked abandoned. If Meng Hao weren’t specifically looking for a place to rest and restore his health, he would most likely have overlooked a location like this.</p><br/><p>“Actually, it’s not that bad,” he thought. He transmitted his will to the vines, and they moved off in the direction of the short mountain.</p><br/><p>Soon thereafter, he arrived in the area. He approached on foot, allowing the vines to burrow down into the soil and conceal themselves.</p><br/><p>Meng Hao walked through the weeds, passing the cistern. As he did, he noticed a small, black creature drinking from its waters. It looked up at him, emanating a cruel and vicious air.</p><br/><p>Meng Hao ignored it, flying up in the air to inspect the mountain. Afterward, he flew toward a wide fissure on the surface of the mountain, a look of satisfaction on his face.</p><br/><p>The jagged fissure led downward, and it took only a moment for the main door of the Immortal’s cave to appear in front of him. Meng Hao waved his hand, causing the door to tremble, then slowly open.</p><br/><p>The Immortal’s cave wasn’t large; almost everything inside was covered in dust. Apparently it hadn’t been occupied for some time, although some aura of the fifth or sixth level of Qi Condensation still lingered inside. It appeared that the original owner of the cave didn’t have a very high Cultivation base.</p><br/><p>After looking around for a moment, Meng Hao flicked his sleeve, causing a wind to spring up that instantly cleared away the dust and the damp.</p><br/><p>Next, he sat down cross-legged and took a long, deep breath. A thoughtful look filled his eyes, after which his hand flashed in an incantation gesture and he waved his finger toward the main door. It slowly closed, after which magical symbols appeared on it, sealing it.</p><br/><p>“My injuries are currently about fifty percent healed. I really was seriously hurt this time….” He produced some medicinal pills, consumed them, and then closed his eyes to meditate. Slowly but surely, his injuries began to recover.</p><br/><p>As a Grandmaster of the Dao of alchemy, he was naturally able to concoct the optimal pills for treatment of his own injuries.</p><br/><p>Time passed slowly and peacefully. It was quiet inside the Immortal’s cave, and dark as well. He sat alone for some time. When he finally awoke from his trance, he opened his eyes and looked out at the darkness. For some reason, the events from his time in the Violet Fate Sect appeared in his mind.</p><br/><p>“The Ji Clan….” A bright glow appeared in his eyes, which he closed once again.</p><br/><p>Three months slowly went by, although Meng Hao wasn’t very aware of the passage of time. His wounds were mostly recovered now, at least eighty percent so. According to his calculations, within a few months, he would be completely recovered, and back at the peak state he used to be in. In fact, he might even be able to make a bit of progress.</p><br/><p>The absolute strangest thing to him was that in the past three months there hadn’t been the slightest bit of pursuit on the part of the Ji Clan. Meng Hao couldn’t help but draw some of his own conclusions about this.</p><br/><p>He suddenly thought of something. “Could it be because of Master…?” He thought silently about this for a while.</p><br/><p>Finally, he sighed, closed his eyes, and continued to focus on his injuries. After a moment, though, his expression suddenly flickered, and he focused his attention outside of the Immortal’s cave.</p><br/><p>About fifty kilometers away from the short mountain was an emaciated man of about thirty years of age, walking along with utmost caution and prudence.</p><br/><p>His Cultivation base was not very high, perhaps at the sixth level of Qi Condensation. A savage gleam could be seen in his eyes. Were this the Southern Domain, few people of the same level would be able to come out victorious against this man.</p><br/><p>“I really struck it unlucky this time,” grumbled the man through gritted teeth. “What the hell was that place anyway!? Kept me trapped for two years!” His eyes flitted about as he proceeded at top speed toward the small mountain.</p><br/><p>Seemingly out of routine, the man took a circuitous route toward the small mountain, glancing this way and that the entire time. Assured that he was in no danger, and seeing no one following him, he hopped into the fissure and made his way down.</p><br/><p>“From now on, I’m never going to that damned place ever again. Thankfully, even though I was trapped for two years, at least my life wasn’t in danger. Anyone else would most likely have been killed.” He sighed, muttered to himself as he climbed down into the fissure. Having seen so much death, he had reached the point where he was perhaps not numb, but at the least took it all as a normal part of life.</p><br/><p>“Unfortunately, I still have no medicinal elixir,” he muttered. “However, considering that I have my own Immortal’s cave, I definitely count as someone who has a lot of good fortune.” Looking complacent, he relaxed a bit. Finally, he was back to his Immortal’s cave, where he could rest. He lifted up his right hand and produced a command medallion which he tossed toward the door.</p><br/><p>His eyes immediately went wide as he watched the medallion clatter to the ground. The main door of the Immortal’s cave didn’t budge.</p><br/><p>“Is it broken?” he thought, gaping. He walked forward, picked up the command medallion, and then looked over it carefully. He was about to try to use it again, when suddenly he noticed some marks in the dust on the ground that made it obvious the door had been opened recently.</p><br/><p>Fury immediately burned in the man’s eyes. How could he not understand that his Immortal’s cave had been stolen by someone!</p><br/><p>“I don’t know where you came from, you stupid ignoramus!” he immediately shouted. “But this is the Immortal’s cave of Grandpa Huang! Get the hell out of there this instant!” In his estimation, the spiritual energy in the Immortal’s cave had long since dried up. High level Qi Condensation Cultivators would obviously have little interest in it, let alone anyone more powerful than that.</p><br/><p>Furthermore, he had occupied this Immortal’s cave for many years. Sure, some people had attempted to take it from him before, but all of them were people of a lower level than him, and he had exterminated each and every one. In the end, he was definitely the master of this tiny Immortal’s cave.</p><br/><p>However, now it seemed obvious that in the two years he’d been away, someone had indeed come to seize it.</p><br/><p>“Open the door! Your granny! This is Grandpa Huang’s territory, and Grandpa Huang’s Immortal’s cave. Everyone in the entire area knows that I’m the Eight-armed Dragon King, Huang Daxian!”</p><br/><p>Within the Immortal’s cave, Meng Hao frowned. The place had looked abandoned before; he’d never imagined that someone was actually living here….</p><br/><p>“You’ve got some big aspirations and the guts of a leopard to try to steal Grandpa Huang’s Immortal’s Cave!” howled Huang Daxian. Seeing no response coming from inside, he gave a cold snort and then began to perform an incantation with his right hand. He stretched out his finger, and, face flushed, sent a tongue of fire shooting out. It transformed into a Fire Globe which shot toward the main door of the Immortal’s cave.</p><br/><p>A boom filled the narrow fissure, after which Huang Daxian immediately began shouting again, “Open the door! You damned….”</p><br/><p>Before he could finish speaking, the main door quietly opened a sliver. Huang Daxian gave a cold harrumph, congratulating himself on intimidating his opponent with his magical technique. He was filled with fury, but he didn’t immediately charge inside. A look of caution gleamed in his eyes.</p><br/><p>He slowly opened the main door. Inside, he saw that there was no dust; instead, Meng Hao sat there peacefully.</p><br/><p>Seeing Meng Hao alone, he said, “Your grann…” However, in the midst of his fury, he suddenly looked into Meng Hao’s eyes. Within their profundity was an icy dignity.</p><br/><p>His hair was completely white, and he emanated a shocking, terrifying aura. His skin was pallid, as if he needed more blood to make it look normal again.</p><br/><p>All of this caused Huang Daxian to feel as if a bucket of cold water had just been dumped onto his head. He immediately began to shiver.</p><br/><p>“Fellow… um, Fellow Daoist….”</p><br/><p>------</p><br/><p>Madam Deathblade is from North China and uses erhua when she speaks. Her natural reaction when I asked her to record Huang Daxian's name was this:</p><br/><p>[audio mp3=\"http://www.wuxiaworld.com/wp-content/uploads/2015/12/huang_daxianr.mp3\"][/audio]</p><br/><p>Then I made her do another recording without the erhua:</p><br/><p>[audio mp3=\"http://www.wuxiaworld.com/wp-content/uploads/2015/12/huang_daxian.mp3\"][/audio]</p><br/><p>------</p><br/><p><em>This chapter was sponsored by Nicolas Gonzalez Cordero, Karen Pan, Kai Burmeister, and Wade Kamisugi</em></p><br/><p></p><div class=\"footnotes\"><ol><li><span id=\"footnote-1\">Huang Daxian’s name in Chinese is  huáng dà xiān. Huang is a surname which also means “Yellow.” Da means “great” or “grand.” Xian means “Immortal.” So literally his name could also be “Grand Immortal Huang”<i class=\"fa fa-hand-o-left\"></i></span></li><li><span id=\"footnote-1\">Zhou Dekun was the old Furnace Lord from the Violet Fate Sect that Meng Hao initially hated but eventually befriended. He was kidnapped by Black Lands Cultivators and never seen or heard from again.<i class=\"fa fa-hand-o-left\"></i></span></li></ol></div><br/>\n</div>"}