{"title": "Chapter 341: Chase Big-Head to the Death!", "id": 341, "volume": 4, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-341-chase-big-head-to-the-death", "volume_title": "Volume 4", "body": "<h1>Chapter 341: Chase Big-Head to the Death!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span style=\"\"></span></p><br/><p><strong>Chapter 341: Chase Big-Head to the Death!</strong></p><br/><p>However… just as Patriarch Big-head was about to go all out, the bright, sunny sky was suddenly split by the appearance of a bolt of lightning. The Tribulation clouds were gone, but the lightning bolt shot down toward Meng Hao nonetheless.</p><br/><p>It descended with incredible speed, landing directly onto the hat on Meng Hao’s head. A deafening boom filled the air.</p><br/><p>Meng Hao wasn’t hurt, but wisps of greenish smoke rose up from the hat. Meng Hao gaped in shock. He looked up into the sky only to find it as beautiful as ever. The lightning bolt seemed to have been a fluke.</p><br/><p>“That was the aura of Heavenly Tribulation….” thought Meng Hao with a frown. Thankfully, the lightning bolt hadn’t done any damage; it had been absorbed by the meat jelly hat.</p><br/><p>The scene also shocked Patriarch Big-head, who looked up into the sky as well. However, he quickly recovered and began to flee with all the speed he could muster. He wanted to establish as much distance as possible between himself and Meng Hao.</p><br/><p>Meng Hao frowned. He suddenly had a very bad feeling. The lightning bolt just now had been too sudden, without any warning whatsoever. The sky above was a deep, beautiful blue. Meng Hao’s gaze once again came to rest on the fleeing Patriarch Big-head.</p><br/><p>Meng Hao gave a cold snort, then strode forward.</p><br/><p>Mustering incredible speed, he shot off, disappearing in an instant.</p><br/><p>Patriarch Big-head’s face was paler than ever as he fled. He had already been running for an entire day, and his bag of holding was now devoid of medicinal pills used for healing. His internal injuries were getting worse, and he could only employ forty percent of the power of his Cultivation base.</p><br/><p>“Dammit, dammit….” His eyes were bloodshot and he gnashed his teeth. Meng Hao followed behind, stuck onto him like marrow onto bone.</p><br/><p>Occasionally, a blast of Core Qi would whistle toward him, which would leave Patriarch Big-head scared witless. He couldn’t think of anything else to do other than to run away with all the power he could muster.</p><br/><p>“Just how long is he gonna keep following me!?!?” Patriarch Big-head felt like he was about to collapse. He could sense nothing but ill tidings regarding Patriarch Rubicund and Patriarch Pockmarks. Of the hundreds of people who had begun this matter, he knew that he was the only one left alive. He was filled with regrets; the dogged pursuit he was enduring left him filled with despair and dread.</p><br/><p>Suddenly, a Core Qi attack shot toward him. In response, Patriarch Big-head spit up a mouthful of blood. The air beneath his feet seethed as a cloud of spectres appeared, boosting his speed and instantly increasing the distance between him and Meng Hao.</p><br/><p>A strange light shone from Meng Hao’s eyes. There had been multiple occasions throughout the day during which he was just about to catch up to his opponent; however, every time, Patriarch Big-head would use some method relating to evil spirits to add distance between them.</p><br/><p>Meng Hao hadn’t encountered situations like these very often. Behind him, the more than one hundred Cultivators were also in pursuit. Their speed couldn’t compare to Meng Hao’s, but they had Meng Hao’s Blood Clones to lead them, so they were able to follow along nonetheless.</p><br/><p>As dusk fell, it grew more difficult to see things clearly. Up ahead was a wide plain which was filled with residences organized in rings and surrounded with a stockade.</p><br/><p>The stockade village was home to more than a hundred Cultivators, who had been meditating moments ago, but who had stood up and were now looking out toward Patriarch Big-head as he approached. Three old men flew out to meet him.</p><br/><p>“It’s the Patriarch of the Talisman Sect from Dongluo City, Senior Ouyang!”</p><br/><p>“It really is Senior Ouyang. But who is he fleeing from?”</p><br/><p>The three old men’s faces flickered, and they hesitated for a moment. Patriarch Big-head neared, his eyes filled with a look of pleasant surprise.</p><br/><p>“Fellow Daoists, please help me by stopping this hoodlum!” said Patriarch Big-head. There was no anxiety in his voice, only calmness, lending much credibility to his words. “I was in secluded meditation when he launched a shameful sneak attack. I was injured and my Cultivation base damaged. Fellow Daoists, if you can just delay him for a few moments, maybe enough time for half an incense stick to burn, then I can recover my Cultivation base. Fellow Daoists, after I slay him, I will definitely be in your debt. I’ll even help you to reach Core Formation!”</p><br/><p>Without even waiting for a response, Patriarch Big-head shot off into the distance. As for whether these people would comply with his request, he didn’t stay around to find out. If they did, great; if they didn’t, there was nothing he could do about it.</p><br/><p>The three Cultivators were in the late Foundation Establishment stage. After hearing Patriarch Big-head’s words, their hearts began to pound. There was little that could entice them more than the prospect of assistance in reaching Core Formation.</p><br/><p>They hesitated for a moment. For someone to successfully launch a sneak attack against a Sect Patriarch meant that whoever was chasing him was no weakling. He would definitely be of the Core Formation stage. However, the prospective reward was too enticing; they exchanged glances as Meng Hao approached, followed by the more than one hundred Cultivators.</p><br/><p>The sight immediately caused these late Foundation Establishment Cultivators to grow more nervous and hesitant. One of them finally gritted his teeth and flew forward, clasping hands and bowing to Meng Hao.</p><br/><p>“Senior, please wait a moment, I….”</p><br/><p>“Screw off!” said Meng Hao, his expression cold, flying directly past the man.</p><br/><p>The bowing Foundation Establishment Cultivator’s face flickered and his scalp went numb. Meng Hao’s glance just now had caused his heart to tremble with fear. However, the reward promised by Patriarch Big-head nagged at his heart.</p><br/><p>The other two Foundation Establishment Cultivators held him back, then clasped hands in salute to Meng Hao. They didn’t dare to do even the slightest thing to try to delay him. They, too, thirsted for the reward promised by Patriarch Big-head, but Meng Hao’s words and cold glance left their minds reeling and their Dao Pillars quivering.</p><br/><p>Meng Hao didn’t slow down in the slightest. He whistled through the air, followed by the more than one hundred Cultivators who were still being led by the Blood Clones. They glanced at the local Cultivators with cold smiles as they passed, shooting through the air like meteors.</p><br/><p>Some time after they were gone, the three late Foundation Establishment Cultivators let loose sighs of relief. Their faces were somewhat pale, because they knew that their greed just now had led them halfway to the grave.</p><br/><p>“Who was that guy?” they thought, exchanging glances. “He managed to make Senior Ouyang take to flight….”</p><br/><p>As he flew through the air, Meng Hao waved his hand out in front of him. The air rippled as arcs of golden light appeared. They shot toward Patriarch Big-head, but before they could get too close, the man spit up some more blood. The air around his feet grew blurry, and his speed increased, allowing him to evade Meng Hao’s attack. In the blink of an eye, he was roughly three thousand meters away.</p><br/><p>“So fast!” thought Meng Hao, giving a cold harrumph as he continued onward. Throughout the course of this chase, Meng Hao’s interest in Patriarch Big-head’s legacy techniques had certainly been aroused.</p><br/><p>Patriarch Big-head’s face was pale. He gritted his teeth and continued to flee, his heart pounding. A sensation of life-or-death danger floated in his heart. The only thing he could think to do was use every possible means to evade the pursuit and escape death.</p><br/><p>Bitterness filled his heart. After reaching Core Formation, he had always been the one to chase and kill others. This was the first time he had been pursued like a stray dog.</p><br/><p>“If I can make it out of this, then all of this humiliation will be paid back a hundredfold!” he thought, his eyes filling with madness. He increased his speed, traveling another three thousand meters in the blink of an eye.</p><br/><p>After half a day of employing the ultimate speed possible within the Core Formation stage, Patriarch Big-head spotted some earthen walls off in the distance. This city was not as flourishing as one of the United Nine, but clearly a powerful group resided within.</p><br/><p>As he neared, Patriarch Big-head cried out, “Fellow Daoist Chen!” Immediately, a beam of colorful light shot out from within the city. Inside was a muscular, bare-chested man of the mid Core Formation stage, with flowing black hair. When he saw Patriarch Big-head, he gaped in surprise.</p><br/><p>“Big Bro Ouyang, what’s going on…?”</p><br/><p>“Fellow Daoist Chen, please stop the hoodlum that’s chasing me!” he gushed as he shot past the muscular man. “You and I have similar Cultivation bases, but I was ambushed while in secluded meditation. I’ve been poisoned and I need an incense stick’s worth of time to suppress the poison. I owe you!”</p><br/><p>The muscular man’s eyes glittered as he saw Meng Hao approaching.</p><br/><p>Meng Hao glanced at the earthen city wall, and the muscular man who hovered in mid-air.</p><br/><p>“Another person who doesn’t know the difference between life and death,” said Meng Hao as he flew forward.</p><br/><p>The muscular man hesitated for a moment, but after seeing Meng Hao, he got the impression that since Meng Hao’s Cultivation base was only at the mid Core Formation stage, he wasn’t someone to be too worried about. However, the golden glow surrounding Meng Hao, as well as the sense of danger that radiated out from him, caused the man to be cautious. “Fellow Daoist, please wait a moment. There’s no flying allowed in my city!”</p><br/><p>As the words came out of his mouth, the more than two hundred Cultivators within the city flew out. Their aura billowed out, forming into a sealing power. They stood there glaring hatefully at Meng Hao.</p><br/><p>These people had a variety of different Cultivation bases. Some were Core Formation, most were Foundation Establishment or Qi Condensation. However, all of them radiated dense killing intent. Obviously they had killed many people in the past.</p><br/><p>Meng Hao didn’t care at all about people such as this who were clearly seeking to die. He continued forward without stopping, causing the muscular man’s expression to flicker. He lifted his right hand to perform an incantation, when suddenly he saw the look in Meng Hao’s eyes.</p><br/><p>It was a coldness filled with killing intent. As the gaze passed over him, the muscular man’s heart began to pound. Cracking sounds could be heard coming from his Core, as if it might shatter into pieces. He was astonished, but before he could retreat, Meng Hao was upon him. Meng Hao slammed a fist into the man’s chest, and then shot past him. As Meng Hao passed, blood sprayed from the man’s mouth; then he trembled and… directly exploded into bloody pieces.</p><br/><p>His death caused looks of terror to fill the faces of the rest of the Cultivators from the city.</p><br/><p>“Everyone here who pledges allegiance to me will live. Anyone who doesn’t….” Meng Hao knew that in the Black Lands, one could not be softhearted. The only way to establish power and gain respect was through ruthlessness. As his voice rang out, his Blood Clones approached, along with the hundred or more Cultivators, whose killing intent billowed to the Heavens. They shot toward the city Cultivators, and immediately the sound of killing rose up, accompanied by miserable screams and cries.</p><br/><p>Meng Hao glared at Patriarch Big-head, his eyes flashing with killing intent. “Let’s see how many people you manage to get killed along the way!” He shot off again in pursuit.</p><br/><p>This Cultivator was a strange one. No matter what powers Meng Hao employed, he was like a loach, slippery and difficult to lay hands on.</p><br/><p>This was especially true considering his secret art of speed boosting. He had used it multiple times to put more distance between himself and Meng Hao. Even more bizarre was his fearsome ability to sense danger. Every time Meng Hao attacked, he seemed capable of predicting it and dodging out of the way.</p><br/><p>“That damned no-good fool, he couldn’t even hold the guy up for half a second!!” Patriarch Big-head gritted his teeth. Hair in disarray, clothing ragged, breathing heavily, he shot forward. He was exhausted, but Meng Hao was still chasing him. He lifted his head up to the sky and howled.</p><br/><p>-----</p><br/><p><em>This chapter was sponsored by Dennis Liu, Cindy Shi, Anonymous and GY</em></p><br/>\n</div>"}