{"title": "Chapter 352: Chaos in the Black Lands!", "id": 352, "volume": 4, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-352-chaos-in-the-black-lands", "volume_title": "Volume 4", "body": "<h1>Chapter 352: Chaos in the Black Lands!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span style=\"\"></span></p><br/><p><strong>Chapter 352: Chaos in the Black Lands!</strong></p><br/><p>It was dusk in the Black Lands. Meng Hao whistled through the air at high speed, like a green shooting star that disappeared over the horizon.</p><br/><p>This was his seventh day of travel after leaving the city. He had followed the course laid out on the map in the jade slip, flying without rest the entire time. It was uncommon to find long-range teleportation portals within the Black Lands. If you wanted to travel somewhere, you needed to make the journey with your own power.</p><br/><p>Throughout the seven days, lightning would occasionally fall, to be accompanied by the miserable shrieks of the Li Clan Patriarch. Meng Hao wasn’t harmed at all. At the moment, he was flying over the smoking ruins of what had once been a town home to a small-scale power. Amidst the smouldering wreckage, Meng hao could make out quite a few corpses.</p><br/><p>This was the fifth such scene Meng Hao had encountered during the past seven days. He looked down at it for a moment, and was about to fly past when suddenly he gave out a cold snort. His eyes glittered with coldness and he waved his right hand. A flying sword had just shot out toward him; now it came to a halt about thirty meters away.</p><br/><p>A sinister cry suddenly rang out from within the ruins. “Attack!”</p><br/><p>Eight beams of light appeared, shooting up toward Meng Hao. Among the eight people was one late Core Formation Cultivator. Two were of the mid Core Formation stage, and the rest were of the early Core Formation stage. Eight men squads like this were nothing to take lightly in any location. As they flew out, they emanated shocking power.</p><br/><p>However, other than the late Core Formation Cultivator, all of the men had listless expressions in their eyes. Their Cultivation bases were powerful, but their movements were rigid, like those of puppets.</p><br/><p>They bore down on Meng Hao, employing blazingly colorful magical items and techniques. Flying swords and magical bottles filled the air, seemingly moments away from slamming into Meng Hao. Meng Hao frowned, then utilized the Bloodburst Flash. Instantly, his body flickered, and he disappeared. When he reappeared, he was some distance away.</p><br/><p>This was not minor teleportation. However, to move such a distance in such a short time was completely shocking.</p><br/><p>Booms filled the air as the position he had just occupied exploded into a pillar of light, the result of the combined attack.</p><br/><p>Meng Hao’s expression grew dark. The attack just now had been filled with killing intent; however, he was certain that he had never met these people before.</p><br/><p>“So, the chaos in the Black Lands has already reached this level,” he thought with a frown. It was at this moment that the group of eight men realized that Meng Hao had disappeared. They turned around and caught sight of him. The late Core Formation Cultivator gave a cold snort, and a vicious look appeared in his eyes.</p><br/><p>“Trifling early Core Formation Cultivator. It looks like you have some nice magical techniques. However, now that you’ve run into me, you have no choice but to be a good boy and become my puppet. The more puppets I have, the safer I’ll be.” The man lifted his right hand, and immediately, the seven other Cultivators charged toward Meng Hao, their faces wooden.</p><br/><p>Meng Hao blinked several times in succession, focusing the power of his Cultivation base into his right eye. Instantly, his view of the world changed. Using the Celestial vision technique, Meng Hao was able to see vast quantities of gossamer threads attached to the bodies of the seven Cultivators. The threads stretched back into the fist of the late Core Formation Cultivator.</p><br/><p>It seemed these people really were all puppets under his control.</p><br/><p>As they sped toward him, Meng Hao lifted his hand. He sliced his fingertip, causing blood to flow out. His face grim, he pointed forward, and everything in his field of view turned the color of blood. A rumbling filled the air, along with a Blood Qi that transformed into an attack that shot out toward the incoming seven Cultivators.</p><br/><p>The rumbling increased in intensity as the Blood Qi shook the air with power like that of a dragon. The seven Cultivators coughed up blood, and their bodies tottered backward. The face of the Late Core Formation Cultivator flickered. Meng Hao shot forward once again using the Bloodburst Flash. In the blink of an eye, he was directly in front of his opponent. Without hesitation or mercy, he lifted his blood-soaked finger and pressed down onto the man’s forehead.</p><br/><p>Blood Qi poured into the Cultivator’s body, causing him to tremble. Veins bulged out on his skin, and lines of red appeared in his eyes. He twitched a few times, and then exploded.</p><br/><p>Meng Hao flicked his sleeve, preventing any of the blood and gore from touching him. He had slaughtered the late Core Formation Cultivator smoothly and efficiently. After the death of the late Core Formation Cultivator, the other seven people began to tremble. Blood oozed from their eyes, nose and mouth as they slowly died.</p><br/><p>Brow furrowed, Meng Hao collected their bags of holding. The entire battle had been a bit strange.</p><br/><p>“It seems everyone in the Black Lands is living in fear. The weak wish to be strong, and will kill without compunction. Slaughtering opponents leads to increased strength.” He turned, disappearing off into the distance as he continued on toward Holy Snow City.</p><br/><p>“I hope nothing too drastic has occurred to the Frigid Snow Clan of Holy Snow City. They are the only people who can raise Frigid Snow larvae, so if anything has changed, my plan will be ruined.” As of now, Meng Hao truly understood the level of chaos within the Black Lands. He continued forward at top speed.</p><br/><p>Several days later, he was traveling through a chain of mountains when a boom suddenly echoed out. Meng Hao’s eyes glowed with killing intent as a dozen or so Cultivators closed in on him. He continued on, and heads flew. After enough time passed for an incense stick to burn, Meng Hao left, leaving only complete death in his wake.</p><br/><p>The attack just now had stemmed from an incident a few days before when Meng Hao had consumed a medicinal pill to bolster his Cultivation base. The scene had been witnessed by a Cultivator, which led to an explosion of greed among other locals. Now, they were all dead.</p><br/><p>Time passed by slowly. Half a month later, Meng Hao was still traveling along alone. He had faced quite a bit of dangerous situations along the way, but in the end, his grisly tactics left anyone who messed with him dead. Afterwards, he used a magical technique to cause their severed heads to float along behind him as he traveled. It was a road of death and severed heads.</p><br/><p>In the end, the floating severed heads grew more and more numerous. There were dozens of them, most of them dried and withered, although some still dripped with blood.</p><br/><p>This sight shocked the hearts of many local scoundrels, and enabled Meng Hao to travel a bit more safely. Fewer and fewer people were willing to provoke him.</p><br/><p>Any Cultivator with brains who saw the macabre floating heads would immediately dispel any notions they had of messing with Meng Hao.</p><br/><p>A few more days passed. More than a month had gone by since Meng Hao left the former Dongluo City. He had nearly crossed the entire Black Lands, and had personally witnessed the anarchy which reigned. There was no order. The forces of the Black Lands Palace and the armies of the United Nine engaged in countless battles which left the land swathed in the flames of war.</p><br/><p>The pandemonium was like an even more explicit version of the law of the jungle. There was no need to conceal one’s actions, no need for misgivings. Only the strong survived. As for the weak, they were there to serve the strong.</p><br/><p>Within a month’s time, of the nine cities that made up the United Nine, only four remained. The Clans in the other cities were either exterminated, seized by the Black Lands Palace, or forced to flee into hiding. It was simply too difficult for the United Nine to stand up to the combined forces of the Western Desert and the Black Lands Palace.</p><br/><p>It was only the day before that Meng Hao heard that Holy Snow City had been besieged, which caused his heart to sink.</p><br/><p>“I’d hoped there would be no obstructions on my way there,” he said, shaking his head. He shot forward as fast as possible. According to his estimation, his current rate of travel would get him to the vicinity of Holy Snow City in about two days.</p><br/><p>Currently, he shot across the land underneath the evening sky. The ground below was no longer pitch black, but rather somewhat pale. It was not white soil, but rather, snow.</p><br/><p>The air temperature was so low that Meng Hao could see his own breath.</p><br/><p>The wind was bone-piercingly cold, and it had begun to snow.</p><br/><p>It had been a very long time since he had seen snowfall. In fact, to his best recollection, the last time had been that snowy night in the State of Zhao when he’d shared the horse cart with the scholar and engaged in a lively discussion. [1. Meng Hao shared the horse cart with the scholar way back in chapter 58<span>]</span></p><br/><p>Snowflakes floated down from the sky, and Meng Hao’s eyes glittered as he saw the snow piling up on the ground. Down below was a forest, although there were no leaves on any of the trees. Instead, their withered branches were piled up with accumulations of snow.</p><br/><p>Meng Hao looked off into the distance, and suddenly his expression flickered. He dropped down to the ground and ceased flying. His green robe whipped in the wind as he walked through the forest.</p><br/><p>Deeper within the forest were two Cultivators, blood spattered and pale-faced, standing protectively in front of a young woman in her late teens. She wore a white gown and was spectacularly beautiful. However, she seemed to be in a very miserable situation. Her face was also pale, and filled with a miserable expression. In her right hand she held a larva that appeared to be made of crystal. It was currently spinning silk, which transformed into a bright light that surrounded the group of three people. Unfortunately, the larva appeared to be somewhat listless, as if it were on the verge of death.</p><br/><p>The group was currently surrounded by a pack of one hundred wolves, all of whom emanated black auras, and had bright red eyes. Behind the wolves was a Western Desert Cultivator, his body festooned with totem tattoos, who was staring greedily at the white-robed young woman.</p><br/><p>The Cultivators protecting the young woman consisted of a man and a woman. The man gruffly cried out, “You despicable Western Desert Cultivator! Don’t you fear the power of our Frigid Snow Clan’s Spirit Severing Patriarch?!”</p><br/><p>“There’s no need to discuss whether your Spirit Severing Patriarch is alive or not,” replied the Western Desert Cultivator in a hoarse voice. “If he’s alive, he’ll be paying attention to the battle of Holy Snow City. Right now… you’re just a regular old Frigid Snow Clan member. Your life or death won’t mean anything to him.”</p><br/><p>The man waved his right arm, and the hundred black wolves pounced, slamming into the shield weaved by the larva. Booms rang out, and the Western Desert Cultivator’s eyes brimmed with avarice.</p><br/><p>“Your Frigid Snow Clan switched out the character ‘blood’ in your name with the character ‘snow.’ But did you really think that would make the Western Desert forget about you?” The man laughed as he stared at the girl. [2]</p><br/><p></p><div class=\"footnotes\"><ol><li><span id=\"footnote-2\">In Chinese, the character for “snow” and “blood” are pronounced the same. Well, the character for blood actually has a few pronunciation variations, and one of them is exactly the same as snow<i class=\"fa fa-hand-o-left\"></i></span></li></ol></div><br/>\n</div>"}