{"title": "Chapter 377: Agarwood!!", "id": 377, "volume": 4, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-377-agarwood", "volume_title": "Volume 4", "body": "<h1>Chapter 377: Agarwood!!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span style=\"\"></span></p><br/><p><strong>Chapter 377: Agarwood!!</strong></p><br/><p>This mark was not unfamiliar to Meng Hao. It was the same one that had appeared when he reached Foundation Establishment and Core Formation!</p><br/><p>When the young woman from the Fang Clan saw the mark, her expression had changed. Instead of striking Meng Hao, she changed the direction of her blow.</p><br/><p>Images from all of these scenes played out in Meng Hao’s mind.</p><br/><p>And now… the mark had appeared again! [1. As a recap, this mark first appeared in chapter 100. It was seen most recently when he met Fang Yu from the Fang Clan in chapter 309. The events mentioned in which she saw the mark were in the following chapter, chapter 310<span>]</span></p><br/><p>He felt an intense heat radiating out from the back of his hand. It turned into a stinging pain that spread throughout his body until he was completely submerged in it. Finally, he let out a roar.</p><br/><p>At the same time, a sort of boundless life force seemed to be released from within the pain. It spread through him, healing his body. Furthermore, he could sense that it also gave him the chance to accept the fourth legacy.</p><br/><p>Suddenly, an archaic voice sounded out in his mind. It was boundlessly ancient, transmitted from ten thousand years in the past. It did not come from the mark on his hand, but rather, the Frigid Snow Clan legacy!</p><br/><p>“I am the third generation Grand Dragoneer of the Frigid Snow Clan. My name is Qi’nan Ning…. I accepted the legacy of the second generation in the frigid cold of midwinter. I gained enlightenment on Mount Agarwood. I severed my Dao on Midwinter Plain. Before me, the Clan was called Agarwood. After me, it was called Frigid Snow…. Clan members, engrave upon your minds: our power was fading, we could not support ourselves. Sadly, we were forced to leave the Western Desert.” [1]</p><br/><p>As the voice spoke, an image of a mountain appeared in the pupil of each of Meng Hao’s eyes!</p><br/><p>This was Mount Agarwood. The same moment that the images of the mountains appeared, up above in the sky, the breach slashed by the Lightning Blade began to split open. An enormous mountain suddenly began to descend.</p><br/><p>The size of this mountain was difficult to describe; the power it radiated was boundless and shocking.</p><br/><p>Just barely visible on the mountain were two glowing characters that made up the word Agarwood. As the mountain descended, the ground shook and began to crack and sink.</p><br/><p>The Heavenly Pit disappeared, and the Lightning Blade shattered. A massive sinkhole appeared on the battlefield, which turned into an enormous basin. The two Nascent Soul Cultivators from the Black Lands Palace coughed up blood. Their masks shattered, revealing the shocked faces of two old men. Immediately, they began to flee.</p><br/><p>The two Nascent Soul Cultivators from the Western Desert also coughed up blood as they were tossed backward. The shock that filled their hearts was impossible to describe with words.</p><br/><p>“Qi’nan Ning…. Ten thousand years ago, he was one of the three most powerful figures in the Western Desert. He… he was actually a member of the Frigid Snow Tribe?! How is that possible?! How come the ancient records never mentioned anything about this!?”</p><br/><p>“Qi’nan Ning…..” The black-robed Cultivator’s face flickered. Behind him, Hanxue Zong stared mutely. He suddenly coughed up a mouthful of blood, a look of disbelief in his eyes. How could he ever have imagined that the Patriarch of his own bloodline was actually a member of the famous Agarwood Clan from ten thousand years ago!</p><br/><p>“Why change the name of the Clan?” Hanxue Zong didn’t have any time to think about it further. The black-robed Cultivator, eyes glistening with concentration, lifted his right hand and was about to wave it when suddenly, his face flickered yet again.</p><br/><p>“Dammit! How can this kid have so much latent talent? The legacy isn’t concluded yet….”</p><br/><p>The ground rumbled as the enormous Mount Agarwood descended. Meng Hao floated there, his eyes shining with a bright light. As of this moment, he knew with absolute certainty this time, he really was experiencing an incredible amount of good fortune.</p><br/><p>The Spirit Severing brands remained in his mind. He couldn’t employ them except during the branding process, but… when it came time for his own Spirit Severing, it would be vastly easier.</p><br/><p>Furthermore, after he reached Spirit Severing, the power he would be able to wield would be unprecedented, and he would be able to use any of the brands that existed in his mind.</p><br/><p>Such good fortune was normally something he would never have access to; only Spirit Severing Cultivators should be able to acquire such things.</p><br/><p>However, due to chance occurrences, the good fortune fell upon him. As such, he would do everything within his power to acquire even more!</p><br/><p>“The legacies of the sixth, fifth, fourth and third generations… are not enough,” thought Meng Hao. “I must acquire the second generation legacy. I will not squander such good fortune. I’ll use it to secure my future rise to prominence! I’m not sure why the mark appeared on the back of my hand again just now, but now I have hope. I possess all the requirements, so therefore, I will definitely open up the full potential of these legacies! It doesn’t matter if the second generation is Frigid Snow Clan or Agarwood Clan. Second generation legacy, come out!” Meng Hao lifted his head up and roared. Light shone up from his eyes as he floated there in mid-air, his hair whipping about. The sight of it was shocking and strangely beautiful!</p><br/><p>Within his head, a ceaseless rumbling sound could be heard. This sound exceeded that of the sixth generation tempest, swept away the fifth generation ten thousand dragons, crushed the fourth generation Yellow Springs, and shattered the third generation Mount Agarwood. It transformed into eminently domineering, supreme noise.</p><br/><p>The sound seemed to be echoing out in response to Meng Hao’s expression of desire.</p><br/><p>“I am Qi’nan Tian, second generation Grand Dragoneer of the Agarwood Clan. With the legacy power of the Patriarch, I controlled the power of the four seasons. I am not an Immortal, but by controlling the seasons, I silenced the Western Desert. I am… the Heaven of the Western Desert!” [2. The “Tian” in his name means “Heaven” or “sky”]</p><br/><p>The voice was common, but it echoed out with a soaring, overbearing aura. The domineering air emanated out from Meng Hao, changing everything. The patch of sky directly above Mount Agarwood suddenly looked bizarre in appearance.</p><br/><p>Within this patch of sky could be seen resplendent Spring flowers, a light Summer rain, dancing, frost-covered Autumn leaves, and bitter Winter snow!</p><br/><p>This patch of sky contained all four seasons, and its power spread out over everything, transforming the land, causing everything to tremble. The two Nascent Soul Cultivators from the Black Lands Palace coughed up blood, and their bodies began to wither as they slipped into unconsciousness.</p><br/><p>Blank expressions covered the faces of the two Western Desert Nascent Soul Cultivators. They couldn’t feel or sense anything; their life force was slipping away.</p><br/><p>Hanxue Zong’s body shook and his mind reeled; he coughed up a mouthful of blood as his body suddenly aged. Up ahead of him, the black-robed Cultivator’s pupils constricted, and his eyes filled with terror and astonishment.</p><br/><p>Without even thinking about it, he backed up, panting as he stared at the Four Seasons Sky above Mount Agarwood.</p><br/><p>“That’s not a Spirit Severing brand, that’s… a Dao Seeking brand!! Dammit, the Frigid Snow Clan actually had a Dao Seeking expert! How is that possible? A Dao Seeking expert in the Western Desert…. Agarwood…. Agarwood….” The black-robed Cultivator’s face fell as he suddenly lost confidence in his ability to seize the legacy. “If I can’t seize this legacy now, then it will never belong to me. Even if I kill this punk later, I wouldn’t be able to take it. Dammit! How come this kid is so troublesome!?!?”</p><br/><p>A twisted look of madness appeared in his eyes. He had been preparing for this day for a long time, and needed the good fortune of the Frigid Snow Clan legacy for his Third Severing. As such, he wasn’t willing to give up so easily.</p><br/><p>“Five generations. So, you can support five legacy generations. Dammit, there’s only six in total. Don’t tell me he’s going to acquire them all! This kid’s greed is something rarely seen in the world! People as greedy as this deserve to die! I won’t let you continue!!” The black-robed Cultivator’s heart buzzed. As of now, he no longer looked down on Meng Hao, but rather, was convinced that Meng Hao would be able to acquire the full legacy. Even though it seemed unbelievable, he didn’t have time to think about the matter too much. Eyes glittering with killing intent, his body flashed. Drawing on the full power of his Spirit Severing Cultivation base, he shot in Meng Hao’s direction.</p><br/><p>“I don’t care what price I have to pay, I will stop you!” Determination filled his eyes as he slammed into the Four Seasons Sky, and Mount Agarwood.</p><br/><p>An indescribable pressure weighed down on his entire body, causing the black-robed Cultivator to shake, and his flesh to begin to evaporate.</p><br/><p>“BREAK!” he roared. The evaporation of his body suddenly slowed. He gritted his teeth and shot forward toward Meng Hao. In the blink of an eye, he was three hundred meters away from him!</p><br/><p>Those final three hundred meters would be extremely difficult to cross.</p><br/><p>Actually, he knew that the best way to handle this situation would be to wait until Meng Hao couldn’t hold on any longer, and self-detonated. As far as interfering with the branding process, the best would be to take some action while at a distance. The most stupid method was what he was doing right now, which was to personally approach Meng Hao.</p><br/><p>Unfortunately, he had no other options. Interfering from outside did no good, and waiting for Meng Hao to self-detonate wasn’t possible. Therefore, he had to move in as he was doing now.</p><br/><p>As rumbling sounds continued to fill the air, Meng Hao completely ignored the incoming black-robed Cultivator. Breathing heavily, he looked up into the sky, his eyes radiating intense determination. He had accepted five generations of legacies from powerful experts. However, as this happened, and the increasing power was revealed, it only made Meng Hao’s desire for the first generation legacy grow even stronger.</p><br/><p>“Agarwood Clan, first generation legacy!!” he roared.</p><br/><p>The sound echoed out into the ears of the black-robed Cultivator, causing his heart to begin to pound. An uneasy feeling filled his heart as he looked at Meng Hao, whose head was raised in determination. The black-robed Cultivator gritted his teeth, then raised his hand toward the blank-faced Hanxue Zong behind him.</p><br/><p>“Blood and Will Liquefaction!” he cried, pointing at Hanxue Zong. Hanxue Zong’s body began to shake, and he let out a blood-curdling shriek. His body rapidly withered, and in the blink of an eye, he had turned into a desiccated corpse. All of the blood in his body spurted out and shot toward the black-robed Cultivator. It circulated around his body for a moment; then he shot forward at incredible speed.</p><br/><p>The three hundred meter distance began to close. However, the pressure of the five legacy brands pushing down on the black-robed Cultivator was rapidly eating away at the Frigid Snow Clan blood which gave him his speed. Once it completely disappeared, he would be in great danger.</p><br/><p>“DIE!” he cried. He was now less than thirty meters away from Meng Hao. He lifted his hand up, and a billowing Lightning Blade slashed down toward Meng Hao.</p><br/><p>Inside his mind, Meng Hao used Spiritual Sense to transmit a message out. “The bloodline of Agarwood comes from the Western Desert. Western Desert totems come from countless demons. As for me, I… I am the Ninth Demon Sealer. Agarwood Clan legacy, yield to me as you should!”</p><br/><p>-----</p><br/><p>Note from Deathblade about Agarwood: Sometimes translating a chapter goes super smooth and fast. Other times, I spend more time on a single passage or even word, than the rest of the chapter. This was one such chapter. In Chinese, what I'm translating as \"Agarwood\" is pronounced \"qi'nan,\" and is a sub-species of a type of a fragrant tree that in English is called agarwood. I probably spent about two hours total just researching this term, including some digging into a Sanskrit/English dictionary (the word apparently came into Chinese from Sanskrit). Special thanks to RWX for consulting with me about it. To save you the trouble of a google search, here's a link to the wikipedia article about it.</p><br/><p>-----</p><br/><p><em>This chapter was sponsored by Tjandra Johannes, Lim Derek, Patryk Czajczyński, Dante Madut, Jonas Winter, and Caleb Gleason</em></p><br/><p></p><div class=\"footnotes\"><ol><li><span id=\"footnote-1\">Qi'nan is the transliteration of “Agarwood.” Ning means “peace” or “tranquility”<i class=\"fa fa-hand-o-left\"></i></span></li><li><span id=\"footnote-2\">The “Tian” in his name means “Heaven” or “sky”<i class=\"fa fa-hand-o-left\"></i></span></li></ol></div><br/>\n</div>"}