{"title": "Chapter 405: White Wolf!", "id": 405, "volume": 5, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-405-white-wolf", "volume_title": "Volume 5", "body": "<h1>Chapter 405: White Wolf!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span style=\"\"></span></p><br/><p><strong>Chapter 405: White Wolf!</strong></p><br/><p>A white streak of light shot forward at incredible, indescribable speed. In a split second, it was directly in front of the Giant Ape. A boom rattled out, shaking Heaven and Earth, and waves of ripples spread out in all directions, kicking up dust and causing a howling wind to sweep about.</p><br/><p>A howl followed by a groan could be heard from the Giant Ape’s mouth. It was as if its enormous body had suddenly slammed directly into a mountain. It fell back, blood spraying from its mouth as its shrill cry echoed out around it. Its chest was now awash with blood; an enormous chunk of flesh had been violently ripped out of it.</p><br/><p>The white light flickered, and Big Hairy was standing off to the side, holding the chunk of meat in his mouth. He swallowed the meat down and then licked the blood from his lips.</p><br/><p>His expression was one of pride, coupled with cold ruthlessness. He looked at the Giant Ape for a moment, then raised his head to the sky and howled. Suddenly, a field of illusory shadows appeared around him, within which the image of an enormous tree could be seen.</p><br/><p>The tree began to twist, its branches intertwining with each other to change into the image of a huge wolf’s head. As Big Hairy leaped forward, the Giant Ape looked terrified. Nonetheless, it let out a roar, causing its body to expand as it shot to meet him.</p><br/><p>Big Hairy’s body flickered as he once again neared the Giant Ape. His ghastly mouth opened wide and then clamped down onto the ape’s neck. This time, the Giant Ape’s shrieks couldn’t be any more miserable.</p><br/><p>A bloodcurdling scream echoed out, along with a cracking sound….</p><br/><p>Blood shot out of the Giant Ape’s head as Big Hairy ripped it clean off the body. Holding the head in his mouth, he turned and flickered back to Meng Hao. Dropping the head to the ground, he licked some blood off of it and then looked around with coldness and savagery at the surrounding onlookers. Of course, he would only attack if Meng Hao uttered another command.</p><br/><p>The other neo-demons surrounding Big Hairy backed away from him, trembling, not daring to be near him. Even Hairy #2 and the other Greenwood Wolves did so. As for the level 5 Lightning Greenwood Wolf and the python, they also slowly backed up, their expressions filled with vigilance and reverence.</p><br/><p>It was only the enormous Black Bat that looked coldly at Big Hairy. Big Hairy looked back, savagery dancing in his eyes.</p><br/><p>The two neo-demons faced off, sizing each other up.</p><br/><p>Further away in the square, Mo Fang stood there with a blank look on his pale face, his body trembling.</p><br/><p>The Giant Ape was now only a headless body. Blood surged out from the neck, filling the entire square with its smell.</p><br/><p>After a long moment, people finally started to breathe again. Everyone’s eyes were glued onto Big Hairy; their expressions were that of astonishment, shock and excitement.</p><br/><p>“White Wolf!!”</p><br/><p>“It turns out that it’s a White Wolf! The Crow Scout Tribe’s ancient records mention a Crow Divinity White Wolf!! According to the legend, that’s the same color as the ancestor of all Greenwood Wolves. Don’t tell that this is… the reincarnation of the ancestor?”</p><br/><p>“A mutated, reincarnated ancestor! That’s something you rarely see even in a hundred years! In ten thousand Greenwood Wolves, you might only find one!! The Crow Scout Tribe hasn’t had a White Wolf appear in ages!!”</p><br/><p>The Crow Scout Tribe members were in an uproar. The minds of each and every person was filled with shock, to a level far exceeding that caused by anything that had happened earlier.</p><br/><p>As for the Tribe’s Grand Elder, he was breathing heavily, and his eyes filled with a bright glow of greed that he couldn’t suppress.</p><br/><p>The Earth Priest’s body trembled and his eyes glowed with astounding brightness as he stared at Big Hairy and the white fur that covered his body. He panted for a moment before recovering his composure.</p><br/><p>“Earth Priest,” said Meng Hao coolly, “I asked you to bear witness, so I’m afraid I’ll need an explanation regarding this Giant Ape neo-demon. Otherwise, you can’t blame me for handling the matter myself.” He waved his hand, causing a handful of neo-demons to shoot forward, latch onto the Giant Ape’s corpse with their sharp teeth, and drag it back to Meng Hao.</p><br/><p>Meng Hao clasped hands and bowed, then, in front of all the surrounding Cultivators, turned and began to walk down the mountain. As he did, the Tribe members who stood in his way moved off to either side to make room, their faces filled with veneration. Quite a few even bowed their heads to him.</p><br/><p>In the Cultivation world, respect is shown toward the powerful. Such was the case no matter where one went. In fact, in the vast lands of the Western Desert, this was even more the case.</p><br/><p>As for old man Shui Mu, he had regained consciousness by this point. He looked at Meng Hao as he walked off, and the dozens of neo-demons that were following, and his eyes filled with awe. No longer was he jealous or envious. He knew that the difference between them was far too vast, to the point where he no longer felt any rancor. Instead, there was only fear inside him.</p><br/><p>The Crow Scout Tribe Grand Elder watched Meng Hao leaving with all the neo-demons, and his eyes flickered coldly. “You’re going to leave just like that?” he said coolly.</p><br/><p>As soon as the words left his mouth, ripples of pressure emanated out, enveloping the area Meng Hao stood in. The Grand Elder’s body flickered, and a moment later, he was standing directly in front of Meng Hao, blocking his way. “That White Wolf is a sacred relic of ours. Leave it behind, and then you may depart.” The Grand Elder’s eyes flickered across Big Hairy, and his heart started to pound with eagerness. It was impossible to prevent some of that eagerness from showing on his face.</p><br/><p>“I’m sorry, I didn’t hear you clearly. Could you say that again?” As he spoke the words, Meng Hao’s eyes looked the same as they usually did. However, there was just a hint of coldness as well. Immediately, killing intent from the surrounding neo-demons filled the air. This was especially true of Big Hairy, whose pupils suddenly turned completely white.</p><br/><p>As for the Black Bat, it floated there in mid-air, its eyes red. It too was emanating killing intent.</p><br/><p>If that was all there was to it, it wouldn’t be a big deal. However, totemic light suddenly flashed up from the back of Meng Hao’s right hand. The aura of the Eyeless Larva emanated out. The Eyeless Larva lived because it had plundered a breath from every living thing in the world. Its existence was shocking to the extreme, and the instant its aura emanated out, the Grand Elder’s face fell.</p><br/><p>Even more shocking to the Grand Elder was that he could sense two more hidden types of profound aura within Meng Hao. He wasn’t sure which if any of them was Meng Hao’s. One was a like a sea of blood that rose to the heavens. The other was like the disdain of a sovereign of the sky.</p><br/><p>“High level Dragoneer!” thought the Grand Elder, his face flickering with emotion. “He has at least a few incredibly powerful, horrifying neo-demons!” He might be able to look down on Meng Hao himself, but could not look down on his status as a high-level Dragoneer.</p><br/><p>Dragoneer Cultivators were not inherently strong, but their neo-demons were!</p><br/><p>The Grand Elder was now hesitating inwardly. It was at this time that the Crow Scout Tribe’s Earth Priest suddenly coughed.</p><br/><p>“Grandmaster Meng, please, stay here with us in the Crow Scout Tribe. Everything that happened just now was a misunderstanding. As for the matter of that ape, Grandmaster, I can offer you an explanation.”</p><br/><p>The Earth Priest’s wording was polite, which instantly caused the Grand Elder’s eyes to narrow. It seemed to him that there was something fishy about the way the man had been acting today. Eyes flickering, the Grand Elder said nothing, and actually stepped to the side to make way.</p><br/><p>Meng Hao turned to look back at the Earth Priest, then clasped hands and bowed. Then, he continued on his way down the mountain. Slowly, the crowd in the square dispersed, included ashen-faced Mo Fang. The Grand Elder could not settle the doubts he felt in his heart as he turned toward the Earth Priest.</p><br/><p>“Fellow Daoist Wu Han, just now that Dragoneer named Meng was certainly extraordinary. However, Mo Fang is the son of Grandmaster Mo Zi. Weren’t our actions just now a bit inappropriate?”</p><br/><p>“How were they inappropriate?” replied the Earth Priest indifferently. “You saw the totem tattoo on the back hand of Dragoneer Meng. Could you really not put two and two together?” He chuckled, looking at the Grand Elder.</p><br/><p>“Totem tattoo? It was a larva….” The Grand Elder’s eyes glittered, then filled with a thoughtful expression. Suddenly, he looked toward the Earth Priest with an expression of disbelief.</p><br/><p>“Don’t tell me….”</p><br/><p>The Earth Priest smiled slightly. “If my speculations are correct, he is none other than a descendant of the Frigid Snow Clan. I received some news recently that Holy Snow City in the Black Lands has fallen, and the Frigid Snow Clan has left for the Southern Domain. From the look of things, some of the Clan members have instead decided to return to the Western Desert.</p><br/><p>“This also explains why we have been unable to uncover any information about him during his six months as a vassal. He just recently fled the Black Lands, and is fearful of being followed. Therefore, he has been unusually cautious, and chose the Crow Scout Tribe as a place of refuge.”</p><br/><p>“Well that’s just….” The Grand Elder was now palpitating with eagerness. He clearly remembered some rumors he had heard of a fearsome Dragoneer named Fang Mu in the Frigid Snow Clan.</p><br/><p>“I’ll discuss the matter with the Greatfather,” said the Earth Priest. “However… even though the Crow Scout Tribe is small, I think we can still offer protection to a descendant of the Frigid Snow Clan! The main thing to worry about is not what enemies he might have, but rather, how to convince him to continue as a vassal of the Crow Scout Tribe. As a descendant of the Frigid Snow Clan, he possesses the innate skills of a Dragoneer. With enough resources and luck, it wouldn’t be impossible for him to become a level 9 Dragoneer!</p><br/><p>“In fact, perhaps he will gain a chance to receive enlightenment from the Tree Ancestor. Grandmaster Mo Zi was the first to do so that year, which rose him to rank 6 Dragoneer.” His eyes thoughtful, the Earth Priest flicked his sleeve and then transformed into a beam of light that shot toward the top of the mountain.</p><br/><p>Even as they were discussing Meng Hao’s identity, Meng Hao arrived back in his courtyard in the Neo-Demon Kennelist district behind the mountain. The entire way, he was followed by his scores of neo-demons, which of course caused quite a stir among all of the Cultivators in the area. They looked over with blank expressions of shock as Meng Hao walked past them.</p><br/><p>When Meng Hao finally entered his courtyard, the shocked spectators began to discuss the matter in low tones. Soon, news of the neo-demon duel between Meng Hao and level 5 Dragoneer Mo Fang spread throughout the entire Tribe. Everyone learned that Meng Hao had five mutated Greenwood Wolves. Everyone gasped after hearing this, and their expressions were those of astonishment.</p><br/><p>Back in his courtyard, Meng Hao ignored the neo-demon horde. Instead, his gaze came to focus on the Black Bat. His eyes flickered slightly as he closely examined the Demonic Qi within it.</p><br/><p>Suddenly, Meng Hao’s heart began to tremble, and a strange look appeared in his eyes. As he looked closer, he gradually was able to make out something within the Black Bat’s body.</p><br/><p>It was a wooden sword!</p><br/><p>The instant he sensed the wooden sword, Meng Hao’s eyes began to glitter brightly. Shock welled up in his heart. Whereas he had been sitting there cross legged, he suddenly rose to his feet.</p><br/><p>-----</p><br/><p>Here is the picture of Big Hairy from the ISSTH mobile/web game:</p><br/><p></p><br/><p>-----</p><br/><p><em>This chapter was sponsored by Stefanus Hendra</em></p><br/>\n</div>"}