{"title": "Chapter 414: Master, Save Me!", "id": 414, "volume": 5, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-414-master-save-me", "volume_title": "Volume 5", "body": "<h1>Chapter 414: Master, Save Me!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span style=\"\"></span></p><br/><p><strong>Chapter 414: Master, Save Me!</strong></p><br/><p>The roar rumbled out, shaking the Heavens and causing the land to tremble. The surrounding forest burst into chaos, as if a tempest had sprung into being and was preparing to shred all life into ash.</p><br/><p>Within the roar contained a mighty pressure that all Cultivators could sense. It instantly caused the faces of the Crow Scout Tribe members to fall; blood sprayed from their mouths and their ears rang.</p><br/><p>All of the white fur on Big Hairy’s body stood on end, and shockingly, he emanated an aura of vigilance. His eyes were filled with freezing coldness, and not even the slightest scrap of feeling could be detected therein, only killing intent.</p><br/><p>He lowered his head and instinctively began to emit low-pitched, threatening growls.</p><br/><p>The Black Bat next to him looked equally serious. It glared off toward where the growl came from, its eyes flickering mysteriously. It slowly opened its mouth, baring its sharp, vicious teeth.</p><br/><p>They were the only neo-demons in the area who had such a reaction. The rest of them began trembling as soon as they heard the roar. One by one, they dropped prone to the ground, as because of the mighty pressure, they didn’t dare to move.</p><br/><p>Even Hairy #2 and the others had to force themselves to even lift their heads up. Their eyes were filled with fear and struggle as they let out low-pitched howls.</p><br/><p>As for the young man and the other two from the Crow Soldier Tribe, their faces flickered and they trembled. The young man quickly took the piece of meat he held in his hand and prepared to throw it out in front of him.</p><br/><p>“You’re dead!” he cried. “Nobody can save you now!”</p><br/><p>As the roar echoed toward them from off in the distance, Meng Hao finally emerged from the forest to stand in front of everyone.</p><br/><p>The Crow Scout Tribe members looked over one by one, and their expressions were the same as if they had just seen a blood relative. They immediately began to clasp hands and excitedly bow to him.</p><br/><p>“Grandmaster Meng!!”</p><br/><p>“It’s Grandmaster Meng!”</p><br/><p>“Greetings, Grandmaster Meng!”</p><br/><p>This was especially true of Wu Chen. He was the first one to catch sight of Meng Hao, and his expression was one of extreme excitement. Catching sight of Meng Hao here filled him not just with simple respect, but something bordering on fanaticism.</p><br/><p>Wu Hai gave a slight, inward sigh of relief. Next to him, Wu Ling had a complex expression and subconsciously lowered her head.</p><br/><p>Meng Hao gave smiling nods to everyone. Then, his gaze shifted off into the distance. He could sense the pressure weighing down on everything, and as he did, he smiled. There was no need for him to even check with Spiritual Sense; he could tell that off in the distant forest was none other than a Wild Giant. It was striding toward them at top speed, most likely drooling at the same time.</p><br/><p>As soon as Meng Hao appeared, it was as if all the pressure suddenly lifted from the neo-demons. One by one, they stood up, their dignity and might restored. Hairy #2 trotted over to Meng Hao, a happy expression in his eyes. It only took a moment for Meng Hao to be surrounded by neo-demons.</p><br/><p>Big Hairy’s body flickered as he, too, returned to Meng Hao’s side. He no longer looked completely savage, but rather, clever and charming.</p><br/><p>The Black Bat hesitated for a moment, then flew over to Meng Hao’s side. However, it continued to glance with cold eyes off into the distance.</p><br/><p>“Grandmaster Meng?” said Gu La’s Third apprentice, his bearing arrogant and disdainful. “Since when did your Crow Scout Tribe get somebody named Grandmaster Meng?! Presumably this neo-demon horde belongs to you. Well, my Master is rank 7 Dragoneer Grandmaster Gu La of the Crow Soldier Tribe. If you’re smart, you’ll hand over the neo-demon horde to me immediately. If you don’t, you’ll have to face my Master, who’s on the way here right now. And guess what, there’s also a Wild Giant coming!”</p><br/><p>Even as he spoke, the ground trembled, and another roar from off in the distance shook everything.</p><br/><p>“Meat…. Meat….” The voice was like thunder, sweeping across everything. The Crow Scout Tribe members continued to appear to be at a loss as the ground heaved. The neo-demons next to Meng Hao, with the exception of Big Hairy and the Black Bat, all began to growl as they sensed a feeling of imminent crisis.</p><br/><p>“Do you hear that?” said the young man excitedly. “That’s the roar of a Wild Giant! That’s none other than my Master’s Demonic Dharma Protector, an ancient neo-demon that he personally subjugated years ago. A Wild Giant!!” He laughed boisterously. “Wild Giants eat other neo-demons for lunch, and are rarely seen in the Western Desert. According to legend, they rarely bond masters. However, my Master was able to bond this one, and that’s why it follows his commands!”</p><br/><p>The ground trembled once again, and the roar of the Wild Giant seemed even closer. The Crow Scout Tribe members began to back up, and the growling roars of the neo-demons grew louder. Meng Hao was the only one who just stood there smiling as he looked out into the forest.</p><br/><p>“It seems Gu La really does have some talent,” thought Meng Hao. “After giving him the job of feeding the Wild Giant, he realized after we got split up that he could use food to control it.”</p><br/><p>“Scared yet?!” cried the young man. “Once the Wild Giant appears all of you are dead!!” He lifted his head up and laughed uproariously as the ground shook beneath him. Off in the distance, an enormous figure could already be seen striding with great steps through the forest.</p><br/><p>Its frame was gigantic, and it emanated a barbaric aura as it roared viciously. As of now everyone present could see it.</p><br/><p>“Meat…. Meat….” Another roar filled the surroundings, circling around and echoing like thunder. At the same time, the Wild Giant suddenly leaped up into the air. It shot out of the forest, flying up until it obscured the sun with its enormous frame. Beneath, the Crow Scout Tribe members’ eyes were wide and filled with shock and amazement. They couldn’t even breathe as they looked up at the shocking Wild Giant.</p><br/><p>Gu La’s Third apprentice stood there cool and composed. However, he was actually nervous inwardly. If it wasn’t for the fact that it was absolutely necessary, and also that he knew his Master was on the way, he would never have called the Wild Giant here.</p><br/><p>The Wild Giant was an irascible neo-demon who only showed up because of food. Even his Master Gu La treated the Wild Giant very politely and was constantly feeding it. He would even scratch its back when it was preparing to sleep.</p><br/><p>“Esteemed Wild Giant, they are your food!!” he cried, sounding very much like his Master. Body trembling, he let out a roar and then tossed the piece of meat he held directly toward Meng Hao.</p><br/><p>At the same time, he retreated back. The other two Crow Soldier Tribe members made to follow, their faces pale and their bodies trembling.</p><br/><p>However, they were a bit too late. The Wild Giant descended like a storm. Even while it was still in mid-air, its huge hand shot down toward the ground and snatched up one of the two Crow Soldier Tribe Cultivators. The man screamed as the Wild Giant tossed him into its mouth. Crunching sounds could be heard, and then the man was swallowed down.</p><br/><p>“Meat! Meat!” roared the Wild Giant. In its eyes, it didn’t care at all about Cultivators or neo-demons. Its eyes were fixed on the chunk of small meat whistling through the air. Its hand shot out to snatch it up.</p><br/><p>Seeing his fellow Tribe member grabbed and eaten caused the young apprentice’s heart to fill with alarm. Even stronger, though, was the cruelty that welled up within him. He saw the Wild Giant’s hand moving toward Meng Hao, and began to laugh wildly.</p><br/><p>“The neo-demons that Young Master wanted are just about....” Before he could finish speaking, his eyes suddenly went wide and filled with disbelief. He stared, gaping, first confused and then struck dumb with amazement.</p><br/><p>This was because Meng Hao suddenly spoke.</p><br/><p>“All you think about all day is eating meat! Get your butt over here!”</p><br/><p>Then the young man saw what Meng Hao did!</p><br/><p>He reached out and grabbed the piece of meat and watched the Wild Giant nearing. Shockingly, as soon as the Wild Giant heard Meng Hao’s words, its entire body began to tremble.</p><br/><p>It was as if to the Wild Giant, Meng Hao’s voice contained Heavenly pressure. It seemed as if no matter how hungry or wild it became, it would never be able to forget Meng Hao’s voice for its entire life.</p><br/><p>The Wild Giant’s eyes went wide as it recalled the scene of the man standing on its head, rousing the Demonic Qi in the area, and asking it if it was willing to capitulate and pledge allegiance.</p><br/><p>Its enormous hand suddenly came to a stop only a meter away from Meng Hao. It stared at Meng Hao for a moment, and as it did, the frenzy in its eyes faded. It turned instead into happiness, as well as a bit of frustration, as if it were nursing a grievance. It let out a massive roar.</p><br/><p>The happiness was because of finally being able to find its Master. The frustration was because it was never able to eat until being full recently, and was depressed because it had been unable to find Meng Hao. All of these feelings leaked out into the massive roar.</p><br/><p>“Shut up and get over here,” chided Meng Hao.</p><br/><p>The enormous Wild Giant immediately quieted down and stepped over to Meng Hao’s side, as obedient as a kitten. It carefully avoided all of the other neo-demons and then squatted down next to Meng Hao.</p><br/><p>Its face was filled with happiness as well as obedience. This caused the minds of everyone present to reel. Everything seemed to be happening opposite to expectation, and it caused their minds to be complete blanks.</p><br/><p>Moments ago, the Wild Giant had been filled with incomparable mania. Now, however, it was clearly very obedient, and not the least bit ferocious. In fact, it really looked as if it had just found its master.</p><br/><p>The ease with which it squatted down seemed to come from force of habit, as if it had done so many times in front of Meng Hao.</p><br/><p>All of this caused a complete silence to fill the air. Wu Chen stared. Wu Hai panted. Wu Ling gaped.</p><br/><p>As for Gu La’s Third apprentice, the young man, he simply was incapable of reconciling the image of the frenzied, man-eating Wild Giant that even his Master was careful around, with the obedient, puppy-like thing that he saw just now. His mind reeled, and he suddenly had the feeling that this Wild Giant… was not his Master’s after all, but instead belonged to this Grandmaster Meng whom he had never seen before.</p><br/><p>“I let my Wild Giant roam free in this area, and you called it here to attack me?” said Meng Hao, looking at the young man with an expression that was a smile, and also not a smile.</p><br/><p>The young man opened his mouth, but his brain was empty. He couldn’t think of anything to say. Everything that had happened had turned his mind and heart inside out. However, it was at this moment that seven or eight beams of prismatic light appeared off in the distance. In the lead was none other than Gu La, a look of dignity covering his face as he shot booming through the air. Immediately, the young man came to his senses. He looked up into the air with a look of excitement.</p><br/><p>“Master, save me!!”</p><br/>\n</div>"}