{"title": "Chapter 411: Rank 7 Mo Zi", "id": 411, "volume": 5, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-411-rank-7-mo-zi", "volume_title": "Volume 5", "body": "<h1>Chapter 411: Rank 7 Mo Zi</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span style=\"\"></span></p><br/><p><strong>Chapter 411: Rank 7 Mo Zi</strong><span></span></p><br/><p>The parrot never came back. Meng Hao wasn’t too concerned about this. Who knew how many long years the parrot had lived, and yet it inherently seemed to like courting death. Nonetheless, it still hadn’t died. Meng Hao was quite assured in its ability to survive.</p><br/><p>Furthermore, the meat jelly bell was with the parrot. If anything, the one to worry about wasn’t the parrot, but the poor Outlander Beast.</p><br/><p>Several days passed, during which Meng Hao spent most of his time in his courtyard, studying his Greenwood Tree totem tattoo. It flickered there on his forehead, radiating boundless life force throughout his body. Every time he closed his eyes to meditate, it seemed that even his heartbeat could create ripples throughout the land and sky around him.</p><br/><p>“This is only one of the five elements, a Wood-type totem. It’s already propelled my Cultivation base much closer to the Nascent Soul stage….” When his eyes opened, they glittered brightly.</p><br/><p>After carefully examining the totemic power within him, he had reached a new understanding.</p><br/><p>“If I can acquire a second five elements totem, then my Cultivation base, despite being at the full circle of the Gold Core, will actually be strong enough to fight the peak of the early Nascent Soul stage, even without the blood-colored mask!</p><br/><p>“In fact… by using the power of the totems, I should be able to employ some of the divine abilities that belong to the Nascent Soul stage!”</p><br/><p>During the same period of time, Meng Hao also experimented a bit with the neo-demon horde he had acquired from Mo Fang. He fed them with Demon Nurturing Pills, and also took them out to hunt. In a relatively short period of time, they began to grow fiercer and tougher. Of course, due to the restraints of time, there was still a large gap between them and Big Hairy and the other Greenwood Wolves.</p><br/><p>However, if things kept progressing the way they were, although they might not compare to the five Greenwood Wolves, they would continue to transmogrify and grow stronger.</p><br/><p>Finally one afternoon, Meng Hao was sitting cross-legged meditating when suddenly, an enormous roaring sound shook the rear mountain district of the Crow Scout Tribe. As the roaring echoed throughout the air, an enormous black python over twenty meters long shot toward Meng Hao in a beam of blackness.</p><br/><p>The black snake emitted a powerful aura, filled with savagery. Its forked tongue flicked in and out of its mouth, and its mere presence sent the aura in the area into chaos. Furthermore, a black, churning mist with a Celestial appearance seethed around it as it flew.</p><br/><p>Standing on top of the black snake was an old man in a black robe. His expression was grim, and his eyes were filled with arrogance and contempt as the black snake neared and then floated in the air above Meng Hao’s courtyard. The old man looked down with a condescending look at Meng Hao.</p><br/><p>The old man’s Cultivation base was not extremely high, only at the mid Core Formation stage. However, his body was festooned with complex totem tattoos, which emanated shocking ripples. Because of them, the man actually emanated an aura similar to that of the Nascent Soul stage.</p><br/><p>“So, you’re Meng Hao!” boomed a voice like that of rolling thunders. It didn’t sound like the voice of a human, but rather, like the combined roaring of countless beasts. The sound rolled out in all directions, causing all of the Cultivators in the rear mountain district to tremble in their hearts. All of the neo-demons began to tremble in fear.</p><br/><p>There were people who immediately recognized the man who rode on the black snake.</p><br/><p>“Rank 7 Dragoneer Grandmaster Mo Zi!!”</p><br/><p>“It really is Grandmaster Mo Zi! So, he’s come looking for Grandmaster Meng!”</p><br/><p>“Grandmaster Meng took away Mo Fang’s neo-demon horde. It won’t do any good even if the Greatfather and the others interfered now. This will be the Crow Scout Tribe’s first battle between Dragoneers. Grandmaster Mo versus Grandmaster Meng!”</p><br/><p>Meng Hao sat cross-legged in his courtyard. He slowly opened his eyes, and they gleamed with coldness. He looked up indifferently at the black-robed old man who floated in mid-air atop the black snake.</p><br/><p>He merely looked up; there was no shocking sharpness in his gaze, nor did he say any Heaven-shaking words. He just looked over. As his gaze passed over the wildly arrogant and fierce black snake, it suddenly began to tremble.</p><br/><p>Terrifying waves of fear suddenly rose up in its simplistic mind. Meng Hao’s gaze had seemed relatively casual, nor could the old man see any clues as to what was going on. But the black neo-demon snake shook violently, and its mind and heart reeled. Fear and awe welled up from its very soul.</p><br/><p>It almost seemed like pressure was bearing down on its life force. The fear and awe it felt in its soul… would most likely also be present even in the ancient ancestor which gave birth to this creature’s bloodline. It too would tremble in fear in front of Meng Hao. The unspeakable aura he emanated made the black snake hold him in as much awe as the Heavens.</p><br/><p>It took only one look, and the black snake let out a shrill howl, then immediately retreated backward. The shocked old man in the black robe did everything he could, but the black snake was completely incapable of recovering.</p><br/><p>It was only after Meng Hao looked away a moment later that the black snake managed to straighten itself up. If Meng Hao had looked at it any longer, it would probably have simply fallen down out of the sky.</p><br/><p>No observer could see what had happened. However, Mo Zi’s heart trembled, and he could barely prevent himself from gasping. His eyes were wide. He had come here in an overbearing fashion in order to punish Meng Hao and take back the neo-demon horde. Suddenly, all of his plans completely changed. He floated there in mid-air, glaring down at Meng Hao, a multitude of thoughts running through his head.</p><br/><p>“Dammit,” he thought, “no wonder the Greatfather, Grand Elder and others did nothing to stop me from coming here. It turns out this guy is a high level Dragoneer!! Just what rank is he….?”</p><br/><p>“How can I help you?” asked Meng Hao coolly. His voice was calm, but his eyes were filled with coldness. He looked up at rank 7 Dragonner Mo Zi, and suddenly realized that the totems on the man’s body were quite interesting.</p><br/><p>“I am Mo Zi. Fellow Daoist Meng, my son is not a good student, but he spent half his life painstakingly collecting his neo-demon horde. I demand an explanation regarding this matter. However, we are both Dragoneers. In one month, the day will come in which the five Tribes of the Crow Divinity go to worship their Ancestor.</p><br/><p>“At that time, the order of who enters the Ancestor’s land will be determined by a competition between the five great Tribes! On that day, I hope to experience your secret Dragoneer arts!” Mo Zi didn’t know what rank Dragoneer Meng Hao was; having come here, however, he couldn’t just leave immediately. Therefore, he forced these words out, then turned and left with his black snake.</p><br/><p>As he left, he made up his mind. “I must determine for sure what rank Dragoneer he is. I can’t do anything rash. I’ll use the five great Tribe’s competition to determine how much of him is true and how much is false.”</p><br/><p>He arrived abruptly and left quickly. The surrounding onlookers saw everything that happened and could only watch on in shock.</p><br/><p>Meng Hao also stared in surprise for a moment. It only took a moment’s thought to realize why rank 7 Dragoneer Mo Zi had come here. However, his motives in coming and going were quite contradictory. Meng Hao smiled coldly, and his eyes glittered.</p><br/><p>“So, the awaited time has come; the five great Tribes will offer sacrifices to their Ancestor…. The only way to do that is to enter the Crow Divinity Holy Land. That is the prescribed rendezvous point with the others.</p><br/><p>“However, now that I have my Wood-type totem, getting into the Holy Land isn’t that important. Furthermore, the Crow Scout Tribe has actually treated me quite well.” After a moment’s thought he closed his eyes to continue his research on his Greenwood Tree totem.</p><br/><p>The next day at dawn, when light was just appearing in the sky, Meng Hao emerged from his trance. He looked around at his silent neo-demon horde. Currently, his dozens of neo-demons were organized into three groups. The first was the Greenwood Wolves, led by Big Hairy.</p><br/><p>Another was the Greenwood Bats, led by the Black Bat. There was a big difference in the numbers populating the two groups. There were a few more Greenwood Wolves; however, the Greenwood Bats had more mid-level neo-demons. The two groups weren’t necessarily evenly matched, but there was a clear delineation between the two. They didn’t get along very well, and a bit of hostility existed.</p><br/><p>The third group was comprised of Greenwood Snakes. Their numbers lay between those of the Greenwood Wolves and the Greenwood Bats. However, in terms of strength, they didn’t measure up to either of the others. Being the lowest position, they showed complete awe for Big Hairy and the Black Bat.</p><br/><p>Meng Hao looked thoughtfully for a while at the three groups of neo-demons. Then, his body flickered as he left the courtyard. Behind him, Big Hairy looked up, then also turned into a blur as he followed, along with the rest of the Greenwood Wolf neo-demon horde. The Black Bat’s eyes flickered, and it flew up into the air, bringing the Greenwood Bats with it.</p><br/><p>The Greenwood Snakes took the flanking position as Meng Hao left the rear mountain district. The entire way, any of the Crow Scout Tribe members who saw Meng Hao would look at him in awe, then lower their heads and do their best to avoid him.</p><br/><p>After leaving the Crow Scout Tribe, Meng Hao found himself in the surrounding mountain forest. As he usually did, he sent the various neo-demon hordes in different directions to hunt for food. As for himself, he sat down cross-legged underneath a tall tree to meditate.</p><br/><p>Big Hairy didn’t leave, but rather lay down next to Meng Hao. He looked lazy, but in truth, his eyes were filled with vigilance and coldness as he looked around.</p><br/><p>Meng Hao had been in the Crow Scout Tribe for more than half a year now. During that time, he had often taken his Greenwood Wolves out to hunt; each time, Big Hairy would keep a close watch on Meng Hao. As for food, it was usually brought back to him by the other Greenwood Wolves. Unless Meng Hao ordered him, he would never leave his side.</p><br/><p>Now, Meng Hao’s neo-demon horde had grown much stronger and larger; nonetheless, Big Hairy continued to act the same as before.</p><br/><p>Meng Hao petted Big Hairy’s head. As he did, he thought of the mastiff. He suddenly sent his mind into the blood-colored mask. Sensing that the mastiff was still in a state of slumber, he sighed.</p><br/><p>“When will you finally wake up?” he thought. He retracted his Spiritual Sense, then looked at the surrounding forest. A breeze wafted through the trees, giving rise to a rustling sound.</p><br/><p>At first glance, it almost looked like the Southern Domain. However, there was also something unfamiliar about it; it didn’t feel like home at all.</p><br/><p>“After leaving the Black Lands, the power of the Celestial talisman that was interfering with the Ji Clan’s search for me must have vanished. From now on… I need to be ready at any time for the Ji Clan to come after me. Although, despite being away from the Black Lands, perhaps I have enough Celestial talisman power on my person to continue to provide interference.” He looked up into the sky, his heart filled with questions. During the past more than half year, he hadn’t seen a single person from the Ji Clan. Now he was starting to come to the conclusion that acquiring the Celestial talisman symbols and using them to gain enlightenment, must be one of the main reasons that the Ji Clan wasn’t coming after him.</p><br/><p>“The Ji Clan….” he thought, his eyes filling with coldness. “One of these days, I will become strong…. Then the Ji Clan will be forced to acknowledge my superiority!” He took a deep breath, and determination filled his eyes.</p><br/><p>It was at this moment that Meng Hao’s mind suddenly flickered. He turned his head to look off into the distance. In addition, a high-pitched voice suddenly drifted into his ears from off into the distance.</p><br/><p>“It doesn’t matter if the first person to spot that Ironblack Snake was you or me. My Master is rank 7 Dragoneer Gu La. Do you really dare to contend with this Young Master!?” [1]</p><br/><p>-----</p><br/><p><em>This chapter was sponsored by Allan Tam</em></p><br/><p></p><div class=\"footnotes\"><ol><li><span id=\"footnote-1\">Gu La is the Western Desert Dragoneer who Meng Hao captured when he first arrived at Holy Snow City. Later, Gu La, along with the Wild Giant, disappeared when Meng Hao teleported to the region of the five Crow Divinity Tribes<i class=\"fa fa-hand-o-left\"></i></span></li></ol></div><br/>\n</div>"}