{"title": "Chapter 434: Eyes Open!", "id": 434, "volume": 5, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-434-eyes-open", "volume_title": "Volume 5", "body": "<h1>Chapter 434: Eyes Open!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span style=\"\"></span></p><br/><p><strong>Chapter 434: Eyes Open!</strong></p><br/><p>The sky overhead was instantly filled with bright colors, as well as wailing cries. The faces of the members of the five Tribes flickered as they looked up.</p><br/><p>The Greatfathers, Priests, and Grand Elders of the five Tribes made up quite a group of Nascent Soul experts, more than twenty in total. In the Southern Domain, they would count as a mid-sized Sect. Of course… without a Spirit Severing Cultivator, they couldn’t be considered a great Sect.</p><br/><p>In the Western Desert, the Five Tribe Alliance could be considered a powerful force, equivalent to a mid-sized Tribe. However… all of the powerful experts were looking up at the enormous spiders in the sky, and their faces grew dark.</p><br/><p>“That’s… the great Five Poisons Tribe!”</p><br/><p>“To be able to control such a large number of spiders, that guy must be… Zhou Ye, rank 9 Dragoneer from the Spider Branch!”</p><br/><p>“I’ve heard that he’s haughty to the extreme. His Cultivation base is only in the mid Core Formation stage, but as a rank 9 Dragoneer, he controls a vast amount of neo-demons, plus 32 level 10 giant neo-demons who are comparable to the Nascent Soul stage! In recent years, he single-handedly exterminated quite a few Tribes!”</p><br/><p>At the same time that the faces of the members of the Five Tribes fell, and the Nascent Soul experts’ hearts sank, the cries from up above grew even more intense. Tens of thousands of ferocious spiders poured down from above to hover in mid-air. The savage aura that emanated from this black mass spread out to cover the entire mountain range.</p><br/><p>At the same time, the 32 level 10 neo-demons, each of them hundreds of meters long, whistled through the air emanating a powerful aura similar to a Nascent Soul Cultivation base. The explosive power of it shook everything.</p><br/><p>In addition to the 32 level 10 spiders, there was the gigantic meteorite that flew along behind them. It was about three hundred meters up in the air, its exterior pitch black, but its interior lit with a violet glow that made it seem as if the man sitting inside was completely violet.</p><br/><p>Powerful pressure emanated out, causing the members of the five great Tribes to grow pale as they looked up into the sky. Wu Ling, Wu Chen and the others began to breathe heavily, and their faces filled with fear.</p><br/><p>The young man atop the huge spider who had spoken earlier, suddenly called out in a sharp voice: “My Lord, the exalted Dragoneer Zhou Ye of the Five Poison Tribe’s Spider Branch, desires to battle any Cultivator in the world! You have three chances to win. If you fail, your five Tribes will be washed clean with blood!” His expression was one of arrogance as his voice echoed out in all directions. He waved his right hand, causing a red jade slip to shoot down toward the ground. It suddenly exploded and transformed into a red mist that billowed out to form a red battle platform three thousand meters wide.</p><br/><p>“You have the space of twenty breaths. If no one steps forward to fight, it will be taken as a forfeiture, and the cleansing by blood will begin!” The young man licked his lips, and a bloodthirsty glint appeared in his eyes. Around him, the 32 gigantic spiders with Cultivation bases similar to the Nascent Soul stage had cold-blooded expressions and emitted vicious auras.</p><br/><p>The Five Tribes were silent. The twenty or so Nascent Soul Cultivators, including the Crow Scout Tribe Greatfather, all exchanged glances.</p><br/><p>Considering the combined might of the Five Tribe Alliance, it would be impossible for trifling Zhou Ye to exterminate them, even with his 32 level 10 neo-demons. Whether in terms of the five Tribes’ defensive spell formations or their Sacred Ancients, they were more than enough to handle this one crisis.</p><br/><p>However… what they truly were worried about was the fact that Zhou Ye represented… the Five Poisons Tribe.</p><br/><p>Considering these Nascent Soul eccentrics were all Greatfathers, Priests, and Grand Elders, it was obvious that they were wily old foxes. They could immediately tell what was going on. “They’re probing us out!”</p><br/><p>“The Crow Divinity Holy Land just collapsed, so the Five Poisons Tribe is a bit hesitant in coming here. Therefore, they decided to feel us out!”</p><br/><p>“That’s right. If we fight and win, then perhaps we can frighten them. Then we’ll have a bit more time. Even better would be if we won and killed him. That would be perfect. Alternatively… we could just not fight; we could immediately activate the protective spell formation and let them attack us. The latter has various advantages and disadvantages. The former would be the most direct route.”</p><br/><p>The Nascent Soul Cultivators were silent for a moment. Glances were exchanged, and many of their gazes came to fall on the Crow Scout Tribe Greatfather. Since Meng Hao was a Grand Dragoneer, that put the Crow Scout Tribe in a high position within the Five Tribe Alliance.</p><br/><p>“Constantly running away from conflict reveals your weakness to the enemy,” he said. “The great Five Poisons Tribe isn’t stupid, and will be able to see the true situation. Then, when the true conflict begins, we would really be weak. This battle… must be fought! Furthermore, that man must be killed. If we strike like lightning and exterminate him, it will give rise to fear!”</p><br/><p>A gleam of ruthlessness appeared in the eyes of the Crow Soldier Tribe Greatfather. “Fight!”</p><br/><p>Just when the Five Tribes Alliance was preparing to attack, a howl could be heard from the mountainous forest off in the distance. Big Hairy suddenly shot out carrying a small, dead animal in his mouth. In the blink of an eye, he was in the area locked down by the myriad of spiders overhead.</p><br/><p>Behind Big Hairy were the rest of the Greenwood Wolves, all of whom were dashing along at top speed carrying animals in their mouths. They often went hunting for food, and after having fun for a while would return to rest outside the courtyard where Meng Hao was currently in seclusion. At this exact moment, they were returning from such a jaunt.</p><br/><p>Their appearance was quite sudden, and immediately caused a disturbance among the spiders. As for the 32 giant spiders, their auras suddenly retracted, and cold looks appeared in their eyes.</p><br/><p>“Eee!” said Zhou Ye, a look of surprise on his face as he sat up straight inside his meteorite, his eyes glittering as he looked at Big Hairy.</p><br/><p>“That’s… a Wolf King! Furthermore, it’s been mutated! Excellent, excellent. I never imagined that I would find a neo-demon like that in this place. The ones behind it aren’t as good, but still not bad.” Even as Zhou Ye was muttering to himself, the ground suddenly shook and a roar could be heard from within the forest. Then, the Wild Giant appeared, crashing out from the trees.</p><br/><p>Its enormous frame was shocking to the extreme, and the instant it appeared, the surrounding spiders emitted strange calls. Even the 32 giant spiders were shrieking and assumed vigilant and threatening postures.</p><br/><p>“That’s… a Wild Giant!!” said Zhou Ye, his eyes going wide. “There’s actually a Wild Giant here!” He stood up, a look of disbelief on his face. His eyes shone with fervor and greed as he stared at the Wild Giant.</p><br/><p>“According to legend, the blood of a Wild Giant can increase the bizarre power of secret Dragoneer arts. Furthermore, when mixed with neo-demon food, it can have an amazing effect on their progress! Even more important, if I can subjugate a Wild Giant, then my status and position in the Tribe will be completely different!”</p><br/><p>Zhou Ye started laughing uproariously. Eyes shining, he pointed at the Wild Giant.</p><br/><p>“Bring me that Wild Giant and those Greenwood Wolves immediately!” By now, he had completely forgotten about the Crimson War Declaration. As soon as his words rang out, the surrounding spiders shot through the air toward Big Hairy and the others.</p><br/><p>Shocking, ferocious power emanated out from the 32 giant spiders as they shot spiderwebs out toward the Wild Giant. In addition, the Five Poisons Tribe members on their back flew forward in attack.</p><br/><p>As for Zhou Ye, he immediately sent his meteorite flying forward, completely ignoring the members of the Five Tribe Alliance.</p><br/><p>When this happened, the Five Tribe Alliance members all stared in shock. The Crow Scout Tribe Greatfather and the others exchanged delighted glances.</p><br/><p>“Of all the people to provoke, this Zhou Ye picks Grandmaster Meng!”</p><br/><p>“It seems we won’t have to do a thing today. This Zhou Ye will definitely be thwarted!”</p><br/><p>Big Hairy swallowed the animal he held in his jaws and then howled. His body suddenly expanded, and his eyes filled with savagery as he charged toward the incoming spiders. Hairy #2 and the others also let off successive howls. The Wild Giant’s eyes went wide as it roared and attacked.</p><br/><p>Instantly, roaring sounds echoed out in all directions. Facing an onslaught from so many spiders, which included the 32 terrifying giant spiders, Big Hairy, the Greenwood Wolves and the Wild Giant were all in great peril.</p><br/><p>Huge webs descended onto Hairy #2 and the other Greenwood Wolves, making it impossible for them to even struggle. No matter how they howled, they couldn’t shake off the webs.</p><br/><p>Big Hairy lifted his head up and let out a powerful howl. Now, the level 10 spiders turned their attention to the Wild Giant. After being covered with hundreds of huge webs, it let out a cry of pain. As for Big Hairy, his eyes were red as he glared at Zhou Ye sitting there in his flying meteorite. Big Hairy’s body flickered as he dodged one of the giant webs. Then, he turned into a beam of white light that shot directly toward Zhou Ye.</p><br/><p>Zhou Ye stood in his meteorite, laughing as Big Hairy approached. He raised his right hand and gestured forward.</p><br/><p>“Secret Dragoneer art, Burst the Void!”</p><br/><p>Immediately, the indistinct image of a huge spider magically appeared in the air in front of Zhou Ye and then slammed into Big Hairy.</p><br/><p>Big Hairy let out a miserable shriek as all of the white fur on his body suddenly burst into flames. These flames were not red, but rather black, and seemed to be poisonous in nature. Big Hairy’s body shook and blood sprayed out of his mouth. Looking suddenly dispirited, he spun around and then transformed into a beam of light that shot off into the distance.</p><br/><p>“You seem quite intelligent, but now that you’ve been poisoned by my secret Dragoneer art, where do you think you’re going to flee to? Based on neo-demon behavior, you’ll most likely go looking for your master. Very well, I’ll kill him and use his blood to sever the connection between the two of you.” Laughing, Zhou Ye flicked his sleeve, causing the countless spiders to fly with him in pursuit of Big Hairy.</p><br/><p>The sight of it was quite impressive as they took up the chase.</p><br/><p>Big Hairy’s expression was dismal as a black aura emanated off of his body. Had he not consumed a real Demon Nurturing Pill, then he would have already been transformed into a pool of blood. Right now, his body was trembling and he let of growling howls as he shot through the air. After circling around the mountain, he neared the area that had been surrounded by mist for the entire past month.</p><br/><p>Gu La was also sitting there cross-legged. Suddenly, his eyes opened and he saw what was happening. His face immediately fell.</p><br/><p>Big Hairy, his eyes filled with grief and sorrow, howled disconsolately as the massive spider horde closed in on him.</p><br/><p>The instant the shocking howl echoed out, deep within the mist, Meng Hao, who sat cross-legged in his courtyard, suddenly opened his eyes.</p><br/><p>At the same time, thousands of other pairs of eyes within the mist suddenly opened as well.</p><br/><p>There were more than ten pairs among that group which emanated shocking auras!</p><br/>\n</div>"}