{"title": "Chapter 431: Prelude to a Funeral", "id": 431, "volume": 5, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-431-prelude-to-a-funeral", "volume_title": "Volume 5", "body": "<h1>Chapter 431: Prelude to a Funeral</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span style=\"\"></span></p><br/><p><strong>Chapter 431: Prelude to a Funeral</strong></p><br/><p>“I believe what you said to be true,” Yan Song said quickly. His words caused Li Tian to frown. The eyes of Mo and Wang flickered. “That’s because the treasure is in fact here! It hasn’t gone anywhere!”</p><br/><p>Meng Hao’s expression was the same as ever, but his heart filled with vigilance.</p><br/><p>“If you’re talking about the Spirit Severing Pill,” said Li Tian grimly, “then where exactly is it?!”</p><br/><p>“It will appear on its own,” said Yan Song. He suddenly turned, his eyes glowing with avarice. He was looking in the direction of the great tree. He suddenly lifted his right hand up, within which appeared a jade bottle. He crushed it, causing a black liquid to emerge from within, along with a rotting stench.</p><br/><p>Within the black liquid could be seen a maggot-like bug roughly the size of a finger. Its segmented body was wriggling, and as soon as it appeared, it lifted its head up and let out a shrill cry. Its body turned into a black streak that shot toward the top of the tree.</p><br/><p>The sight of the thing shooting toward the treetop caused Meng Hao’s face to flicker.</p><br/><p>Suddenly, a sound could be heard like that of metal scraping against metal. It drifted out from the top of the tree along with a billowing golden light. The weakened Golden Crow suddenly flew out to meet the black bug and prevent it from getting near the great tree. A rumbling sound filled the air as the Golden Crow opened its mouth. A golden glow appeared that surrounded the black bug. It shrieked as it was submerged and then crushed into ash.</p><br/><p>The Golden Crow’s body was now flickering, clearly weakened further. However, its eyes were filled with sharpness and dignity as it glared around at everyone. Behind it was the great tree, which it apparently would sacrifice anything to protect.</p><br/><p>“The legendary Golden Crow Pill is real!” said Yan Song, laughing. “After it was created that year, it acquired a spirit and transformed into a Golden Crow. At one time it had the chance to achieve Immortal Ascension, but in the end it chose to grow weak. Instead, it used its life force to protect a great, dead tree!” His eyes glittered with greed as he stared at the Golden Crow.</p><br/><p>Li Tian’s eyes also glittered, and by now, he was completely ignoring Meng Hao. His breathing came in pants as he stared at the Golden Crow. In his mind, he was looking at a Spirit Severing Pill from ancient times, something that could arouse a wild frenzy among countless Cultivators.</p><br/><p>The eyes of Mo and Wang were also shining brightly.</p><br/><p>“It’s been weakened to the point that it resembles little more than the Nascent Soul stage,” said Li Tian. In a meaningful tone that lacked his previous hostility, he continued, “Fellow Daoists, this is good fortune for us. Let's catch it quickly and then discuss how to divide it up. Don't let it get away!” Laughing loudly, he strode forward.</p><br/><p>Yan Song chuckled. “The pill won’t flee, not with the tree here. Even though it’s dead, the pill won’t leave it.” He, too, began to walk forward. Mo and Wang transformed into beams of light as well. All four began to converge on the Golden Crow.</p><br/><p>At this point, none of them were paying any attention at all to Meng Hao. He remained off in the distance, a complex expression on his face. He could leave now, and no one would stop him. However… he was currently hesitating.</p><br/><p>Booming sounds filled the air as the four ganged up on the Golden Crow. It let out a metallic cry which turned into a golden shield that enveloped the area around itself and the great tree.</p><br/><p>The booming sounds were coming from the attacks the four levelled against the golden shield. Blow after blow was causing the shield to slowly shrink. A look of exhaustion filled the eyes of the Golden Crow. Its life force was simply too faint. It looked back at the great tree, a look of profound longing in its eyes.</p><br/><p>More booms could be heard, and the shield shrank even further, forcing the Golden Crow to back up. Even the tree seemed to be decaying; its illusory life force was fading, and it was now starting to look more and more like nothing but a dead, dried-up tree.</p><br/><p>“Look!” called Yan Song. “The only thing it can do is protect the tree. Be careful, though. Logically speaking, the Golden Crow can’t possibly be THIS weak. Something strange is going on….” Booms continued to echo out.</p><br/><p>However, the four attackers all had various thoughts running through their heads. Also, they were clearly not attacking with full strength, but were rather being guarded in their moves. They seemed to fear this Golden Crow. Such a bizarre spirit would no doubt attack back before it died, most likely with ferocity that could leave them dead.</p><br/><p>The Golden Crow looked at the withering tree and seemed to sigh. It flew up to perch at its top, trying once again to use its life force to restore the tree. Unfortunately, it just didn’t have enough life force at its disposal. Its actions caused the golden shield to grow even weaker and weaker. Its body trembled.</p><br/><p>Meng Hao’s hands clenched into fists, and veins of blood appeared in his eyes.</p><br/><p>“It’s weak because of me,” he thought. “Otherwise Yan Song and the others could never force it down to this degree. If I leave, I’ll be safe. But if I did that, I would be letting myself down!” He looked at the bird. It was in a grave situation and was about to perish, but it was still watching the great tree. Meng Hao saw its medicinal pill aura waning, and once again thought of his Master.</p><br/><p>He wasn’t sure why he suddenly thought of Master a second time, but as of this moment, his eyes filled with determination.</p><br/><p>“There are some things that rationally speaking you shouldn’t do, but you still do them anyway….” He lifted his head up and then slapped his bag of holding. The blood-colored mask appeared. He placed it onto his face and immediately a bloody aura billowed out. A blood-colored mist roiled into being around Meng Hao, turning into red sea. As the seawaters undulated, a shocking killing intent exploded out of Meng Hao.</p><br/><p>“Without a face, a single word, flames of war unify!” As Meng Hao strode forward, he lifted his right hand. Behind him, an enormous face appeared. Its closed eyes snapped open, along with its mouth, as it uttered a soundless song of mourning. It then shot toward Yan Song and the three others.</p><br/><p>Almost the instant the face began to fly forward, Yan Song and the others looked back.</p><br/><p>Considering that the shield was just about to burst, Li Tian’s eyes instantly filled with coldness and killing intent. “Are you looking to die!?”</p><br/><p>The group of four exchanged glances and then began to unleash divine abilities toward Meng Hao.</p><br/><p>As soon as the divine abilities shot forward, the face collapsed into pieces. It was incapable of resisting the power of four Nascent Soul Cultivators. However, it was at this moment that Meng Hao wave his right hand. The flag of three streamers temporarily unraveled from around the body of Ji Nineteen. It unfurled behind Meng Hao, long and black. Immediately, one of the streamers spread out. It was old and dilapidated, but it transformed into a massive black canopy that swept out.</p><br/><p>The overwhelming aura caused the faces of Yan Song and the others to flicker. Li Tian’s pupils constricted. Mo and Wang began to pant in shock. All three of them could instantly feel a sudden, intense sensation of deadly crisis.</p><br/><p>A massive rumbling filled the air as the black streamer shot forward. Blood sprayed from Yan Song’s mouth as he was sent tumbling backward, his face filled with astonishment.</p><br/><p>Li Tian’s right arm was instantly torn into shreds. Blood spouted from his mouth as he shot backward in retreat, face pale and filled with disbelief.</p><br/><p>Blood-curdling shrieks could be heard from Mo and Wang; blood shot out from their torsos as they were slammed into each other. Their wounds immediately healed, but their faces were devoid of blood. They shot backward in retreat, staring at Meng Hao with shock.</p><br/><p>Thanks to the blood-colored mask, Meng Hao’s Cultivation base had climbed up much higher. Now he could fully utilize the power of the first of the flag’s three streamers. Although he had not been able to slay any of his four opponents with the attack, it was stunning enough to shake Heaven and Earth.</p><br/><p>It came at a price, though; Meng Hao’s hair was once again white. However, because of the boundless life force of his Wood character totem, he was not injured on a fundamental level. His face was pale, and blood seeped out of the corners of his mouth. Despite the injuries, after his attack swept Yan Song and the others away, Meng Hao stood with his back to the tree.</p><br/><p>Li Tian gritted his teeth against the pain of his lost arm. Wiping the blood from his mouth, he grimly said, “Fellow Daoist Meng, you certainly have some wild ambitions. You want to kill the four of us and then take the medicinal pill for yourself.” Just now, he had attempted to directly stand up to the attack, and had thus received this serious injury.</p><br/><p>“Fellow Daoist Meng, you’re going against our agreement,” growled old devil Wang, his eyes thick with killing intent.</p><br/><p>Yan Song looked thoughtfully at Meng Hao for a long moment before finally saying, “Fellow Daoist Meng, why are you doing this?”</p><br/><p>“This pill has already achieved Demonic Ascension, and yearns for the great tree,” said Meng Hao calmly. “Even if you consume it, it will do you no good. It has no medicinal strength left, because… it’s not a medicinal pill anymore.”</p><br/><p>“Pills are pills,” said Yan Song gruffly. “And what’s this talk of Demons? At the most, it has a spirit. Fellow Daoist Meng, you’re a Grandmaster of the Dao of alchemy and have concocted many pills and consumed even more. Don’t you understand? Pills will forever be nothing more than pills!”</p><br/><p>Meng Hao was silent as he thought about Grandmaster Pill Demon for a third time. The feeling he got from the Golden Crow continued to seem more and more like… the same feeling he got from Pill Demon.</p><br/><p>“There are some things I hesitate to do, but after I do them, I feel no regret.” Meng Hao said these words in a somewhat hoarse voice. As they echoed about, he offered no explanation as to their meaning.</p><br/><p>What Meng Hao didn’t notice was that behind him, a strange light had appeared in the eyes of the Golden Crow. A soft, warm look could be seen in its eyes. It was no longer as cold and emotionless as it had been earlier. There was a warmth present that hadn’t been there even when it gave Meng Hao the Metal-type totem as repayment for his Righteous Bestowal.</p><br/><p>That act had been one of exchange; the Golden Crow did not want any Karma to exist between itself and anything else other than the great tree. As of this moment, the warm glow in its eyes was very different.</p><br/><p>Suddenly, it spoke. Its voice was that of a woman, ancient and gentle. “I can sense upon you the aura of a life force the same as mine….</p><br/><p>“As for you and me, we have seen very different lives…. Thank you for using Righteous Bestowal on the Greenwood Tree, and for standing up for us.</p><br/><p>“When I was born, the Greenwood Tree was here to keep me company. When I was happy, he was here. When I was confused, he was here. It doesn’t matter if he dies, I will always be by his side, this life, or in the next life. When living, when dying… we will be together.</p><br/><p>“That is my Dao. I will never become a false Immortal who shall exist as long as the Heavens exist. I will walk my own path…. I will be myself….</p><br/><p>“In a thousand years, no one would be here to witness our funeral. Because of you, our time together has been reduced by a thousand years. However... the Greenwood Tree and I are deeply grateful to have you here to observe our death. As for these other people, they can accompany us in death!</p><br/><p>“As means of repayment, I will give you my Golden Life Tattoo!”</p><br/><p>-----</p><br/><p><em>This chapter was sponsored by Michael Harrison, Adrian Seeger, Espen Leonhardsen, Omar Herrera, and Brian Nguyen</em></p><br/>\n</div>"}