{"title": "Chapter 435: Big Hairy Tattles!", "id": 435, "volume": 5, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-435-big-hairy-tattles", "volume_title": "Volume 5", "body": "<h1>Chapter 435: Big Hairy Tattles!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span style=\"\"></span></p><br/><p><strong>Chapter 435: Big Hairy Tattles!</strong></p><br/><p>“Is this where your Master lives?” asked Zhou Ye, smiling calmly within his meteorite. His expression was one of extreme aloofness, as all living things were nothing more than insects in his eyes, and few things existed that could catch his interest.</p><br/><p>His eyes then flickered over toward Gu La.</p><br/><p>“A rank 7 Dragoneer? Presumably this is your Master.” With a smile, Zhou Ye neared the seemingly weak and dying White Wolf, and then shook his head.</p><br/><p>He was surrounded by more than ten thousand spiders, all circulating around his body and even blotting out the sky. A shocking aura spread out, especially from the 32 giant spiders who continued to emanate ripples comparable to the early Nascent Soul stage that caused the auras in the area to change.</p><br/><p>Gu La began to breathe heavily as he stared at the scene. When his eyes came to rest on Zhou Ye, he gasped. It wasn’t too difficult to identify the man. Based on the power emanating from him, if he wasn’t a Grand Dragoneer, then he was definitely a rank 9 Dragoneer.</p><br/><p>“Sticking with a rank 7 Dragoneer like that can’t compare to following me,” said Zhou Ye, his eyes flickering with contempt. He waved his right hand, and instantly one of the three hundred meter large spiders flew toward Gu La, emanating killing intent as it neared him.</p><br/><p>“First I’ll exterminate your Master,” Zhou Ye said coolly, “and then use his blood to sever your bond. From now on, you’re going to be with me.”</p><br/><p>As the words left his mouth, the three hundred meter large spider descended upon Gu La. As it did….</p><br/><p>A cold snort suddenly echoed out from within the mist. It started out very faint, but in the blink of an eye it transformed into something like thunder. It then began invisible waves that shot toward the incoming spider.</p><br/><p>This giant spider, whose power was similar to the early Nascent Soul stage, instantly began to tremble. It let out a miserable shriek and then, astonishingly, retreated. Before it could move more than a few meters, however, it began to shake so violently that its body exploded into bits.</p><br/><p>A simple sound caused a three hundred meter large spider to collapse into pieces. Zhou Ye’s facial expression completely changed, filling with grave astonishment.</p><br/><p>At the same time, Meng Hao’s figure slowly became visible as he walked out from within the roiling mists. His pace was slow, but as he walked, the mists seethed, making it seem almost like he was cloaked in the stuff. His powerful aura soared up into the Heavens.</p><br/><p>After acquiring two totem tattoos, Meng Hao’s Cultivation base was powerful enough to tangle with the early Nascent Soul stage, but certainly not so strong that he could kill an early Nascent Soul Cultivator with a single snort. Unfortunately for the spider, it was a neo-demon, not a Cultivator!</p><br/><p>As a Demon Sealer, Meng Hao was innately capable of emitting pressure upon neo-demons. This was a technique he had come to master during the past month in which he took command over all the neo-demons in his bag of holding.</p><br/><p>Meng Hao had come to call it… Demonic Pressure!</p><br/><p>Now that he could use Demonic Pressure, Meng Hao was a Grand Dragoneer in more than just name only!</p><br/><p>As he strolled out, Zhou Ye’s face flickered again. Without even realizing it, he backed up a few paces. The more than ten thousand spiders around him began to tremble. It was as if to them, Meng Hao was the most powerful neo-demon in the world. In addition to trembling, some of them even let out miserable shrieks.</p><br/><p>“Grand Dragoneer!!” Zhou Ye was panting as he looked at the reaction of the neo-demons around him. A buzzing sound filled his mind, a feeling that he had experienced before only when meeting Grand Dragoneers in his Tribe.</p><br/><p>Despite his change in facial expression, Zhou Ye abruptly said, “Well, so what if you’re a Grand Dragoneer? How many neo-demons do you have, you….”</p><br/><p>Before he could finish his statement, droning sounds could be heard from the black mist behind Meng Hao as nearly a thousand green mosquitos appeared.</p><br/><p>Each of the mosquitos was about three meters long and had long, sharp mouthparts. Their bodies were covered with bristly fur, and they looked matchlessly malevolent as they blotted out the sky.</p><br/><p>“Demonsquitos!!” gasped Zhou Ye, his eyes growing wide. Such creatures were rare in the Western Desert. In fact, in his entire life, Zhou Ye had only ever seen ten in total. Not only did they have the fearsome ability to drain the blood of the bodies of creatures vastly larger than them, but even more shocking, they were extremely poisonous!</p><br/><p>Actually, in some aspects their poison wasn’t really a poison, but a plague!</p><br/><p>These Demonsquitos were incredibly divine and mighty, and the shocking fact that there were over a thousand of them caused Zhou Ye to breath deeply.</p><br/><p>Simultaneously, the ten thousand spiders in the area began to shriek, and some of them even fell prone on the ground, not daring to move.</p><br/><p>Behind the thousand Demonsquitos, a black light appeared. Within the black light were countless black crows flying through the air. Their eyes emanated a shocking, bright red glow.</p><br/><p>“Those are… Demoncrows!” Zhou Ye’s brain was once again filled with a buzzing sound. Crows such as these were not often seen in the Western Desert. Most frightening of all were the legends told about them. Supposedly, these Demoncrows had some connection with the dead! According to the stories… they could bring dead people back to life!</p><br/><p>Some of the spiders next to Zhou Ye were now completely ignoring any of his commands. They prostrated themselves on the ground, not daring to move even a muscle.</p><br/><p>Next, even more neo-demons appeared behind Meng Hao. Each one that did caused Zhou Ye’s expression to flicker. When the red crocodile appeared, Zhou Ye gasped and his face filled with unprecedented astonishment.</p><br/><p>“Searing Demondile! That’s… a neo-demon from ancient times, a Searing Demondile! They’re born at level 8, within the depths of volcanoes!”</p><br/><p>After that, the giant lizard crawled out. As soon as it appeared, it let out a bellowing roar that caused the surrounding black mist to congeal and be sucked into its mouth.</p><br/><p>“That’s… that’s… another ancient neo-demon! Heaven Slaughtering Lizard!!” Zhou Ye’s entire body was shaking. By this point, each and every one of his spiders were frightened to death. Even the three hundred meter large spiders were trembling and prostrating themselves, not daring to move.</p><br/><p>“Who… just who exactly did I manage to provoke…? A Grand Dragoneer with so many fearsome neo-demons…. Dammit, even the Grand Dragoneers back in the Tribe don’t have neo-demons that can compare to these!”</p><br/><p>Zhou Ye’s face was ashen as he said, “Sir….”</p><br/><p>Before he could finish, Meng Hao, his face expressionless, flickered forward with incredible speed to appear next to Big Hairy.</p><br/><p>Completely ignoring Zhou Ye, Meng Hao squatted down and gently petted Big Hairy’s back. As he did, the poison completely vanished from within him. After the space of a few breaths, Big Hairy was completely back to normal. He rose to his feet and let out some yipping sounds as he rubbed Meng Hao with his huge head.</p><br/><p>“I understand,” said Meng Hao, nodding his head. He then pointed out with his finger, causing one of the nearby three hundred meter long spiders to instantly explode. Then he pointed at another one. It too exploded.</p><br/><p>One after another, Meng Hao exterminated six of the three hundred meter large spiders. Those were the ones who had injured Big Hairy. Now they were nothing more than ash floating in the wind.</p><br/><p>“Any more?” asked Meng Hao, looking at Big Hairy. Big Hairy nodded and let out a few more yips.</p><br/><p>Seeing this, Zhou Ye’s scalp went numb. He was now scared out of his mind.</p><br/><p>“I’m from the Five Poisons Tribe, I….” Even as he began to speak, Meng Hao suddenly looked over at him.</p><br/><p>Meng Hao stepped forward, and in the blink of an eye was directly in front of Zhou Ye’s meteorite. He reached out and slapped it lightly.</p><br/><p>The slap caused a roaring sound to fill the air. The meteorite tumbled backward, emanating cracking sounds as it did. Huge fissures covered its surface. Although it didn’t break into pieces, a deep palm print was now clearly visible on its surface.</p><br/><p>“Hmph,” said Meng Hao, his eyes glittering.</p><br/><p>Zhou Ye’s mind and heart were reeling, and blood sprayed from his mouth. His eyes were filled with disbelief and complete astonishment. This meteorite was a precious treasure of the Dragoneers in his Tribe. Dragoneers of the Western Desert seem powerful because they can control large quantities of neo-demons; however, they have a fatal weakness.</p><br/><p>That weakness is the fact that Dragoneers generally lack a powerful Cultivation base!</p><br/><p>Because of that weakness, they can be easily killed. That is why Dragoneers in the Western Desert take special care to protect themselves. This meteorite was exactly such a precious treasure, capable of withstanding a blow from the early Nascent Soul stage without being harmed.</p><br/><p>However… just now Zhou Ye could clearly sense that his precious treasure had been cracked. That could only mean one thing. This Grand Dragoneer had a Nascent Soul Cultivation base!</p><br/><p>“The Grand Dragoneers in my Tribe are only of the great circle of Core Formation. Grand Dragoneers who have Nascent Soul Cultivation bases, are… almost completely invincible!! They are rare in the Western Desert and their secret Dragoneer arts are capable of summoning Spirit Severing neo-demons!!” Zhou Ye was so scared that his whole body was shaking. He let out a shriek as he pushed his meteorite to go even faster. Clearly, he was planning to flee.</p><br/><p>By this time, the members of the Five Tribe Alliance, including the Nascent Soul eccentrics, had arrived on the scene. Seeing everything that had happened caused them to gasp. They knew Meng Hao was strong, and had assumed that if they all joined forces they would be able to suppress him if necessary. Now, their faces fell and their hearts filled with foreboding as they realized that their lack of action before had led to the White Wolf and the Wild Giant being injured.</p><br/><p>Before they could even begin to think of how to make up for their actions, Meng Hao’s body shot forward toward Zhou Ye. His right hand formed a fist, which punched out. A boom filled the air, and more cracks appeared on the meteorite.</p><br/><p>“Senior, please spare me! Sir, everything just now was an accident, a misunderstanding….”</p><br/><p>Shocking roars filled the air as Meng Hao punched out three times in succession. Finally, a splintering sound could be heard as the meteorite disintegrated into pieces. Zhou Ye was pale faced and incapable of fleeing. Meng Hao reached out and grabbed him by the neck.</p><br/><p>He then looked back at Big Hairy. “Was it this arm?” he asked.</p><br/><p>Big Hairy nodded, letting out some more yips as he recalled the humiliation he had endured.</p><br/><p>Meng Hao nodded and grabbed hold of Zhou Ye, who let out a bloodcurdling scream as his arm was directly ripped off of his body and transformed into a haze of blood and gore. Meng Hao’s expression was the same as ever as he hovered there in mid-air. He was just about to release Zhou Ye, when he suddenly noticed the Wild Giant, Hairy #2 and the others who were currently bound up and injured within the spider webs.</p><br/><p>Seeing this, a cold light appeared in his eyes. He suddenly clenched his fist. A cracking sound could be heard as Zhou Ye’s neck was instantly crushed. His eyes went wide, and he was dead.</p><br/><p>Meng Hao released Zhou Ye and then turned to face the Nascent Soul eccentrics of the Five Tribe Alliance.</p><br/><p>“Well, hello,” he said.</p><br/><p>-----</p><br/><p><em>This chapter was sponsored by Benny Chen</em></p><br/>\n</div>"}