{"title": "Chapter 448: East Pill Everburning Flame!", "id": 448, "volume": 5, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-448-east-pill-everburning-flame", "volume_title": "Volume 5", "body": "<h1>Chapter 448: East Pill Everburning Flame!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>These three Blood Immortal divine ability forms immediately caused black smoke to appear on the bodies of the nine Nascent Soul Elders. It rolled off of them up into the sky, seemingly completely beyond their control. Seeing this caused their faces to fall immediately.</p><br/><p>It took only a moment for them to realize that this smoke was caused by an invisible burning of their own life force. Their life force was the fuel and this black smoke was the result!</p><br/><p>The sight of it caused the nine men to be filled with shock. They immediately began to utilize various techniques and divine abilities, but to their horror… they were completely incapable of preventing their life forces from being burned up. The black smoke continued to billow off them.</p><br/><p>Within the black smoke was vast quantities of thick aura of death, making the smoke a mass of inky blackness. From a distance, it really did look like the flames of war were burning in the area. The sight was shocking to the extreme.</p><br/><p>As for the Supreme Priest, even he had black smoke coming off of him. The ten Nascent Soul Cultivators’ faces were filled with shock at this strange divine ability which apparently couldn’t be evaded. Then their faces filled with hatred, and they once again used minor teleportation to charge toward Meng Hao.</p><br/><p>Ten people closed in on Meng Hao from ten different directions.</p><br/><p>Meng Hao closed his eyes. He had noticed something familiar within the black smoke from the burning life forces. He had seen something just like that after his glimpse at the world above the Tower of Tang in the State of Zhao, when he had been infected by the death aura from the fallen Immortal whom he later encountered outside the Rebirth Cave.</p><br/><p>“There must be some similarity between the two….” A cold glint appeared in his eyes as he performed an incantation gesture with both hands and then waved his hands out. Flames of war shot up into the sky. The power he had absorbed from the hundreds of Crow Scout Tribe members poured through the mask, causing rumbling sounds to fill the air as the flames exploded up to shocking effect.</p><br/><p>The ten Nascent Soul Cultivators immediately coughed up blood. The closer they approached in their charge toward Meng Hao, the more life force they wasted.</p><br/><p>It was as if Meng Hao had turned into some destructive force that could consume all life forces.</p><br/><p>Unfortunately, they had no choice but to continue to charge toward him. Retreat was not an option. The only chance they had was to kill Meng Hao.</p><br/><p>Even as they roared and charged forward, Meng Hao closed his eyes and sensed the boundless, so-called Joss Flame power within him. Suddenly, the enormous face once again magically appeared. This time… the face was different. This time, it bore the semblance of Meng Hao.</p><br/><p>Meng Hao’s eyes suddenly opened, and so did the face’s eyes. Its lips quivered, and just as it seems more flames of war would rise up, a single word was uttered.</p><br/><p>“Collapse!”</p><br/><p>The instant Meng Hao’s voice could be heard, rumbling sounds filled the air. In that instant, the black smoke coming off of the ten Nascent Soul Cultivators roared with an earth shaking sound as it exploded with intensity. This was an explosion of their life forces, as if they were being harmed by their own power!</p><br/><p>Surrounded by roaring sounds, nine of the Nascent Soul Cultivators coughed up blood as their bodies tumbled backward violently like kites whose strings had been cut. They were thrown three hundred meters away, and their bodies were listless, older. Their life forces were now dim; they had lost nearly half of their longevity.</p><br/><p>When they finally came to a stop, their faces were unsightly. Their hearts trembled; fear for Meng Hao had already taken root inside of them. It seemed to them that they weren’t fighting a Cultivator, but rather… a totemic Sacred Ancient!</p><br/><p>Furthermore, the power of Joss Flame was incongruous with their own Cultivation base power, which came from the totems of their Tribe. This, combined with Meng Hao’s Blood Immortal divine abilities, allowed him to thoroughly shake these ten Nascent Soul Cultivators.</p><br/><p>As for the Supreme Priest, blood sprayed from his mouth. He was obviously stronger than the other nine, but he too had been severely injured.</p><br/><p>All of them were thoroughly shaken inwardly.</p><br/><p>Meng Hao gave an inward sigh of disappointment. Just now, he had attacked with the full force of the Joss Flame power. Even that was only enough to injure his opponents. After all, these were ten Nascent Soul Cultivators. If he were only fighting one or two, Meng Hao was confident that with his borrowed power, he would be able to slay them.</p><br/><p>However, as soon as all of them came to a stop, the killing intent in their eyes grew even stronger. Their bodies flickered as they approached him once more!</p><br/><p>It was at this point that suddenly, a massive sea of flame exploded out from within the distorted ripples that blocked the view of the battle of totemic Sacred Ancients up above. It spread out to cover half of the sky. The massive flames lit up the faces of everyone down below on the battlefield, astonishing everyone.</p><br/><p>Astonishingly, within the massive spread of flames a figure could be seen, reclining there in mid-air. A golden light rose up, and it was impossible to see what was inside, but it was clear that the golden light was melting and dissipating.</p><br/><p>That golden light was the Metal-type totemic Sacred Ancient of the Crow Soldier Tribe. The Flame Sea was the Crow Flame Tribe’s Fire-type Sacred Ancient. It was impossible for everyone down below on the battlefield to not look at the scene up above.</p><br/><p>An archaic voice suddenly echoed out from up above. “I cannot continue to protect you of the five Crow Divinity Tribes. However the Flame Totem and I… will fight to put you in a good position. As such, our ten thousand years of Karma must be dispersed…. We wish you… peace and safety.”</p><br/><p>The sea of flames rapidly began to contract. It shot toward the golden light at incredible speed. In the blink of an eye, it completely surrounded the golden light, wrapping it up, transforming into… a gigantic sun!</p><br/><p>A death aura swirled within the sun. Down below on the ground, the members of the Crow Soldier Tribe were trembling, as were the members of the Crow Flame Tribe. Their totems were rapidly beginning to dissipate. Intense feelings of grief and sorrow welled up in their hearts.</p><br/><p>“Sacred Ancient!”</p><br/><p>“Sacred Ancient!!”</p><br/><p>Wails of grief rose up into the sky. Unfortunately, neither the Metal-type nor the Fire-type totems could hear them.</p><br/><p>Even as the members of the Five Tribes cried out in grief, golden light and the glow of flames combined within the burning sun up above. Soon, everything was illuminated by its billowing light. Shockingly, just barely visible within the enormous sun was… a Golden Crow!</p><br/><p>The instant the Golden Crow appeared, Meng Hao’s eyes went wide. He was able to sense a somewhat familiar aura on it, and yet, most of it was unfamiliar.</p><br/><p>“It’s not her,” he murmured with a soft sigh. “It’s only a tiny sliver of consciousness left behind in the world. Gold and Fire ended their own lives to transform.”</p><br/><p>The Golden Crow lifted its head to the sky and roared as it shot out from within the sun. It closed in on the spider and the scorpion, which in turn shot toward it, intent on destroying it.</p><br/><p>Such a totemic battle was something that Cultivators couldn’t interfere with. The instant the three of them slammed into each other, the Golden Crow’s body burst into flames. Golden light and the glow of flames spread out. The Golden Crow began to expand. In the blink of an eye, it was three hundred meters, three thousand, thirty thousand meters!!</p><br/><p>It filled the sky and covered over the land, completely enveloping the spider and the scorpion!</p><br/><p>“Totems, I call upon the vestiges of the power of the Crow Divinity to seal you and the root of your totemic power! Totemic Demons of the Five Poisons Tribe, be sealed!!” The archaic voice was filled with weakness as it used the last of its power to speak. The gigantic Golden Crow was now completely enveloping the spider and the scorpion. It transformed into an enormous golden shield almost like a bubble. The frantic spider and the scorpion were trapped inside, and were madly attacking in all directions as they tried to escape.</p><br/><p>“SEAL!” The enormous golden bubble glittered as if with flames as it shot away with the spider and the scorpion. All the onlookers were breathing heavily as it flew out of the mountains, carrying the Sacred Ancients of two branches with it!</p><br/><p>Its destination? The plains which housed the Five Poisons Tribe, where it would use the last bits of its power to interfere with the other three totemic Sacred Ancients.</p><br/><p>This was the final price paid by the great totems of the Crow Divinity, a final protection for the members of the Five Tribes!</p><br/><p>This seal would last for half of a sixty-year cycle. They had burned their own life forces to create this seal. However, their deaths, and the burning of their life force which had unleashed such incredible power, had caught the attention of the Golden Crow’s sliver of will, which would exist for half of a sixty-year cycle.</p><br/><p>As for the Sacred Ancients from the other three branches of the Five Poisons Tribe, they would meet similar fates as the other two. Even if the Five Poisons Tribe made another move, they would not be able to employ the strength of their Sacred Ancients.</p><br/><p>Zhao Youlan coughed up a mouthful of blood. It wasn’t just her; all of the surviving Cultivators from the Spider Branch did the same as their Cultivation bases instantly dropped an entire stage.</p><br/><p>When the Sacred Ancients were sealed, their auras were also sealed as if in death, and were incapable of bestowing any of their power. This was the cause of this instant Cultivation base drop.</p><br/><p>Zhao Chunmu also coughed up a mouthful of blood, along with the rest of the Scorpion Branch Cultivators. Their expressions were that of shock as their Cultivation bases also fell.</p><br/><p>The faces of the ten Nascent Soul Cultivators who Meng Hao was facing up against instantly fell. They began to pant as their Cultivation bases began to weaken and fall. It wouldn’t be long before they were no longer of the Nascent Soul stage!</p><br/><p>That was a unique feature of Western Desert Cultivators. They could borrow the power of totems, but if a Sacred Ancient died, then they would lose a totem tattoo, which would result in Cultivation base loss. In contrast, the Cultivation base of Southern Domain Cultivators belonged only to them. That was why practicing Cultivation was much more difficult there than in the Western Desert.</p><br/><p>Of course, the Crow Divinity Tribe was in the exact same situation because of the deaths of the Metal-type and Fire-type totems. The Crow Soldier Tribe members’ totem tattoos began to vanish; however, at this exact moment, when their Cultivation bases were beginning to fall, a golden light suddenly sprang out from Meng Hao.</p><br/><p>It was as if a previous generation had died, so a new one arrived to replace it. Golden light radiated out of Meng Hao from his Metal-type totem tattoo, the ancient character ‘metal’ which existed on his chest!</p><br/><p>The instant the light appeared, the Crow Soldier Tribe members’ bodies began to tremble. Although their previous Metal-type totem tattoos were disappearing, a new one appeared. It looked different than the previous totems; it resembled Meng Hao’s in every aspect. This was the ancient character for metal!</p><br/><p>Immediately, boundless and intense Joss Flame power erupted from the members of the Crow Soldier Tribe to shoot toward Meng Hao. It covered his golden body, causing his aura to rise up even higher.</p><br/><p>His hair whipped about wildly, and brilliant beams of green and gold light swirled around him. In front of him, two massive characters appeared, wood and metal. They emanated shocking power.</p><br/><p>Filled with excitement, the Crow Soldier Tribe members clasped hands and bowed deeply to Meng Hao. The roar of their voices filled the air.</p><br/><p>“Sacred Ancient!”</p><br/><p>“Greetings, Sacred Ancient!!”</p><br/><p>It was at this moment when Meng Hao’s Wood- and Metal-type power was displayed in spectacular fashion that… the power of the Joss Flame around him grew thicker and suddenly… a flame appeared within him!</p><br/><p>This was not Joss Flame, but rather something that had been inside of him this entire time… the East Pill Everburning Flame!</p><br/><p>-----</p><br/><p><em>This chapter was sponsored by Iann Wright</em></p><br/>\n</div>"}