{"title": "Chapter 441: Execution!", "id": 441, "volume": 5, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-441-execution", "volume_title": "Volume 5", "body": "<h1>Chapter 441: Execution!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span style=\"\"></span></p><br/><p><strong>Chapter 441: Execution!</strong></p><br/><p>As soon as Meng Hao suppressed the Resurrection Lily, the Exotic Heartdevil Flower suddenly had no effect on him whatsoever. Perhaps this had something to do with the Resurrection Lily itself, although it was impossible to say for sure.</p><br/><p>The instant Meng Hao opened his eyes, his neo-demons all let out powerful roars. The eyes of the three Dragoneers narrowed, and the hearts of the surrounding three thousand enemy Cultivators trembled. However, they continued to attack as relentlessly as before.</p><br/><p>Meng Hao looked around thoughtfully. He saw the thousands of corpses of the Five Tribes members, and also noted that the shield was about to collapse. Of his original group of thirty thousand neo-demons, more than half were dead.</p><br/><p>Although he had witnessed the desperate war in Holy Snow City, seeing this scene caused his heart to fill with the same grief as the rest of the Five Tribes.</p><br/><p>“Considering that the battle has reached this point, I should really leave,” he murmured softly. “However… I have no desire to do any fleeing today!” He lifted his right hand and pushed down onto the ground.</p><br/><p>“Demonic Qi, art of Righteous Bestowal!” Immediately, endless amounts of Demonic Qi erupted up in all directions. He waved his hand, causing the invisible Qi to immediately fuse with the more than ten thousand neo-demons of his that remained.</p><br/><p>The neo-demons’ bodies all began to tremble. The Demonsquitos swelled to several times their original size and emitted a shocking aura. In addition to emanating Demonic Qi, an aura of transmogrification suddenly appeared.</p><br/><p>Under the power of this aura, the Demonsquitos suddenly grew an extra pair of wings. In addition, the tails of the mosquitos sprouted green spikes!</p><br/><p>The sight of it was incredibly fearsome!</p><br/><p>As for the black crows, they trembled and then emitted fierce cries. They glowed with a black light, and the fierceness of their auras grew exponentially. Not only did their bodies grow larger, but ghost images sprang up around the Demoncrows, forming what looked like mirror images behind each one.</p><br/><p>This ghost image was a result of the transmogrification, a sort of evolution. With the ghost image there, it was like each crow had two life forces.</p><br/><p>Big Hairy howled into the sky as his body grew to three hundred meters in size. He already had Demonic Qi within him, but this addition didn’t just cause him to grow larger; his blood began to pump harder and the image of a floating moon appeared above his head. Beneath the light of this moon, his coat of white fur suddenly turned silver. He was now a Silver Wolf!</p><br/><p>As for the spiders, they let out fierce cries as their bodies grew more powerful and their appearances even more savage. On their rear torsos, the images of human faces could suddenly be seen. Their fangs grew even longer until they looked like giant pincers!</p><br/><p>The red crocodile’s scales grew bigger, and its head began to change shape to look more like a dragon. The flesh on its back began to bulge out and then suddenly, two wings appeared. It flew into the air, no longer a crocodile, but rather, something like a red Flying Rain-Dragon!</p><br/><p>Although it didn’t form the spitting image of a Flying Rain-Dragon, its aura was extremely similar.</p><br/><p>Roaring, the lizard’s body grew until it was the size of a small mountain. Black smoke poured out from its mouth, as though fire burned in its belly, just ready to be shot out.</p><br/><p>It now looked completely different than it had before; its aura was vastly more powerful.</p><br/><p>The Wild Giant let out an intense roar as its body grew even burlier. It lifted its hand into the air, and shockingly, a bolt of lightning descended from the sky. As the Wild Giant grabbed it, it transformed into a lightning whip, shocking to the extreme.</p><br/><p>All of the neo-demons experienced transmogrification. Such changes were things that since ancient times had happened only occasionally in the Western Desert. To see all of these transmogrifications occurring simultaneously was unprecedented.</p><br/><p>The scene immediately caused the neo-demons of the three Dragoneers to be shaken. Looks of fear appeared in their eyes and they didn’t dare to move forward.</p><br/><p>The three thousand Spider Branch Cultivators’ minds were filled with a buzzing sound. To suddenly see more than ten thousand neo-demons experience transmogrifications that turned them into a mutated horde filled them with incredible fear.</p><br/><p>Zhao Youlan’s eyes were wide and filled with a bright glow. Meng Hao’s sudden explosion of power left her shocked.</p><br/><p>It wasn’t just her. The Spider Branch High Priest and Grand Elders, who were currently attacking the shield, suddenly looked back. When they saw Meng Hao and his neo-demons, their hearts and minds trembled.</p><br/><p>The faces of the Spider Branch’s three Dragoneers filled with disbelief, and they began to pant. Shock completely filled their hearts and they gave out hoarse cries of alarm.</p><br/><p>“Grand… Grand Dragoneer!”</p><br/><p>“He’s a Grand Dragoneer! Only Grand Dragoneers could wield such a fearsome secret Dragoneer art!”</p><br/><p>Suddenly, Meng Hao’s eyes swept over them, and their faces went deathly pale. Scalps numb, they retreated at top speed.</p><br/><p>Even as they began to fall back, Meng Hao’s neo-demons let out shocking roars and then fell upon the Cultivators and neo-demons who surrounded them.</p><br/><p>Amidst the thunderous roaring, Meng Hao also moved forward with incredible speed, using a Bloodburst Flash. His body seemed to disappear. As it did, all of the neo-demons and Cultivators between him and the nearest of the three Dragoneers suddenly exploded into a cloud of blood and flesh. Meng Hao reappeared directly in front of the Dragoneer.</p><br/><p>The speed with which this happened was incredibly shocking. It wasn’t a minor teleportation, but rather, an explosive burst of speed over a short distance, leaving behind a path of destruction and death.</p><br/><p>“You….” The Dragoneer’s face fell, and his mind filled with a buzzing sound. He was just about to shoot back when Meng Hao’s hand snapped out and latched onto his throat. A cracking sound rang out as Meng Hao, his face completely expressionless, crushed the man’s neck.</p><br/><p>When he dropped the Dragoneer, a thorn-covered vine suddenly snaked out from the Wild Giant. In one giant gulp, it swallowed the body of the Dragoneer. The ferocious vine then began to spin around Meng Hao, turning into what looked like a gigantic sphere of thorns that swept about in all directions.</p><br/><p>This single kill instantly shook the entire battlefield. The faces of two of the Spider Branch Nascent Soul Elders who were attacking the shield, flickered. Without hesitation, they performed minor teleportations to suddenly reappear near Meng Hao.</p><br/><p>The instant they reappeared, a group of Demonsquitos screamed through the air to defend Meng Hao. The two Nascent Soul Elders combined forces to attack, which instantly defeated the Demonsquitos. However, by this time, a bloody glow had appeared around Meng Hao and he once again Bloodburst Flashed. This time, he appeared next to the second fleeing Dragoneer. He waved his hand, causing a golden light to surge forward. The man screamed as the golden light completely surrounded his body. After the space of a few breaths passed, the light faded, revealing that the man had been completely turned into gold. He slowly fell down out of the sky.</p><br/><p>The last Dragoneer was an old man who was currently scared witless by Meng Hao’s unprecedented ferocity. He immediately began to tremble violently.</p><br/><p>“Save me!!” he cried, shooting as fast as he could toward Zhao Youlan.</p><br/><p>“What incredible guts!” cried one of the two Nascent Soul Cultivators. The fact that Meng Hao had killed another rank 9 Dragoneer right in front of them, filled them with fury. Their bodies flickered as they once again shot toward Meng Hao, their killing intent billowing out. Even before they neared him, divine abilities were magically appearing.</p><br/><p>“My guts are actually pretty ordinary….” said Meng Hao lightly. As the Nascent Soul Elders neared, he lifted his right hand and pointed toward the two. The Eighth Demon Sealing Hex was immediately unleashed. Invisible strands of Demonic Qi shot toward the two men, instantly binding them.</p><br/><p>The two Nascent Soul experts’ faces fell. Although it wouldn’t take long for the explosive power of their Cultivation bases to free them, their brief moment of shock allowed Meng Hao to once again use the Bloodburst Flash. A bloody glow surrounded him as he shot toward the final Dragoneer.</p><br/><p>“How dare you!” cried another of the Nascent Soul Elders. He immediately teleported away from the shield to appear next to the old Dragoneer. Roaring, he performed an incantation gesture with his right hand, causing a colorful glow to spread out toward Meng Hao.</p><br/><p>“No one can save someone that I want to kill,” said Meng Hao calmly. Without a scrap of hesitation, he clenched his right hand into a fist and struck out toward the Nascent Soul expert.</p><br/><p>A boom filled the air. Meng Hao’s body trembled and he fell back three paces. The Nascent Soul Expert’s face fell and blood sprayed from his mouth. He fell back seven or eight paces, disbelief shining in his eyes. He watched in shock as Meng Hao approached the Dragoneer. Before the Dragoneer could do anything at all, Meng Hao grabbed his neck and crushed it.</p><br/><p>Completely surrounded by an army of thousands, Meng Hao slaughtered three Dragoneers. Not even three Nascent Soul Elders could do a thing to stop him. In fact, one of the Dragoneers had been slain directly in front of one of the Nascent Soul Elders. This scene caused everyone to be filled with shock, not just the Spider Branch Cultivators, but also the members of the Five Tribes within the shield. All of a sudden their blood began to boil as their despair turned into hope!</p><br/><p>“Grandmaster Meng!!”</p><br/><p>“Grandmaster Meng!!!”</p><br/><p>Cries rang out from within the shield, carrying with them the hope and excitement of the surviving members of the Five Tribes.</p><br/><p>Zhao Youlan was panting as she looked at Meng Hao. His actions completely exceeded her anticipations, and as of now, he was turning into a critical factor in the battle.</p><br/><p>“Grand Dragoneer…. One who can directly shake a Nascent Soul Cultivator…. This man has to die!” Even as killing intent sprang into her eyes, her heart trembled and a feeling of grave danger filled her. That was because she had just seen Meng Hao’s eyes!</p><br/><p>In this moment, Meng Hao’s gaze passed over the battlefield, soaring over the vast gulf created between him and her by the three thousand Cultivators.</p><br/><p>His gaze was filled with killing intent. And it was directed at her!</p><br/><p>“He wants to kill me? Those three Dragoneers were too close to him, making them easy targets. He’s much too far away from me, plus there are three thousand Cultivators between us. I have more than ten bodyguards, plus the High Priest and the Elders. How exactly… does he plan to kill me!?”</p><br/><p>-----</p><br/><p><em>This chapter was sponsored by Frank Contreras</em></p><br/>\n</div>"}