{"title": "Chapter 461: Encountering Zhao Youlan Again!", "id": 461, "volume": 5, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-461-encountering-zhao-youlan-again", "volume_title": "Volume 5", "body": "<h1>Chapter 461: Encountering Zhao Youlan Again!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span style=\"\"></span></p><br/><p><strong>Chapter 461: Encountering Zhao Youlan Again!</strong></p><br/><p>Of all the worlds formed by Immortality Bridgestones in this area, this was the largest one listed on Meng Hao’s jade slip map. Meng Hao stood on his three hundred meter wide rock and glanced around the area.</p><br/><p>The sky above seemed extremely stable; there were only a few cracks visible. Mountain ranges rose and fell, and ancient ruins could be seen all over.</p><br/><p>As the rock shot through the air, Meng Hao looked down at the ground. Suddenly, his gaze flickered as he noticed that the mountains down below did not seem to have been formed naturally. They were connected together in what appeared to be a pattern.</p><br/><p>This wasn’t the first time Meng Hao had noticed something like this. The previous worlds he had explored also contained similar sights. However, those worlds had been far too small, so the phenomenon was much less obvious.</p><br/><p>This world, however, was much larger. As he continued to look down at the mountains from up in mid-air, the more he got the feeling there was something very strange about them.</p><br/><p>“They look like magical symbols.” That was what made the most sense. He thought back to when he had first come to the Realm of the Bridge Ruins and seen the countless rocks which formed the shape of an archaic bridge that stretched through the stars. He had also seen magical symbols at that time.</p><br/><p>Obviously, the mountains that made up this mountain range were nothing other than magical symbols. Because of the vast size of this world, Meng Hao was able to see them clearly.</p><br/><p>“The Bridge of Immortal Treading was covered with magical symbols, each of which was most likely a Celestial talisman.” Within Meng Hao’s body, the Qi of Immortal Shows the Way rotated, and he rapidly blinked his left eye several times as he employed the Celestial Vision technique imparted to him by the parrot. [1. He got the Celestial Vision technique in chapter 318]</p><br/><p>As soon as he employed the technique, his body trembled. Using his left eye to look down at the land below, what he saw was not a collection of mountains, but rather multiple black dragons, lifting their heads up to the sky to roar.</p><br/><p>Many of the dragons were broken, but some were mostly intact. Their roaring was shocking to the extreme.</p><br/><p>Meng Hao’s entire body trembled, and he began to pant. He felt as if an invisible mountain were crushing down onto his body. Suddenly, the Celestial Vision technique was ended.</p><br/><p>However, just before it did, Meng Hao managed to catch a glimpse of something off in the distance that was obviously not a black dragon, but shockingly, a black-colored butterfly. The butterfly was indistinct and invisible to any onlooker. Every time it flapped its wings, nearby black dragons would be sucked toward it and be consumed.</p><br/><p>Inside the body of the black butterfly was a large area that was made up of… Celestial soil!</p><br/><p>As the image disappeared, beads of sweat broke out on Meng Hao’s forehead. He had never imagined that using the Celestial Vision technique would allow him to see such a shocking scene.</p><br/><p>As his vision returned to normal, he looked around the land to find that it was just the same as before. The mountains were mountains, and not roaring black dragons. The area off in the distance where he had seen the black butterfly consisted of nothing more than ordinary mountains.</p><br/><p>The only unusual thing about that particular area was that it was a point of convergence for several mountain ranges.</p><br/><p>“Bridge Slaves, black dragons, butterflies…. this Realm of the Bridge Ruins is so full of mysteries.” Meng Hao stood thoughtfully atop the large rock as it whistled through the air. As it began to veer off in a different direction, he looked back toward the area where he’d seen the butterfly.</p><br/><p>“What I saw just now was most likely Celestial soil. I couldn’t possibly be mistaken about that…. If I could get a chunk of Celestial soil that big, then I maybe I can form my Earth-type totem!” The area he had seen with the Celestial Vision left his heart shaken and excited.</p><br/><p>“Rewards come only when you take risks. If you want to rise above others, you have to pay the price!” His eyes filling with determination, he transformed into a prismatic beam that shot off at top speed toward the area where he had seen the butterfly.</p><br/><p>According to Meng Hao’s analysis, of the more than twenty people who had come to this place from the Western Desert, it was unlikely someone else had Immortal Shows the Way and a Celestial Vision technique. Therefore, it was most likely that he was the only one able to see the butterfly.</p><br/><p>As such, the chances were relatively small that he would have to fight over the Celestial soil.</p><br/><p>Since that was the case, Meng Hao would of course not be willing to give up this opportunity. Without the slightest hesitation, he continued on forward. Time passed by, and soon seven days had passed.</p><br/><p>During that time, Meng Hao never stopped moving. On two occasions, he employed the Celestial Vision technique to once again observe the black butterfly consuming the black dragons. He could sense the boundlessness of the butterfly’s aura. It was on the eighth day that he finally arrived.</p><br/><p>It was a place where ten different mountain ranges all converged together. There in the middle was an enormous basin, which was filled with roiling white mist. It prevented Spiritual Sense from extending out very far, and seemed to be imbued with a spirit that could conquer mountains and rivers.</p><br/><p>Meng Hao flew around it once, and then began to frown. He observed the flowing mist with flickering eyes. Finally, he produced a flying sword which he flung out, causing it to whistle through the air toward the mist.</p><br/><p>The instant it entered the mist, Meng Hao sat cross-legged on the border of the basin. He closed his eyes and sent out a fine thread of Spiritual Sense to connect to the flying sword as it shot down through the mist.</p><br/><p>The mist was dense, and the flying sword continued on through it for the time it takes an incense stick to burn. Finally, it emerged into the basin below. Meng Hao could see a dazzling glow. Stretched out below him was a shocking scene; buildings constructed entirely of Celestial soil. Suddenly a figure loomed up within his Spiritual Sense. A booming sound could be heard as the flying sword exploded. A force of extermination then began to shoot back through the Spiritual Sense toward Meng Hao.</p><br/><p>His face flickered, but he was prepared. Almost the same instant in which the flying sword was destroyed, he severed his connection, preventing the exterminating force from reaching him.</p><br/><p>Having cut off the Spiritual Sense himself, Meng Hao’s face went pale.</p><br/><p>“Buildings constructed completely from Celestial soil…. Just what place is this exactly!?” Meng Hao was breathing heavily, and his eyes glittered. Although he had only been able to glimpse the area beyond the mist for a brief moment, it was enough to completely shock Meng Hao.</p><br/><p>“After the Bridge of Immortal Treading was destroyed, it transformed into the Realm of the Bridge Ruins. After all these years, who knows how many times Western Desert Cultivators have come here….</p><br/><p>“I can’t believe that after all these years, no one found this place. And yet, here it is. For there to be much Celestial soil shows how dangerous this place must be! Anyone who tried to enter in the past must have died!”</p><br/><p>When Meng Hao’s train of thought reached this point, his heart suddenly quivered. He waved his hand, and he suddenly vanished.</p><br/><p>Not very long after he vanished, a beam of light appeared off in the distance. It was a woman wearing a long black garment. Her features were beautiful and her skin was like jade. It was none other than… Zhao Youlan!</p><br/><p>She made her way along with caution. After arriving in this place, she did the same thing Meng Hao had done; she flew around in a circle, then found a place to sit near the edge. She was just about to employ a technique to scout out the mist when suddenly her phoenix-like eyes flickered. She waved a beautiful hand, causing a white spider to shoot out in a beam of whiteness and head toward the mist.</p><br/><p>Just when it seemed on the verge of running into the mist, it suddenly jerked into a different direction and shot… directly toward the spot where Meng Hao had vanished from.</p><br/><p>“Don’t dare to show your face?” she said coldly. “Get out here!” The white beam of light shot toward the seeming emptiness. Just as it was about to reach it, ripples appeared, from within which stretched out a finger.</p><br/><p>The finger tapped onto the beam of whiteness, and a miserable shriek could be heard. The light faded away. Meng Hao emerged, his eyes filled with hard coldness.</p><br/><p>“It’s you!” said Zhao Youlan; her pupils constricted and her eyes filling with cold killing intent. Her arm had long since been restored, but her expression still radiated stabbing hatred.</p><br/><p>Meng Hao’s eyes narrowed. For Zhao Youlan to show up here caused many questions to fill his mind. The fact that she was being so cautious indicated that she knew about the bizarreness of this location.</p><br/><p>Even more importantly, when he’d met her before, her Cultivation base had been merely at the great circle of Core Formation. Now, however… it was in the mid Nascent Soul stage. From the ripples of her Cultivation base, he could tell that she was at the peak of that stage, on the verge of stepping into the late Nascent Soul stage.</p><br/><p>In less than a year of time, she had experienced incredible progress. Meng Hao was well aware that such a feat was something rarely seen in the world!</p><br/><p>“Well, that leaves only one possibility,” thought Meng Hao, his eyes flickering.</p><br/><p>As for Zhao Youlan, killing intent flickered within her eyes. She actually admired Meng Hao, but that only served to fuel her desire to kill. The instant she saw him, she leaped up into the air. A three hundred meter wide white glow surrounded her, and an enormous white spider magically appeared. She immediately shot toward Meng Hao.</p><br/><p>Obviously, the influence of the sealing of the Spider Branch’s totemic Sacred Ancient was now gone.</p><br/><p>As Zhao Youlan shot toward him, Meng Hao donned the blood-colored mask. An enormous face appeared, sending out ripples in all directions.</p><br/><p>A roaring sound filled the air, but then Meng Hao vanished. When he reappeared, he was directly next to Zhao Youlan. His fist descended, but even as it did, Zhao Youlan grew blurry and disappeared. She reappeared behind him, and raised her hand. Her thumb and forefinger were touching, and the other three fingers were raised. Killing intent radiated out from her eyes as she tapped down toward Meng Hao’s back.</p><br/><p>He gave a cold snort. Looking down, his body flickered as blood colored ripples spread out in all directions beneath him. A bloody glow rose up into the sky as five figures became visible, none other than Meng Hao’s Blood Clones.</p><br/><p>Rumbling sounds filled the air, and Zhao Youlan’s face flickered. She once again disappeared.</p><br/><p>The two of them teleported back and forth in mid-air as they fought. Booming sounds echoed out in all directions as a dance of divine abilities played out.</p><br/><p>Moments later, Zhao Youlan disappeared in the midst of an explosion to reappear three hundred meters away. She lifted her delicate hand, on which could be seen, shockingly, a drop of blood.</p><br/><p>She tossed out the blood drop, and a sound like the shrill cry of a bird filled the air. The blood drop expanded, transforming into a red phoenix. It spread its wings, and flames leaped up everywhere. Surrounded by fire, the phoenix let out a powerful cry and then shot toward Meng Hao.</p><br/><p>As it passed through the air, an astonishing, scorching heat roiled out in all directions. Meng Hao’s face was grim as he fell back. Eyeless Larva thread spun around him even as the Flame Phoenix engulfed him.</p><br/><p>As soon as the flames engulfed him, killing intent appeared in his eyes. His cold voice echoed out in all directions.</p><br/><p>“Fire? I have that too!”</p><br/><p>-----</p><br/><p><em>This chapter was sponsored by Lantis, Miguel Honrado, Patryk Czajczyński and Jerry Bartlet</em></p><br/>\n</div>"}