{"title": "Chapter 473: Frost Soil Success!", "id": 473, "volume": 5, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-473-frost-soil-success", "volume_title": "Volume 5", "body": "<h1>Chapter 473: Frost Soil Success!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span style=\"\"></span></p><br/><p><strong>Chapter 473: Frost Soil Success!</strong></p><br/><p>At the moment, the vortex on Meng Hao’s right arm was absorbing the power of the Frost soil in the area. This Frost soil, which seemed to be filled with the power to exterminate anything, caused the vortex to gradually begin to coagulate. A glowing white character for Earth was now starting to appear.</p><br/><p>When the ancient character for earth became clearer, Meng Hao’s Cultivation base began to roar as a new power began to make Meng Hao suddenly… even stronger!</p><br/><p>Every beat of his heart sent blood coursing through his veins. A boundary had been reached, and now his Cultivation base grew mower powerful; his Gold Core was even stronger than before.</p><br/><p>“It’s still not enough…. The aura of this Frost soil is actually much more intense than that of the Celestial soil.” His eyes glittered with determination as he rotated his Cultivation base. He focused all his energy on absorbing more power from the Frost soil.</p><br/><p>“I’ve really struck it lucky here to be able to absorb this Frost soil…. If I can use it to form my Earth-type totem tattoo, who knows how much more powerful it will be than a Celestial soil totem…?” His eyes filled with anticipation.</p><br/><p>Roaring filled his body. Despite being stuck in the ice statue, the Frost soil in the area continued to be sucked in, causing it to grow thinner and thinner. However, the effect wasn’t too noticeable; after all, the land mass formed by the Frost soil was enormous.</p><br/><p>Zhixiang wasn’t too far away in another ice statue. At this point, she couldn’t help but look from Han Shan and the woman over toward Meng Hao.</p><br/><p>“What’s he doing?!” she thought. Because of the shocking scene that had been playing out just now, she hadn’t notice Meng Hao’s aura earlier. However, now she did.</p><br/><p>She stared with wide, disbelieving eyes, shaken by Meng Hao’s audacity.</p><br/><p>“He’s absorbing… the Frost soil!!</p><br/><p>“Frost soil is unique in all the Ninth Mountain. According to the legend, long, long ago, even before Cultivators existed, a land mass was born that was completely white and infinitely cold.</p><br/><p>“Eventually, countless years ago, when Cultivators were just beginning to appear in the Ninth Mountain, it gained consciousness. However, as the land of Frost soil expanded, it eventually… turned into a person.</p><br/><p>“He swept over the Ninth Mountain and Sea for countless years, and was known as… the Frost Soil Demon! Eventually, he came to be called an Emperor…. The Frost Soil Demon Emperor!</p><br/><p>“Now, Meng Hao is actually absorbing the power of the Frost soil! Although this particular area of Frost Soil was created by the Bridge Soul of the Bridge of Immortal Treading, clearly, this whole area is the work of the Frost Soil Demon Emperor! If it wasn’t, then the Frost soil could not possibly appear!</p><br/><p>“What Meng Hao is absorbing is not true Frost soil, but rather an ornamental version of it. However, it still far, far exceeds Celestial soil. There’s really not even any way to compare the two.</p><br/><p>“According to the ancient records in the Sect, not including Lord Li, there were three Greater Demons in the ancient Immortal Demon Sect. They were the ones who built… the Bridge of Immortal Treading!</p><br/><p>“Isn’t he worried he’s going to take it too far and die?!?!” Zhixiang had really never imagined that the day would come in which she would be envious of a mere Core Formation Cultivator. True, he could slay Nascent Soul Cultivators, but to see him absorbing Frost Soil was shockingly extraordinary, enough to arouse the jealousy of an Immortal.</p><br/><p>Even as Meng Hao absorbed the power of the Frost soil, Han Shan’s soft sigh could be heard.</p><br/><p>He was looking at his wife, his expression one of warmth. He had heard her words just now, and could also see that her expression was no longer clear, but rather, frustrated again. Deep in her eyes burned a mysterious fire, similar to that which had burned in the eyes of the old man.</p><br/><p>“Come be with me, okay?” said the woman softly. There was something very strange in her voice as she looked at Han Shan.</p><br/><p>Han Shan closed his eyes and was silent for a moment. Then he smiled, a smile filled with warmth. He knew that the person in front of him was no longer his wife. She had truly become the soul of the Bridge of Immortal Treading.</p><br/><p>He knew that the only thing he could do was to kill his own wife. It would be a release; she would no longer be the Bridge Soul, and she would no longer have everlasting life. She would finally be herself.</p><br/><p>Han Shan sighed. He was old now, and his face was filled with wrinkles. His aura was no longer how it had been. He was an old man, seemingly on the verge of death.</p><br/><p>Perhaps his azure robe could conceal the loneliness he had felt for so long, but it could not conceal his ancientness, nor his exhaustion.</p><br/><p>He had searched for three thousand years, had felt guilty for three thousand years. However, when he finally found what he was looking for, it was like this….</p><br/><p>Shaking his head, Han Shan waved his hand. Instantly, the ice surrounding Meng Hao and Zhixiang shattered. Zhixiang immediately retreated backward, blood seeping out of her mouth.</p><br/><p>With each step she took, her face grew more pale; the coldness was once again pressing down oppressively onto her.</p><br/><p>The instant Meng Hao’s ice statue shattered, the Frost soil in the area began to shoot toward him. It transformed into an enormous white vortex that surrounded him.</p><br/><p>As the vortex spun, the Frost Soil in the area began to disappear as it was sucked into Meng Hao’s body. The coldness was oppressive, and an Earth-type aura rose up to the sky.</p><br/><p>The sight of this caused Han Shan’s wife, the new Bridge Soul, to glance over at Meng Hao.</p><br/><p>Han Shan turned his head to look. When he saw Meng Hao, he suddenly laughed.</p><br/><p>“It is what it is,” he said. “It seems the two of us are bound by Karma…. Let me bestow a bit more good fortune upon you.” With that, he lifted his right hand and then pushed it down toward the Frost Soil land mass. Han Shan’s body immediately began to tremble as a white and blue aura began to emanate out from his body and rush down toward the land mass.</p><br/><p>As the aura spread out, Han Shan weakened even further, as if his Essence were being drained. He became even older.</p><br/><p>The blue and white aura merged into the land mass and instantly, the Frost Soil began to change.</p><br/><p>It was no longer just white, but glowed with a blue light. Its aura was completely shocking, and the coldness of it exploded up. The entire land mass began to tremble because of this ancient, archaic aura. It seemed to have existed for a very, very long time.</p><br/><p>It had seen countless forms of life, and knew the warmth and coldness of the world. It had experienced life and death, and had existed throughout the ages. It seemed as if... this Frost Soil land mass which had previously not been true Frost soil, suddenly had transformed into that unique, true Frost soil which had once existed in the Ninth Mountain!</p><br/><p>The white and blue aura was none other than the true power of the essence of Frost Soil Demon Emperor’s clone. Now that he had sent out this power, the land mass below truly was the real Frost soil.</p><br/><p>The land shook as it suddenly began to crumble in on itself and grow smaller. As it did, it quickly became more refined and pure. If you were able to stand far up above the Bridge of Immortal Treading, you would be able to see this process happening.</p><br/><p>The Frost soil which had once stretched out to cover the entirety of the Bridge of Immortal Treading, shrank down in the space of a few breaths. In one moment, Meng Hao could see the edges of the land mass.</p><br/><p>After the space of a single breath passed, it shrank down to a mass of blue soil only three hundred meters wide!</p><br/><p>The whiteness was gone; it was now pure blue. This was the true Frost soil which had given birth to the Demon Emperor in the Ninth Mountain!</p><br/><p>In the blink of an eye, three hundred meters became thirty meters. Thirty meters became three meters. Finally… the three meter wide clump of dark blue Frost soil shot directly toward the vortex on Meng Hao’s right arm, merging into it.</p><br/><p>Roaring filled Meng Hao’s mind as his body slowly floated up into the air. His hair whipped about, and an increasingly intense aura rose up from him.</p><br/><p>Zhixiang backed up, her expression one of shock. Considering that she knew Meng Hao was now absorbing true Frost soil, she was thoroughly astonished.</p><br/><p>It was at this point that the vortex on Meng Hao’s arm completely solidified into a blue Earth character. As soon as it appeared, an enormous land mass of Frost soil magically appeared behind Meng Hao.</p><br/><p>Upon the land mass was a huge tree, which blazed with raging fire. Above the tree was a great metallic, golden river. This was a depiction of Metal, Wood, Earth and Fire!</p><br/><p>Meng Hao’s Cultivation base soared. By now, it had completely sloughed off the Gold core. Meng Hao’s aura merged with the magical image behind him as immense power roared through him. As of now, if Xu Bai and Chen Mo, those two late Nascent Soul Cultivators, battled Meng Hao, it was easy to imagine how difficult it would be to determine who would live and who would die!</p><br/><p>“Take my legacy, take my sword, and take my flagon,” said Han Shan. “Leave this place. If ever the day comes in which you can shake this bridge with your Cultivation base, then don’t forget to repay my kindness. If my wife and I are still here when you return, then I hope you can rescue us.” With that, Han Shan laughed. He was aged and decrepit now, but his will once again surged, a will which despised Heaven and Earth. He flicked his sleeve, causing an azure sword to appear. This sword had never left his side during the past three thousand years. But now, it turned into an azure beam of light that shot toward Meng Hao.</p><br/><p>He flicked his sleeve again, and the alcohol flagon, seemingly filled with boundless sword will, also flew into Meng Hao’s hands. Meng Hao felt his heart stirring. He looked up at Han Shan, somewhat in a daze.</p><br/><p>What he saw was Han Shan’s back. It looked very much the way it had when Meng Hao first saw him. Lonely, bleak, and desolate….</p><br/><p>Han Shan waved his hand, and a cold wind sprang into being. It picked up Meng Hao and the shocked Zhixiang, and carried them off into the distance.</p><br/><p>The cold wind was incredibly strong. Neither Meng Hao nor Zhixiang could do anything to resist the power of the wind as it began to carry them off into the distance. Despite the force of the wind, Meng Hao managed to turn his head around for one last look.</p><br/><p>Han Shan’s gentle voice could just barely be heard.</p><br/><p>“Three thousand years ago, it was because of you that I refused to become a Bridge Slave. Three thousand years later, it is because of you that I make the opposite choice. I will accompany you in such a life. What harm is there in that…?</p><br/><p>“I will lose my consciousness. I will lose any chance to return. However, as long as I can be with you, neither life nor death are of any consequence….</p><br/><p>“During these three thousand years, I thought a lot. Legacies and Cultivation bases don’t really matter. What matters, are dreams…. Without you by my side, I have no world.</p><br/><p>“You are my everything.</p><br/><p>“I’m willing. I am perfectly happy… to exercise faith.”</p><br/><p>When Han Shan opened his eyes, they shone only with confusion. All of his loneliness and bleakness were gone.</p><br/><p>His wife stood next to him. The two of them turned and made their way off into the distance. They were followed by millions of Bridge Slaves, an army of specters… moving further and further away.</p><br/><p>“When will the Bridge of Immortality reappear like new…? Sir, on what day will we again lay eyes on you…?”</p><br/><p>-----</p><br/><p><em>This chapter was sponsored by Merc_Clown, Saurabh Bansal, and Alex Talbot</em></p><br/>\n</div>"}