{"title": "Chapter 471: Frost Soil Demon Emperor", "id": 471, "volume": 5, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-471-frost-soil-demon-emperor", "volume_title": "Volume 5", "body": "<h1>Chapter 471: Frost Soil Demon Emperor</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span style=\"\"></span></p><br/><p><strong>Chapter 471: Frost Soil Demon Emperor</strong></p><br/><p>His voice echoed out within the void, slamming into the incoming millions of Bridge Slaves. However, it didn’t hurt them, but rather bounced off of them, turning into countless echoes. It was as if millions upon millions of voices were responding to Han Shan.</p><br/><p>Because of the way he spoke, his aura exploded out in a way that the word ‘monstrous’ couldn’t even begin to describe. Even the greatest heroes could only accomplish half of what was currently occurring!</p><br/><p>Meng Hao’s mind reeled when he saw Han Shan and the result of his one sentence. He also saw that the Bridge Slaves were not capable of defending themselves against the power of Han Shan. Rather… Han Shan wasn’t willing to hurt them.</p><br/><p>Or you might even say that he feared accidentally injuring them!</p><br/><p>He feared accidentally injuring the person he sought!</p><br/><p>Meng Hao thought back to when he had first caught sight of Han Shan, and the expression in the man’s eyes when he looked at the Bridge Slaves. It was a searching look, a disconsolate look; it seemed as if he was seeking for the only woman in his life.</p><br/><p>It was a woman named Xue’er, his wife.</p><br/><p>His lonely search had lasted for three thousand years….</p><br/><p>Even as Han Shan’s voice echoed about, he suddenly lifted his hand. A grim glow appeared in his eyes as he suddenly made a chopping motion toward the mountain. Instantly, Alcohol Qi roared up.</p><br/><p>Meng Hao also had Dancing Sword Qi, but if you compared it to the amount Han Shan wielded, it was like comparing a firefly to the brilliant moon!</p><br/><p>Alcohol Qi spread out, filling Heaven and Earth. Inside, figures could be seen, all of them resembling Han Shan. As the Qi continued to multiply, more and more figures appeared, until there were no less than a hundred thousand!</p><br/><p>These hundred thousand figures of Han Shan all began to spit out Alcohol Qi. As they did, a vague image started to become visible.</p><br/><p>The vague image was a depiction of a world. It was a complete world, with a sky, land, living people. All of it was very realistic, as if this world belonged to Han Shan.</p><br/><p>An azure sword suddenly appeared in Han Shan’s hand. It chopped down, emitting a monstrous Sword Qi, which spread out and transformed into the image of an azure dragon. Its roar ripped into the void and it began to congeal the Alcohol Qi and absorb the image of Han Shan’s world. Then, it shot urgently toward the palace at the top of the mountain.</p><br/><p>Deadly ripples spread out as it moved. It focused its power, something that far exceeded the divine abilities of normal Cultivators.</p><br/><p>In the blink of an eye, the roaring azure dragon shot through the void shattering everything. At the same time….</p><br/><p>A cold snort could be heard from within the palace. The instant the snort echoed, the coldness out in the void increased to a terrifying level.</p><br/><p>The azure dragon stopped in mid-air, its body already pure white. In the space of a single breath, it was turned into a statue of ice.</p><br/><p>Next, the void began to fill with a sheet of whiteness. The whiteness was frost which appeared out of nowhere. The frost began to merge together into a shapeless mass which spread out in the void. It seemed to stretch as far as the eye could see, with no end, filling the void to create a huge land mass.</p><br/><p>A land mass of Frost soil!</p><br/><p>The land mass of Frost soil was not ice, but rather, a specific type of soil. It contained dense Immortal Qi, several times more so than Celestial soil.</p><br/><p>“Frost Soil Demon Emperor!!” said Zhixiang, her voice hoarse, her face filled with shock and disbelief. She immediately produced an Immortality Bridgestone and crushed it.</p><br/><p>However, once she did, her face immediately fell. The teleportation power of the Immortality Bridgestone did not manifest.</p><br/><p>Zhixiang’s face drained of blood.</p><br/><p>“The Frost Soil Demon Emperor could not possibly be alive! Didn’t he die in battle against the Ji Ancestor?!?!</p><br/><p>“His corpse was taken away and transformed into one of the Immortality Bestowal Daises on one of the four great planets, Planet South Heaven! His Immortal Divinity was ripped out and refined into one of the Ji Clan’s Nine Treasures, the Frost Lamp!</p><br/><p>“All of his disciples and his entire bloodline were taken by the Ji Clan and refined into the Frigid River, which flows through the main gate of the Ji Clan and can never freeze over!”</p><br/><p>Zhixiang’s face grew even paler as she murmured these words. Even though her words were soft, they echoed out within the misty body of the qilin beast and drifted over to Meng Hao, who was relatively close to her.</p><br/><p>At the same time, a voice echoed out from within the palace. When it did, the Frost soil land mass quaked, and the faces of the surrounding Bridge Slaves were no longer filled with frustration. Instead, they brimmed with viciousness. Their eyes turned red and began to emanate crazed killing intent.</p><br/><p>A cold voice could be heard: “Enter my Immortal Demon world, and life or death no longer rests in the hands of the Heavens. With eternal life, what is the point of fate?” As it stopped speaking, it gave a light sigh.</p><br/><p>Next, the masses of Bridge Slaves in the area began to charge toward Han Shan. The qilin beast in which Meng Hao and Zhixiang sat roared, along with the dozens of other beasts similar to it that were present, and charged toward Han Shan.</p><br/><p>Han Shan gave a dour, bitter laugh filled with grief. It grew louder and louder until it seemed to be the only sound in Heaven and Earth.</p><br/><p>“Enter the Celestial Demon world and sever all mortal fate…. I have no such faith!” Han Shan lifted his flagon up to take a drink of alcohol, then turned and shot toward the mountain. As he did, he made another chopping motion.</p><br/><p>The movement of his hand caused everything to shake. A massive fissure opened up ahead of him which then transformed into a sword aura that shot toward the mountaintop. As it got closer, it transformed from something amorphous into something with a shape. However, it quickly became white and, like the azure dragon, exploded into pieces.</p><br/><p>At this moment, the Bridge Slaves were closing in on Han Shan, millions of them. Han Shan’s eyes were red as he turned to face them. He waved his arm, causing a blast of Alcohol Wind to sweep out across them.</p><br/><p>“I don’t want to hurt you. Just bring out my wife…. All of you, don’t force my hand!” He turned and sent more prismatic bands of Sword Qi flying out. In quick succession, nine swords appeared.</p><br/><p>The first band of Sword Qi was three thousand meters long!</p><br/><p>The second band of Sword Qi was thirty thousand!</p><br/><p>By the time the ninth sword appeared, the vast, boundless Sword Qi permeated the entire world of the void. The nine bands of Sword Qi then combined, transferring into an enormous azure Sword Soul which stabbed toward the mountain.</p><br/><p>As the Sword Soul neared, it began to turn white. Cracking sounds could be heard as it got closer and closer. It began to turn dim, and frost appeared on its surface, which cracked and collapsed. This exterminated eight bands of Sword Qi, leaving only one behind. This one slashed down toward the palace.</p><br/><p>Roaring sounds filled the sky. Everything shook, and the palace twisted as an ancient hand appeared from within its depths. The forefinger of the hand pointed out, and the Sword Qi collapsed.</p><br/><p>Han Shan coughed up some blood. He looked up toward the palace, a savage look on his face as he roared: “Bring her out!!”</p><br/><p>Meng Hao’s mind was reeling, and his breath came in ragged pants. He could only watch the scene, his face blank. Everything that was happening far exceeded the comprehension level of a Gold Core stage Cultivator.</p><br/><p>Even Zhixiang was like a cicada in winter, cautious and solemn. She did understand what was happening, but this only served to fill her with more fear. “Sword Immortal Han Shan, a new almighty force who rose up in the Ninth Mountain during the past several thousand years…. And that old man…. He… he looks like the image which hangs in the ancestral shrine of the Sect. He looks exactly like the Frost Soil Demon Emperor….</p><br/><p>It was an old man who had shattered the Sword Qi. He now stood there outside of the palace, wearing a white robe, looking like a transcendent being. His expression was cold, and a mysterious fire burned within his eyes. He gazed coolly down at Han Shan.</p><br/><p>“I will give you a single chance. If you can kill all the Bridge Slaves in the space of one hundred breaths, then your wife will appear for you to see. Furthermore, I can guarantee that your wife is not among the Bridge Slaves outside this mountain.”</p><br/><p>Han Shan glared up at the old man. It was in this moment that the eyes of the Bridge Slaves grew bright red and their faces filled with madness, as if they wished to devour Han Shan alive. It was also in this moment that the first of the Bridge Slaves actually reached him.</p><br/><p>“Screw off!” cried Han Shan, his killing intent billowing up to the Heavens. The sword in his hand swept out, causing a prismatic Sword Qi to appear, along with billowing Alcohol Qi. Everywhere it passed, thousands of Bridge Slaves would explode.</p><br/><p>His killing will had erupted, and Han Shan was going mad. His guilt, his three thousand years of torment, overwhelmed him with madness. He shot toward the Bridge Slaves.</p><br/><p>At some point, a boy had appeared next to the old man. He stood there, smiling and counting aloud, “One, two, three….”</p><br/><p>Booms echoed out as Han Shan’s slaughter reached a pinnacle. It was as if he possessed no powers of reasoning. Everywhere he went, the only thing that existed was a man and a sword. Vast quantities of Bridge Slaves were being slaughtered.</p><br/><p>Sword Qi rocketed up, and a gigantic python was slashed. Mist collapsed, dispersing everywhere.</p><br/><p>However, no matter how Han Shan went about the killing, exterminating millions of Bridge Slaves was not easy to do in the space of one hundred breaths. By the time the boy had counted to thirty-seven, there were still many more left.</p><br/><p>Han Shan roared as he lifted up his right hand and tilted the alcohol flagon over. Alcohol flew out, transforming in mid-air into multiple flying swords. Apparently, this alcohol flagon did not contain alcohol, but rather, a sword.</p><br/><p>One hundred thousand swords appeared. Behind each of these swords was a figure that looked exactly like Han Shan. Each and every one lifted up their swords, and their eyes filled with madness. They scattered, one hundred thousand people slaughtering millions of Bridge Slaves.</p><br/><p>Roaring filled the air as massive numbers of Bridge Slaves died. Gigantic beasts were felled and collapsed into pieces. Eventually, the giant qilin beast that Meng Hao was in was slain by one of Han Shan’s clones. It was at this point that Meng Hao personally experienced the fearsomeness of the Sword Qi.</p><br/><p>It instantly cut the qilin into two pieces. A boom resounded out and blood sprayed from Meng Hao’s mouth. He watched as the Sword Qi neared him. He immediately lost all power to fight or struggle. However, just before the Sword Qi hit him, it stopped for a moment, then went around him.</p><br/><p>Meng Hao’s face was pale. Although the Sword Qi was gone, he was now surrounded by bitter cold. It enveloped him in an an instant, and he lost control of his own movements. He fell down onto the surface of the Frost Soil land mass. In that instant, his body… was instantly covered in frost.</p><br/><p>A sense of deadly crisis swept over him. He didn’t have any time to think; he immediately ignited the Everburning Flame. The power of his Fire-type totem set his Wood-type totem ablaze, adding to the conflagration.</p><br/><p>However, even as the Everburning Flame roared into being, the Earth-type totem vortex on his arm suddenly began to suck in the Frost soil!</p><br/><p>-----</p><br/><p><em>This chapter was sponsored by Martin Schulz</em></p><br/>\n</div>"}