{"title": "Chapter 476: How Could You Be Here!?", "id": 476, "volume": 5, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-476-how-could-you-be-here", "volume_title": "Volume 5", "body": "<h1>Chapter 476: How Could You Be Here!?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span style=\"\"></span></p><br/><p><strong>Chapter 476: How Could You Be Here!?</strong></p><br/><p>Outside of the Crow Divinity Tribes’ mountain, explosions filled the air. The Thorn Rampart spread around the mountain, forming a protective layer. Vines shot out to fight against Yi Chenzi.</p><br/><p>Amidst the booms, the four black mist hands collapsed. Yi Chenzi’s eyes suddenly glittered, filling with ruthlessness.</p><br/><p>“So, you have a protective treasure like this! You’re truly worthy of being a former great Tribe,” he said with a laugh. “Unfortunately, in this violet rain, your vines are like a lamp that’s running low on oil…. If I add it to the blood sacrifice, the results will be even better.” It was at this point that a black moon suddenly appeared behind him.</p><br/><p>This moon radiated darkness, and was instantly surrounded by a seething mist. The sight of it made Yi Chenzi seem like some sort of devil. His aura roared up into the sky as he shot at high speed toward one of the vines. As the vine swept toward him, Yi Chenzi licked his lips and then pointed out with his finger.</p><br/><p>Suddenly, a black moon magically appeared on his fingertip. When it touched the vine, a roaring sound filled Heaven and Earth. The vine trembled, and then exploded. Massive amounts of viscous fluid sprayed about in all directions. The rest of the vines let out sad and shrill calls.</p><br/><p>Yi Chenzi laughed a loud, arrogant laugh. Emanating potency, his expression one of contempt, he neared the mountain’s peak. As he closed in, the other vines, ignoring their injured state, once again move to defend.</p><br/><p>The vine was a simple life form. Even after fusing with the Thorn Rampart, it was not very intelligent. However, it never forgot the mission assigned to it by Meng Hao before he left.</p><br/><p>Protect the Crow Divinity Tribes….</p><br/><p>In its primitive mind, it knew that it would accomplish its mission even if it meant dying the cruelest death in the process!</p><br/><p>Several vines whistled through the air toward Yi Chenzi, who let out a cold snort and flicked his sleeve. The black moon appeared in front of him, emanating a black glow which spread out rapidly in all directions. As soon as the vines touched the black glow, they began to melt. Anguished screams could be heard, causing the more than one thousand remaining members of the Crow Divinity Tribes to clench their fists tightly. Grief and indignation filled their eyes.</p><br/><p>They knew that the only reason the vines were dying in battle was to protect them.</p><br/><p>As the vines were melted by the black glow, and the miserable shrieks echoed out, suddenly, a black beam of light shot out from the violet lake beneath the mountain. It moved with such incredible speed that, in the blink of an eye, it pierced through Yi Chenzi’s black glow and shot directly toward his forehead.</p><br/><p>Yi Chenzi’s expression flickered as a profound sense of deadly crisis filled him. Eyes wide, he let out a roar, the waves of which turned into an attack that battered against the beam.</p><br/><p>Then, the black moon once again magically appeared in front of Yi Chenzi. It shot toward the black beam of light, and when they hit each other, a huge boom filled the air. The black moon collapsed, and the black beam of light continued on toward Yi Chenzi.</p><br/><p>This black beam was a sharp thorn. This thorn was different from the others; it emanated a strong life force. Actually, this was the main life force essence formed by the amalgamation of the vine and the Thorn Rampart.</p><br/><p>Unfortunately, the exterminating power of the violet rain had weakened the vines to a tremendous degree. The same was true of this life force thorn. The fact that it had been blocked twice gave Yi Chenzi enough time to prepare. Even as the thorn shot toward him, he dodged to the side. The sharp thorn cut his cheek as it shot past. Yi Chenzi suffered a flesh wound, but nothing serious.</p><br/><p>His eyes turned red as a savagery appeared that hadn’t been present before. A bloodthirsty glow radiated out as he licked some blood out of the corner of his mouth. His entire expression radiated killing intent.</p><br/><p>“Any living thing that harms me gets turned into a blood sacrifice….” His eyes flickered with a cold glow as he waved his hand toward the violet lake below. A booming sound could be heard as water exploded up. Ripples radiated out as a thirty meter long vine trunk was wrenched up out of the water by Yi Chenzi.</p><br/><p>“So it’s you…. Well, time to die!” He licked his lips, and cruelty glowed in his eyes. He raised his left hand, causing a black moon to magically appear.</p><br/><p>He was just about to send it chopping down toward the vine trunk when the Crow Soldier Tribe Greatfather and the other powerful experts of the Crow Divinity Tribes teleported out to block Yi Chenzi.</p><br/><p>“Screw off!” cried Yi Chenzi haughtily. He waved his right hand immediately causing the Greatfather and the others to tumble backward, blood spraying from their mouths, bodies shaking.</p><br/><p>Just when the looks of despair appeared on their faces as they realized that they were powerless to fight back, the howl of a wolf rose up. Big Hairy, Hairy #2, and the rest of the Greenwood Wolves shot out from a cave in the mountain. Their expressions were listless, but they flew through the air toward Yi Chenzi.</p><br/><p>There was also a red, winged crocodile and an enormous lizard, joined by a flock of black crows and a cloud of green mosquitos. All of them looked downcast, and their auras were weak. Under the continuous onslaught of the violet rain, with its life force of extermination and weakening of spiritual energy, they had been quite seriously injured.</p><br/><p>Even still, it was without hesitation that they shot out, filling the sky. The sight was shocking, even to Yi Chenzi, whose pupils constricted.</p><br/><p>However, it only took a moment for him to sense the aura of the neo-demons. Then, his expression filled with scorn and cruelty.</p><br/><p>“Shrimp soldiers and crab generals,” he said. “Useless troops!” Filled with haughtiness and cruelty, Yi Chenzi waved his left hand to pull the vine trunk up into the air. Then he shot forward, flashing an incantation with his right hand. Multiple black moons magically appeared and shot forward.</p><br/><p>Roaring filled the air, echoing out. Blood sprayed out of Big Hairy’s mouth, and his body was sent tumbling backward. Hairy #2 and the other Greenwood Wolves let out miserable cries as they shot backward like kites with their strings cut.</p><br/><p>The black crows and the mosquitos were instantly sealed by a misty wind. Were they at their peak it might have been a different story. Now, however, no matter how they struggled, they weren’t able to free themselves from the mist wind.</p><br/><p>The winged crocodile and the lizard also let out mournful cries. The power of this black moon divine ability sent them tumbling backward, their bodies on the verge of falling apart.</p><br/><p>Yi Chenzi’s laughter filled the air. None of the neo-demons, none of the Cultivators, were capable of resisting him even the slightest bit. They couldn’t even get close to him. The vine trunk, which was floating there in mid-air, was snatched up by Yi Chenzi. It was now only a hair’s breadth away from death.</p><br/><p>All of the members of the Crow Divinity Tribes up on the mountaintop had looks of despair and misery on their faces. The Crow Soldier Tribe Greatfather wiped the blood off of his mouth and give long, bitter sigh.</p><br/><p>His expression filled with arrogance, Yi Chenzi said, “When Yi Chenzi wants to exterminate a Tribe, no one can escape being part of the blood sacrifice!” Looking scornfully at the neo-demons and the Tribe members, his mouth twisted into a cruel smile. He lifted his left hand up and slowly clenched it into a fist.</p><br/><p>The vine trunk struggled, but as Yi Chenzi clenched his fist, all it could do was writhe. It was clearly moments away from exploding.</p><br/><p>“Die!” cried Yi Chenzi, laughing heartily. However, it was at this moment that a piercing sound suddenly could be heard from off in the distance.</p><br/><p>“You die, b*tch! You little rat! Are you trying to get me in trouble with Meng Hao, b*tch!?!? Dammit, Lord Fifth just went out to get some lunch! You think that means you can wipe this place out?” As the shrill cry echoed in the air, a multicolored streak whistled through the air toward Yi Chenzi’s rear end. As it neared, the sound of a ringing bell also could be heard.</p><br/><p>Yi Chenzi at first stared in shock. Then his face fell. Having no time to continue to crush the vine, he dropped it, allowing it to fly away.</p><br/><p>An incredible sense of deadly crisis appeared once again. Yi Chenzi’s body flickered as he fell back. As he did, a multicolored blur shot through the air in the position he had occupied moments before.</p><br/><p>Cold sweat broke out on Yi Chenzi’s forehead and his heart filled with doubt and dread. He could clearly see that if he hadn’t dodged away, the multicolored streak would have charged directly into where his rear end had just been.</p><br/><p>Thinking about what the horrific result would have been caused even ruthless Yi Chenzi to gasp.</p><br/><p>“Dammit, what is that thing?”</p><br/><p>The multicolored glow materialized into the parrot, who glared threateningly at Yi Chenzi.</p><br/><p>“Bitch, you dare to try to get me in trouble?! I’ll screw you! Screw you to death!” A bizarre glow appeared in the parrot’s eyes as it squawked at Yi Chenzi. Its expression and its voice, coupled with its actions moments before, caused Yi Chenzi’s scalp to grow numb.</p><br/><p>Shouting, the parrot charged forward at incredible speed toward Yi Chenzi. Yi Chenzi gasped and fell back in retreat, flashing an incantation gesture with both hands. Immediately, a black moon magically appeared in front of him as he attempted to defend himself.</p><br/><p>A boom filled the air as the parrot slammed through the black moon. In the blink of an eye, it appeared in front of Yi Chenzi. As it neared, Yi Chenzi could see that it was actually turning through the air… to shoot directly toward his rear end!</p><br/><p>“What is it trying to do!?!?” Yi Chenzi was scared witless. At this critical juncture, his body suddenly transformed into a mist that shot off to reappear three thousand meters away in the distance. Once again, the parrot’s attack met with no results. Immediately, it grew furious.</p><br/><p>“Haiyaaa! You dare to dodge me!? Lord Fifth is definitely going to screw you!!”</p><br/><p>The parrot’s appearance, and its actions, caused all of the members of the Crow Divinity Tribes to stare up in shock.</p><br/><p>Yi Chenzi wiped the sweat from his brow. As of this point, he realized that there was more to this Tribe than met the eye. It seemed weak, but it had vines and neo-demons and then this fearsome thing that apparently liked to attack rear ends.</p><br/><p>Even as Yi Chenzi was filled with shock, the Parrot, enraged by its two fruitless attacks, suddenly let out a mighty, squawking howl. “Beloved concubine!!”</p><br/><p>As soon as the two words rang out, a cloud mass shot toward them from the sky off in the distance. It moved with incredible speed as it neared. Within this cloud mass was none other than the enormous Outlander Beast.</p><br/><p>“Outlander!!”</p><br/><p>The roar of the Outlander Beast shook Heaven and Earth. Yi Chenzi’s eyes went wide, filling with astonishment and fear. He was instantly sent tumbling backward, his eyes shining with disbelief.</p><br/><p>“Dammit, there’s an Outlander Beast here. Just… just what Tribe is this? They even raise Outlander Beasts! I can’t stay here. Dammit! If I had known about all of this I would never have come here. The don’t have many people, but they’re incredibly difficult to exterminate.” Yi Chenzi’s scalp was numb as he unhesitatingly fell back. He immediately transformed into a wisp of green smoke as he utilized his escape art to shot thousands of meters away in the blink of an eye.</p><br/><p>The instant his body reappeared, a cold snort could be heard off to the side. It was at this point that Meng Hao suddenly appeared, having just employed minor teleportation.</p><br/><p>When Yi Chenzi saw Meng Hao, his face immediately filled with shock and then, he screamed. Since returning from the Realm of the Bridge Ruins, he had never screamed like this. It was filled with terror and dread, fuelled by the massive trembling of his own soul.</p><br/><p>“You…. How could you be here!?!?”</p><br/>\n</div>"}