{"title": "Chapter 475: Return", "id": 475, "volume": 5, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-475-return", "volume_title": "Volume 5", "body": "<h1>Chapter 475: Return</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span style=\"\"></span></p><br/><p><strong>Chapter 475: Return</strong></p><br/><p>Booming sounds echoed out as the group scattered. It took only about two hours for vicious looking Yi Chenzi to hold up five severed heads and then begin his blood sacrifice of the rest of the Tribe down below.</p><br/><p>The blood sacrifice lasted for two days, after which Yi Chenzi waved his hand to collect up all the spoils. After performing the blood sacrifice, his Cultivation base was creeping toward a breakthrough.</p><br/><p>“All I have to do is kill a couple dozen thousand more people, and I can have my breakthrough and reach the late Nascent Soul stage! I don’t know the name of this particular Tribe, but they sure were vicious. Of the four or five thousand people, all of them turned out to have Cultivation bases. They must have left the ordinary Tribe members behind to let nature run its course.” Yi Chenzi’s eyes flickered as he pulled out a jade slip. Inside was a map which depicted the Western Desert North region and described it in detail.</p><br/><p>“I can’t afford to provoke the great Five Poisons Tribe, or the great Scorching Ice Tribe. Without a late Nascent Soul Cultivation base, gaining a victory against them would waste too much of my Cultivation base.</p><br/><p>“Damn this violet rain. If it weren’t for the blood sacrifices combined with a bit of Celestial soil, I would have run out of spiritual energy and then died.” Mumbling to himself, Yi Chenzi licked his lips and then looked over the jade slip again.</p><br/><p>“Five Crow Divinity Tribes? They used to be the great Crow Divinity Tribe, which means they should have sent a representative to the Realm of the Bridge Ruins. They just went to war against the great Five Poisons Tribe.</p><br/><p>“This is the Tribe! It’s hard to say how many people they have left, but they used to be a great Tribe. And since they were able to fight back against the Five Poisons Tribe, they must have a lot of resources at their disposal. Most important is that if their representative to the Realm of the Bridge Ruins didn’t die there, then he probably came back with some Celestial soil. Maybe I can get a bit more Celestial soil for myself.” Eyes glittering with a ruthless glow, he was just about to go through with his plan to travel to the five Crow Divinity Tribes when a tremor ran through his body.</p><br/><p>“The person the five Crow Divinity Tribes sent to the Realm of the Bridge Ruins couldn’t possibly be that damnable bastard Meng Hao, could it? I couldn’t possibly be that unlucky, could I?” After thinking about it for a moment, he suddenly laughed at how overly cautious he was being. Twenty three people went to the Realm of the Bridge Ruins. Not counting himself, there were twenty two, all scattered about throughout the whole of the Western Desert. The chances of running into Meng Hao again were extremely small.</p><br/><p>Having reaching this point in his train of thought, Yi Chenzi’s eyes filled with cruelty. His body flickered as he shot off into the distance. During his traveling, he would occasionally run into other Tribes which he instantly slaughtered. His entire path was one of blood sacrifices.</p><br/><p>Along the way, his Cultivation base grew stronger and stronger. At the same time, his temperament grew more and more ruthless. This was even more the case as he felt himself getting closer to the point of breakthrough. His massacres grew even more savage.</p><br/><p>He also moved with greater and greater speed. Soon, he was getting very close to the five Crow Divinity Tribes.</p><br/><p>“I can already smell the odor of flesh and blood….” said Yi Chenzi, licking his lips as he whistled through the air. Suddenly, a mountain appeared up ahead.</p><br/><p>The mountain was bare, and beneath it could be seen a body of water. It wasn’t extremely large, more a large lake than a sea.</p><br/><p>The mountain stuck up out of the middle of the huge lake. At its peaks, a large group of huts had been erected to provide protection against the rainwater. This was the location of the Crow Divinity Tribes. It was now a full five months since Meng Hao had left.</p><br/><p>Of the two thousand Tribe members, there were only a bit more than a thousand left. Several hundred Tribe members had died in the past five months, their life forces exterminated. They had been buried in the mountain, accompanied by weeping, and the funeral dirges of their fellow Clan members. Everyone knew that it wouldn’t be long before the entire mountain… existed at the bottom of the sea.</p><br/><p>Every day, a Tribe member was sent down the mountain with the specific task of measuring how much the water had risen. This way, they could calculate roughly how much time was left.</p><br/><p>“The water has risen less than a meter since yesterday,” said the Crow Gloom Tribe Grand Elder. He sat in a hut next to the Crow Soldier Tribe Greatfather.</p><br/><p>The Crow Soldier Tribe Greatfather’s hair was gray, his face sallow, and his body emaciated. He sat there silently, looking out at the seemingly endless violet rain. When he spoke, his voice was bitter but low, in order to prevent many people from hearing his words. “Five months. Perhaps the exalted Sacred Ancient has already left us. The power of the Thorn Rampart vine is fading…. If he left, that’s fine. However, he promised he would return to us with hope.” The man’s voice was hoarse, and his expression blank.</p><br/><p>“Hope….” said the Crow Gloom Tribe Grand Elder. He looked around at the other Tribe members in the huts. They were silent and gloomy. Their eyes were open, but didn’t seem to look very different than if they were closed. Many of them had bodies as thin as firewood.</p><br/><p>None of them had any hope at all.</p><br/><p>As the spiritual energy of Heaven and Earth faded, as the violet rain fell harder, life was exterminated. This made it difficult for the ordinary Tribe members to survive. Even the Cultivators felt their Cultivation bases withering, making it difficult to maintain their place in their current stage.</p><br/><p>“He’ll come back,” said the Crow Soldier Tribe Greatfather softly. He didn’t speak very loudly, but his voice was filled with passion. He believed what Meng Hao said, and he trusted that Meng Hao would definitely return.</p><br/><p>The Crow Gloom Tribe Grand Elder let out a soft sigh and was about to say something more when suddenly his expression flickered. He looked up into the air. At almost the exact same moment, the Crow Soldier Tribe Greatfather suddenly lifted his head up. Within his withered body, his Cultivation base once again began to rotate. His dismal eyes suddenly began to shine with an aggressive glow.</p><br/><p>It wasn’t just these two. Behind them were two other Tribe members whose Cultivation bases exploded out threateningly as they looked up into the sky.</p><br/><p>During these five months, they were always on guard, always filled with extreme vigilance. Three groups of people had come to attack them, and two had been repelled by the Thorn Rampart vine. As time passed, though, the Thorn Rampart vine began to weaken. In the end, it was submerged by the lake and disappeared.</p><br/><p>By the time the third group came, the Crow Divinity Tribes were forced to fight. During the battle, the Crow Soldier Tribe Greatfather wasted much of his Cultivation base to kill an opponent of the early Nascent Soul stage. His action had ended the conflict.</p><br/><p>After all, in this Apocalypse of Heaven and Earth, mutual loss and death were equivalent.</p><br/><p>In the blink of an eye it seemed, a fourth group had come against them. This time, it was only one person; however, in the current circumstances, one person was even more dangerous!</p><br/><p>This one person approached in a beam of light, emanating a shocking aura. Booming sounds echoed out which carried the power of the peak of the mid Nascent Soul stage. Obviously, this person was just a hair away from the late Nascent Soul stage.</p><br/><p>When the Crow Soldier Tribe Greatfather sensed this Cultivation base, his face flickered with shock. Next to him, the Crow Gloom Tribe Grand Elder was even more astonished.</p><br/><p>The faces of the two behind them instantly turned ashen.</p><br/><p>Considering their level of power, even if the five Crow Divinity Tribes went all out, they would still be unable to protect themselves.</p><br/><p>When Yi Chenzi saw the more than thousand remaining members of the five Crow Divinity Tribes on the mountain peak, he frowned.</p><br/><p>“How could there be so few?” he said with a cold harrumph. Such a small number of people left him feeling that this trip had been somewhat of a waste. Nonetheless, he continued on toward the Tribes.</p><br/><p>“Not many people, but there’s no need to waste,” he said, his eyes glinting with cruelty. As he neared, he stretched out his hand and pointed a finger.</p><br/><p>Immediately, ripples spread out, transforming into a gigantic hand made of black mist. It shot directly toward the mountain.</p><br/><p>Seeing the black hand approaching, the Crow Soldier Tribe Greatfather immediately shot forward at top speed. In the blink of an eye, he was up in mid-air. Roaring, he waved his right hand, causing explosive totemic power to explode out.</p><br/><p>His Metal-type totem roared with power as it shot toward the black mist.</p><br/><p>A boom rattled out, and the black mist hand collapsed. The Crow Soldier Tribe Greatfather coughed up a mouthful of blood as he tumbled backward. When he reached the mountain peak, more blood came out of his mouth, and his body withered. His Spiritual Energy was almost completely dried up. As he laughed bitterly, the rest of the members of the Crow Divinity Tribes rose to their feet, looks of despair filling their eyes.</p><br/><p>“Don’t tell me your Cultivation bases are all withered?” said Yi Chenzi arrogantly. “Well, even if they were normal, killing you would be a simple thing for me. I can’t believe the great Crow Divinity Tribe is so weak! Where are your totemic Sacred Ancients? Where are your magical weapons? You’re so weak you can’t even handle a single blow. A Tribe like this doesn’t even deserve to exist. However, dying in the Apocalypse isn’t as good as being a blood sacrifice to advance my cultivation!” Yi Chenzi actually had a special method for dealing with totemic Sacred Ancients, which was one reason he had been able to sweep across the Western Desert and exterminate so many Tribes.</p><br/><p>Wu Chen stood among the crowds. His body trembling, he shouted, “When the exalted Sacred Ancient returns, he will definitely not let you go! If you dare to raise a hand against the Crow Divinity Tribes, then you will face the wrath of the Sacred Ancient!!”</p><br/><p>His echoing words immediately caused the fire of hope to burn within the eyes of the members of the Crow Divinity Tribes.</p><br/><p>“The Sacred Ancient will definitely return!”</p><br/><p>“The Sacred Ancient will come back carrying hope!!”</p><br/><p>Yi Chenzi laughed scornfully. “Your Sacred Ancient is going to come back? So, even your Sacred Ancient abandoned you. Even if it does come back, I can seal it and make it watch as I sacrifice all of you.” He raised his hand again.</p><br/><p>This time, ripples spread out in four directions to transform into four black mist hands. They linked together into something that looked like a black dragon bursting with killing intent. They immediately shot toward Crow Divinity Mountain.</p><br/><p>Just as despair filled the faces of the members of the Crow Divinity Tribes, just when the hand was almost upon them, four tentacles suddenly erupted out from the water below. They moved with incredible speed toward the four hands. At the same time, thorns suddenly spread out around the mountain, completely encircling it.</p><br/><p>Unfortunately, the weakness and exhaustion of the vines and the thorns was readily apparent.</p><br/><p>It was at this moment that, about four hundred kilometers away from the five Crow Divinity Tribes’ mountain, up above a rushing river, an area of distortion suddenly appeared. It was like a tear in the very air that opened up into a hole.</p><br/><p>From within the hole, a figure emerged. He wore a green robe and had long black hair that whipped about in the wind. He was handsome and had an energetic demeanor. This was… Meng Hao!</p><br/><p>He had returned in much the same manner as he had left, having been teleported back some distance from where he left. Generally speaking, this was normal. The return spot was usually within about five hundred kilometers of the point of departure.</p><br/><p>Meng Hao rubbed the bridge of his nose as he looked around. Having confirmed his position, he sent his Spiritual Sense out. He immediately sensed the vine, and through it, could see in image of what was happening currently in the Crow Divinity Tribes.</p><br/><p>Meng Hao’s eyes immediately filled with with an unspeakable, raging anger. When he spoke, his voice was like like a freezing wind. His Cultivation base exploded out, immediately causing much of the rain in the vicinity to turn into ice!</p><br/><p>“Yi Chenzi!!!”</p><br/><p>-----</p><br/><p><em>This chapter was sponsored by Gentleman, Timofeev Semen, and George Chang</em></p><br/>\n</div>"}