{"title": "Chapter 485: Blood Clone is Born!", "id": 485, "volume": 5, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-485-blood-clone-is-born", "volume_title": "Volume 5", "body": "<h1>Chapter 485: Blood Clone is Born!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span style=\"\"></span></p><br/><p><strong>Chapter 485: Blood Clone is Born!</strong></p><br/><p>An aura which shocked even the three totemic Sacred Ancients of the Five Poisons Clan danced out madly from the blood sphere. Astonished, they went all out, using all the faith power they could muster, sparing no effort as they broke past the seal that was the Outlander Beast. They too began to strengthen the blood sphere seal.</p><br/><p>“We must not allow him to come out! Do not let him out!”</p><br/><p>The rest of the Five Poisons Tribe’s Priests also sustained injuries as they shot toward the shrinking blood sphere. Five of them broke through and, filled with astonishment and fear, began to bolster the sealing.</p><br/><p>The combined force of seven Nascent Soul Cultivators and three totemic Sacred Ancients all poured into the sealing power of the blood sphere.</p><br/><p>The surrounding Crow Divinity Tribe members were in a frenzy as they also tried to break through. The Five Poisons Tribe members desperately fought back. The intensity of the battle instantly increased.</p><br/><p>However, despite the fact that peak of the Five Poisons Tribe’s power was focused on the blood sphere seal, it continued to shrink. Soon, it was only three meters wide. By this time, virtually all of the Five Poisons Tribe spirits had been forced out. The magical faces had expressions of torment as they dissipated into the area.</p><br/><p>Even more shocking, a horrifying aura exploded out from the blood sphere, the strength of which instantly started to suffocate the seven Nascent Soul Cultivators. Their faces were pale as the aura slammed into them, causing a roaring sound to fill their minds as they coughed up blood.</p><br/><p>The faces of the three totemic Sacred Ancients filled with an unprecedented level of fear and shock, to the extent that… their bodies even began to tremble!</p><br/><p>There were now absolutely no spirits of the Five Poisons Tribe on the blood sphere; in the blink of an eye, all consciousness within it disappeared, replaced by the magic of the Blood Immortal. At the same time, it shrank down into the form of a person!</p><br/><p>That person bore the semblance of Meng Hao!</p><br/><p>“Kill him!” roared the Five Poisons Tribe Greatfather at the top of his lungs, seemingly on the verge of going mad. He had now abandoned any attempts at sealing, and instead unleashed deadly divine abilities against the blood-colored figure.</p><br/><p>The others did the same. Booms echoed out as the three totemic Sacred Ancients attacked. However, the blood-colored figure didn’t even react. That in itself caused the face of the Five Poisons Tribe Greatfather to fill with astonishment.</p><br/><p>“This Meng Hao refined the Heavenly Blood! He… he’s actually refining it into a creature of blood!!”</p><br/><p>“That’s impossible! That Heavenly Blood was acquired by one of the ancestors by a fluke. The power it contains is fearsome to the extreme. How could a Cultivator possibly fuse it…? Throughout the years, all those in the Tribe who tried to fuse it died! The best we could do was come up with magic to control it!”</p><br/><p>The Greatfather and the others felt their minds reeling, and their expressions were that of shock.</p><br/><p>Even more bitterly painful was that their Tribe’s prized treasure, their secret weapon to destroy the enemy, had been refined successfully. It was almost as if they had handed over their precious treasure as a gift. This thought caused them to feel incredible vexation.</p><br/><p>This was a critical moment for Meng Hao in the refinement process of the Blood Clone. He suddenly had an intense feeling that this Blood Clone was completely different from the other Blood Clones he had created in the past. They were like fireflies and this was like the bright moon!</p><br/><p>“So, this Ji Clan Blood Clone turns out to be THIS powerful….” Such an incredible level of power far exceeded Meng Hao’s imagination. Right now, he could detect faint signs that as he continued with the refinement, the will of the blood was slowly awakening.</p><br/><p>This was one of the functions of the Blood Immortal magic. Based on some factors which Meng Hao didn’t fully comprehend, it was able to force out the bloodline power concealed within the blood!</p><br/><p>The more ancient the blood, and the purer the bloodline power, then the more powerful the Blood Clone would be!</p><br/><p>Meng Hao took a deep breath. He knew that what he needed to do now was find something to act as the core of the clone. If that core was indestructible, then the clone was indestructible!</p><br/><p>The Blood Clones Meng Hao had created in the past looked crude, and had been refined using the meat jelly skin. However, their usefulness to Meng Hao had been significant.</p><br/><p>The successful refinement of this particular Blood Clone, and its fearsome level of power, was something that even the information about the Blood Immortal magic did not discuss. Even the Blood Immortal had never anticipated that something like this could happen. Even the Blood immortal had never created a clone like this particular… Ji Clan Blood Clone.</p><br/><p>After all, the Blood Immortal completely looked down on ordinary Ji Clan members. The main goal was to refine the blood of direct descendants of the Ji Clan. Even Blood Clones created from the blood of direct descendants, however, would pale in comparison to the Ji Clan Clone which was about to appear!</p><br/><p>That was because one of the drops of blood that made this clone was from a Chosen of the Ji Clan. Another was from the ancient Ji Nineteen. The final drop, the drop that determined exactly how fearsomely powerful the Blood Clone would be… had an origin that even Ji Nineteen couldn’t ascertain. The only thing he could tell was that this drop of blood came from primordial times, and was as powerful as the blood of an original ancestor!</p><br/><p>It was that final drop of blood that made this Blood Clone completely different. In fact, if Meng Hao was able to get six more drops of blood in the future, and fuse them into this blood Clone, then he could form a complete Blood Divinity. In that case, the power of Ancestral Awakening would be unleashed, and that mysterious Ji Clan ancestor would appear!</p><br/><p>When that time came, it might be possible to recognize this person… and determine his true identity!</p><br/><p>Echoes filled the air as the peak of the Five Poisons Tribe’s power was unleashed in attack. The blood-colored figure which surrounded Meng Hao was writhing in a bizarre fashion. However, it didn’t matter what divine ability was leveled against it, nothing could stop the figure from fully forming.</p><br/><p>The blood figure slowly became more refined; Meng Hao’s features slowly became clearer. In the blink of an eye, a bloody glow suddenly began to extend like water out from the figure.</p><br/><p>The face of the Five Poisons Tribe Greatfather fell. He could sense a shocking aura that was currently being held back by the blood-colored figure that surrounded Meng Hao.</p><br/><p>“Don’t hold anything back. Exterminate him!” bellowed the Five Poisons Tribe Greatfather. He flashed an incantation with both hands and then spit out a mouthful of blood. His body instantly withered a bit, but in exchange, a five-colored mist suddenly appeared that roiled toward Meng Hao.</p><br/><p>The High Priest’s face flickered as he flashed an incantation with his right hand. The totems on his body magically manifested into a creature that was the amalgamation of all of the five poison creatures. It instantly charged toward Meng Hao.</p><br/><p>The rest of the other five Nascent Soul Cultivators all unleashed their most powerful divine abilities.</p><br/><p>As for the three totemic Sacred Ancients, their bodies suddenly began to shrink until they were each no more than a meter or two long. This meant that their bodies were now refined and pure. They charged toward Meng Hao, fully able to sense that the bloody glow coming off of him was something so shockingly powerful that it could constrain and crush even them. Such constraining force was shocking to them, and they instinctively knew that they needed to destroy it before it fully appeared. It was a premonition that arose from within their souls and their blood. Once the bloody glow fully took shape, it wouldn’t matter that the three of them were totemic Sacred Ancients. In front of such attacking power, they would be crushed like dried reeds or rotten wood.</p><br/><p>It was an instinctive premonition, a fearsome intuition!</p><br/><p>However, even as their divine abilities and magical techniques descended, the bloody glow which surrounded Meng Hao suddenly shrank down to form a red dot on his forehead. Meng Hao’s eyes suddenly snapped open.</p><br/><p>The instant his eyes opened, the glowing bloody dot on his forehead flew out. It emitted a shocking, high-pitched howl that sent sound waves roaring out. Banging sounds could be heard in all directions as all the seals which had been in place were shattered.</p><br/><p>The glowing, bloody dot instantly transformed into a bloody beam of light that shot toward the viper totemic Sacred Ancient. The viper Sacred Ancient immediately recoiled, a look of astonishment and despair written on its face. A trembling shook it which arose from its very soul, washing over it like floodwaters. Faced up against this bloody beam of light, it was as if it had lost all its power to fight back, as if it in its awe, it lost all confidence!</p><br/><p>The bloody beam of light moved with indescribable speed as it slammed into and then passed directly through the viper Sacred Ancient.</p><br/><p>The viper Sacred Ancient’s entire body turned pale white as its essence, its life force, its blood, everything was instantly sucked away by the bloody figure.</p><br/><p>This level of potency was like Heavenly might. If it wanted you dead, then you had no choice but to die. This Blood Clone was a Ji Clan Blood Clone, and the Ji Clan was the Heavens of the Ninth Mountain and Sea!</p><br/><p>If it wanted to take everything away from you, then any resistance you offered would be futile. To the Ji Clan, any person who was not of Ji, was a heretic!</p><br/><p>For example, this totemic Sacred Ancient, which originated from the ancient Immortal Demon Sect, a Sect that… the Ji Clan had been forced to eradicate!</p><br/><p>The death of the totemic Sacred Ancient instantly turned into a clap of thunder that shook the hearts of the Five Poisons Clan Cultivators! The faces of the Greatfather and the High Priest and the others all fell!</p><br/><p>“Impossible!!”</p><br/><p>“Sacred Ancient…. The exalted Sacred Ancient was absorbed….”</p><br/><p>“This is… this is….” Even as the corpse of the viper Sacred Ancient began to fall to the ground, there were around ten thousand of the Five Poisons Tribe members who coughed up blood and began to wail. The totems on their bodies began to fade and their Cultivation bases began to drop.</p><br/><p>There were even several among the more than ten Priests who coughed up blood and began to tremble, their faces filled with disbelief.</p><br/><p>“The Sacred Ancient… perished!!”</p><br/><p>As the bloody beam of light swept through the air, a strange, shocking sound rang out that sounded like something was being swallowed. The echoing sound caused everyone, even the other two Sacred Ancients, to instantly cease any attack and immediately fall into retreat. A blood-coloured face suddenly appeared around Meng Hao. Rumbling could be heard. He fell back a few paces, then used minor teleportation to suddenly appear off in the distance, where he charged into the besieging Five Poisons Tribe.</p><br/><p>“Blood Clone…” he said coolly. “You may continue to feed.” Killing intent flickered in Meng Hao’s eyes. The bloody beam of light emitted a shout, then suddenly materialized into a figure.</p><br/><p>It looked exactly like Meng Hao, except that it emanated a bloody glow and had bright red eyes. Its body flickered as it shot at incredible speed toward the other two totemic Sacred Ancients.</p><br/><p>The two Sacred Ancients fell back almost instinctively, moving as fast as possible. Unfortunately, even if they moved faster than that, they would be unable to go faster than the Ji Clan Blood Clone.</p><br/><p>“Neo-demons…” cried Meng Hao, his voice echoing out. “I am your Demon Patriarch. Today, you may slaughter to your heart’s content!” 40,000 neo-demons remained in his horde. Nearly half had been killed. At this moment, however, those remaining 40,000 neo-demons lifted their heads up and roared a roar that shook the Heavens. Boundless Demonic Qi suddenly rushed toward Meng Hao and then spread out to be absorbed by the neo-demons. In addition, the neo-demons of the Five Poisons Tribe suddenly began to tremble and emit subservient whines.</p><br/><p>Under this sudden counterattack, the Five Poisons Tribe Cultivators were thrown into complete chaos!</p><br/><p>“Exercise faith in me! Tribe members who offer worship to me, I am your totemic Sacred Ancient. Those who show faith in me, have my totems…. The Five Poisons Tribe is our archenemy. It is time to settle our differences once and for all!” He waved his sleeve causing a Greenwood Tree to magically appear. A sea of flames roared up into the sky. A golden rain spread out. Frigid soil began to freeze everything!</p><br/><p>The thousands of Tribe members who remained of the Crow Divinity Tribe had bright red eyes. It was with complete madness that they charged the terrified Five Poisons Tribe members!</p><br/><p>Meng Hao’s eyes glinted with harshness, and his voice echoed out like thunder, causing Heaven and Earth to split: “Kill them!”</p><br/><p>-----</p><br/><p><em>This chapter was sponsored Adrian Mardare, Alexander Kubiak and Anon</em></p><br/>\n</div>"}