{"title": "Chapter 491: A Familiar Vortex", "id": 491, "volume": 5, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-491-a-familiar-vortex", "volume_title": "Volume 5", "body": "<h1>Chapter 491: A Familiar Vortex</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span style=\"\"></span></p><br/><p><strong>Chapter 491: A Familiar Vortex</strong></p><br/><p>The voice did not just echo out in the mind of Meng Hao’s Demonic Incarnation in the Eight Branch Alliance, but also in the mind of his true self, which was currently speeding through the air in exactly that direction.</p><br/><p>Meng Hao’s mind in the Demonic Incarnation trembled, but his expression did not change in the slightest. He turned and walked off slowly. His inspection of the spell formation, and his sudden shock, was not noticed by any observers. As he walked off into the distance, the Divine Sense which had latched onto him slowly vanished.</p><br/><p>Deep in the night, Meng Hao sat quietly in the tent, eyes closed.</p><br/><p>Sun Dahai was already in a meditative trance. Although he was not one hundred percent at ease with this place, he felt it to be fundamentally safe. He was eighty percent sure that the Eight Branch Alliance was only interested in doing business.</p><br/><p>Meanwhile, the fact that the Crow Divinity Tribe had a Demon Spirit was not possible to conceal from the other seven Tribes that made their home in this part of the Western Desert Central region. They all became aware of it.</p><br/><p>“That’s….”</p><br/><p>“A Demon Spirit!! It’s a Demon Spirit!”</p><br/><p>“A Demon Spirit has actually appeared! We have to get it!!”</p><br/><p>Two of the Tribes sensed the Demon Spirit first. The other five took longer but were equally shocked. Of the seven, five immediately dispatched people toward the place indicated on the Feng Shui compass.</p><br/><p>In a very short period of time, the entire region was sent into a turbulent commotion.</p><br/><p>The glowing dots on the Feng Shui compasses held by the High Priests of the various Tribes caused their hearts to fill with astonishment. Even as they dispatched their forces, the Eight Branch Alliance called a parliament of the Greatfathers and High Priests of the eight Tribes. Instantly, a heated debate discussion.</p><br/><p>“Dammit! Why did a Demon Spirit have to appear at this time!?”</p><br/><p>“According to our scouts, the surrounding Tribes have already taken action. Furthermore, the Demon Spirit is heading directly toward our Eight Branch Alliance! If nothing unexpected happens, the Demon Spirit will be on top of us in two days, which is exactly when the forces of the other Tribes will arrive! There will definitely be fighting and robbing!”</p><br/><p>“Should we delay the bringing in of the net…? After all, our plan is extremely important, but a Demon Spirit… is equally important!”</p><br/><p>“The ideal situation would be one in which we successfully bring in the net AND acquire a Demon Spirit….”</p><br/><p>As the discussion continued, an old man sat in the seat of honour. He wore a red robe and had his eyes closed. After a while, he suddenly opened his eyes.</p><br/><p>“Enough!” he said, his voice ringing out like a clap of thunder. All of the other individuals in the tent instantly went silent.</p><br/><p>“Demon Spirits are well and good. However, to the Eight Branch Alliance, what is most important is restoring the power of the Sacred Ancient. In the Western Desert East region, our Eight Branch Alliance’s strength was significantly damaged. All of you received serious injuries. Even more importantly, we must not be rash when it comes to our Cultivation bases. If our totems are damaged, it could put us in danger of Cultivation base loss.</p><br/><p>“That’s also the reason why we are resting in this location; exterminating the other tribes in the area is not something easy to do.</p><br/><p>“Have you forgotten the main point of the plan? We attract more and more Cultivators to this area, and then use the power of the spell formation to carry out a blood offering. That will restore the glory of our totems! Actually, for the Demon Spirit to come is a good thing!</p><br/><p>“In fact, there actually couldn’t be a better way to get more people to come here!” By the time the man finished speaking, his eyes were glowing with a cold light.</p><br/><p>The other Cultivators of the Eight Branch Alliance began to nod silently.</p><br/><p>Final preparations were made. Two days later at dawn, the Eight Branch Alliance began the auction.</p><br/><p>A huge crowd of people was present, more than twenty thousand. As such, there was no special location for the auction; instead, it took place throughout the entire city.</p><br/><p>Early in the morning, all of the buildings and shops in the city disappeared without a trace. What was left behind was a vast, empty square. Eight Branch Alliance Cultivators emerged from the surrounding tents to maintain order.</p><br/><p>Everyone who was to participate in the auction held a jade slip in hand. These jade slips had been distributed a few days before, one for each person, including Meng Hao and Sun Daihai.</p><br/><p>“It’s going to begin!” said Sun Dahai excitedly. Despite being a Nascent Soul Cultivator, he had never participated in an auction before.</p><br/><p>Meng Hao, on the other hand, was quite used to such affairs. The pill auction back in the Violet Fate Sect had been attended by a hundred thousand Cultivators. That auction was above and beyond this one in both terms of scale and grandeur.</p><br/><p>A glowing screen appeared up above, from within which appeared a man. His handsome face was as white as jade. Smiling, he clasped hands and bowed to the thousands of Cultivators below.</p><br/><p>“We meet again, Fellow Daoists! I am Dong Hanzi, with whom which many of you are already acquainted, since I presided over the previous four auctions.</p><br/><p>“Today’s auction is the final auction to be held by the Eight Branch Alliance. The rules are the same as ever. All of you have a jade slip, which you can brand with a value. That value will appear up here.</p><br/><p>“There’s no need to prattle on. Our first lot for the day….” As Dong Hanzi’s voice rang out, the auction officially began. The first lot instantly caused quite a commotion. Prices branded onto jade slips immediately began to appear on the illusory screen up in the air. The prices instantly began to climb higher and higher.</p><br/><p>Sun Dahai’s eyes went wide as he stared at the prices on the screen. As for Meng Hao, he didn’t pay much attention to the auction. Instead he was looking around the area thoughtfully.</p><br/><p>Time went by and the excitement in the auction continued to grow. After four hours had passed, when it was almost high noon, Dong Hanzi offered up a totemic Sacred Ancient for auction. It was at this point that the auction seemed to reach its peak.</p><br/><p>Regardless if it was in terms of values being called out verbally or branded on the jade slips, the price continued to rise shockingly. It seemed relatively chaotic, but order was actually being maintained. By this point Sun Dahai was thoroughly wrapped up in his excitement; he held his jade slip in hand as he participated in making bids.</p><br/><p>All of the twenty thousand people in the area seemed to be going crazy. Only Meng Hao, his face hidden within the depths of his black cloak, seemed to remain calm.</p><br/><p>“This Demonic Qi spell formation really is something!” he thought, his eyes glittering coldly. Earlier in the morning, when the auction had just started, he saw the spell formation beginning to operate. By now, it was rotating rapidly, congealing large amounts of Demonic Qi, then sending it undulating out invisibly to influence the emotions of the Cultivators in the area.</p><br/><p>These undulations were causing the twenty thousand participants to slowly act like lunatics.</p><br/><p>In complete contrast, the Cultivators of the Eight Branch Alliance, who had recently been the shopkeepers and other shop workers, were circulating in the area, cold, mocking smiles on their faces.</p><br/><p>Suddenly, Meng Hao caught sight of a boundless mist approaching from off in the distance. It impossible to say when it appeared, but it spread out to cover the area. Furthermore, there were sixteen Cultivators floating up in the air, looking down coldly at the crowds.</p><br/><p>Of these sixteen people, half were of the early Nascent Soul stage, and four were of the mid-Nascent Soul Stage. Shockingly, two were of the late Nascent Soul stage.</p><br/><p>One of them was Ou Yunzi, another was the man dressed like a scholar, and a third was the woman dressed in a Lady’s robe.</p><br/><p>The power of the Cultivation bases of these sixteen people began to spread out. However, Meng Hao could tell that all of the Cultivation bases were unstable, as if they were being held together with great difficulty. A few of these people actually emanated a faint Demonic Qi.</p><br/><p>Meng Hao’s expression was cold after glancing over them and then looking back at Sun Dahai. He suddenly spoke out Sun Dahai’s name. As soon as the man heard his name being called out, a tremor ran through his body. The crazed look faded from his eyes and turned into confusion, then astonishment. He knew that there was something wrong with his behaviour just now.</p><br/><p>Panting, he looked around, his heart filled with caution. When he saw the crazed look on the faces around him, and the prices climbing rapidly, cold sweat broke out on his forehead.</p><br/><p>He subconsciously turned to look at Meng Hao and then said, “Sacred An….”</p><br/><p>“Come with me,” said Meng Hao calmly. Sun Dahai immediately followed Meng Hao as he worked his way through the crowd. They didn’t draw much attention, and very quickly reached a certain location where Meng Hao came to a stop.</p><br/><p>“This position is safe. If something unexpected happens, don’t forget to sit down here and meditate. Don’t take a single step away.”</p><br/><p>Sun Dahai was a shrewd and astute person. Earlier, he had been under the influence of the spell formation, but now that he had come to his senses, he could sense the strangeness in the area. Having heard Meng Hao’s words, he nodded in agreement. He had already decided that no matter what happened, he would not move away from this spot.</p><br/><p>At the same time, his admiration for Meng Hao grew to even greater heights. He looked at Meng Hao, and although he couldn’t see his face within the blackness of his cloak, he could sense Meng Hao’s eyes looking toward the center of the trade outpost city.</p><br/><p>Meng Hao merged his Spiritual Sense with Demonic Qi and sent it out into the ground. He watched the spell formation rotating faster and faster; at the same time, the mist in the area continued to grow thicker.</p><br/><p>“High noon is when the earth is aligned directly with the sun. At this moment of extremes… Yin is at its hardest and Yang as at its softest!</p><br/><p>“Demonic Qi, or whatever kind of Qi it is, regardless of whether it is hard or soft, will appear at noon!” Meng Hao quickly calculated the current time.</p><br/><p>“Only three more breaths of time…. Three, two, one….” A bright light shone in Meng Hao’s eyes as he watched the wildly rotating spell formation cause the mist in the area to churn. At the same time, the ground below began to change color. Now it was red, like fresh blood.</p><br/><p>Strands of Demonic Qi began to float up to fill the air. Shockingly, the Demonic Qi started rotating, transforming into a huge vortex that filled the sky.</p><br/><p>Of course, Sun Dahai couldn’t see any of this. To him, everything seemed normal. The sky was still the sky and nothing was different.</p><br/><p>To Meng Hao, however, what he was seeing was shocking to the extreme.</p><br/><p>As for the sixteen Cultivators in mid-air, they were performing incantation gestures. Then, they began to let out growling roars as sixteen streams of magical symbols suddenly began to spread out toward the vortex up in the sky.</p><br/><p>No one could see the gigantic vortex, only Meng Hao. The sight of it was actually somewhat familiar, as if he had seen something similar before in another place.</p><br/><p>As the vortex spun rapidly, a black hole suddenly appeared in its middle. Within that black hole… another world suddenly became visible!</p><br/><p>As the world became visible, Meng Hao’s heart filled with astonishment, and an expression of disbelief appeared on his face. He suddenly realized what that place was!</p><br/>\n</div>"}