{"title": "Chapter 498: Absorbing the Eight Branches", "id": 498, "volume": 5, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-498-absorbing-the-eight-branches", "volume_title": "Volume 5", "body": "<h1>Chapter 498: Absorbing the Eight Branches</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Thousands upon thousands of faces shot out in all directions. They had no choice other than to submit to Meng Hao, which of course caused the remaining thousands of members of the Eight Branch Alliance to begin to tremble as the totems in their bodies forced them to kneel down and bow to Meng Hao.</p><br/><p>The five Nascent Soul Cultivators, including the two of the late Nascent Soul Stage, were also shaking, unable to control themselves as they began to kowtow to Meng Hao.</p><br/><p>Totems are the source of incredible power to Western Desert Cultivators, and also the reason why there are so many more high level Cultivators there than in the Southern Domain. At the same time, though… they are also a deadly weakness!</p><br/><p>When a totem dies, any Cultivators who exercise faith in it will experience a drop in Cultivation base. Furthermore, when a totem surrenders, so will the Tribe members connected to it. This is a condition, perhaps even a restriction.</p><br/><p>In some ways, Western Desert Cultivators are actually slaves of their totems!</p><br/><p>Were it not for that, the Western Desert, given its vast population, would have long since expanded out of their lands and overrun the Southern Domain.</p><br/><p>A perfect example was this situation; now that Meng Hao had the Devil Spear, he was in control of the totemic faces. You could say in some ways that Meng Hao was now the Sacred Ancient of the Eight Branch Alliance!</p><br/><p>“Sacred Ancient!” cried the members of the Crow Divinity Tribe. Expressions of excitement could be seen on their faces as they kowtowed to him. The surrounding tens of thousands of neo-demons roared, causing the ground to shake and their aura to shine brightly.</p><br/><p>The other Tribes who had come for the Demon Spirit were shaken, and their faces flickered with various expressions of fear and astonishment. They had personally witnessed Meng Hao’s battle right now, and also saw the Eight Branch Alliance capitulate. Considering all of that, they no longer felt themselves to be in any position of superiority.</p><br/><p>Meng Hao floated in mid-air, clutching the Devil Spear in hand. He looked at the vortex up in the sky as it slowly shrank down and then disappeared. In the moment that it winked out, an archaic voice filled his mind.</p><br/><p>“I am waiting for you in the Primordial Demon Immortal Plane….”</p><br/><p>The winds and clouds up above tumbled and turned, and the vortex was gone. Everything was returned to normal. The invisible vortex that no one except for Meng Hao could see, was now thoroughly vanished.</p><br/><p>Meng Hao looked around thoughtfully, his eyes shining brightly, the Devil Spear gripped tightly in his hand.</p><br/><p>“Ladies and Gentlemen who have come for the Demon Spirits, shall we fight, or not?” His cool voice echoed out, causing the Crow Divinity Tribe members’ killing intent to radiate out visibly. The neo-demon horde roared. They were like a crossbow, cocked and ready to fire!</p><br/><p>The Greatfathers from the other Tribes felt their hearts pounding. Meng Hao’s power seemed sharper than a needle, and they didn’t possibly dare to try to fight back against him. They exchanged glances, and then one of their number quickly said, “You misunderstood, we actually came here to exterminate the Eight Branch Alliance…. However, they seem to have been absorbed by you, Fellow Daoist, so we’ll take our leave now.”</p><br/><p>After he finished speaking, the others voiced their agreement. The Tribe members were surreptitiously edging backward. From the look of things, there would be no more fighting, although it was impossible to tell for sure.</p><br/><p>Meng Hao looked around at the Tribes, and then slowly said. “Each Tribe will leave behind ten thousand neo-demons, then you may leave.” Instantly, a black mist began to spread out from the Devil Spear.</p><br/><p>When the Greatfathers heard his words, they frowned and hesitated. Finally, a cold snort could be heard from one of the Greatfathers off in the distance.</p><br/><p>“Are you kidding? If my Radiance Sifting Tribe wants to leave, nobody can stop us!” The Greatfather of the Radiance Sifting Tribe was actually an old woman, making her a Greatmother. Having spoken, she flicked her sleeve and began to fly away with her thousands of Tribe members.</p><br/><p>She truly was confident that if she left with her Tribe, there was no one that could do anything to stop them. Even though Meng Hao had the Devil Spear, and was clearly mighty, he had just experienced a difficult battle. It was impossible for him not to have sustained injuries; obviously, he was just posturing.</p><br/><p>Believing herself to have seen through his ruse, the idea of giving up ten thousand neo-demons seemed like a joke. Not only would she not hand them over, she would leave to spread news about the Demon Spirit to some of the great Tribes, who would no doubt compensate her.</p><br/><p>Seeing the reaction of the Radiance Sifting Tribe, Meng Hao began to move forward, his expression completely the same as usual. He hefted the Devil Spear and then tossed it straight out ahead of him. Instantly, a shocking screaming sound could be heard as it shot through the air. Black mist roiled out from inside, which in the blink of an eye, transformed into a black cloud.</p><br/><p>Inside the black cloud were countless savage faces, howling as they shot toward the retreating Tribe. The Greatmother’s face flickered, and her eyes went wide. However, she merely let out a cold harrumph as, together with the Tribe’s five Nascent Soul Priests, she shot to meet the black mist.</p><br/><p>Power exploded from the Cultivation bases of all six people as they combined forces to attack the black mist.</p><br/><p>“Break!” cried the Greatmother.</p><br/><p>A massive boom could be heard which shook everything. The black mist spread out and slammed into the six. The five Priests' faces fell, and blood shot out of their mouths. Their bodies tumbled back like kites with their strings cut. However, before they could fall back too far, the mist had surrounded them. Vast quantities of savage faces pounced onto their bodies. The sound of biting and chewing mixed with blood-curdling screams, creating a ghastly scene.</p><br/><p>Within the space of a few breaths, the five Priests had been completely consumed. The old woman coughed up blood as she retreated back toward her other Tribe members. When she reached them, she lifted her head up to the sky and howled as she slapped her bag of holding to produce a tortoise shell.</p><br/><p>She tossed it out and spit a mouthful of blood onto it. Instantly, it began to spin and expand, growing to the size of several thousand meters. An ancient, simplistic aura emanated out from it, along with countless streams of glowing magical symbols, as it spread out to surround her and the members of the Radiance Sifting Tribe.</p><br/><p>“Let’s see you break through this!” she said hoarsely, a ferocious expression on her face.</p><br/><p>Seeing this tortoise shell caused the surrounding Greatfathers from the other Tribes to look on with serious expressions. They recognized the tortoise shell, and were instantly shocked.</p><br/><p>“It has a totemic aura…. That’s the corpse of a totemic Sacred Ancient, refined into a protective treasure. Once it’s activated, nothing can break through it. With that, they should be able to leave this place with ease!”</p><br/><p>“No wonder the Radiance Sifting Tribe dared to defy that fearsome Cultivator. It turns out they have a….”</p><br/><p>Even as the surrounding experts recognized the tortoise shell, the Devil Spear shot toward it. The black mist arrived first, slamming into the tortoise shell, causing a massive rumbling to fill the sky. The tortoise shell immediately began to radiate bright light, but it didn’t collapse. The black mist began to spread out and cover the tortoise shell.</p><br/><p>When the members of the Radiance Sifting Tribe saw this, they were shocked, especially the Greatmother.</p><br/><p>“This enemy of the Radiance Sifting Tribe….” Before she could even finish speaking, the Devil Spear within the black mist arrived. In the blink of an eye, it reached the tortoise shell.</p><br/><p>A massive boom rose up to the Heavens, causing the wind and clouds to churn and the sky to dim. A shock wave rumbled out from the tortoise shell, and cracking sounds could be heard as fissures spread out from the area the spear had slammed into. This continued for the space of three breaths, after which a huge roar could be heard as the tortoise shell exploded into countless pieces.</p><br/><p>The Devil Spear continued on its way, radiating killing intent and black mist. It shot in… stabbing directly through the disbelieving Greatmother and heading toward the other Tribe members behind her. Black mist spread out, enveloping the thousands of Radiance Sifting Tribe members. Countless excited faces appeared, spreading out in all directions, clearly thirsting for blood. Just when they were about to begin feeding, some invisible force seemed to hold them back.</p><br/><p>Meng Hao looked at the remaining thousands of Radiance Sifting Tribe members within the shattered tortoise shell. “Surrender?” he said slowly, “Or be buried alive with the rest of the dead?”</p><br/><p>After a moment of brief silence, the thousands of Radiance Sifting Tribe members chose to surrender. They wiped out their totem tattoos, exercised faith in Meng Hao, and became an auxiliary branch of the Crow Divinity Tribe.</p><br/><p>The Greatfathers of the rest of the Tribes, fearful that Meng Hao would change his mind, immediately began to hand over hordes of ten thousand neo-demons. Then, they left as quickly as possible. Considering they had abided by his demands, Meng Hao did nothing to block their way.</p><br/><p>The path to this point had been one of killing. Even though Meng Hao had developed a cruel and cold heart, he was now extremely tired.</p><br/><p>As the other Tribes made their way off into the distance, the members of the Eight Branch Alliance stood there quietly as they too became a sub-Tribe of the Crow Divinity Tribe. As of this moment, the Crow Divinity Tribe was now over 10,000 strong.</p><br/><p>At the same time, Meng Hao’s neo-demon horde was bolstered up. He now had 150,000 neo-demons!</p><br/><p>It was a huge neo-demon horde, but in reality, many of them were low-level neo-demons. Even by absorbing Demonic Qi, there was no way for them to experience incredible growth in a short period of time. 150,000 neo-demons required a terrifying amount of food to sustain. The actual number that could fight in battle was only about 100,000. The rest became food.</p><br/><p>Everything that had belonged to the Eight Branch Alliance now belonged to the Crow Divinity Tribe. They had three enormous flying magical items as well as vast quantities of resources. All of this only served to cause the Crow Divinity Tribe to be even more powerful.</p><br/><p>Several days later, all members of the Crow Divinity Tribe mounted onto the enormous ship-shaped flying magical item. It whistled through the air, streaking through the clouds as it headed south at top speed.</p><br/><p>The current power of the Crow Divinity Tribe far exceeded that of the previous five Tribes of the Crow Divinity. Although it could not currently compare to the great Tribes, they could now be considered to be at the peak of the mid-sized Tribe range.</p><br/><p>As far as their migration went, they had now traveled about a third of the way to their destination. The rest of their path would take them through the Central Region of the Western Desert, to the South Region. The end of the path would of course be the Black Lands!</p><br/><p>The parrot, in compliance with Meng Hao’s request, began to pass on to the Crow Divinity Tribe the same spell formation that it had taught to the Church of the Golden Light!</p><br/><p>Of course, the parrot completely agreed with the idea. In fact, because of the fact that Meng Hao wasn't paying attention, it had actually already started to teach the spell formation. Now that Meng Hao directly brought up the notion, it immediately got very excited.</p><br/><p>“Little Haowie, don’t you worry,” it said, eyes shining brightly. “My dream is that, upon entering the Black Lands, there will be people there shouting the name of Lord Fifth. Then, my two great armies will join together to become like my wings!”</p><br/>\n</div>"}