{"title": "Chapter 509: Laying Eyes on the Black Lands!", "id": 509, "volume": 6, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-509-laying-eyes-on-the-black-lands", "volume_title": "Volume 6", "body": "<h1>Chapter 509: Laying Eyes on the Black Lands!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>“Brother Meng, I often think about what happened that year in the Realm of the Bridge Ruins,” said Xu Bai with a laugh. He looked over at Meng Hao.</p><br/><p>Even as he spoke, the great Black Dragon Tribe began to slaughter its respective bandit Tribe.</p><br/><p>Meng Hao looked back at Xu Bai and chuckled. His voice as calm as the breeze, he replied, “Oh, that was just a fluke. Brother Xu, you were able to singlehandedly stop that Demon Spirit from moving. I truly admire you for that.”</p><br/><p>The rumbling of intense combat rose up from either side of them. At the moment, the great Black Dragon Tribe was going all out in their massacre.</p><br/><p>The Crow Divinity Tribe was the same. They had no desire to come in second to the great Black Dragon Tribe and cause their totemic Sacred Ancient to lose all face. That was especially true of the Nascent Soul Cultivators. They were all crafty and cunning, and as soon as they saw what was happening in this critical moment, they understood that this simple battlefield bet… was in reality a foreshadowing of an alliance, and would decide who held the dominant position.</p><br/><p>Therefore, it was without hesitation that they used the full power of their Cultivation bases to wrest away the lead position of the alliance.</p><br/><p>Both sides attacked with gusto on this battlefield-cum-gambling hall. The bandit Tribes let out grievous cries; they were forced to fight, and yet, were capable of doing nothing but being defeated.</p><br/><p>Meng Hao’s 150,000 neo-demons obfuscated the sky. In an instant, the Crow Divinity Tribe took the lead. However, moments later, the great Black Dragon Tribe’s totemic Sacred Ancient, as well as the two bandit Tribes’ Sacred Ancients, suddenly appeared on the battlefield, and the Crow Divinity Tribe began to fall behind.</p><br/><p>But then, three beams of light suddenly appeared within the Crow Divinity Tribe. These were three beams of colorful light that had not appeared in the previous battle with the Sea Demon Tribe. Instantly, powerful cries rose up to the Heavens as… three totemic Sacred Ancients appeared!</p><br/><p>These were three totemic Sacred Ancients that Meng Hao had absorbed into his force that year along with the Eight Branch Alliance. Instantly, the intensity of the slaughter ratcheted up.</p><br/><p>“Brother Meng,” said Xu Bai, his voice cool, “you and your Crow Divinity Tribe fought your way down here all the way from the north. I’ve heard many stories. However… this last leg of the journey will be the most difficult.</p><br/><p>“In the end, all the most powerful Tribes will gather together. Whether they want to or not, if they have no Demon Spirit, they all will become bandit Tribes in the end.</p><br/><p>“They will all attempt to snatch a Demon Spirit and rob the resources of other Tribes, slaughtering their way into being noticed by either the Heavenly Court Alliance, or other great Tribes who have resources capable of surviving in the Black Lands. Any of them would chose to become auxiliary Tribes in exchange for the chance to survive.” The fierce fighting had now reached a critical juncture. The Crow Divinity Tribe was gaining an even greater lead, and if nothing went wrong, it seemed the great Black Dragon Tribe would fall clearly behind.</p><br/><p>“The only option for us is to form an alliance,” continued Xu Bai slowly. “The Crow Divinity Tribe and the Black Dragon Tribe need to find the Heavenly Wind Tribe to from a three-Tribe alliance. If we push forward together, then after reaching the Black Lands, our Tribes can continue on forever. That is the only way that we can ensure our ability not only to get to the Black Lands, but to stay there safely. I’m sure you understand all of this already, Brother Meng. I don’t even really need to bring it up.”</p><br/><p>Booming sounds could suddenly be heard from the direction of the Crow Divinity Tribe. By now, eighty percent of the enemy were dead. The remainder were scattered and attempting to flee for their lives.</p><br/><p>Obviously, it wouldn’t be very long before the entire bandit Tribe was exterminated.</p><br/><p>As for the great Black Dragon Tribe, they had only destroyed about fifty percent of the bandit Tribe they were fighting; they were clearly going a bit slower.</p><br/><p>Xu Bai frowned. Inwardly, he was shocked, and his respect for the Crow Divinity Tribe grew. Even as Meng Hao mulled over the things he had just said, he cleared his throat and looked deeply at the members of the Black Dragon Tribe.</p><br/><p>This look caused the eyes of the members of the great Black Dragon Tribe to turn red. It was as if they felt ashamed, as if some great pressure had been put onto them. All of the Tribe members instantly unraveled the black cords that were tied around their wrists. In that moment, they lifted their heads to the sky and roared; their Cultivation bases exploded up by nearly fifty percent. It was with explosive madness that they continued to battle against the fleeing bandit Tribe.</p><br/><p>The rampage of the great Black Dragon Tribe suddenly reversed their situation. The casualties among the bandit Tribe soared, shocking them completely. The surviving members of the bandit Tribe were filled with despair and terror, and began to retreat in chaos.</p><br/><p>“Kill them!!” roared the members of the great Black Dragon Tribe as they continued the massacre. The Crow Divinity tribe also advanced. After enough time passed for half an incense stick to burn, the two Tribes completed the slaughter at about the same time. Still burning with killing intent, both Tribes returned to stand behind Xu Bai and Meng Hao.</p><br/><p>The two Tribes faced off; it seemed neither was willing to give in to the other.</p><br/><p>Xu Bai looked at the Crow Divinity Tribe and took a deep breath. Deep inside, he was shocked. He knew that it was only by unsealing the black ropes that the great Black Dragon Tribe had been able to secure a draw. However, he was still of the opinion that if they had opened the seal in the beginning of the battle, the Crow Divinity Tribe would not have been able to measure up.</p><br/><p>But then he glanced at the neo-demon hordes. It was at this point that he noticed that the Crow Divinity neo-demon horde was no longer 150,000 in number. It was now larger by 20,000 which caused him to gasp. His heart trembled and he began to breath heavily.</p><br/><p>“No wonder the rumors say that the Crow Divinity Tribe… feeds off of battle!” he thought. “Every battle makes them stronger! Furthermore… their most powerful totemic Sacred Ancient, Meng Hao, didn’t even make a move! This Crow Divinity Tribe is far more powerful than I ever imagined.”</p><br/><p>As for Meng Hao, he had already put a lot of thought into what happened after the Black Dragon Tribe remove the seals. This caused his admiration for the Black Dragon Tribe to grow even stronger.</p><br/><p>Xu Bai’s hearty laughter echoed about. It was genuine sincerity that he looked at Meng Hao and said, “Brother Meng, let’s form an alliance. What do you say?!”</p><br/><p>“I say yes!” replied Meng Hao without hesitation. The benefits of such an alliance far, far outweighed the drawbacks. Besides, Meng Hao knew that after reaching the Black Lands, the Crow Divinity Tribe could merge with the Church of the Golden Light. At that time, he would actually not go with them, but would part ways.</p><br/><p>Therefore, in the end, adding another ally would only provide further safety for the Crow Divinity Tribe.</p><br/><p>“Men, make preparations for a sacrifice and a blood oath!” cried Xu Bai. To the Black Dragon Tribe, an alliance was very important. Even as the words were leaving Xu Bai’s moth, the Elders and Priests of the Black Dragon Tribe approached. As for the Greatfather of the great Black Dragon Tribe… that was none other than Xu Bai.</p><br/><p>On Meng Hao’s side, all the Nascent Soul Cultivators of the Crow Divinity Tribe approached. The sacrifice was made, and an oath was sworn by smearing blood on the lips. An alliance was formed just like that which existed in the legends of the Western Desert. The neo-demon ancestors and the totemic Sacred Ancients swore oaths, and a bilateral alliance was formed with no primary and secondary party!</p><br/><p>The next day was a day of rest and reorganization. The two parties redistributed their resources evenly. As for Meng Hao, at the moment of truth, it was revealed that he could in fact control the 70,000 strong neo-demon horde of the Black Dragon Tribe. As such, when the time came for battle, Meng Hao’s neo-demon horde would number 240,000!</p><br/><p>A black dragon and a battleship shot through the sky toward the south.</p><br/><p>The final leg of the journey would only take three months to complete. However, those three months would without a doubt be the most difficult military campaign that the great Black Dragon Tribe and the Crow Divinity Tribe had ever carried out!</p><br/><p>In the first month, they went into battle seven times, against nine different Tribes. Roughly every three to five days, they ran into bandit Tribes. Despite all the warfare the Crow Divinity Tribe had experienced, such frequency of battle was unheard of.</p><br/><p>It was the same for the great Black Dragon Tribe. Were it not for the fact that the two Tribes were allied, they would surely have experienced significant losses, perhaps even more than half. It might not have been as bad for the Crow Divinity Tribe, because of their neo-demons. The great Black Dragon Tribe, however, would have found the situation much more difficult.</p><br/><p>However, because of their two-Tribe alliance, the month of campaigning left them exhausted, but prevented significant losses.</p><br/><p>There were three occasions in which the course of the battle was changed because of Meng Hao’s neo-demons, which now included the neo-demon horde of the great Black Dragon Tribe.</p><br/><p>The fearsome power he was able to wield caused the members of the Black Dragon Tribe to be filled with shock, and even more so, excitement. Even Xu Bai was astonished by Meng Hao. He had never heard of any Dragoneer who could do what Meng Hao did.</p><br/><p>During that first month, even though both Tribes sustained some losses, Meng Hao was able to grow his neo-demon horde even larger. Because of this, the great Black Dragon Tribe cooperated in an arrangement of not attacking enemy neo-demons. In the end, Meng Hao’s neo-demon horde reached 300,000 in number!</p><br/><p>When such a vast number of neo-demons appeared, Heaven was shaken and the Earth trembled!</p><br/><p>In the second month, they experienced more than twenty battles. On two occasions, they encountered bandit Tribe alliances. However, faced up against Meng Hao’s terrifying neo-demon horde, the bandit Tribes were crushed like dried weeds.</p><br/><p>By the end of the second month, Meng Hao’s neo-demon horde numbered… a shocking 400,000!</p><br/><p>400,000 neo-demons was something never before seen or heard of in the Western Desert. Even a great Tribe with a Spirit Severing Patriarch could never have such a large neo-demon horde. It was simply impossible for a Dragoneer to brand so many neo-demons. In fact… the food required to sustain 400,000 neo-demons was enough to cause even a great Tribe to go completely broke in a very short period of time.</p><br/><p>When Meng Hao’s neo-demon horde reached 400,000, battles… became simple. During the last month, they encountered virtually no hostile Cultivators. They sped across the land unimpeded as they headed toward the Black Lands.</p><br/><p>In fact, it seemed there were to be no repercussions for the extermination of the Sea Demon Tribe in South Cleaving Pass.</p><br/><p>Nonetheless, Meng Hao couldn’t shake the feeling of impending crisis that continued to float within his heart. Even Xu Bai frowned continuously. Something didn’t seem right. The other Nascent Soul Cultivators also had similar reactions.</p><br/><p>At the end of the third month after leaving South Cleaving Pass, the great Black Dragon Tribe and the Crow Divinity Tribe finally… laid eyes on the Black Lands!!</p><br/><p>The instant they did, the faces of Meng Hao and Xu Bai, as well as all the members of their Clans, instantly became extremely unsightly.</p><br/><p>-----</p><br/><p><em>This chapter was sponsored by Dainius Gliebus, Benjamin Jakobsen, Pavlov Aleksey, and Dat Do</em></p><br/>\n</div>"}