{"title": "Chapter 511: The Spell Formation is Seen Again!", "id": 511, "volume": 6, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-511-the-spell-formation-is-seen-again", "volume_title": "Volume 6", "body": "<h1>Chapter 511: The Spell Formation is Seen Again!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span style=\"\"></span></p><br/><p><strong>Chapter 511: The Spell Formation is Seen Again!</strong></p><br/><p>20,000 people versus 200,000!</p><br/><p>This was a battle in which the difference between the two forces was immense. To many onlookers, it seemed as if it would be nothing more than a crushing.</p><br/><p>Even though the Black Dragon and Crow Divinity Tribes were veterans of hundreds of battles, to face ten times as many bandit Tribes as their own number made the odds of victory too small. It appeared that the only thing they could do was work hard to kill as many of the bandit Tribe members as possible before being killed themselves.</p><br/><p>That seems to be the only option.</p><br/><p>But… as far as the Crow Divinity and Black Dragon Tribes were concerned, there was still another option…. Meng Hao, the totemic Sacred Ancient of the Crow Divinity Tribe, had an amazing ability to control and attract neo-demons. The Crow Divinity Tribe had started out with only a thousand members, but had grown to its current valiant state because in each battle, Meng Hao’s neo-demons would become the linchpin to victory.</p><br/><p>400,000 neo-demons, a power that no other Tribe could possibly possess, would without a doubt be a deciding factor in this battle.</p><br/><p>A shocking roar filled the air as slaughter broke out between the two sides on the battlefield. In the blink of an eye, the Crow Divinity Tribe and the Black Dragon Tribe were like sharp blades that slashed into this alliance of twenty bandit Tribes.</p><br/><p>The sound of the fighting rocked Heaven and Earth. The Crow Divinity Tribe’s battle tactics seemed different during this battle than from previous battles. They would occasionally stagger their positioning, as if they were fighting in a unique battle formation.</p><br/><p>The wind whistled and the sky dimmed. Broken patches of clouds drifted to and fro. It seemed as if some great change was occurring in the Heavens.</p><br/><p>The ground quaked and the mountains trembled. The sound of shouting caused the sky to tremble. The violet rain fell down onto a scene of a ruthless slaughter!</p><br/><p>The great Black Dragon Tribe seemed crazy. More than 10,000 Tribe members exploded out violently. Not a single bandit Tribe member could do anything to stand up against them.</p><br/><p>As for the members of the Crow Divinity Tribe, their killing intent rose to the Heavens. Their eyes were shot with blood. This was the last battle, which would decide whether they lived or died. If they didn’t live… then what did it matter if they died!?!?</p><br/><p>Their only chance was to enter through the Blackgate Fort up ahead. Otherwise, their spiritual energy would waste away in the violet rain and they would wither up like mortals. Therefore they exploded out with all the scorching fire their life force could muster. Even dying, they laughed uproariously.</p><br/><p>Booming sounds could be heard as magical techniques exploded out. Growling roars filled the air. All of it mixed together to form a joyous song of battle. There was no music, only the majestic sound of fighting. There were no lyrics, only shaking and rumbling.</p><br/><p>Xu Bai lifted his head up to the sky and laughed heartily as he shot forward through the battlefield. He was unstoppable, and spattered with blood. Some of the blood was his own, but most belonged to enemies. His laughter contained some sadness, but also stubborn hopefulness. It also said, “If I can’t survive, then I will die in battle!”</p><br/><p>Meng Hao looked over the scene, and his heart trembled. The blood in his veins boiled and veins of blood appeared in his eyes. This was the last battle, and it had his life force boiling.</p><br/><p>“What happens in front of Blackgate Fort is like a play…. All the people on top of the battlement are the audience members, looking down at a play. He looked at the twenty Tribes of killers, hundreds of thousands of Cultivators, so thickly gathered that you could hardly see their end. They were like tidewaters of extermination, boiling with killing intent as they roared into battle.</p><br/><p>Violet rain fell down endlessly, spattering onto the bodies of everyone present.</p><br/><p>“It doesn’t matter if you’re watching the play or in the play…. It’s still nothing more than a battle.” Killing intent exploded out of Meng Hao’s eyes. He waved his arm and 400,000 roaring neo-demons shot toward the bandit Tribes.</p><br/><p>In total, there were more than a hundred Dragoneers among the bandit Tribes. They floated in mid-air under heavy protection, using all their power to control their own force of 400,000 neo-demons to fight back against Meng Hao’s.</p><br/><p>It was at this point that the Nascent Soul Cultivators of the twenty bandit Tribes all began to fly out. They radiated ruthlessness as they shot toward the Black Dragon and Crow Divinity Tribes.</p><br/><p>They moved with such speed that they were nothing more than blurs. Almost as soon as they appeared, they were in the middle of the battle. The sound of slaughter rose up, along with the booms of divine abilities and magical techniques. The Nascent Soul Cultivators of the Crow Divinity and Black Dragon Tribes did not even number thirty in total. Compared to the number of Nascent Soul Cultivators from these twenty bandit Tribes, they were at a serious disadvantage.</p><br/><p>However… Meng Hao’s neo-demon horde was large enough that he could afford to send some extremely powerful neo-demons to join that battle. Instantly, they began to cause havoc on the battlefield.</p><br/><p>Next, the totemic Sacred Ancients from the twenty bandit Tribes whistled into battle. They were of a variety of appearances, but they all emanated shocking auras. As they arrived, the totemic Sacred Ancients of the Black Dragon Tribe and Crow Divinity Tribe both appeared. Along with the Outlander Beast, they charged to fight back.</p><br/><p>The battle had just begun, and already, it was shocking to the extreme.</p><br/><p>Four totemic Sacred Ancients and twenty Nascent Soul Cultivators suddenly appeared to lock down Meng Hao and Xu Bai. This was especially true of Meng Hao; three of the totemic Sacred Ancients and seven of the Nascent Soul Cultivators targeted him specifically. They knew who he was and also knew that if they killed him, his neo-demon horde would disperse. If that happened... the battle could be won easily.</p><br/><p>As they closed in on him, Meng Hao’s eyes glittered with killing intent. He waved his right hand and a flicker of lightning could be seen as the soul of the Li Clan Patriarch suddenly was unleashed by Meng Hao.</p><br/><p>As soon as the soul emerged, red lightning crackled about with the Li Clan Patriarch at its center. Boundless lightning shot out in all directions, instantly enveloping everything for hundreds of meters in every direction, creating a lake of lightning.</p><br/><p>Within the lightning, the seven Nascent Soul Cultivators who had been so intent on killing Meng Hao, as well as the four totemic Sacred Ancients, all trembled violently. This was not ordinary lightning, this was Tribulation Lightning that had been absorbed by the Li Clan Patriarch as a Soul of Lightning.</p><br/><p>Rumbling could be heard as the bodies of Meng Hao’s enemies shook. Instantly, he transformed into a green smoke and a black moon. He shot with incredible speed towards a nearby early Nascent Soul stage Cultivator in the forces of the bandit Tribes. He was upon him in the blink of an eye. The Devil Spear appeared in his hand, and a seething devilish mist rolled out, filled with countless savage faces.</p><br/><p>Miserable screams echoed out as the Devil Spear stabbed through the chest of the early Nascent Soul stage Cultivator. Mist enveloped him and savage, laughing faces began to consume him. Meng Hao disappeared again.</p><br/><p>A howl could be heard as the seven late Nascent Soul stage Cultivators along with the four totemic Sacred Ancients charged toward Meng Hao.</p><br/><p>As they closed in on Meng Hao for a second time, a blood-colored face magically appeared next to Meng Hao. As the Blood Immortal divine ability roared out, a rain of blood filled the area. The two sides clashed, and Meng Hao’s body trembled. Blood sprayed from his mouth and he tumbled backward, coming to a stop and coughing up more blood. His host of opponents instantly stopped in place, their faces pale. A moment later, they continued forward in pursuit.</p><br/><p>Meng Hao’s eyes glittered. He had no time to even wipe the blood from his mouth. His body transformed into a green smoke, and he even added on the Bloodburst Flash. When he reappeared, he was behind an early Nascent Soul Cultivator. His right hand clenched into a fist which slammed into the man. The Cultivator’s body shook and all of his defenses crumbled as Meng Hao’s fist plunged directly into his body and smashed his Nascent Soul.</p><br/><p>“Meng Hao!!” roared one of the late Nascent Soul Cultivators that was chasing him, his eyes brimming with killing intent. “Do you dare to fight with us?!”</p><br/><p>“I’m not an idiot,” replied Meng Hao, a bit of disdain flickering within his eyes. “Seven late Nascent Soul Stage Cultivators versus only one me? And you ask if I dare to fight you? Why don’t you first see if you can do anything to stop me?” He once again used the Bloodburst Flash and disappeared.</p><br/><p>At the same time that he disappeared, two more totemic Sacred Ancients suddenly appeared in the same spot. Even as Meng Hao fled, they joined the group of other totemic Sacred Ancients to pursue him.</p><br/><p>In just a few moments, Meng Hao danced back and forth across the battlefield, evading one deadly attack after another. Although he was hit a few times, after coughing up some blood, he would consume some medicinal pills. His speed didn’t reduce in the least bit.</p><br/><p>Any feeble early Nascent Soul stage enemies that he saw were doomed to die.</p><br/><p>Slowly, more and more late Nascent Soul stage Cultivators joined the group which were trying to kill Meng Hao. Currently, there were nineteen of them, as well as nine totemic Sacred Ancients. They charged Meng Hao from all directions. Further off in the distance, one of the most powerful of the enemy Cultivators also began to approach with killing intent.</p><br/><p>A scornful smile could be seen on Meng Hao’s face. He flickered away, reappearing next to one of the bandit Tribes’ early Nascent Soul stage Cultivators. That person’s face fell, and before he could do anything, Meng Hao waved his hand, causing the flag of three streamers to appear. It instantly wrapped the man up and began to hurl him away.</p><br/><p>Even as the flag unfurled, the man’s body exploded into pieces!</p><br/><p>Such provocation on Meng Hao’s part, especially the appearance of his 400,000 neo-demons, instantly had a huge effect on the battlefield. More and more Cultivators joined the force that was trying to slay him.</p><br/><p>At the same time, because the most powerful members of the enemy force were focused on him, much of the pressure was taken off of the Crow Divinity Tribe and the great Black Dragon Tribe. In the initial clash just now, both Tribes had sustained losses of more than thirty percent. There were even Nascent Soul Elders who perished.</p><br/><p>Similarly, the bandit Tribe alliance had paid a heavy price, having lost nearly 30,000 Tribe members in death.</p><br/><p>As of this moment, it was becoming more obvious that the Crow Divinity Tribe members were setting up a formation. In fact, it was now possible to see a fog forming within their ranks!</p><br/><p>“Meng Hao, don’t tell me the only thing you can do is run away!? If you keep fleeing and killing our Tribe members, then we’ll have to go slaughter some of the ordinary Cultivators of your Crow Divinity Tribe!”</p><br/><p>“That’s right! We can slaughter people just as well as you!”</p><br/><p>Meng Hao completely ignored the cries of the people chasing him. His body continued to flicker at top speed.</p><br/><p>Meanwhile, back on the battlement of Blackgate Fort, the Cultivators of the Heavenly Court Alliance and the other great Tribes were laughing and chatting.</p><br/><p>“That guy can control 400,000 neo-demons! What a talent! However, it’s also completely idiotic to have only one person controlling so many.”</p><br/><p>“He will definitely die sooner or later.”</p><br/><p>As such conversations proceeded, Luo Chong stood there with his fists clenched. He had very complicated feelings regarding Meng Hao….</p><br/><p>Duo Lan frowned, but said nothing. Next to her, Zhang Wenzu was smiling just as he had been the entire time. The people engaged in battle down below were nothing more than ants to him.</p><br/><p>Meanwhile, down on the battlefield, the late Nascent Soul stage experts realized that Meng Hao was ignoring them. Enraged, they were on the verge of splitting up to go slaughter the regular members of the Crow Divinity Tribe, in order to force Meng Hao to fight them.</p><br/><p>Currently, the seven thousand remaining members of the Crow Divinity Tribe had finished preparations for the spell formation. No longer were they emanating killing intent. Instead, they began to run. As they did, fog rose up to roil out in all directions.</p><br/><p>At this moment, the parrot shot up to soar through the sky. Its face radiated arrogance and complacency as it squawked:</p><br/><p>“Come, come. Recite along with Lord Fifth. Have faith in the Lord Fifth, gain eternal life! When the Lord Fifth appears, who dares to cause strife!”</p><br/><p>-----</p><br/><p><em>This chapter was sponsored by Lim Derek, Levi Thorstensen, Omar Hamad, and Toni Kirsch</em></p><br/>\n</div>"}