{"title": "Chapter 516: Without Severing the Spirit, How Could You Live Past 1,000?", "id": 516, "volume": 6, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-516-without-severing-the-spirit-how-could-you-live-past-1-000", "volume_title": "Volume 6", "body": "<h1>Chapter 516: Without Severing the Spirit, How Could You Live Past 1,000?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span style=\"\"></span></p><br/><p><strong>Chapter 516: Without Severing the Spirit, How Could You Live Past 1,000?</strong></p><br/><p>Starting in the north and then extending to the east and west, the great lands of the Western Desert slowly became a violet-colored sea. The sea spread out to eventually cover the south as well. It stopped outside Blackgate Fort. At this point, it was truly a boundless sea.</p><br/><p>Blackgate Fort was eventually submerged by the water. Ten thousand years later, after the seawater vanished, a new land would be revealed.</p><br/><p>That would be the true end of the Western Desert Apocalypse. The seawaters would disappear, and the Western Desert would once again appear.</p><br/><p>Perhaps by that time, the land would be unfamiliar to the Western Desert Cultivators residing in the Black Lands. However, there would definitely be people who would go to search for the roots of their Tribes from ten thousand years before.</p><br/><p>Right now, Blackgate Fort’s gate was closing, signifying an official end to the migration….</p><br/><p>Meng Hao’s laughter rang out as he gained enlightenment regarding Karma. He saw the Karma threads. By casting out the fishing line, he could control the treasure just like a member of the Ji Clan. To Meng Hao, this was an extra, unexpected benefit.</p><br/><p>“So Karma has been with me all along….” He shot through the air, the parrot perched on his shoulder. The meat jelly was attached to the parrot’s foot like always. One man, one parrot, and one meat jelly shot through the downpour of violet rain. They were surrounded by the power of extermination. Spiritual energy was completely cut off.</p><br/><p>After parting ways with the Golden Crow Clan, Meng Hao chose not to enter the Black Lands. He made a different choice. He would stay behind within the Violet Rain Apocalypse in order to form his Water-type totem.</p><br/><p>As for the blood totem, that was not Meng Hao’s choice of totems. He would place himself within the Violet Rain Apocalypse in order to to gain enlightenment and understand the true meaning of the Violet Sea.</p><br/><p>As he shot through the air, his eyes suddenly glittered.</p><br/><p>“Now that I’ve left the plains outside the Black Lands,” he murmured, “the pursuit should be catching up….” He suddenly stopped in mid-air, turning to look behind him.</p><br/><p>“I’m probably being chased, not by the Nascent Soul stage, but… Spirit Severing!!” His eyes glowed brightly as he looked around, and he smiled.</p><br/><p>A long moment passed before his gaze came to be fixed at a spot not too far off.</p><br/><p>“It will most likely be Spirit Severing. After my display back at Blackgate Fort, no ordinary Nascent Soul Cultivator would be willing to try to interfere with me.” As Meng Hao thought about the Spirit Severing stage, his eyes suddenly filled with a burning passion.</p><br/><p>Spirit Severing… was an indescribably powerful stage!</p><br/><p>It was something that Cultivators sought after with passion secondary only to Immortal Ascension!</p><br/><p>The mysteries of Spirit Severing had nothing to do with variations in divine abilities, but rather the manifestation of the Domain. Each of the three Severings were an instance of the use of the Domain.</p><br/><p>Only within the Spirit Severing stage was it possible to have the qualification to call one’s cultivation… a Dao!</p><br/><p>In the cultivation of the Spirit Severing stage, medicinal pills were secondary. The most important thing was… enlightenment regarding the Domain.</p><br/><p>Every Spirit Severing Patriarch had a different Domain. Based on their different experiences in life, the Dao of the Domain chosen by the Cultivator transformed into a blade of Severing. The first Severing was the early stage, the second Severing was the mid, the third Severing was the late!</p><br/><p>Each of these Severings would cause the Cultivation base to rise to a new realm. When all three Severings were completed, the great circle of Spirit Severing was complete. After that, there was only one path to follow… and that was Dao Seeking.</p><br/><p>The reason why it was called Dao Seeking was that the body of the Cultivator contained a Dao. Within the three Severings of the Spirit Severing stage, one’s Dao was discovered, then questions arose…. Once the Dao was solidified, then one was qualified for Immortal Ascension.</p><br/><p>Unless… doubts arose during Dao Seeking. Then the Dao vanished and the body perished. Everything became emptiness.</p><br/><p>There is a saying that once enlightened, one can die happy. That is how one could describe the Dao Seeking stage. Once enlightenment was gained, and one’s own Dao was solidified, then one could smile even in death.</p><br/><p>Spirit Severing, Dao Seeking, Immortal Ascension!</p><br/><p>Those were the ultimate pursuits of the Cultivators in the great lands of South Heaven. Three stages, each one of which could lead to death. However, when the final goal of Immortal Ascension was reached, the Cultivator would then be qualified to leave South Heaven and travel among the stars. There, one’s personal Dao could become even more strong, and blossom like a resplendent flower!</p><br/><p>When such a beautiful flower blossomed, one could die laughing at the Heavens, having lived a life not in vain!</p><br/><p>That was the path of Immortal Ascension!</p><br/><p>Meng Hao’s path. Xu Qing’s path. Chu Yuyan’s path. Chen Fan, Fatty and all the others all were treading such a path….</p><br/><p>Objectively speaking, though, whether you looked at the Western Desert or the Southern Domain, Dao Seeking experts were as rare as phoenix feathers and qilin horns…. Even Spirit Severing experts were not common. Generally speaking, even great Tribes in the Western Desert would have only one Spirit Severing Patriarch, which was the reason why they could sustain their legacies throughout the years and become truly powerful.</p><br/><p>It was similar in the Southern Domain. Spirit Severing experts were not common. Furthermore, the majority… remained within the First Severing. Those who reached the Second were less common and as for the Third… they were even rarer.</p><br/><p>That was because… each Severing could be fatal. Lack of success… meant certain death. In fact, many Cultivators who became Spirit Severing Patriarchs… chose not to continue on with further Severings.</p><br/><p>Failure… meant death!</p><br/><p>The power of the Spirit Severing stage lay in the Domain. It could influence divine abilities, could change the laws of nature, could accomplish whatever the heart desired. From the perspective of Nascent Soul Cultivators, it could do things that seemed impossible.</p><br/><p>Take for example Patriarch Reliance. The fact that he could carry away the State of Zhao with him had something to do with this Cultivation base. However, that action was actually a manifestation of Spirit Severing!</p><br/><p>Another example was the Patriarch of the Frigid Snow Clan. Of his own power, he could shake everything in the area. However, once his Cultivation base fell, it instigated an attack.</p><br/><p>If one wished to enter the Spirit Severing Stage, the initial step was the first Severing, which could not be avoided.</p><br/><p>It was an enormous obstacle that had to be passed by any Cultivator who wished to proceed beyond the Nascent Soul stage. In fact, it was an obstacle that many Nascent Soul Cultivators could not pass. Because of that, they ended up staying within the great circle of the Nascent Soul stage until their longevity expired, whereupon they became skeletons and returned to the dust.</p><br/><p>If one could not live past one thousand years, and could not defy the heavens, how could one be of the Spirit Severing stage?</p><br/><p>The longevity of the Nascent Soul stage was roughly one thousand years. Even with the use of shocking medicinal pills that could increase longevity, it was impossible to exceed one thousand years of life. That was one of the laws of Heaven and Earth. One thousand years was the absolute limit to the longevity of a Cultivator.</p><br/><p>However, with the First Severing of Spirit Severing, five hundred to a thousand years of longevity could be hewn out. As to exactly how much, that depended on the person as well as the Domain…. In any case, the longevity would definitely exceed one thousand years!</p><br/><p>Passing beyond one thousand was a defiance of the Heavens!</p><br/><p>That was why reaching Spirit Severing was so difficult. It was difficult… to an ultimate degree!</p><br/><p>Meng Hao took a deep breath, taking the stubborness and desire that shone in his eyes and concealing it deep within his heart. He would continue down this path to Immortal Ascension… in a way that had never been done before. That was the determination in Meng Hao’s heart.</p><br/><p>The Five-Colored Nascent Soul was only the first step!</p><br/><p>Meng Hao looked out into the air, but could only see the downpour of violet rain. Everything was deserted, with no one visible except for him. Meng Hao was quiet for a long moment, ten breaths of time to be exact. Suddenly, a translucent figure slowly began to appear in mid-air several thousand meters in front of Meng Hao.</p><br/><p>As the figure became visible, a strange, invisible power seemed to affect the violet rain in the area. It was pushed aside, ensuring that not even a single drop landed on the figure.</p><br/><p>Meng Hao’s expression was the same as ever, as if nothing out of the ordinary was going on. However, it was at this moment that the parrot opened its eyes wide. All of the multicolored feathers on its body stood on end. The meat jelly bell on its foot began to tremble, causing tinkling bell sounds to ring out.</p><br/><p>“Dammit, Spirit Severing!!” said the parrot, gaping. It was impossible to tell exactly what it was thinking. It looked down ruthlessly at the meat jelly bell and said, “Shut up! Quit shaking! Your shaking is really annoying Lord Fifth!” In response, the meat jelly’s shaking grew even more intense.</p><br/><p>Meng Hao’s expression was the same as ever. He had long since predicted that after the Crow Divinity Tribe entered the Black Lands and handed over the Demon Spirit, the fact that there was a second Demon Spirit would quickly be discovered.</p><br/><p>Considering that the Heavenly Court Alliance wanted Demon Spirits, it was possible that other great Tribes with Spirit Severing Patriarchs would grow greedy. That meant there was a high possibility that they… would try to catch and kill him.</p><br/><p>Such circumstances would have been even more difficult to avoid if he had entered the Black Lands himself. Furthermore, it would have implicated the Crow Divinity Tribe. His only option was to leave…. Even leaving, though, would likely result in people coming after him.</p><br/><p>However, it now had nothing to do with the Crow Divinity Tribe. The scene of Meng Hao leaving Blackgate Fort had been witnessed by too many people. From that moment on, it was tantamount to Meng Hao severing his Karma with the Crow Divinity Tribe.</p><br/><p>“Do you know why I’m here?” asked the transparent figure, slowly opening its eyes. The opening of its eyes caused everything in the vicinity to suddenly change. It was as if some indescribable, invisible force of law had enveloped the entire area. The figure did not open its mouth to speak. Instead, its voice resonated in Meng Hao’s mind like thunder.</p><br/><p>An intense aura caused Meng Hao to feel as if he were about to suffocate. A mere thought on the part of this figure caused the violet rain in the area to stop moving. It paused, motionless in mid-air. The sight of the drops of water floating there motionless in midair was truly shocking.</p><br/><p>This was something that no Nascent Soul Cultivator could do. This was not a divine ability, but rather but a command of laws. This was… a Domain!</p><br/><p>Only Spirit Severing experts were possessed with Domain!</p><br/><p>Meng Hao’s eyes glittered as he looked at the translucent figure. “So, I have been pursued, not by a Nascent Soul Cultivator, but someone of the Spirit Severing stage!”</p><br/><p>“Hand over that Demon Spirit,” said the translucent figure, staring at Meng Hao. “Then you can be on your way.” Its expression was one of neither happiness nor anger. It continued to stand there, its mouth closed but its voice echoing in Meng Hao’s mind.</p><br/><p>“Hold on a second!” squawked the parrot. It suddenly flew up into the air. At the same time, the meat jelly bell on its foot continued to chatter.</p><br/><p>Flapping its wings rapidly, the parrot continued, “Heh heh. Look, big brother. Lord Fifth is not on the same side as this kid. Aiya. Now that I think about it, my beloved concubine is back at home waiting for me. See you later!”</p><br/><p>“Big brother,” gushed the meat jelly, “Lord Third is not on the same side as this kid….”</p><br/><p>Meng Hao’s expression was unsightly as he glared at the parrot and meat jelly. “That is the Demon Spirit!” he suddenly said, pointing at the parrot.</p><br/><p>Suddenly, the semi-transparent figure looked over at the parrot.</p><br/><p>“Meng Hao, we’re on the same side, bitch! You, you, you….” The parrot began trembling, having been instantly sent into a fluster.</p><br/><p>“This is wrong,” howled the meat jelly. “This is immoral! This is going to provoke Heavenly Tribulation. You….”</p><br/>\n</div>"}