{"title": "Chapter 538: Blood Mastiff Dao Protector!", "id": 538, "volume": 6, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-538-blood-mastiff-dao-protector", "volume_title": "Volume 6", "body": "<h1>Chapter 538: Blood Mastiff Dao Protector!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 538: Blood Mastiff Dao Protector!</strong></p><br/><p>Even as the two Nascent Souls died, the red glow, which filled the surrounding tens of thousands of meters, transformed into a red mist. The mist churned and seethed, rising up into the air in shocking fashion.</p><br/><p>It changed; no longer was it wide and flat, but rather, spherical. In fact, from a distance, it looked like… an enormous red eyeball!</p><br/><p>Anyone who looked at the eye would feel extreme fear and shock, and would even lose the ability to think clearly. The sight would cause the brain to fill with roaring, as if one were in the middle of a sea of blood, incapable of freeing oneself.</p><br/><p>It seemed as if in this instant, all lives became the color of blood.</p><br/><p>The eye was incredibly realistic, and was filled with a strange, demonic air. Red mist seethed, as if the eye were blinking. It was frightening to the extreme. In the very center of the gigantic eyeball appeared a vortex. It spun rapidly, transforming into a black hole.</p><br/><p>The black hole seemed capable of consuming anything and everything. As soon as it appeared, the air in the area distorted, as if all the light in the area were being sucked in. Anyone who could see the scene would be horrified.</p><br/><p>As the vortex spun, the black hole grew larger. 30 meters. 150 meters. 300 meters… 900 meters. In the end, it expanded outward until it was no less than 3,000 meters.</p><br/><p>A red eye 30,000 meters wide. A black hole 3,000 wide, like a pupil. The vortex was the border between the pupil and the eye.</p><br/><p>All of this completely shocked everyone who was in the outpost. The local Cultivators were trembling, their expressions that of utter astonishment and disbelief.</p><br/><p>“What is that?!?!”</p><br/><p>“The Nascent Soul Cultivators are all dead, and it only took a moment! This Meng Hao… he’s… just what level Cultivation base does he have?!”</p><br/><p>“Just what horrifying thing is he summoning?!”</p><br/><p>Cold sweat began to drip down the foreheads of everyone present, and their breath came in ragged pants. A profound sense of deadly crisis filled their hearts. As of this moment, they were filled with an indescribable dread of Meng Hao. It was like they were in a nightmare from which they couldn’t awaken, something that would be forever branded in their souls.</p><br/><p>The surrounding Violet Sea was covered with huge waves. From within the black hole in the enormous eye, a roar could suddenly be heard.</p><br/><p>AAAOOOOO!</p><br/><p>The roar sounded like the howl of some type of beast. Everything shook and the air vibrated. The pupil within the gigantic red eye seemed to contract and then rapidly expand. Everything distorted, and the crowds of people in the outpost felt their hearts shaken.</p><br/><p>It was a single roar, but it was as shocking as thunder. As it echoed out in the world, half of the people within the outpost began to bleed from their eyes, nose, mouth and ears, and then passed out, unconscious.</p><br/><p>They were simply incapable of resisting the roar, which contained a Cultivation base power capable of filling the heart and mind with shock. One sound was filled with such intense pressure that it rendered people unconscious.</p><br/><p>Cracking sounds could be heard coming from the airships and wooden planks that made up the outpost. The entire structure began to sink down. The surrounding Violet Sea churned violently, as if it, too, were roaring in response to the howl coming from the red eye.</p><br/><p>The remaining Cultivators who had not been rendered unconscious all had extraordinary Cultivation bases. However, their faces were pale as they expended incredible effort to endure. Their Cultivation bases rotated and they panted as they stared at the scene up above.</p><br/><p>The instant the roar could be heard, a gigantic paw began to stretch out from the black hole. It had razor-sharp claws and luxuriant, long fur. The paw continued to stretch out revealing an entire limb.</p><br/><p>The long hair flowed loosely and was filled with a barbaric, wild air, and the claws seemed capable of ripping the air open. Another ear-splitting roar could suddenly be heard from within the black hole.</p><br/><p>A second paw appeared from within the black hole, and then a gigantic head. The roar shook everything.</p><br/><p>The head was… incredibly large!</p><br/><p>Red fur, ferocious fangs, and a savage, barbaric aura that exploded out.</p><br/><p>The head was clearly that of a dog!</p><br/><p>It waved back and forth, as if it were using all the power it could muster to emerge from the black hole. It surged forward, emerging in full, accompanied by a Heaven-shaking roar.</p><br/><p>All that could be seen was a beam of red light that shot out violently from within the black hole. A vast, red mist rose up, and then just as quickly, disappeared. When it did, an enormous red figure could be seen standing there, straight and mighty.</p><br/><p>It was huge, covered with loose, red fur. Bone spurs stuck out all over its body, making its appearance even more ferocious. Its gaze was filled with bloodthirstiness, like a Qilin or a Bloodlion. The level of incredible fierceness that it emanated was difficult to describe!</p><br/><p>This was… the Blood Mastiff!</p><br/><p>As soon as it appeared, an aura similar to the Spirit Severing stage exploded out from its body, and even emanated the feeling of a Domain. Meng Hao knew that this Domain was not inherently the mastiff's, but rather, branded to it by the Blood Immortal as part of its bloodline, and the Blood Immortal legacy.</p><br/><p>Such a brand existed in all Blood Spirits. However, because of the unprecedented fusion it had experienced, it was able to completely manifest it. It was for the same reason that the mastiff had fallen asleep for nearly two hundred years. Now, though, it was fully awakened.</p><br/><p>The mastiff lifted its head and roared, a sound which shook Heaven and Earth. The sky dimmed and everything trembled. The Violet Sea seethed. All of the Cultivators who remained conscious in the outpost passed out.</p><br/><p>Meng Hao looked at the mastiff, at its enormous frame, its fierce appearance, and its intrepid Cultivation base. However, even if the mastiff grew more fierce in appearance, to Meng Hao, it was the same, fluffy little puppy that had run along at his side all those years ago.</p><br/><p>It was still his partner, the partner who had fought with him in the Blood Immortal legacy tournament, and had refused to leave his side.</p><br/><p>It was the same mastiff who had stood guard over him atop that lonely mountain in the Blood Immortal legacy tournament. No matter how exhausted or injured it grew, even when it was on the verge of death, it refused to leave. It put its own life on the line to protect Meng Hao. Even when exhausted and nearing the point of death, all it wanted was for Meng Hao to lift his hand and pet its head.</p><br/><p>Meng Hao would never forget all of that. He had watched as the mastiff, its body broken and nearly destroyed, crawled over to him and then exerted all the effort it could muster just to lick his hand.</p><br/><p>Then he thought about how it had saved him during the encounter with the Li Clan Patriarch, using all its power to fling him out of the portal. Innumerable hands had stretched out to grab it, and it was pulled down into the sludge. Just before it disappeared, it had stuck its tongue out, as if in a final attempt to lick its master.</p><br/><p>How could Meng Hao… possibly forget such things?!</p><br/><p>“Blood Mastiff,” he said softly, looking at the gigantic, ferocious mastiff. He saw the shocking spurs, and the astonishing aura it emanated.</p><br/><p>His voice was soft, but the instant it left his mouth, the mastiff suddenly trembled. It turned its head and looked in confusion toward Meng Hao. But then, its expression turned gentle, even happy. It slowly lowered its head, allowing Meng Hao to rub its nose. It carefully extended its tongue to lick Meng Hao’s hand.</p><br/><p>As Meng Hao rubbed its nose, it emitted a contented growl, just like it had when it was tiny.</p><br/><p>Meng Hao smiled as he gently pet the mastiff. He thought about that time outside the Rebirth Cave when the mastiff, despite being asleep, had exerted all the power it could to extend a single paw.</p><br/><p>“Hey buddy, I haven’t seen you for more than a hundred years….” he said softly. “Let’s go wipe out that damned Heavenly Pursuit Tribe!” His killing intent suddenly boiled up. At the same time, the mastiff’s killing intent exploded to the sky. It roared, the sound of which was like thunder. Meng Hao leaped up into the air, flying up to stand on the mastiff’s head. He waved his right hand, causing a massive wave to sweep out and pick up the Golden Crow Tribe members, as well as the bodies of their dead.</p><br/><p>Under Meng Hao’s control, the Violet Sea’s power of extermination was restricted, ensuring that the Golden Crow Tribe members would not be harmed in any way.</p><br/><p>Meng Hao looked at Wu Ling and the others. “We’re going together. There’s a debt of blood that can only be paid back… with blood!”</p><br/><p>As soon as the words left his mouth, the mastiff roared again and then shot up into the sky, taking Meng Hao with it. Wu Ling and the other old-timers felt their blood beginning to grow hot, just like it had in the old days. They and the other Tribe members shot forward within the wave.</p><br/><p>They did not leave for the Black Lands. Instead, they went to the nearest outpost, the ninth.</p><br/><p>Under the orders of Patriarch Huyan, the Heavenly Pursuit Tribe had gone to war with the Golden Crow Tribe in order to force Meng Hao out. It had cost them quite a bit, but in the first battle, they had managed to capture five hundred prisoners. Those captives had been subjected to endless forms of torture. Their Cultivation bases had been ruined, and they were then sent to the ten outposts in the Western Desert Sea to be strung up!</p><br/><p>They were hung out in the open, exposed to the elements. The entire purpose… was so that Meng Hao would see it. In Patriarch Huyan’s estimation, once Meng Hao saw, he would be forced to appear.</p><br/><p>If he didn’t, then his totems would be severely weakened and he would lose his faith power. In actuality, Meng Hao had long since reached the point where he didn’t need either of those. He had successfully formed his Nascent Soul. As such, he was both a totemic Sacred Ancient, and… wasn’t.</p><br/><p>In any case, Patriarch Huyan had severely miscalculated. Meng Hao… would definitely appear.</p><br/><p>However, the reason was because of sentiment, and because of the Golden Crow Tribe!</p><br/><p>“Our slaughter… will begin with the ten outposts on the Violet Sea!”</p><br/><p>The mastiff roared as it shot forward with the incredible speed of Spirit Severing. Meng Hao stood on top of its head, the wind whipping his clothes about. The killing intent in his eyes only continued to grow thicker, and his determination to exterminate the Heavenly Pursuit Tribe grew even stronger.</p><br/><p>BOOM!</p><br/><p>The second outpost soon became visible. After consulting with the former members of the Crow Divinity Tribe, he now knew that although the tenth outpost belonged to the Heavenly Court Alliance, it was mostly controlled by the Heavenly Pursuit Tribe.</p><br/><p>The second, fifth, and ninth outposts were all the same. As for the seventh outpost which Meng Hao had already destroyed, the blame for that could be placed squarely on the shoulders of the two old men who had tried to kill him.</p><br/><p>“I don’t care what Tribe they belong to,” said Meng Hao, his eyes glowing coldly, “anyone who dares to string up my Golden Crow Tribe members… deserves to die!”</p><br/><p>There was no need for an order from Meng Hao. The Blood Mastiff’s eyes glowed with red light as it neared the second outpost.</p><br/><p>AAAAOOOOOOOO!!</p><br/><p>The sound of the roar created a sonic boom which sent mad, invisible power sweeping out. As it slammed into the outpost, a spell formation activated. However, it could only stand up to the roar for the space of a single breath before it collapsed into pieces.</p><br/><p>At the same time, the Cultivators of the Heavenly Pursuit Tribe within the outpost began to fly into the air, looks of shock on their faces. Before they could even react, a gale force wind swept toward them. Each and every Cultivator was instantly shredded into pieces, completely destroyed in body and soul.</p><br/><p>An off-kilter roar of despair rose up from within the outpost. It belonged to a Cultivator who was at the peak of the late Nascent Soul stage. His body was trembling, and he was surrounded by the reek of blood. To see so many people slaughtered in front of his eyes was like something from a nightmare.</p><br/><p>He knew that for a single roar to do that could only mean that he was facing… Spirit Severing!</p><br/><p>“Your Excellency, who are you? We are Cultivators from the Heavenly Pursuit Tribe of the Heavenly Court Alliance!”</p><br/><p>“I am the totemic Sacred Ancient of the Golden Crow Tribe, Meng Hao. I’m here to save my people and to eradicate the Heavenly Pursuit Tribe!”</p><br/><p>-----</p><br/><p>I just had to include this official rendition of the mastiff again:</p><br/><p></p><br/>\n</div>"}