{"title": "Chapter 550: Breaking the Formation!", "id": 550, "volume": 6, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-550-breaking-the-formation", "volume_title": "Volume 6", "body": "<h1>Chapter 550: Breaking the Formation!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 550: Breaking the Formation!</strong></p><br/><p>The two simple words rang out from Meng Hao’s mouth to fill the entire battlefield. When the Heavenly Pursuit Tribe heard the words, the sound of countless gasps could be heard. As for the Golden Crow Tribe members, their hearts filled with wild excitement.</p><br/><p>The two words contained guilt as well as killing intent directed toward the Heavenly Pursuit Tribe. Even as his words continued to echo about, Meng Hao’s eyes fell upon the bedraggled, listless Big Hairy.</p><br/><p>Then he saw the trembling Wild Giant, and many other faces within the crowd that he recognized from the migration.</p><br/><p>He saw Wu Chen. He saw the remnants of his neo-demon horde. He saw the members of the Church of the Golden Light. Many images shone brightly inside his mind. More than a hundred years of separation hadn’t seemed like a long time to Meng Hao, but for the Golden Crow Tribe, it had been like an eternity.</p><br/><p>“I’ve… returned,” he murmured. The Karma that existed between him and the Golden Crow Tribe could not be broken. When he saw their sorry state, the killing intent visible on his face grew even more intense.</p><br/><p>At the same time, among the panting members of the Heavenly Pursuit Tribe, the Greatfather’s eyes glimmered with the desire to kill.</p><br/><p>“So, you were able to evade the Patriarch,” said the Heavenly Pursuit Tribe High Priest. “You’ve clearly got some skill! However, since you’ve delivered yourself up, today will be the day you die!</p><br/><p>“Heavenly Pursuit Tribe Cultivators, kill this man! Eradicate the Golden Crow Tribe!” As soon as they heard his words, the members of the Heavenly Pursuit Tribe roared.</p><br/><p>Zhang Wenzu’s eyes gleamed with the desire to do battle.</p><br/><p>“So, you appear again! This time… we will fight!” Zhang Wenzu had been left with a deep impression of Meng Hao that year. Right now, his will to fight exploded out.</p><br/><p>Killing intent roared up from the more than one hundred Nascent Soul Cultivators and twenty totemic Sacred Ancients. They were just about to charge into battle when suddenly, the mastiff gave them a look of disdain and then let out a roar.</p><br/><p>The roar was backed by the mastiff’s Spirit Severing aura. As it exploded out, an invisible tempest sprung up with the mastiff at its center. All the Heavenly Pursuit Tribe members that the aura touched, including the Nascent Soul Cultivators and totemic Sacred Ancients, were filled with astonishment. Their faces fell; they almost couldn't believe that it was true!</p><br/><p>“Spirit Severing!!”</p><br/><p>“That’s… that’s a Spirit Severing neo-demon!!”</p><br/><p>At the same time, the seven huge Violet Sea Giants finally reached the battlefield, striding forward at top speed, the ground quaking beneath them.</p><br/><p>The hundreds of thousands of specters also neared, emanating grimness. The entire battlefield was suddenly filled with extreme coldness.</p><br/><p>As the mastiff sped forward, it turned into a beam of crimson light that shot toward the black field of light that was enveloping the Golden Crow Tribe.</p><br/><p>Meng Hao’s body flickered as he transformed into a green smoke and a black moon. Moments later, he appeared directly next to one of the black spikes. At the same time, he entered the Third Anima.</p><br/><p>The parrot and the meat jelly instantly flew out at top speed to perch on Meng Hao’s shoulder. They seemed as if they had suddenly found their backbones. They looked around the battlefield, their expressions triumphant and arrogant.</p><br/><p>“Come on, bitches! Well, what are you doing?!?! Who’s the tough one now? You dare to provoke Lord Fifth, bitches? Little Haowie, get out there and screw them!”</p><br/><p>“Humph! Lord Third isn’t going to convert you! Lord Third is gonna beat you to death! Little Haowie, get out there and screw them!”</p><br/><p>Meng Hao’s face was grim as he ignored the parrot and meat jelly. Now that he had entered the Third Anima, the power of four great circle Nascent Souls rose up within him, causing ripples to emanate out in all directions.</p><br/><p>BANG!</p><br/><p>As his Cultivation base exploded out, he waved his index finger through the air. It looked like an ordinary movement, but suddenly, violet Qi boiled up. This was none other than Meng Hao’s Violet Qi Guillotine.</p><br/><p>The blade descended onto the body of one of the Heavenly Pursuit Tribe Nascent Soul Cultivators. His eyes went wide and a booming sound rang out as his body was cleaved entirely in half.</p><br/><p>“Screw ‘em!! SCREW THEM!!” squawked the parrot excitedly, finally able to vent a bit after all this time.</p><br/><p>Meng Hao shot forward with a boom. At the same time, within the red glow surrounding the mastiff, countless bright red hairs suddenly appeared in the air. They began to rotate around the mastiff, shockingly transforming into a red tornado. It moved forward unimpeded, crushing anything that got in its way as easily as if it were dried weeds. It didn’t matter if it was a Sacred Ancient or a Nascent Soul Cultivator, anything that it touched screamed and then exploded, destroyed in both body and soul.</p><br/><p>This was not a battle. This was a massacre!</p><br/><p>As for the hundreds of thousands of specters, they were grim and emotionless as they pounced on the ordinary Cultivators of the Heavenly Pursuit Tribe. They could do nothing but tremble as their life force was exterminated.</p><br/><p>Most shocking of all were the seven Violet Sea Giants. After arriving on the battlefield, they sprang into motion. When their fists descended onto the surface of the ground, enormous craters appeared. Even more astonishing was the power of extermination that existed within them. Any living thing they touched was exterminated.</p><br/><p>The battlefield was instantly thrown into complete chaos!</p><br/><p>The sudden change caused the Heavenly Pursuit Tribe Greatfather and High Priest to gasp with disbelief. Zhang Wenzu’s eyes were wide as he stared, his mind a complete blank. Originally, he wanted to duel with Meng Hao, but now he could only watch as Meng Hao faced up against the Nascent Soul Cultivators. Not one could last for more than a single breath against him. At the moment, he watched as one of the illustrious Tribe Elders, who was in the late Nascent Soul stage, was so weak that he exploded under a single finger attack. As the man’s bloodcurdling shriek echoed in Zhang Wenzu’s ears, he began to tremble, and abandoned all thoughts of fighting a duel with Meng Hao.</p><br/><p>“Stop them from pulling up the Spirit Extermination Spikes!!” he cried.</p><br/><p>Despite their shock and widened eyes, the Heavenly Pursuit Tribe Cultivators howled and charged toward Meng Hao. Currently, Meng Hao was surrounded by thirty Nascent Soul Cultivators and seven or eight totemic Sacred Ancients, all of whom were attempting to prevent him from nearing the black spike.</p><br/><p>“Screw off!” he cried. The killing intent in his eyes boiled as he waved his hand, causing a wild wind to spring up that was filled with the power of four great circle Nascent Souls. It shot out, causing eight or so Nascent Soul Cultivators in front of him to tumble backward, blood spraying out of their mouths. Two of them even screamed and then directly exploded.</p><br/><p>At the same time, Meng Hao made a grasping motion. The Devil Spear appeared in his hand, and he tossed it backward. It instantly became a black mist filled with vicious faces which began to consume eight or so incoming opponents.</p><br/><p>Meng Hao didn’t pause for even a moment. He next appeared in front of one of the totemic Sacred Ancients, which bore the semblance of a rhinoceros. The killing intent in his eyes sparkled as his right fist descended.</p><br/><p>BAM!</p><br/><p>The totemic Sacred Ancient’s face was filled with disbelief in the moment before it exploded into a haze of blood and gore that Meng Hao passed directly through. Gasps could be heard from the other eight or so Nascent Soul Cultivators who had been attempting to block Meng Hao. They were filled with intense shock and their minds reeled. They suddenly stopped in their tracks, not daring to get in Meng Hao’s way.</p><br/><p>Meng Hao proceeded forward as if he were walking through a field of dry weeds. In the blink of an eye, he was directly above the black Spirit Extermination Spike. He reached down and grabbed ahold of it, then wrenched up.</p><br/><p>The spike let out an intense rumbling sound as it slowly moved upward. However, it was at this point that the Heavenly Pursuit Tribe Greatfather approached. Intense killing intent filled his eyes. He knew that he must under no circumstance let the Spirit Extermination Spike be pulled up. If he did, then the Golden Crow Tribe would be able to charge out, which would be like adding snow onto frost, disaster upon disaster.</p><br/><p>“Do not hold anything back! Stop him!” roared the Greatfather. The surrounding Nascent Soul Cultivators gritted their teeth, and, joined by eight or so totemic Sacred Ancients, charged toward Meng Hao.</p><br/><p>In the blink of an eye, they were bearing down on him. However, Meng Hao’s mouth curved in a cold smile.</p><br/><p>“Fourth Anima!”</p><br/><p>Roaring filled the air as he entered the Fourth Anima. Battle power equivalent to eight great circle Nascent Souls exploded out within Meng Hao. As his enemies neared, they were blasted by the explosive aura.</p><br/><p>Blood sprayed out of the mouths of all of the surrounding Nascent Soul Cultivators and totemic Sacred Ancients. Even the Heavenly Pursuit Tribe’s Greatfather coughed up blood and was sent tumbling backward, his face written with shock.</p><br/><p>He watched with wide eyes as Meng Hao heaved up again. A booming sound reverberated through the air as the spike was wrenched completely up out of the ground. As it emerged, it began to shrink rapidly, until it fit completely in Meng Hao’s palm.</p><br/><p>Now that one of the three spikes was gone, the black field of light which enveloped the Golden Crow Tribe rippled and distorted. Some of the life force that the black field had stolen now began to descend back down toward the excited members of the Golden Crow Tribe.</p><br/><p>The sight of it caused the Heavenly Pursuit Tribe to be filled with shock.</p><br/><p>“This man… just what level is his Cultivation base?!?!”</p><br/><p>“This isn’t the great circle of the Nascent Soul stage, this is… halfway to Spirit Severing!!”</p><br/><p>Even as everyone expressed their shock, another booming sound could be heard from the direction of the second of the Spirit Extermination Spikes. The ground quaked as the mastiff completely destroyed all the Nascent Soul Cultivators and totemic Sacred Ancients who defended it. Then, the mastiff smacked the spike violently with its paw. The blow was filled with such power that the spike was torn out the ground and sent flying, leaving behind a massive fissure.</p><br/><p>Having lost two of the spikes, the black field of light was now covered in distortions. It was no longer sucking away life force, but restoring it!! It took only moments for all of the life force it had stolen to be returned.</p><br/><p>As the black spike whizzed through the air, Meng Hao’s body flashed and he waved his right index finger into the air. Immediately, the enormous black spike trembled and began to shrink. In the blink of an eye, it landed on Meng Hao’s palm.</p><br/><p>Without pausing for a second, Meng Hao continued toward the third black spike. Anyone who tried to block his way would suddenly notice a red glow speeding toward them. The mastiff would appear and bat them away with its paw.</p><br/><p>Of course, anyone who received a blow from the paw of the mastiff ended up being transformed completely into a haze of blood and gore!</p><br/><p>BOOM!</p><br/><p>Meng Hao’s hand slammed down onto the surface of the third black spike. Rumbling filled the air, along with a popping sound, as he heaved it out of the ground.</p><br/><p>The black field of light completely shattered, and the Golden Crow Tribe members, their bodies fully recovered, charged out, killing intent rising to the Heavens.</p><br/><p>“KILL THEM!!”</p><br/>\n</div>"}