{"title": "Chapter 557: Seizing More Spirit Severing Treasures", "id": 557, "volume": 6, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-557-seizing-more-spirit-severing-treasures", "volume_title": "Volume 6", "body": "<h1>Chapter 557: Seizing More Spirit Severing Treasures</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>When Meng Hao looked up, the eyes of this youthful version of Patriarch Huyan glinted with killing intent. However, at the same time, hesitation could be seen.</p><br/><p>That was because Patriarch Huyan had a Demon Spirit in his bag of holding as well. As of this moment, he also could sense the power of teleportation pulsing out. It instantly caused him to hesitate as to whether or not to continue fighting.</p><br/><p>After all, now that he had reached the great circle of the First Severing of Spirit Severing, it meant that there were some incredibly important things for him to do in the Primordial Demon Immortal Plane.</p><br/><p>There was little time to consider the matter, though. Meng Hao’s aura was incredibly shocking. Their gazes locked and they both began to move.</p><br/><p>Rumbling filled the air as they unhesitatingly slammed into each other.</p><br/><p>Area fought Area.</p><br/><p>Domain fought Domain!</p><br/><p>Divine abilities fought divine abilities!</p><br/><p>This was nothing like the fighting from before. This was Spirit Severing carnage! That was especially true of Meng Hao’s Blood Immortal divine abilities. He had almost been able to slaughter Patriarch Huyan’s clone with them. As of now, he instantly employed them. Deadly sundered clouds roiled out in all directions, filling the sky with rumbling sounds.</p><br/><p>A blood rain fell, and a Violet Sea raged.</p><br/><p>Even more shocking to Patriarch Huyan was that Meng Hao’s battle prowess was actually greater than when he had fought his clone.</p><br/><p>Furthermore, in the middle of all his mightiness, Patriarch Huyan could, for the first time sense… faith power!</p><br/><p>It was at this point that he recalled that the person in front of him was a Cultivator, but at the same time… a totemic Sacred Ancient who could absorb faith power!</p><br/><p>This faith power made Meng Hao’s battle prowess even more explosive, absurdly powerful. It was powerful enough that it could fight back against the First Severing.</p><br/><p>“Dammit, I forgot that he’s a totemic Sacred Ancient who can absorb faith power,” thought Patriarch Huyan. “This time, he’s much closer to his Tribe, not far, far away like last time. That means the faith power is much stronger!</p><br/><p>“Before, in the Violet Sea, the great distance made the faith power incredibly weak!!</p><br/><p>“The best place to kill him would be a place where he can’t absorb faith power….” Even as he mused in shock over these matters, they continued to fight back and forth. Patriarch Huyan relentlessly employed divine abilities, used emotion severing, his Spirit Immortal, and various magical techniques.</p><br/><p>At the same time, the Spirit Severing spectators could also sense the faith power in Meng Hao, which caused them to gasp. Their minds could not help but be shaken.</p><br/><p>“Even I overlooked Meng Hao’s other identity,” said the red-robed boy, a strange look gleaming in his eyes. “He’s a totemic Sacred Ancient!” He suddenly had an idea. A person like Meng Hao was someone he should make friends with. The best thing to do would be to send charcoal during snowy weather, so to speak, and provide some timely help. That would be the best way to forge deeper ties.</p><br/><p>All of the Spirit Severing experts in the area were having similar thoughts. In fact, all of the Cultivators in the seventy percent of the Black Lands Tribes who were watching were nervously thinking the same thing.</p><br/><p>Xu Bai of the Black Dragon Tribe was now an old man. After the Black Dragon Tribe broke away from the Golden Crow Tribe, they joined the great Demon Talisman Tribe. As of this moment, the majority of the Demon Talisman Tribe was gathered in their public square, watching the proceedings on a large screen. Xu Bai sighed inwardly.</p><br/><p>Standing next to him was an effeminate man, a male Cultivator who was gentle and soft, but also cold. This was none other than that Chen Mo of the great Demon Talisman Tribe, who was one of the ones who fought over the Demon Spirit that year in the Realm of the Bridge Ruins.</p><br/><p>“Having second thoughts?” he asked. “This Meng Hao…. He truly supersedes all of us.”</p><br/><p>Xu Bai was silent for a moment. Finally, he nodded his head and said, “Perhaps. As I look back, I don’t think I made the right decision.”</p><br/><p>In the great Demon Butterfly Tribe, Duo Lan’s wide eyes were fixed on Meng Hao.</p><br/><p>In the great Cloud Sky Tribe, Zhou Dekun was panting. Next to him was Zhao Fang, another member of the great Cloud Sky Tribe. He had a similar expression to Zhou Dekun.</p><br/><p>Roaring filled the air as the raging fight continued.</p><br/><p>Even as the two of them fought back and forth fiercely, each of them could sense the other’s Demon Spirit. In fact, whenever they got closer to each other, the power of teleportation grew stronger.</p><br/><p>Patriarch Huyan’s eyes flashed with killing intent. The power of teleportation was pulsating out of his Demon Spirit with increased frequency, almost as if it were urging him to finish the fight more quickly. The desire in his heart to kill Meng Hao had reached its pinnacle. He suddenly raised his right hand up into the air and pointed to the sky.</p><br/><p>“Heavenly Pursuit!” he roared. As the words echoed out, a crackling like that of thunder could be heard in the sky.</p><br/><p>“Heavenly Pursuit!!” he roared a second time. Shocking claps of thunder could be heard, and his body grew slightly indistinct. A savage and unmatchably brutal aura roared out of him.</p><br/><p>“HEAVENLY PURSUIT!!!” he shouted a third time. The sky up above suddenly seemed to rip apart as a colossal three-headed anaconda bored out from within the void.</p><br/><p>The anaconda was fully thirty thousand meters long and was violet in color. The three heads radiated cruelty and had forked tongues that flicked in and out. Furthermore, each head sported a long horn.</p><br/><p>The instant it appeared, intense pressure bore down onto the Black Lands.</p><br/><p>This was not a Spirit Severing aura. Nor was it the aura of Dao Seeking. This was… the aura of an Immortal!!</p><br/><p>This violet-colored, three-headed beast was shockingly equipped with Immortal will!!</p><br/><p>Its appearance instantly filled the land with thunderous roaring.</p><br/><p>Conversations instantly broke out.</p><br/><p>“Heavenly Pursuit Dragonsnake!”</p><br/><p>“That’s the Heavenly Pursuit Tribe’s bloodline ancestor, the Heavenly Pursuit Dragonsnake!”</p><br/><p>“According to the legends, every Western Desert Tribe has a bloodline that traces back to an Immortal. As the legacies get passed down through the generations, there is always a small chance to set off the bloodline and be able to summon the ancestor!”</p><br/><p>The surrounding Spirit Severing experts were not shocked by this development, but when the Cultivators from the other cities in the Black Lands saw, most were completely astonished.</p><br/><p>As roaring filled the Black Lands, Patriarch Huyan began to bleed from his eyes, ears, nose, and mouth. The summoning he had just performed had put quite a strain on him.</p><br/><p>It was as if this world did not consent to the appearance of such a beast as this. As the three-headed anaconda approached, an enormous illusory net appeared around it. This net appeared to be some sort of natural law, something seemingly unbreakable and unblockable!</p><br/><p>The Heavenly Pursuit Dragonsnake roared and struggled, and blood sprayed from Patriarch Huyan’s mouth. Finally, for a fourth time, he shouted:</p><br/><p>“Heavenly Pursuit!”</p><br/><p>BOOM!</p><br/><p>The six eyes of the Heavenly Pursuit Dragonsnake glittered. With a mere glance, they sent Meng Hao’s mind completely reeling. At the same time, the centermost head suddenly bit down on its own tail and then ripped it off.</p><br/><p>The severed tail suddenly began to blaze with fire. In the blink of an eye, the burning power broke through the enormous illusory net. Even as the giant net tightened around the Heavenly Pursuit Dragonsnake, it flung its tail directly toward Patriarch Huyan.</p><br/><p>It burned as it flew through the air, scorching away the flesh and blood, purifying the tail until it was only bones. By the time it reached Patriarch Huyan, shockingly, it had transformed into… a violet-colored bone whip!!</p><br/><p>It floated there in mid-air, just waiting for Patriarch Huyan to take control of it. It undulated slowly, sending out ripples into the air along with cracking sounds. The air around the whip continuously shattered in successive layers. A terrifying, almost infinitely powerful aura instantly exploded out from the snake tail.</p><br/><p>All of this takes quite some time to describe, but actually only five breaths of time had passed during the fight between Meng Hao and Patriarch Huyan.</p><br/><p>Patriarch Huyan reached out excitedly toward the floating whip to grab it.</p><br/><p>The whip was obviously a precious treasure. Meng Hao and the surrounding Spirit Severing experts in Divine Sense form could all sense this. The streams of Divine Sense undulated greedily.</p><br/><p>However, their greed quickly vanished, to be replaced with pity. This particular precious treasure might be mighty, but it was a bloodline treasure. Objects such as that could only be used by members of the Heavenly Pursuit bloodline.</p><br/><p>Furthermore, even ordinary bloodline members would be unable to use it. Only people in whose veins the blood ran thick and pure would be able to, and that was only after reaching the Spirit Severing stage. Anyone else who attempted to do so would receive grievous injury.</p><br/><p>With so many restrictions on the snake bone whip, the precious treasure became an object of little value to spectators, as valuable as chicken ribs.</p><br/><p>However…. When Meng Hao saw it, his eyes shone with a strange light. While others might view it as nothing more valuable than chicken ribs, that was not the case with him. Meng Hao had not just eradicated the entire Heavenly Pursuit Tribe. During the slaughter, he had retrieved some blood samples.</p><br/><p>That blood contained five successive generations of Heavenly Pursuit Tribe members. If he could get some blood from Patriarch Huyan, then he would have six generations of blood, and could create a six generation Blood Clone. Furthermore, it wouldn’t be an ordinary Blood Clone but, rather, a Blood Spirit. If he could get nine generations of blood, it would be a Blood Divinity with the potential for Ancestral Awakening.</p><br/><p>Whatever happened, if he made such a Blood Clone, then it would be able to wield the snake bone whip!</p><br/><p>After all these thoughts passed through his head, he finally said, “I have to risk it!”</p><br/><p>As Patriarch Huyan reached out to grab the snake bone whip, Meng Hao’s eyes began to glow with a light that would make anyone who saw it feel a sense of danger. He took a step forward and raised his hand. Filled with determination, he pointed at Patriarch Huyan.</p><br/><p>“Demon Sealing, Eighth Hex!”</p><br/><p>When the divine ability appeared, it caused Patriarch Huyan to be entwined with invisible Demonic Qi. Instantly, a tremor ran through him.</p><br/><p>“This move again!” said Patriarch Huyan, his face growing dark. He had considered many methods for dealing with the strange divine ability, but none were truly capable of standing up against it. The only thing he could do was to be on the lookout for it. At the moment, he was sealed, but it would only last for half a breath. Then, the strands of Demonic Qi would began to fall apart.</p><br/><p>Blood sprayed from Meng Hao’s mouth. In half a breath’s worth of time, he was only able to get within a few dozen meters of the snake bone whip. Patriarch Huyan, on the other hand, was only about seven inches away, well within reach!</p><br/><p>The surrounding Spirit Severing experts as well as the other observing Cultivators were watching closely as Patriarch Huyan seemed about to lay his hand onto the snake bone whip,. There were many who had already guessed what Meng Hao was trying to do. Some still hadn’t figured it out, and were slightly confused.</p><br/><p>It was in this exact moment that Meng Hao suddenly opened his mouth. A black light flew out at incredible speed, kicking up a powerful wind. The black light immediately transformed into a black colored wheel.</p><br/><p>This was… the Wheel of Time.</p><br/><p>At the same time, Meng Hao’s Wooden Time Swords appeared and began to rotate around the wheel. Rumbling sounds could be heard as the Wheel of Time began to spin.</p><br/><p>Instantly the power of Time reversal erupted out. A tremor ran through Patriarch Huyan’s mind. His face twisted, and he was about to struggle against it when suddenly his body, completely beyond his own control, began to move backward.</p><br/><p>It was as if time were reversing. Even as Patriarch Huyan fought back against the power, Meng Hao once again used his Demon Sealing powers, injuring himself in the process.</p><br/><p>BANG!</p><br/><p>Patriarch Huyan’s body trembled as he suddenly lost his Cultivation base. It was only for a moment, but that, combined with the time reversal, pushed him half a meter away from the snake bone whip.</p><br/><p>As for Meng Hao, he transformed into a green smoke. Coughing up blood the whole time, he appeared in front of the snake bone whip. Eyes filled with determination, he reached out and grabbed it!</p><br/><p>-----</p><br/><p><em>This chapter was sponsored by Sebastian Weiß, Anonymous, Mitchell Campbell, Graham Kem</em></p><br/><p>-----</p><br/><p>To view the insane April Fools' edition of the following chapter, including all the original comments, please click here. Otherwise, use the regular \"next chapter\" button to go to the real version of chapter 558</p><br/>\n</div>"}