{"title": "Chapter 553: Lord Fifth Lives for a Dream of Love!", "id": 553, "volume": 6, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-553-lord-fifth-lives-for-a-dream-of-love", "volume_title": "Volume 6", "body": "<h1>Chapter 553: Lord Fifth Lives for a Dream of Love!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 553: Lord Fifth Lives for a Dream of Love!</strong></p><br/><p>At the same time that the members of the Heavenly Pursuit Tribe met their grievous end within the field of black light, back in the main temple of the Heavenly Pursuit Tribe, Patriarch Huyan sat cross-legged, shielded off in a restricted area. When the last Tribe member died, his eyes opened.</p><br/><p>A cold, emotionless glow could be seen therein.</p><br/><p>Around him, souls formed from grief began to appear. These were discarnate souls; their main souls had already been destroyed. These were only bits of will left behind in the temple.</p><br/><p>As the maltreated souls floated around Patriarch Huyan, they let out voiceless cries. Patriarch Huyan’s looked calmly at the maltreated souls. His voice was cool as he murmured, “Your deaths are not meaningless. In fact, they were very important to me.</p><br/><p>“Don’t look at it as me not going to save you. Rather… you needed to die. The more miserable your deaths, the more emotionless I can be. The more grief you felt in dying… the stronger my Dao becomes!</p><br/><p>“Qing’er’s death made it so that my Dao cannot be completed perfectly. The only thing I can do now is to find someone to replace Qing’er. You 80,000 members of the Heavenly Pursuit Tribe… are none other than that replacement.</p><br/><p>“I watched you die, capable of saving you, yet choosing not to. I watched you die, watched you clamoring for help, and it filled my heart with stabs of pain. However, the deeper those stabs of pain, the more emotion can be obliterated.</p><br/><p>“You will not have died in vain. You will make my Dao… reach the peak of the First Severing!</p><br/><p>“As far as the Tribe goes… as long as I am alive, there will always be a Tribe.” Patriarch Huyan closed his eyes.</p><br/><p>Meanwhile, booms rang out with every step the seven Violet Sea Giants took as they ran through the Black Lands. From off in the distance it almost looked like the churning Violet Sea itself, radiating boundless energy. Meng Hao stood on the mastiff, which shot through the air, surrounded by a crimson glow.</p><br/><p>Their destination was none other than the Heavenly Pursuit Tribe’s temple in the Black Lands!</p><br/><p>Meng Hao’s face was incredibly grim as they made their way forward. His eyes twitched, and subconsciously, his hands clenched into fists and emanated cracking sounds. The reason for all of this actually had nothing to do with Patriarch Huyan, but rather… the parrot.</p><br/><p>“Heyyy. Hi there! You can call me Lord Fifth. Let’s get to know each other, okay?” The parrot was flying in front of the mastiff, trying to look very graceful and gentlemanly. However, no matter how you looked at it, it looked perverted. Currently, it was peering tenderheartedly at the mastiff.</p><br/><p>The mastiff had a strange expression in its eyes as it looked back at the parrot, puzzled.</p><br/><p>When its gaze fell upon the parrot, the parrot suddenly seemed as if it couldn’t control itself any more. It clutched its talons to its chest and let out an impassioned cry.</p><br/><p>“This is it! This is the true love I’ve been waiting for my entire life!! Look at the fur! So tempting! Look at that expression! So pure! Look at that figure! So enchanting!</p><br/><p>“This is the true love of my life!” Tears appeared in the parrot’s eyes as it looked at the Blood Mastiff with an expression of fanatical infatuation.</p><br/><p>“Beautiful little darling, please allow me to introduce myself again,” it said loudly, its eyes shining brightly. “You can call me Lord Fifth. From now on, you’re my little girl. From now on, you…”</p><br/><p>It was at this point that Meng Hao’s grim voice could be heard through clenched teeth.</p><br/><p>“SCREW OFF!!”</p><br/><p>The sound caused the parrot to fall back with a squawk. However, it quickly flew back, glaring angrily at Meng Hao. From out of nowhere, a black cloth appeared in its claws, which it quickly tied around one of its eyes. Its aura suddenly exploded up.</p><br/><p>“You want to duel with me?!?!” the parrot raved. “Little Haowie, let’s do this, right now! Duel with Lord Fifth. This beautiful little darling will belong to whoever wins!” The frenzied parrot’s appearance was one of ultimate arrogance. It appeared to have gone crazy for love. It truly believed that by challenging Meng Hao, it could attract the attention of what it referred to as the beautiful little darling.</p><br/><p>Meng Hao felt his temples pulsing. The headache he was experiencing was almost too much to take. He had to admit that he had forgotten about the parrot’s unique addiction. After looking at the mastiff, he also had to admit that to the parrot, it must be incredibly alluring.</p><br/><p>“It’s male,” he explained with a forced smile.</p><br/><p>The parrot looked hurt. “Male, female, it doesn’t matter. Lord Fifth lives for true love!” it roared. Its multicolored feathers stood on end, making it look almost like a gamecock. In truth, it was feeling very pleased with itself. In its estimation, it looked extremely handsome and dashing at the moment. It couldn’t help but glance at the mastiff out of the corner of its eye to see the expression on its face.</p><br/><p>Meng Hao said nothing. The pain in his head only continued to grow. As far as he was concerned, the parrot needed a good spanking. He waved his right hand, causing a gale force wind to sweep out and surround it.</p><br/><p>Within the whipping wind, the parrot struggled and then roared, “This is true love! True love is invincible!”</p><br/><p>“Screw off!” cried Meng Hao, waving his sleeve again and trying to ignore the pain in his head. The wind screamed, but the parrot’s persistent voice once again rang out.</p><br/><p>“Meng Hao, you’re shameless! You wanna be the third wheel! You wanna break us up!!”</p><br/><p>Meng Hao’s face grew even darker. Finally, he shrugged and punched out. The response was a frenzied roar from the parrot.</p><br/><p>“Lord Fifth’s love will never change! Lord Fifth’s love will last forever!!” The parrot held nothing back as it roared at the top of its lungs to vindicate itself. Then, it let out a pained cry as it fell back a few paces, after which it looked passionately at the mastiff and yelled, “Little darling, Lord Fifth will travel to the ends of the earth for love! Let’s elope! What do you say?” Its eyes burned with passion.</p><br/><p>The Blood Mastiff’s Cultivation base was at the Spirit Severing stage, and it was quite intelligent. At first, it was confused about what was going on. Now, though, this intrepid Blood Mastiff trembled as it looked at the parrot. Suddenly, its rage exploded up to the Heavens. It appeared to feel provoked, humiliated, as if it had been taken to be a female. Such intense provocation immediately caused the mastiff to fly into a rage.</p><br/><p>It roared and shot forward toward the parrot, then batted it with a huge paw.</p><br/><p>With a bang, the parrot was sent flying backward. Moments later, it flew back persistently.</p><br/><p>“I will go to the ends of the earth for love! I live for my dream of love!! I am the mighty, the passionate, the one and only Lord Fifth!!”</p><br/><p>Even as the parrot declared loudly everything it would do for love, the mastiff disappeared. It reappeared directly in front of the parrot. It grabbed the parrot in its paw, forcibly shutting it up, and then opened its gigantic mouth to let out a threatening roar. Compared to the mastiff’s giant head, the tiny parrot was so tiny that it could be considered negligible.</p><br/><p>The parrot was about to struggle, but the crushing Spirit Severing pressure instantly caused it to settle down. Its eyes opened wide as the mastiff’s huge face grew close. As for the parrot, it almost looked intoxicated. Seemingly incapable of controlling its passion, it stretched out with its pointed beak and… gently kissed the mastiff.</p><br/><p>The mastiff gaped in astonishment. Meng Hao stared in shock. Even the meat jelly was dumbfounded.</p><br/><p>Everything was deathly quiet.</p><br/><p>The parrot's eyes glowed with an intense light as it looked at the mastiff. “Lord Fifth loves your power, little darling,” it said loudly. “The more powerful you are, the more you fight back, the more Lord Fifth loves you.”</p><br/><p>The mastiff lifted its head up and roared. Its fury had reached a pinnacle. Its eyes radiated fierceness as it bit down, ripping the parrot into pieces. Moments later, though, the parrot reformed and shamelessly began to once again shout out:</p><br/><p>“I will go to the ends of the earth for love!” it declared. “I live for my dream of love!! Even if you kill Lord Fifth a thousand times, it’s like tempering steel! My love for you… is eternal!”</p><br/><p>The mastiff roared, charging once again to tear parrot into pieces. And then, it all began again….</p><br/><p>Meng Hao rubbed the bridge of his nose, and chuckled bitterly. At some point, the meat jelly had taken up a position on his shoulder. Similar to Meng Hao, a hand appeared, and it too rubbed the bridge of its nose. Its expression was exactly the same as Meng Hao’s.</p><br/><p>“Now do you see why it takes Lord Third an entire lifetime to convert it?” said the meat jelly somberly. It looked at Meng Hao with an enigmatic expression that said, ‘you know what I mean….’</p><br/><p>“Yes, I get it now,” replied Meng Hao, sighing. In that moment, a tremor ran through his body as he suddenly realized that he had just made a massive mistake. He had actually… started a conversation with the meat jelly!</p><br/><p>The meat jelly’s eyes lit up, its desire to chat suddenly aroused.</p><br/><p>“You get it? You really get it? Heavens! You really do get it! You understand me now! Okay, then, let’s talk about something that happened 30,000 years ago. It was just too much. Infuriating! Oh, wait. Before that, let’s talk about the weather from 70,000 years ago….”</p><br/><p>The meat jelly trembled with excitement as it began to chatter. It turned into a droning sound in Meng Hao’s ears. He watched the mastiff and the parrot battling, and listened to the garrulous meat jelly.</p><br/><p>Suddenly, a feeling rose up in Meng Hao’s heart that gave him the sensation that he was about to go insane. Any normal person who spent a lot of time with the parrot and meat jelly would definitely become abnormal.</p><br/><p>All of a sudden, he felt a twinge of sympathy for the Li Clan Patriarch.</p><br/><p>Meng Hao sighed and obediently maintained his silence. He said nothing, but rather, allowed the meat jelly to talk endlessly, allowed the parrot to continue to be battered around by the mastiff. Every time the parrot was smacked away, it would return and say all kinds of things that Meng Hao could not help but hear. Soon, he started to go numb.</p><br/><p>And that was how time passed by oh so slowly…</p><br/><p>Half a day later, even as the parrot continued to pay court to the mastiff, who continued to violently refuse it, the Heavenly Pursuit Tribe’s temple appeared up ahead.</p><br/><p>The temple itself was an enormous mountain shaped like a bottle gourd. It looked like a gigantic stone bottle gourd placed directly onto the surface of the land. The mountains that surrounded it were bare and infertile. The only entrance was at the very top of the mountain, at the mouth of the gourd.</p><br/><p>Seeing the bottle gourd mountain caused Meng Hao to feel an indescribable sense of release. He shot directly toward the mouth of the gourd, and as he neared, he could sense an incredibly powerful restrictive spell.</p><br/><p>The mouth of the gourd was like that of a volcano, and was roughly three hundred meters wide.</p><br/><p>An enormous magical symbol could be seen stretching across the opening, floating there in mid-air, preventing anything from entering, be it a person or a stream of Divine Sense. Shockingly, just barely visible beyond the illusory mouth of the gourd, Meng Hao could see another world.</p><br/><p>——</p><br/><p>Note from Er Gen: Heyyy, let me tell you a personal story from back when I had just started college. One time our dorm had a party with the girl’s dorm and I took a liking to one of the girls… unfortunately, in the end I was turned down. (As for her name, well, I still remember it down to this day.)</p><br/><p>At that time, chat software was just starting to get popular, so I started a QQ account. As for whether it was five numbers long or six, I can’t remember. [1. QQ numbers nowadays are 8 or 9 numbers long, so this shows how old school he is] Anyway, for whatever reason, the first online username I ever picked was “Live for a Dream of Love.”</p><br/><p>As I recall it now, it seems both corny and also somewhat unthinkable. At the same time, it reminds me of how wonderful youth can be.</p><br/><p>Alright, enough of that. When I have a chance, I’ll tell all of you about three love letters I received in college, as well as the one I received after I started working. Every once in a while, I remember them and take them out. They make me both sigh and smile. The paper is yellow, and old, and makes me think about past times…. (to be continued….)</p><br/><p>-----</p><br/><p><em>This chapter was sponsored by Jacob Philips, Yanuar Yaputra, Tjandra Johannes, Fabio Porcedda, Patryk Czajczyński, and Sebastian Weiß</em></p><br/>\n</div>"}