{"title": "Chapter 563: The Extraordinary Ancient Demon Immortal Sect!", "id": 563, "volume": 6, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-563-the-extraordinary-ancient-demon-immortal-sect", "volume_title": "Volume 6", "body": "<h1>Chapter 563: The Extraordinary Ancient Demon Immortal Sect!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 563: The Extraordinary Ancient Demon Immortal Sect!</strong></p><br/><p>“Host body?” said Meng Hao, gaping. It was the second time he had heard such a term, the first being when Ji Xiaoxiao said it. His eyes glittered as he suddenly thought of the Resurrection Lily’s parasitic existence.</p><br/><p>Unfortunately, he wasn’t sure if that had anything to do with the term ‘host body’ mentioned by Fang Yu. He intentionally made his expression one of confusion, but inwardly, he was extremely vigilant.</p><br/><p>Seeing his expression, Fang Yu frowned for a moment. Then she reached her hand up as if to smack him on the head. The movement seemed incredibly practiced, as if it was something she did all the time. Without even thinking about it, Meng Hao backed up a few steps. Fang Yu glared at him, but eventually lowered her hand.</p><br/><p>“You don’t know anything,” she said angrily, “and yet dare to come to the Primordial Demon Immortal Plane? You….” After a moment, she finally started to explain to him what she meant by ‘host body.’</p><br/><p>As he listened to her explanation, his eyes slowly began to glow brightly.</p><br/><p>According to her description, every time the Primordial Demon Immortal Plane opened, it meant fortune for those who entered. However, the extent of that good fortune depended on how far any given participant was able to get into the various planes.</p><br/><p>“When the Primordial Demon Immortal Plane opens,” Fang Yu explained, “there are initially two different planes. The First Plane is where we are now, the ruins of the ancient Demon Immortal Sect. Here, virtually all the locations which contain good fortune are protected by restrictive spells. This plane will only remain open for seventy-two hours!</p><br/><p>“In the First Plane, none of the participants will find any techniques or legacies. Nor will they find even the tiniest treasure. Well, that’s not a hard and fast rule, but basically, considering how many times the Primordial Demon Immortal Plane has opened, anything that could have been taken away has long since disappeared into the hands of people in the past.</p><br/><p>“The only thing we can do here is related to the fundamental purpose of the First Plane. And that is… we have to find a proper host body. Such host bodies are none other than the corpses you see around you! Each and every one of these corpses could be a host body!</p><br/><p>“Seventy-two hours is all the time we Cultivators have to find a proper host body!</p><br/><p>“After the seventy-two hours, the Second Plane will automatically open, and we will be able to recall ancient times!” Seeing that Meng Hao seemed to be paying rapt attention to her, Fang Yu couldn’t help but smile. She continued on to explain in further details, not concealing anything at all from Meng Hao.</p><br/><p>What she didn’t know was that Meng Hao was actually only half paying attention to her. The other half of his attention was focused on Fang Yu herself, as he tried to determine why exactly she was expending such special effort to help him.</p><br/><p>“Uhhh… she couldn’t possibly have fallen in love with me, could she?” he thought. He suddenly felt an icy feeling tingling up his spine. The more he thought about it though, the less likely it seemed. Nonetheless, he couldn’t help but subconsciously rub his right hand as he thought about the first time the two of them had met.</p><br/><p>“The Second Plane is sort of like a hallucination that we will all experience at the same time,” Fang Yu continued. “However, it’s incredibly realistic. During that time, we will enter the once flourishing Demon Immortal Sect. As for which specific era we visit, that cannot be determined.</p><br/><p>“It will be almost as if we have actually returned to ancient times. Furthermore, when inside the ancient Demon Immortal Sect, we will not be ourselves. Instead, we will assume the identity of whichever body we have chosen as a host. Using that person’s identity, we can search for good fortune in the chimerical version of ancient times.” Fang Yu’s eyes began to gleam with anticipation.</p><br/><p>“Therefore, one’s choice of host body is extremely important. If the host body’s status is high, then naturally you will be presented with better opportunities, maybe even Heaven-defying ones! The host body is the key to it all! With the right status, the good fortune you can acquire defies imagination!” By this point, the anticipation in her eyes was incredibly strong.</p><br/><p>Having heard the explanation up to this point, Meng Hao’s eyes flickered. “An ancient dreamland?” he said. “If it’s just a dreamland, then can there really be so much good fortune?”</p><br/><p>“The fact that it is a dreamland has been confirmed by those who entered in the past,” Fang Yu said earnestly. “Also, once inside… anything is possible!”</p><br/><p>“The existence of the Demon Immortal Sect spanned many years,” replied Meng Hao. “Also, there is a vast difference between the ages of the various disciples. Some might have just joined the Sect at the time of their death, others might have been around for ten thousand years. Since that’s the case, how could it be possible for everyone to enter the same era?”</p><br/><p>Hearing this question caused Fang Yu’s eyes to gleam with admiration. She was obviously quite pleased to hear such a question.</p><br/><p>“It all depends on your luck. In past generations, people who got unlucky ended up selecting host bodies of disciples that didn’t exist in ancient times. Unfortunately for them, they were unable to enter the Second Plane, and were cast out early.</p><br/><p>“Therefore, it doesn’t matter whether you are worried about your chances of seizing good fortune, or even just the opportunity to enter the Second Plane, you have to find a corpse that had been around a long time before dying.”</p><br/><p>Meng Hao thought about this for a moment.</p><br/><p>“It’s just like I said before,” Fang Yu went on, “selecting a host body is incredibly important. You might as well forget about getting a host body of a Sect Elder or Priest, or one of the seven incredible Elite Apprentices. That likelihood is incredibly small.</p><br/><p>“It’s even rare to find a Conclave disciple; even if you went looking, you wouldn’t be able to find one except by chance. The best thing to do is to fight for one of the Inner Sect disciples.</p><br/><p>“Throughout the years in which the Primordial Demon Immortal Plane has opened, the Ji Clan has come to occupy the best position. They have located the corpses of five Inner Sect disciples, and one Conclave disciple.</p><br/><p>“As for the Fang Clan, we have only been able to locate four Inner Sect disciples.</p><br/><p>“Most of the rest of the Sects in South Heaven,” she said calmly, “only have records of one or two Inner Sect disciples.”</p><br/><p>Meng Hao took a deep breath. Now he fully understood the importance of the host body. A host body with a high status meant better chances for good fortune in the Second Plane. Some ancient legacies and techniques would only be available to people with special positions.</p><br/><p>“Furthermore,” said Fang Yu, “upon entering the Second Plane, all of us will temporarily lose all of our memories. For a short period time, we will believe ourselves to be whoever the host body is. However, based on the skill and ability of each individual, we will awaken within a matter of hours or days.</p><br/><p>“That period of time is the most dangerous!” When she reached this point, Fang Yu’s voice was very serious. “The reason is because if you wake up too slowly, you lose out on certain opportunities. Furthermore, your life will be in danger because of others who wake up before you!</p><br/><p>“The Second Plane is where the true dangers of the Primordial Demon Immortal Plane begin. However, the benefits to be gained are enormous. According to the legends, the ancient Demon Immortal Sect has one thousand types of Daoist magic, one thousand orthodoxies, and one thousand heterodoxies. In total, there are three thousand great Daos. Each one of these divine abilities and Daoist magics are a legacy.</p><br/><p>“Throughout the years, the greatest legacy ever acquired was when a Ji Clan member acquired the identity of a Conclave disciple and thus, the Underworld Seance Magic. By gaining enlightenment, he was able to take the technique out with him. Such a divine ability is well suited to the Ji Clan Dao of Karma.</p><br/><p>“In the ranking system of the 3,000 great Daos of the Demon Immortal Sect, the Underworld Seance Magic is listed as number 408. That means there are four hundred even more powerful divine abilities. That is especially true of the top ten, each of which can be described as a great Dao!</p><br/><p>“According to the legends, the top ten are powerful enough to rock the Heavens and shake the Earth.”</p><br/><p>When Meng Hao heard this, his expression was the same as ever, but his heart pounded wildly. He looked at Fang Yu and asked another question. “You’re talking about the Ji Clan of South Heaven?”</p><br/><p>Fang Yu hesitated for a moment and muttered to herself. Finally, she replied, “In the Ninth Mountain and Sea, the Ji Clan has five branches. The branch on South Heaven is not the main branch, but rather, one of the subsidiary branches.”</p><br/><p>“Okay,” said Meng Hao. Seeing that Fang Yu apparently didn’t want to talk about the Ji Clan, he decided to ask a question about something else he was curious about. “So, about those top ten divine abilities and Daoist magics. What exactly are they?”</p><br/><p>“I’m not sure,” replied Fang Yu, shaking her head. “I just know that the number one position is occupied by… the Mountain and Sea Scripture!” As soon as she spoke the words ‘Mountain and Sea Scripture,’ her eyes began to glow with a brilliant light. “However, even if you had some Heaven-defying good luck, it would be impossible to achieve enlightenment regarding it and then take it out. By the way, if you don’t achieve enlightenment regarding a given Daoist magic, then it’s impossible to brand it, and therefore impossible to remember. Once you leave the dreamland, you would completely forget it.”</p><br/><p>When Meng Hao heard her mention the Mountain and Sea Scripture, he recalled what the parrot had spoken of. According to the parrot, the origin of the three classic scriptures was none other than something called the Mountain and Sea Scripture.[1. The Mountain and Sea Scripture was mentioned in chapter 338]</p><br/><p>At this point, Meng Hao asked yet another question. “You’ve mentioned a First Plane and a Second Plane. Could it be that there is also a Third Plane?”</p><br/><p>“Yes. However, according to the Clan records, the most probable likelihood is that we will not be able to meet the requirements to open the Third Plane. At a certain point in the Second Plane, the Primordial Demon Immortal Plane will close, we will all be teleported back to the lands of South Heaven.</p><br/><p>“Throughout history, there have only been five occasions in which the requirements were met and the Third Plane appeared!”</p><br/><p>Meng Hao watched her closely as she continued her explanation.</p><br/><p>“The Third Plane occurs after awakening from the Second Plane. All of the restrictive spells throughout the ancient Demon Immortal Sect will become unstable and even disappear. During that time, anyone can enter those previously sealed areas to acquire treasure left over from the ancient Demon Immortal Sect!</p><br/><p>“When entering the Third Plane, the previous identity of the host body will vanish. However, according to the various legacies and techniques learned in the Second Plane, it would be possible to remove some of the restrictive spells from places that still have them, and acquire shocking good fortune.”</p><br/><p>Meng Hao took a deep breath. He was now much clearer about the various matters regarding the Primordial Demon Immortal Plane. The First Plane was about preparation. The Second Plane was a place to acquire the good fortune of immaterial techniques and legacies.</p><br/><p>The Third Plane was a place to take advantage of the good fortune and preparation from the first two Planes to acquire physical treasures.</p><br/><p>Everything was connected!</p><br/><p>“So, now you understand what will happen in not so many hours. Right now, time is limited. During the seventy-two hours that the First Plane is open, people will be using information from the secret records of their Sect or Clan to find various corpses.</p><br/><p>“You come with me. I’ll take you to one of the Inner Sect Disciples that the Fang Clan knows about. You hide yourself there and wait for the Second Plane to open.” With a final look at Meng Hao, Fang Yu turned and sped off.</p><br/><p>Meng Hao stood there thoughtfully for a moment. Based on his analysis, about eighty percent of what Fang Yu had told him was probably true. He was still a cautious person, and was aware that gullibility was a weakness. However, in the end, he chose not to refuse her offer.</p><br/><p>The two of them sped off toward the second mountain peak.</p><br/><p>Time passed, and the sky grew darker. Meng Hao continued to glance around cautiously, but the ancient Demon Immortal Sect was simply too big. They didn’t run into anyone else. At this point, Meng Hao started to think about who else might have come to the Primordial Demon Immortal Plane from… the Southern Domain.</p><br/><p>“Xu Qing. Elder Brother. Fatty. Chu Yuyan. And then there are the Dao Children from the three great Clans, as well as the other Chosen from the Sects. I wonder who I might run into here.” He thought about these things as he and Fang Yu continued to speed along until dawn of the following morning. By this time, they had traversed about thirty percent of the path between the second and third peaks.</p><br/><p>Everywhere they passed, they saw wreckage and corpses, as well as areas with restrictive spells that glowed brightly in the darkness. The dangerous, flickering auras of the restrictive spells were things that even Fang Yu would not be immune to.</p><br/><p>At one point, Fang Yu said something that caused Meng Hao’s eyes to go wide.</p><br/><p>“Ever since we were small, Ji Xiaoxiao was always trying to compete with me. That’s why I yelled out to you earlier, to get her to notice you. If my plan works, she’ll definitely take a liking to you.</p><br/><p>“Heh heh. Little bro, you have to help me turn the tables on her and screw her over royally. Of course, if you don’t want to, I won’t force you.”</p><br/><p>------</p><br/><p><em>This chapter was sponsored by XYY</em></p><br/>\n</div>"}