{"title": "Chapter 585: The Voice of Lord Li", "id": 585, "volume": 6, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-585-the-voice-of-lord-li", "volume_title": "Volume 6", "body": "<h1>Chapter 585: The Voice of Lord Li</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Three inverted Demon Mountains. One was completely formed of ice and frost, containing boundless coldness. The second was crimson red like blood, almost like an immense pile of corpses. Between those two was a mountain of molten rock, like fire, that brimmed with the most supreme dignity.</p><br/><p>The mountain that was currently trembling was none other than the Demon Mountain of molten stone.</p><br/><p>It trembled only slightly, but the incredible rumbling shook the minds and hearts of everyone within the Demon Immortal Sect. The seven Paragons, including Ke Yunhai, could not be taking the matter more seriously. All of them actually rose to their feet to look at the Demon Mountain.</p><br/><p>The rest of the disciples didn’t quite understand what was happening, but what they did know was that considering the Demon Mountain was trembling, obviously… whatever was happening inside the Demon Immortal Pagoda involved Heaven-defying good fortune.</p><br/><p>The faces of the Cultivators from South Heaven all changed dramatically. Most were filled with mad jealousy, as well as the wish that they could become Ke Jiusi.</p><br/><p>Fang Yu took a deep breath. Although she had been somewhat unsure regarding Meng Hao’s identity, now that she saw the enormous magical sign in the sky, she suddenly realized that he was indeed Ke Jiusi.</p><br/><p>“That little brat….” she thought, a smile brightening her eyes.</p><br/><p>Off on the distant mountain peak, Zhixiang was panting as she looked up at the Demon mountain of molten rock. Her eyes widened.</p><br/><p>“Withering Flame Demon Magic True Self Dao… so it’s that art. Just what sort of Heaven-defying lucky opportunity has Meng Hao come across? He’s actually acquired a Daoist magic that has a deep connection to Molten Rock Demon Mountain!”</p><br/><p>Everyone had different thoughts and reactions. The one similar thing shared by everyone was intense jealousy and frustration regarding Meng Hao.</p><br/><p>In the moment that the Molten Rock Demon Mountain trembled, a muffled voice spoke out from within it, seemingly from within a seal. Its cadence was odd, and the sound of it echoed out everywhere.</p><br/><p>“The Withering Flame Demon Magic once again appears under Heaven. We sealed the unresolved Karma, and cultivated the True Self Dao. Finally, everything will… eee?” The voice suddenly stopped talking in mid-sentence.</p><br/><p>After a long moment, a light sigh could be heard from within the Molten Rock Demon Mountain. “Night….”</p><br/><p>The sound echoed out throughout this world, causing everyone to feel shocked. Within the Demon Immortal Pagoda, Meng Hao’s eyes snapped open, and they were filled with a strange light. In his mind, the seed of the Daoist magic was solidified, and would never fade.</p><br/><p>This Daoist magic seed was separated into seven strands which were connected to his seven Nascent Souls. Although his Cultivation base had not changed, Meng Hao felt as if there were something different about it.</p><br/><p>Muttering to himself, he rose to his feet and looked down at Patriarch Reliance, who was still tucked away cautiously in his shell, looking out at Meng Hao. Meng Hao chuckled.</p><br/><p>“Old turtle Reliance, we’ll be meeting again in the future. See you later.” With a laugh, he shot up toward the descending beam of light.</p><br/><p>Just when Meng Hao was about to touch the beam of light, Patriarch Reliance stuck his head out of his shell and arrogantly shouted, “You’re the old turtle! Your whole family are all turtles! Come on! BRING IT! I’ll give you some good fortune! Since you came you … AHH!?!?”</p><br/><p>Even in the midst of his self-righteous rant, just when he thought he was able to earn some face back, before he could even finish speaking, Meng Hao, who was just about to fuse with the glowing light, stopped in place and turned to glance back at him.</p><br/><p>That glance caused Patriarch Reliance to start shaking all over. A whizzing sound could be heard as he retracted his neck and head at top speed.</p><br/><p>“You damned, perverted cheater!” he grumbled within his shell. “Get outta here…! One of these days, I’m gonna grow up, and then, I’ll get my revenge!”</p><br/><p>Meng Hao looked thoughtfully at the several thousand meter wide turtle Reliance, and his eyes lit up.</p><br/><p>“The previous generations of Demon Sealers captured this unreliable old turtle to be my Dao Protector. That basically means that they prepared a mount for me. However, after all these years, I still haven’t gotten a real mount….</p><br/><p>“I wonder what it would feel like to have an old turtle as a mount?” Having reached this point in his train of thoughts, he suddenly began to palpitate with eagerness. After all, he knew that once he got back to the lands of South Heaven, it would be impossible to further punish the old turtle.</p><br/><p>With that, Meng Hao moved out from within the light and shot back down to stand on Patriarch Reliance’s back. The instant that happened, Patriarch Reliance quivered. Inwardly, he was filled with intense regret, and was scared witless. He had no idea what Meng Hao was planning to do.</p><br/><p>“Alright, spit it out,” said Meng Hao with a smile. “Do you admit it or not? You’re my turtle!”</p><br/><p>Patriarch Reliance remained in his shell, gnashing his teeth. After a long moment of thought, he suddenly realized that this Meng Hao had suddenly begun to emit an enormous and terrifying aura. It was obvious that he had produced another vast quantity of talismans.</p><br/><p>On the verge of going mad, Patriarch Reliance, feeling even more in the wrong, shouted, “I admit it! I admit it, alright? You big bully! I’m… I’m just a tiny little turtle, that’s all! You’ll, you’ll, you’ll… you’ll get what’s coming to you!”</p><br/><p>“As long as you admit it, then I’m happy,” said Meng Hao, finding a comfortable position and sitting down. He still held all of the talismans in his hand. “Now, let’s go. Take me out of the 70th level!”</p><br/><p>Patriarch Reliance stood stock still, stunned. No matter what he had imagined, he could never have predicted that Meng Hao would make such a demand. Even as he stood there stupefied, Meng Hao tossed out the talismans.</p><br/><p>When they landed on Patriarch Reliance, a huge booming echoed out. Divine abilities and magical techniques shook everything. The sky above was rent, and Patriarch Reliance let out a miserable shriek and instantly began to move at top speed.</p><br/><p>“Yeahhhh, that’s the right attitude,” laughed Meng Hao. “Come, come. Fly up into the air!” He held talismans in his hand like a whip. Beneath him, the turtle was like a little pony, completely under his control. Patriarch Reliance was on the verge of tears as he carried Meng Hao up toward the bright light.</p><br/><p>He felt intense regret. He regretted his own courting of death. Just when his opponent had been about to leave, he had to shout out those last few words. The result… was that the damned, inhuman creature had returned for him.</p><br/><p>Filled with a feeling of maltreatment, Patriarch Reliance let out a venting roar as they fused into the light. In the blink of an eye, both of them vanished.</p><br/><p>When they reappeared, they were in the 71st level.</p><br/><p>On the outside world, everyone, including Ke Yunhai and even Zhixiang, stared, dumbfounded at the 71st level.</p><br/><p>In addition to the glowing dot which represented Meng Hao, they could also see an additional, massive glow that looked like… the outline of a turtle.</p><br/><p>Soon, it became apparent that Meng Hao was riding the turtle.</p><br/><p>The Demon Immortal Sect disciples seemed to be on the verge of going insane.</p><br/><p>“How could there be a turtle in there?”</p><br/><p>“That turtle is huge! It must be several thousand meters wide! Dammit! DAMMIT! Ke Jiusi has gone way overboard. He’s a cheater? Fine. He has an incredible dad? Okay. But, but, but… but how could he cheat even more WITHIN his cheating!?!?”</p><br/><p>“What exactly does he think he’s going to accomplish with such a gigantic turtle?!?!”</p><br/><p>Even more in a frenzy were the Cultivators from South Heaven. Their organs almost seemed to be on the verge of exploding out of their bodies, and their expressions filled with intense envy and jealousy. The jealousy even turned into hatred, filling them with very complex feelings.</p><br/><p>“Patriarch Crow Divinity sure lives up to his reputation….” thought Zhao Fang with a bitter smile. He looked at the 71st level and sighed.</p><br/><p>Wang Lihai’s hands were clenched tightly into fists, and his eyes brimmed with frustration and, even more so, helplessness.</p><br/><p>Han Bei could only blink, completely at a loss for words regarding Meng Hao. His current actions overlapped with the deep impression he had left on her years ago; it suddenly gave her the intense premonition that, in the future, he would have limitless possibilities.</p><br/><p>“Relying on his status and the power of his Clan? Could he piss me off any more?” said the young man from the Imperial Bloodline clan of the Northern Reaches. “Even more brazen, he is riding such an enormous turtle as a mount! That’s only because the identity he got has a great dad! Dammit!” Usually, it was other people in the Northern Reaches who had such thoughts about him. This was the first time in his life that he had ever felt jealous of another person.</p><br/><p>However, at the moment, he had no choice but to admit that he felt intense jealousy toward Meng Hao, and even felt as if what was happening was unfair.</p><br/><p>Ke Yunhai cleared his throat and looked at the other six Paragons. He made no attempt to explain, and was in fact also somewhat puzzled. At the same time, though, he was quite happy.</p><br/><p>Even as everyone watched on with complicated emotions, Meng Hao and the giant turtle were surrounded by the glow of magical items. They rose up from the 71st level to the 72nd. Then the 73rd, and the 74th….</p><br/><p>When they reached the 80th level, all of the disciples in the Demon Immortal Sect, including the Cultivators from South Heaven, felt their hearts tightening. What they were thinking about wasn’t whether or not Meng Hao would be able to pass this level. Instead, they were wondering about what good fortune he would seize as he did.</p><br/><p>To watch with their own eyes as someone seized all of the good fortune that they had dreamed about for their entire lives was truly driving them mad.</p><br/><p>If Meng Hao were doing by means of his own skill, then it would be one thing. In that case, at least they could console themselves in some way. But instead, he relied on his identity, and cheating, to the extent that they almost coughed up blood.</p><br/><p>“I refuse to accept this!” said one of the Ji Clan members through gritted teeth, his hands clenched tightly at his sides.</p><br/><p>Similar reactions could be seen in both the Ji and Fang Clans, with the exception of Fang Yu. The sizable group of Cultivators from other areas in the Eastern Lands were the same. In the end, it didn’t matter what they were thinking, though. They could do nothing to prevent the blinding glow they currently saw on the 80th level.</p><br/><p>Inundated by that glow of magical items, the 80th level seemed to be on the verge of collapse. Everyone could just barely make out the image of the turtle charging around violently. A moment later, a boundless glow shone out from the 80th level, along with an incredible roaring sound. An ancient, undulating voice began to speak, its cadence odd, its pace neither quick nor slow.</p><br/><p>“Since you have passed the 80th level of the Demon Immortal Pagoda, you shall be bestowed with one of the top 10 Daoist magics… Nine Heavens Destruction.”</p><br/><p>This voice caused everyone to stare blankly, not because of the ancientness of the voice, but rather, because of the voice’s manner of speaking.</p><br/><p>Zhixiang’s eyes went wide, and she began to pant, a look of disbelief written on her face.</p><br/><p>“That’s….”</p><br/><p>The seven Paragons, including Ke Yunhai, all stood up. Their expressions all changed, even more so than they had when the previous Demon Mountain had been shaken.</p><br/><p>The suns around them trembled and distorted. Clearly, they had been thoroughly shaken by the appearance of this voice.</p><br/><p>“That’s….”</p><br/><p>“That’s the voice of Lord Li!!”</p><br/><p>-----</p><br/><p><em>This chapter was sponsored by Harrison Terry</em></p><br/>\n</div>"}