{"title": "Chapter 589: An Ancient Tale", "id": 589, "volume": 6, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-589-an-ancient-tale", "volume_title": "Volume 6", "body": "<h1>Chapter 589: An Ancient Tale</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 589: An Ancient Tale</strong></p><br/><p>Although inwardly his mind was racing, his expression didn’t show any trace of that. He simply looked at Zhixiang with an enigmatic smile.</p><br/><p>She blinked. Considering Meng Hao’s expression, it was impossible to determine what he was thinking, and she could only inwardly curse his craftiness.</p><br/><p>“Fine, if you don’t want to tell me then just forget about it,” she continued with a laugh. “Let’s change the subject. The two of us had an agreement, and you owe me some help.” A shrewd look appeared on her beautiful face.</p><br/><p>“Actually,” replied Meng Hao with a casual laugh, “the truth of the matter is that we don’t have any formal agreement with each other. However, considering how you’ve helped me out throughout the years, I don’t mind returning the favor. I can help you out a little, but regarding anything too complicated, my hands are tied.”</p><br/><p>“Don’t be in such a hurry to refuse,” Zhixiang said carefully. “If you help me, you’ll also benefit. Considering your personality, I know that you’ll require a thorough explanation before you make your decision.” Meng Hao did nothing to prevent her from continuing.</p><br/><p>“Let me tell you the current facts of the matter. Afterward, you can make you own determination about whether or not to help me. Either way is fine with me.” A sudden breeze caused Zhixiang’s hair to suddenly spread across her face, making her look indescribably seductive.</p><br/><p>Meng Hao’s expression was the same as ever. He didn’t speak, but instead waited to hear what she had to say.</p><br/><p>“We first encountered each other in the Bridge of Immortal Treading. I assume you’re already aware that the bridge was created by one of the three Demon Emperors of the Demon Immortal Sect!</p><br/><p>“Those three Greater Demons were the Frost Soil Demon Emperor, the Withering Flame Demon Emperor and the Blood Coral Demon Emperor. All you have to do is look up and you can see the dwelling places of those three Greater Demons here within this illusory ancient world.” In accompaniment with her shocking words, she pointed up into the sky.</p><br/><p>Meng Hao’s mind reeled. He had never expected Zhixiang to reveal such shocking matters. He looked up at the three inverted Demon Mountains up above. The first time he had caught sight of the Demon Mountains, he had had his own speculations. Now that he heard Zhixiang’s explanation, he could combine it with what he already knew to be relatively certain that she was not lying!</p><br/><p>Of the three Greater Demons of the Demon Immortal Sect, the one who created the Bridge of Immortal Treading was none other than Frost Soil Demon Emperor Han Shan!</p><br/><p>Meng Hao’s pupils constricted. He looked up at the distant mountain of frost, and got the feeling of some type of separation, as if it had sealed itself away from the world.</p><br/><p>“A long time ago in the Ninth Mountain and Sea, the Demon Immortal Sect was the number one great Sect. That was because it had Lord Li, who was in fact the person who founded the entire Sect!</p><br/><p>“He was the Lord of the Ninth Mountain before the Ji Clan…. Among Lord Li’s subordinates were two great generals who supported the Heavens, and three Greater Demons to act as Dharma Protectors! Of course, one of those generals was none other than the later Lord Ji.” Zhixiang spoke all of these words calmly, but they caused Meng Hao’s mind and heart to tremble.</p><br/><p>He kept his expression solemn as he looked back from the three Greater Demon Mountains up above. As he returned his gaze to Zhixiang, he realized that he was suddenly much more curious regarding her goals and motives here in the Demon Immortal Sect.</p><br/><p>“I am a disciple of the Demon Immortal Sect,” she went on. “So, I know quite a bit about all these matters. The Demon Immortal Sect has a total of four Heavens. The First Heaven is comprised of the Seven Peaks. The Second Heaven is comprised of the three Greater Demon Mountains. The Third Heaven is made up of two Holy Lands…. As for the Fourth Heaven, that is where… Lord Li is!</p><br/><p>“That is the Demon Immortal Sect, which was once… the number one Sect in the Ninth Mountain and Sea!” By this point, Zhixiang’s eyes shone with a strange light that seemed to contain pride and dignity.</p><br/><p>“Assumably, you have already made some speculations about the two so-called two Holy Lands. They are actually the lands of the two great generals, and their Clans. Because of their extraordinary service, Lord Li eventually bequeathed their lands with the word ‘Holy.’</p><br/><p>“Therefore… those two lands are two great Holy Lands of the Ninth Mountain and Sea!</p><br/><p>“As for the names of these two great Holy Lands, one is Fang, and the other… is a name that cannot be spoken out in the world without incurring great calamity. As of now, we can only say Ji!” As Zhixiang’s words filtered into Meng Hao’s ears, his mind filled with a roaring sound. At long last he understood this most ancient of stories!</p><br/><p>He had long since become aware of the matter of the Ji Clan seizing the Ninth Mountain and Sea, and becoming its new Lord. However, this was his first time hearing that the other of Lord Li’s generals came from a Clan named Fang! Meng Hao’s mind was spinning.</p><br/><p>He immediately thought of Fang Yu, and of the Fang Clan in the Eastern Lands!</p><br/><p>For some reason, he had the feeling that this Fang Clan was the same Fang as the name of that great general, as well as the Holy Land. How could he ever have imagined that the Fang Clan would have such an astonishing origin! [1. The Fang character for both the Holy Land and the name of Fang Yu’s Clan is the same, ]</p><br/><p>“Considering how astonishing the two generals’ Clans were, and how shocking the three Greater Demon Emperors were, then… since they were in subservient positions to Lord Li, I can’t help but wonder just how powerful Lord Li must have been!?” All of a sudden, he recalled the words he had heard within the 80th level of the Demon Immortal Pagoda.</p><br/><p>“When Lord Li achieved his Dao, he decided to no longer monopolize the life of Heaven, but returned that life to the masses. He caused the Dao Realm to become invisible, and imposed restrictions on longevity. He sealed the path one could tread to see him, and no longer appeared in the flesh. The two Holy Lands were forced to seal themselves!</p><br/><p>“After that, the three Greater Demon Mountains were also sealed!</p><br/><p>“Later, Lord Li fell. Some people say he went missing, others say he died in battle. There are many legends. Eventually, war was waged over the two Holy Lands. That war affected all of the Ninth Mountain, and in the end… the Heavens were placed on top of Li, and the Ji Clan gained victory!</p><br/><p>“The Demon Immortal Sect was part of that war, and as a result, it was destroyed…. The Bridge of Immortal Treading was also shattered. The three Greater Demon Mountains collapsed, and the three Greater Demons perished. The Ji became the new Lord, and the Fang Clan was out.</p><br/><p>“As the Demon Immortal Sect reached its end, a handful of survivors managed to flee, sticking together to form the modern-day Demon Immortal Sect.</p><br/><p>“That war was like a foul wind and a bloody rain of carnage for the Ninth Mountain and Sea…. Obviously, I didn’t experience it, but the records within the Sect contain clear descriptions.” At this point, Zhixiang stopped speaking.</p><br/><p>Meng Hao stood there silently for a moment, breathing somewhat raggedly. Great waves surged through his heart. Based on everything he knew, it seemed to him that the things Zhixiang was telling him, although perhaps not completely accurate, were at least seventy to eighty percent true.</p><br/><p>“That is the story of the Demon Immortal Sect!” continued Zhixiang.</p><br/><p>“Within the Demon Immortal Sect, there are two great legacies. One is that which was shockingly famous throughout the Ninth Mountain and Sea, the great… Mountain and Sea Scripture. According to legend, the scripture is formed of nine manuals, any one of which gives you the right to be a Mountain and Sea Lord!</p><br/><p>“Years ago, Lord Li possessed the ninth manual!</p><br/><p>“Unfortunately, the only way to acquire the Mountain and Sea Scripture is by means of a special method prescribed by Lord Li. After he fell, the legacy dissipated. Even the current Lord Ji only possesses a smattering of knowledge of the Mountain and Sea Scripture, not the true scripture itself.</p><br/><p>“That is why among the nine Lords of the great Nine Mountains and Seas, Lord Ji is the weakest!</p><br/><p>“As for the other legacy of the Demon Immortal Sect, many restrictions were placed on it. Nowadays, it is rare to find anyone who can meet all the requirements. Although… I do meet the requirements! That is why I am here to acquire… the Demon Immortal Body!” Although she was speaking softly, by the time she reached the final three words, her eyes glowed with a strange light.</p><br/><p>Hearing all of this caused Meng Hao’s eyes to glitter.</p><br/><p>“Long ago,” continued Zhixiang slowly, “Lord Li used his own body to form a type of physique cultivation called the Demon Immortal Body. Those who possess such a body will find it much easier to practice Demon magic cultivation. In fact, one can return to a truly natural state, incarnate a spirit of a Demon, and then transform into a matchless Greater Demon!</p><br/><p>“In this manner, the Demonic Qi of the Ninth Mountain and Sea can be consumed, and good fortune can be split with the Ji Clan!</p><br/><p>“What I want to accomplish can’t be done alone. In order to get this one chance, I have the backing of the full power of everyone in the Demon Immortal Sect. Therefore, if you help, you won’t just be helping me, but rather, the entire Demon Immortal Sect.</p><br/><p>“When it becomes necessary, later on after you achieve Immortal Ascension, we can offer you shelter in the outside world. In fact, we might even recruit you to join us!”</p><br/><p>Meng Hao looked at her for a moment. “Why me?” he asked.</p><br/><p>“I don’t need much help from you here in the Second Plane. However, in the Third Plane, if you’re willing to assist, you can help me increase my chances of success significantly.</p><br/><p>“Actually, I’m not too certain of exactly what you can do. Perhaps, the fact that you have Ke Jiusi’s identity shows that you have some mysterious destiny connecting you to the Demon Immortal Sect…. Perhaps that is why the curse power in the Bridge of Immortal Treading didn’t affect you!</p><br/><p>“That curse power is nothing other than the rancor of those who died in the Demon Immortal Sect that year. They feel rancor toward Lord Li, Lord Ji, and toward everything living. Such feelings have fermented for ninety thousand years, eventually transforming into a curse.</p><br/><p>“Because of that curse, anyone who touches objects of the ancient Demon Immortal Sect at the wrong time, will disturb the dead souls and die instantly!</p><br/><p>“It is only when the Third Plane opens that good fortune can be acquired. During that time, the curse is the weakest.</p><br/><p>“Even still… there are some core areas in which the curse power will not be reduced at all, no matter what. So, I need your help… to forge a path to the place I need to go in the Third Plane!”</p><br/><p>“Third Plane?” said Meng Hao, his eyes glinting sharply.</p><br/><p>Zhixiang gave a cool laugh, apparently not fazed at all by the question. Her expression the same as ever, she replied, “The first two Planes of the ancient Demon Immortal Sect are guaranteed to open. However, the Third Plane depends on destiny or luck. To enter that Plane requires a lucky coincidence. However, all it takes is for one person to enter, and then the path will be opened to everyone who is within the Second Plane.</p><br/><p>“For example, after you barged your way through the Demon Immortal Pagoda, a ladder appeared that we could all see, stretching up into the Heavens. That is destiny, and the entrance into the Third Plane. However, that entrance is only for you. You are the only one who can use it to enter the Third Plane.</p><br/><p>“Once you enter the Third Plane, then the illusion around us will fade away. Everyone will appear along with you in the Third Plane.”</p><br/><p>Having heard this, Meng Hao chuckled, but didn’t say anything. However, Zhixiang responded with a beautiful light laugh of her own.</p><br/><p>“Don’t worry,” she said, “I don’t need your help getting into the Third Plane. The ones who need your help for that are all the other people from South Heaven. The Demon Immortal Sect has been preparing for this for a long time, and finally have uncovered a method to get me into the Third Plane on my own. Although, as soon as I enter successfully, so will all the others.”</p><br/><p>Meng Hao thought for a moment. “Not many upsides for me,” he said.</p><br/><p>Zhixiang looked at him for a moment. Actually, his words just now had caused her heart to start beating with excitement. She didn’t fear requirements being made on his part; it was only by mutual benefit could they work together smoothly.</p><br/><p>“Within the Demon Immortal Sect is the Demon Immortal Cistern. That cistern is the key to the legends. I plan to go there while in the Second Plane, in order to secure the qualification to enter it later. Only by a bit of deception can I go to the true location of the Demon Immortal Cistern in the Third Plane…. That is where I can acquire the good fortune to transform my body into the Demon Immortal Body!</p><br/><p>“If you help me, then you’ll be helping yourself. We can share the Demon Immortal Cistern. By bathing within, even if you don’t qualify to get the Demon Immortal Body, you can still experience incredible strengthening of your fleshly body!</p><br/><p>“In other words, this good fortune can be acquired by both of us!” Having made her greatest expression of good faith, she looked at Meng Hao expectantly.</p><br/><p>Meng Hao was silent for a moment as he analyzed how much he could trust everything Zhixiang had said. After a long moment, his eyes filled with determination.</p><br/><p>“I have one condition,” he said. For some reason, a somewhat bashful expression appeared on his face. People who didn’t know him very well might think it made him look very charming. However, to those who truly knew him, such an expression was enough to fill one with abhorrence….</p><br/><p>-----</p><br/><p><em>This chapter was sponsored by Paul Jones, Phillip Dao, Dehua, Nikkolas Santos, David Hoffmann, and Lucas Lopez</em></p><br/>\n</div>"}