{"title": "Chapter 593: Meeting South Heaven!", "id": 593, "volume": 6, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-593-meeting-south-heaven", "volume_title": "Volume 6", "body": "<h1>Chapter 593: Meeting South Heaven!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 593: Meeting South Heaven!</strong></p><br/><p>Meng Hao’s eyes flickered. He turned and made his way off into the distance. In the end, he picked three other similar places in the Demon Immortal Sect where he concealed Wooden Time Swords in the ground.</p><br/><p>Currently, he had a total of ten Wooden Time Swords, which he could use to unleash the first form of the Lotus Sword Formation.</p><br/><p>To bet four of the swords on a possibility that was most likely impossible was a huge gamble for him.</p><br/><p>“Each one of these Wooden Time Swords represents a vast collection of Spirit Stones….” he thought. Enduring the pain of it, he hid one sword after another. Every time he did, he buried his dreams and hopes along with it.</p><br/><p>Meng Hao selected the four locations very carefully. In fact, the four different locations were places that, according to his memories of the First Plane, were still relatively intact.</p><br/><p>That way, just in case the swords really did appear in the Third Plane… then they would be easy for him to recover.</p><br/><p>As night fell, Meng Hao hovered in mid-air, looking out across the lands. He glanced at the four places where he had buried the swords, and the anticipation in his eyes grew stronger.</p><br/><p>“If I succeed, then my path of cultivation can continue even more smoothly. If I don’t succeed… then at least I will have no regrets.” He made one more final look to ensure that he had committed the various locations to memory. Then, he made his way to the Fourth Peak.</p><br/><p>More time passed by. Another half month was gone. The ghost images continued to occur with increasing frequency. The interval between the occurrences was shorter, and every time they occurred, they lasted for several breaths of time.</p><br/><p>In fact, on one occasion a few days ago, Meng Hao had been concocting pills when the ghost images sprang for a few dozen breaths of time. During that time, he almost had the feeling that he had left the illusory ancient world.</p><br/><p>He hadn’t seen Ke Yunhai recently. Even when he went to pay his respects and wish Ke Yunhai good health, it was only through the closed door of the Immortal’s cave. When Ke Yunhai spoke to him from inside, his voice seemed somewhat tired.</p><br/><p>He wasn’t sure what Ke Yunhai was doing, but whenever he heard the man’s voice, he felt calmer. Ke Yunhai was his father in this life, and as far as Meng Hao was concerned, the most valuable thing he had acquired in this illusory world.</p><br/><p>Xu Qing still had not finished with her secluded meditation. However, she had clearly experienced success in her enlightenment. Every time Meng Hao looked at her, she was experiencing different transformations of the soul.</p><br/><p>She seemed completely immersed in Daoist magic. Although she was not consummately beautiful, there was now a vague air to her that was both unforgettable and fascinating.</p><br/><p>“It should be any moment now,” murmured Meng Hao as he sat there cross-legged in the Immortal’s cave. “The ghost images are growing more intense and more frequent. Everybody must be getting very antsy by now.” He looked out at the evening sky and the dark clouds that were gathering up above.</p><br/><p>Recently, he had not of his own initiative sought out any of the other South Heaven Cultivators. He had kept to himself, trying to concoct his medicinal pill from nothing, or achieve enlightenment of the Daoist magics.</p><br/><p>Of course, all of the Cultivators from South Heaven were extraordinary individuals. Each one had inside information from their various Sects or Clans, as well as methods to evade Meng Hao. He was well aware of that. He could either mobilize the entire Sect to try to find them, or just not look for them at all. He preferred the latter.</p><br/><p>Meng Hao was confident that they… would come looking for him.</p><br/><p>When they did, it would be the whole group, except perhaps for Patriarch Huyan, who Meng Hao would kill at first sight.</p><br/><p>Sheets of rain began to descend onto the Demon Immortal Sect. The entire world turned hazy, and as Meng Hao looked out at it, he had a strange feeling. He wasn’t sure if the world he was in was hazy, or if the rain was hazy… or if it was both.</p><br/><p>It was much like how he viewed the future.</p><br/><p>The rain fell until the third night watch before it started to lighten up. The land was covered with coldness that transformed into fog. When the sun rose, the fog slowly began to grow thin and then dissipate, transforming the haziness into clarity. Everything looked like a beautiful oil painting.</p><br/><p>At dawn, a sword came!</p><br/><p>It was impossible to say where the sword came from, but it shot directly toward Meng Hao. None of the protective spell formations on the Fourth Mountain did anything to stop it; apparently there was something special about this sword.</p><br/><p>The sword came to a stop a meter or two in front of Meng Hao, where it hovered in the air. A mottled glow emanated up from its surface. Just barely discernible on the sword were the traces of a mark made by a soul.</p><br/><p>It was one character.</p><br/><p>Fang.</p><br/><p>Meng Hao smiled. The people he had been waiting for were finally showing their faces.</p><br/><p>He made a grasping motion with his right hand, causing the sword to fall into his hand. He sent out his Divine Sense to sweep it over, and immediately, a message transmitted into his mind.</p><br/><p>After hearing the message, his smile grew even wider. After a long moment, he closed his eyes.</p><br/><p>Noon passed, and evening was approaching by the time he opened his eyes again. His body flickered, transforming into a beam of light that shot past the First Peak and out of the mountainous region toward an area near the main part of the Sect where the Outer Sect disciples resided.</p><br/><p>When Meng Hao finally arrived, no one was out and about. Everything was quiet as he headed toward a set of three connected residence buildings. As he neared a location between the second and third residence buildings, he waved his hand, causing a door to open up. Without hesitation, he entered.</p><br/><p>Instantly, dozens of gazes fell upon him.</p><br/><p>The residence was large and filled with dozens of waiting people. As Meng Hao looked around, he could see that they were separated into various groups.</p><br/><p>Even within those groups, there were various subdivisions based on whichever area the people were from. After all, even though some of them might wish to kill others, they knew that they had to look at the bigger picture, and the trouble that it would cause if something like that happened.</p><br/><p>The largest group of all, shockingly, was the Ji Clan. They had seven people, all of whom were Inner Sect disciples. Their eyes shone brightly, and although they didn’t speak, they made no effort conceal their extraordinary demeanors, nor their arrogance and pride.</p><br/><p>Of the group of seven, three were women and four were men. There were two among them who were the most conspicuous. One was Ji Xiaoxiao, the other was a young man who had the glittering mark of a trident on his forehead. He emanated a sense of danger, and reminded Meng Hao a lot of the Ji Clan member he had killed most recently, Ji Mingfeng.</p><br/><p>This young man was none other than Ji Clan Array member, Ji Mingkong!</p><br/><p>However, of the seven Ji Clan members, the one that drew Meng Hao’s attention the most was neither Ji Xiaoxiao nor Ji Mingkong. Instead, it was an ordinary looking youth of short stature who stood behind them, smiling.</p><br/><p>The youth seemed ordinary, but after looking at the seven Ji Clan members, that youth was the only one who caused him to feel a sense of danger.</p><br/><p>It was merely a sense of danger, though. Meng Hao could not detect any bone-deep hatred from any of them, the type that said they wouldn’t rest until he was dead. Apparently, they did not have any idea at all that Meng Hao was connected to the death of Ji Mingfeng.</p><br/><p>He glanced at Ji Xiaoxiao. She looked back at him silently.</p><br/><p>In addition to the seven members of the Ji Clan, there was also the Fang Clan. Fang Yu looked at Meng Hao with a slight, enigmatic smile. Behind her were two men whose eyes glistened with displeasure as they coldly measured up Meng Hao.</p><br/><p>Meng Hao recalled what Fang Yu had told him about three members of the Fang Clan coming to the Demon Immortal Sect. Obviously, these were the other two from the Fang Clan.</p><br/><p>What was most intriguing to Meng Hao was that, although the right hands of these two men seemed ordinary, he could tell that they were not. He was familiar with the usage of the diaphanous Fang Clan glove. A single glance and he could tell that they were wearing just such gloves.</p><br/><p>In addition to the Ji and Fang Clans, there were four or five others from the Eastern Lands. Most of them were grouped near the Ji or Fang Clans, but were eclipsed by those blazing suns of that part of the world. They didn’t look very extraordinary at all in comparison.</p><br/><p>However, their Cultivation bases were clearly beyond ordinary. As Meng Hao looked them over, his gaze came to rest on a tall, slender man who stood next to Fang Yu. He was smiling, but within the gentleness of his look was a viciousness buried deep down. Inside, he was obviously an ambitious and ruthless person.</p><br/><p>As for who he was, Meng Hao wasn’t quite sure. However, considering where he was standing, he could formulate some guesses.</p><br/><p>“Don’t tell me this guy is chasing after the explosive dragon?” he thought. He suddenly felt a bit of admiration for the man’s bravery.</p><br/><p>In another direction were the people from the Northern Reaches. From what Meng Hao understood, the Northern Reaches was a savage and uncivilized region. In some ways, it might be better than the Western Desert, but it was vastly different from the Southern Domain or Eastern Lands.</p><br/><p>Actually, Meng Hao knew that the so-called Northern Reaches were actually a land of exile. The Cultivators there were mostly people that other locations couldn’t tolerate, who eventually sought their fortune in the Northern Reaches.</p><br/><p>Of course, what the Northern Reaches proclaimed to have was freedom. Complete and ultimate freedom.</p><br/><p>Most of the Sects there were rebel Sects from other areas. The Clans were usually formed from scattered remnants of other Clans. One example was the so-called Imperial Bloodline Clan.</p><br/><p>According to rumor, that clan had previously given rise to several Immortals. Because of that, descendants had a strong foundation and were able to expand and grow. Eventually the group split. One half perished and the other half traveled to the Northern Reaches where they became this new Clan.</p><br/><p>There were a total of eight Cultivators from the Northern Reaches. All of them looked very bizarre, and none of them grouped together. Each one remained isolated.</p><br/><p>The tyrannical and haughty air that they emanated was readily apparent. Of the eight of them, three were women and five were men. Each one seemed like a viper, cold and grim. There was one of them, a young man, who stuck out more than the others. He had the eyes of a phoenix, and beautiful features. He appeared to be smiling, but it was a cold smile that made one feel as if a frigid wind was blowing through you.</p><br/><p>This was none other than the member of the Imperial Bloodline Clan.</p><br/><p>There was another young man who had a strange birthmark that almost didn’t appear to be a part of his body at all. It seemed to be slowly wriggling across his face, a shocking image that would make anyone who glanced at it look twice.</p><br/><p>Next to that group were the people from the Southern Domain.</p><br/><p>As he laid eyes upon them, Meng Hao’s eyes softened a bit. The Southern Domain… was his home. Most accurately speaking, he was someone from the Southern Domain.</p><br/><p>There were a total of seven people from the Southern Domain. From the way they were organized, Meng Hao could quickly see which alliances now existed between various Sects and Clans.</p><br/><p>Wang Lihai and Han Bei were together, which meant that the Wang Clan and the Black Sieve Sect were in cooperation.</p><br/><p>Song Yunshu was nowhere to be seen. If Meng Hao’s guesses were correct, Song Yunshu had most likely met his fate at the hands of Ji Xiaoxiao. She surely had killed him to remove him as a witness.</p><br/><p>Eventually, Meng Hao’s gaze came to fall on one of the women from the Southern Domain. Although her physical features were unfamiliar, as soon as their eyes met, Meng Hao gaped.</p><br/><p>“It’s her….”</p><br/><p>-----</p><br/><p><em>This chapter was sponsored by Espen Leonhardsen, Nisan Gurung, Hioe Budiman, Chi Yip, and R Groenier</em></p><br/>\n</div>"}