{"title": "Chapter 600: True SpiritNight!", "id": 600, "volume": 6, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-600-true-spiritnight", "volume_title": "Volume 6", "body": "<h1>Chapter 600: True SpiritNight!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 600: True Spirit——Night!</strong></p><br/><p>As Liu Zichuan fled off into the distance, he heard what Meng Hao said. If Meng Hao hadn’t made a move against him just now, he surely would have laughed coldly with disdain. Right now, though, he could unquestionably sense Meng Hao’s killing intent deep in his bones.</p><br/><p>It didn’t matter what type of identity he had, if Meng Hao said he was going to kill someone, he would kill them!</p><br/><p>The words Meng Hao had spoken just now were filled with the intent to slaughter, and left Liu Zichuan’s mind trembling. All of a sudden, he regretted trying to feel out Meng Hao.</p><br/><p>“Dammit,” he thought, suddenly depressed. “It’s not like I’m the only person he made an agreement with. Everyone did! Why did I have to pick him to test out?” He did not dare to do anything to cause Meng Hao to question him. Here in the Demon Immortal Sect, if he dared to disrespect Meng Hao, he would be dead for sure.</p><br/><p>“What if I could form an alliance with him…?” thought Liu Zichuan. His eyes glittered for a moment, but then grew dark. He suddenly realized, based on the short battle just now… there was no way for him to know Meng Hao’s true strength.</p><br/><p>He knew that Meng Hao was unfathomable, and had not unleashed his full potential. As for how much of it he had revealed, it was impossible to guess.</p><br/><p>“The smartest thing to do is never provoke someone like him.”</p><br/><p>As Liu Zichuan fled into the distance, Meng Hao retracted his gaze and left the Third Anima, returning to the First. He closed his eyes for a moment, then opened them; they shone with the brilliant glow of a powerful expert.</p><br/><p>“It’s difficult to judge how weak or powerful I am exactly. However, if I could achieve the fleshly body strength of the Seventh Anima while only in the First Anima, then when I entered the Seventh Anima, I would definitely have a Spirit Severing fleshly body!</p><br/><p>“That would be a complete and thorough Spirit Severing fleshly body, compatible with my Cultivation base…. I could definitely slaughter someone of the First Severing!” His eyes flickered and he took a deep breath. With that, he continued to fly on toward the graveyard.</p><br/><p>It didn’t take much time before he arrived at a large stretch of ruins. This was the graveyard. There were corpses laying about everywhere, and the tombs of many of the past experts had been transformed into nothing but pits.</p><br/><p>Funerary objects had long since been disturbed and taken away. There were few restrictive spells here now.</p><br/><p>As Meng Hao looked around, his heart throbbed with pain. He continued on forward until he caught sight of a familiar location up ahead. The glow of a restrictive spell could be seen glittering, and Meng Hao’s heart calmed down a bit.</p><br/><p>It was the tomb of Ke Yunhai!</p><br/><p>The tomb of a paragon. Inside was no corpse, only a small bronze lamp, long since extinguished.</p><br/><p>Outside of the tomb were layer after layer of restrictive spells. They filled the entire area with flickering light, and would prevent any outsider from entering.</p><br/><p>Meng Hao landed just outside the restrictive spells and looked at Ke Yunhai’s tomb silently. An indeterminable amount of time passed. Tears rolled down his face.</p><br/><p>After a long time, he kneeled down and gently knocked his head against the ground three times as he kowtowed to Ke Yunhai’s tomb.</p><br/><p>Then he looked up and murmured, “Thank you, sir. You’re not really my father, but in that ancient illusion, you allowed me to feel the love of a father. You allowed me to be your son during that life.” Finally, he stood up and turned around. He no longer felt melancholy, but rather, his face glowed with the unswerving determination of a Cultivator.</p><br/><p>As of this moment, Meng Hao was now fully awakened from the dream!</p><br/><p>“Come on out,” he said lightly. “You’ve been waiting for a while now. If you don’t reveal yourself, then I’ll just leave.”</p><br/><p>As his voice echoed about, a completely ordinary area not too far off suddenly began to ripple and distort. A woman appeared. She was… incredibly beautiful, with bright eyes, and a way of moving that exuded feminine charm. It was none other than Zhixiang.</p><br/><p>“I guessed that you would come here to offer your respects to Ke Yunhai,” she said with a smile. “Waiting here saved me a bit of effort in tracking you down.”</p><br/><p>Meng Hao didn’t respond, but looked toward the area behind the Seventh Peak. Past the graveyard was the area that previously had been enveloped by boundless mists. Now, though, there was no mist to be seen whatsoever.</p><br/><p>The two enormous statues were also gone. The only thing visible was an enormous bright shield that shot up from within the ground and emanated an imperceptible glow.</p><br/><p>This was a restrictive spell that covered a massive area. It might seem ordinary, but it was powerful enough to eradicate Immortals!</p><br/><p>The area it protected was so important that the restrictive spell was fearsomely powerful even down to this day. In fact… throughout all the years in which the Primordial Demon Immortal Plane had been opened, no one had ever been able to enter the area beyond.</p><br/><p>That was a truly forbidden area! No one was allowed to enter inside. Anyone who tried to do so ended up dead.</p><br/><p>“Let’s go,” said Meng Hao coolly. As he began to move forward, Zhixiang smiled and then sped off into the air with him.</p><br/><p>As they shot forward, Zhixiang felt a bit proud of herself. Back in the Second Plane, when they traveled this same path, she had been filled with incredible excitement. Now that they were in the Third Plane, she was sure that she wasn’t the only one to be feeling excited.</p><br/><p>Thinking about this caused Zhixiang to smile. She increased her speed, passing up Meng Hao. He watched her as she passed, but didn’t say anything.</p><br/><p>The two of them proceeded on in that way, moving at top speed until they reached the glowing restrictive spell shield. This was actually the same location where the statues and the door of swords had been located previously.</p><br/><p>Zhixiang’s face was solemn. She took a deep breath as she pulled out her third class qualification command medallion from within her robe. She cautiously extended the command medallion forward until it touched the glowing shield. Suddenly, the shield in front of her began to flicker. Ripples spread out which then turned into waves that spread out across the entire restrictive spell.</p><br/><p>A droning sound could be heard, echoing out in all directions. At the same time, a faint, low-pitched voice could be heard, filled with weakness and exhaustion.</p><br/><p>“Third class qualifications. Where do you intend to go?” The rumbling voice sounded incredibly weak, and yet still awe-inspiring.</p><br/><p>“The Demon Immortal Cistern!” replied Zhixiang immediately, taking in a deep breath.</p><br/><p>“According to the regulations, you may travel thirty percent of the paths in this place, and may stay for no more than 38 hours.”</p><br/><p>The wording was exactly the same as before. Zhixiang was nearly exploding with excitement as a wide fissure appeared in the shield in front of her. She took a deep breath and then looked over at Meng Hao with a look of complacency.</p><br/><p>In accordance with his agreement with her, Meng Hao followed her into the fissure, his expression the same as ever. His expression was normal, but inwardly, he was on guard, unsure of whether the method being used by Zhixiang would actually work.</p><br/><p>As soon as she reached the fissure, Zhixiang passed through effortlessly. However, as for Meng Hao, a beam of light from the restrictive spell shot toward him. It instantly enveloped him, almost like a bubble, locking his feet in place.</p><br/><p>He was stuck inside the light, incapable of moving, but able to speak. His eyes cold, he said, “Zhixiang, what is the meaning of this!?”</p><br/><p>Zhixiang turned back suddenly, her expression one of shock and worry.</p><br/><p>“Impossible,” she said. “You left a mark inside, plus I have third-class qualifications. I should be able to take an extra person inside, especially one who left a mark. Could it be… that your mark was somehow erased?”</p><br/><p>Meng Hao’s eyes glittered. It was at this exact moment that the weak voice suddenly could be heard again.</p><br/><p>“Paragon’s qualifications. You may go anywhere you wish, and stay inside indefinitely.”</p><br/><p>As soon as the voice could be heard, the bubble popped. His body returned to normal, and he walked forward through the restrictive spell as easily as if he were walking down a level path.</p><br/><p>Zhixiang stared, her eyes wide with disbelief. She took a few steps back and looked blankly at Meng Hao.</p><br/><p>“This is impossible! We’re in reality now, not the ancient illusion. In the ancient illusion, you had the identity of Ke Jiusi, but here in the Third Plane, you’re you! How could you be a Paragon?!”</p><br/><p>Meng Hao’s expression was the same as ever, but inside, he was filled with great waves of shock and confusion. It was exactly as Zhixiang said, and yet, what had happened just now really had happened!</p><br/><p>He was silent for a moment before slowly saying, “We were able to leave marks here. Apparently, leaving vestiges of an identity isn’t that hard either. It’s just something special that you can do in the Second Plane, right?”</p><br/><p>“But this is different,” said Zhixiang, her eyes wide. “The ancient illusion is Night…. It’s… it’s illusory. The marks are like memories. Hmm….” Suddenly she gasped and looked at Meng Hao with a complicated expression. “I understand. It’s Night! Night remembers you!”</p><br/><p>“Night?” asked Meng Hao, his eyes glittering. He had long since come to the conclusion that Zhixiang knew a lot more about the Demon Immortal Sect than what she had told him.</p><br/><p>For example, Night.</p><br/><p>Meng Hao thought back to when he had first entered the Second Plane. He had heard someone on one of the mountain peaks giving a sermon about the Dao. He had mentioned a true spirit whose name was Night! [1. The sermon which mentioned Night happened in chapter 567. Don't forget that Night apparently spoke during that same chapter!]</p><br/><p>“It’s not that I was trying to hide something from you,” she said. “According to Sect rules, we aren’t allowed to divulge such information to outsiders. However, since Night remembers you, then it doesn’t really matter if I tell you. In Heaven and Earth, there are true spirits. As to how many exactly there are, I’m not sure.</p><br/><p>“I only know that they are very, very uncommon. In fact, there are only ten or less!</p><br/><p>“True spirits are completely unique in all Heaven and Earth!</p><br/><p>“There is one whose name is Night. According to the legends, when it closes it eyes, the world is a dream. When it opens its eyes, the dream is shattered, and everything returns to the void.</p><br/><p>“There is some destiny that exists between it and the Demon Immortal Sect. Therefore, it took up residence within the Sect, and became its true Demon guardian.</p><br/><p>Meng Hao was shaken inwardly. After a moment’s hesitation, he asked, “Where is it…?”</p><br/><p>“It is beneath our feet, within the lands of the First Heaven. As for what it looks like, I don’t know. All I know is that according to the stories that have been passed down from ancient times, true spirits are inauspicious. Some people have even said that the reason the Demon Immortal Sect fell was because of it. When the Sect was destroyed, no one could kill it, not even Lord Ji. Although, even if he had the power to do it, killing a true spirit is an extreme taboo.</p><br/><p>“Therefore, Night has been in the Demon Immortal Sect all this time. Occasionally, it will reminisce, and that is the origin of the ancient illusion of the Second Plane….”</p><br/><p>Great waves of shock roared through Meng Hao. He began to breathe heavily as he looked at Zhixiang.</p><br/><p>“You’re telling me that the ancient illusion we experienced was simply Night’s dream?”</p><br/>\n</div>"}