{"title": "Chapter 611: Fellow Daoists, Allow Me to Say Something", "id": 611, "volume": 7, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-611-fellow-daoists-allow-me-to-say-something", "volume_title": "Volume 7", "body": "<h1>Chapter 611: Fellow Daoists, Allow Me to Say Something</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 611: Fellow Daoists, Allow Me to Say Something</strong></p><br/><p>Meng Hao’s eyes gleamed and he turned. With a smile, he clasped hands and bowed to the three incoming members of the Fang Clan. “Well, if it isn’t the three Fellow Daoists from the Fang Clan. It seems these two Brothers can’t quite cover up the joy in their faces. They definitely must have acquired quite a bit in the Third Plane….”</p><br/><p>Fang Yu’s face was a bit unsightly as she stared angrily at Meng Hao. The way he looked right now caused her fury to flare up.</p><br/><p>“No, we didn’t!” she said, glaring at him.</p><br/><p>“Oh, that’s not good,” replied Meng Hao with a wink.</p><br/><p>“It doesn’t even count as not good!” said Fang Yu, clenching her teeth, an uncompromising expression appearing on her face. “Look at you, you acquired all kinds of things, but big sis put everything on the line and only got two items! You still want to take advantage of me?”</p><br/><p>“Okay, how about this….” said Meng Hao, looking a bit embarrassed. However, before he could finish speaking, one of the two men from the Fang Clan who stood behind Fang Yu suddenly let out a cold laugh.</p><br/><p>“We try to give you face, but you insist on acting shamelessly, huh? You think this is still the Second Plane? Screw off posthaste, you little bastard! Otherwise, you won’t be leaving the Third Plane alive!”</p><br/><p>The other Fang Clan member stepped forward, an expression of scorn and disdain on his face as he said, “You really don’t know your own limitations. Don’t you know that even the Ji Clan would think twice before trying to steal away the things acquired here by the Fang Clan? As for you… well, take out half of everything on your person and hand it over. Otherwise….”</p><br/><p>As the two men spoke, Meng Hao’s gaze came to be fixed upon them.</p><br/><p>However, before he could even get angry, Fang Yu’s face filled with fury. She spun to face the two fellow Clan members.</p><br/><p>“You want him to screw off?” she said. Clenching her teeth, she vanished, to reappear directly next to one of the Fang Clan members. Suddenly, her fist descended.</p><br/><p>Before the Fang Clan member could even say anything, a boom could be heard, and he tumbled backward, blood spraying from his mouth as he looked at Fang Yu in astonishment.</p><br/><p>“Fang Yu, what are you doing!?!?”</p><br/><p>“Shameless you say!?” she cried, fires of rage burning in her eyes. As of this moment, she truly looked like an explosive dragon. Her body flickered as she neared the man again. He was shaking, and was about to fight back when another boom echoed out and he was sent flying.</p><br/><p>“You dare to threaten him!? You say he won’t leave the Third Plane alive?! Well then… I’ll make sure YOU don’t leave the Third Plane alive!” Killing intent flickered in Fang Yu’s eyes. Before the Fang Clan member even landed on the ground, she once again vanished to reappear directly next to him. Her fist smashed out again. This was no perfunctory blow, but rather, contained all of her explosive power.</p><br/><p>A boom could be heard that rattled Heaven and Earth. Everyone watched on in shock as the blood sprayed from the mouth of the Fang Clan member, and then his entire body exploded into bloody pieces. His Nascent Soul emerged, fleeing and screaming at the same time.</p><br/><p>“Fang Yu, you dare to slaughter a fellow Clan member!? You’re dead! You actually dare to kill me over an outsider!?!?”</p><br/><p>“So what if I kill you?” said Fang Yu with a cold snort. She performed an incantation gesture, then waved her right hand. Instantly, an enormous square cauldron magically appeared. It instantly shot toward the fleeing Nascent Soul of the Fang Clan Cultivator. When they slammed together, a miserable shriek could be heard, and the Nascent Soul shattered.</p><br/><p>At the same time, the man’s bag of holding flew out to be snatched by Fang Yu. She quickly erased the brand mark on it, and then tossed it over to Meng Hao.</p><br/><p>The scene which had just played out in front of everyone left them completely shaken. That was especially true of the Ji Clan, whose eyes were wide and filled with disbelief. Killing a fellow Clan member was a high crime in any Clan!</p><br/><p>They truly couldn’t understand why Fang Yu would respond so viciously to the handful of words that had just been spoken.</p><br/><p>Fang Yu turned and looked at the other Fang Clan member.</p><br/><p>The man trembled and took a few steps back. His heart pounded with nervousness and vigilance as he quickly said, “Elder Sister Fang Yu, this was all just a misunderstanding. I….”</p><br/><p>“You said he doesn’t know his own limitations?” she said, her eyes flickering with killing intent. The Fang Clan Cultivator’s scalp was numb as he fell back nervously. Before he could get more than a few steps, Fang Yu was upon him, and her fist descended.</p><br/><p>A boom could be heard; blood sprayed from the man’s mouth as he fell back.</p><br/><p>“Elder Sister Fang Yu, I was in the wrong. Really, it was my mistake!!”</p><br/><p>“Didn’t you tell him to take out half of his belongings and hand them over?” she said coldly. She performed an incantation with her right hand, causing the illusory square cauldron to fly toward the man. Under the incredible pressure, the Fang Clan Cultivator’s face fell. Even as he shot backward, he pulled out his bag of holding and threw it to Meng Hao.</p><br/><p>“Elder Brother Meng, allow me to atone for my crime. Junior Brother admits his mistake!!”</p><br/><p>Meng Hao grabbed the bag of holding with a frown. It was impossible to tell exactly what he was thinking.</p><br/><p>“You’re clever,” said Fang Yu. “Therefore, you can avoid the death penalty. But that doesn’t mean you’re… exempt from punishment!” She glared at the Fang Clan Cultivator as the square cauldron descended. A boom could be heard as blood poured from the man’s mouth. He staggered backward, his face pale. Although he didn’t fear for his life now, he was still scared witless. He immediately clasped hands and bowed to Fang Yu.</p><br/><p>Meng Hao gathered up the two bags of holding, then looked over at Fang Yu. She looked back at him.</p><br/><p>“What was that for?” he asked.</p><br/><p>“None of your concern,” replied Fang Yu. With a frown, she gritted her teeth and continued, “In any case, my things are mine, and I’m not going to give them to you. There’s no use in even thinking about it. It’s not gonna happen!”</p><br/><p>Meng Hao looked at her deeply for a moment, but didn’t speak again about the matter. Everyone around were lost in various thoughts, and didn’t speak.</p><br/><p>It was in this moment that the deep pit they stood next to suddenly emitted a shocking rumbling sound. It almost sounded as if something deep inside was roaring. The ground shook, and the countless vine-like objects that surrounded the area began to twitch and writhe in bizarre fashion.</p><br/><p>The vines grew thicker and longer as they surrounded the area, looking almost like snakes. The Demonic Qi from the surrounding area surged in toward the pit, transforming into an enormous pillar of light that towered up into the sky.</p><br/><p>As of this moment, the enormous pillar of light was visible from any position within the First Heaven of the Demon Immortal Sect. It was like a summons that echoed out in the hearts and minds of all the South Heaven Cultivators.</p><br/><p>A message resounded out to everyone. It clearly told them… that the way to the Fourth Plane was now open!</p><br/><p>The possibility now existed to enter the Fourth Plane!</p><br/><p>Meng Hao’s mind trembled, and the Cultivators around him began to pant. Their eyes flickered, and yet, no one wanted to be the first one to make an attempt. Everyone stood watching, not willing to act rashly.</p><br/><p>Time passed, and more people began to arrive, attracted by the column of light. Of course, not a one could evade Meng Hao’s extortion. Eventually Xu Qing arrived, which meant that the area was now filled with the majority of the Cultivators who were here in the Third Plane.</p><br/><p>Their gazes flickered as they looked thoughtfully around at each other.</p><br/><p>The first person to make a move was an unimposing, emaciated old man from the Southern Domain. He flew out to stand on one of the vines. After grasping ahold of it, he looked back at the crowd of onlookers and then smiled. Then he produced a magical item, a fan, which he pushed up against the surface of the vine.</p><br/><p>Instantly, a green glow surrounded the fan, and it began to disintegrate. It transformed into dots of scintillating light, which then were absorbed into the vine. At the same time, the vine began to grow longer. It extended down into the pit, taking the old man with it.</p><br/><p>Fang Yu looked over at Meng Hao and then spoke, her words directed not just at him, but at everyone around. “According to the Fang Clan’s understanding, one needs magical items to be able to enter the Fourth Plane. Magical items from the outside world aren’t quite as effective as items acquired in the Demon Immortal Sect. Offer them as sacrifices to the Demon vines, and, depending on their value, the vines will extend down.</p><br/><p>“If you leave the vine and try to descend on your own, you will die without a doubt!”</p><br/><p>With that, Fang Yu’s body flashed, and she neared a vine. In much the same way as the old man moments before, she produced a magical item which she pushed up against the vine. The vine began to grow, extending down into the pit.</p><br/><p>One by one, more people began to fly forward. The Ji Clan members, the Northern Reaches Cultivators, the group from the Southern Domain. One after another, they stepped onto the vines, produced treasures, and then sank down into the pit. As all of this happened, Meng Hao cleared his throat. Looking embarrassed and a bit bashful, he began to speak.</p><br/><p>“Fellow Daoists, allow me to say something. Considering that you need to offer continual sacrifices to the vines, I must say that I actually have quite a few magical items. However, if I loan them out, if you take one, you’ll have to repay me with two. I’m honest with all customers. It’s a reasonable price.</p><br/><p>“Now, who’s to say what incredible acquisitions you will make in the Fourth Plane?” he continued. “Therefore, before going in, you should really think about this. Buy one, repay with two is definitely reasonable!” As soon as the others heard him, grim expressions could be seen on their faces.</p><br/><p>“Buy one, repay with two is reasonable?”</p><br/><p>“I’ve never seen extortion of this level!!”</p><br/><p>“What a joke! Even if I have to give up half-way to the Fourth Plane, I swear I will never again get entangled with this black-hearted Meng!”</p><br/><p>Glaring hatefully at Meng Hao, they completely ignored his offer and quickly grabbed onto the vines and then sank down into the pit.</p><br/><p>Xu Qing stood next to Meng Hao, covering her smile with a hand. She remembered all of the things Meng Hao had done back in the Reliance Sect, and as she looked at him now, her smile only grew sweeter.</p><br/><p>“They’re going to be sorry,” said Meng Hao, clearing his throat a few times. “I really did have good intentions just now.” He looked blinking at Xu Qing, and her smile grew wider. Shaking her head, she flew over to grab a vine, then sank down into the pit.</p><br/><p>Meng Hao wasn’t the last person on the outside. Some of the people chose not to attempt to enter the Fourth Plane. Some decided to just give up where they were.</p><br/><p>Seeing that no one else was going to enter the pit, Meng Hao walked around the edge of it, eventually decided on a position somewhat in the center. He reached out to grab a vine, then produced a magical item which he slowly pushed onto its surface. As it absorbed the item, the vine began to grow, taking him down at high speed into the pitch black of the pit.</p><br/><p>As soon as he entered the pit, Meng Hao could sense coldness coming from all around him. At the same time, he saw that it was not completely pitch black. Glittering dots of glowing light could be seen in the walls, making everything in the area visible.</p><br/><p>Around Meng Hao could be seen dozens of vines sinking downward, upon each one was a South Heaven Cultivator.</p><br/><p>Far down below was completely pitch black, and it was impossible to see. Occasionally, a roaring sound could be heard, shooting up from down below like a wild wind. When that happened, everyone held tightly to their vines to stabilize their shaking bodies.</p><br/>\n</div>"}