{"title": "Chapter 612: The Gentleman Loves Money", "id": 612, "volume": 7, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-612-the-gentleman-loves-money", "volume_title": "Volume 7", "body": "<h1>Chapter 612: The Gentleman Loves Money</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 612: The Gentleman Loves Money</strong></p><br/><p>A wind blew, as cold as the underworld. As it passed by, everyone’s hearts grew as cold as if they were stuck in the middle of winter. Even more shocking was that the frigid wind made the Cultivators almost like mortals. Everyone began to tremble as they clung to their vines.</p><br/><p>Their breath turned into ice, which then cracked and shattered, causing everyone to feel extremely astonished.</p><br/><p>Were it not for the vines, and the warmth which pulsed out from within them into the bodies of everyone present, then they wouldn’t be able to proceed downward for very long, not even if they had higher Cultivation bases.</p><br/><p>Meng Hao’s eyes flickered as he clutched the vine. He had long since come to the conclusion that these vines were a critical element in being able to reach the Fourth Plane. Many others had come to the same conclusion.</p><br/><p>Although not everyone had chosen to attempt to enter the Fourth Plane, everyone who had come to the Primordial Demon Immortal Plane were outstanding figures from the lands of South Heaven. As for those who did chose to enter the Fourth Plane, they definitely wouldn’t just give up halfway.</p><br/><p>As they produced more and more treasures to sacrifice to the vines, the vines twisted and writhed, extending downward at high speed.</p><br/><p>Time passed by slowly. Meng Hao was the last in line. As he descended he glanced around to inspect the area. As far as he could tell, the pit seemed bottomless. It was impossible to tell how far they had gone down, and yet they still couldn’t see any end in sight. The frigid wind grew more intense, seemingly increasing the number of treasures required by the vines.</p><br/><p>Not too far off from Meng Hao was Li Tiandao. His face was gradually filling with apprehension. Although he had come prepared with a good supply of magical items, he was finding it difficult to keep up with how much needed to be sacrificed. By this point, it didn’t seem to matter the quality of the magical items being sacrificed. Almost anything would do.</p><br/><p>Even still, the miscellaneous collection of magical items in Li Tiandao’s bag of holding were not very plentiful. If things kept going with no bottom in sight, then he would soon have to begin sacrificing important magical items.</p><br/><p>To him, it was something impossible to accept. He frowned and gritted his teeth, a look of determination gleaming in his eyes. He suddenly stopped, apparently preparing himself to start climbing back up. It seemed he planned to give up on his attempt to enter the Fourth Plane.</p><br/><p>However, almost as soon as he began to climb up, before he had even gone more than a meter or so, his face flickered. The frigid wind around him suddenly grew ten times as powerful. His hair and his eyebrows became snow-white in the blink of an eye. Ice crystals even formed on his skin; clearly he was on the verge of being transformed into an ice statue.</p><br/><p>The intense sense of grave crisis he felt caused Li Tiandao to immediately pull out one of his important magical treasures. It was a glowing blue sword that somewhat resembled a saber. A single glance was enough to tell that this was anything but an ordinary treasure.</p><br/><p>Forcing down the pain he felt, Li Tiandao placed the sword onto the vine, whereupon it sank down inside. The coldness around Li Tiandao vanished and his body slowly returned to normal. However, his expression was one of astonishment.</p><br/><p>“We’re only allowed to go down, not up?” he grumbled inwardly. “Or is it that going back up requires an even higher price?” Everyone around was aware of the strange event which had just occurred, and were shocked. They all began to think various thoughts.</p><br/><p>It was at this point that Li Tiandao saw that his own vine was no longer moving down but retracting back upward.</p><br/><p>This provoked a reaction from the others.</p><br/><p>“That can’t be right. It’s not that you can’t go up. Once you enter this place, even if you want to quit, you still have to sacrifice treasures!”</p><br/><p>“That must be the situation. It seems getting into the Fourth Plane isn’t so easy after all….”</p><br/><p>Meng Hao had the best view of the situation. His eyes flickered thoughtfully, and he rubbed his bag of holding. Suddenly, a bashful smile appeared on his face. He said nothing, but simply allowed his vine to slowly continue on downward.</p><br/><p>Li Tiandao hesitated thoughtfully for a moment. Right now, he had two options to pick from. Go up, or go down. Either way, he would have to spend all of his magical items.</p><br/><p>After a moment of hesitation, Li Tiandao clenched his jaw.</p><br/><p>“Since I have to waste the magical items, I might as well risk it all,” he thought. “If I don’t, then everything I already spent will have been a complete waste. However, if I succeed, I can make up for everything with gains in the Fourth Plane!”</p><br/><p>Many of the other Cultivators were thinking the same thing as Li Tiandao. They clenched their jaws, eyes shining with determination. To them it was a gamble; however, if they gave up now, then they would definitely end up with nothing. By holding on for a bit longer, they would at least have a chance… to make up for what they had already spent.</p><br/><p>Since that was the case, there was no reason not to gamble!</p><br/><p>Time passed. A day later, the group was deep into the pit. However, they still couldn’t see the bottom. It really seemed as if there was no end at all. By this point, quite a few of their number had already used up their supply of random magical items. If they wanted to continue, then they would either have to use up the magical items they had discovered in the Demon Immortal Sect, or draw on their own store of important personal magical items.</p><br/><p>The dilemma they faced caused the faces of quite a few of the Cultivators to look extremely unsightly. Before stepping foot into this place, all of them had believed themselves to be extremely well equipped with magical items. Now, though, they realized that they simply didn’t have enough.</p><br/><p>Compared to them, Meng Hao really did have it very easy. He had vast amounts of magical items in his bag of holding. He casually produced treasures to sacrifice to the vines. Not only did they continue to move downward, Meng Hao actually caused his vine to change course occasionally to hand over magical items to Xu Qing.</p><br/><p>This caused the eyes of everyone else present to burn with anger and extreme jealousy.</p><br/><p>“Ai, I just have too many treasures,” said Meng Hao with a sigh. The sound of his voice echoed around, causing everyone’s gums to itch with hatred.</p><br/><p>“Fellow Daoists,” he then announced, “if any of you are running low on treasures, all you have to do is speak up. We’re all in this together, through thick and thin. No matter what happens, I won’t ignore your plight while I am in a good position.</p><br/><p>“If you need to borrow some magical items, I’ll lend them to you without hesitation!</p><br/><p>“Don’t worry, my prices are reasonable, and I’m honest with all customers. Buy one, pay back three!” His voice echoed about loudly within in the pit. Everyone could hear, even the old man in the lead position. Their faces immediately twisted.</p><br/><p>Fang Yu looked back with glaring eyes, and yet a smile could be seen on her face.</p><br/><p>As for the Ji Clan members, their faces were unsightly. If they had such reactions, then there was no need to mention everyone else. When the crowds heard Meng Hao, their hearts filled with both hatred and helplessness.</p><br/><p>“You crafty, shameless villain!” someone said. “Even if our magical items run even lower than now, there’s no way we’ll ask for your help!”</p><br/><p>“That’s right!” said someone else. “Outside, it was buy one pay back two, now it’s buy one pay back three?! Raising prices like that is despicable to the extreme!”</p><br/><p>“I’ll die before asking for your help!”</p><br/><p>Meng Hao heard the furious reactions, and simply sighed. “You’re all wrong,” he said. “Each and every one of these magical items represents an important memory to me. I’m offering to lend you, not my magical items, but rather, the true love of my life.” He let out another emotional sigh.</p><br/><p>“In all honesty,” he continued, “my intentions truly are good. Look at these magical items of mine! Their glow is so resplendent and entrancing! These are high quality products!</p><br/><p>“Think about it, all of you. With some of my magical items, you can get into the Fourth Plane without a hitch! Once you’re there, you can acquire things so valuable that you can pay back what you owe me in the blink of an eye.</p><br/><p>“It’s completely worth it!</p><br/><p>“Brothers and Sisters, you have to look at things objectively. The price you will be paying now is nothing. The most important thing is to look at what you have to gain! Without paying a price, how can you gain anything, am I right?” Meng Hao was using all his skills to try to persuade everyone. These, of course, were the same skills he had used in his shop back in the Reliance Sect. However, those who heard only continued to get more angry.</p><br/><p>Xu Qing was off to the side, covering her smile with a hand. The gaze with which she looked at Meng Hao continued to grow warmer and warmer.</p><br/><p>“Fellow Daoists, how can this tiny price possibly compare to the chance to step into the Fourth Plane?” Meng Hao’s final sentence was full of meaning. His words echoed about, filled with an air of good faith. Many of the various Cultivators were actually moved inwardly, and they suddenly felt conflicted.</p><br/><p>Li Tiandao gritted his teeth. He currently only had four magical items left, and to sacrifice any of them would cause him incredible pain. His expression filled with determination and he said, “I’ll take three!!”</p><br/><p>Hearing this, Meng Hao’s expression shook visibly. He immediately pulled out a magical item and placed onto the surface of his own vine, causing it to change directions and head toward Li Tiandao.</p><br/><p>“Elder Brother Li, you are truly experienced and knowledgeable, talented and bold. Alright, listen. This is my first transaction of the day, so I’ll give you a bit of a discount. I’ll give you these three magical items, and you only need to pay me back with eight.</p><br/><p>“These three magical items have a value of 30,000 Spirit Stones. In that case, you need to pay me back 80,000 Spirit Stones.” With that, he produced three ordinary-looking random magical items, as well as a promissory note. Then he used the same method he had used in the Second Plane, the Dao oath.</p><br/><p>Li Tiandao gritted his teeth. After completing the formalities, he took the three treasures and then pressed one onto the surface of the vine. Instantly, it descended downward at rapid speed, alleviating his anxiety for the moment.</p><br/><p>“Did you see that, everyone?” said Meng Hao, setting his head nobly. “Meng Hao is a gentleman. The gentleman loves money, and earns it righteously. I’m not forcing anybody, and am even willing to sell things on credit! That’s right! You don’t need to pay me back now. A simple promissory note can solve all your problems.</p><br/><p>“You can simply pay me back after we leave this place. What a great deal!”</p><br/><p>Everyone around couldn’t help but think that Meng Hao truly had reached the pinnacle of shamelessness. More time passed, over half a day. There was still no bottom in sight. By this time, Li Tiandao owed Meng Hao more than 400,000. It was at that point that… Wang Lihai couldn’t hold back from calling out.</p><br/><p>“Give me ten!”</p><br/><p>“I’ll take ten too!” said Li Shiqi, gritting her beautiful teeth.</p><br/><p>“Ten for me too!” said Han Bei with a sigh.</p><br/><p>Meng Hao immediately looked quite enlivened. He adroitly produced the magical items and promissory note, watched as the three swore their Dao oath, then smilingly handed over the magical items.</p><br/><p>“When you purchase from me, you can rest your heart at ease. The quality of all products is guaranteed, and I deliver everything directly to you!”</p><br/><p>The three collected up the magical items they had purchased and then completely ignored Meng Hao. They began to feed the items into the vines and descend down further.</p><br/><p>Another day passed. Soon more people began to run out of treasures. Either that, or they weren’t willing to sacrifice the treasures they still possessed. No matter how much they hated Meng Hao, they had no choice but to call out to him.</p><br/><p>“Buy one, pay back five! Fellow Daoists, I’m starting to run low on magical items, so I have no choice but to raise the price…. Furthermore, I have to announce that when I am down to only ten magical items, then I will have no other choice than to begin an unprecedented, never before seen in history, never again to be repeated… auction!” Although Meng Hao sighed, his eyes actually shone with a brilliant light.</p><br/><p>As soon as the words left his mouth, it gave rise to furious complaints. Despite the anger, people gritted their teeth and spent the price of one to five to acquire large amounts of magical items.</p><br/><p>“What a profit!” thought Meng Hao. “Hahaha! I never thought that the ancient Demon Immortal Sect would turn out to be my Blessed Land!” He hung onto his vine, clutching a thick stack of promissory notes. When he looked at the numbers written on them, his eyes glowed brightly. His addiction to making money existed deep in his bones, and had not been reduced in the slightest, regardless of his advances in Cultivation base.</p><br/><p>“I’m rich!”</p><br/><p>-----</p><br/><p><em>This chapter was sponsored by Chirag Patel, ExtremeGTP, Jerrell Tisnado, and Hikaritenjou</em></p><br/>\n</div>"}