{"title": "Chapter 621: Hes My Little Brother", "id": 621, "volume": 7, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-621-hes-my-little-brother", "volume_title": "Volume 7", "body": "<h1>Chapter 621: Hes My Little Brother</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>In the same moment in which the voice of true spirit Night echoed out, the Cultivators from South Heaven were being surrounded by starlight. Within the starlight were countless motes and fragments, which mixed with the starlight to cover everything and transform it all into a river of stars.</p><br/><p>The river of stars was like a beam filled with countless motes of light that gathered momentum as it unfurled, sweeping up all of the Cultivators in preparation to return to South Heaven. After all, they had been swept up and carried to this place by the river of stars, it was only natural that they would be taken away in the same method.</p><br/><p>Upon seeing the river of stars, everyone felt a little bit more relaxed, although they wished it would finish forming up faster. Considering how quickly things were going out of control, they wanted to leave as soon as possible to get out of danger.</p><br/><p>As of now, this was not the Fourth Plane of the ancient Demon Immortal Sect. This was… the hitherto unknown Fifth Plane!</p><br/><p>The Fifth Plane, the awakening of true spirit Night!</p><br/><p>As true spirit Night’s voice echoed out, the land and sky in all directions twisted, and ghost images seemed to appear. The entire world seemed to revert to ancient times. Countless figures flew about, and everything flourished. But then sometimes, everything would become ruins, filled with corpses. And then it would simply be Night, head raised, the Seven Peaks turned into horns!</p><br/><p>Ghost images flickered over the entire world. True spirit Night… had now thoroughly lifted up its head from within the land.</p><br/><p>When true spirit Night slept, the world was a dream. When true spirit Night awoke, calamity came to Heaven and Earth!</p><br/><p>Meng Hao panted, and the South Heaven Cultivators watched on in alarm. Although the bodies of the crowd were half transparent, they couldn’t help but back up nervously and wish fervently that they could teleport away as soon as possible.</p><br/><p>After letting out an incredible roar, the colossal head of true spirit Night suddenly… spoke, its voice indistinct: “Give my precious mirror… back to me!”</p><br/><p>The voice echoed back and forth, causing Meng Hao’s mind to tremble as he coughed up a mouthful of blood. The South Heaven Cultivators mind’s felt as if they were being exploded by lightning; the sound of the voice was deafening.</p><br/><p>A moment later, the South Heaven Cultivators all looked over at Meng Hao. One by one they began to express their astonishment.</p><br/><p>“What treasure did Meng Hao take?!?!”</p><br/><p>“Don’t tell me he stole a precious treasure from that Demon beast, causing it to awaken!?!?”</p><br/><p>“Precious mirror… could it be… could it be that it’s talking about the continental mirror we saw in the Fourth Plane?”</p><br/><p>As their voices rang out, their eyes began to fill with shock and amazement, as well as intense jealousy.</p><br/><p>“Take out the continental mirror… and return it to me!” said true spirit Night. This time, its voice was clearer. As it spoke, massive amounts of lightning began to rise up around the seven mountain peaks.</p><br/><p>Before Meng Hao could open his mouth to speak, the group from South Heaven began to pant as they understood the meaning of Night’s words.</p><br/><p>The continental mirror of the Fourth Plane, which contained innumerable precious treasures, had actually… been taken away by Meng Hao!!</p><br/><p>The eyes of virtually all of the South Heaven Cultivators instantly went red. Even Fang Yu was breathing heavily and looking at Meng Hao with an expression of disbelief.</p><br/><p>Wang Lihai, Han Bei, Li Shiqi, and the others all appeared to be in complete disbelief, their minds shaken to the extreme.</p><br/><p>They couldn’t even begin to imagine how Meng Hao had managed to take away the continental mirror.</p><br/><p>The Ji Clan members’ eyes were wide. The Cultivators from the Northern Reaches and the Southern Domain were panting. Everyone was completely flabbergasted by this new information.</p><br/><p>Xu Qing’s face was also filled with disbelief. She looked at Meng Hao, and then a smile broke out on her face.</p><br/><p>Meng Hao frowned. Without saying a single world, he employed as much speed as he could to shoot out into the outside world. Most of his body was already starting to grow transparent, and he could clearly sense the power of teleportation.</p><br/><p>At the same time, the river of stars was now almost completely materialized, seemingly endless and filled with innumerable motes of light. It began to sweep through the void, picking up the crowds of South Heaven Cultivators, including Meng Hao. It then spun and began to shoot off into the distance.</p><br/><p>In the same moment in which Meng Hao and the others were swept up by the river of stars, the eyes of true spirit Night suddenly opened completely. Any sense of blankness within those eyes was completely wiped away, to be replaced with awareness. True spirit Night… was now fully awake!</p><br/><p>The instant the complete awakening occurred, true spirit Night let out a roar that caused the entire world and even the void to instantly cease moving. Even the river of stars trembled and then stopped in place.</p><br/><p>Meng Hao’s face fell, and the expressions of the South Heaven Cultivators were that of complete astonishment.</p><br/><p>Suddenly, the land down below began to rumble and disintegrate as a gigantic arm slowly rose up. It was black and covered with scales, and only had four fingers. As it rose up from the ground, it left behind a gigantic pit. It was so long that it was almost impossible to see the entire arm, and as it stretched out, its palm was so large that it seemed big enough to cover up the entire sky.</p><br/><p>The arm stretched out, snatching toward the river of stars.</p><br/><p>“Get back here!” said true spirit Night, its voice rumbling up into the Heavens. Meng Hao’s body was completely out of his control as it flew out, pulled from the river of stars to shoot toward the giant hand.</p><br/><p>In the blink of an eye, shockingly, he was standing on top of the giant hand. Meng Hao’s face was pale white, and his eyes shone with a sharp light. Now that Meng Hao had left the river of stars, it trembled once again, and then slowly began to move once again. The South Heaven Cultivators were now once more moving off into the distance.</p><br/><p>“Meng Hao!” Xu Qing’s face fell, and she struggled to fly out, but was incapable of leaving the river of stars. Fang Yu’s face was also filled with anxiety. As for most of the others, they seemed to be rejoicing in the misfortune of the others.</p><br/><p>“He’s dead! That Demon beast specifically kept him behind. He’s definitely going to die!”</p><br/><p>“He stole that thing’s precious treasure! How could it possibly let him leave!?”</p><br/><p>The Cultivators continued to watch as they moved off into the distance. True spirit Night retracted its palm, upon which Meng Hao stood, until Meng Hao was directly in front of it. His face was pale as he stood there on the palm, looking up at the colossal head, and true spirit Night’s two eyes.</p><br/><p>Meng Hao’s right hand rested on his bag of holding, and a cold glow could be seen in his eyes. He knew he was no match for true spirit Night. Even a single breath from it could completely extinguish the flame of his life force. However, until the critical juncture of life or death arrived, Meng Hao would continue to go all out.</p><br/><p>“You have no aura upon you which I find familiar….” said true spirit Night, looking over Meng Hao. Its right hand began to close into a fist. As it did, an indescribable pressure inundated Meng Hao. Cracking sounds could be heard, and blood sprayed from his mouth. His body seemed to be on the verge of completely collapsing; even his internal organs were on the verge of exploding.</p><br/><p>However, there was still not even a scrap of fear in Meng Hao’s eyes. Instead, a touch of madness could be seen burning inside, which then turned into ferocity. Finally, he took a deep breath and prepared to pull out the copper mirror.</p><br/><p>However, it was at this moment that a white-robed figure suddenly appeared in mid-air. He strode out step by step; in one moment he was far off in the distance; in the next moment, he stood in front of Meng Hao. His back was to him, and he stood there protectively, looking at true spirit Night.</p><br/><p>He wore white robes and had long, dark grey hair. He was indescribably ancient and old. This was… Ke Jiusi!</p><br/><p>“You may not harm him,” said Ke Jiusi calmly, staring up at true spirit Night, his voice filled with an incredible power. The energy caused Heaven and Earth to flicker with different colors, as if it was capable of fighting back against true spirit Night.</p><br/><p>True spirit Night looked at Ke Jiusi. “I’ve awakened,” it said, its voice a drone. “There must be extermination of life.”</p><br/><p>“He is a son approved by my father,” said Ke Jiusi quietly. Behind him, a tremor ran through Meng Hao. As he looked at Ke Jiusi, the warmth between him and Ke Yunhai in the Second Plane suddenly filled his heart.</p><br/><p>“That was a dream!” said true spirit Night, its voice cold.</p><br/><p>“Since my father approved of him, it doesn’t matter whether it was an illusion or not,” said Ke Jiusi slowly, a mysterious light flickering through his eyes. “He… is my little brother. With me here, nothing in existence, not even you, can harm him in the slightest bit, or even dare to try!”</p><br/><p>As he spoke, an indescribable aura rose up.</p><br/><p>Meng Hao stood there silently, looking at Ke Jiusi’s back. The hand that gripped his bag of holding slowly relaxed.</p><br/><p>“I’ll… I’ll hand over the continental mirror….” said Meng Hao with a soft sigh. However, even as the words left his mouth, Ke Jiusi turned his head and gave Meng Hao a profound look.</p><br/><p>This was the first time Meng Hao had ever seen Ke Jiusi’s face. In that moment, he almost thought that he was looking at Ke Yunhai. He gaped in shock at the familiar features.</p><br/><p>However, it only took a moment for him to see that this was definitely not Ke Yunhai.</p><br/><p>“You don’t need to hand it over,” said Ke Jiusi. He had watched moments ago as Meng Hao showed no fear in the face of death. And yet now, he was willing to hand over the continental mirror. Ke Jiusi understood, and it caused a gentleness to appear in the depths of his eyes. “Since you were able to take it away, it shows that you were destined for such good fortune. Besides… the awakening of true spirit Night doesn’t mean complete catastrophe.”</p><br/><p>Ke Jiusi gazed at Meng Hao. “Do you trust me?”</p><br/><p>Meng Hao looked at Ke Jiusi, at the features which so much resembled Ke Yunhai. Without hesitation, he replied, “I trust you!”</p><br/><p>“In the past, Lord Li laid down orders that whoever awakened true spirit Night would be given two options.” With another deep look at Meng Hao, Ke Jiuisi turned to look back at true spirit Night. “Night, he is my little brother, so I will act on his behalf to make the decision. He will choose the second path!”</p><br/><p>Night was silent for a long moment, its expression one of complexity. Finally, its gaze came to fall on Meng Hao.</p><br/><p>Slowly, it began to explain. “Lord Li ordered that whichever life form wakes me up will be given two options. First option: return the continental mirror to me, and I will continue to sleep….</p><br/><p>“Second option; do not return the mirror, and prepare yourself to acquire the qualifications to receive Lord Li’s legacy. Walk the three mountains, pass through the Holy Lands, ascend to the Fourth Heaven… acquire the legacy of Lord Li! If you fail… then you will stay behind as a guest in my dream.”</p><br/><p>As its voice echoed out, it was audible to even the South Heaven Cultivators in the river of stars. When they heard the true spirit’s words, they gaped in shock. That was especially true of the Ji Clan members and the Cultivators from the Northern Reaches. They looked back at the distant Demon Immortal Sect, their eyes wide with disbelief, and more so, intense jealousy and madness.</p><br/><p>“Just… just… just what kind of good fortune is this?!”</p><br/><p>“Dammit! How is this possible? That’s not a catastrophe! Isn’t there supposed to be a catastrophe? Isn’t Meng Hao supposed to be exterminated? How could such good luck as this appear?!?! Lord Li’s legacy! Seriously? The legacy of Lord Li?!?!”</p><br/><p>“It was so overbearing before, like it could destroy everything. How could things turn around and… become such good fortune!”</p><br/><p>“The legacy of Lord Li?! I can’t accept this!!”</p><br/><p>-----</p><br/><p><em>This chapter was sponsored by Joakim Trælvik</em></p><br/>\n</div>"}