{"title": "Chapter 622: Three Mountains, Nine Bows", "id": 622, "volume": 7, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-622-three-mountains-nine-bows", "volume_title": "Volume 7", "body": "<h1>Chapter 622: Three Mountains, Nine Bows</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 622: Three Mountains, Nine Bows</strong></p><br/><p>The South Heaven Cultivators watched on with wide, disbelieving eyes. Their hearts were filled with complexity and jealousy. The emotions continued to ripple out until, eventually, they turned into avarice.</p><br/><p>There were only a few people who were actually happy to see Meng Hao run into such good fortune. Most were just jealous to the point of hatred.</p><br/><p>“Dammit! Why does it have to be him!?!? In the Second Plane he was an Elite Apprentice. In the Third Plane, he stole away all our treasures! In the Fourth Plane he acquired that precious treasure, the continental mirror. And now here in the Fifth Plane… he’s acquired the qualifications for the legacy of Lord Li!”</p><br/><p>“Why does it have to be this way? By what right of virtue or ability does he fall into such good luck?! I can’t stand for this!”</p><br/><p>“Worst of all is that we still owe him a huge debt! I myself owe 800,000 Spirit Stones….”</p><br/><p>“I owe him 1,000,000 Spirit Stones! Dammit! Why can’t he just die here!”</p><br/><p>Other than Xu Qing, Fang Yu, and few others, all the Cultivators from South Heaven gnashed their teeth, their jealousy of Meng Hao having risen to the pinnacle.</p><br/><p>“He’ll be going back to the lands of South Heaven eventually!” said Ji Mingkong suddenly, his eyes flashing. As soon as he spoke, the eyes of the others began to flash.</p><br/><p>“That’s right. He will be back in South Heaven eventually. And it doesn’t matter what he acquired, we will still have to report everything that happened when we get back to our Sects and Clans.”</p><br/><p>“Look, all he did was acquire qualifications to get Lord Li’s legacy. As to whether or not he will actually acquire the legacy remains unknown!”</p><br/><p>As the South Heaven Cultivators spoke among themselves, the river of stars which surrounded them made its way off into the distance. Gradually, they began to lose consciousness. Soon, all of their eyes were closed, and they were in a state of slumber, just as they had been when they arrived. The river of stars began to float back to the lands of South Heaven.</p><br/><p>Meanwhile, back in the Demon Immortal Sect, Meng Hao stood on the palm of true spirit Night as it slowly lifted him up into the sky.</p><br/><p>Ke Jiusi also stood on Night’s palm, looking at Meng Hao with an encouraging expression.</p><br/><p>“This is your opportunity. As for how far you can get, that will depend on your personal good fortune.” With that, he flicked his sleeve and then stepped out and disappeared into mid-air.</p><br/><p>Meng Hao’s heart shook. He could never have imagined that in the end, he could acquire qualifications to try to acquire Lord Li’s legacy. He panted as the enormous palm lifted him up into the sky. After that, shockingly… three inverted mountains appeared in front of him.</p><br/><p>These were the three Greater Demon Mountains!</p><br/><p>It was at this point that Night’s voice rumbled out.</p><br/><p>“The first stage of the legacy is the approval of the Seven Peaks. You have already passed that stage.</p><br/><p>“The second stage is to awaken me. You… already passed that stage too!</p><br/><p>“The third stage involves bowing nine times to the three mountains. If you acquire the approval of all three mountains, then you can break through to the Second Heaven!</p><br/><p>“For Jiusi’s sake, I will remind you… this stage can only be passed if you are destined to do so!”</p><br/><p>“Destined….” thought Meng Hao, looking at the three inverted mountains up in the air. After a moment of silence, he closed his eyes, then opened them again. They shone with a brilliant light.</p><br/><p>The first mountain was none other than the Frost Soil Demon Mountain. It was completely frozen over, and was filled inside with chaos, making it impossible to clearly see the whole mountain. However, Meng Hao could definitely sense the freezing pressure coming from the mountain.</p><br/><p>This mountain seemed to be the coldest thing in Heaven and Earth, something even flames could do nothing to melt. It was if any other freezing cold thing in the world wouldn’t even dare to call itself cold while standing before this mountain!</p><br/><p>If you looked closely at the decorations and patterns within the layers of ice, it almost looked as if they contained entire worlds. It was bizarre to the extreme!</p><br/><p>Also visible on the mountain was a towering altar, upon which was a throne. Seated in the throne was what appeared to be a statue. The statue's features were unclear, but its upraised right hand was held up into the air where apparently an ice flame had once burned!</p><br/><p>By this point, Meng Hao was already panting. He shifted his gaze to look at the next mountain.</p><br/><p>The second mountain was completely crimson, as if it overflowed with fresh, red blood. An indescribable, monstrous killing intent seemed to fill it, as if an uncountable number of lives were buried inside the mountain. The vast number of people who had died led to the overflow of fresh blood, thus turning the mountain completely red.</p><br/><p>Killing intent circulated around, to the extent that even a single glance would cause one’s mind to fill with a mountain of corpses and a sea of blood.</p><br/><p>There was also an altar on this mountain, upon which could be seen a blood-colored throne. A figure sat on this throne, its right hand raised up.</p><br/><p>As soon as Meng Hao saw the figure, his mind trembled. A shocking scene appeared in his mind that was not exactly the same as this, but extremely similar.</p><br/><p>“This is….” Meng Hao’s mind shook, and his breath came in ragged pants. After a moment, his eyes flickered as he suppressed his thoughts and emotions, then looked over at the third mountain.</p><br/><p>Upon this mountain, flames raged. The flames were dim, but seemed incapable of burning out. Even stranger, upon looking at the mountain, ghost images would spring up in the mind, as if countless volcanoes existed. It made it impossible to tell which of the mountains was real, and which was false.</p><br/><p>Eventually, the image of countless withered figures could be seen on the surface of the volcanic mountain. They looked like evil spirits, emitting noiseless howls as they climbed, struggling amongst each other to be the first to reach the peak of the mountain and then throw themselves into the pit of fire there.</p><br/><p>There was no altar, no throne, no figure. This third mountain was completely different than the other two!</p><br/><p>Three mountains, three Greater Demons of Heaven and Earth!</p><br/><p>Of course, the three Greater Demons had long since perished. But even Lord Li would not have been capable of making their essences fade away. Therefore, the three mountains existed as before!</p><br/><p>Panting, Meng Hao once again focused his gaze on the Frost Soil Demon Mountain. He then clasped hands and… bowed deeply!</p><br/><p>First bow!</p><br/><p>“I am connected by destiny to Han Shan,” he said. “I received his Immortal’s sword and his bronze flagon. Therefore, I should bow first to the Frost Soil Demon Mountain!” As his words rang out, the Frost Soil Demon Mountain suddenly trembled.</p><br/><p>Cracking sounds could suddenly be heard from the entire mountain. Originally, ice spread out across the mountain, a power of sealing. But when Meng Hao bowed for the first time, that ice began to crack and split. More and more fissures spread out, creating a roaring sound that lifted up to the Heavens as Meng Hao straightened back up.</p><br/><p>Down below, Ke Jiusi stood on the head of true spirit Night, on the Fourth Peak. When he saw what was happening, a strange light began to shine in his eyes. Even the eyes of true spirit Night began to glitter. “His first bow stirred up transformations in the Frost Soil Demon Mountain. He… truly is connected to the mountain by destiny. However, exactly how strong that destiny is remains to be seen. Can he ignite the Demonfire to illuminate the Third Heaven?!”</p><br/><p>Meng Hao looked up at the Frost Soil Demon Mountain, then took a deep breath. He clasped hands and bowed again.</p><br/><p>“My Earth-type totem is formed from Frost Soil. In the end, I created a Frost Soil Nascent Soul. This kindness, or destiny, leads me to bow again to the Demon Mountain!”</p><br/><p>Second bow!</p><br/><p>Boom!</p><br/><p>As his voice rang out, a huge rumbling could be heard from the Frost Soil Demon Mountain. Even more cracks appeared on the layers of ice which covered the mountain. The cracks began to form together into something that looked like a face. The facial features were extremely lifelike; they were that of an old man, his face filled with ancientness as he looked at Meng Hao.</p><br/><p>He seemed capable of seeing all of Meng Hao’s past with a single glance, as well as his future.</p><br/><p>At the same time, something changed about the figure seated in the throne on the altar. The previously empty spot in its right hand suddenly flickered as blue sparks appeared. It looked as if a flame wished to ignite there!</p><br/><p>When he saw this, Ke Jiusi’s eyes shone even brighter. As for true spirit Night, it said nothing, but a strange glow could be seen in its eyes.</p><br/><p>Meng Hao looked up at the face of the old man in the layers of ice. He clasped his hands and bowed yet again, a look of determination in his eyes.</p><br/><p>“I have an agreement with senior Han Shan. One day, when my Cultivation base is up to the task, I will return to the Realm of the Bridge Ruins to rescue him. That agreement is destiny, between myself and senior Han Shan. It is also destiny between myself and the Frost Soil Demon Mountain. Today, I repeat the same oath as before! [1. Han Shan was the Immortal Meng Hao met in the Realm of the Bridge Ruins. In chapter 474, Meng Hao vowed to rescue him]</p><br/><p>“Demon Mountain, please bear witness. This bow is evidence of the determination of Meng Hao of the junior generation!”</p><br/><p>Not even the slightest sound could be heard from the Frost Soil Demon Mountain. It seemed to have no reaction whatsoever to Meng Hao’s third bow. Meng Hao felt his heart pounding; he knew that he had tried to pull a bit of a fast one with the third bow.</p><br/><p>However, all of a sudden….</p><br/><p>“Agreed!” said an ancient voice. It echoed out from the Frost Soil Demon Mountain, almost from within the depths of time itself. As the voice spread out through the area, it carried with it endless coldness which caused the world to distort and blur.</p><br/><p>The word was spoken by the face of the old man. He looked deeply at Meng Hao for a moment, and then began to grow blurry. Cracking sounds could be heard as the cracks which made up the face spread out. They formed together to make a huge rift that spread from the top of the mountain to the bottom. It created a massive, scar-like mark, which stretched across the entirety of the mountain.</p><br/><p>The mark stretched all the way to the altar, and the figure on the throne. A bang could be heard. The blue sparks which danced above the right hand of the figure suddenly began to form together, transforming into a blue flame.</p><br/><p>As soon as the flame appeared, it illuminated the face of the figure. That face was exactly the same in all respects as Han Shan’s!</p><br/><p>The flame roared up, shining three portions of light into the sky up above.</p><br/><p>Gradually, because of the light shone by the flame, two shocking, enormous objects became visible up in the sky. They floated high up above, looking even more majestic and shocking than the three Greater Demon Mountains.</p><br/><p>A shocking, indescribable aura surround those two objects!</p><br/><p>Meng Hao’s mind trembled, and he closed his eyes. After calming himself, he opened his eyes again and then looked at the second mountain, the blood-colored Demon Mountain!</p><br/><p>He clasped hands, looked at the Blood Demon Mountain, and then suddenly bowed. “I’m not sure if this mountain has anything to do with the ancient Temple of Doom. However, that is what this bow is for. If destiny exists, I implore the mountain to express itself!”</p><br/><p>This was his fourth bow in total, and his first toward the Blood Demon Mountain!</p><br/><p>——-</p><br/><p><strong>Note from Er Gen:</strong> Yesterday was the funeral procession for my grandfather. According to tradition, tomorrow is the third day after burial, the time to revisit the grave. I’ll try to post as many chapters as possible today, but tomorrow I definitely won’t be able to post two chapters. I’ll only post one.</p><br/><p>Thank you for your concern, everyone. Thank you. I’m fine. I just have a sore on my tongue, which makes it difficult to eat. I don’t want to think about the past.</p><br/><p><strong>Note from Deathblade:</strong> Er Gen’s release schedule from so long ago doesn’t affect mine. Usually his post-chapter messages aren’t very meaningful, but this one was so I figured I would share it.</p><br/><p>-----</p><br/><p><em>This chapter was sponsored by Emmanuel Martinez, Joakim Trælvik, Shirley Ens, and Emmanuel Martinez</em></p><br/>\n</div>"}