{"title": "Chapter 620: Nights Head!", "id": 620, "volume": 7, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-620-nights-head", "volume_title": "Volume 7", "body": "<h1>Chapter 620: Nights Head!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 620: Night’s Head!</strong></p><br/><p>By now, ten thousand times as many arcs of electric light were dancing back and forth on the brain of true spirit Night.</p><br/><p>At the same time, the brain began to twitch. Bursting howls could be heard echoing in from outside, howls that shook the mind.</p><br/><p>Meng Hao’s face flickered as an intense sensation of grave crisis appeared inside of him. He could sense terrifying fluctuations, and an aura that seemed capable of destroying him in a single explosive burst.</p><br/><p>Numbness washed over his scalp as, without hesitation, he put the copper mirror away and then flew at the highest speed possible toward the exit passage.</p><br/><p>The passage had once seemed to be a deep pit, but because of the aura of awakening Night, it had changed dramatically. It was moving, wriggling, as if the passageway was actually some part of the body of true spirit Night!</p><br/><p>Meng Hao’s face fell, and he pushed himself to go even faster. He was now at the pinnacle of the Eighth Anima, and he moved even faster than lightning as he shot into the passageway. In the blink of an eye, he was speeding along inside.</p><br/><p>ROAR!!!</p><br/><p>A shocking roar echoed out from both below and above. Everything in the Demon Immortal Sect shook violently and began to fall into pieces.</p><br/><p>The destruction was clearly visible to Meng Hao. He could see it with his own eyes, because the walls that surrounded him seemed to be covered with a partially transparent filament. Through that, Meng Hao could see the lands cracking and shattering by layers, then falling downward.</p><br/><p>As he looked back through pit-like passageway, Meng Hao suddenly realized that it looked more like a tube!</p><br/><p>It was a tube that ran to the brain of true spirit Night, and he was right in the middle of that tube, moving with unprecedented, maddening speed.</p><br/><p>As he sped along, he began to pant. That was because he was astonished to find that the tube he was traveling through was actually lifting up into the air.</p><br/><p>“It’s not just this passageway that’s lifting up into the air. Actually… this passageway… is part of the body of true spirit Night! When it moves, it will appear from within the land!” Meng Hao’s mind trembled as he looked through the semi-transparent walls of the passageway to see the land collapsed everywhere. He could also feel the sensation of the passageway moving upward.</p><br/><p>After more than ten breaths of time passed, a blinding white light filled Meng Hao’s vision. A huge roar filled the passageway he was in as it was completely lifted up from the ground until it was in mid-air above the Demon Immortal Sect!</p><br/><p>By this point, Meng Hao had traversed roughly seventy percent of the passageway, placing him thirty percent of the distance away from the exit. The passageway was now trembling violently, and Meng Hao’s face was pale white. Through the semi-transparent walls, he could see that outside…</p><br/><p>Fissures covered all of the lands of the Demon Immortal Sect. Most of the various areas of the Sect were completely collapsed. In fact, most of the lands seemed to be caving in, as if some enormous creature were rising up.</p><br/><p>Rocks tumbled down the sides of the seven mountain peaks, as if even they would not be able to survive this incredible catastrophe.</p><br/><p>The first to collapse was the Third Peak!</p><br/><p>As the lands around it collapsed and caved in, the mountain peak began to slant to the side and sink…. However, as he looked at it, Meng Hao got the strange feeling that… the Third Peak was not actually collapsing. Actually, there appeared to be some incredible force causing it to tilt to the side.</p><br/><p>He couldn’t quite be sure, but the sensation was intense.</p><br/><p>Then, even as the semi-transparent passageway vibrated rapidly, Meng Hao suddenly saw something… that he would never be able to forget.</p><br/><p>He saw an incredibly large head. It was so large that it was impossible to estimate exactly how large it was. And only half of it was visible!</p><br/><p>It looked like a human head, except it had no hair, and was instead completely covered with pitch-black scales. Shockingly, this head… seemed to encompass all of the lands of the Demon Immortal Sect!</p><br/><p>Meng Hao’s scalp went numb and his mouth was completely dry. He was thoroughly incapable of determining how large this head was!</p><br/><p>He also saw that the semi-transparent passageway he was in, was actually an enormous antenna attached to the top of the head! It was an tube-like antenna, apparently used for breathing!</p><br/><p>What caused Meng Hao’s mind to tremble with even more disbelief was that the previously tilting and toppling Third Peak… actually… had stopped after reaching a certain angle, and was no longer falling.</p><br/><p>That was because… the Third Peak was not actually part of the land at all. It was connected to the head. More accurately, the Third Peak was actually an enormous horn growing out from the top of the Head!!</p><br/><p>“This… this is… true spirit Night?” thought Meng Hao, staring with wide eyes.</p><br/><p>He wasn’t the only one seeing this. The other South Heaven Cultivators who were congregated outside of the First Peak watched on with pale faces. At the same time, the location where they stood began to collapse. A huge hole appeared, a passageway out to the starry sky that everyone unhesitatingly entered.</p><br/><p>As they flew into the passageway, their bodies began to emit a white light. The light seemed to be separating them from the ancient Demon Immortal Sect. Their bodies began to grow transparent; apparently, it wouldn’t be long before they completely disappeared.</p><br/><p>At the same time, bands of starlight descended from all directions, transforming into a river of stars. The appearance of the river of stars indicated that the return to South Heaven had begun. It was time to leave the good fortune of the Demon Immortal Sect.</p><br/><p>“Meng Hao!!” cried Xu Qing inwardly. She bit down her lip as the soft light began to envelop her. Gradually she grew transparent, but her anxious eyes were focused in the direction of Meng Hao back in the Demon Immortal Sect.</p><br/><p>Similarly anxious was Fang Yu. Her hands were clenched into fists as she watched the Demon Immortal Sect collapsing. “Hurry up, Meng Hao. Get out of there!”</p><br/><p>As for the other South Heaven Cultivators, all of them were filled with complex emotions. They were overwhelmed with astonishment at the sudden drastic turn of events in the ancient Demon Immortal Sect. At the same time, they were also filled with unspeakable, conflicting thoughts regarding Meng Hao.</p><br/><p>They wanted Meng Hao dead, so that their debts would be absolved. However, were it not for Meng Hao’s actions just now, all of them would be dead. That was a kindness on his part.</p><br/><p>Various thoughts filled them as they watched on silently.</p><br/><p>Meng Hao was scared out of his mind. As far as he could tell, he had really set something epic into motion….</p><br/><p>“All I did was pull out a crappy mirror, right…?” he thought, clenching his jaw. He continued to speed along as fast as possible toward the exit of the semi-transparent passageway.</p><br/><p>However, it was at this point that, surrounded by the collapsing lands, the head of true spirit Night slowly began to lift up. A reverberating wail even more shocking than before echoed out in all directions.</p><br/><p>The Second Peak, the Fourth Peak, the First Peak, the Fifth Peak….</p><br/><p>All shook violently and rose up into the air. Countless stones and boulders fell down, as four, shocking horns were revealed!</p><br/><p>The antenna undulated, and at the same time, the exit appeared just up ahead of Meng Hao. Even as he was about to break free… Night, whose head was now half emerged from the collapsing lands, suddenly inhaled.</p><br/><p>The breath caused an enormous sucking force to rush through the semi-transparent passageway. Meng Hao was completely incapable of controlling his body. His eyes went wide as he felt himself himself being sucked in.</p><br/><p>Filled with shock, he unleashed the full power of his Cultivation base. His right hand reached out the side and grabbed hold of a vine….</p><br/><p>How could Meng Hao not see that these vines were actually like hairs that existed within true spirit Night’s antenna…?</p><br/><p>As soon as he grabbed ahold of it, he stopped moving. However, only a moment later, the vine snapped. Meng Hao’s eyes went wide as he was once again sucked back. All of these things happened in only the space of ten or so breaths. To Meng Hao, though, it seemed like an eternity.</p><br/><p>“If this is the breathing of true spirit Night…” he thought. “Breathing involves inhaling and exhaling. If this is the inhaling, then it must be followed by exhaling! Time to gamble!” With that, his eyes filled with determination. There was little else he could do now except gamble.</p><br/><p>He continued to grab onto vines, and continued to employ the full power of his Cultivation base to try to slow his movement. Ten breaths of time passed. Beneath him, Meng Hao could see the end of the passageway, and once again, the brain of true spirit Night. However, it was at this point that the inhaling ended. It was then followed by an intense, explosive force in the opposite direction.</p><br/><p>Meng Hao’s eyes glittered. Roaring filled his body and blood sprayed from his mouth. Underneath the power of the force, he shot upward. His eyes filled with madness and his Cultivation base exploded, adding even more speed.</p><br/><p>The entire process didn’t even take ten breaths of time. Meng Hao’s body rumbled as he suddenly… shot directly out from within the antenna.</p><br/><p>By the time he flew out, the lands of the Demon Immortal Sect were completely collapsed and destroyed. The Sixth Peak and the Seventh Peak shook violently. Beneath them was revealed… a head that was as large as more than half the lands of the Demon Immortal Sect.</p><br/><p>It had human features, but was covered with pitch-black scales. It had seven enormous horns, and a long antenna, the end of which glowed with a green light.</p><br/><p>Its eyes were half open, and inside could be seen the blankness of awakening. There was also a shocking, indescribable energy pulsating off of its body.</p><br/><p>This was… true spirit Night!</p><br/><p>It had seven horns that could form mountains, and even though the head was only half emerged, its shocking aura was such that anyone who looked at it couldn’t help but feel their mind tremble.</p><br/><p>Meng Hao shot back at top speed. He himself was nothing in comparison to true spirit Night. He couldn’t help but think back to the only thing which could possibly compare in size to true spirit Night, and that was Patriarch Reliance, with the State of Zhao on his back.</p><br/><p>“All I did was take out a crappy mirror! Could that really stimulate this thing into awakening?!?!” Sweat poured down Meng Hao’s forehead as he shot toward the location of the other South Heaven Cultivators, all of whom were staring in astonishment at true spirit Night.</p><br/><p>Their minds were filled with roaring, and they were incapable of even speaking half a sentence. At the same time, they were on the verge of becoming completely transparent, making them appear like shadows.</p><br/><p>Meng Hao flew as fast as he could, using all of the power of his Cultivation base, the green smoke, the black moon. However, almost the same moment in which he reached the exit, behind him, true spirit Night uttered the first sound that was not a wail.</p><br/><p>“NIGHT!!”</p><br/>\n</div>"}