{"title": "Chapter 642: The Patriarch Flies Into a Rage", "id": 642, "volume": 7, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-642-the-patriarch-flies-into-a-rage", "volume_title": "Volume 7", "body": "<h1>Chapter 642: The Patriarch Flies Into a Rage</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 642: The Patriarch Flies Into a Rage</strong></p><br/><p>“I’ll just sit here and wait for the 10th Wang Clan Patriarch to come,” thought Meng Hao complacently. “In the meantime, I’ll treat my injuries and just let time pass.” He sat there cross-legged in the remote mountain forest, surrounded by silence. The night was dark and charming; a soft breeze brushed gently against his face.</p><br/><p>He rotated his Cultivation base as he slowly treated himself. Taking a deep breath, he closed his eyes. A few days passed.</p><br/><p>The parrot and the meat jelly emerged during that time, then left to go play on the sea. It was impossible to tell what vices they had indulged in, but they came back smelling like seawater. They made quite the commotion as they returned to perch on Meng Hao’s shoulder.</p><br/><p>“You are immoral!” cried the meat jelly, preparing to launch into a speech. “That white crane….”</p><br/><p>“SHUT UP!” replied the Parrot, glaring. It was just about to continue speaking when suddenly it made an “eee?” sound and then looked around. Before it could say anything, Meng Hao’s eyes snapped open and he stuffed the parrot and the meat jelly into his bag of holding, then cleared his throat and continued to meditate.</p><br/><p>At the moment, Patriarch Reliance was completely torn about what to do, so he didn’t notice what had just happened. He was utterly helpless in terms of Meng Hao; during the past few days, he had grown increasingly anxious. It was now clear based on Meng Hao’s actions that he planned to stay long term to restore himself to health.</p><br/><p>“You little bastard, you just wait. The Patriarch is going to go all out!” Patriarch Reliance lifted his head up and roared. He had been in conflict over the past several days, and at this point, couldn’t wait any more. Clenching his teeth, he waved his sleeve, causing his body to grow transparent. It appeared as if he had separated some of his essence, which then began to swirl in the air above his hand, emanated a multicolored glow.</p><br/><p>It rapidly turned into what appeared to be a Spirit Fruit, from which a delicate fragrance wafted out. Anyone who looked at it would instantly feel themselves palpitating with eagerness.</p><br/><p>Off to the side, Guyiding Tri’rain’s eyes went wide and she began to breathe heavily. She recognized this object; it was a strand of essence from Patriarch Reliance’s clone form.</p><br/><p>Clenching his teeth and enduring the distress of it all, Patriarch Reliance lifted his right foot and then stamped it down onto the surface of the palace. Instantly, a white crane appeared. As soon as it flew out, it began to change shape into a gray eagle, which then grabbed the Spirit Fruit with its talons. After that, it passed through the walls of the palace and shot off into the distance.</p><br/><p>Patriarch Reliance watched anxiously as the gray eagle left. He felt distressed, and couldn’t stop from stamping his feet back and forth in nervousness.</p><br/><p>“Screwed over. I’m screwed over big time…. However, as long as that little bastard leaves, the Patriarch can deal with it!”</p><br/><p>The gray eagle shot through the sky with incredible speed toward Meng Hao’s location. In only the space of a few breaths, it appeared near him.</p><br/><p>It kicked up a stiff wind that caused Meng Hao’s eyes to open. He looked up into the sky, and as soon as he caught sight of the gray eagle, his pupils constricted. Clearly, the most important part was the Spirit Fruit it held in its talons.</p><br/><p>At a single glance, he could sense the ripples that emanated out from within the fruit, as well as the colorful glow which surrounded it. It almost looked like an Immortal Fruit. Even just glancing at the Immortal Fruit provoked a reaction from his internal injuries.</p><br/><p>“This thing can really heal injuries….” thought Meng Hao. He hesitated for a moment, then smiled bitterly. Patriarch Reliance really had hit him in a soft spot with this particular move. He sighed inwardly.</p><br/><p>“But it’s such a blatant move…. Well, he is Patriarch Reliance, after all, so I guess it’s not that strange.” It was with a wry smile and a conflicted heart that he watched the gray eagle start to fly in circles over his head. It seemed as if it was simply waiting for him to snatch the Spirit Fruit.</p><br/><p>“Snatch it!” roared Patriarch Reliance. “Come on! Why aren’t you snatching it!?” At the moment, he wanted nothing more than to throttle Meng Hao.</p><br/><p>After struggling back and forth for a while, Meng Hao took a deep breath. His eyes filled with determination. He simply couldn’t ignore such temptation. He had just made the decision, and was about to make a move, when suddenly, the gray eagle loosened its talons.</p><br/><p>The Spirit Fruit slowly fell down from the sky with great accuracy to land directly in front of Meng Hao.</p><br/><p>Patriarch Reliance burst out with hearty laughter, and he looked extremely proud of himself. Then he harrumphed to express the superiority of his intellect. Finally, he sent his Divine Sense into the gray eagle, causing it to let out a cheerful cry filled with complacent pride.</p><br/><p>Because Meng Hao was staring in shock, he didn’t notice that at some point, the parrot had stuck its head out of the bag of holding and was looking intoxicatedly at the gray eagle. Suddenly, it transformed into a black streak of light that shot out at top speed.</p><br/><p>Back in the palace, Patriarch Reliance’s Divine Sense was still in the gray eagle, controlling it as it flew off into the distance. “You little bastard! The Patriarch has lived for years and years, and you want to try to compete with me? Let’s see what reason you can come up with to stay now! Hahaha! The Patriarch is… huh? Ahh? AAGGHHH!!” In the midst of his complacency and laughter, he suddenly shuddered, and his eyes went wide with disbelief.</p><br/><p>He could clearly see the black beam of light shooting out from Meng Hao’s bag of holding. Then, the black shadow shot through the air to penetrate the rear end of the gray eagle.</p><br/><p>“What… what is it doing?” said Patriarch Reliance, trembling.</p><br/><p>The gray eagle shook. It was illusory, after all, so it twisted and then transformed into countless dots of glittering light that spread out in all directions.</p><br/><p>A tremor ran through Patriarch Reliance and he stared blankly. Because his Divine Sense had been inside the gray eagle, everything that had happened just now… he had also experienced.</p><br/><p>His face was filled with disbelief, but it only took a moment for him to react. His eyes went wide and were shot with blood as he lifted his head up and roared.</p><br/><p>“You, you, you… you actually….</p><br/><p>“Ridiculous! You actually….</p><br/><p>“AAAAAGGGHHHHHHHHHHH!” After understanding exactly what had happened, Patriarch Reliance was filled with unspeakable, unprecedented rage and madness.</p><br/><p>All of the the lands of Saint’s Island shook, and enormous waves rolled out across the sea. The faces of all the Cultivators on the island flickered as they wonder what had just transpired.</p><br/><p>Meng Hao was also a bit frightened. When he saw the parrot returning, that intoxicated look on its face, his scalp went numb.</p><br/><p>“Damned bird,” he thought, taking a deep breath. “It… it actually did… it did Patriarch Reliance?” The parrot’s expression was one of deep emotion as it returned. Everything that had happened completely exceeded Meng Hao’s imagination.</p><br/><p>The parrot still seemed to be savoring the aftertaste of what had just occurred. As it returned, Meng Hao could hear it muttering.</p><br/><p>“Strange. How come it couldn’t handle being done? I barely started and it disappeared?”</p><br/><p>Meng Hao grabbed the parrot and violently threw it into his bag of holding. Then he smiled wryly and collected up the Spirit Fruit. He quickly popped it into his mouth, then transformed into a beam of light and shot up into the air.</p><br/><p>“What’s going on in this place!” he yelled loudly. “I can’t stay here!” He immediately shot off into the distance. Even as he did, the area he had just been in collapsed into a huge crater.</p><br/><p>The ground trembled and shook, and huge waves surged across the sea. Patriarch Reliance was completely in a rage; his fury was burning to a shocking level. Although he couldn’t do anything to Meng Hao, he still couldn’t accept such humiliation. He was just on the verge of revealing his true self to swallow up the parrot, when Guyiding Tri’rain came running over. She grabbed Patriarch Reliance’s arm.</p><br/><p>“Patriarch, calm down!” she said. “Think about what’s most important!”</p><br/><p>“Go away! The Patriarch is gonna go all out with this guy!” Patriarch Reliance took a few steps forward. A rumbling sound filled the air as the palace opened up to reveal the lands of Saint’s Island stretching out below.</p><br/><p>“Patriarch, think three times before you act!” urged Guyiding Tri’rain. “Meng Hao’s already gone! If you reveal yourself now, you’ll undo all your previous hard work!”</p><br/><p>Patriarch Reliance stopped in place with his foot in the air. Veins bulged out on his face, and his entire person resembled a volcano that might erupt at any moment. His face twisted with struggle; on one hand, he was thinking about the happiness he could enjoy in the future. At the same time, he was thinking about the revenge that needed to be exacted for what the parrot had done to him.</p><br/><p>In the midst of his struggle, he stomped his foot down. Forcing himself to endure everything, his body trembled and his head seemed about to explode. Clearly, his restraint had reached its very limits.</p><br/><p>Patriarch Reliance could feel an indescribable fire burning inside of him. He felt as if he had to find someone to beat up to vent the rage and toxic anger that raged in his heart.</p><br/><p>As he forced himself to continue to be patient, Saint’s Island ceased trembling, and the sea returned to calmness. Meng Hao transformed into a beam of light that shot through the air. His face was unsightly, but his internal injuries were now healing at a shockingly fast rate.</p><br/><p>In the time it takes an incense stick to burn, all the pores on Meng Hao’s body seemed to have opened. The injuries inside of him were healed, and an intense coldness rushed out through his skin into the air, transforming into flakes of black snow that drifted in the air.</p><br/><p>Meng Hao took a deep breath and increased his speed. His mind spun with countless ideas as he tried to come up with more reasons to stay on the island. However, he knew that Patriarch Reliance’s rage had been kindled to its peak, and the slightest mistake on his part could cause it to explode out.</p><br/><p>If that happened, Patriarch Reliance would definitely run away again, and that did not fit in with Meng Hao’s plan.</p><br/><p>“It’s all the fault of that bastard parrot. It ruined my big plan.” He sighed as he neared the border region of the island. He decided to slow down a bit, but when he did, the land beneath him would quake and the nearby mountains would collapse.</p><br/><p>Meng Hao smiled bitterly and then continued to speed along. Soon, he saw the sea off in the distance, as well as the last Cultivator city of Saint’s Island. Right now it was day, and the city should have been bustling with noise and excitement, but instead, all the shops were closed.</p><br/><p>“Patriarch turtle, you’ve pushed me into a corner!” cursed Meng Hao inwardly. He clenched his teeth and then suddenly stopped in mid-air. His eyes began to glow with an intense light, and his expression was incredibly grim.</p><br/><p>The look on his face caused Patriarch Reliance’s fuming heart to suddenly begin to thump.</p><br/><p>“I’ve been hiding in this ancient palace for years,” he thought, “completely cut off from anything to do with the Demon Sealers. He shouldn’t be able to sense me…. Not good, not good! Maybe what I did just now was too obvious! When you add in the fact that I couldn’t control my temper, maybe the little bastard saw through it all!!”</p><br/><p>Meng Hao looked around, his face grim. Finally, he spoke in a cold voice: “I’m not sure which member of the senior generation in this place doesn’t want Meng Hao to stick around. Fine, I’m leaving!”</p><br/><p>Complete silence was the only response.</p><br/><p>When Patriarch Reliance heard Meng Hao’s words, he immediately heaved a sigh of relief.</p><br/><p>“So, he doesn’t know I’m here. He actually thinks I’m someone else. Alright, that will do.”</p><br/><p>Meng Hao glanced around before his gaze finally came to rest on the city up ahead. He lifted his hand up and pointed at it.</p><br/><p>“However, I’m lacking in Spirit Stones, and happen to have a random assortment of magical items in my bag of holding. I’ll sell them in this city, and as soon as I’m finished, I’ll leave this place!” With that, Meng Hao flicked his sleeve and headed toward the city.</p><br/>\n</div>"}