{"title": "Chapter 641: Who Would Outdo.", "id": 641, "volume": 7, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-641-who-would-outdo", "volume_title": "Volume 7", "body": "<h1>Chapter 641: Who Would Outdo.</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 641: Who Would Outdo….</strong></p><br/><p>“What… what are you trying to pull?!” cried Patriarch Reliance. The old man he was controlling trembled as he pointed at Meng Hao and nearly coughed up a mouthful of blood.</p><br/><p>Back in the palace, Patriarch Reliance stamped his feet with fury and let loose a torrent of cursing. His fury surged to the Heavens, and he seemed on the verge of going insane.</p><br/><p>“You little bastard! You, you, you… you have no money?! Then what are you doing!?</p><br/><p>“You have no money and then try to buy so many things?! Dammit! You have no money?! The Patriarch just gave you 30,000 Spirit Stones!? 30,000!! 30,000 whole Spirit Stones!! The Patriarch lived a bitter, frugal life to save up all those Spirit Stones!” Years ago, Meng Hao had defied all sorts of difficulties and danger to attract all the Cultivators from the State of Zhao to the Reliance Sect to free Patriarch Reliance. At that time, Patriarch Reliance’s heart had filled with joy. However, he had only rewarded Meng Hao with a single low-grade Spirit Stone. From that could be seen the level of stinginess which had long since become a part of Patriarch Reliance’s very being.</p><br/><p>“Furthermore, every item in that shop belongs to the Patriarch! You have no money and want to buy everything? Ridiculous!!”</p><br/><p>Seeing Patriarch Reliance raving the way that he was caused Guyiding Tri’rain to purse her lips. However, her expression quickly returned to normal, except for the glint of shrewdness in her eyes.</p><br/><p>“The old turtle really is looking for trouble,” she thought, feeling a bit sorry for Patriarch Reliance. “Meng Hao conned the entire State of Zhao back then. There are people who still remember that down to this day. And yet the old turtle is still trying to match wits with Meng Hao? He’s simply looking for trouble….</p><br/><p>“Although, you can’t really blame the old turtle. He’s getting old, and his brain is somewhat addled. Perhaps it’s because he was beaten in the head when he was young?” The more she thought about the matter, and of all the things that had happened in the past years, the more she couldn’t help but feel a little sorry for Patriarch Reliance.</p><br/><p>Of course, Meng Hao had no way to see or even know what was going on in the palace. He looked apologetically at the old man who stood in front of him.</p><br/><p>“How about this,” he said, sounding a bit embarrassed. “How about I do some work for you? I’m sure that in a few dozen years, I can clear all of my debt! Yeah… I’m pretty good at concocting medicinal pills.”</p><br/><p>Patriarch Reliance, in the form of the old man, stared fixedly at Meng Hao. He began to pant, and it almost seemed as if steam was rising from the top of his head…. Inside his mind, two people suddenly appeared. One of them was giving advice, and the other was venting angrily.</p><br/><p>“Alright Patriarch, it’s time to risk it all!”</p><br/><p>“No way! I’ve worked so hard, and almost pulled it off! I’m just about to succeed! I just have to hold on a little bit more! A little bit more is all! Then, I’ll finally be able to gaze upon hope!</p><br/><p>“The sunshine always comes after the storm!!” Even as Patriarch Reliance was feeling conflicted, Meng Hao cleared his throat.</p><br/><p>“Or, maybe I just shouldn’t buy these things,” he said. “I think I should go browse some of the other shops. I’ll try to finish going through them all within a year. After that I’ll head over to the other cities….”</p><br/><p>These words were like a trump card that Patriarch Reliance couldn’t match.</p><br/><p>“How much money do you have?” he asked through gritted teeth.</p><br/><p>Meng Hao blushed. “I have 5,000 Spirit Stones in my bag of holding.”</p><br/><p>“You….” Patriarch Reliance almost screamed out that he had just given Meng Hao 30,000 Spirit Stones. However, he suppressed his heart for a long moment; he felt as if he had just been stabbed through, and there was no blood left to ooze out….</p><br/><p>“Ha ha….” he said through clenched teeth. However, to achieve his goal, he had no choice but to continue to endure. Even if it caused Meng Hao become somewhat suspicious, he had no choice. After forcing out his laugh, he said, “You’re… you’re really lucky!! Today is… our opening-day celebration! We have a huge… sale! 5,000 Spirit Stones gets you everything in the store!”</p><br/><p>Eyes sparkling, Meng Hao quickly placed 5,000 Spirit Stones in front of the old man, then collected together all of the magical items into his bag of holding. Then he smiled and gave a light sigh.</p><br/><p>“The people of Saint’s Island, and especially the members of the Footloose Sect, are all good people,” he said. With that, he spun and left, flying directly up into the air and shooting off into the distance.</p><br/><p>When Patriarch Reliance saw this, his deeply injured spirit was finally able to recover a bit.</p><br/><p>“As long as you leave, that’s all that matters…. Just go!” he said, gnashing his teeth. “You little bastard! I don’t ever want to see you ever again in my life!” He gradually calmed his mood, then stopped thinking about Spirit Stones and magical items. If he did, he was worried that he might not be able to take it and then explode with fury.</p><br/><p>However, even as Patriarch Reliance struggled to improve his mood, Meng Hao suddenly stopped flying. He looked down as he noticed a second city down below.</p><br/><p>When he saw this second city, a smile appeared on his face.</p><br/><p>Currently, it was the middle of the night, and yet, the city was still filled with bright lights and activity. Even at this hour, the shops weren’t closed. The whole city was bustling, making the entire city seem like a bright, dazzling pearl.</p><br/><p>Patriarch Reliance: “……….”</p><br/><p>He stared blankly, veins popping up on his forehead.</p><br/><p>Then he saw Meng Hao shamelessly floating down toward the city, and he couldn’t take it any more. He finally exploded.</p><br/><p>“Ridiculous!!! Shameless!!!” he bellowed, causing the entire palace to shake. He waved his right hand in front of him, causing countless streams of Divine Sense to shoot out. They sped toward the city and immediately entered the various shops.</p><br/><p>Before Meng Hao could even get close, all of the shops in the entire city suddenly closed their doors and turned out the lights.</p><br/><p>It was the middle of the night, so the previously brightly lit city was suddenly cast into darkness. Of course, everyone within the city noticed this and was instantly alarmed.</p><br/><p>Up in mid-air, Meng Hao’s face twitched a bit.</p><br/><p>“That damned old turtle,” he thought. “All I took was a few Spirit Stones and magical items. In total, it’s only worth a few tens of thousands of Spirit Stones!</p><br/><p>“The old turtle is far too stingy. After all these years, he still hasn’t changed. I bet that right now, he’s in such pain that he wants to die.</p><br/><p>“He wants me to leave, and is worried that I’ll plunder him even more, so he instantly caused all the shops to close. Shameless! Completely shameless!!” Meng Hao hovered indignantly up in the air, staring down at the city for a long moment. Then, he continued to fly.</p><br/><p>Back in the palace, an unprecedentedly wide smile appeared on Patriarch Reliance’s face, as well as a look of intense pride as he reveled in his superior intellect. Patriarch Reliance currently felt incredibly refreshed.</p><br/><p>“Little bastard! No matter how crafty you are, you can’t outsmart the Patriarch!</p><br/><p>“As usual, the Patriarch is the most intelligent! How else could I come up with so many plans? Hahaha! Let’s see what you try to do now!” By now, he had long since forgotten that he was trying to hide. Nor did he consider that such overt actions might cause Meng Hao to be suspicious.</p><br/><p>His complacency had reached the pinnacle, and the feeling of finally being able to vent his frustrations gave him a bit of hope. Hope to see Meng Hao finally leave!</p><br/><p>“No matter where you go, I’ll just close all the shops! Let’s see what other reason you could possibly come up with to stay here!” Patriarch Reliance’s eyes sparkled as he glanced over at Guyiding Tri’rain.</p><br/><p>“Well, what do you say? Is the Patriarch clever, or not?”</p><br/><p>Guyiding Tri’rain blinked, then smiled. “The Patriarch is definitely brilliant.”</p><br/><p>Patriarch Reliance seemed more pleased than ever, and his smile grew even wider.</p><br/><p>As for Meng Hao, he frowned as he flew through the air. About an hour later, he suddenly stopped in place, then looked down toward a mountain down below.</p><br/><p>As soon as he even glanced at it, a rumbling sound suddenly filled the air as the entire mountain collapsed right in front of his eyes.</p><br/><p>Meng Hao stared in shock. This time, it was true and utter shock.</p><br/><p>“Patriarch Reliance!” he thought, “Aren’t you being a bit too obvious, bitch? Can’t you pretend even a little bit? Dammit! What do you want me to do? Pretend that I don't notice? Pretend that I do?” Meng Hao was conflicted about exactly what course of action to take.</p><br/><p>If he pretended not to notice anything suspicious, that would be too obvious….</p><br/><p>But if he pretended to notice something fishy, then it would also tip off Patriarch Reliance. In Meng Hao’s opinion, Patriarch Reliance was so unreliable, there was no way to know how he might flip out if that happened.</p><br/><p>“If I scare him too much,” Meng Hao thought, “he might just take this whole place with him and run away at top speed. This time, I have to make sure he doesn’t flee.” Meng Hao really was unsure of what to do. Inwardly, he cursed the 10th Wang Clan Patriarch. How could a Dao Seeking Cultivator be so slow? Meng Hao had already let his aura begin to emanate out, and yet the old man still hadn’t come looking for him yet.</p><br/><p>Meng Hao was consumed with the desire to beat the living daylights out of the old turtle. Currently, he just couldn’t think of how to deal with the unreliable Patriarch Reliance.</p><br/><p>Even as he went back and forth in his mind, he continued to proceed forward. However, he quickly found that if he stopped for even a moment, nearby mountains would collapse; even the rivers would change their course.</p><br/><p>Almost everywhere he went rapidly turned into flatlands.</p><br/><p>“Could there possibly be anybody more unreliable…?” Meng Hao thought. “If things keep going on like this, even if I really did beat him in the head in the Demon Immortal Pagoda, he should be able to understand that I’ll notice things are obviously off.” Meng Hao hesitated for another moment before his eyes began to glitter. At this point, he completely ceased suppressing his internal injuries. He let out a blood-curdling scream and then coughed up a mouthful of blood.</p><br/><p>His face immediately went pale.</p><br/><p>“My injury is playing up again!” he cried loudly. Bowing his head, he sank down toward the ground, picking a random area to sit down cross-legged to meditate and treat his injuries.</p><br/><p>His injuries truly were not completely healed. They were only healed by approximately seventy percent. The remaining thirty percent were filled with the power of Dao Seeking, which was very difficult to heal with the Violet Pupil Transformation.</p><br/><p>According to his calculations, the final thirty percent would take years to completely heal using his current method. Therefore, he didn’t mind allowing the old turtle to see that the injuries and the blood were very real.</p><br/><p>“In order to deal with this unreliable old turtle,” he thought, grinding his teeth, “I just have to be more shameless than him. In that case, you bastard, I’ll just stay here indefinitely!”</p><br/><p>Now it was Patriarch Reliance’s turn to be stunned. He rubbed his eyes vigorously as he watched Meng Hao sit down cross-legged to meditate. Then his eyes began to shine brightly as he saw that Meng Hao truly did have serious internal injuries.</p><br/><p>Patriarch Reliance began to pant. He stared for a long moment, then grabbed at his long hair and began to pull it hard. He paced back and forth within the palace, his face unsightly to the extreme, looking like a volcano that was about to explode.</p><br/><p>“Dammit! Who was it that hurt him!? Why didn’t you just directly kill him?! Why leave an injury like that to flare up at a time like this?!</p><br/><p>“What do I do? What is the Patriarch supposed to do…? That injury won’t be healed for years. After everything I’ve done so far, just when I was about to succeed, then this kind of thing has to happen!” Patriarch Reliance ground his teeth. Inwardly, his hatred toward whoever had injured Meng Hao continued to grow.</p><br/><p>Guyiding Tri’rain almost couldn’t stop herself from bursting out laughing. Right now, she almost couldn't take it any more. She had to know, which of these two unreliable fellows would outdo the other….</p><br/><p>-----</p><br/><p><em>This chapter was sponsored by Dan Gabber, Ng Inn Shan, Davis Won, Patrascu Gabi, Michael Tashkoff, Anonymous, Hal, Kari Yi, Griff-And-Or, Costin C, Arkanth, Sailesh, Tomáš Jílek, Suneil Patel, Alessio Bastardi, and LB</em></p><br/>\n</div>"}