{"title": "Chapter 645: Shameless Old Turtle!", "id": 645, "volume": 7, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-645-shameless-old-turtle", "volume_title": "Volume 7", "body": "<h1>Chapter 645: Shameless Old Turtle!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 645: Shameless Old Turtle!</strong></p><br/><p>As soon as Patriarch Reliance appeared on the outside, all of Saint’s Island trembled. He wore a long azure robe, and his hair swayed in the wind. He looked ancient, but his eyes glowed with a bright light, and veins bulged out on his forehead. The anger and fury within him had reached the point that they absolutely had to be vented.</p><br/><p>In a single step, he crossed half of Saint’s Island to appear in front of Meng Hao, directly between him and the 10th Wang Clan Patriarch!</p><br/><p>He lifted his right hand, and instantly, a sheet of steam rose up. It emanated shocking Demonic Qi, as well as prismatic light. Instantly, the 10th Wang Clan Patriarch’s palm slammed into it.</p><br/><p>“I’m the Patriarch! Now screw off!” he raged, lifting his head up and roaring. His voice echoed out in all directions like thunder.</p><br/><p>The mist and the palm slammed into each other, causing an enormous roaring to fill the air. Patriarch Reliance was sent tumbling backward, as if a raging wind had just swept over him. When he looked up, a vicious expression filled his eyes.</p><br/><p>The 10th Wang Clan Patriarch also trembled, and his eyes gleamed brightly. But then, he gave a cold laugh.</p><br/><p>“A trifling Spirit Severing Cultivator?” he said coolly. “Child, this is the person you are relying on? Allow me to destroy him, and your hope along with him!” From the way he spoke, destroying Patriarch Reliance would be incredibly easy for him.</p><br/><p>Actually, from his point of view, destroying a Spirit Severing Cultivator truly was a simple matter. In fact, normally speaking, Meng Hao could not have stood up to him for even half a moment. The only reason he could was that the 10th Wang patriarch needed to be very careful not to kill him. If he killed him, it would be impossible to steal his Dao foundation.</p><br/><p>Truth be told, the Wang Patriarch had many Daoist magics that could easily destroy everything in sight.</p><br/><p>“I am a Patriarch of the Wang Clan. An ancestor of the Clan invented three finger attacks, two of which have since become lost arts. However, the Extermination Finger is still being passed down via legacy.” With that, the 10th Wang Clan Patriarch waved his finger in the air. It seemed to possess the power of extermination; the life force of all living things instantly began to wither under the power of the finger attack.</p><br/><p>Meng Hao’s eyes flickered as he sensed his own life force rapidly fading. A cold light suddenly appeared in his eyes as he fell back yet again. Having just gained enlightenment regarding the vibration technique, a hundred vibrations instantly appeared within him, locking down his life force so that the withering effect was instantly slowed down.</p><br/><p>“Now is not the time to leave,” thought Meng Hao, countless thoughts racing through his mind. “I need to wait a bit longer, until the fight between old turtle Reliance and the Wang Clan bastard reaches the peak. When the true flames of fury flare, that is the time to flee.” The entire reason he had stayed on Saint’s Island was to attack the 10th Wang Clan Patriarch here, and use Patriarch Reliance’s power to destroy him, thus giving himself a way out of his current crisis.</p><br/><p>Guyiding Tri-rain stood next to him, a serious look on her face. As for the Boat Spirit, his eyes shone brightly as he stood protectively off to the side.</p><br/><p>Because of the transformations occurring in Heaven and Earth, and the quaking of Saint’s Island, the experts of the Footloose Sect sped over as fast as possible. They knew that they were flying into danger, but the rules of the Footloose Sect were very strict. Seniority was the most important thing of all. If the Patriarch was in battle, then it didn’t matter that they couldn’t match up to him, unless he specifically ordered them away, they were required to come.</p><br/><p>Most nervous of all was the Nascent Soul Cultivator down below, the one who had tried to rob Meng Hao. He was shaking violently, and his eyes were as wide as saucers. Everything that was happening caused him to breath rapidly. His mind spun, and he had lost the ability to even think. It didn’t matter if it was Meng Hao, Patriarch Reliance, or the 10th Wang Clan Patriarch, none of them were people that he could even come into contact with. To the Nascent Soul Cultivator, getting involved in this conflict was clearly the most unlucky thing that had ever happened to him in in his entire life.</p><br/><p>Heaven and Earth were sinking into extermination. The finger attack of the 10th Wang Clan Patriarch caused the entire world to turn gray. The only thing that had color was the Wang Clan Patriarch himself.</p><br/><p>The finger descended, and the world shook.</p><br/><p>Patriarch Reliance’s eyebrows shot up, and he performed an incantation with his right hand. Instantly, Demonic Qi swept out.</p><br/><p>“What dog crap Extermination Finger are you talking about?!” he said. “The Patriarch has never heard of any such thing. Demonic Art, Heaven and Earth Cleaving!” Patriarch Reliance also waved a finger. From the look of it, his fingernail became the Heaven, and the flesh of the finger became the Earth. As for the tip of the finger, it transformed into something that looked like a sharp blade which could cleave both Heaven and Earth.</p><br/><p>Both finger attacks slammed into each other in mid-air.</p><br/><p>BOOM!</p><br/><p>The massive explosion caused the Nascent Soul Cultivator down below to cough up blood as he was sent spinning backward. Meng Hao fell back, his eyes glittering as he saw the plants around him rapidly wilting and drying up. As for Patriarch Reliance, starting with his extended finger, his entire body began to shrivel.</p><br/><p>In the blink of an eye, his hair had fallen off, and his entire body was emaciated. He almost looked like a desiccated corpse. Then, a pop could be heard as he exploded, transforming into countless dots of light that floated away.</p><br/><p>The 10th Wang Clan Patriarch’s expression was the same as ever. He seemed to have utmost confidence in his finger attack just now.</p><br/><p>“That’s who you were relying on?” he asked coolly. He looked over at Meng Hao with eyes full of ridicule.</p><br/><p>Meng Hao’s expression was calm. Next to him, Guyiding Tri-rain’s expression was similar. This caused the 10th Wang Clan Patriarch to gape in shock. He obviously could tell that something was not quite right. Just as he was about to take a step forward, a shocking roar suddenly filled the air.</p><br/><p>“Dammit! This bastard actually dared to extinguish the Patriarch’s clone!?” Instantly, a pulsing cloud of steam appeared out of nowhere, which gradually reformed back into the shape of Patriarch Reliance.</p><br/><p>This new Patriarch Reliance’s Cultivation base was a bit weaker than before. As soon as he appeared, his rage boiled up into the sky, and a demented gleam appeared in his eyes. He instantly shot forward.</p><br/><p>“With me here,” he roared, “nobody can kill that little bas… er, ahem, nobody can kill Meng Hao!”</p><br/><p>If he hadn’t spoken such words, then Meng Hao wouldn’t have taken anything to be amiss. However, as soon as the words left his mouth, Meng Hao’s heart started to pound with fear, and his face flickered. He absolutely did not believe that Patriarch Reliance would utter such words and truly mean them.</p><br/><p>“Dammit, what technique has the old turtle come up with to get out of the Demon Seal…?</p><br/><p>“It must have something to do with the words he just spoke. Don’t tell me that whatever technique he’s using can actually get out of having to fight here?” Meng Hao was no longer the unseasoned Cultivator he had been long ago. After everything he had experienced, he had long since honed his powers of reasoning. Based on Patriarch Reliance’s words just now, he could obviously pick up on some clues as to what was going on.</p><br/><p>Even as Meng Hao’s mind was racing with countless thoughts, Patriarch Reliance neared and then stood between him and the 10th Wang Clan Patriarch. He flicked his sleeve.</p><br/><p>“Meng Hao, get out of here!” he said, then charged once more toward the 10th Wang Clan Patriarch.</p><br/><p>Meng Hao shivered and then began to pant slightly. The 10th Wang Clan Patriarch gave a cold snort and took a step forward, then once again attacked with his Extermination Finger.</p><br/><p>As before, the finger attack caused everything to turn gray, and all life to be destroyed. Patriarch Reliance lifted his head up and let out an indignant howl.</p><br/><p>“Life is to be treasured! Promises are even more eternal! I am Patriarch Reliance, and I promised to be Meng Hao’s Dao Protector! Even if I am torn into a thousand pieces, I will abide by my promise!”</p><br/><p>Seemingly completely unafraid of death, Patriarch Reliance charged forward. He seemed to prefer to die in battle to block the momentum of the 10th Wang Clan Patriarch. As he charged forward, he performed an incantation gesture, unleashing a Demonic art as he fearlessly attacked.</p><br/><p>Anyone who was watching would definitely feel the complete and utter valiance on display. Giving up one’s life to keep a promise; such were the actions of a true man!</p><br/><p>However, Meng Hao understood Patriarch Reliance all too well. He knew that the damned old turtle would never act like this. Sweat began to pour down his forehead as a very bad feeling filled his heart.</p><br/><p>Without hesitation, he cast aside his previous plan and began to flee in the opposite direction. Guyiding Tri’rain looked at fleeing Meng Hao, and then back at Patriarch Reliance as he seemed to face death unflinchingly. Then she sighed.</p><br/><p>BANG!</p><br/><p>Under the power of the Extermination Finger, Patriarch Reliance’s body withered rapidly and then collapsed into pieces.</p><br/><p>However, at the same time, a roar suddenly could be heard. The mist formed together again, once more turning into Patriarch Reliance. Yet again, he risked death to block the way of the 10th Wang Clan Patriarch.</p><br/><p>“I can die with no regrets, but Meng Hao… must not die!” cried Patriarch Reliance. “That is my promise from years ago!”</p><br/><p>A strange glow appeared in the eyes of the 10th Wang Clan Patriarch as he looked at Patriarch Reliance.</p><br/><p>“So, a promise truly can give rise to someone so brave as to use their own essence to come back to life in this way!” From the perspective of the Wang Clan Patriarch, Patriarch Reliance must be drawing on the essence of his true self to return to life.</p><br/><p>To Cultivators of his realm, one’s essence was the most prized of all possessions. Wasting it could lead to severe injury that would be difficult to recover from. It truly was extremely precious.</p><br/><p>A look of respect appeared in the eyes of the 10th Wang Clan Patriarch. He suddenly realized that if this Patriarch Reliance were a member of his own Clan, then he would definitely make an excellent guard.</p><br/><p>Meng Hao was cursing inwardly. By now, he had realized exactly what Patriarch Reliance was doing. Currently, Meng Hao employed all the speed he could muster to flee, although he wished he could move thousands of times faster.</p><br/><p>“Hahaha!” thought Patriarch Reliance. “It turns out this method is working after all. The Patriarch is the most intelligent yet again! The Demon Seal only requires that I become a Dao Protector. Dao Protector, huh. That just means protecting! And the true meaning of Dao is to temper oneself. Therefore, the identity of a Dao Protector doesn’t mean I have to prevent the little bastard from dying. All I have to do is protect him a bit. If any accidents happen, as long as I’m trying hard, then it won’t matter.</p><br/><p>“And I’m already trying hard! This might just be a clone, but I did have to expend some essence, right?! As for the Demon Seal, it shouldn’t be too much of a problem. Hahaha! The Patriarch is far too intelligent!</p><br/><p>“This time, it won’t count as defying the Demon Seal!” Patriarch Reliance felt quite proud of himself. On the outside, though, he looked furious. He seemed to be going all out to block the way of the 10th Wang Clan Patriarch. Once again, his body withered and then collapsed.</p><br/><p>The next time he appeared, he was even weaker than before. By now, the 10th Wang Clan Patriarch was truly in admiration of Patriarch Reliance’s loyalty. This time, when Patriarch Reliance’s body withered away, the Wang Clan Patriarch didn’t wait for it to reform before shooting off to pursue Meng Hao.</p><br/><p>When Patriarch Reliance reappeared, he was extremely weak. In fact, his body was so shapeless that the illusory image of his true self could actually be seen.</p><br/><p>He now looked like a fearsome turtle, who stood there watching as the 10th Wang Clan Patriarch chased after Meng Hao.</p><br/><p>His expression one of incredible grief and indignation, Patriarch Reliance shouted, “Don’t kill him! Kill me instead!” Inside, Patriarch was laughing up a storm, but on the outside, his eyes were bloodshot. He lifted his head up to roar, and then offered pursuit.</p><br/><p>“Kill me, okay?! I have to keep my promise even if I die. Don’t kill him!! I’m not just his Dao Protector, I’m his Patriarch! He is the highest ranking disciple in the Footloose Sect next to me! He is my equal, the future and hope of the Footloose Sect. You are not permitted to kill him!”</p><br/><p>“Shameless!!” growled Meng Hao through clenched teeth. Without hesitation, he pulled out the good luck charm and was about to press down on it hard, when suddenly…</p><br/><p>The 10th Wang Clan Patriarch turned his head. There, he saw Patriarch Reliance, looking both complacent and indignant. He was in turtle form now, and his eyes glowed with a strange light.</p><br/><p>The 10th Wang Clan Patriarch was moved. “I’ve seen many Demon beasts in my life, but this is definitely… the most loyal one I’ve ever encountered!”</p><br/>\n</div>"}