{"title": "Chapter 656: The Resurrection Lily Makes a Move!", "id": 656, "volume": 7, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-656-the-resurrection-lily-makes-a-move", "volume_title": "Volume 7", "body": "<h1>Chapter 656: The Resurrection Lily Makes a Move!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Meng Hao was under the water, surrounded by 20,000 magical symbols which swept around him in the form of a tempest. The water seethed, and the Sea Demons were unable to get within even three hundred meters of him.</p><br/><p>Of course, the Sea Demons attacked with reckless abandon, impelled by instinct to fight even if they died. Meng Hao’s eyes flickered as the magical symbols surged around him, carrying out an incredible slaughter.</p><br/><p>Waves surged out, affecting more than half of the Third Ring, and more and more Sea Demons arrived. Soon, even the Third Ring’s Seahold city was affected, causing even more Cultivators to look around in shock and wonder what was occurring.</p><br/><p>In fact, the waves even crashed into Seahold, the city created by the joint efforts of the three Sects. The sounds of bugles filled the air, and the Cultivators garrisoned there armed themselves and entered battle formation, as if they were preparing to fight some incredible enemy.</p><br/><p>The powerful experts within the city emerged one by one, their faces grim and filled with intense harshness. They looked off into the distance at the countless waves that surged toward them.</p><br/><p>“Could it be that the Sea Devils of the Second Ring are on the attack?”</p><br/><p>“Impossible! The Sea Devils of the Second Ring are few in number. They rarely appear, and almost never enter the Third Ring. To them, the Sea Demons of the Third Ring are like common animals. They view themselves as the emperors and kings!”</p><br/><p>“But if it’s not the Sea Devils, then what is causing these great transformations in the Third Ring?!”</p><br/><p>Everyone was discussing the matter, and as soon as the Sea Devils were mentioned, faces filled with fear.</p><br/><p>Outside the city, crashing sounds could be heard as the waves slammed into the city walls.</p><br/><p>The sounds could be heard without cessation, and echoed throughout the city, causing the Cultivator’s faces to flicker with various expressions.</p><br/><p>In the middle of Seahold was an enormous tower nearly three thousand meters tall. The areas surrounding the tower were a forbidden zone which no one could enter without being invited first.</p><br/><p>This was a cultivation area set aside for the three Saints. At the highest level of the tower sat a middle-aged man wearing a voluminous red robe, who happened to be surnamed Lin. He had long black hair, and currently stood with his hands clasped behind his back, looking out a window. He was frowning, and it was impossible to tell exactly what he was thinking.</p><br/><p>“The waves are higher by three meters, and seemingly for no reason,” he said coolly. “It seems something has provoked the Sea Demons. They’re all heading in the same direction. Are they going to pay respects, or have they been summoned? Or enticed?” His eyes shone with a brilliant light, and as he spoke, his words seemed to cause ripples to spread out in the air.</p><br/><p>“In any case, the Sea Demons are not intelligent. It must be desire which is driving them!” He suddenly took a step forward, and then vanished. Shockingly, he reappeared outside of Seahold, far off in the distance. Waves surged beneath his feet as he clasped his hands behind his back and strode forward.</p><br/><p>With a single step, he vanished and then reappeared far, far off. Then he repeated the process. It was with incredible speed that he moved, a speed that a Nascent Soul Cultivator could never achieve, not even by bringing harm to their own life.</p><br/><p>At the same time that the red robed man proceeded forward, Meng Hao was surrounded by 20,000 surging magical symbols. Blood filled the water around him as countless Sea Demons were completely destroyed. He had no idea how many he had killed, but as he sank down deeper, the Sea Demons that surrounded him seemed endless.</p><br/><p>It was at this point that a five-colored bolt of lightning suddenly appeared, shooting through the hordes of Sea Demons. Wherever it went, Sea Demons directly exploded. The lightning itself seemed to be filled with the power to destroy Heaven and Earth. In the blink of an eye, it slammed into the magical symbols that surrounded Meng Hao.</p><br/><p>Boom!</p><br/><p>A thousand of the 20,000 magical symbols instantly collapsed. It shot onward toward Meng Hao, who immediately looked up. When the island collapsed and began to sink to the sea floor, he had already noticed the approaching Whitebone Lily jellyfish.</p><br/><p>However, after sinking down, despite being unhampered by the surroundings, he found himself in a different situation than when he had been in the Violet Sea. Here, his Divine Sense had limitations.</p><br/><p>Of course, he was as vigilant as ever, so as the lightning bore down on him, he lifted his right hand and pointed forward with his index finger. The Blood Palm instantly appeared and shot forward.</p><br/><p>A boom could be heard as the five-colored lightning bolt spread apart, surrounding the Blood Palm, as if it wished to bore directly into it.</p><br/><p>Meng Hao’s eyes glittered, and he let out a cold snort. He flicked his sleeve, performed an incantation, and then pointed forward. Immediately, a face appeared in front of him. It looked like Meng Hao’s face, although its eyes were closed as it shot forward. This, of course, was the first form of the Blood Immortal divine ability.</p><br/><p>Booming filled the bottom of the sea. As the lightning collapsed, the face’s eyes opened, and the lips began to speak with a soundless voice.</p><br/><p>The soundless voice seemed to rip the jellyfish out into the open. Six ripple-like formless sound waves swept out in front of Meng Hao. The first of them caused thousands of Sea Demons to instantly explode. The second, third, and fourth sweeping ripples caused more than 10,000 Sea Demons to collapse.</p><br/><p>The fourth and fifth ripples seemed to open a path that revealed the enormous jellyfish off in the distance. The Sea Demons in front of Meng Hao all scrambled clear as the sixth ripple shot directly toward the jellyfish. The water seethed and distorted to form the face of Meng Hao, which rumbled toward the jellyfish.</p><br/><p>A brilliant, five-colored glow spread out from the jelly-fish, which transformed into a five-colored shield that shot out in defense. A huge boom could be heard, which transformed into an even more intense attack that spread out in all directions. Meng Hao gave a cold snort, and was just about to directly slay the bizarre jellyfish when suddenly, he sensed an incredible force shooting toward him. The intensity of the force caused him to tremble inwardly. The magical symbol tempest around him shuddered, and another thousand symbols instantly collapsed.</p><br/><p>As the force neared Meng Hao, his eyes glittered. Giving up any plans to slay the jellyfish, he spun around. His right hand clenched into a fist, which then punched directly toward the incoming force.</p><br/><p>A bang could be heard, and the seawater exploded out in all directions. It was as if two enormous, incredibly shocking fists had slammed into each other in the middle of the water.</p><br/><p>A deep growl could be heard as an enormous figure retreated backward from the force of Meng Hao’s punch.</p><br/><p>It was at this point that Meng Hao could clearly see the Sea Demon that was the source of the powerful force from just now.</p><br/><p>It was a giant!</p><br/><p>A three thousand meter tall giant, with two heads and scale-covered skin that was completely blue. Its eyes, however, were bright red as it stared at Meng Hao.</p><br/><p>This was what had caused the island to collapse!</p><br/><p>Shockingly, located behind the giant could be seen a Whitebone Lily, swaying back and forth!</p><br/><p>The Whitebone Lily was a ghastly white color, and looked completely shocking. That was especially true because, when he looked at it, Meng Hao could almost see a human face, staring back at him with a strange expression.</p><br/><p>The gaze was filled with many emotions, with avarice and with… concentration, almost as if it were… staring at something like itself.</p><br/><p>Meng Hao’s eyes glittered. As of this point, he had seen two bizarre Sea Demons in the Milky Way Sea’s Third Ring, both of whom had strange Whitebone Lilies on them.</p><br/><p>In fact, when Meng Hao looked at the Whitebone Lily, he could clearly sense that the Resurrection Lily inside of him felt provoked, and even emanated the desire to attack.</p><br/><p>Apparently, the pressure from Meng Hao, as well as the intensity of the current danger, had caused it to intentionally allow some of its aura to seep out into his blood vessels.</p><br/><p>Meng Hao’s mind trembled. He had been fighting with the Resurrection Lily for years, and although he always succeeded in suppressing it, he only did so with the use of force. This was the first time that the Resurrection Lily had given up on any resistance, and merge its aura with Meng Hao of its own initiative.</p><br/><p>As the aura merged into him, a bizarre light appeared in Meng Hao’s eyes. He did not resist, but rather, allowed the aura of the Resurrection Lily to spread out within him. Instantly… a five-colored Resurrection Lily appeared behind him!</p><br/><p>The flower formed into a face that was split into two parts. One part looked like Meng Hao, as mild as jade; the other looked as vicious as a wicked spirit!</p><br/><p>Two faces, five petals, five glowing colors. In the blink of an eye, the light spread out to fill the sea floor. As it did, Meng Hao’s mind suddenly trembled, and a strange glow appeared in his eyes. As of that moment, he could… sense the energy of Heaven and Earth!</p><br/><p>This was not the first time he could sense the energy of Heaven and Earth, but this was the most direct connection he had ever felt. He almost felt… as if he were favored by Heaven and Earth, as if his existence was approved.</p><br/><p>With every breath he took, the power of Heaven and Earth flowed into him. Regardless of whether it was spiritual energy or Demonic Qi, or other types, anything that could be of benefit to him flowed in.</p><br/><p>The feeling was indescribable, as if Heaven and Earth would do anything for him.</p><br/><p>The power was boundless!</p><br/><p>It felt like his destiny grew deeper, as if the Heavens had opened their eyes to gaze upon him. It was like any living thing that wished to harm him would become an object of loathing to Heaven and Earth.</p><br/><p>The indescribable feeling was like a mysterious premonition.</p><br/><p>“The day the Resurrection Lily blooms with seven colors, flowers bloom and flowers descend, one thousand years…. Don’t tell me that it really is impossible to kill it!?” The realization hit Meng Hao, but he had no time for consideration at the moment.</p><br/><p>Almost in the same moment that the five-colored Resurrection Lily appeared behind him, the hosts of Sea Demons around him went into a frenzy. Their eyes were red, and seal marks appeared on their bodies.</p><br/><p>The seal resembled the face of a spirit, almost like the earliest version of the Resurrection Lily, except white. However, if you looked closely, you could see that it was not the Resurrection Lily, but, shockingly… a Whitebone Lily!</p><br/><p>“This Whitebone Lily definitely has some direct connection with the Resurrection Lily. But why are there so many Whitebone Lilies in the Milky Way Sea!? It seems like almost every single Sea Demon has one!” His mind trembled as he looked around at all of the Whitebone Lily seals, and his scalp began to grow numb.</p><br/><p>“I wonder if it has something to do with the Reverend Silverlamp of the Milky Way Sea that Master spoke of?!” Meng Hao’s face flickered as he once again looked around at the enormous giant and the jellyfish, and realized that they were different from the other Sea Demons.</p><br/><p>What existed on them was not a mark of the Whitebone Lily, but an actual, living flower.</p><br/><p>Currently, the two Whitebone Lilies were swaying back and forth, and looked as if they were about to bloom, each of them with three petals.</p><br/><p>-----</p><br/><p><em>This chapter was sponsored by Dang Quang Tran, John Smith, Sunny Goela, Dave Berkoh, Eric Layne, and Weevle</em></p><br/>\n</div>"}