{"title": "Chapter 651: My Dao Is Nigh!", "id": 651, "volume": 7, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-651-my-dao-is-nigh", "volume_title": "Volume 7", "body": "<h1>Chapter 651: My Dao Is Nigh!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 651: My Dao Is Nigh!</strong></p><br/><p>That ship, of course, was the Sun Soul Society ship who had listened to the ruckus caused by Meng Hao this entire time. Whether it was the three old men, the two calm youths, or the rest of the passengers, all of them were bewildered and filled with dread. Everyone wanted the ship to emerge from within the Stormwind Divide as soon as possible.</p><br/><p>During the past two months, they had heard the sounds of explosions more than twenty times. By now, they had all begun to speculate that it wasn’t a group of people trying to pass through the Stormwind Divide, but rather, a single individual!</p><br/><p>That person must be incredibly powerful, fearsome to the extreme in order to be able to brave the spell formation and not be destroyed.</p><br/><p>Most important of all was that the ship happened to have a Feng Shui compass that the three old men had pooled their power together to use a month previous.</p><br/><p>The Feng Shui compass was something rarely used on the ship. It had only one function; it could send out invisible waves into the Stormwind Divide, which would then cause a map of the area to appear on the surface of the compass. The map would reveal the location of any powerful spirit creatures formed of magical symbols.</p><br/><p>A month ago, they had used that function of the map to reveal the spirits, which were all represented in by white dots of light. The entire area around them was densely covered by such white dots. However, there in the middle of all of them… was a red dot!</p><br/><p>That red dot caused everyone to be filled with horrified astonishment.</p><br/><p>A red dot represented an outside Cultivator!</p><br/><p>Furthermore, during the past month, the white dots in the area had been significantly reduced. It seemed to indicate that the magical symbol spirits were intentionally avoiding the area. In addition, the red dot that represented the outside Cultivator only continued to grow brighter and more resplendent, like fresh blood. Everyone looked on with wide eyes, panting.</p><br/><p>That was even more the case when they realized… that the red dot was actually moving at high speed toward the yellow dot on the map. That yellow dot… represented the ship they were on! Panicked cries of alarm could be heard.</p><br/><p>“He’s coming!!”</p><br/><p>“The Cultivator who’s crossing the Stormwind Divide, he’s… heading right toward us!” The more than ten Cultivators aboard the ship were all pale-faced. Some of them even rose to their feet in terror, their faces filled with fear and awe of the unknown.</p><br/><p>The three old men in charge of the boat exchanged pale-faced glances. They could see the bitterness and complex emotions in each other’s eyes. The three of them could never have imagined that they would ever witness such a shocking scene.</p><br/><p>They didn’t know who this outsider was, but the three of them did know with complete certainty that anyone who could survive in the depths of the Stormwind Divide would most definitely be of the Spirit Severing stage!</p><br/><p>“Spirit Severing eccentrics have strange dispositions. If he kills all of us, the Sect wouldn’t do anything. It wouldn’t risk offending a Spirit Severing expert just for the likes of us three.”</p><br/><p>“Dammit! Why is this happening? If he wants to cross, fine, but why does he have to come after us…?”</p><br/><p>They sat there, perturbed. It was at this point that everyone watched in astonishment as a huge gust of wind from the Stormwind Divide suddenly blasted against the right side of the boat, causing the bloody glow that emanated up from the ship to dim, as if it were being completely covered up.</p><br/><p>Not a single sound could be heard onboard. Everyone sat there apprehensively, looking out in the direction of the gust of wind. The fog outside roiled, and a stifling pressure began to bear down on them.</p><br/><p>Soon, a green figure could be seen, striding forward through the air. His salt and pepper hair floated about him as he laid eyes on the ship. It was, of course, Meng Hao.</p><br/><p>Even as he caught sight of them, everyone on the ship looked at him.</p><br/><p>As soon as the three old men saw him, they began to tremble. “Third generation disciples of the Sun Soul Society offer greetings to you, senior,” they said in unison. The intense pressure radiating from Meng Hao caused them all to breath raggedly. They even felt the Nascent Souls inside of them quivering under the pressure.</p><br/><p>Intense terror began to build up inside of them, especially when Meng Hao looked directly at them. His gaze was like a sharp blade. It was almost like he could read their hearts and minds with a single glance. It was as if they were completely transparent in front of him. Without any hesitation, the three old men quickly clasped hands and bowed deeply</p><br/><p>At the same time, the more than ten passengers on the ship also clasped hands and bowed to Meng Hao.</p><br/><p>Meng Hao’s face was expressionless as he strode forward toward the ship. As he neared, a red shield suddenly sprang up, a defensive mechanism of the ship.</p><br/><p>When the shield sprang up, the three old men felt their hearts starting to pound, and their faces completely fell. Inwardly, they felt intense regret, and were sure that a misunderstanding was about to occur. Obviously, the shield wouldn’t be able to do anything to hinder an expert who could survive out in the Stormwind Divide. At the most, it might slow him down for a moment, but in the end, the unlucky ones in the whole matter would be themselves.</p><br/><p>They were about to try to lower the shield, but before they could, Meng Hao pushed directly into it. Zapping sounds could be heard, but his face was the same as usual as he walked through it.</p><br/><p>Most of the others on the ship actually couldn’t see what was happening, but the three old men couldn’t help but gasp with shock. They had never imagined that their shield would be so ineffective in blocking Meng Hao.</p><br/><p>What was happening completely exceeded their imaginations; they instantly dropped to their knees and kowtowed.</p><br/><p>There were others who noticed the strangeness of the goings on. The two calm youths had been to the Third Ring before, on more than one occasion. Therefore, they understood quite a bit more about the ship than the others. Currently, their faces flickered, and their hearts began to pound.</p><br/><p>Meng Hao said nothing. He boarded the ship, looked around, and then sat down cross-legged on the prow.</p><br/><p>He didn’t speak at first, and the rest of the people on the ship were as silent as cicadas during winter. The three old men didn’t dare to rise to their feet. The entire ship was quiet.</p><br/><p>After a bit of time passed, Meng Hao casually said, “Do you happen to have a map of the Third Ring?”</p><br/><p>Without the slightest hesitation, the three old men produced jade slips from their bags of holding and respectfully offered them to Meng Hao.</p><br/><p>Meng Hao accepted, glanced at the jade slips, and then eyed the Feng Shui compass off to the side. His eyes glittered, and he nodded.</p><br/><p>“You’re going to the Third Ring?” he asked.</p><br/><p>“Senior,” replied one of the three old men, “we are currently under orders to pilot this ship and deliver these passengers to the Seahold in the Third Ring.”</p><br/><p>“Would it be convenient for you to take me along?” asked Meng Hao coolly.</p><br/><p>“Senior, you are most welcome aboard our ship. Many thanks for staying to watch out for us. We members of the junior generation can’t thank you enough.” The three old men were attempting to be as respectful as possible, and in their fear of offending Meng Hao, spoke in a borderline fawning tone.</p><br/><p>“Well, let’s get moving,” said Meng Hao, closing his eyes.</p><br/><p>The three old men immediately voiced their agreement, then carefully rose to their feet. Inwardly breathing sighs of relief, they sent the ship forward at the highest speed possible. As they proceeded onward, no one dared to speak. The ship was completely quiet.</p><br/><p>The ship didn’t move as quickly as Meng Hao could move, but the advantage was the ease with which he could proceed. He sat there cross-legged, meditating for a few days. Then, he suddenly opened his eyes and looked over at the Feng Shui compass. There, he could clearly see that a thousand-symbol spirit was floating not too far off in the distance.</p><br/><p>After enough time passed for half an incense stick to burn, the thousand-symbol spirit was close enough to see with the naked eye. It looked like an iron chain floating there in the storm winds. It completely ignored the ship, although it occasionally attempted to consume lightning as it drifted about.</p><br/><p>Meng Hao suddenly stood up.</p><br/><p>“Stop the ship. Wait for me!” With that, he strode out. The three old men and the other passengers were shocked. They watched on as Meng Hao left the ship. Immediately, the iron chain appeared to sense him. It whipped around in his direction, and an intensely bleak killing will rose up to the Heavens. Suddenly, the lightning in the area turned red and shot whistling through the air toward Meng Hao.</p><br/><p>However, before the iron chain could even get near him, Meng Hao performed an incantation gesture. Instantly, the characters for metal, wood, water, fire, and earth appeared. As they surrounded the iron chain, Meng Hao stepped forward and punched.</p><br/><p>The iron chain collapsed, sending a thousand magical symbols spreading out in all directions. He then performed another incantation gesture, and the Mountain Consuming Incantation caused a thousand mountains to appear. They covered the magical symbols, then merged together to form a huge mountain peak. Next, the mountain peak shrank down into Meng Hao’s palm, where he sealed it.</p><br/><p>After putting it into his bag of holding, he spun around and returned to the ship.</p><br/><p>The entire spectacle only took ten breaths of time. Meng Hao’s actions were as natural and unforced as floating clouds and flowing water. Everything was completely efficient, as if he was completely used to doing such things. Everyone who watched on was thoroughly shaken.</p><br/><p>The people on the boat stared blankly, and the two Cultivators who had been to the Third Ring before were breathing heavily. They were well aware of how mighty a thousand-symbol spirit was, which caused their fear of Meng Hao reach a new peak.</p><br/><p>By now, they were absolutely certain the reason they had heard explosions more than twenty times in the past. Back then, they could never have imagined that it was a terrifying Cultivator who could subdue and capture magical symbol spirits.</p><br/><p>Most shocked of all were the three old men. They were disciples of the Sun Soul Society, and were far more knowledgeable about the Stormwind Divide than the others.</p><br/><p>Although others were unaware that the magical symbol spirits could be subdued, they were well aware of the fact. Every few hundred years, powerful experts from the three Sects would enter the spell formation under the leadership of a Patriarch, with the sole purpose of collecting magical symbol spirits. Such spirits were useful to the Patriarchs.</p><br/><p>Although no one knew exactly how the Patriarchs used them, it was known that the magical symbol spirits were the essence of the spell formation. That was especially true of the thousand-symbol spirits, which were comparable to Spirit Severing Cultivators. They were unpredictable and virtually indestructible; only the Three Saints were capable of subduing them.</p><br/><p>“S-s-senior… sir… how many thousand-symbol spirits have you acquired during your journey?” asked one of the three old men, his face pale, his voice quavering.</p><br/><p>“More than twenty,” replied Meng Hao from his position seated cross-legged on the prow. He glanced at the old man.</p><br/><p>“More than twenty!!” The old man’s face completely fell, and he began to pant. He suddenly turned to look at the other two old men and then roared, “Get the ship moving again! Top speed!!”</p><br/><p>They actually didn’t need any reminders. Having heard what Meng Hao said, they trembled, as if they had just thought of something even more terrifying than Meng Hao. They rotated their Cultivation bases at top speed to control the boat and push it forward as fast as it could.</p><br/><p>Meng Hao’s eyes flickered as he looked at the old man who had just spoken.</p><br/><p>The man looked back with a wry smile, and a face full of anxiety.</p><br/><p>“Senior, perhaps you are unaware that in a hundred year period, no more than five of the thousand-symbol spirits can be collected. That number can’t be exceeded, or else…. It will cause the yellow springs Underworld Ship to appear….</p><br/><p>“The yellow springs emerge, the Underworld Ship appears, Dao Seeking forbidden zone!”</p><br/><p>As soon as the old man spoke the words, the storm winds around them suddenly seemed to stop moving. The lightning stopped in mid-air, and the fog came to a standstill!</p><br/><p>It seemed almost as if time, as if the very natural laws of the Heaven and Earth, had suddenly become completely motionless.</p><br/><p>At the same time, an archaic voice could be heard. It was filled with an air of time; it sounded as if a veil of rot had been lifted. The hoarse voice echoed out from off in the distance.</p><br/><p>“Long ago, you chose to continue onward to the end, until there was nothing of you left….</p><br/><p>“Long ago, I chose to continue onward to the end, until only I was left….</p><br/><p>“Who am I? Who are you…? Unfathomable bleached bones. The beginnings of eras. My Dao… is nigh.”</p><br/>\n</div>"}