{"title": "Chapter 664: War Chariot!", "id": 664, "volume": 7, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-664-war-chariot", "volume_title": "Volume 7", "body": "<h1>Chapter 664: War Chariot!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 664: War Chariot!</strong></p><br/><p>“At the most, I can use it only ten more times.” Meng Hao examined the rust. It almost looked like rot, that, wherever it went, caused the bronze to turn into scrap metal.</p><br/><p>“I almost feel like I’m not using it properly,” he murmured to himself. “If using it damages it, then… huh?” Suddenly, his heart trembled.</p><br/><p>“Not using it properly?” His eyes glittered, and the trembling of his heart increased in intensity as he thought back to the scene revealed by Immortal Shows the Way, back in the Cloudburst Pavilion.</p><br/><p>After a moment’s thought, Meng Hao once more slapped the war chariot. Instantly, the beasts surrounding the war chariot vanished, and chariot began to shrink down. Soon it was yet again the size of an infant’s hand, resting on his palm.</p><br/><p>He floated there in mid-air, and after a moment of detailed inspection, he suddenly began to pick up on some clues.</p><br/><p>“Its surface is inscribed with ancient magical symbols that don’t seem to be an actual part of the war chariot….</p><br/><p>“And then there are the chain carvings. They don’t seem to merge perfectly with the original chariot, as if they were added later.” His eyes glittered for a moment before he suddenly closed his right eye. He blinked nine times and also unleashed the Immortal Qi of Immortal Shows the Way, pouring it into his eye. Immediately, the bronze war chariot’s appearance changed.</p><br/><p>It was no longer a war chariot, but rather, a mass of ferocious beasts. They were intertwined together such that, from a distance, they looked like a black wing!</p><br/><p>The black wing was indistinct, but Meng Hao was sure that it was actually the wing of a butterfly!</p><br/><p>His heart trembled, and he took a deep breath. He circulated some more Qi of Immortal Shows the Way, then focused closely… on the butterfly wing.</p><br/><p>The instant he looked at it, a roaring filled his mind. The world in front of him shattered, almost like a mirror breaking. Within that breaking, the mirror turned into countless flickering images that Meng Hao couldn’t see clearly.</p><br/><p>However, there was one image that instantly branded itself into his memories!</p><br/><p>He saw a land in which clouds roiled in the sky, filled with crackling lightning. A man wearing black garments stood in the war chariot, looking down coldly at the lands below.</p><br/><p>It almost seemed as if the man were the Heavens, the will of the sky itself.</p><br/><p>An interminably rotating vortex could be seen on his forehead, and in his right hand was a string of blank, white prayer beads that seemed to be waited to receive sealing marks.</p><br/><p>As for the war chariot in which the man stood, it looked very similar to the one Meng Hao had just recently acquired, except that there were no magical symbols on it.</p><br/><p>Beneath the war chariot was an endless sea, in the center of which was an enormous tree that towered up into the sky. Sitting at the crown of the tree was a small boy who smiled as he looked out over the world.</p><br/><p>Fluttering in the air around the boy were nine butterflies. Off in the distance were countless living things practicing cultivation. [1. This is not the first time nine butterflies have been mentioned in the story. If you don’t remember you can check out chapters 555, 587, 613 and 652]</p><br/><p>Everything was very quiet and peaceful….</p><br/><p>Meng Hao’s mind roared, and then the vision faded away. He panted, and a strange light gleamed in his eyes as he looked at the war chariot in his palm.</p><br/><p>“That vision….” His eyes flickered, and after taking a few breaths, he lifted up his left hand and pushed it down onto the bronze war chariot to slowly wipe away a magical symbol.</p><br/><p>In total, there were ninety-nine magical symbols on the war chariot.</p><br/><p>A gentle but also ferocious light rose up from Meng Hao’s hand. He continued to rub the war chariot until he finally succeeded in wiping away a magical symbol. By this point his face was pale. It didn’t seem difficult to wipe away the magical symbol, but actually, he had wasted a significant amount of Cultivation base power to do so.</p><br/><p>As soon as the magical symbol was wiped away, the bronze war chariot trembled. Sounds like howls erupted out from within, as if some ancient sleeping giant was suddenly beginning to awake.</p><br/><p>When the sound reached his ears, Meng Hao’s spirit was shaken.</p><br/><p>“These magical symbols and chains were actually added later. If it wasn’t done as a seal, then it was a method to try to control the chariot due to a lack of understanding of its proper usage.</p><br/><p>“That improper usage is actually the source of the damage!” He took a deep breath, and was just about to wipe away a second magical symbol when suddenly, his hand stopped, and a look of doubt could be seen in his eyes.</p><br/><p>“Why is it that only I could see the images on the war chariot? Anyone who saw them would know that something was different about it on the inside.” His eyes flickered as he looked down at his own torso.</p><br/><p>After a long moment, he slowly murmured, “Immortal Shows the Way…. Choumen Tai!”</p><br/><p>The reason he could see the images on the war chariot, and also know the correct way to use it, was all because of the Immortal Qi of Immortal Shows the Way.</p><br/><p>“Could it be that this is an Immortal treasure?” He thoughtfully lifted his left hand up again and began to slowly wipe away a second magical symbol.</p><br/><p>The bronze war chariot began to glow with even more intensity, and the howling from inside grew clearer.</p><br/><p>Next, Meng Hao wiped away a third magical symbol, then a fourth. When he wiped away the tenth magical symbol, the bronze war chariot began to emit a droning sound, and expanded until it was thirty meters large.</p><br/><p>The glow emanated out in all directions, as well as a pulsing pressure. Even Meng Hao could feel that he was affected by the intense pressure, which made it impossible to get close to the chariot; he was instantly forced back a bit.</p><br/><p>His eyes shining brightly; having erased ten magical symbols, his Cultivation base was virtually exhausted. After closing eyes for a while to recover, he frowned.</p><br/><p>“The more magical symbols I wipe away, the more difficult it gets.” His body flickered as he shot toward the war chariot. As he neared, a ring of yellow light suddenly appeared around the chariot.</p><br/><p>It quickly began to expand out, filling Meng Hao’s mind with a sense of danger. He shot backward, quickly emerging from within the yellow light. Then he forced out a bit of the Immortal Qi of Immortal Shows the Way to circulate through his body, then shot back in his original direction.</p><br/><p>This time, no circle of yellow light appeared. He moved with incredible speed, arriving at the war chariot in the blink of an eye. He didn’t have very much Immortal Qi in his body, and it wouldn’t last long before vanishing.</p><br/><p>He placed his hand onto the war chariot. After a moment of thought and rest, he rotated his Cultivation base, pouring power into the war chariot. However, the power seemed to disappear like a rock sinking down into the ocean. There was no reaction whatsoever from the war chariot.</p><br/><p>Meng Hao stilled his Cultivation base, and then, without the slightest hesitation, sent out some more Immortal Qi. It was only a sliver, but the instant it flowed out from his hand into the war chariot, the entire world seemed to start rumbling.</p><br/><p>A gigantic vortex appeared up in the sky, booming as it spun. Countless bolts of lightning crackled out in all directions. The entire area seemed to have suddenly gone wild, as if all Heaven and Earth were suddenly collapsing.</p><br/><p>Meng Hao suddenly felt as if he were fusing with the war chariot, becoming one with it. Then he saw the image of the black-clothed man with the vortex on his forehead, the one from his vision moments ago.</p><br/><p>At the same time, a thrumming sound could be heard from the chariot as the images of countless ferocious beasts appeared up ahead. All of them were fastened with chains, and let out soundless roars. They began to run forward, pulling the war chariot with them through the sky. It transformed into something like a shooting star that flew off into the distance with indescribable speed.</p><br/><p>The speed with which it moved caused rumbling booms to fill the sky as it shot forward. Yellow ripples emanated out, sweeping through the night sky, filling it with a yellow glow.</p><br/><p>At the moment, black-robed Saint Sun Soul suddenly stood up within the tower in Seahold. A look of astonishment appeared in his eyes as he suddenly vanished and then reappeared outside in mid-air. He looked off into the distance, his expression changing multiple times.</p><br/><p>“What magical item is that!?” he gasped. Moments ago, his Cultivation base had twitched with a feeling of terror. The feeling was not something he was completely unfamiliar with; it was something he might experience when facing the Sect’s ancestral legacy treasure.</p><br/><p>“Is that a legacy treasure?” he thought to himself.</p><br/><p>Meng Hao’s heart was filled with shock. The strand of Immortal Qi that he sent out from Immortal Shows the Way caused the war chariot to leave Seahold behind in the blink of an eye. Although there was still seawater underneath him, he had no way to tell whether or not he was still in the Third Ring.</p><br/><p>This stretch of sea looked very strange, and the waters, almost black. Everything was quiet; not even a single ripple could be seen on the surface of the water, much less any waves.</p><br/><p>“Where… where did that speed come from!?” said Meng Hao with a gasp. He looked down at the war chariot, a look of shock on his face.</p><br/><p>“This is a precious treasure!</p><br/><p>“Unfortunately, only the power of an Immortal can make it work. This treasure… will not even recognize my Cultivation base.” He sighed. The only Immortal Qi he had was from Immortal Shows the Way. He could use bits of it to employ the Celestial Vision technique, but to use it in battle was like trying to put out a burning horse cart with a single cup of water.</p><br/><p>“Immortal Qi…. So this thing really is an Immortal treasure. It only works when fueled by Immortal Qi….” As he considered these matters, his heart suddenly trembled as a bizarre notion appeared in his mind.</p><br/><p>“Is the Qi of Immortal Shows the Way really Immortal Qi? Is it possible… that it really isn’t Immortal Qi, but rather, something else….?” Before he could consider the idea very much, he suddenly looked down at the sea below.</p><br/><p>The previously still waters were now suddenly filled with ripples. A crocodile appeared, three hundred meters long… heading in his direction.</p><br/><p>Crocodiles were not something that would normally appear in the sea, but there was one here right now. It was completely black, and its eyes were somber and cold. On its back were countless ferocious looking bumps and lumps.</p><br/><p>Sitting cross-legged amidst the bumps and lumps was a man wearing a dilapidated set of clothing. His expression was cold as he… looked up at Meng Hao.</p><br/><p>In the instant in which he looked at Meng Hao, the man’s eyes filled with a bloodthirsty killing intent.</p><br/><p>“Cultivator?” he said, his unpleasant voice hoarse and grating. When he opened his mouth to speak, blackened teeth could be seen. To Meng Hao, his entire person seemed to radiate complete vileness.</p><br/><p>An aura of Spirit Severing suddenly exploded out of him. At the same time, the crocodile suddenly lifted its head up and roared, also exploding with a Spirit Severing aura. The seawater was in chaos, and a pulsating, fishy stench rose up.</p><br/><p>“This is the Devil Sea,” said the man. “Now that you’re here, you won’t be leaving.” With that, he made a grasping motion, causing the air in the area to condense. An incredible pressure then weighed down.</p><br/><p>Meng Hao gaped. “Devil Sea?”</p><br/>\n</div>"}