{"title": "Chapter 662: Xu Pingping", "id": 662, "volume": 7, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-662-xu-pingping", "volume_title": "Volume 7", "body": "<h1>Chapter 662: Xu Pingping</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 662: Xu Pingping</strong></p><br/><p>To be the subject of such scorn here for no apparent reason caused Meng Hao to frown. If he revealed his Cultivation base, it would instantly resolve the situation. However, it was with great difficulty that he had managed to strike it rich. Therefore, since he could solve the problem with his Demon hearts, he didn’t want to use his Cultivation base to intimidate people.</p><br/><p>Almost in the exact moment that the woman went to leave, Meng Hao slapped his bag of holding. Instantly, a rush of clattering could be heard as 1,500 low-grade Demon hearts piled up in the middle of the pavilion. They looked like a small mountain.</p><br/><p>Glittering light flickered out, forming a resplendent scene. In addition, the sound that echoed out, along with the strong spiritual energy, immediately caused all of the Chosen who were about to go up to the second floor, to subconsciously look back. Looks of shock instantly appeared on their faces, after which bright glows appeared in their eyes.</p><br/><p>Ji Xiaoxiao looked back at the Demon hearts. Despite her identity and Cultivation base, she was still shaken inwardly. She clearly knew the value of Demon hearts, and couldn’t stop herself from looking over at Meng Hao.</p><br/><p>Next to her, the young man also gaped and began to breathe raggedly. Although he was a Junior Patriarch, the sight of more than a thousand low-grade Demon hearts piled up together was something even he would rarely see.</p><br/><p>As for the female Flying Immortal Sect disciple, she was actually the last person to realize what had happened. When she saw everyone looking behind her, she subconsciously looked back. Then she saw the mountain of Demon hearts, and her mind went blank.</p><br/><p>Roaring sounds filled her head, and she could scarcely believe what she was seeing. How could she possibly imagine that these two plainly dressed, almost rustic Cultivators, would actually… have so many Demon hearts?!</p><br/><p>“S-senior… I….” stammered the woman.</p><br/><p>“Is that enough?” asked Meng Hao coolly. “Now bring out your best product.” He waved his right hand.</p><br/><p>RUMBLE!</p><br/><p>A second mountain of Demon hearts appeared. Then, another rumbling could be heard, and a third mountain could be seen. In total, three small mountains of Demon Hearts now lay on the floor of the pavilion, a total of 5,000 Demon hearts. The resplendent light that shined out from them filled the entire area. Intense spiritual energy made the entire area seem like a Celestial paradise.</p><br/><p>The woman’s mind was now roaring, and she was almost incapable of standing up straight. Her face was pale and filled with intense disbelief. She was literally incapable of imagining how the person she had just ridiculed could actually be such an ostentatious moneybags.</p><br/><p>The other Chosen from the three Sects who currently stood on the stairs were also panting. Their eyes were wide as they stared at the Demon hearts. They dearly wanted to grab them for themselves.</p><br/><p>Ji Xiaoxiao also stared in shock. She looked at Meng Hao, and gradually, a burning fervor rose up in her. As for the young man next to her, he took a deep breath as he stared at the Demon hearts.</p><br/><p>The entire pavilion was filled with complete silence.</p><br/><p>It was at this point that a peal of laughter could suddenly be heard coming from the second floor. A young woman walked out, wearing a set of revealing clothing. She seemed to be innately seductive; as she walked out, a fragrant aroma preceded her, and her forehead was adorned with a five-colored crystalline pattern. Even before Meng Hao could say anything to her, a charming smile could be seen on her face. An aura of maturity emanated out from her, filled with an intense attractiveness.</p><br/><p>She walked slowly down the stairs, completely ignoring the Chosen as she passed them. In contrast, all of the Chosen bowed their heads and clasped hands to her.</p><br/><p>As for the Junior Leader of the Flying Immortal Sect, when he saw the woman, he immediately lowered his head respectfully.</p><br/><p>“Earlier today, I heard the magpies calling, so I knew that an honored guest would come to call. I’ve been waiting all day, although it was nothing more than resting, really. Now the honored guest is here.</p><br/><p>“I am Xu Pingping. Greetings, Fellow Daoist.”</p><br/><p>Meng Hao glanced at Xu Pingping and saw that she had a late Nascent Soul Cultivation base. She hid it well, but to Meng Hao’s eyes it was clearly visible.</p><br/><p>His glance instantly caused Xu Pingping’s heart to quiver. His look gave her the feeling that he could see through every defense she had, all the way into her heart. It seemed almost like all her secrets could be thoroughly revealed, no matter how she tried to hold them back.</p><br/><p>Instantly, she became nervous, although her expression did not change in the slightest. Her demeanor continued to be one of maturity and charm.</p><br/><p>“Fellow Daoist, please come up to the second floor,” she said with a smile. “I’m sure that the Cloudburst Pavilion has everything that you need.” In both terms of her wording and her inner feelings, she was extremely respectful to Meng Hao.</p><br/><p>He nodded, then walked up ahead to climb the stairs. Wei Li followed, her heart pounding. Everything that she had seen so far today had opened up a new world to her. She was both nervous and excited as she trailed after Meng Hao.</p><br/><p>She was just about to step foot onto the stairs when suddenly she hesitated and quietly said to Meng Hao, “Senior, the Demon hearts….”</p><br/><p>“No one in Seahold would dare to take my Demon hearts,” said Meng Hao slowly, continuing up the stairs. When his words echoed out into the ears of everyone present, their hearts trembled.</p><br/><p>Such wording was incredibly domineering.</p><br/><p>Xu Pingping’s eyes glittered. When she thought back to Meng Hao’s penetrating glance just now, she couldn’t help but be a bit more cautious than before.</p><br/><p>As for the Chosen on the staircase, be they from the Flying Immortal Sect, or other Sects, without even thinking about it, they backed up to make way for Meng Hao. When he neared Ji Xiaoxiao, she looked up over curiously.</p><br/><p>In return, he completely ignored her and proceeded on to the second floor.</p><br/><p>Xu Pingping followed. As she passed the Chosen, she suddenly stopped and looked back at the two Nascent Soul Cultivators, as well as the other Flying Immortal Sect disciples whose job it was to receive guests.</p><br/><p>“The two of you screw off,” she said coolly. “Go back to the Flying Immortal Sect immediately.” The two old Nascent Soul Cultivators tremblingly voiced their acknowledgement.</p><br/><p>“The other four of you can also screw off. Go to the Flying Immortal Dungeon, where you will be punished for half of a sixty-year cycle!” Immediately, the Flying Immortal Sect disciples’ faces went deathly pale. They began to tremble, and appeared to be completely filled with terror.</p><br/><p>“And as for you….” she said, looking at the dazed female disciple standing in the middle of the pavilion. “If I get in any trouble from the Sect because of you, you pathetic, dog-eyed slut, well, you wouldn’t be able to pay me back if you had ten lives. You’re expelled from the Flying Immortal Sect. Get out of here. The farther you screw off, the better.” With that, she turned and continued on to the second floor. When she passed Ji Xiaoxiao, she nodded and smiled.</p><br/><p>The Cloudburst Pavilion only had two floors. The second floor was roughly the same size as the main hall. It was grand and imposing, and had an incense burner directly in the center. It was carved with strange creatures, and the smoke that wafted out from it made the second floor seem almost as if it were filled with mist.</p><br/><p>After stepping foot onto the second floor, Meng Hao sat down in a nearby chair. Wei Li stood next to him, looking around. Her heart was nearly bursting with excitement; she had never imagined that one day she would be able to stand in a position like this.</p><br/><p>Meng Hao’s expression was calm. He sat there, eyes closed, unspeaking. Moments later, Xu Pingping approached, her smile seemingly covering up the bitterness she felt inwardly.</p><br/><p>“Senior, you left so many Demon hearts sitting in the main hall, I can’t help but be a bit nervous.”</p><br/><p>Meng Hao opened his eyes and looked at her with an enigmatic smile. As soon as his gaze fell upon her, she got a bit more nervous, and even her smile started to feel a bit forced.</p><br/><p>“I want a magical flight item,” he said calmly. “The best you have.”</p><br/><p>“I already have everything prepared, Senior,” said Xu Pingping. She clapped her hands three times, after which three women clad in delicate gauze skirts floated out from the smoke of the incense burner. Each of them carried a silver platter, which they held up high as they respectfully approached.</p><br/><p>By this point, Ji Xiaoxiao and the others had arrived on the second floor and were looking over from off to the side. Obviously, they were less interested in the magical flight item and more interested in Meng Hao.</p><br/><p>The items on the three silver platters included a reddish, copper short sword, a violet wooden boat, and a flying shuttle.</p><br/><p>Xu Pingping looked at Meng Hao and smiled.</p><br/><p>“Red Copper Sword,” she said. “It expands when it rushes against the wind, becoming three thousand meters long. Nine levels of ghost images will appear inside of it, and it can accommodate three hundred passengers. It also contains a swarm of 10,000 short swords.</p><br/><p>“Violet Wooden Boat. It can accommodate two hundred passengers, and has no offensive spell formations, nor any defensive spell formations. However, its speed… is similar to a First Severing Cultivator. Unfortunately, it consumes Spirit Stones at a high rate, one low-grade Spirit Stone for every three breaths of time!</p><br/><p>“Soul Flying Shuttle. It is only nine meters long, with average speed. However, its most powerful advantage is its Wind Blade function. Every hour, it can produce a single Wind Blade. As long as you have enough Spirit Stones, there is no limit to the number it can produce.</p><br/><p>“These three items are the highest level flying items that we manufacture here at the Cloudburst Pavilion. Which one would you like, Fellow Daoist?”</p><br/><p>When the Chosen from the three Sects saw the three magical flight items, their faces filled with longing. They well knew that these items were incredible.</p><br/><p>Meng Hao frowned slightly. Others might view the items as high quality, but considering the level of his Cultivation base, they didn’t quite meet up to his expectations.</p><br/><p>Seeing Meng Hao’s frown caused Xu Pingping’s heart to quiver, and she started to pant a little. His frown, coupled with what had happened earlier, caused her to start to formulate some speculations about Meng Hao.</p><br/><p>She hurriedly continued, “Although, I actually advise you not to purchase these items, Fellow Daoist. They seem incredible, but are actually relatively ordinary. Despite being expensive, they are standard manufacture items; in the lands of South Heaven, you will find quite a few people who own them.”</p><br/><p>“Oh?” said Meng Hao, looking at Xu Pingping.</p><br/><p>“Senior,” she said softly, her eyes glittering, “if you have enough Demon hearts, then the Cloudburst Pavilion can offer you a one-of-a-kind precious treasure!” She raised her right hand and performed an incantation, then pointed at the incense burner.</p><br/><p>Immediately, the incense burner began to rumble, attracting all eyes in the room. Suddenly, vast quantities of smoke poured out from inside, within which could be seen, shockingly, an illusory bronze war chariot!</p><br/><p>The war chariot emanated an air of ancientness, and was surrounded by crackling lightning. It was also covered with cracks that made it seem as if it had experienced the baptism of flames of war and countless battlefield bloodbaths.</p><br/><p>An indescribable pressure spread out from it, and visible on its surface were numerous flying beasts that almost looked alive. Although no one else could tell, when Meng Hao looked at them, they almost seemed alive.</p><br/><p>To his eyes, all of the beasts were living, and struggling, letting out roars that caused his mind and heart to tremble.</p><br/><p>He made a slight “eee?” sound, then reached his right hand up to touch his left eye. Then he blinked nine times, causing the Immortal Qi of Immortal Shows the Way to circulate inside of him. When he looked at the war chariot this time, the flying beasts all merged together to transform into a black wing!</p><br/><p>Unfortunately, there was only one.</p><br/><p>Meng Hao looked away and closed his eyes. After a moment he opened them again and looked at Xu Pingping.</p><br/><p>“How much?” he asked.</p><br/><p>Xu Pingping’s heart was trembling. Things were not quite going according to her plan for this item. Then she thought of Meng Hao’s actions earlier, and she started to regret.</p><br/><p>“Fellow Daoist, this item isn’t for sale. It’s….”</p><br/><p>Meng Hao’s face immediately darkened, and suddenly, a shocking pressure emanated out from him to envelop the entire area. It almost seemed as if a storm were coming.</p><br/><p>-----</p><br/><p><em>This chapter was sponsored by Malow Kenende, Jonathan, LB and Lim Derek</em></p><br/>\n</div>"}