{"title": "Chapter 691: Extend the Broken Bridge of Life Force", "id": 691, "volume": 7, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-691-extend-the-broken-bridge-of-life-force", "volume_title": "Volume 7", "body": "<h1>Chapter 691: Extend the Broken Bridge of Life Force</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 691: Extend the Broken Bridge of Life Force</strong></p><br/><p>Half a month passed by.</p><br/><p>Xu Qing did not return.</p><br/><p>Meng Hao lay surrounded by coldness and deathly silence. He did not decompose, nor would he for some time. His body lay there, completely lacking any life force whatsoever.</p><br/><p>He was dead.</p><br/><p>Normally speaking, his soul could enter the cycle of reincarnation. However, because of the Ninth Mountain and Sea lodestone that existed in the Rebirth Cave, the soul was sealed, and could not dissipate. Furthermore, his soul did not leave his body, preventing the soul-devouring entities from doing anything other than look at him.</p><br/><p>As time passed, they were able to see that within Meng Hao was a strand of silk wrapped tightly around his soul.</p><br/><p><em>As long as the silk did not break, the larva could not be destroyed. As long as the larva was not destroyed, the silk could not break!</em></p><br/><p>Life or death hung by a thread... the thread of the eyeless larva! It allowed the existence of Meng Hao's soul to be forever preserved, even if his body perished. From these seemingly contradictory circumstances arose a state of undeath which was virtually unheard of in Heaven and Earth!</p><br/><p>In some ways, it conformed with the Soul Divergence Incantation. However, it was not rebirth.</p><br/><p>Another half month passed, and finally, someone appeared outside of the Rebirth Cave.</p><br/><p>It was not Xu Qing. It was a fat, middle-aged man. He had a somewhat bawdy look to him, and his body was almost like a sphere. He had freckles on his face, and the Daoist robe he wore was a bit too tight. The way his body bulged out of it made his whole image seem disharmonious.</p><br/><p>Apparently, however, he thought of himself as burly and muscular. A greatsword could be seen strapped to his back, and it glittered with golden light.</p><br/><p>This was the same Fatty from years ago, Li Fugui.</p><br/><p>He was alone, shivering as he moved at high speed into the region surrounding the Rebirth Cave. His face quickly turned pale.</p><br/><p>“Dangit, I’m gonna be dead meat! Meng Hao, you jerk, your cons are going to be the death of me!</p><br/><p>“And Elder Sister Xu, aiiiii…” Fatty looked upset, but his steps didn’t pause for even a moment. Even though his life force was dissipating rapidly, he shot forward at top speed.</p><br/><p>When he reached the 3,000 meter mark, he coughed up a mouthful of blood. Immediately, multi-colored beams of light shot out from inside of him. Within each beam of light could be seen the image of a meditating old man.</p><br/><p>“I’m the only heir of my bloodline in the Golden Frost Sect, fools!” bellowed Fatty. “I might not have many kinds of treasures on me, but there’s one thing I have a lot of, and that is life-saving treasures!” It was impossible to say how many life-saving treasures Fatty actually had on his person, but as of this moment, vast amounts appeared as he passed into the 1,500 meter area.</p><br/><p>By this time, the glow that surrounded him was starting to fade away. His body no longer looked like a sphere. His flesh withered, and in the blink of an eye, he was suddenly much skinnier.</p><br/><p>“Meng Hao is my big bro. For him, all of my precious flesh is disappearing… Uh… well, a bit of gorging will restore it.” With a howl, Fatty shot into the 1,000 meter mark. By now, he was was so skinny that he looked like a normal person. At the same time, cracking sounds could be heard coming from his body.</p><br/><p>Those would be his numerous lifesaving treasures treasures being destroyed.</p><br/><p>“Dammit, still 1,000 meters to go. The only reason Elder Sister Xu is in such a heartbreaking situation is because of Meng Hao. I don’t even know if she’s still alive…. Everything is up to me now. If I can’t get through, then I’ll regret it for the rest of my life!” Li Fugui’s eyes were completely bloodshot. Roaring, he pulled out more life-saving treasures and, ignoring the rapid withering of his body, continued on, pushing forward another 250 meters.</p><br/><p>By that point, his life force was reaching the limit. His vision was growing blurry and dark. If he went any further, he would die.</p><br/><p>Actually, the only reason he was able to make it this far was because of all the magical items, and the fact that earlier, he had consumed vast quantities of medicinal pills designed to invigorate his life force.</p><br/><p>“750 meters!!” Tears welled up in his eyes as he looked at the squat mountain up ahead. Although he seemed unaffected on the outside, the truth was, when he learned about Meng Hao’s situation, he had dropped everything to rush to this place where life was prohibited. Clearly, in his heart, Meng Hao really was his big bro!</p><br/><p>Meng Hao was the same big bro from back in the Reliance Sect, when they had first started practicing cultivation together.</p><br/><p>“Meng Hao, I’ve done my best!!” Tears began to roll down his cheeks as he lifted up his right hand. In his palm rested a black pill bottle, which was surrounded by a rotating black halo. As soon as the pill bottle appeared, the death aura in the area rapidly increased.</p><br/><p>At the same time, the wills that lurked in the depths of the Rebirth Cave emerged. They swirled about inside the cave, staring at the pill bottle in Fatty’s hand.</p><br/><p>Fatty gritted his teeth and then hurled the pill bottle toward the Rebirth Cave. It transformed into a black beam that shot directly into the mouth of the cave.</p><br/><p>Fatty coughed up a mouthful of purplish-black blood. His body continuing to wither, he turned and transformed into a beam of light that shot off into the distance. Tears continued to stream down his face as he flew away.</p><br/><p>“Meng Hao, you have to be reborn…. You must come out of there!”</p><br/><p>Back in the Rebirth Cave, the pill bottle landed on the ground. The wills approached and were about to begin fighting over it when the cold snort of a woman could be heard. Although no outsider would be able to detect it, the wills could hear it clearly, and they instantly began to tremble.</p><br/><p>At the same time, an overbearing will emerged from the depths of the cave to sweep up the pill bottle. It then transformed into the very same woman who had sent Xu Qing out of the cave.</p><br/><p>She looked around, and the other streams of will scattered, returning to their various places of origin within the Rebirth Cave. The woman turned back around and walked up to Meng Hao’s corpse. She looked him over and then looked at the pill bottle.</p><br/><p>She said nothing for a long moment.</p><br/><p>Xu Qing had not returned, which was something the woman assumed would happen when she sent her away. Except, she had assumed that love-smitten Xu Qing, after regaining some clarity and having more options to pick from, would hesitate about the difficult decision.</p><br/><p>She had assumed that Xu Qing would choose to protect her own life.</p><br/><p>But now that the pill bottle had appeared, this woman, the embodiment of the goodness of the Resurrection Lily, suddenly felt her heart trembling.</p><br/><p>“She didn’t come,” the woman said softly, “but she sent someone in her stead to deliver the pill. And that person had strange, incredible treasures to prevent his soul from dissipating….” Although she didn’t know the details, she could guess what had happened. Poor Xu Qing had paid an indescribable price to get her hands on the medicinal pill.</p><br/><p>The woman sighed.</p><br/><p>“My life has been one of sorrow….</p><br/><p>“There is no rebirth here. Perhaps there is no rebirth at all. But I did give her my promise, after all….</p><br/><p>“I have already existed for far, far too long, and no longer desire to live.</p><br/><p>“Since that is the case, why not help her achieve her aim?” The woman looked at the pill bottle in her hand. After a long moment, she suddenly clenched her hand into a fist. The pill bottle shattered with a bang, and a medicinal pill flew out, which the woman immediately consumed.</p><br/><p>Instantly, her previously illusory body suddenly became material. Shockingly, she now possessed flesh and blood.</p><br/><p>“It feels good to have a flesh and blood body again, even if it’s temporary….” she said softly. This time, her voice was real.</p><br/><p>“I will help her achieve her aim. Then she will see whether faithful people truly exist. She will see what decision this final successor of the League of Demon Sealers will make when it comes time to sever emotion.</p><br/><p>“The reason I am saving you is not for your sake, but for her,” she said softly. “When the time comes, we will see whether or not she will become like me.</p><br/><p>“I take my promises very seriously. It is with the same faithfulness that I treated HIM, all those years ago, that I will treat this girl who wishes to follow in my footsteps.</p><br/><p>“I did not come to the Rebirth Cave to look for death, but rather, rebirth. I wanted to have a chance at a new self. I wanted to sever the past, and finally be free when I emerged.</p><br/><p>“But this place… has no rebirth!</p><br/><p>“What does exist here, though, is my long life… which I can use to extend the broken bridge of your life force!” The woman made a grasping gesture toward the depths of the Rebirth Cave, toward a three hundred meter wide black boulder, half of which was buried in the dirt.</p><br/><p>The black rock trembled and shook until a piece of it tore off of the top, which then flew toward the woman.</p><br/><p>She grabbed it and crushed it, transforming it into a black powder that she sprinkled over Meng Hao’s body.</p><br/><p>At the same time, she performed an incantation gesture. Her eyes filled with a look of reminiscence as she recalled beautiful memories. After a long moment of silence, she pushed two fingers down onto the forehead of Meng Hao’s stiff, withered corpse.</p><br/><p>As soon as her fingers touched his forehead, his previously unmoving body suddenly spasmed. In the same moment, the woman began to slowly wither, starting with her feet.</p><br/><p>Her life force, her vitality, her everything, poured through her two fingers into Meng Hao.</p><br/><p>She looked up into the blackness around them, and images appeared in her mind. She saw herself, and the man who she could never forget.</p><br/><p>“You live, I live. You die, I die…. I spoke words like that too,” she murmured. Her body continued to wither, whereas Meng Hao’s was recovering. He was no longer ancient, and signs of life could be seen within him.</p><br/><p>“Back then, I looked at you and you looked at me….</p><br/><p>“From that day on, I accompanied you. I followed you through so many deadly situations….</p><br/><p>“Every time you were hurt, I felt pain. Every time you smiled, I was happy. I know… that you tried to part with me on more than one occasion, but your reluctance held you back.” Her legs were now withered, almost like roots connected to the ground. Her life force poured into Meng Hao, causing his hair to grow long, his face to flush with life. He was not old any more, but rather, middle-aged.</p><br/><p>The life force gathered up in Meng Hao, filling up what had once been empty.</p><br/><p>“I also know that you had your wife, your Sect, your responsibilities, and your mission. You had everything that was yours.</p><br/><p>“But I… really only had you.</p><br/><p>“Even my name was given to me by you. I liked it when you called me Da Nu…. [1. The name Da Nu was first mentioned in chapter 101]</p><br/><p>“If you grow old, I’ll grow old with you. I also said the same thing.” The woman’s voice was soft as she spoke, filled with beauty and mystery and pain. By now, her body was almost completely withered. Because of the life force she was giving to Meng Hao, he was now a young man again. Except for the fact that his eyes were not open, he looked exactly as he had so many years ago.</p><br/><p>“There is only one thing that I said which she didn’t.</p><br/><p>“If you reach Immortal Ascension, then I… will become Immortal with you!</p><br/><p>“I never broke your heart. I would never, ever hurt you. But on that particular dawn, on the day of vicissitudes, when I saw you severing your emotions, I wept….</p><br/><p>“I took all the goodness that was in me, and left it in a coffin in the Milky Way Sea. I don’t blame you….</p><br/><p>“If something is to blame, it is that I am not a real woman, but only… a Resurrection Lily who fell in love with you.”</p><br/><p>The image of herself in her eyes suddenly was that of a beautiful Resurrection Lily, planted deep within the body of a man. After being inside of him for countless years, she… fell in love with her own host.</p><br/><p>-----</p><br/><p><em>This chapter was sponsored by Seanl, Robert Funk, Peter Johansson, and Fabian Müller</em></p><br/>\n</div>"}