{"title": "Chapter 696: Breaking the Formation", "id": 696, "volume": 7, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-696-breaking-the-formation", "volume_title": "Volume 7", "body": "<h1>Chapter 696: Breaking the Formation</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 696: Breaking the Formation</strong></p><br/><p>Meng Hao’s fist connected. It was powered by the rage and frustration of having his Perfect Foundation stolen, as well as all the regret that he had severed away.</p><br/><p>One fist connected, and everything exploded!</p><br/><p>A huge boom filled the air as the statue’s six arms burst into pieces, and its three heads crumbled. The entire statue exploded like a bomb!</p><br/><p>It was impossible to describe exactly how much power was unleashed. Blood sprayed from the mouths of the 10,000 Black Sieve Sect disciples as they were sent spinning backward into the spell formation. The gale-force wind generated by Meng Hao’s blow then smashed into them, shredding their bodies to pieces, killing them instantly.</p><br/><p>Meng Hao’s eyes shined with determination as he strode forward and punched a second time.</p><br/><p>Then a third time, a fourth time and a fifth time!</p><br/><p>Every time a blow landed, more of the surrounding lotus spell formation crumbled. With each strike, Meng Hao proceeded forward another thirty meters. By the time the ninth blow landed, he was already at the very edge of the spell formation. The final blow… was the Nine Heavens Destruction!</p><br/><p>The lotus collapsed into fragments, and a massive boom rocked Heaven and Earth.</p><br/><p>The sound of it filled the Hundred Thousand Mountains, roughly 10,000 of which directly collapsed into pieces. Finally, the Black Sieve Sect’s mountain-protecting spell formation was broken.</p><br/><p>In that moment, Meng Hao emerged from the spell formation and entered the black mist.</p><br/><p>“Give me Xu Qing!” he said. His tone of voice made him sound like he was the ruler of the entire world. It was filled with an indescribable potency and madness that filled the entire Black Sieve Sect.</p><br/><p>As his voice resonated out, the surrounding mist seethed, and narrow gaps formed. Through one such gap, Meng Hao caught a glimpse of the Ninety-Nine Mountains on the other side of the mist, and the incense burner on the First Mountain.</p><br/><p>Sitting cross-legged inside the incense burner was a trembling figure, indistinct, but with a very familiar aura….</p><br/><p>Xu Qing!</p><br/><p>It was Xu Qing, who would live and die with him!</p><br/><p>Hundreds of thousands of Black Sieve Sect disciples were refining Xu Qing!</p><br/><p>Meng Hao’s mind felt as if lightning bolts were striking it. An indescribable fury rose up inside of him, transforming into an inexhaustible desire to slaughter.</p><br/><p>KILL! KILL! KILL!</p><br/><p>In that moment, Meng Hao’s hatred for the Black Sieve Sect reached the degree where it could never possibly be reconciled. Every single last disciple of the Black Sieve Sect HAD to die!</p><br/><p>“Kill him!” cried the centermost of the three old men by the incense burner. The faces of all three were currently filled with shock; how could they possibly have imagined that Meng Hao would be able to break through their great lotus spell formation?</p><br/><p>The First Severing cultivator immediately rose to his feet. He had a violent temper, and his face was grim as he flew up into the air.</p><br/><p>“Disciples of the rear twenty peaks of the Hundred Mountains,” said the old man, “follow me into the Sieve Yin Formation. We will kill this drudge!” With that, he entered the black mist. Simultaneously, 30,000 disciples flew to follow him. The weakest among them were Foundation Establishment cultivators, the strongest were Nascent Soul.</p><br/><p>Even as they entered the mist, Meng Hao’s voice, filled with unprecedented bereavement and anger, suddenly sounded out.</p><br/><p>“Black Sieve Sect! I hereby vow that… I will eradicate your entire sect! The lands of South Heaven will have either you or me, not the both of us!”</p><br/><p>Meng Hao’s desire to kill had reached a heinous level. He lifted his right hand and produced the flag of three streamers. It swept out in all directions, causing the mist around him to roil, and rumbling sounds to fill the air. As for the Black Sieve Sect First Severing Patriarch, as soon as he stepped into the mist, it seemed to come alive, as if it were sentient.</p><br/><p>“Will of the Black Sieve, understanding of all creation! I shall go to battle, and pluck the stars from Heaven! First formation!” The voice of the First Severing Patriarch echoed about as the 30,000 Black Sieve Sect disciples entered the mist one after another. Shockingly, the mist condensed into eight formations that resembled black dragons.</p><br/><p>The black dragons looked incredibly ferocious. Roaring with rage, they circulated around each other and then shot toward Meng Hao, attempting to devour him.</p><br/><p>Meng Hao’s eyes flickered with a cold glow as he looked at the eight dragons. His desire to kill had reached a level it never had before. From the day he had begun practicing cultivation until now, he had never felt a stronger desire to slaughter.</p><br/><p>As the eight dragons neared, Meng Hao strode forward and waved the flag of three streamers. Blackness spread out, sweeping over three of the black dragons. The flag began to glow with a bizarre light, and on its surface appeared countless faces, their features twisted as if with greed and the thirst for blood.</p><br/><p>At the same time, Meng Hao’s body flickered and then reappeared in front of one of the other dragons. Without the slightest hesitation, he punched. A boom echoed out and a huge spasm ran through the black dragon. It began to break apart in layers, accompanied by miserable shrieks. Behind Meng Hao, three more black dragons roared and charged. They moved with such incredible speed that even in the moment in which he turned to look at them, they were directly in front of him.</p><br/><p>“Demon Sealing, Eighth Hex!” he said, pointing out his right hand. Instantly, the three black dragons trembled, as if countless invisible bonds were tying them up.</p><br/><p>“Demon magic, art of Righteous Bestowal, soul extraction!” Meng Hao performed an incantation, and a vicious gleam appeared in his eyes as he pointed forward.</p><br/><p>The gesture instantly caused the indescribably shrill cries to echo out from within the dragons. Inside the dragons were over 10,000 cultivators, their faces twisting and distorting as they screamed. Ghost images appeared, which were their souls being extracted from within!</p><br/><p>The three dragons instantly collapsed; over 10,000 corpses suddenly fell to the ground.</p><br/><p>The art of Righteous Bestowal was a magical technique of the Demon Sealers. Righteousness came with a thought, bestowal came with a thought. Life came with a thought, death came with a thought!</p><br/><p>In the same moment, the three dragons caught up by the flag of three streamers trembled violently and collapsed into pieces. As for the final dragon, it froze in mid-air. The image of the First Severing Patriarch magically appeared in the head position of the dragon, and his face was filled with shock.</p><br/><p>“Second Formation!” he cried. Immediately, what remained of all the dragons fell apart and turned into black mist that shot toward the First Severing Patriarch. Within the mist were the rest of the disciples who had not been killed, about 10,000 of them.</p><br/><p>In the blink of an eye, the black mist transformed into a three hundred meter tall giant. It wore black armor, and looked like a god. As soon at appeared, it charged toward Meng Hao.</p><br/><p>“DIIEEE!!” roared the giant, the combined voice of 10,000 people echoing out to shocking effect. At the same time, the Hundred Thousand Mountains suddenly released a boundless aura that enveloped the giant, causing its body to grow. All of a sudden, it was 1,500 meters tall!</p><br/><p>Compared in size to the giant, Meng Hao was nothing more than a bug.</p><br/><p>Meng Hao looked up at the approaching giant, and the coldness in his eyes grew stronger. Then he suddenly realized that he wasn’t sure whether or not Xu Qing was alive or dead inside of the incense burner, and his heart grew even more anxious. At the same time, he understood that if he didn’t destroy this spell formation, then he would be unable to enter into the Black Sieve Sect.</p><br/><p>“DIE!” the giant roared, stretching its arms out to either side and then smashing them together toward Meng Hao, as if to crush him between its palms. They moved with incredible speed; in the blink of an eye, the hands were almost upon Meng Hao.</p><br/><p>He did nothing to evade, allowing the hands to smash into each other around him.</p><br/><p>To anyone observer, it would appear as if Meng Hao was completely enveloped by the hands of the giant. However, if you looked closely, you would see that… the giant was trembling.</p><br/><p>Not only was it trembling, its expression was one of disbelief and shock.</p><br/><p>“What… what fleshly body is this?!” said the Second Severing old man next to the incense burner. He rose to his feet, his face filled with astonishment.</p><br/><p>“Calm down. There’s no need to get agitated,” said the Third Severing Patriarch, his voice cool. “That’s only the second transformation out of three total.”</p><br/><p>Even as they exchanged words, the giant’s hands suddenly exploded. Black mist spread in all directions as Meng Hao walked out, not harmed even in the least bit. He stepped up to the giant and then instantly punched out.</p><br/><p>A huge boom could be heard as the giant opened its mouth and expelled a mouthful of mist to block Meng Hao. At the same time, it retreated at full speed. On the giant’s forehead, the image of the First Severing Patriarch appeared, his expression one of terror and astonishment.</p><br/><p>Instantly, he shouted, “Third formation!”</p><br/><p>In response, the body of the giant fell apart into boundless black mist that shot toward Meng Hao and surrounded him. It seethed and spun as it then formed into an enormous globe. Rumbling sounds filled the air as black fire erupted out. Then the globe began to shrink, as if it intended to refine Meng Hao inside of it.</p><br/><p>It shrank relentlessly. 300 meters. 150 meters. 100 meters. 30 meters….</p><br/><p>Next to the incense burner, the Third Severing Patriarch coolly commented, “The third transformation, in combination with the power of Mo Li’s cultivation base, can easily kill an expert of the Second Severing level. It doesn’t matter how powerful his fleshly body is, the soft can defeat the hard. He will not escape.”</p><br/><p>The other Spirit Severing Patriarch next to him smiled in agreement. “The Sieve Yin Formation can refine all living things. The only sad thing is that… it can’t produce medicinal pills. Otherwise, that person could be refined into a pill that would definitely be considered a precious treasure.”</p><br/><p>As the two of them chatted, a huge rumbling sound suddenly rang out. Their faces flickered as they looked up. Down below, hundreds of thousands of Black Sieve Sect Disciples all had similar reactions.</p><br/><p>What they saw was an enormous black globe of mist, shrunken down to only 10 meters in size. Then, a matchlessly vicious aura was released from within the mist globe.</p><br/><p>The viciousness of the aura was difficult to describe, as was its incredible coldness. Everyone watched on as, in the blink of an eye, a ferocious figure appeared inside the 10 meter mist globe.</p><br/><p>I was not a person, but rather, a flower!</p><br/><p>A multi-colored flower!</p><br/><p>Its branches and leaves swayed, its petals fluttered. When its aura spread out, the mist globe was incapable of enduring. It exploded with a boom. As it did, blood and gore splattered everywhere, from the corpses of the Black Sieve Sect disciples. In addition, an old man emerged, his face covered with fear, shock, and disbelief as he retreated at top speed.</p><br/><p>That old man was none other than the First Severing Patriarch.</p><br/><p>“Save me!!” he howled as he fled.</p><br/><p>However, before he could get very far, and before anyone could even do anything in response, a black branch snaked out at high speed. It wrapped around the old man and violently dragged him back. The old man screamed miserably as the branch hauled him down toward Meng Hao, who then grabbed him by the neck.</p><br/><p>Meng Hao strode forward. Behind him was a five-colored Resurrection Lily, fully sixty meters tall, swaying about with unbridled fury as it floated along.</p><br/><p>This was Meng Hao’s Spirit Severing Treasure, his Resurrection Lily!</p><br/><p>-----</p><br/><p><em>This chapter was sponsored by Steven Hirsch</em></p><br/>\n</div>"}