{"title": "Chapter 706: Kill!", "id": 706, "volume": 8, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-706-kill", "volume_title": "Volume 8", "body": "<h1>Chapter 706: Kill!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 706: Kill!</strong></p><br/><p>A whistling sound filled the air as the three Mount Ironblood Nascent Soul cultivators gritted their teeth, ignored Meng Hao, and shot past him toward Wang Youcai, radiating killing intent.</p><br/><p>They wouldn’t kill him, of course. However, they would seriously wound him, especially considering that they represented the torture chamber, and their Elder Brother Chang Yi had personally given the orders. In their opinion, they clearly occupied the superior position, especially considering that they were essentially backed by the two Ironblood Patriarchs. A trifling Blood Prince, even if he did have a cultivation base exceeding their own, couldn’t possibly fight back against the two Ironblood Patriarchs.</p><br/><p>Because of this line of reasoning, their killing intent grew even more intense than before. Magical items appeared as they shot forward, and the blood-colored glow rose to the Heavens. Under the eyes of everyone in all of the mountain peaks of the sect, they shot forward.</p><br/><p>A cold smile could be seen on the face of Chang Yi as he glared icily at Meng Hao, waiting to see how he would respond to this test.</p><br/><p>“There is ruthlessness in my heart,” murmured Meng Hao. “It’s been there since I perished in the Milky Way Sea….” He lifted his right hand and casually waved a finger.</p><br/><p>Although it appeared that the finger didn’t actually point down onto anything but air, in the blink of an eye, the fastest of the three Mount Ironblood cultivators immediately began to tremble. An expression of confusion flashed across his face, and then he coughed up blood. A moment later, he literally exploded.</p><br/><p>It was as if an enormous, invisible pair of hands had crushed him into a pulp!</p><br/><p>The speed with which it happened was incomparable. It was so sudden that everyone who was observing was flabbergasted.</p><br/><p>Behind Meng Hao, Wang Youcai’s face fell, and his heart began to pound. “Not good,” he thought. “Meng Hao is far too impulsive! What should I do?”</p><br/><p>Anxiety welled up in his heart. He could tell that Chang Yi was just testing Meng Hao, and could never have imagined that Meng Hao would act so rashly.</p><br/><p>Chang Yi’s eyes went wide. Previously, he had never thought that the Blood Prince would attack… with lethal force. However, this twist caused joy to surge up inside of him. He couldn’t help but muse that the Blood Prince was clearly far too inexperienced. Coldness gleamed in Chang Yi’s eyes as he strode forward.</p><br/><p>“Blood Prince!” he bellowed. “How dare you violate sect rules!!”</p><br/><p>At the same time, the seven shady-looking apprentices on the second mountain peak watched on with glittering eyes, clearly interested in what was happening.</p><br/><p>On the fourth mountain peak, the young man with the fan smiled faintly, and a strange light gleamed in his eyes.</p><br/><p>As for the hunchbacked old man on the fifth mountain peak, his eyes flickered. Next to him, the pretty young woman stared in shock. She could never have guessed that Meng Hao would actually kill anyone.</p><br/><p>“So, this Blood Prince turns out to be quite a vicious person,” said the hunchbacked old man, sighing emotionally. “However, he is a bit reckless, and also a tad young. He’s not like me, a person who has lived far, far too long.”</p><br/><p>Meng Hao completely ignored the reactions of everyone around him. He seemed to be immersed within a world of regrets.</p><br/><p>“The ruthlessness grew stronger in the Rebirth Cave….” he sighed. He waved his finger again, and the second incoming Nascent Soul Cultivator’s face fell. He suddenly stopped in place. Rumbling sounds echoed out, and then he exploded, completely dead in body and soul.</p><br/><p>Another person slain!</p><br/><p>The sight of it caused Chang Yi’s face to flicker, not with happiness, but with shock. Moments ago, he had assumed Meng Hao would stop after killing one person, but unexpectedly, he killed again.</p><br/><p>Simultaneously, the surrounding cultivators’ eyes began to shine with a strange light. The disciples on the mountains felt their hearts filling with shock.</p><br/><p>“In the Black Sieve Sect… the ruthlessness exploded out,” murmured Meng Hao. “And yet, it was not sated. Instead, it festered at the bottom of my heart and became even more intense, transforming into… what Patriarch Blood Demon mentioned. Devilishness.”</p><br/><p>The third Nascent Soul cultivator, seeing his two companions killed right in front of him, was completely dumbstruck. His eyes went wide, and he began to retreat, but it was in that moment that Meng Hao raised his hand and gestured a third time with his finger.</p><br/><p>“Eldest Brother, save me….” the man screamed. But then, his body exploded with a bang that echoed out in all directions. Everyone trembled violently, as they were shaken out of their reveries from the events of moments ago.</p><br/><p>“He… actually killed three people in a row!”</p><br/><p>“How moronic! This guy is a real idiot! He just arrived in the Blood Demon Sect, but won’t bow his head in submission, and even dares to act with unbridled aggression!”</p><br/><p>“He’s in big trouble now. Not only did he dare to kill fellow sect members IN the sect, but he chose to kill torture chamber disciples!”</p><br/><p>As the buzz of conversation echoed out, Chang Yi flew up into the air, glaring at Meng Hao the entire time. At first, he had been shocked, but that shock was been replaced with boundless elation. Inwardly, he was roaring with laughter.</p><br/><p>“My Masters said not to take the initiative in provoking him,” he thought, “but as it turns out, the dolt decided to start killing. Considering his position, killing one could be tolerated, but he killed three…. In that case, if I could get him to kill some more, he would definitely be flirting with death!”</p><br/><p>Having reached this point in his train of thought, Chang Yi smiled.</p><br/><p>“I offered respect to you as the Blood Prince,” he called out, “and in response you dared to make deadly attacks in the sect, and even offended the torture chamber! It doesn’t matter how high your cultivation base is, you will be put down! Men… take him into custody!”</p><br/><p>The faces of all the Mount Ironblood disciples flickered in hesitation. However, it was at this moment that two shocking pulses of Spirit Severing energy erupted from Mount Ironblood.</p><br/><p>“When the Blood Prince commits a crime, he will be treated as anyone else!” rumbled an ancient, somber voice. “Take him into custody and bring him to Mount Ironblood. If he resists, subdue him immediately!” As the words echoed out throughout the entire sect, Chang Yi’s expression flickered, and he almost started to laugh out loud with self-righteous laughter.</p><br/><p>“He’s dead!” he thought.</p><br/><p>At the same time, the other disciples with Chang Yi started to look excited. Now that they knew they had the support of the two Ironblood Patriarchs, they were completely confident. They instantly surged forward toward Meng Hao, completely sure that the Blood Prince would never dare to attack them. If he did, then the two Ironblood Patriarchs would instantly reveal themselves.</p><br/><p>Meanwhile on the second mountain peak, Mount Darkheaven, in a temple on the peak, Patriarch Darkheaven sat cross-legged in the form of a young boy. He wore a scholar’s garment, and his expression was grim as he cast his gaze down the mountain.</p><br/><p>Outside of the temple were the seven apprentices, all of whom sneered coldly as they watched the scene play out. Their contempt for Meng Hao was even greater than before; they believed his ability to think and plan was clearly lacking.</p><br/><p>In response to a simple test, he instantly revealed his weaknesses.</p><br/><p>On the fourth mountain peak, the young man with the fan laughed to himself. “This Blood Prince is far too inexperienced,” he thought. “His cultivation base is incredible, but he doesn’t know how to conduct himself. Well, let this be a lesson to him. In the end, he isn’t worthy of his title. He will bow his head in submission soon enough.”</p><br/><p>The hunchbacked old man on the fifth mountain peak sighed. “Too young.”</p><br/><p>Meng Hao looked up, and his eyes were frigid. In fact, his entire person was like a block of ice, and the ruthless aura within him radiated out explosively.</p><br/><p>“My ruthlessness turned into Devilishness,” he murmured, “and I can’t suppress it. It does not conform with my Dao, but… it is what it is…. I might as well let it out!”</p><br/><p>He stepped forward, and in the blink of an eye, his killing intent erupted out. At the same time, he swished his sleeve.</p><br/><p>It was a simple wave of an arm, but it caused an astonishing gale-force wind to rage up. It was like a wind of Heavenly destruction that swept out in all directions, slamming into more than a dozen incoming cultivators.</p><br/><p>As soon as it touched them, their faces fell, and blood sprayed out of their mouths. Regardless of the various levels of their cultivation bases, they were incapable of standing up to the mightiness of the wind, and their bodies were ripped into shreds. Blood and gore sprayed out in all directions.</p><br/><p>As for Chang Yi, his face instantly went as pale as death, and his pupils constricted. His cultivation base was at the great circle of the Nascent Soul stage, so it was with great astonishment that he was barely able to stand up to the wind. However, the wind then wrapped around him, transforming into an enormous hand that grabbed him violently.</p><br/><p>It squeezed down, and cracking sounds could be heard. Chang Yi screamed miserably. “Masters! Save me!!”</p><br/><p>When the onlookers saw this, their faces flickered with astonishment. Up on the second mountain peak, Patriarch Darkheaven shot to his feet. The hearts of the seven apprentices outside of the temple filled with shock.</p><br/><p>On the fourth mountain peak and the fifth mountain peak, similar scenes played out.</p><br/><p>“What is he doing!?”</p><br/><p>“I can’t believe he actually killed so many people!!”</p><br/><p>“Is he challenging the torture chamber to battle?”</p><br/><p>“This… this was just a test, but he responded in this way!?”</p><br/><p>At this point, a cold snort echoed out from Mount Ironblood, and two streams of divine sense shot down toward the land below to rescue Chang Yi.</p><br/><p>Meng Hao’s expression was calm as the huge hand in mid-air suddenly began to squeeze shut.</p><br/><p>“Stay your hand!” roared the two streams of divine sense.</p><br/><p>Even as the sound rang out, Chang Yi’s screaming reached a fever pitch.</p><br/><p>“No…” he cried. “This… was just… a test….” Before he could finish speaking, a boom echoed out as his body was crushed into a pulp of mutilated flesh. His Nascent Soul was also completely destroyed. He was dead in flesh and soul.</p><br/><p>To him, it was just a test, but to Meng Hao… when it came to attacking, there was no such thing as any so-called testing.</p><br/><p>Deathly silence filled the air. No one could ever have predicted that a simple test would unexpectedly end this way. Moments later, the two streams of divine sense descended toward Meng Hao.</p><br/><p>“Are you looking to die?!” roared one.</p><br/><p>“How dare you kill my Mount Ironblood disciples! I’m going to crush you!” The two Ironblood Patriarchs were furious. At the moment, it didn’t matter that Meng Hao was the Blood Prince, or that they could sense something strange about his cultivation base. Those things didn’t matter.</p><br/><p>Truth be told, there was something strange about Meng Hao’s cultivation base. The life force of a Resurrection Lily obscured the traces of his Second Severing, making it seem that he was only in the First Severing level.</p><br/><p>He looked up, and not a trace of hesitation could be seen in his eyes as he sent his divine sense shooting out with intense ferocity.</p><br/><p>BAM!</p><br/><p>His divine sense was simply too powerful. The fact that the two Ironblood Patriarchs were Spirit Severing cultivators didn’t matter. Their streams of divine sense were completely incapable of standing up to to Meng Hao’s, and were immediately shattered.</p><br/><p>Massive ripples raged through the Blood Demon Sect, whipping the trees and vegetation into a fury. All of the surrounding cultivators gasped in astonishment.</p><br/><p>“There’s no need to come down here to try to subdue me,” said Meng Hao coldly. “I’ll head up there to subdue the two of you!” With that, he flew directly toward the first mountain peak.</p><br/><p>As of this moment, the entire Blood Demon Sect was in a complete uproar!</p><br/>\n</div>"}