{"title": "Chapter 704: Blood Demon Grand Magic", "id": 704, "volume": 8, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-704-blood-demon-grand-magic", "volume_title": "Volume 8", "body": "<h1>Chapter 704: Blood Demon Grand Magic</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 704: Blood Demon Grand Magic</strong></p><br/><p>“Interesting,” murmured Patriarch Darkheaven. “The Patriarch did not assign him a mountain peak, nor any followers, huh…? What does that mean?” He appeared in the form of a boy wearing scholar’s garment, and he stood there with his arms clasped behind his back.</p><br/><p>“Master,” said one of the apprentices standing behind him, “why the hell does a stranger get to be the Blood Prince? I can’t accept this!”</p><br/><p>“Yeah, allow us to go fight this Meng Hao guy, Master! Let’s see whether or not he has the skill to act as the Blood Prince!”</p><br/><p>“What’s your rush?” the boy said with a ghastly chuckle. “There will most certainly be others who are in much more of a hurry than you.” Without another word, he turned to head back into his Immortal’s cave.</p><br/><p>The seven apprentices’ killing intent filled the air. They exchanged glances and then stared back at Meng Hao as he descended the stone steps of Mount Blood Demon.</p><br/><p>A similar scene played out on the fourth mountain peak of the Blood Demon Sect, albeit with much more intensity. The three Demonfire Patriarchs [1. This is a slight change from when the chapter was originally released. In later chapters, Er Gen changed the name and number of the Patriarchs from the fourth mountain peak. I'm adjusting this instance to maintain continuity] did nothing to restrain themselves, and their fury and arrogance exploded up.</p><br/><p>Only the fifth mountain peak was silent. At the very peak of the mountain was a white-haired, hunchbacked old man who supported himself with a walking stick as he looked off toward Mount Blood Demon.</p><br/><p>Next to him stood a girl who was quite pretty, yet also radiated killing intent.</p><br/><p>“Master,” said the girl, “why prevent the disciples of Mount Ghostcrutch from expressing their discontent with the Patriarch’s arrangement? It’s inherently unfair! I could accept it if Chang Yi from Mount Ironblood became the Blood Prince. But I’ve never even heard of this Meng Hao before.”</p><br/><p>The old man smiled. His voice hoarse, he said, “Your Master has lived for a long time. Although I used to be a bit of a fool, I’ve become much more sensible over the years.</p><br/><p>“You know, I was there on Mount Blood Demon the year the Patriarch descended.</p><br/><p>“Throughout the years, the position of Blood Prince has been filled seven times. I was there every single time.</p><br/><p>“I’ve lived a long time and seen many things. These eyes of mine can pierce through the ancient and archaic…. I can tell that this Meng Hao carries something very unusual.”</p><br/><p>The girl beside him frowned.</p><br/><p>“Don’t provoke him,” continued the old man. “Don’t even get near him. Master needs to observe him a bit more before making a decision.” His eyes glittering, the old man returned to his Immortal’s cave.</p><br/><p>Meng Hao’s expression was calm as he walked down the steps. When he was about halfway down the mountain, he suddenly paused as he caught sight of a white-robed woman up ahead. She stood on a boulder off to the side, in front of which was a cliff that stretched down into swirling fog.</p><br/><p>The woman’s robes swayed in the wind, making her look quite otherworldly. She was beautiful, and in this moment, looked like a graceful Immortal.</p><br/><p>Meng Hao glanced at her for a moment and then looked away as he continued down the mountain.</p><br/><p>The woman turned and stared at Meng Hao. “Elder Brother Meng,” she said, “we last ran into each other in the Demon Immortal Sect. Could it be that you’ve forgotten about humble little me?”</p><br/><p>This woman was none other than Blood Demon Sect Dao Child Li Shiqi, who had been dressed like a man the first time Meng Hao met her. [1. \"No rod\" Li Shiqi was formally introduced in chapter 175. During the faceoff at the Song Clan search for a son-in-law in chapter 189, she stood by Meng Hao's side. She muttered something relatively important in the Demon Immortal Sect in chapters 582-583. In chapter 596, she recalled how she came to view her Master as her own father. In addition to these references, she appeared on multiple other occasions. As Dao Child of the Blood Demon Sect, she was there for almost all of the most important public events in the Southern Domain]</p><br/><p>Meng Hao didn’t say anything in response. He merely looked at her and nodded, then continued on his way down the stairs.</p><br/><p>“Elder Brother Meng,” she continued, “the only people who live on Mount Blood Demon are myself and the Patriarch. I’ve been waiting in this spot because I need to give you a warning. The other four mountains won’t approve of you being appointed as the Blood Prince.” She waved her graceful hand, sending a jade slip flying out.</p><br/><p>“This is a bit of information about the other four mountain peaks,” she went on. “Take a look, it should be helpful.”</p><br/><p>Meng Hao accepted it and was silent for a moment. Finally, he said, “Thank you,” and proceeded on his way.</p><br/><p>“How… how is Fellow Daoist Xu Qing?”</p><br/><p>“Thank you,” he repeated, his voice drifting up from further down the mountain.</p><br/><p>After leaving Mount Blood Demon, Meng Hao found himself in a bleak and desolate forest. The Blood Demon Sect was not like other Sects, where grand temples existed at the bottoms of the mountains, filled with Outer Sect disciples.</p><br/><p>Although there were Outer Sect disciples, they also resided on the mountains. As for the region beneath the mountains, there existed only forests.</p><br/><p>They weren’t completely uninhabited, though. Log cabins could be seen throughout them, belonging to disciples who had descended from the mountains to practice cultivation in isolation. There were quite a few visible, although some were in states of disrepair.</p><br/><p>Occasionally, disciples could be seen and, without exception, they looked at him coldly and without an ounce of respect.</p><br/><p>Meng Hao’s expression remained calm in the face of the coldness. He had sensed that he was the subject of many, many such gazes when he made his way down the mountain. Therefore, he proceeded until he found remote corner of the sect where he then sat down cross-legged. He closed his eyes and retrieved the soul orb of the exhausted and slumbering Xu Qing, who he examined for a long moment before stowing away.</p><br/><p>At the same time, quite a few streams of divine sense from the surrounding mountain peaks were retracted by their owners, not a few of which were filled with disdain.</p><br/><p>“What kind of Blood Prince is this Meng Hao? I thought he was supposed to be super skilled! He can’t even fight with somebody for a log cabin at the bottom of the mountains!”</p><br/><p>“He’s not even willing to provoke anyone over a log cabin? In the Blood Demon Sect, everything depends on your strength and viciousness! Immortal’s caves, mountain peaks, one’s beloved, techniques, cultivation resources, everything goes to the strongest! And that includes the position he holds!”</p><br/><p>“Hmph. He wants peace and quiet, huh? Well, considering he acquired a position that wasn’t his to begin with, he better give up that idea!”</p><br/><p>“Although, there’s no reason to act too quickly. We only know a little bit about him, so let’s just observe for a bit longer….”</p><br/><p>Meng Hao closed his eyes and ignored all of the gazes and streams of divine sense, which he couldn’t care less about. Instead, he sent his own divine sense into his bag of holding. There, he found the Blood Mastiff, who had been seriously injured defending him against the 10th Wang Clan Patriarch. It had now regrown a physical body, although it was still weak and small.</p><br/><p>And then there was the matter of the parrot and the meat jelly…. When Meng thought of them, he frowned. He hadn’t seen any traces of them since he awoke on the Underworld Ship.</p><br/><p>However, he had the strange sense that the two ninnies were definitely in the Southern Domain.</p><br/><p>Silently, he rotated his cultivation base until night fell. Finally, he opened his eyes and produced Xu Qing’s desiccated corpse. He slowly fused the golden magical symbol into it, whereupon she instantly began to show signs of life. Gradually, she began to recover.</p><br/><p>Her skin slowly changed, and her entire body began to look more limber and charming as she showed signs of awakening. It was a process that would take nine nine-day-cycles, a total of eighty-one days, to complete.</p><br/><p>Meng Hao suppressed the excitement he felt, looked her over for a long moment, then carefully put her body away.</p><br/><p>“Elder Sister Xu, your eyes will open in eighty-one days,” he murmured. After a long moment, he finally took out the blood crystal given to him by Blood Demon.</p><br/><p>He looked at it for only a moment before unhesitatingly pinching it between his fingers. Immediately, all the blood in his body began to seethe as if it were boiling, and emanate an indescribable, bloody aura.</p><br/><p>Simultaneously, magical symbols appeared in his head. They emanated a crude, ancient aura that transformed into a legacy.</p><br/><p>At the same time, the blood-colored mask inside of his bag of holding suddenly began to emit intense ripples. The Blood Mastiff inside trembled, seemingly instinctively responding to the aura coming out of Meng Hao, which it in turn absorbed.</p><br/><p>“Blood Demon Grand Magic!” murmured Meng Hao.</p><br/><p>The Blood Demon Grand Magic was actually a taboo art in the Blood Demon Sect. Only Patriarch Blood Demon himself possessed it. Even previous Blood Princes of the sect had only been introduced to the art orally. Meng Hao was the only one to acquire the true lifeblood legacy.</p><br/><p>The magic was organized into six levels, which were organized two to a stratum, meaning there were three strata in total.</p><br/><p>“Qi and Blood, Spirit Meridians, Blood Soul….” he murmured, and a red glow appeared in his eyes. He suddenly discovered that he was possessed of incredible latent talent in regards to the cultivation of the Blood Demon Grand Magic.</p><br/><p>After only a moment, he reached the first level, and was halfway through the Qi and Blood stratum.</p><br/><p>The Qi and Blood stratum was terrifying; it was capable of absorbing the power of someone else’s Qi and Blood.</p><br/><p>Immediately, Meng Hao’s eyes turned as red as fire. He slowly lifted up his hand, which had now turned bright red.</p><br/><p>It was almost like his hand was covered with innumerable black holes, all of which were ready… to consume Qi and Blood.</p><br/><p>“I can’t believe I was able to cultivate this art so quickly….” thought Meng Hao. “It must have something to do with my cultivating the Blood Immortal divines abilities…. Blood Immortal. Blood Demon…. There must be some relationship between the two.” After a moment of thought, he realized there might be another explanation. He reached inside of him and realized that his Demon Sealing magics were now slightly different than before.</p><br/><p>It was as if some intangible change had occurred, although he was unsure of the exact details.</p><br/><p>“Patriarch Blood Demon cares about my status as a Demon Sealer. In that case, perhaps that is why the Blood Demon Grand Magic was so easy for me to cultivate.”</p><br/><p>He contemplated the matter a bit further, and after a moment, decided that he might as well make another attempt at cultivating the Blood Demon Grand Magic. Following the prescribed method, he continued on. Two hours later, his eyes snapped open, and the bloody glow in his eyes seemed to have completely filled the pupils; he looked terrifying to an astonishing degree.</p><br/><p>“The great circle of the Qi and Blood stratum!” Meng Hao took a deep breath. By now, he could see just how tyrannically frightful the Blood Demon Grand Magic was. By consuming the Qi and Blood of others, it could strengthen the fleshly body!</p><br/><p>As for how strong, there seemed to be no limits!</p><br/><p>“Unfortunately, it’s not permanent and is only a borrowed power.” His eyes glittered as he suddenly was filled with the strong desire to enter halfway into the Spirit Meridians stratum of the Blood Demon Grand Magic.</p><br/><p>“All Cultivators build up vast quantities of spiritual energy in their bodies. Because of that, spirit meridians exist. The Spirit Meridians level allows me to consume the spirit meridians of others, which I can use to add to my cultivation base.”</p><br/><p>He closed his eyes and sank into cultivation. The sun was high in the sky before he finally opened his eyes and frowned.</p><br/><p>“I can’t cultivate it. I’m missing something.” He was in the middle of considering the matter when suddenly the archaic voice of Patriarch Blood Demon echoed in his ears.</p><br/><p>“Very good. You reached the second level of the Blood Demon Grand Magic. When you reach the third level, I will give you something that is sure to leave you astonished.</p><br/><p>“It has something to do with your League of Demon Sealers. With that item, you will be able to acquire… a Demon Sealing magic!”</p><br/><p>Meng Hao looked up toward Mount Blood Demon. He didn’t speak, but his heart trembled. As of this moment, he was now absolutely certain that Patriarch Blood Demon… placed importance upon his identity as a Demon Sealer.</p><br/><p>“Just what secrets have I yet to uncover about the Demon Sealers?” he thought. Despite being a Demon Sealer for many years, he still could use only the Eighth Demon Sealing Hex and Righteous Bestowal.</p><br/>\n</div>"}