{"title": "Chapter 700: True Patriarch Six-Daos", "id": 700, "volume": 7, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-700-true-patriarch-six-daos", "volume_title": "Volume 7", "body": "<h1>Chapter 700: True Patriarch Six-Daos</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 700: True Patriarch Six-Daos</strong></p><br/><p>In almost the exact moment in which Meng Hao used the Mountain Consuming Incantation to summon the image of the Ninth Mountain, far out in the starry sky outside of Planet South Heaven, the indescribably majestic Ninth Mountain suddenly trembled.</p><br/><p>Along with the trembling, the will of the mountain, as if in response to some mysterious call, neared South Heaven and descended into Meng Hao’s palm, onto the rapidly expanding image of the Ninth Mountain.</p><br/><p>It was only a sliver of will, but to Meng Hao and the surrounding discarnate souls, it was shocking to the extreme.</p><br/><p>The astonishment of the discarnate souls was at a pinnacle.</p><br/><p>“Resonance!!”</p><br/><p>“He… actually formed a resonance with the Ninth Mountain!!”</p><br/><p>The discarnate souls trembled, and Meng Hao’s eyes were now anything but blank. He suddenly waved his right hand, and the Ninth Mountain in his hand shot forward.</p><br/><p>As it bore down on the self-proclaimed Moon Divinity, the discarnate soul defended with every bit of power it could muster. Countless heavenly bodies appeared around its and shot forward to block the mountain.</p><br/><p>BAM!</p><br/><p>The heavenly bodies collapsed, and the Moon Divinity discarnate soul let out a disconsolate shriek as the Ninth Mountain slammed into it, completely destroying it in all aspects….</p><br/><p>Then the Ninth Mountain smashed into the enormous vortex, shattering it into pieces. It seemed as if the mountain was completely unstoppable. The other three discarnate souls on the altar retreated in complete terror, but they were too slow for the Ninth Mountain.</p><br/><p>Amidst the rumbling, one managed to dodge to the side. The other two, however, howled miserably. They unleashed all of their divine abilities and magical items, but in the end… they were completely destroyed.</p><br/><p>At this point, Meng Hao, his face pale, coughed up some blood. The Ninth Mountain slowly faded away.</p><br/><p>As it disappeared, weakness surged through Meng Hao’s body. He had never imagined that the image of the Ninth Mountain would be so shockingly powerful; just now, he had used it to resist Dao Seeking!</p><br/><p>Unfortunately, the price paid was something his cultivation base couldn’t handle. Although his soul contained an undying will, the backlash had still injured him. He now knew that if he used this particular divine ability for too long, it would wither his soul!</p><br/><p>As for the discarnate soul who had escaped, it was now fleeing in horror. It had completely lost all its nerve, and was panic-stricken because of Meng Hao.</p><br/><p>Meng Hao completely ignored it as he strode forward onto the altar. He raised his right hand and was just about to grab the crystal ball when suddenly, a desiccated hand appeared out of nowhere in front of his face.</p><br/><p>It pointed at him, and as it did, Meng Hao could see an incredible ancientness emanating off of the finger and its blackish-yellow fingernail.</p><br/><p>The finger did not send out any ripples, nor did it emit any of the power of Heaven and Earth. However, it gave Meng Hao the sense of a great Dao, almost like natural laws of Heaven and Earth.</p><br/><p>He was incapable of evading or dodging. He could only watch as the finger tapped him gently on the chest.</p><br/><p>In response, he heard an incredible roaring, and blood sprayed out of his mouth. He spun up violently into the air, as if he had been delivered a huge blow. He slammed into one of the huge temples, which then shattered into pieces, incapable of sustaining the force of Meng Hao smashing into it.</p><br/><p>He shot through the wreckage of the temple and then slammed into the roof of the cave up above. The ground trembled, and roaring echoed out in all directions. The earth split and Meng Hao shot up into the air above the Black Sieve Sect. It was almost like he was passing from the dark of Yin into the light of Yang. When he reached the end of his trajectory, his chest finally exploded into a cloud of blood.</p><br/><p>Immediately, his undying soul and Eternal stratum surged into action, causing the wound to begin to heal. And yet, even after it healed, it exploded once again, a vicious cycle. Meng Hao coughed up blood continuously until his green robe had turned violet.</p><br/><p>Down below, the disciples of the Black Sieve Sect watched on with expressions of shock on their faces.</p><br/><p>At the same time, coughing sounds could be heard from deep within the ground.</p><br/><p>A black mist began to rise up from down below, which then flooded out to cover the entire Black Sieve Sect.</p><br/><p>The coughing sound grew louder, as if someone were lurching out from within the depths of the ground.</p><br/><p>All of a sudden, an ancient voice could be heard. “I was just sleeping for a bit and you had to go stir up such a ruckus!”</p><br/><p>A skinny, shriveled old man appeared. He wore a black robe, as well as a hat. His features were wizened and ancient, pale in a way that was frightening to look at. His eyes were vacant, and his entire body radiated an aura of death, almost like a vampiric zombie.</p><br/><p>As he walked out, everything around him became freezing cold, and black snowflakes began to drift about.</p><br/><p>When the Third Severing Cultivator saw the zombie-like man appear, he immediately began to tremble and sweat. Without even thinking about it, he dropped to his knees and kowtowed. “Greetings from the junior generation, true Patriarch Six-Daos!”</p><br/><p>Simultaneously, the discarnate soul expert who had survived Meng Hao’s attack earlier immediately flew out trembling. He, too, dropped to his knees and kowtowed.</p><br/><p>“Greetings from the junior generation, true Patriarch Six-Daos!”</p><br/><p>Back underground, countless discarnate souls all dropped to their knees to kowtow, their faces filled with awe and terror. At the same time, their voices echoed out in greeting. As for the Black Sieve Sect disciples standing on the ground, they shook uncontrollably, and although they actually didn’t know who this old man was, they kowtowed nonetheless.</p><br/><p>Meng Hao’s face was unsightly, and he could feel the wound in his chest continuing to fight against his Eternal stratum. He stared fixedly at the old man for a moment before realizing that the man’s cultivation base…</p><br/><p>Was at the peak of Dao Seeking!</p><br/><p>Meng Hao could also tell that this man seemed to be slightly stronger than the 10th Wang Clan Patriarch.</p><br/><p>This was the true Dao Reserve of a great sect. Any of the five great sects or three great clans in the Southern Domain would have a similar Dao Reserve. Were it not for that, how could they possible pass their legacies down for ten thousand years or beyond?</p><br/><p>The old man coughed a bit, then stretched a stiff hand out and made a claw-like gesture toward the ground. The turbid, underground river suddenly surged and then flew up out of the ground. As it did, it shrank down until it could circulate in the air around the old man.</p><br/><p>At the same time, the old man pointed toward the incense burner on the First Mountain, causing it to shudder and then fly through the air toward him. It shrank down until it was the size of a fist, and then opened up, after which the turbid river flowed inside. Finally, the incense burner came to rest on the old man’s palm.</p><br/><p>By now it didn’t look like an incense burner, but rather, a flagon of alcohol.</p><br/><p>The old man raised it up to his lips and took a sip. Then, his eyes glowing with a strange light, he looked over at Meng Hao.</p><br/><p>“You have a pretty good cultivation base,” he said. “If it weren’t for me, the Black Sieve Sect’s foundation of ten thousand years would actually have been destroyed.” The old man then pointed toward the ground, causing the crystal ball with Xu Qing’s soul in it to fly out. He clasped it between two fingers. “Do you want her?”</p><br/><p>Wisps of black mist circulated out from the old man’s hand to encircle the crystal ball. They transformed into vicious, wicked spirits who peered into the crystal ball with greed and avarice as if they wanted to rush inside.</p><br/><p>Xu Qing’s soul immediately began to tremble, as if it was experiencing intense fear.</p><br/><p>Meng Hao’s heart also began to quiver.</p><br/><p>“I can sense the aroma of rebirth,” the old man said hoarsely. “My disciples and apprentices must have been refining her for my use. What is she to you? Your beloved?”</p><br/><p>Meng Hao glared at the old man, but didn’t respond. Pain stabbed through his heart, and his entire body was trembling.</p><br/><p>“Not going to say anything?” The old man gently squeezed his fingers down. Cracking sounds could be heard as fissures appeared on the surface of the crystal ball.</p><br/><p>“She’s my beloved!” Meng Hao took a deep breath and continued to stare at the old man.</p><br/><p>“Then it’s proper for you to have come,” the old man said calmly, the aura of death around him growing thicker. “If you didn’t show up, her soul would have become nourishment for me, and her body would have been refined into a medicinal pill to add to my collection.”</p><br/><p>By now, the sky was completely dark, and the moon was out. As its rays shone down, the old man looked up for a moment, then caused the black mist to cover it up.</p><br/><p>“Unfortunately, you coming here was useless. Although, I might as well give you a chance.” His murky eyes began to glow with a strange light. “Go ahead and use your best divine abilities and magical techniques. If you can handle one blow from me, then I’ll let you leave with her soul. What do you say?”</p><br/><p>Meng Hao stared at this true Patriarch of the Black Sieve Sect, the most powerful person in the entire sect. Inside, he smiled bitterly. In actuality, he knew before coming here that things would probably not go smoothly. However, he had come anyway.</p><br/><p>Not coming would have violated his own Dao!</p><br/><p>Furthermore, he came without the intention of leaving!</p><br/><p>“You live, I live. You die, I die…. That is a promise.” Meng Hao took a deep breath and then lifted his hand up. In his left eye, a bright glow like day gradually appeared. In his right eye could be seen a darkness like night.</p><br/><p>This was his most powerful divine ability, which he had acquired after gaining enlightenment about darkness and light from the armored man on the Underworld Ship.</p><br/><p>In his right hand, a black mist appeared, along with a white mist.</p><br/><p>As soon as the two streams of mist appeared, the Black Sieve Sect’s true Patriarch, Six-Daos, stared in shock.</p><br/><p>“So, it’s this….” he said.</p><br/><p>The reason he hadn’t killed Meng Hao immediately was because he had sensed some type of good fortune on him. Considering the level of true Patriarch Six-Daos’ cultivation base, he could feel premonitions for both crisis and good fortune.</p><br/><p>He was now eying Meng Hao in much the same way that the 10th Wang Clan Patriarch had eyed Meng Hao for his Perfect Foundation. He could faintly sense that Meng Hao had something that could be considered incredibly useful good fortune.</p><br/><p>A stiff smile appeared on the face of true Patriarch Six-Daos. His eyes flickered as he watched the black and white mists grow rapidly thicker until they finally formed into two pearls.</p><br/><p>Black Pearl!</p><br/><p>White Pearl!</p><br/><p>The instant the two pearls appeared, true Patriarch Six-Daos’ pupils constricted. Despite his cultivation base and level of power, his face still filled with disbelief.</p><br/><p>“This is… a Dao!</p><br/><p>“It’s not an ordinary Dao, either. These black and white pearls give me a sense of limitlessness, as if they contain….”</p><br/><p>Meng Hao’s eyes flashed and he suddenly stretched out his right hand. He actually didn’t know how to use the two pearls, but they were definitely his most powerful magical technique.</p><br/><p>As he waved his hand, the two pearls transformed into two beams, one black, one white, that shot toward true Patriarch Six-Daos.</p><br/><p>In that instant, the sky suddenly changed colors. The entire world became one of black and white. There was no third color that existed!</p><br/><p>“Heavenly Dao!</p><br/><p>“This is a Heavenly Dao, not of the Ninth Mountain, but from outside the great Nine Mountains!!”</p><br/><p>-----</p><br/><p><em>This chapter was sponsored by Carlos Cardenas Jauregui, Lorenzo Ibarria, Tanawut Pitchayaboonwong, Patryk Czajczyński, and Mustaqeem Ahmed</em></p><br/>\n</div>"}