{"title": "Chapter 701: Blood Prince of the Blood Demon Sect", "id": 701, "volume": 8, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-701-blood-prince-of-the-blood-demon-sect", "volume_title": "Volume 8", "body": "<h1>Chapter 701: Blood Prince of the Blood Demon Sect</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong></strong></p><br/><p>[/expand]</p><br/><p>“The black pearl represents death and the white pearl represents life!</p><br/><p>“No, wait. The white pearl represents death and the black pearl represents life!</p><br/><p>“Hmm, that’s not right either. How many Daos are represented here? The cause and effect of Karma. Truth and falsehood. Life and death. The cycle of reincarnation. Heaven and Earth….” True Patriarch Six-Daos’ face flickered. As the pearls neared him, he waved his right hand out in front of him. Immediately, the incense burner flew out and began to expand. Turbid water suddenly exploded out from within.</p><br/><p>“Yellow Springs!” growled true Patriarch Six-Daos, causing the turbid water to emanate a monstrous aura of death. It expanded, transforming into a river that swept toward the two pearls.</p><br/><p>However, even as it neared the pearls, the Yellow Springs began to tremble and then fall apart…. Countless souls appeared and began to dissipate out in all directions, looking blank and confused.</p><br/><p>Next, the incense burner trembled, and images of burning incense sticks from inside began to float up. True Patriarch Six-Daos’ face flickered, and he quickly flashed an incantation gesture with his right hand and then pointed out.</p><br/><p>“Joss Flame!” The incense burner began to shake, and illusory worlds suddenly sprang into being. All of them contained countless living beings who were kowtowing on bended knees.</p><br/><p>Along with their obeisance, their auras pulsed up into the air and then merged together. Next, the worlds themselves transformed into statues, each one of which bore the semblance of true Patriarch Six-Daos. They then shot at top speed toward the Black White Pearls.</p><br/><p>The two pearls closed in, and a shocking boom rattled out. All of the worlds and statues instantly turned black and white, then began to collapse. The incense burner trembled and then shrank down rapidly. True Patriarch Six-Daos’ face once again flickered. He stretched his right hand out and pushed down toward the ground.</p><br/><p>“Yin-Yang Rotation; Heaven and Earth Transformations!” He held his right hand aloft, causing an enormous flag to appear.</p><br/><p>As the flag swept out, shockingly, countless souls could be seen inside, howling.</p><br/><p>“One Billion Joss Souls.”</p><br/><p>Astonishingly, one billion souls were inside the unfurling flag, which flew directly toward the Black White Pearls, emanating the shocking howls of the billion souls.</p><br/><p>It only took a moment for the billion souls to be dispersed. However, the Black White Pearls were incapable of maintaining their form, and once more transformed into black and white mist that shot toward Six-Daos.</p><br/><p>Six-Daos’ eyes filled with a strange light, and he did nothing to evade. In fact, he strode forward as the black and white mists neared, and then opened his mouth to swallow them. At the same time, a three-headed six-armed figure appeared behind him, which also opened its gaping mouth.</p><br/><p>Six-Daos directly swallowed the black and white mists, whereupon his body began to tremble. His face paled as he tried to endured the force, but it was clearly too great. He coughed up a mouthful of blood, and then cracking sounds could be heard coming from inside his body. Suddenly, the black and white streams of mist burst out from his chest and then faded away into the air.</p><br/><p>The surrounding Black Sieve Sect disciples were completely shocked. Meng Hao stood there silently, looking at true Patriarch Six-Daos. This was in fact his most powerful technique he could employ.</p><br/><p>“Interesting. Very interesting!” said Six-Daos, lifting his head up and laughing loudly. “Great! What an excellent divine ability. Well, you accomplished the task I arranged for you, therefore, it’s time to fulfill my end of the bargain!” With that, he tightened his left hand, causing cracking sounds to fill the air as nearly half of the crystal ball Xu Qing’s soul was shattered. Her soul did not emerge, however, and the discarnate souls in the area all shot forward with expressions of insatiable greed.</p><br/><p>“You!!” roared Meng Hao, his eyes bright red. Right now, he didn’t care about life or death. He didn’t care about anything in the world except for the soul in that crystal ball!</p><br/><p>The soul’s eyes suddenly opened and looked at Meng Hao. It was a gaze filled with gentleness and longing….</p><br/><p>“In my years of practicing cultivation,” said Six-Daos, his voice hoarse, “I’ve never kept my promises. And since you’ve managed to piss me off, do you really think I would spare you a painful death?” With a ghastly smile, he waved his hand, causing an altar to appear next to him that resembled a pagoda, with nine steps leading to its top.</p><br/><p>On top of the altar were countless discarnate souls with bulging eyes, who emitted soundless screams.</p><br/><p>Next, Six-Daos sent the crystal ball shooting toward the altar, where it floated in the air, emitting cracking sounds.</p><br/><p>BANG!</p><br/><p>The crystal ball completely shattered, and Xu Qing’s soul emerged. The discarnate souls around her let out excited howls as they pounced.</p><br/><p>“If you can save her,” said Six-Daos, looking at Meng Hao, “then I’ll keep my promise this one time.”</p><br/><p>Meng Hao, in a frenzy, shot directly toward the altar. Before he could even get near it, though, the discarnate souls’ mouths bit into Xu Qing’s soul. Trembling, she looked over at Meng Hao, and it seemed as if there were tears in her eyes.</p><br/><p>He felt like his heart were being ripped to shreds. His voice filled with misery, he howled, “Eat MY blood and flesh!”</p><br/><p>With that he slashed at his chest with his hand, causing blood and gore to splash out in all directions. The aura of a Demon Sealer spread out explosively.</p><br/><p>The discarnate souls froze, then turned their heads. The insatiable greed in their eyes surged to an apex, and they charged toward Meng Hao. In the blink of an eye they bored into Meng Hao’s chest and began to feed.</p><br/><p>PAIN!</p><br/><p>Indescribable PAIN!</p><br/><p>However, Meng Hao didn’t care. He forced himself to continue onward. One by one, he proceeded toward the stairs that led to the top of the altar. More and more discarnate souls latched onto him, and they didn’t even bothering to bore into him before beginning to consume his flesh and blood.</p><br/><p>However, none of that could prevent Meng Hao from walking onward.</p><br/><p>The Black Sieve Sect disciples in the area were completely astonished, even the ones who harbored intense hatred for Meng Hao.</p><br/><p>Six-Daos’ eyes narrowed.</p><br/><p>Black mist billowed around Meng Hao, and his flesh and blood were rapidly disappearing. However, he still had his Eternal stratum, which caused his body to rapidly heal itself. Of course, that only led to more pain.</p><br/><p>Step after step led him to the staircase, and finally, Xu Qing. He reached out with trembling hands to take ahold of her.</p><br/><p>However, it was in this moment that Six-Daos’ eyes glittered with evil. He gave a cold snort and then stretched out a finger causally. Immediately, black mist shot toward Xu Qing’s soul.</p><br/><p>“This is over,” he said.</p><br/><p>The black mist shot toward Xu Qing. Meng Hao then let out the most desolate roar he ever had in his life. “NOOOOOOOOO!!!”</p><br/><p>Disregarding anything and everything, he stretched his hands out to grab Xu Qing. However, the black beam didn’t stop. It slammed into Xu Qing’s soul, enveloping her, transforming into what appeared to be black flames.</p><br/><p>It was at this point that Meng Hao’s hands landed on Xu Qing’s soul. They passed through the black flames to take ahold of her.</p><br/><p>The instant he touched her, the tears in his eyes finally spilled out. He had descended thoroughly into madness now. All he could do was watch as Xu Qing slowly faded away within the black flames.</p><br/><p>Xu Qing began to murmur, although no sound came out. Only her lips moved. “You live, I die…. Promise me, that you will keep on living….”</p><br/><p>Meng Hao was desolate, helpless. His cultivation base was useless, and the world was useless. “I just want to practice cultivation in happiness! I just want to be with Xu Qing! Cultivation? Just… just what kind of life is cultivation?!”</p><br/><p>It was in this moment that suddenly, a voice rang out in Meng Hao’s mind.</p><br/><p>“Promise me something, and I can help you!” The voice was completely unexpected, but as of this moment, Meng Hao didn’t care. As soon as he heard it, he responded, without hesitation, without taking time to think about how strange it was.</p><br/><p>“I promise. Anything you want. I promise!”</p><br/><p>As soon as he spoke the words, Xu Qing, who seemed just on the verge of fading away completely, was suddenly enveloped by a blood-colored beam of light that shot down from the sky.</p><br/><p>Instantly, the black flames were extinguished!</p><br/><p>Six-Daos’ face fell as suddenly, a seething red cloud appeared up above. The sky turned red, and an enormous face appeared in mid-air.</p><br/><p>It was the face of an old man, his eyes crimson, with a blood-red horn protruding from his forehead. As soon as the face appeared, the disciples of the Black Sieve Sect felt the blood in their bodies starting to boil, as if it might burst out from within them.</p><br/><p>The entire world, the sky, the land, was now the color of blood.</p><br/><p>Everything visible was completely blood-colored!</p><br/><p>Six-Daos’ pupils constricted, and his energy surged. He waved his right hand, causing the incense burner to circle around his head.</p><br/><p>“Blood Demon! Do you really dare to interfere with the matters of the Black Sieve Sect?!?!”</p><br/><p>“Why wouldn’t I dare?” replied the face in the sky. Six-Daos entire body filled with a roaring sound, as the scant amount of blood that actually existed inside of him suddenly exploded out, showering in all directions.</p><br/><p>His face flickered, and he flew up into the air, transforming into a beam of light that shot toward the face. “Everybody says Blood Demon is the Top Expert of the Southern Domain! Well I don’t believe it!”</p><br/><p>“Southern Domain?” The face shook its head. “An uncivilized land at best.” Shockingly, a wrinkled, blood-colored hand appeared that emanated a shocking blood will. It shot toward Six-Daos, grabbed him, and squeezed lightly.</p><br/><p>A boom echoed out as the incense burner shattered. The Yellow Springs vanished, and more blood sprayed from his mouth. Six-Daos was astonished to the extreme.</p><br/><p>“You… you….”</p><br/><p>“I’m not going to kill you,” the face said coolly. “That task will be accomplished in the future, by the Blood Prince of the Blood Demon Sect.” The hand loosened its grip, allowing Six-Daos to drop to the ground, his body oozing blood.</p><br/><p>The surrounding Black Sieve Sect disciples watched on with pale, astonished faces.</p><br/><p>The face in the sky slowly turned to look at Meng Hao, as if he were the only existence in the world it would deign to look upon.</p><br/><p>“You made a promise.”</p><br/><p>Meng Hao’s face was devoid of blood, but his expression was calm as he looked down at Xu Qing's soul, enveloped as she was in the red glow. She was no longer in pain, and was now slowly recovering. He looked back up at the face in the sky.</p><br/><p>“Even if it’s Demonic Transmigration, Junior is willing.”</p><br/><p>“There is no need for Demonic Transmigration. What I want you to do… is experience bedevilment!</p><br/><p>“Join the Blood Demon Sect. Turn into a one-of-a-kind Devil. Become the Blood Prince of the Blood Demon Sect!</p><br/><p>“The League of Demon Sealers will finally become Devilish. How amusing. This is not the desire of the Heavenly Dao. This is my desire!</p><br/><p>“Experience bedevilment. From now on, you are a Devil, a position above Demons. Continue on your path. What I want you do… is no longer seal Demons. No, I want to see if you can use your Demon Sealing powers to seal the Heaven of the Ninth Mountain and Sea!”</p><br/><p>-----</p><br/><p><em>This chapter was sponsored by Carl-Johan Lilja, Matthew Gessen, Chee Hou Wong, Lim Derek, and Marco Ceragioli</em></p><br/>\n</div>"}