{"title": "Chapter 719: Main Lake Eruption!", "id": 719, "volume": 8, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-719-main-lake-eruption", "volume_title": "Volume 8", "body": "<h1>Chapter 719: Main Lake Eruption!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong></strong></p><br/><p>[/expand]</p><br/><p>The appearance of a Dao Seeking aura had ensured that Meng Hao would now be completely and utterly famous within the great sects and clans of the Southern Domain.</p><br/><p>The battle just now would soon spread to become a legend in the Southern Domain, and Meng Hao’s name, and his titles of Blood Prince of the Blood Demon Sect and Grandmaster Pill Cauldron, would rise to complete prominence.</p><br/><p>Most shocking of all was that not one, but two instances of Dao Seeking aura occurred. This enabled a comparison between the two, which made it all the more astonishing.</p><br/><p>The first was the Dao Seeking aura of the Golden Frost Sect puppet.</p><br/><p>Moments ago….</p><br/><p>Everyone in the inner region of the Ancient Dao Lakes sensed it, but few actually recognized it for what it was. What they could tell, however, was that the aura was fearsome to the extreme. It immediately astounded all the cultivators in the area.</p><br/><p>“Whose aura is that?!”</p><br/><p>“It’s so terrifying! In fact, it almost feels like Heavenly might!!”</p><br/><p>“Even our sect’s Patriarch doesn’t have an aura like that!!”</p><br/><p>Tens of thousands of cultivators in the central region of the Ancient Dao Lakes, all of them from famous sects and clans of the Southern Domain, could sense the terrifying pressure of the aura.</p><br/><p>The pressure was so intense that even the Dao Shadows above the Dao Geysers and Lakes distorted, as if some intangible force were affecting them.</p><br/><p>“Dao Seeking aura!!”</p><br/><p>“It’s definitely the aura of Dao Seeking!”</p><br/><p>“Heavens! Don’t tell me there’s a Dao Seeking treasure in one of the Dao Lakes!? Or what if… it’s a Dao Seeking eccentric who came here personally?!”</p><br/><p>RUMBLE!</p><br/><p>Even as everyone looked around in astonishment, another pulse of Dao Seeking aura exploded out. The intensity of this aura far exceeded that of the first; it shook everything!</p><br/><p>Winds seethed, and even the divine abilities of the cultivators in the area were affected, and began to dissolve into chaos. Magical items began to tremble, and it seemed as if they would lose their connection to their owners.</p><br/><p>A natural law descended, something that seemed to pulse with a strange power that caused all of the cultivators to feel intense pressure suppressing their cultivation bases. At the same time, the power of their fleshly bodies seemed to temporarily increase.</p><br/><p>Furthermore, because of the Dao Seeking aura, some of the Dao Shadows above the Dao Geysers distorted to the point that they were destroyed.</p><br/><p>“Heavens! Another aura!”</p><br/><p>“This aura is even stronger than the first one! Two pulses of aura means that it’s not a Dao Seeking treasure. No, there are two Dao Seeking experts fighting!”</p><br/><p>“Who is it? What Dao Seeking eccentric showed up!? There are very few Dao Seeking cultivators in the lands of the Southern Domain. If you count them up there can’t be more than thirty, and most of them have been in secluded meditation for countless years!”</p><br/><p>A huge commotion filled the entire region of the Dao Lakes as Meng Hao and the Golden Frost Sect puppet slammed into each other. Two massive Dao Seeking forces slammed into each other, sending out a shockwave that instantly swept out like a gale-force wind.</p><br/><p>Most of the Dao Shadows were destroyed, and hundreds of thousands of cultivators felt as if their minds were under barrage. They were stunned, and required a long moment to recover.</p><br/><p>In contrast, things quickly settled down in the inner region of the Ancient Dao Lakes. After the Golden Frost Sect submitted, peace and calm were restored. Meng Hao now sat cross-legged next to the Dao Lake, contemplating the enormous Dao Shadow.</p><br/><p>The eruption of the Dao Lakes had caused two Dao Shadows to appear above the 3,000-meter lakes. One Dao shadow was being studied by Fatty, the other by Meng Hao.</p><br/><p>The Dao Shadow Meng Hao was studying was that of a middle-aged cultivator wearing a simple, ancient Daoist ensemble. He sat cross-legged, meditating, and a drop of blood hovered in front of him . He performed incantations, after which ghost images sprang up around his body. After a single glance, Meng Hao could tell that the Dao Shadow was cultivating some sort of clone magic.</p><br/><p>He couldn’t determine the the Dao Shadow’s cultivation base, but he could tell that in certain aspects, the clone magic was similar to the Withering Flame Demon Magic True Self Dao. Meng Hao looked over the image a few times, then began to immerse himself in studying it.</p><br/><p>He had examined the Withering Flame Demon Magic True Self Dao many times over the years, and had a general understanding of it. However, there were some parts that he couldn’t completely understand. He knew the general process, but not exactly how to carry it out.</p><br/><p>Every time he felt he had enlightened regarding important aspect, and then lifted his hand up to perform the incantation, he discovered that his understanding actually didn't seem to amount to anything at all.</p><br/><p>Therefore, the appearance of a Dao Image such as this was definitely a lucky break.</p><br/><p>Time went by gradually, and soon three months had passed.</p><br/><p>The eruptions of the Ancient Dao Lakes grew more intense. In the beginning, they would erupt once every four or five days. In the last month, however, the frequency had increased to every other day. Furthermore, the quantity of the items spit out was also increasing.</p><br/><p>Seven or eight corpses had appeared, as well as five beasts. The sects and clans fought bitterly over them, and the victors made incredible gains.</p><br/><p>Although the Dao Lakes were erupting with more and more items, more than half of the lakes were controlled by the Blood Demon Sect. However, nobody went near them. Meng Hao’s actions three months before made it so that anyone who even thought of trying to snatch an item from one of them would instantly think of the violent repercussions that would follow.</p><br/><p>As such, the Blood Demon Sect disciples were the most tired of all. More and more magical items were delivered to Meng Hao, and in this three months period, he had built up quite a stash.</p><br/><p>As for Meng Hao himself, he never moved from the lakeside, where he sat studying the Dao Shadow. As long as he didn’t take the initiative to disperse it, the Dao Shadow would remain in place. That was a special feature of the 3,000-meter lakes.</p><br/><p>Fatty had emerged from his meditation two months ago, seemingly enlightened on many things. Afterward, he once again closed his eyes and continued to cultivate.</p><br/><p>Two more months passed.</p><br/><p>The Dao Lakes were now erupting at a frequency of once per day. To the cultivators of the Southern Domain, the Ancient Dao Lakes had turned into something like a paradise. As long as one could secure control of a Dao Geyser or Dao Lake and avoid wandering about randomly, then shocking good fortune was guaranteed.</p><br/><p>To the cultivators in the central region, however, the increase in the frequency of eruptions meant only one thing. The main lake… would soon experience a massive eruption!</p><br/><p>The pivotal moment in this surge of activity of the Ancient Dao Lakes was about to arrive...the 30,000 meter Dao Lake, which had not produced even a single wave the entire time, was finally going to erupt!</p><br/><p>According to the information in the ancient records, the 30,000-meter Dao Lake wouldn’t erupt with just one object. It would spit out many items at once, and among them were sure to be precious treasures!</p><br/><p>In fact, it was even possible for magical items to appear that were equivalent to the legacy treasures of the sects and clans. Such items essentially gave that sect or clan the equivalent of a Dao Seeking eccentric. A possibility like that was enough to cause the cultivators of the Southern Domain to go mad with desire.</p><br/><p>Gradually, more and more eyes came to be fixed in the direction of the 30,000-meter main lake.</p><br/><p>In contrast, Meng Hao was immersed in seeking enlightenment, and in fact, had already formed some speculations about the Withering Flame Demon Magic True Self Dao.</p><br/><p>“Withering Flame. Demon Magic. True Self Dao! This is not just a clone magic! There are other Daoist magics hidden within!” This enlightenment caused Meng Hao’s mind and heart to tremble. He had never seen a divine ability or magical technique that was so profoundly layered.</p><br/><p>After another month had passed, the Ancient Dao Lakes were now erupting every few hours. The disciples of the Blood Demon Sect were swamped. They had literally no time to rest as they shot back and forth between the erupting Dao Lakes to collect various magical items and miscellaneous objects. To everyone else in the central region of the Dao Lakes, they almost looked like they were harvesting crops.</p><br/><p>The Blood Demon Sect disciples were in pain from all the hard work, but they were happy.</p><br/><p>Of course, the members of the other sects and clans watched them bustling about, and also felt a bit of pain… and they were not happy.</p><br/><p>Least happy of all were the members of the Li Clan, who were still positioned 30,000 meters away. They could do nothing more than watch on helplessly as more and more magical items erupted from within the Dao Lakes. They didn’t dare to step even a foot past the 30,000-meter border. Although there were Dao Lakes in the area they occupied, they couldn’t even compare to the ones further in. They were better than nothing, of course, but the Li Clan cultivators only continued to grow more and more frustrated.</p><br/><p>Their hatred for Meng Hao increased with each passing day.</p><br/><p>Despite that, they didn’t dare to proceed past that 30,000-meter mark. Meng Hao was just far too powerful and intimidating.</p><br/><p>The members of the Solitary Sword Sect, the Golden Frost Sect, the distant Li Clan, and the Song Clan were all looking toward the 30,000-meter main lake, suppressing their emotions and continuing to wait.</p><br/><p>“Come on, hurry up! The 30,000-meter main lake is going to erupt soon!”</p><br/><p>“We’ve been waiting the entire time just for this day! The only thing we don’t know is exactly when the eruption will occur!”</p><br/><p>“That Meng Hao’s cultivation base is just too high! However, we don’t need to fight him. When the 30,000-meter lake erupts, the rules here will change. The teleportation talisman that didn’t work before will be able to function. Once the 30,000-meter lake erupts, all you have to do is grab an item and then use a greater teleportation talisman to get away! The real competition will be over who is fastest!”</p><br/><p>“Meng Hao might have a high cultivation base, but he’s only one person. With so many items, we’ll just have to wait and see who gets lucky!”</p><br/><p>The Violet Fate Sect was also taking things seriously. However, considering their close ties to Meng Hao, their attitude toward him was much warmer.</p><br/><p>The Song Clan kept to themselves, but they also had their ambitions. All the sects and clans had their hearts set on the main lake.</p><br/><p>As for the teenager who sat cross-legged behind Sir Jian in the Solitary Sword Sect, his eyes shone with a strange light as he looked toward the 30,000-meter main lake.</p><br/><p>“The reason I sent my clone here in the first place was for this instance of good fortune,” he thought. “If my augury was correct, then the good fortune I seek will be coming with this eruption. That rascal Meng Hao might have Heaven-defying power, but if we end up fighting, I’ll have no choice but to subdue him.”</p><br/><p>In the Golden Frost Sect, the man in the armor glanced over at Meng Hao, and then exchanged looks with some of the people behind him. They could all see the hesitation in each other’s eyes.</p><br/><p>Then their eyes glittered, no longer with hesitation, but determination.</p><br/><p>“Fight!”</p><br/><p>“Cultivation is all about the smash and grab! When it comes to luck and good fortune, it won’t just randomly come to you! You have to fight for it!”</p><br/><p>The entire central region of the Dao Lakes gradually filled with an oppressive aura. No one spoke, and all attention was focused on the coming eruption of the 30,000-meter main lake.</p><br/><p>Meng Hao was still concentrated on enlightenment, although he wasn’t looking at the Dao Shadow anymore. His eyes were closed as he inwardly pondered the truths of the Withering Flame Demon Magic True Self Dao.</p><br/><p>Three days later.</p><br/><p>RUMMMBBBBLLLLEEEEE!</p><br/><p>The land quaked as all of the Dao Lakes ceased any eruption. The lake in front of Meng Hao began to vanish. Everything became blurry. The 3,000-meter lakes, the 300-meter lakes, the 30-meter lakes, all of the lakes dried up and shrank rapidly.</p><br/><p>Even the Dao Geysers were completely drained.</p><br/><p>It almost seemed like someone was beneath all of the lakes, breathing in, inhaling the lake water away.</p><br/><p>Of course, what came after an inhalation, was an exhalation!</p><br/><p>“The 30,000-meter main lake is going to erupt!!”</p><br/><p>“It’s going to start! This is when the true good fortune appears!”</p><br/><p>“I wonder what the 30,000-meter main lake is going to spit out! I heard that the Solitary Sword Sect’s precious treasure came from the eruption of the main lake!”</p><br/><p>The teenager from the Solitary Sword Sect rose to his feet. The armored man from the Golden Frost Sect was panting. The cultivators from the Song Clan stood there with glittering eyes. Reverend Withered-Dao was pulsating with ripples. 30,000-meters away, the Li Clan cultivators were focusing all the power in their bodies.</p><br/><p>Only Meng Hao still had his eyes closed.</p><br/><p>And then….</p><br/><p>The formerly placid 30,000-meter Dao Lake was marred by ripples, as if something were bubbling underneath its surface.</p><br/><p>BOOOMM!!</p><br/>\n</div>"}