{"title": "Chapter 730: Another Lord Fifth!", "id": 730, "volume": 8, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-730-another-lord-fifth", "volume_title": "Volume 8", "body": "<h1>Chapter 730: Another Lord Fifth!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong></strong></p><br/><p>[/expand]</p><br/><p>Outside the altar, Lu Bai suddenly looked up. His eyes shone with shock as he caught sight of Meng Hao on the third level, and heard the words of the white-colored overseer up in mid-air. He suddenly grew incredibly taciturn.</p><br/><p>“He… successfully defeated himself?” thought Lu Bai, slowly lowering his head. A moment later, he looked up again, and his eyes shone with the intense desire to do battle.</p><br/><p>“I don’t care about my status as a Young Starlord, nor my titles in the Northern Reaches, nor the rumors about me being a reincarnated, almighty cultivator. The only thing I care about… is that I must be… the strongest person in my stage!</p><br/><p>“According to my Dao, I must become a true Immortal! My heart must be intensely staunch!</p><br/><p>“If Meng Hao can do it, then I… can do it too!” With that, Lu Bai took a deep breath. Eyes radiating unprecedented resoluteness, he slowly rose to his feet and then strode back toward the first floor of the altar.</p><br/><p>“This time, I’ll definitely pass the third floor!”</p><br/><p>Meng Hao stood on that very same third floor to which he referred. He didn’t proceed onward immediately. Instead, he closed his eyes to feel the surging of his cultivation base, and the majestic third level of the Blood Demon Grand Magic. Now that he was in the Spirit Vessels stratum, he could absorb cultivation bases into his own body and transform that into incredible power.</p><br/><p>“No wonder Patriarch Blood Demon said that if I get to the fourth level of the Blood Demon Grand Magic I can hold my own against early Dao Seeking cultivators!</p><br/><p>“This Blood Demon Grand Magic is incredibly astonishing. It’s especially useful when fighting against groups. The more enemies that get stuck inside… the more powerful I can become!</p><br/><p>“Black Sieve Sect….” Meng Hao’s eyes suddenly snapped open, and they shone with incredible killing intent. His hatred for the Black Sieve Sect had long since seeped into his very marrow. If it weren’t for the Black Sieve Sect, Xu Qing wouldn’t have to enter the cycle of reincarnation, and could have had the chance at Immortal Ascension in this lifetime.</p><br/><p>Now though, they only had a hundred years, after which, this lifetime would be destroyed. This enmity… was absolutely irreconcilable!</p><br/><p>Meng Hao took a deep breath and then took a step forward, whereupon he vanished. When he reappeared, he had passed the fourth and fifth floors… and gone all the way to the ninth floor!</p><br/><p>The ninth floor was the smallest of all the floors.</p><br/><p>This was the pinnacle of the altar!</p><br/><p>This was the final barrier of the second level!</p><br/><p>After passing this floor, Meng Hao would have the option to either leave this world or, of course, enter the third level.</p><br/><p>Boom!</p><br/><p>The instant he stepped foot onto the ninth floor, he felt almost like he was at the pinnacle of the sky. Around him stretched a world of boundless flames, beyond which was nothing but pitch black.</p><br/><p>In the instant that he stepped foot onto the ninth floor, he also heard an ear-piercing, squawking laugh.</p><br/><p>The laugh sounded almost like the call of a male duck, and was filled with an indescribable arrogance.</p><br/><p>“It’s been many years since someone has stood in front of Lord Fifth, bitch! Come come, allow Lord Fifth to see how much fur you have on your body!”</p><br/><p>As soon as he heard that voice, all the noble and lofty feelings that had existed inside of Meng Hao instantly vanished . His eyes went wide with disbelief as he stared at something appearing out of thin air in the middle of the ninth level. It was…</p><br/><p>An enormous parrot!</p><br/><p>The parrot was covered with motley feathers that all stuck out on end. Its expression was one of extreme arrogance and pride, as if it was the only important thing in all of Heaven and Earth. As soon as it appeared, a shocking energy exploded out from its body.</p><br/><p>“You…” said Meng Hao, his breath quickening. This parrot appeared to be exactly the same damnable bird that had fled the instant Meng Hao faced true danger.</p><br/><p>“What do you mean ‘you,’ huh? Bitch! What, you’ve never seen a Lord Fifth as handsome as me before?” As the parrot flew out, it seemed to be completely displeased with the way Meng Hao was looking at it. Its eyes gleamed with a sharp light, and its voice was jarring.</p><br/><p>Even as it spoke, the parrot went on the offensive, charging at incredible speed. Meng Hao could barely see it, and before he could react, he was sent tumbling backward. The parrot re-formed in midair and then squawked and attacked again.</p><br/><p>Meng Hao’s face flickered. The parrot was moving so fast that he couldn’t see it clearly. Nonetheless, he was able determine that this parrot was actually not exactly the same as the damnable bird that he remembered.</p><br/><p>As for what exactly about it was different, he couldn’t quite say. It was more of a feeling.</p><br/><p>Booming sounds echoed out as the parrot attacked relentlessly. However, it didn’t seem to be able to completely overwhelm Meng Hao within a short period of time. Meng Hao retreated without hesitation; every time the parrot attacked, it almost felt like a mountain was bearing down on him.</p><br/><p>He tried using the Blood Demon Grand Magic, but the parrot was too fast and impossible to entangle. It was as if it was surrounded by some strange power that enabled it to break through anything that stood in its way.</p><br/><p>“This damned, wretched bird! How could it be so strong!?” Meng Hao frowned. At the same time, the parrot appeared suddenly in mid-air up ahead of him.</p><br/><p>Staring seriously at Meng Hao, it said, “I’m gonna screw you, bitch! Screw you, ya hear? How could your body be so tough? Well fine, the tougher the better. Screw you, screw you, screw you into a pulp…!” With a piercing cry, and incredible speed, it circled around Meng Hao, and its eyes shifted maliciously in the direction of Meng Hao’s rear end….</p><br/><p>When Meng Hao sensed that, his scalp went numb, and his heart trembled. The first thing he thought of was the parrot’s vile hobbies, and then, images of the parrot exploding rear ends suddenly flashed through his mind.</p><br/><p>These thoughts stabbed through his mind, causing his train of thought to be upset and fall into disarray, such that it caused Meng Hao to begin to shake uncontrollably. It didn’t matter how vicious he had become inside, the images left him profoundly frightened.</p><br/><p>Normally speaking, he was the one to hear the miserable shrieks of others. There was absolutely, positively no way that he wished to experience such things himself.</p><br/><p>“Dammit! DAMMIT!” Beads of sweat broke out on his forehead. Even when facing the challenge on the third floor, he had not sweat, but as of this moment, he was tempted to concede defeat.</p><br/><p>This… this was a power that cultivators were fundamentally incapable of matching up against.</p><br/><p>Especially the incessant hooting call of the damnable parrot, and how its previously curved beak suddenly transformed, becoming ever longer and straighter….</p><br/><p>A few times, it opened its mouth, after which a perverse aura blasted out, causing Meng Hao’s heart to tremble.</p><br/><p>Having no other options, Meng Hao anxiously cried out, “I know you!”</p><br/><p>“Huh?” replied the parrot, gaping. “Well, Lord Fifth doesn’t know you, so you’re gonna get screwed anyway!” With that, it prepared to charge again.</p><br/><p>“I’m your master!!” said Meng Hao, slapping his bag of holding to produce the copper mirror.</p><br/><p>“You’re insulting me!!” said the parrot, completely ignoring the copper mirror. It transformed into a black streak of light that shot toward Meng Hao.</p><br/><p>“What do I do? What do I do?!” Having noticed that the black streak of light was curving through the air to flank him from behind, Meng Hao was now in a state of complete emergecy.</p><br/><p>As the black beam of light closed in, Meng Hao had a sudden flash of inspiration as he recalled the damned bird’s fatal weakness. Without hesitation, he cried out, “Even if you were more powerful than you are now, who cares? I don’t believe for a second that you could drill a hole through this altar! You can’t, can you?!”</p><br/><p>As soon as the words left his mouth, the black beam stopped in mid-air. The parrot appeared again, and it glared at Meng Hao, as if infuriated.</p><br/><p>“What did you just say? Did you say there’s something Lord Fifth can’t do?”</p><br/><p>Meng Hao’s eyes glittered, and his thinking was suddenly stable. A look of scorn appeared in his eyes.</p><br/><p>The expression immediately caused the parrot to go mad. Its voice shrill, it yelled, “How dare you look down on Lord Fifth! Lord Fifth is omnipotent! Y-y-you….”</p><br/><p>“Pshh.” Meng Hao have a cold snort.</p><br/><p>“AHHHHHHHHH!” To be scorned with such words caused the last bit of the parrot’s powers of reasoning to be scorched away.</p><br/><p>“You just watch, bitch!” raged the parrot. “Watch Lord Fifth! Watch Lord Fifth bore a massive hole into this altar!” With that, the parrot flew up into the air and then turned to charge toward the altar.</p><br/><p>The white-colored overseer immediately flew down to intercept the parrot.</p><br/><p>“Immortal Fifth, please calm yourself. Calm… There’s no need to get impulsive, right? Listen to me….”</p><br/><p>“Screw off and listen to this, bitch!” roared the parrot.</p><br/><p>“Immortal Fifth, I….” The white-colored overseer smiled wryly and was about to expound when….</p><br/><p>“I said screw off, bitch! If you don’t, I’ll screw you along with him!”</p><br/><p>The white-colored overseer was getting extremely nervous. This was the first time it had heard of the parrot having such a weakness. It looked over angrily at Meng Hao, and was about to rebuke him, when Meng Hao saw the look in his eye, rolled his eyes and then snorted coldly.</p><br/><p>“He doesn’t believe you can break through the altar either. Forget about the altar. I bet you couldn’t even screw that white-colored overseer!”</p><br/><p>“AHHHHHHHH! How dare you look down on me like this!” The parrot’s fury raged to the Heavens. It jerked around to glare at the white-colored overseer, who immediately began to tremble.</p><br/><p>Seeing that the parrot was about to attack, the overseer immediately roared without hesitation, “You pass!! Pass!!!”</p><br/><p>Instantly, the altar began to rumble, and an incredible force enveloped the parrot, who did nothing to fight back. As the power covered it over, it stared fixedly at the rear end of the white-colored overseer.</p><br/><p>“When this place was built, Lord Fifth helped out, and therefore left behind a stream of divine will,” said the parrot. “Truth be told, it would be difficult to break a hole through the altar. However, if I have the chance, you cheeky little beast, Lord Fifth will definitely give screwing you a try!”</p><br/><p>With that, the parrot gave a cold snort, then glared over at Meng Hao. It said nothing, but the look in its eyes was clear.</p><br/><p><em>You just wait, brat. If I get a chance, I’ll screw you too!</em></p><br/><p>Meng Hao glared back at the parrot. He didn’t say anything either, but his meaning was equally clear.</p><br/><p><em>You just wait, you damned bird. When I get out of here, I’m going to track you down, and then we’ll see who’s boss!</em></p><br/><p>Meanwhile, in the Milky Way Sea, on the shore near the Northern Reaches, a hulking, dark-faced man currently hovered in mid-air. Surrounding him was a group of smaller cultivators, all of whom looked at the man with fawning eyes. The dark-faced man seemed quite pleased with himself.</p><br/><p>In his arms he carried a black bear, which he would occasionally lean down to kiss, his expression one of intoxication. The bear had a luxuriant coat of fur, and it was hard to tell where he had found something like it in the Milky Way Sea….</p><br/><p>“Ah, this is the life! Don’t be despondent, little Third. It’s merely a master we’re talking about. We can always get a new one! Look, after somebody else gets the mirror and refines it, then we can go back. Look at how free and unconstrained we are now! This is the good life!”</p><br/><p>Suddenly, the dark-faced man sneezed, then shuddered. A strange look appeared in its eyes, and suddenly two voices began to argue inside of him.</p><br/><p>“What’s going on? What was that? Lord Third just sneezed!”</p><br/><p>“Screw off, it was obviously Lord Fifth who sneezed!”</p><br/><p>“You’ll even steal that from me?!”</p><br/><p>“Something fishy is going on here, bitch! Something’s off! I feel an evil wind stirring, as if something bad is about to happen!”</p><br/><p>“Huh?! Don’t tell me Meng Hao is alive!! Finished! We’re finished! I’m gonna die, we’re finished! When we ran off that time….”</p><br/><p>“What do you mean ran off? That was a strategic transition! You don’t understand crap!”</p><br/><p>“Dammit! Last time, you said we needed to give him a chance to temper himself. You’re changing your mind again?”</p><br/><p>“Are you absolutely sure that’s what I said?”</p><br/><p>“You did! You said it! You said….”</p><br/><p>Despite the bickering, the dark-faced man turned and flew toward the Northern Reaches.</p><br/><p>“Let’s go to the Northern Reaches, it should be safe there….”</p><br/>\n</div>"}