{"title": "Chapter 743: Call Out To It! Does It Answer?", "id": 743, "volume": 8, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-743-call-out-to-it-does-it-answer", "volume_title": "Volume 8", "body": "<h1>Chapter 743: Call Out To It! Does It Answer?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 743: Call Out To It! Does It Answer?</strong></p><br/><p>As soon as Meng Hao’s words echoed out, the majority of the hundreds of thousands of enemy cultivators immediately burst out into raucous laughter.</p><br/><p>“What did he say? Darling? Come home?”</p><br/><p>“Has Meng Hao gone insane?”</p><br/><p>“This is pretty funny. It’s the first time I’ve seen such a powerful expert go crazy!”</p><br/><p>Six-Daos was also laughing loudly. “I’ve lived a long time, but this is the first time I’ve encountered a lunatic like you!”</p><br/><p>Even the black-robed expert from the Solitary Sword Clan split off a strand of divine sense to observe what was happening. After he saw what was happening, he shook his head and laughed.</p><br/><p>The voices and laughter rippled out, and all sorts of snide, mocking comments could be heard. When they first spoke, the wooden sword was just on the verge of slashing down. However, even in the middle of deriding Meng Hao, looks of astonishment began to appear on each of their faces.</p><br/><p>That was because… the sword did not slash down, but rather, lurched to a stop.</p><br/><p>When the sword lurched to a stop, it seemed as if hundreds of thousands of hearts similarly lurched to a stop.</p><br/><p>Six-Daos’ eyes went wide, and the Blood Demon Sect disciples inside the second shield layer seemingly forgot how to breathe. They stared blankly at their Blood Prince, who standing outside the shield, beckoning toward the astonishing precious treasure that was the wooden sword.</p><br/><p>Up in mid-air, the black-robed Patriarch who was fighting Patriarch Blood Demon had originally been extremely pleased. All of a sudden, however, the sword ground to a halt, and his heart began to thump.</p><br/><p>The wooden sword came to a stop about thirty meters above Meng Hao. The power of Time emanated out in all directions, causing everything to wither. Even the second shield layer was rippling and distorting. In this condition, it seemed that the slightest tap would cause it to instantly shatter.</p><br/><p>And yet Meng Hao… was not affected by the wooden sword, even in the slightest.</p><br/><p>The wooden sword seemed to have a spirit of its own, and was apparently hesitating. After stopping in mid-air, glittering light seemed to dance fluidly across the blade.</p><br/><p>Six-Daos’ face flickered with disbelief. What he was seeing completely exceeded the limits of his imagination. It didn’t matter that he used to be at the peak of Dao Seeking, or the Patriarch of a great sect. The events that he was witnessing with his own eyes left him completely shaken.</p><br/><p>He was incapable of even comprehending what was happening. Why had the Solitary Sword Sect’s legacy precious treasure… ground to a halt directly in front of Meng Hao? Furthermore, it even seemed to be hesitating.</p><br/><p>He could not come up with any explanation, even though he wracked his brains over and over again.</p><br/><p>“Impossible!” he thought, gritting his teeth and causing his cultivation base to rumble with power. He used every scrap of strength he had to try to control the wooden sword, but there wasn’t the slightest reaction. The sword completely ignored him and, even more shocking, directly severed their connection.</p><br/><p>When that happened, Six-Daos’ face fell even more.</p><br/><p>The surrounding hundreds of thousands of cultivators stared with wide eyes at a scene they would likely never encounter again in their entire lives. Most incredulous of all were the cultivators from the Solitary Sword Sect.</p><br/><p>The wooden sword was a legacy precious treasure of the Solitary Sword Sect, the symbol and foundation of their entire sect!</p><br/><p>There was someone even more shocked than the ordinary disciples, however. The black-robed old man up in midair simply couldn’t believe what was happening. His mind felt as if lightning were crashing around inside. Unable to defend against the divine ability Patriarch Blood Demon was attacking him with, he was slammed backward, blood spraying from his mouth. The mist of Patriarch Blood Demon’s Blood World enveloped him, making it impossible for him to charge in and attack. All he could do was perform a double-handed incantation and then point out toward the wooden sword.</p><br/><p>“Solitary Bamboo Sword, return!” he roared, continuing with another incantation gesture.</p><br/><p>The wooden sword trembled, apparently in response to the old man, whose heart immediately sank. A very, very bad feeling welled up inside of him. Under normal circumstances, all it took was an incantation gesture and the simple point of a finger to instantly cause the bamboo sword to fly back to him. Now, all it did was tremble.</p><br/><p>“Dammit! What’s going on?!?!” He performed another incantation gesture, and even went so far as to spit out a mouthful of blood. How could he not be anxious? This was the Solitary Sword Sect’s precious treasure, and if he allowed it to be snatched away, it would be a great sin against the sect.</p><br/><p>“You were refined by the Solitary Sword Sect! We acquired you from the Ancient Dao Lakes! You were personally crafted into a sword by the ancestors of the Solitary Sword Sect! You belong to us!!</p><br/><p>“Solitary Bamboo Sword, get back here!!” The black-robed man howled in rage, and blood sprayed out of his mouth. Finally, the invisible connection between him and the sword finally seemed to function. The wooden sword began to vibrate, and then moved backward several meters.</p><br/><p>Even as the black-robed man let out a sigh of relief, the wooden sword suddenly stopped again, and the man’s heart once again began to thump.</p><br/><p>“You were born in the Solitary Sword Sect! For years, we Solitary Sword Sect disciples offered sacrifices to enable you to gain sentience! We spent countless resources making you sharper and more powerful! Our entire sect worked to help you!!</p><br/><p>“Y-y-you… you get back here right now!!” Despite his anxiety, the black-robed old man was pinned down by the mist of blood. He let out a roar, then spit out more blood, completely ignoring the wastage to his longevity as he once again pointed toward the wooden sword.</p><br/><p>This time, however, there was no reaction whatsoever from the sword….</p><br/><p>“Finished playing around?” said Meng Hao, his face grave and his tone berating. “If you don’t come over here right now, just wait and see how I punish you after we get home!”</p><br/><p>As Meng Hao’s words rang out, the wooden sword shuddered in midair. Then, it severed its connection with the black-robed man and shot directly toward Meng Hao. In the blink of an eye, it was circulating around him, its thrumming sound echoing out in all directions. It was almost as if it was clamoring in joy, fawning over him, even exhibiting signs that it had missed him.</p><br/><p>Anyone looking on could clearly tell that this sword… belonged to Meng Hao!</p><br/><p>Six-Daos’ eyes were wide, and he very nearly coughed up a mouthful of blood.</p><br/><p>The surrounding hundreds of thousands of cultivators gasped, having been thoroughly astonished by Meng Hao.</p><br/><p>The Solitary Sword Sect disciples gaped as their Sect’s unsurpassed, proud and aloof precious treasure, swirled around Meng Hao like a happy pet. Clearly… it recognized Meng Hao as its master.</p><br/><p>“I must be asleep….”</p><br/><p>“That’s… that’s our sect’s legacy precious treasure?”</p><br/><p>“What’s… what’s going on…?” The minds of the Solitary Sword Sect disciples were spinning, but most disbelieving of all was the black-robed man up in midair.</p><br/><p>His eyes filled with an expression of both madness and injustice, which then transformed into a towering rage. He was just about to open his mouth to say something when blood spurted out and he grew visibly older.</p><br/><p>He just couldn’t understand or comprehend how the sword could possibly recognize Meng Hao as its master!</p><br/><p>He just couldn’t believe it. His world was turned upside down, as if enormous waves were surging through his psyche.</p><br/><p>“How could this be happening!?!?” he roared madly. He wanted to try to break through the blood mist, to grab the sword in his hand and ask its spirit why it was acting this way. Why was it betraying the Solitary Sword Sect, why would it recognize Meng Hao as its master when it had only seen him once?</p><br/><p>“That sword belongs to the Solitary Sword Sect!!!”</p><br/><p>“It belongs to you?” asked Meng Hao coolly. “Call out to it. Does it answer?” He stretched out his hand, and the sword flew down to land hilt-down on his palm. It even danced back and forth, apparently in complete excitement.</p><br/><p>“YOU!!” The Solitary Sword Sect Patriarch almost spit up some more blood because of the flames of rage that burned in his heart. By this point, it didn’t matter that he had a cultivation base at the peak of Dao Seeking. Even an Immortal would be unable to accept a blow like this, nor such loss.</p><br/><p>That was especially so… considering how the wooden sword was frolicking around happily. The black-robed old man felt as if a blade were stabbing viciously into his heart. That was because he himself had needed to make sacrificial offerings to it, and had never seen it act in such a way.</p><br/><p>Meng Hao could also sense that this sword, one of the ones he had buried so long ago, had developed a sword spirit. Despite that, his contingencies from the very beginning were still effective. No matter how many hands the sword had passed through, once it saw him, it knew that he was its original master.</p><br/><p>“Alright, stop making a fuss,” he said. “Now, go kill him!” Even as he spoke, Meng Hao pointed at Patriarch Six-Daos.</p><br/><p>Six Daos’ heart was pounding, and his face fell. He immediately retreated at top speed, but before he could get very far at all, the wooden sword shot toward him with indescribable speed. It also emanated a shocking power of Time, which caused everything around it to ripple and distort. Any cultivators who were too close withered in the blink of an eye, as if countless years had passed in an instant. There were even some who directly passed away.</p><br/><p>“Dammit!” thought Patriarch Six-Daos, his face falling. Roaring, he employed the full power of his cultivation base, which unfortunately for him was still stuck between the early and mid Dao Seeking Stages. It wasn’t enough, so he had no other choice but to summon the incense burner to block the wooden sword. A bang rang out, and the wooden sword stabbed directly into the incense burner.</p><br/><p>Booms could be heard as cracks spread out over the surface of the incense burner. An ancient will could be sensed, and signs of decay could be seen. Six-Daos’ heart ached, but he didn’t dare to call back the incense burner. That was because he had noticed that the sword’s ripples were causing him to age significantly. If it stabbed him, he could only imagine what would happen to his longevity; it would be thoroughly destroyed.</p><br/><p>In his terror, he shot backward at high speed. Considering he was using a special secret art to bolster his cultivation base, what he feared most… was being obliterated by Time power.</p><br/><p>The surrounding hundreds of thousands of cultivators were also astonished and trembling. They didn’t dare to advance, and quite the opposite, retreated. Meng Hao stood alone outside the second shield layer. One man, one sword...caused the enemy forces to retreat three thousand meters.</p><br/><p>“Dammit!!” More and more cracks spread out across the surface of the incense burner. Patriarch Six-Daos immediately roared, “Fellow Daoist Sword Paragon, Patriarch Golden Frost, Li Yuanlei, if you don’t help me then I’ll be forced to summon discarnate souls to defend myself!!”</p><br/><p>Even as the last words left his mouth, the incense burner exploded into pieces. The wooden sword shot onward, and Six-Daos lifted his head up and roared. All of a sudden, his body exploded, allowing the wooden sword to pass right through it.</p><br/><p>However, there was a soul strand that remained, which then transformed into a river of souls that contained 100,000 discarnate souls!</p><br/><p>Even as the 100,000 discarnate souls flew out, the black-robed old man from the Solitary Sword Sect burst into flames. These were life force flames, and as they burned, his cultivation base exploded with power. He transformed into a long streak of light that burst out from within Patriarch Blood Demon’s blood mist. Ignoring any injuries, he shot toward Meng Hao’s wooden sword, he himself transforming into what looked like a sword as he flew through the air.</p><br/><p>“Meng Hao, you twerp! DIE!!”</p><br/><p>Meng Hao’s eyes glittered. There was no time to slaughter Six Daos’ 100,000 discarnate souls. The wooden sword flew back to him at breakneck speed. Even as the black-robed Solitary Sword Sect Patriarch closed in, Meng Hao stepped back behind the second shield layer.</p><br/><p>However, the Solitary Sword Sect Patriarch did not slow down at all. Instead, he increased his speed as he stabbed toward the shield.</p><br/><p>“BREAK!!”</p><br/><p>Patriarch Blood Demon’s eyes flickered with killing intent. However, the Dawn Immortal’s clone was really causing him quite a headache; it was not merely at the peak of Dao Seeking, but rather, higher than that. It was more comparable to a false Immortal.</p><br/><p>Even as his clone frowned, deep in the cave in Mount Blood Demon, his true self’s eyes opened. A drop of blood suddenly floated up from within the Blood Pond, then flew out of the Immortal’s cave and dissipated. Shockingly, the first and second layers of the shield were instantly dyed red.</p><br/><p>Boom!</p><br/><p>The blood-colored shield easily blocked the furious attack of the Solitary Sword Sect’s black-robed Patriarch.</p><br/><p>-----</p><br/><p><em>This chapter was sponsored by Kristian Seljevold, Michael Bent, Steven Sun, and Christopher Choi</em></p><br/>\n</div>"}