{"title": "Chapter 752: Dao Seeking Fleshly Body!", "id": 752, "volume": 8, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-752-dao-seeking-fleshly-body", "volume_title": "Volume 8", "body": "<h1>Chapter 752: Dao Seeking Fleshly Body!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong></strong></p><br/><p>[/expand]</p><br/><p>The first time he came here, he would never have dared to even open his mouth, let alone directly ask the question he just had. Back then, his cultivation base was simply too low, and it was only by lucky coincidence that he was even able to come here in the first place.</p><br/><p>Now, though, he was a Second Severing cultivator with a second true self that was at the peak of Dao Seeking.</p><br/><p>In the current age in which Immortals were incredibly rare in the lands of South Heaven, the peak of Dao Seeking fully deserved to be called the pinnacle level of power. Meng Hao really was on the same pedestal as the most powerful experts of South Heaven.</p><br/><p>And that was not speaking of the Southern Domain, but Planet South Heaven as a whole.</p><br/><p>Meng Hao looked calmly at the endless sheets of lightning between him and the bronze cauldron, then stepped forward. As soon as he entered the lightning, he was surrounded by shocking rumbling sounds. Endless amounts of lightning shot toward him.</p><br/><p>Smacking sounds echoed out as the lightning bolts slammed onto him. They were like writhing white snakes that, from a distance, looks almost like a tempest that surrounded Meng Hao.</p><br/><p>He proceeded forward slowly, but every step was taken firmly and stably. Soon, he had advanced by ten measures, each measure being roughly three meters!</p><br/><p>The rumbling grew more shocking and intense, and the lightning bolts more numerous. The pressure was intense, and even Meng Hao couldn’t help but frown after passing twenty measures. He felt his body spasming, and knew that he could proceed forward. However, based on his calculations, after three hundred measures, he would be able to proceed no further.</p><br/><p>The ancient voice once again rang out, filled with coldness: “You are currently a thousand measures away from the cauldron. Based on your level of strength, the most you can reach… is three hundred measures. The sensible thing would be to give up now. If you do something completely moronic, then you will either end up dead or seriously wounded.”</p><br/><p>“Actually,” said Meng Hao coolly, “if I really wish to traverse this path of lightning, well… it’s not that difficult of a thing.” He waved his sleeve, and the air behind him rippled. In the blink of an eye, his second true self stepped forward to stand next to Meng Hao. Lighting fell around them, but the second true self wasn’t harmed in the least bit. In fact, neither its hair nor even the edges of its garments were even stirred.</p><br/><p>“Hnhh?” Within the huge cauldron, the ancient voice seemed momentarily struck speechless. “The soul of an Immortal!” it then exclaimed. In conjunction with the words, the lightning in the area grew even more shocking. Suddenly, the lightning merged together to form a man, who hovered in midair.</p><br/><p>He was an old man with indistinguishable features. Only his outline was visible, but based on his appearance he seemed to be the lord of the lighting here. He emanated a shocking pressure, and seemed to be able to wield shocking power.</p><br/><p>“No, not the soul of an Immortal,” murmured the old man. “It’s a clone… and yet, also not a clone. This is a fleshly body created with some secret art, raised to a pinnacle of power, after which… the soul of a true Immortal was inserted into it!” When Meng Hao heard the old man’s musings, his eyes went wide. Clearly, the old man could pick up on various clues to piece together the truth.</p><br/><p>“False Immortals are common, but true Immortals are very rare! With this Immortal clone, you definitely qualify to take the cauldron. However… the cauldron itself has no soul. Whoever touches it for the first time will find part of their soul extracted to become the essence of the cauldron spirit. Are you sure that you want your Immortal clone… to touch the cauldron?” The old man gazed steadily at Meng Hao.</p><br/><p>Meng Hao frowned slightly, and muttered to himself for a bit. According to what the old man said, if his second true self touched the cauldron, then part of his soul would be split away. That meant the cauldron would not belong to Meng Hao, but to the true Immortal’s soul.</p><br/><p>Furthermore, that meant that although he would most likely be able to use the cauldron, it wouldn’t be his.</p><br/><p>“This old guy is pretty mysterious,” thought Meng Hao. “Regardless of what he says… I can’t trust him completely.” After some more thought, he looked down at his right arm, and the lightning dancing back and forth across it. Occasionally, lightning would be absorbed into his arm, which gave rise to a tickling sensation. From the look of it, his right arm was actually strong enough to absorb the lightning.</p><br/><p>Meng Hao’s eyes suddenly began to glitter.</p><br/><p>“My Nine Heavens Treasured Body Seal needs to absorb vast quantities of magical items…. Could it be that I can actually absorb the lightning from this place?” Heart pounding, he took a deep breath and closed his eyes for a moment. When they opened, his Nine Heavens Treasured Body Seal was fully rotating.</p><br/><p>As soon as he employed the art, the lightning around him acted as if it had suddenly found a drain to pour down, as if his body was a black hole. In the blink of an eye, all of the lightning… began to fall directly onto Meng Hao.</p><br/><p>Apparently, Meng Hao was able to consume it all!</p><br/><p>He trembled as pain stabbed through him. The Nine Heavens Treasured Body Seal really was absorbing the lightning, which flowed through his body, merging into it. Enough time passed for an incense stick to burn, and he trembled the entire time.</p><br/><p>Then, his eyes began to glow with an intense light.</p><br/><p>“I’m a bit stronger,” he thought. “About as much as I would be by absorbing a few dozen Spirit Severing treasures.” He took a deep breath as he realized that this place would be extremely dangerous to anyone except to someone who cultivated the Nine Heavens Treasured Body Seal. To him, this place was a location of incredible good fortune.</p><br/><p>Meng Hao immediately sent his second true self back to its original position, then looked up at the old man formed from lightning.</p><br/><p>“Senior, I think I will make an attempt alone,” he said. With that, he stepped forward into the rumbling. Lightning fell, and Meng Hao’s body trembled. The Nine Heavens Treasured Body Seal spun into action once again, and the lightning was absorbed.</p><br/><p>The pain he felt as the lightning danced through his flesh and blood made him shiver. However, his eyes shone with persistence. Enduring the pain, he continued onward, one measure at a time until he reached 100!</p><br/><p>100 measures was 300 meters!</p><br/><p>There was now more lightning, falling in vast sheets. Meng Hao was completely submerged in it, and from a distance he was barely even visible.</p><br/><p>Within the lightning, the power of the Nine Heavens Treasured Body Seal flowed through him. His fleshly body writhed as the lightning danced. It bored into him over and over again, and as it did, he could clearly sense his fleshly body becoming stronger and more powerful.</p><br/><p>Before, his fleshly body was already at the absolute pinnacle of Spirit Severing. All he needed was to push it forward a single step and it would be in Dao Seeking.</p><br/><p>“I must take advantage of this opportunity!” he thought, his eyes flickering as he continued onward.</p><br/><p>Up in the sky, the old man made of lighting watched on with an expression that only continued to grow more serious. A brilliant glow began to flicker in his eyes; clearly he had noticed that there was less lightning in the area.</p><br/><p>Although it was only a small reduction, it was something that he had never experienced in all the countless years he had been here.</p><br/><p>“So, he can absorb lightning?” he thought, shocked. “And not even normal lightning, at that. Tribulation Lightning! He can absorb it and use it to strengthen his fleshly body!</p><br/><p>“What technique does he cultivate to be able to do something like that? Don’t tell me… it’s one of those legendary Heaven-defying fleshly body Daoist magics?!” By this point, Meng Hao had already traveled to the 900 meter mark.</p><br/><p>Lightning crashed down onto him the entire time, and he was surrounded by the booming of lightning. It was as if countless silver spikes were being stabbed into him nonstop.</p><br/><p>Even using the expression “ten thousand arrows piercing the heart” would not be an exaggeration.</p><br/><p>The pain was so intense that Meng Hao’s vision began to grow dark. Despite being completely surrounding by bright, resplendent lightning, all he could see was darkness. He quickly bit the tip of his tongue, causing himself to regain a bit of clarity. Spitting out the blood, he proceeded forward.</p><br/><p>RUMBLE!</p><br/><p>1,500 meters!</p><br/><p>Meng Hao raised his head up and roared. His right arm had now fully broken through from Spirit Severing to Dao Seeking. As for the rest of his body, it was now pushing the very borders of the limits of Spirit Severing.</p><br/><p>The lightning in the area had previously spread out for three thousand meters. But Meng Hao had absorbed a lot of it, and now it only stretched for 2,500 meters.</p><br/><p>The reduction only went faster after his right arm reached Dao Seeking. The 2,500 meters quickly shrank down to only 2,000 meters.</p><br/><p>Excited, Meng Hao gritted his teeth and pushed forward.</p><br/><p>He soon reached the 1,800 meter mark.</p><br/><p>2,000 meters!</p><br/><p>An incredible rumbling could be heard as his left arm broke through to the fleshly body of Dao Seeking.</p><br/><p>2,500 meters!</p><br/><p>Both legs radiated the aura of natural law, as if they were now connected in some bizarre way to Heaven and Earth. Both of them were now in Dao Seeking!</p><br/><p>2,750 meters!</p><br/><p>Meng Hao was panting as the lightning around him suddenly shrank down to only 1,000 meters.</p><br/><p>It was at this point that the black lightning bolts smashed down toward him with incredible destructive power. He looked up, his eyes bright red, and allowed the black lightning to slam into him.</p><br/><p>As soon as the black lightning bolts merged into him, cracking sounds could be heard. Tears instantly spread out across his skin; it almost appeared that he would be incapable of withstanding the lightning, and would fall to pieces.</p><br/><p>Next, though, his Eternal stratum kicked in, and the wounds healed. Intense pain surged through him, the likes of which he had never felt before. He couldn’t hold back from letting out an anguished howl.</p><br/><p>Even as he did, rumbling filled his body; it was not the sound of him collapsing into pieces, but rather, the shocking rumbling of an incredibly powerful Dao Seeking fleshly body.</p><br/><p>His limbs and torso all broke through from Spirit Severing into Dao Seeking. Only his head remained as a weak spot, and the most difficult area to strengthen. Meng Hao took a deep breath and then pushed onward. 2,800 meters. 2,850 meters…. 2,900 meters!</p><br/><p>His head felt as if it were being crushed down upon by the Heavens. Countless lightning bolts danced across him, and the Nine Heavens Treasured Body Seal rotated rapidly….</p><br/><p>2,950 meters…. 2,999 meters…. Finally… 3,000 meters!!</p><br/><p>The bronze cauldron was directly in front of Meng Hao. He stood there trembling, surrounding by a mere 300 meter area of lightning. Surrounded by the boundless lightning, he coughed up a mouthful of blood and then slowly began to lift his hand. Gritting his teeth, he slapped his palm down onto the surface of the bronze cauldron!</p><br/><p>The huge cauldron began to thrum, and the three hundred meter area of lightning instantly condensed down onto Meng Hao.</p><br/><p>BOOM!</p><br/><p>“From now on, you belong to me!” said Meng Hao, his voice quavering out from within the lightning.</p><br/>\n</div>"}