{"title": "Chapter 765: Seventh Year Tribulation!", "id": 765, "volume": 8, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-765-seventh-year-tribulation", "volume_title": "Volume 8", "body": "<h1>Chapter 765: Seventh Year Tribulation!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 765: Seventh Year Tribulation!</strong></p><br/><p>The great tribes in the Black Lands were also focusing on the Southern Domain right now. The matter of the four allied powers besieging the Blood Demon Sect, and the following events in which the Blood Demon Sect unified the Southern Domain, were all well-known.</p><br/><p>When Meng Hao’s name rose to prominence, the Golden Crow Clan in the Black Lands was especially excited. When news arrived of Meng Hao’s grand marriage, the Clan Chief personally led quite a few clan members out of the Black Lands to attend the ceremony and offer wedding gifts.</p><br/><p>The other great tribes also did the same.</p><br/><p>Last but not least, the Church of the Golden Light called out their signature catchphrase as they ran toward the Southern Domain, surrounded by a swirling fog.</p><br/><p>Meanwhile, in the Eastern Lands, in the Fang Clan ancestral mansion, was a tall tower. It looked very similar to a Tower of Tang, although it was roughly thirty meters taller. [1. As I’ve mentioned before, I convert the ancient Chinese measurements into metric. The tower is nine “zhang” taller, and as we all know, nine is a significant number in Chinese culture and ISSTH]</p><br/><p>It was thirty meters taller than each and every one of the other Towers of Tang throughout the Southern Domain.</p><br/><p>Within the tower stood a man and a woman who were in the middle of a fierce argument. Tears streamed down the woman’s face as she looked off in the direction… of the Southern Domain, and Meng Hao.</p><br/><p>“We left him before his seventh birthday…. He faced grave danger so many times in the Southern Domain, and we didn’t help him. We didn’t even dare to get near him…. I shouldn’t have gone to see him at the Song Clan, but… he’s my son! He’s OUR son!</p><br/><p>“His Dao foundation was stolen in the Milky Way Sea, and I knew we couldn’t go help him, but that didn’t do anything to alleviate the stabbing pain in my heart. Then Xu Qing gave up so much for him in the Rebirth Cave. I saw everything that happened. Everything! I like that girl....</p><br/><p>“Now, he’s getting married, and I’M GOING!” The woman looked over at the man, her eyes flashing with determination.</p><br/><p>The man was trembling, and sadness filled his eyes. His heart also felt stabs of pain. However, there was nothing he could do other than endure them, and place all of his hopes on what would happen in the future.</p><br/><p>“Just wait a little bit longer, Lili [1. \"Lili\" is a repetition of the character Li , from Meng Li’s name],” the man murmured. He trembled, and gripped the column next to him until his knuckles turned white. “Can’t you just wait a bit longer…? We suffered untold hardships to bring him here and give him a chance to live. Once he reaches Dao Seeking, then the danger will be past. Dao Seeking, that’s all.</p><br/><p>“Just a little more waiting. The day he enters Dao Seeking, we’ll go together. We’ll explain everything, together!” Deep love could be seen in the man’s eyes as he looked off into the distance.</p><br/><p>“We can’t make any mistakes,” he continued. “If we fail this time… Lili, the fourth life, the Seventh Year Tribulation. Can you really bear such pain again?</p><br/><p>“I’m his father, and he is our child. It was for him that both of us swore Dao oaths to guard the door of South Heaven for 100,000 years, and not step foot out of South Heaven for that entire time. All of that was for this one chance. Just keep waiting….” The man closed his eyes. For his son, he would gladly sacrifice his life, his everything.</p><br/><p>“Seventh Year Tribulation….” More tears streamed down the woman’s face as she recalled the bitter memories of the past. “But so many years have already passed….”</p><br/><p>“Spirit Severing stabilizes the soul, and Dao Seeking lays the blood to rest,” the man murmured, and it was hard to tell whether he was talking to the woman, or to himself. “Every day before Dao Seeking is another day that the Seventh Year Tribulation… remains unneutralized. His body is already at Dao Seeking, all that remains is his cultivation base…. Soon. The day will come… soon.”</p><br/><p>The wedding day approached. When the bonding ceremony was only five days away, more than a million cultivators had already amassed in the Northern Reaches, adjacent to the Milky Way Sea.</p><br/><p>Vicious beasts, wicked spirits, powerful experts…. It all transformed into something like a cyclone that could sweep across everything in astonishing fashion.</p><br/><p>Dao Seeking Patriarchs from various clans, tribes, and sects flew up into the air, eleven astonishing figures who then stared out at the Milky Way Sea, toward the Southern Domain which lay beyond the horizon.</p><br/><p>“The chance for Immortality lies in the Southern Domain!”</p><br/><p>“The Southern Domain has just faced incredible misfortune. They are at their weakest now, and could never imagine that our army would appear now!”</p><br/><p>“This is an incredibly rare opportunity!”</p><br/><p>“In this war, we will exterminate their Dao Seeking experts, slaughter their Spirit Severing cultivators, eradicate all of their Nascent Soul disciples! As for Core Formation, they don’t really matter.”</p><br/><p>“Shatter their foundation, cut off their chance for Immortality, and then we can occupy the Southern Domain! We can gain enlightenment about Immortal destiny, and we can become Immortals!”</p><br/><p>“In this war, we, the allied forces of the Northern Reaches, with the help of the Resurrection Lily, will definitely seize control of everything!”</p><br/><p>“Strike fast and hard! Don’t give the Eastern Lands a chance to interfere!”</p><br/><p>These eleven Dao Seeking experts were all adorned in different attire. Some were covered in tattoos. Others were festooned in bone accouterments that emanated black light. Some wore Daoist robes. However, all of them possessed incredible power.</p><br/><p>They hovered in midair looking out at the Milky Way Sea. Suddenly, an incredible roaring filled the air. There was no wind, but massive waves still rolled out across the sea.</p><br/><p>The Milky Way Sea’s Fourth Ring, Third Ring, Second Ring, all of the areas in the entire sea outside of the Inner Ring, were covered with huge waves. The disciples of the three great sects in the Third Ring were completely astonished.</p><br/><p>The cultivators who lived on the various islands in the sea could hear the roaring, and were shocked.</p><br/><p>This was not the ordinary roar of the sea, but rather, was filled with a monstrous, murderous air. The water surged up, as if some colossal creature was attempting to rise up from the depths of the sea!</p><br/><p>As everyone looked around in astonishment, deep in the dark recesses of the Second Ring, a gargantuan Resurrection Lily was writhing like mad. This… was the source of the roaring that filled the Milky Way Sea.</p><br/><p>Rumbling echoed out constantly as the gigantic Resurrection Lily suddenly began to grow, almost without limit. It only took the space of ten or so breaths of time for massive tentacles, each thirty meters thick, to rise up from within the Second Ring. Seawater poured off of them as they shot up over the sea.</p><br/><p>The tentacles emitted a shocking aura as they sped through the air. At the same time, countless smaller tentacles spread out along the seafloor. When they reached the waters of the Third Ring, they too shot up into the air.</p><br/><p>More tentacles spread out, piercing into the Stormwind Divide that separated the Third and Fourth Rings.</p><br/><p>If you could stand in a position high up in the sky where the entire Milky Way Sea was visible, you would be able to see that more than 100,000 tentacles were spreading out. It appeared as if… a fearsome presence lurked beneath the waters.</p><br/><p>Of course, it was none other than the Resurrection Lily!</p><br/><p>The Resurrection Lily grew rapidly, growing larger until finally, to the astonishment of all the cultivators, it rose up completely from the water. The tentacles merged, braiding together.</p><br/><p>They formed… a bridge!</p><br/><p>It was a bridge, one side of which was formed from fifty thousand tentacles, more than 1,500 kilometers across. Shockingly, this part of the bridge neared the Southern Domain, but didn’t touch it.</p><br/><p>The other side of the bridge arced out to connect to the Northern Reaches!</p><br/><p>In the very middle of the two sides was a huge Resurrection Lily that was so large you could scarcely see from one side to the other, dripping vast quantities of water as it rose up.</p><br/><p>The scene was indescribably shocking and astonishing. A gigantic flower had risen up to form a bridge with its branches and leaves, a bridge that connected two great continents!</p><br/><p>The greatest difficulty in waging war between these regions was the problem of transporting the troops. But now, that problem had been solved, and the great war could begin at any time.</p><br/><p>Rumbling filled the air as the Resurrection Lily bridge appeared. The more than 1,000,000 Northern Reaches cultivators lifted their heads up and roared. The eleven Dao Seeking experts waved their hands, and the cultivators headed directly toward the Resurrection Lily bridge.</p><br/><p>The evil spirits were behind the cultivators, followed by the mountain-like giants, as well as countless wild beasts. All of them charged onto the Resurrection Lily bridge, where they used all the speed they could muster, as well as some of the built-in teleportation features of the bridge, to proceed forward. Soon, the distance between them and the Southern Domain was rapidly reduced.</p><br/><p>They would only need a few days to reach the Southern Domain.</p><br/><p>The wedding day got closer.</p><br/><p>The big lake that used to be the State of Zhao was now decorated with lanterns and brightly colored decorations. Tables were set up all around, and Blood Demon Sect disciples circulated to entertain the guests.</p><br/><p>The sounds of happy laughter and cheerful voices permeated the air.</p><br/><p>Chen Fan arrived, as did Fatty, along with one after another of Meng Hao’s friends from the Violet Fate Sect, who had all rushed to the location as fast as possible. Xu Qing’s smile grew more and more beautiful. When she looked at Meng Hao, the warm look in her eyes seemed like it could thaw even the coldest ice.</p><br/><p>Meng Hao was also smiling, although sometimes he seemed to be at his wits’ end, not quite sure what to do or where to go. Thankfully, the Blood Demon Sect’s Spirit Severing Patriarchs were familiar with weddings, and they did their best to manage affairs properly. There was also Fatty, who had already been formally united with more than a hundred beloved concubines. With all of their advice and help, Meng Hao was kept quite busy with all the formalities.</p><br/><p>In the end, Chu Yuyan eventually came. She arrived with a smile that seemed sincerely congratulatory. However, deep in her heart she felt frustration and disappointment. When Meng Hao ran into her, he opened his mouth to say something, but in the end all he could do… was sigh.</p><br/><p>Xu Qing pulled Chu Yuyan off to the side, where they began to confer quietly.</p><br/><p>Hanxue Shan and Song Jia also came. Soon all the women, along with Fatty’s beloved concubines, made their way to the island in the center of the lake, after which the twitter of their voices could often be heard floating out from within.</p><br/><p>A few days later, the big day arrived, and wedding bells tolled cheerfully.</p><br/><p>Starting at dawn, countless honored guests flowed in from sects and clans all over the Southern Domain. Soon it became apparent that there weren’t enough banquet tables, even though they had prepared more than 100,000. There was standing room only, and everyone was packed tightly together as far as the eye could see. There were even cultivators hovering in the air far off in the distance. Even if they couldn’t have a seat, they still wanted to watch the bonding ceremony and cheer in congratulations.</p><br/><p>Spirit Severing cultivators and Dao Seeking experts were all present! As the wedding bells rang out, a violet streak appeared in the air. It was an old man in a violet robe, ancient and dignified. However, a kind smile covered his face, and the aroma of medicinal pills wafted around him. As soon as Meng Hao caught sight of him, a tremor ran through his body, and he flew up into the air. In front of all the other cultivators present, he clasped hands and bowed deeply.</p><br/><p>“Greetings, master!”</p><br/><p>The old man was none other than Pill Demon. He looked at Meng Hao contentedly, and with love. Laughing, he helped Meng Hao to straighten up.</p><br/><p>“Today is your grand wedding, and I’m here to bear official witness.”</p><br/>\n</div>"}