{"title": "Chapter 771: Let Me Rest a Bit", "id": 771, "volume": 8, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-771-let-me-rest-a-bit", "volume_title": "Volume 8", "body": "<h1>Chapter 771: Let Me Rest a Bit</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 771: Let Me Rest a Bit</strong></p><br/><p>An incredible silence suddenly filled the entire battlefield. After that, killing intent exploded up into the Heavens.</p><br/><p>“KILL THEM!!” Hundreds of thousands of cultivators charged madly toward the Milky Way Sea, towards the hundreds of thousands of withering Northern Reaches cultivators.</p><br/><p>The war… had begun!</p><br/><p>Meng Hao left. And yet, not a single Southern Domain cultivator felt even the slightest bit upset because of that. They had attended Meng Hao and Xu Qing’s wedding, as well as the invasion of the Northern Reaches. They had also experienced the Hellwither Nineruins curse.</p><br/><p>They only thing they felt regarding Meng Hao was sorrow, as well as hope that he would eventually have the strength to continue on.</p><br/><p>A huge massacre unfolded on the border of the Southern Domain.</p><br/><p>**</p><br/><p>Meng Hao held Xu Qing; both were still wearing their red wedding garments. He held her in his arms, and she leaned up against his chest. A dark aura surrounded Meng Hao, and his body was incredibly withered. Tears filled his eyes, and his heart was torn to pieces. He felt as if he was being continuously stabbed with countless sharp blades.</p><br/><p>A black aura also appeared on the withered Xu Qing. She had already died once, and although her body had been restored, it was only meant to survive for a hundred years.</p><br/><p>The remaining ten percent power of the curse might not affect others very much, but to Xu Qing, well... it was something her body couldn’t handle.</p><br/><p>The remaining ten percent of the curse power was like exponential time power. Within only a few days, she would live out an entire lifetime.</p><br/><p>Xu Qing suddenly forced her eyes open to look at her husband as he held her. He was the most dear and important person in her entire life. Her voice weak, she said, “I want… to go back to the valley.”</p><br/><p>She didn’t want Meng Hao to be unhappy, nor did she want to see him hurt even the smallest bit. She wanted to be happy with him forever, with no pain, and no sadness.</p><br/><p><em>No matter what, as long as you are safe and sound, then I’m content.</em></p><br/><p>“Alright, let’s go back….” said Meng Hao with a nod. His heart trembled as he looked at her. He didn’t want his grief to affect her, so a warm smile appeared on his face.</p><br/><p>Except, it was a smile that was filled with silent tears.</p><br/><p>“You did the right thing,” she murmured. “They came to attend our wedding, and we shouldn’t let the guests be harmed. We owe them now…. In the future, if I’m not here, make sure to pay everyone back.” With that, she sunk into his chest exhaustedly and closed her eyes.</p><br/><p>When she closed her eyes, Meng Hao stopped in place. After sensing that she was simply unconscious, he felt that he could finally unleash his grief. He looked up into the sky… and tears began to pour out.</p><br/><p>He didn’t want to alarm Xu Qing, so he held her very gently as they proceeded off into the distance. They passed over mountains and lands until they reached the Blood Demon Sect, Blood Prince Gorge, and their log cabin.</p><br/><p>He went to seek advice from Patriarch Blood Demon, but the Immortal’s cave was sealed with a blood-colored shield, preventing him from entering. Patriarch Blood Demon was asleep, and incapable of awakening.</p><br/><p>Back in the valley, Meng Hao held Xu Qing, and his heart ached. Straightening her hair, he softly said, “We agreed to spend a hundred years together. After that you would be reincarnated, and I would go find you….”</p><br/><p>Xu Qing opened her eyes and smiled at him. What she didn’t see was that when he stroked his hand through her hair, it was filled with withered strands of hair that had fallen out.</p><br/><p>Meng Hao saw, and he trembled. He quickly clenched his fingers, causing the hairs to vanish.</p><br/><p>Xu Qing’s face was pale. Her hair, like her life, was withering away. Her face was also slowly changing. She was no longer young and beautiful. Wrinkles were spreading out across her face.</p><br/><p>The flow of time affected her body in a way that made it seem as if many years had elapsed.</p><br/><p>As Meng Hao watched her pretty features growing older, he felt as if he didn’t have a heart anymore. All he had was a feeling of emptiness, as if a painful black hole existed within his chest.</p><br/><p>Xu Qing looked at the night sky, and the twinkling stars. Her voice soft, she murmured, “I wish… we could go back in time to the Reliance Sect. I could be your Elder Sister in the sect and you could be my Junior Brother….</p><br/><p>“I would take you to meet my family. I remember that before I was taken to the sect, I had a younger brother….</p><br/><p>“I wish… I could be with you forever….” She was growing weaker. She closed her eyes and slept.</p><br/><p>Meng Hao could tell that Xu Qing’s life force was reaching its end. Her fleshly body was withered, and it seemed as if it might vanish at any moment. She had no energy left, like a candle in the wind….</p><br/><p>Xu Qing was aging. She no longer appeared to be in her twenties, but rather, middle-aged. However, to Meng Hao, she would eternally be that beautiful young woman to whom he had once given a Cosmetic Cultivation Pill.</p><br/><p>“I won’t let you wither away,” he said softly. “We agreed to spend a hundred years together, and we will!” Eyes filling with a flame of unprecedented decisiveness, he reached down to stroke her cheek.</p><br/><p>After a long moment, he closed his eyes briefly, then reopened them and extended his right index finger. From the look of it, it was now the only part of his body that hadn’t been affected by the withering. That was because… it contained what little remained of his Eternal stratum.</p><br/><p>He carefully sliced a cut into his finger and slowly squeezed out a few drops of blood onto Xu Qing’s lips, blood which contained his Eternal stratum.</p><br/><p>Her lips turned the color of blood, and it almost seemed they they were the only part of her body that had any color. It formed a stark contrast to her ashen skin. As the blood seeped into her mouth, her face suddenly wasn’t old any more.</p><br/><p>Meng Hao, on the other hand, trembled, and his body withered up a bit more. His Eternal stratum was now weakened, but in his heart, he felt hope.</p><br/><p>However, after three days passed, Meng Hao realized that his Eternal stratum could not prevent Xu Qing from withering. Finally, he started laughing bitterly.</p><br/><p>Xu Qing’s hair was now mostly white, and her face looked middle-aged. She was skinny, and no longer beautiful like she used to be. However, the warmth in her eyes, and the curve of her smile, were things that Meng Hao would never forget.</p><br/><p>Finally, she smiled and prevented Meng Hao from using any more of his Eternal stratum blood. It hurt her heart to see him doing such a thing, even more so than the thought of her imminent death.</p><br/><p>“Just stay with me,” she said. “Until the end. Take me to be reincarnated…. That’s good enough.</p><br/><p>“We agreed to a whole lifetime. So, it’s just like… I’m going to sleep for a bit. When I wake up, I’ll see you there. Right…?”</p><br/><p>“Absolutely!” said Meng Hao, his voice quavering.</p><br/><p>Days passed, and Xu Qing grew older. The time she remained awake every day lessened. Most of the time, she slept.</p><br/><p>Meng Hao stayed by her side, and didn’t take even half a step outside of the valley. He held her the entire time, held her in a way that said he never wanted to let her go.</p><br/><p>As for his own body, as the days passed, the Eternal stratum gradually awoke and began to restore him. Even as the curse power was slowly expelled from within, Xu Qing continued to grow weaker.</p><br/><p>Meng Hao tried every method possible to reverse the fading of Xu Qing’s life force, all to no avail. He hated that his cultivation base wasn’t high enough, and even more so, he hated the cruelty of the Northern Reaches curse.</p><br/><p>His heart was already Devilish, but he had been suppressing it, almost as if with shackles. But now… the shackles began to loosen….</p><br/><p>He could do nothing but watch over Xu Qing. He watched as her hair turned white, and her youth disappeared. She went from being middle-aged to being elderly. Although he could have changed her out of the red wedding dress, he didn’t, and she still wore it.</p><br/><p>At one point she forced her eyes open to look at him, but they were cloudy, and she couldn’t see him clearly. “Chu Yuyan is a good girl,” she murmured. “I told her that I can only stay with you for a hundred years, and that she should help me take care of you.</p><br/><p>“Song Jia isn’t bad either….”</p><br/><p>Meng Hao didn’t say anything. He looked at her, his eyes filled with grief as he slowly caressed her wrinkled face. What he saw was her former beautiful face that had changed in only a few days as he held her.</p><br/><p>By now, the Devil in Meng Hao’s heart was unshackled and awakening….</p><br/><p>In those few days that passed, great changes occurred outside in the Southern Domain. In the battle on the shore of the Milky Way Sea, the hundreds of thousands of Northern Reaches cultivators all died. The Milky Way Sea was stained red with blood.</p><br/><p>Then the second wave of the Northern Reaches’ forces arrived. The hundreds of thousands of Southern Domain cultivators began to retreat. The battlefield grew from the border of the Southern Domain, to engulf fully half of the entire continent.</p><br/><p>Fierce fighting raged every day. Among the hundreds of thousands of Northern Reaches cultivators were seven Dao Seeking experts, which made it virtually impossible for the Southern Domain to hold their ground. They were constantly forced into retreat.</p><br/><p>All of the Southern Domain’s cultivators were mobilized. It didn’t matter the sect or clan, everyone was called into action for this war of life or death!</p><br/><p>It was without a doubt a fight to the death. The Northern Reaches’ invasion was not one in which surrender was sought. They wanted the complete annihilation of the Southern Domain cultivators’ foundation. Furthermore, because of the casualties suffered by the initial wave of attackers, the Northern Reaches cultivators harbored an even more intense and deep-seated hatred for the Southern Domain than they had in the beginning.</p><br/><p>No one would rest until the other side was dead!</p><br/><p>Sects were laid to waste and one clan after another was left in ruins. Eventually, the war focused on six different fronts. It was as if six mighty arrows had been shot from the Northern Reaches directly into the Southern Domain.</p><br/><p>The third and fourth fronts eventually overlapped, and became the location of the largest concentration of cultivators. Hundreds of thousands of Southern Domain cultivators were there, as was the main force of the Northern Reaches army. The carnage was never ending, and the Southern Domain was in a state of constant retreat.</p><br/><p>Severe casualties were inflicted every day, and bloody paths strewn with corpses stretched across the land.</p><br/><p>Several days later, over half of the hundreds of thousands of Southern Domain cultivators in the third and fourth fronts were dead. The remaining 200,000 were now falling back to the Blood Demon Sect.</p><br/><p>A final line of defense was being set up outside the Blood Demon Sect to resist the Northern Reaches’ murderous assault.</p><br/><p>Rumbling filled the battlefield, along with miserable screams and the sound of fierce combat. The colorful lights of divine abilities filled the air, and the ground quaked.</p><br/><p>The Northern Reaches had come with giants the size of mountains, who wielded enormous wolf-tooth clubs. They charged onto the battlefield in the vanguard, and even when their bodies had been covered with bloody wounds, they continued their awful massacre. Then there were the countless wild beasts and innumerable evil spirits that accompanied the hundreds of thousands of Northern Reaches cultivators. They were a powerful force of destruction that crushed everything in their path.</p><br/>\n</div>"}