{"title": "Chapter 779: The Northern Reaches Routed!", "id": 779, "volume": 8, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-779-the-northern-reaches-routed", "volume_title": "Volume 8", "body": "<h1>Chapter 779: The Northern Reaches Routed!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong></strong></p><br/><p>[/expand]</p><br/><p>Heaven and Earth trembled, and the thunder-like, rumbling sound of the explosion echoed out through the entire Southern Domain. The self-detonation of the false Immortal puppet didn’t just shake the Southern Domain. Ripples of air turbulence spread throughout the Northern Reaches, and the clouds above the Eastern Lands churned.</p><br/><p>Simultaneously, as the destructive power washed over Meng Hao, his body flashed with lightning.</p><br/><p>Form Displacement Transposition!</p><br/><p>His body vanished, and when he reappeared, he was in the spot just occupied by the middle-aged man with the violet robe and flood dragons. The peak Dao Seeking expert from the Northern Reaches reappeared where Meng Hao had been. He did not even have enough time to let out a miserable shriek before the power of destruction overwhelmed him.</p><br/><p>Massive rumbling sounds filled everyone’s ears; it almost seemed as if the sky would collapse and fall.</p><br/><p>The peak Dao Seeking expert was instantly killed and the Dawn Immortal was enveloped by the destructive force. Even any sound or sign of her was incapable of escaping.</p><br/><p>However, the two halves of the Resurrection Lily bridge that stretched out across the Milky Way Sea trembled, as if they were being wracked with intense pain. Rumbling sounds could be heard as parts of the bridge collapsed, the tentacles transformed into nothing more than ash.</p><br/><p>A screeching cry sounded out from the Resurrection Lily, so powerful that it caused the ground to split and the sky to shake!</p><br/><p>“MENG HAO!!”</p><br/><p>Back in the Southern Domain, Meng Hao appeared next to Patriarch Song on the battlefield, and his body was a bloody mess.</p><br/><p>The only part that remained intact was the hand that held the lightning cauldron. The rest of his body was in tatters. His skin was flayed off and his blood dried up. His vital organs were visible inside, and half of his head was destroyed. Upon cursory glance, it seemed that he would be incapable of anything but dying.</p><br/><p>His Eternal stratum was virtually exhausted, and still in the process of repairing itself. As such, it was incapable of restoring Meng Hao’s body. These were wounds that even the most miraculous medicinal pills would be incapable of healing!</p><br/><p>Immense amounts of destructive force had battered Meng Hao. The fact that he didn’t die in the blast was actually pure luck. Were it not for the Heaven-defying Lightning Cauldron, Meng Hao would most assuredly have been destroyed!</p><br/><p>Even still, when he reappeared, the remaining three peak Dao Seeking experts from the Northern Reaches gasped and unconsciously fell back. They didn’t dare to try to take the chance to make a move.</p><br/><p>Meng Hao’s initial savagery and ruthlessness, his fearsome act of self-detonation, the slaughtering of the Dawn Immortal’s clone, the casual slaying of the peak Dao Seeking expert… all of these things ensured that his fearsome name struck terror into the hearts of anyone and everyone.</p><br/><p>A buzz of conversation rose up from the more than 100,000 cultivators from the Northern Reaches.</p><br/><p>“He’s still not dead!!”</p><br/><p>“Look at how mangled his body is, and yet, he’s still alive!!”</p><br/><p>Pill Demon rushed over with medicinal pills, while Patriarch Song and Patriarch Golden Frost immediately sped to Meng Hao’s side to stand guard.</p><br/><p>“Hao’er!” said Pill Demon, with great urgency.</p><br/><p>As for Meng Hao’s second true self, he sagged listlessly and darkened. After all, if Meng Hao died… then he would most certainly also die.</p><br/><p>Meng Hao couldn’t speak. His eyes were blank and his expression looked confused. An aura of death swirled around him, as if he might pass away completely at any moment. He only had one tiny scrap of consciousness remaining. He looked down toward the ground at the astonished Northern Reaches cultivators.</p><br/><p>Then, the Lightning Cauldron flickered, and he vanished. When he reappeared, he had switched places with one of the Northern Reaches cultivators. Then, his hand exploded. The only intact portion of his body that remained was half of his head!</p><br/><p>Even the last remaining part of his head exploded into a bloody mist as it fell on the ground. The mist didn’t vanish, though. It suddenly bored into the body of a nearby Northern Reaches cultivator, entering through his eyes, ears, nose and mouth. The Northern Reaches cultivator let out a bloodcurdling scream. His body began to writhe, and blue veins popped out on his forehead. His expression was one of astonishment and horror.</p><br/><p>“NO! Help me—” In the middle of his sentence, his words were cut short. He began to wither as his qi, blood, cultivation base and soul were all sucked away.</p><br/><p>As he died, vast quantities of red mist emerged from inside of him, which then split into two streams that then spread out once more.</p><br/><p>Miserable screams rang out; quickly a shocking change occurred on the battlefield!</p><br/><p>Rumbling sounds filled the air as one Northern Reaches cultivator after another withered up and died. The blood mist then split from two parts into four, then eight, then sixteen, then thirty-two, then sixty-four…. In the end, hundreds of streams of blood mist spread out, boring into hundreds of bodies, sucking away their qi, blood, cultivation base, and soul. Then, the mist spread out again.</p><br/><p>All it took was the blink of an eye for thousands of streams of red mist to be visible. It was evil, Devilish, and seemed to be sentient as it spread out, avoiding all Southern Domain cultivators and seeking only Northern Reaches cultivators to destroy.</p><br/><p>Up in mid-air were the three peak Dao Seeking Patriarchs from the Northern Reaches. There were the two identical old men who wore black and white clothing and looked like hopping vampires. The other bore the semblance of a young man, around whom swirled mysterious magical symbols. From the look of it, each one of those magical symbols contained some type of weapon, just ready to be unleashed.</p><br/><p>All three of them looked at what was happening with complete shock. After exchanging glances, they didn’t hesitate any longer. Employing all the speed they could muster, they fled off into the distance.</p><br/><p>How could they possibly dare to continue the fight?!</p><br/><p>The Dawn Immortal was dead. Of the seven peak Dao Seeking experts, four were gone, three of them slain by Meng Hao. Furthermore, it seemed apparent that Meng Hao… still wasn’t dead!</p><br/><p>There was no way they could possibly dare to stay behind. Besides, Pill Demon was now at the peak of Dao Seeking, as were Patriarch Golden Frost and Patriarch Song. Those three alone were enough to cause problems, and that was not to mention Meng Hao’s second true self. He might seem weak, but if Meng Hao recovered, he would be yet another powerful enemy!</p><br/><p>There was simply no way to continue to fight.</p><br/><p>The death of the Dawn Immortal’s clone had sealed the fate of the Northern Reaches’ second army.</p><br/><p>The remaining three peak Dao Seeking experts fled, shivering in fear. Their only hope was to rendezvous with the third wave army. Only then would they possibly dare to reappear and face Meng Hao.</p><br/><p>It wasn’t that it didn’t occur to them to seize this opportunity to try to kill Meng Hao once and for all…. Rather, the risk was too great. Fleeing was the safest option.</p><br/><p>The three fleeing Dao Seeking experts completely ignored the remaining 100,000 or more Northern Reaches cultivators down below. As for Patriarch Song and the others, they hesitated for a moment as they considered whether or not to pursue them. In the end, they decided that Meng Hao was more important.</p><br/><p>Even if they did catch up with them, it wouldn’t be easy to secure a win in a short period of time.</p><br/><p>Pill Demon and the others exchanged glances.</p><br/><p>“Don’t interfere with him,” said Pill Demon. “Let’s start setting up spell formations to seal this place off and protect him!</p><br/><p>“That’s the correct course of action. He’s using the Blood Demon Grand Magic to recover! Let’s go!” Immediately, they split up and began to seal down the area.</p><br/><p>Down below, the blood mist raged. It was now split into more than ten thousand streams, which completely obfuscated the sky and land. Vast quantities of Northern Reaches cultivators were being consumed. No Blood Demon Grand Magic vortexes could be seen; the blood mist bored directly into the cultivators. They were incapable of fleeing, and their bodies were withered rapidly. Their fate was sealed; their qi and blood, their cultivation bases and their souls all became living sacrifices!</p><br/><p>Miserable shrieks filled the battlefield, along with cries of pain. The Southern Domain cultivators were completely shocked and surprised by what they were witnessing.</p><br/><p>What they saw was countless withered corpses with wide eyes and lifeless faces filled with what seemed to be the utmost pain.</p><br/><p>The blood mist grew larger and larger. Soon there were tens of thousands of streams, which were now forming a nucleus in the place where Meng Hao had initially exploded. As for the mist itself, it seemed to stretch out from that central nucleus.</p><br/><p>Soon, a tempest of bloody mist seethed around that nucleus, rapidly transforming it into something that looked like a cocoon. Then, something that resembled a shocking heartbeat could suddenly be heard.</p><br/><p>Thump-thump!</p><br/><p>Thump-thump!</p><br/><p>Thump-thump!</p><br/><p>Every heartbeat caused the land to tremble, and the sky to darken. It was as if the entire world were being covered by infinite ferocity. Boundless red mist seemed to be stretching out from the cocoon. There were now more than 50,000 streams sweeping about, making impossible for the Northern Reaches cultivators to flee.</p><br/><p>“NOOO!!”</p><br/><p>“Damn you, Southern Domain cultivators! You’re too ruthless!”</p><br/><p>“Kill them! Kill some of these Southern Domain bastards while there’s still the chance!”</p><br/><p>The Northern Reaches cultivators who had invaded the Southern Domain seethed with hatred and let out enraged shouts.</p><br/><p>Meanwhile, far out among the stars outside of Planet South Heaven, there was a mighty river that no cultivator would be able to see, speeding along.</p><br/><p>At first glance, the river seemed to be frothy and muddy, but upon closer inspection it grew more clear. This river was called the River of Forgetfulness, and its source was the Fourth Mountain [1. I think I mentioned in a footnote before that in Chinese, the number 4 is pronounced almost the same as the word for “death,” and they are usually associated with each other]. It swept through the great Nine Mountains and Seas, controlling the cycle of reincarnation, and the path to the underworld.</p><br/><p>Any living being which died in the Nine Mountains and Seas, assuming their soul did not disperse, would enter into this great river, and then be carried to the Fourth Mountain, after which they would begin their cycle anew.</p><br/><p>There appeared to be endless souls within the great river, most of whom looked around wide-eyed, moaning and screaming. Many struggled to escape the river water, including powerful beasts and mighty cultivators.</p><br/><p>Of the numerous fierce beasts in the river, one was a pangolin who was covered with long spikes. It was fully three thousand meters long, and was currently roaring in rage. [1. In Chinese, pangolins have a pretty cool name. The characters literally mean “pierce mountain armor”]</p><br/><p>It was half submerged in the river water and struggling mightily. Once it was completely submerged, it would lose its mental faculties. As it struggled desperately, the beast let out a mighty roar.</p><br/><p>“I’m an Immortal from the Mountain Deity Tribe! My grandfather is the Dao Lord of the Wind People of the Seventh Mountain! How dare you try to drag me into the cycle of reincarnation!!”</p><br/><p>As the beast roared, it began to rise up. It was just on the verge of leaving the water, when suddenly, the river began to seethe. A spray of water burst into the air, which expanded out to form a sea. A rumbling sound could be heard as the beast was submerged. A miserable shriek rang out through the void as the gigantic creature was smashed, transforming into countless discarnate souls that merged into the river water.</p><br/><p>The scene caused all the surrounding beast souls to tremble with fear and astonishment, even terror.</p><br/><p>Off in the distance, an old man sat upright, floating above the surface of the water, surrounded by the melodious music of a great Dao. Every bit of his soul radiated Immortality, and his body shone with radiant light that spread out in all directions over the vast river. He seemed like a preeminent Immortal, towering over the River of Forgetfulness. He ignored the water, which seemed incapable of fazing him in the least.</p><br/><p>“I am an almighty Dao Lord of the Sixth Mountain. My longevity might have ended, but in the past, the longevity of Dao Lords in the Nine Mountains and Seas was unlimited! Now… under what authority are you dragging me into the cycle of reincarnation, Fourth Mountain?!” The old man suddenly looked up, and his eyes seemed like two suns. Any souls that he looked at immediately began to scream and dissipate.</p><br/><p><strong>Chapter 779: The Northern Reaches Routed!</strong></p><br/><p>-----</p><br/><p><em>This chapter was sponsored by Jake Ridgeway, Jose Acosta Comas, and Michael Gibson</em></p><br/>\n</div>"}