{"title": "Chapter 797: Reuniting.", "id": 797, "volume": 8, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-797-reuniting", "volume_title": "Volume 8", "body": "<h1>Chapter 797: Reuniting.</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 797: Reuniting….</strong></p><br/><p>“I should have killed you the last time we met in the Milky Way Sea, slut!” This second voice was that of a woman.</p><br/><p>The two voices instantly shattered the pause which had caused everything to cease moving. The Ninth Mountain continued to descend, and all the cultivators could move again.</p><br/><p>Even as the cold snort continued to echo about, a sword beam shot through the air to completely sever the invisible connection between the Dawn Immortal and Meng Hao!</p><br/><p>Booming echoed out, and a tremor ran through Meng Hao. The Blue Lotus vanished, and his Dharma Idol was restored. His eyes went wide as he saw two figures approaching from off in the distance.</p><br/><p>It was a man and a woman, and when Meng Hao could see them clearly, his mind filled with thunderous roaring.</p><br/><p>He knew those faces well. Even if tens of millions of years passed, he would not be able to forget them. The woman was his mother, the mother who had held him in her arms when he was a child, and told him stories. The man was his father, who seemed strict, but whose eyes were filled with boundless fatherly love.</p><br/><p>[caption id=\"attachment_68636\" align=\"aligncenter\" width=\"500\"] Official ISSTH art of Fang Xiufeng, Meng Hao's father[/caption]</p><br/><p>[caption id=\"attachment_68637\" align=\"aligncenter\" width=\"580\"] Official ISSTH art of Meng Li, Meng Hao's mother[/caption]</p><br/><p>[caption id=\"attachment_68639\" align=\"aligncenter\" width=\"400\"] Cute version of Fang Xiufeng[/caption][caption id=\"attachment_68638\" align=\"aligncenter\" width=\"400\"] Cute version of Meng Li[/caption]</p><br/><p>Meng Hao began to tremble, and could do nothing more than stare blankly. At the same time, the mark on his hand began to shine brightly.</p><br/><p>As soon as the man and woman appeared, the Dawn Immortal’s face flickered. She began to pant, and her expression was one of complete disbelief as she backed up.</p><br/><p>She had only retreated by three measures when the man’s gaze locked onto her.</p><br/><p>A rumbling sound echoed out, and then blood sprayed out of the Dawn Immortal’s mouth. A look of astonishment covered her face. It was at this point that the Dharma Idol behind her directly exploded into countless pieces.</p><br/><p>Furthermore, the enormous resurrection lily on the Milky Way Sea, which was the Dawn Immortal’s true body, also exploded, shattering into countless pieces. The Resurrection Lily… was completely defeated.</p><br/><p>“One look from him shattered my Dharma Idol,” thought the Dawn Immortal, her face pale. “It even seriously injured me…. What just severed my Blue Lotus bridge just now was not a sword, it was his gaze!</p><br/><p>“Who is he!?!?</p><br/><p>“His level of power is unimaginable. Even the Ji Clan can’t begin to compare!” Her foundation had been destroyed, and now, she didn’t dare to back up any more. In the face of an almighty being like this, whether or not she lived or died wasn’t up to her.</p><br/><p>“Before I came to this planet,” the man said coolly, standing between Meng Hao and the Dawn Immortal, “an old friend revealed to me that there was a flower here within the ocean, left behind by his benefactor. The flower had long since become a Demon that had existed for countless years.</p><br/><p>“It had experienced nirvanic rebirth numerous times, and was not willing to truly ascend to Immortality. You must be the flower he spoke of.</p><br/><p>“You clearly could have achieved true Immortal Ascension long ago, and made your way out into the starry sky. Why have you made things hard on yourself, and on others? Well, considering your existence has provided some benefit to my son through all his tempering, I won’t slay you this day.</p><br/><p>“Go break through to Immortal Ascension already!” The sky and land trembled as if struck by countless peals of thunder. When this man spoke, natural law conformed to his words. The Dawn Immortal’s face went pale, and more blood sprayed from her mouth as she fell back a full three thousand meters. Finally, she looked up, and a smiled a heartrending smile.</p><br/><p>The woman standing next to the man suddenly spoke up. “Why waste your words on her? Just sever her head!”</p><br/><p>Meng Hao stood behind the two of them, his mind spinning with disbelief. His heart was in complete chaos, and he had no idea what to say.</p><br/><p>“Sever me?” The Dawn Immortal laughed bitterly. Her face twisted savagely, and her hair was thrown into disarray. She had lost her foundation, the actual Resurrection Lily. Her Dharma Idol had been destroyed. And yet, a look of madness could be seen in her eyes.</p><br/><p>“The League of Demon Sealers are all a heartless bunch. I kept that man company, but he severed me in the end!</p><br/><p>“My heart beats with HATRED!!</p><br/><p>“I was born in ancient times, and yes, I could have achieved Immortal Ascension on many occasions throughout the years. The only reason I never left this place is because of what he told me back then.</p><br/><p>“He severed me here, and then left on his own. I killed countless members of his bloodline, but my hatred remains!</p><br/><p>“And now you… YOU want to sever me too!?” She lifted her head up and laughed. Then she flung her arms out wide.</p><br/><p>“I have existed in the lands of South Heaven since ancient times. I may have stayed hidden and out of sight, but now, I call on all of the people who owe favors to me, the Dawn Immortal…. All of you… help me assimilate this child!</p><br/><p>“Help me achieve my desire! Abide by your promises from the past!”</p><br/><p>Her shrill voice echoed out throughout all the lands of South Heaven. As it did, a soft sigh could be heard echoing out from within the Ancient Dao Lakes. The sigh seemed to contain helplessness, and at the same time, shocking power.</p><br/><p>“I should not emerge. According to the treaty from back then, I cannot emerge. And yet this favor… must be paid back.” A gold-violet beast suddenly appeared from within the Ancient Dao Lakes.</p><br/><p>At the same time, dust began to fall off one of the statues inside the Ancient Temple of Doom. The statue’s eyes opened. At first, they looked confused, but then an archaic light began to shine out, and the statue slowly rose to its feet.</p><br/><p>“It was she who enabled me to go into hiding in this ancient temple, and acquire that joss stick’s power. If I don’t emerge, I can’t rest my heart at ease.”</p><br/><p>Far beneath the surface of the Milky Way Sea, an emaciated figure suddenly clawed its way out from within the mud and silt.</p><br/><p>“The favor from years ago will be repaid today. However, before that happens, I must consume more blood.”</p><br/><p>In the vast Western Desert, because of the draining of the Violet Sea into the Milky Way Sea, its water level had been greatly reduced. Not too far beneath the surface of the Violet Sea was a mountain that at first seemed completely ordinary. But then the mountain began to shake, and suddenly a face appeared on it. This mountain… began to rise up.</p><br/><p>It was no mountain, but rather, an enormous giant. It looked like a mountain deity as its head broke through the surface of the water. Its expression was archaic as it flew up into the air.</p><br/><p>“Slaughter! To repay my debt, I shall slaughter a million cultivators!”</p><br/><p>Also underneath the Violet Sea was a mountain range called the Black Dragon Mountains. The mountain range began to tremble, sending numerous boulders tumbling down its sides. Shockingly, an enormous crocodile appeared. It swished its tail as it shot out of the water, causing everything to shake.</p><br/><p>A brutal gleam could be seen in the crocodile’s eyes, and it did not speak. However, its unbridled ferocity exploded with intensity.</p><br/><p>In the Northern Reaches, in the lands of a minor tribe, was an altar, upon which rested a skull that had remained in that position year in and year out. It was impossible to tell how long it had been there. At this moment, a dim light began to shine out from the skull, and it flew into the air.</p><br/><p>Also in the Northern Reaches was a valley that was sealed over with ice. It was a forbidden zone for cultivators, and deep in its depths… was a chunk of ice. Sealed inside of the ice was a man who had golden wings growing out of his back.</p><br/><p>The man’s eyes snapped open, and cracking sounds could be heard as the ice shattered. He stepped out, frowned, then gave a light sigh.</p><br/><p>“Back when I arrived, I was seriously injured and was on the verge of death. She kept me alive… and made me promise to pay her back.”</p><br/><p>In the vast Eastern Lands were two forbidden zones.</p><br/><p>One was the Ancient Paradise. Rumor had it that the entire place was filled with countless ancient medicinal plants, each one of which emanated strong auras of death. That was because the Ancient Paradise was actually… an ancient battlefield.</p><br/><p>Within the Ancient Paradise was an enormous, withered tree, whose roots spread throughout the ground. The tree trembled in response to the Dawn Immortal’s call, and its roots retracted back into the body of the tree. When that happened, the tree… surged with shocking energy!</p><br/><p>There was another forbidden zone in the Eastern Lands, which some people called the Immortality Temple. It was located in a sprawling mountain range, and was filled with innumerable restrictive spells. Deep in the mountains was an ancient, dilapidated temple.</p><br/><p>The statue of whatever divinity it was that the temple had been erected to had long since crumbled, and was impossible to see clearly. However, inside the temple was an oil lamp which had not been lit for uncountable years. As of this moment, that oil lamp blazed with fire, and began to pulse with a divine light.</p><br/><p>The light covered the entire ancient temple, as well as the statue of the divinity. Suddenly, a figure appeared, who then sighed.</p><br/><p>“Well, she came from here, and is connected to me….” It separated from the image of the divinity, floated up out of the ancient temple, then flew off into the distance.</p><br/><p>A total of nine auras surged out, causing rumbling to spread throughout all the lands of South Heaven. The sky turned dark, and the living creatures in the land trembled. All of the cultivators on the battlefield appeared to be on the verge of losing consciousness.</p><br/><p>The great sects of the Eastern Lands were completely astonished, and their Patriarchs began to think about the various legends recorded in their ancient records.</p><br/><p>In the Ji Clan of the Eastern Lands, the armless young Patriarch stood up, and a strange light gleamed in his eyes.</p><br/><p>“The Dawn Immortal is incredible! Even I could never have imagined that she would have set up so many contingencies!</p><br/><p>“And it’s no wonder! She has existed for… countless, countless years. If she had focused solely on cultivation, it would be impossible to even speculate what Realm she would be in.”</p><br/><p>As the lands of South Heaven trembled, the husband and wife stood there in front of Meng Hao. The woman’s face flickered as she looked around, then she stepped back to stand next to Meng Hao.</p><br/><p>Meng Hao’s mind was still spinning, and as he looked at her face, he felt like he was in a trance.</p><br/><p>“Are you… really my mom…?” he murmured.</p><br/><p>“Hao’er,” she responded. “You’ve suffered many hardships throughout the years.” This woman was none other than Meng Hao’s mother. When she looked at him, her heart stabbed with pain. She reached out to clasp his hand, and her eyes were filled with both love and tears.</p><br/><p>“It’s all my fault,” she said. “I’m a bad mother for not being able to take care of you. You were so young back then…. When daddy and I left, you ran out of the house crying and yelling. I saw you fall down, and my heart broke.” [1. Meng Hao had a vision of when his parents left him, way back in chapter 653]</p><br/><p>It was at this point that the man turned back to look at Meng Hao. It was a gaze that caused Meng Hao’s mind to tremble. It was filled with love and kindness, and it instantly caused tears to begin to stream down Meng Hao’s face.</p><br/><p>He never imagined that he would cry at this moment in time. He had never imagined that he would reunite so quickly with his father and mother.</p><br/><p>He wasn’t sure what to say, but he couldn’t stop the tears from streaming down.</p><br/><p>His mother saw Meng Hao weeping, which caused more tears to flow down her own face.</p><br/><p>“Hao’er….” she said, and then embraced him warmly, which made Meng Hao think about the times when he was a boy, and how he hated leaving her side.</p><br/><p>“Don’t cry,” said his father, tousling his hair. He was smiling, and the love in his eyes seemed to grow even stronger.</p><br/><p>“You’re grown up now….” he said calmly. “You’re already half a step into true Immortality, so it’s time that I pass on some Daoist magic to you. My Dao, is the Dao of the sword.... Watch carefully, I’m going to show you nine sword forms.</p><br/><p>“First form!” He extended his left leg and bent it slightly. Then his body sprang into motion. He bent backward gracefully until he looked almost like a taut bow, completely at one with Heaven and Earth. In the next breath, it seemed as if Heaven and Earth were wholly incompatible with him, and yet were helpless to do anything. It was as if he had drawn an incredible burst of power down from the Heavens.</p><br/><p>He extended his right hand, within which appeared an ordinary iron sword. [1. We have seen this iron sword before, in chapter 782]</p><br/><p>The sword… swept toward the Southern Domain’s Ancient Dao Lakes!</p><br/><p>-----</p><br/><p><em>This chapter was sponsored by Seth Kerremans</em></p><br/>\n</div>"}