{"title": "Chapter 792: The Dao Becomes a Mist; the Mist Becomes a Blade!", "id": 792, "volume": 8, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-792-the-dao-becomes-a-mist-the-mist-becomes-a-blade", "volume_title": "Volume 8", "body": "<h1>Chapter 792: The Dao Becomes a Mist; the Mist Becomes a Blade!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 792: The Dao Becomes a Mist; the Mist Becomes a Blade!</strong></p><br/><p>“It’s Meng Hao!!”</p><br/><p>“It’s the exalted Meng Hao! How could that dinky ancestral statuary possibly suppress his excellency Meng Hao!?”</p><br/><p>“Isn’t his excellency Meng Hao at Dao Seeking…? How could there be a great Dao of Spirit Severing?”</p><br/><p>The Southern Domain cultivators were in an uproar, and many of them were completely flabbergasted. From the feeling most people got, Meng Hao couldn’t possibly be in the Spirit Severing stage. Essentially, most people had long forgotten that his cultivation base was actually at the Second Severing level!</p><br/><p>In the history of the lands of South Heaven, there had never been a Spirit Severing expert who possessed a peak Dao Seeking clone. Nor had there ever been a battle in which a Spirit Severing cultivator actually fought and killed someone at the peak of Dao Seeking.</p><br/><p>The things which these cultivators were witnessing were completely unheard-of. Therefore, there were quite a few people who actually believed that Meng Hao… was at the peak of Dao Seeking!</p><br/><p>Of course, the Northern Reaches cultivators’ shock and astonishment was even more intense.</p><br/><p>“The ancestral statuary can’t keep him suppressed! Just… where is this guy from!?”</p><br/><p>“He’s actually at the Spirit Severing stage? That’s impossible!!”</p><br/><p>“Heavens! How… how could he possibly be a mere Spirit Severing cultivator!? If he can fight the peak of Dao Seeking now, then when he steps into Dao Seeking, doesn’t that mean he could fight false Immortals!?!?”</p><br/><p>The Northern Reaches cultivators were thoroughly astonished. One by one, they all looked over toward Meng Hao with expressions of shock and disbelief.</p><br/><p>These people were not very familiar with Meng Hao. Now that they realized the truth about him, it was almost impossible for them to accept.</p><br/><p>As for the Western Desert cultivators, they immediately began to make loud exclamations, the noise of which turned into a sound wave that shook everything.</p><br/><p>“The number one non-Immortal in all the lands of South Heaven!”</p><br/><p>“The exalted Meng Hao is about to free himself!”</p><br/><p>“Spirit Severing into Dao Seeking!”</p><br/><p>As for Pill Demon and Patriarch Song, they were unfazed. Although they knew Meng Hao’s true cultivation base, and had gotten used to his incredible power, they had stopped paying attention to the fact that he was actually still in the Spirit Severing stage.</p><br/><p>However, the Northern Reaches cultivators did not know this, and they stared with gaping mouths. The obese woman was especially astonished, and she suddenly glanced over at the expressionless face of Meng Hao’s second true self.</p><br/><p>Then she started to tremble, and her scalp went numb. She suddenly had the feeling that the Northern Reaches had made a colossal mistake in invading the Southern Domain.</p><br/><p>There was someone who was even more shaken than her, a person whose heart filled with massive waves of astonishment. That was the number one most powerful expert from the Northern Reaches, the Imperial Bloodline Clan Chief!</p><br/><p>He was in a daze, and could hardly believe what was happening. In fact, he wasn’t willing to believe. The incredible battle he had just experienced with Meng Hao had left him wounded, and had forced him to use the ancestral statuary. And that… was a battle with a Spirit Severing expert!?</p><br/><p>“Impossible!” he gasped. His eyes were filled with not just shock, but also terror. He could never have possibly imagined that there really was an unequaled Chosen who could accomplish the things Meng Hao had while merely in the Spirit Severing stage.</p><br/><p>In his disbelief, he felt his scalp grow completely numb.</p><br/><p>“No matter how you put it, you have to say that the Third Severing is the most critical of all,” he thought. “The slightest mistake, and you immediately perish. Even if you aren’t completely right or wrong, your cultivation base will be forever restrained.</p><br/><p>“Meng Hao obviously hasn’t prepared well for the Third Severing, that much can be determined. Therefore, this Spirit Severing right now is being done because he’s been forced into a corner. It’s a forced Severing!</p><br/><p>“In that case… if he fails, then he will perish this very day!</p><br/><p>“Meng Hao… there’s no way that you can succeed!” The Imperial Bloodline Clan Chief was truly frightened, and simply couldn’t believe how unimaginably powerful Meng Hao would be if he succeeded in entering into Dao Seeking….</p><br/><p>The great Dao was growing even more powerful. The entire sky above South Heaven was now completely obscured.</p><br/><p>In the lands of South Heaven, in that tower of Tang, the man and woman stood together, trembling. The woman was excited, and the man was apparently trying to keep his cool, but failing.</p><br/><p>They had been waiting for this day for a very, very long time.</p><br/><p>“We still can’t go,” murmured the man. “Just wait a bit longer. Only a little bit…. This is the final stretch!</p><br/><p>“If he succeeds, then we will finally be able to reunite. If he doesn’t succeed….”</p><br/><p>His wife clasped his hand tightly. Both of their palms were slick with sweat.</p><br/><p>In their entire lives, this man and woman had never been so nervous, nor was there any event they had ever experienced that was so important. Even if some shockingly powerful individual attempted to interfere with what was happening, they would pay any price to stop that person from causing even the slightest bit of trouble!</p><br/><p>“We’ve waited for three lives. For hundreds of years…. Just for this moment!”</p><br/><p>“Hao’er, you… must… succeed and reach Dao Seeking!”</p><br/><p>Back in the cage, Meng Hao sat cross-legged, trembling slightly, his hair floating around him. The world around him had shrunk down to only about three thousand meters. There was virtually nothing around him except for air. All of the mountains and everything else had been crushed into dust by the shocking pressure.</p><br/><p>Cracking sounds could be heard emanating out from his body, as if his skeleton were being ground away.</p><br/><p>However, Meng Hao didn’t notice. All of his concentration was focused on summoning the blade of the Third Severing. The more intense his summons grew, the more obscure Heaven and Earth became in the outside world.</p><br/><p>The great Dao grew stronger, to the point where a mist appeared…. The mist was first seen on the battlefield and then spread out to cover all of the lands of South Heaven.</p><br/><p>The peak Dao Seeking experts from the three territories immediately recognized what was happening. They began to speak in hushed tones, which were overheard by the other cultivators, causing their hearts to tremble.</p><br/><p>“That’s….”</p><br/><p>“A Dao turned into mist!!”</p><br/><p>“The only time a Dao will take form as a mist is when an incredibly powerful expert gains enlightenment of a great Dao! Only then will such transformations of Heaven and Earth take place!!”</p><br/><p>“This is something you only hear about in legends! It’s virtually unheard of in the lands of South Heaven!!”</p><br/><p>A gleam of excitement appeared in Pill Demon’s eyes, and he almost couldn’t hold back the laughter that burst out in his heart.</p><br/><p>Patriarch Song looked equally excited.</p><br/><p>In contrast, Meng Hao’s second true self suddenly closed his eyes and sat down cross-legged in midair!</p><br/><p>The descent of the great Dao caused all hostilities to cease. Even the peak Dao Seeking experts were incapable of making attacks during the great Dao’s descent. The Northern Reaches experts could do nothing but stare in wide-eyed disbelief at Meng Hao’s second true self sitting there cross-legged.</p><br/><p>“Dammit! You’d better not pull it off, Meng Hao!” thought the Imperial Bloodline Clan Chief. His heart was pounding.</p><br/><p>Currently, all of the powerful experts of the Northern Reaches, Western Desert and Southern Domain were closely observing the scene. Back in the Eastern Lands, the Ji Clan was completely quiet. As for the young Patriarch with the missing arms, he was staring fixedly at what was happening.</p><br/><p>By this time, there were other powerful experts from various sects and clans in the Eastern Lands who had also sensed what was happening. Shocked, they sent out their divine sense to observe. However, no one dared to do anything. After all, if the Ji Clan wasn’t interfering, how could they dare to interfere?</p><br/><p>It was at this point that, back in the cage, Meng Hao abruptly lifted his head. His eyes opened, and he cried out: “Third Severing!”</p><br/><p>His voice echoed back and forth within the world, which had now shrunk to 1,500 meters. At first it didn’t seem that the sound could be heard in the outside world, but in actuality, it was as if there were innumerable Meng Haos issuing an echoing cry that could be heard faintly by those outside.</p><br/><p>It almost seemed as if the sound was coming from the mist itself, as if the echoing response came from within the descending great Dao itself.</p><br/><p>Countless ears heard the voice, and everyone who did was completely and thoroughly shaken.</p><br/><p>As the voice echoed out, the mist that covered all of South Heaven suddenly surged back, roiling as it condensed above the battlefield in the Southern Domain. There, in midair, it formed into the shape…</p><br/><p>Of a Mist Blade!!</p><br/><p>Mist Blade!</p><br/><p>Dao enlightenment! [1. There is an important play on words here. In Chinese, “Mist Blade” is pronounced “wù dāo,” almost exactly as the pronunciation of Dao enlightenment, which is “wù dào”]</p><br/><p>As soon as the Mist Blade appeared, the eyes of all of the peak Dao Seeking experts on the battlefield went wide. Their minds filled with a roaring sound. Even Pill Demon wore an expression of disbelief.</p><br/><p>The fact that there was a Dao that became so strong it turned into a mist was shocking enough. Something legendary like that was possible to accept. However… to see the mist turn into a blade was something that filled them with uncontrollable shock.</p><br/><p>“Mist… Blade!!” thought the shocked Imperial Bloodline Clan Chief. “That’s… something that should be experienced on the Immortal Mountain, just before pushing open the Door of Immortality, when reaching Immortal Ascension!!”</p><br/><p>“Those who achieve true Immortal Ascension must face Immortal Tribulation. After they transcend the tribulation, they will stand on an Immortal Mountain of their own. As they take that step forward, a Mist Blade will fall. Then, they will be severed from the Spirit Realm and have the power to push open the Door of Immortality, and become a true Immortal!</p><br/><p>“But he… is using a Mist Blade to perform his Third Severing!! When that Mist Blade slashes through him, it will sever his Spirit Nucleus and stabilize the path to true Immortality!!”</p><br/><p>His mind was reeling, and his body trembling. Suddenly, he realized that sending troops into the Southern Domain had been a monumental error!!</p><br/><p>All of the peak Dao Seeking experts up in midair were shocked. Of course, it wasn’t just them. In the Eastern Lands, the Patriarchs of the various sects were equally astonished. They could hardly believe what they were seeing, and were filled with shock and disbelief.</p><br/><p>“Who is that young man!?”</p><br/><p>“He’s using a Mist Blade for his Third Severing! If he fails then it doesn’t matter, but if he succeeds, wouldn’t it be a defiance of the Heavens?!”</p><br/><p>“If he succeeds, then will he step into Dao Seeking, or Immortality?”</p><br/><p>The armless young man in the Ji Clan suddenly rose to his feet, his eyes wide and filled with disbelief.</p><br/><p>“Rumor has it that Fang Xiufeng, the number one Chosen in the Fang Clan, used a blade composed of twenty percent mist in his Third Severing. That caused a huge commotion among the ancient clans of the Ninth Mountain. Even the Patriarch watched the whole thing with rapt attention. [1. Fang Xiufeng’s name in Chinese is  fāng xiù fēng. Fang is a surname which also means “square” or “direction.” Xiu means “elegant” or “handsome.” Feng means “peak” or “summit”]</p><br/><p>“This Meng Hao… he… he’s actually even more Heaven-defying in his Spirit Severing than Fang Xiufeng. He’s actually… using a complete Mist Blade!”</p><br/><p>In the Tower of Tang, the woman gasped.</p><br/><p>“The Dao became a mist, and the mist became a blade!” The woman’s eyes shone with excitement, and she was trembling violently. “Husband… can you believe Hao’er is doing this!?!? He even… he… he didn’t just bring SOME of the mist together, he actually used all of it to make a Mist Blade! He’s vastly more shocking than you!!”</p><br/><p>“Seventh Year Tribulation,” murmured the man. “Four lifetimes. Three incarnations predestined…. Only by preventing his Karma from being contaminated by ours, could we give him a slight chance at life!</p><br/><p>“The Dao became a mist, the mist became a blade. That blade will complete the gap between Immortal and Devil!” The man’s eyes shone with a bright light, and he couldn’t help but lift his head up and laugh. “It’s natural that a son of Fang is even more astonishing than his father!”</p><br/><p>-----</p><br/><p>Fang Xiufeng</p><br/><p>[audio mp3=\"http://www.wuxiaworld.com/wp-content/uploads/2016/07/fang_xiufeng.mp3\"][/audio]</p><br/><p>-----</p><br/><p><em>This chapter was sponsored by Alessio Bastardi, Camilo Rey, and Valera McDaniel</em></p><br/>\n</div>"}