{"title": "Chapter 798: Father Makes a Laughingstock of South Heaven", "id": 798, "volume": 8, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-798-father-makes-a-laughingstock-of-south-heaven", "volume_title": "Volume 8", "body": "<h1>Chapter 798: Father Makes a Laughingstock of South Heaven</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong></strong></p><br/><p>[/expand]</p><br/><p>“Three thousand great Daos,” the man said softly. “They each have their powerful and extraordinary aspects. In fact, it’s impossible to say which is the most powerful….</p><br/><p>“The Dao exists in the heart, and the heart is born of the will. If your will is strong, then your Dao will be powerful, and your sword… will be invincible!</p><br/><p>“Pay attention to my movements. There are nine in total, and each one can stir up the power of the stars.” The iron sword descended.</p><br/><p>The sky and land shook, and all the light in the world seemed to vanish. The only thing left behind was the sword beam. Everything grew faded and blurry; the only thing remaining was the iron sword!</p><br/><p>The sword beam surged, and the iron sword descended. It appeared above the Ancient Dao Lakes, directly in front of the flying beast that had just emerged. The beast stared in shock at the sword beam, and its face fell completely. It let out a miserable shriek, and appeared to be in a state of thorough astonishment and disbelief. It raced backward in an attempt to get back into the Ancient Dao Lakes.</p><br/><p>“This… this….” Even as the beast retreated, the sword beam closed in. At the same time, the Ancient Dao Lakes erupted, and an archaic voice echoed out.</p><br/><p>“Your Excellency, please calm your anger. I beg of you to show mercy to this clan member of mine….”</p><br/><p>“Request denied!” growled a voice which caused explosive pressure to fill the air above the Ancient Dao Lakes. The sword beam swept through the air, and the beast let out a bloodcurdling scream. Its body exploded into burning chunks as it was destroyed in body and spirit.</p><br/><p>One sword blow blotted it out of existence. Everything rumbled as one out of the nine auras which had appeared was wiped away. The remaining eight auras froze in midair, and their faces filled with astonishment. After only a moment, they hurriedly retreated.</p><br/><p>Unfortunately for them, it was too late!</p><br/><p>“Hao’er,” said Meng Hao's father, “look carefully at the second sword form. Always remember that when you attack with a sword, your mind must be empty, free of all distraction. You are the Dao, and the Dao is the sword!” Shockingly, what he was passing on was the most powerful Dao he had ever mastered in his life.</p><br/><p>A Dao could not be passed down lightly. However, this was his son. Considering that he had agreed to stand guard over South Heaven for 100,000 years for Meng Hao, there was no need to even wonder about whether he would pass down a Dao.</p><br/><p>Even as he spoke the words, he stepped forward with his right foot. The move was made so quickly that it kicked up a fierce wind. The second sword beam exploded out. The sky vibrated under the terrifying power; it almost seemed like all the man had to do was exercise a thought, and the Heavens could be slashed apart!</p><br/><p>Rumbling could be heard as the sword beam appeared above the Southern Domain’s Ancient Temple of Doom. The image of the statue was terrified, and already fleeing at top speed. However, before it could enter the temple, the sword beam slashed through the air. A bloodcurdling scream rang out as an almighty being was beheaded. His body raged with fire as he was completely destroyed.</p><br/><p>The only thing that remained was the lingering cry of death.</p><br/><p>“Above the Spirit Realm is the Immortal Realm,” said Meng Hao’s father. “Right now, you are half a step into true Immortality, which means you are in the space between the Spirit Realm and the Immortal Realm. When you complete that step… you will enter the Immortal Realm!</p><br/><p>“Now, pay attention to the third sword form.” Breathing steadily, he caressed the blade of the sword with his left hand, almost as if he were awakening its spirit. In this third sword form, the blade was stabbed down into the ground, causing the entire land to shake. The sword beam appeared beneath the Milky Way Sea, behind the withered figure there that was fleeing at top speed.</p><br/><p>“Who are you!?!? Don’t kill me! I surrender! I can be your son’s Dao Protector!!”</p><br/><p>Back in the Southern Domain, Meng Hao’s father looked back at him. “Hao’er, do you want him?”</p><br/><p>Meng Hao stared in shock, and then subconsciously shook his head.</p><br/><p>His father laughed.</p><br/><p>“Dao Protector? You’re not worthy to play such a role for my son.” As his voice echoed out, the sword descended. Rumbling filled the withered figure as his body collapsed into pieces which burned into nothingness.</p><br/><p>Three sword forms had slaughtered three almighty beings!</p><br/><p>When the Patriarchs of the ancient sects in the Eastern Lands saw what was happening, they rose to their feet and began to tremble with terror. As they observed, they began to surmise what exactly was happening.</p><br/><p>In the Ji Clan, the armless young Patriarch sighed.</p><br/><p>“If you people hadn’t showed your faces, none of this would have happened. He wouldn’t have gone to make trouble for you. At any other time, it wouldn’t have mattered. Considering his temperament, he really wouldn’t have paid you any attention. But now… you had to go and mess with his son.</p><br/><p>“Messing with his son is like rubbing a cat’s fur backward! Who would dare to do such a thing?”</p><br/><p>The remaining six auras were trembling violently. How could they ever have imagined that the Dawn Immortal would actually provoke someone this terrifying? Of these six auras, two ceased falling back, and instead shot high up into the sky, as if to flee the planet itself.</p><br/><p>One was the skull, the other was the mountain deity from the Western Desert’s Violet Sea.</p><br/><p>“On the path of cultivation, one cannot rely on the protection of others. You haven’t left Planet South Heaven yet in this lifetime. Let me tell you, I’ve seen far too many Chosen who utilize the help of Dao Protectors. By now… each and every one is as useless as a wild chicken or a stray dog.” Meng Hao’s father turned to him and chuckled, then performed an incantation with his left hand, extending his index finger and middle finger together. It almost seemed as if he were wresting away energy from Heaven and Earth, causing a bizarre glow to surround his entire body as he took two more steps forward. With each step, a blast of sword qi shot up into the sky.</p><br/><p>A moment later, the mountain deity let out a miserable shriek. Its enormous frame was clearly just about to escape Planet South Heaven. Nonetheless, it collapsed into pieces, which then burned into nothing.</p><br/><p>As for the skull, it shot out into the starry sky and was speeding away. Unfortunately for it, even with such speed, it could not outrun the sword qi.</p><br/><p>“NO!!” screamed the skull. Then, it was completely destroyed, including its Nascent Divinity.</p><br/><p>Meng Hao’s eyes widened, and he stared blankly at his father. He had taken five steps, and unleashed one sword after another. One by one he had slaughtered five terrifying beings as easily as if he were killing baby chickens. Those almighty creatures’ auras were such that any single one would leave Meng Hao dazed; any of them could have slaughtered him easily. And yet, a single beam of sword qi from his father, and they were completely eradicated.</p><br/><p>“What… what Realm are they in?” Meng Hao murmured.</p><br/><p>The first to reply was his mother. “They have opened their Immortal meridians, solidified their Dao Fruit, and stepped into the peak of the Immortal Realm. They refer to themselves as Dao Lords, but are unable to open the door to the Ancient Realm. They aren’t even true Immortals, and will one day return to the dust.”</p><br/><p>“In the Spirit Realm, Dao Seeking is the absolute peak,” said Meng Hao’s father. “In the Immortal Realm, there are two paths. The first path involves offering worship to an ancestor, acquiring that ancestor’s Dao Fruit, and then using it to tread the path to Immortality. On that path, you will never have a Dharma Idol of your own. Immortals like that are referred to as false Immortals. That is because, if that ancestor ever perishes, everyone who worships him will experience a drop in their cultivation base!</p><br/><p>“That is the easy path to Immortality, the one which the vast majority of people choose to follow. However, there is another path…. On that path, you worship yourself. Your Dharma Idol is your own. You experience Immortal Tribulation and tread your own path. Others can worship you and tread your path of cultivation as false Immortals. This second path is the path of… the true Immortal!”</p><br/><p>Meng Hao’s father moved like the wind as he took two more steps forward. Each step caused the ground to quake. His hair swirled around him in the air, and wisps of mist rose up from the top of his head. He waved his right hand, causing two more beams of sword qi to fly out, one toward the Eastern Lands, the other toward the Western Desert.</p><br/><p>In the Ancient Paradise of the Eastern Lands, the tree’s branches were rustling, and its aura surged. Its mind was unprecedentedly focused as it drew upon all the power it could muster. The entire Ancient Paradise began to vibrate. The ground split, and the tree’s roots writhed as it prepared to fight back against the incoming sword qi.</p><br/><p>A boom rang out, and the tree wailed. All the power it could muster did nothing to stop the incoming sword qi. The tree was split completely in half, and then began to burn. Screams of pain filled the air as the tree was transformed into ash.</p><br/><p>Beneath the surface of the Violet Sea in the Western Desert, the crocodile was trembling. It fled with all the speed it could muster, but the sword qi descended upon it nonetheless. In the blink of an eye, it was right above its head.</p><br/><p>The crocodile wore a look of hopelessness.</p><br/><p>“I… I can be a mount!” the crocodile cried out. “I don’t qualify to be a Dao Protector, but I… I’m willing to be a mount!”</p><br/><p>When it cried out, the sword qi suddenly came to a stop in midair. It swirled around, transforming into a sealing mark which fused onto the crocodile’s body.</p><br/><p>“You possess some of the bloodline of a Scaly Dragon. Thus, you are qualified to be a mount for my Hao’er.”</p><br/><p>The crocodile trembled, and its mind was completely occupied by terror and fear. After being sealed, its body shrank down until it was only about three meters long. Then it was pulled back rapidly until it appeared in front of Meng Hao.</p><br/><p>The crocodile knew that it was dealing with a Little Patriarch, so it immediately put on an ingratiating air and swished its tail back and forth.</p><br/><p>Meng Hao looked at the crocodile, an awkward expression on his face.</p><br/><p>“Unfortunately,” said Meng Hao’s father, shaking his head, “you’ve only opened 53 meridians. If you could open at least 60 or more, then you could summon the power of the Scaly Dragon’s bloodline.</p><br/><p>“Hao’er, in the Immortal Realm, there are no stages. There are only the 100 meridians of the Dao of Immortality.</p><br/><p>“All living creatures have 100 meridians, that is a constant. No living thing has more or less.</p><br/><p>“Once you enter the Immortal Realm, you will cultivate those 100 meridians. The soul is grouped into three spiritual aspects and seven physical aspects; a total of ten vessels. The meridians are organized into groups of ten, each of which form a vessel. If all 100 meridians are opened, you have achieved the Immortal Soul, and will produce your own unique Dao Fruit, whereupon you can open the door to the Ancient Realm! [1. Considering Meng Hao’s father’s explanation of the physical and spiritual aspects of souls, it now becomes more clear why the Wang Clan Patriarch was said to be incapable of truly reaching Immortal Ascension as described in chapter 682 and especially 683]</p><br/><p>“Unfortunately, success in the Immortal Realm is not so easy. From ancient times until now, someone with 50 opened meridians would be considered to be at the peak of the Immortal Realm, and could attempt to open the Ancient Door. According to legend, it is as easy to find someone with 80 opened meridians as it is to find a phoenix feather or a qilin horn. Only Chosen who are direct descendants of various great sects and clans would have a chance to do so.</p><br/><p>“90 opened meridians is something even rarer, and exists only in legends. As for the full 100 meridians… from ancient times until now, no one has ever done it.”</p><br/><p>“But you can, Hao’er!” said his mother immediately.</p><br/><p>His father laughed, then suddenly crouched slightly, then straightened up, his posture like a giant holding up the weight of the world. He took two steps forward and waved his arms, causing two beams of sword qi to shoot out, one toward the Eastern Lands, the other toward the Northern Reaches.</p><br/><p>Considering the level of his cultivation base, he actually didn’t need to use such meticulous movements; he normally moved as fluidly as the clouds or flowing water. However, for Meng Hao’s sake, he was demonstrating all of the movements in detail.</p><br/><p>In the frozen valley in the Northern Reaches, the man who had walked out from the ice earlier was now laughing bitterly. He didn’t make any move to evade, but rather, sat there cross-legged, chuckling, his eyes shining with a light of madness.</p><br/><p>Suddenly, his skin turned purple, and the power of a curse began to circulate around him as the sword qi bore down.</p><br/><p>“Anyone who kills me will have their bloodline cursed!” he cried, and the wings on his back suddenly opened wide.</p><br/><p>A cold snort echoed out. “Someone from a measly species of curse-users? Your bloodline isn’t pure, and yet you dare to try to curse the house of Fang?”</p><br/><p>The sword qi descended, slashing directly into the winged man’s head.</p><br/><p>Flames burst out, dissolving the curse power. It never even had a chance to be unleashed before it was dissipated completely.</p><br/><p><strong>Chapter 798: Father Makes a Laughingstock of South Heaven</strong></p><br/><p>-----</p><br/><p><em>This chapter was sponsored by Fabian Müller</em></p><br/>\n</div>"}