{"title": "Chapter 805: Well Pay You Back!", "id": 805, "volume": 9, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-805-well-pay-you-back", "volume_title": "Volume 9", "body": "<h1>Chapter 805: Well Pay You Back!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 805: We’ll Pay You Back!</strong></p><br/><p>A false Immortal!</p><br/><p>This was a false Immortal!</p><br/><p>The teenager made his appearance coldly, and as he stood in front of the other Ji Clan members, his eyes fell onto Meng Hao.</p><br/><p>“Screw off!” he said. He was well aware that Meng Hao had powerful backing, and didn’t want to provoke him. However, the ancestral mansion was under his personal command. If Fang Xiufeng showed up, he wouldn’t do anything to offend him. But for a member of the junior generation to dare to act in this way filled his heart with rage.</p><br/><p>His appearance on the scene immediately caused the surrounding Ji Clan members to grow excited. Ji Xuelin instantly “regained consciousness,” and looked excitedly at Patriarch Nine. Then he looked back at Meng Hao with anticipation regarding his imminent vengeance.</p><br/><p>“You’re definitely going to get put in place this time!” he thought.</p><br/><p>Meng Hao cleared his throat and looked up at the enormous bottle gourd Dharma Idol floating there.</p><br/><p>“Dharma Idol, huh….” Meng Hao smiled. “Well I have one too.” Eyes glittering, he took a step forward. Up to this point, he hadn’t called on the full extent of his power. Now, he rotated his cultivation base, and Immortal qi emerged. As soon as it did, everything trembled and shook, and an enormous Dharma Idol appeared that seemed capable of holding up the sky.</p><br/><p>The strength of this Dharma Idol was extraordinarily shocking; it was like some primordial giant whose face was that of Meng Hao!</p><br/><p>The sky shook and the ground quaked the moment the Dharma Idol appeared; natural law spread out, along with a vast pressure that weighed down on everything. The bottle gourd began to quiver, and it seemed to be expending all of its energy as it struggled to fight back against Meng Hao’s Dharma Idol.</p><br/><p>The sky looked like it was on the verge of being torn to shreds, and ear-shattering booms filled the air. The incredible pressure seemed capable of tearing Heaven and Earth apart from each other, and the land looked as if it were about to shatter into pieces.</p><br/><p>Almost instantly, Meng Hao and the teenager were in a deadlock!</p><br/><p>The Ji Clan members looked on, panting, their expressions blank. Their scalps were numb and their minds reeled. They knew that Meng Hao was strong, but… how could they ever have imagined that… he would be this strong!?</p><br/><p>He could even fight Patriarch Nine to a standstill. And their Patriarch Nine… was an Immortal!!</p><br/><p>The teenager’s face sank, and a strange light appeared in his eyes as he looked at Meng Hao. Inwardly, he let out a long sigh. He had known before that Meng Hao was extraordinary, but it wasn’t until he actually faced up against him that he realized… he had underestimated him.</p><br/><p>“So it’s true that he’s actually… half a step into true Immortality!”</p><br/><p>By now, the nearby cultivators had spread the news that Meng Hao had charged into the Ji Clan fortress. The news reached other sects, and soon all of the powerful experts of the Eastern Lands knew. Divine sense streamed forth, and gasps could be heard in the various sects throughout the Eastern Lands when they saw that Meng Hao could grapple with a false Immortal.</p><br/><p>“This Meng Hao is incredible!”</p><br/><p>“His father is extraordinary, and… so is he!”</p><br/><p>“The Fang Clan….”</p><br/><p>Countless eyes throughout the Eastern Lands were now fixed on the Ji Clan, and Meng Hao. Meng Hao’s eyes blazed with the desire to do battle; ever since his incredible cultivation base breakthrough, he had not battled a false Immortal. He truly wished to know how such a battle would turn out!</p><br/><p>He reached out his hand and pointed toward the teenager, and his desire to fight was clear.</p><br/><p>“Make your move!” he said.</p><br/><p>The Ji Clan cultivators were panting, especially those who normally flaunted their status as Chosen. Their faces were pale, and they were forced to admit that there was now a vast, unimaginable gap between themselves and Meng Hao. It was like the difference between Heaven and Earth, and was a chasm that could not easily be crossed.</p><br/><p>“He… is so much stronger than us!!”</p><br/><p>“It’s laughable to say that we are of the same generation. We can shake things up, but he… he can battle with our Patriarch!”</p><br/><p>“We… don’t even qualify to be his opponent….” This fact was quite a blow to the Chosen. Earlier, they had heard about Meng Hao’s strength, but to witness it with their own eyes was shocking to the soul.</p><br/><p>As he faced up against a bristling Meng Hao, Patriarch Nine realized that he was in somewhat of a dilemma. As the saying goes, if you ride a tiger, it’s hard to get off. Even as he hesitated, an archaic voice suddenly rang out from thin air to fill the Ji clan.</p><br/><p>“The Ji Clan cultivates Karma. Spirit stones are material objects, and can be considered a seed of Karma. The Ji Clan must not be infected by such Karma. Anyone who owes this person spirit stones must pay them back!</p><br/><p>“All of you, pay heed. The Ji Clan’s cultivation is different than that of the masses. To cultivate Karma, we must revere Karma. If you do not have the power to sever Karma, then you must yield to it!</p><br/><p>“Give it to him! Him coming here to ask for his spirit stones is in fact an aid to you in severing Karma with him. Do you still not understand? Once the Karma is severed, your cultivation will surely flourish.”</p><br/><p>As these few sentences reverberated through the air, the voice vanished. Patriarch Nine’s body jerked to a stop as he realized that the voice had come from the true Patriarch of the Ji Clan here in the Eastern Lands. His energy immediately dissipated along with the Dharma Idol, and he clasped hands and bowed to Meng Hao.</p><br/><p>“Many thanks for the assistance you have provided to these children of the Ji Clan in severing Karma, my young friend. Please inform me of exactly how many spirit stones are owed, and I will give them to you.”</p><br/><p>There were many people who appeared to be enlightened, and not just members of the Ji Clan. As for the handful of Chosen who owned spirit stones to Meng Hao, their bodies trembled as brilliant Dao light shone out from them. What seemed to be the music of a great Dao swirled around them, as if in this moment, their Dao heart was nudged forward.</p><br/><p>Meng Hao gaped in shock at this sudden reversal. That was especially so when he saw that the Dao light shining off of Ji Xuelin had intensified. From the look of it, he was experiencing a cultivation base breakthrough, which caused Meng Hao to breathe deeply.</p><br/><p>“I can’t believe the Ji Clan’s magic is so Heaven-defying!” he thought. “Cultivate Karma, revere Karma, sever Karma….”</p><br/><p>He watched wide-eyed as Ji Xuelin suddenly clasped hands and bowed to him.</p><br/><p>“Elder Brother Meng, many thanks for helping me to sever the Karma from that year.”</p><br/><p>The Chosen who owed Meng Hao spirit stones immediately began to clasp hands toward him and bow in thanks.</p><br/><p>“Many thanks, Elder Brother Meng!”</p><br/><p>“Many thanks, Fellow Daoist Meng Hao!”</p><br/><p>Meng Hao abruptly took a few steps back. He was actually a bit angry. He had merely come here to collect some debts; how could it have ended with him helping them?</p><br/><p>“Who was that old geezer who was talking just now?” he thought, frowning. “He’s so powerful! With just a few words, not only was he able to settle the dispute, he provided his clan members with good fortune AND turned me into the grindstone to help them polish their understanding of severing Karma.</p><br/><p>“Dammit!” Meng Hao was just about to leave when Patriarch Nine hurried forward, smiling.</p><br/><p>“Young friend, what are you doing?” he asked. “How many spirit stones do they owe you? Tell me and I’ll hand them over to you.”</p><br/><p>“Uhh, no, that’s fine,” Meng Hao said hastily. “All of us are actually good friends, and I was just pulling a little prank. Let’s leave the debt in place, alright? I’m… I’m in no hurry.” By this point, he was already back at the huge gate.</p><br/><p>“No, that won’t do,” said the youthful-looking Patriarch Nine. “There’s no need to say anything more, young friend. You’re being too magnanimous.” He turned to the Chosen. “All of you, tell me how much you owe. And tell me how much Xiaoxiao and the other two owe, too.” Patriarch Nine had also been somewhat enlightened now. He knew that to sever a Karma infection was something of great importance to these Chosen.</p><br/><p>To Ji Xuelin and the others, it was clear that great fortune had just arrived. Having just been enlightened about such a great truth, they immediately responded.</p><br/><p>“7,650,000!”</p><br/><p>“9,180,000!”</p><br/><p>“14… 14,000,000!”</p><br/><p>“8,330,000!”</p><br/><p>“Altogether, Xiaoxiao and the other two probably don’t owe more than 30,000,000….”</p><br/><p>When the youthful-looking Patriarch Nine heard how many spirit stones were involved, he stared in shock, then looked deeply at Meng Hao.</p><br/><p>“Young friend, you really are very magnanimous. In the future, you’ll surely be incredibly rich.”</p><br/><p>“You’re too kind, really,” said Meng Hao clearing his throat, and backing up. “Since Ji Xiaoxiao and the other two aren’t here, they can’t return what they owe personally and it doesn’t count as them settling the debt.” As far as he was concerned, these people from the Ji Clan were a bunch of lunatics. Who would possibly offer to pay back so many spirit stones? If he owed so many spirit stones to someone, he sure wouldn’t pay them back, even if he were beaten to death!</p><br/><p>“Really,” he said, “there’s no need to be hasty. How about this… you people get back to what you were doing. My dad asked me to help out around the house, so I’ll head home now….” By this point he was outside the main gate. However, just as he was about to leave, a bag of holding flew out and landed in his hand.</p><br/><p>“Inside that bag are all the spirit stones owed to you from the people here. As of now, they have no Karma connected to you.”</p><br/><p>There was a booming sound as the Ji Clan’s main gate slammed shut.</p><br/><p>Meng Hao chuckled bitterly. The promissory notes in his bag of holding instantly turned to ash. Luckily… there were still three remaining, the ones belonging to Ji Xiaoxiao and the others. Since they weren’t here, they wouldn’t be able to resolve their Karma.</p><br/><p>Meng Hao had his money, but was actually a bit depressed. Of course, what he didn’t know was that his matter of collecting his debts had actually shaken the entire Eastern Lands. Countless gazes were being cast in his direction at that very moment.</p><br/><p>He looked at the Ji Clan’s main gate, then recalled the iron hoops in his bag of holding. He hesitated for a moment.</p><br/><p>“Fudge, who cares about all that crap he said about Karma!? I’m keeping the iron hoops!” With that, he turned, clasped hands to the surrounding cultivators, then turned into a beam of prismatic light that shot off into the distance.</p><br/><p>He moved with such speed that in the blink of an eye, no trace of him remained. He reappeared far off in the distance, in the sky above the Eastern Lands. He sent some divine sense out to make sure that no one was watching him, and then his expression darkened.</p><br/><p>After a long moment, his eyes flickered.</p><br/><p>“I think that in the future, I should get more people to write promissory notes. Getting them to personally write the notes… is Karma….</p><br/><p>“Interesting. Perhaps these promissory notes will be of some use in the future!” Eyes glittering, Meng hao was just about to allow the Immortal Ancient Dao Medallion to guide him to the Daoist rite temple when suddenly, he stopped in place.</p><br/><p>“If I remember correctly… I still owe money to some people too…. I owe Steward Zhou three pieces of silver….” When he considered the matter, something about it didn’t seem right.</p><br/><p>“But when went looking for him before, Steward Zhou was already dead. Should I go find his descendants? Agh! That damned Patriarch Reliance has the State of Zhao on his back. And he left the lands of South Heaven! How… how am I supposed to settle that Karma!” After a moment, he smiled bitterly.</p><br/><p>Shaking his head, he sighed, then sent some divine sense into the Immortal Ancient Dao Medallion. Following its guidance, he headed off into the distance.</p><br/><p>Several days later, Meng Hao appeared at the edge of a boundless mountain range in the depths of the Eastern Lands. He then vanished as he entered the mountains. As he proceeded along, he saw no signs of life. He passed many treacherous locations, and faced quite a few dangers.</p><br/><p>As he traveled further into the mountains, the air up above became restricted, and eruptions of black mist would occur frequently. Despite Meng Hao’s incredibly powerful fleshly body, he could still be injured by that black mist, which filled his heart with trepidation after it happened a few times.</p><br/><p>“They don’t seem like restrictive spells,” he thought. “Could it be that somebody buried something here? Whatever they are, they’re incredibly dangerous!” After some careful examination, Meng Hao was certain that there were items buried beneath the ground that would explode if stepped on.</p><br/><p>There were also naturally occurring restrictive spells which, if he got caught in their explosions, would certainly cause his cultivation base to drop.</p><br/><p>Thankfully, the Immortal Ancient Dao Medallion was very effective in avoiding both the restrictive spells and the objects buried underground. Using the medallion’s guidance, he was able to proceed onward for several days with no incident. Finally, he found himself on a narrow path which cut deep through the mountains in such a way that he could only see a sliver of the sky up above. This path also was laced with the buried, explosive objects. Thankfully, by means of the medallion, and utmost caution, he was able to proceed along the path for some time without incident. Three times, eruptions occurred, but in the end, he finally found himself… in front of a run-down old temple.</p><br/><p>-----</p><br/><p><em>This chapter was sponsored by Masaki</em></p><br/>\n</div>"}