{"title": "Chapter 827: Never Too Late for Revenge!", "id": 827, "volume": 9, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-827-never-too-late-for-revenge", "volume_title": "Volume 9", "body": "<h1>Chapter 827: Never Too Late for Revenge!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 827: Never Too Late for Revenge!</strong></p><br/><p>Meng Hao’s voice echoed out through the vast expanse of the sky. He hovered in midair, filled with power that held all under Heaven in contempt. A brilliant light surrounded him, and the Dharma Idol behind him did not look illusory in any way. Furthermore, he emanated pulses of Immortal might!</p><br/><p>That… was a pressure that exceeded that of a false Immortal!</p><br/><p>That… was eighty percent of the power of a true Immortal!</p><br/><p>He hovered cross-legged in midair, looking every bit like an Immortal. His eyes appeared to contain stars, and his voice was awe-inspiring as it echoed through the lands like thunder.</p><br/><p>Wild colors flashed in the sky, and the wind screamed. The cultivators in the surrounding rugged mountains could only watch, their minds filled with roaring. This was especially true of the three whose names Meng Hao had called out. Their minds were filled with panic and shock.</p><br/><p>Fan Dong’er’s face had completely fallen, and she was panting as she stared at Meng Hao. Her heart was in tumult, and her face was a mass of disbelief.</p><br/><p>“True Immortal might! He actually has true Immortal might!”</p><br/><p>Furthest away of the three was Zhao Yifan, who stood on a far off mountain, his face pale. He had suffered severe injuries, and had had no choice but to withdraw from this struggle for good fortune. Now, he gazed silently at Meng Hao hovering in midair, and began to breathe heavily. The desire to fight burned in his eyes, but his pupils constricted, and it was easy to see that inwardly, he was anything but calm.</p><br/><p>The last person who Meng Hao called out was Ji Yin. He sat cross-legged on another mountaintop, looking at Meng Hao, face expressionless but hands clenched tightly at his side.</p><br/><p>The entire mountain range was completely silent except for the sound of Meng Hao’s voice echoing about. Countless Chosen and innumerable Dao Protectors looked on with trembling minds.</p><br/><p>It was in this moment that the restriction on the airspace… suddenly vanished!</p><br/><p>It was as if the restriction on the airspace had been in place only in preparation for good fortune to appear within Meng Hao.</p><br/><p>“I’ll fight you!” someone bellowed. A figure flew out from the mountains, a young man with eyebrows like swords and eyes like stars. It was none other than Wang Mu!</p><br/><p>When he flew out, his fighting spirit burned brightly, and his heart was filled with rage. None of the three names Meng Hao had called out were his, which he took to be a personal humiliation.</p><br/><p>As he flew, he performed a double-handed incantation, calling the wind and summoning the rain. Everything trembled as it all transformed into black dragons that roared as they shot toward Meng Hao.</p><br/><p>Meng Hao looked over coldly at the incoming Wang Mu. As he neared, Meng Hao waved his hand to unleash the Star Plucking Magic!</p><br/><p>Backed by Meng Hao’s eighty-percent true Immortal cultivation base, the Star Plucking Magic caused everything to grow dark as an enormous hand appeared and shot toward Wang Mu.</p><br/><p>Rumbling filled the air, and Wang Mu let out a shout, extended his hand and pointed out with his index finger. An incredible power exploded out that caused the descending, illusory hand to suddenly stop in place.</p><br/><p>Wang Mu chuckled coldly and continued to charge toward Meng Hao. He performed another incantation gesture and then pointed toward Meng Hao. A will of extermination exploded out, turning into a shocking energy that seemed to contain infinite destructive power. [1. We are in a slightly odd situation here because Renegade Immortal precedes ISSTH in terms of when it was written, and yet a lot more of ISSTH has been translated. The following information contains what could be considered some minor spoilers in terms of Renegade Immortal, but I think it's important to impart this information. Any Chinese reader who was a fan of Renegade Immortal and then read ISSTH would probably notice the following points. Both the 10th Wang Clan Patriarch and Wang Mu have now used this ability of “calling the wind and summoning the rain.” If you want to check previous times it was used by the Patriarch, go to chapter 630, 647, and 679. Long story short, Wang Lin, MC of Renegade Immortal, frequently used an ability \"calling the wind and summoning the rain.\" Furthermore, in chapter 645, the 10th Wang Clan Patriarch mentions “three finger attacks” created by the ancestor of the Wang Clan, one of which was the “Extermination Finger.” Not only does that seem to be the same attack Wang Mu is using here, guess what… Wang Lin frequently used a move called “Extermination Finger,” the exact same Chinese characters. Obviously, there was a lot of speculation during these parts of the story by Chinese readers, linking the Wang Clan of this story, with Wang Lin of that story]</p><br/><p>Before that power could even get near, Meng Hao took a step forward, appearing directly in front of Wang Mu, whereupon his hand slapped out with incredible speed. Wang Mu’s face filled with shock as Meng Hao completely ignored his extermination attack, and in fact, allowed it to land on him. At the same time, his slap connected with Wang Mu.</p><br/><p>A boom rang out and Wang Mu gave a muffled grunt. Blood sprayed out of his mouth, and he tumbled backward. A manic look appeared on his face, and he was just about to charge back into the fight when Meng Hao snorted and transformed into a golden roc.</p><br/><p>The golden roc spread its wings, causing golden light to explode out. Then the roc disappeared as it transformed into a golden beam that shot toward Wang Mu. Numerous mountains appeared, which linked together into a mountain range that also slammed down toward Wang Mu.</p><br/><p>Incredible rumbling sounds rose up. Wang Mu roared angrily and struggled with all of his might, but Meng Hao spun toward him like a tornado. Suddenly, a blood colored glow ignited and bashed into Wang Mu’s shoulder.</p><br/><p>A cracking sound rang out as Wang Mu’s right shoulder was shattered. Intense pain filled him, and a cold sweat instantly broke out all over his body. In the blink of an eye, he began to wither up, and yet, he gritted his teeth, clearly not willing to give up the fight.</p><br/><p>“Screw off!” said Meng Hao, punching Wang Mu in the middle of his stomach with eighty percent of the power of a true Immortal. Blood showered out of Wang Mu’s mouth, and his entire body trembled. Meng Hao grabbed Wang Mu’s bag of holding as Wang Mu himself shot like a meteor down to the ground, where he slammed into the earth. He coughed up more blood, and his mind was filled with anxiety. He was completely shocked by the level of Meng Hao’s power.</p><br/><p>All of the surrounding cultivators looking on gasped. The Chosen’s eyes were wide, and the Dao Protectors were watching with serious expressions.</p><br/><p>“He’s almost a true Immortal!!”</p><br/><p>“He got all of the good fortune of the Immortal Ancient Daoist Rite Temple! Dammit!”</p><br/><p>As the onlookers’ expressions flickered, Meng Hao gave a cold snort and then swept his gaze across the crowds until he found the Dao Protectors from Mount Sun and the Li Clan. Killing intent flickered in his eyes as he looked at the two men.</p><br/><p>Their faces fell as Meng Hao extended his right hand, within which was the Lightning Cauldron. Electricity danced as Meng Hao suddenly switched positions with someone standing near the Li Clan Dao Protector. As soon as he appeared, he stamped his right foot viciously onto the ground. A boom rattled out, and the ground was shattered. A blood-colored vortex sprang up, and just as the old man was about to flee, Meng Hao pointed out with his right index finger.</p><br/><p>The Eighth Demon Sealing Hex was unleashed, and the old man’s face fell. He instantly froze in place, and Meng Hao closed in. Meng Hao had an incredible fleshly body, and eighty percent of the power of a true Immortal, all of which he poured into three powerful punches that slammed into the old man in quick succession.</p><br/><p>Blood sprayed from the old man’s mouth, and his face went pale. Roaring, he performed an incantation gesture, causing a divine ability to appear. An enormous magical bottle materialized in midair; it radiated boundless energy that instantly surged to envelop Meng Hao.</p><br/><p>Meng Hao’s Dharma Idol roared, which caused everything in the area to shake. Ripples spread out, and the magical bottle distorted. Even as the old man’s face began to fall, Meng Hao’s Dharma Idol punched out.</p><br/><p>Booms echoed out as Meng Hao and the old man fought back and forth in midair. The Blood Demon Grand Magic appeared, a swirling blood-red vortex that turned into a Blood Demon head that viciously headbutted the old man.</p><br/><p>Blood spurted out of the old man’s mouth, and his body withered rapidly. He fell back, his expression one of astonishment and ferocity. At this point, he prepared to unseal his cultivation base, only to be shocked to find… that he couldn’t!</p><br/><p>“What…?” The old man’s face flickered as Meng Hao once again turned into a huge golden roc. Blinding golden light flickered as he shot toward the old man with indescribable speed. The onlookers only heard a miserable shriek. When the golden light finally faded away, they could see that the old man’s head had completely exploded into pieces.</p><br/><p>Meng Hao took his bag of holding, and before the old man’s Nascent Divinity could escape, had his Dharma Idol grab him and pop him into its mouth.</p><br/><p>An air of ferocity filled the area, and gasps could be heard in all directions. Meng Hao’s body flickered as he next moved toward the Mount Sun Dao Protector. It was time to collect interest from the debts incurred by those who had ambushed him earlier.</p><br/><p>The Mount Sun Dao Protector’s face flickered, and he shot backward, attempting to unseal his cultivation base. Then, his face completely fell when he also realized… that he couldn’t unseal it!</p><br/><p>His scalp went numb and he fled as fast as possible.</p><br/><p>“Fellow Daoists!” he screamed miserably, “join forces with me to kill this bastard!!”</p><br/><p>Immediately, four or five people flew forward, clearly intent on blocking Meng Hao’s path. However, it was at this point that electricity danced, and Meng Hao used Form Displacement Transposition to appear directly in front of the old man from Mount Sun. His expression was cold, and his eyes flickered with killing intent as he raised his right hand. The Blood Demon Grand Magic spun, a massive vortex that instantly enveloped the old Dao Protector.</p><br/><p>Rumbling filled the air, mixed with the old man’s bloodcurdling screams. Meng Hao and the old man were inside the vortex for only a few breaths of time before the four or five interlopers arrived and launched divine abilities. The blood-colored vortex faded, and Meng Hao’s body flickered and reappeared off in the distance. As for the old man from Mount Sun, he was nothing more than a skeleton.</p><br/><p>All of his flesh and blood, his cultivation base and soul, had been absorbed!</p><br/><p>“Kill him!”</p><br/><p>“Join forces to wipe him out!”</p><br/><p>“He’s on the verge of true Immortality! Refine his body and we might be able to concoct a True Immortality Pill!” Seven or eight people flew out, including several Chosen and Dao Protectors. After joining forces with the people who had just attacked, they made a force of more than a dozen that transformed into beams of prismatic light that charged toward Meng Hao.</p><br/><p>Another group of about ten people approached from another direction.</p><br/><p>There were others who looked on with flickering eyes. They had to admit that Meng Hao was powerful, but he was only one person. In their minds, that wasn’t enough to shake all of them together.</p><br/><p>Dozens of people closed in on Meng Hao, who hovered there in midair. Just as they were about to launch their deadly attacks, Meng Hao laughed coldly. The image of his father’s first sword form appeared in his mind as he took a deep breath, bent his body like a bow and raised his right hand.</p><br/><p>In the blink of an eye, he appeared to become like a black hole, sucking in all of the power of Heaven and Earth. Sword qi appeared, and as the people closed in, Meng Hao’s hand suddenly chopped downward.</p><br/><p>An astonishing beam of sword qi exploded out, slashing about in all directions. Rumbling filled the air, and the dozens of attackers shot backward, faces filled with shock. There were even two or three who were directly slashed by the sword qi and then shattered to pieces, leaving behind only bloodcurdling screams.</p><br/><p>Meng Hao used this slight pause to again utilize the Lightning Cauldron, and Form Displacement Transposition to… close in on Fan Dong’er!</p><br/><p>“Fan Dong’er, you wanted to kill me, right? Well, here I am!”</p><br/><p>Fan Dong’er’s face fell. As of this moment, Meng Hao’s power made him virtually invincible. There was no way for anyone to stand in his way. So far, Fan Dong’er had lost an arm and been seriously injured. Although she had recovered some, the process wasn’t complete, and she knew that there was no way she could win against Meng Hao. Her face fell as she retreated backward.</p><br/><p>As soon as she started backing up, Meng Hao became a golden roc that shot toward her with incredible speed. Golden light filled the air, and he was upon her in the blink of an eye.</p><br/><p>From a distance, everyone could see the beautiful Fan Dong’er, her hair in disarray, facing up against a gigantic, golden roc, which extended its claws viciously toward her.</p><br/><p>Many of the surrounding Chosen greatly admired Fan Dong’er, so when they saw what was happening, their faces fell. There were even seven or eight who immediately flew out toward Meng Hao.</p><br/><p>“Meng Hao, you’re pushing things too far!!” cried Fan Dong’er miserably.</p><br/><p>“Who cares!” replied Meng Hao coolly. The golden roc closed in.</p><br/>\n</div>"}