{"title": "Chapter 828: Invincible!", "id": 828, "volume": 9, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-828-invincible", "volume_title": "Volume 9", "body": "<h1>Chapter 828: Invincible!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong></strong></p><br/><p>[/expand]</p><br/><p>Fan Dong’er’s pupils shrank into tiny dots, and she shot backward, simultaneously performing a double-handed incantation. Instantly, a boundless sea appeared behind her, made up of endless heavenly bodies, even suns and moons.</p><br/><p>“Nine Seas God World!” she cried. In response, the huge sea behind her grew exponentially in size. In the blink of an eye, it had covered the entire area. Next, the heavenly bodies inside of it all began to shoot toward Meng Hao.</p><br/><p>At the same time, the eight Chosen closed in on him.</p><br/><p>“Without a face, a single word, flames of war unify!” As Meng Hao transformed into a golden roc and shot forward, he began to change color. He was now bright red. The Blood Demon Grand Magic appeared around him, forming a massive vortex.</p><br/><p>The vortex then turned into a face that emanated shocking, blood-colored ripples that spread out in all directions. The incoming group of Chosen were instantly affected. Then, the face opened its mouth and cried a soundless cry, immediately shaking their minds.</p><br/><p>Instantly, smoke began to seep out from the tops of their heads, rising up as if from the flames of war! Shocking rumbling filled the air.</p><br/><p>Suddenly, their blood began to flow backward, and then their bodies began to fall apart. In the blink of an eye, they were covered with masses of blood and gore. Faces filled with astonishment, they coughed up blood and were forced to retreat.</p><br/><p>“Sundered clouds, a bloody rain, seas that cover the sky!” Meng Hao transformed into a huge, crimson roc that shot toward Fan Dong’er and the Ninth Sea. As they barreled toward each other, sundered clouds appeared up above, and bloody rain fell, which transformed into a sea of blood! Shockingly, two massive seas were now visible in the sky up above.</p><br/><p>One was the Ninth Sea, and the other was a sea of blood. Above the Ninth Sea, Goddess Fan Dong’er glowed with boundless light. In the sea of blood, Meng Hao’s Dharma Idol stood like a shocking giant. The two slammed into each other, and a massive boom echoed out.</p><br/><p>The sky shook, and the land quaked and began to split. Everyone fell back, shocked by what they were seeing.</p><br/><p>As the two seas collided, Meng Hao’s roc form shot directly toward Fan Dong’er and viciously raked out at her with sharp claws.</p><br/><p>Rumble!</p><br/><p>Fan Dong’er performed a double-handed incantation. Nine sea dragons materialized around her and roared as they moved to block Meng Hao. However, sea dragons are not really dragons, only enormous serpents. The golden roc’s vicious claws ripped them to shreds. Their miserable shrieks were still echoing in the air when Meng Hao finally reached Fan Dong’er.</p><br/><p>Sharp claws slashed at her, and blood sprayed from her mouth. She fell back yet again, her hair in disarray. Glaring at Meng Hao, she performed a double-handed incantation that caused the conch shell to appear again. Even as she began to unleash her divine ability, Meng Hao and his Dharma Idol roared, and he rotated his cultivation base to full power.</p><br/><p>Shocking rumbling filled the area, and the sky went dim. The sound from the conch… was unexpectedly suppressed, and began to tremble violently. Fan Dong’er coughed up another mouthful of blood.</p><br/><p>At the same moment in which she began to retreat, Meng Hao’s right hand extended in the Star Plucking Magic.</p><br/><p>Fan Dong’er’s face fell once again, and she waved her hand, causing countless illusory, sensuous mermaids to fill the area. It took only a moment for them to organize into a huge formation that moved to block Meng Hao.</p><br/><p>Meng Hao snorted coldly, and a bright, bloody glow rose up into the air. The Blood Demon Grand Magic was unleashed at full power. In the blink of an eye, a blood-colored vortex appeared, fully three hundred meters wide. However, as Meng Hao surged forward, all that could be seen was a gigantic Blood Demon head that directly headbutted the mermaid spell formation.</p><br/><p>The resulting boom filled the entire mountain range. The spell formation collapsed, and the mermaids withered away. Meng Hao’s Blood Demon head vanished, but he pressed forward, his body shining with bloody light. A fist descended, and a huge boom rattled out. Fan Dong’er retreated again, blood spurting from her mouth, her face filled with astonishment.</p><br/><p>This version of Meng Hao left everyone feeling shocked to the extreme. Meng Hao’s momentum was impossible to stop!</p><br/><p>“Die!” he said, slashing his hand toward Fan Dong’er’s neck. Just when it seemed to be on the verge of making contact, Fan Dong’er let out a miserable shriek. Her body began to twist and distort as she transformed into a blue flood dragon. Her mouth opened wide as she shot forward to swallow up the golden roc.</p><br/><p>There was a boom, and the flood dragon collapsed. Meng Hao’s golden roc also shuddered and vanished, revealed Meng Hao himself.</p><br/><p>Fan Dong’er took advantage of this opportunity to use a secret magic. Her body suddenly experienced a rapid weakening in exchange for a burst of speed that put her far off in the distance. Then she waved her hand, causing the blue bracelet on her wrist to fly out. It shattered in midair, forming a wall of fragments that resembled heavenly bodies. It was as if the two areas she and Meng Hao occupied were now completely separated by a huge divide.</p><br/><p>Fan Dong’er glared at Meng Hao in a way that seemed to suggest she was committing his facial features to memory.</p><br/><p>“We will meet again,” she said through gritted teeth. “Next time, I’m going to kill you!” She performed a double-handed incantation, after which, rumbling could be heard as a huge door began to coalesce behind her.</p><br/><p>That door lead directly to the Nine Seas God World!</p><br/><p>Killing intent flickered in Meng Hao’s eyes, and he was just about to tear apart the divide composed of heavenly bodies when the seven or eight Chosen who worshipped Fan Dong’er moved to block his way.</p><br/><p>They shot forward with incredible speed, immediately unleashing divine abilities. The images of a true dragon and a flaming phoenix appeared, as well as a vicious golden tiger. One of the Chosen waved his hand to produce 1-meter-long giant ants; more than a thousand of them filled the sky as they moved to block Meng Hao.</p><br/><p>“There’s not going to be a next time!” said Meng Hao, snorting coldly. He closed his eyes and took a deep breath. Behind him, his Dharma Idol began to shrink down in size and then superimposed itself over his body.</p><br/><p>In that instant, the Immortal qi inside of him suddenly exploded out. In that instant, he was the Dharma Idol, and the Dharma Idol was him!</p><br/><p>The eight people closing in on him were instantly shaken inwardly. An intense sense of deadly crisis filled their hearts, and they were suddenly overwhelmed with the sensation that Meng Hao was too dangerous to even get close to.</p><br/><p>As their faces fell, Meng Hao began to stride forward. The air vibrated, and the two Chosen nearest Meng Hao fell back in astonishment, blood spraying from their mouths. He didn’t even attack them. The mere rise in his energy injured them, causing their terror toward him to climb even higher.</p><br/><p>All of these people gasped and looked at Meng Hao in shock. Their bodies stopped in place, and they didn’t dare to move forward even an inch. Everyone in the area was now beginning to back up, fully aware of how powerful Meng Hao was.</p><br/><p>Even Fan Dong’er’s face completely fell.</p><br/><p>Meng Hao took his first step forward, and the illusory Immortal meridian inside of him rotated and began to emanate scintillating light that swirled around Meng Hao. His second step took him through the air and completely into the divide. His body trembled a bit as he passed into it, and yet, he was able to take a third step!</p><br/><p>At that moment, countless gasps could be heard from the surrounding cultivators.</p><br/><p>“He fused with his Dharma Idol! That’s something only people in the Immortal Realm can do! He’s not in the Immortal Realm, though he’s immeasurably close to it, and yet he can still successfully fuse with it!”</p><br/><p>“Is he really a cultivator from the lands of South Heaven…?”</p><br/><p>“This Meng Hao is just too powerful! If he doesn’t perish in this battle, then he’ll become completely famous in the Ninth Mountain!”</p><br/><p>All of the exclamations came when Meng Hao took his third step. When that step fell, the divide began to vibrate; clearly he was just about to emerge from within it.</p><br/><p>By this point, the huge door behind Fan Dong’er was now fully visible. The door began to open, and Fan Dong’er let out a quiet sigh. She gave Meng Hao one final cold glance, and then turned to enter the huge door.</p><br/><p>“Inky!” Meng Hao suddenly said.</p><br/><p>As soon as his voice rang out from the divide, the listless eyes of the corpse that followed Fan Dong’er suddenly flickered. Long strands of black hair floated out and began to wrap around her.</p><br/><p>Fan Dong’er’s face filled with panic and shock, and she nearly coughed up a mouthful of blood. Just when she was about to step into the door, rumbling filled the air. Meng Hao had taken his fourth step, and emerged from within the divide. In that instant, his Immortal qi was in full circulation, and he stretched his hand out in a claw-like gesture toward Fan Dong’er, who screamed shrilly.</p><br/><p>Fan Dong’er was already halfway through the invisible door, and just about to vanish. Meng Hao frowned. He could sense an incredible feeling of peril from beyond the door, and yet didn’t hesitate. He unleashed the Star Plucking Magic, and a gigantic, illusory hand appeared. Just in the moment when Fan Dong’er was about to disappear…. the giant hand grabbed her by the hair.</p><br/><p>The hand yanked back viciously. In that moment, a muffled grunt could be heard from Fan Dong’er. She vanished, and the illusory door disappeared amidst a rumbling boom. Meng Hao was left with only a handful of hair, the roots dripping with blood, which caused his expression to darken.</p><br/><p>Meng Hao looked at the hair for a moment and then thought back to one of the magical techniques he had learned in the ancient Demon Immortal Sect. It was a cursing magic, which he immediately unleashed, causing the hair in his hand to burn with green flames. Then, he blew out the flames and performed an incantation, which resulted in a single black hair materializing in front of him. He quickly put the strand of hair away. He now had a powerful weapon to use next time he encountered Fan Dong’er.</p><br/><p>Everything was silent. All eyes were on Meng Hao, and no one was speaking. As far as the Chosen were concerned, Meng Hao was incredibly intimidating. Furthermore, because the Dao Protectors were unable to loosen the seals on their cultivation bases… they were no match for him either.</p><br/><p>The shock was especially intense among the people who had fought with Meng Hao before. All of them began to edge back, hearts filled with astonishment. Meng Hao’s gaze swept across the crowd until they finally came to rest on Ji Yin, who was still sitting cross-legged on the distant mountain peak.</p><br/><p>From start to finish, Ji Yin hadn’t moved from that mountain, and had watched Meng Hao achieve eighty percent of the power of a true Immortal, as well as his apparent invincibility.</p><br/><p>“Ji Yin, you took something that belongs to me,” Meng Hao said calmly. “Are you really sure you want to sow Karma between us?”</p><br/><p>“You also took something that belongs me,” Ji Yin replied slowly, looking over at Meng Hao.</p><br/><p>Meng Hao’s eyes flickered with coldness as he transformed into a roc that surged with Immortal qi. He flew into the air and shot directly toward Ji Yin.</p><br/><p>He moved with incredible speed, surrounded by a glow of blood. This was not a golden roc, this was a crimson roc!</p><br/><p>“Taking care of you will be simple!” said Meng Hao as he closed in. The words were simple, but they contained a profoundly domineering air. Anyone who heard them felt shock in their hearts.</p><br/><p>It must be said that although Ji Yin had met defeat when struggling to become Dao Child of the Ji Clan, he was still a Ji Clan Chosen!</p><br/><p>And the Ji Clan… ruled the Ninth Mountain!</p><br/><p>“Laughable!” said Ji Yin coolly.</p><br/><p><strong>Chapter 828: Invincible!</strong></p><br/>\n</div>"}