{"title": "Chapter 832: Everyone Is Released", "id": 832, "volume": 9, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-832-everyone-is-released", "volume_title": "Volume 9", "body": "<h1>Chapter 832: Everyone Is Released</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong></strong></p><br/><p>[/expand]</p><br/><p>“What incredible gall!” said the old man next to Fang Xiangshan. He snorted coldly and glared at Meng Hao. Clearly… he hadn’t yet picked up on any of the clues. By this time, however, of the more than ten people behind Fang Xiufeng, most had realized that the mood in the area… was off.</p><br/><p>From the way Fang Xiufeng and Meng Hao talked to each other, it didn’t seem that they were strangers. In fact, it was more like the way a father and son would talked to each other.</p><br/><p>Light gasps could be heard. By following such a path of reasoning, they quickly called to mind the reason that Fang Xiufeng and Meng Li had come to Planet South Heaven in the first place. Then, they looked at Meng Hao again, but in a different way than they had before.</p><br/><p>“Stop stalling! Release them all!” said Fang Xiufeng. Inwardly, he was chuckling wryly, but also felt a touch of pride. After all, Meng Hao had accomplished something that few others could.</p><br/><p>With a long face and somewhat of a pout, Meng Hao released Fang Yunyi and Song Luodan. They appeared, looking distressingly haggard. Fang Yunyi’s injuries seemed especially serious, and he coughed up some blood and then immediately fainted. The old man standing next to Fang Xiangshan immediately stepped forward to catch him, then looked back at Meng Hao, killing intent swirling in his eyes.</p><br/><p>Song Luodan was taciturn as he walked off. He turned his head and gave a meaningful glare at Meng Hao, but didn’t say anything. When he reached the powerful expert from the Song Clan, he stood there with his eyes closed. It was impossible to tell what he was thinking.</p><br/><p>“Any more?” asked Fang Xiufeng.</p><br/><p>“Uh… a few,” Meng Hao replied. He reluctantly released three more people from his bag of holding. These were three other Chosen he had captured in the past few days. As soon as they were released, they turned to look at Meng Hao with fury burning in their eyes, as well as the desire to kill.</p><br/><p>When they saw that three additional Chosen had been tucked away in Meng Hao’s bag of holding, everyone gaped, even Fang Xiufeng and Meng Li. No one could have imagined that Meng Hao would be able to snatch up so many people. This was especially true of the powerful experts from the outside sects and clans.</p><br/><p>They stared blankly at the people emerging from Meng Hao’s bag of holding, and couldn’t help but think that Meng Hao… truly was terrifying.</p><br/><p>“Alright, that’s it,” Meng Hao said, spreading his hands wide and looking calmly at the powerful experts standing behind his father and mother.</p><br/><p>In response to his words, the powerful experts from the Ji and Li clans glared back with wide eyes. Fang Xiufeng let out a cold snort.</p><br/><p>“What about the Chosen from the Ji Clan, and Li Ling’er!”</p><br/><p>Meng Hao suddenly looked a bit startled.</p><br/><p>“Li Ling’er? Who? Uh, I don’t know her. Ji Clan Chosen? I never saw any Ji Clan Chosen!” As Meng Hao rambled on, Fang Xiufeng looked back at him with a deadpan expression, and finally sighed.</p><br/><p>“I need to get off of Planet South Heaven,” Meng Hao thought to himself. “It so boring being held back here.” Finally, he decided to pull Ji Yin out of his bag of holding.</p><br/><p>As soon as Ji Yin emerged, a thick mist appeared around her body, concealing her completely. Finally she looked back at Meng Hao, a profound expression on her face. Then she turned and began to walk over to the powerful expert from the Ji Clan.</p><br/><p>“Don’t forget that you owe me a promissory note!” blurted Meng Hao. He had long since recovered his second true self, and had also cleaned out Ji Yin’s bag of holding.</p><br/><p>Ji Yin’s pace faltered briefly, as if she was having to exert intense control over herself. After a long moment passed, she gritted her teeth and continued walking.</p><br/><p>“Okay, that was really the last one!” said Meng Hao resolutely.</p><br/><p>The more than ten people behind Fang Xiufeng stood there silently. If there were any of them who hadn’t yet figured out what was going on by now, then they didn’t deserve to have practiced cultivation to the level that they had. The expert from the Li Clan sighed, and apparently felt a headache coming on. In the agreement between the Li Clan and the Fang Clan all those years ago, Li Ling’er was supposed to be engaged to Fang Xiufeng’s crippled son.</p><br/><p>From the look of things, she could tell… that the crippled son from all those years ago was actually none other than the Meng Hao they were facing right now.</p><br/><p>The Li Clan expert sighed and looked at Fang Xiufeng. “Elder Brother Fang… look….”</p><br/><p>Fang Xiufeng smiled wryly then turned to glare at Meng Hao.</p><br/><p>“Release her!”</p><br/><p>Meng Hao set his jaw, took a step forward and glared at Fang Xiufeng. “She’s supposed to be a maidservant for mom!”</p><br/><p>His wording was quite barbaric, but it actually softened Fang Xiufeng’s heart. He knew that from the time Meng Hao was very young, he and Meng Li had been unable to be there for him, and he would surely react negatively to being restrained and instructed.</p><br/><p>Meng Li covered her smile with her hand, then took a few steps forward and looked at her son. Her tone gentle, she said, “Take her out and let me see.”</p><br/><p>Meng Hao slapped his bag of holding, and Li Ling’er flew out, her hair a mess and her lips still smeared with blood. Her buttocks were still slightly uneven and still had a deep impression of a handprint on them, and her face was pale. She appeared to be in such pain that she was on the verge of passing out.</p><br/><p>As soon as she appeared, a vicious look gleamed in her eyes, and she spun toward Meng Hao. Her hands twisted into claws that slashed toward Meng Hao’s face. Meng Hao glared at her and extended his right hand.</p><br/><p>Li Ling’er’s heart trembled, and she instantly fell back, glaring angrily at Meng Hao.</p><br/><p>“Someone as savage as you isn’t suitable to be my mom’s maidservant. BEAT IT!” Meng Hao waved his hand dismissively. He was in a foul mood now considering how much he had just lost out on.</p><br/><p>“Meng Hao!” screeched Li Ling’er, so furious that she trembled. She was just about to charge forward and attack again when the Li Clan expert held out a hand to block her way. She pulled her off to the side and transmitted a few words to her. Li Ling’ers eyes went wide, and she stared at Meng Hao, then looked over at Fang Xiufeng and Meng Li. Suddenly, her face went completely ashen, as if her entire world had gone dark.</p><br/><p>“Impossible….” she murmured, almost as if she had been possessed. “It’s impossible….”</p><br/><p>“Hmph. Fine, that’s everybody,” said Meng Hao. “If there’s nothing else then I’ll be leaving now.” He swished his sleeve and was about to leave when the old man from the Fang Clan, who still hadn’t picked up on what was going on, suddenly laughed coldly.</p><br/><p>“You want to leave? Hand over your bag of holding, then get on your knees and beg for mercy!” His body flashed as he shot toward Meng Hao. As for the two old women, they hesitated for a moment. Something seemed off to them, but in the end, they gritted their teeth and charged toward Meng Hao.</p><br/><p>Fang Xiangshan had not practiced cultivation for a very long time, but even she could tell that something was off, although she wasn’t quite sure what.</p><br/><p>Seeing the three people closing in on him, Meng Hao’s face immediately darkened.</p><br/><p>“Who the hell do you people think you are!?” His right hand clenched into a fist and he immediately punched out. A boom rang out as the three old Dao Protectors’ bodies were shaken. They fell back, and were just about to unseal their cultivation bases when….</p><br/><p>Suddenly, another cold snort echoed out, and Fang Xiufeng’s voice reverberated through the air.</p><br/><p>“WHO THE HELL DO YOU PEOPLE THINK YOU ARE!?” An icy light flickered out from his eyes. It was nothing more than a gaze, but it caused the three old Dao Protectors to tumble backward and cough up mouthful after mouthful of blood. Rumbling filled their bodies as numerous sword wounds appeared on them; they appeared to be on the verge of being sliced to pieces.</p><br/><p>The three old Dao Protectors’ faces fell as ninety percent of their cultivation bases were slashed away. Blood spurted about everywhere, and they were very nearly killed.</p><br/><p>“Your excellency Fang….”</p><br/><p>Off to the side, Fang Xiangshan gaped. “Clan uncle….”</p><br/><p>“Ladies and gentlemen, Fellow Daoists,” said Fang Xiufeng, a slight smile on his lips. “I still haven’t been able to make the proper introductions. This… is my young son.” When his voice echoed out into the ears of the powerful experts, they began to smile wryly. Earlier, they had for the most part figured things, so to hear Fang Xiufeng personally speak the words came as no surprise.</p><br/><p>However, Ji Yin and all the others looked over at Meng Hao in complete shock. Li Ling’er was trembling, and her expression was blank. However, the most terrified of them all wasn’t her, but Sun Hai. He watched blankly as the scene played out, and thought back to everything he had said earlier. Immediately, a gloomy expression could be seen on his face, as if his whole world had gone dark.</p><br/><p>By this point, Fang Yunyi had regained consciousness. He and Fang Xiangshan stood there with minds abuzz and hearts filled with explosive thunder. The old man and the two old women gasped in disbelief.</p><br/><p>They thought about all the threatening things they had said to Meng Hao… how they had tried to use a son’s own father to threaten him. Then… they began to shake in their boots.</p><br/><p>“I unsealed the Immortal Ancient Daoist Rite Temple on South Heaven to provide my young son with a training ground. From a young age, he has lived a rough, unrestrained life. For the sake of my face, I hope all of you Fellow Daoists will not be too offended by any of his faux pas.” Laughing, Fang Xiufeng clasped hands to all the surrounding cultivators.</p><br/><p>The more than ten powerful experts chuckled wryly and shook their heads. They then exchanged some polite words with Fang Xiufeng and Meng Li, at the same time glancing over at Meng Hao occasionally. As for the bags of holding he had snatched, and all the other things that had occurred in the Immortal Ancient Daoist Rite Temple, it was a bit inappropriate to bring them up anymore.</p><br/><p>“Since all of you are here,” said Fang Xiufeng, “don’t be in a hurry to leave. Please, come back with me to my clan headquarters and allow me to entertain you.” The more than ten experts laughed to themselves. The matters of the junior generation were things they could afford to ignore. Therefore, they laughed and chatted as they followed Fang Xiufeng to the Fang Clan.</p><br/><p>As for Song Luodan and all the other Chosen, they hated Meng Hao just as much as before, and he them. They did nothing to conceal this fact, and neither did Meng Hao. He glared back at them hatefully, then pulled out a thick stack of promissory notes, which he then began to leaf through. Song Luodan and the others had no choice but to grit their teeth and turn to follow the members of the senior generation.</p><br/><p>Meng Hao decided not to go back home to the Fang Clan, nor did Fang Xiufeng attempt to force him to. Meng Hao’s mother straightened his garments and then pinched his nose. Then, in much the manner one would speak to a young child, she warned him not to get into any trouble. Finally, she turned and left.</p><br/><p>Fang Yunyi and Fang Xiangshan were scared witless, and were just about to follow their seniors when Meng Hao stepped forward and blocked their way.</p><br/><p>“C-cousin….” Fang Xiangshan stammered.</p><br/><p>Fang Yunyi snorted coldly and looked away, refusing to speak.</p><br/><p>Meng Hao glared at him, then suddenly reached out and smacked him across the side of the face. Blood sprayed from Fang Yunyi’s mouth, and he was sent tumbling onto the ground. His Dao Protector stood off to the side, head bowed, smiling bitterly, pretending like he didn’t see what was happening.</p><br/><p>“You!” said Fang Yunyi, looking up at Meng Hao. However, in the instant that the word was out of his mouth, Meng Hao’s foot slammed down onto the sprawling Fang Yunyi.</p><br/><p>“You refuse to address me as Cousin when you see me!? What kind of upbringing did you have!” Meng Hao viciously kicked him a few more times, and Fang Yunyi screamed. His head was now covered with blood, causing Fang Xiangshan to be frozen in fear as she looked on. Meng Hao’s viciousness now caused her to remember some scenes from when she was young. If she recalled correctly, she had actually been bullied by this older cousin of hers on a few occasions.</p><br/><p>“AAAHHHHH! I’m gonna kill you!” roared Fang Yunyi.</p><br/><p>Meng Hao’s eyes glittered coldly, and he punched out again, landing a blow directly onto Fang Yunyi’s mouth, shattering his teeth and making it impossible for him to speak. Blood spurted out.</p><br/><p>By now, Fang Xiangshan was trembling violently. The old man and the two old women were staring in shock, and yet didn’t dare to interfere.</p><br/><p>Fang Yunyi was being beaten senseless. His body was wracked with pain, and he was on the verge of losing consciousness. Memories from his childhood floated up, and he vaguely remembered being beaten up by a certain brother and sister team.</p><br/><p>Miserable shrieks rang out as Meng Hao kicked him again. It seemed that if Fang Yunyi didn’t speak up and say the right words, he would be trampled to death.</p><br/><p>Filled with fear, Fang Yunyi spit out a mouthful of blood and then blurted, “C-cousin!”</p><br/><p>Meng Hao’s foot stopped in midair above Fang Yunyi’s face. He slowly pulled his foot back, and then a bashful smile appeared on his face.</p><br/><p>“Little bro, welcome to Planet South Heaven.”</p><br/><p><strong>Chapter 832: Everyone Is Released</strong></p><br/>\n</div>"}