{"title": "Chapter 831: The Grownups Arrive.", "id": 831, "volume": 9, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-831-the-grownups-arrive", "volume_title": "Volume 9", "body": "<h1>Chapter 831: The Grownups Arrive.</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 831: The Grownups Arrive….</strong></p><br/><p>All of the cultivators of the Eastern Lands could see the enormous rift up in the sky, including Meng Hao, who was currently in hot pursuit of Fang Xiangshan. Suddenly, his heart began to thump, and he actually began to feel a bit guilty.</p><br/><p>However, his eyes quickly grew calm and unperturbed, and he continued his pursuit.</p><br/><p>Fang Xiangshan was up ahead. The old Dao Protector continued to grasp her by the arm as he unleashed the fastest speed he was capable of. He even used secret magical arts and blood evasion techniques. Because this was already near the border region of the mountain range, before long they were able to charge out from within the mountains. They transformed into prismatic beams and shot toward the Fang Clan’s fortress in the Great Tang of the Eastern Lands.</p><br/><p>At the same time, the two old women were anxiously pursuing Meng Hao, their hearts filled with venomous hatred.</p><br/><p>“Once we find your clan uncle, all of this will be resolved,” the old man said, “and that Meng Hao will be dead for sure!” Fang Xiangshan bit her lower lip and nodded. She was inwardly alarmed, but was also certain that, based on her status in the Fang Clan, the clan uncle would definitely resolve the crisis. Furthermore, he would most certainly make Meng Hao pay the price for what he had done.</p><br/><p>She believed this, the old man believed it, and the two venomous old women behind Meng Hao also believed it.</p><br/><p>“My clan uncle is stationed here on Planet South Heaven, so if anyone dares to harm the interests of the Fang clan, he’ll definitely do something to stop it!”</p><br/><p>“Your clan uncle might have imposed restrictions on the people entering Planet South Heaven, but he’s still a member of the Fang Clan. This Meng Hao is malicious to the extreme, so he’ll definitely be killed!”</p><br/><p>“All we have to do is lay eyes on the clan uncle, and Meng Hao will be dead! No matter how deep the resources of Meng Hao’s sect here on South Heaven are, nothing will be able to save him!”</p><br/><p>There were two people up front, Meng Hao in the middle, and two old women following from behind. Five people whistled through the air, eventually charging out of the mountain range. It was at this point that Meng Hao extended his right hand and made a grasping motion. Rumbling filled the air as he snatched at the old man flying next to Fang Xiangshan. The old man’s body trembled, and he coughed up a mouthful of blood as he evaded Meng Hao’s attack. A rancorous look filled his face as he began to speed away once again.</p><br/><p>The two old women behind Meng Hao anxiously sent forth attacks, filling the air with rumbling sounds.</p><br/><p>“Don’t push things too far, Meng Hao! This might be Planet South Heaven, but even so, this area is the Fang Clan’s jurisdiction!”</p><br/><p>“You’re going to die today!”</p><br/><p>Meng Hao gave a cold harrumph, and prepared to attack again. He had no intention of killing anyone, of course; he just wanted to rummage through Fang Xiangshan’s bag of holding. However, it was at this point that over a dozen beams of light approached from off in the distance, moving with indescribable speed.</p><br/><p>In the lead were Fang Xiufeng and Meng Li. Behind them were the more than ten powerful experts from various outside sects and clans.</p><br/><p>When Fang Xiufeng and Meng Li caught sight of Meng Hao, Fang Xiufeng glared at him. As for Meng Hao’s mother, she seemed to have a somber expression on the surface, but a smile could be seen in her eyes.</p><br/><p>When Meng Hao saw them, the guilt he felt grew. As for the old man next to Fang Xiangshan, when he saw the approaching newcomers, his face lit up with joy.</p><br/><p>The two old women very nearly started laughing.</p><br/><p>“Clan uncle, save me!” cried Fang Xiangshan. The old man couldn’t contain his excitement, and quickly clasped hands in greeting to Fang Xiufeng.</p><br/><p>“Greetings, your excellency Fang!”</p><br/><p>The two old women immediately stopped in place, joy bubbling up in their hearts. They quickly circled out to seal Meng Hao’s paths of retreat. Their faces flickered with killing intent; to them, Meng Hao was already as good as dead.</p><br/><p>After this, they clasped hands and bowed to Fang Xiufeng and Meng Li.</p><br/><p>“Greetings, your excellency Fang!”</p><br/><p>Meng Hao slowed down and came to a stop, after which he stood there rubbing his nose.</p><br/><p>In the blink of an eye, Fang Xiufeng and Meng Li were already descending through midair. Behind them, the more than ten powerful experts could be seen, blurry and unclear, but radiating intense power and pressure that caused even the sky to grow dim.</p><br/><p>As soon as their gazes fell onto Meng Hao, it was as if multiple mountains were crushing down around him, sealing him in place completely.</p><br/><p>“Clan uncle, it’s me, Shan’er!” cried Fang Xiangshan excitedly. “Clan uncle, please back me up here!” Now that she had caught sight of her two relatives, she found it impossible to hold back from giving vent to the humiliations she had just endured.</p><br/><p>It was at this point that the old man and the two old women glanced over at Meng Hao. Looking pleased, and eyes brimming with hatred, they began to talk as if they were speaking of a dead person.</p><br/><p>“Your excellency Fang, this is Meng Hao. He has a sinister and vicious heart, and is unmatchably shameless! He even used despicable methods to capture Yunyi!”</p><br/><p>“You can’t leave this guy alive! Not only did he capture Yunyi, he also humiliated Goddess Fan Dong’er from the Nine Seas God World! Plus, he captured Chosen from the other sects and clans! He’s contemptible to the maximum!”</p><br/><p>“Yeah, that’s right! Even more excessive was that he used disgraceful tactics to steal all the good fortune of the Immortal Ancient Daoist Rite Temple for himself! The thought of it makes your hair stand up in anger!”</p><br/><p>“This guy is rotten to the core! Not only did he plant landmines outside of the Daoist rite temple, which caused injury to everyone, but after that, he posed as a Dao Protector outside the Immortal Ancient Daoist Rite Temple! He even called himself the groundskeeper!”</p><br/><p>“He has absolutely, positively no sense of shame! He occupied the entire Immortal Ancient Daoist Rite Temple by himself, and didn’t let anyone else inside, and then, used disgraceful techniques to extort and rob the rest of us! There were many fellow cultivators who were injured by him!”</p><br/><p>Tears were now streaming down Fang Xiangshan’s face as she looked over at Fang Xiufeng and Meng Li and bowed continuously.</p><br/><p>“Uncle, aunt. This guy chased me down and was trying to kill me! If I hadn’t run into the two of you, Shan’er would definitely have been buried in this place, and I would never have been able to see you again.” Fang Xiangshan was not a direct bloodline descendant of the Fang Clan, so she could only use an informal version of the address “uncle.” If she were a direct bloodline descendant, then she would have called him “Uncle Fang Xiufeng,” and used a more formal version of the word “Uncle.” After all, when it came to the direct bloodline of the Fang Clan, Fang Xiufeng counted as the eldest son, and Meng Hao as the eldest grandson.</p><br/><p>When Fang Xiufeng and Meng Li heard the words being spoken, their faces darkened. Meng Hao felt even more guilty, and a bashful, seemingly apologetic, smile appeared on his face.</p><br/><p>The ten or more people behind Fang Xiufeng then began to laugh coldly as they looked at Meng Hao.</p><br/><p>“So, you’re Meng Hao of the junior generation!”</p><br/><p>“How daring, Meng Hao. You still haven’t released the Chosen of our Mount Sun? You’ll be coming back to Mount Sun with me to atone for your crime!”</p><br/><p>“You have Chosen Ling’er of the Li Clan. To pay for this crime, you must immediately drop to your knees, cripple your cultivate base, and dig out your eyes!”</p><br/><p>“Song Luodan is a Chosen of the Song Clan! He is honest and upright, and has an extraordinary cultivation base. What underhanded tricks did you use to capture him!?”</p><br/><p>“You have Sun Hai and still haven’t let him go? You’re obviously young and ignorant, so I’ll take your father and mother’s place to offer you some discipline!”</p><br/><p>If Fang Xiufeng and Meng Li weren’t here, any one of this group of people could have cut Meng Hao down where he stood. Instead, they just spoke cold words that made everything feel as frigid as ice.</p><br/><p>Fang Xiufeng and Meng Li’s faces were equally icy.</p><br/><p>When Fang Xiangshan saw all of the people standing behind Fang Xiufeng, her heart swelled with joy, and she instantly gave Meng Hao a spiteful look and said, “Uncle, aunt, this guy even has the Immortal Ancient Daoist Medallion!”</p><br/><p>“Ladies and gentlemen,” said the old man from the Fang Clan. “Your excellency Fang. This young man not only has the Immortal Ancient Daoist Medallion, he also has a bronze lamp. That lamp gives him eighty percent of the power of a true Immortal!”</p><br/><p>When the other people heard this, they stared at Meng Hao, who lowered his head with a bashful smile, like a little child who had just been caught with his hand in the cookie jar.</p><br/><p>Fang Xiufeng turned his head to look at Meng Hao.</p><br/><p>“Is what they said true!?” he said.</p><br/><p>Meng Hao blinked for a moment, then quietly said, “It’s not as incredible as they make it sound…. I didn’t do it on purpose!”</p><br/><p>Fang Xiangshan and the others didn’t notice anything unusual about the way Fang Xiufeng and Meng Hao were speaking to each other. However, among the group of ten or more powerful experts, there were a few who felt their hearts quiver. All of a sudden, something didn’t seem right.</p><br/><p>Fang Xiufeng gave a cold snort and flicked his sleeve. Immediately, the pressure weighing down on Meng Hao vanished. Although the motion appeared casual, when the onlookers saw it happen, their hearts were shaken.</p><br/><p>The expert from the Church of the Emperor Immortal narrowed his eyes. “It almost seems… like there’s some fishy connection between Fang Xiufeng and this kid….”</p><br/><p>The representative from the Ji Clan looked over at Meng Hao, eyes glittering, then looked back thoughtfully at Fang Xiufeng.</p><br/><p>Fang Xiufeng frowned and looked at Meng Hao, a serious look in his eyes.</p><br/><p>“Why haven’t you let those people go already?” he asked.</p><br/><p>Meng Hao cleared his throat. He looked hesitantly at his mother, then back at his father, who was obviously putting on a forced and phony demeanor. Finally, he sighed and patted his bag of holding.</p><br/><p>Sun Hai came out first.</p><br/><p>His clothes were in ribbons, and his expression haggard. However, as soon as he appeared, he immediately clasped hands to Meng Hao and fawningly said, “Elder Brother Meng, Li'l Hai pays his respects, sir….” He was about to continue when he suddenly noticed everyone else in the area. He gasped, and then began to tremble excitedly.</p><br/><p>The expert from the Church of the Emperor Immortal had an unsightly expression on his face. He shot a ruthless look in Sun Hai’s direction, clearly displeased with the face-losing words he had just uttered.</p><br/><p>Sun Hai’s heart trembled, and yet, he couldn’t hold back his excitement. Tears immediately began to flow down his face.</p><br/><p>“Uncle!” he cried out loudly, using the respectful form of address. “Save me, Uncle! He forced me to do it! You have no idea how brutal this shameless bastard is! He took my bag of holding and stole all of my belongings, then he forced me to write a promissory note!</p><br/><p>“I didn’t want to, but he dragged me around by the hair and did everything he could to hurt me. Look, I don’t even have any clothes any more, just rags. He forced me to do everything!” From the tone of Sun Hai’s words as they echoed out, everyone could sense what a miserable and terrible experience he had gone through.</p><br/><p>Meng Hao stared coldly at Sun Hai, his eyes wide. He said nothing.</p><br/><p>“Hey, what are you looking at, you little punk!?” cried Sun Hai, his eyes widening threateningly. “You’re dead!” However, at the same time, he backed up quickly to stand next to his Uncle. Once he was there, he heaved a sigh of relief as he stared at Meng Hao.</p><br/><p>Fang Xiufeng watched all of this with wide eyes and slack jaw. Meng Li blinked a few times, and looked over a Meng Hao, a grin in her eyes.</p><br/><p>“Release the other ones, too,” said Fang Xiufeng. He looked like he might be getting a headache.</p><br/><p>“Oh, right.” replied Meng Hao, then slapped his bag of holding to produce Taiyang Zi.</p><br/><p>Taiyang Zi looked miserable; his hair was disheveled, and he looked completely tattered. His eyes even looked blank, and he stood there in a daze for a moment before beginning to tremble with excitement.</p><br/><p>“Master Uncle….” he said, his voice quavering with emotion from finally being able to see the light of day, as if he suddenly had seen a gleam of hope in his life again. Then, he sped over to stand next to the powerful expert from Mount Sun. Finally, he turned to look hatefully at Meng Hao.</p><br/><p>“Meng Hao, I hope that you DON’T die here today! That way, one day I’ll have the chance to slaughter you myself! I hereby swear that I will help you to understand what it means to live a life worse than death!”</p><br/><p>Meng Hao glared back viciously at Taiyang Zi.</p><br/><p>“I dare you to say one more word!” said Meng Hao, his eyes burning with murderous intent. Taiyang Zi was just about to open his mouth when he saw the look in Meng Hao’s eyes, and suddenly, his heart began to tremble, and he didn’t dare to speak another word.</p><br/>\n</div>"}