{"title": "Chapter 847: Talent. Cultivation. Age.", "id": 847, "volume": 9, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-847-talent-cultivation-age", "volume_title": "Volume 9", "body": "<h1>Chapter 847: Talent. Cultivation. Age.</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 847: Talent. Cultivation. Age.</strong></p><br/><p>Crowds in locations all over the Ninth Mountain and Sea were watching the events on the vortex screens. However, regardless of location, the eyes of every spectator suddenly went wide with disbelief.</p><br/><p>On the Ancient Road of Dao Seeking, Fang Mu’s name had previously had no number next to it. In the blink of an eye, there was suddenly a number: 1,006!</p><br/><p>The number appeared so quickly, so suddenly, that people didn’t even have a chance to register it mentally before both the number, and Fang Mu’s name, disappeared.</p><br/><p>The light that covered the altar upon which Meng Hao stood slowly faded away, to reveal Meng Hao, sitting there cross-legged.</p><br/><p>He was the first person…</p><br/><p>To pass the stage!!</p><br/><p>“That’s… that’s impossible!!”</p><br/><p>“What just happened? I remember that just now, Fang Mu didn’t have any numbers next to his name at all. That means he hadn’t even killed a single enemy. Then I blinked my eyes, and he passed the stage?”</p><br/><p>“A bunch of numbers appeared just now, and then they vanished, and Fang Mu passed the stage. Is it possible… is it possible that he used only one move to kill all of the enemies!?!?”</p><br/><p>“Heavens! He got first place in the second stage too! Hardly any time has passed, not even a hundred breaths!!”</p><br/><p>“He got first place in the first stage, and now first place in the second stage!!” Everyone out in the Ninth Mountain and Sea was completely shocked. Cries of astonishment rang out in all of the locations where people were watching, and the buzz of conversation immediately rose up.</p><br/><p>In the vast Eastern Lands, Fang Xiufeng and Meng Li were gaping at the scene. Even they weren’t too sure exactly what Meng Hao had done.</p><br/><p>Pill Demon and Chu Yuyan were also looking on with wide eyes, staring dumbly at Meng Hao on the screen.</p><br/><p>The crowds out in the Ninth Mountain and Sea were in an uproar.</p><br/><p>“That Fang Mu, he’s definitely the star of this whole trial by fire!”</p><br/><p>“How powerful is he exactly? He actually… he actually killed all of the enemies with one move!”</p><br/><p>“I want to see how exactly he did it. It must have been breathtaking!!”</p><br/><p>Meanwhile, not too far away from Planet East Victory, an enormous turtle floated in the starry sky, carrying an entire continent on its back. He was staring in shock at the three vortex screens down below on East Victory.</p><br/><p>“Dammit. It must be him! Even if he transformed into dust, the Patriarch would still recognize that little bastard!!</p><br/><p>“But… what exactly did he do? He got first place in the blink of an eye!” This gargantuan turtle was of course none other than Patriarch Reliance.</p><br/><p>At the same time, in another location in the starry sky, a figure could be seen sitting cross-legged on an asteroid, hair disheveled as he looked up at three vortex screens. His expression was taciturn, but a brilliant light glittered in his eyes.</p><br/><p>“How could I have imagined that I wouldn’t die…. Meng Hao, Planet South Heaven was only the first half of my life. I have to thank you for helping me understand so much. In the remaining years, I will definitely find a way to pay you back.”</p><br/><p>Even as everyone in the Ninth Mountain and Sea was shaken, back in the palace among the stars, silence reigned. The Patriarchs of the various sects and clans, even the representatives from the Three Great Daoist Societies, were all watching with wide eyes and slack jaws.</p><br/><p>After a long moment, one of the old men chuckled wryly and said, “That’s cheating!!”</p><br/><p>These people were the only ones who could clearly see what had actually happened.</p><br/><p>“The fact that he came up with a way to seize victory like that might be considered cheating, but it’s amazing nonetheless!!”</p><br/><p>“He didn’t hesitate to kill himself along with the enemy! Fervor like that is what clinched the victory!”</p><br/><p>“Compared to this Fang Mu, all the others couldn’t even be considered to be using unorthodox tactics. His methods are truly astonishing. To self-detonate with such decisiveness, and furthermore, to control it so ingeniously… we can be certain that Fang Mu was the first person to realize that the second stage was an illusory world!”</p><br/><p>“Even still, he should be disqualified! Fraudulent methods like that are a complete disgrace!”</p><br/><p>“Oh please, you want him disqualified so you can secretly go recruit him! That’s not cheating. The other competitors just didn’t think of that idea, or perhaps couldn’t pull it off. That’s just weakness on their part. This Fang Mu has definitely cleared this stage!”</p><br/><p>As the discussions continued in the palace, one of the three Elders from the Three Great Daoist Societies who sat at the head of the group suddenly opened his eyes, filling the palace with endless light.</p><br/><p>“Fang Mu. Stage cleared!” He spoke only four words, but they echoed out from the palace into the starry sky, and then, by means of a special technique, echoed throughout the Ancient Road, and then out into the rest of the Ninth Mountain and Sea.</p><br/><p>Suddenly, a ranking list appeared in the Ancient Road of Dao Seeking, and in first place was the name Fang Mu. Every spot beneath it was blank.</p><br/><p>The Ninth Mountain and Sea was abuzz, and many of the Patriarchs seated in the palace pulled out jade slips to transmit information to their sects, ordering them to attempt to recruit Fang Mu.</p><br/><p>It was at this point that Meng Hao opened his eyes. At first, they seemed blank, but then quickly grew bright. His expression was calm as he sat there cross-legged and unmoving.</p><br/><p>The second stage was a complete illusion, and the so-called risk to the lives of the competitors was false. However, because of the brutality of the first stage, the other competitors subconsciously assumed that the second stage would be exactly the same.</p><br/><p>By now, roughly half of the prescribed time period had passed. Shockingly, a blue-robed young woman from the group who had proceeded 3,000 paces suddenly became visible from within the light that surrounded her. Her eyes brimmed with confidence as she looked over at the ranking list, and then suddenly went wide with shock.</p><br/><p>“He was actually faster than me!” she thought. “I possess the Dao of souls, allowing me to take control of the puppets. And yet Fang Mu possesses some more powerful divine ability? Just what is it?!”</p><br/><p>More people began to clear the second stage after the young woman. It didn’t take long for enough time to pass for an incense stick to burn. Roughly a third of the competitors didn’t manage to clear the stage. As for those who did, they used a variety of methods to succeed. When it came to the true Immortal, most of them chose to use the python to destroy it in a single blow.</p><br/><p>No one used the same method as Meng Hao.</p><br/><p>As people emerged from clearing the stage, they looked over at the ranking list, and were shocked.</p><br/><p>“Fang Mu took first place in the first stage, and now he took first place in the second stage too!”</p><br/><p>“Dammit!!” The masked young man was one of the last to emerge from the second stage. Behind his mask, his face was extremely unsightly. His previously high aspirations had been dealt a heavy blow. As for the old man with the age-transformation powers, he also looked ashen-faced, and was frowning.</p><br/><p>Most of the cultivators who distinguished themselves in the first stage did not fare very well in the second stage.</p><br/><p>Meanwhile, on the Ancient Roads of the Nascent Soul and Spirit Severing, the second stage had likewise concluded. Fatty, Chen Fan and Wang Youcai had all succeeded. Chen Fan put on the most astonishing performance, and although he didn’t take first place, he was in the top 100, which was quite an accomplishment!</p><br/><p>As for Fatty and Wang Youcai, they ended up in the top 1,000.</p><br/><p>Li Shiqi ranked toward the bottom, and had barely been able to pass.</p><br/><p>It was only the second stage, but the previously large number of competitors had already been whittled down by roughly half.</p><br/><p>Of course, Meng Hao’s performance caused a huge stir in the Ninth Mountain and Sea, and the name Fang Mu was now planted thoroughly in everyone’s minds. Many people were now looking forward to the third stage, to see if he could take first place yet again!</p><br/><p>On the Ancient Road of Dao Seeking, Ling Yunzi of the Nine Seas God World stood there in illusory form, looking out at the crowds. This time, his gaze lingered on Meng Hao for a bit longer than it had last time.</p><br/><p>Without another word, he then waved his hand, causing everyone to disappear. When they reappeared, they were further along down the Ancient Road. They still stood on altars, although everyone’s positions were now changed. Some who were in the lead, were now sent further back, whereas some who had been far in the back, had now caught up.</p><br/><p>Only Meng Hao was alone, far up ahead of everyone on his own altar. Behind him were all the other Dao Seeking cultivators, staring at his back, faces filled with the desire to do battle.</p><br/><p>“The previous two stages tested your battle prowess,” Ling Yunzi said coolly. “You will now pass through the third, fourth, and fifth stages simultaneously. They will test your latent talent, the depth of your cultivation base, and also… your true age!</p><br/><p>“The higher your latent talent, the deeper your cultivation base, and the younger you are, the more outstanding your results will be!</p><br/><p>“This is a composite test. Even if you did not perform well in the first two stages, if you do well in this third stage, you can still rise above the other competitors.” With that, he waved his hand, causing everything to flash with bright colors, and a wind to pick up. Suddenly, three enormous stone steles rose up out of the altars in front of each competitor.</p><br/><p>Each stone stele was inscribed with a single large character.</p><br/><p>Talent! Cultivation! Age!</p><br/><p>“Place your hand onto the stone stele, and allow its power to enter into you. Let the testing begin!”</p><br/><p>The majority of the cultivators on the Ancient Road of Dao Seeking stepped forward and placed their hands onto the ‘talent’ stone steles. In the blink of an eye, columns of light began to rise up from the stone steles, each one reaching a different height. Most reached a height of approximately 30 meters. However, there was one that suddenly shot up to 60 meters, drawing quite a bit of attention.</p><br/><p>To any sect, the latent talent a cultivator possessed was actually more important than battle prowess.</p><br/><p>Next, a 90-meter column of light appeared, then a 150-meter column, a 180-meter column, and even a 300-meter column!</p><br/><p>That one belonged to the young woman who had emerged from the second stage right after Meng Hao. She looked at the column of light, her expression as calm as it usually was.</p><br/><p>Behind her, more 300-meter columns appeared. Among the other cultivators who possessed 300-meter columns were the masked young man and the cultivator with the mosquitos. Those two, along with the young woman, were known to the audience by now. The others whose columns reached 300 meters were all people who hadn’t attracted much attention in the previous two stages, but were now making a spectacular showing.</p><br/><p>“A 300-meter column of light shows an incredible level of latent talent. I never imagined that there would be seven people with such latent talent in the Dao Seeking division of the trial by fire!”</p><br/><p>“There are nine in the Spirit Severing division!”</p><br/><p>“There are even more in the Nascent Soul division! A total of seventeen 300-meter columns!”</p><br/><p>“I wonder how Fang Mu will perform….” While the crowds outside discussed the proceedings, the Patriarchs in the palace who represented the various sects and clans were looking on with glittering eyes. They eyed the various cultivators with exceptional latent talent, and of course, were looking at Meng Hao.</p><br/><p>Meng Hao hesitated for a moment. He had never really paid much attention to his latent talent, but he lifted his hand up and then placed it onto the stone stele.</p><br/><p>As soon as he touched it, a gentle power spread out into his body from the stone stele. It quickly flowed into his qi and blood passageways, eventually swirling out through his whole body. However, it was at this point that the illusory Immortal meridian created by the bronze lamp suddenly quivered. Then, it began to emit a gravitational force that… instantly sucked up the gentle power from the stone stele.</p><br/><p>Meng Hao’s eyes went wide.</p><br/>\n</div>"}