{"title": "Chapter 861: First Place!", "id": 861, "volume": 9, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-861-first-place", "volume_title": "Volume 9", "body": "<h1>Chapter 861: First Place!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 861: First Place!</strong></p><br/><p>“What a Chosen!” By this time, all of the Patriarchs in the starry sky palace had risen to their feet with expressions of deep emotion on their faces. They were looking at the vortex screens, where the giant and the beasts were all bowing in worship to Meng Hao.</p><br/><p>All of the sects wanted to recruit Meng Hao as a disciple, but the Nine Seas God World of the Three Great Daoist Societies had already made a move, leaving them with no opportunity.</p><br/><p>It wasn’t just the other Three Great Daoist Societies who were in such a position, but also the Five Great Holy Lands.</p><br/><p>“This Fang Mu is one of the most incredible Chosen to appear in countless years!”</p><br/><p>“Congratulations to the Nine Seas God World. Fang Mu will definitely demonstrate extraordinary talent and skill in the God World!” In response to such words from the various Patriarchs, the old man from the Nine Seas God World laughed heartily. His expression was one of extreme contentment.</p><br/><p>By now, it was clear that Fang Mu was definitely in first place in this trial by fire!</p><br/><p>Of course, the crowds outside in the Ninth Mountain and Sea were in commotion. When it came to the final two stages of the heart and the Dao, Meng Hao was the first person to ever clear the entire stage. Not even Sir Fan had been able to do so.</p><br/><p>Meng Hao had earned everyone’s complete and utter attention!</p><br/><p>“He definitely deserves to be in first place!”</p><br/><p>“His name will soon shake the entire Ninth Mountain and Sea. He’s going to be number one among all Chosen! Once he joins the Nine Sea God World, if he continues on this path of growth, he’ll definitely become a Divine Son! If he and Fan Dong’er get together, then they’ll definitely become a legend!”</p><br/><p>“You guys didn’t notice, but in the final twenty thousand deaths, Fang Mu was actually happy! Compared to the pain everyone else was in, that’s probably even more frightening!”</p><br/><p>As the echo of discussion spread throughout the Ninth Mountain and Sea, Patriarch Reliance was out in the starry sky, looked quite pleased. Then, he suddenly shuddered.</p><br/><p>“Dammit! I’ve been thinking about this wrong! What the hell does that little bastard’s life or death have to do with me? His being the center of attention has nothing to do with the Patriarch! We’re enemies! Dammit! Dammit! I’ve been looking at it all wrong!!”</p><br/><p>Also somewhere in the starry sky was the 10th Wang Clan Patriarch, his hair disheveled, his eyes narrowed as he looked off into the distance.</p><br/><p>“Strong… much stronger than I remember,” he murmured. Deep within his eyes flickered the glow of Wang Tengfei’s spirit. “Meng Hao, I truly can’t wait until the moment when we meet again!” With that, he turned and disappeared into the distance.</p><br/><p>In the Kunlun Society, Pill Demon and Chu Yuyan looked on with trembling hearts. Having personally witnessed everything that had gone on in the trial by fire, were they not already aware that Fang Mu was Meng Hao, they would never have possibly drawn a connection between the two.</p><br/><p>Fang Mu… really was the complete focus of attention.</p><br/><p>“Planet South Heaven is too small,” Chu Yuyan murmured, a twinge of obsession visible in her eyes. “You were being held back there. Your world… is out among the stars.”</p><br/><p>Back on Planet South Heaven, in the Fang Clan in the vast Eastern Lands, Meng Hao’s parents looked at the vortex screens with smiles on their faces. Of course, buried within those smiles were emotional sighs.</p><br/><p>“Hao’er really is going to leave us,” murmured his mother, her voice soft.</p><br/><p>After a moment of silence, his father gently said, “Planet South Heaven is too small for him, and was limiting his growth. He was bound to leave South Heaven sooner or later. After this trial by fire is over, I won’t try to get him to stay too long.”</p><br/><p>“But he’s just a child,” she replied bitterly.</p><br/><p>“He’s grown up. If you don’t let him fly, how can he ever come to know the boundless universe?”</p><br/><p>Meanwhile, on Planet West Felicity, Zhao Yifan was polishing his sword, and the desire to fight flashed within his eyes. Then he looked away from the vortex screen up in the sky.</p><br/><p>“I must not underestimate all of the other members of my generation out there. I never imagined someone else like Meng Hao of Planet South Heaven existed. But now, this Fang Mu appears in the trial by fire!” The desire to fight burned hot in his eyes.</p><br/><p>“I truly hope that you participate in the arena matches!” said Zhao Yifan, taking a deep breath and then closing his eyes. He would of course take part in the arena matches, and would actually lead the disciples of the Sublime Sword Flow Grotto into the fighting.</p><br/><p>Only one cultivator from the Nascent Soul, Spirit Severing, and Dao Seeking stages would come out victorious in the arena matches. Then, they would be recruited as a disciple by one of the Three Great Daoist Societies, and become a Conclave disciple at that.</p><br/><p>Of course, that didn’t mean that participation was restricted. On the contrary, if disciples from the Three Great Daoist Societies participated and took first place, then they would also be able to join the Conclave.</p><br/><p>As far as other sects went, they did not participate for the chance to join a Daoist Society, but rather, for the incredible prizes offered up in the arena matches.</p><br/><p>In the Nine Seas God World, Fan Dong’er sat cross-legged with her eyes closed. Her complexion was ashen, and there seemed to be a trace of Karma in it. For some reason, she kept thinking about Meng Hao, whom she hated with a passion that had permeated even her bones.</p><br/><p>Behind her, as always, was the female corpse. When her master saw the corpse, he did not attempt to help her get rid of it. Instead, he told her that it was good fortune for her.</p><br/><p>However, Fan Dong’er did not wish to have good fortune like this.</p><br/><p>“How come just looking at this Fang Mu pisses me off!?” thought Fan Dong’er as she looked up at the vortex screen, her graceful brow furrowed. She was another of the Chosen who would participate in the arena matches.</p><br/><p>In the Li Clan on Planet North Reed, Li Ling’er’s expression was indifferent as she sat cross-legged in the clan’s Daoist rite centers. Seated in front of her was a large group of Li Clan members, all of whom were listening to her give a speech about cultivation. To these clan members, Li Ling’er was like a celestial goddess, selfless, incorruptible, and aloof.</p><br/><p>Occasionally, the vortex screens up above would draw the attention of the Li Clan members, and even Li Ling’er would occasionally look over.</p><br/><p>When the clan members asked her if she would participate in the arena matches…</p><br/><p>“Yes, I will!” she responded coolly.</p><br/><p>Taiyang Zi, as well as Sun Hai of the Church of the Emperor Immortal, were both required by their sects to participate in the fighting. Virtually all of the sects and clans sent their Chosen to join the arena matches.</p><br/><p>Some of them were people Meng Hao knew, but many were Chosen who hadn’t ever been to Planet South Heaven.</p><br/><p>In the outside world, everyone was preparing for the arena matches. As for Meng Hao, the world around him shattered into pieces. When he reappeared, he was back in the lead position on the Ancient Road of Dao Seeking.</p><br/><p>Behind him were all the other competitors in the trial by fire. They looked at Meng Hao with awe in their eyes, even the masked young man and the cultivator with the mosquitos.</p><br/><p>Meng Hao had used his own strength to crush the other participants in virtually every way.</p><br/><p>Ling Yunzi materialized up in midair. He hovered there, looking at the crowd for a moment before speaking.</p><br/><p>“The ten stages of testing have concluded,” he said coolly. “Being responsible for the Ancient Road of Dao Seeking, I will now select one thousand people to continue.” With that, he waved his hand, causing several thousand Dao Seeking cultivators to instantly vanish, teleported back to their places of origin.</p><br/><p>One thousand people remained.</p><br/><p>“All of you have passed the testing phase. Next, you may decide whether or not to participate in the arena matches.</p><br/><p>“In the arena matches, anyone who makes it to the top 100 will receive a prize of 1,000 Immortal jades. Perhaps some of you are unfamiliar with Immortal jades. They are objects that can be used in cultivation after you reach the Immortal Realm. They are a rare thing in the Ninth Mountain and Sea. 1,000 Immortal jades is similar in value to 10,000,000 spirit stones.”</p><br/><p>Originally, Meng Hao hadn’t been very interested in participating in the arena matches. However, when he heard this, his eyes went wide and began to shine with a bright light.</p><br/><p>“10,000,000 spirit stones….” he thought, panting. “The Three Great Daoist Societies are way too rich! You get 10,000,000 spirit stones just for getting in the top 100?!?!” Meng Hao was now feeling a bit excited.</p><br/><p>“If you get into the top 16, the prize is 5,000 Immortal jades,” Ling Yunzi continued. As his voice echoed out, Meng Hao got even more excited. All of the remaining participants were now panting eagerly.</p><br/><p>“If you reach the top 8, the prize is 10,000 Immortal jades!”</p><br/><p>Meng Hao’s mind filled with roaring, and he was mentally adding up how much 10,000 plus 5,000 plus 1,000 Immortal jades was in spirit stones. After finishing the calculation, his eyes began to shine with fierce light.</p><br/><p>“The prize for reaching the top 4 is an Immortality Illumination Vine!” continued Ling Yunzi, which instantly caused many among the thousand remaining participants to cry out loud in disbelief. Meng Hao didn’t seem to care too much, but the eyes of the others around him instantly went completely bloodshot.</p><br/><p>To most people, Immortal jades were just material wealth, and although they could be used in cultivation, that wouldn’t help until the Immortal Realm. However, an Immortality Illumination Vine could completely change one’s fate in life, and could make true Immortal Ascension possible!</p><br/><p>This was especially important because of the fact that a true Immortal had recently appeared on Planet South Heaven. In the following thousand years, Immortality Illumination Vines could be considered precious treasures to everyone, except perhaps Meng Hao.</p><br/><p>They could change fate and determine the future!</p><br/><p>There were different prizes offered on the other two Ancient Roads. However, regardless of the stage they were in, when the cultivators found out what rewards that were being offered, it sent their blood boiling. They weren’t the only ones. When the crowds in the Ninth Mountain and Sea heard of the prizes available on the three Ancient Roads, their eyes went bloodshot, and they began to breathe heavily. Were it not for the fact that they didn’t possess the requisite qualifications, they too would be there to participate in the fighting.</p><br/><p>This was especially true when they heard that one of the prizes on the Ancient Path of Dao Seeking was an Immortality Illumination Vine.</p><br/><p>“I can’t believe the prize is... an Immortality Illumination Vine!!”</p><br/><p>“Dammit! If I had known that, I would have participated! In the next thousand years, anyone who has an Immortality Illumination Vine has a high likelihood of becoming a true Immortal!!”</p><br/><p>“True Immortality! Although using an Immortality Illumination Vine doesn’t measure up to seizing destiny, it doesn’t matter how you become a true Immortal among the stars, you’re still a true Immortal!!”</p><br/><p>Ling Yunzi looked out with satisfaction at all the looks of shock. However, when he looked at Meng Hao, he could tell that although he was cheering like everyone else, it seemed a bit perfunctory. After a moment of thought, Ling Yunzi spoke out again.</p><br/><p>“Fang Mu, although you are a Conclave disciple of the Nine Seas God World, if you don’t perform enough meritorious service in the future, you won’t be awarded with an Immortality Illumination Vine. You must seize this opportunity to acquire one.”</p><br/><p>Meng Hao quickly nodded his head, and then suddenly asked, “How many spirit stones is an Immortality Illumination Vine worth?”</p><br/><p>Ling Yunzi’s jaw dropped.</p><br/><p>“They’re priceless,” he responded. “If you put one up for auction, it’s very likely that it would sell for millions of Immortal jades.”</p><br/><p>When Meng Hao heard that, his mind spun, and he began to tremble. Immediately, his eyes went completely bloodshot, and his expression turned completely vicious.</p><br/><p>Seeing Meng Hao like this caused Ling Yunzi to clear his throat. He was gradually starting to understand Meng Hao’s personality a bit more.</p><br/><p>“Whoever takes first place will receive a prize of….” Ling Yunzi paused dramatically.</p><br/><p>“A drop of blood passed down by the Three Great Paragons!”</p><br/><p>The response to his words was complete silence. However, there were some people who began to tremble, and expressions of intense disbelief covered their faces, looks that exceeded the ones that had appeared when they were told about the Immortality Illumination Vines. The outside world was quiet too, but only for a moment, after which a great tumult broke out.</p><br/><p>“A drop of blood from the Three Great Paragons! Heavens! That would contain the Dao of the Three Great Paragons!!”</p><br/><p>“The Three Great Paragons!? According to legend, they were powerful experts from ancient times. They… they actually left behind a drop of blood!?!?”</p><br/><p>“Is this for real?!?!”</p><br/><p>Even the Patriarchs in the starry sky palace could hardly believe it. They shot to their feet, panting, expressions of shock written on their faces.</p><br/><p>Only Meng Hao didn’t seem to have much of a reaction. However, Ling Yunzi’s next words, which were clearly directed at him, caused Meng Hao’s heart to skip a beat.</p><br/><p>“Fang Mu, if you put this drop of Paragon’s blood up for auction, it would be easier to find a phoenix feather or a qilin horn than to find someone in the Ninth Mountain who could afford it.”</p><br/>\n</div>"}