{"title": "Chapter 876: Four Battles, Four Victories!", "id": 876, "volume": 9, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-876-four-battles-four-victories", "volume_title": "Volume 9", "body": "<h1>Chapter 876: Four Battles, Four Victories!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong></strong></p><br/><p>[/expand]</p><br/><p>When Meng Hao attacked, the white-robed woman floating in midair outside of the Dao Tree looked at him calmly for a moment, although no onlooker would notice that fact, not even Meng Hao.</p><br/><p>Xiao Luo reappeared on another leaf, his entire body shaking as he looked back at Meng Hao with terror and astonishment. Before their battle, he had been aware that Meng Hao was powerful, but he had never imagined that he would only be able to defend and would be completely incapable of fighting back against him.</p><br/><p>He had even burned some of his longevity and used his Nine Corpses Demon Transformation, explosively increasing their cultivation bases to be similar to false Immortals. And yet, his opponent had then unleashed some unknown divine ability… to cause his nine corpses to stop in mid-flight, and even sever their connection to him.</p><br/><p>As he thought about it, Xiao Luo took a deep breath. This was the first time he had ever truly been afraid of another person.</p><br/><p>“He’s somebody I can’t ever provoke! If I ever meet him again, I’ll simply flee! His magical technique… can inhibit my Dao!” Xiao Luo took another deep breath as he looked at Meng Hao. Intense terror filled his heart, and he rejoiced at his decision to concede when he did. If he hadn’t, he himself might be a corpse now.</p><br/><p>Almost in the same moment that Meng Hao finished his match, Zhao Yifan also secured another victory. After that… the fourth battle began.</p><br/><p>Meng Hao stood as usual on his leaf. From the very beginning to now, he had not moved to the losers bracket. There was only one other among the top 4 who had done the same, and that was Zhao Yifan!</p><br/><p>Even Fan Dong’er had been defeated, by none other than Xie Yixian from the Burning Incense Stick Society.</p><br/><p>That match garnered quite a bit of attention, and caused Xie Yixian to suddenly rise up abruptly in the eyes of the onlookers.</p><br/><p>The bizarre Qian Duoduo ended up being defeated by Li Ling’er, whose magical techniques were somewhat effective at counteracting the old man. However, in the very end, it was actually difficult to say who won and who lost. Li Ling’er earned her victory mostly due to luck.</p><br/><p>As of this moment, Meng Hao and Zhao Yifan were certain to enter the semifinals, but as for everyone else, it was hard to say.</p><br/><p>Meng Hao’s opponent in the fourth battle was the Chosen who had beaten Fan Dong’er, Xie Yixian from the Burning Incense Stick Society. As soon as he emerged from the glittering light to stand in front of Meng Hao, his eyes gleamed seriously.</p><br/><p>Of all the people who made it to the top 8, he truly feared three of them. One was the spectacular Zhao Yifan, the other was the talkative Qian Duoduo, and the last… was none other than this Fang Mu.</p><br/><p>“I am Xie Yixian from the Burning Incense Stick Society. Fellow Daoist Fang, please give me some fighting tips!”</p><br/><p>Having said this, Xie Yixian suddenly sat down cross-legged and performed an incantation gesture with his right hand. Immediately, a copper furnace appeared in front of him.</p><br/><p>Stuck into the very top of the copper furnace was an incense stick.</p><br/><p>As the incense stick burned, streams of smoke curled up into the air to surround Xie Yixian, obscuring him slightly.</p><br/><p>“Fellow Daoist Fang, my magical technique is different from the kind you’ve seen before. If you can stand up to it for the amount of time it takes this incense stick to burn, then I will concede.”</p><br/><p>Meng Hao stood in place, his expression the same as ever. He had been paying close attention to how Xie Yixian fought. Right now, Meng Hao didn’t even speak. He took a step forward, and then suddenly, everything around him distorted, and in the blink of an eye, the arena was gone. In its place, a boundless land stretched in front of Meng Hao.</p><br/><p>Countless cities could be seen dotting the land, and within each one was an enormous statue. If you looked closely, you would see that the statues depicted none other than Xie Yixian.</p><br/><p>Meng Hao’s eyes glittered.</p><br/><p>At this point, a majestic voice rang out throughout the world.</p><br/><p>“The Heavens are grand, the Earth majestic!” As soon as the voice echoed out, the statues of Xie Yixian trembled and opened their eyes, almost as if they were coming to life. They flew up into the air, a total of 9,000 of them, which then began to circulate around Meng Hao and emanate radiant light. In a short moment, the statues merged together into one.</p><br/><p>They became… a lifelike Xie Yixian.</p><br/><p>He hovered there in midair, smiling slightly at Meng Hao.</p><br/><p>“The Heavens are grand, and the Earth is majestic, but the greatest of all is the host of all living things!</p><br/><p>“Living things possess desire. Desire becomes thought. Thought becomes burning incense. Worship the gods, pray for their blessing. Through the cultivation of this burning incense, if they worship me, then I am a god! If they pray to me, I am a god!</p><br/><p>“This place is my Burning Incense World. Here… I am a god, and in this place, I cannot be defeated!</p><br/><p>“If I say that a single breath will last for ten thousand years, then ten thousand years that breath shall last!</p><br/><p>“Fellow Daoist Fang, you have a monstrous cultivation base, and shocking divine sense. Willpower and determination like yours is something I rarely see. Why not become my follower here? Become part of my Burning Incense Flock. Cultivate the Dao of burning incense. Then one day, you too can be a god.” Xie Yixian’s words were spoken indifferently, but seemed to contain a bizarre power. As they echoed out into Meng Hao’s ears, he felt his mind trembling, as if there was something within the words that made them impossible to resist, and that was forcing him to comply.</p><br/><p>“If I become part of your Burning Incense Flock, how many spirit stones will you pay me per month?” asked Meng Hao coolly.</p><br/><p>As soon as the words left his mouth, Xie Yixian gaped. After a moment, though, he laughed loudly, then waved his hand. A massive roaring could be heard that transformed into a continent of spirit stones. All of the mountains, cities, even the vegetation, turned into spirit stones.</p><br/><p>In the blink of an eye, the entire world transformed into endless, uncountable spirit stones.</p><br/><p>“You can have however many you wish.”</p><br/><p>Meng Hao looked around and then shook his head. “I don’t want these. I want real spirit stones, in the outside world.”</p><br/><p>Xie Yixian’s face darkened, and he gave a cold snort. The sound started out light, but then rapidly turned into something that sounded like thunder, echoing out with incredible pressure. It was like Heavenly might that crushed down onto Meng Hao.</p><br/><p>“Kneel before me!” said Xie Yixian. His voice echoed out shockingly, filled with a will that seemed almost impossible to resist.</p><br/><p>Meng Hao looked up, his expression the same as ever.</p><br/><p>“That’s all the pressure you can exert?” he asked. Suddenly, he transformed into a vulture that shot toward Xie Yixian. A boom rang out as Xie Yixian’s body collapsed. A moment later, he reappeared some distance off.</p><br/><p>“My life force is limitless in this place,” he said coolly. “You can’t kill me!” He raised his right hand, coalescing the power of the world into a huge palm that shot toward Meng Hao.</p><br/><p>Energy raged, and boundless pressure emanated out.</p><br/><p>“Can’t kill him?” thought Meng Hao, frowning. “Is that because the magic is an illusion? Or because I haven’t affected the essence of his life force?” He extended his right hand and made a grasping gesture. Instantly the Blood Demon Grand Magic surged into action. An enormous blood-colored vortex appeared, which spread out to cover Xie Yixian, enveloping him completely.</p><br/><p>A boom rang out as his body collapsed into pieces. At the same time, another image of him appeared off to the side. But this time, his face was pale and filled with astonishment.</p><br/><p>“What magical technique is that!?!?”</p><br/><p>“Ah, so it was because the essence of his life force hadn’t been affected.” Meng Hao smiled, and then suddenly, his hand turned bright red. He immediately flew out, closing in on Xie Yixian. Even as the young man stared in shock, Meng Hao slapped out with his palm.</p><br/><p>A bang could be heard as Xie Yixian once again collapsed into pieces. Actually, his battle prowess wasn’t very high to begin with. What was truly shocking was his magical technique. Unfortunately, that magic wasn’t very useful on Meng Hao.</p><br/><p>In the past, whenever someone killed him in this world, he would come back to life. It could happen over and over again, without end, leaving opponents completely dispirited.</p><br/><p>Now, though, every time he died, some of his life force was actually drained away. It was something that had never happened to him before, and in his shock, he tried to evade Meng Hao. However, he was no match at all. Were it not for the magical technique he was using, Meng Hao could have killed him numerous times in the blink of an eye.</p><br/><p>Rumbling echoed out. Every time Xie Yixian died, one of his statues would shatter. Every time Xie Yixian reappeared, his face was covered with astonishment, and he would instantly fall into retreat.</p><br/><p>“Elder Brother Fang, stop! I’ll let you out, you can leave….”</p><br/><p>“You don’t need to let me out,” Meng Hao replied calmly, “I can get out on my own.” With that, he slammed his foot down onto the surface of the ground. A huge boom could be heard as his Dharma Idol appeared, towering 300 meters into the air, its energy surging.</p><br/><p>Xie Yixian’s face flickered, and he was just about to say something else when Meng Hao suddenly stamped his foot down again. Rumbling could be heard as his Dharma Idol rapidly grew in size. Now it was 3,000 meters tall!</p><br/><p>Monstrous energy surged, and the power of a true Immortal erupted out. Xie Yixian’s face instantly fell as Meng Hao stamped down a third time.</p><br/><p>BOOM!</p><br/><p>Meng Hao’s Dharma Idol grew again. In the blink of an eye it was now 6,000 meters tall, seemingly big enough to prop up the sky.</p><br/><p>“Tear this place open!” said Meng Hao, his eyes flickering with killing intent. As he spoke, he raised both hands high into the air, then slammed them down. Rumbling filled the air as his Dharma Idol also raised its hands up, grabbed ahold of the air, and then began to rip it in two different directions.</p><br/><p>Massive, shocking rumbles echoed out. Xie Yixian’s face flickered as he performed incantation gestures, causing the world to begin to rotate and stabilize. However, despite his efforts, a massive rift appeared in the sky.</p><br/><p>The world was actually being ripped apart!</p><br/><p>“Impossible!” shouted Xie Yixian. “This is my Burning Incense World! I am God here! Maybe you can hurt my life force, but if I say that nothing can destroy this land, then no power exists that can do so!”</p><br/><p>“I’m afraid your cultivation base is simply… not high enough,” said Meng Hao, his voice cool. He stamped his foot down onto the ground a fourth time, and his cultivation base surged with eighty percent of an Immortal meridian, and eighty percent of the power of a true Immortal. His Dharma Idol grew again; it was now 12,000 meters tall. It lifted its hands up, then violently ripped at the sky. The earth quaked and bright colors flashed in the sky. A massive rumbling sound echoed out.</p><br/><p>The rift in the sky opened wider, and an enormous rumbling sound filled the air. Meng Hao’s Dharma Idol was literally tearing the sky open!</p><br/><p>As the sky was ripped open, the entire world, as well as Xie Yixian, suddenly shattered. When things grew clear again, Meng Hao was standing in the same place as before in the arena. Xie Yixian was there in front of him. Only about ten percent of the incense stick in front of him had burned so far. A cracking sound rang out as the incense stick suddenly collapsed into pieces.</p><br/><p>When that happened, the smoke dissipated, revealing Xie Yixian sitting there cross-legged. He opened his eyes and coughed up a mouthful of blood. Face pale, he looked at Meng Hao and smiled bitterly.</p><br/><p>“Elder Brother Fang, you are quite powerful... I concede!”</p><br/><p>Even as the words left his mouth, he coughed up another mouthful of blood. Suddenly, a rip appeared on his forehead, a wound that seemed very difficult to heal. It was a Dao Wound!</p><br/><p>The cause of the wound was none other than the tearing open of his Burning Incense World.</p><br/><p>This fight had been a very strange one. From start to finish, barely a hundred breaths of time had passed, and all the other matches were still in progress. The audiences in the Ninth Mountain and Sea were instantly in an uproar.</p><br/><p>“Four battles, four victories!!”</p><br/><p>“The last battle seemed ordinary, but actually, the disciple from the Burning Incense Stick Society was in grave peril!”</p><br/><p>“A tear appeared on Xie Yixian’s forehead! I heard that if the magic of the Burning Incense Stick Society is broken, it can cause a backlash that will turn into a Dao Wound! Don’t tell me… that’s a Dao Wound!”</p><br/><p><strong>Chapter 876: Four Battles, Four Victories!</strong></p><br/>\n</div>"}