{"title": "Chapter 880: Shocking Transformations!", "id": 880, "volume": 9, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-880-shocking-transformations", "volume_title": "Volume 9", "body": "<h1>Chapter 880: Shocking Transformations!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 880: Shocking Transformations!</strong></p><br/><p>The vulture’s claws could shred metal and crush stone!</p><br/><p>Blood sprayed from Zhao Yifan’s mouth, and his chest was a mass of mangled flesh. However, his mouth was twisted in a cold grin and he suddenly opened his mouth, causing a sword to fly out. In the blink of an eye, it pierced through the air and was about to stab into Meng Hao. Meng Hao’s eyes shone with a gleam of surprise, and he let out a mighty roar.</p><br/><p>The sound of the roar caused ripples to spread out, and the sword stopped in place for a moment. In that short pause, Meng Hao’s right hand moved like the wind, unleashing the Star Plucking Magic to grab the sword and crush it violently. Cracking sounds rang out as the sword shattered. Zhao Yifan coughed up blood yet again.</p><br/><p>However, he also took advantage of that moment to leap up into the air.</p><br/><p>“Dharma Idol True Body!” An expression of madness flickered on his face as he held his ground and refused to concede. As his words echoed out, his Dharma Idol suddenly vanished as it merged into his body. A moment later, a 6,000-meter giant appeared in midair.</p><br/><p>It was Zhao Yifan.</p><br/><p>“Fang Mu, our battle isn’t over yet!” With a roar, he lifted his right hand, within which appeared the Cloud Sealing Sword, which he slashed down toward Meng Hao.</p><br/><p>Almost in the same moment in which the sword began to fall, Meng Hao closed his eyes. When he opened them, his Dharma Idol vanished and merged with his body, whereupon another 6,000-meter giant appeared. His foot sped through the air in a roundhouse kick, smashing into the sword. Then, the two of them began to fight back and forth up in the air.</p><br/><p>Booms echoed out, and the audiences in the Ninth Mountain and Sea were breathing heavily.</p><br/><p>“They’re too powerful!!”</p><br/><p>“Neither Zhao Yifan nor Fang Mu are Immortals, but even false Immortals would be like ants to them! They could kill them without expending any effort at all! They could probably even fight true Immortals!”</p><br/><p>“They’re both only at the peak of the Spirit Realm, but they’re shocking even to me, and I’ve opened 30 meridians!”</p><br/><p>“Too powerful!”</p><br/><p>“If the two of them actually become Immortals, then of the ten stages in the Immortal Realm, they would definitely have at least 90 meridians!”</p><br/><p>In the starry sky palace, the various Patriarchs were staring fixedly at the proceedings. Although any one of them could easily defeat Zhao Yifan or Meng Hao, the battle that was playing out in front of them was stunning and spectacular. After all… even though it was only a Spirit Realm battle, the Patriarchs were able to sense that both Zhao Yifan and Meng Hao both had the potential to be future Paragons.</p><br/><p>“They both have 6,000 meter Dharma Idols. That’s comparable to a stage two Immortal. In the ten stages of the Immortal Realm, each stage adds 3,000 meters to one’s Dharma Idol!”</p><br/><p>“Both of them have built a strong foundation for success. Zhao Yifan has been suppressing himself in the Spirit Realm for a long time, just waiting for true Immortal destiny to appear. Then, he can use his Immortality Illumination Vine to achieve true Immortal Ascension. One thing is for certain, once he enters the Immortal Realm, his cultivation speed will be explosive. He’ll most likely reach the peak of the Immortal Realm in less than a hundred years!”</p><br/><p>“It looks like Fang Mu is in the same position. In fact, the Chosen of the all the important sects in the Ninth Mountain and Sea are all like that!”</p><br/><p>Back in the arena, Meng Hao and Zhao Yifan were fighting fiercely. However, Meng Hao had not yet unleashed his full power. Even though his Devilish will had been rekindled, making him stronger than ever, he could sense that Zhao Yifan was still hiding some sort of terrifying aura, so because of that, Meng Hao was also holding back.</p><br/><p>Rumbling filled the air, and Zhao Yifan’s eyes were completely bloodshot. By this point in the battle, he was already using everything that he could exercise control over, and yet was still not a match for his opponent. In fact, he was consistently forced into retreat.</p><br/><p>“I refuse to accept this!” he thought. Killing intent flickered in his eyes, and even as he fell back, he suddenly took a deep breath. It was at this point that a vine suddenly appeared, wrapping around his body and emanating gentle light, as well as Dao music. It was none other than an Immortality Illumination Vine.</p><br/><p>Zhao Yifan threw his head back and roared. At the same time, the Immortality Illumination Vine began to glow radiantly. He began to tremble, and then grew even larger. He was now 9,000 meters tall!!</p><br/><p>His 9,000-meter tall body radiated shocking power, a power that Zhao Yifan actually found difficult to control, a power that came from sacrificing the Immortality Illumination Vine.</p><br/><p>When the crowds out in the Ninth Mountain and Sea saw what was happening, they were sent into an uproar.</p><br/><p>“He was actually suppressing his cultivation base before!!”</p><br/><p>“Heavens! He’s actually… comparable to a stage three Immortal!”</p><br/><p>“Fang Mu is finished!!”</p><br/><p>Zhao Yifan’s vision had grown blurry. The only thing that he could see now was Meng Hao, and the only thought that existed in his head was that he had to defeat Fang Mu!</p><br/><p>BOOM!</p><br/><p>Zhao Yifan’s body flashed, and his energy surged to the heavens. He closed in on Meng Hao, sword qi raging in all directions, shattering the air. Rumbling sounds rang out as they once again began to fight.</p><br/><p>Meng Hao’s eyes glittered. Black flames surged around him as his Dharma Idol body suddenly grew with explosive speed. Now he was 9,000 meters tall too!</p><br/><p>In that instant, a collective gasp of disbelief could be heard out in the Ninth Mountain and Sea, and even from the cultivators on the Dao Tree.</p><br/><p>“Heavens! Fang Mu was also concealing his true cultivation base. I can’t believe that he… is also comparable to a stage three Immortal!”</p><br/><p>“Just who is going to win this battle!? Who… is going to take first place!?”</p><br/><p>Booms rang out as Meng Hao and Zhao Yifan fought back and forth. In the blink of an eye, hundreds of exchanges had taken place. The ground quaked, the entire golden arena was shaking, and rifts could be seen in the air in all directions.</p><br/><p>Finally, Zhao Yifan staggered backward, blood spraying from his mouth, a look of despair on his face. He had unleashed all the power he could muster, had done almost everything he could do, and yet still could not gain victory over his opponent.</p><br/><p>“No,” he thought. “I still haven’t used everything. I still haven’t used the Second Cleaving of the Five Cleaving Swords. But….”</p><br/><p>Zhao Yifan’s eyes radiated madness, and as he fell back, he suddenly stared straight at Meng Hao.</p><br/><p>“Fang Mu, unleash the battle prowess of your most powerful cultivation base! We’re going to determine victory and defeat with one move!” With that, Zhao Yifan tilted his head back and laughed uproariously. His lips were twisted with madness, and the obsession to win. Suddenly, he began to shake, and a burning aura exploded out.</p><br/><p>In that instant, his Dharma Idol body began to emit blinding light. The light spread out and then all of a sudden… shrank back down!</p><br/><p>This was… Dharma Idol self-detonation!</p><br/><p>“Sublime Flow Sword Grotto, Five Cleaving Swords, also known as Five Immortal Swords. With my current power, I can unleash the First Cleaving. Now, I will utilize the power of self-detonation to unleash the Second Cleaving!</p><br/><p>“Fang Mu, if you can’t stand up to this attack, then you will be defeated!” As Zhao Yifan spoke, his Dharma Idol rapidly grew smaller. However, his terrifying aura grew more and more powerful.</p><br/><p>The audiences in the Ninth Mountain and Sea were in an uproar. In the starry sky palace, the Patriarchs had all risen to their feet. The old man from the Sublime Flow Sword Grotto stamped his foot onto the ground.</p><br/><p>“So impulsive!” he thought, frowning. As he watched the scene playing out on the vortex screen, his expression darkened.</p><br/><p>“Fang Mu,” cried Zhao Yifan, “after this attack, I will be powerless to do anything. If I don’t die, then at the very least, I’ll have to go into secluded meditation to recover, and it will be difficult for me to create another Dharma Idol. But I, Zhao Yifan, have no regrets!</p><br/><p>“This battle, this attack, contains all of my hope! Show me… exactly how strong you actually are!” By now, Zhao Yifan had shrunk from 9,000 meters tall to only 900. His energy continued to surge, and the air around him shattered. Even the arena itself was trembling.</p><br/><p>Meng Hao looked in Zhao Yifan’s eyes, and what he saw was a madness inspired by the heat of battle. He nodded his head silently, and suddenly, the Devilish will inside of him exploded out. Black flames surged into the Heavens, and his Dharma Idol once again began to grow!</p><br/><p>9,500 meters. 10,500 meters. 11,500 meters…. All the way to….</p><br/><p>12,000 meters!</p><br/><p>He stood there, surrounded by intense rumbling. All of the cultivators on the Dao Tree were flabbergasted. None of them had ever heard of someone in the Spirit Realm who was comparable to a fourth stage Immortal!!</p><br/><p>They could understand Zhao Yifan’s extraordinary display of power, especially because he had an Immortality Illumination Vine to rely on. But Meng Hao’s Dharma Idol had no Immortality Illumination Vine!</p><br/><p>Such a thing was… completely terrifying!!</p><br/><p>Out in the Ninth Mountain and Sea, the crowds were going wild. The buzz of conversation echoed about everywhere, and anticipatory shouts drifted about.</p><br/><p>“Zhao Yifan is detonating his Dharma Idol and drawing on his life force to unleash his most powerful sword attack! And Fang Mu… is actually comparable to a fourth stage Immortal!!”</p><br/><p>“Victory and defeat will be determined right now! I wonder which of these two… will take first place!!”</p><br/><p>The most anticipated moment of the entire trial by fire, and of all the arena matches, had now arrived!</p><br/><p>The audiences’ eyes were glued to the vortex screens as Zhao Yifan’s body shrank down to the size of a normal person. His 9,000-meter Dharma Idol had collapsed, and all of the power of that collapse had been coalesced into the sword that he held in his hand.</p><br/><p>This was no ordinary sword!</p><br/><p>“Five Cleaving Swords, Second Cleaving…. Immortal: Why Sever the Mundane World?!” As Zhao Yifan’s voice rang out, he lifted his right hand, and his eyes shone with unprecedented brightness. This sword attack contained his life force, his Dharma Idol, his willpower, his everything!</p><br/><p>He raised his sword up, and then swung it downwards. It transformed into a Heavenly sword, something that could sever mortality. It was as if the sword were asking an Immortal, ‘will you sever the mundane…? Or not?!’</p><br/><p>Rumbling filled the air as the sword slashed down. Meng Hao took a deep breath. He had eighty percent of the power of a true Immortal, and the power of an Immortal meridian. All of that power exploded out as his Dharma Idol performed a double-handed incantation, then prepared to punch out. Shockingly… an Immortal meridian appeared in the air around his Dharma Idol!</p><br/><p>The Immortal meridian looked like a strand of silk, swirling around him, bursting with shocking Immortal qi that coalesced onto his hand, creating the most powerful punch he was capable of. The punch slammed out into the air above the arena.</p><br/><p>When the sword and the punch collided, a massive boom rattled out, shaking the entire Dao Tree. The air churned, and even the people outside in the Ninth Mountain and Sea could sense it. In the starry sky palace, the various Patriarchs were all panting.</p><br/><p>BOOOMMMM!</p><br/><p>The sound seemed capable of ripping open the Heavens. A gigantic vortex appeared, instantly spreading out to cover the entire golden arena. The aura inside the vortex grew more and more intense, as all of the power unleashed by Meng Hao and Zhao Yifan gathered together. At the same time, the entire arena began to collapse!</p><br/><p>It was at this point that a massive backlash of power rose up in the vortex, which then swept down directly onto Zhao Yifan. It was far too much power for him to bear, and a wan smile suddenly appeared on his face as he realized that he had been defeated.</p><br/><p>Blood sprayed from his mouth, and cracking sounds could be heard all over his body. More than half of the bones in his body were shattered as he was violently thrown out of the Dao Tree itself.</p><br/><p>“I lost….” he murmured. In the moments before he lost consciousness, he saw Meng Hao standing there, fighting back against the power. Then Zhao Yifan passed out.</p><br/><p>After Zhao Yifan lost consciousness, Meng Hao coughed up a mouthful of blood. Instantly, the flames from the Devilish will were extinguished, and a peaceful glow appeared in his eyes. However, the force of the attack against him sent him tumbling back, out of control. Rumbling could be heard as he was sent flying off of the arena and outside of the Dao Tree!</p><br/><p>In that exact moment….</p><br/><p>The half-headed man who had been lurking outside of the arena the entire time looked over with an expression of excited greed. Utilizing incredible speed, he shot from his position by the arena toward Meng Hao, who was tumbling through the void above the Ruins of Immortality.</p><br/>\n</div>"}