{"title": "Chapter 884: Family Reunion", "id": 884, "volume": 9, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-884-family-reunion", "volume_title": "Volume 9", "body": "<h1>Chapter 884: Family Reunion</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 884: Family Reunion</strong></p><br/><p>The little violet tree was actually very tough; unexpectedly, it resisted Meng Hao’s efforts to pull it out of the ground. A brutal gleam appeared in Meng Hao’s eyes, and he used all the force he could muster; the power of a stage four Immortal exploded out as he tugged violently on the tree until a boom could be heard, and the tree was pulled up out of the ground.</p><br/><p>“Rich! I’ve struck it rich!!” Meng Hao’s eyes gleamed with excitement, and his heart pounded with happiness. He turned and sped toward the Sun Blossoms. Eyes burning with madness, he waved his sleeve to pull them up by the root as well.</p><br/><p>All of this happened in the time it takes a spark to fly off of a piece of flint. In the meantime, the meat jelly was hollering and blubbering as it speedily retreated through the sky above, its entire body numb as it looked at the endless black beetles flying toward it. As it shot backward, the illusion created by the black feather fell away.</p><br/><p>With its aura suddenly weakened, Meng Hao’s actions down below were instantly noticed by the black beetles. Such provocation was something they hadn’t experienced in years; no one had ever had the gall to try place themselves within the mouth of the tiger.</p><br/><p>Rumbling could be heard as the beetles performed an about face and shot toward Meng Hao. They moved with incredible speed, blanketing the area as they closed in. The meat jelly gritted its teeth. It didn’t want to follow the plan that Meng Hao had laid out, but it thought about how dangerous the place was and changed its mind. Wailing piteously, it used the black feather to make itself look like a black beetle, which then joined the army of other black beetles in their charge.</p><br/><p>Such a transformation would be very difficult to pull off without the black beetles noticing, and sure enough, some of the beetles detected the anomalous presence of the meat jelly. Some of them charged toward it madly and began to voraciously bite it. The meat jelly howled, but continued to shoot toward Meng Hao as fast as possible.</p><br/><p>Meng Hao’s face flickered as he looked at the cloud of black beetles closing in on him. Scalp tingling, he used his left hand to press down on the jade slip. Rumbling could be heard, and a bright light began to shine as the power of teleportation exploded out.</p><br/><p>In that instant, Meng Hao used the Star Plucking Magic to grab another Holy medicinal plant off in the distance. In the blink of an eye, the plant flew through the air to land in his hand.</p><br/><p>At the same time, the black beetles roared down toward him. The quickest of them all was the meat jelly; when it saw the light of teleportation growing stronger around Meng Hao, it nearly went crazy. It had no desire to be left behind in this place, so it burst forward with all the speed it could muster, latching onto Meng Hao’s robe with its mouth and holding on for dear life.</p><br/><p>The countless black beetles pounced onto Meng Hao, but in that instant, the power of teleportation peaked, and he vanished.</p><br/><p>Suddenly, the land began to tremble in response to the provocation of the teleportation. In all directions, everything turned black as millions of black beetles flew up into the air, covering the sky. At the same time, the land continued to change violently. Even though the beetles had flown up into the air, the land didn’t change color; it was as black as ever.</p><br/><p>A muffled roar could be heard from the ground, and everything was shaking. Suddenly, it became clear that… the land was not land at all, but actually, an enormous black beetle!</p><br/><p>In a scene reminiscent of Patriarch Reliance that year, the land in the area turned out to be resting on the back of an enormous black beetle!</p><br/><p>Snatching food from the tiger’s mouth!</p><br/><p>If Meng Hao did not possess the teleportation jade slip, then even if he had a cultivation base in the Ancient Realm, it wouldn’t have mattered. He would have been killed in body and spirit.</p><br/><p>**</p><br/><p>In the vast Eastern Lands on Planet South Heaven, snowflakes drifted through the air, and the land was the color of silver. It was winter.</p><br/><p>In the mountains where the Immortal Ancient Daoist Rite Temple had once stood, a bright light rose up into the air as an enormous teleportation portal appeared.</p><br/><p>Rumbling could be heard, and the bright light faded to reveal Meng Hao. As soon as he appeared, he shot forward at top speed. The meat jelly was still latched onto his robe, and there were seven black beetles following him that had been caught up in the teleportation.</p><br/><p>The black beetles were streaks of black light that shot murderously toward Meng Hao.</p><br/><p>He took a deep breath, and, sensing that he was back on Planet South Heaven, lifted his head up and laughed. The feeling of narrowly escaping a catastrophe was exhilarating. He turned and faced the seven black beetles, his eyes flickering coldly.</p><br/><p>“Seven? That’s nothing!” He extended his right hand and unleashed the full power of his cultivation base, the power of a stage four Immortal. His Dharma Idol appeared, throwing a punch that gave rise to a tempest, which then bore down onto the seven black beetles.</p><br/><p>Of the seven black beetles, five were similar to false Immortals, and two were even more powerful, emanating the aura of stage two Immortals. Back in the Ruins of Immortality, when the beetles were all grouped together, their collective power was like that of the peak of the Immortal Realm. It was something completely hair-raising. But now, there were only these seven, and under the power of Meng Hao’s punch they were all flung backwards. Their carapaces were crushed, and they were flung violently against the side of a nearby mountain.</p><br/><p>Despite being injured, they were as vicious as ever. Radiating ferocity, they once again shot toward Meng Hao in a deadly attack.</p><br/><p>Meng Hao’s eyes glittered brightly.</p><br/><p>“My attack just now could have killed a stage two Immortal with twenty opened meridians. But these seven beetles are as ferocious as ever. No wonder, considering they’re from the Ruins of Immortality. It would be a real waste to kill them!” He flickered forward, and as the seven black beetles closed in, he reached out, grabbed them, and threw them into his bag of holding, where he forcibly sealed them.</p><br/><p>The seven black beetles struggled in vain as the sealing marks were laid onto their bodies. Even afterward, they still viewed Meng Hao as an enemy, and although they couldn’t escape, they would be difficult for him to control.</p><br/><p>“When I have the time, I’ll refine them a bit. Or maybe when I fully understand the Sixth Demon Sealing Hex, I can use that to control them.” Meng Hao took a deep breath and then headed off into the mountains.</p><br/><p>“The trial by fire ended with an unforeseen occurrence. I really need to get home to see dad and mom. They’re going to be worried.” Meng Hao turned into a beam of light that shot out of the mountains and headed toward the Fang Clan.</p><br/><p>On the way home, Meng Hao saw snowflakes filling the sky, and colorful lanterns and streamers decorating the homes he passed. Children played happily, and a feeling of warmth and joy filled the air. Lights burned brightly in all the windows.</p><br/><p>“Is it New Year already?” Meng Hao suddenly stopped in midair. He suddenly realized that he missed his family. During the New Year festival, such feelings tend to grow stronger. He was just about to continue onward when he suddenly thought of something. [1. The New Year referenced here is Chinese New Year or Spring Festival, the Lunar New Year, a very important holiday in Chinese culture in which almost everyone returns to their ancestral hometown and spends time with family]</p><br/><p>“Hey, I got first place in the final arena match! But I never got my prizes!! My Immortal jades! My Immortality Illumination Vine! My Paragon’s blood!!” When he remembered these things, his jaw dropped.</p><br/><p>When he thought of the value of the Immortal jades, how precious the Immortality Illumination Vine was, and how many Immortal jades the Paragon’s blood was worth, his eyes were instantly shot with blood. After a long moment, he clenched his jaw.</p><br/><p>“This won’t do. Those things belong to me! I’m definitely going to be heading to the Nine Seas God World! The Three Great Daoist Societies had better pay me what they owe!!” There was nothing he could do about it now, though, so he had no choice but to sigh in frustration and fly back to the Fang Clan.</p><br/><p>It didn’t take long before the Fang Clan fortress appeared up ahead, decked out with lanterns and colorful banners. The feeling of New Year was heavy in the air. All of a sudden, Meng Hao sensed an aura, not of a true Immortal, but perhaps twenty to thirty percent of that of a true Immortal.</p><br/><p>At the same time, a young woman appeared. She flew out from the Fang Clan and hovered in midair, looking at Meng Hao.</p><br/><p>It was none other than Fang Yu.</p><br/><p>She had emerged from secluded meditation while Meng Hao was in the trial by fire. Her cultivation base had risen all the way to the peak of Dao Seeking. With some guidance from Fang Xiufeng, she was now more powerful than a false Immortal. She also would travel the path of true Immortality, although she would use an Immortality Illumination Vine to do so.</p><br/><p>When Fang Yu saw Meng Hao, her face lit with happiness. Moments later, Meng Hao’s father and mother appeared from behind her, smiles on their faces.</p><br/><p>Actually, Fang Xiufeng had sensed Meng Hao as soon as he had appeared on Planet South Heaven. He gazed at Meng Hao with a loving, although somewhat reserved, smile. As for Meng Hao’s mother, tears were streaming down her face. The past few months in which they hadn’t been certain whether Meng Hao was even alive, had left her haggard from grief.</p><br/><p>“Dad, mom, I’m back,” Meng Hao said, smiling. Then he looked at Fang Yu, and couldn’t help but recall memories from Planet East Victory. This was his big sister, who had protected him when he was small. She had a violent personality, which as a youngster had left him awestruck, but there was a warmth between them that came from being family, and Meng Hao could never forget that.</p><br/><p>“Sis….” he said cautiously. He actually felt a bit guilty. Before, when they had met for the first time, he had been unaware of who she was, and they had actually battled each other. [1. Meng Hao and Fang Yu met for the first time in chapters 309 and 310]</p><br/><p>“When you say it like that, it sounds a bit forced,” she said with an enigmatic smile. After emerging from secluded meditation and learning that Meng Hao had transcended his tribulation, she was very happy. When the two of them were young, and she was forced to watch as he never grew older, it had filled her heart with pain. It was a feeling she would always remember.</p><br/><p>Seeing her own little brother in misery was a misery for her as well. His frustration left her feeling unhappy. She would never forget how she had watched him lying in their mother’s arms, reverting from seven years of age back to infancy. Fang Yu had stood there, hands clenched into fists, tears streaming down her face as she watched.</p><br/><p>She was willing to do anything for her little brother, as long as it would let him be happy, and actually grow up. Back when they were both young, she had stood in front of him on countless occasions, unleashing her violent personality onto any clan members who bullied him.</p><br/><p>Back on that occasion when they first met, outside the Rebirth Cave in the Southern Domain, she had immediately sensed something familiar about him. Then she saw the mark on his hand, and despite her violent personality, had been shaken inwardly, and had barely been able to hold back from crying.</p><br/><p>In that instant, she recalled all the hardships her parents had endured, and then suddenly feared that Meng Hao might notice something about her, so she had deliberately spoken some confusing and meaningless words to throw him off the trail. From that day forward, she had been looking forward to the day when their whole family would finally be reunited.</p><br/><p>Of course, there was also the time she ran into him in the ancient Demon Immortal Sect. At that time, she had an even stronger sense of family. After all, he was her little brother…. [2. The events referred to in the Demon Immortal Sect started around chapter 561. Fang Yu appeared in and interacted with Meng Hao in several chapters throughout the arc]</p><br/><p>She couldn’t refrain from forcing him to call her ‘big sis.’ Later, some of the other Fang Clan members had scorned Meng Hao, which had caused her rage to flare. She had even been worried that Meng Hao wouldn’t be able to find a host body, and had given one of the Fang Clan’s host bodies to him.</p><br/><p>There had been one moment in the Demon Immortal Sect when she had been fighting Ji Xiaoxiao and the other Ji Clan Chosen. Meng Hao had turned to leave, and in that moment, she was assured that he didn’t know who she really was. And yet, seeing him leave like that broke her heart.</p><br/><p>Then he had stopped and turned back to look at her fighting the Ji Clan, and she had smiled.</p><br/><p>“It’s not forced!” Meng Hao replied quickly. He smiled. “Sis, you look prettier than ever!”</p><br/><p>“Oh, really?” Fang Yu smiled and began to walk toward him. She lifted her hands up and cracked her knuckles. At the same time, explosive energy surged up, and a brutal aura began to emanate out from her.</p><br/><p>Meng Hao’s face fell, and he began to fall back. Even as he took his first step back, Fang Yu pounced on him like an explosive dragon.</p><br/><p>“Back then you dared to say I was violent!? Well, today I’ll show you what violence really is!”</p><br/><p>Fang Xiufeng and Meng Li looked at each other and smiled. Then they turned to watch Meng Hao getting chased and beaten up by Fang Yu. He didn’t even dare to fight back against her. Fang Xiufeng and Meng Li sighed emotionally.</p><br/><p>“It’s been so long since our whole family… has been together like this.”</p><br/><p>Off in the distance, magical fireworks exploded in the sky. A beautiful New Year had arrived.</p><br/>\n</div>"}