{"title": "Chapter 898: Do You Want to Die?!", "id": 898, "volume": 9, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-898-do-you-want-to-die", "volume_title": "Volume 9", "body": "<h1>Chapter 898: Do You Want to Die?!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 898: Do You Want to Die?!</strong></p><br/><p>“Could it be that as long as something belongs to me, you’ll try to steal it?</p><br/><p>“Your twisted view of life is really my fault. In the future, I’ll do my best to help you correct the error of your ways.” Meng Hao said these things while staring directly at Fang Wei.</p><br/><p>“Do you want to die?” replied Fang Wei coolly.</p><br/><p>“How pretentious of you!” said Meng Hao, walking toward Fang Wei. Each step he took caused the ground to tremble, and his eyes were cold as he stared at Fang Wei.</p><br/><p>“In terms of status,” he continued coldly, “I am the eldest grandson. In terms of bloodline, my Bloodline Gatebeam was 30,000 meters. In terms of clan seniority, I’m your Elder Cousin. It’s my duty to admonish you, and you have no grounds upon which you would be justified in resisting! Since you insist on spewing hogwash, I have to ask you, Fang Wei… do YOU want to die?” Meng Hao’s words were incredibly aggressive.</p><br/><p>After he finished speaking, he turned to the Grand Elder and clasped his hands.</p><br/><p>“Grand Elder, Fang Wei has shown disrespect to his elders, which undermines the norms of etiquette, a sin that neither Heaven nor Earth can forgive. For a clan to prosper, it must have a standard of conduct. Given the Fang Clan’s status as a great clan of the Ninth Mountain and Sea, the rules must be stricter than others. Respect for seniority is the standard which must be met for the future growth of the clan!</p><br/><p>“Do the clan rules permit someone to act in this way? If not, then he has violated clan rules. What might the punishment be for such actions?” As he spoke, the surrounding Elders’ eyes went wide, especially the direct bloodline Elders, who were greatly shocked.</p><br/><p>When Meng Hao spoke, his words were as sharp as a sword, completely astonishing everyone in the audience. None of them could possibly have imagined that he would speak in such a vicious tone.</p><br/><p>Of course, they didn’t know that Meng Hao had been raised as a scholar, and loved to spar with words. Back in his days as an alchemist, he had engaged in a debate that had resulted in his opponent’s Dao Heart becoming unstable. From that, it could be seen how sharp his words could be.</p><br/><p>Furthermore, he had verbally dueled with the meat jelly on many occasions, which could be considered further training in debate.</p><br/><p>It was at this point that Fang Wei’s father, who sat off to the side of the Elders, suddenly spoke, his voice cold.</p><br/><p>“Fang Hao, clan rules prohibit internal conflicts. How could you speak such malicious words? You need to spend some time in self-examination! Men, take him away!”</p><br/><p>Meng Hao showed no fear in response, but instead, began to laugh uproariously. Now that he was here in the Fang Clan, and could now take advantage of the Clan’s regulations and ordinances, he would not allow anyone to dare try to openly put him at a disadvantage.</p><br/><p>“2nd Uncle, correct? Were my words really malicious? I said that I beat him too severely when we were young. That is a simple fact. I said that he has become abnormal, an expression of regret. Then I said that I wish to help him correct the error of his ways. As his Elder Cousin, all of this is a condemnation of myself!</p><br/><p>“As his senior, it is my responsibility, in fact, my DUTY to help my Junior Cousin. Therefore, I am unsure as to why 2nd Uncle would call such words malicious.”</p><br/><p>Fang Wei’s father frowned. “How nasty and derogatory! Your histrionics will do you no good! Facts are facts!”</p><br/><p>“I’ll tell you the facts,” retorted Meng Hao. “This headstrong Junior Cousin wants to steal my Immortal’s cave. He also wants to steal my medicinal pills. Despite that, I said nothing. He is the Junior and I am the Senior. If I ALLOW him to have those things, then very well, he can have them.</p><br/><p>“However, the reason that I chided him was because he also expressed his desire to steal the Immortality Illumination Vine left for me by my father. Since that item belongs to my father, how could a Junior member of the clan possibly steal it? Can a Junior member of the clan actually be permitted to steal things that belong to someone of the Senior generation? 2nd Uncle, is it possible that you actually approve of such a thing?</p><br/><p>“Isn’t such behavior a violation of clan rules? It certainly does not respect the rules of seniority, does it? Aren’t such actions tantamount to open rebellion?</p><br/><p>“In the Ninth Mountain and Sea, what clan exists that permits members of the Junior generation to steal things from the Senior generation? What clan exists that believes such a thing to be proper? Furthermore, what clan exists that intentionally misrepresents the facts, inverting right and wrong?</p><br/><p>“2nd Uncle, please, enlighten me. Junior’s experience is limited, and I’m really unsure of the answers to these questions.” Meng Hao flicked his sleeve and looked over at Fang Wei’s father, his eyes glittering.</p><br/><p>“You….” Fang Wei’s father looked enraged, but he apparently couldn’t think of anything to say in response.</p><br/><p>The temple hall was completely silent. The Elders who had originally maintained a position of neutrality were now looking over curiously at Meng Hao.</p><br/><p>19th Uncle’s son, Fang Xi, was also there in the crowd, staring blankly at Meng Hao. He had never imagined that Meng Hao could speak so incisively.</p><br/><p>Meng Hao had just taken a small matter and turned it into something important, had transformed a relatively minor event into a huge one. He had struck people speechless. Such skill in speaking was something that Fang Xi had never encountered before in his life, and it caused his eyes to shine brightly.</p><br/><p>“Enough!” said Grand Elder Fang Tongtian. He frowned and swished his sleeve.</p><br/><p>“We’re all members of the same clan; there’s no need for bickering. The matter has passed and will not be brought up again. Hao’er, the Immortality Illumination Vine left behind by your father will be given to you.” With that, he made a grasping motion, causing a bag of holding to suddenly appear in his hand. He tossed it out toward Meng Hao, who grabbed it and scanned it with spiritual sense. Inside, he could see the Immortality Illumination Vine, roughly three inches long and as thick as a finger.</p><br/><p>Killing intent flickered in Fang Wei’s eyes. He gave a cold harrumph, then stood up and walked out of the temple, completely ignoring Meng Hao in the process. Rustling sounds could be heard as his more than one hundred followers left with him. Each and every one glared menacingly at Meng Hao as they left, especially Fang Yunyi, whose eyes were filled with intense venom.</p><br/><p>Meng Hao ignored Fang Wei, as if he wasn’t worth looking at. He clasped hands and bowed to the Grand Elder, then looked back at the map of Immortal’s caves. As of now, he was determined to rise to prominence in the Fang Clan, all for the sake of his father and mother. As such, he would need to make some preparations.</p><br/><p>“Dad and mom want me to fight hard and excel for their sakes, and they want me to make sure all the people in the Fang Clan see it…. As their son, that’s exactly what I’m going to do!”</p><br/><p>After looking over the Immortal’s caves, he found one that didn’t seem very extraordinary at all, although it did have a nicely-sized medicinal plant garden.</p><br/><p>“Grand Elder, I’ll take this Immortal’s cave.”</p><br/><p>The Grand Elder nodded and performed an incantation gesture. Immediately, a command medallion appeared and flew out toward Meng Hao.</p><br/><p>“Very well. This clan meeting will now adjourn.” Next, he looked kindly at Meng Hao and said, “Hao’er, in two days, come back here, and I will personally give you your Nirvana Fruits. There’s no need to feel anxious about that.” It seemed the Grand Elder approved of how Meng Hao had behaved during the meeting.</p><br/><p>As the crowds dispersed, 19th Uncle called Meng Hao over and introduced him to the Elders of the direct bloodline. When they looked at him, emotional expressions of reminiscence could be seen on their faces.</p><br/><p>Some of these men had watched Meng Hao’s father grow up, and had even held Meng Hao when he was a baby. They began to talk, and when Meng Hao’s father was mentioned, they sighed. Then the subject of his grandfather came up, and their expressions darkened.</p><br/><p>It was evening before they finally dispersed. Fang Xi volunteered to escort Meng Hao through the ancestral mansion to his Immortal’s cave.</p><br/><p>En route, Fang Xi took him to get his cultivation resources, and the two of them began to chat amiably.</p><br/><p>“Ai, Coz, it’s a good thing you’re finally back. If you hadn’t returned, the direct bloodline would only continue to waste away….</p><br/><p>“You have no idea how angry I’ve been recently. Every time I see Fang Wei, I have to hold back from giving him a taste of my fist! What’s so special about that bastard, huh? His latent talent? His strong bloodline?</p><br/><p>“Hmph. If it weren’t for his father and grandfather, and their Patriarch who occasionally shows his face, their branch would never have started eyeing the ancestral mansion!”</p><br/><p>Fang Xi continued to complain to Meng Hao the entire way.</p><br/><p>“In terms of latent talent, Coz, yours is definitely the best. Your Bloodline Gatebeam was 30,000 meters high! Fang Wei can’t even compare! Let’s see how he continues to claim to be the number one Chosen in the future!</p><br/><p>“And then there’s that good-for-nothing Fang Yunyi. He’s vicious! Coz, in the future, you really need to be careful about him.</p><br/><p>“Come to think of it, Coz, your cultivation base needs some improvement. It’s too bad about those Rainbow Immortal Evanescence Pills. They’re powerful, very powerful. With pills like that, coupled with the power of an Immortality Illumination Vine, it’s easily possible to achieve true Immortal Ascension, and then have a big improvement in your cultivation base.</p><br/><p>“It’s one of the Fang Clan’s miraculous pills. In fact, when you consider medicinal pills for the Spirit Realm, Rainbow Immortal Evanescence Pills are one of the top types of pills in all the Ninth Mountain and Sea!</p><br/><p>“Damn that Fang Wei! If it wasn’t for him, all of those pills would have been yours.” Fang Xi jabbered on and on, almost like the meat jelly. Eventually, he started to tell Meng Hao stories from when he was young, starting from the time he was one year old and going all the way until he was hundreds of years old….</p><br/><p>Meng Hao just smiled and listened to Fang Xi’s grumblings and other explanations about the Fang Clan. From all of this, he now had a much better understanding of the Fang Clan. Gradually, though, Fang Xi’s energetic blabbering turned into nothing more than a buzzing in Meng Hao’s ears.</p><br/><p>Overall, though, Meng Hao could sense the sincerity in Fang Xi.</p><br/><p>As they walked along, they ran into many Fang Clan members, all of whom looked curiously at Meng Hao. Some wore smiles, other scowls. Just about any expression imaginable could be seen.</p><br/><p>“Coz, there’s another important thing. You were really badass back at the temple! I’ve never seen anybody from the Junior generation dare to stand in the middle of the temple and talk like that. Every single thing you said was true and sensible. They were all struck speechless!”</p><br/><p>Night had fallen by the time Fang Xi led Meng Hao to his Immortal’s cave, which was located in the far northern section of the ancestral mansion. It was a quiet, idyllic location that almost looked like a painting. It was night, but the two moons in the sky lit up everything, making it a beautiful scene.</p><br/><p>Meng Hao’s Immortal’s cave was actually a sprawling two-story residence, beautifully decorated and quite luxurious. There was a small lake nearby, and a stone path which led to it. The canopy of stars overhead was reflected by the lake water, making everything sparkle.</p><br/><p>A garden surrounded the little lake, within which grew a variety of medicinal plants. There wasn’t a huge amount, but they still caused a sweet fragrance to fill the air. Lotuses could be seen floating on the surface of the lake, and overall, the entire scene looked like something celestial.</p><br/><p>Meng Hao looked around and was quite content. Although this place might not count as very special when compared to all of the other Immortal’s caves in the Fang Clan’s ancestral mansion, in the outside world, it would be considered one of the best.</p><br/><p>There was abundant spiritual energy here, as well as Immortal qi. Meng Hao walked into the courtyard and then took a deep breath; he really liked this place.</p><br/><p>“Coz,” said Fang Xi, “about your gift of the tongue… do you think you could teach me about that? My dad says that I jabber all the time, but that nothing I say makes sense. He’s even beaten me on more than one occasion because of it. Coz, could you help me out? Please?” Fang Xi’s tone was one of piteous entreaty.</p><br/><p>Meng Hao turned to look at Fang Xi and smiled.</p><br/><p>“Are you sure?”</p><br/><p>Fang Xi’s expression brightened, and he nodded.</p><br/><p>Meng Hao hesitated for a moment, but seeing Fang Xi’s hopeful expression, he couldn’t help but sigh. Tapping his bag of holding, he caused the meat jelly to appear in his hand.</p><br/><p>The meat jelly immediately pouted and then began to jabber discontentedly.</p><br/><p>“Meng Hao, you bastard, you deserve to die a horrible death! You dumped me and then exploited me! Wait. No. You exploited me then dumped me! Y-y-you, you’re immoral! You’re shameless! You’re a big bully! I’m going to convert you!”</p><br/><p>“Fang Xi,” said Meng Hao, clearing his throat, “keep coming to visit me. Every time you do, you can chat with this thingamajig. When you can hold a conversation with it for three days, you’ll be a badass.”</p><br/>\n</div>"}