{"title": "Chapter 905: Plant and Vegetation Throwdown!", "id": 905, "volume": 10, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-905-plant-and-vegetation-throwdown", "volume_title": "Volume 10", "body": "<h1>Chapter 905: Plant and Vegetation Throwdown!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 905: Plant and Vegetation Throwdown!</strong></p><br/><p>Alchemist Lodge Peak #7191 was now surrounded by tens of thousands of apprentice alchemists, all of whom were staring fixedly at Meng Hao and Fang Xuzhong on the platform.</p><br/><p>It was especially interesting that there was a wager between the two of them, and the apprentice alchemists couldn’t wait to see what happened. Many could read between the lines, and knew that Fang Xuzhong had intentionally come here to stir up trouble with Meng Hao. However, considering that it didn’t affect them personally, those people were even more excited than the others. They wanted to see who exactly was better when it came to knowledge of plants and vegetation.</p><br/><p>If Meng Hao hadn’t just given a three-day lecture on the subject, the apprentice alchemists would not have hesitated even a moment to say that Fang Xuzhong would prevail. Now, however… it was hard to say.</p><br/><p>Meng Hao looked extremely bashful as he embarrassedly scanned Fang Xhuzhong’s bag of holding with divine sense. Then he licked his lips and looked back over at Fang Xuzhong. He felt luckier with every minute that passed. He had never imagined that, having only been in the Dao of Alchemy Division for a few days, there would already be someone who came looking to deliver up spirit stones.</p><br/><p>When he realized what he was thinking, he suddenly felt a bit more embarrassed.</p><br/><p>Seeing all the eyes focused on him, Fang Xuzhong snorted coldly. He had been immersed in the Dao of alchemy for many years, and was highly proficient when it came to skill with plants and vegetation. As the saying went, his proverbial pill furnace glowed with the bright green of perfection. Actually, he was already qualified to be promoted to a tier 3 alchemist, and as such, was absolutely confident in being able to win the bet.</p><br/><p>Were it not for the fact that he was badly in need of alchemy resources, he would never have come here. After all, participating in something like this was really beneath his status.</p><br/><p>His expression proud and lofty, Fang Xuzhong raised his hand high and then smacked his bag of holding. Instantly, a medicinal plant appeared in his hand. It was green, and looked no different from an ordinary blade of grass. He waved his hand, sending it flying through the air to hover in front of Meng Hao.</p><br/><p>“I won’t make things hard for you,” he said coolly. “I’ll show you three medicinal plants. You simply have to tell me their names and properties. This is the first one.” From his perspective, this plant in and of itself was enough to stump his opponent. He planned to show this Fang Hao the height of the Heavens and the depths of the Earth. He would help Fang Hao to know exactly how vastly separated the two of them were in terms of qualifications.</p><br/><p>As a tier 2 alchemist, he wanted to ensure a quick victory. Considering his status in the Dao of Alchemy Division, knocking his opponent out of the competition with a single blow would be the most suitable result.</p><br/><p>Fang Xuzhong smiled coldly, swished his sleeve, then clasped his hands behind his back and looked arrogantly at Meng Hao. “Forget about this guy,” he thought. “Not even a tier 1 alchemist would recognize this medicinal plant.”</p><br/><p>Meng Hao was smiling just as before as he looked at the medicinal plant.</p><br/><p>All of the apprentice alchemists were also staring at it, trying to guess what it was. The tier 1 alchemists in the area were also digging through their memories, and yet, none of them could recall even the slightest scrap of information about a plant like this.</p><br/><p>Immediately, a buzz of conversation rose up.</p><br/><p>“This can’t be right. That medicinal plant doesn’t look special at all. It doesn’t even look like a medicinal plant! Is it just an ordinary plant from the mortal world?”</p><br/><p>“I might not have incredible skill when it comes to plants and vegetation, but I know a bit. However, this plant… is something I’ve never seen before.”</p><br/><p>“He definitely deserves to be a tier 2 alchemist. He pulled out a medicinal plant that nobody even recognizes!”</p><br/><p>Fang Xuzhong looked haughtily over at Meng Hao.</p><br/><p>“If you don’t recognize it, then kneel upon this mountain peak for three days, and then screw off.” Almost as soon as the words left his mouth, however, Meng Hao suddenly looked up at him and chuckled.</p><br/><p>“Alchemist Fang, I never imagined that you would actually possess this type of Wind Spirit Grass. Such a plant is useless for medicinal purposes. However, when struck by a strong wind, it will blossom with a Spirit Flower. That flower can bloom with up to seven colors, with seven being the optimal number. That medicinal flower is one of the most important ingredients used when concocting wind-type medicinal pills.</p><br/><p>“Unfortunately, Alchemist Fang, this particular plant of yours has a lot of imperfections. It will only produce a three-colored flower.”</p><br/><p>Meng Hao’s words left the surrounding apprentice alchemists in shock. Even the tier 1 alchemists were astonished. They had never even heard of Wind Spirit Grass, although many knew of Wind Spirit Flower. At this point, they suddenly had an epiphany, and realized the origin of Wind Spirit Flowers.</p><br/><p>It was at this point that Meng Hao blew onto the blade of grass. Because of the level of his cultivation base, that breath was like a gale force wind. A rumbling sound filled the area, and then the blade of grass began to wriggle and sway back and forth. Everyone watched as a three-colored flower bloomed at the tip of the blade, and a medicinal aroma filled the area.</p><br/><p>“It really has three colors!”</p><br/><p>“Fang Hao’s skill with plants and vegetation is astonishing after all! He didn’t just recognize that plant, he was able to judge its nature entirely!”</p><br/><p>The surrounding crowds were in an uproar. The tier 1 alchemists were now looking at Meng Hao with complete and utter respect. In the Fang Clan’s Dao of Alchemy Division, powerful alchemists were treated with fervor and veneration.</p><br/><p>Fang Xuzhong’s eyes widened, then he stared dead at Meng Hao, and a serious look spread out across his face. The Wind Spirit Grass might seem like an ordinary medicinal plant, but it was actually a line of demarcation when it came to determining skill with plants and vegetation. Even many tier 2 alchemists wouldn’t know much about it. Even more shocking to him was how his opponent had identified how many colors the flower would bloom in. That was something that only tier 3 alchemists should be able to do.</p><br/><p>“So, this guy has some skill after all,” he thought. “It seems I need to take things a bit more seriously.” Fang Xuzhong waved his hand to pull the Wind Spirit Grass back into his bag of holding, from which he then produced another medicinal plant.</p><br/><p>This plant had more than one hundred leaves, which formed the shape of a triangle. The stamen of the plant’s flowers were long and almost looked like tentacles as they drifted back and forth.</p><br/><p>A single look at this medicinal plant, and it was clear that it was beyond ordinary. Everyone looking at it also felt a faint sense of danger.</p><br/><p>“In order to avoid any accusations of bullying,” said Fang Xuzhong, “I will not require you to explain the properties of this plant. Merely telling me its name will suffice.” He stared icily at Meng Hao. Although he didn’t say anything further, inside, he was laughing coldly. In his opinion, he had underestimated his opponent a bit when it came to the first medicinal plant. However, with this second one, he was completely confident that he could secure victory.</p><br/><p>“When I first got this medicinal plant,” he thought, “I didn’t have any idea what it was. It was personally grown by one of the tier 5 alchemists, and I had to spend a small fortune to acquire it.</p><br/><p>“It’s completely one-of-a-kind. Not a single manual of plants and vegetation will contain a description of it. It was grafted together from a variety of other medicinal plants, using the top-secret technique of a tier 5 alchemist.</p><br/><p>“I simply can’t believe that an inconsequential apprentice alchemist will be able to identify it!” Smiling coldly, Fan Xuzhong lifted his chin and stood there, hands clasped behind his back as he looked at Meng Hao.</p><br/><p>He could visualize his opponent with tears streaming down his cheeks, racking his brains as he tried to identify the plant. He would probably spout a bunch of nonsense, for which Fan Xuzhong had already prepared appropriate words of response.</p><br/><p>Everything was completely quiet. All eyes were focused on the medicinal plant. Because of the vague sense of danger it emanated, everyone was now paying close attention to it. Gradually, the medicinal aroma wafting out from the plant vitalized the minds of all present.</p><br/><p>“What medicinal plant is that!?!?”</p><br/><p>“I’m pretty sure I’ve never seen it before, although something about it seems familiar. How strange!”</p><br/><p>Even the tier 1 alchemists were all frowning and trying desperately to recall what this plant was. Some people even pulled out jade slips containing information about plants and vegetation, which they began to search through for clues.</p><br/><p>“That plant is even more mysterious than the Wind Spirit Grass from before!!” As the members of the audience began to speculate further about the plant, Meng Hao looked at it, and his eyes began to shine.</p><br/><p>“I never imagined that the Fang Clan’s Dao of Alchemy Division would be so skilled with plants and vegetation,” he said. Immediately, the audience went silent, and everyone looked at Meng Hao.</p><br/><p>Fang Xuzhong laughed coldly.</p><br/><p>“Can you identify it, or not? There’s no need to be deliberately cryptic.”</p><br/><p>Meng Hao chuckled in response.</p><br/><p>“This medicinal plant is something I doubt you could grow,” he said. When the onlookers heard this, they didn’t think too much of it. However, Fang Xuzhong’s heart began to thump.</p><br/><p>“It has no name,” Meng Hao continued slowly. “Or, perhaps you could say… the only person qualified to name it, is the alchemist who created it.”</p><br/><p>When Fan Xuzhong heard this, his face flickered. Meng Hao’s two sentences were like lightning bolts striking his brain. How could he ever have imagined that his opponent would be able to pick up on the clues with just a glance? He quickly prepared to retrieve the plant and put it away, since Meng Hao’s first two sentences had already revealed the truth regarding the name of the plant.</p><br/><p>He recalled how the first time he had ever laid eyes on this plant years ago, he had stared in shock. To him, it had seemed like some strange and miraculous item. It wasn’t until the tier 5 alchemist explained the plant to him that he understood the truth, and prostrated himself in admiration.</p><br/><p>“Just how skilled is this Fang Hao?” he thought. “He actually recognized the plant! Dammit! No, I really have to pull a fast one!” Feeling more on guard than ever, he immediately had the urge to slander his opponent. However, in the Dao of Alchemy Division, reputation was extremely important, and with so many people looking on, word would spread quickly.</p><br/><p>Fang Xuzhong gritted his teeth, and was just about to retrieve the medicinal plant and put it away when suddenly, Meng Hao started talking again.</p><br/><p>“This is a medicinal plant produced by a grafting technique. Let me see…. It seems to be grafted from nineteen different medicinal plants. Those nineteen plants consist of Watershed Root, Spiritdream Grass, Mount Heaven Leaf, Mortality Bloom….” Meng Hao calmly listed all nineteen varieties of plants.</p><br/><p>Fang Xuzhong’s eyes widened, and he began to pant. He subconsciously staggered backward several steps, his expression one of disbelief. As for the next plant he had planned to pull out, Meng Hao had just mentioned it in the list he had rattled off, so Fang Xuzhong had no choice but to abandon any idea of using it. How could he have ever imagined that this person could possibly…</p><br/><p>Could possibly name all of the plants that made up the graft! Fang Xuzhong’s mind was spinning. Of course, he couldn’t be absolutely certain as to whether what Meng Hao had said was completely correct or not, because only the tier 5 alchemist who created it would be able to verify it.</p><br/><p>After all, this was… a top secret technique!</p><br/><p>Eventually Meng Hao reached his conclusiion and said, “...afterwards, use the magic of the four seasons, invert Yin and Yang, graft three plants simultaneously. Combine all nineteen medicinal plants, do not allow them to be touched by the sun, allow the Yin qi to coalesce, which completes the process.</p><br/><p>“Because this medical plant was created by grafting nineteen other plants together, if it is used in pill concocting, there are many possible transformations. An ordinary alchemist would probably be incapable of using it to concoct anything at all. Presumably, the alchemist who gave you this medicinal plant also gave you a pill formula specifically designed to be used with it.</p><br/><p>“Tell me, Alchemist Fang, am I correct?” Meng Hao smiled and looked at Fang Xuzhong.</p><br/><p>Meng Hao’s words were followed by deathly silence. Everyone was looking at Fang Xuzhong, whose face flickered back and forth between various emotions. He felt like lightning was crashing around in his head, and without realizing it, he stepped backward. He was now looking at Meng Hao with wide eyes, as if he were some type of evil spirit.</p><br/>\n</div>"}