{"title": "Chapter 903: A Brief Glimpse of Cutting Edge Talent", "id": 903, "volume": 10, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-903-a-brief-glimpse-of-cutting-edge-talent", "volume_title": "Volume 10", "body": "<h1>Chapter 903: A Brief Glimpse of Cutting Edge Talent</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 903: A Brief Glimpse of Cutting Edge Talent</strong></p><br/><p>The mountains that made up the Fang Clan’s Dao of Alchemy Division stretched out boundlessly in all directions. There were 10,000 mountains in the inner region that were occupied by alchemists, which were surrounded by 100,000 additional mountains.</p><br/><p>The higher a given alchemist’s ranking, the closer that alchemist could get to the center of all the mountains.</p><br/><p>The 100,000 outer mountains were divided into ten districts, which were areas in which apprentice alchemists studied. They were known as Alchemy Lodges, and were comprised of 10,000 peaks each.</p><br/><p>Meng Hao’s destination was Alchemy Lodge Peak #7191.</p><br/><p>Thankfully, there was no prohibition on flight here, otherwise it would have taken Meng Hao a very long time to reach his destination. He shot forward at top speed and, with the help of the map, soon reached an ancient and primitive-looking mountain peak.</p><br/><p>The peak was not sharp and tall, and in fact, it appeared as if the top had been directly cut off to create what looked like a huge public square. Currently, several hundred people sat cross-legged surrounding a raised central platform, listening to an old man give a lecture about medicinal plants. He wore a long robe, the collar of which was embroidered with a single golden dragon.</p><br/><p>The old man rambled on and on, occasionally holding out a medicinal plant. Every so often, one of those plants would bloom, and would be surrounded by multicolored light. The audience members were apparently experiencing significant enlightenment as they watched.</p><br/><p>In the audience of hundreds of cultivators could be seen men and women, old people and young, all of whom were members of the Fang Clan, come here to study pill concocting. Of course, everyone had to start out as an apprentice alchemist.</p><br/><p>No one paid much attention to Meng Hao’s arrival. He sat down off to the side to listen to the old man’s lecture.</p><br/><p>“This is Godshine Flower,” the old man said coolly, “which is also known as Sunbirth Leaf. On any given day, its medicinal strength is at its peak at high noon. Make sure to pay close attention to this flower’s vein pattern, because it looks very similar to Godrain Flower.” With that, he pulled out another medicinal plant and began to introduce it.</p><br/><p>Occasionally, the old man would look out at the crowd, and when he saw the earnest expressions of the faces of the apprentice alchemists, he felt quite a sense of accomplishment.</p><br/><p>He was a mere tier 1 alchemist, and had virtually no hope of ever being promoted for the rest of this life. Therefore, he had been assigned to deliver lectures on plants and vegetation to the apprentice alchemists. It was only during times like these that he could enjoy the sensation of a crowd looking at him enviously.</p><br/><p>Even as he continued his lecture, a glimmer of displeasure suddenly flickered within him. He had just seen a young man in the audience frowning at what he was saying. At first, he didn’t pay the matter much attention, but over the course of the next two hours, he realized that the young man had frowned seven or eight times.</p><br/><p>That made the old man more and more irritated. He had been giving lectures here for many years, and every single apprentice alchemist looked at him with deep respect and courtesy. Even Chosen from other clans’ Dao of Alchemy Divisions would recognize his authority in this place.</p><br/><p>The old man had never encountered someone like Meng Hao, who frowned at what he said. The more he saw this happening, the more offensive he found it.</p><br/><p>Meng Hao continued to listen to the lecture. Eventually the old man began to talk about Brightmoon Vine, and Meng Hao frowned again. He could clearly tell that this old man had an incorrect understanding of plants and vegetation. He was making mistakes that, if the audience of apprentice alchemists paid attention to, could cause problems for them in the future. They might even pay heavy prices before they understood the truth.</p><br/><p>“This type of tree grows in the frigid weather of regions that were once extremely hot. It is called Midwinter Tree. When it is burned, it can produce a type of sap that is considered a precious treasure, the name of which is Midwinter Sap!” As soon as he finished speaking, he saw Meng Hao frown yet again. That made it more than ten times in which Meng Hao had frowned. At long last, the old man couldn’t take it any more. Face cold, he pointed directly at Meng Hao.</p><br/><p>“You! What’s your name!?” he asked, his voice rumbling like thunder. The surrounding apprentice alchemists had just been listening to his lecture in a virtual trance, and were instantly shocked. They quickly followed the line of the man’s finger to see Meng Hao.</p><br/><p>“Meng Hao,” replied Meng Hao coolly. “Or, you can also call me Fang Hao.”</p><br/><p>“You have no regard for your elders and betters! In my role as an alchemist, I will ask you, an apprentice alchemist, a question. Let’s see if you dare to stand up and answer!” The old man chuckled coldly.</p><br/><p>Meng Hao had no desire to get into an argument with the old man, so he casually stood up.</p><br/><p>“Do you acknowledge your error?” the old man demanded. “Well, too late! Let me ask you: why was your attention wandering during my lecture? Why did you keep frowning? If you don’t enjoy listening to my lectures here, then you can just get lost! You’re not permitted to stick around here and annoy people!</p><br/><p>“You’re name’s Fang Hao, huh? From now on, you are not welcome here!” He snorted coldly. This old man was not a tolerant person, so Meng Hao’s continued frowning had really been a provocation, or even a challenge.</p><br/><p>Meng Hao frowned, and an icy coldness could be seen within his eyes. He looked at the old man for a moment, but didn’t say anything. As he turned to leave, the old man snorted again.</p><br/><p>“Did I say you could leave? If you can’t explain why you were frowning just now, then I’ll throw you out! You can’t just walk away!”</p><br/><p>Meng Hao stopped in place and slowly looked back at the old man. Then, he began to speak, his voice calm.</p><br/><p>“The first time I frowned was when you mentioned Sunbirth Leaf. Although that leaf’s medicinal strength is indeed greatest at high noon, that is not a suitable time to harvest it, let alone to use it to concoct medicine. At that time, the Yang energy in the leaf is too intense. If you concoct medicine with it then, and it is not the primary ingredient, then it doesn’t matter. However, if you use it as the primary ingredient, the concoction will fail! The correct time to harvest said leaf is at a specific time AFTER high noon!”</p><br/><p>Meng Hao’s voice boomed out in all directions as he took a step forward toward the man.</p><br/><p>The old man’s face darkened, and he was just about to say something when Meng Hao continued to speak.</p><br/><p>“The second time I frowned was when you talked about Groundfall Root. What you said was completely incorrect. You said that Groundfall Root contains an aura of rot. However, true Groundfall Root is the part that connects the plant to the ground. Half an inch is underground, the other half is above ground! If you harvest the incorrect part of the plant, then any pill you concoct will be black and full of toxins. It would be detrimental to anyone who consumed it.”</p><br/><p>As he spoke, he took another step forward, and his energy surged.</p><br/><p>The old man’s face flickered. When it came to Sunbirth Leaf, he had an argument that he could make in his defense. But when it came to Groundfall Root, as soon as the words left Meng Hao’s mouth, his heart began to thump. He suddenly remembered that when he had attempted to concoct a pill with Groundfall Root in the past, the result was exactly as Meng Hao had described.</p><br/><p>“The third time I frowned was when you brought up Tenderwillow Branch. The first half of what you said about it was absolutely correct. If you take nine of its leaves and refine them together, it will form a true Tenderwillow Leaf. However, you missed something very important; it is vital to collect some of the soil from beneath the tree itself and combine that into the mixture. The reason is that the soil in areas where Tenderwillow Branches grow, when compounded with wood and metallic elements, can purify the metal portion, leaving behind a newborn plant!”</p><br/><p>As Meng Hao took another step forward, the old man’s face flickered again. Beads of sweat broke out on his forehead, and he subconsciously took a step backward. As Meng Hao neared, the man sensed an amorphous energy that filled him with fear.</p><br/><p>Most importantly of all, what Meng Hao had said about the Tenderwillow Leaf left him completely shocked. It was actually the first time he had heard of such a thing. However, it suddenly caused him to think back to a time when he had been invited to visit another alchemist, who at the time happened to be concocting a pill with Tenderwillow Leaf. He had actually put some soil into the mixture. At the time, the old man had been confused as to why he would do that, but too embarrassed to ask about it.</p><br/><p>“The fourth time I frowned was when you spoke of Cloudsipping Grass. How could that grass possibly grow inside of clouds, which is exactly what you said? That’s nothing but sheer and utter nonsense! It’s a grass that grows in mountain streams, surrounded by wisps of cloud and mist. THAT’S why it’s called Cloudsipping Grass!” The next step Meng Hao took left the old man completely ashen-faced. Yet again, he subconsciously stepped back. He suddenly remembered that Cloudsipping Grass was exactly as Meng Hao had just described it. When he had talked about it earlier, he had intentionally spouted some hogwash; his explanation actually had nothing to do with reality. That was because he had no idea what the plant really was.</p><br/><p>“The fifth time I frowned was when you talked about the Tree of Nine Eyes….</p><br/><p>“The sixth time I frowned was because of what you said about Gauzewood Moss….</p><br/><p>“The seventh time I frowned….”</p><br/><p>Every time he spoke, Meng Hao took another step forward, and the old man’s face grew paler as he fell back in retreat. His expression soon became one of panic, which caused the surrounding apprentice alchemists to stare in shock.</p><br/><p>“The twelfth time I frowned was because you said that Brightmoon Vines have flowers that bloom with two different colors. One color is toxic, the other isn’t. You spoke of the plant’s medicinal properties, but then never explained how to tell the difference between the two. That is why I frowned!” Meng Hao advanced with each of his explanations, and the old man fell back. By this point, Meng Hao was now standing on the platform.</p><br/><p>“The last time I frowned was when you talked about Midwinter Sap. I have no idea from whom you learned about plants and vegetation, but even though Midwinter Sap can be produced by burning it with a cultivation flame, that will produce an inferior product. The highest quality Midwinter Sap requires magically induced lightning to create!” With that, Meng Hao flicked his sleeve.</p><br/><p>Voice echoing, he continued, “The Dao of alchemy is vast and limitless. The number of medicinal plants is like the water in the sea. No one can remember all of them, and the mistakes you made are not unforgivable. However… we are in our clan’s Dao of Alchemy Division. The apprentice alchemists here to listen to your lecture are all fellow clan members. If you know something, then talk about it. If there’s something you’re not clear about, no one will make fun of you for that. That being the case, there is absolutely no reason to make up random garbage! If you do that, these apprentice alchemists might end up paying with their lives because of the mistakes they will make in the future!”</p><br/><p>Meng Hao’s words were spoken with little courtesy. Originally, he had intended to simply leave. However, the old man had aggressively provoked him, and as such, he laid bare all of the reasons why he had frowned earlier.</p><br/><p>The old man opened his mouth to respond, but there was nothing he could say. His mind spun as he realized that there were indeed aspects of his speech in which he didn’t know what he was talking about. However, he had fallen into a habit of lecturing on those things merely based on his own personal experience and judgement.</p><br/><p>Currently, his face was as pale as death, and he was trembling. There was nothing he could do to refute Meng Hao’s stern criticism. In fact, for some reason, the feeling he got when he looked at Meng Hao was the same feeling of awe he’d had years ago when he was an apprentice alchemist looking at the full alchemists.</p><br/><p>Everything Meng Hao had said left him shaken, and actually answered many questions that he himself had wondered about.</p><br/><p>In the silence that followed, the surrounding hundreds of Fang Clan apprentice alchemists began to talk.</p><br/><p>“Fang Hao…. I just remembered! He’s the one with the 30,000-meter Bloodline Gatebeam! His bloodline is inconceivably strong! It’s that Fang Hao!!”</p><br/><p>“It’s really him! He came from Planet South Heaven. Supposedly, he experienced some kind of Seventh Year Tribulation. Now he’s back, and not only does he have a strong bloodline, he also managed to silence an alchemist on the subject of plants and vegetation!”</p><br/><p>“He’s the eldest grandson of the direct bloodline! His bloodline is even stronger than Prince Wei’s. I can’t believe he’s here in the Dao of Alchemy Division!”</p><br/><p>“After hearing him talk about all those different medicinal plants, I suddenly feel like I understand them far better than I did before! Could it be that Fang Hao is also an alchemist?”</p><br/><p>Meng Hao was just about to leave when the trembling old man stepped forward. Clasping hands, he bowed deeply to Meng Hao.</p><br/><p>“Alchemist Fang. Sir, you were right to chide me. My name is Fang Qun, and everything was my fault. Would you mind staying for a moment and clearing up some of my confusion, Alchemist Fang? I… I actually have some questions about plants and vegetation that I hope you can help me with.” Although Fang Qun seemed a bit embarrassed to say these things, he didn’t hesitate to speak them. [1. Fang Qun’s name in Chinese is  fāng qún. Qun means ‘group’]</p><br/><p>His words caused instant excitement among the surrounding apprentice alchemists. They could clearly see that Meng Hao’s skill with plants and vegetation far exceeded that of Fang Qun.</p><br/><p>The idea of being able to hear a lecture by an alchemist like that was a rare opportunity, and true good fortune.</p><br/><p>“Please, Alchemist Fang, stay for a bit. Give us some pointers!!”</p><br/><p>“Alchemist Fang, we have a lot of questions about plants and vegetation! For the sake of us fellow clan members, could you stay and dispel some of our confusion…?”</p><br/><p>Everyone began talking at once, clasping hands and bowing. Meng Hao stopped in his tracks and looked around for a moment before nodding.</p><br/><p>A cheer of excitement rose up from the enthusiastic crowd.</p><br/>\n</div>"}