{"title": "Chapter 910: Rocking the Pavilion", "id": 910, "volume": 10, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-910-rocking-the-pavilion", "volume_title": "Volume 10", "body": "<h1>Chapter 910: Rocking the Pavilion</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 910: Rocking the Pavilion</strong></p><br/><p>The ridicule caused many of the four hundred apprentice alchemists to feel very embarrassed, and even hesitant. They weren’t confident in their chances of success at all, but Meng Hao was very enthusiastic about the whole matter. Were it anyone else, they would think they were intentionally being set up to look bad.</p><br/><p>“Ignore all of them! Trust me!” cried Meng Hao, his expression solemn. The four hundred apprentice alchemists gritted their teeth.</p><br/><p>They still weren’t confident, and yet, were still interested in knowing how far away they were from being able to succeed in the first level of the Medicine Pavilion.</p><br/><p>The sound of the onlookers’ mockery rang out, and there were quite a few people who decided to follow along to see what happened when the group tried to pass the examination in the Medicine Pavilion. There were some tier 1 alchemists who recognized Fang Qun and, when they saw what was going on, shook their heads.</p><br/><p>“Fang Qun is really too shortsighted. Those are apprentice alchemists from Peak #7191, right?”</p><br/><p>“Although it’s true that an alchemist lecturer will receive a reward if any apprentice alchemist from their peak passes the first level of the Medicine Pavilion, these people only have a few years of experience with the Dao of alchemy; they definitely have no chance of succeeding.”</p><br/><p>“I heard that Fang Hao took over for Fang Qun over the past few months to give lectures at Peak #7191. He even started charging merit point fees. What a joke.”</p><br/><p>Surrounded by laughter and ridicule, Fang Qun and the four hundred apprentice alchemists slowly passed into the inner mountains and then appeared in front of the Medicine Pavilion. Although some of the alchemists in the inner mountains noticed them passing by, none took an interest.</p><br/><p>Granted, there were four hundred people all going to take the test together, but that wasn’t something unheard of. After all, there were many, many people who were members of the Dao of Alchemy Division. Furthermore, the Medicine Pavilion was a mysterious place; entrance was not limited to a single person. Even 10,000 could enter at one time if they wished.</p><br/><p>The interior of the pavilion would appear empty to each participant, as if they were taking the test alone.</p><br/><p>The four hundred apprentice alchemists gritted their teeth, paid their merit points, and were about to step into the Medicine Pavilion when Meng Hao took a deep breath and called out.</p><br/><p>“All of you, remember, just do things the way you normally do, and you won’t have any problems!”</p><br/><p>The four hundred apprentice alchemists gave nervous, forced smiles to Meng Hao as they clasped hands and bowed to him. Then, clenching their jaws, they entered the Medicine Pavilion one after another. In the blink of an eye, four hundred people vanished.</p><br/><p>By this point, a few thousand people had gathered to watch, and were all laughing and joking.</p><br/><p>Fang Qun was extremely nervous. Many of the people who had gathered were familiar with him, and he could clearly hear their jokes, but there was nothing he could say in response.</p><br/><p>Meng Hao’s expression was calm as he floated there in midair looking at the Medicine Pavilion.</p><br/><p>Meanwhile, inside, the four hundred apprentice alchemists inside all faced empty mists. Then, 1,000 medicinal plants appeared in front of them, and the vast majority were shocked.</p><br/><p>“Huh? How come it’s exactly like the tests Alchemist Fang gave us?”</p><br/><p>“This seems… actually, kind of simple! I know almost all of these….”</p><br/><p>“One hundred breaths of time? I’ve practiced so many times, I’m used to it!” Virtually all of the apprentice alchemists were shocked and excited. Earlier, they never believed that they could succeed, but now they suddenly felt hope.</p><br/><p>Time passed by…. One thousand breaths.</p><br/><p>Of course, the onlookers were all still laughing about the matter.</p><br/><p>“I really don’t get what Fang Qun is thinking. And as for all those apprentice alchemists, they don’t know the height of the Heavens and the depths of the Earth. There’s no way they can succeed.”</p><br/><p>“Time’s almost up. They’ll be coming out soon. If even one of them succeeds, I’ll beat myself to death.”</p><br/><p>It was at this point that a beam of light appeared on the first level. Instantly, the laughing was silenced.</p><br/><p>“Wow, somebody actually succeeded? Well, I guess out of four hundred people, it was inevitable that someone would get lucky….”</p><br/><p>“It’s possible that person is a Chosen in the Dao of alchemy. It’s a given that someone like that would perform shockingly.”</p><br/><p>Even as the discussions broke out, silence once again reigned as a second beam of light appeared on the first level.</p><br/><p>After that, a third, fourth, and a fifth…. 113 beams of light appeared in the blink of an eye. They formed a dazzling spectacle that could be seen from quite a distance away.</p><br/><p>The onlookers were deathly quiet and stared with gaping mouths. Their eyes were wide and filled with disbelief, and their minds roared.</p><br/><p>This vastly exceeded anything they could have ever imagined, and they could hardly believe it.</p><br/><p>It was at this point that, from within the dazzling lights, four hundred apprentice alchemists appeared. The ones who had succeeded in passing the first level were wild with joy. As for the ones who had met with failure, they weren’t dejected at all. Instead, their eyes shone brightly with hope; they knew that they had come very close to succeeding.</p><br/><p>All of them rushed over to Meng Hao and began crying out excitedly.</p><br/><p>“That was so simple! I actually identified all of them!!”</p><br/><p>“I did it! Hahaha! I passed! I’ve only studied the Dao of alchemy for three years, but I passed the first level of the Medicine Pavilion and I succeeded!!”</p><br/><p>“Thank you, Alchemist Fang! Thank you!!”</p><br/><p>Fang Qun was equally excited.</p><br/><p>Meng Hao smiled widely, then cleared his throat. After glancing over at the shocked onlookers, he looked back at the apprentices and then put a solemn expression onto his face.</p><br/><p>“What’s there to be excited about? What’s the surprise?</p><br/><p>“During these three months, you paid a few hundred merit points to listen to my lectures about plants and vegetation, so the big surprise would be if you didn’t pass the measly first level of the Medicine Pavilion.</p><br/><p>“Now, all of you, tell me. Was it worth it to spend those merit points on listening to my lectures?”</p><br/><p>The instant the question left his mouth, the more than four hundred apprentice alchemists joined their voices into a mighty roar of approval. All of the onlookers began to tremble inwardly.</p><br/><p>Meng Hao laughed heartily, then turned to leave, sure that this matter would quickly turn into a massive wave that swept through all of the Dao of Alchemy Division.</p><br/><p>“I need to stop giving lectures for a few days,” he thought. “I’ll wait a bit… and then there will surely be more people willing to fork over their merit points.” His eyes glittered with anticipation.</p><br/><p>However, Meng Hao had actually underestimated the matter. Over the course of the following days, the Dao of Alchemy Division was struck by a massive tempest. After all, four hundred people had simultaneously taken the Medicine Pavilion examination, and then more than one hundred had successfully passed.</p><br/><p>That in and of itself was not shocking. However, when you took into account the amount of time those test takers had been studying the Dao of alchemy, it was completely astonishing.</p><br/><p>Those who had studied the longest had five years under their belt. The shortest amount of time any of them had studied was three years. An event such as this was enough to cause shock even among the alchemists of the inner mountains.</p><br/><p>It eventually reached the point that the Alchemist Council, which was responsible for the operational affairs of the Dao of Alchemy Division, called a session to discuss the matter. Nineteen alchemists converged in the meeting location; these were the Pavilion Elders of the Dao of Alchemy Division.</p><br/><p>All of these nineteen Pavilion Elders were tier 8 alchemists!</p><br/><p>Deep in the inner mountains, on the cloud-cloaked peak of a tall mountain, was an ancient temple. Ten enormous statues stood guard outside the temple, each one of which represented a glorious past alchemist of the Fang Clan’s Dao of Alchemy Division.</p><br/><p>This was the location where the Alchemist Council held their session. In the main hall of the temple, nineteen enormous seats floated in the air, in the middle of which was an enormous illusory pill cauldron that emanated flickering light.</p><br/><p>The seats were occupied by ancient old men with extraordinary cultivation bases, and whose Dao of alchemy could shake Heaven and Earth. Any one of these old men could be the founding Grandmaster of an alchemic sect.</p><br/><p>“Fang Hao arrived four months ago from Planet South Heaven,” said one of the old men, whose face was covered with wrinkles. He barely seemed to have the energy to open his eyes, but a strong medicinal aroma was eternally attached to him. “With a 30,000-meter Bloodline Gatebeam, he is a Chosen of the clan. Later, the Grand Elder from the main clan arranged for him to come to the Dao of Alchemy Division. Therefore, tier 5 alchemist Fang Huiguo took responsibility to send him to Alchemy Lodge Peak #7191!</p><br/><p>“I made some of my own inquiries, and also got some answers from Fang Huiguo. Fang Huiguo believed that while Fang Hao might have some understanding regarding pill concocting, he was also wildly arrogant. Let’s ignore his subjective presumptions for now. Within two hours of Fang Hao’s arrival at Peak #7191, he discovered twelve areas in which tier 1 alchemist Fang Qun made errors in explaining plants and vegetation. Fang Hao then personally gave a lecture about the subject that attracted tens of thousands of spectators.</p><br/><p>“Tier 2 alchemist Fang Xuzhong was incited by the main clan’s Fang Yunyi to challenge Fang Hao, making a wager regarding plants and vegetation. Fang Hao easily defeating him, instantly identifying the top secret grafting technique of a tier 5 alchemist, and also revealing the collocation technique. I personally went to verify that the collocation technique was indeed correct!</p><br/><p>“Later, he used his plant and vegetation lectures to collect merit points from the audience….” At this point, the old man paused. Some of the other elders began to chuckle.</p><br/><p>“His audience dwindled to only a few hundred people, and his profit ranged only in the tens of thousands of merit points. Unsatisfied, he went to the Medicine Pavilion, where he took the examination 140 times in a row.</p><br/><p>“He didn’t pass, not even once. However, that was because he intentionally failed. After finishing, he organized all the information about plants and vegetation from the exam and began to lecture the apprentice alchemists of Peak #7191 regarding… all of the test material from the first level of the Medicine Pavilion.</p><br/><p>“In this way, by developing a cheating technique and preparing the apprentice alchemists for the test by training them in the test method. He then took four hundred people to the first level of the Medicine Pavilion, and over one hundred of them succeeded.</p><br/><p>“Ladies and Gentlemen, these are the results of my investigation into Fang Hao. What do all of you think?” The old man’s voice was cool the entire time. Even he found Meng Hao to be somewhat amusing.</p><br/><p>People immediately began to voice varying opinions.</p><br/><p>“Is the kid crazy or something? I can’t believe he charged merit points for lectures on plants and vegetation! Why didn’t I think of that when I was his age!?”</p><br/><p>“Amusing, but in the end it was cheating. He should be punished somehow. Perhaps have him clear out the pill rubbish receptacles?”</p><br/><p>“No way! A punishment like that is too severe. Let me handle it. I’ll have him try to concoct some of my pills for me; I’ll show him a thing or two.”</p><br/><p>“That’s not really cheating. To be able to memorize all of the medicinal plants from the first level of the Medicine Pavilion shows that he has a terrifying level of skill with plants and vegetation. I’m curious to see what level he could get to in the pavilion if he really tried.”</p><br/><p>There were differing views on the matter. Some of them thought it was nothing more than a small matter, and were actually interested in Meng Hao. Others thought he was a problem waiting to happen, which should be punished and dealt with immediately.</p><br/><p>Eventually, everyone finished speaking without reaching a consensus. Located in the middle of the nineteen chairs was an old man who wore a long robe and had flowing white hair. He hadn’t spoken the entire time and was instead sitting there with his eyes closed. Finally, his eyes opened, and they seemed to be filled with starlight. It was as if all the heavenly bodies had been shockingly fused together, and existed inside of him.</p><br/><p>He cleared his throat.</p><br/><p>In that moment, all of the other elder alchemists quieted down and looked at the old man with expressions of ardor and veneration.</p><br/><p>“He’s nothing more than a member of the Junior generation,” the old man said slowly. “Let him do as he pleases. Although, the rules of the first level of the Medicine Pavilion will need to be changed.”</p><br/><p>In response to his word, all of the Pavilion Elders bowed their heads in acquiescence.</p><br/><p>As they did, a strange light appeared in the old man’s eyes.</p><br/><p>“Kunlun Society alchemy methods… and some vestiges of the Demon Immortal Sect. Interesting. Very interesting.”</p><br/>\n</div>"}