{"title": "Chapter 912: Hardships Prompt Changes!", "id": 912, "volume": 10, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-912-hardships-prompt-changes", "volume_title": "Volume 10", "body": "<h1>Chapter 912: Hardships Prompt Changes!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 912: Hardships Prompt Changes!</strong></p><br/><p>The Dao of Alchemy Division was undergoing a renaissance in the form of competition. One high level alchemist after another came out from the inner mountains to give lectures, all to get merit points from the apprentice alchemists. The Dao of Alchemy Division was booming, and the bustle was incredible.</p><br/><p>Furthermore, competitive fire is something that exists in all people’s hearts, and although the alchemists didn’t pay too much attention to it, everyone knew that the number of apprentices that could be attracted to any given alchemist’s lecture would show how much influence that alchemist had, as well as the level of their Dao of alchemy.</p><br/><p>Soon, competition between various parties formed. However, the resulting conflicts proceeded according to the Dao of Alchemy Division’s rules governing competition. The result was that in the outer mountains, the apprentice alchemists had to make a daily choice: which alchemist would they go listen to?</p><br/><p>Of course, Meng Hao wasn’t very happy about this. More and more of his audience was being stolen away. In the end, he was only able to keep about 50,000. That was about half of his original audience, which meant that he was losing out on over 100,000 merit points per day.</p><br/><p>It was as if someone was slicing off his skin.</p><br/><p>He could endure it though. After all, his lecture was something unique, and in the end, the apprentice alchemists who listened to his lectures had exponential increases in their confidence in being able to pass the first level of the Medicine Pavilion.</p><br/><p>However, it wasn’t long before Meng Hao became furious. The reason was because, on the mountain just across from him, Peak #7192, a tier 7 alchemist had suddenly appeared to give lectures.</p><br/><p>It was an old woman who rode an enormous five-colored peacock, and whose expression was haughty and arrogant. She was a tier 7 alchemist, someone the apprentice alchemists could only hope to meet in person on accident, and could never go to seek out. She was like a supreme entity to them.</p><br/><p>Up to now, there had only been one tier 7 alchemist who had come out to give lectures. Furthermore, that alchemist did not come out on a daily basis. The 100,000 seats available for those lectures were always the subject of fierce contention. In fact, were there even more seats available, it was certain that more people would attend.</p><br/><p>Now, another tier 7 alchemist appeared. She was very famous in the Dao of Alchemy Division, and when she came to give a lecture right across from Meng Hao, a lot of the alchemists in his audience immediately went over to listen to her.</p><br/><p>In a single day, Meng Hao lost more than half of his current audience, leaving him with only about 20,000 apprentice alchemists. He stood there on the platform, looking at the 100,000 people crowded around that old woman, and ground his teeth angrily.</p><br/><p>“That old granny is doing this on purpose!” he thought with a cold harrumph. The outer mountains were vast, and the lecturing alchemists would always distance themselves from each other, and would certainly never get very close. Considering the old woman intentionally selected this particular location, if someone tried to convince Meng Hao she wasn’t doing it to target him, he would refuse to believe them.</p><br/><p>Any apprentice alchemists who came to listen to Meng Hao would look the scene over and then be forced to make a decision. Would they listen to Meng Hao, or would they choose the tier 7 alchemist? Meng Hao was furious, especially because the old woman only charged one merit point for four hours of lecturing.</p><br/><p>That was half as much as Meng Hao.</p><br/><p>Meng Hao’s audience continued to shrink. Three days later, only about 10,000 remained to listen to him.</p><br/><p>Were that all there were to the matter, it wouldn’t be a big deal. Although his audience had been significantly reduced, he was still making tens of thousands of merit points per day. But over the following days, Meng Hao gradually came to the realization that someone had been imprinting his lecture information onto jade slips, which they were distributing for free! Information people had to pay three merit points to hear personally, could be acquired without charge in this fashion.</p><br/><p>This was a near-fatal blow to Meng Hao’s lectures. Soon, his audience dwindled from 10,000 down to only about 1,000.</p><br/><p>Meng Hao could only watch helplessly as the enterprise he had created was ruined. His audience had started at a peak of 100,000 members, in which he was making hundreds of thousands of merit points per day, and was slowly reduced to only 1,000. Now, he was only making a few thousand merit points per day.</p><br/><p>One day, Meng Hao took a deep breath and ended his lecture. Then he flew over to the old woman, paid some merit points, and began to listen to her speak.</p><br/><p>The old woman sat cross-legged on the platform, her five-colored peacock circling through the air above her. The peacock would occasionally spread its beautiful tail feathers, making it even more magnificent than normal. The old woman spoke indifferently about plants and vegetation, and occasionally mentioned some things about certain techniques of the Dao of alchemy, which would provoke a buzz of comments from the audience. Every single thing the old woman said was original and distinctive.</p><br/><p>Naturally, she noticed Meng Hao arrive, and an expression of scorn appeared on her face. There weren’t even a hundred tier 7 alchemists in the Dao of Alchemy Division, and although she was not the most powerful among that group, but more toward the middle of the pack, she still possessed the skill of a tier 7 alchemist. She had passed the seventh level of the Medicine Pavilion, so it was a simple thing for her to speak on the subject of plants and vegetation.</p><br/><p>Her command of knowledge regarding plants and vegetation was terrifying, and normally speaking, she would never show her face to target Meng Hao in the manner she had. However, a member of her auxiliary branch, someone who she could not easily refuse, had made a request. Of course, she was a member of the Dao of Alchemy Division, which operated under their own system. But when all was said and done, she was still a member of her clan division, and thus had emerged from the inner mountains.</p><br/><p>In her opinion, the gap between herself and Meng Hao was as vast as that between Heaven and Earth. She didn’t even actually have to try; all she had to do was give random lectures, and that would be enough to completely destroy Meng Hao.</p><br/><p>Meng Hao hovered there quietly, listening to the woman speak about plants and vegetation. After enough time passed for an incense stick to burn, his eyes flashed, and he turned to leave. The woman glanced over at him making his way off, and then completely ignored him.</p><br/><p>In her opinion, Meng Hao’s lecture audience would be whittled down until only a few hundred people remained. Eventually, he would be incapable of making any big waves whatsoever.</p><br/><p>The main reason for her confidence was that she had heard a rumor that the rules of the examination in the first level of the Medicine Pavilion were going to be changed.</p><br/><p>Sure enough, three days later, an announcement was made in the Dao of Alchemy Division that the Medicine Pavilion’s first level rules had been changed. All of the 1,000,000 medicinal plants had been replaced. Now, the examination content could be taken from 10,000,000 plants of various varieties. It was really a terrifyingly high number.</p><br/><p>In addition, another rule change had been made. Now, the test was to determine how many medicinal plants could be identified in a given period of time. That change instantly caused Meng Hao’s lectures to be thrown into chaos. To top it all off, and prevent any unforeseen problems, each apprentice alchemist would only have one chance per month to enter the Medicine Pavilion.</p><br/><p>These changes completely foiled any of Meng Hao’s cheating techniques.</p><br/><p>All of this was a critical blow to Meng Hao. Within two days, his audience dropped from 1,000 to only a few hundred.</p><br/><p>Most of those were the people who had been his audience all along.</p><br/><p>However, after some time, many of those also chose to leave. After all, the situation was different than it had been in the beginning, when Meng Hao was outshining anyone and everyone. After all, they now had the chance to hear tier 7 alchemists speak, and who would turn down an opportunity like that?</p><br/><p>In the end, Meng Hao was left with a bit more than 70 audience members….</p><br/><p>All of these blows had struck like lightning, leaving Meng Hao panting. He looked out at his sparse audience of several dozen apprentice alchemists, and suddenly a bright light appeared in his eyes. Then, he turned his head to look over at the nearby mountain with 100,000 people circled around it.</p><br/><p>“Coz, what do we do?” Fang Xi asked quietly from off to the side. “Even Lord Third and Lord Fifth headed over there….” Unexpectedly, the parrot and the meat jelly had rushed over to the other mountain to listen to the tier 7 alchemist’s lecture. It was impossible to say whether they understood what she was talking about, but from the look of it, they were entranced.</p><br/><p>Meng Hao, of course, knew that the parrot was actually hung up on the five-colored peacock. As for the meat jelly, it was completely oblivious, and had merely been dragged along by the parrot.</p><br/><p>“Hardships prompt changes, changes bring solutions!”</p><br/><p>Fang Xi gaped.</p><br/><p>“Somebody is trying to restrict my path to wealth, to cut off my path to riches! It’s like they’re trying to chop me into pieces with a knife!” Meng Hao clenched his jaw and then flicked his sleeve as he flew into the air.</p><br/><p>Fang Xi followed as he made his way off into the distance. He didn’t really understand what Meng Hao had just said, so he quickly asked, “Coz, what’s the plan now?”</p><br/><p>“There’s no plan,” Meng Hao replied, “My name is going to rock the Dao of Alchemy Division, and END this predicament!” As his voice echoed out, he pushed his speed to the maximum. Rumbling sounds could be heard as he shot into the inner mountains. Avoiding any restricted areas, he headed directly toward the Medicine pavilion.</p><br/><p>It didn’t take long to reach it.</p><br/><p>There were a few apprentice alchemists gathered outside, hesitating as to whether or not to enter. There were even some full alchemists off to the side. They all noticed Meng Hao arrive, and suddenly seemed energized, and began to talk amongst themselves.</p><br/><p>“I heard word spreading outside that the rules of the first level have been changed. It was all because Fang Hao memorized the entire first level, and figured out some way to cheat. That’s how all those apprentice alchemists were able to pass so easily!”</p><br/><p>“Could it be that he’s shown up to try to figure out a way to cheat on the first level again?”</p><br/><p>“Interesting. Although, considering the way the rules have been changed, it would be difficult to do that. He can only go in once per month.”</p><br/><p>Meng Hao didn’t pause for even a moment as he headed toward the Medicine Pavilion. The two ancient old men sitting outside the pavilion opened their eyes and looked at Meng Hao. Although they didn’t normally pay attention to what went on in the outside world, the occasion in which Meng Hao had charged through the first level 140 times had left a deep impression on them. Combined with the rumors they had heard, they now knew that Meng Hao’s efforts back then had been a deliberate effort to study the level for the purposes of cheating.</p><br/><p>The two old men looked at Meng Hao solemnly.</p><br/><p>“This is the Dao of Alchemy Division,” one of them said. “How can one always think of getting in via alternative paths? Your latent talent is excellent, as is your skill in plants and vegetation. You should tread the straight and narrow path.”</p><br/><p>Meng Hao, apparently directly accepting the advice, clasped hands and bowed to the two old men.</p><br/><p>“Elders,” he said immediately, “I am aware of my mistake. Now is the time for repentance and reformation. I am not here to research cheating methods. I am here to truly test myself!”</p><br/><p>The two old men nodded and closed their eyes.</p><br/><p>Meng Hao took a deep breath. As everyone in the area looked on, he stepped into the Medicine Pavilion. As soon as he entered, a few among the Dao of Alchemy Division’s nineteen tier 8 alchemists immediately noticed. They ceased their pill concocting and sent out divine sense, which coalesced outside of the Medicine Pavilion.</p><br/><p>It was three white-haired old men who materialized.</p><br/><p>“Don’t tell me this Fang Hao has showed up looking for ways to break the system again? Is he addicted?”</p><br/><p>“How can the little bastard be such a slow learner? We spent a lot of effort to make the first level completely flawless, and yet he shows up again?!”</p><br/><p>“If this kid gets up to troublesome things again, I have half a mind to pull him out and smack him around. I wouldn’t be scared even if his father showed up. I concocted pills for his father once, you know.”</p><br/><p>Although they seemed angry, they were actually very excited. In all their years, no one had ever appeared who could cause so many problems for them. To them, the whole situation was very amusing.</p><br/><p>No one was able to detect their presence except for the two old men keeping guard outside the Medicine Pavilion, who merely glanced at them.</p><br/>\n</div>"}