{"title": "Chapter 935: My Nirvana Fruits!", "id": 935, "volume": 10, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-935-my-nirvana-fruits", "volume_title": "Volume 10", "body": "<h1>Chapter 935: My Nirvana Fruits!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong></strong></p><br/><p>[/expand]</p><br/><p>The violet sunlight contained shocking heat. It was like a violet sea of flames that submerged Meng Hao inside of it, burning him inside and out. He was engulfed in flames.</p><br/><p>The impurities within him were being thoroughly scorched away, causing his fleshly body to draw ever closer to that of a true Immortal.</p><br/><p>Fang Wei was also absorbing the light and heat. One by one, Fan Dong’er and some of the others arrived at the 90,000-meter level. All of them crossed their legs and began to meditate, absorbing the violet sunlight to strengthen their fleshly bodies.</p><br/><p>Most of the other cultivators were down below, beneath the 30,000-meter mark. There were only a handful who were hovering at around 60,000 meters. The division between the various groups was very clear.</p><br/><p>In the Fang Clan’s ancestral mansion, the Elders were watching the unfolding events closely. As they did, the conversed among themselves.</p><br/><p>“The Heavens at 90,000 meters are violet. At 180,000 meters, they become deep violet that borders on black. At 270,000 meters, they’re pitch black!”</p><br/><p>“Each of these 3 strata of height will provide shocking results in terms of fleshly body tempering. I wonder if anyone will be able to reach 180,000 meters this time!?”</p><br/><p>“For countless years, less than thirty people have ever been able to reach 180,000 meters.”</p><br/><p>Time passed. Eight or nine people were now at the 90,000-meter level, including Meng Hao. All of them had their eyes closed in meditation as they absorbed the violet sunlight. It was also possible to see vortexes spinning around all of them like black holes as they voraciously swallowed up the heat and sunlight.</p><br/><p>The most astonishing of all of these were the black holes around Meng Hao and Fang Wei, which were hundreds of meters wide, and absorbed all of the violet sunlight in their respective areas.</p><br/><p>The entire time, it was high noon. The more than 60 hours that passed by were equivalent to the normal passing of three days.</p><br/><p>When the 100th hour arrived, Taiyang Zi was the first person to open his eyes. He took a deep breath as rumbling sounds echoed out. His eyes shone with a brilliant light, and incredible heat radiated off of him as he rose to his feet.</p><br/><p>“My body has reached its limit here at 90,000 meters. An obstacle has appeared that prevents me from absorbing any more…. The only thing I can do… is to go higher and absorb more intense sunlight and heat. Only then can I destroy that barrier and push my fleshly body to another breakthrough!” He looked around at the others near him, and his gaze eventually came to rest on Meng Hao and Fang Wei.</p><br/><p>“To be born in the same era as them… is both a blessing and a curse.” He sighed lightly, then gritted his teeth. Eyes shining with determination, he took a deep breath and raised his right hand. A stone suddenly appeared in his palm which, despite the violet light surrounding it, still emanated bright golden rays.</p><br/><p>“Sun Immortal Veins!” he roared, clasping the stone tightly. Behind him, an enormous Dharma Idol appeared, several thousand meters tall. Shockingly, the Dharma Idol depicted Taiyang Zi himself, and the Immortality Illumination Vine wrapping around it appeared to be burning.</p><br/><p>At the same time, a pattern of veins suddenly spread out across Taiyang Zi’s entire body, causing him to surge with shocking power.</p><br/><p>“When this is over, it doesn’t matter what the level of my fleshly body is! I’m going into secluded meditation, and I’m going to break through to the Immortal Realm!” Taiyang Zi’s body burned like a shooting star as he shot past the 90,000-meter level, rapidly rising several thousand meters. He reached the 120,000-meter level in the space of a few breaths, which was when he finally started to slow down. Despite that, he gritted his teeth and continued onward.</p><br/><p>He next broke through to 150,000 meters. At 159,000 meters, he coughed up a mouthful of blood, and the stone in his hand began to crumble. His body looked as if it was about to melt, but he forcibly held it together, crossed his legs, and began to meditate.</p><br/><p>“I still have three of these precious Divine Sunstones. However… this is the absolute limit for my fleshly body. If I go forward even one more meter, then I’ll die!” His expression was one of defiance, and yet, he closed his eyes and absorbed the sunlight madly.</p><br/><p>Soon after, Sun Hai opened his eyes. His energy surged like that of an Emperor as he produced a crown and placed it on his head. Then, he began to rise, struggling to a height of 156,000 meters before finally coming to a stop.</p><br/><p>Wang Mu followed close behind Sun Hai. His cultivation base roared as a strange aura appeared around him that seemed to contain elements of the rising sun. In his hand was a jade slip that seemed able to dispel any darkness of night that he might perceive around him. Shockingly, he rose to a height of 162,000 meters!</p><br/><p>When the 126th hour arrived, Li Ling’er opened her eyes. At the same time, so did Song Luodan. Neither of them looked at the other, and yet they simultaneously produced objects from within their robes.</p><br/><p>Li Ling’er pulled out a magical bottle that rose to float above her head. Occasionally, drops of liquid would seep out. When they splashed onto Li Ling’er, they transformed into steam that she then absorbed.</p><br/><p>Song Luodan pulled out a Feng Shui Compass composed entirely of translucent crystal, which emanated a pulsating qi that he breathed in through his nose and mouth.</p><br/><p>Similar to Taiyang Zi, these two were using items prepared especially for them by their respective organizations, treasures useful in resisting sunlight. Their energy surged, and they shot higher up at almost the exact same time.</p><br/><p>“They’re Chosen, but so am I!” thought Song Luodan. “Only by trampling them beneath my feet can I succeed in treading my path!”</p><br/><p>“Immortal destiny has appeared, and I have an Immortality Illumination Vine,” thought Li Ling’er. “I can see my path to Immortality, and I will succeed!”</p><br/><p>120,000 meters. 150,000 meters…. At 165,000 meters, Song Luodan coughed up a mouthful of blood. His body was wreathed in flames, and he finally had no choice but to stop. Li Ling’er held on until 174,000 meters before stopping, her face pale. Blood oozed out of her mouth, which instantly transformed into a bloody steam.</p><br/><p>Song Luodan chuckled bitterly, closed his eyes, and began to absorb sunlight. Li Ling’er said nothing. She looked at the 180,000-meter position, only a few thousand meters away, and sighed inwardly.</p><br/><p>Her current position was the absolute limit for her fleshly body.</p><br/><p>Time passed. When the 200th hour arrived, Zhou Xin from the Sublime Flow Sword Grotto and Fan Dong’er both opened their eyes. They, too, produced sun-resisting treasures and flew up at high speed. They passed everyone, reaching 177,000 meters before their faces went pale and they started to slow down. However, they still managed to force their way to a height of 180,000 meters before they each coughed up three successive mouthfuls of blood, then trembled and settled down cross-legged, their bodies wreathed in flames.</p><br/><p>This scene caused all the observing Fang Clan members to tremble inwardly with shock.</p><br/><p>“They… really deserve to be called Chosen!”</p><br/><p>“All of them are fighting with all of their might! For their own Dao, for the path they wish to tread!”</p><br/><p>“As Chosen, the pressure they feel and the responsibility they have are equally weighty! They aren’t willing to let others supersede them, and they’re all striving to leave behind their own mark of glory….”</p><br/><p>When the 240th hour arrived, only Meng Hao and Fang Wei remained at the 90,000-meter mark. At this point, Fang Wei’s eyes opened, and he looked over at Meng Hao, his expression grim.</p><br/><p>“Still haven’t reached your limit yet…? Well, that doesn’t matter. Goals are everything, and I… have only one goal. To reach 300,000 meters!” Eyes shining brightly, he rose to his feet. Unlike the other Chosen, he used no precious treasure. Instead, his energy burst out, sending golden light emanating out in all directions.</p><br/><p>Finally, his Dharma Idol appeared!</p><br/><p>In addition to the golden light, his body emanated the aura of reincarnation. It grew stronger and stronger until, in the end, it created a vortex around him. Fang Wei then began to rise up higher into the sky.</p><br/><p>In one move, he rose 30,000 meters!</p><br/><p>When he reached 120,000 meters, he began to slow down. However, Fan Dong’er and everyone else up ahead him looked on with wide eyes.</p><br/><p>“He’s not using any magical items! He’s relying only on his cultivation base and his fleshly body!”</p><br/><p>“He’s using a unique divine ability. That’s the aura of reincarnation…. That must be one of the Fang Clan’s special magics, One Thought Reincarnation Incantation!”</p><br/><p>Everyone in the Fang Clan was watching as Fang Wei reached the 120,000-meter mark, including the Elders in the ancestral mansion.</p><br/><p>“Reincarnation Second Life!” roared Fang Wei. Immediately, the aura of reincarnation that surrounded him exploded out. Rumbling could be heard as, shockingly… a second Dharma Idol appeared behind him.</p><br/><p>This Dharma Idol didn’t look like his first Dharma Idol. It was blurry and unclear.</p><br/><p>As soon as the second Dharma Idol appeared, Fang Wei’s body flickered, and he continued to advance, quickly reaching a height of 150,000 meters.</p><br/><p>A hubbub of conversation rose up from down below, and shock filled the hearts of Song Luodan and the other Chosen.</p><br/><p>“Reincarnation Third Life!” Fang Wei cried out. As his shocking call echoed about… a third Dharma Idol appeared behind him. His cultivation base roared to monstrous heights as he advanced a third time. Rumbling could be heard as he instantly reached a height of 180,000 meters!</p><br/><p>He planned to put everyone beneath his feet!</p><br/><p>All the crowds were in an uproar. Actually, not everyone in the Fang Clan could actually see 180,000 meters into the sky. Only the most powerful experts could do so. However, those who could see were incredibly excited, especially the members of Fang Wei’s bloodline, who were elated.</p><br/><p>“The Reincarnation Incantation can reincarnate four lives. Prince Wei’s latent talent is so shocking that he’s already refined three lives!”</p><br/><p>“He… he isn’t even in the Immortal Realm yet! Once he breaks through, he’ll definitely be a 90-meridian peak Immortal!!”</p><br/><p>“With a Chosen like that, our Fang Clan is destined to last throughout the ages!”</p><br/><p>Fang Wei hovered at a height of 180,000 meters. From this vantage point, he could see the arcing curvature of the planet, and almost seemed to be floating in the starry sky. He did not cough up any blood as he looked down at the other Chosen with their varied expressions, and at Meng Hao.</p><br/><p>When he looked at Meng Hao, he realized that Meng Hao’s eyes were not closed. Instead, he was staring back at Fang Wei with an abstruse look in his eyes.</p><br/><p>Meng Hao had actually opened his eyes earlier, when Fang Wei had begun to fly up. The instant their eyes met, Fang Wei could see a piercing glow in Meng Hao’s eyes, and a smile on his face.</p><br/><p>Next, Meng Hao’s lips moved slightly, and although he didn’t speak, Fang Wei instantly knew what he was saying.</p><br/><p>“Are my Nirvana Fruits working well for you?”</p><br/><p>Immediately, Fang Wei’s eyes widened, and his expression turned grim.</p><br/><p><strong>Chapter 935: My Nirvana Fruits!</strong></p><br/>\n</div>"}