{"title": "Chapter 931: Her Name is Fang Yu!", "id": 931, "volume": 10, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-931-her-name-is-fang-yu", "volume_title": "Volume 10", "body": "<h1>Chapter 931: Her Name is Fang Yu!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong></strong></p><br/><p>[/expand]</p><br/><p>Her words overflowed with killing intent, as if a single inappropriate word would lead to a fight.</p><br/><p>Meng Hao blinked and then coughed lightly. Keeping his arm wrapped around Sun Hai, he looked around at some of the others.</p><br/><p>“Well, if it isn’t Song Luodan! And Taiyang Zi! Wang Mu, you’re here too! Wonderful! You’re all here. Well then… when are you going to be paying back the money you owe?”</p><br/><p>Meng Hao’s handful of sentences instantly provoked a reaction from the various Chosen in the East Ascension Pavilion. Some burst out angrily, others glared at him furiously, and some had bloodshot eyes.</p><br/><p>“Shut the hell up!”</p><br/><p>“Shut your trap!”</p><br/><p>“Meng Hao, you’re pushing people too far!!”</p><br/><p>“Meng Hao, if you dare to insult me one more time, we’re going to have a blood feud the likes of which has never been seen before!!”</p><br/><p>When Fang Xi saw all of this happening, he stared at Meng Hao in blank shock. Then he looked at the enraged Chosen, and took a deep breath. He had no idea what Meng Hao had done to provoke such widespread indignation, to cause these Chosen to be so wrathful.</p><br/><p>Fang Xi was even more thunderstruck by the words exchanged between Meng Hao and Li Ling’er, as well as Fan Dong’er. Actually, Fan Dong’er was the celestial goddess of Fang Xi’s dreams….</p><br/><p>And yet, in the blink of an eye, that celestial goddess had summoned deadly weapons. Any rapturous illusions Fang Xi had about her were instantly dispelled by her vicious wrath.</p><br/><p>Fang Xi wasn’t the only shocked one. Fang Hong also stared with wide eyes. She couldn’t imagine what disputes Meng Hao had with these people to make them act in this way. Apparently, Meng Hao’s brief words had stabbed deep into their hearts.</p><br/><p>Even Fang Wei was at a loss as to how Meng Hao could be so familiar with these people….</p><br/><p>Only Fang Xiangshan and Fang Donghan truly knew of the inspiring and tragic connection between all of them, and how world-shaking those events had been.</p><br/><p>The surrounding Fang Clan members stared in shock at Meng Hao and the Chosen, their minds reeling.</p><br/><p>Meng Hao’s appearance in the pavilion made him the complete center of attention. Even Fang Wei was somehow surpassed.</p><br/><p>The Chosen’s response to his words caused Meng Hao’s face to suddenly darken.</p><br/><p>Before he could even say anything though, the parrot, which had maintained silence up to this point, rolled its eyes and then glared at all the people.</p><br/><p>“He who owes shall repay!” it squawked. “This is a principle of Heaven and Earth! You shameless bunch had better repay what you owe immediately!</p><br/><p>“If you have no money, then find some furred or feathered beasts for Lord Fifth! If Lord Fifth is satisfied, then he’ll help you pay back the debt! What do you say?”</p><br/><p>Meng Hao snorted coldly and glared at the crowd. Then he slapped his bag of holding and produced a stack of promissory notes. He began tapping his finger on the notes, and then looked up.</p><br/><p>“White paper and words written in blood. The handwriting is very clear, yes? Do you people really dare to renege on your debts?” Meng Hao was clearly incensed. He was well aware that concocting the Skypalace Sunspirit Pill had temporarily resolved his spirit stone quandary. However, according to his calculations, what he had earned still wouldn’t be enough. Now, his joy at finding so many people who owed him money was turning into fury.</p><br/><p>In the instant that Meng Hao pulled out the stack of promissory notes, Fang Xi gasped. Fang Hong’s eyes went wide, and even Fang Wei stared in shock.</p><br/><p>All of the surrounding members of the Fang Clan stared blankly in disbelief at Meng Hao standing there, tapping his finger on the promissory notes. This image of Meng Hao was now deeply ingrained in their hearts.</p><br/><p>“How… how many promissory notes does he actually have?”</p><br/><p>“Didn’t Fang Hao come from Planet South Heaven? How could there be so many people who borrowed money from him?”</p><br/><p>“What exactly does this guy do? Is he a cultivator? How come he just doesn’t seem like a cultivator to me?”</p><br/><p>The Fang Clan’s Chosen gaped as their minds filled with buzzing thoughts.</p><br/><p>“Sun Hai,” said Meng Hao, sounding very displeased. “Why don’t you start first.” He patted Sun Hai’s head. “Don’t think that because you’re bald now that I can’t grab ahold of you. There’s always going to be some place on your body that has hair, right?”</p><br/><p>Upon hearing these words, the parrot’s eyes suddenly shone brightly, and it stared at Sun Hai with interest.</p><br/><p>Sun Hai began to quiver. He gritted his teeth and was about to protest, when Meng Hao’s words suddenly reminded him of his nightmarish experience on Planet South Heaven. Finally, he scowled.</p><br/><p>“Uh...can I pay back a little less than I owe?”</p><br/><p>Meng Hao was instantly pleased.</p><br/><p>“Alright!” he said, eyes shining. “Let’s start with the interest, how about that?” Sun Hai grimaced, clenched his teeth, and then slapped his bag of holding, producing some spirit stones that he handed over to Meng Hao.</p><br/><p>Meng Hao quickly collected them up, licked his lips, and then eyed Sun Hai’s bag of holding.</p><br/><p>“Considering how rarely we run into each other, why don’t you repay a bit more than that?”</p><br/><p>“I really can’t,” said Sun Hai. “I… I actually came to the Fang Clan to buy something particular…. It’s… well, I know this girl from the Fang Clan, and I really want to buy her a gift. Hey, you never know, we might end up being family!”</p><br/><p>“Oh, so that’s how it is,” said Meng Hao. “Why don’t you repay a bit more of your debt, and I’ll put in a good word for you.” He smiled and patted Sun Hai’s head.</p><br/><p>He suddenly realized that patting Sun Hai’s head actually felt very good, so he patted it a few more times for good measure.</p><br/><p>“Li’l Hai, don’t worry. Pay back those spirit stones, and I’ll help you out. In the Fang Clan, the highest Elders and the lowliest branch members all have to give me face.”</p><br/><p>Sun Hai hesitated for a moment. He knew that Meng Hao was the eldest grandson of the direct bloodline. Even though the direct bloodline was in decline, Meng Hao’s father was still alive, and Meng Hao had certainly been throwing his weight around the clan recently.</p><br/><p>Based on his earlier inquiries, none of the other Chosen in the clan were familiar with the girl he liked, which was making Sun Hai anxious. Now that he saw how domineering Meng Hao was, he figured… he might as well give Meng Hao’s suggestion a shot.</p><br/><p>“I wonder if he’ll really put in a good word for me….” Sun Hai thought, gritting his teeth. He was thoroughly entranced with this Fang Clan girl, to the point where he wasn’t even acting rationally. Finally, he slapped his bag of holding and passed an even larger sum of spirit stones over to Meng Hao.</p><br/><p>When Meng Hao saw them, his eyes shone with brilliant light.</p><br/><p>“Li’l Hai, don’t you worry. You leave everything to your Big Bro.” Meng Hao put the spirit stones away, and before Sun Hai could say anything more, began to walk over to Li Ling’er.</p><br/><p>She stared at him, furious, her expression icy.</p><br/><p>He hesitated for a moment, then glanced down at her rear end. Sighing, he thought about his actions as Fang Mu, and realized that there was an eighty percent certainty that Li Ling’er had recognized him. Therefore, he couldn’t push her too far.</p><br/><p>He turned to look at Fan Dong’er, but when he saw the deadly-looking violet flying daggers swirling around above her hand, his expression turned somber, and he turned to walk toward Taiyang Zi and the others.</p><br/><p>“Taiyang Zi, Song Luodan, Wang Mu!” he barked. “All of you owe me money. It’s time to PAY UP!”</p><br/><p>Taiyang Zi and the other two glared back at Meng Hao, flames of rage flickering in their eyes.</p><br/><p>They all stared at each other for a few breaths of time, after which Meng Hao took a step forward toward them. At this exact moment, Taiyang Zi and the others attacked simultaneously. Booms echoed out as all four of them flew out of the pavilion and began to fight.</p><br/><p>Rumbling filled the air as Meng Hao transformed into a golden roc that slashed its talons toward Taiyang Zi. At the same time, a chain of mountains rumbled out next to him, crushing down toward Song Luodan. A moment later, he flapped a wing, causing the air to shred as power shot toward Wang Mu.</p><br/><p>Booms echoed out in all directions. Even though it was late at night, and very dark, the light of magic filled the air, and all of the Fang Clan members down below stared up to watch. When they saw Meng Hao single-handedly battling three amazing Chosen, their minds trembled.</p><br/><p>“That’s Song Luodan from the Song Clan. And Taiyang Zi from the Five Great Holy Lands! The last one is the Wang Clan Chosen, Wang Mu!”</p><br/><p>“All three of them are in the process of rising to be true Immortals! Once they do, they’ll definitely be even more famous than they are now!”</p><br/><p>“I can’t believe Fang Hao is fighting all three of them at the same time!!”</p><br/><p>Booms echoed out as the four of them fought back and forth constantly. Meng Hao clenched his fist and then punched out, unleashing the Nine Heavens Destruction. Blood sprayed from Song Luodan’s mouth. As for Wang Mu and Taiyang Zi, one of them called wind and summoned rain, while the other transformed into blinding sunlight. Even as they closed in on Meng Hao, he snorted coldly. A Blood Demon head appeared, which head butted Wang Mu. Simultaneously, the Ninth Mountain materialized, slamming toward Taiyang Zi.</p><br/><p>“You guys are a lot stronger than the first time we fought,” said Meng Hao. “Unfortunately for you… I could put you in your place last time, and I can do the same thing today!” His cultivation base surged with power, and he extended his hand. Rumbling filled the sky as numerous mountains descended, cutting off all avenues of escape for Taiyang Zi and the others.</p><br/><p>Roaring, the three of them materialized their Dharma Idols. Meng Hao responded in kind. The Dharma Idols belonging to Taiyang Zi and the others all bore visible traces of Immortality Illumination Vines.</p><br/><p>As they fought, Taiyang Zi and the others were continuously forced to retreat. Finally, a boom could be heard, and blood sprayed from their mouths as they tumbled backward. Meng Hao’s eyes glittered, and he prepared to rush forward in pursuit.</p><br/><p>However, it was at this point that an archaic voice rumbled out from the ancestral mansion.</p><br/><p>“Magical battle is prohibited during the rise of the East Ascension Sun. If anyone makes another attack… their right to bathe in the sunlight will be revoked!”</p><br/><p>As the voice echoed out, two ancient figures noiselessly appeared in midair around the East Ascension Pavilion. Massive pressure radiated out, separating Meng Hao from Taiyang Zi and the others.</p><br/><p>These two old men were Elders of the Fang Clan. They looked over at Meng Hao, frowned, then looked at Taiyang Zi and the others.</p><br/><p>“All of you get back into the pavilion. Sunrise is almost upon us.”</p><br/><p>Taiyang Zi and the others took deep breaths. Then they clasped hands and bowed to the two old men. Glaring angrily at Meng Hao, they flew back into the pavilion.</p><br/><p>Meng Hao glared back at them, then headed back to the pavilion himself.</p><br/><p>“Still won’t pay me back?” he said with a cold smile. “From now on, any time I run into you, I’ll definitely put you in your place!” After setting foot back into the pavilion, he looked around until he saw Fang Xi and Sun Hai, after which he walked over to Sun Hai.</p><br/><p>As time passed, most everyone in the pavilion sat there cross-legged. Fang Wei remained quite subdued; after Meng Hao returned to the pavilion, he remained mostly silent. His expression did not reveal anything either, as if the previous clash between the two of them didn’t matter to him at all. In fact, when Meng Hao had fought with Taiyang Zi and the others, he had taken one glance and then looked away as if he didn’t care.</p><br/><p>Soon, everything quieted down. Daybreak was nearing. Eventually, it reached that darkest of pre-dawn moments in which everyone knew that the East Ascension Sun… was about to rise!</p><br/><p>Meng Hao’s eyes shone with a strange light, and he took a deep breath. It was at this point that Sun Hai hesitated for a moment, then quietly began to speak.</p><br/><p>“Meng Hao… um… about that thing you promised earlier….”</p><br/><p>“Don’t worry, I’ll take care of it,” said Meng Hao, yawning. “Oh, right, how far along are you in your relationship with this girl?”</p><br/><p>Sun Hai’s face reddened, and he lowered his voice even more.</p><br/><p>“I’m not really sure,” he said. “She always beats me up….”</p><br/><p>When Meng Hao heard this, he suddenly perked up.</p><br/><p>“Well, that won’t do!” he said. “What’s her name? Is she here in the pavilion? Of all the nerve! How could she dare to beat people up?!”</p><br/><p>“Oh, it doesn’t matter,” Sun Hai hurried to respond. “Every time she hurts me, I actually feel very happy…. She’s not here now, though. She’s a disciple of the Church of the Emperor Immortal. Her name is Fang Yu.”</p><br/><p><strong>Chapter 931: Her Name is Fang Yu!</strong></p><br/>\n</div>"}