{"title": "Chapter 930: Ive Missed All of You!", "id": 930, "volume": 10, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-930-ive-missed-all-of-you", "volume_title": "Volume 10", "body": "<h1>Chapter 930: Ive Missed All of You!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 930: I’ve Missed All of You!</strong></p><br/><p>It was a collision of gold and blood!</p><br/><p>It was a struggle between the power of reincarnation and the Black White Pearls!</p><br/><p>This was Fang Wei… versus Meng Hao! Their first battle!</p><br/><p>Rumbling filled the air as the colors of gold and blood smashed into each other. The night sky suddenly grew bright as the power of reincarnation and the Black White Pearls collided, causing Heaven and Earth to tremble. Massive roaring echoed out in all directions.</p><br/><p>The Blood Demon head collapsed, and the world of gold shattered. The sensation of reincarnation faded away… and Meng Hao’s Black White Pearls also collapsed.</p><br/><p>A tremor ran through Meng Hao, and his Eternal stratum immediately surged into action, giving him the power to completely shrug off the blow. What all onlookers saw was that Fang Wei’s palm strike did nothing to stop him! He didn’t even pause… he just stepped right into the East Ascension Pavilion!</p><br/><p>Fang Wei’s eyes brimmed with icy coldness, and his face had turned a bit pale. Although he had been separated from Meng Hao’s counterstrike to his palm attack, he was still struck by the backlash.</p><br/><p>Most shocking of all was that this was Brightmoon Lake, a place where Fang Wei practiced cultivation. He had formed a resonance with the lake water, and therefore held the upper hand. Furthermore, Meng Hao had been protecting Fang Xi.</p><br/><p>In the end, however, it was really difficult to determine which of them was actually more powerful!</p><br/><p>Almost in the same moment that Meng Hao set foot into the pavilion, dozens of Blackmoon Guards flew out across the lake toward him.</p><br/><p>Meng Hao completely ignored them. Instead, his cold gaze flitted across the crowd and came to fall on Fang Wei.</p><br/><p>“Junior Cousin Fang Wei, why is it that I’m not qualified to enter this pavilion?”</p><br/><p>“Anyone who is being pursued by the Blackmoon Guards is naturally not qualified to set foot inside,” Fang Wei replied coolly. The Blackmoon Guards were closing in on the pavilion, and even more were now converging further out beyond the lakeshore. Furthermore, it would only be a short time before their true experts arrived.</p><br/><p>In his heart, Fang Wei laughed coldly. He truly wanted to see how Meng Hao could possibly resolve the current situation.</p><br/><p>Fang Xi’s face was ashen as he stood there next to Meng Hao, panting. He had never been inside the East Ascension Pavilion before, and would normally have been very excited. Right now though, the Blackmoon Guards were moments away from catching up, and when he thought about what would happen then, he couldn’t help but take a deep breath and brace himself to go for broke.</p><br/><p>He had already decided that because all of this was happening because of him, he would take full responsibility, and make sure that the clan didn’t cause any problems for Meng Hao.</p><br/><p>“Is that so?” replied Meng Hao, smiling. Sharp whistling sounds could be heard as seven or eight Blackmoon Guards shot through the air behind him. Their expressions brimmed with killing intent, and they were just about to attack when…</p><br/><p>Meng Hao casually raised his hand and showed something to the Blackmoon Guards behind him.</p><br/><p>Then, without even turning his head, he coldly barked, “Screw off!”</p><br/><p>As his voice echoed out, the Blackmoon Guards outside of the pavilion saw the item in his hand. Their faces fell, and they suddenly stopped in place, staring in disbelief at Meng Hao’s hand, and the object therein.</p><br/><p>Then they began to pant. Meanwhile, more Blackmoon Guards converged in the area. All of them had the same reaction, as if lightning were crashing around inside their minds.</p><br/><p>The dozens of nearby Blackmoon Guards, and the hundreds that were gathered further off, all stared wordlessly in shock.</p><br/><p>When the Chosen in the East Ascension Pavilion saw what was happening, their eyes gleamed with a strange light. Fang Wei suddenly seemed to remember something, and his face turned extremely unsightly. Fang Yunyi gaped, unsure of how to react to this sudden development.</p><br/><p>He couldn’t understand what the Blackmoon Guards had seen that would suddenly cause them to stop in place and not dare to get any closer.</p><br/><p>Fang Hong stared in shock. Fang Xiangshan hesitated. Fang Donghan’s eyes shone with curiosity.</p><br/><p>“What the hell are you still doing here?” said Meng Hao icily, still not deigning to look behind him.</p><br/><p>The instant the words left his mouth, the Blackmoon Guards behind him gasped. They suddenly clasped hands and bowed to Meng Hao, then bitterly turned and made their way off.</p><br/><p>Many among the audience around Brightmoon Lake saw this, and gaped in shock. They had just personally witnessed the Blackmoon Guards, brimming with killing intent, suddenly stop in place and then retreat en masse, clearly not daring to get even an inch closer.</p><br/><p>There were a few people in the crowd who had exceptional eyesight, and managed to catch a glimpse of the object Meng Hao held in his hand. They gasped, and expressions of blank disbelief appeared on their faces.</p><br/><p>“The command medallion of a tier 8 alchemist!!”</p><br/><p>“That’s the same as a clan Elder’s command medallion…. A tier 8 alchemist’s command medallion!! That gives him the same status as a clan Elder! And clan Elders… are qualified to order the Blackmoon Guards to stand down!”</p><br/><p>“Fang Hao concocted a Skypalace Sunspirit Pill, which means that he instantly became a tier 8 alchemist!!”</p><br/><p>The sounds of the tumult outside drifted into the pavilion, causing the cultivators gathered there to inhale sharply.</p><br/><p>Fang Xi gaped, and then suddenly went wild with joy.</p><br/><p>Meng Hao slowly lowered his hand, looking at Fang Wei with a slight smile.</p><br/><p>“Would you say I’m qualified now?”</p><br/><p>Fang Wei’s expression was extremely unsightly as he stared at Meng Hao. Before he could even respond, Meng Hao stepped forward and raised his right hand. Fang Yunyi’s face fell, and he tried to escape, but his body involuntarily flew through the air toward Meng Hao, who grabbed him by the neck.</p><br/><p>“You see me, and don’t greet me properly,” Meng Hao said, smiling, gently patting Fang Yunyi’s cheek. “Ah, Yunyi, it seems that the last time I taught you a lesson, you just didn’t get it.”</p><br/><p>Meng Hao’s smile caused Fang Yunyi to begin to tremble. He was about to say something, when suddenly Meng Hao’s face darkened and he slammed Fang Yunyi onto the floor of the pavilion.</p><br/><p>The pavilion was magically reinforced, and couldn’t be damaged by such an action. It was incredibly tough, which resulted in Fang Yunyi letting out a bloodcurdling scream. Next, Meng Hao slammed him into the ground seven or eight more times.</p><br/><p>Blood sprayed from Fang Yunyi’s mouth, and he screamed over and over again. He even begged for mercy. Fang Wei frowned.</p><br/><p>“That’s enough!” he said.</p><br/><p>Meng Hao smiled and looked over at Fang Wei.</p><br/><p>“Under my authority as an Elder, I’m reprimanding a clan member. Junior Cousin Fang Wei, on what authority did you speak those two words to me just now?”</p><br/><p>With that, Meng Hao grabbed Fang Yunyi by the hair, swung him around and then chucked him off to the side. Blood spattered everywhere. The Chosen in the room watched and said nothing. However, as they observed at Meng Hao’s actions, each of them were thinking different things.</p><br/><p>That was especially true of Sun Hai, who was shivering slightly.</p><br/><p>Fang Wei’s expression was extremely grim as he looked at Meng Hao. He was about to say something, when Meng Hao laughed.</p><br/><p>“On the other hand,” he said, “the moon is out tonight, and the stars are bright. Tomorrow is the rise of the East Ascension Sun, an auspicious day. Besides, I see a lot of old friends here, which makes me happy. I won’t make things any harder for you.” He looked out at all the Chosen, each of whom had different expressions on their faces.</p><br/><p>Sun Hai subconsciously bowed his head. Li Ling’er stared in rage. Fan Dong’er’s face flickered with killing intent, and Wang Mu looked like he wanted to fight then and there. Song Luodan and Taiyang Zi were both staring at him with clenched jaws.</p><br/><p>Their past experiences with Meng Hao were things that they would never be able to forget.</p><br/><p>Meng Hao looked slightly embarrassed, then chuckled bashfully as he looked down at the terrified Fang Yunyi, who lay there bedraggled and broken-boned.</p><br/><p>“Write me a promissory note,” Meng Hao said, narrowing his eyes and smiling. He immediately produced pen and paper from his bag of holding, which he held out in front of Fang Yunyi. “You know me, and you know what to write.”</p><br/><p>With that, he patted Fang Yunyi on the head.</p><br/><p>Fang Yunyi’s face was pale white. To him, Meng Hao was the most evil fiend imaginable in Heaven and Earth. Trembling, he used his own blood to write out a promissory note.</p><br/><p>Meng Hao accepted the promissory note, blew on it a bit to dry it, and gingerly placed it in his bag of holding as if it were a treasure. Then, he smiled at Fang Yunyi and said something that caused Fang Yunyi’s blood to run cold.</p><br/><p>“Yunyi, you’ll get no third chance. If you act like this again the next time you see me… I’ll make sure you live a life worse than death.” Meng Hao’s smile stretched from ear to ear, but his words were as cold as ice. It was a stark contrast that caused all of the Chosen in the pavilion to look on in reticent silence.</p><br/><p>Fang Yunyi started to pant and tremble, and his expression turned into one of extreme terror. He could sense the murderous intent in Meng Hao’s words, and was also certain that when Meng Hao said he would do something… he would never fail to follow through on his promise.</p><br/><p>Fang Yunyi knew that if he did not respectfully greet Meng Hao the next time he saw him, Meng Hao would definitely… leave him wishing he were dead.</p><br/><p>He was frightened, well and truly frightened. Even Fang Wei was incapable of helping him in this situation, causing his fear to reach heights that it could not be described even with the word ‘terror.’</p><br/><p>“Now, screw off to whatever hole you crawled out of,” said Meng Hao. He grabbed Fang Yunyi by the hair and violently tossed him out of the pavilion. Intense pain wracked Fang Yunyi’s body as he flew out over Brightmoon Lake and landed in the middle of the crowd outside.</p><br/><p>After being helped to his feet, he left immediately, trying to put as much distance between himself and Meng Hao as possible. The entire time, his heart was gripped with icy terror.</p><br/><p>Back in the East Ascension Pavilion, Meng Hao looked around at the various Chosen, and a bashful smile appeared on his face, as if he were slightly embarrassed to have suddenly run into so many old friends.</p><br/><p>“Greetings, Fellow Daoists!” he said. “We meet again! I’ve missed all of you!”</p><br/><p>Looking quite at ease, he walked up to Sun Hai and, before he could back away, slid his arm around his neck, as if they were good friends.</p><br/><p>“Hey, if it isn’t L’il Hai! How are you?! Have things been well? Why did you shave your head? Not bad, I think it’s quite a unique hairstyle.”</p><br/><p>Sun Hai started to tremble, and he looked as if he might start crying at any moment. Meng Hao’s shadow lurked perpetually in his heart, a point that could be seen clearly from his cleanly-shaven head.</p><br/><p>Meng Hao rubbed Sun Hai’s shiny head and patted it a few times. Sun Hai choked with silent fury, feeling frustrated to the extreme. At this point, Meng Hao’s gaze came to rest on Li Ling’er. Subconsciously, he couldn’t refrain from… looking at Li Ling’er’s curvaceous rear end.</p><br/><p>“Aiya! Little sis Ling’er, I haven’t seen you for so long! You’re even prettier than before. Your rear end… looks really nice….” He cleared his throat. “Hey, don’t look at me that way! You know, now that I think about it, we were actually engaged as children!”</p><br/><p>Li Ling’er’s expression was extremely dark as she stared at Meng Hao. Her chest rose and fell as she panted, and she looked like she was on the verge of exploding. Were it not for the fact that she knew she wasn’t a match for Meng Hao, and that they were also in the Fang Clan, then she would definitely go all out to fight him.</p><br/><p>Seeing that Li Ling’er was on the verge of bursting, Meng Hao quickly looked away, turning his attention to Fan Dong’er. Instantly, his eyes brightened.</p><br/><p>“Eee? Inky! You’re here too! Little sis Dong’er, I’ve already loaned you Inky for quite a while now, when will you be giving her back to me?”</p><br/><p>Fan Dong’er’s eyes blazed with rage, and she raised her right hand. Cracking sounds could be heard as two violet flying daggers suddenly appeared. Mysterious flames hissed up from the daggers, and they emanated terrifying auras.</p><br/><p>“I dare you to say one more word!” she said through gritted teeth.</p><br/>\n</div>"}