{"title": "Chapter 947: Quasi-Dao Paragons", "id": 947, "volume": 10, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-947-quasi-dao-paragons", "volume_title": "Volume 10", "body": "<h1>Chapter 947: Quasi-Dao Paragons</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 947: Quasi-Dao Paragons</strong></p><br/><p>Everything was covered in a haze of dust, which only served to make the statue in the center of it all even more shocking.</p><br/><p>It raised its other foot and took another step, causing the land to rumble, and more mountains to collapse.</p><br/><p>The haze of dust continued to spread out rapidly in pulsing waves, creating an astonishing sight. The middle-aged man’s scalp went numb, and his mind spun. This was literally the most unbelievable thing he had ever seen in his entire life. His face instantly became devoid of blood, and he looked shocked beyond belief.</p><br/><p>He suddenly cried out involuntarily, “That’s… that’s… that’s the aura of a Quasi-Dao Realm Paragon!”</p><br/><p>His eyes were wide, and his heart pounded wildly.</p><br/><p>He was well-aware how powerful a Quasi-Dao Paragon was, and what they represented. He was extremely conscientious of the fact that the Quasi-Dao Realm… was a completely astonishing Realm within the Nine Mountains and Seas. It was a realm of madness and terror, so powerful that strongest experts in the Nine Mountains and Seas had no choice but to call people in that Realm… Paragons!</p><br/><p>The middle-aged man wasn't the only shocked one. The old man up in midair, the manifestation of the Seventh Patriarch’s divine will, was watching with wide eyes and open mouth. He was completely astonished, and could scarcely believe what he was seeing.</p><br/><p>“How is this possible?!?!” he thought, panting, his mind spinning. “The Dao Guardsman, is actually… moving!!” He suddenly looked at Meng Hao sitting on top of the statue’s head, and viewed the look of sorrow on his face in a new light. For an instant, the rarely-shocked Seventh Patriarch's scalp went numb.</p><br/><p>The ground quaked and mountains crumbled. A massive rumbling sound filled the air, and the haze of dust churned as boulders crashed down.</p><br/><p>The weeds in the area were blown flat by the wind, and cracks appeared in the surface of the ground, although it was all rapidly covered over by the dust.</p><br/><p>Up in the air, the Seventh Patriarch was panting as he stared mutely at the statue.</p><br/><p>As for the skinny man, he couldn’t be more shocked. His mind reeled as he looked at the earth-shaking statue. He could sense the aura emanating out from it, and it turned his face ashen. Without another moment’s hesitation, he fled.</p><br/><p>This unexpected turn of events was something he couldn’t handle. From his perspective, killing Meng Hao should have been as simple as turning over his hand. Moments later, though, everything was completely reversed.</p><br/><p>He suddenly realized why Fang Xiushan would hire nine experts like himself to kill a mere member of the Junior generation. Although the conclusion he reached was actually fallacious, in his mind, it was the obvious answer.</p><br/><p>“Dammit! How could things turn out like this! Fang Xiushan, you bastard, you conned me. Y-y-you sent me, with one extinguished Soul Lamp, in here to kill a cultivator protected by a Quasi-Dao Paragon? Why didn’t you tell us ahead of time that this inhuman Fang Hao could actually bring the Dao Guardsman back to life!?!?” The man retreated with all the speed he could muster.</p><br/><p>However, in the moment that he began to flee, the statue’s gaze stabbed through the haze of dust like a beam of light to land directly on the man.</p><br/><p>In the instant the statue’s gaze locked onto him, a sound like thunder rumbled in the man’s mind. An intense sense of deadly crisis rose up, and he let out a bellow. He instantly spit out blood and unleashed a secret magic to try to flee.</p><br/><p>He was scared. As an Ancient Realm expert, he did not often encounter frightening situations, but as of this moment, he was afraid. In fact, he was terrified, all the way down to his bones.</p><br/><p>He knew exactly how terrifyingly powerful a Quasi-Dao Paragon was. Years ago, he had actually personally witnessed the wild and devastating power of just such an individual.</p><br/><p>There was no way he couldn’t feel terror. The awakening of the statue shook his mind, and caused him to think back to the legends he had heard regarding the statue.</p><br/><p>“I… have provoked a truly inhuman monster! I can’t believe… I can’t believe this is happening!!” He felt incredible regret, and swore that, if he managed to live through this, he would make things very difficult for Fang Xiushan when he got out of the ancestral land.</p><br/><p>However, it was at this moment that the huge statue’s hands tightened on the enormous greatsword that was thrust into the ground. Rumbling and cracking sounds could be heard from the ground as fissures spread out from the sword in all directions. Suddenly, the greatsword… was pulled out from the earth!</p><br/><p>The shocking statue’s eyes were as cold as ice as it hefted the greatsword in both hands. Then it swung the sword, which descended as fast as lighting toward the fleeing man.</p><br/><p>The sword caused the whole world to go silent.</p><br/><p>The avalanches of boulders made no sound. The crumbling mountains were silent. The haze of dust seethed in terrifying quietude. It was as if time itself… were frozen in place.</p><br/><p>The fleeing man also seemed to be stopped in midair, his expression that of terror and astonishment. His pupils were frozen in place, and the nine Soul Lamps behind him were motionless. It was as if everything in the world were completely incapable of moving.</p><br/><p>The only thing that was moving was the statue’s greatsword. As it cleaved downward, blood oozed from the man’s forehead, then trickled down his nose, then his chin. Finally, the sword passed through his torso, simultaneously shattering his Soul Lamps.</p><br/><p>The world returned to normal. The terracotta soldier’s greatsword once again stabbed into the ground, which trembled and quaked. Sound returned… in midair, the middle-aged man’s body had been completely cleaved into two pieces, and all of his Soul Lamps were destroyed.</p><br/><p>The man had numerous magical items, all of which were shattered, and flew out in pieces along with the man’s flesh and blood.</p><br/><p>There was no way for him to fight back or block. He couldn’t even struggle, let alone evade.</p><br/><p>Blood sprayed out as his Nascent Divinity, his Soul Lamps, all of him… faded away.</p><br/><p>Only his bag of holding remained, which came to float in front of Meng Hao.</p><br/><p>Meng Hao sat silently on the statue.</p><br/><p>High up in the air, the Seventh Patriarch took a deep breath. Even he felt a sense of fear when he looked at the statue, and also knew how shocking and terrifying its sword was.</p><br/><p>“That sword has its own Dao that replaces the natural law of Heaven and Earth! That sword… can sever Daos, sever natural laws, can sever… anything that exists!</p><br/><p>“This is definitely the power of a Quasi-Dao Paragon!! However… it’s obviously nothing more than a statue! If a statue could be so powerful, then whoever created that statue… must be even more terrifying!</p><br/><p>“I suppose… only someone in the true Dao Realm, who also possessed some rare Heavenly material or Earthly treasure, would be able to create something like this. But...with such a treasure, it would make more sense to craft some other item, something that would be of more use to a Dao Realm cultivator.” Simply looking at the statue caused the Seventh Patriarch’s heart to tremble.</p><br/><p>He knew that Quasi-Dao Realm cultivators… were a maniacal bunch. They were madmen who could ignore anybody; they were people who nobody dared to provoke.</p><br/><p>They were people who had prepared for years, who had transcended one deadly Soul Lamp tribulation after another, who had reached the peak of the Ancient Realm filled with hope. But after extinguishing their final Soul Lamp, they were unable to enter the Dao Realm, and would exist forever half a step away from it. Their lifespans had crumbled away, and they would be left with only a few dozen years of life. People like that… were in the Quasi-Dao Realm!</p><br/><p>They were doomed to die, and could not be saved by anything in Heaven and Earth. Therefore, they went mad, stuck half a step into the Dao Realm, possessing a certain level of Dao Essence that earned them respect and awe. No one dared to provoke them, and everyone called them Paragons.</p><br/><p>For tens of thousands of years, only eleven such people had ever appeared in the Fang Clan. Some of them went mad and carried out slaughters. Some of them quietly waited until their life force reached its end.</p><br/><p>When the Grand Elder had spoken of past Dao Realm Patriarchs of the Fang Clan who were buried in the ancestral land, he was referring to… Quasi-Dao Paragons! The only one among these who was a true Dao Realm expert was the first generation Patriarch!</p><br/><p>Ke Yunhai had also met with failure at that final step. However, his cultivation base was so terrifyingly profound that, even after his failure, even being only half a step into the Dao Realm, even with a failing longevity… he had still managed to force out many more years of life to protect his son.</p><br/><p>At that time, his battle prowess had far exceeded the Ancient Realm, and could actually be considered to be in the Dao Realm.</p><br/><p>As for his final Soul Lamp, that was the very lamp with the body of a dragon and the wick of a phoenix, the one he had been buried with! [1. Ke Yunhai’s lamp was described in chapter 569. He used it to make the soldiers in chapter 572. In chapter 597, it mentioned that the only thing in Ke Yunhai’s tomb was the lamp. The lamp was mentioned again in chapter 600 when Meng Hao went to visit the tomb later.]</p><br/><p>He had actually used that lamp to make the terracotta soldiers, which had thus contained much of Ke Yunhai’s life force. As a result… they were incredibly powerful!!</p><br/><p>The Seventh Patriarch was panting as he looked at the statue in fear. He himself… was not in the Dao Realm; he was only in the Ancient Realm. However, he had summoned fifteen Soul Lamps, and to date had managed to extinguish thirteen of them.</p><br/><p>“Only Elder Brother, the Earth Patriarch, could suppress that statue with his Dao Realm cultivation base. Nobody else could, not even Old Second and Old Third with their fourteen extinguished Soul Lamps. They only have one more lamp each to extinguish, but they still wouldn’t be matches for this statue. After all, they’re still merely in the Ancient Realm!”</p><br/><p>Most shocking of all to him was that this Dao Guardsman of the Fang Clan was actually protecting Meng Hao!</p><br/><p>“This kid actually managed to get the Dao Guardsman to move! How did he pull it off? Why was he able to do it? The fact that he was so confident before shows that he was sure ahead of time that the statue would fight for him and protect him!</p><br/><p>“This… is absurdly unbelievable!” The Seventh Patriarch took an incredulous breath as he looked down at what was happening. There was no way for him to explain what was going on, and if his divine will wasn’t here to personally witness it, then, if he had been told the story later, he would have called it nonsensical ravings.</p><br/><p>And yet, here he was watching it happen, shocked.</p><br/><p>Meng Hao patted the statue’s head. Gradually, the land around him quieted down. The dust faded away, and everything returned to normal. Meng Hao looked up, and returned the precious memories of Ke Yunhai to the depths of his heart. Sometimes a certain object will make you think of a certain person. His memories filled him with grief that he couldn’t somehow undo the death of Ke Yunhai.</p><br/><p>He closed his eyes for a long moment before opening them again. The he looked down at the statue. To him, it was no mere terracotta soldier, but rather, a precious memento left to him by Ke Yunhai.</p><br/><p>“Let’s go,” he said softly. “Come with me to take a look around this ancestral land of the Fang Clan.” The statue’s eyes shone brightly as it flew into the air and took Meng Hao further into the ancestral land.</p><br/><p>That simple action almost caused the Seventh Patriarch’s eyeballs to pop out of his head. He very nearly cried out in shock.</p><br/>\n</div>"}