{"title": "Chapter 940: The End of the Sky", "id": 940, "volume": 10, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-940-the-end-of-the-sky", "volume_title": "Volume 10", "body": "<h1>Chapter 940: The End of the Sky</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 940: The End of the Sky</strong></p><br/><p>A true Immortal fleshly body meant that he was a true Saint!</p><br/><p>This in turn meant that Meng Hao’s body was now powerful to a terrifying level. He had been baptized in Immortal light, which had then coalesced inside of him, creating…. an Immortal body!</p><br/><p>Meng Hao clenched his fists. He could tell that if he ran into a so-called peak Immortal Realm cultivator, one punch would easily be able to rock such a person.</p><br/><p>He could sense his might; it felt as if he had completely changed on a fundamental level. The terrifyingly powerful light and heat from before now seemed vastly weaker.</p><br/><p>“This is the power of a true Immortal fleshly body….” He looked up higher into the sky, and his pupils glimmered with fire.</p><br/><p>“Now it’s time to find out… how high the Heavens really are!”</p><br/><p>Rumbling could be heard as he climbed relentlessly up into the sky.</p><br/><p>Even at this height of 387,000 meters, the light and heat were no longer something that Meng Hao felt incapable of enduring. He rose up from Planet East Victory in a piercing beam of light.</p><br/><p>Meng Hao was now so far up that few down below could see him. The only thing most people could see was a long streak of prismatic light that seemed to be on the verge of rattling the Heavens and the starry sky, rising higher and higher.</p><br/><p>Meng Hao was surrounded by flames as he soared higher at top speed. If you were close up, you wouldn’t be able to see them, but from down on the ground, the clan members could see them clearly.</p><br/><p>Meng Hao seemed to exist inside a scorching sea of flames, within which he could live eternally!</p><br/><p>The Chosen up in midair were shaken; to them, Meng Hao seemed as if he were a mighty mountain. Subconsciously, they all simultaneously reached a similar conclusion: perhaps they would always be behind Meng Hao in this lifetime.</p><br/><p>Perhaps they would never have a chance to outdo him, never have a chance to catch up to him. Perhaps… they would only continue to fall further and further behind!</p><br/><p>Of course, it was impossible for them to know that one of the past Sovereigns had already classified him as… 13th in the Echelon of the entire Nine Mountains and Seas!</p><br/><p>Fan Dong’er watched in silence. Zhou Xin said nothing. Li Ling’er, Taiyang Zi, Song Luodan, Wang Mu, Sun Hai, and all the other Chosen from the sects and clans had complex expressions on their faces. They looked at Meng Hao getting even further away from them, a blazing sun wreathed in flames.</p><br/><p>Fang Wei trembled, and slowly, he closed his eyes, making it impossible for anyone to see the gloominess and resignation therein.</p><br/><p>Fang Wei’s father and grandfather were on the verge of going mad. They looked at the blazing sun up in the sky, and unprecedented murderous rage welled up from the bottoms of their hearts.</p><br/><p>The Grand Elder sat silently in the ancestral mansion, looking up into the sky. No one could tell what he was thinking, nor even guess what he might possibly be feeling.</p><br/><p>“Fang Hao…. Fang Wei,” he murmured.</p><br/><p>Meng Hao continued on at top speed, like a Flame Phoenix, like a Flying Rain-Dragon. The Flying Rain-Dragon core inside of him was now rapidly dissolving, and bits of the legacy’s knowledge appeared in his mind.</p><br/><p>However, Meng Hao didn’t pay any attention to that. The only thing he was thinking about was… finding out how high the Heavens were!</p><br/><p>His expression was that of resolute will. Rumbling surrounded him as he flew another three thousand meters until he was 390,000 meters high. And yet, he did not stop.</p><br/><p>The pressure was shocking, the transforming light and heat was petrifying. But Meng Hao did not decrease his speed at all, nor did he pause for even a moment. He was as unimpeded as his Dao heart, seemingly untouched by any impurity.</p><br/><p>One day. Two days. Three days…. Time passed quickly, until only a few days of the East Ascension Sun remained.</p><br/><p>Meng Hao proceeded onward, piercing through space, heading toward the only goal upon which he kept his eye; the sun which hung outside of the starry sky!</p><br/><p>By now, he had far surpassed all of the other Chosen, all of the other members of his generation who had sought good fortune in this trial by fire. Now, the only person left for him to supersede… was himself.</p><br/><p>He would surpass himself! He would pursue his dreams! It was like his Dao, a Dao that sought to cross numerous mountains, to pass over rivers and seas. It was a Dao of freedom and independence, unrestrained and unfettered, always moving toward glory.</p><br/><p>Even the Heavens could not cover him up or cause his Dao heart to fall!</p><br/><p>One day. Two days. Three days!</p><br/><p>393,000 meters. 399,000 meters… 405,000 meters….</p><br/><p>And he kept going!</p><br/><p>The other Chosen up in the sky looked on, taciturn. They saw Meng Hao, and his obsessive progress, and the same thought floated up in all of their minds.</p><br/><p>“In the end… how high will he get!?!?”</p><br/><p>Li Ling’er was thinking this, as were Fan Dong’er, Taiyang Zi, and Song Luodan.</p><br/><p>The various Elders were also watching closely.</p><br/><p>“The boundary between the planet and the starry sky is vague, and can fluctuate due to various factors. In the moment when the sun is nearest, that boundary will become clearer.”</p><br/><p>Days later, Meng Hao was still speeding along.</p><br/><p>417,000 meters. 420,000 meters!</p><br/><p>He felt like he was reaching the end. The light and heat around him had reached an indescribably high level. Despite the fact that his fleshly body was in the true Immortal Realm, he still felt as if he were about to be melted into a pool of blood, and then evaporate into a bloody mist.</p><br/><p>He shook, and his Eternal stratum worked madly to restore him and support him, to allow him to go even higher.</p><br/><p>“I can hold on a bit longer,” he thought, his eyes narrowing as they focused ahead with firm determination.</p><br/><p>RUMBLE!</p><br/><p>426,000 meters!</p><br/><p>432,000 meters!</p><br/><p>438,000 meters!!</p><br/><p>The sun appeared to be getting closer and closer. His eyes were crimson, and his entire body was shaking. He was now withering away, and yet… he kept flying!</p><br/><p>The flames around him grew more boundless, and from a distance, it almost seemed as if the sky would catch fire. The flames spread out like wings that seemed to be flapping, preparing to attack the Heavens.</p><br/><p>The lands quaked, and the hearts of all onlookers trembled.</p><br/><p>At some point, the Grand Elder had emerged from within the ancestral mansion. He stood in the wide public square, looking up into the vast sky.</p><br/><p>“Time is almost up….” he murmured softly.</p><br/><p>Right now, all eyes were on Meng Hao. It wasn’t just the Fang Clan. Shocked powerful experts from all corners of Planet East Victory had all long since turned their attention to the scene that was playing out.</p><br/><p>“Who is that?!”</p><br/><p>“That person flew out from the Fang Clan. Could it be… Fang Wei?!”</p><br/><p>“Even Fang Wei couldn’t fly that high! This person is getting close to the boundary with the starry sky! Once he steps out there, he’ll die unless he’s in the Dao Realm!”</p><br/><p>As the experts of Planet East Victory were shaken, there happened to be a huge island in a sea somewhere on the planet. As it floated there, an old man with the bearing of a transcendent being was gaping up at the sky in shock.</p><br/><p>“Fudge! That little bastard… Dammit! Dammit! The Patriarch comes all the way here to hide and he… he actually found me!?!?”</p><br/><p>The old man was in such a bad mood that he let out a series of howls that shook the entire island.</p><br/><p>Standing next to the old man was a shockingly beautiful young woman. She smiled happily as she looked up into the sky.</p><br/><p>Rumbling emanated out from Meng Hao as he gritted his teeth and sped higher. 444,000. 447,000!</p><br/><p>Meng Hao’s expression twisted with madness. From the outside, it looked as if his body were literally burning up. His internal organs were scorched, and he was on the verge of being transformed into nothing more than ash.</p><br/><p>And yet… he didn’t stop!</p><br/><p>447,300 meters. 447,900 meters. 448,500 meters….</p><br/><p>Meng Hao let out a bellow as the flames engulfing him grew even stronger, inundating him completely. He flew another 900 meters, reaching a height of 449,400 meters.</p><br/><p>By now, the 36th day was almost over. Meng Hao only had about an hour left!</p><br/><p>“I have to get past the 450,000 mark!” Meng Hao was filled with madness and determination. By now, the only thing about him that was visible was a vague, shadowy outline.</p><br/><p>449,700 meters. 449,850 meters. 449,970 meters…</p><br/><p>Time flowed by. The world was silent, and the lands were still. Everyone’s attention was fixed on Meng Hao… as he arrived at a height of 449,990 meters!</p><br/><p>He was now only 10 meters away from the 450,000 meter mark!!</p><br/><p>Furthermore, there were only fifteen breaths of time until the rise of the East Ascension Sun ended!</p><br/><p>Those final 10 meters seemed so close, and yet, they were the boundary between the planet and the starry sky!</p><br/><p>How high were the Heavens of Planet East Victory? As of this moment… Meng Hao knew the answer. The Heavens… were 450,000 meters high!</p><br/><p>He was now only 10 meters away from that height when he came to a stop, his body wreathed in flames, but his eyes shining with sharp light.</p><br/><p>In addition to the enormous sun, he also saw a strange scene out in the starry sky. When he focused his eyes… he saw an enormous crimson Tribulation cloud. Shockingly, a gigantic yellow tree was just barely visible within that cloud.</p><br/><p>The tree emanated an archaic aura, as if it had come into being along with Heaven and Earth, as if it had always existed within the Nine Mountains and Seas. It would not appear easily, and could only be seen under very special circumstances.</p><br/><p>That was… something that would appear after acquiring a true Immortal fleshly body, and becoming a true Saint. It was… Saint Tribulation!</p><br/><p>It was similar to the true Immortal Tribulation that came along with true Immortality!</p><br/><p>Immortal Tribulation had a door, Saint Tribulation had a tree!</p><br/><p>One movement would take Meng Hao out of the planet and into the starry sky.</p><br/><p>One movement would cause the Saint Tribulation to descend!</p><br/><p>Meng Hao stopped at that 10-meter mark and silently examined the distance.</p><br/><p>In that moment, the Elders down below with profound cultivation bases looked on with incredible shock.</p><br/><p>“Saint Tribulation!” thought the Grand Elder. His eyes closed, and his right hand clenched into a fist.</p><br/><p>Meng Hao’s eyes shone with a threatening decisiveness, a decisiveness as sharp as a honed blade. Finally, he sighed.</p><br/><p>“If I don’t go out into the starry sky and face the sun directly, then this whole trip will have been a waste.</p><br/><p>“Time is almost up…. If my calculations are correct, I can endure… for ten breaths of time!” With that, he looked up, waiting for five breaths of time, and then moved forward one more time.</p><br/><p>One movement, ten meters!</p><br/><p>In the instant that Meng Hao moved forward, all of the observing cultivators on Planet East Victory were shocked, and cried out in surprise.</p><br/>\n</div>"}