{"title": "Chapter 948: Terrifying", "id": 948, "volume": 10, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-948-terrifying", "volume_title": "Volume 10", "body": "<h1>Chapter 948: Terrifying</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 948: Terrifying</strong></p><br/><p>He gasped, and a look of disbelief covered his face as he stared at the statue taking Meng Hao off into the distance. He was well-aware of the difference between Meng Hao getting the statue to protect him, and getting it to carry him around. They were two completely different things.</p><br/><p>One required passively responding, the other required taking action!</p><br/><p>“He… can actually control the clan’s Dao Guardsman!!” The Seventh Patriarch was panting. Now that he knew the full situation, his mind spun, and he completely forgot about any rule-violating members of the clan. He looked at Meng Hao with shining eyes, and couldn’t help but be filled with the growing notion that Meng Hao would be a future pillar of the clan.</p><br/><p>As Meng Hao proceeded along, he opened up the bag of holding that had belonged to the man who had just been killed. He scanned its contents with divine sense, finding a good quantity of spirit stones and Immortal jade. There were also a lot of medicinal pills, and even some jade slips. One of those jade slips was black, and Meng Hao’s face grew frosty as soon as he picked it up and scanned it.</p><br/><p>“He was an Elder of the Fang Clan!” he murmured. The command medallion he held in his hand was a token of authentication provided by the clan, and revealed that the man from moments ago was definitely one of the clan Elders.</p><br/><p>After all, this was the Fang Clan’s ancestral land. Fang Xiushan wanted Meng Hao dead more than anything, but he still wouldn’t dare to allow outsiders into the ancestral land. He wouldn’t have been able to bear the consequences of that.</p><br/><p>In his estimation, when it came to killing Meng Hao, reducing the risk and aftermath was only a matter of using his bloodline’s status in the clan a bit cleverly.</p><br/><p>After grabbing the identity medallion from the bag of holding and tossing it aside, Meng Hao pulled a jade box out. It glittered with bright light, and emanated strong Immortal qi.</p><br/><p>After opening it, he began to pant, and his eyes shone brightly.</p><br/><p>Inside the jade box was a tiny bell made completely of jade. It was exquisitely beautiful, and Immortal qi swirled around it. Meng Hao instantly recognized that it was an Immortal treasure of the highest quality. It was definitely no ordinary object.</p><br/><p>He picked up the tiny bell and held it in his hand. Then, he sent some Immortal qi from his Immortal meridian into the bell, which caused it to emit a droning sound. It flew up into the air above his head, growing to a size of three meters and rotating around him, emitting countless magical symbols at the same time.</p><br/><p>An intense pressure immediately spread out.</p><br/><p>Meng Hao’s eyes shone, and he took a deep breath.</p><br/><p>“As far as Immortal treasures are concerned, this bell is definitely of an extremely high quality!” He could sense the Immortal might emanating off of the bell, and his eyes glittered as he opened his mouth and breathed in. In response, the bell shrunk and then turned into a beam of light that shot into Meng Hao’s mouth and came to rest inside of his Immortal meridian.</p><br/><p>Immediately, his entire body filled with the echoing toll of a bell. The bell began to emit bright light, and at the same time, his Immortal meridian grew more solid.</p><br/><p>Meng Hao’s spirits were instantly lifted. What he didn’t know was that this Immortal bell had been a gift prepared by Fang Xiushan for that clan Elder. Although it wasn’t an Ancient treasure, it was an extremely high quality Immortal treasure, and with a bit of refining could have been turned into something similar to an Ancient Realm treasure.</p><br/><p>Ancient treasures were rare, and were something that many Ancient Realm experts didn’t even possess. Even though the man had been a Fang Clan elder, he had only extinguished one Soul Lamp, and therefore didn’t qualify to acquire Ancient treasures from the clan.</p><br/><p>Actually, Fang Xiushan had expended quite a bit of resources a few years back to acquire the tiny bell. However, for the sake of having Meng Hao killed, he had employed everything at his disposal.</p><br/><p>“He was a clan Elder, and all he had was this one magical item?” Meng Hao seemed a bit skeptical, but then he remembered all of the magical items that had shattered in the moment of his death.</p><br/><p>“There seem to be many unique aspects to the Ancient Realm,” he thought. He scanned the rest of the jade slips in the bag of holding, and then suddenly, his eyes came to rest on one of them. After further scanning, his face darkened.</p><br/><p>This jade slip was a bloodline tracker. He could clearly see nine dots of light, one of which represented himself. The other eight were spread out in various directions, and were all heading towards him.</p><br/><p>The nearest one wasn’t very far away.</p><br/><p>“So, you actually sent nine people to kill me.” Meng Hao’s eyes were like ice as he sent out some divine will that caused the terracotta soldier to stop in place, then change directions. Suddenly, it began to speed off in the direction of the dot of light closest to Meng Hao.</p><br/><p>“There’s no need to come looking for me,” said Meng Hao. “I’ll come to you!” He sat there cross-legged atop the statue, his eyes boiling with murderous intent. His pupils shone with an intense light like that of a razor-sharp blade.</p><br/><p>As of this moment, his entire person seethed with the desire to kill.</p><br/><p>He wouldn’t dare to kill anyone inside the Fang Clan itself. That was a violation of clan rules. However, in this place… he had no compunctions whatsoever. Since these people had come here to kill him, then he might as well return the favor one by one!</p><br/><p>“This place won’t open up again for two months. That’s plenty of time for me to have some fun with you people!” Powerful killing intent flickered in his eyes, and the murderous aura which surrounded him grew stronger.</p><br/><p>Up above, the Seventh Patriarch followed along, his excitement and interest in Meng Hao growing stronger.</p><br/><p>The terracotta soldier moved with such incredible speed that it caused sonic booms to echo out. It shot forward, seemingly slicing a hole into the air of the ancestral land.</p><br/><p>Meng Hao sat cross-legged up above, his hair whipping about as the powerful wind buffeted his true Immortal fleshly body.</p><br/><p>Roughly five hundred kilometers ahead of him, a beam of light shot through the air, within which was a black-robed young man. Although his appearance was young, there was something about the way he furrowed his brow that seemed to carry an ancient will.</p><br/><p>He was surrounded by nine lamps, which rotated around him. Just like the other man, eight were burning and one was extinguished. These Soul Lamps didn’t seem to be real, but rather illusory.</p><br/><p>His passing caused the sky and the land to distort, and he kept his hands clasped behind his back as he proceeded.</p><br/><p>His expression was calm, but a gleam of vigilance could be seen deep in his eyes.</p><br/><p>“I can’t believe one of us died….” he murmured, his eyes flickering. “All we’re supposed to do is kill someone from the Junior generation, and yet somebody actually perished…. Furthermore, he wasn’t killed by something dangerous from within the ancestral land. He died a short time after making contact with that member of the Junior generation.” A strange gleam appeared in the young man’s eyes. Moments ago, one of the dots of light had vanished from the jade slip he had been observing, which left him shocked.</p><br/><p>“No wonder Fang Xiushan wanted nine of us to come in here. This Junior… must be harboring some incredible secret!</p><br/><p>“Whatever that secret is, it enabled him to kill an Ancient Realm cultivator with one extinguished Soul Lamp, while he himself barely counts as being in the Immortal Realm!</p><br/><p>“However, whatever method he’s using definitely can’t be used long-term.” A cold glow appeared in the young man’s eyes, and his pupils glittered with greed. He lifted his right hand and sent divine sense into the jade slip held therein. Then, his face flickered, and he suddenly stopped in place.</p><br/><p>“That can’t be right,” he thought, frowning. “He changed direction, and now he’s heading toward me…. And look at how fast he’s moving! Even with a true Immortal fleshly body, he shouldn’t be able to move that fast!” The young man hesitated.</p><br/><p>“Is it just an empty show of strength, a bluff? Is he just trying to scare me off, or… does that secret technique give him the confidence to think he can kill me?” The young man’s eyes flickered a few times before filling with determination.</p><br/><p>“It doesn’t matter. I can just check the situation out from a distance to see whether or not he’s just putting on a show.” With that, the young man hovered there in midair, coldly looking off into the distance as he waited for Meng Hao to approach.</p><br/><p>He was being very cautious, and was even ready to flee away at top speed if necessary. He kept his cultivation base rotating, ensuring that he was at the peak of power and readiness.</p><br/><p>After enough time passed for an incense stick to burn, a rumbling sound could suddenly be heard from off in the distance. Everything began to shake.</p><br/><p>Even the condition of the sky changed; the clouds churned, and endless bolts of lightning danced about.</p><br/><p>The young man’s eyes went wide, and he sent his divine sense out to scan the area up ahead. It was at this point that a tremor ran through him, and his eyes went wide with disbelief. He couldn’t even breathe, and his eyes bulged. It almost looked like someone was strangling him. His mind filled with a buzz, as if someone has struck him hard on the top of the head.</p><br/><p>He staggered backward, panting, face pale.</p><br/><p>“That’s… that’s….” He almost didn’t dare to believe what he was seeing. “What is that!?!?”</p><br/><p>Tens of thousands of meters up in the sky, the clouds parted as an enormous statue appeared. It was thousands of meters high, and caused the clouds to surge away from it as it descended.</p><br/><p>Its energy was shocking and virtually impossible to describe!</p><br/><p>Its speed was incredible, causing flames to lick the air around the terracotta soldier. It was like a shooting star!</p><br/><p>Meng Hao sat cross-legged atop the terracotta soldier, eyes flashing with killing intent. He looked like a drawn sword that refused to be sheathed without shedding blood!</p><br/><p>RUMMMBLLLLE!</p><br/><p>Massive roaring sounds filled the air as the terracotta soldier screamed through the air toward the black-robed youth. As it neared, the aura of a Quasi-Dao Paragon rippled out in all directions, shaking everything.</p><br/><p>The terracotta soldier’s eyes were icy and emotionless, and it held a greatsword in its hand. When the young man saw all of this, his face drained of blood.</p><br/><p>“That’s the ancestral land’s Dao Guardsman!!</p><br/><p>“It has the aura of a Quasi-Dao Paragon!!</p><br/><p>“How… how could this be? He… he can actually control the Dao Guardsman!?!?” The black-robed young man’s scalp was tingling so hard it seemed like his head was about to explode. Flabbergasted and scared witless, he didn’t even have time to think. He immediately turned and employed all the power he could muster in a mad dash to flee.</p><br/><p>As of that moment, he cursed the fact that he had only extinguished one Soul Lamp. He cursed the fact that he couldn’t flee fast enough. He cursed the fact that he had been conceited enough to just stand there waiting for his opponent to arrive.</p><br/><p>He suddenly understood why that other Ancient Realm Elder had died!!</p><br/><p>“Damn you, Fang Xiushan!! I can’t believe you sent us in here to kill a monster who can control the Dao Guardsman! You… you didn’t send us in here to kill him… you obviously sent us in here so that he could kill us!!” The black-robed young man’s heart was pounding, and his face was as white as death. Nearly frightened out of his mind by the sense of deadly crisis, he roared, spitting out blood and using all the secret magics he knew to try to get away.</p><br/><p>-----</p><br/><p>Note from Deathblade: Please e-mail typos or mistakes to <span class=\"__cf_email__\" data-cfemail=\"a6cfd5d5d2ce8bc2c3c7d2cec4cac7c2c3e6dfc7cec9c988c5c9cb\">[email protected]</span></p><br/>\n</div>"}