{"title": "Chapter 943: Killing Intent Approaches!", "id": 943, "volume": 10, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-943-killing-intent-approaches", "volume_title": "Volume 10", "body": "<h1>Chapter 943: Killing Intent Approaches!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong></strong></p><br/><p>[/expand]</p><br/><p>Several days later, Meng Hao emerged within the clan. All the clan members who he ran into looked at him with extreme respect, and the fervor with which people had previously treated Fang Wei was now shown toward Meng Hao.</p><br/><p>As for Fang Wei, he had apparently disappeared, and was nowhere to be found.</p><br/><p>Fang Xi made some inquiries, and finally got a smattering of information that he immediately passed on to Meng Hao. When Meng Hao heard that Fang Wei was in secluded meditation in an attempt to break through to true Immortality, his eyes flickered coldly.</p><br/><p>“A Writ of Karma will lock down the Nirvana Fruits inside of him that belong to me. My good fortune with the sun was a huge blow to his self-confidence, and surely cracked his Dao heart. And yet, he stood up tall after all of that.” He thought about their interchange high up in the sky for a moment, and sighed.</p><br/><p>Meng Hao was displeased with Fang Wei, but all told, he was not guilty of any terrible crimes. In fact, Meng Hao knew that if he looked at things from Fang Wei’s perspective, Fang Wei hadn’t done anything wrong.</p><br/><p>“The ones who are wrong...are certain other people in this clan,” he mused. As he thought back to everything that had happened since he had returned to the clan, he was struck with the increasing sensation that there was some vast conspiracy afoot.</p><br/><p>It was a mystery involving Fang Wei, and also had something to do with the Grand Elder. Perhaps… even a Patriarch.</p><br/><p>That was why the Grand Elder had been acting so strange. That was why everyone maintained silence regarding Fang Wei. Apparently, a Patriarch had appointed Fang Wei to a position of authority years ago, although Meng Hao wasn’t completely sure of the truth behind it all.</p><br/><p>It was as if the entire matter was taboo. No one dared to speak of it.</p><br/><p>“Do you understand…?” That was what Pill Elder had said to him on the mountain peak. [1. Pill Elder talked to Meng Hao in chapter 926]</p><br/><p>“Was he warning me that there was something wrong with the Nirvana Fruits the Grand Elder gave me? Or was he hinting at something else…?” Meng Hao frowned. After considering that matter for a bit longer, he began to duplicate some Spirit Extract, which he placed onto the Nirvana Fruit.</p><br/><p>Meng Hao had already decided that once he fully restored the Nirvana Fruit, he would definitely absorb it. He had the feeling that the benefits it would provide him would be immense, and would help him begin to unravel the enigma of the Fang Clan.</p><br/><p>That feeling stemmed from his confidence in his ability to analyze and judge matters, as well as his keen intuition.</p><br/><p>“Nobody has ever been able to absorb the first generation Patriarch’s Nirvana Fruits. I wonder what miracles will result if I succeed?” After a while, he stopped considering the matter, and calmed his mind.</p><br/><p>Seven days later, Meng Hao looked worriedly at the copper mirror, which had rapidly consumed all of his hard-earned spirit stones in exchange for batch after batch of Spirit Extract. That Spirit Extract had then been greedily absorbed by the Nirvana Fruit.</p><br/><p>As he nourished the Nirvana Fruit with the Spirit Extract, it seemed to be gradually awakening, as if… it were almost completely restored.</p><br/><p>As the copper mirror consumed all of the spirit stones he had acquired from concocting the Skypalace Sunspirit Pill, as well as what he had gotten from Sun Hai, stabs of pain filled Meng Hao’s heart. It was as if he had just thrown away a vast sum of spirit stones directly into the Nirvana Fruit.</p><br/><p>Each one of those spirit stones was enough to break Meng Hao’s heart.</p><br/><p>“Making money is so hard, so how come spending it… is so easy?” he thought with a sigh.</p><br/><p>Even the entire Fang Clan would be incapable of producing so much Spirit Extract. After all, the medicinal plants he had used to make it were the ones he had acquired in the Ruins of Immortality, plants which were rare and, in fact, virtually extinct in the outside world.</p><br/><p>As such, this Spirit Extract was essentially priceless. Not even the Fang Clan as a whole would be able to afford to restore this Nirvana Fruit; only Meng Hao, with his copper mirror, could manage it.</p><br/><p>“Dammit!” he thought, gritting his teeth and then letting out a long sigh. “I need to think of yet another plan to make some more spirit stones….” He sat there with furrowed brow for a long time before finally clenching his jaw.</p><br/><p>“Those sacred pills are not easy to concoct. They will be my last resort. I still haven’t finished the seventh level of the Medicine Pavilion. I should take advantage of the fact that I’m so famous in the Fang Clan right now. Maybe I can strike it rich in one fell swoop!” Having made up his mind, he called Fang Xi over and the two of them spent some time discussing the matter. Finally, Fang Xi left in excitement to enact the plan.</p><br/><p>It only took a few days for word to spread through the clan like stormwinds.</p><br/><p>“Did you hear? Tomorrow, Prince Hao is going to the Dao of Alchemy Division to challenge the Medicine Pavilion!”</p><br/><p>“Last time he went to the Medicine pavilion, he completed every level perfectly! It caused a huge sensation in the Dao of Alchemy Division.”</p><br/><p>“From ancient times until now, it’s been easier to find a phoenix feather or a qilin horn than to find someone who can make it through the ninth level of the Dao of Alchemy’s Medicine Pavilion. Each and every one is a Grandmaster of the Dao of Alchemy. I heard that Prince Hao’s goal is just that: to make it through the ninth level!”</p><br/><p>News about Meng Hao challenging the Medicine Pavilion quickly spread through the clan, and especially through the Dao of Alchemy Division. In the end, it was like great waves rolling across the entire clan.</p><br/><p>Meng Hao was very pleased with this sort of clan environment, and had things all worked out with Fang Xi. Fang Xi would wait outside the Medicine Pavilion area to collect spirit stones. Anyone who didn’t pay spirit stones would not be allowed to observe.</p><br/><p>Before, it would have been difficult for Meng Hao to pull something like that off. However, after the rising of the East Ascension Sun, he was the number one Chosen in the Fang Clan, and his every word and deed was the subject of widespread attention.</p><br/><p>“This time, I’m definitely going to make a killing!” he thought. The next morning at dawn, he woke early and pushed open the door of his residence. Just when he was about to fly into the air toward the Dao of Alchemy Division, he saw six beams of light flying toward him at high speed. They quickly arrived and surrounded him.</p><br/><p>These six people surged with energy. Five of them were stage 7 Immortals, and Meng Hao could sense that the remaining one had a cultivation base as profound as a deep sea. He was a middle-aged man with a grim face who looked Meng Hao over and then said, “The Grand Elder has summoned you, Fang Hao. Come with us.”</p><br/><p>Meng Hao frowned at the six men and then coolly replied, “Understood. I’ll go over a bit later.”</p><br/><p>With that he strode forward and prepared to fly past the men.</p><br/><p>When the middle-aged man heard Meng Hao’s response, his face tightened with displeasure.</p><br/><p>“The Grand Elder has summoned you, and you dare to cause a delay? You’re coming with us now, or else—”</p><br/><p>“Or else what?” said Meng Hao, stopping in place and looking at the man with an enigmatic smile. A vast coldness swirled deep within his pupils.</p><br/><p>“Arrest him!” said the man, staring back at Meng Hao.</p><br/><p>Immediately, the other five stage 7 Immortals transformed into beams of light, and their cultivation bases surged. Dharma Idols appeared, 21,000-meter illusory giants. Of course, none of these Dharma Idols represented the cultivators themselves; all of them were false Immortals!</p><br/><p>They closed in on Meng Hao in the blink of an eye. One of the Dharma Idols was an enormous war drum, which emanated a rumbling like that of thunder. Two of the other Dharma Idols were vicious black dragons, which roared as they slashed through the air toward Meng Hao.</p><br/><p>Of the final two Dharma Idols, one was a three-headed six-armed statue, and the other was an enormous crimson python with a forked tongue and sinister eyes.</p><br/><p>The five men all attacked simultaneously, and it didn’t look like they were trying to arrest Meng Hao. Instead, killing intent flickered in their eyes, although it was faint and well-concealed. However, Meng Hao had experienced many things during his life, including two intense wars on Planet South Heaven. He had also slaughtered countless people, so killing intent like this was something he was keenly attuned to.</p><br/><p>“Wanna kill me?” he asked with an icy cold smile. He took a step forward and clenched his right hand into a fist. It shot toward the crimson python at high speed, creating a sonic boom that echoed out in all directions. The air distorted as the power of Meng Hao’s true Immortal fleshly body exploded out.</p><br/><p>As the boom rang through the air, the crimson python shattered, revealing the cultivator behind it, ashen face awash with shock. Before he could retreat, Meng Hao leaped forward and kicked him viciously with his right foot. Cracking sounds could be heard as it slammed into the man’s chest, and blood sprayed from his mouth. He tumbled backward.</p><br/><p>At the same time, the other four cultivators closed in, divine abilities and magical techniques raging. Meng Hao’s face flickered with iciness. Instead of dodging to the side, he turned and transformed into a golden roc, then shot directly toward his four opponents with incredible speed. A wave of a hand caused numerous mountains to appear, which formed a mountain chain that dropped down toward them.</p><br/><p>Next, he made a grasping motion, and a long spear appeared in his hand, the haft carved from the World Tree and the spearhead made from white bone. When he stabbed forward with it, everything darkened, and a sobbing sound rang out. The war drum collapsed into pieces, and the cultivator within it coughed up blood and fell into retreat.</p><br/><p>Simultaneously, the head of a Blood Demon appeared, and a blood-colored halo materialized beneath Meng Hao’s feet. He punched again, and the three-headed, six-armed statue exploded. At the same time, the two black dragon Dharma Idols managed to land attacks on Meng Hao’s chest.</p><br/><p>The two cultivators controlling the black dragons glared with killing intent. Their cultivation bases exploded with power that would be enough to fell virtually any other cultivator who was weaker than a stage 7 Immortal.</p><br/><p>A boom could be heard, and suddenly everything went silent. The two cultivators who had just successfully landed attacks on Meng Hao stared in shock, and then gasped. It wasn’t that they weren’t aware that Meng Hao had a true Immortal fleshly body. However… in their minds, his cultivation base was not at the true Immortal stage, so therefore, they didn’t believe his true Immortal fleshly body would really be all that powerful.</p><br/><p>As of this moment, though… they had a clear idea… of what exactly a true Immortal fleshly body was!</p><br/><p>“So weak!” Meng Hao said casually. He glared at the men aggressively, and it was like piercing light stabbing into their eyes.</p><br/><p>Meng Hao hadn’t even budged an inch. In fact, he didn’t even appear to be harmed at all. At the same time, the two men who had just attacked him felt a powerful counterattack surging toward them, and suddenly, blood oozed out of their mouths.</p><br/><p>The two men were scared witless, and were about to retreat when Meng Hao reached out and grabbed one of them, then lifted him into the air and shook him back and forth. The man couldn’t control his own body, and felt massive power battering him. Cracking sounds could be heard as his bones were broken and dislocated, and he was then thrown violently toward the second retreating man.</p><br/><p>A boom rang out as the second man was sent tumbling backward, his bones shattered and blood spraying from his mouth.</p><br/><p>All of this took place in only a few breaths’ worth of time. Five stage 7 Immortals were seriously injured, and Meng Hao remained standing there. He then turned toward the first middle-aged man, the one with the unfathomable cultivation base.</p><br/><p>The man’s eyes widened. He had never imagined that a true Immortal fleshly body would be so shockingly powerful. It was an exceedingly rare thing for a cultivator to have a fleshly body developed to this level, and was in fact something he had never seen before.</p><br/><p><strong>Chapter 943: Killing Intent Approaches!</strong></p><br/>\n</div>"}