{"title": "Chapter 956: A Struggle of Generations!", "id": 956, "volume": 10, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-956-a-struggle-of-generations", "volume_title": "Volume 10", "body": "<h1>Chapter 956: A Struggle of Generations!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 956: A Struggle of Generations!</strong></p><br/><p>A tremor ran through Meng Hao, and he began to pant. He knew that this area was somewhere he should never even have been able to step into. Furthermore, his cultivation base should have been at the peak of the Ancient Realm before attempting to accept the legacy of the Fifth Hex.</p><br/><p>And yet, because of the terracotta soldier, here he was!</p><br/><p>Meng Hao’s eyes narrowed, and he didn’t immediately take action. He still remembered the sense of crisis he had felt because of the Sixth Generation Demon Sealer, and thus, he proceeded with caution and even a bit of hesitation.</p><br/><p>He did not sense any feeling of danger from the Fifth Generation Demon Sealer, and the ancient Demon Sealing Jade hadn’t acted strangely. He muttered to himself for a bit, unwilling to give up so easily.</p><br/><p>“It’s too bad my second true self is still in the process of recovering after being destroyed. If he was here I could have him try it out first.” After a moment, his eyes shone with determination.</p><br/><p>Rewards come only with risk, and it is better to take a gamble than to simply give up.</p><br/><p>He decided to hesitate no longer. He walked up to the young man and bowed. Then, maintaining full vigilance, he gradually sent his cultivation base to rotating. If anything unexpected happened, he would use all of his divine abilities to flee instantly. Furthermore, he used divine will to have the terracotta soldier stand guard next to him.</p><br/><p>As he crossed his legs and began to meditate, the young man slowly extended his arm and pushed down on Meng Hao’s forehead.</p><br/><p>The two of them suddenly seemed to be connected through ages of time and distant space.</p><br/><p>A legacy was being passed on!</p><br/><p>They were separated by many generations, by many years, and by the distance between them. Despite that, they were both here in the Fang Clan ancestral land, performing the bequeathment of a legacy!</p><br/><p>A massive rumbling like a Dao river or a Heavenly sea poured into Meng Hao’s forehead. In the blink of an eye, he felt as if his mind would collapse, his head explode.</p><br/><p>His heart trembled as though lightning were exploding relentlessly inside of him. His face instantly turned ashen, and blood oozed out of his mouth. An intense sense of deadly crisis appeared. There was no sensation that made him think the young man in front of him wished him dead. It was simply that Meng Hao’s cultivation base was insufficient, not strong enough to support the legacy.</p><br/><p>However, he gritted his teeth and, expression one of determination, continued to accept the legacy that he originally should not have been able to accept given his current level of power.</p><br/><p>His body gradually came to occupy a space between illusory and corporeal. His aura weakened, as though the flame of his life force were dimming.</p><br/><p>Up in midair, the Seventh Patriarch stared in confusion. He was able to tell that something strange was going on with the Ancient Burial Ground because Meng Hao had entered it.</p><br/><p>He looked closely at Meng Hao, and then, his pupils constricted as if he had just noticed something. He was visibly moved and took a deep breath.</p><br/><p>“He’s accepting a legacy!</p><br/><p>“This Ancient Burial Ground has been here for countless years. Although not many people are capable of reaching this location, there have been a few. Those rifts are locations of trials by fire, not legacies. And yet… this kid is actually contemplating enlightenment of a legacy!” The Seventh Patriarch’s mind filled with roaring.</p><br/><p>“But whose legacy is it that he can sense?” A profound gleam appeared in his mind as he looked in the direction of the Misty Heaven Vault off in the distance.</p><br/><p>Time passed slowly. Meng Hao’s aura grew weaker, and the flame of his life force dimmed. Anyone who could see him personally would realize that he was accepting a legacy. However, on the bloodline jade slip, it simply looked like he was dying.</p><br/><p>Of course, there were six other black-robed cultivators in the ancestral land in addition to Fang Daohong, and all of them were checking their jade slips. What they clearly saw was that the dot representing Meng Hao was growing weaker and darker. They also saw that Fang Daohong’s dot of light was very close to Meng Hao.</p><br/><p>This made it very easy for them to jump to the wrong conclusion.</p><br/><p>They all thought that Meng Hao’s light was growing weaker because of Fang Daohong.</p><br/><p>Although the remaining six black-robed men were in general being very cautious, all of them had different personalities. Some were decisive, some were hesitant, some were anxious, and some were impulsive!</p><br/><p>About five hundred kilometers from Meng Hao’s current location was a middle-aged man in a long black robe, whose eyes were glittering brightly. “Fang Hao definitely has some sort of valuable treasure. That’s how he was able to kill two Ancient Realm Elders in a row. Most likely, he can’t utilize the power of that magical item for a long time, because his cultivation base isn’t sufficient. And now… Fang Daohong is there…. Since he’s not dead, that means we have a chance!</p><br/><p>The man was skinny and had a long, hooked nose, making him look especially sinister.</p><br/><p>“A precious treasure that can enable a cultivator nearly in the Immortal Realm to be able to slay an Ancient Realm cultivator….” The middle-aged man hesitated for a moment, then looked at the bloodline jade slip again. What he noticed was that two other dots were already moving in Meng Hao’s direction, which caused his eyes to fill with determination.</p><br/><p>“I’m the closest, so as long as I’m careful, there shouldn’t be any problems!” Without hesitating any further, the man quickly shot off into the distance.</p><br/><p>At the same time, two other black-robed cultivators were nearing from two other directions. They were thinking the same thing as the first black-robed man, and rapidly began to close in on Meng Hao.</p><br/><p>As for the other three black-robed men, two of them wavered back and forth a bit before deciding to play it safe. The final black-robed man… was an old man who was standing at the entrance to the ancestral land, where the Dao Guardsman had once been.</p><br/><p>He was examining the collapsed mountains; the endless amounts of ruins and rubble that filled the area caused his mind to tremble. Unable to even think of what to say, he just looked at the scene for a while before taking in a deep breath.</p><br/><p>“The Dao Guardsman… is gone?” he thought. Great waves of shock filled him, and he began to shiver. A look of astonishment filled his eyes as he suddenly realized that the first Ancient Realm Elder who had been killed… died in this location.</p><br/><p>He almost immediately realized why. When the answer occurred to him, he could hardly believe it. However, that answer explained everything, as unbelievable as it was.</p><br/><p>“How could Fang Hao have possibly taken control of the Dao Guardsman!?!?” He took out the bloodline jade slip and looked at the fading dot that represented Meng Hao. Then he looked at the three other cultivators who were rapidly closing in on him. There was no way for him to get word to the others while he was in the ancestral land, so he could only watch as the three dots began to converge on Meng Hao, drawn like moths to the flame.</p><br/><p>“If those people die, then it will confirm my speculation that Fang Hao has somehow managed to take control of the Dao Guardsman!” The old man panted, unwilling to accept that he was correct, and yet unable to come up with any other explanation.</p><br/><p>Time passed by quickly. It was now three days later, and Meng Hao had already been in the ancestral land for about a month. Currently, he sat cross-legged in front of the stone stele, eyes closed, completely motionless.</p><br/><p>His aura was extremely weak, and the flame of his life force was almost on the point of being extinguished. His mind crashed with lightning and thunder as the legacy of the Fifth Hex continuously poured into him. The images he saw made him feel like he was descending into some bottomless abyss.</p><br/><p>It was as if his mind were being forcibly distended, which led to intense, tearing pain. He felt like he was stuck in a living hell.</p><br/><p>Because he was accepting a legacy like this with such a low cultivation base, his Eternal stratum had long since gone to work, and was in a perpetual state of support, ensuring that his mind did not collapse or explode.</p><br/><p>As for his true Immortal fleshly body, it was immense help in keeping his mind stable.</p><br/><p>As the legacy of the Fifth Hex poured into him, it began to form a pattern like that of a hand that continuously flipped back and forth in his mind.</p><br/><p>Sometimes it faced up, sometimes it faced down. That cycle seemed to contain Yin and Yang, as if the entire cosmos was hidden within it! It contained a great Dao of Heaven and Earth!</p><br/><p>The 100,000 rifts that surrounded him in the Ancient Burial Ground also went into a cyclical pattern, as if they were breathing. Occasionally they would open, other times they would close. From a distance, it looked like 100,000 eyes, continuously opening and closing.</p><br/><p>The cycle continued for three days, never ending.</p><br/><p>Fang Daohong had long since begun to gape at the scene. He was once again completely shaken by Meng Hao, and couldn’t help but view him as a terrifying figure, a cultivator essentially in the Immortal Realm, the likes of which he had never before seen.</p><br/><p>In fact, he had never even heard of anything like this.</p><br/><p>“If he reaches Immortal Ascension… he’ll definitely shake all of Planet East Victory!” Fang Daohong’s eyes shone with a strange light, and he suddenly realized that having his life or death controlled by Meng Hao, wasn’t actually… a particularly unacceptable thing.</p><br/><p>Up in midair, the Seventh Patriarch looked down at Meng Hao, and his mind trembled even more than Fang Daohong’s. His eyes shone with a brilliant light as he looked at Meng Hao, and he suddenly had the feeling that he was looking at the future of the Fang Clan.</p><br/><p>“He already has a true Immortal fleshly body, and the Immortal qi within him has almost reached the pinnacle….</p><br/><p>“He has absolutely no aura of an Immortality Illumination Vine on him. Or perhaps his Immortality Illumination Vine has already been fully absorbed by his Dharma Idol. In that case… this kid is going to reach Immortal Ascension in less than a hundred days!</p><br/><p>“In the future, he will definitely become a pillar of the Fang Clan!!”</p><br/><p>Meanwhile, outside of the Ninth Mountain, in the boundless sea among the stars, the Ninth Sea, a shocking aura suddenly exploded out.</p><br/><p>That aura caused vast mists to roil up from the surface of the sea, which formed into the shape of countless figures that seemed to dance about gracefully. Lightning crackled up above, and a Tribulation Cloud began to form.</p><br/><p>At the same time, an enormous Door of Immortality gradually came into view above the Ninth Sea!</p><br/><p>The Ninth Sea had countless islands, many of which were inhabited by cultivators. Currently, all of those cultivators’ minds filled with shock, and they looked up into the air. No matter how far away they were, they could sense the Immortal qi that was roiling out.</p><br/><p>“That’s… a Door of True Immortality!!</p><br/><p>“Who is about to reach true Immortal Ascension!? Who is about to batter open the Door of Immortality!?!?”</p><br/><p>As the cultivators on the various islands in the Ninth Sea were all shocked, a massive rift opened up in the surface of the sea below the Door of Immortality. From within that rift appeared another massive door, which rose up from inside the water.</p><br/><p>Inside the door was a young woman, behind whom floated a female corpse. The woman didn’t hesitate for a moment before flying up into the air toward the Door of Immortality.</p><br/><p>At the same time, more than a thousand cultivators also flew out of the door in the sea. There were men and women, and all of them wore extremely somber expressions as they fanned out in every direction to form a huge spell formation. Next, a hundred enormous sea dragons shot out of the door, roaring as they circled about the area to act as Dharma Protectors for the young woman. Ten old men also appeared, each one of whom emanated astonishing auras. All of them were at the peak of the Ancient Realm, and each one had extinguished a minimum of thirteen or fourteen Soul Lamps!</p><br/><p>These… were the cultivators of the Nine Seas God World! The Three Great Daoist Societies had deep reserves, as was plainly visible now!</p><br/><p>The last person to appear was an old woman who wore a sea-blue robe. Her aura superseded the auras of all the other cultivators present, as if her presence could cause even the Heavens to acquiesce to her.</p><br/><p>“Dong’er, your day of true Immortality has arrived,” the old woman said coolly. “Open that Door of Immortality, accept the Immortal qi, and achieve true Immortal Ascension!”</p><br/><p>Fan Dong’er took a deep breath and then shot toward the Door of Immortality.</p><br/><p>Lightning crashed and thunder boomed, and yet, it could do nothing to cause Fan Dong’er to even pause. Her body suddenly exploded with an energy that could rival the Immortal Tribulation itself.</p><br/><p>A great event was beginning, heralding the arrival of a new generation of Chosen. Among them was someone who had suppressed her cultivation in the previous era just for the sake of becoming a true Immortal in the current era. A cultivator of the Ninth Mountain and Sea, the second to follow in the footsteps of Pill Demon and achieve true Immortal Ascension… Fan Dong’er!</p><br/><p>As of this moment, people in sects and clans all over the Ninth Mountain and Sea used a variety of methods to observe as Fan Dong’er achieved Immortal Ascension above the Ninth Sea!</p><br/><p>Meanwhile….</p><br/><p>In the underworld of the Fourth Mountain, next to the Bridge of Reincarnation, a cold woman stood there, looking over her shoulder profoundly at what seemed to be the direction of the Ninth Mountain. It was as if she hoped to get one clear look at the Ninth Mountain so she would never forget it. Her long, black hair danced in the wind. She looked as graceful as a butterfly as she stepped forward into Reincarnation.</p><br/><p>In her previous life, her name had been Xu Qing.</p><br/>\n</div>"}