{"title": "Chapter 957: Inner Devils of the Chosen!", "id": 957, "volume": 10, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-957-inner-devils-of-the-chosen", "volume_title": "Volume 10", "body": "<h1>Chapter 957: Inner Devils of the Chosen!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 957: Inner Devils of the Chosen!</strong></p><br/><p>The Door of Immortality appeared above the Ninth Sea, and Fan Dong’er rose up into the sky. In the instant in which she slammed into the door, the various clans and sects throughout the Ninth Mountain and Sea could sense a sudden change in the Heavens.</p><br/><p>The change was not drastic; it was merely a slight strengthening in the Immortal qi of the Ninth Mountain and Sea. However, the change was like slight ripples on a glassy surface of water, and was detectable by many.</p><br/><p>It was most obvious in the areas around the Door of Immortality in the Ninth Sea. There, the Immortal qi surged as a great Dao descended. Rumbling filled the air, Tribulation Lightning crackled, and mists churned.</p><br/><p>Fan Dong’er was surrounded by Tribulation Lightning as she slammed into the Door of Immortality. Her eyes were filled with determination, and her heart was filled with one thought.</p><br/><p>“Meng Hao, I absolutely must surpass you!”</p><br/><p>Fan Dong’er was the second person in this generation after Pill Demon to attack the Door of Immortality. At the same time, the other Chosen who were in secluded meditation were preparing to emerge and attempt to break through to the true Immortal Realm. They could sense the change in the Immortal qi, but they ignored it. Eyes shining with determination, they continued with their secluded meditation.</p><br/><p>Zhao Yifan currently sat cross-legged in a secret chamber in the Sublime Flow Sword Grotto.</p><br/><p>“The age of true Immortal Ascension has arrived,” he murmured. “The Three Great Daoist Sects, the Four Great Clans, the Five Holy Lands, the Three Churches and Six Sects… have been building up power and resources for years, all for the Chosen who will become true Immortals.</p><br/><p>“They all plan to use their collected resources and dammed-up cultivation to surge forth into the true Immortal Realm. It will be like the saying ‘The bird is silent, but its first song amazes all men!’” Zhao Yifan’s eyes suddenly opened.</p><br/><p>“Opening 70 meridians is average. 80 meridians qualifies one to be Chosen. Opening 90 meridians… makes you the blazing sun of a generation!</p><br/><p>“Fang Mu… I wonder if you will be able to enter this age of true Immortality!?” Zhao Yifan’s eyes gleamed brightly. He had long since recovered from his injuries, as well as from the psychological blow he had suffered. However, he knew that deep within his heart, a shadow lurked, weighing down on him. It had become something like an inner Devil.</p><br/><p>Meng Hao, in his guise as Fang Mu, had become Zhao Yifan’s inner Devil!</p><br/><p>It was with his true identity of Meng Hao that he had become Fan Dong’er’s inner Devil!</p><br/><p>Similarly, all of the other Chosen he had encountered in the Ninth Mountain and Sea had inner Devils because of him!</p><br/><p>On Planet East Victory, in the Fang Clan’s ancestral mansion, Fang Wei was trembling. His life force aura occasionally glittered brilliantly, and occasionally went dim. Sometimes his features twisted savagely, while at other times he wore a smile. Strange ripples undulated off of him as he absorbed Immortal qi from the nine withered old men who surrounded him.</p><br/><p>“Fang Hao… true Immortality is upon me. If I fail, then there will no longer be a Fang Wei under the Heavens. However, if I succeed… then the instant I become a true Immortal, I will cut you down and sever this inner Devil of mine!”</p><br/><p>On Planet North Reed, in the restricted area in the Li Clan, there was a lotus pond. The pond waters were clear, and fish could be seen swimming to and fro. Birdsongs filled the air, along with the fragrance of flowers. It was like a miniature utopia. Li Ling’er sat there cross-legged atop a lotus. Her skin was clear and delicate, and slightly flushed. She wore a simple, plain robe, but it still managed to accentuate her exquisite and alluring body.</p><br/><p>She was also about to break through to the true Immortal Realm!</p><br/><p>At the same time, Wang Mu, Song Luodan, Taiyang Zi, Sun Hai, and many others were in their respective sects and clans, all preparing to break through to the true Immortal Realm.</p><br/><p>As all of these people made their breakthroughs, Meng Hao’s image floated in their minds. Meng Hao… had become the inner Devil of an entire generation of Chosen.</p><br/><p>Meanwhile, a young man sat cross-legged on an asteroid floating in the starry sky of the Ninth Mountain and Sea. He wore a black robe, and had long white hair. His features were handsome, and at the same time, ancient.</p><br/><p>Immortal qi swirled around him, and shockingly, he held an Immortality Illumination vine in his hand.</p><br/><p>“In the Wang Clan… Wang Mu is the blazing sun, and I have been forgotten. That doesn’t matter. The only thing I need is this Immortality Illumination Vine.” The young man lifted the Immortality Illumination Vine above his head and looked off into space.</p><br/><p>“Meng Hao, I very much look forward to the day when you and I can meet again….” This young man was none other than Wang Tengfei!</p><br/><p>At around this time, Wang Youcai, Fatty, Cheng Fan, and all of Meng Hao’s other companions from Planet South Heaven who had scattered out to the various other sects, were all being informed by Senior members of their respective organizations about the matter of true Immortality. All of them were looking up into the Heavens.</p><br/><p>“I wonder where Meng Hao is right now….” Fatty murmured, sounding a bit depressed.</p><br/><p>In the Kunlun Society, Chu Yuyan quietly sat there cross-legged. No Immortal qi swirled around her, but she wasn’t anxious. She had a whole thousand years after true Immortal destiny appeared in which she could achieve her own true Immortal Ascension.</p><br/><p>Although she couldn’t keep up with the first wave, she was confident that she would be able to reach true Immortality in those thousand years.</p><br/><p>“The age of True Immortality is here….” murmured Pill Demon, who stood on a nearby mountain boulder. He looked up into the stars.</p><br/><p>At the same moment, another person spoke those same words.</p><br/><p>It was an old man who stood there on Planet South Heaven, in a mountain in the Eastern Lands. He looked up into the Heavens and muttered the exact same sentence.</p><br/><p>That man… was Shui Dongliu.</p><br/><p>Meng Hao was unaware of the stir that had been caused in the Ninth Mountain and Sea due to Fan Dong’er’s Door of Immortality. He continued to sit cross-legged in front of the stone stele in the Ancient Burial Ground, accepting the legacy of the Fifth Hex.</p><br/><p>His aura was incredibly weak, and the flame of his life force seemed to be on the verge of being extinguished. The 100,000 rifts around him were trembling slightly, their cycles of opening and closing becoming more rapid. The Ancient Burial Ground was starting to look even more bizarre than usual.</p><br/><p>Gradually, mist appeared on the ground; it grew thicker as it spread out through the ancestral land, into all of the regions and areas.</p><br/><p>The mist also collected in the Ancient Burial Ground, and was especially thick in the area around Meng Hao. It covered the terracotta soldier, making it invisible even to divine sense.</p><br/><p>Meng Hao’s figure began to grow blurry.</p><br/><p>Fang Daohong was extremely frightened. He worried that if Meng Hao died, then because of the strange hexing magic, he would also die.</p><br/><p>As he continued to grow more and more frightened, a beam of prismatic light appeared off in the distance. It was another of the black-robed men, who shot in his general direction. Initially, his speed was not particularly fast, but at about thirty thousand meters away, the man seemed to catch sight of something that caused him to accelerate explosively.</p><br/><p>Fang Daohong’s eyes flickered as he turned to look at the man in the beam of light. He shot forward with incredible speed, coming to a stop about three hundred meters away. The man’s face was grim as he looked over.</p><br/><p>“Elder Daohong, we’re all in this together, if one of us hogs everything for himself, it will be difficult to explain to the others.” The man’s eyes glittered as he looked further into the Ancient Burial Ground. He saw Meng Hao sitting cross-legged in meditation, mostly covered by mists. He didn’t notice the terracotta soldier, which was now completely enveloped by the mists.</p><br/><p>His eyes sparkled with avarice, then he looked back at Fang Daohong and smiled insincerely.</p><br/><p>“If you want to go in there, I won’t stop you,” Fang Daohong said loftily. “However, there’s no need to play with words.” He snorted coldly, acting as he would under normal circumstances.</p><br/><p>The other black-robed man’s eyes flickered as he turned from Fang Daohong to look at Meng Hao. Inwardly, he was a bit hesitant. However, Meng Hao’s current state made it seem like he was on the verge of death; the man was unable to see that he was accepting a legacy.</p><br/><p>“Well, never mind then. Since you’re waiting patiently, Elder Daohong, then I’ll just wait with you.” With that, he smiled and then sat down cross-legged.</p><br/><p>Fang Daohong showed no reaction whatsoever to this. Inwardly, though, he breathed a sigh of relief. His life was now under Meng Hao’s control, and even if he appeared to be on the verge of dying, Fang Daohong wasn’t about to take any risks. In fact, he was even more nervous than Meng Hao would be; he feared that Meng Hao’s death would result in his own soul dispersing.</p><br/><p>After enough time passed for an incense stick to burn, Meng Hao trembled. Blood oozed out of his mouth, and only a tiny spark remained of his flame of life force. His body was now stiff, and he looked as pale as a corpse.</p><br/><p>The rifts around him flickered rapidly as they opened and closed. They were like 100,000 eyes blinking, and left Fang Daohong and the other black-robed man feeling incredibly shocked.</p><br/><p>One of them was nervous. The other one waited in anticipation.</p><br/><p>Around this time, two more beams of light sped along, apparently having detected Meng Hao’s abnormal state. They shot forward with explosive speed until they appeared at the border of the Ancient Burial Ground, where they turned into two black-robed men.</p><br/><p>As soon as they appeared, Fang Daohong’s eyes narrowed. One of the men didn’t pause at all, but rather, instantly shot into the Ancient Burial Ground. Taking advantage of a moment when the rifts were closed, he shot forward about three hundred meters.</p><br/><p>Fang Daohong’s heart began to thump, and the black-robed man who had arrived earlier frowned. After a moment, he also waited until the rifts were closed and then stepped forward into the Ancient Burial Ground.</p><br/><p>The third black-robed man also flickered forward, advancing toward Meng Hao.</p><br/><p>“Fang Hao has a valuable treasure! Let’s kill him and get the treasure. We can decide what to do with it afterward!”</p><br/><p>“Excellent plan!” After coming to an agreement, the three men waited until the 100,000 rifts closed again, and then advanced at top speed.</p><br/><p>Fang Daohong watched in silence, coldly eyeing the three men as they proceeded into the Ancient Burial Ground. Finally, he decided to join them, although he moved slowly, ensuring that he was bringing up the rear.</p><br/><p>Four men walked in a line, heading ever closer to Meng Hao in the center of the Ancient Burial Ground.</p><br/><p>Enough time passed for an incense stick to burn, in which time the 100,000 rifts opened and closed. Eventually, the two fastest men reached a position about six hundred meters from Meng Hao.</p><br/><p>Another tremor ran through Meng Hao at that point, but instead of just a trickle of blood oozing out, Meng Hao coughed up a huge mouthful of blood, and all color drained out of his face. At that point, the flame of his life force actually winked out.</p><br/><p>In that moment, the rifts in the area all shuddered and closed, leaving a clear path all the way to Meng Hao.</p><br/><p>With the exception of Fang Daohong, who was still extremely anxious and feared that he was about to die, the black-robed men’s eyes all glowed with greed. They had been acting very cautiously before, but that seemed to be forgotten as they exploded with speed. Rumbling filled the air as they closed in on Meng Hao.</p><br/><p>However, when the two black-robed men in the lead were only about thirty meters away, Meng Hao’s eyes suddenly snapped open. They were bloodshot, and his gaze was as sharp as a blade, filled with naked savagery.</p><br/><p>An indescribably terrifying aura suddenly exploded out from Meng Hao. In that instant, all of the closed rifts in the area suddenly opened simultaneously.</p><br/><p>It was like 100,000 eyes had instantly opened and were looking at the four men!</p><br/>\n</div>"}