{"title": "Chapter 976: Dao Corroboration!", "id": 976, "volume": 10, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-976-dao-corroboration", "volume_title": "Volume 10", "body": "<h1>Chapter 976: Dao Corroboration!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 976: Dao Corroboration!</strong></p><br/><p>In the Nine Mountains and Seas, the Elder generation always passed down a certain tradition to the younger generation of Chosen of the various sects and clans. That tradition was that when the age of true Immortals arrived, one must remember the saying... preparation is the key to success!</p><br/><p>By preparing well and accumulating profound resources, one could explode out with extraordinary power, and open up the most Immortal meridians possible.</p><br/><p>Therefore, for generation after generation, people would make preparations for the time when the age of true Immortality arrived. They would hold themselves back at the peak of the Spirit Realm and wait until they could unleash all of their resources to achieve true Immortal Ascension.</p><br/><p>Throughout all the years, that was how things were done. However, as of this moment, the Patriarchs of the Ninth Mountain and Sea were somewhat in a daze as they watched what was happening.</p><br/><p>As they looked at Meng Hao, all of a sudden they seemed to come to an understanding.</p><br/><p>Meng Hao also knew what it meant to prepare in advance to succeed.... It wasn’t just a matter of cultivation base, nor was it simply about forming Immortal meridians in advance. It also had to do with... destiny!</p><br/><p>Before someone attempted to achieve true Immortal Ascension, their advanced preparations involved the various destinies they encountered throughout their lives, as well as the Karma they sowed. All of those things were components to the preparation; however, there was a premise to such destiny....</p><br/><p>“He is corroborating his own Dao to achieve Immortal Ascension....” said the Fang Clan's Earth Patriarch, his voice light and hoarse. His expression was one of enlightenment.</p><br/><p>The old woman next to Fan Dong’er sighed.</p><br/><p>“Only those who achieve their own Immortal Ascension can wrest away good fortune from Heaven and Earth,” she said, “achieve true Immortal Ascension, and acquire the destiny to personally form Immortal meridians.”</p><br/><p>In that moment, all of the Patriarchs came to the same understanding. However, that didn't change anything. They had never personally watched while someone reached true Immortality on their own, but, they had seen far, far too many people fail.</p><br/><p>It would be easier to find a phoenix feather or a qilin horn than to find someone who had succeeded; that was how rare they were. From ancient times until now... Kṣitigarbha was apparently the only person who had ever succeeded. Now, however, there was one more.</p><br/><p>Although they reached this understanding, there were far more people who didn't understand. When the 110th Immortal dragon appeared, the Ninth Mountain and Sea was thrown into chaos. It was a commotion the likes of which had never occurred before.</p><br/><p>It paled in comparison even to the time that Meng Hao, using the pseudonym Fang Mu, had seized the title of first in the trial by fire. It was hard to say who was the first person to begin to cry out, but soon, all of the cultivators of the Ninth Mountain and Sea were yelling and shouting.</p><br/><p>“Th-tha’s... the 110th meridian!”</p><br/><p>“Crazy! This is insane! How could there possibly be an Immortal Realm cultivator in the world with 110 meridians!?!?”</p><br/><p>“Wait a second, something seems weird. Those two Immortal dragons that just appeared look different from the others. One is blood-colored! The other one... looks even more mysterious!”</p><br/><p>The 110th Immortal dragon was very unique and, although it emanated intense Immortal light, for some reason it gave people the impression that it was related to plants and vegetation. In fact, if you looked closely, you could even see that the dragon had seven different colors circling around in its body.</p><br/><p>Amidst the astonished cries of the crowds in the Ninth Mountain and Sea, Meng Hao stood there up in the starry sky, his heart calm as he probed these two new Immortal meridians. When he did, he could clearly sense Patriarch Blood Demon and the Resurrection Lily.</p><br/><p>As of this moment, all of the destiny and good fortune he had built up was now exploding out.</p><br/><p>“Now I understand that destiny is a type of preparation,” he murmured. “In light of that, what exactly are Immortal meridians...?” Even as he reached some form of enlightenment, he continued to contemplate the 110 Immortal meridians inside of him.</p><br/><p>“100 meridians really are a limit.... Cultivators’ bodies, their flesh and blood, can only form 100 meridians.</p><br/><p>“My extra eight meridians are actually not part of my flesh and blood. They are actually a different kind of meridian, constructed on a foundation laid by the bronze lamp’s smoke!” [1. Meng Hao laid that foundation with the bronze lamp in chapter 826]</p><br/><p>“It looks very similar to an Immortal meridian formed from flesh and blood, but actually, they are completely different on a structural level.</p><br/><p>“As for the other two Immortal meridians, they are also different. They were formed from the consolidation of power, one from Patriarch Blood Demon and the other from the Resurrection Lily.</p><br/><p>“Well then... what exactly are Immortal meridians...?” Slowly, he lifted his head, and his eyes shone with a bright light.</p><br/><p>“Immortal meridians are a type of verification! They are a declaration to Heaven and Earth that one is qualified to become a true Immortal. It’s undeniable proof; it doesn’t matter whether Heaven and Earth approve or not, in the end they WILL acknowledge you. It is also .... Dao corroboration!</p><br/><p>“That Soul Lamp’s power opened my path to true Immortality. My flesh and blood Immortal meridians pushed me to the pinnacle. The bronze dragon’s power helped me to expand upon that original Immortal meridian. Then, the power of Patriarch Blood Demon and the Resurrection Lily helped me to open up more Immortal meridians, and also... to understand them!</p><br/><p>“Immortal meridians acquired before true Immortality are a type of good fortune. However, all other types of preparations and magical techniques have the possibility to... become Immortal meridians!”</p><br/><p>“That is a manifestation of power, and a kind of concrete representation of the Dao!</p><br/><p>“Anything... can become an Immortal meridian!” Meng Hao reached enlightenment at this point, at which point something like fetters shattered within him.</p><br/><p>It was as if there were an obstacle inside of him that had suddenly shattered. As Meng Hao raised his head, his hair whipped about, and his clothes flapped in the wind. Brilliant light began to shine out of his eyes.</p><br/><p>“I understand....”</p><br/><p>Meanwhile, in the Ruins of Immortality, there was an Immortal’s cave. Sitting in that Immortal’s cave was a woman, the white-robed Paragon. A slight smile suddenly broke out on her cold face. That smile was faint, yet was something rarely seen on her.</p><br/><p>“Pretty good intuition!” she said softly.</p><br/><p>At the same time, there was a location in the Fourth Mountain and Sea that was filled with a sinister mist, within which was concealed the Yellow Springs, reincarnation, and the boundless underworld. This location was a resting place to which all dead souls eventually returned.</p><br/><p>Within that mist was a palace built from richly ornamented buildings. It emanated an ancient, archaic air and dense Yin qi. Gradually, in the depths of that mist, an enormous figure became visible, who sat there cross-legged.</p><br/><p>The figure looked like a statue, like an Immortal Divinity who exerted pressure over the entire underworld, as if he suppressed the entire Fourth Mountain and Sea. That figure’s eyes seemed as if they would remain eternally closed, and yet, in that moment, they suddenly cracked open slightly.</p><br/><p>“So, I am not alone in my Dao....” he said slowly, his voice echoing out through the Fourth Mountain and Sea.</p><br/><p>Back outside of Planet East Victory, Meng Hao’s eyes glowed, and as the cracking sounds emanated out of body, his enlightenment grew.</p><br/><p>“Anything can become an Immortal meridian,” he thought. “Such a thing would be impossible for other true Immortals, but for someone who has reached true Immortality on their own, it is possible!</p><br/><p>“Heaven and Earth cannot restrict or restrain me. I will not be caged by the starry sky, nor buried under the vault of Heaven!</p><br/><p>“I don't need any approval from Heaven and Earth! True, authentic Immortals approve of Heaven and Earth, not the other way around!” Rumbling filled Meng Hao’s mind. The cracking sounds grew more intense, and his body trembled even more violently. Brilliant light flickered out of his eyes as he suddenly raised his right hand and then pointed toward the Door of Immortality.</p><br/><p>“I freely cultivated the Sublime Spirit Scripture!” Meng Hao murmured. “I reached the great circle of Qi Condensation, acquired the Perfect Foundation, the Perfect Core, the Perfect Nascent Soul! I formed Perfect Dao Fruit, and even broke through into the Eternal stratum!</p><br/><p>“My will cannot be eradicated within an Eternity, so therefore, my Eternal stratum... will be the basis of my 111th Immortal meridian!</p><br/><p>“OPEN!” In that moment, his Eternal stratum surged, causing numerous motes of light to appear inside of him. Those motes of light rapidly formed together, transforming into... a 111th Immortal meridian right next to his other 110 Immortal meridians!</p><br/><p>The Door of Immortality trembled, and Immortal light surged out. Immortal qi poured into Meng Hao, solidifying his Eternal stratum Immortal meridian. The meridian grew stronger and stronger, and was soon completely formed!</p><br/><p>At the same time, the 111th Immortal dragon appeared outside of the Door of Immortality. It was a dragon of Eternity which caused the starry sky to tremble with its roaring.</p><br/><p>Everyone out in the Ninth Mountain and Sea stared in complete shock. When they saw the Eternal Immortal dragon appear outside the Door of Immortality, great waves of astonishment surged inside of them.</p><br/><p>“Y-yet another... Immortal meridian?”</p><br/><p>“Is he even human?”</p><br/><p>“Could he be an ancient Immortal, reincarnated into modern times?”</p><br/><p>Countless cries of shock could be heard.</p><br/><p>The Dao Realm Patriarchs of the various sects and clans were even more shaken than the other cultivators. People like them were extremely rare, and most sects and clans only had one. However, as of this moment, all of them emerged from secluded meditation and stepped out into the starry skies to stare toward Planet East Victory.</p><br/><p>“The Fang Clan... has produced an incomprehensibly exceptional person!” Waves of shock surged through the Patriarchs, and complicated expressions appeared on their faces.</p><br/><p>“If he is allowed to reach his potential...the Fang Clan will flourish tremendously!”</p><br/><p>“I’m afraid the course of future events is going to change. This matter isn't necessarily good for the Fang Clan, and is even less beneficial for the rest of us. As for who is worst off... it's the Ji Clan!”</p><br/><p>“The last person to corroborate the Dao on their own was the Lord of the Fourth Mountain and Sea, Kṣitigarbha. Now another person has corroborated their own Dao....” The eyes of the Patriarchs from the various sects and clans flickered, many of them with hesitation.</p><br/><p>It was at this point that more rumbling sounds emanated out from Meng Hao. More Immortal qi poured into him as a 112th Immortal meridian began to form inside of him.</p><br/><p>This was a Qi and Blood Immortal meridian that he formed from his true Immortal fleshly body!</p><br/><p>In the moment that Meng Hao achieved enlightenment on the fundamental nature of Immortal meridians, everything changed. Now, a 112th Immortal dragon roared into being next to the Door of Immortality.</p><br/><p>Each and every one of this Immortal dragon’s scales brimmed with the shocking power of qi and blood.</p><br/><p>It was at this point that, all of a sudden, a beam of light shot out from the peak of the Ninth Mountain. The light was gray, and it pierced through the starry sky directly toward Planet East Victory.</p><br/><p>The gray light moved with incredible speed, and seemed to be filled with the aura of Karma. Apparently, if any living being touched it, they would be infected by Karma, which could then be... severed!</p><br/><p>The beam of light turned into a blade of Karma Severing which, in the blink of an eye, appeared outside of Planet East Victory and then slashed down toward Meng Hao, who was right in the middle of forming Immortal meridians!</p><br/><p>Instantly, a cold voice echoed out from the Fang Clan’s ancestral mansion beneath the surface of Planet East Victory.</p><br/><p>“Ji Clan, dost thou dare!?”</p><br/><p>It was the clan’s Earth Patriarch, the Dao Realm Patriarch, whose face flickered as he suddenly vanished from his position and then reappeared out in the starry sky, right in front of the gray light. He waved his right hand, causing Essence power to surge out soundlessly. It slammed into the gray light; Karma power erupted, but was shattered and then faded away.</p><br/><p>The Dao Realm Patriarch retreated a few paces, and when he raised his head, his eyes were cold and somber. He raised his hand and pointed out into the sky, causing a massive ripple to sweep out from his finger, transforming into a shield which surrounded all of Planet East Victory.</p><br/><p>“Anyone who dares to mess with this qilin son of the Fang Clan will fight with me to the death! Even you, Ji Clan.... Don't force me to request the first generation Patriarch's corpse to come out; I'll lug him up the Ninth Mountain on my back and then only one of us will come out alive!”</p><br/>\n</div>"}