{"title": "Chapter 970: Paragon Immortal Palaces!", "id": 970, "volume": 10, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-970-paragon-immortal-palaces", "volume_title": "Volume 10", "body": "<h1>Chapter 970: Paragon Immortal Palaces!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 970: Paragon Immortal Palaces!</strong></p><br/><p>The 30,000-meter Dharma Idol shone with boundless golden light as it struck the seven-colored Immortal Tribulation Lightning. Meng Hao closed his eyes, and then began to merge with his Dharma Idol. When he opened his eyes, he was his Dharma Idol and his Dharma Idol was him!</p><br/><p>A fist descended, and the Heavens rumbled. A huge gap opened up in the Tribulation Clouds, and at the same time, numerous bolts of seven-colored lightning crackled toward Meng Hao.</p><br/><p>He did nothing to evade, instead allowing the Immortal Tribulation Lightning to strike him. He spread his arms wide, and his eyes were filled with nothing but the Tribulation Clouds.</p><br/><p>BOOOOMMMMMM!</p><br/><p>Time passed. The Tribulation Cloud clouds shrank down to sixty percent of their normal size. Fifty percent. Forty percent.... The seven-colored Immortal Tribulation Lightning seemed to be endless. Meng Hao's Eternal stratum worked ceaselessly, and his 30,000-meter Dharma Idol attacked relentlessly, causing Heaven and Earth to tremble as divine abilities were unleashed.</p><br/><p>Meng Hao threw his head back and howled. At the same time, his Dharma Idol suddenly expanded in all directions. Simultaneously, Meng Hao extended his right hand, within which appeared a rift.</p><br/><p>The rift only lasted for three breaths of time.</p><br/><p>It was the Fifth Demon Sealing Hex. During those three breaths of time, that rift became like a black hole in the void. It emanated an incredibly shocking gravitational force that instantly sucked the Tribulation Clouds into it.</p><br/><p>Thirty percent. Twenty percent. Ten percent!</p><br/><p>RUMBLE!</p><br/><p>When the rift vanished, the vast majority of the Tribulation Clouds had vanished with it. There weren’t even enough to cover all of Planet East Victory. Meng Hao hovered there in midair, face ashen, but filled with a desire to battle that was even more intense than before.</p><br/><p>He looked up at what remained of the Tribulation Clouds up in the sky, as well as the Immortal Palaces that floated behind them. Currently, they did not emanate as much threatening pressure as before.</p><br/><p>“Hey, Tribulation Clouds. SCRAM!” Meng Hao said coolly, waving his right hand. His Dharma Idol separated from his body, transforming into a golden beam of light that pierced through the Tribulation Clouds and then suddenly exploded.</p><br/><p>The explosion caused the remaining Tribulation Clouds to roil, after which a roaring sound echoed out from within as the clouds... shattered into pieces that scattered in all directions.</p><br/><p>Everyone looked on as the Tribulation Clouds... vanished!</p><br/><p>In that moment, all of Planet East Victory went completely silent. Both the members of the Fang Clan as well as the other cultivators stared in shock at the sky which was now completely empty of Tribulation Clouds.</p><br/><p>Transcending tribulation in this way was something completely unprecedented!</p><br/><p>Transcending tribulation with such madness was domineering to an incredible extent!</p><br/><p>It was as if Meng Hao was prepared to destroy anything that blocked his way along his path to Immortality.</p><br/><p>No one had ever been able to do something like this before, because no one had ever been comparable to a stage 10 immortal when transcending tribulation.</p><br/><p>This was... like saying, “If I want to become an Immortal, the Heavens can’t do anything to stop me!”</p><br/><p>This was... a domineering attitude that said, “If I want it, the Heavens had BETTER have it! If I don’t want it, the Heavens had better NOT have it!”</p><br/><p>It seemed unbelievable, but if one thought about it carefully... when someone was equipped with the battle prowess of the one hundred meridians of a stage 10 Immortal, then to that person, there was nothing impossible when it came to transcending Immortal Tribulation.</p><br/><p>After a brief moment of silence, Planet East Victory burst into a huge commotion. Everyone in the Fang Clan was yelling in excitement.</p><br/><p>They saw the look of madness, fervor, and obsession in Meng Hao’s eyes, and they knew that he was a member of the Fang Clan. The glory he brought to himself made them proud.</p><br/><p>“Fang Hao!”</p><br/><p>“Fang Hao!!”</p><br/><p>“Fang Hao!!!”</p><br/><p>Numerous figures flew up into the sky to sit cross-legged close to Meng Hao. None of them took any action, they just sat there... as Meng Hao’s Dharma Protectors!</p><br/><p>The entire direct bloodline mobilized. Fang Xi looked excitedly at Meng Hao, then threw his head back and laughed. Other than the direct bloodline, most of the other people who moved out to help Meng Hao... were members of the neutral clan branches. After seeing the future prospects that Meng Hao’s performance displayed, they were moved in an unprecedented way.</p><br/><p>When it came to choosing between Meng Hao and Fang Wei, they chose... Meng Hao!</p><br/><p>Fang Wei stood there silently, looking at Meng Hao. Yet again, his eyes flickered with the desire to do battle. In contrast, Fang Xiushan stood next to him, face pale, glaring at Meng Hao and roaring inwardly.</p><br/><p>“Damn you, Fang Hao! Why did you have to show up! You already left the Fang Clan! Why did you have to come back!? Why did you have to reach Immortal Ascension!? Why!?!?</p><br/><p>“And you, Fang Xiufeng! You were always ahead of me, always stifling me. And now, just when my own son is rising up like a qilin, your good-for-nothing child is suppressing him!!” Fang Xiushan just couldn’t keep calm. His entire body trembled, and his eyes shone with venomous hatred.</p><br/><p>The Grand Elder stood there, silent and taciturn.</p><br/><p>Fang Wei’s grandfather sighed softly and looked over at Fang Xiushan, his expression one of disappointment. Then he turned back to look at Fang Wei, and his expression changed to that of anticipation.</p><br/><p>Planet East Victory was completely shaken, and the sects and clans of the Ninth Mountain and Sea were astonished. By this point, Meng Hao’s name and face were firmly fixed within the minds of countless people, and many people were thoroughly fascinated to the point of zealotry.</p><br/><p>Of course, all of the Chosen watched in taciturn silence.</p><br/><p>“This matter isn't concluded yet. The Immortal Tribulation hasn't dissipated, and the Door of Immortality hasn’t been opened. We have yet to see... exactly how many Immortal meridians he will open!”</p><br/><p>Thoughts such as these were going through the minds of all of the Chosen who had recently ascended to true Immortality. Their eyes were all fixed in the direction of Planet East Victory and Meng Hao.</p><br/><p>The Patriarchs of the various sects and clans of the Ninth Mountain and Sea sighed, exchanged glances with those around them, and then began to discuss the matter.</p><br/><p>“Who of this generation can possibly match up to Meng Hao...? Perhaps only the famous star of the Three Great Daoist Societies’ trial by fire... Fang Mu!”</p><br/><p>“Fang Mu is obviously an assumed name. Nobody knows who he really is.... However, the Nine Seas God World accepted him as a disciple, and he still hasn’t accepted the top prize from the Three Great Daoist Societies. Eventually... he will definitely make an appearance.”</p><br/><p>“Perhaps he is the only one who can actually compare to Meng Hao. This generation doesn't belong to us any more, it belongs to them...”</p><br/><p>Actually, they weren’t the only ones thinking of Fang Mu. There were many other cultivators of the Ninth Mountain and Sea who also remembered Fang Mu’s eye-catching performance!</p><br/><p>He took first place in the Three Great Daoist Societies’ trial by fire!</p><br/><p>The old man from the Nine Seas God World with whom Meng Hao had developed a good relationship that year sighed. The Patriarch from the foremost of the Three Great Daoist Societies, the Immortal Ancient Daoist Rite, stared in the direction of Planet East Victory and smiled slightly, and his eyes shone with a bright gleam.</p><br/><p>“You are connected to the Immortal Ancient Daoist Rite by destiny.... Eventually, you will make your way here.”</p><br/><p>Meng Hao floated in midair above Planet East Victory, his hair floating around him. He took a deep breath, and his Eternal stratum continued to work as he looked up into the Heavens.</p><br/><p>There were no Tribulation Clouds. The only thing left in front of him were boundless Immortal Palaces that obstructed his path to the Door of Immortality.</p><br/><p>The Door of Immortality hovered there behind the Immortal Palaces, emanating powerful pressure.</p><br/><p>“The character ‘Immortal’ is made up of one person and one mountain. I should have a Dao Corroboration Mountain....” Meng Hao looked at the Immortal Palaces for a moment and then began to advance forward.</p><br/><p>“My Dao Corroboration Mountain should be the mountain which forever remains in my memory.... Mount Daqing.</p><br/><p>\"It's too bad that Mount Daqing is still in the State of Zhao, which was taken away by that bastard Patriarch Reliance. And right now, I have no idea where that old turtle bastard has gotten off to.</p><br/><p>“Since that’s the case, I will just have to become my own mountain. My fleshly body will be my mountain, and my soul will represent my life. One person , one mountain . I... am an Immortal !” Meng Hao’s energy surged, and his speed increased. In the blink of an eye, he was directly in front of the Immortal Palaces.</p><br/><p>In that instant, the figures moving about inside the Immortal Palaces looked like celestial soldiers. They turned toward Meng Hao and then charged in attack. At the same time, roaring sounds emanated out of the Immortal Palaces, which also flew toward Meng Hao in attack. They apparently wanted to crush him, and powerful Immortal might surged out as they neared.</p><br/><p>At first glance, it almost seemed impossible to count how many Immortal Palaces there were. However, there were actually 100,000, and they were illusory, not corporeal. They looked like 100,000 seal marks, crushing down toward Meng Hao. Furthermore, the Immortal Palaces actually emanated... the energy of a Paragon of the Immortal Realm!</p><br/><p>This was a tribulation that only an Immortal Realm Paragon was qualified to transcend.</p><br/><p>Colors flashed, and the starry sky shook as 100,000 Immortal Palaces screamed toward Meng Hao in illusory form.</p><br/><p>Incredible pressure weighed down on all the lands, causing Planet East Victory to shake. Meng Hao was the sole focus of this Immortal Tribulation, which he could sense on a profound level. It felt like innumerable heavenly mountains were crushing down onto him.</p><br/><p>His cultivation base surged, and his 30,000-meter Dharma Idol shone with golden light as it leveled a punch toward the first of the incoming Immortal Palaces.</p><br/><p>As the Dharma Idol punched out, celestial soldiers vanished, and the incoming Immortal Palace began to fall apart. In contrast, his Dharma Idol trembled a bit.</p><br/><p>Next, a second Immortal Palace was destroyed, then a third, and a fourth.... One Immortal Palace after another was crushed. Blood oozed out of Meng Hao’s mouth as he continued to attack.</p><br/><p>Unfortunately, he was slowly being pushed back down toward the surface of the planet. The Immortal Palaces never seemed to end, and apparently, they wanted to crush Meng Hao down into the ground and grind him into pieces!</p><br/><p>Every attack against the Immortal Palaces resulted in a backlash, making things increasingly difficult for Meng Hao. He could crush 10 of them, destroy 100, shatter 1,000. But... there were 100,000 in total!</p><br/><p>Their energy continued to rise, and the aura of an Immortal Realm Paragon spread out. It was as if all Immortals... would be forced to kowtow to this aura!</p><br/><p>If you didn't kowtow, you would be crushed!</p><br/><p>When the members of the Fang Clan saw what was happening, they grew increasingly nervous. The other cultivators on Planet East Victory were shocked. This Immortal Tribulation was something they had never seen the likes of before.</p><br/><p>Fang Xiushan was getting excited. He stared at Meng Hao, wishing that the Immortal Palaces would become a hundred times more powerful than they already were, and completely eradicate Meng Hao in an instant.</p><br/><p>The Patriarchs of the various sects and clans of the Ninth Mountain and Sea appeared to be visibly moved, and discussed the matter in hushed tones.</p><br/><p>“Those are images of Paragon Immortal Palaces!”</p><br/><p>“Only a Paragon among Immortals would be able to fight back against an Immortal Tribulation like that!”</p><br/><p>“I'm afraid that this Fang Hao... will proceed no further than this step.”</p><br/><p>Even as they murmured, Meng Hao punched out against another Immortal Palace. Blood sprayed from his mouth, and his Eternal stratum operated ceaselessly. His eyes grew even more vicious than before.</p><br/><p>“They're merely projections of Immortal Palaces with Paragon auras.... Well, I’ll just have to show this Immortal Tribulation... what the projection of a real Paragon entity looks like!</p><br/><p>“Now that I’ve come to this point, it doesn’t matter if I expose my identity. The time has come to show the Ninth Mountain and Sea that I am Fang Mu, and Fang Mu... is none other than me!” Meng Hao took a deep breath and extended his right hand, waving it through the air to employ his most powerful Paragon Daoist magic.</p><br/><p>“Paragon Bridge!”</p><br/>\n</div>"}