{"title": "Chapter 985: Fight!", "id": 985, "volume": 10, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-985-fight", "volume_title": "Volume 10", "body": "<h1>Chapter 985: Fight!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 985: Fight!</strong></p><br/><p>33 Immortal souls were completely shocking. Countless celestial soldiers kowtowed, causing the starry sky to tremble. Meng Hao stood in the void atop a pedestal, looking around as the signs gradually faded away.</p><br/><p>After they were completely gone, he was officially in the true Immortal Realm, and had reached the peak of the Realm, making him an Immortal Realm Paragon.</p><br/><p>In that moment, the Ninth Mountain and Sea was completely silent. All observing cultivators stopped breathing as the image of Meng Hao turned into a mark which was branded onto their hearts.</p><br/><p>It was an indelible mark that would never fade away!</p><br/><p>It didn't take long, though, for a hubbub to break out, especially on Planet East Victory. Everyone, including members of the Fang Clan and other clans, exploded into a huge commotion.</p><br/><p>Cries rang out in all directions.</p><br/><p>“Fang Hao!”</p><br/><p>“Fang Hao!!”</p><br/><p>“FANG HAO!!!”</p><br/><p>Meng Hao’s name was being shouted out by innumerable mouths, echoing out in all the Heavens, rocking the lands. As of this moment, he was the blazing sun of the Fang Clan, their pride and joy.</p><br/><p>Fang Xiushan stood in the crowd, his face a mass of ferocity. His fists were clenched tightly at his sides, and he was panting. Venomous ideas sprouted inside his mind and swirled violently.</p><br/><p>His taciturn father bowed his head so that no one would be able to see the sinister glint in his eyes.</p><br/><p>The Grand Elder stood not too far off, silent. He sighed inwardly.</p><br/><p>The rest of the members of the Fang Clan were crying out with joy. Up in midair, Fang Wei hovered calmly and silently, the desire to do battle that shone in his eyes growing more and more intense.</p><br/><p>All of the various sects and clans of the Ninth Mountain and Sea were boiling with excitement.</p><br/><p>Far up in the starry sky, Meng Hao turned to face Planet South Heaven, dropped down onto one knee, and bowed deeply.</p><br/><p>The eyes of all the cultivators in the Ninth Mountain and Sea were upon him as he bowed toward Planet South Heaven. What he was bowing to was not Heaven and Earth, and was not the planet itself. No, he was bowing to his father and mother!</p><br/><p>In that moment, Fang Xiufeng and Meng Li stood in the Tower of Tang on Planet South Heaven, watching Meng Hao. His mother was extremely excited, and tears of joy filled her eyes, as well as intense pride.</p><br/><p>That was her son!</p><br/><p>Fang Xiufeng couldn't keep his expression calm. A wide smile broke out on his face, the smile that comes from seeing one’s own son become like a dragon. He took a deep breath and then started to laugh.</p><br/><p>Naturally, he was well-aware who Meng Hao was bowing to.</p><br/><p>As of this moment, the rancor that had been building up in him after leaving the Fang Clan was finally released, thanks to his son Meng Hao. Not only had his son returned home to the clan, he had risen up to become a blazing sun.</p><br/><p>Outside of Planet East Victory, Meng Hao rose to his feet again. The signs had faded away, and now the 33 Immortal souls also vanished.</p><br/><p>It was then that the true Immortal Chosen of the Ninth Mountain and Sea felt their desire to fight raging, and their faces flickering with obssession.</p><br/><p>FIGHT!</p><br/><p>What did it matter if they were defeated? They would fight anyway!</p><br/><p>If they did not fight, then the inner Devil that Meng Hao had become would plague them for the rest of their lives, and that Devilish image would make it almost impossible to walk their own paths.</p><br/><p>Therefore, they had to fight!</p><br/><p>They needed to go all out, to hold nothing back and fight!</p><br/><p>Their only option was to confront him directly. That was the only way to ensure that they would have the chance for further breakthroughs in the future. That was the only way to guarantee that they could pursue their own Dao!</p><br/><p>Taiyang Zi was the first true Immortal Chosen to step into a teleportation portal. He was the Dao Child from Mount Sun, one of the Five Great Holy Lands. He was one of only two members of Mount Sun who had stepped into true Immortality in this generation. He had his pride, and he had his goals and obsessions, and he would fight!</p><br/><p>Rumbling sounds filled the air as he set foot into the teleportation portal and vanished. When he reappeared, shockingly, he was right outside of Planet East Victory. He immediately turned toward Meng Hao and began to fly toward him.</p><br/><p>“Meng Hao!” He did not shout the name Meng Hao used in the Fang Clan, Fang Hao, nor did he shout the name he had used in the Three Great Daoist Societies’ trial by fire. He shouted his true name, the name he had used on Planet South Heaven!</p><br/><p>His cry turned into something like a sound wave that surged out through the starry sky. Taiyang Zi then transformed into a sun that radiated boundless, scintillating light, shocking to the extreme as he barrelled toward Meng Hao.</p><br/><p>“Let’s fight!!” Taiyang Zi’s eyes were bright red, and he fairly burst with power. He had opened up more than 90 Immortal meridians, and all of them surged with power. The energy of a true Immortal erupted out.</p><br/><p>As his energy skyrocketed, sun-form Taiyang Zi instantly caught the attention of all cultivators, who were completely surprised.</p><br/><p>“They’re going to fight!!”</p><br/><p>“They have to fight this battle. If I were a Chosen, I would attack too. I wouldn't be afraid of losing, or of dying. What I would fear... would be not daring to fight! Not daring to draw my sword!”</p><br/><p>“This Taiyang Zi is the first person to attack! He will definitely be an extraordinary individual in the future!” Innumerable spectators were now waiting for the fight to begin.</p><br/><p>“In this era of true Immortals, whoever manages to defeat Meng Hao... will be able to rise to the top!”</p><br/><p>Meng Hao’s eyes glittered as he looked at Taiyang Zi shooting toward him. Back when he was making his breakthrough, he had assumed people would come to fight him. However, he never imagined that the first person to do so would be Taiyang Zi, and not Fang Wei.</p><br/><p>“Well,” Meng Hao said indifferently, “you owe me some money, you know....” His expression was very calm, as if his words were completely and utterly proper, without the slightest bit of impropriety.</p><br/><p>His words instantly caused Taiyang Zi’s aggressiveness to falter....</p><br/><p>All of the cultivators in the Ninth Mountain and Sea who were watching the event stared in shock.</p><br/><p>“But...” continued Meng Hao, “if you want to fight, then let's fight!” As soon as he finished speaking, brilliant light burst out of his eyes, and he took a step forward toward Taiyang Zi.</p><br/><p>As he stepped out, Taiyang Zi roared angrily, and his aggressive energy soared up again. Innumerable magical symbols appeared on the surface of his sun-form, which transformed into shocking ripples that shot toward Meng Hao. Taiyang Zi roared, then extended his right foot and began to spin in circles in an attack on Meng Hao.</p><br/><p>All of the power of his cultivation base burst out, just for this battle!</p><br/><p>Behind him, an enormous Dharma Idol appeared. Shockingly, it was an image of a sun, which merged with his divine ability to make his sun-form incredibly realistic. He looked exactly like a real heavenly body, as if he had poured all of his life force into this attack.</p><br/><p>Meng Hao’s right hand balled up into a fist, and as Taiyang Zi’s leg descended toward him, he casually struck out, almost as if he weren’t even trying!</p><br/><p>In the blink of an eye, the fist and the leg slammed into each other.</p><br/><p>A huge boom rose up, shaking the starry sky. The Heavens dimmed, and the wind changed direction. An intensely powerful shockwave spread out in all directions. All of the cultivators of the Ninth Mountain and Sea watched as Taiyang Zi's sun-form completely collapsed under the force of Meng Hao’s blow. It shattered and dissipated instantly.</p><br/><p>It was as if Meng Hao had detonated a sun!</p><br/><p>Blood sprayed out of Taiyang Zi’s mouth, and he flopped backward like a kite with its string cut.</p><br/><p>Meng Hao hovered in the starry sky. His hair was not flying about, and his clothing was completely smooth and unmoving. His fist remained outstretched in that pose for a moment, and then, face calm, he slowly pulled his arm back.</p><br/><p>One punch!</p><br/><p>Meng Hao had crushed the divine ability of a true Immortal Chosen with more than 90 meridians as easily as stepping onto dry weeds!</p><br/><p>The Ninth Mountain and Sea was completely silent. Although everyone had assumed that Meng Hao would win spectacularly, to witness what they just had just witnessed left them shocked. That was especially true... because although they weren’t capable of assessing the full extent of Meng Hao's power, they could now make some speculations.</p><br/><p>“That was only one punch.... He didn't even use his Dharma Idol....”</p><br/><p>“This Meng Hao, just... just how powerful is he!?!?”</p><br/><p>Even as everyone gave voice to their shock, Taiyang Zi managed to force himself to a stop. His face was pale, and he coughed up a huge mouthful of blood. He looked up, his face twisted with rage, and his desire to do battle even stronger than before.</p><br/><p>“Meng Hao, our battle isn’t over yet!</p><br/><p>“Secret magic, Sacred Sun Scripture!” Taiyang Zi performed a double-handed incantation gesture, then hit various pressure points on his body, 49 times. Apparently, he wanted to continue, but had reached his limit. His face turned bright red, after which he threw his head back and roared as his energy surged up.</p><br/><p>Moments ago, he had been filled with the power of more than 90 Immortal meridians. Now, though, ripples spread out that contained at twenty percent more than that level of power! He now had the energy of more than 110 Immortal meridians!</p><br/><p>Secret magic!</p><br/><p>Every sect and clan had Immortal Realm secret magics, powerful magics that could be cultivated at a heavy price, and were bestowed only upon members who qualified to study them.</p><br/><p>In fact, Meng Hao had never been able to learn any of the Fang Clan’s Immortal meridian secret magics!</p><br/><p>As Taiyang Zi’s energy rose up, his Dharma Idol disappeared, and in its place, shockingly, were 9 Immortal souls!</p><br/><p>Each of those Immortal souls took the shape of a sun, making it so that Taiyang Zi was backed by 9 suns. The suns linked together, transforming into a majestic image that emanated shocking energy.</p><br/><p>Booms echoed out in the Heavens, spreading out through the starry sky. Taiyang Zi’s eyes were bright red as he looked at Meng Hao. He suddenly pointed out, causing the 9 suns to shoot toward Meng Hao. At the same time, Taiyang Zi performed an incantation gesture, causing the power of more than 110 Immortal meridians to form an image of a bow in his left hand. He gripped the bowstring with his right hand, pulled it back, and then released it.</p><br/><p>“Sacred Sun Scripture, Immortal Arrow Nine Suns Destruction!”</p><br/><p>All eyes were glued on the scene playing out. Countless individuals felt their hearts pounding as a streak of golden light shot through the starry sky like a sharp arrow.</p><br/><p>Meng Hao’s expression was as calm as ever. It didn't matter that Taiyang Zi had unleashed a secret magic like this. Meng Hao simply sighed.</p><br/><p>“You owe me a lot of money, which makes fighting you a bit more tricky,” he said. Shaking his head, he took a step forward. As his foot descended, the 9 suns bore down on him, inundating him completely.</p><br/><p>“Detonate!!” roared Taiyang Zi. The 9 suns exploded, creating a deafening roar that sent ripples out in all directions. At the same time, the golden arrow stabbed in through the ripples.</p><br/><p>Taiyang Zi's face was ashen, and he coughed up a mouthful of blood. He was now much weaker; utilizing the secret magic was far too much of a drain on him. It was at this point that his eyes suddenly went wide with disbelief and astonishment.</p><br/><p>As the ripples faded away from the starry sky, Meng Hao became visible, hovering in the exact same position he had been before. He wasn’t injured in the slightest, and in fact, his expression hadn't even changed. Held in between his thumb and index finger was a trembling, golden beam of light.</p><br/><p>“Your debt is now doubled,” he said coolly. With that he pushed down, and a cracking sound could be heard as the golden light... shattered.</p><br/><p>Taiyang Zi coughed up a mouthful of blood, staggering backward in shock. He had been prepared for the possibility that Meng Hao could defend against his divine ability, but he could never have predicted that even after draining himself to unleash a secret magic, Meng Hao would actually... defeat it with only two fingers!</p><br/>\n</div>"}