{"title": "Chapter 1008: Why The Echelon Exists!", "id": 1008, "volume": 11, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-1008-why-the-echelon-exists", "volume_title": "Volume 11", "body": "<h1>Chapter 1008: Why The Echelon Exists!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong></strong></p><br/><p>[/expand]</p><br/><p>Meng Hao had risen to the top among the true Immortals, and was the Immortal Realm Paragon. After absorbing the Nirvana Fruits, he could leap into the legendary and ancient Immortal Emperor Realm, in which he could slaughter Ancient Realm cultivators with two extinguished Soul Lamps. He had long since shaken the entire Ninth Mountain and Sea.</p><br/><p>When you added in his performance as Fang Mu in the Three Great Daoist Societies’ trial by fire, he was clearly the most prominent figure in the Immortal Realm. As a result, each of the Three Great Daoist Societies was determined to have him.</p><br/><p>It wasn't just the Three Great Daoist Societies. The Five Great Holy Lands and the Three Churches and Six Sects were all extremely interested in Meng Hao. If it weren’t for the Three Great Daoist Societies, whose positions were proud and lofty, and the fact that Meng Hao was now the Crown Prince of the Fang Clan, meaning he couldn’t join any other sect BUT one of the Three Great Daoist Societies, then all of the other groups would definitely have started fighting over him.</p><br/><p>In addition to the Dao Realm Patriarchs from the other sects, Meng Hao saw various Chosen with whom he had fought earlier. All of them stood there silently, complex emotions swirling in their hearts.</p><br/><p>“His father might cultivate the Dao of the sword, but Hao’er’s path is different. He’s already become a Conclave disciple of the Nine Seas God World! How could he possibly join the Sublime Flow Sword Grotto?!” In addition to Fan Dong’er’s master, the old woman, the other person who had come from the Nine Seas God World was none other than the man who had presided over the trial by fire, the same one who had eventually come to praise Meng Hao so much, Ling Yunzi.</p><br/><p>“Who cares about that?” said the representative from the Sublime Flow Sword Grotto, his tone harsh. “He never formally joined the Nine Seas God World!” He was a middle-aged man, or at least, he looked middle-aged. In reality, his cultivation base was in the Dao Realm, and he looked as dangerous as an unsheathed sword.</p><br/><p>Seeing that both the Sublime Flow Sword Grotto and the Nine Seas God World were not budging an inch, the old man who was the representative from the Immortal Ancient Daoist Rite smiled slightly.</p><br/><p>“Fellow Daoist Fang,” he said, “why don’t you summon Meng Hao and ask him his opinion?”</p><br/><p>Fang Shoudao laughed heartily, but before he could say anything, the main door to the temple hall echoed with the sound of a cold harrumph. Meng Hao stalked in, instantly drawing the attention of all gazes inside the hall.</p><br/><p>As for the Dao Realm Patriarchs, this was their first time seeing Meng Hao in person, as opposed to his illusory image on a screen. It was also the first time anyone from the Three Great Daoist Societies had personally seen Meng Hao after he had reached true Immortal Ascension.</p><br/><p>Other than the various members of the Junior generation, all the other people in the hall were Dao Realm Patriarchs. It looked like more than half of all the Dao Realm experts in the entire Ninth Mountain and Sea were present. All of their eyes fell upon Meng Hao, causing him to feel enormous pressure. However, his expression didn’t change at all as he entered the hall. He glared coldly at Fang Shoudao, who cleared his throat a bit guiltily. Fang Yanxu sat off to the side, looking a bit helpless. He coughed dryly a few times.</p><br/><p>Everyone was looking at Meng Hao as he stated,</p><br/><p>“I will join....”</p><br/><p>However, before he could finish speaking, the faces of the three Patriarchs from the Three Great Daoist Societies flickered. Intense gleams appeared in their eyes, especially the white-haired old man from the Immortal Ancient Daoist Rite. Normally, he looked kind and amiable, but as of this moment, his eyes shone with an extreme brightness.</p><br/><p>When the members of the other sects saw this, they stared in shock.</p><br/><p>The old man from the Immortal Ancient Daoist Rite sucked in a deep breath. His expression was very serious as he exchanged a glance with the old woman from the Nine Seas God World and the middle-aged man from the Sublime Flow Sword Grotto. Then he turned back to Fang Shoudao and spoke gravely, “Elder Brother Fang, permit us the use of a private chamber!”</p><br/><p>Fang Shoudao’s eyes narrowed. He could tell something strange was going on, but after a moment of consideration, he nodded.</p><br/><p>Meng Hao was a bit astonished, and quickly swallowed the words he had been about to utter.</p><br/><p>Fang Shoudao waved his hand and immediately he, along with Meng Hao and the three old-timers from the Three Great Daoist Societies, all vanished from the main hall. Fang Yanxu was also disconcerted, but this was the Fang Clan after all, so he wasn’t worried. Instead, he smiled and began to chat with some of the others who remained behind.</p><br/><p>It didn't take long for the sound of conversation and laughter to fill the main hall once again. However, suspicions now filled the hearts of all the Dao Realm experts, even though it didn't show on their faces.</p><br/><p>Fang Shoudao and the others reappeared within a hidden chamber in the Fang Clan. Meng Hao’s eyes narrowed, and his heart filled with misgivings. He immediately stepped back a few paces.</p><br/><p>“Fellow Daoists,” said Fang Shoudao, “please explain why we need to use this private chamber!” Fang Shoudao might be an old fox and he might have conned Meng Hao, but as he stepped forward, he placed himself very close to Meng Hao. If anything untoward happened, he would go all out with his cultivation base to make sure Meng Hao stayed safe.</p><br/><p>Despite the previous con, everything he had said was actually true. Meng Hao really was as important to the Fang Clan as a Dao Realm expert. Furthermore, appointing Meng Hao to be the Crown Prince had not been a joke. He really and truly did have that status in the clan.</p><br/><p>Seeing Fang Shoudao act in this way finally caused Meng Hao to have the feeling that the man really was the clan’s Earth Patriarch.</p><br/><p>“Elder Brother Fang, this is our first time seeing Meng Hao in person,” said the old man from the Immortal Ancient Daoist Rite. “On previous occasions, we only saw him on illusory screens, and could not feel... the ripples which are emanating off of him!” The old man looked excited, and breathed heavily when he looked at Meng Hao. The old woman from the Nine Seas God World and the middle-aged cultivator from the Sublime Flow Sword Grotto looked equally moved.</p><br/><p>Fang Shoudao frowned, taking a few more steps forward to stand directly next to Meng Hao, whereupon he stared coldly at the other three.</p><br/><p>“For Hao’er to reach this point means he definitely has his destiny. He is the Crown Prince of the Fang Clan, and if anybody tries to steal his destiny, that person will be crossing the line and provoking the Fang Clan’s wrath!” Fang Shoudao’s expression was extremely serious, and his tone was icy.</p><br/><p>Meng Hao stood behind him, staring in shock. All of a sudden, he came to the realization that the true use of being the Crown Prince was a sort of protection. His rise to true Immortality had attracted the attention of the entire Ninth Mountain and Sea, and now that he was the Crown Prince, anyone who harbored untoward thoughts would definitely be stricken with fear.</p><br/><p>Meng Hao could sense the care and concern of the Senior generation of the clan, and his heart softened quite a bit. It even caused his perception of Fang Shoudao as a wily fox to lessen quite a bit.</p><br/><p>“Elder Brother Fang, you misunderstand,” said the old man from the Immortal Ancient Daoist Rite, looking over at Meng Hao.</p><br/><p>“Meng Hao, back when you disappeared into the Ruins of Immortality, did you by any chance... encounter a white-robed woman?” It was impossible for the old man to conceal the nervousness in his voice as he asked his question. The old woman and the middle-aged cultivator wore equally nervous expressions.</p><br/><p>Meng Hao gaped. After a long moment of silence, he slowly nodded his head in response.</p><br/><p>“I knew it!” exclaimed the old man, sounded very excited. Strange gleams appeared in the eyes of the old woman and the middle-aged cultivator. The old man took a deep breath and then made a clutching motion, causing a chunk of black stone to appear in his hand.</p><br/><p>At the same time, the old woman and the middle-aged cultivator produced similar stones. All three of the rocks emanated mysterious glows as they flew together to form a large stone slab, which hovered in midair.</p><br/><p>“Child, place your hand onto that black stone slab,” said the old man, sounding very excited. “Don't worry, the three of us don't harbor any ill intentions toward you.” He looked at Meng Hao with anticipation.</p><br/><p>Fang Shoudao frowned. The Three Great Daoist Societies were acting very strange as far as he was concerned, and he was just about to intervene when Meng Hao’s eyes glittered. As for Meng Hao, he had long since speculated that the white-robed woman was somehow connected to the Three Great Daoist Societies.</p><br/><p>Instead of placing his hand onto the stone slab, he asked, “That white-robed woman... who is she?”</p><br/><p>“Long ago, our world did not consist of only nine mountains and nine seas,” responded the old woman from the Nine Seas God World, her voice soft. “During that era, that white-robed woman was one of three supreme Paragons!”</p><br/><p>Meng Hao's mind trembled, and he didn't respond. Finally, he lifted his right hand and calmly placed it onto the stone slab. He was already aware of exactly what these three people were hoping to see.</p><br/><p>Blinding light emanated out as soon as his hand made contact with the stone slab. When the light touched Meng Hao, an ancient magical symbol suddenly appeared on his forehead.</p><br/><p>That magical symbol was actually a number!</p><br/><p>The number... 13!</p><br/><p>13th in the Echelon!</p><br/><p>When the old man from the Immortal Ancient Daoist Rite saw the magical symbol in the shape of a number, he threw his head back and laughed. His entire body quivered with excitement. The old woman from the Nine Seas God World began to pant excitedly, and her expression was one of delight. As for the middle-aged man from the Sublime Flow Sword Grotto, he was also panting, and appeared to be going wild with joy.</p><br/><p>“The Echelon! As expected, the Echelon!!”</p><br/><p>“Meng Hao has actually joined the Echelon!! The Echelon, prescribed and maintained by a Paragon! The Echelon of the Nine Mountains and Seas!! The key to leaving Heaven and Earth!”</p><br/><p>“He's the second from the Ninth Mountain and Sea to enter!!”</p><br/><p>Meng Hao pulled his hand back, and the light emanating from the stone slab faded away. Fang Shoudao frowned. Inwardly, he was shocked, not because of the magical symbol that had appeared on Meng Hao’s forehead, but rather, because of the excitement of the representatives from the Three Great Daoist Societies.</p><br/><p>“Fellow Daoists, could you please provide an explanation?” he said coolly, becoming even more vigilant than ever.</p><br/><p>“Elder Brother Fang, this matter pertains to the mission of our Three Great Daoist Societies,” said the old man. The old woman and the middle-aged man stood off to the side, the expressions on their face solemn once again. “The information we are about to share with you must not be spread beyond this room.</p><br/><p>“Every so often, the Three Great Daoist Societies hold a trial by fire. Its purpose is to search for suitable cultivators for that very Paragon to observe as she searches for people qualified to join the Echelon.</p><br/><p>“The Echelon determines the true blazing suns of the entire Nine Mountains and Seas. People who join the Echelon are actually qualified to become legends!</p><br/><p>“Furthermore, the Echelon is wrapped up in an enormous mystery, a secret that affects all Nine Mountains and Seas! In fact, the origin of Lord Li himself is very likely connected to that mystery!</p><br/><p>“For many, many years, the Ninth Mountain and Sea has not produced anyone qualified to join the Echelon. As of today... we now have a second!</p><br/><p>“The first person to qualify for the Echelon is no stranger to you. It was actually none other than the first generation Patriarch of your Fang Clan!</p><br/><p>“Sadly, although he met the requirements, when the time came for him to accomplish the tasks required by the Paragon, he ended up refusing to comply. He actually renounced his own qualifications.</p><br/><p>“Elder Brother Fang, this child cannot join just one of our organizations. He... is actually the sole successor of all Three Great Daoist Societies!</p><br/><p>“He is not a disciple, he is a successor!</p><br/><p>“When cultivators of the Echelon appear on any of the mountains or seas, they instantly become crucially important to any of the Daoist Societies, and will be protected as such. Elder Brother Shoudao, this child's path is definitely not limited to the Ninth Mountain and Sea.</p><br/><p>“The fighting that goes on amongst those who wish to enter the Echelon is even fiercer than the fighting which goes on among those who wish to be Chosen. As such, we must not allow Meng Hao’s status as a member of the Echelon to spread prematurely. It won’t be long before we arrange for him to leave the Ninth Mountain and Sea and participate in... the Echelon battles of the Nine Mountains and Seas.</p><br/><p>“Please place him in our care. We Three Great Daoist Societies are pledged to, and exist solely for the sake of, the Echelon!”</p><br/><p><strong>Chapter 1008: Why The Echelon Exists!</strong></p><br/>\n</div>"}