{"title": "Chapter 1004: The Fang Clan!", "id": 1004, "volume": 11, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-1004-the-fang-clan", "volume_title": "Volume 11", "body": "<h1>Chapter 1004: The Fang Clan!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 1004: The Fang Clan!</strong></p><br/><p>“Withered Tree, Blossoms in Spring” contained two meanings. One meaning was that in the conclusion of all things that was death, there would often appear a bit of life. It was just like reincarnation, which connected life and death. It was a cycle, an endless, never-ending cycle.</p><br/><p>Another meaning of the expression... was not that of reincarnation.</p><br/><p>It was a meaning that pertained to a type of cycle, but not the blooming of spring; yet, it was equally about life.</p><br/><p>Meng Hao looked on in astonishment as the first generation Patriarch waved his hand. Then, he watched wide-eyed as one of the most shocking things he had ever before witnessed played out in front of his very eyes.</p><br/><p>What he saw was time suddenly come to a stop both inside and outside the ancestral mansion. Then, everything began to move backward!</p><br/><p>Breath by breath, moment by moment, everything began to go in reverse. Blood that had sprayed out was returned to the body. Severed heads returned to the necks that they had left. Everyone who had toppled over in death, once again stood in place. People running forward began to speed backward. Adversaries locked in deadly fighting split apart.</p><br/><p>Meng Hao panted as this happened to everyone in the entire Fang Clan, with the exception of himself and five other people. None of those five people seemed very surprised by what was happening.</p><br/><p>They were: the first generation Patriarch, Fang Shoudao, Fang Yanxu, Fang Danyun and Fang Daozi.</p><br/><p>Everyone else, including Ji Xiufang and the three Quasi-Dao experts, as well as everyone else in the Fang Clan, was affected by the magic.</p><br/><p>Meng Hao panted as he saw fighting clan members separate and move back in time to their original positions. Even more shocking to Meng Hao was that he could actually... see himself.</p><br/><p>He saw the entire fight with Fang Wei. He saw the deaths of Fang Wei, Fang Xiushan, and Fang Heshan, all playing in reverse. Everyone who should have been dead, was now alive.</p><br/><p>To be able to watch such things happening led to an indescribable feeling. Meng Hao was completely rattled.</p><br/><p>Throughout the entire Fang Clan, time flowed in reverse. The blood that stained the ground vanished, and everyone who had died appeared alive once again, until finally, everyone was watching Meng Hao and Fang Wei fighting up in midair.</p><br/><p>Suddenly, in the blink of an eye, everything went motionless.</p><br/><p>Meng Hao stood there, expression blank as he stared.</p><br/><p>It was at this point that the first generation Patriarch waved his hand again, causing all of the members of the Fang Clan who had died to all vanish. The loyal ones disappeared in the blink of an eye, leaving behind only the traitorous clan members.</p><br/><p>Even Fang Wei disappeared.</p><br/><p>Next, the first generation Patriarch clenched his hand into a fist. Rumbling sounds could be heard as the world in front of him collapsed. As it did, numerous dots of light could be seen falling down to the ground.</p><br/><p>Back in the ancestral mansion, the loyal clan members who had died could now be seen, their expressions blank but tinged with disbelief.</p><br/><p>“What just happened? I remember... I remember dying!”</p><br/><p>“What is this place? Is this... still the Fang Clan?”</p><br/><p>“Just what exactly is going on!?” The resurrected members of the Fang Clan looked around in shock. The surrounding traitorous clan members began to tremble violently. Then, blood sprayed out of their mouths and their gazes went dark as they toppled dead to the ground.</p><br/><p>The Second Patriarch died. The Fourth and Sixth Patriarchs... died. They all died.</p><br/><p>There was not a single exception!</p><br/><p>Anyone who had betrayed the clan instantly died!</p><br/><p>It was as if their deaths were the price that had to be paid to return the dead clan members to life!</p><br/><p>Meng Hao looked out into the crowds and saw a young man who was... none other than Fang Wei!</p><br/><p>As Fang Wei looked around, his expression was at first blank. However, his eyes quickly grew clear, and eventually, he found himself looking back at Meng Hao. His expression was a complex one as he sighed inwardly.</p><br/><p>The cultivators of the various sects and clans of the Ninth Mountain and Sea watched with spinning minds. Even the Dao Realm Patriarchs were trembling, and looked terrified.</p><br/><p>“A transformation between life and death? I can’t believe that the first generation Patriarch of the Fang Clan... has actually reached such a realm!!”</p><br/><p>“But, how come I feel that this isn’t transformation, but rather... that he actually reached back in time, grabbed those dead people, and then pulled them here. W-what kind of cultivator is he? To be able to do something like that is absolutely terrifying!!”</p><br/><p>“How enigmatic! The Fang Clan's first generation Patriarch is impossible to predict!!”</p><br/><p>As of this moment, Meng Hao finally realized why his father had been so certain that he was completely safe.... Also, he was now completely sure that his father had played a part in this plan regarding the first generation Patriarch.</p><br/><p>“Fudge!” he thought. “Of course I was completely safe. Even if I died, the first generation Patriarch could bring me back.... But... but a magical technique like that is simply too Heaven-defying! How could a Dao like that even exist!?” His heart still surged with waves of shock. For some reason, he had the feeling that the terrifying first generation Patriarch’s magical technique was something that could only be used a limited number of times.</p><br/><p>Also, it must surely come with some sort of backlash effect, as well as... other limitations. Otherwise, the Fang Clan couldn’t possibly have lost their war with the Ji Clan!</p><br/><p>“Could it be that it only works on Planet East Victory?” he thought, his eyes narrowing. Then he thought back to something Fang Shoudao had said.</p><br/><p><em>Planet East Victory is not the same Planet East Victory it used to be....</em> Meng Hao's heart trembled, and an idea suddenly popped up in his mind.</p><br/><p>He thought about how the ultimate form of One Thought Stellar Transformation was... to transform into a planet!</p><br/><p>His eyes went wide as he looked down at the ground beneath his feet. He almost couldn’t believe that it was true.</p><br/><p>“So THIS... is the Fang Clan?” he thought, his mind reeling.</p><br/><p>Almost in the same moment that the members of the Fang Clan were resurrected, Ji Xiufang’s heart filled with waves of astonishment. A critical sensation of life and death danger filled her. Without any further hesitation, she tried to flee, flying up into the air toward the starry sky. Whether or not she could succeed in escaping was irrelevant, she had no choice but to try.</p><br/><p>She had never before seen a Daoist magic like this one, and seeing all of the members of the Fang Clan being resurrected filled her with intense fear.</p><br/><p>It was the same with the three Quasi-Dao old men. Although they were insane, they were still capable of feeling fear. Scalps numb, faces pale, they turned and fled.</p><br/><p>Fang Daozi stared blankly as the other clan members were resurrected, and slowly, a look of bitterness appeared in his eyes.</p><br/><p>“It was all just a play,” Fang Shoudao said softly, looking at Fang Daozi with a look that contained both empathy and pity.</p><br/><p>A play. A play in which even the Ji Clan had become nothing but actors, actors come to participate in a grand performance. The fact that the first generation Patriarch could be so domineering as to plot out such an enormous play caused Meng Hao to inhale deeply in shock.</p><br/><p>However, he still had a strange feeling. Why... did the first generation Patriarch seem to... completely lack any sort of expression?</p><br/><p>“Considering that father managed to reach the point of being able to transform into a planet,” said Fang Daozi, a complex expression flickering in his eyes, “if he had wanted to find me, it would have been a simple matter.” He looked hesitatingly toward Fang Shoudao.</p><br/><p>“Because your father didn’t want that,” Fang Shoudao explained.</p><br/><p>When Fang Daozi heard that, he began to shake. Then he threw his head back and burst out with bitter, uproarious laughter. He turned to look at the first generation Patriarch in his green robe, his expression one of grief, fury, and countless other emotions.</p><br/><p>Considering who he was, and the level of his cultivation base, how could he not understand the situation? The first generation Patriarch in front of him was not his father’s true self. His father... was really and truly dead.</p><br/><p>What had appeared right now was, not really a clone, but actually... his father incarnated as a planet, then left behind as a trump card for the Fang Clan.</p><br/><p>He was... the soul of the planet!</p><br/><p>It was the soul of his father in a different state of existence!</p><br/><p>Despite being dead, despite being the soul of a planet, he still complied with the dying wishes of the first generation Patriarch and did not seek out the reincarnated version of Fang Daozi, who harbored such evil intentions toward the clan.</p><br/><p>“After the first generation Patriarch passed away into meditation, he left behind some dying words that I came to hear after I became the Earth Patriarch. Only recently did I come to understand that those words were actually meant for you.</p><br/><p>“He believed that eventually, the day would come in some particular generation that you would become the Fang Clan’s Earth Patriarch, and thus, he left those words behind for you.” Fang Shoudao looked at Fang Daozi with a complicated expression.</p><br/><p>\"Those words were... <em>Everything I told you the year that I suppressed you... was true.</em>\"</p><br/><p>“True.... True....” Fang Daozi began to laugh with even greater bitterness. He looked over again at the figure of his father, a middle-aged man in a green robe. He would never forget the year that his father suppressed him, and what he had said. Back when he and the Ji Clan both followed Lord Li on the campaign trail, the Ji Clan had sown Karma onto the newly born Fang Daozi.</p><br/><p>That Karma was very deep, and required the expenditure of almost all of Lord Ji’s cultivation base, such that even the first generation Patriarch couldn't detect it.</p><br/><p>By the time he did, it was too late. He went to war with the Ji Clan, not for rulership of the Ninth Mountain and Sea, but rather, for revenge.</p><br/><p>Fang Daozi laughed bitterly, then flew up into the air, his thoughts in chaos. He no longer wished to remain on Planet East Victory, nor to see the other members of the Fang Clan. His head hurt, and madness filled him as he shot up into the starry sky.</p><br/><p>Meng Hao felt torn as he watched Fang Daozi. Then he turned to look at the first generation Patriarch, and couldn’t help but think about Ke Yunhai and Ke Jiusi. He also thought about his own father.</p><br/><p>“Fang Xiufeng, Fang Xiufeng,” he sighed. The more he thought about the situation, the angrier Meng Hao got. “Are you really my dad...? You were willing to throw your own son into a perilous situation like this? Well, you’re my dad so I can't say anything, but is mom going to let you off the hook?”</p><br/><p>Fang Shoudao did nothing to stop Fang Daozi. He watched him attempting to leave, then clasped hands and bowed deeply toward the first generation Patriarch.</p><br/><p>“Patriarch, please execute those who have offended our clan!”</p><br/><p>The first generation Patriarch’s expression was the same as ever as he extended his right hand and pointed up into the sky. Rumbling could be heard, and a monstrous killing aura could be sensed. Shockingly... that aura did not come from the first generation Patriarch, but rather... it exploded out from the planet itself.</p><br/><p>In that moment, all of the plants and trees on Planet East Victory, all of the numerous buildings, all of the living things, exploded with the desire to kill. This was the wrath of an entire planet!</p><br/><p>The intense killing intent surged up into the sky, passing Fang Daozi without hurting him in the least. However, when it slammed into the Quasi-Dao experts, the three old men were instantly killed.</p><br/><p>Wiping them out was as easy as crushing dried weeds. They weren’t even qualified to fight back. Booms could be heard as they were transformed directly into ash. Then, the killing intent spread out further into the starry sky, where it caught up to Ji Xiufang. Her level of terror couldn't have been any higher as the killing intent slashed toward her.</p><br/><p>“Patriarch, save me!!” she screamed, scared out of her mind. Despite being a Dao Realm expert, compared to the killing intent of an entire planet, she was weak beyond compare!</p><br/><p>As of this moment, all of the powers in the Ninth Mountain and Sea were being given a demonstration... of the supremely domineering power that the Fang Clan had kept hidden for so long!</p><br/><p>They were using actions to tell everyone that the Fang Clan... was just as powerful as it had always been! Anyone who offended the Fang Clan... would be executed no matter how far they tried to run!</p><br/><p>-----</p><br/><p><em><strong>End of Book 6: Fame That Rocks the Ninth Mountain; the Path to True Immortality</strong></em></p><br/>\n</div>"}