{"title": "Chapter 1000: The Fang Clans Second Dao Realm Expert!", "id": 1000, "volume": 10, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-1000-the-fang-clans-second-dao-realm-expert", "volume_title": "Volume 10", "body": "<h1>Chapter 1000: The Fang Clans Second Dao Realm Expert!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong></strong></p><br/><p>[/expand]</p><br/><p>In the same moment that everyone was flabbergasted by the appearance of the terracotta soldier, it lifted its head and looked at Meng Hao. Apparently sensing Meng Hao’s divine will, it hefted its greatsword and began to slaughter its way into the Fang Clan ancestral mansion.</p><br/><p>As of this moment, the traitorous clan members were completely shaken mentally, and could feel fear rising up within them. The terrifying aura of a Quasi-Dao Paragon could easily slaughter any and all Ancient Realm experts.</p><br/><p>Without a way to fight back against the terracotta soldier, the rebellion would be almost instantly crushed.</p><br/><p>A powerful expert could, based on strength alone, crush any and all plots and schemes!</p><br/><p>Rumbling filled the air as the terracotta soldier went on the attack. The loyal members of the Fang Clan were extremely excited, and the traitors had no choice but to fall back against the onslaught, their scalps numb. As of this moment, the battle had reached a complete turning point.</p><br/><p>The various sects and clans of the Ninth Mountain and Sea were also astonished, and many of them had already come to the conclusion that the terracotta soldier must the Fang Clan’s trump card.</p><br/><p>In the moment that the terracotta soldier began slaughtering its way through the ancestral mansion, suddenly, Ji Xiufang began to chuckle, and then sighed inwardly. Even though the Fang Clan was awash with torrents of blood, they still made her feel uneasy. She had not been able to tell what Fang Shoudao was thinking, and had been ever vigilant regarding their mysterious trump card.</p><br/><p>However, now that the Fang Clan had played that trump card, Ji Xiufang became completely confident. Chuckling, she sent out a type of divine will that... instantly caused the faces of three of the Chosen outside in the starry sky to flicker.</p><br/><p>Almost in the same moment that their expressions changed, fissures appeared in their foreheads. In the blink of an eye, those fissures had cut down to their jaws, and then past their chests.</p><br/><p>It was as if a sharp blade had sliced them in half! Blood sprayed out as... three unfamiliar cultivators suddenly stepped out from inside of their bodies!</p><br/><p>When they emerged, they were no larger than infants, and yet they rapidly grew bigger. They quickly grew to ordinary size, and soon it was obvious that they were three old men!</p><br/><p>As soon as they appeared, their energy surged, and a strong Death aura rose up from them, as if not much of their flame of life remained to burn inside of them. Apparently their longevity had left them poised on the brink of death for years.</p><br/><p>However, the auras they emitted indicated that they were extremely powerful. The starry sky trembled, and everything went dim, because these men... emanated the aura of Quasi-Dao Paragons!</p><br/><p>RUUUUUUMMMMBLLLLE!</p><br/><p>As they stepped out, the other Chosen such as Fan Dong’er and the others stared in shock. Their hearts beat wildly as they witnessed everything that was happening.</p><br/><p>The three old men smiled coldly, and it was obvious that their eyes were filled with madness. They looked like three Immortal Divinities, powerful enough to shake the Heavens. Endless ripples spread out into the stars, and everything trembled as they shot toward Planet East Victory.</p><br/><p>Their speed was virtually indescribable, and they seemed deranged, bent on destroying everything, as if they wished to release all of the darkness that they had accumulated throughout their entire lives.</p><br/><p>It didn’t matter what the horrifying consequences of their deaths would be, they wanted to go out in a blaze of glory!</p><br/><p>All of the sects and clans of the Ninth Mountain and Sea looked at the three men with utter shock, and felt incredible coldness rising up in their hearts.</p><br/><p>“So this is how the Ji Clan does things, huh...?”</p><br/><p>“Three Quasi-Dao Paragons. Their descendants... are all sects that long since became subservient to the Ji Clan!”</p><br/><p>“Wow... just how many years in advance did the Ji Clan prepare to overthrow the Fang Clan?!”</p><br/><p>Up in the starry sky, Fang Shoudao also saw what was happening, and a strange expression could be seen on his face that no one could possibly interpret. When Ji Xiufang saw the look, she could suddenly hear her own heart pounding in her chest.</p><br/><p>“You’re not worried?” she asked.</p><br/><p>“Why would I be worried?” he responded. Fang Shoudao smiled slightly, then waved his hand, unleashing a divine ability as he resumed battling with Ji Xiufang.</p><br/><p>“Could it be that the statue isn't his trump card?” she thought, feeling shocked. “Where is Fang Shoudao’s confidence coming from?! Why is he so unperturbed!?!?” Killing intent gleamed in Ji Xiufang’s phoenix-like eyes. “Well, It doesn’t matter, I’ll worry about it after the Fang Clan is destroyed!”</p><br/><p>Booms filled the air as the three Quasi-Dao Paragons descended upon Planet East Victory, filled with the madness of extermination, and shocking auras. The sky went dim, the ground quaked, and rivers flowed in reverse.</p><br/><p>From the ground, the three men looked like shooting stars exuding an air of madness. They shot toward the Fang Clan ancestral mansion, sending massive pressure out ahead of them. The ground shook, and numerous buildings collapsed. The resulting dust didn’t dare to rise up into the air, but was crushed back down onto the surface of the ground.</p><br/><p>All of the members of the Fang Clan looked on with flickering faces. Many couldn’t take the pressure, and coughed up mouthfuls of blood.</p><br/><p>The three old men shot like meteors toward the terracotta soldier and the loyal members of the Fang Clan. The traitors immediately went wild with joy, and booms echoed out as slaughter was once again unleashed in the ancestral mansion.</p><br/><p>The terracotta soldier looked up, then, without the slightest hesitation, flew up and went all-out with every scrap of power it had to block the descending three old men!</p><br/><p>Everything went dim, the heavenly bodies shook, and a fierce wind kicked up.</p><br/><p>Meng Hao’s mind trembled as he saw the terracotta soldier flying into battle. He saw the look of madness and violence in the three old men; they almost didn't look like cultivators, but rather, wild beasts that wanted to exterminate all living things.</p><br/><p>It was as if they wanted to make an accounting with all of Heaven and Earth.</p><br/><p>“Why do we have to die so soon when other people can continue to live!? Since we’re going to die, the more people we can take with us to the grave, the more glorious it will be!”</p><br/><p>“Quasi-Dao Paragon....” thought Meng Hao, instantly understanding the situation. The reason why Quasi-Dao experts were called Paragons was... because of fear. Because… people in that realm were absolutely insane.</p><br/><p>Because they were on the verge of death, they had no fear. All of the darkness that had built up in their hearts could explode out at any time. Each and every one of them could make all living things weep.</p><br/><p>The three old men laughed coldly, and when they spoke, their hoarse voices were filled with incredible savagery and insanity.</p><br/><p>“Trifling statue! Screw off!”</p><br/><p>“Today I will be baptized in blood! Not a single one of you vile Fang Clan cultivators will be left alive! You’ll all die!”</p><br/><p>“From today forth, there will no longer be a Fang Clan in the Ninth Mountain and Sea! There will be a new clan!”</p><br/><p>Booms could be heard as the terracotta soldier slammed into the three old men, who joined forces in attack, unleashing powerful divine abilities. The sun, moon, and the skies above materialized, transforming into three beams of destructive light that smashed into the terracotta soldier.</p><br/><p>Massive booms could be heard as the terracotta soldier swung its greatsword, using all of its power to fight back against the three men. The terracotta soldier was forced back over and over again. Cracking sounds emanated out from it, and its body was covered in fissures. However, it vastly diminished the speed with which the three old men were advancing.</p><br/><p>“Terracotta soldier!!” cried Meng Hao, his eyes bloodshot. His heart hurt to see even one crack on the gift left behind by his foster father, so the fact that numerous cracks were now visible tore at his insides. Unfortunately, the terracotta soldier was not capable of simultaneously fighting back against three opponents relying only on its own power. Furthermore, Meng Hao’s cultivation base was simply insufficient to make a difference in this genocidal battle.</p><br/><p>The members of the Fang Clan were in a state of despair. Some let out miserable shrieks and resorted to self-detonation to protect the clan. Others stood there trembling, unsure of what to do.</p><br/><p>All types of attitudes and characters appeared within the members of the Fang Clan at this point in time.</p><br/><p>It was then that, all of a sudden, a cold harrumph could be heard echoing from outside of the ancestral mansion, from... the Dao of Alchemy Division. Next, an incredible aura exploded out from that same region, along with a dense cloud of insects.</p><br/><p>They turned into a bright beam of light completely made up of... Unicorn Immortals!</p><br/><p>In the middle of all the Unicorn Immortals was a person, who, when Meng Hao saw him, caused him to gape.</p><br/><p>It was... Pill Elder Fang Danyun!</p><br/><p>His cultivation base exploded with power similar to that of the six Patriarchs located underneath the Fang Clan. It was the rippling power of at least ten extinguished Soul Lamps. At first, it didn't seem powerful enough to even cause the Quasi-Dao Paragons to tremble. However, as they flew out, the Unicorn Immortals began to explode. They transformed into beams of light that bored madly into Fang Danyun, causing his cultivation base to rise up with shocking speed.</p><br/><p>In the blink of an eye, Fang Danyun actually... began to emit the aura of a Quasi-Dao Paragon!!</p><br/><p>This was not borrowed power used to increase his cultivation base. Instead... this was the loosening of a seal! The innumerable Unicorn Immortals were actually part of his cultivation base, and were now returning to him!</p><br/><p>Fang Danyun had reached the peak of the Ancient Realm many years ago. Unfortunately, he had failed to enter the Dao Realm, and was actually a Quasi-Dao Paragon. However, he did not go mad, and was eventually able to disperse the power that had built up inside his body. He fused that power into the bodies of the Unicorn Immortals, causing his cultivation base to fall back down. Because of that, he was able to preserve his life force and prevent it from dispersing!</p><br/><p>After that, he had devoted himself to the Dao of alchemy in the hopes of refining some sort of medicinal pill that would allow him to seek a new Dao despite being a Quasi-Dao Paragon!</p><br/><p>Now that the three Quasi-Dao old men were on the attack, Fang Danyun chose to explode out with power to defend the clan. Even though this would accelerate his death, it was still his decision.</p><br/><p>A bright beam of light shot through the air to join the terracotta soldier in fighting viciously against the three Quasi-Dao experts.</p><br/><p>Fang Danyun’s appearance on the scene caused the three old men to stare in shock. However, they weren’t too surprised by this turn of events. They waved their hands, causing booms to fill the air as four people and one statue fought a raging battle in the sky.</p><br/><p>Meanwhile....</p><br/><p>It was at this point that, all of a sudden, an incredibly shocking aura erupted from... the Medicine Immortal Sect!</p><br/><p>On Planet East Victory, there was one other force that the Fang Clan had never once been adversarial to, and that was... the Medicine Immortal Sect!</p><br/><p>According to the stories, the Patriarch of the Medicine Immortal Sect had forsaken the Fang Clan and established his own school of thought, which eventually became the Medicine Immortal Sect. In fact, they could concoct pills using Fang Clan pill formulas that even the Fang Clan couldn’t produce.</p><br/><p>There were actually many rumors floating around Planet East Victory regarding the past relationship between the Fang Clan and the Medicine Immortal Sect.</p><br/><p>As soon as the aura exploded out, it filled Planet East Victory, suppressing all cultivators. This aura... was not that of the Ancient Realm, nor the Quasi-Dao Realm, but rather... the Dao Realm!!</p><br/><p>In response to the eruption of the aura, the three Quasi-Dao experts’ faces fell. In contrast, Fang Danyun didn't seem surprised at all, and continued fighting.</p><br/><p>All of the loyal members of the Fang Clan suddenly felt their blood boiling in excitement.</p><br/><p>Conversely, the traitorous clan members’ hearts began to tremble. These shocking changes to the situation left them completely shaken.</p><br/><p>Apparently, all the secret weapons had been deployed!!</p><br/><p>“Ji Clan, this battle is over!” said an ancient voice. It echoed out from within the Medicine Immortal Sect, shaking everything like thunder. This was the Patriarch who had forsaken the clan years ago. Suddenly, he appeared, a middle-aged man with a calm expression. As he strode out, all of the traitorous clan members coughed up blood and were sent flying backward.</p><br/><p><strong>Chapter 1000: The Fang Clan’s Second Dao Realm Expert!</strong></p><br/>\n</div>"}