{"title": "Chapter 1018: Handling Old Turtle Reliance!", "id": 1018, "volume": 11, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-1018-handling-old-turtle-reliance", "volume_title": "Volume 11", "body": "<h1>Chapter 1018: Handling Old Turtle Reliance!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 1018: Handling Old Turtle Reliance!</strong></p><br/><p>The Ninth Mountain and Sea. Somewhere in the starry sky.</p><br/><p>Far, far away from Planet East Victory was a location very near the Ninth Sea. If you hovered in the starry sky in this spot and looked off into the distance, you would actually be able to see that between the Ninth Sea and the empty sky, was a stretch of shadowy ruins.</p><br/><p>By passing through those ruins, you could arrive at the Ninth Sea itself. If you passed around them, however, it would take far, far longer.</p><br/><p>Those shadowy ruins were none other than... the mysterious Ruins of Immortality!</p><br/><p>It was at this point that a blood-colored glow rose up above the Ruins of Immortality. In the blink of an eye, Patriarch Reliance’s enormous form suddenly flew out.</p><br/><p>“Hahaha! Meng Hao, you little bastard! Come on! You think you can find me here, huh?!” Patriarch Reliance seemed incredibly happy, even ecstatic, as he flew out.</p><br/><p>“It was bad luck for the Patriarch to run into you on Planet East Victory. This time, though, I'm going to hide in the Ruins of Immortality! I simply can’t believe that you’ll be able to track me down here!</p><br/><p>“Hahaha! The Patriarch turns out to be the smartest one in the end. In all the Ninth Mountain and Sea, nobody is as astute and circumspect as me!” Feeling quite pleased with himself, Patriarch Reliance threw his head back and roared, then flew out across the Ruins of Immortality. However, it was at this point that he heard someone speaking behind him.</p><br/><p>“Listen up, old turtle,” the voice said lazily. “The term ‘astute and circumspect’ is something you should wait for other people to say about you. You can’t use it to describe yourself.”</p><br/><p>As soon as the voice rang out, a tremor passed through Patriarch Reliance. His enormous head slowly turned around, and when he looked behind him, his eyes went wide with disbelief and shock. He couldn’t help but stare at his tail, where sat Meng Hao, smiling broadly at him.</p><br/><p>“You....” Patriarch Reliance gaped in shock. He clearly remembered that in the moment of his escape, Meng Hao should have been left on Planet East Victory. Now it was clear, however... that the damned bastard had somehow teleported here with him.</p><br/><p>One couldn’t blame Patriarch Reliance for being so extremely nervous that he didn’t notice what had happened. Besides, Meng Hao's One Thought Stellar Transformation and its Stellar Teleportation were extremely bizarre. His lucky break of being able to reach the teleportation portal was something Patriarch Reliance had never considered possible.</p><br/><p>After emerging, he was too focused on what was ahead of him and was too excited at having once again evaded Meng Hao to notice that at some point, a blood-chilling figure had suddenly appeared on his tail.</p><br/><p>“Hey, old turtle, long time no see!” said Meng Hao, waving at Patriarch Reliance, a bashful smile on his face. From the jovial way he chuckled, he looked like someone randomly meeting an old friend in an unexpected location. His appearance was very amiable.</p><br/><p>After staring in shock for a moment, Patriarch Reliance threw his head back and roared as if he were going crazy. The entire State of Zhao quaked on his back.</p><br/><p>“Meng Hao, this is going too far! I can’t deal with this!!</p><br/><p>“I’ve run away from you a bunch of times now, you and your damned League of Demon Sealers. Dammit, Meng Hao, you little bastard! Y-y-you... you just push people too far!!</p><br/><p>“I’m gonna eat you!” Patriarch Reliance was on the verge of collapsing emotionally, and his heart was wracked with grief. He was also enraged; there was nobody he wanted to see LESS than Meng Hao, and right now, in his moment of complete elation, all of a sudden, Meng Hao appeared on top of him! He was left feeling like he was about to go insane.</p><br/><p>The more he thought about it, the worse he felt. In fact, he felt himself to be the most tragic figure in all existence.</p><br/><p>Roaring, he opened his mouth and stretched it out toward Meng Hao, hoping to snap him up in one bite.</p><br/><p>However, even as his mouth neared Meng Hao, Meng Hao cleared his throat and lifted his right hand up in front of him.</p><br/><p>“Come on, Patriarch, come scratch this itch for Young Master.”</p><br/><p>A tremor ran through Patriarch Reliance, and his enormous head stopped in place. His eyes were bright red as he stared at Meng Hao, and yet... he didn't dare to really swallow him.</p><br/><p>The sealing Hex inside of him was spinning, and therefore, he didn't dare to harm Meng Hao in the slightest. If he did, the Hex would explode out violently.</p><br/><p>As soon as Patriarch Reliance’s head stopped moving, Meng Hao walked forward and patted his head lightly.</p><br/><p>“That’s a good turtle,” he said, laughing. “Come come, let me see if those words I carved on your back that year are still there.”</p><br/><p>Patriarch Reliance trembled and roared in rage. He felt wronged, provoked even, and couldn’t help but cry out, “You little Heaven-damned bastard! SCREW OFF!”</p><br/><p>He felt like he was about to explode. He swished his tail with incredible force, flinging Meng Hao out into the starry sky.</p><br/><p>At the same time, he spun in place and then attempted to flee as fast as possible.</p><br/><p>However, in the moment that he flung Meng Hao away, Meng Hao produced the Lightning Cauldron. Electricity danced as Meng Hao switched places with a random animal in the State of Zhao.</p><br/><p>As soon as he appeared on Patriarch Reliance’s back, he cleared his throat, then flickered to appear on Patriarch Reliance’s head. He stamped down hard with his foot.</p><br/><p>“What do you think you’re doing, Patriarch?! It wasn't easy to arrange this reunion! What are you running away for!?”</p><br/><p>Patriarch Reliance stared in shock, trembling. Eyes bloodshot, he roared; apparently his rage had reached the pinnacle, and yet there was nothing he could do. He could not use any of his divine abilities to harm Meng Hao in the least.</p><br/><p>His aura exploded with power, transforming into waves of qi that surged out in all directions, causing Meng Hao to fly off of his head. Mist roiled out to surround Patriarch Reliance, covering his body as he tried to escape again.</p><br/><p>Meng Hao gave a cold harrumph, then extended his hand and pointed toward Patriarch Reliance.</p><br/><p>“Demon Sealing, Eighth Hex!”</p><br/><p>In the instant that Meng Hao called out, Patriarch Reliance’s massive frame suddenly stopped in midair. Normally, the Hexing magic of the League of Demon Sealers would not have much of an effect on anyone who had a vastly higher cultivation base than Meng Hao, and it would even produce a backlash.</p><br/><p>However, Patriarch Reliance already had Demon Sealing Hexing magic inside of him, and was supposed to be Meng Hao's Dao Protector. Therefore, he was virtually incapable of fighting back against the Hexing magic.</p><br/><p>Meng Hao hadn't been aware of that years ago when they first met, and afterward, Patriarch Reliance had spent most of his time in hiding. But now that Meng Hao was the Immortal Realm Paragon, his cultivation base was as different from before as Heaven was from the Earth. Now, he was able to sense the restrictive Hexing magic that was already inside of Patriarch Reliance, which allowed his own Hexes to completely control him.</p><br/><p>It was due to this that the moment Patriarch Reliance had seen how powerful Meng Hao had become, he had begun to panic.</p><br/><p>Meng Hao cleared his throat as he caught up with Patriarch Reliance. As he neared, Patriarch Reliance began to tremble, and then recover from the Eighth Hex.</p><br/><p>In that moment, before Patriarch Reliance could begin to roar in rage, Meng Hao waved his hand once again.</p><br/><p>“Demon Sealing, Seventh Hex, Karmic Hexing!” Meng Hao said, waving his finger. However, there seemed to be no reaction.</p><br/><p>“Eee? There’s no Karma?” he said, shocked. This was the first time he had ever encountered a situation in which there was no Karma. He tried again a few more times, and upon finding that he only continued to fail over and over again, a strange light began to glow in his eyes.</p><br/><p>He was truly shocked. Patriarch Reliance, on the other hand, was so scared his blood was running cold. Thinking back to certain bad memories of the past, he bellowed in rage and then spit a beam of light out of his mouth. The light transformed into a flying dagger that slashed viciously toward Meng Hao. It seemed intent on slicing open the starry sky, completely separating Patriarch Reliance and Meng Hao.</p><br/><p>The flying dagger looked like a willow leaf, and was seemingly ordinary. However, it emanated an ancient air, and was clearly anything but ordinary.</p><br/><p>“Eighth Demon Sealing Hex!” As soon as Meng Hao saw the flying dagger, his eyes widened and he waved a finger. Immediately, Patriarch Reliance was once again immobilized, and his cultivation base was completely locked down.</p><br/><p>It wasn't that Meng Hao’s own Hexing magic was terrifying; instead, it was because of the way it riled the restrictive spell already inside of Patriarch Reliance. That restrictive spell responded to Meng Hao’s will, and exploded out with power.</p><br/><p>The flying dagger was now no longer under Patriarch Reliance’s control, and stopped moving. When that happened, Meng Hao’s eyes began to shine. He approached the flying dagger and waved his hand, causing it to fly into his hand.</p><br/><p>Then, right in front of Patriarch Reliance, he unleashed A Writ of Karma, binding the flying dagger to him with ties of destiny.</p><br/><p>When the Eighth Hex faded away, Patriarch Reliance let out a howl of grief.</p><br/><p>“My dagger! That’s been my favorite flying dagger for years!!</p><br/><p>“You give it back to me this instant, Meng Hao! That’s my treasured dagger....</p><br/><p>“Y-y-you, just kill me, alright?! Stealing my treasures is like ripping off my skin!</p><br/><p>“Meng Hao! Y-y-you....” Patriarch Reliance was on the verge of tears. He couldn't flee, nor could he hurt Meng Hao. Furthermore, every time Meng Hao unleashed Hexing magic, the restrictive spell inside of him activated, causing him to fill with the desire to weep.</p><br/><p>Besides all that, to the miserly Patriarch Reliance, having a treasure stolen was worse than anything else.</p><br/><p>Meng Hao was like the bane of his existence, the source of the most tragedy in his entire life. In fact, when Patriarch Reliance contemplated how his life had turned out, tears would stream down his face.</p><br/><p>While Patriarch Reliance and Meng Hao were having their little reunion, which was tragic for one and joyful for the other, something else was happening on a planet not very far away from their current location. That planet was... the Ninth Mountain and Sea’s Planet North Reed.</p><br/><p>That was the planet occupied by the Li Clan, the Song Clan, and the Wang Clan, making it the home base of sorts for three of the Great Clans.</p><br/><p>Currently, the entire Li Clan was garishly decorated with lanterns and banners. The whole place was infected with a spirit of joy, and everyone knew that in a month, Li Ling’er was to be married to the Crown Prince of the Fang Clan from Planet East Victory.</p><br/><p>Although quite a few clan members were somewhat critical of the matter, the sudden wedding had been arranged by the Li Clan’s Dao Realm Patriarch and, besides, Li Ling’er’s marriage to Meng Hao had been agreed upon long ago. Therefore, there was no one who could change the forming of the alliance between the two great clans.</p><br/><p>Of course, nobody in the Li Clan was aware that Meng Hao had fled the marriage. Nor was anyone aware of the actions of one particular young woman who was anxiously fleeing from Planet North Reed, heading far off into the distance.</p><br/><p>That young woman was none other than Li Ling’er.</p><br/><p>It was impossible to tell how she did it, but no one detected her departure. After flying out into the starry sky, she patted her own chest in relief and sped off into the distance.</p><br/><p>“I’d marry a pig before I marry that blasted, Heaven-damned Meng Hao!” she said through gritted teeth. As it turned out, she had made the same decision as Meng Hao, to flee the marriage.</p><br/><p>Unbeknownst to Li Ling’er, the Li Clan Dao Realm Patriarch, the middle-aged man, was actually watching her the entire time. His voice cool, he asked, “There were no mistakes in your calculations?”</p><br/><p>Almost as soon as the words left his mouth, a black-robed man appeared behind him, illusory and somewhat blurry, making it impossible to see his features clearly.</p><br/><p>“My clan’s augury magic cannot be mistaken.”</p><br/><p>“The chance to leave the Nine Mountains and Seas, to reunite the Li Clan to the main branch of the clan, is completely tied to Meng Hao.”</p><br/><p>The Patriarch remained silent for a moment, then turned and payed no more heed to Li Ling'er. His voice cool, he said, “It won't do to force her. If she wants to leave, then leave things up to destiny.”</p><br/>\n</div>"}