{"title": "Chapter 1029: You're the Insect Demon!", "id": 1029, "volume": 11, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-1029-youre-the-insect-demon", "volume_title": "Volume 11", "body": "<h1>Chapter 1029: You're the Insect Demon!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 1029: You're the Insect Demon!</strong></p><br/><p>Almost in the same instant that Meng Hao’s roar echoed out... because of its incredible similarity to the actual call of the black beetles, the dazed black beetles in the smoke suddenly awakened and began to join him in roaring.</p><br/><p>“Curses!” thought the young woman, her facial expression flickering. “How come one of them wasn’t affected!?!?” Glaring at Meng Hao, she backed up, then performed an incantation gesture with her right hand. Not only did she crush the tiny white tree in the lantern, she also bit her tongue and spit out a mouthful of blood.</p><br/><p>At the same time, Meng Hao’s roar was causing more and more of the black beetles to awaken. They began to fly out of the smoke, radiating savagery and murderous auras as they charged toward the young woman.</p><br/><p>Even Meng Hao had never imagined that he would be able to awaken the black beetles in this way. There were even some of them who appeared to approve of him, and began to fly in circles around him, as if indicating that they wished to follow his lead.</p><br/><p>Because of this, Meng Hao now stood out quite a bit among the sea of insects. In fact, he almost looked like... one of their bosses.</p><br/><p>Meng Hao’s heart was thumping, but he felt quite pleased with himself. As for the young woman, he wasn’t worried that she would be in any danger. After all, this was the Ruins of Immortality. The way that she had stepped out from the ripples the way she did left Meng Hao with the impression that she was in the early Ancient Realm. Presumably, she would have her own methods of getting away if necessary.</p><br/><p>He had no plans to kill her; his only goal had been to scare her away, and prevent her from stealing away his business.</p><br/><p>At the moment, it seemed that his plan had succeeded. The black beetles were swarming toward the young woman from all directions. However, it was then that the white branch the young woman had crushed transformed into white smoke. After absorbing the young woman’s blood, it spread out around her like a shield.</p><br/><p>Even as the black beetles closed in on her, the white smoke spread out, and the woman vanished. However... as the smoke dissipated, something else became visible... a black beetle!!</p><br/><p>Much attention to detail had been paid in the materialization of this black beetle. In terms of both physical appearance and aura, it looked exactly like the real black beetles!</p><br/><p>In fact, it was hard to tell whether or not it was a materialization, or real!</p><br/><p>Meng Hao stared in shock.</p><br/><p>The incoming army of beetles also gaped in astonishment. However, considering that they weren’t very intelligent, they had no way to understand what had happened. Meng Hao watched, furious, as the young woman in black beetle-form quickly became part of the army of insects.</p><br/><p>Soon, everything calmed down, and Meng Hao continued to glare over at the young woman as she carefully crawled around on the ground looking for medicinal plants.</p><br/><p>“What a disgrace!” he fumed inwardly. “She's obviously a cultivator! And yet she abandons all dignity to turn into a bug and look for some worthless medicinal plants! Is that the kind of thing a cultivator does!?!?” He truly felt that this young woman was completely shameless.</p><br/><p>Despite what he was thinking, Meng Hao continued to do exactly what he had done before, crawling among the sea of insects to the nearest medicinal plant and quickly harvesting it.</p><br/><p>However, as he crawled along, he suddenly realized that he was being followed. Behind him were a few of the beetles who had started following him after he had woken them up.</p><br/><p>That made Meng Hao stick out even more than before. Now he had a small entourage of beetles that looked almost like Imperial guards. Actually, they made it much easier to harvest medicinal plants.</p><br/><p>At this point, there was quite a bit of distance between Meng Hao and the young woman. Not only were they not interfering with each other’s efforts, but the young woman wouldn’t be able to find out for quite some time she had a competitor among the sea of insects.</p><br/><p>Meng Hao, though, was as angry as before, and furiously harvested the medicinal plants with increasing speed. Even though Meng Hao believed her to be stealing his business, for the sake of being able to stay there longer, he could potentially have accepted the situation if she had refrained from interfering with him.</p><br/><p>However, the young woman’s methods were somewhat heavy-handed, leading to several occasions in which the black beetles were stirred up. That, of course, affected Meng Hao.</p><br/><p>As more time passed, the black beetles were aroused more and more often. There were even some situations in which Meng Hao almost found himself in danger. In fact, with every outburst among the black beetles, some of the beetles would then start to patrol the area, forcing Meng Hao to stop his work.</p><br/><p>The increasing severity of these interruptions didn't seem to bother the young woman at all.</p><br/><p>However, Meng Hao was getting to the point where he couldn’t take it any more. He waited until the black beetles calmed down, then turned and sped toward the area where the young woman was working.</p><br/><p>Gradually the two of them neared each other, and eventually, both of their eyes came to fall on the same patch of Divine Spirit Grass, and they rushed toward it simultaneously.</p><br/><p>Finally, the young woman sensed that something strange was going on. She looked at Meng Hao, and instantly recognized him as the black beetle that had discovered her presence earlier.</p><br/><p>The moment she laid eyes on him, she clenched her teeth, then let out a threatening roar. Meng Hao’s black beetle followers immediately roared back and looked fiercely at the young woman.</p><br/><p>Feeling he had no other choice, Meng Hao got a bit closer, and then transmitted: “Is there any way you could possibly be a BIT more careful when harvesting the medicinal plants? Maybe NOT cause such a reaction from the beetles!?”</p><br/><p>As soon as she heard his words, the young woman looked at him, shock and disbelief evident even in beetle-form.</p><br/><p>“Y-y-you're... you're an Insect Demon!” she said hoarsely, looking aghast. “An actual Insect Demon!!” Her initial reaction was not to assume that Meng Hao was a cultivator like herself, but rather, that he was an insect that had transformed into a Demon.</p><br/><p>Of course, it wouldn't be proper to blame her for having this reaction. In truth, Meng Hao's disguise was simply too effective. From her perspective, he really was one of the black beetles. Her own ability to transform into a black beetle came from a naturally developed power of her own. It was something that, in all of the Nine Mountains and Seas, only bloodline members of her clan could do.</p><br/><p>Other divine abilities of transformation could not possibly deceive the black beetles. She had never seen anyone do anything like what Meng Hao was doing, remaining undercover within the sea of insects. Furthermore, based on his appearance, and the fact that he had an entourage of guards, it made it so that there was no way she would ever think that he was a cultivator.</p><br/><p>In her opinion, any cultivator who could possibly entrench himself among the black beetles, and even achieve a position as a boss, well that type of cultivator... would be simply too Heaven-defying.</p><br/><p>“YOU’RE the Insect Demon!” retorted Meng Hao angrily, glaring at the young woman. “Everyone in your whole family is an Insect Demon!!</p><br/><p>“Listen, I got here first, so if you want to harvest medicinal plants, fine, but at least do it a bit more carefully! Stop stirring up all the bugs! Doing that isn't helpful for either of us!” Meng Hao clenched his jaw in helplessness. The young woman was capable of harvesting the plants, and obviously wasn't going to leave. Plus, if they started fighting, then it would be impossible for him to continue to do his own harvesting.</p><br/><p>The young woman stared back at him in shock. After looking closely at Meng Hao for a moment, she finally was starting to be convinced that this black beetle boss was actually a cultivator like herself.</p><br/><p>To her, it was almost impossible to believe.</p><br/><p>“You’re really a cultivator?” she asked. Inwardly, she breathed a sigh of relief. Actually, meeting a cultivator here was a lot better than meeting an insect who had transformed into a Demon. At this point, her eyes began to glow with coldness.</p><br/><p>“Well, it doesn’t matter if you're an Insect Demon or a cultivator, or whether you got here first or not,” she said coldly. “All of these medicinal plants belong to me. Leave immediately! If you dare to fight with me over them, then even if you are an Insect Demon, I’ll turn you into a squashed insect! And if you're actually a cultivator, then I’ll turn you into a corpse!</p><br/><p>“And as for me stirring up the insects, well that’s my business! It has nothing to do with you. Now, get the hell out of this place!” Killing intent flickered in the young woman's eyes as she promptly ignored Meng Hao and then closed in on the same medicinal plant that they had both been heading for to begin with.</p><br/><p>“What a blockhead!” thought Meng Hao, his eyes shining with a cold light as he too sped toward the same medicinal plant. In the blink of an eye, the two of them reached the plant. It was at this point that the young woman suddenly flashed, transforming into three separate beetles!</p><br/><p>She rushed forward at top speed to snatch the medicinal plant. However, Meng Hao was very familiar with how to harvest medicinal plants, and despite the fact that there were three of her, she was simply too slow. In a flash of light, he quickly harvested the plant.</p><br/><p>“Are you looking to die!?” she cursed, her eyes glittering with killing intent. She suddenly spit out a blob of smoke which rapidly spread out to cover the area around them, including Meng Hao.</p><br/><p>At the same time, the aura-changing transformation of the black feather was sent into chaos because of the smoke.</p><br/><p>As soon as the aura was disrupted, the surrounding black beetles buzzed into action. Even the few that had been following Meng Hao before suddenly turned ferocious, and flew straight toward him.</p><br/><p>Meng Hao’s face fell. He had never imagined that the young woman would use tactics like this. Now that he clearly had the aura of a cultivator, and could no longer conceal himself, Meng Hao had no choice but to fly away.</p><br/><p>As he did, the ground began to quake as tens of thousands of black beetles flew up, stared dead at him, and then charged toward him, causing a droning sound to fill the air.</p><br/><p>The young woman in beetle-form backed up quickly, her eyes gleaming with a pleased look. Inwardly, she was laughing coldly.</p><br/><p>Meng Hao eyed the young woman coldly. The properties of the smoke just now had left him shocked; it clearly had the ability to dissolve the effects of his transformation.</p><br/><p>“So,” he thought, “it was because you already had a magical technique that could interfere with my transformation that you attacked so decisively. You really want to kick me out of this place, huh...?</p><br/><p>“Well, then. Let’s just see who can kick the other person out first!” Laughing coldly as the black beetles closed in on him, Meng Hao made a grasping motion. Instantly, a spirit-immortal stone flew out of his ring of holding, which he then tossed in the young woman’s direction.</p><br/><p>As the black stone whistled through the air toward her, the young woman stared in shock. A moment later, it landed right in front of her.</p><br/><p>At the same time that the spirit-immortal stone appeared, its aura surged out, sending the black beetles into a mad frenzy. Rumbling filled the air as the beetles that had been chasing Meng Hao roared viciously, then changed directions. There were also many other black beetles from other locations on the land mass that began to charge toward the spirit-immortal stone, eyes bright red.</p><br/><p>The young woman’s face fell. She could never have predicted that Meng Hao would be able to use a tactic like this to turn the tables on her. Although her aura was not something that would stir up the beetles, because of the black stone in front of her, she was now the center of a huge maelstrom.</p><br/><p>“What kind of stone is that!?” she thought. “It’s driving the Ghost Eye Beetles crazy! Well, it must be some kind of treasure, which means he can’t have very many of them. At the most, he might have a handful. All I have to do is evade these crazy beetles for a bit, and wait until he goes broke!” The young woman clenched her teeth, backed up, and spit out another glob of smoke, which then surrounded her.</p><br/>\n</div>"}