{"title": "Chapter 1023: The Mountain and Sea Realm Alliance!", "id": 1023, "volume": 11, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-1023-the-mountain-and-sea-realm-alliance", "volume_title": "Volume 11", "body": "<h1>Chapter 1023: The Mountain and Sea Realm Alliance!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong></strong></p><br/><p>[/expand]</p><br/><p>A strange cultivator was almost able to hunt Li Ling’er down and kill her!</p><br/><p>Unexpectedly, no one from the Li Clan showed up to stop it from happening. The situation seemed very strange, especially considering... that the Li Clan was not very far away on Planet North Reed. In the Ninth Mountain and Sea, inquiries were rarely made when ordinary cultivators fought and killed another. However, when a Chosen died or was injured, it was always a big matter!</p><br/><p>Very few people would actually employ deadly force against a Chosen, mostly because of the numerous ramifications that would be involved.</p><br/><p>However, this strange cultivator clearly wanted to kill Li Ling’er. Most importantly... Meng Hao’s vision had been interfered with moments ago so that he couldn’t see what was happening.</p><br/><p>Clearly, this strange cultivator was not working alone. He definitely had some almighty expert hiding in the shadows, assisting him. Meng Hao had already reached such a conclusion before coming to rescue Li Ling’er. In the end, he decided that it didn’t matter; he had to rescue her anyway.</p><br/><p>Therefore, when he heard someone crying out to prevent him from landing his deadly attack on the young man, he didn't hesitate for even a moment to cry out: “Patriarch Reliance, block that man’s path for a quarter of an hour, and I’ll give you a hundred years of freedom!” This was only the third time he had spoken in the entire battle!</p><br/><p>At first, Patriarch Reliance was infuriated, and he was of a mind to ignore a mere hundred years of freedom. But as he thought about it, he realized that if Meng Hao had said he would give a lifetime of freedom, it would have been completely unbelievable. But if it was only a hundred years, it actually seemed a lot more plausible.</p><br/><p>“Fudge!” he cried. Eyes gleaming with savagery, he suddenly lifted his head and looked at the incoming old man, then roared.</p><br/><p>At the same time as he let out that intense roar, black light flashed around him as he shot toward the old man.</p><br/><p>That old man was none other than the person who had been accompanying Yi Fazi the entire time. His Dao Protector!</p><br/><p>When he saw Patriarch Reliance bearing down on him, his eyes widened with fear. Not quite sure what to make of him, he waved his hand, causing an enormous, illusory creature to appear that resembled a tadpole.</p><br/><p>It was pitch-black and had no eyes, only a gaping mouth. As soon as it appeared, it opened its mouth wide and lunged toward Patriarch Reliance as if to swallow him.</p><br/><p>“Fudgetastic Magical Super-Attack!” Patriarch Reliance roared, shouting as he barreled forward. Even as the words left his mouth, he was taken aback, and wondered why he had said that in particular. However, it actually seemed quite appropriate.</p><br/><p>Rumbling filled the air as Patriarch Reliance exploded with all of his power. Normally speaking, that in and of itself wouldn’t have caused the old man to pause. However, it was at this point that the old man noticed numerous beams of light radiating off of Patriarch Reliance. Instantly, his face fell, as if he had just remembered something. He appeared to be both shocked and terrified of the beams of light, and did everything he could to avoid them. As a result, he could proceed no further.</p><br/><p>Meng Hao didn't even look back, nor did he slow down. In the blink of an eye, he was upon Yi Fazi. He clenched his fist, his eyes flickering with killing intent, and then began to punch, intent on completely destroying the defenseless Yi Fazi.</p><br/><p>Yi Fazi’s heart was pounding. In his own Realm, he had an incredibly high position. Were that not the case, he would never have qualified to come to the Ninth Mountain and Sea for a trial by fire, let alone have a Dao Protector to guard him.</p><br/><p>However, his experience couldn't possibly compare to Meng Hao's, nor was he a match for him in terms of viciousness. Yi Fazi couldn't imagine all of the various things that Meng Hao had experienced.</p><br/><p>In this moment of critical danger, Yi Fazi’s expression suddenly turned to one of madness. He bit down on the tip of his tongue, then spit out a mouthful of blood, which transformed into a huge, blood-colored lake that spun toward Meng Hao.</p><br/><p>When the lake came into contact with Meng Hao's fist, it simply evaporated, turning into a blood-colored mist that quickly faded away. As for the fist... it passed directly through the mist to slam into Yi Fazi's chest.</p><br/><p>A massive boom rang out, accompanied by cracking sounds. Blood sprayed out of Yi Fazi’s mouth as his chest caved in. As he flopped backward, he felt as if there were 123 bursts of energy exploding within him. In the blink of an eye, he exploded.</p><br/><p>However, after he exploded, Meng Hao frowned as he saw all of the bits of blood and gore form back together in midair. Terrifying ripples of power exploded out.</p><br/><p>“Meng Hao!! I’m gonna kill you! KILL YOU!!</p><br/><p>“You destroyed my favorite magical body! I'm going to take you... and refine you into a new magical body for myself! Meng Hao, I want you dead, DEAD, DEEAAD!”</p><br/><p>Howls that seemed to originate from hell itself rang out from the reforming body, filled with boundless rancor and insanity.</p><br/><p>As the words echoed out, the shattered flesh rapidly congealed back together, materializing into something that didn’t look like Yi Fazi had moments ago, but rather...</p><br/><p>A three-headed creature with a long, undulating tail. It looked like neither a human nor a Demon!</p><br/><p>The first head looked like Yi Fazi’s, the second was half-python, half-human, vicious and fierce. The third head was completely snake-like, complete with a flicking, forked tongue.</p><br/><p>“Meng Hao,” he cried in a shocking, piercing voice. “I'm gonna tear you to shreds! I’ll baptize myself in your blood to complete my Immortal foundation!”</p><br/><p>When Meng Hao saw the reformed Yi Fazi, his eyes widened. Li Ling’er also saw him, and her heart began to thump.</p><br/><p>Meng Hao’s mind thrummed as he looked at Yi Fazi. He had never seen any entity such as this before. He had seen Demons, things like mountains or rivers personified, but those were true Greater Demons.</p><br/><p>But he had never seen anything at all that looked like this. It was like a beast, but not. Like a cultivator, but not.</p><br/><p>Even more shocking... Meng Hao realized that the Demon Sealing Jade in his bag of holding was suddenly vibrating at a frequency unlike anything he had ever experienced before.</p><br/><p>Those vibrations even exceeded what he had felt when he had acquired the Fifth Hex, or when he had encountered the Sixth Generation Demon Sealer.</p><br/><p>It was as if an enmity and hatred that could not be wiped away with the passage of time was suddenly exploding out from the Demon Sealing Jade with incredible intensity.</p><br/><p>“A Lower Realms rebel! Bloodline of the Zheng Clan! When we Demon Sealers encounter someone like this, he MUST DIE!</p><br/><p>“Die. Die. DIE!! DIEEE!!” Meng Hao’s mind rumbled with the ancient voice of the Demon Sealing Jade. An intense murderous aura erupted out from his Demon Sealer Immortal meridian, which immediately began to rotate.</p><br/><p>Apparently, if Meng Hao did not slaughter this so-called Lower Realms rebel, then his Demon Sealer Immortal meridian would no longer approve of him!</p><br/><p>This was an intense madness and hatred that Meng Hao had never felt before in his entire life.</p><br/><p>Almost as soon as Yi Fazi’s true appearance was made manifest, the old man who was tangled up with Patriarch Reliance suddenly went berserk. “Fool! IMBECILE! Y-y-you... dammit, you already lost! Why didn’t you just go back right away! Why would you possibly be so idiotic as to reveal your true form here! Dammit! DAMMIT! You people from the Zheng Clan are all MORONS!!!”</p><br/><p>He appeared to be completely enraged, and was trembling all over. In addition to the rage on his face, there was also terror and anxiety. It was as if Yi Fazi revealing this form would cause a Heaven-shaking, Earth-shattering catastrophe.</p><br/><p>In the same moment that Yi Fazi revealed his body, a howl could be heard coming from the Ji Clan’s ancestral mansion on the Ninth Mountain. That howl instantly echoed out to fill the entire Ninth Mountain and Sea.</p><br/><p>Not everyone could hear it, though. Only Dao Realm experts were able to detect the shrill and abrupt call.</p><br/><p>It was a sound that hadn’t been heard for a very, very long time!</p><br/><p>The shocking cry caused the faces all of the Dao Realm Patriarchs in the Ninth Mountain and Sea to flicker.</p><br/><p>That was especially true of the Three Great Daoist Societies. Instantly, all of their Dao Realm experts flew out, their faces serious and even nervous.</p><br/><p>The entire Ji Clan on the Ninth Mountain was equally shaken. Their Dao Realm experts began to pant as they charged out toward the rear of the Ji Clan ancestral mansion, where... at the peak of the Ninth Mountain, was a celestial pond!</p><br/><p>Its waters were as clear as glass, and were covered by wisps of white mist. However, at the bottom of the pond, nine bronze cauldrons were visible. Each of the cauldrons emanated an air of extreme ancientness, as if they had existed within the stream of time for an indescribable length of time.</p><br/><p>In the center of the nine cauldrons, shockingly... was an enormous Xuanwu turtle.</p><br/><p>That Xuanwu turtle and those nine cauldrons were not items that belonged to the Ji Clan.</p><br/><p>In fact, you could say that they did not belong to any clan or sect at all. They belonged... to the Ninth Mountain!</p><br/><p>Any clan or sect who became the Lord of the Ninth Mountain and Sea would have control of them!</p><br/><p>The Xuanwu turtle's back bristled with sharp spikes, each one of which was covered by countless magical symbols. It looked incredibly fierce as it sat there, its back just barely protruding out of the water. For years, it had remained in that exact position, unmoving, as if it were a statue.</p><br/><p>However, moments ago, the gigantic Xuanwu turtle had suddenly moved! A tremor ran through it as it rose up and howled, a terrifying howl that echoed out into the starry sky.</p><br/><p>Everything shook, and the pond water seethed. The nine cauldrons began to shake.</p><br/><p>The Dao Realm experts of the Ji Clan were all getting incredibly nervous. They looked at the howling Xuanwu turtle, and their faces fell.</p><br/><p>The howl seemed to indicate that the Xuanwu turtle was enduring indescribable pain.</p><br/><p>“What happened! Wh-why is the Xuanwu turtle howling as if in pain!?!?”</p><br/><p>“Could it be that someone has made an incursion into our Ji Clan?!?!”</p><br/><p>“No, I don’t think so. Now that I think about it, there’s a legend in the Ninth Mountain....”</p><br/><p>Even as the Dao Realm experts were quivering in shock, suddenly, an enormous eye appeared in the sky above the Ninth Mountain!</p><br/><p>Within that eye could just barely be seen the image of an old man sitting cross-legged in meditation.</p><br/><p>In the instant the eye appeared, the entire Ninth Mountain and Sea trembled.</p><br/><p>An ancient voice suddenly echoed out from within the eye: “Outsiders have entered the Ninth Mountain and Sea! Comply with the ancient treaty of the Mountain and Sea Realm Alliance! Slaughter the Outsiders!!”</p><br/><p><strong>Chapter 1023: The Mountain and Sea Realm Alliance!</strong></p><br/><p>-----</p><br/><p><strong>Note from Deathblade:</strong> The following is Er Gen's note, not mine....</p><br/><p><strong>Note from Er Gen:</strong> If all goes as planned, I’ll return home tonight. However, my daughter’s tests at the hospital haven’t been finished. There are still some more things that need to be checked out. However, unless something unforeseen happens, I’ll be home tomorrow night, which means I’ll return to my normal schedule the day after. Thank you everyone, I hope you can understand.</p><br/>\n</div>"}