{"title": "Chapter 1077: Dao Divinity Scripture!", "id": 1077, "volume": 11, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-1077-dao-divinity-scripture", "volume_title": "Volume 11", "body": "<h1>Chapter 1077: Dao Divinity Scripture!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong></strong></p><br/><p>[/expand]</p><br/><p>The main purpose of the fifth golden gate stone stele was to develop the disciples’ faith in the sect. When it came to matters of what was right and wrong, sometimes it was important to accept the decisions and explanations of the sect over one’s personal judgement.</p><br/><p>If a disciple couldn’t show faith in the sect, then the trial by fire wouldn't begin, and the disciple would be ejected from the fifth stone stele, just like Meng Hao had almost been.</p><br/><p>If a disciple could show faith, well... at that point the trial by fire would begin. Then, the level of their cultivation base, as well as their depth of faith in the sect, would determine their ranking.</p><br/><p>Moments ago, within the world of the trial by fire, the blood-colored fiendish Devils had continued to appear, although their forms and appearances were different each time. When Meng Hao’s name entered the top 1,000, the slaughter ended. However, the trial by fire did not end. The world around him shattered to pieces, and when it reformed, he was facing a different scene.</p><br/><p>He was still in a sect, and was being given orders just like he had been before. This time, they were the invaders. A voice from the sect told them that this land was actually their native homeland!</p><br/><p>They had to slaughter any resistance they met, and kill any opposing cultivators.</p><br/><p>Things were complicated, leaving many people confused. However, in the end, what the sect said was true. This place... really was their former homeland!</p><br/><p>The fighting went on, and Meng Hao's name rose up into the 500s. Then, everything changed again. A new world appeared, and new instructions were given by the sect.</p><br/><p>Similar things happened when he reached the top 400, 300, 200... and even 100. Apparently, the changes occured with every move of 100 positions.</p><br/><p>It then continued to happen with more and more frequency. By the time he reached the top 20... he had experienced many, many worlds. The one thing that remained eternally unchanging was the sect. The orders from the sect were eternal. The judgement of the sect was eternal.</p><br/><p>This was almost like a form of brainwashing. All of these experiences told Meng Hao that, in any matter, the sect was always correct. If he had faith in the sect, the trial by fire would continue. If hesitation regarding the sect rose up in his mind, then he would be expelled.</p><br/><p>Eventually... Meng Hao’s name reached the top 10. The world fell apart in front of him, and when it formed back together, it turned into... a very familiar place.</p><br/><p>It was... Planet South Heaven!</p><br/><p>This was the home that existed in his memories, a place where many, many things had occurred. He had numerous memories of this place, but right now, when he saw Planet South Heaven, his heart trembled.</p><br/><p>His ability to put on a show of faith in the sect began to wane. The power of expulsion seemed to rise up faintly.</p><br/><p>“This place... is an Outsider Planet! The true Planet South Heaven of the Ninth Mountain and Sea was destroyed and transformed into a door! Within that door appeared a new planet!</p><br/><p>“Destroy this place! Use its power to collapse the Stargate!”</p><br/><p>As the voice from the sect faded away, Meng Hao looked around to see countless cultivators surrounding him. Almost all of them were familiar to him, although he couldn’t recall their names. However, he recognized that these people were fellow sect members from this phase of the trial by fire, people with whom he had charged into battle many times before!</p><br/><p>Roars rang out as they charged toward Planet South Heaven. Meng Hao’s heart trembled as he saw the familiar mountains, rivers, and lands, as well as old friends.</p><br/><p>“Kill everything that lives on this planet! When the Outsiders come, their bloodlines will awaken, and they will become our enemies! Destroy this planet! Wipe it out from the starry sky!” As the voice echoed out, everyone charged forward into the slaughter. Only Meng Hao remained hovering there, silent.</p><br/><p>The expulsion force began to gather, as if countless voices were beginning to call out to him, urging him forward. After a moment, Meng Hao took a deep breath and then advanced. He vanished, then reappeared up ahead, between the army of cultivators and the crowds from Planet South Heaven. He raised both hands up into the air to stop the advancing army.</p><br/><p>However, in the moment he tried to do so, the expulsion force gripped him, and the voice of the sect roared in his ear.</p><br/><p>“After all those experiences, you still don't have faith in the sect!?!?” it said, sounding pained.</p><br/><p>“Since that’s the case, then you shall be allowed to personally witness the truth!” The voice of the sect turned into a power that Meng Hao was powerless to resist, and forced him to remain motionless out in the starry sky.</p><br/><p>At the same time, the army of fellow sect cultivators vanished. In an instant, Planet South Heaven seemed to pass through countless years. Suddenly, it began to tremble as an incredible force exploded out. Next, Meng Hao watched as the planet slowly began to move.</p><br/><p>As it moved, shockingly... the former position of the planet revealed a black hole!</p><br/><p>It looked like... a door!</p><br/><p>After the door appeared, a beam of light could be seen. As it spread out, shocking roars could be heard coming from Planet South Heaven. At the same time as the light spread out, all of a sudden, a butterfly flew out from inside the door!</p><br/><p>The butterfly was enormous, seemingly without end. Astonishingly, numerous Outsider cultivators flew off of the butterfly, radiating murderous auras.</p><br/><p>Wherever they passed, stars crumbled and planets shattered. Countless cultivators died screaming. The Ninth Mountain collapsed and the Ninth Sea boiled!</p><br/><p>Before long, the entire Ninth Mountain and Sea was in ruins. Countless people died, many that Meng Hao knew, many that he didn't. They all died....</p><br/><p>Planet East Victory, Planet North Reed, Planet West Felicity.... all crumbled.</p><br/><p>In the final scene, a huge Xuanwu turtle let out an agonized howl, seemingly filled with infinite grief. Then it collapsed into a mass of blood and gore.</p><br/><p>The vision ended, leaving Meng Hao gaping. He forgot about struggling and resisting. As the vision faded away, he was gripped by the power of expulsion and ejected from the world.</p><br/><p>In the moment before he left, the ancient, grieving voice of the sect echoed in his ears: “Now do you believe?”</p><br/><p>A tremor ran through him, and when everything became clear, he was back in the Nine Seas God World, standing outside of the fifth golden gate stone stele. He looked up to see that his name... was listed in 10th place!</p><br/><p>Cries of astonishment rang out in all directions, but Meng Hao still seemed to be in another world. He could barely hear what anyone was saying as he stood there in front of the stone stele for a long moment.</p><br/><p>It was at this point that Godmaster's voice spoke into his ear: “Every person's trial by fire in the fifth golden gate begins exactly the same way. However, those who reach the top 10 all experience different things....”</p><br/><p>“What you saw could be visions of the future, or could be mere fantasies.”</p><br/><p>Meng Hao looked up at Godmaster. After a long moment of silence, he took a deep breath, and dispelled his disquieting thoughts. Whether or not he wanted to admit it, this trial by fire had left a deep impression on him.</p><br/><p>“In the end, power is everything!” he thought. “Even if that final scene was real, if I can get strong enough, then when that butterfly shows up, I’ll kill it! Then... everything will turn out different!</p><br/><p>“Trusting the sect isn’t important. The important thing... is to make yourself strong enough!” Meng Hao's eyes shone with a bright light as he clasped hands and bowed to Godmaster. Then he turned, his expression one of determination as he flew toward another of the golden gate stone steles.</p><br/><p>The three month period was almost up, and before he left, Meng Hao wanted to get those 300,000,000 Immortal jades. He also wanted to leave an eternal mark on the Nine Seas God World.</p><br/><p>“Other than the fifth stone stele, I want my name... to be in 1st place on all of the golden gate stone steles! If I can’t do it this time around, then I’ll definitely do it before I leave!” Meng Hao took a deep breath as he sped toward the seventh golden gate stone stele.</p><br/><p>The seventh golden gate was the trial by fire of divine sense!</p><br/><p>Divine sense wasn’t necessarily Meng Hao’s strong point. However, he had the first manual of the Dao Divinity Scripture, which he had cultivated in the past. According to the legends, the Dao Divinity Scripture was the supreme scripture for strengthening divine sense. However, after cultivating it, Meng Hao hadn't felt anything particularly impressive! [1. Meng Hao acquired the first manual of the Dao Divinity Scripture from Choumen Tai in chapter 301]</p><br/><p>At the very most, it had helped his divine sense a bit when he was in the Mortal Realm. Because he had entered the Immortal Realm and drastically raised his cultivation level, though, it had actually become a weak point for him.</p><br/><p>That was why the Sea Daughter had been able to stop him in place with her divine sense. As for his weaknesses, once he became aware of them he would strive to remedy them. [1. I have to admit that despite reading it in Chinese, then translating it and editing, I totally forgot about the part where Sea Daughter Bei Yu stopped Meng Hao in place with her divine sense. It was only a few chapters ago in chapter 1071]</p><br/><p>“Could it be that I cultivated it incorrectly? Or perhaps it's not the real Dao Divinity Scripture?”</p><br/><p>The Dao Divinity Scripture appeared in his mind as he flew forward. Not too much time passed before he appeared outside the seventh golden gate stone stele. Without the slightest hesitation, he stepped into the golden gate.</p><br/><p>Surprisingly, as soon as he entered, his name appeared on the stone stele. All of the disciples who were gathering stared closely at Meng Hao’s name and began to speculate what rank he would achieve.</p><br/><p>Inside the world of the seventh golden gate, Meng Hao threw his head back and roared, and his hair whipped around. The entire world was a path consisting of 10,000 stone steps. Each step represented one rank.</p><br/><p>The first 9,000 were far too simple for Meng Hao, but the last 1,000 got increasingly difficult. Every time he took a step, he would find himself surrounded by more divine sense power, which tried to bore into and collapse his mind.</p><br/><p>Countless thoughts poured into him, confusing him, making it more and more difficult to endure.</p><br/><p>At the same time, the longer he endured, the faster his divine sense grew. Furthermore, the Dao Divinity Scripture swirled inside his mind, and as he proceeded forward, he gained continuous enlightenment regarding the various mnemonics.</p><br/><p>Time passed. Outside the seventh golden gate, the disciples watched as Meng Hao’s name continued to rise. This time, his progress was much slower than with the previous stone steles.</p><br/><p>“Divine sense is his weak spot!”</p><br/><p>“He didn't advance this slowly in either the ninth stone stele or the fifth. The only way to smoothly get through the seventh golden gate is to have strong divine sense. And yet, he's going so slow!”</p><br/><p>“From the look of it, it will be just too hard for him to get into the top 10!” Even as the crowd whispered their speculations, Meng Hao was in the world of the seventh stone stele, trembling violently. His eyes were bright red, and yet, he was smiling.</p><br/><p>“So, THAT’S how you cultivate the Dao Divinity Scripture!</p><br/><p>“I understand!” Eyes flickering, he extended both hands, performing incantation gestures which caused his body to turn into something like a black hole. Rumbling could be heard as he began to absorb all of the attacking divine sense!</p><br/><p><strong>Chapter 1077: Dao Divinity Scripture!</strong></p><br/>\n</div>"}