{"title": "Chapter 1076: Blind!", "id": 1076, "volume": 11, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-1076-blind", "volume_title": "Volume 11", "body": "<h1>Chapter 1076: Blind!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 1076: Blind!</strong></p><br/><p>Everything was completely and utterly silent. The reek of blood spread out, and the ground was covered in pools of blood.... Dead bodies could be seen everywhere, the corpses of those who had refused be slain by fellow sect disciples, and had instead ended their own lives.</p><br/><p>They demonstrated their sincerity by sacrificing their own lives!</p><br/><p>Some had fled, but were cut down in the process.</p><br/><p>Finally, a sigh could be heard from the mouths of one of the three figures up ahead.</p><br/><p>“Elder Brother Li, you are also a fiendish Devil!” Suddenly, two of the three figures joined forces to attack the third. Immediately Essence aura erupted out from all of them.</p><br/><p>Shockingly, all three of them were Dao Realm experts.</p><br/><p>The third of the group now wore a bitter and complex expression. He offered no explanation, but instead, merely sighed and began to fight. Booms echoed out as he fell back, slowly approaching the crowd of people within which Meng Hao stood.</p><br/><p>He looked up at the other two who were attacking him, and sighed again.</p><br/><p>“You really think the Devils infiltrated us...? Well, there’s no need for pointless loss. I don’t even have a hundred years of life left anyway, so...</p><br/><p>“It doesn’t matter. Regardless of what you people think, if the members of the Junior generation can kill themselves to prove their sincerity, then how could I possibly fear death!?” With that, he glanced back at the crowd of disciples, including Meng Hao, and gave them a meaningful look. It was an expression that said he couldn't bear to part with them, and at the same time, wished them well. Then he smashed his hand down onto the top of his head.</p><br/><p>That strike caused a tremor to run through his body. Boundless Essence aura then erupted out of him.</p><br/><p>“I’m willing to die in body and spirit,” he said in his archaic voice. “Let my cultivation base bolster all of the disciples of the sect. Allow them... to fight against the invading enemies! Give them strength!” As he faded away, his aura spread out and merged into the bodies of the disciples.</p><br/><p>That included Meng Hao. He felt something warm flowing through him, causing his cultivation base to rise up. In addition, a glowing light rose up around him, almost like some sort of protective shield.</p><br/><p>Within that shield, he could feel an archaic will that filled him with regret and kindness.</p><br/><p>Everyone stood there, reticent, hearts pounding, their suspicions growing stronger.</p><br/><p>“Are there really enemies coming to invade?” That was the question running through all of their minds. Meng Hao couldn’t stop himself from thinking the exact same thing.</p><br/><p>The two Dao Realm experts looked at the shields surrounding all of the disciples, and their faces flickered. They exchanged a look, and were about to say something, when all of a sudden rumbling sounds filled the heavens. The clouds collapsed as a huge rift appeared, as if some giant hand were ripping them open. Next, a bloody glow spread out in all directions!</p><br/><p>Within the rift, it was possible to see another shocking world. That world was completely red, as if it had experienced countless ages of bloodshed, staining the whole world the same color.</p><br/><p>More shocking was that there was a sea visible that was made up entirely of blood.</p><br/><p>Even the sky was red. That world instantly left a deep impression on everyone who saw it.</p><br/><p>Next, countless figures in long robes whistled through the air out of the rift. Their faces were pale, and their expressions were that of joy. There were even many who were laughing happily as they looked around.</p><br/><p>Almost as soon as these people appeared, a voice shouted out in Meng Hao's ears, and in the ears of all the other cultivators: “Kill them!”</p><br/><p>Everyone hesitated for a moment, then flew up into the air toward the cultivators coming out of the rift, and began to slaughter them.</p><br/><p>The cultivators from the rift stared in shock, and immediately began to shout out various explanations. However, they could not avoid being cut down.</p><br/><p>Meng Hao frowned. For some reason, he got the feeling that these people weren’t invading. In fact, many of them seemed to be smiling amiably.</p><br/><p>After a moment of hesitation, he attacked, tapping one of the enemy cultivators on the forehead. The man’s body collapsed; he seemed to be as weak as a mortal. In the moment before he died, he looked at Meng Hao, shocked.</p><br/><p>“We have no evil intentions. We’re escaping to this place! Please, let us go....”</p><br/><p>Meng Hao frowned and sent his divine sense sweeping out. Instantly, he saw that the people were mostly dodging out of the way and offering explanations. Meng Hao quickly realized that there were even Foundation Establishment cultivators who were only able to make it safely here by means of a teleportation portal.</p><br/><p>Furthermore, the strongest among them weren’t even attacking. They were just offering anxious explanations, and falling back in retreat. It seemed most of them were actually retreating into the rift, as if to leave this world.</p><br/><p>The disciples in the sect army to which Meng Hao belonged began to hesitate. Everyone seemed confused, and even those who were attacking seemed to be forcing themselves. There were only a handful who were resolutely attacking with full viscousness, carrying out mass slaughter.</p><br/><p>“Trial by fire of slaughter?” he murmured to himself.</p><br/><p>Meng Hao hesitated, falling behind the crowd of attacking cultivators. At that point, a stern, dark voice was transmitted into his ear.</p><br/><p>“They’re fiendish Devils from out in the starry sky! Why aren’t you killing them!?” The voice echoed like claps of thunder. One of the two Dao Realm Patriarchs appeared next to Meng Hao and stared at him solemnly.</p><br/><p>“When you look at them, they seem kind and good. That’s what you think, but if you trust in the sect, you’ll kill them! If you don’t have faith in the sect, then what is the purpose of coming to this trial by fire? If you won’t slaughter for the sect, then get the hell out of here!” The man waved his sleeve, causing a massive power of expulsion to rise up around Meng Hao. It was as if the entire world was about to reject him and eject him out forcibly!</p><br/><p>Just in the moment in which Meng Hao was about to be expelled out of the world, the cultivators in the rift suddenly stopped evading. Their kind smiles twisted viciously, and their multi-colored Daoist robes turned as red as blood!</p><br/><p>Terrifying auras exploded out from them, and their smiles grew even more ferocious. They now looked completely and utterly different from before. Rumbling could be heard as leathery, blood-colored wings sprouted out of their backs. Now, they truly looked like evil Devils.</p><br/><p>“Someone in this world actually knew about our plan.... What a bore! These must be surviving cultivators from one of the other worlds we destroyed!”</p><br/><p>“Who cares? Although things might not be as fun, at least... we can still eat them all! That feeling of contentment can make up for some of the lost fun.”</p><br/><p>“What a pity, they saw through our plan.” Sinister howls could be heard coming from the mouths of the Devilish cultivators. The ones who had died just now rose back to life and began to attack, causing a brutally evil air to erupt out.</p><br/><p>The blood-colored world inside the rift suddenly erupted with blood-red light. Shockingly, countless souls appeared, screaming miserable screams. They seemed endless, and were apparently the souls of the people butchered by the blood-red cultivators.</p><br/><p>What caused Meng Hao’s eyes to widen even more, and what filled the hearts of the hesitating disciples with complete shock, was that... the blood on the battlefield began to congeal together... and transform into more vicious figures.</p><br/><p>Shockingly... they were the disciples the sect had identified earlier as being fiendish Devils! Even the ones who had ended their own lives began to rise to their feet, vicious smiles plastered on their faces.</p><br/><p>“What a bunch of morons! How boring!”</p><br/><p>“We just started having fun and it's already over! How sad. I never thought that they would realize we were traitors!”</p><br/><p>As they rose to their feet, the countless droplets of blood that constituted the remains of the Dao Realm cultivator formed back together. His mouth twisted into a taunting smile, and an intensely powerful aura rose up from him.</p><br/><p>“Erupt,” he said. Instantly, Meng Hao and all the other people who had absorbed some of his cultivation base felt their bodies rumbling. Blood sprayed out of Meng Hao’s mouth, and the warm current that had spread through his body turned malignantly poisonous. Immediately, his organs began to rot and decay.</p><br/><p>In that moment, the same words rang out in the minds of everyone present.</p><br/><p><em>The sect was right!</em></p><br/><p><em>The sect said that these people were fiendish Devils, and they were!</em></p><br/><p><em>The sect said that the Dao Realm Patriarch was a fiendish Devil, and he truly was!</em></p><br/><p><em>The sect said that enemies were invading, and they really were!</em></p><br/><p><em>The sect said that the intruders were not kind and good, but rather, fiendish Devils. They... absolutely were fiendish Devils!</em></p><br/><p><em>Wrong! All of the disciples who hesitated were wrong!</em></p><br/><p>All of this proved without a doubt that the sect had been right in everything!</p><br/><p>Now, the slaughter truly began, and booms filled the air.</p><br/><p>Meng Hao’s mind reeled. Even as he was being expelled from the world, he suddenly raised his hand and waved a finger through the air. Instantly, one of the blood-colored Devilish cultivators coming through the rift exploded.</p><br/><p>All of a sudden, the power of expulsion faded away.</p><br/><p>The Patriarch surrounded by the glowing light gave Meng Hao a look, then turned away and waded into the fighting.</p><br/><p>Meng Hao didn't say anything, but his eyes began to glow brightly. After they flickered a few times, he sighed.</p><br/><p>“Have faith in the sect…” he murmured softly. “Well done, Nine Seas God World. In a mere trial by fire, you still manage to plant a seed like this in the hearts of your disciples. The last time I tried out the fifth golden gate trial by fire, it wasn’t like this.”</p><br/><p>In the fifth golden gate stone stele, nothing else was really as important as the key to the entire trial by fire.... The message was: don't trust in your own judgement, put your faith in what the sect tells you.</p><br/><p>Were it not for the fact that Meng Hao had corroborated the Dao on his own to achieve Immortal Ascension, had a very strong Dao heart, and had experienced many things, then even his faith in himself would have been affected. If it had, then that seed would also have been planted in him as well.</p><br/><p>“To pass this trial in the top 10, I have to slaughter my way to the top.” Meng Hao took a deep breath, and his cultivation base erupted with power. Now that he understood what was going on, he attacked without the slightest hesitation. He slashed his way into the battle like a dragon surrounded by a wake of blood.</p><br/><p>Outside, Meng Hao’s name suddenly appeared on the fifth golden gate stone stele, somewhere in the thousands, flashing with light.</p><br/><p>1,000. 700. 500. 300... all the way past 100!</p><br/><p>It continued to climb. 80. 70. 40....</p><br/><p>People outside gasped at how quickly his name climbed up.</p><br/><p>Only Granny Nine and Ling Yunzi, plus the Demonic Cultivator Horde Patriarch and the other Dao Realm experts, watched the stone stele with glittering eyes, lost in thought.</p><br/>\n</div>"}