{"title": "Chapter 1083: Lord Fifth's Grand Ambition!", "id": 1083, "volume": 11, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-1083-lord-fifths-grand-ambition", "volume_title": "Volume 11", "body": "<h1>Chapter 1083: Lord Fifth's Grand Ambition!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 1083: Lord Fifth's Grand Ambition!</strong></p><br/><p>For years in the Ninth Mountain and Sea’s Nine Seas God World, the most 1st place spots occupied by any one person was six. That person earned honor and glory that lasted for many years before fading. Even to this day, there was some trace of that glory left behind.</p><br/><p>The single remaining trace was on the ranking list of the ninth golden gate stone stele. That person was the previous 1st place spot holder... Zong Wuya. A thousand years before, he had been the number one Chosen in the Nine Seas God World. Although he had become a legend, strangely, his name was not very well known in the outside world.</p><br/><p>But now, Meng Hao had broken his record. He had eight 1st place spots, ensuring that everyone in the sect was shaken, from the cultivators watching everything that happened in person to those who were observing from afar in secluded meditation.</p><br/><p>Conversations immediately broke out in the crowd.</p><br/><p>“This makes me think of... Elder Brother Zong Wuya from all those years ago....”</p><br/><p>“His performance was just as stunning and grand. So domineering....”</p><br/><p>“Elder Brother Zong Wuya's achievements slowly faded away over a thousand years. As for Meng Hao’s achievements... I wonder how many thousands of years will have to pass before he is surpassed... as 1st place on the ninth stele!”</p><br/><p>As the buzz from the surrounding crowd continued to grow louder, Meng Hao took a deep breath, clasped hands, and bowed deeply to Granny Nine and the others. Then, he turned and shot off toward his Immortal’s cave.</p><br/><p>As Meng Hao left, he heard Granny Nine’s transmitting into his ears: “Seven days. In seven days, the Windswept Realm will be opened.... Make your final preparations.”</p><br/><p>He stopped in place, then turned and bowed again, before finally vanishing.</p><br/><p>Soon after, he appeared in his valley Immortal’s cave, sinking down through the water.</p><br/><p>Almost immediately, he heard shrill cries echoing about, which happened to be the excited squawks of the parrot.</p><br/><p>“Listen up, it’s inspection time! Look lively for Lord Fifth! Come, come. We sing on my mark! Lord Fifth’s future happiness all depends on you!”</p><br/><p>The meat jelly didn’t want to be left behind, so it cried out: “And Lord Third too! Lord Third’s future all depends on you!”</p><br/><p>Meng Hao looked around, a strange expression on his face. The first thing he noticed was that the group of Demonic cultivators in the pool of water looked extremely gaunt and haggard. However, their expressions were that of mad piety, as if the parrot were truly a god to them.</p><br/><p>Even more shocking was that Su Yan looked completely different than before. Her face was pale, and she looked dazed. Apparently, the ordeal of going through these days of indescribable torment had brought her willpower to the point of breaking. She looked like she was going through the motions on pure instinct.</p><br/><p>The parrot gave a shout, and the singing began. Everyone belted out the song in harmony, maintaining a strange cadence. Despite having prepared himself mentally, as soon as Meng Hao heard the song, he could barely force himself to keep listening for more than a few seconds.</p><br/><p>“I'm your little, dear little seafood dish! However you love me, it’s never too much! I'm your little, dear little seafood dish! Seeeaaaaafoooooood DISH!” [1. This latest seafood song is a direct reference to one of the most popular songs in China in recent years. You can find some information about it, and even hear the tune, here. I feel like I hear this song at least every other day here in China, and it makes me want to rip my ears out, so from now on I'm going to sing Lord Fifth's version of it!]</p><br/><p>The parrot looked around arrogantly, especially as the final verse was sung, and the pitch of the song rose up sharply. In the blink of an eye, the sky went dim, and a huge wind kicked up.</p><br/><p>Meng Hao’s eyes went wide as he stared at all of this happening. He took a deep breath, and was unable to stop himself from admiring the parrot and meat jelly. He had handed over a troupe of hateful Demonic cultivators to the two dunces, and they had come back to him with an impassioned, fanatical singing group.</p><br/><p>“STOP!” the parrot cried suddenly, flapping its wings to stop the singing. Not a peep could be heard from the singers. Meng Hao didn't even dare to think about what they had experienced to cause them to behave so well.</p><br/><p>“Look, bitches, don’t you remember what Lord Fifth told you!? You can't sing that way! You have to have FEELING! You need to MOVE YOUR EYES!” Enraged, the parrot flew over to a sea turtle and began to beat it viciously with its wings.</p><br/><p>“And YOU, you giant scallop! You need to shine! You hear me!? DAMMIT! You idiot!</p><br/><p>“And the rest of you, what are you looking so happy for!? What the hell were you doing with that last verse, huh? What the hell? Lord Fifth wants the tone to rise. Do you understand? RISING TONE!”</p><br/><p>After more enraged rebuking, the parrot finally flew over to Meng Hao, looking very apologetic, as if it had failed in its mission.</p><br/><p>“Haowie, give Lord Fifth a bit more time. These morons don't listen very well. In Lord Fifth’s opinion, if we try to sell them now, we’ll really sustain some heavy losses. Just leave them in my hands for a bit longer. Lord Fifth has a dream, and that dream is to have a really top-notch seafood song. I’m going to intensify the training immediately!</p><br/><p>“The day will come when I take them out in the Ninth Mountain and Sea. We’ll tour the entire Mountain and Sea Realm! We’ll travel through the starry sky! Their song will become the melody of all the Heavens!” Having found its new ambition, the parrot began to glow with bright light.</p><br/><p>Meng Hao stared in shock. Before he could even say anything in response, the meat jelly jumped in.</p><br/><p>“Hey, you old pigeon, why are you glowing all of a sudden?! Waahhhh! How’d you do that?! I want to glow!” It suddenly held its breath, causing its face to turn red. Then it let out a mighty bellow, after which... it suddenly began to glow with bright light as well.</p><br/><p>Meng Hao felt a headache coming on. He quickly nodded at the seemingly insane parrot, then hastily turned and flew toward his Immortal’s cave. As he neared it, he could hear the voice of the meat jelly calling out in irritation.</p><br/><p>“Listen, you crotchety pigeon, these seafood dishes are obedient thanks to Lord Third’s contributions! Lord Third wants bullies! Lord Third wants these seafood dishes sold and exchanged for bullies! I must convert bullies!”</p><br/><p>“Moron! How much do you think you could sell them for? Do you even have a brain? Well, do you? You can count, can’t you!?”</p><br/><p>“Lord Third has a brain! Lord Third’s entire body is a brain!!”</p><br/><p>When Meng Hao heard this, he cleared his throat and stepped into his Immortal’s cave. Moments later, more angry bickering could be heard from the parrot.</p><br/><p>“Moron! Fool! Idiot! These seafood dishes would only sell for a trifling sum! However, after they’ve completed Lord Fifth’s training, we’ll have an incredible singing group on our hands! Whatever place we go to, we can sell out huge concerts! Do you know how many spirit stones we can make? That’s the best way to handle things long-term!”</p><br/><p>“You mean like when Meng Hao got all those spirit stones when he went to the Medicine Pavilion in the Fang Clan?”</p><br/><p>“Obviously! Except that Haowie doesn’t count for bird crap. If he can do that, just imagine how much better Lord Fifth can do! I've already figured it all out. When the time comes, the two of us will be the lead singers. Even Haowie will have to come sing too. When I think of that image, I just get so excited! We need to think of a band name! Come on, start thinking of some ideas.”</p><br/><p>Meng Hao slipped into his Immortal’s cave and waved his hand, sealing away the outside world. He truly had no further desire to listen to the parrot and meat jelly speaking to each other. As for the song... Meng Hao believed that he would feel utmost admiration for anyone who could listen to the entire thing.</p><br/><p>Although, if the parrot actually did succeed, and the seafood song got popular, maybe he would cooperate and sing with them... for the spirit stones.</p><br/><p>He sat down cross-legged and patted his bag of holding. A beam of light immediately flew out, which was Chu Yuyan. As he lay her down in front of him, he noticed that her face was no longer pale, but had some color to it. She still wasn't awake, though.</p><br/><p>He looked at her for a long time before finally sighing inwardly. Then he reached out and touched her forehead, sending cultivation base power into her, accelerating the process of dispelling the poison.</p><br/><p>The heart-blood of ten Sea Dragons was definitely capable of dispelling the poison afflicting her. However, it wasn't capable of doing so very quickly. The process of cleansing her qi passageways was a slow one, in which the poison was constantly broken down and transformed into something beneficial to one’s cultivation base.</p><br/><p>After checking her thoroughly, he sat in thought for a moment, and then decided not to force the process to go any faster. Chu Yuyan’s current state wasn’t a harmful one to her, and in fact, could be viewed as a type of good fortune.</p><br/><p>Actually, the Sea Dragon venom was both a venom and powerful tonic. With no antidote, it would be deadly. With the antidote, it was exactly the opposite.</p><br/><p>“This catastrophe will actually help her to make a huge advancement in terms of her cultivation base, and bring her that much closer to the Immortal Realm.” Eventually, he pulled his finger back, whereupon a tremor ran through Chu Yuyan. Her eyes opened slowly, and she looked blankly at Meng Hao. Then, her eyes went wide for a moment before she closed them again, as if she were thinking.</p><br/><p>After a few breaths of time passed, she opened her eyes again, and they were clear and bright.</p><br/><p>She seemed extremely calm, although her voice was a bit weak as she said, “Was it you that saved me? Thank you. What is this place?”</p><br/><p>When he saw the expression on her face, he was silent for a moment before saying: “It was my fault you got dragged into this.... We’re in the Nine Seas God World.”</p><br/><p>Then he proceeded to explain everything that had happened.</p><br/><p>Chu Yuyan didn't speak. She merely listened quietly. From the look of it, she was in a very fragile state, and would only be able to stay awake for a short period of time.</p><br/><p>After hearing the story, she smiled slightly, as if she had forgotten about everything that had occurred between the two of them in the past, and now thought of them as merely friends. She gave a nod of understanding, doing nothing to reveal what she might actually be thinking.</p><br/><p>“I never imagined that after all these years, we would meet again like this.”</p><br/><p>Were it not for the words she had muttered back on Seajacket Island, Meng Hao would have had a hard time detecting that she was acting strangely. Now that he was looking for it, it was plain to see that she was putting on an act. Furthermore, within her slight smile could be seen a trace of both disappointment and pride.</p><br/><p>Back on Planet South Heaven, she had made a decision. <em>You have your glory, and I... I have my pride.</em></p><br/><p>“It doesn't matter how it all happened,” she said. “Thank you. I will remember the kindness you've shown. Maybe I won’t ever be able to pay you back, but I won't forget.” She struggled to her feet, then gave Meng Hao a curtsying bow.</p><br/><p>Seeing Chu Yuyan act so politely toward him caused Meng Hao to sit there in quiet reticence.</p><br/><p>“I've recovered,” she said softly, “so... I’ll take my leave now. You... take care of yourself.” Supporting herself by leaning against the wall of the cave, she made to leave, but was too weak. After only a few steps, she staggered, face pale, and began to fall over.</p><br/><p>Sighing, Meng Hao reached out to steady her.</p><br/><p>Biting her bottom lip, Chu Yuyan smiled and said, “Well don’t I look silly. I can walk, Meng Hao. Thank you.”</p><br/><p>Brushing away his hand, she took a few steps forward, but then her body weakened, and she toppled over. Her forehead smacked into the stone wall, and because of the weakness of her body, and her lack of any of the protection of her cultivation base, it gashed her skin and blood began to flow.</p><br/><p>She gaped in astonishment, and tears welled up in her eyes. She struggled to rise back to her feet, but couldn’t. Meng Hao stepped forward to help her.</p><br/><p>“Thank you, but I can do it myself,” she said with a weak smile.</p><br/><p>“Chu Yuyan!” Meng Hao growled, reaching down and helping her up.</p><br/><p>-----</p><br/><p><strong>Note from Lord Fifth:</strong> Look, bitches, Lord Fifth is too busy training these idiots to spend much time thinking of a band name. So, he colluded with Deathblade to have an impromptu contest. Leave your idea for a band name in the comments below. The winner will receive backstage passes to our debut performance! Well, what are you waiting for!? Are you as stupid as Lord Third? Come on, think of some good names!</p><br/>\n</div>"}