{"title": "Chapter 1089: Whos Fighting and Whos Watching?", "id": 1089, "volume": 11, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-1089-whos-fighting-and-whos-watching", "volume_title": "Volume 11", "body": "<h1>Chapter 1089: Whos Fighting and Whos Watching?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 1089: Who’s Fighting and Who’s Watching?</strong></p><br/><p>Meng Hao was in the middle of it all, fighting fiercely whoever he encountered.</p><br/><p>The viciousness on display caused Jian Daozi and the others to go cold with fright. Jian Daozi himself gasped and stared at Meng Hao with renewed fear and awe.</p><br/><p>Because of a unique reason, Jian Daozi had lived for a very long time, and seen many Immortals. Although his cultivation base was not very high, he was intelligent and discerning, and could tell that Meng Hao possessed strength that the other Immortals simply did not.</p><br/><p>“He must be in the Immortal World's feared... Echelon!” he thought, his eyes widening.</p><br/><p>Blood flowed off of the altar in bright red rivulets, even streams, which spread out into the desert sands. The reek of blood spread out, filling the air, even covering some of the magical symbols on the altar, causing them to cast bizarre light into the air.</p><br/><p>Fewer and fewer people could be seen on the altar. Originally, there had been more than twenty, but now, there were only eleven!</p><br/><p>Fan Dong’er and Bei Yu were still there, but the other cultivators who had originally joined them had all been replaced, with the exception of the burly body cultivator, who managed to cunningly avoid all attacks levied against him.</p><br/><p>Fan Dong’er was no longer flanked by three people, but two. They were both young, their faces pale white, with blood seeping out of the corners of their mouths. Pools of blood could be seen beneath their feet.</p><br/><p>Originally, Bei Yu had been accompanied by two other Demonic cultivators. Now, there were five. Two were old women, plus three other Demonic cultivators. Those who had brought them here had been killed by other cultivators, and these were the ones who had managed to hold out until the very end.</p><br/><p>However, thunder still boomed, and as for the number of people present... there were still two too many!</p><br/><p>Among the eleven people present, eight had red sealing marks on the backs of their hands. Those who didn’t included one ordinary cultivator and two Demonic cultivators. All of them had ashen faces, and absolutely no sealing marks!</p><br/><p>Those sealing marks were like a seal of life, a mark of approval from the Windswept Realm. Anyone who had that sealing mark would not be wiped away by the Heavenly thunder.</p><br/><p>Blood flowed across the altar as everyone stood there silently, staring at Meng Hao. Fear could be seen deep in their eyes; in the battle just now, more than half of the people slain had been killed by him.</p><br/><p>Down below the altar, Jian Daozi and the others were shocked to the core. The image of Meng Hao slaughtering his enemies was burned deep in their hearts, leaving an indelible impression.</p><br/><p>After a few short breaths of time, fighting broke out once again; virtually everyone attacked at the same time, trying to wipe out the three cultivators with no marks on their hands.</p><br/><p>Those three knew that if they couldn't get one of the sealing marks, they would be wiped out by the thunder, completely eradicated!</p><br/><p>Thunder boomed, and blood sprayed out of the three cultivators’ mouths. There was no need to mention the severe internal injuries they had sustained; they were growing so weak that it seemed any of the subsequent thunderclaps could wipe them out. They began to go mad, roaring, burning life force, exploding with all the power they could muster.</p><br/><p>It was with utter madness that they attacked the fellow sect members who they thought they could defeat!</p><br/><p>Booms echoed out as the fierce fighting raged. The cultivators of the Windswept Realm continued to keep their heads bowed, not daring to even peep at what was happening, although Jian Daozi and his group looked on.</p><br/><p>Meng Hao waved his hand, and the Essence of Divine Flame erupted out. He pushed his hand down onto the shoulder of one of the Demonic cultivators with no sealing mark, and instantly, the man was consumed by Divine Flame. A miserable shriek could be heard as Meng Hao pulled his hand back, and the Demonic cultivator transformed into nothing but ash.</p><br/><p>Simultaneously, the other two with no sealing marks were killed, reducing the number of people on the altar... to only eight!</p><br/><p>In addition to Meng Hao, there were two ordinary cultivators and five Demonic cultivators, all of whom had marks on their hands!</p><br/><p>All of them breathed sighs of relief.</p><br/><p>“It's finally over....”</p><br/><p>“I can’t believe the natural laws in the Windswept Realm have changed....”</p><br/><p>Even Jian Daozi and the others below the altar assumed that everything was over. However... thunder continued to boom! Everyone's faces fell, but no one coughed up blood. However, the fact that the thunder had not ceased indicated only one thing.</p><br/><p>There was still someone without a sealing mark! Furthermore, that person was not present on the altar itself!</p><br/><p>“Impossible! We’re obviously the only ones left! Why is there still Heavenly thunder!?!?”</p><br/><p>“Someone must still be hiding people in their bag of holding!!” Everyone began to look around suspiciously. Fan Dong’er gritted her teeth as she realized that there were more Demonic cultivators than ordinary cultivators, which was not to her advantage. After a moment of hesitation, she opened her bag of holding and let everyone see that it was empty of people.</p><br/><p>The other cultivators behind her didn’t hesitate to do the same, and eventually, even the Demonic cultivators, including Bei Yu, did the same. Eventually, Meng Hao was the only one who hadn’t opened his bag of holding.</p><br/><p>At that point, all eyes fell on Meng Hao.</p><br/><p>“Meng Hao already got one of the other sealing marks and put it in his bag of holding!” Thunder boomed, and everyone looked at Meng Hao with vigilant eyes.</p><br/><p>Meng Hao was the most powerful among them, a fact which had been made very clear in the fighting moments ago. At this moment, Meng Hao... was the greatest threat to all of them.</p><br/><p>Another clap of thunder could be heard, but this time, it wasn’t just a noise. A bolt of lightning fell from the sky, slamming onto the altar with incredible destructive power. The entire altar shook, and Meng Hao dodged to the side to avoid being hit.</p><br/><p>“Meng Hao, what are you doing!? Open up your bag of holding and kill that person!”</p><br/><p>“If you don’t do something, then don't blame us for joining forces to kill you!” Everyone was shocked by the booming thunder, and the bolt of lightning that had fallen. From their perspective, if Meng Hao didn't open his bag of holding and kill the person inside, then all of them would end up dead.</p><br/><p>Meng Hao's eyes widened. Currently, Su Yan was inside his bag of holding, trembling. Her fear was a bit surprising to Meng Hao; originally, she had been completely unafraid of dying. Now, however, she seemed terrified of it, a total change that couldn't help but cause a bit of suspicion to well up in his heart.</p><br/><p>“Could it be that she has some sort of reincarnation magic, so that if I kill her, she’ll be able to resurrect herself, but if she’s killed by the thunder of the World Essence, she’ll actually die?!” Meng Hao’s eyes flashed, and then he thought about Su Yan’s other unique divine abilities, and realized that such a thing wasn’t impossible.</p><br/><p>As he stood there thinking, the other people on the altar were increasingly shocked by the thunder and lightning.</p><br/><p>“Let’s join forces! Even if we can’t kill him ourselves, we can at least force him off the altar. Then the thunder will help us kill that person in his bag of holding!”</p><br/><p>People began to call out: “Attack together!”</p><br/><p>The Demonic cultivators already hated Meng Hao, so they immediately joined together and attacked Meng Hao.</p><br/><p>At the same time, even Fan Dong’er and the other ordinary cultivators joined together to charge Meng Hao. Meng Hao's actions now affected all of their lives, so how could they not take action?</p><br/><p>Meng Hao’s eyes glittered. Instead of attacking, he fell back, buying time to send divine will into his bag of holding to yell into Su Yan's ear.</p><br/><p>“Give me one of your divine abilities, and I’ll get you a spot in the Windswept Realm!” He was determined to give this tactic a shot.</p><br/><p>Su Yan’s face fell. Blood sprayed out of her mouth, and her expression was one of unprecedented fear. She could sense the deadly attacks from the outside, but she still wasn’t willing to give one of her divine abilities to Meng Hao.</p><br/><p>“I’ll die first!” she responded.</p><br/><p>“I don't want all of them, just one will do! You have to give me some reason to help you avoid being wiped out by the Windswept Realm!” Meng Hao continued to back up as everyone attacked him. He danced back and forth, expression calm as he used divine will to try to persuade Su Yan.</p><br/><p>Thunder struck again, and it was even more intense than last time. Two bolts of lightning fell, causing everyone's minds to reel. Meng Hao’s face fell, and the sensation of deadly crisis grew stronger. It was as if... the next volley of lightning would definitely hit him.</p><br/><p>Meng Hao’s eyes glittered. The best option right now would be to simply kill Su Yan, which would cause the lightning to dissipate. If he pushed things too much further, he would be putting himself at grave risk.</p><br/><p>“Chances like this aren’t easy to come by... it would be a big shame to give up now.” His eyes flashed as he once again sensed Su Yan’s fear of the thunder and lightning.</p><br/><p>Gritting his teeth, he fell back again, and once again sent out some divine will.</p><br/><p>Su Yan could sense the will of death in the lightning, and it caused her to tremble. She didn't fear Meng Hao killing her, but she definitely feared being eradicated by the lightning!</p><br/><p>The sensation of imminent death grew more intense, and she could tell that another round of thunder and lightning was coming.</p><br/><p>“If I die, you’ll die too!!” she cried. In response, Meng Hao slapped his bag of holding and pulled Su Yan out. Thunder boomed, and seven bolts of lightning coalesced up above; at the same time, he made as if to throw her out in front of him,</p><br/><p>“I’ll only give you one divine ability!!” Su Yan shrieked as she looked at the lightning; she couldn't hold on any longer.</p><br/><p>“Fine! I want your Seven God Steps!” Meng Hao’s eyes glittered, and he pushed his divine will toward her. Su Yan knew that she didn't have much time. Although it irked her, she had no other choice, and so she allowed his divine will to enter her mind and take the Seven God Steps Daoist magic. [1. Su Yan used the Seven God Steps (although with a slightly different name) against Meng Hao in chapter 1032]</p><br/><p>In the moment that Meng Hao acquired the Daoist magic, the seven bolts of lightning began to fall. Suddenly, Meng Hao spun, and the Lightning Cauldron appeared in his hand. Electricity danced, and he switched places with one of the old Demonic cultivator women. As soon as he reappeared, next to one of the other Demonic cultivators, he unleashed the Life-Extermination Fist.</p><br/><p>He moved so quickly that nobody had time to react. In the blink of an eye, thunder boomed, and the Demonic cultivator exploded into a cloud of blood and gore.</p><br/><p>As soon as the Demonic cultivator died, the mark on his hand vanished, transforming into a red qi that then solidified on Su Yan’s hand.</p><br/><p>In that same instant, the seven bolts of lightning vanished without a trace, and the thunder faded away.</p><br/><p>There were now only eight people on the altar again, one less Demonic cultivator, and an additional trembling Su Yan.</p><br/><p>If you added in Chu Yuyan, who was still in his bag of holding, that made a total of nine cultivators!</p><br/><p>All of them had marks on their hands, indicating that they qualified to remain in the Windswept Realm!</p><br/><p>As of this moment, the fighting stopped. No one continued to attack Meng Hao. They all backed up, looking around vigilantly, quietly, expressions of sorrow on their faces.</p><br/><p>As they looked down at the ten thousand cultivators below the altar, and the tens of thousands of other humans arranged further off, Fan Dong’er and the others suddenly didn’t feel at all like superiors. Instead, they felt like cage fighters, with the people surrounding them being the audience, despite the fact that they didn't even lift their heads to look.</p><br/><p>The superiors were the show, and the inferiors were the audience. Therefore, just exactly... who were the superiors?</p><br/>\n</div>"}