{"title": "Chapter 1091: The Scheming of Jian Daozi", "id": 1091, "volume": 11, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-1091-the-scheming-of-jian-daozi", "volume_title": "Volume 11", "body": "<h1>Chapter 1091: The Scheming of Jian Daozi</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 1091: The Scheming of Jian Daozi</strong></p><br/><p>The world rumbled, colors flashed in the sky, and the wind screamed.... At the same time, the Echelon members in each of the Nine Nations sent their energy surging, something... that no one but they themselves could sense.</p><br/><p>However, everyone on the altars in the various Nine Nations were clearly able to tell that the air of war had filled the world!</p><br/><p>Declarations had been made, indicating that the Echelon battles were beginning!</p><br/><p>This place... was the long-awaited battlefield for the Echelon. Everyone else would be relegated to mere supporting roles!</p><br/><p>Although nobody wanted to admit it, Fan Dong’er, Bei Yu and the other cultivators knew so. They stood there silently, looking at Meng Hao standing at the edge of the altar, radiating an unmatchable energy as he looked around at the people prostrating themselves down below.</p><br/><p>All of a sudden they understood that this place... belonged to the Echelon!</p><br/><p>If the options were to be either a bright flower or a dark, faded leaf, fate had given them no choice in the matter, and had relegated them all to be nothing more than leaves....</p><br/><p>Fan Dong’er’s eyes glittered with an unyielding light. Bei Yu had a similar reaction. She was a woman with the same position as the sect's Holy Daughter. She had high aspirations, and was not willing to be left in the dust by anyone.</p><br/><p>After a while, the surging energy that were the declarations of war by the members of the Echelon located throughout the Windswept Realm... slowly faded away. Meng Hao flicked his sleeve and stepped off of the altar.</p><br/><p>“Raise your heads, all of you!” he said immediately. His voice echoed out across the lands into the ears of all of the cultivators of the Windswept Realm, and into the minds of the tens of thousands of mortals off in the distance.</p><br/><p>Without even thinking about it, everyone raised their heads and looked at him. As of this moment, all eyes were focused on Meng Hao. He hovered there in midair, his robes swirling, his hair floating around him. The will of an Immortal Emperor transformed into a unique aura.</p><br/><p>It was an indescribable aura, but at the moment, it instilled everyone with the impulse to offer worship.</p><br/><p>“Greetings, Grand Immortal!” A chorus of voices echoed out across the lands. As the powerful sound rolled out, Jian Daozi flew up into the air, swishing his sleeve and causing brilliant light to surround him.</p><br/><p>“Form the Grand Carriage!” Immediately, a thousand cultivators flew out from the group below and organized into a formation that resembled a flying battleship!</p><br/><p>They were followed by another eight thousand cultivators, who also formed flying battleships, making a total of nine. It was possible to see cultivators all packed together to form the battleships, their expressions fanatical, as if serving Immortals was an unmatchable honor.</p><br/><p>Each battleship also featured two groups of cultivators on the deck, organized in ranks, men and women. Of the male cultivators, each one was extremely handsome, the type that any woman in the mortal world would instantly fall in love with.</p><br/><p>The female cultivators were incredibly beautiful and pure, and each one could be considered a consummate beauty.</p><br/><p>All of them knelt there, apparently ready to fulfill any request without the slightest hesitation.</p><br/><p>“Grand Immortals, please, after you!” cried Jian Daozi, dropping to his knees.</p><br/><p>“Grand Immortals, please, after you!” the other old men cried, along with all the other cultivators.</p><br/><p>Meng Hao stared in shock. Although he had enjoyed the feeling of being completely unrestrained in the Windswept Realm, he was still not used to situations like this.</p><br/><p>Using people as a ship...?</p><br/><p>“Jian Daozi, you lead the way. As for this ship... I don’t need it,” he said slowly, beginning to make his way forward. Jian Daozi stared in shock, and an almost imperceptible flicker passed by deep in his eyes. He looked at Meng Hao for a moment, then, without saying anything, flew to follow by his side.</p><br/><p>The fact that Meng Hao refused to use the ship didn't mean that the other cultivators had to refuse. In fact, the Demonic cultivators were currently staring in shock. Since they had been smuggled in, they hadn’t experienced the events from the initial entry. They transformed into beams of light which instantly flew over to the various ships formed from cultivators.</p><br/><p>When they stepped onto the ships, they were immediately surrounded by the handsome men and beautiful women, who brought delicious alcohol and spirit fruits for them to enjoy. It was an indescribable feeling.</p><br/><p>The young cultivator behind Fan Dong’er thought for a moment, then flew over to sit on one of the ships. Immediately, one of the beautiful servants stepped forward and bowed down in front of him.</p><br/><p>The young man took a deep breath as he looked around blankly at the ship and everything else.</p><br/><p>Eventually, even Fan Dong’er and Bei Yu boarded the ships under the fanatical gazes of the Windswept Realm cultivators. Rumbling sounds could be heard as the ships then flew up into the air.</p><br/><p>Down below, the man who appeared to be the emperor of the Ninth Nation led the soldiers into motion. They moved slowly, but there were many of them, and they almost looked like Imperial escorts.</p><br/><p>Meng Hao flew along at the front, silent and taciturn. Jian Daozi followed off to the side. The old man’s cultivation base was not in the Immortal Realm, so it took some effort for him to keep up with Meng Hao. Meng Hao looked over at him and waved his hand, causing a bright light to appear beneath the old man’s feet, which instantly increased his speed so that he could follow along closely.</p><br/><p>“Many thanks, Grand Immortal!” Jian Daozi said, clasping his hands in appreciation.</p><br/><p>“You can stop it with the false show of respect,” Meng Hao said slowly. “It pisses me off. Furthermore... I'm Meng Hao. My surname is not ‘Grand’ and my given name is not ‘Immortal.’” He spoke the words without the slightest bit of courtesy.</p><br/><p>A strange expression appeared on the old man’s face. He clasped his hands and respectfully said, “I shall comply with your orders, Exalted Immortal.”</p><br/><p>Meng Hao proceeded to ignore him. Perhaps because of how they were raised, all of the others from the Mountain and Sea Realm were probably not used to paying close attention to the people they deemed weaker, but Meng Hao, despite having such a high status, and even being the Crown Prince of the Fang Clan, had struggled up to that point from a weak and pitiful standing on Planet South Heaven. He had experienced numerous deadly circumstances, and had eventually developed extremely keen eyes. Therefore, he was easily able to detect that Jian Daozi had been scheming all along.</p><br/><p>He could clearly see the various things the old man had done. He had never believed that the people of this world would willingly choose to be inferiors. In fact... the people of the Windswept Realm couldn’t even be called inferiors; they were more like slaves who didn't even have control over their own lives or deaths. Their fate was completely under the control of the Mountain and Sea Realm.</p><br/><p>The entire world was destined to flow with rivers of blood every thousand years, and the inhabitants were like nothing more than crops to be harvested. Their thousand years of rest was merely preparation... for another harvest!</p><br/><p>“The natural laws did not change by chance!” thought Meng Hao, his eyes glittering. He would not be careless in his activities here. Furthermore, he knew many details of certain matters that Fan Dong’er and the others were unaware of.</p><br/><p>“Exalted Immortal Meng,” Jian Daozi said ingratiatingly, “Mount Whiteseal is the Ninth Nation's Mountain of National Aura, the source of our nation’s natural law and Daoist magic. It supports our entire world, and even has Heavenly power!</p><br/><p>“Exalted Immortal, by selecting that mountain, you can receive the added support of the National Aura, and will definitely experience cultivation base growth to a level that you can’t even imagine.</p><br/><p>“The legends say that the National Aura Mountain was refined from a precious treasure. Perhaps with the abilities and resources at hand as a Chosen, Exalted Immortal Meng, you will be able to acquire even greater good fortune.” The wind buffeted their faces as they flew onward, and Jian Daozi's words were carried backward so that Fan Dong’er and the others could hear.</p><br/><p>Meng Hao suddenly stopped in place, turned, and looked deeply into Jian Daozi’s eyes. Then, an enigmatic smile appeared on his face, and his eyes gradually shone with an intense gleam.</p><br/><p>The look in Meng Hao's eyes caused thumping sounds to pound inside of Jian Daozi. However, he maintained the same smile as ever, and ducked his head respectfully.</p><br/><p>“You know,” Meng Hao said coolly. “I’ve killed a lot of people. Many of them were schemers, and when I discovered their plots against me, I removed their heads.</p><br/><p>“For example, you used a simple map to quickly divide nine Exalted Immortals without lifting a finger. You benefited from the misfortune of others, and also gained some profound insights. Truly an excellent scheme.</p><br/><p>“Later, when the lightning and thunder struck us, you looked surprised, but deep in your eyes, you were actually mocking us. Don’t think that nobody noticed your act. How did you come to be aware that the natural laws had changed?”</p><br/><p>With each of Meng Hao’s successive statements, Jian Daozi looked more surprised. He started to look anxious, as if he felt there were some misunderstanding. Terrified, he was about to offer an explanation when Meng Hao continued.</p><br/><p>“One map unleashed internal chaos,” he said coolly. “One natural law caused a deadly crisis.</p><br/><p>“I honestly don’t care much about those things. However, just now, you tried to use that mountain to gain the upper hand again. Did you really think that you could borrow the strength of my hands to slay the others, just because I was stronger than them?” His words caused Jian Daozi’s face to grow deathly pale, and he began to tremble in terror.</p><br/><p>“Exalted Immortal, please calm yourself. Everything was just a misunderstanding! It... it wasn’t like that at all! I....” Sweat poured down Jian Daozi’s face, and he seemed horrified, as if he were being wrongly accused of a crime he didn't commit.</p><br/><p>“Let me guess,” continued Meng Hao, his voice growing colder by the moment. “If I were you, I wouldn’t devise a plan which relied on only one person, even if you did end up convincing me about the mountain. After all, none of them would be likely to try to provoke me directly. What you want to do is throw out some other seeds to attract their interest.</p><br/><p>“Those seeds of interest... will eventually give birth to a struggle over the mountain.</p><br/><p>“Their obsession over the mountain is like a hidden weapon that would not be easily noticed. In addition to all of that, if I were you, I would definitely prepare some other knives to stick into the backs of us Immortals. That would also provide a warning that... we should not act presumptuously here!! My guess is that one of those knives will be making an appearance quite soon.”</p><br/><p>Jian Daozi smiled wryly, as if he had valid protestations which were merely falling on deaf ears. He seemed to be on the verge of trying to concoct some explanation when, all of a sudden, something became visible off in the distance. There, a waterfall could be seen, at the base of which was a pond. Next to that pond sat a white fox.</p><br/><p>A piece of white jade could be seen on the fox's head, which looked completely beyond ordinary. As the fox practiced breathing techniques, it caused all of the light in the area to converge on the fox’s head.</p><br/><p>Suddenly, one of the middle-aged Demonic cultivators from the Nine Seas God World caught sight of the white fox. His eyes went wide, and he shouted, “Divine Demon jade!!”</p><br/><p>A look of greed and wild joy instantly appeared on the Demonic cultivator’s face. There was a flash as he flew off of the ship he had been riding and headed directly toward the fox.</p><br/><p>“If I were you, I wouldn’t do that,” Meng Hao said, stopping in place. In response, Jian Daozi’s face flickered. The middle-aged Demonic cultivator stared in shock for a moment, then gave a cold harrumph.</p><br/><p>He was well aware of what kind of place the Windswept Realm was, that there was nothing here that exceeded the Immortal Realm. It was a place without laws or rules, and therefore, nobody could stop him from taking something he wanted!</p><br/><p>He sent out his divine sense and, sensing nothing abnormal, completely ignored Meng Hao and closed in on the white fox, reaching his hand out to grab to the piece of white jade.</p><br/>\n</div>"}