{"title": "Chapter 1093: His Name Shakes the Echelon!", "id": 1093, "volume": 11, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-1093-his-name-shakes-the-echelon", "volume_title": "Volume 11", "body": "<h1>Chapter 1093: His Name Shakes the Echelon!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 1093: His Name Shakes the Echelon!</strong></p><br/><p>Atop the snow-capped mountain peak, a frigid wind blew snowflakes onto Meng Hao’s head. They quickly melted, taking with them some of the warmth inside of him. The resulting sensation was one of icy coldness.</p><br/><p>The coldness caused Meng Hao’s somewhat blank eyes to suddenly clear. As he regained his senses, the incredible transformations to the lands of the Ninth Nation ceased.</p><br/><p>“The world has invisible natural laws….” he murmured.</p><br/><p>“On top of natural law is the omnipresent power of Essence.... Understanding something’s intrinsic qualities, and seeing its true origin, knowing EVERYTHING about it... that is its Essence.” Although his journey from the bottom of the mountain to the top had seemed to go quickly, it truth, it had taken quite a bit of time.</p><br/><p>That contradiction actually led him to significant enlightenment regarding Mount Whiteseal and the Ninth Nation. However, he still felt as if there were some areas he hadn't been able to probe. There was something about this mountain, this nation, and even this Realm, that was... incongruous.</p><br/><p>It was as if there was a power of rejection, a power that, despite Meng Hao’s observations of natural laws and Essence during his trip up the mountain, ensured that his understanding was merely superficial. Now that he thought back, he realized that there was nothing profound or important imprinted in his heart.</p><br/><p>After a moment of thought, he looked around at the snowflakes covering his field of vision and drifting down onto his body.</p><br/><p>The ground was covered with a thick layer of snow that quickly captured any snowflakes which landed on it. They lost any ability to dance or flutter, no matter how much the wind blew to pick them up.</p><br/><p>However, no matter how much his vision was obscured by the snowflakes, he could still see that up ahead of him was... a statue.</p><br/><p>It was a statue surrounded by swirling snow. It depicted a man, apparently middle-aged, with a slight smile on his face. He didn’t seem powerful or solemn, but a sharp gleam could be seen in his eyes that appeared to be an admonishing expression. Anyone who caught sight of the statue would be inwardly shaken.</p><br/><p>It was the kind of feeling a mortal would experience upon facing a wild beast.</p><br/><p>It was as if this person’s wrath could cause Heaven and Earth to crumble, could shake the world, could cause all living things to bow in worship. Meng Hao took a deep breath as he looked at the statue; it almost seemed to be looking back at him.</p><br/><p>That simple gaze caused his mind to reel, sent his cultivation base into chaos, and caused his qi and blood to seethe. He coughed up a mouthful of blood and staggered backward several paces, his face flickering.</p><br/><p>“Just what Realm was this person in?” the thought. “It’s only a statue, so it could only have a tiny percentage of the true self’s power, and yet its divine will is shocking!</p><br/><p>“Wait a second, that’s not right. This feeling... is so familiar!” His eyes flashed as he looked up at the statue, and then a strange expression appeared in his eyes.</p><br/><p>“I was called here by this statue....</p><br/><p>“Furthermore, the power that injured me didn't come from the statue, but rather... the entire Ninth Nation!” His eyes glittered as he turned to look out at the entire Ninth Nation.</p><br/><p>“That was... the power of the National Fate. The reason it feels so familiar is because this place is the same as the Tower of Tang!! Or perhaps it would be better to say that the power of the Ninth Nation’s qi flow, when combined, allows this statue to radiate astonishing pressure!</p><br/><p>“The Windswept Realm has nine nations, and each one... has a bit more than ten percent of the qi flow of the Windswept Realm!</p><br/><p>“The reason I experienced that sensation of rejection is because... I’m not an entity of the Windswept Realm!</p><br/><p>“Well, now that I'm here, there should be some method to get rid of the power of rejection, and attain the approval of the National Aura!” Meng Hao looked back at the statue, and his eyes came to focus on an almost undetectable mark on the back of its hand.</p><br/><p>Without careful examination, it would be virtually impossible to clearly make out the mark. Meng Hao’s eyes shone with determination as he formed his divine sense into a magical technique and shot it out toward the mark. However, the mark seemed impossible to break open, as if some type of seal were in place that would require several hours to break through. Meng Hao pondered silently, then suddenly performed an incantation gesture with his right hand and unleashed the Fifth Demon Sealing Hex.</p><br/><p>By now, he was very familiar with the Fifth Hex, and had been able to detect that it was useful when dealing with seals. Reverse inside and outside. Consume and spit out. It could unbind all sorts of seals!</p><br/><p>As Meng Hao unleashed the Hexing magic, Jian Daozi and the others at the foot of the mountain looked on with fixed gazes. Jian Daozi sighed inwardly, and an imperceptible flicker ran through his eyes. Although he was incapable of making any further cultivation base breakthroughs in this lifetime, he had been able to utilize a secret magic to extend his longevity for many, many years.</p><br/><p>In fact, he had lived for so long that he had long since forgotten exactly how old he was. Furthermore, he would never be able to forget how Immortals trampled the inhabitants of the Windswept Realm beneath their feet, humiliating them. He would never be able to forget how it felt to be treated like a slave.</p><br/><p>“Perhaps if I hadn’t met THAT person... then I wouldn’t have such feelings,” he thought. “After all, the Windswept Realm is one of the Lower Realms of the Immortal World, and is a slave world.” He bowed his head to cover the hatred and venom that flickered in his eyes.</p><br/><p>Soon, vigilance took over, and he looked up. All such previous looks had disappeared from his eyes, which were now filled with what appeared to be mindless veneration for Immortals.</p><br/><p>Actually, of the countless Immortals that he had encountered, none had given him the same feeling as Meng Hao. His vigilance intensified.</p><br/><p>“His cultivation base is profound, he is extremely cunning, and he attacks with utter ruthlessness. He... is not the type of person to be dealt with easily. However, he will most likely fall into a trance here. And even if that doesn’t happen... it doesn’t matter how strong he is, it won't be long before the Windswept Realm’s patience will be at an end, and it will completely explode!” Jian Daozi took a deep breath, and a brilliant light flashed in his eyes before they once again returned to their previous state. He slid his hands into their opposite sleeves, then stooped over low, making himself look inconspicuous and innocuous.</p><br/><p>“There is no member of the Echelon who will understand the statue of the Imperial Lord at a single glance. Even though some of the people who come here are aware of its secrets, and each time they come the duration grows shorter, in the end, the fastest one will take at least six hours. This Meng Hao might be incredibly intelligent, with extraordinary enlightenment, but even he would need more time....” Inwardly, he was laughing coldly as he looked up at Meng Hao on top of the mountain. Then, his face suddenly flickered, and his eyes went wide with disbelief.</p><br/><p>It wasn’t just him. The old men behind him were staring with wide eyes, and panting.</p><br/><p>In the moment that Meng Hao unleashed his Hexing magic on the sealing mark, he got the sensation that he was opening a door. His mind trembled, and the world shook. Countless natural laws exploded out of that door, as well as numerous Essences. They swept about, burying him, transforming into a tempest that raged in all directions.</p><br/><p>The previously calm Ninth Nation was once again struck with incredible transformations. Mountain ranges rose and rivers changed their course. The incredible transformations caused an indescribable feeling to float up in the minds and hearts of all living creatures in the Ninth Nation.</p><br/><p>Meng Hao’s breath came in ragged pants as the tempest swirled around him. Numerous natural laws and Essences could be seen, but soon, his eyes glittered as he realized that many of them were duplicates. The glow of augury could be seen, and soon Meng Hao was able to determine... that there were only three thousand!</p><br/><p>Among those three thousand, the number that weren’t duplicates consisted of only... three hundred!</p><br/><p>His eyes flickered as the tempest suddenly slowed down and began to converge in front of him in the form of a flame.</p><br/><p>The flame danced down into the statue’s hand, as if it were a lamp, a lamp held by the statue!</p><br/><p>The dancing flame cast strange light onto the statue, and when that light touched Meng Hao, he suddenly felt the power of rejection fading significantly.</p><br/><p>He gazed at the flame, within which could be seen three hundred natural laws and Essences. Unfortunately, they weren’t complete, although that was the very reason that Meng Hao was able to sense them at all.</p><br/><p>When he caught sight of those three hundred Essences, a voice suddenly boomed out like thunder in his mind.</p><br/><p>“Three thousand Daos. Three thousand Realms. Nine Windswept Nations. Nine Nations with three hundred Daos each. They form the World Seal.... The final three hundred Daos are located in the central temple!</p><br/><p>“Foreigners, the more great Daos you come to understand, the more enlightenment you receive, and the sooner the day shall come in which you achieve your Dao!”</p><br/><p>The voice was profound, but Meng Hao had no time to think about it; the flame in the statue’s hand suddenly caused him to sense... vibrations coming from his Nirvana Fruit.</p><br/><p>Those vibrations were that of desire. Meng Hao suddenly had the powerful sense that... if he could gain enlightenment regarding those three hundred Essences, then he should be able to fully fuse with his second Nirvana Fruit!</p><br/><p>In that same moment, a beam of light exploded out from the Windswept Realm’s central temple. It shot screaming through the air, causing all cultivators in the world to stare at it with wide eyes.</p><br/><p>It caused boundless ripples to spread out, filling the sky of the Windswept Realm, enabling everyone to see several illusory mountains, all of which had huge statues on them.</p><br/><p>Apparently, this illusory world on display... representing unparalleled heights of glory!</p><br/><p>Suddenly, one of the statues collapsed, sending a huge boom out in all directions. Even as it collapsed, it reformed, transforming into a new statue, a statue... of Meng Hao!</p><br/><p>An austere voice echoed out into all minds, filling all hearts: “Meng Hao of the Ninth Nation has exceeded the previous record holder. He has materialized a statue of himself, and shall be rewarded with the qi flow of the Ninth Nation!”</p><br/><p>“Impossible!” thought Jian Daozi, shaking. Behind him, the other old men stared with wide eyes.</p><br/><p>As of this moment, the qi flow of the Ninth Nation seemed to fully accept Meng Hao. As it swirled around him, the power of rejection vanished completely. Panting, Meng Hao looked up into the sky.</p><br/><p>At the same time, the other cultivators and Echelon members in the other nations were completely shaken.</p><br/><p>In the Fourth Nation stood a handsome young man, who currently had a strange look in his eyes. Balling his hands into fists, he growled, “Meng Hao. Why does his name seem so familiar?”</p><br/><p>In the First Nation, the incomparably proud number one member of the Echelon stood in front of a similar statue, which was also shining brightly. A ball of flame could also be seen in that statue's hand. Clearly... he had gained enlightenment mere moments after Meng Hao had.</p><br/><p>After looking shocked for a moment, he said, “Faster than me... interesting. Well, even if he was notified about some of the secrets of this place, the enlightenment here can only be acquired by experiencing it over time.”</p><br/><p>A profound gleam appeared in his eyes, and he began to laugh. “I think this time I’ll be able to add another precious item to my collection. Meng Hao of the Ninth Nation. He’s from the Ninth Mountain and Sea, right? So, he must be the guy Xue’er is looking for?”</p><br/><p>In the Eighth Nation was a young man surrounded by swirling bones. He suddenly looked in the direction of the Ninth Nation. “Meng Hao.... His surname is Meng!”</p><br/><p>Other members of the Echelon were all similarly shocked, and for the first time, Meng Hao’s name was imprinted into their hearts. They were all members of the Echelon, and were Chosen among Chosen. How could they easily back down from a challenge!?</p><br/><p>The desire to fight rose up intensely in their hearts, inadvertently stirred up by Meng Hao.</p><br/>\n</div>"}