{"title": "Chapter 1100: Fate!", "id": 1100, "volume": 11, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-1100-fate", "volume_title": "Volume 11", "body": "<h1>Chapter 1100: Fate!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 1100: Fate!</strong></p><br/><p>Meng Hao had sown Karma with the other Echelon cultivators using A Writ of Karma when he was the first person to break through the previous record atop Mount Whiteseal. At that time, his name was spoken throughout the Windswept Realm, everyone came to know him, and invisible connections of Karma were created.</p><br/><p>Using Karma in such a way was completely domineering. In fact, before Meng Hao created A Writ of Karma, nothing like it had ever existed.</p><br/><p>Based on the enlightenment he had experienced at that time, and his own personality and requirements, he had created a completely unique and domineering Daoist magic, something that could forcefully create ties of destiny.</p><br/><p>It was impossible to evade or resist. Furthermore, as long as Karma had been sown, it would definitely be reaped!</p><br/><p>Even as he fled, Han Qinglei felt a tremor run through him. All of a sudden, he felt as if his fate was being adjusted. The abrupt sensation caused his heart to begin to thump.</p><br/><p>He wasn’t sure why, but he suddenly couldn’t think about anything except Meng Hao. Meng Hao’s name seemed to fill his mind, almost like a curse weighing over him.</p><br/><p>“What’s going on!?!? I owe him money?!” Han Qinglei’s face fell, and he wanted to struggle, but found that he couldn’t. To his terror, his mind and heart were filled with Meng Hao. Most horrifying of all were the words that were echoing out like thunder in his mind.</p><br/><p><em>You owe me money.</em></p><br/><p><em>You owe me money!</em></p><br/><p><em>YOU OWE ME MONEY!!</em></p><br/><p>The voice boomed like thunder, and caused Han Qinglei’s face to grow even paler than before.</p><br/><p>“What magical technique is this?! Dammit!!” He was completely alarmed to realize that this was a type of magic that he had never even heard of before.</p><br/><p>When Meng Hao waved his finger, the entire world changed in his eyes. Everything shook and time seemed to slow to a crawl. Faintly, he could see numerous Karma Threads stretching away from the heads of everyone visible. Han Qinglei himself had an abundance of Karma Threads, so many that it made it difficult to distinguish the individual threads. However, there was one thread connecting him to Meng Hao.</p><br/><p>That thread might not bind them together very strongly, but it was there, glowing with intense light. A Writ of Karma.... The deeper the relationship between the caster and the target, the stronger the Karma Threads. The stronger the Karma Threads, the more domineering the effect of the magical technique.</p><br/><p>“The first thing that happened was you learned my name,” Meng Hao said somberly, his expression dignified, as if he were describing some holy aspect of Heaven and Earth. “Then you were completely defeated by me. What’s happening right now can be described as Karma!</p><br/><p>“Karma serves as destiny. Heaven and Earth bear witness. An indelible brand is created, which manifests as a promissory note. The day your debt is paid back, the Karma will be dispersed!” He waved his hand as if he were writing something, and then, colors flashed in the sky, and the wind screamed. Booms rang out, as if lightning and thunder were bearing witness to the Karma between Meng Hao and Han Qinglei.</p><br/><p>Han Qinglei let out a miserable shriek. Despite the fact that he was surrounded by mists, and shooting away at top speed, his mind still filled with a roaring like that of thunder. At the same time that Meng Hao unleashed his magic, Han Qinglei felt a faint aura being pulled up out of his body.</p><br/><p>It was an astonishing sensation, and also horrifying. He had the sudden premonition that Meng Hao was marking him in a way that would affect him for the rest of his life.</p><br/><p>“NO!” he roared. However, struggling was useless. By now, he had no choice but to ignore the shame he felt. His body trembled, and he wanted nothing more than to be gone from this place. His terror regarding Meng Hao had reached a pinnacle, and for the first time, he felt complete and utter regret for ever having chosen to attack the Ninth Nation and Meng Hao.</p><br/><p>The parrot hovered not too far off, watching the scene with entrancement. It was envious, extremely envious. Of all the Daoist magics that Meng Hao was able to wield, A Writ of Karma was the only one that it felt to be breathtakingly beautiful, and the parrot almost couldn't control itself whenever it saw it in action.</p><br/><p>The meat jelly was also envious, and wished that it could have such a Daoist magic. If so, whenever it met bullies, it would use A Writ of Karma on them, and things would go much smoother as a result.</p><br/><p>Fan Dong’er had an unsightly look on her face. Although she was currently on the same side as Meng Hao, when she saw A Writ of Karma in action, she couldn’t help but think about certain things which had occurred in the past. [1. In case you forgot, Fan Dong’er was the first person Meng Hao tested out A Writ of Karma on in chapter 855]</p><br/><p>As for Bei Yu, she had regained consciousness earlier and had seen most of the fight between Meng Hao and Han Qinglei. Now, she watched as Meng Hao, looking like the very picture of holiness, unleashed A Writ of Karma. She almost couldn't imagine what kind of person would go to the lengths of creating a magical technique like this, just to get people to owe him money.</p><br/><p>Not only that, when he unleashed the magic, he was filled with a look of piety....</p><br/><p>Meng Hao actually did feel very pious right now. His righteous and reverent voice echoed out across the lands:</p><br/><p>“Henceforth, you owe me money! The compound interest shall not be altered! One year, twofold! Ten years, a hundredfold. One hundred years, ten thousandfold! Karma Thread, form the promissory note. NOW!”</p><br/><p>As his dignified words echoed out, Meng Hao clenched his hand viciously onto Han Qinglei’s Karma Thread. It twisted and distorted, letting out brilliant light. In the blink of an eye, the light formed together into a writ, formed from Daoist magic.</p><br/><p>It floated gently down toward Meng Hao, who took hold of it gingerly, as if it were a precious treasure. When he saw the numbers written on the note, he cleared his throat and added it to the thick stack of other notes in his bag of holding.</p><br/><p>In the moment that the promissory note appeared, Han Qinglei coughed up a mouthful of blood. He could clearly sense that the aura which had left him moments ago indicated that he had entered some sort of agreement with Meng Hao.</p><br/><p>That agreement was almost like one of indentured servitude. Most importantly, he had no control in the matter, and had been forced to sign the agreement! Regardless of whether he agreed to it or not, he now owed Meng Hao a vast amount of wealth.</p><br/><p>If he didn't pay it back, then due to Karma, his cultivation base and his future would all be subject to unforeseen changes. A situation like this, and a Daoist magic like this, caused Han Qinglei to tremble violently. In his terror, he suddenly recalled a terrifying sort of Daoist magic.</p><br/><p>“Fate!! This is a magic of Fate! He... he actually knows Fate magic!! This is impossible! In all of Heaven and Earth, from ancient times until now, no one has ever achieved enlightenment of the Dao of Fate!!” Blood sprayed from his mouth, and he let out a mighty roar. Finally, he pushed the mist to increasing speed, and vanished over the horizon.</p><br/><p>“This isn't a place where you can just casually come and go!” Meng Hao said righteously. “First of all, you interrupted my cultivation. Even if I overlook that, though, how could I possibly let you go when you owe me some money!?” With that, he waved a finger toward Fan Dong’er and Bei Yu. Two streams of qi flowed into them, causing them to shudder as their cultivation bases were completely restored. They even ended up with more power than before.</p><br/><p>“Fellow Daoists, please head to the central temple. Kill all of the cultivators from the Eighth Nation. Weaken the defenses of the Eighth Nation's Mountain of National Fate. Assist me as I go to the Eighth Nation to wrest away their World Seal!</p><br/><p>“If I succeed, we can all seek to gain enlightenment together! We can contemplate the natural laws and Essences of the Windswept Realm, and solidify our path to the future!” In response to his words, Fan Dong’er and Bei Yu’s eyes glittered. They were intelligent people, and instantly understood Meng Hao’s plan. This opportunity was definitely a rare one, and besides, Meng Hao had now offered them a promise!</p><br/><p>The two women exchanged a glance, and then nodded. Immediately, they transformed into beams of light that shot off toward the central temple, where they would work hard to assist Meng Hao.</p><br/><p>In the moment that Fan Dong’er and Bei Yu left, Meng Hao took a step forward, heading in the direction in which Han Qinglei had fled. He employed full speed as he raced to catch up.</p><br/><p>“Don’t run, Han Qinglei! Pay me back that money!” As his voice boomed out, the blackpod imps, the meat jelly, and the parrot all turned into beams of light that shot through the air behind Meng Hao. As for the seafood dishes, the parrot used a cosmic storage technique to tuck them away into its wings. Then, it arrogantly cried out:</p><br/><p>“Don't run, Han Qinglei! Lord Fifth hasn’t screwed you yet, how dare you flee!!”</p><br/><p>Beams of light shot through the air, causing everything to shake. Han Qinglei was still fleeing, coughing up blood as the mist around him faded away. This was his life-saving magic, and was something that couldn’t be sustained long-term. It was merely a temporary boost in speed, something that would enable him to flee from a deadly crisis.</p><br/><p>The incredible speed ensured that he was able to leave the Ninth Nation and return to the Eighth Nation almost instantly. His face was pale, and the sensation of imminent crisis still hadn't left him. He could sense that the terrifying Meng Hao was currently chasing him down!</p><br/><p>As soon as he entered the Eighth Nation, his voice roared out, bolstered by a magical technique.</p><br/><p>“Troops of the Eight Mountain, come posthaste!” His voice echoed out through the Eighth Nation to all of the other eight cultivators who had come from the Eighth Mountain. Of that group, four were fighting in the region of the central temple. Their bodies trembled, and they immediately employed their top speed to leave their current locations to speed toward Han Qinglei.</p><br/><p>Time passed. An hour later, Han Qinglei was still speeding through the air, occasionally coughing up blood. The mist that had surrounded him and hauled him along was now completely gone. Instead, four imposing beams of light surrounded him in a protective formation as he flew toward the Eighth Nation’s Mountain of National Fate.</p><br/><p>“I need to get back to the Mountain of National Fate as soon as possible! I can use the defensive measures there to fight back against Meng Hao. That will at least give me some time to recover from my injuries!!</p><br/><p>“Meng Hao won’t be able to spend too much time trying to catch me. If he does, he’ll leave the Ninth Nation vulnerable to attack by other members of the Echelon!</p><br/><p>“As long as I can buy enough time, I’ll definitely be able to get through this deadly crisis!” Han Qinglei’s eyes were crimson red as he shot through the air.</p><br/><p>It was at this point that Meng Hao suddenly appeared at the border between the Eighth and Ninth Nations. He looked like a celestial warrior, and as soon as he entered the Eighth Nation, all of the cultivators there could feel the pressure radiating off him, and they trembled.</p><br/><p>“When receiving guests, it is improper not to return favors. Since you decided to come to my home and stroll around, I’ve decided to come to your home to collect my interest.” Meng Hao cleared his throat and looked somewhat apologetic, although he didn’t hesitate for a moment before heading immediately toward the Eighth Nation’s Mountain of National Fate.</p><br/><p>Rumbling filled the air as he closed in. The pressure weighing down from the Eighth Nation grew stronger; by this point, Han Qinglei had reached the mountain. As soon as he set foot on it, his voice rang out:</p><br/><p>“Defend this location to the death! Don’t allow anyone to step even half a foot inside!”</p><br/>\n</div>"}