{"title": "Chapter 1101: Slaughtering Into the National Aura Mountain!", "id": 1101, "volume": 12, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-1101-slaughtering-into-the-national-aura-mountain", "volume_title": "Volume 12", "body": "<h1>Chapter 1101: Slaughtering Into the National Aura Mountain!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 1101: Slaughtering Into the National Aura Mountain!</strong></p><br/><p>Han Qinglei sat cross-legged on the Eighth Nation’s National Aura Mountain, face pale, coughing up mouthfuls of blood. He nervously produced medicinal pills, which he immediately consumed. Not only had his little excursion resulted in significant loss, he was now being chased by Meng Hao. However, in all of the Windswept Realm, there was no safer place for him to be than on this National Aura Mountain.</p><br/><p>As he sat there cross-legged, his wounds slowly began to heal. At the same time, the four middle-aged cultivators from the Eighth Mountain and Sea remained outside of the mountain, both on guard, and at the same time, looking at each other in dismay. All of them were clearly shaken.</p><br/><p>They knew Han Qinglei, and they had never encountered a member of the current generation who could outmatch him in this way.</p><br/><p>Therefore... seeing Han Qinglei’s injuries left them completely unnerved. After all, they were aware that he had previously headed toward the Ninth Nation.</p><br/><p>“Was it the Echelon cultivator from the Ninth Mountain who did this? Meng Hao...?”</p><br/><p>“It must be him! Han Qinglei was heading toward the Ninth Nation, so they must have ended up fighting!” The four took deep breaths, and their expressions turned very serious.</p><br/><p>However, they had no choice in the matter. Regardless of whether it was because of their mission, or the effect it would have on their own chances for success in the Windswept Realm, giving up was not an option.</p><br/><p>Time passed, and the four men kept their cultivation bases rotating the whole time. Soon, a bright streak of light appeared on the horizon, and before they could even react, massive rumbling sounds filled the air.</p><br/><p>It was none other than Meng Hao!</p><br/><p>After entering the Eighth Nation, he had caused an enormous pressure to spread out over the entire nation, in much the same way that Han Qinglei had when he had entered the Ninth Nation. The feeling experienced by Fan Dong’er and the others was now occurring among all the members of the Eighth Nation.</p><br/><p>The four men’s faces flickered as they looked toward Meng Hao. Before Meng Hao even made a move, the four men clenched their jaws tightly and performed incantation gestures to summon divine abilities.</p><br/><p>In unison, the men howled: “Four Holy Beasts Formation!”</p><br/><p>The sky flickered, and the earth quaked. These four men were not in the Immortal Realm, but rather, the Ancient Realm!</p><br/><p>All of them had cultivation bases with five extinguished Soul Lamps, which was the absolute limit for the Windswept Realm. Their attack caused a massive wind to spring up and roaring sounds to fill the air as a huge White Tiger appeared.</p><br/><p>The White Tiger was fully 300 meters long, and was clad in a suit of armor. It radiated a terrifying energy, along with a towering murderous aura.</p><br/><p>Next was a Black Turtle, extremely domineering and fierce. It was surrounded by rushing black waters, which roiled up into the Heavens. A seemingly infinite power seemed to surround it as an illusory land mass appeared beneath its feet.</p><br/><p>Next was a Vermilion Bird, surrounded by a majestic sea of flames that rose up into the sky. Last was an Azure Dragon, whose roars caused the heavens to distort. All four Holy Beasts materialized, causing lightning to dance and extraordinary energy to surge.</p><br/><p>“Four Holy Beasts Destruction!” the four cultivators roared. Immediately, the images of the four Holy Beasts roared and leaped toward Meng Hao amidst churning, seething clouds. The speeding White Tiger was the first to arrive, bursting with a murderous aura.</p><br/><p>Meng Hao's eyes flickered, and he gave a cold snort as he stepped forward and waved his hand. Immediately, the Mountain Consuming Incantation materialized, causing countless mountains to descend, crushing down onto the White Tiger. Rumbling could be heard as the tiger was pinned in place. Meng Hao subsequently descended, then reached out and viciously smacked the tiger on the head.</p><br/><p>The smack caused a huge tremor to run through the White Tiger, after which it let out a miserable shriek. Finally, its head exploded, and one of the four cultivators coughed up a massive mouthful of blood.</p><br/><p>However, despite losing its head, the White Tiger wasn't dead. After all, it wasn't a real animal, but rather, a magical construct. It still slashed out ruthlessly at Meng Hao with its claws.</p><br/><p>An ear-piercing sound like that of metal grating against metal rang out. However, Meng Hao wasn't hurt in the least bit; his fleshly body was already in the Ancient Realm, so how could this White Tiger possibly harm him?</p><br/><p>The White Tiger froze in shock, and the four cultivators defending the National Aura Mountain were astonished.</p><br/><p>“His fleshly body....”</p><br/><p>“Dammit, what fleshly body is that?! He actually wasn’t hurt at all by the White Tiger!”</p><br/><p>As their hearts trembled, Meng Hao grinned viciously and charged forward, slamming directly into the White Tiger's chest. The Mountain Consuming Incantation was unleashed again, but this time, the mountains didn't descend from the sky. Instead, they burst out from inside the White Tiger. A boom could be heard as the sharp mountain peaks stabbed out through its body, prompting a bloodcurdling shriek. In the blink of an eye, its massive frame was ripped into shreds by the numerous mountains.</p><br/><p>The cultivator in control of the White Tiger coughed up more blood, and trembled violently. Cracking sounds could be heard as bones were shattered, and the man very nearly passed out.</p><br/><p>He looked at Meng Hao with complete terror and astonishment as he finally realized how Han Qinglei came to be injured so badly. Obviously, Meng Hao was so much more powerful than Han Qinglei that... it was almost impossible to imagine!</p><br/><p>Before they could even unleash more divine abilities, Meng Hao turned into a sharp arrow that stabbed toward the roaring Black Turtle.</p><br/><p>The turtle was incredibly tough, surrounded by black waters, and standing on top of a huge land mass. All of that made its defenses incredibly high. However, Meng Hao pierced through all that, slamming into it and causing a miserable shriek to ring out. Cracks spread out over the entire Xuanwu turtle, and in the blink of an eye, the black water faded. The land collapsed, and the entire Xuanwu turtle exploded into bits!</p><br/><p>It was thoroughly smashed, incapable of standing up to Meng Hao whatsoever. In the same moment, blood sprayed out of the mouth of the cultivator in control of the Black Turtle. He instantly began to shrink back and tremble, and an expression of shock covered his face.</p><br/><p>The two remaining cultivators roared, causing the Vermilion Bird and the Azure Dragon to also roar, then swirl together in a combined attack to block Meng Hao’s progress.</p><br/><p>It was like a dragon and a phoenix attacking together, causing their power to rocket up. The sea of flames surrounding the Vermilion Bird filled the sky, burning everything above and below, threatening to completely eradicate Meng Hao.</p><br/><p>As the intense heat caused everything to ripple and distort, Meng Hao smiled.</p><br/><p>“Flames?” he said. Without the slightest hesitation, he took a step forward and then performed an incantation gesture with his right hand. Instantly, a ball of flame appeared in his hand.</p><br/><p>It was none other than... the Essence of Divine Flame!</p><br/><p>He squeezed down, and the ball of flame exploded, sending boundless Divine Flame swirling around him. As the Vermilion Bird closed in, Meng Hao waved his hand, causing the Divine Flame to surge outward. In response to Meng Hao’s thoughts, the swirling Divine Flame also transformed into a Vermilion Bird.</p><br/><p>Two Vermilion Birds slammed into each other in midair, sending a huge boom echoing out in all directions. Meng Hao's Divine Flame Vermilion Bird completely vanquished the Four Holy Beasts Vermilion Bird, completely burning it up!</p><br/><p>Vermilion Birds were born amidst flames, and despite being a magical construct, this Vermilion Bird had some of the true will of an actual Vermilion Bird. However, only a bloodcurdling scream could be heard as it was reduced to nothing but ash. The cultivator controlling it coughed up a mouthful of blood. Blood also oozed out of his eyes, ears, nose, and mouth. The backlash caused flames to surround him, completely eradicating him in body and soul.</p><br/><p>All of these things take quite some time to describe, but actually occurred in the space of only a few breaths of time. Of the Four Holy Beasts, three were now completely eradicated, leaving only the Azure Dragon behind. As it closed in on Meng Hao, he made a grasping motion, causing the bone-tip spear to appear.</p><br/><p>This spear’s haft was crafted from the World Tree, and the bone spearhead was long and sharp. A murderous aura radiated out from it, causing everything in the area to turn as cold as the dead of winter. Meng Hao glanced at the Azure Dragon, then hurled the spear toward it. The spear pierced out, slashing a hole into the air as it sped toward the Azure Dragon.</p><br/><p>Looking shocked, the Azure Dragon waved its tail in an attempt to brush the spear aside. However, as soon as its tail made contact, it shattered into pieces. The spear moved with shocking speed, leaving behind afterimages as it stabbed into the Azure Dragon with incredible power. The Azure Dragon could not even fight back as the spear slammed it into the ground.</p><br/><p>A huge boom rang out as the Azure Dragon was pinned to the ground, causing a huge crater to appear.</p><br/><p>Blood sprayed out of the mouth of the cultivator in control of the dragon, and his face turned ashen. Meanwhile, Meng Hao had already reached the National Aura Mountain, whereupon he clenched his hand into a fist and punched out.</p><br/><p>The statue on top of the Eighth Nation’s National Aura Mountain suddenly flickered with bright light, and a bright shield appeared to block Meng Hao’s punch. The resulting backlash was so intense that Meng Hao had no choice but to fall back several paces, frowning.</p><br/><p>Almost in that same moment, the surrounding three cultivators clenched their jaws, ignoring the incredible pressure weighing down on them and any potential injury, and charged toward Meng Hao, unleashing divine abilities the entire way.</p><br/><p>“Screw off!” growled Meng Hao, waving his arm. Rumbling filled the air as an incredible power surged out, slamming into his three opponents. Blood instantly spurted out of their injuries, and two of them were killed instantly. The remaining cultivator's face went pale, and he retreated in shock.</p><br/><p>Meng Hao did nothing to pursue him. Instead, he clenched his right hand into a fist and struck the shield again. His eyes glittered, and a faint, cold smile could be seen on his face.</p><br/><p>Inside the shield, Han Qinglei sat beneath the statue, face pale, but fully focused on recovering from his injuries.</p><br/><p>Around this time in the Seventh Nation, the Echelon cultivator from the Fourth Mountain, Lin Cong, was standing in a bronze war chariot as it sped forward. He wore a white robe, and his expression was one of surprise. However, he also radiated indescribable power, as well as supreme confidence in himself and his cultivation base. [1. Lin Cong appeared before in chapter 1058 and chapter 1090. His name in Chinese is  lín cōng. Lin is a surname which also means “forest.” Cong means “intelligent”]</p><br/><p>“So, you’re delivering up a plump gift for me, eh Han Qinglei?” he murmured, eyes glittering. He looked at the jade slip in his hand and laughed.</p><br/><p>“From the fluctuations, it seems that Han Qinglei and Meng Hao are fighting already.... Well that’s fine. After the two of them have worn each other down, then I can easily snatch the World Seals of two nations. I don't care what plot Han Qinglei has brewing, he's not strong enough to go up against me. I’ll crush him as easily as a dried weed!”</p><br/><p>Chuckling coldly, Lin Cong sent his war chariot speeding forward. Massive ripples spread out, and at the same time, he flexed his cultivation base, causing a domineering air to spread out. It was as if he were announcing to the world: <em>Lin Cong is coming!</em></p><br/><p>He was also using his status in the Echelon as a threat!</p><br/><p>He emanated crushing power, and had incredible self-confidence, the result of a series of random events that had led to him fighting against the number one member of the Echelon. Although he had been defeated, that cultivator had personally told him that he was the most powerful person he had ever fought!</p><br/><p>----</p><br/><p>The four beasts in this chapter are common Chinese mythological creatures. More information here.</p><br/>\n</div>"}