{"title": "Chapter 1119: Hong Bin Dies in Battle!", "id": 1119, "volume": 12, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-1119-hong-bin-dies-in-battle", "volume_title": "Volume 12", "body": "<h1>Chapter 1119: Hong Bin Dies in Battle!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong></strong></p><br/><p>[/expand]</p><br/><p>Dao-Heaven faced off haughtily against the Paragon magics of Meng Hao and the others. Suddenly, he took a breath, and his energy surged as he stretched his right hand up and waved it around.</p><br/><p>“As for my Paragon magic, I have come to call it... Paragon Painting!” Even as the words left his mouth, the air in front of Dao-Heaven distorted and was ripped apart as a scroll painting flew out.</p><br/><p>The scroll painting was pitch black and emanated a boundlessly ancient feeling. It seemed like something that had existed for countless years, and before it even opened, it emanated an incredible, murderous aura.</p><br/><p>The power of that aura instantly caused bizarre colors to flash everywhere, and the wind to churn. It was impossible to even describe the level of power; this type of murderous aura was something that Meng Hao hadn’t encountered in his entire life.</p><br/><p>It seemed like an aura of someone who had ended countless lives, who had exterminated worlds upon worlds, who had proven his Paragon status by means of endless slaughter!</p><br/><p>The air rumbled and distorted beneath the power of this aura of murder. The sky turned dark, as if it were being completely covered up, as if the whole world were turning black.</p><br/><p>The ground quaked, and the murderous aura caused fog to spring up and roil out in all directions. In a brief moment, the entire world changed.</p><br/><p>Meng Hao’s heart was pounding, and it was the same with Yuwen Jian and Hong Bin, whose faces had fallen.</p><br/><p>It was as if within this scroll painting hid a shocking, fiendish beast whose mere aura could suck away all the light of the world!</p><br/><p>“Paragon Painting, open!” Dao-Heaven said proudly, performing an incantation gesture and pointing at the scroll painting. Noiselessly, the scroll painting began to open up, not fully, only about thirty percent. However, the thirty percent that was revealed gave a glimpse of the scene depicted. It was a bizarre world, a world of pitch black, and if you looked closely, you would see... a land that seemed to embody death.</p><br/><p>Nothing else was visible except for that land, nor would it be, unless the scroll painting was opened further.</p><br/><p>However, that tiny portion caused an indescribable power to surge out, which spread out in all directions along with the murderous aura.</p><br/><p>Heaven and Earth seemed to be on the verge of collapse. The world seemed about to fall apart. Massive power rumbled out, sweeping toward Yuwen Jian and completely shattering his Paragon magic. When the blood-colored images of Yuwen Jian’s Paragon magic collapsed, he was flung backward, blood spraying out of his mouth.</p><br/><p>Meng Hao felt as if a mountain had slammed into him. His body trembled, and blood oozed out of his mouth. He staggered backward thirty meters, and as he looked at Dao-Heaven’s terrifying Paragon magic, he realized that it was something he couldn't even fight.</p><br/><p>“Just what is painted inside of that scroll!?” he thought, heart trembling.</p><br/><p>The worst off of the group was the boyish Hong Bin. He screamed and then coughed up a mouthful of blood as he shot backward. Before he could get very far, a blur sped through the air, which was none other than Dao-Heaven. His face was pale; apparently, the Paragon magics unleashed by Meng Hao and the others were not things that he could simply ignore, as he had their previous attacks.</p><br/><p>They had forced him to the point of using Paragon magic to fight back. If any of his followers were present, they would surely be astonished by this. Dao-Heaven’s pride was such that he had never actually unleashed his Paragon magic during battle with members of his generation. In fact, he would only use it to suppress powerful experts of the Senior generation.</p><br/><p>But now, Meng Hao and the others had forced him to use it. Facing their combined attack had actually filled Dao-Heaven’s heart with a sense of deadly crisis.</p><br/><p>However, that sense of crisis led to the unleashing of his Paragon magic, which instantly turned the tide of battle in his favor. He suddenly appeared directly in front of Hong Bin, his eyes flashing with killing intent as he waved his hand in an attack.</p><br/><p>The simple wave of a hand unleashed explosive power, transforming into a will of slaughter that slammed into Hong Bin.</p><br/><p>Seeing that he was about to be overwhelmed, a crazed look appeared in Hong Bin’s eyes. He threw his head back and roared, choosing to self-detonate in the same moment that Dao-Heaven went in for the kill.</p><br/><p>His eyes were bright red as his cultivation base exploded with mad power. As Hong Bin’s body detonated, Dao-Heaven’s pupils constricted. He flicked his sleeve, using his robe to defend himself. Hong Bin exploded, his body transforming into a tempest that swept out in all directions.</p><br/><p>The massive blast shattered the sky and crushed the land. Dao-Heaven’s will of slaughter was bashed away by the force of the explosion, and Dao-Heaven’s face went pale. He was slightly injured by the impact, and yet he didn’t cough up any blood.</p><br/><p>Hong Bin took advantage of the moment to reform from the haze of blood. When he reappeared, he shot backward at top speed.</p><br/><p>“Save me!” he screamed. He had died once before during his time in the Sixth Mountain, and if you coupled that with the self-detonation just now, it meant that he could no longer rely on being able to come back. The next time he died, he would die for good.</p><br/><p>In the same moment that Hong Bin cried for help, Meng Hao and Yuwen Jian went on the offensive. Meng Hao unleashed the Essence of Divine Flame, and Yuwen Jian roared as red light swirled around him. His fist shot out, causing a figure of blood to appear, a towering giant who pounced toward Dao-Heaven.</p><br/><p>Dao-Heaven snorted coldly as Yuwen Jian’s blood-colored giant closed in. He performed an incantation gesture with his left hand and pointed out. Suddenly, the Immortal Flail on his arm vanished, then snapped out from his finger, slamming into the blood-colored giant. A huge boom echoed out as the giant exploded. As for the Immortal Flail, it didn't stop, but rather, continued straight on toward Yuwen Jian.</p><br/><p>The person Dao-Heaven was actually the most concerned about was Meng Hao, whose Divine Flame was currently bearing down on him.</p><br/><p>“Essence.... I have that too!” he suddenly said. He spit something out of his mouth, and the flash of lightning could be seen. It was a red lightning bolt that seemed to summon lightning from Heaven and Earth. Countless lightning bolts began to fall, transforming into a sea of lightning that shot toward Meng Hao’s Essence of Divine Flame.</p><br/><p>When the two forces slammed into each other, the flame Essence and the lightning Essence both collapsed with a massive boom.</p><br/><p>All of this takes a long time to describe, but the truth of the matter is that in the same moment that Dao-Heaven blocked Meng Hao and Yuwen Jian, he didn’t pause for even a moment before chasing after Hong Bin.</p><br/><p>“DIE!” he said, his voice cool. His right hand clenched into a fist, and he punched out. That blow contained an indescribably wild wind, an explosive tempest that bore down onto Hong Bin.</p><br/><p>The light of despair flashed in Hong Bin's eyes, and he performed a double-handed incantation gesture, causing numerous spell formations to appear in front of him. He also waved his hand, sending various magical items flying out of his bag of holding. He even used life-saving magical items.</p><br/><p>He didn't spare a single thing in his defense. However, all of his spell formations and magical items were crushed by Dao-Heaven as easily as if they were dried weeds. Everything collapsed, and just as the tempest was about to slam into Hong Bin, Dao-Heaven suddenly transformed the fist into a claw, which latched onto Hong Bin’s forehead.</p><br/><p>Dao-Heaven then coldly spoke out three words: “Heavenly Demon Devouring!”</p><br/><p>Hong Bin immediately let out a bloodcurdling scream. His fleshly body rapidly withered away as his life force was absorbed by Dao-Heaven. Instantly, all of Dao-Heaven’s injuries were healed.</p><br/><p>Blood sprayed out of Hong Bin’s mouth, and as death neared him, a spell formation suddenly appeared on his forehead. The spell formation then exploded, shoving Dao-Heaven’s hand away. Hong Bin was transformed into nothing but ash, with only his Immortal soul left behind. He let out a piercing cry, and a look of madness could be seen on his face.</p><br/><p>“Yuwen Jian, Meng Hao, it would be better for you to get the reward for killing me than to let me fall by Dao-Heaven’s hand! Swear to me that you’ll avenge me by cutting him down!” Hong Bin feared death, but he was still a member of the Echelon. Echelon cultivators were proud, and when faced with death, they rarely acted indecisively. Without the slightest hesitation, he shot toward Yuwen Jian.</p><br/><p>Yuwen Jian’s heart trembled, as did Meng Hao's. They had all miscalculated. Dao-Heaven was so strong that even the three of them together weren’t strong enough to take him down.</p><br/><p>“The only person who will be killing you... is me,” Dao-Heaven said with a cold laugh. His right hand made a clawing motion toward Meng Hao and Yuwen Jian. Instantly, rumbling echoed out as the air between them was shattered, transforming into an obstacle-like distortion that separated them completely.</p><br/><p>Then, Dao-Heaven shot like lightning toward Hong Bin, his eyes shining with anticipation.</p><br/><p>“I wonder what reward I’ll get for killing you, Hong Bin? Prepare to die!” Dao-Heaven raised his hand and grabbed out toward Hong Bin, upon whose face appeared a look of despair. Hong Bin was incapable of fleeing, and couldn't even self-detonate. It was as if his body was completely sealed off.</p><br/><p>Just when he was on the verge of being killed, Meng Hao suddenly pulled out the Lightning Cauldron. Electricity danced, but at the same time, Dao-Heaven let out a roar. Suddenly, a red glow spread out, covering both him and Hong Bin. Unexpectedly, Meng Hao’s Lightning Cauldron didn't work!</p><br/><p>That didn’t cause Meng Hao to pause for even a moment, however. He raised his left hand and waved a finger toward Dao-Heaven.</p><br/><p>The Eighth Demon Sealing Hex was unleashed!</p><br/><p>Dao-Heaven could be on guard against Meng Hao’s Lightning Cauldron, but could do nothing to stop the Eighth Demon Sealing Hex!</p><br/><p>As soon as the Hexing magic was unleashed, Dao-Heaven suddenly lurched to a stop. For the second time, his face fell, and a feeling of astonishment rose up inside of him.</p><br/><p>He was only locked down for the space of about one breath of time. However, to Hong Bin, that one breath of time was enough for him to escape the shackles of being sealed.</p><br/><p>However, he didn't take advantage of that moment to flee. He knew that getting away was an impossibility. Laughing bitterly, and eyes shining with determination, he flew directly toward Dao-Heaven in an attack.</p><br/><p>“Get revenge for me!” he said, throwing his head back and roaring.</p><br/><p>Yuwen Jian urgently cried out, “Hong Bin!!”</p><br/><p>Meng Hao’s heart trembled.</p><br/><p>It was at this point that Hong Bin’s Immortal soul closed in on Dao-Heaven. At the same time, Dao-Heaven was beginning to recover from the Eighth Demon Sealing Hex. A vicious smile appeared on the face of Hong Bin’s Immortal soul as he... self-detonated!</p><br/><p>BOOOOMMMMMM!</p><br/><p>The detonation of an Immortal soul alone would not unleash the same power as if the fleshly body exploded along with it. However... Hong Bin was in the Echelon, and as such, the detonation of his Immortal soul transformed into a power far beyond the ordinary. More importantly, the damage was increased because of his close proximity to Dao-Heaven, who was incapable of putting up a solid defense because he still hadn't fully recovered from Meng Hao’s magical technique.</p><br/><p>A huge, shocking boom echoed out as Hong Bin's Immortal soul exploded into nothing more than ash. Dao-Heaven was shaken, and tumbled backward, coughing up blood. This was the first time during the fight that he coughed up blood, which splashed down onto the ground and formed a lake of blood.</p><br/><p>“Meng Hao!!” Dao-Heaven roared, screeching to a halt in midair. His face was pale as he turned to look at Meng Hao, a murderous gleam in his eyes.</p><br/><p>The two moments of danger he had experienced so far, had both been because of... Meng Hao!</p><br/><p>This time, because Hong Bin had died by means of self-detonation, Dao-Heaven got no reward for killing him!</p><br/><p><strong>Chapter 1119: Hong Bin Dies in Battle!</strong></p><br/>\n</div>"}