{"title": "Chapter 1127: You're Zong Wuya!", "id": 1127, "volume": 12, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-1127-youre-zong-wuya", "volume_title": "Volume 12", "body": "<h1>Chapter 1127: You're Zong Wuya!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong></strong></p><br/><p>[/expand]</p><br/><p>In almost the same moment that the blood-colored swords began to speed through the air, the bubbling blood in the ninety-eight pits suddenly shrank down, revealing ninety-eight cultivators.</p><br/><p>Each and every one was an old man, and they were all radiating blood-colored light that seemed to burst with evil. Suddenly, their eyes opened, and what could be seen was not the clarity of normal eyes, but a murky, bloody glow. It was as if they weren't even conscious or aware of themselves, as if they had been transformed into puppets that merely followed orders or acted on instinct.</p><br/><p>One of those old men was Jian Daozi, who no longer looked shrewd and intelligent like before. However, he didn't seem ancient and decrepit like before either, but instead seemed to burst with the vigor of his prime.</p><br/><p>All of them began to breathe, and when they exhaled, the air of evil around them seemed to increase.</p><br/><p>“Kill the intruder Meng Hao!” said the black-robed man, his voice hoarse and raspy. Instantly, the ninety-eight blood-colored cultivators roared and flew into the air. Currently, their cultivation bases were no longer at the Cauldron Seeking stage; they had broken through from the Spirit Realm and into the Immortal Realm!</p><br/><p>Although they had just broken through, the evil auras that surrounded them made them seem extremely eerie. Ninety-eight old men became beams of blood-colored light that sped through the air toward the pit where Meng Hao was located.</p><br/><p>“You people too! Get in there!” the black-robed leader said to the other men who had come with him. One by one, they blurred away, vanishing.</p><br/><p>The black-robed leader was the last one to do anything. It was impossible to see his face or his expression, but he seemed to be lost in thought for a moment before waving his hand and causing a black light to spread out. It spread out to cover the entire area, apparently sealing it.</p><br/><p>Having accomplished this, the man began to slowly walk toward the pit where Meng Hao was located.</p><br/><p>“Meng Hao of the Ninth Nation, the Ninth Mountain, the Ninth Sea....” he murmured. It was almost as if he were recalling something from the past. He sighed.</p><br/><p>In the tunnel below the necropolis, Meng Hao threw his head back and roared as he unleashed a fist strike with both hands, killing the final members of the first wave of black-robed cultivators.</p><br/><p>This battle was being fought with only sixty percent of his cultivation base. To defeat dozens of Ancient Realm opponents in such a way was difficult to say the least. Currently, he was coughing up blood, and his face was ashen. He suddenly looked up at the mouth of the tunnel, where a bright red glow could be seen. At that point, numerous red-colored flying swords could be seen screaming toward him, followed by the explosive, evil auras of the ninety-eight blood-colored cultivators. As soon as their crimson eyes locked onto him, they howled like beasts and charged toward him in attack.</p><br/><p>Meng Hao's eyes widened as he realized that the flying swords were actually sentient. Both the swords and the cultivators seemed to be operating on the same source of power as the blood-colored ice block, except on a much weaker level.</p><br/><p>Meng Hao frowned, and then let out a cold harrumph. The starstone in his left eye melted and spread out to cover his entire body, transforming him into a planet. He then flew toward the incoming flying swords, causing rumbling sounds to echo out.</p><br/><p>He shot forth like a meteor, taking up nearly the entire diameter of the tunnel. When he slammed into the flying swords, a huge boom echoed out, and they were sent spinning back toward the blood-colored cultivators. The entire tunnel was thrown into chaos. Although there were quite a few of the blood-colored cultivators, because the tunnel was so narrow, they were unable to scatter or dodge, and were immediately bombarded by the full force of Meng Hao’s One Thought Stellar Transformation.</p><br/><p>When it slammed into the men, blood erupted out, and all of them were ripped to shreds. However, it was at this point that the seventeen black-robed men arrived, incantation gestures flashing in their hands.</p><br/><p>Waving their fingers toward Meng Hao, they roared: “Star-Slaughtering Dao of Lightning!”</p><br/><p>As soon as the words left their mouths, the rumbling of thunder could be heard. Seventeen lightning bolts then shot out from the black-robed men, merging together in mid-air to form a single violet-colored lightning bolt!</p><br/><p>As soon as it appeared, it emanated a mighty power of expulsion. It seemed powerful enough to reject and expel Heaven and Earth, to reject natural laws, to reject Essence!</p><br/><p>At the same time, the world seemed to be rejecting and expelling it!</p><br/><p>Meng Hao’s mind trembled; when he looked at the violet lightning, he got the feeling that this was something which shouldn't even exist!</p><br/><p>It was not in accord with Heaven and Earth, did not conform to natural laws, and was not harmonious with Essence. The instant it appeared, it seemed to be a Dao from another world. This was not something from the Windswept Realm, nor from the Mountain and Sea Realm. It was a thing of pure destruction, and when it shot toward Meng Hao and slammed into his One Thought Stellar Transformation, the planet cracked and exploded. Meng Hao appeared, blood spraying from his mouth as he was sent tumbling backward.</p><br/><p>Simultaneously, time seemed to flow in reverse for all of the blood-colored cultivators who had just exploded. They rapidly reformed, as if they were eternally unkillable, after which they immediately shot forward in attack. Furthermore, each one grabbed a blood-colored sword, making them look exactly like sword cultivators.</p><br/><p>Meng Hao had an unsightly expression on his face. Behind the ninety-eight blood-colored cultivators were seventeen black-robed attackers. Meng Hao felt threatened, threatened to the extreme, and what was causing it wasn’t the cultivation bases of these people, but the divine abilities and magical techniques they used.</p><br/><p>Almost in the same moment that the blood-colored cultivators closed on him, Meng Hao began to stride forward, unleashing the Seven God Steps. His power rose explosively, and was even amplified because of the constraints of the tunnel. It was when he took his sixth step that he balled his right hand into a fist and unleashed the Life-Extermination Fist.</p><br/><p>Rumbling filled the air. This strike was filled with the power to exterminate all forms of life, and was backed by the full strength of his Ancient Realm fleshly body. A tempest sprang up, which ripped through the tunnel and slammed into the eternally unkillable blood-colored cultivators. They were instantly shredded into a bloody mist, and even as they began to reform, Meng Hao passed through them to close in on the seventeen black-robed cultivators.</p><br/><p>The cultivators quickly began to perform incantation gestures. Any one of these people who faced Meng Hao alone on the battlefield would not be his match, not without some special Daoist magic. However, when they joined forces to attack, it was a different story.</p><br/><p>As they performed their incantation gestures, violet light swirled around them and formed into a long, violet spear, which instantly stabbed toward Meng Hao.</p><br/><p>It moved with incredible speed, causing intense ripples to emanate out, the same type that both rejected the world around it, and was likewise rejected.</p><br/><p>However, this time, Meng Hao suddenly waved his right hand, causing dozens of black pods to fly out. Popping sounds could be heard as they transformed into blackpod imps, which screeched as they shot toward the black-robed cultivators, intent on possessing them.</p><br/><p>The black-robed men possessed unique and bizarre Daoist magics, but they were still just ordinary living beings with souls, and were still in danger of being possessed. Furthermore, they were in the middle of casting magic, and as such, the blackpod imps were easily able to enter their bodies.</p><br/><p>The chances for the blackpod imps to successfully possess them were small, but actually, Meng Hao didn’t need them to succeed. When they failed, they were ejected and made divine sense attacks.</p><br/><p>The black-robed cultivators instantly began to tremble. At the same time, the Daoist magic they had unleashed, the terrifying violet spear, began to twist in mid-flight, and then simply dissipated.</p><br/><p>In that same moment, Meng Hao flew through the air, right hand clenching and then smashing toward them as the Life-Extermination.</p><br/><p>Just when his blow was about to land, a cold snort echoed out from behind the black-robed men, filled with an archaic air. A shadowy figure walked out, another man in a black robe, but taller than the others. This was their leader, the last man to join the fight.</p><br/><p>He moved with incredible speed, and was soon directly in front of Meng Hao.</p><br/><p>“The Emperor on the National Aura Mountain sensed that someone had broken into this place. Meng Hao, you shouldn't have done this. And by the way, that is not the proper usage of the Life-Extermination Fist.” As the man spoke, he clenched his right hand into a fist, and suddenly, a will of life-extermination exploded out in the form of a single punch.</p><br/><p>Meng Hao’s eyes went wide. He found the man's words to be extremely strange, but had no time to think about why. The two of them sailed through the tunnel toward each other until their fists slammed together.</p><br/><p>A deafening boom echoed out, causing everything to shake. The necropolis itself seemed like it might collapse; cracking sounds rang out as the tunnel began to grow unstable. Blood oozed out of Meng Hao’s mouth as he was sent tumbling backward by the force of the blow.</p><br/><p>The black-robed man was also shaken, and fell back several paces. When he looked up, his black cowl still covered his face, making it impossible to make out his features. However, his eyes shone brightly with bizarre light. He began to walk forward again, clenching his hand into a fist and unleashing another attack.</p><br/><p>“Bedevilment!” he said coolly, his voice hoarse. He punched out, and a wildly domineering air rose up. It was as if this man were the only important thing in the world. He seemed to enter a state of Bedevilment in which he would unleash a blow capable of sacrificing everything.</p><br/><p>Meng Hao’s face fell; the injuries he had sustained earlier had not recovered, causing him to be at a severe disadvantage. However, when he saw the black-robed man unleashing the Bedevilment Fist, he stopped moving backward and instead unleashed his own Bedevilment Fist.</p><br/><p>A huge boom rang out when their fists met, and everything shook violently. The necropolis began showing even more obvious signs of collapsing than before.</p><br/><p>Blood sprayed out of Meng Hao’s mouth, and he was sent flying backward like a kite with its string cut. He was pushed back so far that soon he was near the entrance to the secret chamber. He was panting as he looked up at the black-robed old man. The man’s cultivation base fluctuations put him at ten extinguished Soul Lamps. Furthermore, the explosive level of his body cultivation gave Meng Hao the sensation that this man was even stronger than Dao-Heaven!</p><br/><p>The old man strode forward, unleashing another punch. “God Slaying!”</p><br/><p>In that exact same moment, Meng Hao’s eyes suddenly flickered, and he roared, “You're Zong Wuya!” [1. Previous times Zong Wuya was mentioned: Chapter 1052, 1082, 1083]</p><br/><p>In response to the words, the old man trembled. Meng Hao took advantage of that distraction to take a deep breath and unleash his own fist strike.</p><br/><p>“God Slaying!”</p><br/><p>It was at that point that, in the secret chamber below, the mastiff let out a howl. It was a howl filled with determination, as if the mastiff had reached a critical juncture in the possession process, and was going all out. It would be reborn and replace the renegade spirit, or die in the process!</p><br/><p><strong>Chapter 1127: You're Zong Wuya!</strong></p><br/>\n</div>"}