{"title": "Chapter 1122: I Call Him Slaughter!", "id": 1122, "volume": 12, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-1122-i-call-him-slaughter", "volume_title": "Volume 12", "body": "<h1>Chapter 1122: I Call Him Slaughter!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 1122: I Call Him Slaughter!</strong></p><br/><p>As soon as the intense murderous aura appeared, it roiled out in all directions, kicking up clouds of dust. Lightning crashed repeatedly, and the entire world was stained by the aura of killing until it was black.</p><br/><p>It was as if the statue in that scroll was no longer a painting. Furthermore, the Windswept Realm no longer seemed to be the Windswept Realm, but instead, the world inside the scroll painting.</p><br/><p>Everything was pitch black, both the land and the sky. And yet somehow, Meng Hao could see everything clearly.</p><br/><p>The statue was sitting there cross-legged, wearing black robes. All of a sudden, it twitched, and then slowly began to look up.</p><br/><p>It was a simple motion, but it caused rumbling sounds to fill the entire world. The flow of time seemed to cease, and the natural laws seemed to be thrown into massive chaos. Before this person, Essences seemed to prostrate and kowtow in worship.</p><br/><p>An intense killing aura stabbed into Meng Hao's eyes like a sharp arrow, piercing into his mind, causing his entire body to shake. His face fell as he was suddenly filled with an intense sensation of deadly crisis.</p><br/><p>This sensation of danger did not come from Dao-Heaven, but rather, from the black-robed figure in the painting.</p><br/><p>“Who is he?” Meng Hao thought, his heart pounding. “Just what kind of Paragon magic is this!?” Every Echelon cultivator had different Paragon magics, and of the various types that he had encountered, only Dao-Heaven’s left him so astonished.</p><br/><p>Meng Hao’s expression was very serious. He was in the Allheaven Immortal Realm, and knew that he was bursting with power. In fact, without this Paragon magic, Dao-Heaven would not be a match for him.</p><br/><p>It didn't matter that Dao-Heaven had entered the Ancient Realm nine times before. Each of those times, he had been treading an incorrect path. Meng Hao’s path was that of the Allheaven Immortal, an ancient path, and the most powerful in the Immortal Realm!</p><br/><p>Dao-Heaven looked at Meng Hao, his eyes blazing with killing intent. “You said before that my path was wrong....</p><br/><p>“My path was most certainly incorrect. Of that I am well aware. What you don’t know is that there is a reason why I continued to tread the same incorrect path, and then return back to the Immortal Realm. That is because the path I want... is the path cultivated by the man in my magical Paragon painting!</p><br/><p>“I don’t know his name, nor do I know what this painting truly depicts.... But what I do know is that the painting is ordinary, the paper is ordinary, and even the wooden rollers are ordinary. The only thing beyond ordinary about it is the black-robed figure inside.</p><br/><p>“Because of him, the ordinary paper and the commonplace wooden rollers transformed into something miraculous and extraordinary.</p><br/><p>“He represents slaughter, and is filled with a murderous aura the likes of which I have never encountered anywhere else in my life. Because of that, I call him Slaughter, and in my heart, I view him as... my Master!”</p><br/><p>As Dao-Heaven’s words rang out, he knelt in front of the scroll painting, his eyes burning with passion as he kowtowed deeply. After he kowtowed, the statue finished looking up, and its face was finally revealed.</p><br/><p>It was a pale face, expressionless, and seemingly ordinary. However, within those ordinary facial features could be seen an indescribable iciness as he stared coldly at Meng Hao.</p><br/><p>A mere look caused Meng Hao’s body to shake. He felt an unspeakable pressure crushing down onto him, something superior even to the pressure of the Ninth Sea. Blood sprayed out of his mouth, and despite being in the Allheaven Immortal Realm, he began to stagger backward.</p><br/><p>He had no desire to fall back, but the gaze of the black-robed man in the scroll painting gave him no choice.</p><br/><p>As he fell back, the pressure from the man in the painting pushed down on him to the point where it seemed he couldn't take it anymore, and would be forced to his knees, forced to capitulate, forced to offer worship!</p><br/><p>With every step that he took back, Meng Hao roared. Finally, after seven steps had been taken, and his eyes were completely bloodshot, he forced himself to come to a stop. The price he had to pay was that a cloud of blood sprayed out of his mouth.</p><br/><p>His knees shook so violently they felt like they might break.</p><br/><p>“I can't believe I’m being forced into retreat by nothing more than a painting!” he thought. “Even if the person in that painting was once an almighty figure, perhaps even a Paragon, right now... he’s just a painting. Why the hell... can he force me to fall back!?” Meng Hao struggled to hold his head up, and a vicious expression appeared on his face. Blood oozed out of his eyes, ears, nose, and mouth. However, at the same time, his aura surged mightily.</p><br/><p>“My Dao is that of freedom and independence!” he growled. “Other than my father and mother, there’s nobody in the world... who can make Meng Hao kowtow! Who the hell do you think you are!?” He finished with a roar, and his Allheaven Immortal cultivation base spun rapidly. His only Immortal meridian rapidly expanded, forming the framework of a bridge inside of him!</p><br/><p>He waved his right hand ferociously, and that bridge-like Immortal meridian suddenly erupted with power. Endless rumbling echoed out as it materialized... a real bridge, right in front of him!</p><br/><p>The Paragon Bridge!</p><br/><p>Meng Hao’s Paragon magic was a powerful Dao to begin with. Although its power had seemed rather ordinary early on, that was not because of the magic itself, but rather, because Meng Hao’s cultivation base had not been powerful enough to manifest much of it.</p><br/><p>Now, though, in the Allheaven Immortal Realm, the unleashing of the Paragon Bridge was completely unlike before. Rumbling filled the air as the majestic bridge descended right in front of Meng Hao, causing the sky to vibrate, shattering the land.</p><br/><p>It didn't appear to be illusory, but rather, a true and actual bridge. It was shocking, indescribably large, as if the entire world was but a mere corner of it.</p><br/><p>The bridge filled the sky, sweeping across everything, and it emanated the supreme aura of a Paragon. The world trembled, and the lands were terrified. By using the Allheaven Immortal Realm, Meng Hao had finally... revealed some of its true splendor and power!</p><br/><p>And yet, there was more! Illusory figures appeared atop the bridge. Although it was impossible to see them clearly, they existed on various locations on the bridge.</p><br/><p>These figures radiated terrifying might, and apparently, were people from the past who had qualified to stride upon the Paragon Bridge. Although they did not end up walking across the entire bridge, as former almighty figures in Heaven and Earth, they were able to leave behind some divine will.</p><br/><p>In the same moment that the Paragon Bridge appeared, the black-robed statue in the painting looked at it, and a look of reminiscence appeared on his face. He suddenly murmured... “Heaven Trampling... Bridge....” [1. This footnote contains some spoilers for Renegade Immortal, but they are relevant to the plot of this story. By this point, most Er Gen fans would have put some puzzle pieces together regarding who this person probably is, or at least, who he is connected to. Long story short is that Wang Lin from Renegade Immortal had a clone (specifically a Slaughter Clone), whose actual name had the Chinese character “slaughter” in it. He reached an extremely high cultivation level in RI, a level called “Heaven Trampling,” which involved nine bridges. If you want further details about cultivation levels in RI, the story of Wang Lin, the story of his clone, etc., please do it in a proper spoiler thread.]</p><br/><p>His voice was filled with the sensation of memories, and yet, the same coldness as before.</p><br/><p>This turn of events caused even Dao-Heaven's face to fill with utter shock. His head jerked up in the middle of his kowtow, an expression of disbelief could be seen on his face. The scroll painting was his, and the Paragon magic was his.</p><br/><p>And yet... even he had never before heard the black-robed figure within speak a single word!</p><br/><p>It was as if the appearance of the Paragon Bridge had provoked some unpredictable transformation. Even as Dao-Heaven’s heart trembled, Meng Hao’s mind began to spin.</p><br/><p>“Heaven Trampling Bridge?” he thought, staring at his own Paragon Bridge.</p><br/><p>Shockingly, the black-robed statue in the painting suddenly rose to his feet and took a step forward, his long hair trailing behind him.</p><br/><p>When he took that step, Dao-Heaven’s heart trembled. Meng Hao was standing directly in his path, and could see things even more clearly. It was as if the step he took contained some type of Dao, something that could bend space and shrink a huge span to the distance of an inch, something that could create something from nothing. With that step, he emerged from the painting, entered reality and appeared... on top of Meng Hao’s Paragon Bridge.</p><br/><p>Meng Hao’s mind spun as he looked at the black-robed figure standing atop the Paragon Bridge. The young man’s expression was cold, but it was also tinged with reminiscence. He began to walk across the Heaven Trampling Bridge, step after step, passing numerous other figures, as if he wished to walk the bridge to its very end.</p><br/><p>But then he stopped walking. He looked down at the bridge beneath his feet, and seemed to grow melancholic.</p><br/><p>“This Heaven Trampling Bridge is incomplete....” he murmured.</p><br/><p>“I... am also incomplete....</p><br/><p>“That year... I stood in front of him, and her, my mission accomplished. Then I turned, heart filled with a strange pain, with sorrow, and I vanished....</p><br/><p>“So why...? Why am I still here...?” Then he began to laugh, a laughter filled with icy coldness, and a murderous aura.</p><br/><p>“I loved her more than you did!!” Laughing maniacally, the black-robed figure swished his sleeve. Rumbling could be heard as the Paragon Bridge collapsed. As it did, the black-robed figure trembled and faded away along with the Heaven Trampling Bridge, his expression one of reminiscence and pain.</p><br/><p>When he reappeared, he was back inside the scroll painting, a statue once again, his head bowed.</p><br/><p>When that happened, Dao-Heaven made a gurgling sound and vomited a mouthful of blood. A mist of blood exploded around him; apparently, the scroll painting possessed a gravitational force that absorbed nearly half of his life force. Dao-Heaven trembled, and his face went pale white.</p><br/><p>He had used this Paragon magic on many occasions, but never had it resulted in a backlash like just now.</p><br/><p>Meng Hao also coughed up a mouthful of blood and fell back. He could sense that his time as an Allheaven Immortal was reaching its conclusion. Eyes glittering, he reached up and patted the top of his head, voluntarily leaving the Allheaven Immortal Realm. The Nirvana Fruit emerged from his forehead and dropped down into the palm of his hand. His aura dropped, and his face turned ashen. He stood there, unmoving, staring coldly at Dao-Heaven.</p><br/><p>“Still wanna keep fighting?” he said calmly.</p><br/><p>Dao-Heaven panted as the scroll painting faded away. Then he looked over at Meng Hao, smiled coldly, and said, “What, are you scared? You're beyond weak now! I could kill you as easily as turning over my hand!”</p><br/><p>Inwardly, though, he was hesitant. He still wasn't completely sure whether or not Meng Hao could continue fighting in that incredibly powerful state.</p><br/><p>Hundreds of thoughts ran through Meng Hao’s head. Originally, his plan was to try to intimidate Dao-Heaven through his calmness. But then, he realized something, and came up with a new plan. Frowning, he looked over at Dao-Heaven and then held his Nirvana Fruit fruit out in the palm of his hand, where it glittered with brilliant light.</p><br/><p>“To kill you would cost me quite a bit,” he said. “I would end up heavily injuring myself, which would make it a lot harder to get anything more out of the Windswept Realm.</p><br/><p>“However, if you’re intent on dying, then I can help you reach your goal.”</p><br/><p>Dao-Heaven’s eyes went wide as he looked at Meng Hao. Had Meng Hao remained calm, he would immediately have assumed he was trying to pull a fast one. However, to see Meng Hao frown the way he did made it seem like he was making this decision because he had no other choice. Suddenly, Dao-Heaven wasn’t quite sure what was the truth.</p><br/><p>“I’ll know for sure if I just attack him!” he thought. Eyes flickering, he shot toward Meng Hao.</p><br/>\n</div>"}