{"title": "Chapter 1123: Dao-Heaven Retreats!", "id": 1123, "volume": 12, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-1123-dao-heaven-retreats", "volume_title": "Volume 12", "body": "<h1>Chapter 1123: Dao-Heaven Retreats!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 1123: Dao-Heaven Retreats!</strong></p><br/><p>Almost in the exact moment that the murderous thoughts rose up in Dao-Heaven’s mind, he shot forward. Meng Hao snorted coldly and suddenly backed up. At the same time, he decisively pushed the Nirvana Fruit down into his forehead. Simultaneously, intense killing intent flickered up in his eyes.</p><br/><p>His cold gaze locked onto Dao-Heaven in the same way it might look at a corpse.</p><br/><p>Rumbling sounds could be heard as the Nirvana Fruit merged into his forehead. His energy immediately shot up. This time, the effect was different than before. He wasn't immobilized as his body grew larger. Azure light flickered into being around him, and he performed an incantation gesture with his right hand. Then he waved his hand at Dao-Heaven, causing the Essence of Divine Flame to erupt out, which filled the sky.</p><br/><p>Dao-Heaven’s heart trembled, and he suddenly lurched to a stop before shooting backward. As it turned out, he didn't actually want to keep fighting Meng Hao to the death. He didn't even want to fight at all. The backlash from his Paragon Painting had left him extremely weak. Most importantly... he wasn’t confident in being able to take Meng Hao out right now.</p><br/><p>Seeing Meng Hao once again enter that terrifying state confirmed... that Meng Hao was capable of killing him.</p><br/><p>“This magic of his has a set time limit, or maybe it’s limited in the number of times he can use it. Well, whatever the limitations are, he’ll still have to pay a price to use it.... That was something he wasn’t lying about!</p><br/><p>“Even if he did kill me, he couldn't kill my soul; I still have lives left. And actually, the Windswept Realm trial by fire isn't over yet. If we both get severely injured... not only would other Echelon cultivators try to take advantage of the situation, we might lose our chance at getting more good fortune from the Windswept Realm!</p><br/><p>“Besides, there’s no saying whether or not he could actually kill me in the final battle. Conversely, even if I can kill him, then I would likewise be devastated, and wouldn't be able to recover quickly or easily.” Dao-Heaven had an extremely unsightly expression on his face. If Meng Hao hadn’t struck fear into his heart, he wouldn’t be vacillating in such a way. But now, the facts were out in the open, and he had no choice but to consider the consequences of them inflicting serious injuries on each other.</p><br/><p>As he retreated, Meng Hao stood in place. Instead of giving chase, he looked over coldly.</p><br/><p>“Unless you want a fight to the death, don't come looking for me. My patience... has its limits!” Then he took a step forward, stamping his foot onto the ground. The ground quaked and the air vibrated as an incredible power surged up from him. A shockwave blasted out in all directions.</p><br/><p>Dao-Heaven continued to flee. He was still suspicious, but he had no way to tell whether or not Meng Hao was simply putting on a show. It was hard to tell, and he was forced to simply guess.</p><br/><p>His facial expression constantly flickered as he ran through the possibilities in his mind, and his eyes glittered. Finally, he laughed loudly.</p><br/><p>“Are you so anxious to finish our little fight, Meng Hao? There are many paths to follow. If you want to pick this one, who am I to stop you?”</p><br/><p>Meng Hao shook his head. Energy surging, he shot forward, leaving afterimages behind him. He waved his hand, causing Divine Flame to spread out above Dao-Heaven.</p><br/><p>Dao-Heaven’s face fell, and he instantly performed an incantation gesture with his right hand, then waved his finger toward the ground. Black fog roiled up, transforming into a rumbling vortex. A huge hand then stretched up out of the vortex, which pushed out toward the Divine Flame.</p><br/><p>At the moment, raging flames covered Meng Hao’s face, making it so that Dao-Heaven couldn't see his face clearly. All he could see were his cold eyes, flickering with killing intent.</p><br/><p>Meng Hao didn’t pause for even a second. As the Essence of Divine Flame and Dao-Heaven’s magical technique slammed into each other, he strode forward and said, “God Slaying!”</p><br/><p>His right hand clenched into a fist, seemingly embodying the will and might of Heaven. The qi flow of the Windswept Realm converged, and his Allheaven Immortal cultivation base caused colors to flash and the wind to scream.</p><br/><p>Dao-Heaven's face fell as he continued to retreat, performing a double-handed incantation gesture. A portal suddenly appeared, which slammed open to reveal nine Bone Dragons. Roaring, they flew out of the portal toward Meng Hao, surging with energy.</p><br/><p>ROOOOOAAAARRRRRRRRRRRR!</p><br/><p>Meng Hao's fist caused the world to shatter. The nine Bone Dragons let out plaintive shrieks as they were shattered into tiny pieces. Dao-Heaven took a deep breath, and then flashed through the air, instantly falling back by 3,000 meters. Then he laughed.</p><br/><p>“Meng Hao, fighting like this is meaningless. Since you don't really feel like continuing, then I, Chen, will just take my leave....” Obviously, Dao-Heaven was his Daoist name, whereas his true surname was Chen. With that, Dao-Heaven fled, his expression normal, but his heart filled with vigilance.</p><br/><p>“Based on his personality,” he thought, “if he actually stops fighting because of what I said, then I’ll know he's trying to trick me!” As Dao-Heaven fled, his expression and demeanor made it seem as if he truly wished to get away.</p><br/><p>Meng Hao’s face was covered by the Divine Flame, and as such, Dao-Heaven couldn’t see anything more than Meng Hao’s eyes. Those eyes didn't change at all, and in fact, grew colder than ever. Even as Dao-Heaven attempted to flee, Meng Hao caused the starstone in his eyes to melt, covering his body so that he transformed into a planet!</p><br/><p>It was a planet wreathed in Divine Flame, making it look like a shooting star as it sped after Dao-Heaven.</p><br/><p>Based on its speed and trajectory, it really seemed as if he wanted to catch up.</p><br/><p>Dao-Heaven realized this, and his expression turned dark.</p><br/><p>“So he really does still have enough power to stay in that Realm!!” Even as Meng Hao closed in, Dao-Heaven suddenly increased his speed. In a flash, he was a great distance away.</p><br/><p>“Meng Hao,” he called behind him, “have you met a girl named Xue’er yet?</p><br/><p>“If not, I should really leave you alive so that you have a chance to meet her!</p><br/><p>“Next time we run into each other, though, that will be the day you die!” Laughing, he shot off with incredible speed.</p><br/><p>“Pipe down!” Meng Hao said from within the planet, his voice echoing out with incredible pressure. He continued to give chase for another several thousand meters. However, considering Dao-Heaven’s incredible speed, soon there was no trace of him. Meng Hao slowly came to a stop. The planet disappeared, and his human form reappeared.</p><br/><p>He looked no different than he usually did. The Nirvana Fruit emerged from his forehead and dropped into his hand. He hovered there in midair, expression cold, looking in the direction Dao-Heaven had fled. Finally, he gave a cold harrumph, turned, and headed off in a different direction.</p><br/><p>He took his time leaving, and as for the direction he chose, it was none other than the Third Nation.</p><br/><p>Not long after he disappeared over the horizon, a strand of black smoke appeared on the battlefield. It swirled together in midair to reveal an illusory image of Dao-Heaven, frowning. As Meng Hao disappeared in the distance, he let out a sigh.</p><br/><p>“So, he wasn't trying to trick me. After fighting me, he actually chose to go to the Third Nation! This Meng Hao... is a formidable opponent.” The illusory figure shook his head, then vanished.</p><br/><p>Meanwhile, Meng Hao was calmly making his way across the border of the Fourth Nation and into the Third Nation.</p><br/><p>As soon as he entered the Third Nation, he staggered to a stop and coughed up eight successive mouthfuls of blood. With each mouthful of blood, his body wasted away by ten percent. After only a few breaths of time had passed, he was so skinny that he looked like nothing more than a bag of bones. His hair had even turned completely gray.</p><br/><p>His expression lackluster, he very nearly fell down to the ground. As he stood there, he smiled bitterly.</p><br/><p>He actually had tricked Dao-Heaven. His final decision to enter the Allheaven Immortal Realm came at the price of burning his life force almost to the very limit. In fact, he couldn't have proceeded much further even if he wanted to.</p><br/><p>It was only when he reached this point, and was behind the barrier between nations, a place where Dao-Heaven wouldn’t be able to observe him, that he allowed himself to weaken rapidly. As the blood sprayed out of his mouth, he grew weaker and weaker.</p><br/><p>“This Dao-Heaven is incredibly powerful!” he murmured. The reason he had covered his face with the Essence of Divine Flame earlier was because he didn’t want Dao-Heaven to realize that he was burning his life force. It was for the same reason that he chose to use the One Thought Stellar Transformation to become a planet in the final chase.</p><br/><p>Furthermore, the reason he chose to come to the Third Nation was that, according to his analysis of the situation, the fact that Dao-Heaven had avoided the Third Nation on multiple occasions made it obvious that something was fishy. Picking the Third Nation made it seem like he was far stronger than he actually was.</p><br/><p>Fooling Dao-Heaven was not an easy thing. He was incredibly devious and suspicious, and made numerous probing attempts to find out if Meng Hao was trying to trick him. To Meng Hao, it was like walking along the edge of a cliff. Even the slightest misstep could have left him in grave danger.</p><br/><p>“What a pity.... If I could fully absorb the second Nirvana Fruit, and truly step into the Allheaven Immortal Realm, then I could definitely kill Dao-Heaven. Right now, though... I’m not a match for him.” Meng Hao frowned. He had to admit that in all the years he had practiced cultivation, and among all the countless Chosen he had encountered, because of all the good fortune he had encountered, there was no one in his generation who was a match for him. He was even capable of sweeping over the Echelon.</p><br/><p>Except for the Echelon cultivator from the First Mountain, Dao-Heaven. He was a truly formidable opponent!</p><br/><p>After all, although Meng Hao had practiced cultivation for a much shorter time than Dao-Heaven, who had deep and profound resources at his disposal, Meng Hao also had significant good fortune, and was far beyond ordinary. Anyone who got into the Echelon was by default an extraordinary person.</p><br/><p>Also, anyone who had a chance of being acknowledged by Xue’er, the successor of Immortal Ancient, could by no means be a weakling.</p><br/><p>Meng Hao’s eyes flickered, and he produced some medicinal pills to consume. After a moment, his eyes widened as he suddenly realized something.</p><br/><p>“How come I didn't feel any pressure after entering the Third Nation?” Before, every time he passed through border barrier from one nation to another, there would always be pressure weighing down. The only time it hadn’t happened was here in the Third Nation.</p><br/><p>“Dao-Heaven always seemed to avoid the Third Nation....</p><br/><p>“There must be some mysterious secret about this place.</p><br/><p>“However, that’s a good thing for me, since I’ll be able to focus fully on healing myself. Although, I don’t want to stay here for too long. Once I've recovered a bit, I’ll head back to the Ninth Nation.” He flew onward, and before long reached a mountain range, where he found a remote cave. After settling down to meditate, he sealed the cave mouth.</p><br/><p>However, in almost the same moment that he began to meditate, his eyes snapped open. A brilliant red light had just begun to shine up from the blood-colored mask inside his bag of holding. Even the bag of holding was incapable of covering it up.</p><br/><p>Simultaneously, Meng Hao could sense the aura of the Blood Mastiff. It had been years since the Blood Mastiff had dissipated in the midst of protecting him. Although he had sensed signs that it might awaken on numerous occasions, this was the strongest by far.</p><br/><p>Meng Hao was delighted, and immediately took the blood-colored mask out of his bag of holding and sent some divine sense into it. As soon as he felt the Blood Mastiff, he realized that a connection and resonance had sprung up between them.</p><br/><p>There was an aura of blood in the area, which was incredibly enticing to the Blood Mastiff. It filled it with desire and was the main reason why it was now waking up.</p><br/><p>That blood was coming from the earth! From deep within the earth!</p><br/>\n</div>"}