{"title": "Chapter 1125: Take Its Place!", "id": 1125, "volume": 12, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-1125-take-its-place", "volume_title": "Volume 12", "body": "<h1>Chapter 1125: Take Its Place!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 1125: Take Its Place!</strong></p><br/><p>“Renegade spirit....” It was a term Meng Hao wasn't familiar with. But from the way the parrot said it, it sounded like something that had a long, complicated history.</p><br/><p>The meat jelly looked confused at first, but after a moment appeared to have recalled something, and it started to shake.</p><br/><p>At the same time, the Blood Mastiff, who was still in his bag of holding, inside the blood-colored mask, began to struggle with an even stronger thirst, as if... it wanted to consume that blood-colored bat!!</p><br/><p>Meng Hao’s face flickered as he retracted his divine sense from the necropolis. He sat there in the Immortal’s cave, lost in thought and hesitation. However, inside the blood-colored mask, the Blood Mastiff was emanating an intense thirst that seemed to be reaching a peak.</p><br/><p>“So you want to eat it, huh...?” Meng Hao murmured. He suddenly clenched his teeth. If he wanted his cultivation base restored to its peak, it would take over a month, even with the combination of medicinal pills and his Eternal stratum.</p><br/><p>However, too many things could happen in a month. There were strange goings-on in the Third Nation, and he had no desire to stay here any longer than necessary.</p><br/><p>“Well, I'm going to help you!” The mastiff occupied a special place in his heart. He would never forget the first time he had laid eyes on it, how small it had been, and how attached it was to him. He had raised it from when it was tiny, and in the Blood Immortal Legacy Tournament, it had protected him, and had even died for him, without the slightest hesitation. In its final moments, it had merely turned back for a moment in an attempt to lick his face, as doing so one more time would make it completely content.</p><br/><p>Images from the past rose up in his mind. How could Meng Hao ever forget his loyal mastiff!?</p><br/><p>As soon as he made his decision, the parrot looked at him in shock.</p><br/><p>“Are you crazy!?!?” the parrot squawked. “That’s a renegade spirit, a mysterious entity of Heaven and Earth. It looks like this particular renegade spirit is dead, but it’s definitely something that you and the mastiff are no match for!”</p><br/><p>“These people of the Windswept Realm can use this renegade spirit,” Meng Hao replied. “Well... why can’t I?” Without any further hesitation, he stamped his foot on the ground and began to sink down into the earth.</p><br/><p>The parrot let out another squawk and, seemingly throwing caution to the wind, followed Meng Hao. The meat jelly blinked, and then also followed along.</p><br/><p>“Dammit, possess a renegade spirit?” the parrot muttered. “Consume it? Take its place...? Crazy! Meng Hao, you’re crazy! That mastiff is crazy too! Well, fudge! Lord Fifth is also crazy!”</p><br/><p>As the meat jelly followed along, it also yelled, “Lord Third is crazy too!”</p><br/><p>Meng Hao sank down into the ground, heading in the direction he had probed earlier with divine sense.</p><br/><p>Meanwhile, out in the Third Nation, the man in the Imperial robes sat cross-legged on the National Aura Mountain. All of a sudden, his eyes snapped open. He shot to his feet, his expression one of shock, disbelief, and then rage.</p><br/><p>“Dammit!! The renegade spirit’s blood burial site has a spell formation that obscures divine sense. The secret entrance wouldn't even be visible to someone in the Dao Realm. This Meng Hao... how did he discover it!!?”</p><br/><p>The man's face flickered, and without realizing it, he began to take a step forward. However, in almost the same moment, he stopped in place, eyes fixed on the crystal ball. His expression darkened.</p><br/><p>“Kill him and bring me his head,” he ordered coldly. “Investigate how exactly he was able to see through to the blood burial site!”</p><br/><p>In response to his orders, seventeen or so black-robed men appeared nearby, all of whom clasped hands and said, “For the true Dao!”</p><br/><p>With that, they turned and disappeared.</p><br/><p>Down below the lands of the Third Nation, Meng Hao sped along, his expression ruthless, his eyes swirling with killing intent. He wasn’t fully recovered from his injuries, but he could unleash about sixty to seventy percent of his cultivation base. Bursting with explosive speed, he went deeper and deeper.</p><br/><p>Everything was pitch black, and there was no path that could be seen. Even sending out his divine sense, he saw nothing. Soon, he reached the location he had seen with the help of the parrot and meat jelly. He came to a stop.</p><br/><p>“It should be around here....” he thought, eyes flickering. He looked over at the parrot, who muttered to itself for a moment before shining with radiant, multi-colored light that spread out in all directions. There up ahead, Meng Hao’s could finally see the necropolis in his divine sense.</p><br/><p>He looked at it and gritted his teeth. He knew that there was something strange going on in the Third Nation, and he was well-aware that his cultivation base had not yet been restored to its peak. Therefore, if he was going to fight... he needed to do it decisively.</p><br/><p>He shot forward, causing muffled rumbling sounds to echo out underneath the lands. He pierced through the soil like an arrow, and when he emerged, he found that he wasn't inside the necropolis, but rather, had just slammed into a huge, invisible barrier.</p><br/><p>The moment his body slammed into it, a backlash attack hit him, and blood oozed out of his mouth. He backed up, and everything began to shake. Cracks spread out on the surface of the barrier.</p><br/><p>At the same time, the cultivators inside the necropolis all heard the rumbling sounds, and could sense the trembling. They clustered around the blood pits, and the ones slashing their arms to pour out blood all looked up with expressions of shock.</p><br/><p>Simultaneously, the dozens of black-robed cultivators with obscured faces, the ones standing guard, all rose to their feet and looked in the direction from which the sound echoed.</p><br/><p>Outside of the necropolis, Meng Hao bellowed: “Parrot!”</p><br/><p>The parrot seemed conflicted about what to do for a moment, but then it squawked and caused the light shining off of it to speed toward the barrier.</p><br/><p>“Listen to Lord Fifth and OPEN UP!” it roared. The multi-colored light slammed into the barrier, instantly opening up a hole. Without the slightest hesitation, Meng Hao shot through the hole, stepping right into... the necropolis!</p><br/><p>Everything happened incredibly quickly, which was how Meng Hao preferred to do things, to fight with decisiveness. Almost as soon as he entered the necropolis, cold snorts echoed out, and dozens of black-robed men flew into the air. All of them emanated the fluctuations of Ancient Realm cultivation bases. Their energy surged, and they joined forces in a unified attack, which sped through the air toward Meng Hao.</p><br/><p>Almost as soon as Meng Hao began to charge forward, his face fell. “Dammit,” he thought, “the Windswept Realm isn't limited to the Immortal Realm after all! Where did all these Ancient Realm cultivators come from!?!?”</p><br/><p>He waved his right hand, sending the Essence of Divine Flame roaring out toward the dozens of black-robed cultivators.</p><br/><p>A boom rang out, and blood oozed from Meng Hao’s mouth as he backed up. The dozens of black-robed cultivators also backed up a bit, but it only took a moment for them to once again close in.</p><br/><p>Divine abilities and magical techniques blazed to life, joining together and then smashing toward Meng Hao.</p><br/><p>Meng Hao’s eyes glittered as the Lightning Cauldron appeared. Thunder cracked, and electricity danced, but unfortunately, the transpositioning function didn’t work. Meng Hao’s heart sank. Putting the Lightning Cauldron away, he didn't hesitate any longer to stride forward and meet the incoming cultivators in battle.</p><br/><p>“Screw off!” he roared, relying on the strength of his fleshly body to fight back against the divine abilities and magical techniques. He was like an explosive dragon, battering ahead, his right hand utilizing the Life-Extermination Fist, his left hand the Bedevilment Fist. Both fists struck out with mad, explosive power. Seven black-robed cultivators were blasted aside, blood spraying out of their mouths. Meng Hao shot like lightning toward the region with the blood pits.</p><br/><p>“Halt!” a cold voice cried. The dozens of the black-robed cultivators once again moved to block Meng Hao's path. Three of them waved their hands and, shockingly, Sea Dragons appeared, which roared toward Meng Hao.</p><br/><p>“Daoist Magic of the Nine Seas God World !” Meng Hao’s eyes widened as he looked over at the black-robed men. Then he snorted coldly, performed an incantation gesture, and pointed out with his finger. Numerous mountains descended, linking together into a mountain range that smashed down toward the men. At the same time, he shot onward, getting closer to the blood pits. By this point he was about 300 meters away.</p><br/><p>The entire necropolis trembled, and quite a few of the black-robed men coughed up blood. However, they continued to seek to block Meng Hao, almost as if they were deranged.</p><br/><p>This time, they all performed the same incantation gesture, unleashing a bizarre magical technique.</p><br/><p>“True Dao Advent!” As soon as the words left their mouths, a bizarre power of natural law sprang up. It transformed into a huge net-like cage that enveloped the surrounding area. Even as it sought to blanket Meng Hao, his face flickered and he transformed into a golden roc. As the net of natural law neared, he suddenly shot forward and slammed into the chest one of the black-robed men. A boom could be heard as the man exploded into bits. After shooting onward by about 150 meters, he returned to human form, lifted his right hand, and jabbed a finger at them.</p><br/><p>Eighth Demon Sealing Hex!</p><br/><p>This time, what he was hexing was not a single person, but rather, a whole group of people, plus the net of natural law which was descending down onto him.</p><br/><p>With the wave of a finger, all of the black-robed men felt themselves shudder to a stop. The huge net also stopped in place. However, Meng Hao had to pay a heavy price; he coughed up a huge mouthful of blood. Nonetheless, he didn't stop for even a moment, closing the remaining 150 meters in a flash, appearing next to one of the blood pits.</p><br/><p>He waved his hand toward the air above the blood pit, and all of a sudden, all of the blood in the pit rose up and showered out in all directions. There at the bottom of the pit, an old man could now be seen.</p><br/><p>Moments ago, he had been submerged in the blood, absorbing it, but now that he had been interrupted, he opened his eyes. Previously, his cultivation base had been at the Cauldron Seeking stage. However, as of this moment it was clear that it was climbing up. Now... he was in the Immortal Realm, despite the lack of any Door of Immortality appearing.</p><br/><p>The old man let out a shout, and was about to start fighting Meng Hao, when Meng Hao snorted coldly. His right hand shot out with lightning speed in a clawing gesture, latching onto the man’s arm and squeezing down hard. Cracking sounds were joined by a bloodcurdling scream as all the bones in the man’s body were shattered. In the same moment, Meng Hao disappeared into the eyelet at the bottom of the pit.</p><br/><p>As soon as he disappeared, booms filled the air, and countless divine abilities and Daoist magics slammed into the spot he had just occupied. The black-robed men surged with energy and began to speed over from all directions.</p><br/><p>Meng Hao didn't wait for them to show up. He immediately transformed into a beam of light that shot through the eyelet, and then into the tunnel that led to the secret chamber below.</p><br/><p>In almost that same instant, brilliant light filled the necropolis. The dozens of black-robed men exchanged glances, then transformed into beams of light that followed Meng Hao down into the blood pit and beyond.</p><br/>\n</div>"}