{"title": "Chapter 1137: Drastic Upheavals!", "id": 1137, "volume": 12, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-1137-drastic-upheavals", "volume_title": "Volume 12", "body": "<h1>Chapter 1137: Drastic Upheavals!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 1137: Drastic Upheavals!</strong></p><br/><p>Meng Hao’s eyes flickered. He could sense some sort of indescribably malevolent aura coming from the earthenware pot, as if it contained the willpower of all of the life forms in the Windswept Realm.</p><br/><p>A sound like that of infinite screaming rippled out from the blood in all directions, causing the sky to flash, and the nine pillars of light rising up from the Nine Nations to dim slightly. Even the nine vortexes up in the sky seemed to be affected, and looked as though they might stop spinning!</p><br/><p>Rumbling could be heard, and the Emperor was laughing maniacally. After having thrown the earthenware pot down, it smashed, sending blood splashing out in all directions. The intangible howling grew more intense, transforming into ripples that spread out everywhere, covering the entire Windswept Realm, twisting it, distorting it.</p><br/><p>Meng Hao was panting. Drastic upheavals were rocking the Windswept Realm, and although he had prepared himself mentally, to see these things happening in front of his very eyes was a shocking thing.</p><br/><p>The other cultivators from the Mountain and Sea Realm all had looks of complete astonishment on their faces.</p><br/><p>The earthenware pot smashed, and blood splashed out in all directions. The fierce fighting of the Nine Nations’ armies had long since stained the earth red, but as this additional flow of blood spread out without soaking into the ground, and everything it touched became even more deeply crimson.</p><br/><p>“Living things, Heaven and Earth, mountains and rivers, wind and clouds... by the power in me, I summon you!” As the emperor’s shrill cry echoed out in all directions, the blood from the earthenware pot began to writhe, as if it were alive.</p><br/><p>It was as if there was something concealed inside that blood which had now been issued a call. It was like a key that could unlock the door to these blood-colored lands!</p><br/><p>The ground in the central temple area was shaking violently. Next, a massive amount of blood began to rise up from in the land, as if it were being called, directed.</p><br/><p>A massive rumbling could be heard, as though countless fierce voices were crying out. More blood gushed up out of the lands, transforming everything into a world of blood.</p><br/><p>The cultivators from the Mountain and Sea Realm, including Fan Dong’er, were all completely shocked, and had no idea what was happening.</p><br/><p>“Windswept blood. Heavenly tears. I call upon you to awaken from your sleep of death!” The Emperor bit the tip of his tongue and spit out a mouthful of blood. His hair was disheveled, and he looked crazed.</p><br/><p>Rumbling could be heard as the ground trembled with increased intensity. Meng Hao flashed through the air, giving up on pursuing Dao-Heaven and heading directly toward the Emperor. He had the sudden intense premonition that if things proceeded as they were, a great catastrophe would strike.</p><br/><p>Almost in the same moment that Meng Hao began to charge toward the emperor, Zong Wuya sighed and stepped forward, reaching out with his hand to block the path.</p><br/><p>“Meng Hao, you can’t stop this from happening. Just watch.”</p><br/><p>Meng Hao shoved Zong Wuya out of the way, causing a massive wind to kick up. And yet, he was incapable of doing anything to stop the rising blood.</p><br/><p>“You intentionally let me live. Why?!” Meng Hao performed an incantation gesture with his right hand, causing azure light to shine out from him. Instantly, numerous mountains began to descend, the result of the Mountain Consuming Incantation. These were not ordinary mountain ranges, but rather countless azure-colored mountains, Immortal mountains, which smashed down with shocking power.</p><br/><p>“I already know what decision you have made,” Zong Wuya said softly. “And you know mine. As for who is wrong and who is right, we’ll just have to see.... Time will answer all questions.” He performed an incantation gesture with his right hand and waved his finger. Instantly, his extinguished Soul Lamps expanded and shot up to meet the azure Immortal mountains. A huge boom echoed out, and he fell back a few paces, trembling.</p><br/><p>“As for why I let you live... it was because... I hope that if I’m wrong, you can help me accomplish something.” His eyes were once again filled with a look of reminiscence, and complex emotions. He sighed again.</p><br/><p>Meng Hao was also forced into retreat by the backlash. He looked up at Zong Wuya, and saw the look in the man's eyes, whereupon he fell silent.</p><br/><p>More and more blood flowed out. In the blink of an eye, everything was covered, making the area a river of blood. Rumbling sounds could be heard, and Meng Hao’s eyes went wide. Off to the side, Dao-Heaven looked astonished, but took advantage of what was happening to retreat.</p><br/><p>“Come forth, Windswept blood!” the Emperor cried. His right hand suddenly shot up, and he stabbed his fingers into his own eye. The moment his finger pierced it, the sky filled with crackling lightning.</p><br/><p>The blood that covered the lands was boiling, and continued to bubble up from the depths of the earth. The river of blood was now turning into a sea of blood!</p><br/><p>In the blink of an eye, all the lands were covered with endless amounts of blood. Even the nine pagodas that represented the Nine Nations were in danger of being covered.</p><br/><p>This was the blood spilled by the countless soldiers who had died fighting.</p><br/><p>“Windswept spirit, unleash the countless years of rancor, form it into your heroes....” He threw his head back and roared, lifting both hands into the air for a moment before shoving them down violently toward the ground.</p><br/><p>The rancor caused the lands to tremble. The sea of blood roared, and then began to congeal into one figure after another. In the blink of an eye, there were too many to count. After appearing, they let out intense roars, and then stared with blood-red eyes at Meng Hao and Dao-Heaven, as well as all the other shocked cultivators from the Mountain and Sea Realm.</p><br/><p>It was an animosity that had been suppressed for far too many years, a hatred that sank deep into the bones, permeated the blood. It had built up for generation after generation, until it became a storm.</p><br/><p>“Activate the Nine Blood Formation!” the emperor roared hoarsely. He lifted his right foot up and then stamped viciously down toward the sea of blood. A boom rang out, and the figures congealing from the blood began to speed toward the nine pagodas, howling all the way.</p><br/><p>Everyone watched as the blood-colored figures slammed into the pagodas and then completely vanished, having been absorbed by the pagodas, which then transformed into the color of blood.</p><br/><p>The blood that remained on the ground continued to flow into the pagodas, which apparently possessed some shocking gravitational force. It only took a few moments for all the blood to be drained away.</p><br/><p>The nine pagodas, having absorbed the sea of blood and the blood figures, were now crimson red and glittering brightly. At this point, nine blood-colored beams of light suddenly shot up from the nine pagodas.</p><br/><p>They sped up toward the Heavens, piercing through the clouds to form... nine blood-colored vortexes!</p><br/><p>Upon close examination, it was possible to see countless blood-colored figures inside of the vortexes, speeding about as if they were running!</p><br/><p>The nine pagodas were not very far away from each other, and thus, neither were the nine pillars of light. Furthermore, the nine vortexes up above were also very close to each other. As they grew, they merged together, forming... one enormous vortex!</p><br/><p>The cultivators from the Mountain and Sea Realm were shocked by all of this. A moment later, the shocking blood-colored vortex filled the sky with rumbling sounds, causing the lands below to quake.</p><br/><p>The pillars of light from the Nine Nations had been preventing the Windswept Realm from rising up, but the appearance of the blood-colored vortex instantly shattered the stalemate that they had caused. As it spun, the previously motionless lands trembled, then once again... began to ascend!!</p><br/><p>From outside in the void, it would be possible to see the entire Windswept Realm suddenly rising up rapidly through the void.</p><br/><p>“Defile the National Aura Mountains!” the emperor howled, stabbing his fingers into his other eye, leaving himself completely blind. The only thing that remained of his eyes were gaping holes flowing with blood. At the same time, ear-splitting laughter rang out.</p><br/><p>Simultaneously, the cultivators in all of the sects of the Windswept Realm’s Nine Nations began to tremble, almost as if they were awakening from a dream. Their expressions turned fanatical, and they began to call out with loud voices.</p><br/><p>“For freedom!!”</p><br/><p>“For freedom!!”</p><br/><p>“For freedom!!”</p><br/><p>From the First Nation to the Second Nation... in all Nine Nations, in all of the various sects, the same words echoed out to fill the world.</p><br/><p>At the same time, the cultivators of the Windswept Realm suddenly smashed their right hands onto the tops of their heads. Echoing like that of thunder could be heard. Blood sprayed out of their mouths, and they swayed unsteadily, faces ashen. There were even some who directly dropped dead.</p><br/><p>When the blood sprayed from their mouths like fountains, it flew up into the air and then sped toward the rubble of the nearest… of the National Aura Mountains!</p><br/><p>Instantly, the shattered National Aura Mountains were faced with numerous streams of blood, flying toward them at top speed.</p><br/><p>The blood was being used to defile the beams of light!</p><br/><p>The lands quaked, and the sky turned the color of blood. Dark clouds roiled, and of the beams of light rising up from the Nine Nations, one was instantly snuffed out. Then a second, a third, and a fourth....</p><br/><p>In the space of a few breaths, all of the beams of light were extinguished!</p><br/><p>When that happened, the vortexes they had created vanished, leaving only one thing remaining in the sky... the lone blood-colored vortex rising from the central temple district!</p><br/><p>Rumbling echoed out as the lands of the Windswept Realm picked up speed. From out in the void, it was possible to see the lands rising up rapidly.</p><br/><p>Because of the incredible speed, mountains and rivers collapsed, and the land quaked violently. Cities crumbled, and all the cultivators, including Meng Hao and the others from the Mountain and Sea Realm, felt incredible pressure, as if huge hands were pushing down onto them.</p><br/><p>Fan Dong’er and the others coughed up mouthfuls of blood, and looks of astonishment could be seen on their faces.</p><br/><p>Even Dao-Heaven was shaken inwardly. He fell back a bit, although he didn't flee. He had the feeling that the drastic upheavals facing the Windswept Realm... were reaching a climax.</p><br/>\n</div>"}