{"title": "Chapter 1148: You Killed My Son, Prepare To Die!", "id": 1148, "volume": 12, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-1148-you-killed-my-son-prepare-to-die", "volume_title": "Volume 12", "body": "<h1>Chapter 1148: You Killed My Son, Prepare To Die!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong></strong></p><br/><p>[/expand]</p><br/><p>Meng Hao’s eyes were bright red. Although the Traitorous Sutra of the Rebel Dao filled him with an intense, indescribable thirst… he had no way to get it!</p><br/><p>He was incapable of flying, and it wasn’t just him. Dao-Heaven and the other Echelon cultivators, as well as everyone else from the Mountain and Sea Realm, were all similarly stuck. The Windswept Realm was now completely different than before, and all of them were feeling an incredible force of expulsion that made it almost impossible for them to move.</p><br/><p>Meng Hao let out a growling shout. He wanted to charge forth, to grab that black beam of light, and thus, the Traitorous Sutra of the Rebel Dao. Unfortunately, he couldn’t.</p><br/><p>All he could do was look at the huge net out in the void, and the rapidly expanding black hole into which the Windswept Realm was slowly moving.</p><br/><p>There was nothing he could do to stop what was happening, nor any way for him to get the Sutra. In fact, outside of the Windswept Realm, Paragon Sea Dream trembled. She was no longer fighting the Windswept Imperial Lord. He had turned, blood spurting out of various wounds as he fled toward the Windswept Realm. Then, he flew under it and pushed up.</p><br/><p>Rumbling could be heard as more of the Windswept Realm was almost completely swallowed up by the black hole!</p><br/><p>Paragon Sea Dream sighed, and then waved a finger through the air. Immediately, a white stream of light flew out toward the Windswept Realm. It stabbed through the blackness of the Windswept Realm and then split apart, eventually landing on Meng Hao and all the other cultivators from the Mountain and Sea Realm. It even spread out through the Nine Nations to find the cultivators who hadn’t participated in the war.</p><br/><p>One of those beams of light shot into a valley in the Ninth Nation, where a young woman currently sat ashen-faced, sweat dripping down her forehead. From the look of it, she was at a critical juncture in her cultivation, but was being interrupted by the expulsion pressure from the Windswept Realm. As a result, she was incapable of moving. That woman was none other than... Chu Yuyan!</p><br/><p>Chu Yuyan had originally been with Meng Hao on the Ninth Nation’s National Aura Mountain. However, after being freed from his bag of holding, she had chosen not to stay on the mountain. As soon as Meng Hao begun to contemplate enlightenment of the World Seal, she had quietly left.</p><br/><p>She had her pride, and it wouldn’t let her stick around with Meng Hao like someone who needed protection. Thus, she had departed. Eventually, she had found a valley in the mountains of the Ninth Nation where she quietly began to meditate and attempt to achieve a cultivation base breakthrough, to finally ascend from the Spirit Realm into the Immortal Realm.</p><br/><p>And now, the white light from Paragon Sea Dream flew down and covered her.</p><br/><p>Suddenly, Paragon Sea Dream’s voice echoed in their ears: “All of you, listen to me. Your trials by fire are over. Your excursion into the Windswept Realm has concluded. Nothing can be done to change how things are playing out. Someone went so far as to use the Traitorous Sutra of the Rebel Dao to leave the Immortal World.... The 3,000 Lower Realms of the past did exactly the same thing.</p><br/><p>“Oh well, I guess that’s the end of it....” By the end, Paragon Sea Dream was muttering softly and sounded very disheartened. She made a grasping gesture, and all of the people who were touched by her light began to rise up into the air. Apparently, she was pulling them out of the Windswept Realm before it entered the 33 Heavens, and was going to return everyone to the Mountain and Sea Realm.</p><br/><p>Fan Dong’er and the others were the first to fly up into the air, followed by Lin Cong, Han Qinglei, Yuwen Jian and Dao-Heaven.</p><br/><p>Then there was Meng Hao. He slowly rose up into the air, and was soon on the verge of being pulled out of the Windswept Realm altogether. However, his gaze was fixed on the black beam of light, which was just about to fully enter the black hole. At that point, the thirst inside him turned ravenous.</p><br/><p>“The Windswept Realm excursion... is over...? My blood is boiling! The Traitorous Sutra of the Rebel Dao can help me fuse my third Nirvana Fruit, and it’s right there in front of me. Is it really... not connected to me by destiny?” Meng Hao couldn’t accept it, and yet had no other options. The expulsion power of the Windswept Realm was too strong, and the pillar of light was actually the source of that power. It was pushing him away so forcefully that he couldn’t even approach it.</p><br/><p>Furthermore, Paragon Sea Dream was pulling him inexorably away, placing him further and further away from the black pillar of light.</p><br/><p>He roared inwardly, his eyes bloodshot as he unleashed all of the power of his cultivation base. Azure light surged out, and blood spurted out of his wounds. Cracking sounds could be heard as injuries were inflicted, all to prevent himself from getting any further away.</p><br/><p>However, it was too hard, and he couldn’t quite manage to take a step forward toward the Traitorous Sutra of the Rebel Dao.</p><br/><p>It was at this point that, all of a sudden, Dao-Heaven roared, “Meng Hao... let me help you!”</p><br/><p>He was also being slowly pulled away by Paragon Sea Dream, but when he saw the look on Meng Hao’s face, he performed a double-handed incantation gesture, causing his cultivation base to erupt with power. He even burned some of his life force as he waved his finger toward Meng Hao, causing an intangible force to slam into him. It was an attack that propelled Meng Hao forward, blood spraying out of his mouth. Instantly, he flew forward several dozen meters, pushing him a bit closer to the Traitorous Sutra of the Rebel Dao.</p><br/><p>“Meng Hao, I'm gonna help you too!” shouted Lin Cong.</p><br/><p>“Me too!” cried Han Qinglei.</p><br/><p>“Brother Meng Hao, let me help you too!” Yuwen Jian cried.</p><br/><p>Lin Cong threw his head back and roared, waving his hand and causing his cultivation base to ignite. The Underworld appeared, transforming into a force of acceleration that slammed into Meng Hao. Han Qinglei coughed up a mouthful of blood, sustaining a serious injury to summon green lightning; not deadly lightning, but packed with plenty of force.</p><br/><p>Yuwen Jian roared as he grew larger, filling himself with Godly power that he used to unleash ten punches in Meng Hao’s direction. Blood sprayed out of his mouth, but for Meng Hao, he was willing to do this.</p><br/><p>The combined forces of all three Echelon cultivators transformed into an incredible accelerative force that landed on Meng Hao. A boom rang out as he turned into a beam of light that shot directly toward the Traitorous Sutra of the Rebel Dao. However... when he was only about thirty meters away, he slowly came to a stop, and could move no further. Once again, Paragon Sea Dream’s convergence beam began to pull him back.</p><br/><p>“I refuse to accept this!” he roared. Blood oozed out of his eyes, ears, nose, and mouth, and yet, there was nothing he could do.</p><br/><p>It was at this point that Chu Yuyan appeared in the air above the Ninth Nation, floating up in Sea Dream’s light. She instantly caught sight of Meng Hao, and heard his defiant roar.</p><br/><p>Her heart trembled, and she gasped. Then, she bit down on the tip of her tongue and spat out some blood. Gazing deeply at Meng Hao, she waved her hand, causing a crimson medicinal pill to fly out from within her bag of holding. Without the slightest hesitation, she popped it into her mouth.</p><br/><p>She instantly began to tremble, and was soaked with sweat. Her cultivation base erupted with power, and she held nothing back. Blood spurted out, forming a haze around her, and she didn’t hesitate for a moment. She was going to... break through to the Immortal Realm and summon the Door of Immortality!</p><br/><p>This was the only idea she could think of, and her way of trying to help Meng Hao. Although trying to break through to the Immortal Realm here and now was fraught with innumerable uncertainties, and probably mortal danger, Chu Yuyan didn’t worry about any of that.</p><br/><p>Her Cultivation base surged as she rapidly grew closer to the Immortal Realm. She wanted to summon the Door of Immortality because its arrival brought with it a boundless power of Heaven and Earth. Perhaps... that power could change the power of expulsion from the Windswept Realm.</p><br/><p>It might, it might not. But as long as it held the slightest possibility of being able to help Meng Hao, Chu Yuyan wouldn’t hesitate. Blood sprayed out of her mouth, and rumbling filled her body. She felt like she was about to explode.</p><br/><p>Her face was pale white, but she continued on with her plan, grunting as her qi passageways shattered. The incredible pressure weighing down on her from the world itself was making her breakthrough even harder.</p><br/><p>And yet, she did not give up. It didn’t matter that she had already flown past him, and that he hadn’t even turned to look at her. She continued on.</p><br/><p>Once. Twice. Three times....</p><br/><p>Just when she was about to depart completely from the Windswept Realm, massive amounts of blood sprayed out from inside her body. Heaven and Earth trembled, and even the black hole out in the void vibrated. Ripples could even be seen on the huge net.</p><br/><p>It was at this point that... an enormous, archaic Door of Immortality began to descend from within the void. It flew down toward the Windswept Realm, slamming... right into the black hole!</p><br/><p>Clouds and mist appeared, which roiled out in all directions. The archaic Door of Immortality exuded indescribable pressure, a pressure filled with a will of its own and the power of the Mountain and Sea Realm. As it descended, the upward movement of the Windswept Realm suddenly ceased.</p><br/><p>Simultaneously, the expulsion power from the Windswept Realm trembled, as if it were terrified of the pressure from the Mountain and Sea Realm!</p><br/><p>Behind the huge net and the black hole, the congregated figures began shouting in rage. Just when the Traitorous Sutra of the Rebel Dao appeared in front of them, all of a sudden something unexpected happened.</p><br/><p>“NO!!”</p><br/><p>“DAMMIT!!”</p><br/><p>“I can’t believe someone is making a breakthrough right now, and summoning the Door of Immortality!!”</p><br/><p>Some of them could hold back no longer. They unleashed divine abilities and shot into the black hole in an attempt to do something about the Door of Immortality. The Door of Immortality rumbled and distorted.</p><br/><p>The expulsion force trembled and ceased operating, giving Meng Hao a hard-won chance. He suddenly shot forward, looking like a figure of blood as he crossed the final thirty meters. When he reached the light that was the Traitorous Sutra of the Rebel Dao, his blood vessels were boiling madly.</p><br/><p>A smile broke out on Chu Yuyan’s face. She was now very weak, and although the Door of Immortality was present, she didn’t have the power to open it. However, she had no regrets.</p><br/><p>“See Meng Hao, I can be of help to you!” she murmured.</p><br/><p>It was at this point that, all of a sudden, in the same moment that the majestic Door of Immortality appeared, it almost immediately began to grow indistinct. Apparently, because Chu Yuyan couldn't sustain her current state, because of the Traitorous Sutra of the Rebel Dao itself, and because of the actions of the figures inside the black hole, the Door of Immortality faded away in the blink of an eye.</p><br/><p>The moment that happened, the expulsion power of the Windswept Realm once again rose up with intensity. At that point, Meng Hao’s hand was only a few inches away from the light of the Traitorous Sutra of the Rebel Dao!</p><br/><p>It was almost within his reach!</p><br/><p>And yet, it was as far away as the Heavens!</p><br/><p>Meng Hao could move forward no further. In fact, because of the expulsion power, he was actually slowly being pushed back. If that were all there were to it, it might not be a big deal. However, it was at this point that a huge hand suddenly appeared from within the black hole. It was ancient, covered with scales, and bursting with incredible might. It instantly began to reach toward Meng Hao, causing rumbling sounds to echo out.</p><br/><p>It belonged to none other than the three-headed six-armed figure. He didn’t dare to actually descend fully. However, he couldn’t hold back from trying to kill Meng Hao, so he stretched out his arm in a deadly attack!</p><br/><p>“You killed my son, prepare to die!!” he roared, his voice filled with a murderous aura as it echoed out. Everything shook, and the Windswept Realm was filled with violent vibrations.</p><br/><p><strong>Chapter 1148: You Killed My Son, Prepare To Die!</strong></p><br/>\n</div>"}