{"title": "Chapter 1154: Heavencloud Bazaar", "id": 1154, "volume": 12, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-1154-heavencloud-bazaar", "volume_title": "Volume 12", "body": "<h1>Chapter 1154: Heavencloud Bazaar</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 1154: Heavencloud Bazaar</strong></p><br/><p>Feeling extremely idealistic and kindhearted, and sighing at how honest and sincere he was, Meng Hao looked around without the slightest flush on his face. Of course, there was no one to see him. After clearing his throat again, he turned into a bright beam of light that shot off into the distance.</p><br/><p>What Meng Hao didn’t know was that in the very instant in which he had returned to the Ninth Mountain and Sea, all of the members of the Fang Clan on Planet East Victory felt their hearts tremble. It was as if some indescribable pressure had suddenly descended upon them. Even the Dao Realm Patriarchs who were meditating awoke from their trances.</p><br/><p>It was a tug that came from their bloodline. It was... a power that existed in Meng Hao’s blood now that he was the true Patriarch of the Fang Clan, a power that caused faint and yet unmistakeable pressure within the clan members. With that power, Meng Hao truly controlled the fate of the Fang Clan!</p><br/><p>As of now, Meng Hao was so powerful that it was impossible to even compare to how he was when he had first left for the Windswept Realm. He had begun to absorb his third Nirvana Fruit with the help of the Traitorous Sutra of the Rebel Dao, although the fusion wasn't complete, and would take more time.</p><br/><p>It wouldn’t take too long, though. At the least, a few months, and at the most, a year. When that time came, he would truly be in the Allheaven Dao Immortal Realm. Quasi-Dao experts wouldn't faze him, and he would even be qualified to fight early Dao Realm experts!</p><br/><p>From the creation of the Mountain and Sea Realm until this day, he was the first... to take the Immortal Realm to the ultimate pinnacle. He was the only person who, while in the Immortal Realm, could actually fight someone in the Dao Realm!</p><br/><p>His eyes filled with anticipation, and his speed increased. Rumbling sounds surrounded him as he sped through the starry sky in the direction of Planet South Heaven.</p><br/><p>“My third Nirvana Fruit will definitely finish fusing. Now I need to start thinking about my fourth Nirvana Fruit. When I fully absorb that one, then I’ll be in a position to try to step into the Ancient Realm!</p><br/><p>When I open the Door of the Ancient Realm and summon Soul Lamps, then both my fleshly body and my cultivation base will be in the Ancient Realm. Then... I won't just be able to fight evenly with experts of the early Dao Realm. I’ll... be able to beat them!” Meng Hao was starting to feel more and more confident about himself, and become even more domineering.</p><br/><p>Although he did not quite exude a natural air of dignity, this domineering confidence gave him a distinctive awe-inspiring demeanor.</p><br/><p>His speed gradually increased as he shot through the starry sky. Back when he first started his journey among the stars, if he had tried to travel from his current location all the way back to Planet South Heaven, it would have taken far, far too long. Even using teleportation portals, it would have taken several months.</p><br/><p>But now, even without the use of teleportation portals, it would only take about a month. However, Meng Hao didn’t plan to do that. Naturally, using teleportation portals was the best thing to do.</p><br/><p>Three days later, he found himself just outside of an asteroid field. Some of the asteroids were large, some were small. The largest were hundreds of thousands of meters wide, the smallest didn’t even measure a few hundred meters. There were several hundred in total, all densely packed together.</p><br/><p>Asteroid fields like this one were relatively common in the starry sky of the Ninth Mountain and Sea. The asteroids tended to group together, making them very suitable, naturally-occurring locations to set up teleportation portals.</p><br/><p>Because of that, the big asteroid fields tended to become places where cultivators did business. Usually, they were busy places with lots of people coming and going, bringing goods from near and far.</p><br/><p>This particular location was a mid-sized bazaar. Although it wasn’t very large, there was still quite a crowd of cultivators present. The most prominent sight was the central-most asteroid, the largest of the group, upon which sat a huge city which could be seen even from a great distance.</p><br/><p>People flew in and out occasionally, and a buzz of activity could be heard inside. There was even a glowing shield, forming a defensive barrier that surrounded the entire place.</p><br/><p>The Fang Clan had a teleportation portal set up on one of the asteroids, which was guarded round the clock by members of the Fang Clan. Clan members could use the portal for free, of course, whereas non-members had to pay a fee.</p><br/><p>Virtually all of the asteroids had similar teleportation portals set up. The Four Great Clans, Five Great Holy Lands, and the Three Churches and Six Sects, all had teleportation portals set up. Occasionally, the ripples of teleportation could be seen coming from those areas.</p><br/><p>Some locations in the Ninth Mountain and Sea were controlled by various powerful organizations who restricted access; anyone who wanted to go to such places had to use one of the designated teleportation portals to do so. Such arrangements were important sources of income for many of the powerful groups in the Ninth Mountain and Sea, even the Ji Clan.</p><br/><p>Because Planet South Heaven was such a unique and important place, virtually all of the powers had teleportation portals that went in that direction. However, considering how much Meng Hao hated to waste money, he would naturally choose to use the Fang Clan’s teleportation portal.</p><br/><p>He was just about to skirt the main bazaar and head toward the Fang Clan’s asteroid when he glanced at the markets and, all of a sudden, his heart trembled. It was clearly a bustling place, filled with all sorts of shops. Some cultivators even had stalls set up to sell hand-crafted items.</p><br/><p>In the brief time that he had been watching, numerous people had come and gone via teleportation portal, numbering into the thousands.</p><br/><p>In addition to all that, there were also cultivators who patrolled the area and maintained order. They wore magenta robes, and all of them had significantly powerful cultivation bases, being stage 6 or 7 Immortals.</p><br/><p>Magical combat was not permitted inside the bazaar. If conflicts broke out, the violators would be immediately expelled. In extreme cases, they might even be executed. Those were the rules in all bazaars like this one.</p><br/><p>Of course, for such rules to be accepted by the general public, and to be able to enforce them, required significant power!</p><br/><p>Neither the Four Great Clans, the Five Great Holy Lands, nor the Three Churches and Six Sects would interfere with the interests of the bazaars. After all, most of them were occupied by extremely powerful rogue cultivators. The weakest among them would be in the late Ancient Realm, and there were even some bazaars who were occupied by Dao Realm rogue cultivators.</p><br/><p>This particular bazaar was formally called the Heavencloud Plaza. It was controlled by an almighty peak Ancient realm expert, who was only a half-step away from the Quasi-Dao Realm. He was known as Guru Heavencloud, and everyone knew that he could easily break through to being Quasi-Dao, or even to the Dao Realm!</p><br/><p>However, Guru Heavencloud was very wishy-washy regarding the whole matter, and didn’t dare to try to break through. He knew that if he made a mistake, he would die. The end result was that Heavencloud Plaza remained a place that no one dared to offend. Even the Four Great Clans were careful not to do anything to disturb him. After all... even if he failed in his breakthrough, he would still end up as a Quasi-Dao cultivator.</p><br/><p>If a conflict arose, and he broke through to the Dao Realm to deal with it, it would actually be an easier situation to handle. But if he failed and became a Quasi-Dao expert, his life expectancy would be very limited. With such a short time to live, he would go mad, as if he didn't fear death at all. A situation like that would be a big headache for all the major powers.</p><br/><p>“I haven’t been home for a long time,” Meng Hao thought. “After I go back this time, who knows when the next time will be.... Dad and mom are stuck on Planet South Heaven, so I really should bring them some nice gifts....” With that, he shot toward the bazaar. As soon as he passed through the protective shield, he felt pressure weighing down on him.</p><br/><p>At the same time, he also felt numerous streams of divine sense lock onto him. Those would be from the cultivators in the magenta robes. He could tell that if he tried to do anything untoward, they would immediately take action against him.</p><br/><p>Of course, no matter how they analyzed Meng Hao with their divine sense, all they could sense was that he was in the Immortal Realm. They could detect an impenetrable aura on him which indicated that he was hiding something about himself, but cultivators possessed all sorts of magical techniques and items which made it impossible for others to tell everything about them with a simple scan of divine sense. Besides, it would be difficult for them to imagine that Meng Hao could possibly be a person who even their Patriarch, Guru Heavencloud, would fear.</p><br/><p>Of course, Meng Hao was already quite famous in the Ninth Mountain and Sea. However, there were few people who would recognize him on sight. Most people had only seen his images on projection screens, and weren’t too familiar with what he actually looked like up close.</p><br/><p>These magenta-robed cultivators were no different. Some of them thought that he looked familiar, but none of them could place where exactly they had seen him before.</p><br/><p>Meng Hao’s expression was the same as ever as he sensed the pressure weighing down on him. If he wanted to, he could easily push back against it, and even destroy the entire shield. However, he had merely come here to buy some gifts, so there was no need to act presumptuously. Therefore, he allowed himself to be pushed down onto the ground.</p><br/><p>As soon as he did, the gazes which had been fixed onto him vanished, to observe other incoming cultivators. They paid no more attention to Meng Hao.</p><br/><p>Meng Hao patted his bag of holding and cleared his throat. After winning the bet with the Demonic Cultivator Horde in the Nine Seas God World, he had quite a few pieces of Immortal jade, and had unknowingly adopted the manner of a rich person. He looked around for a moment, then began to stroll around. For the most part, he knew what kind of place this bazaar was. There were various shops and auction houses, and as for the auction houses, they didn't have membership requirements; anyone could participate in the auctions.</p><br/><p>In addition to the shops and auction houses, there were vendor stalls, which actually made up the majority of the establishments in the bazaar. Just about everything you could imagine could be found for sale.</p><br/><p>After sizing the place up, Meng Hao entered one of the shops. The first thing he saw was four or five other cultivators, all of whom were accompanied by salespeople who were introducing the various magical items for sale.</p><br/><p>As soon as he stepped in, a young woman walked up. However, before she could even speak, Meng Hao flicked his sleeve the way he remembered Steward Zhou used to do. Lifting his chin up, he coolly said, “Take me to your luxury goods section.”</p><br/><p>The young woman looked at him for a moment, and almost immediately began to look down on him inwardly. She had seen a lot of people like Meng Hao in the past, people who thought they were rich, but, once they saw how expensive things were, didn’t actually buy anything.</p><br/><p>Expression the same as before, she nodded and led him to one particular corner of the shop, where she clapped her hands, causing the wall to suddenly swirl. Moments later, a collection of dozens of unique magical items appeared.</p><br/><p>“This one,” Meng Hao said, pointing at a bell. Then he pointed at another item. “And this one. That one too, and that one. These seven....”</p><br/><p>“You have a good eye, Fellow Daoist,” the young woman said coolly. “Those seven items are all high-grade magical items. The total cost for them would be about 6,000,000 spirit stones. If you want to pay with Immortal jade, I can give you a bit of a discount….” She looked at Meng Hao, wondering whether he would dare to try to buy all seven items after hearing how expensive they were.</p><br/><p>“Those seven... I don't want,” he said calmly.</p><br/><p>Inwardly, the young woman was chuckling coldly. Expression the same as usual, she was just about to continue speaking when Meng Hao said, “But I’ll take all the other ones.”</p><br/>\n</div>"}