{"title": "Chapter 1169: Returning to the Crow Divinity Tribe!", "id": 1169, "volume": 12, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-1169-returning-to-the-crow-divinity-tribe", "volume_title": "Volume 12", "body": "<h1>Chapter 1169: Returning to the Crow Divinity Tribe!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong></strong></p><br/><p>[/expand]</p><br/><p>Meng Hao felt somewhat like a stranger on Planet South Heaven as he looked around at all the familiar sights. In his heart, this was his home, the place where he had grown up, and the place where he learned about cultivation. This was where he had laughed, developed his ideals, and thrived on his youthful energy. This was also the place where he had married Xu Qing.</p><br/><p>The rain passed, and a rainbow appeared up above in the dawn sky. Meng Hao went to various places in the vast Eastern Lands. He went to the mountains where lay the Immortal Ancient Daoist Rite temple. Long ago, it had been a place of extreme danger to him. Now, nothing there was even worth paying attention to.</p><br/><p>He walked through the mountains, through that long, narrow path, and then finally reached the edge of the crater where the temple had once stood. He stood there for a long time, thinking.</p><br/><p>He recalled everything that had happened here, how he had taken the bronze lamp, and how everyone had chased him. The events in the subsequent days and nights had been like a sort of baptism.</p><br/><p>That was his first time he had truly become embroiled in the affairs of the Ninth Mountain and Sea.</p><br/><p>As he stood at the edge of the crater, he sighed. Much time had passed. The mountains were still the same mountains, and there was grass everywhere just like before. However, the trees and other vegetation had changed. Although they seemed the same at first, their colors had deepened from the ones that he remembered.</p><br/><p>After a long while, he left.</p><br/><p>He went to the Northern Reaches, and from there, to the Milky Way Sea. As he passed over the water, he looked down at the waves, and recalled everything that had happened there. He thought about Patriarch Reliance, the 10th Wang Clan Patriarch, and the Resurrection Lily.</p><br/><p>After crossing the Milky Way Sea, he found himself in the Western Desert. It was a vast place, and was still mostly submerged by violet seawater. The Violet Sea was tranquil and lifeless.</p><br/><p>He proceeded along over the Violet Sea, eventually reaching the area the Crow Divinity Tribe had once called home. He sank down into the water there and looked at the mountains and valleys in the area, all places with which he was familiar.</p><br/><p>From there, he proceeded along under the water, telling himself that he was going to take all of the details about Planet South Heaven and place them in his heart, in order to never forget. As he sped along under the surface of the Violet Sea, he eventually reached the South Cleaving Mountains, which seemed to stretch out endlessly.</p><br/><p>Eventually, he reached something that looked like a huge wall, or a city gate. It kept the Violet Sea out of... the Black Lands.</p><br/><p>The Black Lands were now very different from how Meng Hao remembered them. They bustled, even thrived. Numerous cultivators scurried back and forth between there and the Southern Domain. Apparently, the Southern Domain was very accepting of the Black Lands cultivators.</p><br/><p>Over the years, the former powerful tribes of the Western Desert, as well as the native Black Lands power groups, had all thrived and grown powerful.</p><br/><p>Many Northern Reaches cultivators had settled down in the Black Lands, and had come to call the place home. Their path of cultivation had been cut off by Meng Hao years ago. No matter how they cultivated, they could only reach a certain height. Their fates were sealed, and they were forced to atone for the crime committed by their ancestors from the Northern Reaches, when they had invaded the Southern Domain.</p><br/><p>The Crow Divinity Tribe was now the largest tribe in the Black Lands and also the number one power, with many other sects and clans subservient to them.</p><br/><p>Almost as soon as Meng Hao entered, he realized that there were statues everywhere. Some were large, some were small, but all of the important groups in the Black Lands had them.</p><br/><p>Those statues depicted... Meng Hao!</p><br/><p>The largest of the statues was covered in spirit stones. When the sunlight fell onto it, it glittered resplendently with a multitude of colors. That statue was located on the highest mountain in the Black Lands, which belonged to the Crow Divinity Tribe.</p><br/><p>That statue was the symbol of the Black Lands, and represented the spirit of the cultivators there.</p><br/><p>Every so often, the members of the Crow Divinity Tribe would gather around the statue to offer worship and sacrifices. As it happened, that was exactly what they were doing when Meng Hao arrived.</p><br/><p>He hovered there above the huge statue, looking down at all the Crow Divinity Tribe members gathered around the mountain. There were tens of thousands of them, all prostrating themselves in worship.</p><br/><p>No one could sense Meng Hao’s presence. It was as if he existed in a different world.</p><br/><p>Ten old men in resplendent robes stood apart from the tens of thousands of tribe members, eyes burning with passion. Raising their hands high into the air, they cried out, “Crow Divinity Tribe, bow to the Sacred Ancient!”</p><br/><p>In response to their call, tens of thousands of tribe members bowed low and joined their voices together in worship. As the sound echoed out, the tribe members looked at the statue with gazes of awe. From the look of it, if this statue were alive, and gave them orders, they would follow those orders without question.</p><br/><p>Meng Hao’s statue had replaced totems as the symbol of the cultivators of the Black Lands.</p><br/><p>Meng Hao hovered there in midair, looking down at the scene playing out below. He heard the voices of the crowds, and was also just able to detect that their worship contained vestiges of the power of Joss Flame. It was faint, but it was there.</p><br/><p>The ten old men once again cried out with loud voices, “Crow Divinity Tribe, bow to Patriarch Fifth and Patriarch Third!”</p><br/><p>Again, the crowds bowed in worship. A strange expression appeared on Meng Hao’s face. He had noticed earlier that this particular statue belonging to the Crow Divinity Tribe had a parrot attached to its shoulder, upon whose ankle was a tiny bell.</p><br/><p>The ceremony of offering worship continued.</p><br/><p>Meng Hao sighed, and was just about to leave, when all of a sudden, he said, “Eee?”</p><br/><p>Eyes glittering brightly, he hovered in place and looked back down below him.</p><br/><p>What he saw was that the Joss Flame power which emanated off of everyone because of their fervent worship, was gathering around the statue. It then blasted up into the sky, where a vortex appeared.</p><br/><p>Although the cultivators down below couldn't see that vortex, Meng Hao could see it clearly.</p><br/><p>As it spun silently, a figure slowly appeared within it. It was a young man in a black robe, whose appearance... looked very similar... to Meng Hao's!</p><br/><p>The main difference was that he had two black wings sticking out of his back. His expression was lofty as he descended from above to land upon the head of the statue. There, he sat down cross-legged, whereupon he began to breathe in the power of the Joss Flame.</p><br/><p>He could not see Meng Hao, but Meng Hao could see him, and knew exactly who he was. This was the creature which had been his follower for a brief period of time, the black bat!</p><br/><p>Although he now maintained human form, he still looked the same as before. Clearly, he was here to steal away the Joss Flame sacrifice from the Black Lands.</p><br/><p>Meng Hao glared at the bat creature coldly. At the same time, he realized that the mastiff in his bag of holding had suddenly twitched, and opened its eyes. A blood-colored gleam appeared, as well as an icy-cold aura.</p><br/><p>“You’re interested in him, huh?” Meng Hao thought. He then recalled the so-called renegade spirit that the mastiff had absorbed back in the Windswept Realm, which had also been a bat.</p><br/><p>The black-winged young man was sitting there in meditation, absorbing the Joss Flame power when, all of a sudden, he shivered. His eyes opened, and he looked around suspiciously. Although he didn't see anything, he still felt incredibly frightened, as if Meng Hao’s presence caused him to be jumpy.</p><br/><p>He suddenly let out a bellow, causing ripples to spread out in all directions. As they neared Meng Hao, he waved his finger, which produced no reaction from the ripples, and in fact, caused them to pass right through him.</p><br/><p>The black-robed young man frowned. Despite using a divine ability to check the area, he hadn't been able to identify anything suspicious. He wanted to just ignore the matter, but the sense of crisis he felt only continued to grow stronger.</p><br/><p>He had been absorbing the Joss Flame here for years, and had never felt anything like this before. Finally, he gritted his teeth and flew up into the air to leave. He would rather abandon the Joss Flame than run into any dangerous situations.</p><br/><p>However, in the same moment that he flew up, Meng Hao’s eyes gleamed with a bright light, and he snorted.</p><br/><p>The sound seemed to reach out past the illusion that masked him, transforming into lightning which crackled in the sky. The world trembled, and the black-robed young man let out a shriek. Blood sprayed out of his mouth, and he was no longer able to keep himself hidden from the people down below. Almost immediately, everyone caught sight of him hovering there in the air.</p><br/><p>Everyone was shocked, especially the ten old men. Then they saw his face, and their expressions flickered with disbelief.</p><br/><p>“Who’s there!!?” cried the black-robed young man, coughing up some more blood. “Who’s ambushing me!!?” He was completely shaken, and yet, all he had heard moments ago was a clap of thunder, not a cold snort from Meng Hao.</p><br/><p>If he had heard Meng Hao, then he would never have been able to muster the courage to speak.</p><br/><p>“Sacred Ancient!!”</p><br/><p>“It's the exalted Sacred Ancient! Heavens, it's a manifestation of the Sacred Ancient!!”</p><br/><p>“Greetings, exalted Sacred Ancient!!” The tens of thousands of Crow Divinity Tribe cultivators down below were trembling in awe. The ten old men gasped loudly.</p><br/><p>“I'm Meng Hao, the Sacred Ancient of this place!” the black-robed young man shouted. “Whoever’s trying to ambush me had better show their damned face right now!” He took a deep breath, sucking in the Joss Flame, causing a bright glow to rise up from him, and making him look every bit like a majestic Immortal.</p><br/><p>“Well that’s funny,” Meng Hao said coolly, strolling out into the open air. “If you’re Meng Hao, then... who am I?” Everyone down below could now see him.</p><br/><p>The cultivators of the Crow Divinity Tribe stared in shock, confusion, and disbelief. They looked at Meng Hao, and then back at the black-robed young man, clearly unsure of who was real and who was not.</p><br/><p>Actually, there was no need for them to try to guess. As soon as the black-robed young man caught sight of Meng Hao, his face fell and his eyes went wide. He began to pant with disbelief, and he let out a shout of alarm.</p><br/><p>“Meng Hao... you... when did you get back?!” The black-robed young man’s scalp was tingling. He suddenly realized that the thunder from just now had not been thunder at all, but rather, Meng Hao. He began to tremble and back up, and then fled with all the speed he could muster.</p><br/><p>Meng Hao’s expression was calm as he took a step toward the fleeing young man. Then, he vanished, to reappear directly in front of him.</p><br/><p>Down below, the tens of thousands of Crow Divinity Tribe cultivators were shaking as they realized that this second Meng Hao was their true Sacred Ancient.</p><br/><p>“Greetings, Sacred Ancient!!”</p><br/><p>“The Crow Divinity Tribe offers greetings, Sacred Ancient!!”</p><br/><p>As their voices rang out, the entire Black Lands trembled.</p><br/><p><strong>Chapter 1169: Returning to the Crow Divinity Tribe!</strong></p><br/>\n</div>"}