{"title": "Chapter 1171: Im Meng Hao!", "id": 1171, "volume": 12, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-1171-im-meng-hao", "volume_title": "Volume 12", "body": "<h1>Chapter 1171: Im Meng Hao!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 1171: I’m Meng Hao!</strong></p><br/><p>The old man immediately waved his hand, and in response, the dozens of people following him split up and began to search the island. He also sent his divine sense out, but came up with nothing. Frowning, he turned to the three cultivators who had sounded the alarm and began to question them.</p><br/><p>When they told him that the intruder looked exactly like the Sacred Ancient, the old man’s face flickered. Then they recounted how the intruder said this place was his home, he gasped.</p><br/><p>It was at this point that a glittering jade slip flew out of his bag of holding. He grabbed it and scanned it with divine sense, whereupon a look of bewilderment appeared on his face. Gritting his teeth, he said, “We found him. He’s... in the Sacred Mansion at the center of the island!”</p><br/><p>The old man disappeared toward the center of the island in a flash, simultaneously sending orders to his subordinates. Soon, all of the other cultivators who had spread out across the island were heading toward the building in the middle.</p><br/><p>The three cultivators followed along nervously. They were anxious, not because someone had come to the island; rather, they were anxious about who that person was!</p><br/><p>It didn’t take long before the old man arrived at island's center, where he caught sight of the disciple who had just notified him about Meng Hao’s location. That disciple was kneeling on the ground in front of the Sacred Mansion, trembling.</p><br/><p>The structure itself was actually little more than a log cabin, and didn’t look unusual in any way. In fact, many of the cultivators who had come here in pilgrimage throughout the years had often wondered why this seemingly ordinary log cabin was referred to as the Sacred Mansion. [1. Meng Hao built a log cabin in the Blood Demon Sect in chapter 705. Later, when he moved to Blood Prince Gorge, he also lived in a log cabin, presumably a newly constructed one, or the original cabin which had been moved. He spent a lot of time with Xu Qing there, and later, it was where he stayed with her as she neared death. Since this cabin is in a different location, I think it's safe to assume at this point that the original cabin was either moved here, or this one is a replica.]</p><br/><p>Meng Hao was currently standing in the doorway, facing away from everyone on the outside, examining the inside of the cabin. Two statues could be seen inside, sitting there looking at each other.</p><br/><p>They were dressed in long red wedding gowns, and they were holding hands and smiling. The statues had been carved with incredible grace and skill, making them look extremely lifelike.</p><br/><p>One depicted Meng Hao. The other depicted Xu Qing....</p><br/><p>Meng Hao stood there looking at the statues in somewhat of a daze. Memories poured into his mind like floodwaters.</p><br/><p>Outside of the Sacred Mansion, the old man looked at Meng Hao and could sense the terrifying, indescribable pressure that existed within him. However, that pressure was not radiating out; if it were, the old man was certain that everything in the surrounding area would be instantly transformed into ash.</p><br/><p>He took a deep breath, but didn’t dare to say anything. Instead, he stood there respectfully. At this point, it didn't matter who this trespasser was; considering the level of his cultivation base, it would be impossible to do anything to stop him. However, the old man secretly crushed a jade slip, sending a notification to the powerful experts in his sect, telling them to hurry over.</p><br/><p>The other disciples who had been searching the island had arrived, and stood nervously outside of the Sacred Mansion, not daring to speak.</p><br/><p>After a long moment passed, Meng Hao asked, “Who carved these two statues?”</p><br/><p>The old man’s heart thumped, and without even thinking about it, he replied, “It, it... was carved by all of the members of the Senior generation in the Southern Domain, people who actually knew the Sacred Ancient.”</p><br/><p>Meng Hao turned and looked at the old man.</p><br/><p>“And you people? Are you disciples of the Blood Demon Sect?” he asked.</p><br/><p>The old man nodded, and was about to say something else, when he saw Meng Hao’s face. He felt as if lighting were crashing around in his mind, and he stood there in a daze. It wasn’t just him. All of the other disciples around him were also staring in shock.</p><br/><p>Subconsciously, they all looked away from Meng Hao toward the statue behind him.</p><br/><p>The two of them looked exactly the same!!</p><br/><p>The only difference was that somehow, the person standing in front of them seemed to have an ancientness to him, and wasn’t a youth like the person depicted on the statue.</p><br/><p>Panting, the old man murmured, “Sir... are you....”</p><br/><p>“I'm Meng Hao,” was the calm reply.</p><br/><p>“Sacred Ancient!!”</p><br/><p>“I can't believe... it's the Sacred Ancient. How... how could this be possible?!”</p><br/><p>In the midst of the exclamations of shock by the old man and his subordinates, an enraged roar echoed out off in the distance. Several hundred beams of light shot through the air, the leader being a middle-aged man. At first his face was twisted with rage, but as soon as he caught sight of Meng Hao, it filled with shock.</p><br/><p>“Sacred Ancient!!”</p><br/><p>Everyone was in a tumult, so Meng Hao waited in silence for a moment before saying, “I want to spend the night here alone. I would like to thank all of you for keeping this place in order for all these years.”</p><br/><p>With that, he waved his hand, sending hundreds of bottles of medicinal pills flying out to those present.</p><br/><p>Then he turned and walked into the log cabin, slowly closing the door behind him. Soon, lamplight could be seen in the oilpaper windows.</p><br/><p>Outside the log cabin was deathly silence. The middle-aged man and the hundreds of other cultivators he had led here could hardly believe what was happening. Exchanging glances, they transmitted messages to each other, not daring to speak out loud. Then they all fell back a short distance and sat down cross-legged, whereupon they began to send messages via jade slip back to Mount Blood Demon. From there, word quickly spread to the rest of the Southern Domain.</p><br/><p>As far as Meng Hao was concerned, this was one of the few occasions since he had left Planet South Heaven in which he had shown so much emotion. It was also one of the few nights he could spend in complete peace and calm. He sat in the log cabin, looking at the statue of Xu Qing, and he soon lost track of time.</p><br/><p>In contrast, that night was a sleepless one for the entire Southern Domain. News spread to all the sects and clans that Meng Hao had been seen on the Holy Island. Soon, countless cultivators of the Senior generation, veterans who had fought alongside Meng Hao in the wars of the past, were completely shaken.</p><br/><p>It had been years since Meng Hao had left, and although people had seen images of Meng Hao in his various escapades, this was different. The news from the Blood Demon Sect said that this was the real Meng Hao, and that his cultivation base was unfathomably high.</p><br/><p>Most importantly, he was on the Holy Island. It didn't matter if it was really him or not, all of the powerful experts of the Southern Domain unhesitatingly made their way there. If it was the real Meng Hao, then they would offer worship to him. If it was not him... then whoever the blasphemer was would face the wrath of the entire Southern Domain.</p><br/><p>It was during the great war of the Southern Domain that Meng Hao had truly risen to the level of being a Sacred Ancient. In fact, he was one of three Sacred Ancients, the other two being Pill Demon and Patriarch Song.</p><br/><p>They had been the only three peak experts left alive at the end of that war. Later, Pill Demon reached Immortal Ascension and left Planet South Heaven, becoming nothing more than a figure of legend. As for Patriarch Song, he ended the war having been seriously injured, after which he went into secluded meditation and never came out.</p><br/><p>Later, Meng Hao also left. However, it was because of how he had sealed the experts of the Northern Reaches into the mountain called Sin of the North that the spiritual energy of the Southern Domain was gradually restored. That mountain still stood, and it was because of it that his name had reached such heights of glory.</p><br/><p>After the war, the Violet Fate Sect and the Song Clan became Holy Lands, and along with the Blood Demon Sect, became the most powerful forces in the Southern Domain. As for the island, because of the wedding which had begun there all those years ago, the Southern Domain cultivators made it their Holy Island, a place to commemorate Meng Hao and Xu Qing.</p><br/><p>On this night, all of the sects in the Southern Domain mobilized. The war veterans from the elder generation flew toward the Holy Island, as did people who had been born since then.</p><br/><p>Even more surprising... deep in the Song Clan, Patriarch Song, who had been in secluded meditation for years, suddenly opened his ancient eyes. When he heard the reports of what was happening, he sat there silently for a moment, then slowly rose to his feet. Filled with ancientness and exhaustion, he left the Song Clan, taking his fellow clan members with him to the Holy Island.</p><br/><p>The emergence of Patriarch Song sent the whole Southern Domain into a huge commotion. Overnight, all cultivators were either thinking about the Holy Island, or talking about it!</p><br/><p>Patriarch Song arrived on the island at around midnight, flanked by numerous members of the Song Clan. One of them was a middle-aged woman. She was beautiful, but old, and it was obvious that when she was young, she would have been considered one of the top beauties of the land.</p><br/><p>It was none other than Song Jia. [1. Song Jia appeared on several occasions in the story so I’m not going to include links. She became Meng Hao’s official fiance after he won the contest in the Song Clan’s search for a son-in-law]</p><br/><p>Because of what had occurred with Meng Hao, Song Jia had a special position in the Song Clan. She had chosen to never officially take a beloved partner, and had remained single, focused on cultivation.</p><br/><p>As soon as the word about Meng Hao began to spread, she also emerged from secluded meditation and calmly joined Patriarch Song to come to the Holy Island.</p><br/><p>The arrival of Patriarch Song sent all the cultivators on the island into an uproar. They bowed in respectful greeting, simultaneously clearing a path for Patriarch Song to walk directly up to the log cabin.</p><br/><p>Patriarch Song looked at the lamplight flickering in the oilskin windows, and his dim eyes gradually sparkled with bright light. Gradually, he began to emanate a powerful energy like that of an unsheathed magical sword.</p><br/><p>The other cultivators in the areas were now staring nervously at Patriarch Song.</p><br/><p>“Is it my old pal Meng Hao?!” Patriarch Song suddenly asked, his voice booming like thunder. A huge wind sprang up in the sky, and the land quaked. Massive waves rolled out across the surface of the water.</p><br/><p>After a moment, Meng Hao’s voice could be heard from inside the log cabin, sounding somewhat emotional. “Senior Song, please come in.”</p><br/><p>The door of the log cabin slowly opened, revealing Meng Hao, looking out at Patriarch Song. His eyes seemed to be filled with memories as he recalled their times fighting together against the invading Northern Reaches army.</p><br/><p>The instant Patriarch Song caught sight of Meng Hao, his eyes began to shine brightly. He trembled slightly, then threw his head back and laughed. It was a laughter filled with joy, and the excitement of seeing an old friend.</p><br/><p>He walked forward, entering the log cabin, after which the door slowly closed.</p><br/><p>“It's really him....” Song Jia murmured, a complicated look flickering in her eyes.</p><br/><p>The night passed slowly. More and more cultivators gathered outside the log cabin. There were cultivators from the Violet Fate Sect and the Blood Demon Sect, as well as others who had fought with him against the Northern Reaches. There were even cultivators gathering on the shores of the lake, packed tightly, their eyes filled with awe and reverence. To them, this was like a holy pilgrimage.</p><br/><p>The fact that Patriarch Song had entered the log cabin made it clear to everyone... that this really and truly was the Sacred Ancient Meng Hao!</p><br/><p>The news filled everyone with excitement and anticipation. The veteran cultivators who had fought with him recalled their old comrade-in-arms. As for those who had never met Meng Hao before, they merely hoped to catch a glimpse of the majestic Sacred Ancient.</p><br/><p>No one spoke. They simply sat there quietly, waiting for the door to open.</p><br/>\n</div>"}