{"title": "Chapter 1179: The Curse of Dao Fang!", "id": 1179, "volume": 12, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-1179-the-curse-of-dao-fang", "volume_title": "Volume 12", "body": "<h1>Chapter 1179: The Curse of Dao Fang!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 1179: The Curse of Dao Fang!</strong></p><br/><p>Without the sea of flames covering it, the black city was now much more clearly visible. White vegetation still clung to the walls, and there was still a palace in the middle.</p><br/><p>At first, it didn't look much different than the first time he had laid eyes on it.</p><br/><p>Meng Hao frowned as he examined it more closely. Then his eyes widened as he realized that something had changed. The pile of human skin which had been draped on the huge throne...</p><br/><p>was now gone!</p><br/><p>Meng Hao’s eyes shone with a cold light, and he sent his divine sense out in all directions, backed by the power of an Allheaven Dao Immortal. Soon, his frown deepened as he realized that there weren’t any clues to be found about what had happened.</p><br/><p>The sense of crisis still existed within him, and was growing stronger. He even had the sensation that someone was watching him.</p><br/><p>“The curse of Dao Fang....” He thought back to what the guardian had said before dying. Now that he thought about it, he had met Dao Fang. Although he hadn’t seen what he looked like, when he experienced that mental journey out into the void beyond the Windswept Realm, he knew that he had encountered an entity that existed atop the 33 Heavens. That entity’s name was... Dao Fang!</p><br/><p>Meng Hao didn’t have a very high opinion of this Dao Fang. After all, based on his understanding of the Mountain and Sea Realm, the 33 Heavens were the first barrier sealing the Mountain and Sea Realm.</p><br/><p>Dao Fang was the second barrier!</p><br/><p>Meng Hao’s eyes flickered as he slowly backed up. However, in that moment, the air around him suddenly seemed to be sealed, causing the exit to be completely wiped away.</p><br/><p>On the second level of the underground world, the ancient beast gasped. It suddenly rose to its feet as it realized that the passageway to the third level had collapsed noiselessly.</p><br/><p>Meng Hao stopped in place, frowning. The sensation of crisis within him exploded with intensity. His pupils constricted, and he looked down at the black-colored city. This time, he couldn’t hold back from gasping.</p><br/><p>What he saw was that the color of the city itself was now changing. It was no longer black, but instead, pale white. It almost had the luster of skin. Furthermore, the white vegetation on the city walls was gradually turning brown, almost as if they were blood vessels within the skin.</p><br/><p>It wasn’t just the city walls that were changing. The whole city, including the palace and all the surrounding buildings, was all changing color to pale white. Then, Meng Hao’s eyes widened as the entire city began to move!!</p><br/><p>It was slowly twitching; the city walls, the palace, the land, everything was moving. Furthermore, an aura of life suddenly erupted out from the city.</p><br/><p>It was as if the entire city was no longer an inanimate object, but a living thing!</p><br/><p>As the city spasmed, the city wall emitted rumbling sounds. Odd cracks spread out, and the ground quaked. Shockingly, part of the city wall ripped out and began to rise up, transforming into a huge arm. Another part of the city wall also lurched, and then transformed into a second arm.</p><br/><p>The other sections of the city wall rumbled as they transformed into legs. As they rose up from the ground, the palace also jerked as it became a torso, with the central part of the palace turning into an Imperial crown!</p><br/><p>As for the enormous throne which was in the palace, it turned into a face!</p><br/><p>RUMBLE!!</p><br/><p>The entire city transformed in front of Meng Hao’s eyes, becoming an enormous giant with white skin, fully 30,000 meters tall, causing everything to shake violently. It actually... didn't even look like a city any more. It looked like an actual giant!</p><br/><p>Its body was made of flesh and blood, and the blood vessels were even visible on its skin. Its eyes glowed with coldness as it stood there looking down at Meng Hao.</p><br/><p>When Meng Hao looked up at the face, he realized that this giant was none other than the pile of human skin he had seen earlier!!</p><br/><p>The skin hadn’t left, but had instead used some special technique to merge with the city and transform into a giant. Or maybe... the city was actually materialized from a giant to begin with!</p><br/><p>Perhaps there was another explanation. Maybe the human skin and the city itself were both parts of the curse of Dao Fang!</p><br/><p>Meng Hao wasn't sure which of these possibilities was correct. However, he was currently filled with a sense of deadly crisis. He knew that this giant... was a formidable foe!</p><br/><p>He suddenly smiled, and his eyes glinted with the desire to do battle. He was now an Allheaven Dao Immortal, with a fleshly body in the great circle of the Ancient Realm, with the true Essence of Divine Flame.</p><br/><p>All of that placed Meng Hao at the ultimate peak. He could fight with the Dao Realm, so this trifling giant only made him want to do battle, to test out his new cultivation base breakthrough. He wanted to prove... exactly how powerful he was!</p><br/><p>A powerful voice rumbled out of the giant’s mouth, crackling like thunder, filled with awe-inspiring power like Heavenly might. The ground trembled, and everything shook. “Hand over the flame spark, and you will merely be killed. Force me to take it, and I’ll kill your whole clan!”</p><br/><p>Meng Hao looked at the giant, smiled coldly, and then spoke equally domineering words. “Become my follower, and I won’t kill you! Refuse, and I’ll destroy you in body and soul!”</p><br/><p>The giant looked coldly at Meng Hao, then raised his right hand and clenched it into a fist. The air seemed to be on the verge of exploding as incredible power erupted out. He punched toward Meng Hao, and his fist moved with incredible speed, seemingly encompassing the entire world.</p><br/><p>Meng Hao snorted coldly. Instead of backing up, he also clenched his right hand, punching out with the Life-Extermination Fist.</p><br/><p>When the two fists slammed into each other, a massive rumbling echoed out. The land between them shattered, and a huge crevice opened up. Meng Hao sailed over it, landing on the giant's hand and racing up toward its neck. Even as he ran, he performed an incantation gesture with his right hand, causing numerous Immortal mountains to descend. Then he punched out with the Self-Immolation Fist.</p><br/><p>The giant’s eyes flickered and it trembled. That trembling caused an explosive force to rage toward Meng Hao. The giant’s expression was cold as it reached its left hand up and flicked it in Meng Hao’s direction. The massive hand filled the sky; it was almost as if the giant were trying to swat a fly.</p><br/><p>“To me, you’re nothing more than an insect,” the giant said coolly. The palm and fist connected, and the giant's left arm shook. Meng Hao’s face paled, and he fell backward several paces. However, the desire to fight burned brightly in his eyes, and he threw his head back and laughed.</p><br/><p>“Insect?” he said. Azure light sprang up around him, and the power of an Allheaven Dao Immortal erupted. Azure light spread out for 3,000 meters in all directions, and he began to grow taller. In the blink of an eye, he was 3,000 meters tall.</p><br/><p>Although he was still miniscule compared to the giant, he was completely different than he had been before. When the giant saw the azure light, his eyes flickered, and he suddenly experienced a feeling of crisis, caused by Meng Hao. Even as his heart trembled, Meng Hao took a step forward. He might be small, but he was as quick as lightning.</p><br/><p>He transformed into an azure roc, which was also 3,000 meters long. He stretched his wings out, growing even larger, letting out a fierce cry as he shot toward the giant and slashed at it with razor-sharp claws. The giant roared, performing an incantation gesture which caused booming lightning to surround it.</p><br/><p>Each bolt of lightning was like a Heavenly Tribulation. As it bore down, the Essence of Divine Flame shot out of the mouth of the azure roc. This Essence of Divine Flame was far different that what Meng Hao had wielded before. It was the true Essence of Divine Flame, and its sudden appearance caused the giant's face to flicker. He performed an incantation gesture, causing a wild wind to spring up, which transformed into a roaring Wind Dragon.</p><br/><p>Even still, it wasn’t enough to block Meng Hao and the Essence of Divine Flame which exploded out of the flame spark. A sea of flames surrounded Meng Hao, and then spread out to envelop the giant. It was quickly engulfed in flames, and let out roars of pain. Suddenly, the giant spat out a pearl.</p><br/><p>The pearl was black, and emanated an archaic air. Almost as soon as it appeared, it shattered, and its remnants formed into a spell formation.</p><br/><p>“Mountain Ghost Seal, Divine Flame Lightning Spirit Hex!!” the giant roared. Meng Hao’s Divine Flame surrounded the spell formation, but then stopped, unable to pierce through it.</p><br/><p>Meng Hao wasn't surprised by this. It didn't attest to any lack of power on the part of the Divine Flame, but rather, just went to show that as warden of this place, the giant was obviously prepared to deal with the Essence of Divine Flame. Were this any other place in the outside world, and any other opponent, he would be dead.</p><br/><p>The azure roc flashed as it transformed back into Meng Hao. He stepped forward with a cold harrumph, performing an incantation gesture which caused the Blood Demon to emerge from its rift. It grabbed the giant’s neck, opened its mouth, and took a vicious bite. Meng Hao waved his hand, and the violet moon mark appeared on the giant’s head. Then Meng Hao took another step, and his left hand extended with the Supernova Magic.</p><br/><p>This time, it didn't need to absorb any light from around it. Meng Hao caused boundless azure light to stream out of his hand, pouring into the Supernova Magic, causing the star to rapidly grow larger and emanate ripples of destruction as it shot toward the giant.</p><br/><p>Huge booms echoed out as the giant was shoved backward, heart trembling. However, Meng Hao didn't stop there. He stepped forward again, taking three steps in a row. His energy began to rise explosively. When you added in the steps from before, shockingly, he had unleashed the Seven God Steps!</p><br/><p>As he took his seventh step, his energy skyrocketed. Boundless azure light rose up as he punched out with his right hand. The Life-Extermination Fist, the Self-Immolation Fist, and the God-Slaying Fist, all rumbled through the air.</p><br/><p>The three fist strikes, coupled with the Seven God Steps, backed by the peak power of Meng Hao’s cultivation base and fleshly body, were enough that... even Dao Realm cultivators with two Essences or fewer would be slaughtered!</p><br/><p>Intense pressure caused all light to dim. Heaven and Earth trembled, and the lands cracked. Countless ripples spread out through the air, and Meng Hao shone with azure light so bright that he seemed like an azure sun!</p><br/><p>The giant's face fell, and he fought back with all the power he could muster. He roared, shoving both hands down toward the ground. Everything shook, and magical symbols appeared all over the giant. The magical symbols emanated a thoroughly archaic air that exploded out to resist the terrifying power of Meng Hao’s Seven God Steps and three fist strikes.</p><br/>\n</div>"}