{"title": "Chapter 1194: Cutting Them Down!", "id": 1194, "volume": 12, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-1194-cutting-them-down", "volume_title": "Volume 12", "body": "<h1>Chapter 1194: Cutting Them Down!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 1194: Cutting Them Down!</strong></p><br/><p>Most of the members of the Ji Clan were old, but one appeared to be a young man of about thirty years of age. He wore ordinary clothing, nothing extravagant, and yet all the other Ji Clan cultivators seemed to be following his lead.</p><br/><p>Without looking closely, that fact would never be obvious. In fact, he even stood towards the rear, making him seem like nothing other than an ordinary clan member.</p><br/><p>However, while the other clan members were crying out in rage, he was doing nothing more than frowning. That in itself made him stand out to Meng Hao.</p><br/><p>Meng Hao looked over at him with a slight smile, as if nothing were out of the ordinary. However, deep in his heart was icy coldness; the killing intent he felt towards the Ji Clan had long since become extremely intense.</p><br/><p>If it weren’t for the fact that he wasn’t confident in the Fang Clan’s ability to achieve complete victory against the Ji Clan, Meng Hao would have already begun to slaughter them. However, even though he was currently holding himself back, he would strike decisively whenever he had the opportunity to do so.</p><br/><p>“Fellow Daoists of the Ji Clan, are you saying that I killed the wrong person?” he asked, sounding perplexed. “Why are you so angry? He was clearly trying to harm the relationship between our two clans!” The coldness in his heart grew more intense; if the Ji Clan attempted to argue with him, then he would simply use it as a reason to attack and kill someone else!</p><br/><p>The Ji Clan cultivators glared back at him furiously, but in this case, there was no logical argument that could be used against the Fang Clan. If the circumstances were different, the Ji Clan might be able to disregard that, but on this day, during the coronation of the Fang Clan’s Clan Chief, they had only two choices. One was to start a full-scale war with the Fang Clan, and the other... was simply to accept the situation.</p><br/><p>After all, they truly had been trying to steal the copper coin!</p><br/><p>The Ji Clan was domineering in the Ninth Mountain and Sea, a fact known by all the cultivators there. Therefore, many of their cultivators simply couldn't tolerate Meng Hao’s words, and one of them was even about to open their mouth to fire back a rebuke. However, the frowning young man standing off to the side looked deeply at Meng Hao and then smiled.</p><br/><p>“Many thanks for your reminder, Fellow Daoist Meng. Earlier, I truly seem to have overlooked that that man had such ulterior motives.” The young man’s voice wasn’t very loud, but it contained an inherent power and dignity. He swished his sleeve, and immediately, all of the Ji Clan backed down.</p><br/><p>Everything that was happening immediately made the young man completely conspicuous among the other Ji Clan cultivators. Now, instead of seeming completely ordinary, he seemed the exact opposite.</p><br/><p>All of the cultivators from the other sects and powers in the Ninth Mountain and Sea were now staring at him and speculating about his identity.</p><br/><p>“Could it be that he's this generation’s mysterious, never-before-seen... Son of Ji? Ji Dongyang?”</p><br/><p>Fang Xiufeng, Fang Shoudao and the others also looked thoughtfully at the young Ji Clan cultivator. Meng Hao hovered in midair, looking into the young man’s eyes. Meng Hao’s gaze burst with killing intent for a brief moment, after which the young man staggered backward, the blood draining from his face and his eyes widening.</p><br/><p>Meng Hao’s expression was the same as ever, although a tremor ran through his body. After returning to Fang Xiufeng’s side, he suddenly made a decision.</p><br/><p>Ji Tian wants to kill my dad, so therefore... I'm going to kill this young man!</p><br/><p>In that instant, the young man’s heart trembled. From Meng Hao's eyes, it was possible to tell how incredibly strong he was, and the intense killing intent within the gaze had forced the young man backward. Turning to his fellow clan members, he growled, “Let’s go. We’re leaving Planet South Heaven!”</p><br/><p>In response to his words, the other members of the Ji Clan began to unleash the power of their cultivation bases. As they clustered around the young man, one of their members, an older man, clasped hands toward Fang Xiufeng.</p><br/><p>“Fellow Daoist Xiufeng, congratulations on becoming the Clan Chief of the Fang Clan. We have an urgent matter to attend to, so we’ll take our leave now!” Without even waiting for a response from Fang Xiufeng, the man flew into the air, followed by the young cultivator and all the other members of the Ji Clan. All of them transformed into prismatic beams of light that shot up into the sky.</p><br/><p>“Dad, Patriarch Shoudao, Patriarch Yanxu,” Meng Hao said quietly, “I'm feeling a bit under the weather. Since nobody else will be offering any challenges, I'm going to go rest.” Fang Shoudao and Fang Yanxu exchanged a hesitating glance. Considering their intelligence and cultivation bases, it wasn't difficult for them to guess what Meng Hao was planning to do.</p><br/><p>Fang Shoudao and Fang Yanxu were hesitating, but Fang Xiufeng looked up and said, “Health comes first. Go ahead.”</p><br/><p>His eyes flickered with killing intent. He was not the type of person who was willing to let others get the best of him, and thanks to Meng Hao, he was now certain that his previous difficulties in stepping into the Dao had something to do with the Ji Clan.</p><br/><p>Meng Hao was his son, and he knew him well enough to know that he wasn’t an impulsive person. Therefore, Fang Xiufeng supported his decision, both as his father and as the Clan Chief.</p><br/><p>Meng Hao nodded, then shot up into the air in a streak of light.</p><br/><p>The coronation ceremony for the Clan Chief continued. After what had just happened, no one challenged Fang Xiufeng to fight. However, observant people noticed that up in the sky, a mass of dark clouds had appeared at some point.</p><br/><p>Apparently, the weather was changing. Rain began to fall, and clouds roiled out to cover the whole sky. If you looked up, you would see that the entire sky had been obscured, almost as if a spell formation were sealing everything.</p><br/><p>At the same time, the same dozen or so Ji Clan cultivators were flying through the layers of clouds. Lightning crashed and boomed around them as they flew upward.</p><br/><p>“Young Lord, why are we rushing to leave? Even though they killed one of our Ji Clan’s cultivators, they still need to try to maintain the moral high ground! There’s no way they would dare to openly start attacking all of us, is there?! That Meng Hao must be killed sooner or later!”</p><br/><p>A few of them began to make sneering comments. “That’s right, if they dared to attack us in the open, our Patriarch’s eye would certainly see it! He can see everything in the Ninth Mountain and Sea! Even if the Fang Clan were more foolhardy than they already are, they still wouldn't dare to make a move on us!”</p><br/><p>“That Meng Hao really does defy laws and principles, even of the Heavens,” one of the older cultivators said, snorting coldly. “It's too bad there were so many other cultivators present, plus the Fang Clan backing him up. Otherwise, if he dared to act so audaciously, we would have just cut him down. He got lucky this time. Just wait until next time, when there aren’t any members from other sects or clans around, we’ll definitely exterminate him!”</p><br/><p>“Would you shut the hell up!” the young cultivator said, looking around at the clouds. “Do you really think Meng Hao didn’t consider all of that? You think that the other sects and powers made it so we couldn’t attack him? You think Meng Hao got off lightly? Well from my perspective, those people actually saved us!</p><br/><p>“Consider the matter dropped. Let’s get out of Planet South Heaven. Dammit... I can’t believe Meng Hao can actually control the South Heaven Death Formation!” The other cultivators followed along quietly, although none of them agreed with his decision.</p><br/><p>They were the Ji Clan, and after all these years, they had grown used to being above everyone else. No matter where they went in the Ninth Mountain and Sea, all they had to do was reveal that they were from the Ji Clan, and everyone would instantly act very respectfully and even shake in fear. After all, the Ji Clan was the Lord of the Ninth Mountain and Sea!</p><br/><p>With a position and standing like that, they never really needed to spend much time thinking about anything in any situation. They always viewed themselves as the strongest party, like Emperors. As such, why would they need to spend time considering the common people?</p><br/><p>The young cultivator looked at his companions and sighed inwardly with remorse. He was well aware that the members of the Ji Clan were too used to being in a superior position, and had lost their ability to sense danger.</p><br/><p>It was at this moment that they emerged from the cloud layer, and found themselves at the very edges of the skies above Planet South Heaven, just a short distance away from the void of space. Suddenly, the young man saw something which caused his pupils to constrict.</p><br/><p>“Meng Hao!!”</p><br/><p>He wasn't the only surprised one. The other Ji Clan cultivators’ faces fell as they caught sight of Meng Hao, standing in the air above them, eyes shining coldly, lightning crackling and crashing around him.</p><br/><p>Voice cool, he said, “Now that nobody’s around to stop me... I'm going to cut down some Ji Clan cultivators!”</p><br/><p>Lightning crashed and danced in all directions.</p><br/><p>Meng Hao extended his hand and pushed it down toward South Heaven. Rumbling sounds echoed out as, all of a sudden, a huge illusory net appeared around him, which was none other than the South Heaven Death Formation.</p><br/><p>The Death Formation net rapidly transformed into a huge hand, which radiated boundless killing intent, causing colors to flash and thunder to boom.</p><br/><p>The young Ji Clan cultivator’s face flickered, and he performed a double-handed incantation gesture. He roared as innumerable shocking Karma Threads appeared around him, transforming into innumerable magical items that shone with dazzling light and shot toward the hand. Simultaneously, killing intent began to roil off of all the other Ji Clan cultivators, and the dozen or so of them joined together in unleashing their entire cultivation bases to defend against the hand.</p><br/><p>When the magical techniques and divine abilities, as well as the magical items, slammed into the huge hand formed by the spell formation, they were completely powerless. They shattered into nothing, crushed like dried weeds by the spell formation hand. Rumbling echoed out as the hand then slammed into the Ji Clan cultivators.</p><br/><p>Almost instantly, three of their number screamed and exploded into pieces, transforming into a rain of blood that fell down through the clouds.</p><br/><p>“Meng Hao, how dare you kill Ji Clan cultivators! Our Patriarch is going to slaughter you!!” In the following instant, another three Ji Clan cultivators were killed. Blood sprayed out of their mouths, and they exploded.</p><br/><p>The cries they let out before dying never went beyond the clouds, nor did they echo out into space. Down below, the only thing people could hear was thunder.</p><br/><p>“Ji Tian doesn’t dare to come to Planet South Heaven!” Meng Hao said coolly. He waved his right hand, causing boundless lightning to crackle within the clouds. There was so much lightning that it seemed as if the entire world were composed of nothing else, except for a few miserable screams interspersed between the booming thunder.</p><br/><p>The hand materialized by the South Heaven Death Formation was like Heavenly Tribulation from Planet South Heaven, something that could extinguish all life!</p><br/><p>And Meng Hao could control the South Heaven Death Formation. That mean that on Planet South Heaven he... was exactly as powerful as Emperor Tang! Unsurpassable!</p><br/>\n</div>"}