{"title": "Chapter 1190: Grand Ceremony in the Fang Clan!", "id": 1190, "volume": 12, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-1190-grand-ceremony-in-the-fang-clan", "volume_title": "Volume 12", "body": "<h1>Chapter 1190: Grand Ceremony in the Fang Clan!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 1190: Grand Ceremony in the Fang Clan!</strong></p><br/><p>The Fang Clan was one of the Four Great Clans of the Ninth Mountain and Sea. In the past, they had struggled with Ji Tian for Lordship over the entire Mountain and Sea. If you added in the events of the battle of Planet East Victory in which the first generation Patriarch exploded out with power, it truly showed that the clan was as strong as ever, despite the loss of blood and wealth due to the internal strife which had struck them.</p><br/><p>Although there would always be some suspicion that the clan was much weaker than they let on, given some time, they would surely be even more powerful than before.</p><br/><p>Then there was Meng Hao’s status as an Echelon cultivator. The news of that had already begun to spread. Coupled with the fact that he was strong enough to sweep over all the other Chosen, it ensured that the Fang Clan was clearly poised on the verge of having even greater influence.</p><br/><p>Everyone knew that the Fang Clan had the first generation Patriarch, two Dao Realm experts, and the most powerful Chosen in the Ninth Mountain and Sea. When a clan like that held a ceremony to appoint its Clan Chief, it can easily be imagined how much of a commotion it caused.</p><br/><p>Because Fang Xiufeng had successfully stepped into the Dao Realm, the Fang Clan’s overall power was now one step higher. Aside from the Three Great Daoist Societies or the Ji Clan, no other sect or clan in the entire Ninth Mountain and Sea could match up to them in terms of combat strength.</p><br/><p>As the ceremony got under way, numerous buildings were constructed on Planet South Heaven. Countless majestic palaces sprang up, and one mountain after another was razed. The Fang Clan’s citadel was now like an enormous, sprawling beast.</p><br/><p>There were also numerous spell formations connecting Planet South Heaven to Planet East Victory. In fact... before long, Planet South Heaven could very well become the nucleus of the Fang Clan.</p><br/><p>Although there were certain limitations to the place, those limitations would also serve to protect the Fang Clan. By now, they controlled two planets. Obviously, their rise to power was not something that could be stopped.</p><br/><p>Millions of Fang Clan cultivators came from Planet East Victory and spread out into various regions of Planet South Heaven. The Fang Clan’s ancestral mansion was a hundred times larger than before, and it was in its central square that the grand ceremony was to take place.</p><br/><p>On that day, starting at dawn, the teleportation portals on Planet South Heaven flashed continuously as cultivators from all of the various sects and clans throughout the Ninth Mountain and Sea arrived.</p><br/><p>There were friends of the Fang Clan, and also enemies. It was the same for Fang Xiufeng, and many who were there came for him specifically. These people could only sigh inwardly when they thought about the rumors that he had successfully stepped into the Dao. Although many people might want to challenge him to a fight, few actually dared.</p><br/><p>Many, many people came. The Three Churches and Six Sects were present, as well as many of the large clans. There were also countless smaller sects and even rogue cultivators who flocked to Planet South Heaven, all of whom the Fang Clan arranged accommodations for.</p><br/><p>The Three Great Daoist Societies came, and even the Ji Clan sent people. On the surface, there was no display of the undying enmity between the Fang and Ji Clans.</p><br/><p>The Chosen of many sects and clans had friction with Meng Hao, and yet, all of those sects and clans sent representatives. Surprisingly, though... not a single one of the Chosen could be seen. It was almost as if they had collectively decided ahead of time not to come. As for Fatty, and Meng Hao’s other long-time friends, none of their sects sent them to attend.</p><br/><p>That was understandable. Meng Hao was now so powerful that he struck fear into the hearts of even the experts in the elder generation. If they had sent disciples of the Junior generation to the ceremony, it would have been seen as an embarrassment.</p><br/><p>Furthermore, Meng Hao’s A Writ of Karma was now well-known in the Ninth Mountain and Sea. Everyone knew that he liked to get Chosen members of his generation to owe him money through Karma. Therefore, the less they encountered him the better.</p><br/><p>In the end, it was mostly older cultivators who showed up.</p><br/><p>At high noon, when the sun blazed up above... the ceremony began!</p><br/><p>Numerous beams of light flew through the air toward the central square of the ancestral mansion, where rows and rows of tables had been set up. Tables were even hovering in the air, tens of thousands of them. As the cultivators arrived, they were shown to their seats by the Fang Clan members in charge of the proceedings. The Dao bell was even teleported over, and hung high up in the sky, looking very threatening.</p><br/><p>The Fang Clan ensured that all the tables were filled with everything from spirit alcohol to Immortal fruit. The ceremony was to last for three days, and the expenditure for such an affair was terrifyingly enormous. However, the number of congratulatory gifts was also scalp-numbing.</p><br/><p>Fang Shoudao took charge of it all, being the one with the most experience in that regard.</p><br/><p>On the first day of the grand ceremony, everyone watched as Fang Xiufeng emerged, offered sacrifices to the ancestors and called upon the starry sky. Then, all sorts of rites and functions were held before that part of the ceremony concluded.</p><br/><p>The cultivators who had come to observe the ceremony and offer congratulations were all waiting for the second day. Customarily, the three day-long coronation of a Clan Chief for a clan as powerful as the Fang would include the formality of severing enmities. That was what most people were looking forward to.</p><br/><p>Meng Hao was still in a coma. For him, it was like a long dream. Within that dream, he visited a special world, a place where the Mountain and Sea Realm had just appeared. He saw a clan offering sacrifices to him, creating an ancestral gate, and setting up spell formations.</p><br/><p>On the dawn of the second day, a huge banquet was set up in the main square. Fang Shoudao’s powerful voice echoed out in all directions: “The Fang Clan has chosen Fang Xiufeng as its Clan Chief!</p><br/><p>“Ladies and gentlemen, whatever debts or enmities he had with you will be ended this day. From now on, Fang Xiufeng is the Clan Chief, and anyone who dares to provoke, slander, or vilify him will face the wrath of the entire Fang Clan!” Fang Shoudao looked around slowly. He had already made plenty of preparations to ensure that nothing untoward happened.</p><br/><p>The most important factor was that Fang Xiufeng was already in the Dao Realm. Everyone knew this, so it was hard to believe that people would come looking to die. After all, that is what would happen when challenging a Dao Realm Clan Chief.</p><br/><p>“Let the formalities begin!” Fang Shoudao sat in place, and when he spoke, his voice echoed like thunder. Fang Xiufeng sat calmly next to him, looking very threatening despite not being angry. He seemed to be filled with an invisible energy that caused anyone who looked at him to tremble inwardly, and even left their cultivation base unstable.</p><br/><p>Anyone in the Dao Realm who came had to suppress themselves down to the Ancient Realm, which meant that nobody could possibly be a match for Fang Xiufeng. He was the only person present that was truly in the Dao Realm.</p><br/><p>A buzz of conversation could be heard from the audience. Fang Shoudao waited for a long moment, but seeing that nobody stepped forward, he closed his eyes to wait for time to pass. He didn’t seem surprised at all by the lack of challengers.</p><br/><p>However, in almost the exact moment that he closed his eyes, a burly man stepped out from the crowd. He was fully six meters tall, emanated the ripples of the Immortal Realm, and caused the ground to shake with each step.</p><br/><p>“Fang Xiufeng, there exists no enmity between us. However, I shall stand for the people to challenge you to a fight. After today, there will be no more such opportunities!”</p><br/><p>Grinning, the man stamped his foot down violently, causing a boom to echo out as his cultivation base erupted with power. A windstorm instantly surged in the entire area.</p><br/><p>However, that windstorm was simply too small. His cultivation base was clearly only in the Immortal Realm. To challenge the Clan Chief of the Fang Clan with a cultivation base like that caused all of the surrounding cultivators, including those from the Three Churches and Six Sects, to look on with strange expressions.</p><br/><p>Fang Shoudao frowned, and inwardly, began to get an uneasy feeling.</p><br/><p>“Fang Xiufeng, I challenge you!” the burly man roared. He seemed confident and at ease, but if you looked closely, you would see that he was trembling. Furthermore, a flicker of terror existed deep within his eyes.</p><br/><p>He was like an ant challenging a giant to do battle! However, there was clearly some reason for him to be making a laughingstock of himself.</p><br/><p>Fang Xiufeng opened his eyes and looked coldly at the man. It was obvious that the man was up to something. Otherwise, why would a nobody like him try to stir things up at a grand ceremony like this?</p><br/><p>A Fang Clan cultivator immediately stood up and angrily cried out, “Enough of this horsing around! With your cultivation base, you’re obviously not settling enmities, you’re just causing trouble. Men, remove him!”</p><br/><p>Fang Clan cultivators instantly flew toward the burly man.</p><br/><p>Apparently, the man had anticipated that this would happen. He immediately fell back, gritting his teeth and placing a medicinal pill into his mouth. As soon as he crushed it between his teeth, his body began to tremble violently. His cultivation base exploded with power, and his energy rose wildly. He instantly broke through from the Immortal Realm into the Ancient Realm. The price was that his body withered rapidly. The medicinal pill he had consumed was clearly toxic, and drew on his life force to forcibly increase his cultivation base.</p><br/><p>Considering the price he was paying, he would only be able to maintain such a state for less time than it takes half an incense stick to burn. Then he would be killed in body and spirit, and nobody would be able to save him.</p><br/><p>“Fang Xiufeng, there's someone who wanted me to ask you whether or not you'll honor the words you spoke on Planet West Felicity?!” With a shriek, the man coughed up a mouthful of blood and then transformed into a beam of light that shot toward Fang Xiufeng.</p><br/><p>As Fang Shoudao looked on with furrowed brow, Fang Xiufeng's eyes glittered, and he nodded. Then, he waved his right finger and the incoming burly man shuddered and then exploded in midair.</p><br/><p>As soon as he died, another cultivator flew out. This man was also merely in the Immortal Realm, but he also consumed a medicinal pill, causing his energy to rocket up as he shouted at Fang Xiufeng. Fang Xiufeng sat there thoughtfully for a moment before waving his finger again.</p><br/><p>A third, a fourth, a fifth....</p><br/><p>One cultivator after another appeared, until the total reached forty.... All of the cultivators who had come to observe the ceremony looked on with strange expressions. The reactions were even more obvious within the Fang Clan. Anybody who saw something like this happening would be able to tell that something strange was going on.</p><br/><p>However, things weren’t over. More cultivators appeared, all of whom acted in exactly the same way. They sacrificed their lives, resulting in Fang Xiufeng’s cultivation base being slowly worn down. On any other occasion, it wouldn't matter. However, Fang Xiufeng still had his Dao injury, and shouldn’t even have been fighting. Perhaps one or two exchanges wouldn’t matter, but this was an endless cycle. The people who were continuously attacking him might not have very high cultivation bases, but the medicinal pills they were consuming temporarily gave them explosive power.</p><br/><p>Fang Xiufeng could kill them as easily as crushing ants….</p><br/><p>However... even crushing ants can be troublesome if there are too many!</p><br/><p>Clearly, someone wanted Fang Xiufeng’s injuries to reach the point where they wouldn't heal. They wanted to force him to fight.</p><br/><p>Of course, he could refuse. He could ask cultivators from his clan to take care of the problem. However, whoever had organized this would obviously have thought of such a possibility, and would surely have prepared a contingency plan.</p><br/><p>Fang Xiufeng’s eyes flickered coldly.</p><br/><p>This was a situation in which he could not accept the help of others. This was the Clan Chief’s coronation, and his challengers were only in the Immortal Realm. If he needed help from others, the Fang Clan would be criticized for years to come, and would be viewed as a joke.</p><br/><p>Fang Shoudao’s face was very dark. Although helping Fang Xiufeng would cause problems, it was only in terms of face, leading him to consider intervening. Fang Xiufeng suddenly frowned, as if he had thought of something. He was keeping his injuries under control, but if he really did end up fighting hundreds of cultivators, then eventually he would lose control, and his injuries would flare up.</p><br/><p>It was at this point that another cultivator flew out. Before he could even get close, he cried,</p><br/><p>“Fang Xiufeng, you boor, my cultivation base might be weak, but I'm going to challenge you too. Do you dare to fight me?!” The cultivator was trembling, and apparently, had been forced to work up his nerve even to speak. However, he was clearly willing to throw all caution to the wind.</p><br/><p>Fang Xiufeng eyed him coldly, and was just about to wave his finger, when all of a sudden a cold voice echoed through the air to fill the square.</p><br/><p>“You think you qualify to challenge my dad?”</p><br/>\n</div>"}