{"title": "Chapter 1208: Slaying Ji Dongyang Again!", "id": 1208, "volume": 13, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-1208-slaying-ji-dongyang-again", "volume_title": "Volume 13", "body": "<h1>Chapter 1208: Slaying Ji Dongyang Again!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong></strong></p><br/><p>[/expand]</p><br/><p>Although the messages in the jade slip were all from different people, the words were virtually the same!</p><br/><p>“Chu Yuyan’s soul is rapidly dispersing. Come to the Kunlun Society!”</p><br/><p>They all said the same thing!</p><br/><p>He received messages from his mother, father and sister, from Patriarch Shoudao... even from Taiyang Zi, Song Luodan, and Sun Hai....</p><br/><p>The greatest number of messages came from... Pill Demon!</p><br/><p>In addition, there was one message that had come through on the first day that Meng Hao had slipped into his strange trance of walking. It had come from Chu Yuyan.</p><br/><p>“Meng Hao.... I hope that you and Xu Qing can have a safe and peaceful life together....” That single message caused Meng Hao’s heart to feel as if it were being stabbed with blades.</p><br/><p>Meng Hao was trembling; he couldn’t quite tell what he was feeling at the moment. However, one thing he was sure about was that if Chu Yuyan’s soul was dispersing, it couldn’t be an accident. There had to be more to the story.</p><br/><p>He had no time to sit there thinking. Nor was he even sure what exactly he should be thinking about. Only one thought filled his mind, and that was that he did not want Chu Yuyan to perish.</p><br/><p>“How could this have happened...?” he murmured, transforming into a colorful streak of light that shot toward the nearest asteroid teleportation portal at high speed.</p><br/><p>As soon as he appeared there, people recognized him and their faces flickered. Many of them were well-aware of how everyone in the Ninth Mountain and Sea had been looking for him over the past few days.</p><br/><p>Immediately, sounds of discussion could be heard:</p><br/><p>“Did you hear about Meng Hao’s old flame Chu Yuyan from the Kunlun Society…? Her soul is dispersing....”</p><br/><p>“These past few days, everyone has been trying to find him, but sadly, nobody could. And now here he is....”</p><br/><p>“Well, he deserves it with that vicious personality of his. A lot of people are happy to see this happening.”</p><br/><p>Meng Hao blasted forward like the wind, but he could still hear everyone talking, and their words stabbed at his heart like sharp swords. Suddenly, he turned his head, sweeping over them with his gaze. Rumbling sounds could be heard, and one cultivator after another coughed up blood and staggered backward, their cultivation bases collapsing as they let out miserable shrieks.... Those were the cultivators who had just spoken biting words.</p><br/><p>On any other occasion, Meng Hao wouldn’t even have acknowledged them. But now, in the throes of deep anxiety, the words they spoke crossed his bottom line.</p><br/><p>Rumbling could be heard as he shot toward one particular destination. It was none other than the teleportation portal leading to the Kunlun Society.</p><br/><p>However, just before he reached it, a dozen or so figures suddenly emerged from the crowd to block his path.</p><br/><p>Based on the ripples emanating from their cultivation bases, it was obvious that these people were from the Ji Clan. Furthermore, the person leading them was... Ji Dongyang!!</p><br/><p>Who knew how long he had been here, and now, in Meng Hao’s most anxious moment, he was leading members of the Ji Clan to prevent Meng Hao from entering the teleportation portal.</p><br/><p>“Well well, if it isn’t Brother Meng? What’s gotten you so anxious?” Ji Dongyang laughed heartily, eyes shining with a strange light. He almost seemed to be eyeing prey, as if he were trying to lure that prey in a certain direction, to control its growth and development.</p><br/><p>“The dispersal of Chu Yuyan’s soul has really given me a good opportunity to domesticate my prey.” Ji Dongyang’s smile grew more radiant, and the eyes of the Ji Clan cultivators behind him glittered with killing intent.</p><br/><p>“Screw off!” Meng Hao roared, his face grim and his voice echoing like thunder. The Ji Clan cultivators were instantly enraged, and shot directly toward him.</p><br/><p>“What gall! Our Clan Prince allowed you to stop and chat! How dare you say rude things!”</p><br/><p>“Scram!” Meng Hao’s expression didn’t change at all as he performed an incantation gesture. Everything rumbled, and the starry sky shook. The entire asteroid vibrated as an amorphous tempest shot out toward the members of the Ji Clan.</p><br/><p>As he flew through the air, everything around him shook violently. The tempest was like a huge mouth, bellowing in rage at the Ji Clan cultivators. Blood sprayed out of their mouths and they were sent tumbling backward. There were even a few who directly exploded, killed in body and spirit.</p><br/><p>Meng Hao had already reached the point of disregarding everything else!</p><br/><p>“Brother Meng, did I offend you or something? All I did was call out a greeting, and yet you dared to kill the people of my Ji Clan?” Ji Dongyang’s face was grim as he took a step forward, causing explosive waves of qi to roll out in all directions. Shockingly, they transformed into a shield of light, which... completely blocked the way to the Kunlun Society teleportation portal.</p><br/><p>The surrounding cultivators looked on silently, and even backed up. They looked at the shield with mixed feelings. Anyone who was watching this scene would be able to see what the Ji Clan was overtly attempting to do.</p><br/><p>In Meng Hao's moment of deepest anxiety, when he wanted nothing more than to get to the Kunlun Society, the Ji Clan actually blocked his path, in order to delay him even further. All of it was to make Meng Hao even more anxious than before.</p><br/><p>In any other circumstance, he could shrug it off. But now, when he wasn’t even certain whether Chu Yuyan was alive or dead, for the Ji Clan to do something like this... caused even the surrounding cultivators to feel that they were being excessive.</p><br/><p>And yet, some of them were happy to delight in the misfortunes of others, and their eyes glinted wickedly.</p><br/><p>Seeing that his way to the teleportation portal was being blocked caused Meng Hao’s eyes to burst with killing intent. Without stopping, he charged forward like a meteor directly toward Ji Dongyang.</p><br/><p>As he closed in, Ji Dongyang snorted inwardly, performed a double-handed incantation gesture and then shot backward, unexpectedly passing through the protective shield. Next, Meng Hao slammed bodily into the shield.</p><br/><p>A huge boom could be heard; Meng Hao’s fleshly body was comparable to a magical item, and his attack power was backed by the cultivation base of an Allheaven Dao Immortal. He was like a sharp arrow that instantly pierced through the shield.</p><br/><p>As it shattered, he continued on toward the teleportation portal like a lightning bolt. He took no time to get entangled with Ji Dongyang; his only goal was to get to the Kunlun Society as quickly as possible.</p><br/><p>However, just when Meng Hao was about to step into the teleportation portal, cracking sounds could be heard as it... shattered into pieces!</p><br/><p>Ji Dongyang smiled at Meng Hao as if he were looking at a trapped animal.</p><br/><p>“Brother Meng, how could you be so rash?” he said. “I wasn’t actually trying to stop you, I had just set up some defenses around the teleportation portal because it was too old, and in need of repair. It was already on the verge of shattering. See how much I care about you? I didn't want any problems to occur if you stepped into it, that’s why I blocked your way.</p><br/><p>“Well, there’s no need to thank me. It was really the right thing to do.”</p><br/><p>Meng Hao trembled, slowly turning around, his murderous aura exploding up. Ji Dongyang continued to smile as he slowly backed up.</p><br/><p>“Brother Meng, I did all of this with the best of intentions. I’ll take my leave now, but don’t worry, we’ll have plenty of time to get to know each other better in the future, and also... to build up plenty of Karma between us....” Smiling mysteriously, his body began to fade away.</p><br/><p>“You want Karma? I’ll give you some Karma!” Meng Hao took a deep breath, and his murderous aura grew stronger as he shot in a beeline toward Ji Dongyang.</p><br/><p>He moved as fast as lightning, using the exact same bizarre walking technique that he had just spent the past several days getting familiar with!</p><br/><p>None of the onlookers could see anything strange about it, not even Ji Dongyang. He continued to smile as he faded away.</p><br/><p>Meng Hao rumbled through the air, making a grasping motion with his right hand. Immediately, the copper mirror began to materialize. Before it could even become fully clear, it changed shape, wrapping around Meng Hao’s hand, wriggling into the shape of... a long, pitch-black sword!!</p><br/><p>It was a wicked blade, like the weapon of a Devil, and it instantly slashed down toward the virtually invisible Ji Dongyang.</p><br/><p>However, the direction of the slash was not the position in which Ji Dongyang was vanishing, but rather, the space in front of that!</p><br/><p>As the blade slashed down, Meng Hao took another step. All of a sudden, all of the onlookers experienced something bizarre.</p><br/><p>Suddenly, everything split apart as two different periods of time appeared in front of their eyes. They were like mirror images that twisted... and then turned into a strange vision.</p><br/><p>Within that vision, the teleportation portal which had just collapsed... twisted and returned to a state of wholeness. Different versions of Ji Dongyang and Meng Hao could now be seen, like reflections. The reflection of Ji Dongyang had exactly the same expression as before, and was saying the same things. Everyone could see exactly what had just happened moments ago. Then, Ji Dongyang’s reflection began to move back to the location where he began vanishing, and also, toward the place where Meng Hao was slashing the sword down.</p><br/><p>It was almost as if Ji Dongyang were personally delivering himself up to Meng Hao’s blade. Meng Hao’s Battle Weapon slashed through the reflection of Ji Dongyang, which didn't stop, but rather, continued on to the vanishing Ji Dongyang, with whom it then merged.</p><br/><p>At the same time, the teleportation portal collapsed, and Meng Hao... said the same cold words he had spoken before. Then he shot forward, formed the Battle Weapon, slashed out, and merged with his true form.</p><br/><p>All of it happened very quickly, and made people confused as to what they were actually seeing. Everyone was shocked and dazzled.</p><br/><p>When the true forms of Meng Hao and Ji Dongyang merged with their reflections, Meng Hao looked the same as before. However, Ji Dongyang, who was fading away, suddenly let out a bloodcurdling scream. His blurry figure was then separated into two parts!!</p><br/><p>“What Daoist magic is that!?!?” he roared in disbelief. Then the two parts of him faded away.</p><br/><p>The only thing that remained behind was an echoing voice filled with terror and astonishment,</p><br/><p>An injury inflicted within the flow of time, which then merged with the present!</p><br/><p>Meng Hao had used the strange walking technique to come up... with a battle tactic that was perfectly suited to him!</p><br/><p><em>I twist time, giving me the power to go back into the past and slash you with my blade. When your reflection merges with your true form, then that injury... will become a reality!</em></p><br/><p>The surrounding cultivators all gasped. If you added all these people together, the types of magical techniques they had seen collectively throughout their lifetimes were vast. And yet... none of them had ever seen anything as unbelievable as what they had just witnessed.</p><br/><p><strong>Chapter 1208: Slaying Ji Dongyang Again!</strong></p><br/>\n</div>"}