{"title": "Chapter 1227: Daoist Priest!", "id": 1227, "volume": 13, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-1227-daoist-priest", "volume_title": "Volume 13", "body": "<h1>Chapter 1227: Daoist Priest!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 1227: Daoist Priest!</strong></p><br/><p>“The Dao is in My Heart The Will is in My Eyes I Shall Possess the Mountains and Seas Seal the Heavens Incantation!”</p><br/><p>Meng Hao had just arrived in the Righteous Noble Sect. It was currently evening; the sun was setting off in the distance, and a cool breeze rustled through the swaying flowers and vegetation that covered the mountains. Meng Hao stared blankly at this Master of his, whose unreliability could only be outdone by Patriarch Reliance....</p><br/><p>He listened silently as the Daoist priest began to explain the so-called something-something Seal the Heavens Incantation.</p><br/><p>“This incantation is incredibly powerful. Super powerful. Invincibly powerful!</p><br/><p>“Its creator is a one-of-a-kind super genius in the Eighth Mountain and Sea-- no, in fact, no one else like him has existed since the creation of the Mountain and Sea Realm!</p><br/><p>“The first requirement of the incantation is that you possess a righteous, noble aura. Then, you must have a fearless heart. You have to place the Eighth Mountain and Sea within your heart, and then do the same for all the other Mountains and Seas, until all Nine Mountains and Seas are inside of you. After that, you can... force the Mountain and Sea Realm to recognize you as its Lord!</p><br/><p>“If you succeed, then you will have completed the first step of the incantation. After that is the second step, Sealing the Heavens. You will have to seal each one of the 33 Heavens, which will in turn cause your cultivation base to increase by a factor of 100% with each sealing!</p><br/><p>“After sealing the 33 Heavens, then, theoretically speaking, your cultivation base should be 33 times more powerful!” As the Daoist priest spoke, his expression was one of reminiscence, and he seemed profoundly ancient.</p><br/><p>Meng Hao hesitated for a moment. Seeing how entranced the Daoist priest seemed to be, he couldn’t hold back from asking, “And after that...?”</p><br/><p>“After that? There’s nothing after that,” the Daoist priest replied, glaring. “By that point, you’ll be invincible. You don’t need anything after that. Besides, it's hard to imagine anything more. Impossible, really!”</p><br/><p>After a moment of silence, Meng Hao asked, “Master, um... sir, you created the something-something Seal the Heavens Incantation, right?”</p><br/><p>“Hahaha! So, so you live up to my expectations as my disciple, even if you’re not quite as smart as me. Excellent deduction. Since you found me out, Master won’t hide the truth any longer. You are absolutely, positively correct. Aii. Your Master has been keeping this secret for two thousand years now; at long last I can speak it out in the open.</p><br/><p>“Righteous Haowie, listen well. The Dao is in My Heart The Will is in My Eyes I Shall Possess the Mountains and Seas Seal the Heavens Incantation was created by me. It is the most powerful, most mysterious, and most supreme Daoist magic in the Righteous Noble Sect!” The Daoist priest swished his sleeve and raised his right hand dramatically into the air.</p><br/><p>Meng Hao chuckled wryly. He suddenly realized he had a headache.</p><br/><p>The Daoist priest glared at Meng Hao out of the corner of his eye, clearly displeased. “This is when you’re supposed to cheer!”</p><br/><p>Meng Hao stood there silently. However, the Daoist priest continued to hold the pose tenaciously. After a long, awkward moment, Meng Hao thought about how the man had protected him, and he sighed. Forcing himself to sound excited, he said, “Master, you’re so incredible!”</p><br/><p>The Daoist priest laughed loudly, then lowered his hand.</p><br/><p>“Just trust your Master. The Dao is in My Heart The Will is in My Eyes I Shall Possess the Mountains and Seas Seal the Heavens Incantation is incredibly powerful. Considering the level of my cultivation base, I can only use it at ten percent of its full power. But even that ten percent is very, very, very powerful! Way more powerful than me, you have my word on that!” The Daoist priest was bragging so hard that, though he was trying to seem high and mighty, spittle flew from his mouth.</p><br/><p>With that he swished his sleeve, raised his right index finger into the air, and pointed straight up into the sky. “Come, come, it’s time to practice the incantation. Just watch how I do it.</p><br/><p>“The Dao is in My Heart!” he roared, causing the words to echo out through the sect. Meng Hao couldn’t help but notice that all of the disciples in the Daoist rite temple at the base of the mountain quickly lowered their heads in embarrassment. He looked back at the Daoist priest, unable to prevent his eyelid from twitching uncontrollably.</p><br/><p>The Daoist priest then bent his legs to form a circle... then raised his right hand up again, except this time to his forehead....</p><br/><p>“Follow me!” he said, glaring at Meng Hao. “Come on!”</p><br/><p>Meng Hao cleared his throat and thought once again about how the Daoist priest had personally taken him under his protection. Sighing, he bent his legs to form a circle and then, with difficulty, raised his hand vertically in front of his forehead.</p><br/><p>“Say the words!” urged the Daoist priest.</p><br/><p>Meng Hao gritted his teeth and finally decided to just give in. “The Dao... The Dao is in My Heart!” he roared.</p><br/><p>The Daoist priest’s eyes glittered, and he laughed. “Good, very good. Now for the second stance.”</p><br/><p>Next, he lifted his left hand up and held it horizontally in front of the other hand, to make the character .</p><br/><p>“The Will is in My Eyes!” he roared. No matter how you looked at it, the horizontal position of his left hand made it so that his eyes were completely covered up.</p><br/><p>Having no other choice, Meng Hao followed suit.</p><br/><p>“I Shall Possess the Mountains and Seas!” the Daoist priest cried. He then he squatted down, and leaped high into the air, looking very much like a frog....</p><br/><p>Meng Hao gaped with wide eyes, but finally gritted his teeth and followed along, jumping up into the air....</p><br/><p>“Seal... the Heavens... Incantation!” Hovering there in midair, the Daoist priest stretched both hands out wide, threw his head back and roared. His voice resonated out in all directions, becoming clearly audible to even the cultivators who had surrounded the sect. Strange expressions became visible on all of their faces.</p><br/><p>As for Meng Hao, he simply didn’t have the courage to yell out the words ‘Seal the Heavens Incantation’ so loudly. Smiling bitterly, he spoke them out much more quietly, and then splayed his arms. The entire area around him then filled with... nothing. There was absolutely no change.</p><br/><p>“Not bad!” the Daoist priest said, looking pleased. “You keep practicing this magic for the next two months. Trust me, it's incredibly powerful, invincible in Heaven and Earth. It can sweep across anything in the Mountains and Seas, and can even exterminate Paragons!”</p><br/><p>Meng Hao couldn't think of anything to say in response.</p><br/><p>“Alright, that will do for now. You keep cultivating that on your own, I have some things to take care of.” With that, the Daoist priest waved his sleeve and headed down the mountain, quickly vanishing.</p><br/><p>Meng Hao sighed and sat down cross-legged. Frowning, he began to consider what other options were available in escaping the Heavengod Alliance’s manhunt, as this place... wasn’t a long-term option. The Daoist priest was muddle-headed, but the First Patriarch of the Righteous Noble Sect was not, and clearly wasn’t willing to let him stay here permanently.</p><br/><p>Obviously, the Daoist priest had forcefully demanded to have even the two months of time.</p><br/><p>“Well, that’s fine,” Meng Hao thought. “That will be enough for me to finish healing up, and get back to my peak!” Eyes glittering coldly, he took a deep breath and then began to meditate to treat his injuries.</p><br/><p>Before too much time passed, rumbling could be heard from off in the distance, and a pillar of light shot up into the sky. Within that light was the shadow of a person who was seemingly teleporting off to some other location. Meng Hao immediately opened his eyes and looked over.</p><br/><p>He found himself looking in the direction of the Righteous Noble Sect’s teleportation portal.</p><br/><p>His eyes flickered for a moment before he once again began to work on his injuries.</p><br/><p>More time passed. Soon, ten days had gone by.... During those ten days, Meng Hao occasionally went down the mountain to watch the disciples of the Righteous Noble Sect practicing cultivation, where he could sense the qi flow of the Mountain and Sea Realm, as well as the righteous, noble aura. Unfortunately, he could only spend about half of each day working on healing his injuries. The other times, the Daoist priest would drag him off to cultivate the something-something Seal the Heavens Incantation.</p><br/><p>At first, Meng Hao was too polite to refuse. However, it quickly reached the point where he felt like he just couldn't take it anymore. Luckily, though, nothing strange happened as a result of practicing it; no misfortune, no lightning strikes, no spontaneous combustion.</p><br/><p>Although he wanted to refuse, every time he thought about how the Daoist priest had stood up to all of the cultivators out in the starry sky on his behalf, he simply couldn’t bring himself to say anything. So he went along, albeit halfheartedly.</p><br/><p>But then one day when he went down the mountain, he happened to be passing through a valley when he overheard two disciples talking.</p><br/><p>“Elder Grandfather Noble Ran has gone crazy again.... For the past ten days or so, he's been using the teleportation portal at least ten times per day. All he does is send some random things to random places. What the heck is he doing?!”</p><br/><p>“It costs quite a few spirit stones to use the teleportation portal, especially for sending things to the destination and back. And he goes somewhere different every time....”</p><br/><p>“Well, there’s nothing you can do about it....” The two disciples sighed.</p><br/><p>Shaken, Meng Hao hurried over to where the teleportation portal was located, where he saw the Daoist priest handing some spirit stones over to the disciple in charge. Apparently he was preparing to teleport some spirit creatures who were polymorphed into humanoid shapes.</p><br/><p>Sensing Meng Hao’s presence, the Daoist priest turned. As soon as he saw Meng Hao, he laughed heartily.</p><br/><p>“So, it’s my little disciple! Come, let’s head back and practice the Seal the Heavens Incantation some more.” He stepped forward, grabbed Meng Hao’s arm, and then sped back toward the mountain peak. Meng Hao didn't say anything on the way, and when they reached the mountain peak, he practiced the Seal the Heavens Incantation with unusual earnestness. He performed every motion meticulously, and even cried out the words as loud as possible.</p><br/><p>After practicing for a few hours, Meng Hao suddenly asked, “Master, why have you been using the teleportation portal so much in the past few days?”</p><br/><p>“Why?” the Daoist priest replied, sounding surprised. “Well for you, of course! I used to say you were almost as smart as me on a good day, kid, so how could you be so dumb?</p><br/><p>“After the two months are over, you’re going to need to teleport out of here. Since the teleportation portal are sealed, it’s impossible to leave the Heavengod Alliance directly. You can still teleport to regions that are near the exits, though. However, there are far too many methods to interfere with a teleportation, someone can even interrupt it when you’re halfway there.</p><br/><p>“Therefore, just to be safe, I'm clouding the waters a bit. If I activate the teleportation portal multiple times a day for two months in a row, then the people looking for you are gradually going to lose their patience. Then eventually you can just slip through.”</p><br/><p>Meng Hao’s heart trembled as he looked at the Daoist priest. This was a person he had never met before in his life, and yet had moved him repeatedly just in the past few days.</p><br/><p>The world of cultivation was a cold place in which people constantly fought and schemed against each other; it was a dog eat dog world. However, the more the world was like that, the more precious certain acts of beauty were. They were unforgettable things, things to be engraved upon the heart and never parted with.</p><br/><p>Perhaps there were certain qualities that remained in a cultivator no matter what level they practiced cultivation to. After all, in the end, they were people and not animals.</p><br/><p>Meng Hao looked at the Daoist priest for a moment, then clasped hands and bowed very deeply.</p><br/><p>In the following days, he did not practice half-heartedly any more. He would earnestly follow along with the Daoist priest in practicing the Seal the Heavens Incantation. He was convinced that it was not really a Daoist magic, but rather, something invented by the Daoist priest, a figment of his imagination.</p><br/><p>Eventually, Meng Hao learned that the Daoist priest had not always been this way. Once, a long time ago, he had left the sect only to return heavily injured, his beloved partner dead, and his children lost to the ravages of time. He came back alone, holding nothing but a piece of black leather the size of a hand, after which he lapsed into a coma.</p><br/><p>It was from that moment on that he occasionally became muddle-headed. As to what had happened to his family, he never talked about it. The sect made some investigations, but were never able to find any clues.</p><br/><p>However, the Daoist priest began to occasionally sit alone on the top of the statue on the mountain peak, looking off into the sky, laughing madly, raving, tears streaming down his face.</p><br/><p>A month into his time in the sect, Meng Hao even saw it happen once. The moon was shining high in the sky as the Daoist priest sat atop the statue, laughing or... perhaps crying.</p><br/>\n</div>"}