{"title": "Chapter 1222: Storm Clouds Approach", "id": 1222, "volume": 13, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-1222-storm-clouds-approach", "volume_title": "Volume 13", "body": "<h1>Chapter 1222: Storm Clouds Approach</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 1222: Storm Clouds Approach</strong></p><br/><p>Around the same time that countless cultivators in the Heavengod Alliance were combing the starry sky for Meng Hao, someone was passing through the barrier between the Eighth Mountain and the Ninth Mountain.</p><br/><p>Every step he took left him trembling, as if incredible pressure were weighing down on him. From the look of things, he had been traveling for a very long time to reach this point.</p><br/><p>“It’s not that much farther... it’s too bad that with this body, passing through the barrier is quite a task....” It was a young, handsome man whose eyes glittered as if with starlight and with a sense of enigmatic profoundness.</p><br/><p>It was none other than... Ji Dongyang!!</p><br/><p>“Meng Hao... the Eighth Mountain and Sea is where you and I... will become one!” A strange smile could be seen on his face, and his expression was one of anticipation as he continued to struggle through the barrier.</p><br/><p>Meanwhile, back outside the Heavengod Alliance, rumbling sounds could be heard coming from one particular asteroid field. The asteroids were collapsing into pieces and, shockingly, countless bones were flying out from inside them.</p><br/><p>The rumbling continued, and the asteroids were destroyed one after another. Soon, the bones had accumulated to the point of being endless.... Within those bones could be seen a man in a long black robe, sitting there cross-legged, his long hair swirling around him. He was gaunt, and yet terrifying ripples spread out from him in all directions. The ripples caused a good portion of the bones to slowly form together until they were a huge throne of bones, upon which the black-robed man settled.</p><br/><p>The rest of the bones converged next to the man to form nine enormous Bone Giants.</p><br/><p>In the same moment that the nine Bone Giants formed, the black-robed man’s eyes snapped open. His cultivation base erupted with power, and his qi and blood surged. At the same time, a mark appeared on his forehead.</p><br/><p>This was the Echelon cultivator of the Eighth Mountain, Han Qinglei!</p><br/><p>When he opened his eyes, the air around him distorted, and soon, numerous figures materialized out of the void. They quickly dropped to their knees and kowtowed in front of Han Qinglei.</p><br/><p>At a glance, it was possible to see that there were dozens of such figures, all of them kowtowing. One by one, they transmitted various messages to Han Qinglei, reporting to him what had occurred in the Eighth Mountain and Sea during his secluded meditation.</p><br/><p>Han Qinglei’s face was expressionless. However, after hearing all of the reports, his pupils constricted, and he focused on one specific kneeling figure.</p><br/><p>“Did you say Meng Hao?” he asked in a voice that caused the starry sky to tremble. His gaze was like lightning, completely menacing as he stared at the cultivator who had brought the news.</p><br/><p>The man trembled, and instead of transmitting his messages, he whispered, “According to the news from the Heavengod Alliance, and some other clues, the person who exterminated the Blacksoul Society was definitely Meng Hao.... This conclusion is also based on the report you provided about the Windswept Realm, Young Lord. In fact, the Heavengod Alliance has asked that you pay them a visit to confirm some information.”</p><br/><p>Han Qinglei sat there silently, eyes closed as he recalled everything that had occurred in the Windswept Realm. He thought back to his encounter with Meng Hao, how he had been killed, and then how Meng Hao had saved him during the final battle.</p><br/><p>Although not much time had passed since then, the more he thought about it, the more he realized that the Windswept Realm adventure had been one of extreme danger. Even an Echelon cultivator like himself was shocked by it.</p><br/><p>“So he actually came to the Eighth Mountain and Sea....” Han Qinglei smiled subconsciously. He actually felt no hatred toward Meng Hao, only a sense of competition.</p><br/><p>“And the cultivators of the Heavengod Alliance are trying to track him down and kill him.... Perhaps he can tolerate that, but as another Echelon cultivator, I can not!” His eyes flickered icily. People who were not in the Echelon couldn’t possibly imagine the level of pride that Echelon cultivators felt in their standing. As for Han Qinglei, he could accept Meng Hao being defeated or even perishing, but only at the hands of another Echelon cultivator.</p><br/><p>For non-Echelon cultivators to be hunting him down was something unacceptable.</p><br/><p>Snorting coldly, Han Qinglei smacked his hand down onto the throne of bones. Instantly, it began to rumble, transforming into a white beam of light that shot off into the distance.</p><br/><p>“Time to go to the Heavengod Alliance!” In response to his words, the other figures lurking in the starry sky began to power up and follow him. Soon the entire group was on their way to the Heavengod Alliance.</p><br/><p>Meanwhile, back in the Heavengod Alliance, because of the enormous scope of the search for Meng Hao, eventually, the Chosen of the various sects in the Heavengod Alliance all emerged and joined in.</p><br/><p>This included the Dao Child of the Heavengod Society. These Chosen were very much like the Chosen of the Ninth Mountain and Sea, people who their respective sects had spent incredible resources on to develop them into powerful experts. Any one of them possessed battle prowess that far exceeded the level of their cultivation bases.</p><br/><p>In order to ensure that they didn't somehow get killed while training, they still had Dao Protectors, even though they were already in the Ancient Realm. In fact, Dao Protectors would guard them all the way to the Dao Realm!</p><br/><p>In a short time, figurative storm winds arose in the Heavengod Alliance, like a huge vortex that sucked in cultivators from the far corners of the Realm.</p><br/><p>**</p><br/><p>Despite the momentous state of affairs in the world around him, Meng Hao was living in relative tranquility. It was a peace and quiet that he hadn’t experienced even in the Eastern Lands on Planet South Heaven. For now, he had seemingly truly forgotten about being a cultivator, and wasn’t thinking about how he was the subject of a huge manhunt. Instead, he was fully immersed in the life of a scholar.</p><br/><p>The town had an inn, where he sat beneath an oil lamp, reading. Occasionally, a smile would flicker across his face, and sometimes he would shake his head. He appeared to be completely immersed in the joy of reading.</p><br/><p>Every once in awhile he would rise to his feet, grab a writing brush, and write something down off to the side. He was completely and fully a scholar, just like he had been all those years ago on Mount Daqing.</p><br/><p>“There’s still half a month to go before the Imperial examinations....” Around midnight, he blew out the lamp and crawled into bed. From there, he could look out the window at the starry sky. Everything was quiet except for the faint sound of snoring that rose from various locations in the small town.</p><br/><p>“I never passed the exams back then, but now, I’m going to give it another shot.” As he reminisced about his past life, he sighed. Eventually, he pulled out an incense burner, which was covered with layers of magical seals.</p><br/><p>Chu Yuyan’s soul was in that incense burner, but it was not complete. More than half of it had dispersed, leaving behind nothing more than a discarnate soul....</p><br/><p>That discarnate soul was not enough to resurrect Chu Yuyan.... Furthermore, if it entered the cycle of reincarnation as a discarnate soul, then she would no longer be herself. Instead, she would merely be one aspect of whoever she eventually reincarnated into.</p><br/><p>Meng Hao could not accept something like that.</p><br/><p>“There’s always a way!” He closed his eyes, rotating his cultivation base to continue healing himself.</p><br/><p>At dawn, he packed his bags and led his donkey out of the inn’s stable. The innkeeper chatted with him the entire way, wishing him well as he mounted the donkey, opened up a bamboo scroll, and then headed in the direction of the capital city, which was about seven days away.</p><br/><p>Meng Hao wasn’t in a hurry. He rode his donkey along the public highway, resting at night, traveling when the sun rose. Days went by in which he enjoyed the scenery, passing by villages and farms. Although he hadn't planned this, his travels were like a cleansing that left him much more calm and tranquil.</p><br/><p>Beams of light occasionally shot through the sky overhead. Out in the starry sky, the cultivators searching for Meng Hao were getting more and more anxious. Despite having searched for Meng Hao for an extended period of time, they hadn’t been able to turn up a single trace.</p><br/><p>Their only recourse was to send more people out to search. Planet Luo River was scanned with divine sense occasionally, but the Heavengod Alliance was huge, and it wasn’t an easy thing to search for a single person.</p><br/><p>Gradually, the appointed time to unseal the teleportation portals approached. In fact, there was a bit of a backlash among certain factions in the Heavengod Alliance, who felt that locking down the entire Alliance to search for a single person wasn't very appropriate.</p><br/><p>Patriarch Blacksoul wasn't willing to give in though. Gritting his teeth, he personally went to the Heavengod Society. After he left, the old man who had issued the bounty on Meng Hao sat there cross-legged, personally sending his divine sense out to aid in the search.</p><br/><p>However, the Heavengod Alliance was an equally large place for him, and to search it required time and significant resources. Were it not for the hefty price paid by Patriarch Blacksoul, he would never have agreed to help.</p><br/><p>Time passed. As a cultivator, Meng Hao’s journey was tranquil and enjoyable. It would have been a different story if he were mortal, considering the various dangers to be faced. At one point he encountered some bandits.</p><br/><p>The bandits had just sacked a merchant caravan, and were in the midst of their burning, killing, raping, and plundering. As Meng Hao passed by, looked over at the bandits, and they in turn saw him. They immediately began to laugh heartily.</p><br/><p>One particularly burly man declared, “Look, a pretty little scholar! He’s mine!”</p><br/><p>Then, he strode forward toward Meng Hao, a vicious expression plastered on his face, his eyes gleaming with lascivious intent.</p><br/><p>Meng Hao frowned, wondering how the Eighth Mountain and Sea could have such debauched inhabitants. As the burly man neared, Meng Hao sighed, then looked up into the sky as if to check for witnesses before giving a cold harrumph.</p><br/><p>It was a noise that no one except for the bandits could hear. To them, it sounded like thunder; blood sprayed out of their mouths, and they instantly toppled over.</p><br/><p>They weren’t dead yet, just unconscious. Meng Hao didn't use any magical technique, just a snort, backed entirely by the power of his fleshly body. With that, he hopped off the donkey and picked up the nearest blade. Then he went from one unconscious bandit to another and dispatched them coolly and quickly.</p><br/><p>After that, he returned to the donkey, which had been waiting impatiently the whole time, and continued on his way. Several days later, a huge walled city appeared up ahead.</p><br/><p>This was the Imperial capital of this empire.</p><br/><p>The Imperial examinations that Meng Hao was so looking forward to would be held here in a few days.</p><br/><p>The days passed uneventfully, and soon it was time for the exams to begin. The entire capital city was bustling as students and scholars arrived from all over the empire to take the Imperial examinations.</p><br/><p>Meng Hao was one of them. He left his donkey at the inn, straightened his clothes, then cleared his throat as he joined all of the other scholars as they headed to the exam grounds. There, a court official closely examined everyone before they entered to make sure they hadn’t brought along anything to help them cheat. Eventually, Meng Hao was escorted to a small room, just big enough for him. A desk could be seen, upon which writing utensils were arranged neatly. Before opening the exam materials, Meng Hao washed his hands in a wooden basin off to the side, then took a deep breath. When the starting bell rang, he sat down in the chair and opened the exam scroll. As soon as he laid eyes on the contents, a smile broke out on his face.</p><br/>\n</div>"}