{"title": "Chapter 1231: Deadly Catastrophe!", "id": 1231, "volume": 13, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-1231-deadly-catastrophe", "volume_title": "Volume 13", "body": "<h1>Chapter 1231: Deadly Catastrophe!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 1231: Deadly Catastrophe!</strong></p><br/><p>Meng Hao frowned and looked over at the Meng Clan cultivators who were charging toward him. All of them were in the Immortal Realm, and there was one who had clearly just achieved Immortal Ascension, a stage 1 Immortal.</p><br/><p>They were trembling to a man, looking at Meng Hao in abject terror. In fact, once Meng Hao swept his gaze over them, none of them seemed willing to advance.</p><br/><p>“What are you doing?” hollered the young man, furious. “Get out there! Don’t let him get away!!” The old man standing off to the side saw Meng Hao looking his way. Trembling, he gritted his teeth and slapped his hand onto the back of the young man’s head.</p><br/><p>The young man instantly went limp and fainted. The old man quickly hurried forward, then clasped hands and bowed deeply to Meng Hao.</p><br/><p>“Senior, our clan’s Young Master doesn’t understand how the world works. This was clearly just a case of mistaken identity. Senior, please forgive us. Well, we’ll be on our way now...” Then he nervously called for all the clan members to return to the ship, after which it slowly began to back up.</p><br/><p>Meng Hao could see the beads of sweat on the old man’s face, and could tell how nervous he was. Clearly he now hated the young man even more than he had before.</p><br/><p>The young man had instantly identified Meng Hao, and so had his Dao Protector. However, as soon as the old man thought about how Meng Hao had exterminated the Heavengod Alliance’s Blacksoul Society, and then killed so many of his pursuers, even Dao Realm experts, his heart trembled. “Brainless moron. I really don't understand why the clan cares about him so much. I can’t believe he intentionally provoked that jinx!”</p><br/><p>There was someone else on the ship who was looking at Meng Hao, his face pale. He seemed to be hesitating, as if something had just occurred to him that he wished to speak out loud, but didn't qualify to do so.</p><br/><p>He was also a young man, wearing the clothes of a royal bodyguard. His face was crisscrossed with numerous scars that stretched down his neck and even further. Apparently, those scars ran across his entire body, and he looked to be in a weakened state.</p><br/><p>Meng Hao looked over at the cultivators of the Meng Clan. He would never have imagined that his initial encounter with them would have been like this. He glanced at the young unconscious youth and realized that he must be someone very special to the Meng Clan. Otherwise, he wouldn’t have the level of power he did.</p><br/><p>However, the fact that he was such an idiot caused Meng Hao to feel a bit disappointed in the Meng Clan. However, because it was his mother’s clan, and his grandfather's, he had special feelings for them. Therefore, he didn't allow what had happened to leave him with a very bad impression.</p><br/><p>He had planned all along to go visit the Meng Clan while he was in the Eighth Mountain, to see what it was like and also to make contact with the members of his grandfather’s bloodline.</p><br/><p>As he watched the ship moving off into the distance, he sighed, then looked away and made to leave. But then his eyes flickered as he looked off in a different direction.</p><br/><p>“Well since you’re here, why not show yourself?” he said calmly. As soon as the words left his mouth, the void off in the distance distorted, and three people emerged.</p><br/><p>The first was a ruddy-faced boy wearing a white robe. He held his hands clasped behind his back, and had a third eye on his forehead. His expression was icy, and the third eye blinked constantly, simultaneously radiating a mysterious light as he walked forward. Shocking ripples radiated out from him in all directions, causing the natural laws in the starry sky to be shoved away. Essence power built up, like a drawn arrow ready to be loosed.</p><br/><p>“Dao Lord....” Meng Hao thought, pupils constricting.</p><br/><p>The second person was an old woman, her face covered with bulging pustules. Every step she took caused her to tremble, as if she were so old she might die at any moment. However, she brimmed with vibrant life force that made her seem like an eternally inextinguishable flame.</p><br/><p>When the old woman saw Meng Hao, piercing, screeching laughter erupted from her mouth, as if she were looking at a dead man.</p><br/><p>The third person was none other than Patriarch Blacksoul. He looked different now; obviously he had possessed a new fleshly body. However, his soul aura, and his venomous hatred for Meng Hao, made him instantly identifiable.</p><br/><p>“Listen up, child,” the white-robed boy said. “I'm Xuan Daozi, from the One Profound Sect on Planet Profound Turtle!” The boy’s voice was not loud, and yet it seemed to rumble out in all directions like thunder. [1. Xuan Daozi’s name in Chinese shares the character “xuan\" with the name of the sect. It can be translated a lot of ways, including “profound, black, mysterious” and can be combined with another character to become “Xuanwu Turtle.” If you read Against the Gods, you’ve seen this character translated as “profound” on more than one occasion]</p><br/><p>As soon as Meng Hao heard him mention the One Profound Sect, his eyes widened. Of the four planets in the Eighth Mountain and Sea, Meng Hao had heard of Planet Luo River, as well as... Planet Profound Turtle! As for the One Profound Sect, they were the number one sect on Planet Profound Turtle. They occupied a very high position, and were ranked among the top five forces in the Heavengod Alliance!</p><br/><p>Next to speak was the old woman, whose voice was hoarse as she smiled and said, “And I'm Hong Chen, from the Church of the Dragon God on Planet Eight Designs.”</p><br/><p>Her expression was completely vicious, and when she smiled, one of the pustules on her face popped. No liquid emerged; instead, a milky-white centipede crawled out from the broken flesh, its legs writhing in a shocking fashion.</p><br/><p>When Meng Hao looked at this Hong Chen, his heart sank a bit. Planet Eight Designs was also one of the four great planets in the Eighth Mountain and Sea. As for the Church of the Dragon God, it was even more powerful than the One Profound Sect, and was one of the unflappable top three sects in the Heavengod Alliance!</p><br/><p>Clearly, these two sects had been recruited by Patriarch Blacksoul. If they succeeded in the venture, and thus obtained the services of Patriarch Blacksoul, then the sect’s power would increase by an entire level. The One Profound Sect would then be able to compete directly with the Church of the Dragon God, and as for the Church of the Dragon God, they would then be just as glorious as the second-ranking force in the Alliance, the Godchild Society.</p><br/><p>As soon as these three powerful experts appeared, the Meng Clan ship suddenly stopped moving. By this point their young leader had regained consciousness, and had ordered the ship to be stopped. Now, he was staring at Meng Hao with glittering eyes, and his Dao Protector was doing nothing to hold him back.</p><br/><p>People exist everywhere who hope to take advantage of a crisis for personal gain, and the Meng Clan was no exception.</p><br/><p>“I'm Meng Hao!” he said in introduction. Even if he had faced these three almighty Dao Lords of the senior generation back when he was uninjured, he still would have been killed. Therefore, there was no need to even mention what a fight now would be like, considering that he was seriously injured. In fact, even facing one of them would be quite difficult for him.</p><br/><p>However, he still wasn’t willing to lose his pride, and therefore, when Hong Chen and Xuan Daozi formally introduced themselves, naturally, he did the same. As for where he came from, it was sufficient that they were aware of the facts; there was no need for him to state it himself.</p><br/><p>Patriarch Blacksoul glared at Meng Hao, eyes brimming with intense hatred. Meng Hao had destroyed his entire existence, and now he wished to do the same to Meng Hao.</p><br/><p>“Meng Hao,” Patriarch Blacksoul said, his voice booming like thunder. “Echelon cultivator from the Ninth Mountain and Sea. What a high status.... But not here! Here, you’re nothing!”</p><br/><p>Something else happened that nobody noticed, not even Patriarch Blacksoul, or perhaps he didn't deign to care.... On the Meng Clan’s ship, the scar-faced young bodyguard trembled in response to the words. Then his eyes began to shine with a bright light as he looked out at Meng Hao.</p><br/><p>However, the light in his eyes quickly faded, as if whatever matter had occurred to him moments before was really an impossibility. Nobody noticed this happen; all of the cultivators on the Meng Clan ship were paying close attention to what was likely about to develop into a deadly Dao Realm battle!</p><br/><p>Rumbling filled the air as Patriarch Blacksoul began to stride forward. He waved his right hand, causing countless souls to silently materialize. Essence power also rocked out, causing the starry sky to tremble as it all bore down on Meng Hao.</p><br/><p>Anyone under the Dao Realm who faced a deadly attack like this would be destroyed in a single attack, regardless of the level of their cultivation base. But Meng Hao was an Allheaven Dao Immortal, and his fleshly body was in the great circle of the Ancient Realm. Because of that, despite not being in the Dao Realm, he could definitely match up with Dao Realm cultivators!</p><br/><p>Meng Hao’s face was calm, although he really had no other choice but to remain calm. Any sort of emotion was useless at this point. This fight was going to happen, therefore... how to fight, how to defend, how to counterattack, and all other aspects of the battle were decided by Meng Hao in an instant!</p><br/><p>He suddenly flickered into motion, raising his right hand to summon numerous Immortal mountains, and even the Paragon Bridge, which descended toward Patriarch Blacksoul to block his path.</p><br/><p>When their divine abilities met, a tremor ran through Meng Hao, and he coughed up a mouthful of blood. However, his eyes flickered as he suddenly borrowed to force of the blow to shoot backward, toward... the 33 glowing rifts that he had seen earlier.</p><br/><p>After observing the area earlier, he knew that it contained vast dangers, and that they were places where there was virtually nothing but death. But he was in a similarly deadly situation right now. Furthermore, when two deadly situations like this slammed into each other, it was possible that... the explosive result would not necessarily be death... but an elusive... chance to live!!</p><br/><p>The people in the Meng Clan could take advantage of a crisis for personal gain, so naturally... Meng Hao could too!</p><br/><p>In the moment that Meng Hao fell back, Patriarch Blacksoul was rocked by the Paragon Bridge. However, even as the blood oozed out of his mouth, the white-robed Xuan Daozi suddenly laughed, blurring away and then rematerializing right next to Meng Hao.</p><br/><p>“Get back here, child!” he said coolly, reaching out with his right hand to grab Meng Hao. Next, it was as if his hand transformed into a black hole, causing the starry sky to reverse its movement, and time to run backward.</p><br/><p>Even the Meng Clan’s ship was affected, and began to emit creaking sounds as it began to tilt over on its side as it was sucked towards him.</p><br/><p>Seeing that he was about to be grabbed, Meng Hao suddenly laughed coldly and began to walk. He was using... the time-walking technique taught to him by... the black-robed figure named Slaughter!</p><br/><p>One step, two step, three steps. Meng Hao stepped through time, seemingly moving slowly, and yet, despite the fact that Xuan Daozi’s palm was causing time to flow in reverse, Meng Hao was still able to walk forward!</p><br/><p>This was using Time to fight Time!</p><br/><p>A brief moment later, and Meng Hao was already off in the distance, leaving Xuan Daozi standing there gaping. In all his years of cultivation, this was the first time anyone had defeated his Essence magic in such a fashion. His eyes began to shine brightly with disbelief as he watched Meng Hao, and especially the way he was walking.</p><br/><p>“What walking technique is that? It contains a Dao of Time that’s even more profound... than my own!”</p><br/>\n</div>"}