{"title": "Chapter 1242: Blue Sun!", "id": 1242, "volume": 13, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-1242-blue-sun", "volume_title": "Volume 13", "body": "<h1>Chapter 1242: Blue Sun!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 1242: Blue Sun!</strong></p><br/><p>Thanks to the life force of the Dao Realm cultivator, Greed-possessed Meng Hao trembled. Suddenly, brilliant light began to shine out from his forehead. Although the fourth Nirvana Fruit was not completely absorbed, it had apparently reached a milestone in the process!</p><br/><p>Rumbling could be heard as the fourth Nirvana Fruit slowly began to rotate in place in addition to its absorption of life force. Next, the third Nirvana Fruit, as well as the second, and finally the first, all spun in unison, causing an ancient aura to erupt out of Meng Hao. That terrifying aura spread out, causing the entire necropolis to shake.</p><br/><p>That aura did not belong to Greed, but rather, the fourth Nirvana Fruit!</p><br/><p>As the fruits rotated, and the aura spread out, the power of an Allheaven Dao Immortal also rotated at its peak. Gradually, the ripples of the Ancient Realm began to radiate out from Meng Hao.</p><br/><p>Countless symbols appeared all over his skin, symbols that had apparently been hidden in his bloodline. Now they appeared all over him, causing an ancient, awe-inspiring aura to emanate out.</p><br/><p>Greed was trembling in excitement.</p><br/><p>“I bet, and it paid off big. This body is a huge treasure! With a body like this, I'm fully confident that I can eventually reach Heaven Trampling!!”</p><br/><p>“I might not have fully absorbed this Dao Fruit thing yet, but it won’t be long before I will!</p><br/><p>“A fleshly body comparable to the Dao Realm, and a cultivation base even more powerful than before! It won't be long before this body erupts with... completely extraordinary power!” Greed took a deep breath. Currently, he only had about thirty percent of his life force Essence left. However, to him, it was all worth it!</p><br/><p>“That bridge, this exceptional bloodline, a powerful fleshly body, and a cultivation base with unlimited potential. This body is definitely worth it!” Greed licked his lips, then threw his head back and laughed.</p><br/><p>“Once I get out of here, I’ll find some God blood to get even more powerful, and then, everyone who humiliated me in the past will find out that... Greed is back!” Greed laughed, and as he did, a white-robed figure suddenly appeared in his mind, a figure which always filled him with resentment when he thought of him.</p><br/><p>“Just wait until I reach Heaven Trampling!” Enlivened, Greed shot through the necropolis at top speed, sending his divine sense out to lock onto... Xuan Daozi!</p><br/><p>In another corridor in another part of the necropolis, Xuan Daozi’s eyes were wide, and his heart was uneasy. He could sense fluctuations off in the distance that left him completely unsettled. Muttering to himself, he increased his speed as he sent his divine sense out to scan a shrine hall in the center of the necropolis up ahead.</p><br/><p>By now, nearly ninety percent of the cultivators who had entered the necropolis were dead, most of them at the hands of Greed. Some had already been wounded before entering; after being infected by the aura of death in the place, they were now at death’s door.</p><br/><p>Meng Chen was one of those people. He currently lay in the dirt, his vision fading to black, his expression blank. His aura was growing weak, and his complexion was ashen as the aura of death caused his internal organs to slowly decay. Occasionally, black blood would ooze out of his mouth.</p><br/><p>Even his flesh was beginning to decay. By now, not even a Dao Realm cultivator would be able to save him, the reason being that his soul was already dispersing. The aura of death slowly corroded his soul, and as it faded away, he slipped into death.</p><br/><p>He was dying, but that was not his wish. There were still many things he wanted to accomplish. He was the only member of his bloodline to have ever gone out into the world in recent years, and he had grand aspirations. He wanted to lead the members of his bloodline back to prominence, to restore his bloodline to its former glory.</p><br/><p>But now, all he had were regrets.</p><br/><p>Suddenly, his lips quivered as he said, “Dad.... Mom.... I've been an unfilial son....”</p><br/><p>His thoughts were somewhat muddled, and at the moment, he thought he could see the members of his bloodline, and the hard lives they lived.</p><br/><p>He thought about many things. He thought about how excited everyone had been when they found out that he had shown the ability to cultivate. He thought about the oaths that he had sworn from the time he was young, and the first time he had left the ancestral lands. When he had set foot onto that merchant ship and received his orders from Young Lord De, he had gritted his teeth and complied, willing to pay any price for his bloodline and for his ambitions.</p><br/><p>But now, all his humiliations, and all his grand aspirations, were nothing but memories....</p><br/><p>“If I die,” Meng Chen murmured, “what will become of my little brothers and sisters...? What will all my other relatives do...?” Meng Chen's vision was growing blurry; too much of his flesh was rotting away, and much of him was already being absorbed into the soil itself.</p><br/><p>His current location wasn’t very far away from where Greed-possessed Meng Hao was speeding along toward Xuan Daozi’s position.</p><br/><p>About ten breaths of time passed, during which time Greed got closer and closer to Xuan Daozi. At one point, when Greed passed by one particular side chamber, he suddenly stopped and looked inside. Approaching in his direction was Han Qinglei, who suddenly looked at him with an expression of delight.</p><br/><p>“Meng Hao!” Han Qinglei’s anxiety suddenly lessened now that he had seen Meng Hao. He began to hurry over, but had only taken three or four steps when he suddenly stopped in place, his pupils constricting.</p><br/><p>“Meng Hao, what's wrong?” Han Qinglei could sense that something was off. There was a cold mercilessness within Meng Hao’s eyes, as well as an avarice that he could tell was completely different from the Meng Hao he remembered.</p><br/><p>Although this Meng Hao and the other Meng Hao looked alike and their auras were the same, the different look in this one’s eyes made Han Qinglei immediately begin to back up.</p><br/><p>Greed-possessed Meng Hao looked Han Qinglei up and down, then smiled viciously. “I can’t believe there’s another excellent fleshly body here....</p><br/><p>“Except it’s not quite as good as the one I already have. However, it's not good to waste. There’s plenty of excellent life force to be sucked away.” Grinning, Greed shot toward Han Qinglei.</p><br/><p>Han Qinglei’s face fell. He was an intelligent person, and was able to detect enough clues to be suspicious. Then he heard Greed’s words, and he understood everything.</p><br/><p>“Possession!” he said, sucking in a breath. He immediately fled backward at top speed, performing a double-handed incantation gesture that caused a green cauldron to materialize. Rumbling could be heard as he continued to retreat back at top speed. Greed grinned viciously, and his right hand shot forward in a gray blur as he made to grab Han Qinglei.</p><br/><p>Han Qinglei’s expression was one of hopelessness; based on the level of his cultivation base, he was fundamentally no match at all for Greed.</p><br/><p>However, even in the moment that Greed’s hand turned into a gray blur and was about to latch onto Han Qinglei, all of a sudden, it stopped moving, as if it were fighting back against Greed’s consciousness.</p><br/><p>Greed’s face fell, and he shot backward, grabbing his right hand hard with his left, a surprised and suspicious look in his eyes. Next, his eyes flickered as he examined his body. However, he could find no trace of a discarnate soul, which led him to only one conclusion.</p><br/><p>“Dammit, there must still be tiny fragments of his soul left!!</p><br/><p>“However, the resistance was weak, and the soul fragments are acting on instinct alone. It seems Meng Hao and this person had some sort of friendship....”</p><br/><p>With a cold harrumph, he caused the qi and blood in his body to begin to burn, and even sent some of the lightning flame from the Lightning Cauldron to surround him, burning him from the outside in, and then vice versa.</p><br/><p>After about ten breaths of time passed, the flames dissipated, and Greed stopped burning his qi and blood. Feeling much better, he looked up in the direction of the fleeing Han Qinglei. He was about to give chase, when suddenly the force exerted by the fourth Nirvana Fruit grew stronger, as if it were intent on completing its fusion.</p><br/><p>Greed hesitated for a moment, then gave up on the idea of pursuing Han Qinglei. Instead, he flew in the direction of Xuan Daozi.</p><br/><p>Currently, the most important thing was to complete the fusion with the Dao Fruit in his forehead, and he was confident that after consuming Xuan Daozi, he would be very close to just such a conclusion.</p><br/><p>As Xuan Daozi and Greed both sped along, they gradually neared the exact same area!</p><br/><p>That area was none other than the huge temple in the middle of the necropolis!</p><br/><p>The necropolis was a vast construction, all of which was built around the temple in the middle. There were dozens of side chambers, all of which were connected by tunnels. The entire structure was arranged almost like a spell formation.</p><br/><p>Currently, Xuan Daozi had just sped through one of the more than ten entrances to the central temple, piercing through the air like lightning.</p><br/><p>As soon as he entered, he could sense a terrifying pressure that caused him to tremble. He took a deep breath and looked around, and as soon as he saw where he was, his pupils constricted.</p><br/><p>The central temple had nine enormous stone columns that almost looked like spikes driven into the ground. In the very middle of those nine stone columns was a raised platform, upon which could be seen... a blue-robed figure sitting there cross-legged!</p><br/><p>It was a withered corpse that emanated a boundlessly ancient air, as if it had existed for countless years. There was absolutely no life force to be sensed on this corpse; it had been dead a long time.</p><br/><p>However... visible on its forehead was an astonishing flame, blue in color. From a distance, it almost looked like a sun, floating within which was a face. That face had its eyes closed, and shockingly... looked very similar to the corpse's face.</p><br/><p>Connecting the corpse to the platform were numerous iron chains. Furthermore, the giant pillars pulsed with fire that almost seemed to be refining the corpse!</p><br/><p>On the wall behind the corpse was a fresco. Astonishingly, it depicted... a blue sun!</p><br/><p>That blue sun was incredibly realistic, and if you looked at it long enough, it would make you feel as if you were being roasted alive.</p><br/><p>Also within the area of the nine pillars, on the left side of the corpse, a small shield could be seen lying on the ground. It was also blue, and emanated a faint, flickering light.</p><br/><p>On the right side of the corpse was a bell; small and a dark-colored, it didn't look very impressive. Scattered around were piles of other magical items; however, due to the passage of time, they were in various states of decomposition. Some were apparently still usable, but none of them attracted the attention of Dao Lord Xuan Daozi.</p><br/><p>What caught his eye... was the blue sun on the corpse’s forehead, as well as the shield and bell.</p><br/><p>It was at this moment that, all of a sudden, Meng Hao came flying into the same area.</p><br/>\n</div>"}