{"title": "Chapter 1247: Meng Chen Again", "id": 1247, "volume": 13, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-1247-meng-chen-again", "volume_title": "Volume 13", "body": "<h1>Chapter 1247: Meng Chen Again</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 1247: Meng Chen Again</strong></p><br/><p>Meng Hao left, savoring sweet the flavor of his profits from the central temple. Eyes gleaming, he next focused on the surrounding side chambers. Of course, the meat jelly and parrot hadn’t originally cared much about wealth. The parrot liked fur and feathers, whereas the meat jelly was inclined toward bullies.</p><br/><p>However, after being around Meng Hao for so long, he had started to rub off on them. Now, they were far more interested in money, which was quite a pleasing development as far as Meng Hao was concerned; having assistants made the plundering process much smoother.</p><br/><p>The three of them were like locusts as they descended upon the next side chamber. Because they didn't have to worry about the magical seals like they did in the main hall, things were much easier, and they went right to work.</p><br/><p>The parrot flew up toward the ceiling, the meat jelly handled miscellaneous objects, and as for Meng Hao, he felt that prying up the floor tiles and dismantling the wall decorations was right up his alley....</p><br/><p>In the end it took barely a dozen breaths of time before the three of them left. The side chamber... was completely empty, even emptier than the main hall.</p><br/><p>If Greed were here to see what was happening, his fear of Meng Hao would surely increase.</p><br/><p>“Rich! I'm really rich!” Meng Hao thought, his eyes shining as he madly cleared out another side chamber. It didn’t take long before the group of three had swept through all of the side chambers. The parrot and meat jelly were starting to feel tired, so Meng Hao put them back in his bulging bag of holding, which he then patted as he laughed heartily.</p><br/><p>Then he prepared to fly off and look for the exit. Meanwhile, Han Qinglei was just down the corridor, having just cautiously entered one of the side chambers. At first, he assumed that he had taken a wrong turn and come to a different place than he expected, but just as he was turning to leave he suddenly gaped in shock at the emptiness around him and examined the area more closely.</p><br/><p>He looked down at the ground and saw no floor tiles, nor were there any frescoes on the wall. Every single object imaginable had been cleared out. Even the glowing pearl lights up above had been taken away. Han Qinglei gasped in astonishment.</p><br/><p>“Wh-what... what happened?!?! Who did this?” Han Qinglei wasn't actually very familiar with Meng Hao. He only knew about how Meng Hao had acted in the Windswept Realm, so when he saw the shocking scene around him, he didn’t think to connect it to Meng Hao.</p><br/><p>Taking a deep breath, he hurried on to the next side chamber, whereupon his face began to flicker with fear. After visiting several more side chambers, he realized that they had all been emptied out, and were in complete disarray.</p><br/><p>Not too far off, on another side, Meng Hao suppressed his excitement at everything that had just happened, and was preparing to start searching for the exit. At the same time, he was considering how to escape from the Heavengod Alliance.</p><br/><p>“At the most, it will take me a few months before I can break through to the Ancient Realm. For me, the Ancient Realm will be a mere stepping stone, and it should be just a quick succession of breakthroughs on my way to the Dao Realm!” Meng Hao’s eyes shone with anticipation. He had already spent far too much time in the Immortal Realm, and had progressed farther than virtually anyone else ever had.</p><br/><p>He had made thorough preparations, and was confident that he would be able to extinguish however many Soul Lamps he needed to. The only thing he wasn’t sure about was how many Soul Lamps that would entail.</p><br/><p>“The Dao Realm is the key to everything!” Meng Hao took a deep breath and buried his anticipation deep in his heart.</p><br/><p>“If I remember correctly, Han Qinglei is in this necropolis too.” Meng Hao sent his divine sense out and quickly found Han Qinglei. Just when he was about to head in his direction, Meng Hao stopped in place. He had just noticed that in a corridor not too far off, a person was just about to become a corpse.</p><br/><p>It was none other than Meng Chen!</p><br/><p>“Someone from the Meng Clan....” Meng Hao scanned his face, and despite the thick aura of death which twisted it in a grotesque way, he could tell that it was the same young man he had noticed on the Meng Clan’s ship.</p><br/><p>Meng Hao remembered that when Patriarch Blacksoul had pointed out that he came from the Ninth Mountain and Sea, it made him think about the Meng Clan, and then look over at the expressions on the faces of the people on the ship.</p><br/><p>Few of them had any reaction when the Ninth Mountain and Sea was mentioned, but this young man, Meng Chen, had looked shocked. His expression had been one of mixed emotions, including anticipation and even nervousness. Meng Hao had noticed that, but at the moment he had been in a very deadly chase, with no time to consider the matter. However, in hindsight he was now convinced that this young man knew about the connection between the Meng Clan and the Ninth Mountain and Sea’s Fang Clan. [1. The part about Patriarch Blacksoul calling out Meng Hao as coming from the Ninth Mountain and Sea, and Meng Chen’s reaction, happened in chapter 1231]</p><br/><p>Meng Hao ignored Han Qinglei for the moment, and instead sped over to Meng Chen. He even used the Lightning Cauldron to bypass some walls, and appeared next to Meng Chen a moment later.</p><br/><p>Almost immediately, he was struck by the powerful aura of death emanating off of Meng Chen. The ground in the area had already absorbed his limbs, and was slowly assimilating the rest of him, to the point where only his head was still visible above the surface. His skin was bloated and black, covered with blue veins.</p><br/><p>However, he wasn't dead! He still had one breath of life left!</p><br/><p>Meng Hao knelt down next to him and placed his hand on Meng Chen’s forehead. After a moment, a look of sadness passed over his face. Meng Chen’s cultivation base was only in the Immortal Realm. The necropolis they were in was filled with an aura of death that even Dao Realm experts would be leery of. However, Meng Chen was already completely infected, and should actually have died much sooner.</p><br/><p>However, a bit of his own aura remained, a bit that was fueled by his unyielding drive and will. The power of that desire transformed into something like a wisp of smoke from a lit incense stick, which kept Meng Chen afloat for just a bit longer.</p><br/><p>However, despite the fact that he hovered there between life and death, his soul was still dispersing, and his body was melting away. He would not be able to enter the cycle of reincarnation, and if Meng Hao hadn’t come when he had, then it would only have been a few more hours before that final bit of his own aura was completely gone.</p><br/><p>“Just what kind of obsession can drive a person to refuse to give in like this...?” Meng Hao murmured. He sighed, wishing that he could do something to save him, but knowing that it was impossible.</p><br/><p>Frowning sadly, he reached out and tapped Meng Chen’s forehead, sending in a bit of life force. It wouldn’t save him, but would give him a bit of lucidity and help him to express his dying wishes.</p><br/><p>Meng Chen shivered, and his bulging eyes opened; he didn’t look at all handsome like he used to. However, Meng Hao’s life force contained Essence power, which caused Meng Chen’s dispersing soul to temporarily solidify, and his previously fading eyes to grow clear.</p><br/><p>Unfortunately, Meng Hao knew that the brightness in his eyes… was the flicker of lucidity that came moments before death.</p><br/><p>“If there’s anything you’d like to say, you can tell me,” Meng Hao said softly.</p><br/><p>Meng Chen looked at Meng Hao blankly for a moment, then realized who he was. Eyes filling with anticipation, he said, “Meng... Hao....” It was difficult for him to speak, and when he did, it was in fits and gasps. “I... have an... aunt named... Meng Li, in the Ninth Mountain and Sea....”</p><br/><p>His words hit Meng Hao like lightning, and he began to tremble.</p><br/><p>He looked at Meng Chen with wide eyes; although he had guessed that this might be the reality of the situation, to hear Meng Chen say the words out loud caused waves of shock to beat at Meng Hao's mind.</p><br/><p>Instead of saying that Meng Hao had deep feelings for the Meng Clan itself, it would be more accurate to say... that he felt deep regard for his grandfather’s bloodline. In the final analysis, the reason he wanted to go to the Meng Clan in the first place was because of that bloodline!</p><br/><p>His true relatives were the members of that bloodline, not the Meng Clan in general!</p><br/><p>Meng Hao began to pant from the realization that this Meng Clan cultivator was actually one of his direct relatives. He once again tapped Meng Chen’s forehead, giving him some more Essence power. This time, knowing that Meng Chen was not just an ordinary member of the Meng Clan, he gave as much power as was possible.</p><br/><p>It still wasn’t enough to save him, but it was enough to cause his eyes to shine.</p><br/><p>“You... know... my aunt...?” Meng Chen asked, looking at Meng Hao with intense anticipation.</p><br/><p>“She's my mother,” Meng Hao replied softly. “My name is Meng Hao, but at the same time, Fang-Meng Hao.”</p><br/><p>When Meng Chen heard that, he shivered, and a look of excitement appeared on his face. He knew that his aunt had gone to the Ninth Mountain and Sea to get married, and that her husband was surnamed Fang....</p><br/><p>“So it's really... you....” Meng Chen still hadn't released his last breath of life. However, his eyes were growing dim, and the aura of death was overtaking him. Even with Meng Hao supporting him, any moment could be his last.</p><br/><p>“Help the Meng Clan… and help our bloodline... rise to prominence!</p><br/><p>“I'm... Meng Chen, and I’m... the only Immortal Realm cultivator in our bloodline... help us... rise... to prominence!” Meng Chen shivered, using all of the energy he had left to say the words ‘rise to prominence.’ After he did, black blood oozed out of the corners of his mouth, and his eyes darkened. However, he still wasn’t dead yet; he was holding on tenaciously, looking at Meng Hao, waiting for him to respond.</p><br/><p>Meng Hao’s mind was trembling as he looked at Meng Chen, his own relative. After a moment, his eyes filled with determination, and he nodded.</p><br/><p>When Meng Chen saw that, and the determination written on Meng Hao’s face, he smiled. The smile lasted only a moment, but based on the look in his eyes, Meng Hao could sense Meng Chen’s unswerving obsession. The look faded away, and then his gaze stiffened. His eyes stopped moving; the flame of his life force had burned out.</p><br/><p>His body was now completely enveloped by an aura of death.</p><br/><p>Meng Chen was dead.</p><br/><p>Off to the side lay his bag of holding, the only thing that remained of him.</p><br/><p>Meng Hao was silent for a while, then he sighed. He was aware that his grandfather’s bloodline was in decline, and that one of the main reasons was himself. It was the same with the Fang Clan. If his two grandfathers hadn’t gone missing while trying to save him, then his grandfather’s bloodline definitely wouldn’t be in such a poor situation.</p><br/><p>“The only Immortal Realm cultivator in the bloodline…?” Meng Hao murmured, slowly standing up. He stamped his foot, dispersing the aura of death, and sending the soil scattering about to reveal Meng Chen’s corpse, which he carefully picked up.</p><br/><p>“Alright, time to take you home,” he said quietly. Carefully placing Meng Chen into his bag of holding, he turned and began to slowly walk away. As he did, his appearance changed... into that of Meng Chen!</p><br/><p>“I’ll take your place to fulfill your obsession,” he said slowly. “I will lead the bloodline... into prominence in the Meng Clan!”</p><br/>\n</div>"}