{"title": "Chapter 1246: Cleanly and Thoroughly!", "id": 1246, "volume": 13, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-1246-cleanly-and-thoroughly", "volume_title": "Volume 13", "body": "<h1>Chapter 1246: Cleanly and Thoroughly!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 1246: Cleanly and Thoroughly!</strong></p><br/><p>Greed wanted to weep, but had no tears to shed. He felt embarrassed, even humiliated.... And yet that humiliation soon turned to indignation as he saw Meng Hao’s delighted gaze shift from the Lightning Cauldron to... the shield and the little bell.</p><br/><p>“Those are mine!!” Greed roared, his eyes wide. However, the sound of his voice couldn't leave that blue sun. Even if he roared louder, the only thing anyone might be able to see was the blue glow of the sun intensifying a bit.</p><br/><p>Meng Hao stared fixedly at the little shield, then took a deep breath. For some reason, he had the feeling that he... could control it.</p><br/><p>Heart thumping, he sent out some divine will, and the shield twitched. A moment later, it appeared directly in front of him, radiating a scintillating light. Meng Hao gazed at the shield, contemplating how easy it had been to control it, almost as if it were connected to him. It made him realize that the result of consuming Greed’s life force Essence wasn’t simply a matter of completing his fourth Nirvana Fruit.</p><br/><p>He could sense that his control over the shield didn't come from himself, but rather... the fourth Nirvana Fruit.</p><br/><p>It was similar to how... he didn’t directly control the Paragon's blood inside of him, the third Nirvana Fruit did.</p><br/><p>However, the specifics weren't really important. Meng Hao’s eyes gleamed as he next looked toward the bell. It flickered, then floated over to rest in Meng Hao’s hand, emanating a feeling of extreme ancientness.</p><br/><p>“Not only did you help me refine my body, you increased my cultivation base, fused my Nirvana Fruit, re-forged my magical items, and even... gave me some of your own treasures.” Meng Hao sighed and looked over at the blue sun on the corpse’s forehead, and Greed’s face, which was currently screaming silently at him.</p><br/><p>Meng Hao cleared his throat and then clasped hands and bowed deeply.</p><br/><p>“Many thanks, Senior,” he said. Then he put the shield and the bell away.</p><br/><p>Greed glared at him, and truly wished to weep.</p><br/><p>After putting the items away, Meng Hao looked back up and saw Greed staring at him with madness and killing intent. All of a sudden, memories floated up in his mind that he had just acquired.</p><br/><p>“When he was suppressed, he split his soul into two parts, huh...?</p><br/><p>“The 33 Hells are actually thirty-three medicinal pills left behind by Paragon Nine Seals.... Hmm, medicinal pills concocted by a powerful Dao Realm expert could rightly be called Dao pills.</p><br/><p>“If that’s the case, then did I actually just consume half of a Dao pill?” Meng Hao murmured, looking at Greed, and his eyes shone brightly. He licked his lips. He had no way of knowing, but when Greed saw the look on his face, he suddenly shivered.</p><br/><p>After standing there thinking for another moment, Meng Hao organized his thoughts. In addition to Greed’s memories, he also had Xuan Daozi’s memories in his head too. From those memories, he was able to see Xuan Daozi’s final moments before his death.</p><br/><p>Although he and Xuan Daozi had been trying to kill each other, when Meng Hao saw how he had died, he couldn’t help but sigh emotionally.</p><br/><p>“In the Immortal World, cultivators with less than three Essences are ordinary Dao Realm cultivators. Three Essences earns you the right to be called Dao Lord, which is essentially the peak of the early Dao Realm. After that are the Dao Sovereigns, who have up to six Essences. They are essentially the mid Dao Realm.</p><br/><p>\"After that is the late Dao Realm, which is... the Paragon stage. 7-Essences Paragons, 8-Essences Paragons, and 9-Essences Paragons!</p><br/><p>“It seems that the Paragon stage is equivalent to Paramita’s Exalted Celestial, which is likewise equivalent to Paramita’s Dao Divinity....</p><br/><p>“Furthermore, beyond Paragons, there is another legendary Realm, the Daosource!!” Meng Hao’s eyes shone brightly as he realized why Xuan Daozi had been so focused on killing him.</p><br/><p>“Essence stirs only for the Daosource.... The Daosource Realm is similar to Heaven Trampling, which is likewise similar to the Boundless Dao?” Meng Hao was unfamiliar with these two terms. After searching through some of Greed’s memories, he understood. Exalted Celestials and Dao Divinities were cultivation base terms used by the two powers that had been involved in the war with the Immortal World.</p><br/><p>“Daosource. Daosource.... According to the information in Greed’s memories, back in the day, Paragon Nine Seals had a Daosource fleshly body, but his cultivation base was only half a step into the Daosource Realm. So, he never counted as a true Daosource cultivator.</p><br/><p>“In that case... exactly how powerful is the Daosource Realm? If a Daosource Realm cultivator appeared in the Mountain and Sea Realm, would it be enough to resolve the war between the three powers?!</p><br/><p>“Furthermore... might it be possible... that there is an even more powerful Realm beyond the Daosource?” Meng Hao was nearly overwhelmed by the mass of new information.</p><br/><p>After a long moment, he shook his head and cleared his thoughts. After looking over at the blue sun on the corpse’s forehead again, his eyes glittered. Muttering to himself, he took another long moment to still his beating heart.</p><br/><p>“My cultivation base isn’t high enough to undo that seal and consume the rest of the Dao pill.... Since that was the purpose of the creation of the 33 Hells, then there’s no need to get anxious about receiving all the benefits.</p><br/><p>“Once I get into the Dao Realm, I’ll come back and get all the Dao pills in one fell swoop!” Meng Hao stepped back, then waved his right sleeve, collecting all the other magical items which had been laying around in the area for countless years. After looking around one more time to make sure he hadn’t missed anything, he turned and prepared to leave.</p><br/><p>Within the blue sun, Greed stared at Meng Hao, swearing that if he had a chance, he would definitely consume Meng Hao.</p><br/><p>However, just as Meng Hao was about to leave, he stopped in place, then smacked himself hard in the forehead. Greed gaped in shock, wondering whether or not Meng Hao was going crazy.</p><br/><p>Meng Hao appeared to be furious as he once again smacked himself.</p><br/><p>“Ah, Meng Hao you fool, I know you're rich now, but you can never forget that money comes by saving up a bit at a time. Every time you don’t earn some money, you’re losing money. Plus, once you get it, you can’t spend it frivolously!</p><br/><p>“You got some amazing good fortune this time around, and earned quite a bit, but that doesn't mean you can be extravagant all of a sudden!” Taking a deep breath, he reminded himself of the lessons he had been taught, then squatted down and tapped some of the floor tiles in the temple. Finally, he let out a long sigh.</p><br/><p>“I really was being negligent. These floor tiles might not be made from Immortal jade, but they contain a Dao will within them that makes them the perfect ingredient for forging magical items. Even one of them would fetch an incredible price on the outside.” Eyes gleaming, he smacked his bag of holding to produce a sword, which he edged into the corner of one of the tiles. A moment later, the sword snapped in half.</p><br/><p>“Wow, they’re pretty tough!” Licking his lips, Meng Hao produced the long dragon spear, stabbed it into the ground, and began to pry upward. Meanwhile, Greed looked on, astonished.</p><br/><p>A boom rang out as the floor tile flew up into the air. Meng Hao grabbed it and looked it over, whereupon a radiant smile appeared on his face. Eyes shining, he slapped his bag of holding, causing the parrot and meat jelly to fly out.</p><br/><p>“No jabbering,” he said. “Let’s clean this place out. Just don’t touch those nine pillars.” With that, he went to work prying up the next tile.</p><br/><p>The parrot and meat jelly had just been about to launch into a debate, but were cut off by Meng Hao. They looked around, and suddenly their eyes began to shine brightly, and they immediately began to help Meng Hao pry up the floor tiles.</p><br/><p>One piece. Two pieces. Three pieces.... Ten pieces. Thirty pieces. One hundred pieces. Meng Hao was going mad, buzzing around like a tornado as he used the dragon spear to pry up one floor tile after another.</p><br/><p>Greed watched what was happening, eyes wide with shock and disbelief. Meng Hao was using the very spear that he had paid such a heavy price to unseal, to run around like mad and pry up floor tiles. Greed suddenly shivered.</p><br/><p>By now, he realized that Meng Hao was definitely not to be trifled with.</p><br/><p>Absolutely, positively not to be trifled with. In fact, he was even more terrifying than the jinx that had sealed Greed here to begin with.</p><br/><p>“That jinx was a killer, but this Meng Hao is more than that. He’ll take everything down to the bones!!”</p><br/><p>Before Greed could even finish sighing, Meng Hao suddenly looked up at the walls, and his eyes shone. Hurrying over, he began to dismantle the frescoes piece by piece.</p><br/><p>Greed’s eyelids twitched as he watched Meng Hao, and his heart was pounding. He had long since taken his own name to be an expression of his personality, but now he realized that compared to Meng Hao, he himself... was an upstanding individual.</p><br/><p>It was at this point that Meng Hao’s eyes flashed like lightning as he started looking around again, and his gaze met Greed's. Greed once again looked away, fearful that Meng Hao in his madness would go after him again.</p><br/><p>“Crazy. Crazy!” Greed murmured, gaping in shock. “This guy is absolutely crazy!” The parrot and meat jelly were also collecting all of the items in the hall, with the exception of the nine pillars.</p><br/><p>Greed stared around at the chaos; the once magnificent temple hall now looked as if it had been chewed up by a ravenous dog. It was completely bare, with only a few places left intact. Greed was shaking at how terrifying Meng Hao was.</p><br/><p>“I really did underestimate him. He doesn’t just give up with the bones, he even scrapes up the dirt beneath the bones. He takes everything....</p><br/><p>“This is the type of guy you can’t trifle with, never ever, ever! Now that I think about it, HE should be named Greed!” Greed took in a deep breath as Meng Hao once again seemed to be on the verge of leaving. However, it was at this point that Meng Hao turned and suddenly looked at him.</p><br/><p>Greed shivered in shock as Meng Hao once again slapped his forehead.</p><br/><p>“How could I have forgotten that....” Meng Hao said, sounding very angry at how dull he had become. He suddenly hurried over to where Greed was located, and a carved stone screen had been erected, which depicted a sun. Meng Hao efficiently dismantled the screen and put it into his bag of holding.</p><br/><p>As he looked around the huge temple hall one more time, he tilted his head up and noticed the roof tiles, which he quickly helped himself to. Finally, he left with the meat jelly and parrot.</p><br/><p>Greed watched Meng Hao leave, and then glanced around at the mess. Then, he really did start to cry. In his estimation, his necropolis must now be the poorest of all 33.</p><br/><p>“I really did underestimate him. Not even ravenous dogs could pick the place apart as cleanly and thoroughly as this....”</p><br/>\n</div>"}