{"title": "Chapter 1249: Im Meng Chen!", "id": 1249, "volume": 13, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-1249-im-meng-chen", "volume_title": "Volume 13", "body": "<h1>Chapter 1249: Im Meng Chen!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 1249: I’m Meng Chen!</strong></p><br/><p>Outside the exit, the starry sky was pitch black and stretched out in all directions. When Meng Hao emerged, he could see the other brightly shining rifts, out of which other cultivators were emerging.</p><br/><p>Quite a number of cultivators of the Heavengod Alliance had entered the 33 Hells. Of the few remaining who were emerging now, some looked alarmed, whereas others looked delighted. Obviously, those were the people who had acquired something valuable inside. As for those cultivators, their fellow sect members quickly converged around them and escorted them away.</p><br/><p>Other people didn’t look very happy about that, but after considering the matter, decided not to fight over the spoils.</p><br/><p>Meng Hao mixed in with the crowds as they left the area of the 33 Hells, eavesdropping on their conversations as he did.</p><br/><p>“It’s shut now, so the initial opening is over. The next time they open, more of the grave sites will be available....”</p><br/><p>“The 33 Hells will open three times in a row, and the period between the openings isn’t that long.... Soon it will be time for the second opening, and in the end... the third!”</p><br/><p>“I can’t wait for the final opening, the third. Supposedly lots of sects acquire precious treasures and Daoist magics then.”</p><br/><p>“The level of danger always increases with each opening, though. Just now, not too many people died, but in the second opening, probably half of the people who go in won't make it out. As for the third opening... only the truly lucky can survive.”</p><br/><p>Meng Hao’s eyes glittered, but his expression remained the same. He followed everyone as they flew along. His cultivation base wasn’t very high at the moment, only in the Immortal Realm, which put him at the bottom of the pack. However, he wasn’t the only Immortal Realm cultivator; there were a handful of others, ensuring that he didn’t stick out too much.</p><br/><p>He went along, maintaining a certain speed that ensured that he fell behind. The group was led by Dao Realm experts, and eventually broke out from the region of the 33 Hells.</p><br/><p>Eventually that included Meng Hao. As he emerged, bright light shone into his eyes; the starry sky here glittered resplendently, which was a stark contrast to the pitch black near the 33 Hells.</p><br/><p>Meng Hao looked around and saw that the area surrounding the 33 Hells was packed tight with thousands of floating battleships. There were even floating palaces which had been erected, which belonged to various sects in the Heavengod Alliance. As the cultivators flew out of the 33 Hells and went in the directions of their sects, Meng Hao looked around at the various ships until he found the one belonging to the Meng Clan. The Young Lord and his Dao Protector were there, examining everyone exiting the 33 Hells, looking for the members of the Meng Clan that had gone in.</p><br/><p>Meng Hao’s eyes glittered coldly as he caused his face to grow pale, and put a look on his face that made it seem like he had just escaped with his life. Then he lurched along as if injured as he headed toward the Meng Clan ship.</p><br/><p>At first, it was quite a chaotic scene as everyone headed toward their various sects, but things quickly started to quiet down.</p><br/><p>Meng Hao slowly neared the Meng Clan ship, and finally, the Young Lord caught sight of him. The Young Lord immediately looked delighted, but the Dao Protector behind him frowned and looked off into the distance. Seeing that no more members of the Meng Clan had emerged, he sighed.</p><br/><p>Soon, the ship’s shields were lowered, and Meng Hao boarded. He immediately coughed up a mouthful of blood and staggered off to the side, supporting himself on a handrail before managing to stand in place.</p><br/><p>“How come you’re the only one who came back?” shouted the Dao Protector. “What happened to everyone else?” Among the other members of the Young Lord’s retinue present were a few people who were his long-time servants. One was a middle-aged cultivator, a butler who had recently been berating him and now looked very surprised to see Meng Chen alive.</p><br/><p>After all, of all the clan members who had gone into the 33 Hells, Meng Chen’s cultivation base had been the weakest. And yet now, he was the only one to return.</p><br/><p>On the other side of the ship was the young man from the Han Clan and his Dao Protector. The young man stood there looking at Meng Hao, his sinister eyes glittering with a strange light as he slowly licked his lips.</p><br/><p>“I never thought that this guy would actually make it out alive,” the young man murmured. “Seems he’s pretty lucky....” As he looked Meng Hao up and down, his eyes gleamed.</p><br/><p>His Dao Protector didn’t say anything. He knew what that gaze meant, and he was aware that this clan’s Young Lord had rekindled an interest in this Meng Clan cultivator....</p><br/><p>In response to the shouting Dao Protector, Meng Hao’s face paled, and he began to tremble. Sounding very bitter, he wheezed, “Dead, all dead....”</p><br/><p>Meng Hao wasn’t familiar with Meng Chen’s manner of speaking, so he didn't’ say much, only a few words. He coughed up some more blood and swayed as if he were on the verge of toppling over unconscious. But then he looked over at the Meng Clan’s Young Lord, and his heart thumped.</p><br/><p>“Dead?!” the Dao Protector yelled again. “How come everyone else is dead, and you came back alive? What happened in there? Tell me!”</p><br/><p>Meng Hao ignored the old Dao Protector and then slapped his bag of holding to produce a silver trident, which he held aloft.</p><br/><p>“Meng Chen has accomplished his mission!” Meng Hao declared. “I nearly died, but I managed to bring this treasure out. This was the magical item that everyone died to get....”</p><br/><p>The Young Lord’s eyes gleamed. Striding forward, he grabbed the silver trident, tested it out a bit, and then an expression of delight filled his face. Then he looked at Meng Chen, grabbed his bag of holding and rifled through it, then handed it back.</p><br/><p>“Not bad, Meng Chen. This will count as a bit of meritorious service for you.” The Young Lord held the trident in hand, looking more and more pleased, until he finally laughed out loud.</p><br/><p>“Now that I’ve gotten my hands on a precious treasure, I can go back to the clan and be lavished with praise by the Patriarch.”</p><br/><p>Meng Hao swayed back and forth, just barely managing to clasp hands, bow deeply and say, “This does not count as Meng Chen’s meritorious service alone; all of the clan members worked hard to get this trident. Of course, most important was that this was all part of the Young Lord’s master plan. That was the only way we successfully got our hands on the treasure.”</p><br/><p>The Young Lord gaped at him for a moment, then clapped him on the shoulder and laughed loudly.</p><br/><p>“Excellent, excellent,” the Young Lord said, clearly in a good mood. “Since you’ve made some contributions I’ll give you a reward too. You can get treated in the sick bay for three days. Men, take him away!” Men immediately came forward to lead Meng Hao to the sick bay.</p><br/><p>The old Dao Protector frowned. Although he didn't suspect Meng Hao of anything, he was considering how difficult it was going to be to explain the situation when he got back to the sect. Although he didn’t take time to think about how differently Meng Hao had been acting, the middle-aged cultivator off to the side who had had some dealings with Meng Chen seemed very surprised.</p><br/><p>As for the young man from the Han Clan, his eyes were glued to Meng Hao, and began to shine even more brightly than before.</p><br/><p>Time passed. After the three days were up, Meng Hao went to his cabin on the ship to practice cultivation. He posted a notice on the door that he was in healing, and nobody disturbed him; after all, few people paid attention to Meng Chen.</p><br/><p>As far as life on the ship went, Meng Chen didn’t have any friends. During his time in the sick bay, Meng Hao had already sent his divine sense out to cover the entire ship. If he wanted to, he could kill everyone on board with a single thought, even the Dao Protector.</p><br/><p>After observing things for a while, including conversations between the ordinary clan members, the interactions of the Young Lord Meng De with his Dao Protector, and the perverse fetishes of the young man from the Han Clan which caused Meng Hao to frown, he was gradually able to come to an understanding the type of tough life Meng Chen had experienced on the ship. He had also experienced certain humiliations. Because of all that, there was no one here he could be considered very familiar with, with the exception, perhaps... of the middle-aged butler.</p><br/><p>That was the one person who had appeared to be surprised by Meng Hao showing up. Meng Hao could tell after observing the man throughout these three days that although he appeared to be on familiar terms with Meng Chen, he harbored ill intentions. Finally, one night when the man was in a meditative trance, Meng Hao sent some divine will in his direction and quietly sent his mind into chaos, killing him silently.</p><br/><p>The man’s death caused a bit of a commotion among the Meng Clan, but the Dao Protector's investigations indicated that the man had passed away due to an incident during cultivation, leading to widespread sighing.</p><br/><p>The matter was quickly forgotten, and the Meng Clan ship continued to fly through the Heavengod Alliance. It was as they neared one of the exit planets that Meng Hao left the sickbay and returned to Meng Chen’s room, where he began to practice meditation.</p><br/><p>Because of the death of Patriarch Blacksoul, and the other people Meng Hao had killed, the bounty on his head wasn’t very enticing for the Heavengod Alliance any more. Add in the fact that the 33 Hells had opened, and it ensured that few people were even talking about Meng Hao any more. The only people who were searching for him were disciples from some of the sects whose Patriarchs Meng Hao had killed.</p><br/><p>Therefore, it was much easier to get around the previously locked down Heavengod Alliance. Most of the exits and teleportation portals were unsealed, and other than inspections performed there, not much else was happening regarding the search.</p><br/><p>Many people assumed that Meng Hao had simply died within the 33 Hells.</p><br/><p>In fact, not even the Heavengod Society issued any orders regarding what to do about him. Because of all that, it was a simple matter for the Meng Clan’s ship to pass through the exit planet and reach... the area outside the Heavengod Alliance!</p><br/><p>When that happened, Meng Hao opened his eyes. He could sense the change in the starry sky, and walked out of his cabin onto the deck of the ship, where he stared back at the Heavengod Alliance, sighing.</p><br/><p>He hadn’t been in the Eighth Mountain and Sea for very long, but he had already experienced many, many things.</p><br/><p>He had exterminated the Blacksoul Society, been put on the wanted list by the Heavengod Alliance, had fulfilled his long-time wish of taking the Imperial examinations again, had encountered the Daoist priest of the Righteous Noble Sect, had learned the Seal the Heavens Incantation, had entered the 33 Hells, had killed Dao Lords, had been possessed by Greed, had acquired an entire body’s worth of good fortune, and had taken the place of Meng Chen on this ship.</p><br/><p>“After I get to the Meng Clan... I'm definitely going do some incredible things!” Meng Hao smiled, and his eyes glittered. It was at this point that the languid voice of a man suddenly spoke out behind him.</p><br/><p>“You’re going to be spending the night with me.”</p><br/>\n</div>"}