{"title": "Chapter 1269: Shocking Tribulation!", "id": 1269, "volume": 13, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-1269-shocking-tribulation", "volume_title": "Volume 13", "body": "<h1>Chapter 1269: Shocking Tribulation!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 1269: Shocking Tribulation!</strong></p><br/><p>Ripples spread out in the starry sky, sweeping about, instantly covering the entire area surrounding Meng Hao.</p><br/><p>Those ripples contained layers of Dao, and as they spread out, anyone who heard them felt as if they were listening to countless living beings whispering in their ears.</p><br/><p>The five Meng Clan Patriarchs’ faces flickered as they looked up into the starry sky at... the origin of all of the ripples.</p><br/><p>As of this moment, the starry sky was completely quiet, as was the Meng Clan with its central continent and nine auxiliary continents. The only thing which could be heard was the increasingly anxious panting of the audience.</p><br/><p>The members of the nine bloodlines, regardless of the level of their cultivation base, could sense the ripples spreading out over the lands, and the indescribable pressure radiating down from the starry sky.</p><br/><p>RUMBLE!</p><br/><p>The lands began to tremble, breaking the silence as mountains crumbled and rivers suddenly went still.</p><br/><p>Every face in the Meng Clan flickered, and their minds filled with roaring sounds.</p><br/><p>“That’s....”</p><br/><p>“What happened?”</p><br/><p>“What’s going on? I can sense an indescribable pressure.... It’s almost like Heavenly Tribulation!!”</p><br/><p>Grandma Meng's eyes went wide as she looked up; she had her speculations about what exactly was happening, but almost couldn’t believe them to be true. It wasn’t just her; all the other Ancient Realm cultivators in the clan were filled with shock and astonishment.</p><br/><p>That was especially true when they realized that all of it was happening because of Meng Hao. Then, their astonishment reached a pinnacle.</p><br/><p>“This is impossible!”</p><br/><p>“The Door of the Ancient Realm!? This aura and pressure clearly indicates that the Door of the Ancient Realm is coming!!”</p><br/><p>“No way! That’s not the Door of the Ancient Realm. This pressure far, far exceeds that. If this is really the Door of the Ancient Realm, then... it’s thousands of times more powerful than an ordinary Door of the Ancient Realm!!”</p><br/><p>“None of those things are that important. The most important thing to remember... is that this Door of the Ancient Realm is coming for Meng Chen. In that case... his cultivation base.... Could it be in the Immortal Realm!?!?” People felt like their minds were about to explode.</p><br/><p>The five Patriarchs up in the starry sky began to fall back, faces flickering with various emotions. Finally, the shape of an enormous door became visible. An ancient, archaic aura began to spread out, and expressions of utter disbelief appeared on the faces of the five Patriarchs.</p><br/><p>“The Door of the Ancient Realm. It's really... really the Door of the Ancient Realm!”</p><br/><p>“He... really is in the Immortal Realm. But I’ve never heard of any Immortal who was strong enough to fight the power of the Dao Realm!!”</p><br/><p>“Wait, I remember... there is one type of Immortal....”</p><br/><p>“Allheaven Dao Immortals!!” The five Patriarchs’ minds were spinning, and as they exchanged glances, each of them could tell how utterly shocked the others were.</p><br/><p>As of this moment, every single person in the Meng Clan was having the same reaction. After everyone sensed that it was indeed the Door of the Ancient Realm, massive waves of shock pounded their hearts, and they almost felt as if they were hallucinating.</p><br/><p>Meng Hao stood alone in the starry sky, looking up into the boundless expanse, and the majestic ripples which were spreading out. Soon, the shape began to take form... the Door of the Ancient Realm!</p><br/><p>Meng Hao’s Door of the Ancient Realm!</p><br/><p>By converging Dao Fruit power and pushing open that door, he could be baptized by the Mountains and Seas, gain their approval, and thus, figuratively return to ancient times. He could... search for that ancient path in which the lamps were extinguished but the cultivator was not. Become... an Ancient Realm expert!</p><br/><p>“My Door of the Ancient Realm!” he murmured quietly. Meng Hao’s eyes shone with a brilliant light, and in almost the same moment that he spoke, a sound like muffled thunder could be heard ringing out, filled with power that could shake Heaven and Earth.</p><br/><p>Amidst the rumbling, massive amounts of ripples spread out, and the Door of the Ancient Realm began to grow larger, larger, larger.... Eventually, clouds actually appeared in the starry sky, spreading out to cover everything.</p><br/><p>Shockingly, figures could be seen within those clouds, people who wore clothing from ancient times, and who immediately began to emanate shocking auras.</p><br/><p>There were even faint shouts coming from within the clouds, which grew more intense and strong as they echoed out, until finally it sounded like the Heavens were roaring. The ripples grew more intense, and the clouds seethed, covering the entire Door of the Ancient Realm, making its ancient, archaic aura even more prominent.</p><br/><p>Soon, the area around the Door of the Ancient Realm began to twist and distort, almost as if time were flowing differently in that area, an area that was almost like another world!</p><br/><p>Pressure suddenly exploded out, a terrifying pressure that caused Meng Hao’s face to flicker. Without even thinking about it, he fell back a bit.</p><br/><p>His hair began to whip about, and cracking sounds could be heard from within his body. It was as if the incredible pressure from Heaven and Earth wished to crush Meng Hao out of existence. Meng Hao’s mind began to reel.</p><br/><p>“This isn't right!” Meng Hao’s pupils constricted, and he fell back again. As for the five Meng Clan Patriarchs, they had long since fled far off into the distance.</p><br/><p>They were now filled with intense fear, and their faces had drained of blood.</p><br/><p>“Th-that’s... the Door of the Ancient Realm? How come it seems even more terrifying than Dao Realm Tribulation!?!?”</p><br/><p>“The ancient records don’t mention anything about a Door of the Ancient Realm like this. I've never even heard of anything like it. How can a Door like this even be transcended!?”</p><br/><p>“This is a grand tribulation of Heaven and Earth. Not even Dao Realm Tribulation can match up to this Door of the Ancient Realm....” The five Patriarchs didn’t even think it was possible for anyone to be able to pass through a tribulation like this Door of the Ancient Realm.</p><br/><p>They weren't confident that they could deal with it in their current states, and that wasn't even taking into consideration the shocking, terrifying aura that could be felt from the clouds surrounding the door.</p><br/><p>Meng Hao's face looked extremely unsightly. As for the members of the Meng Clan down below, they stared with wide eyes at the door and the clouds, which were definitely the most terrifying thing they had ever seen in their lives.</p><br/><p>They were one of a very small group of people in the Mountain and Sea Realm... who could personally witness an Ancient Tribulation that actually... exceeded Dao Tribulation!</p><br/><p>Meng Hao’s face was exceedingly grim. He had believed all along that he would simply breeze through the Ancient Realm. After all, he was already strong enough to fight the Dao Realm. In fact, in the entire Mountain and Sea Realm, there were only a few people who might be able to beat him in a fight. Therefore, Meng Hao had considered himself to essentially be at the peak of the Mountain and Sea Realm.</p><br/><p>But now he realized that he had been mistaken. Very, very mistaken. That mistake was not his understanding of the level of his battle prowess, but rather... the fact that an Allheaven Dao Immortal being able to defeat Dao Realm experts in battle indicated that his battle prowess was actually... a complete defiance of the Heavens!</p><br/><p>Heaven-defying people would receive Heaven-defying punishment. Perhaps it wasn’t merely a matter of ordinary defiance. Perhaps... like everything, a price had to be paid in order to acquire anything. Meng Hao had acquired incredible battle prowess, and the price he now had to pay for that... was an indescribably terrifying Ancient Tribulation!</p><br/><p>He looked at the clouds, and the door just barely visible within them, and he could sense death!</p><br/><p>“This won’t just be a simple matter of opening the door and stepping into the Ancient Realm, then going through the process of extinguishing the lamps.... To me, the Ancient Realm will not be passed through casually. It will be a series of deadly crises.... As an Allheaven Dao Immortal, it's something that must happen....” Now that he finally understood, he sighed.</p><br/><p>“I wonder if there were Allheaven Dao Immortals in the Paragon Immortal Realm... who succeeded in getting past the Ancient Realm and into the Dao Realm?” That question caused Meng Hao to suddenly feel completely shaken by this shocking Door of the Ancient Realm. He truly wished to know whether or not an Allheaven Dao Immortal had ever succeeded.</p><br/><p>It was at this point that rumbling sounds could be heard from within the clouds. It almost sounded like people shouting, and it caused everything to shake. The minds of all the people up in the starry sky began to tremble.</p><br/><p>The five Patriarchs’ faces were pale white, and without any hesitation, they shot back down toward the Meng Clan continent, where they activated the Meng Clan’s grand defensive spell formation, cutting themselves off from Meng Hao.</p><br/><p>Apparently they feared the possibility of the tribulation of the Door of the Ancient Realm pulling them in....</p><br/><p>Although they knew that tribulations only targeted individual cultivators, and not bystanders, the terrifying nature of this Ancient Tribulation left them completely petrified.</p><br/><p>Now, Meng Hao was the only person left out in the starry sky, facing the boundless clouds and the enormous Door of the Ancient Realm. Compared to them, he looked like nothing more than an ant.</p><br/><p>Despite the intense sensation of deadly crisis, Meng Hao looked calm as he studied the clouds. It was at this point that his grandmother’s voice could be heard calling out anxiously from the continent down below.</p><br/><p>“Hao’er, get down here into the spell formation!” As she cried out, an opening appeared within the spell formation shield.</p><br/><p>The appearance of the opening caused the five Patriarchs to cry out in fear. “Absolutely not!!”</p><br/><p>Meng Hao looked back down at his grandmother. Her clear state of anxiety warmed his heart, but he shook his head.</p><br/><p>“Grandma Meng, this... is my Tribulation!” With that, he turned, unleashed the power of his cultivation base, and shot toward the clouds. “It doesn’t matter whether the process is difficult or easy. I'm still going to give it a shot, no matter what!</p><br/><p>“I’ve been practicing cultivation for hundreds of years now, and I’m an Allheaven Dao Immortal. I'm not sure if there were people like me in the past, but... since I've gained so much, I have to pay the price!</p><br/><p>“This Ancient Tribulation is that price, and it's nothing more than a thorny patch on the road stretching out in front of me.</p><br/><p>“I’ll just pluck the thorns up and keep going. If there were Allheaven Dao Immortals in the past who walked in the Ancient Realm, then I'm going to do the same thing!” Meng Hao threw his back and laughed, then shot like lightning toward the clouds.</p><br/><p>He was directly tackling the tribulation of the Door of the Ancient Realm!</p><br/>\n</div>"}