{"title": "Chapter 1280: Paragon Soul Lamp!", "id": 1280, "volume": 13, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-1280-paragon-soul-lamp", "volume_title": "Volume 13", "body": "<h1>Chapter 1280: Paragon Soul Lamp!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong></strong></p><br/><p>[/expand]</p><br/><p>This was a completely unheard-of Soul Lamp. The starry sky shook because of the completely astonishing... true Prime Lamp!</p><br/><p>Fundamentally speaking, it should never have appeared. Were it not for Xiao Yihan, perhaps Meng Hao would have been able to ignite that 32nd blood-colored lamp, but he would never have reached 33 lamps!</p><br/><p>Xiao Yihan had actually been attempting to prevent Meng Hao from igniting his Soul Lamps. How could he ever have imagined that the exact opposite had occurred... he had actually been the biggest factor in helping Meng Hao open his 33rd Lamp, his true Prime Lamp.</p><br/><p>“I can tell that once this 33rd Soul Lamp appears,” Meng Hao murmured, “everything... will change significantly.” At the same time that Xiao Yihan’s second arrow rumbled toward him, Meng Hao raised both hands to perform an incantation gesture. Then he pushed out toward the black rain arrow. Although he slowed it down, he didn’t stop it. The arrow stabbed relentlessly into him, then spread out, becoming millions of black drops of rain that filled his body.</p><br/><p>The black rainwater almost seemed self-aware; it burrowed into his flesh and blood, bored through his body, merged into his qi passageways, filled him completely with destructive power.</p><br/><p>However, that power caused his final Soul Lamp to emanate a brilliant glow which then began to absorb the quivering black rain.</p><br/><p>By now, Xiao Yihan could tell that something was going wrong. However, his arrows of darkness and light were already flying toward Meng Hao at top speed. A moment later they stabbed into him.</p><br/><p>BOOOOMMMMMM!</p><br/><p>Blood sprayed out of Meng Hao's chest, which virtually exploded. Bones were visible, as was his beating heart. The wound seemed very serious, and yet, a smile broke out on Meng Hao’s face, and he even started laughing.</p><br/><p>Xiao Yihan’s face completely fell with disbelief. He was shocked, astonished, could hardly believe that he was sensing... the aura of another Soul Lamp inside Meng Hao!!</p><br/><p>“Th-this... is impossible! His Prime Lamp already appeared. It's impossible for another Soul Lamp to emerge. Unless... unless the lamp from before wasn’t actually his Prime Lamp!!</p><br/><p>“But that’s even more impossible. That blood-colored lamp was clearly his Prime Lamp!!”</p><br/><p>Even as Xiao Yihan’s face fell, the Soul Lamp aura on Meng Hao didn't just seep out, it erupted explosively. The four arrows which had just struck him completely vanished, having been absorbed by the new Soul Lamp.</p><br/><p>Meng Hao threw his head back and roared and then, a beam of light appeared above him which was... azure!!</p><br/><p>That light caused massive transformations in Heaven and Earth; the starry sky trembled, and the energy of Heaven and Earth, which had been fading, suddenly grew strong again, surrounding Meng Hao, turning into a vortex of power that poured into him. This was the power he needed to ignite his 33rd Soul Lamp!</p><br/><p>Meng Hao’s roar echoed out as the azure light above him grew more and more intense. Everyone watching was flabbergasted, and uncontrollable fear exploded out from deep in their souls.</p><br/><p>That included the members of the Meng Clan and the invading cultivators. No matter the level of their cultivation bases, be they in the Immortal Realm, the Ancient Realm, or even the Dao Realm, as of this moment, everyone was involuntarily struck with awe.</p><br/><p>Even Xiao Yihan, who had started out as a boy and was now a young man, could not suppress the reverence that grew in his heart.</p><br/><p>“That... that azure color....” he muttered, shivering. Everywhere in the Eighth Mountain and Sea, all regions were filled with rumbling sounds. At the same time, the Xuanwu turtle in the celestial pool on the Eighth Mountain lifted its head and howled.</p><br/><p>In the Ninth Mountain, the Seventh Mountain, the Sixth Mountain... in the entire Mountain and Sea Realm, the Xuanwu turtles in the celestial pools on all of the Nine Mountains trembled, threw their heads back, and howled.</p><br/><p>The howls of the Nine Mountains’ Xuanwu turtles shook the entire Mountain and Sea Realm, and everyone in it.</p><br/><p>In fact, in the starry sky of the Eighth Mountain and Sea, Patriarch Reliance, who was floating along comfortably, also shivered. Suddenly, he felt as if he couldn't control his own body, as though his blood was somehow being awakened by something. He also... lifted his head up and howled!</p><br/><p>Unexpectedly, his howling combined with the howls of the nine Xuanwu turtles, joining together, as if... there were a Tenth Mountain and a tenth turtle!</p><br/><p>The sun and moon flickered and stopped orbiting. The Nine Mountains shook, and the Nine Seas churned. The azure light above Meng Hao grew more and more clear, until in the end, it was possible to see an azure flame there, within which was the figure of a cross-legged cultivator.</p><br/><p>That cultivator wore a long azure robe, and although he resembled Meng Hao, if you looked more closely you would be able to see differences. Apparently, that azure-colored flame contained a bit of aura.</p><br/><p>That was... the aura of a Paragon!</p><br/><p>Meng Hao’s 33rd Soul Lamp flared to life, and shockingly... it was the will of Paragon Nine Seals’ blood inside of him that transformed... into a Soul Lamp!</p><br/><p>It was... a Paragon Soul Lamp!</p><br/><p>“Paragon Soul Lamp!!” Xiao Yihan thought, heart trembling. His eyes went wide with disbelief and shock as he suddenly recalled a legend, something that he had once read about in the ancient records and had assumed was an impossibility.</p><br/><p>“He’s... he's....” Xiao Yihan’s scalp went numb as he watched Meng Hao. Then he looked at Meng Hao’s head and the azure Paragon Soul Lamp hanging over it, and realized that he could sense something on both Meng Hao and the Soul Lamp. It was... the aura of the Mountain and Sea Realm!</p><br/><p>He backed up slowly, and then without the slightest hesitation whatsoever, turned tail in retreat, vanishing without a trace.</p><br/><p>Even as he fled, Meng Hao suddenly looked up and said, “33rd Soul Lamp, ignite!”</p><br/><p>He waved both hands, causing his cultivation base to erupt with power as the azure Soul Lamp floated up from the top of his head to float above in the starry sky.</p><br/><p>Soon, the only color that could be seen in the starry sky was azure!</p><br/><p>Because of that azure light, all of the other Soul Lamps dimmed, even the blood-colored Soul Lamp. Not only was it clear that this lamp was the sovereign over the others, it also caused Meng Hao to emit a stifling pressure that suppressed everyone whom it swept over, making it extremely difficult for them to rotate their cultivation bases.</p><br/><p>It was as if the appearance of this azure Soul Lamp had caused something to awaken in Meng Hao... the aura of the entire Mountain and Sea Realm!</p><br/><p>It came from the legacy of the League of Demon Sealers, and was... the pressure that came from the Lord of the Mountain and Sea Realm! Although it wasn’t very powerful at the moment, the more profound Meng Hao’s cultivation base grew, the stronger the aura would get. In the end, even a single look from him would cause a 6-Essences Dao Sovereign’s cultivation base to be thoroughly suppressed.</p><br/><p>This was... the Lord of the Mountain and Sea Realm!</p><br/><p>An image appeared in Meng Hao’s mind, an image of the Mountain and Sea Realm. He had the intense sensation that he... could stretch out his hand and take the entire Realm into his hand.</p><br/><p>Then, he decided to do just that; he stretched out his hand, and it felt as if he were holding up something invisible. That motion caused the Eighth Mountain and Sea to tremble, as well as all of the other Mountains and Seas. Even the sun and moon shone with brilliant light, and trembled... with anticipation!</p><br/><p>It was only a brief moment, but that was all it took to almost instantly drain Meng Hao’s cultivation base. He immediately pulled his hand back, and gradually, his cultivation base was restored.</p><br/><p>33 Soul lamps circulated around him, emitting soft light. All of them were continuously absorbing the energy of Heaven and Earth, and constantly growing stronger.</p><br/><p>“The Ancient Realm....” Meng Hao murmured. As of this moment, he truly was in the Ancient Realm. The next step would be the experience of slowly extinguishing all of his Soul Lamps. After reaching the great circle, he would... break through as an Allheaven Dao Immortal into the next Realm, the Dao Realm!</p><br/><p>Meng Hao could already sense that he... despite not being in the Dao Realm, was already able to gain enlightenment of Essence, even to acquire it....</p><br/><p>Furthermore, he had a gut feeling that these Essences pointed toward... his Demon Sealing Hexing magic!</p><br/><p>“I’m a member of the League of Demon Sealers, and my Essences will be my Demon Sealing Hexing magics!” Meng Hao’s eyes glittered.</p><br/><p>“I just wonder if, after extinguishing my 33 Soul Lamps, I’ll be able to acquire nine Essences. If I do, the realm that I’ve broken into... will it still be considered the Dao Realm...?</p><br/><p>“Or is it possible... that... I could reach that Realm which Paragon Nine Seals only managed to step halfway into... the Daosource Realm. Then I myself could become... a source of Essence!” Meng Hao’s face shone with enlightenment. Although he was actually speculating, he at least had a direction to aim in.</p><br/><p>“Since I'm an Allheaven Dao Immortal, and no one like me has ever successfully completed traversing the Ancient Realm, then I must surely travel a different path from others, and thus be able to increase my chances of passing through the Ancient Realm!</p><br/><p>“To Allheaven Dao Immortals, the Ancient Realm is actually an entire set of Ancient Tribulations. For me that means… 33 Ancient Tribulations!” His eyes flickered as he looked at his 1st Soul Lamp, and had the feeling that with a mere thought on his part, he could easily extinguish it.</p><br/><p>At the same time, all of his Soul Lamps seemed as though they were somehow connected.</p><br/><p>Meng Hao looked away, flicking his sleeve and causing his 33 Soul Lamps to enter his body. Then he turned and looked back at the Meng Clan and all the invaders and traitors.</p><br/><p>As soon as he looked at them, they began to tremble.</p><br/><p>It was at that point that, all of a sudden, a muffled roar echoed out in the Eighth Mountain and Sea. It came from far off, and gave rise to powerful ripples, and a tempest that swept across the entire Eighth Mountain and Sea!</p><br/><p>All of the cultivators were shocked, and in that moment, the Heavengod Alliance was thrown into astonishment.</p><br/><p>The sound came from the border region between the Eighth Mountain and Sea and the Seventh Mountain and Sea. Suddenly a huge rift opened in the barrier between the two Mountains and Seas. Lightning danced and the wind screamed as numerous figures shot through the rift, radiating killing intent. In an instant, it was clear that the number of cultivators was vast... and they were all entering the Eighth Mountain and Sea.</p><br/><p>These were none other than the cultivators from the Seventh Mountain and Sea!</p><br/><p><strong>Chapter 1280: Paragon Soul Lamp!</strong></p><br/>\n</div>"}