{"title": "Chapter 1301: Victory!", "id": 1301, "volume": 14, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-1301-victory", "volume_title": "Volume 14", "body": "<h1>Chapter 1301: Victory!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong></strong></p><br/><p>[/expand]</p><br/><p>Meng Hao didn’t know this man formed from the Essence of Divine Flame. However, there was something very familiar about him, and then Meng Hao recalled some of the things that had occurred in the land of Divine Flame.</p><br/><p>The enormous eye there had been surrounded by raging fire, as if it had been the soul of the sea of flames.</p><br/><p>Meng Hao’s eyes flickered, as he came to the conclusion that this man was most likely... the same man whose enormous eye existed in the world of Divine Flame.</p><br/><p>He was the same almighty expert from ancient times who had been imprisoned on Planet South Heaven in the Ninth Mountain and Sea by... Dao Fang!</p><br/><p>In the same moment that this man appeared, back in the Ninth Mountain and Sea, beneath the surface of Planet South Heaven, the world of Divine Flame quaked as all of the Divine Flame there erupted out, setting the entire world aflame.</p><br/><p>The enraged roaring there was echoed in the Eighth Mountain and Sea by the man standing in front of Meng Hao, forming a resonance.</p><br/><p>“Dao Fang, you must die!!”, the man howled. It was as if the obsession which fueled this man’s soul could never be eradicated. The projection of Dao Fang which had been summoned by Lord White began to tremble with both rage and enmity as he took a step forward. The sea of flames rumbled and churned as the man therein waved his hand, causing crashing flames to surge out like waves across the sea, directly toward... the projection of Dao Fang.</p><br/><p>Meng Hao’s mind was reeling, and as he narrowed his eyes, they began to glow with brilliant light. Off in the distance, Lord White was completely shocked. No matter how he considered the matter, he would never have imagined that the stream of Dao Fang’s divine will would not instantly eradicate Meng Hao, but also... that Meng Hao would have an astonishing soul hidden on him!</p><br/><p>Both that soul and Dao Fang exploded with astonishing energy that was not the energy of a Dao Sovereign, but actually exceeded that! It was... the energy of a Paragon!</p><br/><p>RUUMMMMBLLLLLE!</p><br/><p>A massive eruption of sound shook the entire Eighth Mountain and Sea. The eyes of Dao Fang’s projection glowed with a strange light as he strode forward, brandishing that gigantic staff and then smashing it down toward the middle-aged man.</p><br/><p>The man roared, eyes flashing with enmity as he performed a double-handed incantation gesture and then raised his hands up into the air, summoning a massive flame head, which grinned as ferociously as an evil spirit. With an unyielding roar and unmatchable madness, it shot forward in an attack that contained tens of thousands of years of hatred.</p><br/><p>When they slammed into each other, the entire starry sky shook, and a massive shock wave swept out in all directions. When it hit Meng Hao, blood sprayed out of his mouth, and he staggered backward. As for Lord White, he was also seriously injured, and coughed up blood as he was shoved away.</p><br/><p>However, even as they both fell back, even as the man in the flames began to fight with Dao Fang, both Meng Hao and Lord White ground to a halt and then instantly charged toward each other.</p><br/><p>Their battle was not over. Despite the fact that both of them were like oil lamps on the verge of flickering out, even though both of them were seriously injured... they would still fight!</p><br/><p>RUMBLE!</p><br/><p>As they closed in on each other, the glow of magical techniques rose up, and the ripples of divine abilities spread out. The power of the Mountains and Seas was unleashed by both sides, and they even collided physically. In an instant, they exchanged thousands of volleys.</p><br/><p>Their injuries worsened, and both of them were coughing up mouthfuls of blood. The bloody wounds which covered their bodies were a sight to see; not even the Green Emperor’s Eternal Incantation that Lord White possessed could keep up.</p><br/><p>After a moment, echoing booms rang out as the two of them fell back. They were spattered with blood, and their faces were twisted into vicious expressions. Lord White was gritting his teeth, and from the look in his eyes, he was throwing caution to the wind. He had already used virtually every technique and method he could think of, but was unable to take down Meng Hao. In fact, it was even possible to say that Meng Hao was... the most powerful opponent he had fought in his entire life!</p><br/><p>“On this day, you will die!” he roared, hair flying about in disarray. He suddenly made a grasping motion, summoning nine pitch-black swords!</p><br/><p>As soon as the nine black swords appeared, they began to emanate intense, acrid fumes. At the same time, countless vengeful ghosts began to swirl around them, letting out inaudible screams.</p><br/><p>“With life comes death, with death comes life! Curse power can kill with a word, and its highest level is... Death Curse Magic!” Lord White’s eyes gleamed with madness. As far as he was concerned, this Death Curse Magic was even more terrifying than the Three Daos and Three Magics of the Mountain and Sea Scripture. In fact, the Death Curse was something that even he, the Lord of the Seventh Mountain and Sea, had only unleashed once before in his entire life.</p><br/><p>That was when he had become a Mountain and Sea Lord. In that battle royale, he had used this magic in a critical moment to secure victory. However, the price he paid... was that from that moment on, his cultivation base was eternally stuck at the 5-Essences level. Any progress beyond that would be extremely difficult.</p><br/><p>Right now, he was using the curse magic a second time!</p><br/><p>He didn’t hesitate at all; changing his mind was something that he would never tolerate. The madness in his eyes grew more intense as he waved his hand; a droning sound then filled the air as one of the nine black swords shot toward him and stabbed him in the chest!</p><br/><p>When the sword stabbed into him, Lord White let out an intense roar. At the same time, his divine sense erupted out explosively. Next, a second sword, a third sword, a fourth, and a fifth sword all stabbed into him one after another, one for each of his limbs. At this point, Lord White’s divine sense was raging upward nonstop, to the point where even Meng Hao was shocked.</p><br/><p>As of this moment, Lord White’s divine sense was close to thirty percent that of a Paragon!</p><br/><p>Things weren’t over though. The sixth sword, seventh sword... and finally the eighth and ninth swords all stabbed into Lord White. Blood sprayed out of his mouth, and his flesh was a mangled mass of gore. Blood began to ooze out of his eyes, ears, nose, and mouth, and yet, his divine sense had reached a pinnacle; it was now at fifty percent of that of a Paragon!</p><br/><p>The terrifying divine sense erupted out, shaking the starry sky. At the same time, Lord White’s face twisted in an insane smile as he looked at Meng Hao and then said, “Death Curse!”</p><br/><p>Instantly, his divine sense exploded out, materializing into an astonishing curse, a complex, pitch-black magical sealing symbol which shot toward Meng Hao. The curse power's foundation was divine sense, so the stronger the divine sense was, the stronger the curse would be.</p><br/><p>And now, Lord White, in exchange for being stabbed through by the nine black swords, had increased his divine sense to the equivalent of fifty percent of a Paragon's divine sense. Because of that, to those at the 5-Essences level, this Death Curse... was invincible!</p><br/><p>Intense rumbling echoed out as it closed in on the grim-faced Meng Hao, whose eyes shone with a strange light. As the curse neared him, he took a deep breath and then... erupted with divine sense!</p><br/><p>RUMBLE!</p><br/><p>Meng Hao’s divine sense swept out across Heaven and Earth with mad intensity.</p><br/><p>RUMMMMBLLLE!</p><br/><p>He instantly went all out, fighting back with his own divine sense, which was at forty percent of the level of a Paragon.</p><br/><p>RUUUUUUMMMMBLLLLE!</p><br/><p>Blood sprayed out of Meng Hao’s mouth, and oozed out of his eyes, ears, and nose. He was shaking violently, and yet, his divine sense still managed to hold up against the Death Curse. Off in the distance, Lord White coughed up a huge mouthful of blood, and his eyes filled with disbelief. He could sense how strong Meng Hao’s divine sense was; it was clearly powerful enough that it could resist his Death Curse!</p><br/><p>“This is impossible!” he cried. Unable to believe what was happening, he threw his head back and roared. The Death Curse Magic was not something he could sustain for very long, and if it didn’t hit its target, the resulting backlash was something he wouldn’t be able to endure.</p><br/><p>It was in this very moment that, atop the Eighth Mountain, Meng Hao’s grandfather, the Lord of the Eighth Mountain and Sea, was shaking violently. The battle between Meng Hao and the Lord of the Seventh Mountain and Sea was acting as an enormous catalyst to him!</p><br/><p>In fact, his aura was now radiating off of the Eighth Mountain with increasing intensity.</p><br/><p>However, Lord White was too preoccupied to notice that. As the saying goes, once you start riding a tiger, it's not easy to get off. He began to laugh maniacally, then took a deep breath and performed a double-handed incantation gesture, after which he slapped his own forehead.</p><br/><p>“Mass Cloning! Focus the Joss Flame power of the Lord of the Seventh Mountain and Sea, utilize it to... transform!” As Lord White’s voice echoed out like thunder, a ghost image suddenly sprang up as he transformed from one person into two. Those two became four, and then eight, and then sixteen....</p><br/><p>Meng Hao’s pupils constricted as Lord White rapidly created more than a hundred clones, each one of which emanated terrifying ripples and then... all began to self-detonate.</p><br/><p>The power of those self-detonations bolstered the Death Curse Magic. Lord White’s divine sense grew even more powerful, resulting in the magical sealing symbol growing rapidly larger and even more pitch black.</p><br/><p>“DIE!” roared all of the collapsing versions of Lord White, clone and true self alike.</p><br/><p>However, in the moment that the Death Curse Magic crushed Meng Hao’s divine sense and was just about to land on him, he closed his eyes.</p><br/><p>“The Dao is in My Heart. The Will is in My Eyes...</p><br/><p>“I Shall Possess the Mountains and Seas... Seal the Heavens Incantation!” In the critical moment of this decisive battle, in the last insane attack, Meng Hao unleashed his Seal the Heavens Incantation!</p><br/><p>The power of the Mountains and Seas rumbled down, and the will of the Mountains and Seas merged with Meng Hao's divine sense. The starry sky then erupted with power, with Meng Hao as the center of it all!</p><br/><p>The starry sky collapsed and the void shattered. The Eighth Mountain and Sea shuddered, and the incoming Death Curse Magic was suddenly beaten back. Fissures spread out across the surface of the pitch black magical symbol, until finally, the combined power of the Seal the Heavens Incantation and Meng Hao’s divine sense caused it to shatter. Cracking sounds rang out as it exploded into countless pieces!</p><br/><p>BOOM!</p><br/><p>The Death Curse Magic collapsed into numerous magical symbol fragments which swept out towards Lord White, instantly piercing into him.</p><br/><p>Lord White let out a miserable shriek as the backlash power instantly withered him. Vast quantities of his blood were evaporated, and the shadow of death instantly enveloped his mind. However, there was nothing he could do to fight back; in fact, he could hardly even struggle.</p><br/><p>“No, I am Lord White, I am the Lord of the Seventh Mountain and Sea, I can’t die here....” Even in that moment, however, his body began to collapse, and there was nothing he could do to stop it.</p><br/><p>As of this moment, Meng Hao knew that he had secured victory. Coughing up a mouthful of blood, his consciousness began to fade. The victory he had just won had been a very, very difficult one!</p><br/><p><strong>Chapter 1301: Victory!</strong></p><br/>\n</div>"}