{"title": "Chapter 1306: Third Generation Demon Sealer!", "id": 1306, "volume": 14, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-1306-third-generation-demon-sealer", "volume_title": "Volume 14", "body": "<h1>Chapter 1306: Third Generation Demon Sealer!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong></strong></p><br/><p>[/expand]</p><br/><p>Patriarch Reliance was intensely angry and embarrassed. Shaking, he roared as he attempted to cast off Meng Hao’s Demon Sealing Hexing magic. It was possible now to see how enraged he was because of the characters written on his back....</p><br/><p>Meng Hao gaped in shock as he studied the line of characters which had been warped and faded over time as Patriarch Reliance grew up. Soon... a strange expression appeared on his face.</p><br/><p>“Meng Hao’s turtle....” he read. His eyes went wide, and he cleared his throat. He almost couldn’t believe what he was seeing. Then he thought about what had happened with his Wooden Time Sword and Stepdad Ke’s terracotta soldier, and gradually he understood. [1. You might remember how Meng Hao buried the Wooden Time Swords in chapter 592 and then one of them came back in chapter 742 as the precious treasure of the Solitary Sword Sect. And of course, the terracotta soldier waited for Meng Hao in the Fang Clan Ancestral Land for many years. The “Meng Hao’s turtle” line is from chapter 584]</p><br/><p>Everything that had happened back in the Ancient Demon Immortal Sect had seemed illusory, but the truth was... by means of the divine ability of the Demon spirit Night, it was actually real. As of this moment, Meng Hao felt completely shaken.</p><br/><p>“So it turns out that the turtle I saw in that pagoda in the Ancient Demon Immortal Sect really was the young Patriarch Reliance?” Even as Meng Hao pondered the matter, Patriarch Reliance roared in rage.</p><br/><p>“I figured it out a while ago, Meng Hao you little bastard! Long, long ago I somehow ran into you, and y-y-you... you actually had the audacity to carve words into my back!!”</p><br/><p>The expression on Meng Hao’s face grew more wry as he realized that, in addition to the turtle’s pride, the main reason Patriarch Reliance didn’t want to become his mount could very likely be... the words he himself had carved onto his back.</p><br/><p>Perhaps if someone else had become the Ninth Generation Demon Sealer and had tried to make him a mount... then Patriarch Reliance wouldn’t have refused so vehemently.</p><br/><p>Meng Hao’s thoughts were in a jumble. As of this moment, he had gained a deeper understanding of the Dao of Time and grasped onto some ideas regarding it, but at the same time clear enlightenment evaded him.</p><br/><p>Meng Hao cleared his throat and said, “Ahem. Listen, Patriarch, being stubborn isn't a good personality trait, you know.”</p><br/><p>Ignoring the roars of Patriarch Reliance, he performed an incantation gesture with his right hand and then waved his finger a few more times. Instantly, Demon Sealing Hexing magic was unleashed, landing on Patriarch Reliance and causing him to shiver. The golden magical symbols surrounding him flared with bright light, completely suppressing him.</p><br/><p>In that moment, Patriarch Reliance was immobilized, hovering in the starry sky and unable to do anything except whimper, which caused an intense feeling of unfairness to well up in his heart.</p><br/><p>Meng Hao flashed into motion; in the blink of an eye, he was in front of the door, and then he stepped into it. As he did, the fluctuations of the League of Demon Sealers inside of him exploded out.</p><br/><p>The call and resonance grew to a shocking level, and Meng Hao’s mind reeled. At the same time, the Eighth Demon Sealing Hex, the Body Hexing Magic, was unleashed. Next was the Seventh Hex, Karmic Hexing. After that was the Sixth Hex, Life Death Hexing. Finally came the Fifth Hex, the Inside Outside Hex.</p><br/><p>For the first time, the four Hexing magics... solidified within Meng Hao’s mind!</p><br/><p>They transformed into four magical symbols which shone with brilliant light. As they floated there in Meng Hao’s mind, his vision began to swim. A moment later, though, it cleared, and he was inside the door!</p><br/><p>He saw... a strange world!</p><br/><p>It had a yellow sky that spread out in all directions. The clouds were black, and roaring sounds could be heard therein, as the occasional flickering shadows of enormous beasts about could be seen moving about.</p><br/><p>No plants or vegetation could be seen on the ground, which was pure white and stretched as far off as the eye could see. It gave a peculiar impression that nothing here was real. Off in the distance was an enormous statue of a middle-aged man sitting cross-legged in meditation. It was so gigantic that despite being seated cross-legged, the man’s body reached as high as the sky, seemingly bracing up Heaven and Earth!</p><br/><p>Although the statue didn’t seem to be very far away, when Meng Hao sent his divine sense out, he found that despite its current level and the level of his cultivation base, he was unable to even touch the statue. Apparently the statue was much farther away than it actually seemed.</p><br/><p>Just looking at it, he could see that both of the statue’s hands were locked in incantation gestures, and that a slowly rotating magical symbol floated above each hand. Furthermore, roiling mist could be seen at the statue's forehead, pulsing with a boundless life force that could shake Heaven and Earth.</p><br/><p>After looking around at his surroundings, Meng Hao was shaken. These lands, this world, everything here was clearly vastly different than what was on the outside. Everything seemed so different that the feeling of unreality seemed even stronger than before.</p><br/><p>After a moment of thought, he looked back at the statue with an even keener gaze than before.</p><br/><p>“Lord Li....” he murmured softly. Almost as soon as he laid eyes on the statue, he had been able to tell... that this was the former Mountain and Sea Lord of the Ninth Mountain and Sea, Lord Li!</p><br/><p>Although Meng Hao had never seen him before, his heart was telling him that this statue depicted none other than Lord Li!</p><br/><p>His heart was filled with mixed emotions as he looked at the statue. Lord Li was a legendary figure in the Ninth Mountain and Sea, a person who represented the former glory of a bygone era.</p><br/><p>Back when he was alive, Patriarch Fang and Patriarch Ji had both been subservient to him, as well as the Archdemons, plus Ke Yunhai and his contemporaries as war generals. Because of all of that, the Ninth Mountain and Sea, while not the most powerful force in the Mountain and Sea Realm, was most assuredly not viewed as being weak.</p><br/><p>“Lord Li returned life to the Heavens....” Meng Hao murmured, recalling something that Ke Yunhai had told him. [1. Ke Yunhai mentioned something about what Lord Li did back in chapter 597. The matter was also mentioned again in chapters 579, 587, 589 and 841]</p><br/><p>After a while, Meng Hao took a deep breath, then clasped hands and bowed deeply to the statue of Lord Li. As the Crown Prince of the Fang Clan, and having been born and raised in the Ninth Mountain and Sea, it was only proper for him to pay respects to the former Lord of the Ninth Mountain and Sea!</p><br/><p>After offering formal greetings, Meng Hao looked back up and then gaped in shock.</p><br/><p>He had no idea why, but now that he looked at the statue, it didn’t look like a middle-aged man, but rather, a woman. Although she wasn’t spectacularly beautiful, she seemed kind and gentle.</p><br/><p>Meng Hao looked more closely, and suddenly, the statue seemed to be a man once again. It was really difficult to tell the difference.</p><br/><p>Meng Hao pondered thoughtfully. According to the legends, Lord Li’s true origins were shrouded in mystery. However, even more mysterious was he himself. No one actually knew whether he was a man or woman; in fact, not even people who had been his closest companions truly knew.</p><br/><p>Even as Meng Hao frowned, the entire world suddenly filled with a sound like murmured whispering. It floated about, filling Heaven and Earth, brushing past Meng Hao’s ears.</p><br/><p>“In the past... I gained enlightenment regarding all living things, and returned life to the Heavens....</p><br/><p>“The Sublime Spirit Scripture. The Heaven Severing Scripture. The Dao Divinity Scripture.... What has been passed down in the world are only fragments. The three scriptures, when combined, become... the Mountain and Sea Scripture.</p><br/><p>“The Mountain and Sea Scripture has nine volumes, and each one of the Lords of the Nine Mountains and Seas has one of those volumes....</p><br/><p>“Then there are the three great Doyens, who have passed down their legacy for tens of thousands of years, all for the sake of the destined holder of the Scriptures....</p><br/><p>“Heaven and Earth are everlasting, the starry sky is boundless. I come from a distant place, and am not a cultivator of the Mountain and Sea Realm.... However, because a fragment of my obsession remained unquenched, I desired to borrow these skies to live....</p><br/><p>“My obsession then resided in the Mountain and Sea Realm, and I gained enlightenment of the Dao of Nine Seals. I encountered the Second Generation Demon Sealer, and was redeemed. I learned of the difference between what is correct and what is incorrect, and I became... the Third Generation Demon Sealer!</p><br/><p>“As a Demon Sealer, I eventually walked the path of a Paragon. I looked into the past to observe the First Generation, Nine Seals. I came to understand his Dao, and to know him as a person. Eventually I achieved my dream regarding the Daosource.... I pursued the Dao of reality, and walked the Aeon Span which covers all living things....</p><br/><p>“Here I leave some divine will, on the back of a sly devil, as a remembrance for the League of Demon Sealers…. The legacy that I shall pass on is not the Mountain and Sea Scripture, it is not an ordinary cultivation method, it is not Karma magic. I shall not bestow it upon some almighty expert, nor upon someone connected to me by destiny. I shall pass it on... to the League of Demon Sealers!</p><br/><p>“This has launched a new era, and fulfilled my ultimate desire.” When the undulating voice reached this point, everything began to tremble, and the magical symbols floating above the statue’s hands suddenly exploded with Heaven-shaking, Earth-shattering light.</p><br/><p>Meng Hao trembled as the words and the magical symbols caused his Demon Sealing Hexing magic to fluctuate thousands of times more powerfully than before. The magical symbols formed from the manifestation of the four great Hexing magics in his mind suddenly made him realize what the two magical symbols held by the statue were. They were... two great Hexing magics of the League of Demon Sealers!</p><br/><p>“One is the Hexing magic of the Second Generation Demon Sealer, the other is... the Hexing magic created by Lord Li, the Third Generation Demon Sealer!!” Meng Hao gasped as he came to understand the full meaning of the words spoken to him so long ago by the Demon Sealing Jade.</p><br/><p>“The First Generation is the Ancestor,” he murmured, “the Second Generation is the Inheritor, the Third Generation is the most powerful!” A tremor ran through him as he took a step toward the statue. However, even as he did, the magical symbol in Lord Li’s left hand flew out, radiating dazzling light as it then merged into the ground. [1. The line about the First, Second, and Third Generation Demon Sealers comes from chapter 490]</p><br/><p>At the same time, Heaven and Earth distorted. The black clouds roared, and the sky screamed. The lands quaked as numerous primordial beasts appeared up above, roaring as they flew toward Meng Hao. Everything in Heaven and Earth seemed to radiate a hostility targeted specifically toward Meng Hao.</p><br/><p>Meng Hao’s foot paused in mid-stride; as soon as he stopped, rumbling sounds filled the sky, and the land directly beneath his feet began to sink down. At the same time, the lands far away began to stretch up, as if Heaven and Earth were merging together to form a sphere, collapsing and closing in on itself!</p><br/><p>And Meng Hao was about to be crushed inside!</p><br/><p>RUUUUUUMMMMBLLLLE!</p><br/><p>The clouds collapsed, and the primordial beasts howled as they attempted to escape. And yet, many of those beasts were crushed to pieces, creating a rain of blood that fell down onto the ground. The Heavens above also began to distort as if to connect with the rising portions of the Earth. Everything was shrinking, and massive pressure weighed down. Meng Hao coughed up a mouthful of blood as he looked around, his eyes flashing.</p><br/><p>“Is this a test? Or is this how the legacy is passed on?” He looked around, but couldn’t immediately find any method of escaping this place.</p><br/><p>While all of that was happening, while Meng Hao was on Patriarch Reliance’s back attempting to gain the good fortune of the legacy, an incredible power was exploding out in the rift between the Seventh and Eighth Mountains and Seas, shattering the void and causing Essence power to lash about chaotically.</p><br/><p>All of that was happening because of Lord White!</p><br/><p>His face was grim and twisted with pain as he sat cross-legged within the void, healing himself. Occasionally he would growl as layered scales appeared all over his body, which would then disappear moments later.</p><br/><p>His aura was gradually growing stronger, and his injuries were healing rapidly. Every so often his eyes would open, and they would radiate with hatred and indescribable killing intent.</p><br/><p>“Another month, and then I’ll be completely healed. Next time I encounter him, he’s dead!</p><br/><p>“I know all his tricks now, so next time... he shall die!”</p><br/><p>Rumbling sounds echoed out as Lord White closed his eyes, covering up the killing intent. However, a murderous aura continued to radiate out, filling the entire area, causing an explosive windstorm to surge around him.</p><br/><p><strong>Chapter 1306: Third Generation Demon Sealer!</strong></p><br/>\n</div>"}