{"title": "Chapter 1311: Crushing!", "id": 1311, "volume": 14, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-1311-crushing", "volume_title": "Volume 14", "body": "<h1>Chapter 1311: Crushing!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 1311: Crushing!</strong></p><br/><p>Meng Hao emerged from the rift before Lord White by about ten breaths of time. Although the red-haired old man, his fellows, and the other cultivators from the Seventh Mountain and Sea off in the distance were all swept over by a wild blast of air as soon as he appeared, sending all of them tumbling backwards, they still didn’t immediately detect Meng Hao.</p><br/><p>“What’s happening?”</p><br/><p>“This... this....” The red-haired old man and his fellows had looks of shock on their faces as they were shoved backward. Rumbling could be heard coming from the rift itself. And then the rift... all of a sudden seemed to be on the verge of collapsing completely.</p><br/><p>Fissures spread out in all directions, and it began to break apart, causing widespread astonishment among everyone present.</p><br/><p>What happened next, though, virtually blew the minds of all the observing cultivators from the Seventh Mountain and Sea. Each and every one watched with their own eyes as their own Mountain and Sea Lord, Lord White... flew out of that collapsing rift.</p><br/><p>Before any of them could get excited, they gasped with disbelief. That was because it was very clear from their vantage point that Lord White... was not flying out of the rift on his own. Instead, he was struggling and shouting, and a look of fear and shock could be seen on his face.</p><br/><p>From the look of it... he was actually being dragged out by some huge, invisible hand!</p><br/><p>“This....” all of the cultivators of the Seventh Mountain and Sea looked on in utter shock.</p><br/><p>Lord White was roaring in anger, but deep inside he was flabbergasted. Even as he struggled, his voice rang out for all to hear.</p><br/><p>“Which Paragon is it? Paragon Sea Dream? It must be you!!”</p><br/><p>Even as Lord White blustered, a calm voice suddenly echoed out. “It’s not Paragon Sea Dream. It’s me!”</p><br/><p>Ripples spread out from the collapsing rift, and Meng Hao appeared for all to see.</p><br/><p>“Meng Hao!!”</p><br/><p>“I can’t believe it's him! This... he....”</p><br/><p>“He was only missing for a month. I can’t believe he’s even stronger than he was before!!” The red-haired old man and his fellows gasped in shock, and Lord White’s pupils constricted. He almost couldn't believe what he was seeing.</p><br/><p>“Impossible!” A tremor ran through Lord White. The huge hand that had just grabbed him had vanished, and he could now move again. Without even thinking about it, he backed up, looking at Meng Hao with complete disbelief.</p><br/><p>“Lord White, we meet again,” Meng Hao said with a slight smile, looking calmly at Lord White the entire time. “You were going too slow, and I didn't feel like waiting for you, so I decided to help you out a bit.”</p><br/><p>Although Meng Hao's words were spoken with a smile, they caused Lord White’s scalp to feel as if it were about to explode. An intense sensation of deadly crisis exploded up within him, the most intense feeling he had ever experienced in his entire life, and it was caused by none other than Meng Hao!</p><br/><p>Lord White still almost couldn't believe that the Meng Hao he had faced a month ago, who had caused him to feel fear, but not deadly crisis, was this same person. It was as if he had completely transformed. Lord White felt as if he were dreaming, as if the scene playing out in front of him was a hallucination.</p><br/><p>“Impossible....” It almost seemed as if the word ‘impossible’ was the only word he could say, over and over again. It went to show how completely shocked he was, how this scene was so unimaginable that it almost couldn’t happen even in a dream. How could Meng Hao have experienced such a terrifying increase in power?</p><br/><p>He would never be able to forget the despair and shock he had felt at having that huge hand grab him. That was the divine sense of a Paragon, which completely exceeded his own. He had previously assumed that the original plan had gone awry, and that Paragon Sea Dream had appeared. But now that he realized the sense of crisis was caused by Meng Hao, he truly wished that all of this could be nothing more than an illusion. In fact, he would rather Paragon Sea Dream be the one who had arrived.</p><br/><p>His confidence was now completely shattered, and all his preparations were now completely useless.</p><br/><p>Even worse was the fact that the rift behind him was collapsing, causing him to gasp. Now Meng Hao’s plan was obvious; considering that he was cutting off the path of retreat, he obviously planned... to cut Lord White down once and for all!</p><br/><p>That was why Meng Hao had entered the rift to begin with!</p><br/><p>By destroying that rift, he made it impossible for the Lord of the Seventh Mountain and Sea to retreat, trapping him in the Eighth Mountain and Sea. Even if he wanted to flee, there was nowhere to flee to! The graveyard-like Eighth Mountain and Sea would become his final resting place!</p><br/><p>Lord White began to shake, and the sensation of deadly crisis within him grew even more intense, until it felt like raging waves battering at his mind. Without even a moment of hesitation, Lord White transformed into a beam of white light that flashed toward the collapsing rift.</p><br/><p>Although entering a collapsing rift like that gave him only a 50/50 chance of surviving, as far as he was concerned, that was better than staying put!</p><br/><p>He could well predict that if he did not pick that 50/50 chance, then the only thing waiting for him was a 0/100 chance!</p><br/><p>RUMBLE!</p><br/><p>In the very moment in which Lord White fell back, Meng Hao snorted coldly and waved his hand. Heaven and Earth rumbled, and the starry sky trembled, as his divine sense spread out, crushing down onto Lord White.</p><br/><p>Lord White let out a miserable shriek, and blood spattered everywhere. Then, the rift behind him collapsed completely, cutting off even that 50/50 chance he had to survive!</p><br/><p>“Meng Hao, you push people too far!!” Lord White’s eyes were completely bloodshot as he spun around, threw his head back and roared. His hands flashed in a double-handed incantation gesture, causing an ancient scripture to materialize behind him.</p><br/><p>“The Mountains have three Daos, Man-Mountain, Earth-Mountain, Heaven-Mountain!!” Lord White held nothing back as he unleashed his divine ability, revealing how incredibly terrified he was at this moment.</p><br/><p>RUUUUUUMMMMBLLLLE....</p><br/><p>Three Heaven-shaking, Earth-shattering mountains appeared, which crushed toward Meng Hao, the Man-Mountain from the front, the Earth-Mountain from below, and the Heaven-Mountain from above. The power of those three mountains was enough to slay celestial beings and destroy gods!</p><br/><p>Rumbling could be heard as the three mountains smashed toward Meng Hao. Before he had extinguished five Soul Lamps, facing this magic had been very difficult, and he had been forced to rely on the Withering Flame Demon Magic True Self Dao to create a surrogate which had died in his stead.</p><br/><p>Right now, though, Meng Hao’s eyes were shining brightly, and his expression was very calm. The wave of a finger caused the Man-Mountain to shudder and then collapse into pieces. Without stopping, Meng Hao waved his finger down, and then up.</p><br/><p>It was as if he could buttress all creation, as if... in all Heaven and Earth, he was the most respected of all beings!</p><br/><p>RUUUUUUMMMMBLLLLE....</p><br/><p>The Earth-Mountain shattered, and the Heaven-Mountain collapsed. The starry sky shuddered as rubble blasted out in all directions. Blood sprayed out of Lord White’s mouth, and an expression of terror and madness appeared on his face.</p><br/><p>“You’re no match for me anymore.” Meng Hao said coolly, speeding toward Lord White. As he did, the pressure of the starry sky began to weigh down, as if the power of the Mountains and Seas itself was Meng Hao’s aura. Everything shook, and Lord White fell back, blood spraying out of his mouth.</p><br/><p>-----</p><br/><p><strong>Note from Er Gen:</strong> The past four chapters have 11,000 Chinese characters!</p><br/><p><strong>Note from Deathblade:</strong> This is an unusually short chapter, coming in at only about 1300 words. The reason is that the past four chapters were all posted in a single day by Er Gen in a drive for monthly vote tickets. As you can see from the above comment, those four chapters came in at a total of 11,000 Chinese characters. Usually chapters are 3,000 Chinese characters, so he came very close to completing 4 full chapters, but fell a bit short on the last one of the day.</p><br/>\n</div>"}