{"title": "Chapter 1329: Breakthrough!", "id": 1329, "volume": 14, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-1329-breakthrough", "volume_title": "Volume 14", "body": "<h1>Chapter 1329: Breakthrough!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 1329: Breakthrough!</strong></p><br/><p>From such an incredibly high position, Meng Hao could now look down and see the Outsiders. There were three 5-Essences experts among them, surrounded by hosts of other Outsiders. Furthermore, they were not milling about chaotically, but rather, had gathered in three specific areas.</p><br/><p>By chance, those three areas happened to be locations on the head of the God, where the stars existed!</p><br/><p>Meng Hao spotted Yuwen Jian in another part of the Vale of the Godgrave, trudging along toward a lightning-filled area, where something like a corpse could be seen.</p><br/><p>That corpse was profoundly ancient, and if one looked closely enough, one would see that it was actually... the finger of a God!</p><br/><p>Perhaps that was the location of Yuwen Jian’s good fortune.</p><br/><p>Meng Hao looked away from all of that for a moment. Everything he had seen in this dimension left him profoundly shaken.</p><br/><p>This world, this Vale of the Godgrave, was actually a head! The head of a God!</p><br/><p>Despite only being the head, Meng Hao could tell that it was even larger than the corpse he had encountered back in the Ruins of Immortality in the Ninth Mountain and Sea. That in and of itself left Meng Hao deeply shaken.</p><br/><p>“This... is one of the Outsider... Gods?” His eyes shone with a strange light as he looked down at the enormous land mass which was formed by the head. All of a sudden, he saw images in his mind, a vision of these so-called Gods, seemingly as tall as the Heavens, whose enormous bodies were virtually impossible to fight back against!</p><br/><p>In their hands, planets could be crushed to pieces, and the mere brush of their fingers could wipe cultivators out of existence!</p><br/><p>Such unequalled power was completely shocking to Meng Hao, causing the thought of doing battle with beings like this in the future to become even more agonizing than before. At the same time, he refused to be cowed so easily, and felt his heart surging.</p><br/><p>“Who cares about these Gods?!</p><br/><p>“They can still perish, which means that winning the war against them is still possible. They aren’t invincible!” Meng Hao’s eyes flickered brightly, and his energy rose up, creating a vortex around him which swept out through Heaven and Earth.</p><br/><p>“If I can absorb the power of the God’s blood right here and now, then I can achieve a fleshly body breakthrough. I can rise from the peak of the Ancient Realm into the Dao Realm!” Back when he had completely extinguished all five Soul Lamps, the qi and blood which he had built up became stuck in a fleshly body bottleneck, making a breakthrough impossible.</p><br/><p>However, once he did achieve a breakthrough, that power would explode out and push him explosively into the Dao Realm.</p><br/><p>Meng Hao had been waiting for a long time for this day to arrive. He took a deep breath, and without any further hesitation, made a beeline for the enormous God’s forehead, toward the first star thereupon.</p><br/><p>In that location, a huge lake could be seen!</p><br/><p>Meng Hao flew like a meteor, causing rumbling sounds to echo out, distorting Heaven and Earth as he passed along. Wind screamed and thunder crashed. Nothing, be it illusory or corporeal, could do anything to hinder his progress.</p><br/><p>He pierced through every obstacle, and a brief moment later, he was in the air above the vast lake. Not pausing for a moment, he shot down into the lake itself.</p><br/><p>Almost as soon as he entered the water, a massive rumbling sound could be heard. The surrounding land shook violently, and the mountains vibrated as all the lake water shot up into the air, forming something like a column that rose high up into the air and then dispersed into a mist.</p><br/><p>Now a crater could be seen down below, deep and filled with faint, flickering light. However, that light was profoundly ancient, and contained an indescribable power of qi and blood.</p><br/><p>A strange gleam shone in Meng Hao’s eyes as he shot down toward the center of the crater and then sat down crosslegged. Then he stretched his hands out to either side and slapped them down onto the ground.</p><br/><p>RUMBLE!</p><br/><p>The ground quaked violently, and the sludge at the bottom of the lake vibrated for a moment before transforming into ash. Numerous crevices appeared in the land, most noticeably beneath Meng Hao. In the center of that crevice could be seen the light of... an enormous... star!!</p><br/><p>That star actually spread out to cover the entire area of the lake, and emanated an incredibly ancient aura which began to speed toward Meng Hao. His hair whipped around him, and his clothing flapped wildly. At the same time, a bright light appeared in his eyes as he experienced the sensation of his fleshly body power rising rapidly.</p><br/><p>“So it really has been here all along!” Meng Hao lifted his hand up and then chopped it down into the ground. The power of his cultivation base exploded out as he shot, spear-like, down toward the star.</p><br/><p>As the ground trembled, Meng Hao frowned and then snorted coldly. The parrot flew out, transforming into the Battle Weapon, which he stabbed down. As he did, the Battle Weapon extended, piercing further down into the earth.</p><br/><p>The ground was shaking with unprecedented intensity, as if a soundless roar were echoing out through Heaven and Earth. After Meng Hao pulled the Battle Weapon back up and emerged out of the soil, a drop of golden blood rose up through the gap to float in front of him.</p><br/><p>As the blood drop rose up, the land sank and withered, as if it had lost some of its life force. As for the star, it seemed to grow dim.</p><br/><p>Meng Hao looked at the golden drop of blood and took a deep breath. Then, without any hesitation, he reached out, grabbed it... and shoved it into his forehead.</p><br/><p>RUMBLE!</p><br/><p>As soon as the golden blood touched Meng Hao, it coursed into him, filling him with sounds like rumbling thunder. His expression twisted, and he began to tremble as his body experienced Heaven-shaking, Earth-shattering transformations.</p><br/><p>His heart rate increased dramatically, and his blood pumped rapidly through his system. Even his bones emitted cracking sounds. It was as if he were being reborn, as if his flesh and blood were twisting around each other to pump out more power.</p><br/><p>Amidst echoing rumbles, Meng Hao threw his head back and let out an astonishing howl. At the same time, his body grew, and his qi and blood surged. The land around him trembled, and far off in the distance, both Yuwen Jian and the Outsiders could sense a shocking aura which stirred their souls, coming from the direction of Meng Hao.</p><br/><p>“This... is the feeling I was going for....” Meng Hao’s eyes were bright red, and a vicious expression could be seen twisting his face. However, a gleam of excitement was visible in his eyes as he felt the level of this fleshly body increasing, and sensed the indications of an imminent breakthrough.</p><br/><p>His bones were transforming, becoming stronger and more resilient!</p><br/><p>His flesh and blood were experiencing constant advancement, and a terrifying level of power was surging through him. It was a mad power that could destroy vast swaths of land; every beat of his heart sounded like the crash of thunder.</p><br/><p>“Still need some more....” By this point, he had grown to nearly thirty meters tall, making him look like a mountain. Every inch of his flesh exuded a terrifying power.</p><br/><p>There were even magical symbols which bulged out all over his skin, radiating an ancient air as his body’s energy rocketed up.</p><br/><p>A strange light gleamed in his eyes as he suddenly used the tiniest scrap of cultivation base power, not to teleport, but to leap up into the air. The ground beneath his feet shattered and collapsed in on itself as Meng Hao shot like lightning toward the location of the second star.</p><br/><p>It only took a moment for him to bear down on what was a convergence of masses of Outsiders, who were arranged in formation around a violet-horned 5-Essences Outsider.</p><br/><p>The second star was actually located in a vast plain. The Outsiders had obviously been here for some time, and had excavated a huge pit, at the bottom of which the violet-horned Outsider sat cross-legged, absorbing the thin strands of blood-colored qi that were seeping up from the dirt.</p><br/><p>As he absorbed the blood-colored qi, he slowly became more powerful, and an aura similar to Meng Hao’s was even beginning to build up within him.</p><br/><p>It was at this point that rumbling sounds filled Heaven and Earth, and a blur shot through the air at an indescribable speed, heading directly toward the pit in the middle of the plain.</p><br/><p>It was none other than Meng Hao!</p><br/><p>When he landed, the ground shattered, and countless shocked Outsiders were hit by a powerful shockwave.</p><br/><p>Rumbling sounds rose up, along with miserable shrieks, as the shock wave swept over the Outsiders, instantly reducing over a thousand of them into ash.</p><br/><p>Further out, the Outsiders who were able to avoid the brunt of the blast coughed up blood, having sustained serious injuries. Some were even sucked down into the collapsing ground.</p><br/><p>Meng Hao’s expression was tranquil. Intense pressure radiated off of his thirty-meter frame as he completely ignored the dying Outsiders around him. A red glow could be seen in his eyes as he turned his head to look at the violet-horned Outsider sitting off to the side.</p><br/><p>Even as he turned his head, the Outsider’s eyes opened, and without a moment of hesitation, he ceased absorbing the blood-colored qi and shot backward in retreat.</p><br/><p>“Think you can just leave?” Meng Hao said with a cold laugh. In the moment that the violet-horned Outsider fell back, Meng Hao suddenly shot forward at incredible speed. In the blink of an eye, he was in front of the Outsider, who suddenly found Meng Hao’s hand gripping his neck.</p><br/><p>Even as the Outsider bellowed in rage, the power of Meng Hao’s cultivation base and fleshly body exploded out through his hand. The Outsider tried to fight back, but his resistance was like a rotting weed against Meng Hao's blow. Meng Hao disregarded it completely, and clenched down with his hand.</p><br/><p>The Outsider didn’t even have a chance to speak.</p><br/><p>A boom could be heard, and the violet-horned Outsider’s eyes bulged. Then, his entire body exploded, and all of the blood-colored qi which he had absorbed spread out, then bored into Meng Hao.</p><br/><p>Meng Hao lifted his right foot up into the air and then stamped it down. A boom echoed out as the land shattered, and a drop of golden blood flew up. He quickly grabbed it and pushed it into his forehead.</p><br/><p>This was his second drop of God blood, and it was not ordinary God blood, but rather, soul blood!</p><br/><p>As it was absorbed into Meng Hao, he threw his head back and roared. His entire body, including his bones, his flesh and blood, and his internal organs, vibrated violently. At this moment, his Ancient Realm fleshly body... broke through!</p><br/><p>Intense reverberations echoed out that could shake Heaven and Earth. Meng Hao’s fleshly body power skyrocketed to such an extent that traces of numerous natural laws became visible around him.</p><br/><p>They were spreading out from his body, and they directly affected the world around him.</p><br/><p>“So, this is a Dao Realm fleshly body?” he said, eyes glittering. He took a deep breath as his body grew once more, this time to 300 meters!</p><br/>\n</div>"}