{"title": "Chapter 1323: War Requires Spirit!", "id": 1323, "volume": 14, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-1323-war-requires-spirit", "volume_title": "Volume 14", "body": "<h1>Chapter 1323: War Requires Spirit!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 1323: War Requires Spirit!</strong></p><br/><p>Of the four planets which orbited the Seventh Mountain, three were destroyed, and had become nothing more than fields of swirling rubble and dust hanging in the starry sky</p><br/><p>The only remaining planet was the one known as Tiger Cage. [1. I’m sure some of you will remember Planet Tiger Cage. It has been mentioned three times in the story, in chapters 301, 322, and 979]</p><br/><p>Currently, Yuwen Jian and the tens of thousands of cultivators who were the broken remnants of the forces of the Seventh Mountain and Sea were there on Planet Tiger Cage, fighting a deadly battle with the Outsiders.</p><br/><p>The fighting was bloody and bitter, and occasionally the booms of self-detonation rang out. Sky and land were both as red as blood, and the vicious and maddened Outsiders were fueling divine abilities with their own life force, causing black seas of flame to scorch everything in their paths.</p><br/><p>Massive fissures were spreading out across the surface of the planet, and the cities and life forms there were all trembling. To them, it was as if the end of days had come.</p><br/><p>Even the sky seemed to be on the verge of collapsing, and as the cultivators and the Outsiders fought, the only thing they seemed to have in common was that they were all engaged in a life-or-death struggle!</p><br/><p>Yuwen Jian was actually not the strongest cultivator among the tens of thousands of survivors. However, because of his status as an Echelon cultivator, his words carried much weight, and he was currently leading a large group of cultivators into battle.</p><br/><p>He was soaked in gore, to the point where it almost seemed like he was clothed in blood itself. His skin was crisscrossed with wounds, and his eyes were completely bloodshot. He looked completely and utterly fearsome.</p><br/><p>However, beneath that fearsomeness lurked sadness and despair.</p><br/><p>“Live for the Mountains and Seas, die for the Mountains and Seas!!” Yuwen Jian threw his head back and laughed, and in response, the cultivators at his back let out mighty roars. Murderous auras sprang up; they might be fighting a losing battle, but they would still kill as many Outsiders as they could.</p><br/><p>There was no path of escape.... In the Seventh Mountain and Sea, all the areas which formerly pledged allegiance to Lord White had already fallen into enemy hands. The cultivators had watched as three of their planets were destroyed, and countless lives were sacrificed. The Seventh Mountain and Sea was relentlessly taken over by the Outsiders, and the local cultivators could do nothing but fume in rage.</p><br/><p>Now, the only reason they had left to live was to fight. Even if they only had one breath left to breathe, they would use it to kill one more Outsider!</p><br/><p>A boom rang out, and Yuwen Jian coughed up a mouthful of blood. He was facing a coldly sneering Dao Realm Outsider, who bore down on him as fast as lightning. The Outsider's right hand flashed with an incantation gesture, and black flames spread out to form a huge mouth which shot out to consume Yuwen Jian.</p><br/><p>Yuwen Jian laughed bitterly. When he had faced Dao Realm Outsiders before, there had always been Dao Realm experts of the Seventh Mountain and Sea to lock them down. But now, all of those Dao Realm experts were either dead or seriously injured. Yuwen Jian was staring extermination in the face! His eyes flickered with madness as he glared at the Dao Realm Outsider and prepared to self-detonate.</p><br/><p>The other cultivators under his command also stared with bloodshot eyes and prepared to follow him in self-detonation. The self-detonation of a single cultivator wouldn’t do anything to a Dao Realm expert, but if ten of them detonated, or a hundred, or a thousand, it would be a different story!</p><br/><p>The massive accumulation of force in such an explosion was power that would shock even a Dao Realm expert.</p><br/><p>The Outsider’s eyes widened, and he frowned. Just when he was about to take defensive measures, a Heaven-shaking, Earth-shattering divine sense suddenly exploded out.</p><br/><p>It was a divine sense bursting with killing intent, hatred, and madness, and as it erupted out across the battlefield, the Dao Realm Outsider’s eyes went wide, and he shouted in alarm.</p><br/><p>“Dao--” All he could utter was a single word before his head exploded and his body shattered. In almost the same instant, numerous other Outsiders on the battlefield screamed miserably, expressions those of terror as they subsequently exploded.</p><br/><p>From far up above in the starry sky, the battlefield almost looked like a field of blooming flowers of blood....</p><br/><p>The surviving Outsiders were shocked and terrified. They immediately tried to escape the planet, leaving the cultivators of the Seventh Mountain and Sea standing there in shock. However, their hatred could not be diminished, and they immediately attacked the fleeing Outsiders.</p><br/><p>Yuwen Jian was trembling, but had no time to think, and immediately joined in the slaughter.</p><br/><p>It was at this point that a new figure appeared on the battlefield. It was Meng Hao, who had just teleported in. Immediately, he extended his right hand and made a vicious clawing motion.</p><br/><p>The power of the Mountains and Seas erupted out. Although it wasn’t a vast amount of the power, not even enough to fight Dao Sovereign experts, any of the Outsiders under that Realm would be crushed as easily as dried twigs!</p><br/><p>Rumbling sounds echoed out as an enormous illusory hand appeared in the starry sky. Boundless ripples emanated from the majestic hand as it clawed down toward the Outsiders.</p><br/><p>The starry sky trembled, and numerous rifts were slashed open. In the blink of an eye, the area in the starry sky occupied by the Outsiders was completely crushed!</p><br/><p>RUMBLE!</p><br/><p>Miserable screams and roars of rage alike were suddenly cut off. A moment later, the huge hand vanished, and all that remained was drifting ash.</p><br/><p>The battlefield went silent, and the cultivators from the Seventh Mountain and Sea looked around, stunned. Yuwen Jian turned his head, and through the crowds he spotted Meng Hao.</p><br/><p>“Meng Hao....” he said, a smile breaking out on his face. Unfortunately, it was a smile that was bitter and even hollow.</p><br/><p>Even though more than 10,000 Outsiders had just been killed, no cries of joy rang out, and no excitement could be seen. The cultivators of the Seventh Mountain and Sea simply stood there quietly.</p><br/><p>When they turned to face Meng Hao, there almost didn’t seem to be any life in their eyes, as if their souls were already dead.</p><br/><p>They well knew that the number of Outsiders currently in the Seventh Mountain and Sea was completely incalculable. Despite having won a victory in this battle, the next battle... would likely result in the complete extermination of the Seventh Mountain and Sea.</p><br/><p>They silently clasped hands and bowed to Meng Hao, then began to disperse to carry their fallen comrades away, and to expunge the area of the sordid blood of the Outsiders.</p><br/><p>Everything was as still as death....</p><br/><p>As Meng Hao looked around at the listless cultivators, he felt as if his heart were being stabbed.</p><br/><p>Yuwen Jian grimaced from the pain of his injuries as he approached Meng Hao. Then he looked around at all his comrades, and bitterly commented, “They’re like this because we have no hope. Meng Hao, do you really think that we can... win this war?”</p><br/><p>He seemed confused, and from the way he asked the question, it almost seemed as if he were inwardly searching for some way to pull himself together and rise to the situation. Even if whatever he found was a false hope....</p><br/><p>Meng Hao had seen war before, but he had never experienced anything like he had just now. His heart hurt, but he was infinitely moved. He looked around at the tens of thousands of cultivators of the Seventh Mountain and Sea, and he saw how exhausted they were. He saw how despair had taken hold in the depths of their hearts, and he saw how much they hated the Outsiders.</p><br/><p>He suddenly felt the urge to speak. Although he wasn’t sure what he should say, it was as if there were a voice deep inside of him desperate to cry out, to rally the people around him.</p><br/><p>“Fellow Daoists of the Mountains and Seas! I am Meng Hao, Echelon cultivator from the Ninth Mountain and Sea!</p><br/><p>“I don’t know for sure whether or not we’ll win this war. But what I do know is that as we speak, Paragon Sea Dream is fighting the Outsider Paragon, right up there!” As he spoke, his voice began to grow impassioned, and he pointed up toward the heights of the starry sky.</p><br/><p>“I also know that the Lord of the Fourth Mountain and Sea, Ksitigarbha, is fighting the Outsider Imperial Lord!</p><br/><p>“All of the other Mountain and Sea Lords are fighting with incarnations of an Outsider Dao Sovereign. Furthermore, just moments ago, I managed to trap their other Dao Sovereign in the 33 Hells. If he doesn’t die there, then at the least, he’ll be unable to emerge for some time!</p><br/><p>“Another thing I know is that as of this moment, I, Meng Hao, am the only cultivator who can fight at the Dao Sovereign level that is currently not fighting!</p><br/><p>“I don’t know whether or not we can secure victory in this war. But... the Mountain and Sea Realm will not be overthrown easily!</p><br/><p>“We are the descendants of the Paragon Immortal Realm, and we have lasted all the way down to this day. We are the Mountain and Sea Realm, and the war has only just begun. How could we possibly lose hope now?!?!”</p><br/><p>Even as Meng Hao looked out at the cultivators of the Seventh Mountain and Sea, his heart bursting with powerful exhortations, a fierce fight was raging above Planet South Heaven in the Ninth Mountain and Sea. The Li Clan spell formation covered the entire planet, ensuring that any Outsiders who approached were destroyed before they could set foot on Planet South Heaven.</p><br/><p>The sky rained with the blood of the Outsiders. Of course, that blood was filthy to the point that it could harm cultivators, and even devastate the earth. Therefore, it was not allowed to touch down onto the ground, but was dissipated into a mist before the very eyes of the cultivators of Planet South Heaven.</p><br/><p>Standing atop a distant mountain was Shui Dongliu, who was staring up into the sky, a perpetual look of sorrow in his eyes.</p><br/><p>At some point, an ancient ship had come to appear off to the side, floating there in the air. It was a ship that no one could see, almost as if... it didn't exist.</p><br/><p>An old man sat cross-legged at the prow of the boat with his back to the world, as if he had forsaken all Heaven and Earth.</p><br/><p>If Meng Hao were here, he would instantly recognize this ship and this old man. He had boarded this same ship back when the 10th Wang Clan Patriarch had stolen his Dao foundation, leaving him on the brink of death.</p><br/><p>The ship had taken him on a dream-like voyage through the Mountain and Sea Realm, a voyage which had opened Meng Hao’s eyes to the wider world. [1. Meng Hao’s time on the ship with the old man occurred starting in around chapter 683. I didn’t realize it early on in ISSTH, but it seems likely that this old man on the boat is a character from Er Gen’s other novel Beseech the Devil, a guy whose name is something along the lines of Old Man Extermination. Please note, I said \"likely\" because it's only my speculation, I didn't even check on the Chinese internet.]</p><br/><p>Whether it had been intentional or not, the old man on the ship had healed Meng Hao’s injuries, and given him a bit of life force that had enabled him to keep living for a time.</p><br/><p>Right now, that very same ship was floating in midair in front of Shui Dongliu.</p><br/><p>Shui Dongliu stood there at the peak of the mountain, and the old man on the boat sat there with his back turned to the world. Although their eyes had not made contact, it clearly seemed as if they were looking at each other.</p><br/><p>Suddenly, an ancient voice could be heard as the old man on the ship spoke. “Is all this necessary...? Your hope has always been doomed to fail.”</p><br/><p>This was apparently the first time this man had ever truly spoken, and his voice seemed to echo out from the depths of time itself. As he spoke, the ship upon which he sat seemed even more illusory than before.</p><br/><p>Shui Dongliu didn't respond. Instead, he continued to stare off into the distance.</p><br/><p>After a long moment passed, the old man on the ship sighed. Then he and the ship slowly faded away.</p><br/><p>In almost the same moment that the ship and the old man vanished, Shui Dongliu suddenly turned his head. Someone was approaching him silently from behind, a young man in a black robe. His expression was calm, and his features extraordinary, but he had an astonishing murderous aura roiling off of him. He was none other... that the person who had taught Meng Hao the time-walking technique.... Slaughter! [2. Previous times Slaughter appeared include chapters 1122, 1142, and 1205]</p><br/><p>He looked coldly at Shui Dongliu, and killing intent flashed through his eyes.</p><br/><p>“I pondered the matter for some time.... I should have dispersed, so why was I brought back? It wasn’t until seeing you that I understood.</p><br/><p>“One time. I’ll help you... only one time!” With that, Slaughter looked deeply at Shui Dongliu, then vanished into thin air.</p><br/><p>Shui Dongliu stood there thoughtfully. The entire time, he hadn’t spoken a single word. Soon, the sun set, night fell, and the moon shone, casting a long shadow behind him.</p><br/><p>“Deliver the people, lose the world,” he murmured softly. “Lose the people, deliver the world.... The choice has long since been made.” A strange, anticipatory light slowly began to gleam in his eyes.</p><br/><p>“The Mountain and Sea Realm is at war, and now the spirit of the people must rise!”</p><br/>\n</div>"}