{"title": "Chapter 1325: Meng Haos Heart....", "id": 1325, "volume": 14, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-1325-meng-haos-heart", "volume_title": "Volume 14", "body": "<h1>Chapter 1325: Meng Haos Heart....</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 1325: Meng Hao’s Heart....</strong></p><br/><p>Meng Hao was quite shaken. Even after leaving Planet South Heaven and traversing the Mountain and Sea Realm, he had never forgotten the kindness Choumen Tai had shown in blessing him with good fortune, nor the agreement they reached regarding Planet Tiger Cage.</p><br/><p>He had always planned to return Choumen Tai’s legacy to Planet Tiger Cage. However, he could never have imagined that the so-called legacy was actually a sham. It had all been a ruse.</p><br/><p>Meng Hao hovered there silently. He could accept being swindled, but he couldn’t accept the existence of a spell formation like this, not if there was even a chance that it could harm the Mountain and Sea Realm. He was responsible for the Mountains and Seas, and had already borne witness to the tragedy of war. Furthermore, that warfare had already changed him.</p><br/><p>He had grown up.</p><br/><p>Therefore, his first reaction upon seeing this spell formation was not to be concerned about the Karma he would sow if he broke his oath and destroyed it.</p><br/><p>However... at the same time, Choumen Tai's words had moved him. In fact, his mind was spinning, and his eyes glowed with bright light.</p><br/><p>“I, Choumen Tai, swear an oath upon my soul that if anything I have said is untrue, then... no matter if I live or die, I will never again see my master!” The madness in Choumen Tai’s voice was growing, and the sincerity of his determination made his pleas seem even more intense.</p><br/><p>In fact, as he spoke, Meng Hao could sense the vague fluctuations of a powerful oath, and could also detect Karma building up within the mountain peak and the spell formation.</p><br/><p>All of that indicated that the words spoken by Choumen Tai were true.</p><br/><p>Meng Hao said nothing at first. He was not a cold and ruthless person, and Choumen Tai had bestowed good fortune upon him in the past. If he could choose, he would rather not destroy the man’s hope. Furthermore, he had sworn an oath upon his soul.</p><br/><p>“How is it that you can do such a thing?” Meng Hao asked.</p><br/><p>“It doesn’t matter how I can do it,” replied Choumen Tai. “Just point out a 7-Essences Paragon, and I’ll take care of the rest!” From the sound of his voice, Choumen Tai seemed to be throwing caution to the wind. A Heaven-defying technique like that would surely come at a heavy price, a price too difficult to even comprehend.</p><br/><p>“Whenever or wherever you are, as long as I still live, all you have to do is catalyze this sealing mark... and you can perform the sealing!” A mysteriously-glowing magical symbol floated out from within the mountain to hover in front of Meng Hao.</p><br/><p>The symbol flickered and danced, and constant fluctuations rippled about inside of it. It was actually impossible to see clearly, and numerous transformations existed within it. Meng Hao eyed the magical symbol for a moment, and then his eyes flickered with determination. He waved his sleeve, gathering up the magical symbol and then looking at the mountain for a long moment before turning to leave.</p><br/><p>Meng Hao could now tell that the reason why Planet Tiger Cage still remained intact within the Seventh Mountain and Sea, the reason why it had not been destroyed, was not because of Yuwen Jian and the other cultivators with him. More importantly... it was because of the spell formation inside this mountain, and the remaining power of Choumen Tai, which protected the entire planet.</p><br/><p>Because of that power of protection, even though the surface of the planet was riddled with cracks and crevices, it still remained in one piece, as the spell formation protected both the mountain and the planet.</p><br/><p>Meng Hao took a step, and was already far off in the distance. “Just what sort of entity could inspire one of its servants to be so devoted, to become completely obsessed with resurrecting it...?”</p><br/><p>Even as he left, a blurry figure appeared within the middle of the spell formation. It was Choumen Tai, and he seemed to be fading away. He was staring into the spell formation itself, trembling, eyes filled with anticipation and reminiscence.</p><br/><p>“For the sake of others, you closed your eyes for all eternity....” he murmured. “After I returned, I could never find you....” Choumen Tai’s voice seemed to be filled with grief as he slowly sat down in the spell formation.</p><br/><p>“Please return... my master....”</p><br/><p>As Meng Hao made his way off into the distance, he found that the meat jelly had emerged from his bag of holding at some point. It was perched on his shoulder, looking back at the mountain. Then the parrot flew out, landed on his other shoulder, and also looked back.</p><br/><p>It was a rare occasion when these two living treasures weren’t making a ruckus.</p><br/><p>The meat jelly sighed and said, “Perhaps to that entity, Choumen Tai eventually ceased to be simply a servant. Meng Hao, do you think that one day, if you meet your end, I’ll be like Choumen Tai, and do everything I can to try to resurrect you? Ai. That is a question very worthy of consideration.... Fifth Bro, what do you think?”</p><br/><p>Meng Hao stopped in place. The meat jelly’s words just now were definitely the type to make one feel touched, but to hear them coming out of the meat jelly’s mouth was quite strange.</p><br/><p>“Lord Fifth was actually pondering a different question…. If Lord Fifth ever meets his end, Meng Hao... would you feel sad? Would you try to resurrect me?” The parrot looked over at Meng Hao, its expression very serious.</p><br/><p>“Yes!” Meng Hao replied softly. The parrot and meat jelly had followed him for so long that in his heart, he no longer viewed them as simple servants.</p><br/><p>“Well, Lord Fifth won’t die and can’t be killed, so you’ll never have that chance. Hahaha!” The parrot laughed heartily, but as it laughed, a trace of sorrow and grief could be seen in its eyes. However, it quickly passed, and the parrot quickly reverted to its usual simple-minded state.</p><br/><p>Meng Hao didn’t say anything further. A knot had taken root in his heart... an uncomfortable notion that he didn’t dare to contemplate or ponder. The reason being that he wasn't sure which side to pick.</p><br/><p>He had an inkling of the Karmic cause of the war of the Mountain and Sea Realm, that it was actually being fought because of... the copper mirror!</p><br/><p>If he simply handed the copper mirror over... could the war be ended?</p><br/><p>It was a question Meng Hao didn’t dare to consider. His family lived in the Mountain and Sea Realm, as did his friends, his Masters, and all other living things.... But on the other hand, the copper mirror had been with him from his earliest days in the Reliance Sect. It had accompanied him and allowed him to grow from being a mere scholar to his current pinnacle.</p><br/><p>As for the parrot, although Meng Hao pretended to not care very much about it, the truth was that after all these years, he had become very attached to it, and could never bear to part with it.</p><br/><p>“Do I forsake the parrot,” he thought, “or forsake the Mountain and Sea Realm...? Perhaps the only choice I can make... is to forsake myself.”</p><br/><p>Meng Hao sighed inwardly. This was the question he didn't wish to ponder, because he knew that one day, he would be forced to make that decision. Who knew what cruel realities he would need to face when the time came to choose?</p><br/><p>“I have to get stronger!” he thought, his eyes glowing brightly. He took a deep breath as he forced himself to stop thinking about that painful question. Then, he transformed into a beam of light that shot off into the distance.</p><br/><p>The meat jelly sat silently on his shoulder, and although the parrot seemed completely oblivious to anything, it was uncharacteristically quiet as it transformed into a multi-colored streak that flew into the copper mirror in Meng Hao's bag of holding.</p><br/><p>Meng Hao continued along quietly, sighing the entire time as he contemplated the enigma that was fate. As of this moment, he was consumed with worry for his family and a deep yearning to reunite with Xu Qing.</p><br/><p>Eventually, he made his way back to Yuwen Jian, who was sitting there cross-legged waiting for him. Instead of wasting time with words, Meng Hao simply looked at him and uttered a single sentence.</p><br/><p>“Take me... to the place you mentioned, the Vale of the Godgrave!”</p><br/><p>Yuwen Jian’s eyes shone with a bright light. Taking a deep breath, he nodded and rose to his feet. Meng Hao flicked his sleeve, and the two of them transformed into bright beams of light that shot off into the starry sky at top speed.</p><br/><p>Normally speaking, Yuwen Jian would never be able to keep up with Meng Hao, so Meng Hao lent him some energy, and they proceeded along to the location Yuwen Jian indicated.</p><br/><p>“I need to get stronger, that way I can slaughter my own path out of the enigma of fate!” There was something murderously bleak about Meng Hao now. His previous air of youth and naivete had been wiped away, and the only thing that remained was the grief and pain that came from seeing tragedy play out in the Mountain and Sea Realm.</p><br/><p>The Seventh Mountain and Sea was now almost completely in the hands of the Outsiders, who continued to pour in, filling the starry sky with their pitch black cubes. Increasing pressure radiated out in all directions.</p><br/><p>Soon, Meng Hao and Yuwen Jian appeared in the southeastern part of the Seventh Mountain and Sea, in a location that was very quiet. Off in the distance was an area full of hundreds of black cubes. They floated about in the starry sky, lightning dancing across their surfaces. It was just possible to see the images of Outsiders passing into and out of the cubes.</p><br/><p>They almost seemed to be forming a spell formation....</p><br/><p>“The Vale of the Godgrave is up ahead,” said Yuwen Jian. “It’s a spatial rift within which rest the ruins of an ancient battlefield. Countless strands of divine will exist inside, which can kill you before you even notice them….</p><br/><p>“The Vale of the Godgrave is one of the most dangerous places in the entire Seventh Mountain and Sea. The last time I went in, I only managed to travel a short distance. By chance, though, I managed to get a drop of impure God blood. Even that was enough to instigate an incredible breakthrough in my fleshly body!”</p><br/><p>Yuwen Jian was under the protection of Meng Hao’s divine sense. As they hovered there in the starry sky, no one other than perhaps a peak 6-Essences Dao Sovereign or a 7-Essences Paragon would be able to detect their presence. “After the 1st Heaven descended, this was the very first place to be occupied by the Outsiders!</p><br/><p>“I suspect that quite a few of the Outsiders have already gone inside. Presumably they are also interested in getting God blood....”</p><br/><p>Meng Hao looked calmly off into the distance. He could sense the fluctuations of powerful experts coming from many of the black cubes. Furthermore, the spell formation formed by the cubes contained shocking power in and of itself.</p><br/><p>The area surrounding the Vale of the Godgrave was completely filled with Outsiders. Although there were no 6-Essences experts there, there were definitely 5-Essence experts. Meng Hao had already identified four with his divine sense.</p><br/><p>And that didn't count any Outsiders who had entered the Vale of the Godgrave, which was beyond the scope of what Meng Hao could survey with divine sense.</p><br/><p>Meng Hao turned to look at Yuwen Jian and said, “Brother Yuwen, this place is clearly very dangerous. I think you should wait for me here....”</p><br/><p>Yuwen Jian hesitated for a moment before determination gleamed in his eyes and he shook his head.</p><br/><p>“The 33 Heavens aren’t even sparing the mortals in this war. Clearly, they plan to wipe us all out.... They want to exterminate the bloodlines of all living beings in the Mountain and Sea Realm.</p><br/><p>“As the saying goes, if the nest is overturned, none of the eggs survive!” Yuwen Jian clenched his hands into fists. “I need to get stronger! I need to have a cultivation base breakthrough! I have a body refinement magic which can use God blood to sacrifice some life force in exchange for a hundred years of a Dao Realm fleshly body!</p><br/><p>“I, Yuwen Jian, am an Echelon cultivator. Even if I can only live for a hundred years after stepping into the Dao, I have to live up to my place in the Echelon!” Yuwen Jian’s eyes shone brightly, and his pupils seemed to flicker with flames.</p><br/>\n</div>"}