{"title": "Chapter 1322: Arriving in the Seventh Mountain!", "id": 1322, "volume": 14, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-1322-arriving-in-the-seventh-mountain", "volume_title": "Volume 14", "body": "<h1>Chapter 1322: Arriving in the Seventh Mountain!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 1322: Arriving in the Seventh Mountain!</strong></p><br/><p>“He calls himself... Shui Dongliu,” Grandpa Meng said slowly.</p><br/><p>As soon as Meng Hao heard that name, his jaw dropped, and his eyes filled with a strange gleam. He stood there quietly for a moment as numerous connections were made in his mind. All of a sudden things seemed much clearer. He nodded.</p><br/><p>“Grandpa, I sent Grandma and the Meng Clan ancestral mansion to the Ninth Mountain and Sea. Unfortunately, the 1st Heaven descended right afterwards; furthermore, the Lord of the Ninth Mountain and Sea and I have a beef with each other....”</p><br/><p>“The Lord of the Ninth Mountain and Sea, Ji Tian? How dare he!” Grandpa Meng’s eyes flashed with coldness. “After I take care of things here in the Eighth Mountain and Sea, I’ll go to the Ninth Mountain and Sea, and if Ji Tian is devoted to the Mountain and Sea Realm, then I’ll go easy on him. Otherwise....” Killing intent flickered in his eyes.</p><br/><p>Meng Hao instantly felt a little bit better. He could sense from the cultivation base fluctuations that Grandpa Meng was even stronger than Lord White, being more than half a step into the 6-Essences level.</p><br/><p>The only reason he hadn’t been able to immediately vanquish the Outsider Dao Sovereign’s clone was because he had just awoken and was still clearing his head. However, he was already reaching the point of being able to unleash the full power of his cultivation base.</p><br/><p>Grandpa Meng looked at Meng Hao, and although he wasn’t sure exactly why Meng Hao didn’t want to return to the Ninth Mountain and Sea, he could tell that his grandson was someone who exceeded the Mountain and Sea Lords within the Mountain and Sea Realm. “You've grown up, and you have an astonishing cultivation base,” he said. “The Mountain and Sea Realm is unstable now, and all cultivators have their own missions to accomplish. You follow your heart and do whatever it is you need to do!</p><br/><p>“Don’t worry about the Fang Clan in the Ninth Mountain and Sea,” he said. “The Eighth Mountain and Sea... is already in ruins. I’ll gather the survivors and go to the Ninth Mountain and Sea. That is where we will take our stand against the Outsiders.”</p><br/><p>Meng Hao stood there silently for a moment before clasping hands and bowing deeply to his grandfather. He looked off in the direction of the Ninth Mountain and Sea, and from what he could sense in his blood, he knew that the Fang Clan cultivators were not in any great danger at the moment. Feeling somewhat at ease, he turned and transformed into a beam of light that shot off into the distance.</p><br/><p>His destination was the Fourth Mountain and Sea. Leaving the Ninth Mountain and Sea behind, his purpose was to bring Xu Qing home. Now that war had broken out, he was feeling... more and more uneasy.</p><br/><p>That unease had begun to grow as soon as the 1st Heaven had begun to descend.</p><br/><p>Back on the Eighth Mountain, Grandpa Meng stood there looking at Meng Hao making his way off into the distance. A loving expression could be seen on his face, and also... traces of how profoundly he hated having to part with his grandson.</p><br/><p>“Senior Outsider once said that when the Mountain and Sea Tribulation arrives, everything will be transformed into dust....” he said softly. “However, there is something special about the Ninth Mountain. It will eventually become the only mountain left....</p><br/><p>“He even said that he wasn’t sure if any of the Mountains and Seas would survive the catastrophe. He said that all he could do was search for a certain... hope.</p><br/><p>“Apparently the hope he was talking about... was Hao’er.” Looking away from Meng Hao, he sent his divine sense out, and quickly caught sight of some Outsiders. Eyes flickering with icy killing intent, he sprang into motion.</p><br/><p>Meng Hao sped along through the starry sky of the Eighth Mountain and Sea. Soon, he reached the rift where he had fought Lord White. By now, that rift had collapsed, leaving behind only faint traces.</p><br/><p>Meng Hao hovered there, eyes flickering as he took a step forward. Although he seemed to be just strolling along, he was actually walking in a circle. He moved faster and faster, until the Essence of Time began to emanate out. The void distorted, and the starry sky was affected. Soon, a blurry vortex appeared, which spun around and around as it grew.</p><br/><p>It went from 30 meters, to 300 meters, until eventually, Meng Hao could be seen only as ghost images. Innumerable copies of Meng Hao could be seen as the vortex rumbled out to 3,000 meters.</p><br/><p>As the power of time travel exploded out, many people from the Eighth Mountain and Sea sensed what was happening. It was at around this time that a rift suddenly appeared within that vortex!</p><br/><p>This was none other than the rift which had connected the Seventh and Eighth Mountains and Seas.</p><br/><p>In almost the exact same instant that the rift appeared, the countless reflections of Meng Hao which were spinning around the vortex transposed, once again forming a single version. Then, he stepped into the rift and vanished.</p><br/><p>After he disappeared, the vortex faded away, and soon... the rift quickly vanished, and the starry sky returned to normal.</p><br/><p>Within the rift that connected the two Mountains and Seas, Meng Hao was a beam of bright light that moved with speed far exceeding Lord White’s. In virtually the blink of an eye, he was already on the other side.</p><br/><p>Soon, he could sense the aura of the curse power which was unique to the Seventh Mountain and Sea. Without the slightest hesitation, he burst out through the exit portal.</p><br/><p>Almost immediately, a cold snort echoed out.</p><br/><p>“Someone has appeared. It seems my calculations were correct. These Mountain and Sea Realm aboriginals really are trying to escape from the Eighth Mountain and Sea through here.</p><br/><p>“Well, now that you’re here, don’t try to run.” Almost immediately, the magic of a divine ability rumbled toward Meng Hao, and black flames instantly surrounded him.</p><br/><p>As soon as he saw the flames, he could tell that this was an Outsider’s magical technique, backed by the cultivation base of a Dao Lord. Although powerful experts of that realm could rock their surroundings with the mere stamp of a foot, to Meng Hao, they were like insects that could be killed as easily as flipping over a hand.</p><br/><p>His eyes flickered coldly as he suddenly sucked in a deep breath, inhaling the black flames through his nose and mouth. Then he looked around, even as gasps rang out in reaction to what he had just done.</p><br/><p>The rift entrance to the Seventh Mountain and Sea was very near the Seventh Mountain, and the entire area was littered with corpses. Eight Outsiders were present, and shockingly, their cultivation base fluctuations were that of the Dao Realm. Clearly, they were lying in wait to slaughter anyone who appeared here. But now, after seeing Meng Hao simply inhale the Essence flames that the Dao Lord had unleashed, they all gasped, and their faces fell.</p><br/><p>That was especially true of the Outsider Dao Lord, whose eyes went wide. Mind reeling, he immediately fell back, but in that same instant, Meng Hao appeared directly in front of him, reached out, grabbed him by the throat, and threw him to the side.</p><br/><p>His scales shattered, and his flesh and blood turned into a gory mass. A bloodcurdling scream echoed out as he was completely shredded into pieces.</p><br/><p>Immediately, the other Outsiders began shaking all the way down to their tails, and instantly tried to flee, using all the power they could muster.</p><br/><p>“Dao Sovereign! He’s a true Dao Sovereign!!”</p><br/><p>“I thought Ksitigarbha from the Fourth Mountain was the only true Dao Sovereign in the Mountain and Sea Realm! But he's fighting with the Imperial Lord! He can’t be here at the same time! Who is this guy!?!?”</p><br/><p>“Dammit, we just ambushed a true Dao Sovereign!!” The eight Outsiders were completely taken aback. Filled with terror and shock, scales shivering and tails shaking, they tried to flee.</p><br/><p>However, Meng Hao sent his divine sense out, a single thought that filled the entire area. Instantly, the Nascent Divinities of all of the 1-Essence and 2-Essences Outsider Dao Realm experts were shattered. Their minds were wiped away, leaving behind soulless corpses which toppled down out of the starry sky.</p><br/><p>As soon as Meng Hao’s divine sense swept out, he saw everything in the Seventh Mountain and Sea floating in his mind, and the seemingly endless amounts of Outsiders present.</p><br/><p>He saw numerous black cubes floating in the starry sky of the Seventh Mountain and Sea, the largest of which were 30,000 meters wide, and the smallest of which were only a few hundred meters wide. The Outsiders were pouring in and out of these cubes; apparently, they were some sort of military stronghold.</p><br/><p>Black flames surrounded the cubes, and lightning crackled on their surfaces. The starry sky around them was also distorted, as if the cubes were organized into some sort of spell formation!</p><br/><p>The Seventh Mountain and Sea should have been occupied by cultivators of the Mountain and Sea Realm. However, what was visible now were mostly Outsiders. Few native cultivators could be seen, and the majority present were dead. Most of the cultivators from the Seventh Mountain and Sea were actually in the Eighth Mountain and Sea. The ones who had remained behind were for the most part low level, making it extremely easy for the Outsiders to occupy the place.</p><br/><p>Meng Hao’s face was grim, and his fury toward the Outsiders only continued to grow as he discovered that they didn’t even spare the mortals; to them, it didn’t matter if someone was a cultivator or not, anyone from the Mountain and Sea Realm was guilty!</p><br/><p>Of the four great planets in the Seventh Mountain and Sea, three were already shattered and in ruins. Because of that, the curse power that normally filled the Seventh Mountain and Sea was now in complete chaos.</p><br/><p>“Lord White, even death can not atone for your crimes!” Meng Hao growled, eyes bloodshot. As he examined the situation with his divine sense, he noticed that there was a force of over 10,000 Outsiders attacking the final planet, the largest planet of the Seventh Mountain and Sea.</p><br/><p>There were still tens of thousands of cultivators left alive on that planet. Those fighters were the last remnants of the cultivators of the Seventh Mountain and Sea....</p><br/><p>Even in the brief moment in which his divine sense swept over the planet, Meng Hao could see many cultivators of the Seventh Mountain and Sea choosing to self-detonate instead of being killed. In the last moments before they died, the words they shouted echoed within Meng Hao’s divine sense.</p><br/><p>“Live for the Mountains and Seas, die for the Mountains and Seas!!”</p><br/><p>Booms echoed out around that group of tens of thousands of cultivators as they fought to defend the planet and all the lives on it.</p><br/><p>Among those cultivators, Meng Hao caught sight of... the Seventh Mountain’s Echelon cultivator, Yuwen Jian!</p><br/><p>Yuwen Jian was completely soaked in blood, and had been severely injured. Despite that, he roared in rage as he fought against the enemy. He was a body cultivator, and the weapon he wielded was the very same valuable treasure he had taken from Meng Hao years before. He was currently surrounded by a host of enemies with whom he was desperately fighting. [1. Meng Hao loaned a battle axe to Yuwen Jian, which he kept (without permission) when they parted ways in chapter 1151]</p><br/><p>Currently, a Dao Realm Outsider was laughing coldly while shooting toward Yuwen Jian in a beam of light. Even as he closed in, Meng Hao snorted coldly, causing his divine sense to vibrate. Instantly, the Dao Realm Outsider who was attacking Yuwen Jian let out a miserable shriek and then exploded, killed instantly!</p><br/><p>At the same time, Meng Hao took a step forward, vanishing as he headed towards the fighting.</p><br/>\n</div>"}