{"title": "Chapter 1324: The Agreement of Planet Tiger Cage!", "id": 1324, "volume": 14, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-1324-the-agreement-of-planet-tiger-cage", "volume_title": "Volume 14", "body": "<h1>Chapter 1324: The Agreement of Planet Tiger Cage!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 1324: The Agreement of Planet Tiger Cage!</strong></p><br/><p>Back in the Seventh Mountain and Sea, the previously listless eyes of the cultivators began to flicker with light as passion stirred in their hearts.</p><br/><p>They suddenly recalled the image of Meng Hao slaying the Outsiders with one blow; couple that sight with what he had told them just now, and a certain title began to ring out in their minds and hearts.</p><br/><p><em>Dao Sovereign!!</em></p><br/><p>What Meng Hao had done, and what he had said, made it clear to these cultivators exactly how strong he was in battle. Battle prowess like that would be vitally important in the Mountain and Sea Realm’s war.</p><br/><p>There were too many things that these cultivators didn’t understand, and the terrifying power of the 33 Heavens was something they didn’t even want to think about. They were in such despair that they would cling desperately to even the slightest scrap of hope.</p><br/><p>As of this moment, hope was now kindling in their eyes. To them, a cultivator like Meng Hao represented the absolute pinnacle of the Mountain and Sea Realm, and if he said that he hadn't lost hope or faith, then they believed him!</p><br/><p>“It is we of the Mountain and Sea Realm who called for this war,” Meng Hao continued. “Therefore, this... is not a war being waged upon us by the 33 Heavens. No, this is us... waging war on the 33 Heavens!</p><br/><p>“We will break open those 33 Heavens so that the cultivators of the Mountain and Sea Realm can look up and see the true starry sky above our heads!” As Meng Hao spoke, the light in the eyes of the surrounding cultivators grew brighter.</p><br/><p>However, words alone were not enough. As Meng Hao looked out at the crowds around him, a wild notion suddenly sprang up inside him.</p><br/><p>He knew that what he was seeing right now was not an isolated incident. Whichever Mountain and Sea one went to right now, one would surely find similar thoughts of despair running through the hearts and minds of the cultivators of the Mountain and Sea Realm.</p><br/><p>Perhaps the degree of despair would be different in different places, and perhaps some people could suppress the despair and turn it into killing intent. But some would surely tremble in fear and lose their will to fight. If that happened, then the war... truly would be a hopeless one.</p><br/><p>As he realized how difficult this war would be, he suddenly gained understanding of a simple truth. War... needed heroes, and at the same time, did not!</p><br/><p>The reason it needed heroes was because they could rouse the spirits of their comrades!</p><br/><p>Simultaneously, the reason heroes were not needed was because... a single person can never determine victory in a war. Even with someone as powerful as Paragon Nine Seals... the people were delivered, but the world was lost.</p><br/><p>War required unity. A people needed unity!</p><br/><p>It was only by means of unity that the cultivators of the Mountains and Seas could rise up. Only with a burning spirit... could they fight back against all odds, and have the fortitude to fight to the death with the 33 Heavens.</p><br/><p>“There’s something I need to do....” he murmured softly. Usually, he didn’t think of himself as the Lord of the Mountain and Sea Realm. That was something that would happen in the future, not at this moment.</p><br/><p>“Perhaps that's the wrong attitude,” he thought. “If there is no future... then there will be no Lord of the Mountain and Sea Realm....” Meng Hao’s eyes flickered as he looked up into the starry sky toward the 1st Heaven. The crazy idea that had just occurred to him just now was growing stronger. Taking a deep breath, he decided to let the notion percolate for a while.</p><br/><p>With that, he turned and headed out across Planet Tiger Cage with Yuwen Jian.</p><br/><p>Behind him, the spirits of the cultivators seemed to have lifted. As they watched Meng Hao leaving, sparks of fire appeared in their hearts and began to burn steadily.</p><br/><p>One could well imagine what would happen as those sparks burned hotter and brighter. The hearts of those cultivators would ignite, and eventually, the same thing would happen throughout the entire Mountain and Sea Realm. In the end, either they would be burnt by those flames, or the enemy would!</p><br/><p>Cracks and crevices covered the surface of Planet Tiger Cage.... All of the lands were covered with rifts that were only growing larger and wider with time. As of this moment, the planet seemed to be teetering on the verge of collapse.</p><br/><p>Apparently, the carnage of the war in the Mountain and Sea Realm was focused initially on the Sixth and Seventh Mountains and Seas. As Meng Hao looked around at Planet Tiger Cage, his eyes flickered with the desire to kill.</p><br/><p>Furthermore, his rage toward Lord White still lingered, despite the fact that he had already cut him down.</p><br/><p>“Now that I think about it, there is still one more traitor among the Mountain and Sea Lords,” he thought. Heart filling with icy coldness, he looked off into the distance for a moment, then turned to Yuwen Jian.</p><br/><p>“Brother Yuwen, back in the Windswept Realm, you mentioned that the Seventh Mountain and Sea has... God blood?” Although Meng Hao was planning to merely pass through, there were still some important things here for him.</p><br/><p>God blood was something critical for making breakthroughs with the fleshly body. After his recent breakthroughs, his current fleshly body level had actually become an encumbrance. If he could make a breakthrough, then based on the foundation he had built up, he would experience an incredible rise, and immediately reach the level of a Dao Sovereign.</p><br/><p>At that time, considering the level of his cultivation base and his terrifying divine sense, he would truly be equipped... with the power of a Dao Sovereign!</p><br/><p>After acquiring the Green Emperor’s Eternal Incantation from Lord White, he had made major progress with his Eternal stratum. Even still, he could tell that his fleshly body needed to become more powerful before he could be confident in facing the Flesh and Blood Desolation, which was the Second of the Seven Desolations of Ancient Realm Soul Lamp extinguishing.</p><br/><p>The crazy idea which had come to him required that he have battle prowess truly equivalent to the Dao Sovereign level. Only then could he be confident enough to make that idea a reality.</p><br/><p>“Of course we do!” replied Yuwen Jian. “In the Vale of the Godgrave. However, it’s already been occupied by the Outsiders....</p><br/><p>“Brother Meng, if you want to go, then I can take you there!” Yuwen Jian’s eyes gleamed brightly. [1. Yuwen Jian actually mentioned this place back in chapter 1151]</p><br/><p>“Not yet,” Meng Hao replied softly. “I have a bit of unresolved Karma on this planet. Brother Yuwen, please wait while I take care of something.” With that, he took a step forward and then vanished.</p><br/><p>Yuwen Jian hovered there silently for a moment, his eyes burning with a will to fight.</p><br/><p>“We’re both in the Echelon,” he thought, “but Meng Hao has already reached the point where everyone looks up to him. And yet I... still haven’t passed through the Ancient Realm. It's hard to say how long this war will last. I must step into the Dao Realm!” Yuwen Jian’s eyes shone with a flicker of determination.</p><br/><p>As Meng Hao flew along above the lands of Planet Tiger Cage, he felt an aura spreading out from inside of him. It came from deep in the recesses of his cultivation base, where there existed a white diamond-shaped object!</p><br/><p>“Planet Tiger Cage. Choumen Tai....” Meng Hao murmured. He had never forgotten about that Immortal’s corpse which had fallen out of the sky back when he was on Planet South Heaven. That Immortal was none other than Choumen Tai, and they had come to an agreement that Meng Hao would return his legacy to Planet Tiger Cage. [1. Meng Hao met Choumen Tai in chapter 301]</p><br/><p>At that time, the gift given to him by Choumen Tai had been like a precious treasure. Now, it was relatively insignificant. However, Choumen Tai had mentioned that by returning his legacy to his home on Planet Tiger Cage, Meng Hao could acquire some good fortune.</p><br/><p>Of course, Meng Hao didn’t care too much about that. After all, there was little good fortune that he could acquire now that would be of much help to him. Based on Choumen Tai’s cultivation base level back, there was nothing he could bestow upon Meng Hao now that would be of any use.</p><br/><p>Meng Hao had come, not because of any potential good fortune, but rather, to keep a promise.</p><br/><p>As he proceeded along, he cast his senses inward to observe the fluctuations of the diamond inside of him. Soon, a mountain appeared up ahead....</p><br/><p>It was cracked and crumbling, but hadn't fallen apart completely, and when Meng Hao scanned it with divine sense he found an Immortal’s cave which had long since been abandoned. Layers of dust covered everything in the Immortal’s cave, but deep within its recesses was a spell formation. At the very center of the spell formation was a small column of inky jade the size of a hand. On top of that column was a diamond-shaped slot.</p><br/><p>As soon as Meng Hao got close, his own chest began to radiate light as the diamond-shaped legacy bestowed upon him years ago by Choumen Tai suddenly flew out.</p><br/><p>It moved with incredible speed as it flew through the cracks in the side of the mountain, entering the Immortal’s cave, lowering itself down toward the spell formation and settling into the diamond-shaped slot.</p><br/><p>Meng Hao didn’t follow the white diamond. Instead, he hovered outside the mountain, watching. Moments later, his jaw dropped.</p><br/><p>“This....” His eyes flickered as he took a step forward and then suddenly appeared inside of the mountain. Having scanned the mountain with divine sense, he was certain there was nothing unusual lying in wait. Considering the level of his divine sense, there would be few things in existence which could conceal anything from him. Earlier, his divine sense had revealed that the spell formation was emanating fluctuations that seemed to indicate it was searching for an appropriate apprentice upon whom to bestow a legacy.</p><br/><p>But now, after the diamond sank down into the slot, the spell formation immediately altered. Instead of preparing to deliver a legacy, it was... summoning something!?</p><br/><p>Meng Hao hovered outside of the spell formation, face darkening. As he studied the spell formation, he could sense the power of summoning, something that was completely ignoring the 33 Heavens above and was instead stretching out to some unknown location.</p><br/><p>This was Meng Hao’s first time seeing a spell formation like this, and was definitely his first time seeing anything which could pierce through the seal of the 33 Heavens.</p><br/><p>Because that diamond-shaped legacy had fed him power for so many years, it also contained a bit of his own aura. Furthermore, that bit of aura appeared to be transforming the summoning power in some way that even Meng Hao didn't understand.</p><br/><p>“This is no legacy.... Choumen Tai, who exactly are you?!” Meng Hao’s eyes flickered, and he let out a cold harrumph. Although what was happening was unexpected, considering the level of his current cultivation base, he could simply destroy the spell formation if he wanted to. That might be a violation of his previous oath, but the current Mountain and Sea Realm could ill afford an unknown and unexpected hazard.</p><br/><p>He had come here because of his promise, to repay Choumen Tai for the good fortune he had bestowed. But now, his face was grim. He would rather incur Karma and sully his oath, than permit this spell formation to cause any harm to the Mountain and Sea Realm!</p><br/><p>He reached his hand out, causing a massive burst of power to build up. Just as it was about to blast down onto the spell formation, a voice suddenly spoke out in Meng Hao’s mind.</p><br/><p>It was a voice filled with a pleading tone. It was... Choumen Tai.</p><br/><p>“Please allow me to have some hope.... Please, I have no desire to hurt you or do anything to harm the interests of the Mountain and Sea Realm. Please... allow me my hope....</p><br/><p>“The person I want to resurrect, he.... is my master....</p><br/><p>“Years ago, he sent me away into the cycle of reincarnation. I experienced many, many things. Eventually I awoke and remembered my home, and who I was back then. I remembered that he... had extinguished his own soul fire.</p><br/><p>“I want to resurrect my master. That is my sole purpose in life. Please, allow me to have my hope.... If you do... I can help you in this Mountain and Sea War!!” [2. The fact that Choumen Tai wanted to resurrect someone was mentioned by Shui Dongliu in chapter 692. And now I would like to share some details from beyond ISSTH, which I don’t think counts as spoiler information, but does involve elements from his other books. By this point in the original release of ISSTH, many fans had come to the conclusion that Choumen Tai is actually a character from Beseech the Devil. Diamond-shaped marks play a significant role in the cultivation in that novel, which was one piece of evidence that points to such a conclusion. If he was a character from Beseech the Devil, then it would be likely that his master was also a character from that book. Many people guessed that his master was none other than Su Ming, the main character of Beseech the Devil. Again, this was merely speculation, based on information up to and including this chapter.]</p><br/><p>Nothing Choumen Tai said moved Meng Hao at all. He sent his cultivation base power out, and the spell formation began to emit cracking sounds as the summoning was interrupted. However, it was at that point that Choumen Tai said one last thing, which caused Meng Hao to suddenly stop.</p><br/><p>“I, Choumen Tai, pledge on my own life, that if you preserve this spell formation, I will devote my life to the Mountain and Sea War!”</p><br/><p>Meng Hao’s eyes narrowed. “How can you help?” he asked.</p><br/><p>When Choumen Tai responded, his voice seethed with manic determination. “I can help you... to seal a 7-Essences Paragon, and make that person your puppet!”</p><br/>\n</div>"}