{"title": "Chapter 1335: Xu Qing, I'm here!", "id": 1335, "volume": 14, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-1335-xu-qing-im-here", "volume_title": "Volume 14", "body": "<h1>Chapter 1335: Xu Qing, I'm here!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong></strong></p><br/><p>[/expand]</p><br/><p>The Nine Mountains and Seas were shaking. The nine Xuanwu turtles in their celestial ponds were howling, and the will of the Mountains and Seas, which had formerly been spread out in all parts of the Mountain and Sea Realm, was now converging upon Meng Hao!</p><br/><p>At the apex of the starry sky were two figures locked in combat. One of them wore white robes, and was none other than Paragon Sea Dream. Her face was ashen, but as she performed her incantation gestures, shocking, explosive power was unleashed upon her opponent, the Outsider, 7-Essences Paragon Eegoo.</p><br/><p>Even after all the time that had passed, they were still fighting!</p><br/><p>However, as soon as Meng Hao’s entered the true fleshly body Dao Sovereign level, Sea Dream’s eyes began to shine with a strange light. As for Paragon Eegoo, his face completely fell.</p><br/><p>“This is impossible!! Ksitigarbha was able to break through because of his mastery over reincarnation. But Meng Hao, he.... Dammit! He’s Nine Seals’ successor! The future Lord of the Mountains and Seas!!”</p><br/><p>“Oh, you didn't know?” Sea Dream said coolly, preventing the Outsider Paragon from breaking free of combat.</p><br/><p>At the same time, back in the Fourth Mountain and Sea, Xu Qing was there, coordinating a deadly counteroffensive against the Outsiders. All of a sudden, her heart trembled, and she looked in the direction of the Sixth Mountain and Sea. After a moment, a warm smile broke out on her face.</p><br/><p>There was another battlefield in the Fourth Mountain and Sea, where a spectacular, astonishing fight was underway between Ksitigarbha and the 1st Heaven’s Imperial Lord!</p><br/><p>That Imperial Lord’s cultivation base was clearly the most powerful of anyone except for the Paragons, being at the peak of the 6-Essences level. He was half a step into the Paragon level, and yet Ksitigarbha was also completely extraordinary. The wave of his hand could cause numerous underworld palaces to descend. His incantation gestures unleashed the mighty power of reincarnation. The Yellow Springs which flowed beneath his feet made it seem as if he could control all life or death.</p><br/><p>He was able to fight the Imperial Lord on equal footing, although that was mostly because of his control of external forces, and because he had the home field advantage. Even still, it was obvious why for countless years Ksitigarbha had been known as the most powerful person in the Mountain and Sea Realm!</p><br/><p>As of this moment, Ksitigarbha could also sense Meng Hao’s explosive Dao Sovereign energy coming from the Sixth Mountain and Sea. Even as the Outsider Imperial Lord’s face flickered, Ksitigarbha’s eyes gleamed, and he threw his head back and laughed uproariously.</p><br/><p>It had been years since he had noticed how extraordinary Meng Hao was, and at that time he had chosen to sow good will with him. He had taken Xu Qing as his last and final apprentice, and she had not let him down. In the end, she had proven to be a rare genius when it came to strategy and tactics, and had been appointed as the commanding general of the entire Fourth Mountain and Sea. And then Meng Hao had gone and become a true Dao Sovereign.</p><br/><p>Ksitigarbha’s boisterous laughter made the Imperial Lord’s mood sink even further.</p><br/><p>Meanwhile, back in the Ninth Mountain and Sea, on Planet South Heaven, Shui Dongliu was still standing on that mountaintop. Suddenly, he turned his head in the direction of the Sixth Mountain and Sea, and a smile broke out on his face.</p><br/><p>“At long last the day has arrived. Dao Sovereign fleshly body.... Perhaps there is hope in this Mountain and Sea Realm war after all....” Sighing, he flicked his sleeve. “Mountain and Sea Realm, begin analysis and replication!</p><br/><p>“What a pity nothing like this happened back in the first war. If it had, perhaps the Paragon Immortal Realm would not have been defeated so tragically....”</p><br/><p>Back in the Sixth Mountain and Sea, the 3,000-meter-tall Meng Hao threw his head back and roared. Mountain and Sea power descended, filled with will of the Mountains and Seas, which swirled around Meng Hao and then bored into him.</p><br/><p>It was probing him, analyzing him, a sensation which Meng Hao found very strange, and yet did not interfere with. Instead, he simply looked down at Lord Cang of the Sixth Mountain and Sea and the Outsider Dao Sovereign clone.</p><br/><p>The clone's face was ashen, and his scalp was tingling. Without the slightest hesitation, he began to fade away in escape. He knew that he was no match for Meng Hao now. Meng Hao’s terrifying power left him in complete despair.</p><br/><p>“Dao Sovereign fleshly body. Dammit! That's even more difficult to attain than a Dao Sovereign cultivation base. How... how did he do this? Wait. There’s God blood aura. He absorbed God blood!!” The clone was almost gone. Trembling, he realized that even if he were here in his true form, he still wouldn’t be a match for Meng Hao.</p><br/><p>After all, Meng Hao’s full power wasn’t just reliant on a powerful fleshly body. His cultivation base, his magical techniques and divine abilities, all of them were terrifying.</p><br/><p>However, just when the clone thought he was about to escape, Meng Hao’s eyes flickered, and he raised his right hand in a grasping motion. A rumbling sound could be heard as the void around the clone shattered and caved in, as if a giant, invisible hand were crushing him!</p><br/><p>“Meng Hao, the 33 Heavens will exterminate your entire clan! We’ll wipe out everyone in the Mountain and Sea Realm!!” A miserable shriek rang out, filled with unending hatred, as the Outsider Dao Sovereign clone was completely obliterated.</p><br/><p>Meng Hao ignored his cries, turning instead to look at Lord Cang.</p><br/><p>“Dao Sovereign....” the man said bitterly. He had a hard time even uttering the words, considering what he himself had said just moments ago, that it would be impossible for another Dao Sovereign to appear in the Mountain and Sea Realm.</p><br/><p>And yet, right now he was standing directly in front of none other than a Dao Sovereign.</p><br/><p>He suddenly felt completely at a loss. For the sake of his own cultivation base, he had betrayed his home and his people. And now, that all seemed... like a mistake.</p><br/><p>In his bitterness, Lord Cang closed his eyes and asked himself if everything he had done had been worth it. No answer came.</p><br/><p>In almost the same moment that he closed his eyes, Meng Hao extended his right hand and waved his finger toward the head that was all which remained of Lord Cang. A boom echoed out as that head was crushed out of existence. The Lord of the Sixth Mountain and Sea was completely and utterly dead.</p><br/><p>Off to the side, Lord Wu emerged from within the shield. It was with mixed emotions that he watched Lord Cang die. Finally, he sighed.</p><br/><p>“What a waste....” he said, shaking his head. Then he looked at Meng Hao, clasped hands and bowed deeply.</p><br/><p>“I am the Lord of the Fifth Mountain and Sea. Greetings... exalted Dao Sovereign!”</p><br/><p>Just when Meng Hao was about to respond, he said, “Eee?”</p><br/><p>He suddenly realized that the will of the Mountains and Seas had ceased to suppress the invading Outsiders, and instead was completely focusing on him.</p><br/><p>It was as if the will of the Mountain and Sea Realm was inside of him... replicating his fleshly body!</p><br/><p>It wasn’t a complete and perfect copy, but rather, about eighty percent pure. When it was finished, it dispersed, then once again spread out to cover the entire Mountain and Sea Realm. Suddenly, each and every cultivator of the Mountain and Sea Realm suddenly... began to experience fleshly body transformations!</p><br/><p>In that brief instant, all of the cultivators’ fleshly bodies experienced a complete redoubling of power!</p><br/><p>It didn't matter the level of their cultivation base or fleshly body. This advancement had nothing to do with their own power. It was a blessing from the Mountain and Sea Realm, like a massive field of influence, within which all the cultivators’ fleshly bodies were completely changed!</p><br/><p>The characteristics of Meng Hao’s fleshly body were now being passed on to all of the cultivators of the Mountain and Sea Realm.</p><br/><p>As of that moment, the countless cultivators of the Mountain and Sea Realm on the numerous battlefields suddenly gaped in shock. They could sense the sudden change, and were instantly enlivened.</p><br/><p>Even Lord Wu, who was standing directly in front of Meng Hao, suddenly trembled as the blessing strengthened him too.</p><br/><p>“Is that the power of the Mountain and Sea Realm?!” Meng Hao thought. A tremor ran through him, and as for Lord Wu, he stood there gaping for a moment before excitement rose up in his heart.</p><br/><p>Meng Hao was equally excited. He knew that this transformation was the key, not just to fighting this first battle with the 33 Heavens, but also the final war with the two foreign powers.</p><br/><p>“Am I the only one who can do this? Is it because I'm the future Lord of the Mountain and Sea Realm? Or because I’m the successor of Paragon Nine Seals? Or... is it because of my Allheaven Dao Immortal blood?” Meng Hao's eyes glittered. There was no immediate explanation. Looking down at Lord Wu, he clasped hands, then slowly shrank in size back to that of an ordinary person.</p><br/><p>They did not spend time in idle chatter. Lord Wu immediately headed to the nearest front of battle. As a Mountain and Sea Lord, he had his own important responsibilities. Meng Hao also had his own matters to attend to, and transformed into a beam of colorful light that shot off into the distance.</p><br/><p>He sped along toward the Fifth Mountain and Sea, unobstructed. He could pass through the barriers between Mountains and Seas even when he was in the midst of the Desolation tribulation. There was no need to even mention what he could do now that he had a Dao Sovereign fleshly body. Within the Mountain and Sea Realm, his fleshly body was definitely at the absolute peak!</p><br/><p>A single step took him through the barrier, and he appeared in the Fifth Mountain and Sea, where bitter fighting was underway. However, because of the blessing bestowed by the will of the Mountain and Sea Realm, which came from Meng Hao’s Dao Sovereign fleshly body, the gap between the Outsider cultivators and the cultivators of the Mountain and Sea Realm was ever shrinking.</p><br/><p>Meng Hao could tell that with his current fleshly body power, he could crush and ignore natural law. He could alter the starry sky and even bend space and time.</p><br/><p>“So this is what a 6-Essences Dao Sovereign is like, huh....” he murmured. “One Essence beyond this is the Paragon level.” It was as if his own body were a starry sky, with his organs being the heavenly bodies. It was like an endless cycle.</p><br/><p>It was as if, even if Heaven and Earth were to be destroyed, he would not be!</p><br/><p>It was as if, even if Heaven and Earth were to wither away, he would not!</p><br/><p>Stepping into 6-Essences made one’s longevity equal to the Heavens!</p><br/><p>Stepping into the true Dao Sovereign level made you incomparable!</p><br/><p>Meng Hao didn't tarry in the Fifth Mountain and Sea. He sped along, and was soon nearing the Fourth Mountain and Sea.</p><br/><p>As the barrier approached, his mood rose and fell constantly. At long last... he was approaching the Fourth Mountain and Sea. At long last... he would be able to see Xu Qing again.</p><br/><p>Back when everything started, when he left the Ninth Mountain and Sea, how could he ever have imagined that the road would stretch to this extent? War had begun, the 1st Heaven had descended, and the Mountain and Sea Realm had been thrown into chaos.</p><br/><p>At the same time, he could never have imagined that with fleshly body power like this, he would be able to traverse the Nine Mountains and Seas as easily as if he were walking across the courtyard of his residence.</p><br/><p>“Xu Qing, I'm here....” he murmured. A single step, and he was across the barrier. He was in... the Fourth Mountain and Sea!</p><br/><p><strong>Chapter 1335: Xu Qing, I'm here!</strong></p><br/>\n</div>"}