{"title": "Chapter 1339: 10,000 Star Detonation!", "id": 1339, "volume": 14, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-1339-10-000-star-detonation", "volume_title": "Volume 14", "body": "<h1>Chapter 1339: 10,000 Star Detonation!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>As of this moment, all eyes were completely fixed upon Meng Hao!</p><br/><p>Even as the words left his mouth, he flicked his sleeve, unleashing the Second Demon Sealing Hex. Rumbling sounds filled Heaven and Earth, and the starry sky trembled. Simultaneously, the land mass that was the 1st Heaven was also shaking, as were the previously awe-inspiring Tribulation Clouds!</p><br/><p>The gigantic lizard claw, and its boundless Tribulation Lightning, suddenly became illusory, and began to fade away. Moments later, the seemingly infinite Tribulation Clouds also... began to fade away.</p><br/><p>After becoming illusory, all Meng Hao had to do was speak a single word, and his will caused everything to transform from being real to not! To the shock of cultivators and Outsiders alike, as of this moment, Meng Hao’s fleshly body Dao Tribulation... was over! It had been concluded using a method none of them had ever seen or heard of before.</p><br/><p>“Impossible!!” The Outsider Imperial Lord fighting Ksitigarbha suddenly let out a miserable howl. He simply couldn't believe what he was seeing. As far as he was concerned, it was a complete impossibility, and yet, here it was occurring right in front of him!</p><br/><p>He suddenly burst into motion in an attempt to go stop Meng Hao, but in response, Ksitigarbha laughed coldly, causing underworld palaces to descend and the Yellow Springs to sweep out. The river of reincarnation surged, making it completely impossible for the Outsider Imperial Lord to do anything.</p><br/><p>Elsewhere in the starry sky, a similar situation was occurring with Paragon Sea Dream. She went all-out with her cultivation base, even incurring serious injuries to herself, to prevent the maddened Outsider Paragon Eegoo from breaking free. Eegoo bellowed in rage, eyes burning with killing intent as he sent divine sense roiling out to crush Meng Hao, and yet he couldn't get past Sea Dream.</p><br/><p>“Sea Dream, I don’t want to kill you! Don't walk into your own death!!”</p><br/><p>“Don’t make me laugh!” Sea Dream responded, yet again obstructing his path.</p><br/><p>The Nine Mountains and Seas, which moments ago had been completely silent, suddenly burst out into a huge commotion. The cultivators of the Mountain and Sea Realm were crying out and cheering, their voices merging together into a sound wave that surged out in all directions. As for the Outsiders, they were completely shocked, and yet, their will to fight was not reduced, and they continued to do battle.</p><br/><p>And yet... everyone, including the Outsiders, was still watching Meng Hao as he closed in on the 1st Heaven.</p><br/><p>He shot onward at top speed, surrounded by 10,000 little suns which radiated intense light.</p><br/><p>Closer and closer!</p><br/><p>Countless Outsiders flew out from the 1st Heaven and charged toward Meng Hao. Numerous scintillating shields were set in place.</p><br/><p>However, as the Outsiders approached, Meng Hao’s hands flashed in a double-handed incantation gesture; then he stretched his hands wide and clapped them together violently, sending a burst of cultivation base power out directly into the Outsiders, and directly toward the 1st Heaven!</p><br/><p>“Suns, detonate!” he roared. Instantly, the 10,000 suns surged into action, flying directly toward the Outsiders and the shields protecting the land mass that was the 1st Heaven!</p><br/><p>BOOOOOOOOOOOOOM!</p><br/><p>10,000 suns all detonated!</p><br/><p>Each and every one of those little suns had been bolstered by Meng Hao’s cultivation base power, and as such, their combined power was completely and utterly shocking. A massive explosion rippled out that shook lands and rocked mountains, that destroyed Heaven and Earth, that directly ripped apart the starry sky!</p><br/><p>A terrifying shockwave then began to spread out in all directions.</p><br/><p>That shockwave was so huge that it was visible even in the Ninth Mountain and Sea, and it filled all hearts with shock.</p><br/><p>The vast numbers of Outsiders who had flown out to stop Meng Hao, regardless of their cultivation bases, were swept over by the shockwave caused by the detonation of 10,000 suns. Bloodcurdling screams rang out as their bodies were transformed into ash. Even the Nascent Divinities which attempted to flee were completely eradicated.</p><br/><p>Rumbling could be heard as the shockwave then slammed into the shields protecting the 1st Heaven. In the blink of an eye, the shields began to shatter bit by bit. They immediately began to repair themselves, but were clearly weakened. However, in the end the shields were too strong; even the detonation of 10,000 suns could not completely destroy them. And yet, a tiny opening had appeared.</p><br/><p>That was all Meng Hao needed. He waved his arm, and the Battle Weapon appeared, transforming into a black beam that stabbed directly into that weak spot, preventing the shields from recovering.</p><br/><p>All of this happened so quickly that no one could react. Meng Hao moved as fast as lightning, sweeping the Battle Weapon out so that a huge rift was torn open in the shield, and the land mass that was the 1st Heaven. Then, he stepped through that rift... to the surface of the 1st Heaven!</p><br/><p>By this point, the cultivators of the Mountain and Sea Realm had been whipped up into a frenzy. As for the Outsiders, their faces were ashen and filled with dread.</p><br/><p>The Imperial Lord roared, the Paragon howled, and the Dao Sovereign’s incarnations were trying unsuccessfully to merge back together.</p><br/><p>In the instant that Meng Hao set foot into the 1st Heaven, he bolstered his voice with his cultivation base and cried out, “Mountain and Sea Cultivators, fight to the death!”</p><br/><p>In response, all of the cultivators of the Mountain and Sea Realm joined their voices together in response. It almost seemed planned, but it wasn’t.</p><br/><p>The first to respond was the Fourth Mountain and Sea. The cultivators who clustered around Xu Qing were already chomping at the bit. The 1st Heaven hadn't been destroyed yet, but Meng Hao’s sudden explosive success had kindled the spirits and souls of all of the cultivators there.</p><br/><p>Once the 1st Heaven was actually destroyed, that spark which had been lit would explode into an inferno.</p><br/><p>“Mountain and Sea Cultivators, fight to the death!” The shouts of one cultivator after another in the Fourth Mountain and Sea rang out, like the bellowing of war horns calling everyone to a final battle. As they did, they charged forth, smashing into the surrounding Outsiders.</p><br/><p>Soon, such cries filled the air throughout the Fourth Mountain and Sea. The eyes of all cultivators were shining brightly, and everyone felt as if they were bursting with incredible power.</p><br/><p>Soon, all of the voices in the Fourth Mountain and Sea joined together into one mighty call.</p><br/><p>“Mountain and Sea Cultivators, fight to the death!”</p><br/><p>Meng Hao was using one simple phrase to bring all of the Nine Mountains and Seas into one united Mountain and Sea Realm!</p><br/><p>As the voices echoed out in the Fourth Mountain and Sea, similar cries rose up in the Third and Fifth Mountains and Seas. Massive waves of sound were crashing out, and were joined by the Second, First, Sixth, and Seventh Mountains and Seas!</p><br/><p>All voices cried out, filled with passion and inspiration.</p><br/><p>“Mountain and Sea Cultivators, fight to the death!” That one phrase embodied the spirit of the Mountain and Sea Realm. There would be no retreat. Enough was enough! They had been suppressed to the limit, and now was the time... to give voice to their rage!</p><br/><p>They did not agree to be exterminated. They did not agree to die. They did not agree for the Mountains and Seas to vanish. This was the voice of a people who did not agree to back down.</p><br/><p>This was the voice... that marked the awakening of a people!</p><br/><p>“Mountain and Sea Cultivators, fight to the death!” Finally, the voices could be heard in the Eighth Mountain and Sea and then... the Ninth Mountain and Sea. All of the Nine Mountains and Seas, the entire Mountain and Sea Realm, was filled with one unified voice!</p><br/><p>The ordinary Outsiders trembled. The Dao Sovereign was shocked. The Imperial Lord was shaken. The Paragon was flabbergasted!!</p><br/><p>As of this moment, the people of the Mountain and Sea Realm were using their battle cry to tell the Outsiders: We are not to be underestimated! You might have suppressed us for tens upon tens of thousands of years, but we are still... the Mountain and Sea Realm!</p><br/><p>-----</p><br/><p><strong>Note from Deathblade:</strong> This chapter is a bit shorter than normal, coming in at around 1400 English words instead of the usual 2000 or so. Er Gen made no comment about that in his chapter release, although he did do four updates on that day, this being the second.</p><br/>\n</div>"}