{"title": "Chapter 1342: Earth Shatters!", "id": 1342, "volume": 14, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-1342-earth-shatters", "volume_title": "Volume 14", "body": "<h1>Chapter 1342: Earth Shatters!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 1342: Earth Shatters!</strong></p><br/><p>Long Linzi was sent tumbling backward with a boom. Blood sprayed out of his mouth, but a vicious expression could be seen on his face as he began to perform an incantation gesture. However, even as he did so, Meng Hao snorted coldly and transformed into an azure roc.</p><br/><p>As the roc closed in, talons ripped through the air toward Long Linzi.</p><br/><p>Even as those talons closed in, rumbling sounds echoed out from Long Linzi as he abandoned his humanoid shape and transformed into a black lizard. Roaring, he swept his tail through the air, shattering it as it bashed into the roc.</p><br/><p>The azure roc shattered, and blood oozed out of the corners of Meng Hao's mouth. However, he didn't slow down. Instead, his right hand clenched into a fist and he punched Long Linzi directly in the chest!</p><br/><p>This was none other than the God-Slaying Fist!!</p><br/><p>It converged his will with the will of Heaven, turning into a fist strike that could exterminate everything!</p><br/><p>Massive booms rang out as the fist absorbed half of the life force of the entire 1st Heaven, unleashing both a spirit of Bedevilment and a will of God-Slaying. Long Linzi screamed miserably as he was sent tumbling backward. His flesh and blood were mangled, his scales shattered. He slammed into the ground, which quaked as a huge crater opened up!</p><br/><p>As that crater crumbled open, Meng Hao once again began to grow in size until he was 3,000 meters tall. Then he took a step forward, leaping into the crater and slamming another fist toward Long Linzi.</p><br/><p>However, as the fist was unleashed, Meng Hao frowned. Long Linzi body was somewhat blurry, and he even let out a cold snort.</p><br/><p>“Not real?” Meng Hao murmured, his expression calm. However, his right hand didn't slow down, but instead sped up as it rocketed toward the illusory figure. The full power of his fleshly body and his cultivation base backed the fist strike as it passed through the illusion and slammed into the earth behind it.</p><br/><p>The resulting boom shook the entire land mass. Several massive craters formed that penetrated all the way through to the other side of the land mass, sending massive amounts of rubble tumbling down toward the Mountain and Sea Realm.</p><br/><p>As for Meng Hao himself, he followed the collapse of the crater down, evading the vicious tail strike which swept out from Long Linzi.</p><br/><p>As the tail screamed past his head, Long Linzi roared viciously, then changed tactics, reaching out with his hands to grab Meng Hao.</p><br/><p>“You don't need to come after me,” Meng Hao said coolly. The Lightning Cauldron suddenly appeared above his head. Lighting danced, and he turned in the direction of Long Linzi, instantly switching places with him via Form Displacement Transposition.</p><br/><p>The moment they switched locations, Meng Hao unleashed his divine sense, which was eighty percent as powerful as a Paragon’s.</p><br/><p>A boom could be heard as it crushed onto Long Linzi, shoving him downward. Divine sense that powerful should have been enough to seriously injure him, and yet an enormous statue suddenly appeared behind him, which surrounded Long Linzi and also resisted the divine sense.</p><br/><p>As it fought back, it pushed aggressively toward Meng Hao. Just when Meng Hao was about to counterattack, a sacrificial power suddenly rose up from within the Fourth Mountain and Sea.</p><br/><p>That sacrificial power caused Long Linzi to grow rapidly, and also increased the level of his cultivation base. He then threw his head back and howled as he shot toward Meng Hao at top speed.</p><br/><p>Meng Hao frowned. He could tell that the Outsider Imperial Lord who was fighting with Ksitigarbha in the Fourth Mountain and Sea could not extricate himself from the fight. Instead, he had unleashed this secret magic, taking some of his own cultivation base and imparting it upon Long Linzi.</p><br/><p>Rumbling echoed out as flames erupted around the incoming Long Linzi. Then he performed an incantation gesture, and the huge statue’s eyes opened. It glared at Meng Hao with a look like death itself, completely locking down the area surrounding him.</p><br/><p>“Die!” howled Long Linzi, barreling forward to slam his head into Meng Hao.</p><br/><p>Meng Hao’s right hand shot up, and the meat jelly appeared. Knowing exactly what Meng Hao wanted, it simply sighed and transformed into a wide rubbery membrane.</p><br/><p>A mighty thwacking sound echoed out as Long Linzi slammed into the meat jelly and was then propelled backward, the force of his blow dispersed. Trembling, Long Linzi let out a roar, and yet, it couldn't drown out the cry of pain that rang out from the meat jelly’s mouth.</p><br/><p>“OWWW! That hurt like hell! Lord Third gives up! I give up!” The meat jelly rapidly shrank back down, transforming into a beam of light that shot back into Meng Hao’s bag of holding.</p><br/><p>As for Long Linzi, the backlash sent stabs of pain throughout his body, setting his qi and blood aboil, and temporarily freezing up his cultivation base.</p><br/><p>Meng Hao’s eyes flickered. Even as Long Linzi fell back, he extended his right hand and waved his finger to unleash the Eighth Demon Sealing Hex.</p><br/><p>Long Linzi lurched to a stop; they were no longer in the 1st Heaven now, but rather, underneath it. Therefore, Long Linzi could no longer benefit from the blessing of the will of the 1st Heaven, and thus, the Demon Sealing Hex immediately succeeded.</p><br/><p>Almost as soon as Long Linzi lurched to a stop, the Battle Weapon appeared in Meng Hao’s hand, which he slashed out.</p><br/><p>“Let's see how you escape this time!” he said. Killing intent flickered in Meng Hao’s eyes.</p><br/><p>This slashing blade was moving too fast for Long Linzi to be able to defend against. No escape magic could be used, and he was also locked in place by Meng Hao’s Hexing magic.</p><br/><p>However, it was at this point that, in another part of the starry sky, the Outsider Paragon who was fighting Sea Dream suddenly let out a powerful roar, causing a blood-colored light to shine from its body.</p><br/><p>Instantly, a similar blood-colored light began to shine from Long Linzi. Apparently, some sort of strange connection had sprung up between the two of them!</p><br/><p>“Blood Symbiosis?” Sea Dream said coldly. “Eegoo, you really dare to unleash this magic while fighting me?” She immediately attacked the Paragon. However, because of the blood-colored light, Meng Hao’s attack was already doomed to fail. Long Linzi vanished, reappearing off in the distance a moment later. Meanwhile, Meng Hao’s Battle Weapon slashed a massive rift into the void.</p><br/><p>Off in the distance, Long Linzi glared at Meng Hao, his lips twisting into a smile. However, instead of heading toward Meng Hao again, he turned and shot toward the Mountain and Sea Realm. Meng Hao simply watched him go, eyes cold.</p><br/><p>“Meng Hao, since you dare to exterminate the 1st Heaven, I’ll just start exterminating cultivators of the Mountain and Sea Realm! Let’s see... whether or not you choose to save them!” Long Linzi was already coughing up blood, and in a completely bedraggled state. Roaring, he shot toward the Mountain and Sea Realm, hoping to force Meng Hao to stop attacking the 1st Heaven!</p><br/><p><em>You want to wipe out the 1st Heaven? I’ll slaughter your Mountain and Sea cultivators! Let’s see which of us is the most ruthless, and who gives in first!</em></p><br/><p>The maddened Long Linzi rapidly picked up speed.</p><br/><p>“Do you care more about this dying land mass than the living cultivators of the Mountains and Seas? What’s your choice, Meng Hao?”</p><br/><p>Meng Hao's pupils constricted. The effective power of his cultivation base was already past the 5-Essences level, and was fully in the 6-Essences level. However, Long Linzi was at the same level. Although there was some difference between them, that difference wasn’t vast. Furthermore, Meng Hao’s most powerful asset, his divine sense, was something his opponent was already equipped to defend himself against.</p><br/><p>Most relevant was that he had received blessings from an Imperial Lord and a Paragon. Because of all those terrifying enhancements, he had numerous ways to avoid death. Were that not the case, he would already be dead, cut down by Meng Hao’s Battle Weapon.</p><br/><p>An unsightly expression appeared on Meng Hao’s face. Suddenly, he transmitted a message. “Choumen Tai, can you turn this Outsider Paragon Eegoo into a puppet?”</p><br/><p>Choumen Tai’s ancient voice immediately echoed back in response. “To guarantee success, it must be done when the Paragon is personally attacking you. I only have one chance to pull it off, and in this situation the likelihood of success is less than thirty percent.”</p><br/><p>In all of Meng Hao’s calculations, he had never anticipated that Long Linzi would escape from the battle at such a critical moment. Now that he thought about it, it most likely had something to do with the Outsider Paragon.</p><br/><p>Only that Paragon would be able to save Long Linzi and then use him to pin Meng Hao down.</p><br/><p>Meng Hao had no choice. Rationally speaking, he should just continue to attack the 1st Heaven. However, his heart wouldn’t let him do that.</p><br/><p>Sighing softly, he was about to make his choice when his eyes suddenly widened. Looking down toward the Mountain and Sea Realm, he saw a bright beam of light shooting with incredible speed... directly toward Long Linzi!</p><br/><p>“Patriarch Reliance....” Meng Hao thought, completely shaken.</p><br/><p>It was none other than Patriarch Reliance, howling as he flew along at top speed.</p><br/><p>“Hey, you wimpy little lizard, Patriarch Reliance is here to put you in your place!” Patriarch Reliance roared, suddenly growing even more gargantuan in size as he barreled toward the Long Linzi.</p><br/><p>At the same time, a tremor ran through Patriarch Reliance, and rumbling sounds could be heard as innumerable magical symbols appeared all over him. When Patriarch Reliance wasn’t attacking Meng Hao, those magical symbols could actually bolster the power of his cultivation base. Furthermore, the fluctuations of sealing marks being released suddenly emanated out.</p><br/><p>Patriarch Reliance’s biggest secret was something that no one except for Meng Hao knew about. He had been alive since the days of the Ancient Demon Immortal Sect. When he and Meng Hao had clashed in the past, the cultivation base power he had unleashed was already in the Dao Realm. There was even a brief moment once where he had emitted the fluctuations of a Dao Lord.</p><br/><p>Patriarch Reliance was one tough cookie, and the fact that he was now on a collision course with him filled Long Linzi with fear. Now, thanks to the interference of Patriarch Reliance, he was unable to engage in any form of slaughter in the Mountain and Sea Realm.</p><br/><p>Meng Hao laughed loudly. Now, it was without any hesitation that he shot back toward the land mass that was the 1st Heaven. To the grief of the will of the 1st Heaven, rumbling could be heard as more cities fell, and more statues were destroyed. Mountains and rivers vanished, and the entire land mass began to show signs that it was going to fall completely!</p><br/><p>Chunks of rubble began to drop down as fissures spread out across the entire land mass. Rumbling sounds could be heard as huge sections of land began to tumble down.</p><br/><p>All of the cultivators of the Mountain and Sea Realm watched as the land mass that was the 1st Heaven began to shatter into pieces!</p><br/>\n</div>"}