{"title": "Chapter 1345: Hexing Magic Essence!", "id": 1345, "volume": 14, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-1345-hexing-magic-essence", "volume_title": "Volume 14", "body": "<h1>Chapter 1345: Hexing Magic Essence!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong></strong></p><br/><p>[/expand]</p><br/><p>As soon as Meng Hao sensed the World Essence, he began to absorb it. The World Essence around him began to move, and then became visible for all to see.</p><br/><p>Countless motes of light, emanating soft glows, floated out from the 1st Heaven and spread out to fill the entire area. From a distance, it was possible to see one hundred thousand of them, forming together into the shape of a lizard.</p><br/><p>As for Meng Hao, he was located where that lizard’s heart would be, where the World Essence was most dense!</p><br/><p>At this point, the Outsider Dao Sovereign gasped, then cried out, “World Essence!!”</p><br/><p>The Outsider Paragon fighting Sea Dream saw the lizard-shaped World Essence, and his eyes filled with grief.</p><br/><p>Not all worlds could give birth to World Essence. However, if one did, if that resulting World Essence was given enough time, it could actually become... a real living being!</p><br/><p>All of the cultivators and Outsiders could see what was happening, although not everyone understood it.</p><br/><p>Of course, thanks to the events which had occurred in the Windswept Realm, the Echelon cultivators from the various Mountains and Seas knew exactly what they were looking at, and their jaws dropped. It only took an instant for them to realize that this was World Essence.</p><br/><p>Meng Hao’s heart was pounding. Based on the level of his current cultivation base, being able to sense this World Essence filled him with an intense desire to acquire it. Furthermore, he knew that World Essence was extremely precious, especially to him.</p><br/><p>He was currently in the very middle of all of the World Essence, and every breath he took caused vast amounts of it to flow into him. His thinking grew quicker, his powers of deduction stronger, and even his willpower seemed to increase. It was if he were becoming more at one with Heaven and Earth.</p><br/><p>It was at this same point that the Outsider Dao Sovereign, eyes red, life force burning, suddenly had a strange feeling. He wasn’t sure if it was an illusion or not, but after seeing Meng Hao begin to absorb the World Essence, he almost thought he could hear the World Essence screaming.</p><br/><p>This was the Essence of his home, the homeland of his heart, the mother of lizards!</p><br/><p>“Meng Hao!” he roared. He flickered into motion, shooting into the World Essence in an attempt to stop Meng Hao. However, as he closed in, Meng Hao’s eyes flickered, and he dodged to the side, clearly not interested in tangling with the Outsider Dao Sovereign. Instead, he went all-out to continue to absorb the World Essence.</p><br/><p>When he couldn’t dodge to the side, he used the Lightning Cauldron and Form Displacement Transposition to put distance between the two of them as he continued to absorb the World Essence. As for the Outsider Dao Sovereign, considering that Meng Hao wasn’t of a mind to do combat, there was little he could do.</p><br/><p>After all, although it might seem as if they were on the same level in terms of battle prowess, the truth of the matter was that Meng Hao was now just a bit stronger than the Outsider Dao Sovereign!</p><br/><p>Were it not for the fact that the World Essence seemed unstable, as if it might fade away at any moment, then Meng Hao would definitely have already attacked and killed him, and then continued the absorption process later.</p><br/><p>Unfortunately, there was no time for that. His body flashed as he dodged a black sea of flames, after which he took in a deep breath, causing massive amounts of World Essence to rumble toward him.</p><br/><p>As the World Essence shrank down, miserable screams echoed out that could be heard nowhere else except in the minds of the Outsiders.</p><br/><p>It was as if the World Essence was begging its people, begging all lizard cultivators, to help it!</p><br/><p>Throughout the Mountain and Sea Realm, the Outsiders were trembling, and expressions of grief could be seen on their faces. However, there was nothing they could do....</p><br/><p>Meng Hao continued to absorb the World Essence, and his eyes began to glow with increasing brightness. He almost looked like a sun, radiating a dazzling, boundless light of understanding.</p><br/><p>He could clearly sense his thoughts racing faster than ever before; he could detect things that he had never been able to detect before, and could also feel the indescribable enlightenment of a Dao.</p><br/><p>It was as if the great Daos of Heaven and Earth were all there in front of him, and all he had to do was pick one and attempt to understand its fundamental nature. Then... it would be able to grow into an Essence which belonged solely to him.</p><br/><p>This was not like the Divine Flame, which was an external entity, and not his own!</p><br/><p>What he was able to do now actually came from his experiences back in the Windswept Realm. There, he had laid the foundation by coming to enlightenment regarding 3,000 great Daos. That became the sowing of Karma, and today he was able to reap it!</p><br/><p>“Understanding Essence....” he thought, his eyes flashing.</p><br/><p>“I don’t need to gain enlightenment of any outside Essence. 3,000 great Daos. 3,000 Essences. Nobody can have all 3,000.... I only need enlightenment of nine Daos!</p><br/><p>“Those nine Daos aren’t anything I need to jealously attempt to acquire from others, but rather, things which exist inside of me.... There are definitely no Essences more suitable to me than the Nine Demon Sealing Hexes!</p><br/><p>“I came up with this idea before, to use the Demon Sealing Hexing magics as my Dao Realm Essences. If each one of the Hexes can be an Essence, then... when I get all nine Hexes, I will have nine Essences. And that is when I, Meng Hao... will step into the pinnacle of the Paragon level!” Meng Hao’s eyes were shining brightly, and his heart was pounding. As of this moment, he didn’t hesitate at all. He went all out with every scrap of power he could muster to gain complete enlightenment of... the Eighth Demon Sealing Hex!</p><br/><p>Body-Spirit Hexing!</p><br/><p>In the instant that Meng Hao made his decision to seek enlightenment of the Eighth Demon Sealing Hex, rumbling sounds filled his mind as all of his mental faculties focused completely on that Hex!</p><br/><p>His mind filled with a roaring like the crash of endless thunder as he analyzed the Eighth Demon Sealing Hex, focused on it, broke it apart and dug into it!</p><br/><p>He contemplated why the Hex could cease the movement of the cultivation base, and he pondered how it could even control Essence. He analyzed why the Hex was even capable of locking down Nascent Divinities!</p><br/><p>He even analyzed how the Eighth Generation Demon Sealer... created this particular Hexing magic!</p><br/><p>Without the World Essence, it would have taken Meng Hao a very, very long time to do something like this, and would have required constant research and contemplation. But now, the World Essence almost seemed to make time move differently; it was as if 10,000 years passed by for Meng Hao with a single thought, benefiting him with all of the understanding he would come to in such a time!</p><br/><p>As he continued to analyze and ponder, screams echoed endlessly within the minds of the Outsiders, and they knew that the motes of light that were the World Essence were being uncontrollably absorbed by Meng Hao.</p><br/><p>In the blink of an eye, 30,000 motes of light had been sucked into him.</p><br/><p>His powers of deduction became more profound, and he could analyze things faster. His eyes gleamed so brightly that anyone who could actually see him would be shocked.</p><br/><p>It was at this point that an aura of enlightenment began to rise up from him, to merge with Heaven and Earth, as if he were becoming one with the world!</p><br/><p>This type of enlightenment was something that all cultivators dreamed of. It was... Dao enlightenment!</p><br/><p>“NO!!” screamed the Outsider Dao Sovereign, eyes flashing with madness. Suddenly, his body collapsed, spreading out into the starry sky to form a crimson sea of blood, upon which raged black flames.</p><br/><p>The red and the black mixed with each other, turning into violet. This was apparently some sort of spirit dissolving grand magic; the Outsider Dao Sovereign was willing to abandon his fleshly body and his Dao foundation, to burn all of the power of his Nascent Divinity, to turn into a sea of flames that swept magnificently toward Meng Hao.</p><br/><p>Meng Hao did nothing to dodge or evade. His eyes shone with a strange light as the sea of blood surged toward him. Then, he waved his finger.</p><br/><p>That wave of a finger didn’t unleash the Eighth Demon Sealing Hex, and yet a powerful ripple spread out, causing the sea of blood to lurch to a stop. However, it took only a moment to recover. Rumbling sounds echoed out as violet waves roared, sending blistering heat out toward Meng Hao, along with the power of extermination.</p><br/><p>“DIE!” screamed the Outsider Dao Sovereign from within the sea of blood, causing a massive pressure to erupt out, spreading out in all directions and then crushing down onto Meng Hao.</p><br/><p>This insane attack by the Outsider Dao Sovereign converged all of his willpower, and burned his cultivation base away in exchange for an attack that caused even Meng Hao to feel a twinge of fear.</p><br/><p>A boom could be heard, and blood oozed out of the corners of Meng Hao’s mouth. His entire body was on fire as he staggered backward. And yet, he seemed to be completely ignoring that fact; a blankness could now be seen in his eyes, a blankness that came from deep and profound contemplation.</p><br/><p>It was almost as if he didn’t see the danger which was right in front of him.</p><br/><p>“DIIIIEEEEEEEEE!” The sea of blood transformed into a huge face, which was none other than that of the Outsider Dao Sovereign. He glared at Meng Hao with intense hatred, howling as the sea of blood suddenly began to swirl, emanating an even more terrifying aura than before as it shot toward Meng Hao.</p><br/><p>Meng Hao sat within the sea of flames, frowning, his eyes filled with the gleam of augury.</p><br/><p>“No, it’s not just a simple Hexing magic,” he muttered. “The Essence... is hidden within the Hexing magic...?” Suddenly, Meng Hao’s eyes glittered.</p><br/><p>“I need more World Essence!” Completely ignoring the sea of blood bearing down on him, he suddenly took a step forward.</p><br/><p>As his foot descended, the entire world seemed to superimpose upon itself. Then it split apart, as if he had walked into a different dimension, as if he were no longer within the Mountain and Sea Realm.</p><br/><p>He was now outside of the sea of blood, which crashed onto his former position with a loud rumbling sound. At the same time, more of the World Essence surged toward Meng Hao.</p><br/><p>10,000. 20,000.... In the blink of an eye, he had absorbed more than half of the World Essence!</p><br/><p>His mind was now roaring, and his powers of deduction exploded, as he mentally broke apart the Eighth Demon Sealing Hex, until finally... he saw the Essence of the Hexing magic!</p><br/><p>“Space....” A tremor ran through him.</p><br/><p><strong>Chapter 1345: Hexing Magic Essence!</strong></p><br/>\n</div>"}