{"title": "Chapter 1350: Full Scale Counterattack!", "id": 1350, "volume": 14, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-1350-full-scale-counterattack", "volume_title": "Volume 14", "body": "<h1>Chapter 1350: Full Scale Counterattack!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 1350: Full Scale Counterattack!</strong></p><br/><p>What was kneeling was the body of a Paragon, not the soul.</p><br/><p>However, that act of kneeling caused all of the Outsiders in the Mountain and Sea Realm to go deathly quiet. Their minds went completely blank, as blank as death.</p><br/><p>With the exception of the professional soldiers or the especially warlike individuals, most of the Outsiders, regardless of which tribe they came from, were fighting for their homes, their people, and especially for more cultivation resources.</p><br/><p>Therefore, the collapse of the 1st Heaven caused the minds and hearts of all the Outsiders to tremble. They were left blank and terrified, and filled with regret. Their home... was gone.</p><br/><p>Their fellow tribe members were dead....</p><br/><p>There was no point to the war anymore. Given enough time, their thirst for revenge would eventually spur them to hold nothing back in fighting. However, before that could happen, their Paragon had been enslaved, a huge blow that crushed their will and reduced their morale to the freezing point.</p><br/><p>Off in the distance, the fleeing Imperial Lord suddenly stopped and forced himself to look back. What he saw was the towering 30,000-meter tall Paragon kneeling in front of Meng Hao, and his mind reeled.</p><br/><p>“Defeated....” he muttered in a hoarse, despairing voice. The events leading up to the destruction of the 1st Heaven had caused him to fly into a rage, and even put his life on the line in a mad attempt to intervene. Although most of the other Outsiders had been at a complete loss, he had been quick to regain control of his thoughts and jump on the offensive.</p><br/><p>But then he watched their Paragon be enslaved, and he was filled with bitterness. He even regretted his decision to flee, and felt guilty. With all the complicated thoughts assailing him, all the Outsider Imperial Lord could do was chuckle bitterly.</p><br/><p>A strange expression could be seen on Sea Dream’s face as she looked at the enslaved Paragon. Although she was excited, she couldn’t help but sigh. She was also a Paragon, someone who stood at the pinnacle of Heaven and Earth, so she knew how difficult a task it must have been for that mysterious figure to force Eegoo to yield.</p><br/><p>In sharp contrast to the Outsiders were the cultivators of the Mountain and Sea Realm. After a brief moment of silence, they exploded out with an exuberance that could shake Heaven and Earth. It started in the Fourth Mountain and Sea and quickly spread all the way to the First and Ninth Mountains and Seas. Soon, the voices of the entire Mountain and Sea Realm were crying out in a powerful voice.</p><br/><p>“Victory belongs to the Mountains and Seas!”</p><br/><p>“Victory belongs to the Mountains and Seas!!”</p><br/><p>“Victory belongs to the Mountains and Seas!!!”</p><br/><p>It was impossible to say who said it first, but soon those words rang out throughout the entire Mountain and Sea Realm. Everything began to shake as orders were delivered to begin fighting back against the Outsiders.</p><br/><p>In all of the Nine Mountains and Seas, the cultivators counterattacked!</p><br/><p>Few of the remaining Outsiders possessed a will to fight. Their eyes were blank, and they trembled in fear. The 1st Heaven was destroyed. Their home was gone. Their tribe members were dead. Their Paragon had been enslaved. Everything that had happened filled them with complete despair.</p><br/><p>When the Mountain and Sea Realm began to fight back, and the excited battle cries rose up, Meng Hao looked at the kneeling 30,000-meter-tall Paragon, and his eyes filled with a complicated expression. He sighed.</p><br/><p>Then, he clasped hands and bowed deeply.</p><br/><p>That bow was a bow toward the unyielding soul of the Paragon. For a moment, he felt pity that Eegoo’s soul had been erased, but then the complex look in his eyes was replaced with coldness. When experts were enemies, they could respect each other, but they could never back down!</p><br/><p>Sometimes, the only option was death!</p><br/><p>One party died, or the other died. In war, pity could not be tolerated, nor could compassion, and especially not weakness. Besides, this battle... was only the beginning.</p><br/><p>“In any case, I don’t need your soul. I just need your Paragon body. Although that makes your battle prowess slightly lower, you’re still a Paragon!” Meng Hao flickered into motion, flying up to land atop the 30,000-meter Paragon’s head. Now that he had control of this body, a mere thought on his part could make the Paragon puppet do anything he wished.</p><br/><p>In the same moment that Meng Hao landed on the head of the Paragon puppet, the puppet slowly rose to its feet, energy surging out in all directions.</p><br/><p>As of this moment, Meng Hao was completely shocking in every aspect. Not only did his cultivation base place him at the highest level in the Mountain and Sea Realm in terms of battle prowess, now that he had a Paragon puppet, he was at the absolute pinnacle.</p><br/><p>However, none of that could compare to what Meng Hao himself now symbolized. After destroying the 1st Heaven, and enslaving a Paragon, he... was now the symbol of the spirit of the Mountain and Sea Realm!</p><br/><p>His eyes glittered as he turned to look at Sea Dream, toward whom he immediately clasped hands and bowed. Looking at her caused him to feel quite regretful and apologetic. Voice soft, he said, “Senior Sea Dream, back then... I was ignorant and naïve. I was only thinking about myself, not the Mountains and Seas. Senior, I hope that you aren’t too deeply offended by what I said.”</p><br/><p>With that, he clasped hands and bowed again. Just as he had said, years ago he hadn’t cared much at all about the Mountain and Sea Realm, which led to his altercation with Sea Dream after the events in the Windswept Realm.</p><br/><p>Now that he thought back to that time, he realized that he had indeed spoken a bit too harshly. [1. Meng Hao spoke some harsh words to Sea Dream in chapters 1151 and 1152]</p><br/><p>Sea Dream smiled slightly, which was something she rarely did. It made her look like a beautiful, blooming peony flower. Warmth and kindness filled her gaze as she looked back at Meng Hao. To her, he was merely a member of the younger generation, a child really.</p><br/><p>“You just go take care of whatever it is you need to,” she said.</p><br/><p>Meng Hao nodded, and without any further hesitation, sat down cross-legged and closed his eyes. Then, he sent out some divine will, causing the Paragon puppet’s eyes to shine, almost as if they were Meng Hao’s.</p><br/><p>After sending his divine will into the Paragon puppet, it was like his own body, completely under his control. At the same time, it emanated the terrifying aura of a Paragon.</p><br/><p>Of course, Meng Hao himself had divine sense that was eighty percent as powerful as a Paragon's, which ensured that he could easily unleash eighty percent of the power of Paragon Eegoo. With a single step, the Paragon puppet stepped across the starry sky to appear in front of the Outsider Imperial Lord.</p><br/><p>“Acknowledge alliegance, or perish!” Meng Hao said through the mouth of the Paragon puppet. The voice crashed out, echoing throughout the Mountain and Sea Realm.</p><br/><p>The Imperial Lord laughed bitterly as he looked at the Paragon puppet version of Eegoo standing in front of him, a Paragon who had once been one of his own people. His eyes gleamed with madness, and even a desire for death. If Paragon Eegoo would rather die than yield, then as an Imperial Lord, he would not make the same mistake he had before in backing down.</p><br/><p>“You destroyed my home! You killed my people! And now you think I'm going to acknowledge alliegance to you? Even if I perish, I’ll turn into a vengeful ghost that will curse your Mountain and Sea Realm for generations to come!” The Imperial Lord threw his head back and laughed, unleashing the explosive power of his cultivation base and causing six vortexes to appear behind him.</p><br/><p>A strange expression appeared on Meng Hao's face as he stared at the Imperial Lord for a moment, then said, “You words seem very righteous, very unyielding, and very hateful....”</p><br/><p>The thunderous boom of Meng Hao’s voice caused the Outsider Imperial Lord’s energy to suddenly falter.</p><br/><p>Without waiting to engage in any more rhetoric, Meng Hao sent the Paragon puppet’s hand out, and immediately, the starry sky around the Imperial Lord was shattered. The Imperial Lord's body began to vibrate, and blood sprayed out of his mouth. He fell back, waving his hand to send countless magical items flying out. The six vortexes behind him shot through him toward Meng Hao, who sent the Paragon puppet’s fist flying out in a fist strike.</p><br/><p>“It seems you’ve forgotten that the invaders in this war came, not from the Mountain and Sea Realm, but from the 33 Heavens!” As Meng Hao’s voice echoed out, the fist crushed the void and shattered the starry sky. All of the magical items were reduced to powder, and the six Essence vortexes were destroyed. Then the blow landed on the Outsider Imperial Lord, whose legs exploded. Having escaped death, he once again fell back in retreat.</p><br/><p>“This war wasn’t the idea of the Mountain and Sea Realm, it was yours!” How could Meng Hao possibly let this Outsider off the hook? His words crashed out like thunder, causing the Imperial Lord’s mind to tremble, as he realized that Meng Hao's words, despite being difficult to accept... were true.</p><br/><p>This war really had been instigated by the 33 Heavens, and they really were the invaders.</p><br/><p>“Yeah, well so what?!” howled the Imperial Lord. “We haven’t even destroyed the Mountain and Sea Realm yet, but then you went and wiped out our people!? You’re the ones who exterminated our home first!!” No longer concerned about whether what he said made sense, he transformed into his true form, a gigantic lizard thousands of meters long and covered with raging black flames. Then, he charged toward Meng Hao and the Paragon puppet. “The Mountain and Sea Realm is definitely going to be wiped out!!”</p><br/><p>“As for whether the Mountain and Sea Realm will be wiped out,” Meng Hao replied coolly. “I can't say for sure. But what I do know is that you... are going to die, right now!” With that, the Paragon puppet’s hand performed an incantation gesture, then waved out, causing the full power of a Paragon to explode out, sealing the entire area like a cage and then crushing down with incredible pressure.</p><br/><p>Rumbling sounds echoed out as the Imperial Lord began to shake. Blood oozed out of his eyes, ears, nose, and mouth, and the black flames which covered his body were extinguished. His scales exploded, and he screamed bitterly. Then, the pressure caused his entire body to explode as he was completely killed!</p><br/><p>After killing the Outsider Imperial Lord, Meng Hao felt weak; personally controlling the Paragon puppet was quite draining. As he sat there on the Paragon puppet’s head, his eyes suddenly snapped open, and he looked down at the Mountain and Sea Realm. A bit of divine will sent the Paragon puppet down into the Mountains and Seas. Wherever it appeared, the Outsiders who saw it were filled with despair. Some felt insanity, some felt bitterness. They were now fighting a hopeless fight and apparently... there was nothing they could do about it.</p><br/><p>They were the invaders, but now they were feeling what it was like be the invaded. That... was the double-edged sword which is war.</p><br/><p>“This first battle with the 33 Heavens can now be concluded!”</p><br/><p>The most powerful Outsider remaining from the 1st Heaven was Long Linzi, who was fighting with Patriarch Reliance. As of this moment, he trembled and began to flee. Snorting coldly, Patriarch Reliance immediately gave chase.</p><br/><p>The Outsiders from the 1st Heaven were in complete chaos.</p><br/>\n</div>"}