{"title": "Chapter 1355: Paragon Xuan Fang!", "id": 1355, "volume": 14, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-1355-paragon-xuan-fang", "volume_title": "Volume 14", "body": "<h1>Chapter 1355: Paragon Xuan Fang!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong></strong></p><br/><p>[/expand]</p><br/><p>The rumbling was so intense that the heavenly bodies shook. The scorpion pincer retracted, then appeared once again in another area off to the side. More booms could be heard as a second huge rift was ripped open.</p><br/><p>Meng Hao watched silently, as did all of the other cultivators of the Mountain and Sea Realm. Their cold eyes were fixed on the starry sky up above as they awaited orders from Paragon Sea Dream.</p><br/><p>The gigantic scorpion pincer appeared again and again, and soon ten rifts had been slashed open into the barrier in the starry sky. The strangest thing was that the ten rifts did not connect at all.</p><br/><p>With every slash of the pincer, it seemed to grow weaker, until the final slash was delivered, whereupon a blast of energy surged out from the pincer.</p><br/><p>Everything trembled, and a huge shockwave surged out, although it seemed as if the source of that blast was actually beyond the barrier itself!</p><br/><p>After all, the scorpion pincer itself was more than 30,000 meters long, so it could only be imagined how gigantic the scorpion itself was!</p><br/><p>The aura emanating from the scorpion pincer spread out in all directions, and the pressure of a Paragon superseded that of Heaven and Earth, dispersing everything in its path as it descended toward the Mountain and Sea Realm, a will unto itself!</p><br/><p>“Heathens of the Paragon Immortal Realm, henceforth all of ye... shall cease to exist!</p><br/><p>“All Immortals shall perish!</p><br/><p>“All Immortal bloodlines will be cut off!</p><br/><p>“All memories will be expunged!”</p><br/><p>Massive rumbling echoed out in concert with the voice, causing the Mountains to shake and the Seas to seethe. The minds of all the cultivators in the Mountain and Sea Realm shook.</p><br/><p>That was the will of a Paragon, and not that of a 7-Essences Paragon.... No, this was... an 8-Essences Paragon!!</p><br/><p>The Mountains and Seas were trembling. The lands shook and mountains were rocked as Heaven and Earth crumbled. The enormous scorpion pincer gradually retracted, as if the Outsider Paragon were temporarily incapable of actually descending into the Mountains and Seas, but first needed to widen the passageway before its true form could come.</p><br/><p>As the pincer pulled back through the huge 3,000-meter rift it had just opened, a sea of countless Outsiders began to swarm through. Their eyes blazed with greed and a thirst for blood, and their laughter rang out in all directions.</p><br/><p>At the same time, countless Outsiders began to fly out from the other rifts.</p><br/><p>“The flesh and blood of Immortals.... I haven’t savored that flavor for a long, long time....”</p><br/><p>“Immortals, huh? So this is the Immortal World we’ve been suppressing for so many millennia? They actually managed to wipe out the 1st Heaven?”</p><br/><p>“Hahaha! Attack!!”</p><br/><p>Screams that could twist the mind and heart echoed out as huge waves of Outsiders poured out. For the most part, they looked completely different than ordinary cultivators. Some had scaly skin, others had bone spurs protruding out all over their bodies. Some of them even looked like enormous crocodiles.</p><br/><p>There were Outsiders that had human bodies but the heads of lions, and others with even more bizarre appearances. At a single glance, it was possible to tell that these beings were from outside the Mountain and Sea Realm.</p><br/><p>When Meng Hao saw them pouring through the rifts, he frowned, and wondered why the Paragon Immortal Realm had ever ruled over Lower Realms filled with Outsiders such as these.</p><br/><p>It was at this point that Paragon Sea Dream’s icy voice suddenly rang out in the minds of all Mountain and Sea cultivators.</p><br/><p>“Fight!”</p><br/><p>It was one word, but it was a word that called for a battle to the death. The resolve of the cultivators exploded like a whirlwind, and their hearts burned as if with fire.</p><br/><p>Rumbling could be heard as the cultivators on the first line of defense attacked, unleashing their most powerful divine abilities. The starry sky trembled as the might of millions of cultivators exploded out. Instantly, the starry sky was not black, but instead filled with a riot of dazzling colors.</p><br/><p>Countless divine abilities and magical techniques emanated scintillating colors, and were backed by the will and resolve of all the cultivators of the Mountain and Sea Realm. It was like an ocean of magic that surged with fatal power toward the Outsiders. And this... was just the first showdown!</p><br/><p>The fighting exploded in an instant. The Outsiders also unleashed their most profound divine abilities, some of them moving so fast they were mere blurs. Others laughed maniacally as they grew to incredible sizes, using their natural armor-like flesh to fight back. Some even transformed into multiple clones.</p><br/><p>However, there were quite a few who were immediately cut down by the raging ocean of magic that blasted into them. This time, the Mountain and Sea Realm had entered its Siege Mode, and the spirits of its cultivators burned with passion. They were completely and utterly prepared for battle.</p><br/><p>The ocean of magic swept over the Outsiders, and even as it was destroyed, another salvo surged out from the First Mountain and Sea.</p><br/><p>As Meng Hao sat cross-legged in the sun, he refrained from attacking. This precious treasure of the Mountain and Sea Realm could not be squandered casually. It was impossible to say exactly how long the war would last, and Meng Hao wanted to ensure that each attack he unleashed… would inflict maximum damage on the invading 32 Heavens.</p><br/><p>His Paragon puppet was also waiting to attack. Currently, the only fighters on the field of battle were the cultivators from the First Mountain and Sea.</p><br/><p>Rumbling sounds echoed out as the initial advance of the Outsiders was shoved back, making it impossible for them to descend into the Mountain and Sea Realm. However, despite being sent spinning back by the ocean of magic, the number of Outsiders was vast, and more and more of them poured out of the ten rifts. Furthermore, additional rifts were now opening up.</p><br/><p>As the forces of the Outsiders swelled in number, they were slowly able to push back against the ocean of magic unleashed by the Mountain and Sea Realm.</p><br/><p>Meng Hao frowned in thought. Then, the sun’s spell formation began to flicker with light as he prepared to launch an attack. However, it was at this point that a cold snort echoed out from within the rift, and a new figure appeared.</p><br/><p>It was a lion-headed Outsider, and as soon as he appeared, he exploded with the aura of an Imperial Lord. As he advanced, his aura transformed into an enormous circular shield of light!</p><br/><p>The shield of light grew larger and larger as he moved in front of all the others, until it was over 9,000 meters in diameter. This was what the Outsider Imperial Lord used to defend against the ocean of magic.</p><br/><p>Meng Hao’s eyes glittered, and without hesitation, he took action. The boundless light of the sun became the most dazzling light on the battlefield. A beam of light shot out, and if you looked closely, within that beam of light was a glowing arrow!</p><br/><p>The arrow pierced through the void to appear directly in front of the lion-headed Imperial Lord. His light shield instantly shattered, and the Imperial Lord’s face fell. Pupils constricting, he shot backward. However, the arrow’s speed hadn’t been reduced in the slightest.</p><br/><p>Just as the arrow was about to slam into him, the lion-headed Imperial Lord threw his head back and roared. At the same time, his body rapidly expanded and changed shape into that of a golden lion. He then butted his head into the light shooting toward him from the sun.</p><br/><p>Intense, blistering light radiated out from the Outsider Imperial Lord, and he let out a miserable shriek. Just when he was on the verge of being wiped out of existence, he suddenly spit a marionette out of his mouth. It was hard to tell whether the marionette was laughing or crying, and apparently, it was taking the place of the Outsider Imperial Lord’s soul as it cracked into pieces.</p><br/><p>After the marionette was destroyed, the Outsider Imperial Lord’s body grew blurry and then vanished. When he reappeared near the border of the one of the rifts, he was trembling, and was clearly much weaker than before. Enraged, he turned to look in the direction of Meng Hao and the sun.</p><br/><p>Meng Hao’s expression was calm as he snorted coldly. At the same time, the Outsider Imperial Lord suddenly looked back in the direction of his destroyed marionette to find that the light arrow had reformed. It then shot forth at incredible speed, and before he could react, it stabbed into his forehead.</p><br/><p>A boom rang out, and a look of disbelief flashed across his face in the moment before he exploded. In the lasts moments before he died, the only thing that filled his mind was disbelief that he was dying after having just stepped foot onto the battlefield. Then, he was completely wiped out of existence!</p><br/><p>Countless cultivators within the Mountain and Sea Realm saw this happen, and they were instantly enlivened.</p><br/><p>Upon the death of the lion-headed Imperial Lord, another astonishing stream of aura pierced out from within one of the rifts. It was a second Imperial Lord who moved so fast it was difficult to see him. Only when he stopped moving was it possible to see that his appearance was not humanoid. Instead, he was a huge ant, thousands of meters tall.</p><br/><p>He was pitch black and emanated a boundless black glow that fought back against the ocean of magic. Even as he looked over warily at Meng Hao, a third Imperial Lord appeared!</p><br/><p>Shockingly, this third Imperial Lord... was not an Outsider, but a cultivator. He emanated profound ancientness, and wore a long white robe. He was an old man who had apparently lived for countless years, and emanated boundless cultivation base ripples. As soon as he appeared, he looked down at the Mountain and Sea Realm with a complex expression. Seemingly reminiscent, he finally snorted coldly, waving his right hand to cause a crimson flame phoenix to appear, fully 3,000 meters long. Instantly, it shot toward the ocean of magic.</p><br/><p>Two Imperial Lords were now attacking simultaneously, causing the ocean of magic to begin to vibrate. After a long moment, just when it seemed as if it couldn’t sustain itself for any longer, the invading Outsiders built up enough troops to unleash a magical ocean of their own.</p><br/><p>Meng Hao quickly prepared the sun’s spell formation for a second attack. In the blink of an eye, another light arrow shot out, toward... the white-robed Imperial Lord who was... clearly a cultivator who had originally come from in the Mountain and Sea Realm.</p><br/><p>However, it was at this point that the starry sky trembled. Everything shook as a huge hand stretched out from one of the rifts. It was completely golden, and covered with boundless fur that floated about elegantly. That hand stretched out with incredible speed to simply grab the second light arrow Meng Hao had just shot from the sun!</p><br/><p>The hand clenched down viciously, and the light arrow shattered.</p><br/><p>Meng Hao’s eyes flickered. He hadn’t used the full power of the sun in his previous two attacks, only about sixty to seventy percent. Even still, the only type of person who could crush those arrows would be a Paragon!</p><br/><p><strong>Chapter 1355: Paragon Xuan Fang!</strong></p><br/><p><strong>Note from Deathblade:</strong> Interestingly the Paragon isn't actually named in the chapter, only the chapter title.</p><br/>\n</div>"}