{"title": "Chapter 1363: Sealing a Paragon!", "id": 1363, "volume": 14, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-1363-sealing-a-paragon", "volume_title": "Volume 14", "body": "<h1>Chapter 1363: Sealing a Paragon!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong></strong></p><br/><p>[/expand]</p><br/><p>In the First Sea, the Mountain and Sea cultivators were already engaging in fierce fighting with the Outsiders. Unending rubble from the shattered 2nd Heaven rained down, some of it piercing down to land on the Mountain and Sea below it, and even the planets there.</p><br/><p>Incredible casualties resulted!</p><br/><p>The war was no longer balanced.... The situation was now anything but that, and it was all because of... Xuan Fang!</p><br/><p>The reason why the Mountain and Sea Realm was now in such an unfavorable position was because of... Xuan Fang!</p><br/><p>As of this moment, a cold smile could be seen on Xuan Fang’s mouth as he sped along, intent on leaving the Mountain and Sea Realm. His plan had worked. Meng Hao was destined to die, and the Mountain and Sea shield was broken. Of course, he had been seriously injured in the process, and he now needed to leave the Mountain and Sea Realm to recover. Control of the war effort would now be handed over to the other Paragon.</p><br/><p>However, even in the moment in which he hoped to flee, a rotting, skeletal figure appeared, which was Meng Hao. Laughing a grating, maniacal laugh, he smiled and said, “Paragon Xuan Fang, you threw yourself out as bait, so why are you in such a hurry to leave? You might be a Paragon, but you can’t just waltz in and out of the Mountain and Sea Realm whenever you feel like it.” Even as he spoke, Meng Hao reached out and crushed some unknown object with his right hand. Simultaneously, the Lightning Cauldron appeared above his head, and electricity danced. Rumbling echoed out as Paragon Xuan Fang, regardless of whether he was willing or not, suddenly switched locations with Meng Hao. It was Form Displacement Transposition!</p><br/><p>As soon as he reappeared, he frowned and let out a cold harrumph. However, only a moment later, his face fell as he realized that a thick mist was spreading out around him.</p><br/><p>“Gloompearl!! You can use Gloompearls too!?!? Right, your aura of death!!” Xuan Fang’s face fell as he remembered that, when fighting with Meng Hao earlier, Meng Hao had taken one of the Gloompearls. Xuan Fang had forgotten that point, but now it was obvious what was happening. Normally, Gloompearls could only be used by means of a special technique. The only way someone unfamiliar with that technique could activate a Gloompearl was if they had an intense aura of Death surrounding them.</p><br/><p>And of course, that was exactly the state Meng Hao was in, enabling him to use the Gloompearl!</p><br/><p>Paragon Xuan Fang’s heart began to pound, and his expression was very grim.</p><br/><p>The mist seethed, completely locking him in place where he was. He would now need a full quarter hour before he could move.</p><br/><p>“Well, you won’t be able to cause a big stir within a quarter hour. Let me guess, Meng Hao. You plan to give your last bit of life to Sea Dream. Or perhaps use the Eegoo puppet to try to kill our other Paragon. Right?</p><br/><p>“You won't succeed in a mere quarter hour.” Even as his sinister voice echoed out from within the mist, the 6th Heaven's Paragon suddenly stepped down into the starry sky. After glancing in the direction of Meng Hao and Xuan Fang, he sent his cultivation base power out to block Sea Dream and the Paragon puppet.</p><br/><p>He actually wasn’t worried about Xuan Fang; he was concerned about Sea Dream and the Eegoo puppet. As far as Meng Hao went, he had confidence in Xuan Fang’s methods, and was sure that Meng Hao... would soon die.</p><br/><p>Sea Dream was shaken as she looked over at Meng Hao and his intense aura of death. At the same time, Meng Hao’s divine will once again connected with the Paragon puppet, and its eyes began to glow. However, Meng Hao's divine will was rife with an aura of death, causing the puppet to also be surrounded with the same aura.</p><br/><p>In response to Paragon Xuan Fang’s words, Meng Hao merely smiled, and didn't say a word. Considering his current state, that smile looked completely ferocious. Meng Hao knew that right now, it would be impossible to kill Xuan Fang, and therefore, all he wanted to do was lock him down temporarily.</p><br/><p>In this critical moment of danger for the Mountains and Seas, the balance of the war needed to be restored. Meng Hao’s eyes shone with a strange light. With that, he extended his right hand toward the area that contained the mist, and then waved his hand slightly.</p><br/><p>As he did, a thread appeared, a horizontal thread, down below the mist. Then, Meng Hao made a second stroke with his hand, then a third, and a fourth....</p><br/><p>The four threads connected to form a circle that completely surrounded the mist. Inside that mist, Paragon Xuan Fang’s face flickered as he sensed the fluctuations of Essence.</p><br/><p>“That’s... the... the Essence of space!!”</p><br/><p>Even in the moment in which surprise filled Xuan Fang, the eyes of the other Paragon went wide. That Paragon didn't move in to help, but instead, raised a hand high up toward the 3rd Heaven, and pointed.</p><br/><p>It was in the same moment that the aura of Essence exploded out from the circle in front of Meng Hao. It was the power of Spatial Sealing!</p><br/><p>Meng Hao couldn’t use his Essence of space for a long period of time, but because he had extinguished four Soul Lamps, causing an explosive growth in his cultivation base, he was able to unleash power formidable enough to seal a Paragon!</p><br/><p>Of course, Meng Hao was not powerful enough to completely banish him. This was only a sealing, and a temporary one at that, but it would definitely last many times more than a quarter hour.</p><br/><p>“Seal!” he said, his voice grating. As it echoed out, the circle flashed with light, and began to solidify. Paragon Xuan Fang let out a maddened roar. Even as the seal was completed, he apparently burned his life force to send the circle flying out with an incredible burst of speed. It shot toward the darkness-cloaked Paragon, who quickly reached a hand out and grabbed it.</p><br/><p>Meng Hao sighed. Paragons were hard to kill, which was something he now had deep understanding of thanks to experience. However, the circle had solidified, and the seal created by the Essence of space was completed. That seal would not be easily unraveled without first spending many months working at it.</p><br/><p>Even when the seal was opened, Paragon Xuan Fang had burned his life force, and before that, had been seriously injured. Even if he was still at the Paragon level at that time, his battle prowess would be reduced by at least half!</p><br/><p>Most important was not Paragon Xuan Fang’s cultivation base, but rather, his tactics. What he had done caused Meng Hao to burn with the desire to kill him. At least trapping him for several months would prevent further unexpected situations from arising in battle.</p><br/><p>All of the cultivators and Outsiders who were fighting near the First Mountain saw what happened, and were shaken. When the Mountain and Sea Realm’s shield was broken, the balance of battle was disturbed, but now that Meng Hao had sealed Paragon Xuan Fang, everything changed, and the fighting was evening up.</p><br/><p>As for the Paragon puppet, now that it was under the control of Meng Hao’s divine sense, its eyes flickered, and it shot toward the First Sea, clearly intent on using its Paragon power to slaughter more Outsiders.</p><br/><p>His mission was... to tip the balance of battle in favor of the Mountain and Sea Realm. If the remaining Outsider Paragon wanted to save the Outsiders in the First Sea, he would have to face the combined might of Meng Hao, the Eegoo puppet, and Sea Dream.</p><br/><p>If he did that, he would definitely end up dead or seriously injured.</p><br/><p>Considering the situation, the darkness-cloaked Outsider Paragon sighed. He was not like Xuan Fang, with his crafty battle plans. Having no other options, he had to rely on his own methods, and the truth was that the moment Xuan Fang had been sealed, he had already made his decision.</p><br/><p>With the wave of a finger, the land mass that was the 3rd Heaven began to rumble as if it were about to move toward the Mountain and Sea Realm. Apparently, he was going to use the same technique as before, sending the entire 3rd Heaven in a crushing attack onto the Mountain and Sea Realm.</p><br/><p>From the look of things, he didn't even care about the Outsiders who were currently still in the 3rd Heaven. His mood had gone foul, and he chose to use his own style to fight this war. At the same time, his voice echoed out into the starry sky.</p><br/><p>“The power of a Paragon will once again be unleashed on the battlefield. I will pay any price, including the destruction of the 3rd, 4th, 5th, and even the 6th Heaven, to strike at the Mountain and Sea Realm.”</p><br/><p>As his voice echoed out, the Paragon puppet stopped in place, and a strange light began to gleam in Sea Dream’s eyes as she looked up. As for Meng Hao, he was losing consciousness, and a will of death was taking grip upon his body. He knew that he couldn’t hold on much longer, and yet he gritted his teeth and looked up at the Paragon puppet from the 6th Heaven.</p><br/><p>“Mountain and Sea Paragons,” the Outsider Paragon said, his voice ringing with determination, “hold back from fighting, and I will hold back from unleashing the land mass attack!”</p><br/><p>As his words rang out, Paragon Sea Dream’s face flickered. For a long, tense moment, she hesitated, apparently unwilling to yield, and yet, in the end, she flicked her sleeve and gave Meng Hao a meaningful look. Under the direction of Meng Hao’s divine will, the Paragon puppet fell back.</p><br/><p>The Outsider Paragon from the 6th Mountain breathed an inward sigh of relief. The truth was that he didn’t want to destroy the 3rd through 6th Heavens. He wasn’t adept at leading wars, and therefore, he simply wanted to buy time until the 7th Heaven and the others arrived.</p><br/><p>He wasn’t aware of it, but if Xuan Fang were present, he would be incensed at such tactics. Xuan Fang didn’t care about life or death, and would definitely have gone to the length of destroying the land masses in order to prevent Meng Hao from recovering. He would not have given the Mountain and Sea Realm the slightest bit of breathing room, or the slightest chance to gain an advantage.</p><br/><p>By slamming those five land masses into the Mountain and Sea Realm, it would likely destroy all of the Mountains and Seas, and would force the Mountain and Sea Realm to draw upon whatever deep reserve powers they were holding back. In that case, they wouldn’t need to wait for the 7th Heaven and the others to arrive in order to clinch a victory!</p><br/><p>For decisive people, hesitation and delay were not options. That could lead to a drop in the Outsiders’ morale.</p><br/><p>Most important of all... was that the decision of this second Paragon actually bought time for the Mountain and Sea Realm. Using the 2nd Heaven to attack had been an unexpected twist, but now, the Mountain and Sea Realm would definitely prepare for such a thing to happen again. As such, further threats of using all the other land masses themselves would be somewhat hollow, and following through on such threats, less effective!</p><br/><p>That, of course, was why Paragon Sea Dream had pretended to be so torn after hearing the Outsider Paragon’s words, and also the reason she gave the meaningful look to Meng Hao. After all, this decision was a good thing for the Mountain and Sea Realm!</p><br/><p>The war continued. Bitter fighting went on in the First Sea, but the Paragons didn't participate. Meng Hao couldn’t hold on any longer. After coughing up another mouthful of blood, he lapsed into a coma.</p><br/><p>As he fell down out of the sky, Paragon Sea Dream shot forward to catch him. The aura of death which surrounded became much thicker, and his body was rotting away. His organs, his bones, and his flesh... were all turning into ash.</p><br/><p>Grief covered Sea Dream’s face, and she was just about to begin to treat his injuries, when an ancient voice echoed out from behind her, a voice which caused her to tremble.</p><br/><p>“Let me handle this.”</p><br/><p><strong>Chapter 1363: Sealing a Paragon!</strong></p><br/>\n</div>"}