{"title": "Chapter 1396: Devil Realm World-Butterfly!", "id": 1396, "volume": 14, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-1396-devil-realm-world-butterfly", "volume_title": "Volume 14", "body": "<h1>Chapter 1396: Devil Realm World-Butterfly!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong></strong></p><br/><p>[/expand]</p><br/><p>Next, beams of light shot out from the Second Mountain, and as the Second Sea churned, a war chariot appeared, completely vicious in appearance and emanating a boundless glow, as well as ghastly coldness. Apparently, this war chariot could pierce the souls of Paragons.</p><br/><p>In the blink of an eye, the Third, Fourth, Fifth, and Sixth Mountains, and their respective Seas, all unleashed powerful resources. Some of them came from the Mountains, some from the planets themselves.</p><br/><p>Astonishingly, a completely domineering river of reincarnation flowed out from the Fourth Mountain!</p><br/><p>Soaring energy and countless roars echoed out from within the Mountain and Sea Realm, causing widespread shock among the Outsiders. From the Nine Mountains, the nine Xuanwu turtles roared forth, energy surging, eyes brimming with killing intent that caused the starry sky to tremble.</p><br/><p>It was also in this moment that, outside of the Ninth Mountain, Planet South Heaven began to rumble.</p><br/><p>Shui Dongliu’s eyes shone with a bright light. “And now, the third phase of the plan shall begin. The butterfly beneath Planet South Heaven... shall be released!”</p><br/><p>He quickly performed a double-handed incantation gesture, then threw his head back and howled.</p><br/><p>The sound echoed out, causing Planet South Heaven to tremble. It had already been on the verge of collapse, but now it completely fell apart. Massive rumbling sounds could be heard as it collapsed into clouds of rubble that spread out in all directions, revealing 100,000 motes of black light inside. Instantly, they shot out, howling with ferocity and a thirst for blood.</p><br/><p>It was as if a cage had been opened, unleashing a massive beast. Those motes of light were actually 100,000 monstrous Devils! During the catastrophe that had befallen the Paragon Immortal Realm, they had been taken captive in battle. Then, their minds were replaced and filled with an understanding of only one thing... killing!</p><br/><p>100,000 terrifying howls echoed out, and 100,000 pairs of crimson eyes burned. Originally, they had no formation or order, but then the will of the Mountains and Seas took control, sending one group toward the army of Outsiders, and the other toward the apex of the starry sky, and the Immortal God Continent.</p><br/><p>Things weren’t over yet, though. After the 100,000 Devils were released from within the rubble of Planet South Heaven, something else appeared within the darkness. It was... a butterfly!!</p><br/><p>When the butterfly flew out, it didn’t seem very large. However, in the blink of an eye, it began to grow like mad, until it was huge. Soon, it was as big as a planet, and even then, it didn't seem like it had reached its limit.</p><br/><p>The instant the butterfly appeared, the army of Outsiders erupted into pandemonium. A look of incredulity appeared on the face of the 8-Essences Paragon, and Dao Fang gasped as though his mind were being struck by lighting. The Immortal God Continent was also shaken, and when the powerful experts there saw the butterfly, their pupils constricted!</p><br/><p>“Devil Butterfly!!”</p><br/><p>“A Devil Realm World-Butterfly!!”</p><br/><p>“When the Devil Realm came, one of their World-Butterflies was supposedly destroyed. Who could ever have guessed that it didn’t actually die, but instead, was imprisoned here? Its mind was erased, and it became part of the Immortal World!!”</p><br/><p>“They... they actually want to use this World-Butterfly to... break free from the battlefield!!”</p><br/><p>“But that’s impossible! In the grand scheme of things, Devil Realm World-Butterflies are vitally important. There were only nine of them, and even if the Immortal World subjugated one, it would be extremely difficult to control!”</p><br/><p>“Wait, look closely, that butterfly... is actually dead!!”</p><br/><p>Countless voices erupted out in discussion. By this point, people were able to deduce Shui Dongliu’s true plan. He planned to use this World-Butterfly as the new version of the Mountain and Sea Realm, to pass through that tunnel to leave the battlefield!</p><br/><p>If he succeeded, then the Mountain and Sea Realm would have neither won the war nor lost it. However, it would gain a chance to survive, to develop, and to thrive once more!</p><br/><p>As soon as the butterfly appeared, it became clear that, just as people were saying, it was actually... dead. Its eyes were blank, and there didn’t appear to be even the slightest sign of life force upon it. It truly was dead!</p><br/><p>But then, the butterfly’s wings began to slowly fill with life force, and then were propelled first down, and then up.</p><br/><p>Meng Hao had long since waved his sleeve and extracted everyone from the crumbling and ruined Planet South Heaven. He now hovered in the starry sky, looking down at the ruins, a laughing-crying expression on his face as he looked at the 100,000 Devils charging into battle, and the huge butterfly.</p><br/><p>When his gaze came to rest on the butterfly itself, his heart suddenly seized. He stopped laughing, stopped crying, and even the redness of his eyes flickered. There was a familiarity to the aura on the butterfly, something that he would never be able to forget for his entire life.</p><br/><p>“That's....” A tremor ran through him. Off to the side, Fang Yu’s eyes went wide as she stared at the butterfly, shivering.</p><br/><p>“Dad... and mom!!” As Meng Hao stared at the butterfly, he could clearly sense the aura of his father, Fang Xiufeng, upon the left wing of the butterfly. Furthermore, the right wing contained the life force of his mother, Meng Li!</p><br/><p>Just as Shui Dongliu had said, his parents weren’t actually dead. In a certain way, they had been given new lives as the wings of this butterfly. Every flap of the wings of that butterfly was like an embrace shared between them.</p><br/><p>Gradually, Meng Hao caught sight of the image of his father and mother holding each other. Then they turned to look at him, their expressions warm and kind. They were even smiling, and it was a smile that caused tears to well up in Meng Hao’s eyes.</p><br/><p>By this point, he was absolutely sure beyond the shadow of a doubt that he really was sensing the auras of his father and mother!</p><br/><p>It was also at this point that Shui Dongliu’s voice echoed out again.</p><br/><p>“Mountain and Sea cultivators, come immediately to the Mountain and Sea Butterfly. Henceforth, the bloodline members of the Fang Clan are the guardians of the Mountains and Seas!” The moment Shui Dongliu’s voice rang out, the wings of the butterfly separated, whereupon a boundless gravitational force erupted out, grabbing ahold of all of the cultivators of the Mountain and Sea Realm.</p><br/><p>The instant that force wrapped around them, they were pulled from all directions toward the butterfly. In the blink of an eye, they vanished into the wings, and when they reappeared, they were in a new world.</p><br/><p>This was the new Immortal World!</p><br/><p>All of the people who were standing near Meng Hao, including Xu Qing, Pill Demon, Fatty, Fang Yu, Sun Hai, and even Patriarch Reliance, were instantly absorbed into the butterfly, to appear within that new world.</p><br/><p>As for Meng Hao, he neared, but did not step onto the butterfly itself. He remained off to the side to stand guard, to defend this world that contained his loved ones, his friends, and the Fang Clan.</p><br/><p>The butterfly began to pick up speed as it shot... toward the hole in the starry sky!</p><br/><p>Shui Dongliu, Sea Dream, Ksitigarbha, the Paragon puppet, and all of the other backup reserves of the Mountains and Seas flew in formation around the butterfly, guarding it... as it made its break toward the tunnel.</p><br/><p>It was in that exact same moment that a roar rose up from the Outsider army as they prepared to block the way. The 8-Essences Paragon took a step forward, and a vicious expression appeared on Dao Fang’s face as he hefted his staff and began his charge.</p><br/><p>However, before they could even get close, Meng Hao suddenly turned his head to look at them, and then licked his lips, causing both the 8-Essences Paragon and Dao Fang to stop in their tracks.</p><br/><p>At the apex of the starry sky, what was left of the Immortal God Continent once again continued its descent. The suns screamed forth, along with the figures inside of them, as they shot toward the butterfly.</p><br/><p>There were other powerful experts from the Immortal God Continent who also charged forth, so many that it was impossible to count.</p><br/><p>They could not permit the Mountain and Sea Realm to make a comeback. They could not allow the Mountain and Sea Realm to escape!</p><br/><p>But then, Shui Dongliu flicked his sleeve, and an obsessive gleam of determination appeared in his eyes.</p><br/><p>“Life and death will be determined in this moment!” he roared. The wills of the Eight Seas erupted forth, bolstered by the Xuanwu turtles to create a force so shocking that everything trembled. In concert with the power of the Nine Mountains, and the will of the Mountain and Sea Realm itself, a huge spell formation began to form!</p><br/><p>The Mountain and Sea Grand Aegis!</p><br/><p>As soon as the dazzling light rose up, the backup forces of the Mountain and Sea Realm began to virtually froth at the mouth as they prepared to fight the intercepting enemies, to defend the butterfly as it sped toward the tunnel.</p><br/><p>When the two sides clashed, massive booms rang out, and intense fighting began. The powerful experts from the Immortal God Continent had power to destroy the Heavens and extinguish the Earth, which they unleashed to full effect upon the backup reserve of the Mountain and Sea Realm.</p><br/><p>But then, from within the rubble of Planet South Heaven, hoarse laughter rang out in all directions, and a boundless sea of flames suddenly lit up the darkness as it shot out into the starry sky.</p><br/><p>Within that sea of flames was a face, a face that Meng Hao didn’t recognize. However, he did recognize its eyes.... It was none other than... the Essence of Divine Flame which had been suppressed beneath the surface of Planet South Heaven!</p><br/><p>“Dao Fang, you shall die!!” the face howled. Now that it was free, the Divine Flame caused everything around it to shake as it sped murderously toward Dao Fang.</p><br/><p>The Mountain and Sea Grand Aegis formed from a massive convergence of various wills, becoming a complex pattern that attempted to slaughter any of the Immortal God Continent cultivators or other Outsiders who attempted to break through.</p><br/><p>The Mountains and Seas followed the butterfly, and within the boundaries of the spell formation, Meng Hao and the other powerful experts of the Mountains and Seas provided defense. In the middle of it all was the butterfly.</p><br/><p>The combined power of the Mountain and Sea Realm was focused on defending the butterfly and getting to the tunnel.</p><br/><p>However, the real danger to them as they made their charge did not come from the Outsider army. After all, Shui Dongliu’s brutal plan had made it seem all along like the Outsider army had the upper hand. However, the truth was that while the Mountain and Sea cultivators were losing their lives, the true power and reserves of the Mountains and Seas had never been unleashed.</p><br/><p>It was harsh, but according to Shui Dongliu’s plan, everyone was expendable. Because of that, the Outsider army couldn’t so much as get close to the Mountain and Sea Grand Aegis without being destroyed.</p><br/><p>The real danger, the real reason why Shui Dongliu had been willing to sacrifice everyone in order to keep the true reserves safe... was the Immortal God Continent.</p><br/><p>Rumbling echoed out as four of their suns unleashed boundless pressure which crushed down. Within those suns were four figures, each one of which burst with the matchless power of an 8-Essences Paragon.</p><br/><p>Behind them were countless cultivators of the Immortal God Continent, who were unleashing divine abilities that no one in the Mountain and Sea Realm had ever seen before. In addition, they possessed matchless dignity and seething killing intent.</p><br/><p>In the blink of an eye, they reached the spell formation and began attacking it. Immediately, massive rumbling could be heard from the Grand Aegis as it rotated to full power. The will of the Mountains and Seas rose up, ensuring that even if the spell formation took damage, it was quickly repaired. The butterfly continued to get closer and closer to the tunnel.</p><br/><p><strong>Chapter 1396: Devil Realm World-Butterfly!</strong></p><br/>\n</div>"}