{"title": "Chapter 1410: Bronze Replaces the Heavens", "id": 1410, "volume": 15, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-1410-bronze-replaces-the-heavens", "volume_title": "Volume 15", "body": "<h1>Chapter 1410: Bronze Replaces the Heavens</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><em><strong>Book 9: The Demon Sovereign Returns; the Peak of the Vast Expanse!</strong></em></p><br/><p><strong>Chapter 1410: Bronze Replaces the Heavens</strong></p><br/><p>The Vast Expanse.</p><br/><p>Endless. Immeasurable. Perhaps it had an ending point, but up til now, no one had ever reached it, except perhaps someone who had Transcended.</p><br/><p>It was too large, and contained too many worlds and Realms. There were too many peoples within it, too many dangers. There were vortexes which contained inexplicable, indescribable forms of life, or legends which had long since been reduced to nothing more than ruins.</p><br/><p>In addition to that, there was dust, which was actually the most common sight in the Vast Expanse. Within that dust could be found corpses, rubble, even magical items. In fact, anything could be found within the dust, if you searched for it.</p><br/><p>At this moment, in some indeterminable location within the Vast Expanse, a corpse could be seen floating there. It was impossible to say how long it had been there. It was completely withered up, although it had not rotted. It wore a suit of armor which was cracked and broken, and completely gray in color.</p><br/><p>Next to the corpse was a withered-up dog, which despite appearing to be dead, apparently refused to leave its master’s side.</p><br/><p>Neither the corpse nor the armor showed any signs of life, as if they had been dead for a very, very long time.</p><br/><p>A hole had been punctured in the corpse’s bag of holding, and almost everything which had once been inside had long since scattered out into the Vast Expanse. Years ago, a woman had escaped from within, only to find that she had no idea where she was.</p><br/><p>As for exactly how the bag of holding came to be broken open, she didn't know. She only remembered that after it was opened, she was suddenly free on the outside. Then she caught sight of the person she hated more than anyone else, wearing a suit of armor that flickered dully.</p><br/><p>A moment later, a wind swept through that part of the Vast Expanse, carrying everything away. Even the woman was swept far off into the distance.</p><br/><p>As for the corpse, it also floated along within the wind. If you looked closely, you would be able to see a bronze lamp on the corpse’s forehead. When the corpse’s bag of holding had broken open some time ago, the bronze lamp didn’t drift away like most everything else inside, but instead had slowly floated over to the corpse’s forehead.</p><br/><p>In the past, that bronze lamp had changed the fate of the person who was now this corpse!</p><br/><p>Even Shui Dongliu had been unable to fathom or comprehend the details.</p><br/><p>Back when the corpse was alive, and had Soul Lamps, this bronze lamp had never made an appearance, nor did it even shine. But now that the corpse lacked any Soul Lamps at all, the bronze lamp finally appeared.</p><br/><p>Long ago, the person whose corpse this was had actually speculated that this lamp, which had changed his fate, which he had taken from an Immortal Ancient Daoist Rite temple, was possibly... a Soul Lamp belonging to some unknown individual.</p><br/><p>He wasn’t sure who, nor did he have the means to speculate. [1. The bronze lamp first appeared in chapter 809. It was the act of taking the lamp in chapter 818 that, according to Shui Dongliu, allowed Meng Hao “change his fate.” He later used it as a vessel for Divine Flame, and in chapter 960 came to the conclusion that it was a Soul Lamp of mysterious origin]</p><br/><p>Back when the bronze lamp emerged from the bag of holding, it floated out and began to fuse into the corpse’s forehead, which was something that even the corpse would never have been able to predict would happen.</p><br/><p>Time went by. Every year, the bronze lamp would sink a bit further into the corpse’s forehead. Ten years passed. Then a hundred. Then a thousand. By that time, the bronze lamp wasn't visible at all, as it had completely sunk into the corpse’s forehead.</p><br/><p>Perhaps it was because of that bronze lamp that, over the course of the thousand years which passed, not a single entity of any sort approached the corpse, but instead preferred to avoid it.</p><br/><p>Not only did the lamp preserve the corpse, it ensured that it had the chance to one day open its eyes again....</p><br/><p>At some point throughout the years, a miniscule scrap of aura had appeared on the corpse. It seemed like the aura of an Immortal, yet also resembled a Devil. It was strange, multifarious, and bizarre. Anyone who had fought in the war of the Mountain and Sea Realm would quickly identify it as... Demonic qi!</p><br/><p>It was the aura of that legendary entity from the Mountain and Sea Realm, the Demon Sovereign!</p><br/><p>This corpse was none other than Meng Hao!</p><br/><p>After being teleported away by the meat jelly, he had lapsed into unconsciousness. However, in the final moment before that had happened, images from throughout his life passed through his mind. In the end, he saw the parrot wiping away its mind. He saw the meat jelly sacrificing its life to teleport him to safety. Those images broke his heart, and left him reeling mentally. And yet, there was nothing he could do to stop them. He could only watch.</p><br/><p>Tears of blood streamed down his face. After being teleported away, and just before passing out, he had smiled, an anguished smile, a smile that contained insanity and an unwillingness to die.</p><br/><p>He would go to any lengths to recover, although he wasn’t sure how to. He thought about the Nirvana Fruit from his bloodline, and he also thought about the bronze lamp in his bag of holding.</p><br/><p>Using his last scrap of energy, he managed to pull out the bronze lamp. Then he used a unique secret magic that he had acquired from Shui Dongliu’s legacy, a technique which made it possible to possess another person’s Soul Lamp. It was an unsettling magic which even Shui Dongliu might not have remembered, and wouldn’t have trusted to work. Actually, it didn’t come from Nine Seals, but from the other part of the soul that made up Shui Dongliu.</p><br/><p>In the moment that Meng Hao unleashed the magic, he lost consciousness. After that, everything was a blank.</p><br/><p>Over the course of the thousand years, his body had withered continuously. His life force had long since faded away, and everything about him had dispersed. The only thing that remained was the bronze Soul Lamp, which continued to fuse with him. One day, when the bronze lamp was fused fully into his forehead, a Heaven-shaking, Earth-toppling change occurred within him.</p><br/><p>Rumbling sounds filled him as the bronze lamp gradually took over the position of his lost Prime Lamp. As the Prime Lamp, it then began to re-mould his qi passageways, and reconstruct his cultivation base!</p><br/><p>With each day that passed, his atrophied flesh would pulse with a bit more qi and blood. His internal organs had once been completely desiccated, but now they were recovering. A few days later, his heart thumped for the first time in a thousand years. Around him in the Vast Expanse, the starry sky vibrated, causing countless life forms hidden in the area to flee in terror.</p><br/><p>The sound of the heartbeat continued to echo out as blood flowed through his body. Gradually, that ruined blood began to recover!</p><br/><p>Soon, his body wasn’t withered anymore, and he even seemed to be breathing.</p><br/><p>His blood flowed, and the bronze lamp slowly began to burn, sending boundless green smoke throughout his body. It eventually reached his cultivation base, which caused life force to ignite within him.</p><br/><p>A powerful aura suddenly spread out which caused the Vast Expanse in the area to shake. Meng Hao had built up so much power that his eyelids fluttered, as if he would soon... open his eyes.</p><br/><p>As he grew stronger and stronger, the aura within him became more terrifying. A vortex rose up around him, a vortex that might not match up to the chaos unleashed upon the Vast Expanse by the copper mirror and parrot all those years ago, and yet, was still shocking.</p><br/><p>However, after a few breaths of time, the aura faded into weakness. Meng Hao’s body gradually grew still, and the strength faded from his eyes. He became peaceful and unmoving.</p><br/><p>Apparently, that burst of power wasn’t enough to awaken him. He needed more strength to open his eyes, more life force; at the moment, he simply didn’t have enough.</p><br/><p>Therefore, he needed to wait a bit longer....</p><br/><p>Gradually, his body withered up again, and his heart stopped beating. His blood dried up, and his aura faded. He now looked no different from the corpse he had been earlier. However, there was a spark of life within him that hadn’t been there before, flickering and burning ever so slowly.</p><br/><p>Time passed. Ten years later, Meng Hao was still floating out in the Vast Expanse. One day, a flying shuttle suddenly appeared.</p><br/><p>A pile of miscellaneous items could be seen piled up in the back of the shuttle, and a closer look made it obvious that most of them had been collected from within the dust that filled the Vast Expanse. There were even a few dessicated corpses among the random objects.</p><br/><p>A pretty young woman sat cross-legged in the flying shuttle, although she was dressed up in a way that made her seem older than she was. Apparently, she didn't want people to guess her true age.</p><br/><p>Her cultivation base was not weak, though; only powerful people would ever dare to fly around alone in the Vast Expanse. Based on the fluctuations which rippled out from her, she was in the Dao Realm.</p><br/><p>Behind her sat a young man, who seemed much weaker than her, and was acting very subserviently. He would occasionally look out at the Vast Expanse, his expression both curious and nervous. Eventually, his expression became one of distracted curiosity; when the young woman soon noticed, she immediately began to reprimand him.</p><br/><p>“Don’t forget this time!” she said sternly. “When we get there, you have to act tough! Put on a good show, and don't make any mistakes with your story!</p><br/><p>“Remember, you are the heir of the Yun Clan. You are a legitimate descendant of what was once the most glorious clan in this part of the Vast Expanse! The great Vast Expanse School is looking for a son-in-law for their Holy Daughter, and she’ll definitely pick you!</p><br/><p>“They are a powerful force that can even tangle with the Immortal God Continent and the Devil Realm. Supposedly, they know the secret of how to access the teleportation portal that leads out of the Vast Expanse!” The young woman’s eyes gleamed with anticipation.</p><br/><p>The young man glanced downward. Voice somewhat feeble, he said, “B-but, the Yun Clan is just a small clan. They were famous years and years ago, not now. Plus... I'm not really a legitimate descendant.”</p><br/><p>“Shut up!” the young woman barked, glaring at the young man, who quickly bowed his head deferentially. “So what! The first generation Patriarch of the Yun Clan had a marriage agreement in place with the Vast Expanse School. It doesn’t matter what year or what generation, the heir of the Yun Clan can become the beloved partner of one of the Holy Daughters of the great Vast Expanse School. The Yun Clan fell into decline years ago, and only exists in the mortal world now, so there’s no way they can fulfill their end of the marriage agreement. But who cares? I managed to buy a copy of the agreement, and I also have our clan’s precious treasure that lets me wield 2-Essences power. We’ll definitely succeed!</p><br/><p>“Besides, we won't be dealing with the upper ranks of the Vast Expanse School. Whoever we meet with, they’ll have to maintain face, so as long as the marriage agreement stands, I can just wait until a lot of people are around, then pull it out for everyone to see. The Vast Expanse School might be strong, but they also have to be reasonable. Even if they don’t abide by the agreement, they’ll still be sure to compensate us in some way!” Even as the young woman spoke, she continued to scan their surroundings. Suddenly, she turned her head to look off into the distance, where she saw a corpse floating within the dust, not too far from the flight path of the flying shuttle.</p><br/><p>“Eee? That ancient corpse is fully intact, plus it has a dog with it.” With that, she reached out and made a grasping motion, pulling Meng Hao over to her. After looking him over, her eyes glittered.</p><br/><p>“Not bad. Not bad at all. With all these corpses and other random things to help pay for expenses, this trip won’t have been a waste after all.” Smiling, she quickly threw Meng Hao and the mastiff into the back of the flying shuttle to join the other random objects and corpses she had collected from the dust of the Vast Expanse. Proceeding onward, she continued to rebuke the young man.</p><br/>\n</div>"}