{"title": "Chapter 1421: Provocation!", "id": 1421, "volume": 15, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-1421-provocation", "volume_title": "Volume 15", "body": "<h1>Chapter 1421: Provocation!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 1421: Provocation!</strong></p><br/><p>When Shangguan Hong and the others learned of what Meng Hao was doing, they did nothing to stop him. The Sect Leader contemplated the matter briefly, then chose to ignore it.</p><br/><p>As long as Meng Hao’s actions didn’t affect them or their plans, then he could do as he pleased. As long as he didn’t do something to endanger the entire Vast Expanse School... then they didn't care what he did.</p><br/><p>Furthermore, Meng Hao was careful in his actions. He only used his own forces, and he only expanded into areas that the Vast Expanse School didn't already control.</p><br/><p>As his forces began operations, he chose to go into secluded meditation in Ninth Paragon City, and would only receive sporadic updates regarding affairs on the outside.</p><br/><p>Time passed. In the blink of an eye, ten years had gone by.</p><br/><p>During that time, Meng Hao left Ninth Paragon City on only one occasion. The rest of the time, he remained in secluded meditation while his forces focused on expanding via war and other methods.</p><br/><p>Soon, the Ninth Paragon’s fame grew in the Vast Expanse as a whole. Eventually, open recruitment began, and vast amounts of new disciples swelled the ranks.</p><br/><p>During the ten years that passed, the Paragons under Meng Hao’s command were like sharp blades that cut down anyone in their path. As for the 100,000 cultivators who made up his main force, any time they fought in battle, they would overwhelm the opposing force.</p><br/><p>Although there were no Paragons among the 100,000 cultivators, they were all elite experts, and could also form together into a huge spell formation.</p><br/><p>As for the three female Imperial Lords and seven Dao Sovereigns, the ten years passed for them in relative comfort. Originally, they had been under the impression that being selected as guards for the Ninth Paragon meant that they were fated to become vessels to be drained in his cultivation practice. The truth was that throughout the ten years, the number of times they actually saw Meng Hao could be counted on a single hand.</p><br/><p>A few other important events occurred during that time.</p><br/><p>On one occasion, something like a sandstorm sprang up around Meng Hao’s location of secluded meditation. A figure appeared within that sandstorm, who spoke in an ancient, raspy voice.</p><br/><p>“You’re not the Ninth Paragon.”</p><br/><p>Even as the words echoed out, a burst of peak 9-Essences power could be detected. Meng Hao opened his eyes, his expression calm as he faced the power of the peak 9-Essences level. At that point, the Dao eye on his forehead opened up, and the Essence power of his eight Hexing magics arose. It was with three eyes that he looked out into the sandstorm.</p><br/><p>Massive rumbling echoed out into the rest of the half-planet, after which the owner of the raspy voice laughed.</p><br/><p>“But I happen to like your personality and hostility. Even more so, your focus and determination.” As his words echoed out, the sandstorm faded away, and the figure left the inner planet. When he reappeared, he was back in the desert on the surface of Planet Vast Expanse. His face was a bit pale, but his eyes glittered brightly.</p><br/><p>“Mid 9-Essences,” the old man murmured. “And yet he can face me directly, and even leave me shaken.... His control over the Dao eye is at a level of perfection!”</p><br/><p>A voice suddenly spoke out in front of him. “Many thanks.”</p><br/><p>That voice belonged to none other than the Sect Leader of the Vast Expanse School!</p><br/><p>On that one occasion in which Meng Hao left Planet Vast Expanse, he went to visit a battlefield upon which his forces fought. They were fighting a fierce group whose most powerful expert was a fierce beast at the peak of the 8-Essences level, a vicious Black Dragon. Because of it, this division of the Ninth Paragon cultivator army had been fought to an impasse.</p><br/><p>Among Meng Hao’s subordinates there was an 8-Essences Paragon, who had been so seriously injured that he had been left with no option other than to send word back to Planet Vast Expanse asking for assistance.</p><br/><p>When Meng Hao appeared, he extended his right hand and waved a finger, causing the starry sky to be crushed, and the Vast Expanse to fill with rumbling sounds. All life forms in the area trembled, including his own cultivators and the enemy horde. One by one, they dropped to their knees, as though massive weights had landed onto their shoulders. Any who refused to kneel were crushed to death in body and spirit.</p><br/><p>As for the Black Dragon, it let out a powerful shriek as its flesh and blood was flayed into a mass of blood and flesh. Terror appeared in its eyes as it prostrated itself in submission.</p><br/><p>Meng Hao turned and left. The cultivators under his command watched him leave, and their eyes began to glow with unprecedented fanaticism. That was especially true of the 8-Essences Paragon, who let out a gasp. He had seen 9-Essences experts fight before, but the terrifying display put on by Meng Hao just then made him realize that the Ninth Paragon was no ordinary 9-Essences cultivator!</p><br/><p>On the final day of the ten year period, Meng Hao sat cross-legged in secluded meditation in Ninth Paragon City. Suddenly, his eyes snapped open, and a glow like starlight could be seen. Anyone who was able to look into his eyes in that moment would feel lost, as though they were sinking eternally into the boundless starry sky.</p><br/><p>Floating outside the door of his secluded meditation facility was a white jade slip that emanated a soft light. It was that very jade slip which had awoken Meng Hao from his secluded meditation.</p><br/><p>“Has the day finally come?” he murmured. He reached out with his right hand and made a grasping gesture. Outside of the building, the white jade slip vanished.</p><br/><p>In the moment that it reappeared in his palm, his mind filled with the archaic voice of the Sect Leader’s peak 9-Essences voice.</p><br/><p>“Old Ninth... the time has come. We must head to the necropolis!”</p><br/><p>Meng Hao’s fingers closed around the jade slip. His expression was the same as ever, but a glint of light passed through his eyes. Ever since the sandstorm rose up around his secluded meditation facilities and the figure appeared with its raspy voice, Meng Hao knew that the plan the Vast Expanse School had been working on for so many years had finally reached a critical moment.</p><br/><p>As for Patriarch Vast Expanse’s necropolis, Meng Hao very much anticipated exploring it. He was curious about this supposed method left behind by the Patriarch... to Transcend from the 9-Essences level.</p><br/><p>By now, he had been the Ninth Paragon for ten years. Perhaps the Sect Leader had intentionally waited ten years so as to be able to observe him. Although Meng Hao wasn't sure of the conclusion the Sect Leader had come to after such observation, it appeared as if Meng Hao had gained approval.</p><br/><p>“Let’s go see what this Patriarch Vast Expanse’s necropolis is like. He founded the Vast Expanse School, and was himself a Transcendent cultivator, one of only a few within this starry sky.</p><br/><p>“Based on the ancient records of the Vast Expanse School, it seems... that Patriarch Vast Expanse was... the first person to ever Transcend, even before the Immortal God Continent and the Devil Realm Continent existed!” A profound gleam appeared in Meng Hao’s eyes as he thought back to many years ago, when the Mountain and Sea Butterfly was speeding through the Vast Expanse, and he had encountered that old fisherman.</p><br/><p>“He was the beginning, and I am the end. Was the beginning he referred to... Patriarch Vast Expanse? [1. Meng Hao encountered the fisherman in chapter 1404]</p><br/><p>“And was that entity within the Green Coffin Vortex also connected to Patriarch Vast Expanse somehow?</p><br/><p>“During the past ten years, I have studied the histories available within the Vast Expanse School, and apparently, Patriarch Vast Expanse existed countless, countless years ago. It seems... that he could very well be from the same era as that old fisherman.</p><br/><p>“Regardless of all that, there’s still the mysterious origin of this bronze lamp. It wasn’t until after I entered the Vast Expanse School that it began to change. That indicates there’s some sort of relationship between them.</p><br/><p>“Patriarch Vast Expanse....” After some more thought, Meng Hao unhesitatingly stepped forward and then vanished. When he reappeared, he was in midair above Ninth Paragon City.</p><br/><p>This was only his second time emerging, and even as he began to head toward the location of the main temple, he looked down at the city below and said, “Summon Su Yi and Xin Yue from Ninth Paragon City. Immediately.”</p><br/><p>As his voice echoed out, the people below trembled and kowtowed respectfully. The three female Imperial Lords hurried out and offered respectful greetings.</p><br/><p>These three women all had different personalities, and that hadn't changed in the ten short years which had passed. The cold woman was still cold, the scornful woman still failed to hide her scorn, and the warm woman was still just as warm. No different emotions could be seen on their faces.</p><br/><p>As for Su Yi and Xin Yue, they were the two 8-Essences paragons under Meng Hao’s command, the two most powerful cultivators among his forces, and he planned to take them with him on this trip to the necropolis.</p><br/><p>Ignoring the three Imperial Lords, Meng Hao proceeded forward, and soon arrived in the location with nine altars. Four people had arrived ahead of him.</p><br/><p>One was Shangguan Hong with his violet-gold robe. Upon catching sight of Meng Hao, he smiled slightly and nodded. The other three opened their eyes, and when they saw Meng Hao, they smiled. From the expressions on their faces, nothing seemed out of the ordinary at all.</p><br/><p>Beneath those four altars could be seen various 8-Essences Paragon subordinates, sitting there cross-legged. When they saw Meng Hao, they immediately rose to their feet and offered greetings.</p><br/><p>Meng Hao smiled, clasped hands, and then sat down cross-legged on the ninth altar to wait.</p><br/><p>Before long, the other 9-Essences Paragons arrived, along with the powerful experts who were their subordinates. After all the formal greetings were extended, everyone sat down. Then, rumbling sounds could be heard as a powerful divine sense spread out, and a rift opened above the first altar.</p><br/><p>An old man strolled out from within the rift; he was tall, and had long, flowing white hair. His appearance instantly caused incredible pressure to weigh down.</p><br/><p>This was none other than the Sect Leader of the Vast Expanse School, who was at the peak of 9-Essences!</p><br/><p>What had walked out just now was no divine sense clone, but rather, his true self.</p><br/><p>Shangguan Hong and everyone else, including Meng Hao, quickly rose to their feet and clasped hands. “Greetings, Sect Leader!”</p><br/><p>The 8-Essences Paragons were the most hasty of all to offer greetings. The Sect Leader nodded slightly and clasped his hands to return the greeting. Then he waved his sleeve and slowly began to speak. “The hour has arrived, ladies and gentlemen.... There is no need for me to emphasize the importance of what we are about to do. We have scouted the perimeter of the Patriarch's necropolis on numerous occasions, and know of the path that leads to the inner regions.</p><br/><p>“Our goal is to reach the absolute center of the necropolis. Hopefully, we will be able to reach that goal. If we don't, then we will at least do our best to explore and map more regions inside!”</p><br/><p>The eyes of all present began to shine brightly.</p><br/><p>The Sect Leader took a deep breath and then waved his sleeve, looking very serious. Instantly, the nine altars began to vibrate as a teleportation process was initiated.</p><br/><p>It was at this point that two beams of light shot toward the altars; it was none other than Meng Hao’s subordinates, the two 8-Essences Paragons. However, the teleportation process had already begun, making it impossible for them to approach. Anxious expressions could be seen on their faces as they looked toward Meng Hao on the ninth altar.</p><br/><p>Before Meng Hao could say a word, the Sixth Paragon on the sixth altar spoke up. He was a middle-aged man with a long, hooked nose. Voice cool, he said, “Whose people are you? You’re late. Leave.”</p><br/>\n</div>"}