{"title": "Chapter 1431: One Flees, Terrified!", "id": 1431, "volume": 15, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-1431-one-flees-terrified", "volume_title": "Volume 15", "body": "<h1>Chapter 1431: One Flees, Terrified!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong></strong></p><br/><p>[/expand]</p><br/><p>The Heavens roiled as boundless clouds and mist converged, forming an enormous hand that blotted out the sky. It was as if this hand had replaced the Heavens, radiating an enormous, destructive sealing power!</p><br/><p>Apparently, when this hand descended, it could seal one’s cultivation base, life force, soul... everything!</p><br/><p>The Heaven-shaking, Earth-shattering sight caused the Sixth Paragon’s mind to reel. An unprecedented feeling of danger rose up in his heart; he was very well aware that unless he came up with some powerful countermeasure, he would definitely die!!</p><br/><p>Within the starry skies of the Vast Expanse, 9-Essences Paragons were essentially invincible, with the exception of when they were within places like this necropolis, or perhaps when facing the old eccentrics who were peak 9-Essences Paragons. And yet, as of this moment, the shadow of death loomed large within the heart of the Sixth Paragon.</p><br/><p>He let out a miserable howl. At this critical point in the fighting, it was without hesitation that he chose his only remaining option, to... detonate one of his Essences!!</p><br/><p>The cost would be enormous. For the next ten thousand years, he would no longer wield the power of 9-Essences, but 8-Essences.</p><br/><p>He was detonating an Essence in exchange for a chance to survive. If he could just avoid this deadly sealing mark, then he could join forces with the Eighth Paragon. At the very least, his cultivation base drop would result in being able to live!!</p><br/><p>“Meng Hao!” the Sixth Paragon howled, his voice tinged with venomous rage. Even as his voice echoed out, he spread his hands wide, causing a black and white windstorm to kick up. As it spun, it turned gray, and terrifying pulses of Essence aura appeared. They were so powerful that they could cause any 8-Essences Paragon to tremble; that was how far the Sixth Paragon was willing to go in his madness to defend against Meng Hao.</p><br/><p>It was a shocking sight to see the windstorm whipping through the air toward the enormous Heavenly hand.</p><br/><p>When they slammed into each other, it was like the land below smashing into the sky above. Above the Heavenly hand was Meng Hao, clothes whipping about, murderous aura radiating out, and expression icy. Down below was the Earthly windstorm, beneath which was the maddened Sixth Paragon, his hair and clothing in disarray.</p><br/><p>BOOOOOOOOOMMM!</p><br/><p>All of this takes some time to describe, but actually happened in the space of a few breaths. In the blink of an eye, the enormous hand and the wild windstorm... slammed into each other.</p><br/><p>The resulting explosion seemed loud enough to destroy Heaven and Earth. It was as if everything in existence were being ripped to shreds!</p><br/><p>The Sixth Paragon screamed miserably as he detonated that single Essence. Although it was only one, to him, detonating that one Essence was like detonating all nine. Rumbling sounds rose up as the windstorm roared like a dragon, attempting to consume the hand.</p><br/><p>No matter how madly that windstorm screamed, though, the Heavenly hand which contained Meng Hao’s sealing mark continued to shove downward. The windstorm shattered, and the power of the Sixth Paragon’s exploding Essence transformed into a shockwave that blasted out in all directions. A huge crater opened up down below, and although the hand was not completely destroyed, four of the fingers were wiped away in the explosion.</p><br/><p>The final finger proceeded onward unhindered. However, it had lost its power of sealing. The Sixth Paragon coughed up blood, and he suddenly seemed to age by a thousand years, leaving his face pale. He felt unprecedentedly weak, but a vicious expression appeared on his face, and his eyes radiated hatred as he backed up, laughing.</p><br/><p>“You can't kill me, Meng Hao! I won’t forget the enmity which you have sown this day!!” The hatred for Meng Hao which had been building up in the Sixth Paragon had reached a pinnacle. However, even as he spoke, he borrowed force from the explosion, and drew upon all the power he could muster, to shoot toward the Eighth Paragon.</p><br/><p>Likewise, the Eighth Paragon was speeding toward him. Once the two of them joined forces, then even Meng Hao with his current level of battle prowess would not be able to fight them.</p><br/><p>Meng Hao knew that, the Sixth Paragon knew it, and so did the Eighth Paragon.</p><br/><p>Seeing that the deadly battle was about to conclude, even the Eighth Paragon sighed with relief. In his estimation, unless Meng Hao was a complete fool, he would realize that he couldn't continue fighting. If he did, he would be putting himself in a very bad position. After all, the shockwaves which would spread out because of a fight against two Paragons would eventually be detected by the other Paragons, and when that happened, the fight definitely couldn’t continue.</p><br/><p>Because of that, there was no possible way for the Eighth Paragon to be able to imagine what happened next. What he saw could not possibly have been more of a shock to him.</p><br/><p>What he had taken to be a complete and utter impossibility, was suddenly completely possible!</p><br/><p>Meng Hao hovered there in the sky, looking coldly down at the retreating Sixth Paragon, as well as the Eighth Paragon, both of whom were racing toward each other at top speed.</p><br/><p>“If I say that I’m going to kill you, then kill you I shall,” he said, voice cool and calm. His words were very similar to the ones he had spoken some time earlier to the Sixth Paragon about leaving his mark on him.</p><br/><p>As his voice echoed out, the Sixth Paragon’s heart began to pound strangely within him.</p><br/><p>It was at that point that Meng Hao lifted his right foot and then took a step forward. When his foot landed, the Essence of time erupted around him. He began to walk forward in a bizarre fashion, and as he did, the Essence of time around him began to grow stronger. In the blink of an eye, the world around him was affected, as was time!</p><br/><p>As he took his final step, he vanished. Simultaneously, time began to move backward in the area. Not even the willpower of the Sixth Paragon could do anything to resist the effect. A moment ago, he had been speeding toward the Eighth Paragon, but now it was the opposite. He still had the same look of joy on his face, and his heart was still thumping as he suddenly began... to move backward!!</p><br/><p>From the perspective of the Eighth Paragon, it looked like he was retreating. In the blink of an eye, the Sixth Paragon was pulled far away from the Eighth Paragon.</p><br/><p>Next, the explosion caused by the collision of the Essence detonation and the Heavenly hand was suddenly sucked back in. It was as if everything within the stream of time were being affected!</p><br/><p>It was at this point that Meng Hao suddenly appeared in front of the Sixth Paragon. It was as if Meng Hao could simply walk through time to any point of his choosing. The sight caused the Eighth Paragon to suddenly stop in place, scalp tingling in shock, crashes like thunder echoing in his mind.</p><br/><p>“Time... the Essence of time!! No, the Essence of time doesn’t have an aura like that. That’s... that’s....” The Eighth Paragon sucked in a deep breath. His mind spun as he watched Meng Hao appear in front of the Sixth Paragon, then reach out and touch the man’s forehead. Then his hand moved, tracing a box in the air around the Sixth Paragon.</p><br/><p>A boom rang out as the Sixth Paragon trembled; from start to finish, he was completely incapable of resisting what was happening. It was almost as if he didn’t even see Meng Hao right there in front of him.</p><br/><p>He didn't fight back at all as a field of light emanating from Meng Hao’s hand covered him. His body was sealed, his cultivation base was sealed, and his soul was sealed. Everything about him was sealed!</p><br/><p>Rumbling could be heard as the Sixth Paragon transformed into... a painting, which floated down onto Meng Hao’s palm!</p><br/><p>Meng Hao took hold of the painting. His cheeks were a bit flushed, but his eyes were icy cold as he turned and looked at the Eighth Paragon.</p><br/><p>The Eighth Paragon’s mind was spinning, and he began to tremble. A look of utter incredulity covered his face, and terror exploded up inside of him.</p><br/><p>“That’s... that's a bit of Daosource aura, in the form of the Daosource of time!!” The Eighth Paragon shook as icy coldness spread up his spine and filled his body. Then he screamed and fled.</p><br/><p>Actually, this man was well aware of how powerful Meng Hao was. Even before entering the necropolis, his fight with the Sixth Paragon had utterly proven how terrifying he was. As such, the Eighth Paragon had no desire to offend him. However, because of the orders of the golden-robed young man, Jin Yunshan, he had had no choice but to attack and try to kill Meng Hao on the bridge.</p><br/><p>He, as well as everyone else, had assumed Meng Hao to be dead. After all, nobody could fall into that abyss and survive. How could he ever have imagined that Meng Hao would still be alive!?</p><br/><p>After receiving the message from the Sixth Paragon requesting help, he had come over as quickly as possible. Upon arriving, he had witnessed a battle that was completely and utterly shocking. Then he saw Meng Hao take the impossible and make it completely possible. And he also saw something that he was sure exceeded Essence, an amalgamation of space and time that exhibited a trace of the properties of Daosource which created... a terrifying sealing mark!</p><br/><p>“Planning to run?” Meng Hao asked coolly. As soon as the words left his mouth, the Eighth Paragon’s right hand shot up, and he struck the top of his head. Rumbling sounds could be heard as his body withered up; massive amounts of life force exploded out, and he even sacrificed some of his longevity in exchange for a blinding burst of speed. In the blink of an eye, he was a huge distance away.</p><br/><p>He was afraid, terrified even. All Meng Hao had to do was say one thing, and the Eighth Paragon went all out to flee. After all, he had witnessed the fate of the Sixth Paragon.</p><br/><p>Meng Hao stared in shock. The Sixth Paragon’s method of fleeing couldn't even compare to the Eighth Paragon’s. The Eighth Paragon was gone without a trace, and obviously, it wouldn't be possible to catch up in a short period of time.</p><br/><p>Meng Hao frowned. Obviously... he terrified the Eighth Paragon so much he had simply fled.</p><br/><p>“Well, there’s no rush. I’ll settle accounts slow and steady. He can run, but I know where everyone is heading anyway.” After a moment, Meng Hao snorted coldly and then took a step forward, heading to the location he had seen when outside of the Vast Expanse: the central region where the golden-robed young man and everyone else was waiting.</p><br/><p><strong>Chapter 1431: One Flees, Terrified!</strong></p><br/>\n</div>"}