{"title": "Chapter 1455: The Ninth Paragon Arrives!", "id": 1455, "volume": 15, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-1455-the-ninth-paragon-arrives", "volume_title": "Volume 15", "body": "<h1>Chapter 1455: The Ninth Paragon Arrives!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 1455: The Ninth Paragon Arrives!</strong></p><br/><p>The Dao Sovereign frowned, looking over at the bruises on the young man’s neck, which were clearly caused by the anxious way he had ripped the jade pendant off his neck.</p><br/><p>He was the son of Patriarch Chi Feng, and had a cultivation base at the 6-Essences Dao Sovereign level. In the Vast Expanse School, he was at the peak of power when it came to people under the Paragon level. Normally speaking, he was the kind of person who would kill with decisiveness. Couple that with the fact that his father was likely to become the next Eighth Paragon, and it ensured that his status was constantly on the rise, and his cultivation experienced constant progress.</p><br/><p>People in the Eighth Sect had even begun to refer to the father and son team as collective Paragon. Although the young grandson had never earned much respect, he was of the same bloodline. Therefore, if his Dao Sovereign father wished to punish him, or even kill him, no one would say anything. However, if someone struck his son with a blow, it was the same thing as striking him, or even Patriarch Chi Feng.</p><br/><p>That was especially the case considering that Patriarch Chi Feng had reached a critical juncture in his cultivation. To the Dao Sovereign, the fact that someone had done something like this to his son was a likely indication that a competing force was trying to make a move, although with what goal, he wasn't sure.</p><br/><p>However, he didn't need to be sure.</p><br/><p>“It doesn’t matter who did this, whoever dared to provoke my bloodline will be exterminated!” The Dao Sovereign snorted coldly and waved his sleeve. His murderous aura surged, rippling out into the area, causing the hearts of the nearby cultivators of the Eighth Sect to grow cold with fear. They were all well-aware that the bloodline of Patriarch Chi Feng were now preparing to go on a killing spree.</p><br/><p>“What a pity. A Dao Realm beast, huh...? This girl must have some connections in her sect. But unfortunately for her, in the Vast Expanse School, power and influence are what really matter.</p><br/><p>“It would be easier to find a phoenix feather or a qilin horn than to find someone on Planet Vast Expanse who could compare to Patriarch Chi Feng....” Those were the thoughts running through the heads of most of the people present, and there were some who even began to radiate their own killing intent, indicating that they wished to join the Dao Sovereign in whatever action he was about to take.</p><br/><p>The Dao Sovereign seemed pleased with this. Glaring over at the young man, he said, “What are you standing around for? Take me to see whoever it was that had the gall to send a beast like that to harm a disciple of my Vast Expanse School!”</p><br/><p>As for Yan’er, he didn't even bother to look at her. He was aware of his son’s vices, and although they caused him a bit of a headache sometimes, he had the same attitude as Patriarch Chi Feng. In his view, the young man was always careful, and to cultivators, being careful was the same as being dependable.</p><br/><p>Considering the girl had a Dao Realm beast protecting her, she clearly had some connections in the sect. But to Chi Feng, such connections weren’t even worth paying attention to.</p><br/><p>All the other cultivators in the crowd felt the same as the Dao Sovereign, that it really would be easier to find a phoenix feather or a qilin horn than to find someone who could strike fear into the hearts of the members of this bloodline.</p><br/><p>The Dao Sovereign simply couldn't believe that in his son’s journey outside of the sect, he could possibly have provoked one of those existences that they did not dare to provoke.</p><br/><p>Even as he spoke, the Dao Sovereign’s energy rose up, causing everything else in the area to shake.</p><br/><p>The young man’s eyes went wide with delight. In his entire life, he had never been more scared than he had been earlier that day. He had been so close to dying that he had almost collapsed mentally.</p><br/><p>Laughing heartily, he looked over at the terrified Yan’er, eyes flickering with a depraved gleam.</p><br/><p>“Hey gorgeous, you know that dog of yours? I'm going to boil him right in front of you and then eat him. Don’t worry, I’ll give you a few bites to try.”</p><br/><p>Shaking, Yan’er bit her lip. By this point, her heart was completely overwhelmed with terror and fear. She felt alone, helpless and hopeless, and she suddenly missed her Master more than ever.</p><br/><p>“Master…” she whimpered, shivering. “Master...”</p><br/><p>“Did you just say something about your Master? Hahaha! I don’t care what your Master has to do with your pet. He dared to provoke me, he WILL die. And before he dies, I’ll make him act like a dog!” Viciousness gleamed in the young man’s eyes as his laughter rang out into the air. He was just about to lead the group off when suddenly a cold snort ripped through the killing intent of the surrounding group of cultivators. It was like a clap of thunder that caused everything to tremble on the verge of exploding.</p><br/><p>Lands quaked, and floor tiles were transformed into ash. A tempest sprang up that instantly spread out to cover the entire Eighth Sect.</p><br/><p>The Eighth Sect was huge, but even if it were larger than it was, the tempest would still fill it. At the same time, it was as if an enormous, invisible foot had stamped down onto the ground. A huge shockwave spread out, filling the Eighth Sect, causing all mountains, buildings, and lands to shake violently.</p><br/><p>In addition to the physical effects on the surroundings, all cultivators in the Eighth Sect, regardless of the level of their cultivation base or what they were doing at the moment... began to tremble. It was as if mountains were crushing down onto them, causing blood to spray out of their mouths. To their astonishment, they suddenly realized that... they couldn’t move a muscle.</p><br/><p>A roar of rage filled the world with indescribable pressure, crushing down onto the entire Eighth Sect!</p><br/><p>All cultivators were completely and utterly shocked. Their hearts filled with terror, and their minds spun. Then, off in the distance, a person approached... it was a young man in a black robe, with violet hair, who seemed to carry with him all the darkness and coldness in the world.</p><br/><p>Behind him, the Heavens trembled as if they were about to shatter. His gaze caused the air to distort, as if it were making a path for him, and beneath him, the lands shook as if they were kowtowing in worship!</p><br/><p>One person suppressed Heaven and shook the Earth. Everything twisted and distorted. This young man became the center of all attention... a figure who would stand for all eternity!</p><br/><p>Even as he appeared, a cold voice echoed out that seemed to carry infinite rage and killing intent. It echoed like a thousand thunders, shaking everything. “Who dared to harm one of the disciples of my Ninth Sect?”</p><br/><p>His voice caused countless mountains to crumble, and numerous buildings to fall. The cultivators of the Eighth Sect once again coughed up mouthfuls of blood.</p><br/><p>When an ordinary man is enraged, blood can be spattered everywhere. When a Paragon is enraged, Heaven and Earth weep!</p><br/><p>These people from the Eighth Sect had poked Meng Hao in his sensitive weak spot, enraging him. And when Meng Hao was enraged, instead of saying that Heaven and Earth were weeping, it would be better to say that the Vast Expanse was being buried!</p><br/><p>As soon as the voice rang out, colors flashed and the wind screamed. Mountains collapsed and buildings toppled. The cultivation bases of all cultivators in the Eighth Sect became unstable, and blood oozed out of their eyes, ears, noses, and mouths.</p><br/><p>“Ninth.... Ninth P-P... Ninth Paragon!!” The young man's father, the Dao Sovereign, couldn’t stop his eyes from bulging in disbelief. Blood sprayed out of his mouth, and although he couldn’t actually move, he was trembling, all the way down to his very soul.</p><br/><p>All of that was because of... a single sentence!</p><br/><p>It was as if Meng Hao represented the might of Heaven, and his word was Heavenly Dao and magical law alike!</p><br/><p>The sky above the eighth continent went dark, and the cultivators of the Eighth Sect, including their Paragons, were all trembling. Patriarch Chi Feng was also shaking, and when he looked out from his secluded meditation chamber, an expression of disbelief washed over his face as he realized he was looking at that most terrifying of figures, the person who struck fear into his heart more than anything after the trip to the necropolis.</p><br/><p>“The Ninth Paragon.... What... what is he doing here? Dammit, who provoked a terrifying jinx like that!?!?!?” Patriarch Chi Feng's eyes were already bloodshot.</p><br/><p>Everyone was trembling, except for Yan’er. She looked up, and through the tears streaming down her face, she could see someone approaching. Although she couldn’t make out his features clearly, he seemed familiar, and she couldn’t hold back from saying, “Master....”</p><br/><p>As soon as the words left her mouth, all the cultivators in the area, including the young man and the Dao Sovereign, gasped as if they had been struck by lightning.</p><br/><p>That was especially true of the young man. He sagged in place as though his bones had turned to mush. His mind reeled as the word she had just uttered echoed out.</p><br/><p>“The vessel I took a liking to is... the apprentice of the Ninth Paragon?” The young man suddenly wanted to laugh. It was almost like he was hearing the funniest joke he had ever heard in his entire life. And yet, at the bottom of his heart, he was trembling with insanity.</p><br/><p>As his mind reeled, his entire world was destroyed; the light left it, leaving nothing but darkness.</p><br/><p>He wasn’t the only one to have such a reaction. His father, the Dao Sovereign, was normally a high and mighty figure. Within the Eighth Sect, innumerable people treated him with fear and dignity. But now, in front of Meng Hao, he was trembling like a stray dog. He was gasping for breath, staring in shock, his eyes bloodshot as he turned to look at his son. If he could kill anyone at this moment, he would most definitely... tear this unfilial son to shreds!</p><br/><p>“You damned son of a bitch!” he bellowed. “Y-y-you... you screwed us all over!!”</p><br/><p>Everyone in the crowd was shaking, especially the ones who had expressed their desire to join Chi Feng’s bloodline in wiping out the enemy. Looks of shock and disbelief appeared on their faces, and suddenly they felt a bit bad for Chi Feng's bloodline.</p><br/><p>Apparently... they had the audacious gall and courage to dare to provoke one of the nine great Paragons of the Vast Expanse School.</p><br/><p>Everything was deathly silent, as people stood there in fear.</p><br/><p>Meng Hao’s true self walked into the Eighth Sect, past the crowds of people, until he was standing in front of Yan’er. As soon as his gaze came to rest on her, his eyes turned soft and warm.</p><br/><p>“I'm not your Master,” he said slowly. “But... any cultivator in the Ninth Sect could be considered my apprentice.”</p><br/><p>Everyone present breathed a sigh of relief, especially the Dao Sovereign. As long as they weren’t really Master and apprentice, then everything should be fine....</p><br/><p>Yan’er looked at Meng Hao, and although he didn't look exactly like her Master, for some reason he seemed very familiar. The warmth in his words, and everything else, filled her with the intense sensation that she really was standing in front of her Master.</p><br/><p>That feeling of familiarity caused tears to stream down her cheeks. She rushed forward and wrapped her arms around his chest, wailing. It was as if her tears could release all of the humiliation, fear, and terror that she had just experienced.</p><br/><p>The Eighth Sect was completely silent. Everyone stood there trembling, looking at that most powerful of entities gently holding a young girl in his arms. When Meng Hao looked up again, his eyes were so ice cold that they seemed capable of extinguishing the light of the sun and moon.</p><br/><p>As Yan’er wept in his arms, everyone looked on, shaking. Then, within the silence that filled the Eighth Sect, Meng Hao looked down at Yan’er’s cheek.</p><br/><p>There... was a distinct hand print!</p><br/>\n</div>"}