{"title": "Chapter 1464: Tolling in Nine Sects!", "id": 1464, "volume": 15, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-1464-tolling-in-nine-sects", "volume_title": "Volume 15", "body": "<h1>Chapter 1464: Tolling in Nine Sects!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 1464: Tolling in Nine Sects!</strong></p><br/><p>As of this moment, all nine of the Vast Expanse School sects on Planet Vast Expanse were echoing with the tolling of bells. All cultivators in the Vast Expanse School were completely shaken, and in fact, even cultivators who weren’t disciples, but happened to be visiting Planet Vast Expanse, could hear the ancient and sonorous toll.</p><br/><p>“What’s happening!?”</p><br/><p>“Wait a second... bells are tolling in the Vast Expanse School, and they sound very serious. There’s something extraordinary happening....”</p><br/><p>As Planet Vast Expanse was shaken, there were still only a few people who had realized that the tolling of the bells was actually coming from all nine of the great sects that made up the Vast Expanse School.</p><br/><p>But then, an ice-cold and completely emotionless voice spoke out to fill the First Sect, the Second Sect... and in fact, all of the sects, all the way to the Ninth Sect. The entire Vast Expanse School was filled with the same voice!</p><br/><p>“Ninth Sect. Fang Mu. Ninth Heaven!”</p><br/><p>Only six words were spoken!</p><br/><p>However, those six words were like an enormous, invisible hand pushing down onto the Vast Expanse School from above. All of the nine sects seemed as quiet as death.</p><br/><p>After a few breaths of time passed, just when it seemed the crowds couldn’t be more suppressed by the pressure, a huge commotion rose up, a clamor, a hubbub that filled the entire Vast Expanse School.</p><br/><p>“Fang Mu! Fang Mu from the Ninth Sect! I can’t believe he summoned the Ninth Heaven. How.. how is that even possible!?”</p><br/><p>“Maybe there was a mistake. Nobody can really summon the Ninth Heaven. What an absurd notion!”</p><br/><p>“How could there be a mistake? Bells are ringing in all nine sects! Fang Mu... I remember him! He was the guy who went from mortal to Immortal in ten years!” The sound of conversations formed a roar that caused the entire planet to tremble.</p><br/><p>The Ninth Heaven.... that was something miraculous that, in the entire history of the Vast Expanse School, had only been seen once before!</p><br/><p>Countless people were shaken. It was in this way that the name Fang Mu instantly came to be heard by all of the disciples of the Vast Expanse School. Then, the profound shock they felt increased as they suddenly realized... that the tolling of the bells could actually be heard everywhere on Planet Vast Expanse!</p><br/><p>“The bells are ringing in all nine sects, filling all of Planet Vast Expanse!” This fact led to widespread gasping and shock. Perhaps better ways existed to make one’s name known to all, but... for now, Meng Hao’s method was completely unprecedented.</p><br/><p>In one brief instant, the name ‘Fang Mu’ came to be fixed in all minds.</p><br/><p>Regardless of the level of cultivation base involved, Dao Realm experts, Dao Lords, Dao Sovereigns, and even Paragons, everyone on Planet Vast Expanse had eyes wide with shock.</p><br/><p>It would be impossible not to be moved, all because of... the Ninth Heaven!</p><br/><p>Throughout the history of the sect, there had only ever been one person who had summoned the Ninth Heaven, but now... there were two.</p><br/><p>At the moment, numerous streams of divine sense were pouring out from within the First Sect. On the Holy Mountain there was an Immortal’s cave, to door of which opened to reveal a handsome young man clad in a long robe. He had a unique air about him, and as he silently walked out, he looked in the direction of the Ninth Sect, his eyes glowing brightly.</p><br/><p>He was a Chosen, and within the First Sect, he held a rank that put him on equal footing with their Holy Daughter... He was the First Sect’s Holy Son. He also held the 1st place spot on the First Sect’s Vast Expanse Shrine. In all of the sects, people who were in the top 10 were extremely prominent individuals.</p><br/><p>It was the same in the Second Sect; a powerful roar could be heard as a pillar of water erupted from a deep, icy pool. It propelled a burly, bare-chested man up into the air, whose expression was both grave and defiant.</p><br/><p>“Fang Mu....” he said, looking in the direction of the Ninth Sect.</p><br/><p>In the Third, Fourth, Fifth... all the way to the Eighth Sect, none of the Chosen were very pleased about what was happening. That was especially true of the various Chosen who were in the top 10; all of them now had the name ‘Fang Mu’ fixed firmly in their minds. Not only were they unwilling to accept him, they also wanted to fight him.</p><br/><p>They were Chosen, like prize jewels of the sect. They had access to cultivation resources that others would find difficult to even imagine. Although they might not have started out as proud and arrogant people, after reaching this point, they could pass up their contemporaries as easily as flipping over a hand. Soon, they were so far ahead that when they looked back, they couldn’t see anyone following in their path. They were the people who others looked up to.</p><br/><p>They were as lonely as eagles, soaring in the Heavens. Beneath them were mere common birds who flitted around beneath the very clouds they soared above.</p><br/><p>It was a lonely existence in which the only people worthy of their gazes were the other eagle-like Chosen who were their peers.</p><br/><p>If you likened such people to eagles, then, as of this moment, it was as if a roc had appeared. The pressure weighing down on them now was something they couldn’t accept, and filled them with the desire to fight.</p><br/><p>A gale force wind was blowing through the Vast Expanse School, throwing the sects into an uproar, and causing surges of energy to appear as various Chosen powered up.</p><br/><p>Even Han Bei appeared. As she hovered there in the air, listening to the tolling of the bells, she could sense the uproar in the First Sect, and could see other cultivators flying out in shock. Everyone, it seemed, was subconsciously turning to look in one direction.</p><br/><p>The ninth continent, and the Ninth Sect.</p><br/><p>At the moment, Han Bei was perhaps the calmest person on all of Planet Vast Expanse. It was as if she weren’t surprised at all to hear the name ‘Fang Mu’.</p><br/><p>“He’s basically a 9-Essences Paragon, bullying some kids. How amusing.” She snorted coldly, and yet, was still suspicious of what exactly Meng Hao was doing with his clone. She had the feeling that there was some important plan being carried out.</p><br/><p>While the other eight sects were thrown into an uproar, the Ninth Sect was equally filled with astonishment. As that cold and shocking voice echoed out, expressions of zealous veneration appeared on their faces, as well as delight and excitement.</p><br/><p>“Eldest Brother Fang Mu!” It was hard to say who called it out first, but soon, the cry became a huge roar that exploded out into the air.</p><br/><p>“Eldest Brother Fang Mu!!”</p><br/><p>“Eldest Brother Fang Mu!!!”</p><br/><p>The title of Eldest Brother was usually used to indicate seniority within a group. But in this case, it represented the approval and acclaim of all disciples within the Ninth Sect.</p><br/><p>The only one who wasn’t saying it was Yan’er. Her eyes went wide as she suddenly realized she had a seemingly innumerable amount of Sect Uncles now....</p><br/><p>The Vast Expanse Shrine of the Ninth Sect radiated the scintillating light of the Ninth Heaven. The black clouds up in the sky churned, and something like a Heavenly howl of anger echoed from within them. More lightning built up, and yet the 7-Essences Paragon simply laughed and led the rest of the powerful experts to help Meng Hao counter the Tribulation Lightning.</p><br/><p>“Fang Mu,” he said loudly, “don’t disappoint me. Go all out and see… if you can summon the Tenth Heaven for the Ninth Sect!”</p><br/><p>In response to his words, a collective gasp could be heard from the cultivators in the Ninth Sect. Then, brilliant gleams began to shine in the eyes of one and all.</p><br/><p>The Ninth Heaven was not completely unheard-of, nor was it something that was impossible to surpass. In sharp contrast was... the Tenth Heaven. If someone could summon the Tenth Heaven, then the only thing that could happen in the future would be that others might catch up. However, no one... would be able to surpass that person’s achievement.</p><br/><p>It was a glory which would last for tens upon tens of thousands of years, and would always remain within the Ninth Sect!</p><br/><p>“The Tenth Heaven.... Eldest Brother Fang Mu, summon the Tenth Heaven!”</p><br/><p>“Eldest Brother, get that Tenth Heaven!!”</p><br/><p>As the crowds called out, Yan’er also shouted, “Master, summon the Tenth Heaven....”</p><br/><p>The Chosen from Ninth Sect, even the one who held the 1st place spot on the stone stele but was already prepared to lose it, were moved. Burying their emotions, they sighed, and soon gleams of light appeared in their eyes.</p><br/><p>If you are a roc, then please don’t bully us eagles. Go bully the other birds of prey.... That is what the current 1st place holder was thinking, and similar thoughts were running through the minds of the other Chosen.</p><br/><p>Back on the ninth level of the Vast Expanse Shrine, the thought of bullying the so-called eagles hadn’t even crossed Meng Hao’s mind. He was very interested in this Vast Expanse Shrine. Waving his sleeve, he cleared the rubble from the ninth level, causing the entrance to the tenth level to appear.</p><br/><p>Without the slightest hesitation, he proceeded forward to the tenth level... the highest level of the Vast Expanse Shrine.</p><br/><p>Almost as soon as he set foot there, a strange expression appeared on his face. He was suddenly struck with the feeling that... he really was bullying children.</p><br/><p>The test of the tenth level consisted of nothing more than a wall, which pulsed with shocking magical ripples.</p><br/><p>Visible there was a list of ten names, which were the Chosen who had taken 1st through 10th place in this Vast Expanse Shrine.</p><br/><p>After each name was a number. Behind the 1st place name was a number a bit higher than 70,000. Subsequent numbers got smaller and smaller, until the 10th place, which had a number at around 40,000.</p><br/><p>From what Meng Hao could tell, the ninth and tenth levels of the Vast Expanse Shrine were complimentary. On the ninth level, the disciple would create a divine ability, and on the tenth level, the specific strength of said magic would be assessed. The result would be a number; the higher the number, the more powerful the divine ability, and the higher the ranking.</p><br/><p>However... the stone stele in the ninth level had already exploded.... Granted, that stone stele wasn’t designed to measure the strength of the divine ability, but it was intended to help the disciple refine the divine ability, and make it more complete. Unfortunately, that stone stele... was gone.</p><br/><p>When the Vast Expanse School had created the Vast Expanse Shrine, no one could have imagined that someone would create a divine ability that would actually cause the stone stele on the ninth level to explode. Compared to a divine ability like that, this tenth level would be about as powerful as a pile of chicken ribs.</p><br/><p>“Well, I’ll give it a shot,” thought Meng Hao. “Since this is a special stone stele for testing the power of divine abilities, maybe it won’t explode like the last one.” After a moment of hesitation, his eyes began to shine, and he reached out. The nine sealing marks of the Seal the Heavens Hex began to shine brightly inside of him as he pointed his finger at the wall.</p><br/>\n</div>"}