{"title": "Chapter 1477: Provoking the Ninth Sect", "id": 1477, "volume": 15, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-1477-provoking-the-ninth-sect", "volume_title": "Volume 15", "body": "<h1>Chapter 1477: Provoking the Ninth Sect</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 1477: Provoking the Ninth Sect</strong></p><br/><p>In the starry sky some distance away from Planet Vast Expanse, were three spinning vortexes. They maintained their position there, fixed for all eternity, radiating pulses of mysterious light.</p><br/><p>The pulses of light were primarily dim and gray, as if they represented an aura of death. However, occasionally one could see radiant flashes of brightness meandering between the three vortexes.</p><br/><p>Meng Hao’s true self hovered outside of the three vortexes, hair floating about him. He was miniscule in size compared to them, and yet his energy was mighty enough that he could stand as their equal. In fact, the vortexes even vibrated with hostility.</p><br/><p>According to what Meng Hao could sense, this was one of the locations that housed a copper mirror shard. He opened his third eye, and instantly the fog that made up the vortexes was lifted, revealing the true nature of what was beneath.</p><br/><p>He saw that inside the three vortexes were three worlds. There were no cultivators, only dangerous, deadly terrain and numerous beasts the likes of which he had never seen before. There were also a few extremely brutal auras which were comparable to the 9-Essences level.</p><br/><p>The most shocking and powerful fluctuations came from the second portal. Some sort of ancient entity inside, the master of the place, who was at the peak of 9-Essences.</p><br/><p>Closer examination revealed the source of those fluctuations: it was an enormous, planet-sized... basilisk lizard!</p><br/><p>All of the lands of that world apparently existed on the surface of that basilisk, and according to what Meng Hao could sense, the copper mirror shard was inside its body!</p><br/><p>His eyes glittered as he transformed into a beam of light that shot directly toward the giant basilisk in the second vortex.</p><br/><p>Moments later, shocking booms echoed out into the starry sky.</p><br/><p>Meanwhile, back on Planet Vast Expanse, Meng Hao’s clone was once again deep in secluded meditation. Yan’er was back to her old self, with no confusion or blankness because of what had occurred. She was as lively and energetic as ever, and continued to reject all of the female disciples who came to meet her Master.</p><br/><p>However, when she was alone at night, she would look up at the moon and think about the story her master had told her about Chu Yuyan. The story stirred her heart, and gradually, was causing a resonance to form with her past life.</p><br/><p>Time passed. Meng Hao’s clone received fewer and fewer visitors, finally giving Yan’er some time to practice cultivation. However, the fact that Meng Hao was the first person to summon the Tenth Heaven in the Vast Expanse Shrine incited challenges from the Chosen of the other sects.</p><br/><p>Their method of issuing their challenge was simple. Instead of going to the Vast Expanse Shrines in their own sects, they came to the Ninth Sect.</p><br/><p>In the Vast Expanse School, there was no rule preventing disciples from doing that. In fact, such things had occurred before in the past. However, it wasn't common, and usually only happened under special circumstances.</p><br/><p>After all, challenging the Vast Expanse Shrine in a rival sect was like knocking on someone’s door and then kicking them in the shin. It was essentially a blatant provocation.</p><br/><p>However, the fact that Meng Hao had summoned the Tenth Heaven instigated a huge stir. The Chosen who qualified to be in the top 10 in all the other sects were only able to maintain their silence for a short time before exploding into action. Then, they marched into the ninth land mass... to challenge the Ninth Sect’s Vast Expanse Shrine.</p><br/><p>From the very first day, the sound of bells began to ring out. Virtually every day following that, the same thing occurred; the bell toll of the Vast Expanse Shrine filled the air.</p><br/><p>The Chosen from the other eight sects took turns. It started with the Third Sect, who sent eight people over. Each one of those eight fought their way into the top 100, and two of them made it into the top 10. The highest spot attained was only 4th place, but that was still in the top 10.</p><br/><p>Next came the people from the Fourth Sect. Then the Second Sect, and the Fifth.</p><br/><p>The result of having the Chosen from all those other sects challenge the Ninth Sect’s Vast Expanse Shrine was that of the top 30 spots, only six were held by disciples of the Ninth Sect!</p><br/><p>But then the Sixth Sect came, after which the Seventh and Eighth Sects arrived. Then, those six spots became five.</p><br/><p>The situation was still somewhat tolerable, but then the First Sect came, hell-bent on coming out on top. After their efforts, only four spots within the top 30 belonged to the Ninth Sect. In addition to that, numerous Heavens were summoned.</p><br/><p>Although no one summoned the Tenth Heaven, only the Sixth, it was still a shocking development.</p><br/><p>Of course, no one was able to take the 1st place spot from Meng Hao, but directly beneath him in the top 30 were numerous powerful experts from other sects. To the disciples of the Ninth Sect, it was a great humiliation, almost as if their sect were being trampled beneath the feet of others.</p><br/><p>It all led to quite an uproar. There were many arguments, and soon anger boiled over to the point that small-scale conflicts erupted. However, the overall situation couldn’t be changed. Chosen from the other eight sects didn't seem to care at all about their own Vast Expanse Shrines, and were instead obsessed with challenging the one in the Ninth Sect.</p><br/><p>Gradually, months went by. Roughly nine hundred of the top 1,000 spots in the Ninth Sect came to be occupied by disciples from other sects. The Ninth Sect was left with only about one hundred spots.</p><br/><p>The sect itself was powerless to do anything to stop the situation, short of physically preventing the other Chosen from coming. However, if they did that, it would seem like they were nervous, even fearful of the challenges being issued by the other sects’ Chosen.</p><br/><p>Considering how powerful the Ninth Sect was at the moment, they would never deign do that. The Chosen of the Ninth Sect wouldn’t agree to something like that; they had their pride, after all.</p><br/><p>Because of the challenges from the other Chosen, and the fact that their spots on the Vast Expanse Shrine were continuing to shrink, the Ninth Sect slipped into a state of frenzy.</p><br/><p>Virtually all of the Chosen, and even the ordinary disciples, went all-out in their practice of cultivation. They took more outside missions and participated in more trials by fire. Only by increasing the levels of their cultivation base could they earn higher spots. As they grew stronger, it was without hesitation that they went on to re-challenge their own Vast Expanse Shrine.</p><br/><p>It was as if all of the Chosen in the entire Vast Expanse School had picked the Vast Expanse Shrine in the Ninth Sect to be their joint trial by fire. Only by having their names on that list could they be truly illustrious.</p><br/><p>The trend didn’t stop. A year later, the battleground among Chosen expanded to include the top 2,000 spots.</p><br/><p>After another year, it was the top 3,000 spots.</p><br/><p>The disciples of the Ninth Sect were fuming, and conflicts broke out constantly. During the three years which had passed, people often came to pay respects to Meng Hao and ask that he do something.</p><br/><p>But Meng Hao was in secluded meditation and wouldn’t take visitors. The disciples of the Ninth Sect could understand that, but it didn’t stop the Chosen from the other sects from virtually going crazy. That was especially true of those who held spots in the Ninth Sect’s top 3,000. As for the few hundred from the Ninth Sect who remained in that group, their madness also increased.</p><br/><p>Rumors even started to spread that Fang Mu had only been trying to get famous. People claimed that what had happened three years before was a mere fluke, and that now he didn't dare to show his face.</p><br/><p>At first, such rumors were only whispered here and there. But after two years passed, and the other sects occupied ninety percent of the top 10,000 spots on the Ninth Sect’s Vast Expanse Shrine, the rumors raged like wildfire.</p><br/><p>It got to the point that the entire Vast Expanse School was talking about the matter.</p><br/><p>“What happened with Fang Mu that year was a quirk, that’s all. He's been in secluded meditation for five years and has never come out. Obviously, our challenge has him scared and hiding!”</p><br/><p>“Even if it wasn't a fluke, I heard that after he summoned the Tenth Heaven, he experienced a Tribulation. He probably got seriously injured....”</p><br/><p>“I got my hands on some verified information that Fang Mu was injured so badly his cultivation base won’t make any progress within a hundred years! In fact, it's even regressing!”</p><br/><p>More and more rumors spread. The disciples of the Ninth Sect were so protective of Fang Mu’s name that it even led to blows on some occasions. However, the Ninth Sect was only one of nine sects, so no matter what they did, it was impossible to sway the opinions of the Chosen of the entire Vast Expanse School.</p><br/><p>Eventually, most people came to believe the rumors. At the same time, it became completely commonplace for the cultivators of the other sects to come to the Vast Expanse Shrine in the Ninth Sect to earn their name.</p><br/><p>Another five years passed. Meng Hao had been in secluded meditation for ten years. The conflicts over the Ninth Sect’s Vast Expanse Shrine had reached a boiling point. Of the top 30,000 names, only 4,000 belonged to the Ninth Sect.</p><br/><p>Their own Vast Expanse Shrine had been occupied by others, leaving the disciples of the Ninth Sect feeling completely humiliated and in a state of madness. Shockingly, it reached the point where the top 10... contained only two Chosen from the Ninth Sect!</p><br/><p>Other than Meng Hao in 1st place and another Chosen in 5th place, the rest of the spots were taken by Chosen from other sects!</p><br/><p>The humiliation and the conflicts worsened.</p><br/><p>And yet, the Paragons of the Ninth Sect and all the other sects didn’t stop any of it from happening. As long as the conflicts didn't get too out of hand, then it was viewed as a way for the overall power of the Vast Expanse School to increase. That was especially true of the disciples of the Ninth Sect, who had produced far more Chosen in the past ten years because of that pressure.</p><br/><p>Increasing numbers of disciples came to Meng Hao’s mountain to try to persuade him to do something. At one point, more than 10,000 disciples all went at the same time.</p><br/><p>Yan’er was very annoyed by everything that was happening. Her cultivation had advanced by leaps and bounds in the past ten years, and although she wasn’t even close to catching up to Meng Hao, she was in the Dao Seeking stage, very close to her Immortal Tribulation.</p><br/><p>One day when meditating, she was forced to open her eyes because of the cacophonous clamor outside the mountain.</p><br/><p>“Eldest Brother, please come down from your mountain!!”</p><br/><p>“Eldest Brother, the Ninth Sect only has a few thousand spots in the Vast Expanse Shrine’s top 30,000. Please come down!!”</p><br/><p>“Eldest Brother, rumors are flying everywhere. People are accusing you of things. Eldest Brother.... Come down from the mountain! Our frustration has been building for ten years, and we need your help to vent it!!”</p><br/><p>Yan’er frowned. During the past ten years, she had watched in frustration as the other sects continuously challenged and provoked the Ninth Sect. She had asked her Master about the matter, but he didn't seem to care much. Furthermore, in recent years he had come to approach a critical juncture in his cultivation, and told Yan’er not to bother him about the matter any more.</p><br/><p>“So annoying!” she thought. “What’s wrong with these people, don't they have their own Vast Expanse Shrine to challenge? What's the point in showing off in the Ninth Sect?” With a cold harrumph, she walked out of her room to go console all of the fellow disciples who had come to pay respects to her Master.</p><br/><p>As soon as she walked out, though, she frowned. Among the people who had come to visit, there were many unfamiliar faces. There were even Chosen from other sects, who by this point had begun to treat the Ninth Sect as if it were their own home, and were staring at her with cold smiles.</p><br/>\n</div>"}