{"title": "Chapter 1499: Familiar Fluctuations!", "id": 1499, "volume": 15, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-1499-familiar-fluctuations", "volume_title": "Volume 15", "body": "<h1>Chapter 1499: Familiar Fluctuations!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 1499: Familiar Fluctuations!</strong></p><br/><p>His voice seemed to thrum with bizarre power as it echoed out in all directions.</p><br/><p>It was a power that came from Meng Hao’s memories, from his longing. It filled the column of light as it shot off into the starry sky of the Vast Expanse.</p><br/><p>“Copper mirror... return to me....</p><br/><p>“Parrot... return to me....</p><br/><p>“Lord Fifth... return to me!”</p><br/><p>As the column of light formed by the eight mirror shards shot up from the desolate land mass, the Vast Expanse trembled, and the starry sky trembled.</p><br/><p>In that same moment, countless powerful experts suddenly seemed to sense something. Their expressions flickered, and they looked in the direction of the beam of light.</p><br/><p>In the locations where Meng Hao had discovered the other mirror shards, the powerful experts he had encountered gazed off into the distance, expressions flickering.</p><br/><p>The giant lizard. The vicious head. The Icemountain Giant and the Flamephoenix. All of them could sense the auras of the precious treasures which had once been theirs.</p><br/><p>At the same time, there were other entities within the starry sky of the Vast Expanse who were stirred into action.</p><br/><p>Ripples spread out from the column of light, sweeping out through the Vast Expanse. At the same time, there was apparently a will which began to wake up, that then spoke out in an indistinct voice.</p><br/><p>“Destroy that spell formation. Stop him....” Although the voice was difficult to make out, it could be heard by countless entities, and in response, their hearts trembled. Suddenly, a power of will seemed to fill them, taking control of their bodies. Almost immediately, they began to fly in Meng Hao’s direction at top speed.</p><br/><p>There was a fog, within which shrieking voices could be heard. Countless mysterious specters could be seen therein, which surged out into the starry sky, radiating murderous intentions.</p><br/><p>On a crimson land mass, brutish roars echoed out as numerous 30,000-meter-long crimson dragons flew out into the Vast Expanse.</p><br/><p>An enormous head floated amidst the dust that filled the starry sky. It had been dead for countless ages, but now its eyelids suddenly opened. There were no eyes, only empty holes, and yet suddenly glints of red could be seen inside. Moments later, a cloud of red dots flew out from within the eyes, forming something like a beam of light. Each one of those dots was a bright red bug, the lot of which flew off into the distance.</p><br/><p>In another area, a huge coffin floated out in the void. It was broken down and dilapidated, with no corpse inside. Suddenly, a face materialized and floated above the coffin.</p><br/><p>“That’s... the will of the Vast Expanse....” murmured a voice. The coffin vanished, and when it reappeared, it was far off in the distance, heading toward Meng Hao.</p><br/><p>Ripples filled the starry sky of the Vast Expanse as countless entities appeared. Some were beasts, some were other types of life, but all of them were heading toward Meng Hao.</p><br/><p>There were deathly, corpse-like spirits, minotaurs, creatures with tentacles for arms, stone golems, and extremely beautiful creatures that were only a third of the size of a normal human.</p><br/><p>Virtually every type of existence possible could be seen....</p><br/><p>The Immortal God Continent and the Devil Realm Continent were shaken, and countless cultivators flew out, eyes red as they charged into the Vast Expanse.</p><br/><p>As of this moment, the entire starry sky of the Vast Expanse was trembling.</p><br/><p>Back on Planet Vast Expanse, in the First Sect, Han Bei was sitting there cross-legged in meditation. Suddenly, her eyes opened, and they shone with a strange light. She flickered into motion, vanishing, then reappearing back out in the starry sky.</p><br/><p>In addition to all of those things, there was something else that noticed the fluctuations. In a remote spot near the very edge of the starry sky of the Vast Expanse, there was a withered old tree, embedded into the trunk of which was a copper mirror.</p><br/><p>The copper mirror suddenly began to vibrate and shine with bright light. Then, the image of a parrot became visible.</p><br/><p>It seemed confused as it looked off into the distance, as if it were thinking about the past. After a long moment, a blank look filled its eyes.</p><br/><p>“Someone... is summoning me....</p><br/><p>“This aura is very familiar, but I can't remember who it is....</p><br/><p>“However, being called Lord Fifth... I like it. Seems familiar, very familiar....” After a long moment, the parrot faded away. Then, the copper mirror flew off of the tree, transforming into a current of light that shot toward the direction of the calling.</p><br/><p>Meanwhile, Meng Hao still sat cross-legged on the land mass out in the starry sky. His divine sense was spread out in all directions, allowing him to feel how shaken the Vast Expanse was. Although he wasn't able to see it clearly, he could sense the location of the copper mirror, and could feel... that it was currently rushing toward him at top speed.</p><br/><p>“It’s coming. It's definitely coming....” A tremor ran through him, and his eyes shone with excitement. He had been waiting for hundreds of years for this chance to reunite with the copper mirror.</p><br/><p>“What a pity the meat jelly perished....” he thought, his heart filled with grief. However, he took a deep breath, confident that the day would come in which he would be able to resurrect the meat jelly.</p><br/><p>“According to how fast it’s moving, it will need about seven days to get here!” Meng Hao’s eyes glittered. Even as he sensed the copper mirror, he could also feel an incredible ill will rising up against him within the starry sky of the Vast Expanse.</p><br/><p>It was intense, something that could seemingly affect the very essence of life. Meng Hao could tell that as the ill will spread out, countless powerful experts began to head in his direction.</p><br/><p>Furthermore, in addition to the ill will, there was something adding a blessing to his enemies, increasing their speed dramatically, almost to the point of a teleportation, enabling them to move far, far faster than the copper mirror.</p><br/><p>“It seems all the work I put into setting up these defenses wasn’t a waste after all....” Meng Hao’s eyes flickered with killing intent as he thought back over the ten years he had spent setting up all of the spell formations. It had been difficult to suppress his anxiousness to summon the parrot, but now he realized that it was definitely worth it.</p><br/><p>It was at this point that the first species of enemy appeared in the starry sky up above. The mysterious specters closed in at high speed, invisible to the naked eye, but detectable via divine sense. They seemed matchlessly vicious and evil, and as soon as they appeared, they charged toward Meng Hao, causing rumbling sounds to echo out.</p><br/><p>He looked up them, eyes flashing with coldness. Before the specters could even get close to the land mass, they slammed into something like an invisible net. Flashes of light appeared, and the specters let out miserable shrieks.</p><br/><p>Via divine sense, Meng Hao was able to see their bodies being sliced to shreds by the huge net, completely destroying them. And yet, before they could even fade away, more specters appeared off in the distance.</p><br/><p>There were clouds of them, seemingly endless numbers that swarmed around the land mass. Were it necessary to count them, there would be more than a billion, creating an awe-inspiring scene as they charged in attack.</p><br/><p>Booms rang out, and the land mass shook, but Meng Hao’s expression was the same as ever as he performed a double-handed incantation gesture, causing the first of the nine shield layers he had built to shine with brilliant light, destroying the murderous specters.</p><br/><p>The specters didn't seem to fear death at all. They blasted bodily into the shield, causing it to shudder and teeter on the verge of being destroyed. Meng Hao’s eyes flickered with killing intent, and he snorted coldly. Then, his hands flashed in a double-handed incantation gesture, and he slapped them onto the ground.</p><br/><p>“Detonate!”</p><br/><p>Instantly, the first shield layer surged with blinding light, then exploded, sending a destructive blast out in all directions. It swept over the specters like a deadly tide, causing bloodcurdling screams to be heard as the specters were wiped out of existence.</p><br/><p>There were some among them who were incredibly powerful, and yet, even they were incapable of evading destruction. By the time the blast dissipated, more than ninety-nine percent of the specters had been eradicated, leaving behind only those who were at the Paragon level.</p><br/><p>Of those, there were seven, with two being at the 9-Essences level.</p><br/><p>They were tattered and torn, their expressions those of confusion, and yet they continued to attack. Meng Hao snorted, right hand flashing with an incantation gesture that caused wisps of smoke to curl outside of the second shield layer. The smoke rapidly took the shape of a hand, which grabbed out toward the specters.</p><br/><p>Booms could be heard as three of them were summarily crushed. The remaining specters fled, and just when the hand was about to pursue them, a mighty roar echoed out from the distance.</p><br/><p>A beam of red light appeared, moving so fast it seemed like a teleportation. In the blink of an eye, it appeared directly in front of the huge hand; it was a gigantic, crimson dragon, bursting with the power of peak 9-Essences. As it slammed into the hand, the hand shattered, and then the dragon braced itself and charged onward in attack.</p><br/><p>Even as it moved forward, more crimson dragons appeared off in the distance. One after another they could be seen, including three which were at the peak 9-Essences level. The rest were weaker, but the crimson dragons were powerful entities to begin with, and there were over a million of them. They filled the starry sky, instantly converging upon the second shield.</p><br/><p>The lands shook violently as the previously invisible second shield began to distort under the powerful attack. A moment later, it was destroyed.</p><br/><p>The resulting fragments blasted out like a shockwave. In response, Meng Hao sat there on the land mass below, eyes flickering with killing intent. These shields had been erected using a technique he had acquired within Shui Dongliu’s legacy, and were very similar to the Mountain and Sea Grand Aegis.</p><br/><p>Based on the current level of Meng Hao’s cultivation base, it was far, far mightier than the shield which had protected the Mountain and Sea Realm. And yet, the crimson dragons were capable of shattering the second layer.</p><br/><p>However, the price they paid to do so was heavy!</p><br/>\n</div>"}