{"title": "Chapter 1495: World of Ice and Fire!", "id": 1495, "volume": 15, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-1495-world-of-ice-and-fire", "volume_title": "Volume 15", "body": "<h1>Chapter 1495: World of Ice and Fire!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 1495: World of Ice and Fire!</strong></p><br/><p>“It’s you...?” Little Treasure said, his heart trembling. It was a face he could never forget. In the darkest, loneliest moment of his entire life, it was the source of the only warmth he had felt.</p><br/><p>Eventually, Little Treasure’s hands dropped away from her face. He smiled a warm, happy smile.</p><br/><p>Years passed.</p><br/><p>The ninth life of Meng Hao’s clone went on quietly on the first continent. Meanwhile, Meng Hao’s true self was in the enormous flower out in the starry sky of the Vast Expanse, in the middle of his search for the final copper mirror shard!</p><br/><p>He was currently sitting cross-legged in a world frozen over with ice. “Once I get this final mirror shard, my collection will be complete, and I’ll be able to... call out to the copper mirror and summon it back to me!”</p><br/><p>Everywhere he looked he saw nothing but ice. There were plants, but they had apparently been frozen. They were beautiful, like ice sculptures.</p><br/><p>“What a strange place....” he thought, his eyes flickering. He had been searching this area for the copper mirror shard ever since entering the flower. However, the coldness here was so intense that it would frighten even 9-Essences experts. It pressed against him at all moments, threatening to transform him into an ice sculpture, just like everything else.</p><br/><p>After resting for a bit, he proceeded along through the world of ice. No matter how he searched, he couldn’t find the copper mirror shard, and yet, he could sense that it was somewhere inside of this enormous flower.</p><br/><p>As he proceeded along, he suddenly heard a powerful roar coming from somewhere off in the distance. The ice around him shuddered, and cracks appeared on its surface.</p><br/><p>He frowned, turned to look behind him. Off in the distance, was what appeared to be an enormous mountain, fully 300,000 meters tall, its peak piercing the clouds above. The mountain was currently shaking, and was the source of the roaring he had just heard.</p><br/><p>A closer look would reveal the truth: he wasn’t looking at a mountain, but an enormous giant. The giant was currently trying to rise from a cross-legged position, but powerful Essence-sealing symbols surrounded it, preventing it from doing so.</p><br/><p>Meng Hao snorted coldly. This 300,000-meter-tall giant was the first life form he had encountered after entering this place twenty years ago. As soon as it saw him, it had transformed from a mountain into a giant. Eyes flickering with killing intent, it had begun to fight him.</p><br/><p>Communication with the thing had proved impossible. Meng Hao had tried to show it good will, but it had completely ignored him, and its killing intent had even increased. Angered, Meng Hao had begun to fight it.</p><br/><p>The 300,000-meter-tall giant was no match for him, but also seemed to be incapable of dying. Throughout the twenty years, Meng Hao had fought and defeated it several times, and yet had never been able to obliterate it completely.</p><br/><p>In the end, he didn't feel like fighting it anymore, and had sealed it in place so that he could search for the copper mirror in peace. Now, the giant was trying to break free from the seals.</p><br/><p>Meng Hao looked away, ignoring the giant as he continued his search.</p><br/><p>Years passed in which he continued to fly along. Eventually, he realized that it seemed to be getting less terrifyingly cold. At a certain point, he didn’t even feel cold.</p><br/><p>“Could it be that I'm entering another area?” he thought, picking up speed. A few months later, he hovered in the air looking off into the distance. Unexpectedly, he saw numerous cities within the icy landscape.</p><br/><p>They were scattered about seemingly randomly, and there were many of them. Tens of thousands. Furthermore, these cities were filled with countless living beings.</p><br/><p>They were huge. Compared to these cities, the cities that existed in the Mountain and Sea Realm and Planet Vast Expanse were like toys.</p><br/><p>Meng Hao hovered there in thought. During the many years he had spent searching for the copper mirror shards, he had been to many, many worlds. He had seen all sorts of living creatures that were not cultivators. There were some that looked like wild beasts, and some that even had bodies made of mist.</p><br/><p>At first he had been shocked at the sight of such beings. But after some time passed, it became nothing out of the ordinary. He was now fully aware that there were countless bizarre forms of life within the starry sky of the Vast Expanse.</p><br/><p>Meng Hao looked at the cities up ahead. Even though they were quite a distance away, he was still able to clearly see the living beings within them.</p><br/><p>They looked similar to cultivators, except they were enormous. Most were about thirty meters tall, like mountains trudging along. Even the babies among them were at least three meters tall.</p><br/><p>Some of the oldest appeared to be over 300 meters tall sometimes as tall as 3,000. With his divine sense, Meng Hao was able to locate the most powerful among these entities. It was a giant at the early 9-Essences level, and it was at least 30,000 meters tall.</p><br/><p>He wasn’t located within one of the cities, but was sitting cross-legged in the form of a mountain.</p><br/><p>However, based on the fluctuations of the giant’s aura, it was possible to tell that it was bursting with life force. Surrounding the giant were other powerful experts in the form of mountains. None of the others were 30,000 meters tall, but there were a few hundred who were 15,000 meters tall.</p><br/><p>These giants were the native species of this world, and Meng Hao could tell that they were of the same species as the 300,000-meter-tall ice mountain giant he had seen before.</p><br/><p>Further off in the distance, Meng Hao was shocked to find that the realm of ice ended. Beyond, he could see green plains.</p><br/><p>There were also countless cities visible upon the plains. All of them were connected together to form something like a wall, within which were living beings that resembled cultivators. They were all of a normal height, and yet had wings growing out of their backs.</p><br/><p>The wings changed depending on the levels of their cultivation bases. The more powerful they got, the redder they became.</p><br/><p>“What an interesting world. One part is freezing, another is warm.... Wait, no. This is the middle of the world, where it's warm, making it suitable for inhabitation by these giants and those avian people.</p><br/><p>“If that's the case, then further off in the distance... it must be burning hot.” Meng Hao sped into motion, heading toward the green plains. His cultivation base was so far above the living beings he passed by that none of them even detected his presence.</p><br/><p>He continued to fly along for years. Down below, the lands began to change from green to red. Burning lava flowed, casting a crimson tinge to the sky. Things started getting so hot that most living beings who attempted to enter the area would be transformed into ash.</p><br/><p>It reached the point where even 9-Essences cultivators would be completely destroyed. Meng Hao was beginning to feel uncomfortable. Eventually, he saw something off in the distance that looked like a mountain. He also felt an aura no weaker than the one he had felt from the ice giant. That aura was now rushing toward Meng Hao as if it had just sensed him.</p><br/><p>Everything rumbled violently as the mountain transformed into a volcano that erupted with blazing fire. As it did, a crimson Flamephoenix burst out from within. It looked at Meng Hao, its eyes flickering with killing intent and vigilance. Then, it shot toward Meng Hao, surrounded by a sea of flames.</p><br/><p>As it neared, the Flamephoenix shrank down into the form of a woman. She was beautiful, with two crimson wings, and she stood upon a sea of elemental fire that shot through the air.</p><br/><p>“You’re not welcome here, foreigner,” she said in a furious voice. “Get the hell out!” As her voice echoed out, the air around Meng Hao shattered, and the sea of flames roared toward him.</p><br/><p>His eyes flickered, although he wasn't surprised to find such a powerful entity here. The ice plains had the Icemountain Giant, and the land of flames had a Flamephoenix. The world was balanced.</p><br/><p>“To be able to practice cultivation up to a level comparable to the peak of the 9-Essences, and even a bit beyond that, means these things are intelligent. Furthermore, they couldn’t possibly be prone to changeable emotions.</p><br/><p>“In that case, the Flamephoenix and the Icemountain Giant immediately acting hostile must indicate... that they know about the copper mirror shard!” His eyes glittered as he fell back, waving his right hand to summon numerous mountains, which smashed into the sea of flames.</p><br/><p>Rumbling sounds echoed out, and the world shook. The woman-form Flamephoenix’s face flickered. Killing intent swirled in her eyes, and she transformed back into a Flamephoenix, then charged toward Meng Hao in attack.</p><br/><p>“I have a shape-changing magic too!” Meng Hao said. Snorting coldly, he changed into an azure roc, the color of which then continued to deepen until it was almost violet. A Demonic qi rose up, causing everything to tremble. The violet-colored roc shot toward the Flamephoenix, and the two collided in midair.</p><br/><p>Heaven shook, the Earth trembled, and cracks spread out in all directions. Portions of the ground collapsed, and lava blasted up into the air. When two peak 9-Essences entities fought, it could have a huge influence on the surrounding world, and if it went on for too long, could destroy everything in the area.</p><br/><p>The Flamephoenix let out a piercing cry, then fell back, changing back into the form of a woman. She coughed up a mouthful of blood, then glared up at Meng Hao.</p><br/><p>Meng Hao’s expression was the same as ever as he also transformed back into human shape, and then looked coolly at the Flamephoenix.</p><br/><p>“With a cultivation base like that, your Excellency,” the Flamephoenix said, “you can’t possibly be some nameless nobody from the starry sky of the Vast Expanse. What is your purpose here!?” Despite clearly fearing Meng Hao, she didn’t appear ready to give in at all.</p><br/><p>“You’re a lot more reasonable than that lump of ice,” Meng Hao replied coolly. “I have no ill intentions here.”</p><br/><p>The Flamephoenix’s eyes flickered. “Lump of ice? You saw Patriarch Icemountain?”</p><br/><p>“Patriarch Icemountain? You mean that 300,000-meter-tall giant? Yes, I ran into him, and left him sealed where I found him.”</p><br/><p>The Flamephoenix’s eyes narrowed as she tried to determine whether or not Meng Hao was telling the truth. She took a deep breath, looking at Meng Hao with even more fear than before.</p><br/><p>After a moment, she asked, “Well then, why exactly have you come here, your Excellency?”</p><br/><p>“For this!” Meng Hao said, waving his sleeve. A copper mirror shard appeared in front of him, emitting dazzling light amidst the light of the surrounding flames.</p><br/>\n</div>"}