{"title": "Chapter 1516: The Return!", "id": 1516, "volume": 16, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-1516-the-return", "volume_title": "Volume 16", "body": "<h1>Chapter 1516: The Return!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 1516: The Return!</strong></p><br/><p>The fight continued outside the Vast Expanse.</p><br/><p>The light formed from the eight sealing marks of Meng Hao's Ninth Hex was so powerful that it surpassed the 9-Essences level. Meng Hao wasn’t sure how far away it was from the Transcendent level, but he was sure that not a single 9-Essences cultivator would be able to survive an encounter with it!</p><br/><p>Ear-splitting rumbling sounds spread out in all directions. The faces weren’t even able to get back into the column before they were incinerated.</p><br/><p>Before dying, they let out miserable screams, which faded away almost before they even began. Just before dissipating, their expressions seemed to be those of release and gratitude.</p><br/><p>Soon, everything was quiet and still. It happened faster than either Meng Hao or the parrot could ever have imagined.</p><br/><p>The parrot looked over at the Demon pillar, which was still trembling, and Meng Hao, who was radiating an air of madness.</p><br/><p>The parrot couldn’t help but take a deep breath as it gaped at Meng Hao. After all the years that they had been separated, it turned out that Meng Hao was still... the type to seek revenge over the smallest grievance!</p><br/><p>“What... what is he planning to do?” the parrot thought, eyes wide with disbelief. “How vicious! That... that pillar can only be destroyed by a Transcendent cultivator. He wants to try to destroy the Demon pillar now?”</p><br/><p>The parrot looked around at the destruction and chaos in the starry sky, then back at the pillar. A moment later, after the light faded away, a cracking sound rang out.</p><br/><p>At the same time, it was possible to see that a crevice had appeared on the pillar. Although the pillar wasn’t crushed, the crevice which had opened up could obviously not be mended.</p><br/><p>The parrot shivered and then yelled, “Meng Hao, that’s enough. Really, enough is enough. The spell formation is ready. We need to get out of here as soon as possible!” The parrot then turned toward the completed spell formation, which began to rumble to life.</p><br/><p>Meng Hao immediately began to back up. Although the battle had been bitter, he had won a stunning victory.</p><br/><p>“I can't destroy this pillar now,” he thought, eyes glittering coldly, “but one of these days, I’ll come back here and wipe it out of existence!”</p><br/><p>In almost the same moment that the crack had appeared, the person-shaped outline inside of the pillar had begun to shrink. The fruits on it exploded, and soon, a piercing shriek rang out. The shriek passed out of the column into the world beyond, echoing out in all directions.</p><br/><p>Blood sprayed out of Meng Hao’s mouth as he heard the sound of the cry. Without the slightest hesitation, he increased his speed. Simultaneously, the pillar that represented the Immortal began to shrink and wither. That in turn caused the pillar of Demonic qi to begin to recover.</p><br/><p>And yet, the crevice which had appeared remained. Shockingly, it was at this point that the will of the Vast Expanse rose up, causing the starry sky to shake. Then, a huge eye abruptly appeared up ahead.</p><br/><p>It was enormous, and completely bloodshot. It was a mass of chaos, and seemed to contain the seething mist of the Vast Expanse. This eye was apparently the will of Allheaven, the final gambit to be played in this day’s events. As soon as it appeared, everything went completely still and quiet.</p><br/><p>The opening of the eye caused Meng Hao to be filled with a sense of intense crisis. He could tell that the natural laws in the area were being destroyed, and as the eye gazed upon him, he felt a terrifying aura that caused his scalp to go numb. Immediately, the bronze lamp began to shine brighter than ever, transforming Meng Hao into a figure of light.</p><br/><p>Almost in the same moment that the eye opened, Meng Hao reached the spell formation put together by the parrot.</p><br/><p>The parrot howled as the spell formation began to activate. However, even as the light was still beginning to shine, the seemingly eternal eye caused the starry sky around it to twist and distort as a huge mouth appeared. Then, the mouth lunged toward Meng Hao and the parrot as if to consume them.</p><br/><p>The parrot’s eyes were bright red, and it howled again. Cracking sounds could be heard, which came from the cracks spreading out over the copper mirror. By damaging the mirror, it was possible to negate the effects of the changed natural law caused by the will of Allheaven. A moment later, rumbling sounds echoed out as the parrot and Meng Hao vanished.</p><br/><p>That was when the mouth arrived. It took a huge bite, causing the starry sky to shake, and leaving a gigantic, smoking crater in the spot where the teleportation portal had been.</p><br/><p>The eye glared off into the distance, and a piercing shriek was just barely audible from the direction of the Demonic qi pillar.</p><br/><p>As that happened, the brilliant light of teleportation appeared in a dusty corner of the starry sky of Allheaven. A moment later, Meng Hao and the parrot appeared.</p><br/><p>Meng Hao immediately coughed up some blood, and the parrot listed weakly. The light of teleportation faded away, and the copper mirror appeared, covered with cracks. Although it wasn’t destroyed, it was clearly in worse condition than before the trip outside the Vast Expanse.</p><br/><p>“Dammit!” the parrot said, looking very irritated. “Lord Fifth just woke up and was immediately thrown into grave danger? I quit. I quit, you hear? Meng Hao, you’d better give Lord Fifth a good explanation for all of this!”</p><br/><p>Meng Hao’s responded with a question: “Was that eye... Allheaven? Is Allheaven the will of the starry sky of the Vast Expanse?”</p><br/><p>Fear could be seen in the parrot's eyes as it began to speak. “Legends say that the world Essence of the starry sky of the Vast Expanse has a will, a will who is called Allheaven. The main body of the will exists outside the Vast Expanse. And yet, that will can also fill the Vast Expanse itself. In the beginning, that will blessed all living things, and supposedly, even taught all living beings how to practice cultivation. But as time went on, it began to weaken, and then go mad.</p><br/><p>“However, I have a vague memory deep inside that seems to indicate... that this Allheaven actually has a different origin. What exactly that is, nobody knows.... Even I'm not sure. Dammit, how could I not know?” The parrot shook its head in confusion.</p><br/><p>A thoughtful look could be seen in Meng Hao’s eye as he stared at the parrot and asked another question. “Were you created by Patriarch Vast Expanse?”</p><br/><p>“Patriarch Vast Expanse....” the parrot murmured, its eyes gleaming with reminiscence. After awakening, its memories had slowly been revealed. After a long moment, it nodded, but then suddenly seemed to hesitate. Apparently... Patriarch Vast Expanse had created the copper mirror, but not the parrot. Apparently... the parrot came from a time before Patriarch Vast Expanse was even alive!</p><br/><p>The parrot didn’t want to think about the past, and as such, began to yell at Meng Hao. “Forget about it. Meng Hao, you owe me an explanation. Dammit, Lord Fifth’s memories were just restored, and then I got scared nearly to death!!”</p><br/><p>Meng Hao’s eyes flickered with killing intent as he looked off in the direction of Planet Vast Expanse. “I’m going to go get an explanation, for you and me both!”</p><br/><p>It was just as he said; the next thing he was planning to do was to go get an explanation.</p><br/><p>From what he could tell, the will of Allheaven could only affect him directly if he was outside of the Vast Expanse. Apparently, it couldn’t do anything within the Vast Expanse itself, which meant that Meng Hao was temporarily safe.</p><br/><p>The parrot’s explanation had confirmed his suspicions. Meng Hao turned, killing intent flickering in his eyes as he made his way off into the distance.</p><br/><p>The parrot immediately began to follow.</p><br/><p>“Hey,” it asked, “where’d the meat jelly get off to, that old fart?” Its words were met by silence on Meng Hao’s part. The parrot suddenly shivered. “What... what happened?”</p><br/><p>Sadness filled Meng Hao’s face as he opened his bag of holding and carefully pulled out the shattered remnants of the meat jelly armor. The parrot stared in shock for a long, long time before letting out a cry of anguish.</p><br/><p>The moment of silence which followed seemed to last an eternity. Eventually, the parrot turned to Meng Hao, and its eyes were completely bloodshot.</p><br/><p>“Meng Hao, I’m going to ask one thing, and you’re going to answer me. When... do we go slaughter them?!”</p><br/><p>“Soon,” Meng Hao murmured in reply, his eyes equally as red. “We’ll slaughter the 33 Heavens, we’ll slaughter the Immortal God Continent, and we’ll slaughter the Devil Realm Continent. Then... we’ll go outside the Vast Expanse and slaughter the will of Allheaven!</p><br/><p>“Soon....” with that, he transformed into a beam of light that shot like lightning through the starry sky.</p><br/><p>As he flew along, he rotated his cultivation base, but his withered body wasn’t recovering very quickly. He looked incredibly gaunt, and thus, incredibly fierce. His eyes flickered with red light, making him look almost like he had just climbed up out of the grave.</p><br/><p>Shocking rumbles echoed out in Heaven and Earth as he flew toward Planet Vast Expanse with deadly intent. It only took a few months of travel. After all, he hadn’t been very far from Planet Vast Expanse to begin with. Soon, he was looking at the planet from some distance away.</p><br/><p>As he neared, the planet’s protective shield sprang up as if to block him. Meng Hao didn't even look at it. He passed directly through it, whereupon a somber, dignified voice echoed out.</p><br/><p>“Respectful greetings, Ninth Paragon! Welcome back!”</p><br/><p>Even as the voice rang out, Meng Hao entered the atmosphere of Planet Vast Expanse. As soon as he did, the other Paragons could sense his presence, and the intensely murderous aura caused them all to look up.</p><br/><p>Jin Yunshan, the Sect Leader, and all the others had returned from the necropolis. They still hadn’t successfully made it to the ninth land mass. After their successive failures, they had been sitting cross-legged in meditation, but now, looks of shock could be seen on their faces.</p><br/>\n</div>"}