{"title": "Chapter 1527: Vast Expanse Leads the Defense!", "id": 1527, "volume": 16, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-1527-vast-expanse-leads-the-defense", "volume_title": "Volume 16", "body": "<h1>Chapter 1527: Vast Expanse Leads the Defense!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 1527: Vast Expanse Leads the Defense!</strong></p><br/><p>The entire planet was shaking. All natural and magical laws, all space and time, all Daos, were utterly and thoroughly suppressed.</p><br/><p>The descending will became the only thing that existed in Planet Vast Expanse. An endless mist spread out, such that if you looked at the planet from a distance, it looked like it was composed of nothing but mist. The entire planet was covered by it.</p><br/><p>The will pervaded everything, like a Heavenly Dao. In the blink of an eye, it appeared above the half-planet, where it attacked the teleportation portal, blocking the teleportation power.</p><br/><p>Everyone present was shocked, and couldn't help but feel that an incredible disaster was imminent.</p><br/><p>Everyone began to cry out.</p><br/><p>“What’s happening?!”</p><br/><p>“Who’s attacking the spell formation?!?!”</p><br/><p>“Is an army invading the Vast Expanse School? Impossible!”</p><br/><p>Meng Hao’s eyes flickered with killing intent. Obviously, the will of Allheaven had arrived to try to prevent him from entering the necropolis.</p><br/><p>It was in that exact same moment that something like a voice echoed out within the minds of Meng Hao and the other 9-Essences Paragons.</p><br/><p>“Any and all teleportations are prohibited!”</p><br/><p>The voice was cold, emotionless, and stern. Other than Meng Hao and the Sect Leader, the entire group was left trembling. Sha Jiudong, Jin Yunshan, and Bai Wuchen all coughed up blood. Everyone else seemed to be on the verge of exploding. Their bodies were being shredded to pieces, gravely injured by a single sentence.</p><br/><p>Blood oozed out of the corners of the Sect Leader’s mouth, and Meng Hao’s eyes were shot with blood, although that was the extent of his injuries.</p><br/><p>“Fellow Daoists, if we don't fight back, the danger will only escalate!” Meng Hao grinned viciously, waving his hand. The copper mirror appeared, instantly transforming into countless black threads. His suit of armor formed, and the Battle Weapon appeared in his hand, which he used to slash up at the sky.</p><br/><p>A boom echoed out as Allheaven’s descending will trembled. At the same time, an immense pressure began to weigh down. The teleportation portal itself even began to crumble apart.</p><br/><p>Everyone, regardless of whether they were inclined to or not, had no choice but to unleash the full power of their cultivation bases. An explosion of energy occurred as all of them began to fight back against the will of Allheaven.</p><br/><p>Boundless Essence power erupted out. Although they were being crushed by the pressure, these people were all 9-Essences cultivators, with some being at the peak of 9-Essences. Furthermore, all of them had benefited from eight chances to meditate on a Transcendence Dais. All of them had traces of Transcendence aura, which made it possible for them to resist the will which was arrayed against them.</p><br/><p>Rumbling echoed out, and the spell formation trembled. The light twisted, and the lands shattered. The half-planet was shaking, and more cracks were spreading out across the surface of the teleportation portal. If it broke, then it would make it very difficult for the Vast Expanse School forces to enter the necropolis. The entrance would be sealed tight.</p><br/><p>It was at this point that the descending will manifested in the blurry shape of a hand. The hand filled the sky as it bore down on the spell formation.</p><br/><p>Everyone, even Jin Yunshan, looked up at it in despair. It was something they simply couldn't fight against, the will of the entire starry sky of Allheaven!</p><br/><p>The hand blotted out everything else, but as Meng Hao looked up at it, his eyes glittered. He considered taking out the wooden statue. He didn’t want to, and in fact, the last time he had been in secluded meditation trying to absorb the Ninth Hex, and the will of Allheaven interfered, he had only relied on his own power to fight back.</p><br/><p>As far as Meng Hao could tell, using the Ninth Hex before it was complete would result in irreversible losses, and would make it less effective in the future!</p><br/><p>But now, it seemed he had no choice but to unleash it. However, in the very moment when he was about to do so, the Sect Leader threw his head back and let out an enraged roar.</p><br/><p>“This is the Vast Expanse School, a branch of the Vast Expanse Society! This is the legacy of Patriarch Vast Expanse, and no will has the right to interfere with us!” His hands flashed in a double-handed incantation gesture, and he pointed up into the sky. Immediately, the ground off in the distance began to quake, and an ancient aura erupted out.</p><br/><p>The instant it appeared, the hand up above trembled to a stop.</p><br/><p>Then, a voice could be heard, murmuring and indistinct. And yet, Meng Hao was able to make out the word being spoken.</p><br/><p>“Ghost....”</p><br/><p>The hand suddenly surged back into motion, moving with even greater speed than before. At the same time, a crevice opened up in the ground, from within which brilliant red light spilled out. Then, a pillar of lava exploded up, at the top of which was, unexpectedly, a turtle shell!</p><br/><p>The turtle shell radiated an ancient power which caused everything to shake violently. It was almost as if something profoundly old were underneath it, trying to escape. The turtle shell began to spin, giving rise to a tempest which spread out in all directions. As soon as the hand touched it, the tempest collapsed, and blood oozed out of the corners of the Sect Leader’s mouth. His eyes were bright red; he was aware of the critical danger they were in, so he gritted his teeth and then roared, “Vast Expanse Precious Treasure, come forth!”</p><br/><p>As soon as the words left his mouth, the spinning turtle shell stopped in place, and something stretched out from within it.... A skeletal hand!</p><br/><p>It was completely gold, and appeared to be the hand of a cultivator!</p><br/><p>An intense and pure Immortal qi emanated off of it, something which exceeded the imaginations of everyone. None of them had ever seen anything so pure and powerful, except for Meng Hao, who had made contact with a similar Immortal qi when he visited the column of the Immortal outside the Vast Expanse.</p><br/><p>As soon as the skeletal hand appeared, the bronze lamp inside of Meng Hao began to flicker wildly.</p><br/><p>Meng Hao immediately thought back to the first time he had visited Planet Vast Expanse, and what he had felt from the bronze lamp. Most others would not be able to discern whose hand that was, unless they were familiar with certain legends or stories. But Meng Hao was sure, based on his feelings, that this skeletal hand... actually belonged to...</p><br/><p>Patriarch Vast Expanse!</p><br/><p>He had been transformed from the Immortal into the Ghost, and was the first person in the starry sky of Allheaven to Transcend. He was also the first person to destroy one of Allheaven’s fingers.</p><br/><p>Clearly, although he had transformed into the Ghost, one of his hands ended up becoming that of the Immortal. He left it behind as a legacy, which became the guardian treasure of the Vast Expanse School.</p><br/><p>As soon as the skeletal hand appeared, the descending will of Allheaven began to tremble, and let out an enraged roar. The skeletal hand flew up, growing larger and larger until it was enormous, and actually looked like a hand. Then, it slammed into the descending hand which was the will of Allheaven.</p><br/><p>It was like two giants crossing time and space to slam into each other directly above the teleportation portal!</p><br/><p>Rumbling sounds echoed out through Planet Vast Expanse, causing crevices to open up throughout the lands. The hand of the will of Allheaven instantly shattered into pieces, and another furious roar echoed out into the world.</p><br/><p>Everything trembled, and the half-planet seemed to be on the verge of collapsing. But then, golden light spread out from the skeletal hand, covering everything, protecting everything, ensuring that the will of Allheaven could do nothing against it!</p><br/><p>In the moment that the hand formed by the will of Allheaven collapsed, the teleportation portal surged into action. Rumbling echoed out, and a brilliant light shot up into the air. Meng Hao and everyone else vanished.</p><br/><p>As they did, cracking sounds emanated out from the teleportation portal. However, because of the golden light covering everything, it did not shatter. Much of it crumbled, but the main form stayed intact.</p><br/><p>The will of Allheaven fell silent, and then slowly faded away. At the same time, the golden light gradually receded. The golden hand shrank back down, turning skeletal once again. Then it settled back down underneath the turtle shell, which sank back down into the ground with the lava.</p><br/><p>The crevice in the ground slowly closed back up, and everything went back to normal....</p><br/><p>When Meng Hao and the others reappeared, they were inside the necropolis.</p><br/><p>Blood was oozing out of Meng Hao’s mouth, and the others were in worse shape. Expressions of lingering fear could be seen on their faces. As they thought back to the danger they had been in, their hearts quivered.</p><br/><p>If that descending hand had managed to land, not only would the teleportation portal have been destroyed, but the entire group would have been killed in body and mind.</p><br/><p>Everyone began to look over at Meng Hao. All of them could tell that the sudden developments which had occurred had something to do with him.</p><br/><p>That was especially true of the Sect Leader, who looked at Meng Hao with a deep and profound gaze.</p><br/><p>After a moment of silence, Meng Hao clasped hands and bowed deeply to the others.</p><br/><p>“What I have promised,” he said, “I will absolutely live up to.” In response, the Sect Leader’s expression softened a bit. Another moment passed, and the others nodded.</p><br/><p>“Thank you for your trouble, Fellow Daoist Meng,” the Sect Leader said.</p><br/><p>Meng Hao didn’t say anything more. He took a step forward and looked out at the ruins that filled the necropolis. Casting his senses out, he confirmed that this place was almost completely devoid of the will of Allheaven. Although there were faint traces, they were incredibly weak.</p><br/><p>Furthermore, the deeper one got into the nine land masses that made up the necropolis, the more faint those traces became. In fact, the ninth land mass seemed to have no trace of the will of Allheaven at all.</p><br/><p>“This is definitely the place for me to Transcend,” he thought. He opened his third eye, and the world changed. Far off on the ninth land mass, he could see the huge throne, and the figure sitting upon it. That figure’s eyes opened, and looked directly at Meng Hao.</p><br/>\n</div>"}