{"title": "Chapter 1529: Flying Over the Land Masses!", "id": 1529, "volume": 16, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-1529-flying-over-the-land-masses", "volume_title": "Volume 16", "body": "<h1>Chapter 1529: Flying Over the Land Masses!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 1529: Flying Over the Land Masses!</strong></p><br/><p>The fourth land mass was covered in ruins, and looked even more wild and abandoned than the first three land masses. In fact, Meng Hao even spotted corpses!</p><br/><p>They were withered after all the years which had passed, and none of them were whole. They were so broken apart that it was impossible to tell which were male or female, or to determine the level of their cultivation base when they were alive. But they were a shocking sight nonetheless. As Meng Hao flew through the air over all of them, he couldn’t help but recall the scene in which the finger of Allheaven destroyed this world.</p><br/><p>“The previous three land masses contain nothing but ruins,” explained the Sect Leader, mixed emotions flickering in his eyes. “There are no corpses there. The corpses show up starting in the fourth land mass. What you see here counts for almost nothing. The further in we go, the more corpses we will see. By the time we reach the eighth land mass, we will see them… everywhere, some of them even completely intact.” Considering their previous visits to this place, plus further information gleaned from the ancient records, the Sect Leader had a much deeper understanding of the necropolis now.</p><br/><p>“You’ll even see some magical items, some of which are excellently preserved. However, you mustn't allow yourself to get greedy, Fellow Daoist Meng. You can’t touch any of the things you see...\"</p><br/><p>At this point, Jin Yunshan broke in: “The first time we saw such treasures, there was one individual who greedily attempted to lay hands on them. That gave rise to a powerful backlash, and a terrifying force of expulsion from the entire necropolis itself. The offending person was transformed into a pool of blood in front of our very eyes.” Although the fear in his eyes was clear, it was also obvious that he felt it was a pity that they couldn't take any of the treasures away with them.</p><br/><p>Meng Hao nodded. He sent his divine sense out, and could feel all of the countless ghosts in the fourth land mass. This was his first time here, and almost as soon as his divine sense began to spread out, the corpses littering the ground began to tremble, and then ghosts flew out from inside of them, as well as from within the various ruins that dotted the landscape. Soon, the entire fourth land mass was teeming with activity.</p><br/><p>The scene playing out in front of them caused the Sect Leader and the others too look on with wide eyes. Although this wasn’t anything unexpected, the intense coldness they were experiencing increased by several fold.</p><br/><p>Rumbling sounds filled Heaven and Earth as countless ghosts sensed Meng Hao’s presence on the fourth land mass, and woke up, eyes shining with madness.</p><br/><p>“The aura of the Emperor....”</p><br/><p>“It's the Emperor....”</p><br/><p>All of the ghosts on the fourth land mass took to the air and sped toward Meng Hao. As the intense, shocking coldness spread out, Meng Hao’s eyes shone, and he flicked his sleeve. Without pausing for a moment, he flew into motion.</p><br/><p>As he proceeded along, more ghosts from the fourth land mass streamed toward him. As soon as they caught sight of him from a distance, they would bow in worship. The sea of ghosts around him continued to grow larger and larger as he swept across the land mass. Eventually, he reached a cliff face that led to the fifth land mass.</p><br/><p>A huge statue was visible there, fully 30,000 meters tall. It was a stunning sight, like an enormous mountain that blocked the way into the fifth land mass.</p><br/><p>“There is no fighting against this mountain,” the Sect Leader said. “We spent a lot of time trying to figure out how to get into the fifth land mass. Eventually, we found that you have to wait approximately half a year.</p><br/><p>“Around that time, the mountain will gradually shrink until it's only 300 meters tall. Then, at its smallest state, it can be passed with relative safety.</p><br/><p>“If you try to barge past the mountain now, it will become enraged. Even considering the level of our cultivation bases, it can still pose a danger to us. After all, this statue was built back when these lands were alive and thriving, making it boundlessly powerful.... Fellow Daoist Meng, I suggest we just wait here for a bit.” Even though the Sect Leader had seen this mountain before, every time he looked at its majestic height, he was left shaken.</p><br/><p>“Half a year?” Meng Hao said. “I can’t wait that long,” Before the Sect Leader could say anything else, Meng Hao’s eyes flashed, and he pointed at the huge mountain.</p><br/><p>“Move this mountain for me!” he said coolly, bolstering his words with divine sense. The ghosts in the vast sea around him immediately began to howl and surge with energy. The aura which began to spread out left the Sect Leader and the others with tingling scalps.</p><br/><p>Vast quantities of ghosts surged forward toward the enormous mountain. Rumbling echoed out as it began to shake, and even rock back and forth.</p><br/><p>The Sect Leader and the others gasped as they noticed that as the mountain shook back and forth, it unexpectedly... began to rise slowly into the air.</p><br/><p>The lands quaked as the mountain was ripped away from them.</p><br/><p>Meng Hao could see the ghosts themselves, surrounding the mountain. Howling, they unleashed shocking power to do exactly as Meng Hao had asked, to move the mountain!</p><br/><p>Rumbling sounds filled the air as the enormous mountain continued to rise. Soon, to the shock of the Sect Leader and the others, it had been lifted up thirty meters above the surface of the ground!</p><br/><p>At the same time, a howl echoed out from the peak of the mountain. Countless rocks and rubble tumbled down as the mountain opened its enormous eyes. A nose appeared, and then a mouth. Shockingly, the entire face became visible.</p><br/><p>It was an ancient face whose eyes radiated fury.</p><br/><p>“Who... disturbs my slumb-- huh?” The voice contained incredible pressure and dignity, and even the power of natural law, as if it could alter Heaven and Earth. Before it could finish speaking, though, it suddenly fell silent.</p><br/><p>The face stared at the countless ghosts, and the boundless hostility they radiated, which was like an explosive will that shouted a single sentence!</p><br/><p>“Shut up!”</p><br/><p>Lands, mountains, sky, everything was trembling.</p><br/><p>“Dammit, where did all these ghosts come from!?” the face blurted. Then its mouth snapped shut.</p><br/><p>It looked at Meng Hao, its expression flickering with fear. After a moment, it closed its eyes and sank back down into the surface of the mountain, doing nothing to prevent the ghosts from moving the mountain.</p><br/><p>The Sect Leader’s eyes were wide. The other 9-Essences Paragons who stood around him exchanged shocked glances. When they had come here by themselves, everything along the way required extreme caution and hard work. However, Meng Hao could disregard everything in his path. At the most... he simply had to speak a few words to resolve any situation he faced.</p><br/><p>Jin Yunshan’s face twitched, and then he looked contemptuously over at the mountain. He couldn’t forget what had occurred the first time they had reached this point and tried to force their way past the mountain. To their shock, it had contained power like Heavenly might.</p><br/><p>Jin Yunshan’s contempt grew as... the mountain, apparently fearful for its safety, shrank down, making it easier for the ghosts to move it. Jin Yunshan was left completely speechless.</p><br/><p>Sha Jiudong took a deep breath, and Bai Wuchen completely abandoned any sort of unyielding attitude from years past.</p><br/><p>Soon, the mountain was completely moved out of the way and then placed down off to the side. The ghosts swept about, completely clearing the path to the fifth land mass.</p><br/><p>Meng Hao’s expression was the same as ever as he flew forward. A moment later, he was on the fifth land mass. After taking a deep breath, he continued onward.</p><br/><p>From the time they had entered the necropolis until this moment, not even ten days had passed.</p><br/><p>They sped along through the fifth land mass for a few more days. This place was even bleaker than the other land masses. Meng Hao eyed the corpses down below as he flew along toward the end of the fifth land mass, where a huge wave of water existed, completely separating the two land masses.</p><br/><p>This time, the Sect Leader didn’t say anything. Considering that Meng Hao had his ghosts, he decided that the best thing for him to do was simply followed Meng Hao’s lead.</p><br/><p>He was right. Meng Hao waved his sleeve, and the sea of ghosts shot forward. Now that the ghosts from the fifth land mass had joined in, the sea was even more majestic than before. It slammed into the huge wave, which was powerless to resist. It shattered, and Meng Hao led the ghosts flying over into the next land mass.</p><br/><p>Within ten days, they had passed from the sixth land mass into the seventh, and after that, the eighth!</p><br/><p>Meng Hao’s sea of ghosts continued to grow larger. By the time they reached the eighth land mass, it was like a massive vortex swirling around him. It was so powerful that the Sect Leader and the others could only look on with wide eyes.</p><br/><p>There were so many ghosts swirling around in the vortex, that they formed together... into something that looked like an enormous, illusory ghost head, which everyone could see!</p><br/><p>If that were all there were to it, it might not be a big deal. However, even more shocking was that the countless corpses on the eighth land mass rose to their feet, and their previously empty eyes seemed to burn with flame.</p><br/><p>All of them sped onward toward the border of the eighth land mass.</p><br/>\n</div>"}