{"title": "Chapter 1530: The Ninth Land Mass!", "id": 1530, "volume": 16, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-1530-the-ninth-land-mass", "volume_title": "Volume 16", "body": "<h1>Chapter 1530: The Ninth Land Mass!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong></strong></p><br/><p>[/expand]</p><br/><p>The barrier between the eighth and ninth land masses was an enormous door, surrounded by a wall that seemed to stretch off into infinity.</p><br/><p>The Sect Leader and the others had never made it past this point. They had tried skirting the door by going to the left or right, but not even by traveling to the very border of the eighth land mass were they able to find a point where they could get through.</p><br/><p>The only way to proceed was to do so through this door. That was the only way to get to the ninth land mass.</p><br/><p>No matter what ideas they came up with to push open the door, no matter how much power they drew upon, it did no good.</p><br/><p>The Sect Leader was now looking up at it, explaining everything he knew about it to Meng Hao, including all of the ways they had failed to open it.</p><br/><p>Meng Hao stood there, surrounded by a boundless sea of ghosts, who maintained complete silence, waiting there with bowed heads as he thought about the situation. A single word from him, and they would spring into action and become the fiercest of spirits, completely oblivious to their own safety.</p><br/><p>Seeing Meng Hao lost in thought, Jin Yunshan and the others didn’t dare to disturb him. They had learned hundreds of years ago that in the necropolis, Meng Hao was both the monarch and the Emperor.</p><br/><p>After a moment, Meng Hao burst into action. In the blink of an eye, he was directly in front of the door. In terms of size, he was like nothing compared to it, and yet, the power radiating out of him caused everything shake, and sent the entire surroundings into chaos.</p><br/><p>He took a deep breath as he reached out and pushed on the door.</p><br/><p>Heaven-shaking, Earth-shattering power erupted out. It quickly reached the peak of the 9-Essences level, which exceeded the power of the Second Paragon and the others like him.</p><br/><p>However, it didn't stop there. It continued to rise with explosive force, surpassing Jin Yunshan, Sha Jiudong, and Bai Wuchen, and causing their eyes to widen.</p><br/><p>Although they were completely aware of how terrifying Meng Hao was, it was only now that they could sense the true astonishing level of his cultivation base.</p><br/><p>Things weren’t over yet. Increasingly boundless cultivation base power exploded out. As Meng Hao’s power continued to climb, he eventually exceeded even the level of the Sect Leader. It reached the point where he was above any and all 9-Essences cultivators. And yet, the door didn’t so much as budge.</p><br/><p>Meng Hao frowned at the lack of reaction. Throwing all of the power he could manage at it was as good as throwing a stone ox into the ocean. Eyes flashing, he waved his right hand, and the copper mirror appeared. Black threads spread out, covering his entire body in the form of a suit of armor.</p><br/><p>With the black armor, his energy rose even higher, and a tempest sprang up around him. The Sect Leader and the other 9-Essences experts all gasped and began to back away.</p><br/><p>They didn't come to a stop until they were several hundred meters away, where they looked at Meng Hao with fear and shock.</p><br/><p>Meng Hao was so terrifyingly powerful that they weren’t sure they could fight him even if they all joined forces.</p><br/><p>With the suit of armor, his cultivation base was at its very pinnacle. He reached out and once again shoved against the door. As far as the Sect Leader could remember, they had never seen the door move at all during the past several hundred years. However, as of this moment, it shuddered.</p><br/><p>Although it only lasted for a moment, it left the Sect Leader’s mind spinning, and he began to pant in anticipation. It wasn’t that he lacked willpower. Rather, after stepping into the 9-Essences level, all of his dreams had become wrapped up with the hope that lay in this necropolis.</p><br/><p>Blue veins bulged on Meng Hao’s face as he unleashed incredible power through his hand. The result was that the door vibrated slightly, and yet, didn’t move.</p><br/><p>A vicious expression appeared in Meng Hao’s eyes as he raised his left hand to also push against the door.</p><br/><p>Energy blasted out in all directions, and a booming sound like that of a bell echoed out through the eighth land mass, then to the seventh, the sixth... and all the way to the first land mass.</p><br/><p>The door vibrated again, and a cloud of dust rose up, but the door still didn’t open. Meng Hao frowned.</p><br/><p>He was at the peak level of power, and yet even then, couldn't open the door. That seemed to indicate that only someone who had Transcended could open it.</p><br/><p>“But someone who had Transcended wouldn’t need the altar on the ninth land mass. Therefore, the method to open the door can’t relate to Transcendence. There must be some other way.” After some thought, Meng Hao sent his divine sense out to fill the eighth land mass. It took some time, but he managed to lock down on some of the scant will of Allheaven that existed in the area.</p><br/><p>Although it was only a scrap, it was enough that it could cause problems if he tried to absorb the Ninth Hex.</p><br/><p>“Starting from the first land mass, the will of Allheaven grows weaker and weaker. Here on the eighth, there’s only a tiny bit. Therefore, the ninth... is likely to have none of the will of Allheaven at all!</p><br/><p>“That is the only place suitable to absorb the Ninth Hex, all the while avoiding interference from Allheaven, and potentially Transcend!” Meng Hao’s eyes shone with determination, and he took a deep breath. Then, he backed up a few paces and reached out to the ghosts with his will!</p><br/><p>“Break open this door!”</p><br/><p>The instant Meng Hao’s will transmitted those orders, the masses of ghosts raised their heads. Eyes glowing, they surged into motion, howling and roaring as they battered against the huge door!</p><br/><p>BOOOOOOOOOMMM!</p><br/><p>Waves of ghosts smashed into it, causing it to shake. Some of the ghosts who were especially gigantic and fierce slammed head-first into the door.</p><br/><p>Rumbling echoed out, causing all Heaven and Earth to shake violently in the necropolis as the ghosts battered the door.</p><br/><p>It was a shocking scene. Endless streams of ghosts unleashed incredible power, causing the door to rumble and vibrate even more intensely than when Meng Hao had pushed against it.</p><br/><p>The combined power of the ghosts of all eight of the land masses was something that even Meng Hao with his battle prowess would be fearful of. Now, it was causing the door to tremble, making it seem like opening it wasn’t an impossibility after all.</p><br/><p>The Sect Leader and the others were completely shaken. Beyond this door was the hope they sought. It had blocked their way for hundreds of years, but now seemed like the most likely moment in which it could be opened!</p><br/><p>Jin Yunshan was the first to take action. Roaring, he unleashed his cultivation base and his Essence power, reaching out with both hands to push against the door.</p><br/><p>The Sect Leader followed a moment later, unleashing divine abilities and Essence power to create a huge hand that shoved against the door.</p><br/><p>Next was Sha Jiudong, who transformed into a sandstorm that swept out with incredible power. Then was Immortal Bai Wuchen, who summoned powerful mists. All of the other 9-Essences Paragons unleashed their cultivation base power. They kept nothing hidden, utilizing everything at their disposal to slam against the door.</p><br/><p>Under their combined assault, the door leading to the ninth land mass, which had blocked their path for so long, began to rumble loudly, and shake visibly. It seemed as if the door might open at any moment.</p><br/><p>Meng Hao’s eyes were bright red as he transformed into a huge roc which, in the blink of an eye, shot forward to slam into the door.</p><br/><p>Mountains shook and the lands quaked. The door trembled, as if it might open by a sliver.</p><br/><p>However, that tiny sliver was like the difference between Heaven and Earth. Despite the combined assault of the entire group of cultivators, plus the endless army of ghosts, the door still didn’t open. The Sect Leader and the others were beginning to despair.</p><br/><p>“We can’t open the door in this way...?”</p><br/><p>“How do we do it? Could it really be true that only a Transcendent cultivator can open it?!”</p><br/><p>“Impossible. Why would a Transcendent cultivator ever try to get to the ninth altar!?” In their despair, everyone was pushing as hard as they could, even coughing up blood.</p><br/><p>The ghosts emitted soundless screams. Everyone was pushing out with all the power they could muster. Meng Hao began to pant. Finally, he sent out his will via divine sense, filling the entire eighth land mass.</p><br/><p>It was like a bolt of lightning that landed upon the various corpses on the land mass, within whose eyes burned white, burning light. They began to run, faster and faster, until soon they became visible off in the distance.</p><br/><p>More and more corpses appeared, running toward the door itself, which they then began to push against. They seemed endless, and as they pushed against the door, at long last, it opened up by a sliver.</p><br/><p>That completely enlivened the Sect Leader and the others. Meng Hao’s eyes gleamed with anticipation, and he pushed forward even harder. Finally, the door opened!</p><br/><p>Meng Hao in azure roc-form shot forward through the opening, followed closely by the Sect Leader and the others. It was with complete and utter excitement that they flew through the air at top speed.</p><br/><p>Finally, they were able to enter... the ninth land mass!</p><br/><p>This was the final land mass in the necropolis, and also the location of that huge throne.</p><br/><p><strong>Chapter 1530: The Ninth Land Mass!</strong></p><br/>\n</div>"}