{"title": "Chapter 1554: Transcendence Treasure!", "id": 1554, "volume": 16, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-1554-transcendence-treasure", "volume_title": "Volume 16", "body": "<h1>Chapter 1554: Transcendence Treasure!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 1554: Transcendence Treasure!</strong></p><br/><p>Tears streamed down Xu Qing’s face, and she smiled. Meng Hao’s father and mother stood next to her, looking extremely excited and proud.</p><br/><p>This was their son. Their Meng Hao!</p><br/><p>As all of the Mountain and Sea cultivators burst with excitement, the Ninth Sea was off in the distance, battling with the Paragon puppet.</p><br/><p>The Ninth Sea had been pushed to the limit in the fighting, and had shrunk down so much that it was no longer boundless and majestic like before.</p><br/><p>Now, it appeared to be trying to take advantage of the commotion caused by the appearance of Meng Hao. The woman’s face appeared within it as it began to back up as if to flee. At that point, Meng Hao looked over.</p><br/><p>“Did I say you could leave?” he asked coolly.</p><br/><p>His gaze struck the Ninth Sea like a physical blow. It began vibrating, and the woman’s face filled with fear. His voice was like the magical law of Heaven and Earth, which instantly locked down the path of escape.</p><br/><p>At the same time, all of the Mountain and Sea cultivators turned to look at the Ninth Sea, their gazes bursting with killing intent. That was especially true of the veterans of the Mountain and Sea War, who hated the Ninth Sea deep in their bones.</p><br/><p>Upon facing the gazes of so many cultivators, the womanly face of the Ninth Sea let out an enraged roar.</p><br/><p>“You forced me to do what I did. You are the Lord of the Mountain and Sea Realm, and you swore an oath to erase my mind. What other choice did I have but to betray the Mountain and Sea Realm!?</p><br/><p>“It was you! All of this is because of you! You wanted to exterminate my people, you wanted to wipe me out. I had to fight back, I had to resist. My betrayal is all your fault!”</p><br/><p>At first, Meng Hao didn't say anything in response to the Ninth Sea’s howling. But then he sighed.</p><br/><p>“That scheme of yours lurked in your duplicitous heart for ages. Why try to pin the blame on me? Even without that oath of mine, you would have picked a good time to turn traitor.” Considering the level of his cultivation base, and his experience, he had long since come to a clear understanding of the Ninth Sea’s actions.</p><br/><p>The Ninth Sea hesitated for a moment, then bitterly cried, “I wasn’t in the wrong. I just wanted to be able to think for myself. I didn't want to be a part of the Mountain and Sea Realm forever!” Suddenly, the seawater churned, and the face of the woman shot away as if to flee.</p><br/><p>However, it was obvious that she wouldn’t be able to escape. In fact, her decision wasn’t really an attempt to flee, but rather, a way to seek death. By this point, there was nothing she could do to change everything which had occurred.</p><br/><p>“After you die,” Meng Hao said, “everything will be a thing of the past. Ashes to ashes, dust to dust....</p><br/><p>“You don’t need the Mountain and Sea Realm, and the future Mountain and Sea Realm doesn't need you....” Meng Hao extended his right hand and made a vicious grasping motion toward the Ninth Sea. It was as if an enormous, invisible hand had grabbed the woman’s face, preventing her from fleeing no matter how much she struggled, and no matter how much the water churned. Then, he jerked his hand, sending the Ninth Sea flying into the flames above.</p><br/><p>The Mountain and Sea Realm cultivators watched as the face that represented the Ninth Sea plunged into the sea of flames and began to burn. Screams echoed out as the face shrank down and down. Soon, the only thing left behind was the Ninth Sea's soul!</p><br/><p>There it burned within the fire, unable to die.</p><br/><p>Meng Hao waved his finger, causing all of the souls of the Outsiders who had been killed in the 1st through 10th Heavens to fly out into the open.</p><br/><p>They cried out for mercy, and terror filled their faces, but all Meng Hao did was wave his sleeve, sending the boundless collection of souls flying up in a beam of light into the sea of flames.</p><br/><p>As the souls entered the fire, they began to burn among the countless other Outsider souls.</p><br/><p>The sight of it caused the Mountain and Sea cultivators to tremble, not from fear, but from the fact that their revenge had finally been carried out.</p><br/><p>“See that, Master? Master, I avenged your death!”</p><br/><p>“Dad, mom, your son has gained vengeance!”</p><br/><p>“Di Kongzi, the day you died, I promised that if I made it out alive, I would get revenge for you. Finally, it’s happened!”</p><br/><p>“I hope the Patriarchs and the sect can all rest in peace....” Countless wailing voices could be heard from the cultivators who had fought in the Mountain and Sea War. Every one of them had a story of their own, friends or family who had been killed. Finally, their revenge had been exacted, and they wept, wrapped up in their thoughts of the past. The sound of the crying echoed out into the void.</p><br/><p>Fatty sobbed, as if he were able to see all of his Daoist partners and children from the past standing around him. Wang Youcai had a bitter expression on his face as he thought back to his life in the sects he had been a part of.</p><br/><p>Ksitigarbha laughed bitterly, and also cried. Li Ling’er murmured Sea Dream’s name.</p><br/><p>Zhixiang trembled. Considering the level of her cultivation base back during the war, it was somewhat of a miracle that she even survived. Many stories could be told based on the events of her life.</p><br/><p>Every one of the old-timers wept.</p><br/><p>Meng Hao’s eyes shone with grief as he thought back to the past, and the unforgettably bitter events which had propelled him from being almost like a silkpants cultivator to maturity.</p><br/><p>After a long, long moment passed, something happened. It was hard to say who did it first, but the Mountain and Sea Realm cultivators began to wipe away their tears and then drop to their knees.</p><br/><p>“Many thanks, Demon Sovereign!”</p><br/><p>One by one, they began to kowtow, until all of the Mountain and Sea Realm cultivators were crying out to him.</p><br/><p>“Many thanks, Demon Sovereign!!”</p><br/><p>“Many thanks, Demon Sovereign!!!”</p><br/><p>Meng Hao took a deep breath and looked around at everyone. The truth was that he could have easily wiped out the 33 Heavens by himself. But he didn’t. He gave them an opportunity for revenge.</p><br/><p>It was not his revenge alone. It belonged to all of the cultivators of the Mountain and Sea Realm!</p><br/><p>Of course, Meng Hao knew that this was only part of their revenge. The Immortal God Continent and the Devil Realm Continent still had to be dealt with. By now, he was almost completely sure that his speculations about them were true. He was also certain that the will of Allheaven would drive the two land masses to come to attack him.</p><br/><p>“I made two promises in the past....” Meng Hao said softly, looking around at the crowds. The cultivators of the Mountain and Sea Realm all looked up at him, their eyes burning with passion.</p><br/><p>“One of them was that I would come back.</p><br/><p>“The other... was that I would return to where the Mountain and Sea Realm had been destroyed, and rebuild it!” As the words left his mouth, the Mountain and Sea cultivators began to tremble inwardly. That was especially true of the older ones. As for the ones born in more recent times, they were also filled with anticipation. After all, they had heard countless stories of the Nine Mountains and Nine Seas of the Mountain and Sea Realm!</p><br/><p>It was their ancestral home too.</p><br/><p>Meng Hao extended his hand and made a grasping motion. The void trembled, and rumbling sounds echoed out as a huge vortex appeared, with Meng Hao’s hand at the center. In the blink of an eye, it spread out to fill the entire area in the starry sky.</p><br/><p>“Oh destroyed Mountains and Seas, by the power of my name, I, Meng Hao, call for you... to return!” As his voice echoed out, natural law changed, and magical law was altered. Shockingly, countless bits of dust and rubble in the area began to rise up.</p><br/><p>A mountain boulder that had been hanging in the starry sky for centuries began to vibrate, and then shine with dazzling light!</p><br/><p>Drops of water floating about began to move, almost as if they possessed thought, and were waking up. Brilliant light began to shine out.</p><br/><p>The effect began to spread out all through the boundless starry sky. Boulders, shattered rock, drops of water, endless dust. Regardless of where the were or what shape they were in, they all began to fly toward Meng Hao!</p><br/><p>These were the destroyed remnants of the Mountain and Sea Realm, fragments which were now flying through the void, flying through the starry sky, flying through time itself.</p><br/><p>Massive booms rang out as the countless fields of rubble transformed into dazzling beams of light which began to take shape within the vortex.</p><br/><p>“First Mountain and Sea!” Meng Hao said, eyes shining with a strange light. He raised both hands into the air, and all reality seemed to shake. All living beings which existed in the starry sky of the Vast Expanse could hear the words he spoke.</p><br/><p>“I call upon the power of my name to take the First Hex, the Beginning-Ending Hex, and embody it in the First Mountain and Sea. Henceforth... you are the Beginning-Ending Mountain and Sea, responsible for transformations of seasons within the Mountain and Sea Realm!</p><br/><p>“Cultivators in this Mountain and Sea may cultivate my Beginning-Ending Hex, and gain enlightenment of the Essences of beginnings and endings. This hex will now be called the First Hex of the Mountains and Seas!”</p><br/><p>As soon as the words left his mouth, the power of Transcendence propelled the First Hex into the First Mountain and Sea, becoming its foundation.</p><br/><p>The Hexing magic became the bones, and the Mountain and Sea became the flesh!</p><br/><p>Almost immediately, the shape of the First Sea and the First Mountain became visible!</p><br/><p>The cultivators who were originally from the First Mountain and Sea were so excited they were crying. When they saw the sea and the mountain taking shape, they began to tremble. They were looking at their home.</p><br/><p>Rumbling could be heard as the First Mountain took final shape, complete with all of its planets!</p><br/><p>Meng Hao was not just calling back the old Mountain and Sea Realm, he was refining it, making it into... a new Mountain and Sea Realm!</p><br/><p>It was... a Transcendence Treasure!</p><br/>\n</div>"}