{"title": "Chapter 1559: Reunions", "id": 1559, "volume": 16, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-1559-reunions", "volume_title": "Volume 16", "body": "<h1>Chapter 1559: Reunions</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 1559: Reunions</strong></p><br/><p>Now that Meng Hao had returned in the most spectacular of fashions as the Demon Sovereign, there was nothing Zhixiang could do but sigh and bury her bitterness deep within her heart.</p><br/><p>“You should have grabbed him when you had the chance,” she murmured to herself. “Instead you lost him... lost him for all eternity.” With that, she bowed her head and offered greetings to Meng Hao and Xu Qing.</p><br/><p>Meng Hao apparently didn’t notice the look in her eye. Considering they were old friends, he prevented her from offering extended formal greetings. Of course, he couldn’t help but sigh when he noticed how much older she looked. Xu Qing, on the other hand, could sense what Zhixiang was thinking. After looking at her deeply for a moment, Xu Qing smiled.</p><br/><p>Zhixiang was an old friend, but there was someone else in the Demon Immortal Sect who was even more important to Meng Hao. He absolutely had to go pay his respects to his older brother Ke Jiusi.</p><br/><p>Meng Hao went alone up the mountain to Ke Jiusi’s secluded meditation chamber, while Xu Qing and Zhixiang waited together at the foot of the mountain. As Ke Jiusi emerged to talk with Meng Hao, Zhixiang suddenly said, “Congratulations....”</p><br/><p>Xu Qing looked over at her, blinked, and then smiled.</p><br/><p>Up at the top of the mountain, Ke Jiusi tossed an alcohol flagon over to Meng Hao, then chuckled. Meng Hao looked at Ke Jiusi, smiled, then closed his eyes and took a long swig of alcohol.</p><br/><p>After a moment passed, he opened his eyes and quietly said, “I saw foster father outside the Vast Expanse.”</p><br/><p>Ke Jiusi stood there for a moment before patting his hand onto the boulder he was sitting on, an invitation for Meng Hao to sit down next to him. Meng Hao sat.</p><br/><p>“Tell me about it,” Ke Jiusi said.</p><br/><p>Meng Hao slowly recounted the story of the time he had spent in the world outside the Vast Expanse, which had existed in another time. Ke Jiusi listened quietly, occasionally drinking from his flagon. By the time Meng Hao finished, a touch of the effects of the alcohol could be seen in Ke Jiusi's eyes, although for the most part, there was only reminiscence.</p><br/><p>“Back then, I was a silkpants,” he said. “Of course, you know that.... Father was always disappointed in me, and yet he still did everything he could to prepare a way for me to remain in the world, undying. That was just how he was. He treated me and you the same, because in his heart, both of us were his sons.” Ke Jiusi closed his eyes to cover up the tears which were welling up. He missed his father, and he missed the past.</p><br/><p>Meng Hao took a long drink and then looked off into the distance. He almost felt as if he could see his foster father. He had attempted to resurrect him before, but even with the supposed omnipotence of Transcendence, it was still a very difficult thing to resurrect the soul of someone who had died so many years ago.</p><br/><p>Meng Hao and Ke Jiusi drank together on the mountain top for seven days. When it finally came time for Meng Hao and Xu Qing to leave, Ke Jiusi stood there watching them leave. Then he took another long drink.</p><br/><p>The final Paragon in the Mountain and Sea Butterfly was the Paragon Puppet, who had once been Paragon Eegoo of the 33 Heavens. Meng Hao could see the puppet from some distance away; it was sitting cross-legged in its appointed area, completely motionless. Its mission had been to defend the world of the Mountain and Sea Butterfly, a mission that he had left to it upon his own departure years ago.</p><br/><p>Meng Hao walked up to the Paragon, stood there, and then quietly said, “When did you come back?”</p><br/><p>The Paragon puppet shivered, then slowly looked down. After a long moment passed, it spoke, although its voice was hoarse as if from disuse.</p><br/><p>“500 years ago....”</p><br/><p>It was a puppet, and its mind had been erased. 500 years ago, though, it began to remember things. From that day on, although it was still a puppet, it had been aware of who it was. However, it was unable to part from the Mountain and Sea Realm. It saw how much the Mountain and Sea cultivators respected it, a respect that was genuine even though it was only a puppet.</p><br/><p>It had even watched many cultivators be born into the world of the butterfly, and grow up. It was filled with strange emotions, and in the end, chose not to return to the 33 Heavens. It also chose not to betray the Mountain and Sea cultivators, and even tried to forget about the memories which had been awakened.</p><br/><p>“You’re free now,” Meng Hao said. He patted Eegoo, releasing the bonds which restrained him. Then he and Xu Qing turned to leave.</p><br/><p>Paragon Eegoo shivered. After a moment passed, he rose to his feet, a blank look in his eyes. However, that blankness quickly disappeared, and his gaze turned hard. Then, he sat back down cross-legged, to continue standing guard.</p><br/><p>Off in the distance, Xu Qing hesitated for a moment and then asked, “He...?”</p><br/><p>“He has paid for his sins and atoned for his errors. I underestimated Eegoo back then. He’s a wise person.” Meng Hao squeezed Xu Qing’s hand, and then smiled.</p><br/><p>The world of the Mountain and Sea Butterfly was abuzz with activity as everyone prepared to move. As the preparations were carried out, Meng Hao and Xu Qing appeared in one location after another to visit people they knew.</p><br/><p>Xu Qing was very happy. As long as Meng Hao was there with her, the world was a bright place. She didn’t demand much of him. After all, her personality was simple and uncomplicated.</p><br/><p>The two of them visited friends and enjoyed traveling. It was as if they would never tire of speaking to each other, as if there would always be more places for them to visit.</p><br/><p>When Xu Qing looked at Meng Hao, it was with warmth and deep passion that would last for one lifetime and all lifetimes.</p><br/><p>“I can’t stand this,” Fatty said, sighing. “Can’t stand it, I tell you!” After Meng Hao and Xu Qing arrived at his clan, he looked over at Meng Hao with a look of pity.</p><br/><p>“Meng Hao, look at you. You have such a high cultivation base, and yet you only have one wife? That's wrong! That’s unreasonable. Look at me! I have a few thousand wives again, and also lots of children....” Suddenly, everything seemed to grow very cold. Fatty shivered and looked over to find Xu Qing staring at him with narrowed eyes. Realizing that she was the source of the coldness, he cleared his throat a few times.</p><br/><p>Meng Hao smiled and looked around at all of Fatty’s progeny. Soon they were talking about past times, whereupon Wang Youcai arrived. He had a jar of alcohol slung over his shoulder, which he set down in front of Meng Hao, Xu Qing, and Fatty.</p><br/><p>“Dong Hu’s on the way,” he said. “He should be here any moment.”</p><br/><p>“You two worked things out?” Meng Hao asked. The conflict between Wang Youcai and Dong Hu had been severe, but it was a matter between the two of them, and Meng Hao didn't want to press for too many details.</p><br/><p>Wang Youcai didn’t respond at first. After a moment, he sighed and said, “It's all in the past....”</p><br/><p>He looked very old in that moment. Suddenly, a bright beam of light appeared up above, within which was a middle-aged man. It was none other than Dong Hu.</p><br/><p>A complicated expression could be seen on his face as he walked over quietly and sat down next to Fatty. When he looked over at Meng Hao, he was smiling emotionally.</p><br/><p>Feeling the tension rising, Fatty suddenly looked around and said, “Remember Mount Daqing?”</p><br/><p>In response, Wang Youcai tilted his head up, and Dong Hu’s eyes flickered with memories. Meng Hao thought back to everything that had happened in the past. Xu Qing did the same, and she smiled.</p><br/>\n</div>"}