{"title": "Chapter 1566: The Resources!", "id": 1566, "volume": 16, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-1566-the-resources", "volume_title": "Volume 16", "body": "<h1>Chapter 1566: The Resources!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 1566: The Resources!</strong></p><br/><p>In addition to the fighting between the 9-Essences experts, there were other battles between the 7 and 8-Essences Paragons. The shocking nature of the fighting caused the entire starry sky to shake violently.</p><br/><p>There were also Imperial Lords, Dao Sovereigns, and Dao Lords. The sheer numbers involved ensured that the fighting on the battlefield was intense to the extreme. Of course, the bulk of the fighting was taking place between the Ancient Realm and Immortal Realm cultivators, of whom there were vast numbers. The vast sea of battling cultivators constantly crushed those on the front lines into a bloody pulp!</p><br/><p>Blood rained down as the death toll rose rapidly!</p><br/><p>The cultivators of the Immortal God Continent had no reason to hold back from fighting, and the thought of retreat didn’t even exist in their minds. It was almost as if there were something inside of them urging them to forget everything else and focus only on fighting.</p><br/><p>As for the cultivators from the Vast Expanse School, they were fighting for a Transcendent cultivator. Dying in battle would be the ultimate of honors, and besides, even if they did die, they had faith that their Transcendent leader would be able to bring them back from the dead.</p><br/><p>And that was in fact the case.</p><br/><p>Meng Hao stood there looking out at the Immortal God Continent and all its cultivators, and his eyes glowed with coldness.</p><br/><p>He hated the 33 Heavens.</p><br/><p>But he hated the Immortal God Continent and the Devil Realm Continent even more!</p><br/><p>This was a battle for vengeance!</p><br/><p>As he stared coldly at the battle, his brow slowly furrowed. In the past, the cultivators from the Immortal God Continent had seemed particularly sharp and quick-witted. But now, they somehow seemed slower, although physically they were the same as before.</p><br/><p>“My speculations are most likely correct,” Meng Hao thought. As far as he was concerned, he was now almost completely convinced that he was right about the Immortal God Continent and the Devil Realm. Beneath him, the old lizard looked around with killing intent flickering in its eyes. However, without Meng Hao’s express orders, it wouldn’t take action. Instead, it just watched the carnage unfolding. Soon, the fighting had reached an incredible climax. Screams echoed out constantly, until finally, Meng Hao’s eyes flickered. Even as he looked over at the Immortal God Continent, booming sounds rang out as over a hundred volcanoes began to erupt simultaneously.</p><br/><p>Pillars of flame rose up into the sky, causing everything else to grow dark. At the same time, numerous seven-colored puppets appeared within the fire. [1. This appears to be a reference to a character in Renegade Immortal called the Seven-Colored Daoist]</p><br/><p>The puppets began to form together into phalanx formations, over a hundred of them. They emanated spectacular energy, and an ancient air that seemed to stretch back through countless years of time.</p><br/><p>The appearance of the seven-colored puppets instantly lifted the spirits of the Immortal God Continent cultivators. It was as if they were now gazing upon the key to victory.</p><br/><p>This was one of the Immortal God Continent’s reserve powers, seven-colored puppets concealed within the volcanoes for countless years, puppets that seemed to have their own unique natural law. That natural law could influence space, and was filled with power that could alter Heaven and Earth and lead to assured victory.</p><br/><p>Soon, the more than one hundred phalanxes of seven-colored puppets were slaughtering their way into the forces of the Vast Expanse School.</p><br/><p>Meng Hao stood calmly atop the head of the old lizard. After looking at the seven-colored puppets for a while, his gaze shifted to the statue of the Immortal God Continent’s Transcendor.</p><br/><p>Things had not yet reached the point where he needed to intervene. The Vast Expanse School was a powerful force, and even though they were away from the sect on a campaign, unable to bring many of their most powerful reserve weapons, they were still not a force to be underestimated.</p><br/><p>Almost as soon as the seven-colored puppets took action, the Vast Expanse School’s 9-Essences Paragons joined their voices together to shout, “Vast Expanse Blood Formation!”</p><br/><p>Instantly, the forehead of each and every one of the countless Vast Expanse cultivators opened up, and a drop of blood flew out. The drops then merged together into a vast sea of blood, from within which emerged numerous blood-colored giants. The giants threw their heads back and let out enraged roars as they jumped forward to fight the seven-colored puppets.</p><br/><p>The intense fighting caused the entire starry sky to shake!</p><br/><p>The Vast Expanse Blood Formation slammed into the seven-colored puppets, sending a shockwave blasting out in all directions. Almost immediately, the seven-colored puppets were shoved backward, and the light shining off of them dimmed.</p><br/><p>Although the Immortal God Continent was strong, the Vast Expanse School was a powerful force which had given birth to a Transcendent cultivator. A battle between the two was not the type in which victory could be easily determined.</p><br/><p>As Meng Hao watched the seven-colored puppets being forced back across the battlefield, his eyes flickered with a strange light. He looked more closely at the Immortal God Continent, and the cultivators from there, and a thoughtful look appeared in his eyes. But then, rumbling sounds suddenly filled the air.</p><br/><p>The entire Immortal God Continent appeared to be shaking. Mountain peaks began to sway back and forth, and then cracking sounds rang out as they rose up into the air. Various sects covered those mountain peaks, of which there were fully 1,000,000. The sight of them all rising up into the air was completely shocking.</p><br/><p>Next, it was as if a seal had been undone. The peakless mountains had apparently been opened up, as countless shocking roars echoed out from inside of them. Shockingly, dragons appeared from the 1,000,000 mountains, immediately flying high up into the air.</p><br/><p>The enormous dragons emanated pressure that could strike fear deep into anyone's soul, and their roars caused wild colors to flash in the air. Wind screamed up into a tempest as the dragons charged toward the army from the Vast Expanse School.</p><br/><p>“Very impressive, Immortal God Continent,” Meng Hao murmured, eyes glittering brightly. He waved his hand, and the old lizard let out a howl and charged toward the fighting at top speed. Almost immediately, it appeared above the Immortal God Continent, where it suddenly changed form, transforming into something like a river of stars that stretched out overhead in dazzling fashion.</p><br/><p>A huge roar became a sound wave filled with killing intent, and the enormous dragons began to tremble. As they fought back, the old lizard was blocked, and yet at the same time, the dragons were also held in check.</p><br/><p>Shockingly, the old lizard was single-handedly preventing all of the huge dragons from doing a single thing.</p><br/><p>Heaven and Earth shook wildly, and the starry sky filled with rumbling sounds. The fighting had reached an incredible level of intensity. The Immortal God Continent cultivators were being pushed back by the Vast Expanse School, until they were almost on the continent itself.</p><br/><p>Because the old lizard was keeping the huge dragons in check, the Immortal God Continent was now in a moment of grave crisis.</p><br/><p>“The Immortal God Continent must have more resources at their disposal than this,” Meng Hao murmured. His expression was the same as ever as he hovered there in the starry sky.</p><br/>\n</div>"}