{"title": "Chapter 1579: Emperor Dragon Transformation!", "id": 1579, "volume": 16, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-1579-emperor-dragon-transformation", "volume_title": "Volume 16", "body": "<h1>Chapter 1579: Emperor Dragon Transformation!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 1579: Emperor Dragon Transformation!</strong></p><br/><p>Among those nine heads were men and women, old and young, people and beasts. Their roar caused Meng Hao’s pupils to constrict. For some reason, something seemed very wrong about Allheaven as of this moment.</p><br/><p>Shockingly, faces could be seen on all of the scales of his snake body, making him seem utterly and thoroughly terrifying.</p><br/><p>The blast of wind caused by the roar of the nine heads was something that only 9-Essences experts could endure without being knocked unconscious. This nine-headed serpent was an entity that virtually no one recognized, and yet it filled them all with terror.</p><br/><p>In contrast to everyone else... old lizard let out a cry of disbelief at the sight of those nine heads. All of the scales on its body stood on end.</p><br/><p>“The Nine-Head Tribe!” cried the lizard. “It's from the Nine-Head Tribe!!</p><br/><p>“They were destroyed years ago in a previous epoch. According to the legends, they were one of the most powerful of the beast tribes back when the starry sky of the Vast Expanse had just been created!!</p><br/><p>“The Nine-Head Tribe was invincibly domineering for ten full epochs....” It was entirely possible that the old lizard was the only individual present who knew anything about the existence of the Nine-Head Tribe, mostly because it actually possessed a bit of that tribe’s bloodline within it. [1. This Nine-Head Tribe appears to be a reference to a race of beings from Beseech the Devil. In fact, I was doing a bit of research and noticed that there is a “huge lizard” which appears in the early parts of that same story. I’m not sure if that’s the same lizard as the old lizard mentioned here, but I wouldn’t be surprised. Another interesting thing is that “ten epochs” of time passed in the final chapters of Beseech the Devil]</p><br/><p>Even as the old lizard was shrieking, Meng Hao’s eyes flickered. When he looked at the nine-headed serpent, he couldn't help but think back to the Immortal God Continent and the Devil Realm Continent.</p><br/><p>“Everything which has ever existed in this starry sky will be remembered, and is imprinted upon the will of the starry sky itself. Allheaven can create something from nothing based on anything in his memory....”</p><br/><p>Even as Meng Hao pondered these things, Allheaven looked at Meng Hao with eighteen eyes, eyes that glowed with brutal madness. Suddenly, he blurred into motion, leaving behind afterimages and kicking up a wild tempest. Rumbling sounds echoed out as he appeared directly in front of Meng Hao, his tail sweeping out in a vicious attack.</p><br/><p>The starry sky crumbled under the power of the tail, which exceeded the 9-Essences level. Heavenly bodies collapsed, and Meng Hao’s eyes glittered with an icy light as he clenched his right hand into a fist and punched straight out.</p><br/><p>As the fist made contact with the tail, the void shattered, massive rumbling sounds echoed out, and the serpent that was Allheaven shuddered. Meng Hao trembled as he tumbled backward, and yet even as he fell back, the nine-headed serpents’ eyes all closed.</p><br/><p>A tear emerged from each closed eye, a total of eighteen. As the tears appeared, a shocking aura of resentment exploded out. Then the tears glistened, transforming into eighteen beams of light that shot toward Meng Hao.</p><br/><p>“Nine-Head Tears! Nine-Head Tears!!” the old lizard howled. “Watch out, Meng Hao! That’s the killing move of the Nine-Head Tribe. All the resentment in his body is converged into a magic of ultimate destruction!!”</p><br/><p>As the eighteen glistening tears bore down on Meng Hao, his eyes flickered, but he did nothing to evade. Hovering in place, he lifted his right hand and pushed it out toward the tears.</p><br/><p>“Beginning!” he said. Immediately, a Demon Sealing Hexing magic was unleashed. Considering that his Hexing magics were absolutely complete, and backed by the power of Transcendence, their power was enough to shake the entire Vast Expanse.</p><br/><p>In response to the single word he had spoken, the eight teardrops stopped in place, looking as though they would dissolve at any moment. As soon as Meng Hao spoke the word “beginning” from the Beginning-Ending Hex, all things returned to their basic Essence.</p><br/><p>Seeing that the killing move had been negated, the nine-headed serpent’s eighteen eyes opened, and it roared. Shockingly, its body began to split apart!</p><br/><p>Numerous figures burst out from inside, and if one looked closely, one would see that they were all nine-headed serpents of various sizes and shapes. There were more than ten thousand in total, all of them radiating resentment and madness as they shot toward Meng Hao.</p><br/><p>“The Tribal Deathblow. I can’t believe... it's the Tribal Deathblow of the Nine-Heads Tribe!!</p><br/><p>“Supposedly, members of the Nine-Head Tribe can unleash this move in the moments before being killed. By making a self-sacrifice of mutual destruction, they can unleash the full power of their tribe to destroy any enemy!” The old lizard was trembling at the sight of what was happening.</p><br/><p>The countless nine-headed serpents emitted shrill shrieks as they spun through the air like a huge wave, closing in on Meng Hao with raging killing intent.</p><br/><p>“The Nine-Head Tribe might have been powerful, but they never produced a Transcendor,” murmured Meng Hao. “Even if one of them reached fleshly body Transcendence, that’s still not good enough.</p><br/><p>“This version of the tribe was created by the first Allheaven Transformation, and didn’t come about naturally. It’s nothing more than a flight of fancy.” With that, Meng Hao clenched his right hand into a fist.</p><br/><p>“Ending!” he barked</p><br/><p>Rumbling could be heard as the Beginning-Ending Hex was fully unleashed. Boundless power erupted from Meng Hao's Dao Essence, forming into his hand, which he slowly opened up into a palm. It was as if the starry sky existed within his hand, and that anything inside of his palm could be destroyed by simply closing his fingers!</p><br/><p>RUUUUUUUUUUMBLE!</p><br/><p>The eighteen tears were destroyed, and the rest of the nine-headed serpents all exploded, becoming nothing more than ash drifting about in front of Meng Hao.</p><br/><p>“I can see what you're doing, Allheaven.... You just want to study my Demon Sealing Hexing magic, don’t you? Well then, I’ll go ahead and show you!” Killing intent flickered in Meng Hao’s eyes as he took a step forward, waving his hand to unleash the Second Hex! He was not the type to wait for others to take the initiative!</p><br/><p>“Real!” he said, and the starry sky trembled.</p><br/><p>At the same time, even as the nine-headed serpents were fading away, Allheaven formed anew in the void up ahead, glaring at Meng Hao with the eighteen eyes of his Nine-Head form. At the same time that the Second Demon Sealing Hex was unleashed, so was... the second Allheaven Transformation!</p><br/><p>“Second Transformation, Nine-Heads becomes a dragon, Emperor Dragon Transformation!” [1. I’m pretty sure this Emperor Dragon is something which appears in the later chapters of Renegade Immortal]</p><br/><p>Allheaven threw his head back and howled. His body then began to grow, and it no longer looked like a serpent. Horns grew out of his head, and he sprouted nine claws. Eight of his heads began to wither down, eventually becoming a crown that rested upon the only remaining head!</p><br/><p>Allheaven’s clone now hovered there in the starry sky, having taken the shocking form of an Emperor Dragon!</p><br/>\n</div>"}