{"title": "Chapter 1585: Consuming Allheaven!", "id": 1585, "volume": 16, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-1585-consuming-allheaven", "volume_title": "Volume 16", "body": "<h1>Chapter 1585: Consuming Allheaven!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong></strong></p><br/><p>[/expand]</p><br/><p>The enormous hand rose up toward the man and the mountain.</p><br/><p>The person and the mountain made the Immortal. As for Meng Hao, he used the power of Transcendence to combine six Hexes into one. What resulted was a power that could shock all living things. It became a hand that seemed capable of ripping apart the entire starry sky.</p><br/><p>All of this happened in the time it takes a lightning bolt to strike. In fact, other than Meng Hao himself, no one could clearly see what had happened as Allheaven’s clone transformed into the Immortal.</p><br/><p>All they could see was a huge hand slamming into a mountain. In that instant, everything cracked and crumbled, the starry sky was thrown into chaos, and the void shattered. Cracking sounds filled the starry sky, and rifts snaked out from the spot where the hand met the mountain, gaping chasms that were like vicious dragons, roaring as they spread out in all directions.</p><br/><p>The starry sky of the Vast Expanse was like a mirror, which was now cracking into so many pieces that it seemed as if it might shatter at any moment.</p><br/><p>All cultivators felt blood oozing out of their eyes, ears, noses and mouths. They began to back up, trembling with more astonishment and fear than they could ever have imagined.</p><br/><p>When the Demon Sealing Hexing magic met the Immortal, it was one of the most powerful interchanges which had ever occurred within the starry sky of the Vast Expanse. A boom rang out that burst countless eardrums. The enormous hand formed from the combined six Hexes shattered into fragments. However, before they could disperse, Meng Hao waved his hand, and they began to sweep back in his direction, becoming a raging tempest.</p><br/><p>Within that tempest, Meng Hao’s hair whipped about his head, and his eyes shone with strange light as he stared coldly at the mountain and the man!</p><br/><p>Currently, the mountain was shaking violently, as a spider-web of cracks expanded out over its surface. Rumbling sounds echoed out. This was an Immortal mountain, and yet it couldn’t hold on any longer. It began to collapse, and as it did, the Immortal version of Allheaven’s clone coughed up a massive mouthful of blood. His expression was one of madness as he backed up eight paces.</p><br/><p>“Meng Hao, things aren't finished yet!” he shrieked. Then his hands flashed in a double-handed incantation gesture, causing the rubble of the destroyed Immortal mountain to swirl toward him. In the blink of an eye, it surrounded him and began to fuse with him!</p><br/><p>It was impossible to say whether the mountain was absorbing the man, or the man was absorbing the mountain. They fused together, and an unprecedentedly powerful burst of Immortal qi emanated out in all directions. Now, what was standing in front of Meng Hao was completely different from before. He was a man, and bore the shape of a man, and yet he was actually a mountain.</p><br/><p>He was the fusion between a man and a mountain. He was the true... Immortal!</p><br/><p>“Crushing pressure!” he roared. This man-mountain combination began to spin as it shot toward Meng Hao, emanating intense, crushing pressure. This time, the energy was even more intense than before. This time, the momentum was even more astonishing!</p><br/><p>As he closed in, Meng Hao’s eyes flickered with cold light. He licked his lips, and then waved his hand, causing the tempest around him to spin with even more speed than before. Then, it began to form together in front of him in the shape of... a blade!</p><br/><p>Six Hexing magics were combined into... the Saber of the Demon Sealers!</p><br/><p>It was matchlessly sharp, and as soon as it took form, it caused all other magical and divine weapons in the starry sky of the Vast Expanse to tremble. Some magical items even cracked and began to crumble. This saber was clearly the type of weapon that all other weapons would prostrate in worship to.</p><br/><p>“Want to die? I can accommodate you!” Eyes flickering with shocking killing intent, Meng Hao blurred into motion, snatching the saber and slashing it viciously toward Allheaven’s clone!</p><br/><p>It was a blow that could shake the vault of existence, that could shock the starry sky. It was filled with completely unprecedented, dazzling power.</p><br/><p>BOOOOOOOOOMMM!</p><br/><p>It was the most powerful blow Meng Hao had ever struck. His cultivation base erupted with power, and Transcendent fleshly body and soul combined with the Essence of his Dao. He was half a step into the Ancestor Realm, and he was holding back nothing in this attack.</p><br/><p>The blade descended, and Allheaven’s clone howled in fury as he fought back with all of the power he could muster. Immortal qi surged, and yet, despite having the Immortal body of this sixth transformation, he was still incapable of defending against the Transcendent Meng Hao’s six combined Demon Sealing Hexing magics.</p><br/><p>As the blade slashed down, dazzling light flickered, and Meng Hao and Allheaven’s spun away from each other. When Meng Hao turned back, his eyes shone with cold light, whereas Allheaven’s clone looked completely shocked. He looked down at his body to see a gaping wound slashed across his torso. Before he could even say anything, his upper half toppled over as he was split in two.</p><br/><p>One half of him crumbled into the rocks which had formed the Immortal mountain, while the other half of him remained the man portion of the Immortal. However, that portion was incredibly weak, and even emanated the feeling of decay. When he looked back at Meng Hao, his expression was one of dread, and he began to back up. Unexpectedly, he was attempting to flee.</p><br/><p>He had no other choice. He had already unleashed all of the transformations he could: six was the limit that this clone could safely utilize. Only his true form could fight with more transformations than that.</p><br/><p>As he backed up, the crumbling rocks which had formed the Immortal mountain began to swirl back up toward him, as if to flee with him.</p><br/><p>Meng Hao’s expression was the same as ever, although the truth was that this battle had been very taxing. And yet, after all the incredible fighting, how could he possibly let his opponent simply flee?</p><br/><p>“Since you’ve sent this clone to me, I think I’ll just keep him!” he said. With that he reached out and waved his hand, causing bright red light to erupt out of him. Shockingly, he was unleashing... the Blood Demon Grand Magic!</p><br/><p>For the Blood Demon Grand Magic to be unleashed by a Transcendent cultivator was something completely terrifying. In fact, it was something that not even the Blood Demon himself could have comprehended. Meng Hao instantly transformed into a crimson sea which soared out to pursue Allheaven’s clone, first covering over the crumbled Immortal mountain.</p><br/><p>Instantly, the chunks of the Immortal mountain began to be absorbed. In a shocking turn of events... Meng Hao completely consumed them!</p><br/><p>These chunks of the Immortal mountain had been part of the Immortal, and could in fact be considered to be part of Allheaven’s clone!</p><br/><p>They were part of his quintessence, and now they were being absorbed by Meng Hao’s Blood Demon Grand Magic! As a result, Meng Hao’s cultivation base began to rise dramatically!</p><br/><p><strong>Chapter 1585: Consuming Allheaven!</strong></p><br/>\n</div>"}