{"title": "Chapter 1596: Goldrobes Covets the Mountains and Seas!", "id": 1596, "volume": 16, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-1596-goldrobes-covets-the-mountains-and-seas", "volume_title": "Volume 16", "body": "<h1>Chapter 1596: Goldrobes Covets the Mountains and Seas!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 1596: Goldrobes Covets the Mountains and Seas!</strong></p><br/><p>After reaching that incredibly high level and emerging from secluded meditation, Jin Yunshan rocked the entire Vast Expanse School, and even the starry sky as a whole. The first thing he did after emerging was begin to challenge all of the peak 9-Essences experts to battle.</p><br/><p>It didn’t matter if they were people from the past, or people who had risen up in recent millennia, he challenged all of them. Shockingly, the first person on his list was the former Sect Leader of the Vast Expanse School.</p><br/><p>However, upon reaching the Sect Leader’s secluded meditation facilities, he stood there silently. After sensing the fluctuations of death from inside, he realized that the Sect Leader had long since returned to the dust.</p><br/><p>Much to the excitement of all the cultivators of the Vast Expanse School, he left Planet Vast Expanse and found the old lizard, then the enormous head, and finally the termite queen.</p><br/><p>He gained victory three times, as easily as turning over his hand. Then he began to make his way through the rest of the starry sky. Everywhere he went, the powerful experts acknowledged allegiance, and bowed their heads. Considering that he could easily defeat all of the peak 9-Essences experts, he quickly came to be known as the number one most powerful expert in the starry sky of the Mountains and Seas. After everyone acknowledged him as having Transcended, Jin Yunshan’s ambition reached incredible heights.</p><br/><p>Countless living beings offered him worship, and countless cultivators revered him as the ultimate existence. Anywhere he went, countless voices would cry out in adoration and worship.</p><br/><p>“Greetings, Patriarch Goldrobes!”</p><br/><p>“Greetings, Patriarch Goldrobes!!”</p><br/><p>Such cries rang out near and far. Countless eyes gazed upon him with fear and fanaticism. The feeling of having Transcended caused him to think about Meng Hao, and the glory and status Meng Hao had once commanded.</p><br/><p>“I might not be as strong as Meng Hao was back then, but the gap can't be very wide....” Jin Yunshan waved his hand, causing the natural laws in the area to flux and change. It was an intoxicating feeling that filled him with excitement, and caused his laughter to echo out through the entire starry sky.</p><br/><p>Eventually, his gaze came to fall upon the Mountain and Sea Realm.</p><br/><p>He refused to believe that after the tens of thousands of years which had passed, Meng Hao was still present. He was convinced that Meng Hao had almost certainly departed. Either that, or he had picked another fight with Allheaven and been either killed or seriously wounded.</p><br/><p>Despite that, he held back. The terror of Meng Hao which existed in his heart caused him to hesitate. Whenever he thought of Meng Hao, fear filled him; therefore, he turned his gaze away from the Mountain and Sea Realm, and he waited.</p><br/><p>Time passed. Another ten thousand years passed. Because of Jin Yunshan, the Vast Expanse School eventually came to occupy the entire starry sky, with the exception of the Mountain and Sea Realm. Jin Yunshan never invaded it. Instead, he observed and waited, not yet daring to take any action.</p><br/><p>After those ten thousand years passed, Jin Yunshan’s patience gradually ran out. After countless augury calculations, he finally became fully focused on the Mountain and Sea Realm.</p><br/><p>However, he managed to hold back from simply invading. Instead, he began to form numerous clones, which he sent to infiltrate the Mountain and Sea Realm. Those clones observed, tested, and waited for another ten thousand years. Finally, he made his decision!</p><br/><p>“Transcendors always create a precious treasure. Within this starry sky, the Mountain and Sea Realm is that very Transcendence Treasure!</p><br/><p>“Meng Hao, considering that you’ve departed, this precious treasure should belong to me!” Jin Yunshan’s eyes glittered as he began to make his way toward the Mountain and Sea Realm.</p><br/><p>“I actually hope that you haven’t left, Meng Hao,” he murmured. “I hope that you fought again with Allheaven, and ended up being seriously injured. That way, I can consume you the same way you consumed Allheaven, and thus Transcend in soul.” His eyes glinted with profound ambition.</p><br/><p>It only took him a few strides through the starry sky to reach the Mountain and Sea Realm. As he hovered outside, he studied the place, and his eyes flickered with praise. Years ago, he had been unable to truly comprehend how incredible the Mountain and Sea Realm was, but with his current cultivation base, he could now see all of the various dazzling aspects to the realm.</p><br/><p>“The embodiment of nine profound natural laws. The nine Hexes of the League of Demon Sealers. Meng Hao, you left your legacy behind, sealed within this precious treasure. Unfortunately... after all these tens of thousands of years, not a single person in the Mountain and Sea Realm has been able to combine all of your Hexing magic Essences. Neither has anyone Transcended.</p><br/><p>“Leaving this treasure here would be a big waste. I’ll take it. Perhaps it can even help me to Transcend in soul!” Jin Yunshan took a deep breath, which caused the entire starry sky to shake. Rumbling like thunder could be heard, breaking through the barriers of the Mountain and Sea Realm to fill the Heaven and Earth which existed inside.</p><br/><p>Countless cultivators of the Mountain and Sea Realm were profoundly shaken, and coughed up mouthfuls of blood. Heaven-shaking, Earth-shattering power erupted from Jin Yunshan, pouring into the Mountain and Sea Realm to crush down onto its innumerable cultivators.</p><br/><p>Before any of the cultivators could react or struggle, they were slammed into the ground. Their eyes were bloodshot, and they were howling inwardly. And yet, they could do nothing but look up at the Heavens and trembled. Jin Yunshan slowly descended into the Mountain and Sea Realm, tearing apart the Heavens there, causing golden light to spread out without cease.</p><br/><p>The protective barrier surrounding the Mountain and Sea Realm was torn open.</p><br/><p>Behind the golden-robed Jin Yunshan, vortexes sprang up, out of which emerged countless cultivators from the Vast Expanse School. After they dropped to their knees to bow in greeting, Jin Yunshan waved his golden sleeve, sending them pouring into the Mountain and Sea Realm.</p><br/><p>Few of the cultivators of the Mountain and Sea Realm could even struggle against the pressure. However, there were a few Paragons among them who managed to fly up into the air. One after another they tried to fight back, but all Jin Yunshan had to do was wave his sleeve, and they were shoved back down. Blood sprayed out of the mouths of the Mountain and Sea Realm Paragons as they were slammed back down into the ground.</p><br/><p>Over the past millennia, numerous Mountain and Sea cultivators had done extensive research into their history. Although none of them knew the full truth, they had managed to piece together various clues, and now began to call out for help from the precious treasure that was the Mountain and Sea Realm.</p><br/><p>“The cultivators of the Mountain and Sea Realm are protected by the realm itself! No outside force can destroy us!”</p><br/><p>“Precious treasure of the Mountains and Seas, please protect us from the invading cultivators!”</p><br/><p>“Oh precious treasure of our ancestor, please do something!”</p><br/><p>Even as their voices rose up, the Nine Mountains and Nine Seas began to tremble. Light sprang up, which instantly shot toward Jin Yunshan. That light was the exact same light which had crushed Sha Jiudong so many years ago.</p><br/><p>However, even as that light neared Jin Yunshan....</p><br/><p>“I hereby declare,” he said coolly, “that the natural laws of this world are now different.” He extended his right hand, and the power of his Transcendent fleshly body and cultivation base converged on his finger.</p><br/><p>The light from the Mountains and Seas trembled for a moment, and then shattered, sending countless sparks flying about in all directions.</p><br/><p>When the Mountain and Sea cultivators saw that, they were completely shaken, and could do nothing but stare in shock.</p><br/>\n</div>"}