{"title": "Chapter 1592: Same Scenery, Filled with Strangers", "id": 1592, "volume": 16, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-1592-same-scenery-filled-with-strangers", "volume_title": "Volume 16", "body": "<h1>Chapter 1592: Same Scenery, Filled with Strangers</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 1592: Same Scenery, Filled with Strangers</strong></p><br/><p>Gone.... Everyone had gone.</p><br/><p>Meng Hao suddenly aged visibly. He returned silently to the Ninth Mountain, to Xu Qing’s bedside, who looked very, very old. He looked at her</p><br/><p>“Why don’t you just... let me go...?” she said softly, her voice hoarse.</p><br/><p>Meng Hao shivered, but didn’t respond. He continued to feed her his blood, which was the only thing keeping her alive.</p><br/><p>Xu Qing went back to sleep. Meng Hao stood there looking at her, his eyes bloodshot. After a long moment passed, he turned and walked out of the room. Gazing up in the sky, his eyes flickered with the light of augury as he once again tried to come up with a way to keep his loved ones alive for longer, something other than the soul seeds.</p><br/><p>Three hundred years passed, and Pill Demon died....</p><br/><p>In that moment, he transformed into a decayed medicinal pill, which was his soul seed. The sight of it left Meng Hao weeping as he thought back to everything which had occurred in the past.</p><br/><p>He carefully placed the medicinal pill into the ice mountain, checked in on Xu Qing, and continued to make augury calculations to try to come up with a solution.</p><br/><p>Two hundred years later, Dong Hu’s time came....</p><br/><p>In the moments before death, he gave a pearl to Meng Hao and explained that he had been feeding it for his entire life. He had been preparing it for someone else, and that someone was Meng Hao.</p><br/><p>As the pearl floated in front of Meng Hao, the parrot flew out. Neither the parrot nor the meat jelly had appeared during the past several thousand years. When they looked at Meng Hao in his grief, they felt that same grief rising up within their own hearts. Unfortunately, there was nothing they could do to help.</p><br/><p>The parrot took the pearl and placed it into a certain spot on the copper mirror, and the two fused together. Radiant light glittered, and yet, Meng Hao didn’t pay it any attention.</p><br/><p>“Gone,” he murmured. “They’re all gone....” He went back to his augury.</p><br/><p>Time passed. Another thousand years. By this point, it had been seven thousand years since Meng Hao had become the lord of the starry sky. During those seven thousand years, he had never made any public appearances. Most people had forgotten his name, and those who did remember had begun to speculate that Meng Hao... had left the starry sky.</p><br/><p>For the most part, people weren’t aware of how certain individuals were dying in an unusual fashion. However, there were a few people, like Jin Yunshan and the others on Planet Vast Expanse, who did notice.</p><br/><p>They weren’t completely sure though, and didn’t dare to state their speculations out loud. Ambitions rose up in their hearts, but they suppressed them and continued to wait.</p><br/><p>In the Mountain and Sea Realm, on the Ninth Mountain, Xu Qing hovered on the brink of death. Even with Meng Hao’s blood, she wouldn’t be able to hang on for much longer. The truth was that she should have died long ago.</p><br/><p>It was at this point that Meng Hao thought about how Patriarch Reliance had intentionally gone into a state of slumber, and suddenly came up with a new idea. He took a trip outside of the starry sky of the Mountains and Seas, and upon returning, stood there by Xu Qing’s side for a long moment, his eyes closed. A long moment passed, and he opened his eyes.</p><br/><p>“Qing’er,” he said quietly. “Close your eyes and sleep.... I’ll wake you up soon.” With that, he reached out and pushed his hand down onto her forehead.</p><br/><p>She smiled and closed her eyes. She wasn’t dead. She continued to breathe as Meng Hao drew upon his personal Essence to pour power into her. She gradually reverted from her ancient appearance back to her youthful self. It only took a moment for her to be radiantly beautiful once again.</p><br/><p>At the same time, an icy coldness passed from Meng Hao’s hand into her body. Cracking sounds could be heard as layers of ice formed. Gradually, ice came to cover her completely, forming the shape of a coffin.</p><br/><p>There Xu Qing lay, inside the coffin, sleeping, sealed with ice.</p><br/><p>This was the final method Meng Hao had devised, something different from the soul seeds which could be sent back into reincarnation. After thousands of years of augury calculations, this was the best method he could come up with, something very taxing to himself, something that used numerous natural laws combined with Heaven-Sealing magic.</p><br/><p>He had... separated her from the curse!</p><br/><p>He used ice to create a tiny world the size of a coffin. Whoever slept inside that coffin would be free from the effects of the curse.</p><br/><p>This method also had something to do with his observations of his own Dao Essence, and the world which existed inside of him. He had thought of taking people into that world inside of him to separate them from the curse, but was unable. He was in the Ancestor Realm, and yet, that world inside of him was incomplete.</p><br/><p>He gazed at Xu Qing there within the ice coffin, then went to another location on the Ninth Mountain, where his parents lived.</p><br/><p>His parents were the only loved ones he had left in the world.</p><br/><p>After explaining his plan regarding the ice seal, Meng Hao’s parents sat there silently. A long time passed before they exchanged a glance, then looked back at Meng Hao and shook their heads.</p><br/><p>They did not wish to continue living in such a manner. They would rather reach the end of their lives together. After all the years which had passed, and everything they had been through, they were content for things to end.</p><br/><p>Having watched as Meng Hao climbed to the absolute pinnacle, they had no regrets.</p><br/><p>Meng Hao continued to try to persuade them until his father’s temper sparked. Meng Hao lapsed into silence. He could tell that his parents’ decision was final. In the following years, he spent as much time as he could with them there in the Mountain and Sea Realm. Another thousand years passed.</p><br/><p>Finally, Meng Hao watched through tear-filled eyes as his parents transformed into the Mountain and Sea Butterfly, and then gradually began to fade away. However, in the moment before it disappeared, Meng Hao’s eyes flashed with determination. His right hand flashed in an incantation gesture, and the power of his Dao Essence erupted out. Coldness filled the area, and cracking sounds could be heard. In the blink of an eye, the area was completely sealed in ice.</p><br/><p>The frozen Mountain and Sea Butterfly began to shrink down until it was a coffin, which Meng Hao carefully picked up.</p><br/><p>He knew that the real reason his parents had refused was that they didn’t want him to waste any of his Essence power. They were worried that he would harm himself in order to help them.</p><br/><p>They were willing to sacrifice anything for their son. That was the reason for their decision.</p><br/><p>But Meng Hao was willing to do the same for his parents. They were the two most important people in his life, and thus, he made his own decision.</p><br/><p>He placed the Mountain and Sea Butterfly’s ice coffin next to Xu Qing’s. Those two coffins contained the people in his life that he simply couldn’t part with.</p><br/><p>Grief, pain, and loneliness rose up like the tide, completely engulfing him. He sat down quietly, and let time pass, just like it always had.</p><br/><p>He sat there for a thousand years. By now, he had been the lord of the starry sky for ten thousand years. Finally, he placed protective seals on the soul seeds and the coffins, then walked out and looked at the Mountain and Sea Realm. Everything looked unfamiliar to him now.</p><br/><p>“I watch the blue seas become lush fields,” he murmured. “Same scenery, but filled with strangers....”</p><br/>\n</div>"}