{"title": "Chapter 1609: Becoming Allheaven!", "id": 1609, "volume": 17, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-1609-becoming-allheaven", "volume_title": "Volume 17", "body": "<h1>Chapter 1609: Becoming Allheaven!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 1609: Becoming Allheaven!</strong></p><br/><p>(click here for soundtrack)</p><br/><p>It was a black wind that not only destroyed life, but gave it. After it blew past, the starry sky was completely silent. But then, planets emerged, worlds were born, and new forms of life appeared.</p><br/><p>Things started out very primitively, but soon reached the point where the practice of cultivation began. The relics and remnants of the past epoch were what the hosts of new living beings used as the basis for their growth.</p><br/><p>Around this time, Meng Hao opened his eyes from his meditation. His gaze was somewhat blank as he realized that he couldn’t remember exactly who he was. He seemed to have forgotten everything from the past. It was simply too far away, making it impossible to recall.</p><br/><p>The only reason he had even come to awaken was that he realized that his body was beginning to waste away.... Although the progress was extremely slow, the signs of it were there.</p><br/><p>Time passed within the new epoch. One generation after another came and went. Powerful experts arose, becoming dazzling flowers floating along down the stream of time. They created a spectacular and magnificent era, and at its height, there were actually seven cultivators who stepped halfway into Transcendence.</p><br/><p>But then things began to decline. Another 100,000,000 years had passed. The black wind once again appeared, and everything began again.</p><br/><p>One epoch ended, and another began.</p><br/><p>Meng Hao opened his eyes again, and found that the decay of his body had become more pronounced....</p><br/><p>During the following epoch, the Ninth Mountain and Sea was discovered. It became a place that countless cultivators looked toward with hope, believing it to be a Holy Land for cultivation. During this epoch, everything centered around the struggles and fighting to control the Ninth Mountain and Sea.</p><br/><p>That epoch ended, and another began.</p><br/><p>It was like a cycle, an endless cycle. Reincarnation flowed constantly. Soon the fourth epoch passed, and the fifth. Then the sixth epoch.... Eventually, ten epochs passed, then twenty, then thirty....</p><br/><p>Meng Hao eventually lost track of how many epochs had actually gone by. He forgot about the flow of time, and only knew that a very, very long time had passed.... As that time passed, his body showed more and more signs of decay. That decay filled him, until eventually, some parts of his body began to fade away.</p><br/><p>It started with his feet, slowly moving up his legs until his torso began to vanish.</p><br/><p>By that point, it was hard to say exactly how many epochs had passed for the living beings in the starry sky of the Mountains and Seas. It was a cycle that seemed as if it would go on and on with no end.</p><br/><p>It was nothing cruel. That was simply the natural law of the Universe, and a part of the cycle of reincarnation.</p><br/><p>Eventually, Meng Hao’s body had almost completely faded away. Only five fingers and an eye remained. At that time, Meng Hao suddenly felt fear. It was a sensation of terror which he hadn't experienced for a very, very long time. But there it was. He instinctively wanted to prevent himself from fading away completely.</p><br/><p>Perhaps it was because of how his body was fading away, and because of the power of his own Essence seeping out into the starry sky, that in one particular epoch, a certain person appeared. He was a powerful expert who surpassed all of the other powerful experts from the previous epochs. He eventually absorbed some of Meng Hao’s Essence, and became... a full Transcendor!</p><br/><p>In the moment that he Transcended, Meng Hao, in his confusion, attempted to consume him. Unfortunately, he was too weak, so weak that he couldn’t even fully awaken. Before he could prepare himself fully, that Transcendor destroyed one of his fingers and left to travel the Universe.</p><br/><p>Meng Hao felt pain, and began to tremble, a trembling that affected even the starry sky. Despite the fact that he wanted to, Meng Hao couldn’t awaken. He needed more time.</p><br/><p>Another epoch went by, and another person appeared who absorbed some of his Essence and destroyed a second of his fingers. The pain nearly drove Meng Hao mad, and he was left howling in rage.</p><br/><p>Eventually, a third Transcendor appeared, who destroyed a third finger. At long last... Meng Hao awoke. The third Transcendor was able to flee, but the important thing was that Meng Hao was now awake.</p><br/><p>He began to plan a way to live once again. He needed... Nirvanic Rebirth!</p><br/><p>After coming to this conclusion, he began to scheme.... Unfortunately, he was too weak, so he sent his blood out in an attempt to gather enough power to perform Nirvanic Rebirth.</p><br/><p>Eventually, someone came along who was perfect for his plan. He absorbed that person, who became the first Nirvana Fruit inside of him.</p><br/><p>He could tell that he would need ninety-nine such Nirvana Fruits to become complete, and have his Nirvanic rebirth.</p><br/><p>Time passed, and he eventually got his second, third, and fourth Nirvana Fruits.... He was very patient, and continued to wait for the blood he had scattered to be gathered back in.</p><br/><p>After collecting his ninety-eighth Nirvana Fruit, the very last person he had been waiting for finally appeared.</p><br/><p>A Heaven-shaking, Earth-shattering battle resulted. The people who had severed his three fingers even managed to interfere surreptitiously. But in the end, they all failed. He successfully transformed that final individual into his ninety-ninth Nirvana Fruit, and the power of Nirvanic rebirth was unleashed.</p><br/><p>Rumbling filled his mind, causing him to shake as he opened his eyes. When his voice spoke, it filled the entire starry sky.</p><br/><p>“I am Allheaven!” said the muffled voice. But then, sharp pain stabbed through his mind as he recalled a memory which had been buried deep, deep within. It was something he had almost completely forgotten!</p><br/><p>He was Allheaven, and yet, he was not complete!</p><br/><p>He turned his head to look out in the Universe. There, somewhere deep within the Universe, he could sense an indescribably powerful aura that left him trembling. That aura contained incredible amounts of immeasurably dense Immortal qi, so much so that it was terrifying. It was the aura of... the Immortal!</p><br/><p>The difference between himself and that aura was like the difference between a firefly and the sun!</p><br/><p>It was an aura that seemed capable of fighting against the Universe as a whole, something so powerful it defied explanation!</p><br/><p>Somehow, he could sense that he was connected to that entity in some ways. It was at this point that he remembered where he came from. He... came from the depths of the Universe! A war had been fought, and he was actually a clone of that incredibly powerful individual, a clone who had been severed away!</p><br/><p>He was a clone who had been exiled to this location, where he had instinctively consumed a starry sky, becoming its lord.</p><br/><p>Deep within his mind, he could tell that Allheaven possessed intense and incredible fear of that original entity!</p><br/><p>RUUUUUUUUUUMBLE!</p><br/><p>All of those memories flooded up, and he knew beyond the shadow of a doubt the general location of Allheaven’s true self. That person was in the center of the Universe, a place that was flourishing and radiant. In comparison, his current location was remote, barren... like a distant corner.</p><br/><p>-----</p><br/><p>Okay, from here on out, no more comments from me. Only a few chapters to go. What will happen next.....</p><br/>\n</div>"}