{"title": "Chapter 1611: Untitled", "id": 1611, "volume": 17, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-1611-untitled", "volume_title": "Volume 17", "body": "<h1>Chapter 1611: Untitled</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 1611: Untitled</strong></p><br/><p>(click here for soundtrack)</p><br/><p>Xu Qing stood there next to Meng Hao, looking at the parrot and meat jelly, and she started laughing. It was a laughter so warm and beautiful it could melt ice.</p><br/><p>Meng Hao took a deep breath as he looked over at the coffin containing the Mountain and Sea Butterfly, and his parents. As the coffin melted, the butterfly transformed into countless motes of colorful light, light that was bursting with life force. Gradually, the light formed together into a man and a woman, who stood there embracing each other.</p><br/><p>At the same time, rumbling sounds could be heard as an enormous open door descended. It was the door leading to the cycle of reincarnation, which would ensure that the souls who were part of it never died.</p><br/><p>The ice mountain was melting, and as it did, the awakening soul seeds inside became countless figures who floated up toward the door.</p><br/><p>They had been waiting to be reincarnated for a very, very long time. From a distance, the soul seeds became like a river that swept into the door of reincarnation, Meng Hao’s parents included.</p><br/><p>Within that river of souls, he saw Fatty, Wang Youcai, Li Ling’er, Zhixiang, Taiyang Zi, Fang Yu, Sun Hai, his Master Pill Demon, Perfect, as well as many other faces. They were all people who existed within his memories. They included Paragon Sea Dream, Ksitigarbha, Shui Dongliu, Grandpa Meng, and Grandpa Fang....</p><br/><p>Meng Hao stood there watching, his heart filled with warmth, clasping Xu Qing’s hand tightly.</p><br/><p>After all of the soul seeds disappeared into the cycle of reincarnation, Meng Hao could sense them being born again, and he smiled.</p><br/><p>It was also in this same moment that water once again began to bubble within the Ninth Sea as Guyiding Tri-Rain began to recover!</p><br/><p>Atop the Ninth Mountain, Patriarch Reliance, who by this point had been reduced to nothing more than a turtle shell, suddenly began to emanate signs of life. Eventually, a head emerged from inside the shell. He took a deep breath, then looked up and roared, “The Patriarch is back!”</p><br/><p>On his back was the State of Zhao, which also began to show signs of life. Rumbling echoed out in all directions.</p><br/><p>Beauty was blooming everywhere!</p><br/><p>**</p><br/><p>Decades upon decades passed in a flash.</p><br/><p>It was a new, unknown epoch in the starry sky of the Mountains and Seas. Although the Mountain and Sea Realm itself didn't exist any more, powerful organizations of cultivators were already sweeping through the starry sky.</p><br/><p>It was hard to say which of them was more powerful, but it didn’t really matter. On all the planets and worlds, mortals and cultivators alike were rising to new heights.</p><br/><p>Some people said that this was an era which was destined to rise to the very pinnacle of glory. More powerful experts would appear in this time than ever had before, the reason being that in the recent decades, all of the powerful organizations had given rise to cultivators with shocking latent talent. There were even some legendary Chosen who appeared that only came along once in ten thousand years.</p><br/><p>Because of such Chosen, the world of cultivation in the starry sky was reaching a dazzling pinnacle.</p><br/><p>No one knew exactly why this was happening. As for that group of Chosen, it was almost as if they had all agreed to be born at exactly the same time.</p><br/><p>Although they all came from different places, and didn’t know each other, as soon as they met the other Chosen, they felt an instant connection. Because of that, they didn’t devolve into fighting, but instead, worked together to seek out their destiny.</p><br/><p>Now that the curse was broken, many of those who had been cultivators of the Mountain and Sea Realm chose to once again walk the path of cultivation. However, not everyone did. There were many... who chose to become mortals, to live peaceful and ordinary lives.</p><br/><p>And yet, regardless of the decisions they made, they seemed to benefit from the blessing of the starry sky. That was of course the blessing of Meng Hao, which ensured that no matter how long they lived, or how many lives they experienced, their souls would never be destroyed. Even when the epoch ended, and everything faded away, their souls would continue on.</p><br/><p>In some ways, they had become eternal. Given enough time, they would eventually Transcend, and then they would be able to remember everything from their previous lives.</p><br/><p>A golden age was starting in the starry sky.</p><br/><p>One day, on one particular planet, a young man stood proudly in front of a young woman, holding a spear in his hand. He had a freckled face, and was quite fat, like a ball of flesh.</p><br/><p>The young woman was slender and beautiful, but her brow was furrowed as she glared at the young man.</p><br/><p>“Are you going to agree or not?” asked the young man. “If you don’t agree to become Grandpa Fatty’s Daoist partner, well then....” With a mighty roar, he placed the spearhead into his mouth and bit down, whereupon a cracking sound emanated out as the spearhead shattered.</p><br/><p>Then, he proudly continued, “Don’t you know? Grandpa Fatty has some of the best latent talent in the entire starry sky! And I understood why because of a dream I had. I'm actually the brother of the will of this starry sky! Be with me, and both of us can become immortal together!”</p><br/><p>He was trying to sound elegant and refined, but the chunks of the spearhead in his mouth hurt quite a bit, and he was even starting to tremble involuntarily. Inwardly, he grumbled to himself that this habit that he picked up in the dream was entirely unbearable.</p><br/><p>The young woman’s jaw dropped, and she stared at the young man with wide eyes. She was a disciple of the Godplume Sect, and this was her first time leaving the sect on training. She had never imagined that she would run into a fat kid like this. Even more unbelievable was that he had been following her around for months pestering her.</p><br/><p>“You’re crazy!” she said. The way that he was trembling actually frightened her a bit, so she snorted coldly, turned, and walked off.</p><br/><p>“Hey, wait for me!” the fat young man cried, and immediately hurried after her, pasting an ingratiating smile onto his face.</p><br/><p>After they left, the sound of chuckling could be heard from the spot they had just been standing in, as Meng Hao and Xu Qing materialized. Xu Qing was covering her mouth with her hand, and a wide smile could be seen on Meng Hao's face.</p><br/><p>Naturally, that fat young man was none other that the reincarnated Fatty, Li Fugui.</p><br/><p>The parrot and meat jelly were perched on Meng Hao’s shoulders, disdainful looks on their faces.</p><br/><p>“Shameless. Completely shameless!”</p><br/><p>“So that was how he got all those Daoist partners back in the day.”</p><br/><p>Meng Hao shooked his head and looked off into the distance.</p><br/><p>“Come on, let’s go check in on everyone else,” he said softly. “After that, we can leave this place....” He seemed reluctant to part with all of his friends, but the determination in his eyes was clear.</p><br/>\n</div>"}