{"title": "Chapter 1613: A New Life for Father and Mother", "id": 1613, "volume": 17, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-1613-a-new-life-for-father-and-mother", "volume_title": "Volume 17", "body": "<h1>Chapter 1613: A New Life for Father and Mother</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 1613: A New Life for Father and Mother</strong></p><br/><p>(click here for soundtrack)</p><br/><p>In one part of the starry sky of the Mountains and Seas was a planet that, if you examined it carefully, closely resembled the old Planet South Heaven from the Mountain and Sea Realm.</p><br/><p>When Meng Hao and Xu Qing materialized on the planet, a slight tremor ran through Meng Hao. Considering the high level of his cultivation base, there were few things in the world that could shake him mentally. This planet was different though. This place was too important.</p><br/><p>It was on this planet that his father and mother had been reincarnated.</p><br/><p>They had been transformed into the Mountain and Sea Butterfly, and had borne the weight of all of the cultivators of the Mountain and Sea Realm. They had slept for countless epochs, and then entered the cycle of reincarnation after the curse was broken. Their love for Meng Hao could not be topped.</p><br/><p>It was the type of love that was completely selfless....</p><br/><p>On one particular continent on that planet, there was a city through which a wide river flowed. Many people lived in the city, and because it was also located on a major highway in the country, it was a place where business flourished.</p><br/><p>The city was a hubbub of voices, especially in one particular location in the southeast of the city, where a seven-story pagoda rose up above the rest of the buildings. The public square in front of the pagoda was packed with people, all of whom were boiling in excitement. Cheering and joyous laughter rose up into the air.</p><br/><p>Young people were hurrying toward the square from all corners of the city, filled with anticipation and excitement.</p><br/><p>“Did you hear? Grand Philanthropist Meng is marrying off one of his daughters today!”</p><br/><p>“I heard that she's a real beauty! Even the prince wanted to marry her! But the leader of the Meng Clan, Meng Bancheng, refused his offer.”</p><br/><p>“Grand Philanthropist Meng is almost as rich as the entire empire itself! He can even go into the Forbidden Palace any time he wants. The only reason he still lives in this place is because he can’t bear to part with his ancestral home....”</p><br/><p>“Come on, hurry up! Their plan for the betrothment ceremony sounds a bit silly, but it’s no joke! It's all up to fate, not family background. Whoever catches the silk ball will become a son-in-law of the Meng Clan!”</p><br/><p>Everyone was in a complete uproar. In fact, outside of the seven-story pagoda, there were plenty of princes, dukes, and famous scholars from the mortal kingdom, all of whom had staked out their spots and were waiting with nervous anticipation, staring up at the top of the pagoda.</p><br/><p>The atmosphere had reached a fever pitch. On top of the seven-story pagoda was a young woman with a gauze veil covering her face, making it impossible to see her facial features clearly. However, even from a distance, it was possible to tell that she was spectacularly beautiful.</p><br/><p>She had eyes like deep pools of water, but as she looked down at the crowd below, her gaze gradually went blank. She wasn’t sure why she felt the way she did, but she was sure that somewhere down below, someone very important was waiting for her. For some reason, she felt like it was her husband from a previous life.</p><br/><p>In that previous life, the two of them had been a butterfly, and after flying into the cycle of reincarnation, they had been waiting for each other.</p><br/><p>It was at this point that a voice drifted out from inside the pagoda. It was none other than Meng Bancheng.</p><br/><p>“My daughter’s groom will not be selected by family background or status, but by fate.</p><br/><p>“The silk ball will be thrown out, and whoever catches it will become her husband.” Meng Bancheng’s voice was laced with age, and his words seemed to be spoken a bit begrudgingly. This betrothment method did seem a bit silly to him, and he had originally he had refused the idea. However, his daughter had stubbornly insisted.</p><br/><p>As soon as his words echoed out through the air, a wave of excitement rippled through the audience down below.</p><br/><p>Not too far away from the crowd, a scholar was passing by who happened to be berating his apprentice for laziness. Their original plan had been to leave the city, but because of the apprentice, they missed the departing horsecart, and were now forced to find lodging for the night.</p><br/><p>At first, the scholar didn’t even notice the commotion of the betrothment, but then a sudden gust of wind blew past him, and his eyes glazed over slightly. He looked up, and the first thing he saw was the young woman on the pagoda, wreathed in sunlight, staring down at him. Their gazes met.</p><br/><p>It was a gaze that could endure anything....</p><br/><p>That seemed to spring from a past life....</p><br/><p>That could stir the soul....</p><br/><p>That seemed to come from a past incarnation....</p><br/><p>The scholar saw a vague image of something like a tall tower. He was standing there, and that young woman was next to him.</p><br/><p>He saw a vague image of himself and the young woman becoming a butterfly that fluttered through the starry sky.</p><br/><p>He saw a vague image of the two of them growing old, smiling together, always there for each other, no matter how many lives passed....</p><br/><p>He saw a vague image of the two of them embracing each other as they entered the cycle of reincarnation.</p><br/><p>All of the hubbub and excitement faded into calm silence, as though the scholar was suddenly not a part of the world any more. Nothing else existed except for that young woman, whose face seemed to be imprinted deep in his heart.</p><br/><p>The scholar shivered.</p><br/><p>He wasn't the only one. The young woman on top of the pagoda trembled the instant her gaze met the scholar’s. Then, her eyes began to shine with unprecedented brightness.</p><br/><p>There was a voice inside of her telling her that the reason she had demanded this type of betrothment, the reason for all the choices she had ever made in her life, was because she was waiting for someone, and that that person was... this scholar!</p><br/><p>She smiled, and threw out the silk ball with all the strength she could muster.</p><br/><p>The beautiful, multi-colored silk ball became a crescent streak of light that soared through the air....</p><br/><p>Meng Hao and Xu Qing were standing there in the crowd, observing. A smile could be seen on Meng Hao’s face, and his heart was calm. The young woman, of course, was his mother, and the scholar was his father.</p><br/><p>The scene playing out in front of him filled his heart with gladness. But then, even as the silk ball began to descend, he noticed a cultivator in the crowd who wore a cold smile on his face as he manipulated the ball to head in his direction.</p><br/><p>Of course, that cultivator had no way of knowing who he was actually offending....</p><br/><p>Meng Hao’s expression turned grim. For a cultivator to do something like this was far worse than wanton killing and slaughtering, as far as Meng Hao was concerned. He waved his finger, and the silk ball continued to fly toward the scholar. A moment later, it landed in his arms.</p><br/><p>The scholar stared in shock, grabbing onto the ball and then looking back up at the woman on the pagoda. A shy smile could be seen on her face as she ducked her head down and hurried back into the pagoda.</p><br/><p>At the same time, servants poured out from the Meng Clan and clustered around the young scholar, bowing respectfully. Under the annoyed and jealous glares of the crowd, the scholar was hurried into the pagoda. He would soon be a son-in-law of the Meng Clan, husband to one of the clan’s daughters.</p><br/><p>Meng Hao’s expression softened even more. A few days later, the scholar and the young woman were married. The wedding feast was a grand celebration that filled the entire city with joy.</p><br/><p>Meng Hao and Xu Qing both attended.</p><br/><p>It was a strange feeling to attend the wedding celebration of one’s own parents, but it was a happy thing. He and Xu Qing even prepared a gift, which was a wall scroll.</p><br/><p>It read, “Eternal happiness through all lives....”</p><br/>\n</div>"}