{"title": "Chapter 1612: Missing Clues", "id": 1612, "volume": 17, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-1612-missing-clues", "volume_title": "Volume 17", "body": "<h1>Chapter 1612: Missing Clues</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 1612: Missing Clues</strong></p><br/><p>(click here for soundtrack)</p><br/><p>Meng Hao and Xu Qing traveled among the powerful organizations in the starry sky of the Mountains and Seas, checking in on all the familiar faces who were rising to glory after having been reincarnated.</p><br/><p>Zhixiang had become a princess in one of the mortal kingdoms. Li Ling’er had joined a powerful sect and become their only Legacy disciple.</p><br/><p>Wang Youcai was a rogue cultivator with an intense, murderous aura, who had fought and killed his way to fame. Dong Hu was his younger brother, and the two of them were the most famous of all the rogue cultivators!</p><br/><p>Taiyang Zi and so many other familiar faces all had their own stories to tell.</p><br/><p>Paragon Sea Dream had been a powerful cultivator in her previous life, but this time she chose the mortal world. She got married and had children, and was very happy....</p><br/><p>Then there was Ksitigarbha. He also chose the mortal world, becoming an upright and plainspoken local magistrate, who brought justice to the common people!</p><br/><p>Pill Demon was innately skilled in the Dao of alchemy, and that didn’t change because of reincarnation. He joined the largest alchemy sect in the starry sky, where he became the most illustrious of Chosen.</p><br/><p>Fan Dong’er became the leader of a group of rebels in one of the mortal worlds. She led the people in revolt, overthrowing the tyrannical government. Although she was merely a mortal, she shone with a brilliance that inspired trust in anyone who laid eyes on her.</p><br/><p>Fang Yu and Sun Hai were eternally connected as husband and wife, a connection that remained even in the cycle of reincarnation. Although they started out in sects very far away from each other, as fate would have it, they ended up meeting....</p><br/><p>Meng Hao arranged for Ke Yunhai and Ke Jiusi to once again become father and son. Ke Yunhai was the same loving father, and Ke Jiusi was a filial son.</p><br/><p>Meng Hao traveled through the starry sky of the Mountains and Seas to see everyone he remembered from the past.</p><br/><p>Some of them lived in the mortal world, others chose cultivation. Regardless of their choices, they all received blessings from Meng Hao. They were doted upon by the starry sky itself, and were all happy.</p><br/><p>Sounds of laughter and joy could be heard everywhere. All of the soul seeds which had entered the cycle of reincarnation found happiness. In turn, that happiness brought a smile to Meng Hao’s face.</p><br/><p>It was a happiness that stayed with him constantly now that the curse had been broken.</p><br/><p>He eventually found Chu Yuyan’s daughter, Perfect. After reincarnation, she once again chose the path of cultivation. She became the Heavenly Chosen Daughter of the most powerful organization within the starry sky. Meng Hao graced her with a fatherly love, and as such, she truly could be considered Chosen by the Heavens. After all, her father was the will of the starry sky.</p><br/><p>The mastiff grew up with Perfect, her loyal, lifelong companion.</p><br/><p>When Meng Hao saw the smile of happiness on Perfect’s face, his eyes shone with the warmth of love. He reached out and waved his hand, leaving a sealing mark on her soul. It was a mark that would forever connect the two of them as father and daughter. After Meng Hao left, it wouldn’t matter how far away he went, that connection would always remain.</p><br/><p>The depths of the Universe might be a bustling, thriving place, but it would also contain untold dangers. Meng Hao was confident enough to take Xu Qing with him there, but he also hoped that the friends and relatives he left behind in his starry sky... would be protected.</p><br/><p>This was his home, and these people were his family.</p><br/><p>“They’re happy,” Xu Qing said softly, clasping his hand. He nodded, and the two of them made their way off into the distance.</p><br/><p>**</p><br/><p>On one particular land mass within the starry sky, the weather was very strange. According to the legends, many epochs in the past, this place had been a huge flower, divided into two worlds, one of ice, the other of fire. Eventually, a Heaven and Earth came to exist here, and yet, there were only two seasons. Half the year would be filled with snow and ice, and the other half would be scorchingly hot.</p><br/><p>That sort of environment affected the personalities of the people who were born there, and most of them cultivated magic that had to do with ice and fire.</p><br/><p>In the very center of that world was a mountain, half of which was freezing ice, the other half of which was covered with burning flames. However, the peak of the mountain was always as cool as spring.</p><br/><p>A young man sat cross-legged on the mountain, smiling, a profound gleam in his eyes as he looked off into the distance. His name was Shui Dongliu. He had not been born with that name; he had given it to himself. He had simply told people that it was his true name.... Shui Dongliu.</p><br/><p>He was a disciple of a small sect, and instead of practicing cultivation, he preferred to sit on this mountain and look off into the distance, as if he were waiting for something.</p><br/><p>People had asked him what he was waiting for, and his answer was always the same: “I’m waiting for an old friend. He’ll be leaving soon, but he’ll come to say farewell before he does.”</p><br/><p>The days passed, icy coldness swirling on one side of him, burning flames on the other. One day, a bright light flickered in his eyes, and he turned and smiled.</p><br/><p>“It’s been a long, long time,” he said.</p><br/><p>As the words left his mouth, Meng Hao and Xu Qing materialized in front of him. Smiling, Meng Hao clasped hands and bowed deeply.</p><br/><p>That bow was one of thanks, thanks to Shui Dongliu for discerning how to break the curse. It was also a bow of deep respect.</p><br/><p>Shui Dongliu started laughing, a loud, clear laughter, filled with happiness.</p><br/><p>“Meeting with old friends is always one of the greatest happinesses in life,” he said. “I’ve already looked into your fortune, and I can tell you... that your trip into the Universe will lead to magnificent glory. As for this place, don't worry, I’ll remain behind to watch over it.”</p><br/><p>“Many thanks, Senior,” Meng Hao said. It was no surprise to him that Shui Dongliu had somehow recovered his memories. Shui Dongliu was a legendary figure. Whether it was his identity as Nine Seals, or that part of his soul which came from even further back in time, when it came to the Mountain and Sea Realm, and to this starry sky, he was as attached to it as Meng Hao was.</p><br/><p>Xu Qing gave a curtseying bow to Shui Dongliu, for whom she also felt deep respect and veneration.</p><br/><p>Shui Dongliu smiled and shook his head. He looked deeply at Meng Hao, then Xu Qing, and finally at the parrot.</p><br/><p>Although he bore the semblance of a young man, when he spoke, his voice seemed completely ancient, filled with the power of Time.</p><br/><p>“That parrot... comes from the same place as Allheaven. It has forgotten the past, sealed it away. Take it with you into the Universe. You have already reached the highest peak. And yet, long ago, someone told me that the Dao is boundless.” Shui Dongliu once again shook his head and smiled. Rising to his feet, he turned and walked away, away into the Heavens, into the void, far, far away....</p><br/><p>A tremor ran through the parrot, and a blank look could be seen in its eyes, as if it had just recalled something, something vague and difficult to fully grasp. After a moment, though, it heard Meng Hao speaking.</p><br/><p>“Don’t think about it now,” he said. “Later... I can help you search for those missing clues.”</p><br/>\n</div>"}