{"title": "Chapter 9: An Itching Heart, Either By Design or By Accident", "id": 9, "volume": 1, "url": "http://boxnovel.org/doomed-to-be-cannon-fodder-chapter-9-an-itching-heart-either-by-design-or-by-accident", "volume_title": "Volume 1", "body": "<h1>Chapter 9: An Itching Heart, Either By Design or By Accident</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 9: An Itching Heart, Either By Design or By Accident</p><br/><p>While his heart was itching, he couldn’t show it outwardly. After all, that woman was his good friend’s concubine, and it would not do for him to overstep his boundaries.</p><br/><p>Temporarily flustered, he quickly suppressed such thoughts, smiling, “I had never thought that Brother Long’s house would possess such a talented woman. It seems like truly a blessing for you.” He no longer mentioned the poem and the girl afterwards, remotely pretending that this had never happened.</p><br/><p>However, Long Heng, the lover of conspiracies, couldn’t help but think that there was more than met the eye here. After having sent Song Jiaoyue away, he rapped on the table a few times. Why did it seem that the ‘crazy’ woman was getting a little restless these days? Even though he clearly knew that she was a woman of his own harem, he still hesitated for a time before heading over alone.</p><br/><p>The Winter Garden was really in too remote a location. Thus, he didn’t see virtually anyone on his way there. When he arrived, there was not even a guard at the door. He had heard that all the residences had received old women servants and pageboys. How had they only overlooked this residence?</p><br/><p>Logically speaking, his mother shouldn’t have made such a mistake. However, what he didn’t know was that the old madame had actually dispatched the people. But afraid that they would be a hindrance to her plans, Bai Xiangxiu had refused and sent back these people on the grounds of her being afflicted with craziness, claiming she was too scared for outsiders.</p><br/><p>Since there was no one guarding the door and he was the master of the place, there should be no problem if he went in! …Right? Long Heng lingered outside for a while before he finally still slipped in.</p><br/><p>The situation inside caused him to wrinkle his brows. It was really too dirty and messy. There was messily scattered paper everywhere on the ground, and there was even ink drying in splotches on the floor.</p><br/><p>The owner of this place sat at her table, her hair scattered as if she was pondering something deeply. A little maid was kneeling on the floor, wiping it little by little, speaking as though feeling wronged, “I already told you not to place the inkpot by the table’s edge, MIstress, now look, the entire floor’s covered with ink…”</p><br/><p>Wait, why is there a man’s shoes here. It’s so late, how could there be a man here?</p><br/><p>Xiao Shi slowly raised her head, and saw an abnormally cold and handsome visage before her. She immediately dropped to her knees, “This.., this humble maid greets Your Highness…”</p><br/><p>“Highness? What highness? Xiao Shi, you need to stop playing. Even if the king himself was here, this poem, I would still have to…” Her words meandered off into silence as she realized that there really was a man standing in front of her.</p><br/><p>She rapped her skull and rubbed her eyes, saying, “Xiao Shi, go call for the physician again. I’m hallucinating again, what do I do?”</p><br/><p>Xiao Shi was nearly in tears from fright. Her mistress had really written poems to the point of turning silly. This person was clearly standing right before her eyes—how was it a hallucination?</p><br/><p>Meanwhile, Long Heng was rendered completely speechless. Did he appear so much like a hallucination? Or was it that she had actually been longing for his arrival? Thinking thus, his heart softened as he said, “Is this how you serve your mistress? Why is this place so dirty and messy?”</p><br/><p>Whether or not a man loved a woman, he would naturally feel happy if she thought of him. Having finished his words, he continued looking at her. She really didn’t give off the feeling of a woman who would scheme to grab his attention. Even if she did so, he didn’t find that too hateful.</p><br/><p>“Your Highness, it really is the highness? Ah…” Bai Xiangxiu was not really a talented person, and had been furiously wracking her brain to think up poems. She finally came to her senses, a tragic cry spilling from her lips as she realized she hadn’t paid her greetings to the prince.</p><br/><p>At least, these formalities were something she had already learnt. But right then, perhaps because she was too flustered, she stumbled over the chair she’d been sitting on. She crashed to the ground in a heap, sweat beginning to form from the sharp pain that shot through her. She stuttered slightly,”Gree… gree… greetings to Your Highness?”</p><br/><p>It should be said like this, right?! Having spent all this time the past few days thinking of a way to seduce the male supporting character, as well as brainstorming verses of a couple of poems, her brainpower had really been pushed to the maximum.</p><br/><p>She couldn’t help by admire those transmigrating seniors of hers. Had they known that they would be going to cross worlds? They were all able to plagiarize and steal those poems so smoothly! But for her, even stealing poems was already causing her mind to reach the verge of exploding. She really didn’t understand this turn of events that was happening in front of her. The attempted seduction of the male supporting actor hadn’t shown any results so why had the male lead come over?</p><br/><p>Actually, Long Heng’s earlier thoughts in coming here had already vanished like smoke in the wind. For one, the state of this woman was good enough evidence to conclude that she wasn’t in a particularly clear state of mind. Second, given how messy and chaotic this room was, randomly taking a piece of paper to wrap a present was also not an impossibility. He picked up a piece of paper, seeing the full contents of that poem. The corners of his mouth twitched involuntarily. Was she using this poem to train her handwriting? She’d written it so many times.</p><br/><p>In truth, he had actually guessed correctly. Bai Xiangxiu was indeed training her handwriting whilst trying to recall poems! However, when Long Heng saw the woman’s knees trembling as she endured the pain without screaming, he had to say, “Get up!”</p><br/><p>Bai Xiangxiu wanted to cry but did not have the tears to do so. She remained kneeling, not moving an inch, raising her head to glance at Long Heng before lowering it again. That small expression of hers caused Long Heng’s heart to spasm. Had he done something wrong to her, to see such resentment in her eyes?</p><br/><p>“What is it, you still want this Prince to help you up?” His personality was cold. Even though he felt that the woman before him deserved his pity and love, he had no idea how to react.</p><br/><p>Originally, he had thought that she would lower her head and beg for forgiveness or something. Wasn’t that the usual reaction for most women? However, just who was Bai Xiangxiu hmm? She was a person who had commonly lived amongst the flowers and the plants, never using her brain. Even if she knew how to act obedient, she was already completely numb before the male lead.</p><br/><p>Putting it nicely, this reaction was one of simple fear. Putting it bluntly, it was just being scared to the point of having lost her wits. Lowering her head, she answered, sounding a little wronged, “In reply to Your Highness, it is not that this concubine does not want to get up. It’s that… I can’t. My legs seem to have gone numb.”</p><br/><p>“…” Long Heng was once more rendered speechless. How was this woman frail to this extent? Earlier, when she saw someone beaten to death with staves, she was shocked to the point of being sick for over two months. Now, for having her kneel just a little, she’d lost the ability to get up. A feeling of helplessness suddenly assailed him as he ordered Xiao Shi, “Help your mistress up.”</p><br/><p>Xiao Shi hurriedly went over to support her mistress. Because she exerted too much force, she virtually lifted Bai Xiangxiu up by her waist. Long Heng’s heart softened again. This woman was really a little too light. Even a little maid could lift her up.</p><br/><p>Was she as light as a feather? He suddenly heard Xiao Shi cry out in shock as he mused, “Mistress Xiu, Mistress Xiu, what’s happened to you?”She shook the figure which had already grown limp in her embrace, watching it flop around.</p><br/><p>Stunned, Long Heng asked, “What is it?” Looking at that hanging head within the maid’s embrace, it seemed like she’d fainted?</p><br/><p>What, really? Yes, she’s frail, but frail to this extent? Just simply kneeling was enough to make her faint?</p><br/><p>“What are you standing there for? Go find a physician!” Long Heng stepped over quickly, gathering Bai Xiangxiu in his embrace. He’d been thinking of hugging her earlier, who knew that his wish would come true so quickly? It was only, she really was light.</p><br/><p>Not only light, she was also very soft. Not only soft, she was also very fragrant. How did she pose any threat at all like this? It seemed that all the bones within her body could break even if he just exerted the tiniest amount of force.</p><br/><p>Seeing the Prince carrying her mistress within his embrace, Xiao Shi was momentarily stunned, but quickly came to her senses, running over to the medicine hall for a physician.</p><br/><p>Long Heng placed the person on her bed in her inner chamber. This Winter Garden’s bedroom wasn’t too spacious. To him at least, it only had enough space to turn around, too small to the point of pitiful. The bed was also not very big, but there was still a large portion of space left after she was laid down on it. Was a woman’s body so small? He covered her body with his, discovering that his body completely covered hers.</p><br/><p>His heart couldn’t help but grow warm, being especially aroused by that enchanting face of hers. By the same token, the memories of the battlefield appeared in his head. He broke out in a cold sweat as he hurriedly sat up, wrinkling his brows.</p><br/><p>Indeed, all beautiful woman were a scourge. She was too dangerous. He didn’t want to look at her any more, so he took his leave from the Winter Garden, a shadow his only company on the way back.</p><br/>\n</div>"}