{"title": "Chapter 17: Taking By Force", "id": 17, "volume": 1, "url": "http://boxnovel.org/doomed-to-be-cannon-fodder-chapter-17-taking-by-force", "volume_title": "Volume 1", "body": "<h1>Chapter 17: Taking By Force</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 17: Taking By Force</p><br/><p>Indignant, he returned to his room. However, he heard someone say that his mother was calling for him, so he went to her place with a frown.</p><br/><p>Seeing that her son’s expression wasn’t right, she smiled, “Didn’t you go to née Bai’s place? Why are you back so quickly?” She didn’t object to her son going to her place anymore, but hadn’t he come back too quickly?</p><br/><p>Long Heng was rather depressed about the whole course of events, but for some reason, he was struck by a need to defend her, “That place is rather cold and quiet, and she’s also sick.” What he meant was that since she was sick, he couldn’t possibly take her by force like he wanted to!</p><br/><p>The old madame smiled a little and said nothing. She responded, “Cold and quiet? You’re defending her now, but did you know that it was by her own wish that there are so few people at her place? Previously, she was the one who used the excuse of insanity to chase everyone away, it wasn’t my idea of a harsh punishment.” He hadn’t even stayed a night at her place and was already speaking for her. Luckily, this tea table was useful. It was a perfect match for the teaset that her son had given to her, or she wouldn’t be this calm right now.</p><br/><p>Long Heng immediately said, “Mother, your actions are guided by nothing but reason.” He didn’t say anything more, as if nothing had happened. The old madame sighed in her heart. Her son had always been cautious since he was young, but ever since he had returned from the battlefield, she couldn’t guess what he was thinking. He’d just revealed a hint of his true emotions just now, only to be beaten back to his original form by her words. If she had known earlier, she wouldn’t have teased him.</p><br/><p>Men in this world would already have three wives and four concubines at his age. For the sake of this family, he had gone into the army when he was ten or so. Although he had managed to bring back a title of prince with his efforts, his proper business had been delayed. Right now, it was hard enough just getting him to touch a woman, even sending a woman to his room wouldn’t do the trick. It wasn’t easy to get him to go to Miss Bai’s place twice, but he always came out with an unhappy expression. She didn’t know how Miss Bai had angered him but she would have to give her some pointers tomorrow. Ladies did not really understand how to serve a man, especially these virtuous concubines. They were only sent over by sedan, and weren’t even taught how to please their lord by an older female servant. After deciding on her actions for the morrow and chatting with Long Heng for a while, she sent someone to accompany him back.</p><br/><p>The old servant by her side smiled, “This servant sees that our Prince is upright, not like those loose gentlemen causing trouble all over the place.”</p><br/><p>“It’s not good if he’s too upright. Even if he marries that Miss Lin, with him acting like this, it’s going to be very long before I can hold my grandchildren.” The old madame was helpless.</p><br/><p>The old servant said, “There are still four lovely ladies in this household. Even a piece of ice will melt in half a year, much less a hot-blooded young man like him. Look at this, hasn’t he been going to Mistress Xiu’s place the past few days? This servant sees the time of enlightenment drawing near. Once he’s been enlightened, your first grandson won’t be far off. If you’re too anxious, then put more beauties near his room, we’ll see how long he can last.”</p><br/><p>However, the old madame understood her son well. She shook her head and smiled bitterly, “I understand my son, he’s too tense. It was fine when he was young and didn’t know much. However, now that he knows about things and is used to seeing those women on the battlefield, it’ll be difficult to get him to let down his guard.” Thinking about it, she sighed and said, “Go out there and find me some good teaching servants. Especially those who are good at teaching about the birds and the bees.”</p><br/><p>The older servant stared blankly for a moment before realization dawned, “You’re thinking of teaching that Miss Bai? It’s a good choice, she does look rather honest. She’s also very pretty.” She was also favored by the prince and the old madame. The old servant was a smart person and immediately went looking for an appropriate teacher.</p><br/><p>The next day, Bai Xiangxiu was summoned by the old madame. Her heart was apprehensive. She hadn’t managed to seduce the supporting male lead and had somehow provoked this old ancestor who would be the principal reason for her death. She wondered what was it that she was summoned for so suddenly? She carefully brought Xiao Shi in and stood at the doorway, waiting respectfully to be called in for her audience.</p><br/><p>An old servant came out to lead them in after a moment. She hurriedly gave a very formal, ceremonial greeting. 1 The old madame and the old servant at the side were both startled. This was just a normal meeting; there was no need for such an excessive greeting, it wasn’t a special occasion. The old madame forced the tea in her mouth downwards before imperiously saying, “Rise!” She actually wanted to laugh, but she held on to her calm demeanor.</p><br/><p>“Thank you, Old Madame.” Bai Xiangxiu had Xiao Shi support her as she rose. She then stood to one side without daring to even lift her head. She didn’t even dare to sit. However, she did spot the tea table that she had made. It had actually been displayed in the middle of the old madame’s inner room, with a very valuable looking tea set displayed on it. It could be seen that she used them both frequently.</p><br/><p>As expected of an old madame who had been born into nobility, her taste was impeccable.</p><br/><p>The old madame had to say again, “Sit,” before Bai Xiangxiu actually sat down.</p><br/><p>She couldn’t help but frown. She had wanted to give her some pointers, but how was Bai Xiangxiu supposed to help her when she was this cowardly?</p><br/><p>She still wanted to give her a try, so she said, “His Highness came here yesterday and said that the Winter Garden is a little cold and quiet. After thinking, I have come to concur with his thoughts. You can’t have just the two of you there all the time. If outsiders find out, they’ll think we’re trying to punish you! In a bit, I’ll let someone send a few servants to your place!”</p><br/><p>What? She was trying to seduce the second male lead. How was she going to do that with a few more pairs of eyes around? However, it wasn’t too good if she rejected the old madame’s offer, so she gathered up all her wits and said.</p><br/><p>“This concubine is grateful for old madame’s good intentions. However, you know that this concubine hasn’t been able to sleep well and has been sick and depressed quite often. If some lively girls come over, it might make them unhappy. Perhaps some steady old servants would be a good choice?” It was fine for her to bring up this request, right?</p><br/><p>The old madame nodded inwardly. This concubine didn’t just submit meekly to her will, but also didn’t slap her in the face. Most importantly, their wishes were somehow in sync, so it was like killing two birds with one stone. Her thoughts caused her to smile as she said, “You’re rather considerate of them. Then as you wish! However, I’ve already picked out an old servant for you. She was originally a servant of my family. Her circumstances are a little poor and she’s been married three times now, but, she’s happy now.”</p><br/><p>“Yes, as old madame wishes.” The old madame’s words were a bit weird, but then again, she didn’t really understand much of the nuances in the old madame’s words in the first place..</p><br/><p>The old madame knew she didn’t understand and continued, “Although she’s had a hard life and married three men, every one of them treated her extremely well. Do learn from her.” After saying so, she put down her teacup and said, “I heard that the Prince went to your place yesterday?”</p><br/><p>Upon hearing the old stave-murderer mention the younger stave-murderer, Bai Xiangxiu’s guard went fully up. She hurriedly said, “Yes!” You old woman, what are you trying to say?</p><br/><p>The old madame said, “What do we women wish for in our lives, Miss Bai? Undoubtedly, it’s to serve our man well and leave a place in his heart. Don’t you think so?”</p><br/><p>“Old Madame, you’re absolutely right.” Right, your head. Men don’t count for a damn thing. If she wasn’t trying to escape her death, she would have just left this mansion and gone out to travel, who cared about relationships?</p><br/><p>“The Prince is your man, so it’s not too good if he comes and goes at night. Listen to the old servant’s teachings, and you’ll know how to get your man to stay.” The old madame didn’t care about Miss Bai’s awkwardness. Since she would be her son’s woman sooner or later, the old madame had to say these things.</p><br/><p>However, after hearing this, Bai Xiangxiu didn’t feel good. She thought inwardly, what exactly was this old madame trying to do? Pimp out her son? She felt like she had just swallowed a giant fly, and felt like she couldn’t breathe. Her face was so red it couldn’t get any redder. Half of it was shyness while the other half was anger.</p><br/><p>However, when thinking of her death coming in the near future, she lowered her head and agreed. I agree to it, but if your son doesn’t come, then what can I do? Anyways, the plot was about to pick up right about now. He was about to go chase after his fleeing consort, and she just had to act safely as her background female side character.</p><br/><p>1. Something similar to this: https://i2.kknews.cc/large/134a000496a07ff0fbd7</p><br/>\n</div>"}