{"title": "Chapter 29: When a Beauty Trips, She Still Looks Good!", "id": 29, "volume": 1, "url": "http://boxnovel.org/doomed-to-be-cannon-fodder-chapter-29-when-a-beauty-trips-she-still-looks-good", "volume_title": "Volume 1", "body": "<h1>Chapter 29: When a Beauty Trips, She Still Looks Good!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 29: When a Beauty Trips, She Still Looks Good!</p><br/><p>What should she do?</p><br/><p>She could smell the fragrance of the meat buns wafting over and instantly felt her empty stomach rumble. But there was a manly man sitting in front of her. If she used her hands, wouldn’t that be a bit inappropriate? Plus the person in front of her was the prince, the person who would brainstorm all sorts of reasons to kill her in the future. If she didn’t eat it now, he would probably think she assumed he had put poison in them. Then…</p><br/><p>Just thinking about what would follow was enough to scare her to death. If she had to choose between dying now or dying in the future, she would ultimately choose the latter. Perhaps she could then avoid death altogether.</p><br/><p>Bai Xiangxiu gritted her teeth and reached out for a meat bun, taking a decisive bite. Actually, Long Heng had been about to command Shu-er to find utensils. In all honesty, Shu-er had been about to get the utensils even without the order. But before either of them could do anything, they noticed Mistress Xiu bravely grabbing a meat bun and stuffing it into her mouth.</p><br/><p>Shu’er’s jaw nearly dropped. As for Xiao Shi, she fell to her knees and didn’t dare to get up. Bai Xiangxiu was honestly afraid the first time she took a bite. But she tasted the stuffing the moment she bit into it. The meat from ancient times was totally different from how folks prepared it in modern times. This had never occurred to her in the past, but the stuffing she’d had back then tasted nothing like what she was eating now.</p><br/><p>In modern times, the meat buns were somehow heavily processed. They were soft, watery, and didn’t have much of the taste of meat to it, and actually tasted like chemicals. Who knew what they had done to it? But in the ancient times, stuffed buns were different. The stuffing was purely pork meat. There were nothing added to it. The bun was made from natural flour as well, and there wasn’t any taste to it. When she bit into it, only a heavenly smell wafted out.</p><br/><p>Her bruised chest had tortured her for the entire day. She had already been hungry for quite a while now. Plus, she hadn’t eaten much last night. How could a small, growing maid like herself handle this? After she devoured one, she quickly devoured a second, and then a third…</p><br/><p>Since she had eaten one or two already, eating a few more wouldn’t matter! Firmly convincing herself, she bravely devoured all five meat buns.</p><br/><p>The three watching her stood there in awe. Five big meat buns! How did she manage to eat so much? Although they weren’t that big, for a lady, that was an enormous quantity. Although Long Heng specialized in glacial, emotionless expressions, he was quite adept at making up reasons in his mind. He thought a woman her size would naturally never eat this much. It must be because he had ordered the buns, so she had given him face and savagely eaten them all. She must be stuffed!</p><br/><p>He looked at her astonished expression and wanted to laugh. He said, “Let’s go.”</p><br/><p>“Go?” Go where? But she didn’t dare to ask. She wiped her hands and followed along.</p><br/><p>“Medication.” Long Heng frowned. Obviously, you must take your medication after you eat.</p><br/><p>“Oh.” Bai Xiangxiu walked over with great flair and downed the entire bowl of medication like tossing back a shot. She then used a handkerchief to wipe her mouth as she looked down docilely. That action meant, we can leave now.</p><br/><p>Long Heng wanted to take her for a walk to digest the food. But when they were walking out, he noticed she was walking extremely slowly. It was then he realized that she was still injured. So he ordered Xiao Shi, “Hold onto your mistress. Make sure she doesn’t fall.”</p><br/><p>Xiao Shi rushed to hold onto Bai Xiangxiu. She couldn’t understand why the prince wasn’t mad. Wasn’t he normally disgusted by rude or inappropriate behavior? Also, her mistress was fine, but he wanted her to support her mistress. She knew her mistress was injured, but it wasn’t so serious as being unable to walk. And where exactly was the prince taking them? It turned out the prince wasn’t taking them anywhere. He was just taking them for a stroll around the little courtyard. Neither she nor her mistress dared to say a word. They just obediently followed. After a while, Bai Xiangxiu seemed to realize they were going for a walk. Is he helping me walk the food off? But why does it feel like we’re the puppies and he’s the owner?</p><br/><p>At that moment, a group of people passed by. A mixed bunch, they appeared to be a group of an educated middle class officials.</p><br/><p>Bai Xiangxiu took a quick glimpse and didn’t recognize anyone. Since she was just a concubine, she definitely couldn’t stand out and make a big deal out of herself. So she continued looking down, playing her role of puppy to perfection. But as she looked down, she noticed a smiling figure coming up behind them. It was the second male lead.</p><br/><p>Ai ya, how am I supposed to seduce him now? Her thoughts started spinning and she carelessly tripped and fell forward.</p><br/><p>“Ah….” Xiao Shi instantly became alert and tried to pull her up. But since Bai Xiangxiu’s chest was injured, that tug caused her to cry out in pain. Xiao Shi was so scared that she didn’t dare tug at her mistress anymore, and left Bai Xiangxiu half kneeling on the ground.</p><br/><p>Song Jiaoyue had originally wanted to say hi to his friend and leave. But he hadn’t expected Mistress Xiu to trip when he approached from behind. A beauty was truly a beauty. Even when she tripped, she still tripped beautifully. Not only was she beautiful, the way she held onto her chest reminded him of the historic beauty Xishi and her legendary frowns. His heart ached bizarrely. This woman was too attractive!</p><br/><p>The one whose heart ached even more was obviously Long Heng. He turned around and angrily barked at Xiao Shi, “You can’t even take care of your own mistress! Go and receive your punishment.”</p><br/><p>He had always hated clumsy people, especially when he had specifically ordered her to be careful and hold onto her mistress. But she’d still messed up! Xiao Shi was horrified as she knelt on the ground, sobbing, “Your Highness, forgive me! Please forgive me!”</p><br/><p>Bai Xiangxiu also loved Xiao Shi dearly. She was clearly still a child.</p><br/><p>She had just made a little mistake; they wouldn’t beat her to death, would they? She was terrified when she thought of this and also got down on her knees, “Please forgive Xiao Shi, Your Highness! It was my fault. I didn’t walk properly.” Bai Xiangxiu looked into Long Heng’s eyes. Eye contact was very important when one was begging for mercy. Her eyes were watery and filled with pleading.</p><br/><p>Long Heng knitted his brows and spoke, “Get up!” Was a servant worthy of her getting down on her knees? She was honestly too kind.</p><br/><p>Song Jiaoyue also thought the same. Deep down however, every man liked the innocence of a woman that resembled a white lotus flower. He was no different.</p><br/><p>“Thank you, Your Highness.” Bai Xiangxiu breathed a sigh of relief. Xiao Shi didn’t even dare to say thank you as she lifted Bai Xiangxiu up.</p><br/><p>Song Jiaoyue finally walked up to them, “Mother is planning to admire the flowers in the back courtyard. Would you like to come, Your Highness?”</p><br/><p>Long Heng normally wasn’t interested in this type of activity. But looking at Bai Xiangxiu, who was currently patting her dress, he figured she was a talented girl. So he finally opened his mouth and uttered a monosyllabic, “Sure.”</p><br/><p>Song Jiaoyue led the way, but Mistress Xiu and her servant didn’t move. She seemed to be hesitating, her eyes were darting around continuously. Ultimately, she said, “Your Highness, I won’t be going. My identity is inappropriate for this gathering.” She was only a concubine. If she walked with a group of official wives and proper daughters, people would look down on her. She hated how they looked down on people. It wasn’t like they were that much stronger or better than others.</p><br/><p>Song Jiaoyue was impressed. He didn’t think someone as bold as her would be so understanding. Having such a woman in one’s rear court was certainly a blessing. In the same vein, a virtuous wife meant less trouble for the husband and family.</p><br/><p>Long Heng noticed Song Jiaoyue’s admiring stare. His irritated and upset heart was soothed, becoming calm again. So it seems that she was doing it for him! Therefore, he said, “Follow along.”</p><br/><p>Obviously, Bai Xiangxiu wanted to follow along since it meant she could spend more time with the supporting male lead! Although she didn’t like those obnoxious stares, she could just ignore them. Plus, it was the prince who told her to come along. She looked meaningfully at Xiao Shi and the two of them docilely followed along behind them.</p><br/><p>Originally, Xiao Shi had wanted to make her catch up to the prince. But who was Bai Xiangxiu? She had read the book, okay? She knew Song Jiaoyue preferred women who were low profile, but could not be weak at critical moments.</p><br/>\n</div>"}