{"title": "Chapter 26: Blood Froths and Boils", "id": 26, "volume": 1, "url": "http://boxnovel.org/doomed-to-be-cannon-fodder-chapter-26-blood-froths-and-boils", "volume_title": "Volume 1", "body": "<h1>Chapter 26: Blood Froths and Boils</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 26: Blood Froths and Boils</p><br/><p>Having experienced many life and death battles, Prince Li should logically have a heart as unruffled as still water. However, he just didn’t have any resistance to these type of matters at all. He squinted, feeling that this temple and all its surrounding environment were just… beautiful, like a dream or an illusion.</p><br/><p>At this time, Song Jiaoyue was also stunned by the great words of the woman within. A girl who could see things so clearly was already extremely rare, but what was even rarer was a woman would use those words to persuade the future mistress of the household to go through with the marriage.</p><br/><p>Who in the capital didn’t know of Prince Li and Miss Lin’s impending marriage?</p><br/><p>While the Lin Family could also be considered as marrying above their status in this union, Prince Li’s reputation upon returning from war had not been very good. Especially over matters of ill-treating women, the originally jealous family members of the various ladies had felt very fortunate that they didn’t have to wed their daughters to such a beast.</p><br/><p>Still, Song Jiaoyue knew that all of these were false accusations.</p><br/><p>However, through her words, he discovered that this woman’s breadth of vision was not ordinary, even pointing out that someone was intentionally causing the rumors. This was already not something that the ordinary smart woman would be able to think of, and moreover, she was still a concubine.</p><br/><p>Hearing Miss Lin escaping and Mistress Xiu seemingly having been injured, he gently patted Prince Li’s shoulder, but saw his friend’s entire body tense up before turning and leaving as though he had not heard anything at all. Seeing that his face was actually as per normal, his footsteps not flustered in the least, Song Jiaoyue could not help but frown. Was he really not moved? As one said, countries were easy to obtain, those who understand you are harder, ones who were female being exceptionally rare.</p><br/><p>Having such a person, that would be the greatest happiness for a man! However, his friend was so cold, just what was he thinking?</p><br/><p>Yet how was Long Heng as cold as he thought? His fist was clenched tightly all the way. Only when he had returned to his room and calmly part with Song Jiaoyue did he let out a breath he was holding, or, more accurately, completely wake up. He had no idea how he had walked back from there just now, as his heart was beating extremely rapidly.</p><br/><p>Sitting alone in his room, he couldn’t calm his mind down even as he sat in the meditative position and circulated his qi. His mind was filled with the words that that woman had said, her voice like a gentle breeze in his brain, wreathing about, and not dissipating easily.</p><br/><p>Originally, Long Heng had wanted to calm his heart and not think about it, but how could he not understand that the shock she had brought to him today wasn’t something that would easily fade? A concubine defending him to such an extent before a main wife, and most importantly believing in him to such an extent!</p><br/><p>If it was a man, he would not feel like it was anything, because they either deeply knew the principles within or possessed vision broad enough to see things clearly beyond just their surface. However, as a woman, coming from a scholarly family, how would she know about those political matters?</p><br/><p>But she just believed in him, even believing that those rumors must have been created by outsiders who possessed some ulterior motives. A woman choosing to believe in a man like this, did she like him then?</p><br/><p>He’d thought before that a woman who remained at home would never know whether rumours were true or false. Thus, he’d felt that once his wife married in, he should find a way to explain it to her. After all, she was someone he would be spending his entire life with, he would have to make her believe him no matter what, right? However, he discovered today that there was also a woman who believed in him without explanations having to be made.</p><br/><p>But why did his fiancée choose not to believe in him? She was clearly a noble lady hailing from a family of officials, so how could her vision actually be inferior to a woman of an ordinary family? How should he face his concubine tomorrow? She gave him a present, so he should give a return gift as well?</p><br/><p>He was incomparably conflicted, because these matters was really too difficult for a man who had never touched such relationship matters before.</p><br/><p>However, at this time, he also completely forgot the matter of his fiancée escaping. He’d actually thrown that thought beyond the nine heavens and hadn’t noticed it at all. It was only on the morning of the second day that he remembered that he had gone to visit that woman yesterday night, while she seemed to have been punished to go without food that night. A strange feeling of guilt crept up within him, and he hurriedly sent his servant to seek out news, sending her some breakfast if she had not yet eaten. Song Jiaoyue arrived after Long Heng had just sent the servant away. He too had not slept well at all the previous night. While he had not thought too much, there seemed to have been something tugging away at his heart, giving him an extremely uncomfortable feeling.</p><br/><p>“The abbot has already been awaiting for a long time. While the two of us are secular people, we still cannot keep him waiting.” Having said that, he smiled, seeing that this friend of his seemed to have a heart made out of steel. Was it that he was not worried about her injuries? Still, with his identity, it seemed like he shouldn’t mention this matter. Therefore, he suppressed these thoughts.</p><br/><p>But just when they were walking out, the servant entered from outside, saying somewhat frantically, “Your Highness, Mistress Xiu is injured and therefore currently still lying on her bed, unable to get up.”</p><br/><p>“Injured again?” Prince Li hadn’t thought that he would hear these news the first thing in the morning, and he couldn’t help but frown, “Let me go take a look, you help me apologize to the abbot.” He left hurriedly after saying thus.</p><br/><p>Song Jiaoyue laughed, “So, it is not that he had no feelings about it, but that he actually didn’t hear what happened. What a strange matter.” Thinking, he shook his head, going over to help him out with the old monk.</p><br/><p>Long Heng hadn’t thought that this woman would get injured so easily. Wasn’t she a beauty, and weren’t beauties all extremely powerful? He frowned deeply, reaching out to push open the door to the room in which she was resting.</p><br/><p>In his thoughts, she was his woman, and the matter from yesterday had indeed earned her a place within his heart. Therefore, he pushed open the door without thinking too much. He had not considered that this room was unlike his complex. It was very tiny, with the bed visible as soon as the door was pushed open. Xiao Shi was currently applying medicine for her mistress at the bed. The place she had struck and been injured yesterday was the area beneath her neck and a little above her chest.</p><br/><p>That place was completely bluish-black, and as Xiao Shi applied the medicine, she had to open her mistress’ clothes, and even push down her chest band a bit. 1</p><br/><p>The alluring light of her naked beauty leaked into the room, fragrant in its entirety. Added to Bai Xiangxiu’s extreme beauty, her figure being befitting of a female supporting character, it was naturally extremely good. Even though she was not completely exposed, this was already enough to cause Long Heng to completely tense up, the blood of his entire body boiling as he hurriedly turned and slammed the door shut.</p><br/><p>That neck which was white like jade, those deep valleys, with snowy white peaks that shook till his eyes were almost blinded. He had not had such a feeling even when the spies stripped themselves naked in trying to seduce him. Why was he so aroused by her who was still wearing her clothes?</p><br/><p>Seeing him in such a state, the servant hurriedly moved his head back as the two nearly collided. He asked curiously, “What has happened to Mistress Xiu?”</p><br/><p>“Did you see anything?” Long Heng suddenly stared at the servant’s face, his eyes narrowing.</p><br/><p>“This servant didn’t see anything at all,” The servant felt like if he said he saw something, he would be instakilled by his master with no mercy. Long Heng also didn’t know where this anger had come from, as he just felt that if she had been seen by others under such circumstances, he would definitely kill that person. Therefore, Xiao Shi randomly sneezed within the house, feeling a coldness on her back.</p><br/><p>Compared to them, Bai Xiangxiu was much more composed. As a modern day person who had often worn more revealing clothes and shorter skirts, she didn’t think too much of it.</p><br/><p>Also, she had actually also not been seen too much of just now. It was Long Heng’s gentlemanly performance which caused her to feel rather satisfied, but she was rather curious about the purpose of his visit, so she pulled on her clothes and gestured to Xiao Shi with her eyes.</p><br/><p>Arranging the things in the room a little, Xiao Shi now opened the door, curtseying in greeting, “Greetings to Your Highness, Mistress Xiu invites you in.”</p><br/><p>1. A bit similar to this (warning: potentially NSFW – https://i2.kknews.cc/large/96f0002939b8d0546b7)</p><br/>\n</div>"}