{"title": "Chapter 22, Sending a Gift, Secret Exchanges", "id": 22, "volume": 1, "url": "http://boxnovel.org/doomed-to-be-cannon-fodder-chapter-22-sending-a-gift-secret-exchanges", "volume_title": "Volume 1", "body": "<h1>Chapter 22, Sending a Gift, Secret Exchanges</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 22, Sending a Gift, Secret Exchanges</p><br/><p>Was the mama speaking good words on her behalf? But I really didn’t need that at all, really! Bai Xiangxiu secretly tossed a bitter look at the mama before lowering her head and remaining silent.</p><br/><p>The mama found it odd and adjusted her sleeves. Had she said something wrong?</p><br/><p>However, the prince displayed a satisfied expression and said, “This prince will go take a look. Jiaoyue, do as you like.”</p><br/><p>Song Jiaoyue had intended to visit the old madame with him at first, and he hadn’t expected that she would be asleep. Thus, he said, “I’ll take my leave first”, walking away without a single sideways glance.</p><br/><p>No! If he walked away now, she wouldn’t get another chance. Bai Xiangxiu immediately turned to the mama and said, “Mama, this concubine would like to go outside to… do that.”</p><br/><p>The Mama immediately understood. Seeing that she had served the old madame rather well and hadn’t tried to order them around like a master, she easily responded “Then go, be careful. Remember to wear your hat.” 1</p><br/><p>“Understood” Bai Xiangxiu was a person from the modern era, so she had the idea of equality, particularly towards older people. Thus, she always smiled at everyone, without the attitude of a master from this era.</p><br/><p>She actually wanted to put on airs sometimes, because weren’t all transmigrated girls like that? They would try to murder everyone everywhere they went because they were afraid that they would be hurt by others. However, the only plan she had was to seduce the supporting male lead and guarantee her own safety so putting on airs was definitely out of the question.</p><br/><p>She always felt that she would be able to return to her original world. She wasn’t like some of the others who had come before her, ready to accept their circumstances once they’d arrived here. Compared to this place, she preferred her life from before, planting flowers and nurturing plants with a serene heart. She had to keep fighting for that outcome. Firmly gathering her resolve, she clenched her fists and chased after the supporting male lead.</p><br/><p>This relay station wasn’t very large in order to ensure that the rest house for esteemed guests was extremely quiet.</p><br/><p>She only had Xiao Shi by her side, so she glared at her and said, “Keep a lookout for me.” After having said so, she made a begging gesture and chased after the supporting male lead, Song Jiaoyue.</p><br/><p>“Sir Song, please wait.” Her voice was very soft, but Song Jiaoyue walked even faster upon hearing her. She didn’t give up and said, “My apologies, it was a misunderstanding yesterday.”</p><br/><p>Song Jiaoyue then stopped to turn and look at her. He wondered what misunderstanding was behind the gift of mandarin ducks. Taking the chance while he was still startled, Bai Xiangxiu walked up to him and spoke, leaving a distance of three steps between them, “That perfume satchel was something that the Old Madame forced me to send to the prince.”</p><br/><p>“Oh?” Song Jiaoyue frowned. How had something meant for the prince ended up in his hands?</p><br/><p>“Actually, I had prepared another present for you that day, but due to strange circumstances, I had given you the wrong gift.” To resolve everything quickly, she ignored whether he agreed or not and just handed over the item to the servant at his side. This way, since she hadn’t personally placed it in his hands, he wouldn’t be able to pick faults at her.</p><br/><p>She then turned and walked away hurriedly, not caring about Xiao Shi’s gaze. However, because she had walked too quickly, she almost fell to the ground in a moment of carelessness.</p><br/><p>Xiao Shi suffered a huge fright and hurriedly scrambled over to prevent her fall. Luckily, the maid managed to pull her back up before she truly took a spill. She couldn’t understand her Madame Xiu’s brazen actions, but she thought that it wasn’t good to talk about her mistress’ business, so she could only keep her doubts in her heart.</p><br/><p>The servant glanced at his master. How should he handle the hot potato in his hands? Afraid that someone would discover them, Song Jiaoyue said nothing and returned to the carriage. They heard that the road had been cleared at this time and everyone was preparing to set off again.</p><br/><p>The servant asked from outside the carriage, “Sir, should we throw this away?” He hadn’t expected that the prince’s concubine would actually be this brazen.</p><br/><p>Song Jiaoyue wanted to have him throw it away at first, but upon thinking of how desperately she had tried to explain things, it didn’t seem like she had any presumptuous ideas towards him. “Bring it here.”</p><br/><p>The servant felt that beauties were indeed an existence that were hard to reject. Even a refined man like his master couldn’t escape the trap of a beauty. Thus, he passed over that book. It was really just a book, and it was even an instructional book.</p><br/><p>Song Jiaoyue naturally knew that his present had to be within the book. What possible use would sending a book be to him?</p><br/><p>A corner of the gift was peeking out from the pages of the book. Using his slender fingers to flip open the book, he saw an extremely special bookmark within. Written on the bookmark was a poem, “If one does not study diligently when possessing black hair, then one might regret it when one’s hair is bleached white.”</p><br/><p>He couldn’t help but be startled. No matter how you looked at it, this wasn’t something that a woman would send to a man she had intentions towards. Could he truly have mistaken her intentions previously? Or was she afraid that she would be hated and had sent this gift to make up for it?</p><br/><p>Whichever the case, this phrase was easy to understand and had a deep meaning to it. It was extremely suitable as a bookmark to remind himself of its message. After hesitating for a moment, he still accepted it. He just hoped she wouldn’t overstep her bounds again. However, there were very few girls who were so brazen as to send him a gift for no reason.</p><br/><p>Speaking of which, they hadn’t really interacted much. There was only one possible reason for why she had sent the gift, the fame of Sir Song Jiaoyue’s talents. As he thought about it, that was the only reason that he could think of. It looked like this girl was also a person who admired talent. If she didn’t admire talent, why else would she send him a gift? Especially since he was a man?</p><br/><p>Song Jiaoyue was still wondering why a concubine would suddenly send him a gift out of the blue for no reason, when the carriage began to move. Although the gift was completely innocuous, the thought behind him surely wasn’t as innocent as it seemed? He almost decided to toss it out as his thoughts spun like a child’s waterwheel, but in the end, he chose to keep it. After all, the bookmark really was an elegant gift.</p><br/><p>Bai Xiangxiu had tried her best for the sake of some positive interaction with him. She could only use this kind of brainless and direct method. She didn’t care whether he was conflicted or not, she had to think about what she had to do for the next step.</p><br/><p>Xiao Shi watched her on the carriage. Ye-mama hadn’t been able to withstand the jolts and bumps of the carriage and had been sent back to the prince’s mansion. She looked at Bai Xiangxiu with slightly reddened eyes, wanting to ask but not daring to.</p><br/><p>“Stop looking at me like that. When I went out to look for Huo’er last time, Sir Song helped me out, so I gave him a gift in gratitude.” Bai Xiangxiu lied without missing a beat. Actually, she didn’t even know if Song Jiaoyue still recognized her.</p><br/><p>Xiao Shi still stared at her, “But you can’t be so…” She couldn’t bring herself to say the word brazen. Wasn’t this a secret exchange?</p><br/><p>“You know that I can’t tell anyone of what happened that day. But if Sir Song hadn’t helped me that day, I would have been taken advantage of by some thugs. This gift is rather small for the help he gave me that day.” Bai Xiangxiu used her sleeve to dab at her completely dry eyes. Despite that, it went a long way towards earning her Xiao Shi’s sympathy. She now thought that her mistress hadn’t done anything wrong, since the receiver had indeed done her a big favor.</p><br/><p>“Then, you can’t do it again!” If something like that happened again, she would die of fright!</p><br/><p>“Mm, of course there won’t be.” She had also been scared to death. It was just a normal gift, but she had to be wary of so many things. It was so tiring to live in the ancient times.</p><br/><p>They finally reached Long Hua Temple after persevering for a little while more in the carriage. The monks of Long Hua Temple were extraordinarily busy with all the noble guests that were arriving. Amongst all their guests, this common prince was rather popular. There weren’t too many families with power, money and background in this city after all. Thus, the female guests were quickly escorted to a large guest house. This guest house with twenty or so rooms would be their accommodation for the night.</p><br/><p>They hadn’t expected that the Lin family would be placed right next door, which was where the female lead, Lin Qianzi, and Madame Lin were staying. They had actually placed them so close together, and this was the night that the female lead was going to escape. Was she going to get a front-row seat to the show? Unfortunately, Bai Xiangxiu just wanted to get as far away from them as she could, so she wouldn’t get mixed in with them. Other than the supporting male lead, she didn’t want to bother with any of them.</p><br/><p>1. A very particular sort of hat with a veil on it. http://ftp.sanww.com/users/dd/dd20140317-1.jpg</p><br/>\n</div>"}