{"title": "Chapter 52: Eloped, Ruined Reputation", "id": 52, "volume": 1, "url": "http://boxnovel.org/doomed-to-be-cannon-fodder-chapter-52-eloped-ruined-reputation", "volume_title": "Volume 1", "body": "<h1>Chapter 52: Eloped, Ruined Reputation</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 52: Eloped, Ruined Reputation</p><br/><p>Of course Long Heng understood his thoughts. If he hadn’t known why that Miss Lin had ran away from her marriage, he’d probably smile at most, but he had heard the words she said that day.</p><br/><p>Someone who mistrusted their future husband just because of a few words other people had said was a person who chilled his heart. Even if she was his future wife, he still found it extremely irritating. Thankfully, there was a woman at home who believed in him unconditionally. Even if he was furious, there was no need to argue take it out on an ignorant little girl. It was a pity she couldn’t give him a few days’ worth of rest. She hadn’t even come back even after running off.</p><br/><p>Or perhaps, she couldn’t return?</p><br/><p>“Since Minister Lin has spoke up, then this prince shall send people to investigate. However, it isn’t wise to publicize such a matter, so inquires will have to be made in secret. Your thoughts?” Long Heng picked up his tea and observed the table full of savory dishes.</p><br/><p>It was no big deal to eat at the barracks with the other soldiers, but these days he’d been constantly thinking of the flavor of Madame Xiu’s vegetable dishes. This time, he couldn’t go back empty-handed. After all, he was still concerned about her body, wasn’t he? Of course, there was the person herself as well.</p><br/><p>Long Heng couldn’t sit still when he thought of her, so he stood up as soon as he heard Minister Lin agreeing to his words. “Does Minister Lin have any other matters at hand?”</p><br/><p>Minister Lin’s expression turned unpleasant. Wasn’t this single matter already enough? It seemed like military men were military men, even their speech was careless and casual. His heart felt uncomfortable at the thought of his own sweet-tempered daughter marrying such a man. “There’s nothing else.”</p><br/><p>“Then this prince will take his leave.” But after he went down the stairs, he recalled that table of dishes. Although the prince’s estate treated each of his women well, she was always suffering grievances because she was in charge of the household accounts. She never dared enjoy an iota more of extra treatment compared to everyone else.</p><br/><p>When she was missing things, or had less of something, she took it out of her own expenses. She was probably even afraid to be wasteful when eating! Thinking up to here, he was in less of a hurry to return, and had the shopkeeper prepare a few dishes to go so he could bring them home.</p><br/><p>Bai Xiangxiu had just about gotten better aside from a little internal inflammation. The corner of her lips had cracked, while a few pimples had emerged on her face. She touched her pretty cheeks. Although these things didn’t affect her beauty, they were still a depressing sight.</p><br/><p>She couldn’t help but sigh. Did this prince feel that, deep down, it wasn’t good to kill people with beatings either? So he wanted to kill her with sweetness instead? His tonics had fed the patient until she had an excess of heat. This was simply too damaging. She touched her pimples as her mood plummeted once again.</p><br/><p>Excess internal heat was most likely to depress a person. Even more depressing was the fact that the male lead was set to return soon. Wouldn’t that mean they had to continue what happened that other day? She felt completely unwell at the thought.</p><br/><p>Unexpectedly, all he did was send someone over with a table’s worth of dishes before going off to busy himself. He didn’t even show his face. Something was a bit off about this situation. She couldn’t help but probe around and assumed he’d gone to some other concubine’s bed when he couldn’t bear it anymore. Instead, everyone avoided her questions or gave her vague answers.</p><br/><p>This was strange. Usually, everyone would race to answer a question if she asked, but why were they all evading her now? Their gazes even held expressions of ‘pity,’ so a clueless Bai Xiangxiu could only blink and do her own thing. Still, she wasn’t completely without ideas. At night, she took out one of the cactus thorns and stuck it on Ye-mama’s sleeve until she heard the reason. As it turned out, only a few old female servants knew the cause. Even Xiao Shi wasn’t clear.</p><br/><p>Ye-mama and the other old female servants gathered together with a bit of wine to chat before they started enumerating Miss Lin’s wrongs.</p><br/><p>Huo’er narrated their words off on the side while Bai Xiangxiu brushed her hair and listened. In truth, Huo’er didn’t really understand matters of human relationships, so he could only recite the words verbatim like one of those online reading softwares. There was no inflection or feeling in his speech, but Bai Xiangxiu was excited to hear his words. She almost pulled out her hair as she was lost in eavesdropping.</p><br/><p>As it turned out, these old female servants heard from the old madame’s side that the prince was perfectly fine on his way back until he caught wind of Miss Lin getting into trouble outside. Thus, he went to look for her.</p><br/><p>Bai Xiangxiu was close to tears, moved to the point that she was ready to offer incense to the female lead. She assumed the other had finally made her move to steal away the male lead, though she was at least two months late. Everything would work out as long as he left. It was much better than having the male lead molest her here. Furthermore, as long as the female lead got together with the guy, she could hug the old madame’s leg while waiting quietly for next year to roll around.</p><br/><p>She could tell that that old madame welcomed those obedient, docile types. But as soon as you created trouble, you’d be punished. It was pretty easy to indulge a boss like this. In fact, she was a bit like her old manager in the modern world.</p><br/><p>When there was nothing else to do, she could cook a few dishes to show her filial respect, then do everything as the old madame liked. She’d become her capable subordinate that way so that they’d find it painful to pluck her off when the time came. That’s what she’d do. By exercising patience and restraint, she’d wait and place all her hopes on the cactus Huo’er.</p><br/><p>After combing her hair, she lay on the bed and suddenly realized something.</p><br/><p>Since the male lead had delayed his search of the female lead for two months compared to the novel, that meant he hadn’t disturbed her before then. If that was the case, had the second supporting male and the female lead already do this and that?</p><br/><p>They shouldn’t have. After all, the female lead needed to preserve her purity for the male lead. Otherwise, the male lead would feel like she betrayed him no matter how generous he was. Who knows, his love might even take a sadomasochistic turn.</p><br/><p>After pondering for awhile longer, she realized that wasn’t right, either. The second supporting male was nothing like Song Jiaoyue. If Song Jiaoyue was a modest young lord, then he was a beast in human form. He was from the jianghu, after all, and naturally did as he pleased. Very rarely did he leave women he fancied with their virginity intact. Moreover, he had high martial arts skills. If he wanted to steal or ruin something, the fragile female lead wouldn’t be able to resist at all.</p><br/><p>So then…</p><br/><p>She began to worry for the female lead. If that girl didn’t treat herself properly, or felt that there was no use in cherishing herself, then both girls would both be doomed together.</p><br/><p>Bai Xiangxiu could tell that the male lead’s motives towards her had to be impure as well. No, they were extremely impure. Just recalling that night was enough to make her hot and flustered. She covered herself up and wanted to have a restful sleep, but stayed up for half the night.</p><br/><p>The male lead she was afraid of wasn’t asleep either. Right now, he was standing on a tall mountain, looking in the direction of the capital with a vexed heart. Originally, he thought he could go back to the capital and see a soft and fragrant beauty, but he was intercepted by the latest news. That Miss Lin had actually been placed under house arrest.</p><br/><p>It seemed like that other man was immensely fond of her. All the men he sent had been immediately discovered and even killed on the spot. After the corpses were discovered, he brought people with him to investigate, only to find that his opponents had switched dens and left the place deserted.</p><br/><p>“Burn it!” That Miss Lin was certainly formidable. She didn’t understand martial arts and knew little of the world, but dared to run helter skelter on her own. Then she ended up in a thieves’ den. Taking her out of there this time would probably be difficult.</p><br/><p>He could save her, but when the task ate up the time he could spend with Madame Bai, he felt a bit resentful. Because of his enmity, he wanted the other to have a hard time. Thus, the next day news spread across the capital’s streets and alleys that Miss Lin had eloped with another man.</p><br/>\n</div>"}