{"title": "Chapter 69: Friendly, Getting Along Harmoniously", "id": 69, "volume": 1, "url": "http://boxnovel.org/doomed-to-be-cannon-fodder-chapter-69-friendly-getting-along-harmoniously", "volume_title": "Volume 1", "body": "<h1>Chapter 69: Friendly, Getting Along Harmoniously</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 69: Friendly, Getting Along Harmoniously</p><br/><p>But there still weren’t enough dishes. Moreover, they had to prepare for the banquet ahead of time. Otherwise, if they were missing dishes or lacked enough when the time came, the Song family would lose face. A few masters had come from the temples, but they normally only made dishes for the senior and junior monks. No matter how well they cooked, their knowledge of vegetarian dishes were limited. Furthermore, the kitchens of this time weren’t equipped to make a hundred different vegetarian dishes. So when Madame Song had Bai Xiangxiu come, the former had made the right decision. Although Bai Xiangxiu hadn’t made some of the dishes before, she could think of them just as well, which helped immensely.</p><br/><p>The old master was even more satisfied. His original idea was to settle for 50 dishes if they couldn’t come up with 100. But as soon as she came, the number of their dishes rose to 80, so he was filled with wild ambition.</p><br/><p>Madame Song saw her sitting there deep in thought and knew that she was a serious person. She couldn’t help but say affectionately, “There’s no need to rush. Take you time to think, if you get too tired, that mother-in-law of yours will get mad at me!”</p><br/><p>“Mm, I want to take a walk around the greenhouse. Maybe I’ll be inspired.” Bai Xiangxiu had a sense of propriety as well. She wouldn’t make a big fuss at the Song family, she would just diligently do her own thing. She swore to turn the fifty dishes into a hundred!</p><br/><p>“This…” Inspiration? Madame Song thought. This wasn’t painting or poetry, so was inspiration needed?</p><br/><p>On the other hand, Song Jiaoyue thought that her brain must be full of things. Because she couldn’t think up something under such pressing circumstances, she needed inspiration instead. He couldn’t help but say, “How about an old female servant and I take Madame Xiu over for a look?”</p><br/><p>Madame Song knitted her brows, feeling that this wasn’t quite appropriate. But servants would be accompanying them. If anything happened, it would be a disservice to Prince Li’s estate.</p><br/><p>Song Jiaoyue said, “The greenhouse is very far away. I’ll escort her over before coming back.”</p><br/><p>“That’s feasible. You all be careful,” Madame Song thought it made sense. Although the greenhouse was within the estate, it was still rather far. It would probably take some time to walk over there. It wouldn’t be good if anyone busying around their estate happened to bump into their guest. After all, they weren’t all of one family. And so, Song Jiaoyue had someone prepare a sedan chair to carry Bai Xiangxiu over to the greenhouse.</p><br/><p>Bai Xiangxiu wrung her handkerchief in the sedan chair as she thought of various dishes. Song Jiaoyue dedicated himself to escorting her the whole way. They arrived soon enough. Song Jiaoyue was planning to exchange a few words with Bai Xiangxiu, but as soon as she got off the sedan chair, she became a woman of action who barrelled into the greenhouse.</p><br/><p>Song Jiaoyue was left behind with a wry smile. He never expected that she, as a woman, could let go of her feelings much more easily. Back then, he was the one that rejected her, but now he had to bring trouble upon himself. And for what reason?</p><br/><p>He was about to leave when he heard a cry of alarm. He hastily parted the hanging screen and looked inside, only to see Bai Xiangxiu on the ground with Xiao Shi fallen on top of her. Her face was rather pale, as if she was enduring some pain.</p><br/><p>Bai Xiangxiu had a beautiful face to begin with, so she looked even more delicate and charming when she knitted her brows. He didn’t have time to think, but hurried to reach out and pull Xiao Shi aside. “Hurry and get up, you’re crushing her.”</p><br/><p>Xiao Shi knew as well and hastily got to her feet before looking down. “Madame Xiu, are you alright?”</p><br/><p>“Foot…” Got twisted.</p><br/><p>A pained Bai Xiangxiu spoke hoarsely as she sat up. “I told you to be careful when walking. See how you tripped?” She didn’t blame anyone, but reached out to grabbed the hand offered her way as naturally as could be.</p><br/><p>There was no helping it. Modern women weren’t so particular about such details, so she even told the person who helped her up, “Thank you.” After a careful look, she realized it was Song Jiaoyue, who stood rooted to the spot as if thinking about something.</p><br/><p>“You have to tread here carefully. There are a lot of stray odds and ends here. Why not go back and rest a bit first? How’s your foot?” Song Jiaoyue finally recovered, his hand still holding traces of her fine and exquisite skin. It made his heart beat faster.</p><br/><p>“It’s fine, I’ll be all right after I walk it off.” Bai Xiangxiu gave him a small smile before turning to examine the greenhouse of ancient times.</p><br/><p>Although it didn’t have the heat-retaining technology of modern greenhouses, the vegetables here were growing very well. At the very least, it was more than enough to supply the needs of an estate. The prince’s estate was much bigger than here. When she had time, she should walk around it as well. It’d be nice to get a little greenhouse of her own to grow plants. This way, she’d have greenery to look at even in wintertime.</p><br/><p>After walking about in a circle, she thought up a few more dishes and had some servants prepare the ingredients. Song Jiaoyue helped out on the side until they finally settled on a hundred dishes by nighttime.</p><br/><p>Although she hadn’t done much work physically, Bai Xiangxiu was already tired to the point of collapse. Add that to her aching foot, and she leaned on one side to rest after rubbing it with vinegar. Soon enough, it was announced that the eldest young master’s two head female servants were going to pay a call. Actually, she already knew that these two head servants were half concubines. When they came in, she discovered that their hair was indeed coiled atop their heads. Most likely they were women of the bedroom for Song Jiaoyue.</p><br/><p>Both of these servants looked very pretty. They smiled when they saw her, carrying a scholarly and refined air of their own. Bai Xiangxiu felt herself struck slightly by their sight. She felt that it was very natural for the supporting male to reject her.</p><br/><p>Though she had a good-looking face, she didn’t feel like she had any sort of aura or bearing. She really was far too inferior against those two. In any case, that was all over now, so it didn’t matter whether he fancied her or not. Although she still felt a bit awkward in the presence of the supporting male, she could still stay on friendly terms with him as long as she didn’t think about it.</p><br/><p>As soon as these two servants sat down, they asked if she was tired and used to life here. Then they introduced themselves as Yu Se and Bai He. A young master of ancient times really had the luck. He already have two beautiful women despite being so young.</p><br/><p>Bai Xiangxiu had no other thoughts on hand, so she didn’t act any differently than usual. Smiling, she had them sit and said politely, “There’s nothing I’m not used to. I’m busy all day at the estate as well.”</p><br/><p>“That’s right. Big sister is fortunate. They say that the old madame really depends on you.” Bai He smiled as she had someone bring up a basket of fruit. “These fruits were brought from the altar offerings. Eldest young master said you’re a devout Buddhist, so he told us to bring you some to taste. It’d be nice to be touched with an air of the divine.”</p><br/><p>Bai He was a lively, vivacious speaker who was brisk and efficient, so Bai Xiangxiu smiled and said, “That’s all well and good. I’m no such devout Buddhist, just someone who eats vegetarian dishes on the first and fifteenth.”</p><br/><p>“You understand so much just from eating vegetarian. Amitabha, it’s a good thing you’re not a believer. Otherwise, wouldn’t we be paying a courtesy call to a Bodhisattva?” Bai He saw that Bai Xiangxiu had beautiful looks and a friendly temper, so she wasn’t reserved when she spoke.</p><br/><p>Yu Se shoved her and laughed. “This servant’s been spoiled rotten by young master. Don’t blame her for her lack of manners.”</p><br/><p>Bai Xiangxiu knew that people of the past rarely joked about gods and Buddhas, and so never expected Bai He to be so bold. “I don’t have any taboos. There’s usually nobody to joke with me at the prince’s estate, so I’m almost turning old and frail before my time.” These were true words. Because she was in charge of things at the estate, everyone held her in veneration and awe. Xiao Shi was rather casual with her, but she was too well-behaved and the worst for jokes.</p><br/>\n</div>"}