{"title": "Chapter 88: The True Act Begins with Illness", "id": 88, "volume": 1, "url": "http://boxnovel.org/doomed-to-be-cannon-fodder-chapter-88-the-true-act-begins-with-illness", "volume_title": "Volume 1", "body": "<h1>Chapter 88: The True Act Begins with Illness</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 88: The True Act Begins with Illness</p><br/><p>The doctor came out at this moment. He was honestly very conflicted. The two mistresses of this manor who were actually dependable were falling ill one after another. This was really keeping him busy as a doctor.</p><br/><p>The senior madame hastily walked up to the doctor when she saw him walk out. “Doctor, how is the old madame? ”</p><br/><p>Bai Xiangxiu’s mouth twitched. Why did she just get the feeling that the senior madame and old madame were mother and daughter? They didn’t even get along normally. Look, the doctor’s obviously been scared by this proactive senior madame. Indeed, he was analyzing what the relationship between these two where and why the senior madame seemed so agitated. In the end, he coughed lightly and said, “This is a chronic illness for Old Madame. She can’t stand the cold of shifting seasons.” He then spoke some more professional jargon before leaving.</p><br/><p>The four people looked at one another. Finally the senior madame smiled and said, “Younger sister, Old Madame has always been loving to you. Would it not be good If you looked in on her on our behalf?”</p><br/><p>Bai Xiangxiu was speechless. She wondered if these people had also transmigrated like her. Why were they even more clueless than she was? Where was that bit of professional knowledge that concubines need to survive? If you enter a room without the masters summoning you, that’s just looking for trouble. Or is it that all of you feel like you’ve lived too long and need to shorten your lives? </p><br/><p>She had long since resigned herself to her role of the female supporting character, so she’d made sure that she was well aware of these niceties after arriving here. She was deathly afraid of being done in before she could go back to her time because of a mistake. Even if the prince wasn’t that cold to her and the old madame was good to her, the identity of the female supporting character was after all, lacking. She couldn’t have any expectations.</p><br/><p>“Senior Madame is jesting. Who enters when the master hasn’t summoned you? It’s better to wait outside for the summons.”</p><br/><p>“Younger sister truly is careful. The prince and Old Madame wouldn’t blame you even if you did so. Everybody is thinking about her, how can younger sister be so indifferent? Old Madame has always treated you like her own daughter!” There was a knife hidden in the senior madame’s smile. She was on an unknown level but clearly much higher than the second madame.</p><br/><p>Bai Xiangxiu didn’t feel that good about this turn of events and wasn’t in the mood to pay the senior madame a compliment. The latter’s words had pushed her onto the side of being heartless and faithless. It was a bit difficult to jump out of the hole the senior madame had dug for her. Fortunately, her reaction was fairly fast so she answered with a smile, “Senior Madame really speaks funny things. How would this concubine dare be Old Madame’s own daughter? I don’t have that kind of fortune.”</p><br/><p>She didn’t say she would go in or that she wouldn’t. Instead, she was gently deflecting the senior madame’s attacks, like Taichi. As they exchanged verbal blows, Hua Xue, Old Madame’s servant, came out and said with a smile, “Oh, the ladies are still waiting here. It’s so cold today, aren’t you all frozen solid? Old Madame has just woken up, and everything is fine; you can all go back!”</p><br/><p>The senior madame didn’t dare remain arrogant now. She only said, “Old Madame’s luck is naturally good, amitabha. We will be at peace as well then, so we can all go back.”</p><br/><p>Hua Xue nodded, and turned to look at Bai Xiangxiu off on the side. “Fourth Madame, please wait a moment. Old Madame has asked you to enter so she can give you some instructions.”</p><br/><p>“Understood.”</p><br/><p>What instructions? Bai Xiangxiu walked in with a very worried expression. She saw the old madame reclining next to the stove with an ashen face. Prince Li was standing guard by her side, his usual expression on his face.</p><br/><p>She frowned, made a bow and asked, “Is Old Madame well?”</p><br/><p>“Much better. Come, sit. I have things I want to tell you.” The old madame beckoned with her hand and had Bai Xiangxiu sit. Bai Xiangxiu went to sit by her side according to the old madame’s words, meek and modest. She didn’t ask anything and waited for the old madame to speak to her.</p><br/><p>The old madame had grown to like this calm, steady temper of hers and said, “This illness of mine is from the cold, and attacks me every time the season changes. The doctor intends to have me go live in the south for a few days until my illness becomes better. But I will have to hand over the matters of this manor to you, are you willing to take on this burden?”</p><br/><p>Bai Xiangxiu jumped a bit in fright upon hearing this. She could still understand the idiom that the most outstanding would bear the brunt of the attack. She dropped to her knees and said, “I am but a concubine. But what right and privilege do I have to govern the Li Manor? I’m afraid that mistakes will occur under my watch.”</p><br/><p>The old madame was in no hurry to have her rise. She exuded benevolent authority and said, “I know your personality, it’s far too conservative. However, you can safeguard wealth and keep a low profile. This is good. When I left the manor in the past, I would always have some of the mama take care of matters. However, since we’ve newly moved into the manor, I am a bit worried since this will the first time I am letting go of things.” She paused and then continued, “There needs to be someone holding down the fort in the manor. You do count as a master, just put on a bit of an air. I’ll have them do everything else, so it won’t tired you out.” </p><br/><p>Bai Xiangxiu understood things clearly. This company needed an honorary director, so she was going to be put into that place. Second, it was impossible to avoid this job. Being contrary would only make the old madame unhappy. She could only nod her head and agree. “I hope to not make a mess of Old Madame’s matters.”</p><br/><p>“What are you saying? I’ve been able to tell over these past days that you have a stable temper but a kind heart. Kindness and harshness must be administered together to the servants if you want them to work hard. They must go hand in hand. But you don’t need to worry about this. After Heng’er returns from sending me off, you can report anything you don’t understand directly to him and he’ll handle things for you.” The old madame finished giving her the instructions and nodded at Hua Xue. The maid came and gently helped Bai Xiangxiu up.</p><br/><p>Bai Xiangxiu was a bit speechless. What was the point of reporting to him? Was she going to ask to be beaten to death? She was most afraid of stuff like this, alright? She’d get a mental illness just from being so worried.</p><br/><p>Long Heng thought that she was still hesitant due to fear. “You’re just a little too timid. What are you afraid of with the official seal in your hands? Have those who don’t accept your authority come find me.”</p><br/><p>The meaning behind the words was that she could act how she would in the manor, since power had been given over to her. But the old madame felt his words were somewhat over the top.</p><br/><p>These words wouldn’t matter much if Bai Xiangxiu was the main wife. But too much power could not be given to a concubine. She couldn’t be overly spoiled. If word spread that he was causing the destruction of his wife due to favoritism, that would be extremely bad for his reputation. The old madame coughed lightly before saying, “No one will be able to question you if you remember to keep to your position. Take the official seal for now, and I’ll place the key to the warehouse with Heng’er. You can go ask him for anything you need.”</p><br/><p>Long Heng frowned. She was to be made housekeeper, so why was he given the key? Why this kind of caution against her? This little girl wasn’t cunning; she was just like a kitten. She would be completely lost if you scared her even a little bit. But, after thinking it over, it didn’t matter if the key remained with him. He could give it to her privately, and if his mother asked him about it later, he could gloss over it as being too busy to take care of familial matters. </p><br/><p>Long Heng didn’t say anything else when his thoughts reached this point. After careful observation, he saw that Bai Xiangxiu neither displayed disappointment nor hurt at not being handed the key to the warehouse. She was indeed someone who didn’t fight or scheme for herself.</p><br/><p>The old madame gave the official golden seal to Bai Xiangxiu and spoke of some matters that needed to be handled. The old madame also handed over the preparations for the impending trip over to Bai Xiangxiu, treating it as a test of her abilities before the old madame set out.</p><br/>\n</div>"}