{"title": "Chapter 89: How to Punish Disobedience", "id": 89, "volume": 1, "url": "http://boxnovel.org/doomed-to-be-cannon-fodder-chapter-89-how-to-punish-disobedience", "volume_title": "Volume 1", "body": "<h1>Chapter 89: How to Punish Disobedience</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 89: How to Punish Disobedience</p><br/><p>Bai Xiangxiu listened earnestly, but she wasn’t too familiar with these new tasks and responsibilities. Therefore, she gathered a few mamas she knew from before for a small meeting. It was only at this moment that she discovered how much of an ordeal and how many rules had to be observed before the women of a large household could leave the house. It was truly an eye opening experience.</p><br/><p>First of all, every noble family in the capital and other areas had family insignias. The Prince Li family insignia was an eagle, woven onto a blue triangular flag. Because Long Heng was a prince, his flag had a gold trim. There was also a masculine ‘dragon’ character woven into the bottom of the flag, making the entire picture look both steady and grandly majestic. </p><br/><p>Nevertheless, Bai Xiangxiu was extremely afraid of that eagle’s eyes. Looking at it actually somewhat reminded her of Long Heng’s eyes. She always felt like it was glaring at her, like a sharp blade. </p><br/><p>Back to the topic at hand, if the women in this estate were just normal family members, or if they were her or just some female cousins come to visit, then only a flag with the embroidered family insignia and no gold trim would be mounted on the right side of the carriage. The flag wouldn’t be particularly conspicuous, but if people were to look closely, they would know what family those within the carriage were from.</p><br/><p>But if the old madame left the estate, many more rules had to be observed. She was the main lady of the estate after all, and so her carriage was adorned with embroidered flags with red trim. Here, red signified the status of the official wife. In ordinary households, no one could wear red unless one was an unmarried daughter or the official wife. </p><br/><p>Of course, there was more to come. Bai Xiangxiu had to think of who to bring along for the journey, what to prepare and what to bring. Otherwise, if the old madame was displeased at her arrangements, she wouldn’t be far from being banished to an out-of-the-way chamber.</p><br/><p>In order to make her superiors happy, Bai Xiangxiu held up her waist, and wielded her still swollen hand to make all sorts of preparations. Fortunately, she had a good relationship with these mamas, and they ended up helping her a lot. After the preparations were completed, she realized that she too had to prepare for a move.</p><br/><p>How could she let this happen! Winter Garden was one of the requirements for her return! Her head could roll and her blood could flow but she absolutely could not move out! “Put those things down. Don’t move. Who, who is it that wants me to move to Apricot Garden?”</p><br/><p>Apricot Garden was only separated from Long Heng’s residence by a wall. It was a residence that was meant for the female lead in the future. If she were to be arranged to move there at this time… do they want me to die earlier or… die earlier??</p><br/><p>Ye-mama laughed and said, “Naturally it’s His Highness. He says that Winter Garden is too small and too far away. Running the affairs of the estate from here would be too inconvenient.”</p><br/><p>In actuality, every servant here knew that the prince was doing this to help raise her status. That’s why he wanted to move her out of Winter Garden.</p><br/><p>“I understand. I will go talk to His Highness. All of you are not allowed to continue moving anything. Do you understand?” Bai Xiangxiu felt that men from the olden times were too domineering. When she was reading the novel, she felt that a man like this would be very reliable. She could have anything she wanted without having to even put forth an ounce of effort. Her life would be without any care or worries. But it had a shortcoming that was obvious in hindsight. He would never discuss matters with her before making a decision. He did things at his own whim and was convinced of the veracity in his decisions. </p><br/><p>The thought of raising her status or moving out of Winter Garden had never even crossed her mind. I definitely have to make sure he gets that point. Bai Xiangxiu didn’t have an ounce of confidence in refuting Long Heng’s orders. But she felt that since this had something to do with her return, she definitely could not give in. She kept thinking as she walked, and eventually made her way to Long Heng’s residence.</p><br/><p>Because she was walking quickly, she was panting a little by the time she arrived. Everyone was busy outside of the residence. One of the servants was leading a horse over and preparing to saddle it. Long Heng was going to escort his mother to the manor in the south and was preparing for the trip as well.</p><br/><p>He was dressed up neatly in a black martial robe, his waist cinched by a belt of a dragon embroidered in gold thread, giving him a deep look as if he was filled with strength. Like a leopard, every crease of his body seemed to exude tightly controlled energy, energy that could explode out to kill the enemy at any time. </p><br/><p>The way he looked made Bai Xiangxiu go weak at the knees. But she gritted her teeth and still walked up to him. Unexpectedly, Long Heng did a double take when he saw her face, the sides of his mouth starting to float upwards into a dream-like smile.</p><br/><p>Long Heng’s face was really a gift from the heavens. He seemed like one of those domineering CEOs when he wasn’t smiling, but a kind and gorgeous man when he did. It made hearts quiver and melt. </p><br/><p>Bai Xiangxiu, previously filled with anxiety, suddenly felt less afraid just from his one simple smile. She swiftly walked up to him and gently bowed down. “This concubine greets Your Highness.”</p><br/><p>“No need. There’s no need to be so polite in our own home.” Long Heng was in a good mood. She actually came to send him off before he was about to leave. Looking at the way she was rushing, he felt an unusual warmth bathe his heart. This girl not only deeply believed in his character, she also seemed to rely so much on him. As a man, he can’t help but feel an insurmountable sense of pride. But moreso, he felt as warm as if the sun was shining down on him.</p><br/><p>“Your Highness, please have a safe trip.” Even if his smile was kind and gentle-looking, she was still not brave enough to speak her mind. What do I do? Bai Xiangxiu was blaming herself for being so timid. But seeing the expression in his eyes becoming even more gentle, she couldn’t help but to say, “Your Highness, there is another matter.” </p><br/><p>Long Heng’s brain was in extreme chaos after being coaxed by her coquettish manner of speech. If not for the surrounding people looking at them, he would’ve swept her into a hug in the throes of passion. At this moment, whatever her request was, even if it was to ask him to kill someone, he would agree to it without even the slightest hesitation.</p><br/><p>“What is it?”</p><br/><p>“Actually, your concubine… your concubine has a habit. If I move to another place, I might have trouble sleeping. So, I don’t wish to move out of Winter Garden. Your Highness, is it possible to let your concubine continue staying in Winter Garden?” At this moment, Long Heng was really making her so nervous that even her ears were hot and her heart was thumping. Her heartbeat was slightly irregular.</p><br/><p>“Hmm?” Long Heng creased his brows. Apricot Garden was so near his residence, yet she was reluctant to move there. Was she trying to hide from him? At the thought of that, his good mood from earlier had all but vanished.</p><br/><p>How would Bai Xiangxiu miss the change in his mood? She couldn’t help but tremble in her heart and say, “Your concubine is still somewhat sensitive to the cold and big places are often slightly colder. Furthermore, now that your concubine has just accepted some work, wouldn’t it make others gossip if I move immediately after? How about we wait until summer of next year for me to move in?”</p><br/><p>“Who dares gossip? Move in immediately.” Long Heng commanded with a cold voice. There’s no way he would listen to any excuses. </p><br/><p>Unexpectedly, Bai Xiangxiu became even more agitated. It was as though she would not have a home to return to after she moved to another residence. </p><br/><p>Therefore, she quickly fell to her knees and said, “Your Highness, please allow your concubine to continue staying at Winter Garden.” She’d tried all her excuses already, now she was gritting her teeth and not backing down.</p><br/><p>“You… dare refuse orders?!” Long Heng hadn’t expect that she would have the courage to do something like that. He was stunned for a second, but couldn’t help but grow furious immediately after.</p><br/><p>Tears were almost falling from Bai Xiangxiu’s eyes, but she held back them back and said, “Your concubine dares not. But your concubine pleads Your Highness to allow your concubine to continue staying at Winter Garden.”</p><br/><p>“Ms. Bai.” growled Long Heng. He could see that she was obviously afraid, yet she wouldn’t back down. People in the surroundings had also fallen to their knees. The atmosphere had suddenly become extremely tense.</p><br/><p>Bai Xiangxiu’s body began to tremble in the wake of his anger. Even though she was just kneeling there, it still seemed like she was about to faint at any second.</p><br/><p>Long Heng was thinking of ways to punish her in his mind. After so many years in the military, there was not a soul who had ever refused to follow his intentions. Unexpectedly, he’d just found one in his own estate, and moreover, it was a girl so weak he could kill her with a flick. Was she doing this on purpose? She was making him lose face in front of so many people!</p><br/>\n</div>"}