{"title": "Chapter 95: Murder Requires Courage, Too", "id": 95, "volume": 1, "url": "http://boxnovel.org/doomed-to-be-cannon-fodder-chapter-95-murder-requires-courage-too", "volume_title": "Volume 1", "body": "<h1>Chapter 95: Murder Requires Courage, Too</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 95: Murder Requires Courage, Too</p><br/><p>Xiao Shi’s eyes widened in fear as her face turned ashen white. “Madame Xiu, we should send someone to tell the prince about someone threatening you.”</p><br/><p>Bai Xiangxiu felt her hands being clutched tightly. Even Bao Qin was very shocked and agreed with Xiao Shi’s views.</p><br/><p>“He…the prince is very busy, so we don’t need to tell him about such minor matters.” He’d even been angry when he left. He probably wouldn’t pay attention to whether she lived or died. She wasn’t the female lead, so thinking too highly of herself would only cause her to tumble to her death. Besides, even if they told him, it’d be hard for him to come back!</p><br/><p>“There’s no rush. Murder requires courage, too. They won’t be making another move in the next few days.”</p><br/><p>“Madame Xiu, how could you say such things?” Xiao Shi was almost ready to cry from anxiousness. How could her own mistress be so casual about the whole affair? Actually, it wasn’t that Bai Xiangxiu was fearless, but more that she felt that she had to rely on herself for everything. Long Shuting wasn’t a simple character either, so perhaps he’d get to the bottom of things.</p><br/><p>Regardless, the most important thing was still the cotton clothing. She’d already displeased one boss, so she couldn’t afford to displease the other.</p><br/><p>Long Shuting was investigating the fire, so she’d take charge of the clothes. Though the larger workshops weren’t accepting orders, they could still find some of the more smaller ones to compensate. This just required time and manpower.</p><br/><p>She didn’t know any competent people to depend on, so she could only leave the estate in a carriage to look for workshops herself. But once Long Shuting found out, he still sent someone familiar with the capital to help her. Within a day of searching, they managed to find a few shops.</p><br/><p>There were over 100 people in the prince’s estate that needed cotton clothing. All of the masters and mistresses had their clothing made by the servants, so at least they didn’t need clothes from these workshops. But this was the season for cotton clothing, so all the workshops were very busy. Moreover, the materials on hand weren’t of the best quality either.</p><br/><p>After going through a few shops, Bai Xiangxiu came up with an idea. She could buy the materials herself and have the workshops just make the clothes, as long as she made sure the handiwork was good. Actually, this took both time and energy, but it was indeed a good idea. Mistakes would also be less likely. Thus, Bai Xiangxiu spent a few days leaving early and returning late until she finally finished the job.</p><br/><p>Every night, she would haul her tired body back. Because she would let the carriage go back at night, she ended up walking back to the estate on foot with Xiao Shi and Bao Yue. After sitting in the carriage all day, she felt like her entire body had turned stiff.</p><br/><p>The three females warmed up their joints as they walked, all looking quite exhausted. Bao Yue felt even more uncomfortable because this was her first day. In the past, it was Bao Qin who’d gone along with the Fourth Madame and Xiao Shi. But she’d fallen sick, and so Bao Yue had taken her place. At first, she thought it would be fun to leave the estate, but she certainly didn’t feel that way anymore after sitting in a carriage all day. They were kneading their waists as they walked when they heard a sudden, discordant cry.</p><br/><p>All three of them were grown-up girls, and thus very sensitive to such noises. They couldn’t help the cold sweat that broke out as as they exchanged glances. Should they hide? But that wasn’t right. They were in charge of the affairs of the household, so they shouldn’t leave at a time like this. That would be doing Old Madame a disservice.</p><br/><p>Still, did they have to oversee these kind of affairs as well?</p><br/><p>Secret liaisons and things of that sort were really depressing to handle.</p><br/><p>The voice grew louder as they stood there paralyzed in indecision. The woman in question seemed to be resisting as she said softly, “We can’t do it here, Brother Quan. Don’t be like this.”</p><br/><p>“Where else can we do it in the prince’s estate? Why do you care about such things? We should… live merrily one day after another.”</p><br/><p>Bai Xiangxiu stared at the moon and rolled her eyes, hard. If you guys hadn’t made a such a fuss, we would’ve walked right past and this could’ve just been a simple love affair between a pageboy and a maidservant. That wasn’t a big deal at all. But you just had to say such words for everyone to hear. To make matters worse, one of the voices was clearly Third Madame from the Autumn Garden, while the other was a guard named Ah Quan.</p><br/><p>She knew both of them, but never thought they’d be together.</p><br/><p>What now? Catch the adulterers in the act, or let them off?</p><br/><p>If she caught them, then according to the rules of the prince’s estate, one would be beaten to death and the other sold off. But that decision rested on whether the woman had served the master before and if she had any meritorious deeds to her name. If she’d never served the master or had meritorious deeds to her name, the punishment would be harsher.</p><br/><p>Just as Bai Xiangxiu was considering her options, Ah Quan sensed their alarm, shouted, “Who’s there?” and ran out. When he saw who had arrived, he gave a start before sheltering the person behind him. “Leave.”</p><br/><p>“You…”</p><br/><p>“It’s Fourth Madame, you leave.” It seemed like he wanted to protect Third Madame. Bai Xiangxiu had to hold such a man in good esteem for standing forward now to buy time for the female to leave. It was obvious he wanted to leave her a way out.</p><br/><p>That woman should’ve left by now, right? Bai Xiangxiu didn’t want to pry into the details. If one of them ran off, she could just go through the motions with the other. It would end up fine as long as he wasn’t beaten to death,.</p><br/><p>“Ah Quan, do you know your wrongs?” When she spotted Ah Quan’s red-rimmed eyes, she thought he’d try to silence them via murder, but instead, he actually fell to his knees. “Ah Quan knows his wrongs. May Fourth Madame let her off without looking into the matter anymore?”</p><br/><p>He admitted his wrongs just like that despite the fact that his accusers were just three girls. He could’ve just killed them and escaped! Her thoughts were still revolving around this point when a group of guards walked by. When they saw the situation, they all ran over to gawk, eh no, to protect the three of them.</p><br/><p>Bai Xiangxiu privately found things ridiculous. People who liked their work really did things meticulously. The same principle applied to clandestine lovers. They’d arranged a time and place and made sure it was somewhere where they wouldn’t be overheard.</p><br/><p>The guards of the prince’s estate always changed shifts while doing their rounds, and this spot was far enough away from the guards to avoid being heard. If the three of them hadn’t returned at nighttime and taken a shortcut to Winter Garden, the guards wouldn’t have found them either. These lovers really were professionals.</p><br/><p>Pff! Now wasn’t the time to think of those things. Bai Xiangxiu looked at the guards and said, “Capture this guard. For now, lock him up in the Repentance Garden.”</p><br/><p>The Repentance Garden was a place for locking up masters, mistresses, or servants who’d done wrong deeds. It was equivalent to detention, and the offenders would usually be shut inside for two to three days. If their crimes were heavy enough, they would also receive corporal punishment.</p><br/><p>A few of the guards recognized Ah Quan and noticed his disheveled clothing. It was his break time now, but he was wandering aimlessly in the gardens. Everyone could guess why he’d been captured with just a glance…</p><br/><p>They paid it no heed. Typically, those caught fooling around with maidservants usually ended up with the girl as a couple. So they just casually grabbed him before taking him into custody. Just then, a voice called from within, “Please don’t take Brother Quan away. Everything was my fault.” As she spoke, Third Madame walked out from behind the trees. She’d already readjusted her clothes until she looked like her usual pretty self, but now her face was streaked with tears. As soon as she walked out, she knelt down by Ah Quan’s side.</p><br/><p>Bai Xiangxiu’s eyes widened. She thought that this was simply a classic case of a lonely woman in the estate having an affair, but reality seemed determined to prove her otherwise. This was actually a show of true love.</p><br/><p>Ruining a pair of lovers was a hefty crime; dare she do such a wicked deed? But in the past, especially in a patriarchal society like this, she’d probably be snapped in half by Long Heng if she helped him wear a green hat 1.</p><br/><p>When she thought of Long Heng getting angry, Bai Xiangxiu couldn’t help but shiver in trepidation.</p><br/><p>1. wear a green hat () – an expression used when a woman cheats on her husband, boyfriend because the phrase sounds similar to ‘cuckold.’</p><br/>\n</div>"}