{"title": "Chapter 93: Arson?", "id": 93, "volume": 1, "url": "http://boxnovel.org/doomed-to-be-cannon-fodder-chapter-93-arson", "volume_title": "Volume 1", "body": "<h1>Chapter 93: Arson?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 93: Arson? </p><br/><p>After Bai Xiangxiu pushed Xiao Shi out of the room, she used the wet clothing to cover up her own nose because she was starting to cough a little. The fire had become too strong, and had already begun to hurt her throat. She started to feel a burning sensation whenever she breathed. Looking around, she saw that the fire had already made its way up to the ceiling. Turning, she shouted at the other maidservant. “What are you still standing there for?! Get out of here quic…“</p><br/><p>Before she could even finish her sentence, a clothing rack above the maidservant collapsed. A pile of flaming clothes suddenly landed on top of the maidservant, knocking her to the ground. </p><br/><p>Bai Xiangxiu was aghast. For a moment, she hesitated. Should she go save her? If Bai Xiangxiu tried to save her, she might get trapped in here without a way out. However, a wail of pain decided her mind for her. Bai Xiangxiu gritted her teeth, and rushed in. </p><br/><p>She used her feet to kick the pile of burning clothes away, and covered the maidservant with wet clothing, dragging her to the window. Her hand was burned sometime in that entire process, but how could she spare the time to think of those kind of things then? </p><br/><p>“Get out…” After hoarsely coughing out those words, she covered her body with the wet clothes. One after the other, they leaped out of the window. Just as her front leg cleared the window, the clothing racks behind her gave one last groan and collapsed completely. She’d gotten out just in the nick of time. Panting, Bai Xiangxiu just lay there on the ground. The fresh air tasted wonderful after all that smoke. </p><br/><p>Her body was in extreme pain. She didn’t know whether it was because the jump she’d just taken from the window or the injuries from the fire. At that moment, she could make out sounds of Xiao Shi calling out to her. She cracked her eyes open, catching sight of Xiao Shi. She sighed in relief; Xiao Shi had made it out unharmed.</p><br/><p>But it seemed that spurt of relief was the last her body could take, and she fainted right after. After what seemed like an endless daze, it was like she’d returned to modern times. While she was busy looking at her phone, she suddenly heard someone call out her name, “Yangyang, don’t fall asleep here! The weather is cold today!”</p><br/><p>“Alright, Captain Lee.” She casually replied. Her head was felt a little dizzy and she was confused as to her whereabouts. That’s weird, there seems to be another person calling out to me. Who could it be?</p><br/><p>“Madame Xiu. Mistress. I beg you, please wake up!”</p><br/><p>Crying sounds. How familiar. Who could it be? </p><br/><p>Oh, I remember now. It’s her. It’s Xiao Shi. </p><br/><p>Her eyes slowly pulled open to find Xiao Shi kneeling by her bed, crying. </p><br/><p>“Why are you crying…” Why was her voice so shockingly hoarse? Bai Xiangxiu creased her brows. The incident from earlier began to resurface in her mind. She seemed to have done something astonishingly courageous like saving someone, but also managed to injure herself by jumping out of a window. She’d even burned her hands. It’s not a serious wound right? She lifted her hands up slowly and noticed that they’d been bandaged into a pyramid-shaped dumplings. 1</p><br/><p>Her imagination immediately turned to the darkest depths of horror. Tears began to well up in her eyes as she spoke in a voice nearing a sob, “Is my hand ruined? And my face…”</p><br/><p>A fine beauty like her, what kind of justice would it be if all of it was ruined! </p><br/><p>Xiao Shi was quick to reassure her, “Not ruined, not ruined. The doctor merely went slightly overboard when he bandaged you up. Your hands are fine, and so is your face.”</p><br/><p>However, Xiao Shi felt really pained when she looked at the state her mistress was in. If it wasn’t for her mistress, she would’ve definitely burned to death in that bedding and clothing storage. Luckily, her mistress was fine. Otherwise, she would really have to apologize for her wrongdoings with her own death. </p><br/><p>After Bai Xiangxiu noticed that Xiao Shi had cried herself into a mess, she extended her dumpling-like hands to console her for a bit. Then, she asked, “What about the other maidservant? Is she doing well?”</p><br/><p>“Her injuries were slightly more severe, but the doctor said that she would make a good recovery. The only evidence left would be a scar on her forehead, but it shouldn’t be too much of a problem.” That maidservant was now practically treating her own mistress like a god. As soon as her wounds were bandaged, she had come to kneel and kowtow outside of Madame Xiu’s residence. After that, she had come by every day just to give her mistress a kowtow before running off.</p><br/><p>“Oh I see. How long was I out for?” Why does my body feel so weak? It’s like all my bones have shattered.</p><br/><p>“You’ve been out for two days. You even ran such a high fever. You nearly frightened me to death.” Xiao Shi was nearly bawling as she explained. </p><br/><p>“Silly child. I’ll be fine.” In Bai Xiangxiu’s eyes, Xiao Shi was really just a child. </p><br/><p>As for Xiao Shi, she had already gotten used to her mistress’s grownup act, so she didn’t take it to heart. She only wiped her face and turned to the door, “Sister Bao Qin, Madame Xiu is already awake. Shouldn’t we feed her some porridge first?”</p><br/><p>“Yes. Please, madame, wait for a moment.” Bao Qin answered from outside the room. Sounds of footsteps then rang out. She must’ve gone to get some porridge.</p><br/><p>However, despite the momentary lack of attention, as soon as Bai Xiangxiu tried to get up from bed, Xiao Shi immediately but gently restrained her, “Madame Xiu, you should not be getting up recklessly…”</p><br/><p>“But I wanted to use the lavatory.” Bai Xiangxiu took a lot of effort to finally prop herself up on one elbow. But it was all for naught when Xiao Shi carefully lowered her back down again. She couldn’t help but feel speechless at this protectiveness.</p><br/><p>“Ah, but you can move a little right? Why not just let Xiao Shi bring you a bedpan?</p><br/><p>“There’s no need.” That would be too embarrassing. Bai Xiangxiu propped herself up and walked into the neighboring room with help from Xiao Shi. However, she almost tripped when she looked into a mirror that she passed by.</p><br/><p>Why is there a mummy in the mirror? What has the doctor done to me? She didn’t remember being injured in that many places. What the hell had happened that had caused her to end up looking like this? Surely they didn’t bandage her up under her skirt as well, right? She felt depressed.</p><br/><p>“Madame Xiu, don’t be scared. Those wounds were… were bandaged by Xiao Shi. Because the female doctor wasn’t around, so…” Xiao Shi’s face turned red. Bai Xiangxiu instantly understood that the reason she looked like this was because she’d been taken care of by a layman. She was no longer worried that she had been burned into a roast pig or some other weird stuff. After obtaining some relief from nature’s call, she realized that while her entire body was actually in pain, it was still somewhat manageable.</p><br/><p>A moment later, the doctor brought a lady doctor back in to check on her wounds. The lady doctor told her that there should be no future consequences if Bai Xiangxiu changed her dressings regularly. Even her most serious injury should just leave a shallow whitish scar. There was no need to worry.</p><br/><p>Bai Xiangxiu had never been worried at all. She hadn’t planned on using her face or her body to seduce any man. It would be fine even if there was some blemishes here and there.</p><br/><p>The most pressing issue now was that all the cotton clothing had been burned, which really made her depressed. To make that clothing again would take at least another half a month. By that time, the weather would probably take a turn for the worse. Even If she were to let the servants make the clothing themselves, she would at the very least need some raw materials for that to happen!</p><br/><p>“Go summon the chief steward.” She felt like her voice had been transformed into a broken zither. It was extremely uncomfortable to listen to. </p><br/><p>“Madame Xiu, you should eat something before…” Bao Qin carried the porridge into the room. Although Bai Xiangxiu felt weak, she didn’t want to eat anything because her throat was in pain.</p><br/><p>“Madame Xiu, you have to eat at least something. How can your body take it otherwise?” Xiao Shi was perilously close to tears.</p><br/><p>With no choice in front of those teary eyes, Bai Xiangxiu gulped down two mouthfuls of porridge. When she swallowed, her throat felt like it was on fire. It hurt so much that her tears almost flowed down her cheeks. Huo’er felt pained for its master as well. “Huo’er hurts when mistress hurts as well.”</p><br/><p>Bai Xiangxiu hadn’t expected that there would come a day where she would be comforted by a cactus. She couldn’t help but start to laugh. Chief steward Long Shuting walked in just as she was laughing. Although they were separated by a screen, he could see that she was currently having her meal.</p><br/><p>Contrary to the madame’s apparent happiness, panic was quickly rising in his heart. She’d been just fine a while ago, but was now reduced to this state. When the prince returned, there would be no end to the amount of punishment he’d undergo! Most importantly, this mistress had been stunning. In such a dire situation, she’d actually managed to save both maidservants. Although, if she’d been burned to death, his punishment would’ve escalated to inhuman levels.</p><br/><p>He also hadn’t expected that he would be summoned immediately after she’d woken up. If he was guessing correctly, she must’ve summoned him to discuss the issue regarding the cotton clothing. But what he was even more mindful of was another issue. Because he had already visited the site of the fire, he was a hundred percent sure that this fire… was no accidental fire! It was arson!</p><br/><p>1. https://www.melmel.com.au/wp-content/uploads/2016/11/zongzi.jpg</p><br/>\n</div>"}