{"title": "Chapter 103: Searching for the Assailant", "id": 103, "volume": 2, "url": "http://boxnovel.org/doomed-to-be-cannon-fodder-chapter-103-searching-for-the-assailant", "volume_title": "Volume 2", "body": "<h1>Chapter 103: Searching for the Assailant</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 103: Searching for the Assailant</p><br/><p>Bai Xiangxiu finally took note of her own hand at this moment. Even though it was mostly healed, the dark layer of calluses had yet to peel off and the surrounding skin was blackening. Her forehead was in a similar situation, so she used her bangs to cover it and cloth to encircle it.</p><br/><p>She was sure that the moment the covering was removed, any male who saw it would lose their appetite. She contemplated whether to explain the reason behind getting burned, but she was afraid that after speaking of it, the male lead would misunderstand.</p><br/><p>Someone already wanted to kill her for revenge after only being in charge of the household for a couple days. In order to give her boss a good impression of her, she could only shake her head and stay in silence. In any case, he would still know the truth sooner or later. There was just a difference in the timing that he would learn it. As for what other people thought of it, she didn’t care.</p><br/><p>“This is a wound caused by fire. Furthermore, it has already been a couple of days since you’ve gotten this wound. Why haven’t your letters mentioned it? How did you end up in this state?” Long Heng was palpitating, but seeing that she didn’t want to talk about it, he recognized that the situation must be extremely serious. He yelled to Shu’er, “What are you looking at? Get Long Shuting over here!”</p><br/><p>Shu’er hastily ran outside. His master’s expression was too scary-scary enough that he tripped and fell when exiting. The steward is normally quite smart. How come a perfectly fine person was wounded in just a few days? Isn’t this just courting bad luck?</p><br/><p>Long Shuting naturally knew that the prince would summon him over sooner or later when he returned home. And so he took a sip of tea and stood up in one smooth motion, running towards Long Heng’s study afterwards.</p><br/><p>It seemed that the prince actually treated the fourth madame quite well. He was immediately asking after this matter after his return, and he wasn’t even asking about the third madame. As for why the prince had been able to guess that it was about the fire, simple deduction had made it clear.</p><br/><p>If the prince was bothering himself with the third madame’s affairs, he would ask the mamas who worked in the manor or the guards that handled that matter. By the time he questioned the steward, it would at least be a couple hours later. It was a pity that the prince had summoned the steward before he’d returned for even two hours. He evidently was extremely angry about the fire.</p><br/><p>Actually, the steward was also disconsolate since he still hadn’t discovered any clues in the past few days. It was still an unknown how he was to respond when the prince asked about it. When he arrived, the table had already been put away. The irritable Prince Li paced back and forth with his hands clasped behind his back.</p><br/><p>His hair was loose and not neatly upset. It seemed that the prince had wanted to rest, but hadn’t anticipated that the such a large matter would occur in the royal residence. That exceedingly clever Madame Xiu was now sitting obediently to the side, her head lowered as she played with the hair in front of her chest as though she was feeling greatly wronged.</p><br/><p>At first glance, the two gave the impression that nèe Bai was the wife being oppressed, while Prince Li was the one oppressing her. However, she didn’t have any wounds on her body and her clothes were very orderly. It appeared that no matter how angry Prince Li was, the situation of domestic violence wouldn’t occur.</p><br/><p>Except, why did Long Shuting have the feeling that Prince Li was the one being maltreated? He couldn’t continue standing after seeing his master. He flourished his sleeves and knelt down, “Long Shuting greets His Highness.”</p><br/><p>“Rise. What is the cause of these wounds? Tell this prince the happenings with detail.”</p><br/><p>Long Heng was actually quite depressed. Bai Xiangxiu hadn’t responded when he asked her the first time. She turned her head to the side the second time and said quietly, “Won’t you know when the general manager comes?”</p><br/><p>As for the third time…</p><br/><p>He didn’t dare ask the third time since he feared she would become frightened. In reality, no matter how he looked at supporting female character Bai Xiangxiu, she appeared like a white lotus. Add that to the fact that her appearance was innately delicate and touching, and that her eyes would involuntarily redden like a little rabbit’s when she grew distressed, all of this really made her quite lovable.</p><br/><p>Long Heng was unable to continue asking her even if he had a heart made of iron. He could only wait until people who could talk about it arrived, which happened to be the unlucky Long Shuting.</p><br/><p>Long Shuting looked at the girl. She actually hadn’t lodged a complaint and asked the prince for protection! What an odd girl. Shouldn’t she be laying in his embrace at this time asking for attention? Without no other option available to him, he could only explain the entire sequence of events related to the fire.</p><br/><p>Long Heng calmly listened to the end. When he heard that Bai Xiangxiu had saved two servant girls at a critical moment, which in turn caused herself to have such heavy wounds to be inflicted onto her, he took a deep look at that seemingly immensely weak girl. She really was exceedingly kind. This was a colossal weakness for a person.</p><br/><p>But that was fine. He could fill in that weakness. Long Heng slowly unleashed the light of bloodthirst in his character. Long Shuting froze with shock. It looked as though the prince truly despised the person who’d harmed the fourth madame. And so, he narrated the results of his investigation and then knelt with one knee on the ground, “It was my fault that I was unable to protect the madame. Please punish me.”</p><br/><p>“If the matter was deliberate and planned out, it is not your fault. As for Madame Bai…” He turned his head, but the other party had lowered her head and playing with her hair as though she didn’t hear him talk to her.</p><br/><p>“Madame Bai.” How had she become distracted with such a serious problem like this? She had been heavily wounded for this matter and it was rumored that she had been in a coma for a couple days. Had she been so terrified that she was becoming more and more absentminded?</p><br/><p>Actually, Bai Xiangxiu wasn’t inattentive. Rather she was quite unfamiliar with the two words of “Madame Bai”. Prince Li rarely talked to her. Even if he did, he seldom used names but instead frequently just said ‘you’. Now that he suddenly called her ‘Madame Bai,’ how was she supposed to have reacted?</p><br/><p>Even though she’d raised her head because another person was talking loudly, she still had a blank expression on her face. Seeing her ashen and vacant little face, Long Heng decisively believed that she must have been scared silly. She was someone who couldn’t be scared, after all! He originally wanted to ask her who exactly she offended, but he didn’t have the heart to ask further after seeing her appearance. “Go back and rest. Rest well and heal your wounds.”</p><br/><p>He had wanted her to stay, but how could he bear to do so after seeing the extent of her fear? That kind of affair was the male oppressing the woman to begin with. Secondly, he needed to find out who the assailant was and not permit such a terrifying person to stay in the manor any longer. The culprit had wanted to harm her to boot. They would not be allowed to retain their lives. Not only would they not be able to live on, he would bestow them an arduous death.</p><br/><p>Long Shuting related to Long Heng those who had the highest chance of being the culprit. Long Heng’s method was not to investigate the matter, but instead to use mass torture anyone suspicious for information. However, Bai Xiangxiu was not to know about this matter.</p><br/><p>Therefore, while she hid in Winter Garden and slept heavily, the first and second madames were unceremoniously sent over to Long Heng for a personally interrogation. He already knew about the matter concerning the third madame, but he was of no mind to think further on it. He only wanted to figure out who had wounded Bai Xiangxiu.</p><br/><p>It was out of his wildest expectations that the two women who had the most motive to harm here were completely blameless. In the end, he started with those who’d worked in the bedding and clothing storage. Long Heng didn’t rest and interrogate each and every one of them. He had been trained in the army and believed that there weren’t many who could lie flawlessly in front of him.</p><br/><p>It was already late at night, but he didn’t give up searching. In fact, he was mulling that if he was unable to find out who exactly it was, he would just throw out all suspicious personnel from the estate so that she would at least be a little safer.</p><br/>\n</div>"}