{"title": "Chapter 104: Volunteering to be a Bedwarmer", "id": 104, "volume": 2, "url": "http://boxnovel.org/doomed-to-be-cannon-fodder-chapter-104-volunteering-to-be-a-bedwarmer", "volume_title": "Volume 2", "body": "<h1>Chapter 104: Volunteering to be a Bedwarmer</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 104: Volunteering to be a Bedwarmer</p><br/><p>The night sky grew unknowingly darker and darker.</p><br/><p>Long Heng wasn’t showing an ounce of fury because he was incensed beyond measure. He was a man who had been through the battlefield, baptized through blood and fire. Although he was a little unfamiliar with sentimental feelings, he also felt a bit of anticipation thrill through his veins. These feelings were both strange and removed to someone who’d trudged through rivers of blood. At the same time, he felt that these feelings had indeed been hard to obtain. It finally seemed like he had everything now, but someone was skulking around to sabotage it.</p><br/><p>How could Long Heng keep his calm? He burned to leap into action, to haul out the person responsible and torture him to death. At that moment, a delicate and graceful woman walked into his residence. She had an alluring figure and a delicate, charming appearance. Her temperament reminded him of a certain someone at first blush, the quiet fourth madame, nèe Bai.</p><br/><p>Their demeanor were extremely similar to each other, so his expression slowly began to relax.</p><br/><p>He sat there watching as she walked in, and realized that he did in fact know who she was. This person was Sun Hong’er, his personal maidservant before he’d entered the army.</p><br/><p>She dipped in greeting, her eyes tenderly looking at him while her body slipped into an alluring posture. The distance between the two had subtly narrowed. After detecting the fragrance on her body, Long Heng subconsciously felt his stomach tighten. His forehead couldn’t help but crease. It seemed that this fragrance could cause men to weaken their control over their desires, but it wasn’t enough to make him go crazy over her. So he didn’t immediately reprimand her, but began to think of her with a bit contempt.</p><br/><p>Why would a proper lady carry such an impure fragrance on their body? She was clearly trying to seduce men. He had experienced numerous similar occurrences on the battlefield, so he was particularly repelled by such actions. But she possessed a good attitude so, he reached out his hand and said, “You may rise!”</p><br/><p>Eyes moist with tears, Sun Hong’er immediately apologized for her mistakes as soon as she rose to her feet. “It was all this servant’s fault. If this servant hadn’t asked the fourth madame to head over to the clothing storage when I realized there was a problem with the cotton, Fourth Madame wouldn’t have innocently received such serious injuries.”</p><br/><p>“Stop crying. Just tell me what happened from the beginning to the end.” Sun Hong’er only began to talk about the incident after Long Heng had waved his hand with extreme impatience. What she said was likely the truth; Long Heng didn’t note any flaws in her story. However, why is she always looking down? Even if she was trying to show modesty and decorum in front of a man, she had already applied such an unscrupulous fragrance on her body. Did she really have to put on such an act afterwards? He couldn’t stand smelling that fragrance anymore because it would only remind him of nèe Bai. It made him want to think of ways to pin her down and have his way with her. Every time he had such thoughts, it seemed like every single violent cell in his body grew excited, making his blood thrum and setting his heart on fire. </p><br/><p>This wouldn’t do. That version of him was too violent. He had to restrain himself, or wouldn’t that paper-like girl be violently tortured to death? His heart would bleed for her even if she was only pricked by a needle, never mind death. Distracted by his thoughts, he absentmindedly waved his hand, “Leave for now. I wish to rest.”</p><br/><p>But he didn’t expect that she would actually be so bold as to launch herself straight at him. Her original intention was to hug Prince Li’s waist, because a man’s waist wasn’t a place to be randomly touched. How would matters not take a sudden steamy turn with this hug? But she hadn’t counted on Prince Li’s martial artist background; there was no way he would drop his guard for a moment. He wouldn’t even let a pet that he didn’t trust easily touch him, let alone a woman.</p><br/><p>And so, a strange pose was born.</p><br/><p>Prince Li was defying common sense and had his palm firmly holding the woman’s head at bay. As for her, she was vainly stretching both her hands out, waiting to be hugged. Unfortunately, Prince Li had longer arms than she did, so he used his hands to block her advances. In the end, she didn’t even manage to grab onto a single finger of his. Prince Li twitched his eyebrows a little and sidestepped.</p><br/><p>Bam! Sun Hong’er crashed onto the floor with a thud.</p><br/><p>This development is unexpected. It seems that the prince has become a lot more ruthless compared to before he left. Although he wasn’t any easier to get closer to before, he would never have treated a beautiful young lady like this.</p><br/><p>But now…</p><br/><p>The girl fell face first onto the floor, stunning herself with the impact. Amidst her daze, she was almost certain that her nose had been shattered. When she clambered to her feet, she found blood all over the floor, and so quickly pinched her nose shut with both hands. Initially, she’d planned on spending the night with the prince while Madame Xiu was still too injured to tend to his needs. Yet, how could she have guessed that she would end up on the ground, face battered and bruised instead?</p><br/><p>She felt abnormally aggrieved and wanted to turn to leave so that the prince wouldn’t see her current ugly state. Unexpectedly,the moment she stood up to turn, a voice languidly came from behind her, “Hong’er, were you here to volunteer to be my bedwarmer?”</p><br/><p>Sun Hong’er almost couldn’t believe her ears as she clutched her bleeding nose with her hands. Since when had Prince Li become so enlightened? Except, was something wrong with this man who wouldn’t eat the meat that had been dangling in front of him? She’d been so proactive already. But since he’s suddenly asked such a question, could it be that it’s finally dawned on him to?</p><br/><p>Sun Hong’er became extremely excited. She quickly used her sleeves to forcefully wipe off her nosebleed and said with a voice aching with temptation, “Your Highness…”</p><br/><p>She said the words ‘Your Highness’ with such a coquettish lilt that Long Heng couldn’t help but feel goosebumps pop out all over his body.</p><br/><p>He was so disgusted that whatever impulsive thoughts he’d previously had due to her fragrance scattered into the wind. From a certain point of view, this woman was actually quite competent for being able to do such a thing.</p><br/><p>“Are you willing to do anything for this prince?” Long Heng suddenly thought of a possibility and asked a probing question.</p><br/><p>Unexpectedly, her body actually froze for a second, and then continued with a fanciful vibrato in her voice, “Of course. This servant will do whatever Your Highness wishes this servant to do.</p><br/><p>“Is that so? Then clean up the blood on the floor and get the hell out.” After speaking, Long Heng brandished his sleeves and left. His thoughts didn’t linger the least bit on her at all.</p><br/><p>But after returning to his room, he immediately ordered someone to investigate her affairs. She had seemed like just another widow, but she shouldn’t have been that daring. Although her reaction just now had indeed been suspicious, it had also saved her life as well. If he hadn’t thought that there was more to the story, she would probably have been taken away to be beaten to death by staves by now. If she truly was the mastermind behind that incident, then something simple as death wouldn’t be lying in wait for her.</p><br/><p>Long Heng was only able to sleep for about roughly four hours that night before his man returned. He knelt in front of Long Heng and relayed everything from start to finish. Veins began to throb in Long Heng’s forehead. He commanded, “Lock that person up immediately! I want to personally interrogate her!”</p><br/><p>But his man returned shortly, not long after he’d just left. “That person has already escaped. I’ve sent some men to chase after her.”</p><br/><p>“She’s unexpectedly quick-witted. But I believe that a little girl like her would never be able to escape from all of you, right? What use would I have to keeping all of you on then?”</p><br/><p>That person gave him a quick kowtow and left immediately. They had to catch that girl. Or else, how would they continue working here in the future if they lost face in front of the master? And so, Sun Hong’er was successfully recaptured within the hour. Her nose was still collapsed, making her entire face seem deformed.</p><br/><p>What delicate and charming appearance? What sweet and coquettish looks? At this moment, she was totally the opposite of those things. It would be a compliment to say that she looked like a ghost.</p><br/><p>The corner of Long Heng’s mouth twitched. “Speak. I might give you a chance to live if you confess everything.”</p><br/><p>“Your Highness, this servant has no idea what Your Highness is implying.” Sun Hong’er wasn’t dumb. There was no way that she would confess.</p><br/>\n</div>"}