{"title": "Chapter 138: This Awkward Poison (1)", "id": 138, "volume": 2, "url": "http://boxnovel.org/doomed-to-be-cannon-fodder-chapter-138-this-awkward-poison-1", "volume_title": "Volume 2", "body": "<h1>Chapter 138: This Awkward Poison (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 138: This Awkward Poison (1)</p><br/><p>Long Hong wasn’t the sort who liked to bring matters from the outside into the rear court. This had been his habit of many years, and he didn’t want to bother the girl in front of her with this when she’d just returned. She was lying there, limp, her face drained of color. He really didn’t know how to comfort her.</p><br/><p>And why did she smell so good after being away for such a short period of time? Moreover, it was different from her usual fragrance. He couldn’t put a name to it, but it was quite tantalizing. He couldn’t help but want to draw closer to her even if others were present.</p><br/><p>Bai Xiangxiu could feel him drawing closer and closer, and it was quickly inching towards a dangerous kind of distance. Given that she was prone on the bed, she had no place to run to, but her expression became a bit awkward. She was already this in this state, what was he drawing so close for?</p><br/><p>Ah right! The Three Days of Inebriation was still in her! Should she mention it to him? But judging from his expression, he’d want to cure her of the poison as soon as she mentioned it to him! He’d also do so in the most direct way possible, but would he really be able to eat her when she was in this state? “Your Highness, my face…”</p><br/><p>It was in this frightening state already.</p><br/><p>Long Heng frowned, inwardly blaming her for disrupting the mood. But what woman didn’t care about her face? Therefore, he misunderstood her words to be the ones from a woman who cared deeply about her looks. “It’s only a face, why do you care so much about it? I’ll find someone to take a look at it for you.”</p><br/><p>He left in a bit of an irritable mood, tugging his collar open a tad as he stood out in the wind, finally calming down. However, before he had a chance to do anything else, he received a report that Duan Yunying had come back was currently receiving treatment for heavy injuries. Because someone had told him about Duan Yunying beforehand, Long Heng frowned at hearing this. That man wasn’t a simple character, and it was likely they’d have to do a thorough investigation. As for that woman with him…</p><br/><p>Just as Long Heng was pondering about that woman, she appeared in front of him, dropping to her knees in front of him with an audible thunk. “Your Highness, please save my cousin! He’s… he’s heavily injured. It will be difficult for him to survive.”</p><br/><p>“Lift your head to talk.” Long Heng’s voice was cold, but there was no killing intent within it. Those who practiced martial arts often cared a great deal about the intentions they sensed in someone’s tone. So, Yaya’s confidence soared as she sensed that lack of ill intent, raising her head abruptly. Yet, a cold hand gripped her chin, nearly hauling her upright. The slightly blue eyes blinked back at him, full of a watery mist that invited pity from others.</p><br/><p>Long Heng however, laughed coldly before flinging her to the ground. “This prince is not a doctor.”</p><br/><p>“But Your Highness…”</p><br/><p>“Dismissed.”</p><br/><p>Yaya wasn’t willing to accept this. In her view, there was no one in this world who didn’t cheat. Even if the male lead had been strictly loyal to Lin Qianzi in his past life, there still had been rumors that he’d slept with some other woman. Since this was the case, why couldn’t he accept her? If he did, then she could leave that man and never have to see him again.</p><br/><p>Or, she could use the male lead to kill that man, that perverted master from her past life. She hated her master in this life. She had since the moment she’d died in her past. However, she’d still come to his side in this life after being reborn, for revenge. And so she’d chosen Long Heng. Only this man could hack through all the brambles. If he met a god, he could slay a god. If he met a demon, he could slaughter them. He was truly a rare hegemon.</p><br/><p>Her master had ultimately lost to the prince as well, or rather, it was more accurate to say he’d never won. That was why she thought so highly of him. In terms of emotions, she was only a little bit envious of Lin Qianzi, since every woman wished for a man like this. But, she hadn’t thought that another woman apart from her would be able to capture his attention. That wasn’t right! Why was it that both in this life and the past, he’d never deigned to notice her!</p><br/><p>Since he liked weak woman, then she’d be weak. So she burst into tears as she “accidentally” fell on the ground as she walked, twisting her ankle. “Aiya… it hurts! Your Highness, it hurts… ah!”</p><br/><p>Long Heng only felt the corners of his lips start to twitch uncontrollably. She was indeed beautiful, but only when she was spritely and full of life. That passionate woman was now lying on the ground, sobbing gently. No matter how one looked at the scene, something was definitely odd. It was as if an exquisite painting had been hung in the latrines, which instantly devalued it. He didn’t want to look at her any longer and wanted to leave, but that beauty was still lying on the ground, howling with pain. “Your Highness, Your Highness, it hurts!”</p><br/><p>“Servants, drag her away.” He hadn’t done anything to her, so who was she putting on an act for? His woman was still lying on the bed in pain, and he was already in a rush to have someone fetch the imperial doctor from the capital. What time did he have to waste with her? Although he wouldn’t do anything to her now, she would receive her just desserts sooner or later.</p><br/><p>A servant rushed over and she raised a weak hand to let them help her, leaning on them as she walked off, complaining loudly all the while. He couldn’t even bothered to spare a glance at her as he went off in search of the imperial doctor. The other man was the one that needed an eye kept on him, but the important one was the woman. He felt that sending her away was the right thing to do. Didn’t they care for each other? It would be wrong to not help them along.</p><br/><p>And this was how he ended up alone with his fiancé for the first time. Her face looked so pale, and turned visibly nervous upon seeing him. But, this was likely because he knew about her dirty deeds.</p><br/><p>“There’s no place for you here,” Long Heng spoke faintly, seemingly talking to someone of no consequence at all.</p><br/><p>“I… I’m sorry, he made me. When I was sick, I… I…” Lin Qianzi struggled up to a crooked seated position on the chair as she cried. “If you think it inappropriate, then ask the emperor to dissolve our betrothal!”</p><br/><p>“Haha… dissolve the betrothal? Miss Lin likes to jest. But if you don’t mind, I can certainly consider that.”</p><br/><p>His cold tone made Lin Qianzi shudder all over as she seemed to understand something. He would need a reason to make his explanations to the emperor and dowager empress. Otherwise, it would be a violation of the imperial order. The real reason would destroy her, if everyone were to come know her as a woman who’d lost her chastity.</p><br/><p>“No… no! Your Highness, it’s all my fault. I can die, but I can’t let the Lin family be denounced along with me. Please don’t tell others about this, or I’ll kill myself in front of you!” Lin Qianzi was equally stubborn. She might actually ram herself against a wall if he didn’t agree. However, the prince’s cold response sent chills down her spine, freezing her to her seat.</p><br/><p>“Oh? Suicide? That will indeed be difficult to explain! But that’s no problem. I’ll just tell Minister Lin that his daughter committed suicide in a mix of rage and sadness after she was raped. In order to avenge you, I will personally kill that thief and bring his head to your grave. What do you think, Miss Lin?”</p><br/><p>It was the first time that Lin Qianzi had seen Long Heng smile, but that smile pierced deep into her heart. So much so, that she completely forgot everything she wanted to say.</p><br/>\n</div>"}