{"title": "Chapter 134: Why Is It You Again?", "id": 134, "volume": 2, "url": "http://boxnovel.org/doomed-to-be-cannon-fodder-chapter-134-why-is-it-you-again", "volume_title": "Volume 2", "body": "<h1>Chapter 134: Why Is It You Again?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 134: Why Is It You Again?</p><br/><p>Although the novel mentioned some of his redeeming features, it couldn’t hide the fact that he was actually a complete piece of trash. Bai Xiangxiu didn’t have a good impression of him. More accurately, she didn’t have any good impressions of any of the male supporting characters other than Song Jiaoyue. However, now was not the time to brood over something like this. If she really was poisoned with Three Days of Inebriation then she must find a way to cure it. Or else… </p><br/><p>But the female lead was cured by the male lead himself! What should I use for the cure?! She wanted to cry but lacked the tears to. However, she couldn’t let Luo Yunzheng or Duan Yunying succeed no matter what. It was just that she was imprisoned inside the wooden cottage at the moment, and it just wasn’t possible for her to break the locks by herself.</p><br/><p>Bai Xiangxiu rummaged through the house again. This time, she found a firestarter used to light the oil lanterns. A plan soon formed in her mind. She first noted the wind conditions outside. It isn’t too windy outside now, so it won’t help spread the fire. Then, she quickly ran to the lavatory to dip her handkerchief in water. It could be used to cover her mouth and nose.</p><br/><p>Once her preparations were complete, she smashed the oil lantern onto the cottage door. She then used the firestarter to set the door on fire. She went into the neighboring room to take shelter as the fire caught and flared up stronger. The fire quickly burned a hole into the door. I guess now is the time. She lifted a square table up and threw it at the door. She actually managed to smash the door open with a loud bang!</p><br/><p>Bai Xiangxiu was elated. Due to her previous experience of jumping through a flaming window, she didn’t hesitate at all. After all, the flames wouldn’t hurt her if she could jump through them fast enough. So, she lifted her skirts and broke into a sprint. She didn’t stop to rest either after she broke her way out of the wooden cottage. Instead, she continued to sprint towards the direction of Red Maple Mountain Villa. That place was now her only salvation. If she couldn’t make her way back, then she could forever give up on going back. </p><br/><p>No. Will it be impossible for me to return to modern times if I don’t return? Thus, Bai Xiangxiu decided that she would have to return to the Villa no matter what hardships she had to face. Bai Xiangxiu kept encouraging herself as she ran. However, the skies soon darkened, making the roads harder to navigate. She didn’t have a choice but to find a place to hide.</p><br/><p>She remembered that a place called Drifting Leaves Tavern was just up ahead. It was a tavern specially designed for officials and noblemen to rest and share poems when they came to admire the scenery. The Red Maple Mountain Villa isn’t much further once I pass by that place. Bai Xiangxiu consoled herself while she rested. Unfortunately for her, the skies suddenly started to snow just when she had found that little bit of solace.</p><br/><p>Darn it! Misfortunes really never come singly! Isn’t this like a torrential rain occurring just when the roof is still leaking? She wanted to laugh ruefully, but her throat was feeling hoarse. If her guess was right, she must’ve gotten a cold after all the punishment she’d been through in the past few days. </p><br/><p>She was like the very epitome of bad luck at the moment. If she drank a cup of water now, she’d probably choke to death.</p><br/><p>Snow suddenly stopped falling on her because there was now an umbrella over her head. A gentle voice rang out as if heavenly tones from the night sky. “You can have the umbrella. Have some food and silver as well.”</p><br/><p>A bunch of things suddenly appeared in front of her magically. Bai Xiangxiu was stunned senseless for a moment. “Wait just a moment…”</p><br/><p>She wanted to tug on the lower hem of Song Jiaoyue’s coat, but he was in too much of a hurry and didn’t turn back to look at her. He only replied, “I’m in a hurry right now. Please excuse me.”</p><br/><p>He didn’t recognize me? Well, I can’t say that I blame him. Who the heck would recognize me when I look like this? His martial arts are also way too profound. He was gone within seconds! He didn’t even give me enough time to stop him…</p><br/><p>But something’s off. Where is he going in the middle of the night while the blizzard is still raging? The direction he’s running to… maybe he’s heading to the mountain villa? Her original plan had been to get rest before continuing her journey. However, since Song Jiaoyue had left her some dried rations, she decided to eat while walking onwards. Since she was sick, she wasn’t sure if she would be still be able to walk if she rested until tomorrow morning.</p><br/><p>On the bright side, the biscuits from the Song residence were extremely tasty. They were sweet and fragrant. He had been stingy with his money either and had given her around ten taels of silver. The construction of the umbrella was really sturdy too. Unfortunately, he was just much too quick with his feet and didn’t give her enough time to speak with him.</p><br/><p>Bai Xiangxiu was motivated to continue walking forward after such a miraculous encounter with Song Jiaoyue. If by chance she managed to catch up to him, she could then tell him her true identity! Then, she’d at least get a safe trip back to the male lead’s side! Even though it would ruin Song Jiaoyue’s impression of her, it’d be fine. After all, she’d already been rejected by him. Since she’d helped the Song residence before, he’d probably still treat her as a friend.</p><br/><p>Being treated as a friend was fine too. At least she could still ask him for help when she needed him.</p><br/><p>With that decided, she picked up her pace and continued moving forwards. Although her decision to continue moving sounded simple, it couldn’t be further from the truth. She didn’t know any martial arts, so it took her a whole night of walking before she arrived at her destination.</p><br/><p>She was thoroughly exhausted and was on the verge of collapse. That must be the Drifting Leaves Tavern. I’d better go in to rest for a bit. That way, I can clean myself up before I return to Long Heng’s side. She didn’t think that Long Heng would be able to recognize her due to her current looks. It’d be a surprise if he wasn’t disgusted by her instead. It was alright if she didn’t look good in front of other men. However, the male lead was providing her with food and shelter. She couldn’t show him her ugly side.</p><br/><p>When she finally arrived at the tavern, she found out that they weren’t open for business yet because she’d arrived too early in the morning. However, a worker there suddenly came out from the back entrance. He seemed to be heading to the market.</p><br/><p>She walked in through the back entrance after the person had left. She needed somewhere warm to rest and quench her thirst. She had money in her bag anyway, so she wasn’t too worried. </p><br/><p>The kitchen was right behind the back entrance. When she squeezed her way in through the door, she noticed that a fire had already been started in the stove. She quickly ran to the stove to bake in the warmth, finding instant relief. There was hot water in a pot as well. Without a care whether the water was boiling or not, she immediately filled a bowl up and gulped the water down down. Satiated, she let out a sigh of relief. Suddenly, she heard a voice from outside say, “Has the water boiled yet? The guest wants to take a bath, so serve the hot water now. Remember. It’s the guest from sky suite number two.”</p><br/><p>Bai Xiangxiu was taken aback and just about to look for a place and hide. However, the man outside continued, “Look. Are you going to fetch the water or not? If not, I’ll come in and do it myself. Seriously. Pick up the pace!”</p><br/><p>“Cough cough. Understood.” Bai Xiangxiu masked her voice and then acted as if she was filling up the bucket with water.</p><br/><p>That’s weird. Why would a person take a bath so early in the morning? What a weird guest. She naturally wasn’t going to fetch the water for that guest, but she suddenly had thoughts of taking a bath as well. So, she filled the bucket up to the brim with hot water. However, where should she carry the water to so she can wash up? This would be a good place, but it’d be troublesome if somebody were to barge in while she was still taking her bath.</p><br/><p>How about a vacant room? Guests haven’t arrived yet since it’s still so early in the morning. Bai Xiangxiu lifted the bucket up and headed out of the kitchen while avoiding others like the plague. Luckily, there wasn’t too many people around because it was still dawn. As she walked, she was also taking note of the guest rooms. </p><br/><p>The olden times had their own processes in place. If a guest room was occupied, they would hang up a red plate outside of the room. If the room was empty, the plate would be green in color.</p><br/><p>Bai Xiangxiu finally found a room with a green plate hanging on the outside after some time. Just as she was about to enter the room with her bucket of water, she heard a voice from next door say, “Has the water finally arrived? You may come in!”</p><br/><p>Bai Xiangxiu immediately tensed up when she heard the voice. She could feel that trouble was brewing. Why has the story deviated so much from the plot? Why is the female lead here? If she’s here, then isn’t the male lead here as well? Where is he?</p><br/><p>He can’t possibly be in the female lead’s room right? But what other reason would explain her needing hot water so early in the morning? Bai Xiangxiu felt a little uncomfortable at the thought of this. However, she didn’t want the female lead to raise any suspicions, so she brought the bucket of water to the front of the door and knocked gently.</p><br/>\n</div>"}