{"title": "Chapter 149: Can You Hit Me So It Doesn’t Hurt?", "id": 149, "volume": 2, "url": "http://boxnovel.org/doomed-to-be-cannon-fodder-chapter-149-can-you-hit-me-so-it-doesn%E2%80%99t-hurt", "volume_title": "Volume 2", "body": "<h1>Chapter 149: Can You Hit Me So It Doesn’t Hurt?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 149: Can You Hit Me So It Doesn’t Hurt?</p><br/><p>When silence finally fell upon the room, their eyes suddenly met in mid-air. Both of them hastily averted their gazes as if they’d been burned, their hearts still beating furiously. To relieve the awkwardness, Bai Xiangxiu asked, “That…Sun-mama was the widower Sun. Just what happened here?”</p><br/><p>Actually, she’d guessed part of it, but had no way to verify anything.</p><br/><p>Long Heng didn’t hide anything from her, telling her how he’d found out that Sun Hong’er was the one to set the fire. He even explained her motive of wanting to replace Bai Xiangxiu as Long Heng’s new favorite.</p><br/><p>Wah, the hole in that woman’s head was a bit too big. How could one obtain such an imposing prince with just schemes? Wouldn’t all the women in his rear court go crazy then? But truthfully speaking, the women of the rear courts would only go mad when fighting over a man. They lived for men and because of men. Besides him, they had no other good prospects.</p><br/><p>Did she really want to stay in a place like this? Then all she could do was be the male lead’s concubine. Other women would enter the household even without the female lead. She might even be oppressed by the matron of the household forevermore. Reality wasn’t like a novel, and neither was she its female lead.</p><br/><p>Long Heng didn’t tell her how Sun Hong’er had died, only that her parents had found her body. They’d then started causing a ruckus at the Prince Li Manor without even asking about the reason.</p><br/><p>He was blatantly lying to her, but did he really think she wouldn’t understand a thing? Bai Xiangxiu was still undecided as to whether she should stay here, but she was definitely more familiar with him now that they’d had relations together.</p><br/><p>“Your Highness, could someone really find a corpse that you disposed of? Moreover, that Sun Hong’er was born of a servant of the household. How could her parents not understand that you punished her because of something she did wrong? Isn’t their behavior a little strange?” After analyzing the situation, she raised her head to look at Long Heng without hiding her curiosity.</p><br/><p>But Long Heng had always assumed she was a timid girl who was afraid of getting into trouble. He’d never expected her to be clever and quick-witted as well. No wonder the head steward had spoken well of her to him before. He was the one who had underestimated her. Since there was nothing to do at the moment, he took off his shoes and climbed into bed, sitting on the side to stare at her until Bai Xiangxiu thought she’d said something wrong. Perhaps men from ancient times didn’t like their women speaking of household matters?</p><br/><p>Unexpectedly, Long Heng suddenly raised his hand, his long, slender fingers happening to stop before her eyes.</p><br/><p>There was a pop…</p><br/><p>He flicked her forehead, leaving her pained and numbed, but the sensation wasn’t unbearable. But every women liked to act like a spoiled child once in a while, so she gave a delicate little cry as she rubbed her head and looked pitifully at Long Heng.</p><br/><p>Long Heng really thought that he’d used too much strength. He hastily pulled aside her hand for a look, only to see a slight redness beneath. So he gently blew on the spot a few times. “It is a bit strange.”</p><br/><p>Hm? No anger, no losing his temper. He didn’t even blame her, but was smiling slightly. Bai Xiangxiu couldn’t resist a small smile in return, her face flushing happily.</p><br/><p>Long Heng’s heart beat furiously at the sight, but right now the sun hadn’t even begun to set. He’d yet to eat his dinner, so he had to endure despite his sudden impatience.</p><br/><p>“Then could it be that someone wants to deal with you, Your Highness? So they used this incident to ruin your reputation?” That was how it had been written in the novel, though it hadn’t gone into details. The book only said how despite having power and wealth, Long Heng’s reputation was actually quite poor. Meanwhile, the emperor seemed fond of him, seemingly trusting him without question,, but was actually whittling away at Long Heng’s military power bit by bit.</p><br/><p>Still, the male lead was still a male lead. No matter how the emperor hurt him, he was just a supporting male. Thus, the emperor had to come up with multiple excuses to take military power back from Long Heng. The emperor couldn’t afford to offend the prince, so he was limited to minor schemes that could only happen behind the scenes. Naturally, the emperor had his own help from his fellow cohorts.</p><br/><p>“Would this prince fear such minor schemes? My reputation wasn’t that great even before my return to the capital.” Rumors of him eating humans here, raping and killing women there, and maltreating the common people had often reached his own ears. If he couldn’t even take that kind of pressure, how was he supposed to accomplish any major feats?</p><br/><p>But Bai Xiangiu stuck up a finger and said cleverly, “How will that do? You don’t care because you’re a man, but Old Madame doesn’t think that way. Everyone wants their dear ones to be praised by others, not met with malicious remarks.”</p><br/><p>The male lead might be the male lead, but he was always on the losing end from other people’s criticism. For example, there was how the female lead had misunderstood him in the beginning, and how the ministers had isolated him. Since she could be considered his most “intimate” comrade-in-arms, she had to think of ways to help him.</p><br/><p>Long Heng’s heart stirred. Were her words meant to say she was worried about him? Inexplicably, his whole body grew warm. Even his gaze softened as he spoke. “Then you tell me, what should be done?”</p><br/><p>He’d only asked on the spur of the moment. He had no expectation that this woman from the inner residence would actually have a solution. Moreover, he didn’t need her to waste brainpower on the issue when she was so weak and delicate to begin with. It was enough as long as she took care of herself. Unexpectedly, she actually started thinking seriously before suddenly bursting into a smile.</p><br/><p>It was a rarely seen, self-confident smile that made Long Heng’s heart tremble. That’s right, others thought she was docile and meek because she acted gentle and quiet, but it’d be boring if she was always like this. However, when she wore such an expression, it made people feel that only those closest to her could see her true, mischievous side. Surprisingly, there was even a hint of pride hidden within.</p><br/><p>It was all Long Heng could do to avoid flicking her on the head again. But when that little mouth started to speak somewhat excitedly, Long Heng felt that he’d do as she said even if her words didn’t seem to make any sense. Her very word seemed to hold some sort of magical charm.</p><br/><p>“You know Sun Hong’er’s style. You didn’t explain things clearly to her family when she was punished, right?” She paused. Actually, she’d guessed that a man with such headstrong and whirlwind methods would never explain anything to other people. What kind of general needed to explain the reasons behind any of his orders?!</p><br/><p>Thus, she added, “Your Highness, you can write down all of Sun Hong’er’s wrongs and put them up on posters. Have the witnesses and those who are equally guilty kneel before them to admit their wrongs. Of course, you have to hang up her corpse too, in case…” In case he was accused of stealing the corpse. She’d seen such intentions in her dream, but she wasn’t sure whether they were real. Just then, she’d almost avoided revealing everything.</p><br/><p>Sun Hong’er had been convicted of being sexually promiscuous in the prince’s manor. As for her other crime, that would have to wait for the results of an investigation. She never expected that the male lead would furrow his eyebrows and look at her again once she was done. Just when she was getting goosebumps, he raised his hand again.</p><br/><p>“Don’t…” Bai Xiangxiu unconsciously clutched her forehead and backed away to one side.</p><br/><p>Actually, Long Heng simply wanted to rub her head to encourage her. Her idea wasn’t bad, since exposing everything openly would make it impossible for others to pick faults at it. But he didn’t expect that she’d run away from him while clutching her head like a little rabbit. His heart couldn’t help but soften. He was about to speak when he saw a certain young lady sitting pitifully in a corner, thinking things over before quietly offering him her head. She had her eyes squeezed shut and said with a timid, tragically miserable voice, “Go ahead and hit me, but can you do it so it doesn’t hurt?”</p><br/>\n</div>"}