{"title": "Chapter 143: Various Pains", "id": 143, "volume": 2, "url": "http://boxnovel.org/doomed-to-be-cannon-fodder-chapter-143-various-pains", "volume_title": "Volume 2", "body": "<h1>Chapter 143: Various Pains</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 143: Various Pains</p><br/><p>Because of “Three Days of Inebriation”, Bai Xiangxiu’s body was now completely out of control. Even the pain wasn’t enough to wash away the tsunami of desire that left her actively trying to seduce the male lead. Was it that necessary for her to crave it so much?</p><br/><p>She was simultaneously disgusted with herself and filled with pleasure as Long Heng took her to all the way to seventh heaven. She’d abandoned any form of defense and was left completely battered and exhausted. After some time, even though she was completely immersed in the experience, it was almost like she’d fainted dead away at the same time. But even still, she knew that her body was dancing along with him. The other party seemed to have an inexhaustible endurance as he set the rhythm of their dance. There was not a single wasted movement as he lifted and brought her down in one smooth motion over and over again. </p><br/><p>She was so dizzy from the up and down movement that she almost forgot what her own name was. She only remembered begging for mercy near the end, but the other party didn’t oblige at all. Words of promise tickled her ear, but how was she possibly be able to listen to him? All she could do was gasp, pant and beg for mercy . </p><br/><p>Actually, when it finally came to an end Bai Xiangxiu felt that Long Heng’s performance wasn’t that good. It had been too short, but she had been so preoccupied by the pain that she hadn’t paid it any mind. She only came to that realization when he rose and she felt an ember of frustration flickering within her. Bai Xiangxiu thought that her torment had come to an end, but things were only just beginning. How could she have known that his manliness would roar back to life again after a few minutes? What’s more, it lasted so long this time around that she wanted to beat someone up.</p><br/><p>As mid-afternoon turned into late evening, Bai Xiangxiu came to the belated realization that LongHeng didn’t just deserve the title, “man of seven times”, that men liked to boast they held when bragging about their prowess in bed. In fact, each successive rekindling of his desire became longer and longer, to the point where she could no longer hold onto her mind anymore. In the end, she couldn’t even fathom reality from dreams.</p><br/><p>She vaguely heard Long Heng ask someone to fetch water for her as she lay there in a daze, but she really couldn’t tell what had happened after that. Even as she drifted off to sleep, she was extremely uncomfortable. Every part of her body ached something fierce. The only good thing about the entire situation was that the other party had finally let her sleep. At this rate, she’d be perfectly happy to sleep for another two or three days straight. But what she didn’t know was that a certain prince was both completely sated yet feeling guilty.</p><br/><p>This was the first time he known the pleasures between a man and a woman. He had never imagined that it could reach such heights. It was also especially different because of his feelings towards her in his heart. Now that he took a moment to think about it, if he’d slept with her the first time he’d thought a little fondly of her, it likely wouldn’t have been as pleasurable as the last few hours had been.</p><br/><p>However, the action had been a little… heated. He had let his emotions get the better of him a couple of times, and that had resulted in a few marks on her body. When he’d helped her bathe, he’d counted five marks on her body, and one especially on her neck. Even though he’d tenderly applied medicine on the marks, he still felt a little guilty. </p><br/><p>So new to the intricacies of a relationship between a man and woman, how could Long Heng know that it was entirely normal for a man and a woman to leave a few marks on each other in the heat of the moment? Instead, he came to the conclusion that he had indeed been rough on himself. He admonished himself; he should be more careful in the future! But now, as he gazed lovingly at her exhausted sleeping form, he felt that her small face was unusually beautiful. He kissed the scar on her face and gathered her in her arms, keeping an eye on her as she slept away her exertions. </p><br/><p>The next morning, the servants in Red Maple Mountain Villa started their preparations for their return to the prince’s manor. </p><br/><p>However, it didn’t matter how busy the servants were, Bai Xiangxiu’s small courtyard remained exceptionally quiet. Not a single person dared to talk above a low conversational tone. Everyone understood what had happened last night. The master had taken the fourth madame and so, both of them had slept in. </p><br/><p>Well, to be fair, the male lead had gotten up once in the morning and given his instructions to the sentry at the door, “Everyone, stand down. Don’t cause a single disturbance.”</p><br/><p>As a result of that, no one dared to make a sound near or in this courtyard. He had scared everyone away with just one sentence! Long Heng was in no hurry either. He returned to bed and continued to gaze at Bai Xiangxiu’s sleeping form. The more he looked at her, the more he felt the urge to laugh. The corner of his mouth involuntarily hoisted itself upwards, and even he didn’t know the reason why. </p><br/><p>She was of lower status than him and not very ambitious, but he’d never felt this kind of joy until she’d brought herself into his life. He just wanted to stay embracing her until the end of time. He originally wanted to slip back into bed and hold her again, but he was scared that she would rouse if he dared. So in the end, he just remained where he was. </p><br/><p>Bai Xiangxiu was having an awful nightmare at that moment. She felt like there was a knife slowly twisting inside her, causing immense pain. She slowly cracked open her eyes because she couldn’t sleep peacefully anymore with this much pain radiating through her. Before her eyes could fully register what was before them, she opened her tiny, cherry-red lips that, after a night of exertion, were now thick, puffy, and little dry to say, “It hurts…”</p><br/><p>Long Heng felt that someone had clawed at his heart. It was both itchy and slightly painful. He could only gently take her hand and try to comfort her. “Where does it hurt? Do you want me to call a doctor to take a look at you?”</p><br/><p>Could it be that he’d gone overboard and seriously hurt her somewhere? Didn’t they say that it was normal for a woman to bleed during her first time? Could it be that she shouldn’t have bled so much? Although…. It hadn’t been blood flowing in the end, right? He shifted his weight, wanting to lift up the quilt out of fear and take a look underneath. If she was bleeding profusely, he might really need to summon a doctor.</p><br/><p>Just as he shifted and a breath of the cold outside air crept beneath the quilt, Bai Xiangxiu no longer behaved as bravely as she did yesterday night. After all, she had been under the effect of the poison at that time. But now, the poison in her system had already been dispelled many times over. In any case, she felt awkward having a man lift up her quilt simply as he pleased. More so since she wasn’t wearing anything at all under the quilt. How could she be so careless? However, her action of quickly pressing down on the quilt was too intense, causing her whole body to flare up in pain, especially her hips. </p><br/><p>“Ah!!” She let out a blood-curdling shriek. Wait, did he actually break both her legs last night? With that shriek, how could Long Heng continue to stay passive? He completely disregarded how she felt about her quilt, and lifted it up to take a look underneath. At that point, that young lady who’d just taken a step towards becoming a woman curled up into a ball as fast as she could. She pouted as she said, “Why are you like this…”</p><br/><p>This was the first time Long Heng saw her act like such a little girl. He didn’t know whether he should laugh as he asked, “How so?”</p><br/><p>Bai Xiangxiu felt that he was absolutely teasing her, but she didn’t dare move recklessly right now, so she could only roll her eyes at him. She wasn’t that afraid of him anymore after last night’s battle. As a matter of fact, she’d shown him quite a few seductive expressions that had tickled his heart. Thankfully, he was still concerned about Bai Xiangxiu and was merely afraid that her body was out of sorts. </p><br/><p>“Don’t randomly move about. Let me see whether you’re injured.”</p><br/><p>“No, I’m not injured. It’s only my legs that hurt…” As she responded, Long Heng reached out and gently pushed her to the side, revealing a stain the color of a red plum. Bai Xiangxiu flushed red as she desperately wished for a hole that she could dive into right then. That kind of embarrassed look of hers was rather adorable in Long Heng’s eyes. He hugged the curled ball of a girl and covered her with the quilt. He touched her messy hair in a slightly clumsy manner and said, “Don’t move about randomly. Where does it hurt?”</p><br/><p>There weren’t any traces of fresh blood on the bed, which proved that there didn’t seem to be any other injuries. Hence, he took the time to carefully feel her body out of concern for her, disregarding whether she was embarrassed or not.</p><br/><p>“It’s not painful here… Ah, it’s very painful there…” It’d be a wonder if her legs didn’t hurt. Why had he tormented that perfectly good pair of legs of hers? Bai Xiangxiu glared at Long Heng with tears brimming in her eyes. That expression of hers almost made him lose control and pounce on her again. </p><br/><p>“Your legs hurt?” He’d just gently tugged on her legs and caused her to jerk away in pain. It seemed that her legs really did hurt. In truth, he knew the precise reason why her legs hurt. He hadn’t been able to control his strength perfectly the night before, and those legs had been in the way. So… he… well..</p><br/>\n</div>"}