{"title": "Chapter 152: The Old Madame Returns", "id": 152, "volume": 2, "url": "http://boxnovel.org/doomed-to-be-cannon-fodder-chapter-152-the-old-madame-returns", "volume_title": "Volume 2", "body": "<h1>Chapter 152: The Old Madame Returns</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 152: The Old Madame Returns</p><br/><p>Long Shuting spat out a mouthful of tea at the bold words of the fourth madame. Feeling a little embarrassed, he coughed gently a few times. He didn’t expect that the fourth madame would start speaking so boldly and mischievously after the trip. She also seemed a little more grounded now when compared to before. It made her feel more personable. He had a feeling that it was the eccentric fourth madame that had come up with this plan. Judging from the prince’s attitude, Long Shuting was sure that the prince wouldn’t care about gossip. Otherwise, he would’ve tried explaining himself a long time ago. </p><br/><p>In all truth, they didn’t really need to explain anything. All they needed to do was show some evidence to the public. Once that was done, it would prove that the Prince Li Manor disdained such indecent and vulgar activities, and would also prevent people from trying to cause harm to the estate from the shadows. At the very least, it would cut off any chance of this incident being used to cause harm.</p><br/><p>Once Bai Xiangxiu was done reading the indictment, she nodded. This evidence should be enough to change the public’s opinion on Long Heng. However, who wrote this? The words used are very sharp and precise. It vividly describes the wrongdoings of a widow who lacked virtue and tried to seduce her master. After reading it, even Bai Xiangxiu had felt the urge to push the widow straight into the pond.</p><br/><p>Long Shuting was also aware that the dowager empress had fallen gravely ill. As such, he thought to make some preparations for the return of the old madame as well. “When the old madame returns, she will surely enter the palace. However if something does happen to the dowager empress while she’s in the palace, she will absolutely grieve over the loss. Why don’t we think of a way to keep her busy or cheer her up? It would be better than allowing her to wallow in grief.” </p><br/><p>Bai Xiangxiu was willing to help, but couldn’t come up with something that would make the old madame happy. She knew that the old madame’s biggest wish was for Long Heng to wed and give her a grandson to hold. However, the female lead would soon enter the estate and Bai Xiangxiu was afraid that the female lead would anger the old madame to death instead. Bai Xiangxiu would feel discomfited with her presence as well.</p><br/><p>Long Shuting came up with an idea, but took a glance at Bai Xiangxiu and decided not to say it. Bai Xiangxiu noticed his actions and asked with curiosity, “Steward Long. Do you have an idea?”</p><br/><p>Long Shuting coughed gently. He seemed a little reluctant to talk about it.</p><br/><p>“Xiaoshi, go fetch us a new pot of hot tea.”</p><br/><p>Xiaoshi took a glance at Bai Xiangxiu and left to make a new pot of tea. She had a feeling that her mistress simply wanted some privacy, and so took off without questioning a thing.</p><br/><p>After she was gone, Bai Xiangxiu turned towards Long Shuting, a gentle smile on her face. The meaning behind the sentence was clear. Time to speak up. Stop trying to bottle it in.</p><br/><p>Because Long Shuting was a man, it was a little embarrassing for him to bring up his idea. In his opinion, even though Bai Xiangxiu was normally quite intelligent, she was a little slow when it came to things of this nature. It wasn’t as though she could be blamed for it either. What woman would be so daring as to think up an idea like his? Moreover, the old madame might even resent her if things didn’t go to plan. However, his plan was the only way he could see to cheer up the old madame.</p><br/><p>He hesitated a little at first but continued. “I’m sure Madame Xiu is more aware than I am of what the old madame yearns for.”</p><br/><p>“Uhh… But…” I’m not. Her hand subconsciously drifted to her abdomen as she blushed a little.</p><br/><p>Long Shuting continued to speak as he laughed. “It doesn’t have to be the real thing. She only needs to suspect that it’s real.”</p><br/><p>“You’re saying…” Bai Xiangxiu immediately caught his drift. She coughed gently and said, “Then I shall trouble the head steward to make all the arrangements.”</p><br/><p>Long Shuting instantly understood that she was dragging him into the muddy waters right along with her. He couldn’t help but shake his head. It truly isn’t easy to take even the slightest advantage of the fourth madame. Only the prince would see her as fragile like paper. He didn’t even want me to show the indictment paper to her, even going so far as to say that it would scare her. </p><br/><p>Long Shuting had hesitated for a long time before finally deciding to bring the indictment to her, mainly because the matter wouldn’t be counted as resolved if his master didn’t see it. After all, nobody knew when the prince would get the chance to return from the palace. Just as he predicted, Long Heng was stuck in the palace for two whole days. It wasn’t until he received news of the old madame’s return that Long Heng was finally allowed to return to the estate to escort her to the palace. </p><br/><p>When the old madame received the news, she cried the whole way back to the estate, leaving her frail and sickly by the time she arrived. She only sat in the estate for a moment before leaving for the palace, leaving no instructions behind. Long Heng naturally had to accompany her. Fortunately, Long Heng still had some conscience. He ignored everyone else and met only Bai Xiangxiu. Seeing that she was doing fine, he gave her some estate related tasks and left everything in her hands. He even told her to not tire herself out.</p><br/><p>However, Bai Xiangxiu felt that he was the one who was tired out instead. The enormous dark circles beneath his eyes were obviously due to the many sleepless nights he had had. However, he had no choice. There was only so many trusted ministers whom the dowager empress liked. Each of them had served in place of the emperor in waiting for news outside her room.</p><br/><p>For some reason, Bai Xiangxiu suddenly tugged on Long Heng’s sleeves just as he was about to leave. However, she was unable to think of something to say to him. It wasn’t until Long Heng turned back around to look at her that she stammered, “Get some sleep when you find the chance. Don’t think that your body is made out of steel.”</p><br/><p>For reasons unbeknownst to Long Heng, his heart suddenly began to pound. All of the fatigue and yearning he had been suppressing for the entire day transformed into a surge of vigorous energy which swelled and cavorted in his heart. He dragged Bai Xiangxiu’s small and petite body into his embrace, enfolding her in his long arms. He hated that he couldn’t stay with her and forget about all other matters.</p><br/><p>They hugged for quite some time before Long Heng felt Bai Xiangxiu struggle a little and let her go. With a voice that rang a little hoarse, he assured Bai Xiangiu that he would definitely get some sleep. Even Bai Xiangxiu had realized that the mood in the air had reached its peak in pink warmth. As if hypnotized by a certain mood, she silently followed Long Heng for some distance to send him off. She only returned to Winter Garden reluctantly after he waved at her to ask her to go back.</p><br/><p>Once she was back, she took stock of the situation for minute before deciding to move to Apricot Garden. If needed, she could just move back to Winter Garden for a few days next spring. There was no point in continuing the dispute with Long Heng. </p><br/><p>After considering how Long Heng had to continuously find excuses to see her at Winter Garden, she realized that she was making things difficult for him. Moreover, even if Long Heng was keeping his mouth shut for now, he would probably still make her move to Apricot Garden sooner or later.</p><br/><p>Although it wasn’t good to be a concubine in the ancient times, she realized after some careful thought that even in the absence of any promises from Long Heng, no one would be able to come between the two of them as long as they maintained a good relationship. At that time, she’d be a concubine only if she viewed herself as one. No one would dare fight for the position of main wife if that was what she considered herself. However, it was still up to the male lead’s decisions. He was someone with a main character halo, while Bai Xiangxiu herself had nothing.</p><br/><p>Alright. This is how things can be. At least he’s been treating me well all this time. When the male lead had hugged her just now, she felt like her entire body soften, almost melting into him. She genuinely believed that she had fallen in love.</p><br/><p>Xiaoshi didn’t expect that her mistress would agree to move to Apricot Garden. She was the person in charge of the entire estate right now, so no one dared refute her decision.</p><br/><p>The servants at Winter Garden worked together to move all of her personal belongings to Apricot Garden. It was a very large residence. The entrance itself was large enough for four people to stand abreast. The front of the residence was for guests, while the living quarters were situated more to the back. There were more than ten houses scattered around the property. It really was a place to which Winter Garden could never hope to compare to. Most importantly, the underground heating in this place was unusually warm. Bai Xiangxiu was immediately greeted with a wall of warm air the second she stepped foot inside.</p><br/><p>This residence was meant for the future mistress of the household, so it was no surprise that it was much better built than Winter Garden. Bai Xiangxiu remembered that the female lead had moved into Apricot Garden when she’d first arrived at the estate in the novel. It was much closer to the male lead and would make it much more convenient to visit at night.</p><br/>\n</div>"}