{"title": "Chapter 163: Thief in the Manor", "id": 163, "volume": 2, "url": "http://boxnovel.org/doomed-to-be-cannon-fodder-chapter-163-thief-in-the-manor", "volume_title": "Volume 2", "body": "<h1>Chapter 163: Thief in the Manor</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 163: Thief in the Manor</p><br/><p>Lin Qianzi turned her head to the side and began weeping. Duan Yunying smirked coldly inwardly. That woman had been so happy just now, and she’s only now remembering to cry. “If you don’t do it, then I’ll do it myself!”</p><br/><p>“No!” Lin Qianzi suddenly sat up to pull him back. She spoke with a reddened face, “No! We can just… pretend this never happened.”</p><br/><p>She slowly turned around to put on her clothes and then got off from the bed, preparing to leave. Duan Yunying however, pulled her back and asked carefully, “May I… bring my proposal to the Lin Manor?”</p><br/><p>“You can’t! You can’t do that. Long Heng won’t let you off for that!” Lin Qianzi left tragically after speaking.</p><br/><p>Long Heng would probably only thank me for taking this broken thing off his hands! He’d learned last night that she was no longer a virgin, and the man who’d done so was quite a brutal person. Duan Yunying could guess from the marks on her back that had yet to heal that they’d done the deed just two days ago. Who could it be? Luo Yunzheng or Long Heng?</p><br/><p>He pretended to chase her out in order to escort her back to the manor, also “accidentally” revealing himself along the way so that she knew his sincere efforts in taking her back. But he mused as he walked. He would need to do the deed again before the day of their marriage. That day would be when Long Heng’s defenses were at their lowest.</p><br/><p>However, he had no idea that Long Heng actually knew all about him meeting Lin Qianzi. Prince Li was on his way back to the manor from the palace when he received the news. He’d brought back a small, exquisite hand warmer to give to Bai Xiangxiu. This was a bauble that a foreign tribe had offered in tribute to the royal consorts, and said to not burn at all when providing warmth. A bit of hot water would be enough to keep it warm all day during the winter time.</p><br/><p>Long Heng had wracked his brains out to obtain one for Bai Xiangxiu. Her temperament was fragile and she would cower in her room, shivering whenever she was cold. For some reason, a slight trace of a smile flitted to the corners of his lips when he thought of how happy she’d be upon receiving the gift. “Let that jianghu man know of this. Don’t leave him in the dark that he’s been cuckolded.”</p><br/><p>Ai, he was really much too soft hearted in using such a gentle method to settle this. He would’ve otherwise killed the two secretly already. However, he didn’t have time at the moment either, he only wanted to spend time with Bai Xiangxiu and gave no thought to anything else.</p><br/><p>And yet, who would’ve thought that some dratted person would reach the manor before him and tell tales of what’d happened. Long Heng immediately rushed to Apricot Garden with a frozen expression when he heard that Bai Xiangxiu had fainted. But she was awake now, and having a nice little chat with Huo’er. She signed when she mentioned that it was almost new year’s.</p><br/><p>This sigh was quite ear piercing to Long Heng. His fiancé had bullied his woman and had run off crying. She’d then slept with another man outside and dared come back afterwards. This woman is truly something else! But, why does Xiangxiu speak to that frightening plant whenever she receives a shock? Could he allow the the plant to stay or not?</p><br/><p>Huo’er was a sensitive one, and immediately started crying when Long Heng glared at it. “He wants to kill me! I don’t want to be here anymore! Mistress! Please take me away from here!”</p><br/><p>Huo’er’s sudden yell startled Bai Xiangxiu, and she subconsciously wanted to protect him. But it had spikes, so she ended up being pricked all over for her trouble. “Ahh!!”</p><br/><p>It hurts so much! Tears flowed out like they were worth nothing from her eyes. All her friends said that women became finicky when they had boyfriends. She’d never cried because of a prick before.</p><br/><p>“You… what are you protecting a dead thing for? Were you pricked?” Long Heng really didn’t understand this woman sometimes. What was she so nervous about a plant for?</p><br/><p>Bai Xiangxiu shook her head. What if he destroyed Huo’er in a fit of rage? How would she go home then? However, the more she was thus, the more Long Heng felt that she really treated this plant differently. But it wasn’t time to be conflicted about this. He asked with a frown, “I heard you just fainted. Did she come to make trouble?”</p><br/><p>Bai Xiangxiu started. She hadn’t expected that Long Heng really would take an interest in this matter. How to put things? She did somewhat believe that he genuinely loved her after her role had been swapped with the female lead. Although the male lead never spoke of it, she could glean such from his actions because that was how he’d treated the female lead in the novel, like treasure. He might not have known how to love in the beginning, only knowing to have someone and be domineering about it. But he slowly changed later on, making others feel that he was a good man indeed. However, even at the time of her transmigration, she’d had yet to read about the male lead telling the female lead that he loved her. His actions however, were enough to prove how much he cared about her.</p><br/><p>And now, he was waiting for an answer from Bai Xiangxiu. A strange mischievous surge struck Bai Xiangxiu. She nodded stiffly and then turned her head because she felt that she’d done something bad. However, Long Heng took that to mean that she was sad. He spoke coldly, “Remember, you’re this prince’s woman. You have no need to fear anyone.”</p><br/><p>He then turned and strode out with large steps after speaking, a marked departure from his usual attitude of sticking by her side. Bai Xiangxiu’s heart pounded. Should she cry from being so touched under the circumstances? The male lead really did care about her! Had he left to take revenge for her? But how would he handle the female lead? What would a fight between two people with main character halos look like?</p><br/><p>But Long Heng didn’t return that evening, making Bai Xiangxiu a bit nervous. Long Heng had spent almost every night at her residence since they’d been intimate, where had he disappeared off to now? She couldn’t help but think random, wild thoughts, but actually received word before long that a thief had trespassed into the manor. The servants hadn’t caught the culprit, and Bai Xiangxiu began to worry about the prince. She didn’t care that it was the dead of night and decided to make for his residence.</p><br/><p>She slipped along the way because she was in too much of a hurry. Just as she was floored from the pain, someone inserted their hands beneath her ribcage and picked her up, grasping her in their embrace afterwards. Bai Xiangxiu sat in the crook his arms, her own around his neck and stammered a bit. “You… didn’t you go after the thief?”</p><br/><p>“You came running out even though you knew there was a thief?” She’s worried about me, isn’t she? Look at her run so fast in the dead of the night. Long Heng was still very happy, so happy that he picked her up in a huge, ignoring the looks of those around her.</p><br/><p>“How… how would I know?” Bai Xiangxiu refused to admit to what she’d done, but the other seemed to understand.</p><br/><p>“This prince isn’t so weak as to have a little girl like you worry about me.” What a marvelous day. He’d let the thief in so he could see that woman. His plan would succeed the more the two entangled together.</p><br/><p>Bai Xiangxiu didn’t speak anymore and she clung docile to Long Heng’s neck, sniffing that familiar fragrance. She felt nothing bad about remaining in his embrace. Although she didn’t know what had happened to her in the modern world, this kind of man was truly rare.</p><br/>\n</div>"}