{"title": "Chapter 167: Accidental Injury, the Meticulous Alliance Head", "id": 167, "volume": 2, "url": "http://boxnovel.org/doomed-to-be-cannon-fodder-chapter-167-accidental-injury-the-meticulous-alliance-head", "volume_title": "Volume 2", "body": "<h1>Chapter 167: Accidental Injury, the Meticulous Alliance Head</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 167: Accidental Injury, the Meticulous Alliance Head </p><br/><p>He was the man who’d prevented the supporting male Luo Yunzheng from hurting the wulin 1 for the sake of personal relationships. In the end, he had been dragged into everything as well. After all, the alliance head couldn’t just stand by and see those in the wulin suffer. The novel had mentioned that he had an extremely beautiful appearance and excelled in martial arts. For example, his entrance just then had caused Luo Yunzheng to subconsciously back up a step.</p><br/><p>“Is Alliance Head Yu threatening me?”</p><br/><p>“Boss Luo, please let go. You cannot take actions that will harm the wulin for the sake of personal relationships.”</p><br/><p>“You’ll find it a bit difficult if you want to stop me. However, I’ll take your words into consideration.” Luo Yunzheng didn’t want to suffer any losses, so he extended a hand to Bai Xiangxiu. “We’re leaving.”</p><br/><p>Bai Xiangxiu glared at him. The Alliance Head Yu standing before them didn’t want any conflicts between the imperial court and the wulin, so he wouldn’t do anything to her. With such a savior present, why would she throw herself into the arms of her enemy, Luo Yunzheng? “Save me, Alliance Head Yu! This little woman is a daughter of a good family who was kidnapped by him. He even wants to, to assault me!” Speaking quickly, she began to cry. </p><br/><p>Luo Yunzheng started. He’d assumed that she would pick the familiar face in this situation, but she’d actually pleaded for Yu Kuang to help!</p><br/><p>Yu Kuang furrowed his brows, his chilly, celestial visage turning even more beautiful at the action. With a wave of his sleeves, he actually sprang towards Luo Yunzheng!</p><br/><p>The Cloudlake Faction had enormous influence within the jianghu, but they were a free and unfettered group from the perspective of the wulin alliance head. It was only because one of their members had gone and provoked the imperial court this time, which had then caused fellow wulin members to be injured that Yu Kuang had actually come to restrain Luo Yunzheng’s behavior. He’d never expected the latter to actually kidnap a young woman to fool around with here! Luo Yunzheng was truly bold in his debauchery. Yu Kuang hated that type of people most of all, so he showed no mercy.</p><br/><p>Because Luo Yunzheng had been injured at the prince’s estate a few days back, he was no match for the man. In his haste, he grabbed Bai Xiangxiu from the bed and threw her at Yu Kuang while she was still wondering how to escape. His original intention was to have her block a blow for him. It wouldn’t matter even if she died. Yu Kuang hastily tried to withdraw his strike when he saw her body come flying at him. The backlash of internal energy ended up injuring himself, but he couldn’t fully stop his attack, remnants of which actually striking Bai Xiangxiu’s sternum. She felt the air burst free from her lungs before losing her breath to collapse on the floor.</p><br/><p>As she fainted, she could only think of cursing that Luo Yunzheng. He’d actually used her as a human shield! Sooner or later, she’d definitely get back at him, but right now it was impossible for her to even move. Yu Kuang looked at the woman he’d struck with furrowed eyebrows, but picked her up in the end to bring her back to Whitecloud Mountain.</p><br/><p>Whitecloud Mountain was the jianghu’s number one faction, and its members placed emphasis on self-improvement through arduous cultivation. Yu Kuang was the leader of the faction as well as the wulin alliance head, a busy man with a high position. Thus, his living quarters were slightly more comfortable than everyone else’s.</p><br/><p>Currently, a severely injured Bai Xiangxiu was lying on his bed. Even though she had woken up, she didn’t dare to move because her sternum had been broken. A certain martial uncle of Whitecloud Mountain had already examined her and said she’d be good to walk in a few days. But right now she didn’t even dare to move a muscle!</p><br/><p>That Yu Kuang was a strange one as well. He was clearly an alliance head and very busy, but he didn’t even have a study. Most of his business was handled in his own rooms. Despite being alliance head, he seemed not to enjoy a single privilege of one. But he definitely had the airs of an alliance head as he babbled on about courtesy and ceremony while looking like an ascetic. </p><br/><p>“Hey, Alliance Head Yu, may I ask…” Aren’t there any female disciples here? She couldn’t help but ask the busy man as he worked in the outer rooms.</p><br/><p>“What is it?” Yu Kuang didn’t enter, instead speaking in a distant tone.</p><br/><p>“I… Alliance Head Yu, though I’m thankful that you’ve saved me, could you consider sending me back to the capital?” At least then she wouldn’t feel so sullen.</p><br/><p>“Certainly, but it’s not convenient for you to be moved right now.”</p><br/><p>Yu Kuang’s voice was truly, extraordinarily light. It left her with no choice but to say, “Is it possible, to have a girl come in. I… need… to use… the facilities.”</p><br/><p>It was so embarrassing mentioning this to her idol, all right? She felt like ramming her head into tofu.2 But the person outside simply walked away in a calm, measured way. Before long, a sturdy-looking female disciple entered the room. Without another word, she picked up Bai Xiangxiu and went to a side room, before setting her down on a chamber pot. “I’ll support you, so hurry up. There’s a lot going on outside.”</p><br/><p>Bai Xiangixu was nervous and tried to look for a conversation topic. “How odd. Why doesn’t Alliance Head Yu arrange for me to mend my injuries in another room? At least one with female disciples.”</p><br/><p>“You’d need an available room in the first place. Whitecloud Mountain is the number one faction in jianghu. The number of disciples who want to join us is long enough to form a queue that stretches to the bottom of the peak. So aside from the Faction Head’s rooms, everyone else is squeezed in together. There’s no extra space for you to treat your injury.” After the female disciple finished her proud words, she helped Bai Xiangxiu finish up her lavatory duties and carried her away again.</p><br/><p>But Bai Xiangxiu only felt enough pain to writhe on the bed. Why were all martial arts practitioners so strong? She’d been left in tons of pain, all right? After two days on the bed, she could finally walk again. By then, she figured it was high time that she returned to the capital. Since she knew Yu Kuang was right in the little room outside, she wanted to find him to ask about going back. He had no time during the day, and it was difficult enough to find him at night.</p><br/><p>She lightly knocked on the door before hearing movement from inside. But nobody came to open it. Strange. If Alliance Head Yu was inside, why wasn’t he opening the door? She knocked again, and heard a muffled noise, but the door remained shut. Has something happened?</p><br/><p>Bai Xiangxiu stood listening outside the door, hearing muffled noises from within. It sounded like somebody had been gagged. Had Alliance Head Yu been kidnapped? How was that possible? But she couldn’t just let the sound be after she heard it. Maybe he’d eaten the wrong food or something.</p><br/><p>Bai Xiangxiu pushed on the door twice without effect before using her foot to kick it. She thought it wouldn’t budge, but maybe the door was too old. It slowly swung open, but the inside was completely dark. Bai Xiangxiu swallowed and stepped inside, only to see a strange sight by the light of the moon.</p><br/><p>Alliance Head Yu Kuang was lying on the bed with something stuffed into his mouth. There was a rope that looped around his neck to tie his hands behind his back, and a gag in his mouth. She hurried over to light the oil lamp by the bed first, then proceeded to remove the gag. Brows furrowed, she asked, “What happened?”</p><br/><p>As soon as the gag disappeared, the fairy-like face of Yu Kuang said weakly, “Big sis, save me. What can I do now that they’ve tied me up?”</p><br/><p>“Ah?” Just what was going on here? Could anyone tell her? She’s still waiting desperately online for answers!</p><br/><p>“Big sis, my hand hurts. It hurts a lot. Can you help untie Shū’er?”</p><br/><p>“Wah!” Bai Xiangxiu didn’t think it was too good for this child-like man who resembled Yu Kuang to remain tied up. But really, things were too strange. She was a little hesitant as she undid his bonds. Her movements weren’t rough, but the other party seemed to feel greatly wronged and began to cry.</p><br/><p>1. Wulin () – a term used in wuxia fiction and media related to Chinese martial arts to describe the community of martial artists. It is part of the broader term jianghu.</p><br/><p>2. ramming her head into tofu () – a saying that basically means to feel like hitting one’s head against the wall, whether it be from frustration, a willingness to seek death, or etc. without true intentions to suicide.</p><br/>\n</div>"}