{"title": "Chapter 173: Two Supporting Male Characters", "id": 173, "volume": 2, "url": "http://boxnovel.org/doomed-to-be-cannon-fodder-chapter-173-two-supporting-male-characters", "volume_title": "Volume 2", "body": "<h1>Chapter 173: Two Supporting Male Characters</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 173: Two Supporting Male Characters</p><br/><p>But those were all considerations for the future. Right now, her current thoughts were entirely preoccupied by when she could set her feet on solid ground again! Being carried about here and there really left a person speechless. She wanted to throw up, but couldn’t; she wanted to faint, but didn’t. Even if she wanted him to stop and rest for awhile, she couldn’t open her mouth to speak the words.</p><br/><p>It really was a living torment. Bai Xiangxiu felt like incense smoke was constantly spinning around and around in her eyes until it left her dizzy. Suddenly, a streak of white shot by one side. All she felt was that the sight looked familiar, but she couldn’t continue that thought because her head was on the verge of exploding. Meanwhile, the other figure suddenly stopped before turning back to chase after them.</p><br/><p>“Put her down, thief!” This voice… this voice seemed to belong to the supporting male, Song Jiaoyue. Her savior was here. Quick, stop him!</p><br/><p>However, Yu Kuang simply increased his speed at the sound of his voice. They couldn’t run any further. At this rate, they’d bypass the capital entirely. Bai Xiangxiu couldn’t be bothered with much else and reached out with her hand to pinch something. She didn’t care whether it was an arm or a butt, but it was to remind him to stop. But as it turned out, she ended up pinching his waist. How could Yu Kuang be unaffected by a sudden attack there while he was running?</p><br/><p>He sucked in a breath lightly before stopping to look down at Bai Xiangxiu with furrowed brows, not understanding. That momentary pause was enough for Song Jiaoyue to catch up to them. He noticed that the man didn’t seem too wicked or evil, but once his eyes met her clear and delicate ones, he instantly felt an urge to pull that woman into his own arms.</p><br/><p>So without further ado, he flung out a punch. “Let her go!”</p><br/><p>“Who… are you?” Yu Kuang easily evaded the blow as he held onto Bai Xiangxiu’s waist and started fighting with Song Jiaoyue.</p><br/><p>Bai Xiangxiu felt like flipping a table. Fight all you want, but why drag me along? “Hold it, you two!” She finally shouted, her voice piercing the eardrums of the two males. While they were staring, dumbstruck, at her, she struggled free of Yu Kuang’s grip to kneel on one side with dry heaves.</p><br/><p>Song Jiaoyue only felt a heavy blow to his heart as he backed up a step in surprise. “You, if it’s like this, then you… are you… having a…”</p><br/><p>“Have? what have? He made me so woozy, I almost threw up last night’s dinner!” Bai Xiangxiu shot a glance at Yu Kuang, only to see his face remain as cold and noble as always.</p><br/><p>Only then did Song Jiaoyue release his held breath and walk over to help her up. “It’s about time I found you. Just what kind of person took you out of the manor?”</p><br/><p>“It was that man called Luo Yunzheng… urk…” She was about to give her hand to Song Jiaoyue when it was batted away.</p><br/><p>“Will this friend please conduct yourself with dignity. This woman is my future wife.” Yu Kuang said without an ounce of politeness. He had a guess that this man was none other than Bai Xiangxiu’s husband. He looked all right and had good martial arts to match, but the sight of them acting familiar with each other made him uncomfortable.</p><br/><p>“You two… since when…” Song Jiaoyue gave a start. He trusted that Bai Xiangxiu wasn’t that kind of woman, but this man didn’t seem like the type to speak heresy either.</p><br/><p>“How should I know since when?” Bai Xiangxiu glanced at Yu Kuang, not knowing why he’d spoken such words.</p><br/><p>But Yu Kuang simply placed her behind him before saying, “Since you know martial arts, we can have a match. If I win, she’ll belong to me. How’s that?”</p><br/><p>“What, what? What I’ll belong to…” you? But before she could finish, he struck her acupoint and rendered her mute.</p><br/><p>Song Jiaoyue clenched his fists and said coldly, “We don’t have the right to decide for her sake, so I ask that you hand her over. I’ll bring her to somewhere safe. But if you have any connection to Luo Yunzheng, don’t blame me for being rude.”</p><br/><p>“I don’t have the slightest connection to Luo Yunzheng. Don’t you want her? Then you have to fight me for her.”</p><br/><p>In the jianghu, people resolved conflicts in such a simple manner like this. Moreover, Yu Kuang deeply abhorred the look in the other man’s eyes.</p><br/><p>Song Jiaoyue saw Bai Xiangxiu staring at him from behind the other man as she waved her hands back and forth. She was obviously trying to tell him not to agree to this man’s terms! He couldn’t help but smile slightly. “Don’t worry, I’ll make sure you’re safe.”</p><br/><p>Bai Xiangxiu rolled her eyes. Yu Kuang wasn’t Luo Yunzheng, so there was nothing dangerous about staying by his side, alright? But men were always impulsive like this. The two of them actually started fighting.</p><br/><p>She was cut off from any more communication as their fight blasted into action, the flurry of blows passing too quickly for her to see. She couldn’t even make out the figures amidst the furious back and forth. She didn’t dare rush out to stop them, because she was sure she’d be sent flying by a punch if she tried. Meanwhile, the two men were both astonished by each other. One couldn’t fight at full speed and strength because of his obstructed blood circulation, while the other was no match for him originally.</p><br/><p>As a result, because of various reasons, they ended up with a tie. In the end, fighting became meaningless, so they halted at the same time.</p><br/><p>Bai Xiangxiu looked at them both before picking up a branch to write, ‘Song Jiaoyue isn’t my husband; don’t seek trouble for yourself.’ Then she wrote on, ‘He’s my lifesaver, so don’t hurt him, Sir Song.’ Finally she’d explained herself. She blinked at Yu Kuang, hinting that he could unseal her acupoint now!</p><br/><p>Yu Kuang tapped her acupoint, and she could finally speak again.</p><br/><p>“Sir Song, this Sir Yu saved me from Luo Yunzheng’s clutches. He’s currently taking me back to the capital.”</p><br/><p>Song Jiaoyue looked at Sir Yu and only smiled coldly. “Oh? How could we have Alliance Head Yu personally send you back? Why not have this one take over from here so you can go back to your busy affairs.”</p><br/><p>Yu Kuang only said mildly, “Since you’re not her husband, what kind of person are you to her? I’m looking for her husband.”</p><br/><p>“What are you looking for her husband for?”</p><br/><p>Song Jiaoyue didn’t think this man was really planning to hand Bai Xiangxiu over to her husband. As expected, Yu Kuang’s next words were, “To ask for her hand in marriage. I want to take her as my wife.”</p><br/><p>Song Jiaoyue’s tone turned severe. “Shut your mouth!” This was something even he could only dream of, but this man had spoken those same words so easily. How could he keep his temper in the face of something like this?</p><br/><p>Bai Xiangxiu had never seen Song Jiaoyue so incensed and was frightened to the point of shaking. Indeed, men were still men in the end. No matter how good their tempers were, it was still scary when they lost it. Still, she couldn’t blame him when Yu Kuang’s words were this infuriating.</p><br/><p>“Sir Yu, I’ve said it before. I have a husband and we’re doing very well together. He won’t agree to me marrying you. So, many thanks for bringing me to this point, you should go back to take care of your own matters!” She raised a hand to move him aside, but caught Yu Kuang staring at her. It felt like an abandoned puppy was looking out from his eyes, making her rub her head instead of chasing him away.</p><br/><p>Song Jiaoyue however, had already seized the chance to pull her to his side, before letting go of her hand as if he’d been burned. “This one is the friend of this woman’s husband. I came out this time to search for her. Many thanks to Alliance Head Yu for this lifesaving debt. However, I believe that a proper and upright Wulin Alliance Head won’t force a woman to repay such kindness with herself, correct?”</p><br/><p>Though Song Jiaoyue’s words were respectful, they also served as a warning for Yu Kuang to be mindful of his status.</p><br/>\n</div>"}