{"title": "Chapter 184: Parting Gift", "id": 184, "volume": 2, "url": "http://boxnovel.org/doomed-to-be-cannon-fodder-chapter-184-parting-gift", "volume_title": "Volume 2", "body": "<h1>Chapter 184: Parting Gift</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 184: Parting Gift</p><br/><p>The three moves looked as dangerous as a tightrope over an abyss. Each of Long Heng’s moves seemed to land the two in perilous waters, but in the end, Luo Yunzheng met with defeat. He coughed three mouthfuls of blood as his internal injuries roiled.</p><br/><p>“No! Yunzheng! Yunzheng…” Miss Lin immediately ran towards him. With a force that would normally run someone over, she crashed into Luo Yunzheng’s arms, causing the poor injured man to stagger on his feet. But he didn’t grow angry. Instead, he hugged her tight and looked at Long Heng, “Are we allowed to leave now?”</p><br/><p>“You may.” Long Heng hadn’t actually sustained any heavy injuries. But in order to create that illusion, he held his hand over his chest and didn’t move an inch. He was focusing on constricting his blood qi to turn his complexion pale. </p><br/><p>He was able to fool the masses, but not Bai Xiangxiu. She now understood that everything had been orchestrated by Long Heng in order to end his arrangement with Lin Qianzi in front of the public. But why hadn’t he told me anything the entire time? I’ve been giving him the cold shoulder all this time! Now that Long Heng was injured, she nearly tripped over herself running to his side in concern. “Are you alright?”</p><br/><p>“Servants! Throw them out!” The old madame got on her feet and gestured towards the intruders in a dignified manner. However, she was looking a little pale due to her anger. How dare a sullied woman try to marry into my household? She even tried to do so while carrying a child! Is she trying to make my son raise her bastard for her?! The more she thought about it, the angrier she became. Even if she had to defy the emperor himself, she would never let that happen!</p><br/><p>Luo Yunzheng had every intention of leaving. He wiped the blood from a corner of his mouth and stood up with a laugh. “I will definitely take my leave. But before that, I have a gift to present to you.”</p><br/><p>What gift could a person possibly present when he’s being thrown out? Just as everyone was wondering what kind of gift he had, one of Luo Yunzheng’s men suddenly leaped up out of nowhere and flung open his coat. Thousands upon thousands of needles shot out from his body. His target? Bai Xiangxiu!</p><br/><p>Long Heng was taken by surprise. He immediately folded Bai Xiangxiu into his arms and used his internal force to deflect the needles. However, there were too many of them and he couldn’t block all of them. A couple of them slipped past his defense and caused him minor injuries. </p><br/><p>Another two figures also shot over to his side. One of them used a sword to deflect the many silver needles, while the other simply deflected them by brandishing his sleeves. </p><br/><p>Even though the three of them were deflecting the needles from her, a few of the needles still managed to strike Bai Xiangxiu. After feeling some tingling sensations on her body, Bai Xiangxiu fainted dead away in Long Heng’s arms. </p><br/><p>Long Heng panicked and immediately shot towards the rear court with her in his arms. “Servants! Call for the doctor!”</p><br/><p>After that, he immediately brought Bai Xiangxiu to a private room in the rear court. He freed her from her outer garments and quickly noticed a needle in her left shoulder, right thigh and her back. And because she had no internal force to protect herself, the needles had bored themselves deep into her body. There would be dire consequences if the needles weren’t extracted in time. He immediately brought his internal force to bear in drawing out the needles from her body without another thought. </p><br/><p>But because he had consumed a considerable amount of internal force during his battle with Luo Yunzheng earlier, he suddenly felt his qi stagnate. Fortunately, a hand placed itself on the center of his back at exactly the right moment, allowing his qi to settle. It didn’t take long for him to successfully extract all the needles. Afterwards, he carefully laid her down on the bed. After that, he looked over his shoulder for a moment and said, “I thank Alliance Head Yu for your assistance.”</p><br/><p>No one else would possibly be daring enough to barge into the rear court of the Prince’s manor. Song Jiaoyue was a man who observed the proprieties. He wouldn’t do such a thing no matter how worried he was. But Long Heng decided to forgive Yu Kuang this time around, because if not for the alliance head’s timely aid, he might not have been able to extract the needles in time, and they might have followed the blood flow to her heart and caused her death.</p><br/><p>“You love her?” Yu Kuang asked faintly, as though only asking if the prince had dinner yet. </p><br/><p>“……” Long Heng was a reserved person. He hadn’t even said those words to Bai Xiangxiu yet, let alone anyone else. And because of that, he furrowed his brows and replied, “It’s none of your business.”</p><br/><p>“If you don’t truly care about her, I will take her from you sooner or later.” Even if he didn’t, Yu Shū might do so as well.</p><br/><p>Just when Long Heng was about to explode with anger, Xiaoshi arrived with the doctor. Yu Kuang was surprisingly sensitive to the surroundings and had already taken his leave through the window. It was as though he had never even set foot in the room.</p><br/><p>Long Heng automatically stepped aside to make way for the doctor and stared anxiously at Bai Xiangxiu. She had yet to awaken. Why is she so pale? It seems like I must learn how to make her happy. Otherwise the anger might cause harm to her body. The doctor that arrived was the manor’s resident doctor. He sat down and took her pulse meticulously. He froze for a moment in surprise. He then nervously took another pulse to double check. Even though not much time had passed since he started, Long Heng was already drenched in cold sweat. </p><br/><p>Judging from the doctor’s expressions, Long Heng believed that something bad must’ve happened to Bai Xiangxiu. But he didn’t dare speak up for fear of disrupting the diagnosis. On the other hand, Xiaoshi was sobbing her heart out as she tugged on the bed curtains. Why is my mistress plagued with so many misfortunes? And now she’s injured by something and hasn’t awoken for half a day!</p><br/><p>Roughly fifteen minutes later, the doctor lifted his head up to say, “Madame Xiu will be fine. She just needs time to recuperate because of the overcirculation of her blood and qi.”</p><br/><p>“But does that have anything to do with the hidden weapon that I extracted out of her?” Long Heng had to gain a clear picture.</p><br/><p>“It’s possible. But it could also be caused by the bloodletting, which disturbed the fetus. She will need some miscarriage preventing medicine.” The doctor’s diagnosis was straightforward and to the point, because he knew that the prince didn’t like to speak to others very much.</p><br/><p>“Mmm.” After hearing the diagnosis, Long Heng breathed a sigh of relief. He didn’t think too much of it because Bai Xiangxiu had already told him that this doctor was involved in her fake pregnancy act. And thus, he believed that those two sentences were nothing but an act. But it was odd, there were no outsiders around, so why had the doctor felt compelled to put on an act?</p><br/><p>While he was busy playing catch up in his thoughts, the doctor had already begun writing down the prescription. Wait, why should she take any medicine when she’s perfectly fine? And thus, Long Heng asked, “What harm will the medicine cause to her body?”</p><br/><p>“In response to Your Highness, this is just an ordinary miscarriage preventing medicine.”</p><br/><p>“Doctor. There is no one else in this room. You will only need to prescribe the right medicine for her symptoms.”</p><br/><p>“In response to Your Highness, this medicine is absolutely appropriate for her symptoms!” Abruptly realizing that the prince might not be aware that Madame Xiu was already pregnant, the doctor quickly added, “Madame Xiu is truly expecting.” </p><br/><p>“Doctor…” I’ve already told you that there’s nobody else around. Xiaoshi is Xiangxiu’s personal handmaid. Moreover, she’s so timid so there’s no way she’d leak out the truth.</p><br/><p>The doctor had resignation written all over his face. Thus, he tried again with a serious expression. “Your highness. I am absolutely sure that Madame Xiu is pregnant.”</p><br/><p>Long Heng was stunned. His mind went completely blank. For some reason, the first reaction that surfaced in his mind was sheer and uncontrolled fury. “Tell me! Is she really expecting with my child!?”</p><br/><p>Clearly shaken, the doctor replied, “Yes, Your Highness.” Did the prince not want Madame Xiu to be pregnant with his child!? Then should the doctor prescribe saffron in the medicine instead of one that prevented miscarriage?! </p><br/><p>After hearing all this, Long Heng’s face became ice-cold. His tone was permafrost cold as he said, “Write the prescription down now!” Luo Yunzheng. Lin Qianzi. They’d almost caused the death of his unborn child! Sooner or later, he’d collect his due for that. The doctor was so frightened that he immediately began jotting down the prescription, and quickly ran off to concoct the medicine with his tail between his legs. In the end, he still didn’t know whether the prince truly wanted the child or not!</p><br/>\n</div>"}