{"title": "Chapter 191: Death of the Prince, The Female Lead Returns", "id": 191, "volume": 2, "url": "http://boxnovel.org/doomed-to-be-cannon-fodder-chapter-191-death-of-the-prince-the-female-lead-returns", "volume_title": "Volume 2", "body": "<h1>Chapter 191: Death of the Prince, The Female Lead Returns</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 191: Death of the Prince, The Female Lead Returns</p><br/><p>The old madame was very satisfied with Bai Xiangxiu’s behavior. Just as she was about to relax, her son burst through the doors. He obviously wasn’t here for a casual stroll or to look at the flowers. He was clearly only here out of concern for née Bai. Why is he so concerned about her? How can there be danger when she’s with me?</p><br/><p>But when she saw the way Madame Song was holding Bai Xiangxiu’s hand, the old madame immediately knew that her son must know something that she didn’t. That was why he was being so cautious. However, she couldn’t help but be rendered speechless when she saw how Madame Song was looking at Bai Xiangxiu. It was almost like she was staring at a rare and excellent delicacy. Realizing that the banquet was about to start, the old madame notified Bai Xiangxiu. “A mama will serve some food to you later. There are some dishes here that you cannot eat right now.”</p><br/><p>“I understand, Old Madame.” Why go through all that trouble? I already know what I can or cannot eat.</p><br/><p>“What is it? Do you have some food you can’t eat?” Madame Song asked while smiling.</p><br/><p>“Of course. She has a large list of prohibitions at the moment. Any food that might invigorate blood flow or food that are too yin in nature are all off-limits.” The old madame covered her mouth with her handkerchief and smiled joyfully. Her smile was so wide that even the wrinkles on her forehead seemed to have gotten deeper.</p><br/><p>Even though publicly announcing a three-month pregnancy was said to bring bad luck, every lady at that table clearly understood the old madame’s implication. They all immediately congratulated Bai Xiangxiu, embarrassing her greatly. The banquet thus began in a joyous mood. However, nobody noticed the killing intent hidden deep in Madame Lin’s eyes. Surprisingly, she was quite good at keeping her calm. Her priority right now was to redeem her family’s name, so she could suffer a little for now. </p><br/><p>Even though Bai Xiangxiu’s morning sickness was no longer as big of a hindrance as it was before, she was still sensitive to all sorts of odors. She started feeling unwell after just a few bites of food. After sending someone to notify the old madame, Consort Rong then had her servants escort Bai Xiangxiu from the banquet to rest.</p><br/><p>She had barely rested for more than five minutes at a nearby pavilion before a maidservant came up to her with a letter. Bai Xiangxiu was puzzled. Why would somebody send me a letter in Prince Rong’s manor?</p><br/><p>Could it be… Song Jiaoyue?</p><br/><p>Impossible. That man would always observe proper decorum. There’s no way he’d do something strange like this. She opened the letter to take a look. “Madame Xiu. See you in Prince Rong’s rear garden. I have something to ask.”</p><br/><p>The letter was actually sent by Lin Qianzi!</p><br/><p>It’s the female lead. Why did she return all of a sudden? Hasn’t she already eloped with Luo Yunzheng? I mustn’t meet with her. The last time I did, she’d nearly caused a miscarriage. Only an idiot would want to meet with her after the last time. Thus, she handed the letter over to Xiaoshi and acted like she hadn’t seen it. </p><br/><p>The messenger was unhappy when she saw what Bai Xiangxiu had done. After some careful thought, she spoke up, “That lady is very pitiful. Won’t you meet with her?”</p><br/><p>So it seemed that Lin Qianzi’s white lotus act wasn’t exclusively used on the male lead and the supporting male characters. She was clearly using it on the other members of the supporting cast as well.</p><br/><p>“How she is is none of my concern.” Bai Xiangxiu’s temper had been really bad lately. Why the hell would she be afraid of these lowly servants when she’d dared talk back to Prince Li himself?</p><br/><p>The servants from the Prince Rong Manor quietly backed away, not daring to press the matter. They took their leave, and went to inform the pitiable lady that Bai Xiangxiu wasn’t going to meet with her. However, they didn’t foresee that the pitiable lady would grow enraged after she heard the response. She began to weep, “Good… very good. She dares treat me like this? Good… They killed him. I must have revenge… revenge…” </p><br/><p>Lin Qianzi had gone insane. She stormed into Bai Xiangxiu’s rest area to personally meet the concubine. Bai Xiangxiu had just finished vomiting at that moment and was just about to make her way back to the manor. However, Lin Qianzi suddenly appeared and charged towards her. Unbridled fury colored her voice as Lin Qianzi shouted, “Bai Xiangxiu! Why are you afraid to see me? You slut! It was all your fault! He came to find you, but the both of you murdered him when he came to see you!”</p><br/><p>“Murdered? Who?” Duan Yunying’s murder immediately came to mind. As a matter of fact, she’d seen his gruesome murder with her own eyes. When that scene began to rise in her memories, she couldn’t help but feel the urge to vomit rise yet again. She held her hands over her mouth and began to retch.</p><br/><p>Lin Qianzi followed up, “There’s no need for you to put on a piteous act. Summon that murderer named Long Heng! Was loving you such a sin that it justified murder?!?”</p><br/><p>“What? Blarghhh…” Bai Xiangxiu truly vomited this time. This one though, she believed, came from her disgust for Lin Qianzi. Your mother. Is her brain wired differently or something? When did that man ever say that he loved me? And why does she think that Long Heng would murder him for that reason alone? Is there a hole in your brain? How do you manage to come up with such absurd things?</p><br/><p>The old madame and the other ladies had already finished their meals and were on their way to the pavilion. They were chatting as they walked, and came onto the scene as Lin Qianzi screamed at Bai Xiangxiu. Across from the former, Bai Xiangxiu was clutching her chest with her hands, her complexion ashen. </p><br/><p>Bai Xiangxiu and Lin Qianzi were currently worlds apart in terms of their outer appearances. Bai Xiangxiu looked delicate and pitiable, dressed in simple but luxurious clothes. As for the eldest daughter of the Lin family, she now looked like she had gone insane. Her hair was messy, and her complexion as pale as a ghost. Even her silky-smooth, fair face now looked a bit little rough around the edges.</p><br/><p>Madame Lin was devastated when she caught sight of her daughter’s current state. She immediately ran up to her and hugged her tightly. “My daughter! What have you been through to end up looking like this? It hurts mother so to see you this way!”</p><br/><p>Sadly, Lin Qianzi pushed her mother aside and said, “Don’t get in my way. I want to avenge him.”</p><br/><p>“Is that man dead? He deserves to be killed!” Madame Lin vented. That man had dared kidnap her daughter. The heavens were indeed just.</p><br/><p>“No. It’s not him. It’s Duan Yunying. Long Heng murdered Duan Yunying. He…”</p><br/><p>“Shut your mouth!” Madame Lin quickly interrupted her daughter. Since Duan Yunying was her daughter’s teacher, she naturally knew who he was. She also knew that they had had ambiguous relations, but why would her daughter bring it up in front of so many people? Was her reputation no longer important to her? Moreover, why would that man be murdered all of a sudden? What was going on?</p><br/><p>The old madame scrunched up her forehead as her voice turned graved, “Watch your words, Miss Lin.” Was she trying to smear the good name of the Prince Li Manor?</p><br/><p>Her words served as a reminder for Bai Xiangxiu as well. Why had she suddenly gained another admirer all of a sudden? If word was to spread, wouldn’t she end up in exactly the same spot as the female lead?</p><br/><p>She didn’t want to be known as the men’s lady, so she immediately hid her face behind her hands and started crying. “This concubine has only seen Sir Duan once when I’d accompanied His Highness to the Red Maple Mountain Villa. Miss Lin, what would you gain from slandering me like this?” She had no choice but to redirect attention back to Lin Qianzi to avoid suspicion. Being slandered for doing something she hadn’t done truly felt awful. </p><br/><p>“If he doesn’t like you… Then why would he…” ignore me? Lin Qianzi somehow managed to swallow her words before they landed her in trouble. Undeterred, she followed up with, “Then why would he stare at you during my wedding?”</p><br/><p>Bai Xiangxiu could feel her brain shrink. She then carefully replied, “Then who should he have stared at?”</p><br/><p>Lin Qianzi was at a loss for words after she heard that impartial sentence. Lin Qianzi could only glare at Bai Xiangxiu with eyes that were red throughout, as if she had suffered a great insult. </p><br/><p>Even though the novel mentioned time and again how you love everything and everyone, isn’t your heart a little too wide for your own good? Why would you come back to ask about Duan Yunying when you’ve already eloped with Luo Yunzheng?</p><br/>\n</div>"}