{"title": "Chapter 193: Birth of the Young Prince", "id": 193, "volume": 2, "url": "http://boxnovel.org/doomed-to-be-cannon-fodder-chapter-193-birth-of-the-young-prince", "volume_title": "Volume 2", "body": "<h1>Chapter 193: Birth of the Young Prince</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 193: Birth of the Young Prince </p><br/><p>The bulge on Bai Xiangxiu’s stomach had grown to the point where it had begun to hinder her regular movements. The old madame was so happy that her eyebrows disappeared into her hairline everyday from all her smiling. Every so often, she’d visit Bai Xiangxiu to see her unborn grandchild. She would come so often that it was making Bai Xiangxiu anxious.</p><br/><p>One must understand that during this kind of time period, it wasn’t very appropriate for the old madame of a household to visit a concubine so often. However, the old madame was only here to see her grandchild, so Bai Xiangxiu couldn’t possibly decline her visit. Furthermore, the old madame was already getting on in her years, and there wasn’t much more left that she desired. </p><br/><p>Well, she can visit all she wants. I have nothing to hide anyways. After sending the old madame off, Bai Xiangxiu began to gently caress her stomach. He’s so restless these days. Every so often, I can feel him kicking and nudging inside.</p><br/><p>Long Heng said that he’s an innate general. He even said that he’ll teach him some martial arts after he’s born.</p><br/><p>He’s already made plans to torture my son before he’s even born. Bai Xiangxiu let out a soft sigh. How was she supposed to leave this all behind when all she could do was worry about a new issue every day? She was worried about her child. Even though the gender was still a mystery, she couldn’t help but feel pity for him. Her child was going to be motherless immediately after birth. Will he be bullied? What if his stepmother is a calculative bitch? What if she feeds him poison from a young age and turn him into a cripple? Or even kills him when he grows up? So many things might go wrong! </p><br/><p>“What are you thinking of?”</p><br/><p>“Promise me you won’t wed another woman. Alright?” Bai Xiangxiu said agitatedly as she turned around and tugged on Long Heng’s collar. </p><br/><p>Long Heng noticed that she seemed to be extremely disturbed by something. He held her hands tightly and did his best to reassure her . “Of course. I will not marry another woman. Don’t be so agitated.”</p><br/><p>“You promised me so easily. You must be lying! You’re going to marry again and that evil woman will treat my son harshly because he’s concubine born, and thus will always be a step lower than her own children.” This problem had been eating away at Bai Xiangxiu lately. However, she’d suppressed it because they’ve never been treating her child as if it was concubine born. However, she was still a little uneasy about it, which was why she spoke up.</p><br/><p>Long Heng caressed her anxious little face and said, “That won’t happen. I will kick them all out if they dare try. Don’t worry, nobody is going to harm our child.”</p><br/><p>Bai Xiangxiu was visibly calmer after hearing his words. However, she was still stricken with guilt for wanting to return home and leaving Long Heng by himself. She hesitated for a moment and continued, “Long Heng, I will allow you to marry another woman, but can you search for someone who is kind and gentle? Someone who would never harm our child? Pay attention to what is happening at home after that too. Don’t immerse yourself with work and let our child be brought up by others.”</p><br/><p>“Xiu’er, What’s wrong?” Why does it sound so much like her last words? Long Heng had an extremely bad feeling about things. He suddenly gave Bai Xiangxiu a hug and caressed her head. “Stop having such foolish thoughts.”</p><br/><p>Bai Xiangxiu nodded her head. How can I not entertain such thoughts? She soon felt some discomfort in her stomach again. She caressed her stomach, “He’s being naughty again.”</p><br/><p>Long Heng caressed her stomach tenderly as well, but Bai Xiangxiu responded by wincing in pain. She bent her back a little and began to groan from the pain.</p><br/><p>“Xiu’er…”</p><br/><p>“It hurts.”</p><br/><p>Noticing that something was wrong, Long Heng immediately cradled her in his arms and broke into a sprint. “Summon the midwife! Hurry! Stop standing around!” It didn’t matter if she really was in labor or not, summoning the midwife was definitely not the wrong decision. Surprisingly, Long Heng’s instincts were on point. The midwife immediately recognized the signs that Bai Xiangxiu was going into labor. The entire manor fell into chaos in the blink of an eye. The old madame and Long Heng were sweating buckets as they waited anxiously outside.</p><br/><p>“Heng’er don’t be so anxious. Every woman has to go through such an ordeal…”</p><br/><p>“Ahh! It hurts…!!”</p><br/><p>“Every woman?” That was actually a scream of horror right? People made the same sounds when they were being murdered.</p><br/><p>“Y-yes!” The old madame comforted Long Heng and asked him to take a seat. However, she could clearly see the veins pop out on Long Heng’s forehead. It was obvious how nervous he was feeling.</p><br/><p>Bai Xiangxiu stopped screaming after a while. After all, labor pains normally came in pulsating waves. It wasn’t unbearable all the time.</p><br/><p>But Long Heng didn’t know that. In the heat of the moment he said, “Why did she stop screaming? Send someone in to take a look.”</p><br/><p>“Do you think she’d be in constant pain? Wouldn’t all women die from pain if that was the case? Sit down. Don’t be so nervous.”</p><br/><p>“Is that so?”</p><br/><p>“Yes.”</p><br/><p>Long Heng had only sat down for a moment before he jolted to his feet again from the renewed screaming. Suddenly, one of the midwives exited the room. He immediately inquired, “How are things?”</p><br/><p>“Madame Xiu is exhausted. I’m on my way to retrieve a few slices of ginseng.”</p><br/><p>“What slices of ginseng? Just take the whole thing.”</p><br/><p>“Yes, yes.” How is the mistress supposed to chew on a whole ginseng? And yet, she had no choice but to follow the prince’s orders. Bai Xiangxiu was soon wordlessly biting down on a whole piece of ginseng like a dog. Wow. Isn’t he being such a great help. However, biting on the whole ginseng was surprisingly effective as well. </p><br/><p>It’s okay. At least I can slurp up some of the ginseng juices. It feels surprisingly good, all things considered. The only thing she’d complain about was the taste of the ginseng.</p><br/><p>Since she had been suffering from the woes of birth since early noon, Bai Xiangxiu had expanded all of her energy by nightfall. When she was about to begin thinking of her dying words, the child that had caused her so much suffering was finally born.</p><br/><p>She could feel her entire body grow lighter. Her soul seemed to have returned to the modern world. It seemed like she was being lifted onto an ambulance. Her co-workers from the horticulture club was right beside her trying to explain to the paramedic what had happened. What?! I didn’t faint because I was staring at my phone! I’m a very professional employee alright? I don’t even normally look at my phone when I’m working!</p><br/><p>The paramedic even added, “Young people these days. Their phones are more important than their own lives.”</p><br/><p>“I didn’t faint because I was staring at my phone! Alright?” Bai Xiangxiu yelled out of nowhere. Everyone was greatly startled by her sudden yell. The paramedic then said, “The patient has regained consciousness. Inform the hospital for emergency treatment.”</p><br/><p>All of a sudden, her consciousness was pulled away by the sound of a baby crying. Bai Xiangxiu exhaled deeply and slowly opened her eyes. Why was everyone surrounding her? Why was Long Heng here as well?</p><br/><p>“Xiu’er, wake up… Please wake up…” Long Heng could feel his entire body turn ice cold. The bad premonition he had felt earlier had come true. Bai Xiangxiu had immediately stopped breathing after her child had been born. The midwives were shocked to death when they noticed. Disregarding the saying that men shouldn’t enter the delivery room, he’d charged right in and arrived at Bai Xiangxiu’s side in one strong leap. Is this going to be the last time I’ll get to see her?</p><br/><p>When he laid eyes on Bai Xiangxiu, whose complexion was now as pale as a sheet and whose blood had drenched the bed, his mind came to a halting, blank stop. He was on his knees while holding Bai Xiangxiu’s hand, hoping that it was all only a dream.</p><br/><p>The doctor was administering acupuncture with wildly trembling hands. He knew that everything he was doing was going to be for nought. Her breath had already left her body. All of a sudden, the child began to wail loudly, despite not making a sound even when he was born. His wailing dragged everyone’s mind and soul back to reality, including his mother.</p><br/><p>The movement of Bai Xiangxiu’s hand snapped Long Heng from his daze. He immediately held her hand tightly and frantically said, “Xiu’er… Xiu’er! Are you awake?!”</p><br/><p>“Ouch! Who’s stabbing me with a needle?” Why does it feel like I’ve been stabbed by a needle on my face and on my arm?</p><br/><p>“Doctor. Quickly pull out your silver needles.”</p><br/><p>“Understood.” The doctor was trembling from head to toe when he removed the needles. How could she possibly return to life when she’d stopped breathing? He’d never seen such a thing in his life.</p><br/><p>“Xiu’er, do you feel uncomfortable anywhere? Doctor. Check her body to see if there’s any medicines you need to prescribe immediately.” Long Heng was weeping for joy. He was so moved that his hands were trembling as well.</p><br/>\n</div>"}