{"title": "Chapter 200: Guerilla Warfare, Deep Behind Enemy Lines", "id": 200, "volume": 2, "url": "http://boxnovel.org/doomed-to-be-cannon-fodder-chapter-200-guerilla-warfare-deep-behind-enemy-lines", "volume_title": "Volume 2", "body": "<h1>Chapter 200: Guerilla Warfare, Deep Behind Enemy Lines</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 200: Guerilla Warfare, Deep Behind Enemy Lines</p><br/><p>Long Heng was currently staring at the moon because he was having difficulty sleeping. He’d promised Bai Xiangxiu that he’d be back within half a year, but he’d faced a big crisis in his first skirmish. He’d been brainstorming plans to counter the chained horses formation, but it really was quite difficult. He prayed that Bai Xiangxiu wouldn’t worry, because he wasn’t really in any danger despite the grimness of the situation. Food was not an issue since he had the underground tunnels that supplied food. All he needed to do now was find a way to defeat the chained horses formation. However, it was a daunting task. He couldn’t come up with anything useful even after a few days of research.</p><br/><p>But for some reason, he had a feeling that Bai Xiangxiu was nearby, and that she was getting closer to him by the minute. “Xiu’er…” He began to smile while stroking the fragrance pouch she’d previously given to him. The handiwork wasn’t the best, but he liked it all the same. He kept it by his side at all times.</p><br/><p>With just ten miles separating them, Bai Xiangxiu was now beginning to see the outline of Tranquil City. The enemy territory was right in front of Tranquil City. The enemy nation had actually conquered the city before, but it had been claimed back by Long Heng. It was when he’d decided to go on the offense that he’d encountered the chained horses formation.</p><br/><p>Bai Xiangxiu and the others were camping for the night. Song Jiaoyue had decided on infiltrating the enemy camp to gather intelligence about the chained horses formation.</p><br/><p>“I will go too.” I want to see for myself if it’s the same thing as the linked horses formation that I so often see in television shows. Song Jiaoyue had no choice but to bring her along. Yu Kuang naturally tagged along as well. Among the three, two of them had exemplary qinggong skills. They took turns carrying Bai Xiangxiu towards the outskirts of the enemy camp. There were some close calls, but they made it there safely in the end.</p><br/><p>Song Jiaoyue said, “We cannot proceed any further. There’s likely a shroud of poison mist in there.”</p><br/><p>“Don’t worry. I have an antidote. It provides immunity to almost every commonly known poison.” Yu Kuang poured out three pills from a bottle. He then escorted Bai Xiangxiu into the poison mist, leaving Song Jiaoyue to scout ahead. If the enemy were to be alerted of their presence, the two at the back would have more time to escape. There was no need to worry about Song Jiaoyue, as common foot soldiers would never be able to block his escape. However, their movements were highly unconventional. They were trying to make their way to the horse stables instead of the main camps. </p><br/><p>The stable was guarded by a surprising number of soldiers. Since he was too far away to identify anything, Song Jiaoyue decided to sneak in, knocking two guards out by tapping their acupoints. Song Jiaoyue signalled for the other two to come over when the coast was clear and they entered the armory together. There was a possibility that they might be able to come up with a plan if they took a closer look at the armor and weaponry.</p><br/><p>Bai Xiangxiu and Yu Kuang immediately noticed the horse armor when they entered the armory. It was made entirely of metal and seemed very heavy. A metal chain with reverse spikes hung between each suit of armor. No wonder the formation was so powerful. </p><br/><p>When the horses were armored and lined up in formation, anyone in its path would either die from the collision or be trampled to death. What a gruesome method of killing. Bai Xiangxiu thought hard while frowning. She realized that it was very similar to the linked horses formation, especially since the calves of the horses were not protected by armor. This was likely its Achilles heel. Upon that realization, a smirk began to form on her face. She was determined to help Long Heng defeat the linked horses formation. </p><br/><p>While she was still caught up in her thoughts, she suddenly heard a commotion outside the stable. One of the men said, “Lord Strategist! What are you doing here so late in the night?”</p><br/><p>“This place is very important. Don’t let anyone detect this place.”</p><br/><p>An elderly voice accompanied a man and his followers as they walked in. Fortunately, they didn’t notice that the two guards outside had been struck on their acupoints. </p><br/><p>“Not good.” Song Jiaoyue quickly extinguished the torch and hid in a dark corner. Yu Kuang also dragged Bai Xiangxiu to hide with him in another corner. However, they’d forgotten that the strategist was also a martial arts expert. While he might not be able to notice the presence of other experts, Bai Xiangxiu’s presence was as clear as day.</p><br/><p>He immediately noticed her presence when he entered the room. “Who’s there?!”</p><br/><p>Yu Kuang was prepared to jump into battle, but Bai Xiangxiu held him down. She then pulled out her hair and pulled down her robe a little. She walked out slowly and fell to the ground with a loud thud. “Please spare my life, sir! This lowly girl has made a mistake by trespassing! I was simply too hungry!”</p><br/><p>He will surely notice my exquisite looks if he’s that renowned old lecher. Bai Xiangxiu was unrivalled in looks in the entire novel. She had no doubt that he would fall for her tricks. Moreover, she was sure that she seemed delicate and pitiful after messing up her appearance.</p><br/><p>Song Jiaoyue’s hand was trembling. What is she trying to do?</p><br/><p>As expected, the strategist noticed her exceptional good looks through the illumination of the torches. Even though her hair was messy and she was wearing men’s clothing, it didn’t do a thing to hide her beautiful looks.</p><br/><p>His love for beautiful women was one of his biggest shortcomings. He had a tendency to bend over backwards just for the sake of beauties. Yet, his feelings were more akin to appreciation and admiration for beauty rather than just lust. He would try to forge a deeper connection with them but wouldn’t force himself unto them if they rejected his advances. He would certainly try very hard to meet their demands and requests. </p><br/><p>He believed that the woman in front of him was definitely worthy of such a relationship. He would be able to die without regrets if he could sleep with her. “Oh? that’s no good. My men will get some food for you right now.”</p><br/><p>“Many thanks to you, kind sir. If I may, what is this place?. I couldn’t see very well as it’s been too dark outside.”</p><br/><p>“This is an army camp. Where are you from?”</p><br/><p>“I’m from Shu County. Army camp…? Wait, isn’t that… This lowly girl begs for mercy! I didn’t trespass on purpose!” Bai Xiangxiu fell onto her knees and began to bawl her eyes out. Her acting skill was an truly eye-opener for Song Jiaoyue and Yu Kuang. It was such a waste that she wasn’t an actress. Such talent! However, what was her purpose for doing such a thing?</p><br/><p>How could the strategist bear to see a beauty bawl her eyes out like that? He quickly said, “Don’t worry. No one else is here other than me. I will ensure your safety.”</p><br/><p>“But… They…” She glanced pitifully at the two guards behind him.</p><br/><p>“Leave. Both of you. And go grab some food for this young miss over here. Don’t tell anyone about this.” It truly wasn’t a very good move to hide a woman from the enemy nation in the army camp.</p><br/><p>Song Jiaoyue was at a loss for words. Did the strategist knock his head into a wall when he was a child? Why would he send his bodyguards away without even an ounce of suspicion after just two words from her? He had left himself wide open by doing such a thing! There was now a clear opportunity for an assassination! Bai Xiangxiu was not as simple as she seemed. She was clearly trying to rid Long Heng of a strong foe.</p><br/><p>It was a pity that she had to sacrifice her dignity and looks to do such a thing. But, not every woman could do so for a cause like this. Her actions were truly praiseworthy. </p><br/><p>Yu Kuang was a man from the wulin. His blood began to boil when he saw such sacrifice. To him, Bai Xiangxiu was discarding all of her dignity for the sake of the greater good. I expected no less from the woman that Yu Shū has chosen. She’s not to be belittled. </p><br/><p>Bai Xiangxiu then acted like she had gone weak in her knees after the bodyguards had left the room. The strategist immediately came over to help her up. Yu Kuang and Song Jiaoyue were on edge, but they both understood that this wasn’t the time to strike. He was too close to Bai Xiangxiu. </p><br/><p>Bai Xiangxiu thanked him incessantly after rising. She walked into a corner and sat down. She asked fearfully, “What is this place?” </p><br/><p>“An armory. Why don’t you come to my tent after having some food? This place isn’t suitable for a beauty like you to stay for long.” </p><br/><p>“This girl is undeserving of your praise. Eh? What is that? It’s so shiny!” Bai Xiangxiu distracted him with one hand while making hand gestures with her other hand behind her.</p><br/><p>Hey everyone!! We officially have 93 chapters left of DCF, which means the novel will be over in three short months! Thank you so much for being along for the ride, and for your wonderful, amazing support! </p><br/><p>I’d (etvolare) like to take a moment to thank the team so far, which you might be unfamiliar with if you usually skip the announcement posts! </p><br/><p>Clocking in at ~30% of the novel, it’s our new translator mycyan! Please support his new novel when he starts it after DCF! A wave and holler from etvolare next for being in charge of ~26% of the novel. Dearest Ruyi has brought us a wonderful 20% of the novel, and Mehxistence ~10% of the novel. Special thanks to Timebun, Grace, Grenn, and GZ for also pitching in on the chapters!</p><br/><p>Immense thank you to Deyna (my much abused editor for GDK, SOTR, aaaaand DCF) for editing all of the chapters, even when he was studying for the GMAT! Another wave from etvolare as master TLCer that checks each chapter for accuracy and consistency. *bows* Please leave us a review and rating on NUF if you feel inclined to share the love!</p><br/>\n</div>"}