{"title": "Chapter 211: The Great Battle, Defeating The Chained Horses Formation", "id": 211, "volume": 3, "url": "http://boxnovel.org/doomed-to-be-cannon-fodder-chapter-211-the-great-battle-defeating-the-chained-horses-formation", "volume_title": "Volume 3", "body": "<h1>Chapter 211: The Great Battle, Defeating The Chained Horses Formation</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 211: The Great Battle, Defeating The Chained Horses Formation</p><br/><p>How could she afford to have that weakness during this crucial time? Bai Xiangxiu grabbed onto the railings to see her man lead the charge. He wore a full suit of armor, and was leading the charge personally, fearless in battle. His presence alone was a great comfort to his men. Every great generals likely had the same aura like him. It was the charisma that allowed them to lead men into battle, to give their deaths a meaning.</p><br/><p>The chained horses formation did not take long to appear. Bai Xiangxiu was confident in her analysis. This formation was indeed similar to the linked horses formation that she knew of. She prayed that they’d find success in breaking the formation, and that Long Heng would make it back safe and sound.</p><br/><p>“Don’t worry. I’m just here to feel the breeze. I’ll return once the formation is broken.”</p><br/><p>“Mm. Then this servant will accompany you.” It took a lot of courage for a woman to stand there during a battle, but there she remained, motionless without even the slightest hint of fear, even when stray arrows flew by and even struck a soldier right beside her. Only then noticing that her neighbor had been struck by an arrow, she decided to move from her spot and help carry him away. She had a serious expression on her face the entire time.</p><br/><p>“Shu’er, stop standing there like a rock. Take him to a doctor to seek treatment. Grab some medicine while you’re there as well. This way, we can minor injuries on the spot.”</p><br/><p>“This humble servant understands.” Their master and servant relationship was no longer as stiff and formal like it’d been in the manor. Shu’er had gotten used to helping with things and carrying out her commands. A general’s squire was almost always useless in a battlefield, but he had realized that even if there was no place for him on the battlefield, he could still do so much more. Madame Xiu was doing so many things to aid the war effort even though she was a woman. A man like him would be ashamed of himself if he were still to hide away like he had done before. </p><br/><p>Likely because they were running around helping with the war effort while wearing commoner’s clothes, some of the young men from the city were inspired to help too. They too volunteered to help transport items, deliver water and food, etc.</p><br/><p>Long Heng never wanted the citizens to have a part in this war. After all, who were the soldiers supposed to protect if the citizens were all injured or dead? But on this day, they were all like-minded people who wanted to defeat the enemy troops. They’d be able to open the city gates again and would no longer have to die of hunger within the city walls.</p><br/><p>Both sides began beating their war drums as the two armies geared up for their clash. Bai Xiangxiu leaned against the city walls to look down onto the battlefield. Long Heng had moved to the back while the specially trained troops now took the front. Scythe in hand, the special troops began to march forward in unison. The armored chained horses too began a slow inexorable trot towards the troops. The situation looked grim; it almost looked like their only fate was to be trampled beneath the hooves of the armored horses.</p><br/><p>However, there wasn’t even a hint of fear on their faces. Forming horizontal lines, they began to charge towards the horsesr. They looked almost like the formal Chinese character for the number one 1 when looking down from the city walls. Their uniformity was mind-boggling. The discipline that these soldiers possessed wasn’t something one could just scoff at. It was a sight deserving nothing short of marvel and wonder. Not even a single soldier was breaking ranks! If even one soldier made a mistake, the entire troop would be fated to death! However, they didn’t show fear, nor did they cower.</p><br/><p>Good luck! Bai Xiangxiu’s hands turned white as she gripped the walls tightly. Right before the two armies met, the special troop soldiers dropped to their knees and brought their scythes forward in a horizontal sweep. No one expected such a move, and it was far too late to stop the horses. A deluge of blood descended on the front lines as the whole first rank of armored horses had their legs sheared off. Her mouth twitched involuntarily. She’d just realized that she’d caused the death of countless horses. However, it was either the horses or them. She had had no choice.</p><br/><p>Just as Bai Xiangxiu predicted, the cavalry troops came in wave after wave. The second wave of cavalry couldn’t halt in time as the first wave fell victim to the scythes. Thus, the first wave suffered atrocious casualties from the back as both horses and humans were trampled. The formation dissolved into shambles as the third wave desperately ground to a halt to avoid trampling the second wave. The scythe-wielding soldiers easily leaped over the carcasses of the first wave, decimated the second wave while they were still confused, and attacked the third wave with vigor. Their long curved blades easily slipped past the horsemen to dislodge them from their seats, sending them tumbling to their death.</p><br/><p>“It’s done! The formation is broken!” Bai Xiangxiu yelled excitedly. The soldiers on the city walls all roared excitedly too. “Yeah! It’s broken! Scurry back with your tails between your legs!” The drummers began to drum with more vigour as well, causing the soldiers to fight with more fervour. It couldn’t be helped. It had taken a long while, but they’d finally defeated the formation. They were absolutely elated.</p><br/><p>Commander Lu never would have imagined that the formation that he’d painstakingly prepared would be so easily defeated. He decided to order a retreat; he had to save what was left of his elite troops. But just as he stood to send the order, news came of a strike force attacking his rear. Another troop, lead by a jianghu man, was charging straight into . He was jumping high and low, without even a semblance of the pattern normally seen in a battlefield. He somehow made it to the front and cut down wave after wave of the army, like a hot knife through butter. How is this possible?</p><br/><p>Commander Lu was a very capable commander as well. He quickly organized his army and ordered a retreat. They travelled back a hundred miles before he finally felt safe enough to make some adjustments. He’d lost seven out of ten men when he took a count of their numbers. The chained horses cavalry had been annihilated. Although Commander Lu had ordered a retreat, their enemies were in hot pursuit. It would only end in death if their enemies caught up.</p><br/><p>They could only retreat in a straight line because they couldn’t split up. But this also meant that it’d be very easy for their enemies to catch up to them. Long Heng had trained his soldiers himself. They were very mobile troops, comparable to cavalry in terms of speed. Therefore, the enemy was all hunted down within four hours.</p><br/><p>Long Heng never imagined that the clash would be so one-sided. He also knew to never pursue an enemy at bay. His first thought after sounding the horn for retreat was to run to Bai Xiangxiu’s and tell her that they’d won!</p><br/><p>A familiar silhouette was squeezing through the cheering crowds after he entered the gates and ran towards him with blazing speed. However, she ground to a halt when she noticed that it was a little inappropriate to hug him while wearing male clothing. But she wasn’t able to stop in time and charged into his arms. Long Heng instinctively reached out to support and raised a cupped fist salute to her in front of all the soldiers, “Many thanks to Strategist Bai for your assistance in defeating the enemy and bringing glory to our country!”</p><br/><p>“Ah?” What are you playing at? Everyone was treating Long Heng like a god since he was the one who led them to battle and defeated the fearsome chained horse formation. However, they began to cheer for Bai Xiangxiu too after hearing how he’d praised her. “Glory to our country!” Bai Xiangxiu blushed because of their chants. She secretly pinched Long Heng, but she was still surprisingly moved by their cheers.</p><br/><p>So it turned out that a woman didn’t need be constrained within the tiny rear court. Even though it was a prince’s manor, it was still much smaller compared to a place like this. There was a plenty of casualties and injuries after the battle. Long Heng assembled a team to chase after the remainder of Commander Lu’s army. He was also readying his ready for the next battle, and they would continue until they reach the enemy nation’s capital.</p><br/><p>The rations arrived on the next day and so did Ah Quan. He felt very uneasy when he saw Long Heng and knelt down to beg for forgiveness. Long Heng hadn’t taken anything to mind as he had no feelings for the third madame. Instead, he was happy that Ah Quan had helped Bai Xiangxiu in her journey and assembled some of the local citizens to come and help. There was nobody more familiar with the enemy country than the citizens of Shu County. The hunters were especially familiar with them. They even had some indigenous method to get rid of the enemy nation’s parasite toxin.</p><br/>\n</div>"}