{"title": "Chapter 213: Terrible Luck, Locked In the Dungeons", "id": 213, "volume": 3, "url": "http://boxnovel.org/doomed-to-be-cannon-fodder-chapter-213-terrible-luck-locked-in-the-dungeons", "volume_title": "Volume 3", "body": "<h1>Chapter 213: Terrible Luck, Locked In the Dungeons</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 213: Terrible Luck, Locked In the Dungeons </p><br/><p>Not only was she a beauty, but she also had a stellar reputation. She was the typical example of a married woman of a good family. He had always been the most interested in these types of beauties. He didn’t feel a thing when they were too easy, no matter how alluring they were. Most importantly, she was Long Heng’s woman. Although that man was ice cold and overbearing, he was also very formidable. Chen Tao wasn’t sure if Long Heng had broken this sweet, delicate beauty with his playing yet. They were clearly in the middle of a battle, yet Long Heng had brought her along. No wonder he wasn’t interested in any of the local women. Of course, he had a woman for his own personal use. Now that he paid closer attention to this strategist, even men’s clothing couldn’t hide how elegant she lookeds. How could he have failed to detect her as a woman till now? Most likely, it had something to do with her sloppy appearance. But today, she was rather clean and tidy, so her feminine beauty slipped through her masculine facade.</p><br/><p>“I wonder who spewed those false accusations to you?” Bai Xiangxiu denied everything, but was curious to know who had told on her. She didn’t think he would tell her so easily. But unexpectedly, Chen Tao crooked his finger towards the interior and a beautiful woman came out. Although her makeup was thick, Bai Xiangxiu instantly recognized Lin Qianzi. It seemed that Lin Qianzi had rid herself of her previously weak and delicate appearance as she walked out in a stunning outfit. How did a white lotus flower turn into a devilish queen? Besides, wasn’t she imprisoned? How did she escape? </p><br/><p>Bai Xiangxiu was confused by the current Lin Qianzi. Lin Qianzi went so far as to walk up to Chen Tao alluringly and curtsey charmingly to him. “Guard Captain Chen.” </p><br/><p>“Please rise, Miss Lin. This is the Madame Xiu you were talking about, correct?”</p><br/><p>“Yes. I would know her even if she’d turned into smoke.” </p><br/><p>“Good. What else do you have to say for yourself?”</p><br/><p>“Regardless of who I am, coming to Tranquil City was my idea. It has nothing to do with Prince Li.”</p><br/><p>“Servants, take Madame Xiu to the dungeons and wait for Prince Rong to make the final decision.” Chen Tao was very excited. He’d finally managed to seize Long Heng’s weakness. If this wasn’t enough for him to destroy the prince, his surname wouldn’t be Chen! </p><br/><p>Bai Xiangxiu found the female lead to be extremely despicable. She’d actually chosen to use this type of method to get revenge on her! “A moment. I have something I need to say.” She halted her steps and turned around to look at the vindictive female lead, “I’ve always wanted to ask, do you actually have a brain? Let’s temporarily ignore the fact that we’re enemies. Can it be that you can’t tell the difference between the country’s enemy and your own personal enemy? Long Heng will be going into battle very soon. He is trying to protect our country, the home you live in, yet you still want to do him harm. Do you want to see our nation broken in defeat, and for you to then become a military prostitute for the enemy? Do you honestly think your parents will be able to remain so cheerful and free if something happens to our country? Long Heng is the one who is fighting to protect your high position and wealth, even going so far as to put his life on the line. Yet, you want to bring down the whole nation with you for some petty personal grudges!”</p><br/><p>Lin Qianzi was stunned by Bai Xiangxiu’s words. Even Chen Tao off on the side was affected. He had never seen a woman make so many high level arguments while still being ruthlessly insulting. </p><br/><p>“Also, you. Let’s leave her out of it, how can you be so petty? Do you think Long Heng wants to steal your position? He is a prince! After the war, his place is at the capital! Do you think he cares cares if you want to be the local tyrant here? Perhaps, do you have the confidence to repel the enemy troops by yourself, and you have no need for his assistance? It’s certain that the enemy troops would sack your city the moment Long Heng leaves. And at that point, you have but two choices, Die or surrender. You can choose whichever path you want then. But regardless of what you choose, how are those choices any better than now? Yet, you want to take down Long Heng and be the sole person in charge. Do you think you have that ability? If you’re not convinced, let’s give it a try, no? Long Heng can return to the capital, and we’ll leave Shu County in your hands. You can face the enemy troops. We’ll see who goes crying for help later!” Bai Xiangxiu was finished, but she didn’t allow them to get a word in edgewise, “Alright. I’m done. Go and reflect on what you’ve done, you brainless people. Don’t make me feel like I’ve been talking to pigs the entire time. What a waste of breath.” </p><br/><p>Poisonous. Absolutely poisonous. How can a woman speak such malicious words? She heard Lin Qianzi start shrieking as soon as she left, “Bai Xiangxiu, I’ll make you wish for death!”</p><br/><p>“Pssh. As expected, she doesn’t use her brain.” Bai Xiangxiu didn’t care at all that they were leading her to the dungeons, and kept her stare fixed on the floor ahead of her feet. However, the soldiers suddenly halted, staring warily ahead of them. It appeared that danger was near. Bai Xiangxiu raised her eyes and saw Song Jiaoyue and Yu Kuang blocking the way. They must have rushed over once they heard something had happened to her. “I’m fine. Please tell Long Heng to be careful.”</p><br/><p>Bai Xiangxiu smiled indifferently, but deep down, she was very concerned that Long Heng would be punished. Army regulations were extremely strict. Yu Kuang wanted to act, but Song Jiaoyue stopped him. Those from the jianghu were truly too rash. This was an army camp! They had no choice but to watch her be imprisoned. Song Jiaoyue’s voice was hard, “I am going to notify Long Heng. You must keep her safe.”</p><br/><p>“Alright.” Yu Kuang followed them down in a flash. However, he couldn’t enter the dungeon openly. The only way he was able to get close to Bai Xiangxiu was through a tiny window. This particular dungeon wasn’t well maintained, so the stones were gloomy and the cells cold.</p><br/><p>Bai Xiangxiu wrapped her arms around herself the moment she entered. It will be very difficult to rest in here. Someone suddenly tossed a cloak through the small window. She caught it and heard Yu Kuang, “I will be guarding you from the outside. Don’t worry. But what is their reason for locking you up?” </p><br/><p>“MIss Lin revealed that I am female. Therefore, Chen Tao is using me against Long Heng.”</p><br/><p>“Do you want me to kill her?”</p><br/><p>“I don’t believe you would kill a woman who doesn’t know martial arts.”</p><br/><p>“No, but if she hurts you, I will definitely make a move.”</p><br/><p>“Yu Kuang, thank you.”</p><br/><p>“I’m sorry.”</p><br/><p>“Ah? Why are you apologizing all of a sudden?”</p><br/><p>“I entered your bedroom and caused some misunderstanding between you and Prince Li.”</p><br/><p>“He didn’t misunderstand. I explained it thoroughly to him. But I also need to apologize to you because I told him your story. He won’t tell anyone though, so don’t worry.”</p><br/><p>“…..I trust that he won’t easily reveal it to others.” The two of them were silent for awhile. Bai Xiangxiu draped the cloak over her as she sat down on the stone bed.</p><br/><p>“Yu Kuang, if something happens tomorrow, I will take all the blame. If I get punished, don’t try to prevent it.” A hundred beatings from the army canes, I’ll probably be beaten to death. Who would have thought things would end this way again? She was actually surprisingly rather calm. Things were alright as long as Long Heng and her child were fine. She could accept her fate.</p><br/><p>“Will… you die?”</p><br/><p>“Perhaps.”</p><br/><p>“Then, if you really do die, can I kill them to avenge you?”</p><br/><p>“You can, as long as you do not put yourself in danger.”</p><br/><p>“Bai Xiangxiu, you’re truly a very kindhearted woman. In fact, Yu Shū really likes you. His heart is filled with your image.” He was speaking the truth. Although Yu Shū was young, the feelings he had for Bai Xiangxiu were so strong that no one could dissolve them.</p><br/>\n</div>"}