{"title": "Chapter 212: The Female Lead Bites the Hand that Feeds Her", "id": 212, "volume": 3, "url": "http://boxnovel.org/doomed-to-be-cannon-fodder-chapter-212-the-female-lead-bites-the-hand-that-feeds-her", "volume_title": "Volume 3", "body": "<h1>Chapter 212: The Female Lead Bites the Hand that Feeds Her</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 212: The Female Lead Bites the Hand that Feeds Her</p><br/><p>And so, the military and civilians formed an alliance. Everyone was brainstorming ways to help each other in the city. It was a rather happy and harmonious scene. Bai Xiangxiu felt that she ought to go back. Long Heng would be distracted if she remained here any longer. She tidied up and was planning to take her leave when Long Heng returned from his scouting trip. She was a little reluctant, but felt rather contented that she could see him before he really departed. </p><br/><p>Things were always different when being a married couple. A reluctance to part inevitably cropped up when the time came for them to do so. Since she was going to leave, shouldn’t she let him enjoy himself to his heart’s content? But, was it really good for her to do so with her current appearance?</p><br/><p>She was dressed in male clothing from head to toe and had even combed her hair into a man’s bun. There wasn’t anything beautiful about her appearance right now. Moreover, the injury on her body hadn’t healed yet. Could she really seduce someone? She touched her face. Even her skin had darkened and turned a little dry since arriving here. This won’t do! At any rate, my skin needs to be a little smoother than it is now before tonight!</p><br/><p>She had Shu’er buy some milk and immersed herself in a milk bath. She sat in the bath for a very long time and only emerged when she felt that her skin was slightly smoother than before. Someone knocked just as she was finished drying herself, and Shu’er announced, “Sir Bai, Sir Song has something he needs to speak to you about.”</p><br/><p>“Alright. I’ll be right there.” Bai Xiangxiu got dressed and came out, only to find that Song Jiayue had already been waiting outside for quite some time. He immediately stood up upon seeing her,”…Sir Bai, there is something I need you to help me with.”</p><br/><p>“What’s the matter?” Bai Xiangxiu sat down. She was slightly puzzled; it felt that Song Jiaoyue was a little keyed up. </p><br/><p>“It’s like this… we invaded the enemy’s camp and found a woman who was held captive.”</p><br/><p>“What woman?”</p><br/><p>“It’s… Miss Lin.”</p><br/><p>“What?!” It was very impressive for the female lead to still be alive. </p><br/><p>“She seems to be a little dazed, so could I ask you to take care of her for the time being and bring her back to the capital together with us?” Since he’d brought her with him, he naturally would have to bring her back as well. </p><br/><p>“I see. That’s fine.”</p><br/><p>“But, could you be the one to make plans and take care of her?”</p><br/><p>“Sure.” Since Lin Qianzi was a woman, it really wasn’t appropriate if she was left in other people’s care. However, she didn’t want to see that female lead, so she let Shu’er arrange for her to be housed in a civilian’s home. There were a lot of women in that house so they could look after her. Anyhow, it would only be for a single night.</p><br/><p>She never would’ve thought that a problem would arise even before that person even walked into that house. Since the female lead was so attractive, the son in that family actually went and committed an offence. Bai Xiangxiu had no choice but to grant them an audience. It hadn’t even been four hours since everything had been arranged. How could a problem have arisen so quickly?</p><br/><p>The son in that family was at the tender age of eighteen. He looked as though he had been severely wronged as he kneeled on the ground. His mother and elder sister accompanied him on the floor. Traces of dried tears were still evident on their faces. </p><br/><p>“What’s the matter?” Bai Xiangxiu questioned in a deep voice. She purposely kept her voice deep; her current identity was that of a strategist that Long Heng had invited. As a result of that, she was extremely respected by those in the army. </p><br/><p>The young man remained kneeling on the ground as he responded, “In response to the gentleman’s question, I really am not to be blamed in this matter. That young miss is a bit crazy. The strangest thing is that after seeing me, she calls me Yunzheng one moment and Yunying the next. She even called me… husband. I-I… she even undressed herself. For a moment, I couldn’t hold myself back and embraced her. But when I did so, she hit me and said that I’d violated her!”</p><br/><p>“We can vouch for all of this!” His mother and elder sister raised their hands at the same and wailed, “My son has always been honest. If it wasn’t for that woman taking so much of an initiative, he… definitely wouldn’t do that kind of thing!.”</p><br/><p>Bai Xiangxiu nodded and asked them to leave. She then asked someone to find Lin Qianzi; because after everything was said and done, she still had to verify the truth of the matter. Bai Xiangxiu couldn’t wait until she returned to the capital to lodge a complaint with the emperor. Long Heng was still on the battlefield, so how could she distract him with such things? In the end, her heart couldn’t help but ache when Lin Qianzi walked in. The female is the female lead alright! Even Bai Xiangxiu couldn’t help but cast a few additional glances at the female lead with her tender, weak aura. Who could blame the men! </p><br/><p>However, when her gaze met Bai Xiangxiu’s, it immediately turned from a wistful, pitiable look to one of hatred. Without a second thought, she ran straight at Bai Xiangxiu, screaming, “I’ll kill you! Give my child back to me! You killed my child!”</p><br/><p>Frowning, Bai Xiangxiu swayed back, avoiding the crazed woman’s outstretched claws. Her hand came up and across, landing a savage backhanded slap across Lin Qianzi’s face. Indeed, she made sure to put a great deal of force behind this hit. Hopefully, that would clear the female lead’s mind. However, it was clear that the female lead was possessed. “You vicious woman!! You flung my child to death!”</p><br/><p>“Ah? Are you mentally ill? When did I throw your child to his death?” You’re the one who threw him, alright?</p><br/><p>“And you won’t even admit it! You killed my child to save yourself. I’ll kill you to avenge him! I’ll kill you!!” </p><br/><p>“The f**k, have you actually gone mad?” Was the female lead’s imagination in such overdrive that she wholeheartedly thought of Bai Xiangxiu as her mortal enemy? Had she forgotten the crime that she herself had committed? This delusion was only the tiniest bit less impressive than the amount of denial she was spouting!</p><br/><p>“I’ll kill you!” The female lead actually grabbed the stool and raised it above her head. She started another charge at Bai Xiangxiu. </p><br/><p>Bai Xiangxiu frowned, thinking that this female lead had really gone insane. It was at this moment that Shu’er stepped in, knocking out the female lead with a swift blow from behind. At this point, Bai Xiangxiu felt certain that she wouldn’t be able to get anything out of the female lead, so she had Shu’er lock Lin Qianzi up. She then sent the family home and said that the female lead’s behavior stemmed from an enormous prior shock. Bai Xiangxiu told them not to mind to what had happened. It didn’t matter whether that young man had really offended the female lead or not anymore. Bai Xiangxiu didn’t want to bother with this any longer. She really needed to find a way to send this crazy female lead away. Otherwise, something would go wrong. Without a doubt. .</p><br/><p>The facts of the matter later proved that her line of reasoning was right. When she was still packing her things away later that afternoon, a few soldiers came over to ask her to meet with Vice-General Chen Tao. </p><br/><p>This person had originally been part of the Tranquil city guard. He’d been extremely dissatisfied ever since Long Heng came because the male lead had superseded practically all of his authority. It was very likely that there was a special reason behind him wanting to meet her!</p><br/><p>Bai Xiangxiu frowned and went with Shu’er to where Chen Tao was working. Who knew that someone would ambush and tie up Shu’er just when they’d walked in? She felt that something was amiss, but just as she turned to leave, she felt a sword rest at her throat.</p><br/><p>“Sir Bai, please enter.”</p><br/><p>Bai Xiangxiu had no choice but to obey. She walked in to see Chen Tao and a few soldiers standing inside. A smirk was playing around his lips as he looked scornfully at her.</p><br/><p>“City Guard Chen, what is the meaning of this?”</p><br/><p>“Meaning? Oh, I suppose you don’t know the punishment for bringing one’s wife and children along to battle? I believe it goes something like a hundred canings, officially relinquishing your position in the military and a summons from the capital for personal punishment by the emperor.”</p><br/><p>“Oh, then it seems this has nothing to do with me.” This is bad. Does this Chen Tao know something? Long Heng had always kept her identity a secret. Was that because a punishment like this actually existed? But before all that, how did this one find out about her identity? They’d always been very careful to keep her secret.</p><br/><p>“Madame Xiu, don’t tell me that you want me to strip you of your clothing in front of everyone before you admit to it?” The smirk turned downright evil. Even though he didn’t say anything, he definitely had the desire to do so. There was no one who didn’t know that Long Heng’s fourth madame was called the number one beauty in the capital. Her famed name had long since overshadowed the Miss Lin from Minister Lin’s household.</p><br/>\n</div>"}