{"title": "Chapter 222: Defected To The Enemy, Chen Tao’s Family", "id": 222, "volume": 3, "url": "http://boxnovel.org/doomed-to-be-cannon-fodder-chapter-222-defected-to-the-enemy-chen-tao%E2%80%99s-family", "volume_title": "Volume 3", "body": "<h1>Chapter 222: Defected To The Enemy, Chen Tao’s Family</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 222: Defected To The Enemy, Chen Tao’s Family</p><br/><p>A figure jumped down from the wall before the city gates were even opened. It’s Yu Kuang! Bai Xiangxiu waved to greet him. As expected from a man from the wulin. He’s always in the lead. She could finally breathe a sigh of relief. She was definitely safe now that he’d come to get her. However, her happiness had come a tad too early. Thump! Yu Kuang suddenly dived for the ground just when he came within ten steps from her. Crap! I forgot that I have the black devil’s snare right beside me.</p><br/><p>Bai Xiangxiu quickly yelled upon seeing the arrival of Long Heng and Song Jiaoyue, “Don’t come near me!”</p><br/><p>Long Heng frowned, “Did they apply some kind of drug on you?” Why else would Yu Kuang suddenly fall to the ground like that? Or maybe… she’s in danger as well?</p><br/><p>“No, they didn’t. You don’t have to worry, this is just a result of me trying to defend myself. You must not come within ten steps of me. By the way, can I sleep outside the city for tonight? I don’t want people to pass out after I enter the city.”</p><br/><p>“How can there be such a potent drug?”</p><br/><p>“I’ll explain everything later. What shall we do with him?”</p><br/><p>“Men, take good care of that man. I’ll be keeping my wife company on the outskirts of the city for a night.” Long Heng commanded as he pointed at Yu Kuang. He looked towards Bai Xiangxiu and said, “Walk half a mile forward. There’s an abandoned farmhouse there.” The entire family had already moved to the city due to the war.</p><br/><p>“Understood,” Bai Xiangxiu could not bear to part with the black devil’s snare. She held the plant in her arms, walked around the horse carriage and began to walk according to Long Heng’s directions.</p><br/><p>Long Heng followed a little behind Bai Xiangxiu. They held a long distance conversation. He first noticed that the plant was a little too heavy for Bai Xiangxiu to carry, “Let me help you carry that!”</p><br/><p>“You can’t! This isn’t something you can touch!”</p><br/><p>“Why did you disappear all of a sudden? Who abducted you?”</p><br/><p>“It’s Chen Tao. He abducted me in order to obtain the formula for the fire powder.”</p><br/><p>“Did you give it to him?”</p><br/><p>“I only gave him a fake one.”</p><br/><p>“Then why didn’t he pursue you?”</p><br/><p>“He didn’t pursue probably because he’s still unconscious. Or maybe it’s because he knows that I’ve returned.”</p><br/><p>Truth was, Chen Tao’s men had already caught up with her. Long Heng had sensed their presence for a while now, but he was secretly on guard. He wouldn’t allow them to harm Bai Xiangxiu if they really did try to attack her. However, they left soon after they noticed Long Heng, as they were likely extremely afraid of him. Long Heng smiled coldly to himself. Chen Tao is such a base and shameless person. It seems that I’ll have to pay him a visit tomorrow. But his utmost priority at the moment was Bai Xiangxiu’s safety. He never thought that she would land into so much trouble just because she came to help him. However, why did he have to protect her from such a distance? He couldn’t even hand over the chicken that he’d painstakingly cooked for her. He had to leave it and stay ten steps away so that Bai Xiangxiu could walk up to t and start nibbling away. “Xiu’er, that flower of yours seems really unique.”</p><br/><p>“Yes. It’s a black devil’s snare. It grants one wish to a person if they water it with their blood. It granted me a wish after I watered it for four days, and I wished for everyone to faint immediately when they approached me for an entire day.”</p><br/><p>“Blood? Don’t you… faint at the sight of blood?”</p><br/><p>“I don’t faint anymore. I’ve gotten used to it.”</p><br/><p>“Xiu’er, you wouldn’t have to suffer so much if it wasn’t for me.” He used to think that she was very weak and feeble when they were in the manor, but he now realized that she was actually very strong and resilient. She was like the black devil’s snare. It seemed elegant and vacuous, but was actually incredibly useful when the time came. “The wound on your hand…” He finally noticed that there were many cuts and lacerations on her palms.</p><br/><p>“The wounds are almost all healed.” </p><br/><p>Long Heng tossed some wound ointment right next to her, “Have a good night’s rest after applying the medicine. I will watch over you through the night.”</p><br/><p>“Mm,” Bai Xiangxiu was very sleepy indeed. She felt very safe even though Long Heng was only keeping watch from afar. The next day, Bai Xiangxiu realized that she was lying in Long Heng’s arms when she woke up. They’d already returned to the city.</p><br/><p>“The flower.”</p><br/><p>“I’ve had one of the servants to help take it back. It’s being potted just outside right now.”</p><br/><p>“Thank you.”</p><br/><p>“I need to report what Chen Tao did to you to Prince Rong.”</p><br/><p>“Go on.” Why does it feel like we’re an old couple that’s been married for a long time? When did this suddenly occur?</p><br/><p>Chen Tao had unexpectedly decided to defect to the enemy side in order to escape punishment for his previous actions. The enemy had begun to spread the news of his defection to try and terrorize the citizens. If the city guard captain had already surrendered to the enemy, wouldn’t that mean that their side was about to lose the war? Long Heng laughed scornfully. The enemy seemed to have forgotten how he’d chased them away every time. He’d only come back this time to assemble the troops so that he could muster his strength for an all out assault and take over their capital.</p><br/><p>However, there was no way that Long Heng could’ve predicted this turn of events. Chen Tao had brought his closest subordinates and defected to the enemy, but had left his family behind! His mother, wife, and two children were now imprisoned. Long Heng was incredibly furious, so much so that he actually slammed his hands on the table in public to release his anger. Chen Tao is such a coward! He actually abandoned his family so that he could live? What are we supposed to do with them?</p><br/><p>Kill them?</p><br/><p>“Surely you jest. They’re weak women and children. What good will it do if you killed them? They’ve done nothing wrong, right?” Bai Xiangxiu said while serving Long Heng some tea. Her brows were scrunched together.</p><br/><p>“You’re against killing them? But the rules state that everyone in a deserter’s family must be executed without exceptions. Prince Rong also thinks that we should do this according to the court’s laws. But…”</p><br/><p>“But it feels wrong to murder the innocent and the weak. Am I right?”</p><br/><p>“Yes,” Long Heng discussed almost everything with Bai Xiangxiu now. While she might not be a genius, she was still someone with a wide range of knowledge. Even someone like Prince Rong sang her praises.</p><br/><p>“Then change the children’s surnames and have the woman remarry.”</p><br/><p>“……” Long Heng stared at her with surprise written all over his face. Wasn’t a woman supposed to never have a second husband? However, this was a really good way for them to cut off all connections with Chen Tao.</p><br/><p>“What’s wrong? Isn’t it a good idea? I understand that the woman might not agree, but is she really willing to watch her children die just so they can remain dedicated and wait for a traitor?”</p><br/><p>“You really come up with all sorts of weird plans, but this might work well.” Long Heng said as he pinched her cheeks, “Go to sleep. I’ll discuss it with Prince Rong.”</p><br/><p>Prince Rong hadn’t intended to let them live in the first place, but this was actually quite a good plan. Putting a massive green hat on top of Chen Tao’s head would be incredibly humiliating.</p><br/><p>Soon after, back at the enemy camp, Commander Lu was having a conversation with a furious man as they retreated back to their country. “How can you possibly put up with such a humiliating thing? They’ve sullied your wife by giving her to somebody else.”</p><br/><p>“Of course I can’t!” Chen Tao yelled through gritted teeth. “But what I can’t stand the most is that woman by his side. I would’ve gotten the formula for the bombs already if she wasn’t such a sly fox!”</p><br/><p>“Didn’t she give you a formula? Let me have a look.” A soldier beside Commander Lu thrust a hand out to Chen Tao. He looked young, and seemed very elegant and refined. </p><br/><p>“This…” Chen Tao hesitated. It wasn’t something that should be handed over to a mere soldier, even if it was a fake.</p><br/><p>“Hand it over.”</p><br/><p>Chen Tao handed over the paper to the soldier after some hesitation. Something seemed a little off with that person, but Chen Tao just couldn’t quite put his finger on it.</p><br/>\n</div>"}