{"title": "Chapter 239: Saving Someone and a Misstep", "id": 239, "volume": 3, "url": "http://boxnovel.org/doomed-to-be-cannon-fodder-chapter-239-saving-someone-and-a-misstep", "volume_title": "Volume 3", "body": "<h1>Chapter 239: Saving Someone and a Misstep</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 239: Saving Someone and a Misstep</p><br/><p>In the past when Song Jiaoyue looked at the ice-cold, apathetic face that Long Heng always wore, he felt Long Heng definitely wouldn’t be gentle to Bai Xiangxiu.</p><br/><p>In fact, whenever the couple interacted in public, they didn’t put on ridiculous displays of affection either. They usually only spoke of proper business. Bai Xiangxiu was always the clever and sensible sort, so Long Heng seemed to just put in the minimum level of effort. Who knew if Bai Xiangxiu voiced her irritation or anger in private? But now Song Jiaoyue came to understand the adage that outsiders really couldn’t understand the situation between a married couple. For example, even though Long Heng was in danger, he had left his most trusted aides as well as those most versed most martial arts with Bai Xiangxiu. It wasn’t likely that he’d expected her to save him, but rather had done so just to ensure her safety!</p><br/><p>As for Bai Xiangxiu, he had never seen her cry desperately over Long Heng, or act resentful and helpless. Instead, she had remained extremely calm, the entirety of her thoughts focused on saving him. This was where she differed from other women. Song Jiaoyue remained focused on the present while these thoughts flashed through his mind. He felt he had missed more than a little bit in passing up his opportunity to be with her.</p><br/><p>Yu Kuang suddenly leaped out with a loud roar. He whipped his arm forward, and a blur escaped his hand. The long arrow cut through the air and sank itself into the man manipulating the concealed weapons. The man’s eyes widened, and he fell to the ground with a gurgled scream.</p><br/><p>Once Song Jiaoyue came to, he too leaped out and engaged the dozen men who were charging at them. As Bai Xiangxiu watched from afar, she noted the concealed weapon frame and began to wonder why it looked so like a modern machine gun. However, its manufacturing method was very strange. Instead of shooting bullets, it shot ordinary pebbles. If it really was to shoot bullets, then all of them would have been pure cannon fodder. Even if it did shoot pebbles, if they hadn’t brought a shield, there would still be an extremely high chance of grave injury or death.</p><br/><p>She didn’t dare rush in to search for Long Heng just yet. She couldn’t go past her allies without making them faint. So she quietly stood ten steps behind them and watched, “Have you found him?”</p><br/><p>“Please hold on a moment, we are still fighting.” Yu Kuang took a moment from the scrap to answer Bai Xiangxiu. However, she soon realized something very strange. She had been able to clearly see the other side fighting just now, but how come the light of the scene was growing fainter?</p><br/><p>She whipped her head around and saw that the only passageway behind them was being blocked. A big rock was soundlessly rolling across the hole until the entire passage was sealed off. They actually came up with this type of a move?! Do they want to trap us all here? Right when she was about to remind everyone to watch out, she heard Song Jiaoyue say, “I found him!”</p><br/><p>Bai Xiangxiu almost charged over, but realizing that she would only get in the way, she anxiously asked, “How is he doing? Has he been tortured? Is he covered in wounds? Is his mind clear? Is he covered with fresh blood…” She was thinking of the distinctive punishments used upon the criminals from those television dramas, alright? She felt her own husband would be tortured that way too.</p><br/><p>In the end, when all the light gave way to darkness and she could no longer see anything anymore, she heard a voice say, “Nothing happened. He just went hungry for a few days, and is a bit weak.”</p><br/><p>“Oh, that’s wonderful,” Bai Xiangxiu had just relaxed and sighed in relief when she heard footsteps. She immediately said, “Don’t come over here. I’m still holding the black devil’s snare. It lasts for two hours so it’ll still take a while for its effectiveness to weaken.”</p><br/><p>“All right. Everyone, do not move and stay where you are.” Long Heng started to take command of the situation the moment he was freed. Song Jiaoyue struck up a match so that everyone see the circumstances around them.</p><br/><p>Only their own people were left, but the question now was, how could they get out?</p><br/><p>Bai Xiangxiu said, “I have a way. Whoever takes the item I am about to throw must catch it well.” She trembled as she took out a fragrance pouch. Clearly, whatever was in it was very frightening.</p><br/><p>Yu Kuang stood up and walked out of the crowd., “Give it to me.”</p><br/><p>“You must be careful.” Bai Xiangxiu glanced at Long Heng. He was indeed a bit weak. At the moment, he was focused on gnawing at some beef jerking, putting his all into recovering himself. Even as he temporarily ignored everything around him, his eyes were still bright and clear. As he raised his head to watch Bai Xiangxiu, he flashed her a smile. This smile was very comforting, but revealed traces of disbelief. Perhaps he thought that Bai Xiangxiu saving him was extremely unbelievable! However, he was a reserved person. Especially in crucial moments like this, he would seem ten times calmer than the average person.</p><br/><p>“Is it one of those gunpowder bombs?” Long Heng asked. </p><br/><p>“Yes.”</p><br/><p>“Then make a hole in the wall to the right and slip it in. Behind that wall is a garden, so there shouldn’t be too many people lying in wait.” When Long Heng finished speaking, he stood up, “Xiu’er, take ten… or twelve steps back. We’re going to take our people with us.” He estimated she needed to take twelve steps back from a glance at her small legs.</p><br/><p>“Alright.” Bai Xiangxiu always listened to Long Heng’s orders. Thus, she backed up about fifteen steps to allow them to take their people away.</p><br/><p>They averaged one person each, with Yu Kuang having already put the bombs inside.</p><br/><p>“Are you ready…” He glanced at Bai Xiangxiu, as if asking what she would do.</p><br/><p>“No problem, I can walk there myself.” Bai Xiangxiu knew that if she walked over right then, her own people would faint, but she did not want to leave the black devil’s snare here. This type of a strange flower was an uncommon treasure. There was no way she was leaving without it!</p><br/><p>Long Heng knew what she was thinking and found a weapon with a good heft on the ground. “Let us begin.” </p><br/><p>Yu Kuang nodded, “Everyone, find a place to hide.”</p><br/><p>He hit the pouch with a sharp pebble and a loud roar ripped out. The explosion took out the entire wall in a split second. No wonder she’d been so careful when she took it out! It turned out its might was much more powerful than before! If this formidable power could be fielded in battle, they would be invincible. But now there was no time to think about any of that. Long Heng and the others rushed out and started fighting with the people outside. A few enemies slowly encircled them, as if they wanted to capture them all in one go.</p><br/><p>Yet at that precise moment, Bai Xiangxiu decided to make her move. A clear voice rang in Long Heng’s ear, “Take three steps back.” His heart could not help but become conflicted. When had this little bunny changed into a fierce wolf? Everyone has to give way to her the moment she walks out! His opponent didn’t consider Bai Xiangxiu to be a human killing tool. He only saw a very ugly woman walk out. He wanted to grab her, but darkness claimed his eyes as he fell unconscious.</p><br/><p>Long Heng laughed helplessly, “Be wary of getting too close to her. Everyone get out of the dungeons.”</p><br/><p>“Understood!” Most of the rescue party were military personnel so they conscientiously got in line. Some took up the task of defending against the charging enemies, others had the responsibility of opening the path, whereas yet more protected Bai Xiangxiu. Everyone retreated in an orderly fashion, but one thing stumped then.</p><br/><p>Song Jiaoyue said, “She has no way to escape over the wall.”</p><br/><p>“What should we do?” She had no way to escape, and they had no way to help her.</p><br/><p>“You guys go first. I have a way,” Bai Xiangxiu took out another fragrance pouch. After they saw the item in her hand, the corners of their mouths all twitched. Without a word, they leaped over the wall and started to pound dust. They didn’t want to be anywhere near the wall if they could help it.</p><br/>\n</div>"}