{"title": "Chapter 243: Level Up – Princess Consort Li", "id": 243, "volume": 3, "url": "http://boxnovel.org/doomed-to-be-cannon-fodder-chapter-243-level-up-%E2%80%93-princess-consort-li", "volume_title": "Volume 3", "body": "<h1>Chapter 243: Level Up – Princess Consort Li</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 243: Level Up – Princess Consort Li</p><br/><p>Bai Xiangxiu received it suspiciously. That thing was none other than a royal decree! Even if it was in the military, one would have to wash their hands clean and kneel before receiving it. Yet, he’d given it to her just like that? Oh well, there are no outsiders here anyways. She opened it and took a look. Skipping over the flowery salutations that plagued the beginning of the decree, she saw that the latter part of it stated that she would be made Princess Consort Li.</p><br/><p>It was not easy for a little concubine to get promoted to the position that easily. Unlike the modern era, where a man’s mistress would take the position of the main wife after the former wife divorced the man, should a man in ancient times vanquish one’s wife for the sake of his concubine, one would be incarcerated for this serious crime.</p><br/><p>Even after one served jail time, the concubine would still be unable to assume the position of the wife. Fortunately, Long Heng doesn’t have a main wife, so there should be no punishment. “Wait, that’s not right… Did you get punished just for this royal decree?” asked Bai Xiangxiu with her brow furrowed the moment she realized the truth of the situation.</p><br/><p>“Yes, quite a worthwhile trade. You can live in my residence proudly and properly now! Aren’t you happy?”</p><br/><p>“I… Well… I’m definitely glad, but you didn’t have to get hurt for something like this. And that aside, didn’t the emperor cause trouble for you?” Bai Xiangxiu felt like crying all of a sudden, but she had just emptied her tear ducts not long ago. She no longer knew whether she needed to shed a tear. Even though it was a joyous matter, she found that she couldn’t revel in celebration given Long Heng’s injured state. After Long Heng recounted his experiences at the palace, Bai Xiangxiu’s face flushed red, “How can he be so shameless?”</p><br/><p>“He has the right not to accept it even if the eyewitness is there. It’s his imperial right.”</p><br/><p>“Then, what should we do? Do we just accept that we’ve fallen victim into their ploy?” Dissatisfied as Bai Xiangxiu was, she knew that there was no other choice.</p><br/><p>“At any rate, he has to come up with a reasonable explanation for this matter. Otherwise, there will be those who aren’t satisfied with the resolution even if I don’t mind it. Let’s just wait and see who he will make the scapegoat next.”</p><br/><p>“Alright. What about Xiao Lin and the old madame?”</p><br/><p>“They were retained within the palace, possibly out of fear that I’ll cause trouble. But don’t worry, they’ll definitely return in a few more days.”</p><br/><p>“I see. For some reason, I feel that the storm won’t abate even if we want it to.” Lowering her head, she noted that Long Heng was staring at her oddly with his head slanted. His long ink-colored hair sprawled over the bed looked rather tantalizing.</p><br/><p>“What’s wrong? Is there something on my face?”</p><br/><p>“Yeah. Come over here, let me rub it off for you.”</p><br/><p>Not thinking that the serious-looking Prince Li would tease her like that, she stretched her face forward obediently.</p><br/><p>“Come closer. You know I’m injured, right?”</p><br/><p>It’s your hand that’s injured, not your shoulders, Bai Xiangxiu thought with confusion as she continued to draw closer, only to feel a hand press against her head and a warm kiss to the lips. We’re already husband and wife, yet you resort to this? What’s with the sudden attack, huh? Even so, she didn’t shrink back and even reciprocated the kiss passionately.</p><br/><p>Bai Xiangxiu had always been an introverted person, so she was incredibly conservative about such matters. It was as if the shyness of all eastern women was concentrated within her, so the times when she took the initiative for such matters could be counted on one hand. Having gotten his way, Long Heng pressed on and didn’t hold back. But just as he was about to wrap her in a deep, warm embrace, the pain he felt from his wound tearing open caused him to have no choice but to calm down. Pushing her back with haggard breath, he huffed, “You little lass… This prince will be back to deal with you when I recover.”</p><br/><p>Her face flush with embarrassment, Bai Xianxiu said, “It was you who did ‘it’ to me first. Why would I have to be ‘dealt’ with by you?”</p><br/><p>“Well, you could do the ‘dealing’ on me if you so prefer.” While Long Heng could barely move, he still didn’t shy from flirting verbally. However, when Bai Xiangxiu patted him lightly a few times, his face fumed with such excruciating pain that one could almost boil water by using his face as a stove.</p><br/><p>“Alright, let’s stop fooling around. Summon the supervisor to announce the royal decree. With the recent developments being as volatile as they are, I can quietly elevate your status. My apologies. The celebratory banquet, on the other hand, cannot be rushed.”</p><br/><p>“You’re still going to host a banquet at a time like this? Very well, just get some rest. I’ll talk to Butler Long about this.” Though she said that, Bai Xiangxiu was incredibly happy as she could formally become the main wife and no longer suffer the disdain of others. Xiao Lin on the other hand would no longer have to be a concubine-born child. It was still common in an ancient era like this for concubine-born children to be ostracized by others.</p><br/><p>Long Shuting had also been rather busy lately. He understood the situation of the household quite well and also knew that if the emperor decided to kill the prince, the rest of Prince Li Manor would not fare well either. However, since nothing of the sort happened yet, he could do naught but hold his ground. He didn’t even consider escape.</p><br/><p>Seeing Bai Xiangxiu walk over with royal decree in hand, he asked curiously, “Madame Xiu, for what have you come to the front yard?”</p><br/><p>Bai Xiangxiu laughed, “I’m afraid I’ll have to trouble you to announce this royal decree in front of the rest. After that, hang some red lanterns outside or something, and hire an opera troupe to sing in the courtyard for a day or two.”</p><br/><p>An elaborate show still had to be put on. Otherwise, who would know that she had successfully elevated in rank from a mere concubine to a princess consort? Long Shuting received the decree with an odd look. Upon giving it a brief glance, he smiled, “This one greets Princess Consort Li.”</p><br/><p>Oh? Why does it feel so good to be called that? From today onwards, I’ll be the boss! I’ll be able to do whatever I want! “Rise!”</p><br/><p>Xiao Shi had been following behind her and just realized what had happened. She fell to her knees just when Long Shuting got up, “This one greets the princess consort. Congratulations, Princess Consort!” She actually burst out in tears afterwards out of sheer joy that her mistress had been promoted after such hardship.</p><br/><p>“This is a great joyous occasion! We must definitely hold a big banquet to celebrate!”</p><br/><p>“His Highness has said that the current situation is unsettled, so we should be prudent in this matter. Just send some gifts to my family and inform them about this. However, caution them to lay low and not come visit recently. I’ll send someone to escort them to the manor after things calm down a bit more.”</p><br/><p>“Oh? Aren’t you supposed to visit home with the prince?” Even though she was only made consort at a later date, some formalities still had to be observed. It has been tradition since ancient times for a son-in-law to bring one’s daughter back to see the parents.</p><br/><p>“Eh, you have a point. I guess that’ll have to wait.” There were so many matters happening as of late, she wasn’t sure whether the emperor would act against them once again. More importantly, what would they do if that came to pass? Should they really rebel? Then again, things probably wouldn’t get so far. Otherwise, Long Heng wouldn’t have begged for her to be made Princess Consort. Even so, she still had to celebrate in her residence. Having told Long Shuting what to do, Bai Xiangxiu returned to take care of Long Heng, “I finally don’t have to refer to myself as ‘this concubine’ from now on.”</p><br/><p>“Is that all the benefit you gain?” Long Heng mused as he took in a sip of the soup she was feeding him. All she wanted from becoming my consort was so that she wouldn’t have to refer to herself as ‘this concubine’? Other things aside, isn’t she the least bit happy about becoming my wife?</p><br/><p>However, Bai Xiangxiu had long considered herself to be the wife of Long Heng, no matter how ancient people perceived it. Long Heng on the other hand, didn’t consider concubines to be his wife. Now that she was his rightful wife, he could walk in broad daylight with her and nobody would have the excuse to object to it anymore.</p><br/><p>“No, there are plenty of benefits. I’m just too happy that I couldn’t come up with any right now,” responded Bai Xiangxiu as she continued the feeding, feeling a sweet tinge of emotion in her heart.</p><br/>\n</div>"}