{"title": "Chapter 247: A Trap, Any Which Way is Fine", "id": 247, "volume": 3, "url": "http://boxnovel.org/doomed-to-be-cannon-fodder-chapter-247-a-trap-any-which-way-is-fine", "volume_title": "Volume 3", "body": "<h1>Chapter 247: A Trap, Any Which Way is Fine</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 247: A Trap, Any Which Way is Fine</p><br/><p>Bai Xiangxiu walked out proudly, but her expression was abnormally composed and unafraid. Everyone’s eyes lit up, as if seeing a rare flower bloom in front of them. Even the emperor, who’d seen countless beauties before, also narrowed his eyes. His heart began pounding fiercely, feeling that he’d spent so many years as a man all for naught. He’d thought that there were no perfect women in this world. Even one as beautiful as Lin Qianzi was completely airheaded. He had no idea what she was thinking of. She never smiled, and he’d originally felt that her need of a protector was quite attractive, but as time went on, the emperor felt that she really didn’t have much in the way of brains. The only thoughts she dwelled on every day apart from love and relationships was hate. What man could love a woman who only thought of revenge day in and out? He could tell this was the case even if she didn’t speak of it.</p><br/><p>However, smart women weren’t pleasing to the eye. Take Su Yun for instance, she was quick-witted and there was an element of wildness in her nature that made one want to conquer her, but it was one thing to look at her when she was veiled, and another disgusting thing entirely when the veil was taken off. So although the emperor liked her, he didn’t spend much time with her.</p><br/><p>Although it was no matter of great importance in the end, it still weighed on his heart. The emperor had thought that this was all there was to women in this world, but this glimpse of Bai Xiangxiu had caused his belief to crack. The first beauty of the capital, Prince Li’s favorite concubine, Song Jiaoyue’s beloved woman, and the item of affection for all men. Smart as a whip, she was a beautiful woman who had managed to rescue her own man. He’d thought the rumors exaggerated, but now he only rued meeting her too late.</p><br/><p>That flowy-blue figure seemed to imprint itself on his heart as soon as it appeared. He couldn’t forget her no matter how he tried. Even the eunuch by his side called out to the emperor a few times without receiving a response. It wasn’t until she looked over at him with a soulful look that he abruptly came back to himself, “Let’s begin!”</p><br/><p>Five women had elected to participate in the competition, all of them young ladies. Some of them were daughters of important officials, others young wives. One particular lady was the young wife of a general that the emperor was cultivating in secret. Her surname was Yue, and she was here to target Bai Xiangxiu, starting up the fires of competition as soon as she arrived. Bai Xiangxiu wasn’t afraid of her. She’d be tempered by the fires of the battlefield! Why would she fear a few ladies of the inner residence?</p><br/><p>When the eunuch called for the race to begin, their six steeds charged to the front. They weren’t riding that fast since it wasn’t a contest of horse riding skills, and it was a surprise that Lin Qianzi had some skills to her name. She didn’t fall behind Bai Xiangxiu at all. Bai Xiangxiu waited patiently for her to spring her trap, she didn’t want to spend any effort into cornering this prey when they would do it for her.</p><br/><p>When they’d ridden about one kilometer into the forest and out of sight from the crowd, Lin Qianzi suddenly cried out with pain. Everyone crowded around her to ask what happened. She clutched her stomach, “Nothing much, I just feel a bit dizzy. You all can go on. Will Princess Consort Li accompany me to the river to wash my face?”</p><br/><p>Here it comes. Bai Xiangxiu didn’t say anything, and Lin Qianzi continued, “Princess Consort Li, our previous grudges have all dissipated after we’ve entered the palace, do you still blame me?”</p><br/><p>Madame Yue also seized the opportunity, “Princess Consort Li, you’re being rather inappropriate. Noble Lady Qian is your superior after all, and you are the subject. How can you be so disrespectful to her…”</p><br/><p>“Enough, lead the way, Noble Lady Qian!” Bai Xiangxiu led Lin Qianzi’s horse to the riverbank as she spoke. The autumn leaves by the bank made the scene look quite bleak and desolate. The surroundings were a bit slippery, and they weren’t wearing any shoes with great traction, so they picked their way carefully to the riverside.</p><br/><p>Lin Qianzi stooped down and splashed some water with difficulty, but she looked a bit hesitant. She turned to extend a hand piteously at Bai Xiangxiu, “Princess Consort Li, can you give me a hand? It’d be bad if I were to fall in.”</p><br/><p>“Indeed, what would we do then!” Don’t you want to fall in and then tattle to the emperor, saying that I pushed you in? You’ll have that Madame Yue be your witness and insist on a severe punishment because you have evidence. As for the reason why, you’ll claim it’s because you used to be Prince Li’s fiance!</p><br/><p>Hah, it’s impressive that you could think of such a braindead method. But, I only need to throw a wrench into one part of your plans to expose your juvenile trick as child’s play. The reason she knew all this was thanks to Bai Xiangxiu’s natural listening device. It’d helped her to learn of Lin Qianzi’s plot. Otherwise, the lady might really have succeeded. Lin Qianzi could only blame herself for such a shoddy plan. It had far too many flaws.</p><br/><p>Madame Yue was currently indisposed. Bai Xiangxiu had borrowed one of Long Heng’s concealed guards and had him find a rabbit to spook their horses with. As for Lin Qianzi, she was getting ready to plunge into the water.</p><br/><p>Bai Xiangxiu didn’t stop her. She just watched as the Noble Lady prettily fell into the river. The sight of a little white lotus standing in the waters of autumn really was a charming sight. But… you’re flinging yourself into cold water right after a miscarriage. Is something wrong with your brain?</p><br/><p>“Princess Consort Li, what do you mean by this?” LIn Qianzi had automatically engaged her white lotus mode and was looking piteously at Bai Xiangxiu.</p><br/><p>Bai Xiangxiu stood on the riverbank with her hands crossed, looking down at the woman in the water. She looked around for moment and confirmed there was no one around before smiling sinisterly, “Stop pretending, Miss Lin, no one will see your act no matter how piteous you look.”</p><br/><p>“What, what do you mean?”</p><br/><p>“Oh I mean a lot. I’m going to teach you today what revenge means!” Bai Xiangxiu had her own temper as well. How many people would be able to take random, repeated acts of revenge from someone like Lin Qianzi? She jumped straight into the water herself and yanked Lin Qianzi’s hair without a second thought, pummeling the latter fiercely while maintaining a death grip on the hair.</p><br/><p>Lin Qianzi was shocked senseless. She’d never seen a woman so fierce; Bai Xiangxiu was even stronger than a screaming harlot on the streets! She’d jumped into the water and started hitting Lin Qianzi without a second word, not even allowing the latter to cry out. It wasn’t just her, the concealed guard sent to protect Bai Xiangxiu also clenched his butt tightly from shock, almost falling down from his place in the tree.</p><br/><p>He was just a guard, but he was also one of the personal guards who’d travelled to Tranquil City. He’d always thought that Princess Consort Li was a lofty woman worthy of much respect. She was beautiful, smart, and quite kind hearted. He’d originally felt that he would have to lay down his life today in order to prevent someone from harming her, but the situation had just turned on its head. Nw she was the one hurting others. That piteous Miss Lin was now looking quite disheveled, her hair in complete disarray as she was held face down in the water, unable to escape the thrashing that his household’s princess consort was doling out. The guard clapped his hands in front of his face. This scene was too beautiful to look at!</p><br/><p>“Help!! Ahh… help!!” Lin Qianzi had finally remembered how to call for help, but Bai Xiangxiu snorted coldly, “Keep screaming, no one’s going to come even if you scream yourself hoarse.”</p><br/>\n</div>"}