{"title": "Chapter 255: The Lin Family Redeeming A Slave", "id": 255, "volume": 3, "url": "http://boxnovel.org/doomed-to-be-cannon-fodder-chapter-255-the-lin-family-redeeming-a-slave", "volume_title": "Volume 3", "body": "<h1>Chapter 255: The Lin Family Redeeming A Slave</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 255: The Lin Family Redeeming A Slave</p><br/><p>Bai Xiangxiu still had her thoughts about her, even though she was in her dog-tired state. Did Long Heng take the wrong medicine? Why does he have so much gusto after coming back? People might think that he was drugged if they saw him like this!</p><br/><p>Long Heng was already gone by the time Bai Xiangxiu woke up the next day. She instantly remembered that she had to go pay the old madame a visit upon opening her eyes. There were some matters in the manor that she had to oversee so that she would be prepared when Long Heng was busy with his matters.</p><br/><p>She had to struggle quite a bit before she could finally put on her clothes, but her legs gave way when she tried to get up. Fortunately, there were maids who helped her dress and wash up so she could finally sit at the dining table to have breakfast. However, she fell asleep on top of the dining table before she even began her meal.</p><br/><p>Everyone was surprised when they saw that. What were they supposed to do now? Ye-mama coughed gently. “I will report to the old madame and tell her that… the princess consort will not be able to pay her a visit as she has fallen sick.”</p><br/><p>“No need. I’ve already paid the old madame a visit.” Long Heng was in a good mood when he saw Bai Xiangxiu fast asleep on the table after he was finished with morning court.</p><br/><p>He picked her up and laid her down on the bed and accompanied her as she slept. An hour later, Bai Xiangxiu suddenly woke up with a scream. “Oh no, This is bad! I’ve yet to pay the old madame a visit! Why didn’t anybody wake me up!” </p><br/><p>“It’s already noon.”</p><br/><p>“Aww. She’ll hate me for this.” Bai Xiangxiu let out a long sigh. Mother-in-laws and daughter-in-laws don’t normally get along ever since ancient times. Her situation was worse since the old madame was a very strict old lady.</p><br/><p>Long Heng smiled. “Why would she hate you when you’ve done nothing wrong? I’ve already paid her a visit in your stead. You don’t have to bother paying her a visit in the morning anymore as mother will be busy taking care of Lin’er. So, household matters will fall into your hands. Things will get a little hectic but it shouldn’t be too exhausting as Long Shuting will be here to help you. Hurry up and have your lunch. There’ll be a nice show to watch in a moment.”</p><br/><p>“Mm?” What show could there possibly be so early in the morni-… I mean at noon?</p><br/><p>After taking their lunch, Long Heng brought Bai Xiangxiu to the receiving hall at a pace that was more like taking a stroll. She saw a few people kneeling in when she arrived at the courtyard. Bai Xiangxiu had a good memory, so she instantly recognized that they weren’t people from the manor. “Who are these people?” Bai Xiangxiu asked while furrowing her eyebrows. There were three people in total. An old lady and two pageboys. Their faces were filled with sorrow.</p><br/><p>“Men, bring a chair for the princess consort.”</p><br/><p>The servants quickly went and brought two chairs. After all, it wouldn’t look good if others were to see the prince standing while the princess consort sat on a chair beside him. Thus, both husband and wife decided to take a seat. They seemed like unscrupulous people by doing so. There was nothing Bai Xiangxiu could do about it. She hadn’t a clue what was going on so she could only mimic the attitude Long Heng was showing. This is probably why they say married couples look alike! </p><br/><p>Tears began to pour from the old lady’s eyes as she kowtowed when she saw the two daunting figures. “Your Highness, please be benevolent and forgive our mistress. Our master and madame are willing to pay any price to purchase her enslavement papers.”</p><br/><p>“Oh? Princess Consort, what do you think about this?”</p><br/><p>“I’m not…” Oh god. Can you not push these sort of questions to me? I’m not your sidekick. Isn’t your opinion more important than mine in the end? Bai Xiangxiu rolled her eyes in secret and replied in an obedient manner. “Your Highness should be the one making the decision.”</p><br/><p>Don’t all men love being given face? I will give you the biggest face I can possibly muster. Long Heng was being more realistic now that all his urges were fulfilled. You’d best wait, little lass. Her reply made him feel abnormally good. “Fine. It’s not impossible if the Lin family wishes to purchase her enslavement papers.” Long Heng replied, showing a little bit of mercy.</p><br/><p>No way! He’s going to give them the paper so easily? That woman will surely be a scourge of all troubles when she goes back home!</p><br/><p>“Our master will surely remember Your Highness’ benevolence and big-heartedness. May I ask what do you wish in return…”</p><br/><p>“My conditions are relatively simple as well. I want all of the Lin family’s assets, including their property and their slaves. Also, I want Minister Lin to resign, return to his hometown and never step foot in the capital ever again.”</p><br/><p>“What?” The old lady seemed incredibly taken aback while looking at Prince Li. She never imagined that he’d give such a preposterous condition by asking for all of her master’s assets.</p><br/><p>“This prince does not intend to change his mind! Minister Lin will have to pay the full price if he wants his daughter back! Get out!”</p><br/><p>“Your Highness, Your Highness! Please don’t be like this…”</p><br/><p>“The longest I can wait is until tomorrow night.”</p><br/><p>“Your Highness, our master truly wishes to retrieve young mistress. She’s young and ignorant so please don’t hold her to her offences…”</p><br/><p>“Throw them out.” With just a wave of Long Heng’s hands, the servants picked up the old lady and her cohorts and threw them out the doors.</p><br/><p>“Is it really fine to be doing this? Minister Lin will never agree to those terms.”</p><br/><p>“I’m not begging him to agree to them either.”</p><br/><p>“That’s odd. Why didn’t he come personally to ask for his daughter?”</p><br/><p>“The emperor has issued a decree for the Lin family to cut all ties with Lin Qianzi. They are never to meet again.”</p><br/><p>“Oh, I see.” So that is the reason why Minister Lin didn’t come himself. Even the old lady that was sent here had to come very secretly.</p><br/><p>“What about Miss Lin? Didn’t she cause a ruckus yesterday night?”</p><br/><p>“Don’t worry. She will never be able to cause a ruckus ever again.” Long Heng’s smile sent chills down Bai Xiangxiu’s spine. “Do you want to know why?”</p><br/><p>“Umm… suddenly not anymore.”</p><br/><p>Long Heng didn’t force the matter either. “You will know sooner or later anyway.”</p><br/><p>Bai Xiangxiu inquired about the current situation after they were done looking at the show in the front hall. “What about Tranquil City?”</p><br/><p>“The soldiers have retreated back to Tranquil City. They have yet to return to the capital as they were worried that the enemy nation might be up to something. The emperor has given the permission, but at the same time he’s taken away all of my duties in the capital.”</p><br/><p>He clearly wants Long Heng to stay idle in the capital!</p><br/><p>“Is the emperor only capable of these petty moves?” Well, isn’t he going at it a bit easy, actually?</p><br/><p>Bai Xiangxiu looked at Long Heng in an inquisitive manner until he finally explained. “The emperor has already sent two generals with ‘military’ backgrounds to Tranquil City. However, I have a hunch that none would ever welcome them.</p><br/><p>“Why is that?’</p><br/><p>“Because I’ve already given them an order to make the lives of any of my replacements, hell.”</p><br/><p>“But Prince Rong is still there.”</p><br/><p>“He will be returning to the capital soon. He might look honest and down to earth but there’s actually more to what meets the eye. He’s actually an expert at sizing up the situation.”</p><br/><p>“Situation?”</p><br/><p>“At this current moment, the emperor is the one who has authority, while I am the one who has military power. Both of us are now at a stalemate. If I ever decide to revolt, he will only be able to resist for up to three years with all the troops he has at hand. After three years, this entire country will be ruled by my Long family.”</p><br/><p>“Long Heng…”</p><br/><p>“But during these three years, the enemy nation might take the opportunity and attack us while we are at our weakest. The country would be very vulnerable to outside attacks.”</p><br/><p>“That much is true but sooner or later, the emperor will definitely dissolve your military power if you choose not to do anything about it. When that happens, I’m afraid our family will be in mortal danger.” Bai Xiangxiu began to frown. It seemed like every path they could take was riddled with danger.</p><br/><p>“Which is why I’ve planned a way out. During our time in Tranquil City, I’ve bribed almost every single general there. Their families have all been secretly moved to Shu County, except for our family.”</p><br/><p>Bai Xiangxiu was speechless. This man is only in his twenties right? How can his thoughts be so complicated?</p><br/><p>“I am a man with a wife and a son, so I don’t intend to remain passive. I’ve already foreseen this when I realized I was the only person with majority control of the army.</p><br/><p>“Thank you, Long Heng.” Bai Xiangxiu could only hug him tightly as she was at a loss for words.</p><br/>\n</div>"}