{"title": "Chapter 278: Having a Soccer Team Won’t be a Distant Dream", "id": 278, "volume": 3, "url": "http://boxnovel.org/doomed-to-be-cannon-fodder-chapter-278-having-a-soccer-team-won%E2%80%99t-be-a-distant-dream", "volume_title": "Volume 3", "body": "<h1>Chapter 278: Having a Soccer Team Won’t be a Distant Dream</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 278: Having a Soccer Team Won’t be a Distant Dream</p><br/><p>Although Long Heng was only semi-conscious, he could still hear everything. His fingers subconsciously twitched. The pageboy that had returned was already in control of the situation and kicked almost everyone out. The only people left in the room were Bai Xiangxiu, Xiaoshi and Xiaohuan. The two maids, who were carefully holding onto her, led Bai Xiangxiu to a small reclining couch.</p><br/><p>“Why couldn’t you tell me everything in one go, or continue after she’d left the room? Go check on her and see why she fainted.”</p><br/><p>The doctor assented and went over to check on the princess consort. Originally, he’d wanted to say that excessive blood loss had caused the prince to temporarily lose consciousness, but Bai Xiangxiu had fainted before he could finish. It wasn’t as if he could do anything about that, right? Hadn’t the prince ordered him to make his condition sound a little more critical? It wasn’t like he was really in a bad condition!</p><br/><p>The doctor silently walked over to Bai Xiangxiu and took her pulse. Shu’er helped Long Heng bind his wounds with extreme proficiency. He had had a great deal of practice from his time on the battlefield so that he was now very adept at this task. Even Long Heng nodded his head satisfactorily. This rascal has matured quite a bit, at long last.</p><br/><p>He worriedly looked over at where Bai Xiangxiu was, but only saw that the doctor’s originally furrowed brows had practically become the deep creases of a bun. This made Long Heng feel like there was an enormous problem with the situation. He wanted to get off the bed and even began to struggle to his feet, but Shu’er immediately said, “Your Highness, your wound will split open. Please do not move anymore.”</p><br/><p>“How is she?” Long Heng had thought that she’d already built up enough tolerance for the sight of blood after being on the battlefield. But who would’ve thought she would still faint at the drop of a hat? It didn’t really make sense.</p><br/><p>After a detailed examination, the doctor lifted his hand and sighed, “Congratulations, Your Highness, congratulations! The princess consort’s pulse indicates that she is pregnant.”</p><br/><p>“What?” Long Heng was completely struck dumb. The doctor doggedly continued on, “It seems she’s been pregnant for about two months or so. Her pulse is very stable, but due to a little shock just now, she is a bit weak. As long as she takes some medicine that calms the fetus, she will be alright.”</p><br/><p>“Oh… then go prescribe some medicine quickly.” Two months. So she’d gotten pregnant in Tranquil City, then made the arduous journey back and undergone so many things. This child must be as strong as iron! A smile tugged at Long Heng’s lips. Unexpectedly, he felt this unborn child already had some assets that made him proud.</p><br/><p>The doctor still had to dress his wounds for him. Long Heng said, “Just go out soon and say I can’t hold on for much longer. Have them prepare funeral arrangements, but I have something to make clear. No servants may enter, and no one may notify the old madame. Anyone who disregards my orders will be severely punished.”</p><br/><p>“Yes!”</p><br/><p>Long Heng looked at Bai Xiangxiu’s pale face. If it wasn’t for him scaring her, she wouldn’t have fainted. He hoped that she wouldn’t be frightened again when she woke up.</p><br/><p>“When the princess consort wakes up in a while, just say that this prince is completely fine.” His heart was slightly warmed. It seemed he really did have a place in this girl’s heart. He really liked this feeling. Long Heng slowly drifted off to sleep. The unexpected happiness and the blood loss had tired him out.</p><br/><p>As for Bai Xiangxiu, she woke up with a start because she had seen Long Heng covered with blood from head to toe in her dream. “Long Heng, Long Heng…” She fiercely sat up, her entire body in a cold sweat.</p><br/><p>“Princess Consort, the prince is alright, he’s alright. Don’t get riled up.” Xiaoshi hurriedly explained as Xiaohuan supported her to a sitting position, pointing to the bed as she did so. “The prince has just fallen asleep.”</p><br/><p>“Fallen asleep?” Bai Xiangxiu naturally didn’t believe it and walked over. She sighed with relief when she saw him breathing evenly. The great joy and relief she felt robbed her of the tension in her body, causing her to sway unsteadily, about to faint</p><br/><p>A hand suddenly supported her, and a voice spoke,, “Don’t be anxious. Take your time and lie down beside me.”</p><br/><p>Bai Xiangxiu was extremely happy to see that Long Heng had awoken. “Your injuries though…”</p><br/><p>“Don’t worry. Come over here slowly.” Long Heng wanted to prop himself up, but Bai Xiangxiu pushed him back down and silently slipped into bed next to him. She began to cry after she saw his body wrapped in bandages.</p><br/><p>“Don’t cry, nothing’s happened to me. Half of the blood you saw belonged to someone else.” After a pause, he said, “You may all go out! Bring in the princess consort’s medicine after it is done.”</p><br/><p>“If nothing’s happened to you, I won’t need to drink my medicine, let me…”</p><br/><p>“Lie down like a good girl. Don’t move about randomly.”</p><br/><p>“Aren’t you the one who’s injured?”</p><br/><p>“I only have a couple of superficial wounds. It will get better very soon. You are the most important one.”</p><br/><p>“Why does it seem something is not right?” She knew Long Heng loved her dearly, but to love her to this extent seemed a bit abnormal.</p><br/><p>“What seems not right?”</p><br/><p>“Let’s not talk more about this. It was Su Yun’s assassin who caused your injuries. I’m definitely not going to let this go this time. She has gone far beyond just overboard.”</p><br/><p>“No, I purposely got injured.”</p><br/><p>“Why? Didn’t you know I would worry about you?”</p><br/><p>“Don’t get too emotional. Listen to me…” Long Heng revealed his full plan to his wife. Bai Xiangxiu was shocked beyond words. She didn’t think Long Heng could’ve done so much secretly. It was enough to overturn a dynasty.</p><br/><p>Long Heng had wanted to give her a nice surprise, but she was not quite the same now as she had been in the past. Worrying too much would harm her body. “Now that you know what’s going on, you won’t overthink it right?”</p><br/><p>“Yes, but couldn’t you just trick the enemy into believing that you injured yourself? Why did you have to actually injure yourself?”</p><br/><p>“I have to make them believe it. Besides, I left one alive to go back and make a report.”</p><br/><p>“Long Heng, can you think of me and your child in the future whenever you want to do something?”</p><br/><p>“You know? If you know about it, why would you let yourself get so emotional? What if something happened?”</p><br/><p>“Know about what?” Bai Xiangxiu looked at him, unable to make head or tail of those words. No matter how she thought about it, this sentence made no sense.</p><br/><p>Only then did Long Heng guess that she was talking about Xiao Lin. However, seeing her wide eyed appearance of wanting to know more extremely amused him, so he teased her, “Guess!”</p><br/><p>“Guess…guess what? Do I look like I’m in the mood for a guessing game?!” Bai Xiangxiu wanted to punch him, but she stopped herself because his body was covered in wounds.</p><br/><p>“Now that you are carrying our child again, you must be extremely careful.” Long Heng was afraid she would become emotional again, so he reached out a hand to stroke her abdomen.</p><br/><p>“What?!” Bai Xiangxiu sat up in agitation. In modern society, one didn’t get pregnant with a second child that quickly! She couldn’t accept things for a moment. Was it really a good thing to be so good at reproducing? Wouldn’t the government come regulate these things? No, she should say, she didn’t want to be a mother again this quickly. Shouldn’t she rest for a few more years? But there weren’t any contraceptives in ancient times. If she continued like this for the next ten years, she might even end up making a soccer team.</p><br/><p>Facepalm. This was too scary! She really wanted to invent a condom or something along those lines. Wait a minute, it seemed there was a type of medicine here that could prevent pregnancy if one drank it after one did it. It was usually given to concubines. Perhaps, if she really couldn’t take it next time, she could use that. Even though it was a little bitter, it was better than giving birth to a child.</p><br/><p>“What are you thinking about?”</p><br/><p>“Next time after we do it, I better drink prevention soup.”</p><br/><p>“You… you are the princess consort. Why would you want to drink something like that?” I really don’t understand what she’s thinking. What kind of a main wife would use those types of things?</p><br/><p>“But, if I continue having babies, won’t it be bad for my body?”</p><br/><p>“That’s true.”</p><br/><p>Long Heng pushed her down and laughed. “But, it’ll good to have a few more sons, so that when the father and his sons go to battle, they’ll be invincible.”</p><br/><p>“You have such a vivid imagination.” Bai Xiangxiu rolled her eyes at him. She would never approve of letting her sons go into battle.</p><br/>\n</div>"}