{"title": "Chapter 276: Noble Consort Su Goes Insane", "id": 276, "volume": 3, "url": "http://boxnovel.org/doomed-to-be-cannon-fodder-chapter-276-noble-consort-su-goes-insane", "volume_title": "Volume 3", "body": "<h1>Chapter 276: Noble Consort Su Goes Insane</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 276: Noble Consort Su Goes Insane</p><br/><p>This imperial doctor was an elderly man, and didn’t handle shock well. Yet his words were clear as he immediately dropped to his knees. “That was definitely no poison. In fact, it’s actually medicine that helps a wound heal faster. Only, it’s too effective and caused the body to give up on the scars on the face. To heal this, I must reopen the scars and reapply some medicine. However, I have no idea to what degree I would be able to restore her face.”</p><br/><p>The imperial doctor had already sent his entire family away and was no longer afraid of death. Because of that, he spoke in a very direct manner. He even mentioned how he’d discovered that the noble consort’s face was crafted using highly impressive surgical techniques after examining her face. As for the skin on her face, it was likely transplanted from another person, which explained why it looked so wondrous. However, it wasn’t possible to transplant the entire face, which was why there were still quite a few wounds. The red scars were all wounds from when the doctors had stitched together various pieces of skin.</p><br/><p>Since the doctor was able to ascertain that much, he knew that the rumours spreading outside were all true. He couldn’t help but begin to hate this noble consort. Many of the doctors that had gone missing were his comrades and friends. Moreover, he wasn’t actually lying as far as restoring her face went. The noble consort’s wounds were indeed very difficult to heal.</p><br/><p>“Are you saying that this seat is now disfigured forever?” Su Yun threw off the covers as she furiously leaped to her feet.</p><br/><p>“I’m… saying that it will take some time to fully recover.” Make no mistake, the doctor was still trying his best to live; he didn’t dare be openly rude. Yet despite his efforts, he still managed to anger Su Yun. She grabbed his medicine bag and threw it onto the floor. “Get out! Get out of here! Why should I keep you in the palace when you’re so useless?”</p><br/><p>The imperial doctor felt relieved. Was he finally going to be kicked out of the palace? He’d actually wanted to leave for a while now, but the Internal Affairs Hall wouldn’t easily let doctors go since they’d become so scarce in the palace. However, being kicked out by his masters was a very different matter. He could leave immediately! He quickly kowtowed and immediately left the room, not even bothering to pick up his things.</p><br/><p>“Don’t be so brash. I will definitely find someone who can cure you.” The emperor was growing irritable as well. It seemed like Su Yun wouldn’t be able to calm down today. He’d wanted to fool around with a beauty after his wounds healed, but he couldn’t get into the mood after seeing her face. He’d rather have the empress! However, Princess Consort Li would probably feel amazing. He was an emperor, a man amongst men, yet why didn’t he have such an intelligent woman by his side?</p><br/><p>He was supposed to be the man with the most power in the country, yet he couldn’t even manage to get his hands on one woman. But a bold woman, who’d been courageous enough to stab him. Every single person alive likely had to battle their inner demons at least once in their lifetime, and the emperor was now doing just that. He was deeply convinced that he was the most powerful person in the world, and was stuck in a loop wondering why he couldn’t have everything that he wanted.</p><br/><p>After the emperor left the room, his mind plainly elsewhere, Su Yun began to caress her face. Getting doctors to cure her face was now a lost hope. The old and weak doctors that remained in the palace probably wouldn’t do her any good either. She would probably have a better chance if she started searching amongst the citizens. That male stud would probably lose interest in her if she didn’t cure her face soon. While she was lost in her thoughts, she received news from her subordinates that the emperor had gone to visit another concubine, a new noble lady. Apparently, that noble lady was said to resemble Princess Consort Li. She was famed for her ability to act meek and delicate. Even the old madame said that she could see Née Bai’s shadow in her silhouette. However, they didn’t really look alike at all, it was just that their demeanor was similarly on the delicate side.</p><br/><p>Men are all the same. They’re superficial creatures who only judge a woman by her appearance. There’s nothing I can do about it now that I’m disfigured. Su Yun picked herself up after feeling a little sentimental for a moment. She left the palace to look for a doctor to tend to her face. However, she quickly felt depressed when she couldn’t find a single doctor in the capital. After some discreet inquiries, she learned that all of the doctors had left for the outer counties.</p><br/><p>The few that hadn’t left yet had extremely long lines snaking down the streets. Business was booming, and it was very difficult for her to get to the doctor. She decided to fork out a lot of money to gain admission, but the doctor only laughed derisively at her when he saw her face and sent her out. She could tell just from the look in his eyes that this doctor was very aware of who she was.</p><br/><p>“What do you mean by this? How dare a doctor refuse to see a patient? Is there no law in this nation anymore?” Su Yun had a lot of complaints. On what basis was he allowed to refuse her treatment when she’d paid such a large sum of money to gain a spot at the front of the line?</p><br/><p>The doctor turned to face the crowd. “Everyone, this madame is here to seek treatment for the wounds on her face. She is the reason why you all are standing in line. Will all of you give me some face and return to her the money that you’ve received? In return, I will not ask for a single copper for my diagnosis today.”</p><br/><p>Everyone instantly understood what the doctor was trying to say. Even though the crowd didn’t openly rebel, the look in their eyes obviously changed. Some of the more hot-blooded men even tossed the money onto the ground and spat on it. “I don’t need your stinking money!”</p><br/><p>At that, almost everyone threw the money onto the ground as well. The sound of the crowd cursing and swearing gradually grew in intensity. Su Yun never imagined that the situation would develop like this. Were these people really going to rebel? Why wouldn’t they just take the money? Also, when had she gained so much notoriety? It was obvious that someone was behind this too.</p><br/><p>Watching the charade from a dark corner, Bai Xiangxiu whispered to Long Heng, “Is this your doing?”</p><br/><p>“No. This one is all her credit. Many of the imperial doctors have left the palace, and almost every doctor in the capital has some connections with those imperial doctors. The imperial doctors likely thought it as a tiny piece of harmless gossip, but the rumors actually began to spread to the point where there’s no one in this city who doesn’t know what she’s done.”</p><br/><p>The entire thing had developed to such an extreme degree, even though Long Heng had only given it the slightest push behind the scenes. There wasn’t too many doctors left in the city, so it was quite easy to locate where Su Yun was trying to find one.</p><br/><p>“I must say that I’m very impressed by your plan. She will probably never be able to restore her looks ever again.” Long Heng gently pinched Bai Xiangxiu. What she did might’ve been a little ruthless, but it had a great effect.</p><br/><p>Bai Xiangxiu raised her head to look at Long Heng with a speechless look on her face. “Since when was this my idea?”</p><br/><p>Long Heng caressed her head. That’s true, how could his cute little wife possibly be so ruthless?</p><br/><p>“I’d actually planned to poison her…”</p><br/><p>“Uhh…” Long Heng kneaded his forehead. He’d forgotten that his little wife was becoming more and more unbridled. This was probably because he’d been pampering her too much, which had made her become a lot more open than before, and caused her to gain quite a temper. However, this was likely her true personality. Long Heng felt quite content when he came to that conclusion.</p><br/><p>What these couple didn’t know was that what happened today only made Su Yun’s hate for Long Heng grow several times over. After returning to the palace, she immediately requested that the emperor come see her. Then, beside a budding little cactus plant, the two began to hatch a plan to kill Long Heng.</p><br/><p>Bai Xiangxiu was just about to climb into bed to rest but was promptly interrupted by Huo’er’s summons right. Noticing that she’d stopped moving, Long Heng reached out for her slender waist and said, “Didn’t you say that you’d be the one doing everything today? Why have you gotten lazy?” His voice was so sexy that it made Bai Xiangxiu tremble all over.</p><br/><p>She slapped him twice in the hand and scolded him gently. “Stop fooling around! Huo’er is talking to me.”</p><br/><p>“…” Even though Long Heng knew that his wife had some supernatural abilities, he couldn’t help but find it strange whenever she started talking to a plant.</p><br/>\n</div>"}