{"title": "Chapter 282: The Corpse that Disappeared", "id": 282, "volume": 3, "url": "http://boxnovel.org/doomed-to-be-cannon-fodder-chapter-282-the-corpse-that-disappeared", "volume_title": "Volume 3", "body": "<h1>Chapter 282: The Corpse that Disappeared</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 282: The Corpse that Disappeared</p><br/><p>Luo Yunzheng didn’t want to interrupt someone else’s private time, so he decided to move the eyesore of a corpse and leave. Who could have expected that a black swirling vortex would suddenly appear underneath the corpse? He reacted quickly, and immediately leaped out of harm’s way. As for Su Yun’s body on the floor, it was instantly sucked in by the vortex. Everything happened so quickly that none of the people who witnessed it could react. The corpse had vanished in the blink of an eye.</p><br/><p>Although no one could believe what had just happened, it was entirely clear to them that it had in fact happened. Long Heng only felt his heart shudder. He had actually felt that Su Yun’s words were not completely untrustworthy, especially when it concerned the Bai Xiangxiu in his arms. Indeed, while she had been extremely shocked, she had calmed down immediately, almost as if she’d understood what had just happened. She’d known more about Su Yun than anyone else, so perhaps, it was really as Su Yun had said: Bai Xiangxiu was hiding things about herself.</p><br/><p>If she really did disappear like this one day, what would he do? Only a few people would miss Su Yun, but that wasn’t the same case for Bai Xiangxiu. She had sons, a family, and soldiers at the border station who respected her. His arms suddenly tightened, making Bai Xiangxiu yelp.</p><br/><p>She looked at Long Heng confusedly, not understanding why he would suddenly use so much force. He had almost squeezed out all the air in her chest.</p><br/><p>“What on earth happened? Why would someone suddenly disappear like that?” Luo Yunzheng was awoken by Bai Xiangxiu’s yelp. As a normal person, he could not fathom what had occurred before his very eyes.</p><br/><p>“Don’t mention what happened here in front of anyone else. You may all go!” Long Heng waved his hand, but Luo Yunzheng was the only one to leave. Yu Shū stayed back, weakly asking, “Big sister won’t disappear, right?”</p><br/><p>“I won’t.” Bai Xiangxiu felt Long Heng’s arms tighten again, so she felt she had no choice but to utter those two words immediately. It was very clear they all suspected she would disappear, or something similar. This was only to be expected, since Su Yun had said so many strange things before she’d died. Long Heng wanted to know everything about her, but to take her aside and question her would require him to first shake loose her little tail, Yu Shū. Yu Shū practically clung to Bai Xiangxiu’s leg when she walked. He looked like a little child, simple and innocent. As a pregnant woman, there was no way for Bai Xiangxiu to abandon him, so she decided to just let him lie on the bed while she and Long Heng chatted.</p><br/><p>They were chatting, but they only skimmed surface topics. In reality, Long Heng was just staring at her, but he did not speak of what he wanted to ask for a long time.</p><br/><p>“Do, do you have anything to ask me?”</p><br/><p>“Did you come from the same place as her? Will you really disappear just like her?”</p><br/><p>“Of course I won’t. Why would I disappear?”</p><br/><p>“What are you hiding from me? What is your relationship with Su Yun?”</p><br/><p>“I have no relationship with her.” Bai Xiangxiu knew that there wasn’t any way she could explain that her spirit had come from a different world, so she only said, “Perhaps she misunderstood because both she and I are both different from other people here!”</p><br/><p>“You really won’t leave?”</p><br/><p>“Of course I won’t. Don’t worry.” Bai Xiangxiu could only say helplessly, “I’ve already given birth to a child, and gotten pregnant again. Where can I even go?”</p><br/><p>When Long Heng heard that, he heaved a sigh of relief. That’s right. Now that she’s had two children, where else can she go? He gently hugged her, and Yu Shū suddenly sat up from the bed. “Where am I?”</p><br/><p>No, this voice and this expression clearly made him out to be Yu Kuang. Dumbfounded, Bai Xiangxiu said, “Why are you here? It isn’t even morning yet.”</p><br/><p>“I don’t know either.” Yu Kuang looked around.</p><br/><p>“Is this your room?”</p><br/><p>“Yes.”</p><br/><p>“You indulge him too much.” Yu Kuang smiled slightly. Yu Shū may be a troublemaker, but he always manages to get her to indulge him.</p><br/><p>“Since you have nothing else to do here, then get out!” Yu Kuang had no choice but to get off their bed and leave after Long Heng spoke. But before he left, he spoke to Bai Xiangxiu, “He probably left because he didn’t like seeing you two together.” Actually, he really understood Yu Shū. Even though he didn’t know what had just happened, he probably could still guess why the air had suddenly changed. After Yu Kuang left, Long Heng called for people to change the bedsheets before he would agree to resting on the bed.</p><br/><p>Sigh. Men were always petty.</p><br/><p>As a tranquil few days passed, the city buzzed with the news of the late deceased Prince Li. The enemy country had begun to stir, and had unexpectedly begun to cause a commotion at the border.</p><br/><p>The great ministers of the emperor were frightened, yet eager. They were afraid because the country had lost an excellent general like Long Heng, but the generals that had newly been promoted were chomping at the bit. They all strove to outdo each other, one after another, by declaring that they wanted to go to the border to fight off the enemy soldiers. This would allow them to make a name for themselves. But now, at this moment, some of the ministers proposed that the emperor personally lead his troops into battle. Naturally, it was the ideal solution to bolster the emperor’s faltering reputation among the populace. If he were to personally lead the troops this time, then he would quickly be able to eclipse the late Long Heng. Moreover, last time, the enemy had already been beaten up until they couldn’t even open their doors. This time, even if they tried to fight back, they didn’t have any true military strength remaining, so as long as the emperor took the field, they would quickly defeat the enemy.</p><br/><p>Men were all hot-blooded. The emperor wasn’t able to withstand the increasing pressure from the ministers, so it actually lit a fire in his thoughts. In the end, even Minister Lin also joined the bandwagon to propose it to the emperor. After musing for a while, the emperor finally agreed to personally lead the troops. When Bai Xiangxiu heard of his decision, she was extremely astonished. She turned to Long Heng, “How did you manage to convince Minister Lin?”</p><br/><p>“I borrowed a few connections and negotiated with him. As long as the emperor leads his troops into battle, then his daughter will be saved from the low-grade brothel, and enter a temple as a nun instead.”</p><br/><p>“No wonder he agreed. But, does he not know how much danger the emperor will be in if he does take command?”</p><br/><p>“They think that the enemy country is no longer a threat. Because these people have never been to battle, they don’t even understand that a thousand changes can occur in an instant on the battlefield.”</p><br/><p>“They don’t know, but they still dare to go. Those people sure have a lot of guts.” This was just like in the modern era. If one didn’t know the inside story behind an industry and just barged in to work there, one would definitely leave with a face full of dust for their troubles. Of course, Long Heng’s objective was to make them lose in the first place. Even if they didn’t make themselves lose with their own actions now, they would still lose in the end.</p><br/><p>Long Heng had been meticulously conducting his operations at night lately. Bai Xiangxiu had to think of her unborn child, so she took a nap after the two of them spoke. However, she randomly dreamt that Su Yun’s corpse had suddenly appeared on a big bed in a hotel. The server who had been bringing guests around to look through the rooms saw Su Yun when she opened the door. She was so frightened that she screamed, and then called the police.</p><br/><p>Su Yun had been wearing ancient clothing when she returned, so when she transmigrated back to the present time, she had returned entirely naked. Thus, on the second day after the police cars had taken her away, the newspapers all reported: Rich girl and a male celebrity naked in death after getting a hotel room! The details inside explained her miserable death. If hadn’t been for a DNA analysis, the authorities wouldn’t even have recognized her. The even stranger thing was, she had disappeared in that hotel several months ago, but she had actually reappeared in that same location. This was definitely a mystery.</p><br/>\n</div>"}