{"title": "Chapter 11", "id": 11, "volume": 1, "url": "http://boxnovel.org/god-level-summoner-chapter-11", "volume_title": "Volume 1", "body": "<h1>Chapter 11</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 11 – Bounty Mission</p><hr/><br/><p>Three simple moves caused Li Cangyu to feel very suspicious of the true level of this terran swordsman but he wasn’t certain if the player was a professional. There were many passersby in China who didn’t want to play in the Professional League.</p><br/><p>In any case, he would be able to find out some clues when they teamed up together. There was no need to be too anxious to figure out the swordsman’s identity.</p><br/><p>Li Cangyu thought this as he talked with the NPC and took the bounty task.</p><br/><p>The goal of this mission was to escort the the businessman Erdos to the black market not far outside Yisu City. Successfully completing the task would give 10,000 experience per person and a total of 1,000 coins.</p><br/><p>The bounty mission gave experience to everyone while the gold coins were equally divided between teammates. If a person’s level was enough, they could do it alone and the reward would naturally be the highest. But in order to avoid being robbed in the game, most players would make a full six player team and there were few people like Li Cangyu who would do a bounty mission with only three players.</p><br/><p>Once they received the task, the NPC Erdos had an ‘escort’ character icon. This large icon was simply giving other players a signal— Come and rob me! I have experience and money to steal!</p><br/><p>The three people escorted Erdos to the target point. As soon as they left the city, three system mobs moved to intercept the NPC and were directly killed by Blossoming Tree.</p><br/><p>A swordsman was the most aggressive among melee classes. At level 20, they could learn low level group attack skills. It wasn’t unusual for Blossoming Tree to take care of the mobs in the seconds. Li Cangyu didn’t say much, just escorting the NPCs to move on.</p><br/><p>They had only taken a few steps after handling the mobs before meeting a team with unified IDs.</p><br/><p>The other captain saw the escort icon on top of the NPC and directly moved to intercept.</p><br/><p>In order to prevent the NPC from being killed by several teams at the same time, the bounty mission would be transmitted to a separate instance space. The two parties and the NPC were sent to the separate instance, allowing them to launch a fair battle without being disturbed by outsiders.</p><br/><p>In this instance space, the escorts must protect the NPC. The killers only needed to kill the NPC to get the rewards, but if they failed, their experience and gold coins would be added to the final mission rewards.</p><br/><p>A bounty mission was risky but also extraordinarily stimulating. It was the favourite gameplay of the major guild masters.</p><br/><p>Li Cangyu looked around after being transferred to the independent instance and quickly discovered who was making trouble.</p><br/><p>—The Wind and Clouds are Light, the Wind is Leisurely, the Wind Flutters, Wind is Small and Obedient, Wind has Unmatched Style, Wind Flower Snow and Moon.</p><br/><p>The IDs all starting with ‘Wind’ and the unified guild icon over all six heads were really obvious!</p><br/><p>Bai Xuan also recognized them and couldn’t help exclaiming, It is the Wind Colour Guild!]</p><br/><p>Li Cangyu spoke calmly, “You will add blood to the NPC while I will take care of them.”</p><br/><p>After entering the instance, the battle list appeared showing the player IDs on both sides. The other side had a complete six player elite team while Li Cangyu only had Love to Eat Braised Fish, Love to Eat Twice-cooked Pork and Blossoming Tree… three people!</p><br/><p>The vice president of the Wind Colour Guild, Wind and Clouds are Light was surprised and couldn’t help saying in the voice channel, “Three people doing a bounty mission, their courage is too big!”</p><br/><p>Then he typed in the area channel: [Love to Eat Braised Fish, it is three against six. You can still give up the task and give the NPC to us!]</p><br/><p>Li Cangyu saw this and smiled slightly. [Sorry, I’m not used to giving up.]</p><br/><p>Wind and Clouds are Light: [Since you aren’t smart, don’t blame us for bullying you too much!]</p><br/><p>Li Cangyu carefully typed: [I won’t blame you, come on.]</p><br/><p>Bai Xuan, “…”</p><br/><p>Why did he suddenly feel sympathy for the Wind Colour team?</p><br/><p>***</p><br/><p>The six player Wind Colour team soon appeared in the field of view. Li Cangyu quickly pressed his left index finger and found the healer Wind is Small and Obedient. A Water Ball was accurately thrown and directly froze Wind is Small and Obedient in place!</p><br/><p>The six people hadn’t been able to react when they found out that their healer was already frozen. The remaining five people rushed forward.</p><br/><p>Li Cangyu used Flying Feather Steps to quickly walk around the five people. Fireball was pressed immediately, causing small fireballs to directly slam into the leader of the team, Wind and Clouds are Light. The summoner’s elf fire spirit had a very strong attack power. Once hit by three fireballs, Wind and Clouds are Light’s health fall below 40%!</p><br/><p>“Healer, give me more blood!” Wind and Clouds are Light roared on the voice channel. “Melee, interrupt him! Don’t let him use Fireball!”</p><br/><p>[We can’t catch up.] The two melee players were forced to bitterly type.</p><br/><p>Yes, they couldn’t catch up!</p><br/><p>How fast did the elf act? It could be described by: As swift as the wind. In addition, Li Cangyu was a full agility type and his summoner was a ranged class. The knight and berserker in the team were the short-legged beast race, how could they catch up with the elf?</p><br/><p>Li Cangyu fired two more Fireballs and directly took away Wind and Clouds are Light’s residual blood.</p><br/><p>[Love to Eat Braised Fish has killed Wind and Clouds are Light.]</p><br/><p>This prompt appeared in the centre of the screen and Wind and Clouds are Light fell to the ground in an instant.</p><br/><p>—Trying to kill a person first, only for the thief to seize the king.</p><br/><p>The water spirit directly sealed the Wind Colour team’s healer while the fire spirit killed the leader. Li Cangyu was simply too decisive!</p><br/><p>Once the captain died, the elite group of the Wind Colour team became disorderly. Wind and Clouds are Light was angry after falling down to the ground and cried out angrily, “Black magicians! What are you doing?”</p><br/><p>The two black magicians immediately recovered and rushed to stack death spells on Li Cangyu.</p><br/><p>The demon black magician was a ranged magic class. Their movement speed might be slower than elves but their magic attack power was stronger. Once Death Spell was stacked, black magic damage would double.</p><br/><p>It was unfortunate that Death Spell must be seamlessly connected to stack up. Li Cangyu looked at the Death Spell on his body and within five seconds, he suddenly used Flying Feather Steps and moved straight out of the range of the black magician!</p><br/><p>[Damn, it didn’t connect!] Wind has Unmatched Style received the prompt that the ‘other person isn’t in range’ and couldn’t help cursing.</p><br/><p>[What the hell! Why can’t the both of you kill a crispy elf!] Wind and Clouds are Light was furious.</p><br/><p>Li Cangyu, who lost 40% of his health from the black magic spell, let the opponent’s attack range and entered Bai Xuan’s healing range. His control of distance had always been excellent.</p><br/><p>Bai Xuan saw him come near and immediately gave a small healing spell, quickly raising Li Cangyu’s blood.</p><br/><p>The other party’s commander realized that he met a master!</p><br/><p>Wind and Clouds are Light took a deep breath to calm himself down and said, “Don’t worry about the summoner. Kill the healer first!”</p><br/><p>He had been caught unprepared and his thinking was a bit confused, but the vice president of the Wind Colour Guild wasn’t a rookie. Wind and Clouds are Light quickly analyzed the key problem. In order to kill the target NPC, they must first take care of the healer. Otherwise, the healer would keep giving blood to the NPC and they wouldn’t be able to succeed in killing the NPC.</p><br/><p>In any case, they obviously had superior numbers. Even if Wind and Clouds are Light had accidentally died, there were five people. Killing the healer and cleaning up the two outputs wouldn’t be a problem!</p><br/><p>“Kill the healer! Knight and warrior, move closely to interfere with the healer. Black magicians, work together. Xiao Yan, speed up the healing array!” Wind and Clouds are Light calmly commanded.</p><br/><p>However, when the two melee rushed to Bai Xuan’s side to control him, they were bitten halfway.</p><br/><p>Blossoming Tree! The terran swordsman watching the good show finally started to act.</p><br/><p>When comparing melee classes, a swordsman’s defense was inferior to a paladin and the damage caused by a single attack wasn’t as good as a berserker. But the comprehensive abilities of the swordsman was strong, his skills were agile and his attack speed extremely fast!</p><br/><p>Blossoming Tree raised the sword in his hand, used Spirit Lock to freeze the knight in place while Breaking Bone Sword directly stabbed the berserker’s chest. Then he used flexible footwork to quickly approach the two black magicians, directly using the group attack skill Light and Shadow Rotation.</p><br/><p>The silver-white sword danced in the air and the blood of the two black magician’s suddenly fell wildly!</p><br/><p>Light and Shadow Rotation, this was a swordsman’s ranged damage skill. There was a sustainable release, the consumption of blue (mana) was extremely high, and the damage was also extremely high!</p><br/><p>When used against a magic class, a master swordsman’s Light and Shadow Rotation could leave corpses everywhere.</p><br/><p>Li Cangyu saw him use a group attack skill to decrease the other party’s blood and immediately noticed his intentions. He didn’t hesitate to summon a thunder spirit, placing the pet in the middle and firmly pressing a key.</p><br/><p>—Thunder’s Wrath!</p><br/><p>Purple thunder descended from the sky. There was a loud ‘booming’ sound in a 5m rang, directly killing the berserker and black magicians in range.</p><br/><p>[Love to Eat Braised Fish has killed Wind is Leisurely.]</p><br/><p>[Love to Eat Braised Fish has killed Wind has Unmatched Style.]</p><br/><p>[Love to Eat Braised Fish has killed Wind Flower Snow and Moon.]</p><br/><p>Four of the six people died instantly, causing the vice president to feel sluggish.</p><br/><p>“What happened?” The vice president asked.</p><br/><p>[I don’t know… my spirit hasn’t returned yet! It was instantaneous!] The berserker who was killed typed.</p><br/><p>[Was it a critical hit?] A dead black magician asked doubtfully.</p><br/><p>Li Cangyu was very calmly and quickly typed in the team channel: [You kill the healer, leave the knight to me.”</p><br/><p>Blossoming Tree: [OK.]</p><br/><p>The two people agreed. The melee swordsman went to the healer so that the headache healer couldn’t use healing skills. The ranged summoner went to the knight, while the clumsy knight couldn’t fight back…</p><br/><p>Soon, the six member elite group of Wind Colour fell to the ground.</p><br/><p>[Wind and Clouds are Light’s team has failed to intercept the bounty mission. 300 gold coins and 3,000 experience per person has been deducted and has been added to the final reward.]</p><br/><p>[This mission reward has accumulated 2,800 gold coins and 28,000 experience.</p><br/><p>[Love to Eat Braised Fish’s team bounty mission will continue.]</p><br/><p>The system issued three prompts.</p><br/><p>Bai Xuan saw these messages and finally understood Li Cangyu’s intentions. “Don’t tell me that you deliberately had three people do the mission in order to make the elite guilds think we are easy to bully and attract them to rob us? The robbery won’t succeed and we will accumulate rewards!”</p><br/><p>Li Cangyu nodded seriously. “Yes, they took the initiative to send us experience. It is good.”</p><br/><p>Bai Xuan, “…”</p><br/><p>He should be used to Li Cangyu’s thoughts!</p><br/><p>It was the same during his previous commands. Li Cangyu always loved to lay traps in the field. Even if the Canglan team’s overall strength wasn’t high, no captain dared to underestimate Cat God.</p><br/><p>Bai Xuan couldn’t help smiling when he thought of this. He said, “I suddenly feel that the elite group of the Wind Colour team was badly abused by you. Six people faced three people and it turned out like this. It will certainly be difficult for then to accept psychologically. I estimate that the captain over there hasn’t recovered yet.”</p><br/><p>“They walked over freely to rob us, they can’t blame me.” Li Cangyu calmly said before adding, “By the way, did you observe the operations of the swordsman?”</p><br/><p>“Yes, his actions of suppressing the other players’ blood was very clever. It matched your thunder spirit and three people could be killed instantaneously.” Bai Xuan carefully analyzed, his tone filled with obvious appreciation. “The group attack skill Light and Shadow Rotation was especially beautiful. The distance was just right to cover four people on the opposite team. This swordsman is definitely a master. At this level, he won’t lose to professional players.”</p><br/><p>“Don’t you think of a person when you see his name?” Li Cangyu asked.</p><br/><p>“Name?” Bai Xuan silently read the name ‘Blossoming Tree.’ The name wasn’t special but when combined with the sharp Light and Shadow Rotation of the other person, it was easy to associate him with someone!</p><br/><p>“You mean… Xie Shurong?” (This name can mean Withering Tree) Bai Xuan was suddenly startled. “Isn’t this just a coincidence?”</p><br/><p>“It is really a coincidence?” Li Cangyu asked.</p><br/><p>“…” Bai Xuan made a depressed expression.</p><br/><p>Li Cangyu said with a smile, “He was your nemesis at the time but he has already left the Flying Feather team. You shouldn’t care about old things.”</p><br/><p>Bai Xuan replied, “How can I not care when I was chased and killed by him 10 times?”</p><br/><p>“…” Li Cangyu patted his shoulder to comfort him. “It was a tactical need from his position.”</p><br/><p>Bai Xuan took deep breaths to calm down and asked, “If it really is him, why did he come to the new district?”</p><br/><p>Li Cangyu suggested, “Why don’t you talk to him and ask?”</p><br/><p>Bai Xuan nodded and directly sent a private chat message. [Xie Shurong, what are you doing in the new district?”</p><br/><p>In front of the computer, someone’s hands shook on the keyboard while the human swordsman on the screen slipped and directly fell into the lake!</p><br/>\n</div>"}