{"title": "Chapter 18", "id": 18, "volume": 1, "url": "http://boxnovel.org/god-level-summoner-chapter-18", "volume_title": "Volume 1", "body": "<h1>Chapter 18</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 18 – Battle Between Summoners</p><hr/><br/><p>Qin Mo had been thinking when he summoned the blood spider. Now it was the world of the demon and blood kin summoner, yet this Love to Eat Braised Fish was an elf summoner? How could he play with such an outdated style?</p><br/><p>Sure enough, Qin Mo called the blood spider and the other person was motionless. He was bitter by the spider and his blood volume fell by 10%.</p><br/><p>This level wasn’t very good. He didn’t even hide from the spider!</p><br/><p>Qin Mo inwardly sneered and quickly called his second and third pets, the blood snake and the death knight.</p><br/><p>***</p><br/><p>In Miracle, different summoner types could summon different pets. For example, Li Cangyu’s elf summoner could call the four spirits of water, fire, wind and thunder. Meanwhile, the blood kin summoner could call blood-sucking spiders, snakes, death knights and vampire bats.</p><br/><p>Qin Mo’s account was only level 32 and hadn’t yet learned to summon the vampire bat. He only had the first three pets. The blood spider could freeze the opponent, the blood snake was an attack pet while the death knight was a defense pet that protected its master.</p><br/><p>The blood kin summoner not only had a bodyguard in the death knight, they also had the blood-sucking effect of all pet attacks. This was one of the reasons why the blood kin summoner had extremely survivability.</p><br/><p>Calling out so many pets at the same time, Qin Mo’s idea was really obvious. He didn’t put Love to Eat Braised Fish in his eyes and wanted to use violent suppression to directly wipe out the other side!</p><br/><p>Playing with a large number of pets was very cool and also raised morale. Average players were abused by the rookie through this method.</p><br/><p>Qin Mo’s fingers quickly tapped the keyboard, easily controlling three pets. The death knight stayed around to protect him, the blood spider always followed the opponent to interfere with their positions while the blood snake followed to bite!</p><br/><p>However…</p><br/><p>The blood snake had just bitten the opponent and the blood volume had fallen to 70% when Qin Mo found that the other person unexpectedly disappeared from his field of view.</p><br/><p>Flying Feather Steps!</p><br/><p>He turned around and saw that Love to Eat Braised Fish had used Flying Feather Steps to teleport 90 degrees to the right.</p><br/><p>Qin Mo slightly frowned, turned his mouse quickly to adjust the angle of view and let his blood snake bite the opponent again.</p><br/><p>His blood snake was just about to bite when Love to Eat Braised Fish actually used Flying Feather Steps again to teleport 90 degrees to the left side!</p><br/><p>Alternating displacement?</p><br/><p>Some remote players on the field would indeed use footwork skills to alternate positions on the field. It was easy to make the opponent dizzy when repeatedly moving from left to right.</p><br/><p>But who was Qin Mo? He was Ling Xuefeng’s only apprentice! If he had no talent, how could Captain Ling accept him as an apprentice?</p><br/><p>Li Cangyu’s actions were fast but Qing Mo’s angle of view change was also fast. He instantly aligned with the position of the elf summoner and tried to let his blood snake bite the opponent.</p><br/><p>However, he was surprised to find that his snake was actually…</p><br/><p>It got stuck in a big tree!</p><br/><p>Li Cangyu sent a smiley face in the area channel: [Are you too excited? You should look at the terrain. There is a tree here.]</p><br/><p>Qin Mo: […]</p><br/><p>Once these words were sent, Li Cangyu finally started.</p><br/><p>Unlike Qin Mo, who summoned three pets to suppress him, Li Cangyu only called one pet. It was his strongest group attack pet, the thunder spirit.</p><br/><p>Thunder’s Wrath’s fell from the sky, hitting Qin Mo, his blood spider, blood snake and death knight!</p><br/><p>It turned out that Li Cangyu had moved around like this to use the big tree to trap the blood snake and to also gather all of Qin Mo’s pets in one place so they could be killed together!</p><br/><p>Not good!</p><br/><p>Qin Mo felt that the blood of all his pets had decreased and he quickly recalled the blood snake. However, Li Cangyu’s goal wasn’t the blood snake at all. He used Flying Feather Steps to slide around Qin Mo’s body, summoned the fire spirit and instantly shot Fireballs one after another towards the death knight!</p><br/><p>Qin Mo thought that the opponent wanted to kill the blood snake only for him to kill the death knight. Qin Mo suddenly got a chill down his spine!</p><br/><p>A death knight was called the second life of the blood kin summoner. He had been too careless and wanted to suppress the enemy, only to be the one to fall first.</p><br/><p>Qin Mo’s brow wrinkled even further.</p><br/><p>The death knight had the longest cooldown time. It took 45 seconds to summon it again after it was killed. The skill was completely useless in this time and this was simply giving a chance to the opponent.</p><br/><p>Qin Mo immediately turned and attacked the other person with a summoner’s ordinary spells. Meanwhile, he placed the blood snake and spider on the left and right, surrounding the elf summoner!</p><br/><p>Li Cangyu couldn’t help feeling appreciation when he saw this scene. The young boy’s double-line operation was very good. The triangle position of the two pets and the master could completely block the opponent. Ling Xuefeng’s apprentice wasn’t unskilled.</p><br/><p>Unfortunately, he met Cat God who knew summoners very deeply.</p><br/><p>Li Cangyu smiled and didn’t panic. He didn’t avoid the other side’s pets and used Flying Feather Steps to quickly shift. The blood spider and blood snake quickly followed him, leaving a clear path for the fire spirit to throw a Fireball at Qin Mo.</p><br/><p>Qin Mo was very annoyed after being hit by the fireball.</p><br/><p>A blood kin summoner who wasn’t protected by the death knight was actually very fragile. His pets’ attacks could suck blood but the speed at which the spider and snake chased Li Cangyu was definitely not as fast as the fire spirit attacking Qin Mo.</p><br/><p>His pets didn’t absorb much blood and as time passed, he would certainly fall into a disadvantage.</p><br/><p>Li Cangyu used this to create a very beautiful difference in blood volume.</p><br/><p>In less than half a minute, Li Cangyu still had 45% of his blood left while Qin Mo, who had previously been dominant, only had 40% of his blood left!</p><br/><p>***</p><br/><p>The onlooker Xie Shurong couldn’t help smiling. “Qin Mo was too careless. I guess that he doesn’t know how he died.</p><br/><p>Bai Xuan also smiled. “He dared to underestimate Cat God, this little boy’s courage is too big. Even his master Ling Xuefeng doesn’t dare underestimate our Cat God.”</p><br/><p>Li Cangyu said, “Okay, don’t put me on a pedestal. The cooldown of his death knight is finished.</p><br/><p>He just finished speaking when Qin Mo immediately called out his death knight!</p><br/><p>The 45 second cooldown was finally over and the death knight killed by Li Cangyu was summoned again.</p><br/><p>The death knight was designed to be tall and burly, with a silver mask over his face and beautiful dark red armour. This was one of the blood kin summoner’s pets and the master’s best bodyguard. As long as he existed, all damage that the master received was reduced by 20% and he also had a ‘Guardian’ skill. Once used, he could take all damage for his master for three seconds.</p><br/><p>Qin Mo sighed with relief once he had the death knight around to protect him.</p><br/><p>Li Cangyu saw the defensive pet appear and immediately recalled the fire spirit. He stopped attacking Qin Mo and transferred the attack signal to the blood snake.</p><br/><p>Fireball, Fireball, Fireball… Summon Thunder Spirit, Thunder’s Wrath!</p><br/><p>It was a simple skills linkage and the cooldown time was well grasped. The result was purple thunder falling from the sky and Qin Mo’s blood spider and blood snake being smashed together.</p><br/><p>Qin Mo: […]</p><br/><p>Damn! This time the death knight appeared and the enemy no longer attack him, turning to kill the spider and snake instead!</p><br/><p>Qin Mo was simply going to collapse!</p><br/><p>Today he played like he had shackles on his hands and feet. It felt like every move was calculated by the other party and he had fallen into a trap every step… this feeling was particularly irritating.</p><br/><p>Qin Mo’s finger quickly pressed the keyboard and he killed the fire spirit with a summoner’s basic attack.</p><br/><p>He didn’t have any attack pets and the summoner’s own spell damage was very low. But the opponent’s fire elf didn’t have much blood left. He might not be able to kill the master but killing the pet was still possible.</p><br/><p>Li Cangyu saw him move the target and couldn’t help typing: [You should kill my fire spirit.]</p><br/><p>Qin Mo was still for a moment and didn’t respond to the other person.</p><br/><p>Once his spirit recovered, the youth in front of the computer suddenly reddened. Why the hell was this person trying to teach him?</p><br/><p>The Wind Colour guild members also looked at each other. They didn’t expect that the elf summoner could use his hands to quickly type while escaping with Flying Feather Steps.</p><br/><p>Big God Qin Mo must be angry enough to cough up blood. The opponent actually had room to type?</p><br/><p>Qin Mo’s thoughts were messed up while the fire spirit was killed in a few seconds. Li Cangyu immediately summoned his water spirit and started to attack the opponent with Water Ball.</p><br/><p>The water spirit could freeze the opponent and cause certain damage. This damage wasn’t high but the effect on the body was still quite powerful. Li Cangyu needed to freeze Qin Mo and stall until he could use the thunder spirit’s big move to kill Qin Mo and his death knight!</p><br/><p>Qin Mo was entangled by the water spirit and wanted to hit his keyboard.</p><br/><p>The movement speed of the blood kin wasn’t as good as the elves. Once frozen by the water spirit, he couldn’t catch up to the opponent. His spider and snake were also on cooldown and his attack power was insufficient. Without the protection of the death knight, he would already be dead.</p><br/><p>He could only hope for the spider and snake’s cooldown to end. The result was that once he summoned them…</p><br/><p>The opposite summoner also called his fire elf and thunder elf. A bunch of fireballs came followed by another Thunder’s Wrath!</p><br/><p>Boom! The residual blood Qin Mo was directly killed!</p><br/><p>***</p><br/><p>Qin Mo couldn’t respond to what happened as the screen in front of him turned grey from the character’s death.</p><br/><p>The battle was too fast and the summoner was like a gust of wind. He was on the left for one moment, on the right and then behind… He was an unpredictable ghost and combined with his accurate grasp of the pet skills…</p><br/><p>Qin Mo felt… he was killed by the other person like a stupid dog.</p><br/><p>He had his own pride since his debut. He was the disciple of Ling Xuefeng, the strongest demon player in the league!</p><br/><p>He might be a rookie who debuted this season but he was definitely the most powerful rookie in recent years. On the field, he used a wave of pets to suppress his opponents and beat a lot of players. Even the captains of other teams evaluated him as a rare genius boy.</p><br/><p>He had never been this depressed.</p><br/><p>In today’s battle between summoners, he not only couldn’t kill the opponent but he was restricted everywhere. It was like the summoner entered his head and predicted all his thoughts in advance.</p><br/><p>This was a horrible feeling.</p><br/><p>Qin Mo felt pain in his head and could only grab his hair in agitation.</p><br/><p>After killing Qin Mo in the game, Li Cangyu sent him a serious private chat. [You have a lot of talent but you are too impulsive.] The field isn’t just a concept. You rushed all out with your pets without knowing the strength of your opponent. In fact, you have been passive since the beginning.]</p><br/><p>Qin Mo, “…”</p><br/><p>Li Cangyu continued: [Go back to your Master and learn some more. There is still a lot of room for improvement.]</p><br/><p>Qin Mo, “…”</p><br/><p>The teenager’s small face reddened. After a while, he quickly typed: [Who are you?]</p><br/><p>Li Cangyu sent a smiling expression. [It doesn’t matter who I am. The important thing is that you lost because you carelessly underestimated the enemy.]</p><br/><p>His words… they seemed reasonable!</p><br/><p>Qin Mo was unable to refute them and dizzily turned away from the keyboard.</p><br/><p>The Wind Colour guild members looked at each other the office staying silent for a while.</p><br/><p>***</p><br/><p>The Wind Colour team’s training room.</p><br/><p>Qin Mo walked with a lowered head and almost crashed into a person. Vice-Captain Yan Ruiwen just wanted to go out when he saw this young boy’s tortured expression. He couldn’t help wondering, “Xiao Qin? What’s wrong?”</p><br/><p>Qin Mo didn’t speak but his expression made him look like he was crying.</p><br/><p>Yan Ruiwen smiled and rubbed his head. “Your master is looking for you. Go ahead.”</p><br/><p>“…Oh.” Qin Mo walked to the quietest corner of the training room and saw a man sitting there, staring intently at the computer screen.</p><br/><p>This man’s facial lines seemed like they had been elaborated carved by the Creator. The combination of facial features gave off a handsome and courageous air. The cold lights of the training room were projected on him, forming a strange glow around his body that made him look god-like. In particular, his deep and dark eyes that were as bright as a star seemed like a sword that could instantly penetrate the hearts of people.</p><br/><p>Ling Xuefeng, one of the top five of the Miracle Professional League. He was also ranked in the top five most popular players and was ranked first on the demon race players list for many years.</p><br/><p>The captains of the various teams in the league were different but Captain Ling of the Wind Colour team was definitely the most difficult to provoke.</p><br/><p>Qin Mo might be his only apprentice but this man was born with the aura of a strong king. He might not be fierce to players and was even mild, but the players were in awe of him and didn’t dare do anything in front of him.</p><br/><p>Qin Mo saw that he was looking at the team standings on the league’s official website and carefully asked, “Master, you were looking for me?”</p><br/><p>Ling Xuefeng didn’t speak any nonsense and got straight to the point. “Tomorrow, you will play in the arena against Time. Do you have any problems with this?”</p><br/><p>“…” Qin Mo didn’t answer.</p><br/><p>Ling Xuefeng raised his head in confusion and found that this young boy was depressed. His lips were pale and he seemed to have completely lost his confidence.</p><br/><p>“What happened?” Ling Xuefeng turned and asked in a soft voice.</p><br/>\n</div>"}