{"title": "Chapter 25", "id": 25, "volume": 1, "url": "http://boxnovel.org/god-level-summoner-chapter-25", "volume_title": "Volume 1", "body": "<h1>Chapter 25</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 25 – Care</p><hr/><br/><p>The final match of the regular season between Time and Wind Colour ended with an unexpected score.</p><br/><p>The team standings were fixed and the Miracle League would routinely give them a week off for the players to adjust their state and rest.</p><br/><p>The Time team had lost the game but Captain Tan Shitian’s face was very relaxed. He smiled and said to the players, “Hurry up and pack up your things. Let’s go eat at noon, I will treat you.”</p><br/><p>Due to the influence of Captain Tan, the other Time members didn’t show frustrated expressions after losing the game. Instead, they excitedly said, “The league will start the holiday tomorrow. Captain Tan, do you want to go sing karaoke after eating?”</p><br/><p>Tan Shitian asked, “You want to go to KTV?”</p><br/><p>“Of course.” Some members laughed. “Captain Tan, sing and wash our ears.”</p><br/><p>Tan Shitian smiled in agreement. “Okay, I’ll book a room and we will sing songs all night.”</p><br/><p>Everyone cheered except for Cheng Wei, who bowed his head with a sullen expression. “You go sing K, I won’t go since I can’t sing.”</p><br/><p>Cheng Wei could only sing out of tune. This wasn’t a secret in the Miracle League.</p><br/><p>It happened at the party for the end of the third season. Cheng Wei had won the newcomer award and was encouraged to sing. He picked up the microphone and sang ‘Grandma’s Penghu Bay’ that everyone was familiar with. All the captains made a “…” expression.</p><br/><p>Time’s old captain Xu Luo privately commented on Cheng Wei’s singing. “The lyrics are familiar but the tune is Xiao Wei’s own adaptation.”</p><br/><p>Cheng Wei’s signing was so out of tune that it didn’t even have the fundamental tune.</p><br/><p>On the other hand, Tan Shitian’s singing was unique in the league. The low and gentle tone was very good to hear and he was also good at playing guitar. His impromptu guitar playing was at the level of a professional and every time there was a big party, he would be pushed on stage to wash out their ears.</p><br/><p>In the past, Cheng Wei would be very active in playing with everyone whenever the Time team went to KTV. He was a lively and cheerful person who loved excitement. He didn’t mind other people’s jokes whenever he sang.</p><br/><p>Today he didn’t want to go and it clearly wasn’t because he couldn’t sing. He was just in a bad mood.</p><br/><p>Tan Shitian saw him hanging his head and couldn’t help gently pulling Cheng Wei’s wrist. “Xiao Wei, it is normal to win and lose in a game. Don’t take it to heart.”</p><br/><p>“…” Cheng Wei was silent, his mood a bit complicated.</p><br/><p>Cheng Wei knew very well that Time’s loss in today’s battle was completely because of him. Unexpectedly, Tan Shitian didn’t blame him and actually comforted him… Cheng Wei would feel better off if he was scolded.</p><br/><p>Cheng Wei’s mind was still confused by what Ling Xuefeng said.</p><br/><p>Captain Ling had said, “Some people don’t need your help when they fall down.” Was this telling him not to meddle with Cat God? Should he just stand by and watch as Cat God suffered so many twists and turns? In addition, Tan Shitian didn’t agree to let Cat God come to the Time team. Why were these people so indifferent when Cat God was in trouble?</p><br/><p>Cheng Wei didn’t understand. He only felt that his head hurt badly, like sharp needles were piercing his brain.</p><br/><p>Last night, he had been so busy thinking that he couldn’t sleep. When he woke up this morning, he felt like he was walking on cotton and it was difficult to concentrate when he was in the game. He really didn’t want to go to the team gathering.</p><br/><p>Cheng Wei looked back at Tan Shitian’s worried eyes and shook off his hand. “I’m not feeling well. I will return to the team first.”</p><br/><p>After that, regardless of his team member’s doubtful eyes, he carried his keyboard bag and turned to leave.</p><br/><p>Tan Shitian looked at his leaving figure and couldn’t help frowning slightly.</p><br/><p>Lu Xiao asked with confusion, “What happened with Vice-Captain today? Isn’t it just losing one game?”</p><br/><p>Time had lost before. In the past, whenever he lost, Cheng Wei would feel flustered but never depressed. Instead, he would form a fist and vow, “Next time I will kill them! I will definitely win next time!”</p><br/><p>Today he was completely smashed like an eggplant and had a depressed appearance. Wasn’t this completely unlike Cheng Wei’s character?</p><br/><p>The players looked at the captain with great suspicion. Tan Shitian, who knew the inside story, smiled and said, “Don’t gossip. The vice-captain didn’t sleep well last night. He had a cold and was uncomfortable. The matter of singing K will be pushed to the day after tomorrow. Today, I will invite everyone to eat first.”</p><br/><p>A party didn’t mean much without their lively vice-captain so the members immediately agreed with Tan Shitian’s suggestion.</p><br/><p>***</p><br/><p>Tan Shitian took the players to a restaurant near the stadium for lunch. After eating, he specifically packed a dish that Cheng Wei loved to eat and brought it back.</p><br/><p>As he returned to the club, he almost crashed into a man while entering. It was Liang Haibin, captain of the Huaxia Club’s Wulin Branch.</p><br/><p>“Captain Liang.” Tan Shitian stopped him. “Can I ask you a question?”</p><br/><p>As the captains of the Wulin and Miracle branches of the Huaxia Club, Tan Shitian and Liang Haibin were equal. Their training rooms were separated but they would often meet in the dining room when having lunch and would occasionally exchange tactical ideas. Thus, they were very familiar with each other.</p><br/><p>The older Liang Haibin looked at him with confusion. “Xiao Tan, what’s the matter?”</p><br/><p>“How much do you know about Li Cangyu?” Tan Shitian asked.</p><br/><p>“Cat God?” Liang Haibin thought about it seriously. “The Canglan team isn’t a first-class team on the Wulin Side. They always lost in the first round of playoffs. However, Cat God’s personal ability is very strong and he has a high percentage of wins in the arena. I heard yesterday that Canglan was disbanding. Manager Li wanted to invite Cat God to join our team. The strange thing is that the Wulin League said that Cat God’s information has already been secretly transferred.”</p><br/><p>“The information was secretly transferred?” Tan Shitian was a bit surprised. “Do you know which team he went to?”</p><br/><p>“The other side asked for secrecy so I don’t know.” Liang Haibin paused before saying, “My guess is that the biggest possibility is the Dragon Warriors team. This is very like Liu Chuan’s style. He is part of the E-sports League so transferring a player’s data is very convenient for him. Not to mention he has always appreciated Cat God and Cat God’s play style is consistent with the lineup of the Dragon Warriors team.”</p><br/><p>“It makes sense.” Tan Shitian felt thoughtful. “Then Cat God will continue to play in the Wulin League?”</p><br/><p>“Maybe.” Liang Haibin couldn’t help feeling curious. “Why are you suddenly asking about this person?”</p><br/><p>“In fact, the reason is Xiao Wei.” Tan Shitian said with a smile. “He has some relationship with Cat God.”</p><br/><p>“Oh.” Liang Haibin nodded. “Speaking of Xiao Wei, I just saw him coming back alone and he didn’t look good. What’s going on?”</p><br/><p>“He probably isn’t feeling well so I’ll go check on him. Captain Liang, you must be busy.” Tan Shitian said goodbye to Liang Haibin and headed towards the dorms.</p><br/><p>***</p><br/><p>Li Hui, the manager of the Huaxia Club, loved e-sports. After earning a lot of money in Wulin, he set up the MIracle team and recruited many talented players. His business philosophy was very mature, allowing the Time team to win the championship in the first season. Over the past very years, the Time team was among the top teams in the league and the results were very stable.</p><br/><p>The Huaxia Club was the first comprehensive club in China to develop across two games, Wulin and Miracle.</p><br/><p>Manager Li was serious but he was very good to players. The salaries were high and the bonuses were also very generous. The accommodations, food and training room conditions of the team were first class. The club’s dorms were all in a small apartment-style with two rooms and there was a person responsible for cleaning.</p><br/><p>Tan Shitian was only six months older than Cheng Wei. From his debut, he had lived in the same dormitory as Cheng Wei.</p><br/><p>He took out the key and opened the door to the dorm room. There was no one in the living room while the door to Cheng Wei’s bedroom was tightly closed.</p><br/><p>In the past, Cheng Wei would excitedly stay in the living room to watch video replays, look through Weibo and play mobile games. Today was the first time he went directly to his bedroom.</p><br/><p>Tan Shitian opened the door to the bedroom and saw that Cheng Wei was already sleeping.</p><br/><p>He had his quilt wrapped tightly around him with only his head showing.</p><br/><p>Tan Shitian smiled and walked over to sit by the bed. He gently touched Cheng Wei’s head. “Are you pretending? Or are you really uncomfortable?”</p><br/><p>Cheng Wei moved his head and spoke in a hoarse voice. “Leave me alone, let me sleep for a while.”</p><br/><p>“Your voice has become like this. Are you crying?” Tan Shitian smiled and turned over Cheng Wei, only to find that his face was unusually pale and his brow tightly wrinkled. He looked very uncomfortable.</p><br/><p>Tan Shitian stretched out a hand and was shocked by the head from the forehead!</p><br/><p>“You are burning up!” Tan Shitian immediately got up to find fever medicine. He poured a cup of warm water and pulled Cheng Wei up against his chest. He fed Cheng Wei the medicine and placed an ice towel on Cheng Wei’s forehead.</p><br/><p>Cheng Wei was in a daze and could only feel that someone was taking care of him. The feeling of coldness on his forehead made him feel comfortable and he couldn’t help leaning his head against Cheng Wei’s chest.</p><br/><p>Tan Shitian’s heart softened and he brought out a clean tower, helping Cheng Wei wipe the sweat off his forehead.</p><br/><p>Cheng Wei was a player who debuted in the third season but Tan Shitian always felt that he wasn’t grown up or mature.</p><br/><p>Despite being the vice-captain of Time, he didn’t have too much control over the team’s affairs. He still had a child’s heart and didn’t think too much when speaking. Every day, Cheng Wei would happily train and plain. He often had a bright smile on his face and when he became angry, his cheeks bulged out and the speed of his talking increased. Once it was over, he would smile and address Tan Shitian in a familiar manner.</p><br/><p>—He was a very simple person.</p><br/><p>Compared with other vice-captains of the Miracle League, Cheng Wei was simply a small, white rabbit.</p><br/><p>The vice-captain loved to play and the captain had to take on all the responsibilities.</p><br/><p>Due to this, Tan Shitian grew quickly after taking over as captain last season.</p><br/><p>Captain Xu had told him when handing over the captaincy, “Xiao Wei debuted earlier than you but he is always heartless and won’t manage the team. Your responsibility will be heavy in the future. If you don’t understand something, talk with your predecessors in the league. You are the youngest captain in the Miracle League. Don’t be arrogant. Keep a modest attitude and you will gain a foothold in the league.”</p><br/><p>Tan Shitian followed his master’s teachings. Once he was captain, he always smiled and showed an active team atmosphere. He was gentle and cordial, never putting on airs with his teammates. He was also very respectful to the senior players. Regardless of winning or losing the match, his mood was always very calm.</p><br/><p>He was modest and humorous since his debut and his elf archer had a very distinct style. His leadership progressed rapidly and he often wrote fun jokes on Weibo. Tan Shitian, who had the nickname of Storytelling God, quickly won the hearts and minds of the fans of the Time team and was also acknowledged by other captains in the league.</p><br/><p>However, Tan Shitian was very clear that Cheng Wei’s heart didn’t agree.</p><br/><p>Not only did he debuted later than Cheng Wei, his style of leadership was very different compared to Cheng Wei’s idols, Captain Xu and Cat God. It was understandable that Cheng Wei didn’t acknowledge him as captain.</p><br/><p>Tan Shitian couldn’t help sighing when he thought of this. “Xiao Wei, I know that you don’t agree with me as captain. Compared to Captain Xu and your idol Cat God, I am very poor… but I have been working hard to raise a good Time team. I’m not a narrow-minded person and I won’t ruin Master’s hard-laid foundation… trust me, okay?”</p><br/><p>Cheng Wei couldn’t hear what Tan Shitian was saying due to his fever. His consciousness was blurred but he seemed to capture the key points in Tan Shitian’s words. He couldn’t help crying out, “Master…”</p><br/><p>Tan Shitian was startled. He knew that the master Cheng Wei was referring to wasn’t the old captain of Time but the master of his heart, Li Cangyu.</p><br/><p>Cheng Wei rarely mentioned Cat God but after living in the dorms with him for two years, Tan Shitian gradually found some clues and became aware of the relationship between Cheng Wei and Li Cangyu.</p><br/><p>Tan Shitian rubbed Cheng Wei’s head and said softly, “Cat God is likely to turn to the Dragon Warriors Club. If this is the case, he will certainly have a better development so don’t worry about him.</p><br/><p>Tan Shitian picked up the towel that had become hot and went to the bathroom. He washed it with cold water and once again placed it on Cheng Wei’s forehead.</p><br/><p>Cheng Wei was cared for very comfortably and finally slept.</p><hr/><br/><p>You can also join my discord channel to chat with fellow readers about the novels;</p><hr/><br/>\n</div>"}