{"title": "Chapter 29", "id": 29, "volume": 1, "url": "http://boxnovel.org/god-level-summoner-chapter-29", "volume_title": "Volume 1", "body": "<h1>Chapter 29</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 29 – The Past</p><hr/><br/><p>The first time Li Cangyu met Ling Xuefeng was when he was 17 years old in the online game.</p><br/><p>At that time, a Miracle server opened in China and Li Cangyu went to ‘Magic Academy’, the first major district in Miracle with several good friends. He had been good friends with them since childhood and they were as close as brothers.</p><br/><p>The five people teamed up to level in the new district, walking out of the novice village, walking to the first main city, clearing the first instance, gaining their first piece of equipment, etc. They played happily all the way to level 35. There might be frequent bumps on the road but the process was full of fun.</p><br/><p>At level 35, the more difficult instance Frost Temple opened. At this time, Li Cangyu was still a rookie and he tried to beat the boss for three hours. In desperation, he had to shout for people on the world channel.</p><br/><p>[Looking for a violent output for Frost Temple! One spot is open!]</p><br/><p>Then a demon summoner called LXF quickly joined the team.</p><br/><p>He was a handsome man in a demon outfit, with a pair of black wings and glowing light wings on his back, making him look a bit strange.</p><br/><p>Li Cangyu asked curiously: [LXF, are these three letters the abbreviation of your name?]</p><br/><p>[Yes.] Ling Xuefeng didn’t hide it. [it is convenient.]</p><br/><p>Then he was too lazy!</p><br/><p>Li Cangyu said: [I’ll add you as a friend and we can clear the instance together.]</p><br/><p>Ling Xuefeng asked: [Do you know how to fight it?]</p><br/><p>Li Cangyu replied very honestly: [No.]</p><br/><p>Then Ling Xuefeng decisively said: [Come with me, I will lead.]</p><br/><p>The six people played the instance together. The surprising thing to Li Cangyu was that the level of the demon summoner was very high. He had a lot of experience fighting the boss and they managed to smoothly pass the instance.</p><br/><p>The people who got a lot of equipment immediately typed excitedly in the team channel. [A master!]</p><br/><p>Then they added Ling Xuefeng as a friend.</p><br/><p>Magic Academy was the first new district to open in the national server. Most people would be playing the Frost Temple instance for the first time. LXF was so familiar with the boss’ gameplay that he obviously hadn’t just started Miracle.</p><br/><p>Li Cangyu couldn’t help asking him privately: [Have you played this game before?]</p><br/><p>The other person replied: [I played for a few months in the US server.]</p><br/><p>Li Cangyu suddenly realized. [The US service did start half a year earlier than the national service. Then did you rise to the maximum level in the US server?]</p><br/><p>[Yes.]</p><br/><p>[Then can you help us? We just started playing and don’t understand things very well.]</p><br/><p>[No problem.]</p><br/><p>***</p><br/><p>Since Ling Xuefeng was a master of Miracle, the rookie Li Cangyu naturally had a good impression of him.</p><br/><p>LXF’s words were short every time he replied, making it seem like he really didn’t like to talk. The rare thing was that he didn’t put on any airs or despise the rookie Li Cangyu.</p><br/><p>Everyone teamed up and cleared several instances in a row, becoming more familiar with each other. Li Cangyu felt it was good to know a veteran of Miracle and couldn’t help asking him: [Yes, I want to play an elf summoner. However, the guides on the forums say that an elf is more suitable for playing an archer. I think that an elf summoner will be very strong, using the advantages of agility to quickly switch pets and increase the critical hit rate. This will make up for the pets’ lack of attack.]</p><br/><p>[Are you talking about a full agility elf summoner with the critical hits route?] Ling Xuefeng was a veteran of online games and was naturally familiar with this type of build.</p><br/><p>[Yes. I think so.] Li Cangyu spoke seriously. [I asked on the forum yesterday and everyone said this type of build is impossible to achieve. You have played in the US server so I would like to ask you. Is it feasible?]</p><br/><p>The small rookie Li Cangyu humbly asked the master. Ling Xuefeng didn’t immediately deny him like other people, encouraging him instead. [Right now, Miracle has just opened its service and the game is in the exploratory stage. Not many people play an elf summoner but the principle isn’t wrong. Don’t listen to what other people say. If you have an idea, try it out boldly.]</p><br/><p>[Okay.] Li Cangyu originally hadn’t intended to give up this idea and now it was affirmed by a veteran. Li Cangyu felt very happy and his belief in trying an elf summoner was strengthened.</p><br/><p>Later, the six people would often play together to clear instances. After getting to know each other, they discovered that Ling Xuefeng had set up the Wind Colour Guild and was actually the president.</p><br/><p>There were numerous guilds in the district but the strength of the Wind Colour Guild was high and there were many masters. They beat a lot of world bosses and had the loudest reputation.</p><br/><p>Ling Xuefeng once invited Li Cangyu’s five people to join the Wind Colour team but Li Cangyu refused. [We have different levels and are accustomed to acting freely. We don’t want to participate in the big guild activities.]</p><br/><p>Ling Xuefeng didn’t force him.</p><br/><p>After reaching full level, a variety of guild missions opened and Ling Xuefeng would lead his members to complete the tasks. His communication with Li Cangyu gradually lessened.</p><br/><p>However, in his spare time, he would go to his friends list to find the ID ‘Old Cat’ and ask about the other person’s current situation.</p><br/><p>[How is your summoner’s equipment going?]</p><br/><p>Li Cangyu replied: [I’m still missing a necklace with attack power.]</p><br/><p>[I received one in the instance today. I will give it to you so meet me at Yisu City’s east gate.] Ling Xuefeng sent the equipment to Li Cangyu.</p><br/><p>[Thank you!] Li Cangyu was happy about completing his full set of equipment.</p><br/><p>[Do you want to try PK?] Ling Xuefeng sent him a request and Li Cangyu accepted. The two people fought each other at the grand plaza in front of the east gate.</p><br/><p>Li Cangyu had pondered on the elf summoner for a long time and gradually developed the use of Flying Feather Steps to move while quickly summoning pets. Still, he wasn’t skilled enough at present and he fell under Ling Xuefeng’s fierce offensive in half a minute.</p><br/><p>Li Cangyu wasn’t discouraged after being beaten. He climbed up and said: [Great!]</p><br/><p>Ling Xuefeng typed: [It seems you have more experience with the elf summoner gameplay?]</p><br/><p>Li Cangyu replied without hesitation: [Yes, I have been studying these days and thought of some ideas, but the operation still isn’t very skilled.]</p><br/><p>[Do you want to practice another round?]</p><br/><p>[Okay.] Li Cangyu was naturally very excited about sparring with a master and immediately sent an invitation.</p><br/><p>Thus, the two of them played against each other for more than an hour and reluctantly went to sleep in the early hours of the morning.</p><br/><p>***</p><br/><p>From that day onwards, every evening after the guild missions, Ling Xuefeng would come to the east gate of Yisu City to fight with Li Cangyu.</p><br/><p>In fact, Li Cangyu’s level was really good for a newcomer just starting Miracle. Ling Xuefeng had experience with playing Miracle on a foreign server for six months and was naturally more powerful than Li Cangyu. If they fought 10 times, Li Cangyu would lose 10 times.</p><br/><p>However, Ling Xuefeng was very clear that the other person was only losing right now because of his lack of experience and unskilled operations. Despite this, he pushed himself to try big moves and after a while, this person would definitely become a master.</p><br/><p>The two people often discussed how to play a summoner. For example, when should a pet be summoned, how to operate in order to move the pets to the exact location with the shortest time, how to mix up the pets’ skills…</p><br/><p>The pets for the demon race and elves might be different but the principles were very similar.</p><br/><p>The result of this mutual communication was that both of them progressed at a rapid speed. Li Cangyu always felt that he learnt something from this communication while Ling Xuefeng thought that Old Cat’s ideas were very novel and gave him a lot of inspiration.</p><br/><p>Thus, no matter how busy he was as president of Wind Colour, Ling Xuefeng would come to the Yisu City east gate to find Old Cat at a fixed time. Old Cat would always be waiting there. Once they met, there was no need to speak as they would instantly send each other an invitation.</p><br/><p>The two people didn’t make a verbal agreement but at 22:00 every night, many players would see a demon summoner and elf summoner fighting in the big square at the east gate of Yisu City.</p><br/><p>One day, after playing five rounds, Ling Xuefeng couldn’t help asking: [By the way, can I ask how old you are?]</p><br/><p>[I am 17 years old.] Li Cangyu replied. [How about you?]</p><br/><p>[I am a year older than you.] Ling Xuefeng said.</p><br/><p>Li Cangyu realized that they were peers. No wonder why there were no obstacles to their communication.</p><br/><p>Ling Xuefeng felt some surprise. The ID of ‘Old Cat’ was reminiscent of a 30 year old uncle yet he was unexpectedly a 17 year old youth. This was clearly a deep ‘kitten!’</p><br/><p>Ling Xuefeng thought this and couldn’t help typing: [You are only 17 years old. Why are you called Old Cat?]</p><br/><p>Li Cangyu said earnestly: [It sounds more powerful.]</p><br/><p>Ling Xuefeng, “…”</p><br/><p>After a moment of silence, Ling Xuefeng said: [You are younger than me. I won’t call you Old Cat and will just call you Cat.]</p><br/><p>[It doesn’t matter.] Li Cangyu said. [Maybe later I will become Cat God and then I’ll send you an autograph!]</p><br/><p>The always stern Ling Xuefeng was amused by this youth’s confidence and smiled.</p><br/><p>He thought that this guy was very interesting. His age was so young, his ideas were novel, his progress was very fast, he was confident and he had a spirit of perseverance. He had been abused so many times by Ling Xuefeng but didn’t feel discouraged. Ling Xuefeng had a hunch that this boy called Old Cat would certainly have great achievements in Miracle in the future.</p><br/><p>***</p><br/><p>The two people naturally became closer after knowing their ages were similar. They become friends and once free, they would sit idly in front of Yisu City’s east gate, exchanging ideas and learning from each other.</p><br/><p>The rookie Li Cangyu always lost to the master Ling Xuefeng but he didn’t feel frustrated. Li Cangyu had just started playing Miracle and Ling Xuefeng could teach him a lot. Every time, he would immediately rise up and continue to fight. Every day, he rejoiced in his progress.</p><br/><p>[This time, I survived for 65 seconds. That is 5 seconds more than I did last time.]</p><br/><p>[You have progressed very quickly and I’ve lost blood.]</p><br/><p>Li Cangyu replied seriously: [Next time, maybe I can win.]</p><br/><p>[Come on.]</p><br/><p>One day, Li Cangyu would beat Ling Xuefeng.</p><br/><p>Li Cangyu was convinced of this.</p><br/><p>This day hadn’t arrived yet when the Chinese Miracle League was established and Miracle’s official website announced the official launch of the professional league.</p><br/><p>In order to attract outstanding talents to join the league, the bonuses for the first season were very high. The officials promised that all teams that made the playoffs would be provided financial support, so that players could be relieved of their worries.</p><br/><p>Li Cangyu heard that many places were building a Miracle team and he also watched various e-sports competitions from an early age. In addition, he especially loved the gameplay of the elf summoner so he wanted to participate in this league.</p><br/><p>Bai Xuan and the other three small players were also very interested in this professional league. They had honed their skills in the online game and had become famous masters in the district. The five people went to a private room in the Internet cafe and excitedly discussed the possibility of team formation.</p><br/><p>“Captain, let Brother Li be Captain!” Someone suggested.</p><br/><p>“No problem.” Li Cangyu wasn’t polite since he always played the role of everyone’s oldest brother in this small group. He thought about it before saying, “Let’s first decide a team name.”</p><br/><p>The group of people had their own opinions like Conquering Team, Disdain the World, etc. They thought for a long time but nothing was suitable.</p><br/><p>Finally, Bai Xuan—who was very good in English—suggested a name. “Should we call it FTD? The abbreviation of For the Dream?”</p><br/><p>Li Cangyu felt that this name was very special and made a decision. “Okay! It will be the FTD team!</p><br/><p>“Great! The FTD team!”</p><br/><p>“Come on, this season’s championship will be ours!”</p><br/><p>“The hundreds of thousands of yuan in grand prizes is waiting for us to take!”</p><br/><p>The group of teenagers were extremely excited, as if they were standing on the champion’s podium and would soon receive the trophy.</p><br/><p>Only Bai Xuan was relatively calm as he suggested, “According to the announcement of the official website, there will be three people in the single-elimination battle. The three of you are outputs and are just enough. However, the group battle is the 6V6 crystal mode. We are five people… we are lacking one so do you want to pull over LXF?”</p><br/><p>A friend next to him cried out, “Yes! Perhaps he wants to play in the professional league?”</p><br/><p>Bai Xuan looked at Li Cangyu. “What do you think?”</p><br/><p>Li Cangyu said, “Let me ask him.”</p><br/>\n</div>"}