{"title": "Chapter 23", "id": 23, "volume": 1, "url": "http://boxnovel.org/god-level-summoner-chapter-23", "volume_title": "Volume 1", "body": "<h1>Chapter 23</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 23 – Thrilling Moment</p><hr/><br/><p>Li Cangyu knew that if Ling Xuefeng personally appeared as the guard, Wind Colour would definitely be able to win three points in the single-elimination battle. However, he gave this opportunity to the newcomer Qin Mo who just debuted this season. It was obviously to hone his young apprentice’s mind.</p><br/><p>As the captain, sometimes the team’s performance wasn’t the only thing to be considered. It was also the status of each team member.</p><br/><p>Qin Mo was Ling Xuefeng’s apprentice and his debut came with a halo. Combined with his young age, he found his own position relatively easily after playing a few times. Now Ling Xuefeng put him as the third player in the arena against the master Tan Shitian. It was estimated that Ling Xuefeng was ready to lose three points.</p><br/><p>Sometimes words wouldn’t have as deep an effect as personal experience. Ling Xuefeng often used such cruel but effective methods to let players completely wake up. He was the league’s least nonsense and most effective captain.</p><br/><p>Li Cangyu thought this and couldn’t help sighing in his heart.</p><br/><p>The pressure on Ling Xuefeng’s shoulders during these years wasn’t much smaller than Li Cangyu’s own. Li Cangyu was the captain of a weak team. It might be difficult to win a game but no one would scold him when the results were poor and his mentality was more relaxed. Meanwhile, Wind Colour had always been a big club. Every time they lost a game, Ling Xuefeng would be scolded by the sunspots on the Internet. If he didn’t win the championship, he would have to face various pressures such as sponsorship funds and advertisers.</p><br/><p>Still, Ling Xuefeng was a tough person. Every time the Wind Colour team encountered troubles, he would take the responsibility. This made the team members have an unconditional trust in him.</p><br/><p>No matter who played in the arena, the team members wouldn’t say a word as long as it was under Captain Ling’s orders.</p><br/><p>The fans weren’t as rational. Once they saw that the guard wasn’t Captain Ling but his apprentice Qin Mo, many people questioned it in the comments:</p><br/><p><i>-Xiao Qin has performed well but his experience is still insufficient. Captain Tan might be able to make a comeback.</i></p><br/><p>–<i>I admit that the young apprentice has potential but isn’t Captain Ling too bold to put the young newcomer in the guard position?</i></p><br/><p>–<i>Why didn’t Captain Ling personally go?</i><i>Win in person!</i></p><br/><p>The Wind Colour fans were disturbed while the Time fans saw hope. In the comments area, they screamed:</p><br/><p><i>-Cheering on Captain Tan’s comeback!</i></p><br/><p>–<i>Don’t be polite to Wind Colour’s Qin Mo!</i></p><br/><p>***</p><br/><p>Tan Shitian’s expression didn’t change when he saw that Wind Colour unexpectedly sent the rookie Qin Mo.</p><br/><p>No matter who the opponent was or the current situation, he always had a relaxed and happy expression when playing the game. It felt like he enjoyed every type of game. Li Cangyu didn’t understand Tan Shitian’s style of play yet but this mentality was really very rare.</p><br/><p>In contrast, Qin Mo seemed excited. His fingers were slightly shaking as he pressed them against the keyboard.</p><br/><p>This was the first time he played against Tan Shitian. He must play well in order to live up to his master’s trust and prove his strength.</p><br/><p>At present, he was full of blood and blue. Meanwhile, Tan Shitian only had 70% blood and 75% blue. The advantage was still quite big!</p><br/><p>Qin Mo took a deep breath and wanted to call out his four blood kin pets in order to surround the person. Suddenly, one person’s words filled his mind. ‘You rushed all out with your pets without knowing the strength of your opponent. In fact, you have been passive since the beginning.’</p><br/><p>—Sender: Love to Eat Braised Fish.</p><br/><p>Qin Mo was stunned as he remembered the words he exchanged with Love to Eat Braised Fish. His fingers couldn’t help hesitating.</p><br/><p>Was it too rash to call out four pets? Qin Mo thought about it and simply summoned his death knight. He wanted to improve his defense first and then seize the opportunity to counterattack.</p><br/><p>However, Tan Shitian didn’t give the opponent a chance to defend against the attack. He saw that Qin Mo summoned the death knight and unceremoniously fired the bow and arrow in his hand. He shot five consecutive arrows in an incomparable manner and instantly killed QIn Mo’s defensive pet!</p><br/><p>“Tan Shitian is an archer and his bow and arrows belong to the cold weapon type. This is meant for breaking the defense system of the fragile magic classes. Qin Mo’s actions aren’t reasonable. In front of an archer, it is impossible for a summoned death knight to defend.” Yu Bing disagreed with Qin Mo’s approach but she still gave the young teenager some face, tactfully saying, “As a newcomer facing Captain Tan, Qin Mo’s desire to be defensive is understandable.”</p><br/><p>When Qin Mo had played against Li Cangyu, both of them were summoners of the magic classes. Meanwhile, Tan Shitian was an archer who used cold weapons and the playing strategies against him were completely different. Qin Mo once again fell into thinking the wrong way.</p><br/><p>Li Cangyu couldn’t help frowning slightly. “Qin Mo is looking for death in this game.”</p><br/><p>Xie Shurong spoke up, “He was abused by you once and has slowed down. It is obviously a problem of his mentality.”</p><br/><p>Li Cangyu nodded. “It seems Ling Xuefeng was right in his desire to hone Qin Mo’s mind. I didn’t do my best when I abused him that day.”</p><br/><p>Xie Shurong, “…”</p><br/><p>If Qin Mo heard these words, it was estimated that he would be crying because of Cat God!</p><br/><p>***</p><br/><p>On the field, the death knight was killed and Qin Mo couldn’t help remembering the day he fought Love to Eat Braised Fish in the game.</p><br/><p>Tan Shitian wasn’t nervous. As the youngest captain in the league, his qualifications were first-class and his ability to grasp opportunities extremely strong. The moment Qin Mo’s thoughts were wandering, dense arrows fell from the sky.</p><br/><p>Death Arrows Rain!</p><br/><p>“Captain Tan has directly used a big move!” Kou Hongyi couldn’t help marveling. “It is the ultimate technique of an archer and Captain Tan really isn’t polite! He caught the moment when Qin Mo had no pets and used this ultimate big move, directly knocking out 35% of Qin Mo’s blood.</p><br/><p>Yes, Tan Shitian used less than five seconds to reverse the advantage made by the previous hard-working members of Wind Colour.</p><br/><p>This move was greeted with enthusiastic applause. It was apparent that the Time fans were cheering for their captain’s decisive shot.</p><br/><p>All previous advantages were gone…</p><br/><p>Qin Mo’s fingers started to shake and he felt that his mind was blank. The keyboard shortcuts that he clearly remembered were a bit fuzzy and he didn’t know what to do next.</p><br/><p>How should he fight so that he wasn’t suppressed?</p><br/><p>Qin Mo wondered this and got a splitting headache.</p><br/><p>Shock Shot!</p><br/><p>Rapid Shooting!</p><br/><p>Seize Life Shot!</p><br/><p>Tan Shitian fired his arrows and three consecutive moves hit Qin Mo again!</p><br/><p>Qin Mo was like a target, stupidly standing there to be hit by Tan Shitian, the three moves directly reducing his blood to 40%.</p><br/><p>This was simply a master abusing a weak person.</p><br/><p>Even if the player for Wind Colour was a newcomer, how could he be completely suppressed by Tan Shitian without making an effort to fight back?</p><br/><p>The netizens were upset while Yu Bing couldn’t help frowning. “It might be because today’s match is at 9 in the morning. Perhaps it is too early and some players aren’t fully awake?”</p><br/><p>She endured it for too long and couldn’t help letting out some venom in her words.</p><br/><p>She woke up early in the morning to commentate only to be shown this?</p><br/><p>The game was extremely disappointing. Cheng Wei was sleepwalking and somehow had 50% of his blood knocked out. Meanwhile, Qin Mo seemed to have lost his soul and stood there in the same spot, acting like a target as he was destroyed by Tan Shitian. Yu Bing even felt there she was in the wrong place.</p><br/><p>Wasn’t this the showdown between the giants of Wind Colour and Time? Why did it feel like a match between weak teams?</p><br/><p>In the arena, Tan Shitian killed Qin Mo without any pressure. Qin Mo had been full of blood and Tan Shitian had 70% blood when the duel started. When Qin Mo died, Tan Shitian still had 70% blood.</p><br/><p>Qin Mo didn’t knock out a single drop of blood from Captain Tan.</p><br/><p>Qin Mo looked at the screen that turned grey when his character died and was pale and bloodless, his expression looking like he was about to cry.</p><br/><p>Tan Shitian might’ve easily won the arena battle but his heart was full of doubts. ‘What happened?’ Captain Ling’s apprentice shouldn’t be so weak.</p><br/><p>***</p><br/><p>The soundproof room of the Wind Colour team.</p><br/><p>Ling Xuefeng didn’t say anything to Qin Mo when he saw Qin Mo coming over. He just looked calm as he said, “Prepare for the group battle.”</p><br/><p>Qin Mo didn’t need to fight in the group battle and could only sit quietly in the corner. His head bowed low as he feared attracting other people’s attention.</p><br/><p>There was a five minute intermission before the group battle started.</p><br/><p>There were many Miracle team battle maps and the crystal refresh point in each map wasn’t the same. However, professional players were already familiar with the library of maps and there would be no unfamiliar maps.</p><br/><p>During the regular season, the two sides would exchange maps for the home and away games. Today was the home match of the Time team so Tan Shitian selected the map.</p><br/><p>Once the group battle began, Tan Shitian sat in the command position and his mouse quickly scrolled through the maps library, selecting one.</p><br/><p>—Frost Temple.</p><br/><p>Commentator Kou Hongyi smiled and said, “This map is an instance in the online game. Online game players should be familiar with it?”</p><br/><p>Gu Siming actively replied, “Yes, we are currently clearing this instance!</p><br/><p>Bai Xuan was speechless. “He can’t hear your answer…”</p><br/><p>Xiao Gu scratched his head and said with a smile, “In Frost Temple, the refresh locations of the three crystals are very close. No matter which one the teams try to steal, there will certainly be major battles!”</p><br/><p>Li Cangyu asked, “Xiao Gu, you are very familiar with the league maps?”</p><br/><p>Gu Siming nodded. “Yes, I have studied all the maps and know the crystal locations.”</p><br/><p>Li Cangyu exclaimed, “You did your homework well.”</p><br/><p>In some game maps, the crystals would refresh at the 12 o’clock and 6 o’clock positions and the two sides might miss each other.</p><br/><p>There were also maps like Frost Temple, where the crystals refreshed in three consecutive rooms. It meant that no matter which crystal they went after, they might encounter opponents and a team battle was unavoidable.</p><br/><p>“Frost Temple is a circular map. The red, blue and white crystals will respectively refresh at points one, two and three with only one wall between them. It seems that Captain Tan is ready to fight the Wind Colour team.”</p><br/><p>Yu Bing just finished speaking when the players list for both teams appeared on the big screen.</p><br/><p>Time had a beast paladin in the front row, three elf archers as remote output, Cheng Wei’s angel white magician for control and an angel priest for healing.</p><br/><p>On the Wind Colour side, there was Ling Xuefeng’s demon summoner, Xu Feifan’s blood kin summoner for double control, Yan Ruiwen and Guo Xuan’s black magicians playing output, a beast berserker in the front row and a blood kin sacrifice healer.</p><br/><p>Bai Xuan looked at Li Cangyu and couldn’t help raising a thumb. “Wind Colour really sent out this lineup. You guessed Ling Xuefeng’s layout.”</p><br/><p>“It is just a coincidence.”</p><br/><p>This was too much to be a coincidence. The game was about to start soon and Bai Xuan had no time to discuss the coincidence with him.</p><hr/><br/><p>You can also join my discord channel to chat with fellow readers about the novels;</p><hr/><br/>\n</div>"}