{"title": "Chapter 43", "id": 43, "volume": 1, "url": "http://boxnovel.org/god-level-summoner-chapter-43", "volume_title": "Volume 1", "body": "<h1>Chapter 43</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 43 – Guild War</p><hr/><br/><p>Flying Feathers Frost was really reliable. She could sorted out a few side accounts and sent the accounts and password to the president through Q.</p><br/><p>This batch of side accounts were leveled by a training studio. The current level was close to the major forces and also had the initial big moves of various classes. Their equipment wasn’t good but this wasn’t a problem. The initial equipment in the game wasn’t binding and they could casually exchange equipment.</p><br/><p>Flying Feathers Liangshan picked 12 level 51 accounts to form two teams. Then he sent the accounts to the Flying Feathers experts and calmly said, “Everyone control the side accounts to block Love to Eat Braised Fish.”</p><br/><p>He wanted to personally test the identity of Love to Eat Braised Fish. The side accounts hadn’t been added to the guild and these actions wouldn’t make trouble for the Flying Feathers Guild. The two teams had a range of melee and remote classes, all of which were the most common instance team configuration in online games. It wasn’t easy to think of the Flying Feathers Guild when seeing the team.</p><br/><p>The Flying Feathers president was excellent at spy games so he planned a seamless attack.</p><br/><p>***</p><br/><p>After level 50, the second main city ‘Zeya Castle’ officially opened and the Demon Forest instance gave less experience. The old players of Miracle preferred hunting in the areas around Zeya to quickly level up.</p><br/><p>The mobs around Zeya Castle were all active monsters level 50 or above. Generally, 30 people would gather to form an ‘experience group’. The thick paladins were responsible for drawing the monsters, the outputs were dedicated to killing monsters and the healers took care of the blood. The experience group’s leveling speed was much faster and simpler than the instance.</p><br/><p>Of course, if they didn’t have a 30 member experience group then they could form a team of six to go to a place with fewer monsters. As long as the players killed the monsters, the leveling speed was also very fast.</p><br/><p>Flying Feather Liangshan quickly asked for the coordinates of Love to Eat Braised Fish.</p><br/><p>[Love to Eat Braised Fish is in the woods outside Zeya Castle, killing demon beast variants.</p><br/><p>The demon beast variants were tall, melee attack beast monsters. They were level 52 and killing them gave a lot of experience. However, the demon beast variants took half a minute to refresh and wasn’t suitable for a team of 30. It was more suitable for a team of six to level up.</p><br/><p>Due to this, Flying Feathers Liangshan only saw Love to Eat Braised Fish’s team when he arrived at the west forest.</p><br/><p>The neat ‘Food Squad’ above their heads proved that these six people were members of Love to Eat Braised Fish’s fixed team.</p><br/><p>Once he saw the paladin ‘As the Name Suggests’ pull a demon beast variant and the other members attacked the beast variant in an orderly manner, Flying Feathers Liangshan immediately ordered, “Go!”</p><br/><p>The president gave the command and the 12 people quickly rushed forward.</p><br/><p>At the same time, Li Cangyu said on the voice channel, “Disperse!”</p><br/><p>He had already seen people sneaking in the distance. Therefore, once the group of people moved, he immediately had his teammates spread out.</p><br/><p>Bai Xuan, Xie Shurong and Xiao Gu ran to the left while Li Cangyu, Steamed Bass and Awakened Magician ran to the right.</p><br/><p>Flying Feathers Liangshan hadn’t expected the other party’s reaction to be so fast and was stunned. He soon changed his order. “Team 1 to the level, team 2 to the right, kill them!”</p><br/><p>***</p><br/><p>In Miracle, level 50 was counted as a threshold.</p><br/><p>Before level 50, there was the novice protection and players didn’t lose experience when dying. Players above level 50 were no longer protected by the system and those who were killed would lose experience and equipment.</p><br/><p>Li Cangyu already guessed the other side’s intentions.</p><br/><p>It was to kill his fixed team and let them lose experience after death. As long as their level fell below 50, they would be unable to participate in Saturday’s guild challenge instance.</p><br/><p>This type of wild killing to make the other party lose levels was really simple and rude.</p><br/><p>Bai Xuan also guessed this and asked in the voice channel, “Which guild would be so bold? They unexpectedly dared to come kill us in the wild. Didn’t they see that Wind Colour and Flying Feathers’ elite teams were killed by us?”</p><br/><p>Gu Siming’s voice was very excited. “This time they have high numbers. There are more than 10 people!”</p><br/><p>Li Cangyu said calmly, “Then we will send them back.”</p><br/><p>Originally, Li Cangyu, Bai Xuan and Xie Shurong killed six people. This time, six people killing over 10 people wouldn’t be very difficult.</p><br/><p>For the three people on the left, Xie Shurong’s personality ability was enough to easily kill masters in the online game. Combined with the help of the milk god Bai Xuan and the protection of Gu Siming, it wouldn’t be difficult for A’Shu to kill a team of online players.</p><br/><p>On the right, Li Cangyu was very confident in himself and he had a white magician who was probably the captain of the Full Moon team, Zhang Jueming. If Zhang Jueming helped him, he would be able to kill six people by himself.</p><br/><p>Of course, he didn’t know that Steamed Bass was actually the side account of Ling Xuefeng. Otherwise, he would act as a soy sauce and let Ling Xuefeng take care of this group of people.</p><br/><p>The team captain’s ID was Peacock Flying Southeast. The IDs of the other people were all poetic, like ‘Bed Before the Moonlight’ and ‘Thinking about Home’. They weren’t in any guild and were obviously side accounts created by a guild.</p><br/><p>Li Cangyu saw them coming here and immediately moved to a tree, sharp eyes staring in their direction.</p><br/><p>The six member team had melee, remotes and a healer. This was a very common team configuration and he couldn’t see what guild the other party belonged to. Even if Li Cangyu speculated that the other party was the Flying Feathers Guild, there was no evidence.</p><br/><p>However, it was clear that the person commanding this attack was extremely meticulous. In addition to deliberately using side accounts to hide the guild background, the squad was well-organized when moving. First it was a swordsman, an assassin and then the two white magicians and then the priests. It was a typical three step approach.</p><br/><p>The other side had a healer and Li Cangyu’s party didn’t have one. Therefore, Li Cangyu’s intention was obvious.</p><br/><p>First take care of the opposite priest.</p><br/><p>His position might be far from the priest but the elves had a movement racial skill and there was the agility advantage. Once he saw the other party’s healer enter his field of view, Li Cangyu immediately used Flying Feather Steps and quickly moved. Everyone felt that Love to Eat Braised Fish came behind them in the blink of an eye!</p><br/><p>“He is behind us!” Flying Feathers Frost, operating the healer, immediately cried out.</p><br/><p>But it was too late when everyone tried to hit him.</p><br/><p>Li Cangyu’s hand speed was extremely fast. Immediately after moving, he summoned a water spirit and directly froze the healer before following up with a fire spirit. Awakened Magician saw him fight the healer and wisely released all three auxiliary skills, Song of the Soul, Inspiring Voice, Song of Encouragement!</p><br/><p>The white and light blue effects quickly spread from his staff to the surrounding area. The other person’s defense collectively declined while their team’s attack power and crit rate doubled!</p><br/><p>Li Cangyu naturally became more powerful with the attack bonus. Four big fireballs shot out like fireworks and the healer died in seconds.</p><br/><p>Li Cangyu wasn’t satisfied with killing only one person. The attack bonus and crit rate increase had a short duration of 10 seconds. He followed up by summoning the thunder spirit and using Thunder’s Wrath. The remaining five were hit and lost nearly half their blood.</p><br/><p>This terrible attack was simply frightening!</p><br/><p>Flying Feathers Liangshan felt his scalp become numb and the fingers on the keyboard were slightly stiff.</p><br/><p>The thing that made Li Cangyu happy was that the black magician Steamed Bass wasn’t idle. He saw the light effect of the attack bonus on his body and raised his hand, followed by the black magician’s most violent group attack, Hell Flames!</p><br/><p>Black-red flames rose from the surrounding ground and burned almost everything away.</p><br/><p>The fierce attack of the black magic spell caused the already residual blood players to instantly fall to a critical state, a red warning light flashing.</p><br/><p>Flying Feather Liangshan was absolutely stunned!</p><br/><p>These people’s reactions were too fast. The six member team had just come over and hadn’t released a skill when the other party’s summoner quickly moved behind them and removed the healer. The even more amazing thing was that the white magician was an auxiliary?</p><br/><p>A white magician auxiliary, how many years had it been since he saw this?</p><br/><p>Fortunately, the other party’s big moves were cooling. Flying Feathers Liangshan gritted his teeth and ordered, “Quickly kill Braised Fish!”</p><br/><p>How could Love to Eat Braised Fish wait to be killed?</p><br/><p>The cooldown of his pet skills didn’t matter. He still had the elves’ general movement skill.</p><br/><p>Li Cangyu ran without hesitation.</p><br/><p>This was a forest and the trees were very dense. The field of vision wasn’t too wide, making Flying Feathers Liangshan feel that Braised Fish was a shadow. The elf summoner suddenly flashed behind a tree and couldn’t be seen anymore.</p><br/><p>Crushed in technique… also crushed in IQ…</p><br/><p>Steamed Bass only used on bg move and still had many skills. After seeing the other side’s blood, Ling Xuefeng wasn’t polite and used Shadow Winding on the opposite side’s swordsman captain.</p><br/><p>Then he followed Love to Eat Braised Fish’s lesson by running away.</p><br/><p>The remaining four people of the Flying Feathers Guild stared with wide eyes. The furious Flying Feathers Liangshan shouted, “Braised Fish will certainly move to the left. Go and support the others!”</p><br/><p>***</p><br/><p>The situation on the left also wasn’t very good.</p><br/><p>It contained the side account of the vice president who thought that it would be easy to take care of this paladin, swordsman and knight with three people. Once the two sides met, the chicken blood As the Name Suggests immediately rushed over and the situation became chaotic.</p><br/><p>Flying Feathers Ares’ face was angry.</p><br/><p>The even more annoying thing was that the swordsman followed while waving his longsword. The precise Spirit Lock hit the crowd and then he used Light and Shadow Rotation and Breaking Bone Sword to kill two people in seconds.</p><br/><p>This Light and Shadow Rotation was too scary!</p><br/><p>Flying Feathers Ares was stunned when he saw it. For a moment, he even thought of the captain of the Flying Feathers team, Su Guangmo…</p><br/><p>Light and Shadow Rotation was the most powerful group attack skill of the swordsman but it was a hard skill to grasp. Once opened, the consumption of blue was serious. In addition, the sword moved quickly and it was easy to lose control and hit nothing. The operator must adjust the swordsman’s position with the fastest speed in order to let the sharp sword hit the targets.</p><br/><p>A melee swordsman had striking attacks and many players in the professional league chose to play a swordsman. The most famous one was Flying Feathers’s Su Guangmo.</p><br/><p>In the arena, Su Guangmo always had the domineering air of ‘A god kills a god, Buddha blocks Buddha.’ Since his master Song Yang retired, Su Guangmo took over as captain of the Flying Feathers team. He was the oldest captain in the league apart from Ling Xuefeng.</p><br/><p>In today’s Miracle League, the strongest players were recognized as demon summoner Ling Xuefeng and the terran swordsman with the highest winning ratio, the second generation captain of the Flying Feathers, Su Guangmo, the first of the Three Musketeers.</p><br/><p>Ling Xuefeng was known as the ‘Demon King’ and his popularity was high.</p><br/><p>Su Guangmo was known as the ‘Human Emperor’ which proved that many netizens recognized Su Guangmo as the strongest terran player.</p><br/><p>Flying Feathers Ares was a fanboy of Captain Su and had been with the Flying Feathers Guild for a whole year. Captain Su had a blunt temper and hearty nature. H was sometimes scary when angry but he often came to the guild area to communicate with them.</p><br/><p>Flying Feathers Ares had witnessed Su Guangmo abusing a boss many times.</p><br/><p>He saw Blossoming Tree release the swordsman’s big move, Light and Shadow Rotation and his eyes suddenly saw the captain’s figure. He inexplicably felt that this swordsman was somewhat similar to his captain’s style of play, although there were some differences if they looked closely.</p><br/><p>Flying Feathers Ares was in a daze and Xie Shurong didn’t give him a chance. His sword cut into the back of the opponent and he used his firepower to instantly wipe out two remote outputs, followed by one melee in the front row.</p><br/><p>At this time, Li Cangyu’s support arrived.</p><br/><p>The cooldown of his pet skills were over. He had used the footwork to escape while also waiting for the cooldown to end. Now he arrived at Bai Xuan just as a melee was killed by A’Shu. Li Cangyu called out the thunder spirit, used Thunder’s Wrath and instantly took the heads of these people.</p><br/><p>Eight of the side accounts died in the blink of an eye. Flying Feathers Liangshan immediately called out, “Retreat!”</p><br/><p>However, Ling Xuefeng didn’t give them a chance to retreat.</p><br/><p>The four people with 10% blood wanted to run away only to run into the waiting Ling Xuefeng.</p><br/><p>Ling Xuefeng’s eyes were cold as he raised a hand. The black magician’s Hell Flames immediately killed these four people!</p><br/><p>As Wind Colour’s captain, his demon summoner was famous in the Miracle League but he didn’t only play a demon summoner. Strictly speaking, Vice-Captain Yan Ruiwen was raised by Ling Xuefeng, so he could play a black magician well.</p><br/><p>Once all the side accounts were killed, Ling Xuefeng sent a private message to Li Cangyu: [President, I killed the four who escaped.]</p><br/><p>Was this guy asking for praise?</p><br/><p>Li Cangyu wrote back: [Good work, you did well.]</p><br/><p>The praised Ling Xuefeng was in a good mood.</p><hr/><br/><p>Added a ko-fi for the people asking for an alternative to Patreon:</p><br/>\n</div>"}