{"title": "Chapter 55", "id": 55, "volume": 1, "url": "http://boxnovel.org/god-level-summoner-chapter-55", "volume_title": "Volume 1", "body": "<h1>Chapter 55</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 55 – Legion Defense (Mine Battle)</p><hr/><br/><p>Beijing time, 8 p.m. on Sunday, the Moonlight Forest district.</p><br/><p>[The legion defense war is about to begin. Both camps, please be prepared!] [Defending the goddess is your greatest mission!]</p><br/><p>The server announced these messages on time. Miracle’s liveliest legion defense was finally opened. All players who signed up for the event were sent to the legion defense instance.</p><br/><p>The battle map was a circular map similar to a clock. There was a bottomless abyss that stretched vertically from the 12 o’clock position to the 6 o’clock position, isolating the players from both camps, the Bright Legion on the left and the Dark Legion on the right.</p><br/><p>On the Bright Legion side, from top to bottom there was the elf mine, the terran mine and angel mine respectively. On the Dark Legion side, from top to bottom there was the demon mine, beast mine and blood kin mine.</p><br/><p>The six racial mines had a lot of guard NPCs with a level equal to an elite boss of a large instance, requiring at least one team to kill one. After killing the guards and occupying the mine, the players could more the ores back to their base camp to earn money.</p><br/><p>At 8:30, the goddesses of both caps would refresh and three bridges would appear over the abyss separating the two camps. At this time, both sides could reach the other territory through the bridges, stealing resources and even killing the enemy’s goddess.</p><br/><p>In other words, there was no way for both sides to meet each other at the beginning due to the abyss. At 8:30, the maps would be connected. This setting gave everyone a bit of buffer time. During the half an hour from 8:00 to 8:30, the players could mine and build up their economy.</p><br/><p>It showed how important seizing resources and improving the economy was, not killing.</p><br/><p>***</p><br/><p>Ling Xuefeng’s idea was very obvious. Once the defense war started, he immediately divided the 150 groups into three paths and would win the three mines at the fastest speed. This was in order to obtain resources and gain an economic advantage.</p><br/><p>The remaining 20 groups were mostly assassins from Ghost Spirits. Ling Xuefeng had a special arrangement for these groups. [Ghost Spirits has eight teams. You will divide into three groups and first attack the upper, middle and bottom resurrection points. Then wait for the bridges to refresh.]</p><br/><p>[As soon as the bridges appear, you will immediately enter the Bright Legion territory and assassinate the people at the mines. Just hit and run, don’t get into a prolonged battle!]</p><br/><p>[Groups 173, 174 and 175 will scatter across the map to look at the enemy’s situation. I need to grasp the actions of the other party.]</p><br/><p>Ling Xuefeng calmly issued instructions one by one in the discussion group.</p><br/><p>The leaders took the instructions back to their people and the soldiers quickly reached the designated locations.</p><br/><p>Mining, grabbing the resurrection points, investigating… it might be an attack and defense war involving tens of thousands of people but Ling Xuefeng didn’t appear disordered as he guided the teams.</p><br/><p>There were a large number of guard bosses in the racial mines. 30 people worked together to kill one boss. Everyone consciously dispersed, pulling the guards one by one to kill. It took less than three minutes for the three major mines to be occupied.</p><br/><p>[The Dark Legion has occupied the demon mine!]</p><br/><p>[The Dark Legion has occupied the beast mine!]</p><br/><p>[The Dark Legion has occupied the blood kin mine!]</p><br/><p>[The Bright Legion has occupied the elf mine!]</p><br/><p>[The Bright Legion has occupied the terran mine!]</p><br/><p>[The Bright Legion has occupied the angel mine!]</p><br/><p>Six announcements continuously appeared on the centre of the screen.</p><br/><p>Li Cangyu couldn’t help frowning slightly when he saw this.</p><br/><p>The other side’s commanded obviously used the method of winning the three mines at the fastest speed. It wasn’t uncommon to see such at start in the legion defense war but Li Cangyu couldn’t help having a strange feeling. According to the undercovers, this time the Wind Colour Guild had won the right to command the Dark Legion. Was the opposite commander the president of the Wind Colour Guild?</p><br/><p>In any case, Li Cangyu was confident that the Bright Legion could win.</p><br/><p>He issued an order on the command channel. “The three mines have been successfully won. Everyone collect the ores at the fastest speed. Our legion’s economy must exceed 100,000 before 8:30!”</p><br/><p>***</p><br/><p>Mining was the only way to increase a camp’s economy.</p><br/><p>The Dark Legion collected ores at the fastest speed and the collect ores would be converted to gold coins at a certain rate.</p><br/><p>In the centre of the screen, the economies of both sides were growing rapidly due to the occupation of the mines and the collection of ores. At 20:25, the total economic value of both sides had reached 100,000!</p><br/><p>There were still five minutes left until the goddesses refreshed. The early preparations were completed and the war was imminent!</p><br/><p>Ling Xuefeng looked at the time and immediately typed in the command channel: [The three mining groups have been divided. The team leaders with a multiple of five in their number will immediately go to the camp NPCs to buy chariots. The other teams will go to the nearest bridge!]</p><br/><p>Some people were surprised. [We aren’t building up the castle?]</p><br/><p>It was well-known that the ultimate goal of the legion defense was to protect the goddess from being killed. Defensive castles would be built in the place where the goddesses refreshed. Otherwise, they would be easily attacked by the other side’s forces and the camp’s goddess would be threatened.</p><br/><p>Ling Xuefeng didn’t choose to build a defensive castle first and wanted to buy attacking chariots, making many people unable to understand.</p><br/><p>[The other side doesn’t have the strength to directly kill our goddess.] Ling Xuefeng typed calmly. [The chariots are used as a cover. Our real goal is to seize the mining resources of the Bright Legion.]</p><br/><p>The commander unexpectedly came out with a sneak attack, making many people marvel. Wasn’t this courage too big? Driving the chariot to the other side and leaving their goddess naked… was it okay? Not even one castle?</p><br/><p>Of course, Ling Xuefeng’s thoughts were also true. The Dark Goddess was a big boss and the thousands of people on the opposite side couldn’t kill her immediately.</p><br/><p>He was sure that Li Cangyu wouldn’t rush with 100 groups to kill the Dark Goddess. That’s why he could take the risk to use money to build the chariot and directly attack the other side.</p><br/><p>As long as the other side’s mines were successfully taken, their economy would grow rapidly, making it actually quite cost-effective.</p><br/><p>***</p><br/><p>It took 3,000 gold to buy a primary chariot and 90,000 to buy 30 chariots. Almost all of the 100,000 gold in the Dark Legion was soon consumed. Ling Xuefeng didn’t feel sad as he typed in the command channel: [Investigation Group, quickly report the other side’s situation.]</p><br/><p>The Ghost Spirits Guild’s assassins in charge of stealth investigation immediately replied with a few messages.</p><br/><p>[The opposite side’s elf mine has 20 groups.]</p><br/><p>[There are only 10 groups left in the terran mine. The others are retreating.]</p><br/><p>[The people in the angel mine are also retreating. It should be to build the castle.]</p><br/><p>Ling Xuefeng nodded and quickly typed on the keyboard: [Everyone assemble. The soldiers will divided between the three bridges. Use chariots to directly seize the other side’s mines!]</p><br/><p>He divided the 150 teams into three groups: upper, middle and lower. The positions of the three groups were adjacent to the three bridges connecting the two camps. At his command, everyone could drive the chariots directly to the nearest mine and hit the opposite camp.</p><br/><p>The people of the Bright Legion had returned to the city to build the castle under Li Cangyu’s command. Unexpectedly, the Dark Legion used 30 chariots to make a sudden attack!</p><br/><p>[Commander, the opposite army has attacked the elf mine! They have 10 chariots!]</p><br/><p>[There are also chariots in the middle of the terran mine!]</p><br/><p>[The guards at the angel mine are about to be killed!]</p><br/><p>[They came to steal the mines! Damn, they are taking three roads!]</p><br/><p>The large-scale attack of the Dark Legion was too unexpected. The destructive power of the chariots were extremely strong. The Bright Legion side saw the enemy’s chariots arriving without any preparation. Everyone was beaten and the three mines were actually lost!</p><br/><p>[The Dark Legion has occupied the elf mine!]</p><br/><p>[The Dark Legion has occupied the angel mine!]</p><br/><p>[The Dark Legion has occupied the terran mine!]</p><br/><p>Three messages appeared in the middle of the screen and all six mines on the small map showed black signs, indicating they had been occupied by the Dark Legion.</p><br/><p>Li Cangyu looked at the black on the map and couldn’t help feeling startled.</p><br/><p>The conventional strategy for the legion defense was to take three mines on their side and develop steadily, earning money and building castles where the goddess was, raising the castle defenses to a stable level. Then they would buy attack vehicles such as chariots and artillery.</p><br/><p>At the beginning of the game, leaving the goddess alone and coming for a surprise attack. Spending a lot of money to buy chariots and directly entering enemy territory to seize resources… this style of command wasn’t Popular Land Under Heaven.</p><br/><p>This commander was very ambitious and bold!</p><br/><p>The Miracle League had one aggressive player who used fierce attacks as the best defense.</p><br/><p>Was there any need to say who was controlling Popular Land Under Heaven’s account?</p><br/><p>The corners of Li Cangyu’s mouth couldn’t help rising slightly.</p><br/><p><em>-Ling Xuefeng, you really want to play with me? </em><em>It seems that it is time for me to become serious!</em></p><br/>\n</div>"}