{"title": "Chapter 53", "id": 53, "volume": 1, "url": "http://boxnovel.org/god-level-summoner-chapter-53", "volume_title": "Volume 1", "body": "<h1>Chapter 53</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 53 – Lou Zhang Combination</p><hr/><br/><p>They didn’t know what he was saying but they still wanted to give him compliments. This was what the fans thought.</p><br/><p>Tan Shitian’s popularity was extremely high. In addition to the dead loyal fans who watched every game in the Miracle League, there were the passersby fans who followed him because of the funny things he wrote. The fans praised him together and the forwarding of Su Guangmo and Ling Xuefeng made the number of people who read this Weibo more than one million. In just half an hour, Tan Shitian’s post was the day’s hot topic.</p><br/><p>***</p><br/><p>The Ghost Spirits team, 1st dormitory.</p><br/><p>Vice-Captain Zhang Shaohui was lying on the sofa and looking through Weibo. Once he saw the news that appeared on the front page, he couldn’t help spitting out, “What is Tan Shitian saying about a big cat and a kitten? Captain Su and Captain Ling forwarded it as well? Then let me do the same.”</p><br/><p>Zhang Shaohui forwarded the tweet and commented: This story is really good! [Applause][Applause].</p><br/><p>He had just sent it on Weibo when the door of the other bedroom opened. A man came over and said, “A’Hui, you don’t understand the situation so why are you fooling around?”</p><br/><p>The man was thin and wearing a pair of silver-rimmed glasses. His skin was very white, his facial features very soft and he looked very gentle and handsome. However, his face was always frosty and he gradually became the famous cold beauty of the Miracle League. He was the league’s most famous killer, the captain of the Ghost Spirits team, Lou Wushuang.</p><br/><p>His assassination techniques were first class and many great gods had died under his lurking sneak attack. Therefore, he had the nickname of ‘Viper’, since anybody he aimed for was like having a poisonous snake stare at them. There was basically no possibility of escape.</p><br/><p>This person’s appearance was cold but Zhang Shaohui knew that his cousin was actually inwardly soft. That’s why Zhang Shaohui wasn’t afraid of him, despite Lou Wushuang’s unmatched cold face.</p><br/><p>Yes, the Lou Zhang combination were distant cousins.</p><br/><p>When Zhang Shaohui was young, his parents died in a car accident. There weren’t many relatives so he was taken care of by a kind distant aunt. His blood relationship with Lou Wushuang was already outside five generations but because the two of them grew up together, their feelings were closer than brothers.</p><br/><p>Lou Wushuang’s cold personality caused him to suffer when studying at school. At that time, his skin was white and he looked good. There were always people who disliked the sight of him and wanted to bully him. Zhang Shaohui was a type of small bully and quite unreasonable. He never lost when he rolled up his sleeves. Anyone who dared to bully Lou Wushuang during their school days would have their front teeth knocked out.</p><br/><p>He might be the younger one but he always protected his cousin. It was because he thought Lou Wushuang looked good, got good grade and was born to be a noble person. He would certainly have a good future. This was different from Zhang Shaohui, who grew up rolling around in the mid. Apart from his fighting abilities, his academic performance was a letdown. He completely couldn’t understand mathematical formulas and probably couldn’t test into university.</p><br/><p>During his high school graduation year, Zhang Shaohui didn’t apply to any good universities. He felt it was impossible for him and wanted to find his own way in the future. It turned out that he was good at playing games and the Ghost Spirits team in Shenzhen were recruiting talents. He was bold enough to go to the interview.</p><br/><p>Lou Wushuang accompanied Zhang Shaohui together to the interview and also tested out his hand speed. He didn’t expect that his hand speed was actually higher than Zhang Shaohui’s hand speed!</p><br/><p>He had actually received an admission letter to a university but because his hand speed was so high, he chose to become an e-sports player and had a big fight with his family. Zhang Shaohui’s advice was also useless. Luo Wushuang was always stubborn and firmly carried his luggage with his brother to go to the Ghost Spirits team. Zhang Shaohui had no way to stop him but also felt happy that they could be together.</p><br/><p>The two teenagers under 18 were appreciated by Mo Quan, the Ghost Spirits’ captain and one of the Five Gods. Mo Quan had been planning to retire and he trained the brothers as the successors to the Ghost Spirits team.</p><br/><p>Lou Wushuang had always been studying attentively and never played games, but he was very clever. After entering the training game, his talent for the game was amazing and he quickly caught up to his brother Zhang Shaohui.</p><br/><p>The two brothers grew up together and had a tacit understanding. After training for a period of time, they officially debuted in the third season. They wan into talented players such as Cheng Wei and Xie Shurong and couldn’t get the rookie awards, but they were full of stamina. In the fourth season, they showed their strength and became the miracles of the Miracle League, leading the Ghost Spirits to win the fifth season.</p><br/><p>Zhang Shaohui’s character was hearty and he was good at martial arts. He was accustomed to fighting people since childhood and his body was very tall and strong. His popularity in the Miracle League was also high. It was just that this person was a bit blind and there were many situations where he was unclear.</p><br/><p>Lou Wushuang was very calm and had a high IQ. He understood the meaning of Tan Shitian’s story with one glance.</p><br/><p>The highly intelligent Captain Lou and the explosive force of the vice-captain, this combination of brother-killers was a unique thing in the Miracle League.</p><br/><p>***</p><br/><p>Lou Wushuang saw his dazed cousin and couldn’t help explaining, “Captain Tan means that Cat God has come back.”</p><br/><p>“Cat God?” Zhang Shaohui stood with surprise. “Are you talking about Li Cangyu who left Miracle a long time ago?”</p><br/><p>“Yes.” Lou Wushuang nodded calmly. “Tan Shitian’s big cat is referring to Cat God and the kitten refers to Cheng Wei. The dog is himself. This story means that Cat God trained Cheng Wei. After he left, Tan Shitian has been carrying Cheng Wei. Now that Cat God is back, Cheng Wei went to Cat God and ignored Captain Tan. Captain Tan is a bit sad.”</p><br/><p>Zhang Shaohui, “…”</p><br/><p>The big cat, kitten and dog could be mentioned this way? Tan Shitian was truly amazing!</p><br/><p>Lou Wushuang pushed up his glasses and continued to explain without any expression. “Su Guangmoa nd Ling Xuefeng forwarded the message, indicating that both of them know that Cat God has returned.”</p><br/><p>Zhang Shaohui finally recovered his spirit and walked to Lou Wushuang, praising him, “It was originally like this. Brother, you are so clever!”</p><br/><p>The younger brother was half a head taller than himself. He showed a mouthful of white teeth when laughing and he had just taken a shower, so he was only wearing a sexy black vest and shorts, exposing the muscles on his bidy.</p><br/><p>Lou Wushuang turned red at being half-hugged by this man but he quickly adjusted his expression and said, “I am just speculating.”</p><br/><p>“Smart is smart, there is nothing wrong with admitting it. You have been smarter than me since you were a kid.” Zhang Shaohui found that he was blushing and couldn’t help joking, “I am just boasting about you. Why are you blushing? You are pretty good-looking… why don’t I post a photo of you and perhaps the popularity of the photo will surpass Tan Shitian.”</p><br/><p>“…” Lou Wushuang turned away.</p><br/><p>‘Idiot, your brains cells have gone to your limbs!’</p><br/><p>Zhang Shaohui looked at his back and felt something strange.</p><br/><p>He didn’t know why but this cousin that he slept naked with when he was a child changed. Once they got older, Lou Wushuang always seemed to be hiding from him and his jokes made his cousin angry…</p><br/><p>Zhang Shaohui innocently touched his nose. Did he make a mistake boasting about his cousin’s cleverness?</p><br/><p>After being stunned for a while, Zhang Shaohui recovered and sent a text message to the Ghost Spirits Guild’s president. [President, what are the recent movements in the online game? Especially with Wind Colour, Flying Feathers and Time.]</p><br/><p>Under the leadership of the Lou Zhang combination, the Ghost Spirits team won the championship in the fifth season. The overall strength of Ghost Spirits wasn’t as strong as Time, Wind Colour and Flying Feathers, but there was no team that dared to look down on Ghost Spirits. They were killers lying in the darkness and there was a tacit understanding with the Lou Zhang combination. As long as they were given the opportunity, they could kill ace players such as Ling Xuefeng and Su Guangmo.</p><br/><p>The Ghost Spirits Guild wasn’t as strong as Time, Flying Feathers and Wind Colour. The president Devil May Cry was relatively low-key. No matter what the outside world did, he just silently leveled up with his guild members.</p><br/><p>He didn’t participate in the disputes of the new district but he sent people to follow up on the situation of Love to Eat Braised Fish. After receiving the text message from Vice-Captain Zhang, he immediately replied: [The new district has an elf summoner master called Love to Eat Braised Fish. Previously, there was a bounty mission and the elite teams of Wind Colour and Flying Feathers were eliminated. Later, he created the Food Squad Guild and allied with Time, taking the first ranking in the guild challenge instance.]</p><br/><p>Zhang Shaohui saw up to here and understood the situation.</p><br/><p>According to his cousin’s words, if Cat God was back then Love to Eat Braised Fish should be Cat God.</p><br/><p>Wind Colour and Flying Feathers experienced a big loss and alerted the great gods on the team. Ling Xuefeng and Su Guangmo obviously recognized him. It was estimated that Time only found out today since he made this post. Cat God was back, Cheng Wei ignored Captain Tan after recognizing Cat God and Captain Tan was sad.</p><br/><p>Lou Wushuang was really smart to understand it with one glance!</p><br/><p>Zhang Shaohui often felt that his IQ wasn’t high enough. Fortunately, Ghost Spirits had Captain Lou and he just needed to follow his cousin’s orders.</p><br/><p>[How will tomorrow’s legion defense be arranged?] Zhang Shaohui asked. [I want to go to the game and see Love to Eat Braised Fish.]</p><br/><p>[Ghost Spirits has always entered the Dark Legion. If Vice-Captain comes, why don’t you take command of the legion?]</p><br/><p>[I just want to play a side account for fun.] Zhang Shaohui felt it would be a mess if he went to command the legion war. He just wanted to go and see what the famous Cat God was doing in the game.</p><br/><p>[What about Captain Lou?] The president asked.</p><br/><p>[He isn’t going.] Zhang Shaohui made a decision for his cousin. [He hates such a chaotic situation and his body isn’t very comfortable these days. I will let him rest and go see myself.]</p><br/><p>[Then I will prepare an account for Vice-Captain and send the password to your phone.]</p><br/><p>[Yes, thank you!]</p><br/><p>***</p><br/><p>The guild office of the Wind Colour team.</p><br/><p>Popular Land Under Heaven saw Captain Ling forward the Weibo message and couldn’t help wondering, “The big cat and kitten have a father and son relationship? What does the Captain mean?”</p><br/><p>The vice president Same Boat Under Wind and Rain guessed, “Perhaps it is the relationship between Cat God and Cheng Wei?”</p><br/><p>Popular Land Under Heaven realized. “Yes, that must be it! It seems that Time also knows the true identity of Love to Eat Braised Fish!”</p><br/><p>The two people were talking when they suddenly heard footsteps and looked back. They saw Ling Xuefeng walk over, followed by Qin Mo.</p><br/><p>Popular Land Under Heaven stood up and asked, “Captain Ling, you came over so late. What is the matter?”</p><br/><p>“In tomorrow’s legion defense, can you win the right to command the Dark Goddess’ camp?” Ling Xuefeng asked.</p><br/><p>Popular Land Under Heaven was surprised. “Captain Ling, do you plan to personally direct it?”</p><br/><p>“Yes.” Ling Xuefeng nodded calmly. “Cat God should be the leader on the Bright Goddess side. Tan Shitian and Cheng Wei will definitely log into the online game to join the fun. If there is no commander to fight against them on the Dark Goddess side, the whole dark legion will collapse. This isn’t good for the development of the guild.”</p><br/><p>He spoke so much but…didn’t he just want to face Cat God?</p><br/><p>Popular Land Under Heaven was joyful. He had been worried that if the Bright Legion had Cat God, wouldn’t the Dark Legion be abused? They would have no face if the score difference was too big.</p><br/><p>He had been worried about the result but Captain Ling since he would personally come forward. Popular Land Under Heaven was filled with excitement and the blood in his body boiled!</p><br/><p>Ling Xuefeng VS Li Cangyu in the legion defense!</p><br/><p>Tomorrow’s event would definitely be a wonderful match in the history of Miracle!</p><br/><p>“Captain Ling, rest assured! I will definitely win the right to command tomorrow’s war!”</p><br/><p>He immediately sat in front of the computer and pulled the president of two guilds, Ghost Spirits and Pure Cleansing, into a discussion group. He quickly typed: [Devil May Cry, Sister Wan Qing, can Wind Colour take command of tomorrow’s legion defense? I’ll give it to you next week!”</p><br/><p>Devil May Cry found out some things from Vice-Captain Zhang Shaohui. Since Love to Eat Braised Fish was the famous Cat God, he didn’t want to take command of the Dark Legion. Since someone dared to pick up this hot potato, he immediately agreed. [Okay!]</p><br/><p>The president of Pure Cleansing was a girl with a gentle personality. She didn’t like fighting and had no interest in commanding. She replied: [I will leave it to you.]</p><br/><p>[Thank you! Since my side will be commanding, let’s work together tomorrow. Will all of you listen to our commands?]</p><br/><p>[No problem.]</p><br/><p>[Yes.]</p><br/><p>Popular Land Under Heaven was happy about convincing the two largest guilds and turned around. “Captain Ling, it is done.”</p><br/><p>Ling Xuefeng nodded and asked, “What is the current guild situation on both sides?”</p><br/><p>“Wind Colour, Ghost Spirits and Pure Cleansing are part of the Dark Legion while Time, Terminator and Red Fox are part of the Bright Legion. These three guilds have always been on the Bright Goddess’ side. Flying Feathers and Cheetah haven’t made a statement yet so their choice is unclear.”</p><br/><p>“Flying Feathers should enter the Light Legion so go and pull the Cheetah Guild over.” Ling Xuefeng decisively ordered.</p><br/><p>Popular Land Under Heaven wasn’t sure why the captain was so certain but he was still obedient. “Okay.”</p><br/><p>Ling Xuefeng said, “You are busy. I will come again at 7 o’clock tomorrow to meet with the management of all the guilds in the Dark Legion.”</p><br/><p>Popular Land Under Heaven excitedly replied, “No problem, I will arrange it!”</p><br/><p>Ling Xuefeng turned away.</p><br/><p>The little follower Qin Mo never spoke from beginning to end. He just followed his master and left with his master. Popular Land Under Heaven wanted to cry out, “Little boy, why did you come here? Do you want the title of follower?”</p><hr/><br/><p>TL: With this, all the CPs in the novel have appeared:</p><br/><p>Main CP: Li Cangyu x Ling Xuefeng</p><br/><p>Bai Xuan x Xie Shurong</p><br/><p>Tan Shitian x Cheng Wei</p><br/><p>Su Guangmo x Yu Pingsheng</p><br/><p>Zhang Shaohui x Lou Wushuang</p><br/><p>The rest are all close relationships, no matter what hints you might see. In addition, Qin Mo is the MC of the third novel so his story will be told there. His gong appears in this novel but hasn’t made his appearance yet.</p><br/>\n</div>"}