{"title": "Chapter 57", "id": 57, "volume": 1, "url": "http://boxnovel.org/god-level-summoner-chapter-57", "volume_title": "Volume 1", "body": "<h1>Chapter 57</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 57 – Legion Defense (Guarding the Castle)</p><hr/><br/><p>Li Cangyu spoke on the world channel so Ling Xuefeng knew his identity was discovered. However, Ling Xuefeng hadn’t intended to hide it so he didn’t mind.</p><br/><p>It was currently 8:40. Ling Xuefeng ordered everyone to gather ores.</p><br/><p>After the mines were occupied, there were 10 minutes of protection time. Once the 10 minutes passed, Li Cangyu would definitely take back the elf, angel and terran mines. Ling Xuefeng wouldn’t bother taking them again since this advantage was enough.</p><br/><p>The Dark Legion collectively mined and their economy grew at a rapid rate. The economic difference between the two sides soon became 60,000. Li Cangyu wasn’t in a hurry. Once the time came, he commanded his troops to successfully take back their own mines.</p><br/><p>The early battle over the mines temporarily concluded. The Dark Legion was dominant when it came to the economy but the Bright Legion had stolen 20% of the camp boss’ blood. It could be said that both sides gained something and there was no victory or defeat.</p><br/><p>In the following time, Li Cangyu decided to stabilize the economy first.</p><br/><p>Everyone on the Bright Legion side worked together to collect ores and their total economy reached 150,000 and the castle successfully built. The Dark Legion’s economy had reached 210,000 but they consumed 90,000 gold buying the chariots. In fact, only 130,000 funds were available and the construction progress of their castle was only 70%. It hadn’t yet been completed.</p><br/><p>This was a good opportunity!</p><br/><p>Li Cangyu gave an order in the command channel: [30% groups will sneakily head to the Dark Camp side and quickly take the middle resurrection point!]</p><br/><p>The groups lurking in the darkness quickly killed the guards at the resurrection point.</p><br/><p>Someone in the Dark Legion reported: [The opposite side has taken the middle resurrection point!]</p><br/><p>Ling Xuefeng thought, ‘Is he planning a suicide raid again?’</p><br/><p>The battle for resurrection points was just as important as the battle over the mines in the legion defense war. The mines determined economic strength while the more resurrection points that were taken, the more positions the camp’s players could choose when resurrecting, increasing their tactical arrangements.</p><br/><p>The resurrection point at the bottom of the Dark Legion’s camp was taken away. Now the resurrection point in the middle was attacked… Li Cangyu’s intention was obvious. It was another sneak attack while the Dark Legion’s castle wasn’t built.</p><br/><p>Ling Xuefeng quickly decided. [Every large group of 30 people, wait at the resurrection points. As soon as they arrive, attack and kill them!]</p><br/><p>30 groups waited in ambush at the three resurrection points of the Dark Camp. Everyone prepared their group attack skills, waiting for the other side to arrive and catch them off guard!</p><br/><p>Li Cangyu asked Flying Feathers Liangshan: [What are the undercovers saying?]</p><br/><p>The president of Flying Feathers excitedly replied to Cat God: [They went to the three resurrection points for an ambush. There are nearly 3,000 people!]</p><br/><p>Li Cangyu was satisfied. [Very good!]</p><br/><p>Flying Feathers Liangshang had truly seen a lot of spy movies. His undercover work was quite brilliant and he had a spy in the Dark Legion’s command channel. This type of large-scale attack and defense war, how was it possible without undercovers?</p><br/><p>Li Cangyu received the response from the undercovers and immediately changed his strategy. [The three large groups head over the middle bridge and immediately pressure them!]</p><br/><p>In fact, his capturing of the resurrection point was to divert eyes.</p><br/><p>It was because he knew Ling Xuefeng. He knew that as soon as he took the resurrection point, LIng Xuefeng would think he was planning a sneak attack from the resurrection points. Therefore, Li Cangyu didn’t take the usual path and instead pushed straight from the bridge.</p><br/><p>Ling Xuefeng was throwing away people to protect the resurrection points.</p><br/><p>The Bright Legion’s big army moved over the middle bridge at the fastest speed, killing along the way!</p><br/><p>[This is bad! There are many people in the middle!]</p><br/><p>[Hundreds of groups are passing over!]</p><br/><p>Ling Xuefeng frowned slightly as he saw the messages on the camp channel.</p><br/><p>Was this luring the tiger from its domain in the mountains?</p><br/><p>[Everyone, go back and protect the Dark Goddess!] Ling Xuefeng ordered on the command channel.</p><br/><p>At this time, their castle wasn’t completely finished. If Li Cangyu led the army to kill the camp boss, the Dark Goddess would once again lose health and their situation would become disadvantageous.</p><br/><p>The surprising thing was that Li Cangyu didn’t lead the team to the base of the Dark Goddess. The large army of the Bright Legion quickly divided into three groups and headed straight to the mines!</p><br/><p>[The Bright Legion has occupied the demon mine!]</p><br/><p>[The Bright Legion has occupied the beast mine!]</p><br/><p>[The Bright Legion has occupied the blood kin mine!]</p><br/><p>Once the three messages appeared on the centre of the screen, everyone in the Dark Legion was speechless.</p><br/><p>Popular Land Under Heaven wanted to cry out: ‘Cat God, you are playing with us!’</p><br/><p>Ling Xuefeng was also speechless. He couldn’t help sending a message on the world channel: [Threaten the east and strike in the west (a diversion)?]</p><br/><p>Li Cangyu: [Yes. You didn’t think about it?]</p><br/><p>Ling Xuefeng: […]</p><br/><p>This trick of luring the tiger away from the mountain then making a sound in the east while striking in the west was really brilliant!</p><br/><p>He deliberately took the resurrection points in order to let Ling Xuefeng mobilize thousands of people to ambush there. The result was that Li Cangyu didn’t go by the resurrection point but took the roads to kill. Ling Xuefeng thought Li Cangyu wanted to attack the goddess and sent troops back to defend. The result was that the three mines instead of the goddess were attacked.</p><br/><p>He was really a smart cat!</p><br/><p>Ling Xuefeng had experienced so many competitions but he was actually outsmarted by Li Cangyu!</p><br/><p>***</p><br/><p>Li Cangyu unexpectedly led his army to win the opposite side’s three mines. In addition to their three, they gained six mines in one go and quickly caught up with the original gap of 60,000 gold.</p><br/><p>This time, it was a real hit. The Bright Legion’s camp channel was full of flowers and applause.</p><br/><p>They didn’t expect that after the disadvantageous beginning, Li Cangyu would not only get rid of a large amount of blood from the boss but also use a plan to take the three opposite mines!</p><br/><p>[Our commander is so handsome!]</p><br/><p>[Commander, marry me!]</p><br/><p>[Love to Eat Braised Fish, are you lacking any leg items? I’ll make one for you!]</p><br/><p>Cheng Wei saw the camp channel and couldn’t help exclaiming excitedly, “Cat God is so handsome!”</p><br/><p>Tan Shitian said, “Don’t you think I’m handsome too?”</p><br/><p>Cheng Wei looked back and saw Tan Shitian’s deliberate gentle smile. He said, “I don’t think so.”</p><br/><p>Tan Shitian suddenly felt like an arrow had pierced his chest.</p><br/><p>***</p><br/><p>In the Dark Legion, Ling Xuefeng was still very calm despite the other side taking his three mines. He opened the statistics list to check the battle situation between the two sides.</p><br/><p>The Bright Legion had built their defensive castle but they had yet to buy chariots. Meanwhile, the money was building up but the Dark Legion still had 17 chariots.</p><br/><p>As long as these chariots existed, they would be a great threat to the Bright Legion.</p><br/><p>At present, there were still tens of thousands of gold in the Dark Legion’s funds. Ling Xuefeng calculated it carefully and decisively typed: [Stop the castle at the first level. Then raise the chariots to the highest level and buy two heavy firepower cannons.]</p><br/><p>His intentions were clear. Since they had the advantage of the chariot, they would expand that advantage and go on the offensive.</p><br/><p>The head of the chariots immediately upgraded the chariots to the highest level according to the instructions. At this time, the castle on the Bright Legion’s side rose to level two.</p><br/><p>The defense of a level two castle was very high. It wasn’t easy to break through but Li Cangyu knew that Ling Xuefeng had never been a timid person. As long as he made up his mind, he would definitely go forward.</p><br/><p>Li Cangyu guessed that he would use the chariots to attack and could only quickly increase the level of the castle.</p><br/><p>Sure enough, Ling Xuefeng was very decisive. As soon as the chariot rose to the highest level, he immediately had the troops cross the bridge.</p><br/><p>There weren’t many obstacles on the way. It was clear that Li Cangyu had transferred everyone back to the castle for defense. Ling Xuefeng looked at the small map and typed: [Pure Cleansing, Wind Colour and Cheetah, send groups to quickly take the three resurrection points of the Bright Legion.]</p><br/><p>If the resurrection points were taken, they could only return to their base after death. It would be difficult to return to the frontline as support in time. Ling Xuefeng emerged in full force, ready to set fire to the Bright Legion’s camp.</p><br/><p>At this moment, the clock was pointing to 9 o’clock. It was the time the two commanders previously promised.</p><br/><p>Li Cangyu typed on the world channel: [You are really punctual! Did you deliberately bring your troops over at precisely 9 o’clock?]</p><br/><p>Ling Xuefeng: [Of course, when have I ever lied to you?]</p><br/><p>Everyone, “…”</p><br/><p>Why did they sense a feeling of love between the two commanders?</p><br/><p>***</p><br/><p>Ling Xuefeng’s commands weren’t flustered and his expression was extremely calm. Once all three resurrection points were successfully won, he summoned people to gather in the middle road and led them to the castle containing the Bright Goddess, decisively killing along the way.</p><br/><p>[Paladins, berserkers and swordsmen, rush to the front to open the way for the chariots. Magicians and psychics be ready!] Then Ling Xuefeng sent a private chat to the president of Ghost Spirits. [I will give you a mission. Take the 30 groups of assassins and detour around both sides. Go to the ladders at the back of the castle and cut at the rear of the opposing army. Quickly take care of the archers of the Time Guild.]</p><br/><p>Ghost Spirits’ president was stunned when he saw this private chat and immediately understood. He realized the existence of undercovers in the command chat and gave instructions in a private chat.</p><br/><p>Based on Vice-Captain Zhang’s words, the person who talked privately with him was Ling Xuefeng. Devil May Cry was very excited. He was proud of being able to talk to the ace of the Miracle League.</p><br/><p>After feeling excited, Devil May Cry gave orders to several leaders and privately chatted with Zhang Shaohui and Lou Wushuang’s side accounts.</p><br/><p>Lou Wushuang saw his message and couldn’t help saying, “Sending 30 groups of killers to the rear… Hitting the Bright Legion from the front and back, this wave of strong attack might gain us the victory.”</p><br/><p>Zhang Shaohui exclaimed, “It seems that Captain Ling is very serious today! Playing such a strong attack and defense, how much does he hate Cat God?”</p><br/><p>Lou Wushuang, “…”</p><br/><p>Sure enough, the silly IQ went online for a while and now it was offline again. This obviously wasn’t the strong smell of gunpowder.</p><br/><p>Zhang Shaohui saw that his cousin’s face was a big ugly and couldn’t help asking, “Brother, what’s wrong with you? Are you not feeling well?”</p><br/><p>As he spoke, he reached out and gently placed a hand on the other person’s forehead. There was a thin layer on his fingers from tapping the keyboard so long. He gently touched his cousin’s forehead and once he touched it, there was a faint numbness like being struck by an electric current.</p><br/><p>Lou Wushuang stiffened and avoided his hands, his cheeks turning red. He had been pale since childhood and the blush was particularly obvious.</p><br/><p>Zhang Shaohui asked nervously, “Brother, do you have a fever? Why is your face so red?”</p><br/><p>Lou Wushuang, “…”</p><br/><p>Who would save his stupid brother’s IQ?</p><br/><p>The helpless Lou Wushuang coldly slapped his hand and said, “I am okay. Quickly keep up!”</p><br/><p>“Ah.” Zhang Shaohui had a habit of listening to his brother’s words from a young age so he immediately followed. The two killers quietly moved around to the rear of the Bright Legion along with the other Ghost Spirits members.</p><br/>\n</div>"}