{"title": "Chapter 56", "id": 56, "volume": 1, "url": "http://boxnovel.org/god-level-summoner-chapter-56", "volume_title": "Volume 1", "body": "<h1>Chapter 56</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 56 – Legion Defense (Resurrection Counterattack)</p><hr/><br/><p>Ling Xuefeng suddenly drove the chariots to the enemy camp and even grabbed three mines. He also sent more than 20 groups of assassins to kill the mining people, delaying the economic development speed of the Bright Legion. In just 10 minutes, the gap between the two side’s total economy became 110,000 to 150,000. The Bright Legion had fallen behind by 40,000!</p><br/><p>Now that three mines were taken away, this gap would only increase.</p><br/><p>Many people in the Bright Legion started to question the level of command, the public channels filled with swearing.</p><br/><p>[What is the commander doing? Isn’t he going to make a comeback by stealing the mines from the opposite side?]</p><br/><p>[Give us a command to kill and steal their mines!]</p><br/><p>[Who is in command today? Can’t we get a reliable one?]</p><br/><p>Cheng Wei was controlling a side account and became furious at those who dared to scold Cat God. He couldn’t help typing in the camp channel: [Everyone who is scolding the commander, shut up! you can you up，no can no BB!] (TL: author wrote this in English so I’m literally just copying it.)</p><br/><p>“…” Tan Shitian saw his angry appearance and couldn’t help laughing. “What are you so anxious about? This is a battle between Captain Ling and Cat God, we are just watching the fun. Captain Ling unexpectedly got the first hand but Cat God will certainly come up with a way to deal with it.”</p><br/><p>He just said this when there was a cold light behind him. A knife stabbed straight towards his chest in a calm and fierce attack!</p><br/><p>Tan Shitian’s side account was hit by the knife and directly had his blood reduced by one-third.</p><br/><p>“…” Tan Shitian immediately used the elf race’s movement skill to jump back. He had just hidden when someone else aimed another blade straight at his chest!</p><br/><p>The elf side account was stabbed and his blood plummeted to 15%!</p><br/><p>Cheng Wei and Tan Shitian often argued but they had been teammates for 1.5 years. Once he saw that Tan Shitian was being beaten, Cheng Wei reflexively used the white magician’s big move, God’s Faith. A white light fell from the sky, enveloping Tan Shitian and removing the stealth from the two assassins!</p><br/><p>Their IDs were Wisp and Ghost Mirror. They were obviously from the Ghost Spirits Guild. The situation became very chaotic once they were revealed. The two killers realized they were exposed and were forced to use Combat Stealth, taking advantage of the chaos to hide their traces.</p><br/><p>Come with no shadow, leave without a trace, the decisive and aggressive assassination techniques really made people feel creepy.</p><br/><p>Cheng Wei tried to chase them but couldn’t find their shadows. He angrily typed on the keyboard: [You run faster than rabbits. Let’s see when you don’t have the ability to run anymore!]</p><br/><p>Tan Shitian said with a laugh, “Don’t you think these two killers are similar to two people?”</p><br/><p>Cheng Wei’s understanding was poor and he said in a confused manner, “The two killers must be like two people. How can they be three people?”</p><br/><p>“…” Tan Shitian stretched out a hand and rubbed Cheng Wei’s head hard. “Why are you so stupid? I mean that these two killers are very similar to the Lou Zhang combination of the Ghost Spirits team.”</p><br/><p>Cheng Wei was attracted by the latter half of the sentence and ignored Tan Shitian calling him stupid. His eyes widened with surprise as he asked, “Do you mean Lou Wushuang and Zhang Shaohui? Those cousins are here as well?”</p><br/><p>Tan Shitian nodded. “Yes, it is probably to see Cat God.”</p><br/><p>Cheng Wei couldn’t help feeling angry again at the mention of this topic. “Lou Wushuang found out that Cat God is back due to your post on Weibo! It is all your fault. Why are you so idle? What was with that story? Comparing me to a kitten? Where do I look like a cat?”</p><br/><p>Tan Shitian looked at Cheng Wei’s hair standing up and thought, ‘Isn’t this like a kitten?’ He looked even more like one when his hair stood up!</p><br/><p>Tan Shitian listened to his machine-gun like scolding and suppressed the urge to laugh as he said, “Okay, it is all my fault. I have deleted the story and the Lou Zhang combination just wanted to see the liveliness. They hold no malice towards Cat God so you don’t have to worry too much.”</p><br/><p>This sentence was true. The Lou Zhang combination debuted with Cheng Wei in the third season. In the same year, they played against Cat God. It was estimated that they entered the online game tonight because of curiosity.</p><br/><p>Cheng Wei thought about this and his mood improved.</p><br/><p>“No, if Lou Wushuang and Zhang Shaohui team up, Cat God will be in danger! I have to protect him.” He quickly ran to the side of Love to Eat Braised Fish and raised his hand, prepared to act as a bodyguard.</p><br/><p>The Miracle League’s number one brainless fan was really dedicated, controlling a side account to act as Cat God’s bodyguard.</p><br/><p>Tan Shitian helplessly looked at him and had to follow Cheng Wei to protect Cat God.</p><br/><p>***</p><br/><p>The Ghost Spirits’ dormitory.</p><br/><p>Zhang Shaohui followed his cousin to hide behind a tree and looked at the white magician. He wondered, “Is that Cheng Wei?”</p><br/><p>His cousin’s IQ was actually working for once. Lou Wushuang felt very relieved as he nodded. “They are Tan Shitian and Cheng Wei.”</p><br/><p>Zhang Shaohui couldn’t help laughing. “It seems that many people are interested in this event. Brother, shall we go and assassinate Cat God?”</p><br/><p>He took a few steps forward, wanting to stab Cat God when Cheng Wei used the wide-range God’s Faith. Zhang Shaohui immediately ran while spitting out, “Cheng Wei is simply Cat God’s brainless fan. He has incredibly tight protection!”</p><br/><p>Lou Wushuang spoke with a cold face, “Can’t you just hide and watch the excitement?”</p><br/><p>“Ah, I will listen to you.” Zhang Shaohui smiled and scratched his head. He settled down and hid behind a tree with his cousin, eyes watching the excitement.</p><br/><p>The Dark Legion had six mines and the economy instantly reversed. Many people in the camp channel gave a thumbs up. [The commander is sharp!]</p><br/><p>[The commander is too big!]</p><br/><p>Ling Xuefeng ignored the camp channel and typed in the discussion group: [Leaders of the three large groups, report the war damage.]</p><br/><p>The Dark Legion’s upper, middle and lower roads were led by the Pure Cleansing, Cheetah and Wind Colour group respectively. It was impossible for Ling Xuefeng to take care of each group so he entrusted it to the management of these guilds. As the team leaders, they commanded the three roads separately.</p><br/><p>After all, the three president vice-commanders weren’t rookies and they were able to quickly understand Ling Xuefeng’s meaning.</p><br/><p>Same Boat Under Wind and Rain immediately sent a message: [The third group has three chariots damaged and there are seven left. The personnel casualties are 12 groups.]</p><br/><p>Pure Cleansing’s president reported next. [The second group has five chariots left and 10 groups of casualties.]</p><br/><p>Cheetah’s president Ultimate Hunter typed: [The first group is similar to the second group.]</p><br/><p>The surprise attack had stolen three mines but the losses to their side were also heavy. The good thing was that these losses were within acceptable limits.</p><br/><p>The satisfied Ling Xuefeng typed: [Everyone will push the chariots and ores back under the protection of the paladins.]</p><br/><p>Since 90,000 gold was used before, there wasn’t enough money to repair the castle. They had to make money as soon as possible.</p><br/><p>Ling Xuefeng’s ideas were good but the opposite commander Li Cangyu wasn’t a person to be bullied. His order had just been given when a large number of messages appeared on the camp channel: [Not good! The opposite side went straight to our stronghold!]</p><br/><p>[They are pulling the Dark Goddess! Damn, the main T is As the Name Suggests of the Food Squad.]</p><br/><p>[The Dark Goddess has lost 5% health!]</p><br/><p>[There are at least 100 groups! It is extremely crowded!]</p><br/><p>Ling Xuefeng saw the information on the camp channel and inwardly felt surprised.</p><br/><p>Cat’s counterattack speed simply wasn’t ordinary!</p><br/><p>***</p><br/><p>The Bright Legion’s counterattack was truly swift and depended entirely on the determination of the chief commander Li Cangyu.</p><br/><p>Ling Xuefeng had just stolen the three mines of the Bright Legion. A general commander might be confused by this sudden attack but Li Cangyu was very calm.</p><br/><p>He reacted as soon as he found out that the opposite commander was Ling Xuefeng.</p><br/><p>-If you dare to sneak attack my mines, I will assassinate your camp’s goddess!</p><br/><p>Not repairing the Dark Goddess’ castle? It was a convenient way to let them enter unimpeded!</p><br/><p>The Dark Legion’s chariots did cause the Bright Legion to suffer heavy casualties. However, the legion defense had one characteristic. Players who died could freely choose a resurrection point that had been occupied by their side.</p><br/><p>At the beginning, Ling Xuefeng sent people to investigate the entire map. Li Cangyu naturally wasn’t idle. Once the bridges were connected, he sent 10 groups secretly into the Dark Legion’s camp and forcibly took that resurrection point.</p><br/><p>As Ling Xuefeng drove the chariot to the Bright Legion’s camp, Li Cangyu took the opposite side’s resurrection point!</p><br/><p>[Everyone who dies, immediately choose the resurrection point of the Dark Legion to resurrect!] Li Cangyu ordered after the three mines were attacked. [Anyone who isn’t dead, jump into the abyss to kill yourself. Then resurrect on the opposite site and assemble at the point I marked!]</p><br/><p>Jumping into the abyss took only three seconds and waiting to resurrect took 10 seconds.</p><br/><p>This way of gathering was much faster than groups of people walking slowly down the roads.</p><br/><p>In just half a minute, while the Dark Legion were slowly driving the ore across the bridge and returning home, hundreds of groups from the Bright Legion had already gone from the lower resurrection point to the goddess’ lair!</p><br/><p>The small madman Gu Siming pulled the Dark Goddess according to Cat God’s instructions.</p><br/><p>The goddess was really beautiful and the dark wings behind her were gorgeous. It was a pity that she didn’t have the protection of the castles after appearing and the Bright Legion reached her unobstructed.</p><br/><p>There were no doubts about Xiao Gu’s boss techniques. Once he stabilized the boss, Li Cangyu immediately ordered everyone to open fire and the goddess’ blood quickly fell to 95%.</p><br/><p>Li Cangyu attacked the boss while watching the timer.</p><br/><p>After all, this was the Dark Legion’s base. It would be disadvantageous to fight against a large group here and Li Cangyu estimated that the opposite side’s forces were about to arrive. He looked at the boss’ blood volume that had fallen to 80% and didn’t hesitate to order: [Don’t avoid the boss’ big move and collectively die. Once you die, choose the resurrection point in the centre of our castle!]</p><br/><p>The Dark Goddess’ blood soon fell to 80% and a red light flashed from her black wings. Her huge wings then unfolded and countless black feathers descended from the sky in a 360 degree range. They danced and stabbed the surrounding players like swords.</p><br/><p>The black feathers swept over them, the effect of the big move looking truly gorgeous.</p><br/><p>Ling Xuefeng saw this scene when he came over with a large force. Hundreds of Li Cangyu’s groups died under the goddess’ big move, their bodies covering the ground.</p><br/><p>Then after 10 seconds, the bodies magically disappeared…</p><br/><p>They chose to resurrect back at the camp according to the commander’s order.</p><br/><p>Hundreds of enemy groups suddenly attacked, decreasing the Dark Goddess’ health by 20% and then collectively disappeared!</p><br/><p>This type of sneak attack was more shocking than taking three mines!</p><br/><p>You know, it was very difficult to decrease the camp boss’ blood, especially after the defense castles were built. If they wanted to see the camp boss, they had to first destroy the castle, kill the castle guards and face the other forces after seeing the boss…</p><br/><p>In the many years since Miracle opened, the camp boss had been killed no more than three times.</p><br/><p>Today, Li Cangyu took advantage of Ling Xuefeng’s stealing the ores to quickly suicide and resurrect at the stolen resurrection point. They quickly sneaked into the Dark Goddess’ lair and took 20% of the camp boss’ health!</p><br/><p>It was inevitable that the Dark Legion’s troops would rush back to kill them. Yet the hundreds of groups were killed directly by the boss’ big moves, without a single person left behind…</p><br/><p>This approach was really decisive and simply astounding!</p><br/><p>Ling Xuefeng looked at the disappearing corpses and a glimmer of appreciation filled his eyes.</p><br/><p>This was Li Cangyu’s command style. He wasn’t willing to eat a single bit of loss.</p><br/><p>This counterattack was really fierce. The Dark Legion might have an advantage in economy but 20% of the boss’ blood had been destroyed. In the later period of the war, it was necessary to be careful. If a mistake was made, Li Cangyu would directly go and kill the boss.</p><br/><p>***</p><br/><p>The guilds’ management were dumbfounded when they saw this scene.</p><br/><p>In the past, the legion defense involved occupying the three mines in the early stages then use the money to build up the castle. Once the castle was repaired, make money and buy chariots and cannons…</p><br/><p>Sometimes it would take two hours and the face of the camp’s boss couldn’t even be seen.</p><br/><p>However, today, the speed of the two commanders was so quick that the people involved couldn’t recover.</p><br/><p>This started less than 40 minutes ago and the Bright Legion already had three mines stolen while the Dark Legion’s boss was attacked!</p><br/><p>There were many people in both camps who gave thumbs up and praised the commanders on both sides.</p><br/><p>The league’s number one brainless fan Cheng Wei was also excited and crazily filled the camp channel: [The commander is mighty and domineering! Commander, good power! Great! Commander, fighting!]</p><br/><p>Tan Shitian, “…”</p><br/><p>***</p><br/><p>In the office of the Wind Colour team, Popular Land Under Heaven looked at his captain with a perturbed glance.</p><br/><p>Any commander would be irritable at having 20% of their goddess’ blood stolen but Ling Xuefeng’s expression was very calm. His eyes were full of appreciation and it was like he was happy…</p><br/><p>In fact, winning or losing wasn’t important. Captain Ling personally became the commander in order to fight against Cat God.</p><br/><p>Popular Land Under Heaven suddenly felt that… he understood something very important.</p><br/><p>Once Li Cangyu successfully counterattacked, he sent a message on the world channel: [Opposite commander, how about the middle group?]</p><br/><p>Ling Xuefeng said: [I’ll go back to repair the castle. Let’s talk at 9 o’clock.]</p><br/><p>Li Cangyu: [The activity is over at 11 o’clock. Hurry and make money.]</p><br/><p>Ling Xuefeng: [I have more money than you.]</p><br/><p>Li Cangyu: [My boss is still full of blood.]</p><br/><p>Ling Xuefeng: [You’re good. [Thumbs up]]</p><br/><p>Li Cangyu: [You’re not bad either. [Thumbs up.]]</p><br/><p>Everyone, “…”</p><br/><p>Hey hey! Is it okay for the two great commanders to praise each other? Look at all the people watching!</p><br/>\n</div>"}