{"title": "Chapter 64", "id": 64, "volume": 1, "url": "http://boxnovel.org/god-level-summoner-chapter-64", "volume_title": "Volume 1", "body": "<h1>Chapter 64</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 64 – Steamed Bass’ Identity</p><hr/><br/><p>Xie Shurong came back and returned straight to the dormitory. In any case, he wasn’t participating in the team’s next game so he didn’t have to worry about the lineup and tactics. There were still people working overtime in the training room. The young man Agnus, who was placed on the lineup by the captain, saw Xie Shurong passing by and said with a smile, “A’Shu, I thought you weren’t coming back! You must be so happy. You can have a holiday while we are miserable preparing for tomorrow’s game.”</p><br/><p>The irony in this sentence was obvious. Xie Shurong smiled and said, “Refuel!”</p><br/><p>Then he turned quietly and walked away.</p><br/><p>This child was too arrogant and would someday fall. Players in the field would naturally teach him so there was no need to waste his breath.</p><br/><p>After returning to the dormitory, he logged into the online game. His account had risen to level 65 after the legion defense.</p><br/><p>Once Li Cangyu saw that A’Shu was online, he was added to the team. Zhang Jueming and Gu Siming were also online so the five member fixed team once again assembled.</p><br/><p>Li Cangyu sent a welcome expression on the team channel and said: [Let’s officially welcome Old Zhang to join our team.]</p><br/><p>Bai Xuan put on a headset and asked, “Old Zhang, do you remember me?”</p><br/><p>Zhang Jueming laughed and said, “Nobody can forget you, Super Dad Vice-Captain Bai?”</p><br/><p>Bai Xuan smiled and asked, “Really?”</p><br/><p>Xie Shurong coughed and interrupted the two of them. “Cough, Old Zhang, I’ve heard of you as well.”</p><br/><p>“I am in the same generation as your master. Where have you heard of me?” Zhang Jueming asked curiously.</p><br/><p>Xie Shurong spoke with a thick face, “I naturally heard it from my master.”</p><br/><p>“Captain Song? Did he say anything nice about me?”</p><br/><p>“Master praised you for being very manly.” Song Yan only said that Zhang Jueming was a bold northern person and that he once held a dinner for all the professional players. Nothing else was mentioned so Xie Shurong didn’t have a deep impression of this person. Obviously, Zhang Jueming didn’t do well in the first season. However, since Cat God pulled him into the team, he must have a bright spot that would attract Cat God.</p><br/><p>Xie Shurong was very trusting of Cat God’s eyes.</p><br/><p>There was this bold and uninhibited uncle present, causing everyone to become familiar with each other on the voice channel..</p><br/><p>Xiao Gu suddenly realized one thing and asked, “Isn’t there still a person in our fixed team? What about Steamed Bass?”</p><br/><p>Bai Xuan couldn’t help wondering, “Speaking of Steamed Bass, the time he is going online these days are very irregular. He didn’t come to the legion defense on Sunday and he is five levels lower than us.”</p><br/><p>Zhang Jueming wondered, “Is there a temporary problem with his family or something?”</p><br/><p>Li Cangyu listened to everyone discussing it and couldn’t help smiling slightly, “This Steamed Bass, he is likely to be a heavyweight undercover.”</p><br/><p>Everyone was surprised and Zhang Jueming directly asked, “Old Cat, who do you suspect he is?”</p><br/><p>Li Cangyu replied, “There is no evidence yet so I’ll tell you when I rip off his cover.”</p><br/><p>Xiao Gu was very curious but he didn’t dare to ask.</p><br/><p>“Then I’ll wait for you to release the truth.” Zhang Jueming simply changed the topic, saying, “Yes, last time you told me to bring the child to the arena. I sorted out the full level accounts that my studio isn’t using these days. There are 10 accounts of different races and I will allow Xiao Gu to get familiar with the style of each profession.”</p><br/><p>Li Cangyu praised him. “Yes, I think so as well. Xiao Gu’s understanding of the major classes in Miracle isn’t thorough enough. Let him play every profession first.”</p><br/><p>Gu Siming excitedly exclaimed, “I know Captain! I will follow Uncle to learn!” Zhang Jueming continued saying, “I have many accounts. If you need anything then just ask.”</p><br/><p>Li Cangyu said, “I won’t use them for the time being. Once the team members are ready, I will find you again.”</p><br/><p>“No problem!” Zhang Jueming felt happy that he could help the team a little bit.</p><br/><p>***</p><br/><p>Steamed Bass wasn’t online so Li Cangyu searched through the guild list to find teammates.</p><br/><p>Small Elf, Small Archer and Small Hunter, the three vice presidents appointed by Li Cangyu currently had the highest level. Li Cangyu opened a chat and invited the three of them to join.</p><br/><p>[The president has come!] The trio greeted him excitedly.</p><br/><p>[You worked hard while I wasn’t here.] Li Cangyu stated.</p><br/><p>[You are welcome! The guild’s construction points are full. Do you want to upgrade the level?] Small Elf asked.</p><br/><p>These three students could be regarded as an unexpected harvest for Li Cangyu. In this time, Li Cangyu was busy and Bai Xuan had also run to travel. All guild matters were thrown at them but the three university students were very serious and used their spare time to manage the guild.</p><br/><p>Today Li Cangyu logged in and found that the construction points of the Food Squad filled up in just a few days.</p><br/><p>Only the president had the authority to upgrade the guild level. Li Cangyu went to the NPC to upgrade Food Squad to level four and gave the three people a task. [The number of members will increase so you should pay attention. See if there are any talents when doing the instances and this will help facilitate sub-groups once we reach full level.]</p><br/><p>[I understand!] The trio actively responded.</p><br/><p>[Come with me to play a level 65 instance. I will teach you the quickest way to clear it.] Li Cangyu typed on the team channel before speaking on the voice channel. “A’Shu, Old Zhang, the two of you leave the team. I will take them through it once and then you can come back.”</p><br/><p>The two people decisively left the team and Old Zhang took A’Shu to visit the black market trading house.</p><br/><p>Li Cangyu’s team of six entered the level 65 ‘Blood Kin Castle’ instance.</p><br/><p>The mobs of this instance were all vampires who could use stealth. Dealing with them was very annoying but this instance had a trick. There was a shortcut they could take to directly avoid the mobs and just face the boss.</p><br/><p>Many people knew about this route but Li Cangyu personally used his high agility to give the three people a demonstration of the quickest route.</p><br/><p>The boss also had some skills. Li Cangyu patiently explained them while playing. The trio seriously remembered the explanation. Li Cangyu had asked them to teach this to other people in the Food Squad so that the members didn’t have to worry about leveling.</p><br/><p>After clearing the instance, Li Cangyu brought Old Zhang and A’Shu back onto the team.</p><br/><p>He opened his friends list and saw that Steamed Bass still wasn’t online.</p><br/><p>The domestic time should now be 8:30 a.m. on Wednesday. Li Cangyu opened the Miracle official website and saw there was a match between Wind Colour and Pure Cleansing this morning.</p><br/><p>Li Cangyu spoke into his headset, “Everyone, look at Miracle’s official website. Today Wind Colour is facing Pure Cleansing.”</p><br/><p>Fanboy Gu Siming immediately exclaimed excitedly, “Yes yes, Captain Ling is playing today!”</p><br/><p>“Aren’t we clearing the instance?” Bai Xuan asked.</p><br/><p>“This boss is a piece of cake for us. I believe there won’t be a problem if we watch and play.” Li Cangyu stated.</p><br/><p>The team of five professional players really didn’t need to be focused when playing the boss of a small instance. Everyone opened the website to the live broadcast, narrowed the game window and operated their accounts while watching the game.</p><br/><p>***</p><br/><p>Pure Cleansing was a very distinctive team in China’s Miracle Alliance. Their style was called ‘illusion flow.’</p><br/><p>Other teams used either melee output or remote output as the core. Pure Cleansing’s captain and vice-captain were auxiliaries so their tactics placed the auxiliary psychic as the core.</p><br/><p>The double auxiliary style of play, the output was weak but they were very difficult to face.</p><br/><p>This was the evaluation of the Pure Cleansing by many captains in the league.</p><br/><p>Today, the match between Wind Colour and Pure Cleansing was once again deadlocked. Even the extremely aggressive Ling Xuefeng was troubled by the continuous control when facing the double auxiliary combination of Zhu Qingyue and Chu Yan.</p><br/><p>Zhu Qingyue, the former crybaby, had become a very cool auxiliary player after his transition to captain in the third season.</p><br/><p>Honestly, the first captain of Pure Cleansing and current vice-captain, Chu Yan was quite courageous. Xiao Zhu might be talented by his psychological endurance was particularly weak. He cried after losing games, causing the reporters to smell blood.</p><br/><p>There were often male players yelling at him in the comments. “The baby who hasn’t grown up should go home instead of playing the game.” The female players were the opposite. “A child crying is really pitiful. Let Sister hug you.”</p><br/><p>Zhu Qingyue was a controversial player because he cried for half an hour after being beaten by Li Cangyu, shocking the whole league. There were many people who hated him but he also had many fans.</p><br/><p>Chu Yan forced the young boy to the captain’s position at the end of the third season, making him grow up as quickly as possible. Zhu Qingyue was pushed by the media and grew up quickly, living up to expectations. After Xiao Zhu lost a game, he was very calm. His mentality stabilized and he gradually became one of the best auxiliary players in the Miracle League.</p><br/><p>However, the overall strength of Pure Cleansing was still worse than Wind Colour. Zhu Qingyue and Chu Yan’s combination could drag the battle on for 40 minutes but Ling Xuefeng was best at seizing opportunities. Once Xiao Zhu made an accidental mistake, Ling Xuefeng rushed into the back row to directly break up the lineup of Pure Cleansing. Yan Ruiwen quickly followed to control Xiao Zhu and the outputs of the other Wind Colour members followed, killing Zhu Qingyue in seconds.</p><br/><p>This group battle started very suddenly and the end was extremely fast. In the blink of an eye, Pure Cleansing was destroyed.</p><br/><p>Many people in the live broadcast spat out, “They were tangled up for 40 minutes but it ended in less than 10 seconds.” “Every game with Pure Cleansing is like this. Pure Cleansing is like a group of soft cotton. Cutting them is unclear and they can drag things out to victory or make it so that the opposing team is very tired.” “Will Captain Zhu cry again?” “Don’t blacken Xiao Zhu. He hasn’t cried for a long time!” “Hand paper towels to Xiao Zhu.”</p><br/><p>The director deliberately pointed at the camera at Zhu Qingyue, who didn’t cry. Instead, he shyly smiled at the camera while scratching his head. He knew that there were definitely a lot of people in the Internet making fun of him. It was really awkward. Every time he made a Weibo post, the comments below would be countless people handing him paper towels…</p><br/><p>***</p><br/><p>Ling Xuefeng led his team over to shake hands. Zhu Qingyue also stood up politely, the expression on his face quite calm.</p><br/><p>Li Cangyu couldn’t help feeling emotional looking at this scene. In the past, Li Cangyu had come over to shake hands. As a result, the little guy cried until his eyes turned red and Li Cangyu comforted him for a long time. He also asked the team out to eat grilled fish after the game.</p><br/><p>Today, the little crybaby had grown up and was already the leader of a team.</p><br/><p>Pure Cleansing wasn’t as dazzling as Wind Colour, Flying Feathers and Time in the past few years but this team was very special in the Miracle League. Their style was very clear and they had been runners-up a few times. It was a good result.</p><br/><p>Li Cangyu turned off the live broadcast and switched back to the Moonlight Forest district, focusing on playing the instance with his teammates.</p><br/><p>After approximately 30 minutes, a prompt appeared in the bottom left corner indicating that Steamed Bass was online.</p><br/><p>Li Cangyu sent him a message: [Are you here? Do you want to join the group to clear instances?]</p><br/><p>[Yes.] Steamed Bass was soon added to the team.</p><br/><p>Everyone had heard from Cat God that this person was an undercover but Cat God was looking for evidence to reveal his identity. Therefore, everyone didn’t react and pretended to know nothing as they played the instance.</p><br/><p>Xiao Gu excitedly exclaimed in the voice channel, “I feel so awkward playing an instance with an uncover!”</p><br/><p>Zhang Jueming laughed. “The child should calm down.”</p><br/><p>Bai Xuan also asked, “Is this undercover someone you know?”</p><br/><p>Li Cangyu said, “Don’t worry, I’ll test him out soon.”</p><br/><p>After the instance was over, Li Cangyu sent a PK invitation to Steamed Bass.</p><br/><p>Ling Xuefeng thought that if he didn’t accept, it would be easy to arouse the clever cat’s suspicions.</p><br/><p>In order to avoid exposing himself, Ling Xuefeng deliberately hid part of his strength and played like an ordinary veteran of the online game. As a result, during a critical moment in their duel, Li Cangyu suddenly sent a private message: [Today’s match with Pure Cleansing, the tactics were well arranged.]</p><br/><p>The finger on the other side of the computer slipped and Steamed Bass showed a gap. This was caught by Li Cangyu and he used the opportunity to kill the opponent.</p><br/><p>Ling Xuefeng, “…”</p><br/><p>‘Cat, could you not send a harassing message at a critical moment in PK?’</p><br/><p>Li Cangyu smiled with satisfaction. He sent out feelers and they were grabbed.</p><br/><p>The reason why he suspected Steamed Bass to be Ling Xuefeng was because in the legion defense war, Ling Xuefeng came to act as command while Steamed Bass didn’t log in. Any veteran would know that the most important activity in Miracle was the legion defense. On Sunday, when the rate of people logging in was the highest, Steamed Bass didn’t come, causing Li Cangyu’s suspicion.</p><br/><p>He also thought back to when Steamed Bass joined the Food Squad and it was exactly the day that Ling Xuefeng recognized him in the online game. In addition, the name of Steamed Bass was too good. The final straw was that Steamed Bass wasn’t online today while Wind Colour had a match…</p><br/><p>Could these four points be explained by coincidence?</p><br/><p>In any case, Ling Xuefeng wasn’t a professional undercover and he hadn’t entered the Food Squad for malicious reasons. He didn’t have the professional undercover training that the big guilds gave and Li Cangyu knew him very well. Li Cangyu made a simple attempt and took off his cover.</p><br/><p>Li Cangyu suppressed a smile and sent in the private chat: [Xuefeng, is it fun to open a side account and enter my guild as an undercover?]</p><br/><p>Ling Xuefeng, “…”</p><br/>\n</div>"}