{"title": "Chapter 78", "id": 78, "volume": 1, "url": "http://boxnovel.org/god-level-summoner-chapter-78", "volume_title": "Volume 1", "body": "<h1>Chapter 78</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 78 – Precious Gift</p><hr/><br/><p>On the first day of the World Carnival, the morning event was a basketball game and the afternoon event was a 100 metres race.</p><br/><p>The rules of the race were very simple. The game would have six parallel lanes in the game. Six people stand on a runway and sprinted to the finish. There were various obstacles such as ponds, steps, boulders and trees. They could also use a variety of interference skills to block the opponents. The first one to reach the end would win.</p><br/><p>Surprisingly, Ling Xuefeng actually joined the race.</p><br/><p>Some night owls who stayed up late to watch the game couldn’t help commenting: [How come Captain Ling is taking part in such an event?] [I don’t know. Captain Ling’s serious expression seems inconsistent with this fun race!] [Maybe he thinks running is more fun than basketball?]</p><br/><p>Regardless of their guesses, the race officially began.</p><br/><p>The first batch of players actually had Ling Xuefeng assigned to the third lane. The IDs of the other five players weren’t familiar but the flags in front of the IDs showed they were from several countries.</p><br/><p>The referee fired the signal and the race officially began.</p><br/><p>Ling Xuefeng calmly tapped the keyboard, operating his demon summoner to quickly run forward.</p><br/><p>The elf contestant on the fourth lane took advantage of his agility to overtake Ling Xuefeng but Ling Xuefeng just ignored it. It didn’t take long for the second lane to overtake him and Ling Xuefeng ran steadily behind.</p><br/><p>The domestic audience watching the game were anxious. [Captain Ling, hurry and run!]</p><br/><p>[Captain Ling, refuel!]</p><br/><p>[Run run!]</p><br/><p>The players moved through the pond, steps, boulders and tree barriers and saw there was only one-third of the way left.</p><br/><p>Ling Xuefeng acted at this moment!</p><br/><p>He summoned a skeleton infantry to freeze the left front player in place, followed by a banshee who used Charm to pull the front right player back. Then his big move Cover the Sky was used! A group of black crows flew in the sky, covering the visions of the players in front!</p><br/><p>Ling Xuefeng took advantage of this to suddenly spring forward, quickly surpassing the three contestants in front of him!</p><br/><p>The audience was stunned as the fourth place demon summoner crossed the finish line first.</p><br/><p>All of this happened in just a few seconds. Ling Xuefeng grabbed the most appropriate opportunity and used three pets to reverse the situation at the last moment!</p><br/><p>At the scene of the race, the black crows were still flying in the sky, making the contestants look bloody.</p><br/><p>The host also marveled. “Everyone, the winner is LXF in the third lane. This player is Ling Xuefeng from China, the world’s strongest demon summoner! We saw how quickly he summoned his pets and flexibly used them to successfully interfere with the opponents, allowing him to rush forward at the end!”</p><br/><p>“Congratulations Ling Xuefeng on winning this round!”</p><br/><p>The venue was filled with thunderous applause while the live broadcast room was filled with: [Captain Ling 66666!] [Captain Ling is so handsome I want to cry!] [Are you still lacking leg pendants?] [Demon King reversed the field 66666!]</p><br/><p>Li Cangyu was watching in the audience and also raised his hands to clap.</p><br/><p>Ling Xuefeng calmly waited for the opportunity and then seized it, dealing a killing blow to the opponents.</p><br/><p>As soon as he acted, even a simple entertainment event would be crushed by him. He maintained his speed and followed behind to reduce his sense of existence. Then at the last moment, he surpassed the three people in front of him. This type of ‘mantis stalks the cicada, unaware of the oriole behind it’ strategy was really handsome.</p><br/><p>There was one thing Li Cangyu didn’t understand. Why did Ling Xuefeng suddenly enter the race event? It didn’t seem to suit his serious personality.</p><br/><p>Once Ling Xuefeng received the souvenir, Li Cangyu immediately received a text message. [I won you a model of an elf summoner. I’ll give it to you afterwards.]</p><br/><p>Li Cangyu, “…”</p><br/><p>The reward for the afternoon races was a designated race and class model which had exquisite workmanship. It was said that the base was pure gold and it was very expensive. Each model was unique and it was only distributed at the World Carnival. The value of this model couldn’t be measured with money. It was a symbol of honour.</p><br/><p>Li Cangyu didn’t know if he should laugh or cry. [Why are you giving me the model that you won?]</p><br/><p>Ling Xuefeng replied: [This model is only issued at the Carnival. I don’t know if they will have it next year so I will first help you win it.]</p><br/><p>Li Cangyu, “…”</p><br/><p>At this moment, an indescribable feeling filled Li Cangyu’s heart.</p><br/><p>Ling Xuefeng deliberately joined the entertainment race to win Li Cangyu a unique elf summoner model that was only distributed at the World Carnival. It was a more valuable gift than anything else.</p><br/><p>***</p><br/><p>The entertainment project officially ended at 5 o’clock. Li Cangyu let Bai Xuan go back first and headed to the hotel entrance alone.</p><br/><p>This hotel was the official place that the organizing committee designated for players. People without a pass weren’t allowed to enter. This strict inspection system was to avoid the harassment of fans and journalists to ensure the safety of the competitors.</p><br/><p>There were many reporters at the entrance to the hotel. Ling Xuefeng saw Li Cangyu hiding behind a pillar and knew that Li Cangyu was worried about being recognized by reporters. Ling Xuefeng sent a text message asking for help to Tan Shitian and then opened the door to reporter Yao Rong.</p><br/><p>Tan Shitian and Cheng Wei had been heading this way. He received the text message and took the initiative to greet the reporter. “Reporter Yao, hello!”</p><br/><p>Yao Rong immediately raised the microphone happily to his mouth. “Captain Tan, your afternoon drawing was very good. Many domestic audience members are saying that you have a small red hand.”</p><br/><p>Tan Shitian put an arm around Cheng Wei’s shoulders and said, “It is Vice-Captain Wei’s credit. After waking me up at noon, he made me wash my hands five times.”</p><br/><p>Cheng Wei smiled to the camera and said, “Everyone, please pay attention to my Weibo. I will teach you how to wash your hands to pick up good equipment. I won’t deceive you!”</p><br/><p>Everyone, “…”</p><br/><p>Ling Xuefeng saw that Reporter Yao’s attention was attracted and then strode to the hotel door. He gently pulled Li Cangyu by his waist and moved through the crowd.</p><br/><p>Li Cangyu followed him into the elevator and smiled with relief. “I thought I would have to sneak into the hotel to find you.”</p><br/><p>Ling Xuefeng looked into his eyes and asked with concern, “Have you eaten?”</p><br/><p>“Not yet.”</p><br/><p>“I don’t want to eat with the league players. It is better to eat by ourselves and talk.”</p><br/><p>“Yes.” Li Cangyu had no problem with this.</p><br/><p>Ling Xuefeng brought Li Cangyu to the Western restaurant on the fourth floor of the hotel. They found a quiet couples room to sit in, picked up the menu and ordered some food.</p><br/><p>The private room was very quiet and the waiter left after serving them. There was no need to worry about outsiders and they chatted while eating.</p><br/><p>“In the evening 3v3 event, which team will you play in the first match?” Li Cangyu asked.</p><br/><p>“The first match is Australia. I’m not very familiar with the contestants over there but it is a combination of swordsman, berserker and healer.”</p><br/><p>“The swordsman and berserker are a stable front row. Combined with the support of the healer in the rear, their life force is very strong. You will suffer if you aren’t quick.” Li Cangyu carefully analyzed it.</p><br/><p>“Against this team, isn’t it best to kill the healer first?”</p><br/><p>“This method is feasible. If you cooperate with Su Guangmo to kill the healer, things will turn out better.” Li Cangyu smiled and looked up at Ling Xuefeng. “You didn’t need to invite me over for such a simple tactical analysis, right?”</p><br/><p>“I’m confident when dealing with others teams. I want to hear what you think about the US and South Korean team.” Ling Xuefeng looked seriously at the man in front of him and spoke softly. “The US team 1 and South Korean team 2 are both in Group C. It won’t be easy to reach the quarter-finals. I want to hear your suggestions and come up with a set of tactics with the highest success rate. Your opinion is very important to me.”</p><br/><p>Li Cangyu heard this and couldn’t help feeling admiration.</p><br/><p>Ling Xuefeng’s character was cold and tough but he didn’t act arbitrarily. He also wasn’t conceited enough to think all his decisions were right. On the contrary, he could calm down and listen to other people’s suggestions to make the best path for himself. This was the smartest way for a strong person.</p><br/><p>In any case, this was a world competition, not a matter involving the Wind Colour team. There were too many masters and he was willing to calm down and listen to other people’s suggestions. For example, the powerful Li Cangyu could give him lots of new ideas.</p><br/><p>Li Cangyu’s personality had always been straightforward and he had no intention of hiding his ideas. He said, “The three ace players of the US are in team 1. Thomas has the remote fast suppression,. Jack Josh had a large outbreak due to his blood kin pets while Edmund is the strongest assassin on the US side. A team consisting of an archer, summoner and assassin will be very aggressive. Our side has two strong outputs and an auxiliary. It is difficult to fight them from the front so it is better to lay a trap.”</p><br/><p>Ling Xuefeng was interested in the idea. “Do you mean to deliberately reveal a flaw to attract the enemy?”</p><br/><p>“Yes.” Li Cangyu explained it carefully. “This task can be completed by Su Guangmo. He can perform an act in the front row by pretending to accidentally make a mistake. The other side will turn their attention to him and rush to kill him. Su Guangmo’s explosive ability is very strong and can unleash explosive skills before death. Once the opposite is beaten to residual blood, your outbreak will take care of the rest.”</p><br/><p>Ling Xuefeng’s eyes were bright. “I understand. You mean to sacrifice Su Guangmo and save Chu Yan while I come out to collect their heads?”</p><br/><p>Li Cangyu nodded. “You and Su Guangmo have similar levels to the opposite swordsman and summoner. Therefore, the auxiliary is the key. If Chu Yan dies and it becomes 2v3, our side will definitely lose. If you save Chu Yan to keep the advantage of controlling the field, there is a bigger chance of winning. The method to implement it, you can go back and discuss it with them. Of course, this is just one of my suggestions. If you have a better plan, tell me and we can discuss it.”</p><br/><p>Ling Xuefeng said, “I think your idea is quite good.”</p><br/><p>Unlike Ling Xuefeng who mainly used the suppression style, Li Cangyu’s tactical thinking was mysterious and varied. He used to take a weak team to fight with strong teams that he definitely couldn’t beat from the front. Therefore, he painstakingly studied various tactics, which would sometimes allow him to overturn the strong team.</p><br/><p>In the domestic league, Ling Xuefeng wasn’t afraid to fight any team with his suppression style. However, this was now the international arena and the players on the US team were gods on the same level. The key to winning or losing depended on tactics and luck.</p><br/><p>Li Cangyu could really provide him with new ideas. Ling Xuefeng looked at the other side with appreciation and said, “I suddenly feel confident with you as my behind the scenes strategist.”</p><br/><p>“Give me the strategist’s appearance fee.” Li Cangyu held out a hand.</p><br/><p>This scene was like a proud big cat extending his claws to ask for a toy.</p><br/><p>Ling Xuefeng took out a delicate box and put it in his hand.</p><br/><p>Li Cangyu opened the box and saw the elf summoner model that Ling Xuefeng had won in the entertainment event. This model was small and extremely delicate. Its quality was far beyond the usual goods in the stores. The most special thing was its base, which was made of pure gold and had the words ‘First World Carnival Commemoration’ on the back.</p><br/><p>“Is the base really pure gold?” Li Cangyu touched it and really loved it.</p><br/><p>“That is what the officials said.”</p><br/><p>“Can I take it off and sell it? This gold can be sold for a lot of money right?” Li Cangyu smiled and looked at Ling Xuefeng. The latter’s expression was still calm as he stated, “This is already yours. You can deal with it however you like.”</p><br/><p>“…” He had no sense of humour at all! Li Cangyu joked with him but he was still serious.</p><br/><p>Li Cangyu helplessly retracted the model and said seriously, “I will keep this model well. If there are such rewards at next year’s Carnival, I will go and help you win a demon summoner so that you don’t lose anything.”</p><br/><p>Ling Xuefeng couldn’t help smiling when he heard this and he looked at the man full of confidence in front of him. “I will hold you to your words.”</p><br/><p>He helped give the elf summoner model and Li Cangyu would return it by winning the demon summoner model. This gift exchange created a surge of sweetness in Ling Xuefeng’s heart.</p><br/><p>Changing World Series presents, who in the world would think this except for them? Thinking carefully, it was actually a bit embarrassing.</p><br/><p>Li Cangyu obviously did this because he was righteous. His idea was, ‘You won me a present, I will win you one.’</p><br/><p>But Ling Xuefeng was very content.</p><br/><p>He wasn’t in a hurry. He was already the most special person in Li Cangyu’s heart. As long as he subtly boiled the warm water, this clever and sharp cat would soon become Ling Xuefeng’s exclusive lover.</p><br/>\n</div>"}