{"title": "Chapter 70", "id": 70, "volume": 1, "url": "http://boxnovel.org/god-level-summoner-chapter-70", "volume_title": "Volume 1", "body": "<h1>Chapter 70</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 70 – Crazy Voting</p><hr/><br/><p>Li Cangyu was loyal while Liu Chuan was very bold. The last time they met in Changsha, they helped Xiao Gu and Old Zhang buy tickets to go to New York. The procedures for leaving the country and the tickets were all handled by Liu Chuan.</p><br/><p>The Dragon Warriors Club had deep pockets and this wasn’t a high cost. Liu Chuan felt that it was good to let players leave the country. In particular, Xiao Gu hadn’t gone anywhere since joining the Dragon Warriors training camp. They should let him open his eyes and know the truth of a mountain beyond a mountain, so that he could find his own position and have a joyful debut.</p><br/><p>Zhang Jueming and Gu Siming asked the boss about the departure time and then anxiously rushed to pack their bags.</p><br/><p>***</p><br/><p>On the evening of September 25th, Miracle’s official website in China was almost paralyzed by fans.</p><br/><p>It was the last moments of the Carnival coting. The netizens cast their votes and the ranking changed almost every minute. Just clicking their mouse on the refresh button would show different rankings, making it particularly exciting.</p><br/><p>Ling Xuefeng’s fans were very organized and disciplined. At around 11 o’clock in the evening, they started to insanely vote, sending Captain Ling to a first place position that couldn’t be surpassed. Su Guangmo and Tan Shitian’s fans followed, the trio forming the first echelon of the voting.</p><br/><p>The competition from the fourth to the twelfth place was extremely fierce. There were too many excellent players in the Miracle League, each with their individual personality and their diehard fans. The fans hoped that the players they liked could be selected. People even registered various side accounts at the beginning and were waiting for the final voting period.</p><br/><p>The current rankings from fourth place onward was: Red Fox’s captain Liu Xiang, Time’s vice-captain Cheng Wei, Pure Cleansing’s vice-captain Chu Yan, Cheetah’s captain Jiang Xu, Ghost Spirits’ captain Lou Wushuang, Red Fox’s vice-captain Yang Muzi, Wind Colour’s vice-captain Yan Ruiwen, Ghost Spirits’ vice-captain Zhang Shaohui, Flying Feathers’ vice-captain Yu Pingsheng and Pure Cleansing’s captain Zhu Qingyue.</p><br/><p>These people only had a difference of a few hundred votes between first and last and there were still many fans waiting to vote at the least minute. The final result was unpredictable.</p><br/><p>There was only one hour left!</p><br/><p>At this moment, Zhang Shaohui suddenly wrote a message on Weibo. [Thank you to all the people who voted for me. Friends who have extra votes, please don’t vote for me again. Use all of them on my brother Lou Wushuang. I hope that he can represent the country and become a killer at the World Carnival. Thank you!]</p><br/><p>The fans left many messages. [I understand Vice-Captain Zhang!] [It would hurt his brother so he would rather give up his spot to help his brother., Captain Lou will certainly be very pleased to have such a brother!] [Listen to the vice-captain. Use all votes on Brother Lou!] [Everyone vote quickly. We must secure one place for Ghost Spirits!]</p><br/><p>Once Lou Wushuang got out from the shower, he opened to the voting interface on the official website and saw that he had actually jumped to fifth place!</p><br/><p>What was going on?</p><br/><p>He had a cold personality since he was a child and didn’t have many diehard fans in the league. It was incomparable to Tan Shitian. His votes had already fallen to seventh place and he hadn’t held onto hope. How could he suddenly reach fifth place in the poll?</p><br/><p>Lou Wushuang opened Weibo and finally understood.</p><br/><p>It turned out that Zhang Shaohui voluntarily gave up an opportunity to be selected and helped him gain votes on Weibo.</p><br/><p>This stupid brother might have a low IQ but this simple support made Lou Wushuang feel particularly warm.</p><br/><p>He walked to the living room and found Zhang Shaohui looking through Weibo. Lou Wushuang sat next to him and reached out for a gently hug. He placed his face on Zhang Shaohui’s chest and whispered, “Thank you A’Hui.”</p><br/><p>Zhang Shaohui laughed. “Brother, we are more affectionate than true brothers. Thank you!”</p><br/><p>‘What brother? Your grandfather’s grandfather and my grandfather’s grandfather were brothers!</p><br/><p>Lou Wushuang scolded his fool in his heart but didn’t say it. He just quietly felt the distinct muscles as well as the regular heartbeat.</p><br/><p>His manly brother was always so reliable in key moments, causing Lou Wushuang to sink down.</p><br/><p>Lou Wushuang helplessly sighed deep in his heart before pushing up his glasses and saying, “If I am selected as a Carnival representative, I will ask the manager to let you come with me.”</p><br/><p>Zhang Shaohui’s eyes brightened. “Really? Great, if Brother goes and asks the manager then he will definitely listen to you!”</p><br/><p>There was a hint of softness in Lou Wushuang’s eyes as he watched Zhang Shaohui’s excited appearance.</p><br/><p>***</p><br/><p>At the same time, Pure Cleansing’s captain Zhu Qingyue also posted a message on Weibo.</p><br/><p>[Dear fans and black fans, if you still have tickets then please use all of them to vote for vice-captain Chu Yan. Thank you. If Chu Yan is selected then I will cry for you. [Cry][Cry][Cry][Cry]]</p><br/><p>Fans, “…”</p><br/><p>Black fans, “…”</p><br/><p>The crybaby youth acted unscrupulous in order to gain votes and blackened himself.</p><br/><p>The result was that Pure Cleansing’s vice-captain Chu Yan received a lot of sympathy votes from passersby. There were also many messages under Zhu Qingyue’s post. [Crybaby, you still haven’t weaned off your mother?]</p><br/><p>[Xiao Zhu, don’t cry, I’ll go vote.]</p><br/><p>[Xiao Zhu, don’t cry. I’ll give you a pack of paper towers. What brand do you want?]</p><br/><p>The witty Zhu Qingyue blackened himself to pull sympathy votes for Chu Yan.</p><br/><p>The little guy who cried after losing a game, who was abused and smeared in the last few years, becoming the most controversial player in the Miracle League. However, he was strong and could treat his own dark past as a joke, telling everyone that this young man had really grown up.</p><br/><p>Chu Yan felt very thankful as he looked at Xiao Zhu. “You blackened yourself without hesitation.”</p><br/><p>Zhu Qingyue made an embarrassed expression but his eyes were particularly firm. “The Pure Cleansing team should gain one spot. Master, you have to prove to Miracle fans around that world that our country’s supports are also very powerful.”</p><br/><p>Chu Yan smiled and agreed. “I will.”</p><br/><p>In fact, Xiao Zhu was the apprentice personally raised by Chu Yan. Many players in the league knew that Chu Yan was quite courageous for daring to put his crybaby apprentice who just debuted as the captain.</p><br/><p>Li Cangyu transferred with his team and Chu Yan abdicated to the position of vice-captain. These two decisions had been voted by many netizens as the ‘boldest decision.’</p><br/><p>Now when the Pure Cleansing team dealt with reporters, Xiao Zhu was able to face them and show his ability to withstand setbacks. Chu Yan was actually in charge of the training and tactical arrangements within the team. All fans of Pure Cleansing knew that Vice-Captain Chu was actually the team’s real commander and pillar.</p><br/><p>***</p><br/><p>Once the ace players started to canvass for votes, the Carnival’s voting poll changed.</p><br/><p>As one of the few female players in the Miracle League, Liu Xiang attracted many passersby votes and was ranked fourth.</p><br/><p>Cheng Wei relied on his popularity to be fifth but the fans of the Ghost Spirits and Pure Cleansing teams united and released the tickets. Lou Wushuang and Chu Yan were promoted to the top six and Cheng Wei was squeezed to seventh place.</p><br/><p>The Time team already had Tan Shitian. In order to compete with Captain Ling and Captain Su, the Time fans used most of their votes on Captain Tan. Now it was too late to pull up Cheng Wei as the remaining votes definitely weren’t as much as the Ghost Spirits and Pure Cleansing fans. Once the voting was about to end, Cheng Wei stared at the gradually stabilizing rankings and couldn’t help feeling sad.</p><br/><p>He wasn’t in the top six, he couldn’t go to New York to see Cat God…</p><br/><p>Cheng Wei lowered his head in a depressed manner. Should he buy a ticket to go to New York?</p><br/><p>Then Tan Shitian pushed open the door and entered. Once he saw the kitten’s sickly appearance, Tan Shitian walked to his side and asked in a worried manner, “What is it?”</p><br/><p>Cheng Wei whispered, “The result of the poll is confirmed. Zhu Qingyue and Zhang Shaohui gave up their votes and I didn’t make the top six…”</p><br/><p>This pathetic look was like a beloved fish being stolen from the kitten.</p><br/><p>Tan Shitian sat down next to him and rubbed his head. “Don’t be sad. The fans of Ghost Spirits and Pure Cleansing used their voting tickets. There are so many teams in the league, if two members of Time are selected then the fans of other teams won’t be convinced. I was asked by the manager to discuss some things and I made a request. If you weren’t selected, I want to take you to New York. The manager agreed.”</p><br/><p>The frustrated Cheng Wei was instantly full of blood and resurrected. He raised his head and cried out, “Really?:</p><br/><p>Tan Shitian smiled and nodded. “Of course, you are my family so you should accompany me.”</p><br/><p>Cheng Wei was dazzled by the fact that he could go to New York to see Cat God and didn’t react to Tan Shitian’s words.</p><br/><p>Family member accompanying him, since when was he Tan Shitian’s family?</p><br/><p>***</p><br/><p>The official website of the Miracle Professional League released the final result of the Carnival voting that evening.</p><br/><p>Ling Xuefeng, Su Guangmo, Tan Shitian, Liu Xiang, Lou Wushuang and Chu Yan.</p><br/><p>Some people weren’t satisfied with this lineup but more than 80% of the netizens found it acceptable.</p><br/><p>Ling, Su and Tang were the captains of three high-profile teams. It was natural they would be selected for the Carnival. Liu Xiang was the best healer in the league and her popularity was very stable. Lou Wushuang was the representative of the domestic assassin while Chu Yan was the best auxiliary. Such a lineup appearing in a group battle would definitely be a luxury configuration.</p><br/><p>Once the poll results came out, Ling Xuefeng sent a message on Q to Li Cangyu. [Cat, I was selected.]</p><br/><p>Li Cangyu gave a thumbs up and praised him. [Good. When are you coming to New York? Are you coming alone or with everyone?]</p><br/><p>[The league will be making a group booking and Chairman Nan will lead all of us. We should be in New York on the afternoon of the 30th.]</p><br/><p>[Are there any activities scheduled for the afternoon of the 30th?]</p><br/><p>[No, it will be a night off.]</p><br/><p>[Then tell everyone that I will invite them out to eat.]</p><br/><p>[Okay.]</p><br/><p>Ling Xuefeng immediately relayed Li Cangyu’s words to the Miracle Gossip Group.</p><br/><p>[@Flying Cotton @Grey Wolf @Shadow Killer @Chu Gongzi. Everyone who is going to the Carnival, Cat said that after we arrive in New York on the 30th, he will invite everyone to eat.]</p><br/><p>Many people in the group were blown up by these words.</p><br/><p>Cat? Who was Cat?</p><br/><p>Cheng Wei was stunned for a long time. Cat should by Cat God so he couldn’t help saying: [How can you call Cat God Cat? I called him Cat and he didn’t respond to me for half a day!]</p><br/><p>Su Guangmo followed up: [Captain Ling, you calling the sharp Cat God by just Cat is too disgusting.]</p><br/><p>[You don’t understand. Cat obviously sounds more amiable.] Tan Shitian followed up.</p><br/><p>[How can you talk to your predecessors like that every day?] Chu Yan also popped out.</p><br/><p>[Chu Chu, is your family’s Xiao Zhu crying? Do you need more paper towers?] Zhang Shaohui also joined in on the fun.</p><br/><p>Chu Yan immediately replied: [Hui Hui, don’t make trouble. Your brother is watching you.]</p><br/><p>Li Cangyu, “…”</p><br/><p>He was going to be broken by this group! Li Cangyu suddenly hesitated at inviting these gods to eat.</p><br/><p>Meanwhile, the culprit Ling Xuefeng was calmly thinking, ‘What’s wrong with me calling him Cat? All of you don’t know the relationship between us., I have been calling him this since I was 18 years old. It is my own exclusive nickname, okay?’</p><br/>\n</div>"}