{"title": "Chapter 82", "id": 82, "volume": 1, "url": "http://boxnovel.org/god-level-summoner-chapter-82", "volume_title": "Volume 1", "body": "<h1>Chapter 82</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 82 – 3v3 Group Stage (4)</p><hr/><br/><p>On the first day of the Carnival, each group would play four rounds. The Chinese team 1 was scheduled for two games—the second round against Australia and the fourth round against the US. There was a break period in the middle that Ling Xuefeng, Su Guangmo and Chu Yan used to once again confirm their strategy.</p><br/><p>The fourth round officially started at 8:30 in the evening. The matchup of two strong teams, the Us and China, who had the strength to win the championship, was naturally broadcasted live on the main stage. It became the focus of the audience and media of various countries.</p><br/><p>The media on the US side said, “Our US team 1 just accidentally lost to the South Korean team. This game must be won, otherwise it will be difficult to qualify for the quarter-finals! This team has Jack, Thomas and Edmund so our hope of killing the Chinese team is great!”</p><br/><p>There were only two qualifying places in each group. The US team was really unfavorable this year. First they fought South Korea for half an hour and was counterattacked at the last moment. The second match was against the strong enemy of the Chinese team. If they lost again… it was basically impossible for them to leave the group stage.</p><br/><p>South Korea’s side said, “The American team’s Jack Josh and the Chinese team’s Ling Xuefeng are the world’s first and second ranked summoner. Thomas is currently the number one elf bard and Su Guangmo is also a world-famous swordsman. The matchup between the two sides is almost at the level of the finals!”</p><br/><p>They ignored Chu Yan in their commentary. It was because the domestic psychic assisted play had only recently been developed by the Pure Cleansing team in the past two years. Chu Yan was a low-key person and he hadn’t appeared in the world rankings.</p><br/><p>“The US team also has Edmund, a very powerful blood kin assassin! Based on the lineup, the probability of the US team winning is greater.”</p><br/><p>“The US team unexpectedly lost to South Korea before. They will definitely fight back in this game. I also bet that the US team will win.”</p><br/><p>“There are three world-famous attackers on the US side while China has two attackers and one support. The US has a larger chance of winning.”</p><br/><p>Media outlets around the world speculated on the outcome of the game and most of them bet that the US team would win.</p><br/><p>In the commentary room on the Chinese side, Yu Bing’s expression was the same as usual. She glanced at the lineup and said calmly, “The first bard Thomas, the first blood kin summoner Jack Josh and the world-famous killer Edmund… the US team 1 truly has a super luxurious lineup.”</p><br/><p>“I just observed the score forecast on the American Miracle website. In this game, 98% of the audience predicted that the US team will win while only 2% think that China will win…” Kou Hongyi shook his head and said, “Isn’t this looking down too much on our three contestants?”</p><br/><p>“From the perspective of the lineup, it is true that the US team has a bigger chance of winning. The popularity of the three players are dominant in the world rankings. The competition is being held in New York so it can be said that the Us team is gathering the three elements of sky, land and people.”</p><br/><p>There was a pause and Yu Bing suddenly added, “However, I believe that in this game, the final winner will be the Chinese team.”</p><br/><p>Kou Hongyi asked doubtfully, “Sister Bing, are you that confident?”</p><br/><p>“Of course.” Yu Bing always looked indifferent but there was a hint of a rare smile on her face.</p><br/><p>She wasn’t confident in Ling Xuefeng. She was confident in the joint efforts of Li Cangyu and Ling Xuefeng.</p><br/><p>Before the game, Red Fox’s vice-captain Yang Muzi had sent her a gossip message. [Sister Bing, I saw Cat God coming to the hotel to meet Captain Ling at dinner time. Captain Ling took him to the Western restaurant to eat and deliberately avoided reporters… What is he doing here?]</p><br/><p>Unlike the quiet and gentle Red Fox captain, Liu Xiang, Yang Muzi’s personality was lively and active. Whenever she saw something curious, she would send a text message to ask Yu Bing about it.</p><br/><p>Yu Bing soon thought of one thing.</p><br/><p>In the first three seasons of Miracle, Ling Xuefeng and Li Cangyu were the captains of two teams and they played against each other in a combined total of six times. The two of them met at a young age and there seemed to be a strange understanding between them, despite their different tactical ideas. This also cause the two of them to avoid each other six times in the single-elimination battle. They never fought against each other in the arena.</p><br/><p>There were countless arguments about who was the best summoner between them in the Miracle forums. This gradually subsided when Li Cangyu led his team to leave.</p><br/><p>Now Li Cangyu appeared at the hotel during the World Carnival. Yu Bing believed there was only one possibility— Ling Xuefeng was looking for him as a strategist.</p><br/><p>They were definitely the strongest opponents on the field but once they joined hands, they could immediately make up for the flaws in each other.</p><br/><p>The combination of two imperfect people made a perfect circle.</p><br/><p>Ling Xuefeng was the best at the suppression style but for the same powerful explosive US team, the ‘violent suppression’ approach was absolutely impossible. Therefore, he found Li Cangyu to seek new ideas from Li Cangyu’s unpredictable tactics.</p><br/><p>According to Yang Muzi, Cat God and Captain Ling stayed in the restaurant for a long time. Li Cangyu ate very fast so it was impossible for them to be eating for so long. The two people had obviously been chatting in the restaurant.</p><br/><p>After defeating Australia, Ling Xuefeng calmly stepped down and immediately took his teammates to prepare for the next game, apparently to continue discussing tactics. Yu Bing was almost certain that Captain Ling had already received an idea from Cat God.</p><br/><p>The real commander of the game was actually Li Cangyu.</p><br/><p>He was the strategist hidden behind Ling Xuefeng.</p><br/><p>Therefore, Yu Bing was confident in the Chinese team winning.</p><br/><p>In her eyes, Ling Xuefeng and Li Cangyu were the leading great gods of the domestic Miracle League. If the two men couldn’t beat the US team after joining hands then the level of entire Chinese Miracle League would have to be reconsidered.</p><br/><p>***</p><br/><p>The game on the biggest main stage was being broadcasted live. The New York live host introduced the six players and their current world rankings.</p><br/><p>Jack Josh, the vice-captain of the US ICE team and the world’s strongest blood kin summoner.</p><br/><p>Ling Xuefeng, the captain of the Wind Colour team and the world’s strongest demon summoner.</p><br/><p>The appearance of these two people alone was enough to make the summoning fans around the world scream with excitement!</p><br/><p>In addition, the US team had the very popular elf archer Thomas and the calm killer Edmund. The temporary team was composed of three ace players, making the screams at the venue reach the peak, almost piercing the human eardrums.</p><br/><p>Many local fans raised fluorescent signs to support the US players. The popularity of the Chinese team at the away game was somewhat pitiful. There were only a few Chinese people screaming and their voices were drowned out by the crowd.</p><br/><p>Fortunately, the three Chinese team players were very calm and weren’t disturbed by the outside world. In particular, Ling Xuefeng maintained his handsome abstinent face as he tapped at the keyboard.</p><br/><p>Li Cangyu saw this familiar action and couldn’t help smiling. He would quickly tap the keyboard before every game. It was to check if there were any faults in the keyboard while also letting his fingers adapt to the fast attack rhythm.</p><br/><p>His fingers were long, powerful and steady, proving he wasn’t nervous at all.</p><br/><p>Ling Xuefeng seemed to sense Li Cangyu’s gaze and suddenly looked below the stage. The VIP seats were very close to the players’ soundproof room. The glare of the lights would blur people’s eyes when looking down but Ling Xuefeng immediately locked onto Li Cangyu’s position in the crowd. He nodded at Li Cangyu and gave a ‘rest assured’ look.</p><br/><p>Li Cangyu smiled and nodded back at him.</p><br/><p>Ling Xuefeng soon turned around and continued preparing for the game, his face blank. The meeting of the two people across the stage was fleeting. No one noticed this simple eye exchange where a mental message was exchanged.</p><br/><p>***</p><br/><p>The game would soon begin. Both players logged into the match room and a two minute cooldown started.</p><br/><p>All data was reset and in this two minute preparation period, the players had to re-add their stat points and choose their equipment. The players on both sides were fast. Once the confirmation button was pressed, the guide transferred the final data of each contestant to the big screen.</p><br/><p>Yu Bing found that Su Guangmo’s equipment had changed and immediately said, “Su Guangmo changed his weapon to the Sword of Judgment.”</p><br/><p>Kou Hongyi pulled out a separate screenshot of the weapon and explained, “The Sword of Judgment is highly aggressive and comes with the ‘Additional 200% enhancement of Light and Shadow Rotation’ effect. The disadvantage is that it is quite heavy. Using this weapon will sacrifice some agility. Su Guangmo is very good at moving quickly. Now that he is using the Sword of Judgment, it will be difficult to take advantage of running quickly. What does this mean?”</p><br/><p>The advantage of a swordsman lay in their agile positioning and rapid attacks. Su Guangmo chose such a heavy weapon. His attack might be enhanced but his movements would become heavy. In a high pressure game, this amounted to death.</p><br/><p>“Captain Ling also changed his weapon.” Ling Xuefeng’s final data appeared on the screen, causing Yu Bing to frown slightly. “Demon Curse, this is the most aggressive weapon of a demon summoner. All pet magic attacks will be greatly enhanced but at the expense of reducing the master’s defense.”</p><br/><p>The two weapons caused a number of spectators to be fearful.</p><br/><p>Su Guangmo abandoned the advantage of his fast positioning by carrying a heavy sword while Ling Xuefeng increased his attack but reduced his defense. A summoner’s defense was already very weak. Wasn’t Ling Xuefeng afraid of being killed by the other side?</p><br/><p>Surprisingly, Chu Yan was wearing a defensive outside and chose the psychic weapon ‘Phantom Staff’ which sped up the release of arrays. On the other hand, it also decreased the duration of the arrays.</p><br/><p>Yu Bing immediately determined in her heart that the tactical maker of this game must be Li Cangyu.</p><br/><p>Cat God’s commanding style was very unpredictable, the witty cat always making people guess his actions.</p><br/><p>Even if her tactical ideas were very high, Yu Bing couldn’t guess what types of tricks these three people were playing. After a moment of silence, she gave up on guessing the tactic developed by the witty Cat God and simply said, “They must’ve chose these weapons due to a special tactical plan for the US team. The game will start soon so let us wait and see.”</p><br/>\n</div>"}