{"title": "Chapter 84", "id": 84, "volume": 1, "url": "http://boxnovel.org/god-level-summoner-chapter-84", "volume_title": "Volume 1", "body": "<h1>Chapter 84</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 84 – China VS USA (2)</p><hr/><br/><p>Edmund and Thomas were frozen in place, receiving Su Guangmo’s Light and Shadow Rotation. The moment that Frost Array was ended, Chu Yan released Illusion Maze.</p><br/><p>The psychic’s arrays instantly abolished the fighting power of the two opponents.</p><br/><p>This was a psychic. They might seem fragile with no attack power but once they were uncontrolled, they could control the entire field and force the opponent’s into a dilemma!</p><br/><p>It was the reason why Jack Josh wanted to start off with killing the psychic. Unfortunately, they repeatedly encountered many incidents in the process. He thought the killer could take care of the psychic and didn’t expect the opposite side’s swordsman to move in a big circle to help from behind. The 1v1 battles was forcibly converted into 2v2.</p><br/><p>Su Guangmo didn’t have much blood left and a psychic’s arrays were limited. The opponents couldn’t be controlled all the time. Once the two people were released from the control, Chu Yan certainly wouldn’t live for a long time. Therefore, Su Guangmo used all his explosive moves. The Sword of Judgment might be heavy but when he wielded it, he was domineering and extraordinary, directly beating up the fragile archer and assassin!</p><br/><p>After the release of the arrays, Chu Yan quickly hid behind a stone statue and ran away.</p><br/><p>The audience found that the psychic’s ability to escape was really strong!</p><br/><p>In the blink of an eye, he walked around several stone statues and came to to the opposite side of the fountain.</p><br/><p>The archer and assassin had been beaten to residual blood by Su Guangmo. Similarly, Su and Chu Yan also had residual blood, especially Chu Yan. He had been beaten by the assassin and only had 5% blood left. One last move might cause him to die.</p><br/><p>The Frost Array control effect finally ended and the two opponents wanted to chase after the psychic who only had a bit of blood left. They didn’t expect that Su Guangmo would suddenly make a fatal mistake with his positioning!</p><br/><p>For professional players… this mistake really wasn’t common.</p><br/><p>“How can he turn his back to the assassin.” Yu Bing stared nervously at the screen. Su Guangmo had just decreased the opponents’ blood with Light and Shadow Rotation and was between the assassin and archer. At that time, he could stand with the archer and away from the assassin. However, Su Guangmo’s mistake meant his position was more towards the assassin’s side and… it was actually his back!</p><br/><p>Everyone who player an assassin knew what a good chance it was when the target turned their backs to the assassin!</p><br/><p>All of an assassin’s attacks automatically received extra damage when it came from behind the target. This was equivalent to Su Guangmo giving his back to the assassin and Edmund was a world-class killer. It was impossible for him to not grasp such a good opportunity.</p><br/><p>Kou Hongyi sighed deep in his heart.</p><br/><p>Sure enough, Edmund’s actions were very decisive. The sharp blade in his hand stabbed as he used Backstab, Soul Kill and Fatal Blow!</p><br/><p>—First Blood!</p><br/><p>A blood announcement finally popped out. The two sides had fought for 10 minutes and one person finally died.</p><br/><p>Su Guangmo with 20% blood was killed.</p><br/><p>Many domestic audiences scolded Su Guangmo in the live broadcast comments, especially Su Guangmo’s sunspots.</p><br/><p>[He can’t even position himself properly. Giving his back to the assassin is too much!] [I have long thought that he wasn’t skilled. Who chose him to go to the Carnival and humiliate himself?]</p><br/><p>However, many Su Guangmo fans argued quietly: [Captain Su wouldn’t make such a low level mistake… he might’ve unexpectedly missed.] [Is there anyone who hasn’t made mistakes? Perhaps he is in a bad state today?] [There is no need to scold him over this…]</p><br/><p>On the other hand, Yu Bing was quick to notice a key point.</p><br/><p>Due to Su Guangmo’s mistake, Edmund and Thomas decisively took the opportunity to kill him. This made Chu Yan successfully break away from their attack range and he headed to Ling Xuefeng and Jack Josh’s area.</p><br/><p>The difference between Jack Josh and Ling Xuefeng wasn’t big. It was a match between masters and one distraction would allow them to be easily killed. Therefore, both of them were very focused. The audience could see that Jack Josh and Ling Xuefeng had both reached the dangerous threshold of 30% blood. Whoever made a mistake was likely to be killed by the other person.</p><br/><p>Edmund realized something was wrong and immediately said on the voice channel, “Jack, be careful!”</p><br/><p>However, it was a language prompt and couldn’t increase the speed at which professional players used skills. Not to mention, Chu Yan chose a weapon that reduce the casting time of his skills. By the time Edmund spoke, he had finished using a skill. Psychic Curse!</p><br/><p>This was a psychic’s only single target control skill that made the designated target fall into the silenced state for five seconds, not allowing them to use any skills. After changing weapons today, the silence time would be reduced to four seconds but the casting speed was obviously faster.</p><br/><p>Four seconds was enough for Ling Xuefeng to kill a weakened opponent!</p><br/><p>In the 1v1 match, Ling Xuefeng had deliberately saved a big move. Once he saw Chu Yan behind Jack Josh, Ling Xuefeng immediately started casting a big move.</p><br/><p>Demon’s Wrath!</p><br/><p>The most terrible attack pet of the demon summoner was the demon god. Once the demon god was summoned, there was a black mist around it. The black mist spread out and the demon god without a body was like floating black smoke. It wrapped around the opponent, from the soles of the feet to the top of the head. After three seconds, the black smoke dissipated, causing terrible black magic damage!</p><br/><p>—Second Blood!</p><br/><p>The opposite side’s blood kin summoner was killed by the demon god in an instant!</p><br/><p>At this time, Ling Xuefeng still had 30% of his blood while the assassin Edmund and archer Thomas only had 20% of their blood.</p><br/><p>Ling Xuefeng decisively turned around and summoned his black crows to block their vision!</p><br/><p>Immediately afterwards, he summoned the banshee to pull the assassin towards him. Then he surrounded the assassin with skeleton infantry and continuously used Skeleton Explosion, killing the assassin as well!</p><br/><p>The situation instantly reversed, the original 2v3 becoming 2v1.</p><br/><p>Thomas was the only one alive on the US team and his archer attacked from a long distance. He wanted to take advantage of this to kite Ling Xuefeng. However, the crows blocked his vision. Once he circled around and tried to shoot at Ling Xuefeng, he found waiting for him… Psychic Barrier.</p><br/><p>That’s right. Chu Yan’s Psychic Barrier had been cooling down for a long time and it could finally be used, bouncing back all the damage!</p><br/><p>Thomas was speechless. Thanks to Psychic Barrier, he couldn’t beat the other person,. He had to turn around and control the distance while waiting for Psychic Barrier to end so he could hit Ling Xuefeng. Unfortunately, Ling Xuefeng wouldn’t give him such an opportunity.</p><br/><p>Chu Yan only had 5% blood and he also had little blue left. He couldn’t use any more arrays. In addition, Ling Xuefeng’s blue was only enough to use one skill. He had to kill Thomas with one blow or there would be endless troubles.</p><br/><p>The archer was so far away and an ordinary attack wasn’t enough. What would Captain Ling do? The audience who got up early in the morning to watch the game were anxious.</p><br/><p>Then a scene occurred that was unexpected for everyone.</p><br/><p>Ling Xuefeng summoned: the undead!</p><br/><p>This pet was a common pet that all summoners had. It was rarely seen on the field because it had an adverse effect.</p><br/><p>The undead summoning consumed the least blue but no summoner would call the undead to kill people.</p><br/><p>The undead only had one effect. Once the opponent’s blood volume was less than 20%, it allowed the opponent to die with the summoner.</p><br/><p>Yes, it was a ‘die together’ skill!</p><br/><p>Ling Xuefeng’s blue was only enough to summon the undead so he decisively called it to take Thomas away. This man, he was so domineering even when dying!</p><br/><p>All three people of the American team were destroyed and the Chinese team’s Chu Yan survived!</p><br/><p>The golden ‘Winner!’ appeared on the screens of the Chinese team. However, the audience couldn’t recover for a long time. The domestic audience was stunned while even Yu Bing and Kou Hongyi were silent for a moment.</p><br/><p>***</p><br/><p>On the playing field, Su Guangmo died first because of an error. Jack Josh was controlled by Chu Yan, allowing Ling Xuefeng to kill him. Then Edmund was killed by Ling Xuefeng, leaving the residual blood Thomas behind. Ling Xuefeng politely pulled him to die together.</p><br/><p>Finally, the Chinese team only had the 5% blood Chu Yan left.</p><br/><p>Chu Yan had been the target of the American team from the beginning but in the end… Su Guangmo and Ling Xuefeng both died while Chu Yan was alive!</p><br/><p>The people who scolded Su Guangmo finally noticed that something was wrong.</p><br/><p>[In other words, Captain Su made a mistake. In retrospect, Chu Yan only had 5% blood left at the time. If Su Guangmo hadn’t made the mistake, Thomas would’ve left and Chu Yan wouldn’t died in a few seconds!]</p><br/><p>[Yes, if Chu Yan died, Captain Su and Captain Ling wouldn’t be able to win the 2v3. In the case of Captain Ling and Jack Josh’s one on one, Captain Su’s role obviously isn’t as strong as Chu Yan’s support arrays.]</p><br/><p>[Then he deliberately made a mistake and swapped his death for Chu Yan’s survival?]</p><br/><p>[If so… Su Guangmo truly is a movie emperor!]</p><br/><p>***</p><br/><p>Yu Bing arranged her thoughts and finally calmed down.</p><br/><p>Li Cangyu’s tactical arrangements were really strong. The game was finished but she had to think about it for a long time!</p><br/><p>This was true for the outsiders on the sidelines then what about the American players in the same playing field?</p><br/><p>Su Guangmo truly was a movie emperor. When looking back at the video replay, it was discovered that his so-called ‘positioning mistake’ might’ve given the assassin a chance to kill him, but it also blocked the archer from chasing Chu Yan.</p><br/><p>At that time, he still had a decent amount of blood but his blue was running low. He had finished unleashing all his explosive skills and was ready to die.</p><br/><p>With his death, he gave Chu Yan the chance to fight for a few more seconds.</p><br/><p>Chu Yan naturally didn’t let him down. Captain Chu’s escape ability was first-class and he quickly succeeded in escaping the archer’s pursuit range. Then he went around behind Jack Josh and used a control skill to help Ling Xuefeng kill Jack.</p><br/><p>In the next 2v2 situation, Chu Yan was still on the verge of death so Ling Xuefeng didn’t hesitate to consume a large amount of blue to summon the crows and block the opponents’ vision. He let Chu Yan move into the distance and exploded his skills on the blood kin assassin.</p><br/><p>Then… he summoned the undead and decisively took Thomas to die together.</p><br/><p>It was like Li Cangyu said before the game. “The key to this game is the auxiliary. Once Chu Yan dies, we will collapse. Therefore, we must protect Chu Yan.”</p><br/><p>This tactical idea was made by Li Cangyu. There was a concrete plan established after a careful discussion at the restaurant. However, the scenes at the stadium were always changing and not everything would turn out as expected. Jack Josh dispersed people into a 1v1 situation to kill the auxiliary as soon as possible. In fact, Li Cangyu didn’t have much hope at this time. Fortunately, Su Guangmo responded quickly by dragging the opposite archer over to support Chu Yan.</p><br/><p>A professional player’s responsiveness wasn’t bad. As long as a big direction was set, they could be flexible on the field and finally managed to win the match.</p><br/><p>However, the process of winning this match was really thrilling. Chu Yan was the only one alive and he had 5% of his blood left. He seemed like he would die at any moment but he survived until the end and won this difficult two points for the Chinese team!</p><br/><p>***</p><br/><p>The match lasted for nearly half an hour and there were many highlights in the process. The players on both sides were very capable and adapted to the situation, playing well. After organizing their thoughts, the commentators started to patiently explain to the audience.</p><br/><p>The more the audience heard, the more shocked they were. Such strange tactical ideas truly wasn’t Captain Ling’s style.</p><br/><p>Yu Bing finished analyzing the game and then gave a rare smile. “Maybe everyone is confused since this tactical arrangement isn’t like the style of Captain Ling, Captain Su or Captain Chu Yan. My guess is that there is a behind the scenes strategist on the Chinese side. However, I didn’t get their permission so I won’t disclose their identity.”</p><br/><p>The audience became curious by Yu Bing’s words and started to speculate about the behind the scenes strategist.</p><br/><p>Was it Tan Shitian? Captain Lou Wushuang? It didn’t seem like them either.</p><br/><p>Many people couldn’t guess and there were viewers who felt that Yu Bing was deliberately acting like she knew an inside story.</p><br/><p>***</p><br/><p>On-site, the referee confirmed the score and Ling Xuefeng’s hands finally left the keyboard. He moved with Su Guangmo and Chu Yan to shake hands with the US team.</p><br/><p>Thomas stared bitterly at Ling Xuefeng. Apparently he was very depressed about being forced to ‘die together’ at the end.</p><br/><p>Jack Josh also had an unconvinced expression on his face. He shook Ling Xuefeng’s hand and declared proudly, “I won’t lose to you if we fight again next year.”</p><br/><p>Ling Xuefeng nodded calmly but in his heart, he was thinking, ‘Next year don’t expect too much either. Once my Cat God comes back, you will cry even more.’</p><br/><p>Ling Xuefeng returned to the soundproof room where the rest of the Chinese team was located and once again looked at the VIP seats under the stage. His eyes were once again on Li Cangyu’s position and there was a connection.</p><br/><p>Ling Xuefeng’s lips curved slightly and his eyes softened. He nodded slight at Li Cangyu, as if to say, ‘I successfully completed your tactical arrangement and we won.’</p><br/><p>It was the real ‘we’. Li Cangyu might not have played but his tactical arrangement was put into action by Ling Xuefeng. He took the idea and they won the game together.</p><br/><p>Li Cangyu smiled and gave Ling Xuefeng a thumbs up.</p><br/><p>Xiao Han saw his master’s thumbs up and was stunned. He followed his master’s gaze and found that Ling Xuefeng was looking over here.</p><br/><p>It was strange that across the stage, their eyes were completely locked on the other person, not allowing any outsiders to intruder…</p><br/><p>Xiao Han scratched his head in confusion, thinking, ‘Isn’t Master’s relationship with Ling Xuefeng really good?’</p><br/>\n</div>"}