{"title": "Chapter 87", "id": 87, "volume": 1, "url": "http://boxnovel.org/god-level-summoner-chapter-87", "volume_title": "Volume 1", "body": "<h1>Chapter 87</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 87 – Carnival Finale</p><hr/><br/><p>On the first day of the World Carnival’s 3v3 event, the Chinese team consisting of Ling Xuefeng, Su Guangmo and Chu Yan defeated Australia and the US in Group C, directly scoring four points. On the side of Group D, the Chinese team of Tan Shitian, Lou Wushuang and Liu Xiang only had one game and successfully defeated the Swedish team to score two points.</p><br/><p>The next day’s 3v3 event still had too many teams and the schedule was quite tight. In particular, the Chinese team 2 played three games in the afternoon. Fortunately, the strength of the other teams in Group D weren’t high. Tan, Lou and Liu cooperated and won three consecutive games. They received first place and achieved the qualifying place to advance in Group D.</p><br/><p>Relatively speaking, Group C was a lot harder.</p><br/><p>After defeating the strong enemy of the United States, the Ling Xuefeng trio met this Carnival’s powerhouse, the South Korean team.</p><br/><p>South Korea had always been a powerhouse in e-sports and placed great importance on e-sports. They were many luxurious clubs and countless excellent players. The South Korean team often won championships in games such as Warcraft and League of Legends. China and South Korea were old opponents in the field of e-sports. They played many times in other games and had won and lost.</p><br/><p>The 3v3 event at the Carnival was directly by Ling Xuefeng himself. The two sides fought fiercely and dragged the battle to 30 minutes. However, there were many tactical gods in South Korea. After studying the match between the Chinese team and the US team last night, they specifically developed an assassination tactic for Chu Yan. At the beginning, they dragged Ling Xuefeng and Su Guangmo away and quickly killed Chu Yan.</p><br/><p>Chu Yan died and the Chinese team immediately fell into a disadvantage.</p><br/><p>Ling and Su supported each other to kill two people on the opposite side but in the end, the South Korean team’s assassin used stealth to escape at a critical moment and successfully killed Ling Xuefeng. The Chinese team regretfully had to admit defeat.</p><br/><p>The domestic evaluation of this game was mixed. Sensible viewers thought that Ling Xuefeng and Su Guangmo performed very well. It wasn’t easy to kill two enemies in a 2v3 situation. It was good that regardless of winning or losing, they did their best. There were also radical netizens who said about things about the three players on the Internet.</p><br/><p>[I already knew that they couldn’t beat the Korean team.]</p><br/><p>[The Chinese team is really humiliating. Do you have to lost to South Korea every time?]</p><br/><p>[The great gods are like this.]</p><br/><p>Of course, these people were pushed back by the fans of the trio.</p><br/><p>Cheng Wei couldn’t help sending a Weibo: [Every time you lost the game, you always talk about how humiliating it is and how they aren’t great gods. I won’t ask for the reason behind it. I just want to say: You can you up，No can no BB! This is the English sentence I am most familiar with! [Laugh]] (Link if you want an explanation for that saying: )</p><br/><p>Fans, “…”</p><br/><p>Cheng Wei was always straightforward and hot tempered. If something happened in the league, he would be the first one to jump forward. He didn’t care about his identity as a great god and didn’t think before he spoke. People just needed to follow his Weibo to know what was happening in the Miracle League recently. His reaction was almost faster than official reporters.</p><br/><p>Tan Shitian saw this post and gave a smiling emoji followed by this line: [Touch your head and ignore them.]</p><br/><p>Every time Cheng Wei became angry, he would be comforted by Captain Tan touching his head. The abuse of some fans were hard to hear but everyone had long become used to it. In particular, the great gods of various teams already practiced the ‘automatic filtering’ and ‘disregard all negative remarks’ methods.</p><br/><p>Since they were professional players, they must have a strong psychological endurance. These words weren’t enough to affect them.</p><br/><p>Ling Xuefeng’s expression was very calm. When the South Korean players came to their room to shake hands, Ling Xuefeng only said, “See you next year.”</p><br/><p>It was just like Jack Josh’s words to him.</p><br/><p>There were many reasons for losing this game. After playing the US team yesterday, the South Korean team specifically studied the defects of the Ling, Su and Chu lineup. Winning was really hard for the Chinese team when the auxiliary was targeted. Su Guangmo had acted great yesterday as the movie emperor against the US team. The South Korean team naturally couldn’t fall for the same mistake.</p><br/><p>It was comforting that the China team 1 still entered the top eight by winning second place in their group.</p><br/><p>During the post-match interview, Reporter Yao Rong took the initiative to ask, “Captain Ling, what do you think is the key reason for losing this game?”</p><br/><p>Ling Xuefeng explained, “It should be a lineup problem. 3v3 isn’t as good as 6v6. The South Korean team consists of three melee, which isn’t very good when Chu Yan and I are remotes.”</p><br/><p>Yao Rong was their official reporter and wouldn’t ask too many harsh questions. She actively helped the players by saying, “I believe that the sensible audience members will understand that the three great gods tried their best in this game! Congratulations to both Chinese teams for entering the quarter-finals. The system for the quarter-finals will change. Captain Ling, do you feel confident?”</p><br/><p>Ling Xuefeng’s eyes were firm. “Of course.”</p><br/><p>This sentence was full of confidence and brought great hope to the domestic audience.</p><br/><p>***</p><br/><p>After the game, Ling Xuefeng returned to the backstage lounge and sent a text message to Li Cangyu: [I made it into the top 8.]</p><br/><p>Li Cangyu smiled and replied: [Congratulations.]</p><br/><p>The Carnival only had three days left. Today would be the quarter-finals while the highlights of tomorrow were the semi-finals and finals.</p><br/><p>After determining the qualifying quotas, the six Carnival players prepared for the quarter-finals. Eight teams from the upper and lower division drew lots again. Ling Xuefeng drew the French team while Tan Shitian drew the British team.</p><br/><p>The quarter-finals had changed to a three game two victory battle. The two sides would each choose a map. If it was a draw after two battles, they would play a third round as a tiebreaker.</p><br/><p>The players on the Chinese team had a very thorough understanding of the game maps. Both teams won the home maps without any surprises. In the away map, Ling Xuefeng won and advanced directly with a 2:0 score. Tan Shitian’s team lost the away map but won in the third round with a random map, advancing with a score of 2:1.</p><br/><p>Both Chinese teams had made it to the semi-finals. The remaining two teams were South Korea team 1 and Group B’s US team 2.</p><br/><p>In the semifinals, Tan Shitian’s team met South Korea team 1. This team’s captain was the strongest tactical player in South Korea. He controlled Liu Xiang in the opening and rushed to the back row to kill the archer Tan Shitian. It was really strong.</p><br/><p>Tan Shitian’s team lost in the semi-finals, meaning the situation of both teams meeting in the finals that Nan Jiangang had hoped for was unlikely to happen.</p><br/><p>In fact, this year’s Carnival had many masters. The Chinese team was strong but the possibility of dominating the World Carnival was very small.</p><br/><p>The chairman was just wishing. In a situation where there were as many strong teams as clouds, it was already a good result for both teams to enter the semi-finals. There wasn’t much controversy at home in China.</p><br/><p>In the other game, Ling Xuefeng met the US team 2 from Group B. The style of this team was completely different from Jack Josh’s team and it took half an hour to win.</p><br/><p>As a result, the Ling Xuefeng trio once again met the South Korean time in the finals. This time, the Korean lineup wasn’t the same as the team they encountered in the group stage.</p><br/><p>Would China lose to South Korea twice in a row? Many domestic viewers were worried about this. In the previous LOL and other competitions, the Chinese team often lost to South Korea. Thus, many domestic viewers had a psychological shadow regarding China-South Korea confrontations.</p><br/><p>However, Ling Xuefeng told everyone that he wouldn’t make the same mistake!</p><br/><p>The Korean team had studied the defects in the Chinese team’s lineup. In the opening, they quickly tried to kill Chu Yan. This time, Ling Xuefeng used this lineup defect and had Chu Yan play the role of ‘bait.’</p><br/><p>Chu Yan was the trap and he used his own death as an opportunity for his teammates. Under Su Guangmo’s strong control of the field, Ling Xuefeng let out a burst of hand speed and killed two people. The remaining assassin wanted to enter stealth but was hit by Ling Xuefeng’s black crows and finally fell helplessly under Su Guangmo’s sword.</p><br/><p>The word ‘Winner’ popped up on the screen and Ling Xuefeng, Su Guangmo and Chu Yan stood up to celebrate.</p><br/><p>The final result of the Carnival 3v3 event was: Ling Xuefeng’s team won the championship, the South Korean team was the runner-up and Tan Shitian’s team was the third runner-up.</p><br/><p>The Chinese team took two prizes, this was a perfect ending.</p><br/><p>Still, in order to fully focus on the 3v3 event, no Chinese players signed up for the 1v1 event and the winner was the American blood kin summoner Jack Josh.</p><br/><p>Once the match ended, Ling Xuefeng headed backstage and sent Li Cangyu a text message: [We won the championship.]</p><br/><p>It was originally an encouragement to give praise. The strange thing was that Li Cangyu never responded. Ling Xuefeng thought it was too noisy at the venue and he didn’t hear it. Therefore, Ling Xuefeng temporarily put away his phone.</p><br/><p>***</p><br/><p>The closing ceremony and awards ceremony was held at 8 in the evening. The two teams from China went on stage to receive the prize. Ling Xuefeng, Su Guangmo and Chu Yan raised the gold medals together while Tan Shitian, Lou Wushuang and Liu Xiang won the bronze medals.</p><br/><p>The gold medal was very memorable but Ling Xuefeng knew that the Carnival 3v3 event didn’t represent the strength of the Chinese team. The 3v3 event was a direct fighting between the two sides. It wasn’t as complicated and changeable as a team battle, where the team’s cooperation and tactical arrangement were tested.</p><br/><p>The real championship trophy would be the World Competition.</p><br/><p>Ling Xuefeng raised the trophy and calmly looked at the seats under the stage.</p><br/><p>The lights at the venue today were too strong and dazzling. He couldn’t see Li Cangyu but he believed that next year, he would stand on this stage for the awards ceremony and Li Cangyu would be beside him.</p><br/><p>***</p><br/><p>The awards ceremony ended and Chairman Nan Jiangang took the initiative to invite everyone to a celebration banquet at the hotel.</p><br/><p>The six participants of the Carnival and their teammates filled a large private room in the hotel and Chairman Nan Jiangang personally treated them.</p><br/><p>The 3v3 event was just a temporary team so the organizers were thoughtful enough to give every person a special commemorative trophy.</p><br/><p>Cheng Wei took the third place trophy that Tan Shitian received and carefully studied it. Then he bit it with his teeth and asked, “Is it made of copper?’</p><br/><p>Tan Shitian smiled and rubbed his head. “Captain Ling’s one is gold-plated. Do you want to bite it?”</p><br/><p>Cheng Wei raised his head and saw Ling Xuefeng’s cold eyes. He shrank back and said, “I don’t want to.”</p><br/><p>Zhang Shaohui took his brother’s trophy and said, “Brother, I’ll take care of this for you. You often lose things but don’t lose this.”</p><br/><p>Lou Wushuang’s lips curved in a rare smile and he whispered, “Okay, help me keep it.”</p><br/><p>Yu Pingsheng didn’t like to talk and still followed behind his brother like a ghost. His eyes were curiously staring at the trophy in Su Guangmo’s hand so Su Guangmo handed it over, causing him to hold it carefully.</p><br/><p>Nan Jiangang looked at the scene and couldn’t help smiling. “When we divided into two teams, we always declared that we wanted to meet in the finals. However, the players from other countries aren’t rookies. My real idea at the time was to just get a trophy, I didn’t expect that you could actually win two trophies. It is really gratifying! Let’s make a toast!”</p><br/><p>The chairman took the initiative to toast and raised a glass of red wine with everyone.</p><br/><p>The group happily drank the wine.</p><br/><p>Nan Jiangang turned his head and said, “Don’t be too proud that you won the grand prize this year. The Carnival is just a project for the World Miracle League to test the waters. The main purpose is to let the players get to know each other. Next year’s seven season is when people would go all out. As you know, the e-sports competitors in other countries are making rapid progress. If we are complacent, we will eventually be eliminated by others.”</p><br/><p>The chairman’s words made everyone’s joy at winning the trophy calm down.</p><br/><p>After this Carnival, everyone was well aware that the players in other countries weren’t any worse than them. For example, the combination of Jack, Thomas and Edmund. If Su Guangmo’s acting hadn’t been so realistic, wouldn’t they have won the game? It was hard to say. South Korea’s best killer was also very strong. Lou Wushuang saw his assassination technique and felt admiration.</p><br/><p>Recognize the opponent in order to see their own shortcomings.</p><br/><p>Everyone knew this truth but the chairman woke them up in time.</p><br/><p>“Once you return, you will face the playoffs of the sixth season. The temporary teammates at the Carnival will become opponents on the field. I hope that everyone can concentrate on the game and bring the sixth season to a perfect end. Then we will go into the seventh season.” Chairman Nan Jiangang said earnestly.</p><br/><p>Lou Wushuang heard this and couldn’t help asking, “Chairman, is the system in the seventh season going to change?”</p><br/><p>Captain Lou had a high IQ and immediately analyzed this from the chairman’s words.</p><br/><p>Chairman Nan smiled slightly at him. “Yes, the next system is completely different from the old one. Once the sixth season is over, I will call you to discuss this matter in detail. After you go back, be prepared. The playoffs of the system is the last trophy using this old system. Everyone must try hard to grasp it!”</p><br/><p>The group was stirred by the chairman’s words. The last trophy of the old system. This meant winning the championship had great significance!</p><br/><p>These temporary teammates would be opponents after returning home. They should carefully consider how to kill them.</p><br/><p>The atmosphere of this celebration banquet was very happy. Everyone ate and chatted about the Carnival. Only Ling Xuefeng never said anything, his face very serious. But Captain Ling usually had such a face and they were long used to it. They didn’t notice anything wrong.</p><br/><p>In fact, Ling Xuefeng’s face was blank because he was in a bad mood. He still hadn’t received a reply to the text message he sent Li Cangyu.</p><br/>\n</div>"}