{"title": "Chapter 96", "id": 96, "volume": 1, "url": "http://boxnovel.org/god-level-summoner-chapter-96", "volume_title": "Volume 1", "body": "<h1>Chapter 96</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 96 – Sixth Season (2)</p><hr/><br/><p>The sixth season ended and the Wind Colour team won the championship, the Flying Feathers team was second and Ghost Spirits was third.</p><br/><p>In the evening, the awards ceremony was held at the largest Miracle stadium in Shanghai.</p><br/><p>The venue of the awards ceremony was star-studded, the lights were bright, the audience seats were full and applause rang out.</p><br/><p>Yu Bing and Kou Hongyi were respectively dressed in an evening gown and suit to host the awards ceremony. The first individual award to be given was for the sixth season’s newcomers.</p><br/><p>Many viewers were very concerned about who would win the sixth season’s newcomer awards. It was because the newcomer award represented a rising star in the future.</p><br/><p>The selection for the newcomer awards was scored by the senior judges on the comprehensive data of the players who debuted this season.</p><br/><p>Yu Bing received an envelope and opened it. “The winner of the sixth season’s Best Newcomer Award goes to… Wind Colour’s Qin Mo!”</p><br/><p>Qin Mo couldn’t believe it when he heard his name. He looked around blankly and Ling Xuefeng patted his shoulder. “Go and receive your award.”</p><br/><p>Qin Mo finally recovered and ran excitedly to the stage, receiving the trophy from the host.</p><br/><p>“Xiao Qin, do you have anything to say about getting this award?” Kou Hongyi asked with a smile.</p><br/><p>Qin Mo held the trophy tightly. His voice was slightly shaking from excitement as he said, “I-I had no idea I was going to get this award!”</p><br/><p>Yu Bing urged him, “Please give an acceptance speech.”</p><br/><p>Qin Mo took a deep breath to calm down his emotions. Then he said, “I have made several mistakes in the regular season of the sixth season. I haven’t played in a long time and finally adjusted my mentality during the playoffs, allowing me to play at my true level. I want to thank Master for giving me the opportunity to come here and for his tolerance, as well as my teammates for their encouragement.”</p><br/><p>He was obviously too excited as there was some incoherence in his speech.</p><br/><p>Yu Bing saw that the young boy was so thrilled that his cheeks were red. She smiled at him and said, “The judges gave you this award because you could quickly wake up after being frustrated and perform better than before. This is the most valuable quality in a professional player.”</p><br/><p>Qin Mo nodded. “I will work harder in the future in order to not disappoint my master and teammates. Thank you!”</p><br/><p>He bowed deeply in the direction of the Wind Colour team. Under the stage, Ling Xuefeng’s lips slightly raised. In fact, Qin Mo’s growth could be credited to Cat God.</p><br/><p>Ling Xuefeng thought this and sent a text message to Li Cangyu. [Thank you for helping me with my apprentice.]</p><br/><p>Li Cangyu immediately replied: [Why are you being so polite? Have him accompany my Xiao Han to practice.]</p><br/><p>Ling Xuefeng didn’t hesitate to sell his apprentice. [No problem.]</p><br/><p>***</p><br/><p>There were two newcomer awards per season. The Best Newcomer Award was done and now it was the Most Promising Rookie Award.</p><br/><p>The difference between the awards was that the former was for an outstanding newcomer this season. The latter was for newcomers who didn’t do well this season but their talent was high and their room for improvement was significant. It was a recognition of the player’s potential by the judges.</p><br/><p>“The Most Promising Rookie Award goes to… the Cheetah team’s Chen Anran!”</p><br/><p>This name shocked many people. Li Cangyu was also a bit surprised and texted Ling Xuefeng: [Who is Chen Anran?]</p><br/><p>Ling Xuefeng was very impressed with this teenager. The rookie who just debuted this year was only 16 years old and he always followed his captain. HIs personality was a bit introverted and he barely spoke.</p><br/><p>[He is a new player on the Cheetah team. He plays a terran hunter.] Ling Xuefeng quickly replied. [He didn’t show any bright plays but his talent is very high. His style is also unique. The 16-year-old boy is low-key and introverted. He rarely appears in front of the media which is why you don’t know him.]</p><br/><p>Li Cangyu really hadn’t heard of Chen Anran. He rarely watched the Cheetah team’s games. According to Ling Xuefeng’s explanation, he was a terran hunter. This style hadn’t appeared in the league before.</p><br/><p>Hunters relied on traps as a means of attack. The most commonly used skill was the Capture Trap that could be placed on the ground. The person stepping on it would be stuck and lose blood. If used well, it was a very strong control skill.</p><br/><p>A master hunter could fill the ground with traps, making the opponents walk into traps without any precautions. Then the high damage of the traps would successfully kill the opponent.</p><br/><p>Due to the need to quickly place traps, hunters needed high agility as a basis. Thus, the hunters in the Miracle League would choose an elf with the agility build as the main growth route.</p><br/><p>Chen Anran chose the terran gameplay, which was extremely rare.</p><br/><p>Li Cangyu thought for a moment before replying: [The judges must be very sure of his talent if they gave him this award.]</p><br/><p>Ling Xuefeng said: [The Cheetah team will definitely improve next season and the double traps style will be hard to deal with.]</p><br/><p>The two of them were chatting when Yu Bing suddenly read a number. “Next is the sixth’s seasons heavyweight single person award, the MVP Award. The winner of the MVP award is… Wind Colour’s Ling Xuefeng!”</p><br/><p>Ling Xuefeng put away his phone and calmly walked on stage to accept the trophy.</p><br/><p>Kou Hongyi said with a smile, “Captain Ling’s expression is very calm. Is there anything you want to say to everyone?”</p><br/><p>Ling Xuefeng stated, “Yes, thank you all.”</p><br/><p>Hosts, “…”</p><br/><p>The natural cold king, they still couldn’t interview him.</p><br/><p>Ling Xuefeng accepted the prize with a serious face and the camera zoomed in on him. The man’s side profile was handsome like the creator had carefully carved him. His expression was cold, worthy of the league’s first abstinent god.</p><br/><p>Many fans were screaming and commented: [Lick Captain Ling!]</p><br/><p>Li Cangyu couldn’t help thinking, ‘This man is mine, not yours.’</p><br/><p>***</p><br/><p>The Best Combination Award was given to Ghost Spirits’ Lou Zhang brothers. Their understanding of each other had increased and they truly could be considered the best combination. The Highest Popularity Award decided through voting was given to Tan Shitian. It was because he posted a lot about kittens and dogs these past few days, attracting many random votes.</p><br/><p>None of these awards were too controversial and the team awards that followed was the highlight.</p><br/><p>The third-place Ghost Spirits, second place Flying Feathers and champions Wind Colour!</p><br/><p>The three teams took to the stage to receive the trophies.</p><br/><p>This was the last trophy of the old system, a perfect ending to the sixth season. It heralded the new seventh season that was coming.</p><br/><p>Ling Xuefeng held the championship trophy and stated calmly to the camera, “I am very pleased that the Wind Colour team can win the last championship of the old system. This is the end of a long era and the beginning of a new era. In the seventh season, not only will the league rules comprehensively change but we have a friend returning from afar. I believe that in the seventh season, all professional players will bring you more wonderful scenes.”</p><br/><p>These words were widely spread around by the e-sports reporters. It was a perfect finish to the sixth season.</p><br/><p>The end of an old era, the beginning of a new era and the return of an old friend!</p><br/><p>Everyone knew who the old friend was and people started to have expectations about Cat God’s return.</p><br/><p>Li Cangyu saw the news reports and couldn’t help sending a message to Ling Xuefeng. [Really handsome.]</p><br/><p>The person he saw was so handsome!</p><br/><p>Ling Xuefeng normally didn’t like to talk, yet he gave such a serious speech. This actually became the closing lines of the sixth season. Wind Colour’s captain really wasn’t average.</p><br/><p>Ling Xuefeng, who was having dinner after the awards ceremony, received the message and a gentle look appeared in his eyes. [Do you mean that I’m handsome?]</p><br/><p>Li Cangyu replied: [Yes, you were very handsome when speaking into the camera.]</p><br/><p>Ling Xuefeng was in a good mood from being praised and sent back: [I am waiting for your return.]</p><br/><p>A ripple spread through Li Cangyu’s mind at these words. He wanted to climb through the phone line and throw him down.</p><br/><p>‘I will be back. The seventh season will soon arrive!’</p><br/>\n</div>"}