{"title": "Chapter 98", "id": 98, "volume": 1, "url": "http://boxnovel.org/god-level-summoner-chapter-98", "volume_title": "Volume 1", "body": "<h1>Chapter 98</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 98 – New Teammate (2)</p><hr/><br/><p>Li Cangyu heard Old Zhang’s description and became excited. In the beginning, he had Old Zhang go to the cross-server arena with Xiao Gu while he trained Xiao Han and looked for teammates. As a result, there was no progress on Xiao Han’s side but Old Zhang sent good news about a teammate first.</p><br/><p>A black magician was exactly the teammate they needed the most. According to Old Zhang, this person shouldn’t be the side account of a professional player. Maybe he was still developing.</p><br/><p>“Give me a random account and I will join you.” Li Cangyu said to Zhang Jueming.</p><br/><p>“Okay, I sent the account password on Q.” Zhang Jueming picked a summoner from his dozens of accounts and sent it to Li Cangyu. Li Cangyu logged and consciously joined the team.</p><br/><p>Zhang Jueming explained on the team channel. [This is my friend. He will play the arena with us tonight.]</p><br/><p>Don’t Like to Talk said one word. [Oh.]</p><br/><p>Li Cangyu sent a handshake emoji. [Hello.]</p><br/><p>Don’t Like to Talk: [Okay.]</p><br/><p>Li Cangyu: [How many years have you been playing a black magician?]</p><br/><p>Don’t Like to Talk: [Three years.]</p><br/><p>Li Cangyu: [Do you really dislike talking?]</p><br/><p>Don’t Like to Talk: [Yes.]</p><br/><p>Li Cangyu, “…”</p><br/><p>This guy was interesting. He took such a direct ID!</p><br/><p>[Your team has joined the cross-server arena’s qualifying list. Matching your opponents, please wait.]</p><br/><p>[Matching successful. Reading the arena map, please be prepared.]</p><br/><p>On the screen, the 10-second countdown popped up. After a while, the four people appeared on the arena map along with two other random teammates assigned by the system.</p><br/><p>The random map for the qualifiers was just a mountain map. There were three paths that could be taken to steal the crystal.</p><br/><p>In order to observe the strength of Don’t Like to Talk, Li Cangyu deliberately walked with him down the same road but he acted as a soy sauce.</p><br/><p>The result…</p><br/><p>This black magician was quite strong. He actually killed two people from the opposite side and took a double kill in one breath!</p><br/><p>Strangely, he didn’t say a word despite Li Cangyu obviously acting as a soy sauce. He just silently fought, as if his teammate didn’t exist.</p><br/><p>This game was won without a doubt. Don’t Like to Talk relied on the violence of the black magician to kill the opposite six people.</p><br/><p>For the next three rounds, Li Cangyu continued to act as a soy sauce, never helping when they were surrounded. The black magician still didn’t speak as he ignored Li Cangyu and continued to fight by himself.</p><br/><p>Even after being surrounded and killed by three enemies, he didn’t say a word and climbed up again in silence.</p><br/><p>An average person would definitely curse on the team channel. How could they be calm when they met such a pig teammate? This person’s psychological quality was quite strong.</p><br/><p>Zhang Jueming had been taking a separate path with Xiao Gu but he still paid attention to this side. He asked in the voice channel, “Cat God, what do you think of this person?”</p><br/><p>Li Cangyu thought about it. “He is very familiar with a black magician’s skills and his ability to grasp opportunities is powerful. His mentality is also understated. I think he really can be developed.”</p><br/><p>Zhang Cheming nodded. “I think so as well. This person doesn’t like to talk so we can’t ask him anything.”</p><br/><p>Li Cangyu said, “We aren’t in a hurry. Let’s do it again.”</p><br/><p>***</p><br/><p>Li Cangyu spent one evening acting as a soy sauce to carefully observe this black magician. He saw that this person’s eyes were quite sharp. It could be seen from the way he operated that his hand speed wasn’t high. However, his play was very stable and the skills linkage excellent. No skills would be wasted.</p><br/><p>The smartest thing about him was that even in disadvantageous situations of 1v2 or 1v3, he was very good at using the terrain to kite the opponents. He played a remote class very well, grasping the way to maintain a distance from the opponent while still being able to use vital skills.</p><br/><p>The black magician was the most aggressive class in the ranged magic classes but this person’s black magician didn’t give a suffocating sense of oppression. Rather, it was a bit slow.</p><br/><p>He slowly kited his opponents, like boiling a frog. He used the slow black magic style to grind away at the opponent. An average person might feel suffocated by this. However, Li Cangyu felt that if a person’s hand speed was limited then they couldn’t play the explosive oppression style. This method of slowly grinding the opponent was also very good.</p><br/><p>Don’t Like to Talk and Li Cangyu played until approximately 12 o’clock before Don’t Like to Talk sent a message to the team channel: [Goodbye.]</p><br/><p>Li Cangyu quickly typed: [Are you logging off?]</p><br/><p>[Sleep.]</p><br/><p>[Will you come back tomorrow?]</p><br/><p>[I will.]</p><br/><p>Li Cangyu smiled and said: [Then let’s go together tomorrow. Master, take us with you.]</p><br/><p>[Okay.]</p><br/><p>Zhang Jueming silently wiped his sweat. Cat God pretending to be a small novice was really first-class acting. He actually said, “Master, take us with you.” If the other person knew who Cat God was, wouldn’t he be terrified?</p><br/><p>***</p><br/><p>The next night, Don’t Like to Talk received a team invitation as soon as he logged in. He joined the team and saw that yesterday’s summoner, psychic and healer were present. Also, there was a white magician and swordsman in the team.</p><br/><p>In fact, Zhang Jueming’s healer side account was being controlled by Bai Xuan this time, while Zhang Jueming changed to a white magician account. The swordsman was naturally Xie Shurong. Cat God sent a summoning order and all his teammates arrived.</p><br/><p>As for Xiao Han, he was still seriously defending the challenge arena.</p><br/><p>Li Cangyu typed on the team channel: [We are a casual group and are just missing one person. Do you mind playing the qualifiers with us?]</p><br/><p>Don’t Like to Talk didn’t have a regular teammate and typed: [Okay.]</p><br/><p>Li Cangyu asked: [Do you want to join the voice channel?]</p><br/><p>Don’t Like to Talk: [I don’t have a mic.]</p><br/><p>This person’s nature was obviously a bit introverted. Li Cangyu didn’t force him and simply joined the qualifiers list.</p><br/><p>When teaming up, the system presumed the members were good friends so the matched opponents would be relatively strong. This stage was too simple for Li Cangyu and professional players. Still, everyone wanted to see the black magician’s strength so they collectively pretended to be novices.</p><br/><p>The black magician didn’t hate on this ‘small novice’ teammates. He used obstacles to slowly hit the opponent and sometimes took advantage of the terrain to grind at the opponent.</p><br/><p>The more Li Cangyu looked, the more he liked this person. This guy was like a snail that could kill people slowly.</p><br/><p>The mastery of his skills was particularly precise. Every skill was released at the right timing and he didn’t waste a single drop of blue. He was a prudent type player.</p><br/><p>In the voice room, Bai Xuan couldn’t help commenting, “It is rare for a black magician to play like this.”</p><br/><p>Xie Shurong agreed. “It is rare. The strongest black magicians in the country are in the Wind Colour team. Yan Ruiwen and Guo Xuan have reduced the cooldown of their skills as much as possible to play quickly. This matches the violent output style of Wind Colour’s summoners.”</p><br/><p>In Miracle, skill points could be added at will and the degree of freedom was quite high. As Xie Shurong said, both Yan and Guo of Wind Colour had skills that ‘reduced cooldown.’ They could quickly cast spells and match with Ling Xuefeng to suppress the opponents. The black magician in front of them was obviously different. The ‘add magic damage’ skills were slow to cast but as long as they hit, the damage would be high.</p><br/><p>Zhang Jueming mused, “A class doesn’t have a fixed gameplay. Since I can use a white magician as an auxiliary, is there any problem with the black magician’s slow style?”</p><br/><p>Li Cangyu laughed. “That is the truth. There are advantages to the fast and slow style. The main thing is to look at the team’s lineup. Pure Cleansing’s double auxiliary lineup is especially slow but it also gives many strong teams a headache. When necessary, slow down the rhythm to seize an opportunity and counterattack.”</p><br/><p>The captain clearly liked this slow and introverted person, but Bai Xuan still had some concerns. “The origin of this person is unclear. It is hard to say if he can become a professional player or not.”</p><br/><p>Li Cangyu said, “Let me ask him.”</p><br/><p>Then he sent a message to the other person. “Hello, I am Old Cat. I am forming a professional team to participate in the seventh season’s professional league. I am looking for a black magician teammate. Are you interested in playing in the professional league?”</p><br/><p>The other person was somewhat flattered and asked after a long time: [Cat God?]</p><br/><p>Li Cangyu replied: [Have you heard of me?]</p><br/><p>[Yes, the behind the scenes strategist.]</p><br/><p>Li Cangyu understood that his role as the behind the scenes strategist had been circulated on the Internet during the Carnival. The news that Cat God is coming back was widely forwarded by Miracle fans. It was no secret if people were paying attention to the World Carnival. It wasn’t strange that people knew him.</p><br/><p>[That’s right, I’m Old Cat.] Li Cangyu quickly typed: [I will ask you seriously. Are you interested in playing in the Professional League?]</p><br/><p>[…Me?]</p><br/><p>[Yes, it is you.]</p><br/><p>Don’t Like to Talk was silent for a long time before saying: [Is it okay?]</p><br/><p>Li Cangyu replied with a smile: [Of course. What other reason would I have for bringing my teammates to play the bronze qualifiers with you? One of my teammates met you and found that you are special and talented. We collectively came to check. The people present are professional players in my team and they all appreciate you.]</p><br/><p>Don’t Like to Talk: […]</p><br/><p>Li Cangyu said: [Why don’t you come to the voice channel and I’ll say it directly?]</p><br/><p>Don’t Like to Talk: [Okay.]</p><br/><p>A moment later, a person entered the voice room and a weak voice entered everyone’s ears. “H-How are you?”</p><br/><p>Li Cangyu spoke cheerfully, “Hello, I am Old Cat. What are you called?”</p><br/><p>The person whispered, “My, my surname is Li, I’m called Li Xiaojiang.”</p><br/><p>This voice wasn’t too old. He was probably a teenager?</p><br/><p>Li Cangyu couldn’t help laughing. “How old are you?”</p><br/><p>“18, 18 years old.’</p><br/><p>“Then can I call you Xiao Li?”</p><br/><p>“Okay, okay.”</p><br/><p>Bai Xuan found that every time this person spoke, he would repeat the first word. Bai Xuan took off his headset and whispered, “Does this little guy have a stutter?”</p><br/><p>Li Cangyu also took off his headset and nodded. “It is possible.”</p><br/><p>It was possible that due to his speech, he didn’t like to talk and became more introverted.</p><br/><p>The voice of this young boy was feeble and had a sharp contrast with the unrestrained Uncle Zhang and lively Xiao Gu. This made Bai Xuan think of a pitiful stray cat in the corner.</p><br/><p>Cat God really had an aura that attracted young people. This time, it was this introverted young man. Bai Xuan couldn’t help smiling. “If two more youngsters join the team, we can put together a table of four for mahjong.”</p><br/><p>Li Cangyu gave him a look. “Let’s check this Xiao Li first.”</p><br/><p>Bai Xuan said, “This person is easier to deal with than Xiao Han. Xiao Han was rebellious and we have to kill him until he had his underwear left before he would agree. This Xiao Li sounds very good. Perhaps he will follow you after you say a few words.”</p><br/><p>“I hope so.” Li Cangyu put on his headset again and said, “Xiao Li, I appreciate your talents in the game. Your dragging style is slow and sluggish, but this is a strong match with my teammates. I would sincerely like to invite you to join my team. Are you willing?”</p><br/><p>Li Xiaojiang was silent for a moment before carefully saying, “But, but I haven’t played competitively…”</p><br/><p>His stuttering became more apparent when he was nervous. Li Cangyu said softly, “You can follow me to play the game. Give yourself a chance. How about it?”</p><br/><p>Li Xiaojiang whispered, “I, I will drag you down…”</p><br/><p>Li Cangyu stated, “Don’t be afraid. I’ll be there to cover you.”</p><br/><p>Li Xiaojiang seemed touched as he blushed. “Then, then let me think about it.”</p><br/><p>Gu Siming heard the stuttering youth and couldn’t help whispering to Uncle Zhang, “He plays the game slowly and talks slowly. He is a slow person.”</p><br/><p>Zhang Jueming laughed. “It is enough for our team to have you as a little madman. Cat God would have a headache if there are a few more madmen. I think this Xiao Li is very good. It doesn’t matter if he is slow. This makes him more stable on the field.”</p><br/><p>In fact, Li Cangyu had the same thoughts. Gu Siming was too hot-blooded and really was a small madman. Xiao Han was arrogant and rebellious, although he played well. This Xiao Li was slow but he was far more stable than Xiao Han and Gu Siming. It would be great if he joined!</p><br/>\n</div>"}