{"title": "Chapter 91", "id": 91, "volume": 1, "url": "http://boxnovel.org/god-level-summoner-chapter-91", "volume_title": "Volume 1", "body": "<h1>Chapter 91</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 91 – Witty Idea</p><hr/><br/><p>Li Cangyu had never liked anyone. In the past few years, he put all his energy into leading his team and his mind was filled with various tactics. There was no time to think about feelings. However, in the critical moment when his father was in a serious condition, Ling Xuefeng accompanied him and made him feel, ‘Having this person around is also very good.’</p><br/><p>In particular, the person had a unique understanding of him and the same goals.</p><br/><p>It was a pity that Ling Xuefeng was a man.</p><br/><p>On the way home, Li Cangyu considered this issue. After so many years, this was the first time he got the symptoms of a rapid heartbeat and hot cheeks when looking at a person. He could rely on Ling Xuefeng to sleep all night and didn’t want to let go when hugging him. This definitely was his favourite person. Could he still explain it with ‘brotherhood’?</p><br/><p>He never had such feelings towards other brothers.</p><br/><p>If Ling Xuefeng was a woman, he wouldn’t hesitate to catch Ling Xuefeng and marry him.</p><br/><p>But Ling Xuefeng was a man… this wouldn’t be easy.</p><br/><p>Ling Xuefeng usually looked serious and cold. If he didn’t have such thoughts towards Li Cangyu, confessing would only cause trouble and also destroy the six-year deep friendship between the two people.</p><br/><p>Besides, Li Cangyu wasn’t born liking men. He just enjoyed being with Ling Xuefeng and he liked the warmth that Ling Xuefeng gave him.</p><br/><p>He knew that two men being together would face a lot of resistance. He had to carefully consider if he wanted to drag Ling Xuefeng into these waters.</p><br/><p>Li Cangyu thought about it and finally calmed down completely.</p><br/><p>***</p><br/><p>By the time he arrived home, Xiao Han had already taken the bus back to Boston. Xiao Gu and Uncle Zhang had finished packing their bags.</p><br/><p>Bai Xuan made a table full of food for them and Xie Shurong immediately ran to eat when he heard. The five people gathered around the table after dinner. Xie Shurong sat next to Bai Xuan and flattered him. “Vice-Captain Bai’s cooking is getting better and better.” Bai Xuan pointed to the kitchen. “Go and wash the dishes first.”</p><br/><p>Xie Shurong, “…”</p><br/><p>Xiao Gu laughed until he got a stomachache. Once A’Shu left, he asked curiously, “Vice-Captain Bai, do you like to bully A’Shu?”</p><br/><p>Bai Xuan said with a smile, “Who told him to chase me before.”</p><br/><p>The most annoying thing for a remote class was a swordsman. Once the swordsman got close, skills couldn’t be cast. However, Bai Xuan wasn’t deliberately bullying A’Shu. He just thought that A’Shu’s expression when wanting to please him was fascinating!</p><br/><p>Fortunately, there was a dishwasher at the house. Xie Shurong soon finished the dishes and ran to Bai Xuan to ask for credit. “I washed the dishes.”</p><br/><p>Bai Xuan inserted a toothpick into a cut apple and handed it to him. “I will reward you.”</p><br/><p>Xie Shurong didn’t use his hands and directly opened his mouth, saying, “Thank you!”</p><br/><p>Bai Xuan was amused. This guy was tall and handsome but his character was a big child. He was less steady compared to his brother Su Guangmo but he was more lovely.</p><br/><p>Bai Xuan handed him an orange. Xie Shurong was rewarded and ate it happily. He turned and sat down next to Bai Xuan. Then he said with a smile, “At this Carnival, Jack’s 3v3 team didn’t enter the top eight. He complained about the Chinese and South Korean teams after returning and said that Asian tactics are too complicated.”</p><br/><p>Zhang Jueming laughed. “He means that Asian people are smarter right?”</p><br/><p>Xie Shurong said, “You can think of it that way!”</p><br/><p>Gu Siming declared proudly, “Of course, just look at who was the strategist behind that game!”</p><br/><p>Bai Xuan smiled and said, “It seems that our Cat God’s tactics are too high level, making the US team completely stunned.</p><br/><p>Everyone boasted and praised their captain. Once they finished, they found that Cat God did not react at all.</p><br/><p>They looked back doubtfully and found that while everyone was chatting, Li Cangyu kept touching his chin and looking down like he was thinking about something significant.</p><br/><p>Bai Xuan coughed and asked, “What’s wrong?”</p><br/><p>The man whose head was full of Ling Xuefeng finally came back and smiled. “Oh, it’s nothing.”</p><br/><p>In fact, he has just been thinking about how long it had been since he met Ling Xuefeng and how could he like Ling Xuefeng. Initially, he only thought of Ling Xuefeng was a friend, opponent and confidant. After sleeping against Ling Xuefeng yesterday, a string in his heart was touched and created a strong desire to monopolise this person.</p><br/><p>He didn’t want to see any woman hugging Ling Xuefeng. Ling Xuefeng’s hug could only be his!</p><br/><p>‘You are the best player in my heart.’</p><br/><p>Ling Xuefeng had said these words yesterday when comforting Li Cangyu.</p><br/><p>Li Cangyu thought the same way. If Li Cangyu had to select the best player in the Miracle Professional League, he wouldn’t hesitate to vote for Ling Xuefeng.</p><br/><p>They used to be opponents and friends… now he felt that a friend was far from enough. Li Cangyu wanted to hold him tightly and kiss him. If he really kissed Ling Xuefeng, what would the expression on Ling Xuefeng’s serious face look like?</p><br/><p>He thought of the person who moved his heart so Li Cangyu’s eyes were very soft.</p><br/><p>Bai Xuan and Zhang Jueming looked at each other and were confused.</p><br/><p>Cat God, why are you wandering off again?</p><br/><p>Several teammates soon discovered that Li Cangyu wasn’t in the right state today.</p><br/><p>Bai Xuan thought it was because of his father’s hospitalisation and softly comforted him. “Don’t overthink it. Uncle has already left the dangerous period and your sister is taking care of him at the hospital. There will be no problems.”</p><br/><p>Zhang Jueming also said, “People have their own natural fate and your father will definitely get better soon.” Li Cangyu guiltily touched his nose and changed the topic. “I was just thinking about the formation of the team.”</p><br/><p>He became serious and he successfully deceived everyone.</p><br/><p>Xiao Gu was stunned and asked, “Our team isn’t formed yet?”</p><br/><p>“We don’t have enough people.” Li Cangyu said seriously, “If Xiao Han gives me a definite answer, our team will have six people. The number of people to sign up for the regular season is eight. Thus, we have to find two more people as soon as possible.”</p><br/><p>Zhang Jueming bowed his head and touched his chin. “I have been playing the arena with Xiao Gu for over a month. I didn’t find any talented people. Right now, the arena is a cross-server mix and it is almost like the world of primary school students.”</p><br/><p>Bai Xuan laughed. “Yes, now many primary school students are running to play online games. It is difficult to find a master in the low-level section of the cross-server arena.”</p><br/><p>“Don’t worry, take your time.” Li Cangyu spoke to Zhang Jueming. “Old Zhang, after returning home, continue to take Xiao Gu to the arena. Let Xiao Gu became familiar with playing against the melee and ranged classes.” Then he looked back at Gu Siming. “You must follow Old Zhang and study seriously. “You are the front row of our team and should be familiar with the skills of all output classes. Think of ways to cope with emergencies. Do you understand?”</p><br/><p>Gu Siming nodded like a chicken pecking rice. “Yes, I know.”</p><br/><p>Li Cangyu smiled and rubbed his head before continuing, “I suddenly thought of a plan to recruit teammates but I don’t know if it’s feasible or not.”</p><br/><p>Bai Xuan asked curiously, “What is your plan?”</p><br/><p>Li Cangyu explained, “I watched martial arts movies as a child and isn’t there a lot of beautiful women who marry after a serious competition? The winner who succeeded in lasting to the end is generally an excellent master. Therefore, I want to set up a contest in Miracle. We don’t have a daughter so we should use high bonuses as a reward. This way, we can attract many masters.”</p><br/><p>Xie Shurong’s eyes suddenly lit up. “Cat God, this is a great idea! Whether it is for rewards or fame, as long as an arena contest opens, many people will certainly come to test the waters. Perhaps we really can find a master with the skills to play at the professional level.”</p><br/><p>Li Cangyu added, “Yes, I want Xiao Han to lead the way., Anyone who beats Xiao Han can get 50,000 gold coins. It is only after beating the apprentice that they can face the master. Anyone who beats me can get one million gold coins.”</p><br/><p>Bai Xuan was shocked. “One million? I don’t think we have that much money in our warehouses, do we?”</p><br/><p>“It doesn’t matter. This one million can’t be taken away by anyone.” Li Cangyu smiled at everyone. “Do you think anyone can beat me? Summoners already have an advantage in a 1v1 fight. Unless someone at the level of Ling Xuefeng arrives, it is impossible to take away the one million gold.”</p><br/><p>Everyone, “…”</p><br/><p>Really witty!</p><br/><p>Xiao Han’s current level wasn’t stable enough and the possibility of losing to a real master was great. Therefore, Li Cangyu set the reward for beating Xiao Han relatively low to not lose a lot of money. Then he personally sat at the guard, releasing the one million huge bonus that would attract experts from every region to challenge him.</p><br/><p>There were many races and professions in the arena. Xiao Han could play with all types of masters and this was equivalent to finding many sparring partners for Xiao Han. It was also possible to find excellent teammates, killing two birds with one stone!</p><br/><p>Bai Xuan couldn’t help thinking that this was Cat God. Cat God was always careful and never made a loss. If he did business, he would undoubtedly become a local tyrant!</p><br/><p>Once the plan was agreed upon, Li Cangyu smiled. “Let’s do it. I will go online later to talk to the guild managers about the specific plan. Next Monday, the arena challenge of our Food Squad will officially open.”</p><br/>\n</div>"}