{"title": "Chapter 93", "id": 93, "volume": 1, "url": "http://boxnovel.org/god-level-summoner-chapter-93", "volume_title": "Volume 1", "body": "<h1>Chapter 93</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 93 – Qin Mo VS Xiao Han</p><hr/><br/><p>Qin Mo couldn’t win against Cat God but he was full of confidence against Cat God’s apprentice.</p><br/><p>He left his master’s room and immediately asked the president of the Wind Colour guild for 10 side accounts of different classes. All account names and passwords were written down and he excitedly waited for the arena challenge to start the next night.</p><br/><p>At 8 p.m. the next day, Li Cangyu really made a VIP room in the cross-server arena. The room was called ‘Challenge Arena’ while Small Elf directly advertised on the world channel: [The Food Squad has opened an arena challenge. The first stage gives 50,000 gold and the second boss stage will give one million gold! Any masters are welcome to come and apply for the challenge!]</p><br/><p>The advertisement was released and countless onlookers immediately poured into the arena.</p><br/><p>Li Cangyu spoke on the room channel: [Is there any master willing to challenge it? The registration fee is 1,000 gold coins.]</p><br/><p>Many onlookers questioned it: [You didn’t previously say that there was a registration fee!]</p><br/><p>[President, you are too much!]</p><br/><p>Li Cangyu said: [The registration fee is 1,000 gold but you can get 50,000 if you win. This is very cost-effective! Come if you have confidence in yourself.]</p><br/><p>The registration fee of 1,000 gold was to prevent people from running here to make trouble.</p><br/><p>The condition for entering this arena was to pay the creator of the room 1,000 gold coins. No one wanted to waste money, so those willing to spend money would be masters confident in their own level.</p><br/><p>Li Cangyu then advertised: [I welcome any masters to take the challenge! 50,000 gold is the reward if you win!]</p><br/><p>Someone was probably attracted by the reward and typed: [If I win against this assassin, will I receive the money? Are you going to cheat us?]</p><br/><p>Li Cangyu: [I am using the name Food Squad as a guarantee. I won’t cheat anyone.]</p><br/><p>This person should be from another server. He didn’t know Love to Eat Braised Fish but since there was a guild as a guarantee, he let go of his worries and paid to the 1,000 gold registration fee.</p><br/><p>Xiao Han stared seriously at the computer screen, and his palms were sweating.</p><br/><p>Master put him in the arena and also bet 50,000 gold coins. His pressure was immense. If he lost, wouldn’t he lose Master’s money?</p><br/><p>Li Cangyu saw the little boy’s eyes flashing and patted his shoulder. “Xiao Han, remember, you are going to play in the professional league. You are used to playing an assassin in the game, always hiding behind a person to look for opportunities. In the future, you will have to stand on the field and take the initiative to create opportunities.”</p><br/><p>Xiao Han was stunned before soon reacting. His master was right. He was going to enter the professional league and his opponents would be great gods. If he couldn’t even fight against ordinary players in the online game, what qualifications did he have to be a professional player?</p><br/><p>Previously, he would secretly track the target and take advantage of when they had residual blood to assassinate them, making his success rate very high. But on the field, the opponent would definitely be prepared and wouldn’t give Xiao Han their back. Thus, he had to take the initiative to create an opportunity!</p><br/><p>The transition from an assassin who only knew how to sneak attack to a real killer who could actively create opportunities on the field, Li Cangyu found the most suitable method to do this.</p><br/><p>Challenge the arena.</p><br/><p>Openly do an arena challenge against different classes and different races!</p><br/><p>Xiao Han finally fully grasped his master’s good intentions and looked seriously at Li Cangyu. “Master, I am ready.”</p><br/><p>Li Cangyu smiled. “Then open it.”</p><br/><p>The two men in the arena pressed the ready button and a five-second countdown started on the screen.</p><br/><p>Once the countdown was over, the white magician challenger immediately widened the distance and started to cast the white magician’s control skill, God’s Seal. He apparently wanted to control Xiao Han.</p><br/><p>However, Xiao Han’s reaction was faster and he disappeared the moment the spell casting was about to end.</p><br/><p>He moved around to the rear and used Death Mark, Backstab, Fatal Blow!</p><br/><p>The connection between skills was incredibly smooth and the assassin’s critical hit when striking from behind made the white magician’s blood drop instantly.</p><br/><p>On the sidelines, Li Cangyu couldn’t help smiling with relief.</p><br/><p>The thing he liked most about Xiao Han was the boy’s sharp and quick reactions. The teenager didn’t have professional training but he had keen insight. In other words, this was talent.</p><br/><p>He was confident that Xiao Han would surprise the Miracle League after a period of tempering.</p><br/><p>Sure enough, in less than three minutes, Xiao Han took care of the white magician and won 1,000 gold coins.</p><br/><p>This person had come to test the waters. After losing, he sent a thumbs up emoji and said: [To dare open a challenge arena, you are really great!]</p><br/><p>Xiao Han sent back: [Thank you!]</p><br/><p>The youth’s face was pretending to be calm but there was obvious joy at being praised.</p><br/><p>He had minimal experience with head-on PK. He thought he would lose and didn’t expect to win.</p><br/><p>Li Cangyu patted his head and encouraged him. “Your level is definitely one of the best in the online game. I estimate that 80% of challengers will be defeated by you. Then keep doing the arena challenges and win money for your master. I’m going to eat some fruit. If someone beats you then call for me.”</p><br/><p>Xiao Han was a bit nervous with Li Cangyu standing behind him, so Li Cangyu purposely walked away. This allowed Xiao Han to play to his actual standards.</p><br/><p>***</p><br/><p>The first white magician who tried to challenge the arena was defeated. Then some confident masters took the initiative to enter the arena challenge. Some were acquaintances from Moonlight Forest while some were from other servers. This was a cross-server arena, so there were naturally many masters.</p><br/><p>Xiao Han solved one challenge after another using his extremely fast hand speed and excellent reaction speed. In less than 30 minutes, he hit the ’10 wins streak’ and earned 10,000 gold coins.</p><br/><p>Xiao Han was feeling braver when a person entered the challenge room.</p><br/><p>Strangely enough, this man was very decisive. He didn’t say anything when he came in and directly hit the challenge button. His ID was ‘Yellow River’s Waters Flowing Down From Heaven’ and he was a blood kin summoner.</p><br/><p>Xiao Han had no problem with this and also pressed the ready button.</p><br/><p>The five-second countdown ended and the other person immediately summoned a blood spider at Xiao Han’s feet.</p><br/><p>The position of this blood spider was extremely subtle and caused Xiao Han to be stuck in place.</p><br/><p>His body was stuck and he couldn’t move. The blood kin summoner quickly widened the distance and had his blood snake rush to bite Xiao Han. It directly dealt a five-layer blood loss effect on Xiao Han. Then he released the big move of the vampire bats, forcing Xiao Han’s blood to 60%.</p><br/><p>Xiao Han hadn’t gone through formal training but he knew that he had met a master this time!</p><br/><p>In the blink of an eye, the other person used excellent control to directly reduce his blood by 40%!</p><br/><p>Xiao Han stared earnestly at the computer screen. Once the blood spider’s body freezing effect was over, he immediately entered the stealth state and quickly circled around the other side. He wanted to use Backstab and Fatal Blow to even out the blood volume gap.</p><br/><p>However, the other side was very clever. The moment that Xiao Han prepared to use Backstab, he suddenly summoned the death knight!</p><br/><p>The blood kin’s death knight was the strongest defensive pet. As long as it existed, all attacks on the owner would automatically weaken.</p><br/><p>Xiao Han’s consecutive moves were like hitting cotton and there wasn’t the critical effect.</p><br/><p>Xiao Han saw the snakes and spiders all over the ground and was a bit dazed. He rarely played against blood kin summoners and didn’t have much experience dealing with their pets. This time, he was caught off guard and soon fell to the other side’s three pets.</p><br/><p>Xiao Han saw the word ‘failure’ pop up on the screen and was stunned for a long time. He won 10 games in a row and thought he was very good. As a result, he thoroughly lost.</p><br/><p>He thought of Li Cangyu’s words and shouted towards the living room, “Master, someone beat me!”</p><br/><p>Li Cangyu held an apple and ate it while looking interested. “Show me the video.”</p><br/><p>“Yes.” Xiao Han opened the video window and Li Cangyu couldn’t help laughing when he took a closer look. “This blood kin summoner is a bit interesting.”</p><br/><p>Xiao Han asked, “Should I tell him that we are recruiting teammates? I think he is excellent. He should be a professional player right? Can he become our teammate?”</p><br/><p>Li Cangyu meaningfully touched his chin. “This isn’t necessarily the case. First, give him 50,000 gold and then we can take a look.”</p><br/><p>Xiao Han traded the 50,000 gold to the other person and privately asked: [Hello, can I add you as a friend?]</p><br/><p>The blood kin summoner didn’t talk and directly left the room.</p><br/><p>Xiao Han scratched his head when he didn’t receive a reply, his heart feeling very puzzled.</p><br/><p>A moment later, a black magician entered the room. He didn’t say a word and just pressed the ready button. This person’s ID was ‘Great Hall’s Bright Mirrors Sad White Hair’.</p><br/><p>Li Cangyu’s smile became deeper and he patted Xiao Han’s shoulder. “Go and fight him.”</p><br/><p>“Oh.” Xiao Han immediately pressed the ready button.</p><br/><p>To his surprise, the black magician’s style of play was very violent. When it started, he took the first hand by controlling Xiao Han with fear magic. He used consecutive spells on Xiao Han and then took advantage of a remote class’s control of the field to decisively kill the residual blood assassin.</p><br/><p>There was no doubt that Xiao Han once again lost.</p><br/><p>He looked at his gold coins with distress and couldn’t help saying, “Master, is someone displeased with us and organised a party to disturb the arena?”</p><br/><p>Li Cangyu’s reply was decisive. “No.”</p><br/><p>“Then why did I meet two masters in a row? They didn’t say anything and just left with the money. Their IDs are also similar. Do they know each other?”</p><br/><p>“Not them, it is a him.” Li Cangyu smiled. “The blood kin summoner and black magician are the same people.”</p><br/><p>Xiao Han was shocked. “Eh?”</p><br/><p>Li Cangyu sat in front of the computer and sent a message to the black magician: [Did Ling Xuefeng tell you to come?]</p><br/><p>Qin Mo, “…”</p><br/><p>Qin Mo was just about to change accounts when he saw the words in the private chat window. His fingers shook slightly and he entered the wrong password.</p><br/><p>Li Cangyu continued: [Xiao Qin Mo, don’t pretend.]</p><br/><p>Qin Mo’s face turned red. Cat God saw through him so quickly? He didn’t even say anything!</p><br/><p>Li Cangyu sent a smiling expression. [Go and call your master.]</p><br/><p>QIn Mo originally wanted to pretend he didn’t know anything. Then Li Cangyu sent a follow-up message: [Go and call him or I will call him. International long-distance calls are very expensive.]</p><br/><p>The blushing Qin Mo replied: [Oh.]</p><br/><p>He went to his master’s room and knocked on the door. Ling Xuefeng quickly opened it and looked at him thoughtfully. “What’s the matter?”</p><br/><p>Qin Mo hung his head. “Master, I was recognised by Cat God. He is calling you.”</p><br/><p>He sneaked a glance at his master, thinking his master would be angry. Unexpectedly, Ling Xuefeng’s expression was very calm like he expected to be recognised by Cat God.</p><br/><p>Ling Xuefeng asked, “How many rounds did you play?”</p><br/><p>Qin Mo replied, “Two rounds.”</p><br/><p>“Did you win all of them?”</p><br/><p>“Yes.”</p><br/><p>Ling Xuefeng walked quickly to the training room and sat on the computer next to Qin Mo. He logged into the Steamed Bass account and sent a message to Li Cangyu: [How did you recognise Qin Mo?]</p><br/><p>Li Cangyu explained: [He never spoke a word. After the fight, he would change accounts and the account names are all poetry. He shouldn’t be too obvious.]</p><br/><p>Ling Xuefeng immediately glanced back at Qin Mo. His apprentice immediately bowed his head.</p><br/><p>Li Cangyu then asked: [When did you return to Shanghai?]</p><br/><p>Ling Xuefeng: [Yesterday afternoon.]</p><br/><p>Li Cangyu: [What do you mean by having your apprentice bully my Xiao Han?]</p><br/><p>Ling Xuefeng: [It isn’t bullying. I am sending my apprentice free of charge to be a sparring partner for your Xiao Han.]</p><br/><p>The free of charge Qin Mo was afraid to say a word.</p><br/><p>Li Cangyu was very satisfied. [Okay, Qin Mo has recently grown. Have him log into a bard’s account and come to teach Xiao Han.]</p><br/><p>Ling Xuefeng spoke to QIn Mo, “Go open a bard’s account and play Xiao Han.”</p><br/><p>Qin Mo said, “…Oh.”</p><br/><p>Li Cangyu: [Also, return the 100,000 coins that he won. It isn’t kind to open a side account and take my money. It isn’t easy for me to make money!]</p><br/><p>Ling Xuefeng looked at Qin Mo. “Did you hear him? Return the money to Cat God.”</p><br/><p>Qin Mo said, “…Oh.”</p><br/><p>He listened to master and master listened to Cat God. The end result was—he had to listen to Cat God!</p><br/>\n</div>"}