{"title": "Chapter 108", "id": 108, "volume": 2, "url": "http://boxnovel.org/god-level-summoner-chapter-108", "volume_title": "Volume 2", "body": "<h1>Chapter 108</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 108 – Boss Combination</p><hr/><br/><p>After being ruthlessly abused by their masters, Qin Mo and Xiao Han entered the qualifiers list again. The result was that they encountered Tan Shitian and Cheng Wei. They were once again killed without the power to fight back.</p><br/><p>Previously, their masters brought them to victory. Now they teamed up and lost.</p><br/><p>The depressed Qin Mo typed to Xiao Han: [Can you not be so anxious? Why don’t you wait for me to summon a pet before acting?]</p><br/><p>Xiao Han replied: [This is how I played with Master before.]</p><br/><p>Qin Mo wanted to cough up blood. How could he be on the same level of Xiao Han’s master? Cat God could interact with anyone instantly. Did Qin Mo need to reflect on how to summon pets?</p><br/><p>Xiao Han asked tentatively: [Should I slow down next time?]</p><br/><p>Qin Mo frowned. [I’m not telling you to slow down!]</p><br/><p>Xiao Han was even more confused. [Then should I act faster?]</p><br/><p>[It isn’t a problem of speed. It is the cooperation. You have to cooperate with me, do you understand?] Qin Mo had a headache. [It is hard to communicate with you.]</p><br/><p>Xiao Han replied honestly: [I grew up abroad and my Chinese is at primary school level. Should we use English?]</p><br/><p>Qin Mo: […Forget it.]</p><br/><p>His English was at the primary school level.</p><br/><p>The two people bickered while continuing to play the qualifiers. After losing several games in a row, they finally matched with less powerful opponents and won the game in a thrilling way. Qin Mo suddenly found that he was even happier than when he got the trophy. It was too difficult to win with the rookie Xiao Han and really gave him a sense of accomplishment!</p><br/><p>***</p><br/><p>In contrast to their two apprentices who kept losing, the combination of Li Cangyu and Ling Xuefeng was invincible. In just half an hour, they won 10 games in a row.</p><br/><p>After the major update to the arena, everyone’s points were cleared and the fastest ones to rise in the arena were playing in this group. There were almost no weak players in the silver rank. 80% were the management of the major guilds, 10% were randoms in the online game and 10% were the side accounts of professional players.</p><br/><p>Li Cangyu and Ling Xuefeng’s winning streak was too high. The system kept matching them with the side accounts of professional players.</p><br/><p>On the 21st match of their winning streak, they met Tan Shitian and Cheng Wei.</p><br/><p>This time Li Cangyu didn’t give up and cooperated with Ling Xuefeng instead. Ling Xuefeng controlled Tan Shitian at the beginning of the game and Li Cangyu let out a burst of hand speed to kill Cheng Wei. Then the two people teamed up to kill Captain Tan.</p><br/><p>Cheng Wei was dazed from the beginning. He thought that Cat God would chat like last time. The result was that he was instantly killed by Cat God while Captain Time was killed by Wooden Wind. Cheng Wei asked doubtfully: [Cat God, is this demon summoner part of your team?]</p><br/><p>Li Cangyu replied: [Yes, isn’t he amazing?]</p><br/><p>Cheng Wei sent a row of thumbs up. [He is really amazing!]</p><br/><p>Tan Shitian smiled helplessly. If Cheng Wei was next to him then he would rub this idiot’s head hard. However, it was the holidays and Cheng Wei went home. Tan Shitian had to send Cheng Wei a private chat message: [This person is obviously Ling Xuefeng. Can’t you recognize him?]</p><br/><p>Cheng Wei was shocked. [How can that be? Ling Xuefeng is playing with Cat God? They aren’t teammates.]</p><br/><p>Tan Shitian smiled and said: [One day you will understand.]</p><br/><p>Cheng Wei was dying with curiosity. [What is it? Don’t leave me on tenterhooks. Just tell me!]</p><br/><p>Tan Shitian: [I won’t tell you.]</p><br/><p>Cheng Wei: [Do you want me to add you to the blacklist?]</p><br/><p>Tan Shitian sent a smiling emoji. [Are you willing?]</p><br/><p>Cheng Wei’s hairs stood up. [Tan Shitian, die!]</p><br/><p>He was too excited and ended up sending this message to the public chat. Li Cangyu wondered: [Xiao Wei, you only lost. Why are you scolding Captain Tan?]</p><br/><p>Cheng Wei blushed because he typed in the wrong channel. Tan Shitian laughed so hard that he got a stomachache. This emotional cat typed in the wrong channel and was seen by Cat God. Wouldn’t the kitten want to slam into the wall?</p><br/><p>Tan Shitian sent him a patting head emoji and said: [Okay, don’t be angry. Let’s continue to upgrade.]</p><br/><p>Cheng Weis send a row of knives and reluctantly followed Tan Shitian to continue the upgrade.</p><br/><p>***</p><br/><p>The Li Cangyu and Ling Xuefeng combination reached a 21 winning streak.</p><br/><p>Li Cangyu asked thoughtfully: [Are you tired? Do you want to take a break?]</p><br/><p>Ling Xuefeng sent back: [I’m not tired.]</p><br/><p>Li Cangyu: [Do you want to continue?]</p><br/><p>[Continue.]</p><br/><p>The two of them once again joined the pairs qualifiers and found they were matched with a terran swordsman and terran berserker.</p><br/><p>[It is Su Yu.] Ling Xuefeng typed in the private chat.</p><br/><p>[Are you sure?] Li Cangyu asked.</p><br/><p>[Sword of Judgment is Su Guangmo’s side account and Quiet Berserker is Yu Pingsheng’s side account. It should be right.]</p><br/><p>[It seems that our winning rate is too high and the system is matching us with professional players.]</p><br/><p>[Yes.]</p><br/><p>[I haven’t played with Yu Pingsheng yet. I will control him while you deal with Su Guangmo.]</p><br/><p>[Okay.] Ling Xuefeng decisively responded.</p><br/><p>Su Guangmo didn’t know the identities of the opponents but according to the principle of the system matching, the winners of so many games would definitely be masters. Su Guangmo thought about it and turned back to his younger brother. “These two people aren’t simple. Be careful. I suspect that this Wooden Wind is Ling Xuefeng.”</p><br/><p>Yu Pingsheng didn’t like to talk. He just nodded to show his understanding.</p><br/><p>The match soon started.</p><br/><p>The map for the pairs arena was randomly selected by the system. The map for this game was the simple ‘Zeya Square’ which was similar to the City Square map used in the 3v3 Carnival event. However, there were six statues in the middle of the city square and four stone pillars in the southeast and northwest.</p><br/><p>Li Cangyu and Ling Xuefeng appeared in the southeast direction. The two of them moved quickly and hid behind the stones pillars in the southeast, taking positions where they could take care of each other.</p><br/><p>Su Yu were two melees. They just came behind a stone pillar when they happened to see the elf summoner. Su Guangmo didn’t hurry forward and carefully maintained a distance. In the absence of the demon summoner, rushing was likely to make him fall into a trap.</p><br/><p>However, Li Cangyu knew the details of the other side and played very actively. Once he saw them come over, he immediately summoned his water spirit to freeze Yu Pingsheng’s berserker and then had his fire spirit quickly hit Yu Pingsheng with Fireball.</p><br/><p>Su Guangmo’s reaction was also very fast. The moment that he saw his brother being frozen, he turned and killed the water spirit with two ordinary attacks before turning to the fire spirit.</p><br/><p>At this moment, Ling Xuefeng saw Su Guangmo enter his attack range and summoned the demon banshee, accurately using Charm to pull Su Guangmo to him.</p><br/><p>The match was divided into 1v1 and Li Cangyu started to concentrate on handling Yu Pingsheng.</p><br/><p>Yu Pingsheng was introverted and walked around quietly like a ghost. His berserker gameplay was the opposite of his personality. It was fierce and violent.</p><br/><p>Once the freezing effect was lifted, the huge axe in his hand suddenly raised and cut straight down at where Li Cangyu was standing. It cut through all obstacles in the way! Splitting Bone Chop!</p><br/><p>The golden axe cut through the air and created a deep crater in the ground. At the same time, the weak summoner lost 20% blood!</p><br/><p>This was the attack power of the league’s first ranked berserker. Once he raised his axe to chop at a fragile remote, it was simple frightening.</p><br/><p>Li Cangyu was stunned but his fingers pressed firmly on the keyboard. He called the thunder spirit and used Thunder’s Wrath to even out the blood. Then he used Flying Feather Steps to quickly move away and summoned his wind spirit.</p><br/><p>Yu Pingsheng saw the opponent widening the distance and immediately pursued with the charging skill ‘Circle Around Three Chops.’ This skill had the shortest cooldown time of the berserker’s movement skills. It allowed the berserker to rush three times in a certain direction while attacking three times. The attacks could also change direction in the process of the charge, making it very flexible.</p><br/><p>Yu Pingsheng was obviously very skilled with this skill. He immediately caught up to Li Cangyu but Li Cangyu’s wind spirit was waiting. Storm Fury!</p><br/><p>There was a gust of wind and Yu Pingsheng was immediately blown back 10 metres.</p><br/><p>It was hard to catch up with the summoner only to end up being blown away 10 metres by wind. Li Cangyu’s move was equivalent to directly abolishing Yu Pingsheng’s best chasing skill.</p><br/><p>The wind spirit was Li Cangyu’s most powerful and flexible pet.</p><br/><p>Yu Pingsheng couldn’t help being surprised after being hit and asked Su Guangmo, “Is this Cat God?”</p><br/><p>In fact, Su Guangmo had some doubts at the beginning. The ID of Fish Farming Professional really made people think of a person who likes to eat fish. Still, he didn’t dare believe it. After all, Wooden Wind was Ling Xuefeng. Ling Xuefeng and Li Cangyu weren’t in the same team so how could they be together?</p><br/><p>It wasn’t until the first exchange that he found out… they really teamed up together?</p><br/><p>Su Guangmo’s swordsman could tie with Ling Xuefeng’s demon summoner but the berserker wasn’t as flexible as the swordman. Yu Pingsheng gradually started struggling.</p><br/><p>Li Cangyu had a lot of experience playing melee classes. In particular, he flexibly used the wind spirit, making it hard for Yu Pingsheng to get close to him. He flew around like a kite and made Yu Pingsheng uncomfortable.</p><br/><p>Su Guangmo wanted to help but he was entangled by Ling Xuefeng. The skeleton infantry’s explosion and the banshee’s Charm. He wasn’t free enough to help his brother.</p><br/><p>10 minutes later, Li Cangyu finally killed the berserker and circled around to help Ling Xuefeng. The two people summoned the skeleton infantry, demon god, thunder spirit, fire spirit…</p><br/><p>Four types of pets attacking, Su Guangmo’s death was simply unfair!</p><br/><p>[Congratulations to Wooden Wind and Fish Farming Professional for winning. The team has won 22 matches in a row and the qualifying points increased by 50.]</p><br/><p>[Sword of Judgment and Quiet Berserker have failed in the qualifying and lost 2 points.]</p><br/><p>[About to exit the arena, please confirm.]</p><br/><p>Su Guangmo didn’t rush to press the confirmation button and instead typed: [Captain Ling, Cat God, is it okay for you to team up to abuse people?]</p><br/><p>Li Cangyu smiled: [What’s wrong with it? There is no rule that people from different teams can’t pair up!]</p><br/><p>Su Guangmo, “…”</p><br/><p>The question was, ‘Do the two of you want to let others live?’</p><br/><p>Su Guangmo spat out in his heart.</p><br/><p>However, he thought of the many combinations still to be abused and felt psychologically balanced. He sent a row of thumbs up before withdrawing from the arena with his brother.</p><br/><p>***</p><br/><p>The next ones to encounter the boss combination was the Ghost Spirits’ Lou Zhang brothers.</p><br/><p>Lou Wushuang and Zhang Shaohui also set up a team to fight in today’s pairs arena. Zhang Shaohui was living with his cousin so they were together even on the holiday. The two computers next to each other in the study allowed for easy communication. The two of them always had a tacit understanding and maintained a winning streak so far.</p><br/><p>Only this time, Lou Wushuang felt something was wrong when he entered the arena.</p><br/><p>“This demon summoner and elf summoner, the combination hasn’t been seen in the league.” Lou Wushuang pushed up his glasses and said lightly, “They should be Ling Xuefeng and Li Cangyu.”</p><br/><p>Zhang Shaohui made an admiring expression. “Brother, you are so smart! You can actually guess this!”</p><br/><p>“…” Lou Wushuang looked helplessly at his brother. “The IDs are too obvious. Wooden Wind directly contains the character for ‘Feng’ while the other one is Fish Farming Professional. Cat God has always been persistent regarding fish.”</p><br/><p>Zhang Shaohui suddenly realized. “That’s right!”</p><br/><p>Lou Wushuang calmly said, “The combination of these two masters, it is a rare encounter. Play well.”</p><br/><p>“Yes!” Zhang Shaohui immediately responded and entered stealth. Then he moved with his cousin to find the opposite two people.</p><br/><p>Ling Xuefeng saw no one appear for a long time and reacted quickly. [Is it a double blood kin summoner in stealth mode?]</p><br/><p>Li Cangyu asked: [The Lou Zhang brothers?]</p><br/><p>Ling Xuefeng nodded. [It is possible.]</p><br/><p>He just said this when Lou Wushuang suddenly acted. The sharp blade in his hand raised and he decisively used Death Mark, Backstab and Fatal Blow! The consecutive moves directly greeted Li Cangyu’s body!</p><br/><p>Zhang Shaohui released the same three moves on Li Cangyu!</p><br/><p>The two brothers had a tacit understanding and their assassination ability couldn’t be underestimated. The combination of moves directly removed half of Li Cangyu’s blood!</p><br/><p>Ling Xuefeng immediately summoned his banshee and used Witch Demon’s Curse to pull the two enemies over!</p><br/><p>The rescued Li Cangyu immediately used Flying Feather Steps to widen the distance. At the same time, he summoned his thunder spirit, fire spirit, water spirit and wind spirit. The water and wind spirits controlled Lou Wushuang while the thunder and fire spirits attacked Zhang Shaohui!</p><br/><p>Ling Xuefeng also summoned his skeleton infantry to Lou Wushuang’s side and used Death Imprisonment to confine him.</p><br/><p>The two people had just started cooperating today but they had a tacit understanding.</p><br/><p>Zhang Shaohui sighed with admiration, “Ling Xuefeng and Li Cangyu really cooperate well. Are they actually a team? Why do I feel like they share the same brain when playing together?”</p><br/><p>Lou Wushuang also had this feeling. He had cultivated his understanding with his cousin since childhood but the tacit understanding between Ling and Li could be compared to them.</p><br/><p>Fortunately, Cat and Ling weren’t on the same team or the other teams in the Miracle League wouldn’t be able to survive.</p><br/><p>***</p><br/><p>This match was much harder than the Su Yu combination.</p><br/><p>The league’s strongest killers were really difficult to deal with. They would enter stealth and then pop out for a combo.</p><br/><p>The even scarier thing was that the two members would tacitly attack the same opponent. After two rounds of crits, Li Cangyu only had a bit of blood left. They obviously wanted the advantage of killing one person.</p><br/><p>However, Ling Xuefeng once again saved Li Cangyu at the critical moment. He decisively used a lot of mana to call the black crows to cover the vision of Lou and Zhang. Li Cangyu joined hands with Ling Xuefeng to kill Zhang Shaohui.</p><br/><p>Lou Wushuang let out a burst of hand speed to kill Cat God but Ling Xuefeng used this chance to kill Lou Wushuang and the Ling Cat duo won the arena match in a thrilling manner.</p><br/><p>[Congratulations to Wooden Wind and Fish Farming Professional for winning. The team has won 23 matches in a row and the qualifying points increased by 60.]</p><br/><p>[Congratulations Wooden Wind and Fish Farming Professional. You have gained enough points in the silver rank and can advance to the gold rank!]</p><br/><p>Zhang Shaohui saw this and couldn’t help sending a thumbs up on the public channel. [The two of you are really amazing. It is estimated that you are the first pair in the whole national server to advance to the gold rank!]</p><br/><p>Li Cangyu liked the description of ‘first pair’ and sent a smiling emoji. [You are also fast.]</p><br/><p>***</p><br/><p>After finishing this match, Li Cangyu sent a private message to Ling Xuefeng. [We have played for one hour. Shall we take a break?]</p><br/><p>[Yes.] Ling Xuefeng would never refuse Cat God’s proposal.</p><br/><p>Li Cangyu continued to speak: [How will you arrange this holiday?]</p><br/><p>Ling Xuefeng replied: [I plan to go home for Chinese New Year and then return to the team on the fifth day of the new month. There is a big change in the seventh season so the team will gather in advance for training.]</p><br/><p>Li Cangyu: [I talked to my mother on the phone a few days ago. She told me that she was going to the United States to visit my father during the Winter holidays. I have to celebrate the new year on my own.]</p><br/><p>Ling Xuefeng asked: [Then? What are you going to do?]</p><br/><p>Li Cangyu laughed: [Is it okay if I go to your house for the New Year?]</p><br/><p>Ling Xuefeng: […]</p><br/><p>Li Cangyu pretended to be pure as he said: [I am just visiting your home as a friend. I will bring gifts for Auntie and Uncle.]</p><br/><p>Ling Xuefeng: […]</p><br/><p>If it wasn’t a friend then what did he want to be?</p><br/><p>Ling Xuefeng thought of Li Cangyu’s initiative to bring gifts when visiting his parents and couldn’t help smiling. ‘Li Cangyu, do you know what you are doing? I will only bring my wife home for Chinese New Year. It won’t be easy if you want to play tricks later!’</p><br/>\n</div>"}