{"title": "Chapter 113", "id": 113, "volume": 2, "url": "http://boxnovel.org/god-level-summoner-chapter-113", "volume_title": "Volume 2", "body": "<h1>Chapter 113</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 113 – New Year’s Wishes</p><hr/><br/><p>Ling Xuefeng’s gentle kiss lasted a long time, making Li Cangyu’s brain a bit dizzy.</p><br/><p>He didn’t expect that the intimate contact with the person he liked would be so beautiful. Their tongues were intertwined and it was like their souls were blending with each other.</p><br/><p>After the kiss, Ling Xuefeng let go of Li Cangyu and used his tongue to clean his lips.</p><br/><p>This embarrassing move made Li Cangyu’s scalp number and his mind finally recovered.</p><br/><p>Wasn’t this wrong?</p><br/><p>He saw Ling Xuefeng’s deep eyes and Li Cangyu finally reacted.</p><br/><p>Hadn’t he gone to Ling Xuefeng’s home to inquire about the attitudes of Father Ling and Mother Ling? He hadn’t probed clearly yet when Ling Xuefeng confessed first?</p><br/><p>The order was completely reversed. Shouldn’t Li Cangyu be the one confessing first?</p><br/><p>Ling Xuefeng suddenly asked, “What did you want to say just now?”</p><br/><p>‘Of course, I wanted to say that I like you.’</p><br/><p>Li Cangyu smiled frankly and said, “I wanted to confess to you. The result is that you acted first. I really didn’t see it. Ling Xuefeng, when did you start liking me? How come I didn’t know?”</p><br/><p>Ling Xuefeng stretched out and gently pulled Li Cangyu into his arms, whispering, “It has been a long time.”</p><br/><p>Li Cangyu was shocked. “What?”</p><br/><p>“I’ve liked you for a long time.” Ling Xuefeng’s voice was low and sexy. It slid through Li Cangyu’s ears like mellow wine and was especially fascinating at night.</p><br/><p>Ling Xuefeng slightly tightened his arms and placed his chin on Li Cangyu’s shoulder. Then he continued, “I don’t know when I started liking you but I liked you before you led your team away from Miracle.”</p><br/><p>“…” Li Cangyu’s mind was a mess because of the shocking truth. “Isn’t that three years?”</p><br/><p>“Yes, it was the reason I came to New York to talk to you. I didn’t just think of you as a friend.” Ling Xuefeng whispered.</p><br/><p>“…” Li Cangyu recalled the scene of that year which was still as clear as yesterday.</p><br/><p>Three years ago, Ling Xuefeng came alone to New York. Li Cangyu thought it was just the loyalty of a friend and hadn’t expected that Ling Xuefeng already liked him at that time.</p><br/><p>Ling Xuefeng ran all the way abroad to find him but he firmly said he was leaving Miracle…</p><br/><p>What did Ling Xuefeng feel as he returned to China alone? Li Cangyu didn’t dare think about it.</p><br/><p>Since Ling Xuefeng liked him, why didn’t he say anything earlier?</p><br/><p>Li Cangyu couldn’t help asking, “Why did you never tell me?”</p><br/><p>In the past few years after leaving Miracle, the two people hadn’t broken off contact. The text messages that Ling Xuefeng sent only seemed like concern between good friends. Li Cangyu was completely unaware that something wasn’t right.</p><br/><p>Ling Xuefeng was silent for a moment before explaining, “I know that you are busy and the pressure on your shoulders is big. I didn’t want to put any more burden on you.”</p><br/><p>“…” Li Cangyu’s heart trembled slightly and he didn’t know what to say.</p><br/><p>In the past few years, he was in dire straits. He faced accusations every day from the media and fans, while having to wrack his brain for the tactical arrangements of every game. The result was that no matter his effort, the Canglan team kept losing. Li Cangyu was in a calm state but inwardly, he was very anxious.</p><br/><p>If Ling Xuefeng had confessed to him at this time, it would’ve placed a greater psychological burden on him. Moreover, with his temper, perhaps the two of them wouldn’t even be friends anymore.</p><br/><p>Ling Xuefeng was undoubtedly very considerate. His beloved person was too busy so he chose to silently wait. He cared for the other person as a friend instead of exerting psychological pressure.</p><br/><p>It wasn’t until he realized that Li Cangyu held some liking for him that he voluntarily confessed. He acted in the same style that he used to play the game.</p><br/><p>Li Cangyu wasn’t stupid and quickly figured this out.</p><br/><p>Li Cangyu looked into Ling Xuefeng’s gentle eyes and warmth burst in his heart. The warm temperature flowed through his limbs, as if his body was bathed in the spring sun.</p><br/><p>It turned out that for the past three years, Ling Xuefeng had been silently waiting for Li Cangyu to return?</p><br/><p>It was no wonder that the moment they reunited in the Moonlight Forest district, Ling Xuefeng would say, “I have been waiting for you to come home.”</p><br/><p>Li Cangyu couldn’t help feeling moved. However, what if he was so disheartened that he wouldn’t play competitively anymore. What would Ling Xuefeng do? Wouldn’t it be empty to wait in vain for so many years?”</p><br/><p>Li Cangyu asked, “Were you so certain I would return to Miracle? What if I didn’t come back?”</p><br/><p>Ling Xuefeng smiled slightly and whispered, “With your nature, you won’t be willing to miss out on a trophy. The thing you love the most is the Miracle elf summoner. One day you would come back. Wasn’t I right?”</p><br/><p>“…” He was right.</p><br/><p>Li Cangyu’s eyes suddenly felt a bit sore.</p><br/><p>Ling Xuefeng was truly the person who knew him the best. Li Cangyu was so lucky that such a person silently liked him and waited for him to come back!</p><br/><p>Li Cangyu couldn’t help clinging to the other person and spoke earnestly, “It has been hard on you, waiting for me for so long.”</p><br/><p>The hugged Ling Xuefeng smiled and thought, ‘As long as I could wait for you, the hard work is worth it.’</p><br/><p>The two people stood by the window, hugging each other tightly. Fireworks dotted the beautiful sky, making the most beautiful celebration background in their minds.</p><br/><p>Li Cangyu was hugging and being hugged when he recalled that fascinating kiss just now. He couldn’t help looking up and saying, “You suddenly kissed me and I didn’t react. This time, I will kiss you?”</p><br/><p>Ling Xuefeng smiled at his shining eyes and reached out to touch Li Cangyu’s head. “Okay.”</p><br/><p>Strangely enough, touching his hair felt quite good. Ling Xuefeng couldn’t help touching it a bit more.</p><br/><p>Who dared to touch Cat God’s head?</p><br/><p>The small cats worshipped him as an idol while Uncle Zhang and A’Shu respected him. The person who was most familiar with him, Bai Xuan was short and couldn’t touch his head even if Bai Xuan wanted to.</p><br/><p>However, Ling Xuefeng’s movements were incredibly natural.</p><br/><p>After touching it, Ling Xuefeng moved his hand to the back of the head and narrowed the distance between them.</p><br/><p>Li Cangyu didn’t feel uncomfortable. Instead, his heart beat like a drum as he looked up at Ling Xuefeng’s lips. He couldn’t help pouncing, biting on those rosy lips and almost eating Ling Xuefeng’s mouth.</p><br/><p>Ling Xuefeng didn’t comment on Li Cangyu’s gnawing and biting kissing skills.</p><br/><p>Such a passionate big cat made Ling Xuefeng feel that this person was particularly straightforward and sincere. His heart softened as he was kissed. His fingers gently touched the back of Li Cangyu’s head as he actively guided Li Cangyu to open his teeth.</p><br/><p>“Oh… um…”</p><br/><p>Ling Xuefeng’s tongue plunged into his mouth and gently swept over his gums and teeth. Li Cangyu felt a bit itchy but there was a strange numbness that washed over his mind.</p><br/><p>Li Cangyu closed his eyes comfortably. He had long forgotten about who was active and who was passive.</p><br/><p>“Ah… um…uhh.”</p><br/><p>The kiss was too deep that Li Cangyu couldn’t help letting out ambiguous sounds.</p><br/><p>The result was that he was kissed and became intoxicated again.</p><br/><p>Once the kiss ended, Li Cangyu wiped and gasped as he looked at Ling Xuefeng. He asked with dissatisfaction, “Have you had a few boyfriends or girlfriends before?”</p><br/><p>Ling Xuefeng immediately clarified. “No, you are the first.”</p><br/><p>Li Cangyu glanced at him suspiciously. How could his kissing skills be so good?</p><br/><p>Ling Xuefeng seemed to guess his thoughts and whispered in his ears, “Do you feel comfortable when I kiss you?”</p><br/><p>He actually asked such a straightforward question!</p><br/><p>‘Ling Xuefeng, your image of the ‘icy abstinent male god’ is going to collapse, do you know? If your fans hear you say something like this, they will definitely turn black!’</p><br/><p>Li Cangyu felt his ears become hot and he replied cheekily, “It is okay, very comfortable.” Then he added, “You have to teach me. I will learn and kiss you until you are out of breath.”</p><br/><p>Ling Xuefeng agreed. “Good.”</p><br/><p>Li Cangyu declared, “I will come back to PK again.”</p><br/><p>The look in Ling Xuefeng’s eyes deepened. “Okay.”</p><br/><p>In any case, he would unconditionally agree to anything Cat God said.</p><br/><p>Li Cangyu looked at the handsome man in front of him and made a serious expression. He reached out to hold Ling Xuefeng and declared, “Xuefeng, I really like you.”</p><br/><p>Ling Xuefeng, “…”</p><br/><p>The always calm man couldn’t help being moved when he heard this. Tenderness overflowed from his eyes.</p><br/><p>There were more and more fireworks outside the window as many people celebrated the arrival of the new year.</p><br/><p>When Li Cangyu was young, his sister told him that on every big night, a wish could be realized when fireworks rose into the sky. After growing up, he hadn’t set off fireworks for a long time.</p><br/><p>Li Cangyu looked at the remaining fireworks on the ground and smiled. “Let’s keep lighting them until we finish this.”</p><br/><p>Ling Xuefeng nodded. “Yes.”</p><br/><p>He picked up a fireworks stick, handed it to Li Cangyu and lit it with the lighter.</p><br/><p>There was a whooshing sound as the fireworks emerged. Li Cangyu immediately made a silent New Year’s wish in his heart. ‘I wish that I can stay with Ling Xuefeng for a long time. I hope that the Canglan team can get great results in the upcoming seventh season and I hope that the Chinese team will win the World Competition.’</p><br/><p>These wishes would all require great effort to reach.</p><br/><p>In the new year, there were many important things waiting. This rare leisurely Spring Festival holiday, it was the best time for him to confirm his relationship with Ling Xuefeng.</p><br/><p>Once all the fireworks were released, Li Cangyu raised his head and demanded, “Kiss me again. Being together with you, I still feel that it isn’t real.”</p><br/><p>Ling Xuefeng, “…”</p><br/><p>This big cat was really active and straightforward.</p><br/><p>Still, Ling Xuefeng liked his initiative and directness. Li Cangyu wanted a kiss and didn’t hesitate.</p><br/><p>Ling Xuefeng smiled, reached out and kissed him.</p><br/><p>This kiss was much longer than the previous two times, as if to make up for three years of waiting. Ling Xuefeng’s kiss became fierce as his tongue swept through Li Cangyu’s mouth. It was like he wanted to directly swallow up Li Cangyu.</p><br/><p>Li Cangyu’s learning ability was strong and he quickly learned, enthusiastically kissing back.</p><br/><p>The two people shared a hot kiss. The cold wind blowing through the window couldn’t dampen their enthusiasm for each other.</p><br/>\n</div>"}