{"title": "Chapter 123", "id": 123, "volume": 2, "url": "http://boxnovel.org/god-level-summoner-chapter-123", "volume_title": "Volume 2", "body": "<h1>Chapter 123</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><hr/><br/><p>Chapter 123 – Zhuo Hang’s Background</p><hr/><br/><p>Speaking of the relationships in Zhuo Hang’s family, the world ‘complicated’ could be used to describe it.</p><br/><p>Zhuo Hang’s paternal grandfather had two younger sisters. The youngest sister was nearly 20 years younger and later, she married Su Jiasheng and had one son, Su Guangmo. From the blood relationship perspective, Su Guangmo’s uncle was Zhuo Hang’s grandfather and to Zhou Hang, Su Guangmo was the son of his grandfather’s sister.</p><br/><p>Tan Shitian was a relative of Zhuo Hang’s mother. Zhuo Hang’s mother was also surnamed Tan and Tan Shitian was her cousin. The age gap between Zhuo Hang and Tan Shitian wasn’t big and was still within one generation. Thus, Tan Shitian was Zhuo Hang’s maternal cousin.</p><br/><p>Zhuo Hang’s parents were born in a big family. Zhuo Hang was the only son and never had any grievances when growing up. This made him develop a confident nature with a high sense of superiority.</p><br/><p>Zhuo Hang’s grandfather might be in his 70s but his spirit was very good and he had a strong body. Every year, everyone had to go to his home to celebrate Chinese New Year. Zhuo Hang and Su Guangmo became familiar with each other from childhood, despite being separated by a familial generation. Their ages were similar and they had a common language. When they were young, they piled wood together, played with trains and swam together.</p><br/><p>Su Guangmo’s personality was refreshing and he didn’t care much about generations. He always treated Zhou Hang as a younger brother. Their relationship lasted from childhood to adulthood and were more like friends.</p><br/><p>On Tan Shitian’s side, Zhuo Hang often saw him when visiting his maternal grandfather’s house.</p><br/><p>Tan Shitian had a gentle personality, was handsome and had a good sense of humour. He often told funny jokes and his stories were more interesting than novels. As a child, he often told stories to amuse Zhuo Hang, thus Zhuo Hang also had a particularly good relationship with Tan Shitian.</p><br/><p>Speaking of which, Su Guangmo and Tan Shitian actually met each other before the league.</p><br/><p>Four years ago, Zhuo Hang’s father had a car accident while on a business trip. He had to rest at home after surgery and relatives naturally came to visit. Su Guangmo and Tan Shitian happened to come over on the same weekend and met each other at Zhuo Hang’s home.</p><br/><p>There was no blood relationship between Su and Tan but Zhuo Hang introduced them, causing the two of them to quickly becoming familiar with each other.</p><br/><p>After dinner, Zhuo Hang proposed that they play basketball and the three people went to the court to practice. Su Guangmo found that Tan Shitian’s skills weren’t bad. The two of them stayed in contact with each other and would play basketball together when they had the chance.</p><br/><p>At that time, Su Guangmo was already a newcomer in the Flying Feathers team. Tan Shitian hadn’t yet debuted and was just a small rookie in the online game.</p><br/><p>Later, Tan Shitian formed a strong interest in Miracle and his level was getting higher. He wanted to play in the professional league and asked Su Guangmo about the situation of the Miracle League.</p><br/><p>Su Guangmo was the captain of the Flying Feathers team but Flying Feathers was a melee team with the swordsmen as the main force. It was useless for Tan Shitian’s archer to join Flying Feathers. The Time team was focused on long-range player and Su Guangmo gave Time’s old captain Xu Luo a private recommendation, allowing Tan Shitian to have a direct interview with Captain Xu.</p><br/><p>Xu Luo appreciated Tan Shitian’s talent and nature and recruited him as an apprentice.</p><br/><p>Tan Shitian debuted in the fourth season and successfully won the Best Newcomer Award. Then he become the Time team’s captain after Xu Luo’s retirement in the fifth season. He became the youngest captain of the new generation of Miracle League players.</p><br/><p>The media wasn’t aware that Su Guangmo and Tan Shitian had this relationship. The reporters just thought that they two people disliked each other. Every time the reporters asked Tan Shitian who the most annoying player was, he would smile and say, “Of course the person I dislike most is Su Guangmo. It is too annoying to be chased and killed by a swordsman.” When a reporter asked Su Guangmo the same question, Su Guangmo would say, “The one I dislike the most is the archer Tan Shitian. The remote kiting is too annoying.”</p><br/><p>Think carefully. If they weren’t familiar with each other, would it be possible for them to publicly say words that would offend the other person?</p><br/><p>Not long ago, Su Guangmo and Tan Shitian had a very good understanding in the basketball event and won a small award. People thought it was because they both played basketball. They completely didn’t know that Su Guangmo and Tan Shitian had been friends for several years, playing together since they met through Zhuo Hang.</p><br/><p>Whenever Su Guangmo and Tan Shitian were together, in addition to playing basketball, they would talk a lot about the Miracle League. Zhuo Hang became curious and went online to check. He knew that these two were Miracle professional players and under their influence, he also fell in love with the Miracle game.</p><br/><p>He was a bit talented himself and studied for a year. His standards soared and he had no rivals in the online game.</p><br/><p>Zhuo Hang felt that both Su Guangmo and Tan Shitian were great gods in the Miracle League. They certainly weren’t bad but he knew that neither the Flying Feathers team or the Time team needed an elf hunter. He wanted to find a team himself and maybe he would one day be the captain!</p><br/><p>He was filled with these dreams and confidence as he looked for a team in the league to accept him.</p><br/><p>On the day that Cheng Wei forwarded Cat God’s recruitment post, Tan Shitian also forwarded it. Zhuo Hang saw this message on Tan Shitian’s Weibo and didn’t hesitate to recommend himself to Cat God. His talents were indeed appreciated by Cat God and he formally became a professional player.</p><br/><p>Only, his superiority was too strong and his tail too high. He fell to the ground in the first game.</p><br/><p>***</p><br/><p>Li Cangyu had no doubt that Zhuo Hang had a relationship with Tan Shitian and Su Guangmo. He asked Ling Xuefeng and Ling Xuefeng said that he didn’t know Zhuo Hang. Thus, he asked Zhuo Hang whether he knew Su Guangmo and Tan Shitian, following the order of the league’s most popular players.</p><br/><p>The result was that Zhuo Hang really knew them!</p><br/><p>If he didn’t know them, he would definitely say it. Not only did he not refute Li Cangyu’s words, he lowered his head when Su Guangmo and Tan Shitian were mentioned. This was too obvious!</p><br/><p>Li Cangyu couldn’t help raising his eyebrows when he saw this boy’s head move lower and lower. He asked, “You don’t want to say it? Should I call Su Guangmo and Tan Shitian right now to confirm it?”</p><br/><p>“Don’t!” Zhuo Hang immediately looked up. “Don’t call them.”</p><br/><p>“Then tell me exactly what is your relationship with them?” Li Cangyu was very curious about this. It was no wonder that Xiao Zhuo had such a strong sense of superiority if he had two gods like Su Guangmo and Tan Shitian at home. It was natural to be confident.</p><br/><p>“Er…” Zhuo Hang scratched his head and whispered, “Su Guangmo is the son of my paternal grandfather’s sister and Tan Shitian is my mother’s cousin. Cough, it is complicated…”</p><br/><p>This might sound complicated but Li Cangyu understood. Su Guangmo was a relative of Zhuo Hang’s father while Tan Shitian was a relative of Zhuo Hang’s mother. Su and Tan had no blood relationship.</p><br/><p>Zhuo Hang’s age wasn’t much younger than Tan Shitian and Su Guangmo but they were in different generations.</p><br/><p>It seemed that a player qualified to ‘enter the Miracle League at the bottom’ had finally appeared. The other players were mostly a younger brother generation while Zhuo Hang came out and was in a completely different generation from his relatives.</p><br/><p>Tan Shitian was Zhuo Hang’s maternal cousin then Cheng Wei, who was Tan Shitian’s peer, would be also be Zhuo Hang’s maternal cousin!</p><br/><p>Li Cangyu couldn’t help laughing at this thought and asked, “Then do you usually call Su Guangmo by Uncle (father’s younger brother)? Do you call Tan Shitian by Uncle (mother’s brother)?”</p><br/><p>“Hmm…” Zhuo Hang hung his head with red ears.</p><br/><p>There was no other way. Who told him to be born in a home with such a complicated family tree? He didn’t clearly know his uncles and aunts. He always called Su Guangmo and Tan Shitian by Uncle, causing him to be scolded many times by the elders.</p><br/><p>Li Cangyu stood up and walked to Zhuo Hang. “Captain Tan and Captain Su must’ve seen today’s game. Do you believe me?”</p><br/><p>Zhuo Hang, “…”</p><br/><p>Many players in the professional league were watching Cat God’s return. The two captains were bored so it was normal for them to watch the second division. Zhuo Hang’s head hung ever lower when he thought of this and he almost cried.</p><br/><p>Li Cangyu asked curiously, “Did you tell them about the Canglan team?”</p><br/><p>Zhuo Hang made an awkward expression. “I didn’t tell them.”</p><br/><p>Li Cangyu smiled. “Then won’t they be very surprised right now?”</p><br/><p>As soon as these words were heard, Zhuo Hang’s phone rang. The caller ID was Su Guangmo.</p><br/><p>Zhuo Hang awkwardly picked up the call. It had just connected when a man’s refreshing voice was heard. “Xiao Hang, the elf hunter from Canglan who played particularly badly in today’s arena, was that you?”</p><br/><p>The elf hunter who played particularly badly… Captain Su was really direct!</p><br/><p>Zhuo Hang looked at Li Cangyu with embarrassment.</p><br/><p>Su Guangmo continued to ask, “Why did you suddenly run to the Canglan team?”</p><br/><p>Zhuo Hang, “…”</p><br/><p>Su Guangmo frowned. “Speak!”</p><br/><p>Zhuo Hang explained with a bitter expression, “I want to play in the professional league as well. I just tried it…”</p><br/><p>Su Guangmo suddenly realized. “No wonder why you were hiding and secretly sending text messages during the Spring Festival. I thought you had a girlfriend but you were sneaking around to play competitively!”</p><br/><p>Zhuo Hang, “…”</p><br/><p>Su Guangmo said, “I really can’t bear to watch you play the game. You were literally abused by the other side. You ran to Cat God’s team but are you sure you won’t be driven out by Cat God? A newcomer’s tail is so high that you aren’t afraid to step onto air and fall into the mud. If I was Cat God, I would make you look at the keyboard all night as reflection!”</p><br/><p>Zhuo Hang, “…”</p><br/><p>The young boy looked at Li Cangyu with a wronged expression.</p><br/><p>Li Cangyu was very happy when he heard Su Guangmo scolding his small nephew on the phone. It seemed he didn’t need to come forward. Su Guangmo would first scold the arrogance out of this child.</p><br/><p>Su Guangmo spoke a few more sentences before finally hanging up. Then Zhuo Hang’s phone rang again. This time, the caller ID was Tan Shitian.</p><br/><p>Zhuo Hang held the phone and didn’t know what to do. Li Cangyu smiled and ordered, “Pick it up.”</p><br/><p>“…” Zhuo Hang was forced to pick up the call.</p><br/><p>A gentle voice entered his ears, “Xiao Han, why are you in the Canglan team?”</p><br/><p>Tan Shitian had something to do today and didn’t watch the live broadcast of the match between Canglan and Dream.</p><br/><p>Once he came back in the evening, he was caught by the brainless fan Cheng Wei and watched a replay of the game. Cheng Wei kept boasting about how handsome and cool Cat God was but Tan Shitian’s eyes were fixed on a little boy with a proud face in the soundproof room.</p><br/><p>Wasn’t this person Zhuo Hang? How did he appear in the Canglan team?</p><br/><p>Tan Shitian was full of questions and immediately called his small nephew. “You didn’t tell me that you wanted to be a professional player. How did you suddenly join Cat God’s team?”</p><br/><p>Zhuo Hang explained, “I usually watch you play and wanted to try it myself.”</p><br/><p>“The professional league isn’t as simple as your think. Your current level is still a bit worse than good professional players.” Tan Shitian said with a smile, “I’m not against you playing competitively but you have to be clear about your strength and don’t be overly proud. I saw your arena games today and you played badly. You have to practice more.”</p><br/><p>Zhuo Hang nodded. “Yes…”</p><br/><p>“Cat God is a good captain. Follow him and study hard.” Tan Shitian spoke softly, “Many competitors are better than you. You are new and should have a humble attitude. When you played Miracle with me, I didn’t say anything when you made mistakes because you are my family, not a team member. However, the team is different. Since you have become a professional player, you must be serious. Cooperate with your teammates and integrate with the team as soon as possible. Understood?”</p><br/><p>Tan Shitian was the youngest and gentlest captain in the Miracle League. Even when teaching the team, he usually spoke in this kind and cordial tone. He was reasonable but spoke enlightening words. Thus, the players were convinced about this despite his young age.</p><br/><p>Cheng Wei listened to him talk on the phone and couldn’t help asking curiously, “Do you know Zhuo Hang?”</p><br/><p>Tan Shitian smiled and explained, “He is my nephew.”</p><br/><p>Cheng Wei was immediately excited. “Ah? Then I am your peer and he is my junior. Hahaha, my seniority is upgraded!”</p><br/><p>Tan Shitian saw his happy expression and couldn’t help rubbing Cheng Wei’s head, thinking, ‘You really have to upgrade generations. After all, you will be my wife in the future.’</p><br/><p>Cheng Wei didn’t know Tan Shitian’s thoughts and was studying the relationship between Zhuo Hang and Tan Shitian.</p><br/><p>Zhuo Hang was red-faced and a bit stunned. His head dropped as he said, “I understand…”</p><br/><p>Tan Shitian suddenly asked, “Didn’t Cat God scold you?”</p><br/><p>Zhuo Hang looked up at Li Cangyu. He thought, ‘Cat God hasn’t scolded me yet. You and Su Guangmo took turns to call and scold me!’</p><br/><p>Tan Shitian saw that there wasn’t an immediate reply and guessed, “Is Cat God next to you?”</p><br/><p>Zhuo Hang whispered, “Yes…”</p><br/><p>Tan Shitian ordered, “Give him the phone.”</p><br/><p>Zhuo Hang handed the phone to Li Cangyu who accepted it. “Captain Tan is looking for me?”</p><br/><p>Tan Shitian touched his nose and spoke somewhat awkwardly, “My Xiao Hang isn’t sensible and brought Cat God trouble.”</p><br/><p>“It isn’t a problem.”</p><br/><p>Tan Shitian continued, “This child’s nature isn’t bad. He is too arrogant because he is an only child. He is used to being spoiled by his family. He is now an adult so Cat God shouldn’t be polite with him.”</p><br/><p>Li Cangyu glanced at Zhuo Hang and smiled. “Of course. Leave it to me.”</p><br/><p>Then Cheng Wei’s excited voice filled his ears. Apparently he had stolen the phone. “Cat God, Cat God, your performance in today’s match was as handsome as always! Super god is too handsome! Quickly finish playing the second division. The first division starts in May and I want to see you on the field!”</p><br/><p>Li Cangyu smiled.”Yes, I will.”</p><br/><p>He hung up and returned the phone to Zhuo Hang. Then Li Cangyu patted the teenager’s shoulder and stated, “Captain Su and Captain Tan have finished their calls. Is it my turn?”</p><br/><p>Zhuo Hang, “…”</p><br/><p>He could imagine that every time he made a mistake, Su Guangmo would scold him, Tan Shitian would speak to him, Cat God would train him…</p><br/><p>Wasn’t his sense of superiority actually an illusion?</p><br/><p>He was the real ‘bottom of the Miracle League’ player.</p><br/><p>Other people would only be scolded by their captain for a mistake. If he made a mistake… he would be scolded by three captains…</p><br/>\n</div>"}