{"title": "Chapter 125", "id": 125, "volume": 2, "url": "http://boxnovel.org/god-level-summoner-chapter-125", "volume_title": "Volume 2", "body": "<h1>Chapter 125</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 125 – New Roommate</p><hr/><br/><p>TL: Bonus ko-fi chapter</p><hr/><br/><p>The first match against the Dream team ended with a score of 10:4. This result soon became hot news on the major e-sports websites. Many media reporters were concerned about the movements of Cat God’s new team. Cat God’s team battle was widely praised while Zhuo Hang and Li Xiaojiang’s erratic play in the arena stage was questioned by many netizens.</p><br/><p>There were many e-sports reporters who wanted to interview Li Cangyu. The second division didn’t have rules for interviews after matches. Due to the tight schedule, it was up to the players to decide if they wanted to accept an interview or not. Li Cangyu didn’t want to let the media’s attention affect the state of the teenagers and declined all interview requests.</p><br/><p>It was still early after he finished his evening scolding of Zhuo Hang. Li Cangyu summoned the players to his room for a small meeting. He gave a brief summary of today’s performance and gave special praise to Xiao Han who played well in the team battles.</p><br/><p>He had spoken privately to Zhuo Hang and Li Xiaojiang and it wasn’t good to say anything in front of everyone else. Li Cangyu skipped them and focused on analyzing the game tactics.</p><br/><p>“Today’s splitting up tactics achieved remarkable results. This is a bold attempt and there will be more tactical changes in the future. As long as we keep up with the commands and cooperate with each other, I believe that the new system can’t beat us.” Li Cangyu spoke confidently.</p><br/><p>Bai Xuan smiled. “It seems that this new system isn’t really complicated. It is just that the map is divided into four wild areas and the grouping methods will be more varied than with the old system. Moreover, killing an opponent will give 500 crystal coins, which is equivalent to killing 10 small mobs. Killing people to make money is faster than killing the mobs.”</p><br/><p>Xie Shurong immediately agreed. “Vice-Captain Bai is right!”</p><br/><p>Bai Xuan continued, “In the future team battles, try to kill people. If you don’t meet any opponents, focus on killing the mobs. The new system uses the ‘economic warfare’ as the core. If you have money then you can strike. If you don’t have money, you can only be abused.”</p><br/><p>Xie Shurong continued to nod. “Vice-Captain Bai is right!”</p><br/><p>Bai Xuan couldn’t help looking at him. “You are praising me so much. Are you hungry again?”</p><br/><p>The thick-faced Xie Shurong said, “I want to eat the ribs made by Vice-Captain Bai. When will we go back to Changsha?”</p><br/><p>Bai Xuan rolled his eyes. “According to this schedule, we have no time until next week.”</p><br/><p>Li Cangyu added, “Next week, we have two matches. On Friday, we can collectively go back to the club to take a change of clothes. Later, try to go back as little as possible. After all, running back and forth is energy-consuming.”</p><br/><p>Zhang Jueming agreed. “Yes, we should just wait until the second division finishes before going back. The hotel costs are all paid by the league and I really hate going back and forth with the high-speed rails.”</p><br/><p>The proposal was endorsed by the group.</p><br/><p>Li Cangyu went on to say, “I believe that everyone should be clear about the new system after today’s match. The level of the second division isn’t strong but we can’t be careless. The regular season is ranked by total points. Every match, regardless of whether it is the arena or team battle, try to get as many points as possible for the final qualifiers.”</p><br/><p>The group nodded seriously.</p><br/><p>“In the regular season, I will let old and new players alternate playing in the arena to give new people more opportunities to learn and practice. In the next game, A’Shu and Xiao Li will play the arena. Zhuo Hang doesn’t have to play. A’Shu will give you a demonstration so watch closely and study seriously. The match after that one, I will have you continue to cooperate with Li Xiaojiang in the arena. Do you understand?”</p><br/><p>Li Cangyu’s method of letting a new person cooperate one and then replacing them with an old player was to let the newcomers learn more things. Otherwise, the newcomers’ heads would be dull and they would head into a dead end they couldn’t escape from.</p><br/><p>Zhuo Hang immediately nodded and cried out, “I understand!”</p><br/><p>Li Xiaojiang also said, “I, I understand.”</p><br/><p>Li Cangyu added, “There is still one thing. After this meeting ends, Zhuo Hang and Gu Siming will change rooms. Later, Xiao Zhuo and Xiao Li will live together, Xiao Gu and Xiao Han will live together. The four of you are the same age. If you have something to say, don’t keep it stewing in your heart. I hope the four of you can get along well and get to know each other better so that you can trust each other on the field.”</p><br/><p>The four youngsters nodded. “Yes!”</p><br/><p>Li Cangyu smiled with satisfaction. “Okay, go back and rest.”</p><br/><p>***</p><br/><p>After returning to the room, Xiao Han lay in bed and held his notebook while watching a TV series.</p><br/><p>He had lived in the US for many years and hadn’t see a Chinese TV drama for a long time. He was curious and had just watched 80 episodes of Romance of the Three Kingdoms. He recently started watching Outlaws of the March. He looked at the costume drama with a serious expression like it was an ‘academic research report’, making Zhuo Hang feel strange.</p><br/><p>Zhuo Hang walked to the bed and stood there a while. Xiao Han raised his head to look at Zhuo Hang. Then he lowered it and continued to study the TV drama, treating Zhuo Hang like he was air.</p><br/><p>Zhuo Hang wondered, “Why aren’t you asking me what Cat God told me in private?”</p><br/><p>Xiao Han glanced at him and quietly said, “Didn’t Cat God scold you? Since he has already scolded you, I don’t want to mention this incident and make you sad. Qin Mo called this sprinkling sugar on the wound?”</p><br/><p>Zhuo Hang’s chest felt stuffy. “It is sprinkling salt… sprinkling salt!”</p><br/><p>Xiao Han mused, “Isn’t it the truth to sprinkle sugar on a wound? Will sprinkling sugar hurt?”</p><br/><p>Zhuo Hang sincerely suggested, “You should find a Chinese teacher.”</p><br/><p>Then he turned back to his bed and packed in a depressed manner.</p><br/><p>This time, he came from Changsha to Guangzhou. Apart from occasional trips to the club on weekends, most of the time he would be staying here. Therefore, Zhuo Hang had a lot of luggage. There was a change of clothes, a SLR camera, iPad for playing games, laptop, umbrella, etc.</p><br/><p>Zhuo Hang might have an arrogant nature but he was careful when living. This was because he had a father who travelled all year for business and an unreasonable mother. As he grew up, he slowly learned how to care for himself and had daily necessities like band-aids and cold medicine.</p><br/><p>Xiao Han kept watching the TV. Once he saw that Zhuo Hang had finished packing, Xiao Han couldn’t help saying, “I might not be good at Chinese but you can understand most of what I am saying right? I think that sprinkling salt and sprinkling sugar will both cause pain and inflammation of the wound. Then why do you say sprinkling salt in Chinese?”</p><br/><p>Zhuo Hang, “…”</p><br/><p>Help, wasn’t there anyone slightly normal among his peers in the team?</p><br/><p>Xiao Han’s brain circuits were different from everyone else. Zhou Hang didn’t know what he was thinking about all day in that golden head of his!</p><br/>\n</div>"}