{"title": "Chapter 136", "id": 136, "volume": 2, "url": "http://boxnovel.org/god-level-summoner-chapter-136", "volume_title": "Volume 2", "body": "<h1>Chapter 136</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 136 – Playoffs</p><hr/><br/><p>The Canglan team was third in the rankings and their first opponent in the semi-finals of the playoffs was the second ranked Glory team.</p><br/><p>The rules of the playoffs of the second division were different from the regular season. It was no longer a two victory per stage model. Instead, it used the last one remaining elimination system. This meant that each team would send three sets of partners. If they could last to the end, they would win one point.</p><br/><p>The rules of the team battle were similar to the regular season but winning also only counted as one point.</p><br/><p>The schedule was: Team A selected a map to play the arena and team battle. Then it would be exchanged with Team B selecting a map for the arena and team battle. If they tied in these four games, there would be a random map selection for a team battle.</p><br/><p>It could be seen that one point in the playoffs was more precious than five points in the regular season.</p><br/><p>The playoffs used the five games, three wins system. Regardless of arena or team battle, whoever took three games would win.</p><br/><p>This rule change was similar to the playoffs of the first division and the World Competition, making the arena as important as the team battle. Moreover, the three rounds partner system paid attention to the cooperation cooperation between partners.</p><br/><p>If the playoffs, anyone who lost would immediately be eliminated.</p><br/><p>The strength of the Canglan team wasn’t weak and the youngsters had matured after the regular season’s training, but Li Cangyu didn’t dare act carelessly. If he made a mistake and they lost a match in the playoffs, everything they did would be in vain. Don’t even talk about the World Competition, even the promotion qualification to the first division would be lost.</p><br/><p>They must win the championship of the second division!</p><br/><p>This was the goal that Li Cangyu emphasized in the pre-match meeting.</p><br/><p>The lineup of the Glory team was based on a melee output. Li Cangyu studied the configuration of their members with Old Zhang, Ah Shu and Bai Xuan before finalizing the arena combinations.</p><br/><p>The Canglan team chose a forest map to let Xiao Zhuo and Xiao Li take the lead. Xiao Han and Ah Shu would be the middle team and the Li Cangyu and Zhang Jueming combination would finish it off.</p><br/><p>This arrangement could be regarded as a double insurance. Even if the opening pair of Zhuo Li fell into a disadvantage, there was Ah Shu in the middle to stabilize the situation. Finally, Li Cangyu would personally end it to ensure they wouldn’t lose the arena.</p><br/><p>During the team battle, Li Cangyu also had all four old players participate in order to minimize the error rate.</p><br/><p>***</p><br/><p>Since all four veterans of Canglan played, there was no suspense in this semi-final game. They won three games in a row with a big score of 3:0!</p><br/><p>Two days later, the Canglan team would play in the finals of the second division and the opponent was the Yaohua team.</p><br/><p>In the regular season, Li Cangyu’s state was affected by his cold and there was a big loss to Yaohua. This team was the strongest team in the second division and the captain and vice-captain were experienced veterans who had played for several years.</p><br/><p>Li Cangyu still wasn’t worried.</p><br/><p>In the first arena round, he directly had Zhuo Li and Xiao Gu go out to compete. It was a rare opportunity in the finals to train their psychological tolerance. Of course, he would be the final guard pair with Old Zhang.</p><br/><p>The match was much harder than the last one because it was for the championship of the second division and to gain the ticket for the first division.</p><br/><p>In the first round, the four young players were probably too nervous. The disadvantages in the early stages were too great so that even Li Cangyu couldn’t gain back the situation despite his personal strength. The team unexpectedly lost and the score was 0:1.</p><br/><p>In the team battle, the four old players joined forces. Bai Xuan and Xie Shurong were people who had experienced various competitions and were stable. Old Zhang’s psychological state was relatively strong, not to mention Li Cangyu who wasn’t even afraid of the World Competition.</p><br/><p>The four of them joined hands to pressure the opponents and quickly pushed to the crystal, gaining one point and making it a 1:1 draw.</p><br/><p>In the third game, Li Cangyu changed his mind and replaced the Zhuo Li and Gu Xiao duos. He had Ah Shu with Xiao Zhuo, Xiao Han with Old Zhang and he personally took Li Xiaojiang to end it.</p><br/><p>There was a great god with them and the youngster’s mental state was robust. The rounds were played very smoothly. Once Li Cangyu appeared, the two people opposite him were already in residual blood from Xiao Han. Li Cangyu successfully completed the harvest and a big 2:1 filled the screen.</p><br/><p>As long as they won another game, the finals would be won!</p><br/><p>Li Cangyu had been close to the trophy many times since becoming a professional player but missed it due to a variety of reasons…</p><br/><p>This time, he wouldn’t let the opportunity go!</p><br/><p>Li Cangyu took a deep breath and gathered his teammates together. He said simply, “This is our match point. If we win this game, we won’t have to play the fifth game. Everyone, go all out and make it quick!”</p><br/><p>The people who won two games were encouraged and became excited.</p><br/><p>In the crucial second team battle, Li Cangyu sent the most stable lineup of himself, Xiao Gu, Xiao Han, Bai Xuan, Xie Shurong and Old Zhang.</p><br/><p>The Gu Xiao Shu were in the front row for a rapid impact and Li Cangyu used violent suppression from behind. There was also Bai Xuan’s stable healing and Old Zhang’s flexible assistance. The Canglan team was really quick and finished the battle in just 20 minutes.</p><br/><p>It was a big score of 3:1! The Canglan team won!</p><br/><p>Once the golden ‘victory’ popped on the screen, Li Cangyu’s performance was calmer than many reporters expected. He just smiled slightly before getting up to gently hug his teammates. The four teenagers jumped with joy while Li Cangyu was calm, as if winning was already expected.</p><br/><p>In the seventh season of the Miracle League, the champion of the second division was the Canglan team.</p><br/><p>This could be counted as the first trophy in Li Cangyu’s career.</p><br/><p>He led the FTD team from the first season of the Miracle League and then later transferred to Wulin. For the three years in Miracle and the three years in Wulin, he never won any team trophies.</p><br/><p>Now that he obtained one, the expression on his face was unusually calm.</p><br/><p>It was because his goal was far beyond this! The champion of the second division, this was just a staged victory and it was only halfway along his path. He wasn’t satisfied and had to move on.</p><br/><p>***</p><br/><p>Once Li Cangyu led his team members over to shake hands, Captain Wei Hua of the Yaohua team took his hand and seriously told, “Cat God, I hope that you can win the championship of the first division, so that Yaohua losing to you won’t be an injustice.”</p><br/><p>Li Cangyu patted him on the shoulder and smiled. “I will try my best.”</p><br/><p>The players in the second division weren’t as strong as the gods in the first division. However, Li Cangyu knew that they worked hard for the same goal and they deserved respect.</p><br/><p>The second division ended and the awards ceremony was held directly at the venue. The president of the Miracle League’s Organizing Committee personally handed him the trophy for the second division. He patted Li Cangyu’s shoulder emotionally and said, “Old Cat, you did well.”</p><br/><p>Li Cangyu took the trophy and raised the first trophy in his career to the cheers of the audience.</p><br/><p>The host excitedly asked Li Cangyu, “Cat God, this is the first time you have received a trophy. Do you have any thoughts?”</p><br/><p>Li Cangyu smiled. “This is indeed the first trophy since I became a professional player but there is still the promotion match and more competitive league waiting for us. I won’t be complacent because there are more challenges waiting for me.”</p><br/><p>There were more challenges waiting for him. This obviously meant he was coming back to challenge the giants in the first division!</p><br/><p>The Wind Colour team’s dormitory.</p><br/><p>Ling Xuefeng saw the bright and firm eyes on the computer screen and couldn’t help smiling. He thought inwardly, ‘I have been waiting for you to come back. The first division is the real venue to prove your strength.’</p><br/><p>In the second division of the seventh season, the Canglan team won the championship, a result expected by many reporters.</p><br/><p>The rapid growth of the several newcomers in the Canglan team showed that the overall strength of the team had improved one step from the beginning.</p><br/><p>Now the Canglan team wouldn’t necessarily lose to some teams in the first division.</p><br/><p>Cat God’s ambition wasn’t small and he was looking long-term.</p><br/><p>Now that he returned, it was naturally impossible for him to be satisfied with being the champion of the small second division.</p><br/><p>This trophy was too small to prove his true strength. He repeatedly sent out the young players in the middle and late stages to prepare for the first division. He was obviously determined that he would be the champion of the second division.</p><br/><p>Of course, he must win the next promotion match!</p><br/>\n</div>"}