{"title": "Chapter 145", "id": 145, "volume": 2, "url": "http://boxnovel.org/god-level-summoner-chapter-145", "volume_title": "Volume 2", "body": "<h1>Chapter 145</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 145 – Canglan VS Time (Arena Battle)</p><hr/><br/><p>Li Cangyu often had Bai Xuan and Xie Shurong play together in the second division. However, the strength of the second division wasn’t high and Xie Shurong quickly took care of the outputs in the front row. Bai Xuan only needed to follow him as a soy sauce.</p><br/><p>Today, during the chaos of the game against Time, Xie Shurong suddenly turned back to him. A scene of the FTD team against the Flying Feathers team flashed through Bai Xuan’s mind. It was the scene of the swordsman rushing to kill him. Bai Xuan was chased throughout the whole game and was killed 10 times!</p><br/><p>Bai Xuan had often lost since his debut but he only once encountered the tragic situation of being killed 10 times in one game. He had a psychological shadow towards a swordsman rushing towards him. Every time he saw a swordsman coming over, he wanted to hide. Thus, he reflexively hid when Ah Shu rushed over to protect him.</p><br/><p>Li Cangyu put them in the arena to cure Bai Xuan of this ‘reflexively hiding from Ah Shu.’</p><br/><p>Xie Shurong really wanted to cry. What could he do if his family’s dad treated him as a murderer?</p><br/><p>He looked at Bai Xuan’s apologetic eyes and the bit of temper he had disappeared. “You can’t hide when we’re in the arena!”</p><br/><p>Bai Xuan smiled apologetically. “Yes.”</p><br/><p>Xie Shurong looked at this smile and couldn’t help thinking, ‘His smile is really nice to see. How can there be such a gentle and beautiful man?’</p><br/><p>Bai Xuan saw Ah Shu staring at him and touched his nose with embarrassment. “Don’t stare angrily at me. Conditioning is hard to change but I will try to overcome it.”</p><br/><p>Who was staring angrily? He obviously thought Bai Xuan was handsome… Xie Shurong immediately removed his gaze and concealed his cough. He asked Li Cangyu, “Cat God, will Bai Xuan and I come out in the first round? Or do you want the little guys to start first?”</p><br/><p>The four teenagers raised their heads at the same time and stared at Li Cangyu.</p><br/><p>Li Cangyu couldn’t help smiling. “This is the first match of the first division. I will give each player a chance to participate in such a memorable game. Therefore, the four round of the arena will be… the Zhuo Li combination.”</p><br/><p>Li Xiaojiang’s eyes brightened.</p><br/><p>Zhuo Hang was more direct and rushed over to hug Li Cangyu. “Cat God, thank you!”</p><br/><p>The Zhuo Li combination hadn’t played in the team battle. They had to sit under the stage and watch their teammates play. Li Xiaojiang wasn’t very talkative but he was looking forward to playing. Now Li Cangyu gave him this opportunity. He gratefully looked at the captain and then back at Zhuo Hang. “Zhuo, Zhuo Hang, I want, want to say…”</p><br/><p>“Come on!” Zhuo Hang helped him fill the second half of the sentence. He touched Li Xiaojiang’s hand in a cheer and smiled. “We will win.”</p><br/><p>The handsome face in front of him was slightly immature but the confident words made Li Xiaojiang feel an inexplicable sense of peace. No matter if he won or lost, Zhuo Hang would accompany him. Their combination might not be strong but they worked hard together.</p><br/><p>***</p><br/><p>The Canglan team submitted their lineup while Tan Shitian also submitted the map to the referee.</p><br/><p>It was still the Elf Fantasyland. The netizens were mixed about this map being used for all three games. Yu Bing said calmly, “The Elf Fantasyland map is very beneficial for archers. The Time team is obviously skilled in this map, making it normal to use it for all three games.”</p><br/><p>Kou Hongyi’s gaze was focused on the players list of both sides. “For the first round, the Canglan team sent Zhuo Hang’s hunter and Li Xiaojiang’s black magician. Time sent Zhou Yu’s hunter and Lu Xiao’s archer. This way, both hunters can use traps to interfere with the other. The key to winning or losing depends on the main output.”</p><br/><p>Yu Bing examined the data of both sides and said, “Li Xiaojiang is focused on attack but the speed of his skills release is very slow. Lu Xiao is the strongest elf archer in the league apart from Tan Shitian. If Lu Xiao relies on his rapid kiting to interrupt Li Xiaojiang’s casting, the Zhou Li combination will find it difficult to win.”</p><br/><p>As they spoke, both teams already appeared on the Elf Fantasyland map.</p><br/><p>There wasn’t a ‘’ field like in the team battles but the map was still in a square structure. The map had no obvious central area and was covered with trees. It was possible to fight wherever they wanted and it was also suitable for hide and seek. Fortunately, the map area was small. Even if a player hid, they could be easily found by the opponents.</p><br/><p>Zhuo Hang and Li Xiaojiang rushed to the middle of the map and didn’t see the opponent’s figures. A sharp arrow was fired from a distance. Zhuo Hang was in front and lost 10% after being struck by the arrow.</p><br/><p>This wasn’t a high amount of damage but it made Zhuo Hang very uncomfortable. He didn’t see the enemy at all but was shot with an arrow. It was really depressing!</p><br/><p>Su Guangmo sat in the audience and couldn’t help saying, “This kid will probably suffer a big loss!”</p><br/><p>Yu Pingsheng looked over at him with confusion. Su Guangmo saw his curiosity and couldn’t help confessing, “The Zhuo Hang on the Canglan team, he is my nephew.”</p><br/><p>Yu Pingsheng’s face showed a hint of surprise but he didn’t say much. He just nodded and said, “Oh.”</p><br/><p>This brother never liked to talk. He saw and watched the game like an invisible person.</p><br/><p>Su Guangmo didn’t explain much and muttered to himself, “The Canglan team shouldn’t send the Zhou Li combination. This is obviously a disadvantageous situation. What type of medicine is Cat God selling? The archer’s attack distance is nearly a metre further than the black magician. As long as the archers attack Li Xiaojiang, he won’t be able to cast his skills at all.</p><br/><p>Yu Pingsheng listened silently and nodded in agreement after listening to his brother.</p><br/><p>Su Guangmo looked over at him. “Do you think Cat God is using this opportunity to train Zhuo Hang’s psychological quality?”</p><br/><p>Yu Pingsheng thought for a moment before replying, “Yes.”</p><br/><p>“…” Su Guangmo felt helpless. He thought so long just to say one word?</p><br/><p>Yu Pingsheng’s communication issues were serious but Su Guangmo still liked to talk to him. It was great so see him seriously speaking after a long time. Su Guangmo couldn’t help smiling as he patted Yu Pingsheng’s shoulder. “I also think that Cat God should be giving these two teenagers a chance to play in the first match.”</p><br/><p>***</p><br/><p>As the two people were chatting, the Zhuo Li combination had completely fallen into a disadvantage.</p><br/><p>Sure enough, it was as Su Guangmo said. The archer Lu Xiao was very clever and stared at Li Xiaojiang to interrupt the black magic casting. Li Xiaojiang’s big moves couldn’t be released and the archer repeatedly consumed his blood. Li Xiaojiang’s blood gradually fell below the safe value.</p><br/><p>Zhuo Hang had no choice. If the opponents were a melee class then he could use traps to limit them. However, the opponents were ranged classes. In addition, the archer had the longest attack distance. Zhuo Hang couldn’t get close to Lu Xiao and was hunted by the other person. Zhou Yu also restricted him and he couldn’t act freely.</p><br/><p>Zhuo Hang saw that Li Xiaojiang’s blood was decreasing and felt powerless.</p><br/><p>It was a really bad feeling.</p><br/><p>Xiao Li was going to die but Zhou Hang couldn’t do anything. Instead, he was entangled by the opposite side’s hunter and couldn’t get away. He still wasn’t strong enough to protect Xiao Li?</p><br/><p>Once the news of Lu Xiao killing Li Xiaojiang popped up on the screen, Zhuo Hang tried his best to explode the hunter’s traps and wiped out the blood of Zhou Yu before he was killed by Lu Xiao.</p><br/><p>Li Xiaojiang didn’t play much of a role and Zhuo Hang was no match for the veteran hunter. When the two of them were sent off, the archer Lu Xiao still had 70% blood left while the hunter Zhou Yu had 30% blood.</p><br/><p>The first combination in the arena could be said to be a big defeat for Canglan.</p><br/><p>Zhuo Hang and Li Xiaojiang walked off the stage together. Li Xiaojiang seemed very unhappy. Although Zhuo Hang was depressed, he gently held Li Xiaojiang’s hand and comforted him. “Don’t worry, Brother Shu is after us. There is also Cat God. We can win.”</p><br/><p>Li Xiaojiang sullenly followed him back to the seats and sat down. Li Cangyu glanced at the two of them and didn’t say anything. He let Xie Shurong and Bai Xuan prepare to play.</p><br/><p>***</p><br/><p>The Canglan team sent the Shu Bai combination for the second round ot eh arena. This combination often appeared during the team battle but this was the first time they fought together in the arena. Both of them were ace players, giving some confidence to the fans of Canglan.</p><br/><p>Xie Shurong had played in the competition for many years. No matter the situation, he could calmly deal with it. The disadvantage that he and Bai Xuan had was very serious but he played steadily in the face of the Lu Xiao and Zhou Yu combination.</p><br/><p>He didn’t rush forward like Xiao Gu nor was he suppressed like Xiao Li. Ah Shu was Ah Shu. He was steady but still sharp!</p><br/><p>He was no longer the younger brother of the Three Musketeers who chased the healer. His style was mature and stable. Xie Shurong holding the sword to kill the enemy was a general from head to toe.</p><br/><p>Bai Xuan was at a distance where they could respond to each other.</p><br/><p>The hunter Zhou Yu placed a lot of traps to interfere with Xie Shurong but Xie Shurong was quite calm. With his rich competition experience, he bypassed the control traps and stepped on the aggressive Death Trap. He didn’t fear this trap because after he stepped on it, Bai Xuan immediately gave him blood, making him a blood-filled tree.</p><br/><p>The presence of a milk dad in the arena made him think of only one word: cool!</p><br/><p>Xie Shurong had Bai Xuan cover him and didn’t need to worry as he rushed forward. He first cleaned up Zhou Yu’s blood and then cut at Lu Xiao with his sword. His actions were handsome and chic.</p><br/><p>The archer was particularly disgusting when attacking from a long distance. However, once a melee class got close to it, the fragile archer would be beaten without being able to take care of themselves.</p><br/><p>Lu Xiao now tasted what Li Xiaojiang felt. He was beaten by Xie Shurong but tears couldn’t emerge.</p><br/><p>In any case, there were teammates behind him. Lu Xiao made a dying struggle by throwing all his big moves at Xie Shurong before he was helplessly killed by Xie Shurong.</p><br/><p>There was a break of one minute for the next team to come on. Xie Shurong took this time to relax his fingers and he turned back to Bai Xuan. “Do I look good? Isn’t 1v2 handsome?”</p><br/><p>Bai Xuan smiled and praised him. “Yes, you are the most handsome person. Keep going.”</p><br/><p>Xie Shurong laughed at Bai Xuan’s praise and patted Bai Xuan’s shoulder. “Vice-Captain, thank you for your praise.”</p><br/><p>If he had a tail behind him, it would be wagging a long time ago. Bai Xuan always felt helpless towards this guy. He felt that Ah Shu was even more childish than the four teenagers of the Canglan team combined. It was terrible when his IQ dropped down to a kindergarten level!</p><br/><p>The break was very short and the second Time combination was soon sent on. It was the double archer combination.</p><br/><p>Liang Sijie and Liang Deyuan were a pair of famous elf archers. They were both surnamed Liang but they had no blood relationship. It was also a coincident that both of them loved to play archers.</p><br/><p>The two of them were newcomers in the training camp the year that Tan Shitian debuted. Once Xu Luo retired and handed over the captain’s position to Tan Shitian, Tan Shitian felt that he could raise a pair of elf archers with a tacit understanding. The two people could be sent to the team battles and the arena, it was the best of both worlds.</p><br/><p>Thus, he took the two of them to the fifth season’s regular season and trained them.</p><br/><p>The two of them were only 18 years old and had been raised by Tan Shitian. This year, the system changed to a pairs arena and they came in handy.</p><br/><p>In the second round, the Liang double combination appeared as Li Cangyu expected. He sent Shu and Bai in the second round to use Ah Shu’s assault ability to break up the archer pair.</p><br/><p>Shu and Bai had consumed only 10% of their blue to kill the first combination. Due to the presence of the powerful milk dad Bai Xuan, both of them had full blood.</p><br/><p>The two players quickly met in the central area of the map. Liang Sejie relied on the elf’s Breaking Wind Arrow to cross the tree obstacles, firing at Xie Shurong from a distance. His teammate Liang Deyuan cooperated with him to release arrows. Before long, Xie Shurong had been shot to half blood.</p><br/><p>However, there was the milk dad behind him. Xie Shurong didn’t worry about dying. Sure enough, a beam of white light hit his body and Xie Shurong was full of blood again.</p><br/><p>The Time duo, “…”</p><br/><p>Damn, bringing a milk dad to the arena was a bug!</p><br/><p>The two of them realized it was useless to hit Xie Shurong and concentrated on killing Bai Xuan.</p><br/><p>Bai Xuan was very clever. He saw that the other team changed targets and immediately ran. His survivability was enough to call him a cockroach, especially in this forest terrain. He hid and occasionally filled up his blood. It wasn’t that easy to kill him!</p><br/><p>The other team focused on killing the healer which facilitated Xie Shurong’s output.</p><br/><p>He used the swordsman’s big move, Light and Shadow Rotation to cut a lot of blood from the two archers.</p><br/><p>Thus, it changed to the scene of ‘you chasing me.’ Bai Xuan ran in the front, the archers chased behind him while Xie Shurong chased the archers…</p><br/><p>Bai Xuan wisely ran around the forest. The Time team originally wanted to kite him but the result was that Bai Xuan turned it back on them. The comments of the live broadcast were filled with: [Milk Dad 6666!]</p><br/><p>Bai Xuan could run around to save his live but this wasn’t a long-term solution. It was because his blue was limited. Filling up his blood would make the consumption of blue very severe. He would be slaughtered once he ran out of blue.</p><br/><p>Bai Xuan thought about it and said on the voice channel, “I can last up to 10 seconds. You try to take care of the two people at once.”</p><br/><p>Xie Shurong nodded. “No problem!”</p><br/><p>At this time, Bai Xuan was hunted by the two archers down to residual blood. He struggled to support himself but his blue was only enough to last him a short time. Bai Xuan quickly circled a big tree. The two archers looked at the healer with only a trace of blood left and naturally refused to let him go. The big move Death Arrow Rain fell down on Bai Xuan, turning him into a hedgehog.</p><br/><p>He only had 3% blood left. One more ordinary attack could wipe him out!</p><br/><p>However, Bai Xuan used Holy Light Surge on himself and rescued his bloody self.</p><br/><p>The two archers followed with rapid shooting, forcing Bai Xuan’s blood to 5%. He was about to die but… Bai Xuan used his last bit of blue to heal himself.</p><br/><p>‘I can still save myself.’</p><br/><p>This was the message that Bai Xuan revealed to the audience. The audience watching the game felt helpless. This Xiao Bai really wouldn’t die!</p><br/><p>The two Time archers were extremely aggravated. Liang Deyuan couldn’t stand it anymore and fired another shot. The residual blood Vice-Captain Bai was finally sent away.</p><br/><p>Finally killing the blood cow healer… this was the bitter feeling of a submissive daughter-in-law becoming a domineering mother-in-law!</p><br/><p>The two of them were feeling happen when a sword slipped behind them. It was the swordsman’s big Light and Shadow Rotation!</p><br/><p>Xie Shurong hadn’t moved in order to let the two people relax their vigilance as well as waiting for the cooldown to end. Bai Xuan died the moment the cooldown of his big move ended. Xie Shurong rushed over and his sword waved, directly cutting at the two fragile archers.</p><br/><p>Their blood was forcibly decreased to 30%. Xie Shurong froze one of them with Spirit Lock and then used Breaking Bone Sword and Devouring Soul Sword to kill the other. Then he returned to kill the remaining person. He was an unstoppable force!</p><br/><p>The archer was cut by the swordsman. He tried his best to fight back but eventually fell under Xie Shurong’s sword.</p><br/><p>Ah Shu once again killed two people in a row and looked over at Bai Xuan with a laugh. “Seeking praise.”</p><br/><p>Bai Xuan smiled helplessly. “You are so handsome that the world will weep.”</p><br/><p>“…” Xie Shurong ignored the second half and focused on the keyword ‘handsome.’ He touched his chin and watched Bai Xuan’s smile, feeling extremely satisfied.</p><br/><p>He knew that Bai Xuan had tried his best to delay the time to create an opportunity for Xie Shurong. It was for the cooldown of the swordsman’s big move to be over.</p><br/><p>This person was always considerate and careful. He would struggle to give his teammates a few more seconds before dying.</p><br/><p>Xie Shurong used to think that Bai Xuan was a very reliable milk dad. Now he realized that Bai Xuan was an excellent e-sports player.</p><br/><p>Vice-Captain Bai had stayed with Li Cangyu for the past few years, quietly encouraging and supporting Li Cangyu. This tenacity was very difficult. He wasn’t as radiant on the field as Cat God but he always gave his teammates the most timely support at crucial moments. This man was careful and considerate, but also powerful enough to make people unable to move.</p><br/><p>In recent years, the team’s performance had been bad. He worked hard to help Li Cangyu deal with internal affairs while also comforting the depressed members, eventually gaining a serious stomach illness…</p><br/><p>Xie Shurong suddenly felt distressed for Bai Xuan. Such a dedicated vice-captain and tough person was actually a player worthy of respect.</p><br/><p>Xie Shurong saw the smile on Bai Xuan’s face and thought it was great that he joined Canglan. Otherwise, how could he find such a treasure?</p><br/>\n</div>"}