{"title": "Chapter 158", "id": 158, "volume": 2, "url": "http://boxnovel.org/god-level-summoner-chapter-158", "volume_title": "Volume 2", "body": "<h1>Chapter 158</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 158 – Canglan VS Flying Feathers (End)</p><hr/><br/><p>The result of the second round’s tie meant that both side sent their third round players at the same time.</p><br/><p>Flying Feathers naturally sent Su Guangmo and Yu Pingsheng while Canglan sent Bai Xuan and Xie Shurong.</p><br/><p>It was a match between brothers. Both sides were full of blood and blue and it could be said that this was a very fair game.</p><br/><p>In front of the TV, Cheng Wei touched his chin and pretended to seriously comment, “Su Guangmo and Yu Pingsheng, the two people’s output is very scary. Canglan only has Xie Shurong as an output. It will be hard if they want to win.”</p><br/><p>Tan Shitian glanced at him and smiled. “This round is estimated to take at least 15 minutes. It will be longer than the previous round.”</p><br/><p>Cheng Wei nodded while thinking, ‘How should Tan Shitian and I cooperate to win against Flying Feathers?’</p><br/><p>***</p><br/><p>Su Guangmo and Yu Pingsheng were the most classic melee combination in the Miracle League. They were violent and fierce, making it hard for the fragile remotes to escape.</p><br/><p>The swordsman’s sword and the berserker’s giant axe. The slashing, sweeping, big moves and light and shadow effects when cooperating became a unique landscape in the Miracle League.</p><br/><p>Yu Pingsheng was actually a rare genius. He had a serious communication disorder and would think seriously when asked a question. Perhaps he would think for a moment before replying with, “Yes.”</p><br/><p>The result was that he was first among the people that reporters’ ‘least wanted to interview.’</p><br/><p>He might not be eloquent but he had the most delicate mind in the Miracle League. He could combine his patience and meticulous observations together with a berserker’s wild moves.</p><br/><p>Many Miracle League berserkers were careless or rough. The softness of Yu Pingsheng was definitely special.</p><br/><p>Since he abandoned a swordsman in the fourth season to play a berserker, the ID of Smog of Rain was always at the top of the domestic berserker rankings.</p><br/><p>The combination of Yu Pingsheng and Su Guangmo gave other teams a headache. Today they faced the full of blood Shu Bai combination. This was a direct confrontation between the top players of the two teams.</p><br/><p>The excited audience members stared at the big screen.</p><br/><p>The four people soon met in the centre of the sea map.</p><br/><p>Both pairs were melee and the positioning became the focus of the battle. The audience members found that Xie Shurong’s hands moved incredibly quickly as he jumped between reefs. Su Guangmo and Yu Pingsheng weren’t as fast but they always mutually controlled the distance between them.</p><br/><p>This was the tacit understanding of a long-term partnership. Sometimes they didn’t need to look for each other. As soon as they looked back, they could see the other person beside them.</p><br/><p>This time Su Guangmo moved first. He used a movement skill to fly to Xie Shurong and used Spirit Lock to fix the opponent in place. Then he directly followed up with Light and Shadow Rotation!</p><br/><p>A dazzling light surrounded Xie Shurong. Using a big move straight away, his older apprentice brother was obviously very rude today. Xie Shurong was badly injured by this. In the distance, Bai Xuan immediately used Healing Language, a heal over time skill that he stacked to the maximum amount. Then he used a small healing skill to fill his blood.</p><br/><p>To the surprise of the audience, Yu Pingsheng didn’t run to interfere with Bai Xuan. He jumped to the reef behind Xie Shurong and his huge axe descended, hitting Xie Shurong with Mountain Chop.</p><br/><p>Yu Bing adjusted the camera to overlook the map from above. The audience found that Yu Pingsheng and Su Guangmo chose the terrain very cleverly, surrounding Xie Shurong in the middle.</p><br/><p>Xie Shurong hadn’t expected his two older brothers to directly set fire to kill him. He thought that Su Guangmo and him would fight while Yu Pingsheng went to interfere with the healer. The result was that they ignored the healer and acted to kill their little brother.</p><br/><p>The helpless Xie Shurong had to carefully cope.</p><br/><p>Kou Hongyi couldn’t help saying, “Captain Su has learnt. Everyone saw in the last round how Xiao Han and Zhang Jueming dragged it out into a 10 minute battle. In this round, the Su Yu combination are ignoring Bai Xuan and setting fire to Ah Shu. In the face of this high-output classes, Bai Xuan’s pressure to add blood will be very large.”</p><br/><p>Fortunately, Bai Xuan was an experienced veteran player. He could calmly respond even in the face of the Su Yu combination’s outbreak. The audience watched on in fear because Xie Shurong’s blood volume went up and down like it was a roller coaster. It was really exciting!</p><br/><p>Xie Shurong didn’t worry that he would die. He had absolute confidence in Bai Xuan’s ability to add blood.</p><br/><p>Xie Shurong wasn’t afraid after being ganged up on by his two brothers. Once the control effect ended, he also used Light and Shadow Rotation and directly struck Su Guangmo!</p><br/><p>The two brothers kept fighting to hurt each other. Xie Shurong had Bai Xuan to recover his blood but Su Guangmo’s blood kept dropping. It seemed like the Ah Shu combination were dominant…</p><br/><p>However, Li Cangyu watched the battle and didn’t think so. He knew that if the Su Yu combination kept this up, Bai Xuan wouldn’t be able to keep up! This wasn’t just a battle of attrition, it was a battle of fatigue!</p><br/><p>Su Guangmo had been a captain for many years and his tactics weren’t any worse than Li Cangyu. It was just that today was an away game and he was targeted by Li Cangyu’s three consecutive arena games and map selection. It was also unlucky that in the second game, Xiao Mu was unfortunately killed by a trick.</p><br/><p>This didn’t mean Su Guangmo was going to sit back and lose three games in a row.</p><br/><p>In the last game, Su Guangmo carefully considered the combinations he sent. He and Yu Pingsheng were the guards and he sent Xiao Mu to the second round. No matter who the opponents were in the second round, XIao Mu was good at a protracted battle and would let the opponents enter the third round without any advantages.</p><br/><p>Su Guangmo and Yu Pingsheng had recharged their batteries and acted as the guard. The Su Yu combination had a chance to win against any combination in the Miracle League. The key was timing and a bit of luck.</p><br/><p>The facts proved there was nothing wrong with Su Guangmo’s arrangement. The second round ended up in a tie and he and Yu Pingsheng didn’t have too much pressure in the third round.</p><br/><p>In addition, the opponent was Xie Shurong, the younger brother whom they knew very well.</p><br/><p>***</p><br/><p>The fierce battle continued for 10 minutes and Xie Shurong became aware that Bai Xuan’s hand speed couldn’t keep up. Normally he could fully stack Healing Language in three seconds but now it took him nearly 3.5 seconds.</p><br/><p>Professional players were very sensitive to the timing of skill releases and this tiny gap was immediately captured by Xie Shurong.</p><br/><p>In fact, he knew his brothers’ intentions. The high-intensity output would give great pressure to the healer. Bai Xuan’s nerves had been tight as he quickly filled Xie Shurong’s blood. It was okay for three minutes or five minutes. However, once it lasted for seven or eight minutes, a strong healer might not necessarily keep up.</p><br/><p>Besides, Bai Xuan was 23 years old. He belonged to the older group of contestants in the Miracle League. He played in the previous two games and it wasn’t easy for him to last until now.</p><br/><p>Xie Shurong couldn’t give Bai Xuan any more pressure…</p><br/><p>Xie Shurong thought this and immediately left Su Guangmo, turning and quickly jumping to a distant reef.</p><br/><p>Many viewers found this move incomprehensible but Bai Xuan sighed with relief. Ah Shu had given him some breathing time that would allow him to slightly adjust his skills.</p><br/><p>However, Yu Pingsheng wouldn’t let Xie Shurong leave so comfortably. The moment Ah Shu jumped, he also jumped over. His reaction speed was simply amazing!</p><br/><p>Yu Pingsheng’s carefulness was reflected here. In a battle, he always kept an eye on the opponent’s movements. The movement Ah Shu moved, Yu Pingsheng guessed that the other person wanted to escape and immediately followed. He used Mountain Chop to forcibly stop Xie Shurong’s retreat.</p><br/><p>This was closely followed by Su Guangmo’s Breaking Bone Sword. The tacit understanding between the two people made the audience sigh. Yu Pingsheng moved and Su Guangmo immediately followed. It looked like a follow program set up by the computer.</p><br/><p>Xie Shurong saw his big brothers chasing him and immediately turned back to use Splitting Heaven and Earth on Su Guangmo!</p><br/><p>In the previous fight, all of Xie Shurong’s moves were aimed at Su Guangmo. He had Bai Xuan to restore his blood and it was still maintained at around 80%. Meanwhile, Su Guangmo couldn’t do anything about his blood and there was less than 30% left.</p><br/><p>Xie Shurong’s latest move was a critical hit and cut Su Guangmo’s blood directly to 10%!</p><br/><p>There was hope in killing him!</p><br/><p>Xie Shurong wanted to do this when Yu Pingsheng’s axe swept towards him. It was the berserker’s big move, Circle Around Three Chops.</p><br/><p>The release of this move was very difficult and it must be triggered when facing away from the target. Still, as long as it was successful, the damage would be considerable.</p><br/><p>The axe swept over Xie Shurong three times. The visual effect was gorgeous and Xie Shurong was almost cut into three sections.</p><br/><p>The scarier thing was that this skill had the effect of interrupting the opponent’s moves.</p><br/><p>Xie Shurong had just wanted to kill Su Guangmo only to be interrupted by Yu Pingsheng. Su Guangmo smartly jumped to another reef to get away from Xie Shurong.</p><br/><p>However, Xie Shurong couldn’t miss such a good opportunity. He was forced to use a movement skill to jump to Su Guangmo. Then he used Devouring Soul Sword to stab the other person’s chest. Su Guangmo finally fell to the ground.</p><br/><p>[Ah Shu has killed Grey Wolf!]</p><br/><p>The audience members warmly clapped.</p><br/><p>In the soundproof room, Li Cangyu didn’t show a smile. He knew that Xie Shurong and Su Guangmo were originally brothers and the gap between them wasn’t big. Xie Shurong used too much skills in order to kill Su Guangmo while Yu Pingsheng still had a lot of blood.</p><br/><p>Ah Shu only had 30% blue left. It wasn’t enough to kill the defensive berserker, even if his blood was filled up by Bai Xuan.</p><br/><p>Moreover, Bai Xuan was obviously fatigued by the long high-intensity battle and didn’t have much blue left.</p><br/><p>Yu Pingsheng’s status was very good. Most of the time he had cooperated to intercept and control Xie Shurong. He still had many attack moves left and his blue was also carefully calculated. At present. he had around 60% blue left.</p><br/><p>It might seem like 1v2 but in fact, the damage left by Yu Pingsheng’s remaining moves was much great than that of Xie Shurong.</p><br/><p>Su Guangmo’s purpose was achieved once the attrition battle reached this point.</p><br/><p>Xie Shurong knew in his heart that he would probably lost this game but it couldn’t be helped. Coping 1v2 against his two brothers was very hard. It might be different if the opponents were normal players but it was impossible for him to kill both brothers.</p><br/><p>He was well aware that Yu Pingsheng was a super defensive berserker!</p><br/><p>Xie Shurong had watched previous matches and felt that Yu Pingsheng’s level had improved. Today he had a deeper understanding about why Yu Pingsheng thought a berserker was more suitable for him.</p><br/><p>This introverted, ghost-like person could lift a heavy axe and decisively crush the opponent’s defense.</p><br/><p>The invisible swordsman who followed his brothers had become history. Now the person standing in front of Xie Shurong was the most powerful berserker of the league, Yu Pingsheng!</p><br/><p>Xie Shurong knew that his hope of winning wasn’t great but he didn’t give up. He fought against Yu Pingsheng for a while and cut the opponent’s blood to less than 30%.</p><br/><p>But it had to stop here.</p><br/><p>He didn’t have enough blue and used his big moves to kill Su Guangmo. He didn’t have enough to kill Yu Pingsheng.</p><br/><p>Yu Pingsheng was very calm and carefully calculated the blue and skills. He finally used Cut Through Thorns to kill Ah Shu.</p><br/><p>The remaining Bai Xuan was also almost empty of blue. Yu Pingsheng slowly consumed the other person’s blood with small skills that consumed very little blue. Once Bai Xuan ran out of blue, Yu Pingsheng killed him in one breath.</p><br/><p>[Smog of Rain has killed Ah Shu!]</p><br/><p>[Smog of Rain has killed White Fox!]</p><br/><p>The two messages appeared on the big screen on after the other. Fans of Flying Feathers immediately cheered in front of the TV. Many people went to Yu Pingsheng’s Weibo to leave the following messages: [Vice-Captain Yu 6666!] [Vice-Captain Yu is so handsome!] [Vice-Captain doesn’t want to talk so there is no need to reply. Just listen to me. You are really handsome!]</p><br/><p>Unlike the introverted Yu Pingsheng, his fans were very lively.</p><br/><p>Su Guangmo smiled and wrapped an arm around his brother, whispering, “Well done.”</p><br/><p>Yu Pingsheng wasn’t very talkative. He looked at his brother and smiled shyly. The smile was shallow and contained no sense of existence, but the light in his eyes was as bright as a star.</p><br/><p>***</p><br/><p>Canglan VS Flying Feathers, the final score was 2:1.</p><br/><p>In this regard, Canglan fans were still satisfied. After all, there were many newcomers and the opponents were the strong team of Flying Feathers. 2:1 at home was very good. More importantly, the newcomers improved in this game.</p><br/><p>Flying Feathers was a strong team in the Miracle League and it wasn’t easy to play 3:0 against them. After all, Su Guangmo wasn’t a vegetarian. Today, he was pitted by Cat God and it was normal to counterattack in the third game.</p><br/><p>Li Cangyu was pleased with this result. He was sure he would be questioned about why he didn’t appear in the last game but he felt that this arrangement had more benefits for the players. It was worth it.</p><br/><p>Bai Xuan left the contestant seats and descended the stage. Then he suddenly pulled Xie Shurong’s arm and asked, “I couldn’t keep up. Did I drag you down?”</p><br/><p>Xie Shurong turned to see Bai Xuan’s gentle and apologetic eyes. His heart melted and he didn’t blame Bai Xuan. Instead, he wanted to immediately pull out his heart for Bai Xuan to see.</p><br/><p>Of course, this was just a thought. Xie Shurong stretched out an arm and hugged Bai Xuan. He smiled and said, “You shouldn’t blame yourself. You are the best healer in the Miracle League. Today we lost to Su Yu because my output couldn’t keep up. It isn’t due to you. Besides, we can win together and lose together. It isn’t a big deal.”</p><br/><p>Bai Xuan understood that this person was comforting him an didn’t say anything. However, he suddenly felt that Ah Shu was actually very reliable. His IQ sometimes regressed to a kindergarten age and he acted childish, but he was reliable in critical moments.</p><br/><p>When he won. he would proudly say, “Look at how handsome I was,” making people want to kick him. When he lost, he didn’t blame his teammates or appear downcast. Instead, he was very open-minded.</p><br/><p>‘We can win together and lose together…’ They were simple words from Xie Shurong but Bai Xuan was really moved.</p><br/><p>Such a partner was rare.</p><br/><p>Ah Shu was a reliable young man. Bai Xuan thought this way and his eyes became gentler when he looked at Xie Shurong.</p><br/><p>Xie Shurong’s heart beat faster. He really wanted to hug and kiss him. ‘Vice-Captain Bai, don’t you know what you do to me when you give such a gentle look?’</p><br/><p>The two people watched each other for a moment. Then Xie Shurong couldn’t bear it anymore and hugged Bai Xuan tightly. Bai Xuan was shocked but his hands moved to rub this person’s head. He couldn’t bear to push this petulant young man away.</p><br/>\n</div>"}