{"title": "Chapter 171", "id": 171, "volume": 2, "url": "http://boxnovel.org/god-level-summoner-chapter-171", "volume_title": "Volume 2", "body": "<h1>Chapter 171</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 171 – Gossip Storm (2)</p><hr/><br/><p>Ling Xuefeng actually wasn’t angry about this storm of gossip. In the third season, Li Cangyu had been linked to Yu Bing so Ling Xuefeng had long been calm about this type of thing. This time, Li Cangyu went to buy a cake with Liu Xiang late at night and the reporters happened to be there to catch it. In fact, Li Cangyu’s attitude towards female players was no different from male players.</p><br/><p>Li Cangyu’s clarification on Weibo thrilled many reporters and fans. Everyone started to look for clues about his lover in the Miracle League.</p><br/><p>The first to be ruled out was Yu Bing. When gossip about them had spread, Li Cangyu clarified that Yu Bing was a friend and the two of them shouldn’t suddenly become lovers. The other female players in the Miracle League were all in the Red Fox team. Apart from Liu Xiang, it seemed that only the Vice-Captain Yang Muzi had any interactions with Li Cangyu?</p><br/><p>Unlike Liu Xiang’s quiet and gentle personality, Yang Muzi was lively and cute, with short hair like a girl who hadn’t grown up. Did Old Cat like the loli type?</p><br/><p>On the Miracle forum, a special post about Cat God’s lover was opened. Everyone was making guesses when a person with the ID of ‘Passerby C’ sent a message: [I have read Cat God’s Weibo post 10 times. Cat God said he had a lover and avoided using gender specific words. Cat God’s lover must be a man!]</p><br/><p>This post woke up the dreamers, making many people shocked.</p><br/><p>[Cat God’s lover is a man? [Stunned Face]]</p><br/><p>[The scope is big. There are hundreds of male players in the Miracle League!]</p><br/><p>[We have to add the Wulin League since Cat God spent two years playing Wulin competitively!]</p><br/><p>[If we are speculating based on the grounds of knowing each other for a long time… could it be Bai Xuan?]</p><br/><p>[It might also be the fanboy Cheng Wei. Cheng Wei clings to Cat God every day. Every time the Canglan team plays, he will open an account to cheer for Cat God. I think Cheng Wei is secretly in love with Cat God.]</p><br/><p>Passerby C: [No, no, no! Don’t talk nonsense. Cheng Wei feels pure admiration towards Cat God, admiration!]</p><br/><p>[…Is the above comment Vice-Captain Cheng’s account?]</p><br/><p>Passerby C: [You are Vice-Captain Cheng’s account!]</p><br/><p>[Isn’t this being too angry?]</p><br/><p>“…” Cheng Wei angrily closed the forum on his computer.</p><br/><p>Tan Shitian came over and asked, “Why are you running to the forum to join the fun?”</p><br/><p>Cheng Wei looked depressed. “I am just curious. Cat God used ‘him’ on the Weibo post. Is this really just to deal with the reporter’s nonsense? Or is Cat God’s lover a man?” Cheng Wei looked up doubtfully at Tan Shitian. “How can he like a man? He should find a big beauty and have a chubby son!”</p><br/><p>Tan Shitian helplessly smiled. Xiao Wei felt pure love and admiration for Li Cangyu. Therefore, he hoped that Li Cangyu could have a happy life. However, Tan Shitian was very clear about who Li Cangyu’s lover was. When Li Cangyu returned to Miracle, Ling Xuefeng continuously forwarded posts about him despite never posting team-related news on Weibo. His concern for Li Cangyu was very obvious. In addition, Tan Shitian wrote the story of the big cat and the kitten and Ling Xuefeng forwarded a clarification. Tan Shitian and Ling Xuefeng didn’t say it but there was already a tacit understanding.</p><br/><p>The reporters obviously didn’t expect this and the fans were even more unlikely to think about it. The fans on both sides had always fought over who was the best summoner in the league. There were often fierce war of words in the forums until Li Cangyu left Miracle. The war between both sides gradually subsided but the relationship between the fans wasn’t good.</p><br/><p>Everyone always thought that Li Cangyu and Ling Xuefeng were fated opponents and the strongest enemies. They were often compared to see who was stronger but the fans never thought that they were the ones who knew each other the best.</p><br/><p>This type of feeling was actually very subtle. The person who knew you the best was often your strongest opponent.</p><br/><p>Ling Xuefeng’s understanding of Li Cangyu had always been far superior to the number one brainless fan, Cheng Wei.</p><br/><p>As top summoners in the league, there was a common language between them. Both of them were also captains of their teams and shouldered heavy responsibilities. The mutual understanding and empathy between them wasn’t something that outsiders could understand.</p><br/><p>From Tan Shitian’s viewpoint, it was natural for Ling Xuefeng and Li Cangyu to be together. Apart from Ling Xuefeng, Tan Shitian couldn’t think of a second person who could stand side by side with Li Cangyu.</p><br/><p>However, these thoughts could only be hidden in his heart, just as he kept his love for Cheng Wei in his heart.</p><br/><p>Cheng Wei made a startled expression and Tan Shitian had to pretend to smile. He asked, “Would you support him if Cat God is really with a man?”</p><br/><p>Cheng Wei was stunned and his face immediately wrinkled up like a bun.</p><br/><p>Tan Shitian couldn’t help pinching this bun-like face and changed his word.s “I’m joking. Maybe Cat God just casually said it to deal with the reporters. It is casual nonsense.”</p><br/><p>Cheng Wei didn’t believe this. He had a strange intuition that with Li Cangyu’s personality, there was no need to lie to handle the reporters. It was likely that his words on Weibo were true.</p><br/><p>Cheng Wei thought about it carefully and scratched his head. “I will support him no matter what decision he makes. As long as he is happy…”</p><br/><p>Tan Shitian heard this and couldn’t help feeling moved. Li Cangyu was very lucky to have such unconditional support from his fan. Cheng Wei might be simple but when he first entered the league, Li Cangyu had helped and guided him. He always remembered this kindness in his heart.</p><br/><p>If others were good to Cheng Wei then he would repay them. He didn’t compete for fame and fortune and did things according to his own mood, no matter what outsiders thought of him. For example, every time Canglan fought, he would open a side account to cheer for Cat God. This was very naive and wasn’t in line with the identity of a great god. Yet Cheng Wei stubbornly did what he liked.</p><br/><p>In the complex circle of the Miracle League, it was rare to be able to maintain his pure heart. It was also the thing Tan Shitian most liked about Cheng Wei.</p><br/><p>Tan Shitian couldn’t help smiling as he stared into Cheng Wei’s shining eyes. He said softly, “It isn’t difficult to accept men being together with men. There is no way to control their feelings. They like the person regardless of identity or gender. This type of affection is the purest thing in the world.”</p><br/><p>Cheng Wei listened to this and nodded. “Your words make sense.”</p><br/><p>Tan Shitian was amused by his ignorant expression and couldn’t help patting his head. “Do you really understand?”</p><br/><p>Cheng Wei replied honestly, “I don’t understand.”</p><br/><p>His expression was really cute. Tan Shitian stared gently at him and said, “One day you will understand.”</p><br/><p>Cheng Wei nodded. “Oh… it is 10 o’clock. Let’s go train!”</p><br/><p>Tan Shitian saw him running away and smiled while thinking, ‘This ignorant person, your mental age isn’t grown up yet! One day I will let you know how to like a person and let you grow up.’</p><br/><p>***</p><br/><p>People gossiped on the forum for a long time but still couldn’t get any clues.</p><br/><p>Bai Xuan became the most suspected person. After all, he stayed with Li Cangyu for a long time and was said to be a close friend since childhood. However, apart from this, there was no strong evidence to be found.</p><br/><p>Bai Xuan was dumbfounded when he saw these comments. He turned back to Li Cangyu and said, “They think we are a pair.”</p><br/><p>The four teenagers of Canglan immediately pricked their ears to listen to the gossip.</p><br/><p>Li Cangyu asked in a straightforward manner, “Do you want me to clarify it?”</p><br/><p>Bai Xuan smiled. “Forget it. The more you say, the more suspicious it seems. It will calm down in a few days if you ignore it.”</p><br/><p>Li Cangyu thought that Bai Xuan’s words were very reasonable. If it hadn’t been for Liu Xiang’s reputation then he wouldn’t have come forward to clarify things. More explanations would just make the gossip more troublesome. The best way was to ignore it. As long as the main character of the event didn’t speak, the reporters and spectators would get bored and disperse on their own. This type of entertainment news generally didn’t remain hot for more than three days.</p><br/><p>Li Cangyu thought this and put it aside. He called everyone to a meeting to prepare for the next match.</p><br/><p>***</p><br/><p>The third week of the seventh season’s regular season ended. The Canglan team was temporarily ranked fourth in the points list with 2:1 against time, 2:1 against Flying Feathers and 1:2 against Red Fox.</p><br/><p>The loss to Red Fox caused their ranking to drop but it didn’t matter. Li Xiaojiang, who had the worst foundation, gained a lot in the game and his mentality also underwent a transformation. Li Cangyu’s guidance and tempering of Li Xiaojiang was considered to be very effective. He could safely let Li Xiaojiang work hard on his own.</p><br/><p>The next matches were Canglan in a home game with Ghost Spirits, an away game with Pure Cleansing, a home game with Cheetah and an away game with Wind Colour.</p><br/><p>Li Cangyu already had an idea about these four matches. He managed to win against the two strong teams of Flying Feathers and Time and the points pressure wasn’t too big. He could use the following games to focus on honing the newcomers.</p><br/><p>Ghost Spirits currently had the most powerful killer combination in the Miracle League. The understanding between the brothers was comparable to twins. Their assassination ability was first-class so it wouldn’t be a good match, even if it was at home.</p><br/><p>Pure Cleansing was a classic illusionist team. Chu Yan and Zhu Qingyue were the most powerful psychic players in the league. The psychic class had always been obscure as an auxiliary and only became powerful in the last two years. Since they could control the field with illusions, Canglan would definitely be targeted with the map in the away game. It might even be three team battles, which was even worse.</p><br/><p>The overall level of the Cheetah team wasn’t strong but the captain Jiang Xu was known as the best hunter and he wasn’t very good to deal with. He also had the terran hunter Chen Anran who won the Most Potential Rookie Award last season, This boy was only 16 years old and was said to be a talented player. Perhaps his surprise play would give them victory on the field.</p><br/><p>Finally, Wind Colour was the hardest bone to nibble on in the Miracle League. Qin Mo had grown after his low point in the last season while Vice-Captain Yan Ruiwen and Guo Xuan’s double black magician combination was the most classic combination in the league. Ling Xuefeng’s understanding of Li Cangyu was also unparalleled. It could be said that the battle against Wind Colour was the worst.</p><br/><p>In any case, Li Cangyu had to maintain a calm mind. He had to face so many difficult opponents and couldn’t pay attention to gossip. The most important thing was taking Canglan to the playoffs and winning the trophy.</p><br/>\n</div>"}