{"title": "Chapter 187", "id": 187, "volume": 2, "url": "http://boxnovel.org/god-level-summoner-chapter-187", "volume_title": "Volume 2", "body": "<h1>Chapter 187</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 187 – Post-Match Interview (2)</p><hr/><br/><p>The interview ended and Li Cangyu wanted to take everyone to dinner. The result was that he saw Ling Xuefeng waiting at the entrance of the lounge. Ling Xuefeng quickly walked over and said, “Let’s take your teammates to eat dinner together. I have booked a restaurant.”</p><br/><p>Li Cangyu asked bluntly, “Is it your treat?”</p><br/><p>Ling Xuefeng nodded. “Yes, this is the first time you came to Shanghai to play a match so I’m buying.”</p><br/><p>Li Cangyu smiled and patted him on the shoulder. “It is good since I save money.”</p><br/><p>He went back and called Bai Xuan to have everyone eat dinner together. It was Captain Ling’s treat so the Canglan members were naturally very happy. The group of people sat in the team’s van and headed to the restaurant Ling Xuefeng booked in advance. They entered the largest private room where two tables were set.</p><br/><p>Both teams ate dinner together, which was rare in the league. It was enough to show the good relationship between the captains.</p><br/><p>On this occasion, the Canglan team and Wind Colour team should sit at a table each but Ling Xuefeng made adjustments to the seating arrangements. “Let’s have the newcomers sit together since there will be more common topics.”</p><br/><p>Thus, the four teenagers and Wind Colour’s Qin Mo and Lin Ke sat at a table. Xu Feifan and He Qun were familiar with Qin Mo and followed him. The remaining eight people sat at the other table.</p><br/><p>Ling Xuefeng naturally sat next to Li Cangyu and told him, “We will go to Changsha at the start of the next round. Then you should treat us.”</p><br/><p>Li Cangyu looked over at him. “Aren’t you willing to pay a bit to eat?”</p><br/><p>Ling Xuefeng refuted, “It is a courtesy.”</p><br/><p>Li Cangyu had to promise. “Okay, I will bring you to eat Hunan food.”</p><br/><p>Bai Xuan saw that the two of them were having a good time talking and couldn’t help asking, “Captain Ling, what is the arrangement for this week’s holiday?”</p><br/><p>Ling Xuefeng said, “I might stay home for a few days. My mental state has been tense from the matches recently and I should relax.”</p><br/><p>Li Cangyu agreed. “I also feel that it is good to relax. The second round of the regular season begins next week and it will be more stressful than the first round.”</p><br/><p>Everyone agreed while Xie Shurong interjected, “Captain, are you giving everyone a holiday? Then I’ll refund my return ticket to Changsha. I want to go home and see my parents.”</p><br/><p>Bai Xuan looked over at him. “Who knew that you are a filial son?”</p><br/><p>Xie Shurong sent him a handsome smile. “Do you think this Xie Shurong is more attractive?”</p><br/><p>Bai Xuan almost choked on his tea and ignored Xie Shurong.</p><br/><p>The waiters brought the food and everyone was surprised to find there were two plates of fish for this table.</p><br/><p>Ling Xuefeng didn’t give anyone a chance to express their confusion as he placed one plate of fish directly in front of Li Cangyu. This meant that his cat should eat one plate separately while the other plate was for everyone else.</p><br/><p>Bai Xuan saw Li Cangyu eating fish and Ling Xuefeng who gave him the fish. He felt that the time had returned to many years ago. Whenever the league held a party, as long as Ling Xuefeng and Li Cangyu were at the same table, Ling Xuefeng would always help Li Cangyu grab some fish. At that time, they were still ignorant and young teenagers less than 20 years old. Many years had passed in the blink of an eye but some friendships never changed.</p><br/><p>***</p><br/><p>The dinner ended and Li Cangyu gave everyone a week off. The current results were dangerous but everyone had worked hard in the first round. It was appropriate to relax for a few days in a happy mood. In the second round, they had to face every strong opponent in the most relaxed state.</p><br/><p>Xie Shurong went back to his hometown to visit his parents while Old Zhang went to Changsha to visit his studio. Zhuo Hang, Xiaojiang and Xiao Gu all returned home. Xiao Han originally wanted to go back to Changsha but Qin Mo said, “I will take you around Shanghai for a few days! You haven’t been to Shanghai yet, have you? I’ll show you around.”</p><br/><p>Xiao Han was very curious about Shanghai and immediately agreed. “Okay!”</p><br/><p>The two little guys decided to go around to play and Li Cangyu had no objections. The two of them were 18 years old and it was the time to play. In any case, Qin Mo was there so there was no need to worry about Xiao Han getting lost in Shanghai.</p><br/><p>Then what would he do during these days?</p><br/><p>Li Cangyu thought for a moment before deciding to call Ling Xuefeng.</p><br/><p>“Hey, are you going to stay home and rest for a few days?” Li Cangyu asked with a smile.</p><br/><p>“Yes.”</p><br/><p>Li Cangyu told him, “I can’t buy a ticket back to Changsha. Can I stay at your house for a few days?”</p><br/><p>Ling Xuefeng couldn’t help smiling. This excuse was a bit terrible. Who didn’t know that the Dragon Song Club booked all of the members’ tickets in advance?</p><br/><p>Still, he was clever enough not to smash Li Cangyu’s lies. He asked softly, “Do you want to come and stay with me?”</p><br/><p>Li Cangyu nodded. “Yes, previously, you used the Steamed Bass side account to enter my guild as an undercover. After I smashed your identity, you promised to make me a lot of steamed bass as compensation.”</p><br/><p>Ling Xuefeng nodded. “Then I’ll come and pick you up.”</p><br/><p>***</p><br/><p>10 minutes later, Ling Xuefeng’s car stopped at the hotel’s door. Li Cangyu dragged his luggage into the car and went home with him.</p><br/><p>This wasn’t the first time Li Cangyu had come to Ling Xuefeng’s small home in Shanghai. The two bedroom home was small in size but the overall decorations were very warm. It was hard to think that the indifferent Ling Xuefeng would be such a family person.</p><br/><p>Not only did he clean his house neatly but he also wore an apron to cook.</p><br/><p>Ling Xuefeng leaned against the kitchen door and took a few photos using his phone. He praised Ling Xuefeng while shooting, “You look so handsome when wearing an apron. If I post this photo online then the viewers will be shocked.”</p><br/><p>Ling Xuefeng turned back and said, “Don’t post it.”</p><br/><p>Li Cangyu smiled and put away his mobile phone. “Of course, I am the only one who can see you like this. I won’t share it with outsiders.”</p><br/><p>As he spoke, he walked to Ling Xuefeng and gently hugged him from behind. Ling Xuefeng’s hand holding a spoon slightly shook. He turned back, a hint of reproach in his eyes. “Don’t make trouble and wait for me to finish…”</p><br/><p>Before he could finish speaking, Li Cangyu directly kissed him.</p><br/><p>His kisses were still slightly inexperienced but he had the taste of a clean and refreshing adult man. Ling Xuefeng was swayed by this kiss and forgot all about the fish in the pot. He pulled Li Cangyu into his arms.</p><br/><p>Li Cangyu only kissed him shallowly before stopping. He smiled at Ling Xuefeng and declared, “Xuefeng, I missed you.”</p><br/><p>Ling Xuefeng, “…”</p><br/><p>If the kiss just now was an ignition then this sentence was simply adding fuel to the fire.</p><br/><p>Ling Xuefeng’s body instantly stiffened. Did this person know how unethical his behavior was?</p><br/><p>Ling Xuefeng saw the person’s smile and couldn’t bear it anymore. His arms tightened until there was no gap between the two bodies and his lips decisively pressed down in a hard kiss.</p><br/><p>This kiss was extremely fierce, as if releasing all the thoughts that had been suppressed for a long time. Ling Xuefeng’s tongue swept through Li Cangyu’s mouth like a violent gust of wind. Li Cangyu found it hard to breathe and could only grab onto Ling Xuefeng’s shoulders.</p><br/><p>Ambiguous sounds filled the kitchen as the two men hugged and kissed…</p><br/><p>Until a strong smell came from the pot. Li Cangyu’s mind came back and he shoved Ling Xuefeng away, pointing to the pot. “Fish paste!”</p><br/><p>Ling Xuefeng took off the lid and saw that the braised fish inside had turned into a pile of charcoal. He felt both angry and amused as he pinched Li Cangyu’s nose. “In the future, you can’t come into the kitchen when I cook.”</p><br/><p>Li Cangyu nodded. “Oh… can we still eat it?”</p><br/><p>Ling Xuefeng replied helplessly, “Throw it away.”</p><br/><p>Li Cangyu made an apologetic expression and Ling Xuefeng’s eyes became gentler. He kissed Li Cangyu and said, “Go to the dining room and wait. I will re-steam it for you.”</p><br/><p>Li Cangyu happily ran to the dining room to wait.</p><br/><p>Ling Xuefeng saw the man sitting there quietly waiting to eat, the soft light of the dining room shining on his handsome face and Ling Xuefeng’s heart softened. This passionate and greedy big cat, Ling Xuefeng really wanted to raise him for a lifetime.</p><br/>\n</div>"}