{"title": "Chapter 197", "id": 197, "volume": 2, "url": "http://boxnovel.org/god-level-summoner-chapter-197", "volume_title": "Volume 2", "body": "<h1>Chapter 197</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 197 – Carnival (8)</p><hr/><br/><p>That evening, Cheng Wei lay down and couldn’t fall asleep. He felt excited about ‘finally learning to kiss’ but felt sorrow at the ‘person being Tan Shitian.’ He rolled around in bed and thought for a long time. He didn’t fall asleep until 3 o’clock and ended up dreaming about being kissed by Tan Shitian…</p><br/><p>He woke up and saw Captain Tan’s calm face. Cheng Wei was embarrassed to look at him and rushed into the bathroom. The result was that he didn’t pay attention and bumped into the glass.</p><br/><p>Tan Shitian hurriedly came over and rubbed his forehead, asking softly, “Are you hurt?”</p><br/><p>Cheng Wei avoided his gaze. “I’m fine. Cough, let’s go for breakfast…”</p><br/><p>The two of them went downstairs together and found the other players gathering around the breakfast buffet. The vice-captains of Canglan and Wind Colour were sitting at a table and Cheng Wei didn’t hesitate to sit beside Cat God.</p><br/><p>Li Cangyu asked doubtfully, “What happened to your forehead?”</p><br/><p>Cheng Wei was too embarrassed to say that he stupidly walked into the glass door. Fortunately, Tan Shitian rescued him. “I didn’t pay attention and accidentally hit him.”</p><br/><p>Li Cangyu nodded and didn’t ask anymore questions. “Go get breakfast. We will eat together before going to the venue.”</p><br/><p>***</p><br/><p>Today’s Carnival officially started at 10 in the morning and it was a six member team battle as everyone had long guessed.</p><br/><p>Yesterday the Frost Team had been helplessly defeated in the arena and the audience was most looking forward to today’s team battle.</p><br/><p>The Frost Team had the two explosive players, Li Cangyu and Ling Xuefeng. Together with Cheng Wei’s control, Chu Yan’s assistance, Zhang Shaohui’s assassination and Liu Xiang’s healing, this team could directly enter the world competition and have a chance of winning when facing the top teams from the US and South Korea.</p><br/><p>On the Fire Team’s side, they lacked an auxiliary but their output was very stable. Su Guangmo, Yu Pingsheng and Lou Wushuang were the three front row attackers, Yan Ruiwen added negative states and Tan Shitian could suppress from a distance. There was also the super-survival god’s milk, Bai Xuan. This team was also top in the world.</p><br/><p>Many viewers were excited. [In fact, the Chinese Miracle players have improved quickly in the past two years. Last year’s 3v3 victory at the World Carnival won’t be the last championship we win!] [Seeing the great gods at the domestic Carnival, I think we might be able to get a prize in the World Competition!] [The seventh season isn’t over yet. It is too early to worry about the World Competition!]</p><br/><p>The discussion in the live room was very lively. In order to better explain the game to the audience outside the stadium, the league had Yu Bing and Kou Hongyi come to commentate for everyone.</p><br/><p>At the Carnival, the host came forward with the microphone and smiled. “Audience members, the last showdown of this year’s Carnival is about to begin. I believe that everyone has already guessed today’s matchup mode. It is the long expected six person team battle! The lineup of both sides is on the big screen. Who will be the commander of the game? Let’s wait for news from the referee’s side.”</p><br/><p>The contestants on both sides had already sat down and submitted their commander to the referee.</p><br/><p>The Fire Team was commanded by Su Guangmo and the Frost Team was LI Cangyu.</p><br/><p>The temporary captains on both sides acted as commanders, which was expected by many people. It was only the Wind Colour fans who felt it was unfair. They didn’t expect Captain Ling to give the command to that cat!</p><br/><p>In order to save time, today’s team battle was only one game. The map was naturally randomly selected by the system.</p><br/><p>Half a minute later, the random map finally appeared on the big screen. It was Yisu City Square.</p><br/><p>This map wasn’t very difficult. It was an ordinary map with a wide field of view and was fair to any class.</p><br/><p>The players sitting on the stage saw the map and looked very calm. Once the two sides refreshed at the birth point, Li Cangyu immediately deployed them. “I will stay with Xiao Wei in the middle. Xuefeng will go with Liu Xiang and Vice-Captain Zhang will go with Chu Yan.”</p><br/><p>The purpose of raising Zhang Shaohui and Ling Xuefeng’s economy was very obvious. After all, the resources on the map were limited. Ling Xuefeng could gave a full income with a nanny and Zhang Shaohui could also pick up coins in the early stages.</p><br/><p>Li Cangyu and Cheng Wei could only divide the resources of the wild area. Cheng Wei had no opinion on this. After all, this lineup didn’t require him to be an output. He only needed to control the field.</p><br/><p>On the Fire Team’s side, the splitting up was the same as yesterday’s arena. The Su Yu combination still didn’t split up, Tan and Yan were together while Bai and Zhang went to their allocated area.</p><br/><p>Yu Bing saw this scene and couldn’t help saying, “Today’s game is really a gathering of great gods. I guess that both sides will play conservatively early on. I just saw that Cheng Wei appeared in Tan Shitian’s attack range but he didn’t act and kept killing the mobs. The other two areas are the same. They want to stably develop first and the first wave of combat will probably be over the ice dragon.”</p><br/><p>It was as Yu Bing said. Both sides had great gods and their mentality was relatively stable. They had an attitude of enjoying this game and didn’t rush to attack.</p><br/><p>Once the first wave of mobs was cleared, the ice dragon refreshed on time.</p><br/><p>The turning point of a team battle was generally when the ice dragon refreshed. The team with the advantage could keep it by taking the ice dragon. The disadvantaged team could reverse the situation if they won the ice dragon. If there was an initial draw, winning the team economy boss would lay the foundation for a later victory.</p><br/><p>The ice dragon was definitely a resource both sides had to fight over. There was no need for a command as everyone consciously went to the refresh point.</p><br/><p>Li Cangyu instructed while walking, “Cheng Wei and Chu Yan, try to control Bai Xuan. Vice-Captain Zhang, detour to the left side and stare at your brother. Xuefeng, you know.”</p><br/><p>Ling Xuefeng hummed in agreement.</p><br/><p>Cheng Wei was curious. “What does he know?”</p><br/><p>Zhang Shaohui also asked, “What is it?”</p><br/><p>Liu Xiang was really speechless at the worrying IQs of these two people and reminded them, “Don’t be distracted. They’re coming.”</p><br/><p>The female captain’s gentle voice made everyone calm down. Zhang Shaohui actively lurked to find Lou Wushuang while Cheng Wei and Chu Yan started reading their control skills.</p><br/><p>God’s Seal!</p><br/><p>Cheng Wei’s white magic aimed at Bai Xuan. Bai Xuan’s pre-judgement ability was first-class. He moved to the side as if he guessed and successfully hid from this control.</p><br/><p>Psychic Array, Absolute Zero!</p><br/><p>This was Chu Yan’s ranged silence array. The large array of the psychic often had a powerful group control effect. Tan Shitian and Yan Ruiwen had played remotely against Chu Yan many times. They were far away and naturally unaffected. However, the few people in the front row as well as Bai Xuan, who just moved a step into the array because he hid from Cheng Wei’s skill, were affected.</p><br/><p>Kou Hongyi quickly said, “Cheng Wei and Chu Yan cleverly cooperated. Cheng Wei might’ve wasted his control skill but he successfully pushed Bai Xuan into Chu Yan’s skill—oh my god, why are there so many pets on the field? My eyes are going blind!”</p><br/><p>Don’t blame Kou Hongyi for yelling. Many spectators were in the same state.</p><br/><p>The moment Chu Yan successfully controlled Bai Xuan, Li Cangyu summoned his four water, fire, wind and thunder spirits while Ling Xuefeng summoned his skeleton infantry, black crows, banshee and the demon god. This image was too beautiful!</p><br/><p>The audience became even more gobsmacked when Li Cangyu didn’t hesitate to open Cataclysm and Ling Xuefeng didn’t hesitate to open Demon God’s Rage…</p><br/><p>The result was a loud booming noise. The green light effect of the elves and the red light effect of the demons intertwined and flooded towards the three people controlled in the psychic’s array!</p><br/><p>Su Guangmo lost 80% blood, Yu Pingsheng lost 70% blood, Bai Xuan lost 80% blood and the invisible Lou Wushuang was also hit…</p><br/><p>The two people joined forces and directly disabled the three people on the opposite side!</p><br/><p>The audience couldn’t calm down for a long time. Cheng Wei’s eyes were dull and Zhang Shaohui was also shocked. Then Li Cangyu’s voice pulled them back from their thoughts. “What are you doing? Hurry and use your moves!”</p><br/><p>Cheng Wei immediately reacted and excitedly opened the white magician’s big move, Ice Storm. Zhang Shaohui wasn’t far behind and used Fatal Blow on Yu Pingsheng!</p><br/><p>[Only Dedication has killed White Fox!]</p><br/><p>[Only Dedication has killed Grey Wolf!]</p><br/><p>[Shadow has killed Smog of Rain!]</p><br/><p>Three people on the Fire Team died in an instant. The audience couldn’t believe it…</p><br/><p>Su Guangmo helplessly looked at his scene. He thought that Cat God would play more conservatively today. Who would’ve thought he would be so fierce?</p><br/><p>Su Guangmo directly wrote: [GG!]</p><br/><p>GG was an abbreviation for ‘good game.’ It originated from a confrontation between two high level e-sports players many years ago. One of them made his character say this praise before exiting the competition. It meant the opponent ‘played very well. This game is good.’</p><br/><p>Later, the two letters GG had a variety of usages in e-sports. Sometimes, GG was used to directly give up while some seniors used it to praise the younger generation.</p><br/><p>Su Guangmo used it as a pun. In addition to appreciating the cooperation between Ling and Cat, there was also the meaning of directly surrendering.</p><br/><p>Tan Shitian followed by joking on the public channel: [The summoners have released their outbreak. I don’t think it is necessary to fight anymore.]</p><br/><p>The dead Bai Xuan agreed. [Ling Cat can’t be on the same screen. They are simply a biological weapon.]</p><br/><p>[Captain Ling and Cat God have a total of eight pets. It is equivalent to a 6v14 fight!] Cheng Wei excitedly typed.</p><br/><p>He finally understood what Li Cangyu meant by ‘Xuefeng, you know’. These two people really had a connection. Cataclysm and Demon God’s Rage were difficult skills. Today, under Li Cangyu’s delicate layout, they actually opened the big moves at the same time and directly killed the Fire Team.</p><br/><p>No one else had this tacit understanding.</p><br/><p>At this moment, the mood of many Captain Ling and Cat God fans were somewhat complicated. Before, they were arguing for several days on the forum about who the best summoner was. Now they saw the horrible scene of both summoners together and couldn’t help becoming fans.</p><br/><p>[In fact, Cat God is very handsome!] A Captain Ling fan weakly said. [It isn’t easy for him to stick around for so many years. Can we still blacken him?]</p><br/><p>[Don’t blacken, don’t blacken. It is all gone! The two of them have such a good relationship. How can the fans argue?]</p><br/><p>[The gorgeous skills of Captain Ling and Cat God together crashed my computer…]</p><br/><p>[They are really strong together. They are both fierce players and their hand speed is over 500APM. The instantaneous output is amazing! It is fortunate they aren’t in the same team or the other teams can’t last!]</p><br/><p>In the commentators’ room, Yu Bing saw this scene with a complicated expression.</p><br/><p>She originally thought that today’s team battle would last for half an hour. The result was that it ended in less than 10 minutes. The Fire Team directly admitted defeat. This might have an element of joking but it was also a great affirmation of the Ling Cat team.</p><br/><p>At this point, the two people at the centre of the discussion were extremely calm. They were long accustomed to this cooperation.</p><br/><p>Li Cangyu didn’t have to think about where Ling Xuefeng would summon his pets and Ling Xuefeng didn’t have to worry about interfering with Li Cangyu’s rhythm. They just needed to fight according to their own ideas and their skills combined perfectly.</p><br/><p>Li Cangyu glanced over at Ling Xuefeng and saw the deep confirmation, appreciation and affection that only Li Cangyu could understand in his eyes.</p><br/><p>Li Cangyu couldn’t help smiling and patted Ling Xuefeng on the shoulder. “Well done.”</p><br/><p>Ling Xuefeng leaned over and whispered in his ear, “Today is the first time we have cooperated in public but it is just the beginning.”</p><br/><p>“I understand.”</p><br/><p>Li Cangyu remembered their agreement regarding the national team and he naturally understood Ling Xuefeng’s words.</p><br/><p>One day, they would become the most tacit teammates and head towards the wider world—the World Competition!</p><br/>\n</div>"}