{"title": "Chapter 194", "id": 194, "volume": 2, "url": "http://boxnovel.org/god-level-summoner-chapter-194", "volume_title": "Volume 2", "body": "<h1>Chapter 194</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 194 – Carnival (5)</p><hr/><br/><p>The combination of Ling Xuefeng and Li Cangyu could actually surpass the Su Yu brothers of the Flying Feathers team. This result made the watching Xie Shurong very surprised. “No? My brothers have been inseparable since the training camp. This is almost five years. Brother Su even knows what Brother Yu wants to say. How could they be defeated by Cat God and Captain Ling?”</p><br/><p>Gu Suming was excited. “Is it because Cat God explains it more skillfully?”</p><br/><p>Xiao Han said, “It is because the tacit understanding between Captain Ling and Master is also very high. They have known each other for more than seven years.”</p><br/><p>Xie Shurong thought about it and Xiao Han’s words were reasonable. Cat and Ling had met each other in the Miracle online game before the first Miracle Professional League started. Plus, they were each other’s strongest opponents. They naturally knew each other the best. For example, Cat God’s most hated skill, favourite pet, etc. Ling Xuefeng knew all of them and it would be very easy for him to guess.</p><br/><p>The reverse attack of the Ling Cat combination meant the scores of the Frost Team and Fire Team became 1:1. The audience clapped enthusiastically and the people watching the live broadcast started to wonder.</p><br/><p>[What will be the third event?] [I feel like the Frost Team will win!] [There haven’t been many chances for the great gods in the first and second rounds. I think the third round will be a match! Guessing the answers is quite boring!]</p><br/><p>The audience comments immediately reached the thousands. There was a short break before the host came to the centre of the big stage. He smiled and announced, “The Frost Team and Fire Team are equal with 1:1. The third game will determine the outcome for both sides. What exactly is the third game? I just received news from the league so let’s look at the contents of the envelope with me.’</p><br/><p>The host opened a sealed envelope and took out the paper inside to show the audience. They immediately saw two familiar words, the pairs arena.</p><br/><p>“The third game is similar to the pairs arena in the regular season of the professional league!” The host explained with a smile and the audience clapped warmly.</p><br/><p>The thing that everyone liked the most was the way that professional players played the game. They were very happy with the previous two events but it was just dessert before dinner. The third game was the true dinner on the first day of the Carnival.</p><br/><p>***</p><br/><p>After the announcement of the game, the names and IDs of the 12 great gods were displayed on the big screen. The host followed up with an introduction. “Let’s look at the configuration of the Frost Team. There is the demon summoner Ling Xuefeng, the elf summoner Li Cangyu, the white magician Cheng Wei, the blood kin assassin Zhang Shaohui, the healer Liu Xiang and the psychic Chu Yan.”</p><br/><p>“The Fire Team consists of the terran swordsman Su Guangmo, the beast berserker Yu Pingsheng, the elf archer Tan Shitian, the blood kin assassin Lou Wushuang, the black magician Yan Ruiwen and the healer Bai Xuan.”</p><br/><p>“The guessing channel is now officially open. Audience members, please vote for which side you think will win!”</p><br/><p>***</p><br/><p>In the Canglan training room, the players watching the live broadcast on the projection screen immediately picked up their phones to vote. Gu Siming cried out without any hesitation, “I think the Frost Team will win. I have confidence in Cat God!”</p><br/><p>Xie Shurong replied calmly, “Based on just the lineup configuration, the Fire Team’s advantage is greater.”</p><br/><p>Xiao Han seriously asked, “Why?”</p><br/><p>“The Fire Team has five outputs and a healer. The Frost team has four outputs, one healer and one auxiliary. Chu Yan might have the title of the best auxiliary but the role of the psychic is generally reflected in team battles. This is why the Pure Cleansing team is the strongest in team battles.” Xie Shurong patiently explained. “In the pairs arena, the role of the psychic isn’t big.”</p><br/><p>Zhang Jueming agreed with this. “On the Fire Team, one output can take our milk dad and the other four outputs can form lethal combinations. Su Yu are old partners and will likely be left at the end. The Frost Team is different. Their combinations are very limited.”</p><br/><p>Li Cangyu and Bai Xuan weren’t here so Ah Shu and Old Zhang explained to the four teenagers.</p><br/><p>The four of them listened carefully and Zhuo Hang couldn’t help asking, “Can’t Ling Cat form a combination on the Frost Team?”</p><br/><p>Xie Shurong shook his head. “If Captain Ling and Cat God partners up, Cheng Wei and Zhang Shaohui will have to go with the healer and auxiliary. Do you think these two pig teammates can win?”</p><br/><p>Zhuo Hang laughed. “Ah right! Vice-Captain Cheng and Vice-Captain Zhang are undercovers sent by the Fire Team!”</p><br/><p>Xie Shurong seriously touched his chin. “If I’m not guessing wrong, Cat God should play with Xiao Wei. After all, the combination of brainless fan and idol should be full of power. Perhaps Cheng Wei can kill his Captain Tan.”</p><br/><p>***</p><br/><p>On the Carnival side, the host said, “I will ask each team to select a captain and then submit the lineup to the referee after three minutes.”</p><br/><p>The captain of the Fire Team was undoubtedly Su Guangmo. He debuted in the second season and had the oldest qualifications.</p><br/><p>On the Frost Team’s side, Cheng Wei actively raised his hand. “Cat God will be captain!”</p><br/><p>Li Cangyu wanted to refuse but Ling Xuefeng gently looked at him and said, “Do it.”</p><br/><p>The others had no opinions and unanimously agreed on Li Cangyu as the interim captain.</p><br/><p>The six of them gathered to discuss the arena lineup. Everyone was a professional player with first-class awareness. Apart from Cheng Wei who was in ‘I will listen to Cat God’ mode, the others realized that this situation wasn’t advantageous for them.</p><br/><p>Zhang Shaohui said, “If I face my brother, I am likely to lose. It is best that I miss him.”</p><br/><p>Li Cangyu nodded with understanding.</p><br/><p>Liu Xiang suggested, “The healer and auxiliary have to be separated. I am best at remote addition of blood since all of the Red Fox’s outputs are remote classes.”</p><br/><p>Li Cangyu thought about her suggestion. “Captain Ling and Captain Liu will be last. I will open the game with Cheng Wei and Vice-Captain Zhang and Vice-Captain Chu will be the transition group. Do you think it is feasible?”</p><br/><p>Ling Xuefeng thought for a moment before saying, “Yes, there’s no better plan.”</p><br/><p>Li Cangyu’s tactical literacy was high. The combination configuration was the most reasonable one in the current situation. Cheng Wei jumped with excitement. Li Cangyu saw his happy expression and couldn’t help patting his head. “If you meet Captain Tan later then don’t panic!”</p><br/><p>Cheng Wei formed fists. “No, I have never killed him before. Today I must kill him once!”</p><br/><p>***</p><br/><p>Soon, the captains on both sides submitted the lineup and the third game officially began.</p><br/><p>The first pairing for the Frost Team was Li Cangyu and Cheng Wei. On the Fire Team side, it was Tan Shitian and Yan Ruiwen. Many people saw Cheng Wei’s ecstatic look and commented: [The fanboy is complete today.] [Your idol took you to fly!] [I’m cheering on Xiao Wei to kill Captain Tan!] [Cat God brought the small white cat out, the dog is very unhappy – BY Tan Shitian.] [The kitten and big cat don’t want the dog. Captain Tan must be distressed.]</p><br/><p>Tan Shitian’s story had been revealed to everyone but on the screen, Tan Shitian was very calm. He just smiled graciously when he saw this lineup.</p><br/><p>The map selection was random and this time it actually ended up on the kill map, Endless Sea!</p><br/><p>The audience was amazed. Once someone fell into the sea, they would be killed by the hot magma of the sea. Such a map was very exciting and full of unknown things. The group thought that the Frost Team was likely to lose but then they saw this map. It wasn’t uncommon for a weak team to defeat a strong team on the Endless Sea map.</p><br/><p>Li Cangyu and Cheng Wei quickly came to the middle of the map. Tan Shitian and Yan Ruiwen were a duel remote combination but as it happened, Li Cangyu and Cheng Wei were also dual remotes. Tan Shitian’s archer could attack from a long distance but Li Cangyu had more control skills. The difference in the two sides wasn’t big and it depended on who could grasp an opportunity.</p><br/><p>Cheng Wei followed his idol and it was like he had been injected with chicken blood. His state was very excited as he followed behind Li Cangyu like a super stalker.</p><br/><p>Li Cangyu told him, “I will deal with Yan Ruiwen. I’ll give Tan Shitian to you.”</p><br/><p>Cheng Wei immediately nodded. “Yes!”</p><br/><p>The two sides met in the central area. Li Cangyu quickly summoned the water elf and froze Yan Ruiwen not far away. Yan Ruiwen also wanted to use black magic to control Cat God but the casting time of his fear skill was longer than Cat God’s water spirit. He was quickly interrupted without finishing the skill.</p><br/><p>Li Cangyu wanted to rely on this wave of control to play a combo but Tan Shitian wasn’t a fuel-efficient lamp. His teammate was hit and he immediately aimed at Li Cangyu, using Shock Shot to interrupt Li Cangyu.</p><br/><p>Cheng Wei saw this scene and decisively pounced. He jumped flexibly to the stone on the side and cast a skill, which was the white magician’s God’s Seal.</p><br/><p>The angle of this shot was very tricky. Tan Shitian didn’t check for a moment and was actually sealed in place.</p><br/><p>Tan Shitian was startled when he saw the white halo around his body and his mood was somewhat complicated. Xiao Cheng aimed so accurately today. Was it because he followed his idol?</p><br/><p>Cheng Wei was very happy about controlling Tan Shitian. He followed up with God’s Light, God’s Belief and Tidal Surge.</p><br/><p>A single target attack, a group attack and finally a slowdown. Tan Shitian’s blood was reduced by a large amount and Cheng Wei cleverly turned to run, looking back to find Cat God.</p><br/><p>Tan Shitian who was released from the effect of the seal, “…”</p><br/><p>Li Cangyu found that Cheng Wei was particularly smart today and couldn’t help praising him. “Good, your level has improved!”</p><br/><p>Cheng Wei smiled happily after being praised., “Yes, I knew that Tan Shitian would definitely stand there and used God’s Seal. It is amazing!”</p><br/><p>Usually, it was Tan Shitian bullying him by patting his head, pinching his face or opening a side account to abuse him. Today, Cheng Wei could bully him back and felt particularly good. His fingers on the keyboard were hot.</p><br/><p>He was feeling smug when his back was suddenly shot with a cold arrow. It was Tan Shitian’s Ice Arrow!</p><br/><p>He knew Tan Shitian but Tan Shitian also knew him. This arrow was too sudden. Cheng Wei hadn’t yet reacted when he was hit by Tan Shitian’s next moves.</p><br/><p>Precise Shot and Seize Life Shot!</p><br/><p>The two shots caused Cheng Wei’s blood to fall down.</p><br/><p>Cheng Wei typed in the public channel: [You used the cold arrow!]</p><br/><p>Tan Shitian sent back a smiley face. [Don’t you want to bite me?]</p><br/><p>Cheng Wei immediately wanted to bite him. He took a deep breath and quickly typed: [Wait for me to abuse you! Just wait!]</p><br/><p>The freezing effect of Ice Arrow was less than three seconds. In this short period, the two people could type on the chat. The audience felt that this style was wrong. This was a game. Couldn’t the two gods be serious?</p><br/><p>Still, who would be serious about the Carnival? Most people took part in this type of project with an entertainment mentality.</p><br/><p>Cheng Wei’s frozen status was lifted and he immediately rushed to use a spell. Frost Heart! World of Ice and Snow!</p><br/><p>If he had an arrow with ice properties then Cheng Wei also had magic with ice properties. He would retaliate to bully Tan Shitian.</p><br/><p>Tan Shitian was directly damaged by this set of moves and soon returned it unceremoniously with Death Arrow Rain!</p><br/><p>The two teammates who got along on weekdays weren’t polite when fighting each other. They used big moves, the gorgeous skill effects almost blinding people’s eyes.</p><br/><p>The archer’s output distance was the furthest. Tan Shitian could rely on the advantage of his attack distance to attack more times. Cheng Wei’s blood volume naturally decreased and he quickly entered the 20% residual blood state while Tan Shitian had 30% blood left.</p><br/><p>It was at this moment that Li Cangyu summoned his wind spirit and used Storm Fury.</p><br/><p>Then Tan Shitian was blown into the sea.</p><br/><p>[The Endless Sea has killed Ten Days!]</p><br/><p>Cheng Wei was startled before he laughed. [Hahahaha, you were blown down by Cat God!]</p><br/><p>Tan Shitian, “…”</p><br/><p>Li Cangyu made a face like the sudden sneak attack had nothing to do with him.</p><br/><p>Many viewers of the live broadcast lit candles. [The big cat and kitten joined hands. The dog’s heartache must be strong!] [Captain Tan will definitely write a sad story. As a story fan, I welcome it!] [Captain Tan, don’t be sad. After returning to the team, take care of Xiao Cheng!] [Supporting Captain Tan to rub Xiao Cheng’s head until it is an explosive hedgehog!]</p><br/><p>Tan Shitian smiled helplessly at the screen after dying and Yan Ruiwen would naturally find it hard after he was left alone. However, Wind Colour’s vice-captain wasn’t easy. He used Death Mantra and Shadow Winding on Cheng Wei, before cursing Cheng Wei to death.</p><br/><p>Still, he couldn’t beat Cat God and was finally killed by Cat God.</p><br/><p>***</p><br/><p>The Frost Team had a small advantage as Li Cangyu had around 40% blood and blue.</p><br/><p>Soon after, the second stage of the arena began and the ones who appeared were actually Lou Wushuang and Bai Xuan.</p><br/><p>Li Cangyu was speechless. [The Su Yu combination refuses to be torn open?]</p><br/><p>Bai Xuan helplessly replied: [Well, they are keeping guard.]</p><br/><p>Li Cangyu smiled and said: [Xiao Bai, you used to give me blood. Now I am embarrassed to hit you when you come to me.]</p><br/><p>Bai Xuan said: [Why don’t you kill yourself?]</p><br/><p>Li Cangyu made a straight face. [No, if I kill myself, Captain Ling will scold me.]</p><br/><p>Ling Xuefeng under the stage, “…”</p><br/><p>When would he scold Li Cangyu? Don’t talk about committing suicide. If Li Cangyu jumped to the Fire Team to kill Ling Xuefeng then Ling Xuefeng still wouldn’t scold him.</p><br/>\n</div>"}