{"title": "Chapter 201", "id": 201, "volume": 3, "url": "http://boxnovel.org/god-level-summoner-chapter-201", "volume_title": "Volume 3", "body": "<h1>Chapter 201</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 201 – Final Game of the Regular Season (2)</p><hr/><br/><p>The crucial match was Canglan’s home match and Li Cangyu didn’t hesitate to choose three arena games. Canglan was much stronger in the arena than in team battles. This match determined if Canglan could enter the playoffs or not and Li Cangyu couldn’t be sloppy.</p><br/><p>Even if a player made a mistake, the ones behind them could find a way to slowly recover from the disadvantages. Once defeated in a team battle, it would be extremely difficult to grab the situation from Tan Shitian’s hands.</p><br/><p>The fans understood Li Cangyu’s choice and Tan Shitian had also long guessed it.</p><br/><p>Next up was the map. Li Cangyu chose a map that didn’t often appear—Elf’s Covenant.</p><br/><p>This was a secret place in the elf realm. It was a dense forest where the trees were silver white and gave off a faint glow. There were many lovely silver spores that flew around the forest like small fireflies.</p><br/><p>This map was characterized as a status acceleration map.</p><br/><p>The Red Fox team had used a cold deceleration map to face Canglan. Now Li Cangyu chose an acceleration map to deal with Time. All members who entered the map would have movement speed increased by 20%.</p><br/><p>This choice surprised many players. Time’s archers were ranged players. If they were accelerated, wouldn’t their skills be more effective?</p><br/><p>Kou Hongyi also wondered about this. [I can’t understand Cat God’s thoughts. I feel there is a bit of danger choosing the acceleration map for the arena…]</p><br/><p>Yu Bing was aware of something. She maintained a calm expression as she guessed: [Although the acceleration map has the same effect for both sides but… for example, let’s say you often wear skates. On an important day, you will be very comfortable moving on roller skates. However, for a person who usually wears leather shoes, suddenly changing to roller skates will certainly affect his speed.]</p><br/><p>Kou Hongyi’s IQ wasn’t as high as Yu Bing and he immediately made a worshipful expression. “Sister Bing’s words are right! Canglan must’ve specifically trained during this one week on the acceleration map and will naturally be comfortable. That isn’t necessarily the case for Time. They probably didn’t practice at all on an acceleration map. Even if they practiced, they certainly didn’t specifically study this map. In a tense moment where the fate of the playoffs will be decided, the players might make a mistake if they are uncomfortable and Canglan will grab that chance.”</p><br/><p>The audience listened to their explanations and probably understood Li Cangyu’s meaning.</p><br/><p>The status acceleration map was nothing compared to the difficult kill maps so there was no point in Time practicing it. Canglan had been practicing for a week and would naturally have the advantage.</p><br/><p>It was like Yu Bing said. A person used to wearing leather shoes suddenly changed into roller skates. They would be very fast but it was easy to fall. Li Cangyu was also a person excellent when it came to grasping opportunities. It would be difficult for Time to win when he was the guard.</p><br/><p>***</p><br/><p>The first combination that the Time team sent was Liang Sejie and Liang Deyuan, the two elf archers. This was the classic double archers combination of the Time team. They weren’t brothers but their long-term cooperation led to a tacit understanding forming between them. This meant they often appeared in team battles to assist Tan Shitian to output.</p><br/><p>On Canglan’s side, the first to play were Xiao Han and Gu Siming.</p><br/><p>Many viewers didn’t understand this arrangement. This changed once the game started. What was Gu Siming’s nickname? Little madman! He was very aggressive and active. On the 20% acceleration map, he was simply a mad bull provoked by the Spanish bullring.</p><br/><p>Gu Siming evolved from a little madman into a super madman. He raised shields and chased the two archers. The two archers laughed as they were chased by him, thinking, ‘You are a thick paladin. How can you catch up with us?’</p><br/><p>Canglan’s fans were also a bit anxious. Xiao Gu starting the quick chase seemed excellent but paladins didn’t have many attack skills. He only had a bunch of protective skills and thick skin. In the face of the two archers’ outputs, could he endure for long?</p><br/><p>As it turned out, Gu Siming was more resistant than everyone thought.</p><br/><p>During this time, Li Cangyu had intensively trained his ability to resist stress. Sometimes the other three teenagers would team up to play Xiao Gu and Xiao Gu was tortured all day long. After a long time, he gained some survival ability.</p><br/><p>The biggest advantage of a paladin was their high defense and they had many protective skills to help their teammates resist damage. In the past, Gu Siming always thought about going forward and breaking open a bloody road to let his teammates output. In fact, many times he should do more protection. Attacking the enemy and opening a gap was the responsibility of the sharp swordsman Xie Shurong!</p><br/><p>After trying to understand this, Gu Siming patiently practiced for a month in accordance with Li Cangyu’s arrangement. In the second round of the regular season, Canglan’s tem battles had been erratic. Everyone thought this young player wasn’t in the right state but it was actually because Gu Siming was seriously looking for a suitable style.</p><br/><p>Today he found it.</p><br/><p>***</p><br/><p>Gu Siming lasted for three minutes and still didn’t die. The two players of the Time team couldn’t help feeling anxious. They had already wasted many skills on this paladin and it would be too shameful if they didn’t kill him. There was also Xiao Han hidden in stealth. No traces of him had been found yet.</p><br/><p>Liang Sejie made a blue signal on the map. This was an indication that they should unleash their full attacks.</p><br/><p>The two people tacitly agreed and simultaneously fired their big moves—Seize Life Shot!</p><br/><p>However, a clear ringing sound entered their ears. Everyone saw a golden light appear on the paladin’s body, the light quickly taking the shape of a shield in front of Gu Siming.</p><br/><p>—Furious Light Shield</p><br/><p>The paladin used the anger in their heart to form a light shield, guarding themselves or their teammates and bouncing all the damage back to the other party!</p><br/><p>The effect of this skill was similar to the blood kin sacrifice’s Lava Shield that Xiao Han had been hit by.</p><br/><p>The two Time players were caught off guard and their own big moves immediately decreased their blood by 30%!</p><br/><p>Gu Siming’s light shield shattered immediately after being attacked. The golden fragments flew through the air in a dazzling manner. Many fans excited sent him flowers and the Canglan support group suddenly became lively.</p><br/><p>[Xiao Gu is good! I give you 100 points for your awareness!] [The two members of Time probably want to cry. Their big moves were bounced back to themselves…]</p><br/><p>[This is the consequence of underestimating paladins! Don’t look down on them because they have less attack skills. They can bounce back attacks and kill you!]</p><br/><p>Gu Siming was very excited at this time. He had been suppressed by Zhuo Hang, Xiao Han and Li Xiaojiang some time ago. He already worked out that he should wait patiently regardless of how he was abused.</p><br/><p>He had been waiting and patiently held onto this skill. He saw that his blood was decreasing and didn’t impulsively open the shield. He waited until the two men finished Shock Shot before immediately pressing the key for the light shield.</p><br/><p>During this week, they had repeatedly watched the videos of the Time matches and Cat God summarized the characteristics of some opponents. The double archers had a habit of joining hands when dealing with a person. Once they used Shock Shot, the terrifying Seize Life Shot would come!</p><br/><p>The habits of many professional players were impossible to casually change. Once Gu Siming made a decision, he was very decisive. He actually ended up countering these deadly moves!</p><br/><p>It was at this critical moment that Xiao Han appeared.</p><br/><p>The intelligent teenager was very good at grasping opportunities. The cold light of his bloody daggers starkly contrasted with the silver and white background of the elf area.</p><br/><p>He was like a dark but flexible shadow on the brightly coloured map. He appeared silently behind Liang Sejie and decisively slashed at his neck.</p><br/><p>—Death Mark, Backstab, Soul Stab, Fatal Blow!</p><br/><p>Due to the increase in movement speed, Xiao Han’s actions when attacking were particularly handsome and smooth. Many Xiao Han fans saw it and cried out:</p><br/><p>[The little prince is so handsome!] [Our little prince is powerful!] [He really is like a shadow! So difficult to fight!]</p><br/><p>Liang Sejie of the Time team thought that this young boy’s speed was terrible.</p><br/><p>The last time he faced Xiao Han at the beginning of the seventh season, this body didn’t play well apart from the impressive appearance of blond hair and black eyes. In just a few months, he had been reborn as an assassin!</p><br/><p>Qin Mo watched the game on TV and felt admiration. “Xiao Han’s hand speed is very fast.”</p><br/><p>Ling Xuefeng nodded. “It is also effective hand speed.”</p><br/><p>The difference between pure hand speed and effective hand speed was very high. It definitely wouldn’t work if your hands were fast but you kept missing. Effective hand speed was the speed at which skills were accurately released. It could be seen that under Li Cangyu’s training, Xiao Han had broken through his own bottleneck. He connected his skills together as quickly as possible.</p><br/><p>Quietly emerging from the darkness and letting out a burst of hand speed to directly kill the opponent, this was a real assassin!</p><br/><p>Xiao Han was playing at the super level in the accelerated map. Liang Sejie was a relatively good player in the league but the map acceleration and silver white light made his eyes and hand speed somewhat uncomfortable. Xiao Han was like a phantom as he struck from the front and rear…</p><br/><p>[Frost Descends has killed Big and Young Liang!]</p><br/><p>The news that appeared on the big screen caused the audience to clap and Li Cangyu smiled.</p><br/><p>It seemed that the mentality of the young ones had adjusted quite well.</p><br/><p>This game was crucial to the Canglan team but Xiao Gu and Xiao Han weren’t stressed and played well. As Li Cangyu said, they should enjoy it like it was the final match!</p><br/><p>The four teenagers were all proud and didn’t want to end the seventh season’s regular season with too much regrets. They fought with the attitude of ‘I want to do my best.’</p><br/><p>As long as they played to their own standards, Li Cangyu had the confidence to lead them into the playoffs to compete for the trophy!</p><br/>\n</div>"}