{"title": "Chapter 205", "id": 205, "volume": 3, "url": "http://boxnovel.org/god-level-summoner-chapter-205", "volume_title": "Volume 3", "body": "<h1>Chapter 205</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 205 – Playoffs List</p><hr/><br/><p>At this point, the match between Ghost Spirits and Flying Feathers wasn’t over.</p><br/><p>This match was Ghost Spirits’ home in Shenzhen and Flying Feathers was fighting an away match. Both sides were melee based teams and their plays were exceptionally wonderful.</p><br/><p>By the time Li Cangyu returned to the team, it had reached the third game and the score on the big screen showed 2:0. Ghost Spirits had won two games.</p><br/><p>Li Cangyu didn’t have to watch the replay and directly asked, “Ghost Spirits used the blood kin map for three team battles?”</p><br/><p>Xiao Gu, who was actively watching the replay on his phone, immediately looked up. “Cat God really is a god. You guessed the truth!”</p><br/><p>Li Cangyu wasn’t a god. It was just that Ghost Spirits used the three team battles assassination tactics at home to bully many teams. Time and Flying Feathers were very strong in team battles but it had always been the signature for Ghost Spirits. In particular, if they were at home then they would choose a dimly lit map and the four assassins would enter stealth to interrupt the opponent’s rhythm.</p><br/><p>With the exception of Wind Colour, Ghost Spirits had barely lost any points in the seventh season.</p><br/><p>The reason for their loss to Wind Colour was because Ling Xuefeng and Xu Feifan summoned too many pets, which hindered the attack rhythm of the assassins. This gave Ling Xuefeng an opportunity to reverse the situation and beat them.</p><br/><p>It was understandable that Ghost Spirits’ home was a nightmare for many teams.</p><br/><p>People who played online games knew how annoying it was to be targeted by an assassin. Their lurking sneak attacks and other skills made assassins the most flexible class. There were many assassin masters in online games. There was an incident where a powerful assassin killed a 20 member casual group.</p><br/><p>There were four assassins in the main line up of Ghost Spirits and this lineup worked.</p><br/><p>They won too many points at home, causing them to be ranked second. This was the best result in the regular season since Lou Wushuang became captain.</p><br/><p>Bai Xuan watched the game and commented, “Ghost Spirits has shown a great performance this season. It is because the other assassin pair’s combination with Lou Zhang is complete. The four assassins team up to assassinate the core players of the opposite team. This tactic is very simple and rough, but it is hard to beat.”</p><br/><p>The vice-captain’s words made Xiao Han feel confused. “Didn’t you say not to use similar words in a row? Why can Vice-Captain Bai use it and it doesn’t sound bad?”</p><br/><p>“…” Boy, you were looking at the wrong point.</p><br/><p>Bai Xuan patted the golden head, “It is because ‘very’ is a qualifier. That’s why the description of a person can be very handsome, very gracious, very gentle. The words can be connected.”</p><br/><p>Xie Shurong came over. “Are you describing me?”</p><br/><p>Bai Xuan exclaimed, “Roll out of here.”</p><br/><p>Xie Shurong immediately walked over and sat next to him. “I rolled over.”</p><br/><p>Bai Xuan, “…”</p><br/><p>This tree was too thick-faced and should be skinned. The tree of Canglan had never been skinned and everyone had no way of talking to him.</p><br/><p>***</p><br/><p>The pressure of entering the playoffs was removed and everyone in the team was very relaxed when watching the game.</p><br/><p>Flying Feathers had lost two games in a row. In the third game, Su Guangmo had a fierce headache. At the beginning, he and Yu Pingsheng directly opened their big moves to attack the assassins of Ghost Spirits.</p><br/><p>The two sides had a fierce exchange in the middle of the map. After seeing that Lou Wushuang was going to die in seconds, the Ghost Spirits’ paladin suddenly put a light shield on Lou Wushuang and Lou Wushuang released his moves to kill Yu Pingsheng.</p><br/><p>Xiao Gu exclaimed, “This paladin has good senses!”</p><br/><p>Zhuo Hang said from next to him, “You have to learn from him.”</p><br/><p>Xiao Gu nodded. “Yes, I will go back and watch the slow motion replay.”</p><br/><p>Li Xiaojiang weakly said, “It seems that Ghost, Ghost Spirits will win again, again…”</p><br/><p>Xiao Han seemed to have figured out the usage from what Bai Xuan taught him “The Lou Zhang combination is very strong and they have a few tacit understanding. I think it is comparable to Master and Captain Ling.”</p><br/><p>This sentence made everyone look at their captain with startled expressions.</p><br/><p>“Cough.” Li Cangyu had a guilty conscience and he quickly covered it up. “The Lou Zhang combination are brothers. How can Ling Xuefeng and I compare with them?”</p><br/><p>Xiao Han said earnestly, “I think Master and Captain Ling are more intimate than brothers.</p><br/><p>Li Cangyu, “…”</p><br/><p>You are a professional at selling your master. You really can’t hide any words in your heart!</p><br/><p>Everyone looked like they were watching a good play and Li Cangyu was forced to say, “It is due to the similarity in class awareness. Once the Ghost Spirits’ four assassins form an understanding and stare at their target, even I can’t stop it.”</p><br/><p>The captain restored the topic and Zhang Jueming touched his chin. “This is a bit difficult. The assassins are already difficult to detect in the darkness. If they suddenly appear from behind and act then our lives will be taken.”</p><br/><p>Xie Shurong spoke up, “Ghost Spirits is strong in appearance but they are only okay in away matches. When they faced Flying Feathers in an away match, they lost two games. My brother used a desert map against them.”</p><br/><p>Li Cangyu nodded thoughtfully. “Yes, that is a good idea.”</p><br/><p>Bai Xuan saw his serious expression and asked, “Are you already thinking about the playoffs?”</p><br/><p>“It is nothing to think about it in advance. My brain cells are adequate.” Li Cangyu added, “Maybe we will face Ghost Spirits in the next round.”</p><br/><p>Su Guangmo’s big move finally killed the Ghost Spirits’ Lou Wushuang. However, Flying Feathers’ follow up output couldn’t keep up with the rhythm and the whole formation collapsed. Ghost Spirits actually won three consecutive games!</p><br/><p>This result made many fans stunned. Su Guangmo also had a helpless expression. Flying Feathers was unlucky lately and today a failure in pre-judgment failed to catch Lou Wushuang.</p><br/><p>The man dubbed by the fans as the ‘cold viper’ clearly had a beautiful face but he also had a high IQ, clear thinking and a keen sense of the game. Lou Wushuang was usually very low-key but in the seventh season, he eliminated several strong teams at home.</p><br/><p>Bai Xuan glanced at Li Cangyu. “You guessed correctly. Our next opponent is Ghost Spirits.”</p><br/><p>With Flying Feathers’ defeat, the regular season’s schedule was over. All the team points were officially published.</p><br/><p>Wind Colour was first, Ghost Spirits second, Canglan third and Flying Feathers fourth. These four teams won a ticket to the playoffs and would be eliminated according to the 1st VS 4th, 2nd VS 3rd rules of the playoffs.</p><br/><p>There was a week before the semi-finals. Li Cangyu stood up and stretched. “Let’s go have an excellent meal to treat your stomachs. There will be the devil training so I have to recharge everyone.”</p><br/><p>The four teenagers who had experienced the ‘devil training’ looked at Li Cangyu’s smile and suddenly shuddered!</p><br/><p>Cat God, how are you going to destroy us again? You might as well tell us!</p><br/>\n</div>"}