{"title": "Chapter 204", "id": 204, "volume": 3, "url": "http://boxnovel.org/god-level-summoner-chapter-204", "volume_title": "Volume 3", "body": "<h1>Chapter 204</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 204 – Playoffs List</p><hr/><br/><p>Canglan was in the playoffs!</p><br/><p>The news swept through all of the Miracle League. The Canglan fans cheered excitedly while the Time fans were so uncomfortable they almost shed tears. Time was only one step away but they were eliminated in this match!</p><br/><p>Cheng Wei was also ruining his teeth. If he wasn’t stupid enough to be figured out by Cat God then Time wouldn’t have been targeted so badly and Tan Shitian wouldn’t need to temporarily adjust the lineup. It could be said that today’s lost was because he didn’t play the role of vice-captain and dragged down the team instead.</p><br/><p>Time failed to make it to the playoffs in the sixth season. Cheng Wei thought it could turn it around in the seventh season but the result was that Time was once again shut out of the playoffs!</p><br/><p>Since the old captain Xu Luo retired, the Time team had never been absent from the playoffs list. Now it happened in the last two years, whether from bad luck or other reasons. Even the optimistic Cheng Wei couldn’t be happy after being eliminated twice in a crucial moment.</p><br/><p>In the blink of an eye, the Canglan team members came over under Li Cangyu’s guidance.</p><br/><p>Cheng Wei usually pounced like a small fan when he saw Li Cangyu but this time he just hung his head and cried.</p><br/><p>Li Cangyu felt so heartache for Cheng Wei. It was estimated that this person had suffered a huge psychological blow today. However, as a captain, Li Cangyu had his own principles. It was impossible for him to show mercy to anyone on the field. This was equivalent to looking for death.</p><br/><p>Li Cangyu sighed inwardly when he saw the usually energetic Cheng Wei hanging his head. He patted Cheng Wei on the head and said, “Don’t be discouraged, you are still young.”</p><br/><p>Cheng Wei looked up with a startled expression and saw Li Cangyu’s smile.</p><br/><p>His eyes were black and bright, filled with encouragement for the younger generation. “You have done too well in the last few years. It is time to calm down and think about your future. You’re not even 20 years old yet. You still have a long way to go.”</p><br/><p>The comforted Cheng Wei finally calmed down. He clenched his fists and said, “I won’t give up and will come back next year!” Suddenly he smiled and said, “Congratulations to Cat God. You have finally entered the playoffs. You must take the trophy back!”</p><br/><p>The congratulations wasn’t perfunctory. Li Cangyu could see sincerity from his eyes and couldn’t help reaching out to hug Cheng Wei. “Thank you.”</p><br/><p>Many Time fans felt a bit awkward when they saw this scene. Some people who hated Cheng Wei ridiculed him on the Internet and some people joked that Cheng Wei was the undercover that Cat God sent to Time.</p><br/><p>Tan Shitian finished packing away his keyboard and opened his phone. He unexpectedly saw many negative comments towards Cheng Wei but remained silent when he saw Cheng Wei’s simple face.</p><br/><p>In the post-match interview, many questions were directed towards Cheng Wei.</p><br/><p>“Vice-Captain, everyone knows that you are a fan of Cat God. Today Time lost the game. Is it because you were too excited at seeing your idol and played abnormally?”</p><br/><p>“A netizen said that you are Cat God’s undercover. What do you think of this comment?”</p><br/><p>“Time hasn’t been able to enter the playoffs for two consecutive years. Isn’t it proof that Time’s overall strength is slipping?”</p><br/><p>Cheng Wei was stunned because he didn’t expect the reporters to target him like this. Normally his mouth never stopped moving when arguing with Tan Shitian but now he couldn’t say a word to the reporters’ questions.</p><br/><p>He truly was a fan of Li Cangyu and he never hid it. In his view, it was normal for a professional player to appreciate another senior god. He didn’t think so much about it. Today, Time’s loss really had a lot to do with him and Cheng Wei had no way to deny it.</p><br/><p>After a moment of silence, he picked up the microphone and said seriously, “I really appreciate Cat God and admire him. When I first entered the Miracle League, he helped me a lot. Without him, there wouldn’t be the Cheng Wei who won the Best Newcomer Award in the third season. However, before my admiration of him, I am the vice-captain of the Time team. I have spend four years in the Time team and have deep feelings for the team. I really didn’t play well today but it wasn’t intentional…”</p><br/><p>His voice choked up a bit at the end. He had been in the Time team for so many years. He might not command any games or give the team much help but he did think of it as his home. Usually, he was noisy with Tan Shitian but it was mostly joking. He was actually very close with Tan Shitian. In addition, his relationship with Lu Xiao, Zhou Yu and the others were very good.</p><br/><p>It was a bit too much to say that he was Cat God’s undercover, which was equivalent to denying his value as the vice-captain of Time.</p><br/><p>Cheng Wei couldn’t go on. Suddenly, his fingers were gently held. The warmth passed through his fingertips made Cheng Wei look up and met Tan Shitian’s gentle eyes.</p><br/><p>Tan Shitian pinched his palm to express comfort. Then he took the microphone and said to the reporters. “I know that Time wasn’t able to enter the playoffs. Everyone is very sad so they will blame us but… matches are full of variables. Today the players tried their best and finally lost.”</p><br/><p>Tan Shitian slightly looked back into Cheng Wei’s eyes before continuing, “Vice-Captain Cheng is a member of Time. Accusing him is no different from accusing me. I really like the Time team’s fans. I’m not looking for the applause given when Time wins the championship but the encouragement and companionship that happens when Time loses a match. I hope that everyone will be less angry and more tolerant to the players. Any questions can be directed to me and I will accept it on my Weibo.”</p><br/><p>Captain Tan had a gentle and warm man image. These words were said with a smile but contained a trace of the captain’s decisiveness. Many fans of Time liked this young and promising captain. They heard him say this and their emotions gradually calmed down.</p><br/><p>The reporters who just questioned Cheng Wei turned red at the surrounding eyes and sat down.</p><br/><p>A sensible reporter stood up and asked, “Time is going to stop here for the seventh season. What are Captain Tan’s next plans?”</p><br/><p>Tan Shitian replied, “In fact, the fundamental reason for Time’s loss is that our tactical system is too singular, especially in the arena. As we watch more matches, we can find that strong teams like Wind Colour and Canglan have a variety of combinations they can choose from. The Time team mainly consists of archers and it is too easy for us to be targeted.”</p><br/><p>“Before the competition system changed, it wasn’t so obvious in the single player arena. The seventh season as started focusing on partner combinations. There are drawbacks to having too many archers. I will look back on this point carefully. There are many outstanding newcomers in the Time team’s training camp. You don’t have to worry about the decline of the team’s performance. After all, Time is from a big club. If our performance declines then as captain, I will be the first one to leave.”</p><br/><p>The reporters were attracted by Tan Shitian’s gentle and patient explanation. Everyone listened intently and the post-match interview turned into a happy outlook for the future.</p><br/><p>Cheng Wei sat on the stage and listened to the person next to him talking.</p><br/><p>At this moment, he was completely awakened. He realized why the old captain give the position to a newcomer in the team.</p><br/><p>This man might seem gentle but he was powerful. Despite the fiery interview room, he used words to lightly blow it away and shift the topic. He was like this. He was always smiling and looked like a gentle big brother but he was the toughest and calmest one on the Time team. Thus, he became the captain and a reliable support.</p><br/><p>Tan Shitian might always bully Cheng Wei with a smile but in crucial moments, he always stood up and protected Cheng Wei. If Cheng Wei looked closely, Tan Shitian’s side profile was handsome and he was as straightforward as Cat God. Tan Shitian’s handsomeness was very special. It felt as warm as a spring breeze.</p><br/><p>In the interview, Tan Shitian calmly responded to the reporters’ various questions and Cheng Wei watched him in a daze. The sharp-eyed Time fans discovered this and couldn’t help joking: [Xiao Wei, hurry and become Cat God’s black fan. Look how good our Captain Tan is!] [Will Xiao Wei become Captain Tan’s fan? Look at his infatuated eyes.]</p><br/><p>Cheng Wei’s gaze towards Tan Shitian in the interview was screenshotted by fans and spread around as widely as Cat God’s expression pack. The Time fans were connected and it swept through the major support clubs.</p><br/><p>After the interview ended, Cheng Wei turned on his phone and flushed when he saw this. “W-Which bastard, why capture this expression?”</p><br/><p>Tan Shitian was very satisfied with this picture. It was a good feeling to be watched by Cheng Wei. Had this person finally realized that his Captain Tan was actually very handsome?</p><br/><p>***</p><br/><p>Unlike the tense atmosphere of the Time interview, the Canglan members were warmly baptized with flashes and claps.</p><br/><p>The captain and vice-captain of Canglan attended together. The first question from a reporter was, “Cat God, how do you feel about finally reaching the playoffs after so many ups and downs?”</p><br/><p>Li Cangyu replied directly, “It feels like a heavy burden on my shoulder has finally been put down. My body is very relaxed.”</p><br/><p>A reporter interjected, “Cat God, don’t you think that the playoffs are a heavier burden?”</p><br/><p>Li Cangyu smiled. “In fact, my biggest concern has always been for Canglan to enter the playoffs. The matches after that won’t have too much pressure. I will play in a relaxed mood and might see the trophy if I’m lucky.”</p><br/><p>“Do you feel that Canglan’s strength is enough to match Wind Colour and Ghost Spirits?”</p><br/><p>Li Cangyu confidently nodded. “Of course, our team can’t be weak if we made it to the playoffs. Our overall strength is no worse than Ghost Spirits and Wind Colour.”</p><br/><p>The reporters applauded his confidence. As for why he directly ignored the other team Flying Feathers, it was because based on Flying Feathers’ current results, they wouldn’t meet Canglan in the playoffs.</p><br/><p>“Vice-Captain Bai, what do you think about the status of the players? In particular, will the four newcomers be able to cope with the pressure of the playoffs?”</p><br/><p>Bai Xuan smiled. “There should be no problem. Their hearts are very strong after being abused by our captain.“</p><br/><p>“The opponent in your next match is still unsure. Canglan won against Time and your score is exactly the same as Flying Feathers. However, the match between Flying Feathers and Ghost Spirits isn’t over. If the points aren’t enough then Canglan will be third. According to the rules of the playoffs, the fourth place will face Wind Colour in the semi-finals.” This reporter was obviously concerned about the playoffs. He looked at the charts on his laptop and asked, “If the next game is against Wind Colour, do you think there is a chance of victory.”</p><br/><p>Li Cangyu and Bai Xuan looked at each other. To tell the truth, if they directly confronted Wind Colour in the next match then Li Cangyu only had a 40% chance of winning. However, it wasn’t impossible to play. He had to use his home court advantage as much as possible.</p><br/><p>Li Cangyu thought this and replied bluntly. “Just based on strength, we have a 40% chance of winning. Still, Canglan has better luck recently. If I add the 20% luck then I have 60% confidence in winning.”</p><br/><p>The reporters, “…”</p><br/><p>Cat God, how are you calculating things? Was your maths taught by a language teacher?</p><br/><p>On reflection, didn’t his words seem a bit reasonable? Canglan’s luck had really picked up recently. They were almost knocked out and then Time experienced a big loss, giving Canglan another chance. If this wasn’t luck then what was?</p><br/><p>How far could the lucky cat go in the playoffs? Everyone was full of expectations.</p><br/>\n</div>"}