{"title": "Chapter 217", "id": 217, "volume": 3, "url": "http://boxnovel.org/god-level-summoner-chapter-217", "volume_title": "Volume 3", "body": "<h1>Chapter 217</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 217 – Finals (3)</p><hr/><br/><p>The official reporters for the Miracle Professional League and the people on the forums were paying attention to the finals. Canglan using the fire dragon to counterattack against Wind Colour and win was quickly released. The big websites and forums were filled with titles like—[The dragon is ruined for a lifetime!] [Wind Colour’s advantage was countered and Canglan unexpectedly took one point first!] [Li Cangyu’s strange tactics allowing Canglan to defeat Wind Colour at home!] [Who will be the ultimate winner of this fateful showdown?]</p><br/><p>In just a few minutes, the forums were filled with Canglan fans while Li Cangyu’s Weibo had messages like: [Cat God, marry me!]</p><br/><p>[Cat God gave me a monkey.]</p><br/><p>In contrast, the mood of the Wind Colour fans was relatively low. However, most of the rational fans were still full of confidence in the Wind Colour team led by Ling Xuefeng.</p><br/><p>The intermission time finished and the second game officially started.</p><br/><p>It was Li Cangyu’s turn to choose the game mode and map. Many people guessed that he would choose the arena but Li Cangyu unexpectedly chose the team battle and the map was Frost Temple. It wasn’t a difficult map and was only rated five and a half stars.</p><br/><p>Unlike the dim lighting of the Wilderness Ridge, Frost Temple was very bright. The angel temple was magnificent with crystal lamps hanging from the roof. The ancient white pillars were engraved with delicate patterns and the white stone bricks on the ground were clean and immaculate, allowing a person to see their reflection.</p><br/><p>Frost Temple was a relatively common obstacles map. There were many stone pillars in the temple and ranged players with first-class movement techniques could successfully attack.</p><br/><p>Canglan had Li Cangyu and Xie Shurong. The former was good at using pets to interfere with opponents while the latter was good at violent outbreaks. This map was good for them to release their highest output.</p><br/><p>Then the lineup that Li Cangyu submitted to the referee appeared on the screen—Li Cangyu, Gu Siming, Zhuo Hang, Zhang Jueming, Bai Xuan and Xie Shurong.</p><br/><p>Xiao Han was changed to Zhuo Hang. It was because Zhuo Hang’s hand speed was faster and he could use traps to help Li Cangyu and Xie Shurong control the opponents they were targeting.</p><br/><p>Use obstacles to play quickly.</p><br/><p>Zhuo Hang’s traps could be arranged in combination with the terrain, allowing the members of Wind Colour to accidentally step on the traps after going around a pillar. After being fixed in place or silenced, Li Cangyu and Xie Shurong would jointly attack to kill the player. This way, their skills would be smoothly connected.</p><br/><p>How should Wind Colour respond?</p><br/><p>Many viewers were looking forward to Captain Ling’s deployment and thought he would take a long time to think. The result was that he submitted the lineup in 10 seconds—the berserker Liao Zhenyu, the black magicians Yan Ruiwen and Guo Xuan, the summoners Ling Xuefeng and Xu Feifan and the blood kin sacrifice He Qun.</p><br/><p>Wind Colour actually changed Qin Mo.</p><br/><p>Many viewers couldn’t help sighing. [Canglan’s small prince was withdrawn and now Wind Colour’s small prince is also withdrawn. Is this really a coincidence?] [I think it is due to Qin Mo’s mistake last game. Captain Ling wants him to adjust.] [Not necessarily. After all, Xu Feifan and the captain have been partners for a long time. It might be more stable to change to an old partner.]</p><br/><p>The audience was discussing it but Qin Mo’s expression was calm. He seemed to have known about this arrangement for a long time.</p><br/><p>The players on both sides quickly got into position and the countdown to the map loading started on the big screen.</p><br/><p>***</p><br/><p>The Frost Temple map loaded and Canglan was born in the lower left while Wind Colour was in the upper right.</p><br/><p>Li Cangyu slightly changed the mode of splitting. Shu Bai still went to the middle, Gu Siming and Zhuo Hang went to the top while he went to the bottom with Zhang Jueming. The players that the resources were focused on in the early stages were naturally Ah Shu, Xiao Zhuo and Li Cangyu. The other teammates consciously gave them the resources.</p><br/><p>On the Wind Colour side, Ling Xuefeng’s arrangement made many people stunned.</p><br/><p>They saw the blood kin summoner Xu Feifan, the berserker Liao Zhenyu and the demon summoner Ling Xuefeng go to the top road together. The black magician Guo Xuan and blood kin sacrifice He Qun were in the middle while Vice-Captain Yan Ruiwen went alone!</p><br/><p>Yu Bing was surprised. “The team is using the 3, 2, 1 splitting mode. It seems Captain Ling wants to grab some heads on the road.”</p><br/><p>Kou Hongyi looked at both sides and said, “The blood kin race can go invisible so Canglan players are likely to make the wrong judgment.”</p><br/><p>Yu Bing nodded. “This splitting mode is really difficult to guess.”</p><br/><p>***</p><br/><p>In Canglan’s command channel, Gu Siming actively reported, “I found Ling Xuefeng and Liao Zhenyu on the road!”</p><br/><p>Ah Shu said, “The middle is Guo Xuan.”</p><br/><p>Li Cangyu only saw Yan Ruiwen so there was likely a blood kin summoner in the middle and lower roads. As for whether it was a healer or summoner, Li Cangyu couldn’t decide.</p><br/><p>Li Cangyu was silent for a moment before calmly issuing instructions. “Don’t go forward before the blood kin on the other side emerges. Play stably.”</p><br/><p>Everyone said they understood.</p><br/><p>One minute after the opening, the first wave of mobs officially refreshed. Gu Siming was ready to throw protection skills on Zhuo Hang while Zhuo Hang quickly placed traps to clean up the mobs in front of him.</p><br/><p>The opposite Liao Zhenyu and Ling Xuefeng also played stably. The former was responsible for interference protection while the latter was responsible for output.</p><br/><p>The invisible Xu Feifan stood beside a stone pillar and waited for an opportunity.</p><br/><p>Xu Feifan was very patient and stayed invisible for nearly a moment.</p><br/><p>This lasted until a blue mob refreshed and Zhuo Hang moved forward a bit to place a trap. As a result, a blood spider bit down on Zhuo Hang and fixed him in place.</p><br/><p>Gu Siming was shocked and immediately threw a protection skill on Zhuo Hang. However, Ling Xuefeng’s banshee acted at this time, directly pulling Gu Siming forward and making him surrounded by skeleton infantry!</p><br/><p>—Skeleton Explosion!</p><br/><p>—Blood Snakes Entanglement!</p><br/><p>—Cut Through Thorns!</p><br/><p>The summoners and berserker of Wind Colour used high damage skills. No matter how thick Gu Siming’s skin was, he was attacked by three players and fell in 10 seconds.</p><br/><p>Once Xiao Gu died, Zhuo Hang couldn’t run away and also gave his life away.</p><br/><p>[Undead Demon has killed As the Name Suggests, first kill!]</p><br/><p>[Undead Demon has killed Great Navigator, second kill!]</p><br/><p>Ling Xuefeng got two heads, which was undoubtedly the worst news for Canglan.</p><br/><p>Xiao Gu spoke with dismay, “I didn’t expect the blood kin summoner to be there as well!”</p><br/><p>Zhuo Hang was also depressed. “Three against two!”</p><br/><p>Li Cangyu glanced at the situation and was helpless regarding Xiao Gu and Xiao Zhuo’s deaths.</p><br/><p>In the last game, he set up an ambush and stole the fire dragon. This game, Ling Xuefeng used the stealth characteristic of the blood kin members to form a three on two situation, forcibly killing Xiao Gu and Xiao Zhuo. It was a very powerful counterattack.</p><br/><p>The thing that made Li Cangyu have a headache was that once Ling Xuefeng got a head, his explosive power was quite scary. It would be difficult to fight in a team battle.</p><br/><p>Since there was the invisible blood kin player, Li Cangyu and Zhang Jueming didn’t rush to face Yan Ruiwen. By the time they realized that Yan Ruiwen was alone and wanted to kill him, the vice-captain had already retreated from their attack range.</p><br/><p>It was obvious that Ling Xuefeng had long arranged this tactic and Li Cangyu couldn’t guess it. He could only acknowledge it.</p><br/><p>***</p><br/><p>The first wave of mobs finished and Ling Xuefeng got a double kill, becoming the richest in the game. He directly bought the Witch’s Tears necklace that increased attack power.</p><br/><p>Zhuo Hang and Gu Siming weren’t able to make much money because they were killed and were poor.</p><br/><p>Bai Xuan asked softly, “Our equipment is too poor. Do you want to set up an ambush?”</p><br/><p>Li Cangyu replied, “The same tactic can’t be used twice. This time, Ling Xuefeng will be prepared and an ambush won’t work. We will directly give up the ice dragon and stay in the wild area to clear mobs.”</p><br/><p>“The Canglan team gave up the ice dragon!” Kou Hongyi was amazed. “You know, the ice dragon’s economy bonus is very impressive. If Canglan abandons the ice dragon then their gap with Wind Colour will only become greater!”</p><br/><p>Yu Bing had a different opinion. “I think that Cat God’s choice is very wise. Ling Xuefeng has two kills and his attack power is very scary. Meanwhile, Zhuo Hang and Xiao Gu’s equipment aren’t so good. If they face the Wind Colour team and Ling Xuefeng gets three or four kills, it is a direct defeat.”</p><br/><p>Kou Hongyi thought about it and nodded. “Yes. Avoid a group battle and look for a chance to turn the situation on Wind Colour.”</p><br/><p>This was exactly what Li Cangyu thought.</p><br/><p>Canglan wasn’t in a good position. Due to Ling Xuefeng and Xu Feifan’s trick, Ling Xuefeng had two kills and the equipment advantage. A direct group battle would result in Canglan being destroyed. It was more sensible for Canglan to go to the wild areas and increase their economy.</p><br/><p>The situation of the entire Canglan team was weak. There was no need to face Wind Colour from the front.</p><br/><p>The second wave of mobs refreshed in the wild area and Li Cangyu took his teammates to earn some money.</p><br/><p>Meanwhile, all members of Wind Colour were fighting the ice dragon. Canglan ran to the wild area to face the mobs. The economy wasn’t as big as the ice dragon bonus but it eased the disadvantage and let Xiao Gu and Xiao Zhuo buy key equipment.</p><br/><p>***</p><br/><p>A moment later, the message that Wind Colour had killed the ice dragon popped up on the screen.</p><br/><p>Li Cangyu’s expression was very calm since he had long expected this.</p><br/><p>The ice dragon was taken away by Wind Colour and the gap between teams further increased. Still, it was gratifying to note that the initially suppressed Xiao Gu and Xiao Zhuo finally got enough money to buy a ring.</p><br/><p>On the VIP stands, Cheng Wei felt anxious. “If Wind Colour gains the fire dragon then it will be bad for Canglan. Will they set up an ambush like the last game?”</p><br/><p>Tan Shitian touched his chin. “Captain Ling won’t fall for the same trick. I think he won’t go for the fire dragon at all in this game.”</p><br/><p>Cheng Wei asked, “You mean, they are going to fight directly in the middle?”</p><br/><p>Tan Shitian replied, “There is a possibility.”</p><br/><p>In fact, Tan Shitian guessed wrong. The Canglan team didn’t rush to push towards the tower in the middle.</p><br/><p>The rhythm of this game was obviously much slower than the previous one. Both sides actually started to clear the third wave of mobs!</p><br/><p>The time limit for a Miracle team battle was 30 minutes. If no one was able to destroy the crystal after 30 minutes, the outcome would be judged based on the economy.</p><br/><p>In general, a crystal would be destroyed in 20 minutes. If the dragon wasn’t fought and the team pushed directly to the crystal, it was likely to be destroyed in 15 minutes.</p><br/><p>Ling Xuefeng didn’t kill the fire dragon boss and Li Cangyu also didn’t go. The two sides started to clear the third wave of monsters. This situation was rare in the seventh season and the commanders on both sides were quite patient.</p><br/><p>The mobs gave less money but the accumulation of money from the third wave of mobs was still a lot.</p><br/><p>Ling Xuefeng had the double kills and the ice dragon bonus. To the audience’s surprise, he had enough money to buy a weapon but he didn’t buy the staff that had a high crit rate. Instead, he bought an item from the battlefield store—Stealth Cloak.</p><br/><p>Captain Ling put on the invisibility cloak and disappeared from the map…</p><br/><p>The Wind Colour fans were gobsmacked. Wind Colour had been playing for many years but they had never see Ling Xuefeng go invisible before!</p><br/><p>The live broadcast room was filled with comments like: [Where is Captain Ling?] [Captain Ling said that he wanted to play an invisible blood kin!] [The disappeared Captain Ling wore the stealth cloak to find Cat God and get revenge!]</p><br/><p>Li Cangyu wasn’t aware of this.</p><br/><p>The Stealth Cloak wasn’t worthwhile because it was quite expensive. It was around the same price as a weapon and only lasted one minute. Once the user launched an attack, the cloak would become invalid, similar to the blood kin’s stealth skill.</p><br/><p>A blood kin character definitely wouldn’t buy this item and teams without a blood kin character wouldn’t spend a lot of money buying a cloak for the stealth skill. Thus, the ‘invisibility cloak’ item was often bought by players in the online game. However, the probability of it appearing in the Miracle League was infinitely close to 0%.</p><br/><p>Now Ling Xuefeng actually bought the cloak…</p><br/><p>In the competition, a person who bought the cloak would definitely be called a pig teammate.</p><br/><p>Yet the one wearing the cloak was the first male god of the league, Ling Xuefeng. Who would dare to curse him? On the contrary, everyone thought that Captain Ling must have a reason for doing this. Captain Ling was really unpredictable and him being in stealth was cool.</p><br/><p>In the wild area, Li Cangyu and Zhang Jueming were killing mobs. Yan Ruiwen and He Qun appeared in the same area. He Qun’s non-combat stealth skill had been used and this time he was forced to be seen.</p><br/><p>The middle of the road contained Liao Zhenyu and Guo Xuan. On the remaining road, only Xu Feifan was seen. After this was reported in the command channel, Li Cangyu was surprised. “Where is Ling Xuefeng?”</p><br/><p>Bai Xuan replied, “I don’t know.”</p><br/><p>Li Cangyu ordered, “Everyone be careful. He might be going to the middle or south roads to catch people!”</p><br/><p>In fact, Ling Xuefeng was wearing the Stealth Cloak and standing in front of Li Cangyu, quietly watching Li Cangyu kill the mobs.</p><br/><p>The audience, “…”</p><br/><p>Captain Ling, you really spent a lot of money to catch Cat God!</p><br/>\n</div>"}