{"title": "Chapter 212", "id": 212, "volume": 3, "url": "http://boxnovel.org/god-level-summoner-chapter-212", "volume_title": "Volume 3", "body": "<h1>Chapter 212</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 212 – Canglan VS Ghost Spirits (6)</p><hr/><br/><p>In accordance with the idea of tearing apart the Lou Zhang combination, Zhang Shaohui would play with the paladin in the opening while Lou Wushuang would play with the blood kin sacrifice. One opening and one ending the game, this would form a ‘double insurance’ for the Ghost Spirits team. Even if the initial situation was a disadvantage, they could find a way to move back the situation.</p><br/><p>Surprisingly, Li Cangyu sent Zhuo Hang and Xiao Han in the first stage of the arena game.</p><br/><p>Everyone familiar with the Canglan team knew that Zhuo Hang normally formed a combination with Li Xiaojiang.</p><br/><p>Li Xiaojiang was as slow as a snail while Zhuo Hang was as fast as lightning. The seemingly uncoordinated fast and slow combination formed a distinctive style under Li Cangyu’s guidance. However, in the regular season, the Zhuo Li combination didn’t play as well compared to other combinations. It was easy for them to be restrained when encountering great gods.</p><br/><p>In the regular season, Xiao Han mostly paired up with Li Cangyu. Today, Li Cangyu tore apart the Zhuo Li combination and placed Zhuo Hang and Xiao Han together.</p><br/><p>Lou Wushuang was silent for a moment before submitting his lineup, Zhang Shaohui and Mo Yuan.</p><br/><p>The fans of Ghost Spirits were surprised by this. The Lou Zhang combination had been inseparable since their debut. Captain Lou could always be found where his stupid brother was but today, the Lou Zhang combination was actually split apart!</p><br/><p>The Canglan fans were happy. [After meeting our Cat God, the Tan Cheng combination was also torn apart. Now it is the Lou Zhang combination!] [Our Cat God is the professional combination demolisher in the league. Any combination that meets him has to be torn apart!]</p><br/><p>The captains of the other teams felt helpless about this point. There had been too many changes to the arena. In particular, the pairs arena of the new season was very favourable to Canglan’s lineup configuration.</p><br/><p>Canglan had many new people. Their state wasn’t stable but this also had a benefit. It was easier for newcomers to accept the new system and the captain often sent a combination that other teams couldn’t guess.</p><br/><p>For example, today was the first time Zhuo Hang and Xiao Han appeared together. Li Cangyu dared to send these two people in the playoffs, showing he was very confident in them.</p><br/><p>In fact, this might be the first time Zhuo Hang and Xiao Han were playing as ‘partner’s in the league but they often played together during daily training and were very familiar with each other. There was an understanding between them. After this week’s intensive training, they were now skilled in keeping up with each other’s ideas.</p><br/><p>—Hit quickly.</p><br/><p>This was the reason why Li Cangyu sent Zhuo Hang and Xiao Han.</p><br/><p>***</p><br/><p>At the beginning of the fourth game, the assassin and paladin of Ghost Spirits faced the assassin and hunter of Canglan.</p><br/><p>As both sides tested each other in the beginning, Kou Hongyi took the opportunity to explain, “There is a chance for both sides to win. On Ghost Spirits’ side, the paladin will obviously protect Vice-Captain Zhang and let Zhang Shaohui be the main output. On the Canglan side, Zhuo Hang play the role of protection and auxiliary output. Xiao Han is the main output.”</p><br/><p>“Based on attack power, the Canglan side is higher but Ghost Spirits can last longer. This is like a sharp bayonet stabbing a solid shield. Either the bayonet will be broken or the shield pierced. We can’t rely on data to calculate it. Everything will depend on the timing of player on both sides…”</p><br/><p>As he said this, Zhang Shaohui suddenly used Combat Stealth!</p><br/><p>The assassin’s combat invisibility skill had a short effect but the cooldown time was very long. An average player wasn’t willing to use it if it wasn’t a critical moment. Zhang Shaohui suddenly opened stealth, confusing many audience members.</p><br/><p>The next moment, everyone saw ‘Shadow’ suddenly appear behind Zhuo Hang and used Pain Blade!</p><br/><p>Zhuo Hang was dizzy and Zhang Shaohui used the assassin’s big moves, dropping his blood to 50%!</p><br/><p>Xiao Han saw that his teammate was attacked and immediately went to repay the favour to Zhang Shaohui. However, the paladin directly used Guardian’s Power and placed a golden shield on the vice-captain. All of Xiao Han’s attacks were transferred to the paladin’s body.</p><br/><p>A few seconds after Zhang Shaohui’s combo ended, the effect of Guardian’s Power was about to end. He no longer tried to fight and retreated to the paladin, running behind a pillar with his teammates.</p><br/><p>Li Cangyu observed this scene and couldn’t help feeling admiration. Vice-Captain Zhang was a warm person who was a bit silly. Along with Cheng Wei, they were called the two silly gods and people often laughed at their IQs…</p><br/><p>Still, his knowledge of the game was a match for any great god and he had been with Lou Wushuang for a long time. His observation and awareness were very sensitive. Zhuo Hang and Xiao Han’s combined attack power was much higher than his assassin but he could use the protection of the paladin to find a chance to fight a consumption battle.</p><br/><p>Hit and run, this type of practice was very smart. Lou Wushuang inwardly praised Zhang Shaohui. He often inwardly scolded this person for being a fool but that was only when it came to life. Who would dare to underestimate the ace assassin of Ghost Spirits?</p><br/><p>Vice-Captain Zhang’s sudden attack caught Zhuo Hang and Xiao Han off guard. Zhuo Hang’s health fell to 50% while Xiao Han’s attacks were transferred to the paladin. The paladin had thick skin and Xiao Han only knocked out 30% of his blood.</p><br/><p>This blood volume advantage, Xiao Zhuo quickly understood.</p><br/><p>Zhang Shaohui used the paladin to delay the battle. As a result, Xiao Han and Zhuo Hang couldn’t kill the paladin and lost blood. It would be easy for Zhang Shaohui to take the opportunity to collect their heads.</p><br/><p>They couldn’t let him do this!</p><br/><p>Zhuo Hang made a decision and placed a blue mark on the map for Xiao Han.</p><br/><p>The two people had trained together and Xiao Han naturally knew the meaning of the blue mark. He quickly opened Combat Stealth to hide and moved around a pillar. Zhuo Hang walked in front of used Flying Feather Steps to set a trap that held Zhang Shaohui in place!</p><br/><p>The assassin was invisible and the hunter placed a trap. Did they mean to kill the vice-captain? The paladin Mo Yuan thought this and immediately placed the live-saving skill ‘Iron Will’ on Zhang Shaohui!</p><br/><p>Iron Will, it placed a golden shield on the specified target and made them immune to all damage for three seconds!</p><br/><p>This was three seconds of invincibility and the timing of the trap on Vice-Captain Zhang would be gone in three seconds. The paladin’s rapid response was understandable.</p><br/><p>To the surprise of the audience, Zhuo Hang and Xiao Han’s goal wasn’t Zhang Shaohui at all!</p><br/><p>After Zhang Shaohui was set in place, Zhuo Hang turned to the paladin without hesitation and circled him at a very fast speed, setting death traps in the front, rare, left and right.</p><br/><p>At the same time, Xiao Han broke out his attack power. He waved the dagger in his hand and completed the big move, Death Strangulation!</p><br/><p>The paladin’s thick skin fell to 45% under the combined attacks of the two teenagers.</p><br/><p>Kou Hongyi understood this and couldn’t help clapping. “I didn’t think of this! Zhuo Hang set Zhang Shaohui in place to deceive the paladin into using his big move. These small people of Canglan were really raised by Cat God, they are too bad!”</p><br/><p>Yu Bing was very pleased with this. Previously, the teenagers gave the impression that they always listened to Cat God. They followed him everywhere, were happy when he praised him and felt frustrated when he scolded them. They were like small babies who hadn’t grown up…</p><br/><p>Today, she discovered that something was different about Zhuo Hang and Xiao Han.</p><br/><p>They learnt to think for themselves and found ways to deal with complex situations.</p><br/><p>The two teenagers didn’t panic in front of the sudden attack of the first-class assassin in the league. They were flustered but soon recovered and made a fierce counterattack!</p><br/><p>This was the quality that a professional player should have.</p><br/><p>If they forever relied on Li Cangyu then they would never grow up. Fortunately, these young rookies found a style that suited them. They learned to think calmly in the game and rely on their own strength to win!</p><br/><p>This was the first time Zhuo Hang and Xiao Han were teaming up on the field but they were indeed talented rookies. This wave of counterattacks was quite beautiful and Zhang Shaohui’s initial advantage was reversed.</p><br/><p>By the time Zhang Shaohui’s control effect ended, the thick-skinned paladin had less than half his blood left. Xiao Han and Zhuo Hang’s big moves were on cooldown and they went behind a stone pillar.</p><br/><p>The two sides once again stood on the same line.</p><br/><p>The rest of the game was a consumption battle. The Ghost Spirits fans were a bit anxious but Li Cangyu knew that Zhang Shaohui’s performance wasn’t over yet.</p><br/><p>Yes, he had Combat Stealth!</p><br/><p>The reason why he used it in the beginning was because the skill cooldown was very long!</p><br/><p>It took nearly three minutes for this signature skill to cooldown. The earlier he used it, the sooner the cooldown time would end. Now it was almost the time when he could use it again!</p><br/><p>Sure enough, the moment the cooldown ended, Zhang Shaohui was hidden again and moved behind Zhuo Hang. He used a set of explosive moves to kill the residual blood Zhuo Hang!</p><br/><p>[Shadow has killed Great Navigator!]</p><br/><p>Zhuo Hang felt slightly helpless but there was no other way. The explosive power of an assassin was very amazing, especially after using stealth.</p><br/><p>Once the hunter died, Xiao Han wasn’t able to hold on for long. He soon fell under Zhang Shaohui’s onslaught. Before he died, he used all his skills to kill the paladin so that Canglan didn’t eat too much of a loss in the first round.</p><br/><p>The two of them left their seats and headed back to the team. Li Cangyu smiled and patted their shoulders. “It was a good fight.”</p><br/><p>Zhuo Hang and Xiao Han glanced at each other and felt slightly puzzled.</p><br/><p>Li Cangyu explained, “Winning or losing is secondary. Your performance made me very satisfied. Sit down and rest first.”</p><br/><p>The two teenagers who were praised sat down and looked forward to the next performance of their teammates.</p><br/><p>They didn’t win against Zhang Shaohui but they killed the thick-skinned paladin. Zhang Shaohui still had a lot of blood but he used many explosive skills. It definitely wasn’t a problem to hand him over to the Shu Bai combination.</p><br/><p>Sure enough, after a short break, Canglan sent Xie Shurong and Bai Xuan.</p><br/><p>Zhang Shaohui expected this but he had more than enough strength. One person faced two people so he could only use all his skills. He only had 20% blue left but he had to delay as much as possible and consume Bai Xuan’s blood adding skills.</p><br/><p>In a few minutes, Zhang Shaohui was sent off by Ah Shu.</p><br/><p>The Ghost Spirits team sent their second combination.</p><br/><p>Flowing Moon and Quicksand, these two players were newcomers brought by the Lou Zhang brothers from the training camp. After the veteran players retired, they became main assassins.</p><br/><p>Their standards were slightly worse than the Lou Zhang combination but they were excellent in the entire league, comparable to the two Liang archers of the Time team.</p><br/><p>Xie Shurong and Bai Xuan weer good at a battle of attrition while the two assassins of Ghost Spirits were good at a fast outbreak. Both sides exchanged skills, the two assassins joining forces to defeat Xie Shurong. Xie Shurong lost a lot of blood only for Bai Xuan to make him full of blood again. This was quite a test of the psychological quality of players. The two members of Ghost Spirits wanted to break their keyboards!</p><br/><p>Bai Xuan had a very strong survivability and was a cockroach who wouldn’t die. This round was dragged out for 10 minutes.</p><br/><p>As soon as Bai Xuan’s blue emptied, the two assassins sent this super dad away but the price paid was extremely heavy. They were cut to just a trace of blood by Xie Shurong!</p><br/><p>Then Xie Shurong used Light and Shadow Rotation and took the lives of the two assassins.</p><br/><p>Looking at the graceful terran swordsman standing in the centre of the square with 20% blood and blue left, the fans of Canglan cheered excitedly while the Ghost Spirits fans were distraught.</p><br/><p>The Shu Bai combination in the second round was too difficult and the two assassins were killed. This way, Ghost Spirits would enter the final stage in a disadvantageous situation and there was the older brother who was even harder to deal with!</p><br/><p>Would Captain Lou have any other methods?</p><br/><p>Everyone was making guesses when the third combination for Ghost Spirits appeared on the screen.</p><br/><p>—Lou Wushuang and Zhou Jianan.</p><br/><p>The captain brought the blood kin sacrifice with him!</p><br/><p>The fans of Ghost Spirits brightened up as they seemed to see hope for victory. However, Li Cangyu’s lips slightly curved.</p><br/><p>Using a sacrifice to slow the rhythm, Captain Lou was truly a very thoughtful commander… however, if he knew the lineup that Canglan would dispatch, wouldn’t he be angrily vomiting blood?</p><br/>\n</div>"}