{"title": "Chapter 215", "id": 215, "volume": 3, "url": "http://boxnovel.org/god-level-summoner-chapter-215", "volume_title": "Volume 3", "body": "<h1>Chapter 215</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 215 – Finals (1)</p><hr/><br/><p>The schedule for the playoffs was relatively tight. After the semi-finals, the Canglan team only had three days of rest. Li Cangyu didn’t intend to return to Changsha. Instead, he found an Internet cafe near the hotel where everyone could focus on training.</p><br/><p>In the regular season, Canglan won against Wind Colour 2:1 in an away match while Wind Colour won 2:1 at the home. The two sides were tied but Li Cangyu was well aware that Wind Colour didn’t do their best in the regular season. In particular, Ling Xuefeng didn’t appear in two games and sent the newcomers to train.</p><br/><p>Ling Xuefeng wouldn’t be so relaxed in the finals and it would be more difficult to play.</p><br/><p>The major teams of the Miracle League had distinctive features. Wind Colour might be dominated by the dark style but the overall configuration of players was very reasonable. Their tactics weren’t too singular. The black magicians would give negative states while the summoners controlled the opponents. This lineup had a strong overall force. They could move forward and retreat, attack and defend. Ling Xuefeng’s stable command also made Wind Colour an extremely difficult enemy.</p><br/><p>However, Li Cangyu wasn’t stressed about the result of the finals. He had already reached this stage and winning or losing wasn’t his obsession. Instead, he was very excited at the thought of playing in the finals and wasn’t able to sleep well these days.</p><br/><p>The result of Cat God’s hyperactive spirit was that all team members once again entered the devil training. It was impossible to improve the level of their game in just three days. The more important thing was to consolidate their previous training results in case they drop the chain in the finals.</p><br/><p>The intensity of the training was high but everyone’s mood was relatively relaxed.Ah Shu said very happily, “It is also good to be runner-ups. The runner-up also gets a money reward.”</p><br/><p>The eyes of the teenagers lit up and Old Zhang couldn’t help patting him on the back. “Don’t be so worldly okay? The significance of the prize isn’t money… although I also like the prize money.”</p><br/><p>Bai Xuan watched their boisterous actions with a warm smile, like he was watching his own family.</p><br/><p>He had followed Li Cangyu for many years and the atmosphere of the former team wasn’t so harmonious. Due to their frequent losses, everyone’s mood was always low and they weren’t happy when training. Now it was different. Everyone moved shoulder to shoulder, struggling until they finally reached the finals and could aim for the championship.</p><br/><p>Canglan had already become a first-class team in the league.</p><br/><p>Li Cangyu saw Bai Xuan’s thoughtful expression and joked, “Are you starting to feel it now?”</p><br/><p>Bai Xuan looked back at him and smile. “So many years have passed and I didn’t think that one day I could really enter the finals. Strangely, my mood is relaxed and I’m not nervous at all.</p><br/><p>Li Cangyu nodded. “I am the same. At this step, winning or losing isn’t important. Of course, being able to take the championship is still the best outcome.”</p><br/><p>Bai Xuan reached out a hand. “Then let’s try it!”</p><br/><p>***</p><br/><p>The atmosphere on Canglan’s side was relaxed and the players of Wind Colour also weren’t nervous. The players seemed confident in defeating Canglan.</p><br/><p>Ling Xuefeng called everyone to a pre-match meeting and said seriously, “Don’t underestimate the Canglan team. Their tactical layout has the most possible changes in the Miracle League and the combination of eight classes will produce a variety of different effects. Li Cangyu has high tactical literacy and I can’t guess what type of combinations he will send in the finals.”</p><br/><p>Sure enough, Captain Ling couldn’t guess whenever he encountered Canglan…</p><br/><p>Ling Xuefeng paused before continuing, “However, the changes doesn’t change the Canglan team. We just need to grasp their core and find out how to deal with it…”</p><br/><p>The captain started to patiently analyze the characteristics and weaknesses of each combination. The players listened carefully. After the pre-match meeting, everyone consciously sat down at their computers to start the final training.</p><br/><p>***</p><br/><p>Time flew extremely quickly and three days passed in an instant. The finals of the seventh season of the Miracle League finally opened on the weekend at 9 a.m. at the main venue in Beijing.</p><br/><p>The price of the ticket for the finals was extremely high but it was sold out in less than 10 minutes. The venue was crowded with people while the VIP stands were particularly star-studded. Tan Shitian, Cheng Wei, the Su Yu brothers of the Flying Feathers team, the Lou Zhang combination of the Ghost Spirits team, Red Fox’s captain and vice-captain, the best auxiliary Chu Yan, the hunter Jiang Xu, etc. All the gods who were famous in the Miracle League came to watch the finals.</p><br/><p>It could be seen that the great gods of other teams were very interested in this old confrontation and came to witness a wonderful moment.</p><br/><p>The audience was in high spirits and the number of people watching the Internet live broadcast reached record highs. The front page headlines of e-sports websites were all full of guesses and prospects…</p><br/><p>After many years, the oldest opponents were meeting for the first time in the finals. This alone was enough to detonate the audience’s attention.</p><br/><p>In the commentators’ room, Kou Hongyi’s hairs were pricking up with excitement and his voice was very high-pitched. “Audience members, the finals between Canglan and Wind Colour is about to begin! The players from both sides had already arrived on the big stage. Let’s first look at the players of both teams!”</p><br/><p>On the big stage where lights were flashing, the two teams stood next to each other. Li Cangyu and Ling Xuefeng stood side by side while the other players fanned out next to them. The Wind Colour team members on the left were wearing red and black uniforms. The Canglan members on the right were wearing blue and white. The couple clothes really made it seem like a fateful match.</p><br/><p>Information appeared on the big screen while the camera zoomed in on the corresponding player.</p><br/><p>Li Cangyu was very handsome as he smiled at the camera. He waved and greeted everyone. Vice-Captain Bai had a gentle smile while Ah Shu deliberately brushed at his bangs to look cool. Old Zhang grinned boldly. Among the teenagers, Xiao Han still showed a cold expression, Zhuo Hang behaved graciously, Gu Siming was excited and Li Xiaojiang shyly lowered her head.</p><br/><p>The eight people with different personalities formed the Canglan team. It really wasn’t easy to get here and the audience warmly applauded them.</p><br/><p>The players on the Wind Colour side also performed calmly. After all, Wind Colour had entered the finals last season and won the championship. This grand scene was commonplace for everyone.</p><br/><p>The host handed the microphone to Li Cangyu and asked, “Cat God, this is your first time leading the team into the finals. What do you want to say to everyone?”</p><br/><p>Li Cangyu took the microphone and smiled. “I am very happy to enter the finals. I am also grateful for everyone’s support, especially the friends who came to the venue from far away. Thank you!”</p><br/><p>The spectators wearing the Canglan uniform jumped from their seats with excitement and cheers filled the venue.</p><br/><p>The host then asked, “What do you want to say to your opponent before the start of the game?”</p><br/><p>Li Cangyu glanced at Ling Xuefeng and smiled. “Captain Ling, refuel.”</p><br/><p>The audience, “…”</p><br/><p>Cat God, he is your opponent. Why are you cheering him on?</p><br/><p>The host was also surprised for a moment before recovering. Then he asked Ling Xuefeng. “Cough, what does Captain Ling want to say?”</p><br/><p>Ling Xuefeng looked at Li Cangyu and replied calmly, “You should also refuel.”</p><br/><p>The audience, “…”</p><br/><p>These two people were unprecedented opponents yet they were cheering for each other?</p><br/><p>What about the fated enemies where one lived and one died? The two of them were supposed to look at each other with fiery eyes and say things like ‘come on’, or ‘wait for me to abuse you.’ What was with the cheers?</p><br/><p>Cheng Wei looked dazed. “I haven’t seen any opponents cheering for each other before a game.”</p><br/><p>Everyone around him nodded in agreement.</p><br/><p>After the simple interview, the players of both sides walked into their respective soundproof rooms and connected their mouse and keyboard to perform the final debugging.</p><br/><p>At 10 o’clock in the morning, the match officially started!</p><br/><p>The two captains went to the referee and started to draw lots. Ling Xuefeng made a ‘please’ gesture and said, “You first.”</p><br/><p>Li Cangyu smiled. “You first.”</p><br/><p>Ling Xuefeng didn’t argue and put his hand into the box to pull out an envelope. Li Cangyu took the other one and the two people opened it at the same time. Wind Colour was first and Canglan was second!</p><br/><p>In the finals, the second team was actually more disadvantageous. If the first team won two games then the back team would have to win two consecutive games and the possibility of making a comeback was very small. Therefore, every game must be played cautiously. Canglan absolutely couldn’t let Wind Colour take the lead to score 2:0.</p><br/><p>***</p><br/><p>Li Cangyu returned to the soundproof room and waited for the plan submitted by Wind Colour. Ling Xuefeng didn’t hesitate to submit the lineup that had already been set—team battle, Wilderness Ridge!</p><br/><p>The appearance of this map made many audience members scream, with even the great gods in the VIP stands showing admiring expressions. It was a seven star, the highest difficulty map. This was a fierce choice that was really worthy of Ling Xuefeng!</p><br/><p>The Wind Colour lineup was then shown on the big screen. Ling Xuefeng and Qin Mo’s mentor and apprentice summoning combination, Yan Ruiwen and Guo Xuan’s double black magician combination, the beast berserker Liao Zhenyu in the front row and the blood kin sacrifice He Qun.</p><br/><p>Li Cangyu had guessed this lineup before. After all, it was Wind Colour’s most stable and regular lineup.</p><br/><p>This Wilderness Ridge map was really hard to fight in because it was a death map with complicated terrain. This was actually a cemetery. If players stepped on a grave then they would be directly buried in the ground and killed. More important, the tombstones in the map changed frequently, which was equivalent to a set of flowing death traps.</p><br/><p>Li Cangyu thought for a long time while the audience members were tense. It wasn’t until the final three seconds that Canglan submitted their lineup.</p><br/><p>—Gu Siming, Zhang Jueming, the Shu Bai combination, Li Cangyu and Xiao Han.</p><br/><p>This was also a regular lineup for the Canglan team. The audience didn’t understand why he had to think about it for so long. Only the great gods sitting in the stands knew that Cat God had been thinking for so long because he was thinking about a tactical solution to deal with Wind Colour, not the lineup.</p><br/><p>The other side had made a fierce move so he had to calm down and think about the context of the game.</p><br/><p>As for what countermeasures he came up with in his head, only he would know before the game started.</p><br/>\n</div>"}