{"title": "Chapter 228 - Post-Match Interview", "id": 228, "volume": 3, "url": "http://boxnovel.org/god-level-summoner-chapter-228-post-match-interview", "volume_title": "Volume 3", "body": "<h1>Chapter 228 - Post-Match Interview</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 228 – Post-Match Interview</p><hr/><br/><p>Li Cangyu hugged Bai Xuan as soon as he got off the player seats. If Bai Xuan had abandoned his teammate at the crucial moment then it wouldn’t have been so easy to kill LIng Xuefeng. Li Cangyu only had a bit of blood left when Ling Xuefeng died. It was obvious how important the adding of blood and transfer of blue before Bai Xuan died was.</p><br/><p>They had been walking side by side for so many years and mainly faced failure together. Today, they finally joined hands to receive the crown of the championship!</p><br/><p>There was no need to express too much gratitude between the old partners. There was just a tight hug but Bai Xuan naturally understood.</p><br/><p>As he was hugged by Li Cangyu, Bai Xuan also felt moved. He had watched Li Cangyu’s hard work all those years. If it wasn’t for Li Cangyu’s firm beliefs then he wouldn’t have persisted to the end.</p><br/><p>The management and fans of Canglan who came to the venue saw Cat God and Vice-Captain Bai hugging and a few of them couldn’t help crying.</p><br/><p>They had been waiting for this moment!</p><br/><p>Their favourite players experienced so many twists and turns, from the team disbanding twice to returning with a new team. They finally reached today’s finals and worked together to win in the deciding game!</p><br/><p>Winning the championship was a dream that Li Cangyu and Bai Xuan had buried in their hearts when they were young. They had been working hard for this dream but in each season, their team was always far away from the championship.</p><br/><p>Today, as if they were dreaming, the brand new Canglan team climbed through the thorns all this way and finally won the championship of the seventh season!</p><br/><p>People were happy for Canglan and proud of Cat God and Vice-Captain Bai!</p><br/><p>Li Cangyu walked towards his teammates and immediately received a warm embrace from everyone. The four teenagers surrounded the captain while Old Zhang hugged everyone. The always lively man was really excited at this moment.</p><br/><p>The Canglan fans saw this scene and suddenly couldn’t make a sound. The team’s emblem was lifted up high and the posters were waved in the hands of those wearing a neat white uniform, forming a white and blue ocean!</p><br/><p>In the commentators’ room, Yu Bing was shaking with excitement. “Congratulations to Cat God, congratulations to Canglan! The championship of the seventh season belongs to the Canglan team! Perhaps this is beyond the expectations of many people but the Canglan members personally proved it to everyone. They won in the finals and really have the strength to win the championship!”</p><br/><p>Kou Hongyi was affected by Yu Bing’s emotions and his voice was also high-pitched. “Canglan and Wind Colour, this finals match was very fierce. I think this match will definitely be a classic match in the history of Miracle. It will be reviewed and studied repeatedly by future professional players.”</p><br/><p>“At 2 o’clock tomorrow afternoon, the Miracle League will hold the awards ceremony for the seventh season! All types of awards will be revealed. Please wait and see!”</p><br/><p>“The finals of the seventh season is over but the Miracle journey isn’t over. The World Competition is coming and the rules regarding the selection of the national team will come. Please keep an eye on the official website of the Miracle League!”</p><br/><p>“Audience members, see you again tomorrow!”</p><br/><p>The two hosts summed things up and the live broadcast video was closed. Still, many viewers were reluctant to leave the room and kept celebrating Canglan’s win. Everyone was still immersed in the fierce competition and watched the slow motion replay that relive every detail of the game.</p><br/><p>***</p><br/><p>After Li Cangyu and his team members hugged, they went to Wind Colour’s soundproof room to shake hands.</p><br/><p>The Wind Colour members were very graceful. They might’ve lost but they acted generously, especially the captain Ling Xuefeng. He took the initiative to extend his arms and hug Li Cangyu. Then he whispered, “You played very well. You are deserving of this championship.”</p><br/><p>Li Cangyu’s mood was particularly pleasant after the other person’s acknowledgement. He hugged Ling Xuefeng and smiled. “You are very powerful. I don’t know how many brain cells died in order to win against you today.”</p><br/><p>This seemed to be a joke but it was the most direct expression of Li Cangyu’s heart. It was too hard to win against Ling Xuefeng. He racked his brains in the past few days and killed many brain cells formulating various strategies. Today’s game was very thrilling. If it wasn’t for his powerful teammates, Canglan wouldn’t be able to win today.</p><br/><p>As the strongest opponents, they were very familiar with each other’s strength. There was some component of luck involved in the result. In particular, in the guard stage of the deciding game, it was obvious that Li Cangyu and Bai Xuan had a higher tacit understanding than Ling Xuefeng and He Qun.</p><br/><p>Ling Xuefeng heard this and guessed that Li Cangyu hadn’t slept well in recent days. He couldn’t help saying softly, “Yet you still won. After so many years, you finally won the championship. I am really happy for you.”</p><br/><p>Li Cangyu tightened his grip. “Thank you Xuefeng.”</p><br/><p>He knew that Ling Xuefeng wasn’t a narrow-minded person and Ling Xuefeng wasn’t bothered by the loss in the finals. Ling Xuefeng’s congratulations were sincere. They had known each other for many years and understood each other’s thoughts.</p><br/><p>The two people hugged for a long time while their teammates stared at them blankly. As if becoming aware of the eyes of their teammates, Li Cangyu patted Ling Xuefeng’s shoulder, pushed him away and continued shaking hands with the other members of Wind Colour.</p><br/><p>“Congratulations to Cat God.” Vice-Captain Yan Ruiwen spoke politely.</p><br/><p>The other players followed suit and shook Li Cangyu’s hand. “Congratulations!”</p><br/><p>Bai Xuan also received respect when shaking hands with He Qun. “Vice-Captain Bai, you are worthy of being a god level healer. I admit defeat.”</p><br/><p>Bai Xuan’s smile was very warm. “A blood kin sacrifice is difficult to play. You are also outstanding.”</p><br/><p>Xiao Han took the initiative to go to Qin Mo. “Good friend, I won.”</p><br/><p>Qin Mo almost spat out blood. “Hey, do you have to be so proud?”</p><br/><p>Xiao Han’s face was blank. “I’m proud? I’m just reporting an objective fact.”</p><br/><p>Qin Mo, “…”</p><br/><p>This person looked simple and didn’t have a mocking personality, but his half-baked Chinese was really irritating! In desperation, Qin Mo learnt from his master and hugged the mixed-race boy in front of him. “Yes, you are amazing. Congratulations on winning the championship.”</p><br/><p>Xiao Han replied seriously, “You’re welcome. Continue to play with me in the arena in the future. Don’t be disheartened because you lost.”</p><br/><p>Qin Mo, “…”</p><br/><p>Your sister!</p><br/><p>Li Cangyu heard his apprentice and Qin Mo’s conversation and really admired Xiao Han’s lack of awareness.</p><br/><p>The two princes stared at each other before Xiao Han finally extended his hand. “Goodbye, I hope to see you in the national team.”</p><br/><p>Qin Mo’s heart was slightly moved. He was just a newcomer. Was there a chance for him to be selected for the national team?</p><br/><p>He seriously looked at Xiao Han and suddenly felt that his whole body was full of motivation. No matter what, he had to fight for a spot. This opportunity was only reserved for prepared people. How would he know if he didn’t fight?</p><br/><p>***</p><br/><p>Compared to the fierceness of the finals, the image of the players shaking hands was particularly warm.</p><br/><p>The Wind Colour and Canglan fans were arguing with each other, only to feel there was no meaning when they saw this scene. The rhythm of the comments slowed down. The captains really didn’t cooperate. The fans were noisy for so long, only for the captains to hug intimately!</p><br/><p>[Scatter, stop arguing!] [Captain Ling and Cat God are hugging so happily while we are here arguing!]</p><br/><p>The two sides split up and started to focus on the live broadcast of the interviews.</p><br/><p>According to the usual practice, the losing team must be interviewed first. Ling Xuefeng arrived at the interview room with Vice-Captain Yan Ruiwen. He didn’t bring other players because he was afraid the young players would be bombarded by the reporters. Vice-Captain Yan had been in the league for many years and the reporters always gave the two old players a bit of face.</p><br/><p>Ling Xuefeng looked so serious that the reporters didn’t dare to ask questions that were too sharp.</p><br/><p>A female reporter with a ponytail stood up and asked Yan Ruiwen, “Vice-Captain Yan, I heard that you are usually responsible for the team training. What special training was done for the finals?”</p><br/><p>Yan Ruiwen smiled and replied, “We did intensive training according to Captain Ling’s arrangements. You can see that in today’s finals, Wind Colour sent a lot of combinations that never played in the regular season, such as Qin Mo and Xu Feifan’s double blood kin summoner combination. If they didn’t carry out intensive training before the game then they couldn’t have played as well.”</p><br/><p>“Do you feel that the team members played very well today?” The reporter asked sharply. “Even if the result is a loss?”</p><br/><p>“There will always be a winner and a loser in the game. You can’t deny the players’ efforts just because the result is a loss.” Yan Ruiwen smiled and answered seriously. “The Wind Colour members played with their own strength and to their own standards. I think everyone can calmly accept this outcome.”</p><br/><p>Of all the vice-captains in the Miracle League, Yan Ruiwen was the most low-key. It was precisely because Ling Xuefeng was so harsh and tough that Yan Ruiwen’s milder way of doing things released tension in Wind Colour.</p><br/><p>He answered the questions without leaking anything. The reporters couldn’t ask anything else and shifted targets. “Captain Ling, today’s finals was very exciting but I found a special phenomenon. Both Wind Colour and Canglan lost at home. The home court advantage of the regular season was broken. What do you think of this?”</p><br/><p>Ling Xuefeng replied casually, “It is just a coincidence. In the first Wind Colour game, Li Cangyu’s tactical arrangement was very clever. I didn’t expect him to use the tombstones to steal the fire dragon. In the third game, it was an arena game and it was reasonable for Li Cangyu to target the Wind Colour lineup. They gained a big advantage in advance, so that Wind Colour couldn’t recover the situation.”</p><br/><p>Captain Ling didn’t forget to praise Li Cangyu as an opponent. The female reporter followed up with another question. “How do you think Cat God played today? As the strongest opponents, what do you think about him winning the championship?”</p><br/><p>“Li Cangyu is an outstanding player. Frustration and difficulties didn’t defeat him. On the contrary, it made him stronger.” Ling Xuefeng’s eyes swept over the audience as he spoke. “He has come here step by step through the years. It really wasn’t easy. Today, his commanding was excellent and it is reasonable for him to win.”</p><br/><p>“I heard that you have a good private relationship. Were you emotionally more inclined to let Cat God win the championship?”</p><br/><p>“No.” Ling Xuefeng’s answer was very decisive. “First of all, I am the captain of Wind Colour. I will take it seriously no matter who I play against. Wind Colour did their best today and the result was due to Canglan’s efforts. It would be an insult to him if I deliberately threw the game to let him win the championship.”</p><br/><p>The reporters felt great admiration for Ling Xuefeng’s words. In fact, true respect for a player was fighting against them with all our strength. It wasn’t clear how great Captain Ling and Cat God’s private feelings were but in today’s game, both sides did their best and left a classic match that all spectators would remember.</p><br/><p>A reporter asked, “Barely missing out the championship, do you have a bit of regret in your heart?”</p><br/><p>Ling Xuefeng said, “I have done my best and witnessed Li Cangyu’s team winning the seventh season of the championship. As his friend and opponent for many years, I have no regrets.”</p><br/><p>The reporters warmly clapped the broad-minded Captain Ling.</p><br/><p>He could accept the results so calmly while giving admiration and blessings to the opponent. Ling Xuefeng was the captain of Wind Colour for a reason. He was calm, stable and wasn’t stingy enough to calculate the gains and losses of a match.</p><br/>\n</div>"}