{"title": "Chapter 250 - Tactical Reorganization", "id": 250, "volume": 3, "url": "http://boxnovel.org/god-level-summoner-chapter-250-tactical-reorganization", "volume_title": "Volume 3", "body": "<h1>Chapter 250 - Tactical Reorganization</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 250 – Tactical Reorganization</p><hr/><br/><p>After eating at noon, the other players returned to their rooms to rest. Li Cangyu privately called Su Guangmo, Tan Shitian, Lou Wushuang, Chu Yan and Jiang Xu to meet in room 601.</p><br/><p>As soon as they entered the room, they saw Ling Xuefeng’s black suitcase and LI Cangyu’s white suitcase placed side by side. The two people’s clothes were neatly hung in the closest and even the two laptops were next to each other. Obviously, the captain and vice-captain of the national team often discussed issues together.</p><br/><p>Tan Shitian touched his nose, pretended not to see anything and quietly found a place to sit down.</p><br/><p>Li Cangyu poured everyone a cup of tea. As he was pouring, he said, “This is the bamboo green leaves brought by Ling Xuefeng. Everyone should try it. We don’t have to be too serious in private meetings. If you have anything to say, feel free to say it.”</p><br/><p>Su Guangmo drank the cup of tea and actively asked, “Captain called us over. Is it to discuss the tactical groupings?”</p><br/><p>“That’s right.” Li Cangyu got straight to the point. “In the three games of the World Competition, players can’t be repeated. Thus, when arranging the lineup, try to avoid repeating personnel as much as possible.”</p><br/><p>Ling Xuefeng had sorted the information and handed it to everyone. “This is the list of partners that our national team can currently send. After today’s practice, the Jiang Zhuo hunter combination, the Su Xie swordsman combination, the Xiao Qin combination and my double summoner combination with Cat have been added.”</p><br/><p>Everyone read the material and Chu Yan was surprised. “So many?”</p><br/><p>There were many combinations on the list.</p><br/><p>For example, there was the Yan Gou black magician combination, the Tan Cheng kiting combination, the Shu Bai consumption battle combination, the Lou Zhang assassin combination, the Su Yu melee combination etc. These were the old partnerships from the major teams, as well as the several new combinations today. In the World Competition, the Chinese team could have hundreds of arrangements for players in the arena.</p><br/><p>The national team’s lineup was so luxurious that Su Guangmo couldn’t help laughing. “Thus, we have a lot of room too choose, even if the players can’t be repeated.”</p><br/><p>Jiang Xu nodded. “Yes, as long as there are six people for the arena and the economic warfare and death racing uses different tactical schemes, the number of people is more than enough.”</p><br/><p>Li Cangyu said, “I called everyone because of this. The death racing mode can’t be decided but we must handle the group battle mode. Everyone should first pick out their lineup and we will carry out the team tactical training in the afternoon.”</p><br/><p>Su Guangmo thought about it and said, “For the melee flow, the three brothers plus Meng Jie will mean a very stable front row defense. The attack is also enough. The other two players can be arranged according to the arena. It is best to arrange a protective healing class and a hunter is also a good choice.”</p><br/><p>Li Cangyu quickly typed on his laptop while listening.</p><br/><p>Lou Wushuang followed closely, “I want Yu and Meng in the front row to let them attract firepower. The remaining three assassins can safely complete the joint assassination tactics. The healer should be Vice-Captain Bai since his emergency response is relatively strong.”</p><br/><p>Chu Yan said, “There are four psychics in Pure Cleansing but only two in the national team. It is difficult to play the pure illusion style. Today’s cooperation between Guo Xuan and Yang Muzi gave me some inspiration. I want two black magicians and a white magician to fill the lack of control.”</p><br/><p>Li Cangyu carefully wrote it down and then asked, “Captain Tan and Captain Jiang? What are your thoughts?”</p><br/><p>Tan Shitian said, “Add two magicians so the control and output are more flexible.”</p><br/><p>Jiang Xu replied, “Qin Mo and Xiao Han can join the lineup for the trap flow if they don’t play in the arena. Or it can be two black magicians and a berserker. It will be relatively easy to play with them.”</p><br/><p>Li Cangyu carefully sorted it and said, “The commanders can easily adjust the lineup but the problem is that we only have two healers. Bai Xuan and Liu Xiang will have to rotate or it might be hard on them. Each lineup has to adapt.”</p><br/><p>Ling Xuefeng nodded in agreement. “This is the case. If one healer has any problems, we can’t let our tactics be ruined.”</p><br/><p>Li Cangyu followed, “Considering the pressure of the team battle, we will try not to send Bai Xuan to the arena.”</p><br/><p>Everyone agreed with this decision.</p><br/><p>***</p><br/><p>The lunch break passed quickly and everyone was filled with great energy as they came to the training room.</p><br/><p>The afternoon’s training was the team tactics and took the form of a rotating battle, just like the morning’s arena.</p><br/><p>In order to save time, LI Cangyu built a multi-person room in the arena, allowing the two sides to fight directly. Otherwise, playing the economic warfare, ice dragon and pushing to the crystal would take at least 30 minutes and the rhythm was too slow.</p><br/><p>The specific economic warfare tactics were naturally in the hands of the commanders, The key was how the team cooperated during a wave of combat. It was necessary to cultivate the understanding between the great gods as soon as possible. Everyone agreed with LI Cangyu’s multi-person PK model.</p><br/><p>The first to appear was the melee stream lineup, consisting of Su Guangmo, Yu Pingsheng, Meng Jie, Xie Shurong, Zhuo Hang and Bai Xuan. They were fighting the kiting lineup that consisted of Tan Shitian, Cheng Wei, Lu Xiao, Yang Muzi, Yan Ruiwen and Liu Xiang.</p><br/><p>Both sides were a collection of great gods but one side had many melee and the other side was mainly remotes. Based on the lineup, there were advantages and disadvantages.</p><br/><p>The first game was chosen by Tan Shitian. He cleverly selected a desert map, which was a seven star status map selected for the World Competition. The flying sand in the air had a great influence on players.</p><br/><p>Once a melee had their visibility lowered, their movements would naturally be restricted. Archers were different. They could stand at a distance for a group attack. As long as they grasped the direction, they could place a lot of psychological pressure on the other side.</p><br/><p>Sure enough, at the beginning of the battle, the balance of victory tilted towards Tan Shitian. He and Lu Xiao cooperated with the group attack Death Arrow Rain to suppress the blood volume of the opponents, then controlled them with the deceleration skill Quenching Arrow.</p><br/><p>It was difficult for melee classes to get close to them but Su Guangmo and Xie Shurong both had teleportation skills. The brothers seized the opportunity and jumped towards Tan Shitian and Cheng Wei, unceremoniously using Light and Shadow Rotation to interrupt the remote classes and decreasing blood.</p><br/><p>At the same time, Yu Pingsheng and Meng Jie opened a horizontal ditch with their giant axes, blocking a movement route.</p><br/><p>Zhuo Hang was the mobile team member of this lineup and took full advantage of an elf’s quick movements, placing a lot of traps under the opponent’s feet. The series of Trap Blasts cooperated with Su and Shu’s attacks, causing an amazing effect.</p><br/><p>In the end, this game was won by Tan Shitian. The key lay in the combination of Cheng Wei and Yang Muzi’s big white magic control, which sealed the front row in place. Then Tan Shitian, Lu Xiao and Yan Ruiwen simultaneously unleashed a big group attack and smashed the other side.</p><br/><p>The second game was Su Guangmo’s turn and he chose a forest with extremely dense trees. The arrows of the archers were mostly straight-line attacks and they only had one skill to penetrate obstacles. The blockage of a large number of trees would definitely limit Tan and Lu.</p><br/><p>Facts proved it. Su Guangmo and Xie Shurong cooperated with their rapid advancement while Yu Pingsheng and Meng Jie cooperated to intercept the other side. The team led by Tan Shitian were surrounded and stepped into Zhuo Hang’s traps.</p><br/><p>The cooperation between the Su, Yu and Shu brothers quickly cleared the blood of the fragile remotes. Su Guangmo moved back the playing field in this game and the two sides were 1:1.</p><br/><p>***</p><br/><p>Li Cangyu saw this and looked over at Ling Xuefeng. “This group is really good.”</p><br/><p>Due to the joining of Zhuo Hang and Meng Jie, the strength of the melee flow increased a lot. The addition of the black and white magicians to the kiting flow also gave the team many control skills.</p><br/><p>Ling Xuefeng whispered, “If these players were gathered in the Time team then they would definitely win the championship. The same is true for Flying Feathers.”</p><br/><p>Li Cangyu smiled. “The strength of the national team is twice as strong as the domestic league.”</p><br/><p>It was because every player who joined the national team was one of the best in the world. Everyone’s awareness wasn’t bad and if they cooperated well, the overall strength of the team would naturally be enhanced.</p><br/><p>Li Cangyu typed on the public channel: [Change to the next group.]</p><br/><p>Next was the confrontation between the assassins and the trap flow. The two sides played very fiercely, with Lou Wushuang and Jiang Xu each winning a game. In fact, the strength of both sides was similar. The key to winning or losing was the impact of the map.</p><br/><p>Li Cangyu touched his chin and thought about it. In the World Competition, the map seemed to be a very important factor!</p><br/>\n</div>"}