{"title": "Chapter 264 - China VS Australia (Mysterious Map)", "id": 264, "volume": 3, "url": "http://boxnovel.org/god-level-summoner-chapter-264-china-vs-australia-mysterious-map", "volume_title": "Volume 3", "body": "<h1>Chapter 264 - China VS Australia (Mysterious Map)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 264 – China VS Australia (Mysterious Map)</p><hr/><br/><p>The schedule of the World Competition stated that the matches for Groups A and B would be held in the morning while Groups C and D would be played in the afternoon. Due to the 12 hours time difference between New York and Beijing, this arrangement was just right for the Chinese audience. Everyone could watch the live broadcast from 8 p.m. to 12 a.m.!</p><br/><p>Yu Bing and Kou Hongyi had already arrived at the live broadcast hall. On the third floor of the stadium, there was a small live broadcast room for the media. The soundproof window of the room allowed them to see the game.</p><br/><p>It was currently 8 o’clock in New York and the venue could accommodate hundreds of thousands of people. Miracle fans from all over the world brought posters to support the players of their country and Chinese fans also had many flags. The fluorescent cheering cards made it look very lively.</p><br/><p>The host was holding a lottery interactive event before the start of the competition.</p><br/><p>Backstage, players on both sides were preparing for the match.</p><br/><p>In the competition, the soundproof rooms were divided into the players’ seats and the rest area. There were seven computers in the players’ area. One of the computers was used for the commander to connect to the referee’s command channel. The remaining six computers were used for the arena, the economic battle and the death racing mode.</p><br/><p>There would be 10 minutes of rest between different modes. If they wanted to change their keyboard and mouse, they could use this time to debug the equipment.</p><br/><p>This time, the national team was equipped with a mechanical mouse and keyboard provided by sponsors. The national team’s logo was printed on the upper left corner of the keyboard and the Miracle logo was on the mouse.</p><br/><p>Li Cangyu and Ling Xuefeng set up the keyboards and mouse of the players and quickly tapped the keys to check the sensitivity of the buttons.. The sight of the two men testing the keyboards caused the domestic audience’s blood to boil. Their fingers were strong and slender, the action of tapping on the keyboard dazzling. They could only think of one word when the camera zoomed in—handsome!</p><br/><p>The two people finished testing the keyboards and Li Cangyu told the players in a simple manner, “Don’t be too nervous. There is no pressure in the first game. We just need to stabilize our state and play to our own standards! Come on—Chinese team, refuel!”</p><br/><p>Everyone placed their hands together and shouted this sentence.</p><br/><p>They couldn’t help feeling heated up as they did this. They were representing their country on the world stage. It was an unforgettable experience that everyone would remember for the rest of their lives. This type of rare opportunity must be done well. They couldn’t humiliate China’s Miracle League!</p><br/><p>***</p><br/><p>A moment later, the national team sat down while LI Cangyu walked to the command post with a smile. He looked very confident, making the domestic audience members feel relieved.</p><br/><p>Yu Bing was introducing the Australian ace players at the fastest speed. Once Li Cangyu sat down, she changed her words and said, “Audience members, Cat God is sitting down at the command post. The match will soon begin. Now we need to explain the different map selection rules for the World Competition!”</p><br/><p>Kou Hongyi followed for. “The World Competition states that seven maps will be randomly select for each match. The captains have an opportunity to disable two maps each and the remaining three will be used as maps for the three games. The rules manual we received has placed a special addition. If there are maps submitted by a country, only one can be disabled.”</p><br/><p>“That’s right.” Yu Bing nodded and explained, “In other words, if there are two maps submitted by the Chinese team among the seven maps, the Australian team can’t disable both. They must release one. This is to ensure that the maps submitted by the countries can be seen on the stage of the competition!”</p><br/><p>The simple explanation allowed everyone to understand and they commented:</p><br/><p>[I heard that our maps are very powerful! The league especially invited the 3D master of the Dragon Song Club, Wu Zewen to help. It will definitely be a three-dimensional map!] [I think there should be a big maze?] [I hope to see a map with Chinese elements!] [I wonder what the Australian maps are like?]</p><br/><p>There was only half a minute left before the official start of the map and Yu Bing said, “You can see the rest area in the soundproof rooms on both sides of the big stage. It is separated by the players’ seats with a glass wall, which cuts off sound. There are many players in the World Competition and this design is to prevent players watching from the god’s perspective and giving ideas to their teammates playing.”</p><br/><p>Kou Hongyi laughed. “This means that the players in the game are separated from those not playing. The players in the rest area can’t give any hints.”</p><br/><p>Then the big screen in the middle of the stage finally lit up and the audience clapped.</p><br/><p>Kou Hongyi’s voice immediately rose an octave. “Good evening to the domestic audience members, the first match of Group B in the World Competition, China VS Australia is about to begin! Let us focus our eyes on the big screen!”</p><br/><p>The director cut to the big screen. The audience could see that after the referee announced the start of the game, the captains on both sides drew lots on the computer. The influence of luck was inevitable. The World Competition used the random system mode. The Chinese and Australian flags scrolled through the screen until the referee pressed the pause button and the picture finally froze.</p><br/><p>The Australian team was first and the Chinese team would act second.</p><br/><p>Li Cangyu’s expression didn’t change at all.</p><br/><p>Going first didn’t make much of a difference in the World Competition. The mode of the three games were different and the lineup of both sides were submitted at the same time, being a targeted deployment couldn’t be achieved. The only difference was the selection stage, where the first team could pick first what maps they wanted to ban.</p><br/><p>Soon, images appeared on the big screen. Hundreds of colourful thumbnails flashed through seven boxes, causing the audience to be dazzled. The captain of the Australian team pressed the pause button and the first two maps were finally settled—Sydney Opera House and Mount Huangshan Plank Road!</p><br/><p>The audience was shocked. Even those who didn’t know the history of these two countries could see from the flag mark on the lower left corner of the map that these were the submitted maps of the two countries. The maps weren’t present in the online Miracle game.</p><br/><p>Immediately afterwards, the maps in the five remaining boxes started scrolling quickly. Li Cangyu pressed the pause button and the third and fourth maps were selected—Dark Reef and Endless Sea!</p><br/><p>The audience members were more familiar with these maps. They were the seven star high difficulty maps seen in the various leagues.</p><br/><p>There were three maps left and the audience stared at the big screen until it was settled—The Mechanical City, Koala Garden and Frost Temple!</p><br/><p>Apart from Frost Temple, which was a representative Miracle map that everyone was familiar with, the Chinese team logo at the lower left of the Mechanical City and the Australian flag at the lower left of Koala Garden showed they were two maps submitted by both sides.</p><br/><p>The domestic audience members were very excited. [It probably isn’t a coincidence that there are so many country map submissions, right? Isn’t it a question of system probability?] [Based on today’s selection, the probability of the maps submitted by the two countries appearing is over 50%!] [Is the Mechanical City and Mount Huangshan Plank Road made by the Chinese team?] [Koalas are Australia’s national treasure? They actually made a koala garden. Shall we make a cute panda garden to beat them?]</p><br/><p>The discussion in the live broadcast room was very lively. In the soundproof room, Su Guangmo patted Tan Shitian’s shoulder and said, “There are four country submitted maps out of seven. It seems that you didn’t guess wrong. The league really adjusted the probability.”</p><br/><p>Cheng Wei was excited. “Mount Huangshan Plank Road and the Mechanical City are super difficult to fight in. They can only ban one at most. The Australia captain is probably dying from a headache, hahaha!”</p><br/><p>***</p><br/><p>The camera switched back to the two captains. The Australian captain, William looked at the seven maps and frowned slightly.</p><br/><p>He could ban two maps first but due to the new regulations, he could only ban one of the Mechanical City or Mount Huangshan Plank Road since they were both Chinese maps. Which one was better?</p><br/><p>Based on the name and thumbnail, Mount Huangshan Plank Road seemed to be a cliff and air battle? This was too difficult and should be banned.</p><br/><p>William clicked the mouse on Mount Huangshan Plank Road and a red X symbol appeared in the corresponding square, indicating that this map was disabled.</p><br/><p>There were three maps from the Miracle gallery—Endless Sea, Dark Reef and Frost Temple. William thought about it and banned Endless Sea. This was a sea map and the sea was full of magma that caused death when falling in. This would be harder to fight.</p><br/><p>William finished banning the maps and next was Li Cangyu’s turn.</p><br/><p>Li Cangyu glanced at the remaining four maps and didn’t hesitate to move the mouse. He banned both Dark Reef and Frost Temple, the Miracle maps. This meant that he released the Australian maps, Sydney Opera House and Koala Garden!</p><br/><p>The domestic audience was shocked. [Oh my god! Cat God released both of Australia’s maps!] [Isn’t Cat God too confident?] [The maps of the other side were all released? Was there a mistake?] [Our Cat God is too handsome!]</p><br/><p>The expression on Li Cangyu’s face was very calm.</p><br/><p>He released the other side’s maps because he was confident about the Chinese team’s players. Not to mention… Australia’s own maps might not necessarily be more difficult than Dark Reef and Endless Sea!</p><br/>\n</div>"}