{"title": "Chapter 268 - China VS Australia (Koala Garden)", "id": 268, "volume": 3, "url": "http://boxnovel.org/god-level-summoner-chapter-268-china-vs-australia-koala-garden", "volume_title": "Volume 3", "body": "<h1>Chapter 268 - China VS Australia (Koala Garden)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 268 – China VS Australia (Koala Garden)</p><hr/><br/><p>The first arena game was successfully won and the second game was the economic war.</p><br/><p>Li Cangyu arranged for Tan Shitian to command. He and Ling Xuefeng only needed sit to the side and watch. Out of the two remaining maps, one was Koala Garden and the other was the Mechanical City. Due to too many traps, the Mechanical City wasn’t suitable for an economic war. In accordance with the rules of the World League, the map selected should be Koala Garden.</p><br/><p>Sure enough, it was as Li Cangyu expected. Before the second game started, the big screen released the concept of the Koala Garden map.</p><br/><p>This was a new rule of the World Competition. Before the start of the team economic battle, a 3D map would be put on the big screen from a god’s perspective. This was to let players have a general understanding of the map, so they wouldn’t be directly ambushed and collapse.</p><br/><p>From the concept map, it could be seen that the Koala Garden map was a square map and the crystals in the centre would determine the outcome. The map was still divided into the southeast, northwest, northeast and southwest areas by roads, in the form of the ‘’ shape. The refresh points of the ice dragon and fire dragon were also fixed.</p><br/><p>The special thing was that the mobs on this map were the Australian national treasures, the koalas. There were many eucalyptus trees in the wild area. The koalas all refreshed on the trees, their big ears looking cute.</p><br/><p>Cheng Wei couldn’t help saying, “Is the Australian map selling meng?”</p><br/><p>Tan Shitian smiled, “There can’t be too many tricks on the economic war map. After all, the division of the four wild areas and the refresh points of the ice and fire dragon are stipulated by the league. They are hard standards that can’t be randomly changed. There can only be small changes to the mobs and environment. If I had to guess, the koalas might be ranked mobs, making them more difficult to fight.”</p><br/><p>Cheng Wei looked at the koala in his tree and scratched his head. “It makes sense.”</p><br/><p>Tan Shitian gathered the teammates together and quickly explained, “The splitting method is still according to our previous arrangement. The start should be stable. In particular, Meng Jie, don’t rush forward.”</p><br/><p>The named Meng Jie immediately promised. “I know. Captain Liu will watch me.”</p><br/><p>Liu Xiang smiled. “Captain Tan, don’t worry. We’ll all listen to you.”</p><br/><p>Tan Shitian reached out his hand, “Everyone, refuel!”</p><br/><p>***</p><br/><p>The 10 minute break soon passed and the economic war began. The list of players on both sides appeared on the screen at the same time. The Chinese team consisted of Ten Day, ChengWei, LuXiao, Liu, Meng, and Yang. The domestic audience was very unkind when they saw these IDs. Kou Hongyi also laughed. “The Chinese players are very straightforward. The IDs are all pinyin translations. The three sisters of Red Fox were too lazy and directly registered with their surnames.”</p><br/><p>Yu Bing showed some surprise. “Cat God and Captain Ling aren’t appearing in the economic war. It seems they have fully handed it over to Tan Shitian.”</p><br/><p>Kou Hongyi continued, “Coincidentally, the three males of the Time team have joined with the three females of the Red Fox team, Liu, Meng and Yang. Male and females working together, it isn’t tiring at all!”</p><br/><p>Yu Bing’s analysis was simple. “There are the double archers in Tan Shitian and Lu Xiao, the double white magicians in Cheng Wei and Yang Muzi, plus the healer Liu Xiang and berserker Meng Jie. This is a typical kite flow lineup.”</p><br/><p>This was the style that Tan Shitian was best at. As long as the front row could withstand the firepower, the back row could quickly attack. Combined with Cheng Wei’s control, this play style was quite flexible.</p><br/><p>Yu Bing observed the Australian lineup and carefully said, “Coincidentally, Australia’s six players are similar to us. There is a front row paladin, a priest, two black magicians and two archers. The commander must be William, the captain of the Australian national team. His ranking the world is much higher than Tan Shitian.”</p><br/><p>Kou Hongyi said, “There are many bard players in the world. Our Captain Tan didn’t participate in the world rankings. This is because during last year’s rankings, he was busy playing cats and dogs on Weibo and missed out on registering!”</p><br/><p>The audience was speechless. Tan Shitian didn’t really care about things like fame and fortune. He was constantly improving his Weibo posts. His writing became more professional and his cartoon drawing was constantly improving…</p><br/><p>Yu Bing said, “The strength of Captain Tan isn’t much worse than William. The important thing is that the overall strength of the Chinese players is much stronger than that of Australia. Liu Xiang’s healing ability is stable and there is no one Meng Jie doesn’t dare to fight. Cheng Wei’s personal style is distinct and the white magician Yang Muzi and archer Lu Xiao aren’t weak.”</p><br/><p>Kou Hongyi was excited. “Then according to Sister Bing, the chance of us winning is very high! I just don’t know if there are any mysteries in this Koala Garden map.”</p><br/><p>According to the map seen on the big screen, Koala Garden had no complicated settings such as traps or a maze. Only the trees in the wild area and the lovely koalas made the audience feel refreshed.</p><br/><p>***</p><br/><p>The game soon began. Tan Shitian arranged how they split up according to what was previously agreed. He and Cheng Wei kept the middle, Lu Xiao and Yang Muzi went to the northwest while Liu Xiang and Meng Jie went down south.</p><br/><p>Once the first wave of mobs refreshed, everyone discovered the special features of this map. The cute koalas stayed in the trees and constantly threw leaves towards the surroundings. Players touched by the leaves would be set in place for two seconds.</p><br/><p>Tan Shitian guessed correctly. Not only were they ranged mobs, they used leaves with special effects!</p><br/><p>Due to the close distance, Meng Jie was hit by the leaves of a koala and it was impossible to move. The two black magicians of Australia read spells from a distance, wanting to kill her. Fortunately, Liu Xiang reacted extremely quickly. She used Holy Light Surge to restore Meng Jie’s blood and then added five layers of Healing Language.</p><br/><p>There was a strong healer for personal protection. It would be hard for the two Australian players to kill Meng Jie. Meng Jie used Mountain Chop on the battlefield and returned to the nurse’s side. Then she typed on the team channel: [Everyone be careful. The leaves of the koala can fix you in place!]</p><br/><p>Tan Shitian stood far away and already used Flying Feather Steps to quickly escape the attack of the leaves. However, Cheng Wei reacted slowly. By the time he saw this line, the leaves had already touched his body.</p><br/><p>The sound of the arrow piercing through the sky was heard. Cheng Wei was hit with Seize Life Shot and his blood dropped by 30%. This was from Australia’s captain, William!</p><br/><p>Tan Shitian saw that Xiao Wei was being beaten and didn’t become angry. He kept attacking with Accurate Aim and Shock Shot!</p><br/><p>He pre-judged William’s position in advance and once he fired the arrow, 30% of the opponent’s blood was knocked out!</p><br/><p>“Xiao Wei, come to me.” Tan Shitian spoke on the voice channel.</p><br/><p>Two seconds later, Cheng Wei ran to Tan Shitian and spoke in a dissatisfied manner. “It is too pitted. The leaves can actually set you in place!”</p><br/><p>Tan Shitian spoke in a low voice. “Pay attention not to be set in place.”</p><br/><p>“Understood!” After knowing that the leaves thrown by the small mobs would set them in place, Cheng Wei wasn’t stupid enough to be hit by the leaves. He learned his walking techniques from Cat God and easily avoided the leaves.</p><br/><p>The ranged mobs on the trees weren’t as easy to kill as the ones on the ground. Fortunately, Tan Shitian’s grasp of the angle was quite accurate. He narrowed his eyes at the cute koalas and easily took care of them.</p><br/><p>William was on the move. It seemed he wanted to first suppress Tan Shitian.</p><br/><p>Tan Shitian aimed at the mobs and attacked quickly. He kept paying attention to William from the corner of his eyes. William obviously wanted to find a chance to kill him. In William’s opinion, this young player who wasn’t famous in the world rankings couldn’t confront him head on.</p><br/><p>Perhaps it was due to the explosion of self-confidence but William played very fiercely. He used his arrows to clear up the mobs in the range of Tan Shitian’s attack. This was a clear suppression.</p><br/><p>Tan Shitian was suppressed in a passive manner until a minute later, he suddenly made a mistake.</p><br/><p>He carefully kept a distance with the other side but in order to grab a blue mob, he actually entered William’s attack range!</p><br/><p>William felt happy and immediately fired Quenching Arrow, setting Tan Shitian accurately in place!</p><br/><p>This was the captain of the Australian national team. The precision of the skill caused the audience to let out a burst of applause.</p><br/><p>The domestic audience members were nervous but Tan Shitian’s expression was calm.</p><br/><p>He was set in place and forced to 45% blood. After seeing that William was releasing the ultimate force to kill Tan Shitian, Cheng Wei finally started to act.</p><br/><p>—Holy Seal!</p><br/><p>The white magician cast the big move, setting William and the healer priest in place at the same time!</p><br/><p>At this time, Tan Shitian released Death Arrow Rain and turned the two opponents into hedgehogs!</p><br/><p>Cheng Wei kept up with the white magic outbreak—God’s Belief!</p><br/><p>The white halo fell from the sky. The white magician and archer’s group attacks cooperated with each other, directly pressing the blood of the other two people to below 50%!</p><br/><p>The other priest was forced to help, using the Purification skill to resolve the control!</p><br/><p>However, Tan Shitian had long expected this. The moment the priest used Purification, he used an ice arrow to set the priest in place again!</p><br/><p>The healer couldn’t add blood before he was controlled by Tan Shitian!</p><br/><p>Cheng Wei wisely continued to fight William. He used God’s Light and Voice of Combat. The two single target white magician skills were released, cruelly hitting William.</p><br/><p>Tan Shitian turned back and fired Seize Life Shot, directly killing William!</p><br/><p>William stared at the grey computer screen after being killed by Captain Tan. He wanted to kill the person and ended up being killed. This feeling was really hard to understand!</p><br/><p>Tan Shitian smiled and spoke encouraging words in the voice channel. “Xiao Wei is good.”</p><br/><p>Cheng Wei laughed excitedly.</p><br/><p>They might always bicker but the Tan Cheng combination was one of the best in the country. They had been teammates for many years in the Time team and their tacit understanding in key moments formed a conditioned reflex.</p><br/><p>Tan Shitian hadn’t made a mistake. He deliberately did it to lure William in and typed ‘1’ in the team channel to remind Cheng Wei. William had belittled Tan Shitian and thought the other side made a mistake. He immediately opened a big move to kill Tan Shitian but ended up killed by Tan Cheng…</p><br/><p>Tan Shitian smoothly took first blood! The domestic audience cheered excitedly. William took a healer but Tan Shitian cooperated with Cheng Wei to kill him. This was proof of his strength!</p><br/><p>Bai Xuan smiled from where he was sitting and said, “She used Purification too late. She should’ve done it when William was attacked.” This crucial moment was enough to judge the other side’s healer.</p><br/><p>Xie Shurong wrapped an arm around Bai Xuan’s shoulder and said with great confidence, “If the healer was you, I believe that absolutely no one can kill me under your eyes.”</p><br/><p>Bai Xuan replied, “Of course!”</p><br/><p>His voice was warm and strong while filled with great confidence.</p><br/><p>A healer must be decisive in key moments!</p><br/><p>The Australia team’s healer felt some guilt. The skills connection of Tan Cheng were almost seamless. He was being controlled before his brain could react…</p><br/><p>Fortunately, the captain didn’t say anything to him. After he was resurrected, he called his teammates to prepare for the ice dragon.</p><br/><p>On the field data panel, Tan Shitian took the first head and got most of the mobs in the middle. He bought his favourite necklace, Elf’s Covenant and was very well-off.</p><br/><p>This was a necklace that increased attack distance and was one of the best equipment for kite flow tactics. An archer’s original attack distance was 18 metres and it reached 19 minutes after wearing this necklace.</p><br/><p>It might just be a gap of one metre but this was enough to cause a headache in a team battle!</p><br/><p>***</p><br/><p>The ice dragon refreshed and the two archers of the Australian team started attacking the front row of the Chinese team, trying to break through.</p><br/><p>Meng Jie was a famous tomboy. She carried the huge axe on her shoulders and wasn’t afraid when facing the enemy’s firepower. She directly used her axe to smash a large pit, blocking the road ahead. In addition, there was the strong nurse Liu Xiang covering her. She didn’t need to worry about dying.</p><br/><p>The thing that made the Australian team upset was that Tan Shitian stood in the distance and relied on his long range. He cooperated with Lu Xiao and used the simplest arrows to completely damage the Australian team’s back row!</p><br/><p>William felt great pressure.</p><br/><p>He had never encountered such shocking kite flow tactics in the league!</p><br/><p>On the Chinese team, the fierce berserker withstood the pressure in the front row, the healer looked after her blood and the remaining four people moved at a very fast speed, dazzling the people. In particular, the archer Tan Shitian used Flying Feather Steps to move like the wind. He constantly fired cold arrows and each shot was extremely accurate!</p><br/><p>He could still grasp the direction so well while running and shooting. Not a single arrow missed. With these skills, why wasn’t he on the world rankings? Wasn’t this level comparable to Kim Yoonhee of the Korean team?</p><br/><p>William was full of surprise but as the captain and commander, he immediately stabilized his mind and ordered, “Use a group control!”</p><br/><p>If this consumption continued, it would become more and more difficult for them to fight. They must find a breakthrough!</p><br/><p>A black magician in the Australian team immediately used Death Fear to control the front row Meng Jie. The other black magicians walked forward and used fear on Liu Xiang in the back row!</p><br/><p>Everyone gathered to set fire to Meng Jie. The front row had thick skin but after being hit by four outputs, she fell to residual blood.</p><br/><p>At this time, Yang Muzi opened the big group attack skill, Holy Seal!</p><br/><p>She moved with Tan Shitian and Tan Shitian took her to the side of the Australian team. She wasn’t Tan Shitian’s fixed partner but the vice-captain of Red Fox wasn’t weak. If she didn’t know what to do then her ID could commit suicide!</p><br/><p>This angle was just right to open a group attack.</p><br/><p>Yang Muzi controlled the back row. The Australian team’s players were scattered but this group control skill was just right to control the healer and two archers!</p><br/><p>—Death Arrow Rain!</p><br/><p>Tan Shitian and Lu Xiao’s group attack skill continued to fall continuously while Cheng Wei and Yang Muzi weren’t far behind with God’s Belief!</p><br/><p>The four big moves fell down and the two fragile archers of the Australian team instantly fell to the ground!</p><br/><p>On the Chinese side, Meng Jie was also killed but Liu Xiang added a big healing skill to herself and saved her life.</p><br/><p>In this wave, the Chinese team killed two archers, including the Australian team’s captain William, and took the ice dragon in one breath. This could be called a huge advantage.</p><br/><p>In addition, the two dead people were killed by Tan Shitian…</p><br/><p>Yu Bing explained with a smile, “Tan Shitian has three heads and combined with the ice dragon’s economy bonus, he will soon become a small boss. If he buys the weapon Frost Bow, he will show what a real kite flow is!”</p><br/><p>Frost Bow, this bow and arrow caused a 10% deceleration.</p><br/><p>Elves already moved very fast and once the opponents were slowed down by this bow, Tan Shitian would become a terrible mobile fort! He could attack the opponent with long-range archery and now they could never catch up with him!</p><br/><p>In the next battle, Tan Shitian taught them the meaning of the kite flow.</p><br/><p>He slowed down all six opponents with a very fast hand speed. Then he stood in the distance and attacked wildly with Lu Xiao!</p><br/><p>The arrows formed an impenetrable rain of arrows, shooting all opponents into residual blood…</p><br/><p>Cheng Wei once again wisely sealed the captain William and Tan Shitian naturally wouldn’t drop the chain. He fired Seize Life Shot and took William’s head again!</p><br/><p>The Australian team was defeated and the six members of the Chinese team destroyed the crystal under Tan Shitian’s leadership!</p><br/><p>The Chinese team was victorious in the economic war!</p><br/><p>Cheng Wei happily jumped from his seat and hugged Lu Xiao sitting next to him. “We won, hahaha! We won again!”</p><br/><p>Tan Shitian thought, ‘How much better would it be if he turned and hugged me?’</p><br/><p>Cheng Wei seemed to hear his resentful thoughts. After hugging Lu Xiao, he turned back and hugged to Tan Shitian. “Captain Tan, we won!”</p><br/><p>Tan Shitian finally smiled with satisfaction and hugged him back. Tan Shitian reached out and rubbed his head.</p><br/><p>Cheng Wei seemed to be aware that he was too unrestrained and blushed as he let go of the other person. He remembered when he was previously kissed and his ears couldn’t help turning hot.</p><br/><p>Tan Shitian was calm and took his teammates out of the soundproof room. He gave the captain a smile that said ‘I completed the task’ and this happened to be shown on the big screen, making the various reporters go crazy!</p><br/><p>The media from all over the world exploded. [The Chinese team’s young archer continuously killed the Australian ace, Captain William!] [Will Tan Shitian surpass Kim Yoonhee and Thomas to become the world’s first bard?]</p><br/><p>The overwhelming smile accompanied by Tan Shitian’s signature smile swept through the e-sports websites of countries around the world. The domestic audience happily commented on Tan Shitian’s Weibo: [Captain Tan, you are popular!]</p><br/>\n</div>"}