{"title": "Chapter 288 - The Double Taunting Lineup", "id": 288, "volume": 3, "url": "http://boxnovel.org/god-level-summoner-chapter-288-the-double-taunting-lineup", "volume_title": "Volume 3", "body": "<h1>Chapter 288 - The Double Taunting Lineup</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><hr/><br/><p>Chapter 288 – The Double Taunting Lineup</p><hr/><br/><p>Liu Chuan was a former e-sports king. He might’ve never played Miracle but he could still see the tactical ideas adopted by the Chinese team’s lineup.</p><br/><p>The principle of the double taunting was actually very simple but it was hard to deal with.</p><br/><p>After all, Spain’s Captain Rodriguez was a world-class player. He quickly reacted to the strangeness of the Chinese team. Still, wouldn’t the combination of traps and kiting be chaotic?</p><br/><p>Reality proved that Jiang Xu’s commanding ideas were very meticulous. There was no messiness despite the two styles combining and the rhythm of the team was very unified.</p><br/><p>After updating their equipment, everyone gathered at the ice dragon’s refresh point. The six members of the Spanish team also came here. The blue field boss was quietly resting in its cave. This was different from the aggressiveness of the fire dragon. The ice dragon was relatively mild and wouldn’t actively attack the players.</p><br/><p>Once the melee players of the Spanish team saw the six members of the Chinese team, they didn’t hesitate to rush over. The melee style under the leadership of Rodriguez was fierce and best at fighting hard against others.</p><br/><p>Zhuo Hang and Jiang Xu had already placed a row of traps to prevent the opponent from approaching. However, the Spanish team’s paladin Sobrino suddenly released Steel Battle Soul!</p><br/><p>The golden light spread out from the paladin and all members of the Spanish team got the ‘rebound’ status. The damage of the traps were rebounded to the Chinese team.</p><br/><p>The Spanish team’s melee started to sprint forward under the protection of this big move. The paladin was in front with the three swordsmen and berserker behind him. The priest was at the end and the group of people rushed towards the Chinese team like a tiger.</p><br/><p>Meng Jie was in the front row and her pressure when facing the five melee classes of Spain was huge. She cleverly avoided the giant axe aimed at her waist but the next swordsman used Spirit Lock to set her in place.</p><br/><p>The domestic audience thought that the other side would gather to kill Meng Jie. As a result, the Spanish team bypassed Meng Jie and rushed towards the fragile hunter Jiang Xu in the back row. Rodriguez obviously chose the first target to be Jiang Xu because he guessed that Jiang Xu was the commander of the game.</p><br/><p>Jiang Xu placed traps quickly but the map was too flat. He couldn’t use the terrain to arrange his traps and they were all destroyed by the paladin in the front row.</p><br/><p>The paladin was thick-skinned and the damage from the traps only tickled him. Under the protection of the paladin, the melee in the back pressed hard and in the blink of an eye, Jiang Xu was forced to retreat.</p><br/><p>—Breaking Bone Sword, Broken Sword, Light and Shadow Rotation!</p><br/><p>The three swordsmen teamed up to open many explosive skills in order to kill Jiang Xu. Jiang Xu was beaten to 15% blood and was about to die. Fortunately, Liu Xiang reacted quickly. The moment Jiang Xu was attacked, the priest decisively used a big move.</p><br/><p>—Desperate Prayer!</p><br/><p>The soft light descended from the sky and Jiang Xu’s blood was instantly pulled back. At the same time, the whole group was immune to all control for three seconds and Jiang Xu was rescued.</p><br/><p>***</p><br/><p>The moment that Liu Xiang was protecting Jiang Xu, the players Tan Shitian, Cheng Wei and Zhuo Hang were doing something else.</p><br/><p>As early as when the Spanish team rushed to kill Jiang Xu, Zhuo Hang had wisely used Flying Feather Steps to fly around while Tan Shitian and Cheng Wei followed.</p><br/><p>The three people joined forces to attack the healer.</p><br/><p>Cheng Wei used God’s Seal to seal the other healer and Tan Shitian immediately followed up with Precise Shot and Shock Shot. Zhuo Hang used Flying Feather Steps to move around the healer at a very fast speed, putting down a Stop Trap and Death Trap.</p><br/><p>There was a loud explosive sound and the hunter’s chain traps exploded. Combined with Tan Shitian’s arrows, the Spanish priest Brianna’s health dropped to 50%!</p><br/><p>Brianna had to instantly use Purification to relieve the negative state on her body. Then she used Holy Light Surge to directly fill up her blood.</p><br/><p>Then Zhuo Hang’s Silence Trap once again controlled her!</p><br/><p>Cheng Wei followed up by casting God’s Light and Voice of Combat. Tan Shitian then fired Death Shot and the two people joined forces to once again press the priest’s blood to 50%.</p><br/><p>Brianna wanted to cry and once the control skill was over, she was forced to use Desperate Prayer</p><br/><p>The three seconds free of control gave her time to breath but it was also enough time for Zhuo Hang to once again set chain traps around her…</p><br/><p>Tan, Cheng and Zhuo set fire to kill her and she simply couldn’t add blood.</p><br/><p>Rodriguez noticed that the healer was being beaten and couldn’t help frowning. The Chinese team obviously wanted to kill the healer. If they gave up on killing Jiang Xu and returned to rescue the healer, it would just be wasting everything they did so far. It was better to quickly kill the hunter.</p><br/><p>Rodriguez thought this and quickly ordered, “Kill the hunter!”</p><br/><p>The members of the Spanish team joined up to kill the weak defense Jiang Xu. Rodriguez thought that the healer of the Chinese team would continue to protect the hunter. Unexpectedly, she decisively abandoned Jiang Xu and left the combat area.</p><br/><p>Jiang Xu died.</p><br/><p>Rodriguez didn’t have time to be happy because he received news that his healer had died.</p><br/><p>Both sides exchanged one head and there wasn’t a numbers disadvantage.</p><br/><p>However, Yu Bing quietly stated, “Rodriguez fell into the Chinese team’s trap. The real trap of the Chinese team isn’t the Stop Trap or the Death Trap. It is… Jiang Xu himself.”</p><br/><p>These words caused the domestic live broadcast room to explode.</p><br/><p>Jiang Xu smiled after falling to the ground.</p><br/><p>Yes, the real trap weren’t the taps laid on the ground. It was himself.</p><br/><p>He was a weak defense hunter who relied on his flexible movements and cooperation with Liu Xiang to force out the other four melee. Next, Tan Shitian was in excellent condition and would complete the battlefield harvest.</p><br/><p>This was the double taunting tactic.</p><br/><p>The lineup had two core styles. No matter which side Spain killed first, the Chinese team’s tactics wouldn’t collapse.</p><br/>\n</div>"}