{"title": "Chapter 295 - Belonging", "id": 295, "volume": 3, "url": "http://boxnovel.org/god-level-summoner-chapter-295-belonging", "volume_title": "Volume 3", "body": "<h1>Chapter 295 - Belonging</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 295 – Belonging</p><hr/><br/><p>Li Cangyu and his teammates finished lunch in the restaurant and the others went back to rest. Meanwhile, he and Ling Xuefeng went to Bai Xuan’s room to visit the patient.</p><br/><p>The two people entered and saw Bai Xuan apparently having lunch. There was a bowl of rice porridge on the table next to the bed that was cooling down. Li Cangyu saw Bai Xuan lying in bed and couldn’t help asking, “Was this porridge brought by Ah Shu?”</p><br/><p>Bai Xuan smiled. “Yes, he bought takeaway.”</p><br/><p>Li Cangyu patted Xie Shurong on the shoulder and praised him. “You have grown. Now you know how to take care of patients.”</p><br/><p>Xie Shurong proudly replied, “Of course, everything he ate in the last two days were personally picked by me. His stomach is almost better.”</p><br/><p>Li Cangyu looked at Bai Xuan with concern. “Is it really better?”</p><br/><p>“Yes.” Bai Xuan nodded and said, “In fact, my stomach didn’t hurt yesterday. I originally wanted to go to the venue to watch the match but Ah Shu refused to let me go. He wanted me to rest for another day so I had to watch live on the TV.” He paused and looked at LI Cangyu with smiling eyes. “The match was amazing.”</p><br/><p>Li Cangyu saw the familiar, gentle smile and couldn’t help softening as he patted Bai Xuan on the shoulder. “Don’t worry about the game every day. Rest your body and I will think about sending you to play.”</p><br/><p>Bai Xuan told him seriously, “I am already well-rested.”</p><br/><p>Li Cangyu didn’t believe it. “You love to act strong. Who knows if what you said is true?”</p><br/><p>Bai Xuan glanced at him. “I’m really good. Would I lie to you? Let me play in the next game. Today, I saw all of you playing so handsomely and I want to knock on the keyboard.”</p><br/><p>Ling Xuefeng, “…”</p><br/><p>Xie Shurong, “…”</p><br/><p>Every time Li Cangyu and Bai Xuan were together, the other two would be treated as air.</p><br/><p>Xie Shurong was extremely depressed but with his current identity, he couldn’t drive out the captain. Fortunately, Ling Xuefeng couldn’t resist the intimate atmosphere and took the initiative to come forward. “Bai Xuan still needs to rest. We shouldn’t bother him.”</p><br/><p>Li Cangyu felt this was reasonable and stood up. “Then you rest for half a day. If there are no problems tomorrow morning, come to the meeting room at 8 o’clock.”</p><br/><p>The two people walked out.</p><br/><p>Once the door closed, Xie Shurong instantly rushed to the bed and hugged Bai Xuan. He didn’t say anything and directly kissed the other person.</p><br/><p>“Oh…” Bai Xuan was caught off guard by this suddenly sticky person and pushed him. Xie Shurong just clasped the back of Bai Xuan’s head and his teeth moved more deeply.</p><br/><p>Unlike the warm and gentle kisses of the past, this kiss contained a strong possessive desire. The tongue eagerly swept through the mouth without letting go of one inch. Bai Xuan was almost suffocated before Xie Shurong reluctantly let him go.</p><br/><p>Bai Xuan opened his mouth and gasped. Once his breathing was restored, he stared at Xie Shurong and asked, “Why are you suddenly acting like this.”</p><br/><p>“I’m your boyfriend.” He extended his arms to hug Bai Xuan, placing his chin on Bai Xuan’s shoulder. “But your eyes are full of Cat God.”</p><br/><p>Bai Xuan, “…”</p><br/><p>Was this idiot jealous? Sure enough, his IQ had regressed to the kindergarten level and he still wanted to be spoiled?</p><br/><p>Such a big person acting like this, wasn’t it shameful?</p><br/><p>Bai Xuan looked at the young man hugging him with a wronged expression and felt like he had become a kindergarten teacher. He had no choice but to touch Xie Shurong’s head. “I grew up with Cat God and have been partners for seven years. He and I… there is nothing like that between us.”</p><br/><p>Ah Shu actually knew this very well.</p><br/><p>Still, he couldn’t help feeling jealous when he saw Bai Xuan and Li Cangyu acting intimately.</p><br/><p>It was probably because he cared too much about this person?</p><br/><p>He was worried that he wouldn’t be worthy and paid special attention to Bai Xuan’s relationship with others.</p><br/><p>Xie Shurong hated his petty self and couldn’t help tightening his grip on Bai Xuan, afraid the other person would leave. He whispered, “Bai Xuan, do you think that I am very immature?”</p><br/><p>Bai Xuan thought, ‘You are really self-aware!’</p><br/><p>In order to avoid hitting him, Bai Xuan didn’t say anything and patiently patted his shoulder.</p><br/><p>Xie Shurong continued in a low voice, “I know that I’m very immature and shouldn’t eat vinegar regarding you and Cat God. Still, I can’t help it. I care too much about you and I’m afraid that you will like others.”</p><br/><p>Bai Xuan, “…”</p><br/><p>This was clearly a childish notion but it made Bai Xuan feel soft.</p><br/><p>This guy really wasn’t mature enough and also inexplicably became jealous, but Bai Xuan could feel his sincere heart.</p><br/><p>Maybe he minded so much because he cared so deeply for one person?</p><br/><p>Bai Xuan couldn’t help inwardly sighing and his voice was soft. “Okay, I won’t like Li Cangyu and I won’t like others. Don’t think too much.”</p><br/><p>Xie Shurong was immediately excited and kissed Bai Xuan again.</p><br/><p>“Oh…” Bai Xuan was helpless against this guy and had to open his mouth again.</p><br/><p>Ah Shu had been particularly careful the past two days and took care of him all night. His boyfriend was full of strength.</p><br/><p>Xie Shurong might be childish but this was his true self. He didn’t deliberately pretend to be mature and steady. If there was anything in his heart, he would bluntly say it. It was actually very easy to get along with such people.</p><br/><p>Bai Xuan thought this and couldn’t help smiling slightly before he closed his eyes and accepted Xie Shurong’s kiss.</p><br/><p>***</p><br/><p>In the next room, Li Cangyu entered the bathroom and took a bath.</p><br/><p>Ling Xuefeng’s vinegar was quickly suppressed. After all, he wasn’t the spoiled Xie Shurong who tried to sell meng. He could rationally control his emotions.</p><br/><p>However, once Li Cangyu came out of the bathroom, he still pulled the other person into his arms.</p><br/><p>“Um…”</p><br/><p>Li Cangyu was caught off guard and his mind became blank.</p><br/><p>The kiss was extraordinarily long and Ling Xuefeng’s tongue swept madly across the other person’s mouth, as if to declare ownership. There was a type of strength that couldn’t be rejected.</p><br/><p>After a long time, Li Cangyu’s spirit returned and he noticed he was kissed. He didn’t push the other person away and actively kissed back.</p><br/><p>Ling Xuefeng’s soft ribs were hit at once.</p><br/><p>Li Cangyu could always make him feel like this and the previous vinegar had long been thrown away. Ling Xuefeng stretched out his arms and gently hugged his passionate lover, the kiss becoming gentle.</p><br/><p>The two people exchanged a long kiss before reluctantly letting go.</p><br/><p>Li Cangyu stuck out his tongue and rubbed the other person’s lips. He held Ling Xuefeng’s waist and smiled. “Are you so active today?”</p><br/><p>Ling Xuefeng looked at him gently. “Aren’t you active as well?”</p><br/><p>Li Cangyu told him, “I am rewarding you. The super god is too handsome and you took responsibility for translating for me.”</p><br/><p>Ling Xuefeng smiled and pulled him closer, whispering, “Actually, I was a bit jealous.”</p><br/><p>Li Cangyu glanced up at him with surprise. “Were you? Why didn’t I see it?”</p><br/><p>“It is because I held back.”</p><br/><p>Li Cangyu couldn’t help smiling. “What vinegar are you eating?” Me and Bai Xuan? Don’t joke around. After so many years of brotherhood, I only look at him as a relative. I will never be tempted by him.”</p><br/><p>Then he kissed Ling Xuefeng’s lips and stated seriously, “I’m yours. Never doubt this.”</p><br/><p>I’m yours.</p><br/><p>These words instantly penetrated through all of Ling Xuefeng’s defenses.</p><br/><p>This was more touching than any vows.</p><br/><p>Ling Xuefeng tightly hugged Li Cangyu like he was holding the most precious baby.</p><br/><p>‘I am also yours. We only belong together, there is no doubt.’</p><br/>\n</div>"}