{"title": "Chapter 291 - Counter-Ambush", "id": 291, "volume": 3, "url": "http://boxnovel.org/god-level-summoner-chapter-291-counter-ambush", "volume_title": "Volume 3", "body": "<h1>Chapter 291 - Counter-Ambush</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 291 – Counter-Ambush</p><hr/><br/><p>An average player who encountered three enemies might be tense and not play properly. However, Ling Xuefeng had a calmness that was beyond ordinary people. He directly used the crows to block the opponent’s field of view and then turned calmly away from the room.</p><br/><p>This shot was saved by many reporters’ screenshots and became one of the classic shots of the World Competition.</p><br/><p>Qin Mo saw that his master was attacked and wanted to run over to support. As a result, he found that his master calmly left the three people and walked around. Qin Mo abandoned the idea of support and kept waiting for his teammates to meet.</p><br/><p>Yan Ruiwen and Guo Xuan were close together and soon merged with Qin Mo. Ling Xuefeng also rushed towards the central area where Qin Mo was at the fastest speed.</p><br/><p>The downside was that Yang Muzi’s refresh position was close to the two assassins of Spain. She pushed open a door in front of her and was instantly surrounded by the two assassins.</p><br/><p>From a player’s perspective, the room was empty. It was because the two assassins were invisible.</p><br/><p>The two of them were smart and didn’t hurry to move. They just continued hiding behind Yang Muzi.</p><br/><p>According to the gathering spot designated by Ling Xuefeng, Yang Muzi had a great possibility of passing through the room that contained the Spanish trio.</p><br/><p>Yu Bing was a bit nervous. “Yang Muzi is a white magician and her survivability isn’t as strong as a demon summoner. In addition, two assassins are already staring at her. If she accidentally walks into the room just now, she will likely be targeted by the five opponents!”</p><br/><p>At this time, the audience saw Ling Xuefeng place a warning sign on the mini-map.</p><br/><p>Yang Muzi’s footsteps immediately stopped.</p><br/><p>“Yang Muzi, you should be careful. There are three Spanish players in the second room to the east. You should detour around it.” Ling Xuefeng stated calmly.</p><br/><p>He had just been there and judged that Yang MUzi should be closer to that room. Thus, he immediately gave a warning on the voice channel.</p><br/><p>All rooms in the maze were connected to each other. Yang Muzi had originally been heading east but she changed her direction to the north door after hearing Captain Ling’s words.</p><br/><p>The two assassins of the Spanish team followed while speaking to their teammates on the voice channel. “The white magician has gone north. Quickly come together.”</p><br/><p>These two assassins were very calm. The reason they hadn’t acted to kill Yang Muzi was because they were afraid the Chinese team was nearby. It wouldn’t be worth it if they were surrounded by three or even four people.</p><br/><p>The best method was to kill the white magician after their teammates gathered. As long as the five members of Spain met, there was nothing to be afraid of even if they were surrounded by the Chinese team.</p><br/><p>The other three people were nearby and shifted north the moment they heard their teammates’ words.</p><br/><p>The audience discovered that the Spanish team was quickly rushing towards Yang Muzi. From their understanding of the map, they found the fastest shortcut. In less than five seconds, the team’s berserkers and swordsman came from a side door in the east!</p><br/><p>Yang Muzi was psychologically prepared but she didn’t expect there to be two assassins behind her!</p><br/><p>—Pain Blade!</p><br/><p>One of the assassins suddenly appeared and stunned her from behind.</p><br/><p>The five people of Spain immediately unleashed their skills.</p><br/><p>For a time, all types of skill effects dazzled people. Yang Muzi was a weak defense magician and she was surrounded by so many people. Her blood volume fell to the dangerous state of 30%!</p><br/><p>Fortunately, the control effect of Pain Blade ended. The other swordsman wanted to use Spirit Lock to continue to stun her but Yang Muzi didn’t hesitate to purify herself of this control, using Light God’s Blessing!</p><br/><p>A pure white light suddenly fell room the sky. A bright goddess of light with white wings appeared and a soft white light spread around her.</p><br/><p>This was one of the few instant skills of an angel white magician. It consumed a lot of blue but the effect was obvious. The white magician was immune of any control for three seconds and all enemies within range would be weakened for three seconds.</p><br/><p>Yang Muzi released a key escape skill and took advantage of the three seconds free of control to push through the door in the north towards the next room.</p><br/><p>The five Spanish players naturally pursued!</p><br/><p>They might be weakened and had their attack and defense reduced by half but it was still easy for five people to kill the 30% blood Yang Muzi!</p><br/><p>Just as they pushed through the door in the north to chase Yang Muzi, they were greeted by a demon banshee.</p><br/><p>—Witch Demon’s Curse!</p><br/><p>Ling Xuefeng had long been waiting there and pulled the five Spanish members to the side of the female demon. This was followed by the skeleton infantry’s Death Imprisonment!</p><br/><p>The two pet skills were seamlessly connected at an extremely fast pace, setting the five melee of Spain one by one.</p><br/><p>Qin Mo, Yan Ruiwen and Guo Xuan certainly weren’t standing by and waiting. As Ling Xuefeng controlled the other side, the three people opened their big moves. The gorgeous skill effect filled the screen in a dazzling manner.</p><br/><p>—Bat Blood Festival!</p><br/><p>—Shadow Winding!</p><br/><p>—Hell Flames!</p><br/><p>The blood kin summoner and black magicians originally had a strong attack power, not to mention the Spanish members were in a weakened state at the time and their defense was greatly reduced. The trio teamed up with their big moves and the five Spanish players were collectively beaten to residual blood.</p><br/><p>Ling Xuefeng followed up with Skeleton Explosion!</p><br/><p>In the blink of an eye, the Spanish team’s swordsman and assassins fell to 10% blood while the thick-skinned berserkers only had 20% blood left. In addition to the explosiveness of the four Wind Colour players, the key was that Yang Muzi had reduced the defense of the five Spanish players. Ling Xuefeng’s big move could incredibly knock out 35% of their blood at once.</p><br/><p>The Spanish commander Trinidad finally realized that they had been fooled.</p><br/><p>Obviously, Yang Muzi’s escape direction was instructed by Ling Xuefeng and she fled to the nearest room to the Chinese team. It seemed that she was rushing to escape but she was introducing the prey into the encirclement of the Chinese team!</p><br/><p>They shouldn’t have tried to chase in their weakened state.</p><br/><p>Still, it was too late to regret it now.</p><br/><p>Ling Xuefeng summoned the demon god.</p><br/><p>This was his most aggressive pet. The demon god released the curse in his hands and the black flames of his soul. The five people of the Spanish team were overwhelmed by the thick black fog and kill prompts were continuously displayed!</p><br/><p>—First Blood! One kill.</p><br/><p>—Double Kill! Another kill!</p><br/><p>—Triple Kill! A third kill!</p><br/><p>—Quadra Kill! Four kills!</p><br/><p>—Penta Kill! Five kills!</p><br/><p>The Spanish team were beaten by China’s counter-ambush!</p><br/><p>Ling Xuefeng looked at the five people who had fallen to the ground, quietly recalled his demon god and said, “Return to the resurrection point to recover.”</p><br/><p>The domestic audience, “…”</p><br/><p>Captain Ling, was it good for you to be so domineering? This was simply a double crushing with strength and IQ!</p><br/>\n</div>"}