{"title": "Chapter 301 - China VS Italy (Sacrifice and Redemption)", "id": 301, "volume": 4, "url": "http://boxnovel.org/god-level-summoner-chapter-301-china-vs-italy-sacrifice-and-redemption", "volume_title": "Volume 4", "body": "<h1>Chapter 301 - China VS Italy (Sacrifice and Redemption)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 301 – China VS Italy (Sacrifice and Redemption)</p><hr/><br/><p>Xie Shurong stood on the other side of the fountain and wasn’t affected by Dark Fear. The moment Bai Xuan was hit, he immediately used the big move Light and Shadow Rotation. His positioning was very clever. He circumvented the water fountain and his big move precisely hit the two black magicians, destroying 20% of their blood.</p><br/><p>The two black magicians of Italy ignored him and continued to attack Bai Xuan. They used black magic spells to pressure Bai Xuan’s blood line.</p><br/><p>Kou Hongyi saw this scene and couldn’t help worrying. “It seems that they are trying to kill the healer!”</p><br/><p>Yu Bing said, “In order to deal with the Shu Bai combination, the best way is to quickly handle the healer. Otherwise, Xie Shurong’s blood will keep being filled by Bai Xuan. Ah Shu’s attack power is very fierce and the Shu Bai combination will become harder to fight.”</p><br/><p>Kou Hongyi nodded in agreement. “It seems that the two Italian players delayed for half a minute because they were discussing a strategy. The captain also gave them some instructions.”</p><br/><p>Yu Bing said, “This idea isn’t wrong but Bai Xuan isn’t so easy to kill.”</p><br/><p>She just finished speaking when Bai Xuan suddenly used a small healing skill and filled up his blood volume in a precise manner.</p><br/><p>The black magician had two styles of play. One was to attack the opponent using big moves that had relatively long casting times. For example, Canglan’s Li Xiaojiang relied on these big moves to win. The other style consisted of spells being stacked on top of each other, which required two black magicians to work together.</p><br/><p>There were many black magic skills with negative effects such as Death Mantra and Shadow Winding. Their casting time was very short and two people working together could quickly stack them. After seeing that Bai Xuan had five layers of Death Mantra stacked on him, Xie Shurong frowned and he decisively used Spirit Lock to set one black magician in place.</p><br/><p>Bai Xuan finally had the opportunity to take a breath. He immediately went to hide behind Xie Shurong and filled his blood with three consecutive small healing skills.</p><br/><p>Xie Shurong continued to explode, using the swordsman’s combo to decrease the stunned black magician’s blood volume to 70%!</p><br/><p>Ah Shu was extremely ferocious when he broke out. Ordinary attacks could deal as much damage as a big move. However, the black magician of Italy wasn’t an idiot. After the control effect of Spirit Lock ended, he fled Xie Shurong’s attack range and used Dark Fear to control the two people!</p><br/><p>The positioning of this group control skill was extremely skilled and covered both Bai Xuan and Xie Shurong.</p><br/><p>Fortunately, Bai Xuan still kept the skill Purification from before. He no longer hesitated and opened it to get rid of Dark Fear!</p><br/><p>Xie Shurong gained his freedom and chased after the swordsman. Breaking Bone Sword, Devouring Soul Sword, Storm Sword! The three consecutive skills were smoothly released, directly making the other side fall to 20% residual blood.</p><br/><p>This set of explosions was really frightening and was no worse than his brother, Su Guangmo.</p><br/><p>It was obvious that Xie Shurong wanted to kill one of them so that the favourable situation of two against one could be formed.</p><br/><p>The two black magicians of Italy continued to target Bai Xuan. They no longer hesitated to use their big moves and Shadow Winding and Hell Flames came one after another. The whole Blood Castle was filled with dark energy and Bai Xuan’s blood fell to 10% and started to flash red.</p><br/><p>He saw that a crit could take his life. As a result, Bai Xuan walked around the fountain and added blood. He cast five layers of Healing Language on him at a very fast speed, followed by a big healing skill. Incredibly, his blood once again became full.</p><br/><p>The two Italians, “…”</p><br/><p>This was simply a small cockroach that couldn’t be killed!</p><br/><p>The two of them couldn’t help feeling annoyed. The Chinese team’s milk dad had extremely strong survivability. He was definitely the most difficult out of all the healers they had seen so far!</p><br/><p>“Pretend to kill the swordsman, forcing him to save the person at the fountain. Once he retreats, we will set fire to kill him again!”</p><br/><p>“Good idea!”</p><br/><p>The two people immediately agreed on their next plan over the voice channel.</p><br/><p>***</p><br/><p>The fountain in the centre of the square was a restricted area that couldn’t be stepped on. Bai Xuan’s current position was just around the fountain while Xie Shurong was standing between two fountains so he could only go back if he was attacked. If he retreated, Bai Xuan would have to go around the fountain to add blood to him.</p><br/><p>The two black magicians had the same mind and they turned to attack Xie Shurong!</p><br/><p>Xie Shurong had previously been filled with blood by Bai Xuan and he generally used ordinary attacks to deal with the enemy. He hadn’t used many big moves and he had around 70% blood left. This state could be called very good.</p><br/><p>The two black magicians acted quickly. The joined hands to stack Death Mantra and Shadow Winding. Within five seconds, the negative state on Xie Shurong was stacked to the fifth layer!</p><br/><p>—Death Mantra! Shadow Winding!</p><br/><p>This was the black magician’s most typical negative effects stacking.</p><br/><p>Players hit by Shadow Winding would have a black mist around them and they would lose 1% blood per second. If there was also the skill Death Mantra, the blood loss would double. These two states could be overlapped up to five layers.</p><br/><p>In other words, once Death Mantra and Shadow Winding were stacked to the fifth layer, Xie Shurong would lose 10% blood per second!</p><br/><p>Losing all blood within 10 seconds, it could be seen how terrible the black magician’s negative effects were!</p><br/><p>Yan Ruiwen saw this and couldn’t help saying, “The two black magicians of Italy are very skilled!”</p><br/><p>Guo Xuan agreed. “Their technique is really fast.”</p><br/><p>Li Cangyu listened to their discussion with a calm expression. He believed that Bai Xuan could solve this problem.</p><br/><p>Bai Xuan’s Purification skill was on cooldown and he had no way to lift the negative states from Ah Shu. However, he still had big moves left!</p><br/><p>—Holy Light Surge!</p><br/><p>A white light covered Xie Shurong’s body. It was the priest’s longest-lasting first aid skill. Bai Xuan didn’t care about his blue as he forcibly used the big move, leting Ah Shu recover his blood.</p><br/><p>Xie Shurong fled and soon retreated to a corner of the square. Bai Xuan also came over to add blood to Xie Shurong.</p><br/><p>From a god’s perspective, the audience found that the two of them were just behind a death fountain. The water inside was constantly ejected, forming a bloody fog in the sunlight and dyeing Blood Castle with a trace of horror.</p><br/><p>Bai Xuan had consumed a lot of blood filling up his own blood. At this time, he used a big move to restore Xie Shurong’s blood. Now he only had around 30% blue left.</p><br/><p>The two Italian players looked at each other and immediately transferred targets to Bai Xuan!</p><br/><p>—Death Mantra! Shadow Winding!</p><br/><p>The negative states on Bai Xuan’s body were stacked up to the fifth layer in the blink of an eye and he lost 10% blood per second. At this time, he could save his life using small healing skills but he didn’t have much blue left. Once it was consumed, he could only wait to die.</p><br/><p>Bai Xuan calmly glanced at the blood on the other side.</p><br/><p>Of the two black magicians, the one targeted by Xie Shurong had 20% residual blood left. The other had only been hit by Ah Shu’s big move and still had 70% blood. Both of them had around 50% blue left and their attack power was still quite strong. Bai Xuan’s own blue would only allow him to hold on for 10 seconds. Once he died, Ah Shu would find it difficult to win against two opponents.</p><br/><p>Moreover, according to the time calculated, the other side’s Dark Fear will soon have its cooldown finished. Once Dark Fear could be used again, Ah Shu could only be killed by the two of them…</p><br/><p>Could Ah Shu’s explosive ability take care of the other side?</p><br/><p>Bai Xuan decided to believe in this young man.</p><br/><p>In this critical moment, Bai Xuan’s brain worked quickly and then he did something that shocked many people.</p><br/><p>He quickly hid behind Xie Shurong and ignored his own blood, adding five layers of Healing Language onto Xie Shurong. Then he raised his staff up high and started to cast a rarely seen skill.</p><br/><p>—Redemption!</p><br/><p>The audience was shocked once the skill casting ended.</p><br/><p>It was because the priest on the big screen directly fell to the ground while his soul shrouded his partner Xie Shurong in a white light.</p><br/><p>Kou Hongyi’s mouth dropped open from shock. “B-Bai Xuan is making a desperate gamble!”</p><br/><p>Yu Bing also felt admiration. “He is truly decisive!”</p><br/><p>The audience was impressed with Bai Xuan. In the Canglan VS Wind Colour finals, the priest used the Energy Infusion skill to transfer his blue to Cat God before he died.</p><br/><p>Today, Bai Xuan made another choice.</p><br/><p>Redemption was a skill that an angel priest rarely used. At the expense of his own blood and mana, he transferred his desperate will to his teammate so that his teammate’s skill damage would double for the next 10 seconds!</p><br/><p>It was a cruel assistance technique that allowed a teammate to break out.</p><br/><p>No priest on the battlefield would choose to do this because in most people’s mind, the survival of a priest guaranteed the team survival. Bai Xuan’s thoughts were different. In his opinion, a healer should live and delay the time, but once dead, they should die decisively and not drag down their teammates.</p><br/><p>Now was the time when he should take the initiative to die.</p><br/><p>Last time, he transferred his blue to Li Cangyu because he believed that Li Cangyu could break out and collect the other person’s head. This time, he directly sacrificed himself to double Ah Shu’s skill damage. Did this mean he shared the same trust in Xie Shurong?</p><br/><p>Xie Shurong was obviously stunned by this scene but he quickly reacted. The excitement made his fingers tremble slightly as they hit the keyboard violently at a dazzling speed!</p><br/><p>The tapping sound almost broke the keyboard as the swordsman on the screen suddenly rushed towards a black magician and took away the 20% blood!</p><br/><p>This terrible attack power caused the eyes of the audience to widen.</p><br/><p>Ah Shu with his attack doubled was simply a big killer!</p><br/><p>After killing one person, he saw the other black magician casting Dark Fear. The handsome Ah Shu quickly teleported over and used a general attack to interrupt the opponent. Then he followed with three consecutive moves. Breaking Bone Sword! Devouring Soul Sword! Storm Sword!</p><br/><p>The swordsman’s signature three moves and the double attack directly forced the opponent to residual blood.</p><br/><p>The black magician’s spirit hadn’t returned when Xie Shurong followed up with three combos, his sharp sword hitting the other person’s chest and the blood black magician also died!</p><br/><p>“???” Both of Italy’s black magicians were in a stunned state.</p><br/><p>Things happened too suddenly. They didn’t expect the other side’s priest to do a suicide sacrifice!</p><br/><p>On the Chinese side, Xie Shurong dropped his keyboard and stood up. He excitedly turned and hugged Bai Xuan, speaking in a hoarse voice, “You, you trusted me! What if I couldn’t react and kill the two of them?”</p><br/><p>Bai Xuan saw this youth’s excited and incoherent appearance and patted his head with a gentle smile. “Didn’t you prove through practical actions that my choice wasn’t wrong?”</p><br/><p>Xie Shurong immediately tightened his arms.</p><br/><p>Yes, his choice wasn’t wrong.</p><br/><p>Ah Shu would never let him down, whether it was on the field or emotionally!</p><br/>\n</div>"}