{"title": "Chapter 312 - China VS France (Official Opening)", "id": 312, "volume": 4, "url": "http://boxnovel.org/god-level-summoner-chapter-312-china-vs-france-official-opening", "volume_title": "Volume 4", "body": "<h1>Chapter 312 - China VS France (Official Opening)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 312 – China VS France (Official Opening)</p><hr/><br/><p>The interview ended and Li Cangyu and Ling Xuefeng returned to the hotel together. As soon as they entered the room, Ling Xuefeng reached out to hug the other person and whispered, “Do you mind that I knew Stein earlier than you?”</p><br/><p>Li Cangyu pretended not to understand. “Who is Stein?”</p><br/><p>“…” Ling Xuefeng helplessly replied, “The captain of the French team.”</p><br/><p>Li Cangyu spoke calmly, “Oh, I can’t remember the name of foreigners.</p><br/><p>Ling Xuefeng had an expression that said, ‘Don’t hide, I know you’re jealous.”</p><br/><p>Li Cangyu smiled and confessed. “In fact, I’m not happy with him because he is arrogant. When you met in the hallway, didn’t he say that he didn’t want to meet you in the knockouts? It’s as if our Chinese team will lose if we meet France in the knockouts.”</p><br/><p>Ling Xuefeng remembered the conversation and couldn’t help frowning.</p><br/><p>Based on his memories, Stein was indeed very confident. When he was playing the online game on the US server, Stein had a tyrannical style. Every time he PKed, he had an ‘I am the strongest, you are all weak trash’ impression. Of course, Stein was 16 or 17 years old at that time. He was a rebellious boy who wasn’t in a good state. He was too arrogant and was taught several times in the online game.</p><br/><p>Later, Ling Xuefeng returned to China to prepare for the formation of the Wind Colour team and Stein went to France to join a giant club. The two men agreed to set up teams in different countries and left their contact information. They occasionally contacted each other to exchange the team formation progress and league situation.</p><br/><p>He didn’t expect them to have another chance to meet at the World Competition. The thing that made Ling Xuefeng even more unexpected was that the arrogant Stein actually became the captain of the French team.</p><br/><p>Li Cangyu saw that Ling Xuefeng was silently thinking and couldn’t help pinching his chin. “Are you thinking about your old friend again?”</p><br/><p>Ling Xuefeng’s mouth was pulled by the pinch and he said, “Your hands are so strong. Aren’t you afraid my face will be deformed?”</p><br/><p>Li Cangyu dared to pinch Ling Xuefeng’s face while others didn’t even dare touch him.</p><br/><p>He thought of this and Li Cangyu’s mood improved. He gently touched the sore chin and said, “Well, tell me honestly. That Stein…”</p><br/><p>Ling Xuefeng rushed to explain, “He is an ordinary friend I only contact once or twice a year.”</p><br/><p>“What are you so worried about? I wasn’t asking about that.” Li Cangyu smiled before becoming serious. “I want you to tell me his weaknesses. I heard he is very strong but you definitely know him better. For example, is there a class he fears most?”</p><br/><p>They were talking about tactical issues so Ling Xuefeng thought about it seriously. “He hates a summoner the most.”</p><br/><p>Li Cangyu was pleased. “That’s just right. I will personally deal with him!”</p><br/><p>Ling Xuefeng looked at Li Cangyu’s eyes that wanted to abuse people and couldn’t help feeling sympathy for Stein. Wouldn’t he die very badly under the hands of Cat God?</p><br/><p>***</p><br/><p>That evening, the World League’s official website announced the points of all countries and those who qualified from the group stage.</p><br/><p>The teams that eventually entered the quarter-finals were Japan and USA from Group A, China and Italy from Group B, South Korea and Sweden from Group C and the United Kingdom and France from Group D.</p><br/><p>According to the Group A and Group C, Group B and Group D matchup, the Chinese team’s next opponent was France. The game was scheduled for three days later in the afternoon.</p><br/><p>The next morning, Li Cangyu summoned all members of the Chinese team for a meeting and continued to use the PPT that Ling Xuefeng stayed up late making, briefly giving a lecture on the lineup and characteristics of the French team.</p><br/><p>“It was an accident that the French team lost against the British team in the last game. The French team had two main players who were sick and played abnormally on the field. This gave the British team a chance to counterattack. Objectively speaking, France’s overall strength is very high and their lineup is comprehensive, somewhat similar to our team.</p><br/><p>“France has many world-renowned players. Their captain is one of the world’s top three archers while the vice-captain is a world famous swordsman. There are several top-ranked magicians, assassins and summoners among their main players. Their lineup is quite rich. In order to play against such a strong team, we must be extra cautious and be fully prepared.”</p><br/><p>Li Cangyu glanced at Ling Xuefeng. “Xuefeng, tell them about the results of our discussion last night.”</p><br/><p>Ling Xuefeng nodded and spoke seriously. “The quarter-finals has a five games, three wins system while the national team has 22 people. There is a chance for everyone to play. What Cat and I mean is that if we are the home team, we will try to choose the arena because we have many powerful combinations such as Tan Cheng, Lou Zhang, Su Yu, Qin Xiao, etc. There are also fewer uncontrollable factors in the arena and our winning rate is relatively high.” Ling Xuefeng paused before continuing, “In a home game, we will first pick the arena. The second home game depends on the score. If we lose the arena, we might change it to death racing for the second home game.”</p><br/><p>“Does anyone have any suggestions about this point?” Li Cangyu asked.</p><br/><p>After all, the national team wasn’t a one person show. The two of them had discussed it for a long time last night and felt it was reasonable to start with the arena but they couldn’t completely decide. They would properly listen to other people’s suggestions.</p><br/><p>Su Guangmo spoke straight away, “The chances of winning the arena isn’t necessarily high. After we select the map and mode, the other side can send people in a targeted manner. For example, if I play with Yu Pingsheng, they are likely to send a ranged combination of archers or black magicians to target it. Doesn’t this mean it won’t be easy to win?”</p><br/><p>Li Cangyu explained, “It is relative. Compared to the arena, death racing is more unstable because the refresh locations are too random. At least the arena is well controlled. We will indeed be targeted but there is always a chance for the later combinations to be adjusted. For example, the opening combination might be at a disadvantage. We can send a transitional lineup such as Shu Bai to slowly move back the disadvantage.”</p><br/><p>Su Guangmo nodded. “That is reasonable. What do other people think?”</p><br/><p>Tan Shitian said, “I personally feel that the second game at home would be better to choose death racing. If we choose three maps, two of them can be maps submitted by the Chinese team. According to the rules of the World Competition, they can only ban on Chinese map at most and one will stay. On our own map, the chances of winning death racing are actually quite high.”</p><br/><p>Chu Yan agreed. “Yes! Our Suzhou Gardens and Eight-Trigram Array have never appeared! We are free to choose these two maps in the quarter-finals, right?”</p><br/><p>Li Cangyu smiled. “I don’t want to expose our ace Eight-Trigram Array too early. Others like the Mechanical City, Mount Huangshan Plank Road, Suzhou Gardens and Bamboo Sea can be used in the knockouts. The next game is against France. If it is the arena, I plan to choose Mount Huangshan Plank Road and Suzhou Gardens. They are likely to ban Mount Huangshan Plank Road and keep Suzhou Gardens. Then our advantage is obvious.”</p><br/><p>Chu Yan praised him, “Very witty!”</p><br/><p>Cheng Wei had a look of adoration. “Cat God is too bad! Previously, we used Mount Huangshan Plank Road against Spain in a thrilling manner. The French team is likely to ban Mount Huangshan Plank Road and we can use Suzhou Gardens to kill them!”</p><br/><p>The players’ faces were filled with enthusiasm as they discussed tactics.</p><br/><p>Lou Wushuang was cold from beginning to end. People who didn’t know him would think he wasn’t happy. People familiar with him would know that the captain was listening carefully to everyone.</p><br/><p>Li Cangyu looked at Lou Wushuang and found he didn’t seem to want to talk. Thus, he turned to Zhang Shaohui and asked, “Vice-Captain Zhang, what do you think?”</p><br/><p>Zhang Shaohui readily smiled. “Me? I have no opinions. I will follow the arrangements!”</p><br/><p>Li Cangyu nodded. “Then for the arena, the fixed combinations of Tan Cheng, Lou Zhang, Su Yu, Jiang Zhuo, Yan Guo and Shu Bai will be ready to play at any time. Xiao Han, you should also be prepared to come out with Qin Mo.”</p><br/><p>The group immediately exclaimed, “Yes!”</p><br/><p>Ling Xuefeng opened his mouth. “In regards to the group battle, the commanders will pick people in advance and they will practice cooperating. The economic war will be controlled by either Captain Tan or Captain Yu, with the focus on kite flow or melee flow. Death racing will be the responsibility of Captain Lou and Captain Chu. It might be the assassination flow or illusion flow. We will decide according to the lineup sent by France and the scores.”</p><br/><p>Li Cangyu followed up with, “In short, everyone must go all out! The quarter-finals is a knockout system. We will have to go home if we make any mistakes. Our national team must not disappoint our country’s supporters by stopping at the quarter-finals!”</p><br/><p>The passionate words ignited the bones of everyone present.</p><br/><p>Far across the ocean, there were many fans, friends and family members in China who were concerned about this World Competition. How could the Chinese team be eliminated in the quarter-finals? They would feel too sorry for the domestic supporters. Besides, it was hard to go all the way to the United States to play the game. They wouldn’t be able to explain it to themselves if they were knocked out in the quarter-finals.</p><br/><p>Thus, they had to win this match against France.</p><br/><p>***</p><br/><p>Three days passed in the blink of an eye and the quarter-finals of China against France finally started.</p><br/><p>As the players arrived at the venue, it was filled with people and the seats were full. Kou Hongyi and Yu Bing excitedly explained the characteristics of the French team and the match officially started.</p><br/><p>The Chinese captain Li Cangyu and the French captain Stein sat down at the command post where French drew the home team first!</p><br/><p>The captain started to select the map and game mode before submitting the lineup. Stein had long done the arrangements and quickly submitted the information to the referee.</p><br/><p>The maps selected: Notre Dame de Paris, the Eiffel Tower and Frost Temple.</p><br/><p>There were two maps submitted by France and one official Miracle map. This was also part of the league’s rules. They didn’t allow three country submitted maps or three official maps.</p><br/><p>Stein chose the arena for the map mode!</p><br/><p>The lineup: Archer of the French team, Captain Stein and archer for the French team, Ono! These two men were teammates from the same team in the French league and partners for many years.</p><br/><p>This was obviously a double bard kite flow tactic!</p><br/><p>Li Cangyu smiled and quickly banned Notre Dame de Paris and Frost Temple, leaving the Eiffel Tower. Then he submitted the Chinese team’s players, Li Cangyu and Bai Xuan!</p><br/><p>‘You take your old partner and I’ll bring my old partner.’</p><br/><p>The domestic audience was in a daze. [Cat God is going against Stein! It started with such a big smell of gunpowder?]</p><br/>\n</div>"}