{"title": "Chapter 317 - China VS France (Second Round)", "id": 317, "volume": 4, "url": "http://boxnovel.org/god-level-summoner-chapter-317-china-vs-france-second-round", "volume_title": "Volume 4", "body": "<h1>Chapter 317 - China VS France (Second Round)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 317 – China VS France (Second Round)</p><hr/><br/><p>In the first game with the French team at home, Stein chose the arena and submitted the French maps, Notre Dame de Paris and the Eiffel Tower. Such a start should’ve given the French team the advantage. However, Li Cangyu took advantage of being able to target people to wipe out the French team’s three pairs of partners in one breath.</p><br/><p>The Chinese team was simply too strong in the arena, making Stein’s pressure double. It was because they were going to face the Chinese team’s home game next and Li Cangyu was likely to continue choosing the arena!</p><br/><p>Stein gathered the players together and used the short break to nervously arrange things.</p><br/><p>In the opposite soundproof room, Li Cangyu didn’t call everyone for a meeting. The game mode had already been decided with Ling Xuefeng before the map. The Chinese team must definitely choose the arena first because it was a lot easier for them to fight.</p><br/><p>It was just that according to the rules, the players in the knockout stage couldn’t play in two consecutive games. Li Cangyu, Bai Xuan and the Lou Zhang brothers had appeared in the first game and had to rest in the second game.</p><br/><p>Fortunately, the Chinese team had many pairings. Li Cangyu glanced around and quickly decided. “We will continue with the arena in the second game and I will hand it over to the Tan Cheng pair first, the Su Yu pair in the middle and the guard… Xuefeng, do you want to play?”</p><br/><p>“No problem.” Ling Xuefeng nodded and looked over at his little apprentice. “Qin Mo, come over.”</p><br/><p>Qin Mo immediately moved to his master’s side and cried out respectfully, “Master!”</p><br/><p>Ling Xuefeng told him, “You will come with me.”</p><br/><p>“Okay!” Qin Mo was very excited. His eyes lit up while Xiao Han next to him took the initiative to hold his hand and say, “Refuel.”</p><br/><p>“Yes, I will.” Ling Xuefeng sat down and Qin Mo instantly followed, listening to his master’s warnings on what to pay attention to.</p><br/><p>Tan Cheng were responsible for the opening of the game. There was no need to talk about Tan Shitian’s strength but Li Cangyu wasn’t reassured about Cheng Wei. He patted Cheng Wei on the shoulder and whispered, “Xiao Wei, this is the World Competition, not the domestic league. The French team isn’t weak. You have to be stable and cooperate with Captain Tan. Don’t be impulsive.”</p><br/><p>Cheng Wei scratched his head and smiled. “I know, Cat God can rest assured!”</p><br/><p>The break time ended. Li Cangyu headed to the command post to choose the mode and map for the game.</p><br/><p>Kou Hongyi guessed, “The Chinese team played very well in the first game. Will Cat God continue to choose the arena?”</p><br/><p>Yu Bing replied, “There is this possibility.”</p><br/><p>She just finished speaking when the competition mode submitted by LI Cangyu appeared on the big screen—the arena!</p><br/><p>Kou Hongyi was very pleased. “I finally guessed correctly. I wasn’t hit in the face by Cat God!”</p><br/><p>The map selection immediately followed. Li Cangyu chose Mount Huangshan Plank Road, Suzhou Gardens and the Miracle official map Frost Temple.</p><br/><p>The appearance of these three maps caused a sensation in the live broadcast room.</p><br/><p>Many viewers praised Cat God’s wit. [This is forcing the French team to choose Suzhou Gardens!] [Mount Huangshan Plank Road is an air battle death map. The French team just lost in an air combat map. They definitely won’t choose it! According to the rules of the league, two country submitted maps can’t be disabled at the same time. If Stein wants to disable Mount Huangshan Plank Road then he can only leave Suzhou Gardens!] [The map of Cat God’s choice will surely be filled with pits!]</p><br/><p>Stein’s brow furrowed. He had obviously noticed that Li Cangyu was forcing him to choose Suzhou Gardens.</p><br/><p>But what could he do?</p><br/><p>They had just lost on the Eiffel Tower and Mount Huangshan Plank Road was harder than the Eiffel Tower since it was a death map and one developed by the Chinese team. If he chose the air combat map, the mental state of the French players might not be able to adjust. According to the rules of the league, if he disabled Mount Huangshan Plank Road then he could only leave Suzhou Gardens.</p><br/><p>Stein thought for a moment before reluctantly banning Mount Huangshan Plank Road and Frost Temple, leaving Suzhou Gardens.</p><br/><p>Li Cangyu’s lips curved slightly and this expression was captured by the cameraman. The confidence and lightness overflowed from the computer screen.</p><br/><p>The domestic audience saw their captain’s confidence appearance and couldn’t help being full of confidence about this game!</p><br/><p>Kou Hongyi smiled. “I always feel like this game will be an absolute crushing. Suzhou Gardens hasn’t been used in previous games but based on the name, this map must be very complicated!”</p><br/><p>Sure enough, the moment the map appeared on the screen, the French captain Stein felt regret. It was better to choose Mount Huangshan Plank Road!</p><br/><p>Suzhou Gardens was very beautiful with the carved beams, pavilions, bridges and antique Chinese style buildings. However, a closer look revealed that the structure of this map was very complicated. The pavilions were all two-storey buildings and there were ponds, bridges, trees and other areas. In other words, it was a comprehensive map with air combat, land combat and water combat!</p><br/><p>Stein hurriedly said, “Everyone concentrate on the map. Hurry and remember the structure so you don’t get lost later!”</p><br/><p>The French team stared at the map with blank expressions.</p><br/><p>This was definitely the most difficult and complex map they had seen since becoming professional players.</p><br/><p>***</p><br/><p>The map preview ended and the list of Chinese players appeared on the screen. Their IDs were Ten Day and Chengwei, this was clearly the signature Tan Cheng combination of the Time team!</p><br/><p>Stein previously didn’t know Tan Shitian but he had devoted himself to studying the group stage videos of the Chinese team in the last few days. He knew that this archer wasn’t simple and could be ranked among the top five archers in the world.</p><br/><p>As for Cheng Wei, his performances in previous games had been good and he had a high understanding with Tan Shitian.</p><br/><p>The best solution against the ranged kiting combination of an archer and white magician was to send an assassin with fast movements and flexible attacks who could lurk behind players. Fortunately, the French team had an excellent assassin combination. Stein no longer hesitated and directly submitted the French team’s players, Shire and Lord.</p><br/><p>The blood kin assassins were regular partners in a strong French team and their fame and power weren’t worse than China’s Lou Zhang brothers. Stein patted their shoulders and said, “Come on, take them down!”</p><br/><p>Shire and Lord high-fived to encourage each other before walking to their seats.</p><br/><p>The map loading ended and the game officially began!</p><br/><p>The middle of Suzhou Gardens was a bridge over a pond. Tan Shitian and Cheng Wei refreshed to the east side of the bridge while Shire and Lord were to the west.</p><br/><p>The moment the two assassins appeared, they sneaked behind the Tan Cheng combination.</p><br/><p>They wanted to use control skills to control the other side and unleash a wave of crits but it was like Tan Shitian and Cheng Wei had eyes in the back of their heads. The moment the two assassins got close, they jumped into the pond!</p><br/><p>The two French players were stunned before chasing after them.</p><br/><p>Jumping into the pond would make it a water battle and their movement and attack speeds would be affected. Nevertheless, they weren’t afraid of this. As professional players, they were no strangers to water combat, not to mention they were still in the stealth state and could control the other side.</p><br/><p>Shire and Lord quickly swam behind Cheng Wei.</p><br/><p>They had seen previous games with the Tan Cheng combination and knew that Tan Shitian was the main output while Cheng Wei was the auxiliary control. As long as they killed the white magician, it would be easy to handle the remaining archer.</p><br/><p>The two men tacitly decided to set fire to kill Cheng Wei first.</p><br/><p>Shire used Pain Blade to stun Cheng Wei while Lord followed closely with Back Stab and Fatal Blow. Shire also used Death Speed and Cheng Wei’s blood fell to 50%.</p><br/><p>Just then, Tan Shitian suddenly jumped out of the pond and fired Death Arrow Rain!</p><br/><p>Under the group attack, Shire and Lord’s blood also dropped to 75%!</p><br/><p>Tan Shitian followed with Quenching Arrow. The ice arrow smashed through the pond and struck Shire’s chest, triggering the freezing effect in the water.</p><br/><p>Lord saw this and quickly used Pain Blade to continue controlling Cheng Wei.</p><br/><p>Cheng Wei released the angel’s Purification and released the control. Then he used God’s Seal to set the opposite person in place!</p><br/><p>At this time, Tan Shitian was steadily moving on the shore. He aimed his arrows at the water and his fingers quickly tapped the keyboard. The archer’s Shock Shot and Seize Life Shot came one after another!</p><br/><p>Cheng Wei also aimed at Shire, activated the attack skills God’s Light, Voice of Combat!</p><br/><p>Shire’s blood fell to 30% under the Tan Cheng combination. He tried to go to shore when his control effect ended, only for Cheng Wei to seal him in place using Holy Seal!</p><br/><p>At this critical junction, Shire and Lord were forced to use Combat Stealth to hide and avoid the subsequent damage!</p><br/><p>Tan Cheng’s counterattack made Shire and Lord very passive from the beginning.</p><br/><p>They originally wanted to kill Cheng Wei under the water but Tan Shitian protecting Cheng Wei from a distance meant they couldn’t kill Cheng Wei.</p><br/><p>Shire decided to change strategies. “Hit on the shore!”</p><br/><p>The two people moved onto land and wanted to take advantage of the stealth to launch a wave of sneak attacks, only to find…</p><br/><p>Tan Shitian and Cheng Wei were gone!</p><br/><p>It could be seen from the water traces on the ground that they had entered the woods.</p><br/><p>Shire, “…”</p><br/><p>Could the Chinese team’s map be more pitted?</p><br/><p>From the bridge to the water, they hadn’t finished playing in the water when they ran to the woods. These Chinese people could really play around!</p><br/>\n</div>"}