{"title": "Chapter 315 - China VS France (Arena Stage Two)", "id": 315, "volume": 4, "url": "http://boxnovel.org/god-level-summoner-chapter-315-china-vs-france-arena-stage-two", "volume_title": "Volume 4", "body": "<h1>Chapter 315 - China VS France (Arena Stage Two)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 315 – China VS France (Arena Stage Two)</p><hr/><br/><p>Li Cangyu and Bai Xuan successfully defeated the French team’s Stein and Ono combination, gaining a great advantage in the quarter-finals. Nevertheless, Li Cangyu wasn’t satisfied with this. His blood had been restored by Bai Xuan and he could still fight!</p><br/><p>In the commentators’ room, Kou Hongyi couldn’t help praising them. “The Cat Bai combination can still fight! Cat God is now full of blood and will continue to face the next combination from the French team. They might not have much blue left and many skills are on cooldown but I absolutely believe that the Cat Bai combination can create a bigger advantage in the arena!”</p><br/><p>Yu Bing strongly agreed. “Cat and Bai are old partners who walked next to each other for a full seven years. If they can increase the opening advantage, the Chinese team can win this game without a doubt!”</p><br/><p>With Li Cangyu’s strength, killing the next combination wasn’t impossible.</p><br/><p>As the captain of the national team, he previously had the outstanding achievement of three kills in the arena and became super god in death racing. Now he brought his old partner Bai Xuan with him. The audience was naturally looking forward to their next play.</p><br/><p>Facts proved that Li Cangyu would never disappoint the domestic audience.</p><br/><p>At this critical moment, two stealth killers were dispatched. The French captain’s intention was very obvious. Kill the other side as quickly as possible to prevent the gap between the two sides from widening!</p><br/><p>The two French killers followed the captain’s instructions and entered stealth as soon as they started. They quickly climbed to the second floor and lurked behind Bai Xuan, using Pain Blade to contorl Bai Xuan!</p><br/><p>The two killers’ explosive ability was very strong. They jointly opened a big move and Bai Xuan’s blood fell to 30%.</p><br/><p>Bai Xuan’s reaction speed wasn’t slow. As soon as the control effect ended, he used two small skills to return his blood to 80%. Then he added five layers of Healing Language to himself!</p><br/><p>It was really annoying to fight a healer who wouldn’t die. The two assassins no longer hesitated and used the big move, Chain Strangulation!</p><br/><p>Bai Xuan was beaten to 10% blood by these set of moves and he was about to die, only to use Holy Light Surge at a critical moment.</p><br/><p>He instantly added a lot of blood and returned to over 50%!</p><br/><p>The two French players were going crazy while many domestic audience members couldn’t help commenting: [Daddy Bai 6666!] [The milk dad is a small cockroach that can’t die!] [”I don’t want to give up healing. I can still save myself,” said the daddy.] [Vice-Captain Bai’s survival ability is really strong and can’t be evaluated!]</p><br/><p>In this regard, Kou Hongyi couldn’t think of a suitable adjective and scratched his head. “Vice-Captain Bai is a very comprehensive healer. After this game, I think that many foreign healers won’t look down on him again.”</p><br/><p>He survived Captain Stein’s attack and now stood strong in the face of the two assassins. He truly had the most powerful survival ability in the Chinese Miracle League, this couldn’t be questioned!</p><br/><p>***</p><br/><p>Bai Xuan wasn’t a god. The result of his rapid filling of blood meant his blue was becoming smaller and the connection of skills was problematic. It was clear that he wouldn’t last long. Fortunately, Li Cangyu’s hand speed was extremely fast. During the time when Bai Xuan was being attacked, Li Cangyu cast Fireballs and dealt a lot of damage.</p><br/><p>The moment that Bai Xuan was killed, the two assassins were shocked that their blood had fallen to 70%! They had been concentrating all their efforts on killing the healer, who dragged things out for a few seconds. They didn’t expect Li Cangyu’s bursting ability to be so strong. In just 10 seconds, he used the simplest Fireball to decrease the two people’s blood by 30%!</p><br/><p>Li Cangyu’s Fireball didn’t aim at a single person but was split between them. The fact that both assassins had fallen to 0% was obviously to lay the groundwork for the players who would come afterwards.</p><br/><p>After seeing that Bai Xuan was killed, Li Cangyu no longer hesitated and summoned his water spirit. He froze one assassin and combined the water and fire attacks while using Flying Feather Steps to climb up to the third platform. He kited the opponents while walking up the tower!</p><br/><p>To be able to kite the players while climbing the steep Eiffel Tower showed that his movements couldn’t be evaluated. Even the French captain couldn’t help sighing. Wasn’t this summoner’s hands too fast?</p><br/><p>The French assassins were in a half blood state due to this ranged kiting. They finally became angry and entered Combat Stealth. The two men reached the third platform and joined forces to suppress Li Cangyu’s blood.</p><br/><p>He was just about to die when his next actions stunned the French players. He actually jumped off the tower again!</p><br/><p>The French players had the urge to cough up blood as they saw the elf summoner jump to the ground and look up at them.</p><br/><p>Stein also felt like collapsing. This map was made into an air battle. The designer’s original intention as that Stein could use the archer’s advantage to occupy the high points on the map to quickly kill the opponent. The result was reversed by the Chinese team and jumping down the tower was used to open the distance. They should’ve made it a death map so he was jumping to his death!</p><br/><p>Unfortunately, it was too late to feel regret. Li Cangyu used jumping down the tower to delay the time by more than 10 seconds. The moment the cooldown of his thunder spirit’s big move ended, he used his final blue to open Thunder’s Wrath!</p><br/><p>Purple thunder descended from the sky and the blood of the two assassins fell below half blood.</p><br/><p>The two people jumped off the tower and joined forces to kill the summoner but their mood wasn’t pleasant. They had been delayed by the Chinese team’s Cat Bai combination and their blood was below 50%. Forget recovering from the disadvantage, they actually increased the disadvantage!</p><br/><p>Li Cangyu smiled as he completed his task and left the players’ seats with Bai Xuan.</p><br/><p>The soundproof door to the rest area was opened and the national team members stood up to applaud their wonderful performance. Ling Xuefeng actively welcomed Li Cangyu as he asked, “Do you feel better?”</p><br/><p>Li Cangyu pretended not to understand. “What do you mean? I just played normally.”</p><br/><p>Ling Xuefeng smiled slightly and hugged him. He whispered in the other person’s ears, “How can Stein compare to our Cat God? In my heart, you are the world’s number one.”</p><br/><p>Li Cangyu asked, “What about you?”</p><br/><p>Ling Xuefeng thought for a moment. “We are joint first place?”</p><br/><p>Li Cangyu couldn’t help laughing. He patted Ling Xuefeng on the shoulder and lowered his voice. “If other people heard this, it is estimated that we will gain the hatred of people around the world. Be more low-key.”</p><br/><p>Ling Xuefeng nodded. “Okay, I will only say it to you in private.”</p><br/><p>Next to him was Xie Shurong who learnt from Ling Xuefeng’s appearance. He hugged Bai Xuan and smiled, “I suddenly feel that joining Canglan was the best decision of my life. It is really great that I can get to know you.”</p><br/><p>Bai Xuan blushed at his corny lines and pushed him away. “Don’t have a poor mouth and stand up!”</p><br/><p>“Yes, yes!” Xie Shurong immediately stood upright but his arms were always around Bai Xuan’s shoulder out of fear that other people would steal him.</p><br/><p>Li Cangyu was still chatting happily with Ling Xuefeng and this made other people feel anxious. Cheng Wei couldn’t help saying, “Captain, captain! Who is going to play next? We can’t relax until the arena is finished!”</p><br/><p>Li Cangyu looked over and replied, “If we lost the game after such a big advantage, we should collective commit suicide with our characters.” His eyes swept over the players present and he ordered simply, “The Lou Zhang combination, give me victory in the arena!”</p><br/><p>Zhang Shaohui stood up excitedly and patted his chest, “Rest assured!”</p><br/><p>Lou Wushuang pushed up his glasses with a cold expression and nodded at Li Cangyu. Then he walked to the players’ seats with his brother.</p><br/><p>Cheng Wei was still worried. “The Lou Zhang combination is only the second group. Who will be third?”</p><br/><p>Tan Shitian helplessly rubbed his head. “Do you still not understand Cat God’s meaning? He told the Lou Zhang combination to give him victory in the arena. In other words… the third group won’t play and it will end directly with the second group.”</p><br/><p>Cheng Wei immediately ran to Li Cangyu with shiny eyes. “Two groups beating three groups?”</p><br/><p>Li Cangyu smiled. “The French team selecting the Eiffel Tower is actually giving us an opportunity. The thing we are least afraid of is air maps. I believe that the Lou Zhang brothers can win!”</p><br/><p>In order to prepare for the World Competition, the national team’s players had repeatedly practiced on Mount Huangshan Plank Road during the secret training period. To tell the truth, the thrill of the Eiffel Tower map was really small compared to Mount Huangshan Plank Road. They experienced the tempering of Mount Huangshan Plank Road and now air maps were a piece of cake for the top players of the national team.</p><br/><p>Moreover, Li Cangyu and Bai Xuan had created such a big advantage in the opening stage. The two assassins of the French team were in a residual blood state and the Lou Zhang brothers could easily take care of them.</p><br/><p>***</p><br/><p>Sure enough, Lou Wushuang and Zhang Shaohui used stealth to come behind the opponents. They each stared at one person and used Pain Blade to control the other side, followed by a set of assassin combos to directly kill the two residual blood players.</p><br/><p>The French team were forced to send their guard combination.</p><br/><p>The guard combination of each team was definitely very strong. The French team’s players were really famous. The white magician Angel and the black magician Lina were fixed partners from the same team.</p><br/><p>The combination of black and white magician wasn’t common internationally because the effect of two black magicians and two white magicians was better. Black and white magician together needed a stronger tacit understanding since the release of their spells couldn’t affect the rhythm of their teammate.</p><br/><p>Yang Muzi was a white magician and couldn’t help commenting, “This Angel, I used to play with her in the US server. She has a very good grasp of control skills.”</p><br/><p>Cheng Wei curiously came over. “Is that so? I also want to go against her if I have a chance.”</p><br/><p>Tan Shitian smiled. “Wait for the next game. There will be no chance in this game since Lou Zhang will end it directly.”</p><br/><p>Cheng Wei wasn’t convinced. “Do you have such confidence in the Lou Zhang brothers?”</p><br/><p>Tan Shitian patiently analyzed, “My confidence isn’t blind. A magician is better at attacking on obstacle maps since they can kite the opponent from a distance. An air combat map has very high demands on positioning. Once the control fails, the close range assassin will keep interrupting the magician’s skills and many of them can’t be cast. The Lou Zhang combination is first-class and their assassination techniques are excellent. Once hit by the assassins, the two magicians will be very passive on this map.”</p><br/><p>Cheng Wei found that Tan Shitian’s words were very reasonable and he had no way to refute it. However, his reflexes meant he always wanted to refute Tan Shitian’s words. He scratched his head and thought about it before giving up in frustration.</p><br/><p>Tan Shitian saw that Cheng Wei was frozen and couldn’t endure the cute appearance. He smiled and said, “Don’t think about it. Just watch the game.”</p><br/><p>‘Your brain capacity originally isn’t enough. Thinking about it will cause you to become stupider.’</p><br/><p>Of course, Tan Shitian didn’t dare to say this in case Cheng Wei’s hackles raised on the spot.</p><br/><p>Cheng Wei couldn’t refute Tan Shitian’s words and had to concentrate on the screen.</p><br/><p>Angel and Lina refreshed on the map and the third stage of the arena officially started!</p><br/>\n</div>"}