{"title": "Chapter 320 - China VS France (End of the Arena)", "id": 320, "volume": 4, "url": "http://boxnovel.org/god-level-summoner-chapter-320-china-vs-france-end-of-the-arena", "volume_title": "Volume 4", "body": "<h1>Chapter 320 - China VS France (End of the Arena)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 320 – China VS France (End of the Arena)</p><hr/><br/><p>The moment the second combination of Annie and Holder died, Stein determined that this arena game would be lost and the unpredictable hunch in his heart came true. The strength of the Chinese team was stronger than he imagined. The more terrifying thing was that regardless of whether they were Cat Bai, Lou Zhang, Tan Cheng or Su Yu, all combinations players quite well in today’s match and there were no obvious mistakes.</p><br/><p>This low error rate made the French team’s idea of turning over the disadvantage became a luxury that couldn’t be achieved at all.</p><br/><p>In any case, Stein couldn’t take the initiative to surrender and could only send the French team’s third pair.</p><br/><p>On the big screen, the guard combination appeared. The team’s vice-captain, swordsman Lemande and the black magician Jacob. This was one of the most powerful combinations in the French team and Stein placing them in the guard position showed his trust in them.</p><br/><p>The French audience was still expecting the two of them to reverse the situation but Stein had lost confidence in this game. Unless the Chinese team deliberately threw the game or suddenly dropped the chain, there was no way the Chinese team could lose with such a great advantage.</p><br/><p>Facts proved that Su Guangmo and Yu Pingsheng couldn’t throw the game.</p><br/><p>After taking care of the second combination, Su Guangmo still had half blood left while Yu Pingsheng’s blood was above 80%. The berseker had high defense and his high blood would make it harder to fight.</p><br/><p>The third stage started. Yu Pingsheng took the initiative to protect his brother. The moment the other swordsman came close, he didn’t hesitate to raise his knife and use Mountain Chop.</p><br/><p>This skill made a deep gully in the ground and isolated the French team’s swordsman from the black magician. Yu Pingsheng left the swordsman for his brother and quickly rushed to the black magician.</p><br/><p>Yu Bing explained, “Vice-Captain Yu is obviously separating the two French players to maintain the advantage. Captain Su is ranked higher in the world than the French swordsman Lemande and isn’t afraid of him in 1v1. Meanwhile, Vice-Captain Yu has extremely high defense and can drag things out a while against the black magician.”</p><br/><p>Kou Hongyi was excited. “Vice-Captain Yu is actually very smart! Ignore the fact that he doesn’t like to talk. On the field, his carefulness, sensitivity and excellent tactical awareness are no worse than Su Guangmo’s!”</p><br/><p>Yu Pingsheng’s practice of splitting the battlefield coincided with Su Guangmo’s thoughts. The brothers shared a heart and split the French team up into 1v1.</p><br/><p>Su Guangmo aimed for the French team’s vice-captain, Lemande and his swordsmanship dazzled the eyes.</p><br/><p>The gorgeous swordsmanship collided with each other and the skill life effect blinded people. Su Guangmo replied on his flexible movements to avoid Lemande’s key control. He used Light and Shadow Rotation before folow up with three moves to force Lemande down to half blood.</p><br/><p>Next to him, Yu Pingsheng wasn’t willing to show any weakness. He might’ve lost a lot of blood due to the black magician but he used a key opportunity to open a big move. He jumped in front of the black magician and the axe in his hand moved decisively. The magician’s skills were interrupted and he followed with Cut Through Thorns, Breaking Bone and Spitting Wind Chop to cut the opponent’s blood in half!</p><br/><p>The Su Yu combination’s fierce play really surprised the two players of the French team.</p><br/><p>In the domestic live broadcast room, fans of Flying Feathers were crazily commenting to encourage the Su Yu combination.</p><br/><p>[Captain Su is teaching the French team’s Lemande how to be a man!] [They are both swordsmen. Why is the gap so big?] [Vice-Captain Yu is domineering and mighty. The black magician can’t take care of his health!]</p><br/><p>The Su Yu combination had always been tough. They weren’t afraid even when their blood was behind the other side and would rush to the other side to play a beautiful combo.</p><br/><p>The Chinese team’s advantage in the arena was further expanded.</p><br/><p>Kou Hongyi couldn’t help saying, “Surely this game won’t be another four against six? It would be too humiliating for the French team…”</p><br/><p>Yu Bing calmly told him, “The possibility isn’t big since Su Yu don’t have much blue left.”</p><br/><p>Kou Hongyi looked closely at their remaining blue and agreed. “You’re right. Lemande also hasn’t opened his big moves yet. It is estimated that Captain Su won’t last much longer.”</p><br/><p>Captain Su might not have much blue left but he still had his ordinary attacks.</p><br/><p>Using ordinary attacks to create combos was the signature style of his younger brother, Xie Shurong. The effect when Su Guangmo used it wasn’t bad. He waved the sword in his hand and achieved five consecutive combos, lowering Lemande’s blood to 30%.</p><br/><p>Lemande was almost breathless under the attack from the other side.</p><br/><p>This was the pressure from the world’s strongest swordsman!</p><br/><p>Finally, Su Guangmo’s swordsmanship stagnated and Lemande found an opportunity. He unleashed a wave of counterattacks to kill the bloody Su Guangmo.</p><br/><p>Unfortunately, it was too late…</p><br/><p>It was almost impossible for the French team to make a comeback in this residual blood state.</p><br/><p>Lemande looked at the situation of his teammate and felt even more desperate. Yu Pingsheng’s berserker had half his blood left while the black magician fell from full blood to half blood.</p><br/><p>Yu Pingsheng saw that his brother was killed and didn’t hesitate to use his last big move, World Without Justice!</p><br/><p>The ultimate move of the berserker consumed all his remaining blue but it also caused considerable damage. The black magician’s health was cut to 25% from this move!</p><br/><p>Lemande no longer hesitated. He moved closer and released a set of moves to reduce Yu Pingsheng to residual blood. Jacob also used Death Mantra and Shadow Winding to curse Yu Pingsheng to death!</p><br/><p>The Su Yu combination was sent off while the domestic audience wrote ‘6666’ to cheer for them.</p><br/><p>Their performance was truly very powerful. Not only did they successfully kill the French team’s second combination, they forced the guard combination to a bloody state. This laid a solid foundation for the Chinese team’s victory.</p><br/><p>The Chinese team’s guard combination would determine the outcome of the game. As long as the Chinese team didn’t make any catastrophic mistakes, they would definitely win this game.</p><br/><p>The audience started speculating. [Who will be the guard? Could it be the Yan Guo double magicians?] [Not necessarily, it could be the Jiang Zhou double hunters!] [No matter who you are, don’t throw the game! Win well, thank you!]</p><br/><p>The moment the IDs of the Chinese team’s guard combination appeared on the screen, the audience let out a serious of ellipses.</p><br/><p>—Ling Xuefeng and Qin Mo!</p><br/><p>Out of the 22 members of the national team, even if everyone else’s IQ dropped, Ling Xuefeng absolutely couldn’t make mistakes. The rigorous and calm man never made two mistakes in a game since he debuted. On the contrary, he led Wind Colour to victory many times. He wouldn’t give any opportunities to the opponents and would seize advantage of the opponent’s gaps to deal a fatal blow!</p><br/><p>Ling Xuefeng was sent as a guard and it could be seen that Li Cangyu thought this arena was inevitable.</p><br/><p>The live broadcast room celebrated the Chinese team’s victory in advance. [Congratulations on the Chinese team for winning two games!] “[Congratulations to the national team for winning two arena games!] [Congratulations to a good start!] [Congratulations to Captain Ling for holding the arena!]</p><br/><p>This arena game had no results yet but the audience was celebrating. It was clear that in everyone’s mind, there was absolutely no suspense once Ling Xuefeng appeared as the guard.</p><br/><p>The always calm Yu Bing said, “We can celebrate the victory of this game in advance. Cat God is obviously trying to get rid of the French team today. He sent a luxurious lineup to both arena games!”</p><br/><p>“The French team’s confidence will probably collapse after this game.” Kou Hongyi gloated. “Captain Ling can directly collect heads while Qin Mo can act as soy sauce and watch the fun next to his master.”</p><br/><p>It turned out that Qin Mo didn’t play as a soy sauce.</p><br/><p>In the final round, Ling Xuefeng and Qin Mo refreshed outside the woods. Ling Xuefeng looked at the position of the French team on the map and ordered simply, “Enter stealth and kill them.”</p><br/><p>Qin Mo nodded. “Yes!”</p><br/><p>Wind Colour’s little prince quickly lurked through the woods. Ling Xuefeng didn’t follow and moved his own way forward.</p><br/><p>The audience thought that the teacher and apprentice would act from the left and right. However, Ling Xuefeng didn’t do anything when Qin Mo moved behind the swordsman and broke out.</p><br/><p>He was standing and watching the excitement?</p><br/><p>Compared with Ling Xuefeng’s calm, Qin Mo was very active. As soon as he reached the swordsman, he summoned a blood spider to set the other person in place, followed by the blood spider.</p><br/><p>In any case, the other swordsman wasn’t a rookie. He immediately broke out but could only escape from the blood spider’s control. He had already been bitten to three layers of bleeding by the blood snake.</p><br/><p>The black magician in the distance didn’t react slowly. He turned to throw Death Mantra, Shadow Winding and Hell Flames at Qin Mo. The swordsman also used Light and Shadow Rotation and Qin Mo was jointly besieged by the two people. His blood fell to 50%.</p><br/><p>Ling Xuefeng still didn’t act.</p><br/><p>The domestic audience was dying. [Captain Ling is just watching the fun?] [Isn’t he going to help his apprentice?] [Captain Ling, wake up! Can you play soy sauce in the World Competition?]</p><br/><p>No matter how anxious the audience became, Ling Xuefeng maintained his ‘not blinking an eye at Mr. Tai collapsing’ attitude. He stood calmly as a spectator while guiding his apprentice on the voice channel. “Pay attention to your position and find a way to kill them.”</p><br/><p>“Yes!” Qin Mo knew his master was giving him a chance at 1v2 and his expression became serious, his eyes staring sharply at the dark screen. At this time, the black magician cast Dark Fear to cause Qin Mo to feel fear. The swordsman would also follow up with a control skill. Then Qin Mo would face the attacks of the two people and was likely to be beaten.</p><br/><p>Qin Mo no longer hesitated and used Combat Stealth, forcibly avoiding this wave of control. He quickly walked behind a big tree and used Blood Bat Festival!</p><br/><p>The angle of release for this skill was very clever and just covered both players of the French team.</p><br/><p>The vampire bats’ big move caused the French team’s swordsman and black magician to fall to 10% while Qin Mo sucked up blood and his blood returned to 70%.</p><br/><p>Ling Xuefeng praised him. “Very good.”</p><br/><p>Qin Mo was so excited that his fingers were hot. In the World Competition, his master actually stood by and watched the battle, letting him face the opposite side. It could be said that his master was too bold or perhaps too trusting in Qin Mo?</p><br/><p>In any case, Master valued him and gave him this rare opportunity. Qin Mo was very moved and he was determined not to disappoint his master.</p><br/><p>Qin Mo grabbed his mouse and the blood kin summoner on the screen made a beautiful S-shaped displacement. He successfully escaped the swordsman’s Breaking Bone Sword and called the blood kin knight, defeating the black magician with a wave of damage.</p><br/><p>These series of moves could really be called ‘flowing water!’</p><br/><p>A young player under 18 could do such a smooth operation in the World Competition, making the domestic audience full of confidence for the future of the Chinese Miracle League.</p><br/><p>[The little prince’s positioning is 666, it is literally 6!] [Captain Ling is too much. Taking the World Competition as training?] [Captain Ling said, “I will watch you quietly.”] [The French players were in a residual blood state and Captain Ling said, “I won’t bother with two residual blood players!”] [Captain Ling didn’t act but he still crushed them in strength!]</p><br/><p>The audience watching the game praised Ling Xuefeng. Li Cangyu couldn’t help smiling at the sight and said, “Xiao Qin played very well and could resist the pressure of 1v2.”</p><br/><p>Xiao Han nodded seriously. “Yes, he’s making great progress really very quickly.”</p><br/><p>Li Cangyu hadn’t heard his apprentice make a grammatical error in a while. He couldn’t help touching Xiao Han’s head and told him, “If there is a chance later, I will also take you to practice.”</p><br/><p>Xiao Han’s eyes brightened and he immediately nodded. “Yes! Master, I will go back and prepare!”</p><br/><p>On the field, Ling Xuefeng still didn’t act. Qin Mo had decreased the French players’ blood to 10%. His blood snake and blood spider were on cooldown but he still had the knight. He relied on the protection of the knight and his flexible positioning to drag things on for half a minute until the cooldown of his blood snake ended.</p><br/><p>Qin Mo summoned the blood snake and had it bite the black magician, applying three layers of bleeding. Then he summoned the blood spider and set the swordsman Lemande in place!</p><br/><p>The bleeding state caused a large loss of blood and the black magician directly bled to death!</p><br/><p>Qin Mo followed with two ordinary attacks and took care of the bloody swordsman fixed in place.</p><br/><p>Double kill!</p><br/><p>Deafening screams and applause filled the venue. No one thought that the 18 year old summoner of the Chinese team could complete a double kill in the World Competition.</p><br/><p>The opponents might be in a residual blood state but Qin Mo could stabilize his mentality in a 1v2 situation. The connection of skills was smooth and the timing was just right. This type of strength was enough for the world Miracle fans to remember Qin Mo’s name.</p><br/><p>Qin Mo was very excited. He released his mouse and looked at his master. “Master, I won!”</p><br/><p>Ling Xuefeng smiled as he stood up and patted Qin Mo’s shoulder in encouragement. “You played well.”</p><br/><p>Ling Xuefeng didn’t shoot from beginning to end yet he and Qin Mo still won the game.</p><br/><p>This was the highest level of world-class players. He didn’t need to act at all. His apprentice could easily abuse them!</p><br/>\n</div>"}