{"title": "Chapter 321 - China VS France (First Command)", "id": 321, "volume": 4, "url": "http://boxnovel.org/god-level-summoner-chapter-321-china-vs-france-first-command", "volume_title": "Volume 4", "body": "<h1>Chapter 321 - China VS France (First Command)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 321 – China VS France (First Command)</p><hr/><br/><p>In the China VS France match, the first game was won by the Chinese team 4v6 and the second game had Ling Xuefeng let his apprentice single-handedly fight the opponent’s guard combination, killing both! This wonderful performance made the domestic audience feel particularly satisfied and more convinced about Li Cangyu’s lineup.</p><br/><p>The two consecutive victories raised the Chinese team’s morale while the French team had been disrupted and many players lost confidence. The third game might be France’s home game but if they wanted to win the quarter-finals, they would have to win three straight games. This was theoretically possible but the actual operation was difficult.</p><br/><p>Stein frowned and thought about the deployment of the third game.</p><br/><p>This game was China’s match point. If the Chinese team won, the French team would be eliminated!</p><br/><p>No one wanted to be eliminated in the quarter-finals but facing the Chinese team that was as fierce as a tiger, Stein suddenly felt that things wouldn’t work out well. He had developed a good strategy before the match but didn’t know if he should temporarily change it. They had trained in this strategy many times. Perhaps they could get one game back by relying on the map proficiency?</p><br/><p>Stein thought this and sat down to submit the mode and maps for the third game.</p><br/><p>“Stein chose death racing!” Kou Hongyi cried out as he watched the big screem. The maps submitted are Notre Dame de Paris and the Louvre, which were developed by the French team, and the official map Dark Reef. According to the rules for disabling maps, China must choose between Notre Dame de Paris or the Louvre!”</p><br/><p>Yu Bing commented, “The Chinese team is now at match point. Can they grasp the match point and directly win the match? I’m looking forward to seeing Cat God’s strategy.”</p><br/><p>Only one French map could be banned and Li Cangyu didn’t hesitate to ban the Louvre.</p><br/><p>Cheng Wei asked curiously, “Why did Cat God choose Notre Dame de Paris?”</p><br/><p>Tan Shitian explained, “Notre Dame de Paris appeared in a previous game but was banned by Cat God. The Louvre has never appeared before and should be more difficult than Notre Dame de Paris and more suitable for death racing.”</p><br/><p>Cheng Wei didn’t agree with his reasoning and retorted, “Not necessarily? Notre Dame de Paris has appeared before. Perhaps Stein is doing the opposite and tricking us into picking the difficult map.”</p><br/><p>Tan Shitian was silent for a moment. “You have a point.”</p><br/><p>Cheng Wei was stunned. He usually bickered with Tan Shitian and hadn’t expected the other person to agree with him. This made Cheng Wei feel flattered and he didn’t know how to answer.</p><br/><p>Tan Shitian saw his expression and couldn’t help patting his head with a smile. “Don’t worry too much over this. Let’s see what lineup Cat God will send.”</p><br/><p>***</p><br/><p>The game mode and map had been confirmed and the god’s perspective of the map appeared on the screen.</p><br/><p>Notre Dame de Paris was one of the most famous churches in France. It had a towering and magnificent appearance with a typical Gothic style architecture. The doors, windows and cloisters were carved with exquisite patterns and there were many precious treasures and cultural relics inside.</p><br/><p>In the game, Notre Dame de Paris retained its realistic shape while making some changes to the interior. In addition to making the corridors criss-cross in a labyrinth style, there were many statues places between corridors. These statues would block the opposite side’s vision and cast a shadow on the ground for players to hide in.</p><br/><p>Li Cangyu’s previous conjecture wasn’t wrong. Notre Dame de Paris was really a complicated labyrinth.</p><br/><p>If a labyrinth map was used to play death racing, the advantage to the home team was obvious. The French team could use familiarity with the labyrinth to male various strategic deployments such as ambushes and sneak attacks.</p><br/><p>Notre Dame de Paris’ labyrinth was new to the Chinese player so people sensitive to maps must participate in the team battle.</p><br/><p>In the national team, the best player at using maps was Zhuo Hang.</p><br/><p>Zhuo Hang studied under the Dragon Song captain Wu Zewen every day at the Dragon Song Club. He was half Wu Zewen’s apprentice and his combination of maps and traps had reached the realm of perfection.</p><br/><p>Regardless of how difficult the map, Xiao Zhuo could always interpret the map and form a clear idea of how to use the map to lay traps. There was nothing wrong with this in a team battle.</p><br/><p>The death racing mode required five people. If Zhuo Hang’s hunter played then Jiang Xu’s hunter should also play. The double hunters could form a trap control and cooperate to attack. The other three players should be high output classes. Tan Cheng, Su Yu and Ling Qin had all played in the arena. He could only choose among the rest.</p><br/><p>Li Cangyu was pondering on his plan when the French team’s lineup finally emerged.</p><br/><p>Stein clearly wanted to try his best to win the game. All the players sent were the top players. There was no need to mention his combination with his old partner Ono. In addition, he sent two high-output black magicians and a flexible assassin.</p><br/><p>He was going to use the intricate maze to kite the opponents.</p><br/><p>The long-distance consumption of the two archers, the negative states stacking of the two black magicians and the flexibility of the assassin, this lineup would be very powerful in a map maze.</p><br/><p>Li Cangyu thought about it carefully and soon submitted the Chinese team’s lineup—the Zhuo Hang and Jiang Xu double hunters, the Lou Wushuang and Zhang Shaohui double assassins and the healer Liu Xiang.</p><br/><p>The double hunters could rely on the elf’s agility advantage to use traps to control the opponents. The double assassins were good at dealing with ranged classes and the healer Liu Xiang was to ensure the survival of the lineup.</p><br/><p>Li Cangyu submitted the list before walking back to the rest area and patting Lou Wushuang’s shoulder. “Captain Lou, I’ll hand over the command to you.”</p><br/><p>Lou Wushuang met his eyes and spoke calmly, “I understand.”</p><br/><p>There was no expression on his face but there was a hint of courage and firmness in his sharp eyes. Lou Wushuang had played many times in the World Competition but he never served as a commander. This game used a combination of assassins and traps and Li Cangyu believed that he would definitely be able to cope.</p><br/><p>Li Cangyu confidently sat in his seat and handed the game to Lou Wushuang.</p><br/><p>The five people pushed open the soundproof door and sat in the seats. The players on both sides were ready and the game officially started!</p><br/><p>***</p><br/><p>The internal map of Notre Dame de Paris was very large. The narrow corridors criss-crossed and the positions of the 10 players were relatively scattered. Lou Wushuang glanced at the coordinates of his teammates on the map and gave instructions. “Jiang Xu and Liu Xiang will centre on Zhuo Hang. The three of you, try to ensure your survival. Ah Hui, use stealth and enter the maze with me to catch people alone!”</p><br/><p>This assassin-centred lineup had been used in the domestic league. The effect wasn’t bad so everyone had no objection to his instructions.</p><br/><p>Jiang Xu and Liu Xiang respectively refreshed in the northwest and northeast of the labyrinth. Zhuo Hang was in the north so Jiang Xu and Liu Xiang closed in on Zhuo Hang at a very fast speed.</p><br/><p>Lou Wushuang appeared on the southeast side of the map and Zhang Shaohui was in the southwest. He quickly rushed to the southeast in accordance with his brother’s instructions.</p><br/><p>Of the five French players, Captain Stein was in the centre of the map. HIs partner Ono was near him and the two of them met in 10 seconds. The assassin refreshed near Zhuo Hang and instantly entered stealth. The French assassin Sid found Zhuo Hang first and made a signal on the map.</p><br/><p>Stein wasn’t in a hurry and ordered in a deep voice, “Don’t move, wait for us to come over!”</p><br/><p>Him and his partner relied on the familiarity with the map to quickly move towards the marker.</p><br/><p>The three of them soon met but the other two black magicians refreshed far away. One was in the southwest and one in the southwest, close to the Lou Zhang brothers!</p><br/><p>Stein discovered that only Zhuo Hang was in the maze and quickly decided. “Hit him!”</p><br/><p>However, the moment the stealth assassin turned the corner into the corridor, he stepped in the traps that Zhuo Hang arranged. The traps were actually placed in the shadow cast by the shadow, allowing the French assassin to be caught!</p><br/><p>Stein didn’t change his mind. He might be missing the assassin’s output but it wasn’t difficult for two archers to take care of a hunter. The two archers worked tacitly, with Stein using Quenching Arrow to freeze Zhuo Hang while his partner continuously attacked with Precise Aim, Barrage Shot and Shock Shot!</p><br/><p>The arrows kept hitting Zhuo Hang and dropped his blood to 40% in an instant. Stein and Ono followed up with the single attack skill, Seize Life Shot!</p><br/><p>The expected killing prompt didn’t appear on the screen. Zhuo Hang had a softly white light around his body and his blood didn’t drop. It was Liu Xiang’s Holy Light Surge!</p><br/><p>The timely arrival of the nurse allowed Zhuo Hang to escape the disaster. Holy Light Surge had the effect of causing skills to be cast instantly. Thus, Zhuo Hang didn’t hesitate to use Flying Feather Steps to move to the opponent and placed a string of Silence Traps.</p><br/><p>Then Jiang Xu also arrived and he teamed up with Zhuo Hang to block all the roads for the three French players!</p><br/><p>A 3v3 meant there wasn’t an explosion of heads. The French team had two archers and an assassin. The Chinese team’s double archers output couldn’t keep up but Liu Xiang’s presence gave Stein a headache. No matter how strong their output, the presence of Liu Xiang adding blood meant the Chinese team’s hunters wouldn’t die!</p><br/><p>It would be easier if there was another teammate to focus on Liu Xiang.</p><br/><p>Stein looked at the coordinates on the mini-map and ordered, “The two of you, quickly come to support!”</p><br/><p>The two black magicians rushed towards the marked point at a very fast speed. Florent from the southeast quickly arrived at Zhuo Hang’s coordinates but the other black magician, Fernando was halfway there when he encountered a sneak attack from an invisible assassin!</p><br/><p>—Pain Blade!</p><br/><p>Zhang Shaohui was going to meet his brother when he saw Fernando. He immediately broke out and the dagger in his hand stabbed the other person’s neck, setting him in place.</p><br/><p>Lou Wushuang saw the mark on the map and rushed over. He joined hands with his brother to decrease the blood of the other black magician.</p><br/><p>Fernando shouted on the voice channel, “There are two assassins here!”</p><br/><p>Stein rejoiced. “Florent, quickly come over and we will hit them 4v3!”</p><br/><p>Fernando was being attacked by two assassins on the south side of the map. This meant that on the north side, the French team would have a 4 against 3 advantage. If they killed three people, it wouldn’t matter if the Lou Zhang brothers killed Fernando. France would receive three heads in exchange for one head. This was quite profitable!</p><br/><p>The atmosphere became tense as the players met each other on the narrow road. Kou Hongyi clenched his fists and said, “I hope that the Chinese team’s trio can hold on! Otherwise, this wave of killing would be too much of a loss.”</p><br/>\n</div>"}