{"title": "Chapter 333 - China VS South Korea (Demon King Ling Xuefeng)", "id": 333, "volume": 4, "url": "http://boxnovel.org/god-level-summoner-chapter-333-china-vs-south-korea-demon-king-ling-xuefeng", "volume_title": "Volume 4", "body": "<h1>Chapter 333 - China VS South Korea (Demon King Ling Xuefeng)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 333 – China VS South Korea (Demon King Ling Xuefeng)</p><hr/><br/><p>It had been three minutes since the game started and the first wave of mobs had refreshed. The two South Korean players watched Ling Xuefeng and thought he would peacefully kill monsters to make money.</p><br/><p>Unexpectedly, Ling Xuefeng suddenly summoned the crows and decisively released Cover the Sky!</p><br/><p>A large group of black crows screamed and flew towards the Korean team members, instantly blocking their vision.</p><br/><p>The Korean healer Bae Eunki reacted very quickly. After her vision darkened because of the crow, she realized the other person might break out their skills and used Purification to get rid of the negative state.</p><br/><p>Ling Xuefeng’s eyes were cold as he ordered on the voice channel, “Strike!”</p><br/><p>Qin Mo had studied with Ling Xuefeng for two seasons and was used to his master’s rhythm. He instantly summoned the blood spider and blood snake, applying three layers of bleeding to the opponents before opening the pet skill, Blood Snake Winding!</p><br/><p>The flexible blood snake tangled up around the priest’s feet and the bleeding state increased to four layers, causing 15% blood damage!</p><br/><p>Bae Eunki used Holy Light Surge and filled up her own blood.</p><br/><p>Then the next moment, Ling Xuefeng summoned the banshee and used Witch Demon’s Curse to pull the two of them under the tree before summoning four skeleton infantry and using Skeleton Explosion!</p><br/><p>The blood of the two people fell to 70%. The truly depressing thing was that this group attack killed the magpies that refreshed on the trees. The magpies exploded and caused the South Korean players to be hit by the dizziness effect.</p><br/><p>Kou Hongyi hit the table and laughed wildly, “Hahaha, is this what it means to lift a stone and hit your own feet? The South Korean team’s map actually pitted the South Korean players!”</p><br/><p>There was a small smile on Yu Bing’s cold face. “Captain Ling used the map environment by having the banshee pull them into the range of the magpies. This allowed the magpies’ dizziness to control the two of them.”</p><br/><p>As the two opponents were being controlled, Qin Mo used the big move Blood Bat Festival!</p><br/><p>Ling Xuefeng also followed with the demon summoner’s big move, Demon God’s Descent!</p><br/><p>The two big moves hit and the blood of the two opponents plummeted to 30%.</p><br/><p>The dizziness effect was finally over. Bae Eunki quickly pressed the shortcut key in order to open the group healing skill, otherwise, they would both die…</p><br/><p>Divine Blessing!</p><br/><p>The instant skill added blood and restored the two people’s blood to 50%.</p><br/><p>However, Ling Xuefeng and Qin Mo suddenly switched targets from the healer towards the white magician Shin Chimin.</p><br/><p>Bae Eunki was stunned and wanted to add blood to her teammate, but it was too late.</p><br/><p>It was unknown when Ling Xuefeng’s banshee had moved to another tree and the banshee used Charm to pull Bae Eunki to the tree. There was a blood spider next to the banshee and the silk net bound her in place!</p><br/><p>It didn’t matter if the healer’s body was fixed in place since she could still add blood.</p><br/><p>The key point was that Ling Xuefeng’s positioning was very accurate. He pulled her with the banshee so that her teammate was just out of her maximum healing range.</p><br/><p>Bae Eunki could only watch worriedly as Ling Xuefeng and Qin Mo released their skills and killed Shin Chimin.</p><br/><p>—First blood!</p><br/><p>Despite the other side having a healer, Ling Xuefeng used the exquisite operation of switching targets, displacement, calculating the healing range and other sophisticated operations to successfully kill the white magician of the Korean team.</p><br/><p>The audience had to admire Captain Ling’s strong senses and skills.</p><br/><p>In particular, many fans wanted to shake the screen with excitement when they saw the handsome and indifferent male god on the screen.</p><br/><p>Even Li Cangyu couldn’t help admiring this man.</p><br/><p>Ling Xuefeng always played with a violent suppression style on the field. The South Korean team’s two female players were too careless. They actually thought Ling Xuefeng would make money peacefully? Too naive! He was just waiting for a more appropriate opportunity.</p><br/><p>Seizing the opportunity to kill the opponents in seconds, this was Ling Xuefeng’s style of playing the game.</p><br/>\n</div>"}