{"title": "Chapter 336 - China VS South Korea (Fourth Game)", "id": 336, "volume": 4, "url": "http://boxnovel.org/god-level-summoner-chapter-336-china-vs-south-korea-fourth-game", "volume_title": "Volume 4", "body": "<h1>Chapter 336 - China VS South Korea (Fourth Game)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 336 – China VS South Korea (Fourth Game)</p><hr/><br/><p>The third game was successfully won and the Chinese team got match point first. Li Cangyu came forward to hug Ling Xuefeng, stating, “You played well.” This was Ling Xuefeng’s usual line and Li Cangyu borrowed it to praise him.</p><br/><p>Ling Xuefeng’s lips curved slightly and he whispered, “Will you go on in the next round?”</p><br/><p>“Yes, I want to take this match point instead of dragging it out to the decider.” Li Cangyu’s eyes were firm as he looked back at his teammates. “Captain Tan, Xiao Wei, prepare to play.”</p><br/><p>Cheng Wei shot up excitedly. “Is it the arena?”</p><br/><p>Since Cat God only called out two names, Cheng Wei wasn’t stupid and understood that the fourth game was the arena.</p><br/><p>Li Cangyu nodded. “The advantage of the arena in a home game is greater. We will try to take this game.”</p><br/><p>The atmosphere of the South Korean side was tense. They were down 1:2 and it would be 1:3 if they lost the fourth game, meaning they would be eliminated. This match point was crucial.</p><br/><p>If they won the fourth game, it would be a 2:@ draw and they were likely to win the fifth random tiebreaker.</p><br/><p>Park Joonseo summoned the players together and seriously told them, “In this game, everyone must go all out! Pay attention to your positions and don’t be caught by the opposite side! Li Cangyu will definitely play and be careful of his wind elf’s control…”</p><br/><p>The intermission time ended and both captains sat back at the command post.</p><br/><p>This game was the Chinese team’s home advantage. Li Cangyu immediately submitted the arena as the game mode and the three maps were Mount Huangshan Plank Road, Bamboo Sea and Dark Reef.</p><br/><p>Mount Huangshan Plank Road and Bamboo Sea were the Chinese team’s map, which meant Park Joonseo had to pick one of the two.</p><br/><p>Park Joonseo considered it for a while before eventually banning Mount Huangshan Plank Road. After all, there were too many uncertain factors in this air combat map. The advantage of Li Cangyu’s wind spirit in an air combat map was obvious and fighting on Mount Huangshan Plank Road would be very unfavourable for the South Korean team.</p><br/><p>Bamboo Sea was used in the economic war in the group stage and Park Joonseo was impressed by the pandas. In the arena, it was still a trap map but it was naturally easier than air combat.</p><br/><p>After selecting the map, Li Cangyu followed up with the first pair: Tenday and Chengwei.</p><br/><p>This was the famous kite flow Tan Cheng combination.</p><br/><p>In the first death racing game, Park Joonseo defeated the five Chinese players commanded by Tan Shitian. However, he knew that Tan Shitian’s level wasn’t bad. The reason for the loss was because LI Cangyu sent too many newcomers in the first game as a test.</p><br/><p>In the pairs arena, the Tan Cheng combination were partners for many years and their tacit understanding was high. In order for South Korea to deal with their kite flow, it was necessary to send a stronger kiting lineup or an assassin lineup.</p><br/><p>The national team’s stronger kiting player, Kim Yoonhee had played in the last round. The national team had two assassins and Kim Changmin had played in the last round. The Kim brothers and sisters couldn’t play in this arena so he had to make another choice.</p><br/><p>Park Joonseo thought this and also submitted the lineup. Bae Jeongho’s paladin and Im Suyeon’s blood kin assassin.</p><br/><p>Compared to the double assassins lineup, the paladin was more stable than the assassin. The thick-skinned paladin would provide protection to his teammate while attracting the other side’s firepower. Thus, his teammate could take the opportunity to lurk past and kill the opposite side.</p><br/><p>The two captains turned back to the rest area and Cheng Wei took advantage of the time the map was being shown to whisper to Tan Shitian, “The assassin is the female player Im Suyeon?”</p><br/><p>He had seen the list of South Korean team members before the game and knew there were only two assassins, Kim Changmin and Im Suyeon. Kim Changmin had played in the last game and couldn’t play in this one. Thus, the assassin was Im Suyeon who was known for being very cold. Bae Jeongho was a well-known paladin on the world rankings. His defense and protection capabilities were world-class.</p><br/><p>Park Joonseo sending these two people could be considered a strong shield and sharp blade combination that wasn’t easy to defeat.</p><br/><p>Tan Shitian touched his chin and thought, “Remember to keep your control skills for a while. Leave Im Suyeon to me.”</p><br/><p>Cheng Wei earnestly replied, “Yes, I understand. I will protect you.”</p><br/><p>Tan Shitian heard this and couldn’t help feeling a bit warm. Xiao Cheng might be stupid but he was very serious when playing the game. After so many years of being partners, Tan Shitian was very clear about Cheng Wei’s keen sense of smell on the field. His tactical awareness wasn’t strong but his reaction rate on the spot was very fast and he was very flexible when playing the game. It was enough if he could follow Tan Shitian’s thoughts.</p><br/><p>Tan Shitian looked back at Cheng Wei’s bright eyes and smiled gently. “Then please protect me. If you let Im Suyeon finish me off, see how I will scold you when we go back.”</p><br/><p>Originally, it was a very normal joke. However, Cheng Wei heard the words and an image of being kissed by Cheng Wei entered his mind. His cheeks were hot and he instantly shifted his gaze. “Take a good look at the map!”</p><br/><p>Tan Shitian no longer teased him and looked back at the map.</p><br/><p>They had practiced on this map countless times in training and Tan Shitian knew every corner of this map. He was very confident about playing the arena on it.</p><br/><p>***</p><br/><p>The map finished being shown and the players on both sides opened the soundproof glass door to sit at the computer.</p><br/><p>The characters of the four players entered the competition room in turn and the fourth game officially began once the map counted down.</p><br/><p>In the economic war, Bamboo Sea would have giant pandas refreshing on it and players could get gold coins by feeding them. Once the map was played for the area, the pandas disappeared. The domestic audience suddenly missed it. [I’m not happy about no giant pandas!] [This map is better in the economic war!] [Not necessarily. Cat God chose this map so it must be an advantage for the Chinese team!”</p><br/><p>The audience wasn’t quite sure of Li Cangyu’s intentions but because on the selections in his previous game, it was possible to infer that he had deliberately released Bamboo Sea for the match point. It definitely wasn’t casual and should be related to the lineup arrangement.</p><br/><p>The four people refreshed on the map and the green bamboo was like a green ocean.</p><br/><p>It was obvious when looking at the map that there were many traps in the bamboo forest. However, for professional players, it wasn’t difficult to avoid the traps. The South Korean players avoided the traps while quickly moving forward.</p><br/><p>The paladin Bae Jeongho walked in front while the assassin Im Suyeon opened stealth while maintaining a certain distance with him. The two men dispersed in order to avoid group skills from hitting both of them.</p><br/><p>Tan Shitian and Cheng Wei also rushed to the middle of the map. They saw the paladin coming over and Tan Shitian aimed at the other side’s chest. The skill Quenching Arrow was fired and successfully froze him in place!</p><br/><p>—Shock Shot, Rapid Shot and Seize Life Shot!</p><br/><p>Tan Shitian used the three moves and they all accurately hit the paladin’s chest. The crit effect was triggered and the most defensive paladin lost 30% blood.</p><br/><p>“Beautiful! Captain Tan is trying to kill the paladin!” Kou Hongyi exclaimed. “The paladin has the highest defense and is the most difficult class to kill in Miracle. However, Captain Tan has a fast hand and a high attack. If he can shoot the same spot every time and trigger the crit effect, it won’t be hard to kill the paladin.”</p><br/><p>Kou Hongyi’s claim was theoretically possible but it could be difficult in practice for each arrow to hit the same spot. Tan Shitian could only do it because the other side was fixed in place. If the other party moved, it would be impossible to hit a series of crits.</p><br/><p>Sure enough, Bae Jeongho’s frozen effect ended and he used Iron Will to enhance his defense, moving forward despite Tan Shitian’s suppression fire.</p><br/><p>Im Suyeon took the opportunity to move to the side and quietly lurked behind Tan Shitian.</p><br/><p>—Pain Blade!</p><br/><p>The female assassin’s decisive and simple assassination technique succeeded in stunning Tan Shitian.</p><br/><p>—Back Stab, Fatal Blow and Death Strangulation!</p><br/><p>Im Suyeon’s attack speed was fast. The last move was a crit and Tan Shitian’s blood was reduced to 40%.</p><br/><p>Cheng Wei turned back and used God’s Seal to set Im Suyeon in place. The next moment, Im Suyeon opened Combat Stealth to not only avoid the attack but also remove all control states.</p><br/><p>Tan Shitian used Flying Feather Steps to escape and Im Suyeon chased after him. Then Cheng Wei opened the white magic group attack skill Tidal Surge in the direction of the invisible Im Suyeon.</p><br/><p>The white glow covered Im Suyeon like a tide.</p><br/><p>The invisible assassin was hurt but the white magic and affected by the deceleration state that came with Tidal Surge.</p><br/><p>Im Suyeon was slowed down while Tan Shitian ran using Flying Feather Steps. She obviously couldn’t catch up with Tan Shitian. Just as the paladin rushed in front of Cheng Wei, Im Suyeon had to change her strategy. “First kill the white magician!”</p><br/><p>Cheng Wei was very clever. he saw that the two people were going to attack him and deliberately placed his back to a trap. This meant that Im Suyeon couldn’t attack him from behind because she would fall into a trap!</p><br/><p>Many of the assassin’s skills were meant for the back and a frontal offense was less powerful.</p><br/><p>His simple positioning meant almost half of Im Suyeon’s attack power was gone. However, the Korean team’s paladin wasn’t stupid. He directly used Fighting Howl, which was the paladin’s best skill when pulling a boss. In PK, this skill could pull the opponent in front of the user.</p><br/><p>The moment that Fighting Howl was used, Cheng Wei suddenly took a step to the side and avoided the other side’s strong pull. This clever positioning allowed the onlookers to comment: [Cheng Wei has been around Captain Tan for a long time and became smarter!] [Cheng Wei is also smart?] [Is there any player in the league dumber than Cheng Wei?] [Cough, he isn’t stupid when playing the game. He becomes stupid the second he steps off the field…]</p><br/><p>Cheng Wei didn’t know that the domestic audience was talking about him. He stared at the computer screen seriously and after avoiding the paladin’s strong pull, he turned and used Holy Seal to set the paladin and assassin in place!</p><br/><p>In the distance, Tan Shitian immediately used Death Arrow Rain!</p><br/><p>The group attack hit and the paladin’s blood fell to 50% while the blood kin assassin reached 65%.</p><br/><p>Tan Shitian aimed at the paladin’s chest and fired another set of Shock Shot, Rapid Shot and Seize Life Shot!</p><br/><p>This set hit and the paladin was actually beaten to 20% residual blood!</p><br/><p>The audience was stunned. It could be seen from the game’s data statistics panel that Tan Shitian’s hit rate outpaced that of South Korea’s ace archer, Kim Yoonhee.</p><br/><p>Kim Yoonhee watched the game and couldn’t help saying, “His explosive ability is too strong. The paladin will die in seconds if it is like this!”</p><br/><p>Fortunately, Bae Jeongho also realized this and used the shield, Guardian’s Power on himself while placing the ‘Impenetrable’ immune damage shield on his teammate.</p><br/><p>The two people stormed towards Cheng Wei and Im Suyeon released a set of moves that forced Cheng Wei to half blood. Cheng Wei’s skill casting was interrupted and he had almost nowhere to escape from the two melees.</p><br/><p>Cheng Wei’s blood fell to 20% while Im Suyeon’s 5 seconds invincible shield finally disappeared. Cheng Wei’s reaction was extremely fast and he used God’s Light on Im Suyeon’s defenseless body.</p><br/><p>This was the only instant skill of the white magician. It had a long cooldown but the amount of damage was very impressive.</p><br/><p>Im Suyeon’s blood was still at 65% and now it dropped to 35%.</p><br/><p>At almost the same time, Tan Shitian used Barrage Shot and the arrows scattered in a fan shape to accurately hit the paladin and assassin!</p><br/><p>The paladin had only 10% blood left and Im Suyeon was also hit to 15% residual blood!</p><br/><p>Im Suyeon frowned and used Chain Strangulation to kill Cheng Wei, the blood assassin relying on the attack to suck her blood back to 25%. The moment she killed Cheng Wei, Tan Shitian used Seize Life Shot to directly kill the paladin!</p><br/><p>Im Suyeon was very clear that Cheng Wei just attracted her attention to let Tan Shitian escpe. However, she couldn’t catch up with Tan Shitian. She could only kill Cheng Wei first. As long as she could quickly handle Cheng Wei, she could join forces with her teammate to kill Tan Shitian.</p><br/><p>Unfortunately, the time spent killing Cheng Wei was too long. By the time Cheng Wei died, both of them were at residual blood.</p><br/><p>Tan Shitian used the advantage of his distance to kill the paladin and it turned into a 1v1 situation. Im Suyeon didn’t have time to turn when she was hit with Quenching Arrow to freeze her in place.</p><br/><p>—Shock Shot! Rapid Shot!</p><br/><p>The archer’s most common attack skill followed Quenching Arrow. Tan Shitian’s damage calculation was very accurate and the two moves forced Im Suyeon to fall to the ground.</p><br/><p>[Captain Tan 6666! [Captain Tan is too handsome!] [Poor Cheng Wei attracted firepower as a cannon fodder. Captain Tan, quickly touch Cheng Wei’s head!]</p><br/><p>The audience started to comment. Tan Shitian didn’t touch Cheng Wei’s head. Instead, he gently grasped Cheng Wei’s hand on the keyboard and smiled. “You worked hard.”</p><br/><p>Cheng Wei’s face turned slightly red and he instantly pulled back his hand, stammering, “You, you, you are welcome.”</p><br/><p>The cooperation between them had Tan Shitian as the main attacker while Cheng Wei assisted. Only the former Cheng Wei wasn’t very sensible and would try to steal the spotlight. This season, he understood his role and knew that being Tan Shitian’s assistant was nothing as long as he could win the game.</p><br/><p>Cheng Wei looked at the South Korean paladin and assassin who fell to the ground and scratched his head. “You played well.”</p><br/><p>Cheng Wei’s appreciation was from the heart. To be able to hit the same spots in a row to create crits, Tan Shitian was becoming stronger. Cheng Wei should be happy with such a partner.</p><br/><p>He was really happy. As to whether the happiness was because he won the Korean team’s combination or because he could play with Tan Shitian, it wasn’t clear. In any case, he was happy.</p><br/>\n</div>"}