{"title": "Chapter 335 - China VS South Korea (Match Point Scramble)", "id": 335, "volume": 4, "url": "http://boxnovel.org/god-level-summoner-chapter-335-china-vs-south-korea-match-point-scramble", "volume_title": "Volume 4", "body": "<h1>Chapter 335 - China VS South Korea (Match Point Scramble)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 335 – China VS South Korea (Match Point Scramble)</p><hr/><br/><p>The South Korean healer died and Park Joonseo instantly realized the seriousness of the situation. The Chinese team’s practice of dividing the battlefield greatly weakened the Korean team’s defense while Xie Shurong’s experience in dealing with healers was quite rich. His close proximity was simply a nightmare for healers.</p><br/><p>He could no longer let Xie Shurong interfere with the South Korean team’s back row. Park Joonseo decisively changed strategies. “Kill the swordsman first!”</p><br/><p>The South Korean swordsman and assassin heard this and turned back to Xie Shurong. The white magician and archer acted as remote output assistance and for a moment, all skills were directed at Xie Shurong.</p><br/><p>Xie Shurong’s blood started to drop dramatically and he fell to 25% residual blood in the blink of an eye.</p><br/><p>Bai Xuan certainly wouldn’t watch Ah Shu be killed. He took a few steps forward and used Holy Light Surge to instantly restore Xie Shurong’s blood.</p><br/><p>Originally, this move could restore 50% of his teammates blood but the audience found that Bai Xuan’s skill only added 20%.</p><br/><p>“Park Joonseo used the skill of the six-winged angel to greatly reduce the effectiveness of healing skills!” Kou Hongyi explained.</p><br/><p>The six-winged angel was a very useful auxiliary pet for an angel summoner. It had two skills. One was Angel’s Light, which gave a barrier all teammates within range, allowing them to be immune to damage and control for five seconds. The other was Angel’s Wings, which greatly reduced the defense of the target as well as the healing effect on the target.</p><br/><p>Park Joonseo placed this skill on Xie Shurong and Ah Shu’s defense was greatly reduced as well as Bai Xuan’s blood-adding skill. This meant the Korean team could kill Xie Shurong with less effort.</p><br/><p>Xie Shurong also knew this and typed on the team channel: [Don’t save me!]</p><br/><p>He was telling Bai Xuan to give up and not save him.</p><br/><p>Bai Xuan saw these worlds and immediately stopped adding blood to Ah Shu. As a healer, he had to calmly judge the situation on the field and abandon certain teammates when necessary.</p><br/><p>Ah Shu took the initiative to give up on himself and this made Bai Xuan feel better. He clearly realized that Xie Shurong was an outstanding player who knew the big picture. At the critical moment, there would be no gains unless there was a sacrifice.</p><br/><p>Xie Shurong only had a trace of blood left and was about to die. Then he suddenly moved to the archer Kim Yoonhee and released all his available skills—Breaking Bone Sword, Devouring Soul Sword and Blood-sucking Sword!</p><br/><p>The extremely fast release of three skills combined with two general attacks created a dazzling and sharp play. Kim Yoonhee’s blood was directly cut to 25% residual blood!</p><br/><p>Xie Shurong was killed but he once again made a breakthrough for the Chinese team.</p><br/><p>This breakthrough was the Korean team’s vice-captain, Kim Yoonhee.</p><br/><p>An archer had very weak defense. After being beaten, Kim Yoonhee used Flying Feather Steps to run but Ling Xuefeng wouldn’t give her a chance to escape. It was impossible to let Ah Shu’s breakthrough be wasted.</p><br/><p>He summoned four skeleton infantry and surrounded her on all sides before exploding them.</p><br/><p>He had long been familiar with the operation of the demon pets. Kim Yoonhee didn’t have time to run away before being killed by Ling Xuefeng!</p><br/><p>The South Korean team now only had one white magician, one assassin and one auxiliary.</p><br/><p>The Chinese team had Ah Shu killed while the two black magicians and two summoners survived. Moreover, Ah Shu had played his role before dying by laying the foundation for his teammates.</p><br/><p>Next was the big explosive moment after Ling Xuefeng’s command!</p><br/><p>Yan Ruiwen and Guo Xuan used the group attack skills they had been saving, Shadow Winding and Hell Flames!</p><br/><p>Qin Mo’s blood kin pet followed up with Blood Bat Festival!</p><br/><p>The big moves hit in succession and the South Korean team were beaten to residual blood.</p><br/><p>Of course, Shim Yoocheol couldn’t let the black magicians keep casting. He turned and used Light and Shadow Rotation to interrupt the opponent’s casting, causing a lot of damage to two black magicians.</p><br/><p>However, the Chinese team had Bai Xuan. Bai Xuan used a handy healing array and filled up their blood.</p><br/><p>Qin Mo and Ling Xuefeng started to move quickly. The blood kin pets and demon pets attacked the Korean team and their bodies were covered with a negative state.</p><br/><p>The South Korean swordsman Shim Yoocheol and assassin Kim Changmin jointly killed the black magician Guo Xuan while Ling Xuefeng killed Shin Chimin.</p><br/><p>The two South Korean melee worked together. One controlled the healer while the other killed Yan Ruiwen. It was a pity that they had just killed Yan Ruiwen when the news of Park Joonseo’s death appeared on the screen.</p><br/><p>Ling Xuefeng was still the recipient of the harvest.</p><br/><p>Shim Yoocheol and Kim Changmin didn’t have much blood left at this time. The consequences would be unthinkable if Ling Xuefeng took another head!</p><br/><p>Park Joonseo hurriedly said, “Don’t fight. Withdraw!”</p><br/><p>Unfortunately, it was too late to withdraw.</p><br/><p>Qin Mo had been assisting his master by having the blood snakes bite people. Shim and Kim’s bodies already had five layers of bleeding on them. After seeing that the other side was going to withdraw, Qin Mo used the blood spider to fix them in place. Ling Xuefeng followed by exploding the skeletons and killed two people in one breath!</p><br/><p>The cooperation between mentor and apprentice was quite tacit. The South Korean team killed three members of the Chinese team but were entirely wiped out. The most frightening thing was that all the heads went to Ling Xuefeng!</p><br/><p>[Ling Xuefeng has become a great god!]</p><br/><p>The message on the screen was a blow that made Park Joonseo instantly wake up. The always calm South Korean captain now showed an anxious look.</p><br/><p>Ling Xuefeng, Qin Mo and Bai Xuan stayed in place to kill the ice dragon. The small boss didn’t have high attack and it was relatively easy to kill. The three of them successfully killed the ice dragon and returned to join their teammates.</p><br/><p>The whole group obtained the ice dragon’s economic bonus and their money was abundant.</p><br/><p>In particular, Ling Xuefeng killed so many people and the amount of money on his body made the crowd drool.</p><br/><p>He directly bought his favourite weapon, Demon God’s Curse.</p><br/><p>The shape of the staff was very special and the top had a skeleton-like shape. The skeleton’s eyes glowed with black flames which looked frightening. However, Ling Xuefeng’s fans believed that their male god holding the staff with his summoner’s costume was too cool.</p><br/><p>The effect of the staff was to increase the damage of Skeleton Explosion as well as the summoning distance and casting distance of the banshee. Ling Xuefeng was especially good at using the banshee to control the field. With this weapon, the operation of his banshee would be more varied. Skeleton Explosion was the most commonly used attack skill of the demon summoner and this weapon could greatly enhance Ling Xuefeng’s output ability.</p><br/><p>Yan Ruiwen and Guo Xuan didn’t gain any heads but both of them bought rings with extra attack power. Qin Mo bought the Blood Duke’s Ring to increase the control time. Bai Xuan and Xie Shurong bought lamps to widen their field of view.</p><br/><p>The speed of professional players was very fast. Everyone finished buying their equipment and props in just a few seconds. Ling Xuefeng looked at the map and ordered decisively, “Go directly to the crystal!”</p><br/><p>***</p><br/><p>In the commentators’ room, Kou Hongyi found it hard to hide his expectations. He quickly said, “Captain Ling has gained his weapon and nearly doubled his attack power! All members of the Chinese team have supplemented their equipment and their advantage against the fire dragon is very obvious!” As he spoke, Ling Xuefeng didn’t lead the team to fight the dragon. Instead, he went straight to the middle crystal. Kou Hongyi immediately stopped talking and his voice became shocked. “They are going directly to the crystal!”</p><br/><p>Yu Bing nodded. “It seems like it.”</p><br/><p>Generally speaking, it was necessary to accumulate enough equipment in an economic war. After killing the fire dragon, they would rely on the buff to push towards the crystal. Sometimes, one party would get a large number of heads in the early stages. If the advantage was obvious, they would choose to push directly to the crystal.</p><br/><p>However, there was a prerequisite for directly pushing to the crystal. There needed to be a time difference or the confidence to win against the opposite side.</p><br/><p>This time, players on both sides died and the resurrection time was similar. It was impossible for there to be a time difference.</p><br/><p>Ling Xuefeng dared to lead the team to directly push to the crystal, proving that he had enough confidence to stop the Korean team’s interference.</p><br/><p>The Chinese team arrived at the central highlands. QIn Mo’s blood knight acted as a guardian in front. The others quickly killed the beasts and opened the channel to the crystal.</p><br/><p>Ling Xuefeng calmly said, “Qin Mo, Yan Guo and Bai Xuan will guard the exit. Ah Shu, follow me!”</p><br/><p>He left three ranged players and a healer to guard the door while taking Xie Shurong to play the crystal. This was because Ah Shu’s attack speed was extremely fast and he could greatly speed up the destruction of the crystal.</p><br/><p>Sure enough, Ling Xuefeng and Xie Shurong arrived at the crystal and Xie Shurong immediately attacked crazily.</p><br/><p>The thing he was best at was ordinary attack combos. He could often make combos against moving opponents. Then what about a static crystal?</p><br/><p>At this moment, Xie Shurong released his full hand speed and actually hit the crystal 10 times in five seconds!</p><br/><p>The damage kept doubling and the crystal’s blood was dropping swiftly.</p><br/><p>Ling Xuefeng had luxurious equipment and kept summoning skeletons to explode them. The two people joined hands and removed one-third of the crystal’s blood in an instant.</p><br/><p>The South Korean players rushed over in a hurry.</p><br/><p>They had just guessed wrong. They thought the Chinese team would kill the fire dragon and set up an ambush there. It wasn’t until the crystal was being attacked prompt appeared on the screen that they rushed over. However, their rhythm was significantly slower by one step.</p><br/><p>Yan Ruiwen was waiting in ambush at the highlands. He immediately used Dark Fear to set all of the Korean team in place.</p><br/><p>The healer Bae Eunki used Purification to help her teammates but Guo Xuan followed with another Dark Fear. The control skills of the two black magicians were almost seamless.</p><br/><p>The urgent South Korean team was forced to wait for the control to end. Once the three-second control effect ended, Park Joonseo opened the six-winged angel’s barrier to make his teammates immune to all control and injuries.</p><br/><p>They turned towards the highlands but they arrived at the entrance only to find that Qin Mo had placed his death knight to block the narrow entrance!</p><br/><p>The death knight was the bodyguard of the blood kin summoner and its thick skin didn’t lose to the paladin. Even so, it was a pet and the blood volume was slightly lower. Generally speaking, it wasn’t difficult to kill.</p><br/><p>However, today there was a healer next to it!</p><br/><p>Bai Xuan hid behind the knight and quickly added five layers of Healing Language on the knight. The Korean team gathered to kill the death knight and Bai Xuan quickly added blood to it.</p><br/><p>The South Korean audience was having a bit of a meltdown. There were so many gods only to be blocked by a blood kin pet. They wouldn’t have believed it if they weren’t seeing it with their eyes.</p><br/><p>Bai Xuan’s healing ability was really strong and methodically added blood. Qin Mo’s pet was maintained at a half blood state in his car. Park Joonseo frowned before using the Light God’s Blessing to improve the attack power of the whole group. This wave of explosions killed Qin Mo’s pet knight.</p><br/><p>Shim Yoocheol’s swordsman took the lead in breaking through the narrow channel. Once he saw the crystal’s blood, his heart fell to the keyboard. In the blink of an eye, the crystal’s blood was only 30%!</p><br/><p>Park Joonseo saw this and ordered, “Go and interrupt them!”</p><br/><p>Shim Yoocheol and Kim Changmin quickly moved only for Ling Xuefeng to summon the banshee and used Witch Demon’s Curse.</p><br/><p>The demon beauty put her hands together and pulled the South Korean players to her side.</p><br/><p>Due to the weapon’s increased distance bonus, Ling Xuefeng’s banshee was summoned far below the highlands. The South Korean team had just rushed up only to be pulled down by the banshee. It was equivalent to wasting time.</p><br/><p>They tried to rush over again only to find that Yan Ruiwen, Guo Xuan, Qin Mo and Bai Xuan were blocking the entrance. This was an ‘unless you step on our bodies, don’t think about going to the highlands’ momentum!</p><br/><p>The six players of the South Korean team naturally weren’t afraid of the four Chinese players but Bai Xuan’s healing was enough to delay the time.</p><br/><p>They couldn’t afford this because the crystal was going to break!</p><br/><p>Park Joonseo directly used the ice woman’s Frost Soul to freeze all four Chinese people and then said, “Quickly kill them!”</p><br/><p>Kim Changmin used the assassin’s stealth to penetrate through the obstacles and successfully bypassed the Chinese team, quickly arriving at the crystal.</p><br/><p>The thing that made him feel desperate was that he only saw the crystal breaking.</p><br/><p>There was a loud band and crystal fragments flew through the air, shining under the sunlight.</p><br/><p>The word ‘Failure’ popped up on the big screen and the Korean team failed to save the battle.</p><br/><p>On the Chinese side, there was the golden ‘Victory’ on the screen.</p><br/><p>The third game was won and the score became 2:1. The Chinese team took the lead in gaining match point!</p><br/>\n</div>"}