{"title": "Chapter 347 - China VS USA (Crucial Match Point)", "id": 347, "volume": 4, "url": "http://boxnovel.org/god-level-summoner-chapter-347-china-vs-usa-crucial-match-point", "volume_title": "Volume 4", "body": "<h1>Chapter 347 - China VS USA (Crucial Match Point)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 347 – China VS USA (Crucial Match Point)</p><hr/><br/><p>Everyone returned to the rest area and Li Cangyu took the initiative to welcome them. Tan Shitian spoke seriously, “Sorry Captain, I failed to win this game. Now all the pressure is transferred to you.”</p><br/><p>Li Cangyu smiled and patted his shoulder. “It doesn’t matter. You tried your best. Take a break first.”</p><br/><p>Tan Shitian took his teammates to the side to rest and Li Cangyu turned back to Ling Xuefeng. “It seems we can only win the third game. We can’t lose.”</p><br/><p>Ling Xuefeng nodded. “It is the American team’s match point and we can’t let them do as they wish.”</p><br/><p>At this time, media reporters from all over the world were madly reporting on the finals.</p><br/><p>[The US team took the home game and defeated the Chinese team in the away game. They are the first to get the match point!]</p><br/><p>[The US team might beat China by 3:0 to become world champions?]</p><br/><p>[The Chinese team’s always strong home game was actually countered by the US team!]</p><br/><p>[The Chinese team that had a smooth journey in the World Competition finally tasted bitterness from the host country!]</p><br/><p>The reports from various countries obviously had some elements of ‘gloating’. After all, teams like Australia, Spain and Italy were crushed 3:0 by the Chinese team while the South Korean team was eliminated 3:1. The Chinese team’s performance was too dazzling and long attracted the attention of everyone.</p><br/><p>In particular, Li Cangyu, Bai Xuan and Tan Shitian had no fame in the world rankings and suddenly made a splash in the World Competition. Many people were convinced about them.</p><br/><p>The strong team finally collapsed and the reporters’ gloating reports naturally attracted the attention of the audience.</p><br/><p>In the domestic live broadcast room, many sunspots took the chance to splash dirty water. [They crushed all the way through the group stage only to become paralyzed in the finals!] [Li Cangyu played against weak trash in the group stage only to be completely abused by a strong team!]</p><br/><p>Of course, these negative comments were quickly countered by the loyal Cat God fans. [It is only the second game. Why so anxious? Don’t you understand the concept of lose two, chase back three?] [The score is 0:2. Cat God, wake up. Are you still not going?] [Captain Ling hasn’t played yet!] [Captain Lou hasn’t played yet!] [There is still hope!]</p><br/><p>The first two games were lost but fortunately, it wasn’t an ugly loss.</p><br/><p>In the first game, Su Guangmo’s commanding didn’t have any problems and he played an excellent wave of combat between both sides. He finally lost because of the zombies on the Doomsday map.</p><br/><p>In the second game, Tan Shitian’s play was also very stable. They defeated the US in the initial group combat and even had the deceleration weapon. However, Benjamin’s stealing of the fire dragon at a crucial moment caught the Chinese team off guard.</p><br/><p>Even if the team lost, it wasn’t a dejected loss but a justified one.</p><br/><p>Everyone on the national team played very well. The audience saw the first Miracle Chinese team as a vigorous, positive and cohesive team.</p><br/><p>Therefore, some sensible audience members still had strong confidence in the national team. The first two games might’ve been lost but they were looking forward to pulling things back in the next three games.</p><br/><p>In the international arena, the classic sight of losing two and chasing back three hadn’t appeared. At this time, the mentality of the players was crucial. They must be steady and absolutely couldn’t be sloppy!</p><br/><p>***</p><br/><p>In the commentators’ room, Kou Hongyi was anxious as he stared at the soundproof room. “Cat God should go on, he can no longer sit still! Nevertheless, we can’t guess what type of lineup he will send in the third game!”</p><br/><p>“If Cat God is the commander, there is still a lot of room for choice. For example, there is Shu Bai and his familiar partner Xiao Han, etc.” Yu Bing suddenly thought of something. “Of course, there is a possibility… he will go on with Captain Ling!”</p><br/><p>Kou Hongyi made a surprised expression. “Is that possible? I’m guessing that Cat God will appear in the third game and Captain Ling will appear in the fourth game.”</p><br/><p>Yu Bing didn’t explain it. She just had a strong hunch.</p><br/><p>The third game had to be foolproof!</p><br/><p>If the third game was lost, the US team will win directly with 3:0 and the Chinese team would completely miss the championship.</p><br/><p>Kou Hongyi’s mention of Cat God in the third game and Captain Ling in the fourth game was a double insurance arrangement. However, Li Cangyu alone was less insurance than Ling Cat together.</p><br/><p>The third game was the home game of the US team. It could be seen from the Doomsday Crisis map that the maps the US team left for the finals were very difficult.</p><br/><p>Yu Bing knew Li Cangyu and Ling Xuefeng for many years and understood the extent of their connection. At this moment, she hoped the two of them could join forces in the World Competition!</p><br/><p>***</p><br/><p>The five minutes of intermission ended and the captains sat at the command post again. This was the US team’s home game and the mode submitted by Noah was still death racing. He didn’t hesitate when submitting the maps because he clearly had a plan.</p><br/><p>Hollywood Universal Studios, New York Time Square, Frost Temple.</p><br/><p>The three maps appeared on the big screen at the same time.</p><br/><p>Times Square had appeared in the previous group stage. Li Cangyu had repeatedly practiced it during the last few days and it wasn’t difficult to fight. The problem was that when the Hollywood Universal Studios map appeared in the first game, LI Cangyu banned it and it could no longer be banned a second time.</p><br/><p>Noah might’ve submitted three maps but according to the competition rules of ‘two country submitted maps can’t be banned at the same time’ and ‘the same map can’t be banned twice’, Li Cangyu was forced to choose Universal Studios.</p><br/><p>In other words, Noah was forcing Li Cangyu to choose the map he wanted the Chinese team to choose.</p><br/><p>This meant the difficulty of Universal Studios didn’t lose to Doomsday Crisis!</p><br/><p>It could be seen from this that the US team were well prepared for the finals. The pit left by the maps was much better than the previous Korean team.</p><br/><p>In any case, he could only choose this. Li Cangyu didn’t hesitate and banned the other two.</p><br/><p>Noah then submitted the lineup— Noah (black magician), Alyssa (white magician), Thomas (archer), Jack Josh (blood kin summoner), Edmund (blood kin assassin).</p><br/><p>Among them, Edmund and Jack had played in the first game but could plan in this game due to the interval of one game.</p><br/><p>Noah’s lineup could be called the American team’s all-star lineup. Every player had a high popularity and him sending them showed he obviously wanted to win match point without giving the Chinese team a chance for a comeback.</p><br/><p>How would Li Cangyu respond?</p><br/><p>The domestic audience was going crazy and many people were cheering for the national team.</p><br/><p>[This match pint must be endured!] [Cat God, have strength!] [The lineup of the US team seems very complicated. In fact, it is comprehensive and every player is a world-class master!] [This map definitely isn’t simple. Cat God, endure it!]</p><br/><p>Everyone was anxious commenting while Li Cangyu finally submitted the Chinese team’s lineup.</p><br/><p>—LI Cangyu, Ling Xuefeng, Qin Mo, Xiao Han and Bai Xuan.</p><br/><p>Kou Hongyi was so excited he almost ate his microphone. “My god! Cat God and Captain Ling actually went out together!”</p><br/><p>Yu Bing smiled. As she expected, the Ling Cat combination showed up in the key game!</p><br/><p>There was an uproar in the domestic live broadcast room. [Ling Cat 6666!] [It is the combination of Wind Colour and Canglan!] [This is a biological weapon!] [Ling Cat is too handsome!] The video couldn’t be seen clearly due to the barrage of comments.</p><br/><p>Canglan’s master and apprentice and Wind Colour’s master and apprentice. The three summoners were combined with a mobile assassin for a violent output. Then their survival ability was enhanced by the cockroach God Milk Bai Xuan. LI Cangyu’s confident eyes seemed to be telling the US team, ‘Don’t be happy too soon!’</p><br/>\n</div>"}