{"title": "Chapter 348 - China VS USA (Summoning Flow)", "id": 348, "volume": 4, "url": "http://boxnovel.org/god-level-summoner-chapter-348-china-vs-usa-summoning-flow", "volume_title": "Volume 4", "body": "<h1>Chapter 348 - China VS USA (Summoning Flow)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 348 – China VS USA (Summoning Flow)</p><hr/><br/><p>Li Cangyu submitted the lineup and the map of Universal Studios was shown on the screen. As he expected, this map wasn’t easier than Doomsday Crisis.</p><br/><p>Universal Studios had three regions, all of which were themed areas styled after world-renowned Oscar winning movies. For example, the Titanic theme area was a huge ship that sunk into the sea. Players could only stand on the submerged ship and it was a pure water combat area. The theme area of Inception was a large labyrinth mixed with illusions while the Lord of the Rings area was an elf forest and could be used as a venue for guerrilla warfare.</p><br/><p>The Miracle League had certain restrictions on the size of the game map. The American designers made these three areas according to the specified map size. The complexity dazzled the audience and it could be seen that the American designers placed a lot of effort into the design of this map.</p><br/><p>In fact, this map was similar to China’s Suzhou Gardens. The comprehensive map had many changing factors and the combat environment was complicated. The home team naturally had the advantage due to their comprehensive understanding of the map.</p><br/><p>Fortunately, Li Cangyu’s ability to interpret the map was extremely strong. He watched the panoramic view of the map and had a clear impression of it in his mind.</p><br/><p>He glanced over at Ling Xuefeng and saw him staring at the screen. After becoming aware of Li Cangyu’s gaze, LIng Xuefeng whispered, “Our lineup isn’t suitable for a pure water combat.”</p><br/><p>Li Cangyu nodded. “Yes.”</p><br/><p>Ordinary Miracle water maps had footholds for players to stand on to release their skills. However, the Titanic shipwreck was at the bottom of the sea and players directly refreshed in the water. Li Cangyu’s fire spirit, Ling Xuefeng’s black crows and Qin Mo’s vampire bats couldn’t be summoned in the water. This greatly weakened the Chinese team’s combat effectiveness.</p><br/><p>Kou Hongyi saw the map and couldn’t help saying, “I didn’t expect the US team to make a 100% pure water battle area. This is obviously aimed at our summoners, right? Everyone knows that Cat God’s most commonly used attack pet is the fire spirit and the fire spirit can’t survive in the water. This means that Cat God’s attack power will be greatly reduced.”</p><br/><p>“Captain Ling’s black crows and Qin Mo’s bats also can’t be summoned under the water.” Yu Bing had some concerns. “It seems that the US team has investigated the situation of the Chinese players. When designing their maps, they targeted the more powerful summoners on our side.”</p><br/><p>The shipwreck battle was equivalent to abolishing Ling Xuefeng’s vision control, LI Cangyu’s fire spirit attacks and Qin Mo’s blood-sucking big move. However, the other two regions had little effect on the summoner.</p><br/><p>Everyone could only silently pray that Captain Ling, Cat God or Qin Mo didn’t refresh on the sunken boat at the bottom of the water.</p><br/><p>***</p><br/><p>The map view was over and players of both sides sat in front of the computers.</p><br/><p>The US team’s captain, Noah spoke firmly. “The third game is our match point. We must surely win it!”</p><br/><p>The archer Thomas excitedly rubbed his hands together. “Captain, rest assured. We will surely win this game! They have sent three summoners but didn’t expect for our map to have a pure water combat area. This is simply sending us a chance!”</p><br/><p>Jack was also confident. “The blood kin summoner is more capable of surviving underwater than the elf or demon summoner. As long as their summoners refresh at the bottom of the water, our advantage is very large.”</p><br/><p>The players of the US team were clearly full of confidence because it was their home map.</p><br/><p>On the Chinese side, LI Cangyu didn’t talk too much about tactics. Instead, he joked, “If I send instructions at the same time as Xuefeng, who will you listen to? Vote quickly.”</p><br/><p>Bai Xuan laughed. “I will naturally listen to Cat God.”</p><br/><p>Xiao Han didn’t hesitate. “I will listen to Master.”</p><br/><p>Ling Xuefeng glanced at him and replied softly, “I’ll listen to you.”</p><br/><p>“I will listen to Master…” Qin Mo had just said this when he heard his master say he would listen to Li Cangyu. Qin Mo wittily changed his words. “Cough, I will also listen to Cat God!” The bottom of the food chain had no say. Since his master said this, how could he hesitate to listen to Cat God?</p><br/><p>Li Cangyu won all votes and smiled with satisfaction. “That’s good. Let’s play it easily. If necessary, I will give orders on the voice channel. In order to avoid distraction, Xuefeng will make eye contact or mark it directly on the map.”</p><br/><p>Ling Xuefeng nodded. “I know.”</p><br/><p>The five players could smash the American team with their tacit understanding.</p><br/><p>There was no need to talk about the tacit understanding between Ling Xuefeng and LI Cangyu. Bai Xuan had been partners with Li Cangyu for seven years while Xiao Han was Li Cangyu’s apprentice. Qin Mo had also grown up watching Li Cangyu. Playing with these four people, Li Cangyu was very relaxed despite it being the US team’s match point.</p><br/><p>It was like he was traveling with friends and family and didn’t feel the ‘tremendous pressure’ that reporters thought.</p><br/><p>This game might be difficult but Li Cangyu was confident.</p><br/><p>***</p><br/><p>Today’s god of luck obviously didn’t take care of the Chinese team. After loading the map, the players of both sides appeared in Universal Studios at the same time and the audience almost vomited blood. LI Cangyu and Ling Xuefeng actually refreshed together on the Titanic shipwreck, directly wasting their fire spirit and black crows!</p><br/><p>Qin Mo and Xiao Han appeared in the Lord of the Rings forest area while Bai Xuan was alone in the Inception labyrinth.</p><br/><p>The audience had the god’s perspective and could see that the black magician Noah and the white magician Alyssa refreshed in the water area battle like Ling Cat. The blood kin summoner Jack and the blood kin assassin Edmund appeared in the forest area with Xiao Han and Qin Mo while the archer Thomas was alone in the labyrinth.</p><br/><p>In other words, there were four people in the water combat zone, four people in the forest area and two in the labyrinth.</p><br/><p>This was clearly intentionally designed by the American designers.</p><br/><p>The black and white magician’s ability to fight underwater was higher than the two summoners. The forest area had a combination of assassin and summoner. Edmund and Jack’s fame was much higher than Xiao Han and Qin Mo.</p><br/><p>Fortunately, the Chinese team had the milk dad Bai Xuan refresh in the maze. Thomas might now the map but it was impossible to kill the healer through ambush in the maze. Bai Xuan’s survival ability had no problems but the labyrinth would greatly affect the speed of his support. It would be hard for him to leave the labyrinth to help his teammates.</p><br/><p>Based on the refresh positions, the Chinese team was absolutely in the worst situation.</p><br/><p>Kou Hongyi’s tone was a bit annoyed, “It seems that our team’s luck today is very poor. The refresh locations of the two death racing games are particularly bad. LIng Cat directly appeared in the water and abolished two pets. They can’t summon the fire spirit or black crows!”</p><br/><p>Yu Bing frowned. “Noah and Alyssa are the captain and vice-captain of the American championship team. The combination of black and white magician is the classic partnership of the US team. In a 2v2 situation where Captain Ling and Cat God have the disadvantage in skills, it will be difficult to win. We can only watch and see if they can think of another way.”</p><br/>\n</div>"}