{"title": "Chapter 343 - China VS USA (Zombie Tide)", "id": 343, "volume": 4, "url": "http://boxnovel.org/god-level-summoner-chapter-343-china-vs-usa-zombie-tide", "volume_title": "Volume 4", "body": "<h1>Chapter 343 - China VS USA (Zombie Tide)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 343 – China VS USA (Zombie Tide)</p><hr/><br/><p>Liu Xiang was chased by zombies and only had a trace of blood left when she arrived at the red resurrection point. Fortunately, the Healing Language buff on her body meant she wasn’t killed by the zombies.</p><br/><p>The resurrection point on the American side was the same, with a large number of zombies around it. This was because death racing had two resurrection points. The Miracle League stipulated that the environmental gap shouldn’t be too large or it would be unfair to the away team.</p><br/><p>However, the US team still had an advantage due to the presence of the paladin.</p><br/><p>The paladin used Guardian’s Power to place defense shields on the five US players, meaning they wouldn’t be disturbed by the zombies. Moreover, the zombies moved slowly and it wasn’t difficult to bypass the zombie herd.</p><br/><p>The two sides met in the middle of the street and large-scale combat broke out again.</p><br/><p>Edmund and Jack were nowhere to be seen. The four blood kin players had dispersed while in stealth so Yu Pingsheng’s big move and Jiang Xu’s trap only revealed two of them.</p><br/><p>Viewers found that the remaining two were walking in the room next to them and were coming to the rear of the Chinese team.</p><br/><p>The paladin drove into the Chinese team’s lineup, the Indestructible move on his body to attrack firepower while placing the defensive shield Iron Will on his teammates.</p><br/><p>Su Guangmo and Jiang Xu worked together to kill the revealed blood kin summoner.</p><br/><p>Then Su Guangmo did an unexpected operation. He suddenly opened Light and Shadow Rotation and hit all the surrounding zombies.</p><br/><p>The zombies exploded and released poison, affecting the three US players in front of them. Three layers of poison were applied and the US players lost 3,000 blood every second.</p><br/><p>Su Guangmo and Jiang Xu were also poisoned by they had a healer to help take care of them.</p><br/><p>The Chinese team actually used the doomsday environment to create advantages, the approach making Edmund somewhat unprepared. Fortunately, he reacted quickly and ordered, “Set fire to kill the healer!”</p><br/><p>Both Jack and Edmund were world-class players and didn’t panic.</p><br/><p>The two people lurked behind Liu Xiang and Edmund used Pain Blade to make Liu Xiang dizzy. Jack followed with an outbreak and Liu Xiang had five layers of bleeding applied.</p><br/><p>Liu Xiang’s Purification had just been used to save Su and Jiang and she couldn’t resolve her bleeding state. The five layers of bleeding were terrible and there was also the dizzy effect. She used the instant skill Holy Light Surge to fill up her blood but she couldn’t keep up with the output of the four US players.</p><br/><p>Under Edmund’s command, the two assassins and two summoners of the US set fire to Liu Xiang and incredibly took away her life in one breath.</p><br/><p>The situation was 4v5 and it seemed that the Chinese team had the disadvantage, but the US team was affected by the bleeding and three players had their health fall below 40%.</p><br/><p>Su Guangmo worked with Yu Pingsheng, Meng Jie and Jiang Xu to release a fierce outbreak. The two sides collectively opened big moves and blood splashed on the doomsday map.</p><br/><p>The paladin of the US relied on Steel Battle Soul to endure but eventually fell under Su Guangmo’s sword. Jiang Xu became the target of Jack and Edmund and soon fell down.</p><br/><p>This wave of combat was extremely fast. The three poisoned US players were quickly taken down by Su Guangmo but they killed Yu Pingsheng before they died. Yu Pingsheng once again gave Jack a head.</p><br/><p>The Chinese team was left with Meng Jie and Su Guangmo while the US had Edmund and Jack left. In this situation, it was hard for Su Guangmo to win because Jack and Edmund could rely on their blood-sucking. In addition, Edmund’s close interference and Jack’s output distance was very good. He could completely use his pets to attack Su Guangmo and Meng Jie.</p><br/><p>The Chinese team couldn’t let them get any more heads!</p><br/><p>Su Guangmo thought this and ordered on the voice channel, “Meng Jie, kill the zombies!”</p><br/><p>Once the battle was delayed, the two of them were sure to fall into a disadvantage.</p><br/><p>The blood kin players could slowly restore their blood by attacking. Since there were so many zombies around, it was better to die together!</p><br/><p>Su Guangmo’s approach was simple and rough. Meng Jie was targeted by Jack and Edmund and couldn’t release any skills. Su Guangmo suddenly rushed forward and used Spirit Lock on Edmund to rescue Meng Jie. Meng Jie followed by using Cut Through Thorns!</p><br/><p>The golden axe waved through the air and killed all the zombies around her in seconds!</p><br/><p>The large range corpse poison affected the four people and even Jack in the distance didn’t survive. The rapidly stacked up poison caused the blood of the four people to die and their death news appeared on the big screen.</p><br/><p>Both sides were wiped out!</p><br/><p>The US audience members were very unhappy. After all, Jack had been full of blood just now.</p><br/><p>Originally, it should be possible for Jack and Edmund to slowly grind Su Guangmo and Meng Jie to death. The result was that Su Guangmo directly killed them all and this wave of combat ended.</p><br/><p>The thrilled Kou Hongyi’s voice was hoarse. “This round of combat was too fast and many small skills couldn’t be seen clearly! Captain Su’s style at the last minute was really rough and handsome. He noticed that he and Meng Jie were in a disadvantageous situation and were directly killed by the zombies, not giving any side a head!”</p><br/><p>“The battle between both sides was very fierce. This wave was 5:5 and the current heads ration is 9:8. The Chinese team has to kill two people if they want to win while the US team only needs to kill one.” A bad feeling suddenly filled Yu Bing’s heart but she didn’t dare to speak. After all, it wasn’t good to have a crow’s mouth by saying the Chinese team would lose.</p><br/><p>In fact, the current situation was really bad for the Chinese team.</p><br/><p>One head was very simple for the American team because they had four blood kin players. As long as all four blood kin players went invisible and aimed at one person, their violent output could easily kill a person.</p><br/><p>Sure enough, as she expected, the US team chose the red resurrection point this time. After the full resurrection, the four blood kin players entered stealth and disappeared from the red resurrection point.</p><br/><p>The Chinese players were extra careful, especially Jiang Xu who always set traps every step of the way. However, one person’s defense ability was limited and he couldn’t set traps in every direction.</p><br/><p>Just then, the US assassin Abel suddenly appeared at the rear of the Chinese team, apparently revealed by Jiang Xu’s trap. Su Guangmo turned with Yu Pingsheng and rushed to kill the blood kin assassin!</p><br/><p>The paladin also appeared and used Steel Battle Soul to save his teammate.</p><br/><p>The other three blood kin players of the US appeared at the same time. The paladin stunned Liu Xiang while the others tried their best to kill the weakest defense Jiang Xu. His blood fell to below 50% in the blink of an eye!</p><br/><p>Liu Xiang used Purification to remove his dizziness and aimed a big move at Jiang Xu to restore his blood to more than 80%. The next moment, she was controlled by the assassin Edmund!</p><br/><p>Chain Strangulation, Blood Bat Festival!</p><br/><p>The American team’s double assassins and double summoners opened big at the same time. Jiang Xu was disabled and Jack stacked five layers of bleeding on him. The speed of his blood loss was fast enough to be dazzling.</p><br/><p>Edmund took the opportunity to use Combat Stealth and everyone lost sight of him. He was behind Jiang Xu and the dagger in his hand fell to kill the residual blood Jiang Xu.</p><br/><p>At almost the same time, Su Guangmo and Yu Pingsheng took the life of the assassin Abel. It was a pity that death racing judged victory as the team that won 10 heads first. The US team took the lead to win 10 heads and this game ended.</p><br/><p>The applause at the scene was so warm that it almost overturned the roof. Jack’s face showed a confident smile and Edmund was calm, stating, “This is a lot harder to play than I expected.”</p><br/><p>Jack shrugged. “We won so they can only do so much.”</p><br/><p>Edmund was too lazy to talk to this single-celled animal. He just felt that if Su Guangmo hadn’t been unlucky enough to refresh alone at the upper part of the map, the result was likely to be different.</p><br/><p>They killed the lone Su Guangmo at the beginning and gained the advantage of a head and in the group combat after that, both sides were extinguished. If they had given Su Guangmo some time, perhaps the situation would’ve reversed.</p><br/><p>Edmund thought for a moment and took everyone back to the rest area, carefully explaining his thoughts to Captain Noah.</p><br/><p>***</p><br/><p>On the Chinese team, Jiang Xu stared at his grey screen and spoke helplessly. “Sorry.”</p><br/><p>Su Guangmo patted him on the shoulder and smiled. “Don’t blame yourself. It isn’t your fault.”</p><br/><p>They had lost the game but Su Guangmo was still stoic. This sentiment affected the teammates around him and everyone walked back in a calmer state.</p><br/><p>After all, this game had two world-class masters in Jack Josh and Edmund while it was their home doomsday map. The Chinese players did their best.</p><br/><p>After seeing them come over, Li Cangyu stood up and comforted them. “Never mind, there is still a chance afterwards. We can’t win 3:0 against the US and there will always be a loss. We should still be relaxed.”</p><br/><p>“I hope it is 3:1 and we can win three games in a row,” Cheng Wei laughed.</p><br/><p>This was definitely the expectations of many people but it wasn’t easy to achieve.</p><br/><p>It was because the captain of the US team and the world’s number one magician Noah, the vice-captain and goddess healer Winfrey, the talented swordsman Angus and the archer Thomas hadn’t yet appeared.</p><br/>\n</div>"}