{"title": "Chapter 345 - China VS USA (Economic War)", "id": 345, "volume": 4, "url": "http://boxnovel.org/god-level-summoner-chapter-345-china-vs-usa-economic-war", "volume_title": "Volume 4", "body": "<h1>Chapter 345 - China VS USA (Economic War)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 345 – China VS USA (Economic War)</p><hr/><br/><p>The Mechanical City’s mobs were remote damage dealers and released arrows 360 degrees around them. The US players weren’t accustomed to such a rhythm and were injured by the arrows. Nevertheless, they were all first-class professional players and quickly understood the rotation of the mechanisms. They rapidly moved around them and hitting the mechanisms wasn’t difficult.</p><br/><p>Captain Noah had told them to be steady in the early stages and don’t let the Chinese team take any heads. Thus, the US team was very careful when playing against the mobs.</p><br/><p>There was the protection of a paladin on the road and Angus was relatively safe. Lu Xiao and Yang Muzi failed to find a chance to kill the other side and both sides steadily killed the mobs to make money.</p><br/><p>The two berserkers were thick-skinned. Yan Ruiwen took the initiative to hit them with black magic but only beat them to half blood. The output of the two black magicians wasn’t enough to kill the high defense berserker.</p><br/><p>In the middle, the Tan Shitian and Cheng Wei combination faced the US team’s Benjamin and Winfrey. There was a healer and wanting to kill Benjamin was almost impossible. Tan Shitian was too lazy and concentrated on clearing the mobs.</p><br/><p>After the first round of mobs was over, neither side had got a head and they calmly returned to the city to update their equipment. Yu Bing saw this and couldn’t help saying, “It seems that both sides are playing stably in the early stages. They will wait for the ice dragon before fighting.”</p><br/><p>This was a chance for both sides in a frontal confrontation. Kou Hongyi stated, “The output of the Chinese team is terrible but Winfrey of the US team is called a milk god. It will be difficult to kill the opponents with her presence. The key is how Captain Tan handles the healer.”</p><br/><p>Yu Bing agreed. “In my opinion, it is better for the Chinese team to send two people to interfere with the healer while the other four act as output. It isn’t easy to deal with a healer alone and there is also the protection of the paladin.”</p><br/><p>As Yu Bing stated, Tan Shitian definitely took this into consideration.</p><br/><p>Once the two sides met at the ice dragon, he and Lu Xiao didn’t stand together as usual. They distance to the left and right with Cheng Wei and Yang Muzi standing next to them respectively. Yan Ruiwen and Guo Xuan stood in the middle and were prepared to use their black magic control at any time.</p><br/><p>As soon as the American team appeared, Guo Xuan immediately used the big move Dark Fear!</p><br/><p>This group control skill successfully hit but the other side’s paladin responded quickly. He used Iron Will to make his teammates immune to control and all attacks for five seconds.</p><br/><p>The American team pounced like tigers towards Tan Cheng. Since the couldn’t be controlled, Tan Shitian and Cheng Wei had to quickly turn to escape. Benjamin used Soul Lock on Tan Shitian but at this moment, Cheng Wei came behind Tan Shitian and used his body to help Captain Tan block the skill!</p><br/><p>Many viewers were surprised by Cheng Wei’s actions. Tan Shitian also didn’t expect it and he found that Cheng Wei looked very serious. Tan Shitian’s heart warmed and he instantly used Flying Feather Steps to run.</p><br/><p>Cheng Wei used Purification to get rid of the control and placed a protection halo around himself.</p><br/><p>Tan Shitian’s archer was a high damage class and Flying Feather Steps allowed him to complete his flexible long-range kiting style. However, his shortcomings were also obvious. He had weak defense and no active control removal skills.</p><br/><p>Compared to the archer, a white magician’s survival ability was much stronger. That’s why Cheng Wei ran to save Tan Shitian. He knew that once Tan Shitian was controlled by the swordsman, the combination of the two swordsmen and berserkers was likely to kill Tan Shitian in seconds.</p><br/><p>The white magician wasn’t easily killed. At the very least, he could resolve the control and protect himself with white magic.</p><br/><p>Cheng Wei’s support allowed Tan Shitian to run very far with Flying Feather Steps. The US team couldn’t catch up with him and everyone transferred targets to Cheng Wei. The US team had five seconds of damage immunity and Cheng Wei hitting them was useless. He had to find a way to escape.</p><br/><p>The paladin used Fighting Howl to pull Cheng Wei to him while the other swordsman closely followed with Spirit Lock. Meanwhile, the berserker used Mountain Chop to create a deep gully that blocked Cheng Wei’s escape route.</p><br/><p>The two swordsmen and berserkers unleashed a violent wave and in five seconds, Cheng Wei was beaten to 10% residual blood!</p><br/><p>This was the case where the white magician’s guardian aura that increased defense existed. If the person had been Tan Shitian then he would’ve died a long time ago, Cheng Wei thankfully thought.</p><br/><p>The ability of the American team to set fire to a person was really strong. After five seconds, Cheng Wei’s blood was in jeopardy but it was difficult for him to escape. Still, he made a fine operation. On the screen, the white magician suddenly jumped forward to the rear of a pillar and quickly cast God’s Seal!</p><br/><p>It was the fastest control skill and accurately fell on the body of the healer Winfrey.</p><br/><p>Cheng Wei followed up with Tidal Surge.</p><br/><p>It dealt a large amount of group damage and had a deceleration effect.</p><br/><p>After three seconds, the four outputs of the US team rushed to kill Cheng Wei and Benjamin got the head.</p><br/><p>The domestic audience felt pained for Cheng Wei. They didn’t expect him to save Tan Shitian at the critical moment. Of course, his choice was undoubtedly sensible. Thanks to him, Tan Shitian could play his kite flow tactics.</p><br/><p>Li Cangyu watched the game and gave a relieved smile. “Xiao Wei has become really smart and he isn’t as impulsive as before.”</p><br/><p>Ling Xuefeng nodded. “His sacrifice was worth it.”</p><br/><p>The key skill God’s Seal controlled the healer and then Tidal Surge decelerated the other side. Cheng Wei laid a great groundwork for the next kite flow before his death.</p><br/><p>Previously, the US team had the immunity shield and Yan Ruiwen and Guo Xuan couldn’t attack. They quickly moved into position and waited for an opportunity. The moment they found an opportunity, Yan Ruiwen used the group control Dark Fear and Yang Muzi used Tidal Surge!</p><br/><p>The Tidal Surge of the two white magicians overlapped to form a double deceleration effect.</p><br/><p>At this time, Tan Shitian and Lu Xiao had met in the distance and they raised the bows in their hands. A large number of arrows fell towards the US team. It was Death Arrow Rain!</p><br/><p>This wave of attacks caused the entire US team to lose a large amount of blood. Winfrey helplessly had to open the healing array and healing chain to return blood to her teammates while the paladin used Steel Battle Soul, which bounced back all damage for three seconds!</p><br/><p>Tan Shitian and Lu Xiao immediately stopped and the US outputs took advantage of this opportunity to break through to Yang Muzi. They wanted to kill Yang Muzi but she ran while using God’s Light and Voice of Combat to attack</p><br/><p>Unfortunately, the existence of Winfrey meant her attacks didn’t have much of an effect. The consecutive healing chain refilled blood and the US team were back to full blood.</p><br/><p>Instead, Yang Muzi was chased by the other swordsman and soon killed.</p><br/><p>Less than half a minute after the start of the battle, the two white magicians on the Chinese side had died. The situation was grim and many Chinese viewers were anxiously clenching their fists and writing comments.</p><br/><p>Tan Shitian’s expression was very calm at this time. Once the three seconds of damage reflection was over, he and Lu Xiao once again opened a strong wave of attacks with Rapid Shot, Shock Shot, Barrage Shot and Seize Life Shot!</p><br/><p>The archers were an extremely aggressive remote class and the further away they were, the more likely it was for them to strike successfully.</p><br/><p>Tan Shitian and Lu Xiao took advantage of Cheng Wei and Yang Muzi drawing the firepower to run to a distant place. The two people’s output environment was excellent and almost every shot was a critical hit!</p><br/><p>The result was that the US team’s healer Winfrey was killed by the two of them in seconds!</p><br/><p>The healer had died and Yan Ruiwen and Guo Xuan immediately used the advantages of black magic. They used Death Mantra and Shadow Winding to lay negative states on the enemies, causing the US players to lose blood every second.</p><br/><p>Without a healer, the loss of blood couldn’t be stopped and the US team also had to face the remote archers…</p><br/><p>Benjamin and Angus used their ‘Quick Pace’ skill to catch up with the Yan Guo combination and killed Guo Xuan. However, before Guo Xuan’s death, he used the big move Hell Flames to hit them.</p><br/><p>In the distance, Tan Shitian fired two arrows while Yan Ruiwen used the Shadow Wrath group attack. The result was that the moment Guo Xuan died, Yan Ruiwen directly took two kills!</p><br/><p>The US team’s melee classes were decelerated by Cheng Wei and Yang Muzi and couldn’t catch up with Tan Shitian. Thus, Tan Shitian’s kite flow was played to the fullest. The moment Yan Ruiwen killed the two swordsmen, Tan Shitian and Lu Xiao cooperated to wipe out the entire US team!</p><br/><p>The Chinese viewers regained their strength and desperately filled the screen with flowers.</p><br/><p>Even so, Tan Shitian didn’t forget to give credit to Cheng Wei. He gently touched the back of Cheng Wei’s hand and stated, “Your protection was excellent.”</p><br/><p>Cheng Wei smiled proudly, “Of course!”</p><br/><p>The reason why Tan Shitian could freely chat with Cheng Wei was because he and Lu Xiao couldn’t kill the ice dragon. The high intensity guerrilla warfare had completely consumed their blue.</p><br/><p>“Go back to the town.” Tan Shitian helplessly headed back to the town with Lu Xiao.</p><br/><p>The two archers lost all their blue in the first wave, showing how difficult it was to deal with the US team. The group of thick-skinned paladin and berserkers along with the healer was too difficult to kill.</p><br/><p>The good thing was that the Chinese team gained the advantage in the first wave.</p><br/><p>Tan Shitian had killed four people while Yan Ruiwen got the double kill. The two swordsmen of the US team also got two heads and would need to be carefully handed in the next wave of team combat.</p><br/><p>The most comforting thing for Tan Shitian was that Cheng Wei had grown in this World Competition. His reaction in the critical moment just now was particularly sensible.</p><br/><p>He was no longer the impulsive fighting cat and now had the good sense to fight alongside Tan Shitian.</p><br/>\n</div>"}