{"title": "Chapter 358 - China VS USA (Phase Two)", "id": 358, "volume": 4, "url": "http://boxnovel.org/god-level-summoner-chapter-358-china-vs-usa-phase-two", "volume_title": "Volume 4", "body": "<h1>Chapter 358 - China VS USA (Phase Two)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 358 – China VS USA (Phase Two)</p><hr/><br/><p>Tan Shitian only had 5% blood and 0% blue left, which wasn’t a big threat to the players that came next. However, the US team’s Thomas and Noah were world-class masters. The fact that Tan Shitian could send off two great gods meant he had completed his task in a satisfactory manner.</p><br/><p>On the big screen, the list of the next US players was shown. It was the terran swordsman Benjamin and the terran swordsman Angus.</p><br/><p>Both men were players of the ICE team. Benjamin was the captain and Angus won the best rookie award last season.</p><br/><p>The two players loaded and moved quickly to the middle of the map. Angus only used two simple combo strikes to take away the life of the bloody Tan Shitian, letting the arena enter the second phase.</p><br/><p>Tan Shitian and Zhuo Hang walked back to the rest area. Cheng Wei wanted to run to Tan Shitian to say a few words but he had just got up when he saw Liu Xiang also standing up. Tan Shitian talked to Liu Xiang with a smile and Cheng Wei had to sit back down.</p><br/><p>A moment later, Tan Shitian returned to his seat and sat down. He found that Cheng Wei’s head was hanging down and he seemed to be thinking about something. Tan Shitian couldn’t help bending towards his ears and asking, “What’s the matter? Are you unhappy?”</p><br/><p>Cheng Wei shook his head. “No, you had a good game with Zhuo Hang. I was just thinking about a problem.”</p><br/><p>Tan Shitian was puzzled. “What problem are you thinking about?”</p><br/><p>Cheng Wei didn’t answer. He just scratched his head with embarrassment and seemed a bit upset. He didn’t know why he was caring more and more about Tan Shitian and in order to avoid any more fantasies, Cheng Wei raised his head to focus on the game.</p><br/><p>The list of players sent by the Chinese team to the second phase soon appeared on the big screen— the swordsman Su Guangmo and swordsman Xie Shurong.</p><br/><p>The names of the two men appeared and the audience exclaimed.</p><br/><p>Cat God was truly a combination demolisher. He once again tore apart a fixed combination. He didn’t let Shu Bai or Su Yu to the field but instead arranged the apprentice brothers, Su Guangmo and Xie Shurong.</p><br/><p>This way, the two sides entered the second phase and it became a double swordsmen VS double swordsmen situation.</p><br/><p>The lineup for the deciding game had been submitted before the game. In other words, when Li Cangyu submitted the list, he didn’t know the players and the order of the US team. He only guessed that the other party would send a swordsman master and made such an arrangement.</p><br/><p>Benjamin was the captain of the ICE team and in the American Miracle League, he was considered an older god with strong personal standards and commanding ability. Noah had no reason not to put him on in the deciding game. Once he appeared in the arena, there would only be two choices for his partner. One was the team’s genius summoner Jack Josh and the other was the team’s rookie swordsman, Angus.</p><br/><p>In either case, sending Shu Bai to play was inappropriate. Benjamin’s level was similar to Su Guangmo. If he brought the strong Jack or Angus as a partner, it was likely that he could control the Chinese players and send them off in one wave.</p><br/><p>Bai Xuan and Xie Shurong could delay the battle but their output wasn’t enough. It would be difficult for Ah Shu to kill two gods of the ICE team alone. After all, he had played in the ICE team for a long time and their players were knowledgable about him.</p><br/><p>Thus, Li Cangyu changed tactics and removed the Shu Bai combination that was good at a war of attrition. Instead, he formed a partnership between Su Guangmo and Xie Shurong. The two swordsmen teaming up could play quickly and could recklessly fight against the US team.</p><br/><p>As it happened the US team also sent a double swordsmen lineup.</p><br/><p>Su Guangmo patted Xie Shurong’s shoulder and said, “These are your old teammates.”</p><br/><p>Xie Shurong smiled back. “Rest assured, I won’t be polite to them.</p><br/><p>***</p><br/><p>Before Xie Shurong’s contract with the ICE Club expired, he was actually ostracized by the club.</p><br/><p>In the second half of the season, Captain Benjamin placed Xie Shurong on the bench and Xie Shurong didn’t play for two consecutive months. Therefore, he had time to run to the online game’s new district and unexpectedly met Li Cangyu and Bai Xuan.</p><br/><p>The rise of the swordsman rookie Angus was a challenge to Xie Shurong’s status. The captain use of Angus was clearly to train another team member who could replace Xie Shurong. The members of the ICE team were well aware of this.</p><br/><p>Under the captain’s leadership, Angus grew quickly and won the Best Newcomer Award in the blink of an eye.</p><br/><p>Xie Shurong definitely agreed with this boy’s talent but he didn’t like Angus’ arrogant character.</p><br/><p>Of course, Xie Shurong was too lazy to care about a child. At the time, his attention had been on the dishes made by Bai Xuan. Every day, he looked forward to finding Cat God and Bai Xuan. After the termination, Xie Shurong broke contact with the ICE members. He never thought that he would actually face them today in the World Competition.</p><br/><p>Both sides were swordsmen and this would be a fair contest!</p><br/><p>***</p><br/><p>Su Guangmo and Xie Shurong practiced together every day during the training camp many years ago. They were very familiar with each other’s style of play and rhythm. The tacit understanding between the apprentice brothers was still there. The two of them spread out in the forest map to the left and right as they quickly swept towards the middle.</p><br/><p>At this time, Benjamin and Angus were looking around vigilantly.</p><br/><p>The remnant in the corner of his eye suddenly looked like a piece of clothing. Angus immediately turned in that direction and rushed over, unceremoniously slamming Spirit Lock into Xie Shurong’s back!</p><br/><p>Xie Shurong seemed to have long guessed the other party would come over and easily moved two steps to avoid this control. Then he counterattacked with Spirit Lock to set Angus in place!</p><br/><p>Angus was young and energetic. His sword was lightning fast and his style of play was beautiful. His best means was using combos to attack the opponent and this was the same as Xie Shurong.</p><br/><p>However, Xie Shurong was obviously a lot calmer than him. After opposing Angus’ control, Xie Shurong turned back and stabbed his sword in the other’s chest. His sword followed up with a slash and a cross cut, smoothly attacking the other side and dropping Angus’ blood to 75%. This was almost as much damage as a big move.</p><br/><p>Kou Hongyi excitedly exclaimed, “Ah Shu just hit four strikes in two seconds. His combo speed is really terrible!”</p><br/><p>Yu Bing continued, “Angus was probably too impatient. He didn’t grab the first hand and ended up being countered by Ah Shu.”</p><br/><p>Angus wanted to grab the first hand only to be countered by Xie Shurong. The moment his dizziness ended, Angus immediately counterattacked by opening the big move Light and Shadow Rotation.</p><br/><p>The gorgeous white sword light shrouded Xie Shurong in a dense net and Xie Shurong’s blood fell to 70%. This type of tit for tat style was also in line with Angus’ personality.</p><br/><p>Angus’ state of mind wasn’t calm towards his old teammate. He seemed to want to prove that he was stronger than Xie Shurong. His long sword flew in his hand and decreased blood, wanting to drop Xie Shurong in seconds.</p><br/><p>Li Cangyu saw this and couldn’t help feeling regret. “The young man isn’t very calm.”</p><br/><p>Bai Xuan smiled. “This can’t be blamed on him. After all, after Ah Shu left, the ICE team’s performance wasn’t as good as before. This year, forget the championship, they couldn’t even obtain a trophy. Many e-sports reporters in the US think that is it because Angus’ level isn’t as good as Xie Shurong that the ICE team’s performance declined. The pressure on Angus is actually quite big.”</p><br/><p>Li Cangyu looked back at him doubtfully. “Who are you supporting?”</p><br/><p>“I’m naturally supporting Ah Shu. I’m just analyzing the opponent’s psychological state.” Bai Xuan touched his nose before speaking seriously. “The more impatient Angus is, the more favourable it is for Ah Shu. Their style of play is similar and perhaps Angus’ hand speed is higher than Ah Shu. However, Ah Shu can stabilize the situation at a crucial moment.”</p><br/><p>Li Cangyu was somewhat curious. “This time you’re full of praise for Ah Shu. Didn’t you use to dislike him?”</p><br/><p>Bai Xuan disguised a cough and replied, “That’s because he used to chase me and created a psychological shadow. In fact, cough, I don’t hate him very much.”</p><br/><p>“Oh, that’s it.” Li Cangyu didn’t ask again and continued to pay attention to the game.</p><br/><p>Angus’ style of play was very fierce and he was pressing Xie Shurong. In the blink of an eye, half of Xie Shurong’s blood was cut.</p><br/><p>Next to them, Benjamin and Su Guangmo were having a confrontation around a tree.</p><br/><p>Su Guangmo’s Breaking Bone Sword hit Benjamin’s body and the latter wasn’t to be outdone. He immediately struck back with Breaking Bone Sword and the blood of both sides reached 50%.</p><br/><p>Kou Hongyi opened his mouth. “The attack power of a swordsman is truly fierce. The four swordsmen on each side are facing each other in a one-on-one fight and the rhythm of this game is obviously much faster than the previous one!”</p><br/><p>“The level of the four people is similar and in a frontal confrontation, the blood gap between the two sides might not be increased.” Yu Bing was speaking only to become stunned. “Perhaps this is what Cat God wants!”</p><br/><p>Li Cangyu broke up the Shu Bai combination and sent the double swordsmen lineup in order to ‘play fast.’</p><br/><p>There was no need to play too conservatively in the second phase and delaying the time meant things were prone to change.</p><br/><p>Quickly attack and consume a lot of the opponents’ blood. If possible, try to remove the heads of the other side to smoothly transition the arena to the third phase. This was the task that Su Guangmo and Xie Shurong had to complete.</p><br/><p>This task wasn’t difficult for them.</p><br/><p>Both of them were explosive and fast players and they were the best at a frontal confrontation.</p><br/><p>Angus and Benjamin were also trying their best with a fast break. It seemed they wanted to get the heads of Su and Xie as soon as possible.</p><br/><p>The four swordsmen were too fast and only the white sword light was left on the big screen. There was no way to clearly explain what skills they used.</p><br/><p>Xie Shurong’s blood was decreasing the fastest and he currently had the least blood of the four.</p><br/><p>On the surface, he was being passively beaten and suppressed by Angus. However, there was a strange instinct in Bai Xuan’s heart. Angus’ death was coming soon.</p><br/><p>Sure enough, once Xie Shurong had 15% blood left and Angus and Benjamin still had 40% remaining, Xie Shurong suddenly walked around a tree and arrived at the place where Benjamin and Su were fighting.</p><br/><p>The audience saw an incredible scene. Su Guangmo suddenly jumped forward and used Spirit Lock, directly stunning the chasing Angus .</p><br/><p>Xie Shurong immediately launched the group attack skill, Light and Shadow Rotation!</p><br/><p>He had been saving the big group attack all this time. Benjamin and Angus were within his attack range. Xie Shurong moved flexibly and controlled the sword to quickly attack the opponents. The damage of the big move was maximized under his skillful operation and Benjamin and Angus lost 20% blood at the same time!</p><br/><p>Su Guangmo had been recklessly attacking Benjamin and many skills were on cooldown. At this time, he tacitly exchanged goals with Xie Shurong.</p><br/><p>Xie Shurong’s big move Light and Shadow Rotation would attack both of them and then he followed up with Breaking Bone Sword and Devouring Soul Sword!</p><br/><p>The sword flowed and struck!</p><br/><p>Benjamin was actually killed by Xie Shurong in seconds!</p><br/><p>The audience cheering for the US team were stunned.</p><br/><p>They couldn’t seem to accept that Xie Shurong suddenly left Angus and ran behind the tree to kill Benjamin…</p><br/><p>What about 1v1? You suddenly joined forces with your fellow apprentice brother?</p><br/><p>Angus was surprised and angry. He had been pressing Xie Shurong this whole time and thought he could use a set of combos to take away Xie Shurong’s life. He didn’t expect the other party to suddenly flee and kill Benjamin instead.</p><br/><p>It felt like he was doing his best to kill the opponent, doing everything he could to surpass the opponent, only for the opponent to not think about him at all.</p><br/><p>Xie Shurong’s eyes had been on the battlefield next to him and he had been paying attention to the situation of Su Guangmo and Benjamin.</p><br/><p>No wonder why he resisted using any big moves. It turned out he didn’t want to suppress Angus and was waiting for an opportunity for a one hit kill.</p><br/><p>Angus’ face became hot at this thought. It felt like Xie Shurong had slapped him in the face and it made him uncomfortable. He immediately raised the sword in his hand and leapt forward, using Breaking Bone Sword on Xie Shurong.</p><br/><p>Xie Shurong responded rapidly by turning around and ‘blocking’ this attack. He followed by using Spirit Lock to set Angus in place.</p><br/><p>His control skill had finished its cooldown, which was why he suddenly teamed up with Su Guangmo.</p><br/><p>Angus was stunned in the game and his fingers almost crushed the mouse. The duration of the stun was only a few seconds but it was enough for Su Guangmo and Xie Shurong to join hands to kill the residual blood swordsman.</p><br/><p>Xie Shurong finally broke out his highest hand speed and played a beautiful five strikes in three seconds, clearing the 15% blood of Angus.</p><br/><p>Su Guangmo sent a row of applause on the team channel.</p><br/><p>Xie Shurong replied back, “You worked hard.”</p><br/><p>Su Guangmo smiled. “Why are you so polite? You reacted quickly to reverse the situation.”</p><br/><p>Xie Shurong replied bluntly, “If I hadn’t reacted quickly, you would’ve died in seconds to Benjamin.”</p><br/><p>Su Guangmo expressed his dissatisfaction. [If I hadn’t settled Angus, you would’ve died to Angus in seconds!]</p><br/><p>Yu Pingsheng sat in the audience and scratched his head. Su Xie were talking in the soundproof room, their lips moving quickly. He couldn’t hear what they were saying but he could guess that they were arguing again.</p><br/><p>Fortunately, he didn’t have to worry about mediating between them. It was a blessing…</p><br/><p>***</p><br/><p>Compared to the Chinese team’s brothers who easily won the second phase, the atmosphere of the US team was particularly stiff.</p><br/><p>Benjamin was actually very confident in the fight against Su Guangmo. He purposely entangled himself in fighting Su Guangmo to smash the other side. Angus would quickly kill Xie Shurong and form a two against one situation. However, the result surprised him.</p><br/><p>Xie Shurong suddenly ignored Angus and came to kill him. Then he went back and killed Angus with Su Guangmo. The cooperation between the two brothers caught Benjamin off guard.</p><br/><p>Angus’ expression was even uglier because he finally understood that Xie Shurong didn’t care about him at all.</p><br/><p>In the ICE team, he played with his teammates as the main lineup in the regular season while Xie Shurong was placed on the cold bench. At the time, he had been happy. He thought that he had finally replaced Xie Shurong and could finally surpass Xie Shurong.</p><br/><p>At the time, Xie Shurong just smiled slightly and hadn’t said anything.</p><br/><p>Today, Angus understood that Xie Shurong was actually a very open-minded person. He didn’t care about the challenges and threats of the younger generation. So what if his position was completely replaced in the ICE team? He freely left and found better teammates.</p><br/><p>Now he was much better than Angus!</p><br/><p>Angus suddenly found that he was actually a joke in Xie Shurong’s eyes.</p><br/><p>Angus’ expression was very depressed as he returned to the rest area and Benjamin’s expression also wasn’t great. Even so, the US team’s captain Noah was still generous and patted their shoulders in encouragement. Then he sent the American team’s guard combination.</p><br/><p>As Li Cangyu expected, the genius blood kin summoner Jack Josh was placed in the key guard position and his partner was the world’s number one killer who was always known for his calmness, Edmund.</p><br/>\n</div>"}