{"title": "Chapter 351 - China VS USA (Full Tacit Understanding)", "id": 351, "volume": 4, "url": "http://boxnovel.org/god-level-summoner-chapter-351-china-vs-usa-full-tacit-understanding", "volume_title": "Volume 4", "body": "<h1>Chapter 351 - China VS USA (Full Tacit Understanding)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 351 – China VS USA (Full Tacit Understanding)</p><hr/><br/><p>Players had five seconds of invincible protection after resurrecting at the resurrection point. Li Cangyu saw the other three people and immediately used Flying Feather Steps to run. Ling Xuefeng followed while calling four skeletons to help delay the time.</p><br/><p>They might have a tacit understanding but two against three was definitely disadvantageous. In particular, Thomas’ ranged arrows interference would kill their pets in seconds.</p><br/><p>The most sensible decision was to make use of the five seconds of invincibility to run.</p><br/><p>Nevertheless, it was impossible for Noah to let go of such an opportunity. Thomas also used Flying Feather Steps to chase.</p><br/><p>Li Cangyu and Ling Xuefeng tacitly separated at a fork in the road. Splitting up would distract the enemy and both of them wouldn’t be hit.</p><br/><p>Noah thought about it and made a decision. “Follow Ling Xuefeng!”</p><br/><p>After all, Ling Xuefeng was a demon summoner and didn’t have the movement speed bonus of Flying Feather Steps. Thomas was an elf archer and it would be relatively easy for him to catch up with Ling Xuefeng.</p><br/><p>The facts proved that his choice was correct. It didn’t take long for Ling Xuefeng’s back to appear in view and Thomas fired Quenching Arrow to slow down the opponent. However, it was like Ling Xuefeng had eyes in the back of his head as he summoned a skeleton to block Quenching Arrow.</p><br/><p>Thomas endured the urge to cough up blood and opened up Barrage Shot!</p><br/><p>Ling Xuefeng’s skeletons were hit and the white magician Alyssa followed up with God’s Seal to set Ling Xuefeng in place. Then Noah and Thomas immediately started to attack.</p><br/><p>—Seize Life Shot! Rapid Shot! Death Curse! Shadow Wrath! God’s Light! Voice of Combat!</p><br/><p>The black and white magic and arrows smashed towards Ling Xuefeng’s body and he fell to 25% residual blood. It could be seen that the first-class players of the US team were really capable of unleashing firepower.</p><br/><p>In this way, Captain Ling would soon die.</p><br/><p>The hearts of the domestic audience were in their throats because they saw that after Li Cangyu split up from Ling Xuefeng, he made a big circle and came behind Ling Xuefeng.</p><br/><p>Bai Xuan, Xiao Han and Qin Mo were also coming this way.</p><br/><p>Just then, Ling Xuefeng called out the guardian. The public pet cost him a lot of blue but he wasn’t stingy. The guardian blocked the next wave of attacks from the US team.</p><br/><p>Then Ling Xuefeng summoned his most powerful pet, the demon god!</p><br/><p>A thick black fog spread and all enemies in range were affected, causing their blood to rapidly fall.</p><br/><p>In the blink of an eye, the three American players fell to 75% blood.</p><br/><p>Ling Xuefeng used the guardian to resist one wave of attacks but couldn’t withstand Noah’s next moves. The black magic stacked on his body was detonated by Noah and the archer in the distance followed with Precise Shot. The bloody Ling Xuefeng finally fell to the ground.</p><br/><p>However, his sacrifice wasn’t in vain. The next moment, Li Cangyu had successfully merged with Bai Xuan, Qin Mo and Xiao Han!</p><br/><p>Qin Mo started with the blood kin summoner’s big move, Blood Bat Festival!</p><br/><p>Xiao Han also rushed forward and used the group attack, Chain Strangulation!</p><br/><p>The two teenagers took the lead and disrupted the formation of the American trio. Li Cangyu’s output environment was very comfortable and he summoned his main attack pet, the fire elf and used Raging Prairie Fire.</p><br/><p>The three group attacks ruthlessly smashed into them and the blood of the three US players fell to 15%.</p><br/><p>The three US players weren’t to be outdone and they aimed their big moves at the two blood kin teenagers. The wave of eruptions decreased their blood but Bai Xuan used a healing array to restore Qin Mo and Xiao Han’s blood. Then he gave them the Healing Language buff.</p><br/><p>Li Cangyu followed by summoning the thunder spirit and used Thunder’s Wrath to receive the heads of the three opponents.</p><br/><p>The Chinese audience at the venue screamed with excitement and clapped desperately, not noticing that their palms were swollen.</p><br/><p>It wasn’t until now that they understood that Ling Xuefeng’s escape route was in fact Li Cangyu’s trap. Ling Xuefeng’s sacrifice allowed Li Cangyu to take three kills!</p><br/><p>From the start to present, the Chinese team won six heads while the US team only got three heads.</p><br/><p>Li Cangyu looked at the time and ordered, “Return to the red resurrection point!”</p><br/><p>Li Cangyu’s state was actually quite good but Bai Xuan, Qin Mo and Xiao Han couldn’t support the next wave of group combat.</p><br/><p>The two teenagers had just killed Thomas and now the three members of the US team. Their skills were on cooldown and they were almost out of blue. Their combat power was less than 10%.</p><br/><p>Bai Xuan’s blue consumption was also serious and most of his group healing skills were on cooldown.</p><br/><p>On the US side, Jack and Edmund were full of blood and their blue was over 80%. They would soon come over to support. In addition, the blue resurrection point was close to here. The three US players who just died would soon resurrect and as long as all five of them met up, the Chinese team was likely to be defeated!</p><br/><p>***</p><br/><p>Li Cangyu’s expectations were correct. Jack and Edmund came over very quickly and arrived at the labyrinth in the blink of an eye. Li Cangyu’s reaction speed was fast and he used Frost Heart to freeze them, making it convenient for the two teenagers to run.</p><br/><p>Then Xiao Han said, “You run first!”</p><br/><p>He entered stealth and moved behind Jack, hitting him with Pain Blade the moment Jack’s freezing effect ended.</p><br/><p>This was the only skill that could be released with his remaining blue and he won Li Cangyu and Qin Mo three seconds.</p><br/><p>Li Cangyu’s mood was a bit complicated. He didn’t expect for the young Xiao Han to make such a calm decision at a crucial moment. As a result, Jack wasn’t about to catch up with Li Cangyu and Qin Mo.</p><br/><p>Bai Xuan sensed Xiao Han’s intentions and used his remaining blue to stack Healing Language on Xiao Han.</p><br/><p>The two people took the initiative to stay as cannon fodder. Li Cangyu immediately took Qin Mo and retreated.</p><br/><p>Bai Xuan didn’t have much blood left but he was a powerful milk dad while Xiao Han’s attacks could suck back blood. The two of them cooperated to delay Jack and Edmund for a full 10 seconds.</p><br/><p>By the time Xiao Han and Bai Xuan were killed, Qin Mo and Li Cangyu had disappeared.</p><br/><p>Jack was annoyed. “I thought we could kill four in this wave!”</p><br/><p>Edmund was calm. “They sacrificed themselves. The healer and assassin stayed as cannon fodder to protect the other two summoners. The Chinese team’s three summoners will soon meet.”</p><br/><p>Jack saw the 6:5 heads ratio and was grumpy. “Let’s quickly met up to kill them!”</p><br/><p>Noah also had this idea.</p><br/><p>The US team only had to win one game. They could wipe out the Chinese team in one wave to win the game as well as the world championship.</p><br/><p>Nevertheless, his intuition told him the next wave of group combat wouldn’t be that simple.</p><br/><p>***</p><br/><p>Li Cangyu and Qin Mo rushed to the red resurrection point at the fastest speed. They had just left the labyrinth when they received news that Bai Xuan and Xiao Han were killed. Li Cangyu placed the [=] symbol on the team channel.</p><br/><p>This meant for everyone to wait at the red resurrection point.</p><br/><p>Ling Xuefeng was already resurrected and Bai Xuan and Xiao Han would resurrect after 10 seconds.</p><br/><p>Li Cangyu and Qin Mo quickly passed through the dense forest to the red resurrection point. The other three were already waiting for them. The two people stood at the resurrection point to refill their blood and blue while also refreshing the cooldown of their skills.</p><br/><p>The five Chinese players were full of blood. Similarly, Jack and Edmund would definitely go to the resurrection point to recover. The next wave of team combat would be a 5v5 frontal battle.</p><br/><p>“Go to the entrance of the forest!” Li Cangyu ordered and they rushed to the forest entrance, while the five Americans also came this way.</p><br/><p>Half a minute later, the two sides met at the entrance of the forest.</p><br/><p>Qin Mo, Xiao Han, Jack and Edmund were all invisible. Edmund found Bai Xuan and tried to use a control skill on him. However, Bai Xuan reflexively read the priest’s ultimate move, Desperate Prayer!</p><br/><p>This returned a lot of blood to all teammates in range while also making them immune to any control for 5 seconds.</p><br/><p>At this time, everyone was full of blood and Bai Xuan’s ultimate goal was the ‘free of control for 5 seconds’ effect attached to the skill.</p><br/><p>Edmund’s Pain Blade and Jack’s spider were neutralized…</p><br/><p>Bai Xuan’s pre-judgment at the crucial moment just abolished the control skills of the two blood kin opponents.</p><br/><p>What could be done in five seconds?</p><br/><p>Ling Xuefeng called his skeleton infantry, the banshee, the black crows and the demon god. Li Cangyu summoned his water spirit, fire spirit, wind spirit and thunder spirit. Qin Mo also summoned his blood spider, blood snake, death knight and vampire bats at a very fast speed.</p><br/><p>Then the three people pressed the R key on the keyboard almost in sync.</p><br/><p>—Cataclysm!</p><br/><p>—Demon God’s Rage!</p><br/><p>—Corpse Mountain Blood Sea!</p><br/><p>The elf summoner’s four pets died, the demon summoner’s four pets died and the blood kin summoner’s four pets also died!</p><br/><p>The summoner’s ‘exploding pets’ ultimate move was generally difficult to open but with Bai Xuan’s help, Li Cangyu, Ling Xuefeng and Qin Mo actually released it within five seconds!</p><br/><p>The green elf, black demon and red blood kin skill effects mixed together and created a shock wave that was like a nuclear bomb exploding!</p><br/><p>The five players of the US team were instantly overwhelmed by the powerful shock wave!</p><br/><p>It was like their blood crashed as the number fell from 100% to 10%!</p><br/><p>This terrible damage was almost comparable to a biochemical weapon…</p><br/><p>Kou Hongyi and Yu Bing were stunned while the domestic audience and reporters from all over the world were frozen.</p><br/><p>Three summoners opening the ultimate big move at the same time, this was the first time it had been seen since the Miracle League started!</p><br/><p>Moments later, Kou Hongyi returned to his senses and trembled. “My god! Three summoners can do something like this, it is the first time I’ve seen it! This is really a biochemical weapon. The US team was directly beaten to 10% residual blood!”</p><br/><p>Yu Bing endured the urge to cry as she choked out, “This is a really rare picture! It takes five seconds to complete these operations and it is impossible to achieve if the hand speed and reaction speed can’t keep up. Moreover, there must be a strong understanding between the three people since the summoned pets can’t interfere with each other!”</p><br/><p>After a pause, Yu Bing took a deep breath and recovered her calm. She carefully analyzed, “The damage is very strong but it also puts the summoner into a very weak situation. For the next period of time, none of them can call any pets and the American team might complete the counter kill.”</p><br/><p>“However, we still have Xiao Han!” Kou Hongyi was excited. “Xiao Han is acting!”</p><br/><p>The five seconds free of control ended and the three summoners became the target of the US team. The five US players might be in residual blood but the three players of the Chinese team couldn’t use any skills. It was simply a state of being slaughtered!</p><br/><p>Bai Xuan’s big no-control move was gone and Noah decisively used Dark Fear on the Chinese team. Then he and his teammates started to crazily release group attacks.</p><br/><p>Still, it was as Kou Hongyi said. They still had Xiao Han!</p><br/><p>Xiao Han had been hiding behind the American team and wasn’t affected by the Dark Fear group control. At this time, he grasped the opportunity to show up and used Back Stab to kill the weak archer!</p><br/><p>He followed up by using Fatal Blow to kill the nearby white magician.</p><br/><p>The shocked Noah wanted to turn around and control him but Xiao Han used Chain Strangulation.</p><br/><p>The dagger in his hand was thrown forward and became a chain that accurately hit Noah and Jack in front of him.</p><br/><p>—Double kill!</p><br/><p>Xiao Han completed the harvest and killed four American players who had 10% residual blood!</p><br/><p>The Chinese team took the lead in getting 10 heads and won the third game in a thrilling manner!</p><br/><p>Many spectators shed tears of excitement.</p><br/><p>Even Li Cangyu’s eyes were hot. At the crucial match point, he withstood the pressure and gave some relief to the national team that lost the first two games.</p><br/><p>It was thanks to the excellent teammates beside him…</p><br/><p>Li Cangyu stood up with a smile and tightly hugged his teammates.</p><br/><p>This game all depended on their tacit understanding.</p><br/><p>If Bai Xuan’s move to free them from control had been slightly slow, if Qin Mo and Ling Xuefeng couldn’t keep up with the ultimate move or if Xiao Han’s harvesting skills were wrong, the Chinese team might’ve been the ones wiped out.</p><br/><p>However, they ended up winning.</p><br/><p>Li Cangyu believed in the people around him and they believed in him.</p><br/><p>They used an extraordinary tacit understanding to show a tacit that had never appeared since the start of the Miracle League, the three summoner’s explosive destructive style!</p><br/><p>It was believed that for a long time, the image of the three summoners simultaneously opening their ultimate moves and the assassin’s classic harvest would be widely spread among the Miracle fans around the world.</p><br/><p>Cataclysm, Demon God’s Rage and Corpse Mountain Blood Sea!</p><br/><p>The power of these three moves at the same time was enough to shock the entire Miracle League!</p><br/>\n</div>"}