{"title": "Chapter 364 - The Covenant of Time (4): Suddenly I Want to Kiss You", "id": 364, "volume": 4, "url": "http://boxnovel.org/god-level-summoner-chapter-364-the-covenant-of-time-4-suddenly-i-want-to-kiss-you", "volume_title": "Volume 4", "body": "<h1>Chapter 364 - The Covenant of Time (4): Suddenly I Want to Kiss You</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 364 – The Covenant of Time (4): Suddenly I Want to Kiss You</p><hr/><br/><p>The next morning at 8 o’clock, Cheng Wei was woken up by the alarm clock. He washed his face and came to the dining room where he found that steamed buns and soy milk had been placed on the table. Tan Shitian still remembered that he loved the buns from the store across the street and thoughtfully bought breakfast.</p><br/><p>Cheng Wei ate the breakfast bought by Tan Shitian and his mood was particularly pleasant. He ate all of it in one breath and wiped his mouth with satisfaction before bringing out his suitcase. The moment Tan Shitian came in, Cheng Wei greeted him before asked, “Is it necessary to go to the airport in advance? What if there is a traffic jam on the road?</p><br/><p>Tan Shitian nodded. “Yes, it’s time to go. Let me get my luggage.”</p><br/><p>“Is there a taxi?”</p><br/><p>Tan Shitian smiled. “I already called for a car.”</p><br/><p>Cheng Wei scratched his head and looked over at his luggage. He didn’t know what to say.</p><br/><p>On the way, Cheng Wei didn’t have to worry about anything. Once they landed at the airport, Tan Shitian had called a car in advance. At the hotel, Tan Shitian had also booked the room in advance. He even checked the route for the place they were having dinner. Cheng Wei just needed to follow Tan Shitian and he would eat and live well without doing anything.</p><br/><p>To Cheng Wei’s surprise, they were eating at a famous restaurant in Suzhou when they met a group of acquaintances.</p><br/><p>“Hey Captain Tan!” The person who actively rushed to say hello was the vice-captain of the Red Fox team, Yang Muzi.</p><br/><p>“Captain Tan, Vice-Captain Cheng, are you here for a holiday?” The Red Fox captain, Liu Xiang also came over and she was followed by the members Meng Jie, Luo Shanshan and others. The Red Fox team had come out to play with their captain. The female players were dressed in casual clothes and mixed in with the crowd, not many people recognizing them.</p><br/><p>Once Tan Shitian saw his acquaintances, he smiled and stood up. “Captain Liu, what a coincidence.”</p><br/><p>Cheng Wei also smiled and waved at them. “Hello, is this a group trip?”</p><br/><p>Yang Muzi actively ran over and sat down. “There is a month’s holiday so we went out to eat and drink. It is such a coincidence that we also met the two of you! Do you mind sharing a table?”</p><br/><p>Tan Shitian replied politely, “Of course I don’t mind. This time, I’ll treat you.”</p><br/><p>The Red Fox and Time team had a good relationship and often met in private. In particular, Tan Shitian and Liu Xiang were players who debuted in the fourth season. They were very familiar with each other from their time as newcomers and they stayed in touch after they became captains of their teams. It was estimated that the players Tan Shitian had the best relationship with were Su Guangmo and Liu Xiang.</p><br/><p>Liu Xiang naturally sat to the right of Tan Shitian and asked in a worried manner, “Were you blocked by reporters at the airport?”</p><br/><p>Tan Shitian told her, “No, I ran quickly.”</p><br/><p>Liu Xiang smiled. “That’s good. Cat God and Captain Ling accepted the interview for the national team while we can sneak out and play.”</p><br/><p>The two people smiled at each other as Tan Shitian said, “Yes, I hate dealing with reporters. I have to answer the same question several times and feel that I look stupid when I smile at the camera.”</p><br/><p>Liu Xiang smiled. “Me too. The official words are too fake.”</p><br/><p>Both of them were captains and had more common topics to talk about. Cheng Wei normally didn’t care but now that he saw them smiling, he felt annoyed for some reason.</p><br/><p>The image of the handsome man and beautiful woman was too great.</p><br/><p>This restaurant had an extremely good environment and was arranged in the style of a Jiangnan garden. The restaurant was very quiet and Tan Shitian and Liu Xiang spoke in low voices, looking at each other from time to time. The handsome man and the gentle and beautiful woman looked like a couple completely in love.</p><br/><p>Moreover, the shape of their relationship was really a perfect match.</p><br/><p>Liu Xiang’s personality was strong and decisive but her appearance was that of a typical lady. She usually liked to wear simple and generous dressed. Her long hair fell to her waist and her smile was gentle. Her aesthetics were definitely at a goddess level for men and it was why Liu Xiang was the most popular female player in the domestic league.</p><br/><p>Tan Shitian and Liu Xiang together were simply eye-catching and looked like a pair of heavenly creations.</p><br/><p>Yang Muzi joked beside him and if it was an ordinary situation, Cheng Wei and Yang Muzi would be a team laughing together. However, today he was in a bad mood and Cheng Wei didn’t listen to her words. The image of Tan Shitian and Liu Xiang speaking quietly together made him confused.</p><br/><p>It wasn’t until a special dish came to the table and Tan Shitian reminded him to eat that Cheng Wei’s soul returned.</p><br/><p>“This is the special squirrel mandarin fish of Suzhou. It is sour and sweet and the taste if very fresh.” Tan Shitian placed a piece in Cheng Wei’s bowl and smiled. “Taste it. If it is delicious then recommend it to your idol.”</p><br/><p>Liu Xiang laughed. “Speaking of Cat God, if he was here today then we wouldn’t even get a share of the fish.”</p><br/><p>The Red Fox sisters laughed together and Cheng Wei smiled as he placed the piece of fish into his mouth. The fish was really delicious but he completely lost his appetite at the image of Tan Shitian and Liu Xiang smiling together.</p><br/><p>***</p><br/><p>This meal was naturally bought by Tan Shitian. By the time dinner ended, it was already 10:30 in the evening. Tan Shitian was worried that the female players of Red Fox wouldn’t be safe on the road so late and personally called a car to send them back. Then he returned to the hotel.</p><br/><p>On the way back, Cheng Wei didn’t talk. His head hung down and there was no expression on his face. Tan Shitian wondered, “Are you tired?”</p><br/><p>“Yes.” Cheng Wei replied in a perfunctory manner. In fact, he wasn’t tired but was feeling uncomfortable in his heart. It was like a heavy stone was pressing on it, making him almost breathless.</p><br/><p>Tan Shitian say that he wasn’t in the mood and stopped talking to Cheng Wei. He simply smiled and said, “If you’re tired, go back and sleep early.”</p><br/><p>Back at the hotel, Cheng Wei went to the bathroom and was deep in thought as he took a bath.</p><br/><p>A man like Tan Shitian should be the perfect husband in girl’s hearts? His straight figure and handsome appearance had fascinated a large number of fans. In addition, he was young, promising, could keep calm in any situation, had a good temple, was gentle and considerate. If Tan Shitian publicly announced that he wanted to marry, the girls lining up to marry him would probably go all the way around Suzhou.</p><br/><p>What did of girl did he like? Which girl would be lucky enough to become his wife?</p><br/><p>Would it be Liu Xiang?</p><br/><p>Liu Xiang was really beautiful and had a good personality. She didn’t have a princess disease like some other beautiful girls nor was she pretentious. As the captain of Red Fox, she was very generous when facing reporters and calm during a game. It was said that her cooking skill was also great and anyone would be blessed to marry her.</p><br/><p>Perhaps one day in the future, Tan Shitian would hug and kiss a girl, placing a ring on her finger as he received blessings from friends and relatives. He would gently prepare breakfast for his wife, carefully arrange trips with his wife then have a cute little baby…</p><br/><p>Cheng Wei thought about it and became more and more irritated. He found that he couldn’t accept that ‘Tan Shitian will get married.’</p><br/><p>In these four years, he had been with Tan Shitian. Regardless of whether they were arguing or cooperating in the game, he had become accustomed to Tan Shitian and was used to seeing Tan Shitian. When he was angry, he could quarrel with Tan Shitian and when he was happy, he could share it with Tan Shitian.</p><br/><p>If Tan Shitian was to get married in the future, Cheng Wei could no longer get along with Tan Shitian as he did now. There would be no one to wake up early in the morning and buy breakfast for him. No one would comfort him when he was sad or tolerate all his problems like Tan Shitian…</p><br/><p>***</p><br/><p>Cheng Wei stayed in the bathroom for a long time and his eyes were red when he came out.</p><br/><p>Tan Shitian was leaning on his bed and texting. He saw that Cheng Wei was walking around with his head hung low and seemed to be in a bad mood. Tan Shitian couldn’t help worrying. “What’s wrong? Are you in a bad mood?”</p><br/><p>“No, it’s nothing.” Cheng Wei didn’t dare let the other person discover his thoughts. He took a deep breath and adjusted his emotions. Then he turned his back to Tan Shitian and lay down, telling him, “Go and wash up.”</p><br/><p>“Yes, then you sleep early.” Tan Shitian went to took a bath while Cheng Wei tried to sleep. He heard the sounds coming from the bathroom and couldn’t sleep. After a while, Tan Shitian came out and found a big bulge on the bed. It was obvious that Cheng Wei had buried himself inside.</p><br/><p>Tan Shitian was worried that he would suffocate himself and walked over, gently opening the quilt. As a result, Tan Shitian saw a scene that shocked him. Cheng Wei’s eyes were red and wet, like he was going to cry at any second.</p><br/><p>Tan Shitian’s heart seemed to be grabbed by a pair of hands. He immediately sat on the bed and gently touched Cheng Wei’s wet hair, asking softly, “What’s wrong? Who bullied you?”</p><br/><p>Cheng Wei bit his lip and didn’t speak. He twisted his head and refused to look at Tan Shitian.</p><br/><p>Tan Shitian gently pinched his chin and forced his head back. “What happened?”</p><br/><p>Cheng Wei was silent for a moment before directly asking, “Do you like Liu Xiang?”</p><br/><p>Tan Shitian was stunned. “How can you ask this?”</p><br/><p>“The two of you have known each other for many years and debuted together. Everyone says that your best relationship in private is with Liu Xiang. You are also a good match when standing together.”</p><br/><p>Tan Shitian smiled. “I’m only friends with her.”</p><br/><p>Cheng Wei didn’t believe it. “How is that possible? She is so beautiful. Your heart isn’t moved at all?”</p><br/><p>Tan Shitian reluctantly replied, “There are many beautiful girls. Liu Xiang isn’t the type I like.”</p><br/><p>Cheng Wei was a bit curious. “What type do you like?”</p><br/><p>Tan Shitian smiled and leaned closer. “Your bad mood today… is it because you are jealous?”</p><br/><p>Cheng Wei was stunned before reacting. His cheeks turned red and he immediately denied it. “Nonsense! How can I be jealous? You and I aren’t…”</p><br/><p>Maybe it was because he was nervous but his tongue was knotted and he couldn’t complete a sentence.</p><br/><p>Tan Shitian saw his flustered expression and couldn’t help touching Cheng Wei’s red face. “I promised you something before leaving Beijing but now… I might have to break my promise.”</p><br/><p>The distance between the two of them was getting closer. Cheng Wei asked nervously, “W-What?”</p><br/><p>Tan Shitian smiled and lowered his voice. “I promised not to kiss you but now I suddenly want to kiss you.”</p><br/><p>Cheng Wei stared and didn’t know how to react as his lips were gently covered by Tan Shitian.</p><br/>\n</div>"}