{"title": "Chapter 362 - The Covenant of Time (2): Tan Cheng’s Memories", "id": 362, "volume": 4, "url": "http://boxnovel.org/god-level-summoner-chapter-362-the-covenant-of-time-2-tan-cheng%E2%80%99s-memories", "volume_title": "Volume 4", "body": "<h1>Chapter 362 - The Covenant of Time (2): Tan Cheng’s Memories</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 362 – The Covenant of Time (2): Tan Cheng’s Memories</p><hr/><br/><p>The end of the third season was undoubtedly the most turbulent period for the Miracle League. The FTD team disbanded, Li Cangyu led his team to transfer games, Xie Shurong suddenly left the Flying Feathers team and his whereabouts were unknown, Ghost Spirits’ captain Mo Quan retired and Lou Wushuang took over as captain, Time’s vice-captain retired and the newcomer Cheng Wei took over as captain…</p><br/><p>Every team went through personnel changes and the official website of the professional league was almost constantly refreshed by fans. However, a person who left would still go. Cheng Wei was very clear that Li Cangyu wouldn’t change his mind because of his fans. Since Li Cangyu had made up his mind to leave Miracle, there was no room for persuasion.</p><br/><p>Nevertheless, Cheng Wei didn’t give up.</p><br/><p>He sent a message to Cat God every day until he finally received a reply three days later. [Don’t worry about me. I’m currently in the United States and after coming home, I will take my teammates to play another game. I heard that you took over as vice-captain. Continue to refuel and I’ll wait for you to win the MVP award.”</p><br/><p>Cheng Wei saw the calm reply and was speechless as his eyes turned red.</p><br/><p>These days, he had been watching the forum posts and knew how difficult it was for Li Cangyu’s team. He was angry that Li Cangyu didn’t tell him anything but on the other hand, he couldn’t help Li Cangyu with his ability. He didn’t understand anything or take care of himself. How could he help Li Cangyu?</p><br/><p>A person who cared about was in trouble but he couldn’t do anything. The deep sense of powerlessness made Cheng Wei frustrated.</p><br/><p>Cheng Wei made a long-distance call and choked back tears. “Cat God, after you return home, why don’t you consider coming to the Time team? Captain Xu said he will retire next year. Once he is gone, you can become captain!”</p><br/><p>Li Cangyu smiled at the phone and replied, “I won’t go to the Time team.” He could feel Cheng Wei’s concern for him but Cheng Wei hadn’t grown up and his understanding of things wasn’t comprehensive. He naively thought that Li Cangyu could switch to being captain of Time and didn’t understand why Li Cangyu was leaving.</p><br/><p>Of course, Li Cangyu didn’t want to explain these complicated things to Cheng Wei. He wanted to see this young boy grow up happily under the protection of his teammates and seniors.</p><br/><p>“Why don’t you want to come to Time?” Cheng Wei refused to give up and anxiously tried to persuade the other person. “If you don’t like Time, you can also go to Flying Feathers or Wind Colour!”</p><br/><p>“This is something you don’t need to worry about.” Li Cangyu softly interrupted him. “I have made the arrangements so don’t worry. Even if I don’t play Miracle, we can stay in touch… I have something to do here and have to hang up.”</p><br/><p>“Oh… take care.”</p><br/><p>After the call, Cheng Wei was still depressed and upset. His ability was too limited and even if he was as anxious as an ant in a hot pot, he couldn’t think of a way to help the other person.</p><br/><p>***</p><br/><p>That night, Cheng Wei couldn’t sleep and woke up the next morning with dark circles.</p><br/><p>He stumbled and pushed open the bathroom door, only to see a tall person shaving in front of the mirror. Cheng Wei froze for a moment before remembering he had a new roommate, the newcomer Tan Shitian.</p><br/><p>He lowered his head around Tan Shitian and walked to the side to squeeze out toothpaste. As result, he became dizzy and squeezed toothpaste onto his hand. Tan Shitian glanced at him and took the initiative to help him with the toothpaste. He handed the toothbrush to Cheng Wei and asked softly, “You didn’t sleep well last night?”</p><br/><p>Cheng Wei whispered an agreement and took the toothbrush to brush his teeth.</p><br/><p>Tan Shitian stood next to him and watched. Cheng Wei’s brushing action was child-like. As he cleaned each tooth, he was obviously worried about something. His dull eyes stared at the mirror like he was sleepwalking.</p><br/><p>Did he have insomnia because he was reluctant about his idol leaving?</p><br/><p>Tan Shitian didn’t expect the fierce competition of the professional league to have such simply feelings. Only people like Cheng Wei would like a senior player so seriously. This type of liking didn’t have any purpose and made people feel moved.</p><br/><p>Before seeing Cheng Wei, Tan Shitian always heard that the Time team had a very talented teenager. He had been radiant from the beginning of his debut. Tan Shitian thought that Cheng Wei was a proud and capricious young player.</p><br/><p>In this era, there were many children accustomed to being unruly at him. What’s more, Cheng Wei was a talented player and the darling of the club. It was normal to be a bit arrogant.</p><br/><p>Unexpected, Cheng Wei was such a simple person, simple enough to be a bit stupid.</p><br/><p>However, the idiot standing in front of the mirror and brushing his teeth in a daze made Tan Shitian’s heart soften. They might be the same age but this person was a whole head shorter than Tan Shitian and was still so simple and pure, like clean white paper. His character would definitely suffer a big loss in the league where dragons were mixed with fish.</p><br/><p>At this moment, Cheng Wei was busy thinking and his right hand slipped. He suddenly poked his chin with his toothbrush and his chin was covered in white foam. Tan Shitian wanted to laugh but he forcibly resisted and helped bring over a towel. Cheng Wei accepted it and wiped himself up. Unfortunately, it wasn’t clean and there were still many traces of foam left at the corner of his mouth. He looked especially funny.</p><br/><p>Tan Shitian smiled and reached out, using his thumb to help wipe the foam at the corner of his mouth.</p><br/><p>The skin that his fingers touched was warm and soft, just like touching a little animal.</p><br/><p>Cheng Wei’s head was a mess and he didn’t notice the movement. He just felt the warmth of his lips and looked up at Tan Shitian with a puzzled expression. Then he lowered his head and used cold water to wash his face. After a while, he found that Tan Shitian was still standing next to him. Cheng Wei couldn’t help looking over and asking, “Why are you still standing here? Do you need the toilet?”</p><br/><p>Tan Shitian discovered that he was standing in the same place and watching Cheng Wei brush his teeth and wash his face…</p><br/><p>Realizing that something was wrong, Tan Shitian touched his nose and turned away.</p><br/><p>***</p><br/><p>Cheng Wei finished washing his face and found breakfast already prepared on the table. Tan Shitian smiled at him and explained, “I heard the captain say that you like to eat the dumplings from the store across the street. I was going to buy breakfast anyway and bought it for you.”</p><br/><p>Cheng Wei’s spirit lifted slightly after seeing the savoury buns and he sat down. “Thank you!” Then he smiled, picked up a bun and stuffed it into his mouth.</p><br/><p>Cheng Wei had been very depressed these days and Tan Shitian rarely saw a smile on his face.</p><br/><p>He had a chubby face and when he smiled, there were two dimples. The soft hair that curled over his ears was particularly cute. Was this what a 16 year old boy should look like?</p><br/><p>This was unlike Tan Shitian. From an early age, he had been trained by his parents to be independent. He started cooking at seven years old and by the age of 10, he could go shopping alone. This made him develop a personality that was calm and unsettled.</p><br/><p>After seeing Cheng Wei burying himself in the buns with dark eyes, Tan Shitian couldn’t help comforting him. “You don’t have to worry too much. Cat God definitely has his own ideas and at his level, he won’t suffer.”</p><br/><p>Cheng Wei’s mouth was stuffed with buns and he couldn’t speak. He just nodded in agreement with the second part of Tan Shitian’s words.</p><br/><p>They finished eating breakfast and headed to the training room. Cheng Wei only saw Captain Xu and several new recruits. Xu Luo was clearly very surprised by the sight of Cheng Wei. He came over and asked, “Didn’t you go home?”</p><br/><p>Cheng Wei replied, “I have nothing to do when going back. I want to stay in the team and see if I can help.”</p><br/><p>Xu Luo smiled and patted Cheng Wei’s shoulder. “This is the awareness of a vice-captain!”</p><br/><p>Cheng Wei scratched his head and looked serious. “What does a vice-captain do? Captain Xu, direct me to do some tasks.”</p><br/><p>Xu Luo thought carefully. “Well, Tan Shitian is a newcomer being trained by the team. Since you live in the same dormitory and usually have to communicate, I will leave the task of training him to you. Play with him every day and let him adapt to the rhythm of the game as soon as possible. I want to take him to play next season.”</p><br/><p>“Understood.” Since it was a task assigned by the captain, Cheng Wei didn’t shirk away from it. He turned around to Tan Shitian and opened an arena room with him.</p><br/><p>At this time, Tan Shitian had just entered the training camp while Cheng Wei already had a whole season of competition experience. The two people played three games and Cheng Wei won three consecutive victories. Tan Shitian didn’t have the power to fight back.</p><br/><p>In order to encourage the newcomer, Cheng Wei seriously typed on the public channel: [In a real game, the rhythm will be must faster than it is now. You have to adapt as soon as possible since Captain Xu said you will play next season.”</p><br/><p>Tan Shitian sent a smiling expression. [I know. Thank you, Vice-Captain Cheng.”</p><br/><p>***</p><br/><p>During the season’s holiday, Cheng Wei dutifully trained tan Shitian. He wasn’t like Li Cangyu who developed a separate training program based on the characteristics of the players. He only transferred what he learnt to Tan Shitian, forgetting that the tactics for a white magician would be different from an archer. In fact, his experience wasn’t necessarily useful for Tan Shitian. Fortunately, Tan Shitian was savvy and very talented so he didn’t take a crooked path because of Cheng Wei.</p><br/><p>The days passed quietly and Tan Shitian’s level leapt forward. By the time of the last training session before the Spring Festival, he was able to tie with Cheng Wei in the arena.</p><br/><p>Xu Luo was very satisfied with this. He smiled and patted Cheng Wei’s shoulder. “After seeing you and Xiao Tan, I really have confidence in the future of the Time team!”</p><br/><p>Cheng Wei didn’t understand Xu Luo’s meaning at the time. He didn’t expect that Xu Luo would actually hand over the captain’s position to Tan Shitian.</p><br/><p>***</p><br/><p>The Spring Festival ended and the fourth season started. Cheng Wei still missed Cat God but the increasingly heavy pressure of the matches meant he had to fully engross himself in playing.</p><br/><p>In the fourth season, many teams changed and there was a big shuffle in the rankings of the league. Thanks to Xie Shurong leaving and Yu Pingsheng changing to a berserker, the third season’s champion, Flying Feathers’ decline was particularly severe. Wind Colour was stable and Ling Xuefeng was still one of the hardest opponents. The Lou Zhang combination of the Ghost Spirits team weren’t as honed and weren’t too much of a threat…</p><br/><p>The most optimistic one turned out to be the Time team.</p><br/><p>Tan Shitian had received media attention since he debuted. HIs handsome appearance was eye-catching. Combined with his good temper and smile on his face when answering questions, his popularity rose quickly. He became the darling of the Time team fans, even more than Cheng Wei in the third season.</p><br/><p>More importantly, this handsome person wasn’t a vase. He played an archer very calmly and could often hit a key player’s chest from a long-distance. His accuracy and attack rate were terrible. His reaction speed might not be very fast but he was a newcomer who just debuted. It wasn’t easy for a newcomer to do this.</p><br/><p>It was due to Tan Shitian’s presence that the Time team had a very high winning percentage in the regular season and consistently topped the scoreboard.</p><br/><p>At the end of the first round of the fourth regular season, Xu Luo made the bold and amazing decision to hand over the captain’s position to Tan Shitian.</p><br/><p>Tan Shitian was only 17 years old. It was his debut yet Xu Luo made him the captain?</p><br/><p>Many people questioned this decision and Xu Luo’s explanation was, “I will definitely retire at the end of the fourth season. I selected the Time team’s next captain in advance to facilitate a smooth transition. I think Xiao Tan’s personal standards are obvious to everyone. The thing he lacks now is commanding experience. In the second half of the regular season, I will let him command the matches as captain.”</p><br/><p>No matter how surprised the reporters were or how fans opposed it, Xu Luo was very firm about his decision.</p><br/><p>Tan Shitian became the youngest captain of the Miracle Professional League.</p><br/><p>***</p><br/><p>Cheng Wei wasn’t convinced when he heard about it.</p><br/><p>In his view, Tan Shitian was a slightly gifted newcomer. Captain Xu handing him the position in the middle of the season was too exaggerated and impulsive.</p><br/><p>Besides, Tan Shitian debuted later than him. Wasn’t it more reasonable to let the vice-captain take over as captain? Why was a newcomer selected over Cheng Wei to be captain?</p><br/><p>Cheng Wei didn’t want to be the captain. He just thought that Tan Shitian wasn’t qualified for the position and Captain Xu’s decision was likely to ruin the Time team. Thus, he was full of resistance to Tan Shitian’s takeover as captain.</p><br/><p>Sure enough, after Tan Shitian took over as captain, he lost several consecutive matches and the Time team slipped from first place to fifth.</p><br/><p>Cheng Wei was distraught and as a straightforward person, he ran to Xu Luo and proposed, “Captain Xu, I think your decision is a bit impulsive! How long has it been since Tan Shitian debuted? Only half a year! He is too junior and inexperienced. He isn’t qualified enough to be the captain!”</p><br/><p>Xu Luo faced the helpless Cheng Wei and helplessly said, “But Xiao Wei, apart from him, what other player do you think can be the captain?”</p><br/><p>Cheng Wei thought about it and replied, “How about Ah Jun? He debuted even earlier than me!”</p><br/><p>Xu Luo smiled and shook his head. “He is a healer and has to take care of his teammates on the field. It is too difficult to command the game while adding blood. Ah Jun doesn’t have the ability to look at six roads and listen to every direction.”</p><br/><p>Cheng Wei suggested, “Then what about Brother Kai? He is an output!”</p><br/><p>Xu Luo shook his head again. “His personal level is excellent but he doesn’t have a good idea about the bigger picture. He is a good soldier who obeys orders but he isn’t a good general.”</p><br/><p>“There is still…” Cheng Wei wanted to continue but Xu Luo interrupted. “Xiao Wei, I can understand why you aren’t convinced about Tan Shitian being the captain. After all, you looked after him when he first came to the team. He debuted later than you and his qualifications are lighter than you. You consider him as a junior, right?”</p><br/><p>Cheng Wei frowned. “Isn’t this the case?”</p><br/><p>Xu Luo smiled and patted Cheng Wei’s shoulder. “You are misjudging Tan Shitian. Age and experience aren’t a problem. The reason I took a great risk by giving him the captain’s position is because I like his calm personality. In addition, he is the player with the strongest idea of the big picture and the most sensitive tactical thinking among the new batch of players. Believe me, you and Xiao Tan will be the pillars of the Time team. As long as the two of you work together, the Time team can stand up in the storm and won’t fall.”</p><br/><p>Cheng Wei, “…”</p><br/><p>Captain Xu was so certain that Cheng Wei had nothing more to say. He could only go back to his dormitory.</p><br/><p>***</p><br/><p>Cheng Wei didn’t know that before he knocked on the door, Tan Shitian was discussing the tactics for the next match with Xu Luo. After he came in, Tan Shitian actively avoided him and heard all his words.</p><br/><p>Tan Shitian knew Cheng Wei’s dissatisfaction and therefore became more motivated. He was eager to prove his strength in front of Cheng Wei and let Cheng Wei know that Tan Shitian was actually qualified to be the captain of the Time team.</p><br/><p>Perhaps this was the mentality of young people who were more aggressive with their peers. Cheng Wei’s doubts caused Tan Shitian’s pride to be hurt. From that day on, Tan Shitian was more diligent than before. He went every night to discuss things with Xu Luo and stayed up late in his dormitory. He often watched matches all night and studied the tactical characteristics of every team, not wasting any minute. He was staying in a room with Cheng Wei but because Tan Shitian went out early and came back late, the two of them were rarely able to meet.</p><br/><p>It was this type of effort that made Tan Shitian’s tactical ideas improve rapidly. In addition, there was Xu Luo’s guidance and analysis. After the first few failures, the Time team’s performance gradually improved.</p><br/><p>The thing that stunned everyone was that in the fourth season, Tan Shitian actually led the Time team to win the championship!</p><br/><p>***</p><br/><p>At the celebration party afterwards, Xu Luo officially announced his retirement. The Time team opened a brand new chapter with Tan Shitian as the captain and Cheng Wei as the vice-captain.</p><br/><p>Originally, it was a happy thing to be able to prove his strength in front of Cheng Wei who looked down on him. If it was an ordinary person, he would taunt and laugh at Cheng Wei.</p><br/><p>However, Tan Shitian saw Cheng Wei’s red eyes and depressed expression at Xu Luo’s departure and forgot all his previous unhappiness. Instead, his heart was soft and confused.</p><br/><p>As Xu Luo disappeared down the corridor, he couldn’t help extending his arm and placing it around Cheng Wei’s shoulder. He spoke softly like he was coaxing a little child. “Don’t be sad. Captain Xu is gone but there is still me. We will work together in the future, okay?”</p><br/><p>Cheng Wei didn’t speak and just looked up at Tan Shitian. It seemed he wasn’t very happy to be bound to this person.</p><br/><p>Tan Shitian smiled at his expression and gently touched his soft here. “There is no way, unless your leave Time or I pack up and leave… otherwise, we will be the new generation of leaders and will accompany the Time team until we retire.”</p><br/><p>At the time, they were still young and didn’t expect this simple agreement to accompany them for so many years.</p><br/><p>Tan Shitian didn’t think that one day, he would like this person around him and didn’t want to separate from him.</p><br/><p>Later, every time he remembered these past events, he thought it was very fortunate that he came to the Time team and became the captain.</p><br/><p>Over the years, he met many reliable teammates and experienced the glory of winning the championship, gaining an enviable popularity… but the rarest thing was that he met a person who he wanted to cherish all his life. This person was called Cheng Wei.</p><br/>\n</div>"}