{"title": "Chapter 372", "id": 372, "volume": 4, "url": "http://boxnovel.org/god-level-summoner-chapter-372", "volume_title": "Volume 4", "body": "<h1>Chapter 372</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 372 – Brothers’ Feelings (6): He was Becoming More and More Wrong</p><hr/><br/><p>Zhang Shaohui carried his luggage and walked along the street, unaware that his body was being drenched.</p><br/><p>Over the years, he had been living together with Lou Wushuang, As a child, they ate together and went to school together. After growing up, they joined the same team. Zhang Shaohui used to think he was very lucky to have such a brother. He never realized it until they were separated but without Lou Wushuang, it felt like his heart had been dug up. The bottom of his heart was empty and the strange vacancy couldn’t be filled.</p><br/><p>Zhang Shaohui clenched his fists and walked quickly to an intersection before calling down a taxi. The driver asked where he wanted to go and he hesitated for a moment before telling the other person the address of the team’s club.</p><br/><p>He didn’t have the face to go back to Lou Wushuang’s place and meet his auntie. The Ghost Spirits team was the only place he could think of right now. Fortunately, it was the offseason and his teammates weren’t there.</p><br/><p>Zhang Shaohui came to the team dormitory and put down his luggage. He stared at the familiar bedroom next door and felt uncomfortable.</p><br/><p>In one month, the eighth season would start. Once Lou Wushuang returned to the team, they would still live in this dormitory. How should he face his brother?</p><br/><p>He was naturally reluctant to leave the team. After all, he was now at the peak age and could play for several more years. Playing the game was his favourite thing. He couldn’t reconcile giving him. If he couldn’t leave, how should he get along with Lou Wushuang in the future? Would Lou Wushuang feel sick at the sight of him? After all… no one could accept the person who raped them.</p><br/><p>Zhang Shaohui lowered his head in a frustrated manner. How did he get drunk and act worse than a beast? He really wanted to go back to that night and kill himself.</p><br/><p>Unfortunately, there was no use regretting now…</p><br/><p>He hadn’t been clever since he was a child and this problem was too serious. He didn’t know what to do and after a while, Zhang Shaohui grabbed his hair and decided to think about the solution in a few days.</p><br/><p>***</p><br/><p>For the next few days, Zhang Shaohui sat down all day. The thing that scared him most was that Lou Wushuang always appeared in his dreams. Lou Wushuang lay on the bed, covered in kiss marks. His lips were red and swollen and his eyes wet.</p><br/><p>Then Zhang Shaohui woke up from the dream and his body’s fierce reaction made him confused and embarrassed.</p><br/><p>He couldn’t believe that he had such thoughts about his brother.</p><br/><p>This time, the drunken mess inadvertently sparked a fire. It happened to encounter a large piece of dry wood hidden in his heart and ignited a raging fire that couldn’t be extinguished.</p><br/><p>He always dreamt of something that wasn’t suitable for children while the target was the brother he had respected from a young age. Zhang Shaohui simply wanted to die.</p><br/><p>He hadn’t come close to sorting out his emotions when he got a phone call this morning.</p><br/><p>“Hello, Vice-Captain Zhang, are you free tomorrow? Come to the team.” The manager’s voice came from over the phone. Zhang Shaohui sorted out his expression and solemnly replied, “I am currently at the team’s dormitory. Manager, why are you looking for me?”</p><br/><p>“That’s just right! I called your brother and told him we got a big brand endorsement this season. The other party asked for the captain and vice-captain to take photos together. Is that okay?”</p><br/><p>“Sure, no problem.” He naturally didn’t refuse the manager and immediately agreed.</p><br/><p>“Then I’ll see you at the club 9 o’clock tomorrow morning?”</p><br/><p>“Okay!”</p><br/><p>Zhang Shaohui became excited after hanging up the phone. He had left home for several days and Lou Wushuang never sent him a message. He didn’t dare contact the other person and this was the first time they had broken off contact for more than three days since they were young. Zhang Shaohui was in a difficult position and felt that something important was missing.</p><br/><p>However, he would be able to see Lou Wushuang tomorrow!</p><br/><p>He thought about seeing this person and his heartbeat couldn’t help accelerating.</p><br/><p>Throughout the day, Zhang Shaohui was in a game mood. He even opened a side account to play the game. He swept the field as a super god and won 10 games in a row. The player on his team was asked with surprised, “Did you have hormones injected?’</p><br/><p>Zhang Shaohui smiled and replied, “I’m happy today!”</p><br/><p>The teammate thought this person was terrible. He won 10 games just from being happy. If he was extremely happy, was it possible to hit the professional league in one go? Of course, this player only thought he met a master. He didn’t know it was the Ghost Spirits’ famous Zhang Shaohui.</p><br/><p>***</p><br/><p>The next morning, Zhang Shaohui got up early, carefully shaved his beard in the mirror, tidied himself up and picked out a new set of clothes from the closet.</p><br/><p>The light grey coat was bought for him by Lou Wushuang during the Spring Festival last year. The salesperson had praised him for looking particularly handsome when he tried it on. Once he paired it with a pair of slim pants, heads turned when he walked down the street.</p><br/><p>Zhang Shaohui had no concept of dressing. Most of his clothes were bought together with Lou Wushuang. Lou Wushuang had a high vision and good taste. Every time he picked out clothes, others would say it looked good. Zhang Shaohui didn’t understand but he was confident in Lou Wushuang’s selected clothes. Now that he looked, he was surprised to find that all the clothes in his closet were actually picked by his brother.</p><br/><p>Zhang Shaohui’s mood was somewhat complicated after realizing this. At the same time, there was a hint of sweetness from the bottom of his heart. Lou Wushuang was so good to him. The clothes that other people wore, Lou Wushuang was too lazy to even look at.</p><br/><p>Zhang Shaohui was in a complicated mood until 9 o’clock when the team’s door opened and Lou Wushuang came in. He stopped in front of Zhang Shaohui and asked with a cold expression, “The manager hasn’t arrived yet?”</p><br/><p>“Yes, he is probably caught in a traffic jam.” Zhang Shaohui saw the person he had thought about for a few days and his tongue was a bit tangled. Lou Wushuang was wearing a slim black coat and looked very thin. The black brought out his white skin and the eyes behind the glasses were cold.</p><br/><p>However, even if he was cold, Zhang Shaohui couldn’t help thinking of Lou Wushuang’s body covered in hickeys that morning. If he hadn’t seen it with his own eyes, Zhang Shaohui wouldn’t believe that the sexy and seductive Lou Wushuang and the Lou Wushuang in front of him were the same person.</p><br/><p>The two of them looked at each other and were a bit embarrassed for a moment.</p><br/><p>Zhang Shaohui removed his gaze and scratched his head. He whispered, “Are you, are you feeling better?”</p><br/><p>“Yes.” Lou Wushuang didn’t want to say any more and bypassed the today. “Did the manager tell you? Today is mainly about taking a few publicity shots. If the photos don’t look good then we can take a few more shots later.”</p><br/><p>“No, you look good and the photos will turn out great.” Zhang Shaohui subconsciously retorted before realizing that his words weren’t appropriate. He immediately stopped and stared at the other person awkwardly.</p><br/><p>Lou Wushuang didn’t seem to mind and turned to pour a glass of water. Zhang Shaohui stared at his thin back and suddenly felt pain shoot through his heart. He whispered, “Brother, we… can we still be the same as before?”</p><br/><p>Lou Wushuang stiffened and he looked back coldly. “The same? Do you want to continue being brothers?”</p><br/><p>Zhang Shaohui sadly hung his head. “Sorry Brother, I have been feeling very guilty these days. I don’t know how to punish myself so that you feel better. I…”</p><br/><p>“Enough.” Lou Wushuang interrupted him. “This thing shouldn’t be mentioned again. We will just be teammates in the future.”</p><br/><p>“Brother…”</p><br/><p>“Don’t call me brother.” Lou Wushuang pushed up his glasses and spoke in a stern tone. “You and I have slept together yet you still want to continue being brothers. Zhang Shaohui, are you that naive?”</p><br/><p>“…” Zhang Shaohui was dumbfounded by the words.</p><br/><p>When he was a child and did something wrong, Lou Wushuang would occasionally scold him before hugging him and sprinkling some praise. However, today Lou Wushuangw as particularly harsh. He directly called Zhang Shaohui by his name and his expression showed that Lou Wushuang was truly angry.</p><br/><p>The strange feeling of pulling away made Zhang Shaohui particularly uncomfortable.</p><br/><p>He knew he wasn’t a child and couldn’t apologize to his brother as he used to. This was a matter of principles. As Lou Wushuang said, they had slept together. How could they act as brothers after this incident?</p><br/><p>As long as a person had no problem with his mind, they couldn’t easily accept an apology. Lou Wushuang was completely breaking away from Zhang Shaohui after so many years of affection, what was Zhang Shaohui still asking for?</p><br/><p>At the thought of this person getting further away from him, Zhang Shaohui became so uncomfortable that he could hardly breathe.</p><br/><p>“Sorry, the traffic jam was serious. You’ve both arrived!” A voice from the door broke the awkward situation. Lou Wushuang immediately turned around and came forward. “Manager, I just arrived. Are we going on?”</p><br/><p>“Yes, the car is outside and is ready to go.” Manager Lin smiled. “I didn’t want to disturb you brothers on the holidays but the sponsors especially like the both of you. They also promised to sponsor our team for a long time. This is actually very good for the development of the Ghost Spirits team. In any case, it is only one day and you should help. Then the bonus of the product endorsement will be indispensable to everyone!”</p><br/><p>“Okay.” Lou Wushuang replied lightly and got on the car with the manager.</p><br/><p>Manager Lin got on and found that Zhang Shaohui was still standing stupidly in a daze. He called out in a confused manner, “Zhang Shaohui!”</p><br/><p>Zhang Shaohui’s spirit returned and he headed to the car.</p><br/><p>***</p><br/><p>This time, the Ghost Spirits won a well-known electronic products endorsement. The company had a series of well-received product lines, including gaming computers, mechanical keyboards, mice, headphones etc. The first batch of photos was mainly to promote the high-end mechanical keyboards newly listed. There were several sets of plans and the brothers would shoot them one by one.</p><br/><p>After changing clothes, the two of them entered the studio for the photo shoot.</p><br/><p>Lou Wushuang’s face was very cold and he didn’t smile no matter how the photographer teased him. Finally, the plan was useless and the photographer had to take a silhouette instead of his face.</p><br/><p>As a result, it was hard to find a photo with Lou Wushuang alone. Once it was Zhang Shaohui’s turn, he was still in a dazed state and his eyes completely wandered. Several photos were taken that had dull eyes…</p><br/><p>The photographer hesitated for a long time before picking out a few for Zhang Lou to see, stating, “The two of you are only taking a few photos. Don’t be nervous. Captain Lou, sit at the computer and tap on the keyboard. Vice-Captain Zhang, stay behind your brother and keep your eyes on the computer. We want the feeling of the two of you training in the team.”</p><br/><p>Lou Wushuang saw with a blank face in front of the computer and placed his hands on the keyboard. Zhang Shaohui stood hesitantly behind him and didn’t dare to touch him. The photographer urged, “Vice-Captain Zhang, place your right hand naturally on his shoulder, showing the intimacy between teammates.”</p><br/><p>“Oh.” Zhang Shaohui scratched his head and carefully extended his hand to Lou Wushuang’s shoulder. As a result, Lou Wushuang suddenly avoided it like he got an electric shock, his body stiffening. Zhang Shaohui immediately took back his hand.</p><br/><p>“…” The photographer had dark lines on his face. “These two handsome men, this is a publicity photo, not a wedding photo. What are you so nervous about?”</p><br/><p>Zhang Shaohui was embarrassed and apologized. “I’m sorry! We rarely take such photos. Can I make a suggestion? Can you reduce the physical movements between us? Uh.. it feels weird.”</p><br/><p>The photographer was forced to change it so there wasn’t close contact. Zhang Shaohui finally felt relieved.</p><br/><p>As a result, he just let go of his worries when a beautiful woman entered. The girl in charge of the advertisement planning walked into the studio and smiled. “The effect of a beautiful woman next to Captain Lou might be good. I called Ah Ling over to take a few shots to test it out.”</p><br/><p>The photographer nodded in agreement. “Let’s take a few shots to see.”</p><br/><p>Zhang Shaohui had to go to the side. The model walked to Lou Wushuang’s side and skillfully followed the photographer’s instructions. Zhang Shaohui watched and became more and more irritable. He wanted to slap this woman’s hand from his brother.</p><br/><p>The female model seemed to notice Zhang Shaohui’s gaze and smiled at him innocently. Zhang Shaohui was stunned and violently glared at the other person before removing his gaze.</p><br/><p>He was becoming more and more wrong. His heart had a strong sense of rejection when he saw the big beauty taking photos with his brother. He hated that the woman could get so close to Lou Wushuang and hated the woman’s gaze towards Lou Wushuang. He wanted to drive the woman away and pull Lou Wushuang tightly into his arms.</p><br/><p>He was thinking about this mess all day. Was he becoming a pervert?</p><br/>\n</div>"}