{"title": "Chapter 377 - Ghost Vice-Captain (2)", "id": 377, "volume": 4, "url": "http://boxnovel.org/god-level-summoner-chapter-377-ghost-vice-captain-2", "volume_title": "Volume 4", "body": "<h1>Chapter 377 - Ghost Vice-Captain (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 377 – Ghost Vice-Captain (2)</p><hr/><br/><p>The next morning, Song Yang summoned all the members of Flying Feathers to discuss the strategic deployment for the next match against Wind Colour. Su Guangmo and Yu Pingsheng came to the conference room to listen. Yu Pingsheng took notes according to his brother’s instructions and after the meeting, he actually had 10 pages of notes.</p><br/><p>Su Guangmo glanced at his neat handwriting and asked, “Do you understand what Master said?”</p><br/><p>His sudden closeness made Yu Pingsheng stiffen. He took a long time before finally choking out, “I don’t understand.”</p><br/><p>Su Guangmo blinked at him. “That means your rank is still too low.”</p><br/><p>Yu Pingsheng replied with a red face. “Yes.”</p><br/><p>Su Guangmo smiled. “Don’t worry and take it slowly. When I first started meeting with Master, I didn’t understand anything. Once you improve your level and watch more videos of the Professional League, you will understand the professional vocabulary used by Master.”</p><br/><p>Yu Pingsheng nodded like he gained enlightenment. “Yes.”</p><br/><p>Su Guangmo found this enigma who only said ‘yes’ quiet interesting. Yu Pingsheng might not speak much but his serious expression and clear eyes proved that he carefully recorded the words in his words.</p><br/><p>Such a sturdy younger brother made people feel good. Su Guangmo reached out and patted his shoulder. “Improvement of tactical awareness won’t take a day or two. If you don’t understand anything in the future, just ask me.”</p><br/><p>Yu Pingsheng immediately shrunk back. His frightened expression made Su Guangmo laugh. “Brother, how are you so shy?”</p><br/><p>Yu Pingsheng, “…”</p><br/><p>He didn’t know how to explain it to Su Guangmo. In fact, he wasn’t shy but instinctively rejected the closeness of others. When he was touched by others, he stiffened and this was related to his long-term autism. He had no friends since he was a child. No one had ever cared for him like Su Guangmo before, making it difficult for him to adapt.</p><br/><p>For Su Guangmo, caring for his younger apprentice brother was natural. After all, Song Yang personally accepted Yu Pingsheng as an apprentice, showing that his qualifications weren’t too bad. Flying Feathers had old and new players. In the future, the old players would retire and new players would take over. Su Guangmo needed a trustworthy partner to work together and improve the performance of the Flying Feathers team.</p><br/><p>The professional league was never a one-man game. Only the team working together would give victory and tacit teammates were crucial. Yu Pingsheng was a good seed and Su Guangmo wanted to train him to Su Guangmo’s partner. Naturally, he showed a bit more concern for Yu Pingsheng.</p><br/><p>***</p><br/><p>This period of time was the end of the first season and Song Yang was busy leading the team. His second apprentice Yu Pingsheng was handed over to Su Guangmo to train.</p><br/><p>Su Guangmo was a very conscientious brother. He first asked Yu Pingsheng to do some basic training according to the daily training timetable of Flying Feathers, learning about movement positions and skills release. Yu Pingsheng practiced according to his instructions. Before dinner every day, Su Guangmo would personally come to look at the training results.</p><br/><p>However, Yu Pingsheng was a bit distressed. Every time his brother came to him, Su Guangmo would always place a hand on his shoulder. This made Yu Pingsheng feel like he was sitting on a needle and he would often make mistakes.</p><br/><p>Su Guangmo directly pointed out, “Your hands can’t press down like this. Come over and I will teach you.”</p><br/><p>Then he took Yu Pingsheng’s hand and personally demonstrated the standard and most comfortable position to press the keys.</p><br/><p>“In the future, you will have to knock on the keyboard for a long time. If you place your wrists like this, it will be easy to become tired after a long time. E-sports players must take good care of their hands and develop better habits from the start.”</p><br/><p>Su Guangmo patiently explained while holding Yu Pingsheng’s hand and teaching him the most labour-saving method of tapping on the mechanical keyboard, how to press his five fingers and how to find the key he needed at the fastest speed…</p><br/><p>His hand was held by his brother and a strange burning sensation came from his fingers. Yu Pingsheng’s face was red and he wanted to pull back his hand. However, he was afraid his brother would be angry and sat in place, not daring to move.</p><br/><p>Su Guangmo finally finished teaching and patted his brother’s shoulder with a smile. “Practice well.”</p><br/><p>Once Su Guangmo left, Yu Pingsheng was relieved and his tense mood instantly relaxed.</p><br/><p>Looking back, he saw Su Guangmo seriously playing in the arena. The swordsman used to big moves and cut the opponent down to the ground.</p><br/><p>Yu Pingsheng saw the confident smile on Su Guangmo’s face and couldn’t help feeling admiration. This brother was very powerful and understood many things. Master’s decision to have Yu Pingsheng follow him was certainly right. As for the occasional physical contact, Su Guangmo obviously wasn’t being malicious. Yu Pingsheng suffered from communication problems and had to learn to slowly adapt.</p><br/><p>However, he had closed off his heart since he was a child and rejected the contact of outsiders. Was it that easy to change?</p><br/><p>***</p><br/><p>Perhaps it was an incident that made Yu Pingsheng really change.</p><br/><p>That night, Song Yang returned to Kunming with the Flying Feathers. The match had been won in a beautiful manner and Song Yang was very happy. He called the whole team out to eat.</p><br/><p>Yu Pingsheng was a newcomer and due to his introverted personality, he wasn’t familiar with the other players. Song Yang wanted to use this opportunity to introduce his apprentice to everyone.</p><br/><p>At the dinner, Song Yang had Yu Pingsheng stand up. “This is my new apprentice Yu Pingsheng. Xiao Yu, say hello to everyone.”</p><br/><p>Yu Pingsheng was most afraid of crowded occasions. In a crowd, it seemed like even the oxygen in the air became thinner and thinner, making him breathless and dizzy. Then his master asked him to stand up and introduce himself. Yu Pingsheng helplessly stood up but the moment he felt all the gazes, his throat seemed stuck and he couldn’t say a word.</p><br/><p>This feeling was too terrible. Yu Pingsheng gulped and sweated anxiously, his face becoming paler and paler.</p><br/><p>Everyone waited for a long time but the result was that Yu Pingsheng stood there with a white face, not saying a word. Even the good-tempered Song Yang couldn’t help being a bit angry. He frowned and opened his mouth. “Xiao Yu, I told you to introduce yourself. Didn’t you hear me?”</p><br/><p>Yu Pingsheng clenched his fists tightly as he suddenly recalled his childhood when the teacher forced him to play with other classmates. He wasn’t happy and the teacher asked his parents to come in for a talk. The little Yu Pingsheng hid behind his mother like a small animal that couldn’t find its direction in the forest.</p><br/><p>This type of fear lingered in his heart. The autism had improved after years of seeing a psychiatrist but he was still afraid to speak in a crowded environment.</p><br/><p>Song Yang pushed him in front of everyone and it felt like his clothes had been ripped off, exposing him to the sun. The curious eyes of the team members were a terrible torture for him.</p><br/><p>The people present didn’t understand his feelings at all.</p><br/><p>The moment that Yu Pingsheng was about to flee, his cold fingers were suddenly held by a pair of warm hands as Su Guangmo sitting next to him stood up. He gently placed an arm around Yu Pingsheng’s shoulder and smiled at everyone. “Ah, my brother’s personality is really shy, please forgive him! He is called Yu Pingsheng and he is currently playing the swordsman profession. He isn’t very talkative but he takes training seriously. He is a very talented newcomer, right Master?”</p><br/><p>Su Guangmo took the initiative to find a solution for both sides. Song Yang didn’t want to refute his apprentice and smiled. “Yes, I have two apprentices. One speaks a lot while the other doesn’t talk very often.”</p><br/><p>The group laughed and the awkward atmosphere was swept away.</p><br/><p>Su Guangmo sat down with Yu Pingsheng and Yu Pingsheng sent him a thankful glance. Su Guangmo smiled and patted his shoulder. “Don’t be afraid. You have me.”</p><br/><p>The simple words were like hot water splashing on the surface of frozen ice. There was a slight crack in Yu Pingsheng’s deep defenses.</p><br/><p>He had his older apprentice brother and didn’t have to be afraid of being isolated. Even if he didn’t say anything, his brother would say it for him.</p><br/><p>***</p><br/><p>Su Guangmo’s solution meant that Yu Pingsheng wasn’t embarrassed and gave face to Song Yang, but Song Yang’s displeasure didn’t decrease. After returning to the team, he called Su Guangmo to his office.</p><br/><p>“What is going on with Yu Pingsheng. I had him introduce himself yet he didn’t say a word? You’ve been with him for a while. If he always has such a personality, how can he cooperate with his teammates in the future?” Song Yang frowned. “Communication is essential when fighting as a team. If he refuses to speak later in the stadium, how will his teammates know his thoughts? How will they get along with him?”</p><br/><p>Song Yang’s anger wasn’t unreasonable. When he accepted this apprentice, Yu Pingsheng might be shy but he still talked to his master. Song Yang didn’t expect Yu Pingsheng’s personality problem to be so serious that he wasn’t even capable of a simple self-introduction. How would he be able to cooperate with his teammates?</p><br/><p>Song Yang thought for a while before saying, “He isn’t suitable for the Flying Feathers. I think I should send him back.”</p><br/><p>Su Guangmo knew that his master’s concerns were correct. A person who couldn’t communicate with his teammates was simply going to kill them!</p><br/><p>However, he thought of the pale teenager sitting alone in the corner and training seriously. He thought of the clear eyes and the way he hung his head while thinking for a long time and Su Guangmo felt it was unbearable.</p><br/><p>How sad would Yu Pingsheng be if he was driven away?</p><br/><p>No matter what, Su Guangmo had to find a way to keep him in Flying Feathers!</p><br/><p>Su Guangmo patted his chest and reassured the other person. “Master, don’t rush to make a decision. Give me one month. I will have a good talk with my younger brother and see what is going on.”</p><br/><p>***</p><br/><p>Su Guangmo returned to the dormitory and took the initiative to knock on Yu Pingsheng’s door. Yu Pingsheng’s eyes brightened when he saw his brother and he gratefully said, “Brother, thank you for helping me today.”</p><br/><p>Su Guangmo was softened by his eyes and couldn’t help smiling. “Why are you so polite with me? This is what I should do.”</p><br/><p>Yu Pingsheng looked embarrassed but his smile was very pure and his bright eyes were full of energy. He was obviously a very intelligent and serious person. How unfair would it be if he was eliminated just because he wasn’t good at communication?</p><br/><p>Su Guangmo’s expression became serious when he thought about this. He entered Yu Pingsheng’s bedroom and faced Yu Pingsheng, asking softly, “Brother, why don’t you like to talk to people? Isn’t it okay to tell me the reason? I promise that I am a tight-lipped person and won’t tell your secret!”</p><br/><p>Yu Pingsheng glanced away and Su Guangmo held his shoulder, making him stare at Su Guangmo. “Brother, we have known each other for a while and how have I treated you? Aren’t I worthy of your trust?”</p><br/><p>Yu Pingsheng confronted these eyes that were as deep as the sea, with a gentleness that seemed like it would accommodate everything…</p><br/><p>How did Su Guangmo treat him during this time? Yu Pingsheng wasn’t a stone and how could he not feel the care of his brother? Every morning, Su Guangmo would grab him breakfast. Sometimes Yu Pingsheng forgot to eat while training and Su Guangmo would take the initiative to bring dinner to the dormitory. In addition, Su Guangmo taught him many things he didn’t understand and answered his questions patiently. Su Guangmo was a tolerant and patient brother, leading Yu Pingsheng through this strange world of e-sports step by step.</p><br/><p>Yu Pingsheng was very grateful to Su Guangmo but should he tell his secret? Was Su Guangmo really someone he could trust?</p><br/><p>A long silence passed before Yu Pingsheng hung his head and whispered, “In fact, I… when I was a kid, I had autism. The doctor said I have… interpersonal, communication barriers.”</p><br/><p>The difficult to speak words shocked Su Guangmo.</p><br/><p>He thought Yu Pingsheng was just introverted but it turned out to be a communication disorder. This was a mental illness that couldn’t be ignored. Su Guangmo had heard that patients with communication disorders who couldn’t control their moods might commit suicide.</p><br/><p>Su Guangmo saw his brother’s pale face and suddenly felt very distressed.</p><br/><p>How could such a smart guy have a psychological problem? Whether it was natural factors or the influence of the environment he grew up with, Su Guangmo couldn’t watch Yu Pingsheng continue like this.</p><br/><p>He stretched out his arms and gave Yu Pingsheng a hug that was barely noticeable. Then he spoke in a gentle and tolerant tone, “Don’t be sad. Everyone in this world is different and you are just a bit more different from other people. If you don’t like to talk to others, try talking to me first. During our time training, haven’t you communicated with me? If you have any ideas in the future, you can tell me. If you don’t want to talk, type a message for me. Don’t suppress it in your heart, okay?”</p><br/><p>The hug was so light that Yu Pingsheng didn’t reject it. His mind gradually calmed down under Su Guangmo’s soft comfort and Yu Pingsheng nodded. “Okay.”</p><br/><p>Apart from his parents and psychiatrist, Su Guangmo was the first person to fully tolerate his shortcomings.</p><br/><p>A person who had been walking alone for many years finally met a friend he could speak to. There was a sudden influx to his heart, making Yu Pingsheng’s body gradually warm up.</p><br/><p>This brother was really a good person, Yu Pingsheng once again thought.</p><br/><p>Thus, Su Guangmo received the second ‘good person’ card issued by Yu Pingsheng.</p><br/>\n</div>"}