{"title": "Chapter 383 - Intern Boyfriend (2): Xie Shurong Meets the Parents", "id": 383, "volume": 4, "url": "http://boxnovel.org/god-level-summoner-chapter-383-intern-boyfriend-2-xie-shurong-meets-the-parents", "volume_title": "Volume 4", "body": "<h1>Chapter 383 - Intern Boyfriend (2): Xie Shurong Meets the Parents</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 383 – Intern Boyfriend (2): Xie Shurong Meets the Parents</p><hr/><br/><p>The next day at noon, Bai Xuan went to the hotel to pick up Xie Shurong. He called from the hotel lobby to have Xie Shurong come down. The next moment, a young man strode over while wearing the blue shirt picked by Bai Xuan along with beige slim trousers. The light-coloured clothes emphasized his body wand there was a bright smile on his face.</p><br/><p>Despite being familiar with this person, Bai Xuan couldn’t help staring. Xie Shurong was really handsome when dressed up. His facial features were handsome and three-dimensional and he looked young and open. This look was completely in line with the protagonist of an idol drama.</p><br/><p>Bai Xuan stood in place and watched Xie Shurong walking towards him. Somehow, his heartbeat suddenly accelerated. Before he could react, Xie Shurong hugged him and rubbed his chin against Bai Xuan’s head like a baby. “I missed you and dreamt of you last night.”</p><br/><p>“…” He was hugged in public and Bai Xuan’s cheeks turned hot. He gently pushed this person away and said, “Don’t make trouble. My mother made lunch so go to my house to eat.”</p><br/><p>“Good. Then come upstairs with me to get something.”</p><br/><p>“What is it?” The puzzled Bai Xuan followed only to hear, “I naturally have to buy gifts for my future parents!”</p><br/><p>The two people arrived at the room and opened the door. Bai Xuan couldn’t help frowning. Xie Shurong, this lazy worm, he got up in the morning and didn’t even arrange his quilt. His bed was a mess and there were several trousers piled up. It was obvious he had woken up early to match them with the shirt.</p><br/><p>Bai Xuan helplessly walked into the room. “Why is it so messy?”</p><br/><p>He moved to the bed and helped Xie Shurong clean it up. In the blink of an eye, the quilt was neatly laid and the trousers were stacked one by one in the suitcase. Within five minutes, the room had completely changed.</p><br/><p>Xie Shurong looked over, gentleness almost overflowing from his eyes. Bai Xuan turned his head and met Xie Shurong’s gentle gaze. His heart jumped and he looked around with embarrassment. “What are you looking at?”</p><br/><p>“You are particularly handsome.” Xie Shurong walked over with a smile and hugged Bai Xuan’s waist in a spoiled manner. “Looking at you cleaning up and helping me stack my clothes, I suddenly think that we’re like newlyweds…”</p><br/><p>“Who is married to you?” Bai Xuan was furious and regretted helping this lazy worm fold his clothes. Then Xie Shurong suddenly turned and trapped Bai Xuan between the wall and himself. He bent his head and kissed Bai Xuan, blocking all words of rebuttal.</p><br/><p>“Uhh…” Bai Xuan was caught off guard and tried to push this person away, only to have his hands grabbed.</p><br/><p>Don’t look at Xie Shurong’s usual grinning self who wasn’t serious. His strength was surprisingly and Bai Xuan was trapped by him. He was pressed to the wall and crushed by Xie Shurong’s pressure.</p><br/><p>The young man’s tongue passionately licked every corner of his mouth, leaving only warmth behind. Bai Xuan was breathless and his heart beat more fiercely.</p><br/><p>His mouth was licked by the other side’s tongue and the sensations passed along his sensitive peripheral nerves to his brain. Bai Xuan gradually gave up struggling and actively hugged Xie Shurong’s neck.</p><br/><p>“Yes… mmm…”</p><br/><p>The kiss was gentle and sweet. By the time Xie Shurong stopped, Bai Xuan’s entire face was red as his lips opened and he gasped.</p><br/><p>Xie Shurong smiled and licked the liquid on his lips before whispering in Bai Xuan’s ears. “How does it feel to be pressed against the wall by your boyfriend? This is how it is played in TV series. If you like it then we can try many poses later?”</p><br/><p>Bai Xuan glared at him. “Enough!”</p><br/><p>Xie Shurong was shameless as he looked down at Bai Xuan. “It isn’t enough. If we didn’t have to go to your parent’s house then I really want to eat you now.”</p><br/><p>Bai Xuan reacted to his meaning and blushed shyly. He slapped at Xie Shurong’s restless hands. “Can you show some shame? It is morning!”</p><br/><p>Xie Shurong smiled. “I don’t care. I only want you…”</p><br/><p>Bai Xuan was literally speechless because of this person. He simply ignored Xie Shurong and turned around. “Where are the things to be grabbed?”</p><br/><p>“Oh, here they are.” Xie Shurong got up and took gift boxes of various colours from the cabinet. Bai Xuan’s eyes widened with surprise. “Aren’t you being too exaggerated? Why did you buy so much?”</p><br/><p>“This is my first time entering your house and I must not be empty-handed? What if Mother and Father don’t like me? I should bribe them with presents first.” He spoke bluntly and didn’t look embarrassed at all.</p><br/><p>“Don’t call them Mother and Father…” Bai Xuan rubbed his temples as he felt himself getting a headache. He looked at the other person helplessly, “You’re younger than me and should call them Uncle and Auntie, understood?”</p><br/><p>“It is better to call them Young Uncle and Younger Auntie since it sounds younger!”</p><br/><p>“…Just do whatever.” Bai Xuan took half the boxes and went out. Xie Shurong immediately grabbed the other half. The two of them left the hotel and walked a few hundred metres to the community where Bai Xuan’s house was located.</p><br/><p>***</p><br/><p>Mother Bai was cooking in the kitchen. She asked while cutting vegetables, “What type of boyfriend do you think our son will bring back?”</p><br/><p>Father Bai was serious. “How can I guess? Our son likes him so don’t worry about it.”</p><br/><p>“Yes, our son has been obedient and sensible since he was a child. He must have his own thoughts on emotional matters. Although he can’t bring back a wife but as long as he is happy, I can feel relieved.” Mother Bai paused before adding, “I’m just afraid his boyfriend isn’t sincere.”</p><br/><p>“Wait and see. Bai Xuan’s vision shouldn’t be bad.”</p><br/><p>The two people were chatting when the sound of the key in the door was heard. Bai Xuan’s parents rushed out of the kitchen and were stunned when they saw the person behind Bai Xuan.</p><br/><p>The man was taller than Bai Xuan. He was very handsome and had a sunny smile but he was only in his early 20s. Was such a young and handsome guy reliable?</p><br/><p>Before Bai Xuan could speak, Xie Shurong took the initiative to go forward and politely bowed. “Hello, Uncle and Auntie! My name is Xie Shurong and I’m Bai Xuan’s boyfriend. This is the first time we’re meeting and I didn’t know what to bring. Thus, I bought some supplements. I hope that Auntie and Uncle will be in good health.”</p><br/><p>Mother Bai was flattered as she received the many high-end gift boxes. She smiled and said, “You are very polite. Why bring so many things? Come and sit down.”</p><br/><p>Xie Shurong quietly walked over and Mother Bai glanced at her husband. The two people went to the kitchen to serve the dishes and she wondered in a worried manner, “This child is quite handsome and polite. Do you think that Bai Xuan specifically invited an actor to reassure us?”</p><br/><p>Father Bai frowned. “You are watching too many TV dramas! How can our son find an actor to fool us? Don’t you know this person? He is on the same team as our son and plays the swordsman. The one named Shu!</p><br/><p>Mother Bai suddenly realized. “Ah, no wonder why he is so familiar. It turns out to be our son’s partner. Then I’m relieved. At the very least, a person on the same team isn’t a lie. He is just… a bit younger.”</p><br/><p>Father Bai told her, “Isn’t it good to be younger? A younger person’s mind is more simple and easily disciplined. An older and deeply experienced person might not be easily held by our son.”</p><br/><p>“That’s right.” Mother Bai was completely relieved.</p><br/><p>Previously, they watched the matches and there weren’t many shots directed at the participants. Even then, it was only side shots.</p><br/><p>Now they saw the real person at a close distance and found this Shu was much better than the TV. His figure was good, he was tall, handsome and he matched well with Bai Xuan. Mother Bai was very satisfied. Once the cooked dishes were on the table, she gave a bowl of stewed pork ribs to Xie Shurong and let him eat more.</p><br/><p>“Too delicious!” Xie Shurong tasted a pork rib and immediately smiled. “Auntie, do you specialize in cooking? This dish is better than the chef of a five star hotel.”</p><br/><p>Mother Bai smiled. “You are really sweet. How can my dishes be so good?”</p><br/><p>“Auntie, don’t be humble. It is really delicious!”</p><br/><p>Mother Bai was very happy about being praised. The more she saw, the more she felt this young and handsome person was very cute. She couldn’t help giving him a piece of chicken wings. “Try this!”</p><br/><p>Xie Shurong praised while eating, “Good, delicious!”</p><br/><p>Bai Xuan sat next to them and couldn’t even insert himself…</p><br/><p>Xie Shurong was a person who loved food and his mouth was sweet. Mother Bai was quickly coaxed by him and continued to give Xie Shurong dishes. She willingly fed all the food she made to Xie Shurong.</p><br/><p>Xie Shurong also wasn’t polite. He swept away all the food and was full of praise when eating.</p><br/><p>Originally it was expected that the first meeting would be awkward but Xie Shurong’s mouth was sweet and he was extraordinarily warm, like everyone was family.</p><br/><p>Mother Bai obviously liked him a lot and Father Bai didn’t say anything but his eyes showed his appreciation.</p><br/><p>Bai Xuan saw this scene and finally felt relieved. Xie Shurong was often childish and naive but he was reliable in key moments, knowing how to curry favour with elders. In such a short period of time, he actually got the goodwill of Bai Xuan’s parents. Bai Xuan had to say that this guy’s mouth was very important when talking to people.</p><br/><p>After the meal, Xie Shurong took the initiative to stand up and help Mother Bai wash the dishes. He rolled up his sleeves and said, “Auntie, I will help you with the dishes. I am especially talented at washing dishes. I used to wash dishes for Bai Xuan when we were with the team.”</p><br/><p>Bai Xuan heard this and almost slipped. In the past, every time it came to washing dishes then a spoiled man would hold onto him, complaining, “Can I not wash the dishes? I hate washing dishes.” As a result, today he became active in helping to wash the dishes. Black became white. Xie Shurong, can you not have such a comic dialogue?</p><br/><p>At Bai Xuan’s eyes, Xie Shurong just blinked in a shameless manner. He ignored Bai Xuan’s speechless contempt and followed Mother Bai into the kitchen to wash the dishes.</p><br/><p>Mother Bai loved the ‘hardworking’ young guy who ‘liked housework.’ She saw his hands tidying up the dishes and laughed. “Now there are very few young people who like to do housework. Ah Shu, you are really sensible.”</p><br/><p>Xie Shurong smiled. “Bai Xuan’s cooking must be inherited from you? His food is especially delicious. I can’t cook so I can only help him wash the dishes.”</p><br/><p>“Hmm.” Mother Bai thought about it and asked, “How long have you been with Bai Xuan?”</p><br/><p>“It’s been almost a year. I chased him at first and he didn’t like me much. I was younger than him and not mature enough. I always felt I wasn’t worthy of him.” Xie Shurong paused before speaking seriously, “Auntie, rest assured. I will try my best to match him. I am younger than him but I really like him.”</p><br/><p>Mother Bai was completely moved and patted Xie Shurong’s shoulder. “Don’t say that. Bai Xuan was blessed to meet you.”</p><br/><p>“Auntie, I was blessed to meet him. He has a good personality and temper. I have never seen such a kind person. It would be nice to be with him all the time…”</p><br/><p>Mother Bai smiled. “Yes, our Bai Xuan is single-minded when it comes to feelings. You just have to treat him well and he will certainly treat you well.”</p><br/><p>“I think so too!”</p><br/><p>***</p><br/><p>They finished washing the dishes and Mother Bai’s smile was brighter than before. She was obviously very happy with Xie Shurong and took the initiative to cut an apple for him. Know that even Bai Xuan didn’t receive this treatment at home.</p><br/><p>She was going to have Xie Shurong stay for dinner but Bai Xuan was worried that Xie Shurong would speak nonsense to his parents and told her, “Mother, I will take Ah Shu out to eat tonight. He hasn’t eaten authentic Hangzhou food.”</p><br/><p>Mother Bai immediately nodded in agreement. “Okay, take him to taste west lake vinegar fish and dongpo meat.”</p><br/><p>Xie Shurong stood up. “Auntie, I’ll go first. I’ll see you later!”</p><br/><p>Mother Bai opened her mouth, “Wait, Auntie has something to give you.” She headed to the bedroom and took out a delicate box, carefully handing it to Xie Shurong. “This is for you. Later, you and Bai Xuan should get along well. Understood?”</p><br/><p>Bai Xuan’s eyes were as big as a cow. “Mother, this…”</p><br/><p>Xie Shurong realized this must be a very meaningful thing and didn’t wait for Bai Xuan to oppose it. He immediately accepted and responded seriously, “Auntie, rest assured, I will be good to him for the rest of my life!”</p><br/><p>Bai Xuan, “…”</p><br/><p>***</p><br/><p>The two people left and walked side by side. Xie Shurong took out the box that Mother Bai gave him and there was actually a valuable jade pendant inside.</p><br/><p>Xie Shurong’s eyes lit up and he glanced over at Bai Xuan. “Is this a family heirloom?”</p><br/><p>“No.”</p><br/><p>“Then what is it? Based on Mother’s cautious attitude, it definitely isn’t an ordinary gift.”</p><br/><p>His way of calling Mother had become smoother. Bai Xuan was too lazy to care about it. After a moment of silence, he touched his nose in an embarrassed manner. “Cough, this is what my mother bought when I was born. She was going to give it to… her daughter-in-law in the future.”</p><br/><p>Xie Shurong glanced at the pendant with surprise. Then he reacted to what happened and smiled brightly. He turned to hug Bai Xuan. “It seems that Mother has recognized me. Then can I be your wife?”</p><br/><p>Bai Xuan blushed and gently pushed him. “What wife…”</p><br/><p>Xie Shurong brazenly kissed Bai Xuan. “Then will you be my wife?”</p><br/><p>Bai Xuan’s face became redder and he reprimanded, “Don’t talk nonsense!”</p><br/><p>Xie Shurong immediately changed his words. “Can I become your official boyfriend. Based on my performance, can I get a promotion and a raise?”</p><br/><p>Bai Xuan was helpless. “Let go first.”</p><br/><p>“If Boss doesn’t let me obtain full status then I won’t let you go.”</p><br/><p>“You…”</p><br/><p>“It has been almost a year since I entered the company and there are three months left on the internship.” Xie Shurong placed his chin on Bai Xuan’s shoulder and acted petulantly. “I want to be your official boyfriend. I don’t want to worry every day. Let me be a full time member. I will show a good performance. Don’t wait for the year’s deadline and let’s continue together.”</p><br/><p>Bai Xuan was softened by him and couldn’t help saying, “That… okay.”</p><br/><p>Xie Shurong heard this and a glimmer of light flashed in his eyes. They became particularly deep and the petulant person holding Bai Xuan became a man.</p><br/><p>He knew that Bai Xuan still wasn’t sure about their relationship and had no confidence spending the rest of his life with Xie Shurong. Still, it didn’t matter. One day, he would let Bai Xuan put down all the worries in his heart and really fall in love with Xie Shurong.</p><br/><p>Xie Shurong placed Mother Bai’s gift in his pocket and happily held the person in his arms.</p><br/>\n</div>"}