{"title": "Chapter 386 - Intern Boyfriend (End)", "id": 386, "volume": 4, "url": "http://boxnovel.org/god-level-summoner-chapter-386-intern-boyfriend-end", "volume_title": "Volume 4", "body": "<h1>Chapter 386 - Intern Boyfriend (End)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 386 – Intern Boyfriend (End)</p><hr/><br/><p>Bai Xuan brought Xie Shurong into his own home. Last time, the presence of the parents meant Xie Shurong didn’t dare explore Bai Xuan’s house. Today, only Bai Xuan was at home and Xie Shurong didn’t need to be scrupulous. He entered the house and asked with a smile, “Which room is yours? I want to see where you live?”</p><br/><p>“This side.” Bai Xuan opened his bedroom door. “It’s nothing special.”</p><br/><p>Xie Shurong walked in and saw that the bedroom was as clean and tidy as he imagined. The wallpaper and bed were a soft beige tone, so that the whole room seemed extraordinarily warm. There was a photo frame on the table that showed Bai Xuan in his youth. His facial features hadn’t fully developed and he looked young as he smiled at the camera.</p><br/><p>“Do you have any photos of when you were a child? Xie Shurong looked back at Bai Xuan. “Can you show me?”</p><br/><p>“What’s so good about photos as a child?”</p><br/><p>“They help me get to know you better.” Xie Shurong smiled. “If you like someone then you want to know their past. I am especially curious about when you were young.”</p><br/><p>“Fine.” Bai Xuan smiled helplessly and turned to get a photo album. Xie Shurong sat on Bai Xuan’s bed and casually watched it. As a child, Bai Xuan had particularly lovely white skin while his eyes were black and big. He was very fond of smiling. In most of the photos, he was smiling at the camera and this made Xie Shurong want to pinch Xiao Bai’s face in the photos.</p><br/><p>Bai Xuan saw that this person’s smile had become darker and deeper and couldn’t help asking, “What are you smiling at? Do I look funny when I’m a kid?”</p><br/><p>“You were very cute, worthy of being the person I like.” Xie Shurong took the photo album and kissed the child in the photo. Bai Xuan was embarrassed by this action and grabbed the photo album. “You can kiss the seven year old child!”</p><br/><p>Xie Shurong glanced at Bai Xuan. “Whether it is seven or seventy, I am willing to kiss as long as it is you.”</p><br/><p>His eyes were so earnest that Bai Xuan’s heartbeat sped up. He didn’t dare look at this person for a moment and turned to look out the window. The words ‘seventy’ made Bai Xuan imagine the two old men together. It wasn’t beautiful but it made Bai Xuan feel warm. This type of feeling was light, like sweetened candy that seeped into the bottom of his heart.</p><br/><p>***</p><br/><p>In the afternoon, Bai Xuan wanted to accompany Xie Shurong for a stroll. As a result, they had just walked out the door when they saw a girl standing at the door with several books in her arms. It was Bai Ning, Bai Xuan’s cousin.</p><br/><p>This girl had listened to Bai Xuan’s words yesterday. She returned home and sorted out a bunch of information about e-sports players. She wanted to ask her cousin about them only to see a tall and handsome boy standing next to him. Bai Ning was stunned and immediately put down the books as she threw herself at him. “Ah Shu! Are you Ah Shu? I like you the most!”</p><br/><p>Xie Shurong was frightened and glanced at Bai Xuan with confusion. Bai Xuan helplessly introduced them, “This is my cousin, Bai Ning.”</p><br/><p>Xie Shurong sighed with relief when he heard this and hugged Bai Ning. “Hello, I am Xie Shurong.”</p><br/><p>Bai Ning was excited. “Looking closely, the real person is more handsome than the photo!”</p><br/><p>Xie Shurong wasn’t modest and naturally replied, “I also think I am more handsome.”</p><br/><p>“…” Bai Xuan was silent for a moment and glanced back at this sister. “Did you come to find me for something?”</p><br/><p>“Oh Brother, yesterday you said that I need the foundation if I want to be an e-sports player. I bought some books to ask you questions.” Bai Ning smiled and handed the books to him. “Brother, can you let Ah Shu be my teacher for a while? I also like to play a swordsman…”</p><br/><p>Bai Xuan hadn’t managed to speak when Xie Shurong smiled and promised. “No problem, if you have any questions then ask me.”</p><br/><p>“Is it really okay?” Bai Nine glanced at him expectantly.</p><br/><p>Xie Shurong nodded and spoke gently, “Of course, Bai Xuan’s sister is my sister.”</p><br/><p>Bai Xuan’s ears were hot when he heart this but since his sister came, he immediately called the two people into the house.</p><br/><p>Xie Shurong thought that Bai Xuan’s cousin was very cute. This little girl’s character was lively and she had a clear mention state. She was different from Bai Xuan’s gentleness and carefulness. Xie Shurong was the only child at home and naturally treated Bai Xuan’s sister as his own sister, patiently answering her strange questions.</p><br/><p>For the afternoon, Xie Shurong patiently answered various strange questions and taught her how to play the swordsman. Bai Ning’s excited laughter came from the study from time to time, mixed with Xie Shurong’s explanations. This made Bai Xuan’s heart feel a bit funny.</p><br/><p>He didn’t expect that this childish Ah Shu could be so good when helping Bai Xuan’s sister.</p><br/><p>In order to reward him, Bai Xuan personally cooked a sumptuous dinner. Xie Shurong and Bai Ning smelt it and came to the restaurant. They chatted while eating and had obviously become very familiar during the afternoon.</p><br/><p>Bai Ning asked curiously, “Brother Shu, do you have a girlfriend?”</p><br/><p>“No.” Xie Shurong replied with a smile. He had a boyfriend and it was her brother.</p><br/><p>“Then what do you like?”</p><br/><p>“I like…” Xie Shurong wanted to saw her brother but he saw Bai Xuan’s stare and immediately changed his words. “I like a gentle person with a good temper who is easy to get along with.</p><br/><p>“Oh. “Bai Ning satisfied her curiosity and turned to ask Bai Xuan, “Brother, what about you? What type do you like? Are you too busy to fall in love?”</p><br/><p>Bai Xuan almost choked. He coughed a few times before changing the topic. “Eat more. You are too thin.”</p><br/><p>Her mouth was blocked with a rib and Bai Ning stopped talking. She ate the food in the bowl and chattered with Xie Shurong for a while before leaving in a satisfied manner.</p><br/><p>Once she left, Xie Shurong spoke, “Your sister is very talented. I think she is a good seedling and can perhaps become a female player later. I gave her my Q number and will teach her in the future.”</p><br/><p>Bai Xuan wondered, “Why are you suddenly so kind?”</p><br/><p>Xie Shurong smiled. “Didn’t I say it? Your sister is my sister. Your family, I will treat as my own family.”</p><br/><p>The simply sentence moved Bai Xuan.</p><br/><p>Bai Ning’s personality was actually a bit annoying. Generally, men couldn’t stand such girls pestering them with questions, especially when some of the questions were quite childish. Yet Xie Shurong patiently answered them all afternoon because of Bai Xuan.</p><br/><p>-Your family, I will treat as my own family.</p><br/><p>This sentence was lethal to Bai Xuan. It was actually stronger than ‘I like you.’</p><br/><p>It was only when a person really wanted to be with someone that they would attach so much importance to family. Falling in love wasn’t the same as getting married. Once a loved one was brought to see the family, it meant there was a plan to live with them.</p><br/><p>It wasn’t until this moment that Bai Xuan discovered he was deeply trying to get along with Xie Shurong. Otherwise, who could he bring them back to meet his parents? How could he watch his mother give the jade pendant to Xie Shurong without objection?</p><br/><p>It turned out that unconsciously, his heart had already fallen completely.</p><br/><p>Bai Xuan felt surprised but he was very calm.</p><br/><p>Xie Shurong wasn’t in line with his original ideal type but what did it matter? As long as the two of them treated each other sincerely, their days could be peaceful and beautiful.</p><br/><p>Bai Xuan smiled softly as he watched Xie Shurong actively run to the kitchen to wash the dishes.</p><br/><p>He finally found the person he could sincerely entrust his heart to and was very satisfied. He decided to give Xie Shurong a promotion and salary increase this evening. As for the specific salary increase… he would let Ah Shu be willful and make a request.</p><br/><p>After sending away Bai Ning, Xie Shurong consciously went to the kitchen to wash dishes. By the time he came out, Bai Xuan had already taken a shower. He was sitting at the table and thinking carefully. Xie Shurong cheekily walked to him and hugged the other person, placing his chin on Bai Xuan’s shoulder. “What are you thinking about? Is it me?”</p><br/><p>Bai Xuan didn’t refute him and smiled. “Yes, I was thinking about you. You’ve been doing well recently and as the boss, I’ve decided to give the regular employee a pay rise.”</p><br/><p>Xie Shurong excitedly hugged him. “Really? What is the pay rise method? Is it a kiss or…”</p><br/><p>Bai Xuan reached out and touched his chin. “Go and take a shower.”</p><br/><p>The meaning of this sentence was obvious and Xie Shurong immediately smiled. “I understand, Boss. I must wash myself clean.”</p><br/><p>Bai Xuan saw him rush like the wind into the bathroom with his toiletries. Bai Xuan was both amused and nervous at the same time.</p><br/><p>Did he really want to extend their physical relationship? Wasn’t it a bit too soon? Then when he thought about it carefully, they time they dated wasn’t short. From an internship to a formal relationship, it had been almost a year…</p><br/><p>Since it was a mutual affection, it was normal to meet each other’s physical needs. Bai Xuan took a deep breath and sat on the bed in the bedroom, thinking about what might happen next. He couldn’t help his cheeks heating up.</p><br/><p>A while later, Xie Shurong came out of the shower and he was only wearing underwear.</p><br/><p>Bai Xuan saw that this person was quite good when undressed. The muscles of his arms and thighs were strong but didn’t look too rough. It was a well-balanced beauty. The eight pack was very eye-catching and the young and strong body approaching him made Bai Xuan’s heart beat faster.</p><br/><p>Xie Shurong sat down next to him with a smile and whispered, “Is my body satisfactory?”</p><br/><p>Bai Xuan shifted his gaze and said, “Okay.”</p><br/><p>Xie Shurong grasped Bai Xuan’s hand, clasping their fingers together closely. He glanced seriously at Bai Xuan. “I really want to go further with you but I don’t want to force you. If you don’t want to…”</p><br/><p>“I didn’t say I don’t want to.” Bai Xuan interrupted him with some embarrassment. “Let’s go with the flow.”</p><br/><p>“Then shall we try it tonight?”</p><br/><p>“Okay.”</p><br/><p>Next part has been censored. Please read the uncensored version at the link below.</p><br/>\n</div>"}