{"title": "Chapter 384 - Intern Boyfriend (3): Jealous Xiao Shu", "id": 384, "volume": 4, "url": "http://boxnovel.org/god-level-summoner-chapter-384-intern-boyfriend-3-jealous-xiao-shu", "volume_title": "Volume 4", "body": "<h1>Chapter 384 - Intern Boyfriend (3): Jealous Xiao Shu</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 384 – Intern Boyfriend (3): Jealous Xiao Shu</p><hr/><br/><p>Bai Xuan took Xie Shurong to a famous restaurant nearby and ordered a few local specialities. A plate of west lake vinegar fish was brought out and the greedy Xie Shurong soon cleared the plate. He smiled and said, “It’s delicious but I still like your cooking.”</p><br/><p>“Why?” Bai Xuan asked in a puzzled manner.</p><br/><p>“Because I like you.” Xie Shurong answered like it was natural but Bai Xuan quickly became uncomfortable and removed his gaze.</p><br/><p>As a result, he turned his head and saw a familiar man coming to this side. The man was obviously stunned before smiling and walking over to Bai Xuan. He gracefully reached out and spoke, “Xiao Bai? It’s been a long time.”</p><br/><p>Bai Xuan politely shook hands with him. “Brother, what a coincidence.”</p><br/><p>Xie Shurong heard Bai Xuan’s words and couldn’t help looking up at the ‘senior.’ The man looked quite handsome. He was dressed in a well-cut grey suit and the briefcase in his hand and the shoes on his feet were from big international brands. However, they were relatively low-key styles. Their price wasn’t obvious by looking.</p><br/><p>A low-key, calm and elite man, it was the type that Bai Xuan liked!</p><br/><p>Xie Shurong’s ears pricked in a vigilant manner.</p><br/><p>After the greeting, the man asked, “Is it convenient to sit down for a while?”</p><br/><p>Bai Xuan pointed to the seat next to him and smiled. “Sit down and eat together. This meal is my treat.” The waiter came at the right timing and Bai Xuan softly requested, “Hello, can I add a few more dishes here? Please give the menu.”</p><br/><p>This brother kept staring at Bai Xuan and after the waiter left, he said, “Your temper hasn’t changed. You are as gentle as before.”</p><br/><p>Bai Xuan touched his nose in an embarrassed manner and didn’t know how to answer.</p><br/><p>He knew this senior classmate from university. His dormitory was upstairs and both of them were students of the Foreign Languages Department. They also graduated from the same high school and their relationship was closer than other students.</p><br/><p>During their school days, this classmate was considered to be famous. There was a time when foreign experts came to the school and he did a simultaneous interpretation. He was praised and entered a foreign company directly after graduation.</p><br/><p>Bai Xuan had little contact with his former alumni after becoming an e-sports player. He only occasionally heard news about his schoolmate. Bai Xuan didn’t think much of their encounter today and took the initiative to use his brother to sit down and have a meal together.</p><br/><p>The man was curious about Bai Xuan’s recent situation. “I heard that you went to the World Competition and took the championship?”</p><br/><p>Bai Xuan replied modestly, “It is because the players of the national team are excellent.”</p><br/><p>The man smiled. “You must be good to be selected for the national team. I don’t know e-sports but there are many people in the alumni group who have been boasting about you in the past few days. Many girls want to find you to get your signature.”</p><br/><p>“Is that right? So exaggerated…” Bai Xuan was too embarrassed and changed the topic. “Do you want to order two more dishes?”</p><br/><p>“No, you know I don’t eat much.”</p><br/><p>The two people chatted naturally to each other while next to them, Xie Shurong was becoming more annoyed. The west lake vinegar fish that he just ate had a sour taste in his stomach. The elite man in front of him wasn’t pleasing to the eye. The thick wax on his hair was particularly ugly and was inferior to Xie Shurong’s short hair. The man’s clothes were old-fashioned and there was no fresh energy.</p><br/><p>Xie Shurong didn’t want to see the two old schoolmates catching up and had to lower his head. He directed his indignation at the food and quickly swept up the plates in front of him.</p><br/><p>The man finally seemed to notice that someone else was sitting at the table and asked, “This is?”</p><br/><p>Bai Xuan introduced them. “This is Ah Shu. He is my… teammate.”</p><br/><p>Xie Shurong obviously wasn’t very happy to hear this introduction. He glanced at Bai Xuan grievously and seemed to be wondering ‘why didn’t you say I am your boyfriend?’ Bai Xuan guiltily looked away and bowed his head to eat.</p><br/><p>At the end of the meal, Bai Xuan wanted to get up and pay for the bill. The man graciously held his arm and smiled. “I will pay. How can I let my school brother pay the bill?”</p><br/><p>Bai Xuan refuted, “Previously, you always paid when inviting me to a meal in school. Let me pay this time.”</p><br/><p>“It’s fine. This should be my treat.” He turned and paid with his card. Bai Xuan had to helplessly get up and leave with Xie Shurong.</p><br/><p>***</p><br/><p>Dinner ended and this brother drove away. Bai Xuan sent Xie Shurong back to the hotel and wanted to separate at the entrance when Xie Shurong suddenly said, “I have something to ask you. Go to my room and sit down.”</p><br/><p>Bai Xuan had to go upstairs with him. As a result, Xie Shurong kissed Bai Xuan against the door the moment they entered.</p><br/><p>The kiss was so hot it almost melted a person. Bai Xuan was breathless as he pushed Xie Shurong away and wondered, “What’s wrong with you?”</p><br/><p>Xie Shurong looked wronged. “I’m not happy and want to kiss you.”</p><br/><p>Bai Xuan was puzzled. “Why aren’t you happy? Didn’t you like the food at the restaurant?’</p><br/><p>“Why can’t you see that I’m jealous!”</p><br/><p>Bai Xuan was stunned. He looked at this angry appearance and couldn’t help looking.</p><br/><p>Xie Shurong turned away. “I’m jealous. Find a way to comfort me or I won’t get up.”</p><br/><p>Then he lay on the bed like a child, rolling around in his quilt and looking up at Bai Xuan with a wronged expression.</p><br/><p>Bai Xuan was simply stunned. How could such a big person be so naive?</p><br/><p>Xie Shurong continued to call out, “I want milk dad’s hug and kiss, or I will lose blood and die.”</p><br/><p>“…” Bai Xuan rolled his eyes. “Then keep losing blood and died.”</p><br/><p>He turned to walk away. Xie Shurong suddenly jumped out of bed and hugged Bai Xuan from behind, using his hands and feet to press Bai Xuan onto the bed.</p><br/><p>The petulant child who was acting spoiled suddenly showed such agility and decisiveness.</p><br/><p>Bai Xuan stared up at the young man pressing on his body and couldn’t help thinking about it. Did Xie Shurong’s body have two souls? One was a childish rascal like a puppy while the other was decisively sharp like a fierce wolf.</p><br/><p>Bai Xuan couldn’t break away and had to helplessly say, “You are thinking too much. I have an ordinary relationship with that brother.”</p><br/><p>Xie Shurong asked sharply, “Then why did he often invite you to eat?”</p><br/><p>Bai Xuan was stunned. This sentence in the conversation had been completely remembered by Xie Shurong.</p><br/><p>He stretched out a hand to pinch this person’s face and smiled. “He asked me to eat a few times because I know him and his girlfriend. I indirectly pulled the strings for him.”</p><br/><p>Xie Shurong heard these words and his heart finally returned to normal. He bent over and rubbed his head against Bai Xuan’s white neck. “After you saw him, you no longer looked at me. He is the type you like and I’m… worried you won’t want me.”</p><br/><p>Bai Xuan’s neck was very itchy but his heart softened. He patted Xie Shurong’s head and said, “How can I not want you? The boyfriend who just got promoted, how can I dismiss you?”</p><br/><p>Xie Shurong continued to rub against Bai Xuan’s neck. “Is there a bonus after the promotion? Will it be higher than the internship period?”</p><br/><p>“What bonus?”</p><br/><p>Xie Shurong gently pecked Bai Xuan’s lips. “For example, accompanying you to eat will be rewarded with a hug. Making you happy will be rewarded with a kiss. It would be nice if you could reward yourself.”</p><br/><p>Bai Xuan was amused and hit him. “Get off.”</p><br/><p>Instead, Xie Shurong reached out and hugged him, “I don’t want to get off. If I leave you alone, you will be taken away.”</p><br/><p>Then his hands and feet wrapped around Bai Xuan like a large koala.</p><br/><p>Bai Xuan struggled but he wasn’t Xie Shurong’s opponent in physical strength. The moment he freed his left foot, his right foot was trapped again. He kicked his right feet and Xie Shurong’s used his feet to hold Bai Xuan.</p><br/><p>The two people played in bed for a long time. The tired and panting Bai Xuan finally found a chance and turned around, pressing back Xie Shurong. He was laughing and about to announce his victory when he unexpectedly found something hard against himself.</p><br/><p>Bai Xuan realized what it was and his face reddened and he shot off the bed like he got an electric shock.</p><br/><p>Xie Shurong gently pulled his hand and touched it to the part of his body reacting “If you leave, what about my little brother?”</p><br/><p>Bai Xuan was going to collapse. Could this person not speak so directly?</p><br/>\n</div>"}