{"title": "Chapter 390 - Working Together for a Lifetime (4)", "id": 390, "volume": 4, "url": "http://boxnovel.org/god-level-summoner-chapter-390-working-together-for-a-lifetime-4", "volume_title": "Volume 4", "body": "<h1>Chapter 390 - Working Together for a Lifetime (4)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 390 – Working Together for a Lifetime (4)</p><hr/><br/><p>When Ling Xuefeng and Li Cangyu arrived at the villa, they entered the bathroom without having time to enjoy the view. Once they finished, it was already dark outside the window.</p><br/><p>Li Cangyu’s waist was uncomfortable and his legs were hanging over the edge of the bathtub. He took a deep breath and drew back his legs. Then he touched his stomach and said, “I’m a bit hungry.”</p><br/><p>He had only eaten on the plan and there was a serious physical energy consumption in the afternoon. Li Cangyu was hungry as he got up and planned to find something to eat.</p><br/><p>Ling Xuefeng came up to him and wrapped a towel around his body. “Be careful not to catch a cold.”</p><br/><p>Li Cangyu smiled and gave Ling Xuefeng a bath towel. “You as well.”</p><br/><p>The two men looked at their lover wrapped in a white towel and were filled with a sweet warmth.</p><br/><p>Ling Xuefeng reached out to touch Li Cangyu’s wet hair. “Go dry your hair and I’ll make dinner.” He thoughtfully handed the hair dryer to Li Cangyu.</p><br/><p>“Do you want to cook?” Li Cangyu stood in front of the mirror and blew his hair. He could see the handsome man’s face in the mirror and the other person was staring at him. LI Cangyu couldn’t help smiling, “It is too much trouble to go to the supermarket to buy ingredients. We should change clothes and find a restaurant to eat at.”</p><br/><p>“Okay, I’ll go to the nearby supermarket tomorrow to buy food.” Ling Xuefeng stepped forward and gazed tenderly at his lover. He took the hair dryer and patiently helped this person blow dry his hair.</p><br/><p>The two men dried their hair, changed clothes and went out.</p><br/><p>***</p><br/><p>It was dark outside and the street lights in front of the villa gave a soft warmth. The two people walked for 10 minutes before finding a restaurant on the side of the road. Based on the facade, it was Western food and there weren’t too many customers in the restaurant. They found a quiet corner to sit down and once the waiter came over, Ling Xuefeng used fluent English to order.</p><br/><p>He ordered a couple’s meal as well as an extra portion of black pepper steak and a lemon-flavoured cold drink.</p><br/><p>Li Cangyu laughed. “You still remember my taste?”</p><br/><p>“Of course.” Ling Xuefeng stared at him. “I remember everything about you.”</p><br/><p>Perhaps the lights were too warm and the music too soft. Li Cangyu suddenly felt that Ling Xuefeng’s gentle eyes were a whirlpool, attracting him to sink in.</p><br/><p>-I remember everything about you.</p><br/><p>It was a simple sentence but it contained many years of hard waiting. In fact, this man looked serious and indifferent but he was more tolerant than anyone else. It was just that this strong tolerance was for his lover.</p><br/><p>“Why are you looking at me?” Ling Xuefeng felt the other person staring and asked.</p><br/><p>“It is because you are handsome.” Li Cangyu replied directly. “I feel I have very good eyes.”</p><br/><p>“Me too.”</p><br/><p>The two men smiled at each other before the waiter came over and placed food on the table.</p><br/><p>The couple’s package was very rich and enough for two people to eat, but Ling Xuefeng was worried it wouldn’t be enough and thoughtfully ordered the steak for Li Cangyu. Li Cangyu was starving and cut the steak, giving half to Ling Xuefeng.</p><br/><p>The two people quietly ate dinner. They didn’t talk much but this type of tacit understanding allowed even the waiters at the bar to see the deep feelings between them. It seemed there was a strange separation about them. They were in their own world and outsiders couldn’t get involved.</p><br/><p>After eating, Ling Xuefeng took the initiative to get up and pay. Then he asked Li Cangyu, “Do you want to go back to rest or stroll around the beach?”</p><br/><p>“What about you?”</p><br/><p>“It is still early. Let’s go for a stroll around the beach?”</p><br/><p>“Good.” Li Cangyu paused before whispering into Ling Xuefeng’s ears, “However, I can’t walk too long. My legs are still sore.”</p><br/><p>He spoke directly without any traces of embarrassment.</p><br/><p>Ling Xuefeng remembered the scene where he raised this person’s legs and repeatedly moved in and out of the body and his eyes became gentler. He asked, “Would you like me to carry you?”</p><br/><p>“Okay.” Li Cangyu wasn’t polite. He saw Ling Xuefeng bending down in front of him and immediately got on this person’s back, asking, “I’m not heavy? My weight doesn’t seem to be lighter than you.”</p><br/><p>“It’s fine.” LIng Xuefeng’s heart was soft. He started talking as he walked. “As a child, I always thought that when I have a lover, I would carry them on my back when walking by the sea.”</p><br/><p>“Is that so? Then your wish has come true.” Li Cangyu touched Ling Xuefeng’s chin and joking, “However, when you were a child, you probably thought you would be carrying a big beauty instead of a big man?”</p><br/><p>“That’s true.” Ling Xuefeng honestly admitted. “Then my thoughts changed after meeting you.”</p><br/><p>***</p><br/><p>It was dark and Ling Xuefeng carried Li Cangyu on a beach walk. The man on his back wasn’t light but Ling Xuefeng’s pace was still stable.</p><br/><p>The sea at night was mysterious. The faint moonlight caused a series of tiny silver ripples on the sea and the sound of the waves hitting the beach seemed to have a strange power that calmed down the mood.</p><br/><p>The sea breeze was cool and mixed with the damp smell of the sea. Nevertheless, it wasn’t too cold and made people feel refreshed.</p><br/><p>Li Cangyu lay on Ling Xuefeng’s back and breathed in the fresh air of the beach. Once they were a dozen metres away from the shoreline, Li Cangyu patted the other person’s shoulder and said, “Let me down.”</p><br/><p>Ling Xuefeng put him down and stared at him.</p><br/><p>In the soft moonlight, a faint smile could be seen on this handsome face. His lips were red and swollen and his neck was covered with kiss marks.</p><br/><p>An average person would definitely find a way to cover these traces with high-necked shirts. Some people would even be too shy to go out but Li Cangyu never knew shyness.</p><br/><p>This man was open about everything. Once he was in love, he was straightforward and magnanimous.</p><br/><p>Ling Xuefeng smiled and gently held this person’s hand.</p><br/><p>Li Cangyu opened his mouth. “Suddenly holding my hand, are you trying to say something?”</p><br/><p>Ling Xuefeng linked their fingers together and replied, “It is time to say something.” He gently hugged Li Cangyu and clearly spoke in Li Cangyu’s ears, word by word. “I, love, you.”</p><br/><p>Li Cangyu was stunned. He didn’t expect this always cold man to actually say such words.</p><br/><p>In the past, Li Cangyu only had the game in his mind and never thought about love. Apart from eating and sleeping, the rest of the time was spent watching videos of the game, studying various professional features, arranging tactics and organizing his team’s training. His entire world was completely filled with the word ‘e-sports.’</p><br/><p>Since returning to Miracle and reuniting with Ling Xuefeng, he suddenly discovered that there could be such a beautiful love in the world.</p><br/><p>In these years, he had weathered hardships and drifted through many ups and downs. At this moment, being in this man’s arms made Li Cangyu feel a type of peace.</p><br/><p>A peace that could last a lifetime.</p><br/><p>The feeling of falling in love with someone wasn’t bad. It wasn’t difficult to admit that he fell in love.</p><br/><p>Li Cangyu smiled and hugged Ling Xuefeng, replying seriously, “I love you too.”</p><br/><p>The man’s arms suddenly tightened as if he wanted to melt Li Cangyu into his body.</p><br/><p>Li Cangyu took a deep breath and smelt the cold and refreshing scent that belonged to Ling Xuefeng. He also tightened his arms and hugged his person.</p><br/><p>Their left hand and right hands were interlocked and clasped tightly to their chest.</p><br/><p>Their right arm and left arm hugged the other person tightly, seeming to make a promise that they would never forsake the other.</p><br/><p>On the beach by the sea, two people embraced each other and the moonlight shone softly on them, as if time had stopped.</p><br/>\n</div>"}