{"title": "Chapter 393 - Working Together for a Lifetime (5)", "id": 393, "volume": 4, "url": "http://boxnovel.org/god-level-summoner-chapter-393-working-together-for-a-lifetime-5", "volume_title": "Volume 4", "body": "<h1>Chapter 393 - Working Together for a Lifetime (5)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 393 – Working Together for a Lifetime (5)</p><hr/><br/><p>The eighth season soon started. Li Cangyu and Ling Xuefeng didn’t give any response to the Maldives incident. Both of them performed calmly like this never happened.</p><br/><p>The gossip crowd were curious but were unsure if they were lovers or not. However, most news on the Internet was only hot for a few days. People’s attention was quickly dispersed and the two people’s cold treatment method calmed down the storm. The fans’ attention turned to the upcoming eighth season of the Miracle League.</p><br/><p>Then everyone was surprised to find that Bai Xuan and Zhang Jueming were missing from the list of Canglan members.</p><br/><p>Bai Xuan gently wrote on Weibo that he had decided to leave the Miracle League and had found a translating job in Changsha. He hoped everyone could understand. This post received many blessings and everyone could understand his decision to retire. After all, he was in poor health.</p><br/><p>Zhang Jueming said he would continue to operate the studio and advertised his studio, calling on office workers who had no time to raise their characters to call his number. The fans laughed while also feeling distressed. Zhang Jueming was 28 this year and it was a rational choice to leave Miracle.</p><br/><p>The departure of Vice-Captain Bai and Old Zhang made everyone feel sad but fortunately, Li Cangyu’s name was still among the list of team members. Li Cangyu also participated in the pre-season preparatory meeting as the captain. The new vice-captain Xiao Han, Xiao Han, Zhuo Hang, Li Xiaojiang, Gu Siming were in the starting lineup and they also brought three newcomers.</p><br/><p>Similarly, Ling Xuefeng of Wind Colour added two newcomers to the list and was obviously raising new people.</p><br/><p>It seemed that the Maldives scandal didn’t affect the two great gods and the fans let go of their worries.</p><br/><p>***</p><br/><p>This season, there were many member changes to the teams and the final winner was unpredictable.</p><br/><p>However, many people thought it was impossible for Canglan to regain the championship and many reporters raised this issue with Li Cangyu at the pre-match conference. LI Cangyu performed very calmly. “The goal of this season isn’t to take the championship again. It is to successfully complete the exchange of old and new.”</p><br/><p>A reporter asked, “About the Maldives incident, Cat God and Captain Ling have chosen to be silent. Can we understand that this silence is a default agreement?”</p><br/><p>Li Cangyu smiled. “I won’t answer this question because I want the focus to be on the matches.”</p><br/><p>“What if Wind Colour and Canglan fight each other. Will your state be affected because of personal matters?”</p><br/><p>“No.”</p><br/><p>At the same time, Ling Xuefeng was also asked this question and his answer was the same as Li Cangyu. “No.”</p><br/><p>Fans had confidence in the two captains. Although they didn’t personally admit or deny the relationship, since the two people didn’t want to mention this matter, it wasn’t easy for anyone to force them to respond.</p><br/><p>***</p><br/><p>Shortly after the opening of the season, Wind Colour and Shanghai had their first match against each other. It was Wind Colour’s home game in Shanghai.</p><br/><p>Strangely enough, Li Cangyu and Ling Xuefeng didn’t appear in the entire match. Canglan had Xie Shurong as the commander and Wind Colour served as command.</p><br/><p>The few newcomers in Canglan made some mistakes and the Wind Colour eventually relied on the home map advantage to win. The reporters were very puzzled about why the two captains didn’t appear and rushed to ask questions after the game. Li Cangyu and Ling Xuefeng responded, “It was in order to give newcomers more opportunities.</p><br/><p>Only Nan Jiangang, chairman of the league, knew that Li Cangyu and Ling Xuefeng had actually submitted their applications for retirement.</p><br/><p>Chairman Nan felt very sorry when he saw the two applications that were handed in at the same time but he knew that the careers of the two talented players had reached the most successful result. The reason they applied for retirement after the start of the season was because they wanted to raise the new players in the team as their last responsibility for the team.</p><br/><p>***</p><br/><p>The first round of the regular season was carried out in an orderly manner. The newcomers in the Canglan team made rapid progress under Li Cangyu’s training. The new lineup of the double summoners composed of Qin Mo and Xu Feifan also stabilized in the Wind Colour team.</p><br/><p>In the blink of an eye, it was the mid-season holiday and Li Cangyu and Ling Xuefeng’s application for retiring was approved by the league. The two people announced their official retirement on Weibo on the same day. The captain of Wind Colour became Xie Shurong while vice-captain was Zhuo Hang. In Wind Colour, it was Yan Ruiwen and Qin Mo.</p><br/><p>The news made it difficult for fans to accept and they left messages trying to keep the two great gods.</p><br/><p>Li Cangyu patiently explained, “Retirement is a decision I made a long time ago. The reason I have dragged it out to the present is because I was worried about the handover of the team. Now the new generation of the team has matured and I believe Ah Shu and Zhuo Hang can lead the new time. Retiring means I am no longer playing the game. I will continue being a coach of Canglan.”</p><br/><p>He explained it clearly and the last sentence made the fans feel at ease. Cat God might not be playing the game but he was still in Canglan! After all, it was the team he had formed. After many twists and turns, he would continue to guard the team behind the scenes. Fans also believed that this man would never watch the team fall. As long as the teenagers could be trained as soon as possible, Canglan was still a daunting first-class team.</p><br/><p>Compared to this, Ling Xuefeng’s response was simple. “A seven and a half year e-sports player has achieved all his personal goals and it is time to leave. Treasure it.”</p><br/><p>He didn’t say he would continue as Wind Colour’s coach and it seemed he had completely left Wind Colour. Of course, Wind Colour’s situation was different from Canglan. The lineup didn’t change much after he left and there were many old players. He was obviously very confident about the future of Wind Colour.</p><br/><p>Both people had a calm attitude when retiring because they had a better plan for the future.</p><br/><p>For them, they had spent seven and a half years as an e-sports player and experienced bitterness and sweetness. Now they retired with no regrets. Moreover, no longer playing the game meant they had more time to accompany each other. They could make up for the shortcomings of not being able to meet.</p><br/><p>They wanted to spend more time together.</p><br/><p>***</p><br/><p>For the next few days of the holidays, the screen was completely about Cat God and Captain Ling’s retirement. The club’s door was full of reporters but the two captains weren’t seen. It seemed they left in secret before announcing their retirement.</p><br/><p>A reporter intercepted the new captain Xie Shurong and asked him a question.</p><br/><p>Ah Shu smiled. “I don’t know where Cat God went. I don’t know where Captain Ling went. I don’t even know the relationship between Cat God and Captain Ling.”</p><br/><p>Ah Shu’s ‘I don’t know’ made the reporters very helpless. This person’s skin was too thick and he was invulnerable. It would be difficult to interview Canglan’s new captain in the future!</p><br/><p>On the Wind Colour side, Yan Ruiwen smiled in a good-natured manner. “Sorry, it is an issue of privacy and isn’t convenient to disclose.”</p><br/><p>The messages on Weibo broke through six figures while Li Cangyu and Ling Xuefeng seemed to have evaporated from the world. There was no news everywhere.</p><br/><p>It wasn’t until three days later that Ling Xuefeng and Li Cangyu’s Weibo finally updated.</p><br/><p>Li Cangyu’s Weibo had a photo of a pair of rings and two marriage certificates.</p><br/><p>It was a marriage certificate in English and the two of them overlapped. There was a solemn and sacred church in the background.</p><br/><p>The platinum gold men’s ring was simple and generous and were worn on the ring finger of the two people. The two hands were slender and powerful as they held each other while the photo was taken.</p><br/><p>It was accompanied by a sentence: As an e-sports player, winning the championship has already fulfilled my dream. As a man, being able to find the person you like is the best destination. I am very happy, thank you.”</p><br/><p>Ling Xuefeng forwarded this Weibo post in seconds and also briefly wrote: I love you and am willing to work together with you for a lifetime. There will never be a negative phase.-Cat.</p><br/><p>If Li Cangyu’s Weibo made people unsure who he married, Ling Xuefeng publicly advertised it by forwarding it on Weibo. This practice of ‘declaring his sovereignty’ made people stunned.</p><br/><p>The two great gods who suddenly disappeared actually went to a foreign country to get married!</p><br/><p>This wasn’t simply responding to a dead person, it was scaring them to death!</p><br/><p>No wonder why they didn’t pay attention to the previous rumours. They had long thought about what they should do.</p><br/><p>There was no need to talk nonsense. The pair of rings and two marriage certificates were enough to prove they were each other’s love.</p><br/><p>There was nothing as persuasive as the marriage certificates that Li Cangyu posted.</p><br/><p>This made people think of when Cat God teamed up with Captain Ling to use their big moves in the arena. At the time, the big moves dropped their opponent in seconds. The two people always dealt a blow like this.</p><br/><p>Many contestants in the e-sports circle forwarded the Weibo to express congratulations. Cheng Wei was somewhat unhappy and wrote: Cat God is actually married. You must be good to Cat God in the future or I will go to the United States and kill you!</p><br/><p>Tan Shitian forwarded it and said: Rest assured, Captain Ling doesn’t dare bully Cat God. However, he has to practice his technique of cooking fish again ^_^</p><br/><p>Su Guangmo: The two people really match [Thumbs up].</p><br/><p>Zhang Shaohui: Hahaha, Captain Ling looks very upright. I can’t see him as a couple with Cat God at all!</p><br/><p>Lou Wushuang: What do you see?</p><br/><p>Bai Xuan: Congratulations, please send candy when you come back.</p><br/><p>Xie Shurong: Let’s line up for candy, is there a variety of flavours?</p><br/><p>Qin Mo: Master, happy wedding.</p><br/><p>Xiao Han: Forward Weibo, enjoy together.</p><br/><p>Qin Mo: That’s not how you use ‘enjoy together’!</p><br/><p>***</p><br/><p>This Weibo was forwarded many times and the number of comments was comparable to the official announcement when China won the World Competition. It could be seen that Ling Cat publicly announcing their marriage caused a sensation in the Miracle League.</p><br/><p>However, the owners of the incident had already put away their phones. They were standing in front of a church on the other side of the world and staring at each other like they only had each other.</p><br/><p>Li Cangyu wondered, “Is there anything else you want to say?”</p><br/><p>Ling Xuefeng’s eyes were gentle. “I have already said it when I took the oath at the church. I love you and want to spend a lifetime with you.”</p><br/><p>Li Cangyu sighed. “A lifetime. Ah, I don’t know how many years we can live.” He paused before saying earnestly, “Still, I feel at ease when I think about being around you in the future.”</p><br/><p>Ling Xuefeng nodded. “Me too.”</p><br/><p>The two men smiled and gently hugged each other.</p><br/><p>Over the years, they had spent too much energy on the game and had no time to spend it with the people around them.</p><br/><p>Now they reached the top of the world, won the championship and made a name for themselves. In the following days, they would spend time with the person they loved. This was a great thing.</p><br/><p>***</p><br/><p>[End]</p><br/><p>After the first round of the regular season in the eighth season, the captains of Wind Colour and Canglan announced their retirement and marriage on Weibo. This news filled up the headlines of big e-sports websites in the following period.</p><br/><p>Then the first second round of the regular season started and the audience’s attention was drawn to the events of the major teams.</p><br/><p>It could be said that Li Cangyu and Ling Xuefeng announced their marriage at the right timing. They chose to do it during the holiday to reduce the impact of this incident on the Miracle League’s official events.</p><br/><p>After a full two rounds, the rankings of the major teams fluctuated. The status of Flying Feathers, Time and Ghost Spirits was the most stable and they won the championship, second place and third place. The performance of Wind Colour and Canglan were affected by their captain’s retirement but the growth of the newcomers was very fast. The fans were looking forward to their future.</p><br/><p>The captain of the second national team was Su Guangmo and the vice-captain was Tan Shitian</p><br/><p>The old team members such as Lou Zhang, Yan Guo, Chu Yan, Zhu Qingyue and other masters were successfully selected for the national team. Qin Mo, Xiao Han and Zhuo Hang, the newcomers who participated in the previous session were undoubtedly selected. Surprisingly, the snail Xiaojiang and the madman Gu also became members of the national team.</p><br/><p>Unlike the previous veterans who played as the main force, this national team has many new faces. The average age was three years lower than the previous year. Fans were happy about this because it meant that the Miracle League had more broad development prospects.</p><br/><p>Unlike the previous season, the China team didn’t play the same crushing situation in the first group stage. It was probably because there were too many newcomers. The first group stage match was lost and the latter two games were extremely difficult to win. They finally won a qualifying place by placing second in the group.</p><br/><p>In the quarter finals, they lost two and won three, making the audience nervous and almost suffering from heart attacks.</p><br/><p>The semi finals were a draw and the deciding game was won in a thrilling manner!</p><br/><p>To the surprise of the domestic audience, the national team won the championship again!</p><br/><p>Li Cangyu and Ling Xuefeng had led the team to win the first gold medal. Then Su Guangmo and Tan Shitian led the team to successfully defend their title. This was the most brilliant era of the Chinese Miracle League!</p><br/><p>This day was a carnival for many Miracle fans. Fans who came from afar were cheering excitedly and couldn’t bear to leave. The players of the national team were also crying with excitement.</p><br/><p>Then the domestic audience was surprised to find that as the cameraman moved the camera over to the audience, two long-lost gods could be seen. They were Li Cangyu and Ling Xuefeng.</p><br/><p>The two people were sitting together as they watched the younger generation finish playing on the big stage. Ling Xuefeng still looked serious and his handsome face was like a statue while Li Cangyu had a straightforward smile. Looking closer, their hands were tightly held together.</p><br/><p>Their presence reminded the audience of the First World Competition. In the finals, Li Cangyu gave the opportunity to the new generation captains like Tan Shitian and Su Guangmo while letting everyone play. At the time, many people didn’t understand their intentions but now they did.</p><br/><p>This man was thinking of the long future.</p><br/><p>Perhaps from the moment Li Cangyu became the captain of the national team, he was ready to retire. Over the course of the entire World Competition, he tried his best to give commanding opportunities to Su, Tan and Lou. After he left, the national team would have successors. The national team might be immature this year but Su Guangmo, Tan Shitian and Lou Wushuang could already stand alone. It might be hard when facing the old rivals of South Korea and the United States but they finally found surprising ways to win.</p><br/><p>Li Cangyu had laid the most solid foundation for all of this.</p><br/><p>Many people who weren’t fans of Cat God finally understood that even if this man retired and married another man, he was still respected by the players in the e-sports circle.</p><br/><p>No one said anything bad about him. Every time the players mentioned Cat God, they expressed admiration that came from their heart. It was because he not only won a world competition but created an era.</p><br/><p>***</p><br/><p>They might’ve already retired behind the scenes but the appearance of Li Cangyu and Ling Xuefeng still received warm applause from the audience.</p><br/><p>Commentator Yu Bing was so excited that she almost choked up. “We can see that Cat God and Captain Ling came to the venue today! It has been a long time since we’ve seen them! After the two gods retired, they must’ve been very good. Looking at Cat God’s face, he seems a bit fatter?”</p><br/><p>Kou Hongyi smiled. “The level of the fish cooked by Captain Ling is said to be comparable to a five star hotel. Cat God eats fish every day and doesn’t have to work hard to lead the game. He is a little chubbier than before but he is still very handsome!”</p><br/><p>Since retiring, no reporters dared to interfere with their daily lives. They only occasionally appeared at some major events and tried to keep a low profile.</p><br/><p>For example, today after being captured by the camera, Li Cangyu just smiled before turning away with Ling Xuefeng. It was because he didn’t want to take up too many attention. The honor at this time should belong to the younger generation.</p><br/><p>He left the venue with Ling Xuefeng.</p><br/><p>There were many legends about them in the Miracle League but people only knew they were doing very well.</p><br/><p>In their lives, there were no shadows about the field. All that remained was the happiness and tranquillity of working together for a lifetime.</p><br/><p>-【 The End 】-</p><br/>\n</div>"}