{"title": "Book 1-1.8", "id": 8, "volume": 1, "url": "http://boxnovel.org/red-storm-book-1-18", "volume_title": "Volume 1", "body": "<h1>Book 1-1.8</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Book 1-1.8 Path of becoming a Glow</p><br/><p>A smile automatically appeared on Baguna’s face thinking about that time. He was extremely proud of his son.</p><br/><p>“Why are you suddenly smiling while playing Yulta (a board game played by the desert tribes, similar to chess with 20 horses)?”</p><br/><p>Chun Myung Hoon was confused as Baguna suddenly started smiling while playing Yulta.</p><br/><p>“I am smiling because I am extremely happy that my son is being taught by such a great master.”</p><br/><p>Chun Myung Hoon didn’t act modest and responded as if it was natural.</p><br/><p>“I’m trying my best but I am just a bit disappointed that he is so slow. If he was a little smarter or had a bit more potential, I’m sure we would have already started to see some results.Tsk. Tsk. Tsk.”</p><br/><p>Even though he was clicking his tongue and making fun of his son, rather than frowning, Baguna agreed with Chun Myung Hoon.</p><br/><p>“I must apologize. I thought he was actually pretty smart, but didn’t know he was such a slow kid.”</p><br/><p>“Well, it’ll work out if I give him a little more attention and put in some more effort. Glow, you have nothing to worry about.”</p><br/><p>As Chun Myung Hoon said that while leisurely capturing one of his horses, Baguna responded back, taking the horse Chun Myung Hoon used to capture his piece.</p><br/><p>“All I can do is have faith. I’m sure you will do whatever you need to do.”</p><br/><p>The two of their hand movements became faster.</p><br/><p>“Aigoo!”</p><br/><p>Baguna blurted out loud, as if he was surprised at Chun Myung Hoon’s move. Before he knew it, Chun Myung Hoon’s horse was aiming at his Glow horse (King piece).</p><br/><p>“I was the one who taught you the game, but you’ve won every game from the start. How are you so good at this game?”</p><br/><p>As Baguna shook his head while admitting defeat, Chun Myung Hoon laughed as he responded:</p><br/><p>“The goal of Yulta is to catch the opponents Glow Horse to end the game. That means all the other horses just have to move with that goal in mind. Do you even need a strategy?”</p><br/><p>Listening to Chun Myung Hoon respond as if he was asking a dumb question, Baguna had an awkward smile on his face as he asked further:</p><br/><p>“I’m asking how you have to move the pieces.”</p><br/><p>Chun Myung Hoon could not understand. Compared to Badook that he enjoyed played in China, Yulta was extremely simple.</p><br/><p>It was at this point that Yulian entered the Paoe. As if he came up with an idea, Chun Myung Hoon called Yulian over to sit.</p><br/><p>“Come sit over here.”</p><br/><p>Hearing Chun Myung Hoon’s instruction, Yulian quickly came and sat down next to Baguna. Chun Myung Hoon started back and forth between Yulian and Baguna, then started to speak.</p><br/><p>“You didn’t understand my explanation, right? Thinking about it, I thought it would be good for Yulian to hear as well. That’s why I had him sit down.”</p><br/><p>Not knowing what was going on, Yulian looked back and forth at his father and his master. Baguna quickly whispered in Yulian’s ear:</p><br/><p>“He plays Yulta so well that I asked him what the secret it.”</p><br/><p>As Yulian nodded his head, Chun Myung Hoon started to move the pieces back to their starting positions.</p><br/><p>“Yulta is just a game. There are no lives at stake, so it’s easy to move your horses. Even if I only had my Glow Horse left, as long as I catch the opponent’s Glow Horse, doesn’t that mean I win?”</p><br/><p>The father and son duo both nodded their heads.</p><br/><p>“Then what kind of strategy needs to be there? Even if it is at the cost of all of my horses, all I have to do is catch the opponent’s Glow. I don’t want to sacrifice this warrior horse. If I do this, my horse will die. There’s no reason to think like that. What is important is knowing that my movement increases my chances of catching the opponent’s Glow.”</p><br/><p>Chun Myung Hoon thought for a bit before continuing.</p><br/><p>“Even more, people make mistakes and there can be a difference in level, but in Yulta, even the pawn can eat up the opponent’s best warrior given the right circumstances. Right?”</p><br/><p>“Yes, that is true.”</p><br/><p>Baguna responded as Chun Myung Hoon continued.</p><br/><p>“Don’t put real life strategy into Yulta. In real life, the method I described would be one only done by an evil dictator. In games, it’s fine for the Glow to be the only one left standing. In real life… I don’t think that’ll be good…”</p><br/><p>Yulian and Baguna were carefully considering Chun Myung Hoon’s words. They did not expect him to compare Yulta to real life.</p><br/><p>Yulian asked:</p><br/><p>“Is there a way to protect your horses while still winning?”</p><br/><p>Chun Myung Hoon answered, as if he was waiting for that question.</p><br/><p>His disciple is someone who will rule over thousands of Pareian tribe members.</p><br/><p>He was in a similar situation as the head of hundreds of believers. He wanted to use this opportunity to how scary that responsibility could be.</p><br/><p>“In Yulta, it is impossible. However, in real life, it is possible.”</p><br/><p>Yulian kneeled on his knees and respectfully responded.</p><br/><p>“I will keep your lesson in mind.”</p><br/><p>Listening to Yulian’s response, Baguna also changed his laid-back posture. As you could tell by his title of “Baguna the Wise,” Baguna was smart and truly cared for his people. If there was something he could learn from this knowledgeable outsider guest, he would have no problem kneeling like Yulian.</p><br/><p>“In Yulta, once the Glow dies, everything ends. However, in the real world, even if the Glow dies, it is not the end. Rather, it could even be considered a new beginning. What do you think a Glow is?”</p><br/><p>“The light of the tribe.”</p><br/><p>“How do you plan to shine your light?”</p><br/><p>“I plan to do everything to put my people first.”</p><br/><p>“That is wrong.”</p><br/><p>Chun Myung Hoon quickly shot down Yulian’s answer and responded.</p><br/><p>“Didn’t I tell you before that a Glow who does not cherish himself cannot cherish his people?”</p><br/><p>“Then…”</p><br/><p>As Yulian was struggling, Chun Myung Hoon looked over to Baguna.</p><br/><p>Baguna had also thought things through carefully before answering.</p><br/><p>“I would rule myself and rule my people.”</p><br/><p>“As expected, a beautiful answer.”</p><br/><p>Seeing Chun Myung Hoon smile at his father’s answer, Yulian asked:</p><br/><p>“Master, what does a Glow mean to you?”</p><br/><p>“For me, a Glow, King, the head of a tribe, they are all the same. In their existence, they are able to maintain the balance. They stand firm and endure without faltering.”</p><br/><p>“Does that shine light?”</p><br/><p>“You’re looking at it like it is easy. To maintain balance by existing, is a heavy and difficult thing to do.”</p><br/><p>Chun Myung Hoon reflected back on his past.</p><br/><p>Although he was talking like that, in the past, he was someone who was having difficulties in a battle against himself. Wasn’t that why he gave his life to Miruk?</p><br/><p>Maybe he was regretting that decision. There was a sudden passion in his voice.</p><br/><p>“In every tribe, if there are good people, there will be bad people. If there are hasty people, there will be calm people. If there are smart people, there will be dumb people.”</p><br/><p>Baguna nodded his head as if he understood the moral of Chun Myung Hoon’s lesson. As Yulian tilted his head in confusion, Chun Myung Hoon asked a question.</p><br/><p>“Imagine there is a good person and a bad person in front of you. Both of them are great warriors. Which one would you bring with you to battle?”</p><br/><p>“Of course the good person.”</p><br/><p>Chun Myung Hoon shook his head at Yulian’s quick and definite answer.</p><br/><p>“Wrong. You must bring both of them. I will ask another question. You have a smart person and a dumb person. You have a problem and need to ask someone for help. Who do you ask for help?”</p><br/><p>“Of course the smart person.”</p><br/><p>“Smack.”</p><br/><p>Chun Myung Hoon had flicked a Yulta piece and struck Yulian on the forehead.</p><br/><p>“Ow!”</p><br/><p>Yulian quickly yelled and rubbed his forehead with his hand.</p><br/><p>“You really need to think before answering. Is your master the type of person who would ask such simple questions? Furthermore, how could you make such definite decisions so quickly? How could you maintain balance like that?!”</p><br/><p>Yulian could sense a light bulb go off in his head from Chun Myung Hoon’s words.</p><br/><p>“Oh!”</p><br/><p>After thinking for a long while, Yulian finally figured it out. Chun Myung Hoon was pleased and asked:</p><br/><p>“Did you figure it out?”</p><br/><p>“Yes, master.”</p><br/><p>“I’m glad. I was worried because you are a little slow, but you should at least recognize the weight of your future responsibilities.”</p><br/><p>“Master…”</p><br/><p>As Yulian tried to complain about being called slow (dumb), Chun Myung Hoon looked at Baguna, smiled, and spoke again to Yulian.</p><br/><p>“There are many different paths to being a King. As you mentioned, there are the kings who think about their people first. At the same time, there are the kings who rule themselves and rule their people. And there is the type I described, the ones who can maintain the balance. In the world, if there is black, there is white, when there is cold, there is hot. Everything in the world has two sides, how can you shine the light without taking care of the darkness?”</p><br/><p>Chun Myung Hoon briefly stopped speaking before slowly continuing.</p><br/><p>“This is the type of Glow I am thinking about.”</p><br/><p>Chun Myung Hoon’s words deeply affected Yulian. He had been bestowed great wisdom.</p><br/><p>Yulian bent over while still on his knees and kowtowed to thank his master for the lesson.</p><br/><p>‘This is the path I must take. To maintain balance by existing. I will definitely become that type of person.’</p><br/><p>Yulian had taken one step towards the path of becoming a Glow.</p><br/><p>Translator’s note:</p><br/><p>With this chapter, we have finished the first section labeled “The Old Man.”</p><br/><p>Next up:</p><br/><p>The coming of age ceremony.</p><br/><p>I felt the blessing of the gods enter my body.</p><br/>\n</div>"}