{"title": "Book 1-2.5", "id": 13, "volume": 1, "url": "http://boxnovel.org/red-storm-book-1-25", "volume_title": "Volume 1", "body": "<h1>Book 1-2.5</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Book 1-2.5 The Red Dragon</p><br/><p>As soon as Yulian stood up, he felt a slight vibration under his feet.</p><br/><p>‘It’s them.’</p><br/><p>Yulian confirmed that the vibrations were happening because Sand Dragons were nearby. Among the monsters that live in the sand, there are the Spec (a ball-shaped monster that moves around inside the sand to hunt small animals) and the Gorias (a turtle-like monster living in the sand), but since neither of those could cause such vibrations even when moving in a giant herd, Yulian was able to determine that the vibration was caused by the Sand Dragon.</p><br/><p>“Let’s go.”</p><br/><p>Now that Yulian knew it was nearby, he started to head at full speed on top of the Pirma. When he traveled for about ten minutes?</p><br/><p>“Oh! Unbelievable!”</p><br/><p>Yulian was astonished by the sight in front of his eyes.</p><br/><p>Even though a part of its body was still in the sand, it still shot up as high as the sky. Even on the small end it was at least ten meters long. Thinking about the remaining body still stuck underneath the sand, he could not even fathom just how long it truly was.</p><br/><p>It was the Sand Dragon he had been looking for. He had finally found it.</p><br/><p>There were three of these Sand Dragons tangled together like tree roots as they shot up. Yulian gasped in shock staring at the three heads, which looked like large fruits. Momentarily, he even thought about backing away.</p><br/><p>Even though he was confident, he thought it would be impossible with three of them together. He had thought about first running away, and then roaming around this area, taking them down one by one.</p><br/><p>Crrrrrrr. Craaaaaaaaaaaak!</p><br/><p>As Yulian made his decision and turned the Pirma around to run away, he heard a loud noise that vibrated across the desert, making him turn his head.</p><br/><p>“What the!”</p><br/><p>A funny sight came into his view. The two dark red Sand Dragons were trying to bite the one red Sand Dragon.</p><br/><p>The red Sand Dragon started twisting its body left and right and moved its head to try to avoid the two attacks, but it was difficult since their bodies were tangled together.</p><br/><p>However, it looked like the red Sand Dragon was a strong one; even though it was getting hit and bitten everywhere by the two dark red Sand Dragons, it did not receive a critical blow and was able to endure.</p><br/><p>But as time passed, it’s movements started to become dull, and it was certain that the dark red Sand Dragons will end up winning in the end.</p><br/><p>What just went through Yulian’s mind?</p><br/><p>Yulian turned his Pirma back around and started to head towards the location the three Sand Dragons were fighting. As he started to get closer, the Pirma became frightened of these desert monsters and stopping moving. When that happened, Yulian got off the Pirma and put his two greatswords across his shoulders.</p><br/><p>“Haaaaaaaaaaa!”</p><br/><p>With a loud noise Yulian’s body quickly headed towards the location where the three Sand Dragons were fighting.</p><br/><p>Craaaaaaaaaa!</p><br/><p>The three Sand Dragons were too busy brutally fighting with each other to notice Yulian approaching underneath them.</p><br/><p>“Just pretend I am cutting down a tree. A gigantic tree that is three meters wide.”</p><br/><p>Yulian mumbled to himself as he looked up to stare above him.</p><br/><p>“Since they are tangled together, they should not be able to get free until the body falls over.”</p><br/><p>This was what you call the fisherman’s gain. Yulian was giddy as he thought about the term his master had taught him. (TL: It’s a Korean saying that states that when two parties are fighting, a third party can benefit without putting much work. It’s called the fisherman’s gain because how it is described is that a bird tries to eat the meat of a clam and sticks its beak inside, but as soon as it sticks it in, the claim tightens itself and won’t let go of the bird. While they are fighting, the fisherman is able to catch both of them).</p><br/><p>Crack. Crack.</p><br/><p>Yulian swung his greatsword as if he was leisurely stretching. He twisted his hips as much as possible, and once the two greatswords were parallel to the ground, Yulian quickly untwisted his hips as he swung his sword.</p><br/><p>Slaaaaaaaaash.</p><br/><p>Yulian’s large greatsword went into the body as if it finally met a worthy opponent.</p><br/><p>“Guoooo!”</p><br/><p>The moment he heard a piercing noise that felt like it would break his eardrums, the two greatswords showed themselves again, dropping large drops of blood onto the sandy floor as if to show that they completed their mission.</p><br/><p>“It’s not time for me to slow down.”</p><br/><p>Without even a moment to look cool, Yulian swung his hips again.</p><br/><p>‘This time, the red one.’</p><br/><p>Yulian made up his mind. Even in cutting them up, there was an order.</p><br/><p>He didn’t know if monsters had that type of mentality too, but anybody could see that the two dark red Sand Dragons were allies. In that case, it made sense to cut up one of them first. Next was the red one, since it looked like the strongest of the three.</p><br/><p>Once he does that, he should be able to take on the last one with his own abilities without attacking stealthily like this.</p><br/><p>That was the image Yulian drew up in his head, and he was about to draw the second image.</p><br/><p>Twist.</p><br/><p>The Sand Dragons had fast reactions. Even though they were busy fighting with each other, as one fell away, they quickly untangled themselves.</p><br/><p>At that moment, Yulian ended up seeing it. The red Sand Dragon, which looked to be the strongest, quickly spread open its wings. The wings were glorious and looked to be at least fifteen meters wide.</p><br/><p>“There’s no way…”</p><br/><p>Yulian remembered reading about this in one of the continent’s books. There was even an image in that book that matched the red dragon in front of him, and he vividly remembered that image even today.</p><br/><p>“A real dragon?”</p><br/><p>As Yulian shouted in shock, the Red Dragon used its large claws to rip apart the Sand Dragon.</p><br/><p>As if it was finally paying back all of its grudges, it ripped the Sand Dragon apart like it wanted to make it into thin strands of yarn. Yulian almost fell down on the ground in shock.</p><br/><p>The pressure given off by this monster known as the dragon was beyond imagination, and when the Red Dragon landed on the ground and tilted its head to look at Yulian, he even felt like he wanted to die.</p><br/><p>“Haaaaaaa!”</p><br/><p>Yulian pushed out all his energy to stand up, let out his force and crossed the two greatswords in front of him.</p><br/><p>The strength of the force was weak and did not cause any damage to the monster, but at least he was able to get rid of the fear inside of him.</p><br/><p>“Puk.”</p><br/><p>As a consequence to letting out all of his force, he was starting to bleed dark red blood from his mouth.</p><br/><p>At this moment, he felt a gushing wind come from behind him and he felt like his body was lifted up before he fell down on his butt. In front of his eyes, there was a person who looked greater than anybody else.</p><br/><p>“Master.”</p><br/><p>It was none other than Chun Myung Hoon who stood between Yulian and the Red Dragon.</p><br/><p>“For an insect, you have quite the force.”</p><br/><p>Chun Myung Hoon deliberately ignored Yulian’s calling and yelled at the dragon. The dragon looked at Chun Myung Hoon as if it was amused.</p><br/><p>“Master.”</p><br/><p>Yulian jumped up and stood next to his master. Chun Myung Hoon raised his hand to shut him up.</p><br/><p>This monster had a force greater than he imagined, and one that was no weaker than himself at full force. It was not comparable to the thousand year old Leviathan he took care of in China.</p><br/><p>Chun Myung Hoon said to Yulian:</p><br/><p>“I thought it was a worm but it seems like it’s actually a dangerous insect. With your level of force, it’ll be difficult to even stand here so go stand far away.”</p><br/><p>Yulian knew that his master was right, but how could he run away alone and leave his great master here?</p><br/><p>Especially when his master came here for him.</p><br/><p>“How could I leave my master and run away by myself? I would rather give my life to save…”</p><br/><p>Hearing Yulian’s words Chun Myung Hoon turned his head to look at Yulian in disbelief.</p><br/><p>“You...you don’t think that I’ll be killed by that insect, do you?”</p><br/>\n</div>"}