{"title": "Book 1-4.4", "id": 22, "volume": 1, "url": "http://boxnovel.org/red-storm-book-1-44", "volume_title": "Volume 1", "body": "<h1>Book 1-4.4</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Book 1-4.4 The Iron Princess</p><br/><p>Grace got along with everybody. Of course, she got along with the current Mother of Pareia Seina, but it did not take long for her to have a mother-daughter type relationship with the difficult Librie as well.</p><br/><p>Even the stoic Pere, as if he was overcome by her persistence, would focus on avoiding Grace whenever he saw her.</p><br/><p>This was because he did not want to call her “sister-in-law.” That was how magnificent Grace’s level of affinity was with other people.</p><br/><p>It took her exactly two months to understand the dynamics of the family, and Grace’s next task was focusing on the relationships with the powerful families of Pareia.</p><br/><p>The powerful families of Pareia were similar to what the continent would consider to be their nobles.</p><br/><p>The Provoke family maintained and protected the largest Oasis in Pareia; the remaining ten oasis were protected by the other noble families.</p><br/><p>Due to this, even as the family of the Glow, the relationship with these other families were very important.</p><br/><p>Across multiple generations, the Provoke family was able to maintain the position of Glow because they had the unwavering support of these noble families.</p><br/><p>However, if any generation’s Glow of the Provoke family did not perform to their standards, the position of Glow would be transferred to a different family. As such, they needed to treat them well.</p><br/><p>As Grace was officially the wife of the Young Glow, she accompanied Seina on her tour across the Oasis.</p><br/><p>The Glow was responsible for the outer tasks such as protecting the tribe and increasing their territory, while the internal affairs were taken care of by the Mother of Pareia and each of the noble families’ wives.</p><br/><p>During this visit, Seina will hear about the issues each individual oasis is facing, and after thinking through everything she heard, she would discuss with Glow Baguna before proposing a course of action.</p><br/><p>In order to learn that, as well as become familiar with each noble family’s faces, Grace pestered Seina until Seina agreed to let her come along.</p><br/><p>Even at each of the oasis, Grace’s popularity was astounding.</p><br/><p>Not only was she as beautiful as the former Mother of Pareia, Mairez, she had many other similarities to Mairez, such as listening to the concerns of others and empathizing with them. If there was to be a difference, Mairez was quiet and calm while strong, while Grace was active and full of energy.</p><br/><p>Seeing Grace find their itchy spot and scratch it for them, many of the nobles welcomed her with open arms.</p><br/><p>Grace Nellisi truly earned her position on her own, showing that she was able to adjust to Pareia perfectly, and she was living a life that was proudly showing her abilities to be the future Mother of Pareia.</p><br/><p>“I believe most of the issues have been resolved. I guess I will have some time for myself now.”</p><br/><p>“If you keep working that way, you may get hurt. There is no reason for you to decrease your sleep time as well. Lighten your load a little.”</p><br/><p>As Yulian brushed Grace’s red hair while sharing his concerns, Grace leaned into Yulian’s chest and let out a bright smile.</p><br/><p>“I am not tired. I am extremely happy, and there is significant reward to this work.”</p><br/><p>Yulian found Grace to be so loveable and hugged her tightly.</p><br/><p>“Then at least for my sake, please take care of yourself. For our next generation as well.”</p><br/><p>Yulian, who used to be so shy seemed to have matured a bit with that proclamation.</p><br/><p>As if she suddenly thought of something, Grace left Yulian’s embrace before speaking.</p><br/><p>“Now that I think about it, are you not planning to have any concubines?”</p><br/><p>“What the… what are you talking about?”</p><br/><p>Yulian responded in shock and Grace made an expression of confusion.</p><br/><p>“Why are you so surprised?”</p><br/><p>“It has not even been a year since I was married to you. Furthermore, I have no interest in that.”</p><br/><p>“I’m the one who should be asking what YOU are talking about. As a man, of course you must have concubines. Especially since you are the Young Glow.”</p><br/><p>Yulian didn’t know how to respond to Grace.</p><br/><p>“That is a problem for the future, not now. Even my father waited five years after marrying my mother before marrying mother Seina. From the sounds of it, if I had been born earlier, he may not have married Mother Seina.”</p><br/><p>“That is your father’s problem, and since he now has three sons, that is no longer a concern.”</p><br/><p>The male to female ratio in the desert was extremely skewed. This was why each tribe was proposing that warriors take many wives.</p><br/><p>Due to intense wars, the male-female ratio was at an extreme rate of 1 to 5, and since a tribe’s strength was determined by how many men were in the tribe, it was true that having many wives and many children directly impacted the strength of the tribe.</p><br/><p>“In terms of the excellent bloodline of the Glow, the more children you have, the more stable it becomes.”</p><br/><p>Grace was an amazing woman. Not anyone would be able to tell their husbands to have more children, even if it was with other women.</p><br/><p>“Let’s talk about that later. Later. Not yet. You can understand that much, right?”</p><br/><p>Grace decided that it may be better to take one step back and answered.</p><br/><p>“Yes, we will discuss this later. Oh, I have a favor to ask of you.”</p><br/><p>“What is it?”</p><br/><p>In order to change the conversation, Yulian quickly asked.</p><br/><p>“Please allow me to participate in Red Storm’s training.”</p><br/><p>“No.”</p><br/><p>“I’ve already told the warriors that once I became your wife, I will participate with them. Are you going to make me a liar?”</p><br/><p>“No means no. Even if it is you, Red Storm’s training is too difficult for a woman.”</p><br/><p>“I’ve already seen it and made my resolution.”</p><br/><p>“No. I will never allow it. Please listen to me this time.”</p><br/><p>Grace frowned and asked.</p><br/><p>“Are you going to make your wife a woman who tells lies? Me, the future Mother of Pareia?”</p><br/><p>Yulian was anxious. He could vaguely recall Grace saying something similar. However, to train together… the intensity of Red Storms’ training was getting stronger and stronger. At their current level, even veteran warriors may not be able to keep up. But to include his precious wife in the training? It was not something Yulian can allow.</p><br/><p>“You know that’s not it. As you mentioned, you are now an important person of Pareia. What if you get hurt? What if you end up in danger? And what if I am not able to focus and train properly because you are there?”</p><br/><p>“I told you I’ve made up my mind. I know the importance of my body more than anybody else. I will be careful. I will make sure I don’t cause you any burdens.”</p><br/><p>Yulian continued to dissuade her, but Grace, who was easygoing about everything else, was extremely stubborn about this.</p><br/><p>“Please do not see me as just a woman. At least in times like this, I wish you will treat me as a warrior. Won’t you be more relaxed when you leave the oasis knowing that I am strong?”</p><br/><p>“No.”</p><br/><p>“You can help me. You have that much ability.”</p><br/><p>Yulian ended up losing to Grace. Her puppy dog eyes and words were something any man would find difficult.</p><br/><p>“Sigh, fine...however, if you ever want to quit, just quit. Even if the Red Storm warriors are happy about your curiosity, they will be nervous if you participate in the training. You will admit that it will disrupt their training if they see you having a hard time?</p><br/><p>Grace nodded her head widely and started to hang onto Yulian’s arm.</p><br/><p>“Only for a while. Minimally, I want to create a friendly relationship with the warriors under your command. Truthfully speaking, the day you become the Glow, i will also not be able to do as I please because of the position of Mother of Pareia.”</p><br/><p>Listening to her, Yulian decided to pass on the martial arts and properly teach her the mental arts as well. No matter how angry his master may be, there was no way he could not like Grace. As such, Yulian thought that his master would forgive him.</p><br/><p>‘Regarding this part, I need to inform Grace ahead of time. That way, even when my master returns, my neck will stay attached to my head.’</p><br/><p>That was the thought going through Yulian’s head.</p><br/><p>Grace did not go against her word. Starting the next day, she started to train together with the Red Storm warriors. Although Yulian was extremely nervous, Grace participated in the difficult training with a calm look on her face.</p><br/><p>However, the greatswords were of course too much for her, so she participated with her original weapon, the Sosoonta. Even so, the training was still extremely difficult.</p><br/><p>However, whether it was in the training ground or at home, Grace never said it was too hard.</p><br/><p>Of course her physique and strength was weak compared to the Red Storm warriors, but she had agility and perseverance, and was a woman who shared the same passion as the warriors.</p><br/><p>Even if she took longer to learn compared to other warriors, Grace dedicated herself to the training, even staying up all night if she had to do so to finish the daily training amount.</p><br/><p>This was why Grace Nellisi started to receive the nickname “Iron Princess” and the “Real Conqueror of the Desert.”</p><br/><p>Next up:</p><br/><p>The Monster’s Desert</p><br/><p>The second time. He was alone back then but now, powerful warriors were by his side.</p><br/>\n</div>"}