{"title": "Book 1-6.1", "id": 32, "volume": 1, "url": "http://boxnovel.org/red-storm-book-1-61", "volume_title": "Volume 1", "body": "<h1>Book 1-6.1</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Conspiracy</strong></p><br/><p><em>Please get rid of him.</em></p><br/><p>Book 1-6.1 Discussions with the Empire (I)</p><br/><p>For many years, the desert was peaceful. Even Pareia and Shuarei, who would fight each other so often that if they didn’t fight for a month it would be considered a miracle, were oddly not fighting with each other. Anybody who knew the desert well would be thinking that this was very peculiar. It was not something they had seen in fifty years.</p><br/><p>Thanks to the sudden peace, the desert tribes could focus on external more than internal, so to be specific, they could focus on the Eastern and Western continents. That was a very important job.</p><br/><p>The people they would pay tribute to would change based on who was the strongest force on the continent. Even if they are all terrible people, it was still better to work with someone they knew even a little bit. If the power ended up changing, the relationship they would have built up until then would all fall apart. As a result, many were hoping for the status quo to remain.</p><br/><p>The situation in the Eastern Continent was pretty severe. War was ready to break out between the Rojini Kingdom and the Silence Empire, which would be considered the strongest force even with the Eastern and Western continents combined.</p><br/><p>If the two large powers were to go into war, that essentially meant that a continental war would result from it. The two powers ruled over many areas, and because the two powers shared a complicated alliance with each other, the cause of the war was never determined. However, it was most likely the case that the Silence Empire first started the war, as they were afraid of a takeover by the Rojini kingdom, that was gaining strength day after day.</p><br/><p>“Oombambaba, oombambaba.”</p><br/><p>A humming noise on beat with the rhythm.</p><br/><p>The desert warriors created a large circle with a bonfire in the middle and danced around it, stomping their feet and waiving their arms.</p><br/><p>The warriors’ dance that was full of laughter and passion.</p><br/><p>People were laughing and chatting. Even while living a difficult life, people knew how to enjoy these types of celebrations.</p><br/><p>At the moment three moons were up high in the sky, there were some people plotting with each other in secret. However, the desert night was dark.</p><br/><p>“How much longer must we wait?”</p><br/><p>A person wearing many layers of thick veil from underneath their eyes asked. Listening to the voice, it seemed like a woman and not a man.</p><br/><p>The large man responded.</p><br/><p>“The Glow is healthy, so why are you so rushed? Just wait. The matters of the kingdom are complicated right now so we can’t apply any pressure.”</p><br/><p>“The first-born’s influence is starting to get much stronger. If it continues like this, we won’t be able to do anything at all.”</p><br/><p>The man waived his hand downward, as if telling the woman, who was speaking in an impatient manner, to calm down.</p><br/><p>“Just wait. I am trying my best as well.”</p><br/><p>“Don’t forget. The first-born has dreams about unifying the desert. If he becomes the Glow, even you can’t claim that you’ll be in a better situation than you are in now.”</p><br/><p>“Isn’t that why I am helping push you forward, madam?”</p><br/><p>“Please hurry and put some pressure on him. Take care of him even one day faster if you can.”</p><br/><p>“Don’t worry about it. I’ll do my best to make madam’s wish come true before the year is over.”</p><br/><p>The woman wearing the veil stood up from her seat and did not forget to say one last thing before she left.</p><br/><p>“I will be waiting. Don’t forget. He is continuing to get stronger every day.”</p><br/><p>As the woman walked out of her paoe, the man let out a scoff before leisurely pouring and drinking alcohol while muttering.</p><br/><p>“It’s because there is conflict within the desert, as well as internally within the tribes that even with this much national power, they end up as our meal. So sad.”</p><br/><p>The laugh of the man who was considering the desert to be the mouse while the kingdoms were the cat started to get deeper and deeper…</p><br/><p>-------------------------------------------------------------------------------------------------------------------------------</p><br/><p>‘Damn it. That bastard who is full of crap.’</p><br/><p>Yulian was pouring all sorts of swear words at the fatty in front of him.</p><br/><p>For his father, Glow Baguna’s forty-ninth birthday, the Silence Empire, as a gesture of celebration, sent the damned fatty, Janet Le Borrea, to visit them.</p><br/><p>Although they should be thankful that he came to visit, rather than being a gesture of celebration, he was more like a bandit who came to forcefully rob the tribe.</p><br/><p>Not only was he asking for an increase in the amount of black water, now, he was even asking them to provide warriors to fight on their behalf. Yulian was so angry he wanted to rip open the fatty’s stomach to see how much oil would flow out of it.</p><br/><p>“In return, we will provide you with twice the amount of iron. I look forward to Glow Baguna-nim’s wise decision.”</p><br/><p>Glow Baguna must have been extremely agitated at Janet’s words as well, as he started to shout.</p><br/><p>“Our warriors are not cheap mercenaries for the continent! The warriors fight for the tribe and to protect their pride, not for that type of materialistic gain.”</p><br/><p>Janet continued to smile as he tried to convince Baguna.</p><br/><p>“This is for the sake of the powerful Pareia tribe as well.”</p><br/><p>“How is our warriors shedding blood for your Empire to our benefit!”</p><br/><p>As Yulian could not hold back and shouted at Janet, Janet bowed towards Yulian before answering.</p><br/><p>“Dear Young Glow who will become the desert conqueror as him name indicates, please think about it deeply before becoming angry. This is a war that our great Silence Empire will win in the end. At the end of the war, our great Silence Empire will remember it like this. The strong Pareia tribe of the desert shed their blood for our Empire.”</p><br/><p>‘Even then you will continue to do whatever you please.’</p><br/><p>Yulian was thinking like that internally before coldly asking.</p><br/><p>“And?”</p><br/><p>It’ll not be just a trading relationship but one where blood was shed for the other. Do you think our Silence Empire will just sit back and watch the future battles between Pareia and Shuarei? Of course not. At that time, our powerful cavalry and magicians would support Pareia.”</p><br/><p>Janet’s words could seem very tempting if you think about it, however, Glow Baguna shook his head in Yulian’s place.</p><br/><p>“There are no tribes who pull in the powers of the continent for the wars of the desert. The wars of the desert are for the people of the desert. And if we are being honest with each other, we have no warriors we can lend for your need. If we had warriors to spare, we would definitely help our friends the Silence Empire, however, we are currently in a situation where we cannot move any of our warriors.”</p><br/><p>“Glow Baguna, this is an opportunity. Other than Pareia, the rest of the areas under our Empire’s control are itching to provide the most assistance to our empire. The reason this type of opportunity has presented itself is because of the strength and valiancy of the Pareia warriors. Please consider this carefully. Wouldn’t it all come back later?”</p><br/><p>There was a bone hidden in Janet’s friendly words.</p><br/><p>‘Will return later? These bastards are now plainly threatening us.’</p><br/><p>Baguna clenched his fists tightly underneath the table.</p><br/><p>If Pareia’s most eastern Oasis was not so close to the border of the Silence Empire, he would be able to strongly push back, however, that was not the case.</p><br/><p>The desert is a difficult place to attack, however, the Eastern Oasis was so close to the border that it would not be impossible to raid it.</p><br/><p>“I will think about it.”</p><br/><p>At Baguna’s answer, Janet smiled inside. There was just one more issue to bring up.</p><br/><p>“Now I have something to ask regarding the Young Glow……”</p><br/><p>As his name came out of Janet’s mouth, Yulian and Baguna paid careful attention to see what else Janet had to say.</p><br/><p>“Isn’t the Young Glow the person who will eventually follow the footsteps of Glow Baguna? Then while Glow Baguna is still healthy, why not send the Young Glow to our Silence Empire to study abroad surrounded by advanced technology and literature?”</p><br/><p>Baguna’s insides were starting to boil. They were calling it studying abroad, but wasn’t this their way of saying they will hold Yulian hostage?</p><br/><p>“Do you think that makes sense?”</p><br/><p>“I can guarantee that the Young Glow will see many new things and learn a lot. I am saying this thinking about Pareia’s future. Please don’t take it the wrong way.”</p><br/><p>“There are still many things that he has not seen and learned in the desert. Furthermore, Yulian is, as you said, the Young Glow. That holds a special meaning to us in Pareia.”</p><br/><p>“Glow Baguna, please think about……”</p><br/><p>As Janet was trying to use elaborate and complicated words to convince Baguna, the young man who had been sitting next to him with an expression full of complaint spoke as if he was shouting.</p><br/><p>“Damn, you have a lot to say! You barbarians dare to disregard the good will of our Silence Empire!”</p><br/><p>Listening to the young man’s words, Janet’s smiling expression, which had become perfect after years of experience, cracked.</p><br/><p>Janet’s face even turned pale as he looked back and forth at Baguna and Yulian while feeling like he was walking on eggshells.</p><br/><p>“Your highness, prince, your words……, the valiancy of Pareia crosses the desert to reach all the way to our Silence Empire. Such excessive words……”</p><br/><p>“Quiet, Janet. I only heard about Pareia after being forced to come here at my brother’s command. Furthermore, we came here to order, not to request like this.”</p><br/><p>Janet felt his world crumbling as he started to curse the Crown Prince, Shaone Fury Silence III, who ordered the immature second prince to go with him.</p><br/>\n</div>"}