{"title": "Book 1-6.4", "id": 35, "volume": 1, "url": "http://boxnovel.org/red-storm-book-1-64", "volume_title": "Volume 1", "body": "<h1>Book 1-6.4</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Book 1-6.4 Incident with the Prince (II)</p><br/><p>The person swinging his two greatswords and using just the pressure from it to push back both the knights and the warriors was Yulian, who now stood in between the two groups.</p><br/><p>Seeing Grace holding her Sosoontas in her hands, Yulian asked.</p><br/><p>“Madam, what is going on?”</p><br/><p>Since they were in front of other people, Yulian addressed Grace in a respectful way as he asked.</p><br/><p>Grace knew that if she honestly told him what happened, a serious incident would occur. After all, she knew her husband’s strength better than anyone.</p><br/><p>His strength was one that made it hard to believe he was human; really, in the desert, the only warrior who could still take on Yulian 1 on 1 was probably just the Shuarei’s Bloodied Hands, Venersis.</p><br/><p>Although some of the empire’s knights looked like they were stronger than the Red Storm warriors, they were no match for her husband.</p><br/><p>Grace put away her Sosoontas and grabbed onto Yulian’s arm as if nothing happened.</p><br/><p>“It was nothing. The Empire’s knights were just comparing strengths with our warriors.”</p><br/><p>Yulian looked towards the Empire’s knights in disbelief after listening to Grace. It was then that Yulian saw him.</p><br/><p>Yulian saw the arrogant and moronic prince of the empire standing drunk behind the knights.</p><br/><p>An image was drawn inside Yulian’s mind.</p><br/><p>‘There’s no way……’</p><br/><p>What Yulian was imagining was confirmed when Shareulo started to shout again.</p><br/><p>“What the hell are you doing? I told you to restrain that bitch and bring her to me. Oh, and restrain the punk that just showed up as well.”</p><br/><p>A fire was lit in Yulian’s eyes.</p><br/><p>“What did he do to you?”</p><br/><p>Seeing this angry expression on Yulian for the first time, Grace could only shake her head no.</p><br/><p>“Madam.”</p><br/><p>As Yulian’s voice started to get louder, Grace cautiously answered.</p><br/><p>“The prince was drunk and approached this lady…...and wrist……”</p><br/><p>Grace could not say anything else.</p><br/><p>“Why won’t you tell me the rest?”</p><br/><p>“It was nothing much.”</p><br/><p>“I’m asking you to tell me that trivial thing.”</p><br/><p>“I will answer you inside the paoe.”</p><br/><p>“I want you to tell me now.”</p><br/><p>As Grace would not say anything further, Yulian looked around him with fiery eyes. It was then that he made eye contact with a young child. Yulian walked to the child and lifted him up as he raised the child to his eye level.</p><br/><p>The boy, who looked to be less than nine years old, did not avoid Yulian; instead, he seemed to be excited as he peered into Yulian’s eyes.</p><br/><p>“What is your name?”</p><br/><p>“My name is Tanana Clinique, son of the veteran warrior, Titina Clinique, the Angry Pirma.”</p><br/><p>The boy did not fear Yulian’s eyes and answered vigorously. Yulian was a hero and a role model for the boy; even if Yulian was angry, he had no reason to be afraid of him. He was also at a young age where he could not understand why what happened was a big issue.</p><br/><p>“Tanana, son of Titina Clinique, I will ask you a question.”</p><br/><p>“Yes.”</p><br/><p>“Do you know my wife, the Beautiful Maiden Grace Nellisi?”</p><br/><p>The boy answered vigorously.</p><br/><p>“Of course. I know the former Mother of Pareia, the current Mother, as well as the future Mother.”</p><br/><p>“You’re brilliant.”</p><br/><p>“Thank you very much.”</p><br/><p>The boy was smiling brightly after being praised by Yulian, and the surrounding people started to feel nervous.</p><br/><p>“I will ask you one more question. What just happened to the future Mother of Pareia?”</p><br/><p>The boy was proud that he saw everything that happened and answered vigorously.</p><br/><p>“That drunk foreigner was holding onto Grace-nim’s hand, and when Grace-nim tried to push his hand away, he hugged her. So Grace-nim moved her body and her hand……”</p><br/><p>The boy tried to explain by twisting his hands, but maybe he could not remember clearly, as he just waved his hand around a bit as he continued to explain.</p><br/><p>“Once she did that, the foreigner fell face first into the sand. We were laughing at that when suddenly those people wearing armor came closer, and it was then that the Young Glow and Desert Conqueror, the great warrior Yulian-nim showed up here.”</p><br/><p>“Oh! So that’s what happened.”</p><br/><p>A cold smile showed up on Yulian’s face.</p><br/><p>“You explained it very well, Tanana. When you grow up to be a proud warrior of Pareia, I will be very happy.”</p><br/><p>“Thank you very much.”</p><br/><p>The boy had a bright expression from being praised by his hero and walked towards his family. Yulian turned around and spoke to Grace.</p><br/><p>“And so he says.”</p><br/><p>“We can’t get angry at a guest who made a mistake in his drunk state.”</p><br/><p>Although Grace could feel her husband’s anger in her body, she spoke carefully to try to calm him down. However, Shareulo’s mouth continued to get in the way.</p><br/><p>“You so called Royal Knights are going to disobey a prince’s command? Bring them here right now!”</p><br/><p>“Hmph.”</p><br/><p>A cold smile was back on Yulian’s face as he turned around. His presence made a couple of the Royal Knights hesitate. Although it looked like the normal knights could not recognize it, the Royal Knights could feel it. The aura coming off the body of this youngster known as the Prince of the Desert was not normal.</p><br/><p>‘What the heck is the diplomat doing?’</p><br/><p>Sesuna, the Royal Knight in charge of the envoy was cursing Janet, who was not visible even though such an incident had occurred. This was the first time he was looking for a diplomat because he wanted to avoid a fight.</p><br/><p>In front of him was a dangerous opponent, behind him was someone he couldn’t disobey. Internally, he was feeling embarrassed and wanted to get away from this place. It was obvious that the knights’ movements would be filled with hesitation. (TL: Guess this is what you call between a rock and a hard place)</p><br/><p>However, Yulian walked towards the knights as if he had no intentions of avoiding them and started to speak in the language of the continent.</p><br/><p>“Are you all knights of the continent?”</p><br/><p>As a couple of the knights nodded their heads, Yulian scoffed at them as he spoke.</p><br/><p>“In the books that I have read, it stated that the continent’s knights have a Knight’s Code they have to follow. In the Knight’s Code, I read that knights must protect the elderly, the children, and the ladies. Are you really knights?” (TL: I know ladies sound kind of odd here, but that’s what the author actually uses, so I kept it as is).</p><br/><p>It was a question asking ‘How can you call yourself knights if you won’t protect ladies?’ At the very insulting question, the knights’ faces continued to turn red in shame. Even without him saying that, they had already turned red from what Grace had asked earlier.</p><br/><p>Shame and embarrassment. Resentment towards the Commander who ordered them on this mission. Resentment towards the current situation.</p><br/><p>“If you don’t catch them now, you will face the consequences when we return to the Empire.”</p><br/><p>Resentment towards that damn bastard of a prince. In the end, the knights took our their weapons and started to get in formation.</p><br/><p>Watching the knights starting to form their formations, Haisha and a couple Red Storm warriors tried to go next to Yulian, however, Yulian stopped them.</p><br/><p>“Warriors, do not step forward. It is a husband’s duty to pay back the shame brought to his wife.”</p><br/><p>Yulian shouted towards the warriors around them as he held out the two greatswords and walked into the middle of the formation on his own.</p><br/><p>Sesuna was thinking that it was great that Yulian entered their formation on his own. Since he came in on his own, they would be able to catch him while giving him some face as the prince of the desert. If the person in charge, Janet, could show up while they were stalling for time, it would be even better.</p><br/><p>“D Formation.”</p><br/><p>Listening to Sesuna give directions to form the defense-oriented formation, all the knights understood his intentions and cheered internally. They even hoped that the youngster known as the desert prince would be extremely talented and could keep them occupied. That would be the only way they would be able to say anything to the moronic prince.</p><br/><p>Yulian’s greatsword started to move. It brought forth a gust of sand, and hit the knights with a dangerous aura. There was a loud clanking noise as the knights who traded blows with Yulian wobbled backwards. He had a really high level of strength.</p><br/><p>Their thought process was short; knowing that they could not stop the incoming greatswords while shaking, they curled up their body. The knights on the sides moved their feet to block the greatsword, however, they were pushed back with just one hit.</p><br/><p>Seeing Yulian like this, Sesuna understood that he was a warrior with extreme skills and instructed them to change to the W formation. Although there were only a few changes from the D formation, this was a formation focused on helping the people around them when facing a strong opponent.</p><br/><p>Seeing this, Yulian did not hinder the knights’ movements, as if saying do as you please. He planned on taking down everything they threw at him.</p><br/><p>Once the knights finished changing their formation, Yulian pushed forward strongly once more. Even though they were in the W formation, they continued to get pushed back.</p><br/><p>Although they were getting pushed back, Sesuna still did not directly attack Yulian, thinking that if he was to even accidentally shed some blood, Yulian might become completely ruthless. Based on the knights’ movements, Yulian could understand what they were doing and started to find his sense of reason in the midst of his anger. After that, he only used his physical strength to push back the knights and make them succumb.</p><br/><p>“You don’t need to catch him alive. Just take off his neck.”</p><br/><p>As he realized his knights were getting pushed back time and time again, Shareulo’s order changed, and Yulian realized that he was pointing his sword at the wrong person.</p><br/><p>He widely swung his greatsword once more and pushed the knights back one more time before looking at the knight with the most skill and spoke.</p><br/><p>“I won’t kill him so don’t get in my way. If you try to protect him, I may really end up killing him.”</p><br/>\n</div>"}