{"title": "Book 1-6.5", "id": 36, "volume": 1, "url": "http://boxnovel.org/red-storm-book-1-65", "volume_title": "Volume 1", "body": "<h1>Book 1-6.5</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Book 1-6.5 Incident with the Prince (III)</p><br/><p>The knights were flabbergasted by Yulian’s words. Thirty knights were being warned by one desert warrior. However, with Yulian’s next move, they confirmed that he had the abilities to back up his warning.</p><br/><p>They saw a faint haze starting to rise from Yulian’s greatsword. They were able to see it even when the moon and the bonfires were the only sources of light lighting up the night.</p><br/><p>“This is not possible……”</p><br/><p>Sesuna, as well as many of the knights were all muttering that quietly. From the beginning, it seemed impossible for him to be able to swing those large greatswords. Those swords were difficult to swing even with both hands, but using one in each hand? How was that possible? Plus, the extremely destructive power he showed……</p><br/><p>If that wasn’t enough, now he was pouring mana into the greatsword. This was something only a master was able to do.</p><br/><p>‘I know of one two-handed sword master, however, a knight …… no, a master who uses two of them …...I’ve never heard of such a thing.’</p><br/><p>Sesuna was calmly assessing the situation. Currently there were five Royal Knights here in the desert. If they were to have a battle for their lives, even if it was against a master, they should be able to defend. After all, the Royal Knights of the Silence Empire were only one level, or maximum two levels under the masters’ levels in comparison.</p><br/><p>Plus, they also had over twenty veteran knights. If they were to fight, they probably would not lose. However, the ones who will end up spilling blood will be the knights, and they would not be able to protect the prince either. There was nothing you could do if a master set their target on a specific person and only headed towards them.</p><br/><p>“I’ve warned you.”</p><br/><p>With those short words, Yulian started to run towards Shareulo.</p><br/><p>“Block him!”</p><br/><p>No matter how moronic this prince was, and even if the enemy was a master, the Royal Knights, and really, all knights, had to protect the royal family and could not retreat. Once Sesuna’s orders came out, all the knights blocked Yulian’s path.</p><br/><p>In return, just as he had warned them, Yulian ruthlessly attacked the knights.</p><br/><p>Clank! Slash Clank!</p><br/><p>As steel hit steel, the loud noises of their weapons clashing echoed in the desert. The moans soon followed after that.</p><br/><p>With one swing, the knights on both the left and the right were pushed away and Yulian continued to move forward. They could not block him. After that, two more knights were pushed away and finally, when the Royal Knights were blocking Yulian, Yulian’s greatsword started to change.</p><br/><p>The knights’ swords were being cut into two and their full chainmail made of durable iron was being crushed or ripped apart. It was a sight you would not believe unless you saw it for yourself.</p><br/><p>Seeing that, Shareulo started to yell again.</p><br/><p>“What! What the heck are you doing?! Block that punk right now! Call the soldiers! Kill that punk this instant!”</p><br/><p>Yulian smirked and showed some sympathy that these magnificent knights had to serve such a prince, but the knights were too busy focusing on Yulian’s swords that nobody heard what he said. It may have been better that they did not hear him. Those type of words would only make them lose their strength.</p><br/><p>It took less than ten minutes for all the knights to be flung backwards. None of them had any severe injuries that would impact their lives. Yulian’s anger had moved onto Shareulo, and he knew they had to follow orders.</p><br/><p>Even though all of his knights were knocked down, Shareulo continued to arrogantly yell towards Yulian.</p><br/><p>“How dare you lay your hands on the knights of the Silence Empire even after knowing who I am! Once I return, I will make sure to torture you to death, however, if you admit your wrongdoing and beg me for forgiveness, I will pretend that none of this happened.”</p><br/><p>“Ha!”</p><br/><p>Yulian could not believe what Shareulo was saying. If he’s able to shout like this even in this type of situation, what would have happened if he was not strong enough and had been caught by the knights?</p><br/><p>“Do you think you will be able to return to your Empire?”</p><br/><p>Shareulo’s face turned pale and traces of fear started to develop on his face at Yulian’s words.</p><br/><p>“You… you would dare to do something to me?”</p><br/><p>“Why wouldn’t I? You insulted my country, you insulted our warriors, and now, you even dared to try to assault my wife. Why should I not kill you?”</p><br/><p>Shareulo’s entire body started to shake at the thick murderous aura.</p><br/><p>“You can try to attack me too. Pareia’s warriors do not kill a person who does not have a weapon.”</p><br/><p>Yulian picked up one of the swords that a knight had dropped and handed it to Shareulo. Shareulo was not able to receive the sword and started to speak in a shaking voice.</p><br/><p>“If you kill me … don’t you know what would happen if you kill me? Fi...fine…… I’ll… pretend that none of this happened. We will return now. I promise I will not seek revenge……”</p><br/><p>‘This truly is one of Silence Empire’s princes?’</p><br/><p>Seeing that Shareulo’s shameless behavior made his anger appear to be too much, Yulian debated stopping right there. However, he knew that he could not stop here as the people of Pareia were watching. If he was to just back away now, it’ll plant a seed in their hearts that no matter how strong you were, you had to walk on eggshells around the strong forces of the continent.</p><br/><p>Furthermore, to back away when it was the wife of the Young Glow who was assaulted, that would cause a large wound on the pride of the Pareian people.</p><br/><p>Yulian lifted his hand as he headed directly towards Shareulo and started to slap him.</p><br/><p>“This one is punishment for looking down on our Pareia.”</p><br/><p>Shareulo’s left cheek became swollen in an instant.</p><br/><p>“Ack!”</p><br/><p>Shareulo did not consider his reputation and shouted like he was about to die. As he started to rub his left cheek with both hands, Yulian’s large hand slapped Shareulo’s right cheek.</p><br/><p>“That one is punishment for looking down on our warriors.”</p><br/><p>Shareulo was now down rolling on the ground while rubbing both of his cheeks and screaming at the top of his lungs. Watching this, the people of Pareia felt good while thinking that he was getting what he deserved.</p><br/><p>As Yulian looked over at Grace and started to head towards Shareulo, Grace quickly came up to Yulian and held his arm.</p><br/><p>“You do not need to punish him on my behalf. I am content he has received this much punishment.”</p><br/><p>At Grace’s request, Yulian looked around to read the expression of the tribe members. After seeing their satisfied faces, he thought that this was enough. Plus, seeing Shareulo suffering on the ground rubbing his whole body, he thought that there would be no point to continue.</p><br/><p>“Please stop the fight.”</p><br/><p>At this point, there was someone shouting while running towards them. It was the diplomat from the Silence Empire, Janet. Janet was surprised after seeing the knights and prince on the ground and started to shout at Yulian.</p><br/><p>“Young Glow, what is the meaning of this?”</p><br/><p>Yulian coldly responded.</p><br/><p>“How about you explain to me what the meaning of this is? Your prince was insulting Pareia earlier and now tried to assault my wife. Well?”</p><br/><p>At Yulian’s answer, Janet’s body swung as if the back of his head was hit by a hammer. In the end, that moron could not hold in his lecherous ways and caused an incident. Shareulo’s lust was famous even back in the Empire.</p><br/><p>After seeing the woman standing next to Yulian, he could imagine Shareulo’s actions without having seen it for himself. However, he could not just let it be when the prince was in such a condition.</p><br/><p>“No matter what may have happened, to insult the Empire’s prince like this, don’t you know this will gravely impact the relationship between the great Silence Empire and the Pareia tribe?”</p><br/><p>“Then are you telling me that I have to just sit by and watch my wife get raped? How should I watch it? Should I be laughing as I watch it for the friendship between the Empire and our tribe? If you come as an envoy of a nation, then you should not have acted this way! Don’t you agree?”</p><br/><p>At Yulian’s reprimand, Janet had nothing to say.</p><br/><p>‘What shall I do about this?’</p><br/><p>Janet once again cursed the crown prince who ordered him to travel with that moron, and could only worry about how to resolve this situation.</p><br/><p>As the other members of the envoy carried prince Shareulo and the knights into their residence, Grace quietly pulled Yulian’s arm.</p><br/><p>Once Yulian followed Grace into the paoe, Grace put herself in Yulian’s embrace and spoke as she stroked his chest.</p><br/><p>“I know you are angry, but this incident will have some severe consequences. There should have been other ways to resolve it……”</p><br/><p>“I held back not once, not twice, but three times. What else could i have done?”</p><br/><p>“You have to hold back because you are the Glow. If not three times, then four times, five times, even one hundred times if you can do so.”</p><br/><p>“Are you scolding me right now?”</p><br/><p>As Yulian was starting to get angry at Grace’s words, Grace hugged Yulian tightly and started to rub his back as she answered.</p><br/><p>“Of course not. I was extremely happy at your actions. How could I scold you when my husband cares so much about me. That’s preposterous.”</p><br/><p>“Then why are you keep saying things like that?”</p><br/><p>“Don’t you think I felt that it was unfair? I had to hold back when that was happening to me. However, if it is for you to become a great Glow, I can hold back even thousands of times. Can you not understand my heart?”</p><br/><p>As tears started to form in Grace’s eyes, Yulian let out a sigh as he started to hold her tightly as well.</p><br/><p>“Sigh~. How could I not know how you are feeling? However, this situation was just too much. How dare he put his hands on you.”</p><br/><p>Grace lightly smiled on the inside, however, tears were still hanging on her eyes.</p><br/><p>“Still, I hope that you can restrain yourself in the future. Since you showed your might this time, the knights of the Silence Empire who now know of your strength will definitely not leave you alone. It’s not even about hurting their pride, it is because they now know you are a dangerous presence. That is why I have told you all this.”</p><br/><p>“I understand. I will be careful from here on.”</p><br/><p>“You promise?”</p><br/><p>“I promise.”</p><br/><p>At Yulian’s answer, Grace got on her tippy-toes and kissed Yulian’s cheek.</p><br/><p>“I’m relieved.”</p><br/><p>Yulian could never win against Grace.</p><br/><p>(TL Note: Friends, my fellow Red Storm warriors, with this release, I have now been translating for 12 weeks and 36 releases have come out including this one. We have 1 more release before starting the last chapter of Volume 1. After finishing Volume 1, I will take 1 week off before coming back to translate Volume 2. It will be at least two more weeks before that happens, but I wanted to give you all a heads up early on!)</p><br/>\n</div>"}