{"title": "Book 2-1.7", "id": 49, "volume": 2, "url": "http://boxnovel.org/red-storm-book-2-17", "volume_title": "Volume 2", "body": "<h1>Book 2-1.7</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Book 2-1.7 The Master Returns (I)</p><br/><p>Chun Myung Hoon was not happy.</p><br/><p>In fact, he was VERY unhappy. He had returned after a five year long trip around the continent, and rather than feeling the special passion of the desert people, he saw that a chaotic atmosphere was surrounding the oasis.</p><br/><p>The number of boundary warriors who seemed like they let loose a bit.</p><br/><p>But the biggest reason was the fact that Librie, who knew who he was, shouted for the warriors to catch him as soon as he showed up, and as a result, warriors who he was at least somewhat familiar with, were coming at him with their shamshirs. How could he be happy?</p><br/><p>He couldn’t kill them, nor could he hurt them. They were all warriors of Pareia, and will later be with his disciple.</p><br/><p>Chun Myung Hoon was throwing a fit internally as he moved his body left and right to dodge the attacks and waited for a person who would recognize him to show up.</p><br/><p>How long had he been dodging for? The person he was waiting for did not show up, and instead, the number of warriors coming at him started to grow. Chun Myung Hoon became extremely angry and shouted very loudly.</p><br/><p>“Yulian!”</p><br/><p>Although the voice was so loud that anybody in that large oasis would be able to hear it, there was nobody whose eardrums ruptured or anything like that. It was thanks to Chun Myung Hoon’s ability to control his power.</p><br/><p>“Yulian, that punk. His master has shown up and he doesn’t even show his face.”</p><br/><p>Chun Myung Hoon’s voice started to bring forth more warriors.</p><br/><p>It was because of Librie’s shouting as well as the name they were hearing.</p><br/><p>‘Something is weird.’</p><br/><p>Chun Myung Hoon was certain that something was off. His disciple was not the type to not come out even when he was shouting like this, and even if he wasn’t here, it would be normal for Baguna, his family members, or even Tuma Takaka, who used to play Yulta with him, to show up.</p><br/><p>Plus, the warriors swinging the shamshir at him didn’t seem like they wanted to do it. He couldn’t see their usual valiant natures at all.</p><br/><p>‘Something must have happened.’</p><br/><p>Chun Myung Hoon was extremely smart and had great intuition; he could easily tell that something must have happened in Pareia.</p><br/><p>He looked around trying to find a familiar face. Although five years had gone by, Chun Myung Hoon’s memory was completely fresh, as if he had just seen them yesterday.</p><br/><p>‘I see one.’</p><br/><p>The person he noticed was Veruna, someone who he often saw close to Baguna.</p><br/><p>As his body started to fly, he instantly moved past the surrounding warriors and grabbed Veruna. He then flew at a speed that was hard to believe was humanly possible and moved far away from the rest of the people.</p><br/><p>“What did you say?”</p><br/><p>Chun Myung Hoon, who had grabbed Veruna, spoke as if he could not believe what he heard. He even sounded like he was in complete disbelief.</p><br/><p>Veruna started to speak again.</p><br/><p>“It’s something that is difficult for me to believe as well. For our Young Glow to plot out a rebellion like that and murder the Glow. This is just ……”</p><br/><p>“So where did Yulian go?”</p><br/><p>“That day, Grace-nim……”</p><br/><p>“Grace?”</p><br/><p>At Chun Myung Hoon’s reply, Veruna realized that Chun Myung Hoon was really out of the loop and started to explain.</p><br/><p>“Ah! Senior may not know of it. Yulian-nim was married four years ago. You don’t know how much Yulian-nim suffered trying to look for you back then.”</p><br/><p>“Well, I guess he was at the age to get married. So what happened to his wife, Grace?”</p><br/><p>Veruna started to continue his explanation.</p><br/><p>“So Grace-nim came and told us that our current interim Glow, Librie-nim, had murdered Baguna-nim, and that Yulian-nim and Pere-nim were being attacked by her tribe members. She asked us to move immediately to help them.”</p><br/><p>“But?”</p><br/><p>“The problem was that Librie-nim had arrived first and told us that Yulian-nim and Pere-nim had rebelled and used poison to murder Glow Baguna and the Mother of Pareia, Seina-nim. She ordered us to go and catch the two of them.”</p><br/><p>Chun Myung Hoon was confused and asked.</p><br/><p>“Does she have the authority to give such an order?”</p><br/><p>“When the Glow, Mother of Pareia, and the Young Glow are not present, the command of the warriors falls to Librie-nim as the most senior member of the Glow’s family. But since the two of their stories were different, the chiefs and warriors all fell into chaos. The different chiefs of the Oasis, as well as the diplomat from the SIlence Empire were all here for the Glow’s birthday, so chaos occurred in such a full oasis.”</p><br/><p>“Hoh, it doesn’t fall to his younger son but to a woman……”</p><br/><p>Veruna replied at Chu Myung Hoon’s comment.</p><br/><p>“At that time, all three of Baguna-nim’s sons were not present. Even the third son, Orca-nim had fallen to the poison and was close to death.”</p><br/><p>“This……”</p><br/><p>Chun Myung Hoon flicked his tongue as he spoke.</p><br/><p>“When did this all happen?”</p><br/><p>“About a week ago.”</p><br/><p>“So sad. Only if I had been here.”</p><br/><p>Chun Myung Hoon regretted the fact that he was about 10 days late because of someone’s situation, and Veruna started to speak again.</p><br/><p>“It’s already an arrow that has flown by. Shall I continue with the story?”</p><br/><p>“Ah! I cut you off. Go ahead.”</p><br/><p>“Anyways, so people split into two factions, one supporting Yulian-nim and the other cursing him, but because of the rule of the desert, they all had to follow Librie-nim’s orders as she held the command of the tribe. The Red Storm warriors who didn’t agree, as well as the Chief Shaman Tuma Takaka-nim, protected Grace-nim and left the tribe. Librie-nim was shouting her lungs out for us to catch them, but when nobody could be sure about what happened, how could we lay our hands on the Glow’s family?”</p><br/><p>“It must have been chaotic. So then where would Yulian be right now?”</p><br/><p>Veruna thought for a second before responding.</p><br/><p>“I would think that they headed towards the Rivolde tribe, where Grace-nim’s father lives. That is probably the only place they could turn to right now.”</p><br/><p>“Can you draw me a map?”</p><br/><p>“Will you head over there?”</p><br/><p>“Of course. There is no reason for me to stay here. I will get more details from my disciple before making up my mind. If Glow Baguna is dead, that is like killing my friend, so I need to pay my respects to the dead.”</p><br/><p>“Then please take me with you.”</p><br/><p>“Hmm?”</p><br/><p>Many people are lamenting the fact that they could not go with Grace-nim. In fact, there are quite a lot of people just waiting for Yulian-nim to return and tell us the truth with his own mouth.</p><br/><p>“You all should have not listened to anybody and just captured all of them to figure out the truth.”</p><br/><p>At Chun Myung Hoon’s response, Veruna nodded his head as he responded.</p><br/><p>“We had to listen to Librie-nim because of the rule. However, watching Librie-nim ask all sorts of questions to the fat diplomat from the Silence Empire, the people had to hold back their anger. Everybody is doubting Librie-nim’s words. For those two brothers to really… even if you were to say they were possessed by the devil to do such a thing, would they have been so careless? Everybody knows of their strength, and there are so many warriors who follow them as well.”</p><br/><p>Chun Myung Hoon nodded his head.</p><br/><p>‘He is a bit useless but you have to at least admire his personality. He at least shows small signs of being good.’</p><br/><p>Chun Myung Hoon remembered the first time he met Yulian, as well as Yulian’s response when they met with the Dragon. He laughed happily once before speaking.</p><br/><p>“Alright. Come with me. I’m sure Yulian will like it if someone who knows the situation from the inside shows up as well.”</p><br/><p>Chun Myung Hoon made up his mind to catch up to Yulian.</p><br/>\n</div>"}