{"title": "Book 2-1.2", "id": 44, "volume": 2, "url": "http://boxnovel.org/red-storm-book-2-12", "volume_title": "Volume 2", "body": "<h1>Book 2-1.2</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Book 2-1.2 Flashback (I)</p><br/><p>Red Desert. Even today, this place called the Red Desert was being dyed red. Blood was being shed and many people were falling over, and an even greater number of people were holding on to their shamshirs, swinging them to take down more opponents than the other side.</p><br/><p>The people of the desert were very barbaric. Especially when it was related to an oasis, which was the lifeline of the desert, their barbaric nature came out in full effect. The thing that was drenching the desert red today was the Shuarei tribe, who owned eleven oasis, invading the Pareia tribe, who also owned eleven oasis.</p><br/><p>Thanks to the fact that the two tribes had signed a truce yesterday, Pareia had their guard down.</p><br/><p>A battle between someone who has prepared and someone who has not, actually ends up being more ruthless, and leads to a lot more blood being spilled.</p><br/><p>“Catch the Glow!”</p><br/><p>The Shuarei tribe’s warrior among warriors, the ‘Bloodied Hands’ Venersis, was shouting as he was giving commands to the Shuarei warriors.</p><br/><p>This was the Pareia tribe’s largest oasis.</p><br/><p>The Shuarei tribe had prepared and brought a larger amount of warriors to instantly invade, but the Pareia tribe warriors were doing a good job defending against them. It was such a sudden sneak attack that they were fighting in chaos, but they were fighting back valiantly, living up to their status as warriors protecting Pareia’s largest oasis.</p><br/><p>However, the ‘Bloodied Hands’ Venersis was leading the group, and his brigade of warriors known as the Desert Sword was too strong for the Pareia warriors to handle. They could not defend as the Desert Sword plowed through in a straight line.</p><br/><p>That single line of attack was piercing through Pareia.</p><br/><p>“Defend! Protect the Mother of Pareia!</p><br/><p>The warriors of Pareia did not care about the fact that they were getting injured and tried to defend the charge of the Shuarei tribe, but in the end, they just ended up losing their lives.</p><br/><p>Before long, Venersis found the largest paoe of the Pareia tribe and led a large number of warriors as he charged in.</p><br/><p>However, they did not find the ‘Benevolent Eye’ Baguna Provoke, the Glow of Pareia like they wanted. Instead, all they found was his first wife, the ‘Beautiful Maiden’ who became the Mother of Pareia, Mairez.</p><br/><p>Mairez boldly faced the enemy, Venersis. She had a shamshir in one hand.</p><br/><p>Venersis shouted without holding his shamshir.</p><br/><p>“Mairez, how could a warrior among warriors like me attack a woman like you? Please come peacefully and surrender yourself!”</p><br/><p>Mairez shook her head at Venersis’ shout and pointed her shamshir at him and shouted back.</p><br/><p>“We came to a truce just yesterday, yet a single day later, here you are breaking the promise and invading our oasis. I cannot become a prisoner to someone who is not a warrior.”</p><br/><p>A desert warrior never attacked women or children.</p><br/><p>Unless they could kill every member of a tribe, it was the better option for each other.</p><br/><p>It was the unspoken promise of all of the desert tribes. Lifting weapons and shedding blood while fighting was only for the warriors.</p><br/><p>However, they did take prisoners. But even the people who were taken as prisoners did not find it shameful. You couldn’t do anything about being caught by warriors. That is why all of them peacefully agreed to be taken as prisoners, and until their family and tribe paid off the ransom to take them back, they obeyed as their prisoner, and their slave. Since they all believed that the desert tribes were all part of the same family, it wasn’t like any of the tribes treated their prisoners like they were less than human.</p><br/><p>However, Mairez did not agree to Venersis’ request to be taken as their prisoner. The situation was different.</p><br/><p>Venersis did not act like a warrior. Since they broke the truce from yesterday and invaded today, there was nothing wrong with what Mairez said or what Mairez was thinking.</p><br/><p>Although Mairez was already past her mid-thirties, she was still beautiful and prideful. At one point, she was the most beautiful woman in the entire desert, and among the women, she was the one who was the best at riding the pirma (TL: Grace version 1.0). When this woman who many warriors were eyeing for themselves was married to the ‘Benevolent Eye’ Baguna, Venersis was among the many warriors who were disappointed.</p><br/><p>To be scolded by that woman made Venersis feel embarrassed inside.</p><br/><p>He had accepted this because it was the order of the Glow, but this kind of scheme did not fit him and he did not find it to be good either.</p><br/><p>Just as Mairez mentioned, even he didn’t feel like you needed to respect warriors who could not keep their promise, so he just stood there for a bit, without being able to do anything.</p><br/><p>“If you are also a proud warrior, take your subordinates and leave! If you don’t, that proud name of yours, that name of ‘Bloodied Hands’ will disappear.”</p><br/><p>Listening Mairez boldly yell at him, Venersis let out a sigh in his mind before starting to speak.</p><br/><p>“Following the orders of the Glow is also a warrior’s mission. Mairez, today, you must become a prisoner of our tribe.”</p><br/><p>“It must be raining sand!” (The most improbable thing in the desert). [TL: Aka, BULLSHIT!]</p><br/><p>I, Mairez, do not want the shame of becoming a prisoner to a warrior who has lost his pride.”</p><br/><p>Mairez spoke as if it would be considered blasphemy and started to swing her shamshir at Venersis.</p><br/><p>Mairez was known to be a warrior among woman, but how could she even touch the clothes of Venersis, who was known as a great warrior throughout the desert?</p><br/><p>Venersis kept his shamshir on his hip as he moved his body around to catch her with his bare hands.</p><br/><p>‘Even without to resorting to something like this, I could easily take over Pareia’s large oasis. Then Mairez would have also agreed to be our prisoner…...oh Glow, Glow, you are dirtying my name, the name of Venersis, too too much.’</p><br/><p>Venersis was lamenting inside as he tried to catch her hand that had the shamshir. After trying a couple of times, he was able to grab onto her right wrist that was holding onto the shamshir, and it was the moment he tried to forcefully hold her and make her unable to move.</p><br/><p>“You think I will end up your prisoner!”</p><br/><p>Mairez shouted loudly as she took out a short dagger on her hip and stabbed her own chest.</p><br/><p>“Ah!”</p><br/>\n</div>"}