{"title": "Book 2-1.5", "id": 47, "volume": 2, "url": "http://boxnovel.org/red-storm-book-2-15", "volume_title": "Volume 2", "body": "<h1>Book 2-1.5</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Book 2-1.5 Taking Control of the Tribe (II)</p><br/><p>“Immediately capture Grace and create a team to chase after those two criminals. We must catch them.”</p><br/><p>Nobody could move after Librie finished speaking. Grace was so shocked she could not say anything and just stared at Librie.</p><br/><p>“Did you not hear my order to catch that bitch right away?!”</p><br/><p>Seeing that none of the warriors were moving even after she shouted in a sharp voice, Librie sent a signal to her family tribe’s warriors. Finally, they started to come forward.</p><br/><p>“Wait, this does not make any sense.”</p><br/><p>The warrior who was getting in the way of the warriors trying to capture Grace was Red Storm’s Haisha.</p><br/><p>“Who are you to dare to block their path!”</p><br/><p>Librie looked at Haisha and shouted, but Haisha did not pay attention to her and spoke towards the chiefs.</p><br/><p>“I know that the rules of the desert indicate that after the Glow, the mother, and the Young Glow, the eldest in the Glow’s family temporarily acts in the Glow’s place. However, is the Young Glow Yulian-nim dead? How could we capture his first wife, Grace-nim, when Yulian-nim is still alive? The person in charge of Pareia right now is Yulian-nim.”</p><br/><p>The moment Haisha emphasized the word temporary, the chiefs started to whisper.</p><br/><p>“If that bastard didn’t do such an immoral thing, would he have ran away? If something happened, he should have taken control of the situation, why run instead?”</p><br/><p>As Haisha stood there in silence since he didn’t know the reason, Grace started to shout.</p><br/><p>“Librie, when you tried to kill father, my darling, and Pere-nim with poison and failed, you tried to get your tribe to kill them! Pere-nim could not hold them off on his own so he ran away. Is that what you call running away!”</p><br/><p>At that moment, everyone started to whisper again nervously. Librie knew that if she was pushed back right now, it would be the end.</p><br/><p>“Hmph, the majority of Pareia’s oasis chiefs are all here within the tribe. Where are you saying they ran to?”</p><br/><p>“Since your tribe prevented us from coming here, how could he come this way?”</p><br/><p>“What a devious excuse. There is nobody in the world who does not know that the two of them are extremely good at martial arts. How could a mere couple hundred of my tribe’s warriors block their way?”</p><br/><p>“Yulian-nim was poisoned by you an Pere-nim couldn’t use all of his strength since he needed to protect him. How could they forge a path?”</p><br/><p>As the two women’s banter continued, the people were in chaos, but in the end, they had to follow Librie’s orders based on the rules of the desert.</p><br/><p>The rules of the tribe were there to be used in emergency situations, and they could not go against it.</p><br/><p>Amongst the chiefs’ silence, Librie’s tribe’s warriors moved forward to capture Grace again.</p><br/><p>Clang.</p><br/><p>The sound of swords clashing.</p><br/><p>“You dare to go against my orders?”</p><br/><p>Listening to Librie’s words, Haisha, who had stood in front of Grace to protect her, started to speak.</p><br/><p>“I am a warrior who has pledged his loyalty to Yulian-nim. Until I hear the truth straight from his mouth, nobody will be able to touch a single hair on our mother. If you try to take her, do not blame my sword for attacking you.”</p><br/><p>“Catch him too and make him kneel!”</p><br/><p>At Librie’s shout a few more warriors stepped forward to catch Grace and Haisha.</p><br/><p>Clang.</p><br/><p>Another sound of swords clashing and a deep voice that followed.</p><br/><p>“Anybody who touches our mother shall die.”</p><br/><p>The warrior who plowed through the crowd to stand in front of Grace and next to Haisha was Thrint.</p><br/><p>Sshhhhh.</p><br/><p>With Thrint leading the way, the sound of swords being drawn could be heard in many different places. At the same time, there were warriors moving to the front of Grace.</p><br/><p>The Red Storm warriors.</p><br/><p>As soon as the Red Storm warriors saw Grace coming into the tribe looking anxious, they knew the situation was not normal. Listening to her and Librie chat, they knew that it would not be a comfortable night.</p><br/><p>Haisha ordered the members to get their weapons and bring their pirmas over, and on their way here, they had readied their pirmas not too far away.</p><br/><p>They were trying to save Grace from this danger with their surprising decision making skills and cohesiveness.</p><br/><p>Librie’s warriors stopped moving.</p><br/><p>The number of warriors started to increase one by one. After a moment, all fifty seven members of Red Storm were standing in front of Grace.</p><br/><p>“Death to anyone who dares to touch our mother.”</p><br/><p>It wasn’t a loud shout. It was low and deep.</p><br/><p>As they spoke in unison, their words showed their determination to protect Grace even at the cost of their own lives.</p><br/><p>“Haisha...Thrint...Shubeon...all of you……”</p><br/><p>The frustration that things were going wrong, the anxiety that if she doesn’t hurry, it would be dangerous, and the sorrow from the fact that nobody would believe her, all of this made her very upset, but it was watching the Red Storm warriors who trusted in and followed after Yulian that made her become teary-eyed.</p><br/><p>“Mother, do not worry. Our Lord is Yulian-nim, not that woman in front of us. And until we hear the truth from Yulian-nim’s mouth, we will not believe anything. Where is Yulian-nim?”</p><br/><p>As all of them stood with Grace behind their back to protect her, Haisha alone turned his body around to console Grace and asked.</p><br/><p>“He is currently escaping towards the Western Desert. It’ll be dangerous if we do not go right now.”</p><br/><p>Librie knew that the situation was not going well and shouted towards the warriors.</p><br/><p>“All warriors are to catch all of those rebels! Make sure you don’t miss a single one!”</p><br/><p>“Everyone, escort Grace-nim and escape!”</p><br/><p>Haisha shouted loudly and with Grace in the center, they started to slowly retreat to the back where the pirmas were.</p><br/><p>The warriors slowly went towards them but did not thoughtlessly attack them. First, the order to catch Grace did not sit well with them, and second, they knew what kind of power came from the greatswords the Red Storm warriors possessed.</p><br/><p>With just around fifty people, they were able to cause a ruckus in the Monster’s Desert and collect a ton of Monster’s Souls. In addition, that was three years ago. Everybody knew how quickly they progressed.</p><br/><p>“I’m also going!”</p><br/><p>At that moment, the tribe’s chief shaman, Tuma Takaka, shouted and started to run towards them. The Red Storm warriors hesitated. The Red Storm warriors who relied on the help of the shamans every day considered Tuma Takaka as a very friendly old man.</p><br/><p>However, that was it. The Red Storm warriors who knew of his abilities hesitated for a second and looked towards Grace and Haisha, as if asking what to do. If Tuma Takaka used his spells, they might not be able to escape.</p><br/><p>“Elder.”</p><br/><p>Grace made a look of admiration as she called out to Tuma Takaka. He was extremely close with the Provoke family that they considered him a part of their family and Baguna’s three children all called him uncle.</p><br/><p>As Grace called out gently to Tuma Takaka, the Red Storm warriors felt a little less nervous.</p><br/><p>Tuma Takaka!</p><br/><p>Librie shouted and Yarumaha also got nervous and looked towards him. Tuma Takaka started to speak.</p><br/><p>“No matter how much I think about it, this feels too weird. I have been loyal to the Provoke family for three generations, and there is not an ounce of reason for the Young Glow to do something like this. Where can you find a father and son so close to each other? How could that enthusiastic Young Glow do such a thing? I can’t believe it. Anybody who knows him even a little bit should not be able to believe it.”</p><br/><p>In this chaotic situation, watching his conversation buddy Tuma Takaka shifting to Grace’s side, Yarumaha hurriedly spoke.</p><br/><p>“Tuma Takaka-nim, but still, right now, the rules of the tribe say we must listen to Librie-nim.”</p><br/><p>Tuma Takaka nodded his head and answered.</p><br/><p>“You’re right. So Yarumaha-nim, please assist Librie-nim and get this under control. As for me, I need to confirm it with my own eyes. No matter how many times I think about it, I believe all of this is happening under some type of misunderstanding.”</p><br/><p>“Tuma Takaka-nim……”</p><br/><p>As Yarumaha could not figure out what to say, Librie thought that if things continued like this, more people would be uncertain and shouted.</p><br/><p>“What are you all doing?! Are you going to disobey my order! Hurry up and capture all of those rebels!”</p><br/><p>As Librie was shouting at the top of her lungs, Thrint instantly left the group and headed towards her.</p><br/><p>Thrint was called the covert shadow, and many of his peers in Red Storm did not know the origin of his name. His specialty was that he spoke a little and was extremely cold.</p><br/><p>However, his current movement proved that the name was fitting.</p><br/><p>His agility that let him instantly rush forward and the flexibility to dash in between the warriors. From the moment he left the group to the point he had the greatsword at Librie’s neck, it really happened within a couple blinks.</p><br/><p>“If you talk and run your mouth one more time, I guarantee I will kill you.”</p><br/><p>Thrint’s unique low voice rang close to Librie’s ear.</p><br/><p>“Do not block our path.”</p><br/><p>Thrint’s sword was returned in a moment and his body had returned to the group. During that time, Librie, along with everybody around her were so surprised that they could not say anything.</p><br/><p>All of them couldn’t tell what happened, and it was just a very chaotic situation.</p><br/><p>Using that mental scare, the Red Storm escaped from Pareia with Grace. None of them tried hard to properly block their way.</p><br/><p>Honestly speaking, they were all swept up in the delusion that they didn’t even think about actually trying to get in their way.</p><br/>\n</div>"}