{"title": "Book 2-2.5", "id": 57, "volume": 2, "url": "http://boxnovel.org/red-storm-book-2-25", "volume_title": "Volume 2", "body": "<h1>Book 2-2.5</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Book 2-2.5 Visiting the Oasis (II)</p><br/><p>He traveled across the continent for five years to figure out the reason he came to this world, and seeing that the desert he returned to had changed quite a bit, Chun Myung Hoon was quite frustrated.</p><br/><p>The thing that he saw the most throughout the continent was similar to those corrupt officials back in China. He saw those so called royalty of the continent abusing their people. It was worlds apart from how the Glows and the chiefs of the deserts treated their people with love.</p><br/><p>However, the desert that he returned to was smudged full of betrayal and distrust. For him who happily came back because he liked the passion of the people and the culture of respect that the people had, it was the worst..</p><br/><p>The moment it looked like Chun Myung Hoon’s body was about to move, Yulian and Yarumaha were suddenly in the center of where the two camps of soldiers were standing.</p><br/><p>“Master!”</p><br/><p>“Hmm……”</p><br/><p>Yulian and Yarumaha both shouted in shock, and as both sets of warriors who had been standing idiotically tried to start moving, Chun Myung Hoon started to shout.</p><br/><p>“Other than the representatives, everybody else scram! If you move, you will die!”</p><br/><p>Chun Myung Hoon had wanted to just quickly take care of this whole situation by catching and killing the responsible individuals.</p><br/><p>However, his disciple had rejected that offer, and he remained calm because he believed his disciple made the right decision.</p><br/><p>However, they had to wait around for an hour, and even after meeting with Yarumaha, it didn’t look like it was going to go anywhere for a while because of other people’s perceptions. For Chun Myung Hoon who normally had a hard time controlling his anger, this type of frustration was just too much.</p><br/><p>Yulian stayed calm since Chun Myung Hoon was his master and he knew about his master’s almost omnipotent strength, but Yarumaha’s warriors could not do that.</p><br/><p>Vibli started to shout angrily.</p><br/><p>“How dare you look down on us like this! If you can kill us, try it!”</p><br/><p>Vibli knew that he was not a match for Chun Myung Hoon since he couldn’t even see Chun Myung Hoon move, but his pride as a warrior made him forget about that.</p><br/><p>As Vibli’s pirma tried to take one step forward, Chun Myung Hoon lifted his feet once more.</p><br/><p>Yulian who happened to be watching his master’s movement shouted out.</p><br/><p>“Master! He is just a warrior focused on his duty!”</p><br/><p>How fast must Chun Myung Hoon’s movement have been? Chun Myung Hoon stopped midway, but in response, Vibli’s pirma did not manage to take a single step forward.</p><br/><p>Chun Myung Hoon looked down at Vibli from the top of the pirma’s head and started to speak.</p><br/><p>“This is your final warning. I will let you off this once because I happen to like desert warriors.”</p><br/><p>Yulian also shouted.</p><br/><p>“Great Warrior Vibli-nim! I swear by my name that I came here to prove my innocence! I also came to get an oath of loyalty from the Cold Oasis as the rightful Glow! Even if I do not manage to prove my innocence, I do not have a grain of sand of desire to harm Yarumaha-nim, so please do not move!”</p><br/><p>Yulian was thankful that his master stopped.</p><br/><p>If he did not do anything and just watched, Vibli would have been beaten up by his master until the dust stopped flying, and Vibli would not have been able to live with that shame.</p><br/><p>His master liked the heart of the desert and the warriors, but he did not like their pride. He just had to look back at the amount of times he was beaten up.</p><br/><p>‘I swear he must have been a dictator.’</p><br/><p>Yulian remembered the thought he had every time he was beaten up, and started to speak to Yarumaha.</p><br/><p>“He is my master. I’m sure you’ve heard of him from my father?”</p><br/><p>Yarumaha nodded his head as if he understood and motioned to Vibli to stay still. He remembered the things he heard from Glow Baguna.</p><br/><p>“He is as amazing as I’ve heard.”</p><br/><p>“He does whatever he wants, but when it comes to right and wrong, he is the most righteous out of anybody I know, so please understand.”</p><br/><p>From there, the rest was a breeze.</p><br/><p>Yulian clearly explained his innocence and righteousness to Yarumaha.</p><br/><p>Yarumaha cautiously listened until the end of Yulian’s words before starting to speak.</p><br/><p>“To be honest with you, all of the chiefs, including myself, have had our doubts. The words you shared with us that day was still fresh on our minds, but for something like this to happen on that same day? Of course we were doubtful. However, you cannot overcome times of trouble without a proper command structure. At that time, Pareia’s greatest command definitely belonged to Librie-nim, and we had to follow her orders.”</p><br/><p>“I definitely understand and agree with your decision. I’m sure you had to do what you did.”</p><br/><p>“There is currently a lot of complaints among the chiefs. Librie-nim has been too cozy with Silence’s Janet, and she keeps trying to stay on their good side. Of course we have to try to stay on good terms with them, but she is overdoing it to the point that the warriors are not happy. In addition to that, she keeps trying to go against the convention and push Orca-nim to be the Glow. That is making us doubt her even more.”</p><br/><p>Yulian asked a question.</p><br/><p>“Many chiefs should have been gathered there at the time. What did you decide to do?”</p><br/><p>“All of the chiefs, including myself, agreed that we must first prepare our defenses against potential attacks. Once things settled down, we agreed to gather back to select a new Glow. However, I guess we will not need to do that since you are back now, Yulian-nim. This old man believes Yulian-nim. I believe in the determination and wisdom you have shown since you were a young boy. However, the real question is how we can prove your innocence.”</p><br/><p>As his father’s death was brought back up, Yulian clenched his fists tightly as he responded.</p><br/><p>“They claim that us brothers poisoned our father to death, however, I was also hit by that poison. I’m thankful that Pere was doing a fasting prayer because that is what saved us. The fact that I was hit by poison is something Pareia’s long time shaman Tuma Takaka-nim can prove, however, I’m sure many people will not believe Tuma Takaka-nim. That type of method will not be useful in proving my innocence.”</p><br/><p>“That is the problem.”</p><br/><p>Yulian hesitated for a long time before finally starting to speak again.</p><br/><p>“To my father … it is extremely rude to my father… but we will investigate my father’s corpse. The poison that we took was not from the desert. Since everybody should know that myself, Pere, and even the warriors among us have never left the desert, please have the shamans of the individual oasis inspect the poison we retrieve from his corpse. Since Tuma Takaka-nim has confirmed that it is not from the desert, if a desert poison comes out of my father’s body, I will accept this wrongful accusation. However, if it not a desert poison, you will need to think about where it came from.”</p><br/><p>“Silence!”</p><br/><p>There was no ifs or buts. Yarumaha instantly thought of Janet after hearing Yulian’s explanation and shouted.</p><br/><p>Seeing Yulian nod his head, Yarumaha also nodded and continued to speak.</p><br/><p>“No wonder Librie-nim was oddly close to Janet. I was indeed curious about that. She is after all a daughter of the desert and should know the situation better than anybody else. But it was really weird seeing her still being cautious and wanting to please their every desires.</p><br/><p>Yulian waited enough for Yarumaha to accept the truth, and once Yarumaha’s gaze returned back to him, he politely and confidently started to speak.</p><br/><p>“Glow Baguna’s rightful heir, the Young Glow Yulian Provoke, plans to take back the command and law that has been given to me. I am prepared to carry the heavy burden of being the Glow of Pareia. Yarumaha-nim, will you trust me and follow me?”</p><br/><p>Yarumaha kneeled on the spot and kowtowed as he kissed the tip of Yulian’s foot.</p><br/><p>“The Chief of the Cold Oasis, the Tight-Lipped Individual Yarumaha Senei hereby swears my loyalty to the Glow of Pareia by the name of our Guardian, Neo Latin-nim.”</p><br/>\n</div>"}