{"title": "Book 2-2.2", "id": 54, "volume": 2, "url": "http://boxnovel.org/red-storm-book-2-22", "volume_title": "Volume 2", "body": "<h1>Book 2-2.2</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Book 2-2.2 Yulian’s Course of Action (I)</p><br/><p>As soon as the morning came, Yulian headed to the Glow’s paoe to meet with the Rivolde’s Great Glow, Dejaine Nellisi. Once he arrived, he found Dejaine who had just woken up.</p><br/><p>“You came very early.”</p><br/><p>“I’m sorry to disturb your sleep so early in the morning, Glow Dejaine-nim.”</p><br/><p>“No worries, I always wake up at this time. Anyways, are you feeling okay?”</p><br/><p>“I feel like I can immediately run around and hunt down a thousand wild animals and monsters.”</p><br/><p>At Yulian’s confident answer, Dejaine smiled before asking.</p><br/><p>“That’s good to hear. Let’s get to the point. I’m sure you came to look for me so early in the morning since you had something you wanted from me.”</p><br/><p>Yulian nodded his head and got straight to the point.</p><br/><p>“I hope you can lend me two hundred of Rivolde’s valiant warriors.”</p><br/><p>Dejaine, who was curious as to what kind of plan Yulian would have come up with, was surprised at this request.</p><br/><p>“That’s it?”</p><br/><p>Yulian nodded his head.</p><br/><p>“Yes, that is it.”</p><br/><p>As Yulian confirmed his request, Dejaine was shocked again.</p><br/><p>Honestly speaking, Dejaine thought Yulian would request a minimum of 5,000 warriors. Of that, the amount of warriors he could lend Yulian was around 3,000. That was the most he could spare in order to protect the oasis that the Rivolde controlled. However to just need two hundred……</p><br/><p>“You mean to tell me you can overpower them with only two hundred warriors?”</p><br/><p>“I have the Red Storm warriors as well as Pareia’s Chief Shaman, Tuma Takaka-nim.”</p><br/><p>“Even so, the total number is less than 300. (TL: THIS IS SPAAAAARTAAAA!) I know your Red Storm has many veteran warriors, and the warriors I would lend you will all be strong warriors who could rival their strength, but Pareia has so many valiant warriors. What can you do with that small amount……?”</p><br/><p>Yulian shook his head as he responded.</p><br/><p>“There is no reason to go against all of them. What I need the most right now is time. I’m thankful that I was able to recover quickly and plan things out. I’m sure it was my father blessing me from the heavens.”</p><br/><p>“Tell me. What do you plan to do?”</p><br/><p>Yulian looked at Dejaine. Dejaine was his deceased father’s sworn brother, and his wife’s father. In addition, it was because he had such a great influence that he was known as the Great Glow.</p><br/><p>Yulian was sure Dejaine was tempted by Librie. There is no way that the devious Janet didn’t think about the aftermath of the rebellion. The stupid Librie would have just followed whatever he told her to do.</p><br/><p>Yulian asked.</p><br/><p>“There is something I need to first ask you as the Great Glow of Rivolde, as well as my father-in-law.”</p><br/><p>“Ask.”</p><br/><p>“What did Librie request?”</p><br/><p>Dejaine hesitated at Yulian’s question. For a moment, he thought that someone released the details of that meeting. However, there was no way his son-in-law, who woke up yesterday and realized what happened before setting up his course of action, would know about it.</p><br/><p>‘I’m sure it is just his intuition. His extremely sharp intuition.’</p><br/><p>Dejaine thought like that as he started to laugh.</p><br/><p>“Are you doubting me?”</p><br/><p>“If I doubted you, I would have disappeared and you would not know where I have gone. I choose to trust the Great Glow and my father-in-law. However, I feel like I need to know. That is why I am asking.”</p><br/><p>Dejaine was satisfied at Yulian’s answer and responded.</p><br/><p>“I’m sure if that was the case, you wouldn’t ask like this either. Fine, I will tell you. About a day after you arrived here, Librie sent someone over. She promised that she would hand over two of Pareia’s 11 oasis in return for us catching you and returning you to Pareia as soon as you got here, or not giving you any help and pretending like we didn’t see anything.”</p><br/><p>“This! What a heinous woman.”</p><br/><p>He had anticipated it, but hearing Dejaine say it out loud made him extremely angry, leading him to shout.</p><br/><p>“I thought that it would be better for me to pretend like I didn’t know what was going on and accepted the request.”</p><br/><p>At Dejaine’s word, Yulian looked towards Dejaine with a shocked expression.</p><br/><p>“Why are you looking at me like that? You need to make your opponent feel at ease in order to easily stab them in the back.”</p><br/><p>“......”</p><br/><p>This was why you could not ignore the old warriors. He was a very scary person, fitting the many years he has sat in the position of Glow.</p><br/><p>“You are amazing. And very scary, Glow Dejaine-nim.”</p><br/><p>Dejaine smiled at Yulian’s words and responded.</p><br/><p>“With just this much, I kept my loyalty to your father Baguna, as well as the love I have for you as my son-in-law. I am saying this because it was brought up, but I’m sure you know better than I do that there needs to be a compensation for this help.”</p><br/><p>Dejaine’s words were expected and Yulian accepted it. And believed.</p><br/><p>Dejaine Nellisi. His father-in-law was someone he could spill everything to.</p><br/><p>“Of course. Once we handle the rebels and defend against the Shuarei’s attack, my gratitude for your help in this endeavor, I will return it a thousand, no ten thousand fold.”</p><br/><p>Dejaine was very happy. The only thing that continues to develop as you get older is your ability to read people.</p><br/><p>His son-in-law was a really great warrior. He will become a hero. Dejaine believed that this promise will definitely be worth quite a bit in the future.</p><br/><p>“Can I ask you about your plan?”</p><br/><p>Yulian started to share everything he thought about throughout the night.</p><br/><p>“Time is of the essence. Before Janet and Librie can cause any more issues, I need to go around to each of Pareia’s oasis.”</p><br/><p>“For what reason?”</p><br/><p>“I need to visit them individually to get their sworn loyalty. I trust in the wise chiefs of Pareia. I know that they will recognize that this plot was Librie and Janet’s doing.”</p><br/><p>Dejaine challenged him.</p><br/><p>“And if they did not?”</p><br/><p>“I’m sure you’re aware. The position of Glow is one that only those who have been recognized as deserving can hold. Unless your abilities are recognized, no, more importantly, they will not accept Orca, who has not even completed his coming-of-age ceremony to be the Glow. I’m sure they will think that it will be smarter to pick a new Glow from a different family. By now, the chiefs should be meeting to discuss this issue.”</p><br/><p>Dejaine could not find any fault with Yulian’s logic. The position of Glow in a tribe was not something that a little kid who has not completed his coming-of-age ceremony could hold.</p><br/><p>If it was his son-in-law’s other brother Pere who had plotted like this, it would have been quite difficult.</p><br/><p>“I guess you should be thankful that it wasn’t your immediate younger brother.”</p><br/><p>Yulian smiled at Dejaine’s words as he responded.</p><br/><p>“Although I lost my father because of this incident, I have gained my younger brother. If Pere was the one who caused this, I’m sure I would not have had any way to fight back.”</p><br/><p>Yulian had the same thought as Dejaine.</p><br/><p>“If it was Pere… if Pere had done this, everything would have been over.”</p><br/>\n</div>"}