{"title": "Book 2-2.6", "id": 58, "volume": 2, "url": "http://boxnovel.org/red-storm-book-2-26", "volume_title": "Volume 2", "body": "<h1>Book 2-2.6</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Book 2-2.6 Visiting the Oasis (III)</p><br/><p>Yulian quickly lifted Yarumaha back up and hugged him.</p><br/><p>“Yarumaha-nim, thank you very much. I hoped you would understand if I came at you with the truth, but for you to believe me like this without any proof, all I can do is thank you.”</p><br/><p>Yarumaha finished hugging Yulian and started to speak.</p><br/><p>“Yulian-nim is now Pareia’s Glow. Please speak informally and rather than requesting, please give this Yarumaha a command. The Senei family will pledge their loyalty to the Glow’s command for the glory of Pareia and the glory of our family.”</p><br/><p>Yulian’s heart was feeling very full. He had overcome one of the hardest obstacles in his way.</p><br/><p>Yarumaha’s actions were going to impact the decision of all of the other chiefs he had to persuade as well.</p><br/><p>“Thank you. However, I will speak in the way that is most comfortable for me. The wise Yarumaha-nim is an elder who is deserving of the Glow’s respect.”</p><br/><p>Yarumaha was someone who had even received Glow Baguna’s respect.</p><br/><p>“Thank you. I will work hard to be the Yarumaha who is deserving of your respect. Is your plan to continue visiting each oasis and convincing the chiefs?”</p><br/><p>“Yes. Once I prove my innocence to each oasis, I will officially become the Glow while receiving everyone’s blessings.”</p><br/><p>Yarumaha received Yulian’s word.</p><br/><p>“This old man will accompany you. Although I may not be much, I believe that I will be of assistance to the Glow.”</p><br/><p>“The Shuarei will start their attack soon. Shouldn’t Yarumaha-nim stay here to prepare?”</p><br/><p>Yarumaha shook his head before looking behind him.</p><br/><p>“The warrior Vibli who is known as the Angry Brandistock is here. It’ll be difficult for him to defeat the War God Venesis, but he is extremely experienced at defending. There shouldn’t be any problems until Glow Yulian-nim manages to get a pledge of loyalty from all of Pareia’s oasis.”</p><br/><p>“It looks like we will need to move quickly. I am worried about both the Shuarei and the Wikaly.”</p><br/><p>“Then we must move immediately. But it does not look like you have many warriors. Just in case something goes wrong, I will gather some of the warriors from my oasis to go with us.”</p><br/><p>Yulian put on a bitter smile.</p><br/><p>Although everybody knew what was on his mind, they seemed to be against his actions.</p><br/><p>“I just put my trust in Pareia’s wise chief-nims.”</p><br/><p>“Even so, you cannot be like this. You must maintain your face as the Glow. Please don’t ignore this advice that is coming from my loyal heart. I will get them ready quickly.”</p><br/><p>Yulian had no choice but to nod his head.</p><br/><p>A bit later, both camps of warriors who came to understand what happened cheered in joy.</p><br/><p>Everyone had been hoping and praying that there would be no need for them to fight.</p><br/><p>The warriors of the Cold Oasis cheered a second time for the well-known warrior of Pareia, the Young Glow Yulian, officially becoming the Glow.</p><br/><p>Yulian’s first step towards becoming Pareia’s Glow was safely and successfully completed.</p><br/><p>‘We are almost there. Librie, wait for me. I will spit on that abominable face of yours and stab my sword through your heart.’</p><br/><p>Yulian looked toward the sand horizon in front of his eyes as he proclaimed in his heart.</p><br/><p>__________________________________________________________________</p><br/><p>“What did you say? Someone who does whatever he wants?”</p><br/><p>Yulian became anxious at his master’s face that he couldn’t distinguish between either a murderous aura or playfulness.</p><br/><p>“Please also consider what I said after that, master.”</p><br/><p>“I do not remember what you said after that. How dare you talk bad about your master in front of someone else. I’ve been holding back this whole time for the tiniest amount of longing I had for you while I was traveling, but now you are trying to climb over my head.”</p><br/><p>“That is not it.”</p><br/><p>Pupupupupuuuhuhuhuhuhuhuk!</p><br/><p>Yulian started to shout in pain as Chun Myung Hoon’s fists that were faster than the eye can see, punched him all over his body.</p><br/><p>“Ack! Master! Please consider my age and my position. This is making you look bad as much as me!”</p><br/><p>“You do not need to worry. I already made it so that not a single peep will make it out of this paoe.”</p><br/><p>Chun Myung Hoon’s laughter, which seemed to be saying that he had already prepared everything, made Yulian give up.</p><br/><p>Puk! Puk! Clack!</p><br/><p>“Clack...clack? You dare to block?”</p><br/><p>On Chun Myung Hoon’s third punch, Yulian desperately, and extremely luckily, managed to block one punch. But once he did, Chun Myung Hoon’s glare became much worse.</p><br/><p>“This is proof that I have been training very hard. Please do not glare at me like that. Also, a flower grown in a greenhouse will not live longer than a cactus that has survived the extreme sunlight of the desert.”</p><br/><p>Knowing very well what Yulian was trying to say, Chun Myung Hoon couldn’t come up with a good enough answer to squish Yulian. Since he didn’t have any response, his fist responded for him.</p><br/><p>Pow! Pow! Pow!</p><br/><p>“Now you are trying to teach your master. You are definitely lacking a beating. That’s definitely it.”</p><br/><p>His fast and sharp punches landed all over Yulian’s body as Chun Myung Hoon shouted. Yulian placed his hand on his great sword and shouted back.</p><br/><p>“Please accept it now! If it was not me, who could handle your anger? And please stop hitting me. I am no longer a child. I am a proud adult male who might soon be the father to a child.”</p><br/><p>“Ho! Now you are trying to fight back. Fine, let’s take care of this today.”</p><br/><p>Chun Myung Hoon lifted his index finger at his disciple’s opposition.</p><br/><p>That night, the paoe was rowdy but not a single peep came out of it.</p><br/><p>The next morning, Yulian claimed that he did not have any appetite and skipped breakfast.</p><br/><p>People found it to be weird, but since he looked fine on the outside, they really thought that he just didn’t have any appetite.</p><br/><p>Chun Myung Hoon had considered his disciple’s reputation and only hit places that were not visible, and only enough that he could still move.</p><br/><p>This extremely wise master then slowly disappeared.</p><br/><p>End of chapter two.</p><br/><p>Next chapter:</p><br/><p>Glow Yulian Provoke.</p><br/><p><i>It was finally starting.</i></p><br/>\n</div>"}