{"title": "Book 2-1.9", "id": 51, "volume": 2, "url": "http://boxnovel.org/red-storm-book-2-19", "volume_title": "Volume 2", "body": "<h1>Book 2-1.9</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Book 2-1.9 The Master Returns (III)</p><br/><p>If he had arrived just one day later, even he probably wouldn’t have been able to anything about it.</p><br/><p>“Go fill a large pot with clear, cold water. The size of the pot should be one that is big enough to completely cover Yulian. First, I will need five of those pots.”</p><br/><p>At Chun Myung Hoon’s order, Grace urgently ordered people to prepare the pots. She also called someone else to go get Pere, the Red Storm warriors, and Tuma Takaka.</p><br/><p>Chun Myung Hoon put his hands on Yulian’s yeongdaehyul (the spirit tower of a person, located in the center of the back) (TL: known as the ling tai acupuncture point) and let the poison spread throughout the body to heal him. It was a weird way to heal him.</p><br/><p>“Senior……”</p><br/><p>Seeing that Yulian’s face turned lighter but that in return, Yulian’s whole body started to turn blue once Chun Myung Hoon started to touch him, Grace was worried and cautiously called out to Chun Myung Hoon even though she was thinking to herself, ‘I shouldn’t talk, I shouldn’t talk.’</p><br/><p>“Do not worry. I plan on removing the poison using his whole body, so I spread the poison that was gathered in one location out.”</p><br/><p>A bit later, hearing that the pots were ready, Chun Myung Hoon lifted Yulian up and headed outside the paoe.</p><br/><p>Chun Myung Hoon took a look at the water and frowned a bit. The water was not as clear as he thought it would be.</p><br/><p>“Boil the water and then let it cool. You said Tuma Takaka is here too, right?”</p><br/><p>“Yes, senior.”</p><br/><p>The moment Grace answered, they could hear Tuma Takaka’s voice coming from far away.</p><br/><p>“Chun Myung Hoon, you have finally returned. This is truly the help of the heavens, the help of the heavens.”</p><br/><p>“Tuma Takaka, it has been a while. A plot like this even with you there, this Chun Myung Hoon was very surprised.”</p><br/><p>Tuma Takaka was the person Chun Myung Hoon was the closest to while he was in the desert. He was the only old man who could at least somewhat keep up with him in Yulta, they both admired each other’s knowledge, and since they were similar in age, they were able to casually speak with each other.</p><br/><p>“I couldn’t do anything about it since all of it happened without warning.”</p><br/><p>Tuma Takaka shrugged his shoulders before noticing Yulian in Chun Myung Hoon’s arms.</p><br/><p>“Yulian-nim… can you cure him? It is beyond my powers so you are the only one I can rely on.”</p><br/><p>“I can’t let my disciple die in front of my eyes. But this water is not clear enough. I told my disciple’s wife to boil the water and cool it down, but I hope you can quickly cool the boiling water with that spell of yours.”</p><br/><p>Listening to what Chun Myung Hoon needed, Tuma Takaka looked inside the pot before asking.</p><br/><p>“So it just needs to be cold and clear?”</p><br/><p>“That is correct. In order to remove this poison that is full of yang energy, the water needs to be cold and clear. The colder the better.”</p><br/><p>Tuma Takaka nodded his head and answered.</p><br/><p>“I will get it ready for you soon. Just wait.”</p><br/><p>Tuma Takaka moved his body left and right as he walked around a pot. Words that sounded like jibberish were coming out of his mouth following a rhythm, and every so often, his wooden staff would strike the ground.</p><br/><p>Daaaaang~ Dang~</p><br/><p>As Tuma Takaka hit the pot with his staff, a metallic sound came out of the wooden pot.</p><br/><p>“It is ready. Take a look.”</p><br/><p>Chun Myung Hoon took a look into the pot after hearing Tuma Takaka’s words, and indeed, the water that was a bit dirty was now so clear that the eyes of the people staring at it would get cleaned as well.</p><br/><p>After putting his finger in to verify the extremely cold temperature of the water as well, Chun Myung Hoon looked at Tuma Takaka while speaking.</p><br/><p>“One day, those spells of yours, I will definitely learn it.”</p><br/><p>“I’ve been setting the foundation for my spells for over fifty years. If you have the skills to take it, go ahead.”</p><br/><p>Chun Myung Hoon smiled at Tuma Takaka’s retort and thought to himself while looking at the water in the pot.</p><br/><p>‘No matter how many times I see it, it is an amazing talent. If you use some type of ice magic, you could make it cold, but how do you explain this clear water?”</p><br/><p>Remembering about Yulian in his arms, he removed all of Yulian’s clothes and put him into the pot feet first, all the way until he was completely submerged.</p><br/><p>“If you do that, how can he breathe……”</p><br/><p>As Grace was shocked seeing Yulian’s whole body go into the pot and tried to step forward, Tuma Takaka grabbed her shoulder and shook his head.</p><br/><p>“Just stand back and watch. There is definitely a reason for that man to be doing this.”</p><br/><p>At Tuma Takaka’s persuasion, Grace just stood in place with a nervous expression.</p><br/><p>After submerging Yulian into the water, Chun Myung Hoon hugged the pot with his arms and started to bring forth his ki.</p><br/><p>In an instant, the water in the pot started to spin, and as it started to speed up, Yulian started to spin with the water as well.</p><br/><p>‘How is this possible.’</p><br/><p>What happened next made everybody’s jaws drop.</p><br/><p>The speed of the spinning water became so fast that the water started to shoot up into the sky in the shape of the pot. Even while doing that, not a single drop of water fell out.</p><br/><p>“The color of the water.... The color of the water……”</p><br/><p>The people started to talk. The clear water that was shooting up to the sky was starting to turn black.</p><br/><p>“Tuma Takaka, please prepare the next pot.”</p><br/><p>As Chun Myung Hoon spoke while just turning his head to keep his arms around the pot, Tuma Takaka urgently nodded and headed to the next pot.  He then used the same method to turn the water clear and freezing cold.</p><br/><p>“It is ready!”</p><br/><p>Chun Myung Hoon nodded his head and tapped on the pot. Yulian’s body started to float up and accurately fell towards the next pot.</p><br/><p>It was amazing. Without moving a single finger, he was able to move Yulian, whose large size was well-known throughout the desert, to the location of his choosing.</p><br/><p>Even Dejaine Nellisi forgot about his appearance as Glow and dropped his jaws while watching this scene play out.</p><br/><p>What they saw in the first pot repeated in all five pots. The only difference would be that although the water in the first pot turned completely black, as he changed pots, the color got lighter and lighter.</p><br/><p>The five pots were filled with new water and the same process was repeated. After the eighth pot, the water did not change color anymore.</p><br/><p>Chun Myung Hoon must have been at least a little bit tired, as his face was a bit red.</p><br/><p>“That should do it. Lay him back down. He should wake up in a little bit.”</p><br/><p>Hearing Chun Myung Hoon’s words, Pere and Grace hurried over to Yulian and wrapped a cloth around him, and carried him back into the paoe to lay him down.</p><br/><p>To be submerged in that cold water with the body of a patient, his body was like ice. Grace worked hard to massage Yulian’s body for about thirty minutes.</p><br/><p>After thirty minutes, Yulian’s eyelids started to shake before he opened his eyes.</p><br/><p>“Ah...my dear, you’ve woken up.”</p><br/>\n</div>"}