{"title": "Book 2-5.1", "id": 69, "volume": 2, "url": "http://boxnovel.org/red-storm-book-2-51", "volume_title": "Volume 2", "body": "<h1>Book 2-5.1</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>The Meeting of the Two War Gods</strong></p><br/><p><i>The mere fact that the two of them were here together instantly made the battlefield much smaller.</i></p><br/><p>Book 2-5.1 After the First Battle</p><br/><p>The news about how the Shuarei ended up with an unprecedented defeat against Pareia quickly spread across the desert.</p><br/><p>After hearing about how Pareia’s new Glow went up against two of Shuarei’s Greatest Warriors at the same time and still managed to take one of their arms, nobody had a problem giving him the title of the War God of the Eastern Desert.</p><br/><p>It was rare for the desert to be riled up this much. In fact, it had only happened once in the last thirty years.</p><br/><p>That was the first time the War God of the Western Desert, the Bloodied Hands Venersis, went to war.</p><br/><p>It was the same way then.</p><br/><p>Shuarei’s young warrior Venersis had no issues going up against three of Pareia’s Greatest Warriors, and thanks to that, the Shuarei’s morale was burning hot as they quickly broke through Pareia’s formations.</p><br/><p>Pareia received critical damage because of it, and lost an oasis to the Shuarei in the process. To be more specific, you could say that they lost the oasis to Venersis.</p><br/><p>That was the campaign that gave Venersis the title of the War God of the Western Desert.</p><br/><p>After that, nobody dared to challenge Venersis to a battle of the Greatest Warriors by themselves.</p><br/><p>That would have been akin to committing suicide, and even if they stepped forward out of their pride, if they ended up dying, it wasn’t just a personal issue, it also affected the warriors because they would have lost their commander and would most likely end up losing that battle.</p><br/><p>Venersis proved it when he handled three Greatest Warriors, and this time, Yulian proved it by going against two on his own and capturing one in the process.</p><br/><p>The two War God forewarned that a new wind that will change the landscape of the desert will start to blow.</p><br/><p></p><br/><p>Although the night was deep, Pareia’s camp was still swept up in the joy of victory and chatting away. Since they were all warriors who knew how to take care of their bodies it shouldn’t be an issue, but the lead warriors were moving throughout the camp telling the warriors to start getting some rest.</p><br/><p>Although the warriors were eating and drinking and getting drunk off the feeling of victory, there were just three people who were inside a paoe strategizing for the next day’s course of action.</p><br/><p>“We need to to charge ahead once more. The Shuarei lost quite a bit of warriors in this battle, so it is the chance to take the Bushy Oasis, the same Bushy Oasis we lost in the past.”</p><br/><p>“That is true. In addition, as the victors we got a day to rest, while the enemy should have been too busy running away to rest properly. The pressure and stress of being chased is not comparable to any other type of fatigue. We need to use the momentum from this victory before the enemy can get their head back together to push on and take back the lost oasis before pushing forward and taking back the other lost oasis as well.”</p><br/><p>Egane and Mabis [1] supported each other’s statements as they explained that they needed to proceed forward as quickly as they could.</p><br/><p>Although it was pretty much decided, the commanding officer of this war was Glow Yulian.</p><br/><p>But Yulian respected the suggestion of the two warriors, and decided that they will proceed forward as soon as the sun came up.</p><br/><p>After chatting a little more about strategy and roles for the next day, the three people were finally able to eat a late dinner.</p><br/><p>Yulian started to speak while ripping apart a large chunk of meat with his two hands.</p><br/><p>“I saw and felt quite a lot of things today.”</p><br/><p>Trebol took a gulp of alcohol before opening his mouth with a satisfied expression.</p><br/><p>“It’s hard to find such a refreshing battle like today.”</p><br/><p>“If I am being honest with you, as Trebol just mentioned, an overwhelming success like this is something you will not find many times in your entire life. Today, our Glow’s performance was just too amazing. We were able to win so easily because the opponent’s Greatest Warriors were cornered by you. However, if there is something I can warn the Glow about, it would be that you should not think ‘war is like this!’ because today’s battle was too one-sided.”</p><br/><p>As Egane spoke like a strict teacher with fear that Yulian might get too arrogant and think too lightly about war, Yulian nodded his head in agreement as he responded.</p><br/><p>“I understand. However, I can’t seem to do anything about this boiling blood inside of me.”</p><br/><p>“That is normal for a young warrior. Even I will not tell you to cool that down. I will just leave this warning. Always remember where you are on the battlefield, as well as your position of Glow.”</p><br/><p>Listening to Egane’s words, Trebol playfully stuck his finger in his cup to wet it before flinging his finger toward Egane.</p><br/><p>“Egane, aren’t you being too strict? We need to teach him what he needs to learn while letting him enjoy the things he should enjoy. Wouldn’t that be the best way for the Glow to quickly get used to war?”</p><br/><p>Egane must have been used to Trebol’s horseplaying as he didn’t even lift his head up and casually put a piece of meat in his mouth as he avoided the drop of alcohol flung his way.</p><br/><p>“You are always so optimistic. I believe that you first need to know the pain of defeat. That is the only way for you to give it your all in order to make sure you do not lose again.”</p><br/><p>“No, you must first know what victory tastes like. Wouldn’t you try even harder the next time to taste that joy once again?”</p><br/><p>Yulian was entertained by the two Greatest Warriors’ contradictory opinions as he focused on eating the food in front of him.</p><br/><p>“Hmm, hmm.”</p><br/><p>As he heard someone clearing their throat outside, Yulian quickly stood up out of reflex.</p><br/><p>He then had a look of urgency on his face as he quickly ran toward the entrance of the paoe.</p><br/><p>The moment Egane and Trebol lifted their heads and turned to look toward the entrance, they heard a ‘Takong’ noise, which they could not figure out.</p><br/><p>“Ugh.”</p><br/><p>Followed by that short groan.</p><br/><p>The moment the two shocked Greatest Warriors quickly got up, Yulian and the old man called his master walked in. The two Greatest Warriors bowed their head toward the old man subconsciously.</p><br/><p>“I hope I am not intruding on the meal of the two warriors who are tired from the battle today.”</p><br/><p>Even though the old man was casually talking to the two of them, the two Greatest Warriors did not feel any type of reluctance.</p><br/><p>“We have heard a lot about you. We heard that senior was the one to bestow the two greatswords art to our Glow.”</p><br/><p>As Trebol nervously greeted the man, Egane stood up straight before bowing again and introducing himself.</p><br/><p>“I am called Egane. I have heard much about you, senior.”</p><br/><p>Chun Myung Hoon followed Yulian’s lead and leisurely sat down before motioning for them to sit.</p><br/><p>“Please continue with your meal. I just hope my terrible disciple didn’t cause you any problems today. This punk does have some tact, so if you teach him well, he’ll be somewhat useful.”</p><br/><p>The two Greatest Warriors didn’t know what to do with Chun Myung Hoon’s statement.</p><br/><p>They were not used to anyone looking down on their Glow and calling him a punk.</p><br/><p>Even if the previous Glow, Baguna, was alive, he would not use that type of title for the Young Glow.</p><br/><p>“Master. I am now a proud chief of a tribe, if you talk like that my reputation……”</p><br/><p>Takong!</p><br/><p>The two Greatest Warriors figured out the cause of the earlier noise.</p><br/><p>It was the noise of Chun Myung Hoon grabbing Yulian’s head and flicking it with his finger.</p><br/><p>“Ugh. Master. You really won’t save me any face?”</p><br/><p>“Face my ass. You dare to talk about your face in front of me? Who taught you that clumsy swordsmanship that you used today? Are you sure you didn’t secretly get another teacher while I was away? I don’t recall teaching you such stupid looking swordsmanship.”</p><br/><p>“Didn’t your disciple still win in the end?”</p><br/><p>“You call that winning? You were struggling until somehow your enemy had no luck and fell off his pirma. Plus, if I did not glare at you at that moment, do you think you would have had the same result?”</p><br/><p>Yulian finally realized the reason he felt the murderous aura that felt like cold water was being poured on his head and shouted.</p><br/><p>“Now that you mention it, that sharp murderous aura that went through my body was from you master. Were you trying to kill your disciple? Do you know how shocked this disciple was because of that sudden murderous aura?”</p><br/><p>Booooong~</p><br/><p>As soon as he finished talking, Yulian lowered his head for an unknown reason. Chun Myung Hoon’s fist grazed by Yulian’s head a moment later.</p><br/><p>“Ho~. Seeing as how you keep trying to talk back to me these days, it must mean that you don’t need someone like me anymore. Is that it? You must be out of your mind.”</p><br/><p>“Please think about when you get old. Really old. If it is not this disciple of yours, who will take care of you when you are old? You are not planning on spending your last moments curled up in a paoe are you?”</p><br/><p>Chun Myung Hoon snorted as he responded.</p><br/><p>“Snort. You just keep saying things that’ll get you beat up. You think I, Chun Myung Hoon, will tell you to take care of me in the future? Do not worry. Many of the countries in the continent will politely receive me. There are so many countries inviting me to do nothing and just sit there that I cannot even count. If I recall correctly, some of them even offered thousands of beauties, and a giant load of gold, silver, and other treasures.”</p><br/><p>“Why are you saying such useless things? What would you do with thousands of beauties at your age? Do you not remember how you told me to look at gold? Why would such a person care about a giant load of treasures?”</p><br/><p>As Yulian did not stop and continued to talk back, Chun Myung Hoon released his ki.</p><br/><p>BOOOOOOOOOOOOOOOM!</p><br/><p>__________________________________________________________________________</p><br/><p>[1] Author seems to have mixed it up. Should really be Trebol. Mabis was the Shuarei Greatest Warrior</p><br/><p>Become a patron and get advanced chapters!</p><br/>\n</div>"}