{"title": "Chapter 106", "id": 106, "volume": 2, "url": "http://boxnovel.org/red-storm-chapter-106", "volume_title": "Volume 2", "body": "<h1>Chapter 106</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>The Decisive Battle</strong></p><br/><p><i>He knew it was reckless. But he could not retreat.</i></p><br/><p><i>He needed to make 20,000 warriors stop with just 3,000 warriors.</i></p><br/><p>Book 3-6.1 Grief</p><br/><p>“Call Greatest Warrior Egane.”</p><br/><p>Yulian’s face looked like he had lost a lot of weight in the one day since the defeat as he came out of his paoe and looked for Egane.</p><br/><p>Egane, who came into Yulian’s paoe, did not look any better.</p><br/><p>Egane was thinking that this terrible defeat was his fault. It made him feel even worse, thinking that they would not have faced such a defeat even if they fought against the Wikaly in a head-on-battle.</p><br/><p>“Lift up your head and open up your shoulders. You are Pareia’s strength and pride. You will affect the other warriors if you walk around like that, Greatest Warrior Egane.”</p><br/><p>Egane clenched his eyes shut at Yulian’s words. He was embarrassed. He was so embarrassed he wanted to die.</p><br/><p>“It was my fault. A terrible mistake that I would have nothing to say as an excuse no matter what you say. If the opponent was Venersis, this type of defeat would not have happened. Even though I knew the opponent was at that level, I subconsciously looked down on him. It is my fault for taking it easy with our patrol warriors.”</p><br/><p>“You only went ahead with the plan because I, along with all of the other Greatest Warriors, agreed to it. This is just the result. Our enemy fought really well, nothing more, nothing less. Confidently open up your shoulders. Even if you had made a mistake, you must do that.”</p><br/><p>“Mmmmmmm~!”</p><br/><p>A long sigh was coming out of Pareia’s One Hundred battle Veteran, Egane, whose name was known throughout the desert. Another round of remorse filled his heart, knowing that he even lost Trebol, who he had worked together with for the last thirty years, in this last battle.</p><br/><p>“Return to Pareia.”</p><br/><p>“What? Ah! No.”</p><br/><p>Egane opened his eyes and started to respond to Yulian’s words before stopping as a thought lit up his head.</p><br/><p>‘Someone needs to take the responsibility for the defeat.’</p><br/><p>Egane was thinking that Yulian was relieving him of duty to take responsibility for the defeat.</p><br/><p>But Yuilan’s following words were not about that.</p><br/><p>“Return to Pareia and and gather more warriors in addition to the 5,000 we have in reserve. Other than the oases that are on the border with the Shuarei, gather as many warriors as you can from the rest.”</p><br/><p>“What do you mean by that?”</p><br/><p>Yulian clenched his teeth once before responding.</p><br/><p>“It is not like we can just retreat like this. If we give up like this, even Metro, who has taken over the center of the Wikaly oases will not be able to last.”</p><br/><p>“I understand Glow’s will, but it will take too long.”</p><br/><p>“Do not come back here, but go directly to the center. Since Greatest Warrior Thriger has already gone through that path once, he should be able to shorten the time even more. Greatest Warrior Metro should have also determine the fastest route from the quicksand river to the central oases as well.”</p><br/><p>“But Metro will still not be able to last the amount of time it takes for us to return.”</p><br/><p>“I will order Greatest Warrior Metro to move north, taking all of his warriors with him. He will be doing his best to avoid the Wikaly warriors who will move up from here.”</p><br/><p>Egane continued to voice his concern at Yulian’s words.</p><br/><p>“The question is whether he will be able to last the full duration of my returning to Pareia and taking the warriors. They will not have a stronghold if they abandon the oasis they have taken. They also will not be able to rest peacefully because of the large number of enemies.”</p><br/><p>“I will hinder the enemy from moving north as much as I can. He will need to take over the other oases as he moves north. There shouldn’t be more than 20,000 enemy warriors left up north.”</p><br/><p>“What? How will you do that?”</p><br/><p>“3,000 warriors have a very low amount of restrictions. We will be able to move forward without worrying about what is behind us.”</p><br/><p>“Are you saying you plan on cutting through the enemy?”</p><br/><p>“No, more of a hit and run. If 20,000 warriors are moving, they can’t help but move slowly. If they split into smaller groups, then they will need multiple supply transports. We just need to catch all of those supply transports.”</p><br/><p>It made sense.</p><br/><p>If they could hinder them like that, they would be able to create time for Metro, as well as give him time to return to Pareia and head for the center of the Wikaly oases.</p><br/><p>Egane nodded his head and answered.</p><br/><p>“I will do as you said. If you wait just one month, I will make sure to get there.”</p><br/><p>It took them a whole month to get here with 20,000 warriors, but since only Egane and a couple guard warriors will be returning, they should be able to return to Pareia within 20 days if they ride quickly. Then it should take about ten days to take the warriors and head up the quicksand river. So just one month!</p><br/><p>“I will hold the enemy back as much as I can.”</p><br/><p>“I’m sorry, Glow. It is because of my mistake.”</p><br/><p>“Do not let this defeat bring you down. Didn’t you say winning and losing happens all the time in war? We just have to return the same to them.”</p><br/><p>“I understand. Then I will leave right now as each second is precious.”</p><br/><p>“Please work hard.”</p><br/><p>Once Egane left, Yulian called Vibli and the other Greatest Warriors and shared his thoughts with them.</p><br/><p>There were some concerned voices, but there was really nothing else they could do right now.</p><br/><p>“We have 3,000 remaining warriors. The four of you Greatest Warriors can split them up and move individually. You can think of it as different specialty teams. I’m sure I don’t need to say this, but do not fight against the enemy. Hinder them as much as you can, and prevent them from moving north. Make the warriors feel a sense of revenge and mercilessness. This next month will be a very difficult month as Greatest Warrior Metro moves north with success and Greatest Warrior Egane takes the reinforcements up the quicksand river. Please warn the warriors about this in advance.”</p><br/><p>Even without Yulian’s urging, the Greatest Warriors were all One Hundred battle veterans.</p><br/><p>They were already coming up with plans in their heads about how to move and how to hinder the enemy.</p><br/><p>“It has been a while since I moved with a small group like this. It has also been a while since I’ve been able to fight freely with my brandistock.”</p><br/><p>Vibli answered calmly, but his heart was fired up. If it is a special team, he would be able to fight as well and remove the shame from his last defeat.</p><br/><p>Since he had been a Greatest Warrior for a long time, he had not been able to fight much because he was tied down commanding the warriors.</p><br/><p>He was able to swing his brandistock during battles of Greatest Warriors, but even that opportunity was gone once Venersis ended up being their enemy.</p><br/><p>But now, he was able to show everyone why he had the name of ‘Angry Brandistock.’</p><br/><p>The other Greatest Warriors were feeling the same way.</p><br/><p>Yulian encouraged the Greatest Warriors one more time before sending them off and started to head out as well.</p><br/><p></p><br/><p>The Red Storm’s mood was as low as it could get. This was the first battle they had ever lost their comrades. They even lost a huge amount of nine of them at once……</p><br/><p>Even when they faced 20,000 warriors with just the Red Storm, none of them had died. Although they were surprised and in unfavorable conditions, they could not believe the fact that nine of them had died.</p><br/><p>They knew they didn’t need to grief warriors who proudly died fighting for their tribe, but their hearts were not letting them do that.</p><br/><p>“Damn bastard.”</p><br/><p>Shubeon muttered to himself while clenching a leather necklace with three Bavis (one of the most violent wild animals in the desert. It looks like an elephant, but their nose is short and they are carnivorous. They can be trained and used in war, but there are not many because it is very hard to tame them) teeth.</p><br/><p>Everyone knew who the owner of that necklace was. It was the necklace Triquel always had on him. He had made it as a souvenir to remember the animal he took down for his coming-of-age ceremony.</p><br/><p>Shubeon had taken it off Triquel’s neck once Triquel died.</p><br/><p>“How could the one who claimed to be the best be the first to die? This is disobeying command. The rest of them are the same. We were told not to die … but they die before the rest of us? Damn bastards.”</p><br/><p>The warriors all lowered their heads at Shubeon’s words. Triquel was the mood maker for Red Storm. To think that they would never hear that loud laughter or his bluffing ever again……</p><br/><p>Some of the dead warriors died while taking a hit to defend another warrior, while others died while taking the lead against all sorts of dangers.</p><br/><p>The weight of each and every one of their deaths was pressing down on Red Storm. They were all clenching their teeth and holding back their tears, knowing that if one of them started to cry, all of them would start to cry as well.</p><br/><p>“What are you all doing?”</p><br/><p>As Yulian appeared in front of the warriors who had their heads down, all of them turned to look at him.</p><br/><p>He had changed so much in a single day.</p><br/><p>Normally, just looking at Yulian made you feel like he was glowing. He had a mysterious aura that resonated from him. But right now, he just looked like a weak and brittle man.</p><br/><p>Shubeon was upset. That was why he said something he would normally have never said.</p><br/><p>“Why the hell do you look like that? You look like you just came back from the dead.”</p><br/><p>Shubeon also looked that way, but he didn’t care about that.</p><br/><p>“We are allowed to be that way, but the Glow cannot be like this. Isn’t the Glow someone who is supposed to be shining no matter the situation? Doesn’t it make us look bad if you show up looking like that? It makes us think you look like that because we couldn’t fight properly!”</p><br/><p>Shubeon was huffing. He was feeling like he would cry if he didn’t at least shout like this.</p><br/><p>Yulian immediately turned around.</p><br/><p>The warriors were crying.</p><br/><p>They weren’t visibly crying, but he could see them lamenting in their hearts.</p><br/><p>Seeing them like this almost made him cry as well, so he quickly turned around and clenched his teeth before putting a lot of strength in his eyes to prevent himself from crying.</p><br/><p>Thrint started to speak toward Yulian’s back.</p><br/><p>“Glow, you are not here to say we are going to retreat, are you?”</p><br/><p>“Of course not. How can we retreat like this...ni...ne of us were lost. We couldn’t even retrieve...the bodies of those damned bastards … they may be damn bastards, but they still died as warriors. Shouldn’t we at least give them a warrior’s respect and send them off?!”</p><br/><p>Shubeon was shouting loudly.</p><br/><p>“Shubeon!”</p><br/><p>Haisha held back the visibly upset Shubeon. Shubeon was normally very cheeky, but he was the sympathetic and affectionate warrior in the group. That was why he was always nagging everybody. He didn’t want others to know how he really was.</p><br/><p>Still, everybody knew the truth. That was why they enjoyed his nagging. But today, he was removing that mask and revealing his true self.</p><br/><p>He was the first of the warriors to cry.</p><br/><p>“I will not forgive you if we retreat like this! I will NEVER forgive you! If I find anyone heading back, I will rip their legs myself!”</p><br/><p>“Shubeon!”</p><br/><p>Haisha started to slap Shubeon’s cheek before hugging him.</p><br/><p>“We are in front of the Glow. Your anger, my anger, and all of our anger is here. Do not lose control, you little punk.”</p><br/><p>“I don’t need anyone! Even if everyone else goes back, I will remain here and kill them all! I will not return until I can give each and every one of those nine damn bastards a proper funeral with my own hands!”</p><br/><p>Shubeon continued to shout even while in Haisha’s arms, as if he had already lost all sense of reason.</p><br/><p>“Shubeon, I will kill you if you cry anymore Stop crying!”</p><br/><p>Thrint started to shout. That weak-hearted bastard was making him start to tear up as well.</p><br/><p>The majority of the warriors were all crying as well. But wouldn’t it be shameful if he cried as well? If he, the person who was known within the Storm as the most cold-hearted, started to cry as well, then they would really start to believe that something like this happened because they were not good enough.”</p><br/><p>“Shit!”</p><br/><p>Thrint started to curse. But none of it was directed at anybody. He just continued to swear, using it as a replacement for his tears.</p><br/><p>Yulian continued to have his back turned toward them as he looked up to the sky.</p><br/><p>‘Damn it.’</p><br/><p>Yulian started to head outside. He didn’t feel like he should stay here any longer.</p><br/><p>As they mentioned, the warriors would feel shameful if they cried in front of him. Plus……</p><br/><p>Yulian just rubbed around his eye like nothing was wrong.</p><br/><p>Become a patron and get advanced chapters!</p><br/>\n</div>"}