{"title": "Chapter 111", "id": 111, "volume": 2, "url": "http://boxnovel.org/red-storm-chapter-111", "volume_title": "Volume 2", "body": "<h1>Chapter 111</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Book 3-7.3</p><br/><p>“No matter what it is, chaos is bound to follow change. However, we cannot change if we fear that chaos. I want to catch up to the continent in every aspect that the desert is currently lacking in.”</p><br/><p>Runa tapped his head.</p><br/><p>“There is still a lot in this Runa’s head. All of them cannot be put into play right now, but someday, I plan to carry out each and every one of them. I absolutely need the assistance of the wise oases leaders to make it happen.”</p><br/><p>“......”</p><br/><p>The oases chiefs and the chieftains looked at one another without being able to say anything.</p><br/><p>Internally, they were thinking, and even shouting that ‘we can’t do this, it is too dangerous,’ but it was not easy to say it out loud.</p><br/><p>“Runa, I understand your desire. However, it is too fast. You are correct when you say the faster the better, but the amount of chaos increases the faster we go.”</p><br/><p>As Runa’s face started to turn dark at Yulian’s response, Yulian continued on.</p><br/><p>“Carry out your plan slowly in multiple parts so that we can minimize the chaos and guarantee we will not fail. Then use that to convince me as well as the wise chiefs that have gathered here today.”</p><br/><p>As Yulian responded for the uncertain chiefs, all of them nodded their heads to agree as they looked toward Runa.</p><br/><p>Even Runa was happy knowing that he had at least received a positive response.</p><br/><p>They will automatically start to follow his plan if he slowly showed them the process.</p><br/><p>“I understand. I will slowly show it to you. I will draw the foundation and start to color it one color at a time.”</p><br/><p>Runa answered in a confident voice to motivate himself.</p><br/><p></p><br/><p>The extremely long meeting finally ended long into the night.</p><br/><p>Yulian had planned on letting Runa stay next to his paoe for the time being.</p><br/><p>Although Runa became one of Pareia’s people, there may be many warriors who want him dead because of all of the warriors who died by his hands. So this was just a safety measure. He didn’t want something like that to happen, but you could never tell what people were thinking. Yulian did not want even the slightest of dangers to occur.</p><br/><p>Yulian asked Runa a question before they entered the paoe.</p><br/><p>“When did you prepare all of those things?”</p><br/><p>“It is something I have been thinking about even when I was in the Wikaly tribe. However, nobody had paid attention. Since I was a man who could not even complete his coming-of-age ceremony properly, they would not listen to anything I had to say.”</p><br/><p>As Runa bitterly answered Yulian’s question, Yulian put his hand on Runa’s shoulder as he responded.</p><br/><p>“I am different. I like people with talent. You might think I am being snobbish, but I believe that is the type of thinking all Glows should have. Show me what you are capable of doing.”</p><br/><p>“Do not worry, Glow. From here on out, you will have many headaches because of the suggestions I bring up. Hahaha.”</p><br/><p>Seeing Runa laugh, Yulian started to laugh as well, as the two of them started to walk again.</p><br/><p>“Glow.”</p><br/><p>“Hmm?”</p><br/><p>“Abham-nim is not someone who should have lived like that.”</p><br/><p>“I know. That is why he recognized your talent. However, since he announced his retirement as a warrior, there is nothing I can do.”</p><br/><p>Even after hearing what Yulian had to say, Abham had stumbled like a weak old man.</p><br/><p>You could say that he had lost all desire to do anything.</p><br/><p>“He is the only person to appreciate my abilities before you. Please do not take this the wrong way, but if Abham-nim had been the Wikaly Glow, the Wikaly may have won the last war. Even with the Glow having taken control of the quicksand river.”</p><br/><p>Yulian was not taken back by Runa’s dangerous proclamation. Yulian knew just how much Runa cherished Abham. Yulian started to laugh as he answered.</p><br/><p>“Hahaha, I will not disagree with you. Honestly, when Greatest Warrior Egane told me to make you one of my people, I had to think hard about it. I admired your abilities, but I lost too many of my close and important warriors because of you.”</p><br/><p>“I guess I should visit Egane-nim today and thank him.”</p><br/><p>Yulian started to smile at Runa’s response and put his hand on his chest as he continued to speak.</p><br/><p>“However, deep inside my heart, I knew that you were someone I absolutely needed to have. It became even stronger once I started to think about how having you could save even more lives in the future. That was why I threatened the Wikaly to make you mine.”</p><br/><p>“......”</p><br/><p>“I am even more certain about it after seeing you today. I do not question that our Pareia will develop significantly thanks to you.”</p><br/><p>“I will make sure to live up to your expectations. Anyways, when will that merchant named Edwin come again?”</p><br/><p>“I’m not sure. Since the war is now over, he should be bringing a load of materials soon. We will give our black water and Monster’s Souls to him, and he will give us items from the continent, as well as high quality iron and food. We need to prepare for the upcoming growth to our population.”</p><br/><p>“I am just disappointed that I was not there in the beginning. The Glow has given him too many things.”</p><br/><p>As Runa spoke with disappointment, Yulian shrugged his shoulders as he answered.</p><br/><p>“We needed an immediate investor since we did not have much time. Plus, you can’t do anything about the deals we have already promised. You should not need to worry much since we can always ask for anything we need.”</p><br/><p>“I am relieved to hear that. Please let me be the one to negotiate with him the next time he is here.”</p><br/><p>“I will give you the power to make any decisions in my stead.”</p><br/><p>“Thank you. We need to be competitive in order to change the culture of our tribe. I hope that this merchant has a large enough guild to make that happen.”</p><br/><p>“I can guarantee his reliability. He is someone who has not broken a single promise we have made.”</p><br/><p>“I guess it will be easy to work with him.”</p><br/><p>The two men slowly approached the paoe as they continued to talk.</p><br/><p>Guoooooooooooo~!</p><br/><p>Runa flinched after hearing that loud noise and questioned Yulian.</p><br/><p>“Glow, do you hear some type of noise?”</p><br/><p>“What noise?”</p><br/><p>Runa thought he had heard wrong after hearing Yulian’s response. If the Glow, who is a warrior among warriors, did not hear something that he had heard, he must have heard wrong.</p><br/><p>Guooooooooooo~!</p><br/><p>However, hearing this noise again, Runa asked once more.</p><br/><p>“Guo? It is a noise that sounds like a crying monster.”</p><br/><p>“Ah!”</p><br/><p>Yulian finally realized why Runa flinched and started to smile as he responded.</p><br/><p>“It is the noise of my wife’s pet.”</p><br/><p>“This pet makes quite a strange noise.”</p><br/><p>“Hahaha. You’ll need to get used to him so I guess I should officially introduce you. Do not be too surprised. Shopping!”</p><br/><p>Runa could feel something large moving in the darkness after hearing Yulian’s voice.</p><br/><p>He then felt something slowly crawling out from behind the paoe...as well as fear.</p><br/><p>“Ahhh!”</p><br/><p>Seeing the head of a large monster head toward Yulian, Runa shouted in shock.</p><br/><p>“Sand Dragon?”</p><br/><p>Yulian reached his hand out to pet Shopping’s head as he answered.</p><br/><p>“His name is Shopping. He is my wife’s pirma, as well as the warrior protecting my wife. You do not need to worry about him. He is completely tamed to the point he does not even drool while looking at people. When he is hungry, he just leaves to eat before coming back. He is a good boy that even brings back wild animals from time to time for us to eat.”</p><br/><p>“That...you...this monster...is your pet?”</p><br/><p>“You’ll get used to it the more you see him. We are hoping that this punk ends up becoming a giant. If that happens, we may be able to tame a few more Sand Dragons.”</p><br/><p>“Haaaa!”</p><br/><p>Runa let out a noise of disbelief, as Yulian patted Shopping’s head and introduced Runa.</p><br/><p>“He is a new family member. His name is Runa Brink. He is a very smart person, so if you try to trick him, you may end up looking stupid.”</p><br/><p>“He understands human speech?”</p><br/><p>Grrrrr.</p><br/><p>At Runa’s question, Shopping made a noise before approaching Runa. Runa jumped back in shock.</p><br/><p>“He does. He is after all the strongest monster in the desert. Once you get closer to him, just getting on top of him for a ride will be a good experience for you as well. There is nowhere better to get a good view of the entire desert than Shopping’s head.”</p><br/><p>“Haa~, I understand, Glow.”</p><br/><p>Runa calmed his racing heart before looking at Shopping. He didn’t think he would ever get used to it.</p><br/><p>“Let’s go in. I will officially introduce you to my wife.”</p><br/><p>“Yes...Glow.”</p><br/><p>Runa peeked at Shopping before quickly following after Yulian.</p><br/><p>“Grace.”</p><br/><p>Yulian lifted the cloth to enter the paoe as he called Grace’s name. Grace quickly hugged Yulian as if she had been waiting and started to speak.</p><br/><p>“The meeting went very late.”</p><br/><p>Yulian lifted Grace up as he answered.</p><br/><p>“I feel like it will continue to be like this for a while. I have someone to introduce to you.”</p><br/><p>Grace blushed a bit after realizing Runa was there before moving away from Yulian and greeting him.</p><br/><p>“I don’t believe I have met this warrior before. I am the Glow’s first wife, Grace Nellisi.”</p><br/><p>Seeing that Grace’s appearance was even more beautiful than he could have ever imagined, Runa subconsciously started to blush as he lowered his head and responded.</p><br/><p>“My name is Runa Brink. I greet the Mother of Pa...reia.”</p><br/><p>“Pfft, why are you so nervous? The Glow brings warriors over frequently, so there is no need to be nervous. Although it is true that you are interrupting a husband and wife’s alone time.”</p><br/><p>Once Grace realized that the young man in front of her was the warrior who had frustrated Pareia for so long, she took a good look at Runa. He seemed to lack the strength of a warrior, but he was a veteran warrior with decent enough looks that some of the desert’s young ladies would like him.</p><br/><p>Still, she decided to tease him a bit since he had caused her husband so much trouble. Runa’s face turned even redder and he was at a loss of what to do.</p><br/><p>“Grace, Runa is a warrior who is not married yet. Do not tease him too much.”</p><br/><p>“Ah! Why is a veteran warrior still not married? It is a big sin for a warrior to not be married. Did you not find any girls that you like in Pareia?”</p><br/><p>“That...well, that’s not it...I just … yet.”</p><br/><p>“I have played matchmaker for tens of warriors already. The majority of the Red Storm warriors met their wives through my introduction. Do not worry. I will find a nice young girl for you. It is tradition for a man to have a wife.”</p><br/><p>“That...yes...thank you.”</p><br/><p>Yulian laughed while looking at Runa being so nervous and started to speak.</p><br/><p>“Runa claims that a warrior needs to have at least three wives even if we have to force them, so introduce him to three young ladies.”</p><br/><p>“Omo! Is that so? He thinks like I do. I believe that a warrior needs to have at least five wives. As the Mother of Pareia, I guess I need to work together with Runa-nim to make that happen.”</p><br/><p>“Yes...thank you very much.”</p><br/><p>Grace smiled once more before asking Yulian a question.</p><br/><p>“Did you have dinner?”</p><br/><p>“Not yet. The meeting was so long. Runa was so passionately speaking that everyone just continued to listen to him. Now that I think about it, I am very hungry.”</p><br/><p>“I will prepare a meal.”</p><br/><p>As Grace went to a corner of the paoe to make the food, Yulian offered Runa a seat as he started to speak.</p><br/><p>“Tomorrow, we will build a paoe next to mine. You will live there from now on. But for today, rest here.”</p><br/><p>As Runa peeked toward Grace, Yulian started to laugh as he answered.</p><br/><p>“Hahaha, why is a warrior who was so confident in battle so timid right now? Do not worry. I normally fulfill my duty as a husband very well so she will be understanding for one night.”</p><br/><p>“Ah! So that’s the case.”</p><br/><p>“Yes. Pay close attention.”</p><br/><p>The two men started to laugh while exchanging some interesting words.</p><br/><p>That was the first night Runa could get a good night’s rest since surrendering to Pareia.</p><br/><p>Become a patron and get advanced chapters!</p><br/>\n</div>"}