{"title": "Chapter 204", "id": 204, "volume": 3, "url": "http://boxnovel.org/red-storm-chapter-204", "volume_title": "Volume 3", "body": "<h1>Chapter 204</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Book 6-1.5</p><br/><p>The sosoonta cut across her white arm.</p><br/><p>“Spread, my strength. My incantation.”</p><br/><p>As she started to chant her incantation in a quiet voice, her flowing blood spurted out like a bomb and started to create a fog of blood around her.</p><br/><p>“Violet-nim!”</p><br/><p>Some of the Red Storm warriors were shocked at what was happening and called out to her.</p><br/><p>At that moment, her staff was lifted up from the ground while her other hand was raised up in the air.</p><br/><p>Wake up.</p><br/><p>The power that comes forth from blood.</p><br/><p>Show your strength through my blood.</p><br/><p>What I desire is darkness.</p><br/><p>The chaos that stems from darkness.</p><br/><p>The fear that rises from chaos.</p><br/><p>Violet’s expression started to turn odd.</p><br/><p>Her hair started to rise up into the air, and her eyes that suddenly opened were completely bloodshot. </p><br/><p>Most importantly, an eerie sensation that even the average soldiers could feel started to come out of her.</p><br/><p>Using my blood that leads the souls to the afterlife as sacrifice,</p><br/><p>I call forward the strength that roams the earth.</p><br/><p>Show yourself through my blood this moment,</p><br/><p>Show your true body and strength in front of me right now.</p><br/><p>Nobody could move at that moment. The sensation that was coming out of Violet enveloped the entire Henkel Gate.</p><br/><p>Violet had covered her entire body with the blood coming out of her arm.</p><br/><p>The blood that was red, as well as the fog of blood that was in the air, started to turn black. It was starting to turn so black that it was almost impossible to describe.</p><br/><p>Come forth, the power that brings forth chaos.</p><br/><p>As Violet suddenly shouted out, that pitch black fog of blood instantly started to surround the black gate, and the gate was now filled with darkness. Neither the light of the currently setting sun, nor the light of the now rising moon, could pierce through that darkness.</p><br/><p>Nobody could see anything.</p><br/><p>Everybody started to become afraid. This fear was so strong that it could even make some of the Red Storm warriors flinch. A feeling of being pressured by something surrounded all of the soldiers at the gate.</p><br/><p>“Aaaaaah~.”</p><br/><p>“Save...me.”</p><br/><p>“What happened to my eyes? I can’t even see...my own hand.”</p><br/><p>The soldiers started to scream in fear. They started to shake in fear. And fear, tends to spread easily.</p><br/><p>“Ack~ I don’t want to die.”</p><br/><p>“O, lord~ please save us.”</p><br/><p>The soldiers started to fall into the chaos.</p><br/><p>There were some soldiers who curled up on the ground while covering their heads with both of their hands, as well as some who were lifting up prayers to the gods they believed in. There were even some soldiers who dropped their weapons and started to run, without even knowing where they were running. In fact, there were even some soldiers who were committing suicide because they were overwhelmed by the fear.</p><br/><p>The scariest thing was that they started to kill and die by the swords and spears of their own comrades.</p><br/><p>“Ack~.”</p><br/><p>Screams suddenly shot up in the air from multiple locations. All of the soldiers started to swing their weapons in all directions. If they stood still, they were going to die. The smart thing to do was to swing their weapon so that nobody could get close to them.</p><br/><p>That sight was even scarier than the sight of war.</p><br/><p>The entire gate was now full of screams and cries.</p><br/><p>It literally looked like the definition of complete and utter despair. It looked like a scene straight out of the depths of hell.</p><br/><p>The only ones to not fall into chaos within that darkness was Violet herself, the Red Storm warriors, and the highly skilled magicians of the magic brigade, Viscount Stearthur, and a couple of the soldiers who had strong wills.</p><br/><p>“Please use this moment to take a short break.”</p><br/><p>The Red Storm warriors flinched at Violet’s voice which had also changed.</p><br/><p>Plop.</p><br/><p>“Violet-nim.”</p><br/><p>Haisha shouted out and rushed toward her, and the rest of the Red Storm also gathered with Violet in the middle, killing any soldiers who approached them like crazy lunatics.</p><br/><p>“Are you okay?”</p><br/><p>Violet barely managed to open her eyes and speak.</p><br/><p>“Five minutes … just five minutes. I don’t think I can make it last more than that. I wish I could give you more time, but I am lacking too much strength.”</p><br/><p>The warriors looked at each other. They had never even heard about an incantation like this. But they could all recognize that this incantation was not an easy one.</p><br/><p>“Violet-nim?”</p><br/><p>Haisha called out to Violet, but Violet had already lost her consciousness.</p><br/><p>“Violet-nim did everything to buy us this time. Everyone, recover as much stamina as possible.”</p><br/><p>Everyone nodded at Haisha’s words and started to control their breath. The situation was still not good, which was making all of them nervous. But they knew that such nervousness did them no good, and forced themselves to calm down and take as many breaths as possible to recover their staminas.</p><br/><p>But that only lasted an instant. The five minutes Violet mentioned had not gone by, but strands of light started to appear in the darkness, weakening the effect slowly.</p><br/><p>It was the enemy’s magic brigade.</p><br/><p>“Burning pillar!”</p><br/><p>“Push light.”</p><br/><p>The magicians of the magic brigade were each using their own spells to add some light into the darkness.</p><br/><p>Thanks to that, the five minutes Violet mentioned quickly shrank to a little over two minutes.</p><br/><p>The moment Violet’s incantation was broken, Viscount Stearthur started to shout.</p><br/><p>“They are not humans. They are the devil. Our gods will surely protect us. Do not be afraid and push forward. Prevent those devils from approaching our cities.”</p><br/><p>There were not many soldiers who were in their right state of mind after being scared by the darkness. Fear, terror, and the sadness that followed had paralyzed them.</p><br/><p>That was why they were like dolls and just started to listen to the voice that told them to move forward. They could not think for themselves right now.</p><br/><p>End of chapter.</p><br/><p>Next up:</p><br/><p>The Changing Continent</p><br/><p>The continent was starting to change.</p><br/><p>And Pareia was at the center of it.</p><br/>\n</div>"}