{"title": "Chapter 3 Battalions Commander Chest Muscles are not bad! (2)", "id": 3, "volume": 1, "url": "http://boxnovel.org/heavenly-jewel-change-chapter-3-battalions-commander-chest-muscles-are-not-bad-2", "volume_title": "Volume 1", "body": "<h1>Chapter 3 Battalions Commander Chest Muscles are not bad! (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 3 Battalion’s Commander Chest Muscles are not bad! (2)</strong></p><br/><p>“Little Fatty Zhou, come here.” Shangguan Bing’er’s severe voice came from within. Zhou Weiqing was blank for a while, before remembering that it was addressed to him, and hurriedly proceeded inside.</p><br/><p>The huge building was filled with all sorts of army supplies, mostly meant for archers. Shangguan Bing’er did not sheathe her sword, instead slamming it down onto a table, before saying to one of the logistics soldiers: “Give him a set of equipment and then get him to scram.”</p><br/><p>There were more than 10 logistics soldiers in charge of taking care of the equipment and also giving it out. They had not witnessed the earlier debacle, and were really curious why the normally kind battalion commander was acting so angry. One of the veteran soldiers quickly took out a set of archer’s equipment and handed it over to Zhou Weiqing.</p><br/><p>Zhou Weiqing quickly took his equipment and looked through it. There were 2 sets of army uniforms, including socks, shoes and clothes, as well a set of leather armor, a longbow which was even taller than Zhou Weiqing, 2 quiver of arrows and a large hat.</p><br/><p>In the whole army, only the archers were issued the hat, and its purpose was not to block the wind, but rather to shade them from the glare of sunlight. After all, archers needed good vision in order to aim, and if they were in a position where they had to stare into the sun, it would adversely affect their aim. As such, all of the archers were issued such a hat to shade their eyes and increase their aim.</p><br/><p>The veteran soldier then gave Zhou Weiqing 3 gold coins, telling him: “This is your first year’s pay. You have one day leave to return home and settle everything. Gather back here by noon tomorrow. Remember, do not abuse your army supplies, when you gather back here tomorrow you will need to be dressed in your uniform. Understood?</p><br/><p>“Understood.” If not for what happened with Shangguan Bing’er earlier, Zhou Weiqing would probably be very excited with receiving his equipment. However, he was still immersed in the memory of the feel just now, thinking in his head that he would not be washing his hands for a while now.</p><br/><p>According to the normal procedures, Shangguan Bing’er should be saying some encouraging words now as a battalion commander. However, at this moment, how could she? The only thing she could do was to glare menacingly at Zhou Weiqing, who was rather spooked by the glare and did not dare to stay for long, grabbing things and rushing out of the headquarters.</p><br/><p>Shangguan Bing’er looked at his retreating back, and thought to herself: <em>Little Fatty Zhou, Little Fatty Zhou, just you wait, I’ll make you pay for that</em>!</p><br/><p>If Zhou Weiqing knew what Shangguan Bing’er was thinking, that despicable rascal will certainly answer: Sure, I’ll let you touch me back anywhere! Or perhaps even: My chest muscles aren’t as developed as yours!</p><br/><p>As he exited the headquarters, Zhou Weiqing noticed that there wasn’t anyone around, and looking around he spotted an area with a toilet signage, which had a strange symbol he did not recognize.</p><br/><p>He hurriedly grabbed his gear and rushed to the toilet, which was a lot cleaner and pleasant smelling than he had expected, though it only had one cubicle and a wooden door.</p><br/><p>Zhou Weiqing found a clean spot to place his equipment, then removed his clothes. Earlier on, most of his clothes had been destroyed besides his over coat, and it was extremely uncomfortable. Since he had already gotten his army uniform, he decided to change into it as soon as possible.</p><br/><p>Removing his overcoat, he was now totally naked. He was in no rush to change, but stood there relaxed to take a piss.</p><br/><p>At this time, he heard the door opening. Zhou Weiqing was still urinating, and he subconsciously looked back, only to see Shangguan Bing’er walk in.</p><br/><p>As Shangguan Bing’er entered the toilet, the first thing she saw was Zhou Weiqing’s naked butt, and he was still shaking his ‘tool’ after finishing up. That sight sent her into a shock, and that was the moment that Zhou Weiqing turned around. Their gazes met, and two shrill shrieks sounded out at the same time. The weirdest thing was that Zhou Weiqing’s despicable scream was even more exaggerated than Shangguan Bing’er’s.</p><br/><p>Shangguan Bing’er’s lovely face was red with embarrassment, and she backed out in a flash. Zhou Weiqing hurriedly shook his ‘tool’ to finish up, and put on his uniform quickly, thinking that he was done for now. Holstering his longbow onto his back, shouldering the quivers and putting on the hat, he took quick steps toward the exit, thinking to himself: I better make a quick run for it and hope for the best.</p><br/><p>“Stop!” Shangguan Bing’er shouted in anger towards Zhou Weiqing, her face pale in anger. “You perverted flasher! Just wait there and I’ll deal with you.” As she said that she rushed towards the toilet.</p><br/><p>It was truly another unbelievable coincidence. The reason Shangguan Bing’er barged in without checking was because that toilet was actually for her personal use, hence the unknown symbol on the signage, which actually referred to the Battalion Commander’s personal use. After all, she was a girl, and also as a Heavenly Jewel Master it was safe to say that she was the hope of the Empire, and it was easy for the Regiment Commander to give her some simple special benefits like a private toilet.</p><br/><p>In the first place, she had actually been heading for the toilet when Zhou Weiqing groped her, thus the long delay. After he had left, after she had finally calmed down, she had then heading out to the toilet again. Who knew that she would once again bump into him in such a circumstance to see him in his birthday suit. As such, she was not only both embarrassed and angry, but also confused. Added on to that was her need to use the toilet, although she wanted to beat Zhou Weiqing savagely, but she really needed to finish her own ‘business’ first!</p><br/><p>Wait here? Zhou Weiqing thought to himself. Only a fool would wait here, maybe your anger will have dissipated by tomorrow.</p><br/><p>This fellow totally disregarded his battalion commander’s orders, and ran off quickly with his bow. Quickly exiting the camp area, he dashed off into Heavenly Bow City. By the time Shangguan Bing’er came out from the toilet, the Pervert (in her eyes?), Zhou Weiqing, was already long gone. This made her gnash her teeth in hate to no avail.</p><br/><p>After returning to Heavenly Bow City, Zhou Weiqing looked for an inn to stay for the night, and got some pen and paper to write a letter to his father:</p><br/><p><em>Father, you always said that I’m useless, and I do feel that way myself, so I will not stay at home to trouble you further. As the saying goes, Reading 10000 books is incomparable to traveling 10000 li, I’ve decided to go out and make a living traveling by myself, to make a name for myself. Also, please help me break off my engagement with Princess Difuya, after all I am just a useless trash while she is a genius, I do not want to hold up her life, especially since she does not like me at all. That’s all I have to say, do take care of mother and do not try to look for me. You know I’m more afraid of death than anyone, I’ll come back alive and kicking, so don’t worry about me.</em></p><br/><p>After writing the letter, he went out to look for a shop providing delivery services, and paid for the letter to be delivered home tomorrow. After which he headed for a blacksmith’s shop – since he was about to become a soldier, his priority was definitely his own safety. As mentioned in his letter, he was more afraid of dying than anyone else. Today was his only free day in a while, so he decided to prepare himself properly before he had to return to the camp tomorrow.</p><br/><p>Having grown up in Heavenly Bow City, Zhou Weiqing was extremely familiar with its layout. As he was still young, and had spent his life being scolded severely at home, leaving home this time gave him the enjoyable feeling like a bird let out of its cage; the feeling of homesickness will currently not be felt yet.</p><br/><p>Before long, Zhou Weiqing had entered the nearest blacksmith shop.</p><br/>\n</div>"}