{"title": "Chapter 8 Profound Secrets of the Immortal Deity Technique (1)", "id": 8, "volume": 1, "url": "http://boxnovel.org/heavenly-jewel-change-chapter-8-profound-secrets-of-the-immortal-deity-technique-1", "volume_title": "Volume 1", "body": "<h1>Chapter 8 Profound Secrets of the Immortal Deity Technique (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 8 Profound Secrets of the Immortal Deity Technique (1)</strong></p><br/><p>Listening to Zhou Weiqing’s firm tone, Shangguan Bing’er suddenly generated a strange thought in her mind – <em>This fellow has some of his own good points, at least he is diligent and knows how to exert himself. Furthermore, he has that legendary Alexandrite Cat’s Eye. Since he has already taken advantage of me, with his status as a Heavenly Jewel Master, perhaps he is at least somewhat worthy of me…</em></p><br/><p>She then shook her head strongly, scolding herself in her heart. <em>What am I thinking about! No matter what, I need to observe this Little Fatty Zhou’s disposition, his moral character being so irritating is a big problem, I can’t just observe a day or two to make up my mind.</em></p><br/><p>“Little Fatty Zhou, remember this, when you are cultivating Heavenly Energy, you can just do so in accordance to your Immortal Deity Technique. However, whenever you are attempting to break through Death Acupuncture Points, you must make sure that I am there with you to protect you, you must not try to attempt it on your own.”</p><br/><p>Zhou Weiqing was more than happy to have it that way, and he immediately said: “Heh… Understood, understood, thanks Battalion Commander for your care and concern.” As he said that, he leaned forward.</p><br/><p>Seeing that he had resumed his normal ways after barely two minutes of being serious, Shangguan Bing’er was overcome with helplessness. “Little Fatty Zhou, sit properly or I’m leaving!”</p><br/><p>Zhou Weiqing quickly sat back upright, resuming the serious look he had on previously. Unfortunately, though someone meeting him for the first time would be fooled by that, but Shangguan Bing’er who had a few days of experience with him knew for sure that this rascal would have strange thoughts no matter what outward expression he was showing.</p><br/><p>“Just now I talked about the basics for both us Heavenly Jewel Masters as well as ordinary Jewel Master, now I’ll teach you the basic usage of the Physical and Elemental Jewels. It’s already quite late now, so I’ll first show you how to keep and release the Jewels. The method is split into 2 parts; to keep your Heavenly Jewel back into your body is called Receiving, while to use the Jewels is called Releasing. Both Receiving or Releasing require Heavenly Energy. When we have cultivated our Heavenly Energy to the first stage, it will gather in your Dantian, which is in your lower abdomen, you need to use your will to manipulate your Heavenly Energy and meld it with your Heavenly Jewels, then guide them to either Receive or Release. You can start practicing that tonight, and I’ll teach you something else tomorrow.</p><br/><p>After saying that, she stood up. It was already dark outside, and she was not willing to stay in such a place with sorrowful memories for a long time, as such she was preparing to leave. Zhou Weiqing stood up hurriedly, but as he did so, Shangguan Bing’er immediately stepped back, keeping a safe distance from him.</p><br/><p>Giving him a quick glare, Shangguan Bing’er left.</p><br/><p>Zhou Weiqing kept his eyes trained on her as she left, looking through the small gap in the tent flap, thinking to himself: <em>That ass, how pert!</em> However, he had learnt his lesson now, he wouldn’t dare to voice out such thoughts, but just enjoying inside silently, at least that way she wouldn’t know.</p><br/><p>Shangguan Bing’er did not take along her oil lamp when she left, and Zhou Weiqing sat back onto his bunk and opened the Immortal Deity Technique manual to the fifth page. He had already broken through the first four Death Acupuncture Points, and if he wanted to cultivate further, he naturally had to start on the fifth page of the first part.</p><br/><p>The fifth Death Acupuncture Point for the first part was the YongQuan Point, which was located on the sole of the feet, and it would cause damage to the Dantian on being hit, injuring the functional activities of body’s vital energy.</p><br/><p>Calming himself down, Zhou Weiqing could immediately feel the energy whirlpools which had opened up in the four Death Acupuncture Points that he had previously broken through. According to what Shangguan Bing’er had told him earlier, he understood that the energy that they were absorbing was the Heavenly Energy coalesced from the atmosphere.</p><br/><p>The method of cultivating Heavenly Energy in the Immortal Deity Technique was rather simple, consisting of just one line – When the energy in your Dantian is full, it means it has peaked, break through the next Death Acupuncture Point means a level up ; failure means death.</p><br/><p>From the words, it could be understood as the following : After breaking through a Death Acupuncture Point successfully, it was just a matter of cultivating and storing Heavenly Energy. Once the Dantian was full of Heavenly Energy, it would be time to break through the next Death Acupuncture Point – in which case success means getting to the next level of Heavenly Energy, while failure means death. As for the actual cultivation method, there was no other hint.</p><br/><p>However, since his testing in the morning, Zhou Weiqing had already started to understand the profound mysteries of this Immortal Deity Technique. No doubt, training this technique was tantamount to suicide, but once successful, the cultivation process would be easier than other cultivation arts.</p><br/><p>Zhou Weiqing had tried many different cultivation arts since he was very young; you had to cycle your Heavenly Energy around the meridians in a cyclic rotation, and was usually very complicated. Completing a whole heavenly circuit revolution, all of the various arts had made his head ache just looking at them. Now, this Immortal Deity Technique was so much easier in comparison. Just the whirlpools which had formed after breaking through the Death Acupuncture Point were extremely invaluable, as they would automatically draw in Heavenly Energy from the atmosphere to strengthen his body. Even if he did not intentionally concentrate on cultivating, his Heavenly Energy would still grow slowly by itself. When he focused his will on the whirlpools, the speed of drawing Heavenly Energy would grow by a large amount. Such a cultivation method was extremely simple.</p><br/><p>The truth was, there was always two sides to every coin. This Immortal Deity Technique that Zhou Weiqing had gotten was indeed a miraculous technique, and was created by a true crazy genius; however even that crazy genius himself had only mastered it to around ten plus Acupuncture Points before failing to break through and dying. After that, there had not been anyone else who had even managed to break through the first Death Acupuncture Point. The unique thing about this technique was that it was extremely difficult to break through bottlenecks, but the usual cultivation was very easy. As for what happens after breaking through all 36 Death Acupuncture Points, even the creator could only guess according to his own estimations.</p><br/><p>As such, Zhou Weiqing was now focusing on the whirlpools, hastening its absorption of Heavenly Energy. At the same time, he was also checking out his Dantian’s circumstances.</p><br/><p>As he did so, he realised that his Dantian was empty of energy; the Heavenly Energy absorbed from the surroundings had barely filled even a tenth of it, and his consciousness was able to make the energy start moving. With the experience from breaking through the Clavicle Acupuncture Point, he started to move the Heavenly Energy into two paths, slowing heading towards both his arms.</p><br/><p>This process was extremely slow, after all Zhou Weiqing was new to moving substantial amounts of Heavenly Energy. Although this mount of Heavenly Energy was little compared to the total amount in his Dantian, but compared to the amount he had used to breakthrough the Clavicle Acupuncture Point, it was almost more than a hundred times. As the Heavenly Energy passed through his meridians, he felt a cool comfortable feeling at the area.</p><br/>\n</div>"}