{"title": "Chapter 4 The secrets of Heavenly Jewel Masters (2)", "id": 4, "volume": 1, "url": "http://boxnovel.org/heavenly-jewel-change-chapter-4-the-secrets-of-heavenly-jewel-masters-2", "volume_title": "Volume 1", "body": "<h1>Chapter 4 The secrets of Heavenly Jewel Masters (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 4 – The secrets of Heavenly Jewel Masters (2)</strong></p><br/><p></p><p class=\"normal\"> Shangguan Bing’er hrmphed in anger, “Little Fatty Zhou, I’ll administer the remaining 9 whips another time. With your weak physique, how can you be a proper soldier? Before the recruit training starts, this Battalion Commander will be giving you some personal tough training. If you can’t finish it, just get lost from here and don’t throw our 3rd Battalion’s face! I’ll come and find you after lunch.” After saying that, she spun around and stalked off.</p><br/><p></p><p class=\"normal\"> Zhou Weiqing watched her leave, after which he leapt to his feet, the sly expression on his face gone. “There is such a difference between people’s personalities. From now on, I shall not anger this Battalion Commander already. Compared to Difuya, she is such a kind soul.” Honestly, he had not imagined that he would be let off so easily, he could easily foresee that if the person administering the beatings had been Difuya, he would definitely have to suffer all the remaining 9 blows. Zhou Weiqing had clearly seen the expression on Shangguan Bing’er’s face after the first blow, that she couldn’t bear to hit him a second time, and he had a very good impression and liking of her. Of course, for this rascal, that liking caused him to slyly think back of the feeling in his hands from the previous day, causing him to drool again.</p><br/><p></p><p class=\"normal\"> Soon it was noon; the lunch in the army was nothing special, it was simple and only meant to ensure stomachs were filled. Since Zhou Weiqing wasn’t used to any special treatment or foods at home, he was fine with just filling his stomach with the standard fare. Of course, he was eating at the ordinary soldier’s mess, the officers had a separate mess area. By the time he got back from lunch, he saw that Shangguan Bing’er was already standing outside his tent waiting for him, dressed in the same outfit as earlier in the morning. Zhou Weiqing was secretly thinking, how great it would be if she were his girlfriend waiting for him. Of course, it was just a passing thought – Zhou Weiqing’s greatest strength was that he knew his limits, he would not really expect that the top genius in the empire would fall in love with such a trash who could not cultivate like him.</p><br/><p></p><p class=\"normal\"> “Greetings Battalion Commander.” Zhou Weiqing quickly walked up towards Shangguan Bing’er and gave her a smart salute.</p><br/><p></p><p class=\"normal\"> Although Shangguan Bing’er had a very kind nature, but she was also very intelligent. In the morning, after she had left Zhou Weiqing after the whipping, she realised that she had been fooled. After all, she had not used much strength, how could he be in such pain? That rascal had clearly been acting. He might look very honest but that Little Fatty Zhou was definitely not a good person, if she did not punish him for that she would not be able to assuage her anger. To think that the first man to ever touch her body was such a rascal, Shangguan Bing’er almost couldn’t control her anger.</p><br/><p></p><p class=\"normal\"> “Little Fatty Zhou, let me ask you, to an archer what is the most important?” Shangguan Bing’er asked solemnly.</p><br/><p></p><p class=\"normal\"> Zhou Weiqing answered unhesitatingly: “Speed, strength and accuracy.”</p><br/><p></p><p class=\"normal\"> Shangguan Bing’er heard his swift and accurate reply and was rather surprised, “Very good, you’re right. From your conduct this morning, your physique is in bad shape and not up to standard for an archer. As such, from now onwards, I will be conducting special training for you.”</p><br/><p></p><p class=\"normal\"> Upon hearing that, Zhou Weiqing’s face changed, “Lord Battalion Commander, can we start later? I just ate lunch, and need an afternoon nap.”</p><br/><p></p><p class=\"normal\"> Shangguan Bing’er said angrily: “Do you have the qualification to bargain with me? A soldier has to follow orders, I hope you remember that point, or you will never be a good soldier, let alone an officer. I’m going to prepare some things, the special training will start in an hour.”</p><br/><p></p><p class=\"normal\"> After Shangguan Bing’er left, Zhou Weiqing laughed and said, “Although this girl acts tough, but her heart is really soft. She has given me an hour of rest, haha in front of this young master there is no point acting. Alright, I’ll go take a nap. Afternoon naps are a good habit, good for the complexion.”</p><br/><p></p><p class=\"normal\"> When Shangguan Bing’er returned in an hour carrying a heavy duffel bag, all she heard was the snoring sounds of Little Fatty Zhou.</p><br/><p></p><p class=\"normal\"> Shangguan Bing’er was both amused and vexed at the same time. This Little Fatty Zhou rascal really just ate and slept, couldn’t he tell that she was using her rank to take revenge on him? It was unbelievable that he could still sleep so soundly.</p><br/><p></p><p class=\"normal\"> “Little Fatty Zhou, Wake up!” Shangguan Bing’er shouted loudly outside the tent, she naturally would not enter his tent, what if that rascal was sleeping naked?</p><br/><p></p><p class=\"normal\"> The snores continued.</p><br/><p></p><p class=\"normal\">A sly light flashed in Shangguan Bing’er’s beautiful eyes, and she suddenly shouted loudly: “FIRE!! FIRE!!”</p><br/><p></p><p class=\"normal\"> “Aaaahhh…” A loud screech resounded from within the tent, preceding Zhou Weiqing rushing and stumbling clumsily out of the tent. Luckily, although he was dishevelled, at least he was still clothed.</p><br/><p></p><p class=\"normal\"> “Where, Where?” shouted Zhou Weiqing as he rushed out, face was filled with panic.</p><br/><p></p><p class=\"normal\"> Shangguan Bing’er said exasperatedly: “Are you so afraid of death?”</p><br/><p></p><p class=\"normal\">By now Zhou Weiqing had finally fully woken up, and looking around, he realised that there wasn’t any sight of flames around and immediately knew that he had been tricked. His face full of indignation, he said: “It’s human nature to be scared of death, those who aren’t scared of death are fools. If there’s nothing else, I’m going back to sleep.” Having said that, he actually turned around and headed back to his tent.</p><br/><p></p><p class=\"normal\"> “You wretch, stop right now!” Shangguan Bing’er realised that every time she faced Little Fatty Zhou she would always fall into a rage.</p><br/><p></p><p class=\"normal\"> “Battalion Commander, is there anything else?” Zhou Weiqing asked impatiently.</p><br/><p></p><p class=\"normal\"> “Special training.” Shangguan Bing’er gritted her teeth as she looked at the rascal, and she lifted her hand and threw the duffel bag into Zhou Weiqing’s arms. She had already decided that no matter what, she would teach him a lesson today and assuage her anger.</p><br/><p></p><p class=\"normal\"> Zhou Weiqing felt his hands filled with a sudden weight, and upon opening the bag, he saw it was filled to the brim with rocks, weighing about 20kg in total. Immediately, he didn’t dare to act anymore and said with a pitiable expression: “Battalion Commander, this is too harsh right.”</p><br/><p></p><p class=\"normal\"> Shangguan Bing’er said coldly: “As an archer, your speed and strength are far from passable, if you don’t get a large amount of physical training, how can you survive?”</p><br/><p></p><p class=\"normal\"> Zhou Weiqing said: “But, shouldn’t being accurate at shooting be enough?”</p><br/><p></p><p class=\"normal\"> Shangguan Bing’er asked suspiciously: “Is your archery very accurate?”</p><br/><p></p><p class=\"normal\"> Zhou Weiqing had some confidence in his archery, and immediately nodded.</p><br/><p></p><p class=\"normal\"> Shangguan Bing’er said: “Okay, if your archery is more accurate, or at least equal, to mine, then you won’t have to undergo my special training. Take your equipment and follow me.”</p><br/><p></p><p class=\"normal\"> Zhou Weiqing shouldered his bow and brought his quiver, and followed Shangguan Bing’er out of the camp.</p><br/><p></p><p class=\"normal\"> Once they were out of the camp, Shangguan Bing’er stopped, and pointed towards a large tree, whose trunk was about as thick as a human, about 200 yards away: “See that tree? To be a passable archer, you need to be able to shoot a human figure at least 200 yards away. Your target now is the centre of the tree trunk. Go ahead.”</p><br/><p></p><p class=\"normal\"> Zhou Weiqing took down his longbow, and took out an arrow of around 90 cm long from his quiver, nocking it to the bow. He drew the bow and took aim – the tree at 200 yards away was but a slim figure – before releasing the arrow.</p><br/>\n</div>"}