{"title": "Chapter 7 Three-Point Covenant (2)", "id": 7, "volume": 1, "url": "http://boxnovel.org/heavenly-jewel-change-chapter-7-three-point-covenant-2", "volume_title": "Volume 1", "body": "<h1>Chapter 7 Three-Point Covenant (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 7 Three-Point Covenant (2)</strong></p><br/><p>Shangguan Bing’er pushed Zhou Weiqing away, and headed to the entrance to open the tent flap, allowing the cool fresh air to enter. She took deep breaths as she calmed herself down.</p><br/><p>It had been a day, and with the help of Heavenly Energy, her body had mostly healed. However, how could the wounds of the heart heal so easily? After thinking about things for a whole day, finally her reason overcame her anger, and she decided to come look for Zhou Weiqing.</p><br/><p>“Little Fatty Zhou.” As she closed the tent flap once again, she turned back around to face Zhou Weiqing.</p><br/><p>“Yes.” Upon hearing her call him, Zhou Weiqing quickly replied, the lowered eyed, puppy dog look he had on made her want to give him a beating.</p><br/><p>Taking another deep breath, Shangguan Bing’er said solemnly: “Remember, yesterday never happened. If I hear any rumours spreading, you know the consequences…”</p><br/><p>“Ah?” Zhou Weiqing widened his eyes as he looked at her. At this moment, although he put on an expression of obedience, but inside he was feeling rather pleased. He knew that Shangguan Bing’er wouldn’t kill him, and looking at her beauty now, he couldn’t help but think that she had been under him last night, and his heart was aflame.</p><br/><p>“Did you hear what I said clearly?” Shangguan Bing’er said, pouting.</p><br/><p>“I heard… heard clearly. But, Battalion Commander, I… I… ” Zhou Weiqing put on a hesitant look.</p><br/><p>“You what you? Why are you mumbling? If you have something to say, say it.” Shangguan Bing’er said exasperatedly, and couldn’t help but to step forward and give him a kick.</p><br/><p>Zhou Weiqing immediately shook his head, “I better not say, I’m scared you will hit me.”</p><br/><p>“Say it. I won’t hit you.” People were curious by nature, and after all Shangguan Bing’er was merely fifteen. Although she was still angry with Zhou Weiqing, but she still wanted to know what he wanted to say.</p><br/><p>Zhou Weiqing looked at her secretly, then said in a low voice: “You really won’t hit me?”</p><br/><p>“Are you going to say?” Shangguan Bing’er’s face turned cold.</p><br/><p>“All right, I’ll say, okay?” Zhou Weiqing had an aggrieved face, almost as if he was the sacrifice last night. “Battalion Commander, it was also my first time, how can I forget about last night! Although you won’t take responsibility for me, but I won’t blame you. But, I still can’t help but to remember you. Battalion Commander, don’t look at me like that, I’m scared. I’m just speaking the truth. Ahh! Help! Murder!”</p><br/><p>As Zhou Weiqing said the first line, Shangguan Bing’er had already realised that this rascal was not going to say anything good. As expected, the more she listened the angrier she got, and at the end, her beautiful face was green and white from anger, and with a flash she was beside him, pinching the meat at his waist, she gave a hard 180 degree turn, instantly the screams like that of a pig being butchered sounded out.</p><br/><p>Shangguan Bing’er raised her hand and covered Zhou Weiqing’s mouth, she did not want her other subordinates to know that she was in this rascal’s tent so late at night.</p><br/><p>“If you speak any more rubbish, I’ll castrate you!” Shangguan Bing’er was both angry and embarrassed, and she finally threatened him.</p><br/><p>Zhou Weiqing was immediately silenced, his hands carefully covering his lower body, looking at Shangguan Bing’er with an alarmed expression. This time he was really afraid of that threat.</p><br/><p>“You… sit down.” Shangguan Bing’er was really glad she did not bring her sword along, or she really couldn’t guarantee that this rascal would still be alive.</p><br/><p>Zhou Weiqing sat down on the bunk, this time he was well behaved. Although he liked to look at her angry look as he teased her, but he also knew that he could not overdo it. Furthermore, they had a lot of time together in the future; it was likely this would be his only joy to look forward to in his army life.</p><br/><p>“Little Fatty Zhou, let me ask you. How much do you really know about Heavenly Jewel Masters?” Shangguan Bing’er sat cross-legged at the other end of the bunk, keeping a metre distance between Zhou Weiqing and herself.</p><br/><p>“Errr… Basically what you told me yesterday.” Zhou Weiqing said without hesitation.</p><br/><p>With a *piak* sound, a leather book was thrown at him. Zhou Weiqing fumbled to catch it, and found that it was his Immortal Deity Technique manual.</p><br/><p>“Tell me what happened last night? In the day, I did not sense any Heavenly Energy at all from you, why did you manage to Awaken your Heavenly Jewel at night, and furthermore being one of multiple elements. Don’t tell me it’s because you learnt this Immortal Deity Technique. That thing, although it isn’t absolutely impossible, but it’s nigh tantamount to suicide. With just that technique, no matter how lucky you are, it’s not possible for you to jump 4 levels of Heavenly Energy from a totally startpoint of zero.”</p><br/><p>Zhou Weiqing said: “It might be because of this weird black pearl that I swallowed. Before I joined the army, I was playing around in the Stars Forest. After a while, I got tired and fell asleep in the forest. Who knew, the sky then suddenly darkened, and I found that I couldn’t move at all. A crack opened in the sky, and this black pearl surrounded by green, blue and silver colours emerged from the crack and flew into my mouth. At that time, I just felt my whole body turn cold, then I fainted. When I came to, I didn’t find anything wrong with my body and returned to the city. As I reached the city, I just happened to see the army recruitment, and so I joined. Last night, I really was trying to learn the Immortal Deity Technique, and was breaking through the first Death Acupuncture Point, the Clavicle Point, and I managed to break through it. However, I immediately felt my whole body go numb and unable to move, then a strong burst of cold emerged from my dantian, and I seemed to see this winged black tiger before I lost consciousness. I don’t know what happened after that. When I woke up, I saw this naked girl in front of me, and after that, I realised that 4 of my Death Acupuncture Points had successfully broken through...”</p><br/><p>“Shut up.” Shangguan Bing’er said with a livid face, and with a wave of her hand, a green light flashed in front of Zhou Weiqing, and with a BAM sound, a crack appeared in the bunk right in front of him. That scared him into silence – if that blow had been a few inches to the front, the little bird in his pants would no longer be there.</p><br/><p>After a vicious quick glare at Zhou Weiqing, Shangguan Bing’er lapsed into deep thought. She had never heard of such circumstance that Zhou Weiqing had described, but with this rascal’s mode of talking, could she believe it? But, if she didn’t believe what he said, there was no possible way to explain what happened yesterday. Furthermore, when he had been talking just now, she had been looking into his eyes, and she realised that that fellow had a genuine look in his eyes, and it seemed that his words were at least relatively believable.</p><br/><p>“What’s your origin?” Shangguan Bing’er asked solemnly. She wasn’t just asking for her own curiosity, but more importantly because of his unique legendary Elemental Jewel. Such a person, even though he had an unbelievable innate talent, but if he had an unknown origin, she wasn’t sure if she should teach him the cultivation ways.</p><br/><p>Zhou Weiqing hesitated a moment, then said: “Bing’er, do you want to hear the truth or have me make up a story?”</p><br/><p>Hearing him address her by her name*, Shangguan Bing’er sweatdropped, and said angrily: “Call me Battalion Commander, and of course I want to hear the truth.”</p><br/>\n</div>"}