{"title": "Chapter 12 Physical Jewel Consolidated Equipment Overlord Bow (2)", "id": 12, "volume": 1, "url": "http://boxnovel.org/heavenly-jewel-change-chapter-12-physical-jewel-consolidated-equipment-overlord-bow-2", "volume_title": "Volume 1", "body": "<h1>Chapter 12 Physical Jewel Consolidated Equipment Overlord Bow (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 12 Physical Jewel Consolidated Equipment – Overlord Bow (2)</strong></p><br/><p>Zhou Weiqing said with a pitiable face: “I have made a mistake, It really was not intentional, it was all subconscious, absolutely subconsciousness.”</p><br/><p>Shangguan Bing’er gave a cold hmph, “Remember, only after you register with the Skill-Storing Palace, and get the Skill-Storing Palace plaque, then can you carry on with Storing Skills in the Palace. Ordinary Physical and Elemental Jewel Masters can also register here and get the plaque, but they will not have the robes which represent Heavenly Jewel Masters. When going through with Skill-Storing, Heavenly Jewel Masters can enjoy a 10% discount. Every additional gem increase promotion will mean another 10% discount. Therefore, if you have the opportunity to come alone to carry on with Skill-Storing, you must remember to register any promotion first.”</p><br/><p>Zhou Weiqing said in surprise: “Doesn’t that mean that those Heavenly Jewel Masters with 9 Jewels do not need to pay?”</p><br/><p>Shangguan Bing’er shook her head, saying: “I do not know either, but it is rumoured that those Heavenly Jewel Masters who are above 6 Jewels seldom go to the Skill Storing Palace anymore. The actual reason is not for those Heavenly Jewel Masters of our level to know.”</p><br/><p>“Battalion commander, can I ask how much money does our Skill Storing require?” Zhou Weiqing’s heart was really itching to try it out, having the means of growing stronger right in front of him, yet being unable to do so due to money, this made him feel very out of sorts in his heart. Although his father was very honest and did not have much money, but his godfather was after all the ruler of their country, furthermore he was now a Heavenly Jewel Master, in the future when he returned to the Heavenly Bow Empire he should be able to ask for some money for Skill-Storing.</p><br/><p>Shangguan Bing’er said: “One attempt at Skill Storing is about 500 gold coins.”</p><br/><p>Zhou Weiqing blinked, “500 gold coins, that’s not really very expensive!”</p><br/><p>Shangguan Bing’er looked at him coldly, “The success rate has less than 1%. If your luck is bad, you may not even succeed after trying several hundred times. The worst thing is the loss of the time, a Jewel Master can only go through one Skill Storing every day. The price I mentioned is also only for the ordinary Heavenly Beasts. If we are talking about the higher level Zun Beasts or Zong Beasts, the price is astronomical. However, the success rate is slightly higher for them, and their skills will also be generally better.”</p><br/><p>Zhou Weiqing was struck speechless; to his knowledge, the annual tax revenue of Heavenly Bow City was only 500,000 gold coins. No wonder Shangguan Bing’er mentioned that their empire was not able to support many Heavenly Jewel Masters.</p><br/><p>“So Heavenly Beasts are similar to us and have some sort of ranking. Alright, let’s forget about Skill Storing for now. Let’s go to the Consolidating Equipment Master that you mentioned.” This was the first time that Zhou Weiqing realised how important money was. The cultivation of Heavenly Jewel Masters was more difficult than he had thought.</p><br/><p>Shangguan Bing’er nodded, saying: “Now you know why I always place so much importance on saving money. Honestly, even if our Heavenly Bow Empire has that many Heavenly Jewel Masters, our empire is not able to support us all. After all, our country is really too tiny compared to the huge empires like Fei Li empire or Bai Da Empire. Without our own Skill-Storing Palace, it is impossible to organize a team of formidable Heavenly Jewel Masters.”</p><br/><p>“Let’s find a place to stay first. After we wash up a little and change, we can go look for a good Consolidating Equipment Master.” Shangguan Bing’er thought after thinking a while.</p><br/><p>“Did I hear correctly? Did a steel tree bloom*?” Zhou Weiqing said as he looked at her in surprise.</p><br/><p><em>*TL: A direct translation of , an idiom meaning something almost impossible happening – he is referring to her being miserly and willing to spend money on a room to stay.</em></p><br/><p>Shangguan Bing’er’s beautiful face turned red, “Are you courting death? Do you want to stay or not?”</p><br/><p>“Stay, of course I’ll stay.”</p><br/><p>After fifteen minutes, the two of them were standing in the hall of a small little hotel. This hotel was really small and only had one level; besides its cleanliness, Zhou Weiqing could not find another merit in it.</p><br/><p>“Boss, please gives us a room.” Shangguan Bing’er told the 50-year-old hotel boss standing behind the counter.</p><br/><p>The hotel boss looked at the two of them and gave them a lascivious smile, before handing over a key covered with embroidery. He said: “Room 1, one silver coin for two days. You young people, must learn to control yourselves heh.”</p><br/><p>Taking the key, Shangguan Bing’er just turned unemotionally and walked off. but Zhou Weiqing actually gesticulated to the boss and showed off his muscle, “Boss, what sort of eyes do you have! Look at me so vigorous and healthy, why would I need to control?”</p><br/><p>“Zhou — Little — Fatty — !!”</p><br/><p>“Here!” Zhou Weiqing answered quickly, and rushed to follow.</p><br/><p>Following Shangguan Bing’er, he asked with a sad face: “Battalion Commander, we finally entered a city and you only took one room, you won’t make me sleep outside on the streets to save money right?”</p><br/><p>Shangguan Bing’er shot a look at him, saying: “You and I will stay in this one.”</p><br/><p>Zhou Weiqing was stunned instantaneously, his brain dazed as he opened his mouth, his saliva flowing out, and he muttered: “This… this… happiness comes so quickly. Battalion Commander, are we advancing too quickly?”</p><br/><p>“Little Fatty Zhou, I have endured you for too long!” Shangguan Bing’er gave a low roar that made Zhou Weiqing shut up instantly; he knew that knows, generally before a tigress attacks she would roar like that.</p><br/><p>The room was not very big, but was at least clean, it actually had a bathroom for washing and excretion, and could be considered fully equipped.</p><br/><p>There was only a single bed in the room, and Shangguan Bing’er dropped off her backpack before sitting on the bed. At this moment, her beautiful face revealed her weariness, and Zhou Weiqing who was looking at her felt a pain in his heart.</p><br/><p>“Little Fatty Zhou. Come here.” Shangguan Bing’er beckoned to Zhou Weiqing who was standing at the side.</p><br/><p>“Orh.” Having angered her earlier, this time Zhou Weiqing came honestly, his face a picture of simple sincerity.</p><br/><p>Before he could even come to a stop, Shangguan Bing’er moved all of a sudden, her speed pushed to the limit in that very instance, Zhou Weiqing was sure that in that moment she had simultaneously used both her Physical and Elemental Jewels. All he saw was a flash in front of his eyes, and suddenly both his hands were gripped and his arms were pushed down hard onto the bed.</p><br/><p>“Battalion Commander, don’t be so violent, I won’t resist.” Feeling the soft smoothness of Shangguan Bing’er’s hands, Zhou Weiqing’s heart instantly became lascivious. However, in the next instant he was unable to maintain that lascivious-ness.</p><br/><p>Shangguan Bing’er took out a string from an nowhere, and quickly tied up Zhou Weiqing’s hands and feet, then fastening him firmly to bed.</p><br/><p>“Battalion commander, did you like this? You won’t be using the leather whip and candle right? I’m afraid of pain!” Even at this time, this rascal could not control his mouth.</p><br/><p>Shangguan Bing’er gave him a quick kick, “If you talk more trash, I’ll take your sock and shove it in your mouth.”</p><br/><p>“I’m shutting up now!” Nobody knew clearer than Zhou Weiqing how dirty his socks were. Probably if he took them off and threw them at the wall, they might even stick on… if those were shoved into his mouth ……</p><br/><p>A moment later, Zhou Weiqing finally understood why Shangguan Bing’er tied him up, as he heard the sound of running water. This beautiful lady Battalion Commander was taking a bath now. Obviously, tying him up was to prevent this rascal from peeping. In truth, Shangguan Bing’er’s actions were definitely correct. Even tied up there, Zhou Weiqing’s mind couldn’t help but drift off into a daydream, as lascivious pictures fluttered across his mind. After all, he had actually seen her before…</p><br/>\n</div>"}