{"title": "Chapter 17 Touch of Darkness (1)", "id": 17, "volume": 1, "url": "http://boxnovel.org/heavenly-jewel-change-chapter-17-touch-of-darkness-1", "volume_title": "Volume 1", "body": "<h1>Chapter 17 Touch of Darkness (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 17 Touch of Darkness (1)</strong></p><br/><p>After discovering that the Zong Stage Heavenly Beasts were afraid of him and thus coordinated with his Skill-Storing, Zhou Weiqing thought for a long while and realised that without a doubt, this had to be connected to that strange black pearl. The black pearl had often given him the image of the large winged black tiger, and the tiger was also considered the king of beasts, it was likely that all the Heavenly Beasts were afraid its aura.</p><br/><p>After only spending 50,000 gold coins, Zhou Weiqing had managed to complete a magnificent feat that many others would fail even with 5 million gold coins. Presently, he was truly a Heavenly Jewel Master at full strength, complete with Skills and Equipment.</p><br/><p>The Touch of Darkness at its current basic level could send forth 12 dark tentacles, which could be dispersed around the body in a radius of 25 meters, within this radius, Zhou Weiqing’s senses would be tripled by the Skill. At the same time, once he had selected a target, and it was touched by any of the tentacles, the tentacles would latch onto the target at a 1000 jin pulling force under his control. As long as the target’s strength was less than 1000 jin, or perhaps it would be more accurate to say if its strength of struggling to break free did not reach 1000 jin, then it would be immediately drawn to Zhou Weiqing in a stunned state.</p><br/><p>This was a skill that Zhou Weiqing had gotten from a huge black big octopus, and it was said that if this Zong Stage Heavenly Beast used it, the Touch of Darkness’ radius was up to one kilometer, and once it reached its target, it’s sealing strength was more than 100,000 jin strength and it was used to pull in its food instantaneously.</p><br/><p>Zhou Weiqing knew from Shangguan Bing’er that the skills would improve and evolve automatically as the number of Elemental Jewel increased, and the evolution rate of the skills for Heavenly Jewel Masters was once again one-and-a-half times that of an ordinary Elemental Jewel Master. As such, if his cultivation in the future reached a certain point, the strength of this ‘Touch of Darkness’ skill would also naturally become extremely terrifying, and could absolutely be classified as one of the Darkness Attribute’s top skills.</p><br/><p>After releasing the ‘Touch of Darkness’ Skill, Zhou Weiqing did not have any more worries; a radius of 25 meters was definitely not small, and as long as Xiao Se entered the region, he would definitely wins. Using archery alone to compete? Only a fool would do that, after all looking at her self-confident appearance it was clear that her archery was definitely very good. Previously since he had never been able to cultivate Heavenly Energy, during the Fresh Recruit Tournament Zhou Weiqing had only been able to make use of the archery that he had learnt previously and brought it to its maximum capacity. As for much more profound archery skills that required the support of Heavenly Energy, he naturally had not learnt them yet.</p><br/><p>At this point, Xiao Se was also feeling strange, why did this Little Fatty Zhou not have any sound or movement. Normally, since she had already purposely made some noise for him to hear, even if he did not reply, he should have shot some arrows! As she thought about it, she advanced cautiously forward.</p><br/><p>Unfortunately for Zhou Weiqing, after a short bout of self-satisfaction, he became a little depressed. This was because he discovered although this Touch of Darkness skill wasa very good, but after releasing it, it actually consumed a huge amount of Heavenly Energy to maintain it. Although due to the fact that he had not fully activated the target yet, the speed of consumption was still considered not very fast, but with his level four Heavenly Energy, the amount of time that he could sustain it was still quite limited.</p><br/><p><em>What should I do? It seems like it isn’t possible to just wait any longer, otherwise, if my Heavenly Energy has been exhausted, I may not necessarily be able to defeat her.</em></p><br/><p>As he thought about that, Zhou Weiqing carefully slid down from the tree, picked up a the stone from the ground, and threw it to the front.</p><br/><p>The stone fell in the shrubbery, immediately giving out a light *ping* sound. However, to Zhou Weiqing’s surprise, Xiao Se’s arrows did not actually shoot forth.</p><br/><p>At the other side, the corners of Xiao Se’s mouth twitched upwards. <em>Throwing a stone to scout me out? Are you really trying to deceive me with such a small trick?</em> She jumped up gently, grabbing hold of a branch of a big tree and vaulting up, quietly and slowly approaching the area where the sound came from. As an outstanding archer, being calm and steady were essential qualities.</p><br/><p>Zhou Weiqing seeing that his previous idea had failed, came up with another suddenly. With his back to a large tree, he suddenly called out: “I am here.”</p><br/><p>This time, Xiao Se did not hesitate at all, and an arrow whizzed out instantly, accurately hitting the large tree that Zhou Weiqing was hiding behind, giving forth a light *ping* sound. After all, she was also using a Purple Dawn Bow, and the arrow had much inertia behind it, and upon striking the tree, caused it to shake.</p><br/><p>Just as Zhou Weiqing wanted to change positions, he suddenly felt an intense sense through the Touch of Darkness skill*, and he immediately froze. *Whiz* *Whiz* Two arrows arrived almost instantaneously in the next moment, hitting the area the previous arrow had struck.</p><br/><p><em>Damned, so strong! Rapid fire arrows plus a double salvo shot at the same time, no wonder she had such self-confidence.</em></p><br/><p>The so-called rapid fire arrow was referring to shooting arrows one after the other at extremely high speeds, and a double salvo shot referred to using a bow to shoot out double arrows at the same time. These were all extremely high-grade archery, and was difficult to master. This was especially so for the the double salvo shot, to simultaneously shoot two arrows accurately at the same time, you could imagine its difficulty.</p><br/><p>At this point, Xiao Se was about 150 yards away from Zhou Weiqing, and as she continued shooting, she had jumped down from the large tree, moving quickly towards Zhou Weiqing. Her right hand was moving like lightning, arrows leaping into her hands one after another unceasingly, and being shot out instantly by the Purple Dawn Bow, suppressing Zhou Weiqing completely at the large tree he was hiding behind, causing him to be unable to flee. At the same time, Xiao Se was quickly changing positions all the time, closing in onto him as she circled around to try to get a clean shot off.</p><br/><p>Xiao Se’s rapid fire arrows were just too quick, even with Zhou Weiqing relying on the increased senses that the Touch of Darkness granted, he was not able to fully grasp their path to dodge them. After all, at a 100 yards distances, the strength of the Purple Dawn Bow coupled with this astonishing rate of fire, with his present skill it was too difficult for him to dodge.</p><br/><p>As the distance between them closed quickly, it was only a matter of seconds before the gap had been reduced to 80 yards. Xiao Se’s arrows also came faster and faster, and Zhou Weiqing could only depend on his instincts to unceasingly move around the tree, making use of it as cover.</p><br/><p>Xiao Se’s mouth was curled in a cold smirk. In her eyes, she had already won this competition. She still had more than 20 arrows in her quiver, and as long as she reached the distance of 50 yards, with her own cultivation stage of second level Heavenly Energy, it was more than sufficient to shoot through that battered large tree. When that time comes, how would Zhou Weiqing hide without any cover. This would be an easy victory.</p><br/><p>However, at this moment, the hiding Zhou Weiqing suddenly got a burst of inspiration, thinking to himself, <em>I’m not just a Heavenly Jewel Master, I’m a Heavenly Jewel Master archer!</em></p><br/><p>Quickly withdrawing the Touch of Darkness, Zhou Weiqing leaned the Purple Dawn Bow onto the trunk of the large tree, though the attribute wheel disk still remained in the black Darkness region.</p><br/><p>With a lift of his right hand, a dim icy fog spread, and the Overlord Bow appeared in his grasp as he continued pouring his Heavenly Energy into the Physical Jewel, and after a while the bowstring finally appeared quietly. Zhou Weiqing switched the bow over to his left hand, and with a quick thought focusing on his Elemental Jewel, the Alexandrite Cat’s Eye on his wrist moved off, rolled down quietly, and actually fell into the indentation of the Overlord Bow. Immediately, the whole Overlord Bow shone with a bright light from the Alexandrite Cat’s Eye.</p><br/>\n</div>"}