{"title": "Chapter 23 Demonic Change (2)", "id": 23, "volume": 1, "url": "http://boxnovel.org/heavenly-jewel-change-chapter-23-demonic-change-2", "volume_title": "Volume 1", "body": "<h1>Chapter 23 Demonic Change (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><b>Chapter 23 Demonic Change (2)</b></p><br/><p>Without a doubt, having faced a life threatening situation, adding on the bloodlust he had been influenced with throughout the night, Zhou Weiqing had somehow entered the Demonic Change. At this point, Shangguan Bing'er’s mind was entirely blank. She knew that no matter what happened, the final outcome for her would not change. Whether Zhou Little Fatty in his Demonic Change state could kill off all the Forest Direwolves or the Forest Direwolves overcoming him, the final result would also lead to her death. Having lost control of his own state of mind, Zhou Little Fatty would end up killing her. However, she still hoped that he could win, at least dying at his hands would be better as compared to becoming the food of the Forest Direwolves.</p><br/><p>Crouching down on the ground, Zhou Weiqing’s body repeatedly released layer upon layer of the grey air currents. If his previous aura caused the Forest Direwolves to just feel some fear, then at this point in time, besides the Direwolf King, all of the ordinary Forest Direwolves were all lying down on the ground, having lost even the courage to stand up after feeling the aura.</p><br/><p>The Direwolf King gave out hurried and rapid howls repeatedly, but its fellow direwolves did not react at all, not paying any attention to its as they cowered.</p><br/><p>The Direwolf King was also trembling, was that really a human in front of it? The aura it was giving forth was something that not even the king of beasts was able to compare!</p><br/><p>Under the stress of both anger and fear, the Direwolf King gave an enraged roar, as it lifted its two front claws, the green light surrounding it doubled in power, painting the surrounding forests in an emerald hue. As its front claws struck towards the front, a shade which looked exactly like a duplicate of itself soared towards Zhou Weiqing.</p><br/><p>This was the Direwolf King’s strongest skill, and it was called ‘Shattering Heavens Wolf Clone’, and was known as one of the strongest Wind Attribute Skills amongst the first six Jewels. It had the sheer cutting force tantamount to that of a tornado, and was not just unbelievably quick, but also able to lock onto a target within 50 yards, and would continue attacking the target until death.</p><br/><p>At this moment, a low roar resounded from Zhou Weiqing, sounding deep and rumbling, just like a tiger's roar. The grey air around his body seemed to spread outwards, and the Forest Direwolves cowering on the ground actually foamed at the mouth and flopped down unconscious, some even letting lose excrement and urine in their fear.</p><br/><p>Zhou Weiqing moved once again, his right leg which was lifted up high behind him swept the ground suddenly, his entire body shooting forth horizontally like a bolt of black lightning, dodging past the ‘Shattering Heavens Wolf Clone’’s direct charge, and with a midair flip, he appeared above two Forest Direwolves. As he stretched out both his hands and pressed upon their heads, and with two cracking sounds, the Forest Direwolves’ skulls were smashed apart.</p><br/><p>Wolves were known for their tough heads and soft waists, in general the hardest part of their whole bodies was actually their heads, but under Zhou Weiqing’s hands, which were now fully covered by the evil looking tiger tattoos, the two Forest Direwolves’ skulls actually caved in so easily.</p><br/><p>Zhou Weiqing did not pause a second, as his body dipped down, once again barely dodging the pursuit from the ‘Shattering Heavens Wolf Clone’. Moving at an incomparable speed, with seemingly perfect coordination and balance, the most frightening thing was his pair of ice-cold bloodshot eyes, like a demon lord of eternity.</p><br/><p>Something strange occurred then, when Zhou Weiqing sprang up from the corpses of the two Forest Direwolves, two green lights simultaneously floated out from the heads of the two Forest Direwolves, and Zhou Weiqing gaped his mouth open and the two green lights were swallowed by him. Immediately after, he brandished his right leg and struck the ‘Shattering Heavens Wolf Clone’.</p><br/><p>As the jet black right leg drew back in a hook, an explosion rang out, as the ‘Shattering Heavens Wolf Clone’ broke apart in mid air, scattering Wind Attribute Heavenly Energy in all directions in a succession of soft sounds. Some of it landed on Zhou Weiqing’s body, causing dozens of small bloody wounds.</p><br/><p>But, once again, another terrifying sight appeared, as the lacerations and wounds on Zhou Weiqing’s body just started healing themselves at an astonishing rate unexpectedly. However, he did not launch an attack on the Direwolf King, instead dodging to the side and once again smashing two Forest Direwolves. As the Forest Direwolves did not put up any resistances, killing them was as easy as breaking open a watermelon. Furthermore, every time he killed a Forest Direwolf, another green light would appear and be absorbed by him. Whenever that happened, the black-grey light surrounding Zhou Weiqing’s body would grow stronger.</p><br/><p>If Zhou Weiqing were in his right senses currently, he would have discovered that his attribute wheel was now set in that mysterious evil grey area. The Skill he was using now was the Skill that had somehow came originally with his Heavenly Jewel, that he had never been able to use previously. The Skill was Devour.</p><br/><p>This was a Skill from the black pearl, and could be said to be a technique inherited. This was the reason why his Evil Attribute did not need to go through Skill-Storing previously.</p><br/><p>The Zhou Weiqing who was now in his Demonic Change, was actually still the original Zhou Weiqing, though his power and senses were several times that of his normal state. More frighteningly, his Demonic Change seemed to be different from any other ordinary Evil Attribute Heavenly Jewel Master's Demonic Change, not only did he indulge in slaughter, but it also allowed him to improve and strengthen himself at the same time.</p><br/><p>When he had gone into the Demonic Change state, he had almost finished up all the Heavenly Energy in his body, even if he had been strengthened by the Demonic Change, it was definitely insufficient to support all his slaughtering. As a result, he did not attack the Direwolf King, instead constantly killing the ordinary Forest Direwolves, Devouring their Wind Attribute Heavenly Energy to strengthen himself.</p><br/><p>That was exactly how he broke the ‘‘Shattering Heavens Wolf Clone’ with a single strike -  he had swallowed the two Forest Direwolves' Wind Attribute Heavenly Energy, coupled with the Demonic Right Leg's power in order to do so.</p><br/><p>In the Demonic Change state, Zhou Weiqing was not only able to use the Evil Devour Skill to Devour energy, but was even able to Devour his enemy’s life force. This was the reason why his injuries suddenly started healing so rapidly.</p><br/><p>Almost in an instant, several more Forest Direwolves died in Zhou Weiqing’s hands, his aura also gradually becoming more terrifying.</p><br/><p>The Direwolf King did not continue attacking Zhou Weiqing any further, its bright green eyes stubbornly staring steadily at him. However, its body was actually slowly retreating step by step, as Zhou Weiqing’s terrifying aura was making it hard for the Direwolf King to even think of fighting back. If not for its unwillingness to give up its subordinate direwolves, it would probably already have fled.</p><br/><p>The Direwolf King gave out long and loud howls unceasingly, trying to communicate with Zhou Weiqing. Unfortunately, in such a state of Demonic Change, how could Zhou Weiqing possibly communicate?</p><br/><p>When the 20th Forest Direwolf was killed by Zhou Weiqing, and he had swallowed the enemy’s energy, Zhou Weiqings’ body suddenly fell to the ground with a loud thump, and he suddenly raised his head fiercely, a deafening tiger's roar resounding from his mouth.</p><br/>\n</div>"}