{"title": "Chapter 21 Stealing the heart, Surprise Attack (2)", "id": 21, "volume": 1, "url": "http://boxnovel.org/heavenly-jewel-change-chapter-21-stealing-the-heart-surprise-attack-2", "volume_title": "Volume 1", "body": "<h1>Chapter 21 Stealing the heart, Surprise Attack (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><b>Chapter 21 Stealing the heart, Surprise Attack (2)</b></p><br/><p>However, the atmosphere at today's dinner was obviously somewhat strange. Company Leader Mao Li’s face was full of anxiety and he spoke for a long time with Shangguan Bing'er. However, her face seemed as calm as usual. On the other hand, the one with the most prestige in the Third Battalion, Company Leader Xiao, who normally had the most disagreements with the beautiful female Battalion Commander, unexpectedly sat at the same side as her, seemingly spending the entire dinner discussing something with the other Company Leaders.</p><br/><p>Without question, Shangguan Bing'er had already started turning over her power as Battalion Commander to Xiao Ru Se. Zhou Weiqing did not join in the conversations, instead staying in a corner and eating as much as he could. The food in the mess was definitely inferior to what he normally ate at home, but it was a different flavor and experience after all. This was especially so for Zhou Weiqing, who had after all spent time in the wilds surviving by himself, and had even eaten grass and tree bark for survival before. To him, being able to eat his fill was already considered pretty good treatment. When Admiral Zhou had started training him, the first few words he said was: “No matter when or where, you should never ever waste food.”</p><br/><p>After eating, Zhou Weiqing returned to his tent. Before long, there was a flash of a silhouette, and surprisingly without any movement of the tent flap, Shangguan Bing'er appeared beside him. In her hands, she held a sheepskin map.</p><br/><p>The most startling thing to Zhou Weiqing was that Shangguan Bing'er had once again resumed her icy demeanor, with a tranquil look on her beautiful face. It seemed a rather huge divergence from the gentle look she had in the afternoon.</p><br/><p>“What are you looking at? Come here?” Looking at Zhou Weiqing’s blur appearance, Shangguan Bing'er was finding it funny in her heart, but she maintained the ice cold expression on her face.</p><br/><p>Zhou Weiqing walked over to her side, asking tentatively: “Bing’er, did you lose your memory?”</p><br/><p>Shangguan Bing'er had thought about what Zhou Weiqing might have possibly said, but she truly never expected those words. She finally couldn’t resist and let out a giggle: “Fool.” [1. It’s a direct translation here, but doesn’t seem to have the right tone in english. It was more in an endearing way.]</p><br/><p>“You did that on purpose?” Zhou Weiqing came to his senses, and with his hands spread out lecherously, he leapt towards Shangguan Bing'er.</p><br/><p>“Do not move.” Shangguan Bing'er said with a stern expression.</p><br/><p>“Er…” Zhou Weiqing stopped himself forcefully in mid-pounce while still in the posture.</p><br/><p>Shangguan Bing'er said sternly: “You are still in my testing period, so you’re not allowed to touch me without permission.” As she said that, the corners of her mouth twitched upwards in a little smile.</p><br/><p>“Bing’er, when did you became so bad!” How could Zhou Weiqing not see that Shangguan Bing'er had said all of that intentionally once more.</p><br/><p>Shangguan Bing'er gave a humph and said, “You’ve already taken the biggest advantage of me. The shadow in my heart is still very deep, of course I must test you a lot more.”</p><br/><p>Zhou Weiqing grinned and said: “Test? Of course you must test. Let’s get on with proper business first though.” He was not anxious at all. Now that Shangguan Bing'er was at least willing to give him the opportunity to be tested, it was already a substantial improvement for their relationship. He enjoyed the feeling of pursuing her very much. In truth, this fellow had quite a high EQ [2. <span class=\"_Tgc\">Emotional Intelligence]</span>, now that the relationship between the two of them had improved, he did not want to destroy it by being overeager.</p><br/><p>Shangguan Bing'er rolled her eyes, saying: “Why do I have the feeling that the present you is even more dangerous than before, when you were being a rascal.”</p><br/><p>Zhou Weiqing blinked, “Should I return to my original state then?”</p><br/><p>“Hmph. No way, you better not.” Came the reply. As she said that, she continued to spread the map in her hands on the table. “Little Fatty, look, here we are.” Shangguan Bing'er pointed to a spot on the map.</p><br/><p>As she moved her fingers along, she continued saying: “If we move ahead along this line, there will be a hill region, which is covered with mass vegetation. The terrain is quite complex, and there are also Heavenly Beasts in the region. In fact, there have been rumours that Zong Stage Heavenly Beasts have appeared there. As such, that hill region has formed into a natural blockade.</p><br/><p>“In order for us to enter the Kalise Empire, there are three possible routes; a main road and two smaller paths. The military might of our three Regiments are mainly focused on holding the main road, while the smaller paths each have two Battalions guarding them respectively. Since the distance from the camps are not very far, as long as enemy troops appear, reinforcements can arrive at a quickest possible time.”</p><br/><p>“The Kalise Empire has stationed the military strength of approximately four Regiments here, which is a larger total force than we have. Furthermore, besides our archery units, their equipment for their other units surpass ours. The four regiments are also stationed together, but similar to us, they have large amounts of patrols surrounding the hills and the paths. If we want to get through to their side, I think that it is best we take one of the smaller paths. In the night, we should be able to conceal ourselves and sneak through.”</p><br/><p>To Shangguan Bing'er’s surprise, Zhou Weiqing started looking very carefully at the map, gesticulating at it with his hand as if he were calculating something, looking very serious and earnest.</p><br/><p>“Little Fatty, what are you doing?” Shangguan Bing'er asked curiously. Although Zhou Weiqing was not specially handsome, but he was tall and of good stature, with broad shoulders and a broad back, his whole body filled with a sunny cheerful aura. His honest looking face was simple but pleasing to the eye. At the moment, when he was focused and serious, he seemed steady and dependable. As the saying goes, men are the most attractive when they are focused. Furthermore, Shangguan Bing'er’s innermost feelings' of anger against him had been relatively soothed earlier today, and at this time she felt that he was not that bad after all.</p><br/><p>“Wait a while.” Zhou Weiqing replied simply to Shangguan Bing'er, as he continued fiddling with the map for some time. After a while, he finally relaxed, before closing his eyes as if in deep thought. At last, he said to her: “Let’s go. As you mentioned previously, it’s better that we go by the smaller path.”</p><br/><p>“En.” Shangguan Bing'er acquiesced. Both of them carried their Purple Dawn Bows on their backs, and brought two quivers of arrows holding 100 arrows respectively, before leaving the tent.</p><br/><p>Shangguan Bing'er made use of her status as Battalion Commander, and using the excuse of patrolling at night, she circled the camp once before quietly sneaking out together with Zhou Weiqing.</p><br/><p>Only as they were leaving the military compound did Zhou Weiqing realise how strict the security of the campsite actually was. All along the way, there were several sentry posts visible, and even greater number of hidden guard posts as well. With her status as Battalion Commander, Shangguan Bing'er just told the guards that she was inspecting the defences, and thus they easily passed through the defense lines. In doing so, they continued heading towards the smaller path, moving on towards the Kalise Empire’s closest military camp.</p><br/><p>After a while, they stopped. “There are no longer any more sentry posts in front of us. Let’s get ready.” As Shangguan Bing'er said that, she unexpectedly started to strip off her armor.</p><br/><p>Zhou Weiqing blinked, “Bing’er, that isn’t good right…”</p><br/><p>“What isn't good?” Shangguan Bing'er asked as she removed her chainmail and helmet, giving him a doubting look, only to see that Zhou Little Fatty had both his hands intertwined together, unexpectedly standing there drawing circles [3. More of a Manhua kind of action to depict a bit of the frustrated/wronged feeling. Something like this]. His head was lowered, and his face also is a little red as he said: “Bing’er, are we advancing a little too quickly? Furthermore, this is in the wilderness, doing ‘field operations’ [4. Lol, literal translation of . Means outdoor s*x], we might catch a cold.”</p><br/><p>Three black lines appeared instantaneously over Shangguan Bing'er head, and she said in mix of embarrassment and anger: “What is your brain thinking off! Keep your dirty thoughts to yourself. How could we possibly sneak through and pull off a surprise attack on the enemy’s camp if we are dressed in armor?”</p><br/><p>“Ehh…” Zhou Weiqing raised his head and looked, and saw that she had taken off her armor, revealing a jet black, tight fitting leotard.[5. Lol I sense his disappointment!]</p><br/>\n</div>"}