{"title": "Chapter 37 Legendary Consolidated Equipment Set (2)", "id": 37, "volume": 1, "url": "http://boxnovel.org/heavenly-jewel-change-chapter-37-legendary-consolidated-equipment-set-2", "volume_title": "Volume 1", "body": "<h1>Chapter 37 Legendary Consolidated Equipment Set (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><b>Chapter 37 Legendary Consolidated Equipment Set (2) </b></p><br/><p>Huyan Aobo sighed and said: “Yes there are, but those are the combined efforts of several God Tier and Zong Stage Consolidating Equipment Masters, and not a single one. Furthermore, this is the first time there has been a Legendary Set consisting of 10 pieces. In the past, our Founder was too proud and wanted to aim for something that had never been done before, otherwise he would probably not have created such a Legendary Set that is just so difficult to create.”</p><br/><p>Huyan Aobo’s words caused Zhou Weiqing’s heart to race in excitement. Indeed, as compared to traditional Heavenly Jewel Masters who Consolidated Legendary Sets, he had a huge advantage. Whether or not he could become a god tier Consolidating Equipment Master, he would at least be able to save an immense amount of materials. After all, for him, a single scroll was sufficient to Consolidate Equipment; thus saving a large amount of Consolidating Ink.</p><br/><p>Just like the current single scroll they had, to others it was perhaps of not much use, but to him, it was sufficient to guarantee success.</p><br/><p>Huyan Aobo stood up and said with a faint smile: “Alright, you’ve gone through a lot these few months and must be exhausted. You will be leaving in a few days, so you should get a good rest as well. Completing the last few sets of basic scrolls is important, but my precious disciple’s body is just as important. You should cultivate your Heavenly Energy while resting, that will aid in your body’s recovery as well.”</p><br/><p>After Huyan Aobo left, Zhou Weiqing gave a bitter smile. Cultivate Heavenly Energy? He really didn’t dare to focus too much on his cultivation any longer. After staying the Flying Hill City for four months, although most of his time had been spent focusing on creating Consolidating Equipment Scrolls, however, that required him to use an immense amount of Heavenly Energy, nearly draining himself, before recovering and repeating the process once again. That, in itself, was a method of cultivation. Furthermore, his Immortal Deity Technique was different from other cultivation techniques, and even if he did not focus on cultivation, it would still improve on its own. During these four months, he was unexpectedly closing in on the maximum point of his level, and he did not know when he would have to breakthrough the twelfth Death Acupuncture Point.</p><br/><p>However, the sheer pain from breaking through Death Acupuncture Points had left a shadow in his heart. Furthermore, with Shangguan Bing’er not by his side, he did not dare to breakthrough the Death Acupuncture Points, fearing that he would not be able to withstand the pain. Even with her by his side, the previous times he had barely been able to get through it, and his character was originally already afraid of pain and death. As such, he naturally did not want to focus on cultivating now, and he would only do so after reaching the Fei Li City and reuniting with Shangguan Bing’er. As such, he decided to complete the last 3 sets of basic Consolidating Equipment Scrolls.</p><br/><p>Over the next few days, Zhou Weiqing slowed down the speed and length of time he used to create the scrolls, ensuring he got sufficient rest. Just like that, in a blink of an eye, the three days had passed, and when night fell, he had finally completed the last sheet of Consolidating Equipment Scrolls.</p><br/><p>A dim green light surrounded his body as the brush tip flowed in a silver light. At this moment, the two Elemental Jewels at his right wrist was glowing silver and green respectively, representing the Spatial and Wind attributes he was using. Under the two attributes, his movements were like flowing water across the surface of the Consolidating Paper. He had already created nearly a thousand of this particular design, and was already very familiar with it, and as he flourished the last brushstroke, the ink and paper melded perfectly in a dazzling flash of gold light. Completion!</p><br/><p>“The 1000th scroll! Hahaha! I’m finally done!” Zhou Weiqing threw the brush in his hands, falling backwards, and lying down without a care about his looks. As he fell back right in the middle of the room, he greedily took in gulps of air as he finally relaxed.</p><br/><p>Finally, he had completed all 392 sets of basic Consolidating Equipment Scrolls! 4 months of non stop effort and focus, he had finally succeeded. A sense of accomplishment flooded his heart, and he felt a sense of relaxation he had never felt before as his tense muscles relaxed. The events of the past four months scrolled past in his mind as he lay on his back, thinking.</p><br/><p>Closing his eyes, Zhou Weiqing could clearly feel the blood circulating in his body, and he felt as if he did not even want to move a finger, just lying there comfortably.</p><br/><p>The vision blurred before him as his whole body relaxed, as exhaustion flooded every cell of his body, his breathing steadied and he slowly fell asleep there.</p><br/><p>After an unknown amount of time, the cute little white tiger Fat Cat, which had been sleeping beside Zhou Weiqing snuggled up to him, suddenly stood up. Its pale purple eyes were excited, as they focused on Zhou Weiqing, as the ‘King’ tatoo on its head seeming to move a little. All of a sudden, it seemed to discover something, jumping to Zhou Weiqing’s head and placing its front paw onto Zhou Weiqing’s face and pushing at him, all the while giving out a low roar.</p><br/><p>“Stop it, Fat Cat.” Zhou Weiqing turned around lazily and pushed it aside, settling back to sleep. However, it insistently jumped back to the other side and continued pushing his head.</p><br/><p>This time, Zhou Weiqing woke up a little. “Eh? Why is it so hot.” He furrowed his brow, pulling at his shirt. However, the next instant, his eyes shot open wide in surprise.</p><br/><p>With a soft *poof* sound, Zhou Weiqing’s clothes almost disintegrated into dust, surprising Fat Cat which was beside him, and causing it to roll a few yards away.</p><br/><p>Just an instant ago, Zhou Weiqing was deep in sleep, but right at this point, his entire body was bathed in cold sweat, a sense of terror invading his heart. The black tiger tattoos sprang back onto the surface of his skin like magic, seeming to ripple like a shockwave around his body. The Heavenly Energy within his body seemed to surge forth like boiling water, raging turbulently throughout his body, heading towards the 3rd section of the spinous process of his lumbar vertebra, targeting the Qi Hai Acupuncture Point, which was the 7th Death Acupuncture Point of the second portion of the Immortal Deity Technique.</p><br/><p>What Zhou Weiqing had feared the most had happened after all. Just half a year had passed since he had last broken through the 6th Death Acupuncture Point, and in this last four months, although he had not focused on cultivation, the incessant usage of Heavenly Energy had caused his energy whirlpools to spin at max speeds in drawing energy in replenishing his constantly drained reserves. As such, although he did not attempt breaking through his Death Acupuncture Points, his Heavenly Energy had already reached its maximum capacity. Previously, when he had completed the final scroll, his consciousness had relaxed totally and falling asleep, he had forgotten to continue controlling his Heavenly Energy. As his Heavenly Energy circulated naturally, they reached their ‘limit’ and started circulating savagely and automatically breaking through his next Death Acupuncture Point.</p><br/><p>Fat Cat had felt something wrong with his body which was why it started trying to wake him up. Under no preparation, the surging Heavenly Energy charged forth towards his 12th Death Acupuncture Point.</p><br/><p>“Damn! Isn’t this forcing a young girl into prostitution[1. Direct Translation - basically meaning being forced into a corner]?” Zhou Weiqing cried in grief and indignation in his heart. At this time, he wasn’t even able to call out as the surging Heavenly Energy had torn away from his control, forcing its way towards the Qi Hai Acupuncture Point, like a slowly advancing army.</p><br/><p>As the second portion of the Immortal Deity Technique had the Death Acupuncture Points all situated at the back, as such, as his Heavenly Energy advanced towards the Qi Hai Acupuncture Point, it passed by the previous six Acupuncture Points on the back, and every time it passed through one, the Heavenly Energy would be boosted by the energy whirlpool and become wilder and more frenzied, and it seemed to be an unstoppable advance.</p><br/><p>By now, Zhou Weiqing felt as if his spine was like a red hot rod, feeling an unbelievable pain! How many nerves were there in the spinal vertebra? They were all being jarred by the terrifying surge of Heavenly Energy, and such a feeling was definitely not for humans. He was almost unable to stand the pain, his body writhing on the ground uncontrollably, each time he shuddered, the black tattoos on his body seemingly growing more obvious, and the muscles on his body seemed to grow larger, the veins under his skin bulging out obviously. As he writhed on the floor, the sheer pain caused his Demonic Change state to activate, but even under that state, he was still disabled by the agony, the only change being the increased recovery, which actually seemed to make the agony even worse.</p><br/><p>The Qi Hai Acupuncture Point was one of the most important Death Acupuncture Points in the entire body, the main reason was because it was where the Heavenly Energy was usually stored. [2. Qi Hai literally means Qi Ocean] The Qi Hai was at the Dantian, and that was where the Heavenly Energy coalesced! Currently, all his Heavenly Energy was rushing in front every other part of his body, charging down towards the Qi Hai Acupuncture Point. Zhou Weiqing believed that if not for the Demonic Change state regenerating his meridians; if not for the improved physique and toughness he had after swallowing the black pearl, his Qi Hai and Dantian would have already exploded by now.</p><br/><p>At this moment, Zhou Weiqing was cursing the creator of this goddamn Immortal Deity Technique, insulting all his ancestors down 18 generations. Alas, he could do nothing but watch as the raging Heavenly Energy headed down slowly, reaching his Qi Hai Acupuncture Point.</p><br/><p>“Come then, if I had to die then so be it.” The intense agony caused him to go crazy; at this time his heart was longing for Bing’er, such a crazed longing that was unbelievably intense. <i>If only Bing’er was at my side...</i></p><br/><p>*BANG*! His Heavenly Energy was like the ocean with many rivers flowing into it[3. Direct translation of an idiom  - pretty much as translated, just that it’s rather awkward in english], and it finally reached the Qi Hai Acupuncture Point. As his Heavenly Energy was already long maxed, as soon as it entered the Qi Hai Acupuncture Point, it broke through almost instantly.</p><br/><p>Zhou Weiqing felt as if something exploded apart in his body, although his Dantian did not disintegrate directly, holes were torn into it by the explosion. The raging Heavenly Energy did not stop there, continuing on towards the rest of his body, causing his entire skin to erupt with a layer of blood.</p><br/><p>*Peng* The door was knocked open, and Huyan Aobo and Feng Yu rushed in. However, as soon as they entered the room, they halted in shock. Zhou Weiqing’s current situation was just too horrifying.</p><br/><p>His entire body was covered with a layer of blood, his muscles torn and veins rippling, while the black tiger tattoo was thick and obvious around his body, seeming to move constantly, while a thick Heavenly Energy surged uncontrollably within his body.</p><br/><p>In Huyan Aobo and Feng Yu’s eyes, something had clearly gone wrong with Zhou Weiqing’s cultivation. Qigong Deviation! [4.  (Zuo Huo Ru Mo) which is a very common term in wuxia/xianxia, meaning something terrible going wrong during cultivation, causing problems with consciousness or even the mind. Alas, there is no direct english translation as the normal/original meaning could actually just be being obsessed with something, or even being possessed. Edit - using this term now, see next page for reasons.], Both of them stared in shock at Zhou Weiqing. With their own cultivation level, they could clearly feel that his Heavenly Energy was raging through his body wildly. “What… what’s going on?” Huyan Aobo’s face was red with urgent worry, almost charging forward to help. However, he was quickly held back by Feng Yu.</p><br/>\n</div>"}