{"title": "Chapter 47 Mysterious White Haired Young Lady (1)", "id": 47, "volume": 1, "url": "http://boxnovel.org/heavenly-jewel-change-chapter-47-mysterious-white-haired-young-lady-1", "volume_title": "Volume 1", "body": "<h1>Chapter 47 Mysterious White Haired Young Lady (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><b>Chapter 47 Mysterious White Haired Young Lady (1)</b></p><br/><p>It was only after she had vanished into the building, when the guards seemed to awaken.</p><br/><p>“Can you guys guess her age?”</p><br/><p>“No, I can’t. Upper level Zun Stage Heavenly Jewel Master! It’s been awhile since I’ve seen such a powerful Heavenly Jewel Master entering our Skill Storing Palace. I wonder why she didn’t go directly to the Wan Shou Empire to look for a suitable Heavenly Beast for Skill Storing?”</p><br/><p>“Who knows? My guess is, this Upper level Zun Stage Heavenly Jewel Master should be the Light Attribute… It felt as if she was as bright as the sun itself.”</p><br/><p>After entering the Skill Storing Palace, the white haired young lady did not stop at all, directly entering the path leading to the Spatial Attribute Skill Storing area. Every step she took seemed to bring her naturally almost a dozen metres to the front, floating along as if she had no real physical body. Before long she had reached the hall to choose the Heavenly Beast’s stage.</p><br/><p>The two Skill Storing Palace Jewel Masters who were guarding the hall were just about to ask her what stage of Heavenly Beast she was looking for, when… the white haired lady waved her left hands, a dim white light flashed out and the two of them crumpled back down into their seats. In another flash of white light, her body stealthily entered the recently opened passage - leading to the one and only King Stage Heavenly Beast, Silver Emperor.</p><br/><p>In the next instant, she appeared in front of the Silver Emperor.</p><br/><p>As if sensing her presence, the Silver Emperor which had been confined to the ground by the powerful Darkness Seals suddenly raised its head. When it saw the white haired lady, it started chittering excitedly, the silver feathers on its body standing up and its eyes revealing its excitement.</p><br/><p>Once again, the white haired lady raised her left hand, and a thick milky white light swirled out and enveloped the Silver Emperor quietly. As soon as the white light met with the Darkness seal on its forehead and wings, the Silver Emperor’s body started quivering involuntarily.</p><br/><p>All of a sudden, the milky white brilliant light turned gold. The three black Darkness Seals suddenly started melting away like snow in the summer’s sun.</p><br/><p>The Silver Emperor shuddered, its wings spreading wide violently, and a terrifying aura exploded outwards. In a ear piercing shattering sound, the chains on its body split apart, and a long suppressed cry shrieked out from its mouth.</p><br/><p>The white haired lady looked on impassively as that all happened, with nary a change in expression. With another flick of her right hand, a brilliant gold light fell upon the Silver Emperor’s forehead. Instantly, its entire body was enveloped by a dim gold light, and the terrifying aura of surrounding it seemed to strengthen several fold. Its rather weak eyes turned strong and powerful, and a golden symbol appeared on its forehead.</p><br/><p>The white haired lady finally opened her mouth… Her voice was soft and pleasing to the ear… extremely enchanting, yet seemingly without any emotions.</p><br/><p>“Saving you now from your torture… In future, you belong to the Snow God. Come with me…”</p><br/><p>The Silver Emperor nodded repeatedly, its cries slowly stopping, and its terrifying and violent aura that showed its powerful rank of a King Stage Heavenly Beast settled down and vanished as it calmed down. Spreading its wings, the Silver Emperor landed on her shoulders. A dim white light enveloped the two of them, and they levitated up, warping into a ball of thick white light and shooting forth out of the Skill Storing Palace like a bolt of lightning.</p><br/><p>Earlier when the Silver Emperor had cried shrilly, the entire Skill Storing Palace shook in the massive reverberation. Instantly, ten powerful auras erupted from the distance, all speeding towards the Skill Storing Palace.</p><br/><p>Alas, when they reached, all they saw was a mass of white life flying out of the Skill Storing Palace. Instantly, the ten terrifying auras surrounded it in anger.</p><br/><p>A loud angry howl filled with rage sounded forth as a silver bolt of lightning seemed to tear through and swallow the entire Skill Storing Palace. Despite them being in midst of the bright light, it seems the outside was all surrounded by a pitch black darkness. In the next instance, the silver light and the white light seemed to both burst forth at the same time. The darkness surrounding them and blocking them dissolved and the two disappeared into the distance.</p><br/><p>When the ten powerful members of the Skill Storing Palace’s settled down in anger and went to investigate the Silver Emperor’s stone chamber, they saw a line of gold words left there.</p><br/><p>“How dare you all enslave a King Stage Heavenly Beast? It has now returned to the arms of the Snow God Mountain, if you continue… Wait to be destroyed.”</p><br/><p>When they saw the words, they couldn’t help but feel a chill run down their spines. As one, they exclaimed: “Snow God Mountain… Damned!”</p><br/><p>…</p><br/><p>Back at Fei Li Imperial Family Military Academy.</p><br/><p>“Little Fatty… Wake up. The opening ceremony has ended.” Shangguan Bing'er nudged Zhou Weiqing who was beside her dozing away.</p><br/><p>“Uh? Ended? En… Impressive, our teachers’ words are so inspiring.” Zhou Weiqing had not even opened his eyes, and the words already streamed out of his mouth. Listening to this fellow’s words, the students around who had all seen him drooling as he dozed away were all struck speechless.</p><br/><p>As Zhou Weiqing opened his eyes, the school leaders had all left, and many of the other students had stood up and were in the midst of leaving.</p><br/><p>“Inspiring?” Ming Hua’s mocking sound entered his ears, causing him to wake up fully. “Students of Commoner Class One, follow me back to the class.”</p><br/><p>Following Ming Hua’s instructions, all the students headed with her towards the exit of the assembly hall.</p><br/><p>Ming Hua eyed Zhou Weiqing, and as their gazes met, he wriggled his brow at her, while she smiled at him enchantingly. It was as if that life threatening battle between them did not happen yesterday.</p><br/><p>The commoner class one’s classroom was also at the first level of the main building, and they reached it not long after exiting the assembly hall.</p><br/><p>There were forty seats in the classroom; more than enough for all twenty nine of them. Amongst all the students, Ma Qun and Zhou Weiqing were the tallest and largest, so they naturally were seated at the back. Originally, Zhou Weiqing wanted Shangguan Bing'er to sit next to him, but she refused. Her reason was simple - if she sat next to him, he would just try to get intimate all the time and how could they pay attention in class.</p><br/><p>Ming Hua stood at the podium in the front. At this moment, there was no longer any smile on her face, and she looked the picture of a very serious teacher. However, she looked just so sexy and appealing… Most of the male students were just staring at her. This was the first time that they felt that perhaps it was so much luckier to be in the commoner class! At least, the noble class shouldn’t have such a great teacher like Ming Hua right?</p><br/><p>Ming Hua said: “Hello everyone, as mentioned previously, my name is Ming Hua. For the next four years, I will be your class teacher. I shall not speak further about miscellaneous things… Comparing talents, our commoner class is definitely higher than any of the noble classes. In the future, for any tests or examinations that are held, our target it always the number one position. Actual classes will start tomorrow. Here is the class schedule… Everyone pass it around.” With that, she flicked her hand, and a piece of paper appeared in her palm. Clearly, she also had a spatial ring or necklace of some sort.</p><br/><p>She passed the class schedule to a student in the front row.</p><br/><p>Seated at the back, Zhou Weiqing was one of the last to get the schedule. Looking at it, he felt a headache coming on… the main classes were the entire continent’s history, geography, intelligence and spycraft, battle analysis, battle tactics, individual military capabilities, sand table simulations and other battle simulation classes… These were some of the nearly dozen different classes they had. Everyday, there were two big classes, one in the morning, and one in the afternoon, and the day ended near evening time. Their entire week was packed, with only one off day. To those people like Zhou Weiqing, who had not attended an earlier, intermediate military high school, this was quite a shock.</p><br/><p>Having given out the class schedule and seen that everyone had looked through it, Ming Hua continued: “No one is allowed to miss classes, be late, or leave early. There will be a test every month, and an examination every end of the year. Those who do not pass the annual examination will be forced to leave the academy. In the afternoon, all of you can go to the student affairs department to get your class materials and books. In the future, if you all have any other questions, you can ask me. The courses I will mainly be teaching will be the following three - intelligence and spycraft, battle analysis and individual military capabilities.”</p><br/><p>Ma Qun, who was seated next to Zhou Weiqing, immediately called out excitedly: “Teacher… In the individual military capabilities class… Does that mean we can spar with you? If there is any physical contact… Heh heh… Teacher won't blame us right?”</p><br/><p>Ming Hua gave a faint smile, with a faintly sly, evil tinge in it. “Of course not. However… To spar with me… You will have to be careful… As I won’t hold back. Your name is Ma Qun right? I’ve heard that you are a pure defensive Heavenly Jewel Master…”</p><br/><p>Ma Qun immediately puffed up his chest and said: “Yes teacher! My Heavenly Energy is already at the Seventh Level of the Heavenly Jing Energy stage… Almost reaching my second set of Jewels.”</p><br/><p>Ming Hua nodded and said: “Very good. Tomorrow we have an individual military capabilities class. I do not mind sparring with you personally.”</p><br/><p>Ma Qun was overjoyed. Although Ming Hua was a teacher, but this was after all a military academy school… He did not think that such a frail looking beauty like Ming Hua would be much stronger than him. Even if she were slightly stronger, he was confident in his defence… To be hit by a beauty like that… It was another kind of enjoyment! If he could manage to touch her… Heh heh… That would be awesome.</p><br/><p>Zhou Weiqing gave Ma Qun a pitiful look, knowing full well Ming Hua’s power. Of course, he did not give him any warning. Heh… To spar with Ming Hua, that fellow would be in deep trouble.</p><br/><p>Ming Hua’s gaze moved from Ma Qun to rest on Zhou Weiqing as she continued speaking: “Earlier, before the opening ceremony, Student Zhou Weiqing said that he wants to be our class rep, and will upkeep all of your requirements for Consolidating Equipment Scrolls and Skill Storing. I am very happy to have such a kind student. Does anyone have any issues with him being the class rep?”</p><br/><p>Without question… Everyone voted for Zhou Weiqing, who couldn't help but give Ming Hua a smug look.</p><br/><p>Ming Hua did not display any of her character when she had fought Zhou Weiqing yesterday, looking much like a normal teacher instead. “In that case, Zhou Weiqing will now be our class rep. Kou Rui, I’ve seen your entrance examination answers… in terms of battlefield analysis, you have displayed much talent in terms of intelligence and spycraft, with much innovation in the guerilla combat style. I believe that you have very high talent in this area, and I will put you in charge of collecting all the information on all your classmates’ information for Skill Storing and Consolidating Equipment. After doing so, you can pass the information to your class rep.”</p><br/>\n</div>"}