{"title": "Chapter 50 Challenge! Upper Level Heavenly Zong Jewel Master! (2)", "id": 50, "volume": 1, "url": "http://boxnovel.org/heavenly-jewel-change-chapter-50-challenge-upper-level-heavenly-zong-jewel-master-2", "volume_title": "Volume 1", "body": "<h1>Chapter 50 Challenge! Upper Level Heavenly Zong Jewel Master! (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><b>Chapter 50 Challenge! Upper Level Heavenly Zong Jewel Master! (2)</b></p><br/><p><em>How was that possible? He was still a few hundred metres away!</em> Zhou Weiqing was now shocked to the core, his body in mid air, but he managed to twist himself around to look. All he saw was Ming Wu speeding forth towards him, and the suction force was from a huge red flower.</p><br/><p>It was a similar Hades’ Flower like Ming Hua’s, but Ming Wu’s one was larger and much more powerful than hers, more than ten, or even a hundred times! Zhou Weiqing was just unable to resist that suction force as he was dragged back unwillingly. In this way, in the next moment, Ming Wu would soon catch up with him and catch him.</p><br/><p>It was at this point that Zhou Weiqing finally used all his power. In mid air, his left hand slashed towards the back, a ear-splitting tearing sound accompanying a silver flash - the Spatial Rend.</p><br/><p>The Spatial Rend’s effect was without doubt extremely powerful, and with it blocking, although it did not fully deal with the strong suction power of the Hades’ Flower, it at least managed to block a large percentage of it, allowing Zhou Weiqing to regain control. At the same time, he used another Spatial Skill, Blink, which sent him ten metres away. Since he had reached the 3-Jeweled cultivation level, his Blink skill had improved from 3 metres range to 10 metres, and the cooldown had also reduced.</p><br/><p>Not only did he unleash those two Skills, while in the midst of Blinking, Zhou Weiqing’s first Icy Jade Physical Jewel also glowed brilliantly in a swirl of white icy mist as the Overlord Bow coalesced into his hands.</p><br/><p>The reason why he released the Overlord Bow was because Zhou Weiqing knew that attempting to run was of no use. His only hope was to attempt to stall Ming Wu with his attacks, in hopes to get an opportunity to escape. As such, he released both Stored Elemental Skills and Consolidated Physical Jewel Equipment.</p><br/><p>As his right leg lashed out in the air, causing a sharp explosive sound as he once again charged forth towards the city walls. At the same time, he drew the Overlord Bow to its maximum, body twisting in midair as he twirled the Overlord Bow in his hands, the bowstring formed of pure Heavenly Energy twisting around the titanium alloy arrow he had nocked upon it. With a quick release, the arrow flew out with a loud swoosh.</p><br/><p>The archery skill that Zhou Weiqing had used was Mu En’s specialty skill, making use of a massive corkscrew spin on the bowstring to greatly increase the power, and his own unique style of control to release one of the most powerful archery attacks.</p><br/><p>Mu En was after all only a 6-Jeweled Physical Jewel Master, yet he had managed to use this archery skill to heavily injure a Zong Stage Heavenly Beast. From that, one could tell how powerful it truly was. Furthermore, although Zhou Weiqing’s Heavenly Energy was currently not comparable to his teacher’s, his pure physical strength had long since way surpassed Mu En’s. He was also using the great Overlord Bow, a powerful Consolidated Equipment that only Strength Heavenly Jewel Masters could use.</p><br/><p>An arrow released by such a skill already had a huge destructive power, and adding the explosive effect of the Overlord Bow to the mix would only cause an effect of the whole being greater than the sum of its parts, more than several times the destructive capabilities!</p><br/><p>One should never forget that Zhou Weiqing was not a close combat type Heavenly Jewel Master, but an archer! Although his close combat skills were decent, especially with his Legendary Consolidated Equipment Set Hammers in hand, he was definitely not as well versed and practiced in using them as when he had bow in hand, and naturally he was at his best when using archery.</p><br/><p>For Ming Wu to dare to allow Zhou Weiqing to start running first, he naturally had the confidence to easily catch him. With his cultivation level, if Zhou Weiqing could reach the city without him doing anything, that would be a joke.</p><br/><p>If the current situation carried on, with the Hades’ Flower strong suction powers, it would barely be another blink of an eye before Zhou Weiqing would reach within 30 metres of Ming Wu. Once that happened, Ming Wu was confident that he could totally subdue Zhou Weiqing without any issues and complete crush all his hopes of resisting.</p><br/><p>However, just when he thought that everything was secured, Zhou Weiqing’s sudden Spatial Rend gave Ming Wu a surprise. Although he had heard his daughter’s description of it, it was a totally different matter experiencing it on his own! Ming Wu was after all a lot more experienced and knowledgeable than Ming Hua, and he definitely recognized the skill although she did not.</p><br/><p><i>The Silver Emperor’s Spatial Rend! How could this be possible… with that little brat’s mere cultivation level, how could he possibly Store such a Skill from the Silver Emperor?! </i>In that instant, Ming Wu was truly shocked to his core. What was the Silver Emperor? It was a King Stage Heavenly Beast! To put things in perspective, even with Ming Wu’s power and cultivation level, should he be a Spatial Heavenly Jewel Master, he would still likely not be able to Store and Skills from the Silver Emperor!</p><br/><p>Heavenly Beasts were similar to Heavenly Jewel Masters when ranking up, and the gap from Zong Stage to King Stage was immense, not just a huge increase in quantity of power, but quality as well, and the stage was considered quite an important breakthrough. From what Ming Wu knew, he had never even heard of any Heavenly Jewel Master below King Stage being able to Store Skills from a King Stage Heavenly Beast! That just wasn’t realistic at all!</p><br/><p>Yet, at the same time, Ming Wu was extremely certain that he had not made a mistake or have his eyes deceived him. The skill that Zhou Weiqing used was indeed the Spatial Rend of the Silver Emperor! At the same time, he knew that the Skill Storing Palace had recently captured a Silver Emperor, and it had paid quite a heavy price in doing so.</p><br/><p>Despite the shock and bewilderment in his heart causing his mind to race wildly, Ming Wu’s actions did not slow at all. Even with the Hades’ Flower being blocked by the Spatial Rend, with his 9-Jeweled cultivation level, he was still very confident in taking down Zhou Weiqing before he could escape.</p><br/><p>Just at that moment, Zhou Weiqing’s Overlord Bow fired out the arrow, and once again Ming Wu was given a nasty shock at the power of the arrow speeding towards him. Judging by its power, he dared not let it strike him, as it would definitely deal some damage to him.</p><br/><p>With his body in mid air, Ming Wu made a guarding motion with his right hand, using his fingers to strike out at the arrow at the precise time. At the same time, a white light erupted out from his hands on the point of impact, forcefully covering the massive explosion and shielding it from him.</p><br/><p>Without a doubt, even with Zhou Weiqing’s amazing archery and his Consolidated Equipment Overlord Bow, Zhou Weiqing was still unable to threaten Ming Wu. However, a something strange occurred - Ming Wu’s body froze in mid air. Although his body was still carried forward by inertia, but his speed was like a snail’s pace as compared to his previous motion.</p><br/><p><i>How could this be?!</i> Ming Wu’s face changed for the first time, shock, disbelief and even a hint of fear displaying out. Although he had been surprised several times by Zhou Weiqing earlier, nothing had such an effect on him as this. After all, when Ming Wu had dealt with the blow earlier, he had made use of his Heavenly Xu Energy to dissolve the power held within the arrow. Yet, when it exploded, his speed had shockingly still been affected, causing him to slow drastically. Furthermore, he was now circulating all his Heavenly Energy, even manipulating the Life Attribute of his Elemental Jewels, and yet he was still unable to resolve this slowing effect… which lasted a whole three seconds.</p><br/><p>Three seconds might seem a short period of time, but sometimes it might just seem an extremely long time. Now, in the heat of combat, it was such a time indeed.</p><br/><p>However, after shooting the arrow, Zhou Weiqing did not even look at Ming Wu, not hesitating a bit to see the effect. Instead, he had already spun around, right foot slamming hard on the city walls. Once again, his body flew up into the air, and in the short span of the three seconds, he had already swiftly leapt up onto the top of the world like a gust of wind. As he did so, he even waved towards Ming Wu before jumping down into the city. At the same time, he also cried out loudly in a weird sound, drawing attention and causing a commotion amongst the city guards. Without question, he was trying to create a large commotion in order to aid his escape.</p><br/><p>As the three seconds ended, a moment later, Ming Wu was already in the Fei Li City. Currently, the expression on his face was very ugly. Up until now, he still had not figured out what skill Zhou Weiqing had used to be able to slow him down for three seconds. With the huge disparity between the two of their cultivation levels, this was originally not something that was possible.</p><br/><p>As soon as Zhou Weiqing entered the Fei Li City, he immediately ran for his life. His heart was still pounding away in fear, and his only thought now was to take Shangguan Bing’er and get out of Fei Li City immediately. Even though his studies were important, and so were the students he had planned to recruit from the Fei Li Military Academy, nothing was more important to him than his own freedom. Furthermore, it might be even death he faced.</p><br/><p>All of a sudden, Zhou Weiqing stopped in his tracks. In front of him, a shadowy figure stood illuminated by the moonlight - it was Ming Wu.</p><br/><p>Currently, Ming Wu was standing there, his arms crossed and brow furrowed. His gaze seemed to flicker around, as if struggling with something.</p><br/><p>Zhou Weiqing stood in surprise for a moment, before he finally forced a smile on his face… “Senior, I never expected to meet you again so quickly. Do not worry Senior, although I am young and my cultivation level is way below yours, but I definitely am a man of my word. I will never reveal anything about the Heavenly Demon Sect to anyone else. To keep my promise is what a man has to do…”</p><br/><p>Ming Wu sighed and said: “Enough. You do not need to try and wrangle anything out of me. I admit that you have really given me many big surprises today, and I have lost the previous bet. I had truly never expected you to not just have the Silver Emperor’s Spatial Rend, but also that unknown powerful control skill! If I’m not wrong, your attributes are Wind, Spatial and Demonic… at least three attributes!”</p><br/><p>Zhou Weiqing said: “It’s getting late, senior. Since our bet has ended, then this junior will return home to sleep.” As he said that, he turned and quickly walked away.</p><br/><p>Alas, in a quick flash, Ming Wu stood in front of him once more, the expression on his face extremely ugly. With a sigh, he said: “I’m very sorry, young man. I’m afraid that I have to break my word for once. For the sake of the Sect’s future, my own personal honour is nothing, and I am willing to bear the name of being perfidy. Alas, no matter what, I need you to join our Heavenly Demon Sect today. You are just too talented, and your talent alone gives me the chills. I believe that if you join our Heavenly Demon Sect, in the future, you will bring our Sect to rise up in glory.”</p><br/><p>Zhou Weiqing’s eyes widened as he stared at Ming Wu, dumfounded… the situation before his eyes was definitely not what he expected.</p><br/><p>For a Upper Level Zong Stage Heavenly Jewel Master like Ming Wu, with his status in the Heavenly Jewel Master World, he had actually gone back on his word!</p><br/><p>Bearing the name of perfidy might sound easy, but for a Upper Level Zong Stage Heavenly Jewel Master to say that, how difficult could it be? At this point, Zhou Weiqing’s heart sank like a rock. Now that Ming Wu had thrown his honour away for the sake of his Sect, Zhou Weiqing was at a loss of what to do.</p><br/>\n</div>"}