{"title": "Chapter 51 Top Peak of the North, Tian Er (2)", "id": 51, "volume": 1, "url": "http://boxnovel.org/heavenly-jewel-change-chapter-51-top-peak-of-the-north-tian-er-2", "volume_title": "Volume 1", "body": "<h1>Chapter 51 Top Peak of the North, Tian Er (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><b>Chapter 51 Top Peak of the North, Tian Er (2)</b></p><br/><p>At the same time, the two skills had fused together to form the Dual Attribute Skill Silver Emperor Spatial Rend Slash, the strongest final skill of the Silver Emperor!</p><br/><p>Of course, Zhou Weiqing’s Silver Emperor Spatial Rend Slash was not comparable in any way to the Silver Emperor’s. If it were the Silver Emperor unleashing it, it would likely be able to heavily injure Ming Wu, or even kill him. However, the Hammer had at least boosted it by a significant amount, not to mention the original destructive power of the Hammer itself.</p><br/><p>Just from the various boosts to strength alone, this strike by Zhou Weiqing was more than ten times his usual power. After absorbing the black pearl, he had already been stronger than any ordinary Strength Type Heavenly Jewel Master, let alone now with a ten times boost! Adding on to that the fearsome Silver Emperor Spatial Rend Slash being boosted by the Legendary Hammers… this blow was indeed powerful enough to injure Ming Wu.</p><br/><p>Still, if not for his elaborate plan in making Ming Wu underestimate him, and most importantly that first punch which had resulted in Ming Wu striking nothing and using his strength wrongly and almost injuring himself, it was likely that this powerful blow could be easily blocked by Ming Wu. After all, the power difference between the two of them was just too huge. However, that was the true beauty of the hammers, being able to switch between real and fake. Once someone was tricked by it and used their strength wrongly, it would open them up to a true powerful strike by the other hammer. In Ming Wu’s case, it had been his sheer power that saved his life by forcefully moving his head away from the blow.</p><br/><p>“Father!!!” Ming Hua cried out loud, running towards the battle ground.</p><br/><p>Zhou Weiqing did not try to make another move to escape. He knew clearly that it would be futile, he was utterly exhausted physically, mentally and also drained of all his Heavenly Energy, and even his Demonic Change had dissipated as he was no longer able to sustain it, and the black tattoos were disappearing slowly. From that, one could tell how much he had expended during that fight - not just in terms of energy, but also mentally.</p><br/><p>A strong sense of exhaustion enveloped his mind and body, feeling an emptiness within him. Slumping down on the floor, he could not even gather the energy to get up.</p><br/><p>In the end, he had failed. The difference in power was just too huge. When he had succeeded in striking Ming Wu, Zhou Weiqing could feel that his attempt to kill Ming Wu had failed. The defense of the 8-piece Consolidated Equipment Set coupled with his massive Heavenly Energy was just too much.</p><br/><p>Currently, his heart was filled with sorrow. <i>Is this it? That was the difference in power! Will I be forced to join this Heavenly Demon Sect?</i></p><br/><p>*Bang*! Another loud explosion rang out and a gold figure leapt up, shabby and disheveled. It was Ming Wu, but currently he looked nothing like the well groomed, calm and unflurried self that he was earlier. Although he was still wearing his Consolidated Equipment Set, its glow was dim and the right shoulder pauldrons was totally caved in, with several obvious cracks on it. His right arm was flopping uselessly at his side; although Zhou Weiqing had failed to kill him with that blow, it had still managed to totally destroy his shoulder bones. If not for their huge power difference, even if Zhou Weiqing had not struck his head, that blow might still have killed him.</p><br/><p>The expression on Ming Wu’s face was extremely ugly now. After all, as a 9-Jeweled Heavenly Jewel Master facing a 3-Jeweled Jewel Master, for him to sustain such a heavy injury was almost unimaginable.</p><br/><p>Lifting up his left hand, a soft but thick green light covered his right shoulder. After all, his Elemental Jewel was of the Life and Demonic Attributes. However, even for such a powerful Life Attribute Heavenly Jewel Master, it would not be easy to completely recover from the injury on his shoulder. After all, the Legendary Hammer had pulverized the shoulder bones, and it would not be so easily dealt with.</p><br/><p>“Little brat, you are so savage, my entire right shoulder has been shattered. If not for the fact I managed to dodge quickly, it would have been my head that was shattered.” Ming Wu said coldly to Zhou Weiqing.</p><br/><p>Seeing her father injured so badly, Ming Hua’s eyes turned red. “I’ll kill you!” She cried out angrily as she charged towards Zhou Weiqing.</p><br/><p>However, she was quickly stopped by Ming Wu, who held her back with his left hand. At this time, he actually smiled, causing the exhausted Zhou Weiqing to start in surprise.</p><br/><p>“What are you smiling about?” Zhou Weiqing asked suspiciously.</p><br/><p>Ming Wu smiled and said: “I was too overconfident and underestimated you. I originally thought I could easily take you down without using any Skills or Consolidated Equipment, but never expected that you would trick me. It’s okay though, I can always recover from my wounds, but if I miss out on such a great talent like you, then I will regret it for the rest of my life. I broke my word, and you shattered my shoulder, I shall count it as even then. I will not pursue it further, as we will be comrades in the future. You are an intelligent young man, and I need not say more.”</p><br/><p>Although Ming Wu was furious that his shoulder had been shattered, but who was he? He was one of the top powerhouses in the world. As he thought further, his mood turned better. After all, the more talented Zhou Weiqing was, the greater the benefit it would be for his Heavenly Demon Sect right? No matter how amazing his talent was, Zhou Weiqing still had too much growing to do before he was strong enough. Earlier, if Ming Wu had taken him seriously and gone full out, Zhou Weiqing would not even have the opportunity to even take any action. Once he had gone through the ceremony of the Heavenly Demon Sect, he would be one of them, and Ming Wu felt that his wound was nothing in comparison. Furthermore, his status in the Sect would rise rapidly if he brought Zhou Weiqing in.</p><br/><p>What he admired most about Zhou Weiqing was not just his Heavenly Jewel Master talent, but more importantly his intelligence and steady mindset. WIthout question, being able to injure Ming Wu was the result of Zhou Weiqing’s almost perfect planning and control. Up until the final blow, Ming Wu had not felt anything amiss nor sensed any danger… to be able to do something like that, what kind of intelligence would it take?</p><br/><p>Zhou Weiqing’s lips were pursed as his twelve energy whirlpools revolved at their maximum speed, attempting to recover as much as possible to his drained body. However, he was definitely not in a good mood right now.</p><br/><p>By now, he felt totally at a loss, with nothing left to try. The exhaustion and dazed feeling he had was growing stronger by the minute. He wanted to try more, to escape, but alas the heart was willing but the mind was weak. He had done his best, put in everything he had, but the final result had not changed.</p><br/><p>The anger in Ming Hua’s eyes also diminished slowly as she listened to her father’s words, and the surprise in her heart also grew. In that instant, Zhou Weiqing’s image in her mind changed, as he seemed so very different now. He no longer had that lascivious look on his face, fully expressionless. His eyes calm but the light in them seemed dimmer than usual. His face was pale, clearly showing how weak he was now. However, in such a state, it seemed as if all his masks were stripped off, and he seemed to have a strange charisma that somehow drew her to him.</p><br/><p>“I did not lose, but I’ve still lost.” Zhou Weiqing said passively, his hands pressed against the wall to support his body as he struggled to get up.</p><br/><p>Ming Wu looked at him with appreciation, saying: “Indeed, you did not lose to me. I have always thought that my son was the top of the younger generation. Now, when I look at you, I know how true the saying goes. There are mountains beyond mountains,and heavens beyond heavens[1. Direct translation of the idiom, pretty much means there’s always someone better out there]. If one day you become more powerful than me, you can always kill me in revenge for what I did to you today, but for now, no matter what, I cannot let you go. Letting such a talent like you go is tantamount to giving up our Sect’s possible grand future.”</p><br/><p>“Going back on your word, is this what the Heavenly Demon Sect is? So much for your insistence that you are not evil, but in the end your actions show your true colours.” All of a sudden, a clear cold voice rang out in the air, seemingly insubstantial, and none of them could tell where it was coming from.</p><br/><p>Ming Wu’s face changed. “Who’s that?!” He asked sharply. With his cultivation level, for him not to be able to detect someone getting close was extremely shocking. Furthermore, this person seemed to know who he was and his power levels, yet dared to speak up, that definitely showed a level of confidence.</p><br/><p>After he asked the question, suddenly all three of their gazes were drawn to the side of the street, as if sucked in by a magnet.</p><br/><p>In the quiet of the night, a shimmering white figure suddenly appeared there as if out of nowhere. The white seemed so pure and encompassing. A white dress, white hair, and fair and exquisite features. The only contrast was the two strips of dark blue hair lining the sides of the forehead, as well as a pair of glimmering deep purple eyes, injecting the entire image with colour.</p><br/><p>This was a nigh perfect lady. Zhou Weiqing couldn’t help but stare, dazed. Perhaps, Shangguan Bing’er was equal in term of looks, but this lady seemed to have a very unique aura and quality that no other girl he had seen could compare to.</p><br/><p>Even Ming Wu, with his power and steady character, couldn’t help but stare when he spotted this white clad young lady. As for Ming Hua, she almost had the feeling of being ashamed of her own appearance in comparison as she looked upon her countenance.</p><br/><p>It was as if she didn’t take any steps, but she appeared right in front of them. Around her right wrist, Zhou Weiqing saw six Icy Jade Physical Jewels.</p><br/><p>Upper level Zun Stage Heavenly Jewel Master!</p><br/><p><i>Who is she?</i> Without knowing why, when Zhou Weiqing looked at her, he felt a strange sense of familiarity. Yet, he was sure that he had never seen this lady before. However, from her words, it seemed that she was here to help him. Zhou Weiqing kept quiet. In such a circumstance, that seemed the best course of action for him, to wait and see how things played out.</p><br/><p>Besides the six Icy Jade Physical Jewels, the white clad young lady did not cover the Elemental Jewels on her left wrist. Swirling around them were actually six Alexandrite Cat’s Eye Jewels, glittering rose red in the dark of the night… She had the same Jewels as Zhou Weiqing!</p><br/><p>“Who are you?” Ming Wu asked once more solemnly.</p><br/><p>The white clad lady said passively in her clear, cold voice: “Top Peak of the North.”</p><br/><p>Hearing the words, Ming Wu’s face changed once more, and he couldn’t help but exclaim: “Heavenly Snow Mountain?!”</p><br/>\n</div>"}