{"title": "Chapter 72 In front of Absolute Strength, Tricks are Useless (1)", "id": 72, "volume": 1, "url": "http://boxnovel.org/heavenly-jewel-change-chapter-72-in-front-of-absolute-strength-tricks-are-useless-1", "volume_title": "Volume 1", "body": "<h1>Chapter 72 In front of Absolute Strength, Tricks are Useless (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><b>Chapter 72 In front of Absolute Strength, Tricks are Useless (1)</b></p><br/><p>When Shangguan Bing’er stopped suddenly and stared into the distance, Zhou Weiqing started, following her gaze. He saw, right at the end, Bai Jiu and his follower were talking with a black clad girl. Looking at their expressions, they seemed very respectful towards her.</p><br/><p>“She is the girl who attacked us last time.” Shangguan Bing’er said softly.</p><br/><p>“En?” Zhou Weiqing was shocked in his heart as well. He had not experienced the previous fight himself, but he had heard the other team members’ descriptions. Even though during that final fight with her, most of their members had been exhausted or wounded, it still had not changed the fact that she had personally taken down the entire Fei Li Battle Team by herself; she was definitely extremely powerful.</p><br/><p>Furthermore, along with their descriptions, Zhou Weiqing had quickly realised that the black clad girl who called herself the Little Witch definitely had both the Darkness and Demonic Attributes. Furthermore, she could use some plants to support her, that likely signified the Life Attribute. This allowed him to think of another place - the Heavenly Demon Sect.</p><br/><p>The Heavenly Jewel Masters with the Demonic Attribute were hunted throughout the world, and only the Heavenly Demon Sect could possibly have such a powerful Demonic Attribute Heavenly Jewel Master. Furthermore, seeing as she was so young, it was likely she was someone important in the Sect.</p><br/><p>At this moment, for Little Witch to actually be together with Bai Jiu and Luo Xiaoye, that was definitely bad news for Zhou Weiqing. He did not fear the Kalise Empire, even if they had the support of the Bai Da Empire, they were still only the second team of the Bai Da Empire. However, if the Heavenly Demon Sect was joining in, then it would be a totally different matter. After all, Zhou Weiqing was clear on how powerful the Heavenly Demon Sect was; he had almost died at the hands of Ming Wu.</p><br/><p>Perhaps sensing Zhou Weiqing’s gaze on her, Little Witch lifted her head and looked towards them. As their gazes met, Zhou Weiqing saw the spirit and vivacious flexible intelligence in her eyes, yet with a terrifying depth; while Little Witch saw the aggressive, almost invasive nature of his gaze. Next, Little Witch saw Shangguan Bing’er beside Zhou Weiqing, and a curious look appeared on her face. Naturally, she remembered the battle a few days back clearly, and yet Zhou Weiqing had not appeared during that battle.</p><br/><p>Bai Jiu and Luo Xiaoye also followed her gaze to see Zhou Weiqing and Shangguan Bing’er. On seeing it was them, Bai Jiu quickly said something to Little Witch softly, clearly explaining their origins.</p><br/><p>Little Witch inclined her head towards Zhou Weiqing, revealing a cute smile as she winked at him. At that moment, Fat Cat, who had been sleeping in Zhou Weiqing’s arms, woke up suddenly, poking her head out, her deep purple eyes looking towards Little Witch.</p><br/><p>Seeing Fat Cat in Zhou Weiqing’s bosom, Little Witch’s body shuddered slightly, a look of utter shock flashing in her eyes momentarily. Due to her shock, she lost composure for a second, but quickly her expression frosted over as her mouth curled in an amused, pondering look before she turned and left.</p><br/><p>Bai Jiu gave them an arrogant, disdainful look before chasing after Little Witch.</p><br/><p>Watching them leave, Zhou Weiqing held Shangguan Bing’er’s hand and said a little worriedly: “It looks like we might be in some trouble. If the Little Witch is representing the Heavenly Demon Sect, and they are really supporting the Kalise Empire, then our Heavenly Bow Empire might truly be in trouble soon.”</p><br/><p>Shangguan Bing’er furrowed her brow and said: “Should we report them? After all, the entire world is hunting these Evil Heavenly Jewel Masters; as long as we report them, perhaps they will be disqualified from the Heavenly Jewel Tournament.”</p><br/><p>Zhou Weiqing shook his head and said: “No. They have been hunted for so long, yet their Sect has stayed around for all this time. They definitely have some methods to hide their powers. Even if we report them, it will be difficult to prove anything. On the other hand, that will totally anger the Heavenly Demon Sect; if they haven’t thrown their support behind Kalise Empire, that might push them to do so. Not only will we be in trouble, our Empire will be in even greater danger. Do not worry so much, let’s use this Heavenly Jewel Tournament to observe how much support the Heavenly Demon Sect is throwing behind the Kalise Empire. To be honest, the Kalise Empire is way too small for the Heavenly Demon Sect… even if they wanted to support an empire, it should be a large empire like Fei Li or Bai Da. My guess is that the Kalise Empire might just be their puppet, while their true target is to get to the top four and enter the Heavenly Jewel Island. If my guess is right, then this just proves that the Heavenly Jewel Island has many good things. What we have to do now is to take things slowly, step by step, beating all our opponents while observing the situation.</p><br/><p>Hearing Zhou Weiqing’s words, a gentle smile appeared on Shangguan Bing’er’s beautiful face, as she said softly: “My Little Fatty has truly grown up.”</p><br/><p>Zhou Weiqing grinned and leaned his head to her ear, saying: “Heh heh, that’s right, I have grown up… does that mean you will no longer restrict me from being intimate? Don’t worry, I will be very careful, I will not let you have a small Little Fatty, how about that?”</p><br/><p>Shangguan Bing’er giggled as she said: “You… a leopard truly cannot change its spots! You’ve only acted honest for two days, and you’re back to your roguish ways. The Heavenly Jewel Tournament is so important, yet your mind is still so full of dirty thoughts!”</p><br/><p>Zhou Weiqing said smugly: “How am I dirty? I am being very serious here! Anyway, does that mean that… after the Heavenly Jewel Tournament, we can…”</p><br/><p>Shangguan Bing’er flushed a deep red: “Let’s go back quickly, everyone is waiting anxiously for us.”</p><br/><p>When they returned to the inn, Zhou Weiqing explained the situation of their group to the rest of the team. To his surprise, when they heard that they had been allocated to the same group as the Bai Da Empire, none of the team members were sad about it, instead all revealing excited expressions.</p><br/><p>“Awesome! Weiqing, your luck is just too good!” Little Four said with a look of praise on his face. “I have always wanted to teach those Bai Da Bastards a lesson. Weiqing, you have to take care of those teams in front, when we meet the Bai Da Battle Team, we will definitely destroy them! Let me tell you, if we manage to destroy the Bai Da Battle Team in the preliminary stage, even if we do not reach the top four, we will still be heroes when we return home.”</p><br/><p>Drunken Bao rubbed his hands together gleefully: “I can’t wait for that, I almost feel like my wounds are recovering faster. Weiqing, this lot drawing of yours is really great. This will not do. I’m going back to cultivate now, I must recover in time for the Bai Da Battle Team fight.”</p><br/><p>Xiao Yan was not as vocal as the other two, just saying softly: “I have already recovered almost to my seventy percent, even if I have to burn my life force again, I will be able to fight.”</p><br/><p>A cold light also flashed in Lin TianAo’s eyes. “Bai Da Empire. Hmph. Bai Da Empire. Very good.”</p><br/><p>Zhou Weiqing stared at them with a stunned look on his face: “Why are you guys so excited when you hear it’s them? So exaggerated?”</p><br/><p>Drunken Bao said: “Weiqing, you are from the Heavenly Bow Empire. If we meet the Kalise Empire Battle Team, what would you be like?”</p><br/><p>Without hesitation, Zhou Weiqing replied: “Of course, I’ll beat them til their mothers’ cannot recognize them!”</p><br/><p>Drunken Bao grinned and said: “Heh, exactly! It is the same for us, we are mortal enemies with the Bai Da Empire, the hate between our countries is so deep and going way past into our history, it can be said to be almost an ethnic hatred. When we were fighting against the Wan Shou Empire, the Bai Da Empire has caused us so much trouble. I can safely say that all Fei Li Empire citizens hate the Bai Da Empire much more than the Wan Shou Empire.”</p><br/><p>Crow stood up abruptly, walking out. Zhou Weiqing couldn’t help but ask: “Crow, where are you going?”</p><br/><p>Crow said: “Sharpening my axes.”</p><br/><p>Ye Paopao said in a depressed tone: “Come on, all you bosses, you can’t do that! I want to fight as well! Weiqing, why couldn’t your luck extend a little, if only we could fight them in the first round.”</p><br/><p>Zhou Weiqing said exasperatedly: “Damn, it is sure easy to be the temporary leader, I do not even need to upkeep your morale. Look at all your excitement, I do not need to sa anything more, all of you, go and cultivate and train up. Bing’er, come on, let’s go back to our rooms and do what we love doing. [1. Slang for ‘being intimate’, he is just teasing her.]”</p><br/><p>Shangguan Bing’er flushed red again, glaring at him and muttering as she turned and ran off.</p><br/><p>Ever since the entire team had sustained such heavy injuries, they had been rather suppressed, almost depressed. However, now, after the results of the group draw, it had lifted their spirits and lit a fire beneath them. This was something that Zhou Weiqing had not expected.</p><br/><p>…</p><br/><p>A fresh new day.</p><br/><p>The Heavenly Jewel Tournament was finally about to begin. With twenty four battle teams, each round alone was twelve fights, with each group having three fights, and they would all be held in a single day, and the next round would be held three days later.</p><br/><p>As the temporary leader, when Zhou Weiqing led his team out of the inn, he was rather dismal. The reason was simple, he did not even have five main team members gathered; even counting himself there were only four of them.</p><br/><p>After hearing that they had the Bai Da Battle Team in their group, the injured team members threw themselves even crazier into cultivation and recovering; they were certainly full of fighting spirit. According to their draw, they would meet the Bai Da Battle Team in the third round, as such most of them were trying to recover as much as possible in order to be battle ready by that time. As such, they did not even attend today’s fight, going easy on the team today. After all, with just four people, they would be able to go through all five fights; of course, if they had to fight twice it would take a toll on them.</p><br/><p>As compared to yesterday, the Plaza was even more crowded and lively than before. It was still extremely early in the morning, but the Plaza, and its surroundings, was already packed to the core. If not for the fact that the officials had arranged for a dedicated passageway for battle teams, they might even have had trouble entering the competition grounds.</p><br/>\n</div>"}