{"title": "Chapter 103 Heavenly Skill Image, Demonic Dragon Lady! (1)", "id": 103, "volume": 2, "url": "http://boxnovel.org/heavenly-jewel-change-chapter-103-heavenly-skill-image-demonic-dragon-lady-1", "volume_title": "Volume 2", "body": "<h1>Chapter 103 Heavenly Skill Image, Demonic Dragon Lady! (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><b>Chapter 103 Heavenly Skill Image, Demonic Dragon Lady! (1)</b></p><br/><p>As time passed, all the remaining members of the three teams had gathered there, resulting in this massive fight now.</p><br/><p>Of course, they were not the only one in this place. In the corner of the trees, almost all of the Fei Li Battle Team members were hidden. They too had been drawn here by the two signal flares, but just like Zhou Weiqing and Little Witch, they remained hidden in the trees, not wanting to be drawn into such a huge fight.</p><br/><p>Such a huge and grand scene, especially with a large dragon in the background, it was truly the first time for Zhou Weiqing. However, after a short moment of surprise, his attention was drawn.</p><br/><p>What drew his attention was not the dragon egg, nor the ever-intensifying fight in the clearing. It was a pair of eyes. The eyes belonging to the dying dragon...</p><br/><p>What a pair of eyes it was! They did not look at the fight outside, silently looking at the egg in front of itself, using its head to rub gently against it as it licked the traces of blood on it away outside. Gently. Softly.</p><br/><p>Its eyes were so gentle, so touching. Two large tears welled up and rolled down, as if those expressive eyes were speak to the egg. <i>Dear child, mother will not be able to protect you anymore. </i></p><br/><p>Looking at those eyes, feeling the emotions within them… Gentle… love… unwillingness… sorrow… hurt… Zhou Weiqing felt as if his blood was boiling within his body as emotion welled up.</p><br/><p>This was a mother’s true love for her child! At that moment, it was as if he forgot how valuable a dragon could be. In his heart, there was only those eyes… and the love for a child.</p><br/><p>“Little Witch.” Zhou Weiqing said softly.</p><br/><p>“What?” Little Witch was startled by his sudden voice. She had also been staring at the sight in front of them, but she had been focusing on the fight, the various skills and powers of their possible enemies. At the same time, her heart was also palpitating in excitement at the sight of the dragon and its egg, and the possibilities.</p><br/><p>Zhou Weiqing said solemnly: “Can you heal that dragon?”</p><br/><p>Little Witch started. “Weiqing, are you kidding? Heal the dragon? Don’t you know what would happen once the dragon recovers, what kind of result that would be? This is the chance of a lifetime for us! We can wait for them to fight it out, and we can effortlessly reap all the advantages… Don’t you know how valuable that dragon’s body will be, not to mention a dragon egg?”</p><br/><p>A cold light flashed in Zhou Weiqing’s eyes, and he lifted up his right hand. The Demonic Manual that Little Witch had lent him appeared in his hand, and he pushed it into her hands. Giving her a cold look, he didn’t say anything else, stepping with large strides out of the forest into the clearing.</p><br/><p>Little Witch hugged the Demonic Manual, staring blankly at his retreating back. She had clearly seen a hint of disdain in those cold eyes of Zhou Weiqing’s.</p><br/><p><i>He...he… why did he look at me like that?</i></p><br/><p>The next instant, Zhou Weiqing told her the answer with his actions. With a hint of hesitation, Zhou Weiqing strode into the battlefield, the Overlord Bow in his hands. The bowstring moving like lightning, twelve arrows had already shot out, striking out towards the ZhongTian and BaoPo Battle Team members.</p><br/><p>What he used was exactly what Shangguan Bing’er had used previously, the Harassment Archery Style.</p><br/><p>However, his harassment style was slightly different from Shangguan Bing’er’s; his firing rate was slightly slower, but with the Overlord Bow’s explosive effect and the twisting bowstring effect of improving the destructive power; even a five-Jeweled or six-Jeweled Heavenly Jewel Master could not easily ignore his arrows.</p><br/><p>As a series of explosions rang out, the originally retreating WanShou Battle Team members felt the pressure on them lessen considerably, and their status of continuously losing ground finally stabilized.</p><br/><p>“Zhou Weiqing, are you crazy?!” Shangguan Fei’er’s voice rang out, an urgent look on her face.</p><br/><p>The Overlord Bow in Zhou Weiqing’s hands did not stop, the twanging of the bowstring sounding out as a continuous flow of arrows flew out, seemingly always managing to find the trickiest, craftiest angles, greatly changing the flow of the battle.</p><br/><p>“I’m not crazy.”</p><br/><p>Shangguan Fei’er cried out angrily: “You are Bing’er’s fiance, you should be standing by our side! How can you side with the WanShou Battle Team ilk?!”</p><br/><p>Zhou Weiqing said passively: “What ilk? I cannot stand by and watch a newly born child, and a dying mother die in your hands. No matter how bad the WanShou Empire is, how many monstrous deeds they have committed, at least now they are protecting this mother and child. And now, my goal is the same as theirs.”</p><br/><p>As he said that, he did not stop firing, as the stream of arrows continued steadily. Although he was only at the three-Jeweled cultivation level, Mu En’s Twisting Bowstring Archery Skill allowed his arrows to actually play a large part in this fight, forcing the entire battlefield back into a standstill. Although the WanShou Battle Team was still at a slight disadvantage, it was already much better than just a moment ago.</p><br/><p>Hearing Zhou Weiqing’s words, a look of uncertainty flickered with Shangguan Fei’er’s eyes. Turning to look at the dragon, she felt a twinge in her heart, and her eyes changed once again. As for how Zhou Weiqing had looked at her a moment ago, it also left a deep impression in her heart. That resolute determination, the resolve to forge ahead in the path no matter how much the world would hate him for it, forming an aura about him that shook her heart. After all, it could be said that any single person on the battlefield was at a much higher cultivation level than him, but when he stepped onto the battlefield with such a resolve, it felt as if he was the center of the battlefield instead.</p><br/><p>Such a sudden change in heart caused her to pause momentarily in mid fight, her actions slowing. Originally, her Consolidated Claws had caused much damage to the large white ape she was fighting, but now she subconsciously slowed her attacks.</p><br/><p>“Fei Li Battle Team members, follow Weiqing’s lead. Join the fight!” A loud, resonant deep voice rang out suddenly. Under Lin TianAo’s lead, the hidden members of the Fei Li Battle Team made their entrance onto the battlefield.</p><br/><p>Lin TianAo charged forth in the lead, with Crow, Drunken Bao, Xiao Yan, Ye Paopao following close behind. The five of them did not rush into the fight, instead gathering quickly around Zhou Weiqing.</p><br/><p>Earlier, when Zhou Weiqing had suddenly charged out onto the battlefield to join the fight, all the members of the Fei Li Battle Team had been shocked. After a moment of gathering his thoughts, Lin TianAo had also brought the other team members to join in. Although they knew that this might put them in an opposing position with the ZhongTian and BaoPo Battle Team, perhaps even having a detrimental effect on the three Empires whose borders all met with the WanShou Empire’s, and were on the same boat in terms of countering them, they still did not hesitate to join in. After all, how could they possibly stand around and watch Zhou Weiqing fight alone?</p><br/><p>A ray of white light seemed to shoot forth from Zhou Weiqing’s bosom, swiftly growing to form a white figure in the air. In moments, it had turned into a three metre large white tiger. It was Fat Cat!</p><br/><p>Fat Cat’s face was currently filled with tears. She had not tried to ask Zhou Weiqing to do anything, but when Zhou Weiqing had stood out and made the decision to help the dragon mother, the last small barrier in her heart towards Zhou Weiqing had finally broken. No matter what flaws he had, at least he had this kind heart within right? Wasn’t that more than enough?</p><br/><p>Fat Cat did not say anything to Zhou Weiqing, but in her heart, she had already given him more a thousand words. In that moment, she had totally fallen for him through and through, and she knew that from now on, there could be no other man in her life besides him.</p><br/><p>Fat Cat’s appearance and the effect it had on the WanShou Battle Team members was far beyond Zhou Weiqing’s expectations.</p><br/><p>Zhan LingTian was also shocked to the core, exclaiming: “Divine Heavenly Spirit Tiger?!”</p><br/><p>Seeing the huge white tiger was a massive confidence and morale boost to all the WanShou Battle Team members, as if their spirit and vitality had been uplifted. In that instance, even their Heavenly Energy seemed to burst forth with new strength, as if receiving a boost. As for their Heavenly Beasts, it was even more so. Instantly, the tides of battle turned once again, as they steadily drew even with their opponents.</p><br/><p>Nine bouts of gold light shot out from Fat Cat’s body, landing perfectly on Zhou Weiqing and the eight WanShou Battle Team members. They felt their bodies heat up, as if the Heavenly Energy within their body was given a boost; at the same time, their Heavenly Energy usage when using Skills also dropped drastically.</p><br/><p>The Divine Attribute. Amongst the three Great Saint Attributes, it was the one with the greatest support and healing capabilities, with even the powerful resurrection ability!</p><br/><p>After unleashing the powerful support Skill to the eight of them, Fat Cat did not stay and join the fight, instead flying swiftly towards the dragon, the thick gold light still flowing out of her body and enveloping the dying dragon.</p><br/><p>When the dragon saw Fat Cat, its originally dim and lifeless eyes brightened with a ray of hope. However, the hope wasn’t targeted at itself. Instead, it continuously gave a low wuuu wuuu sound towards her, bumping the egg in front of it gently, as if telling Fat Cat to take care of it.</p><br/><p>Fat Cat shook her head towards the dragon, as the gold light of her Divine Attribute burst out brilliantly towards the it.</p><br/><p>The true reason why this dragon had ended up like this was actually because of the egg in front of it. It was much larger than any normal dragon egg, and although she had barely managed to lay it out, this female dragon had also been severely injured internally and also exhausted by that, causing it to lose much blood.</p><br/><p>No matter how strong a dragon was, and how great and tenacious the life force of a dragonkin usually was, this was a mix of serious internal and external injuries, directly draining its life force. Yet, at this time when it was at its weakest, it had been found by the ZhongTian Battle Team members.</p><br/><p>The Divine Attribute was definitely the strongest Attribute at Healing, but there was just too huge a gap between Fat Cat and the Dragon’s cultivation levels. In other words, with her cultivation level, it was impossible for her to save such a huge and powerful dragon, especially one who had sustained such fatal injuries.</p><br/><p>Tian’er’s Heavenly Energy was being drained at an alarmingly rapid rate, but alas, she could still sense that the life force of the dragon was still leaving it slowly.</p><br/><p>“Senior Ye Paopao, do you have any Healing Skills?” Zhou Weiqing asked Ye Paopao urgently as he continued firing arrows. At the same time, he also gave a questioning glance to Drunken Bao.</p><br/><p>He had been together with Tian’er for so long, and they could, to a certain extent, read each other’s minds. Just with the short exchange of glances, he could tell from her eyes that she could not possibly heal the dragon just by herself, not even just to stabilize her wounds.</p><br/><p>Ye Paopao said: “We will do our best.” Although he did not have any Water Attribute Healing Skills, just the Water Attribute Heavenly Energy alone had some healing properties. As long as he circulated it gently in aid, it could at least help replenish the dragon’s body, and lessen the load on Tian’er.</p><br/>\n</div>"}