{"title": "Chapter 114 The power of Little Miss Muddle. (3)", "id": 114, "volume": 2, "url": "http://boxnovel.org/heavenly-jewel-change-chapter-114-the-power-of-little-miss-muddle-3", "volume_title": "Volume 2", "body": "<h1>Chapter 114 The power of Little Miss Muddle. (3)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><b>Chapter 114 The power of Little Miss Muddle. (3)</b></p><br/><p>Zhou Weiqing let loose a breath he had been holding. After recuperating and cultivation for that short while, his energy whirlpools had finally managed to ease away most of the Devoured Heavenly Energy and began spinning relatively normally again. However, this had also given him a severe warning that even the powerful Devour Skill was not invincible, and there was a limit to everything. This was especially so when he was facing multiple enemies or extremely powerful ones, and that restriction could mean his life if he was not careful.</p><br/><p>“Just some minor injuries, I will be fine.” With the bloodline of the Dark Demon God Tiger, his regenerative rate was extremely strong, and his injuries weren’t too serious in the first place, and a few days of rest would be sufficient for him to fully recover.</p><br/><p><span style=\"\">Lin TianAo furrowed his brow tightly before saying: “Bai Da?” </span></p><br/><p><span style=\"\">Zhou Weiqing nodded, then paused before saying coldly: “Maybe.”</span></p><br/><p><span style=\"\">At the side, Little Four said curiously: “Besides them, who else could it be?” </span></p><br/><p><span style=\"\">Lin TianAo sighed and shook his head lightly, but did not say anything further. </span></p><br/><p><span style=\"\">Zhou Weiqing looked at him, his mouth twitched upwards in a cold smile as he said: “You have also thought of the same thing…”</span></p><br/><p><span style=\"\">Lin TianAo nodded solemnly. “Besides that, I cannot think of any reason to explain what happened today. Yun Li has already told me what happened to you in the Fei Li Royal Family Military ACademy. Although I do not want to believe that this is true, but I have no choice but to suspect him. Sigh… He has after all been through life and death with us, and I cannot understand it.”</span></p><br/><p><span style=\"\">Zhou Weiqing shrugged and said: “It is nothing, everyone has their own thoughts and choices. After all, he is the representative of the nobles, and to him, we are all just commoners. More importantly, if he is just thinking for the sake of the Fei Li Empire, his choice is not totally wrong. As for whether or not jealousy has played a part in his decision… that is hard to say. My dear Senior Paopao, perhaps next time we meet, we will no longer be comrades, and will be enemies instead.” </span></p><br/><p><span style=\"\"><span>No matter Zhou Weiqing or Lin TianAo, both of them suspected Ye Paopao. If not for the news that Ye Paopao had brought back and reported, how could the Fei Li Royal Family know so much about how Zhou Weiqing had offended the Blood Red Hell during the Heavenly Jewel Tournament, or the other news about the Passion Valley and Heaven’s Expanse Palace. It was just exactly because of this news about how Zhou Weiqing had helped the Wanshou Battle Team against the Heaven’s Expanse Palace and Passion Valley that had caused the Fei Li Empire to be so unreasonable and exile him from their Empire even after Zhou Weiqing had helped them gain such honour by winning the Championship of the Heavenly Jewel Tournament. [1]</span></span></p><br/><p><span style=\"\">Furthermore, Zhou Weiqing and the rest had just returned, and he had barely entered his own house when he had been attacked. What could that mean? Even if the black clad men really came from the Bai Da Empire, for them to be able to be here at such a time, that could only mean that they had somehow gotten news about his whereabouts… And there weren’t many people who could actually feed them with such news. </span></p><br/><p><span style=\"\">Besides Ye Paopao, there was almost no other good explanation. As for whether or not the black clad men actually came from the Bai Da Empire or were men from the Premier, that was not important any longer. </span></p><br/><p><span style=\"\">Lin TianAo asked Zhou Weiqing: “What do we do now? What are your plans?” </span></p><br/><p><span style=\"\">Zhou Weiqing thought about it for a moment, then said: “We will leave later tonight, at least the Fei Li Royal Family and officials do not have any plans to kill me, and they will not forbid us from leaving. In any case, we will leave in the cover of the night, but I need to wait a while for some of the Seniors graduating from my Academy. Every extra man is an additional strength that is critical for our advancement in the future.”</span></p><br/><p><span style=\"\">As they were speaking, all of a sudden, they were interrupted by an abrupt howl of anger. “Ma Qun! You bastard! You are actually here!!”</span></p><br/><p><span style=\"\">*PENG* A loud but muffled sound rang out, and everyone stared in the direction the sound came from, confused. </span></p><br/><p><span style=\"\">The sight of Ma Qun’s immense body being held by Crow by one hand by the sleeve, pressed against the wall, greeted them. </span></p><br/><p><span style=\"\">In terms of size and figure, Ma Qun was actually larger and stouter than Crow. However, in terms of strength and power, he was far from her. Currently, being shoved against the wall by Crow, he looked helpless, his face the colour of earth, and his expression as if he was about to cry but unable to do so. </span></p><br/><p><span style=\"\">Zhou Weiqing started a moment, shocked. The next instance, a long-missed mischievous grin appeared on his face as he said wickedly: “Crow, wait a minute.” </span></p><br/><p><span style=\"\">Crow turned her head to look at Zhou Weiqing. Towards this young man whose age was even younger than hers, yet whose strength grew at such a rapid pace that he had even eclipsed her, such a terrifying fellow had indeed earned her respect. Furthermore, she had always treated Zhou Weiqing as her valued companion. As such, she loosened her grip momentarily, but did not let Ma Qun down. </span></p><br/><p><span style=\"\">Zhou Weiqing looked at Crow, then at Ma Qun, who cried out in a wail: “Boss, for the sake of our brotherhood, save me please!”</span></p><br/><p><span style=\"\">Zhou Weiqing patted Crow on the back and said: “Crow, don’t tell me that Ma Qun is the fiance who ran away from your marriage?”</span></p><br/><p><span style=\"\">Crow nodded hard, gritting her teeth as she said: “Besides this bastard, who else could it be? Originally, our families had already arranged our marriage, but when he met me, he ran off without telling anyone, with nobody knowing where he disappeared to. It took me a while of searching before finding traces that he was in the Fei Li City. Today, I have finally found this bastard. Ma Qun, speak now, why did you run away? Is it because I’m ugly?” </span></p><br/><p><span style=\"\">Even facing the most powerful enemies, Crow could face them valiantly without changing expressions. However, at this moment, facing this fiance who ran from her, her face was red with anger. </span></p><br/><p><span style=\"\">Facing Crow in such a state, Ma Qun could only stare at her helplessly, not knowing what to say; especially when he looked to everyone else, he realised that no one would stand by his side. Immediately, he could only remain silent dejectedly. </span></p><br/><p><span style=\"\">Dou Dou was beside Zhou Weiqing all this while, and at that moment, she blinked and said: “Teacher said before that one cannot judge beauty from appearance, and the beauty in the heart is the most important. I feel that Sister Crow’s inner heart is very beautiful.”</span></p><br/><p><span style=\"\">Zhou Weiqing glanced at her, secretly thinking to himself: </span><i><span style=\"\">This girl, could it be that Crow bought her a few roast lamb legs on the way back, so she says that?</span></i></p><br/><p><span style=\"\">Once again, Zhou Weiqing patted Crow on the back before pointing at the large room at the side, saying: “Don’t injure him too badly, otherwise he is in your hands. Some things, you will need to vent out. No matter whether or not you two end up together, one has to pay for their mistakes. Go then, you do not need to give me face.” </span></p><br/><p><span style=\"\">Ma Qun looked at Zhou Weiqing with a plaintive, pitiable look, as if wanting to say something. However, when he saw Crow’s teary eyes, he could not say anything. At that moment, he suddenly felt an itch in his ear, and a soft thin voice rang out in his ears almost imperceptibly. Wasn’t that his boss Zhou Weiqing’s voice?</span></p><br/><p><span style=\"\">If it were in the past, Zhou Weiqing would not have cared about Ma Qun; if he didn’t let Crow beat him up until he was half dead, Zhou Weiqing would not have his own anger assuaged. That fellow ran away from his marriage, forcing his own fiancee to search for so long; he was definitely the very definition of ‘Asking for Trouble’. If he did not want to marry someone, he just had to speak out, why run away like that?</span></p><br/><p><span style=\"\"><span>However, just a few moments ago, Ma Qun had stood out in a moment of critical danger, blocking in front of him despite the danger to himself. In that moment, Zhou Weiqing had already treated him as a true brother already. As such, he could not burn the bridge after crossing it[2], and helping him a little was something he had to do. </span></span></p><br/><p><span style=\"\">As such, for this matter between him and Crow, Zhou Weiqing decided to help him just this once. Whatever happens between them in the future, that would be up to them, and he would no longer interfere. </span></p><br/><p><span style=\"\">Ma Qun said with a pitiable look on his face towards Crow: “Let me go first, this is between the two of us husband and wife, don’t let the others look at us as a joke. We can go to the room and talk, and you can do whatever you want with me. I am a man, at least leave me some face in public.” </span></p><br/><p><span style=\"\">These words he said were according to what Zhou Weiqing had just taught him. </span></p><br/><p><span style=\"\">Crow started for a moment, then said angrily: “You still know you are a man? Who is husband and wife with you?!” Although she said that, in the end she still let go of Ma Qun, stomping off huffily into the room. </span></p><br/><p><span style=\"\">Ma Qun looked at Zhou Weiqing, who gave him a significant look. Ma Qun had nothing left to lose, knowing he could not hide any longer, and he gave Zhou Weiqing a hidden thumbs up before following behind Crow. As he passed by Zhou Weiqing, he was quickly given something. </span></p><br/><p><span style=\"\">Zhou Weiqing thought to himself. </span><i><span style=\"\">Brother, I have thought you all I can, you can only pray for yourself now. </span></i></p><br/><p><span style=\"\">The reason why he told Ma Qun to say that earlier was because he knew Crow very well. Although she might seem very bold unrestrained and forthright, in truth she was extremely quick witted and sharp, with an eye for detail. Her art of ‘acting like a pig to eat a tiger’ was almost even better than Zhou Weiqing. To give her own man face was something important to all women, especially for intelligent women like her. After all, they had not truly torn apart their relationship, and were still considered fiance and fiancee. </span></p><br/><p><span style=\"\">Ma Qun followed Crow into the room, before turning to close the door, forcing himself to look as composed as possible. </span></p><br/><p><span style=\"\">Having entered the room first, Crow spun around abruptly, glaring at him with a cold light in her eyes. </span></p><br/><p><span style=\"\">Ma Qun sighed, and this two metre tall young man took a step forward towards Crow before sighing once more and said: “Crow, I know that I have done an irreparable harm to you, and no matter how many times I apologize, it is not enough. There is nothing more to say, take action then. As long as it can let you vent your feelings, I will take it, I have let you down.” As he said that, he crouched down in front of Crow, his arms covering his head in a submissive position as if accepting any hits. </span></p><br/><p><span style=\"\">This was the second step that Zhou Weiqing had taught him before Ma Qun had entered. Facing such an intelligent girl like Crow, any flowery language, tricks or lies would never work, and admitting his own wrong and apologising at the first possible time was the best way to be dealt with leniently. Since Zhou Weiqing’s first step had actually worked so well, Ma Qun’s confidence in him had been boosted. </span></p><br/><p><span style=\"\">Ever since Ma Qun had ran off, it could be said that Crow really hated this fellow. However, when his two metre tall figure was crouching down before her and allowing her to beat and scold him as she wished, her heart softened instead. He was such a huge fellow, and if she really beat him up, how could he face Zhou Weiqing in the future?</span></p><br/><p><span style=\"\">The Gold Crow Tribe members were extremely loyal and steadfast, especially in love too. Once she had been promised in marriage to Ma Qun, she had already considered herself as his, even though they had barely interacted a few times, but such an ingrained core value was not something easily changed. This also caused her to actually think for her man despite her massive anger. </span></p><br/><p><span style=\"\">As such, she held herself back and did not take action in the end, saying angrily: “Ma Qun, speak then, what do you want? If you do not want to marry me, then we will go back to our tribes to clear things up, and we can null the agreement. Hitting you would just dirty my hands.”</span></p><br/><p></p><blockquote><em>Zen: I personally want to beat up Ma Qun! Crow is one of my fav chars!</em></blockquote><br/><p></p><div class=\"footnotes\"><ol><li><span id=\"footnote-1\">Honestly, I had totally forgotten about this portion and originally thought Ye Paopao’s actions had been senseless. However, I just realised that I had been remembering things with a ‘viewer’ perspective, but his other teammates besides Lin TianAo did not actually know about his trade with the Heaven’s Expanse Palace and that they had forgiven him, so I guess Ye Paopao does have some reason after all<i class=\"fa fa-hand-o-left\"></i></span></li><li><span id=\"footnote-2\">Literal translation, basically meaning being ungrateful and leaving one's benefactor in the lurch<i class=\"fa fa-hand-o-left\"></i></span></li></ol></div><br/>\n</div>"}