{"title": "Chapter 163 Rob the Entire Legion! (2)", "id": 163, "volume": 2, "url": "http://boxnovel.org/heavenly-jewel-change-chapter-163-rob-the-entire-legion-2", "volume_title": "Volume 2", "body": "<h1>Chapter 163 Rob the Entire Legion! (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><b>Chapter 163 Rob the Entire Legion! (2)</b></p><br/><p>The feeling was just too miraculous; just as if he was standing on top of a tornado, and the tornado was like a platform carrying them in the air at an unbelievable speed, as they streaked across the skies like a meteor.</p><br/><p>“Master, is it every powerhouse at your level can fly…?” Zhou Weiqing did not even attempt to hide his admiration and envy. After all, he too had the Wind Attribute!</p><br/><p>Long Shiya said: “Well the premise is that one has to have the Wind Attribute first, and in fact, one does not even need to reach my level. As long as you break through to the Heavenly King Stage and the Heavenly Dao Energy, you will be able to fly. Each of the four great stages of Heavenly Energy has a huge jump in quality. From Heavenly Jing to Heavenly Shen Energy, that is from a stage that converts spirit to qi, to a stage that converts qi to form, with Heavenly Energy now able to have form. As for the Heavenly Shen to Heavenly Xu Energy, it now brings Heavenly Energy from a stage with form back to another type of formless stage. However, the difference in this formless stage is that one’s control over Heavenly Energy is high enough to control it out of the body. This is also the reason why when Heavenly Jewel Masters reach the six-Jeweled stage or higher, their sustainability in fights is greatly increased. This is also the reason why for my Six Ultimate Skill Manipulation Arts to start showing its power, the Heavenly Xu Energy is the lowest basis, being able to directly control energy within the atmosphere for your own use.”</p><br/><p>“... As for the difference between the Heavenly Xu and Heavenly Dao Energy, it is definitely the greatest gap amongst all the four main stages. Heavenly Xu is control, and Heavenly Dao is merging or fusing. When one reaches the Heavenly Dao Energy Stage, then I am one with the heavens and earths, truly part of the environment… Simply put - if a Heavenly Jewel Master with the Wind Attribute wants to fly, it is possible to do so just with Skills alone. Well, at least for a short period of time, but it will not be possible for sustained flight. That is because they are only barely able to control the Wind Attribute Energy within their body or slightly around their surroundings. However, when it comes to Heavenly Dao Energy, it is different. I would be one with the Wind, merged with the Wind… how much expenditure can there be then? As such… if you really want to truly fly, the Heavenly King Stage is your basic requirement…”</p><br/><p>Hearing this short but succinct analysis from his Master, Zhou Weiqing felt as if enlightenment had dawned upon him. He knew that his Master was guiding him in advance towards the path of the Heavenly Xu and Heavenly Dao Energy levels, letting him know about their various profound secrets in advance. As long as he could break through the Six-Jeweled stage this time, then he would reach the Heavenly Xu Energy stage!</p><br/><p>In order to save time, Long Shiya used his powerful Heavenly Emperor stage powers to directly fly Zhou Weiqing high above the northern borders and deeper into the WanShou Empire. A Heavenly King Stage powerhouse would not dare do such a thing, and even ordinary Heavenly Emperor stage powerhouses would have to consider the existence of the Heavenly Snow Mountain Lord and would hesitate in doing so as well. However, Long Shiya did not fear it at all, and just flew along with Zhou Weiqing in tow.</p><br/><p>…</p><br/><p>Just as the Master and Disciple duo were rushing towards the Fire Spirit Mountain, a guest had arrived at the Peerless Battalion headquarters. It was the Seventh Legion Legion Commander, Shen Ji.</p><br/><p>“I’m sorry, Battalion Commander Zhou is not with us currently…” In the main command tent, Shen Ji met with the temporary Battalion Commander Hua Feng. When he heard news about Zhou Weiqing not being with the Peerless Battalion currently, he was greatly disappointed.</p><br/><p>With Shen Ji’s status and rank of Legion Commander, normally he just needed to send for Zhou Weiqing. However, he had come down personally to look for him, in order to get on his good side.</p><br/><p>The scouts had returned to report in detail about the large numbers of Swift Wolf Cavalry and Unicorn Cavalry deaths. With that, Shen Ji had finally realised the power of the Peerless Battalion.</p><br/><p>The war was about to begin, and it could be said that the WanShou Empire had placed a hitherto unseen importance on the Northwest front, and had gathered an unbelievable force many times stronger than in the past. The Northwest Army had requested for reinforcements, and they now numbered more than seven hundred thousand strong. Even so, the command headquarters had a very bleak view about the outcome of this fight. However, they still did not want to retreat to the TianBei City. That would have to be an option of the last resort; otherwise they would be universally condemned by the public, and the Empire. This was a fight they could not avoid.</p><br/><p>Under such a circumstance, if the Seventh Legion could have an additional five thousand elite archers aiding them, it would definitely be a great aid to them. However, even though the Peerless Battalion was technically under his command, he did not actually have control over them. That was the reason why he had made the trip all the way down here personally.</p><br/><p>“If Legion Commander Shen Ji has anything to discuss regarding the Peerless Battalion, you can discuss it with me, I have been authorized to make any decisions during his absence…” Hua Feng said elegantly. Although he was fully dressed in military armour, he still looked more like a gentleman or a noble than a soldier.</p><br/><p>Shen Ji said: “The main war is on the verge of breaking out at any moment, and the WanShou Empire vanguard has already entered our borders. Will the Peerless Battalion be joining our Seventh Legion ranks to fight together with us against our enemies?”</p><br/><p>With a serious look on his face, Hua Feng replied: “Of course, the Peerless Battalion are also northern warriors who will do their part against enemy attacks. How could we not join the fight…”</p><br/><p>Shen Ji did not relax just because of Hua Feng’s words. The reason for that was simple - what Hua Feng had mentioned was that the Peerless Battalion was a part of the northern warriors, and not that they were a part of the Northwest Army Command or even his Seventh Legion. Shen Ji was already a wily old hand in the army, and he quickly noticed such a play on words.</p><br/><p>“In that case, does Battalion Commander Hua Feng require anything that our Seventh Legion can provide?” Shen Ji asked impassively, not batting an eyelid.</p><br/><p>Hua Feng smiled faintly and said: “Indeed, we do have two requirements. First of all, I hope that once the war is over, any enemies that have been killed by our Peerless Battalion, we will get the promised gold reward.”</p><br/><p>Without hesitation, Shen Ji said: “That is no problem, and it is also a promise from the higher command, definitely not something that we will go back on our word on…” At this point, he agreed extremely quickly, but in the near future he would learn why Hua Feng would specially emphasize this point.</p><br/><p>Hua Feng maintained the graceful, elegant smile on his face as he continued speaking: “Secondly, I’m sure that Legion Commander Shen Ji already knows that our Peerless Battalion soldiers are all archers. In the battlefield, archers can definitely output a lot of damage, but at the same time they are extremely fragile. Once we give our enemies sufficient damage and casualties, the enemy archers and cavalry soldiers will undoubtedly target us. As such, I hope that Legion Commander Shen Ji can specially dispatch troops to protect us and ensure our safety. In this way, we will be able to continue going all out in offense on the battlefield.”</p><br/><p>The two requests that Hua Feng had brought up did seem to be extremely reasonable, and Shen Ji gave a slight, unnoticeable sigh of relief before smiling and saying: “No problem, those requests are reasonable and are as should be. I will dispatch a few Battalions to specially protect the Peerless Battalion.”</p><br/><p>“No, no, not just a few Battalions, but an entire Regiment… only then will that be sufficient. Furthermore, I require it to be a Heavy Infantry Regiment. Not only that, the Heavy Infantry soldiers must be equipped with tower shields.” Hua Feng smiled faintly as he said calmly.</p><br/><p>Upon hearing his words, Shen Ji couldn’t help but furrow his brow, saying: “Battalion Commander Hua Feng, I’m afraid that will be impossible. You must know how powerful those various WanShou Empire cavalry soldiers are. Our Seventh Legion only has one Heavy Infantry Regiment, and they are of utmost importance in our tactics against the enemy’s cavalry, the bedrock for us in the battlefield. Using them just for the sole purpose of protecting and providing cover for the Peerless Battalion, that is truly too much of a waste. If I do so, not only will I be unable to answer to my superiors in the main command, I will not be able to answer to my own Seventh Legion soldiers and the Heavy Infantry Regiment themselves. In terms of the Peerless Battalion’s cover and defense, I don’t think such a degree of power is required right?”</p><br/><p>Hua Feng said passively: “Legion Commander Shen Ji, with such words… aren’t you looking down on our Peerless Battalion? I can honestly tell the Legion Commander that as long as you let our Peerless Battalion enter the battlefield, we will instantly draw all attention from the WanShou Empire. If Legion Commander Shen Ji does not agree to my terms, then we will not risk it and enter the battlefield. After all, each and every one of our Peerless Battalion warriors are elites that our Battalion Commander Zhou has spent an enormous amount of time and painstaking effort to train and gear up.”</p><br/><p>Shen Ji’s expression grew uglier as he heard Hua Feng’s words. A mere temporary Battalion Commander, and this fellow actually dared to threaten him? In all his years of being in the army, this was the first time.</p><br/><p>“Battalion Commander Hua Feng, please remember that this is the Northwest Army Command. I respect Battalion Commander Zhou, but this is the Seventh Legion and I am the Legion Commander of the Seventh Legion.”</p><br/><p>Hua Feng laughed heartily and said: “So what? Legion Commander Shen Ji, how about this, before the war actually starts, shall we have a little bet first?”</p><br/><p>“Bet?” Shen Ji started in surprise at that sudden suggestion.</p><br/><p>Hua Feng nodded and continued: “Very simple. You can send for that Heavy Infantry Regiment to come here and have a fight with our Peerless Battalion. We will not use our bows… five thousand of us versus ten thousand of them. Close combat brawling.”</p><br/><p>“Ahh?” Shen Ji stared at Hua Feng, his jaw agape with surprise. In his heart, he could not help but think: <i>Is this temporary Battalion Commander crazy? Has water leaked into his brain? Using archers to fight in close combat with Heavy Infantry soldiers, and with a numbers disadvantage? Isn’t that tantamount to suicide?</i></p><br/><p>It was as if Hua Feng did not even notice the surprise and shock on Shen Ji’s face, and he continued speaking calmly: “When both sides are fighting, they will not be allowed to use any weapons, but they can still wear their armour. In that way, we can ensure safety and prevent any accidental serious injuries.”</p><br/><p>Shen Ji looked at Hua Feng. All of a sudden, he had the strange sensation that he was being led along by the nose. Yet, if anyone were to ask him he thought the Peerless Battalion could defeat a Heavy Infantry Regiment in close combat, he could not believe it at all.</p><br/><p>“What are the terms of the bet?” Shen Ji asked solemnly.</p><br/><p>Hua Feng smiled faintly and said: “Very simple. If we win, I would like Legion Commander Shen Ji to do as promised… to have this Heavy Infantry Regiment to be fully in charge of our Battalion’s defense… just defense alone. I would request two Heavy Infantry soldiers to use their tower shields to protect each and every one of our Peerless Battalion warriors. On the other hand, if we lose, then in this year’s war against the WanShou Empire armies, Legion Commander Shen Ji can command us as you see fit, and we will follow suit without any noise. On top of that, we will also pay two hundred thousand gold coins as an apology to the Heavy Infantry Regiment for looking down on them. How does that proposal sound?”</p><br/><p>Since Hua Feng had already said it, Shen Ji truly had no reason to reject it. Although he did not know why Hua Feng was so confident, or what basis he had for such confidence, if he did not agree to this, and the Heavy Infantry Regiment knew about him doing so, it would cause a lot of trouble. Archers challenging Heavy Infantry to close combat, and yet the Heavy Infantry were too cowardly to accept the challenge? That would be the ‘news’ indeed.</p><br/><p>The army was perhaps different from others. Here, honour and face was equal to, or even greater than one’s life. Especially in terms of splendid military accomplishments and accolades, it was even more so.</p><br/><p>“Very well, I agree. Time is of the essence… shall we set the time of the fight to be tomorrow noon then.”</p><br/><p>“It’s a promise then.”</p><br/><p>Hua Feng and Shen Ji’s bet swiftly spread across the entire Seventh Legion, even the entire Northwest Army. After all, such a bet and its terms were just beyond any logic or reason to any other person. Using archers to fight in close quarters combat with Heavy Armoured Infantry Units? Countless of people who heard about the bet definitely thought that Hua Feng was truly retarded.</p><br/><p>Towards the Peerless Battalion, amongst the Seventh Legion, only the Sixteenth Regiment had some experience with them. As for the other Regiments of the Seventh Legion, they had only heard rumours about them. Of course, they had also received strict orders not to clash with the Peerless Battalion.</p><br/><p>The war with the WanShou Empire was just about to start, and it was a rare chance to have such an entertainment to watch. As a result, the entire Northwest Army bustled with excitement.</p><br/>\n</div>"}