{"title": "Chapter 176 Heavenly Emperor Beasts! (2)", "id": 176, "volume": 2, "url": "http://boxnovel.org/heavenly-jewel-change-chapter-176-heavenly-emperor-beasts-2", "volume_title": "Volume 2", "body": "<h1>Chapter 176 Heavenly Emperor Beasts! (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><b>Chapter 176 Heavenly Emperor Beasts! (2)</b></p><br/><p>However, one hour passed, and when the two youths stood up once more, Gu Yingbing was surprised to see that Zhou Weiqing looked refreshed and rejuvenated, as if he was back in tip top condition. How could he not be surprised?</p><br/><p>Xue AoTian looked at the two of them and said in a serious tone: “Next, you will both be facing Heavenly Emperor stage Heavenly Beasts. I do not need to remind you too much, for Heavenly Beasts to reach the Heavenly Emperor stage, it is without question that they also have extremely high quality bloodlines. As such, your advantage of bloodline will not be that obvious, and you may even run the risk of being counter-injured.”</p><br/><p>Zhou Weiqing and Gu Yingbing’s faces turned serious. Overwhelming a Heavenly Emperor stage Heavenly Beast. They had never even dreamed of doing it at their current levels, let alone trying it out, and they did not know whether or not they could succeed.</p><br/><p>*Boom* *Boom* *Boom*</p><br/><p>A low, rumbling thunder shook the entire cave as it rang out. The Heavenly Beasts that they would face had not even appeared, but a terrifying and oppressive presence could already be felt.</p><br/><p>The expressions of both Zhou Weiqing and Gu Yingbing instantly changed. In their hearts, they suddenly had the strange misconception - Who was the one doing the overwhelming?! The two Heavenly Emperor stage Beasts had not even appeared, and they were already barely able to hold on. Such a level of power, was it really possible for them to succeed? Wasn’t that just a fantastical dream?</p><br/><p>Even if it were a lowest level Heavenly Emperor Stage Beast, it was still the difference of heaven and earth compared to a max level Heavenly King Stage Beast!</p><br/><p>The two youths were not the only ones whose expressions changed. Long Shiya, the Tiger King and Lion King also looked serious. With their cultivation level, they could easily sense the sheer power of the two incoming Heavenly Beasts - not Low Level Heavenly Emperor Stage, but at the Mid Level Heavenly Emperor Stage! Besides Xue AoTian, only Long Shiya actually had any confidence that they could overwhelm Beasts of such a level with only their aura and presence.</p><br/><p>Soon, two unbelievably immense figures appeared in their sights, so massive that it was almost terrifying. This cavern was extremely huge and spacious, but as soon as the two Heavenly Beasts appeared, it was as if the cavern had suddenly become too tiny.</p><br/><p>Both Beasts were more than ten metres tall, fifteen metres in length, their bodies covered with long white fur with huge tusks protruding out like two terrifying lumbering mountains of doom.</p><br/><p>Mammoths! These were Mammoth - Type Heavenly Beasts!</p><br/><p>Mammoth Type Heavenly Beasts were extremely talented, their bloodlines ensuring they could reach at least Upper Level Zong Stage or higher. These two were magnificent species amongst their kind, obviously with their Heavenly Emperor Stage, and they were Lords and Leaders amongst all Mammoth type Beasts.</p><br/><p>Long Shiya muttered: “Snow Lord Mammoths. These huge fellows. Old Monster Xue, you are already bringing these out on the eighth round? How can they possibly succeed in overwhelming them? Do you think they have already reached our level?”</p><br/><p>Xue AoTian glanced at Long Shiya before saying passively: “From this round onwards, the test is reversed. Yingbing, you and Zhou Weiqing will have to withstand the oppressive pressure of these Snow Lord Mammoths for 5 minutes. If anyone fails in that time, you will have lost the round. If both of you can withstand the pressure, then we will go on to the ninth round…”</p><br/><p>“Yes, Master.” Gu Yingbing said respectfully. He couldn’t help but heave a huge sigh of relief in his heart. At least it was not an impossible task. Withstanding pressure and attempting to overwhelm these Heavenly Beasts was a hugely different task.</p><br/><p>By this time, the two massive mammoths had already lumbered to the front of Zhou Weiqing and Gu Yingbing respectively. If one thought their presence was terrifying just now, the addition of their massive bodies in front of them brought some strange new pressure!</p><br/><p>Snow Lord Mammoths. These monstrous beasts had the Ice, Earth and Wind Attributes, and their innate talent was to berserk. In the entire Ten Thousand Beast Heavens, they were highly ranked and respected. In the WanShou Empire, there was a Legion of controlled Heavenly Beasts controlled only by the Heavenly Snow Mountain. It was also one of the main reasons why the other four Great Saint Lands feared them so much. The Legion Commander of that Legion had a Snow Lord Mammoth mount, and one could imagine how powerful it was for such a high ranked powerhouse.</p><br/><p>They were able to control winds and snows, trample across the earth in stampedes. They were considered a rare breed that were equally power in both offense and defense.</p><br/><p>Such powerful Heavenly Beasts, even Long Shiya would have a bit of trouble in defeating them. For Zhou Weiqing and Gu Yingbing, it was definitely impossible for them stand against them. The Snow Lord Mammoths might not seem to have any scales or armour, but their pure white fur was actually deceptively tough, one of the strongest defenses. Even a full powered attack from a Max Level Heavenly King Stage powerhouse might not be able to cause any damage to them. Of course, one had to consider that these powerful Heavenly Beasts were under full control of Xue AoTian, and from that alone one could tell how powerful this Heavenly God Tier powerhouse was.</p><br/><p>The Lion King Gu Site’s somber eyes were suddenly filled with a burning heat. Even he had not expected that the Heavenly Snow Mountain held so much power. If… his son could control the Heavenly Snow Mountain in the future… perhaps… they would be able to sweep over the entire mainland!</p><br/><p>*ROARR* Almost at the same time, two resounding roars rang out from the two Snow Lord Mammoths, their long trunks raised up in the air. Instantly, a powerful layer of green-blue light sprang forth from their bodies, enveloping Zhou Weiqing and Gu Yingbing’s bodies respectively.</p><br/><p>In the next instant, Zhou Weiqing felt as if he was trapped in a world of ice and snow. The surrounding air plummeted to absolute zero, the frigid temperatures buffeting him along with the cruel pressure of the Mammoth’s terrifying aura, feeling like uncountable sharp ice shards slicing all over his body. A massive spiritual pressure descended upon him like a huge mountain from the skies, smashing down over his head.</p><br/><p>Zhou Weiqing gave a muffled grunt as he staggered back subconsciously. Even under the Demonic Change State, he was almost unable to withstand this terrifying pressure.</p><br/><p>On the other side, Gu Yingbing was in a much better state than Zhou Weiqing. After all, his cultivation level was at the nine-Jeweled stage, much higher than Zhou Weiqing. He had not staggered back, holding his ground, though his expression had turned very ugly and his body was trembling slightly. The golden-red light around him was so thick that it was as if an actual solid burning shroud was around him, as the thick Heavenly Energy reverberations around him denoted his channeling of his spirit to the maximum.</p><br/><p>Alas for these poor two young souls, both Zhou Weiqing and Gu Yingbing had just been foolish enough to be relieved and think that withstanding the pressure would be easier than overwhelming. Now, they knew what a joke their previous thoughts had been just an instant ago. Facing a Heavenly Emperor stage was never a trifling task.</p><br/><p>Having reached the Mid Level Heavenly Emperor stage, as soon as the Snow Lord Mammoths’ powerful aura smashed down upon them, they realised it was far more difficult than when they were trying previously to overwhelm the Max Level Heavenly King Stage Beasts!</p><br/><p>Furthermore, this pressure was now reverse. That was to say, they definitely had to hold on the best they could, otherwise failure would also lead to serious injury. More importantly… that already-terrifying pressure was still increasing slowly!</p><br/><p>The terrifying pressure was crushing down upon both Zhou Weiqing and Gu Yingbing, draining their energy at a crazy rate. When Zhou Weiqing staggered back a step, he felt as if he could no longer hold on. However, after moving back one more step, he finally stopped staggering back just like that. Although he was still having trouble holding on, at least he had finally stabilized himself and not lost just immediately.</p><br/><p>At this moment, even the Tiger King Xue Aoying couldn’t help but reveal a hint of admiration on his face. For a six-Jeweled Heavenly Jewel Master, even with the aid of the Demonic Change State, to be able to withstand a Mid Level Heavenly Emperor Stage Heavenly Beast for so long, it was already unbelievably astonishing. He could imagine that any other six-Jeweled Heavenly Jewel Master would have already imploded internally from facing such pressure. After all, the gap in cultivation level was just too huge.</p><br/><p>*Haaahhh* Gu Yingbing yelled softly in exertion as his arms raised up abruptly, palms facing upwards. The next moment, the golden-red light around his body actually turned pure golden, as if flames rising into the air.</p><br/><p>Divine Flames. This was not any Skill, but the pure merger of Heavenly Energy of the Divine and Fire Attribute merging together fully. This was also one of the ultimate secrets of the Heavenly Snow Mountain that was never to be passed outside. With the sheer power of the Divine Flames, Gu Yingbing finally managed to hold his ground, but his Heavenly Energy expenditure was now several times his original.</p><br/><p>Gu Yingbing finally had a moment of respite to turn to look at Zhou Weiqing. In his mind, Zhou Weiqing could not possibly hold on for five minutes. Although the Divine Flames was a huge drain on himself, he was confident of at least holding on for that long, and without question that would put him as the ultimate victor.</p><br/><p>However, a shocking sight followed next. Just as everyone thought the swaying body of Zhou Weiqing would fall, abruptly a tearing sound rang out, and the back of Zhou Weiqing’s shirt ripped apart in a burst. A pair of huge wings sprang forth from his back without warning.</p><br/><p>The black grey wings were like an artifact calming the seas. When they appeared, the massive amounts of various energies suddenly started surging crazily towards Zhou Weiqing. At the same time, it was as if Zhou Weiqing’s bloodline aura abruptly raised up to an even higher state. Although his cultivation level was still the same, the gap between them still like an unbreachable chasm, his bloodline aura was suddenly at a massive advantage against the Snow Lord Mammoths!</p><br/><p>Using bloodline alone to suppress a Heavenly Emperor Stage Snow Lord Mammoth of noble blood!??</p><br/><p>Both the Tiger King and Lion King widened their eyes. This time, as Xue AoTian saw the wings spreading out from Zhou Weiqing’s back, even he was not able to maintain his impassive expression.</p><br/><p>Paired wings that could actually upgrade one’s bloodline?! What the h*** was going on?!</p><br/><p>In that instant, Xue AoTian suddenly realised that he had severely underestimated that ancient tiger bloodline of Zhou Weiqing’s. He had previously thought he had already judged it very highly, but it appeared it wasn’t as simple as he thought… perhaps… it was even at a far higher level than his own bloodline… a nobler and higher grade than even the Divine Heavenly Spirit Tigers!</p><br/><p>As soon as the wings burst forth from Zhou Weiqing’s back, shock filled the eyes of Snow Lord Mammoth in front of him. Abruptly, the pressure on Zhou Weiqing almost halved, and in the short instantaneous respite, Zhou Weiqing had actually taken a huge step forward, regaining the footing lost previously.</p><br/><p>Black and grey light swirled around him as if burning into the air. It was a mix of his Darkness and Demonic Attributes.</p><br/><p>The Divine Attribute and Demonic Attribute were both Saint Attributes, and it was hard to compare which was stronger than the other. However, if one compared Darkness and Fire Attribute, there was an obvious difference. Zhou Weiqing had somehow managed to just use his Demonic Change State to somehow merge his Darkness and Demonic Attributes, fusing them perfectly like the Divine Flames of the Heavenly Snow Mountain. All this without any secret arts! This was the advantage of his bloodline power!</p><br/><p>The Dark Demon God Tiger was originally of the Darkness, Demonic and Lightning Attributes, and had full control over all these Attributes, able to merge them easily. As such, under the Demonic Change State, instinctively having them fuse together was not that difficult a task.</p><br/>\n</div>"}