{"title": "Chapter 185 If you lose, marry me! (1)", "id": 185, "volume": 2, "url": "http://boxnovel.org/heavenly-jewel-change-chapter-185-if-you-lose-marry-me-1", "volume_title": "Volume 2", "body": "<h1>Chapter 185 If you lose, marry me! (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><b>Chapter 185 If you lose, marry me! (1)</b></p><br/><p>Anyone else might fail to recognize such a rare Heavenly Beast like the Demonic Dragon Lady, but how could Shangguan Xue’er not? Firstly, the Demonic Dragon Lady was from the Heaven’s Expanse Palace, and as the heir to the Heaven’s Expanse Palace, her knowledge was definitely extensive and well informed indeed.</p><br/><p>Sensing the presence and aura of the Demonic Dragon Lady, Shangguan Xue’er furrowed her brow, but her eyes still remained closed. In the midst of the terrifying explosion, the flurry of sword thread attacks were swallowed by the burst. The sword intent was the soul of swordsmanship, but even so, against such a vast number of explosions, she could not just force her way forward, otherwise, even before she could strike Zhou Weiqing, her body would have been blown back by the explosive impact.</p><br/><p>As she retreated from the explosion, though Shangguan Xue’er seemed like she had been in the advantage in this clash, she was clear that if she was not careful, this might lead to a massive disadvantage for herself. After all, without any Stored Skills, when she faced any top tier Skills, she did not have any Skills with Heavenly Skill Images of her own to cancel out her opponent’s. This was also the reason why Shangguan Tianyang and Shangguan Tianyue had originally been so against her method of cultivation. However, after so many years of being immersed in her path, Shangguan Xue’er had come up with her own ways of dealing with such situations. This was not the first time she had faced such a situation after all. She was extremely clear that if she allowed Zhou Weiqing to unleash his Dragon Silencing Seal on her, she would lose her Boundless Infinitum Set, and her combat strength would fall drastically. In that case, she would no longer be a match for Zhou Weiqing with his Six Ultimate Godly Light Formation. Just in terms of recovery rate alone, Zhou Weiqing would be able to wear her down and defeat her.</p><br/><p>As such, in that short moment, Shangguan Xue’er had already made her judgement and plan. In the midst of flying back, her entire body glowed in a sudden brilliance as all the Consolidated pieces of the Boundless Infinitum Set lit up.</p><br/><p>It was not the usual dark-gold colour, but a snow white light that was akin to that of the Boundless Infinitum Sword in her hands. That was the colour that the Boundless Infinitum Set would take after completion of all pieces! Yet, being able to do so before the actual completion… even the Heaven’s Expanse Palace Master Shangguan Tianyang had not been able to do such a thing! In all the generations of heirs to the Heaven’s Expanse Palace, Shangguan Xue’er had been the first to accomplish this feat. The reason was simple - purity and extreme.</p><br/><p>It was exactly because Shangguan Xue’er had put everything into her sword, all her focus, power and life into her sword, that was the reason why the Boundless Infinitum Sword was able to glow with such a colour, not the dark-gold light. It was that stubborn resolution in taking her own path that had allowed her to gain the approval and support of the Boundless Infinitum Set, a perfect confirmation that surpassed any of her predecessors. As such, when she burst out with a full strength without holding anything back, Shangguan Xue’er was able to temporarily cause her Boundless Infinitum Set to flash with the light of completion.</p><br/><p>Of course, this was not just a matter of the changing of colours. It was this exact change that allowed her, for the short moment, to use some of the Skills that could only be used when the Boundless Infinitum Set was completed.</p><br/><p>The massive gemstone at her chestplate lit up in resplendent white, just like a heart of ice, glowing brilliantly in all its splendour. In that very instant, the closed eyes of Shangguan Xue’er suddenly snapped open. Her eyes were actually glowing with the colour of ice and snow, her entire person seeming like a Goddess of Ice descending from the heavens. The white light did not represent the power of ice or snow, nor was it just Heavenly Energy… It was the Ultimate Secret Technique of the geerations of heirs of the Heaven’s Expanse Palace - the Ice Heart Arts of the Boundless Infinitum Technique.</p><br/><p>For Shangguan Tianyang, it was only after he broke through the Heavenly King Stage that he returned to his original expressions and looks; as for Shangguan Xue’er currently, her cold outlook and disposition was a large portion due to this secret heavenly technique.</p><br/><p>At this moment, she was wielding the Boundless Infinitum Technique - Ice Heart Arts to the maximum, along with the Boundless Infinitum Set. This was her strongest possible state that she could push herself to.</p><br/><p>The piercing white light burst forth from her eyes and the gemstone at her chestplate, almost simultaneously. In that instant, Shangguan Xue’er’s body disappeared, and all Zhou Weiqing could see was massive Boundless Infinitum Sword, almost ten times magnified. All the white light was drawn in by that massive sword, and it struck out almost as Zhou Weiqing finished his Dragon Silencing Seal.</p><br/><p>The terrifying white sword flew towards Zhou Weiqing, and he could sense that it was fully locked onto him. Even if he used his Blink Skill, he would not be able to dodge it. At the same time, he also sensed that he would not be able to block this blow.</p><br/><p>This was truly power to the extreme! When Zhou Weiqing’s cultivation level had reached the six-Jeweled stage, and he had successfully retrieved Tian’er from the Heavenly Snow Mountain, his confidence level had been boosted greatly. He had felt he was invincible against any Heavenly Jewel Master below the nine-Jeweled stage. Now, he realised how wrong he had been; he had underestimated the powerhouses of the world. This extreme sword of Shangguan Xue’er, in terms of overall power, he truly could not match it.</p><br/><p><em>Is she going to kill me?</em></p><br/><p>Facing such an ultimate extreme power, even his Six Ultimate Godly Light Formation had limited use. If Zhou Weiqing was at the same cultivation level as Shangguan Xue’er, with one more piece of his ‘Hate Ground no Handle’ Legendary Set, further doubling his already considerable strength, perhaps he would have a good chance. However, the current situation was without a doubt highly disadvantageous to him.</p><br/><p>Zhou Weiqing had faced death many times, been in so many tight spots. Under those conditions, he had always been able to reach deep into his potential and subconsciously react in the best possible way. Even if the best possible way did not allow him to beat his enemy, at least it could give him a chance of survival or minimize damage to himself.</p><br/><p>The six-coloured light below his feet dissipated. Facing Shangguan Xue’er’s strongest attack, Zhou Weiqing had actually dismissed his Six Ultimate Godly Light Formation!</p><br/><p>What was he trying to do? If there had been anyone else watching on the sidelines, they would have thought this fellow had gone crazy. Was he trying to commit suicide?</p><br/><p>However, Zhou Weiqing did not think the same in his heart. What he was doing was to meet extremes with extremes, facing the extreme minimalism with extreme maximalism! You do not use any Stored Skills and focus all your power on your sword? Very well, I shall use my crazy amounts of Skills to face your Zero amount of Skills!</p><br/><p>Without the Six Ultimate Godly Light Formation, Zhou Weiqing’s Heavenly Energy regeneration rate dropped drastically. However, at the same time, he became like a projection machine that fired out Skills at an unbelievable rate. No matter what, he had after all already reached the six-Jeweled stage, and his Heavenly Energy was already at the Heavenly Xu stage, and even when using Stored Skills, he was able to sustain himself for quite a long time.</p><br/><p>A flash of green light, and the Fetters of Wind landed upon the huge snow-white Boundless Infinitum Sword. Zhou Weiqing had lifted up his left hand, where the six Alexandrite Cat’s Eye Elemental Jewels were spinning about crazily.</p><br/><p>All of this happened in just a matter of moments. As Shangguan Xue’er flew back and opened her eyes, Zhou Weiqing had already dispelled his own Six Ultimate Godly Light Formation and Dragon Silencing Seal. As she turned into the giant sword and started moving, the Fetters of Wind already landed on it.</p><br/><p>Even with Zhou Weiqing’s current power levels, the Fetters of Wind only managed to cause the giant sword to tremble slightly, not even slowing its speed. That was even after it had been unleashed through his Consolidated Dual Legendary Hammers boosting it, as well as in the Dragon-Tiger Transformation State.</p><br/><p>Despite the seemingly uselessness of the Fetters of Wind, Zhou Weiqing did not seem to care. His Dual Legendary Hammers glowed brightly as Skill after Skill launched without a pause.</p><br/><p>Close behind the Fetters of Wind was a Touch of Darkness, ten thick tentacles forming a web to block the giant sword under Zhou Weiqing’s control. However, within moments, they were broken apart into many tiny pieces. Even so, there was some effect as the giant sword continued trembling harder due to it.</p><br/><p>As he threw out his Skills, Zhou Weiqing’s entire body flew back in a retreat. This was open ground, and there were no obstacles. With the wings behind his back beating strongly, he retreated at an amazingly quick pace. Of course, his speed was no match for that of the incoming giant sword, but at least it could buy him more time.</p><br/><p>The next Skill after the Touch of Darkness was another Control Skill, the Spatial Shackles. As compared to the first two Skills, the defensive capabilities of this Spatial Shackles was much higher, and as such, it was actually able to have a noticeable slowing effect on the giant sword.</p><br/><p>At the same time, the ‘crying-face’ hammer in Zhou Weiqing’s right hand was suddenly flung out, and he instantly cut off his connection to it. This way, even if the hammer was destroyed, it would not affect him. Around the hammer, four glows of light shimmered, clearly four Skills had been imbued within.</p><br/><p>Even though Zhou Weiqing was currently unable to fuse or merge the Skills together, this was one major benefit of God Tier Consolidated Equipment. Even without Sockets, it could be imbued with several Skills, to be unleashed at once, or even one after the other. Even without a fusion effect, having a bunch of Skills activating nearly simultaneously - there was a certain stacking or supporting effect between them.</p><br/><p>The Boundless Infinitum Sword and the ‘crying-face’ Hammer slammed into each other. In the next instant, the hammer was swallowed up… or perhaps more accurately, it was quickly dismissed by Zhou Weiqing after impact. As long as the Skills imbued within were activated, Zhou Weiqing did not wish for his Hammer to be really damaged. As such, in the instant that the Skills had activated, his ‘crying-face’ hammer dissolved and reappeared in his hands. By now, Zhou Weiqing’s fale was pale white. After using so many powerful Skills in succession, even with the Immortal Deity Technique and Dragon-Tiger Transformation, it was starting to take a large toll on him. Yet, the effect was unquestionably good.</p><br/><p>The four Skills imbued into the ‘crying-face’ Hammer were all close combat ones, otherwise Zhou Weiqing would not choose to unleash them like this.</p><br/><p>The first Skill was the Absolute Delay. With its Absolute properties, the giant sword finally slowed drastically. However, the Boundless Infinitum Sword with the full power of the Boundless Infinitum Set behind it, and Shangguan Xue’er’s sword intent was just too strong. The Absolute Delay only lasted a second before disappearing. The Absolute properties had still been in effect, but the time it lasted was forced to be shorter. Just from that alone, one could see how absolutely terrifying that attack of Shangguan Xue’er’s was.</p><br/>\n</div>"}