{"title": "Chapter 196 Title Hidden! (2)", "id": 196, "volume": 2, "url": "http://boxnovel.org/heavenly-jewel-change-chapter-196-title-hidden-2", "volume_title": "Volume 2", "body": "<h1>Chapter 196 Title Hidden! (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><b>Chapter 196 Title Hidden! (2)</b></p><br/><p>Zhou Weiqing’s heart was filled with fear. He was already in the Dragon-Tiger Transformation state all this while, and his Ice Cold Perception was at its maximum. For him to have such feelings in such a state, one could just imagine how much danger, how serious this attack truly was.</p><br/><p>This was the first time the Ice Cold Perception had failed him. Even in the instant that his enemy had struck out at him, Zhou Weiqing did not even sense his presence. One could just imagine how skillful he was at concealment. Currently, Zhou Weiqing only had one thought. To live! To survive!</p><br/><p>As he rolled around in midair, the Ward of the Demon God had already sprang into existence, along with the automatic Immortal Deity Shield. Added to his Six Ultimate Godly Light Formation’s lightning screen around him, as well as his body’s power physical defense in the Dragon-Tiger Transformation state, Zhou Weiqing could be said to be already in his strongest possible defensive state that his body currently possessed.</p><br/><p>Despite all of that, the black rapier which darted about like a venomous snake had still managed to leave a deep trail of blood on Zhou Weiqing’s chest area. If not for the fact that his instinctive sense of danger had allowed him to roll away at the last second, his heart would have been pierced through in that strike.</p><br/><p><i>What terrifying offensive capabilities! </i>Zhou Weiqing felt that even if it were his Master, just comparing the instantaneous burst of power in a single point, this assassin might even be slightly higher!</p><br/><p>His Blink Skill only gave him a split second of time to catch a breath, and the rapier that was like a disease which had invaded deep into one’s bones [2. A direct translation. Basically means an enemy which is hard to deal with] had already reached his throat once more.</p><br/><p>In the face of such critical danger, Zhou Weiqing’s depth of potential erupted once more. Five bouts of dark-gold light instantly sprang into existence nearly simultaneously. One after the other, they exploded in a horrible scraping sound, but they had successfully blocked that terrifying black rapier for the split second that he needed.</p><br/><p>Only at this point did Zhou Weiqing finally see what this assassin looked like. It was an ordinary face, ordinary to the point that no one would be able to pick him out of a crowd. He looked to be around twenty years of age, fully expressionless, and it was almost clear that he was wearing a mask. He was dressed in a set of ordinary Kalise Empire Infantry Soldier’s uniform, which was covered in fresh blood. Clearly, he had been hiding within the Kalise Empire Infantry Battalion previously.</p><br/><p>Zhou Weiqing did not have the time to think about where this foe had come from, and who had sent him to kill him. All he could do now was try to stay alive.</p><br/><p>A giant black tiger’s illusory figure formed behind Zhou Weiqing’s back. However, it was not the Dark Demon God, as it did not have the scorpion’s tail or the massive wings. Instead, it was the Entropic Nether Tiger!</p><br/><p>As that formed, the black rapier had finally pierced through the five Consolidating Equipment God Protective Aura. Unbelievably, the five protective shields had barely lasted a split second, only managing to slow the attack slightly before it once again pierced towards Zhou Weiqing.</p><br/><p>The Ward of the Demon God and the Immortal Deity Shield had turned back on, but once again they were torn aside just so easily. Like a small bolt of lightning, the black rapier pierced right through Zhou Weiqing’s throat. At this point, Zhou Weiqing’s ‘Hate Ground no Handle’ Legendary Set did not yet cover his head or neck, and he also did not have any chance to dodge such a swift blow.</p><br/><p>“NOOO!!!” In the distance, both Shangguan Xue’er and Tian’er howled in sorrow. Instantly, both of them used their respective secret arts to increase their speed to the maximum. Alas, they were still not in time.</p><br/><p>However, the subsequent scene caused this powerful assassin to stare dazed for a moment.</p><br/><p>That was because, though the black rapier had pierced through Zhou Weiqing’s throat, it did not draw any blood at all. Instead, Zhou Weiqing’s Legendary Hammers smashed out savagely towards him.</p><br/><p>A powerful glow of lightning burst forth as the Six Ultimate Godly Light Formation circulated to its maximum. Zhou Weiqing gathered almost all his remaining Heavenly Energy onto his Hammers. The black rapier was just too quick, so much so that Zhou Weiqing did not even have the time to release any Skills. All he could chase for was for his strike to land, as he knew that this would likely be his only chance. If he missed it… perhaps the only result for him would be death.</p><br/><p>Facing the Legendary Hammers’ attack, the black clad assassin’s reaction was equally fast. Lifting his left hand, palm outwards, he struck out in a parrying motion to clash directly with the Dual Legendary Hammers.</p><br/><p>A massive explosion, as if a bolt of thunder in the skies, and Zhou Weiqing’s entire body flew back.</p><br/><p>The terrifying strength of the ‘Hate Ground no Handle’ Legendary Set proved its worth once more. Although the cultivation level and power of the powerhouse assassin was far higher than Zhou Weiqing, but facing the full power of the Legendary Hammers, his entire body which had been moving swiftly was actually stalled in midair, his upper body actually forced to snap back from the massive impact. Zhou Weiqing also seized the opportunity and the throwback of the impact to allow himself to be flung back, temporarily escaping the black rapier’s attack.</p><br/><p>It could be said that Zhou Weiqing’s abundant combat experienced had saved him. All his efforts had given him just enough time to release his next step at the last possible second. The Heavenly Skill Image he had summoned earlier was the secret defensive Skill of the Entropic Nether Tiger, the ‘Nether State’, granting him the temporary immunity to physical attacks which had allowed him to survive that lethal blow to the neck. At the same time, the power of the ‘Hate Ground no Handle’ Legendary Set and the blow of the Legendary Hammers was just enough to give him time to catch his breath.</p><br/><p>At this moment, Shangguan Xue’er was charging right at the front, barely three hundred yards from Zhou Weiqing. Tian’er was close behind her, but Lin TianAo had fallen behind, as his speed was not his strong point.</p><br/><p>His reinforcements were clearly arriving soon, but Zhou Weiqing did not dare relax at all. The moment his foe had struck out at him, he had sensed that it was a Heavenly King Stage powerhouse. However, this was no ordinary Heavenly King powerhouse, but one trained in the arts of assassination. For a Heavenly King to actually use such ambushing tactics against a mere six-Jeweled Heavenly Jewel Master… Zhou Weiqing could count his lucky stars that he had managed to survive!</p><br/><p>However, this Heavenly King Stage powerhouse’s cultivation level was already at the max, and even despite Zhou Weiqing’s sheer power, his foe had been able to shunt it off in time.</p><br/><p>Besides the black rapier in his hands, this Heavenly King powerhouse did not seem to have any other Consolidated Equipment. As Zhou Weiqing used the time that his Legendary Hammers had earned, the wings behind his back flapped crazily, increasing the momentum he had from being thrown back as he attempted to fly away. At the same time, he used the Silver Emperor Lightning Pierce to increase his speed by three times as he flew off.</p><br/><p>Facing a Heavenly King stage powerhouse, especially one with such terrifying offense, with even all his powerful defenses seeming like paper in front of him… Zhou Weiqing was clear that in order to survive, he would need to join up with Shangguan Xue’er and Tian’er, only then would they have a chance. Otherwise, despite his previous success, it would barely take a few more blows for his foe to take his life.</p><br/><p>Ever since he left the Heavenly Snow Mountain, Zhou Weiqing had been extremely confident about his own strength. After all, even the Heavenly Snow Mountain’s disciple, prince of the Lion Tribe, had not been able to defeat him. As a result, his own confidence had perhaps grown too inflated. Right at this moment, he truly understood that in this world, there were just too many things unknown, too many things he had to learn. Just like how he had taken so many people by surprise, if he was too overconfident, he would pay that same price that those who had fallen to him did. This Heavenly King stage powerhouse in front of him was indeed terrifying, far beyond what he could manage on his own.</p><br/><p>The short pause did not cause the the Heavenly King Stage assassin to slow down much, and he certainly did not stop. Even as his left hand had been knocked away by the sheer force of the impact, another series of black lights sprang out from his body. As Zhou Weiqing unleashed his Silver Emperor Lightning Pierce, he was shocked to suddenly find himself slamming into a web of black, and in moments, the terrifying keen piercing edge seemed to approach from behind.</p><br/><p><i>This…? This is the Touch of Darkness?! Could the Touch of Darkness could be used in such a manner? </i>Zhou Weiqing was truly taken aback. This black web that had blocked his way, wasn’t it the Touch of Darkness that was so familiar to him? The Darkness Skill that was one of his earliest Skills and had served him so well. The twelve tentacles of the Touch of Darkness had instead formed a large web in the skies, instead of trying to grab or grapple him, it was just used to forcefully block his way and prevent him from flying with his Silver Emperor Lightning Pierce’s boosted speed. In this way, no matter all his flying speed, he was actually unable to move forward even if he had not been actually Controlled.</p><br/><p>The black clad assassin was just too fast. Just as Zhou Weiqing had stalled for an instant, a cold chilly sensation gushed through him as the point of the rapier pierced right through his back and out his chest.</p><br/><p>The black rapier had struck so craftily, piercing right through the tiny gap of Zhou Weiqing’s currently incomplete ‘Hate Ground no Handle’ Legendary Set, from his upper back neck area all the way to the front of his chest. Although it did not pierce through the Consolidated Equipment at all, the terrifying frigid cold caused Zhou Weiqing’s heart to sink to the depths.</p><br/><p>Luckily, the ‘Nether State’ was still in effect [3. It’s actually not clear from the phrasing whether its still in effect, or he used it again. However, since the time is so short, I believe it should be the former]. With the physical immunity, once again the black rapier did not take his life and destroy his body. However, the terrifying darkness energy within the rapier still burst forth, raging crazily within him.</p><br/><p>The ‘Nether State’ was truly worthy of the Heavenly God Tier Skill that it was. Even under such a supreme disadvantageous situation, it still managed to barely protect Zhou Weiqing. It brought a total physical immunity, and though energy attacks were not immune, they would still have to erode the Nether State’s energy before actually being able to harm Zhou Weiqing. As such, Zhou Weiqing could sense that the time of the ‘Nether State’ lasting was rapidly reaching its end before its normal time. From the looks of things, it would no longer be able to save him for much longer.</p><br/><p>The black clad assassin was currently behind Zhou Weiqing, slightly above in a vantage position. His mouth curved in a mocking smirk as he looked down on the youth. Although he had truly been impressed by Zhou Weiqing’s reactions and skills over the past few seconds in reacting to his attacks, that did not stop him from killing Zhou Weiqing. In truth, the reason why he only had a single black rapier in his hands and no other Consolidated Equipment was actually very simple. The black rapier in his hand was not a single Consolidated Equipment, but an Assembly Set Sword! Just like how Lin TianAo had created an Assembly Set Shield, this black rapier of his was actually formed out of eight Consolidated black rapiers in an Assembly Set. He was just one step away from reaching his ninth and last one, where it could be considered a Legendary Set!</p><br/><p>Ordinarily speaking, a set of eight could already be barely considered a Legendary Set. However, for Assembly Sets, they were an exception. That was because their earlier pieces were all lower quality and weaker, that was the only reason they could continue stacking on in an assembly. Even so, a rapier that consisted of eight Assembly pieces… one could just imagine how terrifying the offense was. In a stark contrast and reversal from Lin TianAo’s aspirations, this black clad assassin had chased after an ultimate offense.</p><br/><p><em>Zen's notes: The title of this chapter is 'The sudden assassination'. This chapter only has 2 parts, and I usually put the title at the end but it was too much of a spoiler in this case so I'll leave it until tomorrow or the day after before I add in the title :)</em></p><br/>\n</div>"}