{"title": "Chapter 215 Surrender! (2)", "id": 215, "volume": 3, "url": "http://boxnovel.org/heavenly-jewel-change-chapter-215-surrender-2", "volume_title": "Volume 3", "body": "<h1>Chapter 215 Surrender! (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><b>Chapter 215 Surrender! (2)</b></p><br/><p>After a moment of shock, Zhou Weiqing quickly understood. This had to be done by the ZhongTian Empire. Besides them, who else would bet so much on their team?</p><br/><p>Looking at such terrible odds, Zhou Weiqing could only sigh speechlessly. Furthermore, with such terrifying odds, normal citizens would not dare to easily bet. Although no one would think that the Heavenly Bow Battle Team would defeat the Geritimo Battle Team, but what did those odds mean? For the odds to be pushed so high, it had to be at least several dozen million gold or more! For someone to be willing to place such a heavy bet on the Heavenly Bow Battle Team, there should be a reason! As such, most citizens would rather place their bets on ‘safer’ options.</p><br/><p>“This is toying with me to death!” Zhou Weiqing said with a sorrowful look. “Aren’t they afraid that I would just bet on the Geritimo Empire and lose on purpose? 1 to 100 odds!”</p><br/><p>“You won’t do that, because you are an intelligent person.” A low voice rang out in Zhou Weiqing’s ears.</p><br/><p>When Zhou Weiqing turned around, he realised that unknowingly, a figure had appeared behind him, his appearance similar to them, down to bamboo hat and veil. However, though he could not see the person’s features, he could identify the person through his voice.</p><br/><p>“Senior Shangguan, is this necessary. It’s just some small bets, surely that isn’t necessary…” Zhou Weiqing said with a bitter smile.</p><br/><p>Standing right beside him was the ZhongTian Empire Skill Storing Palace Master, the head judge of the Heavenly Jewel Tournament, Shangguan Longyin!</p><br/><p>Shangguan Longyin smiled faintly and said: “Towards any other person, perhaps it might just be a small bet. However, to you, it isn’t so simple right. Are you trying to cause us to go broke! Little brat, don’t think that will happen. His Majesty has already given the order that no matter who you meet in the preliminary rounds, there will be a hundred million gold coin bet placed on you at the start. If you dare, you can just lose the fight, but in that case, you can forget about seeing the three Young Misses forever.”</p><br/><p>“Alright, fine… I admit defeat.” Zhou Weiqing’s head drooped forward as he gave up. Facing the power of a full state machinery, especially for the strongest Empire in the mainland… what chance could he have? Furthermore, he had so many connections with the Heaven’s Expanse Palace.</p><br/><p>Shangguan Longyin laughed heartily, saying: “You don’t need to show me that look. You already wooed all three precious daughters of the Second Palace Master, no one will ever feel pity for you. In any case, since you all are facing the Geritimo Battle Team this time, I am guessing I will be able to see you take action right. Let me see how you have grown in the past three years.”</p><br/><p>After saying that, Shangguan Longyin strolled off casually. However, within a few steps, he had vanished from their sights.</p><br/><p>Zhou Weiqing said helplessly: “No choice, we have no way to play against them. At least we have already earned a few dozen million gold coins already. We can only hope for the fight against the Dan Dun Battle Team, perhaps we will be able to earn a decent sum then.” Although Shangguan Tianxin had ordered a hundred million gold bet on them for every fight, the Dan Dun Empire’s strength and popularity were far beyond the Geritimo Empire, and they could still make some profit by betting then.</p><br/><p>As they entered the competition grounds, Zhou Weiqing could clearly sense the excited atmosphere of the crowd, far beyond the previous two days. Indeed! The ZhongTian Battle Team against the Dan Dun Battle Team, such a huge battle, it was definitely worthy of all anticipation.</p><br/><p>Especially with the Dan Dun Empire’s domineering actions in the past few years, the ZhongTian Empire citizens had also heard of it. Everyone wanted to know how the clash between the Blood Red Hell and Heaven’s Expanse Palace would end up.</p><br/><p>Shangguan Longyin saw that the time was up, and he stood up in the VIP Stand, proclaiming: “The Heavenly Jewel Tournament, Preliminary Stage, Third Day, Officially begins. First Group, First Fight. ZhongTian Battle Team vs Dan Dun Battle Team. Both teams, please send your first fighter to the stage.”</p><br/><p>“Judge, please enter the stage.”</p><br/><p>Along with his proclamation, Shangguan Fei’er stood up from the ZhongTian Battle Team Rest House, appearing on the stage in a flash. For most people, all they saw was a blur before someone appeared on the stage.</p><br/><p>Ordinary citizens would not know who Shangguan Fei’er was, but there would always be some rumours or news. Furthermore, she was such a top level beauty, and as soon as she appeared on the stage, tens of thousands of citizens cheered in an overwhelming wave.</p><br/><p>Right at this moment, the Dan Dun Battle Team also reacted. Shen Little Demon leapt up, landing before Shangguan Fei’er.</p><br/><p>The judge for this fight today was also a nine-Jeweled Upper Level Zong Stage Heavenly Jewel Master which had been specially chosen by the Heaven’s Expanse Palace. After all, everything else aside, Shangguan Xue’er, Shangguan Fei’er were of extremely high status in the Heaven’s Expanse Palace, and they needed to ensure no accidents would happen in the fights.</p><br/><p>The judge looked at both girls and said solemnly: “Both sides, introduce yourselves.”</p><br/><p>Shangguan Fei’er was about to speak when Shen Little Demon spoke out first. “Dan Dun Battle Team, Shen Little Demon. Judge, we are choosing to surrender.”</p><br/><p>The judge started momentarily. “Are you surrendering for your fight, or your entire team?”</p><br/><p>Without hesitation, Shen Little Demon said: “Our entire team is surrendering.”</p><br/><p>As soon as she spoke, the entire audience erupted in an uproar, with boos rising from all around. The entire ZhongTian public square could hold more than several hundred thousand people, and most of them were from the ZhongTian Empire. The boos [1. It’s more like hissing or xuuuu sound which people use to show their disapproval like boos, which is similar to the sound which parents use to help their infants to pee, hence the joke] were so loud that perhaps the entire ZhongTian children would have the urge to go to the toilet.</p><br/><p>When Shangguan Fei’er heard Shen Little Demon’s words, she started slightly. In her heart, she couldn’t help but think: <i>As expected, that naughty fellow has guessed correctly again. </i>Towards Zhou Weiqing, she felt another rise in respect in that regard.</p><br/><p>Hearing all those boos cascading throughout the area, Shen Little Demon’s expression grew ugly. However, she could not do anything about it, just giving Shangguan Fei’er a slight bow before descending the stage.</p><br/><p>Shangguan Fei’er could only shrug helplessly, giving a feminine curtsey to the audience before slipping down as well. In the end, this most highly anticipated fight of the preliminary stages ended with a whimper.</p><br/><p>Zhou Weiqing lounged casually in his seat at their Rest House, a satisfied smile on his face as he muttered to himself: “Dan Dun Battle Team, you will be ended in I, Your Father’s, hands!”</p><br/><p>What followed next was the fights from the Second, Third and Fourth Groups, all relatively exciting in their own right, though once again there were no surprises. After all, every day the first fight of each group was that of the seeded teams. Very quickly, a round had been completed, and it was back to the First Group.</p><br/><p>Shangguan Longyin stood up on the VIP Stand once more, saying solemnly: “First Group, Second Fight. Heavenly Bow Battle Team versus Geritimo Battle Team. Both sides, please send out your first fighter.”</p><br/><p>Zhou Weiqing glanced at Ma Qun, who had an urgent look on his face. However, this time he shook his head, saying: “Yun Li, this time you go first. Safety first. I want you to try to achieve victory but with the priority of keeping yourself uninjured. We cannot underestimate the Geritimo Battle Team this time, as they are here burning with righteous indignation having fallen so badly earlier. Although their target is not us, they will not be easy to handle.”</p><br/><p>Yun Li nodded in agreement before heading out of the Rest House, heading up the stage calmly. On the other side, the first member of the Geritimo Battle Team was already standing on the stage.</p><br/><p>Yun Li’s opponent was a youth of about twenty seven or twenty eight years of age, dressed in their black uniform, a serious aura about him as he fixed his gaze upon Yun Li.</p><br/><p>The judge said solemnly: “Both sides, introduce yourselves.”</p><br/><p>“Heavenly Bow Empire, Yun Li.”</p><br/><p>“Geritimo Empire, Bai Qiu.”</p><br/><p>The judge proclaimed: “Fight, begin.”</p><br/><p>As the proclamation sounded off, both Yun Li and Bai Qiu from the Geritimo Battle Team instantly chose to back up at once. This was the normal competition style in the Heavenly Jewel Tournament. After all, fighters would not be familiar with each other, and to just charge in blindly would perhaps allow their opponent to counterattack with ease. It was a safer method to start gaining information with probing and exploratory attacks.</p><br/><p>As both retreated, they each released their respective Heavenly Jewels. When they did so, it immediately caused a huge sensation.</p><br/><p>That was because around both Yun Li and Bai Qiu were six pairs of Heavenly Jewels. That was to say, both these youths were Upper Level Zun Stage Heavenly Jewel Masters.</p><br/><p>Bai Qiu’s Physical Jewel was the agility Type, with the Wind Attribute… an Ultimate Speed type Heavenly Jewel Master!</p><br/><p>However, Yun Li’s was not to be dismissed as well. The Elemental Jewels on his left wrist was the Chrysoberyl Cat’s Eye of the Spatial Attribute.</p><br/><p>Just from the looks of things alone, both of them seemed equal, and in their hearts, the phrase ‘formidable opponent’ rose up.</p><br/><p>As Yun Li already had Zhou Weiqing’s warning earlier, so he did not think much about it. However, for Bai Qiu, he was truly caught by surprise. Originally, he thought he would be facing one of those ‘tin cans’ of the Heavenly Bow Empire, and with his speed and powerful attacks, he had absolute confidence in countering either of them. Who knew that the opponent would instead be a Spatial Attribute Heavenly Jewel Master, and one who was also at a similar six-Jeweled cultivation stage. It looked like this was the strongest member of the Heavenly Bow Empire. He had never imagined that such a tiny Empire would have a Upper Level Zun Stage Heavenly Jewel Master below the age of thirty.</p><br/><p>Without a doubt, as Yun Li revealed himself on stage, everyone watching would have their judgement of the Heavenly Bow Empire totally overturned. At least, no one would look down on them any longer.</p><br/><p>Yun Li made an inviting gesture with his hand, and with a flick of his right wrist, a faint silver light appeared in his grasp.</p><br/><p>Towards an opponent of the same level as him, Bai Qiu naturally dared not be careless, unleashing his Consolidated Equipment at once.</p><br/><p>A pair of green boots, a pair of gloves, and a pair of Wings. This was all of his six Consolidated Equipment. Although it was an entire set of six Consolidated Equipment, at least it was three sets of paired Consolidated Equipment.</p><br/><p>In a flash, he appeared beside Yun Li, his speed so fast than Yun Li was given a surprise.</p><br/><p>This Bai Qiu was of the Wind Attribute, and he naturally did not have a Spatial Skill like Blink. However, with that charge of his, the impression one would get was almost like the Blink Skill.</p><br/><p>Upon the Consolidated Gloves on Bai Qiu’s hands, there were sharp claws. As he appeared in front of Yun Li, those claws struck out towards his shoulders.</p><br/><p>Bai Qiu’s focus was clearly not something an ordinary Heavenly Jewel Master would go for, perfectly tailored towards his own abilities. It could be said that of his six Consolidated Equipment, both wings and boots were fully for the sake of increasing his speed, added on to his own full Agility and Wind Attributes, his speed was truly at a terrifying level. Even a Zong Stage powerhouse might not be able to compare with him in that aspect. Of course, the clawed gloves were his main offensive weapons.</p><br/>\n</div>"}