{"title": "Chapter 210 Ascending Heavenly Jewel (2)", "id": 210, "volume": 3, "url": "http://boxnovel.org/heavenly-jewel-change-chapter-210-ascending-heavenly-jewel-2", "volume_title": "Volume 3", "body": "<h1>Chapter 210 Ascending Heavenly Jewel (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><b>Chapter 210 Ascending Heavenly Jewel (2)</b></p><br/><p>Tian’er looked at Zhou Weiqing and said: “Besides the bare minimum we need for our Heavenly Bow Empire to continue running properly, we brought all excess funds. We currently have around thirty million gold in total.”</p><br/><p>Hearing that sum, everyone was surprised, staring at Zhou Weiqing in shock. To bring such a large sum of money, what was he trying to do? Previously, Zhou Weiqing had not told them about this.</p><br/><p>Zhou Weiqing grinned and said: “Building up the reputation of our Heavenly Bow Empire is indeed important, but to us, perhaps the more important thing now is to earn money. We can never have enough money, there are just too many ways we urgently need to spend in. Furthermore, I have just declared a year of tax exemption for our Empire, but we have to keep building up our troops. With just our current funds, I’m afraid we can’t last too long. As such, before we finish our empire’s revival and build the economy back to self sufficiency, we need to get fresh infusions of gold. Only by doing this will we be able to continuing further upgrading and improving our troops. This Heavenly Jewel Tournament is definitely one of the best chances we have.”</p><br/><p>It could be said that Zhou Weiqing was currently the highest commander in the entire Heavenly Bow Empire, with Princess Difuya only as a figurehead, and she would not interfere in his decisions. This time, since he was leaving the Heavenly Bow Empire for such a long time to join the Heavenly Jewel Tournament, naturally he had to do something for the Empire during this time.</p><br/><p>Attending the Tournament was indeed very important, but Zhou Weiqing had also definitely placed much importance on the chance to earn gold. After all, the previous time he had joined the Heavenly Jewel Tournament, he had won slightly more than one hundred million gold. This time, his capital was even greater, and he would not give up the chance easily.</p><br/><p>Of course, Crow had one of the previous Fei Li Battle Team members who had earned much from the last Heavenly Jewel Tournament. Instantly, her eyes lit up as well as she said: “Boss, tell us what to do then? Do we still bet everything on ourselves? We can already earn a decent amount in the preliminary stages.”</p><br/><p>Zhou Weiqing shook his head and said: “It will be tough to just throw everything betting on us, it is too obvious a target. After all, this time our capital is much higher, and if we bet everything on us, it will greatly influence the odds. We need to spread our web in betting. Of course, we will definitely bet on ourselves too. Thirty million gold… it should be impossible to multiply it by a hundred, but if we are careful, multiplying it by ten times or more should not be a problem. With the wealth of the ZhongTian public, and the other Battle Teams’ ‘investment’, I have no worries about success. As for how we do so exactly, it will have to wait until we all draw lots and the groups are settled.”</p><br/><p>Crow grinned and said: “That is your business already, in any case I will just bet all my personal funds on us, that is the safest.”</p><br/><p>Zhou Weiqing nodded and said: “That is good too. I think all of you can just bet all your personal funds on ourselves, that will be safer. However, when it comes to some critical matches, we also need to be careful. After all, we might not necessarily be able to win every single fight. Alright, you guys have a rest in the inn first, I am going out for a while, to trying and find some information about our opponents this Heavenly Jewel Tournament. I should not be back too early, so Tian’er, you do not need to wait for me tonight.”</p><br/><p>Tian’er nodded in agreement.</p><br/><p>Zhou Weiqing opened the door and left. As they watched his retreating bet, Yun Li couldn’t help but ask Tian’er curiously: “Why don’t you follow him, all this time you both haven’t been apart.”</p><br/><p>Tian’er smiled faintly and said: “He is going to the Heavenly Jewel Island to look for his loves, what use is there for me following him?”</p><br/><p>Yun Li started momentarily. “You know about it? Why did you just let him go then?”</p><br/><p>Tian’er smiled and said: “There are some things that are not worth fighting about. If I cannot hold onto his heart, what is the point of holding onto him? If he really leaves me because of other women, that only proves my own attractiveness is insufficient. However, I am confident.”</p><br/><p>Ma Qun gave Tian’er a big thumbs up and said: “Sis-in-law, impressive. We’ll head back first then.” After saying that, he stood up and left together with Crow and Xixi.</p><br/><p>Yun Li also scratched his head sheepishly before following them. He did not really understand Tian’er’s psychology in that.</p><br/><p>In truth, for the past few days, Tian’er had suddenly become open minded. This fellow Little Fatty had this many women, why should she continue finding trouble for herself? Forcing him to be so troubled about having to chose. Furthermore, the three Shangguan Sisters were not tough to get along with. No matter what, Zhou Weiqing would not leave her, or leave them, so she did not want to give him excess trouble that could be avoided. She had decided not to fight with them about this, and it would be much better.</p><br/><p>Tian’er’s guess was indeed accurate. After Zhou Weiqing left the inn, he headed straight for the Heavenly Jewel Island. With the previous plaque he had from the last Heavenly Jewel Tournament, it was no trouble for him to ascend the Heavenly Jewel Island. Furthermore, with his current cultivation level, it did not take long for him to cross the clouds and reach the top.</p><br/><p>In truth, even before they stepped into the ZhongTian City, as they neared it, his heart had already flown up there. Before Shangguan Xue’er had left, she had told him that Bing’er was already out of her closed door cultivation, and he could no longer hold back the longing in his heart. Of course, he would still be looking for information about the other Battle Teams, but the most important thing for him now was to look for Bing’er.</p><br/><p>“Is your Third Young Miss here? Please help me send a message that Zhou Weiqing is here to look for her.” As soon as he reached the Heavenly Jewel Island, Zhou Weiqing did not hesitate to look for one of the workers of the Heaven’s Expanse Palace.</p><br/><p>The few white clad youths did not recognize him, and as soon as they heard he was looking for Shangguan Bing’er, they were surprised.</p><br/><p>The Heavenly Jewel Island wasn’t a place that most people could easily access. One had to be a Upper level Zong Stage to even have the right to be given special access, or the only other way was through the Heavenly Jewel Tournament. This youth in front of them clearly seemed to be the latter, and they not know which Great Saint Land he had come from.</p><br/><p>One of the white clad youths at the head said passively: “I’m sorry, Sir. We are not able to help you send such a message. Our Third Young Miss will not see any ordinary person easily.”</p><br/><p>Zhou Weiqing’s face grew bleak. “I am her husband, how can you not send the message?”</p><br/><p>As soon as he said that, the white clad youths’ eyes widened, and they stared at Zhou Weiqing with disbelief.</p><br/><p>The leader’s face turned ugly, and he shouted angrily: “You dare insult our Third Young Miss? Arrest him!”</p><br/><p>Instantly, the dozen or so Heaven’s Expanse Palace white clad youths surrounded Zhou Weiqing, unleashing their Heavenly Jewels.</p><br/><p>They were all Heavenly Jewel Masters, and though their average cultivation level was at the four-Jeweled stage, with only the leader who was about thirty years of age being around six-Jeweled stage. However, they definitely had the numbers advantage.</p><br/><p>Zhou Weiqing said exasperatedly: “I really am Bing’er’s husband, what do you mean I am insulting her?!”</p><br/><p>The leading white clad man gave a disdainful hmph. “Why don’t you urinate in a puddle and look at your own reflection? You think you are worthy?!”</p><br/><p>“Your sister…” Little Fatty flew into a rage, stepping forward and sending a punch flying towards the white clad leader, totally ignoring the rest of the youths charging at him.</p><br/><p>Instantly, the entrance of the Heavenly Jewel Island lapsed into a mass of chaos and confusion.</p><br/>\n</div>"}