{"title": "Chapter 228 Mother Dragon! (2)", "id": 228, "volume": 3, "url": "http://boxnovel.org/heavenly-jewel-change-chapter-228-mother-dragon-2", "volume_title": "Volume 3", "body": "<h1>Chapter 228 Mother Dragon! (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><b>Chapter 228 Mother Dragon! (2)</b></p><br/><p>The massive grey whirlpool seemed to shudder slightly, and the several dozen fire dragons in the center of it felt a massive suction power forcefully dragging them at a greater speed than the other fire dragons.</p><br/><p>In the current moment, a huge energy reverberation was in the air. Zhou Weiqing and the four girls did not notice, but in that moment, in the eyes of the large grey illusory figure, a thick grey light also lit up.</p><br/><p>The Demonic Attribute was extremely powerful indeed, and in the process of the absorption of power into the large Saint Energy whirlpool, everything had been raised to their ultimate stage. The immense pressure caused Zhou Weiqing to vomit blood once more, but he grit his teeth to hold on.</p><br/><p>He was unwilling to leave this place unless absolutely forced to, and even then only at the last moment. Just like what he had said previously, danger was often accompanied by opportunities. If they could successfully Devour so many fire dragons at once, the benefit it would bring to him and Tian’er was unimaginable… perhaps at least a thousand drops of Saint Energy each! If they were to just slowly cultivate that amount, perhaps even ten years would not be sufficient to gain that much Saint Energy. Even if they tried the ‘shortcut’ method of Devouring Heavenly Beasts, without at least a hundred Heavenly King Stage beasts or higher, it would be unlikely they could gain so much.</p><br/><p>*Peng* A soft crash as Zhou Weiqing was forced to kneel down on a single knee, the immense pressure he was under causing even him to be unable to stand stably. The ‘Hate Ground no Handle’ Legendary Set around him was glowing with a bright dark-gold light, clearly doing its best to help Zhou Weiqing reduce the pressure as much as possible.</p><br/><p>The three Shangguan Sisters exchanged looks, and crying out in unison, they abruptly burst worth with their strongest ranged attacks towards the fire dragons. Only by helping Zhou Weiqing Tian’er share some of the pressure would the chances for their final success be increased.</p><br/><p>The large Saint Energy whirlpool was gaining an unprecedented huge infusion of power, and currently, where Zhou Weiqing and Tian’er were holding hands, their entire hand and arm was turning into to look like a transparent jade stone, the silver white light which was shining about their entire body turning translucent.</p><br/><p>This was also because it was Zhou Weiqing’s body, strengthened and far more flexible and tough from the Dragon-Tiger Transformation, allowing him to somehow resist the terrifying pressure. The accumulated pressure from all of these fire dragons had even reached the level of a single Heavenly Emperor stage powerhouse. Any other six-Jeweled Heavenly Jewel Master, even one like Shangguan Xue’er… perhaps they would have already broken down in front of such terrifying pressure.</p><br/><p>Zhou Weiqing felt as if all the bones in his entire body were creaking and rattling from the sheer intensity of the pressure. However, in that moment, the benefits were starting to roll in.</p><br/><p>The large Saint Energy whirlpool was brighter than ever, the Saint Energy flowing in like a stream, separating into two flows towards Zhou Weiqing and Tian’er’s body.</p><br/><p>However, at this moment, Tian’er actually stopped the flow of Saint Energy into her own body, reversing the flow and causing it to infuse into Zhou Weiqing’s body instead.</p><br/><p>After all, Zhou Weiqing was the one who was mainly facing the majority of the massive pressure, and although Tian’er was sharing some of it, it was much lesser, especially since the Devour Skill whirlpool was being fully controlled by Zhou Weiqing. In Tian’er’s heart, nothing was more important than Zhou Weiqing’s safety after all.</p><br/><p>With the major infusion of thick Saint Energy into his body, Zhou Weiqing did not need to control it at all, and the Saint Energy automatically flowed into his body and to his twenty six energy whirlpools of his Death Acupuncture Points, further channeled by them through all of his meridian channels and enriching his entire body.</p><br/><p>As the Saint Energy flowed through his body, Zhou Weiqing instantly felt the pressure reduce on him, and he could finally stand up again. As for the fire dragons in the air, they were slowly and steadily being drawn into the terrifyingly huge Devour whirlpool, crazily eaten up and transformed into Saint Energy.</p><br/><p>In that instant, Zhou Weiqing could only feel as if his entire body was turning into that translucent silver-white colour, the torture of the massive pressure slowly turning into an enjoyable comfort, as if his entire body and all his powers were being transformed and evolved by the Saint Energy. He was not even able to determine how much Saint Energy was in his body at that moment.</p><br/><p>As the fire dragons disappeared one after the other, the thick dark red light in the air around them also dissipated mostly, at least in the nearby vicinity. The Devour whirlpool had not just Devoured all the fire dragons, even the fire attribute energies in the air was not let go.</p><br/><p>The fire attribute energies in a several thousand metre radius had been swept aside, revealing the cracked, browned burnt earth below at last.</p><br/><p>The four girls simultaneously heaved a sigh of relief. It looked like they had gotten past this first crisis for now, and their gazes all landed upon Zhou Weiqing. Having just Devoured so many fire dragons, the large whirlpool of the Devour Skill was slowly rescinding, and the look of satisfaction on Zhou Weiqing’s face also caused their hearts to settle down.</p><br/><p>However, right at that moment, an abrupt howl of anger rose from nowhere. In the next second, a small red dot appeared in their sights, beginning to grow rapidly by the second. An even more terrifying pressure than the over hundred fire dragons abruptly appeared, bursting forth upon them at once.</p><br/><p>At first, it was just a small red dot, but in moments, it had grown substantially in their eyes… it was an incoming giant fireball!</p><br/><p>The size of the fireball was far beyond anything they had ever witnessed in their lives before, or even imagined… at least thirty metre in radius, almost fully consolidated like an actual solid ball, looking extremely terrifying. The air around the fireball was not even warped like the normal water-like symptom, instead with a patch of pitch-black darkness, clearly a sign of the space around it being torn apart. This was a fireball after all, not a spatial type attack… and this could only mean one thing… the power of this fireball was far beyond their recognition.</p><br/><p>The four girls instantly executed the same action as one, various powerful lights of different colours springing forth around them. At this point, Zhou Weiqing had been having a face full of comfort abruptly stepped forward with his left foot, the surface of his feet causing a violent explosion as it struck the ground, causing the ground to crack viciously, as his right foot soon followed suit. Now, this was the truly terrifying one, as his pitch black right foot slammed savagely onto the ground, the entire air actually warped violently, an ear piercing screech ringing out as the four girls were sent back at the same time as his own body was sent flying towards the fireball like a cannonball.</p><br/><p>As a man, how could Zhou Weiqing let his own women place themselves in danger in his place? None of them knew the source of the fireball yet, and under ordinary circumstances, he would definitely get everyone to use the Lustre Gem to escape this place immediately. However, in his current status, it was not normal at all, as he had at least two thousand drops of Saint Energy or so in his body, feeling as if his body was stuffed full to bursting point, and the world was in his hands.</p><br/><p>They had forged their way to this point with such difficulty, and he would not give up so easily. Otherwise, if they had to try to enter again, they would have to go through all the trouble once more. Furthermore, who knew how long more the Lustre Spatial Realm could last?</p><br/><p>Zhou Weiqing’s glowing silver-white body instantly appeared in front of the fireball, ready to receive it. The Devour whirlpool which had been slowly shrinking suddenly expanded once more. Against such a massive fireball, Zhou Weiqing had no other choice, the freshly recharged Saint Energy once again pouring into the Devour Skill without holding back.</p><br/><p>In the blink of an eye, the grey whirlpool turned white, exploding to a hundred zhang radius, and the terrifying Devour power met the giant fireball.</p><br/><p>At the same time, the illusory figure of the Demon God behind Zhou Weiqing suddenly floated forward together with him. Perhaps it was because Zhou Weiqing had suddenly infused a large enough amount of Saint Energy, in that instant, its body suddenly turned more solid, as it floated in front of Zhou Weiqing, its arms spreading wide as if holding the devour whirlpool, receiving the giant fireball.</p><br/><p>*Puuu* A loud tearing sound caused the entire Lustre Spatial Realm to shake violently, but there was no explosion like one might expect for such a collision.</p><br/><p>When the giant fireball smashed into the Devour whirlpool, it was like a snowball smashing into a red hot metal plate, with an ear splitting hissing sound, it vanished right into the massive whirlpool.</p><br/><p>However, the attack was not over. The Projection of the Demon God blocking in front of Zhou Weiqing turned red instantly, the temperature all about them raising to the max. In the next instant, the entire Devour whirlpool shattered, and Zhou Weiqing’s body was suddenly sent flying back as if he had been slapped by a giant palm, smashing savagely into the ground with a sickening thud. What a terrifying blow.</p><br/><p>The four girls who had been sent back by Zhou Weiqing charged towards him without thinking, and at the same time, a enraged howl rang out through the entire Lustre Spatial Realm.</p><br/><p>“It’s all you detestable and abominable humans again! All of you… die!!” In the distance, a massive figure appeared in their sights, a giant red dragon more than a hundred metres long, and a terrifying pressure blotted out the skies as it surged down upon them. Originally, the area around them had been cleared of fire attribute energies, but it now turned dark red once more.</p><br/><p>Heavenly God Stage. A powerful Heavenly God Stage Heavenly Beast, pretty much top ranked in the world today. This was the reason why Zhou Weiqing was unable to fully dissipate its attack even though he had infused more than a thousand Saint Energy. In front of a Heavenly God Tier Heavenly Beast, just surviving its attack was something to be proud of already.</p><br/><p>Zhou Weiqing did not stay long in the deep crater that was created when his body was smashed into the ground. At this time, though his entire body was hurting as if it was being torn apart, almost feeling like he was about to die at anytime, while his Heavenly Energy and Saint Energy was in disorder in his body.. However, he knew he had no other choice but to react as quickly as possible.</p><br/><p>As his wings flapped, he forced himself to rise up again. At the same time, a resonant dragon’s cry rang out from Zhou Weiqing’s mouth, cutting through the air and spreading out. A thick bloodline aura spread forth from his body, boldly sweeping throughout the area.</p><br/><p>The large red dragon had already shot out another five of those giant fireballs, some even larger than the original one. However, that dragon’s cry that Zhou Weiqing issued out actually saved their lives.</p><br/><p>The massive fireballs abruptly stopped in midair, and the originally crazed and enraged eyes of the red dragon were suddenly filled with curiosity as it stopped its attack temporarily.</p><br/>\n</div>"}