{"title": "Chapter 235 Sumeru Ring, Sea Emperors Shuttle (2)", "id": 235, "volume": 3, "url": "http://boxnovel.org/heavenly-jewel-change-chapter-235-sumeru-ring-sea-emperors-shuttle-2", "volume_title": "Volume 3", "body": "<h1>Chapter 235 Sumeru Ring, Sea Emperors Shuttle (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>The shuttle slid into the waters, but it only sank into the waters by a tiny amount despite its great weight.  Half of it remained floating above the surface, while the lid remained open. However, Zhou Weiqing could see that something was different this time.  As soon as the Sea Emperor’s Shuttle had touched the water, it began to emanate a hazy halo of light which made it look dreamlike and mesmerizing within the darkness of the night.</p><br/><p>Zhou Weiqing once more entered the shuttle.  This time, something marvelous happened as soon as he pushed the octahedral gemstone into the impression.  The lid above them slowly slid shut, separating them from the outside world. As it completely closed and as the vessel completely sank down into the ocean, the insides of the entire shuttle suddenly lit up.</p><br/><p>Line of dazzling blue light appeared within the interior of the Sea Emperor’s Shuttle, creating a dream-like world.  The crystal screen in front of them suddenly became completely clear, seemingly magnifying everything in the outside world and making everything visible.</p><br/><p>“How beautiful!”  Shangguan Bing’er instantly let out a sigh of amazement as she stared at the blue light around her.  No girl could possibly resist this sort of beautiful luster.</p><br/><p>Zhou Weiqing’s focus, however, was on something else.  He had just noticed that after the cabin ‘lid’ had sealed, the shuttle had instantly stabilized.  The waves of the sea didn’t seem to have any effect on it at all, nor was there any sort of rocking sensation.</p><br/><p>Right at this moment, a smooth crystal globe armrest slowly began to arise between the two.  It was located right below Zhou Weiqing’s right arm, and he could comfortably rest his entire arm atop it.</p><br/><p>Zhou Weiqing was extremely clever.  He instantly knew exactly what he had to do.  He slowly tested out sending his Saint Energy into the crystal globe, and the scene around them instantly changed once more.  The blue light inside the cabin dimmed, but the outside world suddenly lit up. It was night, but they were now able to see everything as clearly as though it was day.  This wasn’t simple illumination, it was some sort of unique luminescent transformation.</p><br/><p>That wasn’t all.  An even greater marvel appeared in the form of a helmet-like object slowly descending from up above him, coming to a rest over Zhou Weiqing’s head.  Moments later, the chairs they were seated in began to transform as well. The crystal seats actually seemed to come to life, slowly shrinking as they molded themselves to their two occupants.  The seats actually became so connected to them that it was as though they had been ‘embedded’ into the seats. Not only did they feel extremely stable, the crystal seats actually gave them a soft and comfortable feeling.</p><br/><p>“So this is actually a thing?”  Zhou Weiqing let out a loud, amazed sigh.  Finally, he understood why Shangguan Tianyang had repeatedly emphasized that they had to return this thing to him.  He had no idea how this thing had been built, but so long as it wasn’t too slow then without question it could be described as a divine instrument for traveling across the seas.</p><br/><p>Right at this moment the cold helmet sent a pulse of strange energy into Zhou Weiqing, startling him.  A heartbeat later, he discovered to his astonishment that his mind and consciousness had been instantly expanded.  It was as though this helmet had some sort of special psychic ripple within it that actually allowed him to link his mind into it.</p><br/><p>Zhou Weiqing closed his eyes.  He was now able to ‘see’ everything around himself with even greater clarity, but this time he wasn’t just looking at what was ahead of him.  It was more like he himself was outside the ship, with ‘eyes’ covering all 360 degrees around the Sea Emperor’s Shuttle. He had no blind spots at all.</p><br/><p>With a rumble, a strange new sense entered his mind.  In that instant, Zhou Weiqing felt as though the Sea Emperor’s Shuttle had transformed into part of his body.  The pulse of strange energy had linked up with his mind, making it so that all of the secrets of the Sea Emperor’s Shuttle became embedded into his consciousness.  He now knew the history of the shuttle and how he was supposed to control it.</p><br/><p>Apparently, the Sea Emperor’s Shuttle had been fashioned from a Heavenly Core Nucleus harvested from one of the Terror Sea Dragons, the hegemons of the seas.  This particular Terror Sea Dragon had been at the Heavenly God stage, and it was at the absolute top of the oceanic food chain. It had been so large that it was actually larger than the two giant dragons Zhou Weiqing had recently met.  It had been nearly a thousand meters long! One could imagine how much energy its Core Nucleus contained.</p><br/><p>For the sake of fashioning the Sea Emperor’s Shuttle, the people of the Xuantian Continent had expended incalculable amounts of resources and manpower.  They had first extracted very last bit of the Heavenly Energy from the Terror Sea Dragon’s Core, then had begun the manufacturing process. Countless grandmaster artificers had worked together before finally succeeding in creating this unparalleled ocean-crossing ‘vessel’.  It had been meant for the Xuantian Palace to use, and alongside the Spatial Teleportation Gem they were the most supreme treasures the Xuantian Palace possessed.</p><br/><p>When the Xuantian Palace had led people to the Boundless Mainland, they had been planning on fighting a grand war of conquest.  However, the Boundless Mainland was far, far more powerful than they had predicted, and in the end they had suffered an utterly crushing defeat.  They had only survived and escaped thanks to the Spatial Teleportation Gem, which was able to teleport them to the location it had locked onto no matter how distant it was.  After they fled, the Sea Emperor’s Shuttle had been taken away by the Heaven’s Expanse Palace as spoils of war. That was why it was now available for Zhou Weiqing to use.</p><br/><p>Because the shuttle had been fashioned from the Heavenly Core Nucleus of a Terror Sea Dragon, the aura it emanated in the seas would be enough to cause the vast majority of sea beasts to stay far away from them.  The shuttle itself was almost indestructibly tough, and it relied upon a Heavenly Jewel Master’s Heavenly Energy to advance. It was incredibly fast, making traversing the seas a completely pain free prospect.</p><br/><p>Not just that – the Sea Emperor’s Shuttle also included records and maps of the sea within it.  These were complete maritime maps which the forces of Xuantian Palace had created as they had travelled to the Boundless Mainland, and so they by following these maps they could avoid getting lost or taking any accidental detours.  They would go straight to the Xuantian Continent!</p><br/><p>“A divine artifact.  This is definitely a divine artifact!”  Zhou Weiqing put away his Saint Energy, while the helmet on his head retracted on its own.  He didn’t explain anything to Shangguan Bing’er, simply asking her to switch positions with him.  Once she poured in her Heavenly Energy, she was able to sense everything for herself.</p><br/><p>Everyone is filled with curiosity towards new items, especially young people like them.  They then switched places again, pouring their Heavenly Energy into the sea maps and activating them.  Thanks to the 360 degree vision the helmet provided, Zhou Weiqing was able to see everything around him with absolute clarity.  He poured his Saint Energy into the shuttle in accordance with the imprinted mental instructions he had been given, instantly activating this marvelous artifact.</p><br/><p>Zhou Weiqing discovered that when he filled the crystal globe with his Saint Energy, it was instantly magnified by the Sea Emperor’s Shuttle .  This was the marvelous, powerful effect the Heavenly Core Nucleus of a Heavenly God-ranked Heavenly Beast would have. A light blue stream of fire instantly erupted out from behind the shuttle, sending it shooting through the seas like an arrow.</p><br/><p>The Sea Emperor’s Shuttle ‘swam’ through the seas like a fish, with the world around the two still perfectly clear and visible.  Thanks to the special abilities of the Sea Emperor’s Shuttle, Zhou Weiqing would be able to clearly see everything around him up to a distance of a thousand meters, even if he was in the deepest and darkest parts of the ocean.  As for his senses, they stretched out even further.</p><br/><p>The seawater almost seemed to be nonexistent for the Sea Emperor’s Shuttle.  As Zhou Wenqing sent the shuttle hurtling forwards with his mighty Saint Energy, it instantly sped up to an incredible pace which vastly eclipsed the galloping speed of the Ghost Demon Horse.</p><br/><p>What was even more marvelous was that very little of Zhou Weiqing’s Saint Energy was being used!  It was only depleting at a very slow, gradual rate. At the same time, the energies of the outside world didn’t seem to impede the Sea Emperor’s Shuttle at all.  Instead it became purer as it went past the Sea Emperor Shuttle, allowing Zhou Weiqing to absorb it and use it to replenish his own Saint Energy. The Water-attribute energy of the sea was even able to transform into air, making it so that the insides of the Sea Emperor’s Shuttle didn’t feel stuffy at all.</p><br/><p>The Sea Emperor’s Shuttle was like a giant fish swimming through the seas under Zhou Weiqing’s mental control.  It was incredibly fast, and the feeling of perfect swimming control was quite refreshing as well. He was like a child who had just discovered a big new toy, and he continuously played around with all of the shuttle’s marvelous functions.</p><br/><p>Because the Sea Emperor’s Shuttle strictly advanced underneath the surface of the ocean, no events which were occurring above the surface would hinder its speed in the slightest.  In the sea, there was no such thing as ‘terrain’ to worry about, and so they were able to send the Sea Emperor’s Shuttle hurtling forward in a straight line as they hastened towards the Xuantian Continent.</p><br/><p>After repeated tests, Zhou Weiqing quickly discovered that although there were Heavenly Beasts in the ocean, as soon as they sensed the faint blue aura and light emanating from the Sea Emperor’s Shuttle they would swim away in terror.  None of them dared to get in the way! Every so often, they would encounter some slower-swimming ocean beasts which were in their way. When this happened, the terrifyingly fast shuttle would almost instantly pierce straight through the beasts without even slowing down.  Thanks to the incredibly tough ‘shell’, they suffered no damage from this whatsoever. As the water continued to surge past them, no traces of the beasts’ entrails would be left.</p><br/><p>At first, Zhou Weiqing and Shangguan Bing’er were filled with curiosity towards the ocean.  They had perfect visibility within the Sea Emperor’s Shuttle, and so they would excitedly stare at the many marvelous scenes the ocean contained.  To them, this was all completely new and fresh. The many marvelous sea-dwelling creatures were of particular interest to them. There were so many types of fish and coral reefs, and all of them were mesmerizing.</p><br/><p>However, as time flowed on this sense of curiosity began to recede.  By the fifth day, loneliness had replaced it.</p><br/><p>Yes.  When sailing the seas, their greatest enemy was not the sea beasts.  It was loneliness.</p><br/>\n</div>"}