{"title": "Chapter 257: Do not think you have already won! (2)", "id": 257, "volume": 3, "url": "http://boxnovel.org/heavenly-jewel-change-chapter-257-do-not-think-you-have-already-won-2", "volume_title": "Volume 3", "body": "<h1>Chapter 257: Do not think you have already won! (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 257: Do not think you have already won! (2)</strong></p><br/><p><span style=\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\">Vaguely, both Zhou Weiqing and Shangguan Bing’er were able to clearly sense the violent energies clashing below behind the cover of the red light. Of course, it was just the fluctuations, as in their position they would not be affected at all. </span></p><br/><p><span style=\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\">The fight between three mighty dragons was undoubtedly extremely exciting, but in order to ensure the safety of the two young humans, and also to prevent the Terror Sea Dragon from being a cornered dog that leaps over the wall in desperation[1. Literal translation, depicting a cornered beast often doing anything desperate. In this case, probably referring to it suicide killing Zhou Weiqing], Hui Yao did not allow them to watch. </span></p><br/><p><span style=\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\">Very quickly, ten minutes had passed, and the surging energies below the red cloud began to calm down. Abruptly, silence reigned as the red light withdrew, revealing the scene below to Zhou Weiqing and Shangguan Bing’er. </span></p><br/><p><span style=\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\">The originally brutally unmatched Terror Sea Dragon no longer seemed like a Heavenly God Tier powerhouse. Although its body was huge, it paled in comparison to Hui Yao.</span></p><br/><p><span style=\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\">Currently, Hui Yao’s front claws were grabbing the Terror Sea Dragon by its neck and back, just lifting it up like that in midair. Its body had shrunk by a third, its entire tail end had vanished, and there were terrible burn marks all over its entire body. Of all the ferocious looking spikes on its body, more than two thirds had been broken or clipped. In front of two mighty Dragons with the Emperor bloodline, especially now that they were in midair, it naturally had no chance at all. </span></p><br/><p><span style=\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\">The Terror Sea Dragon was still alive, but it was fully restricted by Hui Yao’s powerful dragon powers. Currently, its eyes no longer held any venom; all that was left was utter terror. </span></p><br/><p><span style=\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\">Zhou Weiqing spread his hands and shrugged, saying: “I told you long before that I have the Emperor Dragon bloodline, but you refused to believe me. This time, you can’t escape right? Well, this time we did snatch the Spatial Teleportation Gem from the Xuantian Palace, but we have in turn helped them solve this big problem, so it isn’t too bad for them at all. Senior Hui Yao, could you please finish him off, lest this big fellow causes trouble in the oceans once more.” </span></p><br/><p><span style=\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\">Hui Yao laughed heartily and said: “There is no rush to finishing it off, it still has a good usage.” Although they were both considered dragons, but they were separated into different tribe groups. Furthermore, Hui Yao was of the highest and proudest of the Emperor Dragon bloodlines, and he had been helped by Zhou Weiqing so many times. He had always wanted to return the favour, and this was a perfect opportunity. </span></p><br/><p><span style=\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\">“Good usage? Could it be that Senior wants it to carry us back to the Boundless Mainland?” Zhou Weiqing asked curiously. </span></p><br/><p><span style=\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\">Hui Yao shook its head, saying: “How could that be possible? Don’t look at its dejected posture now. Once it returns to the ocean, that will change instantly. The greatest innate talent of the Terror Sea Dragon is that it is able to draw upon the powers of the oceans to heal its wounds. It may be severely injured now, but once it re-enters the oceans, it can use its secret arts to escape instantly. Before long, it will be back spry and alive again. As such, we cannot allow it to touch the ocean once more.” </span></p><br/><p><span style=\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\">Hearing Hui Yao’s words, the Terror Sea Dragon in his claws couldn’t help but reveal a look of despair. Currently it was fully under Hui Yao’s control, even if it wanted to self-detonate its Heavenly Core, it was already too late. </span></p><br/><p><span style=\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\">Zhou Weiqing asked wonderingly: “Then… Senior’s meaning is?” </span></p><br/><p><span style=\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\">Hui Yao laughed heartily and said: “You little brat, sometimes you can be so unbelievably intelligent, yet you can also be so slow at times. Such a perfect opportunity and target, it isn’t so easy to look for. Do you think your Devour Skill is a mere decorative tool?” </span></p><br/><p><span style=\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\">Hearing his words, Zhou Weiqing’s heart trembled. The Devour Skill… Hui Yao had kept the Terror Sea Dragon… all for him to use the Devour Skill? </span></p><br/><p><span style=\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\">When they were still in the Lustre Spatial Realm, he had used the Devour Skill on both Hui Yao and Duo Si. However, that was just a very tiny portion of their power, fully under the control of both dragons. At that time, Hui Yao had said that after Zhou Weiqing’s Devouring, he would need a few years to recover. Now, it seemed like that was just a joke, to allow him to search for the Spatial Teleportation Gem without worrying too much. </span></p><br/><p><span style=\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\">It was exactly because he had once Devoured these two mighty Dragons before that Zhou Weiqing knew how terrifying a Dragon’s Heavenly Energy was. That was not just a mere tiny sum of energy! Furthermore, if he was using the Devour Skill on the Terror Sea Dragon, he did not even need to consider any qualms or scruples at all, and could just directly Devour its life force as well. The entirety of a Heavenly God Tier Heavenly Beast’s Heavenly Energy, life force and core primordial qi… what kind of terrifying power was that? Even for Zhou Weiqing, he found it hard to imagine it. </span></p><br/><p><span style=\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\">Hui Yao nodded to him and said: “Don’t stand around being amazed. Start now. I have already sent my senses through your body. Your cultivation has improved again, and your body has evolved to be strong and flexible enough… there should be no problems Devouring this Terror Sea Dragon. If the energy is too much, you can also share some with this little girlfriend of yours.” </span></p><br/><p><span style=\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\">Zhou Weiqing had never been a shy or conventional person, and he did not hide his excitement and joy. After bowing towards Hui Yao, he appeared in a flash in front of the Terror Sea Dragon. </span></p><br/><p><span style=\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\">When the Terror Sea Dragon saw Zhou Weiqing approach it, the venom in its eyes returned. Ever since it had met this human, it had been plagued with constant bad luck. What was he going to do now? </span></p><br/><p><span style=\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\">Before the Terror Sea Dragon could think more, a sudden pain on its neck, and a terrifying pressure caused it to have no chance to move at all, let alone resist. </span></p><br/><p><span style=\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\">In order to ensure Zhou Weiqing’s safety, to prevent the Terror Sea Dragon from possibly countering him, Duo Si also flew over to the other side of the Terror Sea Dragon, grabbing it in a painful grip to stabilize its position in the skies. </span></p><br/><p><span style=\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\">With the two mighty Heavenly God Tier Dragons wielding the full force of their pressure on it, let alone this Terror Sea Dragon, even if it were its big brother, or its father here instead, there would still be no difference. This was the absolute pressure of two Emperor Dragon bloodlines!</span></p><br/><p><span style=\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\">Zhou Weiqing flew all the way to the front of the Terror Sea Dragon before stopping; at the same time he motioned Shangguan Bing’er to hover by his side. As soon as the energy Devoured was too much, he would be able to infuse Saint Energy into Shangguan Bing’er’s body, to help him share some of it. </span></p><br/><p><span style=\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\">Although Zhou Weiqing’s cultivation stage had already reached nine Jewels, this trip to the Xuantian Continent could be said to be wracked with dangers. No matter entering the Xuantian Palace, or facing the Terror Sea Dragons several times… all of those powerhouses had the abilities to finish him off!</span></p><br/><p><span style=\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\">Now that he was about to return to the Boundless Mainland, he knew its current situation was even more complex and complicated than the Xuantian Continent. In the past, Zhou Weiqing might not have met so any powerhouses at once when compared to his time in the Xuantian Continent, but if one considered the total amount of powerhouses, the truth was the Boundless Mainland definitely had a far greater amount. Furthermore, there was still the owner of the Destruction energies; no one knew who he was or where he was hiding. Not to mention the future threat of the Nether Realm.</span></p><br/><p><span style=\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\">As such, he really needed to improve his own strength so much. With such a great opportunity in front of him, he would definitely not let it go. In this world, there were not many people with the same fortune as he had. </span></p><br/><p><span style=\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\">Just the Devour Skill alone meant he was matchless in the entire Boundless Mainland in that area… added on to the help of the two dragons. Even a top powerhouse like the Heavenly Snow Mountain Lord would not have met the same situation!</span></p><br/><p><span style=\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\">In the end, Zhou Weiqing simply stood on the Terror Sea Dragon’s massive head, his hands extended, each grasping one of the sharp spikes on its head that hadn’t been broken. </span></p><br/><p><span style=\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\">These spikes could once shoot off the terrifying water attribute shots. Alas, with Hui Yao and Duo Si pressuring it and keeping it under control, they were like dead objects. </span></p><br/><p><span style=\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\">Zhou Weiqing drew in a deep breath, letting himself calm down first. At the same time, he began to circulate the Saint Energy in his body first in preparation.</span></p><br/><p><span style=\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\">He did not rush into using the Devour Skill, as he knew the incoming flow of power would just be too huge. If he was not careful, it might actually have an adverse effect. Zhou Weiqing was an intelligent person, and he would not make such an obvious error in judgement. </span></p><br/><p><span style=\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\">It took him nearly fifteen minutes before Zhou Weiqing brought his entire body and powers to tip top condition, staying in the Dragon-Tiger Transformation state. A silver-white light was shimmering faintly under the surface of his skin, the creation aura of the Saint Energy releasing from his body. </span></p><br/><p><span style=\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\">The feeling of this power did not seem very distinct or powerful, but there was a breadth, a gentle strength to it. As the energy circulated, even the Terror Sea Dragon that was about to be Devoured did not sense any threat. It just did not understand what Zhou Weiqing was trying to do. However, in the next instant, it was sent sinking into abject terror. </span></p><br/><p><span style=\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\">The gentle silver-white light abruptly changed colour, and a vague illusory figure began to appear behind Zhou Weiqing’s back. It was the image of the Demon God. </span></p><br/><p><span style=\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\">Zhou Weiqing’s hands had turned a pure grey, and a thick grey light was swirling about in the air. A thick Demonic Attribute aura spread out, giving forth a terrifying pressure, as a suction force appeared at Zhou Weiqing’s hands, beginning to draw out the pure Heavenly Energy from within the Terror Sea Dragon and into Zhou Weiqing’s body. </span></p><br/><p><span style=\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\">When one’s cultivation reached the Heavenly God stage, the Heavenly Energy in their body would be at the purest form. The entire Terror Sea Dragon’s body was like a massive energy block. Even with the support of his nine-Jeweled Saint Energy, although Zhou Weiqing’s Devouring speed was quite fast, compared to the vast amounts of energy in the dragon’s body, it was like a slow trickle. </span></p><br/><p><span style=\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\">Just like what Hui Yao had said earlier, the current body of Zhou Weiqing was far above what he had previously. Although at the time Zhou Weiqing had managed to Devour the Heavenly Energy from the two Dragons to increase his cultivation to the nine-Jeweled stage, that was just a direct increase, reaching the ultimate limit that his body could withstand. </span></p><br/><p><span style=\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\">As his Immortal Deity Technique had completed, his Saint Energy had completed a circulation path within his body. Now, a year after the Devouring, Zhou Weiqing’s body had constantly been improved and evolved by the Saint Energy. In this process, his body had not only grown stronger, but cleansed and purified. All the impurities in the body were constantly assimilated or destroyed, expelled from the body. It could be said that the current Zhou Weiqing’s internal primordial qi was as clean and pure as that of a baby. Just his body alone and its toughness… even many Heavenly Kings or Heavenly Emperors would not be able to match it. </span></p><br/><p><span style=\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\">This was one of the more important reasons why he had managed to survive without any serious injuries when he had first faced up against the Terror Sea Dragon. </span></p><br/><p><span style=\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\">As the body constantly improved and evolved, the meridian channels were naturally one of the most important areas as well. Currently, the sheer power that his meridian channels could transport was astonishing, able to even withstand pure power in the solid state!</span></p><br/><p><span style=\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\">The Saint Energy was the strongest attribute that could even ‘steal’ the power and fortune of the world, and how could its effect be compared to any ordinary energies? Furthermore, Zhou Weiqing also had the fusion bloodline of the Emperor Dragon bloodlines and the </span><span style=\"color: rgb(0, 0, 0); font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\">Dark Demon God Tiger Bloodlines. Not long ago, his Dark Demon God Tiger Bloodline had even evolved in a baptism of fire from the Demon God, allowing his Saint Energy to rise to a whole new height. </span></p><br/><p><span style=\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\">Under such a circumstance, Zhou Weiqing’s cultivation could be said to be slowly and steadily increasing day by day in a subtle manner. His body’s toughness had also reached a state where even he was unclear about the limits.</span></p><br/>\n</div>"}