{"title": "Chapter 254: Possession of the Demon God (2)", "id": 254, "volume": 3, "url": "http://boxnovel.org/heavenly-jewel-change-chapter-254-possession-of-the-demon-god-2", "volume_title": "Volume 3", "body": "<h1>Chapter 254: Possession of the Demon God (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Given that the Terror Sea Dragon was able to train to the Heavenly God stage, it wasn’t a fool. It was afraid of death, yes, but it wasn’t a fool. Dongfang Hanyue had charged here to rescue Zhou Weiqing – this much was obvious. It had been caught flat-footed by Dongfang Hanyue’s attacks, and what it needed was a chance to regain its footing. Sometimes, the best defense was a good offense. This all-out attack was primarily focused on Zhou Weiqing. Either this attack would succeed in forcing Dongfang Hanyue backwards, or it would succeed in destroying a potentially dangerous threat.</p><br/><p>Although the Terror Sea Dragon was disdainful of Zhou Weiqing’s cultivation level, the Dragon Emperor Bloodline aura emanating from his body caused the Terror Sea Dragon to feel extremely nervous.</p><br/><p>Indeed, when she saw the Terror Sea Dragon suddenly switch its attacks to Zhou Weiqing, Dongfang Hanyue abandoned her attacks and instead used flapped wings to fly over to Zhou Weiqing and protect him. The Tenebrous Dragon Slayer Spear in her hand spun like an impenetrable whirlwind, becoming a red ‘shield’ which blocked all of the dragon’s attacks.</p><br/><p>The spear was incredibly powerful, but it also used up an enormous amount of Heavenly Energy. Now that it was being used to defend in such a manner by Dongfang Hanyue, her own Heavenly Energy began to drop rapidly.</p><br/><p>Her eyes, hidden behind the mysterious mask, had turned hard and incisive. If this continued, both of them would probably die here. They couldn’t continue this fight. They had to leave first. The Terror Sea Dragon wasn’t a true threat; once the Tenebrous Demon Dragon recovered, she would join forces with it to slay this thing.</p><br/><p>As she came to this conclusion, Dongfang Hanyue used her right arm to brandish the Dragon Spear while using her left arm to grab Zhou Weiqing and take him with her as she fled. Given her cultivation, if she fled at full speed not even the Terror Sea Dragon would necessarily be able to stop her from fleeing with its attacks. They were fairly close to the Xuantian Continent, after all.</p><br/><p>However… when she grabbed Zhou Weiqing, something queer happened. A supremely cold sensation appeared behind her back, and it caused Dongfang Hanyue to shiver uncontrollably. She nearly lost control over the defensive web she was weaving with the Dragon Spear.</p><br/><p>It must be remembered that she was dressed in the full Tenebrous Demon Dragon Set. For her to be fully armored and yet still shiver due to a cold aura… one could imagine how terrifying that energy was!</p><br/><p>A moment later, the cold, Demonic Attribute-filled energies behind her suddenly vanished. However, she couldn’t look backwards and so she didn’t see how Zhou Weiqing had changed.</p><br/><p>Moments earlier, when she had grabbed Zhou Weiqing, his body had finally stopped alternating between those ephemeral flashes of gray light. Behind him appeared a gray figure that was just as tall as he was, and it took a step forwards and merged into his body.</p><br/><p>Right at this moment, the Hate Ground No Handle Set on his body changed. Its dark-gold color changed to become a translucent, crystalline gray. His entire aura underwent an utterly earthshaking change as well.</p><br/><p>Lonely, ancient, cold, remorseless… and boundlessly evil.</p><br/><p>In this instant, Zhou Weiqing’s eyes finally opened. His eyes were filled with that unlimited evil gray, and he himself seemed to be bathed in evil.</p><br/><p>He stepped forward, moving out from behind Dongfang Hanyue. His body had been completely changed as well. The Dual Legendary Warhammers in his hands had actually transformed into a gray liquid that instantly merged into his arms, while the Yin-Yang Giant Spirit Palms also transformed. The right side transformed into a tiger paw, while the left side transformed into a draconic claw. He had instantly transformed to become much larger. He had actually gone straight into the second mode of the Dragon-Tiger Transformation, ‘Like Dragon Equivalent Tiger’.</p><br/><p>His right leg still transformed into a hook, but this time it was a completely gray hook. A wave of gray light instantly burst out of his body, transforming him into a gray meteor that smashed straight towards the Terror Sea Dragon.</p><br/><p>This time, he didn’t have the terrifying aura of the Demon God… but when he flew forwards, the Water Attribute energies in his path which had previously stifled him actually melted away on their own, revealing a truly empty ‘tunnel’ in the skies.</p><br/><p>By the time Dongfang Hanyue saw him, he had already traversed nearly half the distance to the Terror Sea Dragon. His entire body lashed out in a strange arc, using some sort of simply inconceivable movement to spin around and launch a vicious kick with his right leg against the Terror Sea Dragon.</p><br/><p>After entering the ‘Like Dragon Equivalent Tiger’ mode, all of Zhou Weiqing’s physical attributes had increased by a terrifying amount. In this state he was unable to use the vast majority of his techniques, but his physical prowess had risen to an utterly terrifying level.</p><br/><p>The Terror Sea Dragon’s attention had been completely focused on Dongfang Hanyue. Zhou Weiqing’s sudden attack had caught it completely by surprise. However, as a Heavenly God powerhouse it still was able to quickly react with an absolutely explosive level of power.</p><br/><p>The Water atmospheric energies instantly condensed, transforming into many barriers of ice that appeared in front of Zhou Weiqing. At the same instant, the Terror Sea Dragon’s enormous body swiveled violently, sending its thick draconic tail smashing out at Zhou Weiqing.</p><br/><p>“You dare!” Dongfang Hanyue turned pale. She naturally knew just how much power a physical attack from a Heavenly God powerhouse possessed. She poured out the Heavenly Energy from her body, using almost all of the power in her core essence and filling the Dragon Spear with it. The Dragon Spear then shot out like a bolt of red lightning that hurtled towards the Terror Sea Dragon.</p><br/><p>The blood-red Dragon Spear dramatically increased in size, expanding to become thirty meters long. It hurtled down through the skies like a flash of bloody lightning, carrying an aura of indomitable sharpness.</p><br/><p>However, Dongfang Hanyue was just a bit too slow. The red lightning simply couldn’t catch up to Zhou Weiqing’s speed or the Terror Sea Dragon’s attack.</p><br/><p>The Terror Sea Dragon chose to steel its resolve. It had to first kill Zhou Weiqing, even if it meant fleeing with heavy wounds. This was the ocean, after all. Without the Tenebrous Sealing Formation, it could leave whenever it wanted and there would be no way Dongfang Hanyue could stop it.</p><br/><p>The previous Zhou Weiqing would’ve been frozen in midair by the awesome freezing energies. But… the current Zhou Weiqing was clearly in a very strange and marvelous state. When the freezing energies around him touched that blurry layer of gray light, they vanished on their own without being able to impede him in the slightest. Moments later, his attack slammed right into the Terror Sea Dragon’s thick tail.</p><br/><p>Zhou Weiqing’s right leg and the Terror Sea Dragon’s draconic tail were on completely different levels of size, but when they collided against each other they actually produced an absolutely shocking explosion.</p><br/><p>Zhou Weiqing’s body was blasted away like a cannon ball and sent flying into the air. But… but! Dongfang Hanyue stared wide-eyed at what she saw before her.</p><br/><p>After blasting Zhou Weiqing away, the Terror Sea Dragon actually froze in its attack pose. Even when the Dragon Spear pierced through its body, leaving behind an enormous gaping wound, it still maintained that frozen pose.</p><br/><p>Moments later, a thunderous explosion rang out yet again. This time, it actually came from the Terror Sea Dragon’s body.</p><br/><p>Its thick, powerful draconic tail actually exploded as a fist of gray light blasted it apart, sending blood and flesh flying everywhere. More than a third of its entire tail had been blasted apart.</p><br/><p>A horrified, agonized howl rang out from the Terror Sea Dragon’s maw. Its vast body instantly dove deep into the ocean, not hesitating in the slightest. Protected by an awesome tidal wave, it began to flee for its life.</p><br/><p>Even a Heavenly God powerhouse would suffer heavy injuries when struck by these combined full-strength attacks from Zhou Weiqing and Dongfang Hanyue. Why would this cowardly creature even pause for a second?</p><br/><p>Dongfang Hanyue flashed over to the midair Zhou Weiqing. She reached out to touch him. By now, the gray aura had completely vanished from his body. Even his Legendary Set had vanished, and his face was as pale as paper, while his aura was almost gone. Beads of blood were dribbling out of his mouth. Thankfully, his heartbeat remained strong and vigorous. Otherwise, Dongfang Hanyue would’ve believed him to be dead.</p><br/><p>Holding onto his body, she carefully tested pouring her own Heavenly Energy into him. However, she was absolutely shocked by what she found.</p><br/><p>The thirty-six Death Acupuncture Points in his body were slowly swiveling. As soon as her Heavenly Energy entered his body, it was instantly assimilated into Saint Energy. And, judging from his internal condition, Zhou Weiqing’s internal organs and meridians were actually completely unharmed. He was simply suffering from agitated blood and energies. That silver-white energy was constantly roaming his body, protecting it from harm.</p><br/><p><em>How did he do this?</em> Dongfang Hanyue stared at the man in her arms, completely lost. <em>That strike just now… it had to be just as strong as my own strike with the Tenebrous Dragon Slayer Spear.</em><em> What was that gray light?</em> Even though he was now unconscious, his attack had clearly caused a Heavenly God-stage Heavenly Beast to be injured! What type of level of power had this person reached?!</p><br/><p>……</p><br/><p>By the time Zhou Weiqing slowly woke up, he discovered that he was on a wooden bed. He himself didn’t know how long he had been sleeping for. This seemed to be a very ordinary wooden room, and it actually stank of fish.</p><br/><p>His mental strength restored, the first thing he did was to examine his body. <em>I broke through?</em> This was Zhou Weiqing’s first reaction. Indeed. The Saint Energy in his body had actually broken through the thirty-eighth stage, and so he was now officially at the second stage of Heavenly Dao Energy.</p><br/><p>It must be understood that after gaining Heavenly Dao Energy, each new stage represented an enormous advance. This was particularly true after the fortieth stage, where each stage represented an entirely different level.</p><br/><p>It had been just a few short months, but he had actually broken through yet again. Even though this came at a price of having to face numerous powerful opponents, he was still alive. Being alive was a victory of its own.</p><br/><p><em>As badass as ever!</em> Zhou Weiqing couldn’t help but smile smugly. He lay there, not even moving. Although his Saint Energy had recovered, his head was killing him. Even trying to think simple thoughts made him feel as though his brain was being stabbed by needles.</p><br/>\n</div>"}