{"title": "Chapter 275: Spring Arrives for Little Fatty Zhou (2)", "id": 275, "volume": 3, "url": "http://boxnovel.org/heavenly-jewel-change-chapter-275-spring-arrives-for-little-fatty-zhou-2", "volume_title": "Volume 3", "body": "<h1>Chapter 275: Spring Arrives for Little Fatty Zhou (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>He had no choice but to eat breakfast alone before returning to his room. With his current status in the Heavenly Bow Empire, nobody dared to disturb him if he did not wish it. </p><br/><p>Zhou Weiqing did not look for his significant others - he could guess that the women probably had certain things they wanted to talk about in private. Not wanting to meet him was probably Shangguan Xue’er and Fei’er’s wish; they were still rather shy. </p><br/><p><em>Will anyone accompany me tonight?</em> As he was thinking about ‘it’, Zhou Weiqing’s heart was itching more than ever. He let out a long sigh while looking up, “I am all alone ——, I am lonely ——, I am itching to do it ——”</p><br/><p>After venting his inner emotions, he closed the door. He had proper business to attend to today - completing the final consolidation of the ‘Hate Ground no Handle’ Set.</p><br/><p>Even though he was equipped with Nebula Saint Energy and he couldn’t be more familiar with Consolidating Equipment Scrolls, he was still very nervous. As a God Tier Master, he knew clearly what a fully completed Legendary Set meant. Its power would be doubled at a minimum! This was especially true since his ‘Hate Ground no Handle’ Set was a ten-set piece which was perfectly matched for the Affinity of his power. Once it was completed, one could well imagine what it would do to the advancement of his cultivation. </p><br/><p><em>I’ve waited for this day for years</em>. Of course, he could only say this to himself. If other Heavenly Jewel Masters heard that, they would definitely want to beat him up. It had been less than ten years from the time Zhou Weiqing started cultivating till now, and he was now about to put on the final piece of a Legendary Set. It was hard to say for sure with regards to what would happen in the future, but in the world of Heavenly Jewel Masters, he was definitely the first in history to accomplish this.</p><br/><p>He carefully retrieved the wooden box of the last Consolidating Equipment Scroll and placed it on the table in front of him. Zhou Weiqing’s face looked solemn. </p><br/><p>Facing in the direction of the place where Senior Uncle resided in, he respectfully took a bow. Thereafter, he opened the wooden box.</p><br/><p>The paper that the tenth Consolidating Equipment Scroll used was much larger than the average Consolidating Equipment Scroll, because the embossed pattern of the paper was too complicated. Before Zhou Weiqing became a Heavenly Emperor, he was very sure that even if he relied on all his time, space as well as Saint Energy, it would still be impossible to create such a Consolidating Equipment Scroll. The required skills needed to complete it were not dependent on external forces. </p><br/><p>This represented the fruit of his Senior Uncle’s labor, as well as his sweat and blood. Zhou Weiqing held the scroll in his hand; with a thought, his eleven Personal Core Jewels began to hover in the air. </p><br/><p>The eleven Personal Core Jewels had already almost completely filled his wrists. Strong Saint Energy ripples filled the entire room with a layer of contrasting faint reddish golden light. </p><br/><p>The Consolidating Equipment Scroll in Zhou Weiqing’s hand had probably sensed Zhou Weiqing’s Saint Energy - it emitted a faint dark golden light on its own, and the nine Physical Jewels of the ‘Hate Ground no Handle’ Set that Zhou Weiqing consolidated subconsciously let out a humming sound, as though they were cheering for the addition of their last comrade. </p><br/><p>After taking a deep breath, Zhou Weiqing no longer hesitated - he finally executed the final step.</p><br/><p>The eleventh Physical Pearl, representing the Heavenly Emperor Stage Cultivation, floated in the air and quietly rose under the sparkling reddish golden light. </p><br/><p>Immediately after, Zhou Weiqing flicked his wrist. Divine light shot out of his eyes, and the Consolidating Equipment Scroll in his hand immediately transformed into a dark golden light ray that then headed straight for that Physical Jewel.  </p><br/><p>Dense Saint Energy waves instantly started to ripple violently within the room. At this moment, if anyone wanted to disturb Zhou Weiqing, they definitely would not be able to do it unless their cultivation base was higher than his.</p><br/><p>At some point in time, Six Ultimate Heavenly Emperor Long Shiya quietly arrived outside Zhou Weiqing’s door - he even brought a small stool with him. He sat to one side; holding a wine pot with his left hand, while popping peanuts into his mouth with his right hand. He couldn’t look more carefree and relaxed. However, if anyone wanted to test their luck by approaching the room, he or she would have to first experience Six Ultimate Heavenly Emperor’s renowned Six Ultimate Skill Manipulation Formation. </p><br/><p>A long time ago, back when Zhou Weiqing was still at his Two Jeweled cultivation base, the consolidation of Physical Jewels had already become a rather easy feat for him. At that time, he depended on his own several Attributes as well as the powers of the Dark Demon God Tiger Bloodline in order to successfully consolidate with just one Consolidating Equipment Scroll.</p><br/><p>As for the current Zhou Weiqing, all he relied on was the Nebula Saint Energy. Even though Zhou Weiqing’s Saint Energy was not as pure as the one emitted by the child in Tian’er’s womb, it was still one of the purest in the world. With the help of the Nebula Saint Energy, consolidation would not be an issue. </p><br/><p>An hour flew by.</p><br/><p>Long Shiya sat outside. He suddenly stopped drinking his wine and stood up abruptly before looking in the direction of Zhou Weiqing’s room. His calm gaze sharpened immediately.</p><br/><p>As the owner of the ‘Hate Sky no Handle’ Set, of course he would hope to see the finished product of the ‘Hate Ground no Handle’ Set.</p><br/><p>At this moment, there were no more energy ripples coming in the direction of Zhou Weiqing’s room. The door opened, Zhou Weiqing’s huge figure appeared in Long Shiya’s line of sight. </p><br/><p>“Master.” Zhou Weiqing already knew that Long Shiya was outside. He walked outside, all smiles, but Long Shiya could already see the excitement behind the smile that Zhou Weiqing was trying hard to stifle. </p><br/><p>“It’s done?” Long Shiya asked impatiently. </p><br/><p>Zhou Weiqing chuckled and said, “Do you think it’s possible for your disciple to fail? Now I’m even more eager to see Senior Uncle developing the eleventh scroll. Consolidating the tenth one was nothing to me!”</p><br/><p>“Would it kill you to stop boasting? Quick, show me how the ‘Hate Ground no Handle’ Set looks like.”</p><br/><p>The completed Legendary Set was definitely different from before - not only its physical form underwent certain changes, its own color would be released as well. Just like Long Shiya’s ‘Hate Sky no Handle’ Set, it was bright silver. </p><br/><p>Zhou Weiqing chuckled and said, “Master, in that case you’d better not get jealous. Look carefully.”</p><br/><p>As he spoke, a dazzling golden light suddenly burst out from Zhou Weiqing’s body. His Consolidating Equipment God Protective Aura’s color actually changed - it was originally dark gold but it became bright gold instead. Immediately after, one by one, the components of the ‘Hate Ground no Handle’ Set started appearing on his body. </p><br/><p>Every part of the ‘Hate Ground no Handle’ Set was a combination of power and beauty. The dazzling golden light sparkled and blended together.</p><br/><p>Long Shiya was dumbstruck. He mumbled, “It’s actually gold in color; it’s way too flashy.”</p><br/><p>Indeed, Zhou Weiqing’s 'Hate Ground no Handle’ Set could definitely be described as ‘flashy’. When all the components appeared on Zhou Weiqing’s body, the air around him clearly sunk on its own. When Zhou Weiqing’s body moved by unintentionally, a layer of faint black light would appear within the space surrounding his body - that was clearly a “black hole” created when the space was being cut apart. </p><br/><p>This was one of the special effects gained by the ‘Hate Ground no Handle’ Set after it was fully assembled. There would always be a layer of collapsed space similar to a black hole around its bearer. Any attack from an opponent would become dramatically weakened as a result!</p><br/><p>Patterns also appeared on the completed ‘Hate Ground no Handle’ Set which was previously absent. On top of the bright gold armor, the patterns were actually roses in different shades of gold depending on lightness and darkness of the surroundings, making the Legendary Set even more gorgeous. </p><br/><p>This was definitely the most beautiful Legendary Set which Long Shiya had ever seen. Not even Heavenly Snow Mountain Lord Xue Aotian’s God Vanquishing Heavenly Spirit Set were as beautiful as Zhou Weiqing’s ‘Hate Ground no Handle’ Set.</p><br/><p>What was more alluring was that after this Legendary Set was completed, a huge scarlet cape draped down Zhou Weiqing’s back. With it being present, the entire set could no longer be described as merely ‘flashy’. A bright gold armor with a scarlet cape - no matter where he went, it would be the center of attention!</p><br/><p>“Master, do you feel that I am like the brilliant sun, causing all things radiant to be overshadowed by me?” Zhou Weiqing was very pleased with himself. </p><br/><p>Long Shiya replied bluntly, “Give me a break. The sun? More like a friggin’ dandelion.”</p><br/><p>The massive hammers in Zhou Weiqing’s hands similarly underwent changes. They were originally already very huge, but now they were even bigger - the top of them had a smiley face and crying face flashing alternately on it. The hammers also each had the mark of a rose right above their heads. </p><br/><p>Looking at the hammers, Long Shiya was rather embarrassed to reveal his own bright silver octagon plum blossom hammers. Compared to the ‘Hate Ground no Handle’ Set, his ‘Hate Sky no Handle’ Set was like a bastard stepchild. </p><br/><p>“The dark, shadowy rose design was most likely left behind by the senior who created the ‘Hate Ground no Handle’ Set when he was professing his love to his lover.”</p><br/><p>Duan Tianlang’s voice rang out. No one knew when he had arrived outside Zhou Weiqing’s room, and one could tell from his voice that he was deeply moved.</p><br/><p>As a God Tier Master, how could he not have felt the energy ripples from the Legendary Set the moment it was completed?</p><br/><p>Zhou Weiqing respectfully bowed towards Duan Tianlang. “Thank you, Senior Uncle.”</p><br/><p>Duan Tianlang chuckled and said, “Don’t listen to your master, this ‘Hate Ground no Handle’ Set looks remarkably heroic on you. I trust you. You will definitely perfectly bring out its might and power. When we have completed the eleventh piece, not even the Boundless Infinitum Set would be able to compare to it. </p><br/><p>The two hammers in Zhou Weiqing’s hands gently moved. Immediately, the surrounding area was covered with darkness in a flash - that was the sight of space itself collapsing.</p><br/><p>After the ‘Hate Ground no Handle’ Set was completed, the amplification of power it contributed was so overwhelming that not even space itself was able to bear it. Under such circumstances, any forces that wanted to attack Zhou Weiqing would first have to challenge this difficult obstacle. </p><br/><p>Long Shiya looked miserably at Duan Tianlang, “Buddy Duan, I am jealous. Quick, help me do some research on the eleventh piece of the ‘Hate Sky no Handle’ Set too. How about that?”</p><br/><p>Duan Tianlang rolled his eyes and said, “You think it’s that easy? Send me straight to my coffin instead. Compared to the ‘Hate Ground no Handle’, your ‘Hate Sky no Handle’ no longer interests me. Just suck it up.”</p><br/><p>“Do you have any compassion!?!”</p><br/><p>“None whatsoever.”</p><br/>\n</div>"}