{"title": "Chapter 274: Do 'It' With Me For a Breakthrough! (1)", "id": 274, "volume": 3, "url": "http://boxnovel.org/heavenly-jewel-change-chapter-274-do-it-with-me-for-a-breakthrough-1", "volume_title": "Volume 3", "body": "<h1>Chapter 274: Do 'It' With Me For a Breakthrough! (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>However, Shangguan Xue’er and Shangguan Fei’er could feel that the Heavenly Core Nucleus which Shangguan Bing’er was going to condense might not be the same as Zhou Weiqing’s Astral Core Nucleus. That was because of the fact that even though Shangguan Bing’er’s aura was full of the power of Saint Energy, it did not have the same pure aura that Zhou Weiqing emitted. Within her Saint Energy, there was clearly the presence of Wind Attribute energy. </p><br/><p>Evidently, this was because she did not possess Saint Attributes. Without Saint Attributes, it would be impossible to achieve the actual Saint Core Nucleus. </p><br/><p>Of course, this was not to say that Shangguan Bing’er would be weak. Zhou Weiqing’s nurturing of her had not been in vain. When she was condensing the Heavenly Core Nucleus, her body was filled with Zhou Weiqing's Astral Saint Energy. That alone guaranteed that her Heavenly Core Nucleus could not be compared to that of other Heavenly King powerhouses.</p><br/><p>Additionally, to Shangguan Bing’er, even if her Heavenly Core Nucleus was not filled with pure Saint Energy, but managed to condense into a Heavenly Core Nucleus anyway, it was considered a huge advantage. This was because after a Heavenly Core Nucleus was formed, she could take in the atmospheric energy at her will to supplement her self-cultivation, and would not need to borrow Zhou Weiqing’s Saint Energy to cultivate.</p><br/><p>In other words, even though her Saint Energy was impure, it would still be considered a type of Saint Energy. Hence, she could condense it by filtering in external energy. In a sense, Shangguan Bing’er’s Saint Core Nucleus would be an sub-Saint Core Nucleus, which was a lot better than most people in the Heavenly King Stage had. </p><br/><p>Right at this moment, without any warning at all, the space in front of the two women became silently distorted as two giant hands came clawing in their direction at the same time.</p><br/><p>Shangguan Xue’er and Shangguan Fei’er had already broken through to the nine jewel cultivation base, and their own powers were originally strong. They reacted fast enough, and just as they were about to display their skills by launching an attack, the surrounding space caved in instantly. A strong spatial force bound them, causing them to be completely immobilized. </p><br/><p>A familiar figure stepped out of the distorted space, kissing each of them on their red lips hard. Only then were the two women released. The caved in space naturally returned to its normal state. </p><br/><p>Shangguan Xue’er and Shangguan Fei’er were initially pale with fright, thinking they had encountered a strong enemy. However, when they took a good look at the other party, they were immediately furious - the person who stole a kiss from them was none other than that scoundrel Zhou Weiqing.</p><br/><p>Zhou Weiqing smiled mischievously at the two women and said, “My two wives, why aren’t you greeting your husband when he’s here?” </p><br/><p>Shangguan Fei’er sneered, “Who are your wives? Give me a break, hmph.”</p><br/><p>Shangguan Xue’er did not say anything but continued to wear a ‘cold’ expression on her face.</p><br/><p>A helpless look on his face, Zhou Weiqing went over to them, “What are you guys up to! If there’s anything you are not happy about, you should tell me directly. Don’t bottle it up! It’s my fault, I had too many things to deal with recently and ended up neglecting the both of you. If you want to beat me up or reprimand me, I will take it.”</p><br/><p>Shangguan Fei’er snorted and said, “Neglected us? You probably only neglected us for a day or two. Ever since you built Peerless Battalion, I’ve been working myself to death. But you, on the other hand, disappear as you please. I can accept all of this. However, let me ask you, what’s with Little Witch? Also, what was with the Heavenly Demon Sect the other day? You better explain all of this to me, or else when third sister is done with her breakthrough, the three of us will go back to Heaven’s Expanse Palace.”</p><br/><p>Zhou Weiqing looked at the furious Shangguan Fei’er and ran over in a bid to hug her, but she pushed him away. Even though Shangguan Xue’er did not say anything, there was a quizzical look in her eyes as well. </p><br/><p>Zhou Weiqing scratched his head and replied, “Can the two of you let me explain? The thing with Little Witch goes like this.” Zhou Weiqing was smart - he knew for a fact that a white lie could produce good results at times, but he also knew that sometimes he needed to be honest instead, or else he might really lose their hearts. </p><br/><p>Immediately, he truthfully told them what had happened between him and Little Witch. Of course, he heavily emphasized his situation at that time, as well as the danger he was put in, and that he was not in the right state of mind when things happened with Little Witch. On the whole, he spoke nothing but the truth.</p><br/><p>“……Ugh. Both of you also know that even though I am not a good person, I still have to take responsibility for what happened! She sacrificed her most precious thing for the sake of my cultivation and my life, and there’s also the connection to my master… It’s my fault for not being able to find you guys in time, or else I wouldn’t have needed Little Witch. Master told me at that time that I was pretty lucky to be able to find a woman. He said he was planning on finding me a sow.”</p><br/><p>After hearing Zhou Weiqing’s last sentence, the Shangguan sisters couldn’t help but laugh out loud. They were simply unable to stifle their laughter as they imagined the sight of Zhou Weiqing with a sow. Thanks to their laughter, the tense atmosphere among the three of them eased up significantly. </p><br/><p>Shangguan Fei’er stared hard at Zhou Weiqing, “Continue womanizing everywhere if you dare, you bastard. You already have five women. Let me tell you, if you have a sixth woman, I will castrate you.” She gestured with all her might as she said that. </p><br/><p>Zhou Weiqing immediately covered the lower part of his body in fear. “I dare not, Your Majesty. I definitely dare not go against your wishes.”</p><br/><p>Shangguan Xue’er furrowed her brows and said, “What’s with Heavenly Demon Sect? Explain everything to us, including their confrontation with Blood Red Hell. You’ve allowed the people of Heavenly Demon Sect to stay in Heavenly Bow Empire, and from the looks of it, you seem to want to join them as well. Weiqing, even if you don’t consider the fact that we are from Heaven’s Expanse Palace, you should know that their reputation on Mainland isn’t that good. None of the countries were willing to admit them. Do you want Heavenly Bow Empire to become the target of criticism?”</p><br/><p>Zhou Weiqing smiled and ran up to her before forcefully pulling Shangguan Fei’er into his arms while also dragging Shangguan Xue’er in. “I didn’t agree to join Heavenly Demon Sect. If I were to join a Saint Land, I will definitely choose Heaven’s Expanse Palace! All three of my wives are from there.”</p><br/><p>Shangguan Xue’er allowed him to hug her but her facial expression did not change, “Weiqing, with regards to this matter, you definitely have to make things clear. Perhaps you yourself don’t care about matters of reputation, but the Heavenly Bow Empire has to. I dare say that if news about the Heavenly Bow Empire admitting the Heavenly Demon Sect gets out, the resources supplied by the Fei Li Empire would probably stop. Additionally, we would also become ostracized.”</p><br/><p>Zhou Weiqing smiled. “There will never be a Heavenly Demon Sect in our Heavenly Bow Empire. Xue’er, I am not joking with you. That reminds me. I have something else I need to discuss with you guys. I want to invite my two beautiful ladies to join the newly established Peerless Sect, as the Sect Leader’s wives, what do you think?”</p><br/><p>“Peerless Sect?” Shangguan Xue’er looked at him with a puzzled face.</p><br/><p>Zhou Weiqing nodded, “Yes! Peerless Sect. I am Peerless Sect’s Sect Leader, and my master Six Ultimate Heavenly Emperor is our Peerless Sect’s Grand Elder. All the brothers from Peerless Regiment that have a cultivation base of at least six jewels will form the congregation. Although with regards to the higher end strength and power, we are still on the weak side, but I dare say that after Peerless Sect is established, we would have the highest defense against Jewel Masters among all the Saint Lands.”</p><br/><p>Shangguan Fei’er’s eyes lit up immediately, “Little Fatty, you want to establish a Saint Land? That sounds fun! Are you sure you can do it?”</p><br/><p>Zhou Weiqing kissed her on the nose, “How can a man say that he can’t do it? Don’t forget, your husband is already a Heavenly Emperor. Additionally, given the cultivation base of my Saint Energy, no ordinary Heavenly Emperor could surpass me. Why wouldn’t I be qualified to establish a Saint Land? Our foundation will be slowly established and strengthened. Also! I need to tell you guys that Heavenly Demon Sect had already been expunged from the world. From today onwards, they do not exist. There is only the Peerless Sect.”</p><br/><p>Zhou Weiqing had made it quite clear. If the two women still did not understand, they would not be fit to be the descendants of Heaven’s Expanse Palace.</p><br/><p>Shangguan Xue’er had always been calm, but at this moment, her cherry lips opened up - she had a shocked look on her face.</p><br/><p>Zhou Weiqing kissed her on her pink lips. He thought of how she looked the first time he had mistakenly kissed Shangguan Bing’er and got a hard slap from her as a result. His heart felt warm.</p><br/><p>“Do you especially admire your husband?” Zhou Weiqing laughed cheekily. </p><br/><p>Shangguan Xue’er looked at him, “Y-You actually took over the Heavenly Demon Sect? How could they agree?!” </p><br/><p>Zhou Weiqing was pleased with himself, “This is what power truly means. Do you know why the Demonic Emperor came to the Heavenly Bow Empire? At that time, I was not yet a Heavenly Emperor, so he invited me to join the Heavenly Demon Sect… not as a member, but to take over his position as Sect Leader. This alone shows that the Demonic Emperor is a lot more sincere than your uncle. But I did not agree. One reason was because of you guys, while the other was because of the problems with the Heavenly Demon Sect itself.”</p><br/><p>“I have always planned to establish a Saint Land - a man should always have his own career. Once everything has calmed down in Mainland, we need a place to call our home. Once you marry me, master of a Saint Land, I will treat you very well.”</p><br/><p>Seeing the continued looks of disbelief on the faces of the two women, Zhou Weiqing felt quite resigned. “Honestly, it’s understandable for you two to not believe it. Even though the Heavenly Demon Sect has declined in power, they still have a Heavenly Emperor and six Heavenly Kings. Do you guys feel that I’m still not strong enough to subdue them?”</p><br/><p>Shangguan Xue’er did not make a sound. Shangguan Fei’er nodded her head without hesitation - she did not have the need to mask her thoughts towards Zhou Weiqing.</p><br/>\n</div>"}