{"title": "Chapter 283 - The Evolved Ancient Tree of Life (2)", "id": 283, "volume": 3, "url": "http://boxnovel.org/heavenly-jewel-change-chapter-283-the-evolved-ancient-tree-of-life-2", "volume_title": "Volume 3", "body": "<h1>Chapter 283 - The Evolved Ancient Tree of Life (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Looking at Zhou Weiqing's shocked face and the extreme worry in his eyes, a gentle smile appeared on her beautiful face, “Don't worry. I'm only saying that it is possible. In reality, the sidhe definitely will not do that. In fact, I will control the amount of vitality that the ancient tree of life emits, such that the members of our tribe will not become too powerful. Power begets ambition, which can bring about a destructive catastrophe upon the sidhe.”</p><br/><p>Why?” asked Zhou Weiqing, rather puzzled. </p><br/><p>Because of you.” The Sidhe Queen answered without any hesitation, “If the ancient tree of life evolved without you in the picture, perhaps I might choose to do what I mentioned earlier, and I also believe that we have a high chance of succeeding. However, because of you, I will not do that. Be it my personal debt of gratitude or my tribe's debt of gratitude to you, if I do that, it will only bring about destruction upon the sidhe.”</p><br/><p>The sidhe has lived here for far too long - we have already gotten used to the peace and comfort here. We do not enjoy massacres and are even more unwilling to take part in disputes. Even with the evolution of the ancient sidhe tree, it will still be the same. Besides, even though we did harbor hatred towards human beings before, didn't the ancient sidhe tree evolve because of you, a human being? We can’t possibly bite the hand that fed us. You will always be the sidhe's benefactor, be it now or in the future. Furthermore, I can see your future - you will truly be standing at the top of this world. Don't forget that the Life Saint Energy that I possess, as well as the evolution of the ancient tree of life, could only happen because of you alone. Hence, there is absolutely nothing for you to be worried about. The ones who should be worried are my tribe and I. The creation of life is only but a small part of the creation of the entire world. While it is an important part, it cannot be compared to the actual Creation Energy. Do you understand what I'm trying to say?”</p><br/><p>After her speech, the Sidhe Queen’s thoughts, that seemed to have been sealed off by her earlier, reopened. Zhou Weiqing was able to sense the changes in her emotions once again. </p><br/><p>Looking at the Sidhe Queen, Zhou Weiqing smiled as well, “At first, I assumed that because you rarely come in contact with the external world, your way of thinking would be as pure as you are. I still feel the same way, but you are very intelligent. I believe that the choice you make will be the most ideal one. I hate conflicts - as long as the sidhe does not start a war, the Peerless Sect is willing to become allies with the sidhe. Didn't you mention that the ancient tree of life is able to move around? If you're willing, your entire race can migrate to the Heavenly Bow Empire. With the evolution, I believe that we still have a long life ahead of the both of us. Let us join forces and guard the peace that we cherish and love, shall we?”</p><br/><p>The Sidhe Queen narrowed her eyes at him, “I have a feeling that your motive isn't that simple though.” </p><br/><p>Zhou Weiqing chuckled, “Human beings are selfish by nature. The reason why I channeled my Saint Energy into you was because you sacrificed your precious Sidhe Heart to save me, and ended up weakening your body as a result. It was a way of repaying my debt to you. However, I do not owe the ancient tree of life anything. That big fella has benefited a great deal from me and almost fully drained me of my energy. Take it as a form of repayment to me by moving it there.” </p><br/><p>The Sidhe Queen paused for a moment before gently nodding her head, “Ok, it's a promise.”</p><br/><p>Looking at her, Zhou Weiqing immediately looked shocked. To be honest, he casually said that as a joke. He did not expect the Sidhe Queen to even agree, let alone agree that readily. She did not even seem to have the intention to discuss the matter with the elders of the sidhe. </p><br/><p>The Sidhe Queen sensed his thoughts and smiled. “What is there to discuss about? The ancient tree of life had already evolved, none of the sidhe will go against my wishes. Furthermore, I believe that migrating to your country will benefit the sidhe greatly. I am a very far-sighted person.”</p><br/><p>Looking at the cheeky smile on the Sidhe Queen's face, Zhou Weiqing got slightly excited and it nearly triggered some dirty thoughts. Fortunately, he managed to hold himself back and suppressed them. However, he immediately got excited once again - what would it signify in the event that the sidhe's sealed grounds moved over to the Heavenly Bow Empire?</p><br/><p>Putting the sidhe's power aside, just a small leak of the massive vitality of the ancient tree of life alone was sufficient to allow the people of the Heavenly Bow Empire to be well-fed and to live comfortably in peace and happiness. </p><br/><p>“Moving the ancient tree of life there is not difficult, but moving it together with the sealed grounds where it is rooted in is difficult. It requires some time and cannot be done immediately,” said the Sidhe Queen.</p><br/><p>Zhou Weiqing hurriedly replied, “There’s no need to hurry. We have plenty of time, I can wait.”</p><br/><p>“Weiqing.” At this time, a few overjoyed voices were heard. Zhou Weiqing turned around and saw the three Shangguan sisters, Tian’er, as well as Little Witch, rushing over to him. </p><br/><p>Even though the other members of the sidhe did not dare to approach them, his wives couldn’t care less. Naturally, the First Elder of the sidhe did not stop them either. Even though the Sidhe Queen had not told them about her experiences from that trip, the fact that she was still holding onto Zhou Weiqing’s hand said it all. </p><br/><p>Shangguan Xue’er and the other ladies stood before Zhou Weiqing. Initially, their faces were full of excitement, but when they saw Zhou Weiqing holding the Sidhe Queen’s hand, they couldn’t help but widened their eyes. All five pairs of eyes stared at both their hands, unable to take their gazes away.</p><br/><p>Under normal circumstances, any woman who saw their husband holding onto another woman’s hand would have given him a tight slap on his face, or show signs of extreme and negative emotions such as anger, jealousy, etc. However, upon seeing that, Shangguan Xue’er, Tian’er, and the other women’s first reaction was admiration.</p><br/><p>Indeed, it was admiration.</p><br/><p>They all had similar thoughts, coupled with the fact that Zhou Weiqing did have remarkable combat successes under his belt. Hence, at this very moment, they felt that there was nothing else Zhou Weiqing was not capable of doing. He even managed to win the Sidhe Queen over in just one month. Indeed, it had already been a month since Zhou Weiqing and the Sidhe Queen had left the sealed grounds to chase the enemy. </p><br/><p>Zhou Weiqing was unaware of what they were thinking. He simply had an awkward look on his face at this moment. The main point was that he was innocent! This time, he truly did not have any intention to start an affair! He had no other choice - the Sidhe Queen was holding onto his hand so tightly and did not want to let it go. He couldn’t possibly struggle forcefully to let go of her hand.</p><br/><p>The Sidhe Queen smiled and nodded at the five women, “Please don’t overthink. There is no underlying meaning. Please hold on for a moment.”</p><br/><p>As she spoke, she grabbed Zhou Weiqing and flew to the sky. As it had always been Zhou Weiqing leading her when he brought them back via the Spatial Shuttle, he did not notice the changes in the Sidhe Queen’s body. As she was pulling him along with her as she flew, Zhou Weiqing was shocked to find that the Sidhe Queen’s body had become slightly taller and more slender - she was at least half a head taller than before. What was most phenomenal was the fact that the two pairs of transparent wings that she had on her back became three pairs at this moment. With a faint golden light around her, she looked very graceful and noble, while exuding a supreme dignified presence. Certainly, the dignified aura was directed towards others - Zhou Weiqing could only faintly sense it. At the same time, he could clearly sense her gentleness towards him.</p><br/><p>A majority of the members of the sidhe only saw the Sidhe Queen and Zhou Weiqing returning to the sealed grounds - they did not see them holding hands. However at this moment, when the Sidhe Queen appeared in mid-air while holding onto Zhou Weiqing’s hand, every single one of them was dumbfounded. </p><br/><p>Not only was the Sidhe Queen the supreme leader of the sidhe, she was also the symbol of purity. Never mind touching a male human being, even a male sidhe was not qualified to touch her. However, she was actually holding onto Zhou Weiqing’s hand. This was completely unbelievable to them. </p><br/><p>The twelve elders who were standing right at the front did not have to kneel or bow. They looked at each other in dismay and were entirely speechless. Of course, they could tell that the Sidhe Queen willingly held Zhou Weiqing’s hand. Most importantly, the successful evolution of the ancient tree of life over the past one month brought immense joy to them. Otherwise, these elders would have long erupted in anger. </p><br/><p>Just like what the Sidhe Queen had said, the evolution of the ancient tree of life had signified her elevated status within the tribe. Hence, at this moment, nobody dared to violate her honor. They could only wait in silence for her orders. </p><br/><p>With her right hand holding onto Zhou Weiqing’s hand, she lifted her left hand slowly. The rich golden Life Energy immediately rushed forth. Thereafter, her left hand gestured outwards. A layer of faint golden light was formed, transforming into a faint golden halo that started spreading out. </p><br/><p>At this moment, there were thousands of sidhe gathered in this place. Under the expanding halo, all the sidhe were gradually enveloped within it. When the life aura, that was filled with creation property, descended, every single sidhe could clearly feel their already abundant vitality increase further.</p><br/><p>“Long live Your Majesty!” Cheers erupted like tidal waves - even the twelve elders subconsciously knelt down the moment they felt the rich Life Saint Energy spread from the sky. As the leaders of the tribe, they had the greatest understanding with regards to the type of energy that was being released by the Sidhe Queen - it was the Life Saint Energy that one could possess only when the Sidhe Heart was being released! At this very moment, it was actually casually released by the Sidhe Queen.</p><br/>\n</div>"}