{"title": "Chapter 292 - Fight, Zhou Weiqing! (1)", "id": 292, "volume": 3, "url": "http://boxnovel.org/heavenly-jewel-change-chapter-292-fight-zhou-weiqing-1", "volume_title": "Volume 3", "body": "<h1>Chapter 292 - Fight, Zhou Weiqing! (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Both parties were Low Level Heavenly Gods. In terms of cultivation base, Long Shiya, who possessed six attributes, had the upper hand. However, in terms of Celestial Territories, Shen Mo’s Celestial Territory was stronger. Furthermore, Shen Mo was equipped with the ten-piece Legendary Set, which surpassed the nine-piece ‘Hate Sky no Handle’ Set. Hence, under the circumstances where they were both evenly matched, Long Shiya was at a slight disadvantage. </p><br/><p>Watching Long Shiya merge with his phantom image, Shen Mo did not stand idly by. Similarly, his figure flashed and his entire body merged with his own Destruction will. </p><br/><p>The huge mouth that was about to engulf everything expanded in an instant. The dense purplish black shade seemed to have completely materialized - it ferociously charged towards Long Shiya in a bid to bite him. Combining the Celestial Territory and the physical body into one was a battle technique that was exclusive to a Heavenly God Stage powerhouse. At this moment, they were both god-like. If their attacks were used in an ordinary war situation amongst human beings, they were powerful enough to destroy hundreds of thousands of soldiers within a short period of time. </p><br/><p>Furthermore, the biggest trait of Heavenly Gods was that their personal cultivation base was almost unlimited. Without needing to absorb a lot of atmospheric energy, they were able to generate a massive amount of energy. This was the biggest difference between a Heavenly God and a Heavenly Emperor. Hence, even if Shen Mo was slightly more powerful than Long Shiya on the whole, it was not that easy for him to take advantage of Long Shiya. </p><br/><p>It had been several years since a battle between two Heavenly Gods had occured on the Boundless Mainland. At this moment, the powerhouses of the five Great Saint Lands had already forgotten that the Grand Tournament of Saint Lands was currently ongoing. Instead, they had focused all their attention towards the sky. Nobody wanted to miss a splendid battle as such.</p><br/><p>The huge mouth that Shen Mo had merged with became extremely savage. It frantically bit Long Shiya’s enormous body, refusing to let go. In just a short period of time, it managed to tear off a couple of pieces of his flesh. Furthermore, with every bite, a layer of dense black Destruction stream of air would rise up in a frenzy and envelope Long Shiya’s enormous body before using the Destruction will to destroy it. </p><br/><p>Clearly, Long Shiya was on the losing end at the moment. However, the Six Ultimate Heavenly God was not that easy to deal with. A loud sound was heard and Long Shiya’s enormous body in mid-air had suddenly become transparent. The six-colored light on his body had been separated into six individual lights. Immediately after, a series of strange sightings were displayed in the sky. </p><br/><p>The first to erupt was the Wind Attribute. A dense green light erupted instantly from the Six Ultimate Heavenly God’s enormous body. The hurricane created countless wind blades that frantically slicing the Destruction Energy that was all around. Under the attack of the Wind Attribute, the terrifying Destruction Energy let out a high-pitched screech. Apart from ordinary human beings, even when the Heavenly King powerhouses down below heard the sound, they all had to activate their Heavenly Energy to protect their ears. Or else, they might lose their sense of hearing forever.</p><br/><p>This was only the beginning. The most important reason why the wind blades were not destroyed by the Destruction Attribute was because the blades contained a certain degree of Saint Energy. Under such circumstance, even though the amount of damage they inflicted was limited, the process of slicing the Destruction Energy helped prevent it from harming Long Shiya’s body any further.</p><br/><p>The countless densely packed green wind blades could be seen embedding themselves directly into the black energy. Immediately after, the next to erupt was the Fire Attribute.</p><br/><p>The Fire Attribute was erupted from the most primitive form of attack, which was a fireball. The fireballs did not directly bombard the Destruction Energy. Instead, they collided into the wind blades that were erupted earlier. As the saying goes - the stronger the wind, the faster the fire spreads. When the wind blades collided with the fireballs, firstly, the fireballs detonated completely, causing a series of explosion sounds. Furthermore, when these fireballs exploded, due to the presence of the Wind Attribute, the terrifying Fire Attribute became even stronger. They forcefully exploded, creating a space around the enormous figure created by Long Shiya. A huge amount of Destruction Energy was dispelled. Even though the Destruction Energy could not be destroyed, at least it managed to distance it. </p><br/><p>Shen Mo was utterly shocked. Ever since he gained the Destruction Attribute, he had never come across a situation as such. In his eyes, be it the Wind or Fire Attribute, as well as all the other element attributes, in theory, they should be easily engulfed by the Destruction Attribute. However, the situation before his eyes was completely different. </p><br/><p>Furthermore, Long Shiya was much more adept at controlling energy than him. Even though the Destruction Attribute allowed him to have the upper hand, just like what as Heavenly Snow Mountain Lord Xue AoTian had said before, Long Shiya was exceptionally talented. The Six Ultimate Skill Manipulation Formation that he created was one of a kind. In terms of control, almost not a single person could be compared to Long Shiya. Even before he became a Heavenly God, Xue AoTian had also acknowledged that he paled in comparison. </p><br/><p>At this moment, Long Shiya had displayed his formidable ability pertaining to his control over energy. Every single fireball could accurately find a corresponding wind blade. That alone was more than enough to astonish everyone who was present. For the record, it was not only one or two fireballs. There were way too many to be seen by the naked eye, as they were so densely packed together. There were at least tens of thousands of them!</p><br/><p>After wind, came fire. After fire, came earth. Sharp thorns from the earth erupted in mid-air. In that instant, Long Shiya’s body seemed to have become hedgehog-like. Countless thorns passed through the flames and frantically pierced into the Destruction Attribute.</p><br/><p>During the process of passing through the flames, every thorn immediately became harder. A majority of the thorns were refined to the degree they looked crystal clear, as though they were carved from diamonds. Their destructive ability was also greatly increased.</p><br/><p>After earth, came water. Countless streams of water gushed out. Their main effect was not to destroy. Instead, they served the purpose of enhancing the thorns from the earth, by propelling them forward. Under such circumstance, the impact of the thorns became a lot more terrifying. Within the Destruction Energy that could hardly advance earlier, countless thorns could clearly be seen piercing through, coupled with a series of ‘pop’ sounds. Long, narrow channels were opened as a result within the Destruction Energy.</p><br/><p>Under such circumstances, even if a Heavenly God could generate a massive amount of energy, he or she would not be able to keep up with the consumption rate of the energy! The Destruction Celestial Territory that clearly had the upper hand immediately became a lot dimmer. However, Long Shiya’s attacks had not ended. He was the Six Ultimate Heavenly God, not the Four Ultimate Heavenly God! </p><br/><p>The last two that appeared were naturally Light and Darkness. These two attributes did not appear on its own - they appeared together. A series of sparkling, crystal clear light balls appeared out of nowhere. These light balls were rather strange as they were made up of two colors - black on one side and gold on the other. Both colors flashed alternately in the sky, emitting strange energy ripples. Upon further scrutiny, one would find that in the surroundings of these two-colored light balls, there were circles of distorted energy ripples. One could well imagine the amount of terrifying energy they possessed. </p><br/><p>The trajectory of the light balls was very simple - they headed in the direction of the long and narrow channels created by the thorns earlier. Terrifying energy ripples circulated the air. The light balls did not go through these channels. Instead, after they reached the center of the Destruction Energy, they had temporarily paused. When they paused in mid-air, the powerhouses on the peak of the Heavenly Snow Mountain held their breath. A lot of people had already guessed Long Shiya’s next move, including Shen Mo. However, at this moment, he had no power to stop Long Shiya.</p><br/><p>The launch of the attacks of the four different attributes had caused Shen Mo to deal with them in a rushed manner. If his Destruction Celestial Territory was not as powerful, it might have crumbled under the continuous full-force attacks of the four attributes. Once the Destruction Celestial Territory was broken, then his advantage would become a disadvantage. He definitely did not hope for a situation as such to occur. He was very clear that even though Long Shiya’s attacks might be powerful, they were currently draining a massive amount of energy from him. If Shen Mo was able to pull through this attack, the final victory was his. </p><br/><p>In reality, Shen Mo was too careless. Due to the fact that he had the upper hand earlier, he had let his guard down. In his eyes, as long as the Destruction Celestial Territory continued to engulf, Long Shiya was bound to be defeated. However, he had never expected Long Shiya to have that many offensive techniques. Most importantly, he had underestimated Long Shiya’s ability to control. </p><br/><p>If it were someone else, even if it was Zhou Weiqing who used such techniques to attack, he would not have been as accurate and precise as Long Shiya. Without precision and accuracy, the collaboration of the four different attributes earlier would not have been that smooth-sailing. Hence, the power of the attacks would have been a lot weaker as a result. </p><br/><p>One by one, the crystal clear two-colored light balls that were radiating with light paused in mid-air, in the middle of the channels. </p><br/><p>At this moment, all Shen Mo could do was to put in all his effort in making his Destruction Celestial Territory become a lot more dense.</p><br/><p>However, at this moment, the speed of Long Shiya’s attacks were completely combined. It was impossible to stop them.</p><br/><p>Explosions began to happen. When the two opposing energy, light and darkness, collide at the same level, instead of canceling each other out, it caused an explosion that was ten times to a hundred times more powerful than that of the Fire Attribute.</p><br/><p>Long Shiya spent his entire life mastering the six attributes - he was able to control them freely and effortlessly. Naturally, he knew how to control the Light and Darkness Attributes best. The trajectory of every single two-colored light ball was as such, because of a gentle layer of energy of the amalgamation of the six attributes separating them. Hence, they did not come into contact with one another. At this very moment, what Long Shiya did was to dissipate the gentle layer of energy, causing the terrifying explosions to occur. </p><br/>\n</div>"}