{"title": "Chapter 301", "id": 301, "volume": 4, "url": "http://boxnovel.org/heavenly-jewel-change-chapter-301", "volume_title": "Volume 4", "body": "<h1>Chapter 301</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>Lin TianAo glanced at Zhou Weiqing before saying: “Yesterday, we all discussed a simple strategy. Since it should be a team fight, then we will be fighting on overall strength. Little Witch has heard that for this fight, all eight members, both main team and reserve team alike, will have to fight. That is to say, all eight of us will get to take action. Since we are not sure of the exact rules, location of the fight or who we are fighting, we’ll just plan accordingly to our own strengths for now. When we fight, I will be right at the front handling our defenses. Crow, Drunken Bao, both of you will be at the flanks guarding our sides. Weiqing, you’ll be right in the middle, in charge of controlling the battlefield and supporting us all. Xiao Yan and Ye Paopao, both of you are skilled at long ranged attacks, so you will be right behind, and will be our main damage. Little Four, you will be in charge of scouting and supporting attacks. Little Witch, you will stay with Weiqing in the middle. You will be our ace, and when we meet any powerful enemies, you will have to give them a sudden surprise, unleashing all your power to defeat them in a quick swoop.”</p><br/><p>Finally finishing, Lin TianAo looked towards Zhou Weiqing and said: “Weiqing, that is our draft plan so far. Do you have anything you want to add?”</p><br/><p>Zhou Weiqing thought for a moment, then said: “Do any of you know whether or not Heavenly Beasts can be used in this final fight?”</p><br/><p>Little Witch said: “I do not know the exact rules, but it should be allowed. After all, the WanShou Battle Team will definitely have Beastmasters amongst their ranks. If they are not allowed to use Heavenly Beasts, that will have a huge impact on their power, and it will not be a fair fight at all. My guess is that there will be some sort of restrictions, perhaps on the numbers allowed or something else, but they should be allowed in general.”</p><br/><p>Zhou Weiqing nodded and said: “Good. In that case, we can add a Icy Soul Heavenly Bear to each flank to support our defenses. They are extremely strong, and with the Wind and Ice Attribute to boot. With them added to our defenses, it will be a great effect. This way, it will also allow Drunken Bao and Crow to put some of their offensive power to good use.”</p><br/><p>Drunken Bao grinned and said: “What about your little white tiger? That little fellow has evolved once right, we almost got killed from that, shouldn’t it be of good use in a fight as well?”</p><br/><p>Hearing Drunken Bao bring up Fat Cat, a mysterious smile flashed across Zhou Weiqing’s face, and he said: “There is no hurry, let’s wait and see what happens when the fight starts. I will not let Fat Cat take action easily.”</p><br/><p>Little Witch covered her mouth to conceal a giggle as she looked at Zhou Weiqing, a strange, amused look on her face. Only she could somewhat understand what Zhou Weiqing meant.</p><br/><p>Lin TianAo said solemnly: “We do not know the exact details and rules of the fight, and there is also no point in guessing wildly. Since we have already entered the top four, we have already accomplished more than we set out to do. From now on, however further we go is up to us to pit our skills to the test. Let me remind everyone once more that I’d like everyone to keep safety first in mind. You have all just gotten a Zong Stage Consolidating Equipment Scroll, and you have a great future ahead. Your lives are much more important now.”</p><br/><p>Everyone nodded in agreement. Zhou Weiqing stood up once more, stretching lazily before saying: “If that’s all, I’ll be heading off again.”</p><br/><p>Lin TianAo started, before saying: “Tomorrow is the fight already, where are you going now?”</p><br/><p>Zhou Weiqing grinned and said: “I’m heading to the Skill Storing Palace once again. Do not worry, I’ll be back tonight, and I won’t take as long this round. I will definitely not miss tomorrow’s fight, you know how important it is to me as well.”</p><br/><p>After saying that, Zhou Weiqing turned to leave with a wave of farewell to his friends.</p><br/><p>The finals fight was about to start, and he had something very important to do. The past two days of cultivation had a clear and amazing effect, but he was still missing the last two Time Attribute Skills. If he could gain two more powerful skills before the the finals fight started, it would undoubtedly be a huge boon to not just himself, but the entire Fei Li Battle Team.</p><br/><p>Exiting the inn, Zhou Weiqing looked around for an employee of the Heavenly Jewel Island and asked him: “Could you please help me look for Senior Shangguan Longyin, I am called Zhou Weiqing, and I have something very urgent to look for him. Please help me tell him that, and he will definitely come look for me. Thank you very much.”</p><br/><p>Since he wanted to go through Skill Storing, and he was already on the Heavenly Jewel Island, a rare opportunity indeed, how could Zhou Weiqing be satisfied with merely storing from Zong Stage Heavenly Beasts? After all, Shangguan Longyin had mentioned previously that one of the conditions of trading for his Immortal Deity Technique was to allow him to go through Skill Storing in their Heavenly Jewel Island Skill Storing Palace without restriction. Although they hadn’t actually gone through the trade yet, he was still confident that Shangguan Longyin would allow him to Skill Store from Heavenly King Beasts or higher first. Combined with his Devour Skill, he would be able to quickly recover in time to easily store two Skills.</p><br/><p>…</p><br/><p>Dawn of the next day.</p><br/><p>The members of the Fei Li Battle Team all got up, washed up, and were having their breakfast in the dining hall. The prices of food in the Heavenly Jewel Island were all rather expensive, but luckily the inn they were staying in at least provided breakfast for free. These few days, their main nourishment had naturally came from this free breakfast. As soon as they entered the dining hall, they saw Zhou Weiqing already seated there gorging away. His clothes were tattered, and his hair messy.</p><br/><p>Little Four burst out laughing, saying: “Weiqing, last night did you go to the Skill Storing Palace or try to pick up some girl again? Could it be you got beaten up again?”</p><br/><p>Zhou Weiqing glared at him exasperatedly and said: “Pick up your own head! I laboured hard through the whole night, it was tough but I managed to do it!”</p><br/><p>Lin TianAo could see that although Zhou Weiqing’s appearance was in shambles, the look in his eyes was filled with joy and excitement. Without question, something good had definitely happened.</p><br/><p>“Weiqing, do you need to rest a while? It will probably be a while more before the Heavenly Jewel Island staff come to bring us to the tournament grounds.” Lin TianAo asked.</p><br/><p>Zhou Weiqing shook his head, a hearty grin on his face as he said: “No, that isn’t necessary, I’m in a good state now. I’ll just need to replenish my energy with a good meal.”</p><br/><p>It had indeed been an eventful night for him. Just like he had expected, Shangguan Longyin had arrived to meet him, and had easily agreed to let him Skill Store any of the Heavenly Beasts in the Skill Storing Palace for free. Zhou Weiqing had actually Stored not two, but three Skills last night! That was the reason why he looked so shabby now, as he had barely succeeded in doing so, almost sustaining several injuries in the process of doing so.</p><br/><p>However, his efforts had not been in vain, otherwise, he would not be in such an excited state yet. His three new Skills not only strengthened his overall power, but also brought some new abilities to the table that he did not previously have.</p><br/><p>After all of them had eaten, they waited awhile more before the Heavenly Jewel Island guide arrived at the inn to pick them up.</p><br/><p>Led by their guide, the entire team left the inn and headed towards the central zone of the Heavenly Jewel Island, which was covered in mist. Upon seeing the direction they were taking, they couldn’t help but wonder… could it be that the final fight would be held in the Heaven’s Expanse Palace itself?</p><br/><p>It didn’t take long before the members of the Fei Li Battle Team saw the other three Battle Teams being led by their respective guides, each from different directions, all headed towards the misty central zone.</p><br/><p>Zhou Weiqing was walking behind Lin TianAo, recalling the past few days in what could be called some rather miraculous experiences. All of a sudden, he felt himself shiver as an abrupt sense of cold enveloped his entire body.</p><br/><p>Our dear Little Fatty had the sense of a wild beast, and this strange sensation was definitely a product of that, instantly rousing his guard. Subconsciously, he looked in a direction, catching a cold gaze filled with killing intent.</p><br/><p>The owner of that gaze was the Leader of the ZhongTian Battle Team, Zhan LingTian, who was walking right at the head of his Battle Team.</p><br/><p>Sensing the gaze filled with enmity, Zhou Weiqing was left puzzled. He couldn’t think of a reason why Zhan LingTian would look at him like that, after all he had not had any contact with him previously.</p><br/><p>As their gazes met, a cold light flashed in Zhan LingTian’s eyes, and he narrowed them before turning away.</p><br/><p>Zhou Weiqing pursed his lips, thinking to himself: So haughty! What so great about you, hmph, let’s see when the fight starts, we’ll see who has the last laugh!</p><br/><p>Lin TianAo could naturally sense the enmity between Zhan LingTian and Zhou Weiqing, and his heart sank a little. Towards Zhan LingTian, he wasn’t as optimistic as Zhou Weiqing. As the ZhongTian Battle Team leader, he was far beyond even Shen Little Demon, and she could be considered easy pickings compared to him. Furthermore, he had heard of Zhan LingTian before, in the previous round of the Heavenly Jewel Tournament, Zhan LingTian had only been twenty two years old, but had already become the mainstay of their team then. The ZhongTian Empire could be said to be full of powerhouses, even in the younger generation, especially with the Heaven’s Expanse Palace’s support. For Zhan LingTian to stand out from amongst such a heavy competition, he was naturally not to be underestimated.</p><br/><p>Amongst the ZhongTian Battle Team, the only female member seemed rather dull and unassuming, but if one really looked carefully, she seemed to possess a set of nimble, cunning eyes that belied her ordinary dull appearance, as they flashed with a mischievous light. Looking at the clash in the gazes of Zhan LingTian and Zhou Weiqing, her eyes lit up in glee.</p><br/><p>The members of the WanShou Battle Team were all as frosty as usual, while the four couples of the BaoPo Battle Team looking at each other tenderly as usual. However, it was clear that the air between the four teams was rather nervous and tense, and the looks between teams were much reduced. After all, the final fight was about to begin.</p><br/><p>The central zone of the Heavenly Jewel Island was not very big, and they soon reached it, the swirling mists right before their eyes. The guides soon stopped in front of them.</p><br/><p>Shangguan Longyin stood there, still clad in white, shrouded by the mist in the background. Right behind him stood ten other white clad old men. They all looked to be around sixty years of age on the average, each looking stable and wise.</p><br/><p>Seeing that all four teams were gathered here, Shangguan Longyin said passively: “The Heavenly Jewel Tournament Finals will soon begin. Now, let me first tell you the rules and fight format.”</p><br/><p>“In our ZhongTian Empire and Heavenly Jewel Island Skill Storing Palaces, you should have all seen the Lustre Gem. It is indeed a rather miraculous item. Soon, you will be heading to the site of your upcoming finals fight, and it is also named somewhat similarly, the Lustre Spatial Realm.”</p><br/><p>“The Lustre Spatial Realm… you can understand it as a special type of magical Formation, an ancient formation passed down from ages beyond, inscribed on the Heavenly Jewel Island. How it was formed, or who it was left by, nobody knows. When our Heaven’s Expanse Palace Great Founder and ancestor came to the Heavenly Jewel Island, it was already existing.”</p><br/><p>“In a sense, the Lustre Spatial Realm is a new realm, a separate dimension not of this world. It is not very large, and its entire land surface is covered by virgin rainforest. We do not know how this realm was constructed, or if it is just a portal to another world, but what I can tell you is that whatever happens in that realm is totally real. That is to say, if you die there, it will be for good.”</p>\n</div>"}