{"title": "Chapter 326", "id": 326, "volume": 4, "url": "http://boxnovel.org/heavenly-jewel-change-chapter-326", "volume_title": "Volume 4", "body": "<h1>Chapter 326</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>“At least, that is currently so. After all, before we attended this Heavenly Jewel Tournament, who would have thought that our Fei Li Battle Team would even attend the finals, let alone end up as the champion right?”</p><br/><p>Lin TianAo was clearly very agitated, at least Zhou Weiqing had never seen him in such an emotional state before.</p><br/><p>“Leader, we have a long road ahead of us. Thank you for your trust. You are not just my Follower, but my big brother. I do not need you to witness me creating any miracles, instead I hope that you will join me in creating the miracle together. I trust that together, we will be able to do it!”</p><br/><p>As he said that, Zhou Weiqing also gave Lin TianAo a big hug.</p><br/><p>The final Champion position could be said to be the thing that dissolved the last remaining barrier between Lin TianAo and Zhou Weiqing from their previous bet.</p><br/><p>In Lin TianAo’s heart, it was Zhou Weiqing who had finally let him accomplish the greatest dream he had. At the same time, the last few months had built up a huge respect for this young man, not just in terms of his amazing talent in the Heavenly Jewel Master field, but his character, wit, power and intelligence. From what Zhou Weiqing had displayed, Lin TianAo even had a feeling like he had to look up to this younger man.</p><br/><p>Although Zhou Weiqing was currently only at a mere three-Jeweled cultivation level, in truth his overall strength was at least comparable to any ordinary five-Jeweled Heavenly Jewel Master, or perhaps even greater. With his Immortal Deity Technique and the Devour Technique, his sustainability in combat was extremely strong. Adding to that his multiple powerful, highly rated Skills, especially ones like the Dragon Silencing Seal which were supreme Skills rated about the same as the Twelve Star Heavenly God Stage Skills, he could possibly even challenge six-Jeweled, or perhaps even seven-Jeweled Heavenly Jewel Masters. Even if he were to face Zhan LingTian at full power, he might still be able to hold his own, at least for some time. After all, that Dragon Silencing Seal alone was just too overbearingly powerful.</p><br/><p>Of course, that was not to say that the Dragon Silencing Seal was invincible. If Zhan LingTian had been careful enough when facing Zhou Weiqing, just going full on defense mode after he had been Sealed, he could have lasted for the maximum ninety seconds of his daily three Dragon Silencing Seals’ effects. Once that happened, Zhou Weiqing would not have a chance against him once more. Alas, perhaps caught by surprise, or just being too arrogant or lost in the moment, that had not happened.</p><br/><p>Of course, hindsight was always twenty twenty, but there was no such thing as ‘Regret Medicine’. At least in this Heavenly Jewel Tournament, Zhan LingTian had taken a huge loss.</p><br/><p>Originally, when Lin TianAo first met Zhou Weiqing, his power levels were rather weak in his eyes. Even though at that time Zhou Weiqing was already at the three-Jeweled cultivation level, Lin TianAo had been highly confident of beating him.</p><br/><p>It could be said that Lin TianAo had witnessed Zhou Weiqing’s growth. Although he was still at the three-Jeweled cultivation level, but in terms of real combat ability, he had grown far beyond his original power. Lin TianAo knew that if he were to fight with Zhou Weiqing now and they both went all out, he would not have a chance. Just the Dragon Silencing Seal alone would destroy his greatest advantage, his Five Jeweled Assembly Set Shield; not to mention all the other powerful skills that Zhou Weiqing had and their combinations.</p><br/><p>Lin TianAo truly believed that as time passed and Zhou Weiqing’s cultivation level was raised, he would definitely become a supreme powerhouse that could rival any from the Five Great Saint Lands.</p><br/><p>Zhou Weiqing stretched lazily, feeling his entire body comfortable and filled with strength. After finally having a great rest at night, all the fatigue, stress and exhausted spirit due to the entire Heavenly Jewel Tournament had finally been wiped out, leaving him in tip top condition.</p><br/><p>“Leader, did the Heaven’s Expanse Palace mention when we can get our Tournament rewards?”</p><br/><p>Lin TianAo smiled bitterly: “No, they haven’t mentioned anything yet. Yesterday, when we came back, none of the Heaven’s Expanse Palace members came about. This is the Heavenly Jewel Island, and we did ruin their efforts. I think let alone getting our rewards, if we can live to get out of the island, it will already be a good result. No matter what, we still have the honour and pride of winning the Championship of the Heavenly Jewel Tournament. That is something that we will always have.”</p><br/><p>A light flashed in Zhou Weiqing’s eyes. If the Heaven’s Expanse Palace truly wanted to take revenge on them, even if they did not kill the team and just chased them out, it would still be a huge loss to them all, especially to Zhou Weiqing. Besides the rewards, just the trade he had with the Heaven’s Expanse Palace was immense. After all, it was three God Tier Consolidated Equipment… and all part of his Legendary Set!</p><br/><p>Still, Zhou Weiqing did not regret anything. After all, a man had to own his actions, and there were some thing that just could not be measured just by benefits alone. In one’s youth, one had to have a few impulsive or rash moments, no matter if it were seemingly senseless, or even harmful to oneself… at least he had made his decision, taken action with resolution. If one had to live with pure reason the whole life, what colour would there be in life?</p><br/><p>At the same time, Zhou Weiqing also believed that even if the Heaven’s Expanse Palace cancelled their trade, they would still give out the Tournament Rewards. After all, it was their own promise, and the entire Heavenly Jewel Tournament was known to the entire mainland. As the top of the Great Saint Lands, if they did not have that basic integrity, how could they live up to their reputation as a Great Saint Land. Furthermore, the most important thing was, what had been done was already done, and there was no way of reversing things. Even if the Heaven’s Expanse Palace wanted to take revenge on him or the Fei Li Battle Team, it would not give them back their losses. Under such a circumstance, what would they gain from taking revenge on them? As such, Zhou Weiqing was still more confident in the Heaven’s Expanse Palace than Lin TianAo.</p><br/><p>“Leader, do not worry, it should be fine. What has happened has happened, even if they kill us now, they will no longer be able to get that dragon. In such a case, what is the point? Furthermore, the fact is that I was the biggest factor for their loss, so they shouldn’t take it out on the rest of team, and hopefully considering mine and Bing’er’s relationship, I should be safe as well.”</p><br/><p>Lin TianAo nodded, saying: “I hope that is truly so.”</p><br/><p>Just at that moment, Little Four’s voice traveled from outside the door: “Boss, the Heaven’s Expanse Palace staff are here.”</p><br/><p>Lin TianAo’s expression changed, looking at Zhou Weiqing with a serious look. Zhou Weiqing nodded back, and they left the room together.</p><br/><p>As the pair headed out, they met with the staff representing the Heaven’s Expanse Palace. This time, there were two of them, both middle aged men of about forty years of age. The rest of the Fei Li Battle Team also streamed out of their rooms; Lin TianAo’s worry was also the same as theirs. That was also the reason why they had not been celebrating like crazy even after becoming the champion.</p><br/><p>“Who is the leader of the Fei Li Battle Team? Please follow me to collect your rewards from the Heavenly Jewel Tournament.” The white clad man on the left said.</p><br/><p>Lin TianAo said: “Hi, I am the leader of the Fei Li Battle Team, Lin TianAo.”</p><br/><p>The white clad man nodded and said: “Alright, follow me then. Before that, please collect all the Lustre Gems and Spatial Rings that were given out to your team previously.”</p><br/><p>Lin TianAo did as instructed, swiftly collecting the Lustre Gems and Spatial Rings. Alas, as the time they had spent in the Lustre Spatial Realm was just too short, none of them had actually managed to collect anything from within.</p><br/><p>As for the other white clad staff, he said: “Who is Zhou Weiqing, please follow me, our Palace Master wishes to see you.”</p><br/><p>Hearing his words, the other members of the Fei Li Battle Team grew nervous, subconsciously gathering behind Zhou Weiqing and Lin TianAo. In that moment, everyone’s hearts were palpitating quickly. In their minds, they were thinking that was it a trap that only Lin TianAo and Zhou Weiqing were called?</p><br/><p>Zhou Weiqing smiled faintly and said: “Everyone, do not worry, Leader and I will be back soon.”</p><br/><p>A faint smile appeared on Lin TianAo’s face as well. After a short moment, he had also realised that what Zhou Weiqing said was right – it seemed like the Heaven’s Expanse Palace had decided not to take any revenge on them, at least nothing directly. Since they had already sent someone to summon them, it meant they were not going to deal with them. Otherwise, this was the Heavenly Jewel Island after all, if the Heaven’s Expanse Palace truly wanted to deal with them, it would be an easy task, and there was no need for any tricks or shenanigans.</p><br/><p>Seeing the smiles on their faces, the remaining members, who had been so concerned that they had lost their cool, were relieved.</p><br/><p>Zhou Weiqing and Lin TianAo each followed one of the white clad staff members out of the inn.</p><br/><p>Both sides did not take the same route. The Heavenly Jewel Tournament was over, and the four teams would be awarded with their respective rewards today. After that, besides the ZhongTian Battle Team, the rest would likely leave the Heavenly Jewel Island. Of course, they could still stay around if they wanted, but the cost of living here was not something that most people could sustain. Previously, the team, and especially Zhou Weiqing, had won quite a large sum of gold from their bets. However, as soon as they entered the Heavenly Jewel Island’s Consolidating Equipment Pavilion and Skill Storing Palace, they understood that bit of gold they had was merely a drop of water in the sea. That was not even considering the sheer prices of just food and lodging in the Heavenly Jewel Island.</p><br/><p>Zhou Weiqing followed his white clad guide, and soon they arrived back at the mist where they had previously entered the Lustre Spatial Realm.</p><br/><p>“Please hold this, and infuse your Heavenly Energy within.” The white clad guide turned around and handed Zhou Weiqing a gold-red gemstone.</p><br/><p>As Zhou Weiqing received the gemstone, he examined it. The gemstone was larger than the Lustre Gem they had been given in the Tournament, and as he infused his Heavenly Energy within, a bright golden red light shot forth from the stone. The swirling white mist around them instantly turned the same golden red hue, gathering towards his body.</p><br/><p>The white clad guide also did the same with another gem, and the same thing happened as well. Zhou Weiqing had always been a fast thinker, and instantly inspiration struck him as he suddenly understood what was up with the Heaven’s Expanse Palace. The current gemstone in his hands was somewhat similar in nature to the Lustre Gem, and it was likely that their effects were similar as well. Furthermore, he could sense the thick Spatial Energy around him swirling about as well.</p><br/><p>As such, Zhou Weiqing immediately guessed that this white mist was possibly just the Heaven’s Expanse Palace cover. The real Heaven’s Expanse Palace was possibly in another separate Spatial Realm, something like the Lustre Spatial Realm. They truly deserved their name as one of the Great Saint Lands.</p><br/><p>The golden red light persisted for almost ten seconds, before the two of them vanished in a bright flash.</p><br/><p>In the next instant, Zhou Weiqing appeared in another area.</p><br/><p>The moment the golden red light dissipated from around him, Zhou Weiqing’s heart was filled with shock. In front of his eyes lay a whole new world, filled with a light blue hue.</p><br/><p>Right above in the light blue skies, the sun was a strange orange red, though its light was not eye piercing. The entire ground seemed to be paved with some sort of jade, but it did not reflect light, seeming to have its own dull glow of its own. On that light blue surface, all sorts of rare and precious plants grew. However, all of that majestic beauty was eclipsed by a massive Palace right in front of him, shining brightly in a sky-blue colour.</p><br/><p>In front of the Palace was a large patch of grass, and behind the Palace was actually a massive three hundred metre tall waterfall, pouring down as if from the skies, bringing the damp sensation to their faces. However, the surprising thing was that there was actually no sound.</p><br/><p>This was like a saint’s paradise on earth, and at the moment, everything just seemed so surreal, almost unreal.</p><br/><p>The white clad guide gave Zhou Weiqing an inviting gesture, along with a respectful expression, and they both headed towards the Palace.</p>\n</div>"}