{"title": "Chapter 330", "id": 330, "volume": 4, "url": "http://boxnovel.org/heavenly-jewel-change-chapter-330", "volume_title": "Volume 4", "body": "<h1>Chapter 330</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>Upon hearing the words Beastmaster Armies, Shangguan Tianyue’s face changed. He clearly dreaded them, and with a sigh he said: “You’re right brother, I am too impatient. It’s just that every year as I see the namelist of our dead warriors, it breaks my heart. To keep the status quo going and fight in such a war of attrition is also not a good solution.”</p><br/><p>Shangguan Tianyang said: “Yes… but alas we have no choice about it, and only the heavens can do anything about it. The WanShou Empire might be huge, but they are in the bitter cold northlands; the food supplies there are extremely limited, and when it comes to winter time, if they do not attack us and raid our lands, many of their citizens would perish. For survival, they have no choice but to invade us. On our end, we have to defend our own lands, to protect our citizens. Such is nature that we are forced to fight with each other. It’s not like we can just gift them with food, to let them grow strong before they invade the entire mainland right.”</p><br/><p>Shangguan Tianyue shook his head helplessly, saying: “Alright, let’s stop talking about such depressing matters. I will head to find Xian’er first… By the way, Big Brother, how has your closed door cultivation been lately? Any opportunity to breakthrough?”</p><br/><p>A hint of disappointment appeared in the gentle eyes of Shangguan Tianyang, and he shook he head lightly: “It is still the same… no success in sight. Our human bodies and talents just cannot compare to the Divine Heavenly Spirit Tigers, and it is just too difficult to break through that last step. I have been at the peak of the Heavenly Emperor Stage for over a dozen years, and all these years I have been striving with all my might to perfect myself and breakthrough to the last stage. Alas, I have always hit a wall due to the limitations of my body and physique, always failing at the last step. I’m afraid that the gap between myself and Xue HaoTian will have grown further. The next Five-Year Great Saint Lands Meet, I wonder if I will still be able to suppress him in overall power… How about you second brother? How is your situation?”</p><br/><p>Shangguan Tianyue said: “I have now stabilized myself at the Low Level Heavenly Emperor Stage. However, if I want to break through to the Mid Level, I estimate that it will take me at least five to ten years.”</p><br/><p>Shangguan Tianyang smiled faintly and said: “Luckily you have also reached the Heavenly Emperor Stage. With the power of us two brothers combined, along with our Legendary Sets, even if Xue HaoTian had improved, we will not lose to him.”</p><br/><p>As he spoke up to that point, Shangguan Tianyang seemed to be lost in recollection. “Speaking of which, the only person that I truly admire is that Xue HaoTian. Even though he isn’t a human, his cultivation talent is just too shocking, one that comes back barely once in ten thousand years. In all the records of our Heaven’s Expanse Palace, for someone to break through the Heavenly King Stage before forty, Heavenly Emperor Stage at fifty and Heavenly God Stage at sixty… he is truly the only person.”</p><br/><p>Shangguan Tianyue said in an ashamed tone: “Indeed! Previously, I stayed at the Heavenly King Stage for almost twenty five years, even though I reached that Heavenly King Stage before Xue HaoTian, alas his speed of cultivation is far beyond mine, and he has long since surpassed me. Big Brother, is having the Saint Attribute that much of an advantage?”</p><br/><p>Shangguan Tianyang suddenly laughed, saying: “If you really want to know how advantageous the Saint Attributes have, you can just look to your son-in-law. Thinking about it, if he had actually agreed to my terms today and officially joined our Heaven’s Expanse Palace, I’m confident that in the not too distant future, he can be another peerless talent like Xue HaoTian. After all, that son in law of yours not only has the Time Attribute, he is also a first generation Demonic Attribute Master… that’s two Saint Attributes! Not only that, he actually has six Attributes in total, with the other four none too shabby as well. Now that he is only at the three-Jeweled cultivation level, he has already Stored Skills like that Dragon Silencing Seal… even Xue HaoTian, a Divine Heavenly Spirit Tiger of such pure bloodline, had not done that right.”</p><br/><p>Shangguan Tianyue gave a humph and said: “Don’t keep mentioning that little brat, lest I get angry again.”</p><br/><p>Shangguan Tianyang said: “Alright, you go ahead first. You need to pack up and find Xian’er as soon as possible and bring her home.”</p><br/><p>Shangguan Tianyue said: “Hold on a moment, I am curious to see exactly what that little rascal’s cultivation technique is.”</p><br/><p>Shangguan Tianyang smiled faintly, but did not say anything further. He could clearly see that although Shangguan Tianyue was stubborn on the surface, he had already started to care for Zhou Weiqing. Just like what Zhou Weiqing himself had hoped, his efforts throughout the Heavenly Jewel Tournament had definitely displayed his talent, power and character to his future father in law and gained his approval.</p><br/><p>For top class powerhouses like the Shangguan brothers, they would not simply look at a Heavenly Jewel Master’s cultivation level. After all, cultivation level was only one aspect of a Heavenly Jewel Master’s overall power. What Zhou Weiqing had displayed in the Heavenly Jewel Tournament was not his own cultivation level, it was that terrifying combat prowess, and undeniable potential and talent, but also his leadership capabilities, keen intelligence, and overall package. Without a doubt, that had stunned even these top powerhouses. It could be said that besides his cultivation level, Zhou Weiqing was equal to, or perhaps already surpassed any of the top disciples of all the Great Saint Lands.</p><br/><p>The two brothers did not have to wait long; soon, a bright light shone once more and Shangguan Longyin appeared again in the hall. However, this time, his expression was extremely weird. He held a book in his hands, and he swiftly stepped up to Shangguan Tianyang and Tianyue.</p><br/><p>“First Palace Master, Second Palace Master.” Shangguan Longyin bowed slightly.</p><br/><p>Shangguan Tianyue said: “Done so quickly?”</p><br/><p>Previously, Shangguan Longyin had brought Zhou Weiqing to another area to make a copy of his Immortal Deity Technique. Shangguan Tianyang had imagined that that cultivation technique should be extremely complicated and long, but who knew they had barely waited an hour and Shangguan Longyin had already returned. After all, any of the top end cultivation techniques were extremely difficult and intricate, and no detail could be missed out.</p><br/><p>Shangguan Longyin gave a bitter smile and passed the book over, saying: “First Palace Master, I think you better see for yourself. I don’t even know how to describe it.”</p><br/><p>Shangguan Tianyang took up the book, and Shangguan Tianyue also moved over to look over his brother’s shoulder. The two Heavenly Emperor Stage powerhouses both started reading the contents of the book.</p><br/><p>In truth, Zhou Weiqing was truly strong in many aspects, but in terms of his handwriting… that was truly hard for anyone to scrounge up any praise for it. Although it was not totally unreadable, it was more than enough for the two readers to furrow their brows. Of course, that was not a huge problem, at most they just needed to find someone else to make another copy. However, the bigger problem now was the contents…</p><br/><p>After a moment, both Shangguan Tianyang and Tianyue stared at each other blankly.</p><br/><p>Shangguan Tianyue couldn’t help but exclaim: “This is his so-called godlike Immortal Deity Technique? Is this used to commit suicide??”</p><br/><p>Shangguan Tianyang looked up towards Shangguan Longyin and said: “Longyin, are you certain that Zhou Weiqing is truly cultivating this technique?”</p><br/><p>Shangguan Longyin smiled bitterly and said: “That is what truly made me feel helpless. After he wrote down this manual, I was the first to read through it, and I was totally puzzled then as well. After which, I followed the manual and its circulation techniques to examine Zhou Weiqing’s body. I can definitely confirm that he is truly cultivating with this technique. However, my thinking is the same as Second Palace Master’s… this cultivation technique can be likened to being suicidal. Who would be willing to bet one’s life so easily just to cultivate?”</p><br/><p>Shangguan Tianyang furrowed his brow, then said: “Could he be hiding anything else?”</p><br/><p>Shangguan Longyin shook his head, saying: “That shouldn’t be the case. Zhou Weiqing also said that he is about to breakthrough his fifteenth Death Acupuncture Point, and we can witness him doing so in verification of the technique.”</p><br/><p>Shangguan Tianyue said: “Big brother, what do you think?”</p><br/><p>Shangguan Tianyang thought for a moment, before finally saying: “Alright, then do as he says, let him breakthrough in front of us. I want to see if this method of breaking through the Death Acupuncture Points with Heavenly Energy… could it really be a unique technique that no one else has thought of?”</p><br/><p>The Immortal Deity Technique could be considered rather simplistic in nature, which was why it took such a short time to copy the entire manual. After all, it was basically listing the circulation routes and meridian points one had to take care of when breaking through each Death Acupuncture Point.</p><br/><p>With Shangguan Tianyang’s instructions in hand, Shangguan Longyin set off. Before long, Zhou Weiqing appeared in front of them once more.</p><br/><p>Seeing the two Shangguan brothers, Zhou Weiqing grinned happily and said: “Future Father in law, Future Uncle, I never expected we would meet again so quickly.”</p><br/><p>Shangguan Tianyang said solemnly: “Weiqing, that Immortal Deity Technique of yours is truly too shocking. Is it really a technique that can be successfully cultivated? Do not risk your life just to get a few Consolidating Equipment… When you attempt to break through your Death Acupuncture Point, with our cultivation level we can easily sense every bit of Heavenly Energy and how it is circulating throughout your entire body.”</p><br/><p>His meaning was clear; telling Zhou Weiqing that it was pointless to attempt to lie to them, and if he should not risk his life for no reason.</p><br/><p>Of course, in this, Zhou Weiqing had a clear conscience. His Immortal Deity Technique was indeed rather unbelievable, but it was indeed the cultivation technique he was cultivating. In theory, there was nothing wrong at all with their trade; of course, whether or not they could make use of the technique was another matter altogether.</p><br/><p>With a grin, Zhou Weiqing sat cross legged on the ground, saying: “Heh heh, I will break through the next Death Acupuncture Point right now for you all to witness, and you can carefully sense every detail of it to see whether or not my Immortal Deity Technique can be used. As for why I can survive the breaking through of all these Death Acupuncture Points, to be honest, I am also not certain why… but I sense that it could be because of my own bloodlines that allow me to have an extremely powerful recovery rate. I will not lie to you three, this Immortal Deity Technique of mine is truly tantamount to suicide, and perhaps only one in ten thousand people can cultivate it. Even if one succeeds in breaking through the first Death Acupuncture Point, from then on, each and every other Death Acupuncture Point one breaks through is also a matter of life and death. From the start of my cultivation til now… the amount of pain I had to go through… heh heh.”</p><br/><p>Perhaps he had grown used to it, or perhaps because of Bing’er, all of a sudden Zhou Weiqing found that he was no longer as afraid of that violent pain that the Immortal Deity Technique signified every time he broke through a Death Acupuncture Point; at least for now his psyche was without any problems in that matter.</p><br/><p>He did not say anything further, and without further ado, he started cultivating. He knew that with the power of the two in front of him, they could easily sense everything about his cultivation and breakthrough.</p><br/><p>Zhou Weiqing had long since memorised the circulation route to breakthrough the next Death Acupuncture Point, and his Heavenly Energy had long reached the maximum of his current stage. Circulating his Heavenly Energy, he gathered his massively thick Heavenly Energy which had formed into the liquid state, passing through all fourteen energy whirlpools and picking up speed… before striking out directly at the fifteenth Death Acupuncture Point.</p><br/><p>The Jiuwei Acupuncture Point. 1</p><br/><p>Position: Seven inches above the abdomen, half inch below the appendix ensiformis.</p><br/><p>Channel Vessel Type: Ren(Channel) Meridian, the connecting point for many meridians. Once broken through, it would also affect the epigastric arteries, veins, liver, gallbladder and even the heart, causing the bloodstream to slow down and even stop, causing death. 2</p><br/><p>This was the Second Death Acupuncture Point in the chest area that was part of the Third Portion of the Immortal Deity Technique.</p>\n</div>"}