{"title": "Chapter 346", "id": 346, "volume": 4, "url": "http://boxnovel.org/heavenly-jewel-change-chapter-346", "volume_title": "Volume 4", "body": "<h1>Chapter 346</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>The current Zhou Weiqing was much more stable, matured than that time. He could sense an occasional cold light in Zhou Weiqing’s eyes, giving him a chill down his spine, even if it weren’t directed at him.</p><br/><p>Originally, Ma Qun had thought that in breaking through to the second-Jeweled stage, he would be able to close the gap between himself and Zhou Weiqing. Alas, now, he realised that this was not true at all. From the pressure he sensed from Zhou Weiqing, the gap had not closed at all, and the reverse was true instead, with the gap between them widening further. This gave him a chill in his heart, as a slight fear towards his young leader was added to the respect he had.</p><br/><p>Zhou Weiqing stood at the doorway, looking out into the small yard outside. His hands behind his back, he stood silently with his eyes closed.</p><br/><p>Sixteenth Level of Heavenly Energy, his energy whirlpools spinning silently automatically, the atmospheric energy from all around drawn into his body. At that moment, Zhou Weiqing felt as if he was totally one with the environment, as if the world’s energy was part of him.</p><br/><p>Is this the feeling of the Zun Stage? Zhou Weiqing thought to himself curiously. However, when his mind wandered, that feeling of being integrated with nature disappeared.</p><br/><p>All of a sudden, his eyes snapped open, his gaze focusing on a spot in the distance. In a biting cold tone, he said: “Since you are already here, why are you hiding yourselves?”</p><br/><p>As if responding to his words, six men jumped out from all around the yard, forming a semicircle around Zhou Weiqing.</p><br/><p>They were all dressed in black, with black cloth covering their faces, looking at Zhou Weiqing with clear killing intent in their eyes.</p><br/><p>Hearing the noise outside, Ma Qun dashed out. When he peered out from behind Zhou Weiqing, he couldn’t help but draw a cold breath as he saw the six men outside. All of them were actually Heavenly Jewel Masters, and more so, with all of them at the six-Jeweled cultivation level, depicted clearly by the pure coloured Physical Jewels revolving around their right wrists.</p><br/><p>Six Upper Level Zun Stage Heavenly Jewel Masters. In any ordinary empire, this was already considered a force to be reckoned with. Yet, now, this force was right in front of them, and their target was clearly Zhou Weiqing.</p><br/><p>Just a few moments ago, Ma Qun had thought Zhou Weiqing had been exaggerating about the dangers, and hadn’t thought much about it. However, it seemed like his judgement was unfortunately just too accurate. In fact, their enemies had moved even faster than Zhou Weiqing’s expectations, appearing not long after they had returned to the house.</p><br/><p>Of the six black clad men surrounding them, the one who seemed to be their leader said coldly: “You’re the remaining spawn of the Heavenly Bow Empire, Zhou Weiqing?’</p><br/><p>Zhou Weiqing pursed his lips disdainfully, saying mockingly: “You are the trash of the Bai Da Empire, six disreputable little rats hiding in the shadows?”</p><br/><p>The black clad leader said coldly: “You sure are full of wind for someone about to die.”</p><br/><p>Zhou Weiqing laughed heartily: “Mere trash like you think you can kill me?”</p><br/><p>“Take action!” The leader knew that a long night was fraught with many dreams 1 This was after all the Fei Li Empire, and they did not want to risk failure. With that command, the six black clad men sprung into action, striking out directly at Zhou Weiqing together.</p><br/><p>Zhou Weiqing’s first action was not to retaliate, instead kicking out backwards right onto Ma Qun’s chest, sending him flying back into the room. Facing so many six-Jeweled powerhouses, Ma Qun would not be of any aid, and would only be a free kill.</p><br/><p>The six black clad men were extremely good teamwork, with the tacit understanding of a team which had worked together for a long time. To send such a strike team of so many Upper Level Zun Stage Heavenly Jewel Masters against Zhou Weiqing, they truly had a high opinion of him.</p><br/><p>The two centermost black clad men charged forward directly towards Zhou Weiqing, while two others jumped up into the air to strike down from above. The last two remained at a distance, both with staves in their hands. One of them waved his staff, and a bolt of green light flew out towards Zhou Weiqing. That was an extremely familiar Skill to Zhou Weiqing, one that he had Stored as well, the Fetters of Wind. The other man also held out his staff, fire bursting out from it as an array of fireballs flew out towards Zhou Weiqing.</p><br/><p>Close combat, Ranged combat, aerial combat. In that moment, Zhou Weiqing was facing attacks from every corner.</p><br/><p>If it were the Zhou Weiqing from the past, facing so many powerful enemies, his instinct would definitely be to think of a plan how to flee. However, the current Zhou Weiqing was totally different; not only was his power at a whole new level, just the sheer hatred in his heart towards the Kalise and Bai Da Empire had already reached a boiling maximum, and he would not retreat so easily without a fight.</p><br/><p>In a flash step, Zhou Weiqing did not retreat, but advanced instead, shooting forward like a cannonball towards the two incoming close combat enemies.</p><br/><p>In the next moment, an aura of light twisting about appeared around Zhou Weiqing’s body, at the same time that the Fetters of Wind hit him, causing it to lose effect. That was Zhou Weiqing’s powerful Time Attribute Skill, the Time Disorder Skill.</p><br/><p>To the black clad men, with the six of them versus a single opponent, all at a higher cultivation level to boot, the only option left for Zhou Weiqing was to retreat back into the house, to make use of the restricted space of the rooms to flee. In truth, this was what they had expected and planned for, as the actual team sent this time was eight men, not six! These Heavenly Jewel Masters were all from the Bai Da Empire; due to Zhou Weiqing’s astounding display in the Heavenly Jewel Tournament, they were resolute in killing him off. As such, they had sent eight powerful Heavenly Jewel Masters, with the highest one being at the seven-Jeweled stage! Once Zhou Weiqing retreated into the house and fled from the other side, the two had already set an ambush at the back of the house, ready to deal the final blow. Even if they couldn’t kill him off straight away, they could easily hold him off and allow the other six to surround him in the shortest possible moment.</p><br/><p>Alas, things had not gone according to their plan at all. Even facing six powerhouses, Zhou Weiqing had made the unbelievable choice of taking them head on. Who could have ever imagined that he would do such a thing instead of the sensible option?</p><br/><p>Four Icy Jade Physical Jewels appeared instantly around Zhou Weiqing’s right wrist, and as his Time Disorder Skill blocked off the Fetters of Wind, the two sides had already clashed.</p><br/><p>These two men had a pretty complementary set of skills, one with the Strength Attribute and the other with the Flexibility Attribute. The one of the left, with the Flexibility Attribute, directly stuck close to Zhou Weiqing, a short blade in each hand, striking out towards Zhou Weiqing’s vital points. As for the other man, he charged towards Zhou Weiqing with lowered shoulders ahead, around which was surrounded by a thick Consolidated Equipment pauldrons. At the same time, the two men in the air were dove downwards at him, fully surrounding him.</p><br/><p>Immediately, Zhou Weiqing’s already large and robust body bulked up drastically, as he entered the Demonic Change State. The change was most obvious in his arms and legs, almost bursting out from his sleeves and pants, revealing the black tiger tattoos on his skin and the terrifying looking muscles.</p><br/><p>At this moment, his battle experience combined with his top rated Skills showed their nigh unparalleled powers.</p><br/><p>The Curse of Doom landed instantly on the black clad man charging at him with his shoulder. At the same time, his right hand struck downwards at him.</p><br/><p>His target was indeed powerful; his Elemental Jewel Attribute was the Earth Attribute, and when Zhou Weiqing unleashed the Curse of Doom on him, he quickly responded with a quick protective Stone Skin Skill.</p><br/><p>Alas, Zhou Weiqing was after all Zhou Weiqing, and in the next moment, the familiar dark gold glow of the Consolidating Equipment God Protective Aura sprang forth around him.</p><br/><p>Almost immediately, the incoming fireballs from the other ranged enemy smashed ineffectively onto the Consolidating Equipment God Protective Aura, the difference between their cultivation level and power was insufficient to break through it. That short split second was enough to decide that black clad, Strength Attribute man’s fate.</p>\n</div>"}