{"title": "Chapter 344", "id": 344, "volume": 4, "url": "http://boxnovel.org/heavenly-jewel-change-chapter-344", "volume_title": "Volume 4", "body": "<h1>Chapter 344</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>Zhou Weiqing’s gaze froze. Since he heard that his father and godfather were still alive, he had recovered quite a lot, and his mind was racing at top speed. Instantly, he said solemnly: “Just now you said that I have caused a shockwave through the Royal Family of the Fei Li Empire… so I guess… Can you tell me about it now?”</p><br/><p>Cai Cai nodded, saying: “Not long ago, Ye Paopao rushed back and informed us regarding your efforts and results in this year’s Heavenly Jewel Tournament. Without question, by defeating and killing the Bai Da Battle Team, beating the Dan Dun Empire and even gaining the final champion, you all are heroes of the Empire. Such an honour, no one has ever gained before. His Majesty was overjoyed, and wanted to confer a noble title to all of you, granting each of you the greatest honours. After all, you all have brought back the Heavenly Jewel Plaque and also brought much honour to the Empire. It could be said that in the entire history of the Fei Li Empire, no one has ever done anything that could match your accomplishments. Indeed, if you were not in the Fei Li Battle Team, this would have happened… Alas, when the Heavenly Bow Empire was suddenly destroyed, it caused much trouble…”</p><br/><p>“You are the son of Admiral Zhou from the Heavenly Bow Empire, and more so you have proven your outstanding talent during the Heavenly Jewel Tournament. If our Fei Li Empire gives you a huge reward, then your draw and appeal will reach a terrifying state. When the Heavenly Bow Empire was destroyed… our Empire had decided to guard our own borders and not counter attack the Bai Dai Empire… Do you understand what I mean?”</p><br/><p>Zhou Weiqing’s eyes turned cold, and he slowly nodded, saying: “So… that is to say… the Fei Li Royal Family is afraid that I will have a bad effect on the Fei Li Empire, and for the sake of revenge, draw too many of their talents right?”</p><br/><p>Cai Cai smiled bitterly and sighed, before nodding as she said: “Yes, that is the gist of the matter. Because of this matter, the Royal Family has been embroiled in a massive debate. A portion thinks that you have already done so much for our Empire, and you have to be rewarded. However, another portion things that if you continue staying in the Academy, learning too much and perhaps enter our Fei Li Empire Army, it will have severe repercussions for us in the future. You are after all not a Fei Li Empire citizen…”</p><br/><p>Zhou Weiqing smiled passively. Towards all of that, he did not want to argue. The moment he had heard the news regarding his father and that he was still alive, his heart had already brightened.</p><br/><p>“That is alright, Principal Cai Cai, just tell me the result, I can accept it.”</p><br/><p>Cai Cai said: “The final result of all the debate was… two choices for you… Firstly, you proclaim to the world that you have left the Heavenly Bow Empire and joined our Fei Li Empire as a citizen. Your reward for the Heavenly Jewel Tournament will be given out to you, but you must leave the Academy, and also will never be able to join the Army. The second choice… is you do not join our Empire as a citizen, you will get a million gold coins, but you must also leave the Academy.”</p><br/><p>Zhou Weiqing smiled passively and said: “I am only seventeen years old this year, is it necessary for the Fei Li Empire to be so nervous? Ally… this is our Heavenly Bow Empire’s Ally…”</p><br/><p>Cai Cai lowered her head in shame. “I’m sorry Weiqing. Each Empire has their own troubles… The WanShou Empire border has much conflict, and their armies have been attacking in greater strength this year. We just do not have the resources and manpower to counter attack the Bai Da Empire, and we can only guard ourselves against them. This is also the reason why they have been so daring as to attack your Heavenly Bow Empire… they have exactly seen that happening and seized the opportunity. In the Heavenly Jewel Tournament, you may have created many miracles, but at the same time, you also offended the Blood Red Hell…”</p><br/><p>Zhou Weiqing stood up and said: “Principal, I understand, you do not need to say anymore. I will leave the Academy. In a while, I will bid farewell to my classmates, then I will leave. I will never give up my own nationality, even if my Empire is already gone for now. As for that million gold coins, it is not necessary. However, please help me inform the Royal Family that from today onwards, our Heavenly Bow Empire will no longer be allies to the Fei Li Empire.”</p><br/><p>After saying that, he pulled up Dou Dou, who had been listening at the side, confused. Turning around, he walked out of the office.</p><br/><p>Cai Cai looked at Zhou Weiqing’s disappearing back and couldn’t help but sigh. She did not tell Zhou Weiqing that she had fought so hard for him, and this was the best she could do. In the Fei Li Empire, there were actually many who were against him, with a few even wanting to imprison him or kill him, to prevent any future problems.</p><br/><p>Regarding Zhou Weiqing, Cai Cai knew that deep within, she admitted to herself that she could not read this young man. She did not know exactly how far he could go in the future, but she knew it would be far indeed. Alas, no matter what, she was just a woman. Despite all her talents, she did not have a status that matched it in the Fei Li Empire, especially regarding the policy decisions of the Empire; she was just not given a say, and it was all she could do to influence it as best she could. And now, all she could do was stand there and watch as a young man with unlimited potential be given up just like that, just for the short sighted, short term gain of the Empire.</p><br/><p>To give up on Zhou Weiqing, it would seem to be of great benefit to the Fei Li Empire now. First, and perhaps most importantly, it would get the Blood Red Hell off their backs. Next, they would not need to worry that Zhou Weiqing would grow in influence within the Fei Li Empire, and perhaps have a negative impact on them in the future. If Zhou Weiqing was just an ordinary Heavenly Jewel Master, perhaps they would not care so much, no matter how powerful he grew. Alas, he was not of ordinary background. As the son of Admiral Zhou, it was without question that he would step on the path of revenge.</p><br/><p>What Zhou Weiqing did not know was that one of the main reasons why the Fei Li Empire had finally gone on this path in treating him like this was because of Ye Paopao’s father, the Premier of the Empire. Indeed, it was he who had been a greatest influence in having this decision set in stone. That was also because Ye Paopao had been by Zhou Weiqing’s side for so long, and he was quite familiar with his character. It was he who had described the possible threat Zhou Weiqing might pose to his father.</p><br/><p>Without a doubt, Ye Paopao admired, even respected Zhou Weiqing. However, with the interests of his Empire in mind, and perhaps more so because of that ugly jealousy in his heart, he had finally chosen to describe Zhou Weiqing as a threat.</p><br/><p>Cai Cai did not tell Zhou Weiqing all of that, as she was hoping that he would not regard the Fei Li Empire as an enemy. Alas, from the way things were going, her hopes were just too naive on her part.</p><br/><p>Cai Cai did not blame Zhou Weiqing for making such a decision. If it had been her, she might not been able to remain as calm as him.</p><br/><p>As he walked out of the office, a cold smile touched the lips of Zhou Weiqing. Fei Li Empire, very good indeed, Fei Li Empire!</p><br/><p>In truth, Zhou Weiqing was not disappointed. That was because, on their way back to the Fei Li Empire, he had already lost hope in them.</p><br/><p>The Heavenly Bow Empire had been invaded by the combined armies of the Kalise and Bai Da Empire for so long, if the Fei Li Empire had truly wanted to help the Heavenly Bow Empire, they would have started taken action long ago. However, they did not even seem to have the intention of moving at all.</p><br/><p>So what if I do not have the help of the Fei Li Empire? In fact, Zhou Weiqing had never planned to stay on at the Fei Li Military Academy, and his current feelings were not disappointed at all. On the contrary, he was overjoyed; hearing that the Heavenly Bow Palace was still intact, his father, godfather, and possibly his mother all still alive. There was still hope for the Heavenly Bow Empire, and at least, there was still a hundred metre radius of land that was still, in name, under the Heavenly Bow Empire. To Zhou Weiqing, this was enough.</p><br/><p>Pulling Dou Dou along with him back down the stairs, Zhou Weiqing soon reached the Commoner Class One’s classroom. Although Cai Cai did not say much, he could easily guess that since the Fei Li Empire did not welcome him any longer, it would be best for him to leave as quickly as possible.</p><br/><p>When Zhou Weiqing entered the Commoner Class One, he saw that besides his entire class and Ming Hua, there were two others in the room as well. The first was Yun Li, his Lifetime Follower that had entered the school as a temporary teacher, and the other was the leader of the senior classes, Zang Lang.</p><br/><p>When they had heard that Zhou Weiqing had returned, these two had rushed to find him as soon as they could.</p><br/><p>Zhou Weiqing bade Dou Dou to sit at his original seat, and he walked up to the teaching platform at the front of the class, ignoring Ming Hua who had been standing there.</p><br/><p>Ming Hua was speechless with anger, but she could not say anything at that point. With a humph, she backed to the side to stand together with Yun Li.</p><br/><p>Behind the podium, Zhou Weiqing looked down to see a sea of heated gazes looking excitedly at him. All of a sudden, Zhou Weiqing bowed down in a ninety degree angle towards all his classmates.</p><br/><p>“Boss, what are you doing?” All of the students were shocked, and Kou Rui couldn’t help but jump up and exclaim loudly. The rest of the students also stood up.</p><br/><p>“Everyone, sit down…” Zhou Weiqing stood up straight once more, and said solemnly.</p><br/><p>What was prestige and status? At this moment, Zhou Weiqing’s status truly showed itself. All the students who had stood up sat down, and the entire class fell into silence.</p><br/><p>Zhou Weiqing sighed and said: “I bowed to everyone because I have to apologise to all of you. I’m afraid that I will not be able to fulfil my previous promise to you all. In a moment, I will be leaving the Academy, and I’m afraid I can no longer study with all of you again. I will leave a sum of money behind, and if you all scrimp and do not waste it, it should be enough for most of your Consolidating and Skill Storing needs. I’m sorry, all of you.”</p><br/><p>“Boss, you… you are leaving?” This time, even the normally quiet Yan Zhexi exclaimed urgently, and the rest of the students also showed a shocked look on their faces.</p><br/><p>Zhou Weiqing nodded and said: “I’m sure you have all heard… my homeland… the Heavenly Bow Empire has been invaded and conquered by the Kalise and Bai Da Empire. The Fei Li Empire has already decided not to counter attack on our behalf, and have also forbidden me to continue studying here in the Academy. As such, I can only leave. There is nothing much else to say, but no matter what, you will all still be my good brothers. At least, we have all sat in the same classroom, and studied together before. Please do not forget what I have said to you all, although we are commoners, but we need to stand up straight. I cannot bear to leave you all, but this is a path I have to take. I hope that in the future, I will be able to meet with you and fight with you all together on the battlefield. Zhexi, come here…”</p><br/><p>Yan Zhexi walked up the Zhou Weiqing, still in a daze.</p><br/><p>Zhou Weiqing smiled faintly, clapping on the shoulders as he said: “It looks like in the few months I have gone, you have done a good job in leading the rest, and everyone is able to accept you. In that case, once I leave, you will be the class leader of our Commoner Class One. Do not forget our legacy, unity is strength. As long as you all work together as one, no one can bully us. Here, this card has ten million gold coins stored within, and it is all I can leave for you all. Although I can no longer fulfil my full promise, and cannot continue creating Consolidating Equipment Scrolls for you all, but at least I can do this much. I trust that you will use this wisely for everyone…”</p><br/><p>As he said that, Zhou Weiqing shoved the card that he had prepared into Yan Zhexi’s hands. Once more, he swept his gaze around to look at all his erstwhile classmates. Taking a deep breath, he spun around to take his leave.</p>\n</div>"}