{"title": "Chapter 341", "id": 341, "volume": 4, "url": "http://boxnovel.org/heavenly-jewel-change-chapter-341", "volume_title": "Volume 4", "body": "<h1>Chapter 341</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>Zhou Weiqing stood up, holding onto Tian’er’s hands and he kissed them lightly before saying: “Come on, let’s go to the Skill Storing Palace.”</p><br/><p>“En.”</p><br/><p>Zhou Weiqing informed Lin TianAo quickly before heading to the Skill Storing Palace together with Tian’er. This time, they stayed there for three whole days.</p><br/><p>In this three days, not only did Zhou Weiqing complete all the Skill Storing of his fourth Elemental Jewel, he also managed to complete Consolidating the next two pieces of his Legendary Set. By the time he walked out from the Skill Storing Palace, holding onto Tian’er’s hands as he did so, he felt as if he were totally reborn.</p><br/><p>When they had first arrived at the ZhongTian City to join the Heavenly Jewel Tournament, he was only at a mere three-Jeweled cultivation level, and both his Stored Skills and Consolidated Equipment were not completed then. Yet, now, he was already a four-Jeweled Low Level Zun Stage Heavenly Jewel Master, with all Consolidated Equipment and Stored Skills to boot. More so, he had gained many powerful, highly rated Skills, and now had a total of three Legendary Set pieces! His entire power levels had definitely skyrocketed, a mighty force to be reckoned with.</p><br/><p>“Weiqing, let us rest for a day, we’ll leave tomorrow ok?” Tian’er said softly.</p><br/><p>It was already in the evening at that time, and descending from the Heavenly Jewel Island was not too safe. As such, Zhou Weiqing agreed, and the two returned to their inn. Zhou Weiqing went to look for one of the employees on the Heavenly Jewel Island to pass a message to Shangguan Longyin that the entire Fei Li Battle Team would be leaving the next day.</p><br/><p>The night grew later, and Zhou Weiqing stood by his window, staring out into the distance. The Heavenly Jewel Island was high up above the sea level, and here, he could see many stars that were usually covered on the ground. The stars in the skies seemed to be like many precious jewels embedded in the heavens, twinkling and shining, a beautiful and grand sight.</p><br/><p>Looking in the direction of the Heavenly Bow Empire, Zhou Weiqing’s fists clenched hard. Father, Mother, Godfather, I will definitely take revenge for all of you. Even if it is just me alone, no matter how long it takes, I will definitely destroy the Kalise and Bai Da Empires.</p><br/><p>At that moment, his mind involuntarily thought of the Lustre Spatial Realm, and that unbelievably powerful sight of the majestic Heavenly God Stage Dragon and the Skill it had unleashed, overwhelming the entire skies. Although a Heavenly God Stage powerhouse could not stand and fight against an entire army of a million strong, but even if once was a failure, a second time was a failure, that did not mean he would fail forever. Zhou Weiqing had thought things through and come up with a basic plan. If possible, he would try his best to raise an army of his own to restore his homeland. If that was not possible, then he would cultivate hard, training hard to become a powerhouse, a killing machine, stabbing right into the heart of the enemy.</p><br/><p>A soft, warm body pressed against him from behind, and a pair of arms encircled his waist gently. Zhou Weiqing turned around slowly to see Tian’er, especially beautiful under the shimmering moonlight, dressed in a snow white long dress, accentuating her long flowing white hair and the pair of mesmerising purple eyes.</p><br/><p>She is my woman now! Zhou Weiqing couldn’t help but feel a sense of pride well up within his heart. Gently, he wrapped Tian’er in his arms. At that point, he suddenly felt a wild dream overcome him. If one day, when everything ended and the dust settled, he would bring Bing’er and Tian’er to this beautiful Heavenly Jewel Island to stay forever, and not have a care in the world. That would be wonderful indeed.</p><br/><p>Tian’er lowered her head, covering her sorrowful eyes, burying her head into Zhou Weiqing’s chest as she said softly: “Weiqing, take me.”</p><br/><p>How could Zhou Weiqing resist such a request? Stretching out his arms, he lifted Tian’er up in his embrace, feeling her soft body trembling. Instantly, the negative emotions in his heart disappeared once more, as the two young lovers intertwined in both body and soul.</p><br/><p>This was another sleepless night; not just for Zhou Weiqing and Tian’er, but also the other poor fellows in the inn. When Tian’er’s loud, wild cries rang out loud, Zhou Weiqing couldn’t help but think to the future, that they would have to find a more desolate and widely spaced place to live in.</p><br/><p>Tian’er seemed even wilder this night; having tasted the forbidden fruit of desire, she was actually more on the initiative this time.</p><br/><p>At such a young and hot blooded age, naturally our dear Zhou Little Fatty was not to be outdone. After a long, drawn out ‘fight’, the white tiger finally lost out to the black tiger, begging for mercy as it was ‘defeated’…</p><br/><p>“En?” When Zhou Weiqing was awoken from his dreams by the sun shining in from the window, he subconsciously embraced the figure beside him, only to meet with nothingness.</p><br/><p>Tian’er was not beside him, and Zhou Weiqing sat up on the bed, stretching himself as he sensed the faint scent Tian’er had left in the air, and a great sense of satisfaction filled his heart.</p><br/><p>The truth had indeed proven itself, and Tian’er was indeed right. As the two had coupled the second time, their Heavenly Energy had only improved slightly, definitely nothing in comparison to the immense increase of the first time. Even so, as Zhou Weiqing woke up in the morning, he felt as if his body was lighter, feeling great overall.</p><br/><p>In his most painful moment, she was there for him. At the time when he was almost about to break down, she had used her soft body to gently comfort his aching heart. Perhaps, their road ahead would be extremely tough and fraught with difficulties, but no matter what, Zhou Weiqing would not back down. She was his, forever.</p><br/><p>Looking around, Zhou Weiqing suddenly spotted a letter lying on the bed where Tian’er had been last night. Picking it up, he opened it casually. However, when he saw the first line of words of the letter, he suddenly froze.</p><br/><p>“Weiqing, by the time you read this, I will have left. Although it was unbelievably difficult to make this decision, I have no choice but to do so and leave you. I’m sorry Weiqing, that I have to leave you in the time of your greatest need, but I have no choice at all…”</p><br/><p>Tian’er’s words were somewhat jumbled, clearly when she was writing this letter, she had been at such a loss. “In the Heavenly Jewel Tournament finals, the members of the WanShou Battle Team had already spotted me. When you were learning from the three Masters, they came looking for me, asking me to return together with them. However, I rejected them. Alas, now that they have already spotted my whereabouts, they also realised that something is between us. They already left a while back, but I stayed here to wait for your return. I’m afraid that by now, Father will have sent men, and that fiance of mine, here to look for me.”</p><br/><p>“You are already in too much… way too much trouble. I cannot allow you to get into more trouble because of me, to be hurt because of me. As such, I have no choice but to leave. Luckily, before I do so, I am able to give myself to you. Do not worry, since I am already yours, that will never ever change. No matter how much they try to force me, I will only be Zhou Weiqing’s woman.”</p><br/><p>“Father only has one child, and as his only daughter, he will not force me too much. As long as I threaten him with my death, he will not be able to do anything to me. However, I’m afraid that in the near future, I will not be able to look for you.”</p><br/><p>“Do not come looking for me, please, I beg you. I know that with your character, it is easy for you to throw caution to the wind, to put your all in doing something despite any dangers. If you really do so, then you will be wasting the painstaking trouble that I have gone through now. You have many important things to do, and many people depending on you now. At least, before you have sufficient power, you cannot come looking for me. For myself, I will try my best to persuade my father.”</p><br/><p>“I may have left, but I have no regrets, only a longing for you. Weiqing, you have never told me that you loved me yet, but… I love you.”</p><br/><p>The final words were her signing off: Your Tian’er, your Fat Cat.</p><br/><p>Grasping the letter in his hands tightly, Zhou Weiqing rushed out of the room into the clear fresh air outside. The chill of the morning gave his heart a slight chill of bleakness.</p><br/><p>Bing’er would not return with him, and Tian’er had also left. Although he knew that Tian’er had done so for his own sake, he couldn’t help but feel a sharp pain in his heart.</p><br/><p>Tian’er, I love you! Zhou Weiqing howled out loud in his heart. Alas, Tian’er was no longer able to hear it. Who knew when he would be able to actually speak those words to her directly.</p><br/><p>…</p><br/><p>Descending the Heavenly Jewel Island, the team purchased fourteen fine horses. With seven of them each riding one, they galloped at top speed towards the Fei Li Empire.</p><br/><p>In the end, Zhou Weiqing did not go looking for Tian’er. His feelings were undoubtedly important, but at this moment, the demise of his homeland filled his heart. Furthermore, at this moment, he truly did not have the power and qualification to go looking for Tian’er.</p><br/><p>The reason why there were seven of them was because they were joined by someone else from the Heavenly Jewel Island. It was a twenty three year old young lady, with a rather easy to remember name, Dou Dou.</p><br/><p>Dou Dou did not belong to the Heaven’s Expanse Palace, but she was the direct disciple of Xing Tianyi, the head of the three Masters!</p><br/><p>Previously, after the thirty seven days Zhou Weiqing had spent learning from the three Masters, Xing Tianyi had asked Zhou Weiqing to bring this young disciple of his along to travel and experience the world.</p><br/><p>Dou Dou had been adopted since she was a baby, and brought up by Xing Tianyi. All her life, she had lived in the Heavenly Jewel Island, and it could be said that she was extremely sheltered, with no contact at all with the outside world. Xing Tianyi hoped that she could go out into the real world and experience everything for herself. With Zhou Weiqing’s protection, he was also more at ease. This was also a decision Xing Tianyi had made after learning from the Heaven’s Expanse Palace about how Zhou Weiqing had risked falling out with the Heaven’s Expanse Palace when he had protected that mother dragon and egg in the Lustre Spatial Realm.</p><br/><p>In comparison with his power, Xing Tianyi’s choice was more because of his appreciation of Zhou Weiqing’s character.</p><br/><p>As for Dou Dou, Zhou Weiqing had actually only met her for the first time after leaving the Heavenly Jewel Island. The events of the Heavenly Bow Empire had caused him to be confused and disconcerted, and he had totally forgotten about his previous promise. However, when Xing Tianyi had been notified by the Heaven’s Expanse Palace about Zhou Weiqing’s leaving, he quickly sent Dou Dou out personally to join him.</p><br/><p>At that point, Zhou Weiqing had told Xing Tianyi that this time, when he returned, he would definitely be facing many dangers, and did not recommend bringing Dou Dou along. After all, he could not even guarantee his own safety, let alone hers. However, Xing Tianyi insisted in him bringing her along, indicating that she could protect herself, and that it was time that she got out to experience the world.</p><br/><p>In the end, Zhou Weiqing did not reject it. Not only did he owe the three Masters a lot, this young lady Dou Dou was also a powerful and skilled Grandmaster Consolidating Equipment Master in her own right. According to Xing Tianyi, she was already not far from reaching the Zong Stage!</p><br/><p>After all, Xing Tianyi could be said to be the current top God Tier Consolidating Equipment Master in the entire world, and could his personal disciple be bad at all?</p><br/><p>This Dou Dou was not especially beautiful, especially when compared with top beauties like the three Shangguan sisters, Tian’er and Little Witch; her looks were above average at best, and a far cry from them. However, she brought a totally different feeling to the rest of the Fei Li Battle Team members.</p><br/><p>Dou Dou had one favourite hobby, and that was eating. She did not have much contact with the outside world at all, and in terms of her character, she was a little blur in that sense. She did not know about the perils of human character, and as long as someone gave her something good to eat, she would follow along. Of course, for Zhou Weiqing to successfully bring her along, besides her Master’s instructions, he had indeed used that tactic.</p>\n</div>"}