{"title": "Chapter 355", "id": 355, "volume": 4, "url": "http://boxnovel.org/heavenly-jewel-change-chapter-355", "volume_title": "Volume 4", "body": "<h1>Chapter 355</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>Zhou Weiqing said playfully: “You can do it! There is a vast gap between you and Crow now, and you better not make her wait for you and delay her own cultivating and power gain.”</p><br/><p>Ma Qun said angrily: “Boss, how can you look at me like that! Am I not working hard? My talent is also very outstanding!”</p><br/><p>Zhou Weiqing walked over to Lin TianAo, clapping on the shoulders and looked to Ma Qun before saying: “Actions speak louder than words. In the future, Bro Lin will be your teacher, learn well from him. He will teach you how to make use of your ultimate defense to the maximum… Alright, brothers, let us head off!”</p><br/><p>As soon as he said that, they took action. The black clad men’s attacks had given Zhou Weiqing a severe warning. Although he was confident in his own abilities, he knew he was still at the four-Jeweled cultivation level. Amongst all of them, the one with the highest cultivation level was actually Little Miss Muddle Dou Dou. If one or two nine-Jeweled Heavenly Jewel Masters came over to kill them, they would not be able to do anything. A small numeric advantage was useless against absolute power.</p><br/><p>Zhou Weiqing, Lin TianAo, Ma Qun, Crow, Yun Li, Little Four, Xiao Yan, Drunken Bao; eight of them, in addition to Zang Lang’s twelve men, they were a party of twenty in total. If twenty of them were to move out together, it would draw too much attention. As such, after a quick discussion, they split into four groups, with five people in each group, and they would leave from different directions and times.</p><br/><p>After all, the first attack against Zhou Weiqing had just barely ended, and it would be some time before they were discovered to have lost. Even if they had truly been sent by the Fei Li Empire, as long as they did not seal the gates, there should not be another attack in the near future.</p><br/><p>After about two hours, the twenty of them finally regrouped outside the Fei Li City. They had not purchased mounts, and were all on foot. Now that they had gathered, they started heading towards the east under the leadership of Zhou Weiqing.</p><br/><p>As they hurried along, Lin TianAo moved along beside Zhou Weiqing, and he asked: “Weiqing, where are you planning to go? Are you not heading back to the Heavenly Bow Empire?”</p><br/><p>Zhou Weiqing said: “We only number twenty, and even if we return to the Heavenly Bow Empire, we will not be able to do anything. It would be like an egg striking a rock. My father has already managed to fight for and give me ten years to work with. In this ten years, I need to gather enough power to shake the Bai Da Empire. Even if it isn’t enough to defeat them, at least I need to be able to save my father and others. The Fei Li Empire has already taken notice of me, and staying here is useless. As such, I need to find a place where I can gather strength, to build up a troop of my own.”</p><br/><p>Lin TianAo thought about it for a moment, then said: “So, where are we going?”</p><br/><p>Zhou Weiqing grinned and said: “War might not be a good thing, but it is also the place with the best opportunities. In battle, we will be able to better improve ourselves. My original plan had been to join the Fei Li Empire’s army and fight in the northern border. However, now that they view me as a threat, I can only change my plan a little. Instead, I have decided to head to the northern border of the ZhongTian Empire to join the army, to find a relatively desolate area to grow my strength.”</p><br/><p>Lin TianAo nodded and said: “Very good, we’ll follow your arrangements then. We’ll take it a step at the time.”</p><br/><p>Joining the army, battling hard against enemies was every young man’s dream, and no one protested Zhou Weiqing’s arrangements.</p><br/><p>Just as they were about fifty li from the Fei Li City, all of a sudden, a black shadowy figure dropped down from the trees ahead, smashing down onto the road right ahead of them.</p><br/><p>Almost subconsciously, Lin TianAo and the others moved in front of Zhou Weiqing. Although he did not release his Assembly Set Shield, he looked on with a guarded look upon his face. The rest of the Fei Li Battle Team members also took their positions near Zhou Weiqing. As for Zang Lang and the others, although their cultivation levels were not very high, they were after all top graduates from their commoner class of the Fei Li Military ACademy, otherwise they wouldn’t have fought against working for the nobles. In that moment, the twelve of them spread apart in a crescent shape, in a formation that would allow them to protect the rest while also maintaining their own offense.</p><br/><p>It was only at this point that all of them finally saw that what had smashed onto the ground was actually a corpse… dressed in black. His neck seemed to have been snapped, and there was not much blood around, but there was clearly no signs of life any longer.</p><br/><p>“Come out.” Zhou Weiqing looked to the trees with piercing eyes. His Dragon Silencing Seals had already been fully used today, and if they met with any powerful foes, that would be troublesome.</p><br/><p>*Swoosh* A beautiful figure appeared silently at the front, and when Zhou Weiqing saw her face, he was totally shocked. “What… why is it you?” His expression turned ugly in that instant.</p><br/><p>That person pursed her lips, saying: “Why can’t it be me? What sort of expression is that? I took the trouble to kill off the scout following you, and not only did you not thank me, you are still giving me that look?”</p><br/><p>At Zhou Weiqing’s side, Yun Li looked at them curiously, and asked: “Weiqing, isn’t this Lady Bing’er?”</p><br/><p>Indeed, in Yun Li’s eyes, wasn’t it Shangguan Bing’er standing right in front of them? However, after all his experiences, Zhou Weiqing would definitely not recognize the wrong person, because around that ‘Shangguan Bing’er’s’ right wrist was a dark gold bracer-claw. Amongst the three Shangguan Sisters, Zhou Weiqing had only seen Shangguan Fei’er have a Consolidated Equipment like that. Of course, he did not know if Shangguan Xue’er also had a Consolidated Equipment like that, but he was definitely sure than she would not be so bored or senseless as to run all the way over here to just help them kill a spy.</p><br/><p>Zhou Weiqing was speechless for a moment. “That is not Bing’er, it is her sister, Shangguan Fei’er. Why are you here?” He looked at this young girl who looked like the one he loved so much, a slight hint of wariness in his expression as he dared not let his guard down. After all, he had experienced first hand how powerful Shangguan Fei’er’s close combat abilities were. In fact, with both sides in top condition, even if he used the Dragon Silencing Seal, he might not be able to defeat her, as her close combat fighting capabilities was just too terrifying.</p><br/><p>Shangguan Fei’er laughed lightly, walking towards Zhou Weiqing, and on seeing that she was known to him, Zang Lang and the others backed away to the side. The Fei Li Battle Team members clearly knew the tangled relationship between him and the three Shangguan Sisters, and they also moved aside while suppressing laughs.</p><br/><p>Shangguan Fei’er walked all the way to Zhou Weiqing before stopping, saying grandly: “I am here on behalf of Third Sister.”</p><br/><p>Zhou Weiqing started a little. “Bing’er asked you to come? What for? Could it be… Bing’er asked you to marry me as well, to be her substitute for this period of time, to wait upon me?”</p><br/><p>This young rascal always managed to trash talk while keeping a straight, serious face. Such a skill had to be learnt over years of practice……</p><br/><p>Shangguan Fei’er’s beautiful cheeks turned red, but she refused to back down so easily. “Wait upon you? Hmph, more like you wait upon me. I’m your sister in law after all, quick, call me big sister. I am here to help Bing’er keep an eye and monitor you, lest you be unfaithful to her and let her down!”</p><br/><p>“Bullshit, Your Father I still need you to monitor me? Shoo Shoo, if you want me to call you Big Sis, you can wait until Bing’er actually marries me then I’ll think about it.” Zhou Weiqing said exasperatedly.</p><br/><p>Shangguan Fei’er gave a cold humph and said: “Fine, I can leave, but when I go back, I’ll tell Bing’er that you have cheated on her, and fallen for that Heavenly Demon Sect Little Witch. Ohh and that Heavenly Snow Mountain’s Tian’er, that Divine Heavenly Spirit Tiger. Ahhh… Siighhh… My poor little sister, so foolish of her… having a sneaky third party right beside her as a tiger without her knowing it! Hmph, I will definitely tell her everything and show her your true colours. Zhou Little Fatty, you’re dead meat!”</p><br/><p>After saying that, she turned around and left, but after doing so and with her back to Zhou Weiqing, a mischievous look flashed across her face. Indeed, Shangguan Fei’er was not called the Little Demon Girl of the Heaven’s Expanse Palace for nothing.</p><br/><p>Zhou Weiqing stared at her with his jaw agape. If anyone else were to tell tales and try to sow discord between him and Shangguan Bing’er, he would scoff at the thought, as no matter what, he trusted that Bing’er would believe him. However, this Shangguan Fei’er was a tricky one indeed, and she was also Bing’er’s own sister. She had after all taken the trouble to follow him all the way, and if she returned to say that to Bing’er, wouldn’t Bing’er be hurt? From what Zhou Weiqing knew of Shangguan Fei’er, she would definitely do as she said.</p><br/><p>“Wait!” Zhou Weiqing quickly stepped forward, grabbing hold of her shoulder.</p><br/><p>Shangguan Fei’er did not struggle out of his grasp, instead turning her head to look at him. “Why are you grabbing on to me?” As she said that, she somehow remembered that scene where she had lost her first kiss to Zhou Weiqing, and gritted her teeth in sudden remembered anger, her tone turning accusatory.</p><br/><p>Zhou Weiqing could sense the accusatory tone, and immediately thought that Shangguan Fei’er was really going back to sow discord. Instantly, he put on a smiling face and said sweetly: “Big sis…”</p><br/><p>Shangguan Fei’er shuddered involuntarily, looking at him strangely. “Alright, enough. I’m getting goose pimples all over. Can you even act better?”</p><br/><p>Zhou Weiqing gave an apologetic smile and said: “Big sis, I’m wrong. I was such a bastard just now, it was because I was in a bad mood from what I suffered in the Fei Li City… As you can see for yourself, I’m all alone right now, no Little Witch or Tian’er with me ah! I’m wrong, I’m wrong, if you wish to stay and monitor me, please do so. I am happy to use my actions to prove how outstanding I am, that I am worthy of Bing’er.”</p><br/><p>Seeing this different Zhou Weiqing, with his obsequious apologetic smile, almost fawning on her, Shangguan Fei’er started momentarily, thinking to herself: What kind of person is he really?</p><br/><p>Originally, when Shangguan Fei’er had her first kiss stolen from Zhou Weiqing, she hated him so much that she wanted to kill him. She did not have the overall view of the situation like Shangguan Xue’er, or her control, and so she had done all she could to sneak into the ZhongTian Battle Team in an attempt to cause trouble for Zhou Weiqing.</p><br/><p>In the Lustre Spatial Realm, when she had fought with Zhou Weiqing and Little Witch, Shangguan Fei’er had been extremely vexed to have lost to the two of them. However, it was what happened next that had been deeply ingrained into her heart, and had also totally turned her view of Zhou Weiqing upside down.</p><br/><p>Shangguan Fei’er would never forget the resolute figure of Zhou Weiqing standing protectively before the mother dragon and her egg, and how he had spoken so righteously and boldly. It was as if she was looking at a totally different person. Was that still the man who stole her first kiss?!</p>\n</div>"}