{"title": "Chapter 372", "id": 372, "volume": 4, "url": "http://boxnovel.org/heavenly-jewel-change-chapter-372", "volume_title": "Volume 4", "body": "<h1>Chapter 372</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>She had never seen any Wind Attribute Skills do such a thing, as the usual effect of Wind against Fire would be an explosion, not such a cutting effect. Even for Spatial Attribute Skills, it was rare to have such a cutting effect.</p><br/><p>In truth, she could not be blamed for being so surprised and shocked. After all, the Skill that Zhou Weiqing had used was the Silver Emperor Wing Slash that he had Stored a long time ago from the first Silver Emperor he met; with his two arms like wings, it was a Ten Star Rated powerful Wind Attribute Skills. Normally, a Heavenly Jewel Master who had such a Skill would be at least at the Upper Level Zong Stage, how could Shen Yi have possibly seen such a thing.</p><br/><p>Zhou Weiqing did not really care why his opponent was so stunned and not reacting, and after his Silver Emperor Wing Slash had split apart Shen Yi’s attack, his right leg immediately exerted, and he flew like a cannonball towards her. Although he did not use any additional Skills, just the power of the Demonic Right Leg and his Wind Attribute boost allowed him to charge at an insane rate.</p><br/><p>Seeing Zhou Weiqing charge at her, Shen Yi quickly shook herself out of her shock, putting her arms before her, and it could clearly be seen that the third Star Ruby Elemental Jewel around her left wrist light up, and a huge swirling shield of fire appeared in front of her to block Zhou Weiqing. Almost at the same time, her second Elemental Jewel also lit up, and two green flames consolidated into a three-chi long knife respectively extending from her arms. It was clear that she was going all out now.</p><br/><p>However, the Silver Emperor Wing Slash was not so easily blocked. As he reached the fire shield, Zhou Weiqing slashed across with his right hand, and with a ear-piercing scraping sound, that Fire Shield which was at least rated Six Stars was split apart by the Silver Emperor Wing Slash. At the same time, Zhou Weiqing somersaulted into the air, the green blade of his left arm striking down towards Shen Yi from above, whistling as it cut through the air.</p><br/><p>Shen Yi’s expression changed in fright. Originally, she had planned to use the Swirling Fire Shield to block Zhou Weiqing’s attack, before using her Fire Knives to retaliate. Alas, she had not expected that Zhou Weiqing’s Skill was so powerful that her shield could not even withstand a single blow. In a panic, she could only sweep her hands up, using her Fire Knives to block the Silver Emperor Wing Slash.</p><br/><p>The Rating System of Elemental Jewel Stored Skills was extremely strict, and one of their requirements for ranking was that under the same amount of Heavenly Energy used, a higher Star Rated Skill would have an absolute suppressing effect on lower Star Rated Skills.</p><br/><p>Most of all of Zhou Weiqing’s previous opponents and enemies had been with cultivation levels far above his, and thus he had never ever been able to suppress his opponents with just his highly rated Skills. However, this Shen Yi was just at the same cultivation level as himself, at the four-Jeweled stage. If this were a fight to the death, perhaps she would not have even survived his first blow. After all, just not too long ago, Zhou Weiqing had slaughtered a bunch of six-Jeweled Heavenly Jewel Masters!</p><br/><p>Shen Yi’s Fire Knives were not even as highly rated as that previous swirling shield of fire she had summoned, and was only Five Star Rated. Facing Zhou Weiqing’s Ten Star Rated Silver Emperor Wing Slash, even with some of its energy dissipated, how could she possibly block it. Once again, the Fire Knives shattered and dissipated, and the green light on Zhou Weiqing’s arms sliced pass like lightning without even slowing down, as his Silver Emperor Wing Slash struck down towards Shen Yi’s body.</p><br/><p>“Have mercy!” Another feminine voice shouted out from below the stage.</p><br/><p>Zhou Weiqing was never a bloodthirsty person who killed easily, especially since the one he was facing was a beautiful lady. In a flash of green, Zhou Weiqing wriggled his fingers slightly, before his entire person passed by Shen Yi’s body, barely missing her.</p><br/><p>As Zhou Weiqing stopped about three yards behind her, Shen Yi was still standing there dazed, her arms still in the futile blocking position.</p><br/><p>In the next moment, another lady clad in skintight purple gear appeared in a flash from below the stage, appearing right next to Shen Yi, asking urgently: “Yi Yi, are you alright?”</p><br/><p>This young lady clad in purple looked to be slightly older than Shen Yi, about twenty six or twenty seven years old. She too had a head of short, pale green hair, slightly taller, with similar facial features as Shen Yi. It was clear that the two were sisters.</p><br/><p>Shen Yi started momentarily, looking at her sister. The next moment, she felt a sudden cold sensation on her body, and her sleeves flew into tiny pieces, floating away and revealing her arms. At the same time, the cloth around her waist was also cut, revealing a slim and attractive little waist.</p><br/><p>“Ahh!” Shen Yi exclaimed in shock, quickly covering her waist with her hands, her face turning beet red as she turned to glare at Zhou Weiqing angrily.</p><br/><p>Of course, she knew that Zhou Weiqing had already taken mercy, otherwise a blow that could slice her clothes like that could have easily killed her several times over. However, in her eyes, this was tantamount to killing her; having her clothes sliced into such a midriff-baring attire, it was just such a loss of face.</p><br/><p>The purple clad young lady flicked her wrist, and a robe appeared in her hands, and she quickly covered Shen Yi with it before glaring at Zhou Weiqing as well. “You Scoundrel! How can you cut a girl’s clothes like that?!”</p><br/><p>Zhou Weiqing looked at the two sisters innocently, saying: “I did not want to harm her, and I wanted to win this fight, what else could I do? I had to prove that I won the fight, and furthermore it can let all these brothers here have a short feast of their eyes. In any case, I made sure not to reveal any important positions right?”</p><br/><p>As he said that, he chuckled to himself. However, he soon realised that the atmosphere in the entire Duelling Corner was extremely strange, and not a single person laughed along with him. Zhou Weiqing thought to himself puzzledly: Could it be these soldiers all do not love to cause a scene?</p><br/><p>“You…” Shen Yi, freshly covered in the new robes, glared angrily at Zhou Weiqing with her face still totally red, as if blood was about to squeeze out of her pink cheeks. Furiously, she exclaimed: “You rotten egg, I’m going to kill you! Sis, help me kill this bastard! I… I…” As she said that, she could not stay here any longer, covering her face as she fled out. No matter how strong she was, no matter how high a rank she got to, she was still a woman at such times.</p><br/><p>Zhou Weiqing ignored the purple clad lady on the stage, instead turning to the temporary judge Company Leader, saying: “Hey, Big bro, isn’t it time to proclaim my victory? Look, my opponent already left the stage on her own accord.”</p><br/><p>“Uhhh…” The Company Leader glanced at the purple clad lady, swallowing hard as he said haltingly with great difficulty: “You… You have won.”</p><br/><p>Zhou Weiqing said: “Just now, that Shen Yi said that she could make the decision, as long as I defeated her, that I would be counted as being victorious through all the Intermediate fights and become a Company Leader directly, as well as a reward of twenty gold coins, if I remember correctly.”</p><br/><p>The Company Leader judge glanced once again at the purple clad young lady, and he saw that she had an ugly expression on her face, but did not say anything. As such, he could only put on a brave front and nod his head, saying: “Yes, you are indeed already a Company Leader, you just need to report to get your promotion. Come on little bro, you just follow me and we’ll get that handled.”</p><br/><p>Zhou Weiqing laughed heartily and said: “Wait wait! Isn’t there still the Advanced Competition? I heard that if one defeats the main ringmaster, I can directly become a Battalion Commander. Big bro, you have also seen for yourself, I have just angered a Battalion Commander, if I do not advance to the same position, won’t I be bullied in the future? Where is our main ringmaster of our Sixteenth Regiment? Please ask him to come, I would like to try.”</p><br/><p>To Zhou Weiqing, since the strongest Intermediate Ringmaster was a Four Jeweled Heavenly Jewel Master, it was likely that the main Advanced Ringmaster would be at the Five Jeweled stage. Although he was only able to use his Wind Attribute, as long as he was careful, he was confident of winning. Of course, he had some hidden techniques that he could use secretly if necessary.</p><br/><p>The Company Leader judged sighed inwardly, thinking to himself: If disasters come from nature, it is still possible to do something to counter them; but if they are of one’s own making,one is done for.</p><br/><p>Before the judge could open his mouth, the purple clad lady who hadn’t descended the stage suddenly said: “I am the main Advanced Ringmaster that you want to challenge. Don’t you want to fight? Very well then, we don’t need any complicated procedure, we can just start whenever. Since you have already fought previously, I won’t take advantage of you, and you can rest for an hour first.”</p><br/><p>“Ahh?” Zhou Weiqing had not expected that this elder sister of Shen Yi would actually be the main Ringmaster of the entire Duelling Corner. No wonder none of the soldiers had joined in a ruckus, as she would definitely be more powerful than Shen Yi. Who would dare to offend her? Only at this point did he shift his gaze to her face.</p><br/><p>This purple clad young lady had very similar features to Shen Yi, but with an additional resolute, firmness to her. The lines of her face were clear, valiant looking. She was taller than Shen Yi, at least 1.8metres; although she was not as exaggerated as Crow, standing there she still had an impressive aura and pride. It was clear that she was more stable and powerful than Shen Yi.</p><br/><p>Zhou Weiqing couldn’t help but sigh happily inwardly, it seemed like his luck was pretty decent today, and it was all going pretty well. It was only his sixth fight, and if he actually won this one, he would already directly become a Battalion Commander of the Sixteenth Regiment, leading a thousand men. This would allow him to carry out his plan and grow his strength at a much faster rate than expected.</p><br/><p>“I do not need to rest, I did not use much Heavenly Energy anyway. Let’s start then.” Zhou Weiqing said with a hint of excitement. In truth, the Silver Emperor Wing Slash did have quite a large expenditure of Heavenly Energy, but with his Immortal Deity Technique, he had pretty much recovered to his maximum.</p><br/><p>The purple clad lady said passively: “That is your choice then, I hope you do not regret it.”</p><br/><p>Zhou Weiqing laughed heartily and said: “There is nothing to regret about. The little sister has lost, and the elder sister is here now. I wonder, do you have yet another elder sister?”</p><br/><p>A flash of anger crossed her eyes, and she said: “Zhou Little Fatty right… You will pay for all you have done. A man who insults others will be insulted himself eventually.”</p><br/><p>Zhou Weiqing blinked and said: “That is true indeed. However, I hope you do not get your clothes ripped like your sister later on. By the way, beautiful lady, how may I address you?”</p>\n</div>"}