{"title": "Chapter 385", "id": 385, "volume": 4, "url": "http://boxnovel.org/heavenly-jewel-change-chapter-385", "volume_title": "Volume 4", "body": "<h1>Chapter 385</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>Sensing that he had successfully roused the spirits and enthusiasm of his Peerless Battalion soldiers, Zhou Weiqing smiled faintly before continuing: “For now, our Battalion rules are as such, just those three above. It shouldn’t be hard to memorise right? Very soon, Your Father, I, will let you bunch of substandard scoundrels and rogues understand, what is a true group, a community of shared interest, shared profit. I’ll show you all what I can bring to you all as a Battalion Commander. Alright, today’s gathering ends here. All of you, come over here according to your formation to collect your pay.”</p><br/><p>Zhou Weiqing had not planned to speak for too long for this first morning gathering. His purpose was not for them to approve of him right there and then, as that was likely impossible. What he needed to do was to give them a deep impression. Just words alone was never as effective as actions.</p><br/><p>The three simple rules that Zhou Weiqing had announced were rather simple, and besides a rare few, almost all the soldiers managed to collect two gold coins from him. With the gleaming gold coins in their hands, the reality of the situation struck, and Zhou Weiqing’s words suddenly held a greater weight.</p><br/><p>However, as soon as everyone finished collecting their gold coins, they suddenly spotted a massive dust cloud in the distance along with the loud thunder of hooves, clearly from a speeding group of cavalry heading in their direction.</p><br/><p>The Peerless Battalion soldiers all turned to look, and they could see a cavalry unit galloping towards them in the distance. Wei Feng stood beside Zhou Weiqing and said with a furrowed brow: “Commander, I’m afraid that those must be from the Sixteenth Regiment. From the dust they are throwing out, it must be a heavy cavalry unit, at least a whole Company. What do we do?”</p><br/><p>Zhou Weiqing smiled faintly and shouted out loud: “Brothers of the Peerless Battalion, there is a Company of Heavy Cavalry soldiers coming towards us now, most likely from the Sixteenth Regiment, here to look for trouble with us because of what happened yesterday. Let me ask all of you, with our Peerless Battalion’s power, compared to a Company of Heavy Cavalry, is our power at least three times that of theirs?”</p><br/><p>A stout soldier who had just gotten his gold coins cried out in a muffled voice: “Those heavy cavalry are nothing, Your Father, I, can take on four or five of them by myself!”</p><br/><p>Wei Feng said: “We have so many Jewel Masters, naturally a hundred Heavy Cavalry is nothing to us! However, if we really take action against them, what if the northern army decides to kill us off?”</p><br/><p>Zhou Weiqing smirked coldly and said: “That’s not possible. I dare say that this is a move by the Sixteenth Regiment alone, otherwise it would not be just a single Company. They are even more afraid of being found out by the northern command than we are. Brothers, when they reach us later, wait for my command before taking action. Snatch and rob them all, equipment, horses, clothes; they will belong to whoever successfully snatches it. Anything happens, I will handle it.”</p><br/><p>For the ordinary soldiers, they accepted it without problems, but for the Company Leaders, Wei Feng included, they looked at Zhou Weiqing with uncertainty in their eyes.</p><br/><p>“Battalion Commander, will that really be okay?” Wei Feng couldn’t help asking.</p><br/><p>Zhou Weiqing gave a cold humph. “Why not? We have been exiled here, left to ourselves, to die… what else is there left to be afraid of? If we do not gear ourselves well, we are just waiting for eventual death. Have you all lost your guts and fighting spirit after staying here for too long?”</p><br/><p>Wei Feng narrowed his eyes and said: “In that case, let’s get them!”</p><br/><p>The heavy cavalry were not considered too fast, after all their equipment was just too heavy. However, it could be said that in the entire army, the equipment of the heavy cavalry were considered the best, the most expensive. If it were a long distance military operation, a single heavy cavalry soldier had to be supported by at least four supporting personnel.</p><br/><p>The main equipment of a heavy cavalry soldier consisted of their own heavy armour, covering their entire body, as well as the armour of their warhorse. As for their weapons, it included a long lance, long bow and shield.</p><br/><p>In the battlefield, just considering ordinary soldiers, they were the most fearsome, terrifying of all the military arms. Once a heavy cavalry unit charges on a flat battlefield terrain, they were almost unstoppable. With their 3.5metres to 4metres long lances, they were like moving, deadly fortresses of doom. Even at long range, they were able to use their bows to slay lightly armoured foes.</p><br/><p>Of course, that also meant that training and equipping such a heavy cavalry unit was extremely costly and draining on all sorts of resources. As such, even for a great empire like the ZhongTian Empire, they would not form an entire Legion of heavy cavalry. Ordinarily, each Regiment would have a few Companies of heavy cavalry, while only very specialised cavalry Regiments would have Battalions of heavy cavalry.</p><br/><p>The Sixteenth Regiment that Shen Bu commanded was one such Regiment, a cavalry based one totalling fourteen thousand men. Of that, an entire battalion was heavy cavalry, nine battalions light cavalry, and the remaining four thousand the support personnel, mainly in support of the heavy cavalry.</p><br/><p>Yesterday, when Shen Bu had seen her personal guard come back late, and only in their under pants, with all their gear stolen from them, she was totally enraged. However, she knew that reporting this above would be useless, only resulting in them being the laughing stock of the army. After all, the Ruffian Battalion were already in such a sorry state, and as long as they still had some use, and did not do anything too untoward, the northern command would not do anything else to them. As such, she could only grit her teeth and endure. Today, she sent a Company of heavy cavalry soldiers to leave the camp stealthily, in order to try and get even somehow. Of course, she did not think that a single Company could take on the entire Ruffian Battalion, but it was more as a show of force, to scare them, and at the same time to get back the stolen equipment.</p><br/><p>Although Shen Bu’s personal guard were light cavalry, as elite, their equipment was not any less costly than a heavy cavalry soldier’s, mainly because of a mix of titanium alloy and custom crafting. As such, how could she let it go so easily? At the same time, she gnashed her teeth at the thought of Zhou Weiqing.</p><br/><p>Very quickly, the hundred well armed cavalry soldiers had reached about five hundred metres from the Ruffian Battalion. They did not continue, instead halting in their tracks.</p><br/><p>For best effect when charging, heavy cavalry needed to gain momentum across some distance first, and by stopping at this position, one could tell that the commander of this troop was not bad indeed. All the cavalry soldiers held their long lances in front, their bodies braced forward with their shields held on their left towards their chest, ready to start their charge.</p><br/><p>An officer, clearly also a Battalion Commander from the similar silver armour and the orange red feather in helmet, rode forward. However, she was dressed in a light cavalry armour instead. Before long, she neared the Ruffian Battalion. Although she was wearing her helmet, Zhou Weiqing recognized her instantly. It was Shen Yi.</p><br/><p>“Ohh? Isn’t this Battalion Commander Shen Yi? What wind blows you all the way here to our Ruffian Battalion?</p><br/><p>As soon as she saw Zhou Weiqing, Shen Yi felt an anger rising within her; not just because of what he did to her yesterday, but also because he had rejected her in marriage so easily. Drawing her sword from her sheath, she pointed at him and exclaimed angrily: “Zhou Little Fatty, you scoundrel, how dare you steal our Commander’s personal guards’ equipment. Don’t you know what crime you have committed?”</p><br/><p>Zhou Weiqing looked at her in surprise, saying: “Battalion Commander Shen Yi, what are you talking about? When accusing someone like that, you need to have evidence… who can prove that I robbed them?”</p><br/><p>As he spoke such shameless words, his face was still grave and earnest. If someone did not know the truth about the matter, they would likely think he was being wronged.</p><br/><p>The men of the Peerless Battalion gathered behind Zhou Weiqing to watch his act. Towards this Battalion Commander, their sense of identity with him was rapidly growing.</p><br/><p>“You… you dare to do but dare not admit it, are you a man?!” Shen Yi yelled angrily.</p><br/><p>Standing beside Zhou Weiqing, Shangguan Fei’er couldn’t help but sigh inwardly. This young lady was in just too terrible a streak of luck. Meeting this scoundrel like Zhou Little Fatty, how could she possibly win in an argument with his glib tongue?</p><br/><p>As expected, Zhou Weiqing did not disappoint. Looking at Shen Yi with an astonished face, he said: “Battalion Commander Shen Yi, how could you say that! Be careful I sue you for slander, I have never tried it with you, how do you know that I am not a man?”</p><br/><p>Although Shen Yi had been in the army for years, with her own rank, and her sister being the Regiment Commander of the Sixteenth Regiment she was in, who would dare say such shameless words like that to her? In that instant, she did not understand what he was saying.</p><br/><p>However, those Ruffian Battalion soldiers instantly understood, and they burst out in raucous laughter.</p><br/><p>Only then did Shen Yi come to understand. “Bastard, you dare to be so shameless! Zhou Little Fatty, I warn you, you better return what you stole, otherwise I will destroy your Ruffian Battalion.”</p><br/><p>Hearing her words, Zhou Weiqing gave a panicked look on his face, tearing aside the chest armour, he patted his own broad chest and exclaimed: “Ah! I’m so frightened! Come then, baby, come bite me! AAHHH!”</p><br/><p>Of course, only that final cry of agony was real, that was because Shangguan Fei’er immediately thought of Zhou Weiqing’s theory on the word ‘bite’, and couldn’t help but pinch him hard from behind.</p><br/><p>Black Bear burst out laughing heartily from the side and yelled out in merriment: “Come on, beautiful lady, come bite our Battalion Commander! Best if we can watch as you do so!”</p><br/><p>These bunch of ruffians and scoundrels had been sent here for quite some time, and upon seeing a woman, their eyes lit up, and their raucous laughter grew more intense. Somehow, in such a time, the Peerless Battalion were as one.</p><br/><p>“Good, very good. All of you…” Shen Yi was so angry that her entire body was trembling. “If I do not trample down you Ruffian Battalion, I will… I will…” She was so angry that she didn’t even know what threat to make, abruptly turning around and returning to her heavy cavalry unit five hundred metres away.</p><br/><p>Wei Feng moved closer to Zhou Weiqing, saying in a low tone: “Battalion Commander, they are likely going to take action soon. This part of the valley is flat, even ground, and if the heavy cavalry makes a proper charge, even if we win, I’m afraid a lot of our brothers will be killed.”</p><br/><p>Zhou Weiqing grinned and said: “Heh, don’t worry about it, let them charge and you will see.”</p><br/><p>As he said that, he turned to the soldiers of the Peerless Battalion and shouted out loudly: “Brothers, let me tell you all… your Battalion Commander is omnipotent. Later, I will show you all. I will stop their charge, and once I do so, all of you go and rob them all, whatever you rob will be yours. Remember though, do not harm the horses, they are extremely valuable to us, even more so than all the heavy armour!”</p><br/><p>“YES!” Loud cheers sounded out from all around. After Zhou Weiqing’s words today, along with the thought of their upcoming ‘robbery’, the excitement of these ruffian soldiers were piqued. They were originally a bunch of fearless fellows, and with Zhou Weiqing at the side fanning the flames, how could they stay honest and still in such a state?</p>\n</div>"}