{"title": "Chapter 380", "id": 380, "volume": 4, "url": "http://boxnovel.org/heavenly-jewel-change-chapter-380", "volume_title": "Volume 4", "body": "<h1>Chapter 380</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>Hearing Zhou Weiqing’s words, all the Ruffian Battalion soldiers were stunned. All these years, the Ruffian Battalion had gone through many Battalion Commanders, but none of them had actually managed to stay. In fact, like what Shen Bu had said, one had even lost his life here. Yet, out of all of those Commanders, not a single one had even come close to being like Zhou Weiqing.</p><br/><p>Although these Ruffian Battalion soldiers were arrogant ruffians, none of them had ever dared to actually attack fellow soldiers on duty. After all, the entire northern army was the elite of the Empire. As part of the Ruffian Battalion, they were already considered criminals. If they further angered the army head, it might actually bring death to them. After all, before being sent to the Ruffian Battalion, their names were already removed from the roster of the normal army.</p><br/><p>That massive brawny soldier who was built like a black tower jumped down from the perch he was on, shouldering his spiked club as he walked towards Zhou Weiqing. “Zhou Little Fatty right? Don’t you know that by doing what you just did, you are just going to get us all killed? Since these personal guards are from the Sixteenth Regiment, even if we mugged them for all their gear, do you think that the Sixteenth Regiment won’t sent more to get them back? We are isolated here, and even if we were all killed off, no one would know… or care.”</p><br/><p>The rest of the Ruffian Battalion soldiers also came closer behind the brawny soldier, surrounding Zhou Weiqing and Shangguan Fei’er in a tight circle.</p><br/><p>Zhou Weiqing swept his gaze across all of them, a disdainful look in his eyes. “No wonder all these years you all can only stay here, living a life without proper shelter, clothes and food. Hmph, and you still call yourself the Ruffian Battalion… with such a pathetic courage, how can you call yourself ruffians?”</p><br/><p>“Little brat, are you asking to die?!” The black brawny soldier yelled angrily, grabbing the spiked club and lifting it up.</p><br/><p>Right at that moment, the Ruffian Battalion soldiers were greatly surprised by what happened next.</p><br/><p>Zhou Weiqing shrugged his body in a single motion, and stripped the armour off his body, throwing his helmet to the side, along with bracers and greaves.</p><br/><p>Soon after, his army uniform top followed, and Zhou Weiqing was soon in the same state as the black brawny fellow, with his top naked.</p><br/><p>In terms of size, even Zhou Weiqing was smaller than the massive soldier, but his muscles were well defined and well lined in their own right.</p><br/><p>Shangguan Fei’er gave a light humph, turning around, though her face hidden behind the mask was blushing slightly.</p><br/><p>“What are you doing? Are you trying to sell your body? Although we are all exiled here, we do not have any interest in men.” The black brawny fellow said coldly.</p><br/><p>Zhou Weiqing shook his head, saying: “From your words earlier, you all should be afraid of death right? That’s fine, as long as we are human, we would all be afraid of death. I’m no different, I’m especially afraid of dying. However, the way I see it is that there is no point to talking to you all, no words can compare to action. Since you are afraid of revenge from the Sixteenth Regiment, let me tell you now, from this moment on, if you do not obey my commands, just myself alone, I can make the entire Ruffian Battalion vanish from this world.”</p><br/><p>“Hahahahaha.” The black brawny fellow burst out laughing heartily. “Do you really think that just because you knocked out twenty guards, that you can act like that in our Ruffian Battalion? Make us vanish from this world? Aren’t you afraid of spraining your tongue by bragging too much? Hahaha.”</p><br/><p>The black brawny fellow’s powerful voice suddenly stopped, as he was shocked to see Zhou Weiqing’s eyes abruptly turn red. Fresh Blood. Blood Red.</p><br/><p>An incomparable violent aura burst forth from Zhou Weiqing, and his muscles expanded abruptly as the black tiger tattoos appeared like flowing water around his body. If one were to liken the aura of the Ruffian Battalion soldiers to be violent, then Zhou Weiqing’s current aura was bloodthirsty, full of killing intent.</p><br/><p>*Swoosh* Without warning, Zhou Weiqing’s right leg lifted up in a sudden motion, and everyone could see the changes in his leg. The next moment, his right leg smashed down like an axe, striking the ground savagely.</p><br/><p>Shangguan Fei’er understood Zhou Weiqing’s strength, and she quickly jumped back a metre.</p><br/><p>*BOOOOM*</p><br/><p>It was as if the earth was struck by a ten thousand jin heavy hammer, and an earsplitting explosion ensued. Those closest to Zhou Weiqing felt as if their heads were dazed as an immense shockwave reverberated out from the ground, spreading out.</p><br/><p>A hundred men. All of them fell, just like a flower blooming in the summer as its petals spread, as they were knocked down by the shockwave. On the ground, crack after crack appeared, spreading outwards in a pattern like that of a turtle shell, reaching almost a hundred metres far and wide.</p><br/><p>The echo from the explosion continued for a while, as Zhou Weiqing’s large hand moved forward like a huge tiger’s paw. No one had seen him move clearly, and the black brawny fellow’s spiked club was already in Zhou Weiqing’s hand.</p><br/><p>Just like that, Zhou Weiqing raised the spiked club and smashed it downward on his own body. A screeching sound of metal clashing sounded out, and they were all shocked to see that the spike on his massive club actually broke off and almost disintegrated.</p><br/><p>Casually tossing the club downwards, there was a sickly thud, and the huge club actually vanished, leaving only a black hole in the ground.</p><br/><p>Let alone the Ruffian Battalion soldiers, even the twenty two warhorses were toppled off their feet by Zhou Weiqing’s blow on the ground, lying down on the ground shivering. Just that leg alone caused all of them to have looks of shock and disbelief on their faces.</p><br/><p>The evil looking blood orbs swept across all of them, finally resting again on the black soldier. “What is your name?”</p><br/><p>The black soldier swallowed hard. “Are you really human?”</p><br/><p>A flash before their eyes, and the next moment, his entire body had been lifted up by Zhou Weiqing above the ground. “I am the one asking the questions. What is your name?”</p><br/><p>“Everyone calls me Black Bear or Big Bear. My real name is Xiong Guangming 1.” Being a ruffian did not mean they were suicidal, and all of them were afraid of death as well, especially dying for no reason. More so when facing Zhou Weiqing in his Demonic Change State, which gave them all an overwhelming feeling like they could not resist against him. Under such a circumstance, it would be asking for death to be defiant.</p><br/><p>Zhou Weiqing nodded and placed him back on the ground, saying: “Very good. Alright, no matter what you all plan to do against me, I’ll accept all challenges and comers. For now, obey my orders. Collect our spoils and lead me back to camp.”</p><br/><p>“All of you get up, are you all going to continue playing dead? Hurry up and listen to our Battalion Commander’s words.” Without hesitation, Big Bear gave the order, the look on his face had turned respectful. Going up against absolute strength for no reason was just being foolish, and he did not want to die. As for how much of that respect was real, that was not part of Zhou Weiqing’s consideration. What he needed to do now was to solidify his position as their Battalion Commander first. As for how he would eventually bring the entire Battalion under control, he had many options to do so. After all, he had been taught by the God Eye Scoundrel! Ordinary army officers might not be able to handle the Ruffian Squadron, but he was confident it would not be a problem for him, as his own thinking and actions were often much closer in nature to these ruffians.</p><br/><p>In a matter of moments, the twenty personal guards from the Sixteenth Regiment were stripped of everything. Clothes, armour, weapons. Leading the horses by their reins, Big Bear and the hundred Ruffian Battalion soldiers gathered around Zhou Weiqing, and the entire troupe headed towards the camp in a mighty formation.</p><br/><p>Zhou Weiqing dismissed the Demonic Change State, but he did not put his clothes back on. Just like that, bare-torsoed, he walked with Shangguan Fei’er to the head of the troupe.</p><br/><p>Xiong Guangming said: “Battalion Commander, you can go to my tent to rest first. It has been a long time since we had a Battalion Commander, so we do not have a specialised tent for one.”</p><br/><p>Zhou Weiqing nodded and said: “Alright, I’ll use your tent first. You should be one of the Company Leaders of our Battalion right? Go and gather all the other Company Leaders, and let them know what happened. As for any retaliation from the Sixteenth Regiment, I will deal with it, all of you need not worry. Since I am now the Ruffian Battalion Battalion Commander, I will deal with any problems that come. I have my reasons for daring to do something like that.”</p><br/><p>“Yes, yes, Battalion Commander Zhou is wise indeed.” For a man of such stature like Xiong Guangming to have such a deferential and respectful look, it was almost amusing. However, this actually let Zhou Weiqing have a higher opinion of him. The reason was simple, Zhou Weiqing did not particularly like people who had the unbending character, who would rather break than bend. That was because normally such people would not live long. What he needed was an intelligent army, not an army who would only fight to the death foolishly.</p><br/><p>The camp was situated between some of the hills, not too far from where they were currently. At the same time, they could see how shabby the camp was, with many of the tents with holes. This was after all far up in the north, and the temperature was extremely cold. In the day, it wasn’t so bad, especially for those like Zhou Weiqing who had strong Heavenly Energy, and they could dismiss the weather. However, at night, the temperature would be even lower, and how could such tents block out the cold winds. That was probably the reason why they had set up their camp in the small valley of the hills, to help block out some of the biting wind.</p><br/><p>Xiong Guangming brought Zhou Weiqing to one of the relatively whole tents, inviting him in. The tent was only about ten square metres large, with about six or seven large patches. Still, in comparison, it was already extremely solid and tight. Even so, after entering the tent, they could still feel the wind entering from all around, though it had the unexpected benefit of having good ventilation and air within.</p><br/><p>Zhou Weiqing furrowed his brow, then said to Xiong Guangming: “Go ahead then, gather all the Company Leaders and bring them here.”</p><br/><p>Xiong Guangming turned and exited the tent. The moment he did so, a cold light flashed in his eyes. Among the ten Company Leaders of the Ruffian Battalion, he was actually the lowest ranked in terms of power.</p><br/><p>Previously, having been beaten and threatened by Zhou Weiqing, he had no choice but to obey him temporarily. However, now that they were back in the Ruffian Battalion… hmph… a mere twenty year old kid wanted to command them? He must be daydreaming.</p><br/><p>At last, only Zhou Weiqing and Shangguan Fei’er were left in the tent, and she looked at him exasperatedly before saying: “I can’t understand what you are doing, why must we come to this desolate and godforsaken place, where even the birds won’t deign to shit in 2 What can we develop or grow here? If we don’t leave this place, you’ll be stuck here forever as a Battalion Commander.”</p><br/><p>Zhou Weiqing smiled faintly and said: “Although this place is much shabbier and tattered than I had hoped for, it is still not a bad thing. You should understand that what I need and want is not an army that belongs to the ZhongTian Empire, but one that belongs to me alone. So what if it is the Ruffian Battalion? This is the place where I shall rise to power, you just wait and see.”</p>\n</div>"}