{"title": "Chapter 391", "id": 391, "volume": 4, "url": "http://boxnovel.org/heavenly-jewel-change-chapter-391", "volume_title": "Volume 4", "body": "<h1>Chapter 391</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>At that point, the quartermaster abruptly turned around and shouted out loud. “Alright, our mission is complete. Leave the supplies and head back to camp.”</p><br/><p>Instantly, the logistic soldiers quickly left the carts and formed back into a group, jogging back towards the northern camp.</p><br/><p>This time, all the Peerless Battalion soldiers were stunned. No one could understand how Zhou Weiqing managed to pull that off.</p><br/><p>They sat there watching the retreating backs of the quartermaster and his soldiers, and only when they finally disappeared into the horizon did Zhou Weiqing finally stand up. Laughing heartily, he said: “Brothers, what are you waiting for! All of these are ours now, let’s get them back. Your Father, I, promised that we would all get to eat meat tomorrow, and I have kept my promise. You haven’t sat in this freezing wind for half the night for nothing right?”</p><br/><p>Cheers erupted from all the Peerless Battalion soldiers. Five hundred of them charged forward, swarming towards the supplies.</p><br/><p>Zhou Weiqing grabbed hold of Wei Feng, who had been about to charge forward as well. Pointing towards two unassuming looking carts in the middle of the pack, he gave some instructions in a low tone. Wei Feng nodded and headed down swiftly.</p><br/><p>With all those carts in tow, their speed was naturally much slower. It was only dawn of the next morning that Zhou Weiqing and the five hundred men finally returned to the Peerless Battalion camp.</p><br/><p>However, even though the five hundred soldiers had laboured and suffered through the entire night, they were all in great condition, high spirited. They did not even feel the cold anymore, each and everyone of them well dressed in cotton winter clothing from the supplies, and even their tattered army uniforms were now all new.</p><br/><p>More importantly, the various food supplies that they had brought back this time was more than enough for the entire Peerless Battalion to eat well and drink well for more than three months.</p><br/><p>When the supplies finally reached the camp, the cheers from all one thousand two hundred men rang out. This time, not a single person even remembered to ask Zhou Weiqing for this night’s operation reward. Zhou Weiqing also returned to his own tent and fell into a deep sleep.</p><br/><p>As for the northern command side with the quartermaster, Zhou Weiqing handled the situation with a simple method. After all, the entire granary zone was to support four Regiments, and although the number of supplies they had received seemed like a lot, it was barely a tip of the iceberg to the massive granary. The quartermaster only told his subordinates that the mission that night was absolute top secret, and anyone who spoke anything about it would be executed by martial law. As such, the entire thing was suppressed. At least, before anyone from above did any audit of the supplies, there was no need for worry.</p><br/><p>As for clearing up and settling everything in camp, Zhou Weiqing did not handle it himself, just heading to sleep directly. He left that too Wei Feng to settle properly. As a leader, one did not need to do everything himself, otherwise he would have no possible rest.</p><br/><p>Zhou Weiqing slept all the way til noon before he finally awoke. As soon as he did so, he could smell the thick fragrance of well cooked meat from outside. He had also not had a good meal in a few days, and he followed the fragrance out of the tent.</p><br/><p>In the middle of the camp, several large cauldron had been set up, firewood burning brightly below them, and a stew bubbling within. He could see large chunks of meat in the stew, and the fragrance of it combined with the cold fresh morning air gave this wilderness a unique flavour.</p><br/><p>The Peerless Battalion officers’ ability to take a beating was indeed not bad. After having been beaten up so much by Shangguan Fei’er yesterday, these Company Leaders were now all seated outside.</p><br/><p>All around on the hill surroundings were the over thousand Peerless Battalion soldiers, but strangely enough, they were all silent, surrounding the cauldrons and watching them. Besides the occasional sound of swallowing saliva, there was only the bubbling sound of the boiling stew. Zhou Weiqing looked closer, and he could see a few tears glistening in many of their eyes.</p><br/><p>Shangguan Fei’er also sat beside the Company Leaders that she had beaten up. Currently, she too was extremely silent.</p><br/><p>All of a sudden, someone spotted Zhou Weiqing’s appearance, and he immediately stood up, looking directly at Zhou Weiqing and calling out sincerely: “Boss.”</p><br/><p>The shout instantly broke the silence, and everyone’s gazes focused on Zhou Weiqing instantly. At once, all of them stood up as one.</p><br/><p>“Boss… Boss…”</p><br/><p>The cries rang out in rise and fall. They did not call Zhou Weiqing Battalion Commander, but the word Boss just seemed so much more sincere and heartfelt.</p><br/><p>Green Wolf stood up beside Shanggun Fei’er and shouted out loud: “Boss, as long as we follow you, I believe we will have clothes to wear and food to eat. This brother’s 200 jin body is all yours.”</p><br/><p>Zhou Weiqing said exasperatedly: “Damn it, Your Father, I, has no interest in men. Shoo Shoo.”</p><br/><p>“HAHAHAHA—” An explosion of laughter rang throughout the entire camp, rolling across the hills.</p><br/><p>Wei Feng stood there in a daze. Since the time he had come to the Ruffian Battalion, he had never seen all the brothers with such bright smiles on their faces. Looking at Zhou Weiqing, with a roguish grin on his face, he thought to himself: This young man, will he bring a fresh life to our brothers?</p><br/><p>“Alright, everyone sit down. It’s more important to feast on the meat now, it has been a while since I have eaten meat as well. Once we have eaten, I will give out the money for yesterday’s operation; everyone five gold as promised.”</p><br/><p>From the back, someone shouted: “Boss, as long as there is meat to eat, we do not need the gold!”</p><br/><p>Zhou Weiqing pursed his lips and said: “Is that all the aspirations you all have? Just some meat and you all are satisfied? Let me tell you all, gold is extremely important for many things. Without gold, what will you use to buy good equipment in the future? Don’t expect Your Father, I, to give it to you for free. Ordinary equipment, food, that is what I, as your brother and Battalion Commander, will do, and should do. However, if you want to grow and enrich yourselves, then you all have to think hard and plan for yourselves. Of course, buying things from me is still much cheaper than normal. For example, a set of ordinary Physical Jewel Consolidating Equipment Scrolls, I will only charge a mere five hundred gold coins. So, earn hard. When I said profit is all important, I was serious, and that is not just for you all. I am not opening a charity… if you want to grow strong and powerful, to earn more, to live a better life, then you will need to work hard.”</p><br/><p>If he were to give them everything, it was actually not too tough for Zhou Weiqing to do. However, if that were so, then these men would have nothing to work towards, no propelling force. That was not what Zhou Weiqing wanted for them, hence his speech to them.</p><br/><p>Five hundred gold coins per set of Consolidating Equipment Scrolls. Such a price could be said to be almost like giving it away, when compared to the market price. However, to these Ruffian Battalion soldiers, five hundred gold coins was no small amount. Their only method of earning gold was also extremely limited; that was to listen to Zhou Weiqing.</p><br/><p>In that moment, the more intelligent of the ruffians lapsed into deep thought. Or perhaps, to become a ruffian soldier, to have caused trouble and be sent here instead of being executed… how many of them could be true fools?</p><br/><p>Zhou Weiqing walked over to Shangguan Fei’er and pulled her up. Currently, she had reverted back to her female attire. However, no one dared to stare at her beauty.</p><br/><p>Zhou Weiqing’s hand encircled Shangguan Fei’er’s shoulders, a scoundrelly look on his face as he looked around at his men, saying: “Let me introduce her officially. This beautiful lady is called Shangguan Fei’er. From now on, she will be the overall drill master in charge of our Peerless Battalion. Whoever wants to learn from her can apply to do so on your own accord, we will not force you to do so. Her training fees are a gold coin per month. As I said, there is no free lunch in this world. Only if you spend the money will you really work hard on your training right? Of course, whether or not you want to learn is your own business. However, there are a few exceptions… the Company Leaders… this month’s training fees I will pay for you. Fei’er, I leave them to you, you are in charge.”</p><br/><p>Having Zhou Weiqing’s arms around her like that, Shangguan Fei’er felt her heart skip a beat before racing. She did not even know why she did not just shake his arms away, allowing him to get away with this. However, as the Heaven’s Expanse Palace Little Demon Girl, she quickly transferred her bashfulness into violence. After Zhou Weiqing’s last words, her wicked smile and gaze landed on the ten Company Leaders.</p><br/><p>“Boss… nooo!” No one knew who was the first to cry out sadly, and the ten Company Leaders look at Zhou Weiqing with pleading looks.</p><br/><p>Zhou Weiqing smiled faintly and said: “Just now who was the one who cried out first, you will have one more month added. Of course, if you all together can defeat our drill master, then you all do not need to go through training.”</p><br/><p>Although they were the Company Leaders, the other ruffian soldiers only looked on happily. Who would help them out as such a time?</p><br/><p>“Let’s eat!” Zhou Weiqing shouted out, grabbing a large bowl and filling it full of meat and stew before running to the side to eat.</p><br/><p>Instantly, the entire Peerless Battalion erupted into action, bustling with life as the men swarmed towards the cauldrons to snatch their portion of meat.</p><br/><p>By the time Zhou Weiqing finished his bowl and wanted to get a second bowl, the cauldrons were all empty.</p><br/><p>When he saw the empty metal cauldrons, our dear Battalion Commander Zhou Little Fatty’s voice rang out throughout the entire camp. “You all have no heart!!!”</p><br/><p>In truth, under Wei Feng’s instructions, there was actually not much meat cooked for all to eat. After all, these men normally ate some wild plants and wheat or bran to barely fill their stomach. If they ate too much meat, it would actually have an adverse reaction on their bodies. Most of them only had a few small pieces of meat and drinking a bowl of stew.</p><br/><p>Even so, by the time afternoon came, almost half of the soldiers had an upset stomach.</p><br/><p>However, by that time, Zhou Weiqing was already in the secret tunnels of the Peerless Battalion.</p><br/><p>Although he had barely been with them for two days, all of the Peerless Battalion soldiers had seen what he had done for them. He had brought food, clothing, weapons, and his temper was well suited to them. At least for now, he had gained their acceptance.</p><br/><p>“Battalion Commander, the food has been stored in our underground storage. There, the temperature fluctuation will not be too great, no matter summer or winter, and there will be less chance of spoilage. If we eat sparingly, this can last us almost half a year.” Wei Feng said excitedly.</p><br/><p>Zhou Weiqing shook his head and said: “Why should we eat sparingly? This few days, you help everyone’s stomachs get used to it, increase the amount of porridge of vegetables, and we can slowly increase the amount of meat.”</p><br/><p>“When everyone’s stomach has recovered and adapted, we must let everyone eat well everyday. As for supplies, you do not need to worry. Since I can get this once, I can arrange it again. That said… when the WanShou Empire armies come, you all just hide here in these tunnels?”</p>\n</div>"}