{"title": "Chapter 399", "id": 399, "volume": 4, "url": "http://boxnovel.org/heavenly-jewel-change-chapter-399", "volume_title": "Volume 4", "body": "<h1>Chapter 399</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>The intense cold, laced with evil aura, invaded her body first. Despite the protection of the Infinite Saint Flame and her own boosted Heavenly Energy, it was as if the cold could still seep through in various myriad little ways, causing her to almost stop breathing. The next instant, the heat followed suit, and the mix of the two caused Shangguan Fei’er’s entire blood flow to surge turbulently, as her vital energy was disrupted, causing her to almost spit out blood.</p><br/><p>If she continued hugging onto Zhou Weiqing, perhaps it would not just be Zhou Weiqing falling to his death alone, but the two of them smashing to the ground together.</p><br/><p>Right at this moment, Shangguan Fei’er showed her powerful adaptability and ability to think fast and work under intense pressure. With a half twist of her supple waist, she threw Zhou Weiqing upwards with all her might, first reducing the acceleration force and inertia he had built up over the two hundred metre fall, before she regained her balance and flew up once more.</p><br/><p>In such a way, hugging and throwing in an almost endless cycle, the two continued ‘flying’ into the distance, descending swiftly all the while. Even with the Infinite Saint Flame, it took everything Shangguan Fei’er had in her to keep this up, and all the while, her body was wrecked by the two vastly different pulses of energy from Zhou Weiqing’s body, eating her up with unbelievable pain.</p><br/><p>At last, they were almost fifty metres from the ground. Shangguan Fei’er took another deep breath before throwing Zhou Weiqing upwards for one last time. Immediately after doing so, she swooped down, landing down hard onto the ground like a meteor, right at the spot at where she estimated Zhou Weiqing would also land. At the same time, she raised her hands, and a gust of Wind Attribute Heavenly Energy rose up in the air, almost consolidating into solid form as it caught onto Zhou Weiqing’s body and eased him down onto the ground.</p><br/><p>When she had finally succeeded into bringing him down onto the ground safely, she had passed the limits of her endurance. With a cry, she vomited out a full mouthful of blood before crashing down onto the floor, panting and gasping for breath.</p><br/><p>She had already used the Infinite Saint Flame once earlier in the day today, and that had already caused some harm to her body. Using it again now, along with the heat-cold mixed ‘attack’ from Zhou Weiqing, Shangguan Fei’er was already severely injured. This was truly the first time in her life that she had been injured like that.</p><br/><p>However, at this moment, she did not even attempt to heal herself, Due to her worry, urgency, and heartache, tears fell from her eyes.</p><br/><p>“Little Fatty… Little Fatty… I was wrong… What happened to you? Don’t scare me please… wake up! Little Fatty…” Shangguan Fei’er did not dare to touch him again, and could only call out softly near his ears.</p><br/><p>Even though she was not touching his body, she could still feel the intense twin yet polar opposite auras affecting her.</p><br/><p>The vegetation that grew in the northern regions were all extremely tough and durable to survive in such climates, and where they fell had a patch of vegetation and trees. Yet, now, the two closest pine trees to Zhou Weiqing were clearly starting to wither. One could imagine how terrifying the two auras he was emitting was.</p><br/><p>All of a sudden, Zhou Weiqing’s violent fits intensified, and in the next moment, he jerked up and spat out a mouthful of blood, which flew like an arrow almost fifty metres away, causing the entire air around to be filled with the mix of hot and cold. When Zhou Weiqing lapsed back down on the ground again, the fits continued.</p><br/><p>“Why did this happen? I did not mean to do so, Little Fatty, I’m wrong… Please get better… if you are alright I will do anything you say.” Shangguan Fei’er gritted her teeth hard and leaped forward once more to embrace Zhou Weiqing. She did not care about her own safety any longer, or even the fact that he was currently totally naked, and as she held hold of him, she circulated her Heavenly Energy into his body unhesitatingly, allowing the cold-hot auras to overwhelm her.</p><br/><p>The hot-cold air was just too overbearing, criss crossing one after the other, Shangguan Fei’er felt as if her body could not take it, subconsciously wanting to let go. Even with her six-Jeweled cultivation level could not withstand the continual invasion of the dual temperatures.</p><br/><p>However, she continued holding on tightly, refusing to let go as she gritted her teeth hard. In her view, this had all been caused by her. Just by touching Zhou Weiqing, she was already in such pain… then what kind of suffering would Zhou Weiqing himself be going through?</p><br/><p>At this moment, all Shangguan Fei’er wanted to do was to help Zhou Weiqing shoulder some of his burden, to take on some of the massive pain he was in. Perhaps, partly from guilt, but more so because of heartache. She only wanted to do something for him, and as the intense pain wrecked her body, she gripped Zhou Weiqing tighter, afraid that she might subconsciously let go of him.</p><br/><p>I cannot let go of him, otherwise perhaps it might be forever.</p><br/><p>Along with the increasing pain, Shangguan Fei’er herself did not realise that her own clothes had also evaporated along with that twin temperatures. By this time, her nervous system was already numb, and the damage to her body and meridians caused blood to flow out uncontrollably from her mouth, dropping onto Zhou Weiqing’s chest. Under the different intense temperatures, the blood turned into eyes before evaporating into a dim red steam and dissipating into the air.</p><br/><p>Have I really fallen for him? Despite the numbness of her body, Shangguan Fei’er’s consciousness still stayed extremely clear.</p><br/><p>Yes… I think I have really fallen for him… but… he is Bing’er’s man… how can I snatch her husband, my dear little sister that I have lost for so long.</p><br/><p>Perhaps… dying for him like this, as long as it can help him stay alive… this would be the best result. It’s all worth it.</p><br/><p>If… if we have to die together… I will be willing too.</p><br/><p>As two clear lines of tears streamed down her cheeks, Shangguan Fei’er suddenly opened her mouth and bit down on Zhou Weiqing’s shoulder. Closing her eyes, she focused on the heartache and emotions in her heart, ignoring the state of her body.</p><br/><p>Under the power of such conviction, Shangguan Fei’er did not loosen her grip of her arms. At this point, her skin was starting to follow Zhou Weiqing’s, turning red and white intermittently, and her beautiful hair was also starting to drop down, turning grey, white and disintegrating into dust, and her own life energy was starting to ebb away.</p><br/><p>In truth, the changes in Zhou Weiqing’s body was undoubtedly sparked off by Shangguan Fei’er’s series of actions in mid-air, but it was not caused by her, but happened within his own body on its own accord.</p><br/><p>At that point, when they were whirling around in midair, Zhou Weiqing had abruptly felt his entire body starting to grow hot. That bout of heat came just so suddenly, so violently, an intense and incomparable heat that seemed to well up from every corner of his body, starting from the skin then turning inward to the rest of his body.</p><br/><p>In that instant, Zhou Weiqing thought of the Solidified Dragon Spirit. At that point, inspiration struck him as he suddenly thought of the Green-Gold Flame that Shen Bu had unleashed upon him and enveloped him before disappearing without warning. That was definitely not something that he had accomplished on his own accord… and the only explanation could be the Solidified Dragon Spirit/</p><br/><p>Dragons were mighty creatures with the Fire and Light Attribute, and the one he met was a Heavenly God Tier powerhouse. For its Solidified Dragon Spirit to be able to easily absorb that Fire Attribute Green-Gold Flame, that easily explained everything.</p><br/><p>But… why would that heat suddenly rise up within him now? What was going on? Didn’t Old Xing say that his Solidified Dragon Spirit would only be activated when he reached at least the Nine Jeweled stage?</p><br/><p>Just as Zhou Weiqing was filled with uncertainty, an equally powerful, unrelenting cold and evil aura rose up as if in response, intercepting and attacking. One hot, one cold, the two powerful forces clashed, causing Zhou Weiqing to lapse instantly in indescribable pain, losing control of his body. That was the reason why Shangguan Fei’er had seen him like that.</p><br/><p>In truth, all of what had happened was because of Zhou Weiqing’s own body.</p><br/><p>He had inherited the bloodline power of the Dark Demon God Tiger when he ate the black pearl years ago, as it was the core of the Dark Demon God Tiger that held all of its essence. As such, he was slowly gaining many of the Dark Demon God Tiger’s powers, becoming stronger and stronger. It was also the powers of the Dark Demon God Tiger which had saved him many times, especially when he was training in the Immortal Deity Technique, where he had been on the brink of death just too many times. It could be said that without the bloodline of the Dark Demon God Tiger, Zhou Weiqing would have died the first time he tried to breakthrough to the Death Acupuncture Point.</p><br/><p>As for the Solidified Dragon Spirit, it came from the power of the great dragon. It was a Heavenly God Tier powerhouse, and in terms of ranking, it was on the same level as the Dark Demon God Tiger, and it would be extremely difficult to compare which was actually stronger.</p><br/><p>The Solidified Dragon Spirit had been sealed under Zhou Weiqing’s skin, and when he had broken through to the 3rd stage of the Heavenly Shen Energy, it had slowly started merging with his body.</p><br/><p>Xing Tianyi’s judgement was not wrong at all. Under ordinary circumstances, if Zhou Weiqing wanted to activate the Solidified Dragon Spirit, it would only be accomplished at the nine-Jeweled stage.</p><br/><p>Alas, due to a series of unforeseen circumstances and coincidences today, things had changed drastically. Zhou Weiqing had guessed correctly. The Gold Green Flames that Shen Bu had unleashed on him had been absorbed by the Solidified Dragon Spirit hidden right below Zhou Weiqing’s skin. Dragons were the forefathers of Fire, and no fire was greater than theirs. As soon as Zhou Weiqing had gotten the Solidified Dragon Spirit, he was already immune to almost all fire in the world.</p><br/><p>To the Solidified Dragon Spirit, the Gold Green Flames were like a supplement, hence it was directly absorbed into Zhou Weiqing’s body. To be more accurate, it was directly absorbed by the Solidified Dragon Spirit.</p><br/><p>The Gold Green Flames were an ultimate Skill of Shen Bu’s, one of the most powerful of her own attacks, already reaching the seven Jeweled stage. To the Solidified Dragon Spirit, it was a pretty good supplement, and as such, after absorbing it, the Solidified Dragon Spirit started accelerating its absorption and digestion of energy, replenishing itself.</p><br/><p>For the Solidified Dragon Spirit to Awaken was originally dependant on absorbing Zhou Weiqing’s Heavenly Energy and Life Force gradually in order to do so. Of course, that had to be done at a extremely slow rate, as it could only absorb Zhou Weiqing’s extra energy to not harm him. For example, if Zhou Weiqing Devoured Fire Attribute Heavenly Energy, it would absorb some of it, but would not actually harm Zhou Weiqing’s body.</p><br/><p>This time, after having absorbed, and ‘digested’, so much of the Green Gold Flames, the Solidified Dragon Spirit was able to send back some of the energy to him. That was the reason Zhou Weiqing why he felt such heat earlier.</p>\n</div>"}