{"title": "Chapter 409", "id": 409, "volume": 5, "url": "http://boxnovel.org/heavenly-jewel-change-chapter-409", "volume_title": "Volume 5", "body": "<h1>Chapter 409</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>Zhou Weiqing was extremely familiar with his teachers’ archery skills, and he had been keeping close watch on the wolf cavalry soldiers. Along with the loud ‘TuLuLu’ shout, the formation of the wolf cavalry soldiers changed. With Yamcha at the head, the hundred wolf cavalry soldiers no longer charged as a group, instead forming a line as they streamed towards Zhou Weiqing and the others. As long as Yamcha in the front could handle the incoming arrows, this would undoubtedly be a great plan to reach the archers’ line.</p><br/><p>Such powerful wolf cavalry troops indeed! Zhou Weiqing couldn’t help but exclaim inwardly, feeling a sense of admiration and envy. If only he had a few tens of thousands of these wolf cavalry soldiers, what difficulty would there be in reviving their empire.</p><br/><p>Seeing the wolf cavalry soldiers in the straight line formation, the Heavenly Bow Unit members instead revealed smiles on their faces. In that short moment of time, the wolf cavalry had already charged within the six hundred range.</p><br/><p>“Alright, stop playing already. Let’s take action.” Han Feng said passively. However, he himself did not move yet.</p><br/><p>Yi Shi was the first to strike, and a silent arrow wrapped in white light disappeared in front of them like a bolt of lightning. Right behind the white arrow came a beam of red; Gao Shen’s arrow.</p><br/><p>They did not even need to make a sound to coordinate, and they had already done the best possible movement with tacit understanding. As for Han Mo, he jumped off his horse, standing together with Luo Ke Di, and the two started firing arrows in a strange motion.</p><br/><p>Shangguan Fei’er was startled to see that both Han Mo and Luo Ke Di’s arrows were actually arcing in a large path in mid air before striking directly towards the wolf cavalry formation. Furthermore, they were shooting out streams of arrows in such an arc without stopping. No wonder they had smiled like that as soon as they saw such a straight line formation.</p><br/><p>Yamcha once again sensed danger. This time, he was ready, and he quickly held his cavalry sabre in front of himself instantly again.</p><br/><p>*Clang* a thick cold enveloped Yamcha’s body, spreading throughout, and just like that, his entire body became an ice statue, all the way down to his war wolf mount. The next instant, a violent explosion, and the Company Leader Yamcha had been blown back by the following arrow.</p><br/><p>Yi Shi laughed and said: “That is called the Twin Blows of Ice and Fire.”</p><br/><p>At this moment, the Heavenly Bow Unit members finally displayed their true power. After the first few arrows mainly for testing purposes, they had a grasp on the powers of the wolf cavalry troops.</p><br/><p>In the end, only four of them took action. Drunken Rogue Luo Ke Di, Snake Lady Tranvestite Yi Shi, Cannon Gao Shen, and Arrow Tower Han Mo.</p><br/><p>Han Mo’s firing speed was the greatest, while Luo Ke Di had the strangest angles. Yi Shi’s arrows always found the one in front, straightforward and true, but with the power of her Ice Attribute and its freezing effect, it was able to greatly slow the speed of the enemy’s charge. As for the Cannon Gao Shen’s arrows, each of them was like a bomb, striking out. Strangely, he and Yi Shi always seemed to be able to supplement each other, the fire arrows exploding towards the slowed front cavalry soldiers.</p><br/><p>The true killing blow was from Han Mo and Luo Ke Di. The two’s godlike archery causing their arrows to constantly change direction in mid air.</p><br/><p>The defense and strength of the wolfmen cavalry soldiers were indeed extremely powerful, especially after activating their totemic bloodline, their defense was pretty astonishing. Even as Physical Jewel Masters, if they were to shoot their muscled areas or meaty areas, a few arrows wouldn’t be able to kill them off like that.</p><br/><p>However, no matter what, the wolfmen were still mortal, with vital points to strike. Luo Ke Di and Han Mo’s arrows always seemed to strike down at their eyes. No matter how strong their defense was, they were not able to defend their eyes. From the distance, the observers could see puffs of blood constantly bursting out, each cloud of blood meant a wolf cavalry getting thrown off his war wolf mount.</p><br/><p>The most inconceivable was that although Luo Ke Di and Han Mo were both shooting their enemies’ eyes, up until the point they struck their target, the target was not able to see their attacks from the front.</p><br/><p>Shangguan Fei’er felt a cold chill down her spine. Such archers were indeed too terrifying… no wonder Zhou Weiqing was so respectful to them. If she herself were at several hundred yards from them, with these few working together… could she actually reach them? Their archery was just too crafty.</p><br/><p>Right at that moment, Hua Feng suddenly burst into action. A green bow appeared in his hands, and when Shangguan Fei’er looked at him, all she saw was a shimmering blur of his hands.</p><br/><p>Just like that, Hua Feng sat calmly on his horse, his actions graceful and elegant, as if he were playing a zither. Green arrows flew out one after the other, clearly Consolidated Equipment, flying out in a seemingly messy formation. However, the war wolves whose owners had been killed and were fleeing the scene were all found by these green lights. Similarly struck through the eyes, they fell lifelessly to the ground.</p><br/><p>Hua Feng said with a chiding tone: “Don’t let those war wolves go either, who knows if those things will be able to send news back.”</p><br/><p>Luo Ke Di said exasperatedly: “Alright, I got it, I got it.” As soon as he said that, the rhythm of his firing changed. He no longer fired one arrow at a time, but three at a time. The most important thing was that though he shot three at once, it was actually all at different targets.</p><br/><p>Four hundred yards. By this time, the wolf cavalry troops had reached four hundred yards of the party, but of the hundred of them, only one third remained on their war wolves.</p><br/><p>The members of the Heavenly Bow Unit not only had godlike archery accuracy, their shooting speed was unbelievably quick. Even with the activation of their bloodline totem powers and with the increased speed, they were only able to reach within four hundred yards at this time. Of course, that was also in part thanks to Yi Shi and Gao Shen’s powerful blocks and slows.</p><br/><p>Shangguan Fei’er at this side was undoubtedly surprised, but for the Peerless Battalion soldiers hidden on the forests of the hills to the side, they were all so shocked that their eyes almost bulged out of their sockets.</p><br/><p>As experienced soldiers, this was not the first time they had clashed with some of the WanShou Empire troops, and they were extremely clear about how powerful these wolf cavalry units were. Even three-Jeweled Physical Jewel Masters and below facing these wolf cavalry soldiers would not be certain of victory, especially since their teamwork was so very strong.</p><br/><p>With the Peerless Battalion’s current strength, if they were to clash headlong with this Company of wolf cavalry soldiers, even if they could win, they would definitely have to pay a hefty price.</p><br/><p>However, these few people that their Battalion Commander had brought with him were just so calmly and coolly shooting their arrows, and these powerful wolf cavalry soldiers were falling like wheat in a field, only a cloud of blood marking each fallen soldier. From the looks of things, the entire company would not even be able to reach their group… Since when had Wolf Cavalry Soldiers become so weak?!</p><br/><p>Mu En was the calmest, standing there unperturbed, without even bothering to take out his bow. From the looks of things, he did not even expect to need to take action.</p><br/><p>However, the viciousness and savage nature of the wolfmen tribe were indeed not to be underestimated, as they were savage even towards themselves. Carrying themselves through with sheer fortitude, tenacity and rage, along with some relaxation on the part of the Heavenly Bow Unit members who thought the battle was pretty much ended, in the end around a dozen wolf cavalry soldiers managed to charge to about two hundred yards from them, without any sign of stopping or retreating. They stubbornly strove to continue, as they believed as long as they could reach these human foes, with the frail nature of humans they would still be able to snatch victory from the jaws of defeat.</p><br/><p>Alas for them, they did not have any chance to close in on them. At that moment, Shui Cao burst into action as she joined in. Arrow after arrow streaked out towards the battlefield, each glowing with the yellow of the Earth Attribute. The arrows did not fly towards the wolf cavalry soldiers, instead onto the paths that they were heading. Each arrow was imbued with a small stone wall Skill, but these stone walls appeared just too suddenly, and even with the agility of the war wolves, they still lost their balance. With her help, it was barely moments before the remaining wolf cavalry soldiers had their heads blown up by Luo Ke Di and Han Mo.</p><br/><p>The fight had ended. All their foes had been vanquished, and not a single wolf cavalry soldier had even reached a hundred yards of them.</p><br/><p>Luo Ke Di looked towards the others and said: “Four in One Attack?”</p><br/><p>Yi Shi, Han Mo and Gao Shen all nodded at him. Shangguan Fei’er was still trying to puzzle out what they meant when the four suddenly shot an arrow each into the sky.</p><br/><p>“What… what are they doing?” Shangguan Fei’er couldn’t help but turn to Zhou Weiqing and ask.</p><br/><p>Zhou Weiqing grinned as he replied: “Heh, there is still one fish trying to escape from the net. That Company Leader of theirs is acting dead. Alas for him, these teachers of mine may not be great at anything else, but counting is their forte indeed. If they did not finish off anyone, how could they not know?”</p><br/><p>Indeed, Yamcha was not dead yet. For him to be raised to the rank of Company Leader, and one of the top ones, it was not just by courage alone. When he was shot by the ‘Twin Blows of Ice and Fire’, he had been thrown off his war wolf mount. However, he had rolled with the blow but did not get up. The two arrows, while powerful, were still not enough to take his life. Compared to his subordinates, he was undoubtedly much stronger and tougher. Seeing his subordinates and comrades shot to death, he decided to play dead, thinking angrily to himself: As long as they dare try to loot the battlefield, they will get a nasty surprise from me indeed!</p><br/><p>Unfortunately for him, the Heavenly Bow Unit members were experienced fighters, that could even have some strength even in a place like the ZhongTian Empire. If they could not see through such a simple ruse, they would not be worthy of their name indeed.</p><br/><p>Four arrows flew into the sky, arcing differently but falling right at the same time.</p><br/><p>By the time Yamcha could react, the four arrows had already reached him.</p><br/><p>Dodge? The wolf cavalry archers’ speed was mainly from their war wolf mounts, and though they had a decent physique of their own, speed was not their top. Furthermore, these four arrows were shot by the godlike archers of the Heavenly Bow Unit, each arcing from an angle that he could not spot until it was too late. How could he possibly succeed in dodging.</p><br/><p>Once again, he got to enjoy the ‘Twin Blows of Ice and Fire’ once more. This time, it was joined by two powerful piercing arrows, each thudding deep into one of his eyes.</p><br/><p>What was tacit understanding and teamwork? This was a true display of it indeed. Luo Ke Di and Han Mo’s targets were both Yamcha’s eyes, but both of them had shot one respectively, without even discussing it beforehand.</p><br/><p>Hua Feng kept his green longbow, smiling faintly as he said: “None of them have escaped. We can loot the battlefield now.”</p><br/><p>Zhou Weiqing laughed heartily and said: “Haha, teachers, you all are becoming more vigorous and energetic with age!”</p><br/><p>Shui Cao glared at him angrily, saying: “Little Wei, who are you calling old?”</p><br/><p>“Ehhh, forget I said anything. Brothers, time to loot the battlefield!” Zhou Weiqing’s last shout was towards the members of the Peerless Battalion.</p><br/><p>With that shout, only then did the ruffian soldiers of the Peerless Battalion break free of their stunned reverie and react. Led by Wei Feng, the entire Peerless Battalion charged down in a mad rush. They still remembered Zhou Weiqing’s words previously, that any equipment they looted would belong to them!</p><br/><p>In terms of robbing and snatching, no one was more professional than these Peerless Battalion soldiers. Under the astonished gazes of the seven godlike archers of the Heavenly Bow Unit, the corpses of the wolf cavalry soldiers were soon stripped totally naked.</p>\n</div>"}