{"title": "Chapter 404", "id": 404, "volume": 5, "url": "http://boxnovel.org/heavenly-jewel-change-chapter-404", "volume_title": "Volume 5", "body": "<h1>Chapter 404</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>Hand in hand, Zhou Weiqing and Shangguan Fei’er took note of their positions and headed towards the TianBei City once more. By the time they reached the north gate of the Tianbei city, the sun had already risen in the sky.</p><br/><p>Through the distance, Zhou Weiqing could see Little Four standing a little distance from the entrance of the gate. As per the agreement with Lin TianAo, they would send someone to wait for him there everyday. After all, he did not know where Lin TianAo and the others had settled down.</p><br/><p>Spotting Zhou Weiqing, Little Four was overjoyed, hurriedly waving at him and Shangguan Fei’er. However, when the two of them walked closer, he couldn’t help but stare at them in shock. Are they holding hands? Was there a swap of persons?!</p><br/><p>“Little Four, what are you looking at?” Shangguan Fei’er glared exasperatedly at the stunned Little Four.</p><br/><p>“Eh? What? Are you Shangguan Fei’er or Shangguan Bing’er? You guys swapped around?” Little Four muttered.</p><br/><p>Shangguan Fei’er smiled faintly and patted him on the shoulder. “Do you want to try for yourself and see who I am?”</p><br/><p>Little Four shuddered and hastily said: “No, no, there’s no need, I understand. Weiqing, you’re indeed strong, no wonder you are the Boss. Such skill, such standards, you’re too great! Twin sisters… orgy! I’m impressed! AHHhhhhh—-”</p><br/><p>Naturally, the last sound was a scream of agony. As soon as he said the words ‘Twin sisters… orgy’, his heart sank as he realised what he had done. Alas, before he could run, it was too late. Shangguan Fei’er had raised her hands, and his body had come into intimate contact with the ground.</p><br/><p>Zhou Weiqing stood at the side, looking on beamingly. Although Little Four had spoken his own inner thoughts, he would never admit it out loud.</p><br/><p>Right at that moment, Zhou Weiqing suddenly felt a sense of danger tingling, and he quickly turned his head to another direction. At the same time, he took a swift step forward, blocking in front of Shangguan Fei’er.</p><br/><p>That sense of danger was as if he was being watched by a venomous snake, and could be bitten at any time.</p><br/><p>In a dark corner at the side of the walls, a shadowy figure walked out slowly towards Zhou Weiqing.</p><br/><p>Shangguan Fei’er naturally sensed Zhou Weiqing’s movements as well, and she too turned to look in the direction he was focusing at. To her surprise, Zhou Weiqing’s body was frozen in place, his jaw agape and his eyes blank as he stared ahead.</p><br/><p>The person walking towards them was about thirty plus, forty years of age. He was quite handsome, though the image was slightly ruined by the wine bottle in hand, and as he walked towards them, he did not forget to take a swig of wine. He walked along with a slight sway and stagger, but the joy in his eyes was not hidden at all. Holding up the hand with the wine bottle, he waved towards Zhou Weiqing.</p><br/><p>Shangguan Fei’er could clearly see Zhou Weiqing’s eyes redden as tears welled up from within. The next instant, his body charged forward like an arrow shot from a bow, not caring about all the guards at the gate who could see everything.</p><br/><p>Within a split second, Zhou Weiqing had reached the middle aged man, enveloping him in a big bear hug. Although the wine bottle of the middle aged man spilled all over his shirt, he did not even care a whit.</p><br/><p>Little Four exclaimed in surprise: “What’s up with Weiqing? Did he have some other unique tastes as well?”</p><br/><p>“Hmph, if you want to get beaten, you can just ask for it directly.” Shangguan Fei’er glowered at him.</p><br/><p>“Errr, keep calm, Fei’er Beautiful Lady.” Although Little Four had somewhat of a rotten mouth at times, he also knew clearly it was unwise to trifle with some people.</p><br/><p>“‘Rogue’ Teacher!” Zhou Weiqing’s voice was clearly joyous but trembling.</p><br/><p>Indeed, this middle aged man he was hugging so tightly was indeed the Drunken Rogue of the Heavenly Bow Unit, Luo Ke Di! Zhou Weiqing had never in his wildest dreams expected to meet him here.</p><br/><p>His home destroyed, the Heavenly Bow Empire fallen, all of that weighed down on Zhou Weiqing’s heart like a massive mountain all this time. He always tried to avoid thinking about what happened at home, of what had befallen his friends and family. He pressed himself so hard in training and cultivation, thinking of all possible methods to raise his own power and forces, wasn’t that all for his own home country?</p><br/><p>At this moment, seeing Luo Ke Di here was an unbelievable joyous event! The teachers of the Heavenly Bow Unit were all extremely important to him, not just as teachers, but as friends and kinship. If not for the two years in the Heavenly Bow Unit, it could be said that there wouldn’t be the Zhou Weiqing of today. Perhaps these teachers did not give him much in terms of his cultivation level, it was without doubt that much of his power had been taught by them, not to mention many simple truths about being a person, living, and surviving in the world.</p><br/><p>“Oei, oei, don’t be so sentimental like a woman. Let me tell you, this suave gentleman here is straight, don’t think I will have interest in you.”</p><br/><p>Luo Ke Di’s mouth was just as despicable as ever, but hearing his voice was just so warm and gentle in Zhou Weiqing’s ears.</p><br/><p>Releasing his hug, Zhou Weiqing said urgently: “Rogue teacher, you are alright, what about the others? What about my master? Is he alright? How are all the rest?”</p><br/><p>Luo Ke Di said exasperatedly: “This suave gentleman is alright, how can anything happen to the rest? Do you think us Heavenly Bow Unit will die so easily? Although the Bai Da Empire assholes sent quite a few powerhouses, but with myself and your scoundrel teacher’s power, all of them were useless. All of us managed to escape, and they are all in this TianBei City. You can see them later.”</p><br/><p>“Haha, great, that’s great!” Zhou Weiqing was so excited that he jumped up. He had never dreamed that the entire Heavenly Bow Unit would still be alive. The Heavenly Bow Empire had been invaded, but they were still alive… that meant he still had people to depend on, still had family!</p><br/><p>Right at that moment, a group of soldiers had surrounded them. After all, they had made quite a commotion earlier, and Zhou Weiqing had displayed his considerable speed earlier, how could they not be suspected.</p><br/><p>However, before Zhou Weiqing could open his mouth, Shangguan Fei’er had already sent them away, using the Battalion Commander plaque that she had gotten from Shen Yi could solve all problems easily.</p><br/><p>“Ahhh, Bing’er! You’re becoming prettier and prettier. Quick, come let rogue teacher hug you.” Luo Ke Di spotted Shangguan Fei’er and was immediately overjoyed, spreading his arms and heading over.</p><br/><p>Zhou Weiqing started momentarily, and in the next moment, a wicked smile crossed his lips. He would not stop Luo Ke Di at all, instead leaning back to watch the show.</p><br/><p>“AHHHH—, Aiiyahhh. Bing’er, how can you be so violent!”</p><br/><p>Trying to hug Shangguan Fei’er, how could there be any good result? Furthermore, Luo Ke Di had proclaimed himself as a rogue before approaching her. Instantly, Shangguan Fei’er grabbed hold of his wrist, with a twist and a locking technique, followed by a sweep of the legs, he was instantly sent to the ground.</p><br/><p>“Hmph, this is the first time I’ve ever seen anyone call themselves a rogue. Trying to take advantage of this young lady, you are dead.” Shangguan Fei’er said coldly.</p><br/><p>Zhou Weiqing laughed heartily before saying: “Fei’er, don’t be rude. This is my master, his nickname is called Drunken Rogue. Of course, he is really a rogue, but you can just keep your distance from him.”</p><br/><p>Luo Ke Di clambered up from the ground, muttering to himself before saying exasperatedly: “Bing’er, you young girl, how can you be so violent. Look at Little Weiqing, when he saw this suave master, he gave me a warm hug. You… actually dared to hit your teacher instead, wait and see I’ll tell Hua Feng!”</p><br/><p>“Hmph, whose teacher are you?” Shangguan Fei’er said exasperatedly. “Look clearly before you say. I’m not Bing’er.”</p><br/><p>“Ahh?” It was Luo Ke Di’s turn to be surprised, and he turned to Zhou Weiqing and asked: “What’s going on?”</p><br/><p>Zhou Weiqing laughed heartily and said: “Haha, let’s head into the city and sit down to talk, no point standing here for so long. I’ll tell you on the way.”</p><br/><p>As such, the four of them entered the TianBei City. With the Battalion Commander plaque in hand, the guards naturally let them in respectfully without any problems.</p><br/><p>As they walked along, Zhou Weiqing and Luo Ke Di answered each other’s questions, questions that had been burning deeply in their hearts for so long.</p><br/><p>Zhou Weiqing simply described what happened after he left the Heavenly Bow Unit, especially regarding the three Shangguan sisters. As for Luo Ke Di, he described how they had ended up here waiting for Zhou Weiqing as well.</p><br/><p>At that time, the Bai Da Empire had attacked the Heavenly Bow Empire just so suddenly. Due to the sheer surprise factor, by the time the Heavenly Bow Unit had learned of the attack, the Heavenly Bow City was already under attack. However, before they could take action, the Bai Da Empire had dispatched a bunch of Heavenly Jewel Masters to attack the Heavenly Bow Unit.</p><br/><p>After all, although the members of the Heavenly Bow Unit were not powerful in terms of cultivation level and personal strength, their archery and assassination skills were just too terrifying. The Bai Da Empire did not want to leave such a unit alive to harass them in the future; as such, they had sent a considerable force to take care of the Heavenly Bow Unit.</p><br/><p>Being ambushed like that, Hua Feng and the others were naturally no match for so many Heavenly Jewel Masters. In a critical moment, Mu En and Luo Ke Di brought the others to a secret tunnel that the two had dug out in the past, and the Unit had left the Heavenly Bow Empire borders.</p><br/><p>After leaving the Heavenly Bow Empire, the first thing the thought of was to find two people. That was because these two were the only ones who had the leadership and ability to call to arms to revive their Empire.</p><br/><p>One was naturally part of the Royal House, Princess Difuya who was studying in the Fei Li Royal Family Military Academy. The other was naturally Admiral Zhou’s only son, Zhou Weiqing.</p><br/><p>As such, they had rushed to the Fei Li City and managed to find Princess Difuya. However, they had learned that Zhou Weiqing had went to the ZhongTian Empire to join the Heavenly Jewel Tournament.</p><br/><p>As such, they had waited in the Fei Li City, planning to reunite with Zhou Weiqing before thinking of their next step.</p><br/><p>Alas, they had not expected that as soon as Zhou Weiqing returned to the Fei Li City, he only returned to the Academy, and had barely stayed for less than a day before being attacked and leaving the city again. By the time the Heavenly Bow Unit members discovered that, Zhou Weiqing had already left.</p><br/><p>With no other choice, the Heavenly Bow Unit members could only make use of spider’s web and horse’s footprints for detective work 1 and chase them. Midway, they had actually managed to catch up with Zhou Weiqing’s group.</p><br/><p>Hua Feng, Mu En and the others had discussed it and decided not to alarm Zhou Weiqing, instead seeing what he had planned first. As such, they had all followed the group stealthily. With their skill in hunting and tracking, Zhou Weiqing and the others had not realised they were being followed.</p><br/><p>When they saw Zhou Weiqing enter the ZhongTian Empire and head towards the northern border, they had a vague idea of what Zhou Weiqing wanted to do. As such, they continued following all the way to the TianBei City. Just as they were about to look for Zhou Weiqing, that rascal had ran off to the army camp instead, and they had just missed him.</p><br/><p>Since Zhou Weiqing was not there, they could not contact Lin TianAo and the others instead. After all, they would not know them, and would only rouse suspicion. As such, the members of the Heavenly Bow Unit just kept watch over them, and when they realised that Lin TianAo would send someone to the gate every morning to wait for Zhou Weiqing, they followed suit. It was only until today when they finally managed to successfully wait for Zhou Weiqing and reunite.</p>\n</div>"}