{"title": "Chapter 413", "id": 413, "volume": 5, "url": "http://boxnovel.org/heavenly-jewel-change-chapter-413", "volume_title": "Volume 5", "body": "<h1>Chapter 413</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>Having made the decision, Zhou Weiqing would not hesitate to begin. After arranging things simply, he began his first tempering training.</p><br/><p>This time, Zhou Weiqing had set his mind and steeled his resolve. As long as it would not affect his body foundation, he would set each Three Thousand Tempering period to be at five days.</p><br/><p>Ordinarily speaking, if a person did not eat and only drank water, his body could only last for seven days before perishing. Of course, for Heavenly Jewel Masters, that could extend up to perhaps fifteen days or more. However, in such a case, it would be extremely detrimental to the body, down to the foundation. Although Zhou Weiqing only chose a five day period, do not forget that he was going to continue doing this many times over.</p><br/><p>Five days of cultivation, two days of rest and recuperation. That was the training schedule that Zhou Weiqing had set for himself. Each time he would focus on a single Skill, and after five days of tempering it, he would spend the day to let his body heal and re-nourish it, at the same time reflecting on the experiences of the past few days and what he had learned.The seventh day would be to deal with any administrative matters of the Peerless Battalion. As for the communication with the TianBei City and Lin TianAo, and any other things, he would leave it to Shangguan Fei’er.</p><br/><p>Shangguan Fei’er would bring back any goods that Lin TianAo had bought, as well as any completed Consolidating Equipment Scrolls.</p><br/><p>Zhou Weiqing began his arduous journey of training. He had four Jewels, six Attributes, twenty four Skills. Amongst the twenty four Skills, besides the few that had already gone through the Tempering, and a few that were not able to go through such training like the Dragon Silencing Seal, Demonic Dragon God Seal and the Time Reversal Skills, the rest needed the training. According to his training schedule of seven days per cycle, the three months would be just nice for him to temper his Skills once through.</p><br/><p>When Zhou Weiqing first started on this training method, Shangguan Fei’er was still rather approving. The Thousand Tempering Method was known to all, but no one had such a great effect like Zhou Weiqing. After all, due to his Immortal Deity Technique caused his Heavenly Energy recovery rate to be far faster than any ordinary Heavenly Jewel Master, and he could use his Skills far faster than others. As such, he could complete the Tempering Training in just five days, and as long as he could withstand the torturous five days, the effect would be extremely great.</p><br/><p>However, after just two cycles, Shangguan Fei’er’s heart began to ache for him.</p><br/><p>In just that two weeks, Zhou Weiqing had lost weight noticeably, though not emancipated, he was clearly a lot thinner, having lost at least five jin or more. Although he still looked energetic, the normally huge musculature of him seemed an entire size smaller.</p><br/><p>Shangguan Fei’er had also tried to stop him from continuing, but deep in this hellish training, Zhou Weiqing refused to stop at all. She knew that once someone had set their resolve to undergo such a training, if they stopped it halfway, they would most likely be unable to muster the courage to go through it again. For Zhou Weiqing’s sake, she could only hold herself back from stopping him forcibly, watching from the side with an aching heart.</p><br/><p>However, she also tried to do her best to help with what she could.</p><br/><p>Each tempering cycle of Zhou Weiqing’s was seven days, and before every fifth day had ended, Shangguan Fei’er started to prepare food for him.</p><br/><p>Normally, she would leave earlier, and no one else would know where she went, and she would return with a hunted Heavenly Beast and brew some meat stew for Zhou Weiqing, adding some ground Heavenly Core and some medicines that she had brought out from the Heaven’s Expanse Palace. After which, she would make some simple porridge from the stew, so that the meat would be cooked until it was extremely soft. When Zhou Weiqing came out of his training, he would be immediately be greeted with a fragrant and delicious bowl of nourishing meat porridge, helping him recover.</p><br/><p>Furthermore, while Zhou Weiqing was training, she would continuously help replenish the water if he finished it, and she also added some Heavenly Core mixture she had prepared, helping to keep him as nourished as possible during the process.</p><br/><p>In this way, the severe slimming of Zhou Weiqing was reduced. Although he still grew skinnier, but with her detailed and thoughtful care, Zhou Weiqing remained much better after each cycle of training.</p><br/><p>In such a way, three months passed by in a flash, and Zhou Weiqing’s training had come to an end.</p><br/><p>A long shrill cry rang out from Zhou Weiqing’s tent, a ferocious roar like a tiger claiming ownership of a mountain. All the horses in the Peerless Battalion Camp fell to the ground, shuddering.</p><br/><p>In the middle of teaching the Peerless Battalion soldiers, Shangguan Fei’er looked up with a look of pleased surprise on her face. Without hesitation, she ran towards Zhou Weiqing’s tent. This was the last time, and she had already prepared the meat porridge earlier.</p><br/><p>The Peerless Battalion soldiers in the midst of training immediately beamed happily, but none of them dared to laugh at Shangguan Fei’er. They were clear that everytime Zhou Weiqing completed a cycle of training, their drillmaster would be extremely happy, and today the last twenty five would be saved from a beating.</p><br/><p>In this last three months, Shangguan Fei’er had already forged a position of absolute authority and respect in the Peerless Battalion, perhaps even above that of Zhou Weiqing. The ruffians of the Peerless Battalion were all utterly convinced in their hearts about Shangguan Fei’er’s power, but the real reason why the were so willing to listen to Shangguan Fei’er was not just because of her power and violence, but more importantly because of what she had taught them.</p><br/><p>In just three months, each and every one of the Peerless Battalion soldiers could clap their chests and guarantee that their close combat capabilities now were like heaven and earth compared to previously. Currently, no matter any one of the soldiers of the Peerless Battalion, if brought out to any of the normal armies, could definitely defeat any of their Company Leaders.</p><br/><p>They had felt their strength and power grow and escalate as the days passed through the tough training. Although it was definitely tougher than anything they had experienced before, they could only accept it. Furthermore, the fighting styles that Shangguan Fei’er taught them seemed to have a great effect on Heavenly Energy cultivation, and many of the Physical Jewel Masters of the Peerless Battalion had actually advanced to their next stage of cultivation level.</p><br/><p>As for the seven masters of the Heavenly Bow Unit, they too took turns to learn from Shangguan Fei’er. One could imagine how great the close combat skills that Shangguan Fei’er were teaching.</p><br/><p>Not caring about shy about it, Shangguan Fei’er quickly ran back to the camp. From Zhou Weiqing’s loud cry, she could easily tell that his Heavenly Energy had improved once more.</p><br/><p>After all, after that previous ‘accident’, Zhou Weiqing’s cultivation level had just raised up to the seventeenth stage, or the fifth stage of the Heavenly Shen Energy. At that level, it was already much slower to raise up each rank of Heavenly Energy. However, with the Immortal Deity Technique, Zhou Weiqing was definitely extremely ‘disgusting’, and just within this short three months, he had not only stabilized his fifth stage of Heavenly Shen Energy, he had actually broken through to the sixth stage! As such, he was only two stages away from the five-Jewel cultivation stage.</p><br/><p>With just a quick comparison to herself regarding Zhou Weiqing’s cultivation speed, she realised that after leaving the Heaven’s Expanse Palace, she had not even raised a level of Heavenly Energy cultivation level. At that point, her Heavenly Energy was at the twenty seventh stage, just a single stage away from the seven-Jeweled stage. According to her own estimations, in order to breakthrough to that stage, it would take her at least half a year to a year to do so. Although that was because entering the Heavenly Xu Energy Stage meant each stage was even tougher and slower to raise, but she had already been at this stage for more than six months. Just from this alone, one could see how insanely fast Zhou Weiqing was raising his cultivation level. If he continued at such a speed, perhaps he would even reach the five-Jeweled stage within the year.</p><br/><p>One Jewel per year… such a speed was definitely inconceivable to any Heavenly Jewel Masters!</p><br/><p>Taking a step out of his tent, Zhou Weiqing felt his legs a little wobbly. After all, he hadn’t eaten for five days, and no matter how nourishing the water was, it was still just water!</p><br/><p>His nose twitched slightly, and he could smell the familiar scent of the meat porridge, and his stomach rumbled loudly in response.</p><br/><p>“Dearest, come quick, I’m starving to death!”</p><br/><p>Shangguan Fei’er carried a small pot of meat porridge as she walked towards him, saying: “You deserve it! Who asked you to train like that. Eat up.” As she said that, she passed him a bowl of porridge.</p><br/><p>“Ahh that smells so good… just a bit too little.” Zhou Weiqing gulped down the entire bowl of porridge, which had already been brought down to the right temperature. Instantly, a warm feeling started to spread through his body. Although he did not know what Shangguan Fei’er had added to the porridge, he knew that the reason why he was able to raise a stage of Heavenly Energy in just three months was not just because of his tough training, but also because of the porridge and water she prepared for him for the past few months.</p><br/><p>Shangguan Fei’er said: “You have not eaten for five days, how can you suddenly eat too much?” The small pot of meat porridge was the best essence of all the food and medicines, but it could only fill three small bowls. It would definitely not fill his stomach, but it was more meant to nourish and reawaken Zhou Weiqing’s physiology. After a bit of time for recovery, he would be able to eat properly without harming himself.</p><br/><p>Finishing the three bowls of porridge swiftly, Zhou Weiqing collapsed onto the ground, not caring about his image.</p><br/><p>Shangguan Fei’er kept the bowls and pot, saying: “So, how did it all go? Did you finish training all your Skills?”</p><br/><p>Zhou Weiqing said: “Yup, I did! I finally completed all the tempering. You were right indeed, I really had just too little understanding of all my Skills. This three months might have been a tough and torturous time, but it was definitely worth it. I feel like I have totally been reborn. Oh right, how has the registration for the trading to the WanShou Empire gone?”</p><br/><p>Shangguan Fei’er said: “Relax, I personally went to look for that Legion Commander Shen Ji, and everything has been arranged properly. We can leave at any time, and I have also brought Lin TianAo and the others here to stay here in preparation.”</p><br/><p>Zhou Weiqing abruptly flipped himself over, pulling Shangguan Fei’er into his embrace and giving her a gentle kiss on the side of her beautiful face. “Dearest, you are really a great wife.”</p><br/><p>Getting kissed so suddenly, Shangguan Fei’er blushed a deep pink, struggling a bit but not succeeding in breaking free, she gave him a light punch on the shoulder. “You haven’t bathed for five days, so stinky! Hurry up and go bathe. Since you have finished your training, you’ll need to be updated on the status of the Peerless Battalion. I’ll go get the others.”</p><br/><p>Zhou Weiqing had just eaten the delicious porridge and the warm feeling was making him feel rather lazy, but he knew he had to get up to wash up and he clambered to his feet.</p><br/><p>Shangguan Fei’er walked away a few steps, then stopped suddenly. Turning around abruptly, she said to him: “There is something else I have to tell you, someone has come from the Heaven’s Expanse Palace.”</p><br/><p>“En?” Zhou Weiqing exclaimed in surprise: “They already know you are here?”</p>\n</div>"}