{"title": "Chapter 410", "id": 410, "volume": 5, "url": "http://boxnovel.org/heavenly-jewel-change-chapter-410", "volume_title": "Volume 5", "body": "<h1>Chapter 410</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>“Little Wei, these bunch of brothers of yours are all part locusts?” Mu En couldn’t help but ask as he stared with his jaw agape at the scene before him.</p><br/><p>The ruffians of the Peerless Battalion were just too skilled at robbing. Without any hesitation, it was as if a crowd of humans crashed down like a wave down upon the field before spreading away again, leaving nothing in the wake; even the war wolf corpses were carted away. After all, that was food, and the ruffian soldiers of the Peerless Battalion, used to and afraid of hunger, would definitely not waste any food. Furthermore, the leather of these wolves would be great against the biting cold weather, how could they waste any of it?</p><br/><p>As the Vice Battalion Commander, Wei Feng naturally wouldn’t join the others in looting. Instead, he quickly headed towards Zhou Weiqing and the others, saying: “Battalion Commander, Trainers. It will take a while for the camp to be set up again. Trainers, all your archery is godlike indeed, this is indeed an eye opener for Wei Feng.”</p><br/><p>Looking at Wei Feng clearly, the seven members of the Heavenly Bow Unit were also secretly surprised. They could sense that this Wei Feng’s cultivation level was above theirs. This Ruffian Battalion was indeed interesting.</p><br/><p>Zhou Weiqing said: “Vice Commander Wei, why don’t we just retreat directly into the tunnels? It is rather cold outside anyway.”</p><br/><p>Wei Feng smiled bitterly and said: “Battalion Commander, don’t you think we are afraid of the cold as well? Alas, as you know, these tunnels were only created to hide out to save our lives, and it is small, constricted and without much airflow. We haven’t had time to expand the tunnels yet, how can we stay there.”</p><br/><p>Zhou Weiqing said: “Right, no wonder you would rather sleep in those lousy broken tents outside. Alright, get everyone to bury those wolf cavalry soldiers corpses properly, bring back their equipment and war wolves, those are our spoils of war. Tonight, I will be coming up with a proper reward and punishment system. From tomorrow onwards, our Peerless Battalion will start a proper system of training.”</p><br/><p>Wei Feng smiled faintly and nodded towards Zhou Weiqing. Although the Ruffian Battalion was not easily controlled, he was still confident that under the benefits that Zhou Weiqing was providing, it would be much easier. Furthermore, this young Battalion Commander already had some prestige and respect amongst the Peerless Battalion.</p><br/><p>…</p><br/><p>For the next few days, Zhou Weiqing planned a series of trainings for the Peerless Battalion. All one thousand two hundred of the men were split into twelve groups, each a Company of hundred men. He selected two more Company Leaders, to make a total of twelve Company Leaders, each leading one group.</p><br/><p>Everyday, the twelve groups would split into three to undergo training. Shangguan Fei’er would take four to undergo close combat training, the seven god archers of the Heavenly Bow Unit would take another four groups to undergo archery training, while the last four groups would be under the charge of Wei Feng, digging tunnels. Zhou Weiqing and his teachers, along with the other officers of the Peerless Battalion, had come up with a planned architecture to expend their underground tunnel system.</p><br/><p>Naturally, to undergo the archery and close combat training, they had to pay fees, totally 5 gold coins per person per month. As for digging the tunnels, the monthly pay was also 5 gold coins. That was to say, every month’s pay and payout was neutralized in a cycle of working and training, but they would still be able to get their normal monthly pay.</p><br/><p>Of course, to the ruffian soldiers of the Peerless Battalion, this was not stimulating enough, but Zhou Weiqing had another system of rewards and punishment set in place.</p><br/><p>He got Wei Feng to have the entire Peerless Battalion soldiers register with him, including everyone’s current physique and Heavenly Energy cultivation level; everything in detail. Once anyone’s Heavenly Energy cultivation raised, they would be richly rewarded with a hundred gold coins.</p><br/><p>Every month, there would also be a grand battalion competition between the Companies. Whichever Company won, that Company would be rewarded with the most delicious food for that day. The entire Company would also be rewarded with a thousand gold coins. As for the Company who got the last place, for the next month their tunnel digging would be increased for two hours per day. The last four Companies of the entire Battalion would also lose their pay for that month.</p><br/><p>Besides the Company level competition, there was also a personal competition. Amongst the entire one thousand and two hundred men, those at the officer level were not allowed to join the competition. The final champion of the personal competition would be awarded with a free set of Consolidating Equipment Scrolls. Furthermore, this competition was held every month.</p><br/><p>At the same time, previously, the method that Zhou Weiqing had said about being able to challenge officers at any time was still in place. As long as anyone could defeat their Company Leader, they could take his or her place.</p><br/><p>Ten days had passed, and the training of the entire Peerless Battalion was starting to be set in proper order. Zhou Weiqing had brought back a hundred longbows this time, along with the hundred that they had robbed from the Sixteenth Regiment previously, it was enough for their training purposes. In any case, there were only four hundred men training at a single time.</p><br/><p>The seven masters of the Heavenly Bow Unit were pretty good at teaching, and the basics of archery was rather simple. Besides the basic training, their targets were not simply ordinary targets, but shooting against each other.</p><br/><p>Two men would face off, soldier A would shoot at soldier B, then vice versa. Of course, the arrow tips were all removed, but this still encouraged a competitive spirit between them all. At the same time, they wouldn’t get into actual fights. The reason for that was simple, as Hua Feng had sent an order down. If you wanted revenge, sure, use your archery to fight back. If you wanted to fight with your fists, no problem! You can fight against the close combat trainer, Shangguan Fei’er!</p><br/><p>There were other, more fun, training methods as well. For example, the seven members of the Heavenly Bow Unit would run ahead three hundred yards, and then the four hundred trainees would chase them, both sides shooting at each other. Anyone who got shot by an arrow would be sent out of the game.</p><br/><p>According to reason, the seven god archers of the Heavenly Bow Unit would definitely win. However, the result was surprising, as the seven of them were nearly beaten into pigs’ heads. The reason was simple, how could those ruffians possibly listen to rules, and all those struck by arrows did not back out of the game. In the end, only Hua Feng with his speed, and Mu En with his cunning, managed to escape. Shui Cao and Yi Shi were still relatively okay, with their savage attacks they managed to hold off most of the ruffians. The worst were Luo Ke Di, Han Mo and Gao Shen who were eventually caught up. The three were beaten up so thoroughly, and they were so surrounded that they couldn’t even make out who beat them.</p><br/><p>As such, that was the only time that training ‘game’ was played before it was switched to the ruffians against each other, a larger group against the other. Of course, the seven members of the Heavenly Bow Unit would take the role of judge and supervisor, and any ruffians who broke the rules would be taken care of by them.</p><br/><p>In theory, Shangguan Fei’er’s training should be extremely tough for her. After all, she was one person alone training four hundred men.</p><br/><p>However, in truth, she had it the easiest. Every lesson, she only taught one move, before separating the men into groups to practice. She would then go by all around one by one to correct them. Just like that, they would continue fighting against each other, but only with the move that she had just taught. The ones who won would be okay, but the half that lost would continue fighting again. This would continue all the way until there were only twenty five ‘losers’ left. These twenty five were definitely on a bad patch, as it would mean that Shangguan Fei’er would personally train them for the last hour under the watch of the other three hundred and seventy five.</p><br/><p>After this had happened once, for the next lessons, when they ruffian soldiers fought against each other, it was as if they were in savage frenzies, treating their opponents like hated enemies that had killed their families. The reason for that was naturally because Shangguan Fei’er was just too savage.</p><br/><p>Just like that, all of them started training. One day close combat, one day archery and one day tunnel digging. Also, every month, there would be three days where there would be a general battalion training, where they would be trained in working together. For this, Zhou Weiqing was not experienced in it, and he left it to Hua Feng.</p><br/><p>All of that might seem like Zhou Weiqing had nothing to do, but in truth, he was one of the busiest. First of all, he had to arrange all the resources and split it up, arranging everything while trying to get more resources. Planning all the tunnels, furnishing them, changing gold coins, and generally harmonizing everything.</p><br/><p>For ten whole days, Zhou Weiqing was immersed in all the work. He passed the heavy duty of handling money to Wei Feng, and not the Heavenly Bow Unit members. Towards this, Hua Feng saw it and nodded inwardly.</p><br/><p>The reason Zhou Weiqing did this was not because he was afraid of being accused of nepotism, but an action to try to win him over. After all, he was still very new as a Battalion Commander, having only been here for a short time. Although his actions had earned him to respect of the Peerless Battalion, giving them much gain, his status was still not fully stable yet.</p><br/><p>Wei Feng was after all one of the original officers, and the original bunch of officers might still have some wary feelings towards them. In such a circumstance, the trust and respect Zhou Weiqing showed towards Wei Feng would definitely help ease any uneasiness on both sides and remove any gaps.</p><br/><p>More so, Zhou Weiqing always felt that as a leader, he would not want to be busy to death, but to be free and easy. As the main leader, what he needed to do was to guide them all, to be in charge of the overall direction. As for the exacts of things doing, it should be left to his subordinates. As the saying goes, if you suspect someone, don’t use them, if you use them, don’t suspect them. If he did everything by himself, he would be busied to death, with no time to even cultivate.</p><br/><p>After the ten days of training, everything was settling into place as they were all heading down on the path together. After all the time and gold investment, the Peerless Battalion was starting to change, even the aura about them was different; at least, the originally lazy, bored ruffians who were just waiting to die were now energized and enthusiastic. Zhou Weiqing had promised them that within a few years he would bring them away from this place.</p><br/><p>Just as Zhou Weiqing finally freed himself from all the nitty gritty and was about to enter his personal training, the Sixteenth Regiment came once more.</p><br/><p>This time, their Regiment Commander Shen Bu had come once more. However, she only brought a Company of cavalry with her, without the enmity that she held the previous time.</p><br/><p>Knowing that Shen Bu was here, Zhou Weiqing came out to receive her welcomingly, as if the two had never clashed before. Secretly, he sent the order to stop all training and digging. He did not want anyone to know what he was doing down here.</p><br/><p>“Regiment commander Shen Bu, such an honoured guest. Come, come to my tent to have a seat.” Zhou Weiqing came up to her with a warm smile on his face.</p><br/><p>Shen Bu’s expression was still not good, but she dismounted and said politely: “There is no need, Battalion Commander Zhou. I am here just to pay for our heavy cavalry equipment. As you know, in the army, every regiment has a limited supply of heavy cavalry equipment, and in a few days we have a live training exercise. As such, we would need the hundred sets of heavy cavalry armour back please.”</p>\n</div>"}