{"title": "Chapter 424", "id": 424, "volume": 5, "url": "http://boxnovel.org/heavenly-jewel-change-chapter-424", "volume_title": "Volume 5", "body": "<h1>Chapter 424</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>This was actually Zhou Weiqing’s ace in the hole, and it was his greatest key to the negotiations with the Blood Red Hell. By this point, his Heavenly Energy had secretly recovered to a decent level, and if the Blood Red Hell members truly insisted on killing them all, Zhou Weiqing trusted that by pitting their lives, he could still get Little Red Bean out to send news. He also trusted that the Heaven’s Expanse Palace would have some methods to communicate with a Heavenly Beast. It was not too rare for Life Attribute Heavenly Jewel Masters to have such means.</p><br/><p>This time, all six of the Blood Red Hell members faces changed, their expressions all ugly. Although both sides were Great Saint Lands, with the Heaven’s Expanse Palace’s power, if they went all out, it would not be too difficult to actually wipe out the Blood Red Hell.</p><br/><p>The main reason why they had actually dared to attack Zhou Weiqing and the others was firstly because they were confident in their absolute overwhelming power in taking them down, and along with that, the confidence in ensuring no one could escape. Alas, the Silver Emperor was a major unexpected variable that totally changed things. Furthermore, Zhou Weiqing had said that news had already been sent back to the Heaven’s Expanse Palace.</p><br/><p>They were extremely clear what status both Zhan LingTian and Shangguan Fei’er were to the Heaven’s Expanse Palace, and Zhou Weiqing’s words were certainly possible. After all, when comparing wealth in the world, who else could fight with the Heaven’s Expanse Palace? Shen Little Demon had personally seen the Lustre Spatial Realm and Lustre Gems and their miraculous effects, and who dared say that the Heaven’s Expanse Palace did not have a long distance message delivery system?</p><br/><p>The rest of the Blood Red Hell members turned towards Han Tianyou, their gazes urgent and anxious.</p><br/><p>Han Tianyou was in a dilemma, and he truly did not know what to do. The reason he had taken action was mostly because of his own personal hatred. He only had a single disciple, Han Bing, and his death in the Heavenly Jewel Tournament was a huge blow to him. Furthermore, he had once lost his fingers to Shangguan Longyin years ago, and that exacerbated the hate he had for the Heaven’s Expanse Palace. Meeting with Zhou Weiqing and the others here, it had been such an opportunity that he could not pass up, and all that hate had burst forth at once.</p><br/><p>However, this speech of Zhou Weiqing’s had caused him to be stuck in an embarrassing situation, caught between a rock and a hard place, and at that moment he was at a loss.</p><br/><p>What Zhou Weiqing said was indeed true, his injuries were extremely severe and he needed to tend to his wounds and start a healing process as soon as possible. Although he had forcefully suppressed his injuries and sealed his meridians with just his sheer power, the Silver Emperor’s Wing Slash and its piercing destructive capabilities had totally broken four of his ribs, and he was barely holding them together with Heavenly Energy. If the Silver Emperor really used the Silver Emperor Lightning Pierce to escape, he would not be able to stop it.</p><br/><p>All of their expressions fell into the astute eyes of Zhou Weiqing, and he thought to himself: There’s hope!</p><br/><p>“Senior Han, actually there is always a possibility for a turnaround.” Before Han Tianyou could make a decision and speak out, Zhou Weiqing continued easily. “At least, up until now, nothing too serious has happened. Undoubtedly, in order to protect ourselves, we have injured Senior Han, and all of us have also been injured.”</p><br/><p>“However, at least on both sides there have not been any deaths. If Senior Han is willing to drop the matter and withdraw your killing intent, there is still a possibility for a favourable resolution. Perhaps, the Heaven’s Expanse Palace might be slightly angry at the Blood Red Hell, but if Bro Zhan and Fei’er are unharmed… added on to the fact that Senior has taken a serious injury, the Heaven’s Expanse Palace wouldn’t do anything towards the Blood Red Hell for such a small matter. After all, there would not be any strong enmity. Of course, this junior will be willing to expel the venom for Senior as well, and we will count it as even. We will immediately inform the Heaven’s Expanse Palace that we are all fine.”</p><br/><p>Han Tianyou exclaimed angrily: “You all injured this Elder, and I even lost an arm, and you want to count it as even?”</p><br/><p>Zhou Weiqing shrugged and said: “If Senior did not attack first, this all would not have happened. Oh yes, there is one more thing I need to remind Senior, actually I am also now considered part of the Heaven’s Expanse Palace… The Third Young Miss of the Heaven’s Expanse Palace, Shangguan Bing’er, is my fiancee. If Senior is not worried that my father in law will look for you, you can always kill me after I expel your venom. Alright, I have finished speaking, the decision is all up to you now, Senior.”</p><br/><p>Han Tianyou’s face turned red and white intermittently as he warred with himself internally. Zhou Weiqing’s words definitely sounded reasonable, and in truth, if they stopped right now and Zhan LingTian and Shangguan Fei’er were unharmed, the Heaven’s Expanse Palace would definitely not do anything to the Blood Red Hell. However, how could Han Tianyou be satisfied with that? Old hatreds and new hatreds together, this would not be a good compromise for him, not even a slightest bit of satisfaction at all.</p><br/><p>“Elder Han.” Shen Little Demon moved in a flash beside Han Tianyou, tugging lightly on his sleeve as she said softly to him. “Elder, we cannot afford to bet, as we cannot afford to lose on this. Revenge is a dish best served cold[1].”</p><br/><p>Indeed, the Blood Red Hell could not afford to lose, as this was the sheer difference in power. Han Tianyou was so furious that his entire body was trembling, but he could only forcefully suppress the venomous hate in his heart.</p><br/><p>“Alright. You, come here and expel the venom for this Elder.” At last, Han Tianyou howled out in a low angry tone, and all of them could hear the sheer humiliation and vexed anger in his voice.</p><br/><p>Zhou Weiqing said seriously: “Senior is indeed one of the pillars of the Blood Red Hell, making the best decision at the critical time.” As he said that, he walked towards Han Tianyou.</p><br/><p>At this point, even Zhan LingTian was sweating on behalf of Zhou Weiqing. The few of them had been watching Zhou Weiqing use his silver tongue and speak so glibly and convincingly. What was once a confirmed death situation had been forcefully turned just through his words alone! Even someone as proud and arrogant as Zhan LingTian couldn’t help but feel respect for that.</p><br/><p>Zhou Weiqing walked to two yards from Han Tianyou before stopping. The nearer he got, the more nervous he became. After all, the hatred and enmity from a Heavenly King Stage powerhouse was a palpable pressure that almost seemed like he could be killed at anytime, and one could imagine the amount of stress and pressure he was under. However, things had already progressed to such a state, and he could only persevere.</p><br/><p>When Zhou Weiqing stepped forward, the Silver Emperor on his shoulder had flown back, not following him forward.</p><br/><p>Zhou Weiqing bowed respectfully towards Han Tianyou and said: “Senior, in a while, I will be using the Devour Skill to draw out the venom from your body. This is just to inform Senior beforehand, so there will not be any misunderstandings.”</p><br/><p>This was truly an overt plot, and Zhou Weiqing would not allow Han Tianyou any chance to act up.</p><br/><p>Han Tianyou looked towards Shen Little Demon, who nodded at him, indicating that Zhou Weiqing was telling the truth.</p><br/><p>“Come on then.” Han Tianyou’s angry look slowly turned icy cold as he forced himself to calm down.</p><br/><p>Zhou Weiqing took two steps forward to beside Han Tianyou, lifting his right hand towards his left shoulder. Circulating his Heavenly Energy, he activated his Devour Skill.</p><br/><p>This was Zhou Weiqing’s first time Devouring a Heavenly King Stage Jewel Master, and the moment he activated the Devour Skill, he could clearly sense Han Tianyou’s energy flooding into him like a boundless ocean crashing down towards him.</p><br/><p>Too strong! He’s way too strong! Zhou Weiqing exclaimed in his heart. Previously, in their fight, he estimated that perhaps Han Tianyou had not even used a tenth of his Heavvenly Energy. If not for the fact that he had severely underestimated them, along with a good measure of luck, cunning and great usage of unique abilities together with all of their teamwork, they could not possibly have injured Han Tianyou. If Han Tianyou was not injured, and his mind was in a stable state and without any threat to his life, he would most likely not have succeeded in persuading him to let them go.</p><br/><p>Feeling his own Heavenly Energy surge out of him, Han Tianyou’s expression did not change. After all, Zhou Weiqing’s cultivation level was just too far below his own, and no matter how strong the Devour Skill was, it was impossible for the current Zhou Weiqing to drain Han Tianyou dry. Just a tenth of his Heavenly Energy would be enough to totally fill Zhou Weiqing and more.</p><br/><p>After a moment, Zhou Weiqing withdrew his hand. With the Devour Skill, at least he was now at full Energy once more.</p><br/><p>“Alright, done. I have already drawn out all the venom from your body.” Zhou Weiqing said with a smile on his face.</p><br/><p>At that point, surprisingly, Han Tianyou also smiled. Clapping his hand on Zhou Weiqing’s shoulder, he said: “Good, very good. You are truly the most outstanding youth I have seen in your generation. Let’s go.” The last sentence was naturally towards the Blood Red Hell members, and after that, he rose up into the air along with them.</p><br/><p>After they all left, Zhou Weiqing’s expression changed instantly, looking extremely ugly. When Han Tianyou had clapped his shoulder, he could clearly sense a stream of heat entering his body. That old fellow had not been able to resist to take action against me after all?</p><br/><p>His expression remained shadowy and gloomy, but Zhou Weiqing did not say anything, instead jumping up to the top of a nearby tent, watching the Blood Red Hell members disappear into the distance. He kept watch all the way until they disappeared far off, and he could no longer see them, before he finally jumped back down onto the ground.</p><br/><p>As soon as his feet touched the ground, his legs buckled and he sat down on the ground.</p><br/><p>At that moment, he was almost instantly drenched with sweat as he panted for breath.</p><br/><p>His companions all surrounded him, including Zhan LingTian.</p><br/><p>“Little Fatty, how are you?” Shangguan Fei’er was the first to charge to Zhou Weiqing’s side, holding his arm in support.</p><br/><p>Zhou Weiqing gave a bitter smile and said: “Finally, that old fellow has been tricked away. This time, it is truly unbelievably lucky that we could survive.”</p><br/><p>Previously, the confidence and bold speaking appearance he had put on, as if he had everything in his grasp, disappeared totally. In truth, he had been under an unbelievable amount of stress. Han Tianyou could have struck out at any time, and if that happened, he would have been wiped off the surface of the world forever. At every moment, he had been subjected to the full pressure of a Heavenly King Stage powerhouse’s strength and scrutiny. Without talking about the impact it had on his body, just the sheer assault to his spirit was incredible. If not for the fact that Zhou Weiqing knew that this was their only hope between life and death, and had burst forth with a sudden willpower, he might have crumpled under such pressure long ago.</p><br/><p>“What do we do next?” Most surprisingly, the one who asked the question was Zhan LingTian.</p><br/><p>Lifting his head to look at him, Zhou Weiqing did not sense any goodwill in Zhan LingTian’s eyes, but at least the previous ill intentions had disappeared, and the arrogant pride that had been there was restrained.</p>\n</div>"}