{"title": "Chapter 423", "id": 423, "volume": 5, "url": "http://boxnovel.org/heavenly-jewel-change-chapter-423", "volume_title": "Volume 5", "body": "<h1>Chapter 423</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>In the next moment, he appeared right before Zhou Weiqing. Right where he was standing a moment ago, a terrifying-looking massive red palm imprint was on the ground, almost a whole metre deep into the ground.</p><br/><p>“I do not need you to save me.” Even at this point, Zhan LingTian’s enmity towards Zhou Weiqing was still high. The reason why he had just survived was because Zhou Weiqing had just recovered enough Heavenly Energy to use a Touch of Darkness Skill, forcefully dragging him back.</p><br/><p>Zhou Weiqing laughed heartily and said: “A living dog is better than a dead lion, living a second longer is still better than nothing. Senior Han Tianyou, can you hear me out for just a mere line?”</p><br/><p>At this point, Han Tianyou did not want to rush into killing them, wanting to savour their deaths. Looking coldly at Zhou Weiqing, he said: “What do you have left to say? No matter what, it will not change all your fates.”</p><br/><p>Zhou Weiqing smiled faintly and said: “Yet, what I am saying is totally to do with you. Indeed, your reaction was extremely quick just now, chopping off your own arm instantly and stopping the spread of my Dark Demon God Lightning Tri-Attribute Venom. However, there is something I have to warn you, this venom of mine is extremely unique… although your cultivation level is extremely high, once it enters your body, it has already spread throughout your entire body. Although the source of the venom was cut off instantly, it has already left a seed within. Before long, when it acts up again, even an immortal god will not be able to save you.”</p><br/><p>Han Tianyou started momentarily, then gave a cold humph, saying: “Little brat, you’re trying to scare me? Do you think I will believe you?”</p><br/><p>Zhou Weiqing said calmly and unhurriedly: “It’s up to you whether or not you want to believe. However, I’m not sure if Lady Shen has told you previously about this Triple Venom of mine, and even Senior Shangguan Longyin was not able to do anything about it. To be more accurate, in this world, only I can actually get rid of this venom. If you wish to bet with your life, please do take action and kill us all. To have a Heavenly King Stage powerhouse accompany us in death, I am already satisfied.”</p><br/><p>As he said that, he closed his eyes, the faint smile still on his face, the expression on his face like that of a martyr willing to face his death in a relaxed manner.</p><br/><p>Han Tianyou did not move, scrutinising Zhou Weiqing carefully, checking every single detail on his face and not letting go of even any slightest change. However, he was soon disappointed, as he could not sense any weakness or flaw in that impassive expression.</p><br/><p>No one would joke around with their own life, and though Han Tianyou was able to sacrifice his own arm ruthlessly earlier, if that arm was his neck, he would definitely not do such a thing. Who didn’t cherish their own life? Especially a Heavenly King Stage powerhouse like himself, under ordinary circumstances, living up to two hundred years old was no problem. In Han Tianyou’s eyes, all of the people right here added up together were not even as valuable as his own life! As such, he did not dare bet, not at all.</p><br/><p>The rest of Zhou Weiqing’s companions began to clamber up to their feet. Lin TianAo had his six-Jeweled Assembly Set Shield, and his defense capabilities were astonishing, and of all the entire party, he was the least injured. Next was the highest cultivation level, Shangguan Fei’er, she did not have any major problems as well. As for Crow and Ma Qun, though their cultivation levels were much lower, their physiques were all top notch, almost far beyond human, and though their wounds were severe, it was not up to the point where they could not even stand.</p><br/><p>At this point, they all gathered together and stood behind Zhou Weiqing. Towards his words, it could be said that everyone in the entire area did not know what to think of it, as it did sound rather dubious, yet with a hint of truth. No one could tell whether or not he was lying or telling the truth, not even his own companions, who were all rather startled by his words.</p><br/><p>Of course, they were at least smart enough to keep silent. After all, this was perhaps their last chance.</p><br/><p>Was there really a remaining seed of venom in Han Tianyou’s body? The answer was naturally no… the Dark Demon God Lightning might be extremely powerful, but it was not that strong with such a gap in power that a Heavenly King Stage powerhouse would be totally affected by it in an instant. Of course, Zhou Weiqing was exaggerating, making an inflammatory statement to incite fear.</p><br/><p>What Zhou Weiqing had grasped onto was Han Tianyou not being willing to bet with his life. With the state of things, fighting was already a lost cause, and this was truly their last hope. What he needed to do now was to induce Han Tianyou to believe him, using an excuse to help him draw out the venom and make use of the Devour Skill, and hopefully be able to control him somehow and menace the other Blood Red Hell member.</p><br/><p>In truth, Zhou Weiqing knew clearly that the chance of this plan working was close to zero, and he hadn’t even thought it through yet. Still, at least if he tried, there would be a chance; if he did not try, they would all just die like that. Just like what he told Zhan LingTian, surviving for any additional second was just so precious, and he would grasp onto any thread of survival possible, no matter how thin it was.</p><br/><p>Han Tianyou’s bloodshot eyes turned to Shen Little Demon, and he asked: “Little Demon, is what he said true?”</p><br/><p>Looking at his terrifying eyes, Shen Little Demon couldn’t help but shiver. Although she knew that if they did not deal with today’s happenings properly, they could bring a mortal enemy of the Heaven’s Expanse Palace to the Blood Red Hell, alas things had already developed to such a point.. With Han Tianyou’s crazed emotions at this point after losing his arm, attempting to stop him was useless, and the only thing they could do was to help him cover things up to the best of their abilities.</p><br/><p>As such, she nodded her head and said: “At that time, Shangguan Longyin did indeed say that no one else was able to take care of the Tri Attribute Venom of his, and even the Heaven’s Expanse Palace was unable to do anything. At that point, he was the one who personally brought me to look for Zhou Weiqing to ask him to expel the venom.” As she said that, she subconsciously looked at Zhou Weiqing, who opened his eyes at that moment coincidentally. Looking at the slightly mocking eyes, she couldn’t help but stall, as she suddenly remembered how Zhou Weiqing had only agreed to save her because of Shangguan Longyin’s promise.</p><br/><p>Han Tianyou’s gaze, filled with killing intent, returned to Zhou Weiqing, and he snapped: “Fine. You, come here and help me expel the venom. If you dare try anything funny, I will instantly slaughter all of you.”</p><br/><p>Zhou Weiqing burst out laughing, laughing so loudly as if he had come across the funniest joke in the world.</p><br/><p>“What are you laughing at?” Han Tianyou took a step forward, a terrifying pressure instantly pressing down on them all, so much so that it was difficult to even breathe.</p><br/><p>Zhou Weiqing smirked coldly and said: “Senior Han Tianyou, Senior Live Hades… Please may I ask why should I help you expel the venom? If I do so, would you let us go free? I’m afraid not right? Since that is so, let us die together then. Come on, kill them all, then let me see how your torture methods are. If I, Zhou Weiqing, scream from the torture, I’m no real man.”</p><br/><p>“You’re asking to die!” Han Tianyou lifted his hand, preparing to slap down at him. Zhou Weiqing was not afraid at all, standing up with his hands behind his back, taking a step forward with a look of readiness on his face.</p><br/><p>In the end, Han Tianyou’s blood red palm stalled in midair, and he did not slap down. Although he hated Zhou Weiqing so much, he still did not want to bet with his own life.</p><br/><p>He did not know that currently, Zhou Weiqing’s clothes were totally soaked in sweat. Without question, if Han Tianyou’s palm were to strike down, he would have died instantly.</p><br/><p>“Little brat, with the current situation, do you really think there is a possibility that I will let any of you go? This also concerns the future of our Blood Red Hell, so your deaths are certain. If you are willing to expel the venom for me, I will let all of you die an easy, painless death.” Han Tianyou said coldly.</p><br/><p>Although his voice was still cold and filled with killing intent, his words showed that it was without a doubt that he was already starting to make a concession.</p><br/><p>Zhou Weiqing waggled a finger at Han Tianyou and said: “No, no, Senior Han, I’m afraid that there is something you have not understood clearly. In truth, no matter whether we live or die today, everything that has happened here today will be known by the Heaven’s Expanse Palace.”</p><br/><p>“What did you say?” Shen Little Demon could not retain her composure and exclaimed: “You’re bullshitting. If you all die here, how could the Heaven’s Expanse Palace know?”</p><br/><p>Zhou Weiqing glanced at her disdainfully, saying: “You have also attended the Heavenly Jewel Tournament right? You should not be unfamiliar with the amazing Lustre Gem that the Heaven’s Expanse Palace has right? Yet, how could you mere Blood Red Hell members know how miraculous those gems are? No matter Bro Zhan or Fei’er, they are of utmost importance to the Heaven’s Expanse Palace, they can be said to be the legacy of the Heaven’s Expanse palace. In order to ensure their safety, how could the Heaven’s Expanse Palace not have certain safeguards in place? In fact, all that has happened here was already sent back not long ago. If you do not kill us, there is still some hope of settlement. If we all die, heh heh, if the Heaven’s Expanse Palace does not wipe out your Blood Red Hell, Your Father, I, will take your surname.”</p><br/><p>Zhou Weiqing stood there, speaking calmly, totally looking like he was in control; not only did he cause the Blood red Hell members to feel fear in their hearts, even his companions felt their hearts convulsing.</p><br/><p>Of course, the ones whose hearts convulsed the most was naturally Zhan LingTian and Shangguan Fei’er. What safeguards? What sending news? All of that was utter rubbish that Zhou Weiqing had come up with himself, and nothing like that was true. However, just looking at him speak so confidently, let alone their enemies, even Shangguan Fei’er and Zhan LingTian felt like what he said made so much sense, and that all seemed so true.</p><br/><p>In truth, Zhou Weiqing’s famed acting skills exploded in this critical time of life and death, and he was now risking everything on it. If he could not fool the members of the Blood Red Hell, they would all die here now. If he could, they would have a slight chance of survival. In such a circumstance, how could he not lie with all his wits, finding every possible chance.</p><br/><p>Hearing Zhou Weiqing’s words, Han Tianyou’s expression turned ugly. If what Zhou Weiqing said was true, even if he killed all of these people here today, it would not be long before the masses of powerhouses from the Heaven’s Expanse Palace descended upon the Blood Red Hell. He might be a Heavenly King Stage powerhouse, and of much rank and status in the Blood Red Hell, but even he would not be able to bear the burden of such a consequence.</p><br/><p>Zhou Weiqing smiled faintly and continued: “Senior Han, I know that you might not believe what I said. Let me remind you one more thing which you can definitely believe in. I believe that Senior Han’s injuries are not minor, and although you can use your Heavenly Energy to suppress it all, I’m certain it will still have not a small effect on your current strength. As Senior has seen, I have a Silver Emperor right here. Let me ask you, Senior, with your current state of injuries, and with everyone else here, who can stop my Silver Emperor if it uses its full speed with the Silver Emperor Lightning Pierce? If we are forced, we will pit all our lives to stop all of you for a split second, and I believe that we can definitely do it, and my Silver Emperor will definitely be able to send news back to the Heaven’s Expanse Palace. As such, I have no need to lie to all of you… by now, the Heaven’s Expanse Palace has already received news of us meeting powerful enemies here.”</p>\n</div>"}