{"title": "Chapter 433", "id": 433, "volume": 5, "url": "http://boxnovel.org/heavenly-jewel-change-chapter-433", "volume_title": "Volume 5", "body": "<h1>Chapter 433</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>“We’re not going anymore?” Shangguan Fei’er asked curiously.</p><br/><p>Zhou Weiqing nodded, saying: “This time, we have barely gotten far and we have already run into so much troubles… it is clear that our luck this run is just too terrible. Well, the more important thing is that our power is just not sufficient, I have been too impatient, reaching far above my means. Furthermore, now that the Blood Red Hell members have clashed with us, and we need to report this back to the Heaven’s Expanse Palace immediately, and let them decide on a solution. Bro Zhan, what do you think?”</p><br/><p>Zhou Weiqing’s last question showed his respect for Zhan LingTian, and as soon as he heard that he felt much more comfortable. After the past few days, Zhou Weiqing had revised his opinion of the arrogant young man. Though that fellow was undoubtedly extremely proud and arrogant, and rather focused on wanting face, he was not a bad person. Just from how he was able to step forward bravely in a time of danger, that was enough to cover his other faults.</p><br/><p>Zhan LingTian nodded and said: “This time, the Blood Red Hell was the one who betrayed their own word, also disregarding the honour of our Heaven’s Expanse Palace. We do have to send word back about this as soon as possible. I agree with Weiqing, we should return to his Peerless Battalion before returning to the Heaven’s Expanse Palace immediately.”</p><br/><p>Shangguan Fei’er pursed her lips in dissatisfaction before saying: “Fine… I originally wanted to go play around in the Ten Thousand Beast Heavens, you guys are so boring. The first time we meet some problems, you just shrink back.”</p><br/><p>Zhou Weiqing grinned and said: “Heh heh, that ‘shrink’ word, well done.”</p><br/><p>Shangguan Fei’er blushed suddenly, giving him a punch on his shoulder. “You just barely escaped death, and you can’t control your mouth again. As a matter of fact, I have to say your luck is unbelievably good. Do you know who the Six Ultimate Heavenly Emperor is? He is one of the top Heavenly Jewel Masters in the entire world, even more senior than my father or big uncle. His power is truly unfathomable, and in the Heavenly Emperor Stage, he is unparalleled.”</p><br/><p>Zhou Weiqing laughed heartily and said: “Well, I don’t know about that, but my teacher has already left. After some time, he will come to the Peerless Battalion to look for me.” He only explained things simply; after all this was the secret history of the Legacy of Strength, and he did not wish to spread it in detail.</p><br/><p>Zhan LingTian said: “In that case, let us head back then.”</p><br/><p>Right at that moment, eight Snow Deer Tribesmen walked forth, each carrying different sorts of delicious looking food. The one in front was an old man, looking to be about sixty to seventy years of age. He bowed down respectfully towards them and said: “Honoured guests, greetings to you. Since you are all friends of Great Ancestor, no matter what, you should have a nice meal here at our Snow Deer Tribe before leaving, otherwise Great Ancestor will blame us.”</p><br/><p>After the events of the evening, the group were rather hungry. Furthermore, in such a biting weather, looking at the piping hot, delicious food, if they could just ignore it like that, they would not be human.</p><br/><p>Besides Shangguan Fei’er, all of them were large and stout, especially Ma Qun and Crow, the two champion appetites were tantamount to that of three ordinary men. Looking at the delicious spread before them, deer milk, fried biscuits, bread, barbequed meats, it was a true feat that they managed to keep themselves from drooling.</p><br/><p>Zhou Weiqing said: “Alright, thank you all so much. We will leave after eating then.” In the first place, he had planned to discuss the possibility of purchasing some mounts from the Snow Deer Tribe, so this was a good opportunity for him. Since their previous tents had been totally destroyed by Han Tianyou, the Snow Deer Tribe led the group to another larger, more luxurious tent. It was lined with soft fur, causing the entire tent to be warm.</p><br/><p>The Snow Deer Tribe food definitely was a unique local flavour, although rather heavy, it was filled with a wild fragrance, and they all enjoyed the delicious cuisine. Even Zhan LingTian and Shangguan Fei’er who had eaten many delicious foods in their time couldn’t help but eat with gusto. Especially the slightly sweet deer milk was unique but delicious, increasing their appetite drastically while sending a comfortable warmth throughout their bodies in a nourishing way.</p><br/><p>As they ate, they quickly learned that the old man was the current Tribe Leader of the Snow Deer Tribe. Although he was rather respectful and polite, the Heavenly Energy reverberations around his body was definitely not weak.</p><br/><p>The old man was very respectful towards Zhou Weiqing, and he clearly knew about the Six Ultimate Heavenly Emperor taking him as disciple.</p><br/><p>“Elder, has your Snow Deer Tribe always lived here?” Zhou Weiqing asked the old man.</p><br/><p>The old man answered with a hint of fear in his voice: “Please do not call me elder, my name is Yi Erhan, please call my name directly. In terms of seniority, you are one generation senior to myself. In the past, my grandfather served the Great Ancestor, and if not for him, our Snow Deer Tribe would have been wiped out long ago.”</p><br/><p>“Oh. In that case, I’ll call you by your name directly, you can also call me by my name. I am Zhou Weiqing.” Zhou Weiqing was not overly polite, as he knew how important such seniority matters were. Modesty was a virtue, but overdoing it was just being false. Especially since he was now the Six Ultimate Heavenly Emperor’s disciple, and he could not let his teacher lose face.</p><br/><p>“In that case, this old man will comply deferentially rather than decline courteously. Mr Zhou, we Snow Deer Tribe are nomadic in nature, though we rear these Snow Deer, the totems of our tribe. In truth, this camp here is just a mere portion of our entire Tribe. The main reason we stay here at this time is to seize the opportunity when there is no war to earn some money from the human traders who take the trading route, to aid our entire tribe in survival.”</p><br/><p>“In the vast plains of the WanShou Empire, our Snow Deer Tribe is merely a tiny one, barely ten thousand strong. Compared to the larger tribes like the Wolfmen Tribe, Tigermen Tribe, or the Lionmen Tribe, we cannot compare at all. Furthermore, after so many years of wars, many of our tribesmen were drafted for war. Although our death toll was not high, our numbers have never been high, and several times we have came close to being wiped out. Luckily, our Great Ancestor asked the Heavenly Snow Mountain to spare us from drafting, and the great Heavenly Snow Mountain Lord personally allowed it. That gave our Snow Deer Tribe a chance to recuperate and rebuild up our strength, to do some small business in the borders.”</p><br/><p>Hearing Yi Erhan’s words, Zhou Weiqing’s heart stirred. It looked like his teacher did have some connection with the Heavenly Snow Mountain after all, even knowing the Legendary Top Powerhouse in the entire mainland.</p><br/><p>“I see, so that is why… Well, could I ask if your Snow Deer are available for sale?” Zhou Weiqing asked tentatively.</p><br/><p>Yi Erhan started at that question, before shaking his head with an apologetic look on his face. “I’m afraid not. Unfortunately, the Snow Deer are our totems, and they are the ones who have given us life and everything, how could we possibly trade them? The Snow Deer are our guardian deities, and when we meet any enemies, our finest warriors will mount the Snow Deer to charge through their formations.”</p><br/><p>“Ahh, I see. No problem.” Zhou Weiqing nodded his head with some disappointment. Of course, he would not force such a thing.</p><br/><p>Looking at the disappointed look in Zhou Weiqing’s face, the Snow Deer Tribe Leader felt some fear. All this while, the Six Ultimate Heavenly Emperor had been their greatest benefactor, yet he had never asked them for anything. In truth, with Long Shiya’s power and status, besides providing him with food and comfort, they could not really offer him anything.</p><br/><p>At this point, Long Shiya, who had always been alone, had finally managed to get a disciple, and he had finally a request. Wasn’t this the perfect opportunity to repay the Six Ultimate Heavenly Emperor and stay in his good books?</p><br/><p>“Mr Zhou, could I ask why you are looking to buy the Snow Deer?” Yi Erhan asked tentatively.</p><br/><p>Zhou Weiqing laughed heartily and said: “I have a troop of soldiers at the other side of the border. Since I’ve heard so much about the strength, build and speed of your Snow Deer friends, I originally wanted to purchase some for my soldiers as mounts. They would be extremely useful in future battles.”</p><br/><p>Yi Erhan furrowed his brow, silent. Selling the Snow Deer was naturally impossible, as it was the most important of their tribal laws. Furthermore, even if he agreed to the request, his own tribesmen would rebel against it.</p><br/><p>In truth, Zhou Weiqing had not had much hopes that this would succeed, and he had only been trying his luck in asking. Seeing that Yi Erhan remained silent, he quickly headed back to the table to snatch more food to eat. Snatch was indeed the right word to use here, as in just the short period of time he had been speaking with Yi Erhan, the other members had been gorging on the food. If Zhou Weiqing had been any slower, it would have been likely he did not have anything left to eat.</p><br/><p>Zhou Weiqing continued eating comfortably, enjoying himself. However, Yi Erhan was in a dilemma; after all, such a chance was indeed hard to come by, yet it was just too difficult to accomplish.</p><br/><p>After a few minutes of silence, it was as if he had suddenly set his resolve, and he abruptly looked up towards Zhou Weiqing and said: “Mr Zhou, as you said, our Snow Deer Tribe’s Snow Deers are indeed extremely powerful, even in a one versus one fight, against the tiger or panther steeds, we still have confidence to fight with them. However, our Snow Deer can only be ridden by our Snow Deer Tribesmen, and even for us, we need to individually gain their approval and respect before we can do so, and to become our great Snow Deer Cavalry Warriors. How about this instead, if you have any requirements in future, you can send in a request. As long as the fight is not against our WanShou Empire, I can lend you five hundred Snow Deer Cavalry Warriors. When the fight is over, you can just let them come back.”</p><br/><p>What? There was even such a good deal? As soon as Zhou Weiqing heard the offer, he was extremely delighted. Without even needing to train these soldiers and he would be able to gain a troop of five hundred powerful Snow Deer Cavalry Warriors? That was unbelievably great news!</p><br/><p>Yi Erhan thought that Zhou Weiqing’s silence meant he thought it was too little, and he said with a slightly pained tone: “Mr Zhou, our entire tribe only consists about ten thousand in population, and only those finest warriors and elites will be able to become Snow Deer Cavalry Warriors. In our entire army, the Snow Deer Cavalry Warriors only number about a thousand, and we will need to keep some around to deter any possible enemy incursions. Sending out five hundred of them is already our absolute maximum.”</p><br/><p>“Oh! I do not think it is too little at all, I am extremely happy with that.” Zhou Weiqing said hastily. “Tribe Leader Yi Erhan, thank you so much for that. Do not worry, even if I do need your help in the future, I will not use your Snow Deer Cavalry Warriors for nothing. I will pay a good fee as well as food, we’ll count it as I am hiring your Snow Deer Cavalry Warriors. How does that sound?”</p><br/><p>Yi Erhan did not reject Zhou Weiqing’s suggestion. After all, the Snow Deer Tribe was a small tribe, and their Snow Deer Cavalry Warriors were highly sought after by many of the stronger tribes. If not for the fact that the Six Ultimate Heavenly Emperor had ascended the Heavenly Snow Mountain on their behalf, their Snow Deer Tribe might have been swallowed up by a larger tribe by now.</p><br/><p>Author’s Note:</p><br/><p>Tang Tang (his daughter) is sick with pneumonia, and she is on the drip. Yet, at this time, I suddenly saw that I have dropped far below on the monthly vote. Could this be the legendary ‘Joy comes never more than once but sorrows never come singly.’? Or a pile of misfortune at once?</p><br/><p>My heart is so cold, and feels so terrible.</p><br/><p>Tang Tang is ill, and is currently staying at her grandmother’s place, which is closer to the hospital where she needs to be on the drip. After this post, I will go to see her again, before coming back to write some more. I will not miss tonight’s post as well, as promised I will rush out another release before going back to see Tang Tang.</p><br/><p>Although I do not wish to say this, but I have no other choice. For Tang Tang’s sake, I can no longer keep a close watch on the monthly vote roll. All this while, my wife has paid a heavy price for my sake, and it is only because of her support that I can continue writing stably. Now that our child is sick, I cannot possibly ask her to handle it all on her own. I can only ask that, brothers and sisters of the Tang Clan, could you allow me to relax and take care of them, to pay back all the support they have given me all this while, and I can leave the monthly vote roll to you? Thank you.</p><br/><p>Zen: Just a note that the book has long been complete, I translated this author’s note mainly to show how tough it can be for an author, even for one as successful as TJSS.</p>\n</div>"}