{"title": "Chapter 441", "id": 441, "volume": 5, "url": "http://boxnovel.org/heavenly-jewel-change-chapter-441", "volume_title": "Volume 5", "body": "<h1>Chapter 441</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>The Peerless Battalion soldiers had been assigned Consolidated Bows according to their respective Physical Jewel Attributes. For example, those Physical Jewel Masters that had Stamina and Strength were assigned the Explosive type Overlord Bows. The other Physical Attributes were assigned the Piercing Type Overlord Bows. However, typically speaking the most common attribute was the Strength Attribute, and thus so many of them had the explosive type Overlord Bow.</p><br/><p>Zhou Weiqing did not take action personally, instead raising the massive flag in his hands. As he did so, a wild aura of bloodlust burst forth from him and he shouted: “Peerless Battalion brothers, before us is the Swift Wolf Regiment that has raided our homeland countless of times, slain countless of our comrades, an important unit of the WanShou Empire. Today, the opportunity has come for you to use your arrows to personally take revenge for all your countrymen. Everyone, get ready, take aim and listen for my command!”</p><br/><p>One thousand two hundred Consolidated Bows raised up slowly as they stood shoulder to shoulder, their arms steady, arrows already nocked to their bowstrings.</p><br/><p>The Wolf Cavalry Soldiers were so speedy that as soon as they entered vision, they wheeled and charged instantly.</p><br/><p>An entire Regiment of war wolves charging at top speed… although the sound was definitely no match for war horses, their speed was much more terrifying. A sea of black cascaded down towards them in a neat formation, like a massive dark cloud bank descending from the skies to swallow the entire Peerless battalion.</p><br/><p>In a blink of an eye, the Wolf Cavalry Soldiers had already reached a distance of thousand five hundred yards.</p><br/><p>At this time, Mu En and Luo Ke Di had kept the food and wine in their hands, and the seven masters of the Heavenly Bow Unit had all drawn their respective bows.</p><br/><p>“Draw your bows, get ready!” Zhou Weiqing shouted.</p><br/><p>Ten breaths. The Wolf Cavalry Soldiers had charged to a thousand yard distance, and the Peerless Battalion soldiers could already sense the powerful scent of blood emanating from them.</p><br/><p>Row after row of Consolidated Bows, pulled to full crescents, and the thick reverberation of Heavenly Energy was almost palpable as the entire Peerless Battalion stood at the ready, and it was as if the very air around them was twisting and turning subtly.</p><br/><p>“Release!” Zhou Weiqing pointed ahead with the massive flag as he shouted in an explosive voice.</p><br/><p>An ear piercing screech, and Zhou Weiqing almost lost his hearing instantly. One thousand two hundred Overlord Bows rang out at once, the sheer volume of the screeching sound causing even the charging war wolves in the distance to be startled.</p><br/><p>The effect of releasing one thousand two hundred Overlord Bows at the same time was totally unexpected. Just the sound of it alone was enough to strike fear deep into the soul.</p><br/><p>One thousand two hundred arrows flew out along with the sound, but the only thing that could be seen was a wave of shadows.</p><br/><p>The absolute maximum range of the Overlord Bow was a thousand two hundred yards, but in order to ensure accuracy, Zhou Weiqing had waited til the enemies had passed the one thousand one hundred yard distance before ordering to fire.</p><br/><p>“What is that sound?” At the release of the bows, Regiment Commander Butler was given a shock. Although they were still relatively far from their enemies, sound travelled quickly especially across the empty plains, and such a powerful shrill screech caused him to feel a strong sense of unease.</p><br/><p>Right at that moment, a series of violent explosions mixed with shouts and screams of pain, along with the thudding sound of arrow impacting into flash abruptly rang forth.</p><br/><p>The front row of the charging wolf cavalry soldiers had never expected that they would meet with such powerful attacks at such a range. Although they were still more than a thousand yards away from their enemies, as these arrows filled with piercing or exploding effects reached them, most of the wolf cavalry soldiers were not able to dodge or block them.</p><br/><p>It had all happened too quickly.</p><br/><p>The wolf cavalry soldiers were mostly geared in fine leather armour, but how could their leather armour possibly guard them from the titanium alloy arrows!</p><br/><p>The Overlord Bows of the Peerless Battalion soldiers were not as high quality as Zhou Weiqing’s Overlord Bow, not only did they not have any sockets, the explosive or piercing effect they held was no match for Zhou Weiqing’s one as well. Even so, it was more than sufficient against these ordinary Wolf Cavalry Soldiers.</p><br/><p>Along with the series of explosions, the entire front row of the Wolf Cavalry soldiers felled like wheat being harvested. Just from this round of shooting, at least three hundred Wolf Cavalry soldiers had been killed, even their war wolves had not escaped the fate. This was also because many of the arrows had struck those in front, sparing those behind. There were also some of the Peerless Battalion soldiers who were too nervous from being in such a massive battle for the first time, and had lost accuracy or range.</p><br/><p>The first salvo had been launched, and Zhou Weiqing remained impassive as he planted the flag solidly into the ground. At the same time, he passed the command to Hua Feng.</p><br/><p>Hua Feng shouted out loud: “Second Ladder Formation, fire. Begin.”</p><br/><p>The Ladder Formation type of shooting was a specialised shooting style that was developed to accompany the Reverse Triangle Formation that the eight Companies were in. They would begin shooting as hundred men units, starting from the center spreading to the sides, forming a continuous rain of arrows.</p><br/><p>A large portion of the Peerless Battalion soldiers’ training was to shoot arrows, and after seeing the effect of the first salvo of arrows, all their excitement had been sparked. Drawing their bows once more, arrows flew out accompanied by their shrill cries, as if swarms of locusts descending down upon the Swift Wolf Regiment.</p><br/><p>“Quick, change formation, charge at maximum speed!” Butler howled in rage. He could not in his wildest dreams imagined that he would lose so many tribesmen just at the first meeting with this enemy.</p><br/><p>How was this possible?! How could this be?! They are still so far away, what kind of bow can have such a terrifying range and power?</p><br/><p>At this point, their distance was even closer than before, and Butler could clearly see the Peerless Battalion soldiers. In the glow of the sunlight, the titanium alloy mail shone with a resplendent gleam, and yet in the midst of that beautiful bright lights, the shrill cries of the arrows being released was like a death knell sounding.</p><br/><p>It was only by the time the second salvo was released that the Swift Wolf Regiment finally reformed their formation successfully. Due to their large numbers, they were unable to move in a single straight row. However, they were all experienced fighters, and under the leadership of Butler, they quickly made the right choice.</p><br/><p>The entire Swift Wolf Regiment had ten Battalions, and the Battalion Commanders, Vice Battalion Commanders and Company Leaders all charged to the very front. All the Wolf Cavalry Soldiers charged in a single file behind their respective leaders, shouting out their chieftain’s name, also the incantation that would invoke their bloodline powers: “Butler! Butler! Butler!”</p><br/><p>The power of the Wolf Cavalry Soldiers and their War Wolf mounts exploded forth in that moment, as all the officers were in a row, waving their sabres in their hands as they charged forward in the lead.</p><br/><p>The valiant ferocity of the members of the WanShou Empire showed itself clearly now; as the Regiment Commander, Butler also charged forward right in front and center of the entire Regiment, urging his gold war wolf mount as quickly as possibly in a crazed charge towards the Peerless Battalion.</p><br/><p>In the WanShou Empire, in order to become an officer, one had to be a powerhouse. All their Company Leaders were all Heavenly Jewel Masters, though most of them did not have many Consolidated Equipment. At the Battalion Commander level, they were at least Heavenly Jewel Masters of the fourth or fifth Jewel stage, with about one or two Consolidated Equipment at most.</p><br/><p>With all of them charging in that formation, it was difficult for even the arrows from Consolidated Bows to hurt them. As such, the majority of the third salvo of arrows from the Peerless Battalion was blocked.</p><br/><p>A cold smile crossed Hua Feng’s lips. This method again? They already used that the last time.</p><br/><p>“Everyone, angle upwards thirty degrees. Projectile motion shooting. Ready, shoot!”</p><br/><p>With the change in orders, all the Peerless Battalion soldiers swapped to projectile shooting, their arrows arcing into the air in a perfect parabolic curve, crossing the powerhouses of the Swift Wolf Regiment in the front, and landing accurately on the Wolf Cavalry soldiers behind.</p><br/><p>The Consolidated arrows were extremely powerful and destructive, and just after a few rounds of shooting, the Swift Wolf Regiment had lost another thousand men.</p><br/><p>Butler’s heart was bleeding. He now understood why the three Companies he had dispatched out previously had disappeared without a trace. As a Upper Level Zong Stage Heavenly Jewel Master, how could he not see that those arrows were filled with Heavenly Energy, most likely even fired from a Consolidated Weapon. Yet, in his memory, the ZhongTian Empire had never had such a army unit like that. What kind of power did those bows have?! That was a thousand yard distance, what kind of bow had that kind of range and power? Even up to now, he had not realised that all thousand over soldiers of the Peerless Battalion in front of him were Jewel Masters, though he could not be blamed for that. After all, it was quite inconceivable.</p><br/><p>Hearing the horrible screams from the back, Butler was bursting to charge deep into the Peerless Battalion formation to slaughter them all. However, he was after all still mortal, not a god. Even though he had a Upper Level Zong Stage cultivation level, he was still eight hundred yards from the Peerless Battalion, and he could not do anything.</p><br/><p>No matter how fast the Wolf Cavalry Soldiers were, they could not just charge a hundred yards as their enemies shot a salvo. With their current speed, by the time they could reach them, the Peerless Battalion would at least have the chance to shoot more than twenty rounds.</p><br/><p>Although the ordinary Peerless Battalion soldiers were far from being god tier archers, this half year of tough training under top classed teachers had given them all a decent accuracy. Furthermore, as their enemies came closer and closer, so did their accuracy improve.</p><br/><p>“Fire Arrows. Get ready!” Hua Feng shouted out loud.</p><br/><p>Amongst all the newly Awakened Jewel Masters, it was without a doubt that there were far fewer Elemental Jewels Masters than Physical Jewel Masters. Even so, with the aid of the precious medicines, over a thousand Jewel Masters had Awakened their Personal Power Jewels, and there were over sixty Elemental Jewel Masters who had Awakened from that. Of them, a majority were of the Fire Attribute, totally thirty six. Hua Feng had specially taken them aside out of the usual Companies and assigned them under the Cannon Gao Shen’s tutelage, and under his direction in combat.</p><br/><p>These Elemental Jewel Masters did not have Consolidated Equipment Bows, but they all had Stored one Skill. The Stored Skill was all the same for them, just a two-Star Rated Skill, Explosive Fireball. Normally, what they trained under Gao Shen was how to imbue this Explosive Fireball onto their arrows. Their arrows were all specially crafted, not only was the tip made of titanium alloy, even the entire shaft was. Due to their weaker physiques and lack of a Consolidated Equipment Bow, their range of accuracy was only a two hundred yard range, but without a doubt in terms of area of effect offensive power, these thirty six were the greatest weapon in the entire Peerless battalion.</p><br/><p>A merciless smirk crossed Gao Shen’s lips. To be gifted the nickname of Cannon, an experienced hand like him naturally knew the best time to release these Fire Arrows. He had been waiting all this time for their time.</p>\n</div>"}