{"title": "Chapter 443", "id": 443, "volume": 5, "url": "http://boxnovel.org/heavenly-jewel-change-chapter-443", "volume_title": "Volume 5", "body": "<h1>Chapter 443</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>As Zhou Weiqing had expected, the gold war wolf mount stopped in its tracks, and when Butler looked on in surprise at the Heavenly Skill Image behind Zhou Weiqing, he did not hesitate to release all his Consolidated Equipment in preparation.</p><br/><p>At this point, it showed the true difference between the WanShou Empire and the ZhongTian Empire. Without question, the WanShou Empire had powerful beastmen warriors with terrifying personal power. In terms of ordinary soldiers, the ZhongTian Empire might need at least ten to face off against one of the WanShou Empire’s soldiers to be able to hold their own. However, in terms of the higher ranked powerhouses, it was totally different.</p><br/><p>In terms of numbers of Heavenly Jewel Masters, the WanShou Empire was actually only slightly less than the ZhongTian Empire. However, in terms of quality, it was quite a major difference. The greatest reason came from Consolidated Equipment and Stored Skills.</p><br/><p>Just like all other Empires, Consolidating Equipment Masters were an extremely rare commodity in the WanShou Empire. On the other hand, with the Heavenly Jewel Island as their backbone, especially the Consolidating Equipment Pavilion there, the ZhongTian Empire had an advantage that no other Empire held.</p><br/><p>This Butler was already a nine-Jeweled powerhouse, but he could only unleash seven Consolidated Equipment at once. More importantly, they were not Sets at all, just seven loose pieces. The best one was the heavy spiked mace in his hands, a Zong Stage Consolidated Equipment. As for his other six, there were even High Level Consolidated Equipment, and a Mid Level Consolidated Equipment, with only two Grandmaster Consolidated Equipment that was still relatively decent. Unleashing seven Consolidated Equipment at once might seem scary, but in truth, their boost to Butler was not too huge, especially considering his current level.</p><br/><p>“Who are you…” Butler shouted out loud. Facing a Heavenly Skill Image, he was no fool, how could he possibly charge forward without thought. Alas, the Heavenly Skill Image also caused him to totally neglect Zhou Weiqing’s age.</p><br/><p>Zhou Weiqing gave a cold laugh and said: “I am the Peerless Battalion Battalion Commander, Zhou Weiqing. Remember my name…” A killing intent flashed in his eyes. Seeing that his opponent did not come to him, Zhou Weiqing charged forward towards Butler instead. At this moment, his Dragon Silencing Seal was already fully prepared and ready to strike at any instant. He would not allow the same thing that had happened to him during the fight against Han Tianyou to happen again for this fight he had prepared for so long.</p><br/><p>A ferocious light flashed in Butler’s eyes. He was after all the Regiment Commander of the Swift Wolf Regiment, and at this point his bloodlust and ferocity was fully evoked. Forcing his gold war wolf mount forward, he charged forth to face Zhou Weiqing head on.</p><br/><p>However, at the same time, the Swift Wolf Regiment who were behind Butler had run into great trouble.</p><br/><p>Butler had charged forth all by himself towards Zhou Weiqing, and not long after he had done so, the rest of the Swift Wolf Regiment had only reached about one hundred and fifty yards from the Peerless Battalion formation. The war wolf mounts began to lose their balance, stumbling as they fell into traps, large trenches that had been prepared and set beforehand.</p><br/><p>With an Earth Attribute Heavenly Jewel Master like Lin TianAo on their side, it was an easy task to open a wide trench like that, especially with the help of over a thousand Peerless Battalion Soldiers. That was the reason why Zhou Weiqing had chosen this place to hold their ground and fight. It would also allow the Swift Wolf Regiment to see their low numbers and in such a case, they would not split their forces and just attack head on.</p><br/><p>The trenches were about thirty metres wide, and even with the war wolf mounts’ powerful leaping capabilities, they would not be able to jump across. The depth of the trenches was only six metres, but they were filled with many ‘surprises’. For example, many sharp spikes, brimstone, dried grass, fire oils and other easily flammable substances.</p><br/><p>The over one hundred officers of the Swift Wolf Regiment were Heavenly Jewel Masters, with Company Commanders around two to three Jeweled cultivation level, Battalion Commanders around four to five Jeweled cultivation level. Alas, they had the same problem with the lack of Consolidated Equipment. The hundred or so of them were charging in a single row in order to block the arrows from the front, using their Heavenly Energy. As a result, by the time they had reached the trenches, the few hidden soldiers below just needed to release the trapdoors to unleash the full power of the trap.</p><br/><p>Over a hundred officers fell into the trap instantly.</p><br/><p>The reason why Zhou Weiqing had allowed Butler to come to him without setting off the traps was simple. With Butler’s power, the trench would be totally useless to him, and he could help his officers out easily. It would be much better to let him through and fight him head on, which would also have the added benefit of increasing the morale of his Peerless Battalion troops at the same time.</p><br/><p>Hua Feng had already calculated the distance, and at the same moment that the enemy officers crashed down into the trap, he had already given the order.</p><br/><p>The thirty six Fire Attribute Elemental Jewel Masters shot out the arrow they had prepared for this time… a titanium alloy full arrow imbued with the Explosive Fireball. They did not have any Consolidated Bows to help them, so their Explosive Fireball would start burning the Titanium Arrows. This was the reason why the trap had to be set at a one hundred and fifty yard distance, not any further. After all, that was the distance that their fire arrows could be sustained at an accurate measure.</p><br/><p>The war wolves of the officers were definitely of the highest quality, and even as they fell into the traps, they still managed to somewhat maintain their balance. Their defensive capabilities were also pretty decent with their tough fur, but no matter what they would not be able to fight against the physics of gravity and inertia.</p><br/><p>In a short period of time, the trench was filled with pained cries and shrill screams. Although not many of the Swift Wolf Regiment officers were actually injured, most of their war wolf mounts had died from the sharp spikes, or were heavily injured. Some luckier ones who had avoided the spikes still had their bones broken from the fall.</p><br/><p>These officers were old hands on the battlefield, and even with such a sudden blow to them, they knew better than to attempt to save their beloved war wolf mounts. They all knew that staying in the trap would possibly mean their deaths. Let alone what their enemies could do, their own men would be charging forth soon, and at such speeds, they would not be able to stop in time. If they fell on top of them, even as Heavenly Jewel Masters, these officers would not enjoy such treatment.</p><br/><p>Alas, just as they were preparing to react, the well prepared thirty six Explosive Fireball arrows struck down with precise accuracy into the trap.</p><br/><p>A whole series of explosions, and flames blazed high up into the air. The flammable and explosive materials in the trap were overabundant, especially with brimstone and fire oil added together, increasing the spread of fire and burning. Ignited by the powerful Explosive Fireballs, with loud booms, a wall of flame rose up across the entire trench, even reaching seven or eight metres tall.</p><br/><p>Some of the faster officers still managed to jump out in time, but there were those slower ones who had either been knocked back down into the trench by the Explosive Fireball arrows, or were just swallowed by the rising flames as they tried to jump.</p><br/><p>Those Battalion Commanders were still able to use their Heavenly Energy to barely protect themselves, but the Company Leaders were not so lucky. Their Heavenly Energy was not strong enough to protect them from such an onslaught of flames, and as the saying goes, the elements have no mercy upon mankind. In that instant, over twenty of the officers were swallowed up by the flames and perished. Even those surviving officers had lost all their war wolf mounts.</p><br/><p>This fire trap was just too perfect, and this plan was not from Zhou Weiqing, but from Mu En. In terms of sly cunning, who could compare to this God Eye Scoundrel?</p><br/><p>The true reason of the fire was not to kill the officers, but to cause them to lose all their war wolves. Towards the unique charging formation of the Swift Wolf Regiment, the Peerless Battalion officers had already witnessed it for themselves so many times, and it was all part of their plan. In order to block their arrows, they knew their enemies would definitely make use of this formation once more. With this fire, those strongest officers had now lost their greatest asset – their speed. Furthermore, this trap and fire wall would also slow down the remaining Wolf Cavalry soldiers behind. After all, they would not be able to vault across such a wide trench of thirty metres, and they could only pass around.</p><br/><p>This would give the Peerless Battalion soldiers time to retreat.</p><br/><p>“Retreat…” Hua Feng’s order came without hesitation, following their plan to the letter. His orders did not include the eighty ‘special forces’. Previously, they had been saving their strength, and this was their time to explode with all their might. Their task was not just to snipe down as many officers as they could, but also to cover their comrades’ retreat.</p><br/><p>The Peerless Battalion did not have many warhorses, but their running speed was not to be underestimated. Following Hua Feng’s shouted orders, all of them turned to run without hesitation, springing towards the hills where their ‘home’ had been. As for the seven Heavenly Bow Unit masters, they continued waiting there silently with the special forces unit. They were not in a rush to retreat; after all, they all had warhorses as mounts. Although not all were Ghost Demon Horses, it would not be a problem for them to retreat easily.</p><br/><p>Without a doubt, the combination of trench and fire wall had disrupted the steadfast charge of the Swift Wolf Regiment, causing some chaos amongst the ranks. At least a few dozen wolf cavalry soldiers on the second row had been charging too quickly, and they had not been able to stop in time, falling down into the trench trap as well. Sadly for them, they did not have the same power as their officers, and it was instant death for these ordinary wolf cavalry soldiers.</p><br/><p>Butler had been separated from his troops by the trench at his back, and as the wall of flame rose, the fight between him and Zhou Weiqing finally started.</p><br/><p>Zhou Weiqing pounced towards Butler, and in midair, he did something that Butler could not understand. With the power of his right leg, Zhou Weiqing had jumped up high, but Butler did not see any weapons in his hands, instead Zhou Weiqing’s right foot came crashing down upon him.</p><br/><p>Although Zhou Weiqing had spent the last six months training in the Six Ultimate Skill Manipulation Arts, it would take him a far higher cultivation level to be able to use it to unleash a greater power. As such, in terms of current actual combat, his fighting style was not very different from previously, just that his control over Heavenly Energy and his own Stored Skills had been greatly improved, and he would not waste a single drop of Heavenly Energy.</p><br/><p>Is this little brat crazy? He’s actually trying to attack me with his leg? That was Butler’s exact thought at the moment. After all, he was currently holding a massive 2.2 metre long spiked mace, the thickest portion on top even thicker than his own thigh and covered with a layer of terrifying looking sharp spikes. Even a thick block of steel would be smashed apart by his spiked mace, let alone Zhou Weiqing’s mere flesh and bone.</p>\n</div>"}