{"title": "Chapter 483", "id": 483, "volume": 5, "url": "http://boxnovel.org/heavenly-jewel-change-chapter-483", "volume_title": "Volume 5", "body": "<h1>Chapter 483</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>After much testing and verification from Ma Long and the other Berserker Tribe experts, the Unicorn Beasts were found to be able to carry the weight of the Berserker Tribe warriors, and more importantly, the Gold Crow Tribe warriors as well. Of course, in order to train them to be their steeds, it would take much time and effort to tame them and train them. As such, the warriors from the two Tribes would mainly be training as infantry troops for now. At the same time, in the upcoming battles ahead, the Peerless Battalion would definitely be targeting Unicorn Cavalry soldiers as their primary targets, with the main goal to gain as many Unicorn Beasts as possible to bring them into the Peerless Battalion Cavalry Stables.</p><br/><p>Yesterday’s rescue had been at the cost of five hundred war horses, pretty much the Peerless Battalion’s current stock of mounts. Even up to now, the First Main Company Leader Lei Zi was still aching at the heart about the loss.</p><br/><p>Zhou Weiqing believed that the Peerless Battalion was indeed on the right track, and the most important thing for them now was giving them time to properly develop and grow. He trusted that in the near future, once the entire Battalion was equipped fully, and with proper support and logistics, they would be an unstoppable force on any battlefield.</p><br/><p>In just a single day, Zhou Weiqing had arranged everything neatly and in detail for the Peerless Battalion’s immediate future, with contingent plans as he knew he would not be able to spend much time with them for a while. This time, he knew that he would be heading to the Heavenly Snow Mountain after his training, and it would be a do or die event. When, and if, he returned, it would be the time for the Peerless Battalion to leave the northern borders and head towards the Heavenly Bow Empire. There, both Zhou Weiqing and his Peerless Battalion would face their real challenge.</p><br/><p>…</p><br/><p>Night descended. As autumn deepened, the temperature at the northern borders grew colder and colder. The current skies were dark and overcast, and the moon and stars could not be seen, as if snow could descend upon them at any time.</p><br/><p>“Fei’er.” Zhou Weiqing hugged her by the waist, enveloping her in his embrace. The two of them stood there right by Zhou Weiqing’s tent entrance. Tomorrow would be the day of him leaving with Long Shiya.</p><br/><p>“What is it?” Shangguan Fei’er lay quietly in his arms, but her heart was racing swiftly. She knew that not far away, her elder sister was watching them.</p><br/><p>“Fei’er, do not worry about us at all. I will speak to Bing’er personally and explain everythign to her. No matter how she punishes me, I will accept it. However, in this period that I leave, you must think of me everyday, dream of me every night alright?”</p><br/><p>“Hmph! Won’t that mean I will have nightmares every night?” Shangguan Fei’er said exasperatedly.</p><br/><p>Zhou Weiqing was slightly embarrassed at that, and he retorted: “Dreaming of me means having a nightmare huh? Let’s see how I punish you!” As he said that, he lowered his head to give her a kiss on the lips.</p><br/><p>Shangguan Fei’er was thrown into a fluster, just about to struggle. After all, her sister was watching from not far off, and though she might be known as the Little Demon Girl of the Heaven’s Expanse Palace, she was still an innocent virgin. How could she be willing to be so intimate with Zhou Weiqing right in plain sight of her sister?</p><br/><p>“Fei’er, my wounds haven’t fully healed yet… if you beat me up now, it might reopen my wounds and delay my healing…” Zhou Weiqing gave an ‘Oscar-worthy’ pitiful look as he said that. With those shameless words, he managed to seize the opportunity that Shangguan Fei’er was momentarily stunned and catching her luscious lips.</p><br/><p>No matter how tough and powerful a girl was, being kissed by the man she loved, how could she easily resist. Furthermore, Shangguan Fei’er was actually afraid of reopening his wounds.</p><br/><p>Just like that, the two of them started kissing ardently as if no one else was around. Not far away, Shangguan Xue’er stood in the shadow of a large tent, her hands clenched angrily in fists, gripping her clothes to prevent herself from lashing out as she muttered to herself: “That bastard, so shameless! Such a scoundrel!”</p><br/><p>In the end, Shangguan Fei’er managed to break free and make her escape. However, in her heart she knew that if not for the fact that her sister was watching from a distance, perhaps she would have given in fully to the rogue, Zhou Weiqing.</p><br/><p>…</p><br/><p>The next morning, Zhou Weiqing and Long Shiya stealthily left the Peerless Battalion. In the entire Peerless Battalion, besides the high ranking officers who had attended the meeting yesterday, none of the ordinary soldiers knew that Zhou Weiqing had left temporarily, lest it influence morale and fighting spirit. In the end, Zhou Weiqing had never been in charge of daily operations and training with the troops, so his temporary disappearance would not be easily noticed.</p><br/><p>Of course, this did not affect Zhou Weiqing’s position and status in the entire Peerless Battalion. It could be said that for the Peerless Battalion to advance to its current position, it had all been brought about by Zhou Weiqing.</p><br/><p>Before leaving, Zhou Weiqing had specially reminded Lin TianAo that although the Berserker and Gold Crow Tribe warriors who joined the Peerless Battalion only numbered each a thousand, he still wanted to order the full two thousand sets of equipment. After all, these two thousand warriors were an extremely limited resource even for the two Tribes, and the Peerless Battalion did not need be so petty in spending.</p><br/><p>…</p><br/><p>The duo, Master and Disciple, galloped along the vast plains of the northern borders at a high speed. Zhou Weiqing was mounted on his Single-Horned Ghost Demon Horse, while Long Shiya had chosen a Unicorn Heavenly Beast. With his cultivation level, the Unicorn did not even need to be specially tamed, and would listen to his instructions without resistance.</p><br/><p>“Master, where are we headed?” Zhou Weiqing asked curiously. After exiting the army camp, Long Shiya did not bring him back to the ZhongTian Empire, instead continuing to head north. From the looks of things, they were headed deep into the WanShou Empire.</p><br/><p>“Do you know what is the Heavenly Spirit Fire?” Long Shiya glanced at him before asking.</p><br/><p>Zhou Weiqing shook his head.</p><br/><p>Long Shiya explained: “Heavenly Spirit Fire is a unique fire that has either descended from the heavens or risen from below the grounds. In our entire mainland, it is very rare to find such areas with these fires, but they definitely do exist. However, in order to make it for the coldest winter night timeline that we have, we are naturally going to the one in the WanShou Empire… only then will you have sufficient time to cultivate.</p><br/><p>Zhou Weiqing asked curiously: “Do you mean… it is in the Ten Thousand Beast Heavens?”</p><br/><p>Long Shiya shook his head and said: “Not exactly, but it is very close to the Ten Thousand Beast Heavens… the hottest area of the entire WanShou Empire. It is the Fire Spirit Mountain of the WanShou Empire Royal Family, the Lionmen Tribe’s Territory.”</p><br/><p>“According to legend, heavenly fire rained down from the heavens, sparking a volcano eruption from below, causing the mountain top to forever be burning with flame and smoke. Within a five hundred li radius of this volcano, temperature is always warm like the hottest day of summer. In the cold weather of the WanShou Empire, that is a miracle indeed, and only such an area would have such a warm temperature, as even the Ten Thousand Beast Heavens are affected by the four seasons. In any case, the Fire Spirit Mountain has Heavenly Spirit Fire, and it has always been occupied by the Lionmen Tribe. Just like the Lion Prince who injured you… he has probably cultivated there for quite some time. After all, the Royal Bloodline of the Lionman Tribe has the Heavenly Divine Earth Spirit Lion Bloodline, with the Fire, Divine and Light Attributes. As for the old fellow on the Heavenly Snow Mountain, his Divine Heavenly Spirit Tiger bloodlines have the Divine, Light and Water Attributes. Of course, only their direct and purest bloodlines would have such the abilities. Indeed, it is because they have two Saint Attributes at the same time that has enabled the Heavenly Snow Mountain to reign supreme for so long.”</p><br/><p>Zhou Weiqing couldn’t help but think to himself that the Fire Spirit Mountain must be of utmost importance to the Lionmen Tribe, perhaps even sacred ground to them! Only a powerhouse like his Master would dare bring him to such a place.</p><br/><p>Long Shiya said: “In the following few days, I do not want you to cultivate at all. As we travel there, I want you to rest and fully recover and to bring your condition to its maximum peak, without any problems. When we reach the Fire Spirit Mountain, we will immediately begin closed door cultivation. According to my estimation, in order to Awaken your Solidified Dragon Spirit in advance, you will need to bathe in the Heavenly Spirit Fire for forty nine days before you can succeed..”</p><br/><p>As he spoke up to that point, Long Shiya’s eyes showed a thick worry. Clearly, he was worried about going through such a method. Although in theory they could succeed, it was without a doubt that it would not be without great danger, especially since it had not been actually done before. If Zhou Weiqing was not careful, he might even have his mind destroyed; even if he could ensure his survival, he would be ruined, at most living as an idiot the rest of his life.</p><br/><p>Zhou Weiqing did not say anything else. He had already made up his mind, and he would not show any regret at this point. In any case, he did not have any choice for retreat; for Tian’er’s sake… for Tian’er’s sake…</p><br/><p>As soon as he thought about Tian’er, Zhou Weiqing felt full of fighting spirit. So what if it was forty nine days? He would definitely be able to endure it! If he couldn’t even endure this forty nine days, what right or qualification did he have to even ascend the Heavenly Snow Mountain?</p><br/><p>It was just the two of them, and they soon entered the WanShou Empire borders. In the distance, they could see the large camp of the WanShou Empire army on the vast plains.</p><br/><p>As compared to the ZhongTian Empire Northwest army camp, the WanShou Empire army camp was much simpler and crude; after all it was more of a temporary camp, and could just barely be used for survival. Such a barren and cold wasteland like the north, only the beastmen and their physique could survive in such plain and simple tents. Of course, the advantage of such simple and crude tents was that it was very easy for them to move. The supplies and logistics of the WanShou Empire armies had always been weak, and all of their people could be considered warriors.</p><br/><p>“Master, what are we going to do? Detour around?” Zhou Weiqing did not have the confidence to charge through such a massive army. An army of this size would definitely also have quite a few powerhouses along; just the Lion Prince and his two Heavenly King Stage guards would most likely be in the camp as well.</p><br/><p>“Keep your mount.” Long Shiya said.</p><br/><p>Zhou Weiqing jumped off his Ghost Demon Horse, keeping both their mounts into his Spatial Ring.</p><br/><p>A pondering look entered Long Shiya’s eyes and he said slowly: “Little Fatty, what do you say… should I go beat up that Lion Prince and cripple him before we head to the Fire Spirit Mountain? As long as I cripple ‘that area’ of his, then even if he marries your woman, he won’t be able to do anything.”</p><br/><p>Hearing his Master’s words, Zhou Weiqing only felt a large bead of sweat form on his forehead… This Master Long os his… why did he seem so similar to his other Master… Mu En… Without hesitation, he said: “Master, this is my own personal problem. Any other fights, I will be willing to take any shortcuts as long as I can win, any strategy or tactics to help me win. However, in this case, I will not choose that option. Master, I want to fight openly and aboveboard with Gu YingBing personally on the coldest day of winter, and defeat him personally with my own hands.” If his Master really took action against the Lion Prince, he knew that the Heavenly Snow Mountain Lord would definitely not marry Tian’er to him. If he wanted to gain back Tian’er, he could only do so with his own abilities, his own hands!</p><br/><p>“Very good, very good! High aspirations indeed! However, you little brat, you’re just too useless!” Long Shiya said with a displeased tone.</p><br/><p>“Useless?” Zhou Weiqing looked at him, puzzled.</p><br/><p>Long Shiya gave a humph and said: “Aren’t you truly useless? If you had given that Old Monster Xue’s daughter a few sons and daughters of her own earlier, come up with a Little Little Fatty, let’s see what he does. Hmph Hmph!”</p><br/><p>“Master… don’t play with me like that… So, how are we going to get across?!” Zhou Weiqing said with an exasperated look on his face.</p><br/><p>Long Shiya smiled and said: “Heh, I’ll let you enjoy the pleasures of flight for yourself.” Without any seeming movement, a flash of green light appeared, enveloping both him and Zhou Weiqing, and they instantly flew up into the air, soaring up high.</p><br/><p>In that instant, Zhou Weiqing felt as if the surrounding air had become a vast sea of wind, overwhelming all his senses from all directions as the Wind Attribute swept their bodies up into the skies.</p>\n</div>"}