{"title": "Chapter 485", "id": 485, "volume": 5, "url": "http://boxnovel.org/heavenly-jewel-change-chapter-485", "volume_title": "Volume 5", "body": "<h1>Chapter 485</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>Right at this moment, the Peerless Battalion actually opened ten betting stations, accepting all bets. The odds they set up were as such: Heavy Infantry Victory 1:100, Peerless Battalion Victory, 1:1.</p><br/><p>Such an action, without a doubt it truly angered the Heavy Infantry Regiment. At the same time, the entire Northwest Army burst into an uproar.</p><br/><p>By daring to open bets with such stakes, it was without a doubt that the Peerless Battalion had absolute confidence in themselves. At the same time, it was also a powerful provocation to the Heavy Infantry Regiment.</p><br/><p>Some of the more simple-minded immediately rushed to set their bets. In their minds, since someone was willing to gift them with money, how could they not accept it?</p><br/><p>Those slightly more clever felt that this action by the Peerless Battalion was just to anger their opponents and to strive for some possible advantages through that. None of them actually thought that it was the Peerless Battalion actually being confident in their own abilities.</p><br/><p>In that short period of time, there were those who quickly placed their bets, and those who stood back watching. The reason why so many were just watching was because they did not believe that the Peerless Battalion would be able to actually pay out such a bet.</p><br/><p>However, that night alone, all those doubts were swiftly dispelled. No one knew where the Peerless Battalion got a huge sum of gold, forming a pile of gold at each of the ten betting stations, like a small mountain, each heavily guarded by many soldiers.</p><br/><p>With that, the entire Seventh Legion exploded into action, and the number of people placing bets increased in an exponential explosion.</p><br/><p>The Northwest Army Command also learned about this quickly, but by the time they thought about stopping it, it was too late. At that point, too many officers and soldiers alike had already placed their bets on the fight. If at this point they tried to stop or confiscate the bets, it would without a doubt be a massive blow to morale.</p><br/><p>Furthermore, to the command, the Peerless Battalion was backed by the Heaven’s Expanse Palace. This was the reason why the Northwest Army Command did not easily interfere in their matters. In such a circumstance, this unbelievably huge bet had been settled.</p><br/><p>“Battalion Commander, the number of bets are just too many. We are almost unable to keep up with the records.” Wei Feng rushed to the command tent to report to Hua Feng. He had placed himself in a proper alignment in terms of status now that Zhou Weiqing was gone; though he was higher in terms of cultivation level than Hua Feng, Wei Feng truly admired Hua Feng’s capabilities and was fully convinced. Everything else aside, just his godly archery was worthy of his admiration, and he had learnt much from Hua Feng indeed.</p><br/><p>Hearing Wei Feng’s words, Hua Feng smiled faintly and said: “No problem. Tell the betting stations that they only need to record those who bet on us. As for those who bet on the Heavy Infantry Regiment, they are merely gifting us the money; we need not care about them. How much gold in wagers have we accepted by now?”</p><br/><p>Hearing Hua Feng’s words, Wei Feng’s expression turned strange, but he replied swiftly: “We have already received more than five million gold coins. In truth, the ordinary soldiers do not wager much; after all they do not have much money. However, the officers have bet quite a tidy sum… countless of people are waiting to make a joke out of us.”</p><br/><p>Hua Feng smiled and said: “Let them watch and see for themselves then.”</p><br/><p>“Indeed! Let them wait to see a joke then, we will see who has the last laugh. Ahh, robbing an entire Legion, such a feeling, it is not an ordinary sense of joy!” The Drunken Rogue, Luo Ke Di, lounged on a chair behind, saying with a wicked grin on his face.</p><br/><p>The seven God Archers of the Heavenly Bow Unit were currently in the tent as well, as they had been discussing the details of the upcoming fight with the Heavy Infantry Regiment with Shangguan Fei’er and Lin TianAo.</p><br/><p>Wei Feng said with some worry: “That might be so, but by doing so, we will be offending the entire Northwest Army…”</p><br/><p>Hua Feng smiled once more. This Wei Feng’s ability was not bad, alas his sense of the big picture was not there yet, and he lacked the foresight of a high ranking officer. Well, in the first place, it is Weiqing that little rascal who is truly the sharp one! In fact, this bet had been arranged by him before he left. Of course, perhaps there was the shadow of his Scoundrel teacher behind this scheme, but no one else would know the truth of the matter. After all, Mu En was lounging there with a carefree look on his face, as if none of this had any connection with him. However, his right eye was totally bruised… who knew when he had been punched badly.</p><br/><p>“Vice Commander Wei Feng, do not worry. Perhaps, we might be stirring up public wrath here. However, under the current circumstances, it will not be a big problem. After all, the main war is upcoming, and the WanShou Empire armies will soon be bearing down upon the frontlines. Just by losing money, they will not be able to take it out on us any time soon. As long as we prove ourselves on the actual battlefield, they will have to swallow the bitter pill eventually.”</p><br/><p>Light dawned upon Wei Feng, and he quickly rushed to arrange everything.</p><br/><p>Right at that moment, from outside the tent, a loud voice rang out. “Mu En, get out here right now!!”</p><br/><p>Hearing that voice, Mu En’s face changed instantly, and he fell backwards, almost tripping over his toppled chair, before flipping back onto his feet and slipping out of the tent through the side by pulling up the canvas.</p><br/><p>Right after he left, Hong Yu charged into the tent from outside. As soon as she entered, she howled angrily: “Where is Mu En? Where is that wretched Old Scoundrel?!”</p><br/><p>Hua Feng could not maintain his composure, and he said with quite some surprise: “Tribe Leader Hong Yu, what is the matter?”</p><br/><p>Hong Yu gave an angry humph and said: “Battalion Commander Hua Feng, please do not interfere in this matter. If I do not beat up that old thing until his own mother cannot recognize him, I will not be called Hong Yu anymore!”</p><br/><p>Yi Shi gave the ‘orchid shaped fingers’ sign, saying: “Big sis, what is the matter? What did Mu En do to you?”</p><br/><p>Hong Yu said angrily: “That Old Scoundrel dared to peek at me bathing!”</p><br/><p>Upon hearing those words, the entire tent was struck dumb momentarily. In the next instant, they all pointed at the side where Mu En had snuck out of. Only then did Hong Yu turn and charge out of the tent with another angry humph.</p><br/><p>After she had disappeared from sight, only then did the Heavenly Bow Unit members exchange helpless looks. In the end, all their gazes landed on Luo Ke Di, who shrugged and said innocently: “Why are you all looking at me like that? I did not go, I do not have such ‘heavy’ tastes like that Old Scoundrel…”</p><br/><p>A pause later, he gave in and continued: “… Alright, alright… I’ll tell the truth. Yesterday, he asked me to go along with him, saying that the Gold Crow Tribe were full of unique beauties and we should have a look for ourselves. However, I had drank too much and did not feel like moving, so I did not join him. Sigh… if he went to peek, that is fine, yet he actually got caught. Aiyah… that Old Scoundrel has regressed…”</p><br/><p>Hua Feng rubbed his forehead and said: “I hope he doesn’t get torn into bits. That taste… it is truly not ordinarily ‘heavy’. Tribe Leader Hong Yu… her figure is even more powerful than Crow! With her cultivation level, if she just gives Mu En a slap… I don’t even dare imagine it…”</p><br/><p>Shui Cao gave him a sheep’s eye and said: “In the end, I am still better right, look how gentle I am towards you!”</p><br/><p>At this point, Shangguan Fei’er could not continue watching any longer, and she snuck out of the tent to start preparing for the fight. She was truly starting to understand why Zhou Little Fatty was so ‘bad’… with such a bunch of teachers….</p><br/><p>Shangguan Fei’er had barely left, and the inglorious middle aged folks of the Heavenly Bow Unit had already started placing bets amongst themselves.</p><br/><p>Gao Shen exclaimed without hesitation: “I bet that Mu En will have to recover in bed for at least a month.”</p><br/><p>“I bet two months!” Shui Cao grinned and said.</p><br/><p>Hua Feng furrowed his brow and looked at them all, saying: “If you all want to bet, I will not stop you. However, who will be the banker? Don’t look at me, I do not have any interests in such unstable bets with high chance of losing.”</p><br/><p>“How about me? I’ll be the banker.” Luo Ke Di said, clearly still in a drunken sleepy state.</p><br/><p>The others exchanged looks. Having him in such a drunken state, if they did not seize the opportunity to con him, that would be rude of them!</p><br/><p>Hua Feng asked: “As the banker, what are your terms of betting?”</p><br/><p>Luo Ke Di burped, filling the tent with the scent of alcohol. “I bet that it will not take long, and Tribe Leader Hong Yu will bring the Old Scoundrel back like a little bird that rests upon a man. Furthermore, she will be gazing tenderly at him, even marrying him.”</p><br/><p>Everyone’s mouths twitched at the same time, almost an uncontrollable convulsion. Yi Shi said in a high pitched voice: “This fellow has really drank too much. Alright then, we’ll bet with you!”</p><br/><p>‘Flogging the cur that has fallen into water’ was a constant tradition of the Heavenly Bow Unit, and the rest swiftly placed their bets. The only one who did not bet was the unusually silent Han Mo.</p><br/><p>Hua Feng looked to Han Mo and asked: “Arrow Tower, why didn’t you place a bet?”</p><br/><p>Han Mo shook his head and said: “I’m afraid of losing.”</p><br/><p>Gao Shen said in surprise: “Losing to this drunkard? How can that be possible? Didn’t you hear the terms of his bet?”</p><br/><p>Han Mo said passively: “All I know is that amongst all of us, the one who knows that Old Scoundrel the best is him, and the two of them are the closest. When have you seen that Old Scoundrel do anything without a plan.”</p><br/><p>“Something is up!”</p><br/><p>Subconsciously, all of them turned to look at Luo Ke Di, only to see that fellow sweeping up all the wagered gold into his Spatial Ring as quickly as possible.</p><br/><p>Sensing the atmosphere in the tent had changed, and not in his favour, the previously seemingly drunk Luo Ke Di raised his head and smiled sheepishly: “What do you mean something is up! I don’t know anything.”</p><br/><p>Hua Feng grit his teeth and said: “Speak. If you spill the beans, we will treat is as paying for information. Otherwise… you know the consequences…”</p><br/><p>Looking at the bunch of them rubbing their palms eagerly, Luo Ke Di could only give a pitiful look and say: “Alright, alright, I will tell you all everything. As you all should already know, all these years, Mu En has been wearing a mask right.”</p><br/><p>The rest of them nodded subconsciously. The fact that Mu En wore a mask was a secret that only the few of them in the Heavenly Bow Unit knew, and even Zhou Weiqing did not know it. However, it seemed clear they did not the know the reason behind that. Luo Ke Di continued: “The reason why Mu En wears the mask is actually because of Tribe Leader Hong Yu… to put things more clearly… Crow is… actually Mu En’s daughter…”</p><br/><p>*Plop**Plop**Plop**Plop* Eyeballs fell and shattered onto the ground…</p><br/><p>…</p><br/><p>The second day, past noon. The time for the fight had come.</p><br/><p>The betting stations of the Peerless Battalion had been accepting bets all the way until this point, and by this time they had accumulated wagers of almost ten million gold coins. In the army, this was already quite a terrifying amount; after all soldiers or even officers were not that rich. If not for the fact that the entire Northwest Army, including all support and logistics personnel, numbered more than a million strong, it would be nearly impossible to see such a large sum of money in a bet. At the same time, this bet had already become such a grand matter that the entire Northwest Army was paying close attention to.</p><br/><p>The Seventh Legion’s Heavy Infantry Regiment had come out to the outskirts of the camp rather early. They did not bring their weapons, but were fully geared in their heavy armours. Even from a distance, their strong fighting spirit and killing intent could be sensed.</p><br/><p>After all, which army troop could take such insult and provocation without feeling anger? Clearly, the Heavy Infantry Regiment were not such!</p><br/><p>The pay of the Heavy Infantry soldiers were some of the highest amongst the entire army. This time, the entire Heavy Infantry Regiment, from soldier to the highest officer, all of them bet everything they had down to their underwear on this fight. At this point, their fighting spirit was burning at an unbelievable height. Perhaps even when fighting against the WanShou Empire, they did not even have such a powerful fighting spirit. They all stood there at the ready, their eyes bloodshot, as if they could already see the Peerless Battalion soldiers falling down at their feet.</p><br/><p>In stark contrast with them, only when the time came for the fight did the Peerless Battalion slowly exit their camp.</p>\n</div>"}