{"title": "Chapter 535", "id": 535, "volume": 6, "url": "http://boxnovel.org/heavenly-jewel-change-chapter-535", "volume_title": "Volume 6", "body": "<h1>Chapter 535</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>This was also not because he had such high regard for Zhou Weiqing, or placed so much importance on him. It was because he could not have his face thrown like that. He had set the rules, and under his watch, Gu Site had still dared to do such a thing. That was tantamount to slapping the face of the Heavenly Snow Mountain Lord. How could he possibly continue on with this competition?</p><br/><p>“Master.” With a loud thud, Gu Yingbing knelt down in front of Xue AoTian, his eyes reddening. “Master, please give me a chance. Since young, I have loved Tian’er for twenty years. I beg you, please give me a chance for this last fight. My father was wrong, and I am willing to apologise for it, apologise to both you and Zhou Weiqing. However, I cannot just let Tian’er go like this, I am not satisfied.”</p><br/><p>Gu Yingbing could be said to be raised and taught fully by Xue AoTian. Looking at the tears in his eyes, the ugly expression on Xue AoTian’s face eased up. However, since he had already spoken, he would not change it easily. With another cold humph, he waved his sleeve, motioning that they could leave.</p><br/><p>Gu Site did not expect that Xue AoTian would be so strict, even down to stripping him of his Lion King position. This was the power of the Heavenly Snow Mountain, and in the entire WanShou Empire, only the Heavenly Snow Mountain Lord could dominate and control everything.</p><br/><p>Although Gu Site was angry inside, he dared not say anything. He was clear that he had already severely angered Xue AoTian. If he continued protesting, even if Xue AoTian killed him or crippled him, the Heavenly Divine Earth Spirit Lion Tribe would not dare say a thing. Currently, his heart was only filled with sorrow and regret.</p><br/><p>Seeing that his Master would not change his mind, all of a sudden, Gu Yingbing turned to Zhou Weiqing. Gritting his teeth, he said: “Zhou Weiqing, my father’s mistake, I will bear it. However, I beg you, please give me a chance to contest you one last time.” As he said that, he suddenly lifted his right hand to grip his left shoulder. Before the surprised looks of all the others present, there was a ripping sound, and he forcefully tore his entire left arm off.</p><br/><p>“Yingbing!” Gu Site was shocked. Despite his injuries, he leaped forward to hold his son. Regret filled every nook and cranny of his mind. He had never imagined that a sudden rash decision of his would result in his son paying such a price.</p><br/><p>Seeing Gu Yingbing do something like that, even Long Shiya’s expression changed. Clearly, Gu Yingbing truly loved Tian’er, and it was not just a matter of the Heavenly Snow Mountain Lord position.</p><br/><p>Do not think that just because they had the Divine Attribute, they would be able to regrow his arm. That was an impossible feat. Even if they could re-attach his arm, the damage to his nerves and meridians could never be fully repaired. That was to say – Gu Yingbing’s actions had fully severed his future chance of ever reaching the Heavenly God Tier stage. No matter how hard he worked in the future, his future would only be the Heavenly Emperor stage.</p><br/><p>Gu Yingbing stood up slowly, but he did not reveal any signs of pain. His eyes staring into Zhou Weiqing’s eyes, he said solemnly: “You are able to come all the way up to the Heavenly Snow Mountain to fight for Tian’er, and I can see that you truly love Tian’er as well. However, I feel the same way. I do not wish to lose to you for some other reasons. Please give me a final chance to compete with you. If you win, and Tian’er is willing to go with you, then the betrothal between myself and Tian’er is nullified. However, if you lose, then I ask that you do not tangle with her any longer. Even if she does not love me now, I will use my own love and feelings to touch her heart.”</p><br/><p>Seeing Gu Yingbing’s stubborn gaze, Zhou Weiqing’s eyes sparked with respect. Nodding to him solemnly, he said: “Although you are my love rival, I have to admit that you are truly worthy of respect. I agree. Let us use this final round to determine the final victor. However, before the third round begins, fix your arm first. Otherwise, I will not feel happy with such a victory.”</p><br/><p>Xue AoTian looked at Gu Yingbing, then sighed softly. “Child, why torture yourself like this?” As he said that, he waved his hand, and the torn arm at the side flew into his grip. Carefully, he attached it back to Gu Yingbing’s shoulder, and in a brilliant flash of gold, he personally started healing his disciple.</p><br/><p>The Tiger King Xue Aoying watched from the side, nodding to himself inside. Compared to Gu Site, he approved of Gu Yingbing far more. No wonder Big Bro was willing to accept him as disciple and was willing to pass him the position of Heavenly Snow Mountain Lord in the future. Alas, it looks like everything has changed now. Who would imagine things would have turned out this way today?</p><br/><p>The healing did not take too long; with Xue AoTian’s powerful Heavenly God Tier energy, it did not take long for him to reattach Gu Yingbing’s arm. Of course, even he was not able to fully heal the arm, and it would be a long time before he could even use it normally. Gu Yingbing would have to spend time to nourish it with his own Heavenly Energy for it to resume some working in the future, but it would never be the same again.</p><br/><p>Xue AoTian looked at Gu Yingbing, then back at Zhou Weiqing, and he said solemnly: “No matter which of you becomes my son-in-law, I am very satisfied already. Alright, this last test will no longer be held by me. After all, you will be contesting to be Tian’er’s husband, so I will have her make the final choice.”</p><br/><p>Hearing those words, Gu Yingbing was extremely anxious. He knew how important Zhou Weiqing was to Tian’er, and if she was the one to make the choice, he would have no chance at all.</p><br/><p>Naturally, Xue AoTian could see Gu Yingbing’s face change. Solemnly, he said: “Yingbing, do not be so anxious. This time, I am having Tian’er make the choice under a particular circumstance. I have temporarily Sealed Tian’er’s memories, and she only has her own instincts. Under such a circumstance, each of you has five minutes to profess your love to her, to use your words to move her. In the end, whoever she chooses will be her husband. This time, there is nothing to do with your cultivation level or fighting capabilities, but whether or not Tian’er can accept you.”</p><br/><p>Hearing Xue AoTian’s words, Gu Yingbing finally calmed down. Both he and Zhou Weiqing exchanged glances, their eyes filled with fighting spirit. Neither of them would give up easily. Five minutes. They only had five minutes of time. Immediately, both of them lapsed into deep thought, thinking how they would use their words to move Tian’er.</p><br/><p>Xue AoTian gave the Tiger King a signal, hinting him to keep watch of Gu Site and not allow him to cause anymore trouble. He then turned around and left the cavern, clearly going to bring Tian’er here.</p><br/><p>The icy cavern turned silent once more. Long Shiya did not interrupt Zhou Weiqing. This final test was a fight between their charisma and attraction.</p><br/><p>Zhou Weiqing closed his eyes, standing there silently. In his mind, the images of all his interactions with Tian’er flashed by. There were sweet memories, warm memories, but also pain and suffering.</p><br/><p>Yet, all those were the memories between them! Zhou Weiqing was clear that if he truly wanted to move Tian’er, he could only depend on those memories. So what if they were Sealed away, that did not mean anything! Zhou Weiqing had confidence that he could Awaken her.</p><br/><p>It did not take long for Xue AoTian to return. When he came back, not only did he have Tian’er along with him, but also a beautiful, black clad middle aged woman.</p><br/><p>Black was considered a taboo colour in the Heavenly Snow Mountain. The reason why Long Shiya wore black was because he was using it as a provocation to Xue AoTian. For this middle aged beauty together with Xue AoTian to wear black, her status must be quite unique.</p><br/><p>As for Zhou Weiqing, he instantly recognized the middle aged lady to be Tian’er’s mother, the Entropic Nether Tiger, Phelia. Of course, this was her in human form now.</p><br/><p>He quickly took a step forward, bowing respectfully: “Hello, Aunty.”</p><br/><p>Phelia smiled faintly but did not say anything, remaining beside Xue AoTian, with her arms wrapped around Tian’er’s shoulders gently. No one else could imagine that this black clad beauty was actually a Heavenly God Tier powerhouse, no lesser than Xue AoTian or Long Shiya.</p><br/><p>Zhou Weiqing’s gaze flew from Phelia to Tian’er. Currently, she was dressed in her usual white gown, but her brilliant and moving purple eyes had lost all lustre. Zhou Weiqing had not seen Tian’er in such a long time, and seeing her so suddenly, he could not help but feel his eyes water.</p><br/><p>Tian’er had lost weight… indeed, it was all his fault! She had actually lost so much weight. Originally, she had been buxom and well curved, but now she looked so emaciated, her face pale like she had gone through a major illness. Even her perfect skin had lost its usual glow and radiance.</p><br/><p>Although they had not spoken, Zhou Weiqing could clearly sense that in this period of time, Tian’er had suffered so much. It was all because of him! Zhou Weiqing was filled with hate, hatred towards himself for not being able to protect Tian’er, that he had caused such a girl to suffer so much silently. In that moment, Zhou Weiqing set his resolve that he would not part with Tian’er here, even if he had to die here.</p><br/><p>Seeing Tian’er, Gu Yingbing’s expression was agitated. He knew that this was his last chance to hold on to his fiancee, to continue being together with Tian’er. It all depended on the next five minutes. In truth, he did not have much confidence in his heart, but he would never give up. Even if it was with his own lifeblood, he would fight for every last possible chance.</p><br/><p>Xue AoTian brought his daughter to the center of the cavern, turning to the two youths as he said: “In a moment, I will give each of you five minutes. As you each have your turn, the other will not be able to listen in. I will use my Heavenly Energy to block the other from listening. Since Yingbing is originally Tian’er’s fiance, he will go first. Zhou Weiqing, do you have any objections?”</p>\n</div>"}