{"title": "Chapter 555", "id": 555, "volume": 6, "url": "http://boxnovel.org/heavenly-jewel-change-chapter-555", "volume_title": "Volume 6", "body": "<h1>Chapter 555</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>The powerful Unicorn Heavenly Beasts were covered in custom crafted titanium mail, the joining links all treated specially. Titanium alloy was light but with extremely strong defensive capabilities, and thus it greatly improved the survivability of these powerful mounts without restricting their speed and agility. Furthermore, with the strength of these Unicorn Heavenly Beasts, it was no problem carrying these ordinary weighted soldiers with their own titanium mail gear.</p><br/><p>Of course, the rest of the equipment of the First Main Company was also top notch and fully complete. On each side of Unicorns, there were two quivers full of titanium alloy arrows. When Zhou Weiqing planned the outfitting of his Peerless Battalion, he had never cared about cost. After all, what was the point of hoarding money for nothing? Furthermore, with those Heavenly Cores that Long Shiya had given him, his funds could still last a long while more.</p><br/><p>Besides the four quivers which held two hundred of those titanium alloy arrows, each of them also had six javelins on their back. These javelins were about three chi long each, and were crafted specifically for throwing. Besides that, each of them had a long bow, and hanging on their mount’s bridle was a four metre long lance. One could describe them to be armed to the teeth. Besides their insane long range combat prowess which they were now renowned for, even their close combat abilities were not to be underestimated. With so many Physical Jewel Masters, that was an extremely terrifying force to be reckoned with.</p><br/><p>Of course, while these First Main Company soldiers were finely equipped, but if they were to compare to the two Tribes’ Heavy Cavalry, their equipment would suddenly seem extremely light.</p><br/><p>The heavy cavalry of the two tribes numbered two hundred in total, and their equipment was almost totally the same, with their weapons being the only difference.</p><br/><p>Their Unicorn Heavenly Beasts were also protected by similar titanium mail of the First Main Company, but seemed slightly thicker and heavier. As for the Gold Crow and Berserker Tribe members, their armour was not crafted from titanium. More accurately, it was not fully crafted from titanium.</p><br/><p>In their heavy armour, both Tribe Warriors looked like a moving fortress of steel. A simple black exterior, but if one examined closely, the thickness of the armour was a shocking half chi. Only the physique of these Gold Crow and Berserker Tribe soldiers allowed them to actually fight in such an insanely heavy armour. If it were any ordinary humans, even Jewel Masters, perhaps they would not even be able to move.</p><br/><p>That armour was actually crafted out of a mix of top quality Frozen Steel, Titanium alloy and other precious metals that were extremely tough and durable. The cost of construction was enough to take one’s breath away. At the same time, the defensive powers had been tested and proven; even for a six-Jeweled Heavenly Jewel Master, without any extremely overpowered Skills they would not even be able to break through the armour.</p><br/><p>For the two powerful Tribes and their warriors, Zhou Weiqing had spent a staggering amount of money, and this armour had been the original brainchild of both him and Lin TianAo.</p><br/><p>When the two Tribe Leaders had received the first piece of such an armour, they fully committed themselves and their Tribes to Zhou Weiqing. In their eyes, Zhou Weiqing was truly a leader worth following, totally thinking about their safety! Wearing such an armour on the battlefield, even if they just stood there not moving, it would be tough to sustain much injuries!</p><br/><p>Furthermore, no matter the Gold Crow or Berserker Tribes, they had their own considerable defenses even naked, and the addition of this armour could only be like a tiger growing wings 1. Of course, that was with two caveats. Firstly, their own sheer physical strength which allowed them to actually fight in such an outfit. Secondly, the Unicorn Heavenly Beast mounts; without these powerful mounts who could carry their weight and these terrifying armours, any other mount would just collapse under that! In any case, it was safe to say that both tribes were delighted with this current state of their outfitting.</p><br/><p>Originally, the height and stature of the Tribesmen from both Tribes were already massive, and upon wearing such an armour, they looked even taller and bulkier. This was especially so for the Berserker Tribe warriors, as their armour actually had some space for them for entering their Berserk state. Once they entered the Berserk state, they were truly moving killing machines.</p><br/><p>In terms of weaponry, both Tribes did not bother with any shields. In the first place, not many could even get through their armour, what need was there for a shield? That would just be a useless burden.</p><br/><p>As such, they only focused on weapons. In terms of weapons, both tribes finally differed. For each of the Berserker Tribe warriors, they held a large spiked mace in each hand. The large spiked maces were two metres long each, with a thick end that was already thicker than a grown man’s thigh. The short deadly spikes around the end weren’t too long, but thick and sharp. Each spiked mae weighed almost two hundred jin!</p><br/><p>As for the Gold Crow Tribe, they used their traditional war axes, all uniform in creation with the Legendary Gold Crow Axes that Crow used as a blueprint. Furthermore, they were fully crafted with Frozen Steel… definitely no skimping in terms of crafting and material.</p><br/><p>These two powerful units, even if they stood there unmoving, it was already a sight that would strike fear in any enemies’ hearts.</p><br/><p>Of course, it would be a long process and difficult task to fully gear all the warriors of these two Tribes. After all, no matter how much money one spent, the fact remained that it would still take a long time just to craft a single piece of armour. Furthermore, there was a lack of raw materials or blacksmiths who were skilled enough to work these. It was only with the help of the entire Northern Army that would possibly give them the chance of completing it in half a year.</p><br/><p>Looking at the seven hundred soldiers in front of him, Zhou Weiqing couldn’t help but grin maniacally. With such a powerful army… it was even more beastly than any Beastman army!</p><br/><p>For the Gold Crow and Berserker Tribe warriors, when they were mounted, they were Heavy Cavalry Troops. Dismounted, they were Heavy Infantry Troops! Besides the Mammoth Warriors of the WanShou Empire, Zhou Weiqing had never seen any stronger than them. With the gear outfitted, their weight surpassed a thousand jin in total, even those Tyrannical Bear warriors of the WanShou Empire could barely match them in comparison.</p><br/><p>Zhou Weiqing was currently dressed in a titanium mail armour of his own, and after a moment of contemplation, he finally laughed heartily and said: “Move out!” Ever since he had moved to the northern borders, he had not seen Princess Difuya. One reason was of course he had been extremely busy, but the other main reason was that she had never held any place in his heart. The reason he left her in the TianBei City was, at least on the surface, for her own safety. In truth, it was also because Zhou Weiqing did not want her trying to interfere and attempting to order him around.</p><br/><p>…</p><br/><p>Very quickly, they had reached the TianBei City.</p><br/><p>As expected, with such a large troop of soldiers marching towards the TianBei City, it immediately raised many alarms.</p><br/><p>The City Gates were immediately shut, and a Battalion of soldiers were sent out to scout who they were and to stop them if necessary.</p><br/><p>Luckily, the Northwest Army had made preparations for this. They had sent along a company of soldiers to escort Zhou Weiqing’s party, and they moved forward with the necessary documents to clear the way. Furthermore, Zhou Weiqing and the others did not need to all enter the TianBei City together.</p><br/><p>In the end, Zhou Weiqing and Lin TianAo decided to enter the TianBei City alone, escorted by some of the Battalion soldiers.</p><br/><p>For Zhou Weiqing to personally receive Princess Difuya, it was already giving her a lot of face.</p><br/><p>…</p><br/><p>On the top of the city walls, the city guards and soldiers above could see the Peerless Battalion warriors in the distance, and looks of shocks appeared on all their faces.</p><br/><p>“Are these our ZhongTian army soldiers? Why don’t they have any flags? Who are they?”</p><br/><p>“Stupid, don’t you know anything? That is the Peerless Battalion. Haven’t you heard of their legend!”</p><br/><p>“Ahh? So they are the Peerless Battalion! They look so valiant indeed! No wonder they can even defeat the WanShou Empire armies. Hey, are those calvary soldiers in front actually human? They look so unbelievably tall… even those Tyrannical Bear warriors of the WanShou Empire are just about that height right?”</p><br/><p>“Shhhh, be quiet. Don’t get us into trouble. The matters of the Peerless Battalion is considered a top level secret in our Northern Armies, we better not discuss too much about them. Sigh… I’ve heard that their treatment is truly the best, each of the soldiers have at least ten thousand gold….”</p><br/><p>…</p><br/><p>Naturally, Zhou Weiqing did not know that the ‘Legend’ of the Peerless Battalion had already started spreading through the ZhongTian Empire. Currently, he and Lin TianAo were heading towards the temporary quarters that the Peerless Battalion had purchased in the TianBei City.</p><br/><p>It was not far from the entrance of the city, and before long the duo had arrived.</p><br/><p>The door to the courtyard was open, and as soon as they entered, both Lin TianAo and Zhou Weiqing spotted Xiao Yan.</p><br/><p>Currently, Xiao Yan was chatting with a young lady beside him, smiling as he did so. Wasn’t that lady… Princess Difuya?</p><br/><p>The current Difuya did not look any different from previously. Her age was about the same as Zhou Weiqing, and she was definitely in the prime of her beauty. Of course, her dressing was much different now; the finery in the past replaced by simple cotton clothing. However, her head of bright fiery red hair was just too striking, and cotton clothing could not hide her beauty, instead giving her a more gentle, noble air than before.</p><br/><p>Abruptly seeing Zhou Weiqing and Lin TianAo appear in their military attire, Xiao Yan started momentarily. The next instant, Zhou Weiqing saw a flash of embarrassment on his face, while Princess Difuya’s face turned pale beside him.</p><br/><p>Ever since Zhou Weiqing had started building up the Peerless Battalion, he had been constantly running about doing things. Either his own affairs or the Peerless Battalion’s, and besides his own cultivation time, there was almost no chance for him to relax. Currently, seeing Xiao Yan, only then did he suddenly realise that it had been ages since he had seen this brother of his. At this moment, from the sudden changes in expression in both Xiao Yan and Difuya, Zhou Weiqing saw many things.</p><br/><p>“Weiqing, you are here.”</p><br/><p>Xiao Yan quickly came up to greet them, still slightly embarrassed and awkward.</p><br/><p>After a moment of surprise, Zhou Weiqing recovered as well. Laughing heartily, he said: “Xiao Yan, it has been a long time!” After a simple greeting, he strode towards Princess Difuya.</p>\n</div>"}