{"title": "Chapter 573", "id": 573, "volume": 6, "url": "http://boxnovel.org/heavenly-jewel-change-chapter-573", "volume_title": "Volume 6", "body": "<h1>Chapter 573</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>It was exactly because there were these small Empires blocking the way, added on to the fact that the Dan Dun Empire had launched its attack so suddenly and so swiftly, so much so that even though the ZhongTian Empire and the Bao Po Empire wanted to send aid, they were not in time.</p><br/><p>As for the Northwest of the Dan Dun Empire, it actually had a shared border with the Bai Da Empire. To everyone’s surprise, although the Dan Dun Empire had been fighting so violently with the Geritimo Empire, the Bai Da Empire did not react at all, remaining extremely silent, as if it had nothing to do with them.</p><br/><p>In the end, the war finally ended under the mediation of the ZhongTian Empire, with the Dan Dun Empire withdrawing some of its forces. However, the ZhongTian Empire was after all situated very far away, and they could not really influence this area of the continent too greatly. As such, although the war finally ended with the Dan Dun Empire stopping its advance and promising to return half the conquered territories, it had successfully kept the other half of the conquered territories as its own.</p><br/><p>In truth, actually getting the Dan Dun Empire to return the promised half was not an easy task as well. Although they had agreed to it verbally, it remained to be seen whether or not they would actually go through with it.</p><br/><p>This casual demonstration of the Dan Dun Empire’s capability in war also rang many alarm bells for the ZhongTian Empire. This strong Empire situated in the South which had always stayed out of any wars previously… it seemed like they would no longer be as quiet and restrained as they used to be. In this matter, what role did the Blood Red Hell of the Dan Dun Empire play, no one else could know for sure.</p><br/><p>However, it was without question that the Dan Dun Empire’s overall strength after this major war and invasion could only grow, far beyond the Fei Li and Bai Da Empire, and perhaps even slightly edging over the Bao Po Empire now. Although the Passion Valley was also extremely strong, in terms of overall combat powers, they were not as ferocious as the Blood Red Hell.</p><br/><p>The Dan Dun Empire’s greatest advantage was that situated far in the south, they had no other natural threat. With their backs facing the ocean, they also had one relatively protected border in that sense. Furthermore, access to the oceans provided another source of wealth if used properly. After all these years of peace, their calm and unhurried advancement allowed them to have perhaps nearly as much wealth as the ZhongTian Empire.</p><br/><p>…</p><br/><p>Heaven’s Expanse Palace.</p><br/><p>“What are the Dan Dun trying to do exactly?” Shangguan Tianyue’s brow was furrowed deeply as he stalked back and forth in the grandhall.</p><br/><p>Shangguan Tianyang remained seated in his main seat, his brow also furrowed as he remained deep in thought.</p><br/><p>“Big bro, what are we going to do? To the north, there is that old tiger in the WanShou Empire, and now in the south the Dan Dun Empire is also starting to cause trouble. Should we teach them a lesson?”</p><br/><p>Shangguan Tianyang looked at Shangguan Tianyue calmly before shaking his head, saying: “How are we going to teach them a less? Unless we make a show of force with the Heaven’s Expanse Palace, it will be extremely difficult to do so. All this while, we have neglected the Dan Dun Empire too much! This time, they have shown their fangs, and only now we have seen the true strength of the Dan Dun Empire. You and I know very well how strong the Geritimo Empire is, and to be able to successfully conquer such a vast territory in such a short time, what does that prove? It can only show the Dan Dun Empire’s power and combat abilities.”</p><br/><p>“All along, we have thought that the Dan Dun Empire and Geritimo Empire at the south should not pose much threat. After all, although they are able to advance and grow peacefully, it is also the lack of wars that does not allow them to have any chance to train their troops in actual battle. In terms of fighting capabilities, their soldiers should technically be far weaker than ours. However, it looks like we have greatly underestimated them, and that is truly a mistake. The combat prowess of the Dan Dun Empire is far above our original judgement. I believe that has to do with the support of the Blood Red Hell, only then can such events occur. These few years… the entire Mainland has truly not been peaceful at all! First, the destruction of the Heavenly Bow Empire, now the invasion of the Geritimo Empire. If this goes on, even if the WanShou Empire does not attack us, our Human Empires will be embroiled in chaos and internal fighting. At least, currently it seems like the Dan Dun Empire has grown to big to be effective… but even so, since most of our troops are focused on the north, and the Dan Dun Empire already has an army that numbers more than a million strong, it will be too difficult for us to move troops over to suppress them.”</p><br/><p>Shangguan Tianyue also sighed. “Indeed! It is truly too difficult for us to extend or move our forces. However, can we really just sit back and watch the Dan Dun Empire create havoc in the south?”</p><br/><p>Shangguan Tianyue furrowed his brow once more, saying: “If it is just the Dan Dun Empire, it isn’t a big deal. At the most, we both can personally move over to take some action. The worrying thing to me now is that it isn’t just the Dan Dun Empire causing trouble alone. Haven’t you seen something weird in the current situation? In this matter, the Bai Da Empire was just too quiet right? They are also direct neighbours to the Dan Dun Empire, and it should normally be impossible for them to not protest over such a serious incident. If… the Bai Da Empire and Dan Dun Empire have allied themselves in an effort… then … the south might truly be in trouble… Do not forget the ambitions the Bai Da Empire had shown previously with the Kalise Empire…”</p><br/><p>Hearing Shangguan Tianyang’s analysis, Shangguan Tianyue’s expression also changed.</p><br/><p>Far off in the south, if the Bai Da Empire and the Dan Dun Empire joined forces, they would literally be unbeatable in the region. If they were willing to do so, they could easily invade and crush the dozen or so smaller Empires around them, and the Geritimo Empire would not pose any threat to them. Once these two Empires continued expanding, they could possibly start posing a direct threat to the ZhongTian and Fei Li Empires. Yet, these two Empires would still need to face their main enemy, the WanShou Empire. Despite their strengths, facing such a situation where they were pincered between two groups of powerful enemies, that would truly be a dangerous situation.</p><br/><p>Shangguan Tianyang said solemnly: “Call Third Brother over as well. We need to prepare for the worst. It looks like we will have to increase our support for that little fellow Zhou Weiqing. He can be a sharp nail for us, striking savagely into the south.”</p><br/><p>…</p><br/><p>Fei Li Empire. South Border. The zone where the original Heavenly Bow Empire was about to begin.</p><br/><p>From the Fei Li Empire borders, in the southwest direction slightly more than a hundred li away, there was a small city, almost a town. This small city originally belonged to the Heavenly Bow Empire, and its name was the Crescent City1. The city was not large at all, but its position was extremely good, with its back towards the Fei Li Empire, rolling hills and mountains to its right, and to its left was the largest river in the Heavenly Bow Empire which flowed through the entire Empire. As such, it was very well connected in terms of traffic, and was considered one of the more prosperous cities in the entire north of the Heavenly Bow Empire. The population of the city was about two hundred thousand families, numbering slightly more than a million citizens in total. Although their city area was not large, the population density was one of the highest in the entire Heavenly Bow Empire, behind only the capital city Heavenly Bow City, and another important city to the far west of the Heavenly Bow Empire.</p><br/><p>Twenty Li from the Crescent City, in the depths of a forested region.</p><br/><p>Zhou Weiqing led his Peerless Regiment soldiers, silently hiding amongst the trees as they waited. There were advantages to having a small number. Since they only had seven hundred men, all of them cavalry soldiers as well, it had not been a difficult task to sneak past the borders via the Fei Li Empire and entering the (ex) Heavenly Bow Empire without being discovered.</p><br/><p>The Peerless Regiment soldiers were all resting on the spot. All of a sudden, a figure rode in from the distance, heading directly towards Zhou Weiqing.</p><br/><p>“Boss! Oh, uhm, Commander, I have returned.” The person was not tall, but looked shrewd and capable. He was dressed in commoner’s clothing, and he ran all the way to Zhou Weiqing before he finally stopped.</p><br/><p>“How was it? Kou Rui, what is the situation in the XianYue City?” Zhou Weiqing asked smilingly.</p><br/><p>The one who had arrived before Zhou Weiqing was his old classmates in the Fei Li Military Academy, Kou Rui. As the Heavenly Bow Empire diplomatic party arrived in the Fei Li City, Zhou Weiqing had prematurely ended the three-year promise he had with his classmates, bringing those willing along with him. His war to revive his Empire was about to begin, and all sorts of talents were of great importance to him.</p><br/><p>Kou Rui had always been adept at intelligence gathering, and he was a great scout. However, this was still the first time that he had actually been on an actual scouting mission that wasn’t a lesson, and he couldn’t help but feel extremely excited.</p><br/><p>“Commander, I have investigated the situation in the Crescent City in full detail. I’m not sure if it is because the Kalise Empire thinks that the Fei Li Empire would never attack them, or for some other reason, the defenses in the Crescent City are far weaker than we had even expected. The garrisoned troops in the city number only three Battalions, three thousand in total. Furthermore, they usually cycle their rounds for guards, and the normal number of soldiers guarding the gates and walls would be only a thousand men. They are all the Kalise Empire soldiers.”</p><br/><p>As he said that, Kou Rui squatted down, grabbing a small twig on the ground and drawing a simple diagram of the layout of the defenses and the normal positions of the enemy soldiers.</p><br/><p>“According to the information that I heard, the nearest camp or garrison to the Crescent City is at least a hundred li away, there is an entire Regiment of soldiers there. However, from the time for them to send news and return, the fastest possible time they can get here would be four hours. Possibly more.”</p><br/><p>Kou Rui displayed his talents as an outstanding scout, acquiting his duties with conscientious professionalism. Furthermore, he only provided the information that he had scouted out in detail, not mixing in any of his own opinions. That was not the job of a scout.”</p><br/><p>Zhou Weiqing thought for a moment, then said: “Alright, very good. Thank you. Since we have already fully verified the situation, then it is time for us to take action. Lei Zi.”</p><br/><p>“Here.” The First Main Company’s Company Leader Lei Zi appeared swiftly before Zhou Weiqing. The wild and intractable nature he had when he had first entered the Peerless Battalion had now vanished. It was not that he had taken too many blows, but because he truly loved the atmosphere and environment of the Peerless Regiment. Although the training was tough, their treatment was also top notch, so much so that he had never even heard of such a thing. Of course, the greatest attraction was still the Consolidating Equipment Scrolls and Stored Skills.</p><br/><p>More importantly, towards this young Commander of theirs, Zhou Weiqing, he truly felt a strong sense of respect and heartfelt admiration. Even a nine-Jeweled stage Heavenly Jewel Master, he was still able to take him down. Lei Zi knew he would not be able to do such a thing.</p><br/><p>In the entire Peerless Regiment, Lei Zi’s power was definitely one of the top ranked. Not long ago, he had just broken through to the seven-Jeweled stage, being a Low Level Zong Stage Heavenly Jewel Master.</p><br/><p>“Lei Zi, I want you to choose fifty of the strongest brothers with high cultivation level. Disguise yourselves to enter the Crescent City. When we launch our attack from outside, your mission is to lead these brothers to open the city gate.”</p><br/><p>“Understood!” Lei Zi was overjoyed. Such an auspicious 2 job, he was more than happy to do so. It was after all just a small city, and with the opponents likely being only three thousand ordinary soldiers, most likely without even any Jewel Masters… as a Low Level Zong Stage Heavenly Jewel Master, he was confident of completing this mission even alone, let alone with fifty of his strongest brothers.</p><br/><p>Zhou Weiqing glared at him and said: “Do not be too complacent. This is an extremely important fight, and we cannot afford to make any mistakes. Not only do I want you to open the gates, I want you to ensure that all fifty one of you are unharmed. Otherwise, you can wait to be punished by the military code. If your mission is completed well, once we occupy the city, any gold we gain from the three thousand soldiers, the bunch of you can get five percent.”</p><br/><p>Lei Zi grinned and said: “Heh heh, Boss, do not worry. We are all tough ones who treasure our lives so much, with these trash from the Kalise Empire, are they even capable of injuring us?”</p><br/><p>Lei Zi headed off to prepare, and Tian’er moved beside Zhou Weiqing with interest. “Little Fatty, how are you planning to invade this city later?”</p><br/><p>Zhou Weiqing smiled faintly, looking composed and confident as if he had an ace up his sleeve. “This commander naturally has my own brilliant schemes.”</p><br/><p>One hour later, when the Peerless Regiment warriors were starting to move out, Tian’er stared at Zhou Weiqing with her jaw agape as she listened to him give the order. “This is your so-called brilliant scheme?…”</p><br/><p>The order that Zhou Weiqing had given was unbelievably simple. Two words. “Charge!”3</p><br/><p>Zhou Weiqing grinned and said: “Silly girl, sometimes people over-complicate things… it is exactly when they start thinking too much that things become complicated.”</p>\n</div>"}