{"title": "Chapter 570", "id": 570, "volume": 6, "url": "http://boxnovel.org/heavenly-jewel-change-chapter-570", "volume_title": "Volume 6", "body": "<h1>Chapter 570</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>The door of the horse carriage opened momentarily, and Duan Tianlang appeared from within.</p><br/><p>Duan Tianlang was dressed in simple cloth clothes. Besides being clean, there was no other merits that anyone could see in those clothes.</p><br/><p>From the surface, he looked to be just an ordinary middle aged man. He did not display any power at all, as he walked slowly towards the center of the drilling ground. Zhou Weiqing quickly led the way respectfully. Towards this Senior Uncle of his, he truly had utmost respect within his heart.</p><br/><p>As Cai Cai saw the scene before her, her mouth opened slightly. She was perhaps even more surprised than when she saw the terrifying power of the Peerless Regiment. As a member of the Royal Family, she was extremely familiar and placed high value upon the etiquette of nobles. For Zhou Weiqing to actually invite a middle aged man from Princess Difuya’s carriage, what was going on?</p><br/><p>It had to be known, at least in title, Princess Difuya was still known as Zhou Weiqing’s fiancee, and the two of them were not married yet. For an outsider to be seated in the same carriage, especially a man, it was rather improper. According to proper noble etiquette, even if it were Princess Difuya’s father, the Heavenly Bow Empire’s Emperor, he would not sit in the same carriage as his daughter during travel!</p><br/><p>Led by Zhou Weiqing, Duan Tianlang soon arrived in front of Cai Cai. Towards this middle aged man that Zhou Weiqing had brought forward, Cai Cai was totally unfamiliar. However, she did not think that she would lose this round. In terms of aura and presence, this middle aged man seemed like a totally ordinary person, with not even a sense of Heavenly Energy reverberations without him. His age did not even seem as old as Master Han Gao beside her, how could his Consolidating Equipment Scroll creation skills possibly compare? After all, Master Han Gao was a renowned talent, to be able to reach the Zong Stage Consolidating Equipment Master at the young age of forty five. He was not just hired by the Royal Palace, but was actually Cai Cai’s personal Consolidating Equipment Master, one of Cai Cai’s most trusted talents. Previously, she had spent so much time and effort to be able to recruit such a master.</p><br/><p>“Ehhh?” Right at that moment, Duan Tianlang gave a surprised noise. It seemed like he had recognized this Han Gao in front of him.</p><br/><p>At that point, Han Gao’s head was still lowered, perhaps still pondering on some tough problems of a Consolidating Equipment Scroll. However, the surprised noise that Duan Tianlang made shocked him out of his reverie, and he subconsciously looked up.</p><br/><p>At the side, Cai Cai smiled faintly and said: “Master, do you also recognize Master Han Gao? Master Han Gao is renowned to be one of the most talented geniuses in the last fifty years of the Consolidating Equipment Master world, with the Spatial and Wind Attribute Elemental Jewels. He has already become a Zong Stage Consolidating Equipment Master at a young age of forty five.”</p><br/><p>Zhou Weiqing stood at the side, smirking coldly to himself. Cai Cai’s introduction was clearly targeted at him in a demonstration.</p><br/><p>Upon hearing Cai Cai’s introduction, Duan Tianlang nodded in satisfaction and said: “Very good, already reaching the Zong Stage! Ahhh, very good indeed.”</p><br/><p>As Cai Cai’s gaze was fixed upon Duan Tianlang, she had not realised that when Han Gao’s head lifted up to see Duan Tianlang, his jaw had dropped. The indifferent eyes which had been lost in thought were currently filled with shock and joy.</p><br/><p>“May I know Master’s name please?” Cai Cai asked Duan Tianlang courteously. No matter whose side they were on, a Consolidating Equipment Master was always deserving of respect. Although in the past the Heavenly Bow Empire did not even have a single Consolidating Equipment Master, not even a Low Level one, and though Cai Cai did not think that Zhou Weiqing could recruit any outstanding Consolidating Equipment Master, she could not be discourteous at all.</p><br/><p>Right at that moment, Han Gao abruptly knelt down on the ground with a sudden thudding sound. *Peng**Peng**Peng* He kowtowed to Duan Tianlang three times. “This unworthy disciple Han Gao greets Master. Master, I have missed you so much!”</p><br/><p>As he said that, Han Gao remained on his knees, clambering a few steps forward to hug Duan Tianlang’s leg. Tears were streaming from his eyes as he sobbed bitterly, looking as if he was deathly afraid that Duan Tianlang would run off without him.</p><br/><p>Cai Cai’s voice trailed off slowly as she watched the sight before her with her jaw agape. Let alone her being stunned into silence, even Zhou Weiqing was totally dazed and shocked.</p><br/><p>Duan Tianlang gently stroked Han Gao’s head as he smiled and said: “Chi’er, Chi’er1… It has been ten years, and you have already become a Zong Stage Consolidating Equipment Master. Come, stand up and we shall speak.”</p><br/><p>Han Gao continued holding Duan Tianlang’s leg tightly, refusing to let go or get up. Sobbing, he said: “Master, this time, you can’t abandon me please. If you do not agree, I will never get up.”</p><br/><p>Duan Tianlang’s eyes also reddened, and he sighed softly. With both hands, he supported Han Gao and pulled him to his feet. “I agree, I agree.”</p><br/><p>Hearing those words, Han Gao was overjoyed, and he used his hands to wipe the tears off his face. Alas, he had just been kowtowing on the ground, and his hands had been supporting him then and were covered with dirt, and his face was now covered in dirt. However, no one would laugh at him, as they could clearly sense the natural innocent joy of him reuniting with his Master, the sheer joy and respect he held.</p><br/><p>However, including Cai Cai, the entire Fei Li official contingent were all so shocked that their eyes were widened to the max.</p><br/><p>Towards Han Gao, not many of them actually recognized him. However, Princess Cai Cai had already introduced him as a Zong Stage Consolidating Equipment Master! To be a teacher and master of a Zong Stage Consolidating Equipment Master… what level was he at personally?! Could it be…”</p><br/><p>Duan Tianlang drew out a handkerchief, personally wiping his disciple’s face clean. As for Han Gao, he just stood there staring at his Master, tears still streaming down his cheeks as his mouth was trembling, the joy in his eyes unmistakable.</p><br/><p>Duan Tianlang was also extremely overjoyed. Turning to Zhou Weiqing at his side, he said: “Weiqing, let me introduce you. This is your Senior Brother Han Gao, your Senior Uncle’s First Disciple. He is also my finest disciple. Previously, I sensed that my time was up, and I just left quietly. This child, he is too emotional, so I did not want him to be too heartbroken.”</p><br/><p>Zhou Weiqing quickly walked up, smiling as he said: “Greetings, Senior Brother.”</p><br/><p>Han Gao looked at Zhou Weiqing, before turning back to Duan Tianlang. “Master, he is…?”</p><br/><p>Duan Tianlang smiled faintly and said: “Weiqing is also a member of our Legacy of Strength, an offshoot legacy holder. If not for him, your Master would have probably left the world more than a year ago.”</p><br/><p>Hearing Duan Tianlang’s words, Han Gao’s look at Zhou Weiqing instantly changed. Turning around, he actually knelt down once more, and was just about to kowtow to him as well.</p><br/><p>Zhou Weiqing was given a fright. How could he possibly accept such a kowtow. Quickly, he stepped forward to support Han Gao, preventing him from doing so. “Senior Brother, please do not do so. For Senior Uncle Duan to live well, it is both our wishes. I dare not claim credit.”</p><br/><p>Han Gao looked at him with gratitude and said: “Junior Brother, Master has never spoken a word of untruth or even exaggeration in his life. Since he has said that you were the one who saved him, then it must be true. However, you are right, such great kindness cannot be expressed through words alone.”</p><br/><p>As he finished speaking, Han Gao turned to Cai Cai and nodded to her, saying: “Your Highness, I have finally found my Master. Remember my words previously when I agreed to become your Consolidating Equipment Master? I would leave when I found my Master. Apologies Your Highness, it is time for me to take my leave.” After speaking his piece, he directly walked over to Duan Tianlang’s side, his face filled with joy and respect.</p><br/><p>Cai Cai stood there, her mouth open, but in the end she was just unable to speak. Currently, she was totally filled with regret. It was truly a case of losing one’s wife as well as one’s soldiers 2. Not only had she lost the final bet, she had also lost a Zong Stage Consolidating Equipment Master! What was going on!? However, Cai Cai was still Cai Cai in the end, and though she had suffered such a huge loss, she managed to calm down after a short time. Bowing towards Duan Tianlang, she said: “Greetings Master3 , it was this Junior who was too rude just now.”</p><br/><p>Duan Tianlang smiled faintly and waved his hand gently. Pulling Han Gao’s hand, they moved off to the side to catch up on old times, neither picking up the thread of discourse.</p><br/><p>Zhou Weiqing looked at Cai Cai in an amused fashion. “Your Highness, shouldn’t this mean our bet has been settled?”</p><br/><p>Cai Cai glared angrily at Zhou Weiqing. “Commander Zhou, that Master previously is…?”</p><br/><p>Zhou Weiqing did not attempt to hide anything. With a wide smile, he said: “Just as you think.”</p><br/><p>Cai Cai’s expression was serious and respectful as she said: “Since Master has been gracious enough to come visit our little Empire, no matter what, our Emperor will definitely come personally to welcome him. Commander Zhou, please bring your men to the Ambassadorial Guild Hall to rest first, I will be back with His Majesty in a while.”</p><br/><p>His goal had been met. Although Cai Cai had subtly avoided the topic about their bet, and ascribed the Fei Li Emperor’s welcoming to that of a God Tier Consolidating Equipment Master, Zhou Weiqing did not mind. His goal of showing the power of the Heavenly Bow Empire had been met, and that was sufficient.</p><br/><p>Zhou Weiqing’s personal strength, the hidden Heavenly Emperor behind his back, the support of the ZhongTian Empire, the terrifying strength of the Peerless Regiment… and finally a God Tier Consolidating Equipment Master to complete the package. Each of those accomplishments were considered impressive in their own right, but when they were all gathered together… this was truly something that the Fei Li Empire had to place great importance on. They would no longer dare to treat Zhou Weiqing and Princess Difuya like they were just from a mere dead empire.</p><br/><p>Furthermore, others might not have perceived the Divine Attribute that Tian’er had used. After all, it was so rare that a Saint Attribute was seen. However, how could that Heavenly King Stage powerhouse not see through it? It was an Attribute that was only found on those direct bloodlines of the Heavenly Snow Mountain! The Heaven’s Expanse Palace… Heavenly Snow Mountain… two Great Saint Lands that should be like oil and water which do not mix… they had actually subtly shown their support for this Zhou Weiqing. This sense of mystery was perhaps even more shocking than anything else.</p><br/><p>…</p><br/><p>The following negotiations and talks were much simpler from then on. With his shameless thick skin, his silver tongue, tactics of asking prices as high as heaven, and offering payment as low as the earth 4, with just seven days, he had managed to gain sufficient support from the Fei Li Empire.</p><br/><p>Princess Difuya had only showed her face once when the Fei Li Emperor had come personally to welcome then. Otherwise, everything else from that point onwards had been completed by Zhou Weiqing. Of course, on the Fei Li Empire side, the negotiating party was still Princess Cai Cai.</p><br/><p>…</p><br/><p>A room in the Royal Embassy.</p><br/><p>Zhou Weiqing stood at the window of his room, looking outside with an air of content and satisfaction about him. Currently, Shangguan Xue’er and Tian’er were both in the room as well.</p><br/><p>These few days, Zhou Weiqing could be said to have everything go smooth sailing, at least in terms of all the major events and goals. From the show of power, to the negotiations… Although he was still young, his intelligence, cunning and mostly his silver tongue had truly given a headache even to someone as shrewd as Princess Cai Cai. Alas, in terms of ‘internal family’ matters, our dear Zhou Little Fatty was in the midst of a tragic drama.</p><br/><p>Shangguan Xue’er had come up with a great plan of her own. You are cultivating and training with Tian’er right? Very well, I will also cultivate together with you two; while I’m at it, I can keep watch on a certain person!</p><br/><p>As a result, this strange scene of the three of them staying in a single room had occurred.</p><br/><p>In the eyes of the Peerless Regiment warriors, their Commander was just too awesome. Two top level beauties! Ahhh… it was truly enough to make one envious, jealous and hate!</p><br/><p>However, only Zhou Weiqing truly knew what kind of life he was currently living… the phrase ‘deep water and scorching fire5’ was sadly too apt here.</p><br/><p>Neither Tian’er or Shangguan Xue’er were the sort to have a sharp tongue, but living in the atmosphere where both of them constantly glared at each other with killing intent, added to the fact that he was highly tempted yet never dared to be overly intimate with either of the two… if not for the fact that Zhou Weiqing’s skin was sufficiently thick, he would have gone crazy by now.</p>\n</div>"}