{"title": "Chapter 580", "id": 580, "volume": 6, "url": "http://boxnovel.org/heavenly-jewel-change-chapter-580", "volume_title": "Volume 6", "body": "<h1>Chapter 580</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>The assassin gave a cold humph, his entire body tensing as white light burst forth, instantly increasing his Heavenly Dao Energy to the maximum. In terms of physical strength, he was naturally far from Zhou Weiqing, but as his Heavenly Energy exploded to the max, he could temporarily raise his strength to a terrifying level. At the same time, the Darkness Attribute energy in the atmosphere welled over to him and surging into the black rapier. In that short moment, the Assembly Set Sword’s power raised even futher.</p><br/><p>This was the power of the Heavenly Dao Energy, able to use the energies of the heavens as his own.</p><br/><p>As Zhou Weiqing pulled back, the assassin did not try to go against it, instead in that burst of power, he pierced forward instead. With the burst of terrifying power, the rapier actually broke free of Zhou Weiqing’s left claw, striking straight towards the heart in his left chest.</p><br/><p>That assassin’s offensive power was just so terrifying, but in that lightning speed strike, Zhou Weiqing’s body actually managed to twist slightly. However, the following scene actually caused the calm heart of the assassin to no longer maintain his tranquility.</p><br/><p>Although Zhou Weiqing managed to twist his body slightly, he was still unable to fully dodge the sword. A horrible scraping sound rang out as the rapier pierced right into his left chest. Although it was to the side and not directly at the heart area, in the assassin’s viewpoint, it was still more than enough to kill Zhou Weiqing. Without that strange physical immunity skill active, he was confident that once his blade pierced through Zhou Weiqing, its destructive power was more than enough to destroy his innards.</p><br/><p>However, would Zhou Weiqing really die to this sword? To the assassin’s shock, his eight Jeweled Assembly Set Sword actually struck on the scales of Zhou Weiqing’s chest, causing many sparks to fly, but he was actually unable to pierce right through, only leaving a deep white scar.</p><br/><p>The force of the impact caused Zhou Weiqing’s body to flip back and sent him flying, but that sword that should have slain him instantly had been unable to take his life!</p><br/><p>This… how could this be? Even if it were another Heavenly King stage powerhouse, if he managed to pierce that person with his eight-Jeweled Assembly Set Sword, he would definitely be severely injured! A little six-Jeweled Zun Stage fellow… he had.. He had actually taken the blow just like that with just barely a scar to show for it?!</p><br/><p>Despite his sheer shock, the assassin continued attacking, perhaps from instinct alone. In his mind, as long as his enemy did not die, he would not stop, only using an even greater explosive power on his target.</p><br/><p>The rapier whistled in the air as it pierced out once more. The Heavenly King stage Agility Physical Jewels burst out in full speed, and his figure could not even be seen in the skies at the speed he was moving. Another earsplitting explosive sound rang out as Zhou Weiqing barely managed to use his left palm to block the sword, but was still pierced by it. However, this time, he was better able to block and dodge the main blow, and the rapier was only able to pierce his shoulder.</p><br/><p>A stronger explosive power, forced into just a pinpoint blow, causing Zhou Weiqing to grunt in a muffled cry. Once again, he was blown backwards in the impact, but as the rapier pierced into his shoulder, it was barely half an inch, barely seeing the scales dent inwards. As the assassin tried to unleash his explosive Heavenly Energy into the wound, he was shocked to find that he was unable to even push his Heavenly Energy into Zhou Weiqing’s body.</p><br/><p>This was a total upheaval about everything he knew. The defensive power of Zhou Weiqing’s scale had reached a whole other level. Even if it still wasn’t able to fully block all of his attacks, but if he wanted to kill Zhou Weiqing, he was actually unable to do so in a short amount of time.</p><br/><p>The greatest surprise was that the small white notch which had been caused by the first blow was now healing rapidly.</p><br/><p>The Heavenly King Stage assassin refused to believe it, and his body flashed forward in another attack. However, just as he did so, he was met with a sudden burst of snow white light. An unbelievably powerful sword intent instantly encased his body, and with a clang, the white figure that had charged at him was knocked back, blood spurting out from its mouth. However, the terrifying sword intent from that white sword also caused the black clad assassin’s body to halt, as the white figure fell back down to the ground.</p><br/><p>At last, Shangguan Xue’er had arrived. Previously, in that instant, she thought that Zhou Weiqing had been killed, but he had somehow entered the second stage of the Dragon Tiger Transformation and held on past the last few attempts of the Heavenly King Stage assassin.</p><br/><p>Tian’er also came right on her heels, but both of them did not have the capability of flight. Even more worrying, Zhou Weiqing in midair did not seize the chance of being knocked back to fly down to them, instead charging towards the Heavenly King assassin once more.</p><br/><p>*ROOOAAARRR* High up in the sky, the entire air shook and vibrated as an angry howl that shook the world burst forth from Zhou Weiqing’s mouth. Currently, that roar gave the impression that ten thousand tigers were snarling angrily, the terrifying sound waves causing the Heavenly King Stage assassin to actually be stunned in midair for a split second.</p><br/><p>The rapier pierced forward yet again, and the Heavenly King assassin’s entire body was encased with a layer of black, his Heavenly Energy circulating throughout his body and pushed outwards, an explosive surge of Heavenly Energy causing the entire black rapier to be filled with a destructive aura. This time, the target was Zhou Weiqing’s throat.</p><br/><p>Both tiger paw and dragon claw crossed in midair. This time, Zhou Weiqing did not attempt to dodge. Instead, with a loud clang, the sword actually pierced onto his throat, causing the scales there to cave in. Zhou Weiqing ignored it totally, instead his hands had already smashed down together, grabbing onto the sword.</p><br/><p>The rapier with all the power of the Heavenly King assassin gathered in his greatest blow, all of his strength, yet it was still unable to pierce through Zhou Weiqing’s throat. At the same time, his black rapier had been fully locked onto by his dragon claw and tiger paw.</p><br/><p>Instantly, the Heavenly King assassin shook his arm, trying to use his power to destroy Zhou Weiqing’s dragon claw and tiger paw.</p><br/><p>To his surprise, he was unable to do so. Not only were they unbelievably tough, they were like steel traps, fully locking onto his black rapier. A massive strength traveled through it once more, pulling his entire body along.</p><br/><p>Such disgusting strength! That was equal to any Heavenly King Stage powerhouse with the Strength Attribute right?</p><br/><p>Just as the Heavenly King STage was lost in shock, from below another terrifying sword intent rose once more. Shangguan Xue’er’s body vanished, and all that remained was that huge Boundless Infinitum Sword.</p><br/><p>At its side, a giant white tiger also sprang up. She was unable to fly, but with that leap, she was able to charge towards where Zhou Weiqing and the assassin were. In midair, Tian’er’s purple eyes suddenly glowed as two bouts of purple light shot out. At the same time, a resplendent golden light rushed out from her body, forming a golden tiger of energy, speeding towards the Heavenly King assassin.</p><br/><p>In that instant, both Tian’er and Shangguan Xue’er had burst forth with their strongest attacks, as if pitting their entire lives in a single blow. In their hearts, they only had one notion. Little Fatty, you must hold on! If not for the sudden attacks from the two ladies, perhaps the assassin could have continued with his blow, and using all his might he might have finally pierced through Zhou Weiqing’s throat eventually. After all, even though Zhou Weiqing’s body was at another level from the second stage of the Dragon-Tiger Transformation, he was still after all still a six-Jeweled Heavenly Jewel Master. There was quite a large element of luck for him to even enter this second stage; under normal circumstances he should have only been able to do so after reaching the ninth-Jeweled cultivation level.</p><br/><p>No matter how confident this Heavenly King assassin was in himself, he did not dare to allow the two attacks from Shangguan Xue’er and Tian’er to land on his body. His greatest strength was his offense, not his defense. Left with no choice, he had to draw back his eight-Jeweled Assembly Set Sword, and the black rapier vanished from between Zhou Weiqing’s claws. At the same time, his body spun around in midair, and the rapier appeared once more in his hands, and in a swing, a black arc of light struck out.</p><br/><p>This was truly a display of power for a Heavenly King powerhouse. If it had been Lin TianAo, with a similar Assembly Set Equipment, once he dismissed his Assembly Set Shield, within a short period of time he would not be able to summon it out and reassembly it so quickly. However, for this assassin, it looked as if it disappeared, and in the next instant reappearing, as if it had been an illusion.</p><br/><p>The black arc of light was so wide that it could reach all three of the youths.</p><br/><p>Shangguan Xue’er’s terrifying Body and Sword as One first struck the black light, causing a massive explosion as she was thrown back down on the ground. Next, Tian’er’s gold light struck, and the gold tiger was also shattered by the black light.</p><br/><p>If it were any ordinary Heavenly King stage powerhouse, Shangguan Xue’er and Tian’er’s attacks would definitely not be dissipated so easily. However, this Heavenly King assassin was truly a master at the peak of his powers, fully focused only on offense, offense and offense. His offense was truly at the level that he could destroy his enemies’ attacks as well. A powerhouse who actually used all his eight Jewels in an offensive Assembly Set, that offensive power was just too disgusting. In terms of pure offensive power alone, it far surpassed the Boundless Infinitum Sword… and both girls’ attacks were dissipated just like that.</p><br/><p>Even so, the assassin was not able to fully withstand their attacks. After all, he had been forced to disassemble and reassemble his sword so swiftly, and that instant of time had barely been enough. As such, the Spirit Attribute attack that Tian’er had shot out from her eyes still landed upon him, causing him to freeze in midair for a split second, slowing his movement.</p><br/><p>Right at that instant, Zhou Weiqing’s attack reached. This time, it was his right leg, the enormous black scorpion tail that it had warped into.</p><br/><p>Still, the Heavenly King assassin was just too power. Even under that massive onslaught and disadvantageous position, he was still barely able to move his sword in the last second, somehow able to use the last dredges of the black arc of light to block his right leg.</p>\n</div>"}