{"title": "Chapter 591", "id": 591, "volume": 6, "url": "http://boxnovel.org/heavenly-jewel-change-chapter-591", "volume_title": "Volume 6", "body": "<h1>Chapter 591</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>It was the image of a youth, the giant but slim black figure giving forth a faint purple glow… bloodshot eyes filled with endless ruthless killing intent, a cruel aura about it. The features were handsome, but pale, and the sheer power of the aura the figure released was enough to cause even the heavens to change colours1.</p><br/><p>In the skies, no one knew when a large patch of dark clouds had suddenly gathered, forming a strange black whirlpool shape right above the black, six-winged youth.</p><br/><p>Currently, Zhou Weiqing had his eyes closed. His entire body was shaking gently, even down to his hands and the Overlord Bow. His entire aura was raised to the max, and a terrifying energy reverberation could be felt all around. Let alone the enemies, even his own companions were trembling from the sheer presence.</p><br/><p>Shangguan Xue’er’s eyes were filled with shock. “This… this is an actual manifestation of a Heavenly Skill Image… right?” Although she knew, or perhaps had guessed, how Zhou Weiqing had actually accomplished it, even so her heart was still filled with disbelief. The sheer energy reverberations were just too powerful, and it looked like even if a Heavenly King stage powerhouse used the same Skill, it might not have the same formidable power as Zhou Weiqing’s.</p><br/><p>Tian’er was the only one not afraid of the huge black figure in the air with the terrifying aura. At this moment, she was standing right behind Zhou Weiqing, both her hands on his shoulders. All around her palms, gold and purple, two lights glowing as the different energy surged into Zhou Weiqing’s body from her.</p><br/><p>In truth, no one else knew but the actual initiator of the Skill, Zhou Weiqing, was also filled with shock at that point. He had never expected that this would happen.</p><br/><p>Without question, the Skill that he was trying to unleash was the Hell’s Angel, and he had planned to use the Six Ultimate Godly Light Formation’s powerful but fine control and the powerful Heavenly Energy absorption, infusing the Hell’s Angel Skill into the Overlord Bow to unleash the powerful AOE Skill into the mass of enemies.</p><br/><p>In order to bring the Skill to its greatest effect, the silvery white mist that had rose above his head was the Saint Energy which Zhou Weiqing had infused upwards into the Skill.</p><br/><p>Zhou Weiqing had experimented with the Saint Energy many times, and he had long discovered that when using his Skills, as long as he infused a single drop of Saint Energy, the power of the Skill would explosively increase several times over. Originally, Zhou Weiqing’s plan was to infuse a few drops of Saint Energy to further strengthen this Hell’s Angel Skill.</p><br/><p>However, he had never imagined that for this powerful Skill with the Heavenly Skill Image, even after he had already infused three drops of Saint Energy into it, the Heavenly Skill Image of the Hell’s Angel in the sky seemed like a bottomless pit, beginning to drain the Saint Energy directly from his body.</p><br/><p>Tian’er and Zhou Weiqing pretty much trained everyday together with the Saint Energy whirlpool, and the connection between them was extremely strong, almost like they could sense each others’ emotions or thoughts. Instantly, she realised something was wrong with Zhou Weiqing, and came to his side to assist him, quickly forming the large Saint Energy whirlpool. Only then did the Hell’s Angel begin to stabilize, just before the Zhou Weiqing’s smaller internal Saint Energy Whirlpool was drained dry.</p><br/><p>In a matter of moments, a grand total of over thirty drops of Saint Energy had been devoured from Zhou Weiqing and Tian’er’s bodies. Besides their own personal internal Saint Energy whirlpools, there was nothing left.</p><br/><p>By now, Zhou Weiqing realised that empowering Skills with the Heavenly Skill Image was vastly different from his ordinary Skills, and it was definitely not a wise idea for them to do so in their current state. However, it was too late at this point, he could no longer apply the brakes to it, and all they could do was to grit their teeth and hold on for the ride.</p><br/><p>Right at that moment, the massive black figure above Zhou Weiqing’s head began to move. In a flash, he appeared right in front of Zhou Weiqing.</p><br/><p>Bloodshot eyes stared right at Zhou Weiqing, an aura of extreme cold caused the entire group of people on the Crescent City south wall to shudder uncontrollably.</p><br/><p>“My Lord, thank you for granting me life with your purest energy. I can serve you for three seconds.”</p><br/><p>A thick, deep voice rang out in the depths of Zhou Weiqing’s soul, and it seemed like he was the only one who could hear it. The massive black youth had a face glinting with an evil light, and within the blood red orbs, he could sense an endless killing intent and frenzied presence.</p><br/><p>It’s alive… alive?! 2 Towards what was happening right before their eyes, no one could refrain from being shocked. Especially so for Zhou Weiqing himself… only he truly understood that he had actually given a Skill its own consciousness! This… this was something that the Saint Energy had done! However, what could this Hell’s Angel that was brought to live actually do? Zhou Weiqing did not know, but he felt a burning fire raging in his heart. He knew he had found another of the Saint Energy’s deepest profound secrets.</p><br/><p>“My Lord, although your energy is pure, it is just too minimal. If you do not give an order, I will vanish soon.” The Hell’s Angel’s voice rang out once more, snapping Zhou Weiqing out of his reverie.</p><br/><p>“Destroy. Please do all you can to destroy my enemies outside the city walls.” Zhou Weiqing did not hesitate any longer, quickly giving his order to the live Hell’s Angel.</p><br/><p>“As you wish.” The Hell’s Angel moved, his actions smooth and so natural, that unbelievably handsome face was filled with an icy cold killing intent.</p><br/><p>In a flash, he disappeared into the clouds above. The next instant, a shocking sight occurred.</p><br/><p>The dark clouds that were swirling about them in a whirlpool fashion actually started moving crazily. In a blink of an eye, the dark clouds formed another, even larger, illusory figure of the Hell’s Angel.</p><br/><p>The dark clouds were also changing colours, a dark purple light rising to encompass everything.</p><br/><p>Six giant wings spread out in the air… an oppressive pressure descended from the skies.</p><br/><p>The wings behind the giant Hell’s Angel abruptly moved, and within moments a huge circle of light spread out in the skies, glowing a deep purple.</p><br/><p>From the giant ring of purple light, hundreds of large balls of purplish black air bubbles dropped down, each almost ten metres in diameter.</p><br/><p>The generation of the air bubbles lasted only three seconds, and the illusory Hell’s Angel in the sky disappeared, warping back into the patch of dark clouds. However, in those three seconds alone, more than a hundred of the purplish black air bubbles had descended from the skies right onto the three Kalise Empire Regiments.</p><br/><p>Zhou Weiqing’s body crumpled to the ground, and at his back, Tian’er also slid down together with him. Right at the same instant, a pitch black flash of light struck out like cold lightning from the side… it was one of the fresh recruits! The light struck out directly towards Zhou Weiqing’s throat.</p><br/><p>In truth, the black lightning had arrived a little late, and it wasn’t the absolute perfect moment. That was because Shangguan Xue’er had already blocked at Zhou Weiqing’s side. Perhaps the reason for that was even the attacker had been just too shocked by the scene beforehand.</p><br/><p>When Zhou Weiqing had released his Skill, after a tiny moment of shock, Lin TianAo had already made full preparations to react to any trouble, his mind and spirit fully focused and alert. When the abrupt black light appeared, he was the first to react. The seven-Jeweled Assembly Set Shield ready in his hands moved forward in a flash, and his entire body and shield blocked right in front of Zhou Weiqing.</p><br/><p>Still, the black rapier’s offense was just as terrifying as always. In a massive explosion, Lin TianAo’s seven-Jeweled Assembly Set Shield was destroyed in just a single strike despite its powerful defensive capabilities. At the same time, Lin TianAo was sent flying into the sky.</p><br/><p>However, in the end Lin TianAo had still succeeded in blocking the blow, if only just barely. He had just been at a too severe a disadvantage, not just in terms of the gap in cultivation level, but also the fact that his Assembly Set Shield was one piece lesser than his enemy’s Assembly Set Sword.</p><br/><p>Still, Lin TianAo had earned a precious second, and Shangguan Xue’er’s Boundless Infinitum Sword also struck out at that moment. The snow white sword, glowing with a crystalline light, piercing straight at the owner of the black rapier.</p><br/><p>Without question, the Heavenly King assassin had come again, seizing the opportunity of the moment of Zhou Weiqing’s weakness when he had finished releasing his powerful Skill.</p><br/><p>“Eh…?” A surprised sound emitted from the Heavenly King assassin’s mouth. He originally wanted to continue attacking Zhou Weiqing. However, strangely enough, Shangguan Xue’er’s attack suddenly gave him a strong sense of danger.</p><br/><p>Having been an assassin for so many years, living on the edge, his personal senses were far more developed than anyone. It was also these senses that had saved him from many potential disasters over the years. At this point, he could clearly sense that if he continued attacking Zhou Weiqing and ignored Shangguan Xue’er, he would not be able to dodge it… and it would mean his death!</p><br/><p>How is that possible?!</p><br/><p>Despite his disbelief, this Heavenly King assassin was too used to trusting his own senses. Swiping the black rapier in his hand, he struck out horizontally towards Shangguan Xue’er’s Boundless Infinitum Sword.</p><br/><p>Another earsplitting explosion rang out. Shangguan Xue’er’s cultivation level was just too low compared to her opponent, and despite her sword mastery, with the assassin’s sheer offensive power and cultivation level gap, both her and her sword were also sent flying back.</p><br/><p>However, the Heavenly King assassin was unable to continue attacking Zhou Weiqing. That was because the black rapier in his hands had abruptly turned a silver white colour.</p><br/><p>The Heavenly King assassin’s body suddenly began to shake violently, pausing in mid-movement. He was shocked to realise that a strange energy he had never sensed before had wormed into his palm through his rapier, an energy that he didn’t even know… an unknown attribute even. The energy was warm, filled with life, but when his Darkness Attribute Heavenly Energy made contact with it, the darkness energy dissipated. This new energy did not hurt his body at all, but with a posture like a sovereign over his subjects, it was beginning to devour all the Heavenly Energy within his body at an alarming rate.</p><br/><p>What was going on? For the Heavenly King assassin, it could be said that the majority of his power was in the rapier in his hands. It was after all an eight-Jeweled Assembly Set Sword, just a step away from being a Legendary Set. Furthermore, the offensive strength of such a assembly weapon was far above any ordinary Consolidated Equipment, chasing the ultimate. Yet, he had currently lost contact with his own sword. Furthermore, though the strange energy that entered his body was swallowing his Heavenly Energy, it would not be able to finish doing so any time soon… but the problem was he could not find any way to deal with it. Added to the fact that he had lost contact with his precious rapier… he couldn’t even recall it back!</p>\n</div>"}