{"title": "Chapter 604", "id": 604, "volume": 7, "url": "http://boxnovel.org/heavenly-jewel-change-chapter-604", "volume_title": "Volume 7", "body": "<h1>Chapter 604</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>Shangguan Xue’er was equally exhausted, but she looked much better than Tian’er. Currently, her eyes were filled with deep respect. “Tian’er is just too strong. After you fell asleep on the city walls, she returned here and began healing the wounded soldiers. At least thirty critically wounded on the verge of death were dragged back by her. Everyone is now calling her Goddess of Life.”</p><br/><p>Looking at Tian’er fainted in his arms, Zhou Weiqing felt a twinge of pain in his heart, but also filled with love. To Shangguan Xue’er he said: “Hurry, call a doctor here.” As he said that, he quickly carried Tian’er back to his room.</p><br/><p>He could sense that Tian’er was currently extremely weak and exhausted, almost frail to the point that she couldn’t even accept external energy. As such, he dared not even infuse his own Heavenly Energy within her to aid her.</p><br/><p>In a matter of moments, Shangguan Xue’er had led a doctor into the room.</p><br/><p>“Commander.” The doctor was about to salute to Zhou Weiqing, who quickly stopped him and dragged him to the bedside. “Quick, have a look at her. Do you have any medicine to help relieve her current exhausted and frail status?” As long as Tian’er was able to recover a little, Zhou Weiqing would be able to use his Heavenly Energy to help her.</p><br/><p>The doctor saw that Zhou Weiqing was in such an agitated state that his eyes were red, and he dared not say anything else, quickly bending over Tian’er to check on her.</p><br/><p>It took more than fifteen minutes before the doctor completed his examination, and Zhou Weiqing asked urgently: “How is it? Is it serious?”</p><br/><p>The doctor quickly replied: “Commander, please do not worry, Lady Tian’er is not in serious condition, just that she is too exhausted both physically and in terms of Heavenly Energy. It is not suitable for her to use any medicines now, just let her have a good rest. When she wakes up, let her have some simple foods that can be easily digested. Her physical condition is good, so a few days of rest should bring her back up to top condition.”</p><br/><p>Hearing his words, Zhou Weiqing heaved a sigh of relief, saying: “That’s good, that’s good. Indeed! Tian’er is of the Divine Heavenly Spirit Tiger bloodline, how could she be in trouble? I was just too worried…”</p><br/><p>“But… but…” The doctor clearly hesitated for a moment, looking at Zhou Weiqing, then at Tian’er, as if swallowing back the words he was about to speak.</p><br/><p>At the side, Shangguan Xue’er said: “But what? Is Tian’er all right? Is there anything wrong?”</p><br/><p>Reluctantly, the doctor looked at Zhou Weiqing once more before saying: “I am also not too sure, but from Lady Tian’er’s pulse and meridians, it seems like she is expecting. However, though the signal from the meridians seems to have a strong life force, but it isn’t obvious. I am not very sure at all.”</p><br/><p>“What?! Expec…Expecting?!” Zhou Weiqing was so shocked that he couldn’t even speak clearly. Indeed, the doctor’s words were truly stunning, leaving him standing there stupidly, his body trembling as his entire mind went blank.</p><br/><p>It was not just him, even Shangguan Xue’er at the side was so stunned that she couldn’t speak. This little brat was just too ‘powerful’, expecting…? Pregnant?!</p><br/><p>It took a few moments for Zhou Weiqing to regain his senses, and abruptly he grabbed hold of the doctor. “You… did you see correctly?”</p><br/><p>The doctor was given a terrible fright, but seeing Zhou Weiqing’s anxious and urgent eyes, he quickly said: “What I sensed from her pulse and meridian should not be wrong, just that the life force beating was very different from any other normal pregnant women. Perhaps it is because Lady Tian’er is a Heavenly Jewel Master, and her physique is very unique as well.”</p><br/><p>Zhou Weiqing let go of him, saying almost in a muttering tone: “Alright, you can leave first. Thank you.”</p><br/><p>The doctor quickly rushed out of the room, and Zhou Weiqing slowly turned around to look at Shangguan Xue’er with a strange look on his face. Slowly, he said: “I… I’m… I’m going to be a father?”</p><br/><p>Shangguan Xue’er glared at him exasperatedly and said: “Pregnant before marriage, you rotten scoundrel. How can Tian’er face the world like that?”</p><br/><p>However, she quickly discovered that Zhou Weiqing was not even listening to her. Just as she was starting to get worried about him, this fellow suddenly jumped up high, almost knocking into the ceiling of the room as he burst forth in excitement.</p><br/><p>“Wahahaha. I’m going to be a father! I’m going to be a father! Hahaha, our Zhou Family has descendents at last!”</p><br/><p>“Oeii! Quiet! Are you trying to disturb Tian’er?!” Shangguan Xue’er hissed exasperatedly.</p><br/><p>Only then did Zhou Weiqing shut up instantly, clutching his mouth at once as he looked at Shangguan Xue’er, nodding. “Sorry, let me go out and be excited for a bit, I’ll be back in a while.”</p><br/><p>As he said that, this fellow disappeared in a flash. Shangguan Xue’er could hear his excited voice ringing from outside. “Wahahaha, I’m going to be a father! I’m going to be a father!”</p><br/><p>Hearing his wild howls from outside, Shangguan Xue’er’s gaze turned slightly vacant. “Are men so happy about becoming fathers…? What if…” As she thought up to that point, her face turned red, and she quickly slapped herself lightly. “What am I thinking!”</p><br/><p>Her gaze turned to Tian’er, sleeping peacefully in the bed. Shangguan Xue’er did not realise that her eyes were now filled with envy.</p><br/><p>…</p><br/><p>Tian’er slept for an entire day and night before she finally woke up. When she opened her eyes, she saw Shangguan Xue’er, lying at the side of her bed asleep.</p><br/><p>Seeing the exhausted features of the sleeping Shangguan Xue’er, Tian’er felt a warmth in her heart. Having gone through so much together, the enmity which the two girls had between them at the start had mostly diminished, and they held a new appreciation for each other.</p><br/><p>“Xue’er, Xue’er…” Tian’er shook Shangguan Xue’er lightly, waking her up.</p><br/><p>“Ah! Tian’er, you’re awake? Don’t move.” Shangguan Xue’er was startled out of her sleep, and as soon as she saw Tian’er was seated up, she quickly supported her back to lie down again.</p><br/><p>Tian’er looked at her curiously. “Xue’er, what are you doing? I’m not tired anymore. You should take the bed and sleep…”</p><br/><p>Shangguan Xue’er shook her head repeatedly, saying: “How can I do that, you are the patient now, so you must rest well. Otherwise, that bad fellow will have a heartache.”</p><br/><p>Tian’er giggled, saying: “What so bad about him? Is what he said really right, women only like bad boys? You obviously have feelings for him, and you can’t let him go, but you just aren’t willing to admit it.”</p><br/><p>Shangguan Xue’er blushed faintly and she said: “Who said I have feelings for him. You wait here, don’t move, I’ll go call that fellow. He went to make soup for you.”</p><br/><p>“Ah?” Tian’er started momentarily. Just at that moment, the door opened, and Zhou Weiqing entered, carrying a pot with his bare hands, as if not caring about the heat. Seeing that Tian’er had awoken on the bed, he was delighted, instantly putting the pot aside and moving to her.”</p><br/><p>“Dearest, you are awake! Quick, lie down properly, I’ll feed you some soup to restore your body. You women, at such a critical time, we cannot be careless at all! You must drink well, eat well, and rest well, don’t get all exhausted like last time. It’s all my fault, how could I let you follow me on the battlefield at such a key period? Ahhh, it’s all my fault!”</p><br/><p>Tian’er stared at Zhou Weiqing with jaw agape. “Oei, what are you going on nattering about? Like an old woman…”</p><br/><p>At the side, Shangguan Xue’er burst into giggles, saying: “This is called being overly concerned. Who asked you to no longer be representing one person, but two people now?”</p><br/><p>“What do you mean not a single person, but two people! What are you two talking about?” Tian’er looked at both Shangguan Xue’er and Zhou Weiqing with great puzzlement.</p><br/><p>Zhou Weiqing looked deeply into Tian’er’s eyes and said: “Dear, you already have it1.”</p><br/><p>“What do you mean I have it?” Tian’er stared at him puzzled. All of a sudden, she realised something, and her eyes widened abruptly, filled with shock and disbelief as her lips trembled. “What… what did you say? I… I’m expecting?”</p><br/><p>Zhou Weiqing held onto Tian’er’s hand and said: “You have the fruit of our love! We are going to be mother and father!”</p><br/><p>Tian’er held her mouth, a small voice escaping: “This, this is impossible…”</p><br/><p>Zhou Weiqing started. “Why is it impossible?”</p><br/><p>Tian’er stared at him with wide eyes, before looking back down at her flat stomach. “Our Divine Heavenly Spirit Tiger bloodline has always not been very fertile. Father has many other women, other concubines, though Mother is his only wife. However, not a single one of them has had a child so far. We… we…”</p><br/><p>Zhou Weiqing grinned and said: “Heh heh, that is no problem, this big bro’s capabilities are just too strong! Furthermore, you are fresh and fertile, heh, when the conditions are ripe, success will automatically come! Come, be good, I’ll feed you the soup.”</p><br/><p>As he said that, Zhou Weiqing opened the lid of the pot, ladling out a full bowl of delicious smelling soup. Taking a spoon of it, he blew lightly on it for awhile before carefully bringing it to Tian’er’s mouth.</p><br/><p>Only when she had finished the bowl of soup did Tian’er break out of her reverie. She held onto Zhou Weiqing’s hands, saying: “Little Fatty, I… I need to go home. Can you come to my house when you finish up here? Our Divine Heavenly Spirit Tiger bloodline is very different from humans, so only Father can confirm whether or not I really… really am pregnant.”</p><br/><p>“Okay, sure, whatever you say.” Zhou Weiqing’s expression was totally that of a loving father, the love in his heart for Tian’er was unconcealed.</p><br/><p>Seeing his dazed and silly look, Tian’er couldn’t help but burst out in giggles, blushing deeply as she said: “Don’t be too anxious. I am fine. Even if I really am pregnant, it will be a long time before I can give birth. Our Divine Heavenly Spirit Tiger bloodline usually have a gestational cycle of five to ten years. Furthermore, although we are not very fertile, once we have a child, there should not be any problems due to our strong bloodlines. Our bloodline powers will act to protect their legacy.”</p><br/><p>“Five to ten years?! So long?!” Zhou Weiqing exclaimed in surprise.</p><br/><p>Tian’er nodded and said: “We are not truly human after all. Although, I do not know whether our child will be born like you or like me, a little tiger.”</p><br/><p>Zhou Weiqing laughed heartily and said: “No problems, no problems, as long as it is ours, no matter what I will love!”</p><br/><p>Tian’er looked at him exasperatedly and said: “Alright, go handle your business. Such a huge battle was just finished, and there are many things for you to settle. I am totally fine, and Xue’er is here to accompany me too.”</p><br/><p>Zhou Weiqing grinned and said: “What can be more important than my precious wife?! Alright, since you are alright… when things are settled here, I will also rush to bring you back to my father-in-law to let him see you. Xue’er, I’ll have to trouble you to take care of Tian’er for a while, there are indeed quite a lot of things for me to settle.”</p>\n</div>"}