{"title": "Chapter 614", "id": 614, "volume": 7, "url": "http://boxnovel.org/heavenly-jewel-change-chapter-614", "volume_title": "Volume 7", "body": "<h1>Chapter 614</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>The Devour Skill of the Demonic Attribute. Towards someone who was at an even lower cultivation level than he was, he could easily Devour their Heavenly Energy even at a short distance. Of course, such a tiny amount of Heavenly Energy was not much use to him.</p><br/><p>Xuan’er stood there, just stunned. All along, she had believed that in the entire younger generation, no one could compare with her. With her strength, she thought she could compare to even those younger generation geniuses of the Great Saint Lands. Alas, the sight before her eyes was toppling her belief. Although Zhou Weiqing spoke like an arrogant senior, from his looks he was barely twenty as well. Yet, in front of him, she did not seem to even have the slightest chance.</p><br/><p>Anger. Vexation. Unwillingness to accept such a situation. All sorts of complicated emotions burst forth in that instant, and Xuan’er suddenly screamed out loud. “Die!!”</p><br/><p>The staff in her hands abruptly pointed at Zhou Weiqing once more. In the twinkling of an eye, a wheel of ice appeared behind her back… the thick blue light slowly turning black. This was the Ice Attribute Element, pushed to the limit and beyond. This was something that could only happen when one used their Life Force to power a Skill!</p><br/><p>The originally only Heavenly Energy reverberation suddenly turned violent and restive. Without warning, a pitch black ice spear appeared in front of Xuan’er, floating there restlessly. At the same time, her face turned pale and ashen. It was clear that unleashing such a Skill had a great toll on her.</p><br/><p>Zhou Weiqing turned back around. This time, his expression was extremely ugly.</p><br/><p>Previously, although Xuan’er had been provoking them all this time, in Zhou Weiqing’s eyes, they were just a bunch of kids who did not know the immensity of heaven and earth1, and just teaching them a lesson was sufficient. After all, with his status and horizon outlook, he wouldn’t lower himself to the same level as these kids.</p><br/><p>However, Ah Dou had tried to kill Ma Qun, and Xuan’er with the attitude of fighting to the bitter end, wanting to kill them. Now, she had even resorted to using burning her Life Force in using a Skill to attempt to kill him. With that, the flames of anger were finally fanned in Zhou Weiqing. He had always been one who loved his life and treasured it so much, and if someone tried to kill him, he would definitely treat them as an enemy, an enemy to be slain.</p><br/><p>The black ice spear flew towards Zhou Weiqing like a bolt of lightning. Wherever it flew, the very air around it was warped and twisted. In that moment, even Tian’er, who had been sitting calmly at the table, had a sudden change in expression.</p><br/><p>Zhou Weiqing’s right hand lifted suddenly. Upon close examination, one might discover that in that instant, his entire right hand had also turned pitch black, with faint glow of purple tattoos writhing on the skin.</p><br/><p>Lifting hand.</p><br/><p>Grab. As if grabbing at empty space.</p><br/><p>To any onlooker, such a slow movement would never be able to affect the black ice spear.</p><br/><p>However, as soon as Zhou Weiqing actually attacked, the energy reverberations in the air all around them suddenly turned strange, as if everything was being warped, giving a powerful illusory feel to everything.</p><br/><p>When the ice spear entered this warped space, it stopped momentarily all of a sudden. In that instant, Zhou Weiqing’s right hand grabbed onto it, actually grasping the ice spear in his hands.</p><br/><p>A strange sight occurred next, as a thick grey light flared up, covering Zhou Weiqing’s right hand and the spear in a layer of crystalline like grey. Next, the ice spear began to melt rapidly, as if its ice had met with an unbelievably strong fire, slowly turning smaller and smaller before it vanished totally.</p><br/><p>By this time, ‘stunned’ was no longer sufficient to describe what Xuan’er was feeling. She had never imagined that her most powerful attack could be dissipated in such a way by Zhou Weiqing. The strength and power that he had displayed had caused her to truly lose all hope.</p><br/><p>Right at the same time, Zhou Weiqing’s other hand lifted up towards her, a thick blue light flickered, and a round lightning pearl tumbled towards Xuan’er at a deceptively fast speed, crackling with purple lightning.</p><br/><p>Xuan’er’s face had already been pale, but it somehow grew even more ashen at that moment. Although the lightning pearl that Zhou Weiqing had shot out was not large, when it appeared the powerful cold in the dining hall actually disappeared, filling the area with the ozone scent of raging lightning attribute.</p><br/><p>In that instant, the several youths who had been fawning over her actually stumbled backwards in retreat, not wanting to be affected by the spread of electricity. Shockingly, no one attempted to rescue her, and having lost most of her Heavenly Energy, how could Xuan’er withstand this simple angry strike by Zhou Weiqing.</p><br/><p>It might just be a single lightning pearl, but with the fine control of Zhou Weiqing’s ‘Flying Lightning God Technique’, that particular lightning pearl was actually compressed with a massive amount of lightning attribute Heavenly Energy. Towards someone who tried to kill him directly, he did not feel the need to hold back. Even if that person was a beautiful lady, in Zhou Weiqing’s eyes, she was just a femme fatale.</p><br/><p>“Show mercy!” Right at this moment, an urgent voice rang out. The next instant, an icy blue light engulfed it. It was a massive water bubble. As soon as the bubble appeared, it enveloped Zhou Weiqing’s lightning pearls. To Zhou Weiqing’s surprise, the water bubble actually severed the connection between him and the lightning pearl.</p><br/><p>Next, the water bubble flew out towards the door, up into the skies. After a few moments, the loud explosion of lightning and thunder rang out, as if someone had detonated a massive lightning bomb in midair.</p><br/><p>Xuan’er subconsciously staggered back several steps, her body knocking into a table which toppled to the ground. Currently, her eyes were filled with shock. She knew that if not for the bubble appearing at the last second, she would have been blown to bits by that lightning pearl’s explosion.</p><br/><p>A tall and slender figure appeared at the doorway. “Please show mercy. I apologize deeply on behalf of my sister.” As soon as the figure appeared, his words and attitude were extremely courteous, but in a flash he appeared in front of Xuan’er defensively.</p><br/><p>When he saw the person, Zhou Weiqing started momentarily. The figure first looked at Xuan’er, making sure that his sister was fine, before he turned to look at the other side.</p><br/><p>Four eyes met. The person who had saved Xuan’er suddenly shuddered violently, eyes filled with shock as he staggered back a step, exclaiming in shock: “It… it’s you?!”</p><br/><p>This person who had saved Xuan’er was actually someone Zhou Weiqing knew… was even familiar with. It was Ye Paopao, son of the Fei Li Empire Prime Minister… once his treasured companion who had been in the same Battle Team with Zhou Weiqing in the Heavenly Jewel Tournament, fighting alongside him… but also the same person who had ran off early and reported Zhou Weiqing’s information to the Fei Li Empire… causing him so much trouble… 0</p><br/><p>A shadow of a smile crossed Zhou Weiqing’s face… a strange, even conflicted look. “Why can’t it be me? Is this your little sister? Not bad, not bad at all! So young, and already at the five-Jeweled stage.”</p><br/><p>Seeing that it was Zhou Weiqing, Ye Paopao’s face changed dramatically. If there was one single person that he wished most not to meet, it had to be this youth standing right in front of him now.</p><br/><p>Originally, when Lin TianAo, him and the others had represented the Fei Li Empire to join the previous Heavenly Jewel Tournament, Ye Paopao had definitely gained many major benefits. Not just in terms of the raise in cultivation level… even the simple reward of being able to ascend the Heavenly Jewel Island after winning the championship was an unbelievable benefit. Currently, his cultivation level had already broken through to the six-Jeweled cultivation stage, which would have been far above his own expectations before he had attended the Heavenly Jewel Tournament.</p><br/><p>Alas, he had betrayed Zhou Weiqing, informing his own Family about Zhou Weiqing’s details, and influencing the decision for the Fei Li Empire to break ties with Zhou Weiqing, forcing him to flee from the Fei Li Empire. It could be said that at that time, Ye Paopao had affected Zhou Weiqing the most. All these years, Ye Paopao had also been filled with guilt and regret.</p><br/><p>Not long ago, Zhou Weiqing had led a diplomatic party to visit the Fei Li Empire, he had learned about it. However, at that time, he had only looked at him in the drilling ground from a distance for a short moment.</p><br/><p>How could he dare, have the face to meet Zhou Weiqing? However, just that single look was sufficient for him to see how powerful Zhou Weiqing had grown in the few years apart.</p><br/><p>Previously, when he was only at the three-Jeweled stage, Zhou Weiqing had already done so much, caused so much wind and rain in the last Heavenly Jewel Tournament. Let alone now, when he was already at the six-Jeweled stage. It could be said that the person Ye Paopao feared most was Zhou Weiqing, and now that he appeared so suddenly in front of him, one could imagine the sheer shock in Ye Paopao’s heart.</p><br/><p>“Weiqing, how are you. It’s been a long time.” Ye Paopao forced a smile. At last, he gathered his spirits and greeted Zhou Weiqing.</p><br/><p>“Ye Paopao, he hurt Ah Dou, and Xuan’er. You must take revenge for us!” One of the youths sidled up, saying angrily towards Ye Paopao.</p><br/><p>Ye Paopao swept a cold gaze over him, before saying quietly: “Shut up. Take Xuan’er and get lost. Wait for me outside.”</p><br/><p>“Ye Paopao, you aren’t so afraid of things right.” The youth said vexedly.</p><br/><p>All of a sudden, Ye Paopao just gave him a backhand slap, sending him flying, fixing his crashed form with a cold gaze. This time, no one else dared say anything else, and even Xuan’er stood up quietly, glaring savagely at Zhou Weiqing before leaving gloomily with the other youths.</p><br/><p>Ye Paopao looked at Zhou Weiqing with an embarrassed expression. “Weiqing, my apologies, they are just too young, arrogant and willful.”</p><br/><p>Zhou Weiqing smiled faintly, saying: “They did not do anything to that they have to apologize about, just a bunch of kids. On the other hand, if I did not remember wrongly, you were the one who actually let me down right…”</p><br/><p>Ye Paopao gave a bitter smile, saying: “Yes… yes I let you down indeed. All these years, I have lived in regret. I have also always been running away from the truth, avoiding the past. Now that I have seen you today again, I know that I can no longer run away. Do it then, no matter how you deal with me, I accept it. Although I had my own reasons for doing it at that time, it is true that I betrayed you… that I let you down.”</p><br/><p>Looking at Ye Paopao’s sorrowful face, Zhou Weiqing gave a cold smirk. Waving at him, he said: “Go, get lost. Killing you will only dirty my hands. I am too lazy to talk about the past, I can only blame my own eyes for being blind.”</p><br/><p>After saying that, Zhou Weiqing turned back to his own table.</p><br/><p>Indeed, when he had been betrayed, he had once been filled with hate and anger against Ye Paopao. At that time, if not for the fact he had just barely been strong enough, perhaps he would have died at the Fei Li Empire, died in the hands of his so-called allies.</p><br/><p>However, so much time had passed, and just too many things had happened to him since. Especially since he had gained so much more in the ZhongTian Empire, meeting all his Peerless Regiment brothers. Perhaps, if not for Ye Paopao’s betrayal and actions, he would not have what he has today. As such, a lot of the hate towards Ye Paopao had vanished. He had never been a person to dwell on hatred, always preferring to look towards the future. In his heart, Ye Paopao was no longer of any importance at all, just a mere past guest that had once been in his life briefly.</p>\n</div>"}