{"title": "Chapter 610", "id": 610, "volume": 7, "url": "http://boxnovel.org/heavenly-jewel-change-chapter-610", "volume_title": "Volume 7", "body": "<h1>Chapter 610</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>At the side, Shangguan Xue’er suddenly raised a brow, and she said passively: “Naturally, Little Miss Muddle will be joining the Heavenly Jewel Tournament. However, she will not be joining your Heavenly Bow Empire Battle Team, but our ZhongTian Battle Team. Later, I will be leaving with her to head back first.”</p><br/><p>Upon hearing her words, Zhou Weiqing’s mouth began to twitch uncontrollably. At last, he gave a bitter smile and said: “Xue’er, are you really trying to form the greatest battle team in history of battle teams before you are satisfied?”</p><br/><p>In front of so many people, Shangguan Xue’er naturally assumed her usual icy cold demeanour, saying passively: “This is all part of your test, if it were too easy, there would be no point. Only stress and pressure will give you sufficient motivation. As the saying goes, when one gets too comfortable, they will just drift along. You must work hard. Come on, Little Miss Muddle, let’s go.”</p><br/><p>As she said that, Shangguan Xue’er nodded to the others, and pulled Little Miss Muddle out of the room.</p><br/><p>Zhou Weiqing could only stare after them helplessly, left speechless. Facing a ZhongTian Battle Team with the three Shangguan sisters and Little Miss Muddle… was there a chance of success? Besides the difference in cultivation level between both sides alone, all three Shangguan sisters could be said to have accompanied Zhou Weiqing respectively from the start of him becoming a Heavenly Jewel Master all the way until this very day. Although it would be an exaggeration to say they knew him down to the last hair… well, it wasn’t that far of an exaggeration! Towards the other powerhouses of the Peerless Regiment, they were also extremely familiar. Without a doubt, there were very few secrets they had against the three sisters. If they truly went all out against his team, how could they fight?</p><br/><p>Just as Zhou Weiqing was sitting there vexedly, Shangguan Xue’er suddenly reappeared at the doorway, saying to Zhou Weiqing: “There is one more news I have to tell you. We have also heard that this year’s Dan Dun Battle Team will be their strongest ever. Clearly, they have a similar wish as you all, to spread the reputation and show the power of the Dan Dun Empire. Previously, they had been eliminated by your team, and with the character of the Blood Red Hell and how they will seek revenge for any small matter… you better pray hard… and watch out. I am leaving now.” After finishing her speech, only then did Shangguan Xue’er turn to leave. As she did so, a faint smile crossed her lips. She could imagine the dazed look on Zhou Weiqing’s face right now.</p><br/><p>Indeed, Zhou Weiqing was stunned momentarily before he said helplessly: “What can this brother do now!”</p><br/><p>Lin TianAo spoke up seriously: “Weiqing. Remember, when we first moved out as a team, when we were representing the Fei Li Battle Team? At that time, no one fancied our chances as a Battle Team. No one would have imagined we would actually become the champion of the Heavenly Jewel Tournament. Indeed, our power would not be able to match the four Empires backed by Great Saint Lands. However, we still did it. We managed to achieve victory. Why? Because we always had the heart to charge forward no matter what.”</p><br/><p>Zhou Weiqing laughed heartily and said: “Big Bro Lin, you misunderstand me. It is not that I do not think we will lose… it is just that the ZhongTian Empire Battle Team are all my women… It is hard for me to actually attack them!”</p><br/><p>“Bullshit, what do you mean all your women. Don’t you have face at all?” At the side, Yun Li suddenly said angrily.</p><br/><p>“Ehhh… Yun Li, how come you didn’t follow Little Miss Muddle home?” As soon as Zhou Weiqing saw it was him, he quickly changed the topic.</p><br/><p>Yun Li said with an ugly expression on his face: “That is because I am joining you to attend the Heavenly Jewel Tournament.”</p><br/><p>Zhou Weiqing’s eyes widened in surprise. “What? You are below the age of thirty?” In his impression, four or five years ago when he had first met Yun Li, that fellow was already thirty years old… right? In truth, he had never asked Yun Li what his age was.</p><br/><p>Yun Li ‘sweatdropped’.”Do I really look that old? There are still more than two months before I turn thirty!”</p><br/><p>In the grand hall, everyone couldn’t help but break out in smiles at that. Even Lin TianAo, who was the most familiar about the relationship between Zhou Weiqing and Yun Li, couldn’t help but laugh out loud.</p><br/><p>Only then did Zhou Weiqing react, grinning as he said: “Heh heh, mature, that is maturity. Men, it is good to be more mature! No problem, it’s no problem at all! Anyway, you have already found your wife, even if you look a bit older, there’s nothing to be afraid.”</p><br/><p>Looking at the black lines forming on Yun Li’s head, Zhou Weiqing hastily added: “Alright, we’ll add you as well. Later, if Little Miss Muddle’s Master isn’t willing to accept you, I will help you!”</p><br/><p>Upon hearing the last sentence, only then did Yun Li’s anger turn into joy. In terms of cultivation level, Yun Li was not weak at all. These few years, although he had spent most of his time and energy on Consolidating Equipment Scrolls, it was without a doubt that during the creation process, not only did he have to focus fully with all his spirit, he also had to expend large amounts of Heavenly Energy all the time. Naturally, that was another form of cultivation process. Furthermore, his Heavenly Energy cultivation level had originally been higher than Zhou Weiqing’s, and currently he had already entered the six-Jeweled stage. For him to do so before the age of thirty, that was already very impressive.</p><br/><p>By now, five of the six members of the Heavenly Bow Empire Battle Team had already been chosen, and they still lacked a final member for their main team.</p><br/><p>Right at that moment, Han Mo suddenly stepped out. As one of the seven God Archers of the Heavenly Bow Unit with the nickname of ‘Arrow Tower’, Han Mo was usually the most silent of them all. Zhou Weiqing couldn’t help be surprised that he stepped forward so abruptly.</p><br/><p>“Master Han Mo, don’t tell me that… you’re also not thirty years old?!” Zhou Weiqing smiled as he said.</p><br/><p>Han Mo acted as if he never heard those words, saying: “I will introduce you to someone. Hold on.” After saying that, he walked out of the room.</p><br/><p>After some time, Han Mo returned with a person, and as soon as the person entered the room, Zhou Weiqing had to actually look up to see the person’s features.</p><br/><p>It was a girl. Her height was even taller than Crow, and from her heavy steps, she was clearly one of the Gold Crow Tribe members. Although her stature was tall and great, her features were indeed very beautiful, and she looked to be only about eighteen or nineteen years old, a bashful look on her face as she walked behind Han Mo into the grand hall.</p><br/><p>Towards this girl, Zhou Weiqing did not have any impression at all. Curiously, he asked: “Master Han Mo, who is this? Could it be… you are the same as Master Mu En, having a secret daughter in the Gold Crow Tribe?”</p><br/><p>“Bullshit!” The usually silent Han Mo, who seemed impassive no matter what happened, suddenly burst out angrily. He glared at Zhou Weiqing for a moment before saying at last: “She is my girlfriend, her name is Xixi.”</p><br/><p>“Girlfriend?!” Zhou Weiqing’s shock was palpable! In his memory, Han Mo had always been a quiet enigma. Besides fighting, where he displayed his power and valiant side, he seldom spoke at all. At most, he had an occasional line of cold humour. Yet, unknowingly, he had actually found a girlfriend, and one so young!</p><br/><p>Luo Ke Di couldn’t help but mutter out loud: “This is the legendary ‘Old Bull eating Nubile Grass!”</p><br/><p>Han Mo said savagely: “If you do not want to die, shut your smelly mouth!”</p><br/><p>At this point, the girl named Xixi stepped up to Han Mo’s side. With her height and stature, she was even taller than Han Mo by at least two heads, but she leaned at him shyly. Zhou Weiqing couldn’t help but think wickedly… with her weight, would she crush Han Mo when they were…</p><br/><p>“Hello everyone, my name is Xixi.”</p><br/><p>Clearly, Crow knew about the relationship between Han Mo and Xixi, and she was the first to speak up with a faint smile: “Weiqing, Xixi is my cousin. If we had to speak of the greatest talent in our Gold Crow Tribe younger generation, she would definitely take the spot. In terms of pure combat ability, although Xixi is younger than me, she is no weaker than I am. She is also a Heavenly Jewel Master, currently at the four-Jeweled stage. Her Physical Jewel is the Strength Attribute, and her Elemental Jewel is the Ice Attribute. In our entire Gold Crow Tribe younger generation, she is of equal fame with myself, and we are known as the ‘Fire and Ice Duo’.”</p><br/><p>Hearing the words ‘Fire and Ice’, Luo Ke Di who had just resumed drinking suddenly spat out the mouthful of wine. Han Mo and Mu En sprang to their feets instantly and dragged the fellow out. Alas for this ‘Drunken Rogue’, he would soon be gifted with some ‘inhuman treatments’. 1</p><br/><p>Naturally, Zhou Weiqing knew what that perverted Luo Ke Di was thinking about. Of course, he was still able to control himself to not show it. With a straight face, he said seriously: “Very well, since both of you have recommended her, Xixi welcome to our Heavenly Bow Empire Battle Team. I think that we do not need any reserves, at least from the looks of things. In three days time, we will leave and head towards the ZhongTian Empire.”</p><br/><p>Just like that, the first Battle Team in the history of the Heavenly Bow Empire was formed, a historic representation to join the Heavenly Jewel Tournament. The Team Leader was naturally Zhou Weiqing, with the final members being confirmed as Tian’er, Yun Li, Crow, Ma Qun and Xixi.</p><br/><p>Such a group was definitely far stronger than Zhou Weiqing’s previous Fei Li Battle Team. Especially when one looked at Zhou Weiqing and Tian’er, they were definitely amongst the top in their age group. Crow was also far more matured and stronger than she had been that time. Yun Li’s cultivation level was above Xiao Yan and the others at that time. As for Ma Qun and Xixi, though their cultivation levels were relatively lower, they had the innate talents of their bloodline. Overall, in Zhou Weiqing’s eyes, the strength of their entire team was no weaker than any team from a Great Saint Lands.</p><br/><p>In the next three days, Zhou Weiqing, Ming Yu and the rest of the upper echelons of the Heavenly Bow Empire began discussing in detail the follow up plans and strategy regarding their defense and building up. They arranged a whole series of plans and contingencies since Zhou Weiqing would be leaving for the Heavenly Jewel Tournament.</p><br/><p>This time, Zhou Weiqing had already decided that not only would they be going to attend the Heavenly Jewel Tournament… once the Tournament ended, he would bring Tian’er home to the Heavenly Snow Mountain for a visit.</p><br/><p>No matter what, the news that Tian’er was pregnant had to be verified by the Heavenly Snow Mountain Lord. There was also the matter of their Saint Energy. The Heavenly Snow Mountain had many powerful Heavenly Beasts under their command, and if Xue AoTian was willing to ask them to aid in their cultivation, the gathering of their Saint Energy would undoubtedly be much faster.</p><br/><p>Having experienced the assassination from the Heavenly King assassin, Zhou Weiqing deeply felt his own lack of power. Although his overall combat prowess was far above his own cultivation level, it was without a doubt that only when one entered the Heavenly King Stage would they finally be deemed a real powerhouse. No matter that he was still young… his enemies would not wait for him to grow slowly.</p><br/><p>In his previous experiences, he did not have much chances to fight against Heavenly King stage powerhouses, which was why Zhou Weiqing did not have such a strong feeling previously. However, ever since he had almost died to the Heavenly King assassin, it had sparked great alarm in his heart. As a person who was so afraid of death, what was more important than keeping himself alive? Furthermore, Zhou Weiqing was extremely clear what his Heavenly Bow Empire currently lacked most.</p><br/><p>In terms of overall military strength, though the Heavenly Bow Empire armies were not high in numbers, but with the Peerless Regiment as the core, he was confident in facing any other Empire head on.</p><br/><p>However, their greatest weakness was that they just lacked a top end powerhouse… one that could awe and frighten their enemies… or at least be a deterrence.</p>\n</div>"}