{"title": "Chapter 617", "id": 617, "volume": 7, "url": "http://boxnovel.org/heavenly-jewel-change-chapter-617", "volume_title": "Volume 7", "body": "<h1>Chapter 617</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>Zhou Weiqing was very angry, and the consequences were grave. As a man, who would be willing to hear others say he was not worthy of his woman? Furthermore, it looked like if he did not take action, he would not be able to see Bing’er.</p><br/><p>The dozen or so white clad youths were clearly the outer disciples of the Heaven’s Expanse Palace, and only the leader who had insulted Zhou Weiqing might possibly be part of the inner or core disciples. Zhou Weiqing totally ignored the others, just punching him directly.</p><br/><p>Although he did not unleash his Heavenly Jewels, Zhou Weiqing’s physical body was already far stronger than any ordinary Heavenly Jewel Master. The step forward was as at unparalleled speed, and all the other white clad youths only saw a blur before them before Zhou Weiqing had reached their leader. The rest of them could only surround him from the back, but they were far too late to stop him.</p><br/><p>Facing Zhou Weiqing’s punch, the white clad leader was also given a fright. This was the Heavenly Jewel Island, where the Heaven’s Expanse Palace was situated. Even if the Heaven’s Expanse Palace disciples did not become arrogant from that, they would still have a sense of pride that held them at a lofty position. At least, they had never seen anyone dare to take action here. Even a Heavenly King stage powerhouse would be polite to these workers here. Who would guess that Zhou Weiqing would actually attack him first just like that?</p><br/><p>Flustered and caught by surprise, the white clad leader had not time to use any Skills, and he could only gather his Heavenly Energy as he tried to block Zhou Weiqing’s punch.</p><br/><p>*BANG* Zhou Weiqing’s fist slammed savagely into his opponent’s crossed arms which he had just put up in a defensive guard. He struck right in the intersection where the defense was supposed to be the strongest. Both sides were almost equal in cultivation level, but the sheer difference in physical strength was just too huge.</p><br/><p>The white clad leader was sent flying like a cannonball released. This was also because Zhou Weiqing had held back, withdrawing some strength at the last moment, otherwise it could have just destroyed his arms from the sheer tyrannical impact.</p><br/><p>Almost simultaneously, the ordinary four-Jeweled Heaven’s Expanse Palace outer disciples attacks from the back reached Zhou Weiqing.</p><br/><p>Right at that moment, an inconceivably powerful aura burst forth abruptly from Zhou Weiqing’s body. The charging Heaven’s Expanse Palace disciples felt as if they were suffocating, as the suppressing force caused their Heavenly Energy to be pushed back, even stalled, making them falter in their charge.</p><br/><p>A giant pair of wings erupted from Zhou Weiqing’s back, and a thick Heavenly Energy reverberation joined the immense aura.</p><br/><p>All of the attacks landed on the pair of wings. However, all the white clad youths were shocked to discover that instead of their attacks taking effect, a vast power instead sent them flying back.</p><br/><p>If there had been any onlooker at the side, they would have seen a stunning sight. A dozen white clad youths leaping at Zhou Weiqing simultaneously, and all of them swept off and sent flying by the appearance of the massive pair of wings.</p><br/><p>This was at the edge of the Heavenly Jewel Island. In the sweep, some of the Heaven’s Expanse Palace disciples were actually sent flying off the island, about to fall down. If they were to fall from such a heights, perhaps it would be difficult to even find a proper piece of their remains.</p><br/><p>Several bouts of black light sprang out from Zhou Weiqing’s body instantly, as if they had eyes of their own, encircling all of the white clad youths who were about to fall and pulling them back. The giant wings which had sent them flying unfurled once then returned back into Zhou Weiqing’s body, hidden once again.</p><br/><p>At this point, the white clad youths were now looking at Zhou Weiqing with gazes filled with shock. When Zhou Weiqing first ascended the Heavenly Jewel Island, they had not paid much attention to him due to his youth and his simple dressing.</p><br/><p>However, they now realised that this youth in front of them had powers that far surpassed even their imaginations. He had not even unleashed his Heavenly Jewels, and he had already defeated all of them with such ease.</p><br/><p>The white clad leader who had been sent flying back with Zhou Weiqing’s punch finally regained his balance. The arms that he had used to block the blow were now totally numb, almost having lost all feeling in them.</p><br/><p>“You… you actually dare attack us on the Heavenly Jewel Island?!” He had lost so miserably, and the extreme shame turned to red faced anger. He quickly drew out a gemstone from his pocket, infusing Heavenly Energy within. Instantly, a brilliant gold light shone forth.</p><br/><p>It was as if Zhou Weiqing did not even see what he had done, instead a faint silvery-white light lit up in his eyes, and the aura around him changed suddenly. In the white clad youths’ eyes, after the change, there were only two phrases to describe him. Illusory… boundless…</p><br/><p>Under any ordinary circumstance, with Zhou Weiqing’s character and intelligence, he would never be so rash and impetus. However, he had been parted from Bing’er for so long, and at long last he had finally gotten to know that she was out of closed door cultivation. He was now at the Heavenly Jewel Island, just a few steps from her, and one could just imagine how excited, agitated and urgent he was. At this moment, he only wanted to see her. As for manners…. He couldn’t give a damn now.</p><br/><p>“BING’ER, I— HAVE— COME —.” All of a sudden, Zhou Weiqing lifted his head, shouting up into the skies. As he shouted, the surrounding Heaven’s Expanse Palace disciples felt dizzy, their eyes shocked.</p><br/><p>All around Zhou Weiqing, there was a shield formed by layer of silver white light. His voice instantaneously covered the entire Heavenly Jewel Island, the soundwaves assisted by the strange reverberation of the Saint Energy. Zhou Weiqing believed that even if there was a Spatial Separation, with the help of the Saint Energy, it would not be able to block his voice.</p><br/><p>“Who dares to shout and howl around in our Heavenly Jewel Island…” A solemn voice rang out. Next, two figures appeared near the front of Zhou Weiqing.</p><br/><p>The two figures looked to be elders of around sixty years of age, both dressed in white as well, though their sleeves were adorned with silver thread. As Zhou Weiqing had previously been to the Heaven’s Expanse Palace, he knew that these were Guardians of the Heaven’s Expanse Palace.</p><br/><p>The Heaven’s Expanse Palace had several administrative levels. Those who remained outside to receive guests and guide them along, they were all ordinary outer disciples, and they could only wear the pure white without any decorations. These disciples might have differing cultivation levels, but the highest would not be above the seven-Jeweled stage. Once their age reached a certain point, but their cultivation level did not keep up, they would be sent down to the ZhongTian Empire to hold some important positions, but they would no longer be able to remain in the Heaven’s Expanse Palace.</p><br/><p>However, if they could meet the requirements, they would raise one stage up, which were the Guardians. According to Zhou Weiqing’s memories, the Heaven’s Expanse Palace Guardians were ordinarily eight or nine Jeweled in stage. However, these Guardians were still considered outer disciples.</p><br/><p>As for the true core of the Heaven’s Expanse Palace, Zhou Weiqing did not really know what the requirement was. In any case, those core disciples he had seen all had gold thread embroidery around their sleeves, for example Zhan LingTian. Anyone above should be at least of Elder status. Of course, Zhou Weiqing did not know how many Elders the Heaven’s Expanse Palace had, but he knew that one needed to be at least of the Heavenly King Stage to be even considered an Elder, and their cultivation level would also determine the number of gold threads on their sleeves. For example, for the two Heaven’s Expanse Palace Masters he had seen previously, the First Palace Master Shangguan Tianyang had nine gold threads around his sleeves, while Shangguan Tianyue only had seven. It was clear that there was some difference between the two brothers’ cultivation level, though he did not know what they were exactly.</p><br/><p>Zhou Weiqing looked at the two Guardians innocently, saying: “I am here to look for people, but they insulted me first. You can’t blame me for taking action.”</p><br/><p>The two old men’s faces fell, and the one on the left said: “No one can take action at the Heaven’s Expanse Palace. Surrender now, otherwise we will kill you.”</p><br/><p>Zhou Weiqing laughed heartily and said: “So fierce! Come and try then!”</p><br/><p>By now, he was really angry. The previous time, he had reached the Heaven’s Expanse Palace without any problems. Why did he have so many problems now? Was it just so difficult to see Bing’er?</p><br/><p>The two Guardians’ expressions changed. Both of them did not continue speaking, instead charging towards Zhou Weiqing in a flanking maneuver. In their eyes, how could someone as young as Zhou Weiqing have much strength? Even if he came from another Great Saint Lands, he should not be beyond the seven-Jeweled stage. As such, the two of them did not even bother releasing their Consolidated Equipment, just charging straight at him. The old man on the left had the Wind Attribute Elemental Jewels, and he unleashed a Fetters of Wind. As for the old man on the right, he directly used his hands to strike out at Zhou Weiqing.</p><br/><p>Zhou Weiqing gave a cold humph. He also did not summon his Consolidated Equipment, instead the wings behind his back spread out once more as he instantly entered the Dragon-Tiger Transformation state. Strange purple tattoos covered his entire body at once, and his body turned left abruptly, with the wings on the left actually turning silver at the same time. As he turned, the left wing swiped down with a ear splitting shrill sound. At the same time, with his turn Zhou Weiqing was able to face the old man trying to strike out at him directly.</p><br/><p>Although the Fetters of Wind was invisible, one needed to use the Wind Attribute in the atmosphere to bind their enemies. However, the old man was shocked to discover that when Zhou Weiqing’s left wing struck down, the air actually coagulated around him. The Wind Attribute Energy that was about to bind him actually split into two, dissipating… no longer able to affect him.</p><br/><p>Silver Emperor Wing Slash. One of the Silver Emperor’s powerful Wind Attribute Skills.</p><br/><p>Zhou Weiqing’s fist also received the other old man’s hands. No Skills, just a pure clash of strength.</p><br/><p>Another massive explosion. Although this old man was not sent flying like the previous white clad youth, he still staggered back eight steps before regaining his balance. He couldn’t help but think to himself: Such strength!</p><br/><p>“The Heaven’s Expanse Palace also needs to speak reason right!” Zhou Weiqing’s eyes were piercing with anger. Although these two old men had a decent cultivation level, both at the eight-Jeweled stage, they were after all still outer disciples of the Heaven’s Expanse Palace, and did not have the real legacy and teachings of the Heaven’s Expanse Palace. If they were to really fight it out, Zhou Weiqing was definitely not afraid of them.</p><br/><p>Right at that moment, a surprised voice rang out. “Zhou Weiqing, why are you here?”</p><br/><p>When Zhou Weiqing turned his head to look, he saw Zhan LingTian leading four Heaven’s Expanse Palace core disciples flying right at him.</p><br/><p>They had not seen each other in quite some time. Currently, Zhan LingTian looked like his aura was solidified and more consolidated than before. However, his gaze at Zhou Weiqing was no longer as friendly as it had been on the northern borders. Besides surprise, there was a sullen anger.</p><br/><p>“Bro Zhan, it has been a long time. Your Heaven’s Expanse Palace has such great rules!” Zhou Weiqing said to him.</p><br/><p>Very quickly, Zhan LingTian arrived at the scene, turning to the two old men, he said: “Guardians, let me handle this matter.”</p><br/><p>Seeing that it was Zhan LingTian, the two old men bowed slightly and stepped back.</p>\n</div>"}