{"title": "Chapter 613", "id": 613, "volume": 7, "url": "http://boxnovel.org/heavenly-jewel-change-chapter-613", "volume_title": "Volume 7", "body": "<h1>Chapter 613</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>Ma Qun’s obviously slowed body abruptly exploded into motion, the shield in his left hand smashing out savagely into Ah Dou, who was in the midst of extending himself in the strike.</p><br/><p>*BANG* Ah Dou was sent flying once more, blood spurting from his mouth.</p><br/><p>In truth, if one compared their total combat strength, he shouldn’t have been taken down so easily by Ma Qun. However, he had lost fully in terms of calculations and schemes. Ma Qun had purposely revealed a seeming weak spot for him to exploit, using his own powerful defense to just take the blow instead. As soon as he successfully struck Ma Qun, he would be extended out, and his state of mind would inadvertently relax slightly. Although he had seen Ma Qun’s shield strike out at him, but in his mind, as long as he could kill Ma Qun before the shield reached him, then it wouldn’t have much power behind it to worry about. In doing so, he could still act cool in front of Xuan’er, naturally he was happy to do so.</p><br/><p>Alas, it was this mindset that let him throw away the fight totally. Ma Qun’s strength was so terrifying. With just a single strike, though it was with the flat of the shield, it was more than enough for Ah Dou to deal with. His entire body flew and smashed into the side of the inn.</p><br/><p>However, it was clear that Ma Qun would not let him go so easily. After all, that fellow had tried to deal a killing blow to Ma Qun, how could he let that pass like that? The shield in his hand flew out like a bolt of lightning, forming a giant earthen yellow round knife as it flew towards Ah Dou with an ear splitting shrill. If that struck, Ah Dou would not be able to escape the fate of being sliced into two.</p><br/><p>Right at that moment, Xuan’er sprang into action. In a flash, she appeared beside Ah Dou. With the support of her right hand, her entire body flipped and a shield of ice appeared in midair, right in the path of Ma Qun’s flying shield.</p><br/><p>To Zhou Weiqing and the others’ surprise, the ice shield did not block the incoming weapon directly, instead deflecting it from an angle. As such, though Ma Qun’s shield was extremely heavy and with a spinning momentum, it was still deflected by the ice shield to fly off, missing Ah Dou.</p><br/><p>Grabbing hold of Ah Dou, Xuan’er brought him back to the front of their table. The entire process of her saving him was clean, neat and quick.</p><br/><p>It had been a good display of her power. Furthermore, around her wrists, five sets Heavenly Jewels sparkled. Her Physical Jewel was Coordination, while her Elemental Jewel was of the Ice Attribute. She looked just barely twenty, yet she was already at the five-Jeweled stage, a Mid Level Zun Stage Heavenly Jewel Master. That was already quite a feat. In any place, with such a cultivation level at the age, she would be considered a young genius. There was a reason behind her pride and arrogance after all.</p><br/><p>Ma Qun started momentarily, withdrawing his shield. He gave a big thumbs up, before slowly turning it down. “Well done, very good indeed, you truly know how to hide behind a woman’s skirts. You are great indeed.”</p><br/><p>Xuan’er passed Ah Dou to one of her other companions, and she stepped forward slowly. With her abilities, she could naturally sense that though Ma Qun was only a four-Jeweled Heavenly Jewel Master, the terrifying strength he had and pure defensive capabilities, even a five-Jeweled powerhouse might not be able to deal with him. Furthermore, she was currently extremely furious. In truth, she did not really care about Ah Dou being injured, but she had taken to heart the words Ma Qun had repeated.</p><br/><p>“You have insulted me, and more so you have insulted my mother. Today, either you die or I die.” As she said that, Xuan’er waved her right hand, and a Consolidated light blue staff appeared in her grasp. Next, an aquamarine necklace, an aquamarine crown circlet and another an aquamarine belt appeared one after the other around her. It was four Consolidated Equipments!</p><br/><p>Furthermore, these Consolidated Equipment were not ordinary at all. From the energy reverberations around them, they were actually all Zong Stage Consolidated Equipment… and pieces of a Set to boot. With Xuan’er’s five-Jeweled cultivation level, to have a four-piece Zong Stage Set, she had to have come from an extremely rich background, even for a Heavenly Jewel Master.</p><br/><p>Interestingly, the four Consolidated Equipment she summoned clearly had a rather unique boost, one that was not often seen at all. When the four equipment appeared, the Water Attribute element reverberations around her clearly grew much stronger, almost explosively. A thick Water Attribute aura filled the area, almost reaching that of most six Jeweled Water Attribute Heavenly Jewel Masters. Clearly, she had chosen the route of a long ranged attacker, and with the boost of her four Consolidated Equipment, her combat prowess was definitely not to be underestimated.</p><br/><p>However, facing Xuan’er like that, Ma Qun’s expression did not change at all. Instead, his face split in a wide grin as he said: “Not bad, not bad. This girl’s cultivation level is not bad! Her Consolidated Equipment looks quite interesting as well… unique indeed. Aiii, if I had not brought my wife along, perhaps we could have some fun together.”</p><br/><p>Towards Xuan’er, he was not worried at all. In terms of fighting capabilities beyond their cultivation level, in this entire place, who could compare with Zhou Weiqing? He had been Zhou Weiqing and the others for long enough, and his vision and horizon had been broadened to a height far beyond his past self. This Xuan’er’s fighting capabilities and skill were not bad at all, but she lacked any true battle to the death experience. Although Ma Qun did not know if he could defeat this girl, he was confident he would not lose to her. After all, he was Lin TianAo’s disciple!</p><br/><p>“Ma Qun, come back. If you keep wasting time, you won’t have enough time to eat.” Zhou Weiqing’s voice came from behind as he stepped up besides Ma Qun. Clapping Ma Qun on the shoulders, he motioned him to return.</p><br/><p>In truth, amongst the entire Heavenly Bow group, any one of them was no weaker than this Xuan’er. However, Zhou Weiqing did not want to waste time, and he couldn’t possibly ask Tian’er to fight. He had long decided that in this Heavenly Jewel Tournament, he would not allow Tian’er to fight at all unless absolutely necessary. As for Yun Li, Zhou Weiqing did not think he could get him to fight on this small matter. After all, all these years, Yun Li had laboured so hard and contributed so much to his own personal homeland revival plans. Naturally, Zhou Weiqing would not want to trouble him over such a small and simple matter. As such, in order to settle things quickly, he decided to step forward himself.</p><br/><p>Seeing Zhou Weiqing step forward, Xuan’er’s gaze narrowed. Although this tall and robust youth had a lazy look about him, yet… with her cultivation level, she was not able to sense his power at all.</p><br/><p>Zhou Weiqing smiled faintly and said: “Little girl, you might have some power, but don’t be too overconfident. Just a small matter and you are spouting nonsense about kill or be killed. Everyone only has one life… one life only has a few dozen years. Looking at you, you’re still a virgin right, you’ve not even experienced the wonders a man can bring you. Wanting to die now, isn’t that a shame? Why go to such an extent?”</p><br/><p>“You.. you’re asking for death!” Xuan’er’s voice came out through gritted teeth. From young, she had been lauded as a genius in cultivation, and had led a very sheltered life. No one had ever dared speak to her like that. The disdain and mockery from Zhou Weiqing’s words were extremely clear, and her anger rose to the maximum.</p><br/><p>Tipping her staff forward, she pointed it directly at Zhou Weiqing. Instantly, a blue light flashed out, and an ice cone formed instantly, flying towards Zhou Weiqing’s chest.</p><br/><p>This was no ordinary Ice Spike Stored Skill. Its length was more than one chi, and when it flew, a powerful icy cold burst forth. At the same time, Xuan’er’s right leg kicked out at a distance towards Zhou Weiqing, and a strange blue circle of ice flew out, moving along the ground towards Zhou Weiqing’s legs.</p><br/><p>The circle of ice was extremely sharp, perhaps its destructive capabilities were far beyond even the ice spike.</p><br/><p>Facing the two attacks, the lazy smile on Zhou Weiqing’s face did not change. With a lazy swipe of his right hand, a faint silver light flashed out, and the two Skills that were just about to reach him just vanished into thin air, not a trace of them remaining.</p><br/><p>Zhou Weiqing laughed heartily and said: “Such a little girl, but such a fiery temper. In the future, who would dare marry you?! Let me help your family teach you a little lesson alright. This is after all someone else’s inn, it won’t be good to destroy their things, we’ll have to pay for damages!”</p><br/><p>Zhou Weiqing’s words might have caused Xuan’er to rage, but at the same time, her heart gripped in shock and fear. The instant that Zhou Weiqing had taken action, his Heavenly Jewels had released. The Icy Jade Physical Jewels of Strength were familiar, but on his left wrist, a strange red gemstone that glowed with a brilliant light… something that she had never seen before. What was that? Fire Attribute? No… that did not look correct. Furthermore, he had clearly used a Spatial Attribute Skill just now!</p><br/><p>Currently, the two were still fighting, so Xuan’er quickly dismissed her thoughts. Her attacks did not stop or slow down at all, as she pushed her staff forward in front of her, a row of ice spikes appeared one after the other… nine in total. At once, they flew towards Zhou Weiqing simultaneously, each of them directed at different vital points of the body.</p><br/><p>Zhou Weiqing’s expression remained impassive. Once again, he just lifted a hand, waving it in a strange arc. Another silver light flashed in the air, forming an arc for an instant, and the nine Ice Spikes just disappeared like that again.</p><br/><p>What kind of Skill was that? The youths who accompanied Xuan’er were all stunned silly. Zhou Weiqing’s actions were just too weird… seeming to disperse all of Xuan’er’s attacks with such ease.</p><br/><p>Xuan’er’s surprise had to be the greatest. This time, the staff in her hands lanced down onto the ground. Instantly, a layer of icy blue light began to spread. At this time, Zhou Weiqing no longer wanted to play around and tease her. Waving his right hand in the air, Xuan’er suddenly felt the hair of her entire stand as fear gripped her. Subconsciously, her body flashed backwards. Right where she had been standing, a silver circle of light appeared silently, the entire air and light around there warping in a violent turbulence. Without question, if she had stayed in that position, perhaps her head would have been separated from her shoulders.</p><br/><p>“Your senses aren’t too bad at all. However, if I had been trying to hide the position from you, you would not be able to discover it. Alright, enough already.”</p><br/><p>Zhou Weiqing waved his right hand once more. Another flash of silver light, and the icy cold aura that had been spreading seemed to meet a strange suction force, disappearing once more. Xuan’er could clearly sense the Heavenly Energy in her body lurch and fall, as if being drawn away by some strange force, and a large chunk disappeared at once.</p><br/><p>After showing that, Zhou Weiqing just turned around and headed back towards his table.</p>\n</div>"}