{"title": "Chapter 625", "id": 625, "volume": 7, "url": "http://boxnovel.org/heavenly-jewel-change-chapter-625", "volume_title": "Volume 7", "body": "<h1>Chapter 625</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>Seeing the Fei Li Battle Team’s insignia on their resting room, Zhou Weiqing suddenly felt his heart grow warm and fervent.</p><br/><p>By now, the entire ZhongTian Plaza was filled with crowds of people, an audience that was literally awash with countless bodies. Cheers, shouts, even screams rose and fell, and the entire scene was extremely lively and bustling with excitement.</p><br/><p>In such an atmosphere, any participant would easily feel their blood boil with excitement. Zhou Weiqing was no exception. Here, he had once helped the Fei Li Empire to fight for and win the greatest achievements and honour. It was also at that time that he had said he would lead the Heavenly Bow Empire Battle Team to this stage, to prove the power of their Empire. Now, he had done it… he was really here again, with his Heavenly Bow Battle Team, bringing their hopes and resolve towards the championship.</p><br/><p>Taking a deep breath, taking in the air filled with the smell of smoke, Zhou Weiqing instantly forgot all about the betting. His gaze froze upon the fighting ring, and his fighting spirit raised instantly.</p><br/><p>Tian’er and Zhou Weiqing’s hearts were linked due to their constant cultivating of Saint Energy together. Naturally, she could sense the sudden change in his feelings. Grasping his hand, feeling the sudden sweat in his palms, she thought to herself: Little Fatty, you can do it.</p><br/><p>“Get out of the way.” A cold voice suddenly rang out behind the two of them. Zhou Weiqing and Tian’er subconsciously turned back to look, only to see a battle team dressed in red behind them.</p><br/><p>The fresh blood red of the battle team’s uniform could easily stimulate one’s eyes. The one at the front of the team was a young man, an icy cold aura belying the fiery hot eyes he had. The strange mix of heat and ice was easy to give others a wrong sensation.</p><br/><p>Zhou Weiqing pulled Tian’er back, stepping aside to give way. The battle team members dressed in red did not even look at them as they passed by them with grand steps, headed towards the resting house in the centre.</p><br/><p>“It’s the Dan Dun Battle Team, looks like they have changed their team uniforms.” Zhou Weiqing instantly recognized his old foes, as Shen Little Demon was walking at the fourth position in the team.</p><br/><p>It had been a few years since he had last seen Shen Little Demon, and she now looked to no longer have the impetus and rash character she had in the previous tournament, with a hint of maturity now. From her looks she was actually married now! Shen Little Demon was not young anymore, for a girl to be near the age of thirty, how could she not marry?</p><br/><p>Tian’er pursed her lips, saying disdainfully: “Aren’t they just the Blood Red Hell, look at how arrogant they are. Hmph!” She had never been one to back down, and she was currently not in a good mood at all.</p><br/><p>Zhou Weiqing grinned and said: “It looks like I truly have fate with this Dan Dun Empire! We’ll take care of them when it is their turn to fight us. For now, we need to stay low, we need to earn as much as possible. We will meet them in the sixth round, at that time, we will vent our anger.”</p><br/><p>As he said that, his gaze turned to the resting room of the ZhongTian Empire. Alas, he did not see any sign of the three Shangguan Sisters at all. In fact, only four members of the ZhongTian Battle Team were there, none of them familiar to him at all. From the look of things, the three Shangguan Sisters were not intending to come today.</p><br/><p>As usual, the ZhongTian Battle Team was the first to fight, and their opponent would be the Kalise Battle Team. Naturally, with such a calibre of opponent, the Shangguan Sisters would not even have a chance to take action.</p><br/><p>The Heavenly Bow Battle Team’s rest house was at one of the most remote corners. After all, it was the first time they were attending the Heavenly Jewel Tournament. When Zhou Weiqing and Tian’er entered the rest house, the rest of the team had already gathered.</p><br/><p>Zhou Weiqing and Tian’er were pretty much some of the latest of all the competitors. Not long after they entered the rest house, the ZhongTian Emperor Shangguan Tianxin stood up at the VIP stand, proclaiming the start of the entire Tournament along with loud cheers from the audience. This year’s Heavenly Jewel Tournament’s chief judge was still the ZhongTian Empire Skill Storing Palace’s Palace Master, Shangguan Longyin.</p><br/><p>Normally, the first round of the Heavenly Jewel Tournament always ended in the shortest possible time. That was because the first round would always be the seeded team of the particular group.</p><br/><p>For the first group, the ZhongTian Battle Team stepped forward, and the Kalise Battle Team directly surrendered without a fight.</p><br/><p>As for the other three groups, the same scene occurred except for the Fei Li Empire’s group. However, their opponent was merely a Battle Team from a small Empire, and with the leadership of the powerful brother sister team of Ye Paopao and Ye Xuan, they quickly won their fight.</p><br/><p>Very quickly, the second round began.</p><br/><p>Shangguan Longyin’s rich voice rang out. “First stage, First Group Second Round. Heavenly Bow Battle Team vs Mi Ou Battle Team. Both sides, please send your first fighter to the stage. Judge, to the stage.”</p><br/><p>According to the lots drawn, the Heavenly Bow Battle Team would be fighting in the second fight for the first group. Instantly, Yun Li bounced to his feet, ready to head out. However, Zhou Weiqing grabbed hold of him, preventing him from walking out.</p><br/><p>“What?” Yun Li asked Zhou Weiqing curiously. “Didn’t you say I will be the one to fight first every round?”</p><br/><p>Zhou Weiqing shook his head and said: “Not this round. Ma Qun, you go first. Xixi, you will fight second. For the third fight both of you go together. Do not use your Heavenly Energy, wear your full heavy armour.”</p><br/><p>Zhou Weiqing’s instructions were simple but extremely clear.</p><br/><p>Upon hearing those words, Ma Qun was delighted. He had always been a person who loved to show off, and he had been yearning to join this Heavenly Jewel Tournament for such a long time. As soon as he heard Zhou Weiqing wanting him to lead the fight, he instantly charged out with an excited look on his face.</p><br/><p>With a bounce of his feet on the ground, he leapt directly onto the stage.</p><br/><p>As for the Mi Ou Battle Team, the one who walked out was a youth of about twenty six or twenty seven. The entire Mi Ou Battle Team was also no longer the same as three years ago, with pretty much everyone changed, and Zhou Weiqing had not seen this youth who had walked out before.</p><br/><p>Crow sat by Zhou Weiqing’s side, laughing heartily as she said: “I still remember… the previous time when we were representing the Fei Li Empire… our first round was also against the Mi Ou Empire. What fate we have together!”</p><br/><p>Zhou Weiqing smiled faintly, but remained quiet. In truth, against the Mi Ou Battle Team, he did not feel like they would be any under any stress.</p><br/><p>On the rostrum, Shangguan Longyin glanced naturally to the side of the Heavenly Bow Battle Team rest house. Looking at the entire team wearing their bamboo hats low even in the room, his mouth twitched slightly momentarily, the flicker of a smile in his eyes. Clearly, he knew who was part of the Heavenly Bow Battle Team.</p><br/><p>On the stage, the judge said solemnly: “Both sides, introduce yourself.”</p><br/><p>Ma Qun stretched his powerful muscles, shouting out loud: “Heavenly Bow Empire, Ma Qun.”</p><br/><p>When the youth from the Mi Ou battle Team saw Ma Qun’s size and stature, he was given a small fright. His own 1.8 metres height was not considered short, but he only barely came up to Ma Qun’s chest.</p><br/><p>“Mi Ou Empire, Qian Shu.”</p><br/><p>The judge continued: “The rules of the fight are simple, both sides can attack at will, any weapons are allowed. However, if you are fighting as a Beastmaster, you cannot use any Consolidated Equipment or Stored Skills. Once the enemy surrenders, you cannot continue attacking. Understood?”</p><br/><p>Both sides indicated they understood, but just as the judge was about to proclaim the start of the fight, he was suddenly stopped by Ma Qun. “Judge, sorry, could we wait a moment.”</p><br/><p>The judge started momentarily, saying: “Do you have any other questions?”</p><br/><p>Ma Qun said: “I forgot to wear my armour below. Can I still wear it now?”</p><br/><p>The judge’s face darkened, but he said: “Why didn’t you prepare before the fight? That’s what a schedule is for! Hurry up.”</p><br/><p>The Heavenly Jewel Tournament rules allowed any weapons or armour, and he could not stop him.</p><br/><p>Originally, the youth called Qian Shu was a little nervous upon seeing Ma Qun’s huge size, but he laughed out loud directly at that. In truth, most of the competitors joining the Heavenly Jewel Tournament would be depending on their Consolidated Equipment, and for Ma Qun to request to wear armour, wasn’t that revealing that his cultivation level wasn’t sufficient? In that instant, the fear and worry in his heart lowered by more than half, converted to excitement. If he could gain a first victory for his Empire, it was an honour for any team member.</p><br/><p>However, very quickly, that smile froze on Qian Shu’s face.</p><br/><p>Ma Qun stood on the stage, right in front of millions of audience as he took out his heavy armour piece by piece, wearing it as quickly as he could.</p><br/><p>Let alone the judge and Qian Shu on the stage, even the honoured guests on the VIP audience stand were staring, stunned.</p><br/><p>What kind of armour was that!? It was more than half chi thick all around, and more so, when Ma Qun had placed the entire armour on the competition stage, it caused a clear loud thumping sound, even causing reverberations throughout.</p><br/><p>How heavy did that armour have to be for something like that to happen?</p><br/><p>By the time Ma Qun finished wearing his heavy armour, all the onlookers couldn’t help but feel their hearts wrench. Ma Qun’s height and stature was immense enough, and with the entire body of Heavy Cavalry Armour, he was like a single moving steel fortress. Standing there, even without releasing his Heavenly Energy or a hint of aura, he already exuded an incomparable pressure. Standing in front of him, Qian Shu looked like a little lost sheep, as if he could be swallowed by this immense monster in front of him.</p><br/><p>After wearing his armour, Ma Qun grinned and said: “Peerless Regiment Cavalry, Transformation Complete. Judge, I am ready.”</p><br/><p>Qian Shu stared blankly at the judge. “He… Is… Is that not against the rules? Isn’t that armour just too massive?” From Ma Qun’s armour, he could sense a thick cold aura, and he was truly suspicious that if his own attacks could even get through that thick armour.</p><br/><p>The judge’s heart was also twisting inside, but the Heavenly Jewel Tournament rules had never prevented anyone from using any weapon or armour!</p><br/><p>“Competitors can use any weapons or armour. If you wish to wear armour now, you can do so. If you do not require it, I will proclaim the start of the match.”</p><br/><p>Qian Shu could only resign himself to his fate. Since he had been chosen by the Mi Ou Empire, he was also one of the top of the generation, and he quickly calmed himself down, shaking himself free from the shock as he nodded towards the judge.</p><br/><p>As the judge proclaimed the start of the match, the historical first fight of the Heavenly Bow Empire in the Heavenly Jewel Tournament finally began.</p><br/><p>Qian Shu swiftly released his Heavenly Jewels. As the vanguard fighter of the Mi Ou Battle Team, his cultivation level was not weak. Four Heavenly Jewels appeared respectively on his right and left wrists, with his Physical Jewels the Dragonstone Jade of Agility, and his Elemental Jewels the Emperor Sapphires of the Water Attribute.</p><br/><p>Pressing his hands together, his arms were instantly covered with Consolidated armour. It was a small set of two Consolidated Equipment pieces, in a thick blue light and the assistance of his Consolidated Equipment, a pair of ice blades formed in his hands, each three chi long. Facing Ma Qun’s body which looked like a massive armoured fortress, he did not try to retreat, instead charging forward in a flash, instantly reaching Ma Qun’s side, the ice blades swiping down at him.</p>\n</div>"}