{"title": "Chapter 639", "id": 639, "volume": 7, "url": "http://boxnovel.org/heavenly-jewel-change-chapter-639", "volume_title": "Volume 7", "body": "<h1>Chapter 639</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>Although he had managed to prevent the rapier from hitting his throat, Noris’ attack still managed to land on his shoulder. Even the thick Frozen Steel armour was not able to perfectly block a full powered blow from a six-Jeweled powerhouse, and the rapier pierced right through. There was even smoke emitting from the wound, clearly showing the corrosive nature of the Darkness Attribute attack.</p><br/><p>Ma Qun howled in pain, as if a wounded beast. Flying into a rage, he swung the spiked mace in his right hand towards Noris as he charged forward.</p><br/><p>In a single engagement, he had already suffered a serious injury. In the audience’s eyes, Ma Qun had no hopes of winning. Currently, he was just like an arrow at the end of its flight, fighting desperately with the last bit of spent force. The difference between four Jewels and six Jewels was just too huge. Even those seeded team members, they felt that after Ma Qun’s heavy armour had proven insufficient to defend him, it was clear that Ma Qun was no match for Noris.</p><br/><p>For the Bai Da Battle Team to send Noris out in the first match, it was after deep thought. The reason was simple, his rapier was actually the most adept at breaking through the powerful defense that so many of the Heavenly Bow Battle Team members favoured. No matter if the Heavenly Bow Battle Team sent out any of the three Heavy Armoured warriors, they would be countered by Noris. Gaining the first victory would definitely be a good method of raising their morale for the rest of the matches.</p><br/><p>From the way things were progressing, it seemed like this plan of the Bai Da Battle Team was successful. Alas, they had not been watching the rest of the Heavenly Bow Battle Team members’ expressions in their rest house.</p><br/><p>Yun Li’s expression was anxious and urgent, and Xixi’s brow was furrowed deeply. On the other hand, the one should have been most worried, Crow, was smiling, her previous anxiety seemed to have vanished totally.</p><br/><p>As Ma Qun’s wife, who could understand Ma Qun and his abilities more than her? In terms of pure combat capabilities, it was definitely true that Ma Qun was no match for Noris, after all the gap in cultivation level was there. However, losing in just a single engagement, in such a miserable fashion… that was definitely impossible. If that was really the case, how could Zhou Weiqing be willing to allow Ma Qun to join the Heavenly Jewel Tournament?</p><br/><p>Noris did not know what Crow was thinking, nor would he have cared. Having succeeded in his first strike, his eyes were filled with bloodlust, glowing brightly in excitement.</p><br/><p>These few days, the dominating performance of the Heavenly Bow Battle Team had given him a rather suppressed feeling. He knew that in terms of overall power of the entire team, their Bai Da Battle Team was definitely no match for the Heavenly Bow Battle team. However, that did not mean they would have no chance at all. In the history of the Heavenly Jewel Tournament, there were many examples of weaker teams beating stronger teams. Wasn’t the Fei Li Battle Team in the last tournament a perfect example of that? As such, he had planned a specially tailored counter strategy to the Heavenly Bow Battle Team for today’s fight. Even if they were to lose, he did not want the Heavenly Bow Battle Team to have a good time.</p><br/><p>Seeing Ma Qun still charging at him while howling in pain, without any style or reason, Noris gave a cold smirk. In a flash, he stepped to the left besides the spiked club that Ma Qun had left behind. The rapier in his hands flashed out like the fang of a venomous snake, striking out at Ma Qun’s jugular vein.</p><br/><p>Although his speed was not particularly fast, with his six-Jeweled cultivation level, no matter how anyone looked at it, he was definitely faster than Ma Qun, especially since Ma Qun was now wounded, and his left side defense was the weakest. Noris did not plan on delaying any further, not even wanting to give Ma Qun the chance to surrender, hoping to kill him swiftly. He was even imagining after he killed Ma Qun, he would not let his corpse off, destroying it fully.</p><br/><p>Ma Qun’s charging body stumbled slightly, barely sliding to the side and dodging the incoming rapier. At the same time, the remaining large spiked mace swept savagely towards Noris’ head.</p><br/><p>Once again, a mocking disdain flashed in Noris’ eyes, followed by a cold light. The Slowing Curse appeared once more, causing Ma Qun’s body to further slow down. Simultaneously, his rapier chased Ma Qun towards his heart.</p><br/><p>As Ma Qun had barely dodged the blow to the throat earlier, his body was mostly greatly imbalanced now. This current sword blow, he was definitely in no position to dodge it any longer. In Noris’ eyes, once he pierced through his opponent’s heart, he would still have the time to dodge Ma Qun’s mace, and he would not even be touched.</p><br/><p>When anyone felt he was in a sure win position, their spirit would relax slightly. This was a phrase that Zhou Weiqing had told Ma Qun a long long time ago.</p><br/><p>The confused, muddled and bloodshot eyes of Ma Qun suddenly lit up. “DIE!” This time, his shout was not crazed, instead filled with an overbearing tyranny.</p><br/><p>Right in that instant, the presence and aura of Ma Qun burst forth, a sensation that was fully different. The huge spiked mace whistling in midair that had been slowed by the Slowing Curse abruptly sped up, much faster than even his usual speed. A thick yellow light erupted from his body, and at the same time, his injured arm which had been flopping uselessly at the side suddenly lifted up, holding up an unbelievably thick shield in front of his chest.</p><br/><p>All of this had been accomplished by Ma Qun in the blink of an eye, and he had only done so when the black rapier was less than one chi from his chest. At this point, Noris no longer had any chance to change his strike.</p><br/><p>A terrifying energy reverberation blew up. The current Ma Qun gave everyone the impression that he was an exploding volcano.</p><br/><p>*Puuu* A soft sound rang out. Even though Ma Qun had burst forth with an abrupt speed, even breaking free of the Slowing Curse… Noris’ attack still struck first, piercing savagely into the shield in Ma Qun’s hands.</p><br/><p>Alas, just as the rapier and shield came into contact, Noris’ eyes were filled with shock and disbelief.</p><br/><p>It did not pierce through fully… not fully through…! Furthermore, a sudden powerful suction force began to drag upon his rapier, forcefully holding it in place, preventing him from pulling it back.</p><br/><p>The next instant, another *Puuu* sound. The massive spiked mace, glowing with a thick earthen yellow colour, smashed into Noris’ head.</p><br/><p>Noris was not wearing a helmet, and everything happened in just a split second. Just as he realised something was wrong, the rapier had pierced into the shield, and in the moment he was shocked, the large spiked mace came into intimate contact with his head.</p><br/><p>Blood. Like a beautiful fountain of fireworks, made its appearance on the stage.</p><br/><p>Imagine a watermelon being split by a giant hammer? In midair?</p><br/><p>Currently, Noris’ head was that exact watermelon. White, red… grey? Even some unknown colours, spraying everywhere in midair. At the same time, the rest of his body was sent flying, slamming hard onto the ground outside the stage.</p><br/><p>Ma Qun staggered back several steps on the stage before he finally regained balance. Although Noris’ final blow had not broken through his shield, it did contain the full power of his six-Jeweled cultivation level and a strong piercing force, and he could only diminish it slowly as he staggered back.</p><br/><p>The Consolidated Shield in his hands vanished, and a powerful angry howl rang forth from Ma Qun as he gave vent to all his feelings. His right hand lifted up the massive spiked mace, still covered with blood and brains, as if he was a god of war.</p><br/><p>Below the stage, the audience could only stare in stunned silence. The fight had ended just too abruptly. In the eyes of the ordinary audience members, they had barely blinked a few times before it ended.</p><br/><p>No one could have expected that the ending would be such an abrupt reversal, and in such a strange fashion. Ma Qun had actually won, and he had even managed to totally smash Noris’ head into bits.</p><br/><p>“Well done!” Zhou Weiqing jumped up in the Rest House, gripping his fists savagely.</p><br/><p>He had been too agitated, and his sudden movement caused the bamboo hat to fly off his head.</p><br/><p>Zhou Weiqing was extremely clear how Ma Qun had won. This entire battle could be said to have been planned and executed perfectly by Ma Qun, all part of his calculations.</p><br/><p>From the start, Ma Qun had already come up with a complete plan. As soon as they exchanged blows, he purposely accepted a blow, purposely misleading Noris, allowing him to think that Ma Qun only knew how to fight brainlessly. Furthermore, he had ‘lost’ one of his spiked maces, and that naturally meant a drop in his combat prowess.</p><br/><p>What followed next was all guided by Ma Qun step by step, fully bringing Noris into his trap… all the way to the end when Noris no longer had any chance of changing his attack, only then did Ma Qun burst forth with all his power.</p><br/><p>An ordinary four-Jeweled Heavenly Jewel Master could not possibly block the full powered blow of a six-Jeweled Heavenly Jewel Master with a single shield. However, Ma Qun’s shield was a four-Jeweled Assembly Set Shield. Even for a six-Jeweled Heavenly Jewel Master, how could he pierce through it fully so easily?</p><br/><p>Originally, Lin TianAo’s six-Jeweled Assembly Set Shield had managed to even block a single blow from the Heavenly King Assassin without dying. From that alone, one could imagine the sheer defensive capabilities of this Assembly Set.</p><br/><p>Furthermore, at that very instant, Ma Qun had unleashed the full power of his bloodline powers, entering the Berserk state, which allowed him to break free of any Curse or Sealing Skills. Of course, the gap between them couldn’t be too huge. Luckily, the Slowing Curse wasn’t a very powerful Skill, and it was easily broken.</p><br/><p>In the Berserk state, that severely damaged left arm was still barely able to move. At the same time, the huge spiked mace infused with Earth Attribute Heavenly Energy… how could Noris’ head defend against it?</p><br/><p>Noris’ death was truly not a worthwhile death. He still had so many Skills he had not used, but he had just died like that to Ma Qun’s spiked mace.</p><br/><p>On the side of the Bai Da Battle Team, all the team members’ eyes reddened, and they were about to charge up to pit their lives against Ma Qun, but they were stopped by the ZhongTian guards. Before this fight had even started, the ZhongTian Empire had already made preparations. They knew that the clash between the Heavenly Bow Empire and the Bai Da Empire would definitely not be a calm or easygoing fight, and the facts had proved their preparations were indeed a good choice.</p><br/><p>“It… it’s him… it’s actually him?!” Right at the same time, in the Dan Dun Battle Team rest house, Shen Little Demon exclaimed in shock, her expression extremely ugly. When she saw Zhou Weiqing’s bamboo hat fly off his head, she finally understood why she kept having a sense of familiarity towards this Heavenly Bow Battle Team.</p><br/><p>“It’s Zhou Weiqing! That Zhou Weiqing who brought the Fei Li Battle Team to victory in the previous Heavenly Jewel Tournament!” Shen Little Demon’s grew urgent and laboured as she exclaimed.</p><br/><p>It could be said that her hate for Zhou Weiqing was as high as the skies, with a hint of complicated feelings. In the previous Heavenly Jewel Tournament, she had lost to Zhou Weiqing, and because of that the Dan Dun Battle Team that she led was knocked out of the finals. It was this Zhou Weiqing who had used that strange tri-attribute venom to almost kill her, but he had also saved her life under the persuasion of the ZhongTian Empire.</p>\n</div>"}