{"title": "Chapter 637", "id": 637, "volume": 7, "url": "http://boxnovel.org/heavenly-jewel-change-chapter-637", "volume_title": "Volume 7", "body": "<h1>Chapter 637</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>Zhou Weiqing brought Tian’er wandering through the streets, swerving through alleys and corners before they finally reached a rather luxurious hotel. Entering the lobby, they headed directly to the stairs on the side and headed to the third floor.</p><br/><p>Standing at the third floor, Zhou Weiqing thought for a moment before grinning at Tian’er. The next instant, a powerful Heavenly Energy reverberation spread out from his body.</p><br/><p>Only Jewel Masters would have an obvious sense to such a Heavenly Energy reverberation. Any normal person, even if they were standing right next to him, would not feel anything.</p><br/><p>A few seconds after Zhou Weiqing released the Heavenly Energy reverberation, one of the doors at the end of the corridor opened abruptly, a figure appearing from the room. It was the Geritimo Battle Team member with the Spiritual Body of Earth, Yuling.</p><br/><p>Her original stable presence was currently disrupted, and her eyes were bloodshot. Seeing the pair of Zhou Weiqing and Tian’er at the stairs, wearing a bamboo hat, she immediately howled angrily: “You are here to finish the job? Exterminate us? I’ll give you a fight!”</p><br/><p>As she said that, a thick Earth Attribute Heavenly Energy burst forth from her body.</p><br/><p>“Don’t misunderstand, we are not enemies.” Zhou Weiqing quickly said, removing the bamboo hat from his head.</p><br/><p>Yuling’s aura stalled momentarily, but she continued staring at them with a wary look.</p><br/><p>Zhou Weiqing laughed heartily and said: “I am the Heavenly Bow Battle Team leader, Zhou Weiqing, also known as Zhou Little Fatty, the one who fought with your brother the other day. Today, we saw your brother injured by those Dan Dun Battle Team fellows, and we are here specially to see if we can help in any way.”</p><br/><p>Although Yuling did not recognize Zhou Weiqing, when he revealed his face she could see that he was not the anticipated enemy she had imagined. Her face relaxed slightly, but she said coldly: “What else is there to see… my brother… my brother… he… he is almost dying.” As soon as she said that, tears started pouring down her cheeks.</p><br/><p>Zhou Weiqing was caught by surprise, and he quickly stepped towards Yuling. “Quick, bring us to have a look. Who knows, we might be able to save him.”</p><br/><p>Yuling clearly did not trust Zhou Weiqing, and she did not have the intention of letting them in. Just as she was about to stop them, Tian’er lifted a hand, and a brilliant gold light appeared around her palm. Passively, she said: “If there are any wounds that even I am unable to cure, only then can you determine that your brother will perish.”</p><br/><p>Yuling was knowledgeable and experienced indeed, and as soon as she saw the gold light in Tian’er’s hands, a strong light of surprise and delight flashed in her eyes. “This… this is the Divine Attribute? Please, come in.” She quickly opened the door, allowing Zhou Weiqing and Tian’er to enter.</p><br/><p>In the room, the surviving members of the Geritimo Battle Team were gathered there, their expressions grief stricken. Yu Yun lay silently on the bed, his face pale and his breathing weak. One of the team members with the Water Attribute was standing beside him, constantly releasing healing skills on Yu Yun, trying to keep him alive and heal him.</p><br/><p>“Team Leader Zhou…” Yuling was about to say something but Zhou Weiqing lifted a hand to stop her. “No need to say anything else, saving him is more important. Tian’er?”</p><br/><p>Tian’er nodded and walked to the side of the bed. Yuling quickly pulled the teammate with the Water Attribute healing Yu Yun to the side, saying something in a low voice into his ear.</p><br/><p>Tian’er sat down beside the bed, placing her palm on Yu Yun’s chest. A faint gold light spread out. Using the Divine Attribute meant that she had to unleash her Heavenly Jewels.</p><br/><p>Yuling and the other team members could clearly see the seven sets of Heavenly Jewels around Tian’er’s wrists, and their faces were immediately filled with shock.</p><br/><p>That day, having lost to the Heavenly Bow Battle Team, in truth many of them were still rather unreconciled towards that result. All the way, up until the point he had lost to Zhou Weiqing, Yu Yun still did not know how he lost the fight, only vaguely sensing that Zhou Weiqing had used a skill that perfectly countered him.</p><br/><p>However, now they understood that the Heavenly Bow Battle Team actually still had another powerful team member who hadn’t fought that day. Seven Jewels… Divine Attribute? What did that mean? In their impression, they had only heard that the Divine Attribute belonged only to the Heavenly Snow Mountain. Even for the WanShou Battle Team members, none of them had the Divine Attribute. After all, they were not core bloodline members of the Heavenly Snow Mountain. A Lower Level Zong Stage powerhouse with a Saint Attribute, one could not use simple levels to measure them.</p><br/><p>A faint gold light covered Yu Yun, causing his pasty white face to look like a piece of gold paper.</p><br/><p>Tian’er’s brow furrowed slightly. After a moment, she said solemnly: “His wounds are extremely serious, even his internal organs are on the verge of breaking down. Furthermore, there is a very strange Heavenly Energy reverberation in his body, and… it isn’t any known Attribute that I have seen or heard of.”</p><br/><p>Yuling quickly interrupted: “That’s exactly it, the reason why Brother isn’t able to recover despite all our efforts. Originally, we just thought Brother had sustained severe injuries, but we weren’t too worried. However, when we got back, we realised it wasn’t so simple. We even invited some healers from the ZhongTian Empire to help Big Bro heal, but it is that strange unique energy filled with some destructive powers that remain in his body, and even those ZhongTian healers were not able to do anything. Senior Shangguan Longyin even personally went to look for the Dan Dun Battle Team to help, but they refused to do so. Our two Empires are already mortal enemies.”</p><br/><p>A cold light flashed in Zhou Weiqing’s eyes, and he looked at Tian’er, asking: “Can you heal it?”</p><br/><p>Tian’er nodded at Zhou Weiqing, but secretly, she said in voice transfer: “I think it can only be done if we use the Saint Energy. Our Saint Energy is above all other Attributes, and with its support, there should be no problem.”</p><br/><p>Zhou Weiqing said: “Alright, then go ahead. I will support you.”</p><br/><p>Tian’er extended her other hand for Zhou Weiqing to hold. As the other Geritimo Team members looked on in puzzlement, a strange energy began to gather around their hands.</p><br/><p>When Zhou Weiqing and Tian’er circulated their Saint Attributes, forming the Saint Energy whirlpool, it meant that when they used the Saint Energy there would not be an actual loss of it, and the Saint Energy would eventually recover. However, if they used it individually, when too much was used, it could possibly lead to a permanent loss of the used Saint Energy.</p><br/><p>Currently, their individual Saint Energy was barely fifty drops, and they naturally weren’t going to waste it easily. It was just too difficult to cultivate the Saint Energy.</p><br/><p>The large Saint Energy whirlpool appeared silently within Zhou Weiqing, and he infused Saint Energy. A thick gold light rose, and in an instant the entire room was filled with the divine aura. Although Tian’er was still wearing the bamboo hat and just simply seated there, all of the Geritimo Battle Team members suddenly felt a sensation like they should be paying homage to her. That aura and presence, it was as if they were at a whole different level.</p><br/><p>With the infusion of the Saint Energy and the Divine Attribute Healing Skills, Yu Yun turned a gold hue, his shattered innards beginning to heal and reknit themselves at an astonishing rate. The strange, unknown energy that was rampaging through his body was slowly forced by Tian’er into a single area, at last gathering in his left arm.</p><br/><p>With a soft sound, Yu Yun’s left arm sleeve split apart, and they could all clearly see circles of bright purple light fluctuating there.</p><br/><p>“Weiqing.” Tian’er gave a low shout.</p><br/><p>Zhou Weiqing immediately understood, using his other hand to grasp that glowing spot of Yu Yun’s arm. Instantly, he activated the Devour Skill, and that strange energy filled with destructive power began to be drawn out of Yu Yun.</p><br/><p>As soon as the energy entered his own body, Zhou Weiqing shuddered slightly. He could clearly sense that this unknown energy was filled with a destructive and negative aura. Indeed, destruction. If Zhou Weiqing had to give this unknown energy a name, it would definitely be the Destruction Attribute.</p><br/><p>This Destruction Attribute had a powerful explosively offensive power, almost a calamitous destructive capability, as if the only thing it was good for was to destroy things. Even as Zhou Weiqing used this strongest Skill of the Demonic Attribute, the Devour Skill, to receive it, he felt as if the Devour Skill was being broken apart from within, with slight cracks even appearing. Although it was minor, rather weak even, but It had to be known that this Destruction Attribute was just a remnant energy, not unleashed as part of an attack, and Zhou Weiqing was still in the midst Devouring it. For it to have such an effect, one could just imagine how powerful this Attribute Energy really was.</p><br/><p>However, as soon as this Destruction Attribute entered Zhou Weiqing’s body, it could no longer continue its overbearing arrogance. In front of the large Saint Energy whirlpool, it could only panic, trying to escape, but how could the Saint Energy whirlpool give it the opportunity.</p><br/><p>Very soon, it had been transformed into part of the Saint Energy whirlpool, and Zhou Weiqing was surprised to discover that this tiny bit of Destruction Attribute energy had actually turned into five whole drops of Saint Energy! It was just a tiny portion of Destruction Attribute Energy, yet it could actually transform into such an amount. Immediately, Zhou Weiqing realised that this Destruction Attribute was at the same level as the four Saint Attributes, perhaps even slightly higher.</p><br/><p>Zhou Weiqing was fully immersed in his own senses, but at the same time, the Divine Attribute of Tian’er was nourishing and healing Yu Yun’s body, boosted by the Saint Energy.</p><br/><p>By the time the gold light slowly dissipated, Yu Yun’s breathing had stabilized, and his face had recovered some of its colour. He had lapsed into a proper sleep.</p><br/><p>Without Zhou Weiqing or Tian’er’s reminder, Yuling and the others knew that Yu Yun would be fine. In her excitement, Yuling was about to step forward and kneel to them, but she was stopped by Tian’er. At that point, Zhou Weiqing also broke out of his reverie.</p><br/><p>“Lady Yuling, there is no need for that. To be honest, although we are not familiar with each other, the Dan Dun Empire and Bai Da Empire are our common enemies. As the saying goes, the enemy of my enemy is my friend, and I hope that we have the chance to help each other against our common enemies in the future. Today can be considered a good start to that. Your brother should be fine now. When he wakes up, please let him know that I will definitely ensure what I promised to him. I will not allow the Dan Dun Battle Team to advance into the top eight and beyond. If you all have any other difficulty in the future, please do come look for us. Our Heavenly Bow Empire is currently situated in the Crescent City.”</p><br/><p>Yuling said gratefully: “I really do not know what to say to this. You both have saved my brother, and such a great kindness, we will never forget it, and remember it deeply in our hearts.”</p>\n</div>"}