{"title": "Chapter 644", "id": 644, "volume": 7, "url": "http://boxnovel.org/heavenly-jewel-change-chapter-644", "volume_title": "Volume 7", "body": "<h1>Chapter 644</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>Although they were faced off in a fight, all this time Zhou Weiqing had been pondering where this Destruction Attribute had actually come from. After all, creating an entirely new Attribute, even a Heavenly God Tier powerhouse could not possibly do so. For the Blood Red Hell to suddenly come up with a new legacy, that of the Destruction Attribute, how could he not feel strange about it?</p><br/><p>Just as TianFeng and TianMa released their Legendary Sets, in the next instant, both Zhou Weiqing and Tian’er had no choice but to release their own Consolidated Equipment. If they did not do so, perhaps the two brothers with their Legendary Sets could use that moment of advantage to launch their attacks.</p><br/><p>Another series of dark-gold lights flashed in swift succession, causing all the battle teams watching below, especially those from smaller empires, as well as the audience, to stare in shock.</p><br/><p>Has God Tier Consolidated Equipment become common goods? How many bouts of lights was it this time? Another eleven dark-gold shield of lights flashed above the pair. If both sides were added up, that was already twenty six God Tier Consolidated Equipment!</p><br/><p>Zhou Weiqing’s ‘Hate Ground no Handle’ Legendary Set was still currently two pieces, as his Overlord Bow was not part of his Legendary Set.</p><br/><p>On the other hand, Tian’er had six pieces of her Legendary Set, as her seventh Jewel was broken through after she left the Heavenly Snow Mountain, and she would need to return before she could gain the Consolidating Equipment Scrolls for the next piece.</p><br/><p>Zhou Weiqing held his dual Legendary Hammers in his hands. Compared to him, Tian’er looked much more gentle and beautiful. If one were to describe Shangguan Xue’er’s Boundless Infinitum Set as the ultimate close combat Legendary Set in the world today, then Tian’er’s God Vanquishing Heavenly Spirit Set would be the ultimate ranged combat Legendary Set.</p><br/><p>Even for Zhou Weiqing, this was the first time he had seen Tian’er wear all of her current God Vanquishing Heavenly Spirit Set.</p><br/><p>In Tian’er’s hands, a two metre long staff appeared. Of course, due to the fact her Legendary Set was also not complete, it was dark-gold in colour, and along its dark gold length, there were many complicated tattoos etched upon it, with faint light swirling in those tattoos. At the tip of the staff, there was the statuette of an absolute beautiful lady, whose hands were raised above her head in carrying a small, fist-sized pearl. Strangely, this pearl was not dark-gold colour like the rest of the staff, instead a bright and brilliant gold colour. As soon as it appeared, it began to shine so brightly, covering the entire stage. One could clearly sense that all the various Attributes were gathering around the staff, so thick that it was almost sticky in nature.</p><br/><p>God Spirit Staff, a powerful Consolidated Weapon on the same level as the Boundless Infinitum Sword. It was because these weapons were at such a greater level that they could display a bit of their own colour.</p><br/><p>Besides the staff, a crown had appeared on Tian’er’s head, extremely beautiful and exquisite, a total of twelve spikes surrounding it, each tipped with a small gold jewel. Right in the center, there was a larger, purple gemstone.</p><br/><p>Shoulder pauldrons, chest plate, equally beautiful. Added on to Tian’er’s gloves on both hands, that was Tian’er’s current six pieces of her God Vanquishing Heavenly Spirit Set.</p><br/><p>As Zhou Weiqing was right next to Tian’er, and he had an intimate connection with both her and Shangguan Xue’er, he could vaguely sense that Tian’er’s God Vanquishing Heavenly Spirit Set seemed to be actually stronger piece by piece when compared to the Boundless Infinitum Set. However, the Boundless Infinitum Set was still ranked ahead because it was an eleven piece Set, as compared to the God Vanquishing Heavenly Spirit Set which was ten pieces.</p><br/><p>Seeing the God Vanquishing Heavenly Spirit Set appear around Tian’er, both TianFeng and TianMa’s expressions changed. TianFeng said coldly: “When has the Heavenly Snow Mountain come together with the Heavenly Bow Empire?”</p><br/><p>Tian’er said passively: “This is my own business, and has nothing to do with the Heavenly Snow Mountain. Zhou Weiqing is my man.” It could be said that she was not actually human, and compared to human females, she was not as shy regarding such matters. To declare that Zhou Weiqing was her man in front of such a massive audience, it was a matter of pride to her.</p><br/><p>When Zhou Weiqing heard her words, he was originally in a good mood. However, very quickly, he heard someone below say: “What kind of world is this, all the best cabbages are always eaten by pigs.”</p><br/><p>Zhou Weiqing scolded inwardly: Your Sister! Since when did I, Your Father, become a pig? Am I that ugly?!</p><br/><p>In the ZhongTian Battle Team Rest House, Shangguan Xue’er smiled faintly upon hearing that. At her side, Shangguan Fei’er said in admiration: “This Tian’er is really daring. Sis, would you dare to speak out like that in front of so many people? Haven’t they not married yet?”</p><br/><p>Shangguan Xue’er glared at her sister, a faint blush staining her icy-cold cheeks.</p><br/><p>Zhou Weiqing took a side step forward, using his body to block Tian’er as he spread the hammers out, his eyes turning purple. Compared to the brothers TianFeng and TianMa’s bright purple orbs, Zhou Weiqing’s was a far deeper purple.</p><br/><p>At the same time, in a *swoosh*, the pair of massive wings spread out from Zhou Weiqing’s back, and his entire aura exploded forth greatly. As he stepped forward in front of Tian’er, in that instant his own aura was able to suppress the combined aura of both TianFeng and TianMa back to their original state.</p><br/><p>Indeed, Zhou Weiqing had entered his Dragon-Tiger Transformation state, the ‘King’ word on his forehead clear and glowing, as a thick energy reverberation burst forth to the extreme fro his body. Originally the six coloured lights around him surged, forming a large light column into the skies that seemed actually solid.</p><br/><p>Both hammers streaked to the front, each forming a triangular formation which merged together, a resplendent star shaped hexagon forming before settling below his feet, glowing brilliantly. As he wings beat gently, one could even clearly see circles of the various Attribute Heavenly Energies forming rings of light, swarming into Zhou Weiqing’s body.</p><br/><p>In that instant, Zhou Weiqing had become the focal point of the entire audience, the wild and ferocious aura he gave forth could even fully suppress the eight-Jeweled TianFeng.</p><br/><p>This was the true Zhou Little Fatty in his full glory, the Zhou Weiqing who had ascended the Heavenly Snow Mountain to snatch a bride, and defeated Gu Yingbing.</p><br/><p>“Come on then. Let me see what you Blood Red Hell brothers have that you dare to come at I, Your Father.” Zhou Weiqing laughed heartily as he shouted. With the explosive aura and power that the Dragon-Tiger Transformation awarded him, he bounded forward in a single step, the Dual Legendary Hammers swinging out towards TianFeng and TianMa respectively. From the looks of things, he was actually planning to fight them alone.</p><br/><p>Those wings of his was actually not Consolidated Equipment! This was the current thought that had entered both TianFeng and TianMa’s mind. Just like how Zhou Weiqing had never seen the Destruction Attribute before, they had also never seen anyone like Zhuo Weiqing with his transformation.</p><br/><p>From Shen Little Demon, they had learned that Zhou Weiqing’s right leg was extremely dangerous, and he had the ability to control his Demonic Change State. However… this ability displayed in front of them… was it really the Demonic Change State? Even the Demonic Change State could not possibly bring up a person’s aura to such a powerful degree right? Let alone… those wings?</p><br/><p>TianMa had long since been unable to hold back. In truth, his Legendary Set did have some slight differences when compared to TianFeng, that was in his weapon. Both brothers had wings behind their backs, but when it came to weapons, TianMa was using a long spear, while TianFeng was using a longsword.</p><br/><p>As Zhou Weiqing charged forward, TianMa’s body spun in a half circle, the long spear in his hands darting out in a swift lightning strike. He totally ignored the incoming Hammers from Zhou Weiqing, instead piercing towards Zhou Weiqing’s throat.</p><br/><p>The length of his spear was far superior to that of the Dual Legendary Hammers, and this strike of his was attacking his enemy’s key points to force his attacks back. On his spear, a thick gold-red flame sprang up, glowing with the hue of the Destruction Attribute. In the blink of an eye, along with the abrupt burst of flames, his attack seemed to strike first though he had attacked later.</p><br/><p>Zhou Weiqing gave a cold humph, the hammer in his left hand subtly turning into the crying-face symbol as he spun his wrist in a light fashion, allowing it to block perfectly in the spear’s path.</p><br/><p>A massive crash, as the spear and hammer smashed into each other explosively. With Zhou Weiqing and TianMa as the center, a powerful burst of light spread out. Although TianMa was at the seven-Jeweled stage, being blocked by Zhou Weiqing, he staggered back five, six steps before regaining his balance.</p><br/><p>This was not because of a difference in Attributes or Heavenly Energy, but suppression of pure strength. Facing Zhou Weiqing’s pure physical strength and the terrifying boost of the ‘Hate Ground no Handle’ Legendary Set, even if Zhou Weiqing was just blocking his attack, it was not something that TianMa could easily handle. If not for the powerful Heavenly Energy he had been using, perhaps this hammer blow would have already cost him his life.</p><br/><p>TianMa had taken action, and TianFeng had moved at the same time. Grasping his four chi long broadsword, his body seemed to slide close to the stage, the sword slashing upwards in an uppercut fashion. In his movement, his body seemed to flicker in an illusory fashion. Before his sword even reached, a powerful gold-red light already spread through the stage.</p><br/><p>However, abruptly, a gold light appeared, perfectly appearing at Zhou Weiqing’s side, forming a gold shield, blocking all of the gold-red light.</p><br/><p>The brilliant gold light was filled with a divine aura, and as soon as both sides clashed, a powerful energy fluctuation reverberated out.</p><br/><p>The Light Flames that TianFeng had unleashed in his sword blow was totally neutralized by the Divine Attribute easily, only the final purple hue of the Destruction Attribute was left to slam into the gold shield of light in a true clash.</p><br/><p>Another massive explosion, and the gold shield that Tian’er had unleashed showed several cracks. However, the purple light was also consumed and vanished.</p><br/><p>Zhou Weiqing did not even bother about TianFeng, ignoring him totally as he charged forward towards TianMa. His Dual Legendary Hammers swinging once again, the heads of his hammers imbued with the ‘Flying Lightning God Technique’ from his Six Ultimate Godly Light Formation, crackling with a powerful lightning as he struck out at TianMa.</p><br/><p>TianMa was no pushover as well, even after being knocked back by Zhou Weiqing’s hammer, his spear swiftly warped into tens of thousands of blurry illusions as he blocked Zhou Weiqing’s attack.</p><br/><p>Zhou Weiqing was now faced off against TianMa, while Tian’er was facing off against the stronger TianFeng. However, as compared to the more exciting clash on the other side, their fight seemed silent and sombre.</p><br/><p>TianFeng’s attacks were not quick, but each and every sword he struck out was filled with great destructive power. However, Tian’er only responded with a light flick of her God Spirit Staff, and a gold shield of light would appear, blocking his attacks. In truth, both of them were still tentatively probing in their attacks, and they did not use any of their powerful Skills for now, waiting for a better opportunity. At least from the outward appearance, both sides were extremely equally matched.</p>\n</div>"}