{"title": "Chapter 643", "id": 643, "volume": 7, "url": "http://boxnovel.org/heavenly-jewel-change-chapter-643", "volume_title": "Volume 7", "body": "<h1>Chapter 643</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>The Heavenly Skill Image of the Silver Emperor behind Zhou Weiqing’s back slowly drifted to the front, and just like that it began to merge with the green-silver ball of light in front of him. This merging caused the silver light around Zhou Weiqing’s hand to brighten drastically, warping in an even stranger change.</p><br/><p>As soon as his hands grasped together, the green-silver ball of light seemed to come to life. With violent reverberations, Zhou Weiqing’s entire body erupted with a powerful green and silver light. However, since he was so high up in the sky, no one else could see that his eyes had turned a full silver-white.</p><br/><p>Zhou Weiqing’s arms shook abruptly, and his hands slowly spread apart again. A tiny bird, fully silver in colour, appeared before him.</p><br/><p>“Silver Emperor?!” Even with Shangguan Longyin’s status and power, when he saw what Zhou Weiqing had done, he couldn’t help but exclaim out loud, unable to restrain himself.</p><br/><p>What Zhou Weiqing had done had toppled everything he thought he knew. He… he had actually used his own Heavenly Energy to coalesce a Silver Emperor!</p><br/><p>The scariest thing was… this Silver Emperor was clearly not just an image. As soon as it appeared, with Shangguan Longyin’s powerful senses, he could clearly sense a powerful life force from that Silver Emperor, far stronger than the Destruction Fire Phoenix.</p><br/><p>If he had to point out a difference between this energy-formed Silver Emperor and an actual Silver Emperor Heavenly Beast, it would be the colour of the eyes.</p><br/><p>As a Heavenly King stage Heavenly Beast, the Silver Emperor had red eyes. However, for this Silver Emperor that Zhou Weiqing had formed, its eyes were a silver-white. Even so, as compared to an actual Silver Emperor, this energy-formed bird seemed to have a divine aura about it, as if it were above</p><br/><p>“Go.” Zhou Weiqing said softly, pointing his right hand downwards. The Silver Emperor before him cried out in a clear, bright cry, streaking down like a bolt of silver lightning towards the Destruction Fire Phoenix that was larger than it several dozen times over.</p><br/><p>Even Shangguan Longyin could not tell what Zhou Weiqing had unleashed, let alone the others. In truth, Zhou Weiqing and Shen Little Demon’s battle had not started for a long time, but anyone could tell that this was one of the most exciting battles for the current Heavenly Jewel Tournament, at least up until now. Both sides had unleashed Skills that were far above any ordinary Stored Skills, and the power that they displayed was definitely far beyond the six or seven Jewels they showed on the surface.</p><br/><p>A faint smile caused Zhou Weiqing’s mouth to form a wicked smirk.</p><br/><p>His entire plan had been to force Shen Little Demon to use her Destruction Attribute. Otherwise, how could he learn more about the profound secrets behind the Destruction Attribute?</p><br/><p>Light and Fire… could these two Attributes fused together form the Destruction Attribute? No matter what, Zhou Weiqing could never believe that. Even if they were fused together, these two Attributes would be pure and upright, how could it be like the Destructive Attribute?</p><br/><p>What was the Silver Emperor’s strongest Skill? Without a question, it was the Dual Attribute Skill Silver Emperor Spatial Rend, a fusion Skill of the Silver Emperor Wing Slash and the Spatial Rend. Currently, the Silver Emperor swooping down was exactly unleashing that very Skill, forming a piercing green silver light that collided instantly to the Destruction Fire Phoenix.</p><br/><p>*Hisss Laaa* A strange sound rang out, as if a red hot soldering iron had a bucket of ice water poured on it.</p><br/><p>In mid air, the light dimmed abruptly, as if the sun’s light was being suppressed.</p><br/><p>They could clearly see a silver light fly into the head of the blood red Destruction Fire Phoenix, charging right down. Wherever it reached, it started breaking apart the entire body of the Destruction Fire Phoenix, and the green-silver body also began to shrink slowly as it charged down lower.</p><br/><p>There was no violent explosions, but the terrifying energy reverberations in the skies could be clearly sensed by any Jewel Masters. Many watchers were secretly feeling lucky that this clash was in the skies; if it were on ground level, who knows what would have happened.</p><br/><p>Creation. Once again, Zhou Weiqing had used the Saint Energy’s Creation, with the price of five drops of Saint Energy, to unleash the fusion Skill Silver Emperor Spatial Rend, coalescing the actual Silver Emperor. Ever since he had done so with the Hell’s Angel, he had been experimenting in repeating the process with other Skills.</p><br/><p>Without question, the power of this Skill was far above the original Silver Emperor Spatial Rend. With the power of the Saint Energy, the Destruction Attribute was being totally suppressed.</p><br/><p>Zhou Weiqing had left a strand of his own spiritual energy in that coalesced Silver Emperor, allowing him to sense the energy reverberations and fluctuations of the Destruction Fire Phoenix, and any myriad changes it might have. He discovered that this Destruction Attribute energy had a crazy dissolving or disassembling effect on any other Attribute. Only the Saint Energy was able to resist this dissolving effect, but it wasn’t able to gain too much advantage either.</p><br/><p>Of course, on the reverse side, the Destruction Attribute was also left helpless in front of the Saint Energy. It was destruction, and the Saint Energy was creation. Both sides were not even on the same level.</p><br/><p>Just from visual effect alone, when that single wisp of green-silver light pierced and traveled right through the Destruction Fire Phoenix before disappearing stealthily, the Destruction Fire Phoenix looked as if it had been sliced into two from the middle before falling apart totally. Only Zhou Weiqing could clearly sense that in terms of pure strength of energy, his Silver Emperor was actually lesser than the Destruction Fire Phoenix. The reason he could destroy it was actually because of the core of the Destruction Fire Phoenix. Once the core of the Destruction Attribute had been destroyed, it had lost its soul, not allowing its full power to be unleashed. In that terrifying collision, both the powerful Skills disappeared just like that.</p><br/><p>“No… that’s not possible!” Pale and ashen, Shen Little Demon was barely standing with sheer exhaustion on the stage, her eyes staring up in total disbelief and shock. No matter what, she could not believe that what had happened in front of her eyes was true. Due to her fatigue, she had not been able to see clearly what Zhou Weiqing had done, only seeing a flash of silver before he Destruction Fire Phoenix vanished.</p><br/><p>As the Destruction Fire Phoenix held her Natal Core Flame and Natal Core Blood, when it vanished, she couldn’t help but involuntarily vomit out another mouth of fresh blood.</p><br/><p>When she unleashed that Skill, her goal had been to fight to the bitter end, to kill Zhou Weiqing no matter the price she had to pay. In her eyes, Zhou Weiqing would not be able to take this blow of hers. These three years, she had spent every single day training as hard as she could, putting her entire life into it. In the entire younger generation, she was one of the only three who had gained the Destruction Attribute. In order to do so, she had paid such a heavy price, withstood an unbelievable amount of pain and hardship, worked so hard in order to succeed. This time, coming to the Heavenly Jewel Tournament, she had not imagined that she would run into Zhou Weiqing again. However, the moment she saw him, the sparks of hatred within her had been reignited, causing her to unleash such a powerful killing Skill without holding anything back. Her only goal was to kill Zhou Weiqing.</p><br/><p>It could be said that the past three years of labour and toil for Shen Little Demon had been warped into that Destruction Fire Phoenix. Yet, all of it had been just destroyed so easily by Zhou Weiqing.</p><br/><p>Trembling as her body barely stood, Shen Little Demon grit her teeth, once again lifting her hand. She could not accept it, would not accept it! Even if she had to use her last bit of strength and life, she would destroy Zhou Weiqing!</p><br/><p>“Enough.” A cold voice rang out. The next instant, the voice said solemnly: “Senior Shangguan, the first round, our Dan Dun Battle Team admits defeat.”</p><br/><p>Accompanying the voice was a figure who appeared onto the stage in a flash, gracefully holding onto Shen Little Demon’s waist as he brought her back down the stage.</p><br/><p>“Let me go, let me go, I haven’t lost yet. He has to be just as spent as I am. Bro Feng, I cannot accept it, let me kill him, please!”</p><br/><p>“Calm down.” The one who had carried Shen Little Demon off the stage was the Dan Dun Battle Team Leader, the youth with the cold expression. He did not hesitate to give her a slap, before enveloping her in a full embrace.</p><br/><p>“Your shame and humiliation, I will help you take revenge. However, you must survive and stay alive. You are already severely injured, with your vitality sapped to the limit. If you continue fighting, you will definitely die. The day you married me, your body no longer belongs to just yourself.”</p><br/><p>After saying that, he gently laid Shen Little Demon onto one of the chairs in the Rest House. Turning, he looked upon Zhou Weiqing who was slowly descending from the skies onto the stage, his eyes filled with cold light.</p><br/><p>His name was TianFeng, the true top genius of the Blood Red Hell younger generation. He was also the son of the Blood Red Hell Master. As for Shen Little Demon, she was the Princess of the Dan Dun Empire Royal Family. Although her status in the Blood Red Hell was very high, it could not be compared with TianFeng. In this year’s Heavenly Jewel Tournament, for TianFeng to personally lead their team, it could be said that they were determined to achieve victory at all costs.</p><br/><p>Naturally, TianFeng had heard about everything that had happened in the previous Heavenly Jewel Tournament from Shen Little Demon, down to every little detail. This time, since they had met with another Battle Team led by Zhou Weiqing, though TianFeng was always so calm and collected, the competitive spirit in his heart was hidden but stronger than anyone else.</p><br/><p>Zhou Weiqing stood on the stage, looking towards the Dan Dun Battle Team Rest House. Laughing heartily, he said: “Ahhh, the Dan Dun Battle Team has the Blood Red Hell at its back, and I originally thought your fighting spirit would be not bad. Who knew you would admit defeat just like that, how disappointing, how disappointing.”</p><br/><p>“Bro, let me fight in the second round. I will take revenge for Sister in Law.” The one who spoke up now was the second youth, seated at TianFeng’s right hand side. He was TianMa, TianFeng’s younger brother, and his strength was above Shen Little Demon, second only to TianFeng. Clearly, he had been provoked and angered by Zhou Weiqing.</p><br/><p>TianFeng looked at Zhou Weiqing on the stage, as if he disdained to speak to him. Nodding to TianMa, he said: “Only victory is allowed. Do not lose.”</p><br/><p>TianMa nodded. He did not even wait for Zhou Weiqing to descend the stage, and in a flash he leaped up the stage.</p><br/><p>TianFeng gave a cold smirk inwardly. Zhou Weiqing, you might be strong, but you are only a single person. Do you really think that you can stop my Dan Dun Battle Team just by yourself? Later, in the 2v2 match, I will let you remain on the stage… forever.</p><br/><p>In his eyes, the only person in the entire Heavenly Bow Battle Team that could enter his eyes and let him pay attention to was just Zhou Weiqing, and he totally ignored the others. They had already lost the first round, and the Dan Dun Battle Team could not afford to lose another round. His pride would not allow the Dan Dun Battle Team to be behind by two to zero, not even for strategy’s sake. Furthermore, Zhou Weiqing had already fought, and in his eyes, it was a certain victory for his little brother TianMa in any one versus one situation.</p><br/><p>As for the two versus two fight, naturally that was even more of an assured victory to him, since he would be participating personally. Although Zhou Weiqing had given him some surprises when he had fought in the first match, to TianFeng the overall result could only be a 3 to 1 victory for the Dan Dun Battle Team.</p><br/><p>As soon as TianMa ascended the stage, with a swooshing sound, a pair of wings spread behind his back. His wings looked very different from Zhou Weiqing’s, smaller and thinner, more like a pair of bat wings. The tips of his wings were sharp, looking to be lined by something like bone spikes, causing the entire edge of the wing to be extremely sharp.</p><br/><p>Looking coldly at Zhou Weiqing who was preparing to walk off the stage, TianMa said coldly: “If not for the rules of the Tournament not allowing you to fight again, I would kill you this match.”</p><br/><p>Zhou Weiqing looked at him with a warm smile, but his mouth was just as evil as ever. “I’m so afraid! Come and bite me then? Oh, no, that’s not right, someone like you should have too many diseases. Later I’ll send you a little tortoise and you can slowly play with it and bite on it.”</p><br/><p>“Bastard!” TianMa was enraged, and in a flash he pounced towards Zhou Weiqing.</p><br/><p>However, the only thing that met him was a thick layer of Heavenly Energy blocking him. Shangguan Longyin stood in the distance, his face stern as he said: “No breaking of the Heavenly Jewel Tournament rules. Heavenly Bow Battle Team, send your second fighter to the stage.”</p><br/><p>“Yes, Senior Shangguan.” Zhou Weiqing replied honestly, but as he did so he still pointed a middle finger towards TianMa before jumping off the stage lightly.</p><br/><p>The brothers TianFeng and TianMa were the representative of the younger generation in the Blood Red Hell, just like how Shangguan Xue’er and Zhan LingTian were for the Heaven’s Expanse Palace, or how Tian’er and Gu Yingbing were for the Heavenly Snow Mountain. Naturally, they had a similar status as well. From young, they had been cultivating hard, but that also meant they did not have much worldly experience… how could they have met such a situation and face such low brow mockery? Instantly, TianMa was further enraged, but unfortunately for him, Shangguan Longyin was there blocking him, and he couldn’t lash out no matter how much he wanted to.</p><br/><p>Returning to their Rest House, Zhou Weiqing gave a signal to Ma Qun, who gave a wicked grin. This time, he did not wear his Heavy Armour, just leaping up onto the stage immediately.</p><br/><p>Seated at the side, Yun Li muttered out loud: “I have decided, no matter what I will not offend you in the future. You are just too evil.”</p><br/><p>Zhou Weiqing looked at him innocently: “You can’t blame me for that, who asked the Dan Dun Empire to act so overbearing in the south. More importantly, having such connections with the Bai Da Empire? Against enemies, we can never be merciful, sweeping them away with all our might, like the autumn wind sweeps away the withered leaves.”</p><br/><p>…</p><br/><p>Ma Qun’s massive body appeared on the stage once more. For the entire Heavenly Bow Battle Team, if one were to think about who had the most appearances on the stage, it would be him and Xixi, who had fought almost every single round.</p><br/><p>Seeing Ma Qun ascend the stage, Shangguan Longyin couldn’t help but furrow his brow. Having placed much importance and attention to the Heavenly Bow Battle Team, he naturally knew the power of this huge youth in front of him. Although he had managed to sneakily kill the Bai Da Battle Team Leader, that did not mean he had the equivalent power. Perhaps this youth had much potential within him, but at his current state, he could not compare to TianMa at all.</p><br/><p>After releasing his wings, TianMa also revealed his Heavenly Jewels. Seven sets. Low Level Zong Stage Heavenly Jewel Masters. Furthermore, with Shangguan Longyin’s senses, he could naturally tell that this TianMa was already at the later stages of the seven-Jeweled stage, not too far from reaching the eight-Jeweled stage. One could imagine his power. Furthermore, his Physical Jewel was the Agility Type, while his Elemental Jewel was Alexandrite. That meant, he had at least two Attributes to work with. That was not even counting the possibility of the Destruction Attribute. With such an overall power, how could Ma Qun and his four Jeweled cultivation level face up against him?</p><br/><p>However, rules were rules. Since the Heavenly Bow Battle Team had already sent Ma Qun to fight, Shangguan Longyin could not intervene in a personal fashion to force them to change their fighter. In a solemn tone, he said: “Both sides, introduce yourselves.”</p><br/><p>Ma Qun grinned and said casually: “Heavenly Bow Battle Team, Ma Qun.”</p><br/><p>TianMa’s cold eyes were filled with the light of bloodlust as he snarled: “Dan Dun Battle Team, TianMa.”</p><br/><p>Just as Shangguan Longyin was about to proclaim the start of the fight, Ma Qun suddenly lifted a hand in a ‘stop’ gesture. “Senior Shangguan, please hold on a moment. I have something important to say.”</p><br/><p>Shangguan Longyin asked: “Does it have something to do with the tournament?”</p><br/><p>Ma Qun laughed heartily and said: “Of course, it definitely has a strong link.”</p><br/><p>Only then did Shangguan Longyin nod and say: “Alright then, speak up quickly. Don’t waste time.”</p><br/><p>Ma Qun bowed respectfully towards Shangguan Longyin and thanked him, before he turned his gaze to TianMa. He then proceeded in an action that both Shangguan Longyin and TianMa did not understand – his hands to his hips, taking a deep breath.</p><br/><p>In the next moment, Ma Qun’s voice boomed out from the stage like a machine gun firing, the volume of his voice was so much that the surrounding battle team members in their rest houses could all hear it.</p><br/><p>“Your name is TianMa right? Why aren’t you called ZhongMa 1 instead? Look at you, as tall and beautiful as a jade tree, so handsome and suave, such a playboy style, everyone would fall for you upon looking at you, even the flowers would bloom as you walked past… I’m sure you are the top quality amongst all trash, beasts amongst the beasts. Furthermore, according to my keen observations, you must have been lacking calcium since a young age, growing up to look like you lack love, even your grandmother doesn’t love you, your uncles do not love you. Your left face is asking to be slapped, your right face asking to be brutally stepped upon. Even a donkey would feel like kicking you, a pig would feel like stomping on you. You are born to be like a cucumber, to be beaten! Yet, you have grown up to be like a walnut, to be ground to dust! Look, look, look, your little face is so skinny, like a pig! If we threw you into a toilet bowl now, even the toilet bowl would vomit. If we threw you into a Spatial Rend, the Spatial Rend would commit suicide and blow up! Siighhh, look and see what you have done, this Great Young Master wants to teach you to use the knife, but you just insist on learning the sword, but you don’t learn the sword properly, instead always using the ‘down sword’2. There are so many styles of your ‘down sword’, yet you insist on learning the ‘Drunken Sword’ 3, instead of the ‘Gold Sword’, you learn the ‘Silver Sword’ 4! I think you can just learn the ‘Drunken Silver Sword’5! You could have been a sword saint, or a sword immortal, alas you cried and insisted on being a ‘sword man’ 6! Really… there is no need for you to do so. Even though your looks are like that, you should live on with courage! Even so, you do not need to use your buttocks to cover your face! I wanted to see you speaking, but why did you bury your face in your buttocks? Oh? I am so sorry, I did not know that is your actual face, then where are your buttocks? Why are your buttocks so red? Are you a monkey? Sigh… in truth, living is a waste of air for you, but if you die you are also wasting earth to bury you, staying at home you are wasting gold for your family, how how how? You might as well urinate into a pool and drown yourself in it?”</p><br/><p>After saying that entire long sentence, Ma Qun took an abrupt deep breath. He had rattled it all off without even taking a breath, and his entire face was now red from lack of oxygen, but he still stuck his chest out in a righteous look, as if he was a great hero who was speaking the truth of the world, sacrificing himself to save the citizens from a great evil.</p><br/><p>After finishing all of that, he looked towards TianMa and Shangguan Longyin, who were both staring at him, stunned silly. Bowing towards Shangguan Longyin, he said: “I surrender.” After which, he turned around in a suave fashion, walking off the stage.</p><br/><p>In Ma Qun’s rapid fire speech earlier, his words had been spewed out at an unbelievable speech. Since when had TianMa seen anyone speak like that before? By the time he came to his senses, his entire mind was filled with the mass of chaotic nonsense that Ma Qun had rattled off.</p><br/><p>What was a state attained… scolding without any curse words, this was a true attainment of state. In this entire rapid fire speech of Ma Qun’s, he rambled on about so many different things in scolding TianMa, but he had not uttered a single curse word</p><br/><p>“Bas… Bastard!” TianMa did not know how to scold others, truly. From young, he had grown up in the Great Saint Lands, and in there, who would dare to scold others? Let alone in front of him? By the time he recovered his senses, he was in such a rage that he felt like his lungs were about to burst.</p><br/><p>A thick gold-red flames with an astonishingly brilliant hue of purple smashed crazily towards Ma Qun.</p><br/><p>*Puuu*</p><br/><p>The thick Heavenly Energy shield appeared once more, forcefully blocking TianMa’s attack. No matter how powerful TianMa’s Destruction Attribute was, the gap between Zong Stage and Heavenly King Stage was just too immense, not something they could cross so easily.</p><br/><p>In truth, when Shangguan Longyin blocked this attack, his eyes were twitching uncontrollably. Even he had the urge to smash Ma Qun with a single palm himself, let alone the target of the scolding, Ma Qun. Disgusting, that was just too disgusting. That big fellow had clearly just come up here to tease TianMa, scolding him before instantly surrendering. No wonder… no wonder Zhou Weiqing would send a mere four-Jeweled little fellow against TianMa! Zhou Weiqing ahhh Zhou Weiqing, you are truly shameless to the utmost degree!</p><br/><p>Another *Puuu* sounds, and TianMa vomited out a mouth of fresh blood. His eyes were bloodshot as his entire body shuddered violently. He pointed towards the Heavenly Bow Battle Team Rest House, but he could not speak a single word.</p><br/><p>That mouthful of blood was not because of the backlash from Shangguan Longyin’s blocking of his attack. As the head judge of the Heavenly Jewel Tournament, Shangguan Longyin would never do such a thing. It was clearly because he had been just too angered by Ma Qun and Zhou Weiqing!</p><br/><p>Back in the Heavenly Bow Battle Team rest house, Crow was staring at Zhou Weiqing with her jaw agape. “Boss, this… this… you taught Ma Qun that?”</p><br/><p>Zhou Weiqing stood with arms crossed, calm and at ease, as if he was a lofty presence in the wind. “This is called strategy. Sigh, I also did not wish for this to happen. Who asked him to be the second to fight? In truth, I was just doing an experiment, I needed to test if the old saying ‘Angered to death’ can really be true? Alas, the facts have proved themselves, we have failed. Look, that fellow didn’t die right?”</p><br/><p>Tian’er and Xixi were clutching their stomachs, laughing helplessly at the side. On the other hand, Yun Li was covering his face, as if ashamed to be seen together with Zhou Weiqing.</p><br/><p>*PENG* Ma Qun had jumped down from the stage, an excited look on his face. “Ahhhh, that felt good, so good! Boss, you are truly a genius! I will definitely memorise those words so I can use them in the future! Ahhh! No, I forgot!”</p><br/><p>That last startled exclamation drew everyone’s gaze to him, and as they looked at him curiously, Ma Qun said gravely, full of regret: “I forgot to give a loud fart before I went down…”</p><br/><p>Zhou Weiqing gave him a kick, sending him to the side as he scolded laughingly: “That was not what I taught you! This big bro here is not so shameless!”</p><br/><p>Including Tian’er, the entire Heavenly Bow Battle Team gave Zhou Weiqing a contemptuous look.</p><br/><p>On the stage, another figure had appeared. TianFeng stood next to TianMa, one hand on his shoulders, helping him nurse his chaotic Heavenly Energy due to his rage.</p><br/><p>“Calm down. The humiliation they have given us, we will pay back ten times, hundred times more. There is no point raging pointlessly now. Senior Shangguan, the third match, both of us will be the fighters.”</p><br/><p>Shangguan Longyin looked at Tianfeng and nodded in agreement. However, he felt his heart grip inwardly. This TianFeng was much calmer and more stable, far beyond his brother TianMa, especially that cold calculation that lay in his bones. It was clear that he was narrow minded person who would seek vengeance for any minor grievances, but one who could complete control his emotions. Such a person was far more dangerous and deadly than his strength alone could account for.</p><br/><p>With his brother’s help, TianMa managed to gradually calm down, his Heavenly Energy also easing up. However, the bloodshot red in his eyes did not withdraw, clearly he truly hated the entire Heavenly Bow Battle Team now.</p><br/><p>Shangguan Longyin said: “Dan Dun Battle Team against the Heavenly Bow Battle Team. Two versus Two. Third match. Both sides, please send your fighters up the stage.</p><br/><p>In a flash, two figures appeared from the Heavenly Bow Battle Team, hand in hand. Tian’er had already removed her bamboo hat, revealing her beautiful features.</p><br/><p>When Zhou Weiqing held her hands and they ascended the stage, instantly the phrase ‘fresh flower stuck on bull crap’ and similar phrases crossed all the rest houses.</p><br/><p>Looking at Zhou Weiqing, both brothers TianMa and TianFeng’s eyes contracted, a powerful killing intent released without any attempt at hiding.</p><br/><p>Shangguan Longyin was also secretly surprised in his heart. He knew that this next match was of utmost importance to both sides. Zhou Weiqing had used a four-Jeweled Heavenly Jewel Master to ‘waste’ the second strongest powerhouse in the Dan Dun Battle Team, TianMa. Although that had been a loss of a match, in terms of strategy, it was a perfect victory. However, this current 2v2 match was perhaps the most critical one which would decide the outcome between both teams. After all, it was the fight between the strongest of both teams, and it would definitely be the most exciting fight of the entire Heavenly Jewel Tournament thus far. Being the judge for this match, it would not be so easy!</p><br/><p>“Zhou Weiqing, today I will tear you into bits!” The rage and venom that TianMa had just suppressed burst free once again, rising up as he saw Zhou Weiqing.</p><br/><p>Standing at Zhou Weiqing’s side, Tian’er gave a cold humph. “Aren’t you afraid of bragging so much you sprain your tongue? A mere Blood Red Hell, and you dare to be so arrogant in front of us.”</p><br/><p>…</p><br/><p>As soon as Tian’er appeared on the stage, the entire WanShou Battle Team members subconsciously dashed out of their rest house. In this year’s Heavenly Jewel Tournament, the WanShou Empire had definitely sent an elite team as well, and since they were mostly from the Heavenly Snow Mountain, how could they not recognize their Young Miss? However, at this point, it was clearly not the time or place to greet her.</p><br/><p>At the head, a youth who was clearly the leader couldn’t help but mutter to himself: “Now, it looks like that Dan Dun Battle Team will be in trouble after all.”</p><br/><p>At his side, another youth asked curiously: “Boss, didn’t you just say earlier that the Heavenly Bow Battle Team would not be a match for the Dan Dun Battle Team? Young Miss might be powerful, but she is just alone. Her cultivation level may not even be a match for the TianFeng and TianMa brothers right?”</p><br/><p>“Zhou Weiqing… that name… don’t you all find it familiar at all? Use your brains, why would the Young Miss actually appear here? Haven’t you forgotten what happened on the Heavenly Snow Mountain?”</p><br/><p>Hearing his words, the entire WanShou Battle Team members’ jaws dropped. “He… he is that fellow who came to steal the bride?”</p><br/><p>The leader sighed and said: “Indeed! Even Senior Brother Gu was defeated by him… hmph, do you think the brothers TianFeng and TianMa can be compared to Senior Brother Gu? So, the truly dangerous one is not Young Miss, but him. Watch carefully and learn, this will be a true fight between top powerhouses. We are indeed very lucky not to meet the Heavenly Bow Battle Team in the top eight.” Clearly, he had already affirmed his belief on who the final team ascending to the top eight would be.</p><br/><p>…</p><br/><p>On the stage, Shangguan Longyin’s expression grew bleak. “Enough, both teams, there is no point fighting with words. Both sides, introduce yourselves.”</p><br/><p>“Heavenly Bow Battle Team, Zhou Weiqing, Tian’er.”</p><br/><p>“Dan Dun Battle Team, TianFeng, TianMa.”</p><br/><p>Shangguan Longyin swept his gaze across all four of them, before saying: “Know your limits. This is the Heavenly Jewel Tournament, not a life and death fight. Alright, fight, begin.”</p><br/><p>With both sides confronting each other with daggers drawn and sabres rattling, in such an aggressive manner, he couldn’t help but remind in a line. Of course, he did not have any goodwill towards the Dan Dun Battle Team. However, he did not want to see Zhou Weiqing suffer any loss. Even for him, he did not have a lot of hopes for Zhou Weiqing’s success. After all, Zhou Weiqing had just fought against Shen Little Demon, and to unleash that strange Silver Emperor, it should have taken quite a toll on him. The brothers TianFeng and TianMa were not only fresh, but also stronger than Shen Little Demon. Clearly, it would not be an easy fight at all.</p><br/><p>Along with Shangguan Longyin’s proclamation, the aura and presence that both sides had been holding in and building up smashed into each other instantly. Aura and presence was invisible and intangible, but it could put immense pressure on an opponent’s spirit.</p><br/><p>If it came to a clash of auras, Zhou Weiqing and Tian’er would definitely be able to laugh to the end. Previously, on the Heavenly Snow Mountain, Zhou Weiqing had been able to clash auras with a Heavenly Emperor stage Heavenly Beast with the bloodline pressure. This was a type of clash of auras.</p><br/><p>The two brothers TianFeng and TianMa instantly felt a boundless and terrifying pressure, filled with noble grace and royal presence pushing down upon them from Zhou Weiqing and Tian’er. Vaguely, they sensed one black, one white, two massive tigers pouncing towards them.</p><br/><p>In that instant, both sides unleashed their Heavenly Jewels. Zhou Weiqing had six sets of Jewels, actually ending up the lowest of the four. Tian’er was at seven-Jewels, as was TianMa. However, when TianFeng released his Heavenly Jewels, even Zhou Weiqing’s pupils narrowed in surprise. He was at the eight-Jeweled stage!</p><br/><p>Indeed, TianFeng had released eight pairs of Heavenly Jewels. His Physical Jewels were the Icy Jade of the Strength Attribute, while his Elemental Jewels were also the Alexandrite Jewels of Dual Attributes. Powerful Heavenly Energy mixed into their auras, and the clash resumed.</p><br/><p>Both sides did not take action instantly; in this clash of auras, whoever took action first meant their aura and pressure was already at the disadvantage. This would not be a good sign. All of the four were top powerhouses in the younger generation, and they were all able to defeat enemies above their cultivation level. Naturally, they knew very well the advantage in moving first. However, that had to be in unison with a suppression of aura to be of proper use, rather than the reverse.</p><br/><p>Anyone could clearly see that from the aura that rose above the brothers TianFeng and TianMa, there was a faint gold-red light of Fire and Light, giving the audience a sensation like they were the rising sun in the skies.</p><br/><p>On the other side, TIan’er gave forth a brilliant gold, along with a swirling purple. The beautiful purple eyes of hers were also glowing brightly.</p><br/><p>The light around Zhou Weiqing was the strangest, six colours rising in unison, swirling around his body as they rose up. In terms of attributes, it was without question that Zhou Weiqing was the strongest amongst the four.</p><br/><p>Very quickly, the clash of aura and pressure showed the victor. Zhou Weiqing had the Dragon and Tiger bloodlines, while Tian’er had the pure Divine Heavenly Spirit Tiger bloodline. As both of them held hands, the four Saint Attributes were present as well. Although their overall cultivation levels and Heavenly Energy was lower, their aura and presence was far superior to their enemies.</p><br/><p>TianFeng and TianMa’s expressions turned grave. When Tian’er released her aura, they instantly recognized where she was from. However, at this point, it was too late to say anything, and it was more important to defeat their enemies.</p><br/><p>By now, all of the Battle Team members had walked out of their respective rest houses. Towards this major battle in front of them, they paid close attention, placing high importance upon it. The brothers TianFeng and TianMa were definitely shocking, but at the same time, this Heavenly Bow Battle Team had yet another hidden seven-Jeweled Heavenly Jewel Master, with such powerful Attributes as well. They were equally shocking indeed. Besides the ZhongTian Battle Team who already knew of them beforehand, and the WanShou Battle Team who recognized them, all of the other teams were just filled with surprise and shock.</p><br/><p>This was destined to be a clash of the top! Originally, those who had looked down upon the Heavenly Bow Battle Team currently had very complicated feelings in their hearts.</p><br/><p>Facing the terrifying bloodline powers and the suppression of their enemies’ aura, both TianFeng and TianMa began breathing heavily. TianFeng withdrew his gaze, and abruptly, he took a half step forward, the gold-red in his eyes changing suddenly as the purple of the Destruction Attribute appeared.</p><br/><p>TianMa and TianFeng could be said to be connected on a certain level. As soon as TianFeng activated his Destruction Attribute, TianMa’s eyes also flashed in a similar fashion. The powerful Destructive aura gave their highly suppressed auras a huge boost; though it wasn’t sufficient to turn to tides and allow them to suppress Zhou Weiqing and TIan’er, at least they were able to hold on.</p><br/><p>Despite that, the two brothers were still forced to make the first move, and their Consolidated Equipment appeared.</p><br/><p>Flashes of dark gold lit up around them one by one, as the light shield representing the God Tier Consolidated Equipment sprang up individually, causing the entire audience to erupt in surprise.</p><br/><p>It had to be known, normally it was extremely difficult to even see a single God Tier Consolidated Equipment, enough to shock anyone. However, in that series of bright flashes, the two brothers had unleashed a total of fifteen dark-gold light shields!</p><br/><p>Besides Legendary Sets, there was no other explanation for them having so many high level Consolidated Equipment.</p><br/><p>That was a hideous and savage scale armour. Indeed, hideous and savage was a very apt description. Their armour was clearly not fully completed yet, as the Consolidated Equipment was still the dark-gold colour that represented an incomplete Legendary set. Almost the entire armour was covered with sharp spikes, and on the chest area, there was a strange symbol of a crab. Even their helmets, both sides of them had four sharp spikes twisting about, as if the eight legs of a crab. The two of them had exactly the same Consolidated Equipment, fifteen God Tier Consolidated Equipment in total, and instantly their aura exploded forth in a massive boost, not only regaining all lost ground, but actually starting to be the suppressor instead.</p><br/><p>In terms of Consolidated Equipment, Zhou Weiqing could be said to be extremely knowledgeable and experienced already. As soon as both sides faced off, he could clearly sense that this TianFeng, in terms of cultivation level and overall combat prowess, was perhaps already a match for the Lion Prince Gu Yingbing. As one of the top in the Great Saint Lands younger generation, he was definitely top quality.</p><br/><p>Of course, that did not mean that Tian’er, Shangguan Xue’er and Shangguan Fei’er could not compare to Gu Yingbing or this TianFeng. However, Tian’er, Shangguan Xue’er and the other girls were still much younger, far from reaching thirty years old. As a result, it was normal for them to have some gap in cultivation levels for now.</p><br/><p>No matter Shen Little Demon, TianFeng or TianMa, they all had the Destruction Attribute. It was clear that this Destruction Attribute was not inborn, but somehow cultivated by them in recent times.</p>\n</div>"}