{"title": "Chapter 666", "id": 666, "volume": 7, "url": "http://boxnovel.org/heavenly-jewel-change-chapter-666", "volume_title": "Volume 7", "body": "<h1>Chapter 666</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>Zhou Weiqing dared not stop his dragon’s cry. Currently, all four girls had reached his side, and they could clearly see blood streaming down Zhou Weiqing’s mouth, nose and ears. Clearly, when he had blocked the previous fireball, he had already sustained severe injuries, and the flicker of silver white around him was now rather unstable.</p><br/><p>Tian’er quickly grabbed onto Zhou Weiqing’s hand, reestablishing the large Saint Energy whirlpool as quickly as she could, also infusing the last remnants of Saint Energy in her body to him.</p><br/><p>When she sensed the Heavenly Energy reverberations in Zhou Weiqing’s body, she couldn’t help but draw in a cold breath.</p><br/><p>The Heavenly Energy in Zhou Weiqing’s body was extremely unstable, not only was his own energy raging about in an unruly fashion, a thick fire attribute energy was also slowly eating away at his insides. If not for the Saint Energy protecting him, perhaps he would have already been finished off by now. Even so, he was still forcing himself to continue the dragon’s cry despite his condition.</p><br/><p>In fact, Zhou Weiqing would have to thank his Immortal Deity Technique for his ability to do this. Ever since he started cultivating it, he had been constantly tortured and tormented with unimaginable pain, slowly increasing his resistance and willpower to far beyond any ordinary Heavenly Jewel Master. In the current situation, no matter how much pain he was in, the willpower that had been forged and tempered allowed him to pull himself together and do what he needed to do.</p><br/><p>In the distance, the massive dragon slowly flew towards them. Zhou Weiqing’s eyes were resolute and stubborn. Currently, with Tian’er’s help, the large Saint Energy whirlpool was able to start siphoning away the terrifying fire attribute energy that was causing destruction in his body, transforming it into Saint Energy. The pain within him was also slowly easing up.</p><br/><p>Very quickly, the massive dragon stopped before them, its eyes fully dark red. They could clearly sense the violent emotions raging within it, though it was trying its best to control itself, the terrifying pressure still caused Zhou Weiqing and the others to fall to the ground.</p><br/><p>Although Zhou Weiqing and the girls were at the top of the young generation, in front of a Heavenly God Tier powerhouse, they were no different from ants. If the massive dragon really wanted to kill them, perhaps a single claw would be sufficient to destroy them all simply. Even with the Lustre Gem in their hands, it was unlikely any of them could escape.</p><br/><p>Zhou Weiqing’s heart was actually extremely anxious. He was hoping that the four girls would use their Lustre Gem to leave this place swiftly. If it was just him alone, even if he was facing the dragon, he still had confidence in escaping with his lives. However, with the four girls here, how could he possibly leave on his own? As such, he could only continue maintaining the dragon’s cry as he forcefully generated the bloodline aura from within him. However, he was still not clear if the dragon, clearly in a crazed state, was actually able to recognize him or not.</p><br/><p>As the terrifying energy reverberations flowed through the air, Zhou Weiqing’s gaze fixed upon the dragon, carefully lowering his dragon’s cry.</p><br/><p>The massive dragon’s eyes were also fixed upon him, the crazed aura in its eyes filled with a hint of confusion. Just like what Zhou Weiqing feared, it seemed to be unable to recognize him fully.</p><br/><p>As Zhou Weiqing slowly stopped the dragon’s cry, his left hand was behind his back, waving frantically, motioning the four girls to step further away. However, at such a period of critical danger, how could the four of them be willing to allow him to stay there alone? This was especially so for Shangguan Xue’er, and she was standing by Zhou Weiqing holding his arm, showing her resolve that she would live and die with him.</p><br/><p>Although Zhou Weiqing had not felt that she was wrong at all, in Shangguan Xue’er’s heart, she had let him down. Currently, facing the massive dragon, she was actually the one with the least fear in her heart. At least, if they really died here together, she would be able to die with him, and there was no longer any need to think about responsibilities.</p><br/><p>As the fiery red light flickered around them, sweat beaded around Zhou Weiqing’s head to fall constantly. How could he not be nervous? Especially now that he was being stared at by the massive dragon, the pressure on him was definitely the greatest.</p><br/><p>“Bro Dragon, do you still recognize me? Do you remember three years ago when your child was born? We were there… We have no ill intentions… Can we talk?” Zhou Weiqing tried to have his voice as gentle as possible as he spoke slowly at the dragon. In fact, he even infused some Saint Energy into his voice as he spoke, filling it with a deep magnetization, and even the girls who heard his voice felt their emotions soothed slightly.</p><br/><p>The confusion in the dragon’s eyes slowly vanished, but the red in them did not. Its emotions were still clearly distraught and unstable. “Humans… you are humans… humans need to die… die… die…”</p><br/><p>With that low angry howl, the pressure which had been held back suddenly increased once more, and Zhou Weiqing and the others suddenly felt their legs sink into the ground as blood spurted out from their mouths.</p><br/><p>In front of the Heavenly God Tier powerhouse, no matter if it was just their pressure, it was like a natural disaster to them.</p><br/><p>“Senior, please wake up!” Tian’er was right beside Zhou Weiqing, and as she cried out, her eyes turned purple as two bright purple lights shot forth from them towards the dragon’s eyes. Within the purple light, there was a faint hint of silver white as well.</p><br/><p>The dragon was clearly not in sound mind, and for it to wake up, they had to calm down its emotions. Tian’er’s Spirit Attribute was one of the four Saint Attributes, and as she released the two bouts of spiritual shocks, a gold light filled with divine aura shot forth from the God Spirit Staff in Tian’er’s hands, landing on the massive dragon.</p><br/><p>This was the Divine Attribute’s Light of Healing, accompanying the spiritual shocks specialised to heal those whose spirits and minds are in trouble. Although dragons have a strong resistance and even immunity to many elements, this was after all healing, not an attack, and the resistance would be limited. Furthermore, Tian’er had infused some Saint Energy into these Skills, and even the dragons would also be affected by the Saint Energy.</p><br/><p>The gold light and purple light landed on the dragon almost simultaneously, causing it to give off a low roar as it raised its head.</p><br/><p>That really gave Zhou Weiqing a big scare, as the five of them stared into the dragon’s eyes. If the dragon really attacked them, they would have to give a last ditch fight, and whether or not any of them could escape would be down to luck.</p><br/><p>It seemed that luck was on their side after all. The dragon’s attack did not come, and accompanying the low and pained roar was the sudden vanishing of the pressure on them. When the dragon lowered its head once more, they could hear heavy breathing from it, as drool dripped down from its mind. Although its emotions still seemed unstable, there was a light in its bloodshot eyes as a hint of consciousness had come to them.</p><br/><p>Tian’er’s choice definitely had her reasons behind it, as she had recognized that this dragon was not the final male dragon that had appeared last in the Lustre Spatial Realm, but the mother dragon who had given birth to her child.</p><br/><p>At that time, Tian’er had healed this mother dragon before, and she believed that the mother dragon would possibly recognize her Divine Attribute. As such, she attempted to use her healing to try and rouse the dragon.</p><br/><p>“Such a familiar energy… a familiar aura. It’s you?” The dragon’s eyes landed on Zhou Weiqing once more, and the original enmity in them slowly dissipated.</p><br/><p>“Senior, how are you. I do not know what happened, that you are in such rage?” Zhou Weiqing asked tentatively.</p><br/><p>The dragon seemed to have fully awakened by now, but upon hearing Zhou Weiqing’s words, its eyes were filled with pain and sorrow. Lowering its head, it looked at Zhou Weiqing, and sensing the strong dragon bloodline scent in him, the craziness in its eyes subsided slowly.</p><br/><p>“My husband… my child… my husband… my child!!” The dragon’s voice was actually trembling. Such a powerful Heavenly God Tier powerhouse, yet it was sobbing in sorrow, its emotions actually affecting all five of them.</p><br/><p>Although it was just a few simple words, but Zhou Weiqing heard so many things within. It looked like the male dragon who had given him the Solidified Dragon Spirit and the dragon bloodline, as well as their child, had something happen to them. Yet… in this Lustre Spatial Realm, who could possibly even pose a threat to them?!</p><br/><p>Was it humans? From the dragon’s previous strong enmity, Zhou Weiqing immediately thought of the answer. However, that only increased the confusion in his heart. How could humans possibly threaten them? After all, in the Lustre Spatial Realm, only those below the age of thirty could enter!</p><br/><p>The dragon’s sorrow lasted a long time before it finally calmed down once more; lifting up its head, a sorrowful dragon’s roar burst forth, rumbling throughout the entire Lustre Spatial Realm, causing the entire realm to shake violently. The crazed aura that had just subsided began to rise once more.</p><br/><p>Tian’er dared not risk it, quickly releasing her Divine Light of Healing to bathe the dragon once more, trying to calm its fury down.</p><br/><p>The dragon’s roar lasted for quite a while before finally settling down, as its head lowered, its gaze landed upon Zhou Weiqing and the others once more. “Come with me.”</p><br/><p>In the low voice, the dragon slowly turned around, its massive wings beating as it flew off. Zhou Weiqing quickly signalled towards the four girls before taking off in flight after the dragon. Although his body was still injured, he could still barely maintain flight.</p><br/><p>The dragon was truly the lord of the Heavenly Beasts indeed. Wherever it passed, the thick fire attribute energies automatically spread aside, as if receiving their king or emperor, and the surroundings became clear once more.</p><br/><p>The current Lustre Spatial Realm looked so different from the previous time they had entered, with burnt ground everywhere, and only some hills and mountains could be seen in the distance.</p><br/><p>Led by the dragon, they flew almost an entire hour before they reached the foot of a tall mountain, and a massive cave entrance was before their eyes.</p><br/><p>Although they would always be teleported to a different place every time they entered the Lustre Spatial Realm, Zhou Weiqing could recognize that this cave before his eyes was the exact same location where the mother dragon had birthed the dragon egg last time. A sudden feeling of unease suddenly entered his heart. What had actually happened?!</p>\n</div>"}