{"title": "Chapter 672", "id": 672, "volume": 7, "url": "http://boxnovel.org/heavenly-jewel-change-chapter-672", "volume_title": "Volume 7", "body": "<h1>Chapter 672</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>At this point, she had no other choice, and she could only trust these humans in front of her. This was her last chance.</p><br/><p>“Let us begin then, thank you all.” The last words were extremely earnest, her eyes filled with gratitude. In the next instant, a thick red light sprang forth from her body, slowly infusing into the male dragon, Hui Yao’s body.</p><br/><p>When Duo Si released her Heavenly Energy, Zhou Weiqing and the others couldn’t help but feel shocked inside. The sheer terrifying presence of the Heavenly God Stage Heavenly Energy, even if it wasn’t directed against them, they could still feel the massive pressure.</p><br/><p>With the infusion of Duo Si’s Heavenly Energy, Hui Yao’s body lit up with a faint red glow. In this instant, if they did not know he had long since passed away, none of them would have imagined this was actually a corpse. The aura that was emitting from Hui Yao’s body was just that terrifying.</p><br/><p>Zhou Weiqing nodded towards Tian’er, holding her hand as they moved towards Hui Yao. Duo Si had already covered the majority of Hui Yao’s upper body with her wings, and Zhou Weiqing deliberated for a moment before he made his choice, placing his target on one of Hui Yao’s claws.</p><br/><p>Taking a deep breath, Zhou Weiqing was in currently in tip top condition as he steeled himself. His right hand holding onto Tian’er’s hand, the large Saint Energy whirlpool forming between them, the dimming silver light springing forth once more around the two of them, especially around their joined hands, where the faint light of the whirlpool could be seen. In that instant, a faint aura rose about the two of them, and even Duo Si’s terrifying Heavenly God Tier energy reverberations were no longer able to affect their aura.</p><br/><p>Zhou Weiqing’s left hand slowly rose up, a thick grey colour swirling around it, covering his entire palm. The aura filled with the Demonic energies caused his entire palm to turn a greyish crystalline state, and in the center of his palm, there was another small grey whirlpool.</p><br/><p>A light flashed in Zhou Weiqing’s eyes, and at last he placed his left hand onto the massive claw in front of him. The next moment, the wings behind his back unfurled instantly as he entered the Tiger-Dragon Transform, plunging into the Ice Cold Perception immediately to sense the changes in the dragon’s body.</p><br/><p>Within a moment, Zhou Weiqing could sense the destructive power that Tian’er had spoken about.</p><br/><p>Originally, Zhou Weiqing was still suspecting if this destructive energy was similar to that of the Blood Red Hell disciples he had experienced previously. However, when he actually came into contact with this power, he knew he was wrong. At least, from his current senses, the terrifying power within the dragon’s body was not on the same level as that of the Blood Red Hell disciples and their Destruction Attribute.</p><br/><p>If one were to liken the Destruction Attribute of the Blood Red Hell disciples as full of destructive capabilities and excluding all other attributes… then the current energy in the dragon’s body was truly the power that could destroy worlds, heaven and earth alike.</p><br/><p>The purest black energy. There was no way to determine whether it was in a gaseous or liquid form, but just the slightest sense of the terrifying energy reverberations caused Zhou Weiqing to feel as if his entire body was plunged into ice cold water. Due to the fact he was in the midst of the Ice Cold Perception, his senses were so sensitive that in that moment, he felt as if his entire spirit was about to be doused by the terrifying destructive aura.</p><br/><p>His own body shuddering violently, Zhou Weiqing felt his hand was almost ‘bounced’ away. In that instant, the large Saint Energy whirlpool activated, a thick Saint Energy suddenly infusing into every corner of his body, including his inner spiritual world.</p><br/><p>A vast, boundless Saint Energy aura, filled with life and the power of creation, forcefully removed the terrifying destruction aura from his spiritual inner world.</p><br/><p>In that moment, Zhou Weiqing could clearly sense that within the confines of Hui Yao’s body, a pure red energy of fire suddenly enveloped the pitch black destruction energy. Clearly, Duo Si had taken action.</p><br/><p>Without any other thoughts about having a lucky fluke, Zhou Weiqing instantly circulated the Saint Energy all around his body before infusing a large amount into his Devour Skill. Instantly, the grey and silver lights began to intertwine around his left hand, glowing brightly as the Devour Skill was unleashed. A strong suction force began to transfer into the massive dragon body of Hui Yao, drawing upon the destruction energy to begin flowing out slowly.</p><br/><p>The Devour Skill truly lived up to its name as the most powerful Demonic Attribute Skill. Even Duo Si was unable to force out the destructive energies, but with the Devour Skill, the destructive energies began to shudder.</p><br/><p>A trace of pitch black energy began to charge towards Zhou Weiqing’s Devour Skill, along the dragon’s massive blood vessels, as if sensing danger and retaliating. This thread of destructive energy might be small, but its offensive power was brutal and unreasonably powerful, as if it held life of its own.</p><br/><p>Naturally, Zhou Weiqing dared not be careless and underestimate it. Gritting his teeth with full preparation, he began to draw the thread of destructive energy into his own body.</p><br/><p>*BANG*</p><br/><p>Just as the pitch black energy entered his body, Zhou Weiqing felt as if his entire body was about to explode. Just that tiny amount, a single thread, its power was already far beyond all of the Destruction Attribute power that the entire Dan Dun Battle Team had unleashed on them.</p><br/><p>This was especially so in terms of the state and stage it was at, far beyond that of the Dan Dun Battle Team, especially since there was a shade of the Will of Destruction held within, almost causing Zhou Weiqing to break down instantly.</p><br/><p>Standing behind Zhou Weiqing and Tian’er, the three Shangguan Sisters could clearly see that in that instant, Zhou Weiqing’s clothes billowed out to almost bursting point, his twenty eight energy whirlpools of his Death Acupuncture Points expanding to their limits, and they could even clearly see the swirls of air current that these Death Acupuncture Point whirlpools were spinning and drawing in. In that moment, a layer of fine, black lined tattoos began to appear all around Zhou Weiqing’s originally silver-white body. His appearance was horrific, as if about to break down at any moment.</p><br/><p>Zhou Weiqing grit his teeth as he endured through it all, the Saint Energy within his body pouring out without any restraint. He knew that the start was always the most difficult, and if his Devour Skill could not take care of this first thread of destructive energy, he would not be able to survive. No matter what, he had to take the risk and use all he had to overcome this first barrier.</p><br/><p>Luckily, with Duo Si’s help, the vast majority of the destructive energy was imprisoned in Hui Yao’s body, otherwise, if Zhou Weiqing continued Devouring, perhaps just another small thread entering his body simultaneously would be enough to cause him to disintegrate.</p><br/><p>Still, Saint Energy was after all Saint Energy, and by now, both Zhou Weiqing and Tian’er could clearly sense that the large Saint Energy whirlpool was beginning to spin at an unprecedented speed. As for the Devour whirlpool that was around Zhou Weiqing’s left hand, it was also spinning like a small scale Saint Energy whirlpool at breakneck speed, constantly eating away, and transforming the tiny thread of powerful destructive energies.</p><br/><p>In such a short period of time, Zhou Weiqing was not only expending his own Saint Energy, even a large amount of Tian’er’s Saint Energy had been expended. However, to their shock, under such a circumstance, their large Saint Energy whirlpool did not seem to shrink at all. This could only mean that the energy Devoured and transformed into Saint Energy was able to completely make up for their vast expenditure!</p><br/><p>This was just a mere thread of destructive energy! For it to be able to turn into so much Saint Energy… could it be… this destructive energy was actually at a higher level than the Saint Energy?</p><br/><p>How was that possible? The Saint Energy was already the final product of the four Saint Attributes, what other energy could possibly be above it?</p><br/><p>Towards this problem, Zhou Weiqing quickly learned the answer. It was not that the destructive energies were at a stage above the Saint Energy, but rather the tiny bit of Will of Destruction within the destructive energy was perfectly married together, and more importantly compressing it to an unbelievable extent. As such, even a seemingly tiny thread of it was actually a horrifyingly huge amount. Although Zhou Weiqing and Tian’er’s Saint Energy was extremely powerful, they amount they had was after all extremely tiny, and they also had not truly grasped the full usage and underlying profound meanings behind the Saint Energy, only passively using some of its functions. With all of these reasons in mind, it was no wonder the Saint Energy seemed to be inferior to the destructive energies.</p><br/><p>Even so, Zhou Weiqing could sense that these destructive energies were perhaps at the same level as the Saint Energy. Even if it was slightly inferior, it was just a tiny half step behind. Compared to any single Saint Attribute, it was considered far superior already.</p><br/><p>The black tattoos around Zhou Weiqing’s body were slowly vanishing once more, and the silver-white light was brightening again. The facts had once again proven themselves… the combination of the large Saint Energy whirlpool and the Devour Skill was able to counter the destructive energies. If the current Zhou Weiqing or Tian’er had a Saint Nucleus Core, perhaps it would be extremely easy for them to Devour and Transform all of the destructive energies.</p><br/><p>Their success not only allowed them both to breathe a sigh of relief… on the other side, the mother dragon Duo Si began to look at them with a greater hope. It was the terrifying destructive energies which had almost taken away both of their lives, and if these youths could truly take care of these energies, then it was clear that the chance to revive her husband was much greater.</p><br/><p>With the first taste of success, Zhou Weiqing was able to continue Devouring with much more confidence. With a signal from him, Duo Si once again released another thread of destructive energies to be Devoured by Zhou Weiqing and into his own body.</p><br/><p>Perhaps because they already had experience, this time both Zhou Weiqing and Tian’er found it much easier to Devour and Transform the energies. Furthermore, they could now clearly sense that they were no longer ‘breaking even’ in terms of Saint Energy, but the overall amount of Saint Energy was actually steadily growing as they transformed the destructive energies.</p><br/><p>The destructive energies were indeed terrifying and filled with offensive power, yet one had to admit its purity was equally astonishing. In terms of quality, purity and density, a single drop of this destructive energy was able to transform into ten drops of Saint Energy. This was the reason why Zhou Weiqing and Tian’er could not only maintain their Saint Energy but also have it begin grow as they took on just a tiny amount of destructive energies.</p><br/><p>Thread after thread… Zhou Weiqing and Tian’er’s Saint Energy continued growing stronger and stronger as time passed slowly.</p><br/><p>Every cycle of suction, devouring, transformation… once that had been established into a rhythm, it all began to seem to simple. At least, now all of them could see hope in front of them.</p><br/><p>As the Saint Energy within Zhou Weiqing and Tian’er’s body grew steadily, it was also being used constantly. In this process of usage and growth, the Saint Energy was also circulating throughout their bodies, nourishing them, improving and evolving their physiques. Their overall amount of Saint Energy and Heavenly Energy was also growing at an astonishing pace.</p>\n</div>"}