{"title": "Chapter 676", "id": 676, "volume": 7, "url": "http://boxnovel.org/heavenly-jewel-change-chapter-676", "volume_title": "Volume 7", "body": "<h1>Chapter 676</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Shangguan Fei’er suddenly exclaimed, “Look at his wrists!”</p><br/><p>The three Shangguan sisters quickly shifted their eyes. Gaping in astonishment, their eyes widened in shock. Nine dazzling Heavenly Jewels were appearing on Zhou Weiqing’s wrists at this moment.</p><br/><p>This had completely gone beyond the logic that they understood. They thought to themselves, “In just 10 freaking days?! How could he possibly increase his level from the seventh to the ninth jewel in such a short time? He’s not even 22 years old yet for f*cks sake!” It was not that there was nobody who had managed to reach the Upper level of Heavenly Zong before 30 years old but it was extremely rare! From the looks of Zhou Weiqing’s current situation, it was very likely that he would be able to reach the Heavenly King level before he turned 30.</p><br/><p>The metallic light drew inwards all of a sudden, creating a series of strange changes on his body without warning. Like a golden statue descending from the sky, Zhou Weiqing landed on the ground lightly. All the domineering energy was absorbed back into his body, vanishing without a trace. At once, everything seemed to return to normal. Be that as it may, the four girls who were familiar with him could feel that the man in front of them was completely different from the man they knew.</p><br/><p>Before this, his looks could only be considered presentable, definitely not handsome. But now, there was a touch of wild and rugged charm about him. Radiant light sparkled from his eyes, as sharp as a treasured sword, giving off a feeling of a destructive artifact that would destroy his enemies anytime he liked.</p><br/><p>What was even more shocking was the fact that in just a short amount of time, all the Atmospheric Energy from at least several hundred square meters away was completely absorbed by him. Currently, the Atmospheric Energy from the outside world was flowing towards the now empty region, resulting in a massive energy ripple that left a deep impression on everybody.</p><br/><p>The Ninth Jewel, Upper Level Heavenly Zong. To most Heavenly Jewel Masters, this was probably the highest level that they could achieve in their entire lives. Zhou Weiqing had managed to achieve such a feat in just a short amount of time. Currently, he possessed a massive amount of Heavenly Energy and by the time he was equipped with a fitting Ringless Ground Purging Set, his power would no doubt be elevated a few times higher. Then, if by chance, he came face to face with someone on the Heavenly King tier, there would still a possibility of him winning the battle. “H-How is this possible?” Shangguan Xue’er muttered to herself as she stared at Zhou Weiqing skeptically.</p><br/><p>As the heir to the Heaven’s Expanse Palace, she had known all along that she was much more outstanding than the other Heavenly Jewel Masters who were the same age as her. However, right now, looking at Zhou Weiqing who had already mastered nine jewels, she knew that in this instance, she was no longer in the same league as him.</p><br/><p>After a short period of surprise, Xue’er was able to piece the puzzle together. Other than the Saint Energy, what other things out there could have such a remarkable effect? However, the three Shangguan sisters were not able to cultivate the Saint Energy. Even Xue’er felt slightly surprised looking at Zhou Weiqing who had grown so strong. However, she did not feel the slightest bit of jealousy nor did she feel the desire to contend for the upper hand at all. Instead, she felt very happy for him.</p><br/><p>She was taken aback by her feelings, she thought to herself, “C-Could it be that I’ve acknowledged the fact that I’m his? And I’m totally okay with being his sidekick?” Looking at her own two sisters and Tian’er, Xue’er sighed helplessly, “He is such a playboy!”</p><br/><p>Lowering his head to look at his own body, Zhou Weiqing could feel that his entire body was filled with an energy that was about to explode at any given time. What was even more strange was the fact that there were some changes in the color of his Saint Energy. The originally silverish white color now had a touch of gold in it like a layer of film coating the Saint Energy.</p><br/><p>The Saint Energy was the highest level energy that had ever existed. Seeing the layer of gold that was still rich in color and not diffused by the Saint Energy, it must have meant that the layer of energy must be at an equally high level as well.</p><br/><p>That was the effect of the Immortal Deity Technique after it was fully completed. Even Zhou Weiqing had no idea what it was but he could clearly feel the aura of tyranny that it possessed.</p><br/><p>Zhou Weiqing was not the first person to cultivate the Immortal Deity Technique. However, he was definitely the first to complete its entire cultivation, opening up all 36 major Death Cultivation Points successfully.</p><br/><p>When the Saint Energy was revolving around his body, it could already self-coordinate and after the whirlwind-like devour earlier, he noticed that the mini Saint Energy Whirlpool in his body had already vanished without a trace, leaving only the whirlpools that were activated by the 36 major Death Acupuncture Points. Be that as it may, the whirlpools had all completely transformed into the purest Saint Energy. In the swirls of the whirlpools, the Saint Energy had started to circulate in his body. In other words, he no longer had to worry about his Saint Energy being depleted and not recovering at all.</p><br/><p>He had completely transformed his Heavenly Energy into Saint Energy with the Immortal Deity Technique and from now on, he would only possess Saint Energy in his body, there would be no more of Heavenly Energy.</p><br/><p>Perhaps it was because that transformation that the Heavenly Jewels on Zhou Weiqing’s wrists began to show peculiar changes. The Ice Jade Physical Jewel on his right hand had completely turned into silverish white in color, the color of the Saint Energy, while the Alexandrite Cat’s Eye Gem Elemental Jewel had an additional layer of golden luster on the outside.</p><br/><p>Even though Zhou Weiqing had no idea what level he was currently at, there was one thing that he was sure about. He no longer felt the immense pressure that he first felt when he was facing Duo Si the dragon.</p><br/><p>For the sake of cultivating the Immortal Deity Technique, he had been through a lot of hardship for it. He had finally, finally cultivated the technique to its highest level. Even if he had no idea how or where he was going to proceed next on the cultivation path, at the very least, he had completely mastered the Immortal Deity Technique. The pain and worries that he once had to endure for the sake of this cultivation were gone with the wind. He could not help but whistle loudly again, expressing the great joy and satisfaction in his heart. He felt truly at ease and pleased.</p><br/><p>“Congratulations, young man. Even I cannot see your true ability now,” Astonishment filled Duo Si’s eyes that also had a hint of joy in them. Without a doubt, Zhou Weiqing’s breakthrough was absolutely good news for her. The chances of reviving her husband was bound to be much higher now.</p><br/><p>“Let us start,” Looking at Duo Si’s hopeful eyes, he nodded his head at the dragon. After such a long time here, everything was finally ready. It was time to resurrect Hui Yao the dragon.</p><br/><p>Staring at Zhou Weiqing, Tian’er’s heart was filled with pride. Despite the fact that she was only at the Seventh Jewel stage, her man had become so powerful and strong. Somehow, she was much happier for him than her elevating her cultivation base herself. Furthermore, she knew that even her own father would never be able to achieve Zhou Weiqing’s cultivation base when he was at Zhou Weiqing’s age.</p><br/><p>Zhou Weiqing pulled Tian’er’s hand and walked towards Hui Yao again before telling Duo Si, “Duo Si, please stay close to me. If Tian’er doesn’t have enough power to finish the process, I would need to borrow your power.”</p><br/><p>Duo Si stepped forward and immediately, it reached their side in just a single huge stride. Again, it bent down and said, “Thank you so much for your help. As long as my husband is resurrected, I’m willing to do anything for it. You can use my strength as you like.”</p><br/><p>While she spoke, she lifted her dragon claws towards Zhou Weiqing and at that moment, its heart was filled with deep anxiety. As the saying went – higher expectations will lead to greater disappointments. It did not know whether it would lose its mind if the resurrection somehow did not go as well as it had hoped.</p><br/><p>Zhou Weiqing consoled the dragon earnestly, “Don’t worry, Duo Si. No matter what, we will do our best to help you resurrect Hui Yao. Who knows, perhaps we can resurrect him without even using your power at all. Right now, I’ve complete confidence that Hui Yao will stand in front of you once again.</p><br/><p>It was not just an empty promise. The Saint Energy in his body was finally able to regenerate on its own, which meant that he could deliver a great deal of Saint Energy to Tian’er during the resurrection process. A Resurrection Skill that had sufficient Saint Energy would enhance the probability of success by manifold.</p><br/><p>Zhou Weiqing nodded towards Tian’er, “Let’s do it!”</p><br/><p>Just from the thoughts in their mind, the huge Saint Energy Whirlpool that was being led by him activated again. Currently, Zhou Weiqing could feel that he was completely different from before. Like a deep ocean, the huge whirlpool that he led seemed to be boundless with no end.</p><br/><p>A dark golden light lit up, and the God Vanquishing Heavenly Spirit suit appeared on Tian’er’s body. Under the shrine of the Saint Energy, her divine aura was immediately enveloped by a layer of golden divine luster.</p><br/><p>Holding her God Spirit Staff up high, she chanted a series of incantations. It was a language that Zhou Weiqing and the three Shangguan sisters could not understand. However, nobody realized that Duo Si actually understood the language of this ancient incantation. At present, the technique that was needed to use the incantation had gone extinct. Feeling the divine aura that was beginning to grow in power coming from Tian’er’s body, Duo Si became even more hopeful than before.</p><br/><p>Slowly, the Heavenly Skill Image of the Divine Heavenly Spirit Tiger appeared behind Tian’er. In just a blink of an eye, the shadow solidified into a real solid matter, looking exceptionally vivid and stunning. With a loud roar, its gigantic body leaped down abruptly, entering her body from the behind.</p><br/><p>At once, bright glittering golden luster erupted from her body. That rich, flavorful divine luster even enveloped Zhou Weiqing body. The rich Heavenly Energy’s ripples began to climb steadily until it reached the peak. Tiger tattoos began to form on Tian’er’s delicate skin as well. Still, the tattoo was different from the one that Zhou Weiqing had during his Demonic Change last time. The tiger tattoo on her body was more like an accessory, giving her an aura of ruggedness and wildness to her originally stunning body.</p><br/><p>In stark contrast to the divine golden luster that erupted from her entire being, Tian’er’s eyes turned into a shade of deep purple. Purple lights could be seen shooting out from her eyes, carrying with it a strong and powerful mental ripple.</p><br/>\n</div>"}