{"title": "Chapter 689", "id": 689, "volume": 7, "url": "http://boxnovel.org/heavenly-jewel-change-chapter-689", "volume_title": "Volume 7", "body": "<h1>Chapter 689</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Er Chun’s expression turned extremely gloomy, and there was still a hint of unconcealed shock in his eyes. As a Heavenly Jewel Master who had the highest cultivation base among all who were present, he knew how difficult it was to make the Consolidated Equipment Scroll in an instant. Not only did creating a Consolidated Equipment Scroll require Spatial Attribute Heavenly Energy, but it also required the combination of Consolidated Equipment Liquid, meticulous control of timing, and pacing. Every single aspect mattered.</p><br/><p>Moreover for Zhou Weiqing to speedily produce a Consolidated Equipment Scroll, just his pacing alone was completely thrown out of the window, much less anything else. Also, if a person who could easily create a Consolidated Equipment Scroll claimed to have the abilities of a God Tier Master, there was no reason not to believe him.</p><br/><p>After a series of changes in his expression, Er Chun forced a smile that was uglier than a cry. “Master, please forgive me if I’ve offended you. It was my mistake for not being able to save them. You cannot be blamed.There’s no doubt that you’ve passed, and qualify to participate in the finals for the talent selection. Furthermore, I believe that you’ll shine in the finals and definitely join the Mysterious Heavenly Palace.”</p><br/><p>There was nothing else that Er Chun could do. If the upper management knew about this, it would be the end of his time in the Mysterious Heavenly Palace. Compared to the benefits he received from Sang Tan and the others, his position in the Mysterious Heavenly Palace was clearly more important. Moreover, who would offend a God Tier Master? Any ordinary person would absolutely choose not to. Therefore, no matter how much resentment and depressed he felt, he could only bear with it. He did not dare to express his feelings at all.</p><br/><p>Zhou Weiqing smiled lightly before he said sarcastically, “That’s great. But is Master Er Chun not feeling well? Your response was too slow.” After throwing the sarcastic remark at him, Zhou Weiqing floated off the stage and grabbed Bing’er’s hand before he turned and left.</p><br/><p>He had written down the address of the hotel he was staying in when he registered, so someone could naturally send the recommendation qualifications for the finals to him. The Heavenly Jewel Masters opened up a path for him when he walked past them. Under the burning gazes of everyone, Zhou Weiqing left hand in hand with Shangguan Bing’er.</p><br/><p>On the platform, Sang Tan was so mad that he fell into a stupor. Er Chun did not dare to play favorites anymore as he proceeded with another round of trials and picked two participants to advance to the final. Only then did the entire farce come to an end.</p><br/><p>When they reached the hotel, Shangguan Bing’er said worriedly, “Little Fatty, don’t you think you overdid it? Besides, you’re not a God Tier Master! You’ll be easily exposed once you reach the Mysterious Heavenly Palace headquarters.”</p><br/><p>Zhou Weiqing chuckled. “Who told you that I’m not a God Tier Master? With the necessary papers and materials, it’s not impossible to be one. Although I’m not at the Heavenly King Stage yet, with the help of Saint Energy, it’s not difficult to make a God Tier Master Level Consolidated Equipment Scroll. It wouldn’t cause too much of a trouble.”</p><br/><p>Shangguan Bing’er was stunned after listening to what he said. She found it hard to believe his words. “Your becoming of a God Tier Master is way to easy. Doesn’t it require experience?”</p><br/><p>Zhou Weiqing shook his head. “You don’t understand. The Saint Energy allows me to make a Consolidated Equipment Scroll with my skills. I can totally demonstrate a heaven-defying state. When has your hubby ever bragged? When the time comes when it is needed, you will naturally see it.”</p><br/><p>Ever since he found out about the selection, Zhou Weiqing had come up with two plans. One plan was to rely mainly on Shangguan Bing’er since her cultivation base was at the Seventh Jewel. It was a sure thing that she would become a core disciple of the Mysterious Heavenly Palace. When that happened, she could act as the leading role while he could act as support. He could lurk in the darkness, and there was definitely a chance for him to find out more about the Spatial Teleportation Stone while inside the Mysterious Heavenly Palace.</p><br/><p>The plan was safer, and the risk of exposure was relatively low. The way he saw it, there was only one flaw in his plan. It was Shangguan Bing’er’s beauty. In addition, the reason why Zhou Weiqing did not want to reveal his strength was that it would not gain him attention while he hid in the shadows. It would be easier for him to take action. However, what happened earlier during the selection was completely out of his calculations. He did not expect that the situation would turn out that way. If he did not show his ability earlier, he might not be able to advance to the finals. Moreover, since Sang De had crossed his bottom line, he thought he might as well kill all of the foppish sons and choose the second plan.</p><br/><p>The second plan was naturally exposing himself as a God Tier Master. The plan was more rigorous compared to the other. With this identity, it would not incur suspicion from others when he and Shangguan Bing’er used their Legendary Sets. Even as a God Tier Master, he could still conceal his cultivation base. The only problem was the plan was one that was of an excessively high profile. He was bound to attract the attention of others, including the upper echelons of the Mysterious Heavenly Palace, if he entered the Mysterious Heavenly Palace as a God Tier Master. That would greatly restrict his movements. However, similarly, the chances of him coming into contact with the Spatial Teleportation Stone would be greater.</p><br/><p>Back at the residence of Ubaatar City’s mayor.</p><br/><p>“Master, is my son just going to die in vain?” Sang Tan was breathing heavily as he slammed his fat hand on the table. There were only four people present. Besides the mayor and Er Chun, the other two were the men who had also lost their sons today.</p><br/><p>Er Chun’s face was twitching as he pointed at the things on the table. “I’m returning all these to you. All of you saw that what happened today. It was completely out of my control. Your sons are dead but…” He stopped and proceeded to emphasize, “You are still alive.”</p><br/><p>Er Chun stood up and left the moment he finished saying those words, leaving the three men stewing in anger. The three of them held significant positions in Ubaatar City. However, no matter how mad they were at the moment, there was nothing that they could do about it.</p><br/><p>God Tier Master! That man was a God Tier Master! How could they afford to offend him? What Er Chun said in the end was right. Although their sons were dead, they were still alive. The Mysterious Heavenly Palace would definitely come after them if they took revenge.</p><br/><p>Everybody knew that the Mysterious Heavenly Palace, which dominated the Mysterious Heavenly Mainland, only had two God Tier Masters. Those two God Tier Masters were supreme existences in the Mysterious Heavenly Palace, with extraordinary standing. Even the incumbent Mysterious Heavenly Palace Master had to be courteous towards them.</p><br/><p>After dinner, Zhou Weiqing pulled Shangguan Bing’er back to their room to do the thing that they enjoyed the most. Suddenly, a polite voice came from the other side of the door. “Master, Er Chun would like to see you.”</p><br/><p>Zhou Weiqing adjusted the playful grin on his face immediately into something a little more appropriate. His entire being exuded a poised bearing as he said indifferently, “Come in.”</p><br/><p>When the door opened, Er Chun walked in respectfully. His attitude was completely different from earlier. There was no wry or embarrassed expressions, only extreme politeness. He approached Zhou Weiqing with something in his hands.</p><br/><p>Zhou Weiqing took the main seat without inviting him to sit.</p><br/><p>“Master Er Chun, is there a reason why you’re here?”</p><br/><p>Er Chun hurriedly said in panic, “Please. You can drop the title. Just call me by my name. I’m here to deliver this to you. It’s a confirmation of both you and your wife’s place in the finals.”</p><br/><p>Er Chun passed the thing that he held in his hands to Zhou Weiqing as he spoke. They were two letters sealed with red wax and two black tokens. Zhou Weiqing took them and put them away in his Sumeru Ring.</p><br/><p>“Is there anything else?” Zhou Weiqing asked nonchalantly.</p><br/><p>Er Chun was sweating. He sent the things personally so that he could change the impression which Zhou Weiqing had of him. It would be the end of him if Zhou Weiqing reported what happened earlier to the Mysterious Heavenly Palace. He did not have any support in the Mysterious Heavenly Palace, or else he would not have been sent to such a remote city.</p><br/><p>“Master, I’ve already reported to the management about you. It was my fault what happened today. I allowed greed to blind me. It’s just that life is hard here in this shithole! Even the purchase of Consolidated Equipment Scroll requires me to earn the money by myself. I only resorted to that because I had no other choice. Your safety is important to us. I’m willing to escort the both of you personally to Heaven City. Also, here’s a gift from me. I hope you’ll accept it.”</p><br/><p>As Er Chun spoke, a box appeared in his hands magically. He passed the box reverently to Zhou Weiqing. Zhou Weiqing took the box, but his mind stirred a little. The moment the box appeared, a light fragrance suffused the air. It was a unique wood fragrance, the smell of agarwood. There was agarwood in the Boundless Mainland as well, and they were very precious. It was also one of the required ingredients to make Consolidated Equipment Liquid. The item that was in the box must be expensive judging from how precious the box was.</p><br/><p>Usually, it was considered rude to open a gift in public, but Zhou Weiqing was not bothered about that. He unlocked the box and opened it. The agarwood box was not light, and although it was made of wood, it would have sunken in water. Zhou Weiqing’s eyes immediately lit up. Even a knowledgeable person like him was pleasantly surprised when he saw the contents of the box.</p><br/><p>There was a layer of yellow silk at the bottom of the box that looked elegant. In the box, there were two lustrous pearls that were the size of a baby’s fist. Even ordinary pearls of this size and flawlessness would be priceless. Furthermore, the two pearls even suffused a golden color. They were one of the rarest types of pearls. Especially with the both of them being of nearly equal size, they truly could be considered rare treasures.</p><br/><p>There were pearls of white, black, and gold, in ascending order of rarity. It was hard for Zhou Weiqing to appraise how much the two big Gold Pearls cost. Shangguan Bing’er’s eyes lit up too. There were no ladies who did not like jewelry, especially something as precious as Gold Pearls.</p><br/>\n</div>"}