{"title": "Chapter 697", "id": 697, "volume": 7, "url": "http://boxnovel.org/heavenly-jewel-change-chapter-697", "volume_title": "Volume 7", "body": "<h1>Chapter 697</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>A Heavenly King Tier powerhouse was not just someone whose heavenly cultivation base had reached an extremely terrifying level. Similarly, the Spiritual and Soul Energy of the Heavenly King Tier powerhouses must have already reached a level that enables them to make Consolidated Equipment Scrolls.</p><br/><p>Even then, the body of a God Tier Master would generally not be very strong as the Spiritual Energy and Soul Energy consumption during the production of God Tier Consolidated Equipment Scrolls was too high.</p><br/><p>The Consolidated Equipment Scroll that Zhou Weiqing was making could be considered good. After all, it was his sixth Ringless Ground Purging Set. If it was the final few pieces, for example, the tenth Consolidated Equipment Scroll, the Spiritual Energy and Soul Energy consumption rate would be horrifying. This was also why Duan Tianlang taught Zhou Weiqing a lot of things. He was not sure about how much longer he could survive after helping Zhou Weiqing obtain the tenth Ringless Ground Purging Set.</p><br/><p>Zhou Weiqing initially did not know this. However, now that he was making the God Tier Consolidating Equipment Scroll, he gradually understood Duan Tianlang’s intentions.</p><br/><p>‘Is this just a big sham?!</p><br/><p>‘Will he succeed? Will he?!’ the God Tier Masters thought. At this time, the two God Tier Masters sat facing each other. Their expressions were no better than Zhou Weiqing’s condition. They had also expanded quite a large amount of Spiritual Energy. They tried to memorize each and every stroke made by the Consolidating Brush in Zhou Weiqing’s hand. However, Zhou Weiqing often used Time Reversal to repeat the steps, making it harder for them to remember the strokes.</p><br/><p>Naturally, they could also see that Zhou Weiqing was almost done with the Consolidated Equipment Scroll.</p><br/><p>A faint light flashed. Zhou Weiqing’s expression turned even more solemn. He knew that his Spiritual Energy could run out at anytime. However, faced with such a situation, the proud Zhou Weiqing became even more defiant and determined. He clenched his teeth and decided to persevere until the end.</p><br/><p>This was not only to complete the God Tier Consolidated Equipment Scroll but also to test his own willpower. If he could do it, it would be beneficial towards his cultivation in the future. He also believed that if he succeeded in making the God Tier Consolidated Equipment Scroll, he would be able to get his Saint Energy to break through to the 37th tier.</p><br/><p>With such temptation in front of him, how could he give up? If he were to give this opportunity up, no one knew when his Saint Energy breakthrough would take place in the future. Having reached the 36th tier, the following tiers could not be so easily broken through by just effort and hard work. Luck and opportunity were equally important. This current opportunity was a rare chance!</p><br/><p>The sky outside gradually turned dark. However, the other three people in the room did not bother lighting any candles because they feared that any small movement would cause Zhou Weiqing to fail.</p><br/><p>A faint light flashed again. Zhou Weiqing’s face was dripping with sweat. Only a little bit of the Consolidating Ink was left in the crystal vat.</p><br/><p>‘It is time for the final part.’ Zhou Weiqing’s pupils constricted to the size of a needle point. The Consolidating Brush in his hands started to tremble for the first time since he started.</p><br/><p>At that moment, the atmosphere in the entire cottage became heavy. It felt as though the air itself had solidified. Even Shangguan Bing’er’s fists were tightly clenched.</p><br/><p>‘Hm… Failed.’ the God Tier Master thought.</p><br/><p>At the moment when Zhou Weiqing’s was making his final stroke, the Consolidating Paper suddenly tore. He cast Time Reversal again. However, this time, Zhou Weiqing was trembling. The burden on his Spiritual Energy was so extreme that even his strong body could not take the strain. Blood flowed out of his nose, mouth, and ears. The blood snaked its way down his face, giving him a frightening appearance.</p><br/><p>‘I must succeed!’ Zhou Weiqing shouted in his heart. In a flash, his right hand turned silverish white in color and his trembling hands became stable.</p><br/><p>He no longer cared about other matters in his effort to complete the God Tier Consolidated Equipment Scroll. He had to complete it even if he risked exposing the profound mysteries of Saint Energy. Otherwise, if he failed, it might cause the cultivation progress of his Saint Energy to be stunted.</p><br/><p>Zhou Weiqing was very confident before he started making the God Tier Consolidated Equipment Scroll. With Time Reversal and the Ninth Jewel cultivation, he believed that he was not inferior to any of the Heavenly King Tier Masters. In reality, after he tried making it himself, he understood how difficult it was to make a God Tier Consolidated Equipment Scroll. If he did not have Time Reversal, he would have failed at least a hundred times already. However, an ordinary God Tier Master would need to complete it without making a single mistake.</p><br/><p>It could be said that there was still an insurmountable moat between Zhou Weiqing and a real God Tier Master. However, with Time Reversal, he had forcefully defied natural order.</p><br/><p>At this time, the two God Tier Masters did not notice the changes in Zhou Weiqing’s Heavenly Energy. Their eyes were on the almost completed scroll that kept going back in time.</p><br/><p>The last stroke that a God Tier Master made was usually the one that would bring the most enlightenment. They were no exception. The aura emitted by the silvery-white light and Saint Energy from Zhou Weiqing’s hands felt as if it originated from the essence of the world. Both of them chose to ignore it. After all, it had nothing to do with them. On top of that, Zhou Weiqing had already showed them too many miracles. They thought Saint Energy was simply one of the secret techniques of the Strength Legacy.</p><br/><p>The gleaming light continued drawing, and the silvery material continued etching. Zhou Weiqing’s Consolidating Brush started drawing again. At this point in time, the blood from his face was still dripping profusely. It caused him to look even more terrifying than before.</p><br/><p>Suddenly, the bright and silvery light from the Consolidating Paper flared up. The thick silvery waves converged into a very strong ball of light. The blood dripping from Zhou Weiqing’s face instantly vaporized. Zhou Weiqing himself was also knocked back a few steps. He did not fall down thanks to Shangguan Bing’er’s support.</p><br/><p>On the yellow rosewood table, the ball of silver light glowed brighter and brighter. The Atmospheric Energy in the air rushed into the scroll crazily as though it had come to life.</p><br/><p>A Consolidated Equipment Scroll of any level would absorb Atmospheric Energy upon completion. The only difference was the amount it absorbed. A Mid and High Level Consolidated Equipment Scroll only absorbed a very small amount. A Heavenly Jewel Master would not even be able to detect it. The difference in absorption rate would become more obvious at the Grandmaster tier. As for God Tier Consolidated Equipment Scrolls, the absorption of Atmospheric Energy could only be described as terrifying. If it had to be quantified, it would absorb the Atmospheric Energy equal to the Nucleus Core of a Heavenly King Tier.</p><br/><p>That is why a God Tier Master would choose a place with plenty of Atmospheric Energy to make a scroll. This was also one important reason why the Heaven’s Expanse Palace was able to win over the Three God Tier Masters. On the Boundless Mainland, there were not many places that could compare with the Heaven’s Expanse Palace when it came to the density of Atmospheric Energy. Naturally, it was also possible to do it at the Heavenly Snow Mountain. However, compared to the Heaven’s Expanse Palace, the people there were of a different race, and there was also a slight difference in Atmospheric Energy.</p><br/><p>There was no doubt that this place here was rich in Atmospheric Energy. When Zhou Weiqing had finished the production of the scroll, he could clearly feel a large amount of Atmospheric Energy pouring in from every direction into the cottage that was sitting in the middle of the valley. The place was extremely rich in Atmospheric Energy.</p><br/><p>Although Zhou Weiqing did not know what caused this phenomenon, it was clear that the abundance of Atmospheric Energy in the area was something natural and not created by men.</p><br/><p>The silver light turned pale gold before it became bright gold. Finally, it became a dark, thick golden color.</p><br/><p>Suddenly, all the lights converged. It did not spread out. The turbulent Atmospheric Energy around the cottage also disappeared suddenly.</p><br/><p>Everything became silent. On the other side of the table, the two God Tier Masters seemed to have collapsed from exhaustion. Their eyes were closed, and their chests heaved up and down. It was obvious that they were exhausted</p><br/><p>Zhou Weiqing had a splitting headache. A dark golden scroll with a strange aura was floating on the yellow rosewood table. He breathed a sigh of relief before he turned his head and fell into Shangguan Bing’er’s embrace.</p><br/><p>In the entire history of God Tier Masters, a twenty year old God Tier Master had never existed before. It was even more impossible to find someone that could create a God Tier Consolidated Equipment Scroll the way Zhou Weiqing did. However, Zhou Weiqing had truly accomplished it.</p><br/><p>Shangguan Bing’er supported the unconscious Zhou Weiqing and sat down at the side. Zhou Weiqing was still filled with Saint Energy so he could continue maintaining a Five Jewel Cultivation Base. She knew that her man was fine and only needed to rest because he had used up too much Spiritual Energy.</p><br/><p>After half an incense time, the two God Tier Masters slowly opened their eyes. The first thing they saw was the scroll floating above the wooden table.</p><br/><p>The woman slowly got up. She was extremely slender and taller than Shangguan Bing’er by half a head. She waved her right hand and the scroll flew towards her palm and unfolded itself.</p><br/><p>She looked at the complicated and mysterious patterns on the scroll. Her beautiful eyes looked enthralled. The old man, standing by her side, also took a good look.</p><br/><p>“This is truly a God Tier Consolidated Equipment Scroll. It is not a Pseudo God Tier Consolidated Equipment Scroll.” The old man easily evaluated the scroll after taking just a few glances at it.</p><br/><p>The woman nodded and said, “He should not be called a genius. He should be called a strange genius, a monstrous talent, a peerless talent.” She lifted her head and looked at the unconscious Zhou Weiqing again.</p><br/><p>At that moment, Zhou Weiqing’s bloodstained face had already been wiped clean by Shangguan Bing’er. He remained unconscious in Shangguan Bing’er’s embrace.</p><br/><p>Shangguan Bing’er looked up at the two and asked suspiciously, “What is a Pseudo God Tier Consolidated Equipment Scroll?”</p><br/><p>The woman froze. “Has he never told you?”</p><br/><p>Shangguan Bing’er shook her head. “I’m not a Consolidating Master. Also, I would never want to trouble him.”</p><br/>\n</div>"}