{"title": "Chapter 691", "id": 691, "volume": 7, "url": "http://boxnovel.org/heavenly-jewel-change-chapter-691", "volume_title": "Volume 7", "body": "<h1>Chapter 691</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Was there anyone that disliked traveling in comfort? Even though they were traveling in such a comfortable carriage, this would affect their cultivation and training. Zhou Weiqing was close to breaking through to 37-tier Saint Energy, therefore he would naturally not let go of this precious opportunity here.</p><br/><p>Under the protection of Er Chun and the others, apart from Ubataar City, they would travel straight to the center of the Mysterious Heavenly Mainland. According to Er Chun, it would take 15 to 20 days to get to Heavenly City.</p><br/><p>He took really good care of Zhou Weiqing and Shangguan Bing’er throughout the entire journey. He would feed them with delicious food from the Mysterious Heavenly Mainland. Zhou Weiqing and Shangguan Bing’er enjoyed the food and the beautiful scenery as they spent the rest of their time practicing. Traveling in the carriage was much more comfortable than traveling in the Neptune.</p><br/><p>In order to send them to their location in the fastest possible time, Er Chun and the rest barely had any time to rest because they were constantly on the road. Once in a while, they would stop at a checkpoint to change the horses.</p><br/><p>It did not affect Zhou Weiqing and Shangguan Bing’er much. However, it was tiring for the Heavenly Jewel Masters who were protecting them. Thanks to their cultivation, they were able to hold up pretty well.</p><br/><p>Using just 14 days, they arrived at their destination. “Master, we’re entering Heavenly City soon.” Er Chun spoke from the outside of the carriage.</p><br/><p>“Yes.” Zhou Weiqing gave a short response as he flipped the curtain aside to look out of the window. He could see the skyline of the city. Compared to Zhongtian City, Heavenly City was much smaller let alone compare to the unique existence of the Heavenly Jewel Island. However, compared to most of the cities that he had been to, it could still be considered a big city, similar in structure to Fei Li City.</p><br/><p>Zhou Weiqing had been a little annoyed for the past few days. He could feel that his Saint Energy was on the verge of breaking through when he arrived at the Mysterious Heavenly Mainland. But during his cultivation in the past few days, he felt as though he was stuck in a bottleneck as he did not manage a breakthrough. He started to miss the days when he was practicing the Immortal Deity Technique. Although it was hard, the speed of breaking through was fast.</p><br/><p>Still, he had been cultivating diligently even though there were no signs of a breakthrough yet. Most Importantly, there was no set cultivation method for this Saint Energy, so he had no idea how he could break through to the next level. All he could do was to continue cultivating. It was just the first tier of Saint Energy since he entered the Ninth Jewel, and yet, it was already so difficult to breakthrough. Naturally, his mind wandered toward the difficulty of forming a Saint Nucleus Core.</p><br/><p>Although he was annoyed while he was troubled by it, there was nothing that he could do. Shangguan Bing’er had comforted him a few times over this matter. After all, he was already at the Ninth Jewel. It was the same for any Jewel Master. The path of cultivating beyond this tier would definitely slow down eventually. Otherwise, why would the number of Ninth Jewel Heavenly Jewel Masters outnumber the Heavenly King Masters?</p><br/><p>Er Chun got closer on his horse and said to Zhou Weiqing, “Master, would you prefer to head directly to the Mysterious Heavenly Palace or would you prefer to rest somewhere else first?”</p><br/><p>Zhou Weiqing stared at him as he responded, “Why would we head to the Mysterious Heavenly Palace right now? It’s not the time for the finals, wouldn’t it be bad to enter so casually?”</p><br/><p>‘You’re a God Tier Master, why would you even join the Mysterious Heavenly Selection finals?’ Er Chun thought to himself but he did not dare to contradict Zhou Weiqing. Since they had already arrived at Heavenly City, Er Chun was close to completing his mission, and with that, he nodded his head.</p><br/><p>Upon entering Heavenly City, they checked into a luxurious hotel. Er Chun did not dare to rest as he ordered his men to protect Zhou Weiqing and Shangguan Bing’er in the hotel while he went to the Mysterious Heavenly Palace.</p><br/><p>The luxurious room was quite spacious at 200 square meters. The amenities were sophisticated as well. Zhou Weiqing leaned on the soft leather couch while he was deep in thought.</p><br/><p>Meanwhile, Shangguan Bing’er looked out the window. This place was a Human World after all. There weren’t many places that were that different compared to the Boundless Mainlands.</p><br/><p>Shangguan Bing’er turned around and asked Zhou Weiqing, “Little Fatty, what do we do next?”</p><br/><p>Under the bright sunlight, she was bathed in a golden light. Zhou Weiqing could not help but be mesmerized by her as he gestured for her to come over.</p><br/><p>Shangguan Bing’er walked to the couch and fell into his arms. Zhou Weiqing spoke to her in a low voice. “Bing’er, we’ll have to be careful whenever we talk. I don’t have any specific plans. For now, we’ll just have to play it by ear. Our priority is to get into the Mysterious Heavenly Palace.”</p><br/><p>Shangguan Bing’er looked at him doubtfully. “In that case, why did you reject Er Chun when he said he wanted to send us directly into the palace?”</p><br/><p>Zhou Weiqing smiled as he said, “It’s not valuable if it’s free. We’ll have to play hard to get so that people will respect us. Don’t worry. Er Chun has already left to inform the palace of our arrival, hasn’t he? I’m sure there’ll be people coming to see us soon.”</p><br/><p>Shangguan Bing’er burst out laughing. “You’re such a scammer.” Shortly after, her smiling face tensed up a little.</p><br/><p>“Little Fatty, promise me. Don’t risk your life doing anything dangerous, no matter what, okay?”</p><br/><p>Zhou Weiqing did not reply her but just kissed her lips instead. On that cozy couch, he pulled her slender body deeper into his embrace.</p><br/><p>An hour later, Er Chun’s voice came from the other side of the door. “Master.”</p><br/><p>By that time, Zhou Weiqing had already taken a shower and changed into his clean clothes. At the moment, Shangguan Bing’er was peeling fruits to feed him. “Come in,” he said slowly.</p><br/><p>Er Chun opened the door and walked into the room. However, he only took a step in and gestured invitingly with his hands as he stepped aside.</p><br/><p>Following his gesture, a tall old man walked in. The old man was more than two meters in height. Even though he looked old with his white hair, his posture was good and his back was straight. His muscles made his clothes looked tight. In fact, he looked energetic and did not seem any weaker than a younger person.</p><br/><p>He was wearing the blue robe of the Mysterious Heavenly Palace, but Zhou Weiqing noticed there was a golden sun logo on the left side of his chest. It was clear that this man held a much higher position than Er Chun did in the Mysterious Heavenly Palace. Moreover, the power that he exuded was greater than Er Chun’s.</p><br/><p>Zhou Weiqing remained seated on the couch, he did not have the intention of rising up to welcome them personally. The old man stared at him. His eyes were like two sharp swords piercing into Zhou Weiqing’s eyes as a repressive aura was locked onto Zhou Weiqing’s body immediately.</p><br/><p>Zhou Weiqing continued eating fruits like he was unaffected by the old man’s aura. The aura seemed like it meant nothing to him at all.</p><br/><p>The old man ignored Zhou Weiqing and asked Er Chun, “Hmm, you’re really got some capabilities. Er Chun, this is the God Tier Master that you told me about?” His voice was deep and it had an intense vibration that echoed in one’s ears.</p><br/><p>“Yes, Elder. Master, let me introduce you to Elder Fei Lun. He’s one of the 12 Elders of the Mysterious Heavenly Palace. He’s responsible for foreign affairs.”</p><br/><p>Zhou Weiqing nodded and pointed at the couch next to him. “Elder, please take a seat.”</p><br/><p>Fei Lun waved his hand while Er Chun backed off and closed the door. He then walked to the couch opposite of Zhou Weiqing and sat down. He had retracted his intense aura from before.</p><br/><p>“Young man, Er Chun told me that you’re a God Tier Master?”</p><br/><p>Zhou Weiqing nodded. He remained aloof while he proceeded to eat the fruits that Shangguan Bing’er peeled for him.</p><br/><p>Fei Lun had anger in his eyes as he said, “You’re only a young brat. Aren’t you afraid of biting off more than you can chew?”</p><br/><p>Zhou Weiqing glared at him and grinned. “Ambition and capability aren’t determined by age. Even if I gave you a hundred years, you’d have lived your life for naught if you’ve got no ambitions.” When he said the latter half of the sentence, he made a deliberate insinuation at the Elder.</p><br/><p>With Zhou Weiqing’s Saint Energy cultivation, he could tell from the aura that Fei Lun released earlier that he was at the upper level of the Heavenly King Stage. However, it was still quite far off from the maximum level.</p><br/><p>Fei Lun looked even angrier after listening to Zhou Weiqing’s words. Regardless, he was an Elder of the Mysterious Heavenly Palace, not someone whose status could be compared to that of Er Chun. “I’m sure you know the penalty of deceiving the Mysterious Heavenly Palace. Of course, if you can prove that you’re a God Tier Master, let alone me, the Supreme Elders, heck, even the Palace Master will welcome you with open arms.”</p><br/><p>Zhou Weiqing smiled lightly. “With that said. Elder, are you’re here to test if I’m really a God Tier Master?”</p><br/><p>Fei Lun nodded, he had no interest in beating around the bush.</p><br/><p>Zhou Weiqing laughed out loud. “You want to do it here? It seems the Mysterious Heavenly Palace doesn’t know the proper way of welcoming a guest, eh? So how do I prove myself? Will making a God Tier Master Level Consolidated Equipment Scroll be enough?”</p><br/><p>“Of course,” Fei Lun replied.</p><br/><p>Zhou Weiqing scoffed coldly and stood up. “If that’s the case, Elder Fei Lun you can leave now. We’re not participating the Mysterious Heavenly Palace Selection Test anymore. Bing’er, let’s go.”</p><br/><p>Fei Lun was stunned that Zhou Weiqing’s attitude did not even change in the least. Hurriedly, he stood up and questioned them. “What do you mean by this?!”</p><br/><p>Zhou Weiqing scoffed once more in disdain. “As a Consolidating Equipment Master, making a Consolidated Equipment Scroll doesn’t only require materials and papers, the environment is crucial too. The thicker the Atmospheric Energy of a place, the easier it is to make Consolidated Equipment Scroll. I believe that you should know of these requirements, right?” He did not even bother to address him as Elder anymore.</p><br/><p>Fei Lun nodded instantly. Although he was not a Consolidating Equipment Master, he knew a thing or two about Consolidating Equipment Masters.</p><br/><p>Zhou Weiqing laughed coldly once more. “Elder, since you knew that, why would you ask me to make a God Tier Master Level Consolidated Equipment Scroll here? Is this the Mysterious Heavenly Palace’s way of showing their sincerity? If I had enough materials to make a God Tier Master Level Consolidated Equipment Scroll, why would I have come to the Mysterious Heavenly Palace?”</p><br/><p>“This…” Fei Lun was speechless as he frowned. “You should know that you don’t have to go through any assessment to enter the Mysterious Heavenly Palace if you’re really a God Tier Master. We’ll treat you as our guest of honor and treat you with respect as well. That said, we’ll still need you to prove that you’re a God Tier Master no matter what.”</p><br/>\n</div>"}