{"title": "Chapter 704", "id": 704, "volume": 8, "url": "http://boxnovel.org/heavenly-jewel-change-chapter-704", "volume_title": "Volume 8", "body": "<h1>Chapter 704</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Before Zhou Weiqing started making the Consolidated Equipment Scrolls, most of the people present did not believe the title he gave himself – the Fastest Consolidated Equipment Scroll Crafter in History. However, their doubts faded and disappeared as they watched Zhou Weiqing work his magic.</p><br/><p>It had only just begun. As soon as the two Consolidated Equipment Scrolls lit up in success, Zhou Weiqing slid three feet away. With just a slight flick of his hand, the residue liquid from the Consolidating Ink disappeared from the Consolidating brush. The Consolidating Brush could be controlled with just a thought from the Consolidated Equipment Master. That was the advantage of a high-quality Consolidating Brush.</p><br/><p>As the Consolidating Brush moved again, he opened two different Consolidating ink bottles again. His movement was fluid like water. Before the initial two lights from the successful creation of the Consolidated Equipment Scrolls faded away, another two lights shone out. The visual impact was just staggering. Everyone could see the two bright lights that lit up Shangguan Bing’er’s dark gold gigantic wings from left to right in a wave.</p><br/><p>From left to right, Zhou Weiqing only used five minutes to complete fifty Consolidated Equipment Scrolls. As the last two lights shot up to the sky, he had already moved back to the spot he was initially standing at when he was making the first Consolidated Equipment Scroll. He waved his left hand and all the completed Consolidated Equipment Scrolls rolled into his hand from left to right. Shangguan Bing’er straightened her back as the dark gold light faded away.</p><br/><p>The entire place was dead silent. As Zhou Weiqing looked around, he saw that most of the Mysterious Heavenly Palace’s powerhouses sitting below the stage looked shocked and their mouths were agape.</p><br/><p>‘When was the last time we’ve seen such a terrifying Consolidated Equipment Master?’</p><br/><p>That was right. ‘Terrifying’ was the only word that they could think of to describe Zhou Weiqing. Even the two God Tier Masters had never shown the audience such a performance before.</p><br/><p>In the Heavenly Jewel Master’s eyes, God Tier Masters were mysterious and powerful. However, Zhou Weiqing had completely overturned what they knew. With such powerful ability, arrogance was no longer arrogance but instead, a showcase of his confidence and abilities. Zhou Weiqing had used his actions to prove himself. It also allowed the upper echelons of the Mysterious Heavenly Palace truly understand him for the first time.</p><br/><p>The Heavenly Jewel Masters were not the only ones who were surprised. Even the two God Tier Masters standing behind Zhou Weiqing was similarly astounded. Meng Xing was still alright, but Nie Han’s eyes were wide open. He had managed to make fifty different types of Consolidated Equipment Scrolls with fifty different types of Consolidating Ink within such a short period of time. What kind of ability and foundation did he possess?</p><br/><p>Initially, Nie Han had thought Zhou Weiqing only managed to successfully make the Consolidated Equipment Scroll due to sheer good luck and his shameless use of the Time Attribute. He had thought the young man had great potential, but his foundation might not be any better than an average Master Tier Consolidated Equipment Master.</p><br/><p>However, what Zhou Weiqing had demonstrated earlier clearly showed that his prowess was not simply potential. The fact that he knew fifty types of Consolidating Inks for Master Tier Consolidated Equipment Scrolls as well as the methods to make the scrolls proved that he was a Consolidated Equipment Master that had inherited a particular legacy.</p><br/><p>“Clap! Clap! Clap!” The applause began, but the first to clap was Dongfang, the Palace Master of the Mysterious Heavenly Palace. It was only then that the Heavenly Jewel Masters from the Mysterious Heavenly Palace snapped out of their stupor. They followed the lead of the two God Tier Masters and four Supreme elders as they gave a thunderous round of applause. The way the four Supreme Masters looked at Zhou Weiqing became a lot friendlier. Zhou Weiqing’s age was also totally ignored by them. In this world, as long as one had the ability, nothing else mattered.</p><br/><p>The Mysterious Heavenly Palace Master smiled as he said, “Astounding! I can only use the word ‘astounding’ to describe you, Honorary Master Zhou. I believe no one will doubt you anymore. From today onward, Honorary Master Zhou will be one of the pillars of the Mysterious Heavenly Palace. I’d like to announce that the banquet has officially begun.”</p><br/><p>Because of Zhou Weiqing’s performance, the banquet’s participants became enthusiastic. The Mysterious Heavenly Palace Master walked over to Zhou Weiqing and toasted him. Following the Palace Master’s lead, more and more people came to toast Zhou Weiqing. Fortunately, the hierarchy in the Mysterious Heavenly Palace was very clear. The people who dared to toast him were at least Elders. The upper echelons who were sitting outside could only watch from far and raise their glasses.</p><br/><p>Apart from Zhou Weiqing, Shangguan Bing’er’s abilities had also been acknowledged when she displayed her Seventh Jewel cultivation base and her Fourth Jewel Consolidating Equipment Master Assembly Wings set. As such, her status as Elder was established. Since she had already achieved the Seventh Jewel cultivation base at such a young age, becoming a Heavenly King Tier was definitely not wishful thinking. Moreover, her husband, Zhou Weiqing, was such a powerful God Tier Master.</p><br/><p>Everyone that was present was a powerhouse of their generation. With their mighty Heavenly Energy, it would be difficult to get them drunk. That was why even though the banquet was boisterous, nobody was really drunk.</p><br/><p>“Weiqing, here’s a toast from me.” Meng Xing walked towards Zhou Weiqing. She looked at him with sparkles in her eyes as she raised her glass. Zhou Weiqing finished the drink in his glass after clinking glasses with her. The alcohol had some effect on his mood which caused him to be a little more presumptuous than usual. There was a saying, ‘It’s easier to move a mountain than to change a man’s character.’ It was his personality that he could not help himself whenever he saw beautiful women.</p><br/><p>Meng Xing ignored Zhou Weiqing’s lecherous look and smiled. “Weiqing, correct me if I’m wrong. You managed to make the scrolls so fast because you combined the Wind Attribute with the Spatial Attribute. Can you tell me how you managed to control them so well? You were able to maintain accuracy even with your tremendous speed. I did not detect your use of the Time Attribute.”</p><br/><p>Zhou Weiqing shrugged. “It comes with practice. The more I practice, the more the patterns of the Consolidated Equipment Scroll are etched in my mind. They just come naturally to me.”</p><br/><p>Of course, he could not have told her that he had been that accurate because he was using the Saint Energy to guide his thoughts. With the existence of Saint Energy, any energy attributes could be fused and they did not have any effect on Zhou Weiqing while he was making the Consolidated Equipment Scrolls at all. Moreover, it was not difficult for him since it was only Master-Tier Consolidated Equipment Scrolls.</p><br/><p>Meng Xing frowned and proceeded to say, “Is that so? I wonder if I can pick your brain regarding the secrets of making Consolidated Equipment Scrolls in the future?”</p><br/><p>Zhou Weiqing chuckled. “Of course you can. You’re welcome to at any time.”</p><br/><p>The banquet officially ended. From that moment forth, Zhou Weiqing was considered to have been fully accepted by the Mysterious Heavenly Palace. His performance with the Consolidated Equipment Scroll earlier had worked wonders for him. At the very least, nobody doubted his ability anymore. Zhou Weiqing and Shangguan Bing’er did not leave the Mysterious Heavenly Castle. Arrangements were made for them to stay in the center of the palace where the highest ranking powers stayed, but Zhou Weiqing felt helpless with the accommodation that he was given.</p><br/><p>The residence in Mysterious Heavenly Castle that had been arranged for Zhou Weiqing and Shangguan Bing’er was huge. They were staying on the sixth level. There were only seven levels in the Mysterious Heavenly Castle. On the seventh level, apart from the Palace Master’s residence, there was also a hall where all the meetings were held for the highest-level authorities in the Mysterious Heavenly Castle called the Heavenly Court. All of the important decisions in the Mysterious Heavenly Castle were made in the Heavenly Court.</p><br/><p>Apart from the seventh level, the next highest position was naturally the sixth level. Naturally, Zhou Weiqing was happy to be close to the core of the Mysterious Heavenly Castle. However, the issue was that he was not alone on the sixth level. Besides him, there were the four Supreme Elders staying on the same level. Due to his arrival, the other two God Tier Masters, Nie Han, and Meng Xing moved to the same level too.</p><br/><p>Surrounded by six peerless experts, how could Zhou Weiqing act as he wished? He was not sure about Nie Han and Meng Xing’s cultivation bases, but they were at least at the Heavenly King-tier. Moreover, there were four Heavenly Emperor Tier powerhouses staying on the same level. His scalp became numb just thinking about this. How could he investigate the Spatial Teleportation Stone now? He could not even use his Perception to investigate as the four Supreme Elders would find out about it immediately.</p><br/><p>Feeling helpless, all Zhou Weiqing could do was take up residence temporarily. He was new, so he could not escape from being monitored for a period of time. Since he had a lot of time, he figured he should relax instead. Besides cultivating, he would focus on studying the process of making Consolidated Equipment Scrolls as well as interacting more with Nie Han and Meng Xing.</p><br/><p>In the Mysterious Heavenly Castle, the higher it was, the thicker the Atmospheric Energy. The Atmospheric Energy was even thicker here than in the Heaven’s Expanse Palace. Cultivating here was naturally more effective with less effort. A month passed by in a blink of an eye, Zhou Weiqing had finally stabilized himself on the 37th-tier Saint Energy as he started to gradually improve. Moreover, his speed of improvement was pretty fast. He estimated that before solidifying a Saint Nucleus Core, he would not encounter a bottleneck like he did before. After all, he had officially entered the level of Heavenly Dao Energy.</p><br/><p>In reality, if anyone found out how he broke through to Heavenly Dao Energy, they would definitely be envious of him. He managed to break through in just a few months naturally. How could that even be called a bottleneck? Naturally, that was one of the benefits of the Saint Energy.</p><br/><p>Compared to the speed of leveling up his cultivation base, Zhou Weiqing’s speed in making Consolidated Equipment Scrolls could only be described as leapfrogging. He had experienced the Strength Legacy for many years. Meng Xing and Nie Han were God Tier Masters too, he gained priceless experience from working together with them and learning about the making of Consolidated Equipment Scrolls.</p><br/><p>Moreover, the Consolidated Equipment Masters had different perspectives on the making of Consolidated Equipment Scrolls on the Mysterious Heavenly Mainland compared to the Consolidated Equipment Masters of the Boundless Mainland. It could be considered as opening a brand new path which was helpful to Zhou Weiqing. Although the points he raised were different from the two God Tier Masters, who else was to blame for him being born into the ‘reclusive world’ of the Strength Legacy? As such, he did not attract any unwanted suspicion.</p><br/>\n</div>"}