{"title": "Chapter 727", "id": 727, "volume": 8, "url": "http://boxnovel.org/heavenly-jewel-change-chapter-727", "volume_title": "Volume 8", "body": "<h1>Chapter 727</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>“If these can’t be solid evidence, even Palace Master Dongfang have gone to set up the ward during the fight against the Dreadfiend Sea Naga. You, who have fused with the Blackfiend Dragon, had become a key force in the battles. Other things can be faked but you can’t feign the Blackfiend Dragon Armor Set – an eleven-piece legendary armor set! On the Boundless Mainland, there’s only one Heavenly Expanse Infinitum which can compare to it. That Palace Master Dongfang didn’t have it on him, but you did. Is this still insufficient to prove your identity? I think, Meng Xing isn’t your real name either. I may have lied to you, but I’m really Zhou Weiqing. The truth is that both of us happen to be liars… so, it’s now fair game, alright?”</p><br/><p>Listening to Zhou Weiqing’s analysis, Meng Xing turned her head to look. She did not deny his words but only looked at him with a serious demeanor.</p><br/><p>“Can you tell me, at that time, why did you choose to save us? Those exaggerated abilities of yours, could they really stop the Dreadfiend Sea Naga?”</p><br/><p>Zhou Weiqing stared at her with slight stubbornness, and said bitterly, “Do you want to hear the truth or a lie?”</p><br/><p>“Of course I’d like to know the truth,” Meng Xing said.</p><br/><p>Zhou Weiqing chuckled, and said, “You tell me your true name, and I’ll tell you.”</p><br/><p>Meng Xing was in a daze. She bit her lips gently, and said softly, “I’m Dongfang Hanyue.”</p><br/><p>“Dongfang Hanyue? That’s a good name. It matches you.” Zhou Weiqing complimented.</p><br/><p>Dongfang Hanyue said, “It’s your turn.”</p><br/><p>‘I don’t know,” Zhou Weiqing clarified</p><br/><p>Dongfang Hanyue stared at him in shock, “Is this the answer you’re giving me?”</p><br/><p>Zhou Weiqing said, “This is my honest answer. I don’t know why I chose to save you guys either. To me, the most advantageous situation would be for both your people and the Dreadfiend Sea Naga to suffer from injuries. In times of danger, to use the Spatial Transportation Stone, that’ll be my greatest chance. I’m seventy percent confident that I’m able to escape once I’ve retrieved the Spatial Transportation Stone. You can regard me as a fool then. However, I won’t regret it.”</p><br/><p>Upon registering the four words “I don’t regret it” uttered by Zhou Weiqing, the sternness and fury in Dongfang Hanyue’s eyes had melted. She stared at him, stupefied.</p><br/><p>“I’ll go and get something to eat,” Zhou Weiqing stood and walked toward the seaside. He needed to calm himself down as well. Thus, it was a situation which required him to make his second choice. Furthermore, it could very well be his last chance too.</p><br/><p>He was eighty percent sure that the Spatial Transportation Stone was with Dongfang Hanyue. ‘She’s the true ruler of the Mysterious Heavenly Palace!’ he thought. On the abandoned island, she was so weak. Without hurting her, he would also be able to snatch the Spatial Transportation Stone from her so that he could return with Bing’er, and his mission here would come to an end.</p><br/><p>However, could he really make such a decision? If he could, he would not have told Meng Xing so much.</p><br/><p>Reaching the seaside and allowing his feet to be immersed in the seawater, Zhou Weiqing expanded his senses. However, he discovered that in the vast ocean, he could not detect any life.</p><br/><p>“F*ck! I can’t even have some seafood to stabilize my emotions. Where’s your sense of humanity?” Zhou Weiqing shouted at the sea with fury.</p><br/><p>Retreating a few steps, he squatted down on the beach helplessly and drew circles on the sand with his hands, “Little Fatty Zhou, you coward! Please be soft-hearted… Please be soft-hearted…”</p><br/><p>The circles had been drawn to a mess, but the helplessness still lingered on his face. For him to bully a gravely injured girl, more so a girl who treated him quite well, he could not do it — he simply could not! If the Mysterious Heavenly Palace treated him badly, and Dongfang Hanyue treated him just as badly, he would have made his move long ago. However, he still remembered clearly that when danger struck. she did not forget to protect him despite the odds they were in, even with the risk of her being injured.</p><br/><p>Standing up abruptly, Zhou Weiqing walked toward Dongfang Hanyue with big steps.</p><br/><p>Noticing his aggressiveness, Dongfang Hanyue’s pretty face turned a shade paler. She subconsciously hugged her chest and her petite body retreated a few steps on the beach.</p><br/><p>Zhou Weiqing stopped directly in front of her.</p><br/><p>Dongfang Hanyue, like a kitten in shock, “What, what do you want?”</p><br/><p>Zhou Weiqing lowered his head menacingly, and said, “Hand over the Spatial Transportation Stone.”</p><br/><p>Dongfang Hanyue’s eyes glinted with stubbornness, “No. Kill me if you want to.”</p><br/><p>“If you aren’t handing it over, fine,” Zhou Weiqing let out a long sigh. A helpless smile could be seen on his face. He turned his body and proceed to lie down beside Dongfang Hanyue.</p><br/><p>Dongfang Hanyue was thrown into a daze again. One must know, that the moment Zhou Weiqing had urged for the Spatial Transportation Stone, her heart had leaped to her throat. However, this guy had only uttered that one sentence.</p><br/><p>“What on earth do you want?” Dongfang Hanyue could not contain herself. She did not understand even the slightest of what the bastard was thinking of.</p><br/><p>Zhou Weiqing laid there, with his hands pillowing his head, and said, “It’ll be such a waste for me to give up just like that without trying when I have such a good chance. I did ask, and it proves that I’ve tried. I have no choice if you refuse to hand it over. So, it’s fine. I’m a man, It isn’t right for me to bully a vulnerable girl like you on an abandoned island. Hurry up and recover your cultivation. Once you’ve recovered, I’ll be on my way.”</p><br/><p>Don’t you want the Spatial Transportation Stone anymore?” Dongfang Hanyue asked, puzzled.</p><br/><p>Zhou Weiqing laughed bitterly, “Of course I want it; this is my mission. However, I’ll come up with other plans. You better look after your precious item well. Don’t let me take it away.”</p><br/><p>“Hmph,” Dongfang Hanyue grunted. With great struggles, she supported her body up into a sitting position. She closed her eyes and started cultivating. The instant she sat up, a faint smile could be seen in the corner of her mouth. It was just that Zhou Weiqing, who had been lying down, could not see it.</p><br/><p>Sensing that the Dongfang Hanyue beside him had entered the state of cultivation, Zhou Weiqing laid there and stared at the sky in boredom. He chastised himself, “Little Fatty Zhou, you’re too good of a person. If she wasn’t a beauty, will you still act like this? No, you won’t. You’re a damned dirty-minded guy. Nevertheless, no matter what, I’m still a genuine person, better than hypocrites, I guess. Ah, Beauty Hanyue, you’ve disappointed me. You don’t have to give me your body… shouldn’t you have at least given me a kiss? I’ve treated you so nicely. Would kill for you to be touched even the slightest bit?”</p><br/><p>Although he was filled with such despicable thoughts, he sat himself up after Dongfang Hanyue had settled down. He moved behind her and placed both his palms on her back.</p><br/><p>“I’m not doing this to aid her recovery. I just intend to feel her attractive body figure,” Little Fatty Zhou convinced himself internally. The next instant, a silverish white glow had engulfed the two individuals.</p><br/><p>“I shall be a good person to the core,” he thought.</p><br/><p>Dongfang Hanyue had not exaggerated her injuries. The meridians in her body not only had been gravely damaged, they were scattered too. If a normal person were to sustain these injuries, he would be dead, but she was a Heavenly God-tier powerhouse and was still able to hold herself together.</p><br/><p>It was obvious that her recovery could not be sped up, but things were different with Zhou Weiqing.</p><br/><p>Smooth Saint Energy was channeled into Dongfang Hanyue’s body. Her petite body shivered momentarily. The warm energy being channeled into her body through a pair of large lukewarm hands was a unique sensation. Dongfang Hanyue only felt her petite body wobbling. Once the warm energy had entered her body, the disorganized energies in her meridians were easily assimilated.</p><br/><p>Along with the advancing of the warm energy, the damaged meridians were gradually being engulfed by the silverish white rays. There was no pain and Dongfang Hanyue only felt as if her body was being submerged in lukewarm water. It was indeed comfortable.</p><br/><p>She gave up her self-recovery, and without the slightest bit of alertness, she completely opened up her body to Zhou Weiqing, allowing his Saint Energy to flow freely within her.</p><br/><p>Slowly, in the comfortable setting, Dongfang Hanyue fell into a peaceful sleep. Ever since she bore the weight of the responsibilities of the Mysterious Heavenly Palace Master on her shoulders, she had not been sleeping too well.</p><br/><p>“You dumb f*ck, it shouldn’t’ be like this. I’m not a good person,” Sitting behind Dongfang Hanyue, Zhou Weiqing was puzzled. ‘Won’t she be worried if I did something to her in times like this? Even if he had hidden the Spatial Transportation Stone, she can’t be like this. Isn’t she aware of the great damages to a man when he is being exposed to a girl’s vulnerability? I can’t let it affect me, I can’t’ he thought.</p><br/><p>Nightfall then enveloped the island and brought about darkness and silence.</p><br/><p>A bonfire became the island’s only source of light. Zhou Weiqing sat beside the bonfire, roasting dry food.</p><br/><p>The Sumeru Ring had been returned to him. The food and water in there were not of a small amount. Therefore, he did not have to starve even if there was no seafood for him.</p><br/><p>There were occasional crackling sounds of fire. Dry food may be simple, but its taste after being roasted was not bad either.</p><br/><p>Zhou Weiqing restrained himself from directing his gaze to the other side of the bonfire. Dongfang Hanyue’s pretty features were like an apple, too alluring under the illumination of the bonfire.</p><br/><p>No matter how much dirty thoughts Zhou Weiqing had, he could not overcome the pressure of his principles and conscience. It was definitely not a good feeling.</p><br/><p>While he was healing Dongfang Hanyue’s meridians, he had wanted to go. However, upon realizing the possibilities of another Dreadfiend Sea Naga being around, he could not just leave Dongfang Hanyue behind to go by himself.</p><br/><p>“I shall wait for her to wake up I do anything,” he decided. It had been a long time since he lost control of himself. However, Zhou Weiqing had no choice but to admit that his mission here was no longer within his control.</p><br/>\n</div>"}