{"title": "Chapter 723", "id": 723, "volume": 8, "url": "http://boxnovel.org/heavenly-jewel-change-chapter-723", "volume_title": "Volume 8", "body": "<h1>Chapter 723</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>“Let’s give it our all and try our best to deliver a heavy blow to this creature before the other one arrives. It’ll be much better if we have more time. Once the Ward of Darkness has been destroyed, don’t hesitate and quickly leave this place with the Spatial Teleportation Stone. While there’s life, there’s hope. It’ll be too late if we’re one step slower.”</p><br/><p>Meng Xing was having contradictory feelings. Under the condition that the main component of the Spatial Teleportation Stone remained functional, it could simultaneously transport no more than ten living beings. Furthermore, they could only teleport within a certain range. Other than the few elders who would be abandoned, the faraway Zhou Weiqing had no chance of surviving as he was not within the Spatial Transportation Stone’s coverage.</p><br/><p>Once the Ward of Darkness had been broken, unless Meng Xing and the Blackfiend Dragon rushed over immediately to get Zhou Weiqing within the stone’s coverage, he was bound to die.</p><br/><p>However, if they were to do that, how would the people from the Mysterious Heavenly Palace deal with these strong opponents here? Even if they had five Heavenly Emperors among them, faced with two Heavenly God-tier Dreadfiend Sea Nagas would mean death for them as well!</p><br/><p>The other Dreadfiend Sea Naga was getting closer. Although the wounds on his body were increasing every moment under the effect of the Ward of Darkness, there was no longer enough time for the Blackfiend Dragon and Meng Xing to deliver a vital blow to the creature. At that moment, the elders in the Mysterious Heavenly Palace who were casting spells had fear on their faces. However, the few Supreme Elders were in slightly better condition as they knew that they would not be abandoned upon the activation of the Spatial Transportation Stone. However, things were different for six normal elders. If someone were to be abandoned, the choices would be made among them! The instant change in mentality made the Ward of Darkness unstable for a moment.</p><br/><p>Meng Xing was troubled. However, what she did not know was that there was someone else who was far more troubled than her.</p><br/><p>What Meng Xing only had to consider was whether or not Zhou Weiqing should be saved. On the other hand, Zhou Wei Qing had a lot more to consider.</p><br/><p>At the moment, he could already see the visitor approaching from afar. Amidst the vicious waves of the ocean, another Dreadfiend Sea Naga appeared in his line of sight. Compared to the previous Dreadfiend Sea Naga, this one was obviously much weaker. Its height was not more than eighty meters. However, even with the mere height of eighty meters, the fact that it was Heavenly God Tier remained the same. Even if it was just one step in the Heavenly God-tier, Heavenly Emperor Tiers were no match for it.</p><br/><p>What to do? Zhou Weiqing was in a panic. Another Dreadfiend Sea Naga came. There was no doubt that it was another chance for him to obtain the Spatial Transportation Stone. However, even if he managed to obtain the Spatial Transportation Stone, would he be able to leave this place alive? Even if he succeeded in leaving alive, Meng Xing and the other people would be left for dead here!</p><br/><p>At that very moment, Zhou Weiqing’s feelings were contradicting each other. What was even worse was that there was not much time for him to ponder about it.</p><br/><p>As Zhou Weiqing inhaled deeply, he made up his mind. Even though he understood that the decision was somehow irrational, he knew very well that this was the only way for him to not have any regrets.</p><br/><p>The huge pair of wings on his back flapped hard as six dark golden rays of light shone from his body. Propelled by the wings, his body flew towards the torrential ocean like a stream of light.</p><br/><p>Simultaneously, Zhou Weiqing’s voice sounded at the direction of the Ward of Darkness.</p><br/><p>“Meng Xing, hurry up and kill that Dreadfiend Sea Naga while I distract this one for you.”</p><br/><p>Zhou Weiqing sounded calm and emotionally stable. However, when the Mysterious Heavenly Palace powerhouses heard his voice, everyone’s eyes went red, including Meng Xing.</p><br/><p>A friend in need was a friend indeed. In their eyes, Zhou Weiqing was nothing more than a Heavenly Jewel Master with a cultivation base of six jewels! In the face of adversity, neither was he frightened nor did he selfishly escape. What he did was gather up his courage and flew towards the most dangerous direction. All so that he could buy them more time.</p><br/><p>Zhou Weiqing’s voice had never been powerful. Before today, the elders might have treated him with the utmost respect. However, that was only in regards to his equipment consolidating abilities. But now their impression of Zhou Weiqing was different. Regardless of his cultivation, whether or not he would succeed in stopping the Dreadfiend Sea Naga would all be decided in an instant. His words at that time had managed to reignite the willpower of each and every one of the Mysterious Heavenly Palace powerhouses.</p><br/><p>The few elders who had been overwhelmed by their fear and worries had regained their momentum instantly. If a mere Heavenly Jewel Master with a cultivation base at the Sixth Jewels could look death in the eyes as he charged forward to face the other Dreadfiend Sea Naga with all his might, what else was there for them to fear?</p><br/><p>Meng Xing bit her lips. She, who had always been gentle and elegant, let out a hysterical shout, “Bastard, you better stay alive -” Her voice was loud, even sharp. However, she sounded tired at that moment.</p><br/><p>A Heavenly Jewel Master at the Sixth Jewel cultivation base facing a Heavenly God-tier Dreadfiend Sea Naga directly. Would he still be able to return alive?</p><br/><p>Meng Xing could not control the tears that flooded her eyes, and her heart was overwhelmed with foreign emotions.</p><br/><p>Meng Xing felt regretful. She regretted that she did not fulfill her promise. She still remembered her vow of clarity. If she was given the chance to start anew, she would not hesitate to give herself to that man. She liked him. Why did she insist on preserving her dignity? Why!</p><br/><p>Could it be that everything that was happening then was a punishment because she broke her promise?</p><br/><p>‘No–, no–, Weiqing, you must come back alive, ‘ she thought.</p><br/><p>Her pain transformed itself into energy. At that moment, in within the boundary of the Ward of Darkness, the Dreadfiend Sea Naga, who was struggling for survival, was not the only one who went crazy. Meng Xing went insane as well and exploded along with the Dreadfiend Sea Naga.</p><br/><p>Black turned to red instantly. From Meng Xing’s location, blood red color spread downwards along the Blackfiend Dragon’ body. It seemed to spread to every corner of the dragon’s being in an instant.</p><br/><p>The terrifying atmosphere caused the dark energy in the Ward of Darkness to focus in the direction of the Blackfiend Dragon. The powerful Ward of Darkness was also weakening due to the extraction.</p><br/><p>The Dreadfiend Sea Naga halted his movements. Insane! They were all insane! What they were doing was clearly burning the Blackfiend Dragon’s life force! The Blackfiend Dragon was burning. He had already advanced into the aging stage and the combustion would reduce his life by hundreds of years in an instant!</p><br/><p>The dark red color almost instantly locked onto the Dreadfiend Sea Naga.</p><br/><p>Meng Xing bit her lips as she thought to herself, ‘If he dies, then all of you, shall die along with him!’</p><br/><p>Was Zhou Weiqing dead? No, he had yet to die, at least for now.</p><br/><p>At the very moment he made up his mind, he had abandoned all other thoughts from his mind. When he flew out, there was no longer anything that held him back.</p><br/><p>Among the Mysterious Heavenly Palace powerhouses, nobody landed their gaze on Zhou Weiqing. In their eyes, he had no way of escaping death. Thus, nobody saw that a beam of silverish white light, gleaming like a galaxy of stars, shone from Zhou Weiqing’s body. The tiger tattoo on his body completely transformed into scales. Under the terrifying pressure of the torrential ocean, a wave of mighty aura rose to the skies. Like a sharp blade, he knocked against the Dreadfiend Sea Naga who was closing in fast.</p><br/><p>Zhou Weiqing was facing a Heavenly God Tier being so how could he not give his all? At that moment, he was in peak condition. When the silver light rose to the skies, the ocean that was under the control of the Dreadfiend Sea Naga started to stir. The torrential waves were split into two by the silverish white ray of light. The intimidating aura of a Heavenly God Tier could not hurt him and it only flowed past him.</p><br/><p>Zhou Weiqing’s gaze turned stern. This might very well be the most challenging battle in his entire life. He did not know how much longer he could stand and tried his best to secure as much time as possible for the people in the Ward of Darkness. Of course, he would not bet on his life. If he felt that he could no longer stand his opponent, he would definitely leave this place at his fastest speed. But now was not the time. No matter what, he had to give things a try.</p><br/><p>For unknown reasons, when he made the choice to charge towards the second Dreadfiend Sea Naga, his whole being and mind became clearer than ever. It was as if, at that instant, his spiritual realm had broken through to the next level. No words could describe how wonderful he felt then. It no longer felt that terrifying to face the almighty Heavenly God-tier being.</p><br/><p>The Dreadfiend Sea Naga was momentarily stunned by Zhou Weiqing’s interference as its charging stance came to a halt.</p><br/><p>The flowing powers of the Saint Energy threatened the sea naga. In the boundaries of Zhou Weiqing’s Saint Energy, the sea naga realized that the water element between the heavens and the earth was no longer under his command.</p><br/><p>How was this possible? Our Dreadfiend Sea Naga was the ruler of the seas! ‘How is it possible for the human’s energy to influence the water element to the extent that I can no longer control them?’</p><br/><p>Of course, the Dreadfiend Sea Naga did not know that the energy was the Saint Energy which surpassed all the other attributes. The powers of Saint Energy could merge with any attribute. After Zhou Weiqing’s cultivation had reached the level of the Heavenly Dao Energy, the true powers of Saint Energy had taken effect. Never mind the ocean which was filled with water, Zhou Weiqing was capable of transforming the Darkness Attribute to his own even within the boundaries of the Ward of Darkness. This was the wonder of Saint Energy. It was suitable for any kinds of battle, and it could bring out one’s abilities to the fullest.</p><br/><p>Even though he was a Heavenly God Tier powerhouse, he would not dare to act carelessly with his suppressed attributes. Judging by Zhou Weiqing’s physical appearance, the Dreadfiend Sea Naga had no way of identifying his cultivation. He was a human, that much was obvious as he had arrived along with the other Mysterious Heavenly Palace powerhouses. The human was standing before him alone, it was obvious that he was not an easy opponent.</p><br/>\n</div>"}