{"title": "Chapter 722", "id": 722, "volume": 8, "url": "http://boxnovel.org/heavenly-jewel-change-chapter-722", "volume_title": "Volume 8", "body": "<h1>Chapter 722</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>With the Palace Master of the Mysterious Heavenly Palace, Dongfang in lead, twelve people including the four Supreme Elders, six Heavenly Elders, and God Tier Master Nie Han, cast the Ward of Darkness Sealing Spell.</p><br/><p>The spell assembled the power of five Heavenly Emperor tier and seven Heavenly King tier powerhouses! With such powerful energy, even if they faced the Dreadfiend Sea Naga, they would still be able to hold their own for a while. Not to mention, they had used a lot of rare ingredients for the sole reason of destroying the Dreadfiend Sea Naga.</p><br/><p>The Dreadfiend Sea Naga was sent flying back into the sea. However, this time, it felt completely different from the previous time.</p><br/><p>The sea was completely black, without a hint of its previous transparency. As the Dreadfiend Sea Naga fell into the ink-like sea, he could feel his body being constricted by an enormous dark energy. A suffocating pressure came crashing down from all sides. The rich Water attribute had completely been driven away. What used to be the sea had completely turned into a seemingly liquidized Darkness attribute.</p><br/><p>Without the Water attribute and the support of the sea, not even the massive Ocean’s Prison could restrain the Blackfiend Dragon.</p><br/><p>“Ha ha ha! Unexpected, isn’t it? I can’t lure you onto land like that other time, but I still manage to get you inside the Ward of Darkness. How much of your original power will you be able to wield without the sea?”</p><br/><p>The Blackfiend Dragon giggled smugly. The Dreadfiend Sea Naga was tricked and walked right into their trap. With so many powerhouses supporting the Ward of Darkness, even without the Blackfiend Dragon, it would take a while before the Dreadfiend Sea Naga could break through.</p><br/><p>In the range of this spell, the abundance of Darkness attribute raised the Blackfiend Dragon’s power sharply. It turned the tide of the battle almost immediately.</p><br/><p>“Splash!” The water made a sound as the Dreadfiend Sea Naga’s humongous body lunged out of the sea. His body had become transparent, turning into a bluish crystalline texture. That was the indication that he had attained the ultimate stage in his cultivation. With his Heavenly God tier power, even without the support of the sea, it was still formidable. At the same time, an ear-splitting roar came out from his mouth.</p><br/><p>What surprised the powerhouses from Mysterious Heavenly Palace was that despite being caught in a difficult situation, the Dreadfiend Sea Naga did not even look slightly fazed, if at all.</p><br/><p>The Ward of Darkness could restrain his body as well as drive all the Water attributes away, leaving only Darkness attribute. However, it could not stop the dragon’s piercing voice.</p><br/><p>“This is bad. Quick, kill it! It may have comrades,” Meng Xing urged. Her masked face changed suddenly. With her wisdom and intellect, how would she not be able to figure it out?</p><br/><p>The Dreadfiend Sea Naga did not panic even in such a dire situation, and it even let out a roar. That could only mean one thing. Furthermore, his comrade must be pretty strong, or else it would not be so calm.</p><br/><p>The Blackfiend Dragon and Meng Xing’s thoughts were in sync. Utilizing dark energy, they charged toward the Dreadfiend Sea Naga like a bolt of lightning.</p><br/><p>In battles of this tier, most abilities had lost their significance, as the fighters’ indomitable physiques could withstand even Heavenly God tier abilities without so much as a scratch on them. Only when they invoke their fusion skills that they could hurt their opponents.</p><br/><p>Boom!</p><br/><p>Two massive bodies collided once again in mid-air.</p><br/><p>The Ward of Darkness was indeed potent. As the duo’s attack sent the insufferably arrogant Dreadfiend Sea Naga flying, Meng Xing’s Blackfiend Devastation Dragon Slaying Spear was even able to leave a trail of puncture marks on his body.</p><br/><p>However, the naga’s vitality was not to be underestimated. With an enraged roar, the Dreadfiend Sea Naga sent a flurry of blows at the Blackfiend Dragon and Meng Xing in its crazed state.</p><br/><p>Heavenly God tier powerhouses were named such for a reason, after all. As the Dreadfiend Sea Naga attacked with a flurry of blows, there was no easy way for the Blackfiend Dragon and Meng Xing to kill it even after gaining the upper hand through the Ward of Darkness. If they were allowed more time, they could definitely slowly hack it to death. Without the support of Atmospheric Energy, his outburst could not have lasted long. With that being said, since he chose to attack with such ferocity, he must have a trick up his sleeve! At that realization, everyone, including Meng Xing, the Blackfiend Dragon, and the Mysterious Heavenly Palace powerhouses, felt a little uneasy.</p><br/><p>Energy rolled around violently within the Ward of Darkness, causing the twelve black pillars of light to waver ever so slightly with every burst of power.</p><br/><p>Outside of the ward, Zhou Weiqing was feeling much better. With the Ward of Darkness containing the energies inside, he was not affected by the battle at all.</p><br/><p>He leaped out of the sea and flew close enough to watch the battle. It was finally starting to feel like he was sitting on the mountain and watching the tigers fight.</p><br/><p>Even though the Dreadfiend Sea Naga was fighting for his life, his power inside the ward was noticeably weaker. Zhou Weiqing was also a little disappointed, it looked like the Dreadfiend Sea Naga would not be able to hold on for much longer.</p><br/><p>The key was that the Blackfiend Devastation Dragon Slaying Spear was far too strong. With every attack, it would leave a scar on the Dreadfiend Sea Naga’s torso. Just how strong could this thing be? Zhou Weiqing could not imagine it at all. Following the trend, it would seem the Dreadfiend Sea Naga was sure to be defeated. That would mean he would not be able to witness the appearance of the Spatial Teleportation Stone.</p><br/><p>Suddenly, Zhou Weiqing shuddered from deep within his soul and subconsciously stole a glance at the horizon. Immediately, he gasped in surprise and broke out in cold sweat.</p><br/><p>All the way from the horizon, there was an eye-catching line of water speeding towards them. Upon closer inspection, Zhou Weiqing noticed it wasn’t just any wave, it was clearly a massive tidal wave! Zhou Weiqing, being outside of the Ward of Darkness, could feel it the most as the terrifying aura washed past him. It was weaker than the one the Dreadfiend Sea Naga emitted, of course. However, without the aura from the Blackfiend Dragon to counterbalance it, Zhou Weiqing could not even breathe from the pressure that the aura emitted.</p><br/><p>If it was any other time before this battle, Zhou Weiqing might still be a little unsure. However, he had just witnessed a battle between two Heavenly God tier powerhouses, how could he forget that feeling that was carved so deeply into him?</p><br/><p>‘Heavenly God tier! That pressure was from another Heavenly God tier powerhouse. How- How is this possible?’ He thought.</p><br/><p>However, the reality was that there was nothing impossible in this world. The tide that was as high as the sky was zooming towards them at breakneck speed.</p><br/><p>If Zhou Weiqing saw it, then the fighters inside the Ward of Darkness would naturally have noticed it as well.</p><br/><p>“Damn it. What’s going on? How can there be another Dreadfiend Sea Naga?” The Blackfiend Dragon roared in shock and irritation. With a boom, he swiped his tail and exchanged a blow with the Dreadfiend Sea Naga inside the ward, successfully slamming it against the barrier of the ward.</p><br/><p>“Ha ha ha! You didn’t expect this, did you? Today will be the day of your death. How can I repeat the same mistake my father made when he was killed by you filthy humans and your trickery? I have it all planned out. If it wasn’t because I was waiting for my younger brother to attain the Heavenly God tier, why would I even wait until now? Of course, he has only reached Heavenly God tier not too long ago and he’s not too stable in that state yet. However, that’s enough to crush you both. This ward of yours is hard to break from the inside, but how does it fare from the outside? Haha! You’re dead!”</p><br/><p>The Dreadfiend Sea Naga howled in hysteria as his behavior became even more frenzied. Even if that would deplete his vigor really quickly, if he could just hold on until his brother’s arrival and the destruction of the Ward of Darkness, the duo could easily pulverize the Blackfiend Dragon and Meng Xing and kill them.</p><br/><p>The trapped Dreadfiend Sea Naga had guessed correctly. The Ward of Darkness was designed to withstand attacks from the inside. Even Heavenly God tier powerhouses would not be able to break through easily. However, from the outside, it was a completely different story.</p><br/><p>To increase the defense on the inside, the ward was designed to direct most of its energy to focus on the inside. If someone attacked it from the outside, it would be much easier to damage the construct. If the other Dreadfiend Sea Naga arrived, everyone else would be sacrificed. Without the help of the ward, the trapped Dreadfiend Sea Naga would immediately regain all his strength. He was injured, but Meng Xing and the Blackfiend Dragon had also lost a large amount of energy too. If they were to face the Heavenly God tier powerhouses in that situation, they would not even be able to run unless they used the Spatial Teleportation Stone.</p><br/><p>The mantis stalks the cicada, but unbeknownst to it, the oriole lurks behind. The Dreadfiend Sea Naga had this trick up his sleeve, plunging everyone from the Mysterious Heavenly Palace, who had spent long hours coming up with this plan, into facing an imminent death.</p><br/><p>If the two Dreadfiend Sea Naga had their way, the current strongest powers of the Mysterious Heavenly Mainland would have been wiped out. Just like how he said he wanted to. By that time, they could even rule the Mysterious Heavenly Mainland as Sea Monsters. After all, they wielded the power of a Heavenly God tier!</p><br/><p>Heavenly God tier powerhouses were fast. In this short amount of time, the younger brother of the Dreadfiend Sea Naga had already covered half the distance. If he was not trying to conceal his presence from the Blackfiend Dragon and the powerhouses from the Mysterious Heavenly Palace, he would have lurked even closer, and everyone would have been in danger at that point.</p><br/><p>Meng Xing clenched her jaw and cooperated closely with the Blackfiend Dragon to attack, and asked, “What now?”</p><br/><p>The Blackfiend Dragon had also started to panic. Even though he had lived for almost ten thousand years, he did not want to die</p><br/>\n</div>"}