{"title": "Chapter 744", "id": 744, "volume": 8, "url": "http://boxnovel.org/heavenly-jewel-change-chapter-744", "volume_title": "Volume 8", "body": "<h1>Chapter 744</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>“You planned this out, didn’t you? I can’t believe Tianyue would actually make that choice,” Shangguan Tianyang muttered while sighing softly.</p><br/><p>Zhou Weiqing chuckled, “I knew I couldn’t hide it from Uncle Tianyang.”</p><br/><p>Shangguan Tianyang shook his head and said, “It has nothing to do with hiding it anymore. Even though you have planned this out, I could see, in the battle just now, Tianyue did lose. Even if he had used his legendary armor set as soon as the battle started, he couldn’t have beaten you within the span of lighting one incense. Weiqing, you’re much stronger than how I imagined you to be. From here on out, you will surely gain a position of power on this mainland.”</p><br/><p>Shangguan Bing’er stood on the side, watching them with confusion. She whispered to Zhou Weiqing, “How am I not understanding what you’re talking about?”</p><br/><p>Zhou Weiqing chuckled and said, “I will explain it to you when we get back. Uncle, since you can tell our battle was genuine, don’t eat your words!”</p><br/><p>Shangguan Tianyang smiled wryly, “An effective threat. Rather than let you kidnap three of my dear nieces, I will agree to your proposals. However, remember what you said before. No matter who the first child will be born to, he must become the heir to the Heaven’s Expanse Palace. Looks like I am going to be busy for the next few decades.”</p><br/><p>Zhou Weiqing laughed, “No problem, uncle. You’re a very capable man.”</p><br/><p>Shangguan Tianyang said in a more serious tone, “So that’s that, I will arrange the necessary. However, you must handle your own things as soon as possible. Within the past year when you’re gone, the mainland had changed quite a bit.”</p><br/><p>Zhou Weiqing’s face changed, “Our Heavenly Bow Empire…”</p><br/><p>Shangguan Tianyang waved his hand, saying, “Don’t worry. The Heavenly Bow Empire is still doing fine. Everything is normal, and it was developing well. Xue’er and Fei’er aren’t here because they went to help out with the Heavenly Bow Empire for their upcoming battles. As of now, most of the Heavenly Bow Empire’s land had been recovered. Its army was still confronting with the armies of the Kalise Empire and Bai Da Empire. They haven’t been able to launch the attack, they could be waiting for your return before proceeding.”</p><br/><p>As Shangguan Tianyang said that, Zhou Weiqing sighed in relief, “So when you said the mainland had changed quite a bit, what do you mean? Could it be that the Wan Shou Empire is going to make a move?”</p><br/><p>Shangguan Tianyang sighed and explained, “If it’s the Wan Shou Empire, I wouldn’t be worried. Even though they are powerful, we are fighting them with the help of the Fei Li Empire and Bao Po Empire, so it was not easy to invade our land. The real problem lies within the mainland itself!”</p><br/><p>“Dandun Empire made another move?” Zhou Weiqing asked in surprise.</p><br/><p>Shangguan Tianyang nodded, “Not just a move, a large move. The Geritimo Empire had been completely wiped out.”</p><br/><p>“What?” Zhou Weiqing was shocked to hear the news. Even though parts of the Geritimo Empire had already been invaded by the Dandun Empire before he left, through mediation from the Zhongtian Empire, the Dandun Empire had not made any move since. However, the apparent destruction of the Geritimo Empire had proved that the Dandun Empire no longer care about the Zhongtian Empire’s opinion, it could even be said that it had made an enemy out of the Zhongtian Empire.</p><br/><p>After all, the Geritimo Empire was one of the larger empires on the Boundless Mainland, its imperial power would not be weaker than the Fei Li Empire. Being destroyed by the Dandun Empire in such a short time, it could be said that the Dandun Empire was strong enough to threaten the Zhongtian Empire.</p><br/><p>“Was the Bai Da Empire involved in this?” Zhou Weiqing asked the question he was most worried about.</p><br/><p>“Yes, not only that, the whole thing had already been clarified,” Shangguan Tianyang looked worried. “The moment the Geritimo Empire was lost, the Bai Da Empire announced that they would be changing their name to the Bai Da Kingdom and that they would become the Dandun Empire’s vassal state. The two empires had officially formed an alliance. Including the Geritimo Empire’s lands, they had already surpassed the Zhongtian Empire in total area. As of now, they are invading the smaller countries between the Dandun Empire and Zhongtian Empire without mercy, their area had been getting larger and larger.”</p><br/><p>Zhou Weiqing listened in on the report with his jaw dropped. He did not think such a huge change would happen within a year. The Dandun Empire could be said to be on the rise. With its overpowering strength, it forcibly united the whole Southern areas of the mainland.</p><br/><p>“Is the Zhongtian Empire not doing anything to counteract this?” Zhou Weiqing said in disbelief.</p><br/><p>Shangguan Tianyang smiled wryly, “Most of our military forces are on the northern border. Even if we could move them, we could barely manage to protect ourselves, so we couldn’t help the smaller countries. My worries right now is that after the Dandun Empire had finished uniting the South, they would attack us with the help of the Wan Shou Empire. If that is the case, I’m afraid that even the Zhongtian Empire would be in trouble.”</p><br/><p>What he did not reveal was that if it weren’t for the tension on the mainland, he might not have agreed to Zhou Weiqing and Shangguan Xue’er’s marriage so soon, he might not even have agreed to it at all. However, in this critical time, the Zhongtian Empire needed the Heavenly Bow Empire which was getting stronger to keep the Dandun Empire in check. If they had lost this ally, the Zhongtian Empire would really be surrounded by enemies.</p><br/><p>Zhou Weiqing’s brows furrowed and he said, “It looks like I really need to get back to the Heavenly Bow Empire as soon as I can.”</p><br/><p>Shangguan Tianyang responded, “Weiqing, on the matter of manpower, we the Zhongtian Empire are also having difficulties so we can’t help you much. However, don’t fret on the supplies, I will ask Tianxing to send them over without stopping. I do wish you will be ready for battles soon. The reason for my request is because it would help in saving your family. At the same time, we need you to be prepared to act in the Southwestern areas. If there are any conditions you would like to request for, please do.”</p><br/><p>Zhou Weiqing had a long thought before shaking his head and said, “I’ve got no conditions I would like fulfilled, but I would like Xue’er, Fei’er, and Bing’er to stay with me. I would only be at ease if they could be by my side. Also, if I had utilized my power as a Heavenly King tier master, I’ll need your help in dealing with the other mainland Heavenly Jewel Masters.”</p><br/><p>Shangguan Tianyang nodded and said, “No problem, I will deal with them, naturally. After all, with such destructive energy appearing in Blood Red Hell, it might possibly be related to the Nether Realm, so don’t you worry about what the public would think. However, be wary, because the Blood Red Hell might also send strong people after you. I wouldn’t be able to help in that regard as well, as more than half of the Heaven’s Expanse Palace’s powerhouses had been sent to the southern border to fight against the Dandun Empire, that is our main battlefield, we can’t move from there.”</p><br/><p>Zhou Weiqing smiled slightly, saying, “As long as I can use my full strength, I am confident.”</p><br/><p>Shangguan Tianyang said, “At this point, I can’t afford not to let you fight with your full strength.”</p><br/><p>Zhou Weiqing said, “If that’s the case, we’ll take our leave from the island. The sooner we return, the better for us who are handling these things. Don’t worry, we will definitely launch an attack against the Kalise and Bai Da Allied Forces.”</p><br/><p>Shangguan Tianyang smiled, “It doesn’t have to be so soon, you’ve only got here, might as well let Bing’er and Tianyue have a few more days of reunion before leaving.”</p><br/><p>Zhou Weiqing chuckled, “I’m afraid my father-in-law is not in the shape to care for his daughters. It’s better that I leave soon, or else my mother-in-law would kick my door down if it means she could give me a beating. I was the villain after all!”</p><br/><p>Having heard his words, Shangguan Tianyang chortled as well, “You aren’t completely villainous, aren’t you? Witnessing the couple reconcile, I feel like I’ve set down a burden.”</p><br/><p>Zhou Weiqing said with a smile, “If that’s the case, we’ll take our leave.” It can be said that he was eager to go home. With his country under siege, the Heavenly Bow Imperial Army was going to recover their lands, his feeling was a complicated one. However, no matter what, it was of utmost importance for him to save his family.</p><br/><p>Zhou Weiqing held Shangguan Bing’er hands, bid farewell to Shangguan Tianyang, and left the Heaven’s Expanse Palace. Zhou Weiqing did not act courteous, he brought Shangguan Bing’er and leaped directly into the sky, flying toward his home country on the southwest.</p><br/><p>“Little Fatty, did you plan that out with my dad?” Shangguan Bing’er was not stupid, after listening to Zhou Weiqing and Shangguan Tianyang’s discussion, she could guess what happened.</p><br/><p>Zhou Weiqing giggled and said, “I think it counts? It’s just that the plan got a little derailed by some changes. But don’t you worry, I’m your husband, how would I really hurt your father? Yes, he was hurt, but it was more because of himself.”</p><br/><p>When Zhou Weiqing met with Shangguan Tianyue, they had silently exchanged a few words secretly, it was just that no one else had noticed.</p><br/><p>This stratagem of self-injury was the result of the father-son-in-law duo.</p><br/><p>Of course, Shangguan Tianyue knew about Shangguan Tianyang’s intention, but more than that, he cared about Zhou Weiqing. First and foremost, he was also a father. Xue’er’s inheritance of the Heaven’s Expanse Palace and her becoming of the future Heaven’s Expanse Palace Master placed her as one of the most important people in the world. However, Shangguan Tianyue understood what the most important thing for a woman is.</p><br/><p>That was why, even if his brother might get upset at him, Shangguan Tianyue still informed Zhou Weiqing of Shangguan Tianyang’s intention.</p><br/><p>Whatever that happened after had already been part of Zhou Weiqing’s plan. However, Shangguan Tianyue did not expect Zhou Weiqing had already cultivated enough power to duel with him.</p><br/><p>In the beginning, when they had just started, Shangguan Tianyue had wanted to let Zhou Weiqing have the upper hand. However, as Zhou Weiqing showed his might, Shangguan Tianyue had to defend with his full strength. Having lost the upper hand, and not having a chance to use his Consolidated Equipment, he had lost to Zhou Weiqing.</p><br/>\n</div>"}