{"title": "Chapter 746", "id": 746, "volume": 8, "url": "http://boxnovel.org/heavenly-jewel-change-chapter-746", "volume_title": "Volume 8", "body": "<h1>Chapter 746</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>“Boss, you’re back,” Kou Rui was ecstatic and ran over to give Zhou Weiqing a bear hug. However, before even a second had passed, he remembered something. He loosened the grip and turned around, yelling into the air, “don’t attack, he’s one of our own.”</p><br/><p>The truth is, even if the Peerless Battalion’s Air Force wanted to do anything, they could not. Every one of them was frozen in the air, unable to even move, not to mention fight back.</p><br/><p>Zhou Weiqing waved his arm in a wide gesture, loosening their bind, and these Air Force landed one by one.</p><br/><p>Kou Rui did not approach for another hug. He took a few steps back, genuflected, and said respectfully, “Kou Rui wishes the Admiral good health.”</p><br/><p>Zhou Weiqing waved his hand as a gentle gust lifted Kou Rui to an upright position, “We’re all brothers, no need for such etiquette. Besides, I’m just someone with too much time on my hands.”</p><br/><p>Right about now, most of the Air Force had already landed. Normal scouts did not know who Zhou Weiqing is, but how could the other fighters in Peerless Battalion not recognize him? A majority of them were brought over from Zhongtian Empire by Zhou Weiqing!</p><br/><p>“It’s the boss, the boss came back,” the people surrounded him in no time. They were all from the Ruffian Battalion, and Zhou Weiqing did not usually carry himself with much authority. At the sight of him, these people had forgotten their manners, swarming in to surround Zhou Weiqing.</p><br/><p>However, they only managed a few steps before showing signs of terror and stopped to say in earnest respect, “Praise be, chief instructor.”</p><br/><p>Zhou Weiqing suppressed his urge to laugh and said, “What did your chief instructor do to you? Every single one of you looks so scared.”</p><br/><p>Kou Rui giggled, “It was nothing. It’s just that we have spot checks occasionally, to ‘compare notes.’ ”</p><br/><p>Zhou Weiqing felt a little speechless. Without a doubt, the person who wanted to ‘compare notes’ must be Shangguan Fei’er, Shangguan Xue’er would not do something like that.</p><br/><p>“Okay, let’s all go back to the camp. Tell me, during this period while I was away, what had happened here.”</p><br/><p>“Yes, sir.”</p><br/><p>Kou Rui led the whole squad of the Peerless Battalion’s Air Force to cluster around Zhou Weiqing as they walked toward the camp.</p><br/><p>It was not after a quarter of an hour that the four scouts from before reacted. The four scouts exchanged glances with each other, not knowing what to say. They, however, remembered clearly the Air Force that they respected so much calling the man ‘boss’, and Scout Leader Kou Rui called him Commander. Who is he?</p><br/><p>“Could he be the Marshal Zhou who’s like the dragon god; we might see its head, but we’ll never see its tail?”</p><br/><p>When Zhou Weiqing had left, he had passed on the title of Commander to Ming Yu, while taking on a sleeping role as a Military Department Chief. However, in the eyes of the Elders in the Heavenly Bow Empire, his reputation was especially unshakeable. That was why everyone still called him their Commander. Because of that, two commander titles were given throughout the Empire, Commander Ming Yu, and Commander Zhou.</p><br/><p>On their way to the camp, Kou Rui gave him a simple verbal report on the development of the Heavenly Bow Army in the past year.</p><br/><p>In the one year, after the Heavenly Bow Army laid low for about half a year, they started reclaiming the lands in Heavenly Bow Empire and was successful in their mission within a short time, there was barely any resistance.</p><br/><p>Ming Yu’s timing to launch the reclamation was excellent, it was when the Dandun Empire made a move on the Geritimo Empire. Because of that, the Kalise Army and the Bai Da Empire only settled in Heavenly Bow City, they and did not execute any military actions against Heavenly Bow Empire.</p><br/><p>At the moment, the army of Heavenly Bow Empire already had compiled 100 thousand soldiers in its First Field Army Group, and 70 thousand soldiers uncompiled in Second Field Army Group for a total of 170 thousand soldiers. They didn’t have to take into consideration the issue of being on defense, so among the whole 170 thousand soldiers, 150 thousand were mobilized and stationed where they are.</p><br/><p>The original Peerless Regiment were all included in the First Field Army Group and were reshuffled. Within the ten regiments of the First Field Army Group, each regiment had two hundred Peerless Air Force and a hundred Peerless Heavy Cavalry added to them. The ones left behind would serve directly under Ming Yu’s command as the most elite fighting force within the whole field army group. In total, there were four thousand Peerless Air Force and three thousand Peerless Heavy Cavalry. With Ming Yu’s coordination, the reserve armies of Berserker and Gold Crow Tribes had become active duty army as well. For that reason, the Peerless Heavy Cavalry was bumped up to four thousand soldiers, and both Air Force and Heavy Cavalry armies were fully equipped. The Snow Deer Cavalry had also been absorbed into the Peerless Heavy Cavalry with all five hundred of them getting the same treatment with the other Peerless Heavy Cavalry members, with suitable armors and weapons being custom made for them.</p><br/><p>According to Ming Yu’s plan, the attack should be launched as soon as a month ago. However, due to some unforeseen circumstances, the attack was delayed. The ‘unforeseen circumstance’ was actually from the Blood Red Hell.</p><br/><p>The Blood Red Hell appointed a Heavenly King tier Heavenly Jewel Master with Darkness Attribute who was stationed inside the Heavenly Bow City. He would not participate in the battle, but the Kalesi Empire had already warned them, if the Heavenly Bow Empire dared to launch an attack, they would not hesitate to unleash the Fate Denying Seal by Admiral Zhou and kill off all the royalty within the Heavenly Bow Empire.</p><br/><p>Even though doing this would be a huge sacrifice on the Darkness Attribute Heavenly Jewel Master’s side, it was still not something the Heavenly Bow Empire could endure.</p><br/><p>After all, although a part of the Heavenly Bow Army was brought over by Zhou Weiqing from the Zhongtian Empire, most of them were formed by the Heavenly Bow Imperial Army as well as conscription from within the Heavenly Bow Empire. If the royal family of the Heavenly Bow Empire was killed, it would be a massive blow to the morale of the army. So even if Ming Yu usually makes decisive choices, he dared to not order an attack easily. Especially when it concerns the lives of Zhou Weiqing’s parent. Even if he did, it would be difficult to get the attack executed.</p><br/><p>Therefore, both the armies were at a stalemate here.</p><br/><p>Ming Yu understood very clearly the intention of Bai Da Empire and Dandun Empire. They wanted to stall for time until the Dandun Empire could unify the South. When they had done that and had made necessary arrangements, they would naturally have enough manpower to deal with the Heavenly Bow Empire. The Dandun Empire had not been paying much attention to the Heavenly Bow Empire, because the Heavenly Bow Empire was just a small fry, there was no need to worry about them so much.</p><br/><p>After listening to Kou Rui’s report, Zhou Weiqing frowned. The Dandun Empire was really cunning, they had only sent one person here, and that was enough to keep more than 100 thousand soldiers in check.</p><br/><p>“Boss, don’t you worry. The old geezer is back, so even if you’re not here, we’ll still proceed with our plan in the next few days.”</p><br/><p>Zhou Weiqing’s heart jumped. Of course, he would know which ‘old geezer’ Kou Rui was referring to, it was his teacher, Six Ultimate Heavenly Emperor Long Shiya! He asked excitedly, “Teacher is back?”</p><br/><p>Kou Rui nodded and smiled, “The old geezer had just arrived a few days ago, you two practically read each other’s mind.”</p><br/><p>As soon as he knew his teacher was back, Zhou Weiqing could not wait any longer. He had not seen Long Shiya for a long time, he missed him dearly. No matter Mu En or Hua Feng, or if it was Long Shiya, every one of them was his most-respected, most important people in his life. He had already viewed them as his family.</p><br/><p>“Good, then we’ll hasten our pace, I want to see my teacher.”</p><br/><p>As Zhou Weiqing was talking, a deep, booming voice echoed, “You rascal, do you even remember where your home is! Doing pretty well for a slacker!”</p><br/><p>A light of six colors zoomed in and out of their sights, and the next moment, a person stood in front of them, who else was that other than Long Shiya?</p><br/><p>Long Shiya was still plump, his facial complexion was a healthy pink, his words were one of reprimand, but his face was smiling the whole time.</p><br/><p>“Old geezer,” Kou Rui greeted him immediately. The Peerless warriors started to laugh, they were really close with Long Shiya. After all, before Long Shiya had left, his biggest hobby was to join the Peerless warriors and to have a drinking contest with them. Long Shiya did not project an air of importance about him, so the Peerless warriors liked hanging out with him a lot.</p><br/><p>“Teacher,” Zhou Weiqing stepped forward excitedly and immediately kneeled without prompt, preparing to kowtow at Long Shiya. Shangguan Bing’er who was by his side also kneeled.</p><br/><p>Long Shiya lifted his arm and caught Zhou Weiqing’s shoulder, “What are you kneeling for, did I even follow this many customs? It’s only been a year, how did you become such a kowtow worm?”</p><br/><p>Zhou Weiqing stood up and smiled. He rubbed his nose and said, “I needed to do something.”</p><br/><p>Long Shiya slapped him across his shoulder with a playful smirk, “You insolent child, you’re still the same kid who needs a good beating. Hey…” Long Shiya was happy to see Zhou Weiqing, but suddenly, his face changed, contorting into a despicable-looking face.</p><br/><p>An intense green light almost immediately burst out of his body, as a strong Fetters of Wind landed upon Zhou Weiqing, at which point Long Shiya also raised his hand, grappling at Zhou Weiqing’s face.</p><br/><p>The sudden change caught Zhou Weiqing and other people by surprise. No one would imagine Long Shiya to attack Zhou Weiqing. Right before that, they were still joking around.</p><br/><p>Zhou Weiqing was the most surprised. If it was before, he wouldn’t have been able to evade Long Shiya’s grapple, but his cultivation base was no longer like before. As soon as the Fetters of Wind hit him, the Starcrux Saint Nucleus Core in his body reacted by unleashing a surge of pale golden light. The green Fetters of Wind melted away almost immediately and with a silver flash, Zhou Weiqing had moved about three meters away with his Blink ability.</p><br/><p>Long Shiya did not say anything. His grapple missed, making his face even sterner. He stepped forward with his right foot, causing the whole area to emit a low grumbling sound. He did not retract his right arm, but turning into a fist and punched at Zhou Weiqing’s chest from afar.</p><br/><p>The six-colored light formed a huge ball of light and charged at Zhou Weiqing.</p><br/><p>Since he had already fallen into a defensive position, when he was faced with Long Shiya’s immense pressure, Zhou Weiqing could only assume a passive defense position. Both Shangguan Tianyue and Long Shiya were Heavenly Emperor tier powerhouses, but Long Shiya’s pressure was much stronger. He was praised as number one after the Heavenly God tier after all.</p><br/><p>Left without a choice, Zhou Weiqing shielded himself by putting both his arms in front of his chest. In a split second, both his palms turned gray as a whirlpool formed in front of him. As soon as Long Shiya’s six-colored light ball touched the gray whirlpool, a third of it melted before hitting Zhou Weiqing’s palms.</p><br/><p>This was Long Shiya’s attack. If it were another person without Consolidated Equipments and Jewel Stored Skill, even a Heavenly Emperor tier powerhouse’s attack would have been dissolved by the Zhou Weiqing’s external Devour Skill. However, Long Shiya was not like everyone else. His Heavenly Energy was a mix of six attributes. Even though it could still be dissolved, it was significantly harder to completely devour it.</p><br/><p>With a dull boom, the golden light enveloping Zhou Weiqing evidently flickered brighter as he was pushed a dozen steps backward before he stopped.</p><br/><p>“Teacher, what are you doing?” Zhou Weiqing finally said after having managed to regain his balance.</p><br/><p>Long Shiya stared at the grey whirlpool between Zhou Weiqing’s palms, a little startled. He did not follow up with another attack, but his face was still burning in rage. He said, “Who are you? How dare you pose as my disciple?”</p><br/><p>Zhou Weiqing was perplexed, and he said, “I’m your dearest disciple Little Fatty Zhou! What could I even pose as?”</p><br/><p>Long Shiya growled, “Bullsh*t, even if Weiqing, that rascal, had advanced his cultivation base level, it would be impossible for him to reach the Heavenly King tier in a little more than a year, who are you kidding? Let me tear away this human skin mask from your face.” He felt a presence of a Heavenly King tier powerhouse, which was the reason he had come outside. He was afraid the Peerless warriors couldn’t handle it, but it was Zhou Weiqing who showed up. In his joy, he had forgotten his initial objective.</p><br/><p>However, when he patted Zhou Weiqing’s shoulder, he felt something wrong. Zhou Weiqing’s body naturally produced a wave of countershock, the Atmospheric Energy in the air was also trying to stop him, this was something only a Heavenly King tier powerhouse could have! How old is Zhou Weiqing? No matter how he looked at it, he refused to believe the kid could rise to that stage in such a short time. Furthermore, the energy around Zhou Weiqing was something he could not see through! That was the reason for his sudden change in attitude, he wanted to catch the impostor before anything else.</p><br/><p>However, Zhou Weiqing’s Evil Attribute and the Devour Skill confused Long Shiya even more, even though the strength of the Devour Skill was much stronger than before, the source would not change. Long Shiya had never seen anyone else other than his dearest disciple who could use the Devour Skill. That was why he stopped.</p><br/><p>Zhou Weiqing stared at Long Shiya, unsure if he should laugh or cry, “Teacher, be sensible, will you! Everyone hopes for their disciples to be strong, why would you hope for your disciple to be weak! Everything else could be faked, but not this. I, your disciple, am unique.”</p><br/><p>As he spoke, Zhou Weiqing made a circle with his hands in front of him, and two triangles immediately overlaid each other, forming the Six Ultimate Godly Light Formation.</p><br/><p>Looking at the colorful lights that appeared below Zhou Weiqing’s feet, Long Shiya’s face was immediately stuck in its pale, green color. Zhou Weiqing was right, everything else could be faked, but the Six Ultimate Godly Light Formation could definitely not be imitated!</p><br/><p>Zhou Weiqing’s Six Ultimate Godly Light Formation was an extension of Long Shiya’s Six Ultimate Heavenly Path Formation. The unique skill could only be learned when one has six attributes, and the cultivation method was only known to Long Shiya and Zhou Weiqing.</p><br/><p>Even if someone could pretend to be Zhou Weiqing, the attributes would not lie. Zhou Weiqing’s six-attribute combination was so unique, and including the Six Ultimate Heavenly Path Formation, it would definitely be enough to prove his identity.</p><br/><p>“You’re really Little Fatty?” Long Shiya asked in confusion.</p><br/><p>Zhou Weiqing’s face twitched, “Teacher Fatty, how am I not your Little Fatty? My strength had increased a lot, that’s true, but you need to give me time to report!”</p><br/><p>Long Shiya’s gaze quivered and said, “Wait a minute, tell me this then. When you fused with the dragon and tiger bloodlines, who became your sacrifice at the final moment?”</p><br/><p>Zhou Weiqing was speechless, he peered at Shangguan Bing’er on his side and said helplessly, “It was Little Witch Wu Yuehan, you made her my responsibility, remember?”</p><br/><p>After hearing his words, Long Shiya was like in a trance, his killing intention dissipated immediately, and he looked at Zhou Weiqing in disbelief.</p><br/><p>“You rascal, it was you! You’re a Heavenly King now. God dammit, it was so unfair! When I became a Heavenly King, I was already over fifty years old. How old are you now!”</p><br/><p>Zhou Weiqing smiled wryly, “How could teachers be envious of their disciple. Teacher, this is your fault.”</p><br/><p>Long Shiya giggled loudly, his fatty cheek squeezing his eyes into near-disappearance.</p><br/><p>Zhou Weiqing huffed and said, “I’m not going over there, what if you hit me again?”</p><br/><p>Long Shiya scoffed, “Come here immediately, so what if I hit you? I’m your teacher, isn’t it normal for teachers to discipline their disciples?”</p><br/><p>Without a choice, Zhou Weiqing walked over. Long Shiya gave him a quick once-over and laughed, “Good! You’re certainly a manly man, deserving to be my disciple. I’ll show Xue Ao’tian that old geezer for acting cocky in front of me. My disciple had stolen his daughter and became a Heavenly King, haha, ha ha ha ha ha!”</p><br/><p>Looking at his teacher’s classless laughing fit, Zhou Weiqing was speechless. What is this! It was hard enough to finally see his teacher, but his teacher dealt him a head-on blow at their first encounter. Fortunately, his cultivation base was good enough to block it, if he had not blocked it, the injury sustained from the hits would have been severe.</p><br/><p>It was not only Zhou Weiqing who was speechless, the Peerless warriors were basically clutching at their convulsing hearts, especially Kou Rui. The ruckus between Zhou Weiqing and Long Shiya was still not something outrageous, however, Long Shiya had just confirmed Zhou Weiqing to be a Heavenly King! A Heavenly King, the boss is already at the Heavenly King tier.</p><br/><p>Among the whole of the Heavenly Bow Army, only Long Shiya and Duan Tianlang had a cultivation base of Heavenly King tier and above. However, from another perspective, they were still not part of the Heavenly Bow Army but were mere guests. The Heavenly Bow Empire’s biggest weakness was that it doesn’t have enough powerhouses, especially not higher-tiered ones. However, when Zhou Weiqing became a Heavenly King, everything had changed. The Heavenly Bow Empire finally had its own Heavenly King!</p><br/><p>“Let’s go, let’s return to the camp, I need to show off to Old Geezer Duan, haha! The best decision I’ve made in my life was to take you as my disciple.”</p><br/><p>Six Ultimate Heavenly Emperor had always does what he wanted, he would not hide his feelings. Happiness is happiness. To the Peerless warriors, Big Fatty was just asking for a beating. Of course, no one was reckless enough to say it.</p><br/><p>After all the drama, everyone had finally arrived at the camp. Kou Rui had immediately taken off to report to the management of the Heavenly Bow Empire. while Long Shiya had taken Zhou Weiqing and Shangguan Bing’er toward where Duan Tianlang is.</p><br/><p>“Hey, Weiqing, you’re back,” seeing Zhou Weiqing, Duan Tianlang was surprised. Zhou Weiqing had wanted to greet him, but he was stopped.</p><br/><p>“It was good that you’re back. The Heavenly Bow Empire could not lose a mental support like you. It was an important battle to reclaim the Heavenly Bow Empire’s glory, so your return is timely. Everything you asked me to prepare, I have already done.”</p><br/><p>As he was speaking, Duan Tianlang waved his hands, and three boxes appeared on the table. Undoubtedly, everything inside was God Tier Consolidated Equipment Scrolls.</p><br/><p>“Thank you for your effort,” said Zhou Weiqing. His respect for Duan Tianlang was not less than his own teacher. Duan Tianland’s sacrifice for his Strength Legacy, as well as the help he offered to Zhou Weiqing, was completely altruistic.</p><br/><p>Long Shiya chuckled proudly, “Old geezer Duan, your legendary armor set was not good enough.”</p><br/><p>Duan Tianlang replied, “Not good enough? How is it not good enough? Isn’t Weiqing at nine jewels? When he left, he was at six jewels, so having three legendary armor pieces is just nice!”</p><br/><p>Long Shiya raised his hand, wiggling a finger in front of him in overbearingly, and said, “Nine jewels? He was my finest disciple, and it had already been a year, how can he still be at nine jewels? It should be ten jewels.”</p><br/><p>Seeing Long Shiya’s cockiness, Shangguan Bing’er could not contain it any longer and broke out into giggles. After all, not long ago, Long Shiya had attacked Zhou Weiqing because of his cultivation base, but now it had suddenly become within his expectation.</p><br/><p>However, no matter how cocky Long Shiya was, Duan Tianlang was surprised. He stared at Zhou Weiqing with a wooden expression and said, “Weiqing, you have advanced into Heavenly King? So soon?”</p><br/><p>Zhou Weiqing tittered, “I got lucky.”</p><br/><p>Duan Tianlang gave Zhou Weiqing a weird look, “You are such a prodigy! Luckily I have been keeping myself busy this last year. I had wanted to keep this from you so you could be inspired to strive for Heavenly King. It looks like I can give them to you now.”</p><br/><p>As he spoke, he raised his right arm and two additional wooden boxes appeared on the table.</p><br/><p>At this point, Long Shiya’s grin disappeared, “Old geezer Duan, have you already finished his Ringless Ground Purging Set?” Zhou Weiqing had collected five pieces of the Ringless Ground Purging Set, having five more pieces would mean the armor set was complete!</p><br/><p>Duan Tianlang made a sound in irritation and said, “One shall try one’s best to do what was entrusted to him by others. I’m not like some people who became a teacher but went away to slack off. As soon as Xue’er, Fei’er, and the others brought back enough materials, I had started working on them. I am glad to have been entrusted with this. Luckily, Weiqing’s set only needed one scroll per piece to complete the process, otherwise, I really can’t finish them on time.”</p><br/><p>Looking at Duan Tianlang, Zhou Weiqing’s eyes began to water. When he had first met Duan Tianlang, he still looked young, however in a mere few years, his hair had become like salt-and-pepper. His eyes were still bright, but the deep exhaustion in his eyes broke Zhou Weiqing’s heart.</p><br/><p>“Junior Master.” Zhou Weiqing stepped up, holding Duan Tianlang’s hand.</p><br/><p>Duan Tianlang raised his other hand and tapped on Zhou’s shoulder. He said, “We are a family, I consider you as half a disciple and another heir of my Strength Legacy. Even though you are not progressing into the field of Consolidating Equipment Master, but I will keep my promise. Plus, to complete the Ringless Ground Purging Set was one of the biggest dreams in my life. Now that I have both Hiltless Sky Purging Set and Ringless Ground Purging Set under my belt, I have no regrets.”</p><br/><p>Holding Duan Tianlang’s hand, Zhou Weiqing could clearly feel that though his Junior Master looked normal on the surface, he was already very weak as if he could pass away at any time.</p><br/><p>His tears finally flowed uncontrollably down his face. Zhou Weiqing opened his arms and gave Duan Tianlang a big hug.</p><br/><p>Long Shiya was not laughing as well. He looked at his old friend with a worried look. He knew Duan Tianlang’s physical condition the best, during the time when he left, it was to look for the herbs and medicines that could help Duan Tianlang regain his health. He didn’t think Duan Tianlang could finish the Ringless Ground Purging Set in such a short time. Now that his dreams were fulfilled, he might no longer have much will to live! The cures he brought back might be of no use at this point.</p><br/><p>At this moment, a layer of golden light rose from within Zhou Weiqing’s body. Something strange was happening. Golden light spots floated from his body, permeating the room with a sense of peaceful calmness. They were like starlights, transforming the tent into the night sky. The balls of light hovered around, then slowly moved toward Duan Tianlang’s body. They were not fast, but with every dot of light that enters, Duan Tianlang uncontrollably shivered.</p><br/><p>“Weiqing, don’t!” Duan Tianlang yelped in a low voice, but he could no longer stop Zhou Weiqing. In Zhou Weiqing’s arms, he could not move at all.</p><br/><p>When comparing cultivation base, Duan Tianlang would, of course, score higher than Zhou Weiqing, he was an old-time Heavenly King tier powerhouse after all. However, Zhou Weiqing was not any Heavenly King tier powerhouse, he had his Saint Energy! If Duan Tianlang could still escape from his grip, Zhou Weiqing could quit being a Heavenly King tier powerhouse right there and then.</p><br/><p>A rich wave of Saint Energy was rolling around in the air as bits of starlights kept seeping into his body, Duan Tianlang noticed suddenly that his heart and pulse, weak from the drain on his life force, slowly becoming more sturdy, and every part of his body was rejuvenated by the bits of starlights, These starlight Saint Energy were not invasive to him, even the Heavenly Energy in his body could accept this foreign source of energy with no objection.</p><br/><p>Starlight had started appearing in his Heavenly Energy too. At this moment, Duan Tianlang felt as if he was bathing in a warm spring, it was very comfortable. Everything inside his body felt like they were recovering. His internal organs, his bones, his muscles, his tendons, everything felt like they were becoming youthful. Zhou Weiqing did not give him his life force, but he used a strange way to bring a miracle to his body.</p><br/><p>Humans were created by nature, and what Zhou Weiqing had given Duan Tianlang’s body was this vigor of creation. It was a much better gift than just gifting his life force and watch it flow away again.</p><br/><p>Duan Tianlang’s eyes were blurry. He only felt as if he became young again. A lot of things he could only do when he was young had been resurrected. It seemed like he could do many of the things he used to be able to do.</p><br/><p>At this point, he thought of a joke Long Shiya used to tell him. Long Shiya used to say, “What are brothers? Brothers are the ones who, when you’re ill and has laid down in bed, would pour you tea and water, feed you, and bathe you, even if none of these had any meaning anymore. And at the end of the day, he would bring you a pretty lady. By that point, you would say, ‘let me try, help me get up.’ ”</p><br/><p>Perhaps, he could really try now.</p><br/><p>The starlights shone for at least ten minutes before they disappeared back into Zhou Weiqing’s body. Slowly, Zhou Weiqing loosened his grip and smilingly looked at Duan Tianlang, who looked spaced out.</p><br/><p>Long Shiya who was standing aside could tell the difference clearly. He saw Duan Tianlang’s peppery hair magically turned black starting from the roots. As the hair was turning black, the sagging skin on his face seemingly became toned and elastic, it looked as if he was ten years younger in an instant!</p><br/><p>Long Shiya stared, in disbelief, at Duan Tianlang who looked younger by the second, and walked over to Zhou Weiqing silently, and whispered, “Weiqing, are you okay? Did it take a lot of your energy?”</p><br/><p>Zhou Weiqing chuckled and shook his head, “It’s fine, it was nothing. I only borrowed the Atmospheric Energy, turned it into Saint Energy to reactivate Junior Master’s body. It doesn’t count as being decades younger, but he can at least live for a few decades, no problem, heh heh.”</p><br/><p>“It really doesn’t take a lot from you?” Long Shiya’s eyes widened, pushing out from the rolls of fat that hid them.</p><br/><p>Zhou Weiqing nodded, “Teacher, don’t worry. I’d never done anything I can’t guarantee of.”</p><br/><p>Long Shiya’s grin turned toadyish, “Well, would you do it for me as well? I’d love to be young again, maybe I could even bring home a wife!”</p><br/><p>Zhou Weiqing laughed heartily. He put his arm around Long Shiya’s shoulder and said, “Of course, how could I forget about you? You definitely can experience this.”</p><br/><p>Saint Energy was mysterious, and as Starcrux Saint Nucleus Core had been solidified, and slowly showing Zhou Weiqing what it can do. What Zhou Weiqing did for Duan Tianlang was just an experiment in his emotional state. As proven, his experiment had succeeded. Duan Tianlang’s vitality had been restored by him.</p><br/><p>This experiment allowed Zhou Weiqing to realize, he actually obtained the power to extend people’s life. With it, it would be very advantageous when it comes to developing the Heavenly Bow Empire!</p><br/><p>Long Shiya patted Zhou Weiqing’s back satisfactorily. He was only joking with his disciple, but inside he sighed. It seemed like a long time ago when he first saw the kid. His cultivation base at the time was effectively that of an ant. Within only a few years, the kid had grown into someone even he had to pay attention to. The kid was even bestowed with so many unique powers. This was no longer talented, he was blessed!</p><br/><p>Duan Tianlang’s dazed state continued for about ten minutes before he came out of it slowly. As he looked at Zhou Weiqing again, his gaze projected an unreadable expression. He sighed, saying, “Weiqing, why would you do that? I don’t understand what ability you’ve used, but wouldn’t it be taxing on you?”</p><br/><p>Zhou Weiqing shook his head fervently and said, “Definitely not. Look at me, am I not still alive and jumping? Creation, it’s the special ability my Saint Energy has. Junior Master, you have given so much to me, let’s not even talk about harmless things, even if I had to sacrifice a little bit, I would still do it without hesitation. Besides, I’m still waiting for Junior Master to create more miracles.”</p><br/><p>Duan Tianlang gasped, “Create miracles? What miracles?”</p><br/><p>Zhou Weiqing said seriously, “Junior Master, I have gone to Mysterious Heavenly Mainland not long ago, and over there, I saw an eleven-piece legendary armor piece.” He quickly summarized his journey, giving more attention to Dongfang Hanyue’s Blackfiend Dragon Set.</p><br/><p>Having heard Zhou Weiqing’s description, surprise kept flashing through Duan Tianlang’s eyes, “Combining with a dragon? There’s such a fantastical legendary armor set in Mysterious Heavenly Mainland?”</p><br/><p>Zhou Weiqing nodded and said, “The Mysterious Heavenly Palace Master had only a mid-tiered Heavenly Emperor cultivation base, but with the armor set, it could fight against a Heavenly God tier powerhouse, one could only imagine how much power the armor set could provide. Our Strength Legacy had been around for a long time, so why can’t we have a set of eleven-piece legendary armor set? If our ancestors could create Ringless Ground Purging Set based on the foundation laid in Hiltless Sky Purging Set, I believe only you would have the mastery to create its eleventh piece.”</p><br/><p>Zhou Weiqing understood Duan Tianlang too well, he did not want Duan Tianlang to feel guilty about his help, and to want to stay alive, Duan Tianlang had to have something he wanted to achieve. Approaching it from the perspective of Consolidated Equipment Scrolls would definitely be the best choice.</p><br/><p>Duan Tianlang nodded lightly, but he only smiled bitterly, “To add a piece on top of the ten pieces? That’s easy to say, but difficult to execute! It would be easier to create a ten-piece from scratch.”</p><br/><p>Zhou Weiqing chuckled knowingly, “Junior Master, I believe, where there’s a will, there’s a way. Nothing is impossible. Look, never in my life had I practiced creating a Consolidated Equipment Scroll, but I still became a God Tier Master, did I not?”</p><br/><p>“Huh?” This time around, not only Duan Tianlang, even Long Shiya yelped.</p><br/><p>“You became a God Tier Master?” Duan Tianlang rushed in front of Zhou Weiqing, his hands clutching Zhou Weiqing’s shoulders. His face was filled with joy and pride, looking even more excited than his receiving decades of life extension.</p><br/>\n</div>"}