{"title": "Chapter 753", "id": 753, "volume": 8, "url": "http://boxnovel.org/heavenly-jewel-change-chapter-753", "volume_title": "Volume 8", "body": "<h1>Chapter 753</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Zhou Weiqing had never seen such an expression on Ming Yu; his face was now pale, and his body was shivering slightly. Moreover, his emotions were in a state of agitation, even to the extent that he might lose control.</p><br/><p>“What’s the matter, Ming Yu? Don’t rush. Speak slowly,” Zhou Weiqing stood by his side immediately and supported his body while channeling a stream of Saint Energy into him.</p><br/><p>Supported by Zhou Weiqing’s Saint Energy, Ming Yu’s emotions stabilized, albeit with a lingering pant.</p><br/><p>Looking at Zhou Weiqing, Ming Yu’s gaze was complicated, “Weiqing, Weiqing, the Heavenly Demon Sect, the Heavenly Demon Sect has been annihilated…”</p><br/><p>What?” Zhou Weiqing was astonished; his heart overwhelmed by bewilderment.</p><br/><p>‘The Heavenly Demon Sect has been annihilated? What concept is this? The Heavenly Demon Sect may be the weakest among the five Great Saint Lands, but it is a Saint Land nonetheless! To aim to destroy a Saint Land when they had not received any news, how strong of a power is required? There’s no guarantee that even Heaven’s Expanse Palace will be capable of doing so,’ Zhou Weiqing thought.</p><br/><p>At this moment, the person he thought instantly of was Little Witch, and his heart was immediately occupied by the images of Little Witch smiling.</p><br/><p>‘If the base is destroyed, what will be left of its residents? No matter who it was who had annihilated the Heavenly Demon Sect, what will Little Witch do?’ he thought.</p><br/><p>Ming Yu said with a bitter demeanor, “It’s the Blood Red Hell. It’s them who had attacked. I’ve just received the new as well; it happened a few days ago. A large number of Blood Red Hell powerhouses has ambushed the headquarters of the Heavenly Demon Sect in the Bai Da Empire. As the headquarters had been completely destroyed, I’m afraid not many had been able to escape. I’m still not clear on the details. Nevertheless, one thing that can be confirmed is that the Heavenly Demon Sect has suffered grave losses.”</p><br/><p>Zhou Weiqing furrowed his eyebrows, and thought, “Blood Red Hell had actually struck the Heavenly Demon Sect at this time, and was even able to annihilate it. Wouldn’t that mean that they now possessed sufficient powers which could even put them on the same ranks as the Heaven’s Expanse Palace?”</p><br/><p>Ming Yu sighed and said, “The initial plans of the Heavenly Demon Sect were to wait until our armies have invaded the Bai Da Empire, and then cooperate with them seamlessly to completely overthrow it, but who would have known that even before we’ve moved, we would be assaulted by Blood Red Hell?”</p><br/><p>Zhou Weiqing said, “What do you need me to do now?</p><br/><p>Ming Yu shook his head blankly, and said, “I don’t know either. Without knowing the situation, there’s nothing we can do.”</p><br/><p>Zhou Weiqing took a deep breath and said, “Ming Yu, stay calm. No matter what, we, the Heavenly Bow Empire, is the support of the Heavenly Demon Sect. How about this? You try your best to contact the sect members of the Heavenly Demon Sect who’ve escaped. We’ll take all of them into our custody. Then, we’ll let them re-establish the Heavenly Demon Sect in the Heavenly Bow Empire. We must have our revenge.”</p><br/><p>Ming Yu nodded and said, “This is the only thing we can do for now. I hope that the Sect Master can stay alive. Otherwise, it’ll be the end for Heavenly Demon Sect. Thank you, Weiqing, I’ll be taking my leave,”</p><br/><p>While he was speaking, he bowed at Admiral Zhou and Di Feng Ling once again and left in low spirits.</p><br/><p>Staring at King Yu’s silhouette leaving into the distance, Zhou Weiqing stood there without moving an inch; his brain spinning as it spiraled with thoughts.</p><br/><p>The annihilation of the Heavenly Demon Sect was not a good news to Heavenly Bow Empire. The reason why Zhou Weiqing had the confidence to establish a Saint Land in Heavenly Bow Empire was due to his prior agreements with the Heavenly Demon Sect.</p><br/><p>Once the Heavenly Bow Empire had strengthened, the Heavenly Demon Sect could come to its aid, and with the Heavenly Demon Sect in place, Zhou Weiqing would not have to be concerned about the insufficiency of the overall powers while he would be developing his Saint Land. At the very least, before the Saint Land’s development, the higher-tier powers of the Heavenly Bow Empire would be supported by the Heavenly Demon Sect.</p><br/><p>However, now that the Heavenly Demon Sect had been eliminated, it may be bad news to Heavenly Bow Empire, but there was a denial that it was an opportunity as well. Maybe, it might be possible for the Heavenly Bow Empire to have its own Saint Land within a short span, and have its powers upgraded to a certain extent.</p><br/><p>Di Feng Ling had stopped talking about Zhou Weiqing to inherit the throne as he discovered that the latter had long reached a height which was out of his line of vision. Such a territory like the Heavenly Bow Empire was no longer attractive to him.</p><br/><p>After half a month, the Heavenly Bow Empire had been completely reclaimed, as it had achieved total victory in the battle of Heavenly Bow City. Seventy thousand enemies had been killed, and ten thousand of them had been captured, with most of them being taken into the empire. Some of the more stubborn ones had been murdered without hesitation. With this, the Heavenly Bow Empire’s army had once again, increased by a hundred thousand men.</p><br/><p>Of course, these armies still required time to be organized and trained, with all of them assigned to individual parts of the original system of the Heavenly Bow Empire for expansion.</p><br/><p>One must know that the area of the Heavenly Bow Empire was only comparable to a province of Fei Li Empire, but now, it had encompassed two hundred thousand armies, not lacking any elites.</p><br/><p>After a month, the Emperor of the Heavenly Bow Empire had relayed his orders for the armies to advance toward the Kalise Empire.</p><br/><p>The primary forces of the Kalise Empire had long been lost in the Heavenly Bow Empire. The Bai Da Empire had no longer given them any support, and in another month, the Kalise Empire would have been annihilated, adding to the victory of the Heavenly Bow Empire.</p><br/><p>The total destruction of the Kalise Empire had also implied the rise of a new country. Several hundred thousands armies of the Heavenly Bow Empire were stationed at the borders, giving the perception that they would be capable of threat towards the Bai Da Empire any time. In fact, they could not mobilize any troops for the time being.</p><br/><p>Having just seized the Kalise Empire, the Heavenly Bow Empire needed to rest and resume their military recruitment at the same time.</p><br/><p>The Zhongtian and the Fei Li Empire had been transporting their resources endlessly into the Heavenly Bow Empire, effectively eliminating any concerns about the lack of resources. However, to sustain the life of so many armies, they needed to be self sufficient. According to the plans of Zhou Weiqing, Di Feng Ling, and the others, there would not be any major advancements in the meantime. Of course, it would only be a matter of time before they would invade the Bai Da Empire.</p><br/><p>In these two months, the mainland was calm, with no battles in the other locations. However, the calmer it had seemed to be, the more Zhou Weiqing felt that it was a sign that something major would happen.</p><br/><p>“Weiqing,” Ming Yu walked in; his face full of joy. They were now still in the compounds of Heavenly Bow City. Although the armies were still on guard at the former borders of the Kalise Empire, Zhou Weiqing and several other primary leaders had all returned due to an extremely important matter they needed to address.</p><br/><p>“How is it?” Zhou Weiqing asked Ming Yu. He had now returned to stay in the Admiral House of Admiral Zhou, and his four soulmates had all joined him in staying at the Admiral House as well. However, what troubled Zhou Weiqing was the fact that since his current return, the four ladies seemed like they had come to an agreement. They had shut each of their doors upon nightfall, not allowing anyone to enter.</p><br/><p>It was not impossible to enter by force, but Zhou Weiqing was afraid of the jealousy arising from others! Furthermore, too much had happened recently and things had only resumed its regular operations as of late. To the Heavenly Bow Empire, this was only the start as it required a great amount of time to reorganize itself. After all, to become a powerful country, it could not be done in such a short time. The biggest issue of the Heavenly Bow Empire was the instability of its foundation.</p><br/><p>Ming Yu nodded lightly at Zhou Weiqing, and said, “They’re here, waiting outside. Only two have come.” Zhou Weiqing said, “Hurry up and invite them in. Oh, no, I’ll go with you to welcome them.”</p><br/><p>While speaking, Zhou Weiqing pulled Ming Yu outside. Upon exiting the door, Zhou Weiqing’s footsteps had come to a stop, and could not direct his gaze away from the person before him.</p><br/><p>Little Witch had seemed to have lost a lot of weight; she had never been plump but looked even skinnier now which aroused the sympathy of others. Her lovely face was slightly pale. The person beside her was an old man with a huge physique.</p><br/><p>The old man appeared to be in his sixties and was rather dignified. However, a cold aura radiated from his body.</p><br/><p>Staring at Zhou Weiqing, Little Witch was stunned momentarily, and in the next instant, her eyes had reddened. She clenched her teeth and said nothing.</p><br/><p>Being stared at intently, full of resentment, Zhou Weiqing’s heart was uneasy. Back then at the crater, he had conquered the girl in front of him although his memory was incomplete! After that, the Heavenly Demon Sect had held its tongue, neither have they troubled him. In these recent years, Little Witch had not come looking him either.</p><br/><p>Upon meeting Little Witch, feelings of guilt surged from Zhou Weiqing’s heart. Speeding up his footsteps, he stood before the two people, and Zhou Weiqing slightly bowed at the old man, “I, Zhou Weiqing, have arrived to meet you, your highness.”</p><br/><p>The old man in black looked at Zhou Weiqing with a faint smile on his face, “Actually, I should’ve come to see you long ago, but there was never a good chance. I’ve heard that you’re a spectacular individual. Upon seeing you with my own eyes, it’s no doubt that the rumors are true. Even I am unable to see through your cultivation base. It’s no wonder that even Ming Yu’s pride had been conquered by you.”</p><br/><p>Zhou Weiqing chuckled, and said, “I dare not say the word conquer. We are friends; partners as well as comrades.”</p><br/><p>After finishing his sentence, he directed his gaze toward Little Witch, and after a pause, he said with a lowered voice, “Sorry, I… I should’ve come to see you.”</p><br/><p>Little Witch finally could not hold back her sobs. With a turn of her body, she had leaped into the embrace of the old man in black and burst into tears.</p><br/><p>Zhou Weiqing instantly felt awkward, and he scratched his head. He was most afraid of being in this kind of situation. Despite his intelligence, he did not know how he should handle the situation.</p><br/><p>The old man in black sighed, and said, “Weiqing, aren’t you going to invite us in?”</p><br/><p>“Oh, oh, how rude of me, senior. Please, do enter.”</p><br/><p>As he spoke, he led the old man in black and Little Witch into the meeting hall of the Admiral House.</p><br/><p>Without a doubt, this old man in black was the Sect Master of Heavenly Demon Sect, Demonic Emperor Wu Yunyue. He was the highest ruler of one of the five Great Saint Land’s Heavenly Demon Sect, and also one of the few Heavenly Emperor-tire powerhouses in the mainland. Concurrently, he was also Little Witch’s father.</p><br/><p>A few months ago, Heavenly Demon Sect had received a destructive blow from Blood Red Hell. After the drastic disaster, only a third of the people of Heavenly Demon Sect were able to escape.</p><br/>\n</div>"}