{"title": "Chapter 762", "id": 762, "volume": 8, "url": "http://boxnovel.org/heavenly-jewel-change-chapter-762", "volume_title": "Volume 8", "body": "<h1>Chapter 762</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>However, they did not even have a chance to feel shocked as the Saint Energy Galaxia descended from the sky and continuously rained on them. It eliminated all the impurities in their bodies. With the support from the energy of the mysterious Star Reflection, the two ladies’ cultivations increased at a shocking speed.</p><br/><p>Because Shangguan Bing’er had followed Zhou Weiqing to the Mysterious Heavenly Mainland, her cultivation base was higher than Tian’er. However, her current cultivation speed was no match for Tian’er.</p><br/><p>Followed by a soft moan from Tian’er, a faint starlight radiated from her body. Striking colors mixed with nebula energy also appeared on her chest. The striking starlight was circulating at a high speed. With every spin, it absorbed as much Saint Energy Galaxia in the air as it could. She had also absorbed a portion of the reddish golden energy released by Zhou Weiqing during his elevation process.</p><br/><p>Long Shiya’s jaw almost dropped when he witnessed the scene in the sky. He exclaimed, “Heavens! The two ladies are solidifying their Heavenly Nucleus Core. We’ve been living our lives in vain. If they succeed, there’ll be three Heavenly King-tier powerhouses in their twenties.”</p><br/><p>He could see that Zhou Weiqing’s condition had stabilized with Tian’er’s assistance.</p><br/><p>Demonic Emperor Wu Yunyue said bitterly, “It’s not three Heavenly King-tier powerhouses. It’s two Heavenly Kings and a Heavenly Emperor in his twenties. Heavenly Emperor! Do you know how much I feel like yelling at someone right now? What the f*ck! Why didn’t I meet this youngster earlier? If I did, there’s a possibility that he might wind up being my disciple instead.”</p><br/><p>Long Shiya spared a glance at Wu Yunyue and said gleefully, “You’ve no choice in this. I’m luckier, and I have a better eye for discerning people with great talent. Now, no one can snatch my beloved disciple away from me. On the mainland, no one else is qualified to be his teacher anymore. Wu, it’s not yet time for us to rest. Ask your Heavenly King subordinates to leave. We’ll protect the three of them. As long as they succeed in upgrading, we’ll no longer have anything to worry about even if Blood Red Hell sends another batch of their men here.”</p><br/><p>Although Wu Yunyue was really jealous of Long Shiya, he was in high spirit at this moment. When he was looking at Zhou Weiqing who was about to evolve into a Heavenly Emperor, he came to a conclusion. He felt relieved after the decision had been made. It had been a long time since he was in such a great mood.</p><br/><p>He said while laughing out loud, “Brother Long, what’s your purpose of becoming a Heavenly Emperor or Heavenly King-tier powerhouse? Even if the Blood Red Hell has been concealing much of their powers all these years, they’ll definitely be dealt a fatal blow this time. Moreover, since we’ve annihilated all of them, who knows how long it’ll take for the news to reach them. Besides, I believe that even if Blood Red Hell has gotten hold of the information, they won’t dare to send anyone here. The Heavenly Bow Empire is different from the Heavenly Demon Sect. Zhou Weiqing has good relationships with the Heaven’s Expanse Palace and the Heavenly Snow Mountain. Blood Red Hell has already failed the first time. Even if they wish to invoke another battle, they have to take the power of those two Great Saint Lands into consideration as well.”</p><br/><p>As he was speaking, Wu Yunyue had already relayed his order to dismiss the remaining few Heavenly Kings. At the same time, he and Long Shiya guarded the place together as they observed the miraculous scene of Zhou Weiqing’s breakthrough. At that moment, Wu Yunyue and his six Heavenly Kings had an odd feeling. All of the injuries on their bodies were healing at a terrifying speed. Apart from that, there was a faint feeling that their personal cultivation base was rising as well. Without a doubt, this was all due to the Saint Energy Galaxia that Zhou Weiqing released into their bodies. Due to the infusion of energy, their personal energy had improved significantly.</p><br/><p>They developed a deep admiration for Zhou Weiqing and no longer had any doubts because of the wonders that Zhou Weiqing had demonstrated. Wu Yunyue believed that his decision would not encounter any obstacles at all. The starlight in the sky remained for a day and a night before it gradually dimmed. The first few whose glow started to dim were Zhou Weiqing and Tian’er. It took Zhou Weiqing a very long time to advance to the Heavenly King Tier back then. However, he had the Star Reflection’s support in the sky this time. The fact was that this breakthrough was fueled by the Star Reflection energy that he had accumulated himself. That was the reason why the speed of his breakthrough was a lot faster. The most important factor was Tian’er. The mysterious energy that radiated from Tian’er allowed Zhou Weiqing to complete the qualitative changes of his own nebula in such a short period of time.</p><br/><p>At that moment, the Starcrux Saint Nucleus Core in Zhou Weiqing’s body changed. The ball of Starcrux Saint Nucleus Core had turned into an actual nebula. Although there was a nebula in his body previously, the Starcrux Saint Nucleus Core was the core while the Saint Energy Galaxia revolved around it. However, it was now a complete Starcrux Saint Nucleus Core that was in the form of a nebula completely. Apart from that, Zhou Weiqing’s Saint Energy Galaxia underwent the biggest change. Its original golden color had changed into a reddish golden color. The changes in color also signified the qualitative changes in his power as well.</p><br/><p>Zhou Weiqing could not tell the extent of improvement the power in his cultivation base. All he knew was that if he was to judge in terms of energy strength, his current level was definitely not at the Lower-Level Heavenly Emperor Tier but at least at the Mid-Level Heavenly Emperor Tier. The reason why it rose to such a degree at once was due to the Star Reflection brought upon by Tian’er.</p><br/><p>The benefits Tian’er gained were much greater than what Zhou Weiqing had gained. Initially, she still had a long way to go before reaching the Heavenly King-tier cultivation base. However, she managed to break through this time and upgraded instantly. The progress was so simple that even Zhou Weiqing was a little envious of her. Her breakthrough was even faster than the time Zhou Weiqing had his breakthrough on the Mysterious Heavenly Mainland.</p><br/><p>When Zhou Weiqing regained his consciousness, he first looked at Shangguan Bing’er who was nearby. She was still in the process of upgrading. He also saw Shangguan Xue’er and Shangguan Fei’er but he had no idea when they had gotten here. At that moment, they were both being condensed within the Saint Energy Galaxia in the sky. After that, he started caressing Tian’er’s tummy.</p><br/><p>“Tian’er, how is it? Is our child all right?”</p><br/><p>Upon hearing Zhou Weiqing’s concerned voice, Tian’er instinctively looked at her tummy. To be honest, she did not think about it too much when she and Shangguan Bing’er came to rescue Zhou Weiqing. All she had on her mind was to rescue him and to help him complete his breakthrough. Tian’er had only realized the danger when Zhou Weiqing released a massive amount of Saint Energy into her body. What if the massive amount of energy that entered her body was harmful to the child?</p><br/><p>However, Tian’er made up her mind at that moment. They could always conceive another child but she would never get her husband back if she lost him. Therefore, at that instant, Tian’er decided to bear the pain in her heart and stayed on. Something happened as soon as she made that decision. As if her body could feel the sadness in her heart, her tummy moved slightly and Saint Energy that was even more powerful than Zhou Weiqing’s appeared. Tian’er was very sure that the changes in the nebula, as well as her tremendous breakthrough, came from the gush of energy in her tummy.</p><br/><p>As she gently caressed her tummy, Tian’er was still stunned as she mumbled, “The child is fine. Better than before. The child seems to be absorbing a lot of Saint Energy Galaxia! I couldn’t feel his life aura previously but I can feel it clearly now. If I’m not mistaken, the child may arrive earlier than the date father gave us.”</p><br/><p>Zhou Weiqing was relieved to hear that the child was fine. At that moment, he was so emotional that he was completely speechless as he hugged Tian’er tightly. The nebula in the sky was fading gradually, it was a sign that it was disappearing. Zhou Weiqing looked up at the sky, a reddish gold glow flashed in his eyes as a dazzling reddish golden starlight emitted from his body and enveloped the Shangguan Triplets within it.</p><br/><p>Shangguan Xue’er and Shangguan Fei’er had arrived late. They were not here to take advantage of the situation but to the help them if something went wrong because they had Saint Energy in their bodies as well. Although Shangguan Xue’er could not fly yet, with the Six Ultimate Heavenly Emperor’s help, she could float in the sky temporarily. The two sisters were ready to inject Saint Energy into Zhou Weiqing whenever he needed it.</p><br/><p>Perhaps it was true, no good deed goes unrewarded. Although they did not get the first course, they did not miss the main course. Taking in the powerful Saint Energy Galaxia in the air and the Saint Energy’s reaction in their bodies, they naturally would not give up such a great opportunity because they were smart. The only downside was that they were late so it was impossible for them to break through to Heavenly King Tier now. Nevertheless, both of them had reached Maximum Level Ninth Jewel.</p><br/><p>Under the protection of Zhou Weiqing’s reddish-gold light, Shangguan Xue’er and Shangguan Fei’er soon woke up from their cultivation. They would not fall with the protection of Zhou Weiqing’s reddish-gold Saint Energy. Zhou Weiqing found out that if before this he could control Atmospheric Energy and even the Atmospheric Energy that Heavenly King and Heavenly Emperor-tier powerhouses were controlling when he was at Heavenly King Tier, then now he could directly control the Saint Energy within heaven and earth.</p><br/><p>He could not feel it at all when he was at Heavenly King Tier. Breaking through to the Heavenly Emperor Tier had increased his perception immensely. His ability to sense became broader in scope and was more detailed. He could clearly feel all the energy waves in the air. He could even sense the trace amount of Saint Energy that existed on heaven and earth. The Saint Energy had been lingering in the air ever since the world was created. Its amount was one-thousandth of normal Atmospheric Energy. Even a Heavenly God-tier powerhouse would not be able to sense its existence. After Zhou Weiqing had broken through to the Heavenly Emperor Tier and his Nucleus Core transformed into an actual Nebula Saint Nucleus Core, he could finally feel the pure Creation Energy. The Perception would greatly benefit his cultivation in the future.</p><br/>\n</div>"}