{"title": "Chapter 760", "id": 760, "volume": 8, "url": "http://boxnovel.org/heavenly-jewel-change-chapter-760", "volume_title": "Volume 8", "body": "<h1>Chapter 760</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>The black hole in the air shrunk slowly, but as it vanished completely, the people of the Blood Red Hell were shocked to discover that although the six-colored glow had disappeared due to the decrease in Long Shiya’s cultivation base. It had been replaced by another color. The disappearance of the black hole did not bring the darkness away but revealed the stars that it previously covered that nobody had ever seen before.</p><br/><p>The day turned into night at that very moment, and the dazzling starlights in the sky formed a huge, spiral-shaped light nebula. There was gentle energy wave released from the cloud. As the stars fell, the Blood Red Hell’s Enchantment of Destruction could no longer reach the sky. Zhou Weiqing’s Saint Energy Galaxia was the purest Creation Energy. Creation and destruction had always been on opposing sides, but it could only be restrained mutually when both were equal. Although the Blood Red Hell powerhouses possessed the Destruction Attribute, only a small portion of these were mixed with the other attributes they possessed. In the end, their Destruction Attribute was clearly weaker than Zhou Weiqing’s purest Saint Energy when they were compared.</p><br/><p>Mobilizing the nebula would mean that Zhou Weiqing was connected with the nebula. The energy strength aside, the powerful Saint Energy Galaxia aura alone had suppressed the Destruction Attribute completely. Without the ability to integrate their Destruction Attribute, it was impossible for the Blood Red Hell powerhouses to release an integrated attack. With only the aura of his attributes, Zhou Weiqing had managed to cause the Blood Red Hell powerhouses to temporarily lose the best offensive technique they had.</p><br/><p>The First and Third Elders of the Blood Red Hell were stunned. They could see Zhou Weiqing, who was far away. The spiral nebula lit up on Zhou Weiqing’s chest while he floated higher into the sky at that moment. He held the Second Elder in his right hand, but his body was dangling. It was clear that there was no sign of life in him.</p><br/><p>Zhou Weiqing acted like he could not see the powerful enemy before him. At that very moment, he had entered a mysterious realm and had a calm expression on his face like nothing could bother him any longer. Under the light starlights, he looked like a superior watching over the world. The Saint Energy Galaxia’s powers were not that strong, but the light energy waves managed to make everyone feel like their attributes were muted, his enemies and the Heavenly Jewel Masters on his side included. Most importantly, they were completely cut off from the Atmospheric Energy from the outside world. In their eyes, Zhou Weiqing had merged with the heavens.</p><br/><p>Wu Yunyue’s eyes were wide open. He already had a high appraise of Zhou Weiqing. Whether it was his abilities or his planning prowess, this young man was on top of his game. However, it was only now that he realized that his estimation of Zhou Weiqing was far from what this man was actually capable of. The aura that was coming off from this young man’s body was beyond recognition. ‘How is that possible? What exactly is this energy!’, he thought.</p><br/><p>The both of them were stunned. On the other side, the First Elder of the Blood Red Hell dared not move hastily. The death of the Second and Fourth Elder had calmed them down from their rage for now. Something was going on, especially since this odd phenomenon was happening, and their biggest advantage had been suppressed. Attacking Zhou Weiqing aside, it was tough to even face the Six Ultimate Heavenly Emperor and the Demonic Emperor. Every Blood Red Hell powerhouse clearly realized that the Destruction Attribute in their bodies was being suppressed completely and could not be released any longer. It was the first time they encountered something like this from when they first obtained this powerful attribute. The Destruction Attribute seemed to be fearful of the Saint Energy Galaxia.</p><br/><p>The news was too important to the Blood Red Hell. The existence of Zhou Weiqing was no doubt a major threat to the Blood Red Hell’s future. The First and Third Elder were considering if they should get their people out of here to spread the news. The reason why the Blood Red Hell had managed to grow so fast and challenge the Heavenly Expanse Palace was because they were relying on the Destruction Attribute! If the Destruction Attribute’s power were to vanish, the impact on the Blood Red Hell’s capabilities would be major. They had been saving the power for so many years and they finally began to use it. If this failed, the Blood Red Hell would fall into devastation.</p><br/><p>Zhou Weiqing floated in the air. Everything was in his control as he was the one who planned everything. Killing the Second and Fourth Elders before getting the Demonic Emperor and his master to attack bought enough time for him to create the opportunity to connect with the nebula. It was the second time Zhou Weiqing had used this ability in a battle. Although summoning the nebula was an extremely powerful ability, it was his trump card. In fact, he could not be interrupted at all during the summoning process; otherwise, he would fail immediately.</p><br/><p>The Blood Red Hell’s disadvantage was that they did not know much of Zhou Weiqing. The black hole that was created from the big collision had allowed Zhou Weiqing to summon the nebula energy wave that he had been hiding successfully. Eight dazzling gold glows fell from the sky with Zhou Weiqing’s command and landed on Six Ultimate Heavenly Emperor Long Shiya, Demonic Emperor Wu Yunyue, and the six Heavenly Demon Sect Heavenly King-tier powerhouses.</p><br/><p>The eight of them felt exuberant in an instant as massive amounts of energy that was without any attribute flowed into their bodies. The energy was very pure, but the most amazing part was that although it was huge, it was gentle as well, so they could absorb it directly. Moreover, there was a unique energy wave in this pure energy. As soon as it lingered around them, all of their injuries were reduced significantly.</p><br/><p>At the same time, Zhou Weiqing waved his right hand into the sky. A ball of rich light halo exploded in the sky and entered his hand immediately. The Second Elder, who was in Zhou Weiqing’s other hand, turned into ashes. It was also the doing of the ball of glow. The two light glows were the Second and Fourth Elders’ Heavenly Nucleus Cores. Those were the Heavenly Emperor-tiers’ Heavenly Nucleus Cores! Then, two gold glows shot into the sky and dashed towards the nebula in the sky. Meanwhile, Long Shiya and Demon Emperor Wu Yunyue dashed towards the Blood Red Hell powerhouses beneath without any hesitation.</p><br/><p>With the support of Zhou Weiqing’s Saint Energy Galaxia, not only had they healed plenty, their Heavenly Energy had a significant recovery. One must know that when Zhou Weiqing summoned the nebula, it was like he had transformed into the lord of the world. Under such circumstances, nobody should expect to recover their bodies by absorbing Atmospheric Energy. Meanwhile, the Heavenly Bow Empire’s powerhouses undoubtedly had the upper hand in the aspect of energy due to Zhou Weiqing’s help.</p><br/><p>Although they could not attack by mobilizing the Atmospheric Energy any longer, the attacks of these Heavenly King and Heaven Emperor-tier powerhouses were still powerful. A war exploded in an instant. Right at that moment, a gold glow shot from the sky. The intense gold was like two light pillars that connected the ground below them to the heavens. The lights shone on Zhou Weiqing in a sequence and all of a sudden, Zhou Weiqing’s body turned a shade of dazzling gold with countless starlight entering his body from the golden glow.</p><br/><p>Zhou Weiqing waved his left hand again and the Heavenly Nucleus Core of the Heavenly King Tian Lei, whom he had previously killed had also appeared in the sky. Although Zhou Weiqing no longer wanted to conduct Star Reflection onto a Heavenly King-tier Heavenly Nucleus Core, it was something useful after all, as it was good that he could consolidate a Heavenly Nucleus Core from it. Moreover, many a little makes a mickle.</p><br/><p>It was a taboo to Heavenly Jewel Masters if one was to increase his cultivation base in battles, as the body would be weakened immensely during the upgrade process. However, it was a different case for Zhou Weiqing as he had a remarkable ability since the beginning. At that moment, he had mastered World Vision. It was already difficult for them to get somebody from the Blood Red Hell to fight him and even if they could, nobody would dare to attack him so hastily! The level of the battle was now meaningless to Heavenly Zong-tier powerhouses. Therefore, although the Blood Red Hell were only left with Heavenly Jewel Masters on their side, he dared not join the battle as the aftershock of a Heavenly Emperor-tier powerhouse’s attack could definitely end them.</p><br/><p>At this point, the most powerful forces left in the Blood Red Hell were the First and Third Elders at the Heavenly Emperor Tier as well as the seven Heavenly King-tier powerhouses. If the nebula in the sky did not exist, the integration of their Destruction Attribute energy could definitely defeat the Six Ultimate Heavenly Emperor’s side. However, the tables were turned. Now that they had lost the Destruction Attribute, they could only fight on their own.</p><br/><p>On Long Shiya’s side, they had two Heavenly Emperor-tier and six Heavenly King-tier powerhouses. Although they had one less Heavenly King-tier powerhouse than the other side, one should not forget that the Heavenly Demon Sect’s combat abilities had always been the most powerful among powerhouses of the same level. Furthermore, these six Heavenly King-tier powerhouses hated the people from the Blood Red Hell to the core of their beings. The six Heavenly King-tier powerhouses had the upper hand as they defended the attacks of the seven Heavenly King-tier powerhouses from the other side.</p><br/><p>The Blood Red Hell First and Third Elders began sweating. They could still maintain their position in the battle as the two who were at the pinnacle of the Heavenly Emperor Tier, Long Shiya and Wu Yunyue were injured and could not perform their most powerful abilities. However, one should not forget that Zhou Weiqing was in the sky. Although Zhou Weiqing had yet to attack them, that did not mean that he would never attack! One could imagine how pressured the Blood Red Hell powerhouses would feel with such a powerful man floating in the air.</p><br/><p>However, the fortunate feeling that they had in their hearts had soon vanished. The two golden glows in the sky did not last too long. As the golden glow slowly disappeared, the light gold color on Zhou Weiqing’s body had become intensely overbearing and was now a bright gold color. The Saint Energy Galaxia’s starlight surrounding his body had obviously become denser. By using Star Reflection on the Heavenly Nucleus Cores of the two Maximum Level Heavenly Emperor-tier powerhouses from the Blood Red Hell, Zhou Weiqing had upgraded his cultivation base to the Maximum Level Heavenly King-tier in a very short period of time.</p><br/>\n</div>"}