{"title": "Chapter 777", "id": 777, "volume": 8, "url": "http://boxnovel.org/heavenly-jewel-change-chapter-777", "volume_title": "Volume 8", "body": "<h1>Chapter 777</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>The Elven Queen frowned, “What happened? Also, why have you come here?”</p><br/><p>Zhou Weiqing did not hold back, and immediately summarized his reasons and his experiences after arriving in the Elf Tribe.</p><br/><p>Upon hearing his explanation, the Elven Queen instantly replied, “That explains why you were able to enter the Sealed Land of my Elf Tribe. You had Saint Energy. Naturally, the Natural Energy would not have stopped you. Young man, you are also the most outstanding human I’ve ever met. To have achieved so much in your cultivation base, at such a young age… You’ve even managed to draw the Demon God’s projection. It looks like you’ll surpass Phelia’s husband very soon.”</p><br/><p>The Elven Queen’s expression remained the same. However, the twelve Elf Tribe elders looked very displeased when they heard how he had come for the Elven Queen’s blood. They clearly looked hostile.</p><br/><p>Zhou Weiqing replied exasperatedly, “You flatter me, Your Majesty.” He sighed, “I did not expect to encounter such matters when I arrived. Your Majesty, the current situation may be unclear but I’m willing to help you find your daughter. Even though it all happened so suddenly and neither was I able to stop her nor do I know how she managed to do it but I left a Divine Thought on your daughter, which may help in finding her.”</p><br/><p>If this came from anyone else, the Elven Queen would never have believed them. It was an extremely difficult feat to place a Divine Thought on anyone’s body. Even she, a cultivator at the Heavenly God stage, never dared to guarantee that she could do it herself. However, Zhou Weiqing was different. He had Saint Energy and she had also sensed the power in his Saint Energy a while ago. Without the Saint Energy, how could he, a cultivator at the Heavenly Emperor stage be able to stand against her, a cultivator at the Heavenly God stage?</p><br/><p>In this world, the Mountain Lord of Heavenly Snow Mountain, Xue Ao’tian was not the only one at the Heavenly God stage. Simply put, a few reclusive Heavenly Beasts at the Heavenly God stage were just as powerful and that includes her, the Elven Queen as well. However, cultivators at the Heavenly God stage were not invincible, for the Heavenly God stage had levels as well.</p><br/><p>The Elven Queen nodded as she stared at Zhou Weiqing’s earnest face, “That’s great. Previously, I was in the midst of cultivation when I sensed energy fluctuations from the outside world in the Sealed Lands. Then, my daughter’s aura disappeared. It’s likely that she’s no longer in the Elf Tribe land. So I’ll have to trouble you now.”</p><br/><p>Zhou Weiqing smiled and said, “Your Majesty, please be rest assured. The reason why I want to help you isn’t because I want your blood. I only hope to befriend the Elf Tribe. As for my reasons for coming here, if it’s possible, let’s discuss it after I’ve saved your daughter. We’ll see if we can arrange a trade with something I have on hand. You know just as well what an eleven-piece Consolidated Equipment set means to us humans.”</p><br/><p>The elders behind the Elven Queen looked significantly unhappy. Naturally, they could tell, that Zhou Weiqing was not going to give up on his goals so easily. Except, it was best for them to stay out of it at a time like this. Even though they did not like these foreign humans, Zhou Weiqing did say that he had placed a Divine Thought on the little princess. He would not make this up, based on his cultivation base. This matter concerns the heir to the Elf Tribe, so they had no choice but to swallow their temper. Saving the little princess was now more important than anything else.</p><br/><p>The Elven Queen looked at Zhou Weiqing and nodded, an odd splendor flashed across her eyes. At this very moment, no one knew what she was thinking. Aside from the odd look in her eyes, she was deeply worried about her kidnapped daughter.</p><br/><p>After Zhou Weiqing had spoken, he immediately sat cross-legged on the ground, closed his eyes, mobilized Saint Energy, and entered a definite state.</p><br/><p>Even though the Elf Tribe has done away with their animosity, his close female friends still surrounded Zhou Weiqing instinctively. The women’s cultivation base was not weak either, and they all had Saint Energy within their bodies. If the Elf Tribe truly wished to attack again, they could still defend it.</p><br/><p>Pure gold colored Nebula Saint Energy circled around Zhou Weiqing, gradually moving upwards. Then, carefully, under his control, entered into his soul.</p><br/><p>Generally speaking, the soul was an existence near the human brain that contained a bizarre energy. You could say that it was a part of life. If most Heavenly Jewel Masters did whatever Zhou Weiqing was doing, it would be no different from committing suicide. The human brain is very fragile, even the slightest injury would result in death.</p><br/><p>However, Zhou Weiqing’s Saint Energy was not the same. Even if he directed Saint Energy into the brain, the Saint Energy would bring protective effects, and would not harm him at all. Saint Energy was a creation, not a destruction.</p><br/><p>A layer of pure gold light slowly dispersed from Zhou Weiqing’s head. You could see it very clearly — a strange ‘king’ symbol appeared on his forehead. However, what was even more miraculous, was under the ‘king’ symbol, was a faint dragon-shaped vein. Powerful soul fluctuations exploded instantly.</p><br/><p>When Zhou Weiqing released his Divine Thought, the Elven Queen and the Elf Tribe elders jumped in shock. The fluctuations from the Divine Thought were simply too powerful. Even if this were the Sealed Lands of the Elf Tribe, they would never have been able to release such a powerful Divine Thought.</p><br/><p>The powerful Divine Thought, could not increase one’s power in attacks, nor could it be instantly made to attack. However, this means a greater control, and an above average exploration ability. In simpler terms, if a Heavenly Emperor cultivator at the same cultivation base as Zhou Weiqing had one exploration distance, then, Zhou Weiqing, with the support of Saint Energy, would have the exploration ability of ten. This was also a vital reason behind his success in finding the Sealed Land of the Elf Tribe.</p><br/><p>The Elven Queen curbed her own Divine Thought, to avoid interrupting Zhou Weiqing’s exploration. But she could sense that Zhou Weiqing’s exploration was focused on a certain direction as if something was calling out to him.</p><br/><p>He had indeed left a Divine Thought on her daughter; the methods in Zhou Weiqing’s exploration proved this.</p><br/><p>After a short while, Zhou Weiqing rose to his feet, and nodded at the Elven Queen, “Your Majesty, perhaps we should take a walk?”</p><br/><p>The elders who stood behind the Elven Queen did not look happy. The leading elder hurriedly exclaimed, “Your Majesty, I’m afraid that this is inappropriate, what if…”</p><br/><p>Zhou Weiqing was intelligent. So naturally, he sensed their worries, and calmly replied, “There are no what ifs. I will leave my wives here. Only Her Majesty and I will go and save her.”</p><br/><p>The Elven Queen nodded, hinting at the elders to keep calm. She gestured in an invitation to Zhou Weiqing, “Then I thank you.”</p><br/><p>Zhou Weiqing smiled. Similarly, he had many ideas as well, since experiencing the greatness of the Elf Tribe. Besides, there were undoubtedly many mystical places in the Sealed Land of the Elf Tribe. He had only just established the Peerless Sect. How could he not rope the Elf Tribe in as well? So naturally, he would not let such a good opportunity to bridge the gap, go to waste.</p><br/><p>A pure gold light flashed in Zhou Weiqing’s eyes, and the Elven Queen nodded, “Then please excuse me.” As the crowd watched in shock, Zhou Weiqing took the Elven Queen’s little hand. Then, in a silver flash of light, the space around the two caved in, and they disappeared in a flash of light, traveling through space.</p><br/><p>The Elf Tribe elders were completely stunned, Zhou Weiqing’s close female friends did not look very happy either. Shangguan Fei’er exclaimed sulkily, “That naughty Little Fatty, he would even take unfair advantage of the Elven Queen.”</p><br/><p>Shangguan Xue’er shot her a look, “Don’t spout nonsense. Zhouqing is trying to protect Her Majesty. Do you think that traveling through space is easy?”</p><br/><p>Tian’er spoke leisurely, “Even if that’s true, sisters, we must be careful. Heaven knows if this dirty bastard has any pervert intentions. He’s always enjoyed fraternizing.”</p><br/><p>Shangguan Bing’er didn’t say much, as she was unable to contain herself from laughing.</p><br/><p>The Little Witch laughed softly, “Personal character! His personal character has always been unworthy of trust.”</p><br/><p>Like Shangguan Xue’er said, Zhou Weiqing held the Elven Queen as they traveled through space in order to protect her. Otherwise, if they were to lose their way upon entering a strange space, it would be difficult to find a way out. It was still a pretty big threat to a Heavenly God cultivator.</p><br/><p>The Elven Queen’s tiny hand was a little cold but was supple as if boneless. It was very comfortable to hold.</p><br/><p>When Zhou Weiqing held on to the Elven Queen’s hand, he clearly felt her body shudder slightly but she did not struggle. Obviously, she understood his objective.</p><br/><p>Zhou Weiqing’s heart did not really have much of an evil desire. Committing vulgar acts towards the Elven Queen in the Elf Tribe’s territory? He would never do such a crazy thing. Besides, after having five wives, he was able to moderate himself a lot more now. After all, as a man, he must be responsible, despite already having quite a lot of responsibility. He did not dare provoke any further. Besides, the Elven Queen was a Heavenly God. Zhou Weiqing did not wish to create trouble, nor did he think that he had great charm anyway.</p><br/><p>For the Elven Queen who had her hand held by Zhou Weiqing, this was another feeling altogether. There were shyness and a sense of novelty. In the Elf Tribe, she held a position of the highest supremacy, and wouldn’t normally leave the Sealed Land of the Elf Tribe. The Elf Tribe’s ways of passing traditions were different from humans. They did not need to mate. You could say that she became pregnant with her daughter through his blood, along with some unusual methods. Forget about human men, even the Elf Tribe men have never touched her before. The Elven Queen was not just the most supreme of all in the Elf Tribe, she also represented purity and holiness, and could only exist in the purest and most holy of all. This was the only way for her to have that kind of contract with the Goddess of Nature.</p><br/>\n</div>"}