{"title": "Chapter 807", "id": 807, "volume": 9, "url": "http://boxnovel.org/heavenly-jewel-change-chapter-807", "volume_title": "Volume 9", "body": "<h1>Chapter 807</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>‘Was the Blood Red Hell so easygoing? They didn’t even plan to avenge the death of the Maximum Level Heavenly King-tier powerhouse?’</p><br/><p>Zhou Weiqing glanced at Fen Tian as if he was absorbed in his thoughts.</p><br/><p>At the same time, Xue Ao’tian who was standing by the side started to speak, “Since nobody else has any more objections to it then the Peerless Sect will be temporarily counted as a Saint Land until the Grand Tournament ends. However, according to the tournament rules, if the Peerless Sect comes out last in the ranking in the end, it won’t be regarded as a Saint Land once the tournament ends. Do you understand, Weiqing?”</p><br/><p>Zhou Weiqing smiled, “I understand.” No matter what, his identity now was the Sect Master of the Peerless Sect. As expected, he could not bow down to his father-in-law in front of so many people. Moreover, all three of his fathers-in-laws were currently present at the scene.</p><br/><p>Perhaps it was due to Zhou Weiqing’s presence that the other four Great Saint Lands appeared to be much calmer. They no longer seemed ready to jump at each other’s throat. However, there was still some indistinct hostility between the Heaven’s Expanse Palace and the Heavenly Snow Mountain.</p><br/><p>Fen Tian turned to Xue Ao’tian, “Mountain Lord, since it’s going to be this way, let us begin our Grand Tournament. You’re the lord here. Naturally, you’re the host of this tournament as well.”</p><br/><p>“Alright,” Xue Ao’tian nodded his head as he slowly walked out to the center of an open space.</p><br/><p>The open space on the mountain top of the Heavenly Snow Mountain had a very large area. Although it could not be compared to Zhongtian Plaza, the center of the mountaintop still had several thousand square meters of open space left even though it was already filled with several hundreds of people.</p><br/><p>Xue Ao’tian swept a domineering glance over the place, his gaze stopped briefly on everyone present on the scene before he said in a deep voice, “As per the old rules, the Grand Tournament will take place in the sky. Let me first make it clear to all of you. During the tournament, whoever dares to destroy even a blade of grass or one tree on my Heavenly Snow Mountain will have a taste of the full extent my my wrath!” As he was saying that, he even deliberately looked towards Shangguan Tianyang.</p><br/><p>On the other hand, Shanguan Tianyang did not even bother looking at him. It was as if he did not even hear Xue Ao’tian’s threat.</p><br/><p>Xue Ao’tian continued, “In view of the Peerless Sect joining in our tournament, let me repeat the rules once again. According to the rules, all five Great Saint Lands will send ten people to join the first round of the tournament. The order of the battle will be decided by drawing lots. The representatives from the five Great Saint Lands will take turns battling each other. Whoever loses will be eliminated while the winner remains to accept the next challenger. The Saint Land will be disqualified once all ten of its powerhouses participating in the tournament are eliminated. All the Saint Lands will be ranked according to the elimination speed. The last two Saint Lands that lasts till the end will go through another group battle without a limit to the number of participants. The winner will be known as the best Saint Land in the world. There are no rules during the battle. The winner will be the king.”</p><br/><p>Although the rules of the Grand Tournament might sound simple, even much simpler than the Heavenly Jewel Tournament that was held in the Heavenly Jewel Island, one must not forget that those who were participating in the Grand Tournament were not young people, and there was also no limit to the cultivation base of those who participated. There were no rules for the battle, and one could easily imagine how dangerous this would be.</p><br/><p>Five Great Saint Lands biting each other’s head off ruthlessly. There was bitter enmity between all of them. Once they started to battle it out in the Grand Tournament, nobody would show any mercy at all. Death would most likely become a common occurrence, and who knew how many lives would be taken away this time.</p><br/><p>Before Zhou Weiqing came here, Wu Yunyue had already told him about the Grand Tournament rules. For this reason, it did not surprise him at all. He seemed like he did not give a damn about the upcoming bloody hurricane with that annoying and mischievous smile plastered on his face.</p><br/><p>Xue Ao’tian suddenly announced in his deep voice, “Every Saint Land can send out their first participant now! You’ll step into the arena altogether to make a draw first.”</p><br/><p>As soon as Xue Ao’tian finished talking, five shadows had already appeared on the arena. It was apparent that each of the Saint Land had already made their preparation beforehand.</p><br/><p>To everybody’s surprise, the first participant that the Heavenly Snow Mountain sent out turned out to be none other than the Tiger King, Xue Aoying. The person who represented Love Valley was one of the Valley Lords — Yun Ruoyun. In truth, this kind of one-to-one battle was slightly disadvantageous to Love Valley. This was the main reason why it had never lasted till the final round all this while.</p><br/><p>On the other hand, the powerhouse that the Heaven’s Expanse Palace sent out was an elder whose name was unknown, and it seemed like his cultivation base was only at the Heavenly King Tier. He looked like a small fry compared to the rest of the participants sent out by the other Great Saint Lands.</p><br/><p>As for the Blood Red Hell, the person who stepped out was a skinny, tall and gloomy looking elder who had a cultivation base at the Heavenly Emperor Tier.</p><br/><p>The first person who stepped out from the Peerless Sect was none other than the former Sect Master of the Heavenly Demon Sect, who was also the current vice Sect Master of the Peerless Sect — Wu Yunyue.</p><br/><p>Judging from all of the participants who were sent out in the first round, it was obvious that other than the Heaven’s Expanse Palace, the other four Great Saint Lands intended to amaze the others with a show of strength. That was why they sent out all the strong ones from their side.</p><br/><p>According to the rules of the Grand Tournament, after the battle order was decided by drawing lots, whoever lost would lose the eligibility to continue in the tournament. The Saint Land would then have to send another person to replace this person until all ten people from its side lost or achieved final victory. In reality, this kind of battle was still considered relatively fair. Whoever wanted to stay on the battle ring longer would have to exert all their strength during the battle.</p><br/><p>Xue Ao’tian swept a glance over all the five participants of the first round. The rest of the Great Saint Land Lords slowly walked out as well.</p><br/><p>Due to the tournament’s system, those who have a later turn would undoubtedly have more advantages. The people who would be deciding the order of the battle were none other than the Five Great Saint Lords. And the term ‘drawing lots’ actually meant that they had to rely on their own strength. During the last tournament, thanks to Xue Ao’tian’s individual strength, the Heavenly Snow Mountain obtained the last turn in the first round of drawing lots. For this reason, it was able to enter the final battle without many obstacles.</p><br/><p>Xue Ao’tian stretched his palm wide open to show five different colored stones of red, orange, yellow, green and blue respectively.</p><br/><p>“According to the order of the rainbow, the person who gets the red stone <sup>1 </sup>will be the first to enter the battle while the one who gets the blue stone will be the last. Listen to my mark!” As he was speaking, he flicked his right wrist. The five stones in his hand instantly transformed into five different colored lights as they soared up into the sky.</p><br/><p>The five stones gathered together as one as they soared up. Due to Xue Ao’tian’s cultivation base, the five stones had already disappeared in the air in just a blink of an eye.</p><br/><p>All five Great Saint Land Lords, including Zhou Weiqing, exchanged looks. In the next moment, Xue Ao’tian bellowed loudly, “Start!”</p><br/><p>Five figures, each representing the Saint Land Lords of the five strongest Great Saint Lands in the mainland, rose up in the air at once almost at the same time.</p><br/><p>The person who acted first was Huang Xingyun from Love Valley. The air in his surroundings distorted severely as a layer of the distorted film of light appeared in mid-air. He stepped into it. Instantly, everyone felt like their bodies were being compressed and everything around them seemed to slow down.</p><br/><p>However, nobody would fall behind this time around. In accordance with the rules of the Grand Tournament, no legendary armor set was allowed during the process of snatching lots, and a direct attack was not allowed as well. All that they could use was binding techniques that restricted movements.</p><br/><p>A cluster of golden light exploded from Xue Ao’tian’s body without warning His body flashed past and he ascended to the sky as if he did not encounter the time delaying restriction at all. At the same time, a mighty and supreme pressure erupted from him all of a sudden. The golden light was so rich that the entire sky started to change color.</p><br/><p>Heavenly Spirit Divine Territory — this was the Divine Territory that Xue Ao’tian mastered ever since he entered the Heavenly God Tier. The moment he unleashed his Divine Territory, an endless pressure instantly plunged down from the sky. Suddenly, the movements of the Love Valley Lord, Huang Xingyun who had had a slight upper hand earlier, slowed down as Xue Ao’tian continued to rush up to the sky.</p><br/><p>“Heavenly Expanse Infinitum,” Shangguan Tianyang roared loudly as he made a circle with his palms. Milky-colored Heavenly Energy formed a gigantic whirlpool underneath him in the next moment. A horrifying thrust of energy erupted without warning, and it propelled his body forward in pursuit of Xue Ao’tian.</p><br/><p>“Nirvana Heaven Glory,” Fen Tian hissed coldly. A condensed black Light Blade emerged from thin air as a strange scene unfolded in the next second. Instantly, a hole was ruthlessly torn open in Xue Ao’tian’s Heavenly Spirit Divine Territory. In the next second, the space around his body shifted quickly. With just a flash, he overtook Shangguan Tianyang and appeared beside Xue Ao’tian.</p><br/><p>At this moment, Zhou Weiqing was still at the back of the line.</p><br/><p>Huang Xingyun became slightly anxious when he saw that three people had overtaken him. He instantly shouted out loud, “Time Prison”. When it came to binding techniques that limited movements, nobody else present was better than him. After all, the attribute that he controlled was none other than the Time Attribute.</p><br/><p>A series of distorted lights formed a huge cage in the air before it dropped down from the sky. It completely enveloped everyone inside it. That distorted light was as solid as matter. Even though it was greatly weakened within the Heavenly Spirit Divine Territory, its restrictive ability was still very apparent. At the very least, the moment this technique was unleashed, everyone’s speed instantly slowed down. At this moment, the five stones that previously soared high into the air started to drop down.</p><br/><p>“What are all of you fighting for? Aren’t these just a few stones?”</p><br/><p>While the few Great Saint Lords were using their techniques as they struggled with each other, a lazy voice resonated in the air suddenly. The four Great Saint Land Lords, Xue Ao’tian, Shangguan Tianyang, Huang Xingyun and Fen Tian lifted their heads up to have a look. They were completely bewildered when they saw that Zhou Weiqing was already high up in the sky since god knows when. All of the five stones were already in his palms. He was playing with them and juggling them one by one.</p><br/><p>The four Great Saint Land Lords who were rushing upwards were stunned. They had no idea exactly when Zhou Weiqing appeared above them. It was absolutely impossible for them to not notice anything if somebody went past their sides. Yet, they really did not feel anything at all.</p><br/><p>In truth, It was relatively easy for Zhou Weiqing to be the first one to reach. After all, the technique that he used was none other than the Spatial Law. He relied on the Spatial Attribute to beat everyone to the draw.</p><br/><p>There were two ways for Zhou Weiqing to successfully complete his Spatial Travel. One was by using coordinates if he had to travel long distance. The second way was by traveling to a spot where the user could see. The technique was similar to Blink. However, the space ripple that he caused was extremely small when he used his Spatial Travel because of his current cultivation base. Even a Heavenly Emperor would not notice anything if he did not deliberately pay any attention to it.</p><br/><p>Before this, Zhou Weiqing had deliberately fallen a step behind to make the four Great Saint Lords mistakenly think that he was much weaker and had no ways to overtake them so they would not pay him any attention. When they started their fights in the air, Zhou Weiqing used his Spatial Travel to move all the way in front.</p><br/><p>The reason why it could be said that he had used the four Great Saint Land Lords’ conventional thinking to his advantage was because none of the Saint Land Lords were particularly skilled in the Spatial Attribute, let alone being able to master the Spatial Law before the Peerless Sect became a Saint Land.</p><br/><p>For this reason, the moment the four Saint Land Lords saw Zhou Weiqing hovering in mid-air with the five stones in his hand, the first thought that appeared in their minds was, ‘How is this possible?’</p><br/><p>However, the truth was displayed right before their eyes. No matter how Zhou Weiqing did it, it was a fact that he had already obtained the stones in his hand. According to the rules of the Grand Tournament, no direct attacks were allowed when drawing lots. This meant that there was absolutely no way for them to snatch the stones off his hands.</p><br/><p>Before the four Great Saint Land Lords could even snap out of their bewilderment, Zhou Weiqing waved his right hand and bellowed, “There, here you go! Catch ’em properly, will you?” Four lights appeared and blasted towards the four great Saint Land Lords at the same time.</p><br/><p>With Zhou Weiqing’s current cultivation base, coupled with the short distance between them, the four stones had already appeared in front of the four of them before he even finished waving his hand. The four Great Saint Land Lords raised their hand instinctively and each caught the stone in front of them.</p><br/><p>The moment he saw the stone in his hand, Huang Xingyun from Love Valley almost fainted in anger. The stone that he was holding in his hands was none other than the red-colored stone. What it meant was Love Valley would be the first to enter the battle ring in the upcoming tournament. Fen Tian’s face was equally grim as well. The stone that he received was the orange-colored one. In other words, the first round of this continuous battle would see the Blood Red Hell and Love Valley clashing with each other.</p><br/><p>The stone that Xue Ao’tian received was yellow so the Heavenly Snow Mountain would be the third to step into the ring. Shangguan Tianyang, on the other hand, looked at the green stone in his hands with a smile on his face before he nodded towards Zhou Weiqing who was still hovering in mid-air. Shangguan Tianyang seemed to be satisfied with the order of the battle. He suddenly found this brat, who had snatched his three nieces, not as annoying as he used to be.</p><br/><p>Xue Ao’tian had a calm look on his face. It was as if he had long known Zhou Weiqing would do this.</p><br/><p>Of course, Zhou Weiqing had his intentions doing this. The Heavenly Snow Mountain and Heaven’s Expanse Palace were on equally intimate terms with him, and it did not matter who appeared last. However, since the Heaven’s Expanse Palace’s first participant was only a Heavenly King-tier powerhouse, it would not be good for them to step into the battle ring early. As the rule stated, whichever Saint Land that lost the battle would have to send out a second participant to queue up behind the battle line. Naturally, this meant that it would be better the longer one could hold on in the ring.</p><br/><p>With a mocking smile, Zhou Weiqing landed on the ground while holding a blue stone that represented he had the last turn in the battle. A triumphant and proud look could be seen on his face. He did not even bother to hide the emotions in his heart.</p><br/><p>Earlier, when the Peerless Sect had just arrived, most of the people present looked down on them and wanted to see them make a fool out of themselves. However, after Ling Dang’s performance and the way Zhou Weiqing’s snatched the lots, nobody else dared to look down on them anymore. After all, the Peerless Sect had taken in Heavenly Demon Sect’s remaining members. Moreover, there was also the existence of the Six Ultimate Heavenly Emperor as well as Ling Dang whose cultivation base nobody could see through. However, the most important thing was, they also could not figure out Zhou Weiqing’s cultivation base.</p><br/><p>After the rest of the Great Saint Land Lords touched the ground, their respective subordinates immediately filled them in on how Zhou Weiqing had seized the stones earlier. All of the people present on the scene were strong powerhouses who were at the very top of their own field. There was no doubt that they could quickly make out that Zhou Weiqing had already mastered the Spatial Law. This was an ability that only Heavenly God-tier powerhouses could master under normal circumstances. However, Zhou Weiqing was only so young! Could it be that he really had become a Heavenly God?</p><br/><p>Everyone found this hard to digest. That included Xue Ao’tian and Shangguan Tianyang as well. However, even if he was not a Heavenly God yet, just the fact that he had mastered the Spatial Law made him very difficult to deal with.</p><br/><p>Xue Ao’tian announced in a deep voice, “Now that the draw is over. Let us start the battle according to our order.”</p><br/><p>In the Grand Tournament of Saint Lands, the average age of the participants was mostly more than 70 years old. Coupled with the fact that every Saint Land was already familiar with the rules of the tournament, there was no need for anyone to preside over the battles anymore.</p><br/><p>The skinny and tall powerhouse from the Blood Red Prison and Yun Ruoyun from Love Valley walked out slowly to the center of the field.</p><br/><p>On the other hand, Zhou Weiqing chuckled as he walked back to his team. Long Shiya was chuckling as well as he glanced at his beloved apprentice while Little Witch gave a thumbs-up to Zhou Weiqing. However, the other four girls had an unhappy look on their face. Shangguan Bing’er was still relatively normal but Shangguan Xue’er, Tian’er, and Shangguan Fei’er seemed to be angry about something. They refused to acknowledge him at all.</p><br/><p>At this moment, the battle in the field had just begun. The two figures simultaneously leaped up into the sky like two arrows that were shot upwards. Everybody looked up in the air at once.</p><br/><p>All of the Grand Tournament battles in the previous years always took place in the air. That was why every Saint Land would usually only bring powerhouses whose cultivation base were at the Heavenly King Tier and above. If the venue were to take place on the ground, only God knew how big of a disaster the powerhouses would cause with their destructive power. Due to this reason, it was much safer for the venue to be in the air. Even so, their battles could only start after they climbed up several thousand meters in the air.</p><br/><p>Several thousand meters high up in the air away from the ground. Even a Heavenly King-tier powerhouse would most likely be unable to see the situation that was taking place. In just a few seconds, strong clashing sounds resonated in the air. A loud rumbling sound continued to erupt non stop. Every time there was an explosion, the entire world would simultaneously shake.</p><br/><p>Bloodcurdling energy ripples continued to fluctuate in the air.</p><br/><p>A Heavenly King-tier powerhouse might not be able to see what was going on but that might not be the case for a Heavenly Emperor-tier powerhouse. Coupled with the particularly good weather today, what Zhou Weiqing saw in mid-air when he lifted his head up high was a battle that was well-matched in strength.</p><br/><p>That was right. A neck-to-neck battle. As one half of the Love Valley Lords duo, Yun Ruoyun’s strength was undoubtedly powerful. Her opponent was equally as sturdy as well. The moment the battle started, the Heavenly Emperor-tier powerhouse from Blood Red Hell did not hesitate to use his Destruction Attribute.</p><br/><p>Before he used the Destruction Attribute, it was obvious that his cultivation base was far inferior to Yun Ruoyun who was already at the Maximum Level of the Heavenly Emperor Tier. However, the moment he unleashed his Destruction Attribute, it immediately snatched away the upper hand that Yun Ruoyun gained from her Time Attribute. To everyone’s surprise, after a series of clashes, Yun Ruoyun was the one who started to fall behind. The rich Destruction Attribute aura in the air made it hard for the Lord of Love Valley to take the blows. She was instantly placed at a great disadvantage.</p><br/><p>A hint of pride could be seen on Fen Tian’s face as he watched the battle that was taking place. However, Xue Ao’tian remained emotionless. Huang Xingyun from Love Valley, on the other hand, looked completely uneasy and anxious. He and his wife were the strongest in Love Valley. If Yun Ruoyun could not even last through the first round, he would have to send a second participant to join in the back of the line of the continuous battle. This would no doubt be unfavorable to Love Valley. On top of that, the power that was being demonstrated by the Blood Red Hell was absolutely alarming.</p><br/><p>The look on Shangguan Tianyang was the most obvious. At this moment, he looked extremely grim, and it was certainly not a facade that he was putting on. He knew Blood Red Hell very well but he had never seen this man that Fen Tian had sent out. This Heavenly Emperor-tier powerhouse had a cultivation base that was far beyond his imagination. Even though Shangguan Tianyang was certain that he could win against this man, what would happen if there were still many powerhouses of this level on Fen Tian’s side? Would the Heaven’s Expanse Palace be able to defend their position as the best Saint Land in the world this time?</p><br/><p>There was no doubt that the Heavenly Jewel Masters who were able to participate in the Grand Tournament of Saint Lands had at least eight pieces of the legendary armor set. This was also the case for the two fighting in the air. They were both wearing a nine-piece set at the moment.</p><br/><p>“I give up,” Yun Ruoyun’s unwilling voice reverberated from above. Afterward, the two figures immediately descended from above.</p><br/><p>In the Grand Tournament, once the battle had started, the battle would continue to go on until one of them was dead unless one of the party decided to surrender.</p><br/><p>Yun Ruoyun appeared disheveled. Dozens of black marks could be seen on her legendary armor set. Those were left by the Destruction attribute. Even her hair seemed to be tousled from the fight. Her breathing was irregular, and there was a pained look on her face.</p><br/><p>On the other hand, the skinny and tall powerhouse from the Blood Red Hell had a haughty look on his face. He did not even utter a word as he placed both his hands behind him. It looked like he was completely looking down on Love Valley.</p><br/><p>Fen Tian burst out laughing and turned to Huang Xingyun, “Valley Lord Huang, looks like Love Valley will never be ranked ahead of us Blood Red Hell anymore!”</p><br/><p>Huang Xingyun snorted in disdain, “The battle has only just begun. I’m afraid it’s still too early to say those words, you know.”</p><br/><p>He waved as he said that. A Heavenly Emperor-tier powerhouse immediately walked out from behind him to join the end of the waiting line.</p><br/><p>In accordance with the draw, the person joining in the battle ring next would be the Heavenly Snow Mountain’s representative — the Tiger King, Xue Aoying. There was no resting time between the battles in the Grand Tournament of Saint Lands. Otherwise, wouldn’t one mighty powerhouse be more than enough to last until the very final round?</p><br/><p>This kind of ‘simultaneous exhibition’ battle tactic would at least weaken those individuals with high cultivation base.</p><br/><p>“After you!” Xue Ao’ying roared loudly as a series of intense white light erupted from his body. There were dozens of black lines that were intertwined with the white lights. He soared into the sky like a giant tiger with another loud roar.</p><br/><p>That Blood Red Hell elder once again rose up to the sky. In a flash, he had already climbed up to several thousands of meters high.</p><br/><p>Similar to when the Grand Tournament had first commenced, the atmosphere at the summit of the Heavenly Snow Mountain became very tense. Moreover, the rhythm of the battle was absolutely too fast to understand. Additionally, all of the participants were such strong powerhouses! From the two battles that had just taken place since the tournament started, the participants were all Heavenly Emperor-tier powerhouses. Every Saint Land was trying to overwhelm their opponent in terms of strength. Due to this reason, all of the participants that were sent out were all very strong. However, somehow it seemed like the Saint Land Lords had no intention to join in the battle at all.</p><br/><p>The armor that the Blood Red Hell Heavenly Emperor was wearing was a crimson-colored one that had no weapon. However, the armor covered his entire body completely. As his silhouette flickered in the air, a series of red images could be seen flashing across the sky.</p><br/><p>The legendary armor set that the Tiger King Xue Aoying wore was much more dazzling in comparison. A snowy white armor covered his entire body. The snowy white color was decorated with streaks of blue lines with a tiger head on both of his shoulders. A weapon could be seen in his hands. His two tiger palms appeared to be particularly large, and one could see traces of the air being torn around the palms’ surroundings.</p><br/><p>As the younger blood brother of the Mountain Lord of Heavenly Snow Mountain Xue Ao’tian, one could easily imagine just how powerful Xue Aoying was. On top of that, the combat ability of the powerhouses in Wan Shou Empire was usually cultivated since they were very young. As the two of them rose up to a certain height, the Tiger King immediately launched his attack without any hesitation.</p><ol><li data-annotation-id=\"6b635c54-96d3-8253-b188-16e2acecdd3a\">Mr. Author wrote ‘orange’ but I think that he’s made a mistake as ‘red’ should be the first color of the rainbow</li></ol><br/>\n</div>"}