{"title": "Chapter 802", "id": 802, "volume": 9, "url": "http://boxnovel.org/heavenly-jewel-change-chapter-802", "volume_title": "Volume 9", "body": "<h1>Chapter 802</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Perhaps it was because he had been living on the Heavenly Snow Mountain for some time now that Gu Site’s old lion’s temper had tamed down a lot. However, there was something peculiar in the glances that he occasionally cast at Tian’er.</p><br/><p>Xue Ao’tian asked nonchalantly, “Is everything settled?”</p><br/><p>“Yes, Mountain Lord. We’ve already evacuated all of the Heavenly Beasts in the Wan Shou Empire to the outskirts, and the Beastmaster Armies are stationed at the mountain foot, waiting to be dispatched at any time. The Lion King has already gone uphill, and all of the powerhouses at Heavenly King Tier and above from every tribe have all gathered. There’s a total of two Heavenly Emperors and twenty-one Heavenly Kings.</p><br/><p>Xue Ao’tian nodded his head, “Alright. Pass my order down. From now on, nobody is allowed to act on their own without authorization. No exploration is allowed either.”</p><br/><p>“Yes,” Gu Site replied respectfully. He did not question Xue Ao’tian’s command and left directly after he replied.</p><br/><p>A cold look flashed across Xue Ao’tian’s face, “Come on! I want to see how big of a storm all of you can stir up on the Heavenly Snow Mountain!”</p><br/><p>The Heavenly Snow Mountain was actually ranked very far behind among all the Saint Lands before Xue Ao’tian built it up. During that period of time, its position was even worse than the Heavenly Demon Sect. However, the Heavenly Snow Mountain had the Wan Shou Empire as their foundation, unlike the Heavenly Demon Sect. Even if the Heaven’s Expanse Palace had always been powerful and influential, they did not dare to back the Heavenly Snow Mountain into a tight corner.</p><br/><p>Due to Xue Ao’tian’s rising influence, the Heavenly Snow Mountain began to rise rapidly in its rank the moment this Heavenly God-tier powerhouse appeared. However, it was still slightly lower than the Heaven’s Expanse Palace. This could be seen clearly from the number of powerhouses that they had in hand right now. With only two Heavenly Emperor-tier cultivators, this number was probably only slightly better than the Heavenly Demon Sect. Had it not been for Xue Ao’tian, one could easily imagine what the Heavenly Snow Mountain’s position would be like on the mainland. Of course, the Heavenly Snow Mountain also had its own virtues.</p><br/><p>Things were beginning to turn turbulent in the Wan Shou Empire. All kinds of powerhouses from every corner of the world were making their way towards the same destination. The battle that would determine the status quo and even the safety of the mainland was about to begin.</p><br/><p>Three days passed in just a blink of an eye.</p><br/><p>The Heavenly Snow Mountain was usually covered with mist and fog on most days due to the extremely high altitude. However, it was somewhat special today. Somehow, the sky was blue and clear. Not even a cloud was in sight. The air surrounding the Heavenly Snow Mountain seemed very pure, and the merciless sunlight raised the Heavenly Snow Mountain’s temperature way higher than usual.</p><br/><p>Summit Platform — the true entrance to the Heavenly Snow Mountain Saint Land. 20 young disciples were standing in a row on two sides. The newly appointed Lion King, Gu Yingbing and the Tiger King, Xue Ao’ying were both standing at the innermost region. Today, the both of them were responsible for welcoming the guests.</p><br/><p>The Tiger King, Xue Aoying appeared to be very calm but Gu Yingbing seemed a little excited. He had always been a man whose courage would mount as the battle progressed. His pride had received a big blow when he lost to Zhou Weiqing. However, the blow became the driving force behind all his hard work. In only two years, under Xue Ao’tian’s constant guidance, he had already broken through to the Heavenly King Tier and became the youngest Heavenly King-tier powerhouse in the history of the Wan Shou Empire.</p><br/><p>Although Gu Yingbing did not know how this year’s Grand Tournament of Saint Lands was going to unfold, he had a premonition the moment he saw Tian’er’s return. He knew that he would see Zhou Weiqing once again in the Grand Tournament that would be held in the Heavenly Snow Mountain.</p><br/><p>The moment he thought of Zhou Weiqing, he could not help but clenched his fists tightly. Now that he was already in the Heavenly King Tier, he had long made up his mind that he would challenge Zhou Weiqing again the next time he laid eyes on him. Even if it was not for Tian’er’s sake, he would have to fight for his own honor.</p><br/><p>Unfortunately, he did not know that ‘the youngest Heavenly King in Wan Shou Empire’ title had already been taken away by Tian’er not long ago.</p><br/><p>The sun had already risen high in the sky. The Tiger King, Xue Aoying, finally made his move as he said in a deep voice, “They’re coming. Let us welcome them!” Having said that, he strode forward and walked towards the mountain entrance with Gu Yingbing by his side.</p><br/><p>The roads on Heavenly Snow Mountain were extremely steep. One would definitely feel dizzy if one looked down from the top. Gu Yingbing could clearly see that a group of yellow-clad figures was rapidly climbing up the mountain at an extremely fast pace. From a rough glance, it could be seen that there were at least several dozen people making their way towards them.</p><br/><p>Soon enough, the yellow figures approached the top of the mountain.</p><br/><p>Xue Aoying laughed out loudly, “Your elegance is still as graceful as before, Valley Lord Huang. Welcome to the Heavenly Snow Mountain.”</p><br/><p>A group of yellow figures flickered pass as many yellow-clad powerhouses rose up to the sky before landing in front of Xue Aoying and Gu Yingbing.</p><br/><p>The two people who stood before them was a man and a woman. They both appeared to be in their thirties. The man was tall and slender with dashing eyebrows and fiery eyes. The surrounding air behind him was slightly distorted. It was a result of the Time Attribute, not the Fire Attribute. The woman beside him looked very delicate and gentle. Standing half a foot behind the man, her eyes were filled with extreme tenderness. One could easily tell that they were husband and wife and were a sweet and loving couple.</p><br/><p>However, if one were to pay closer attention, one could see the vicissitudes of life deep in their eyes. It was apparent that their appearance did not match their true age.</p><br/><p>“Tiger King, you’re still as hale and hearty as before. This must be Yingbing, right? I heard that you’ve inherited the position of the Lion King. Congratulations to you!” The man said with a smile on his face. His tone was mild, and his voice was clear and warm. It was very pleasing to the ears.</p><br/><p>Gu Yingbing was also looking at the newly arrived guests from top to bottom. He knew that the couple standing before him was none other than the Valley Lords of Love Valley, Huang Xingyun, and Yun Ruoyun. As the ruler of one of the major Saint Land, one could easily imagine just how powerful their strength was. He had seen them both previously in the last Grand Tournament of Saint Lands. At that time, the Demonic Emperor, Wu Yueyun, was defeated by their hands. This couple would always team up and launch an attack together. This was also the tradition of Love Valley.</p><br/><p>“Good morning, Valley Lord Huang, Valley Lord Yun,” Gu Yingbing bowed slightly to the both of them. His position was different now. He was now the tribe leader of the Heavenly Divine Earth Spirit Lion Tribe, and he was also the King of the Wan Shou Empire. His identity did not allow him to be too courteous towards them.</p><br/><p>Standing behind Huang Xingyun and Yun Ruoyun was a total of 36 people who came from the Love Valley. All of them were at least Heavenly King-tier powerhouses and above. The reason they climbed up instead of flying up earlier was out of respect for the Heavenly Snow Mountain. This was also an unwritten rule in the Grand Tournament of Saint Lands.</p><br/><p>The thing that grabbed Gu Yingbing’s attention in particular was the couple that followed closely behind Huang Xingyun and Yun Ruoyun. Both of them appeared to be in their forties. However, their auras seemed to be too complex for Gu Yingbing to fathom. Gu Yingbing still could not see through them with his Heavenly King-tier cultivation base. The couple obviously had a cultivation base at the Heavenly Emperor Tier. Along with the Huang Xingyun and his partner, all of them added up would total to six Heavenly Emperor-tier powerhouses.</p><br/><p>Six Heavenly Emperors and 30 Heavenly Kings. It seemed like the Love Valley was going all out this time. The Heavenly Snow Mountain would never be able to compete with them in terms of overall strength if Xue Ao’tian’s presence was not taken into consideration. After all, Love Valley had always had strong combat abilities. They excelled the most in couple joint battles and using Time attribute from the Saint attributes. During the last Grand Tournament of Saint Lands, Love Valley came out third, ranking above the Blood Red Hell.</p><br/>\n</div>"}