{"title": "Chapter 819", "id": 819, "volume": 9, "url": "http://boxnovel.org/heavenly-jewel-change-chapter-819", "volume_title": "Volume 9", "body": "<h1>Chapter 819</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Fen Tian slightly narrowed his eyes slightly and looked at Zhou Weiqing without hiding his hatred towards him at all, “You bastard! Destroying my plan again. It seems like I must kill you as soon as I can.”</p><br/><p>Zhou Weiqing shrugged and said, “Come at me!” His voice was calm but his expression was provocative.</p><br/><p>However, Fen Tian chose to ignore him at that moment as he turned to Xue Ao’tian who was next to him, “Brother Xue, I’ll keep my word. As long as you’re willing to seal off the Heavenly Snow Mountain, I can even promise you that no harm will come to the Wan Shou Empire. We’ll be allies from today onwards. I’m even willing to share the Destruction Attribute with you. What do you think?”</p><br/><p>Xue Ao’tian looked at him and calmly said, “Fen Tian, have you run out of ideas?”</p><br/><p>Fen Tian sighed and said, “Looks like I’m right. Be it you or Shangguan Tianyang, it seems that all of you have ganged up with that kid.”</p><br/><p>Xue Ao’tian said in a composed manner, “He’s my son-in-law. I only have one daughter and you’re trying to kill him. What do you think I should do? Moreover, I’ve always been disinclined to obey the words of others ever since the Heavenly Snow Mountain was established. Even if you’re at the Maximum Level of the Heavenly God Tier, I’m not going to obey you. There may be a crushed Heavenly Snow Mountain but never a Heavenly Snow Mountain that exists without dignity.”</p><br/><p>Suddenly, Fen Tian smiled. At that moment, his smile was rather odd. The dark purple flames around his body did not become stronger. It seemed like he did not have the intention to attack.</p><br/><p>“If that’s the case, I’ll have to add some weight to this. Brother Xue, since you’re destined to fail, why not back off? Brother Huang, let’s show them your ability. They’ve figured out our relationship since the beginning. What’s the point of hiding it?”</p><br/><p>Huang Xingyun, who was leading the Love Valley’s powerhouses, had been standing at the side silently all this while. He frowned when he heard what Fen Tian said. He brought his wife Yun Ruoyun and walked to Fen Tian’s side. Both Huang Xingyun and Fen Tian were not idiots. The lineup of the Heavenly Expanse Palace and Heavenly Snow Mountain in the tournament, the continuous surrenders by the both of them later in the tournament, and the Peerless Sect targeting Love Valley and Blood Red Hell. It was obvious which side was being picked. (Obvious that peerless sect was against Love Valley and Blood Red Hell)</p><br/><p>As Huang Xingyun and his wife walked out, the powerhouses from Love Valley also teamed up with Blood Red Hell. Their bodies gave off the same black glow. It was the Destruction Attribute. Huang Xingyun looked at Xue Ao’tian and Shangguang Tianyang and said in a deep voice, “I find it strange. I’d like to know how all of you figured out the relationship between Love Valley and the Blood Red Hell. I thought our act was flawless.”</p><br/><p>Xue Ao’tian expression seemed alright but Shangguan Tianyang’s expression was extremely terrible. Love Valley had always been a firm ally of the Heavenly Expanse Palace after all. He could easily imagine the consequences if they did not see through Love Valley’s act before the end of the tournament or before the Blood Red Hell turned against them. Huang Xingyun and his followers would have dealt them the deadliest attack.</p><br/><p>“Little Brother Huang, why? Are our years as allies so unsteady?” Shangguan Tianyang could not help but ask.</p><br/><p>Huang Xingyun then said calmly, ” The alliance that you speak of is just Love Valley trailing behind your Heavenly Expanse Palace. We fought the Heavenly Snow Mountain because it was beneficial to us. Shangguan Tianyang, don’t you know that in this world, there are only ones that seek endless benefits, but never ones that will be an ally forever? The Destruction Attribute brought much power to us. We no longer have to be suppressed by you. My Blancpain Empire would even be given a huge piece of Zhongtian Empire’s land. There’s no reason for me not to collaborate with the Blood Red Hell. On the mainland, we’ve already owned the Dandun Empire and Bai Da Empire. Initially, the lands of Geritimo Empire and Blancpain Empire covered a third of the mainland. After the Grand Tournament of Saint Lands ends, without the support from all the Saint Lands, the entire mainland will be ruled by us. That’s the most important to me.”</p><br/><p>“This will only benefit a small number of people. Shangguan Tianyang, do you dare to say that you won’t be persuaded if someone is willing to provide you with Destruction Attribute so you can break through to the Heavenly God Tier and give your Heavenly Expanse Palace the opportunity to rule the entire mainland? Although we’re enemies now, there’s no difference between us when it comes to human nature.”</p><br/><p>Before Shangguan Tianyang could speak, Zhou Weiqing took the opportunity to ask first, “I’m curious. The Destruction Attribute couldn’t have appeared out of thin air. The people who gave you the Destruction Attribute, what intention do they have exactly? You’re right. Perhaps what benefits you is the most important in this world but there’s no such thing as a free lunch. All of you must have sacrificed something to gain this.”</p><br/><p>Huang Xingyun looked at Zhou Weiqing and said coldly, “Those that were sacrificed were the lives of people from other countries. The mainland is overpopulated and our master requires the resentment from the people at the time of death.”</p><br/><p>“What did you say?” Zhou Weiqing could not help exclaiming.</p><br/><p>Huang Xingyun said casually, “What’s so surprising about that? I have nothing to hide from all of you. If all of you don’t obey, you’ll all die here today. We, Heavenly Jewel Masters, are precious. The death of those ordinary people is just like the death of ants.”</p><br/><p>Shangguan Tianyang’s expression was so somber that it looked like water was about to drip from his face, “So all of you are collaborating to destroy the Geritimo Empire and to kill millions of people?”</p><br/><p>Huang Xingyun said calmly, “This is just the beginning. After all, we can’t kill too many people in a single place or the place would be dead. It’ll be disadvantageous to us when we rule in the future. However, your Zhongtian Empire is a different case because the land is vast and highly populated.”</p><br/><p>“You… you lunatic.” Shangguan Tianyang could not help but condemn out loud. Although Huang Xingyun did not say it directly, how could they not understand what he actually meant?</p><br/><p>Huang Xingyun smiled. His smile was calm. If one was to describe Fen Tian’s character as ruthless, then Huang Xingyun could be described as sinister.</p><br/><p>Shangguan Tianyang narrowed both his eyes, “Huang Xingyun, perhaps what you said is right. I might be persuaded with such an abundance of benefits but I’m different from you. I’m a human, not an animal. I still have the ethics of a human, but it seems you don’t anymore. In my eyes, even the filthiest Heavenly Beast is a thousand times cleaner than you.”</p><br/><p>“Are you trying to rile me up?” Huang Xingyun suddenly turned serious but he was not riled up from what was said. “I’ve already told you everything you wanted to know but you still haven’t answered my question. We have darkness and light from the Love Valley and Blood Red Hell. I thought we hid it really well. How did all of you find out?”</p><br/><p>Shangguan Tianyang took a deep breath to calm his agitated emotion before he looked at Zhou Weiqing, “You’ll need to ask him that. I didn’t believe it when Weiqing first told me about the possibility that the Blood Red Hell are working together with Love Valley. However, I began to believe it when I saw all of your performance on the Heavenly Snow Mountain. I never expected that I would not be able to see who you are after all these years. You have indeed concealed yourself deeply.”</p><br/><p>Huang Xingyun did not seem to be bothered by Shangguan Tianyang’s sarcasm as he looked at Zhou Weiqing curiously, “So how did you manage to find out?”</p><br/><p>Zhou Weiqing said calmly, “Do you remember? Around half a year ago, I think you sent someone to the Elf Tribe’s Sealed Land to kidnap the Elven Princess.”</p><br/><p>Huang Xingyun’s facial expression shifted. Although he tried his best to hide it, it was impossible to hide the surprise within the depth of his eyes.</p><br/><p>“I don’t understand what you’re trying to say.”</p><br/><p>Zhou Weiqing smiled coldly, “Do you really not know? Have you not been harboring the intention of constraining the Elf Tribe for a long time now? Otherwise, it’s impossible for the powerhouse that you sent there to enter the Elf Tribe’s Sealed Land with just some unique relic. Too bad his luck wasn’t good. I arrived at the Elf Tribe’s Sealed Land on the same day coincidentally. He even blamed me for what he did. When I caught up with him after chasing him, I found out that he was using the Time Attribute. At the moment before his death, he used Destruction Attribute when he was in a panic. You don’t need me to tell you how rare the Time Attribute is. Apart from me, I’ve never heard of anyone possessing the Time Attribute outside of Love Valley. How could I not suspect anything when the Time and Destruction Attributes appeared on the person at the same time? There’s a saying that goes ‘it’s better to believe that something exists than not’. I didn’t expect that the righteous Love Valley couldn’t resist the temptation of the Destruction Attribute. All of you know that the end of the Destruction Attribute is self-destruction. Even your master won’t be able to run away from this fate even if he ruled the entire world.”</p><br/><p>Fen Tian glared at Huang Xingyin with anger in his eyes. Huang Xingyun had never told him that the Love Valley had the information about the Elf Tribe’s Sealed Land. It was obvious that Huang Xingyun wanted to enjoy the advantage on his own.</p><br/><p>“Such trash.” There was coldness sparkling in Huang Xingyun’s eyes, “I thought that trash died in the hands of the Elf Tribe, I didn’t know he died in yours. A wise man would sometimes make mistakes.”</p><br/><p>If there were no hiccups, the Blood Red Hell and Love Valley would simultaneously attack with their darkness and light. They would only have to pay a small price to attain victory. The most important reason why Blood Red Hell and Love Valley decided to lay a trap here was because they did not want to lose too many people here. Other countries aside, the Zhongtian Empire and Wan Shou Empire were both tough empires. It would be much more difficult for them to rule the entire world if these two Saint Lands suffered severe losses. Therefore, all of their plans revolved around the principle of paying the smallest price to win the Grand Tournament of Saint Lands.</p><br/><p>Huang Xingyun said coldly,” All of you have witnessed Fen Tian’s ability. Since the story has developed to this point, then we’ll have to fight with our abilities. If you don’t accept our suggestion of proclaiming this Saint Land as ours, all of you will stay here today.”</p><br/><p>Xue Ao’tian glared madly with his eyes wide opened, “Huang Xingyun, Fen Tian, the both of you seemed to have forgotten that this is our Heavenly Snow Mountain.”</p><br/><p>Huang Xingyun glared at Xue Ao’tian, “I’ve sacrificed so much for the Destructive Energy, how can I not gain anything? I didn’t forget. This is indeed your Heavenly Snow Mountain, so what? With what ability are you going to struggle against the absolute ability that we possess?”</p><br/><p>A layer of distorted, dark-purple light appeared on Huang Xingyun’s body suddenly. It was not just him. Yin Ruoyun who was next to him had the same layer of dark purple light appearing on her body as well. The terrifying suppressive aura rose immediately as the dark purple light pillars shot into the sky under the slight distortion.</p><br/><p>The area that was created by Zhou Weiqing’s Astral Divine Territory that initially drove away the Destructive Divine Territory atop the Heavenly Snow Mountain was currently locked, clashing intensely with the dark purple light.</p><br/><p>Zhou Weiqing staggered three steps backward. He could bare stand straight as he scoffed. His face suddenly paled as the two dark purple light pillars broke through the constraint of the Astral Divine Territory and integrated with Fen Tian’s Destructive Divine Territory.</p><br/><p>The black color in the sky started to change. It had changed to an odd dark purple color. A terrifying and immense pressure caused Zhou Weiqing’s Astral Divine Territory to shrink rapidly. In just a few breaths, it was suppressed to the point where it could only maintain a space with a diameter that was less than 30 square meters. It only covered a portion of the Peerless Sect’s powerhouses.</p><br/><p>Meanwhile, the people of Heavenly Snow Mountain and the Heavenly Expanse Palace had lost the protection of the Astral Divine Territory. Suddenly, the suffocating pressure appeared once again. Moreover, the pressure this time was even more petrifying. It was just a suppressive aura, not even a physical attack. They could see clearly that the snow that accumulated on top of the Heavenly Snow Mountain all year along was melting at an alarming speed, and it was disappearing. In a just a while, the head of the rock mountain was revealed. Not even a drop of water could be seen.</p><br/><p>The Destructive Divine Territory. It was the Destructive Divine Territory again. The difference was the attributes that were mixed with Huang Xingyun and Yun Ruoyun’s Destructive Divine Territory. It was not the Fire Attribute but was the Time Attribute instead. Put simply, their Destructive Divine Territory was even more powerful than Fen Tian’s Divine Territory. However, their cultivation base was slightly inferior to Fen Tian. Even so, within a short period of time, the powerhouses on top of the Heavenly Snow Mountain could tell that this couple who controlled Love Valley had the cultivation base of an Upper-Level Heavenly God.</p><br/><p>Whether it was the powerhouses from the Heavenly Snow Mountain or the Heavenly Expanse Palace, none of them, including Xue Ao’tian and Shangguan Tianyang, had a change in their expressions. To compare their total headcount, the people from Blood Red Hell and Love Valley combined were still slightly lesser than the people from the Heavenly Snow Mountain and the Peerless Sect combined. The difference was not much. However, at this moment, they already displayed four Heavenly God-tier powerhouses!</p><br/><p>A Maximum Level Heavenly God, two Heavenly Gods, and a Lower Level Heavenly God. They had four Heavenly God-tier powerhouses. What kind of ability was that?</p><br/><p>At that moment, Xue Ao’tian was the one who had the most complicated feelings. Throughout these years, he had been named the world’s first powerhouse. He was the only Heavenly God-tier powerhouse in the Five Great Saint Lands.</p><br/><p>However, five Heavenly Gods appeared at once in the Grand Tournament of Saint Lands. Five of them! Which one of the Heavenly God-tier powerhouses did not possess the ability to destroy the heavens and earth? The distance between a Heavenly Emperor and a Heavenly God was equivalent to the distance between an emperor and a God. Both could not be theoretically calculated. Moreover, three among the five had a higher cultivation base in the Heavenly God Tier than him. Could he really emerge victoriously in this battle?</p><br/><p>Fen Tian walked forward slowly and stood next to Huang Xingyun, “All of you don’t have much of a choice. Choose whether you want to seal this place up or death. Give me an answer.”</p><br/><p>His words were directed at the Heavenly Snow Mountain and Heavenly Expanse Palace. It did not matter if it was Fen Tian or Huang Xinyun, both of them had made their decision. They had to destroy the Peerless Sect today no matter what. The Saint Energy that Zhou Weiqing possessed was the only thing that could go against them.</p><br/><p>Shangguan Tianyang took a step forward slowly as a layer of blurry mist was released from his body. Within the dreamy mist, pieces of armor appeared silently on his body. It was the Boundless Infinitum Set. He was not the only one who was putting on a legendary armor set. Everyone’s body from the Heavenly Expanse Palace lit up. The faint mist released from their bodies floated into the air slowly and formed a blurry cover of light that enveloped all of them within it.</p><br/><p>Apart from the two brothers Shangguan Tianyang and Tianyue, although everyone who came from the Heavenly Expanse Palace these time were only Heavenly King-tier powerhouses, the power the released by the legendary armor sets of the 108 Heavenly King-tier powerhouses was shocking. They could not break the Destructive Divine Territory but they managed to block the suppressive effects of the Destructive Divine Territory. The combined strength saved them from being continually eroded.</p><br/><p>Seeing that the people of the Heavenly Expanse Palace were putting on their legendary sets, Fen Tian and Huang Xingyun’s pupils slightly shrank. They could see that all 108 Heavenly Kings from the Heavenly Expanse Palace had nine-piece legendary armor sets with them. A nine-piece set! What sorcery was that? That said, it was like everyone who was wearing a nine-piece set was on the same level as Long Shiya!</p><br/><p>No matter how fast the development that Blood Red Hell and Love Valley managed to achieve with the help of the Destruction Attribute, they would not be able to bring out so many legendary armor sets even if they combined both their Saint Lands together. That was the main reason why Fen Tian and Huang Xingyun had not been forcing the Heavenly Expanse Palace and Heavenly Snow Mountain too much. That was a relic. A relic from the Saint Land that existed a thousand years ago. Who would be able to compare with the Heavenly Expanse Palace in terms of financial capability?</p><br/><p>Shangguan Tianyang looked at Fen Tian and Huang Xingyun closely, “My Heavenly Expanse Palace’s 108 Heaven and Earth Heavenly Expanse Infinitum Formation has not appeared on the mainland for at least 400 years. Sealing up the Heavenly Expanse Palace is just a way to stall for time. We’re just targets that you’ll kill, it’s just a matter of time.Furthermore, how could the Heavenly Expanse Palace shy away? Today, the Heavenly Expanse Palace will fight to its death but not the people of Zhongtian who had compromised and lived without dignity.”</p><br/><p>Everything he said was as tough as nails that could be hammered into steel. Each and every one of his words was tough. The smile from the Palace Master of the Heavenly Expanse Palace had disappeared completely. The eleventh piece of the set appeared on his body, and a dazzling and bright glow that was similar to diamonds radiated from his body as well. It was the Boundless Infinitum Set. The No.1 legendary armor set in the world.</p><br/><p>When the Boundless Infinitum Set was completed, it looked like a layer of crystal was covering Shangguan Tianyang’s body. In this layer of crystal, there was faint layer of cloudy of white smoke flowing continuously. The boundless smoke felt like it was filled with the consolidation of all attributes. This was the reason why the boundless smoke could break the suppression of the Destructive Divine Territory. It was a god set.</p><br/>\n</div>"}