{"title": "Chapter 817", "id": 817, "volume": 9, "url": "http://boxnovel.org/heavenly-jewel-change-chapter-817", "volume_title": "Volume 9", "body": "<h1>Chapter 817</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>The look in Zhou Weiqing’s eyes started to change at once. The changes were consistent with Shen Bu’s look as well. His gaze suddenly turned gentle, then it was pitiful, worried and finally, he looked like he was in pain. The hammer in his right hand was passed to his left hand as well. It seemed like he could no longer wait. With just a leap, he descended from the sky and rushed towards Shen Bu with his right arm wide open.</p><br/><p>Shen Bu remained calm. However, the look on her face immediately turned to excitement and one of longing. Shyness and joy could also be seen in her eyes. Being able to cultivate her Seduction Attribute to such a level meant that she had already reached a state where she had gone back to the basics, a natural state.</p><br/><p>Finally, Zhou Weiqing reached her, and the two bodies began to merge together in the air. The right arm that Zhou Weiqing had emptied previously directly stretched out to hug Shen Bu. Shen Bu began to cuddle in his arms like a timid and loveable little woman.</p><br/><p>However, in the midst of the shyness and joy in her eyes, her right hand that was hidden in her sleeve had long since turned black. Each finger was as black as pointed awls. Even though it might seem like she was gently stroking Zhou Weiqing’s chest, it was obvious that her hand was very lethal.</p><br/><p>She was waiting. Waiting for the moment when Zhou Weiqing would finally hug her. His emotions were being manipulated by her charm, and she was waiting for the moment when his heart was the gentlest towards her to make a move. Unfortunately, she did not have enough time to do that. What she loved most was to take a man’s life at the peak of his happiness while he was on top of her body. That indescribable pleasure was Shen Bu’s favorite feeling in the world.</p><br/><p>Did Zhou Weiqing really hug her? Yes. Indeed, he did. Unfortunately, he was not hugging Shen Bu’s body.</p><br/><p>The now empty right hand went pass Shen Bu’s sight, and just as it was about to land on her slender waist, Zhou Weiqing’s big hand suddenly changed its trajectory and gently slid over Shen Bu’s neck.</p><br/><p>A gentle voice resonated by Shen Bu’s ear, “If I were you, I wouldn’t have taken out those ugly claws!”</p><br/><p>At this moment, Shen Bu’s right hand was only less than three inches away from Zhou Weiqing’s chest. However, even though these three inches was a distance so short that it was basically nothing to a Heavenly Emperor like her, it seemed like she was not able to continue her attack at all.</p><br/><p>Disbelief filled Shen Bu’s eyes instantly. No matter what, she could not believe that Zhou Weiqing actually managed to free himself from her Seduction Technique. Looking back at all the signs and symptoms that he had exhibited before, he should have completely fallen into her Seduction control!</p><br/><p>She had her reasons for having such faith in herself. After all, even Fen Tian would be unable to resist her Seduction Attribute if he did not prepare himself in advance.</p><br/><p>The people around them could only feel 1% of the Seduction Attribute’s effects but Zhou Weiqing had taken the full brunt of the effects.</p><br/><p>Casting aside the fact that he was a hot-blooded young man, even if he was an old and decrepit senior, Shen Bu was certain that she would still be able to seduce him.</p><br/><p>“This is impossible!” Shen Bu instantly screamed loudly, surprising the people watching below.</p><br/><p>This round of match seemed to be the most peaceful one but everybody knew that the killing intent would erupt anytime soon. However, how did Zhou Weiqing manage to turn the situation around at the very last minute? The people from the Blood Red Hell, in particular, could not believe this turn of events at all.</p><br/><p>The Yang Giant Spirit Palm on Shen Bu’s smooth-as-silk neck tightened at once. Although he did not exert any force, it still caused Shen Bu’s skin on her neck to shiver in cold. She understood very well that it was just a matter of course if Zhou Weiqing wanted to kill her.</p><br/><p>“H-How did you break away from my Seduction Attribute?” Shen Bu asked. She was obviously upset. She was a psychologically twisted woman. Otherwise, she would not be able to cultivate her Seduction Attribute to such an extent. The Seduction Attribute was considered to be everything to her. It was even more precious and important to her than Heavenly Energy was to an ordinary Heavenly Jewel Master. That was quite a perverted kind of narcissism, a narcissistic view towards the Seduction Attribute. She could not accept the fact that her Seduction Attribute was so easily thwarted by Zhou Weiqing. This blow to her was even more painful than death.</p><br/><p>Zhou Weiqing squeezed Shen Bu’s neck as he shifted his gaze that had returned to normal towards Blood Red Hell’s Hell Lord, Fen Tian below them. He sneered mockingly, “How hard can it be? No matter how powerful your Seduction Technique is, it still doesn’t change the fact that you’re already an old witch! I merely repeated this to myself in my heart. An old witch in her seventies or eighties flirting with me would only make me feel repulsed. How can I possibly be manipulated by you? Ahhh, it has never crossed my mind that the Blood Red Hell has fallen so low that you’d need to use this old witch to sell sex appeal! Tsk tsk tsk…”</p><br/><p>“Barf —” A mouthful of blood spurted out of Shen Bu’s mouth. Zhou Weiqing’s every single word hammered fiercely at her heart. Especially the words ‘ <em>seventies </em><em>or eighties </em>‘ and ‘ <em>old witch </em>‘ that almost choked and angered her to death.</p><br/><p>A terrifying energy ripple exploded from Shen Bu without warning. She had chosen to detonate her Heavenly Core Nucleus when she was spewing out blood. It was her desire to wash off this disgrace with fresh blood. Right now, there was no look of seduction in her eyes. It had already been entirely replaced by a hysterical madness.</p><br/><p>However, it was also at this moment that Shen Bu could feel Zhou Weiqing’s right hand that was clutching on her neck shuddered without warning. In an instant, the look in his eyes became brighter, and a vindicated look could be seen in his eyes. His right hand immediately slid down and plunged directly into Shen Bu’s body from the back. It blocked her Heavenly Core Nucleus from blowing up.</p><br/><p>“YOU ——” Shen Bu stared at Zhou Weiqing blankly. Below them, chaos had already erupted.</p><br/><p>The moment Shen Bu chose to detonate her Heavenly Core Nucleus, Shen Mo had rushed out and charged towards Zhou Weiqing who was levitating in the sky. However, he was blocked by the Six Ultimate Heavenly Emperor Long Shiya before he could do anything. Fen Tian, on the other hand, sent Wu Yunyue flying with a thrust of his palm. He spurted out blood as he was thrown backward. Ling Dang quickly flew out from the Peerless Sect group and stretched out both of her hands as she temporarily blocked Fen Tian from continuing his attack.</p><br/><p>Shen Bu did not seem to notice the havoc that was unfolding on the surface below. She stared at Zhou Weiqing fixedly as she asked, “Y-You… You’re still under m-my control, r-right?”</p><br/><p>A hint of embarrassment could be seen on Zhou Weiqing’s face as he nodded his head.</p><br/><p>Shen Bu laughed. She could still actually laugh at this time, “I… I knew it. I-I knew it! N-Nobody… c-can resist… m-my Seduc…tion Attribute… S-Same goes t…to you, too… Alt-though I’ve… n-no idea how… you… m-managed to do it… I… I didn’t… lose…! Blerghh —” Fresh blood spurted out from her mouth again. The ultimate enchantress finally took in her last breath.</p><br/><p>That was right. Zhou Weiqing was actually not immune to Shen Bu’s Seduction attribute. The Blood Red Hell’s Hell Lord Fen Tian who possessed the Destruction Attribute was not immune to it and it was the same for him, even when he possessed the Saint Attribute.</p><br/><p>Although Shen Bu’s heart was already completely twisted, she was still indeed a genius amongst her peers. The Seduction Attribute that she invented herself was extremely powerful. That kind of seductive charm that was in harmony with the worldly nature was definitely one of a kind. Even a Heavenly God-tier powerhouse was not immune to this charm of hers. Right now, she was already a Heavenly Emperor-tier powerhouse. After she incorporated the Destruction Attribute into her Seduction Attribute while she perfected it, she had never failed, not even once.</p><br/><p>Not only that, a young man would have a greater desire towards the opposite sex compared to old people just as Fen Tian had predicted. For this reason, Zhou Weiqing was already enraptured by her Seduction Attribute the moment he gazed into Shen Bu’s eyes.</p><br/><p>Of course, just like what Tian’er had said, even if Zhou Weiqing was bewitched by Shen Bu’s Seduction Attribute, he would not lose this match. After all, Shen Bu’s main ability was only the Seduction Attribute. There was absolutely no way for her attack to pierce through Zhou Weiqing’s Ringless Ground Purging Set and his Dragon-Tiger Demon God Transformation’s defenses.</p><br/><p>Zhou Weiqing knew instantly that he would not be able to resist Shen Bu at all the moment he first looked into her eyes. That was right. What he did was he actually set a psychological cue for himself. It was not a cue so he could directly resist. Otherwise, he would show signs of struggling, and it would be difficult for him to attack Shen Bu. She was already a Heavenly Emperor-tier powerhouse after all and had the duration been any longer, Zhou Weiqing might not be able to hold his Divine Thought any longer.</p><br/><p>Zhou Weiqing had always been a very careful person, and naturally, he would be well prepared for this exact reason. He made his preparation right at the moment Shen Bu launched her attack. No matter how powerful the Seduction Technique was, when one reached Zhou Weiqing’s cultivation base, the Saint Energy would automatically protect his body the instance he was attacked by a foreign assault. At the same time, his own body would form a strong resistance by itself. This was also the moment the psychological cue that he had set earlier on woke up in an instant and prompted him to kill Shen Bu without any hesitation. It did not leave her with a chance to continue her Seduction Technique so that he could win this battle.</p><br/><p>If everything had gone according to Zhou Weiqing’s plan, there was quite a huge chance for him to succeed. After all, his own judgment was pretty accurate and on point.</p><br/><p>Fortunately, there were a few people who did not want Zhou Weiqing to be in a passive state. That was why just a moment after Zhou Weiqing had fallen into a bewitched state, a power rose from the Peerless Sect and freed him from Shen Bu’s Seduction Technique.</p><br/><p>At any rate, the Seduction Technique was not completely invincible. It was similar to how everything in the world could be trumped by another thing. Due to this reason, Zhou Weiqing was in a slightly disadvantageous position in this round. There was no doubt that Zhou Weiqing also knew this. It was only when Shen Bu saw Zhou Weiqing’s expression at the final moment that she was hit with this realization. It was unfortunate that the enchantress’ one of a kind Seduction Technique would now be lost to the world. There was nothing wrong with this attribute. It could have been righteous had it been used in the correct manner.</p><br/><p>When Shen Mo saw how Shen Bu had fallen in Zhou Weiqing’s hands, he was instantly enraged with madness. This Heavenly God-tier powerhouse erupted in the lower atmosphere. It was so powerful that the other few Great Saint Lands had to join forces to release their Heavenly Energy and cast a joint protective shield to protect themselves from harm.</p><br/><p>Anger could be seen burning in Fen Tian’s eyes. However, instead of choosing to continue his attack, he shouted towards Shen Mo, “Come back!”</p><br/><p>Although Shen Mo was a Heavenly God-tier powerhouse, not to mention the fact that he was enraged at this moment, he chose to restrain his impulses, albeit reluctantly. Once again, he descended to the ground the moment he heard Fen Tian’s voice. On the other side, the Six Ultimate Heavenly God Long Shiya had quite a grim look on his face as well. The series of turbulent-like attacks that was released by the opponent had also taken quite a tremendous toll on him.</p><br/>\n</div>"}