{"title": "Chapter 824", "id": 824, "volume": 9, "url": "http://boxnovel.org/heavenly-jewel-change-chapter-824", "volume_title": "Volume 9", "body": "<h1>Chapter 824</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>The Dragon Clan were peerless beasts among the Heavenly Beasts. Even though the black dragon before his eyes did not possess the strong and powerful Dragon Emperor Bloodline, it was still an enormous dragon after all! With its strength and power, in addition to the prestige of its bloodline, the possibility of the Peerless Sect and the Heavenly Snow Mountain achieving victory in this battle was already lost.</p><br/><p>The stench of despair burst out of Xue Ao’tian’s body, even the God Vanquishing Heavenly Spirit Set on his body was emitting a layer of white misty radiance. A resolute gleam appeared in Xue Ao’tian’s eyes. He was already mentally prepared. As the Mountain Lord of Heavenly Snow Mountain, he would rather die in glory than to live in dishonor. He was prepared to die on the battlefield if he could no longer resist the Destruction attribute. However, at that exact moment, Tian’er’s voice suddenly echoed in his ears.</p><br/><p>“Father, do not act recklessly. That belongs to us.”</p><br/><p>After hearing Tian’er’s words, Xue Ao’tian could not help but be stunned, “What did you say? That, that belongs to us ours?”</p><br/><p>Tian’er’s expression seemed to be slightly sour, but he still nodded anyway, “Isn’t this the result of that good son-in-law of yours who enjoys flirting wherever he goes?”</p><br/><p>Xue Ao’tian was too persistent in his prejudice because of the earlier first impression. In his perception, the enemy was capable of using two enormous dragons. Naturally, there would be the possibility of a third dragon. Moreover, this was a black dragon that was emitting the Darkness Attribute. Xue Ao’tian who possessed the Divine Attribute was naturally hostile towards those creatures. That was why he instantly assumed that it was an enemy. When he heard Tian’er’s words at this moment, Xue Ao’tian took another glance at the dragon.</p><br/><p>He saw a woman standing impressively at the front of the black dragon’s head. That woman was clad in a full-black attire. She appeared rather inconspicuous because of concealment from the dense Darkness Energy from the Blackfiend Dragon earlier. Leaning against the horn of the Blackfiend Dragon’s head, her exceedingly beautiful face was icy cold. One could vaguely see the firm, resolute intent of murder, as well as the arrogant prestige in her eyes.</p><br/><p>The enormous dragon began spitting out waves of brutal and peerless dragon flames the moment it appeared on the battlefield. Even though the Blood Red Hell and Love Valley’s powerhouses were united and unafraid, this was still an unexpected attack. Moreover, it was an attack from a Heavenly God-tier powerhouse. They had no choice but to fall back rapidly as they resisted the onslaught together.</p><br/><p>The person who was riding the black dragon, rushing her way towards the battlefield during the most crucial moment — could she be Zhou Weiqing’s lover who was attracted to him from the Mysterious Heavenly Mainland, Dongfang Hanyue?</p><br/><p>Yes. Though it may be surprising, she was Zhou Weiqing’s other trump card. In other words, she was his other trump card when he no longer had any alternatives.</p><br/><p>It was not that long ago when Dongfang Hanyue arrived on the Boundless Mainland riding the Blackfiend Dragon. She found Zhou Weiqing through the Saint Energy connection she made with him and the assistance from the Blackfiend Dragon.</p><br/><p>This was the reason why Zhou Weiqing’s soulmates were looking at him sourly earlier. Shangguan Bing’er was the only person who was aware of the relationship between Zhou Weiqing and Dongfang Hanyue. On the other hand, the rest of the women had no idea. Now that the other party had found her way to his door, it was no wonder they were unhappy.</p><br/><p>Because the Saint Lands’ Great Battle was about to begin, Zhou Weiqing did not have the time to explain. As a result, he was deserted by his lovers. He did not even have the right to blame Dongfang Hanyue. After all, this was caused by his inability to suppress his lustful desires.</p><br/><p>The reason Dongfang Hanyue came looking for Zhou Weiqing was simple. She needed to inform Zhou Weiqing of a matter that made him stare at her bewilderment. He had no choice but to accept the fact that she was here.</p><br/><p>Dongfang Hanyue explained to Zhou Weiqing that she gave birth to his son recently. Yes, it was just that one time. He hit the target with one shot <sup>1 </sup>and was blessed by fate. Dongfang Hanyue became pregnant with Zhou Weiqing’s child. The child stayed behind on the Mysterious Heavenly Mainland and became the next successor to the Mysterious Heavenly Mainland. Dongfang Hanyue’s purpose for this trip was very simple. She was there to propose her terms to Zhou Weiqing. The child could not grow up without a father so she requested for Zhou Weiqing to live on the Mysterious Heavenly Mainland for a month from each year to accompany her and his son hereafter.</p><br/><p>As the Palace Master of the Mysterious Heavenly Palace, Dongfang Hanyue had an unyielding temperament since the beginning. In addition to her proposed term that would forcibly usurp Zhou Weiqing for a month every year, it was natural that she would not have a good relationship with Tian’er, the three Shangguan sisters, and Little Witch.</p><br/><p>The outcome of the situation was that the unfortunate Zhou Weiqing was directly banished to solitude. The few days before he came to the Heavenly Snow Mountain to take part in the Saint Land’s Great Battle, all the women had ignored him.</p><br/><p>Even though Dongfang Hanyue did not have a close relationship with the other women, she followed them as well when she learned that Zhou Weiqing’s trip to the Heavenly Snow Mountain’s peak this time would possibly result in him fighting a battle to the death. Naturally, she would not make an entrance beforehand. She refused to mingle with Tian’er and the rest. During the crucial moment, she was finally willing to make a move. Despite being extremely infuriated by Zhou Weiqing’s unfaithfulness, she could still clearly distinguish what was important to her.</p><br/><p>Dongfang Hanyue inhaled deeply and a rush of ample, powerful energy suddenly erupted from her body. In a flash, streaks upon streaks of dark golden-colored lights radiated out of her body continuously as she instantly entered the Blackfiend Dragon Transformation state.</p><br/><p>Dongfang Hanyue had the Blackfiend Dragon’s lineage in her body that was why her Blackfiend Dragon Transformation had some specific difference from Zhou Weiqing’s Dragon-Tiger Demon God Transformation. However, the greatest advantage of the Blackfiend Dragon Transformation was that she could perfectly merge herself with the Blackfiend Dragon to enter combat together. In this sense, even the Heavenly Snow Mountain’s powerhouses who were riding on the Heavenly Beasts could not compare to her.</p><br/><p>Two enormous wings unfurled and spread out from Dongfang Hanyue’s back. The legendary armor set she once showed off to Zhou Weiqing was attired on her body.</p><br/><p>Dark golden-colored emerged one after another on her body. In just a short while, six pieces of her armor were already completed. The seventh piece was the helmet. Her helmet was like a dragon’s mouth. Although it did not appear femininely beautiful, it was filled with a powerful mannerism that concealed her charming facial features.</p><br/><p>Now that seven pieces of the legendary armor set were complete, the appearance of the eighth piece followed closely. The eighth piece of armor extended from her waist. Within the intense dark golden-colored light, the eighth piece of armor merged with the Blackfiend Dragon’s horn behind her back. It firmly anchored her body to the upper part of the Blackfiend Dragon’s head. Surprisingly, the dark golden-colored armor turned downwards all the way to merge with the Blackfiend Dragon’s head.</p><br/><p>A layer of terrifying aura from the Darkness Attribute erupted from the Blackfiend Dragon’s body. The dense Darkness Energy surged wildly into Dongfang Hanyue’s body through the horn.</p><br/><p>The ninth streak of dark golden-colored light appeared at this moment. This time, the armor appeared directly on the Blackfiend Dragon’s body. The dark golden-colored armor extended out from the bottom of Meng Xing’s feet and firmly anchored her feet to the top of the Blackfiend Dragon’s head. The armor extended downwards along the Blackfiend Dragon’s neck and covered the lower region of the Blackfiend Dragon’s neck that was the most vital part. The armor continued to extend all the way until the Blackfiend Dragon’s entire neck was covered completely.</p><br/><p>Yes, this was Dongfang Hanyue’s Blackfiend Dragon Set. She had relied on this armor set’s ability to work together with the Blackfiend Dragon to forcefully defeat the Dreadfiend Sea Naga previously.</p><br/><p>On the other hand, she was no longer comparable to her past self. Even Dongfang Hanyue did not expect that there would be a pure seed of Saint Energy in her body just because she was pregnant with Zhou Weiqing’s child. From the moment she gave birth to the child, her cultivation base was forcefully elevated from the Maximum Level of the Heavenly Emperor Tier to the Lower Level of the Heavenly God Tier.</p><br/><p>The combination of Dongfang Hanyue and the Blackfiend Dragon who were both similarly at the Lower Level of the Heavenly God Tier was not as simple as one plus one equals two!</p><br/><p>The tenth streak of the dark golden-colored light glowed once again. This time, the dark golden-colored light was glowing from the top of Meng Xing’s head. The Blackfiend Dragon gave out a melodious sound of dragon’s roar in accordance. The loud and powerful dragon’s roar made the Blood Red Hell and Love Valley’s powerhouses in the surroundings fall back in succession. The energy fluctuation generated from the merging of two great Heavenly Gods was truly too terrifying. A streak of enormous dragon-shaped shadows that was thousands of miles long appeared indistinctly in the sky. Due to the fact that it was black in color, it did not appear to be eye-catching when compared to the surroundings of the Destruction Divine Territory. However, it genuinely existed. This was the Blackfiend Dragon’s Divine Territory that was unleashed when the Blackfiend Dragon joined forces with Dongfang Hanyue.</p><br/><p>Following that was the eleventh streak of dark golden-colored light that glowed from her body.</p><br/><p>A gigantic, long spear glowing in a dark golden-color was suspended before her face. The full length of the long spear was seven meters. It was thick and strong in the middle, tapered to sharp and fine tips on both ends and was entirely black. Two enormous coiling dragons were engraved on the surface. There was a bright red pearl at the convergence point of the two enormous dragons that was positioned at the midpoint of the spear’s body.</p><br/><p>In the next moment, Dongfang Hanyue wrapped her right hand around the pearl that was at the midpoint of the long spear.</p><br/><p>Bzzt!</p><br/><p>An absolutely terrifying aura erupted in a wave from the Blackfiend Dragon and Dongfang Hanyue’s body.</p><br/><p>A red color light as bright as blood almost replaced all the dark golden-colored lights in a blink of an eye. Blood red-colored long spear and blood red-colored armor. Even the Blackfiend Dragon’s horn had been similarly turned into a blood red color.</p><br/><p>It was completed. The eleven pieces of the Blackfiend Dragon Set was finally completed. The eleven-piece Boundless Infinitum Set paled in comparison the moment the Blackfiend Dragon Set appeared. It was not that the Boundless Infinitum Set was no match for the Blackfiend Dragon Set. However, the strength of the armor depended on the strength of the wearer as well. Only a Heavenly God-tier powerhouse was capable of truly displaying this divine armor set’s power!</p><br/><p>The Blackfiend Devastation Dragon Slaying Spear in Dongfang Hanyue’s hand connected the dots in the sky. Ten streaks of blood red light descended from the sky, which was then followed by ten puffs of bloody mist that exploded in mid-air The first ten powerhouses from the Blood Red Hell and Love Valley did not even have the chance to defend against the terrifying Blackfiend Devastation Dragon Slaying Spear as they turned into bloody mist in a blink of an eye.</p><br/><p>Dongfang Hanyue was utterly unafraid of the Destruction Divine Territory because she had been similarly injected with Saint Energy by Zhou Weiqing. Moreover, the Blackfiend Dragon’s Divine Territory was spinning in mid-air as it forcibly tore open a gigantic breach in the Destruction Divine Territory.</p><br/><p>It could be said that Dongfang Hanyue was the strongest person from Zhou Weiqing’s corner who appeared on the battlefield today, with the exception of the Elven Empress. Furthermore, Dongfang Hanyue was not as merciful as the Elf Tribe. As the Palace Master of the Mysterious Heavenly Palace, she was absolutely resolute to kill. As long as the person was an enemy, he would only have one ending in her hands.</p><ol><li data-annotation-id=\"225a7994-86bd-0f1e-c004-d143daf4287d\">Murphy’s law</li></ol><br/>\n</div>"}