{"title": "Chapter 825", "id": 825, "volume": 9, "url": "http://boxnovel.org/heavenly-jewel-change-chapter-825", "volume_title": "Volume 9", "body": "<h1>Chapter 825</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>When Zhou Weiqing’s other trump card appeared on her own accord when he had no other alternatives, the initially adverse circumstances on the scene turned around in a flash. Although Dongfang Hanyue only came with a dragon, they were capable of competing against a Maximum Level Heavenly God-tier powerhouse when they merged together with the help of the eleven piece Blackfiend Dragon Set. On the other hand, there was no other Heavenly God-tier powerhouse on Love Valley and Blood Red Hell’s side. Who else was capable of fighting against Dongfang Hanyue?</p><br/><p>When there was no other possible alternative, the forty Heavenly Emperor-tier powerhouses separated themselves from Blood Red Hell and Love Valley to besiege Dongfang Hanyue. Only then did the slaughtering speed of her Blackfiend Devastation Dragon Slaying Spear slow down.</p><br/><p>“Kill…” Dongfang Hanyue’s arrival greatly reduced Xue Ao’tian’s stress, he no longer needed to devote all his effort to resist the Destruction Divine Territory. The Mountain Lord of Heavenly Snow Mountain could finally immerse himself in the battle.</p><br/><p>In terms of quantity, there were less than a hundred people on their side, while the enemy still had almost four hundred powerhouses. However, the battle was no longer leaning to one side due to the existence of the three Heavenly God-tier powerhouses on their side. It was difficult to gauge which side would be victorious or defeated. Due to the terrifying lethality of the Blackfiend Devastation Dragon Slaying Spear in Dongfang Hanyue’s hand, the scales of victory was tipping in favor of the Heavenly Snow Mountain and the Peerless Sect’s side.</p><br/><p>Xue Ao’tian was the only Heavenly God-tier powerhouse who was involved the previous Saint Lands’ Great Battle. However, this time there were already more than ten Heavenly God-tier powerhouses on the Heavenly Snow Mountain’s peak alone!</p><br/><p>The battlefield on this side calmed down. On the other side, the pair of siblings, Shangguan Tianyang and Shangguan Tianyue, led the Heavenly Expanse Infinitum Great Formation and fought against the husband and wife, Huang Xingyun and Yun Ruoyun like a raging fire.</p><br/><p>In terms of cultivation base, Huang Xingyun and Yun Ruoyun obviously had the upper hand. However, they seemed to be in a disadvantageous position based on the situation at the battlefield now.</p><br/><p>The Heavenly Expanse Infinitum Great Formation could be used as the ultimate fail-safe for the Heaven’s Expanse Palace, but it was not an easy task. Even without a Heavenly God-tier powerhouse to assume command, the Heaven’s Expanse Palace was capable of sitting on the number one throne amongst the Five Great Saint Lands. They were definitely not just relying on their luck.</p><br/><p>Huang Xingyun and his wife felt as if they were one once the Heavenly Expanse Infinitum Great Formation was launched. No matter which direction they attacked, they would be greeted with the combined energy of 108 Heaven’s Expanse Palace’s powerhouses.</p><br/><p>The siblings Shangguan Tianyang and Shangguan Tianyue were at the eye of the formation in the Heavenly Expanse Infinitum Great Formation. The Destruction Divine Territory was completely useless in the face of this great formation. This was one of the distinctive features of the great formation. It was capable of shielding against any Divine Territory’s effect.</p><br/><p>Even though Heavenly God-tier powerhouses were strong, if Huang Xingyun and Yun Ruoyun were to launch an attack against the great formation, the attack would be weakened by half in the formation. Subsequently, the force of the attack would be equally shared among the Heaven’s Expanse Palace powerhouses. They would then rely on the profoundness of the Heavenly Expanse Infinitum Great Formation to dissolve the attack with ease.</p><br/><p>On the other hand, the great formation did not attack Huang Xingyun and Yun Ruoyun. However, every time the dull white-colored mist swept past their bodies, they would feel the fatal sensation of a threat that left the husband and wife with no choice but to use the full force of their Heavenly Energy so they could counterattack.</p><br/><p>The Upper-Level Heavenly God-tier powerhouses were considered superior beings in the world. Nonetheless, there was still a limit to the Heavenly Energy in their bodies. The act of continuously depleting their energy would weaken their cultivation base. Due to the fact that the Heaven’s Expanse Palace’s powerhouses were relying on the rotation of the Heavenly Expanse Infinitum Great Formation to form a miraculous energy circulation, their level of depletion was much lower compared to Huang Xingyun and his wife.</p><br/><p>If Huang Xingyun was given another choice, he would rather face Zhou Weiqing than to trap himself within this Heavenly Expanse Infinitum Great Formation. The feeling of not being able to exert his energy was truly too agonizing. Moreover, there was nothing he could do even if he wished to pull himself away from the great formation. Within this wide expanse of the mist-covered great formation, even his Divine Thought was incapable of charging out of the formation due to his inability to sense everything that was happening in the outside world.</p><br/><p>“The Heavenly Expanse Infinitum Great Formation that Xue Ao’tian faced in the beginning was not as strong as this one, right?” Huang Xingyun complained in his heart, but he could only hope that the other battles would end soon so they could help him. Although he could not break out of the formation with his wife, he could clearly sense that this Heavenly Expanse Infinitum Great Formation was already at its limit with their two-person attack. If only one more Heavenly God-tier powerhouse were to join in, they would certainly be able to break out of the formation.</p><br/><p>Huang Xingyun’s situational judgment towards the Heavenly Snow Mountain was rather accurate. In his opinion, their side should definitely have the upper hand in at least two battlefields.</p><br/><p>On one side, there were the main forces of the other two parties who were competing against each other in terms of quantity, actual strength, and attribute advantage. He believed that the battle on that side would end momentarily. The other side’s advantage naturally came from Fen Tian. Huang Xingyun was well aware of Fen Tian’s actual strength. A Maximum Level Heavenly God-tier powerhouse versus that lad from the Peerless Sect. He ought to be able to deal with him within a few short moments. At that time, as long as Fen Tian was willing to help Huang Xingyun, the battle on this side would also naturally end in the shortest time.</p><br/><p>“Xingyun, we should conserve some of our Heavenly Energy.” Yun Ruoyun’s voice echoed in Huang Xingyun’s ears.</p><br/><p>Huang Xingyun nodded. The husband and wife held each other’s hands as the distorted darkness radiance continuously spun around their bodies. Even though they were trapped in the great formation that resulted in their inability to absorb the outside world’s energy attribute to replenish themselves, the Heavenly Energy that was generated from their bodies would last them for a long period of time with their cultivation base.</p><br/><p>The siblings Shangguan Tianyang and Shangguan Tianyue had been calmly observing Huang Xingyun husband and wife all along. When they realized that the husband and wife were completely on the defensive, the two siblings could not help but smile.</p><br/><p>They had the best understanding of the essence of the Heavenly Expanse Infinitum Great Formation. The great formation was almost perfect in a manner of speaking. It was impossible to breach the formation no matter how it was attacked. It would only be possible to break out of the formation if the absolute energy of everyone combined exceeded the great formation by at least three times. All the laws were futile within this great formation, and the use of Divine Territory was forbidden as well.</p><br/><p>However, the only weakness of the Heavenly Expanse Infinitum Great Formation was that its offensive ability was too weak. With Huang Xingyun and his wife’s actual strength, even if they were not on a complete defensive stance, the Heavenly Expanse Infinitum Great Formation had no way of truly harming them. If it was truly as such then the entire situation would be reversed. The effort to sustain the great formation still required an amount of energy to be depleted. As long as Huang Xingyun and his wife could continue to resist, the people from Heaven’s Expanse Palace would eventually exhaust their Heavenly Energy.</p><br/><p>It was easy to say that. However, under the threat of being killed at any given time within this great formation, who would dare to forsake resistance and allow them to attack as they pleased? Moreover, this weakness was only aimed specifically towards the Heavenly God-tier powerhouses. Huang Xingyun and his wife did not have the courage to forsake their defensive efforts. This was their destiny. Even though the battlefield on this side was meant to last the longest, it was also the one that appeared the calmest.</p><br/><p>The two battlefields on the ground had regained its balance once again. Meanwhile, the three battlefields in the sky were a different sight altogether.</p><br/><p>The battle between the Six Ultimate Heavenly God Long Shiya and the Blood Red Hell’s Vice Lord Shen Mo could only be described as a volatile situation.</p><br/><p>In terms of cultivation base, Shen Mo had the advantage. Meanwhile, in terms of control of Heavenly Energy, it was apparent that Long Shiya had the upper hand. If they were to continue the fighting the battle, the end result would only be detrimental to the both of them.</p><br/><p>However, they did not continue the battle. They stopped in the middle before they started the battle once again. This time, they were competing against the energy restored by both parties earlier.</p><br/><p>Long Shiya’s enormous body was conjured up in the sky once again. However, he was only 100 meters tall this time. Although his Heavenly Energy seemed to become even more condensed and was denser, it was still incomparable to the larger body that he conjured up earlier.</p><br/><p>On Shen Mo’s side, there was a gigantic devouring mouth that was continuously launching wild attacks at Long Shiya. He resented the people from Peerless Sect. Shen Bu was murdered by Zhou Weiqing. There was no way he could make peace with that.</p><br/><p>The two parties were both Heavenly God-tier powerhouses. Naturally, they had an accurate judgment of the earlier battle. Shen Mo was well aware of his current situation. Even though he was slightly injured to the point that his cultivation base was affected, he had the opinion that Long Shiya should be more severely affected because his Divine Thought depleted a lot of energy. Divine Thought was even more difficult to restore than injuries. It was impossible for Long Shiya to recover in such a short period of time. This could be obviously seen in the battle. Long Shiya’s Divine Thought was only capable of controlling his hundred-meter-tall body right now.</p><br/><p>Any defeat or victory across any of the five battlefields was enough to affect the overall situation. Shen Mo was even more optimistic than Huang Xinyun. In his opinion, they were only on the losing side in the battle between the Elf Tribe and the two enormous dragons, while they had the advantage in the rest of the battlefields. He wished that he could use the fastest speed to destroy Long Shiya who was running low on Divine Thought so he could go all out and kill everyone. Only the sight of fresh blood could wash away the rage in his heart.</p><br/><p>Everything before his eyes seemed to be developing according to his wish. Under his violent attacks, Long Shiya had absolutely no way to come up with a good counterattack. This was due to the Destruction Divine Territory being restrained by the Elf Tribe’s Natural Divine Territory to a certain extent. Shen Mo could go all out on his attack because Long Shiya was completely on the defensive. Every time a gush of energy was torn away from Long Shiya’s hundred-meter-tall body, his body size would shrink by a few sizes. It seemed like it was only a matter of time before Shen Mo would achieve victory.</p><br/><p>The battle between the Elf Tribe and the two enormous dragons were occupying the largest area in the sky. The Elven Empress was standing in the formation and became the main restraining energy.</p><br/><p>Although the Natural Divine Territory Great Formation that the Elf Tribe’s twelve elders cast with great effort were capable of limiting Hui Yao and Duo Si, the two enormous dragons were truly too powerful. The dragons became even more terrifying after they came to possess the Destructive Attribute. In terms of cultivation base, Hui Yao was even more superior than Fen Tian.</p><br/><p>If they were to truly charge and attack at full force, it was very likely that even this great formation would be incapable of trapping them.</p><br/><p>It seemed like there were as many as five Heavenly God-tier powerhouses on the Elf Tribe’s side. However, in reality, those four Elf Tribe elders had only just advanced to the Heavenly God Tier recently. Hui Yao could easily eliminate them if the Elven Empress was not around.</p><br/><p>However, the current Elf Tribe now was no longer the same one that existed in the Sealed Land. The evolution of the Ancient Elven Tree resulted in the evolution of the Elven Queen into the Elven Empress. How could she be so easily dealt with?</p><br/><p>The Elven Empress was actually on the same level as the Dragon Emperor of ancient times!</p><br/>\n</div>"}