{"title": "Chapter 839", "id": 839, "volume": 9, "url": "http://boxnovel.org/heavenly-jewel-change-chapter-839", "volume_title": "Volume 9", "body": "<h1>Chapter 839</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>The Netherworld Seal was previously completed by the Dragon Emperor who was the leader, the Elven Empress of that generation, and the rest of the powerhouses. The current Dragon Emperor was severely injured so one could only imagine how badly the seal’s energy had depleted. Furthermore, would they be able to successfully reinforce the seal without the help of the Dragon Emperor?</p><br/><p>Even though everyone felt slightly anxious in their hearts, they understood that their anxiety was useless at this moment. They could only pray for the best.</p><br/><p>The Dragon Turtle fell at an extremely fast speed, and there was a distorted layer of light, with a pattern that glimmered indistinctly in the surrounding area. There was also a dense Destruction Energy that attacked the lower part of the Dragon Turtle’s body. Its defense was truly strong and powerful to be able to withstand the violent Destruction Energy while remaining uninjured. It definitely lived up to its name of being the Heavenly Beast with the strongest defense in the world.</p><br/><p>Zhou Weiqing pressed his hands on the Dragon Turtle’s body as he infused a surge of gentle Saint Energy into its body. The Dragon Turtle’s body noticeably trembled once when the Saint Energy entered its body, and just in a short while, it could sense the benefits of the Saint Energy. Its body stopped falling for a tiny moment as it turned its dragon’s head around and nodded at Zhou Weiqing. Zhou Weiqing could clearly see that there were joy and excitement in its huge dragon’s eyes. It was apparent that the Dragon Turtle could sense the suppressing effect Saint Energy had on the Destruction Energy.</p><br/><p>The Dragon Turtle continued falling for almost an hour when the pattern on its back brightened up suddenly. It released a gush of air from its lower abdomen that supported its enormous body, and it reduced the momentum from the fall as it enabled it to land gently.</p><br/><p>When the crowd arrived in this place, they realized that the surrounding darkness had gradually disappeared. Due to that, they were able to witness a magnificent scene.</p><br/><p>The surrounding cave walls were glimmering with the dazzling radiance from countless colorful gemstones encrusted on the walls. The gemstones were glowing with a myriad of brilliant colors from the reflection of the Dragon Turtle’s radiance. The deeper they traveled, the more intense the gemstones glowed in the surroundings. Zhou Weiqing swore that if these gemstones were excavated and sold outside, they would certainly be sold for an enormous fortune as he had never even seen most of these gemstones before.</p><br/><p>“There’s no need to be surprised. The rocks in the surrounding walls are continuously corroded by our seal’s energy for many years, and they slowly formed from the gradual changes in the rock’s internal structure. These are not real gemstones. They’re actually filled with a large amount of attribute energy. It’s quite similar to our Heavenly Beasts’ Nucleus Core, and the Heavenly Core Nucleus of you humans,” the Dragon Turtle explained.</p><br/><p>With a thud, the Dragon Turtle’s enormous body finally came in contact with solid ground. However, it did not stop there as it placed its gigantic dragon claws on the ground and moved rapidly along a route in front that led to the inside.</p><br/><p>Zhou Weiqing and the rest had only discovered that they had finally arrived at the bottom of the abyss. They could not help themselves when a sudden realization hit them — they had indeed traveled a terrifying distance! The surrounding temperature was obviously different from when they had just descended into the abyss, it changed from the original icy cold temperature to scorching heat. The surrounding air rippled with water-like vapor occasionally.</p><br/><p>“Are we close to the earth’s core?” Zhou Weiqing asked curiously.</p><br/><p>The Dragon Turtle explained, “To be exact, we’re in the earth’s outer core. We, from the Dragon Clan, are masters in controlling fire and so were the imperial families of past dynasties. His Majesty, the Dragon Emperor draws support from the energy of the earth’s core to attain the highest level in his cultivation base so that he can maintain the seal.”</p><br/><p>Zhou Weiqing exclaimed with overwhelming emotions, “For the benefit of the mainland, the senior Dragon Emperor and all the seniors have truly contributed too much. It’s just too much.” He questioned himself — If he was in their place, would he be able to persist for so many years? Just the loneliness from carrying out this duty was not something an ordinary person was capable of enduring.</p><br/><p>The Dragon Turtle did not march for a long period of time before the place ahead suddenly widened into a clearing that was brightly lit.</p><br/><p>To everyone’s surprise, even the Dragon Turtle’s enormous body was dwarfed by the place that was as vast as an arena.</p><br/><p>Zhou Weiqing could sense a sort of peculiar energy fluctuation here that made him feel kind and warm. He looked closely and discovered that there were a total of thirteen balls of energy floating in mid-air in the middle of this huge arena. The energy balls were constantly changing its colors. A giant Demon Magic Formation was formed right underneath the thirteen energy balls. The complexity of the Demon Magic Formation exceeded the complexity of Zhou Weiqing’s design for the eleventh piece of Ringless Ground Purging Set, and it made one dizzy at first glance.</p><br/><p>Out of the thirteen energy balls that were frozen and floating in midair, the biggest ball in the middle was over two hundred meters in diameter while the diameter of each of the twelve balls surrounding it was over one hundred meters. Together, the energy balls formed a Demon Magic Formation that was beyond even the word ‘gigantic’. Zhou Weiqing already possessed a cultivation base at the Maximum Level of the Heavenly God Tier. However, he still felt small as he stood before the Demon Magic Formation at this moment.</p><br/><p>Hui Yao and Duo Si leaped down from the Dragon Turtle’s back separately. As they witnessed the gigantic Demon Magic Formation before them, Hui Yao could not refrain from sighing emotionally, “So this is the Netherworld’s seal then? Does the Netherworld still lie below it?”</p><br/><p>The Dragon Turtle murmured, “I can’t say for sure that the Netherworld is lying underneath it because the Netherworld belongs in another realm. We’re merely suppressing the realm. However, it’s obvious that the Nether Lord had come up with a way to make contact with those above ground. Otherwise, his actual strength won’t be continuously increasing. Human, were you infusing Saint Energy into my body earlier?”</p><br/><p>The last sentence was meant for Zhou Weiqing.</p><br/><p>Zhou Weiqing hastily nodded, “That’s correct. It was Saint Energy.”</p><br/><p>The Dragon Turtle did not even attempt to conceal its excitement, “That’s wonderful. I can feel that your Saint Energy is very effective in restricting the Destruction Energy. Please wait for a moment while I quickly request for His Majesty, the Dragon Emperor to allow all of you to enter the seal.”</p><br/><p>The Dragon Turtle let out a strange voice from its mouth as it was saying that. It sounded like an ancient language that carried an energy fluctuation that was similar to soul vibrations as the voice surged towards the largest ball among the thirteen energy balls in the sky.</p><br/><p>A voice that sounded ancient yet majestic echoed, “All of you are finally here, my children. We don’t have much time now. Enter the seal quickly.”</p><br/><p>A gust of gentle energy suddenly glowed from underneath the feet of Zhou Weiqing’s group as halos of light emerged out from the surroundings. Zhou Weiqing and the rest felt that the surroundings had an unreal feeling to it. It was as if they were transported to another place by Spatial Law.</p><br/><p>It seemed like they were already in another realm. The surrounding area was pitch black with only thirteen figures that appeared unusually clear within the darkness. The largest figure amongst them was at least eighty percent similar to Hui Yao’s appearance. It was only that the figure’s body was even larger than Hui Yao with the addition of a majestic and kingly mannerism. Its enormous dragon eyes were filled with infinite weariness and the experience of the many vicissitudes of life.</p><br/><p>Zhou Weiqing could not help but be startled by the situation before his eyes. The Netherworld’s Seal was so powerful that it formed a realm of its own. He did not even have any confidence that he would be able to charge out of here despite having the Saint Energy. Moreover, the realm was built from the inside out. On the other hand, the Netherworld was suppressed from the outside of the seal, and yet the Nether Lord still managed to almost break the seal on multiple attempts. His true strength must be unimaginably powerful.</p><br/><p>There was no doubt that the largest figure in the middle was the Dragon Emperor who was supporting the core of the entire Netherworld’s Seal.</p><br/><p>“Mother.” Tian’er shouted almost instantly. It was true that the Entropic Nether Tiger, Phelia was one of the twelve guardians by the Dragon Emperor’s side. It was just that she was currently in the beastly form of the Entropic Nether Tiger.</p><br/><p>Phelia stared at her daughter with gentle gaze but she did not speak. Zhou Weiqing and Tian’er could see the deep weariness in her eyes.</p><br/><p>It was not just Phelia, all the Heavenly Beasts at the Heavenly God Tier including the Dragon Emperor looked extremely worn out.</p><br/><p>“First Ancestor.” Hui Yao and Duo Si’s huge dragon eyes were filled with emotions when they saw the Dragon Emperor. They instantly knelt on the ground and worshipped the Dragon Emperor without hesitation.</p><br/><p>“Stand up, this is not the time for etiquette. The both of you take over Phelia and Gang Dora’s place, quick.”</p><br/><p>“Yes, First Ancestor.”</p><br/><p>The entire Netherworld’s seal was extremely complicated. However, the complexity was mainly focused on the magic formation while the thirteen Heavenly God Tier Heavenly Beasts including the Dragon Emperor’s main purpose was to provide the seal with adequate energy.</p><br/><p>Hui Yao and Duo Si simultaneously leaped up and flew over. The Entropic Nether Tiger, Phelia and the other enormous leopard-like Heavenly Beasts that was entirely snowy white in color removed themselves in unison and were replaced by Hui Yao and Duo Si.</p><br/><p>The entire magic formation’s glow suddenly became more powerful with the addition of fresh troops. The darkness that surrounded the space became much brighter than before.</p><br/><p>The Dragon Emperor nodded in satisfaction towards Hui Yao. It was apparent that he was satisfied with Hui Yao’s true strength. Hui Yao’s gaze that was earlier filled with enmity became much gentler and was replaced with respect.</p><br/><p>“Senior Dragon Emperor, what do you need us to do?” Zhou Weiqing spoke to the Dragon Emperor.</p><br/><p>The Dragon Emperor nodded to Zhou Weiqing, “I have heard Phelia speaking regarding all of you. I hope that your Saint Energy is capable of triggering a decisive effect to completely reinforce the seal. Release a little of your Saint Energy first so I can get a feel for it. Then, I’ll decide what to do with it afterward.”</p><br/><p>Zhou Weiqing nodded as he raised his head and shot out two gentle beams of Saint Light that spread out in the pitch black space.</p><br/><p>The radiance that was emitting from the thirteen Heavenly Beasts with the Dragon Emperor as leader seemed to become brighter at once.</p><br/><p>Surprise and emotion appeared in the Dragon Emperor’s simple and unsophisticated voice, “This is truly Saint Energy and a pure Genesis Aura. Even though it’s not the true Genesis Energy, it won’t be a problem for us to reinforce the seal with the existence of this Saint Energy. Weiqing, you shall take my place after this. Everyone else, get on my body.”</p><br/><p>As he said that, a dazzling red light shot out from the Dragon Emperor’s head into the area beneath Zhou Weiqing and Tian’er’s feet, looking similar to a bridge.</p><br/><p>The energy that was released by the Dragon Emperor was quite different from Hui Yao. Even though they both had control over the fire element, Hui Yao’s control of the Fire Attribute was filled with vigor and agitation, while the Dragon Emperor’s version of the Fire Element gave Zhou Weiqing an unexplainable feeling. He could not sense any temperature on the surface and it was very gentle. However, he discovered that the Fire Element was so pure that even when he focused on trying to find it, there seemed to be no impurities at all.</p><br/>\n</div>"}