{"title": "Chapter 840", "id": 840, "volume": 9, "url": "http://boxnovel.org/heavenly-jewel-change-chapter-840", "volume_title": "Volume 9", "body": "<h1>Chapter 840</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>They had the same cultivation base at the Maximum Level of the Heavenly God Tier and almost the same amount of Heavenly Energy. The only difference was the purity of their attributes and Heavenly Energy. This was the reason why there was still a huge disparity between Hui Yao and the Dragon Emperor’s ability.</p><br/><p>Zhou Weiqing and Tian’er’s bodies were flying directly towards the area above the Dragon Emperor’s head within the glow of the dark red radiance.</p><br/><p>Zhou Weiqing held Tian’er’s hand as they remained still. They allowed the wave of energy to carry them because Zhou Weiqing could clearly sense that it was impossible for them to arrive above the Dragon Emperor’s head through the seal’s magic formation entrance on their own. The Dragon Emperor was the core of the entire Netherworld’s Seal. If someone were to forcibly approach him, the person would be immediately attacked by the rest of the twelve Divine Beasts under the guidance of the magic formation.</p><br/><p>Zhou Weiqing and Tian’er promptly got closer to the Dragon Emperor. However, at that exact moment, the sound of a loud rumble shook the entire pitch black space violently. The powerful tremors even shattered the Fire Energy that the Dragon Emperor released. All thirteen Divine Beasts were shaken violently, and that resulted in Heavenly Energy shooting out of their bodies wildly. Not only were Zhou Weiqing and Tian’er stuck outside, their energy was instantly poured out at a shocking speed.</p><br/><p>The pitch black space became completely bright at this moment. Various peculiar, dazzling light patterns and symbols shimmered against one another.</p><br/><p>Zhou Weiqing felt as if he was in a sea that was viscous and dense at this very moment. The viscous seawater was tremendous Saint Energy.</p><br/><p>The Heavenly Energy that was simultaneously released by thirteen Heavenly God-tier powerhouses was further amplified by the magic formation. It was unimaginably extensive.</p><br/><p>Even with Zhou Weiqing’s current cultivation base at the Maximum-Level of the Heavenly God Tier, he still found it difficult to move within the dense and viscous energy in liquid form.</p><br/><p>This change was undoubtedly caused by the Nether Lord’s second attack on the seal.</p><br/><p>Zhou Weiqing realized that an enormous veil had appeared below the thirteen Divine Beasts’ bodies from the violent assault earlier. The veil had a diameter of almost a thousand meters and was faintly tainted with red color.</p><br/><p>There were already dozens of cracks crawling on the veil. As a result of the violent assault from earlier, the cracks were spreading out in all directions. It seemed very likely that the veil would collapse at any given moment.</p><br/><p>The veil was transparent so that one could faintly see a huge figure standing behind that enormous veil. The fellow’s body size was even slightly bigger than the Dragon Turtle. Due to the fact that it was separated by a red-colored veil, one could only indistinctly see that it was black in color. Zhou Weiqing was very familiar with the appearance of its form and body. It was almost exactly the same as the black-colored giant crab that appeared when Fen Tian borrowed the Nether Lord’s energy.</p><br/><p>The veil was undoubtedly the microcosm of the entire Netherworld’s Seal, while the enormous shadow on the other side of the veil was exactly the true body of the Nether Lord.</p><br/><p>The viscous Heavenly Energy was continuously injected into the gigantic symbol suspended in the air in an attempt to slow the cracks from spreading while it simultaneously reinforced the entire seal. However, it was apparent that the Nether Lord’s assault was even stronger as the cracks kept spreading continuously like before.</p><br/><p>“Do not waste your energy for nothing, Dragon Emperor. None of you are capable of stopping me this time. The human world’s resentment provides me with continuous energy. There are no more opportunities for all of you. Hah-hah, hah-hah-hah-hah. Wait for me to get out. All of you will die, and I’ll turn all of you into my puppets. All of you shall bear witness to my magnificent feat of destroying the entire mainland. I’m going to turn the Boundless Mainland into the Nether Mainland. I’m going to swallow everything so that I can create the real Netherworld.”</p><br/><p>The Nether Lord’s voice remained as ambiguous as before. Moreover, it was different listening to its voice here compared to listening to it from the outside world. Every word it spoke caused an intense tremor in the soul that guided everyone’s emotions. It pulled at everyone’s emotion as if it was attempting to forcibly inject negative emotions into everyone’s hearts.</p><br/><p>“I’ll never allow you to prevail, Nether Lord. I was able to seal you for millennia so I’m certainly capable of continuing my effort to seal you.” The Dragon Emperor’s eyes gleamed with determination. His energy was still surging out continuously like before. Even though Zhou Weiqing and Tian’er did not succeed at arriving at the Dragon Emperor’s head, with the husband and wife duo, Hui Yao and Duo Si’s recent participation as fresh troops, Heavenly Energy began to surge steadily and continuously increased to the point that it finally managed to reduce the speed of the spreading cracks. Moreover, it seemed like the cracks were trying to seal themselves.</p><br/><p>“Perhaps, you’ll be able to sustain your efforts in sealing me if you were still in your prime. However, you’re done now. I’ve prepared a gift for you and now is the right time for me to present you with the gift.” The Nether Lord’s voice gradually turned somewhat hysterical. Following that, a strange, red-colored halo brightened the area before the Nether Lord’s body on the other side of the veil.</p><br/><p>The Nether Lord’s assault slowed down noticeably when the red-colored halo first appeared. All the cracks on the seal then stabilized. Although it was difficult to try and close the cracks, at least the cracks would not continue to spread.</p><br/><p>However, before the Dragon Emperor and the Divine Beasts even managed to catch their breaths, Hui Yao and Duo Si let out a dismal roar in unison.</p><br/><p>On the other side of the veil, the red-colored halo released by the Nether Lord gradually grew clearer. Within it was two unappealing, tiny figures. However, it was obvious that they had the form of dragons. Two tiny little dragon forms that looked helpless and afraid as they moved rhythmically in the ball.</p><br/><p>“Those, those are…” The Dragon Emperor’s enormous body trembled violently as well.</p><br/><p>“Children, my children. Those are the dragon children’s souls. Return my children to me.” Duo Si screamed out bitterly and was about to charge towards the direction of the veil. Although the influence of the magic formation prevented her from leaving her position, the entire magic formation became unstable when she moved.</p><br/><p>“Stay calm, do not affect the seal!” The Dragon Emperor roared once, and it resulted in the realm within the seal shaking violently once as well. The Dragon Emperor relied on the Dragon Clan’s powerful and imposing manner to forcibly suppress Hui Yao and Duo Si’s wild emotional fluctuations. Even so, the Heavenly Energy that was transferred by Hui Yao and Duo Si became noticeably unstable.</p><br/><p>“Hah-hah-hah-hah-hah, Dragon Emperor, do you like this huge gift that I got for you? That seal of yours is built on the foundation of the Elf Tribe and your bloodlines. Now that I have seized control of your bloodline, I’m interested to see what else you can do to seal me.”</p><br/><p>As it was saying that, the Nether Lord in the form of a crab probed forward with its two gigantic front claws. It managed to grab one little dragon soul’s in each of its claws. A dismal and deafening roar sounded from Hui Yao and Duo Si as the dragon souls were instantly crushed. Dense black-colored radiance combined with two balls of crushed dragon souls’ shadows slammed ferociously against the seal.</p><br/><p>Boom!</p><br/><p>The entire seal’s realm was almost shattered in a flash. More than half of the magnificent colors in the surroundings also vanished. The initially desolated realm revealed itself once again. The group of Divine Beasts brought Zhou Weiqing and the rest along as they emerged together in the huge cavern that Zhou Weiqing and the others first arrived at.</p><br/><p>A pair of gigantic front claws of a crab stabbed out from the bottom of the seal’s magic formation and ferociously bombarded the Dragon Emperor’s body. The impact sent the Dragon Emperor’s enormous body into the air, and it crashed ferociously into the cave’s ceiling, resulting in a loud bang.</p><br/><p>A large stretch of scales under the Dragon Emperor’s abdomen was smashed. Countless specks of a pitch black radiance surrounded his body. Blood splattered everywhere as the Dragon Emperor began spurting dragon blood wildly, with his entire body embedded into the ceiling.</p><br/><p>The seal’s energy was at its weakest at this moment. Even though the seal was still being sustained, the pair of gigantic front claws were waving around wildly, and it would soon break out of the seal and destroy everything. The Nether Lord would descend into the mortal world at that moment!</p><br/><p>“Do not panic, count on me.” A loud shout awakened the Divine Beasts that were filled with despair at this extremely dangerous and crucial moment. Following that, two platinum-colored figures flew into the air and arrived at the position where the Dragon Emperor was at earlier. At the same time, a surge of a bright green radiance suddenly brightened the area as it transformed into a huge green halo that gathered the twelve Divine Beasts to form the magic formation that was scattered earlier by the tremors. Then, it infused a massive amount of Life Saint Energy into them.</p><br/><p>On top of that, the entire cavern also turned into a green-colored sea at this moment. An unreal light was suspended in mid-air as it emerged below the Dragon Emperor’s body. The moment it appeared, even the movement of the Nether Lord’s gigantic front claws became slower.</p><br/><p>“Th-his is…” Every single one of the Divine Beasts was shaken but they had an expression of wild joy amidst the incredulity.</p><br/><p>That colossal light shadow was a hundred kilometers tall, and its vast crown almost covered the entire arena. The dense Life Saint Energy and the green-colored radiance were exuding dense vitality as if it was formed from the most beautiful Emperor’s green jade carving. Even the Dragon Emperor who was slammed into the ceiling and was already critically ill was forcibly pulled back from the brink of death after receiving a massive flood of Life Energy.</p><br/><p>That was right. It was the Ancient Tree of Life. The Elf Tribe’s Ancient Tree of Life. It appeared in this cavern to everyone’s surprise. At this moment, let alone the Divine Beasts, even Zhou Weiqing and Tian’er’s eyes were similarly filled with incredulity and disbelief.</p><br/><p>This was the real fail-safe by the Elven Empress. The Ancient Tree of Life became mobile after its evolution. Ever since Zhou Weiqing left the Elf Tribe’s Sealed Land, the Elven Empress started carrying the Ancient Tree of Life around even as she entered the Wan Shou Empire’s area. It took her a few months to walk to the Heavenly Snow Mountain. She had been using her secret skill to hide and conceal the Ancient Tree of Life’s presence so that no one but the Elf Tribe’s elders was aware that she brought along the Ancient Tree of Life.</p><br/><p>This was the Elven Empress’ trump card. She had waited until this moment to use it.</p><br/><p>When Zhou Weiqing was fighting against Fen Tian initially, the Elven Empress was very close to summoning the Ancient Tree of Life. It was all thanks to Zhou Weiqing who depended on his powerful Time Attribute technique that this final trump card was successfully kept until this critical moment.</p><br/>\n</div>"}