{"title": "Volume 1 Chapter 8", "id": 8, "volume": 1, "url": "http://boxnovel.org/ark-volume-1-chapter-8", "volume_title": "Volume 1", "body": "<h1>Volume 1 Chapter 8</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><div></div><br/><p></p><h3>You’re dead if you're caught</h3><br/><p> “There aren’t that many things worth using.”</p><br/><p> “Even so, they are wares difficult to acquire in the area.”</p><br/><p> “That may be so, but…”</p><br/><p> The shopkeeper scratched his head.</p><br/><p> “Alright. Since you’ve steadily made use of our store all this time, I’ll give you up to 5 gold and 40 silver.”</p><br/><p> “As I’ve said before, please give me 5 gold and 50 silver.”</p><br/><p> “Eh, since you don’t want to lose out on even a single penny. Fine, let’s do that.”</p><br/><p> “This is why I like you, mister.”</p><br/><p> Ark chuckled as he pocketed the money.</p><br/><p> In New World, even if stores were from the same village, they each had a different sale and purchase price. The prices were always inconsistent and depended on the inventory or market price. This was the reason why users looked for stores that would pay them more each time. However, Ark had only used one place while hunting in the Jackson area.</p><br/><p> Because of the experiences he had from living in Harun Village for half a month, he knew a bonus was added if he accumulated friendship with the shopkeeper for a long time. </p><br/><p> In the beginning, there were times when it was disadvantageous, but at some point you’ll receive 10% more money when you sell goods. When you buy goods, you also receive at least a 10% discount. In addition, if you first buy an item recommended by the shopkeeper, there were cases where they could give you up to the max 30% discount.</p><br/><p> This piece of information was known to only a handful of Merchants and users.</p><br/><p> “If you need money, rather than selling worthless wares, why don’t you sell those Cat Gloves instead? I’ll give you a good price for them.”</p><br/><p> If he was familiar with the shopkeeper, there were times when the shopkeeper sometimes asked for a particular item. Thanks to these situations, Ark was able to determine the generic value of items even if he didn’t trade with other users.</p><br/><p> “No, I’m fine. I’ll come again next time.”</p><br/><p> Ark finished what he had to do and left the shop.</p><br/><p> “I’ve saved up quite a lot.”</p><br/><p> Ark fiddled with his weighted pocket as he walked on the street.</p><br/><p> He had approximately 60 gold when he left Harun Village, but before he knew it, he had already saved up 120 gold. </p><br/><p> The most costly expenses in New World for users were food supplies and repair costs. On the other hand, it was possible for Ark to save this much because he didn’t spend money for ingredients when he made food, and his repair costs were halved by the Lord’s exclusive Smithy. </p><br/><p> However, the time had come to end those privileges.</p><br/><p> “So it’s finally time to leave Jackson.”</p><br/><p> By hunting in the Shadow Forest, Ark had finally reached level 30. The Rotting Wolves and Zombies were no longer much help in increasing his experience. Although the experience the level 30 Ghoul’s gave were still okay, they were low in numbers. Be as it may, he still couldn’t hunt the level 50 Reapers. It seemed like he had to move his hunting ground soon and look for a new quest.</p><br/><p> “Before that, there’s a skill I’ve got to learn.”</p><br/><p> It was the repair skill.</p><br/><p> There were only five Smithies in Jackson. Near one of those places, there was the sole master NPC who taught the repair skill.</p><br/><p> However, he didn’t know the exact location.</p><br/><p> They didn’t go around wearing name tags just because they were master NPCs, so users were forced to personally wander around as they conversed with other NPCs, one by one.</p><br/><p> But who was Ark?</p><br/><p> ‘When did I have time to waste like that?’</p><br/><p> “Hey, Thomas. It’s been awhile.”</p><br/><p> As Ark waved his hand, Soldiers who’d been passing by rejoiced and approached him.</p><br/><p> “Ark, we haven’t seen you in for few days. When did you return?”</p><br/><p> “A little while ago. But do you happen to know a Blacksmith in the village who’ll teach the repair skill?” </p><br/><p> “Are you talking about Norton? I know him. Go that way and cross the bridge, it’s the first Smithy you see. But what are you going to do by learning the repair method? If you go to the castle, old man Corn fixes them for you cheaply. And even if you learn the repair method, it’s not like you can fix them well right away. It’s better to leave them to old man Corn.”</p><br/><p> “I’m thinking of leaving to go on a journey for a few days in a faraway land. Since it’ll be rough if I overlook it, I’m gonna learn it while I’m in the village.”</p><br/><p> “Faraway?”</p><br/><p> Thomas nodded as he looked at him sadly.</p><br/><p> “Well, you are an outsider. Then be sure to at least visit the Lord before you leave. Stop by at our barracks too, okay?”</p><br/><p> “Alright.”</p><br/><p> Ark waved at the parting Soldiers and turned around.</p><br/><p> At the sight, users in the area had perplexed expressions on their faces.</p><br/><p> For the most part, Soldiers weren’t that friendly toward a user. They considered the user an existence whose only purpose was to cause trouble in the village. There wasn’t a single user who had heard a Soldier asking them to visit the barracks. </p><br/><p> It was only possible for Ark, who was a friend to the young Lord.</p><br/><p> In any case, Ark wasn’t interested in the reactions of the users. Even if it was a small number, the only people Ark wanted to befriend were NPCs.</p><br/><p> ‘Anyway, I’ve learned what I needed. Looks like my pocket will become much lighter.’</p><br/><p> A sigh flowed out of Ark’s mouth.</p><br/><p> Understandably, it took money to learn a skill from a master NPC. After looking it up on the forums, it costs 20 gold to learn the repair skill. Repairing wasn’t possible with just the skill. Each material exclusive repair skill tool set was 10 gold. In Ark’s case, it would cost 30 gold since he needed the metal kit, leather kit, and cloth kit sets. </p><br/><p> In total, he had to spend 50 gold to be able to use the repair skill.</p><br/><p> This was the reason why the majority of users couldn’t learn it in the beginning even though it was a useful skill.</p><br/><p> ‘Although it’s money I saved up...’</p><br/><p> His insides soured since he had to use 50 gold of the money he’d scrounged up. </p><br/><p> However, if he went on a journey, the repair skill was absolutely necessary for a user with a profession that required them to hunt. </p><br/><p> If users had to look for a Smithy every time they needed to repair, it would result to spending more money. If they accidentally forgot to repair, there was danger of breaking their equipment. Something precious will still be precious. It seemed all the more precious because he’d wasted money every day on repair costs, whether it was in Harun or Jackson.</p><br/><p> “Come on in. Is there something you need?”</p><br/><p> When he arrived at the Smithy, a middle aged man with a long beard approached him.</p><br/><p> “I’ve come here after hearing that the owner of this place is the appointed mentor of the repairing technique.”</p><br/><p> “Do you want to learn the repairing technique?”</p><br/><p> “Yes.”</p><br/><p> “You’ve thought well. It’s common sense that an adventurer needs the repairing technique. There’s nothing more of a dilemma than having your equipment go bad while on a long journey. Let me see your hands.”</p><br/><p> Norton abruptly grabbed Ark’s hands and quietly inspected them.</p><br/><p> Shortly afterwards, he shook his head back and forth.</p><br/><p> “Alas, though it’s regretful, it doesn’t look like you can learn the repairing technique.”</p><br/><p> “I can’t learn it?”</p><br/><p> “Looks like you don’t know much about it. The repairing technique isn’t something anyone can learn.”</p><br/><p> Norton gestured towards men who were swinging hammers in the Smithy. Unlike NPCs, looking at the random clothes they had on, there was no doubt they were users.</p><br/><p> In the case the repair skill, it wasn’t a skill possible enough to learn with just knowledge. There were also cases where one had to personally try using the skill under the tutelage of an NPC in order to get accustomed to it. It seemed those guys had paid money and were grinding in order to learn the skill.</p><br/><p> “Like those those, in order to handle the tools proficiently, you need the right strength and experience. If you swing your hammer without knowing anything, you’ll just break your equipment instead. That’s why I teach an experienced Knight the technique to handle metal, and experienced Merchant or Alchemist the technique to handle leather and cloth. Even if other people tried learning it, they can’t even use it properly.”</p><br/><p> ‘Does that mean there’s a profession limit on the repair skill?’</p><br/><p> His heart plummeted.</p><br/><p> Ark’s skills had all acquired automatically, or were learned through a quest. Therefore, he’d never considered the possibility of there being a profession limited skill until now.</p><br/><p> Although he’d occasionally seen terms with it being an unsuitable skill on the forum, he’d thought that it was just referring to a profession specialty skill.</p><br/><p> But for the repair skill, which he considered was absolutely necessary, to have a profession limit…</p><br/><p> Ark suddenly thought of the users who had opened stalls within the village.</p><br/><p> ‘Clothes, I will neatly mend your leather armor.’</p><br/><p> ‘I’ll make weapons of every kind and metal armor like new.’</p><br/><p> They were people putting out signs of that sort and doing business.</p><br/><p> Ark had snorted when he saw users receiving repairs from them.</p><br/><p> Although the costs were a little less expensive than the Smithy, was there really a need to pay another person money to help them raise their skill? Also, if he saved some money, he’d learn it himself anyways… Those were his thoughts.</p><br/><p> But now he understood the situation.</p><br/><p> For users incapable of learning the repair skill, they didn’t have the freedom of choice. Although he was about to like his Dark Walker profession regret pressed forward again.</p><br/><p> ‘Dammit, I didn’t think not being able to choose a combat-related profession was this fatal!’</p><br/><p> “Then are you saying that if my equipment breaks in the hunting ground, there’s no way for me to fix it?”</p><br/><p> “By the looks of it, it seems you’re a beginner. Come here,” Norton said as he showed Ark the inside of the Smithy.</p><br/><p> “If repairing was possible with just words, my Smithy would have been ruined long ago, since rascals who learned the repairing technique from me could open stands and repair cheaply.”</p><br/><p> “So it seems.”</p><br/><p> “The real revenue of the Smithy is actually this. If you just have this, anyone can repair equipment.”</p><br/><p> Norton gestured towards merchandises neatly arranged on one side. It was a case labeled with the words ‘Tool Box’ even beginners could use.</p><br/><p> “As long as you have this Tool Box, it’s possible to repair your equipment up to five times, no matter where you are. The General one is used for regular equipment, the Deluxe one for Magic equipment, and the Tool Box of Magic can repair anything above Rare. Of course, you can also repair regular equipment with the Tool Box of Magic, but it wouldn’t make sense to do so. Ah, will you also try using this? They say this oil and whetstone have the effect of raising the performance of weapons and armor for a given period. Isn’t that surprising?”</p><br/><p> However, the price of the Tool Box was...</p><br/><p> Even considering the point that the Tool Box could be used five times, it was a price 1.5 times more expensive than repairing at a Smithy. On top of that, Ark’s equipment was also the so-called Magic equipment, and his mantle was Rare.</p><br/><p> Even if he bought one to keep as a reserve, it would cost him a fortune, 35 gold.</p><br/><p> If he had to spend that much money every time he had used up the five repairs, made his consciousness fade.</p><br/><p> 'Are you telling me I have to squander the money I saved by hunting like crazy all on repair fees?'</p><br/><p> For the first time, he realized New World’s outrageous prices.</p><br/><p> You couldn’t fight without getting hit as you played, so even hunting took money. If you accidentally died and your equipment’s durability was completely drained, it would take several times the money. The better the item, the more money it would take.</p><br/><p> Ark hadn’t known about the hardship users had.</p><br/><p> He’d always received a 30 percent discount in Harun Village, and in Jackson, he received repairs for half the price at the Lord’s castle. He’d never had to squander a considerable sum on repair fees. For the first time, he could understand the feelings of the people who entrusted repairs to a user in order to save even one penny.</p><br/><p> ‘If they go hunting and can’t fish out an item, they’d be hard-pressed to buy even one wheat bread.’</p><br/><p> Be as that may, he couldn’t just break his equipment because he begrudged the repair fee. With tears in his eyes, Ark pulled out the money as he trembled. However, he couldn’t bring himself to pass it over and stopped.</p><br/><p> ‘This can’t be. For me to so easily give up the money I saved like that…!’</p><br/><p> In reality, there was no part-time job that Ark hadn’t done before.</p><br/><p> From general store to door-to-door sales, he was also knowledgeable in the business field. If there was one thing he’d learned from doing those jobs, it was that it was stupid to buy merchandise for the asked price.</p><br/><p> Bargain, bargain, and bargain again. At the very least, when the shopkeeper said he’d suffered a loss, then you’d know you’d just barely bought it at the proper price.</p><br/><p> “Can you perhaps make a discount for me?”</p><br/><p> “Don’t say something ridiculous. Because there’s so many rascals repairing for half of our price in this area these days, I’m barely making a living by selling this. Are you telling me to starve and die?”</p><br/><p> “But because I’m so poor right now…”</p><br/><p> Ark tried putting on the most wretched expression.</p><br/><p> It wasn’t even worth trying.</p><br/><p> “I can’t consider the individual circumstances of travelers like you. Well maybe. If you were to purchase the merchandise in bulk, I could make a small discount...”</p><br/><p> “In bulk? How many are you talking about?”</p><br/><p> “I wonder? If you buy about 100 of them, I’ll give you up to a 5 percent discount off the price. Sometimes there are merchants or travelers who save up money and buy like that. If you’re short on money, why don’t you try that as well.”</p><br/><p> Ark’s eyes flashed. It was because the keen sense beaten into him by a destitute life had caught the scent of money.</p><br/><p> “I see. I understand. I will come again.”</p><br/><p> Ark quickly left the Smithy.</p><br/><p> Of course, he had no thoughts of gathering users. He didn’t have the confidence to gather scores of users, and even if he managed to gather the users and receive the discount, with 5 percent on 30 gold, it’d only amount to just 1 gold and 50 silver. The discount was too small compared to the effort he’d put in. But for Ark, no, just for Ark, there was another method that he could use.</p><br/><p> ‘It’s possible. It has to be possible. I’m sure there wasn’t something like a Tool Box in the Lord’s exclusive Smithy. That means in the end, they probably buy the Tool Box from another place. Then there’s no rule that says I can’t be the intermediary dealer.”</p><br/><p> Ark shortly sought out the young Lord.</p><br/><p> Then, with his most helpless and miserable expression, he cried out. “My Lord!”</p><br/><p> “Why are you like this? I heard that you were going to leave to another area, but why do you have that sort of expression?”</p><br/><p> “I was going to leave. However, a small problem came up. I couldn’t cope with what I should do, so I sought the Lord out in order to at least consult with you.”</p><br/><p> “A problem? If it’s something I can help with, tell me.”</p><br/><p> ‘Huhuhu, I’ve got him.’</p><br/><p> Ark had a satisfied smile as he chattered rapidly.</p><br/><p> “Actually, I was going to go on a faraway journey with people I know this time. Buying the necessary goods was entrusted to me. But I accidentally went and ordered too much of the wrong item. Later on, I tried to cancel the order because I knew I’d made a mistake, but the shopkeeper had already gone and made the order so I had to carry the responsibility. The teammates who heard the news all said it was my fault and just ran off… waah!”</p><br/><p> “They betrayed their teammate and ran away just because of that? Aren’t they men who don’t even know of loyalty!”</p><br/><p> As expected, the perfectly rigid young Lord was infuriated, like it was his own problem.</p><br/><p> “You can’t blame them. It was all my fault.”</p><br/><p> “It’s because you are too kind. In the first place, for you to do such a chore… no, it’s fine. It’s useless to say something like that now. So tell me. What exactly did you order on accident?”</p><br/><p> “It’s the Portable Tool Box.”</p><br/><p> At Ark’s reply, the young Lord soon put on a smooth smile.</p><br/><p> “Aah, what a relief. If it’s an item like that, I think I will be able to help.”</p><br/><p> “Huh? From the Lord?”</p><br/><p> “That’s right. There’s a Smithy in the castle, but it can’t make the Portable Tool Box. That’s why every time an expedition goes out, it’s an item we purchase separately. What good timing. Our stock has been falling, so I shall purchase them all. No, I may as well procure 100 each of the General and Deluxe. That way, your face will also stand out to the shopkeeper. The bill is of no consequence.”</p><br/><p> “If you do that, I would feel too sorry…”</p><br/><p> “Think not of it. Didn’t I say this? That I would help you anytime if you needed it.”</p><br/><p> “Thank you so much!”</p><br/><p> The young Lord immediately pulled out a check worth 2500 gold.</p><br/><p> A new stat he hadn’t even imagined formed along with cheerful music.</p><br/><p>  </p><table border=\"1\" cellpadding=\"0\" cellspacing=\"3\"><tbody><tr><td><br/><p> A new stat has been formed.</p><br/><p> The Art of Communication (+5): You are able to achieve what you want with an ornate way of speech. The higher the skill, the easier you can persuade your target, and you can drag out an even greater benefit. </p><br/><p> Stat distribution is impossible, and will only increase when you have succeeded in a negotiation, a bargain, or a special deal.</p><br/><p>  </p></td></tr></tbody></table><br/><p> Ark, who received the check, was smiling from ear to ear.</p><br/><p> He’d thought it might be possible, but he hadn’t even imagined that the problem would work itself out.</p><br/><p> The discount he would receive at the Smithy was 5 percent. Simply buying the wares with 2500 gold and delivering them would yield 125 gold. It was like finding a pot of gold on a clear day. </p><br/><p> However, being satisfied with the gains in front of your eyes was something beginners do. The greater a profit you earn, the more profit you need to rake in.</p><br/><p> Ark found Norton and extended the check.</p><br/><p> “General and Deluxe, 100 of each. How long will it take?”</p><br/><p> “100 each? And the delivery is to the Lord’s castle?”</p><br/><p> “Yes. But if it’s this much, don’t you think you should give me a 10 percent cut?”</p><br/><p> Ark slowly began to make the arrangements for bargaining.</p><br/><p> “10 percent, you say! What nonsense! Then I’ll acquire a loss when I sell it. However, if you’re on familiar terms with the Lord, in consideration of the next deal, I can make up to a special 6 percent cut for you.”</p><br/><p> “Alright. 8 percent! If you sell 200 of them in one transaction, won’t a fair amount be left?” </p><br/><p> Ark suggested as he waved the check in front of Norton’s eyes. Norton, whose eyes moved to follow the check, finally blew out a sigh.</p><br/><p> “Alright. I’ll give you a discount of 7 percent. In exchange, I have two requests.”</p><br/><p> “What are they?”</p><br/><p> “One is that you have to take the discounted amount in merchandise rather than money, since the bill you’re paying with is a check. Of course you have to give in that much.”</p><br/><p> “I understand. And the other one?”</p><br/><p> “Actually… the materials for making the Tool Box have decreased, so I can’t deliver 200 of them right away. A special material to produce the Tool Box. I roughly have enough of the other materials, but I’m short on the material called Ailard. I’ll do it if you go acquire some of that.”</p><br/><p> “Where do I need to go to get it?”</p><br/><p> “Ailard is an item that only a capable Alchemist can make. The Alchemist who does business with us is Raymond. But because his health has fallen these days, so he told me he couldn’t go out and acquire the materials he needs for making the Ailard. He sent in a request to introduce him to a useful adventurer. So go find him first. He’ll know if you tell him that I sent you.”</p><br/><p> “I understand. But if I have to go acquire the material of the item I’m buying myself…”</p><br/><p> “What a vicious fellow you are. I lost, I’ve lost. I’ll give you 8 percent.”</p><br/><p> “Thank you very much. And I’m just saying this in case, but to the Lord…”</p><br/><p> “I’m a shopkeeper too. Don’t worry about that.”</p><br/><p> Ark, who received Norton’s assurance, went looking for Raymond. Just as he’d heard, Raymond greeted Ark with a haggard and pale face.</p><br/><p> “You said Norton sent you? Although he acted like he hadn’t heard until now… well, it’s about time that the Ailard has dwindled.”</p><br/><p> After explaining his personal musings, Raymond nodded.</p><br/><p> “The material you need to find is a mineral that looks like a red mushroom. It can only be acquired in a cave located deep within the Gran Swamp. You’ll probably have to go all the way to the end. But keep one thing in mind. That is an extremely precious mineral. You must keep all information concerning the mineral a secret from other people. Do you understand what I’m saying?”</p><br/><p> *Thu-thu-thump* </p><br/><p> A quest information window came pouring in like the flow of a tide.</p><br/><p>  </p><table border=\"1\" cellpadding=\"0\" cellspacing=\"3\"><tbody><tr><td><br/><p> Alchemist Raymond’s Request</p><br/><p> Alchemist Raymond of Jackson is producing Ailard for the Smithy.</p><br/><p> However, he cannot acquire the necessary material because he has fallen ill, so he has requested for you do the job. </p><br/><p> Raymond has urged you multiple times to not disclose any information regarding the mineral to anyone. </p><br/><p> As per Raymond’s request, you must guard the secret until the completion of the quest. You cannot be in a party.</p><br/><p> Difficulty: F</p><br/><p>  </p></td></tr></tbody></table><br/><p> ‘So a quest can show up like this, too!’</p><br/><p> Who would’ve known that his plan to get the Tool Box for free would have been connected to a quest!</p><br/><p> ‘Is it a quest that’s only given to a person who orders several hundred of the Tool Box by himself? Then there probably aren’t many people who have done this quest in the early stage.’</p><br/><p> Catching the mice after getting behind was no different.</p><br/><p> If it was difficulty F, it seemed it’d be possible to manage it himself.</p><br/><p> Ark agreed to the quest without hesitation. If just this quest was taken care of, he could cut 8 percent off the Tool Box price. The money alone that would fall into his hands was a whopping 200 gold! Since he’d get 10 Tool Boxes of Magic for free, there was no reason to decline.</p><br/><p> Ark received a mark on his map and received a recovery potion and wheat bread, as well as 2 Deluxe Tool Boxes through his eloquent way of speaking, as advance payment. After packing them, he headed towards the Cave of the Gran Swamp.</p><br/><p>  </p><br/><p>***</p><br/><p> “Bat, go survey the inside of the cave and come back.”</p><br/><p> “I got it, Master.”</p><br/><p> At Ark’s words, the Bat flapped as it flew into the cave.</p><br/><p> When he passed through the Gran Swamp, Ark was level 32.</p><br/><p> The Gran Swamp was a day away from Jackson and was a place inhabited by all kinds of swamp monsters. Even so, it wasn’t difficult because he’d raised his level quite a lot in the Shadow Forest, but the Slime was still a fatiguing opponent. Its body was made of acidic phlegm, so every time he fought it, his equipment durability dropped bit by bit. If he hadn’t come with the Tool Box packed, he would have had to go in and out of the village countless times.</p><br/><p> ‘Dammit, though one Tool Box is that expensive…’</p><br/><p> If a battle broke out with a Slime, he worried more about the repair fee than his Health.</p><br/><p> ‘Anyways, it looks like I wasn’t the first to discover this dungeon,’ Ark muttered regretfully.</p><br/><p> An explanation about the cave had popped up, but a bonus didn’t come in.</p><br/><p> Even a dungeon was cleared out once, monsters and item were likely to spawn again when time passed. But if you were unlucky, you might not be able to fish out anything. However, Ark didn’t worry that much about it, since his most important goal was to finish the quest anyways.</p><br/><p> ‘Since it’s a job worth 200 gold, I can’t be too cheap.’</p><br/><p> Just then, the Bat came out of the cave.</p><br/><p> “Master. There’s 1 person.”</p><br/><p> “A person? You mean a stranger?”</p><br/><p> “Yeah. He’s coming out this way.”</p><br/><p> Wariness settled in Ark’s eyes.</p><br/><p> You had to be more wary of a user than a monster. The saying that mankind’s natural enemy was himself didn’t just apply in reality. It was more so particularly in a remote place like this. In a place where there was no one to help, if he got caught in a high level’s PK ambush, he’d suffer without a squirm and that would be that.</p><br/><p> Ark waited with a tense face and soon someone walked out of the cave.</p><br/><p> As Ark confirmed the face of the other person, his eyes widened.</p><br/><p> “... You—you are?”</p><br/><p> The other person also recoiled as he took one step backwards.</p><br/><p> The Warrior wearing plate armor was Andel.</p><br/><p> The name he’d screamed countless times as he ground his teeth!</p><br/><p> Andel must have recognized Ark because he stepped back as he winced. Then, as if he was thinking of something, his eyes rolled back and forth. He was deliberating on how he should respond. After a long time, Andel must have decided because he furtively raised the corners of his mouth and began speaking.</p><br/><p> “Ah, I thought you were someone I’ve seen somewhere. You’re the person I partied with before. Did you say your name is Ark?”</p><br/><p> Ark silently nodded his head.</p><br/><p> He wouldn’t be satisfied even if he could immediately beat the shit out of this bastard. Well, how long had he actually waited to do just that?</p><br/><p> However, Ark suppressed his anger and endured it for now.</p><br/><p> He hadn’t checked how strong the guy had become yet. If he thoughtlessly followed his emotions, he could be the one to suffer instead. He also wanted to see how Andel would approach him.</p><br/><p> “You were Andel, right?”</p><br/><p> “So you do remember.”</p><br/><p> ‘Would you be able to forget if it were you?’</p><br/><p> Ark barely managed to swallow back the curses that surged up.</p><br/><p> “That’s good— I wanted to meet you once again.”</p><br/><p> “Me…?”</p><br/><p> “Yes, because it looks like I’ve made a big mistake. Who would’ve known your stats would decrease every time you die? After hearing about it, I went to Harun Village because I wanted to apologize. But you weren’t there. I worried that you might’ve given up on the game, but since you’re all the way here, looks like you’ve raised your level quite a lot?”</p><br/><p> ‘You didn’t know? Apologize? You will soon, you damn bastard!’</p><br/><p> In the end, what Andel was curious about was Ark’s level. It wasn’t possible to tell how his attitude would transform if he decided Ark’s level was lower than his own. Ark answered vaguely.</p><br/><p> “Well, just leave it at that. To be sure, I was extremely upset at that time. I even thought about whether I should really quit the game. But there’s a circumstance that makes it so I can’t quit, so I’m doing whatever I can.”</p><br/><p> “You haven’t been misunderstanding it, right?”</p><br/><p> “Huh? Misunderstanding what?” Ark feigned innocence as if he didn’t know what Andel was talking about.</p><br/><p> Andel scanned Ark up and down with a somewhat relief expression.</p><br/><p> With the Black Bear Mouse’s Leather Armor, Cat Paws, and the frayed helmet and shoes he’d picked up in the Shadow Forest, no matter what his ability was, as far as outside appearances went, he looked no different than a beggar.</p><br/><p> The only thing worth considering was the Blood-red Mantle flapping behind his back!</p><br/><p> Due to the enormous penalty from the Mantle, he couldn’t wear it while hunting, but he’d equipped it just in case after hearing the Bat’s words that a user was coming out.</p><br/><p> Nevertheless, he wasn’t at that great a level. The Andel’s eyes, who’d made that judgement, glinted slyly. </p><br/><p> “Ark-nim, if you have time, would you perhaps like to enter the dungeon with me?”</p><br/><p> “The dungeon?”</p><br/><p> “I discovered this dungeon as I was passing by, but it’s a little difficult alone, so I was going to come later with a person I know, but since Ark-nim is here, I think it’ll work even if we go in. How about it?”</p><br/><p> “I wonder.”</p><br/><p> As Ark purposely pretended like he couldn’t decide, Andel spoke up quickly.</p><br/><p> “If an okay item comes out in the dungeon, I’ll give it to Ark-nim.”</p><br/><p> “If you do that, I’ll be sorry.”</p><br/><p> “No, let’s do it like that since there’s the happening from last time. Yes?”</p><br/><p> “Well, if you put it that way, then...”</p><br/><p> Ark nodded. He couldn’t known what Andel was secretly plotting, but Ark didn’t want to let the bastard go. Even if he couldn’t win by any chance, if he couldn’t at least cut a knife scar in Andel’s side after seeing the opportunity, it was obvious he wouldn’t even be able to sleep.</p><br/><p> For that, it’d be difficult if he made a party with him. There was the quest condition as well...</p><br/><p> “Going in together is good, but to be honest I don’t want to make a party.”</p><br/><p> “It doesn’t matter.”</p><br/><p> Andel accepted readily.</p><br/><p> When Ark finished his negotiation, he look a step and entered the cave, and a read suddenly enveloped his body. Just as Ark raised his head with an alarmed expression, Andel scratched his head with a sheepish expression.</p><br/><p> “Ah, were you surprised? It's just that I was only checking your status window. Since we haven't formed a party, I can only assist properly after finding out Ark-nim's status in advance.”</p><br/><p> 'Does this little shit really think I'm a pushover?'</p><br/><p> Sparks flew from Ark's eyes.</p><br/><p> It was common sense to use the [Detect] function, which allows to check another user's status window, after receiving permission beforehand. If they used the command without permission, one couldn't help but think that there was an ulterior motive. No, it was nothing new, but what definitely showed up were just Health and the main stats.</p><br/><p> The Blood-red Mantle of Dreams was an item that decreased all stats by -15.</p><br/><p> Andel must have thought that Ark's stats were low considering he was a level 32. In addition, there was no doubt Andel had judged that even his abilities and skills were also just as low. It didn't feel good to appear weak, but if it was a wary opponent, it was better to let them underestimate.</p><br/><p> As expected, Andel showed a relieved expression.</p><br/><p> \"It looks like you weren't able to restore all the stats you lost in the beginning.\"</p><br/><p> \"I just leveled up without knowing. Although I've already changed my profession, I'm in this state.\"</p><br/><p> \"What did you do as your job-change?\"</p><br/><p> “It is Thief-related.”</p><br/><p> \"Ah, so that's why your Agility and Luck are high. Since I changed my profession to a Warrior, I will take the lead.\"</p><br/><p> Andel pulled out a longsword and raised his shield, and gallantly moved to the front. Showing his back like it was nothing was a sign of his confidence that he could win even if he was ambushed.</p><br/><p> It was proof he had completely lowered his guard concerning Ark.</p><br/><p> 'Hmph, just wait and see. You'll come to regret your judgement.'</p><br/><p> Just when Ark was having thoughts like that:</p><br/><p> \"Master, I don't like that human.\"</p><br/><p> He heard a displeased voice from his shoulder. It was the Bat. Ark had put the Bat on his shoulder, and left the Skull hanging on his side. Since Andel didn't ask, it seemed he thought they were ornaments.</p><br/><p> In any case, Ark felt affection towards the Bat for the first time.</p><br/><p> An ally he could believe no matter the situation— meeting Andel again made him realize anew how precious its existence was.</p><br/><p> Ark exclaimed to the Andel who was showing off his equipment, “Wow, looks like you’ve raised yourself a lot in the meantime.”</p><br/><p> “It’s nothing special. I’m only level 35 now, jeez.”</p><br/><p> Andel sprang into the cave with an arrogant expression.</p><br/><p> There were enormous numbers of monsters gathered within the cave. The Lizardmen or Goblins he’d seen in the Gran Swamp charged at them in swarms. If it were Ark, he would have fought by hiding his body and luring one or two each time, but Andel set his shield in front and rushed in without care.</p><br/><p> Andel, who defeated two of them in an instant, immediately drank a restoration potion and defeated the rest of them as well.</p><br/><p> ‘Hmm, you say that’s level 35?’</p><br/><p> “Eyes of the Cat!”</p><br/><p> Ark activated the skill towards Andel while pretending to use it on a monster. As he expected, the level of Andel, who’d job-changed to Fighter, was a staggering 43.</p><br/><p> On top of that, his defense was enormous because he was equipped with a plated armor and a shield. In actuality, even when he fought three or four monsters, his Health didn’t decrease by much. </p><br/><p> What was more surprising was that Andel’s name was marked in red.</p><br/><p> Chaotic character— in other words, it meant he had a history of having PKed.</p><br/><p> Though well, if it was Andel, it wasn’t something that surprising.</p><br/><p> ‘It was good that I didn’t thoughtlessly attack him after all.’</p><br/><p> However, it was too early to relax. Andel’s ploy was too obvious.</p><br/><p> It was a ploy to use Ark in a dungeon that was difficult to penetrate alone. Saying he would give the decent items to Ark if one ever dropped, was the same as meaning of him saying he would kill him if a decent item showed up.</p><br/><p> ‘Even so, I can’t withdraw here. So I have carefully look at the way he is fighting. The only way I can win against an opponent with an over 10 level difference is by planning a good strategy.’</p><br/><p> Ark meticulously inspected Andel’s movements while fighting halfheartedly.</p><br/><p> Once he saw Ark panting with one monster as an opponent, Andel became even more triumphant and sprang forward wildly.</p><br/><p> It was the typical Warrior’s fighting method of pushing forward with Strength, Stamina, and defense. That was the reason why he couldn’t break through this level of dungeon even though he was a level 43.</p><br/><p> Instead of setting a strategy and handling them one by one like Ark, he set his attack power and defense in front and charged in extravagantly.</p><br/><p> ‘That way might be the answer if it was another game, but this is New World. You still don’t really know New World’s combat. That is my key point of winning.’</p><br/><p> Ark followed Andel’s back as he unremittingly set up a strategy inside his mind. In the first place, since it was a dungeon he’d come to through an F difficulty quest, the level wasn’t that high.</p><br/><p> As the level 43 Andel received Ark’s assistance, the aggravated monsters were soon cleared. And when nearly 2 hours had passed, the two defeated at least a hundred odd monsters and arrived at the last part of the cave.</p><br/><p> “I see the end now. It’s thanks to Ark-nim.”</p><br/><p> “Oh no, there’s not much I’ve done, jeez.”</p><br/><p> “But compared to the difficulty, a worthwhile item hasn’t come out. Although I have to give it to Ark-nim…”</p><br/><p> “Please do not worry about it. And it’s not like we’ve reached the end yet, either.”</p><br/><p> “That’s true. Then let’s hurry and finish it.”</p><br/><p> It was when Andel, who’d finished restoring, stood up.</p><br/><p> *Kuuoooooo!*</p><br/><p> Suddenly, with a roar that shook the cave, a warning message popped up.</p><br/><p>  </p><div></div><table border=\"1\" cellpadding=\"0\" cellspacing=\"3\"><tbody><tr><td><br/><p> - The boss monster Crystal Golem has appeared!</p><br/><p>  </p></td></tr></tbody></table><br/><p> An enormous hand reached out all of a sudden from behind the corner.</p><br/><p> It was a hand that looked like boulder chunks had been clumped together.</p><br/><p> As if led by that hand, a monster with a gargantuan body rounded the corner. It was a Golem made of gathered boulders that gave off a bluish light. The Golem rolled its red eyes, and after scanning Ark and Andel, it loosed a shout with a harsh voice.</p><br/><p> “FOOD!”</p><br/><p> “Be careful!” Andel yelled as he drew up his shield.</p><br/><p> With a loud bang, Andel was pushed back. Ark quickly went behind the golem’s back and stabbed with his sword.</p><br/><p> The Golem however only shrugged it’s shoulder. It did not seem to have received a significant amount of damage.</p><br/><p> When Andel called the status check command, a health bar appeared above the Golem’s head. The Heath that Ark’s attack had decreased was just 1 percent.</p><br/><p> “Ark-nim, please give me support!”</p><br/><p> “If it’s Andel-nim, you can surpass your wound and defeat the Golem!”</p><br/><p> Ark unfurled the Nursing skill as he nodded his head.</p><br/><p> Andel’s sword, who received vigor and courage, and even a minor blessing, struck the Golem as it sliced through the air. With a massive cry, the Golem took a few steps back. At one blow of the Warrior with up to 200 Strength, they could see the Golem’s Health drop significantly.</p><br/><p> “I’ll block from the front, so please guard my back!”</p><br/><p> “Yes!”</p><br/><p> Ark and Andel’s series of attacks unfurled. Andel struck the Golem squarely as he set his shield in front, and as the high Agility Ark sought critical hits from behind the Golem, consecutive attacks unfurled. </p><br/><p> Andel was definitely strong. Due to having his whole body plastered in plate armor, his defense was also considerable, and he must’ve had ample funding because if his Health wore down even slightly, he downed a recovery potion. That was a luxury that Ark, who trembled at even 1 copper, couldn’t even imagine.</p><br/><p> However, the battle was not concluded easily. The Golem was strong to the point of not matching the dungeon’s difficulty, so strong that Ark couldn’t have possibly faced it if he were alone.</p><br/><p> But with the two’s concentrated attacks, the Golem’s Health also steadily neared the bottom.</p><br/><p> At the sight of the Golem wavering, Andel loosed the Warrior-type kill that he’d been saving.</p><br/><p> “Charge, crush of Strength— Warrior’s Blow!”</p><br/><p> Ba-ba-baaang, the Golem took a big step back as its body cracked again and again at the blow.</p><br/><p> When Ark’s attack struck as a critical hit from behind, the Golem finally couldn’t withstand it anymore and collapsed.</p><br/><p> Andel and Ark’s levels simultaneously went up by 1 each.</p><br/><p> Once the Golem collapsed, a single helmet and a mineral in the shape of a red mushroom were dropped as a brilliant burst of light shimmered out.</p><br/><p> “We won!”</p><br/><p> Just then, Andel hurriedly took out and drank a recovery potion.</p><br/><p> He did so even though there wasn’t even one monster around them. No matter how paralyzed he was about money sense, there was no need to handle something he could’ve done with one wheat bread without even a reason.</p><br/><p> Just as expected, Andel suddenly swung his sword toward Ark, who’d approached to check the items. But the Ark who’d been expecting his attack quickly stepped back and glared with a sharp gaze.</p><br/><p> “So now you reveal your true colors.”</p><br/><p> “Mwahaha, then did you really think I’d simply hand over boss-drop items?”</p><br/><p> “No, I didn’t believe you.”</p><br/><p> “Then there’s really nothing to resent me for.”</p><br/><p> “I’ll just ask one thing. Even when I was dying in Harun Village, you knew that the stats were decreasing, right?”</p><br/><p> “Of course. Wasn’t the guy who was tricked without knowing an idiot?”</p><br/><p> “Son of a bitch.”</p><br/><p> “Say what you want, because this time, I’ll make you want to give up the game.”</p><br/><p> Andel’s eyes gleamed with bloodthirst as he charged towards Ark.</p><br/><p> Ark blocked the sword with all his might. Ark’s sword was helplessly pushed back because the strength difference was too great. </p><br/><p> However, Andel’s continuous attacks were all the same. Because unlike Ark, who’d got by studying countless fighting methods in difficult situations, Andel was the type who raised his fighting ability merely through level ups.</p><br/><p> If they were the same level, he probably wouldn’t have even be a match for Ark. But in the game, there was a way to overcome a difference of 11 levels with just ability. In some way or another, the reason this situation was unfolding like a battle was because Ark received an ability bonus of 20 percent in the dark. </p><br/><p> Andel had an expression which seems to be saying he couldn’t understand the situation.</p><br/><p> “You persistent bastard, let’s see how long you can last!”</p><br/><p> Finally, after receiving hits on several occasions, Ark's Health had been slashed by 50%, whereas Andel's Health had only decreased by 20% due to his plated armor.</p><br/><p> Seeing Ark had be overcome, Andel sneered.</p><br/><p> \"Did you think I didn't know anything? When we first walked into the cave, you used a Thief skill 'Detect' on me, right? You stupid bastard, you obediently followed me in even after checking my level. At that time, it was already predetermined you would die. Charge of Strength, Warrior's Blow!\"</p><br/><p> Andel used the skill with a triumphant voice.</p><br/><p> As the skill registered in rapid succession, in one blow Ark entered the critical state as his Health neared zero.</p><br/><p> ‘Now is the time!’</p><br/><p> Ark's eyes flashed.</p><br/><p> It was just as Andel said. When he'd checked the bastard's level, Ark had agonized over whether he should run or not. But he didn’t run.</p><br/><p> The first reason was his hatred toward Andel, the second was he had been sure there was a method to take Andel down. And that a method that could only be used now, while in a critical state.</p><br/><p> “Eyes of the Cat!”</p><br/><p> As Ark's eyes colored with golden light, red points marking Andel’s weak points appeared all over his body. </p><br/><p> Sure enough, perhaps because he was a Warrior who invested while believing only in his level and defense, his entire body was riddled with weak points. As an effect of the skill, his Health also appeared. Andel's consumed Health up until now was just 35 percent.</p><br/><p> But now was the start!</p><br/><p> “Dark Blade!”</p><br/><p> Ark's sword moved fluidly in the dark and lodged itself in Andel's nape.</p><br/><p>  </p><table border=\"1\" cellpadding=\"0\" cellspacing=\"3\"><tbody><tr><td><br/><p> - A critical hit ignoring all defenses has been delivered!</p><br/><p>  </p></td></tr></tbody></table><br/><p> Bewildered, Andel took a step back. Ark succeeded in another Dark Blade attack in an instant as he took one step forward. In the blink of an eye, Andel's Health plummeted by 50 percent.</p><br/><p> Ark's learned skill was a result made of 5 simultaneously overlapping buffs.</p><br/><p> The very first one that applied was the 20 percent ability increase within the dark. The next ones were raising the attack power and critical hit rate by detecting the weak spots with Eyes of the Cat, and the Undying Will and Indomitable Body that were invoked in the critical state swiftly increased the numbers once more.</p><br/><p> The final touch was a Dark Walker's profession skill, Dark Blade!</p><br/><p> It was a skill which ignored defense and raised attack power of critical hits by 150 percent. Although he didn’t defeat the 15 level higher Andel in one fatal hit, with the combined increase from the linked effects, with two attacks he slashed Andel’s Health down by 50 percent.</p><br/><p> The reason why he’d endured without using his Mana until he’d fallen into the critical state was solely for this moment.</p><br/><p> It was an act of burning one’s bridges that only Ark, who had grown from only fierce battles, could use!</p><br/><p> Andel’s face blanched.</p><br/><p> “Gasp, ho-how can this be!”</p><br/><p> Andel urgently used the [Detect] command.</p><br/><p> Then, as he soon checked Ark’s remaining Mana, he heaved a sigh of relief. Due to having used Eyes of the Cat and Dark Blade twice, he didn’t have any Mana left. Whereas Ark’s Health had 5 percent left now, Andel still had 15 percent left.</p><br/><p> “Hng, looks like your last-ditch effort ends here. Since you don’t have much Mana left, you can’t use your skills, either.”</p><br/><p> “Do you really think so?”</p><br/><p> A cold smile touched Ark’s lips.</p><br/><p> “Blood-red Mantle of Dreams!”</p><br/><p> Ark was enveloped as the scarlet mantle suddenly flared out.</p><br/><p> Simultaneously, Ark’s Health had recovered 100 percent. With his Health suddenly restored, Andel had a flummoxed expression. But the truly surprising thing was from then onwards. After that, Andel’s swung sword attacks all deflected off the mantle.</p><br/><p> The ability of the Blood-red Mantle of Dreams to nullify all attacks for 10 seconds! There wasn’t much meaning in monster hunting, but if the opponent was a user, it demonstrated absolute power.</p><br/><p> Andel’s eyes flared with astonishment</p><br/><p> “N-no way… are you saying that mantle was a Rare item?”</p><br/><p> It was true. Ark hadn’t just equipped the mantle to hide his stats. And in order to use the mantle’s ability, which could only be used at night, Ark had purposefully drawn out the time.</p><br/><p> Andel, who realized for the first time that something had gone wrong, hurriedly pulled out a recovery potion.</p><br/><p> Ark’s eyes froze with urgency.</p><br/><p> ‘He can’t. The mantle’s effect is already over. If the bastard drinks the potion, I can’t predict the outcome.’</p><br/><p> “Summon Demon, Bat! No matter what you have to do, block that bastard! If you don’t, I’ll make you eat food without rest for ten days!”</p><br/><p> “Eeeek! No way!” </p><br/><p> As the Bat was summoned, it flew rapidly at Andel.</p><br/><p> And then, it hurled and shoved itself into the mouth of Andel, who’d been trying to drink the recovery potion.</p><br/><p> “You did well. Bat!”</p><br/><p> Ark unfurled his Dual-Blade Combat and toppled Andel. Then he stepped on both of Andel’s hands and raised his sword.</p><br/><p> After smiling coldly, Ark thrust his sword down without hesitation. </p><br/><p> “Kuhuk, y-you little shit… Just wait and see!”</p><br/><p> After those words, Andel sagged weakly. He died and was forced to log out.</p><br/><p>  </p><table border=\"1\" cellpadding=\"0\" cellspacing=\"3\"><tbody><tr><td><br/><p> - You have defeated a level 44 Chaotic player. </p><br/><p> - Fame +30.</p><br/><p>  </p></td></tr></tbody></table><br/><p> Ark released the breath he’d been holding in one burst.</p><br/><p> He’d finally gotten his revenge. And it’d been against an opponent 11 levels higher!</p><br/><p> When the battle tension settled down, an electrifying pleasure swept down his body. The Ark who’d been briefly savoring the pleasure turned around.</p><br/><p> It was for the right given only to the victor, picking up the loot.</p><br/><p> Many penalties were added to Chaotic users.</p><br/><p> One of those was that they lost their equipment at death. When a normal user died, they dropped an equipment item at a fixed probability, but each time a Chaotic user died, they dropped one equipment item no matter what. Steel Greaves at the place where Andel had died.</p><br/><p> “Information window!”</p><br/><p>  </p><table border=\"1\" cellpadding=\"0\" cellspacing=\"3\" style=\"width:100%\"><tbody><tr><td colspan=\"4\">  <br/><p>Steel Greaves</p></td></tr><tr><td colspan=\"1\">  <br/><p>Armor Type</p></td><td colspan=\"3\">  <br/><p>Steel Footwear</p></td></tr><tr><td>  <br/><p>Defense</p></td><td>  <br/><p>50</p></td><td>  <br/><p>Durability</p></td><td>  <br/><p>7/80</p></td></tr><tr><td>  <br/><p>Weight</p></td><td>  <br/><p>30</p></td><td>  <br/><p>Usage Restriction</p></td><td>  <br/><p>At least 150 Strength</p></td></tr><tr><td colspan=\"4\"><br/><p> Steel Greaves made from smelting good quality steel. Although movement is slowed, you can expect excellent defense that cannot be compared to a leather product.</p><br/><p> Agility -5, the penalty is nulled if used by a Warrior-related profession.</p></td></tr></tbody></table><br/><p> Ark, who’d stored the Steel Greaves, also checked the Crystal Golem drops.</p><br/><p>  </p><table border=\"1\" cellpadding=\"0\" cellspacing=\"3\" style=\"width:100%\"><tbody><tr><td colspan=\"4\">  <br/><p>Crystal Golem’s Head (Magic)</p></td></tr><tr><td colspan=\"1\">  <br/><p>Armor Type</p></td><td colspan=\"3\">  <br/><p>Stone Helmet</p></td></tr><tr><td>  <br/><p>Defense</p></td><td>  <br/><p>40</p></td><td>  <br/><p>Durability</p></td><td>  <br/><p>50/50</p></td></tr><tr><td>  <br/><p>Weight</p></td><td>  <br/><p>40</p></td><td>  <br/><p>Usage Restriction</p></td><td>  <br/><p>At least 135 Strength</p></td></tr><tr><td colspan=\"4\"><br/><p> A Golem’s head imbued with the strength of magical crystal. The material quality is strong enough to block an iron mace, and it can clear your mind with the magical strength.</p><br/><p> Option: Mana +100</p></td></tr></tbody></table><br/><p>  </p><br/><p>  </p><table border=\"1\" cellpadding=\"0\" cellspacing=\"3\"><tbody><tr><td><br/><p> Crystal: The Mana-filled mineral that the Crystal Golem had been growing in its body.</p><br/><p>  </p></td></tr></tbody></table><br/><p> It was when Ark had picked up the Crystal. Light spewed from his hand all of a sudden and a new information window opened.</p><br/><p>  </p><table border=\"1\" cellpadding=\"0\" cellspacing=\"3\"><tbody><tr><td><br/><p> Through your Knowledge of Ancient Relics, you have discovered hidden information of the Crystal.</p><br/><p> The Crystal is a blood crystal, one of the Ancient Relics.</p><br/><p> As a blood crystal, an ancient organic mineral that gives the power of healing, it will naturally develop if fragments are buried within a manufactured Golem's body and furnished with nourishment. Because Mana-rich humans were used as nourishment for the Golem, production was banned long ago.</p><br/><p> Bonus for acquiring information of the ancient relic crystal.</p><br/><p> - Knowledge of Ancient Relics +5. </p><br/><p> - Intelligence +5.</p><br/><p> - Fame has increased by 30.</p><br/><p>  </p></td></tr></tbody></table><br/><p>  </p><br/><p>  </p><table border=\"1\" cellpadding=\"0\" cellspacing=\"3\"><tbody><tr><td><br/><p> The quest has been updated.</p><br/><p> Alchemist Raymond's Request = The Secret of the Blood Crystal</p><br/><p> The mineral that Raymond asked you to get was one of the ancient relics, a blood crystal. It seems that Raymond purposefully planted and raised the blood crystal within the crystal golem's body and was supporting it with sacrificial travelers. In order to prevent more sacrifices, you must interrogate Raymond, obtain a confession, and inform a guard of Jackson.</p><br/><p> Difficulty: G</p><br/><p>  </p></td></tr></tbody></table><br/><p> After briefly looking at the blood crystal, Ark turned his gaze.</p><br/><p> Andel’s body hadn’t disappeared yet. When a user died from PvP, there was a penalty of their body not disappearing for 24 hours and they couldn’t log in as well.</p><br/><p> It blocked revenge ploys that had been problematic in online games on several occasions and was considerate of giving the victor time to enjoy their win.</p><br/><p> However, this kind of penalty had more meaning to Ark.</p><br/><p> “Wait and see? Hah, how funny. You picked the wrong guy to mess with.”</p><br/><p>  </p><br/><p>***</p><br/><p> Ark immediately returned to Jackson Castle.</p><br/><p> While he was waiting at the right time near the Quartermaster, Andel appeared with white light.</p><br/><p> As expected, he’d set his resurrection place to Jackson, which was close to the dungeon. It was well worth seeing him standing there robbed of his shoes, barefooted in his plate armor.</p><br/><p> Andel, who noticed Ark, flinched in surprised and his body began to tremble. </p><br/><p> “Y-you, you bastard……!\"</p><br/><p> “Why are you so surprised? Didn’t you say wait and see?”</p><br/><p> Ark sprang up and rushed at Andel.</p><br/><p> Even though users were starting a fight right in front of the village, the Soldiers turned a blind eye.</p><br/><p> That was yet another penalty that Chaotic users received.</p><br/><p> Normally, if users fought amongst themselves near the village, they’d be attacked by a Soldier. However, there were exceptions.</p><br/><p> One was if a normal user were to attack a Chaotic user first. A fight like this was far more advantageous for the normal user. When the normal user was pushed back, all they had to do was flee to the village. But the Chaotic user couldn’t enter the village or chase them in either, and on the flip side, they had no where to run.</p><br/><p> That was the reason why users feared becoming Chaotic.</p><br/><p> Ark beat up Andel without mercy.</p><br/><p> Similar to their previous battle, he landed critical hits continuously in the critical state and became invincible through the mantle’s power when he was in a pinch.</p><br/><p> The stat penalty was doubled if you were killed by a user. Therefore, it meant all of Andel’s stats had been cut by 2. Andel, who also had lowered defense because he even lost the Steel Greaves, crumbled feebly.</p><br/><p> He was a user who wasn’t like Ark who had real skills, but had gotten by through the strength of his stats and items.</p><br/><p> “You mongrel, you’re dead...\"</p><br/><p> Andel babbled nonsense as he dropped more of his armor.</p><br/><p> Ark snickered as he stored the item. Then, after hunting while roaming around the area, he camped at the resurrection site and waited when exactly 24 hours had passed. It seems Andel didn’t even considered Ark might be waiting for him there again. It was truly a delusion.</p><br/><p> ‘Don’t make me laugh, how long do you think I’ve waited for this day!’</p><br/><p> When he fought Andel, who didn’t even have shoes, armor, and had -4 stats, soon he didn’t even need the mantle’s ability. As soon as Eyes of the Cat and Dark Blade went into a continuous combo, Andel collapsed listlessly. The bastard must’ve realized the severity of the situation at last because next time, he didn’t log in even though 24 hours had passed.</p><br/><p> ‘Hah, you’re saying we should see whose patience is greater, right? If the bastard is an applicant, he probably won’t be able to endure not logging in for a few days.’</p><br/><p> For the first time in his life, Ark went as far as to submit a week-long vacation from work.</p><br/><p> ‘If you mess with me, I’ll definitely repay you.’</p><br/><p> “Please, let’s talk a little. I will apologize. Please?” Andel, who’d logged in within 30 hours, spoke submissively.</p><br/><p> After ignoring Andel’s plea and beating him, he dropped gloves. After killing him two more times like that, Andel became completely naked.</p><br/><p> Although Andel tried begging in the end, Ark didn’t say a single word and silently raised his sword. Then, after he immediately started fighting when Andel logged in, making it impossible for Andel to replace his equipment and finish logging in, he rained regular attacks on him and razed him to the ground.</p><br/><p> Ark killed him six times during his vacation and killed him a total of eight times. Of course, Andel lost his plated armor set and even his sword. Then, from the seventh time onwards, there weren’t any equiped items to drop, so he began dropping japtem inside his bag.</p><br/><p> Andel lost 96 stats and became truly penniless, whereas besides the time when he was waiting, Ark focused on hunting and raised his level by 2 instead. It couldn’t even be called a fight anymore, but it got closer to a one-sided slaughter.</p><br/><p> Finally, as if Andel had completely lost motivation, he logged in after a whole two days had passed.</p><br/><p> Now Andel was forced to choose between recovering 96 stats by catching mice, or quitting the game. And no matter what he chose, it was certain that it would make it extremely difficult for him to pass the exam.</p><br/><p> “Alright, it’s not enough yet, but this time I’ll let you off here.”</p><br/><p> Only then did Ark got up from the resurrection site as if he were being generous.</p><br/><p> Ark then turned towards Andel who was slumped with a cowed and despaired face, he growled,</p><br/><p> “If I catch sight of you next time, it won’t end like this. I’m stopping here this time, but if I see you in another place, I’ll kill you until your stats become 1.”</p><br/><p> Andel’s face went white with terror.</p><br/>\n</div>"}