{"title": "Chapter 1", "id": 1, "volume": 1, "url": "http://boxnovel.org/top-management-chapter-1", "volume_title": "Volume 1", "body": "<h1>Chapter 1</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><header class=\"entry-header\"></header></p><div class=\"entry-content content\"><br/><p>TL by Myoni</p><br/><p>Edited by Myoni &amp; Yoni</p><hr/><br/><p>Uhuh… Am I dreaming right now?</p><br/><p>It was the only conclusion I could make as I was sitting in an office I had never seen before.</p><br/><p>It was an incredibly spacious, fine office.</p><br/><p>It was a great sight, but since it felt like I didn’t belong here, I was very nervous. Almost like going into a high-class hotel restaurant with a dress code while wearing stretched out pajamas or a t-shirt that could only be used as a rag and bathroom slippers.</p><br/><p>It was that kind of feeling.</p><br/><p>Must be a dream, right?</p><br/><p>Since there was some sort of hologram-like thing on top of the table, it definitely must be a dream.</p><br/><p>How weird. I didn’t watch a lot of science fiction movies these days, why was I having a dream like this?</p><br/><p>Huh. I could see the clouds outside the window.</p><br/><p>The office was the size of a playground with a window that spanned an entire wall, but there were even clouds floating around outside. It looked like the view you would see from an airplane… Were those really clouds? Or a video? If they were real, how high was this office?</p><br/><p>Nah, if it was a view of the world with ‘overtechnology<sup>[1]</sup>‘, the office might even be flying.</p><br/><p>Even though I was quite eager to confirm it, I couldn’t.</p><br/><p>There was a reason why I thought this was a dream.</p><br/><p>Currently, as if I was a puppet, my body was moving without my control. My head turned by itself, gazed at the clouds outside once and then looked down at my watch.</p><br/><p>“Hmmm… It’s almost 2 p.m.”</p><br/><p>Even my mouth moved involuntarily and spoke.</p><br/><p>Although I couldn’t control it, the senses definitely worked. Sight, hearing, smell, touch and although I was not completely sure, from the unpleasant taste of my saliva when I gulped, I think I could taste as well.</p><br/><p>It was a bit frightening. I guess this was what they call a lucid dream.</p><br/><p>“It certainly is. If CEO Jung is ready, shall we start the interview?”</p><br/><p>A pleasant tone. My head turned. I looked at the woman who sat in front of me.</p><br/><p>She seemed to be in her mid-forties. Just from her voice, I imagined a gentle face, but it was the opposite. Short blond hair. The sharp edges of her eyeliner above her wrinkles showed her confidence and her distinct ink black lips drew the most attention.</p><br/><p>Hmm? Black lips?</p><br/><p>Her choice of lipstick was quite unique.</p><br/><p>However, have I seen this woman before? I heard that the figures who appear in the dream have similar appearances of people you know in real life.</p><br/><p>“With pleasure.”</p><br/><p>My lips moved again.</p><br/><p>“But, why did Director Park come all the way here?”</p><br/><p>“Of course, I need to come for CEO Jung’s exclusive interview. Then CEO might even spare a bit more time. Is that not right? I could expect that much considering our relationship.”</p><br/><p>“Haha, certainly. Are you going to conduct the interview?”</p><br/><p>“The interview will be conducted by Reporter Song, I will step in from time to time. I know as much as there is to know about CEO Jung, I thought it would be better to get a young person to think outside the box and get some new information.”</p><br/><p>I then realized that there was a young woman sitting next to Director Park. She was a mixed-race beauty as her small face had various ethnic traits. Even her body was gorgeous. However, under Director Park’s strong presence, she didn’t draw much attention.</p><br/><p>“Introduce yourself, Reporter Song.”</p><br/><p>“Yes! Hello, CEO Jung. My name is Song Song.”</p><br/><p>It was a relief I couldn’t control my body. If not, I may have laughed involuntarily.</p><br/><p>“Nice to meet you, Reporter Song.”</p><br/><p>My body held a conversation with the mixed race beauty. As there was nothing I could do, I couldn’t help, but listen in on their conversation. I carefully looked at whatever was in my sight. As it was my first lucid dream, everything was amazing.</p><br/><p>The eyes that were looking at the reporter moved. They briefly passed by something that resembled a computer screen. Even the face that appeared for a second on its shiny black surface. Although it was brief, I saw it.</p><br/><p>It was my face only it looked around twenty years older.</p><br/><p>So that was why I was able to comfortably talk with Director Park.</p><br/><p>My body moved. This time, my eyes look down as I fixed my outfit. A suit that looked like what a British gentleman spy would wear. A necktie. A leather watch that clasped perfectly on my wrist. Even the me who does not know much about brands felt that it was very expensive.</p><br/><p>It seemed like I make quite a bit of money?</p><br/><p>For a reporter in a directorial position to call me “CEO Jung, CEO Jung” to curry favor, seemed like I am quite successful in society.</p><br/><p>Some say a dream was the manifestation of your subconscious… It was lucky that it was my dream, if anyone else knew, they would kick their blankets.</p><br/><p>“Now then…”</p><br/><p>The reporter who looked extremely nervous started the interview.</p><br/><p>“If we want to talk about CEO Jung Sunwoo, we can’t exclude your success story. You started from the bottom, stubbornly struggled your way to the top and now you are the CEO of a global management company. You started out in W&amp;U, do you remember your first day at work?”</p><br/><p>“Of course. Even though it has been a long time. I still clearly remember that day. I was struggling to sleep that night when suddenly I got a call to come in to work by 4 a.m. I was unable to sleep a wink and had my brother give me a ride to work.”</p><br/><p>“How was your first day as a member of society?”</p><br/><p>“Ah, that day was truly dynamic.”</p><br/><p>“In what way?”</p><br/><p>“When I applied to work in the Management Business Department, I was sure I was going to work with actors. I loved movies and dramas and my dream was to raise an international actor with my two hands. I even appealed that point strongly in the interviews…”</p><br/><p>Then?</p><br/><p>“When I finally arrived, I was assigned to a girl idol group who debuted two years ago.”</p><br/><p>What?</p><br/><p>Did I get really stressed because of my first day of work?</p><br/><p>Was that why I am having this dream?</p><br/><p>In reality, I really did have a job interview with W&amp;U, got accepted and was awaiting my first day of work. It was also true that I wanted to be assigned to an actor.</p><br/><p>The reason that I applied at W&amp;U was also because they had a broad array of actors. Among those, there were a few with statuses similar to Hollywood actors with their box-office hits in the Chungmuro Avenue<sup>[2]</sup>, some, although they played a small role, even acted in Hollywood.</p><br/><p>After getting accepted into W&amp;U, I was so excited and worried about what actor I would be assigned to the point where I had trouble sleeping.</p><br/><p>But out of nowhere, a girl group?</p><br/><p>Although I wasn’t sure of the name, I knew that there was a girl group associated with W&amp;U. Since their establishment, they were strictly an actor management company, but a few years ago, they started to expand their lineup with idol groups.</p><br/><p>Although they say the idol industry was like a red ocean<sup>[3]</sup>, as long as you could stay afloat, the revenue was good.</p><br/><p>They first contracted an 11-member boy idol group and as if they had saved a country in their past life, they were a huge success as soon as they released their first album. I had read in a W&amp;U article that they were known as the Monster Rookies and that year they had won every rookie award.</p><br/><p>I couldn’t think of the name of the group, but I did remember their nickname. Since elementary school children were crazy about them, they were nicknamed ‘ChoTongLeong<sup>[4]</sup>’.</p><br/><p>That year they were able to earn more than their initial investment and were raking in money.</p><br/><p>As W&amp;U was greatly encouraged by their success, they decided to reinvest the revenue earned from the boy idol group and began an in-house system to earnestly raise new recruits. They soon revealed a new idol group.</p><br/><p>That was all I knew. As I didn’t read anything about them in the W&amp;U articles, I guess they flopped. As I wasn’t really interested in them, I never looked them up.</p><br/><p>Since I was going to be assigned to an actor, not a girl group.</p><br/><p>“I guess that was the fateful encounter with Neptune.”</p><br/><p>Neptune?</p><br/><p>Its name reminded me of a once-famous TV animated beautiful female warrior.</p><br/><p>“I guess you were quite flustered at that time.”</p><br/><p>“As soon as I heard it, I thought I was doomed. If you look at the results, it was a failure. I was completely blacklisted on my first day.”</p><br/><p>“What? You were blacklisted?”</p><br/><p>“That time I had just taken my first steps in the ‘real world’ and it definitely must have shown on my face that I wasn’t happy with the arrangements so there was no way my first impression was good. If I think about it now, from that moment, I stepped onto the path of hardship. Although they say I stubbornly struggled my way to the top, if I didn’t get off on the wrong side of the bed on my first day, it wouldn’t have been that bad.”</p><br/><p>“…Woah, Jung Sunwoo!”</p><br/><p>My head was heavy and my chest felt tight. It felt like I was underwater for a long time and finally came up to breathe. As I looked down, I saw a seat belt tightly pressing down on my chest. I undid the seat belt and coughed.</p><br/><p>The person next to me patted my shoulder.</p><br/><p>Who was it?</p><br/><p>Ah, my brother. Thick horn-rimmed glasses and a plain face. It was my brother. As I looked at my surrounding, there were no traces of a large, fabulous office.</p><br/><p>It was the inside of my brother’s car.</p><br/><p>“What?”</p><br/><p>“What do you mean what. We’re here. As a guy on his first day of work, you should get your head in the game. You can’t stare blankly in front of your sunbaes<sup>[5]</sup>. I am not sure about managers, but in any job, a new recruit needs to be quick on their feet.”</p><br/><p>“I wasn’t staring blankly; I think I just dozed off.”</p><br/><p>“Like hell , ou were dozing off, you were talking to me just ten seconds ago. Your eyes were open as well.”</p><br/><p>What?</p><br/><p>“What are you talking about. I even had a dream.”</p><br/><p>“You’re telling me you fell asleep in ten seconds and even had a dream?”</p><br/><p>Hyung smirked. Even when I thought about it, it was weird.</p><br/><p>However, I definitely had a dream. Not just a regular dream, I had a lucid dream. I could clearly remember the events that unfolded in my dream.</p><br/><p>An enormous office. An older me. Director Park. Reporter Song. Girl Group Neptune, who debuted two years ago.</p><br/><p>But I was talking normally just ten seconds ago? Was it even possible to fall asleep suddenly even if I wasn’t narcoleptic?</p><br/><p>How weird.</p><br/><p>“Maybe I fainted because I was too tired… even the dream was strange.”</p><br/><p>“What kind of dream?”</p><br/><p>“I was the CEO of a management company.”</p><br/><p>“That’s a lucky dream!”</p><br/><p>“No, only that part was good. I was taken back when I was interviewed about my past… on my first day of work, I was assigned to a girl group instead of an actor. And I was blacklisted by a sunbae… Damn it. It was definitely a silly dream.”</p><br/><p>My brother laughed as air escaped from his lungs.</p><br/><p>“Girl group? That’s not bad. I think that will be fun.”</p><br/><p>“Like hell it will be fun.”</p><br/><p>“You’re good at taking care of kids. Wouldn’t it be similar?”</p><br/><p>“Nonsense. And I don’t really want to be a manager of an idol group.”</p><br/><p>It was not that I didn’t like idols. Girl groups were nice. They were pretty, cute and sexy. How great was that. However, I don’t want to be their manager. I felt that raising an idol group would be similar as being a cog in a factory machine. Idols would just be the standardized product from that factory.</p><br/><p>On the other hand, raising an actor felt like a handcrafted product. It didn’t matter if he was respected by the public or not, he would still be a one-of-a-kind work of art.</p><br/><p>Of course, that was only my opinion.</p><br/><p>“As long as you are working for them, I hope you get assigned to an actress that you like. Wish you luck.”</p><br/><p>“Hopefully.”</p><br/><p>I checked my watch and opened the car door.</p><br/><p>“I’m gonna go to work now. Since it’s your first day, you should go early and understand the situation.”</p><br/><p>“Okay. I’ll call you when I’m done. Let’s have a drink tonight?”</p><br/><p>I asked my brother as I made a shot drinking gesture.</p><br/><p>“What time is it now?”</p><br/><p>“Early morning… 3:30?”</p><br/><p>“You’re starting awfully early today and you think you’ll be able to leave on time?”</p><br/><p>My brother and I laughed wholeheartedly.</p><br/><p>It was still dark outside. As if dark clouds covered the stars and the moon, the sky was gloomy. There was still a lot of time before the day brightens up. Although I knew that in this industry there were no regular start and end times, but I never imagined I would go to work this early in the morning.</p><br/><p>“Anyways, I’ll call you when I can. Thanks for the ride, brother.”</p><br/><p>“Sure. Fighting!”</p><br/><p>As I got out of the car, the cold, stale morning air completely woke my mind up.</p><br/><p>After stretching, I made my way through the forest of building in Cheongdam-dong<sup>[6]</sup>.</p><hr/><br/><p><sup>[1]</sup> Overtechnology seems to be a VR type technology the author made up</p><br/><p><sup>[2]</sup> Chungmuro Avenue is known as the street of culture, artists and film in Korea</p><br/><p><sup>[3]</sup> Red Ocean is a term to define cutthroat markets, where companies try their best to outperform their competitors</p><br/><p><sup>[4]</sup> ChoTongLeong is a word made up from Cho (from Elementary School) TongLeong (from President) meaning President of Elementary Schoolers</p><br/><p><sup>[5]</sup> Sunbae mean senior in a professional environment</p><br/><p><sup>[6]</sup> Cheongdam-dong is a ward of Gangnam district, a very wealthy area in Korea</p>\n</div>\n<div style=\"max-width: 870px;margin: 5px auto;background: repeating-linear-gradient( 45deg, #fff6cc, #fff6cc 5px, #f3ecc7 5px, #f3ecc7 10px );\">\n<!-- Composite Start -->\n<div id=\"M562762ScriptRootC864255\">\n</div>\n<script async=\"\" src=\"https://jsc.mgid.com/m/e/media.boxnovel.org.864255.js\"></script>\n<!-- Composite End -->\n</div>\n<hr class=\"chr-end\"/>\n<div class=\"chr-nav\" id=\"chr-nav-bottom\">\n<div class=\"btn-group\">\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/top-management-chapter-0-prologue\" id=\"prev_chap\" title=\"Chapter 0 - Prologue\">\n<span class=\"glyphicon glyphicon-chevron-left\"></span>\n<span class=\"hidden-xs\">Prev Chapter</span>\n</a>\n<button class=\"btn btn-success chr-jump\" type=\"button\">\n<span class=\"glyphicon glyphicon-list-alt\"></span>\n</button>\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/top-management-chapter-2\" id=\"next_chap\" title=\"Chapter 2\">\n<span class=\"hidden-xs\">Next Chapter</span>\n<span class=\"glyphicon glyphicon-chevron-right\"></span>\n</a>\n</div>\n</div>\n<div class=\"text-center\">\n<button class=\"btn btn-warning\" data-chr-id=\"201114\" id=\"chr-error\" type=\"button\"><span class=\"glyphicon glyphicon-exclamation-sign\"></span> Report chapter\r\n                        </button>\n</div>\n<div class=\"bg-info text-center visible-md visible-lg box-notice\">\r\n                        Tip: You can use left, right, A and D keyboard keys to browse between chapters.\r\n                    </div>\n</div>"}