{"title": "Chapter 19", "id": 19, "volume": 1, "url": "http://boxnovel.org/top-management-chapter-19", "volume_title": "Volume 1", "body": "<h1>Chapter 19</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><header class=\"entry-header\"></header></p><div class=\"entry-content content\"><br/><p>TL by Myoni</p><br/><p>Edited by Myoni &amp; Yoni</p><hr/><br/><p>Getting hospitalized after fainting from exhaustion or hospitalized after getting hit and breaking some bones, they were the same. Actually, getting hospitalized after getting hit would be better since then I could rest easy and not care about what other people thought. And get compensation.</p><br/><p>“Fuck, do you think you’ll be able to continue to work like this?”</p><br/><p>“Yeah. I think so.”</p><br/><p>That felt good, but those weren’t my words.</p><br/><p>When I turned around, Hyunjo was walking towards us.</p><br/><p>“He’s going to continue to work fine, so you just care about your own future. Why are you here picking a fight with him, when you’re the one who couldn’t do his fucking job? Did he get that girl from Lemon Girls drunk and call the cops on her?”</p><br/><p>“No… Fuck, but still it’s unfair.”</p><br/><p>“What a funny bastard. What’s unfair? There’s a chance right in front of your eyes, would you let it go? Then that bastard’s the idiot. Stop picking a fight with someone’s who doing his job and leave.”</p><br/><p>Whoa… How did all that come from such a small body?</p><br/><p>Hyunjo’s body was exactly half the size of Lemon Girls’ manager. It looked like both his mind and body would break after a hit and he would be carried off on a stretcher. But, it was Lemon Girls’ manager who was pressured by Hyunjo’s spirit.</p><br/><p>Even though Lemon Girls’ manager was panting heavily unable control his anger, he never swung his fists.</p><br/><p>Was the comment about the reporter effective?</p><br/><p>Anyways, we returned to the interview room. Behind us, the manager was still coldly glaring at us. Did we just add fuel to the fire… I didn’t think it would end just like this.</p><br/><p>“I feel like he’s going to wear a hole in the back of my head.”</p><br/><p>“Ignore him.”</p><br/><p>“You don’t think he’ll attack us on our way home, do you?”</p><br/><p>“Don’t worry. You don’t even go home these days.”</p><br/><p>Thaaanks.</p><br/><p>“But are you good at fighting?”</p><br/><p>Hyunjo suddenly asked.</p><br/><p>“Or good at sports? Like boxing?”</p><br/><p>“No. I am not friendly with sports.”</p><br/><p>“Then is your family incredibly rich? If you get hit once, will ten lawyers gather around you?”</p><br/><p>“Sorry? There’s nothing like that.”</p><br/><p>“Then just what were you thinking provoking him like that? His body was like a boar.”</p><br/><p>“I can’t just be put down like that. That would be embarrassing.”</p><br/><p>“You have more guts than I thought. Still, pick your opponents carefully from now on. If you care about getting embarrassed, something really might break.”</p><br/><p>He continued to nag for a while before adding.</p><br/><p>“You can’t be hospitalized. You know we’re busy, right?”</p><br/><p>“Yes… I do.”</p><br/><p>My impression of him was good just a while ago, but he really was the Devil.</p><br/><p>Hyunjo continued after briefly looking behind us.</p><br/><p>“Especially don’t get involved with him. He doesn’t come from a good crowd.”</p><br/><p>“I heard that as well. That rumors about him weren’t good…”</p><br/><p>“It’s not just him, even his superiors are the same. Pure Star Entertainment itself is a company with plenty of dirty rumors. Nothing good will happen if you involve yourself with them, so it’s best to avoid them.”</p><br/><p>I suddenly stopped after nodding.</p><br/><p>“Was that manager just now from Pure Star Entertainment?”</p><br/><p>“Yeah. You didn’t know? Lemon Girls are Pure Star’s group.”</p><br/><p>“The previous company Sung Dowon was in, that Pure Star?”</p><br/><p>“That’s right. Dowon suffered so much from them that he left as soon as his contract ended. At that time, Dowon was pretty much the bread winner of that company so they clung to him for a renewal… That’s why there was some noise when he transferred to our company.”</p><br/><p>What was this?</p><br/><p>I wasn’t expecting this, but the dots were connecting.</p><br/><p>Just when I thought that, my vision went dark.</p><br/><p>Finally!</p><br/><p>If I could move, I would have cheered three times.</p><br/><p>I was in the office I could probably draw with my eyes closed. My office twenty years from now.</p><br/><p>Last time, in the future where I was sitting face to face with Dowon, the surroundings were hazy, but everything was clear this time. The situation was familiar. I was still sitting in the comfy chair and Director Park and Reporter Song were in front of me.</p><br/><p>Wow, Director Park… Now that I saw her again, I was certain she was Reporter Park Yoojeong.</p><br/><p>Although she had aged and her style has changed, her face was the same. But the fascinating thing was her face was definitely Reporter Park Yoojeong, but the feeling she gave off was completely different.</p><br/><p>Was it because of her age? People could even change to this degree.</p><br/><p>“However, CEO originally wanted to be assigned to an actor.”</p><br/><p>Reporter Song opened her mouth.</p><br/><p>The content, of course, as well as the voice and expression, I concentrated on everything I could hear, see and feel.</p><br/><p>“When you were working with Neptune, didn’t you request to move to the actor team?”</p><br/><p>“It wasn’t the right time to ask then. After I was hired, there was a huge incident within the actor team.”</p><br/><p>Just a little, just a little more specifically…</p><br/><p>I was anxiously straining my ears.</p><br/><p>“An incident?”</p><br/><p>“Sung Dowon’s sex scandal.”</p><br/><p>That’s it!</p><br/><p>I was elated as soon as Sung Dowon’s name was mentioned. The reason that his acting career could have been over was because of this sex scandal!</p><br/><p>Wait, but was that something that could end an actor’s career? I could understand if he did drugs or gambled or received a DUI, but sex wasn’t a crime. He would only lose a few of his fans from an incident like that.</p><br/><p>Wasn’t it abnormal for someone with that face, that body and that paycheck to be abstinent?</p><br/><p>Was it not just a regular sex scandal? Did a video circulate?</p><br/><p>“Ah, that really was a mess.”</p><br/><p>Director Park abruptly entered the conversation.</p><br/><p>“A popular actor in his twenties, someone who was free of dating rumors, held a perverted sex party. Among them, there even was a married woman… Since a bomb like that exploded, at that time, it was an enormous scandal.”</p><br/><p>Oh my god.</p><br/><p>“Articles stating that woman was the wife of the president of a company who sponsored Dowon since the beginning or that Sung Dowon was a perverted sex addict started flooding in with a nonchalant attitude towards whether it was true or false. Well, even I wrote a bunch of articles then too.”</p><br/><p>“Then Director Park must have been met with backlash.”</p><br/><p>My future self said with a smirk.</p><br/><p>“Of course. Whew… It was war.”</p><br/><p>Just what was this backlash and what did she mean by war?</p><br/><p>I was so frustrated that my blood was about to flow in reverse when luckily Reporter Song asked.</p><br/><p>“What do you mean by backlash?”</p><br/><p>“About that scandal. An unknown man used a newspaper company and asked W&amp;U and Song Dowon for a fortune. Adultery with a married woman, perverted sex, he said the public would rush to this topic and that if they wanted to quietly cover it up, they would have to pay him.”</p><br/><p>“Ah…”</p><br/><p>“That man had a picture.”</p><br/><p>A picture?</p><br/><p>“A picture?”</p><br/><p>“Photo evidence. So that’s why W&amp;U paid the man to shut his mouth, but eventually an article popped up. The fact that W&amp;U tried to cover it with money and even that there was photo evidence. That’s why Sung Dowon’s image fell to the bottom in an instant.”</p><br/><p>“Well, if that kind of scandal happened twenty years ago, it would have been huge.”</p><br/><p>“It sure was. However, not long after the situation reversed.”</p><br/><p>“Pardon?”</p><br/><p>“The backlash started.”</p><br/><p>“Jung Sunwoo!”</p><br/><p>My mind instantly snapped back.</p><br/><p>Hyunjo who was a few steps ahead of me called.</p><br/><p>What? Was that it? It’s not like it was a shitty drama, did it really end like that?</p><br/><p>Even a shitty drama would tell you when the next episode was, but I didn’t know when I would see this again.</p><br/><p>Are you telling me to die of frustration?!</p><br/><p>“You coming?”</p><br/><p>“Yes. I’ll go in in a sec.”</p><br/><p>“Sure. Come in once you’re okay.”</p><br/><p>I exited the studio with a blank expression.</p><br/><p>I paced in front of the studio for a long while to calm myself.</p><br/><p>Good. Let’s think optimistically.</p><br/><p>If I didn’t have my foresight ability, I wouldn’t have known anything. However, now I knew that Sung Dowon will be caught in the worst sex scandal and that his image would drop to the floor. Also, although I didn’t know why, that the situation would reverse.</p><br/><p>When they said backlash, it would’ve meant that other circumstances came up as well, which meant that there was something that could reverse Sung Dowon’s predicament.</p><br/><p>And the anonymous man W&amp;U made a deal with…</p><br/><p>Why did Pure Star Entertainment make me feel uneasy?</p><br/><p>Dowon definitely said that ‘he would have been caught in their trap.’</p><br/><p>Although it was only a hunch, let’s think through it once.</p><br/><p>Since Sung Dowon was pretty much the bread winner for Pure Star Entertainment, when he refused to renew his contract, they must have been very pissed. During the time they were grinding their teeth at W&amp;U and Sung Dowon, their girl group, Lemon Girls, blew off a big chance after a big incident.</p><br/><p>But, of all people, it was W&amp;U’s Neptune who grabbed that chance, so Pure Star Entertainment must have been more pissed.</p><br/><p>So as a way of saying fuck you, they planned a trap for Sung Dowon…</p><br/><p>Something like that?</p><br/><p>Since Sung Dowon was with Pure Star Entertainment since his debut, there was a high probability that they knew a lot about Sung Dowon’s personal life, even the finer details. Although I didn’t know how much of the sex scandal was true, they could have taken a picture that could be used against him later in secret.</p><br/><p>Did they anonymously approach W&amp;U because they didn’t want to face them head on?</p><br/><p>Or were they scared that Sung Dowon wouldn’t suffer by himself and blab about them?</p><br/><p>They said that even the fact they paid him was revealed to the public. They also knew that these kinds of backdoor deals would stain W&amp;U and Sung Dowon’s image even more and since they kept their anonymity, they could just sit back and enjoy the show.</p><br/><p>Well, it was still only an assumption.</p>\n</div>\n<div style=\"max-width: 870px;margin: 5px auto;background: repeating-linear-gradient( 45deg, #fff6cc, #fff6cc 5px, #f3ecc7 5px, #f3ecc7 10px );\">\n<!-- Composite Start -->\n<div id=\"M562762ScriptRootC864255\">\n</div>\n<script async=\"\" src=\"https://jsc.mgid.com/m/e/media.boxnovel.org.864255.js\"></script>\n<!-- Composite End -->\n</div>\n<hr class=\"chr-end\"/>\n<div class=\"chr-nav\" id=\"chr-nav-bottom\">\n<div class=\"btn-group\">\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/top-management-chapter-18\" id=\"prev_chap\" title=\"Chapter 18\">\n<span class=\"glyphicon glyphicon-chevron-left\"></span>\n<span class=\"hidden-xs\">Prev Chapter</span>\n</a>\n<button class=\"btn btn-success chr-jump\" type=\"button\">\n<span class=\"glyphicon glyphicon-list-alt\"></span>\n</button>\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/top-management-chapter-20\" id=\"next_chap\" title=\"Chapter 20\">\n<span class=\"hidden-xs\">Next Chapter</span>\n<span class=\"glyphicon glyphicon-chevron-right\"></span>\n</a>\n</div>\n</div>\n<div class=\"text-center\">\n<button class=\"btn btn-warning\" data-chr-id=\"201150\" id=\"chr-error\" type=\"button\"><span class=\"glyphicon glyphicon-exclamation-sign\"></span> Report chapter\r\n                        </button>\n</div>\n<div class=\"bg-info text-center visible-md visible-lg box-notice\">\r\n                        Tip: You can use left, right, A and D keyboard keys to browse between chapters.\r\n                    </div>\n</div>"}