{"title": "Chapter 17", "id": 17, "volume": 1, "url": "http://boxnovel.org/top-management-chapter-17", "volume_title": "Volume 1", "body": "<h1>Chapter 17</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><header class=\"entry-header\"></header></p><div class=\"entry-content content\"><br/><p>TL by Myoni</p><br/><p>Edited by Myoni &amp; Yoni</p><hr/><br/><p>Shivers came down my spine as if I had just watched a horror flick.</p><br/><p>Meeting someone you first met in the future in the present was really a strange feeling. How should I describe it? It was sort of like seeing someone pop out of a TV.</p><br/><p>“Mr. Manager is Jung…”</p><br/><p>“Ah, I’m Jung Sunwoo. My business cards haven’t come out yet, so I don’t have anything I could hand you.”</p><br/><p>“Looks like it hasn’t been long since you’ve started working?”</p><br/><p>“Today’s my second day at work.”</p><br/><p>Park Yoojeong was surprised.</p><br/><p>Compared to the dignified Director Park who seemed to have been through a lot, the twenty-something-year-old Park Yoojeong was a bit clumsy and wasn’t good at controlling her expressions.</p><br/><p>For this woman in her twenties who is in the bottom of the food chain to become a strong director in twenty years.</p><br/><p>You really couldn’t tell how one would change in the future.</p><br/><p>“I’m the same as you. I’m a new recruit as well.”</p><br/><p>“Really?”</p><br/><p>“It hasn’t been long since I’ve started. Though it does feel like I’ve worked here for a long time…”</p><br/><p>Yoojeong’s expression looked complicated and tired. Well, to get dismissed by her senior in front of people, if I was Park Yoojeong, I probably would be in a corner talking to myself ‘I’m going to succeed in this dirty world, fuck, fuck’.</p><br/><p>“I look forward to working with you in the future, Miss Reporter. You’ll be the first person I hand my business card to once they come out.”</p><br/><p>“In the future…”</p><br/><p>Yoojeong hesitated before saying.</p><br/><p>“I’m not going to continue being a reporter.”</p><br/><p>“Sorry?”</p><br/><p>“I want to quit. I can’t deal with it anymore. I don’t think it matches me either.”</p><br/><p>“…Really? To me, it looks like you’ll be successful as a reporter.”</p><br/><p>Really.</p><br/><p>She laughed out loud when she heard my words.</p><br/><p>“Ehahahaha! …Cough, cough. Even if they are empty words, thank you.”</p><br/><p>“They aren’t. I’m serious. If I could, I would even bet on it…”</p><br/><p>“You know.”</p><br/><p>She suddenly came closer.</p><br/><p>“…Since I am going to quit anyways, I’ll let you in on something.”</p><br/><p>Her voice quieted down to a whisper.</p><br/><p>“Senior Hwang, Report Hwang Junggu. He’s complete trash.”</p><br/><p>“Pardon?”</p><br/><p>“He’s the type where if you tell him one thing, he’ll write ten things about it. And Lazy who was interviewed before you wasn’t late because he was sick. It became late because Reporter Hwang Junggu gave him the wrong time. When I told him that we had to do Neptune’s interview, he said that Lazy was more important than some new unknown group and to tell them to leave. I was only able to barely convince him by saying they were appearing on Next K-Star and that there was a lot to talk about. For him to push his way in even though he didn’t even know who Neptune was just a while ago, it’s obvious. He’s going to involve Lemon Girls and Next K-Star and write an exclusive article with a bunch of MSG.”</p><br/><p>I blankly stared at her. It looked like she was completely relieved that get that off her chest.</p><br/><p>So… She’s saying Reporter Hwang Junggu is trash?</p><br/><p>“Since W&amp;U is a large company, the PR team will be able to bring the article down as soon it’s up. However, it only takes a moment for Urakkai articles to flood the internet and if that happens, even if your PR team could fly, they wouldn’t be able to handle it. Search Reporter Hwang Junggu and girl group Happy Candy.”</p><br/><p>I took out my phone and looked it up like she said. An article Reporter Hwang Junggu wrote not too long ago popped up. Even the headline made me gasp.</p><br/><p>[New girl group ‘Happy Candy’ unhappy being known as the 2<sup>nd</sup> Seraphic]Happy Candy was a girl group I had never seen before while Seraphic was a well-known top girl group with 10 years of experience. For them to be known as the 2<sup>nd</sup> Seraphic would have brought criticism, but to feel unhappy… Just what were they thinking saying that?</p><br/><p>As expected, the comment section exploded with insults. When I searched the girl group without Reporter Hwang Junggu’s name, several articles came up with only slight deviations to the original content.</p><br/><p>“Did they really say that during the interview?”</p><br/><p>“No. When he asked them, ‘You must not feel good being constantly compared to top seniors like Seraphic,’ they replied, ‘Yes.’”</p><br/><p>The nuance was completely different!</p><br/><p>“When the article was released, their manager came and pleaded him to change the headline, but he was ignored. Their company was small. And this wasn’t the only time.”</p><br/><p>Just where did this trashy guy come from?</p><br/><p>Was this the incident that made the girls receive a lot of insults?</p><br/><p>Considering the influence of an article, it definitely could be possible… Anyways, the girls should be trying their best in the interview right now without knowing anything, I needed to talk to Hyunjo about this and find a countermeasure.</p><br/><p>Ah, I need to thank Report Yoojeong first.</p><br/><p>“Miss Reporter, thank you for the information.”</p><br/><p>“No problem. I am really sorry about the office pantry.”</p><br/><p>“I told you that it was fine. Then let’s meet again next time. Ah, also, I almost forgot…”</p><br/><p>I thought about it before saying.</p><br/><p>“Would I be able to contact you if anything newsworthy comes up?”</p><br/><p>For example, if that Lemon Girls’ manager held a grudge and came swinging his fists at me?</p><br/><p>“Of course. You can just call m… No, I’m telling you I’m going to quit.”</p><br/><p>She gave me a skeptical glance. I smiled and without any more words, ran towards the interview room.</p><br/><p>Inside the interview room, the interview was still going on. When I entered, Seoyoung was explaining every detail of their album concept.</p><br/><p>“Chief, one moment please.”</p><br/><p>“Hmm?”</p><br/><p>I made the most serious expression I could. Hyunjo stopped the interview momentarily and came out. I closed the door and told him exactly what Yoonjeong said a few steps away from the interview room. Hyunjo’s face instantly distorted.</p><br/><p>“You sure? How did you know?”</p><br/><p>I guess it was best to keep it anonymous?</p><br/><p>“I heard it from an insider. This as well.”</p><br/><p>I showed him the article I searched a while ago. Hyunjo who read the article in an instant glared at the interview room.</p><br/><p>“Ugh, that trash reporting bastard really…!”</p><br/><p>“Although it might not be the case, this time, isn’t it best to be prepared?”</p><br/><p>“Of course. It’s too late if we wait until the article is released. I’m going to call PR team leader Park so you go and talk about nonsense and buy some time.”</p><br/><p>I faithfully followed Hyunjo’s orders. When I went back inside, I talked about how the scent of the soap in the washroom was to my preference for 3 minutes.</p><br/><p>Soon after, Hyunjo returned and the interview resumed. I didn’t know what he talked about with Team Leader Park, but he definitely was more careful with the answers. Every little detail about their current condition was answered by Hyunjo.</p><br/><p>Eventually, Reporter Hwang Junggu concluded the interview.</p><br/><p>“Thank you for your hard work. Now let’s go to the studio to take some pictures.”</p><br/><p>“Mr. Reporter has worked hard as well. Please take good care of the article.”</p><br/><p>“Yes, well…”</p><br/><p>We went to the studio that was inside the building and took individual and group pictures that would go up with the article. Afterwards, the interview had completely ended.</p><br/><p>As Hyunjo explained everything on our way back, the van became rowdy.</p><br/><p>“We really could have been in big trouble! I was wondering why this oppa kept talking about the washroom.”</p><br/><p>Seoyoung frowned as she grumbled.</p><br/><p>“That reporter, his questions did seem a bit strange. Does he have some sort of grudge against us?”</p><br/><p>“It’s nothing like that. He’s just trying to write a more provocative article to get more clicks. He doesn’t care what happens to you.”</p><br/><p>“Scary, really.”</p><br/><p>“But will we really be fine? Won’t the article be all weird?”</p><br/><p>As LJ worried, Hyunjo nodded his head as if telling her to relax.</p><br/><p>“Team Leader Park says she’s on friendly terms with their Entertainment Director. She said not to worry as it will be handled without any hiccups.”</p><br/><p>“Really?”</p><br/><p>“If that trash reporter hands in a strange article, they are going to reject him and tell him to write it all over again. He’s not the director or anything so what can he do when his superiors reject his article?”</p><br/><p>It was like I was seeing an aspect of a huge food chain.</p><br/><p>“We will remember that reporter’s name and keep as far away from him as possible from now on, so don’t worry. But, Sunwoo.”</p><br/><p>I was fixing my tangled seat belt when I turned my head.</p><br/><p>“Yes?”</p><br/><p>“Are you just incredibly lucky or is it something else?”</p><br/><p>Of course, it was something else. Well, of course, this time, I really was lucky as well.</p><br/><p>“You’ve been bringing good stuff since yesterday. How did you meet an insider on your way to the washroom?”</p><br/><p>Seoyoung poked her head out as she seconded.</p><br/><p>“Huh? Didn’t you meet Producer Joontae on your way to the washroom yesterday too?”</p><br/><p>“Oh, that’s true.”</p><br/><p>“Wow, wow! It looks like this oppa has a good aura. Let’s stick closely with this oppa. Oppa, just pack your bags and come live with us!”</p><br/><p>My face was hot.</p><br/><p>I mean, it wasn’t like I was the one who said I wanted to, but why were their stares…</p><br/><p>“Seoyoung, it’s time for your medicine. Stop talking nonsense and just sleep if you’re sick.”</p><br/><p>LJ kicked Seoyoung’s seat.</p><br/><p>“It’s not nonsense, there some truth behind it!”</p><br/><p>“Truth?”</p><br/><p>“My mom went to a skilled shaman not too long ago and asked when we would be successful. The fairy said that we would be very lucky at the end of this year. She said a snake will bring luck and to tightly grab hold of it to not lose it.”</p><br/><p>Although Seoyoung made a fuss, the members had no reaction. Seoyoung quickly became glum and mumbled.</p><br/><p>“It’s true… She said we need to grab the snake…”</p><br/><p>But, I did have an idea about the snake…</p><br/><p>“Aren’t you born on the year of the Snake?”</p><br/><p>The traitor who was driving abruptly asked.</p><br/><p>“I was born then. And since we’re both the same age… Right?”</p><br/><p>“Yeah.”</p><br/><p>Hyunjo laughed in the back.</p><br/><p>“Stop it. Why are you guys joking around so much?”</p><br/><p>“It’s not a joke.”</p><br/><p>“What?! Then you both were really born on the year of the Snake?”</p><br/><p>“Yes. 1989, the year of the Snake.”</p><br/><p>“Oh my god.”</p><br/><p>The back was silent for a few seconds before becoming noisy.</p><br/><p>“Euah, creeeeepy…!”</p><br/><p>I silently rubbed my shoulders as well.</p><br/><p>Perhaps this foresight ability was more common than I thought?</p><br/><p>We met with the staff of Next K-Star at night.</p><br/><p>Since it was an expensive beef restaurant, I thought the staff had a large budget, but it turned out the first bill would be paid by W&amp;U. I heard it was incredibly high quality, but because of constantly pouring and drinking alcohol, I didn’t get the chance to truly savor it.</p><br/><p>Fortunately, the atmosphere was very good the whole time. It looked like the members left a good impression on the staff. And they seemed to have shown off their unique personalities.</p><br/><p>The meeting that started at the beef restaurant continued on to the second and third place and we finally ended past 3 a.m. After seeing off the completely drunk producers and writers, we once again got on the van.</p><br/><p>The traitor who protected his liver while Hyunjo and I were constantly receiving drinks took the driver’s seat. After we dropped off the yawning girls at their residence, there were three people remaining like yesterday.</p><br/><p>Wow, that was yesterday… It felt like a month.</p><br/><p>Now that the long day was over, all that was left was to rest at home.</p><br/><p>“You guys worked hard today as well. Tired, right?”</p><br/><p>Hyunjo talked with a slur.</p><br/><p>“Quickly go home and sleep and eat something good in the morning.”</p><br/><p>Was this déjà vu?</p><br/><p>“Come to work by 7. We have a lot to do tomorrow.”</p><br/><p>I didn’t make the same stupid mistake of repeating his words. Only…</p><br/><p>“Chief. Could I just sleep at the company?”</p><br/><p>“Me too…”</p><br/><p>“Really? I’m going to sleep there too. Then let’s go together! The sleeping quarters at the company are pretty good.”</p><br/><p>I laughed as I followed Hyunjo.</p><br/><p>Damn, I need to escape from here as soon as possible.</p>\n</div>\n<div style=\"max-width: 870px;margin: 5px auto;background: repeating-linear-gradient( 45deg, #fff6cc, #fff6cc 5px, #f3ecc7 5px, #f3ecc7 10px );\">\n<!-- Composite Start -->\n<div id=\"M562762ScriptRootC864255\">\n</div>\n<script async=\"\" src=\"https://jsc.mgid.com/m/e/media.boxnovel.org.864255.js\"></script>\n<!-- Composite End -->\n</div>\n<hr class=\"chr-end\"/>\n<div class=\"chr-nav\" id=\"chr-nav-bottom\">\n<div class=\"btn-group\">\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/top-management-chapter-16\" id=\"prev_chap\" title=\"Chapter 16\">\n<span class=\"glyphicon glyphicon-chevron-left\"></span>\n<span class=\"hidden-xs\">Prev Chapter</span>\n</a>\n<button class=\"btn btn-success chr-jump\" type=\"button\">\n<span class=\"glyphicon glyphicon-list-alt\"></span>\n</button>\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/top-management-chapter-18\" id=\"next_chap\" title=\"Chapter 18\">\n<span class=\"hidden-xs\">Next Chapter</span>\n<span class=\"glyphicon glyphicon-chevron-right\"></span>\n</a>\n</div>\n</div>\n<div class=\"text-center\">\n<button class=\"btn btn-warning\" data-chr-id=\"201146\" id=\"chr-error\" type=\"button\"><span class=\"glyphicon glyphicon-exclamation-sign\"></span> Report chapter\r\n                        </button>\n</div>\n<div class=\"bg-info text-center visible-md visible-lg box-notice\">\r\n                        Tip: You can use left, right, A and D keyboard keys to browse between chapters.\r\n                    </div>\n</div>"}