{"title": "Chapter 32", "id": 32, "volume": 1, "url": "http://boxnovel.org/top-management-chapter-32", "volume_title": "Volume 1", "body": "<h1>Chapter 32</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><header class=\"entry-header\"></header></p><div class=\"entry-content content\"><br/><p>Chapter 32: There’s Always a Twist (2)</p><br/><p>TL: emptycube</p><hr/><br/><p>“Nothing leaked because Sung Dowon had been carefully managing himself. When Pure Star started to talk, married women weren’t anything special, he really had all sorts of different fetishes.”</p><br/><p>I felt like I was going crazy…</p><br/><p>What was this?</p><br/><p>So Sung Dowon lied? It was a lie that he attended a party like that for the first time out of curiosity. He had just been lucky to not have his photo taken, his claims that he felt dejected and that he never touched that married woman may also have been lies.</p><br/><p>Wow… The back of my head tingled.</p><br/><p>Why did I worry about him?</p><br/><p>If this kept happening, then I might lose my trust in humanity or turn cynical. My soul had just taken a blow.</p><br/><p>Still, how fortunate was I that I took a long time to decide because I kept recalling Neptune. If I accepted his offer to be his manager right away, I might have difficulty breathing right about now.</p><br/><p>Did I have to consider this bad or good luck?</p><br/><p>“So what happened to Sung Dowon afterwards? It didn’t seem like he moved to China either.”</p><br/><p>“He did work on a few projects in China, but they didn’t work out. I’m not too sure myself. Since there were grounds to blame Sung Dowon, W&amp;U had already terminated the contract before the whole thing blew up.”</p><br/><p>“Ha. No one ever thought… Sung Dowon would end up like that.”</p><br/><p>“Is it Dowon or Neptune?”</p><br/><p>The team 2 leader asked right in front of me.</p><br/><p>“I’m sorry.”</p><br/><p>“… What?”</p><br/><p>“I would like to stay where I am now.”</p><br/><p>I didn’t hesitate as I answered and lowered my head.</p><br/><p>When I looked in front of me, the team 2 leader’s eyes had widened as if unable to believe what he had just heard. Everyone was looking at me with surprised expressions.</p><br/><p>In fact, even CEO Baek Hansung revealed a surprised expression.</p><br/><p>“Hey, Luc… No, Sunwoo.”</p><br/><p>The team 3 leader came up close and said in a worried voice.</p><br/><p>“You… Carefully think about it again. I think you might have made a poor choice because this is your first time making such an important decision out in society and because it all happened so suddenly. What’s at risk is too large to decide with loyalty and affection.”</p><br/><p>The director added in.</p><br/><p>“Yeah. Opportunities like this don’t come often. It’s no use if you regret it later.”</p><br/><p>If this really was an opportunity that is.</p><br/><p>When I was about to reply with a decent refusal.</p><br/><p>The team 2 leader snorted.</p><br/><p>“I’m dumbfounded. Dowon asked you personally and you kick him away? You can’t even eat when we spoon-feed you.”</p><br/><p>When you’re giving me something inedible, do you think I’ll open my mouth happily?</p><br/><p>I slowly calmed by breath and replied.</p><br/><p>“While I do know this is a big opportunity, but maybe it’s because Neptune is the first group I’ve been assigned to, I keep thinking of them. They are only now starting to take a step forward… I wouldn’t feel good if I quit now. I am sorry.”</p><br/><p>I did my best to properly tell them my intentions with the appropriate etiquette.</p><br/><p>When I looked back up with my eyes lowered, Sung Dowon was looking at me a strange look.</p><br/><p>“Have you really decided?”</p><br/><p>“Yes. I am sorry.”</p><br/><p>“… I wanted to work with you. How regretful.”</p><br/><p>I was regretful as well.</p><br/><p>I thought that Sung Dowon had the potential to make it in Hollywood. For his outstanding acting skills to be buried by his dirty scandals… I was sad for his talent that had met a bad owner.</p><br/><p>Sung Dowon didn’t say anything else. Since he fell back, no one else suggested me to think about it again. Only the team 3 leader asked me twice more if I was certain. The team 2 leader didn’t even bother to look at me.</p><br/><p>I folded my thoughts on asking about Lee Songha’s acting teacher. Although my senses weren’t incredibly quick, it certainly wasn’t good to bring it up now. It would be better to discuss it with Kim Hyunjo first.</p><br/><p>The awkward moment hung in the air momentarily before I was asked to leave. I got up from my seat.</p><br/><p>The team 3 leader whispered to me with a complicated expression.</p><br/><p>“You worked hard today. First go home and rest. We can talk about this again later.”</p><br/><p>“Yes. Then, I’ll take my leave.”</p><br/><p>I bowed and left the office.</p><br/><p>I closed the door and leaned against it, letting out the sigh I had held back for a while.</p><br/><p>Today was very eventful. I used my head too much that I was exhausted.</p><br/><p>Well, this was how I blew away my chance at becoming the manager of a top star. The notion of becoming a manager of a top star had comforted me when things were tough, but this was how it ended.</p><br/><p>Although I didn’t regret my decision, I still felt a bit dejected.</p><br/><p>“Hey, you crazy bastard.”</p><br/><p>Kim Hyunjo said right in front of me.</p><br/><p>“Aren’t you a real crazy bastard?”</p><br/><p>“Haha…”</p><br/><p>I didn’t know why, but I laughed. Was I really crazy?</p><br/><p>“Can you laugh in a situation like this? What were you thinking when you blew Sung Dowon off….!”</p><br/><p>Kim Hyunjo halted his agitated voice and glanced next to him. Sung Dowon’s manager, Jang Seomoon, was standing there. Kim Hyunjo clicked his tongue and grabbed my arm.</p><br/><p>“Follow me.”</p><br/><p>I followed behind him with swift steps and said.</p><br/><p>“Chief, I have something to say as well. About Songha’s personal acting teacher, Teacher Shim Kyungtaek. It seems Songha heard bad things from her teacher, I think he might be up to something strange…”</p><br/><p>“You’re the strange one right now!”</p><br/><p>“But this is a really important problem.”</p><br/><p>“And is your problem not important? Do you even know what you kicked away just now?”</p><br/><p>We were talking in front of the elevator when we heard a voice behind us.</p><br/><p>“Um, excuse me.”</p><br/><p>When I looked around, Jang Seomoon was walking towards us.</p><br/><p>“Could we… talk for a bit?”</p><br/><p>“Ah, yes.”I nodded my head. The elevator doors opened.</p><br/><p>Kim Hyunjo sighed and got on the elevator by himself.</p><br/><p>“I’ll be in the basement practice room; so come there once you’re done. Okay?”</p><br/><p>“Yes.”</p><br/><p>Jang Seomoon and I went out into the emergency stairwell.</p><br/><p>Underneath the dim yellow light, Jang Seomoon was hesitant for a while.</p><br/><p>I had met this person exactly three times before. All three times weren’t exactly under good circumstances. First was when he came into the washroom with Sung Dowon, he didn’t look at me friendlily. He had turned pale the second time. And I had almost taken this person’s spot not too long ago, so there was no way the mood could be good.</p><br/><p>My mind was complicated.</p><br/><p>Jang Seomoon sighed before saying.</p><br/><p>“Why did you refuse? Being Dowon hyung’s manager?”</p><br/><p>“Ah, because of Neptune.”</p><br/><p>“I heard that… but is that true? I honestly can’t believe it…”</p><br/><p>“It was mainly because of Neptune, but I also have my own reasons for refusing.”</p><br/><p>“Ah…”</p><br/><p>Jang Seomoon wet his lips and continued.</p><br/><p>“Though it probably isn’t the case, but… if you were worried I’d harass you if you accepted, I wanted to tell you that you don’t have to be worried. Since it is a good opportunity for you.”</p><br/><p>“No, I didn’t think…”</p><br/><p>“And even if I don’t get fired, I’m going to quit.”</p><br/><p>If I could, I wanted to tell him.</p><br/><p>That this situation was a blessing in disguise. Although he currently felt like the world was collapsing because he would have to quit being Sung Dowon’s manager, in the near future, he would think he was lucky to be fired now.</p><br/><p>Jang Seomoon roughly tangled his back hair and mumbled.</p><br/><p>“How could I be fired so suddenly after all I did… Haa, fuck.”</p><br/><p>“Honestly, I think Sung Dowon was more at fault…”</p><br/><p>Jang Seomoon stopped momentarily before smiling slightly.</p><br/><p>“You saw my team leader… no, the team 2 leader inside, right? The bearded guy.”</p><br/><p>“Yes.”</p><br/><p>“It might be because he has never been a manager before, but if something good happens, it’s because of the celebrity, and anything bad is because of the manager. He holds grudges so it’s best if you don’t meet him for a while. He probably never thought that you would refuse that offer so his pride must have taken a blow.”</p><br/><p>His last words had a hint of joy.</p><br/><p>“I was already thinking about doing just that.”</p><br/><p>He nodded at my reply and added.</p><br/><p>“And… What you said just now. About Teacher Shim Kyungtaek. That someone who took his lessons was criticized severely by him.”</p><br/><p>“Ah, yes.”</p><br/><p>“I do have something, it’s not certain, though.”</p><br/><p>My eyes widened.</p><br/><p>Since he was someone who had been assigned to an actor until now, he might know something.</p><br/><p>“That’s okay. Please tell me.”</p><br/><p>“I heard this when I had drinks with Chief Jo a long time ago. You know that Son Chaeyoung’s very emotional, right?”</p><br/><p>“Yes.”</p><br/><p>I knew it well.</p><br/><p>But why did Son Chaeyoung suddenly come up again?</p><br/><p>“Chief Jo said that he felt tired to death trying to soothe her since she felt wary and insecure whenever she saw new actors with potential. There are a quite of few actors like her. Since, as long as she does well, her company will promote and treat her better. She doesn’t want to share.”</p><br/><p>“Ahh.”</p><br/><p>“Son Chaeyoung and that acting teacher are close.”</p><br/><p>Now that I thought about it, Kim Hyunjo said it as well. That the teacher taught Son Chaeyoung.</p><br/><p>“Son Chaeyoung really follows him around, calling him, ‘Teacher, teacher’. Well… This is all simply my own speculation from what I’ve heard from others, and I don’t know if there really is something up with them so just take that into account.”</p><br/><p>“Thank you.”</p><br/><p>Because nothing was certain, I would have to check, but it did sound a bit suspicious.</p><br/><p>I would have to talk to Kim Hyunjo and learn more about it.</p><br/><p>“Then take care.”</p><br/><p>“Yes. I hope Neptune does well in the future.”</p><br/><p>We said our farewells, and Jang Seomoon disappeared down the stairs while I took the elevator. I went up to the 4<sup>th</sup> floor to get my bag, and when I was waiting for the elevator, my phone vibrated.</p><br/><p>“Hello?”</p><br/><p>-Mr. Manager. I am Park Woojeong. Is it okay to talk?</p><br/><p>“It’s fine. I saw the article you published.”</p><br/><p>I could hear her voice that didn’t know what to do because she was so happy from the other side of the call.</p><br/><p>-That was my first exclusive article.</p><br/><p>“Whoa, congratulations.”</p><br/><p>-It’s all thanks to you. Food and drinks will be on me. When are you free?</p><br/><p>“Umm…”</p><br/><p>I thought for a moment before licking my lips.</p><br/><p>“I don’t really have a proper schedule to schedule anything ahead of time.”</p><br/><p>I hadn’t even met with my friends after getting hired.</p><br/><p>-Haha, to be honest, it’s the same for me. Even during breaks, I have to be nervous and wait. If something pops up, I have to cancel all my plans and run over, so it’s a bit hard to set any personal schedules.”</p><br/><p>Ah, break. I suddenly recalled what day today was.</p><br/><p>“… Now that I think about it, today was my break.”</p><br/><p>-Pardon? But what are you doing now? There isn’t much time left.</p><br/><p>“I know, right?”</p><br/><p>We diverted our sympathy for each other with laughter. Hahaha.</p><br/><p>When I hung up after agreeing to set a date when we had time, the elevator arrived at the basement.</p><br/><p>Knock, knock.</p><br/><p>After knocking on the door, I went in and stopped. All four girls of Neptune and Kim Hyunjo. The five of them were looking at me with the same expression.</p><br/><p>Expressions wondering if I was in my right mind.</p><br/><p>“Oppa! Did you really kick away Sung Dowon and come here?”</p><br/><p>Im Seoyoung ran over to me and asked while grabbing both my arms.</p><br/><p>Next to her, Kim Hyunjo clicked his tongue and said.</p><br/><p>“The girls won’t believe me. Do you understand what sort of unbelievable thing you did?”</p><br/><p>“Is it true?”</p><br/><p>“Yeah.”</p><br/><p>When I nodded my head, Im Seoyoung fell back hesitantly.</p><br/><p>“Really? You really kicked away a top star and came here? After kicking a national star?!”</p><br/><p>“Yeah… Things ended up that way.”</p><br/><p>“Thi-things ended up that way? What the heck! You’re crazy! Crazy!”</p><br/><p>Not only Im Seoyoung, but the other girls were surprised and talking amongst themselves.</p><br/><p>“I told you. He’s crazy. It was already strange he came to work during his break.”</p><br/><p>Kim Hyunjo gestured towards me and said.</p><br/><p>“I was able to sneak a peek, and that Sung Dowon, that top star, requested that he’d like him to be his manager with his head lowered. But then, this guy’s like, ‘I keep thinking of Neptune,’ then didn’t even look back and left!”</p>\n</div>\n<div style=\"max-width: 870px;margin: 5px auto;background: repeating-linear-gradient( 45deg, #fff6cc, #fff6cc 5px, #f3ecc7 5px, #f3ecc7 10px );\">\n<!-- Composite Start -->\n<div id=\"M562762ScriptRootC864255\">\n</div>\n<script async=\"\" src=\"https://jsc.mgid.com/m/e/media.boxnovel.org.864255.js\"></script>\n<!-- Composite End -->\n</div>\n<hr class=\"chr-end\"/>\n<div class=\"chr-nav\" id=\"chr-nav-bottom\">\n<div class=\"btn-group\">\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/top-management-chapter-31\" id=\"prev_chap\" title=\"Chapter 31\">\n<span class=\"glyphicon glyphicon-chevron-left\"></span>\n<span class=\"hidden-xs\">Prev Chapter</span>\n</a>\n<button class=\"btn btn-success chr-jump\" type=\"button\">\n<span class=\"glyphicon glyphicon-list-alt\"></span>\n</button>\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/top-management-chapter-33\" id=\"next_chap\" title=\"Chapter 33\">\n<span class=\"hidden-xs\">Next Chapter</span>\n<span class=\"glyphicon glyphicon-chevron-right\"></span>\n</a>\n</div>\n</div>\n<div class=\"text-center\">\n<button class=\"btn btn-warning\" data-chr-id=\"201176\" id=\"chr-error\" type=\"button\"><span class=\"glyphicon glyphicon-exclamation-sign\"></span> Report chapter\r\n                        </button>\n</div>\n<div class=\"bg-info text-center visible-md visible-lg box-notice\">\r\n                        Tip: You can use left, right, A and D keyboard keys to browse between chapters.\r\n                    </div>\n</div>"}