{"title": "Chapter 37", "id": 37, "volume": 1, "url": "http://boxnovel.org/top-management-chapter-37", "volume_title": "Volume 1", "body": "<h1>Chapter 37</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><header class=\"entry-header\"></header></p><div class=\"entry-content content\"><br/><p>Chapter 37: When an Unexpected Event Occurs (1)</p><br/><p>TL: emptycube</p><hr/><br/><p>The weather was unusual.</p><br/><p>I looked at the sky a few times during the ride to our destination. The sky was gloomy without a single ray of sunshine since morning, and now, dark clouds had gathered to cover the sky in a dark gray color.</p><br/><p>“Do you think it will rain today?”</p><br/><p>It didn’t matter if it was any other day, but we had an outdoor schedule today so it mattered very much.</p><br/><p>The traitor, who was in the driver’s seat, shrugged.</p><br/><p>“Don’t know, there wasn’t anything in the morning about it raining today. Check again.”</p><br/><p>I checked the daily forecast app again. It still only showed a cloud icon. The chance of precipitation was low as well, and it indicated that the clouds would disperse and that it would be sunny in an hour.</p><br/><p>Was I too worried?</p><br/><p>When I was about to put away my cellphone, it vibrated.</p><br/><p>“Hello?”</p><br/><p>-I am the youngest writer from the Hope Campaign. When do you think you will arrive?</p><br/><p>“We are entering the parking lot right now.”</p><br/><p>The writer said she would come find us before hanging up.</p><br/><p>The schedule we were going to was a live broadcast for a sharing campaign, and they had asked Neptune to perform a song. We troubled over the decision because it overlapped with Next K-Star, but we eventually agreed because there weren’t many chances to broadcast their performance on a public TV network.</p><br/><p>“Girls, we’re he…”</p><br/><p>I shut my mouth when I saw the situation behind me. They had nodded their heads sleepily when we were on the highway, but now they were all sleeping like logs, wrapped in blankets with their heads resting on each other’s heads and shoulders.</p><br/><p>Since their makeup artists and stylists were also dozing off, the traitor and I got out first. As soon as I went out, the cold air seemed to scratch my neck as it passed by.</p><br/><p>Brr, it’s cold.</p><br/><p>Soon after, a woman ran towards us. Looking at how she had an official badge and a headset-style wireless intercom, it seemed she was the youngest writer who had called just now.</p><br/><p>“Hello! Are you Neptune?”</p><br/><p>“Yes, that’s right. Hello.”</p><br/><p>“There’s a stage rehearsal in 30 minutes. Neptune will be on second.”</p><br/><p>The traitor cut in and asked,</p><br/><p>“We have a Next K-Star recording in the afternoon so we need to go immediately. There won’t be any delays or anything like that, right?”</p><br/><p>“Of course not, it’s a live broadcast. It will be over after an hour broadcast.”</p><br/><p>“Okay.”</p><br/><p>“Then I will lead you to the waiting room. The members are…”</p><br/><p>It was too cold outside. If even I, who was dressed warmly, was cold, the girls, who were wearing their stage outfits that exposed their arms and legs, would shiver intensely if they came out.</p><br/><p>As if he thought the same thing, the traitor showed a friendly smile and said,</p><br/><p>“The girls are sleeping right now. Would it be okay if we let them wait inside the van?”</p><br/><p>“Ah, of course! You can do that.”</p><br/><p>The youngest writer readily nodded her head. Something suddenly crossed my mind so I asked,</p><br/><p>“Ms. Writer, the weather looks uneasy; will it be fine? It’s an outdoor performance.”</p><br/><p>“The weather was supposed to be good today, but it’s like this. We contacted the weather center and they said there will be no problems. Don’t worry.”</p><br/><p>Yeah, let’s trust the weather center.</p><br/><p>After we decided to wake the girls in 10 minutes and were about to send Kim Hyunjo a text that we arrived,</p><br/><p>“Why didn’t you go?”</p><br/><p>The traitor asked abruptly.</p><br/><p>“You said it on your first day. That you weren’t interested in being an idol manager and that you honestly wanted to be a manager for an actor. That you would immediately transfer if there was a chance to switch to the actor team.”</p><br/><p>I did say that.</p><br/><p>“But why didn’t you go? When he wasn’t an unknown actor but Sung Dowon?”</p><br/><p>The traitor asked again.</p><br/><p>I took a moment to choose my words. Perhaps it was because I had set up a wall, but my thought would become complicated whenever we talked.</p><br/><p>What was he thinking now, what motives does he have by asking this, maybe he’s trying to do something, maybe, maybe. Thoughts like these continuously entered my mind.</p><br/><p>“I kept thinking of Neptune when I thought about switching. Like you said then, now that I’ve experienced it, it’s not bad being assigned to the idol team. And I also had some personal circumstances.”</p><br/><p>“Circumstances? What, that you didn’t get a good vibe?”</p><br/><p>“What?”</p><br/><p>I looked to my side. The traitor was looking at me.</p><br/><p>“You know.”</p><br/><p>With an undecipherable expression, he opened his mouth.</p><br/><p>“I have something I want to ask you…”</p><br/><p>It was then.</p><br/><p>He stopped what he was about to say and looked up at the sky. I hurriedly looked up as well. The sky was much darker than before. It was completely covered with dark clouds. As if it would rain any second.</p><br/><p>Then -drip- cold water dripped onto my forehead.</p><br/><p>Damn, it’s raining!</p><br/><p>I ran around in the cold rain, looking for the youngest writer. She wouldn’t answer her phone so I wandered for a long time before finding her behind the stage. When I looked closer, she was talking to a man in a raincoat.</p><br/><p>“Producer, should we continue?”</p><br/><p>“Didn’t you hear what the department manager said? Since we don’t have enough time before the broadcast to change the cue sheets, he says to go as planned!”</p><br/><p>“What do we do if it continues to rain once we’re live? What about the singers’ performances?”</p><br/><p>“The studio control booth contacted the weather center, and they say it will pass soon!”</p><br/><p>That damn weather center, didn’t they say there weren’t going to be any problems a little while ago?</p><br/><p>I called after the youngest writer who was about to run off somewhere.</p><br/><p>“Ms. Writer!”</p><br/><p>“Ah, Mr. Manager. I was just about to call you, but the rehearsal might be slightly delayed.”</p><br/><p>“If the rain doesn’t stop, what other alternatives…”</p><br/><p>The youngest writer showed an awkward expression at my words.</p><br/><p>“If it was a recorded broadcast, we can just wait a little before continuing, but since this is a live broadcast, I think it might continue as it is.”</p><br/><p>“Could you put tarps up on the stage?”</p><br/><p>“Ah, please wait, I’ll ask. Producer!”</p><br/><p>The youngest writer ran to the male producer she was talking to previously and asked. Soon after, the producer let out a sigh and walked towards me.</p><br/><p>“Are you the chief… who’s in charge of Neptune?”</p><br/><p>“I’m their manager.”</p><br/><p>“Ah… If we cover the stage, it looks messy on the jib camera<sup>{1}</sup>. The department manager cares a lot about the picture, so that’s a problem we’ll have to think about in the worst case scenario. Since it’s not that bad now.”</p><br/><p>It’s not that bad now?</p><br/><p>“However, the studio will tell the MCs to comment about how Neptune showed a passionate performance even though it’s raining. If we broadcast something like this, it could become a hot topic so please bear with it.”</p><br/><p>The producer didn’t even bother to wait for my reply as he hurriedly ran off.</p><br/><p>I let out a sigh instead of what was boiling up inside. The youngest writer read my mood and cautiously said,</p><br/><p>“First, we’ll get you some umbrellas and raincoats, and I’ll try to find some towels as well. And let’s refrain from dancing too hard…”</p><br/><p>Eventually, all I was left with were 4 transparent umbrellas and a few raincoats in my hand. When I returned to the parking lot and got into the van with these in hand, the traitor and the girls, who were chatting noisily, turned to look at me at the same time.</p><br/><p>Im Seoyoung’s eyes widened.</p><br/><p>“Oppa! Why would you get wet when you’re holding 4 umbrellas!”</p><br/><p>“I was already wet so it didn’t matter.”</p><br/><p>“Ah, we don’t have any towels… Use this to wipe off.”</p><br/><p>Im Seoyoung handed me the blanket she had covered herself with.</p><br/><p>“Thanks.”</p><br/><p>As I dried my hair that was dripping with water, I asked the traitor,</p><br/><p>“They say they are going to continue even if it rains. Did you contact the chief?”</p><br/><p>“He said we can’t do anything since it’s a live broadcast. He said that they cannot get hurt and to minimize their dancing.”</p><br/><p>Their words were similar. Worried, I looked towards the girls, but they had calm expressions.</p><br/><p>“Of course we need to do it since we’re going on air. It’s not like it’s a typhoon.”</p><br/><p>“We just need to be careful not to fall.”</p><br/><p>“Oppa, there are a lot of times when we perform in the rain.”</p><br/><p>They all nodded their heads as if there was no problem. I concealed my uneasiness and looked out the window. Thick raindrops knocked heavily on the window.</p><br/><p>Only after the scheduled time had long since passed did they begin the rehearsal.</p><br/><p>While the solo artist was rehearsing first, we waited, gathered under a tarp next to the stage. The solo artist had an umbrella and was wearing a raincoat as he rehearsed leisurely. His manager who was watching him looked calm as well.</p><br/><p>Well, since he didn’t have any big actions and could simply sing while standing.</p><br/><p>“They say he’s going to perform with an umbrella, how about we have umbrellas as well”</p><br/><p>I asked, in case umbrellas could be okay even if raincoats weren’t, but Lee Taehee firmly shook her head.</p><br/><p>“It’s more dangerous if we hold an umbrella in one hand and a mic in the other. The umbrella takes up a lot of space so our movements will become tangled, and the moment we slip up, it’ll become a mess. No matter what kind of circumstances we’re in, there are people watching us on TV, and this isn’t professional.”</p><br/><p>“Oppa, we’ll be careful so don’t worry!”</p><br/><p>“It seems like the rain is starting stop anyways.”</p><br/><p>Since the other girls were like this as well, there was nothing I could say.</p><br/><p>Soon after, the solo artist finished his performance, and the youngest writer gave the signal.</p><br/><p>“Neptune, please go up now!”</p><br/><p>“Yes!”</p><br/><p>The girls walked out into the rain.</p><br/><p>Once they got into position on the stage, the MR of their title track flowed out. I gulped down my dry saliva as I observed the stage. Although the rain had died down compared to before, the girls were completely soaked by the time they sang half their song. They danced in risky high heels, energetically moving on the wet stage.</p><br/><p>However, since the people who were wandering around the plaza were hiding from the rain in various places, almost no one was paying attention to them. Only the cameras in front of the stage were working hard to film them.</p><br/><p>The song was almost over. When I relaxed, thinking the rehearsal would end with no problems.</p><br/><p>The rain started to fall crazily.</p><br/><p>Wasn’t this dangerous?</p><br/><p>At this point, it wasn’t a problem of getting wet, but their vision would get hazy. If the rain dripped into their eyes, it would become difficult to see. Just when I was wondering… how they could dance in these conditions.</p><br/><p>“…!”</p><br/><p>Lee Songha, who was spinning on top of the stage, suddenly staggered and fell.</p><br/><p>My heart plummeted. I was about to run up, but Lee Songha stood right back up like a roly-poly toy<sup>{2}</sup>. Then she continued to dance.</p><br/><p>Was she okay? Was she okay?</p><br/><p>My heart was agitated, but fortunately, the song ended without any additional accidents. I covered the girls coming down from the stage with blankets and led them to the tarp. When we returned, they all surrounded Lee Songha.</p><br/><p>“Songha, are you okay? Did you get hurt?</p><br/><p>“Yeah, it looked like you fell pretty hard.”</p><br/><p>“Don’t you need to go to the hospital?”</p><br/><p>Lee Songha moved both her legs vigorously and shook her head.</p><br/><p>“I’m okay. It’s fine. I can do it.”</p><br/><p>It felt like she would protest if we didn’t let her on stage.</p><br/><p>“You might be too agitated to feel it right now. Sit down, let’s have a look.”</p><br/><p>I sat her down on a chair and checked her ankle. Although I wasn’t an expert, it luckily looked fine on the outside. She didn’t look to be in pain when I grabbed it a bit hard, and there didn’t seem to be any wounds on her leg either.</p><br/><p>“It does seem to be fine… That was close.”</p><br/><p>“I lost my balance when the rain got in my eyes.”</p><br/><p>“Tell me right away if you’re hurt.”</p><br/><p>“Yes.”</p><br/><p>Lee Songha nodded with a blanket wrapped around her.</p><br/><p>The rehearsal started later than expected so there wasn’t much time before the main stage. While they were examining their makeup and hair in the van due to the rain, the traitor, who had gone out to see the situation outside, returned.</p><br/><p>“The rain has almost stopped, it’s to the point where only a few drops are falling.”</p><br/><p>“Ah… That’s a relief.”</p><br/><p>So the weather center wasn’t completely wrong. It really did pass.</p><br/><p>When I looked outside, it was clearly raining sparsely. The ballad singer was on stage, performing without an umbrella. Since they said that they would transfer to the studio after his performance before it was our turn, there really wasn’t much time left.</p><br/><p>Just when I was about to return to the tarp with the girls and wait.</p><br/><p>The youngest writer peeped in.</p><br/><p>“Umm…”</p><br/><p>“Ah, Ms. Writer. It’s fortunate that the rain stopped.”</p><br/><p>She showed an awkward expression at my words before saying,</p><br/><p>“Umm, Mr. Manager. We got a call from the studio control booth…”</p><br/><p>“Yes.”</p><br/><p>“Sorry, but I don’t think Neptune can perform.”</p><br/><p>“Pardon?”</p><br/><p>“It seems they hastily came to this decision after seeing one of Neptune’s members fall. They said that it could be a big problem if any mishaps occur due to safety… I’m sorry. We will pay you more than the pay we discussed previously.”</p><br/><p>I stood blankly, processing her words. Then I suddenly looked back. At the people looking in this direction. And amongst them, I saw Lee Songha first, standing rigidly with widened eyes.</p><hr/><br/><p><sup>{1}</sup> https://en.wikipedia.org/wiki/Jib_(camera)</p><br/><p><sup>{2}</sup> https://en.wikipedia.org/wiki/Roly-poly_toy</p>\n</div>\n<div style=\"max-width: 870px;margin: 5px auto;background: repeating-linear-gradient( 45deg, #fff6cc, #fff6cc 5px, #f3ecc7 5px, #f3ecc7 10px );\">\n<!-- Composite Start -->\n<div id=\"M562762ScriptRootC864255\">\n</div>\n<script async=\"\" src=\"https://jsc.mgid.com/m/e/media.boxnovel.org.864255.js\"></script>\n<!-- Composite End -->\n</div>\n<hr class=\"chr-end\"/>\n<div class=\"chr-nav\" id=\"chr-nav-bottom\">\n<div class=\"btn-group\">\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/top-management-chapter-36\" id=\"prev_chap\" title=\"Chapter 36\">\n<span class=\"glyphicon glyphicon-chevron-left\"></span>\n<span class=\"hidden-xs\">Prev Chapter</span>\n</a>\n<button class=\"btn btn-success chr-jump\" type=\"button\">\n<span class=\"glyphicon glyphicon-list-alt\"></span>\n</button>\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/top-management-chapter-38\" id=\"next_chap\" title=\"Chapter 38\">\n<span class=\"hidden-xs\">Next Chapter</span>\n<span class=\"glyphicon glyphicon-chevron-right\"></span>\n</a>\n</div>\n</div>\n<div class=\"text-center\">\n<button class=\"btn btn-warning\" data-chr-id=\"201186\" id=\"chr-error\" type=\"button\"><span class=\"glyphicon glyphicon-exclamation-sign\"></span> Report chapter\r\n                        </button>\n</div>\n<div class=\"bg-info text-center visible-md visible-lg box-notice\">\r\n                        Tip: You can use left, right, A and D keyboard keys to browse between chapters.\r\n                    </div>\n</div>"}