{"title": "Chapter 40", "id": 40, "volume": 1, "url": "http://boxnovel.org/top-management-chapter-40", "volume_title": "Volume 1", "body": "<h1>Chapter 40</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><header class=\"entry-header\"></header></p><div class=\"entry-content content\"><br/><p>Chapter 40: Is it a miscasting? Or a divine move? (1)</p><br/><p>TL: emptycube</p><hr/><br/><p>{TL/N: Cat Guardian Angel -&gt; Cat Guardian Ghost, since the cat is a ghost and not an angel (Had been lazy to go to previous chapters and fix it)}</p><br/><p>Almost running, I rushed and grabbed Kim Hyunjo, who was about to get in the passenger seat. When I told him the situation in a small voice so no one else could hear, his expression became serious.</p><br/><p>“She told me we must not tell the girls.”</p><br/><p>“Really, that girl… Then, Sunwoo, you go take her to an emergency room.”</p><br/><p>“I will. Don’t worry.”</p><br/><p>“Call me when you get home.”</p><br/><p>“Yes.”</p><br/><p>Kim Hyunjo skillfully made up a story. That she had to rush to the company due to a problem with her drama audition. Only the traitor gave a slightly doubtful look, the girls got in the van and left without much suspicion.</p><br/><p>Lee Songha and I grabbed a taxi and went the closest emergency room. I was worried that it might be serious, but luckily, it was a minor sprain.</p><br/><p>When we left the hospital after getting treated, it was just past 1 a.m.</p><br/><p>I went out towards the street to look for a taxi, but Lee Songha staggered behind me like a puppy in the rain. Any person looking at her would find their hearts go soft.</p><br/><p>“You want some juice before we go?”</p><br/><p>“Yes.”</p><br/><p>Lee Songha’s footsteps halted.</p><br/><p>I left her on a bench and bought a juice she liked from a nearby vending machine. I handed her the juice and sat beside her.</p><br/><p>I looked up at the sky with complicated thoughts. It had been filled with dark clouds this morning, but as if they had been washed away, the moon in the sky was especially bright.</p><br/><p>After thinking for a moment, I asked,</p><br/><p>“Why didn’t you tell me earlier?”</p><br/><p>A slight shadow cast over her face.</p><br/><p>“Sorry.”</p><br/><p>“What were you going to do if it was serious? Did you not tell us you were hurt in case we wouldn’t let you perform?”</p><br/><p>It seemed that trying not to sound too pressuring paid off as Lee Songha, who had been fiddling with the juice bottle, opened her heavy lips.</p><br/><p>“I messed everything up.”</p><br/><p>“Why is it your fault? It’s the rain’s.”</p><br/><p>It was also the staff’s fault for not setting up tarps because they would look messy.</p><br/><p>That was why they made the girls dance in the rain, making one of them fall, only to cancel their performance in the end?</p><br/><p>I found out the names of the program’s PD and the director. I even resolved myself to reject them outright just in case they tried to cast the girls once they became famous.</p><br/><p>When I recalled the staff again, irritation suddenly surged in me. While I tried to calm down by taking deep breaths, I saw Lee Songha’s legs pull back. Now that I thought about it, even though she was dressed warmly above, her bare legs stretched out from below her skirt.</p><br/><p>I clicked my tongue as I took off my coat and handed it to her. Well, this wasn’t in a good condition either because it had dried after getting completely soaked, but at least it would protect her from the wind.</p><br/><p>“Cover your legs with this.”</p><br/><p>“It’s fi…”</p><br/><p>“Don’t say you’re fine. Was what happened before fine?”</p><br/><p>I spat before regretting it. I felt that I needlessly made her, who had just calmed down, recall bad thoughts again. When I glanced at her, her expression was gloomier than before.</p><br/><p>Damn, what should I do?</p><br/><p>Just as my head was spinning more furiously than any other time, Lee Songha fiddled with my coat covering her knees and mumbled in a quiet voice,</p><br/><p>“I’m a useless person.”</p><br/><p>“… What?”</p><br/><p>“…”</p><br/><p>“What did you say?”</p><br/><p>I thought I heard it wrong, but looking at how she was looking down wordlessly, it seemed I had heard correctly.</p><br/><p>Just what nonsense was she saying now?</p><br/><p>When I was about to open my mouth, Lee Songha blinked her eyes. Then, without any warning, a tear dripped down from her eye.</p><br/><p>My heart dropped.</p><br/><p>I had seen kids cry and had comforted them countless times. However, they were the type to cry as if they were about to die one moment, then come back to life the moment they saw their mom.</p><br/><p>“Umm… Songha.”</p><br/><p>“Yes.”</p><br/><p>Lee Songha rubbed her eye with the back of her hand. It ended with one teardrop. However, even if no more tears fell, her face was gloomy as if tears could fall at any moment.</p><br/><p>I didn’t recall ever seen her so depressed.</p><br/><p>What should I do if I tried to say things to comfort her and it only made things worse? It looked it was my fault this time as well.</p><br/><p>It seemed she didn’t want to let the other girls know, so how should I comfort her…</p><br/><p>“You, uh… Do you want to call your parents? To feel better. Should I leave?”</p><br/><p>I said before regretting it. It was too late at night to call her parents right now.</p><br/><p>Lee Songha’s face instantly darkened.</p><br/><p>“My mom and dad don’t like that I’m a celebrity. They ask why I keep doing this when it’s not working out.”</p><br/><p>“Uhh….”</p><br/><p>“They haven’t called much after our last album flunked.”</p><br/><p>I felt like I was going crazy.</p><br/><p>I opened and closed my mouth a few times before saying exactly what was on my mind.</p><br/><p>“Why are you useless? You did well during the recording. The chief, Gunyoung and I, we were all going crazy about how great you were. Also, even if you might not be as good at dancing or singing, isn’t your talent concentrated in acting?”</p><br/><p>Lee Songha stared at me.</p><br/><p>“Look, even now. You were so great at acting that no one knew your ankle hurt until you told me. Choi Gunyoung, he’s quick-witted, but he still didn’t know.”</p><br/><p>When I said this while mixing in a few jokes, Lee Songha’s eyes shined slightly.</p><br/><p>“Once an episode of your drama airs, you will definitely hear them say things like, ‘The rediscovery of Lee Songha’.”</p><br/><p>Ah. The overcast on her face slowly faded away. A smile peeped out from within.</p><br/><p>“I really wish I am as talented in acting like oppa says.”</p><br/><p>Luckily, she looked better as she instantly gulped down her juice before saying,</p><br/><p>“I want to audition quickly. I am going to try really hard.”</p><br/><p>“Yeah, you just do as you’re doing now.”</p><br/><p>Then, I will try to create an opportunity however I can.</p><br/><p>Looking at the side of her face, I suddenly thought.</p><br/><p>I thought of how I wanted to see Lee Songha’s talent fully bloom. I thought of how I wanted to see her figure, more confident and beautiful than anyone else, standing tall in an unimaginably grand and magnificent place.</p><br/><p>With my strength.</p><br/><p>I wanted… to take her there with my own hands.</p><br/><p>I sent Lee Songha to her residence and returned to my one-room apartment.</p><br/><p>I dragged my heavy legs to the door when I saw a delivery box in front of my door. When I wondered what it was, I remembered how my mom said she sent me a package.</p><br/><p>When I brought it inside and opened it, I saw pakimchi and other dry side dishes uniformly packed in resealable bags as well as a glass bottle with honey-soaked ginger.</p><br/><p>It was too late right now, so I decided to call her before work tomorrow.</p><br/><p>I boiled some water and brewed myself a cup of ginger tea. When I sat down at my desk chair and took a sip, my stiff body slowly relaxed.</p><br/><p>I felt refreshed.</p><br/><p>Now that my stomach was warm, I felt sleepy. Without even taking off my coat, I slouched over my desk. My body felt heavy and sluggish.</p><br/><p>Should I just sleep like this?</p><br/><p>While I was thinking about it, my phone vibrated. When I took it out, it was Kim Hyunjo.</p><br/><p>Ah, he told me to call him.</p><br/><p>“Yes, chief. I just got home.”</p><br/><p>-Okay. How’s Songha?</p><br/><p>“They said it was a minor sprain and that we shouldn’t worry about it too much.”</p><br/><p>-That’s good. Then, there’s no problem with auditioning, right?</p><br/><p>My mind jolted.</p><br/><p>“Auditioning?”</p><br/><p>-I talked with Younghoon hyung, and he said that the CEO of Pan Production had brought over the script this afternoon. Hyung personally met with him and read the script, and he said it was good. Although there needs to be further discussion, it looks like Songha can prepare to audition for this project.</p><br/><p>Finally!</p><br/><p>Unable to contain my excitement, I jumped up.</p><br/><p>I brought the opportunity right in front of my eyes. All that was left was to grab it.</p><br/><p>Lee Songha’s face brushed past my mind. How happy would she be if I told her?</p><br/><p>-Oh, right. I’m thinking about leaving Lee Songha’s personal schedule up to you from now on. What do you think?</p><br/><p>“…!”</p><br/><p>-It’s a project you brought in, and it seems like Lee Songha listens to you as well. And looking at how you’ve been, it seems alright to trust you with this. Well, if you don’t want to, then you don’t have to.</p><br/><p>“Nope! I will!”</p><br/><p>I replied in a voice akin to a scream. I heard laughter from the other side. It seemed my voice was quite loud as my next door neighbor knocked on the wall so I silently clenched my fists and shook them. It was still hard to contain my excitement with just this so I paced back and forth in my small room.</p><br/><p>Just a moment ago, my mind felt tired, and I was only filled with the thoughts of resting, but it felt like I could easily go out to work right now.</p><br/><p>Just then, Kim Hyunjo suddenly added in,</p><br/><p>-Ah, also, this isn’t anything certain. But they say that the leading male actor for this project might be from our company.</p><br/><p>…What?</p><br/><p>-I don’t know the specifics so let’s talk at work.</p><br/><p>He hung up. However, I was unable to move from my spot.</p><br/><p>It felt like cold water had been poured on me.</p><br/><p>In the future I saw. In the future where I heard the news about how Cat Guardian Ghost was a big hit, the male lead wasn’t an actor from W&amp;U.</p><br/><p>Maybe… the drama’s lead actor might change?</p><br/><p>I spent the rest of the night wide awake before going to work.</p><br/><p>Endless thoughts trailed after one another, not letting me sleep.</p><br/><p>Why did a W&amp;U actor come up when discussing the role of the Cat Guardian Ghost lead?</p><br/><p>If it really changed, who would be the new lead?</p><br/><p>Don’t, don’t tell me it’s Sung Dowon? No. That’s going too far. It will definitely not be the case. I am not that unlucky.</p><br/><p>Haa… If something somehow changed, it would inevitably change the future as well.</p><br/><p>The role of the interpreter, which Songha would audition for, was a supporting role, but the male lead would be the poster board of the drama.</p><br/><p>If the male lead was changed in a drama, which was expected to be a hit, would the drama still be a hit as expected?</p><br/><p>Damn. I thought that as long as Lee Songha was cast in the Cat Guardian Ghost, even if it wasn’t an 8-lane highway, I believed that her path would at least be paved with cement.<sup>{2}</sup> Well, nothing was easy.</p><br/><p>Kim Hyunjo was surprised when I entered the office.</p><br/><p>“Why did you come to work so early? Your dark circles have reached your chin.”</p><br/><p>“I was curious about what happened to Cat Guardian Ghost.”</p><br/><p>“Aha, so that’s why you came in so early? Now that your shoulders feel heavy, you can’t sleep?”</p><br/><p>I simply laughed awkwardly. As if he understood my urgent mind, he folded his arms and said,</p><br/><p>“I told Pan Production your contact information so they’ll contact you. Set an audition date. If any other issues that need to be decided come up, bring them to me first.”</p><br/><p>“Yes. But you said how the male lead might be from our company…”</p><br/><p>“Ah, that?”</p><br/><p>Please tell me negotiations broke down. Please.</p><br/><p>In the worst case scenario, even if the male lead changed, it couldn’t be as bad as Sung Dowon. I couldn’t let Sung Dowon ruin my plans.</p><br/><p>While I was uneasy, Kim Hyunjo asked,</p><br/><p>“Do you know Seo Jijoon?”</p><br/><p>“… Seo Jijoon?”</p><br/><p>Of course, I knew him. He was an actor W&amp;U personally trained and debuted.</p><br/><p>He had a smart, refined image, and because he trained for a long time, he was a good actor who had never created controversy with his acting skills.</p><br/><p>He had been successful in public networks’ weekend dramas and weekday miniseries one after another and fixed himself a spot as a top star. I heard rumors he was carefully looking through scenarios to take to the big screen.</p><br/><p>“It seems the Pan Production CEO coincidentally met Seo Jijoon when he came here. So he gave him the script, and when Seo Jijoon read it, he said he wanted to do it?”</p><hr/><br/><p><sup>{1}</sup> Kimchi made with green onions</p><br/><p><sup>{2}</sup> How her path (to success) would be easier if she was cast in the Cat Guardian Ghost.</p>\n</div>\n<div style=\"max-width: 870px;margin: 5px auto;background: repeating-linear-gradient( 45deg, #fff6cc, #fff6cc 5px, #f3ecc7 5px, #f3ecc7 10px );\">\n<!-- Composite Start -->\n<div id=\"M562762ScriptRootC864255\">\n</div>\n<script async=\"\" src=\"https://jsc.mgid.com/m/e/media.boxnovel.org.864255.js\"></script>\n<!-- Composite End -->\n</div>\n<hr class=\"chr-end\"/>\n<div class=\"chr-nav\" id=\"chr-nav-bottom\">\n<div class=\"btn-group\">\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/top-management-chapter-39\" id=\"prev_chap\" title=\"Chapter 39\">\n<span class=\"glyphicon glyphicon-chevron-left\"></span>\n<span class=\"hidden-xs\">Prev Chapter</span>\n</a>\n<button class=\"btn btn-success chr-jump\" type=\"button\">\n<span class=\"glyphicon glyphicon-list-alt\"></span>\n</button>\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/top-management-chapter-41\" id=\"next_chap\" title=\"Chapter 41\">\n<span class=\"hidden-xs\">Next Chapter</span>\n<span class=\"glyphicon glyphicon-chevron-right\"></span>\n</a>\n</div>\n</div>\n<div class=\"text-center\">\n<button class=\"btn btn-warning\" data-chr-id=\"201192\" id=\"chr-error\" type=\"button\"><span class=\"glyphicon glyphicon-exclamation-sign\"></span> Report chapter\r\n                        </button>\n</div>\n<div class=\"bg-info text-center visible-md visible-lg box-notice\">\r\n                        Tip: You can use left, right, A and D keyboard keys to browse between chapters.\r\n                    </div>\n</div>"}