{"title": "Chapter 61", "id": 61, "volume": 1, "url": "http://boxnovel.org/top-management-chapter-61", "volume_title": "Volume 1", "body": "<h1>Chapter 61</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><header class=\"entry-header\"></header></p><div class=\"entry-content content\"><br/><p>Chapter 61: Begin Filming (4)</p><br/><p>TL: emptycube / ED: Isleidir</p><br/><p>Sponsor: Moony</p><hr/><br/><p>“Do you have something to say to me?”</p><br/><p>The traitor asked.</p><br/><p>There was no need to feel surprised as I had been looking at him ever since we arrived at the Next K-Star set.</p><br/><p>Even now, my head kept coming up with various scenarios of betrayal and disputes. Within my head, I had been betrayed around a hundred times and had betrayed a hundred times as well.</p><br/><p>“Yeah.”</p><br/><p>“Do it then. Is it serious?”</p><br/><p>“No, it’s nothing like that.”</p><br/><p>I examined the traitor’s face as I said,</p><br/><p>“The chief said you were working hard on something so I was curious what it was.”</p><br/><p>“Ah… that.”</p><br/><p>He glanced at me while rubbing his thumb against his lower lip. Then his always smiling smile became slightly crooked, an awkward expression.</p><br/><p>Soon, the traitor replied in a clear voice,</p><br/><p>“Sorry, I don’t want to say it yet.”</p><br/><p>“You don’t want to?”</p><br/><p>“Let’s talk if things go well. It’ll be embarrassing if things don’t after I say it.”</p><br/><p>The traitor patted my shoulder with a smiling face.</p><br/><p>I would have become worked up if I heard this from anyone else, but this was Choi Gunyoung to boot. He was a dormant bomb that I could never let my guard down against even though he was the colleague I spent the most time with.</p><br/><p>I couldn’t let the situation continue like this.</p><br/><p>Instead of constantly thinking about when he would explode, it would be better to keep him far away…</p><br/><p>It was when I was thinking about this with a cool head.</p><br/><p>It had been a while since the world turned black.</p><br/><p>I had never welcomed this severely hazy vision this much before.</p><br/><p>How long had it been? Since I hadn’t experienced this in a long while, I consciously tried to avoid thinking about my foresight ability. An ability that appeared suddenly could disappear just as quickly, and I didn’t know how to find it again if it disappeared.</p><br/><p>I didn’t want to get my hopes up.</p><br/><p>However, now that I had the future right in front of my eyes, I could tell how much I waited for this and how relieved I was. While calming my surging emotions, I concentrated all my senses to not lose a single detail.</p><br/><p>I couldn’t tell exactly where I was.</p><br/><p>My vision had so much static, and it kept cutting off. However, what was certain was that Kim Hyunjo and the traitor were sitting in front of me. Both their hairstyles were similar to the present. There was no difference in their looks either. Kim Hyunjo wore a thick winter turtleneck.</p><br/><p>It seemed like it was a very near future.</p><br/><p>“Both Younghoon hyung and I thought that it would all be for nothing, but you really are a determined guy. You’ll do something in life.”</p><br/><p>Astonished, Kim Hyunjo laughed.</p><br/><p>With an expression that couldn’t contain his happiness, the traitor said,</p><br/><p>“You could say it’s all thanks to Sunwoo.”</p><br/><p>Thanks to me?</p><br/><p>When I wondered whether he had finally betrayed me or not, the traitor smiled.</p><br/><p>“We joined on the same day and started working at the same time, but as the gap between us kept getting wider and wider, I ended up working harder.”</p><br/><p>My vision returned.</p><br/><p>I was once again standing in front of the audience seats of the open hall. I saw the traitor when I looked to my side. He was smiling as he watched the ongoing recording. It was similar to the smile I saw in the future just now.</p><br/><p>So… It wasn’t the thing I was worried about?</p><br/><p>Looking at how Kim Hyunjo was happy, there was a high possibility that the thing the traitor was working on would be helpful to us, namely Neptune. Since Kim Hyunjo knew about it, it shouldn’t be something done with bad intentions.</p><br/><p>While I was relieved, a sudden thought crossed my mind.</p><br/><p>I had already seen the future and changed the present, and because of this, I had experienced the future changing… Could I even say that the Choi Gunyoung, who betrayed me, and the Choi Gunyoung now were the same person?</p><br/><p>This thought crossed my mind, albeit very briefly.</p><br/><p>Maybe, maybe this was the case.</p><br/><p>However, as long as I couldn’t look into Choi Gunyoung’s mind and be 100% certain, I could never sincerely trust him anymore.</p><br/><p>Also, if an opportunity of not having to see Choi Gunyoung ever presented itself, I would probably choose it.</p><br/><p>*</p><br/><p>“What did you want?”</p><br/><p>TVL’s drama department director, Bae Jangho, stopped signing files and looked up. Standing in front of him were the chief producer of Cat Guardian Ghost, General Manager Song, and Director Shin Taekyun. Just as General Manager Song was about to speak after clearing his throat, Director Shin Taekyun said,</p><br/><p>“Please give us the time slot to release a special episode.”</p><br/><p>“Hey you, to abruptly- did you leave a time slot with the director?”</p><br/><p>General Manager Song poked Director Shin Taekyun’s side. With a face, exhausted due to overnight filming and editing, Director Shin Taekyun frowned.</p><br/><p>“Wasn’t what you said last time a joke?”</p><br/><p>Director Bae asked General Manager Song.</p><br/><p>“That time, well, I said it in a half-joking, half-sincere manner, but this time, it is sincere. When I looked at the schedule, it looked like we can squeeze it in.”</p><br/><p>“Is the cast at the level of a blockbuster film?”</p><br/><p>“Pardon? No, not that high.”</p><br/><p>“Then are you confident in reaching over 10% viewership ratings?”</p><br/><p>“Director, the hurdle is too high. 10% would be a record high.”</p><br/><p>When General Manager Song said exaggeratingly, Director Bae said in a flat voice.</p><br/><p>“We’ve only given special episodes to dramas like that.”</p><br/><p>“But the situation this time is a bit different. Although it’s a hot topic right now, people’s interests are focused more on Lee Songha herself than the drama, so if we slip up, the interest in the drama might drop as soon as Lee Songha’s controversy dies down. That’s why we propose we make a special episode to brilliantly put the controversy to rest and try to absorb that interest into the drama so that interest doesn’t fade.”</p><br/><p>“…”</p><br/><p>At the heated persuasion, Director Bae rubbed his chin, seemingly taking things into consideration.</p><br/><p>Director Shin Taekyun broke the silence and said,</p><br/><p>“Then please take a look at the edit of part 1 and 2.”</p><br/><p>At his words, Director Baek put down his fountain pen.</p><br/><p>Two hours later, as Director Bae took his eyes off the black screen, he said,</p><br/><p>“I’ll get you a time slot, so try it.”</p><br/><p>4 days later, at the basement restaurant of Knet.</p><br/><p>Producer Go Joontae was talking with the chief producer, General Manager Park.</p><br/><p>“Hyung, if the episode we’re editing right now is released, I think it’ll hit 8%.”</p><br/><p>“8%? On that day, I’ll pay for the get-together.”</p><br/><p>General Manager Park, who had a fancy muffler on today as well, stirred his stew.</p><br/><p>“Why are you so confident? Was the result of editing for two nights straight amazing?”</p><br/><p>“Amazing. If it broadcasts, it’ll definitely show up on the real-time search rankings. Lee Songha and this Punchline member who raps. I’m trying to make a pink atmosphere flow between them, as if they are flirting with each other.”</p><br/><p>“What?”</p><br/><p>General Manager Park frowned. As if he didn’t see it, Producer Go Joontae smiled slyly as he continued,</p><br/><p>“It looked like the guy from Punchline is interested in Lee Songha. We’ve filmed him intensely staring at her on camera multiple times. Since Punchline has the highest popularity out of the teams, I bet if we even say ‘fl’ of ‘fling’, the reactions will be heated. Although W&amp;U are going flip out again, if we do it like las-“</p><br/><p>“Hey, I don’t think it’s a good time for that.”</p><br/><p>General Manager Park gave an awkward expression as he cut him off.</p><br/><p>“Not good?”</p><br/><p>“The director said he heard some news from TVL, and it seems like there are rumors that Cat Guardian Ghost, even if it’s not a hit, will at the very least do well. He said they even scheduled a special episode. That’s why the director told us to cast Seo Jijoon early.”</p><br/><p>“So?”</p><br/><p>“A few producers tried, but W&amp;U’s reaction is unenthusiastic, something about wanting to focus on their current project. At this rate, even I might have to go and try to persuade them. That’s why; don’t bother W&amp;U too much until we get Seo Jijoon.”</p><br/><p>Producer Go Joontae set his spoon down. His voice contained a bit of irritation.</p><br/><p>“Hyung, I worked overnight editing this. It’s amazingly put together.”</p><br/><p>“Since there’s still time before the broadcast, you can put it together again. I’m not telling to get scrap it completely, just keep it for now and use it once we get Seo Jijoon.”</p><br/><p>“No, if we ask TVL’s drama department to help us, we’ll get him in no time. They’ll have to place their leads into entertainment shows to promote their drama anyways.”</p><br/><p>“You screwed them over last time, yet you think they’re going to help?”</p><br/><p>General Manager Park clicked his tongue. Producer Go Joontae’s face distorted after recalling what happened last time. Since they were the ones who entangled Lee Songha with Cat Guardian Ghost and created controversy first, there was no way TVL’s drama department would look at them favorably.</p><br/><p>Producer Go Joontae had a sip of cold water and grumbled,</p><br/><p>“Well, in the end, it was good promotion.”</p><br/><p>“Yeah, like you said, it was great promotion. Even my daughter who doesn’t watch dramas knew what Cat Guardian Ghost was. In this situation, do you think they’ll forcefully appear on entertainment shows? When there are grand talks about a special episode?”</p><br/><p>General Manager Park had been wiping his mouth with a napkin before his eyes abruptly shined.</p><br/><p>“Hey, instead of that, what do you think about putting Seo Jijoon on Next K-Star?”</p><br/><p>“What?”</p><br/><p>“You can make whatever excuse like supporting Neptune or something when putting him on. If you get a two-shot of Lee Songha and him while they are still a hot topic, don’t you think you can hit 8%?”</p><br/><p>Producer Go Joontae’s complexion brightened as if he had never been dissatisfied in the first place.</p><br/><p>“You’re going to put him on my show? If that’s the case, I’ll happily accept.”</p><br/><p>“No, I want you to cast him.”</p><br/><p>His brightened complexion returned to its somber state.</p><br/><p>“You said even you might have to act. How am I supposed to cast him?”</p><br/><p>“You know Lee Songha’s manager, right? The one who goes with her to film shoots.”</p><br/><p>“Manager?”</p><br/><p>As if recalling his memories, Producer Go Joontae’s eyes lowered.</p><br/><p>“If he’s a manager who follows her to drama shoots, then it won’t be the chief. Then it’s one out of the two. The one who gives off a good impression and the one who doesn’t.”</p><br/><p>“I heard that Lee Songha’s manager and Seo Jijoon’s chief are good friends. How about you ask him? I heard Seo Jijoon listens to that chief.”</p><br/><p>Producer Go Joontae tilted his head as if he heard something wrong.</p><br/><p>“What do you want me to do? You want me to cling to a road manager and ask him for a favor?”</p><br/><p>“Not cling, I’m just wondering what if you asked him. It’s not like me, the chief producer, can do it. And think about it. Imagine if you, who’s good at getting high viewership ratings, cast Seo Jijoon, who other producers couldn’t get. How favorably the director will view you.”</p><br/><p>Once the director was mentioned, Producer Go Joontae’s expression softened.</p><br/><p>After thinking about it silently for a while, he opened his mouth.</p><br/><p>“… Okay, whatever, I’ll do it.”</p><br/><p>The moment General Manager Park rejoiced, Producer Go Joontae crossed his legs and added,</p><br/><p>“If that drama gets better ratings than my show.”</p><br/><p>*</p><br/><p>The air felt different this morning.</p><br/><p>Although it was a bit comical, it was true.</p><br/><p>Should I say the density of the air was higher? Or that it felt a bit heavier? Either way, it felt different from normal.</p><br/><p>I waited a long time for this day, but when deciding day was finally here, I was simply blank. Did I sleep too much? It felt like that could be why. As I yawned, looking out my window, my phone underneath my blanket vibrated.</p><br/><p>When I turned it on after fumbling for it, I had a ton of texts and messages.</p><br/><p>There were some from my parents and my brother’s family, and some from my friends.</p><br/><p>There were also ones from Reporter Park Woojeong, company employees, Neptune, and even from TVL and Pan Production. Besides them, I also received some from reporters, producers, and writers I didn’t know the names of. Although it felt like my phone became more popular once I started this job, today was a record high.</p><br/><p>Looking through them, there was a common narrative among them.</p><br/><p>‘I saw the article.’</p><br/><p>I got up and sat in front of my laptop.</p><br/><p>As soon as I accessed the portal site, a headline caught my attention on the homepage.</p><br/><p>{‘Cat Guardian Ghost’ Special Episode, Staff are going to ‘put the controversies to rest before proceeding’.}</p><br/><p>{The much-discussed ‘Cat Guardian Ghost’ will be unveiling itself tonight with a special episode.}</p><br/><p>After seeing that, my mind became clear.</p><br/><p>It really was today.</p><br/><p>Today was the day Cat Guardian Ghost would begin broadcasting, starting with a special episode. Also, like the confident comments on the headlines, it was also the day the controversies, which went on for over a month, would be put to rest.</p><br/><p>I took deep breaths before examining the public’s opinion on the internet.</p><br/><p>-Put the controversies to rest before proceeding? Look at the staff’s spirit *shiver*</p><br/><p>-They are finally doing it lol I waited for this more than my year-end bonus lol I’m not really interested in the drama but very curious of Lee Songha’s acting skills.</p><br/><p>-If her acting is terrible after making this into such a hot topic, it’ll become a notorious con.</p><br/><p>-It might become a notorious reversal.</p><br/><p>-Since there are a lot of people waiting to put her down, it’ll be difficult to reverse things with decent acting. If only they didn’t talk about Lee Songha being a genius to the press, she wouldn’t have such extreme haters.</p><br/><p>-It’ll be hard with decent acting skills. It looks like she needs to method act for them to acknowledge and praise her.</p><br/><p>-Look at how hot this topic is after all this time since the controversy broke out *shiver* I bet it’ll be funny af just watching people’s reactions. I’ll prepare some beer beforehand.</p><br/><p>Reading through them, my lips unconsciously curled into a smile.</p><br/><p>The reactions were the hottest yet.</p><br/><p>The people who would write hate comments directed at Lee Songha, the people who would watch this with interest, and those who would cheer her on as fans, they joined together to create a massive wave. Whether they had good motives or bad, everyone would sit in front of the TV tonight.</p><br/><p>That was enough for now.</p><br/><p>I closed my laptop. A few questions hovered over my head.</p><br/><p>How well would Cat Guardian Ghost do? Once the cast changed and it was swept up in an enormous controversy, it was already vastly different from the drama I saw in the future. However, I had seen Director Shin Taekyun’s directing skills and the cast’s acting.</p><br/><p>I didn’t think drama would flop, not one bit.</p><br/><p>What I was curious about was how successful would it be?</p><br/><p>Also, with today as a starting point, what would change by how much?</p><br/><p>I took a shower to clear my mind and leisurely prepared to go to work. There wasn’t a Next K-Star recording or Cat Guardian Ghost filming today. Neptune members were to stay home today, and Kim Hyunjo, the traitor, and I were going to meet at the company before heading to their residence.</p><br/><p>We planned on watching Cat Guardian Ghost’s special episode together like when we monitored Next K-Star’s first broadcast last time.</p><br/><p>I put my laptop in my bag and left my apartment.</p><br/><p>Then, 8 hours later, I placed my laptop on my knees then clicked the refresh button.</p><br/><p>-I’m on my way home from work, did Cat Guardian Ghost start?!</p><br/><p>-They are still playing commercials. Ah, they ended now.</p><br/><p>-It’s starting!</p>\n</div>\n<div style=\"max-width: 870px;margin: 5px auto;background: repeating-linear-gradient( 45deg, #fff6cc, #fff6cc 5px, #f3ecc7 5px, #f3ecc7 10px );\">\n<!-- Composite Start -->\n<div id=\"M562762ScriptRootC864255\">\n</div>\n<script async=\"\" src=\"https://jsc.mgid.com/m/e/media.boxnovel.org.864255.js\"></script>\n<!-- Composite End -->\n</div>\n<hr class=\"chr-end\"/>\n<div class=\"chr-nav\" id=\"chr-nav-bottom\">\n<div class=\"btn-group\">\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/top-management-chapter-60\" id=\"prev_chap\" title=\"Chapter 60\">\n<span class=\"glyphicon glyphicon-chevron-left\"></span>\n<span class=\"hidden-xs\">Prev Chapter</span>\n</a>\n<button class=\"btn btn-success chr-jump\" type=\"button\">\n<span class=\"glyphicon glyphicon-list-alt\"></span>\n</button>\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/top-management-chapter-62\" id=\"next_chap\" title=\"Chapter 62\">\n<span class=\"hidden-xs\">Next Chapter</span>\n<span class=\"glyphicon glyphicon-chevron-right\"></span>\n</a>\n</div>\n</div>\n<div class=\"text-center\">\n<button class=\"btn btn-warning\" data-chr-id=\"201235\" id=\"chr-error\" type=\"button\"><span class=\"glyphicon glyphicon-exclamation-sign\"></span> Report chapter\r\n                        </button>\n</div>\n<div class=\"bg-info text-center visible-md visible-lg box-notice\">\r\n                        Tip: You can use left, right, A and D keyboard keys to browse between chapters.\r\n                    </div>\n</div>"}