{"title": "Chapter 68", "id": 68, "volume": 1, "url": "http://boxnovel.org/top-management-chapter-68", "volume_title": "Volume 1", "body": "<h1>Chapter 68</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><header class=\"entry-header\"></header></p><div class=\"entry-content content\"><br/><p>Chapter 68: The Most Important Thing in This Industry, Decision-Making (6)</p><br/><p>TL: emptycube / ED: Isleidir</p><br/><p>Sponsors: kirindas and G.P.</p><hr/><br/><p>1<sup>st</sup> episode, average 7.9%. Peak ratings 8.3%.</p><br/><p>2<sup>nd</sup> episode, average 8.2. Peak ratings 9.1%.</p><br/><p>They were only a few numbers.</p><br/><p>Yet the effect these numbers brought along was tremendous.</p><br/><p>It was like a gust, no, a storm. Everyone I met this weekend congratulated me as they stopped me in my tracks. I even received almost a hundred text messages. I thought my fingerprints would rub off after replying to each and every one of them.</p><br/><p>Still, I wasn’t annoyed in the slightest. Instead, there was nothing more rejuvenating.</p><br/><p>Every time I was congratulated, it felt like I was being rewarded for all the hardships I had endured up until now. It felt like my feet weren’t planted on the ground but instead floating in the air. Since my heart would swell with pride all the time, there were many times when I smiled unwittingly.</p><br/><p>On the other hand, it also felt a bit odd.</p><br/><p>The people who didn’t even look at me properly when I greeted them multiple times, the people who half-heartedly tossed the Neptune album CD I gave them to the side, and the people who seemed to make sarcastic remarks for us to hear during Lee Songha’s ‘add-on’ controversy.</p><br/><p>I felt odd because it was rather these people who sent texts full of flattery.</p><br/><p>No matter how much people was ratings and popularity was everything in this industry, their change in attitude was all too transparent.</p><br/><p>Also, the person that dumbfounded me the most out of those people was Producer Go Joontae.</p><br/><p>After sending me an artful text congratulating me, he suddenly asked if we could meet, which was why I was currently waiting in a coffee shop near Knet for him.</p><br/><p>When I turned around after ordering, I halted.</p><br/><p>There was a familiar poster posted to the left of the counter. It was a poster of the Cat Guardian Ghost cast. It seemed this coffee shop put it up as it was also an affiliate of the same enterprise as TVL and Knet.</p><br/><p>Even among the glamorous faces, the only one that caught my eye was Lee Songha.</p><br/><p>It was while I was staring at the poster with a happy expression for quite some time.</p><br/><p>“Would you like one?”</p><br/><p>When I turned around, an employee handed me my coffee. Then he smiled as if he completely understood.</p><br/><p>“I asked because you were constantly staring at Lee Songha. After we put this poster up, there were quite a few customers asking if they could get one.”</p><br/><p>“Really?”</p><br/><p>“Normally, we can’t, but since we don’t have any other customers right now, I can get one for you. I too took one home because of Lee Songha. I don’t know who took the picture, it came out spectacular. No matter how many times I see it, my eyes are happy.”</p><br/><p>I said to the chattering employee,</p><br/><p>“She doesn’t just look good in pictures. Someone I know saw her and said she looked much more beautiful in real life.”</p><br/><p>“Really? She’s prettier than her picture?”</p><br/><p>“That’s why the photographer who took her picture felt regretful.”</p><br/><p>After bragging about Lee Songha as if I didn’t know her, I received a poster. Although I already had one at home, the more the better.</p><br/><p>As soon as I sat on the sofa, my phone rang.</p><br/><p>Since it was a casting call, I quickly took out my pen and notebook. Ever since the drama began doing well, the number of casting calls I received increased significantly. They weren’t anything big, and although they intended to cast Lee Songha as the focus and the other girls as extras, it was better than nothing. Compared to a few months ago, it was a change that could make one hula dance in joy.</p><br/><p>“Yes. I will check their schedule and get back to you, Ms. Writer.”</p><br/><p>I said in a gentle voice when the sofa in front of me moved.</p><br/><p>His appearance cleaner than normal, Producer Go Joontae greeted me with his eyes as he sat.</p><br/><p>As soon as I hung up, he asked as he glanced at my notebook,</p><br/><p>“It seems there are a lot of places asking for Ms. Songha? Well, since the drama’s ratings are over 8%… I heard that its ratings are 4<sup>th</sup> in the all-time rankings for cable dramas. I heard that TVL’s drama department are in a festive mood right now. It’s not like we are strangers, I asked to see you to congratulate you on behalf of Next K-Star.”</p><br/><p>Even though he said he wanted to congratulate me, his expression was sour.</p><br/><p>Well, his stomach must be aching quite a bit.</p><br/><p>Although Next K-Star was also a popular program that kept surpassing its previous week’s ratings, it hadn’t passed 8% yet. While they had been eager for it to surpass 8%, Cat Guardian Ghost had surpassed it in two episodes.</p><br/><p>Also, looking at the audience reactions and experienced popularity, it seemed it would go even higher.</p><br/><p>After taking a sip of coffee, I said,</p><br/><p>“The reactions were better than we expected so we are expectant of the future. We are even discussing changing our public pledge from 8 or 9% to 10%.”</p><br/><p>“10%?!”</p><br/><p>Producer Go Joontae’s eyes widened.</p><br/><p>“It’s because our peak ratings passed 9%. At this rate, we think that 10% doesn’t seem impossible.”</p><br/><p>Hearing my words, Producer Go Joontae looked like he had swallowed a bug. The more he did, the deeper the smile on my face became. I wondered when I had ever felt so at peace in front of him before.</p><br/><p>I was leisurely savoring my coffee when Producer Go Joontae licked his lower lip and said,</p><br/><p>“Umm, that’s why our staff came up with this idea.”</p><br/><p>“Yes.”</p><br/><p>“They say to strike while the iron’s hot. We think Cat Guardian Ghost can gain more momentum with a bit of promoting. What do you think about having Mr. Seo Jijoon appear as a special guest on the last mission, the open concert?”</p><br/><p>This was it. What congratulations? I knew you would bring this up.</p><br/><p>I shrugged my shoulders, saying.</p><br/><p>“Rather than me, I think it’ll be better if you contacted our PR team or Chief Lee Bongjoon…”</p><br/><p>Of course, you would be rejected immediately.</p><br/><p>I heard that casting requests from other directors were being rejected so there was nothing more to say about Producer Go Joontae as Team Leader Park already had her fiery glare directed at him. While I too was waiting for an opportunity to screw Producer Go Joontae over, Team Leader Park was no joke.</p><br/><p>Producer Go Joontae licked his lips.</p><br/><p>“Some other place had already contacted them, but they said things didn’t go well.”</p><br/><p>“That will probably because Mr. Seo Jijoon said he wanted to solely focus on the project. The company is trying to listen to our actors’ opinions the best we can.”</p><br/><p>At my words, Producer Go Joontae became more courteous.</p><br/><p>“I heard Mr. Sunwoo was close with the chief in charge of Seo Jijoon.”</p><br/><p>Oh, goody.</p><br/><p>“Couldn’t we change Seo Jijoon’s mind if we asked through Chief Lee? It’s not like it’s difficult to show his face and cheer his company juniors on. I’ll even edit the episode incredibly.”</p><br/><p>You almost ended Lee Songha’s image with your editing, this guy.</p><br/><p>Also, what have you done for me to want to cast Seo Jijoon for you?</p><br/><p>My expression clearly showed how dumbfounded I was. As if making an excuse, Producer Go Joontae said,</p><br/><p>“I sprinkled a bit of MSG<sup>{1}</sup> until now because the ratings needed a little push, but I had no choice since the program had to survive for its cast to as well. I intended to take care of Neptune and Lee Songha’s image with editing before the program ended. Really.”</p><br/><p>I just wanted to smack his mouth.</p><br/><p>If I could, I wanted to pour shit on him by the truckload.</p><br/><p>Just as I was about to firmly reject him; a sudden thought crossed my mind.</p><br/><p>After acting like I was considering it for a while, I nodded.</p><br/><p>“Then I’ll bring it up with Chief Lee. Don’t get your hopes up though.”</p><br/><p>Producer Go Joontae’s complexion brightened. Then he asked right away,</p><br/><p>“Will you really? Really?”</p><br/><p>Of course, it was a lie.</p><br/><p>Even if Seo Jijoon said he would, I wanted to hold him by his leg and tell him not to, so unless I was crazy, how could I? Only, I planned on dragging this bait for a bit longer. While I had Seo Jijoon as bait, Producer Go Joontae couldn’t use Neptune and Lee Songha as kindling for his ratings.</p><br/><p>Well, either way, I did tell him not to get his hopes up.</p><br/><p>“Did something good happen?”</p><br/><p>Lee Songha asked, sitting in the passenger’s seat next to me.</p><br/><p>As we had to talk with Team Leader Park about the public pledge, we were on our way to the company together. When I glanced next to me, Lee Songha was looking at me while munching on chocolate-coated biscuit sticks.</p><br/><p>“Why? Does it look like something good happened?”</p><br/><p>“Yes.”</p><br/><p>Her reply was accompanied by a rustling sound. Then something solid poked my lips. It was a biscuit stick. While I casually received it, I felt a little strange.</p><br/><p>Why was she trying to feed me these days?</p><br/><p>If one of the other girls did it, I would have eaten it without any thought, but it was Lee Songha. She was a girl who even wrote her name on the ice cream container in fear someone might eat it. But she gave me pieces of beef during the first episode broadcast get-together, and even afterwards, she kept sharing things with me.</p><br/><p>Did I look hungry?</p><br/><p>I did become all skin and bones due to the film shoots these days.</p><br/><p>While thinking this, I quickly replied since Lee Songha was waiting,</p><br/><p>“It’s all because of you…”</p><br/><p>The munching sounds paused.</p><br/><p>“After your drama became a hit, I have been flooded with calls from people congratulating me and casting calls. This is a first. Working feels worthwhile because of you.”</p><br/><p>Since I didn’t hear a reply, I looked towards my side and saw Lee Songha smiling silently.</p><br/><p>Ah. It was regretful that I was driving. I should have taken a picture.</p><br/><p>I recalled the Cat Guardian Ghost poster I had in my bag. Even though she didn’t have any makeup on right now, she was much prettier than her face on that poster. To the point it was a shame to see it by myself.</p><br/><p>“… Oppa.”</p><br/><p>“Hmm?”</p><br/><p>“You said that you originally wanted to be assigned to an actor.”</p><br/><p>How long has it been since I said that? Don’t tell me it was bothering her still?</p><br/><p>When I turned towards her, Lee Songha’s face had turned towards the window.</p><br/><p>“I did.”</p><br/><p>Well, to be honest, I was only okay with it because I was with Neptune. I didn’t feel inclined towards being assigned to some other singer. I clearly liked actors. I liked dramas and movies. I felt this once more while going through Cat Guardian Ghost with Lee Songha.</p><br/><p>Although it was tough enough to make you cry, it was also just as enjoyable.</p><br/><p>Either way, I was about to say that I was perfectly satisfied right now, but Lee Songha asked me first,</p><br/><p>“Then you probably don’t think about it anymore?”</p><br/><p>She continued with a quiet voice,</p><br/><p>“Because of me.”</p><br/><p>Lee Songha was still staring at the window. I couldn’t see what sort of expression she had due to her long, luscious hair. I looked down at her hands. Her fingers were fidgeting with the biscuit sticks a whole lot.</p><br/><p>I smiled as I replied,</p><br/><p>“Yeah. Because of you.”</p><br/><p>It seemed this company had tons of log bridges.<sup>{2}</sup></p><br/><p>I kept meeting my enemies all the time.</p><br/><p>I was entering the PR team’s office with Lee Songha when I suddenly stood still. Son Chaeyoung and Chief Jo were talking with Team Leader Park inside.</p><br/><p>Were they hassling Team Leader Park again?</p><br/><p>Leaning on one leg, Son Chaeyoung said,</p><br/><p>“Please release an interview saying that I readily voted in favor for editing the script since the viewers and the fans of the original work wanted it. If the script is edited, then I need to re-analyze it again and I might even be sent 1-2-page scripts, so I need to take as much credit for it as I can.”</p><br/><p>Mermaid out of Water had fallen into the mud.</p><br/><p>In the future, they said that they redid the entire script, saying they would reflect on the fans of the original work’s opinions, before it flopped as too many people got involved. While fireworks were going off in my mind, I heard Team Leader Park’s worried voice.</p><br/><p>“The script is good right now. I’m not sure if the staff are being too greedy,”</p><br/><p>“If we want to surpass 20%, we have to be a little greedy, team leader.”</p><br/><p>She said, burning with desire. Team Leader Park let out a sigh as she nodded. Listening to those two talk, Chief Jo read Son Chaeyoung’s expression before saying,</p><br/><p>“It’s because the production company and PBS pushed hard for it, the writer was reluctant to.”</p><br/><p>“PBS’s opinion is important. Oppa, does the writer give the best performance award? PBS does.”</p><br/><p>What best performance award? What big dreams she had.</p><br/><p>Well, they did say a drama evaluation article picked it as the worst drama.</p><br/><p>After saying a few more words to Team Leader Park, Son Chaeyoung quickly turned around.</p><br/><p>Then, as soon as she discovered Lee Songha and me, her expression swelled with irritation. We weren’t glad to see you either. As we entered the office, I glanced at Lee Songha to see if she was okay since she did throw a cake at her the last time they met.</p><br/><p>Luckily, she seemed to her normal calm.</p><br/><p>Although Son Chaeyoung looked like she had a ton to say, it seemed she was barely holding it in because Chief Jo held her back. Well, this place had too many watching eyes for her to scream and flaunt her wickedness.</p><br/><p>Stomping on the floor as she passed by, she stopped and looked at me.</p><br/><p>Then she said,</p><br/><p>“I didn’t watch it, her drama.”</p><br/><p>So what?</p><br/><p>Wasn’t she the one who said it was basic manners to watch her drama since we all worked in the same company?</p><br/><p>I burst into laughter when Lee Songha, who had simply been standing by, said to the back of Son Chaeyoung’s head.</p><br/><p>“I didn’t watch yours either.”</p><br/><p>Son Chaeyoung abruptly turned her head. Her gaze towards Lee Songha was fierce.</p><br/><p>I quickly pulled Lee Songha’s arm and hid her behind me.</p><br/><p>Son Chaeyoung’s shoulders heaved up and down as if she was about to shout any moment. Chief Jo took her away after almost begging her to leave. If this place wasn’t the PR team’s office and if the employees were glancing at us, I felt that a season 2 of the cake throwing incident would break out.</p><br/><p>“Did you really not see Son Chaeyoung’s drama?”</p><br/><p>When I asked Lee Songha, she covertly avoided my eyes as she told the truth,</p><br/><p>“I did see it. With the unnies…”</p><br/><p>“Why did you go and see her face on TV as well? Don’t watch it from now on.”</p><br/><p>I said in a small voice. She quickly nodded her head.</p><br/><p>I was thinking that I should show her when it dropped to 3% ratings when I felt someone’s gaze on the back of my head. When I turned around, Team Leader Park was looking at Lee Songha and me. Her cheeks sunken after being pestered by Son Chaeyoung, she smiled.</p><br/><p>“My heart is at peace now that you came. So are my ears.”</p><br/><p>“You had a hard time.”</p><br/><p>I sincerely consoled her.</p><br/><p>After seating Lee Songha and me in front of her, Team Leader Park got to the point.</p><br/><p>She said that, since we were already planning on a public pledge once we reached a certain rating, she thought about combining Lee Songha and Seo Jijoon’s pledges together. Since it was difficult to control the crowd out in the streets, she asked what we thought about renting a theater and watching the episode broadcast with fans as well as holding a small fan meeting.</p><br/><p>Lee Songha and I, well, we simply nodded our heads.</p><br/><p>Team Leader Park took a while as she told us things to be careful of during the fan meeting and things we had to prepare for. I looked beside me while taking notes, and Lee Songha looked serious as well. After finishing what she had to say, Team Leader smiled happily.</p><br/><p>“You’ll be busier from now on. There aren’t any difficulties with the two of you working together, right?”</p><br/><p>“Nope.”</p><br/><p>Lee Songha was the first to reply. I nodded my head as well.</p><br/><p>Team Leader Park revealed a motherly smile.</p><br/><p>Now that we had pretty much discussed what we needed, I said my farewells and got up. But Lee Songha didn’t get up right away and instead hesitated.</p><br/><p>Then she looked up at me and said,</p><br/><p>“I’ll be down later; I have a few questions to ask Team Leader Park.”</p><br/><p>“You want to? Then I’ll be waiting in the van so come down whenever.”</p><br/><p>I had wanted to go down first and turn the heater on so it was good. The inside of the van would be ice-cold because of the cold weather outside. She was barely maintaining her constantly reducing stamina with food, it would be bad if she caught a cold like this.</p><br/><p>Leaving Lee Songha behind, I left the office.</p><br/><p>Just as I entered the elevator, my phone in my pocket vibrated. I took it out while humming, thinking it was another casting call, but it was Kim Hyunjo. After a brief greeting, Kim Hyunjo cut straight to the point.</p><br/><p>-Let’s talk later about Taehee’s song.</p><hr/><br/><p><sup>{1}</sup> Monosodium glutamate (MSG), it is used as a flavor enhancer in food, despite lacking any flavor itself, and is typically used in Asian cooking.</p><br/><p><sup>{2}</sup> Refers to a Korean idiom, ‘encountering one’s enemy on a log bridge’, which means to encounter your enemy at the worst place and time.</p>\n</div>\n<div style=\"max-width: 870px;margin: 5px auto;background: repeating-linear-gradient( 45deg, #fff6cc, #fff6cc 5px, #f3ecc7 5px, #f3ecc7 10px );\">\n<!-- Composite Start -->\n<div id=\"M562762ScriptRootC864255\">\n</div>\n<script async=\"\" src=\"https://jsc.mgid.com/m/e/media.boxnovel.org.864255.js\"></script>\n<!-- Composite End -->\n</div>\n<hr class=\"chr-end\"/>\n<div class=\"chr-nav\" id=\"chr-nav-bottom\">\n<div class=\"btn-group\">\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/top-management-chapter-67\" id=\"prev_chap\" title=\"Chapter 67\">\n<span class=\"glyphicon glyphicon-chevron-left\"></span>\n<span class=\"hidden-xs\">Prev Chapter</span>\n</a>\n<button class=\"btn btn-success chr-jump\" type=\"button\">\n<span class=\"glyphicon glyphicon-list-alt\"></span>\n</button>\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/top-management-chapter-69\" id=\"next_chap\" title=\"Chapter 69\">\n<span class=\"hidden-xs\">Next Chapter</span>\n<span class=\"glyphicon glyphicon-chevron-right\"></span>\n</a>\n</div>\n</div>\n<div class=\"text-center\">\n<button class=\"btn btn-warning\" data-chr-id=\"201249\" id=\"chr-error\" type=\"button\"><span class=\"glyphicon glyphicon-exclamation-sign\"></span> Report chapter\r\n                        </button>\n</div>\n<div class=\"bg-info text-center visible-md visible-lg box-notice\">\r\n                        Tip: You can use left, right, A and D keyboard keys to browse between chapters.\r\n                    </div>\n</div>"}