{"title": "Chapter 62", "id": 62, "volume": 1, "url": "http://boxnovel.org/top-management-chapter-62", "volume_title": "Volume 1", "body": "<h1>Chapter 62</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><header class=\"entry-header\"></header></p><div class=\"entry-content content\"><br/><p>Chapter 62: Begin Filming (5)</p><br/><p>TL: emptycube / ED: Isleidir</p><hr/><br/><p>TVL. Master control room.</p><br/><p>This place was noisier than a marketplace today. From employees responsible for airing to employees from other teams, they were all scrambling noisily while waving banknotes.</p><br/><p>“2.5% for me.”</p><br/><p>“Don’t you know that it’s damn hot right now? 3% for me.”</p><br/><p>“3.3%.”</p><br/><p>“Stop! Stop! The director is coming!”</p><br/><p>As soon as someone shouted hurriedly, the control room’s door flung open. Then Director Bae and General Manager Song of the drama department, as well as Director Shin Taekyun, entered. As it was a drama with so much interest, they planned on tracking the viewership rating in the master control room today.</p><br/><p>The people who had been whispering amongst each other quickly left while clearing their throats.</p><br/><p>“You’re betting on the viewership rating again.”</p><br/><p>The technical director showed a bashful smile at General Manager Song’s words. General Manager Song intercepted a post-it, which had the evidence of betting on the viewership ratings, and read it.</p><br/><p>“Almost all are 3%?”</p><br/><p>“Because the reactions are so heated, everyone held higher standards. Still, with this mood, it might reach 4% if we’re lucky…”</p><br/><p>“I bet 50,000 won<sup>[1]</sup> that it’ll be higher than 4%.”</p><br/><p>General Manager Song took out a banknote from his wallet. The master control room employees showed startled expressions.</p><br/><p>“General manager, isn’t that too much?”</p><br/><p>“There are tons of dramas that don’t reach 4% by the time they end.”</p><br/><p>“I bet on 5%.”</p><br/><p>It was Director Shin Taekyun this time. A 50,000-won-bill swayed in his hand.</p><br/><p>The technical team and programming team employees read the mood as they accepted their money. Afterwards, they whispered to each other that those men probably counted their chickens before they hatched in quiet voices so they wouldn’t hear.</p><br/><p>However, the employees had to retract their thoughts in a few minutes.</p><br/><p>“2 minutes in… Huh?”</p><br/><p>The assistant manager, who had been checking the time, halted after checking the graph recording the minute ratings in real-time. TVL’s minute ratings were rising at a rate incomparable to other cable channels on at the same time.</p><br/><p>“This, right now, uh, what the, it’s already over 2%?”</p><br/><p>“What? Is that true?”</p><br/><p>A programming team employee read the mood behind him as he even tapped on the monitor. During this time, the line on the graph was quickly rising at a steep angle.</p><br/><p>The technical director gulped his saliva and mumbled,</p><br/><p>“How high will it rise?”</p><br/><p>“Don’t tell me it’s going to reach 3% before it starts?”</p><br/><p>Then that possibility became a reality.</p><br/><p>“We-we reached 3% minute ratings at the start!”</p><br/><p>At the better-than-expected start, the master control room became noisy.</p><br/><p>Cat Guardian Ghost’s title screen flashed by. Then the best highlights picked from the edited version swept through. Cuts of the lead and supporting actors passed by at a breathtaking pace until it came to a sudden stop.</p><br/><p>It was Lee Songha.</p><br/><p>As if the director had planned it this way, there were a ton of highlight scenes of Lee Songha.</p><br/><p>The technical director forgot to pay attention to the graph as he looked at the screen.</p><br/><p>He had expected she would be good at acting since there had been a rumor that she was a great actress spreading within TVL. However, he didn’t have high hopes. While he was in charge of the broadcasting in the master control room, he had seen his fill of actors who received high praise. Therefore, most things he saw weren’t exciting anymore.</p><br/><p>However, he clicked his tongue.</p><br/><p>‘Do you think I would have said that she was a natural without any truth? I even asked her to get psychological counseling.’</p><br/><p>An interview with a camera operator followed after veteran actress Jang Yoonok’s words.</p><br/><p>‘Why, you know those actors that come up occasionally. The ones that seem possessed by their character? I sometimes got shivers when I looked at her through a camera.’</p><br/><p>The scene changed to the film set. A Lee Songha with a cold, depressed expression was edited next to a different Lee Songha, who was following behind her manager to maximize their contrast.</p><br/><p>The technical director nodded his head without knowing.</p><br/><p>Wouldn’t this be what people call possessed?</p><br/><p>“Uh… I-it passed 4%!”</p><br/><p>At the cracking voice, the technical director came to his senses.</p><br/><p>Everyone looked at the minute ratings monitor. The moment they saw the graph, which had passed 4%, someone screamed in excitement. Soon after, a round of applause broke out.</p><br/><p>“We’re almost triple GTBN right now, triple!”</p><br/><p>“A-at this rate, won’t it really reach 5%?”</p><br/><p>General Manager Song clenched his fists.</p><br/><p>“Director, what did I say? This is a hit! As soon as it’s been unveiled, the ratings passed 4%, 4%! If it’s like this, we can compete against public networks!”</p><br/><p>Director Bae nodded. Although he had a serious face, he too was stealthily clenching his fists.</p><br/><p>“Director Shin, Shin Taekyun! You worked hard, buddy! Now, all we need to do is keep rising to the top! First, let CEO Kim Pansuk and W&amp;U’s CEO Baek Hansung know the news, no, I’ll personally call-“</p><br/><p>“Please watch quietly, general manager.”</p><br/><p>Director Shin Taekyun said. He hadn’t taken his eyes off the minute by minute ratings for a while now. The chattering employees, director, and even the general manager once again looked at the monitor. No one could open their mouths.</p><br/><p>Within the silence filled with excitement, the ratings graph gradually rose higher.</p><br/><p>Son Chaeyoung was sitting on her sofa with her legs crossed as she stared at her TV.</p><br/><p>There was only one thought on her mind.</p><br/><p>Fail.</p><br/><p>Because of Lee Songha and her manager, whom she didn’t want to see, she had a loss of appetite these days. She was the kind of person who couldn’t do anything if something bothering her. Only once she saw that drama go under with less than 1% ratings would her mind be at peace.</p><br/><p>Veteran actress Jang Yoonok’s interview sounded from the TV.</p><br/><p>‘Do you think I would have said that she was a natural…’</p><br/><p>Son Chaeyoung, who had been biting her nails, threw whatever she could get her hands on at the TV.</p><br/><p>“Aren’t her eyes skewed? Well, that’s probably why she’s doing cable with her experience.”</p><br/><p>Soon the screen changed to show a scene of Lee Songha acting in the role of Jung Haewon. Son Chaeyoung unconsciously lowered her arm at the chilling scene.</p><br/><p>Her hairs stood on their end.</p><br/><p>She bit hard on her lower lip. Unable to continue looking at the screen any longer, she took her eyes off it and irritably pulled her laptop close. In times like these, it was best to look at hate comments swearing at Lee Songha to change her mood. Her mind would quickly relax like a calm lake.</p><br/><p>As soon as she opened a portal site, Lee Songha’s name was first on real-time search rankings.</p><br/><p>Even the articles on the main page and the countless articles below it all had Lee Songha’s name on them. The keywords were ‘sweeping away her acting controversy’. ‘netizens’ applause’, ‘best acting’…</p><br/><p>Reporters, what do they know?</p><br/><p>Comments. Comments will be fine. Haters don’t change.</p><br/><p>She went to a site that would indiscriminately curse and hate female celebrities. There were tons of related articles and comments. Son Chaeyoung’s lips curled upwards.</p><br/><p>-It looks like the director ground his teeth to make this and put the controversies to rest. Just look at this we can tell she’s good at acting.</p><br/><p>-Are all the people who had been swearing at her, saying she wouldn’t be good at acting, kicking their blankets? It’s so quiet. I knew this would happen.</p><br/><p>-With no experience, and no talks about her learning acting for a long time, she got hate because they said she was a natural or whatever, at looking at her now, it seems saying that she’s a natural was reasonable. It doesn’t even look like she’s acting.</p><br/><p>-Even Jang Yoonok asked her to consult with a psychologist. I’m a little worried tbh.</p><br/><p>-But it looks like this will have incredibly high ratings. The drama looks like a heck of a lot of fun.</p><br/><p>“What is this!”</p><br/><p>Astonished, Son Chaeyoung threw her laptop. Still angry, she threw her remaining pots, remote, and even the Mermaid out of Water script in irritation.</p><br/><p>Nervously going back and forth in her living room, Son Chaeyoung called Chief Jo. A commercial was playing after the Cat Guardian Ghost broadcast had ended.</p><br/><p>“Oppa, what were its ratings? You checked, right?”</p><br/><p>When she shouted fiercely, Chief Jo mumbled in a reluctant voice.</p><br/><p>-That is, umm, Chaeyoung…</p><br/><p>“What were its ratings?! 2%? 3%?”</p><br/><p>-So that is, that… Haaa.</p><br/><p>Son Chaeyoung’s forehead distorted at the ominous sigh.</p><br/><p>“…. Don’t tell me it’s 4%?”</p><br/><p>-Chaeyoung. Once Mermaid out of Water comes out, it’ll get great ratings too. You can get twice, no, triple the ratings of Cat Guardian Ghost. So….</p><br/><p>“That’s obvious! So what are its ratings?!”</p><br/><p>-I’ll te-text you.</p><br/><p>Chief Jo hung up as if he was distancing himself from a bomb. Then, a few seconds later, a text appeared on her phone. After hurriedly checking it, Son Chaeyoung stiffened. She blinked her eyes but the number didn’t change.</p><br/><p>“Nonsense…”</p><br/><p>A chaotic aura appeared in her eyes.</p><br/><p>Soon after, Son Chaeyoung began screaming as she smashed the items around her.</p><br/><p>At the same time, a low laughter echoed in the CEO’s office at W&amp;U.</p><br/><p>“If it’s like this from the start, then I’ll expectant how high it’ll go from now. Don’t worry about her condition. I’ll look out for her, and even now… she has a good manager.”</p><br/><p>After exchanging a few more pleasant words, CEO Baek Hansung hung up.</p><br/><p>After placing his phone down, he stood up from his chair. Then he walked a few steps and stood in front of a wall. It was packed with pictures of celebrities under W&amp;U.</p><br/><p>He rubbed his lips as he gazed at an empty space. It was the place Sung Dowon’s picture had been hung. Thinking about putting Lee Songha there instead, he suddenly lowered his gaze.</p><br/><p>He looked at a picture of a brightly smiling Son Chaeyoung.</p><br/><p>He silently looked at the picture before stretching his hand out.</p><br/><p>With the tip of his long finger, he tapped on her face as if in thought.</p><br/><p>And in Jongno District. In G-Today’s entertainment department’s office.</p><br/><p>Reporter Park Woojeong glanced at the clutter of references and materials on her desk as she passionately tapped on her keyboard. Her hair, which she pulled on intermittently, had already become a rat’s nest.</p><br/><p>Other employees passed by her while clicking their tongues. Not caring about them, she leaned her face closer to the monitor as if she was about to crawl in it. Her screen was scattered with Cat Guardian Ghost’s broadcast, real-time search rankings, and reaction comments.</p><br/><p>“”Hey, what are you doing?”</p><br/><p>Surprised, she turned around to see a man with a messy beard standing behind her.</p><br/><p>“Ah, general manager.”</p><br/><p>“Don’t you know that everyone’s pouring out articles about Lee Songha? You should be publishing articles even a second faster, why are you holding onto it so much?”</p><br/><p>“I’m a bit close with Lee Songha’s manager so I wanted to write it earnestly… I’ll publish it immediately!”</p><br/><p>“No, no, wait!”</p><br/><p>Hastily grabbing Reporter Park Woojeong’s shoulder, her general manager asked,</p><br/><p>“You’re close with Lee Songha’s manager?”</p><br/><p>“Yes.”</p><br/><p>“Hey, you should have told me. People are desperately trying to get an interview with Lee Songha and anyone involved right now.”</p><br/><p>Her general manager’s eyes shined as he added,</p><br/><p>“Ask the manager for an interview.”</p><br/><p>*</p><br/><p>Kim Hyunjo frowned. After looking back at his phone a couple times, he asked again,</p><br/><p>“What percent was it?”</p><br/><p>While listening to what the other side was saying, Kim Hyunjo’s expression gradually turned strange. Like meerkats, we stretched our necks and looked at Kim Hyunjo.</p><br/><p>Just what was it? What percent was it? I was so curious I could die. It must have done better than Next K-Star since people’s reactions were incomparably more heated than that. Also, internet aside, my phone was creating a fuss for a while now. The calls and messages this morning were cute compared to right now. I felt that my fingerprints would wear out writing all those replies.</p><br/><p>Just then, Kim Hyunjo hung up. Im Seoyoung immediately asked,</p><br/><p>“What percent was it?! Quickly, quickly tell me! I’m going to die of anticipation!”</p><br/><p>Kim Hyunjo slumped onto the sofa.</p><br/><p>Then he looked at each of us once, especially Lee Songha and me.</p><br/><p>“5<sup>th</sup> place in TVL’s all-time drama ratings was 5.9%. Winter Sun.”</p><br/><p>What was this all of a sudden?</p><br/><p>“But they said Cat Guardian Ghost hit 6% today. Since they only have the real-time ratings right now, we won’t know precisely until tomorrow, but it won’t be much different.”</p><br/><p>For a moment, no one showed any sort of reaction. Everyone was probably deciphering the number Kim Hyunjo had just said.</p><br/><p>I was too.</p><br/><p>Although my expectations were high since the reactions on the internet were so explosive…</p><br/><p>6%?</p><br/><p>A cable drama, that only just started, got 6%?</p><br/><p>“Al-all-time 5<sup>th</sup>… Doesn’t that mean it’s really good?”</p><br/><p>Im Seoyoung stuttered. LJ had a dazed expression as she said,</p><br/><p>“Is… n’t it? I mean how many dramas have TVL broadcasted so far.”</p><br/><p>“Oppa, right? It’s a success, right?”</p><br/><p>Im Seoyoung slapped my back with both hands as she asked.</p><br/><p>I gulped my saliva and replied,</p><br/><p>“No.”</p><br/><p>“No?!”</p><br/><p>“It’s a resounding success.”</p><br/><p>Im Seoyoung screamed at the top of her lungs. Lee Taehee and LJ stuck next to Lee Songha with bright complexions. Then, with Lee Songha, who was still caught up in the lingering feelings after the broadcast, in the middle, the two chatted noisily. Of course, 95% of it was Im Seoyoung’s voice, but their voices clearly contained their excitement.</p><br/><p>After ending a call with someone else, Kim Hyunjo gestured to me.</p><br/><p>“It’s Team Leader Park, and she says it’s crazy in the PR team right now.”</p><br/><p>“Crazy?”</p><br/><p>“She said inquiries by people who now want a piece of the cake are flooding in. Since there are so many calls, she said it’s not a PR team but a call center. Apparently, she said it already feels like the drama hit 10% ratings.”</p><br/><p>As his smile curled all the way up his ears, Kim Hyunjo slapped my arm.</p><br/><p>“How do you feel?”</p><br/><p>How do I feel, huh?</p><br/><p>“Although you only brought the opportunity for Neptune to appear on Next K-Star, isn’t this time something you brought up with your own hands? You received the synopsis, pushed Lee Songha to act, and even preparations for the audition and film shoots. What you brought up has become a success right now, so how do you feel?”</p><br/><p>How do I feel now that the first drama I was involved with has broadcasted?</p><br/><p>“Well, I mean.”</p><br/><p>I grinned as I said,</p><br/><p>“Fantastic.”</p><br/><p>Kim Hyunjo laughed loudly like a drunken person.</p><br/><p>I was filled with pride. My chest felt stiff, and my heart felt like it would explode. If there wasn’t anyone here, I might have shouted refreshingly. Also, I might have called my parents and my brother and bragged on and on. They would all be very happy.</p><br/><p>I clenched my fists.</p><br/><p>Like Kim Hyunjo said, I had suffered hardships and brought it up to this point, and it returned to me as a great success. I felt that I accomplished something that I could hold with my own two hands, drunk from people’s acknowledgment of me and my fruits of labor. It was an amazing feeling.</p><br/><p>I looked at Lee Songha, who was buried under the girls, receiving their congratulations. She had been gawking just now, but she was smiling brightly right now, perhaps due to the girls causing such a large commotion.</p><br/><p>Yeah, smile. It’s a day you can’t help but smile.</p><br/><p>The people who had hated on Lee Songha were dispirited, pushed aside by the masses. Instead, it felt like there were people crowding at hate comments, tearing them apart. This was because there were people uploading evidence of others who had previously hated and bashed Lee Songha because of her controversies, and sympathy for Lee Songha spreading like wildfire. Neptune’s fan cafe, as well as Cat Guardian Ghost’s fan cafe, were filled with supportive comments.</p><br/><p>From now on, she wouldn’t have to suffer like in the past.</p><br/><p>Now, there was no need to take Lee Songha’s phone away, and there would be no need to feel down because of people’s mocking looks anymore.</p><br/><p>As if she noticed my gaze, Lee Songha looked at me. Our eyes momentarily met. Her picturesque eyes smiled slightly. How many emotions passed by in that brief moment? If possible, I wanted to stop time and closely examine them.</p><br/><p>Lee Songha, who was about to approach me, was grabbed by Im Seoyoung’s hand and was shaken, while I turned my head at Kim Hyunjo’s call.</p><br/><p>“Anyways, I bet the mood at Neptune’s album meeting will be great tomorrow because of this.”</p><br/><p>“Ah.”</p><br/><p>“Team Leader Park told me to bring you, saying that there are a lot of people who want to see you.”</p><br/><p>Kim Hyunjo gave a meaningful smile.</p><br/><p>“Ah, right. You really are a lucky charm. Even when I saw you for the first time, I…”</p><br/><p>He went on about the repertoire I had heard multiple times.</p><br/><p>Soon, we began a simple celebration, although it later changed to a drinking party once Kim Hyunjo brought out another wild ginseng wine the team 3 leader gave him. I felt this last time as well, but the wine’s effects were amazing. After two hours, there was almost no one in their right mind anymore.</p><br/><p>Lee Songha, who had been nodding her head constantly, eventually slumped over. When I barely managed to lean her against the sofa, she had a faint smile as she mumbled something. Just what was she eating in her dreams after finishing off a chicken?</p><br/><p>I looked at the living room, which looked more like a mess than a girl group’s residence, and at the people who were collapsed like stragglers, but there was someone missing.</p><br/><p>The traitor wasn’t here.</p><br/><p>Now that I thought about it, I felt like I didn’t see him for a while. Did he go out to smoke again?</p><br/><p>*</p><br/><p>After hanging up, Choi Gunyoung entered the quiet residence.</p><br/><p>It seemed they had dragged the Neptune members back to their rooms as only Kim Hyunjo and Jung Sunwoo were wearing their outerwear as they nodded off.</p><br/><p>Choi Gunyoung stood in front of Jung Sunwoo and looked down at him.</p><br/><p>You couldn’t find a smile on his always smiling face. He was cold and rigid like lead.</p><br/><p>He clenched his phone in his hand as he thought that if today was Jung Sunwoo’s day, then tomorrow would be his.</p><hr/><br/><p><sup> [1]</sup> 44 USD.</p>\n</div>\n<div style=\"max-width: 870px;margin: 5px auto;background: repeating-linear-gradient( 45deg, #fff6cc, #fff6cc 5px, #f3ecc7 5px, #f3ecc7 10px );\">\n<!-- Composite Start -->\n<div id=\"M562762ScriptRootC864255\">\n</div>\n<script async=\"\" src=\"https://jsc.mgid.com/m/e/media.boxnovel.org.864255.js\"></script>\n<!-- Composite End -->\n</div>\n<hr class=\"chr-end\"/>\n<div class=\"chr-nav\" id=\"chr-nav-bottom\">\n<div class=\"btn-group\">\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/top-management-chapter-61\" id=\"prev_chap\" title=\"Chapter 61\">\n<span class=\"glyphicon glyphicon-chevron-left\"></span>\n<span class=\"hidden-xs\">Prev Chapter</span>\n</a>\n<button class=\"btn btn-success chr-jump\" type=\"button\">\n<span class=\"glyphicon glyphicon-list-alt\"></span>\n</button>\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/top-management-chapter-63\" id=\"next_chap\" title=\"Chapter 63\">\n<span class=\"hidden-xs\">Next Chapter</span>\n<span class=\"glyphicon glyphicon-chevron-right\"></span>\n</a>\n</div>\n</div>\n<div class=\"text-center\">\n<button class=\"btn btn-warning\" data-chr-id=\"201237\" id=\"chr-error\" type=\"button\"><span class=\"glyphicon glyphicon-exclamation-sign\"></span> Report chapter\r\n                        </button>\n</div>\n<div class=\"bg-info text-center visible-md visible-lg box-notice\">\r\n                        Tip: You can use left, right, A and D keyboard keys to browse between chapters.\r\n                    </div>\n</div>"}