{"title": "Chapter 76", "id": 76, "volume": 1, "url": "http://boxnovel.org/top-management-chapter-76", "volume_title": "Volume 1", "body": "<h1>Chapter 76</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><header class=\"entry-header\"></header></p><div class=\"entry-content content\"><br/><p>Chapter 76: A Historic Drama for Various Reasons (5)</p><br/><p>TL: emptycube / ED: Isleidir</p><hr/><br/><p>“…!”</p><br/><p>A brutal sound echoed out.</p><br/><p>It looked she tried to dodge it, but the snowman’s head precise struck Son Chaeyoung’s head.</p><br/><p>It was perfect. With four similarly aged kids at home, I was used to snow fights, but this was my first time seeing a work of art like this.</p><br/><p>The snow stuck to Son Chaeyoung’s forehead, and specks of snow would fall every time her eyelashes trembled and her facial muscles distorted.</p><br/><p>“I told you not to throw it. You think I’m some pushover?”</p><br/><p>Son Chaeyoung slowly wiped her forehead.</p><br/><p>Since it was her second time, she didn’t scream, and she reacted faster than the previous time.</p><br/><p>The mood felt much more severe than before as well.</p><br/><p>“… Songha, come here.”</p><br/><p>Although my mind felt dizzy just thinking about how to deal with the situation, I couldn’t let Son Chaeyoung grab Lee Songha’s hair in front of me.</p><br/><p>I grabbed Lee Songha’s hand and pulled her towards me. How tightly did she hold onto the snowball for her hands to be as cold as ice?</p><br/><p>Son Chaeyoung looked at Lee Songha again and said,</p><br/><p>“Even if we gloss over what happened last time because I was the first to raise my hand, though he wasn’t hit, what’s this now? You dare throw a snowball at me, who’s many years your senior? Are you testing my tolerance?”</p><br/><p>There’s no need to test your tolerance.</p><br/><p>I really wanted to say this, but I had to handle the situation since Lee Songha threw the snowball in my stead as well. When I glanced at her, water dripped down from Son Chaeyoung’s chin.</p><br/><p>Although I didn’t want to, I took out the handkerchief from my pocket. As soon as she saw this, Lee Songha stretched out her hand, which was wet due to holding the snowball.</p><br/><p>She gave me a look that seemed to say, ‘Me, me, give it to me.’</p><br/><p>In the end, the handkerchief went to Lee Songha.</p><br/><p>Son Chaeyoung’s lips distorted.</p><br/><p>“If I just say one word to the CEO or the director, it’s only a matter of time for this to get out of ha-!”</p><br/><p>“Say it. Then I will too.”</p><br/><p>Lee Songha replied.</p><br/><p>“What?”</p><br/><p>“I might go around telling people what you did to me.”</p><br/><p>It wasn’t only Son Chaeyoung who lost her mind. Lee Songha was worse.</p><br/><p>Stopping briefly, Son Chaeyoung glared at Lee Songha.</p><br/><p>“Are you saying that you want to face off against me?”</p><br/><p>“Last time and now this. You’re the one who started it.”</p><br/><p>“You’re going to go around telling people? Do it. I’ll tell them I have no idea what you’re talking about. Do you think the company will write a news release in favor of you or me when this blows up?”</p><br/><p>“We’ll have to see about that. I still have a lot of time left on my contract.”</p><br/><p>“You dare keep talking back to me!”</p><br/><p>Although you couldn’t see it, the two of them had thrown a dozen snowballs at each other. The situation was already in disarray</p><br/><p>Considering later events, it was correct to hold Lee Songha back as losing was winning in cases like this. Even if it was dirty and foul, this was the right decision.</p><br/><p>But why was I so proud of Lee Songha right now?</p><br/><p>She didn’t lose a single bout against the Great Son Chaeyoung. Was it weird if I thought she developed at a great pace?</p><br/><p>It seemed Lee Songha’s words were effective as Son Chaeyoung bit her lips. Then she changed the topic. Her tone of speech became more leisurely.</p><br/><p>“But why are you causing such a fuss? Because your manager might be snatched away? If you have any brains, think about it. Working with me or with you, which do you think is more beneficial for his future?”</p><br/><p>“That’s…”</p><br/><p>Lee Songha glanced at me. Having missed the opportunity to let go, her small hand in my grasp moved. Lee Songha’s hand tightly held onto mine.</p><br/><p>“What a sight.”</p><br/><p>Son Chaeyoung ridiculed before turning towards me.</p><br/><p>“Now tell me, you agree with changing, right?”</p><br/><p>“Nope.”</p><br/><p>I replied in a heartbeat.</p><br/><p>There was no need to consider it unless there was a huge change like I found out Son Chaeyoung was my little sister, whom we had lost for 28 years.</p><br/><p>Damn it, that was too messed up. For that lump of trouble to be my little sister.</p><br/><p>At my instant reply, Lee Songha and Son Chaeyoung’s expressions changed simultaneously.</p><br/><p>I was more shocked that Lee Songha was surprised than Son Chaeyoung. Don’t tell me she thought I would agree?</p><br/><p>With a dumbfounded expression, Son Chaeyoung asked,</p><br/><p>“… You don’t want to?”</p><br/><p>“Yes.”</p><br/><p>“Why don’t you want to?! Are you serious? Are you out of your mind?”</p><br/><p>“I’m serious and my mind is fine.”</p><br/><p>“Then think about it again. I’ll give you one last chance.”</p><br/><p>“That’s okay. I have no thoughts on transferring to Ms. Son Chaeyoung’s team. I am very satisfied with my current team and enjoy working with them. I think my future is still a path of flowers<sup>{1}</sup>.”</p><br/><p>To be precise, only seeds have been planted in my path, and even though there were piles of poop like the traitor and Son Chaeyoung and Son Chaeyoung and Son Chaeyoung on this path, I just needed to avoid them.</p><br/><p>Son Chaeyoung revealed an odd expression as she opened and closed her mouth. Then she sent me a chilling gaze. Even if I didn’t know any better, it was clear that her rigid confidence had crumbled.</p><br/><p>“Playing house, I wonder how long that’ll last.”</p><br/><p>After making this sarcastic remark, she opened the door with a bang and left.</p><br/><p>I let out the sigh I had been holding back and racked my brains. Since the storm had passed, I had to deal with the aftermath.</p><br/><p>Since there wasn’t a big aftermath after Lee Songha threw a cake at her last time and since Lee Songha said that she wouldn’t go down by herself, it seemed that Son Chaeyoung wouldn’t bully her outright.</p><br/><p>Still, I decided to tell Kim Hyunjo and the team 3 leader about it just in case as we were dealing with Son Chaeyoung of all people.</p><br/><p>That was that.</p><br/><p>“Songha. You can let go now, I feel like it might cramp.”</p><br/><p>Even though I said it in a joking tone, Lee Songha still gripped my hand. Her expression was dark and gloomy, and I could now guess what she was thinking inside her small head without looking.</p><br/><p>Her pale lips moved.</p><br/><p>“I’m going to be as successful as her.”</p><br/><p>“What?”</p><br/><p>“… What’s yours will be snatched if you’re powerless.”</p><br/><p>Nervousness and a clumsy malice were currently seeping out from her normally calm voice. I patted Lee Songha’s shoulder with my other hand.</p><br/><p>“What do you mean ‘snatched’? Am I an object? I’ll fight and choose where I should be so don’t worry. Also, it’s good that incidents like this can motivate you, but don’t let it make you feel uneasy or impatient. There’s no need to.”</p><br/><p>Although they were slightly toe-curling words, I thought it was good I said them.</p><br/><p>The malice in Lee Songha’s expression melted like snow. I didn’t miss this opportunity to clear my thought and change the topic.</p><br/><p>“Also, the snowman’s head from before…”</p><br/><p>“I found it on my way here. It felt like such a waste throwing the cake last time.”</p><br/><p>“Uh, yeah. That’s good and all, but next time, if you feel the impulse to throw something, discuss it with me first.”</p><br/><p>“Yes.”</p><br/><p>Like always, Lee Songha nodded her head. Her powerful grip holding on my hand loosened as well.</p><br/><p>With my now-free hand, I handed her my coat which I had taken off a while ago.</p><br/><p>“Put this on first. You’re as cold as ice. Who did you hear this from for you to come here like this? Didn’t the other girls try to hold you back?”</p><br/><p>“I came out in secret. I’ll probably hear an earful when I go home.”</p><br/><p>“Of course, you will. Still, I’ll stay next to you and explain the situation.”</p><br/><p>Lee Songha’s eyes widened slightly before gently curving into a smile.</p><br/><p>*</p><br/><p>A sleek van drove down a snowy road.</p><br/><p>The road manager in the driver’s seat and Chief Jo kept glancing back at Son Chaeyoung, who sitting in the rear seat. Son Chaeyoung’s mood these days called for snow, rain, and clouds, but today, there was a storm warning.</p><br/><p>“Oppa.”</p><br/><p>“Uh, huh? What?”</p><br/><p>“What do you think about me leaving the company?”</p><br/><p>Chief Jo hurriedly turned around at Son Chaeyoung’s indifferent words.</p><br/><p>“What?! What do yo- Are you planning on going independent? Or has anyone contacted you for an exclusive contract? Who is it?!”</p><br/><p>“If I leave, will you come with me?”</p><br/><p>“…… Huh?”</p><br/><p>His outpour of questions halted. Chief Jo’s eyes jittered quickly. Soon after, while examining Son Chaeyoung’s mood, he carefully said,</p><br/><p>“That, err. That… you know that isn’t a matter to decide easily, right? This industry is small. While you’ll be fine, I might get a bad image if I do. You know this. If you get a bad image, it’s difficult to grow in this industry. After growing a little more her-“</p><br/><p>“Never mind. It was a joke.”</p><br/><p>Son Chaeyoung’s lips curled up into a smile. Although the conversation ended, Chief Jo kept glancing back with uneasy eyes. Son Chaeyoung’s expression, which had been gloomy just before, had cleared up a little.</p><br/><p>As Chief Jo was relieved, Son Chaeyoung casually said,</p><br/><p>“You know Lee Songha’s manager, right?”</p><br/><p>“Jung Sunwoo? What about him?”</p><br/><p>“I want to snatch him away from her. Find a way.”</p><br/><p>*</p><br/><p>I brought Lee Songha back to her residence.</p><br/><p>The Neptune members, who were trembling with worry, welcomed us with glaring eyes. Even after Lee Songha was released from being surrounded and scolded by them, my turn didn’t end.</p><br/><p>The girls, especially Im Seoyoung, kept looked at me with nervous eyes, so I repeated my words,</p><br/><p>“There won’t be any problems. Just trust me.”</p><br/><p>“Of course, we trust you, but in a company, a new employee is like a worm! You’ll die if your higher ups step on you!”</p><br/><p>Im Seoyoung shouted as she imitated stepping on something with her fur slippers.</p><br/><p>While I was thankful she was worrying about me, calling me a worm was a bit too severe.</p><br/><p>“You’ve never worked at a company before so where did you hear that from?”</p><br/><p>“Do you have to work to know? It’s on the internet.”</p><br/><p>“You need to quit using the internet.”</p><br/><p>Then I suddenly recalled the good news I had forgotten due to the consecutive shocking events.</p><br/><p>“Oh, right. We’re going to be on a public network entertainment show.”</p><br/><p>They suddenly became silent.</p><br/><p>Im Seoyoung, Lee Songha, who was drinking ginger tea as a preventative measure for a cold, LJ, who was seriously thinking about a way to screw Son Chaeyoung over, and Lee Taehee, who was helping next to her, they all stopped what they were doing and looked at me.</p><br/><p>“It’s a Lunar New Year’s special on IBC. Team Leader Park told me we were set.”</p><br/><p>“Re-really?! IBC? Public network? We’re all going on it?!”</p><br/><p>“Yeah. We all are. Since you’re appearing with your manager, I’m going on too.”</p><br/><p>With Im Seoyoung’s scream as the start, there was a huge commotion in their residence.</p><br/><p>In only a week, there was a significant change.</p><br/><p>When I searched ‘Cat Guardian Ghost’ on portal sites, there were quite a few articles calling it a ‘historic drama’.</p><br/><p>It was a historic drama since it exceeded 15% ratings.</p><br/><p>Compared to GTBN’s new drama, which couldn’t exceed 1% ratings and was initially regarded as our competitor as it aired at the same time as us, calling it a historic drama wasn’t an exaggeration.</p><br/><p>Ah, there was another historic drama as well.</p><br/><p>Mermaid out of Water. Faced with the public rage of the original work’s fans, its ratings dropped to a single digit, making it a historic drama as well. Even those involved murmured that it would be a historical fail.</p><br/><p>Either way, the only drama that was doing as well as Cat Guardian Ghost was IBC’s Time Slip. As their and our ratings were going neck and neck, people were quite anxious, but I was fine.</p><br/><p>A fuse should be burning up over there.</p><br/><p>When the bomb explodes, there wouldn’t be any competitors remaining.</p><br/><p>The best drama of this year’s first quarter would be Cat Guardian Ghost without a doubt.</p><br/><p>While this heated mood kept continuing day after day, the day of recording IBC’s Lunar New Year’s special ‘Star Manager’ finally arrived.</p><br/><p>*</p><br/><p>IBC Basement Broadcast Studio A.</p><br/><p>With 3 hours remaining until it began, dozens of staff members hurriedly moved about. The film crew checked the mountain of equipment. The staff threw their coats and moved things around. The sweat and heat within the studio were enough to forget the season, but there was a cold wave brewing outside.</p><br/><p>Production staff members were bustling like bees, chattering on their intercoms.</p><br/><p>“Senior, I think we need to change the outdoor set we scheduled to one indoors! They say it’s -14 degrees outside! It’s not like there are only one or two celebrities but a heap of them. How are we going to endure the amount of complaints when the cameras are off?!”</p><br/><p>“The gate to hell will open today<sup>{2}</sup>. Schedule another set. Have the sponsored cars not arrived yet?!”</p><br/><p>“They say they’ll definitely arrive before the start!”</p><br/><p>“If we delay our starting time, everything will go bust! Tell them to be late if they are confident to take responsibility for that! You are checking the cast, right?”</p><br/><p>“Yes, I’m calling them every 30 minutes and checking on them!”</p><br/><p>The studio was extremely busy on one side.</p><br/><p>A few writers for the special program were discussing while flipping through the program composition.</p><br/><p>“… Next, Neptune. Eunseo, you are in charge of Neptune, right?”</p><br/><p>“Yes.”</p><br/><p>“Since they are rookies, they’ll probably listen to you well.”</p><br/><p>Deputy Manager Shin, who had been examining the mood on set, added in at the main writer’s words.</p><br/><p>“Rather than how easily they listen, how much broadcast-worthy content we’ll get from them is the problem. I said okay because their manager is worth using, but I’m still worried. If they are nervous and don’t say a word, they’ll be completely edited out.”</p><br/><p>“They probably won’t be completely edited out though? They have a great story.”</p><br/><p>At the main writer’s words, Deputy Manager Shin tilted his head.</p><br/><p>“A great story?”</p><br/><p>“Neptune’s Lee Songha is hot right now.”</p><br/><p>“Yeah, she’s amazing at acting.”</p><br/><p>“Although she’s proven herself now, before the drama aired, there was huge commotion concerning her acting controversy and that she was just an ‘add-on’. They told us that they would talk about some of the behind-the-scenes of that commotion when they appear today.”</p><br/><p>“Really? Is it fun?”</p><br/><p>“It’s fun. It also works with our program concept.”</p><br/><p>The main writer said, satisfied.</p><br/><p>“Their manager’s story was the most entertaining.”</p><hr/><br/><p><sup>{1}</sup> This means that he expects his future to still be good. Normally, the phrase is used to say ‘I hope good things happen to you in the future’.</p><br/><p><sup>{2}</sup> Pretty much, they’re in for a lot of trouble today.</p>\n</div>\n<div style=\"max-width: 870px;margin: 5px auto;background: repeating-linear-gradient( 45deg, #fff6cc, #fff6cc 5px, #f3ecc7 5px, #f3ecc7 10px );\">\n<!-- Composite Start -->\n<div id=\"M562762ScriptRootC864255\">\n</div>\n<script async=\"\" src=\"https://jsc.mgid.com/m/e/media.boxnovel.org.864255.js\"></script>\n<!-- Composite End -->\n</div>\n<hr class=\"chr-end\"/>\n<div class=\"chr-nav\" id=\"chr-nav-bottom\">\n<div class=\"btn-group\">\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/top-management-chapter-75\" id=\"prev_chap\" title=\"Chapter 75\">\n<span class=\"glyphicon glyphicon-chevron-left\"></span>\n<span class=\"hidden-xs\">Prev Chapter</span>\n</a>\n<button class=\"btn btn-success chr-jump\" type=\"button\">\n<span class=\"glyphicon glyphicon-list-alt\"></span>\n</button>\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/top-management-chapter-77\" id=\"next_chap\" title=\"Chapter 77\">\n<span class=\"hidden-xs\">Next Chapter</span>\n<span class=\"glyphicon glyphicon-chevron-right\"></span>\n</a>\n</div>\n</div>\n<div class=\"text-center\">\n<button class=\"btn btn-warning\" data-chr-id=\"201265\" id=\"chr-error\" type=\"button\"><span class=\"glyphicon glyphicon-exclamation-sign\"></span> Report chapter\r\n                        </button>\n</div>\n<div class=\"bg-info text-center visible-md visible-lg box-notice\">\r\n                        Tip: You can use left, right, A and D keyboard keys to browse between chapters.\r\n                    </div>\n</div>"}