{"title": "Chapter 75", "id": 75, "volume": 1, "url": "http://boxnovel.org/top-management-chapter-75", "volume_title": "Volume 1", "body": "<h1>Chapter 75</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><header class=\"entry-header\"></header></p><div class=\"entry-content content\"><br/><p>Chapter 75: A Historic Drama for Various Reasons (4)</p><br/><p>TL: emptycube / ED: Isleidir</p><hr/><br/><p>So the commercial that went to Lee Songha was originally Son Chaeyoung’s.</p><br/><p>My lips cracked a smile by themselves. It was such good news I wanted buy everyone a round of coffee. To celebrities, having their commercial snatched away should leave them feeling quite awful. Since hers was taken by Lee Songha, who used to be on a much lower standing than her, would her big head have deflated a little?</p><br/><p>Either way, I quickly dropped any thoughts on going to see Son Chaeyoung since I didn’t know whether she would be enraged, fuming flames from her mouth.</p><br/><p>“It was worth taking refuge. Thank you, team leader”</p><br/><p>“Since we’re in the same boat, might as well share an umbrella.”</p><br/><p>Team Leader Park mischievously added,</p><br/><p>“If you’re really that thankful, why don’t you buy me a slice of cake or something?”</p><br/><p>“Ah, wait. I suddenly want tiramisu as well.”</p><br/><p>Smiling, I stood up when my phone rang.</p><br/><p>“Yes, hel-“</p><br/><p>-Where are you right now? We need to talk.</p><br/><p>The coffee that had run down my throat was about to make its way back up.</p><br/><p>Her voice rattled on without introducing herself, as though I would definitely know who she was by her voice. Her tone, which indicated that, since she had something to say, I should immediately reply with an ‘okay’. A face abruptly appeared in my mind without any hesitation.</p><br/><p>But, what was this? She shouldn’t have any reason to call me.</p><br/><p>With a normal person’s way of thinking, I couldn’t guess what she was up to.</p><br/><p>-What? Why aren’t you replying? Are you sure this number is right?!</p><br/><p>The voice became louder. It seemed someone was next to her as a voice said that this number was the right one. The man’s voice was awkward, and it seemed he was taken aback. Although his voice was faint, he was, without a doubt, the traitor.</p><br/><p>Just what was this combination?</p><br/><p>Just as I was about to reply while frowning, the world turned black.</p><br/><p>“Chief!”</p><br/><p>It was the future. As soon as I saw the haziness in my vision, I quickly cleared the complicated thoughts in my head. I didn’t have the time to think of other things right now. Since I couldn’t leave out a single, small detail, I crammed everything I saw in my head.</p><br/><p>“Thank god. Chief, did your phone call end?”</p><br/><p>A youth with a refreshingly handsome face approached me with hurried steps.</p><br/><p>He had a T-shirt on, and his pants were made of a thin material. Was it summer?</p><br/><p>There was an unfamiliar person in an unfamiliar place. All I could assume was that we were in a hallway inside a building.</p><br/><p>“She’s making a fuss looking for you, Chief Jung!”</p><br/><p>My ears perked.</p><br/><p>Chief Jung? He was referring to me when he shouted ‘Chief’?</p><br/><p>“What now?”</p><br/><p>I, so my future self, said in a casual manner.</p><br/><p>The unfamiliar youth hesitated before saying in a quiet voice,</p><br/><p>“I ran out of there in fear of being lashed out on so I don’t know the details but… Last time, the team leader told me that, if the mood seems critical, to not try to do something by myself and to absolutely leave it to you.”</p><br/><p>“Now, really. Am I some babysitter?”</p><br/><p>“I’m sorry. I’m trembling in fear. Other people told me that her personality’s gotten a lot better, no, that she changed a lot ever since she started working with you. Then does that mean she was worse be-“</p><br/><p>“Personality’s gotten better my ass. It’s hard to be as unchanging as her.”</p><br/><p>The conversation was a little strange.</p><br/><p>Even while grumbling, my future self began to walk.</p><br/><p>The youth followed after me, calling out, ‘Chief, chief.’ The more I heard it, the stranger it felt. I was no longer a rookie manager but a chief. So days like this really did occur.</p><br/><p>Of course, as long as I didn’t quit, it was a future I would inevitably face, but it was still far off for me right now. Since it felt like I had taken a step towards my dream, I did feel a little excited.</p><br/><p>When in the future was this?</p><br/><p>If I could move my lips, I would have immediately asked what year it was. Hoping to obtain even a small clue, I concentrated as much as I could.</p><br/><p>The place I arrived at was a playroom. Although it was really unexpected, it was true. A colorful ball pit and a gently sloped slide. They were things I was tired of seeing due to taking care of the quadruplets.</p><br/><p>There was also a woman.</p><br/><p>I saw the back of a woman with long, braided hair. I heard the cries of a baby. The woman was rocking the baby, who was only wearing diapers, in an awkward manner.</p><br/><p>Who was she?</p><br/><p>As soon as I thought this, the woman turned around.</p><br/><p>“Why are you so late! Take the baby, he’s crying.”</p><br/><p>“I thought something big happened. Babies are supposed to cry.”</p><br/><p>“He didn’t cry when you were holding him before!”</p><br/><p>“Are you and I the same? Do you know how many kids I took care of? Also, babies have eyes too, you know. Do you think he’ll put up with you staring at him with that face? Just by the fact that he wasn’t shaken up, he would grow up to be a general. He’ll do great things in the future.”</p><br/><p>“Hey!”</p><br/><p>My thoughts went awry. This was the moment I was supposed to be shocked, but I was confused with just what I should start being shocked at.</p><br/><p>The reasons were because the woman holding the baby, who seemed a bit over a month old, asked me why I was so late and that woman was Son Chaeyoung.</p><br/><p>She was Son Chaeyoung.</p><br/><p>It felt like someone was hammering a stake in my head.</p><br/><p>Uncaring about whether my soul was flailing in an abyss of confusion, my future self sighed and received the baby from Son Chaeyoung. Then, while humoring the drooling, whining baby, I said,</p><br/><p>“If the baby cries, you need to look for his mom. Why look for me?”</p><br/><p>So the baby’s mother was someone else. Even in this situation, I was relieved. I almost imagined a more terrifying thought. A terrifying imagination that could give me a heart attack.</p><br/><p>“I don’t know. I think she left the baby on set and went somewhere because I haven’t seen her for a while now. Either way, I don’t like her. Looking at how someone who calls herself a parent is acting, I can already imagine how it’ll be in the fut-“</p><br/><p>Son Chaeyoung, who was grumbling, suddenly shouted,</p><br/><p>“Wait, why can’t I look for you?! You’re my manager!”</p><br/><p>-Hello?!</p><br/><p>I jolted to my senses.</p><br/><p>I felt like I was dragged out after being forced underwater. Team Leader Park was sitting in front of me with an odd expression, and the voice sounding out from the phone in my ear talked ceaselessly. It was the same voice as the one I heard a moment ago.</p><br/><p>-The line went dead! Don’t just stand there and check the number again. Either you’re blind or he’s deaf!</p><br/><p>The hairs on my body stood on their ends. I unintentionally pressed the ‘end call’ button.</p><br/><p>I tossed my phone on the table.</p><br/><p>“Wasn’t that Son Chaeyoung’s voice just now? It was, right?”</p><br/><p>I slowly nodded my head. Team Leader Park was taken aback and said,</p><br/><p>“Why is she calling you… But did you just hang up on her?”</p><br/><p>“I was just so surprised.”</p><br/><p>“Yeah, I totally understand. Breathe. My word. Just how terrifying was it for your face to go pale like that as if you just had a nightmare?”</p><br/><p>It was similar to a nightmare. No, it was worse since it was the future.</p><br/><p>Oh my god. It was the future.</p><br/><p>First, let’s calm down. Yeah, although it was the future, depending on my actions from now on, I could definitely change it. So rather than being confused, now was the time to quickly understand the situation and deal with it rationally.</p><br/><p>I tried the Lamaze breathing method<sup>{1}</sup> a few times but gave up. Damn it, even a monk who had reached enlightenment wouldn’t be able to keep calm!</p><br/><p>In a hurry, I chugged my coffee and stumbled through my memories.</p><br/><p>Although I didn’t know how far in the future it was, there was no doubt that I was promoted to a chief. Also, that I was in charge of Son Chaeyoung.</p><br/><p>Since I only got a glimpse, I didn’t know whether I was in charge of just Son Chaeyoung or others as well, but either option made me shocked and terrified.</p><br/><p>Why? Why did I become Son Chaeyoung’s manager?</p><br/><p>Just where did my life go wrong for something like that to happen?!</p><br/><p>At this moment, my phone vibrated once more. It was the same number as before.</p><br/><p>I gulped down my saliva and received the call.</p><br/><p>“This is Jung Sunwoo.”</p><br/><p>-What? Can you hear me now? Is it okay for someone who calls himself a manager to be this difficult to get a hold of? I hate people like that. Your phone’s a piece of crap so change it. Also, we need to talk.</p><br/><p>“… Talk?”</p><br/><p>Not swear?</p><br/><p>“Is there something we need to talk about?”</p><br/><p>-There is now.</p><br/><p>Son Chaeyoung said right away.</p><br/><p>-Because I asked the CEO to assign you to me.</p><br/><p>What did you say?!</p><br/><p>Shocked, I hurried back to the company.</p><br/><p>It seemed that the news had spread during this time as a few employees acted as though they knew me. Those who knew Son Chaeyoung’s true nature gave me sad looks while those who didn’t spouted nonsense about how I had tremendously good luck with people.</p><br/><p>I had good luck with people? Were they trying to drive me insane?</p><br/><p>I confronted Son Chaeyoung in a sealed, unlit meeting room.</p><br/><p>What kind of trick was this woman trying to pull?</p><br/><p>Was the horrible future I saw because of this?</p><br/><p>However, whatever the case, I couldn’t understand it at all. I would rather quit this damn company than be her manager unless there was some cataclysmic change.</p><br/><p>I temporarily stopped my chain of questions and asked,</p><br/><p>“Who did you ask the CEO be assigned to who?”</p><br/><p>“You, to me.”</p><br/><p>As if she was incredibly pleased with this situation, Son Chaeyoung looked at me with a smile on her lips. If there was a cake in front of me, I might have been the one to throw it this time.</p><br/><p>“Just why?”</p><br/><p>“Why is the reason important? The fact that I want to work with you is all that matters. After bringing around a rookie for a few months, you should know how dirty and foul this industry is.”</p><br/><p>With her arms crossed, Son Chaeyoung leaned towards me.</p><br/><p>“When you were a complete beginner, well, you are still a beginner; I heard you rejected Sung Dowon. Tell me honestly, you regret it, right? You probably regret being swept up by the momentary emotions of the situation and throwing away such a precious chance a ton. That’s why you should grab hold of the opportunity this time. If you work with me, no one will disregard you wherever you go.”</p><br/><p>In return for not being disregarded by anyone, I would probably wither up and die staying by your side.</p><br/><p>I listened quietly as she created a ruckus by herself.</p><br/><p>When I thought about it, her intentions were clear. Unless she had suddenly taken a strange liking to working with her enemies, she was probably trying to keep me by her side and screw me over by finding fault with every little thing.</p><br/><p>There was also a good chance that she childishly wanted to snatch something from Lee Songha after having her commercial taken by her.</p><br/><p>Damn it. The more I thought about it, the more ridiculous it was.</p><br/><p>Why fuss about me? Was I Chunhyang<sup>{2}</sup>?!</p><br/><p>“So what did the CEO sa-“</p><br/><p>“Ah, he said he would.”</p><br/><p>My heart dropped. Before I had trouble breathing, Son Chaeyoung added,</p><br/><p>“If you agree.”</p><br/><p>My stiff shoulders relaxed.</p><br/><p>So it wasn’t the worst case scenario. Of course, it wasn’t. Not after the conversations I had with CEO Baek Hansung. He probably wouldn’t assign me to Son Chaeyoung of all people. If he did, he wouldn’t be human.</p><br/><p>Well, that was that. Considering that he passed the choice down to me, did that mean I could reject Son Chaeyoung right to her face?</p><br/><p>“So quickly agree.”</p><br/><p>“… Why should I?”</p><br/><p>I asked because I was sincerely curious.</p><br/><p>With what confidence did this woman think that I would agree?</p><br/><p>“What do you mean why? I just said I’m going to help you grow.”</p><br/><p>The two eyes staring straight at me gleamed with arrogance. Son Chaeyoung gestured her finger towards me then herself.</p><br/><p>“Do you want me to say it again? I am going to help you grow. So stop playing house with that girl and come to me.”</p><br/><p>Oh, wow.</p><br/><p>Since her attitude was that of someone with a kind heart, laughter unwittingly escaped my lips.</p><br/><p>“I will grow on my own.”</p><br/><p>“Now, really. It seems you are confused because Lee Songha’s doing well these days, but it only takes a second for her popularity from the drama to die down. Do you think it’s easy to rise to where I am? Can’t you tell which side to take to grow faster? You have a lot to learn.”</p><br/><p>I knew one thing for sure.</p><br/><p>That Son Chaeyoung thought this was a given.</p><br/><p>As if she thought of something after looking at my expression, Son Chaeyoung frowned.</p><br/><p>“What? Why? Don’t tell me you’re worried because my drama might fail? The drama hasn’t ended yet. Also, I’m Son Chaeyoung. Do you think I’ll even falter because a drama flops or bat an eye when I lose a commercial?”</p><br/><p>I think you did more than bat an eye already.</p><br/><p>Since I didn’t need to listen to her any longer, I was about to open my mouth when the meeting room door opened with a thud and a chilling wind and snow blew in.</p><br/><p>When I turned around, I was startled. I saw a familiar face at the door. It was Lee Songha. Snowflakes hung from her long hair and her exposed skin was as cold as ice.</p><br/><p>Oh my god. In how much of a hurry did she leave that she was wearing clothes she would wear at home, without a coat or anything. On her feet were furry rabbit slippers instead of shoes.</p><br/><p>“Songha, did you come from your residence like that?”</p><br/><p>As I was taking off my coat for her, Lee Songha took a deep breath and glanced in my direction. It seemed as though she was checking if there was anything wrong with me. Then she approached Son Chaeyoung with sure-footed steps.</p><br/><p>Her eyes revealed an intimidating gleam. It was as though she would proclaim she was a secret royal inspector and throw out a mapae<sup>{3}</sup>.</p><br/><p>However, in her hand was something other than a mapae.</p><br/><p>It was a fist-sized snowball with two herb leaves embedded on it like eyes.</p><br/><p>I saw someone had made a small snowman on the windowsill of the terrace. There was no doubt she removed its head. When I recalled the previous tiramisu incident, I could easily discern why she brought the snowman’s head and what she was going to do next.</p><br/><p>Son Chaeyoung, who was about to stand up while glaring angrily, hesitated.</p><br/><p>“Hey! Yo-you just try throwing that! If you d-“</p><br/><p>Before she could finish talking, Lee Songha threw the snowball at her.</p><hr/><br/><p><sup>{1}</sup> Breathing technique for those preparing for childbirth.</p><br/><p><sup>{2}</sup> Chunhyang – The main female character in the ‘Legend of Chunhyang’, the daughter of a kisaeng (someone who entertained officials and kings and the like as well as provided sexual services). She fell in love with a government official’s son, who fell in love with her at first sight. The son, Yi Mongryong, had to move away because of his father’s work, but before he left, Chunhyang gave him a ring, promising to stay faithful to him. The new government official in charge, Byeon Hakdo, tries to get her to sleep with him, but she refuses. Because she kept refusing him, he punished her, almost to death.</p><br/><p><sup>{3}</sup> So this is a tie in with the Chunhyang reference above. Yi Mongryong became a secret royal inspector, went back to Chunhyang’s village, and disguises himself to investigate corrupt government officials, in this case, Pyon. He later proclaims his position as a secret royal investigator, presenting his mapae (a ‘horse requisition tablet’ that he could use to requisite horses and men and as his identification as a secret royal investigator), and punishes Byeon Hakdo. If you’re interested in the full story, you can google ‘The Chunhyang Story’. So basically, Chunhyang = Jung Sunwoo and Yi Mongryong = Lee Songha.</p>\n</div>\n<div style=\"max-width: 870px;margin: 5px auto;background: repeating-linear-gradient( 45deg, #fff6cc, #fff6cc 5px, #f3ecc7 5px, #f3ecc7 10px );\">\n<!-- Composite Start -->\n<div id=\"M562762ScriptRootC864255\">\n</div>\n<script async=\"\" src=\"https://jsc.mgid.com/m/e/media.boxnovel.org.864255.js\"></script>\n<!-- Composite End -->\n</div>\n<hr class=\"chr-end\"/>\n<div class=\"chr-nav\" id=\"chr-nav-bottom\">\n<div class=\"btn-group\">\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/top-management-chapter-74\" id=\"prev_chap\" title=\"Chapter 74\">\n<span class=\"glyphicon glyphicon-chevron-left\"></span>\n<span class=\"hidden-xs\">Prev Chapter</span>\n</a>\n<button class=\"btn btn-success chr-jump\" type=\"button\">\n<span class=\"glyphicon glyphicon-list-alt\"></span>\n</button>\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/top-management-chapter-76\" id=\"next_chap\" title=\"Chapter 76\">\n<span class=\"hidden-xs\">Next Chapter</span>\n<span class=\"glyphicon glyphicon-chevron-right\"></span>\n</a>\n</div>\n</div>\n<div class=\"text-center\">\n<button class=\"btn btn-warning\" data-chr-id=\"201263\" id=\"chr-error\" type=\"button\"><span class=\"glyphicon glyphicon-exclamation-sign\"></span> Report chapter\r\n                        </button>\n</div>\n<div class=\"bg-info text-center visible-md visible-lg box-notice\">\r\n                        Tip: You can use left, right, A and D keyboard keys to browse between chapters.\r\n                    </div>\n</div>"}