{"title": "Chapter 81", "id": 81, "volume": 1, "url": "http://boxnovel.org/top-management-chapter-81", "volume_title": "Volume 1", "body": "<h1>Chapter 81</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><header class=\"entry-header\"></header></p><div class=\"entry-content content\"><br/><p>Chapter 81: Star Manager (5)</p><br/><p>TL: emptycube / ED: Isleidir</p><hr/><br/><p>“Who?”</p><br/><p>-Ms. Son Chaeyoung.</p><br/><p>Just what was happening? Why did this name come up?</p><br/><p>I thought it was weird for Team 2 to ask me, who was a part of Team 3 and was also on a break for a change, to cover for them, but did Son Chaeyoung choose me?</p><br/><p>A chill swept through me. It was better when she wanted to take me down, it was more spine-chilling now that she was trying to take me away.</p><br/><p>The future I had seen last time suddenly crossed my mind.</p><br/><p>The future where I was Son Chaeyoung’s manager. The one that was a risk to my mental health.</p><br/><p>I wasn’t certain whether that future changed since I rejected her proposal or not. There was no way I could know why I became assigned to Son Chaeyoung with what I had seen.</p><br/><p>However, it felt like if I accepted to cover for them, I would get closer to that future. It wasn’t only my break that would be wasted, I felt like my happy life plans would go to waste as well.</p><br/><p>I placed my phone next to my ear then further away as I said,</p><br/><p>“Hello, hello? I think it’s because I’m in the elevator, but I can’t hear you very well. I’ll call you back when I get off.”</p><br/><p>-Pardon? Hello?</p><br/><p>I hung up and called Kim Hyunjo.</p><br/><p>He didn’t answer. It was the same for the team 3 leader.</p><br/><p>Were they together? Were they in the middle of a meeting?</p><br/><p>The more I thought about it, the weirder it seemed. They knew about my relationship with Son Chaeyoung well enough. If there was a situation where I would have to cover for Son Chaeyoung’s schedule, there was no way they wouldn’t tell me. I even thought that perhaps they didn’t know what was going on.</p><br/><p>First, I sent a text to Kim Hyunjo then racked my brain.</p><br/><p>What sort of excuse should I tell the Team 2 employee? Should I tell her I was aching with pain? Or that I went to the countryside to meet my parents? Or should I-</p><br/><p>I called someone.</p><br/><p>She was someone who always answered the phone as if she had been waiting for it, but the ringtone rang longer than usual today. I was waiting for her while I was tapping on the floor with my heel when I heard her drowsy voice.</p><br/><p>-Oppa? Is it you?</p><br/><p>“Yeah, Songha. Sorry, did you wake up because of me?”</p><br/><p>-No, I’m awake.</p><br/><p>Her voice brightened. I also heard the rustling sounds of her getting out of bed. I could picture her in my head. She probably had her phone right next to her ear with a dazed expression.</p><br/><p>“Do you have anything going on today? Or are you busy?”</p><br/><p>-Nope. I was going to practice for tomorrow’s shoot, but I don’t have to. I already practiced a lot.</p><br/><p>“Really? I have to make up some excuse to see you, are sick or anything?”</p><br/><p>After a moment of silence, Lee Songha said.</p><br/><p>-I suddenly feel like I’m going to throw up.</p><br/><p>From the other side of the phone, I heard a retching sound.</p><br/><p>I refunded my movie tickets and used that money to buy chicken.</p><br/><p>Then I fled to Neptune’s residence.</p><br/><p>When I explained the situation to the Team 2 employee, I could tell she was flustered. It felt like she wanted to say something, but what could she do? I had to take care of Lee Songha, who I was assigned to, over covering for someone.</p><br/><p>When I sighed, saying that I was worried since we had to go to film tomorrow morning, she was at a loss for words.</p><br/><p>After I arrived at their residence, I received a call from Kim Hyunjo, and as expected, he was in a meeting. It was a meeting with Team 2. Apparently, the team 2 leader brought up the matter of covering for Son Chaeyoung after the meeting.</p><br/><p>He said something about how Chief Jo looked favorably upon me so he wanted to give me a chance and how he would make up for making me work on my break by giving me a break later. Since the team 2 leader kept spouting nonsense about how there was no problem, the two team leaders were fighting.</p><br/><p>If I had gone to pick up Son Chaeyoung after the call, there was a 100% chance that I would have been told to cover for Chief Jo since I was already there.</p><br/><p>Kim Hyunjo said that today was a disaster and acknowledged me taking refuge. Also, he said that I would get another day off soon.</p><br/><p>“I think the refugee situation ended. So you can stop now.”</p><br/><p>Lee Songha, who was lying in bed breathing softly, turned her head. It was sad just looking at her reddened cheeks and her soaked forehead. I felt like I had to take her to the emergency right away.</p><br/><p>I felt this way even though I knew her hot cheeks were because of the electric blanket beneath her covers and the cold sweat on her forehead was because Im Seoyoung had sprayed her with a spray bottle.</p><br/><p>“Is it over? You don’t have to leave anymore?”</p><br/><p>“Yeah. Thanks.”</p><br/><p>“If this happens again, come over.”</p><br/><p>“Okay. I get it so get up. You don’t have to do this. No one’s going to come check on you so there’s no need for you to act so realistically. You look like I really need to feed you rice porridge.”</p><br/><p>“Oppa, you know how to make rice porridge?”</p><br/><p>“Of course, I do. Why? You want some?”</p><br/><p>She had been about to get up while wiping her forehead when she looked like she was going to lie back down.</p><br/><p>“I’m kidding. I bought chicken. Aren’t you going to eat chicken?”</p><br/><p>“Ah.”</p><br/><p>She was considering it. Now really, what was there to consider?</p><br/><p>I dragged Lee Songha, who looked a little regretful, out to the living room. I thought I had heard bustling noises outside the door, but they had already set the table with food, the chicken in the middle.</p><br/><p>Sitting on the sofa she always sat on, Im Seoyoung sighed as she said,</p><br/><p>“Oppa, your break has been ruined again. We really need to move up in this damn world.”</p><br/><p>“I know, right?”</p><br/><p>“Oh, right. Oppa, oppa, you know the entertainment show we were on? Won’t the company make you do this and that if you get really popular from it?”</p><br/><p>“I’m fine so you get popular first.”</p><br/><p>At my words, Im Seoyoung’s complexion became dark. She went around in circles like a puppy who had to go to the washroom before tightly hugging a cushion lying on the sofa and saying,</p><br/><p>“Euaah, I’m already scared to death. My entire family’s going to watch it when I go back home for Lunar New Year’s Day! They’ll definitely have high expectations for me. But what do I do if everything was cut out because it wasn’t funny?”</p><br/><p>“Don’t worry. The producer said it would be funny even if he edited it with his toes.”</p><br/><p>“How can oppa be so calm?! You said your family is going to watch it too!”</p><br/><p>“Just give up thinking about it. It’s easier if you just forget about it.”</p><br/><p>I set aside such useless thoughts and was concerned about how many days I would rest during the long weekend. With Kim Hyunjo’s schedule as the focus, we were trying to free up as much time as we could for the long weekend, but this broadcasting industry wasn’t a place that rested when others did so it was almost impossible for us to take a break the entire long weekend.</p><br/><p>“What are you girls going to do during the long weekend?”</p><br/><p>I asked the other girls.</p><br/><p>Lee Songha, who was sitting near my leg eating chicken, was the first to reply.</p><br/><p>“I’m going home too. My dad said he’ll come pick me up.”</p><br/><p>“That’s good.”</p><br/><p>“We’re going to watch Star Manager together too.”</p><br/><p>Although it was faint, her voice definitely contained traces of excitement.</p><br/><p>She said her parents didn’t like her being a celebrity, asking why she kept doing something that wasn’t working out. Now their thoughts that ‘this wasn’t working out’ would change as well since the current Lee Songha was a big celebrity.</p><br/><p>Lee Taehee, who had already opened a can of beer, said,</p><br/><p>“I’m just going to stay here. I don’t have anywhere to go.”</p><br/><p>“What? Why don’t you? What about your home?”</p><br/><p>“My parents are going on a vacation. I’m just going to catch up on my sleep during the long weekend.”</p><br/><p>What a surprise. I thought that something had happened at her home.</p><br/><p>“A girl who sleeps wherever she rests her head needs to catch up on sleep? Are you going to go on hibernation?”</p><br/><p>Relieved, I said jokingly and Lee Taehee smiled while drinking beer.</p><br/><p>LJ, who had been fiddling with the remote control, said,</p><br/><p>“I’ll be here too. It’s not such an amazing day that I have to go to the States for it.”</p><br/><p>Ah, LJ’s parents were in the States.</p><br/><p>Still, I thought it might be lonely if only the two of them remained, but LJ suddenly smiled strangely.</p><br/><p>“I’ll just exercise. Well, if I really get bored, I’ll go play in Im Seoyoung’s room.”</p><br/><p>“What?! Hey, no way! What are you planning on doing in my room! I’m going to lock my door before I go!”</p><br/><p>“I can pick that in three seconds.”</p><br/><p>“You-you’re lying, right? You joking again, right?!”</p><br/><p>Im Seoyoung shouted, threatening her about going in her room. She had been digging a hole just now, worried that the entertainment special would flop, but it seemed she had forgotten all about it because of LJ. LJ was also enjoying herself while she poked fun at Im Seoyuoung.</p><br/><p>They didn’t really look they would get along with each other but they did.</p><br/><p>On one side, it was noisy as usual, and on the other, their leader just watched over them as though they were children while drinking her beer. The youngest was eating enthusiastically before handing me a chicken wing.</p><br/><p>In this familiar space, I simply grinned.</p><br/><p>Suddenly, LJ said,</p><br/><p>“Ah, you said you didn’t get to watch any movies. You have two choices.”</p><br/><p>“Choices?”</p><br/><p>LJ waved the remote.</p><br/><p>“One, watching a new movie on IPTV<sup>{1}</sup>. Two, we binge watch Mermaid out of Water from the first episode. I think it’ll be worth watching that.”</p><br/><p>We unanimously chose option 2. It was a great choice.</p><br/><p>I laughed so hard that I relieved my stress.</p><br/><p>In the end, it wasn’t a bad, no, it was quite a good break.</p><br/><p>We got three days and two nights for our long weekend.</p><br/><p>It was shorter than the official long weekend, but even this would have been impossible if we didn’t slave away on the phone. Kim Hyunjo and I promised to not look for each other unless the sky was collapsing or something.</p><br/><p>The day my long weekend began, I got up early in the morning and left Seoul.</p><br/><p>Even though the traffic congestion was severe on the highway, I didn’t get annoyed and even started humming.</p><br/><p>The further away I got from Seoul and the closer I got to my family, the lighter my heart felt. It was the ropes which had bound me were cut one by one.</p><br/><p>How long had it been since I felt this sensation of freedom?</p><br/><p>Long after I left the inner city, long after I passed the high-rises that were getting rarer and rarer, and long after I drove down the dirt country roads where the farmland was barren because it was winter, I arrived in the town my parents resided in.</p><br/><p>Maybe it was because I was an unfamiliar face, but the townspeople gave me strange looks.</p><br/><p>I parked my car and entered my parent’s house. In the flowerbed on one side of the yard was still the fake tree the quadruplets had planted on Christmas, and beside it, a shaggy dog was sleeping in its doghouse, unaware that a person had come.</p><br/><p>It seemed my brother’s family had already arrived as even the yard was bustling with noise.</p><br/><p>“I’m home.”</p><br/><p>As soon as I opened the door, the smell of Korean pancakes<sup>{2}</sup> welcomed me. Also, four round figures gathered around and stuck next to me. One on my stomach, one on my back, and one on each arm.</p><br/><p>“Uncle!”</p><br/><p>“Yes, my children.”</p><br/><p>I felt purified. I patted each head, and the third, Kaeul<sup>{3}</sup>, smiled mischievously.</p><br/><p>“Why are we uncle’s children? When we are our dad’s children?”</p><br/><p>“Let’s forget about the biological factors. I took care of you half the time.”</p><br/><p>“No, you didn’t. We grew up by ourselves.”</p><br/><p>“This is why they say there’s no use being good to your nieces and nephews. Do you know how many of your toys I bought with my part-time job salary? I bought a ton of stuff to eat but I guess I’ll eat it all by myself. You guys have no right to eat what I brought.”</p><br/><p>Only then did they seem aware of the shopping bags in my hands as they scrambled to change their words.</p><br/><p>“No, I want to be uncle’s kid!”</p><br/><p>“Me too!”</p><br/><p>Like that, they flapped around like chicks asking for food.</p><br/><p>I passed the kids the shopping bags and greeted my other family members. My brother and sister-in-law were the same as ever. My brother, who was reading a book on the sofa, took off his glasses and smiled.</p><br/><p>“I might end up forgetting your face.”</p><br/><p>“If you think it’s getting dangerous, just look at father. I look the same as him.”</p><br/><p>My father, who was eating a pear my sister-in-law had peeled for him, frowned. My sister-in-law and my mom laughed, their shoulders shaking.</p><br/><p>I looked at them while I unpacked, and it seemed that the countryside suited them as my parents’ complexions were a lot better than when they were living in Seoul.</p><br/><p>My mom touched my face as she sighed.</p><br/><p>“Just look at how much weight you lost. Are all managers this busy? I thought I had lost one of my children.”</p><br/><p>“For someone who just got in a company, he has to work hard if he wants to settle in.”</p><br/><p>My mom gave a disapproving look when my father said this.</p><br/><p>While eating a pear, I suddenly remembered and looked through my bag. Then I took out a stiff piece of paper I had put in an envelope.</p><br/><p>“Father, here.”</p><br/><p>“What’s this?”</p><br/><p>“Mrs. Jang Yoonok’s autograph.”</p><br/><p>I got her to write my father’s name and about how she wished for his complete recovery. My father, who didn’t smile much, had a smile hanging from his lips. I handed my mom and my sister-in-law each an autograph of Seo Jijoon. Looking at their reactions, it was a success. Seo Jijoon was effective regardless of age.</p><br/><p>Just then, my brother smiled brightly as he said,</p><br/><p>“But Sunwoo, I heard you’re appearing on TV?”</p><br/><p>“That’s right. Ah, what was it? Star Manager? I heard you’re appearing on that. You should have told us. We only learned about this after hearing it from mother-in-law.”</p><br/><p>At my sister-in-law’s words, I turned my gaze towards my mom.</p><br/><p>My mom waved her hands as she said,</p><br/><p>“I only told daughter-in-law.”</p><br/><p>“Hey, Sunwoo, are you appearing on TV?”</p><br/><p>“It ended up that way, uncle.”</p><br/><p>“Sunwoo! I heard you’re appearing on TV? Eldest brother was worried whether you being a manager would be okay, but if you’re appearing on TV, aren’t you a success? But do all managers appear on TV nowadays?”</p><br/><p>“I just happened to go on once, aunt.”</p><br/><p>“Sunwoo, are you really appearing on TV? Star, Star, what was it?”</p><br/><p>“Star Manager. I wish it was a lie.”</p><br/><p>“Sunwoo, are you-!”</p><br/><p>“Yes, I am.”</p><br/><p>I had expected this.</p><br/><p>My mom only told my sister-in-law, my sister-in-law only told someone else, and that someone else only told someone else.</p><br/><p>As the start of the special broadcast approached, my uncle’s family and even my aunts’ families, who went to their in-laws early before coming here, gathered at my parents’ house.</p><br/><p>The living room was bustling with people.</p><hr/><br/><p><sup>{1}</sup> IPTV – Internet Protocol Television. Like ‘video on demand’.</p><br/><p><sup>{2}</sup> There are a variety of Korean pancakes, but mainly frying vegetable in batter to form flat discs. There are versions with seafood, etc.</p><br/><p><sup>{3}</sup> I’m going to romanize their names so it’s less weird, but his name is Kaeul (가을) which means fall/autumn in Korean. Guess what the other kids’ names are?</p>\n</div>\n<div style=\"max-width: 870px;margin: 5px auto;background: repeating-linear-gradient( 45deg, #fff6cc, #fff6cc 5px, #f3ecc7 5px, #f3ecc7 10px );\">\n<!-- Composite Start -->\n<div id=\"M562762ScriptRootC864255\">\n</div>\n<script async=\"\" src=\"https://jsc.mgid.com/m/e/media.boxnovel.org.864255.js\"></script>\n<!-- Composite End -->\n</div>\n<hr class=\"chr-end\"/>\n<div class=\"chr-nav\" id=\"chr-nav-bottom\">\n<div class=\"btn-group\">\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/top-management-chapter-80\" id=\"prev_chap\" title=\"Chapter 80\">\n<span class=\"glyphicon glyphicon-chevron-left\"></span>\n<span class=\"hidden-xs\">Prev Chapter</span>\n</a>\n<button class=\"btn btn-success chr-jump\" type=\"button\">\n<span class=\"glyphicon glyphicon-list-alt\"></span>\n</button>\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/top-management-chapter-82\" id=\"next_chap\" title=\"Chapter 82\">\n<span class=\"hidden-xs\">Next Chapter</span>\n<span class=\"glyphicon glyphicon-chevron-right\"></span>\n</a>\n</div>\n</div>\n<div class=\"text-center\">\n<button class=\"btn btn-warning\" data-chr-id=\"201275\" id=\"chr-error\" type=\"button\"><span class=\"glyphicon glyphicon-exclamation-sign\"></span> Report chapter\r\n                        </button>\n</div>\n<div class=\"bg-info text-center visible-md visible-lg box-notice\">\r\n                        Tip: You can use left, right, A and D keyboard keys to browse between chapters.\r\n                    </div>\n</div>"}