{"title": "Chapter 80", "id": 80, "volume": 1, "url": "http://boxnovel.org/top-management-chapter-80", "volume_title": "Volume 1", "body": "<h1>Chapter 80</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><header class=\"entry-header\"></header></p><div class=\"entry-content content\"><br/><p>Chapter 80: Star Manager (4)</p><br/><p>TL: emptycube / ED: Isleidir</p><hr/><br/><p>“Ah, he’s definitely okay, that manager.”</p><br/><p>Producer Yoon said as he turned his gaze towards the managers.</p><br/><p>Manager Jung Sunwoo immediately caught his eye amongst the bland managers. It seemed he was still shocked by the reveal of his dark past as he was rubbing his face. Even this grabbed people’s attention.</p><br/><p>Writer Park looked in the same direction and smiled.</p><br/><p>“He’s better than okay, he’s very good. The majority of the remarks Neptune made that I think we should keep are ones that are from a back-and-forth with their manager.”</p><br/><p>“Now that I think about it, that’s true.”</p><br/><p>“He gives off a completely different feeling. At first, their comments were typical as if they had memorized them night after night, but once their manager joined in, they became much livelier.”</p><br/><p>At first, there was no doubt that the expressions Neptune had were those of rookies. They were okay with it though as they didn’t hold many expectations for a new girl group that didn’t have a lot of experience appearing on entertainment shows.</p><br/><p>The role they expected Neptune to take was to tell the story behind Lee Songha’s controversies, which their viewers would be interested in, and to catch the viewers’ attention with their pretty looks amongst the group of males. This was all.</p><br/><p>If they hoped for a little more, it was that their chemistry with their manager was entertaining.</p><br/><p>However, it was beyond what they had expected.</p><br/><p>Like Writer Park said, their manager had a great influence on this current good mood.</p><br/><p>Whirling a permanent marker in her hand, Writer Park said,</p><br/><p>“There are tons of rookies who are overenthusiastic and go overboard, but they are doing fine. They speak well, and their tone and pronunciation are good that we can hear them clearly. Which is why our eyes keep looking in their direction.”</p><br/><p>“This really, I almost can’t even look at the ones I held expectations for with open eyes, but we got lucky with people we didn’t hold any expectations for.”</p><br/><p>“I know, right? What would we have done if we didn’t cast them at the last minute.”</p><br/><p>“Thinking of it makes me dizzy. I might have even opened up a bottle of soju in the editing room.”</p><br/><p>The people they had expected do better than average were flopping one after another, especially Kim Dongho, who had been an aspiring comedian. He tested the MCs’ patience with his terrible jokes, which felt like a chilling wind. Park Taepyeong even stopped talking to him a while ago.</p><br/><p>Producer Yoon licked his lips and said,</p><br/><p>“If they can continue like this outdoors, then there’s nothing more I could want from them.”</p><br/><p>“I think Mr. Taepyeong is going to look after them. Can’t we be hopeful?”</p><br/><p>“Look after them? Not Mr. Sukwoo, but Senior Taepyeong?”</p><br/><p>At his tone that seemed to ask if she had made a mistake, Writer Park just shrugged. She looked at Jung Sunwoo and Park Taepyeong, who was giggling next to him.</p><br/><p>“He looks after good rookies like he said. To me, it looks like Mr. Taepyeong really likes Manager Jung Sunwoo.”</p><br/><p>*</p><br/><p>As soon as they finished filming in the studio, people began to move en-masse.</p><br/><p>The staff and the cast cleaned up the studio and gathered outside for the outdoor shoot. The forecast kept saying there would be a cold wave, and it really was damn cold. When I sighed, steam flowed out from my mouth. It reminded me of how I felt about my soul.</p><br/><p>With a faint smile, I asked the camerawoman filming me,</p><br/><p>“The dark past part from before, can we edit that out?”</p><br/><p>“Nope. Even if I were the main producer, I’d keep it.”</p><br/><p>I thought that would be the case since the main producer came up to me with his lips curved up to his ears and gave me a ton of encouragement. He said something about how, if I continued like this, I would receive casting calls for entertainment shows.</p><br/><p>It wasn’t welcome news at all.</p><br/><p>Afterwards, Im Seoyoung poked my shoulder. With an expression that looked like a criminal on her way to exile or a puppy that had just made an enormous mistake, she blinked her round eyes. If she had a tail, it would droop down to the ground.</p><br/><p>The cameraman assigned to Neptune stuck his camera in and filmed this scene.</p><br/><p>“Oppa, oppa.”</p><br/><p>“What, what?”</p><br/><p>When I replied nonchalantly, Im Seoyoung’s complexion brightened.</p><br/><p>“I really, truly think my mouth has gone crazy. I had a mental breakdown when they said there would be no logic quiz, and since victory was dangling in front of my eyes because Lee Songha was doing so well, I felt a sense of urgency. I felt like something bad would happen if we lost or something. Euaah, oppa, are you okay?”</p><br/><p>“Of course, I’m fine.”</p><br/><p>“Really?”</p><br/><p>“Yeah, in front of the camera.”</p><br/><p>“… What if there isn’t a camera?”</p><br/><p>I glanced at the camera before saying gloomily,</p><br/><p>“Seoyoung, if I die when I go back home for Lunar New Year’s Day, the cause of death would be out of embarrassment. I’ll ask that they bury you alive in my grave.”</p><br/><p>“Oh my god!”</p><br/><p>Im Seoyoung crouched down. It looked like her soul had drifted off and only paper-thin husk remained, fluttering in her place. After watching her like this for a few seconds, I patted her hunched shoulders.</p><br/><p>“I’m joking, you can stick your head back out.”</p><br/><p>“For real this time? It’s for real, right?”</p><br/><p>“I’ll just take a doll instead of you.”</p><br/><p>“Ah, oppa!”</p><br/><p>Full of energy once again, Im Seoyoung slapped my shoulder.</p><br/><p>The other members had expressions that they expected this and laughed.</p><br/><p>I secretly checked the cameramen’s expressions. Since the studio, Im Seoyoung’s current self was quite close to her normal self. To me, it looked like she was giving off a favorable expression, but that might be because I was like a hedgehog parent.<sup>{1}</sup></p><br/><p>Wondering how others looked at her, my worries sneaked up before subsiding.</p><br/><p>The lips of the cameramen, who were looking at Im Seoyoung, were curled upwards. Also, their eyes gave off the nice impression of an unni and oppa.</p><br/><p>On the pavement where good-looking vans were lined up outside the broadcasting company.</p><br/><p>Passengers were already present in the van we were to ride. Jang Noksu and Kim Dongho were planning out the comments they would give each other and the reactions they would make. It was almost like a rehearsal.</p><br/><p>When we approached, Kim Dongho gave me a displeased look. He was acting like this for a while now. Well, I didn’t really care about glances like his since I received plenty of them while going around with Neptune. Just, I didn’t know why he was acting like that.</p><br/><p>Did he think my reactions were too soft and he didn’t like them?</p><br/><p>However, those were the best reactions I could make when his jokes could even make time and space curl up. When the cast and the MCs shuddered at his jokes, wouldn’t it be weirder if I alone gave him a standing ovation?</p><br/><p>Whatever the reason, since it looked like I was the junior here, I cleared my throat and said,</p><br/><p>“I’ll driv-“</p><br/><p>“No, you can’t.”</p><br/><p>Park Taepyeong suddenly came out behind me.</p><br/><p>“You heard the rules in the studio. As soon as you get in the van, your positions are switched. Celebrities become managers and managers become celebrities.”</p><br/><p>As he said this, he handed us name tags. My name was on the name tags Neptune received, and all four of their names were on mine.</p><br/><p>This meant I need to act like all four of them by myself. I was going to be busy.</p><br/><p>When I looked at the girls to see what they were up to, they had their heads pressed against each other and were whispering amongst each other.</p><br/><p>Park Taepyeong looked around as he said,</p><br/><p>“Since Mr. Jung Sunwoo and Mr. Kim Dongho are celebrities here, eliminated, since I’m the MC, eliminated, which means one of the remaining people has to drive.”</p><br/><p>“Uh, are you going to ride with us?”</p><br/><p>When Kim Dongho happily asked, Park Taepyeong nodded his head.</p><br/><p>“Since we’re going anyways, I decided to go with the team that looked like they’ll get a lot of airtime.”</p><br/><p>“Thank you! We prepared a few more jokes so could yo-!”</p><br/><p>“Don’t do them! It’s already cold, I’ll freeze to death!”</p><br/><p>After shouting, Park Taepyeong placed his hand on my shoulder.</p><br/><p>“Also, it’s not your team, but his.”</p><br/><p>At his additional words, Kim Dongho’s expression crumbled.</p><br/><p>The team that seemed like they would get a lot of airtime. This was the evaluation we received from the great Park Taepyeong, who was known to be as prickly as sandpaper. Although I expected this when the staff’s reactions became excessively positive and when Kim Hyunjo’s smiling face grew wider, this was really a great start.</p><br/><p>Jang Noksu took the wheel. He had no choice since we couldn’t let the girls drive.</p><br/><p>As she made her way to the backmost seat, Im Seoyoung mumbled,</p><br/><p>“I have a driver’s license too. I got one just for situations like this.”</p><br/><p>“No, put it away. Yours isn’t for driving but a form of ID. If you drive, our closing scene will be at a police station or an emergency hospital.”</p><br/><p>Being the last person, I was about to get in when the van suddenly burst into laughter. Park Taepyeong was holding his belly as he laughed. It wasn’t because he was aware of the cameras installed in the van, but he was laughing for real.</p><br/><p>I almost slipped when I tried to get in because of the girls’ expressions sitting at the back together.</p><br/><p>They all had their mouths firmly shut and were straining their eyes. They were doing their best to make frowning faces. Park Taepyeong was laughing out loud as he said something about how they should go get a refund with those faces.</p><br/><p>I opened and closed my mouth before asking,</p><br/><p>“What are you doing?”</p><br/><p>“We are imitating oppa’s face.”</p><br/><p>It seemed she was trying to hold her laughter as Im Seoyoung’s lips trembled when she talked.</p><br/><p>“Do you have a grudge against me? When did I ever make a face like that?”</p><br/><p>“Look at a mirror.”</p><br/><p>LJ replied. Then, as if she just remembered, she looked in a mirror and smiled.</p><br/><p>“I need to practice smiling.”</p><br/><p>“I need to practice too.”</p><br/><p>Im Seoyoung enthusiastically joined in.</p><br/><p>I looked at them dumbfounded when Lee Taehee directed her phone at me.</p><br/><p>“I need to take this.”</p><br/><p>She said as she took a picture. Her eyes were smiling.</p><br/><p>Even more excited, Im Seoyoung gave her a tip.</p><br/><p>“Unni, you can’t take a good picture. The pictures oppa takes look like they were taken with his feet.”</p><br/><p>Stop it!</p><br/><p>While these words made their way up my throat, what left my mouth was a sigh. Still astonished, I got in the van. Park Taepyeong looked at me amongst the girls, who were still making frowning faces, and laughed even louder. That man was going to throw up if he kept laughing like that.</p><br/><p>Just then, someone leaned in from behind me.</p><br/><p>Fortunately, it was Lee Songha this time.</p><br/><p>Just as I relaxed from being worried about what it would be now, Lee Songha’s forehead wrinkled as she said,</p><br/><p>“When you get in a car, you need to put on your seatbelt.”</p><br/><p>Following this, it was a complete mess.</p><br/><p>Throughout the time we were on the road and when the recording continued afterwards, the girls enthusiastically imitated me, and in order to repay them, I put my heart into acting like the four of them by myself.</p><br/><p>Should I say it was like, if one side threw a bomb, then the other would launch a missile, which led to the first side launching an atomic bomb? In the end, what I was saying was that both sides were completely beaten up.</p><br/><p>It was such a mess that I wondered if it would be okay for the broadcast, but people’s reactions were good. The camerawoman following me kept mumbling that there was nothing to cut out.</p><br/><p>Yeah, if the broadcast ended up being entertaining, and if Neptune’s first time on a public network was a success, then we had pretty much attained our goal. My image, that had just gone through a blender, well, like always, it would momentarily be talked about before quieting down. It would. It must.</p><br/><p>Anyways, what remained after the recording were the staff’s warm smiles.</p><br/><p>Park Taepyeong’s empty promise, telling Neptune that he would cast them on his weekend entertainment show and to bring me along with them.</p><br/><p>Also, some memories that would make me kick my blanket at night.</p><br/><p>Ah, right. One more thing.</p><br/><p>We got the winning prize, a top-quality beef set.</p><br/><p>A few days after the entertainment recording that felt like it would forever remain in my dark past.</p><br/><p>As a reward for appearing on the entertainment show, that day finally arrived.</p><br/><p>A day that made me feel as though I was on the same level as dragons and mermaids. The day that would come only if I forgot about it. The day that made me rage as it disappeared like a mirage multiple times before.</p><br/><p>It was a break.</p><br/><p>I had prepared a perfect plan two days ahead of time for this day.</p><br/><p>First, I would watch a movie early in the morning then have simple lunch near the theatre. After watching a second and third movie, I would have dinner and recover myself with a cup of coffee. Finally, I planned on watching the most anticipated blockbuster.</p><br/><p>Just thinking about it made my heart ache with happiness.</p><br/><p>While humming, I bought a coffee and popcorn. Then I joined the group of people who came as couples or friends and got on the elevator.</p><br/><p>Enjoying a movie by yourself was the best. Of course, of course.</p><br/><p>To be honest, I didn’t have any friends who would watch four movies in a day with me.</p><br/><p>“I’ll check your ticket.”</p><br/><p>“Thank you.”</p><br/><p>The theatre employee’s normal greeting sounded like an angel playing the bugle.</p><br/><p>I showed her my mobile ticket. After checking that I had four movie tickets at different times, the employee looked at me as if wondering what kind of person I was.</p><br/><p>I entered the multiplex with light steps. A mobile communications ad was playing on the screen. I sat in the seat which was like the nest for my soul and took out my phone.</p><br/><p>Should I set it to silent or vibrate? Although Kim Hyunjo told me to rest easy as he would absolutely not call me today no matter what happened, too many unavoidable incidents occurred in the life of a manager.</p><br/><p>If I set it to vibrate, I thought I wouldn’t be able to concentrate on the movie because I was concerned that I might have received a call. I set it was the quietest vibrate setting and was about to put it in my pocket when it vibrated.</p><br/><p>I felt an ominous feeling that I shouldn’t check what it was.</p><br/><p>No, there was no way the world would be so cruel to me.</p><br/><p>While hoping it was spam, I stared at my phone screen. I still had hope when I saw the number started with a 02, but damn it, the middle numbers were familiar. Although I didn’t know which team it was, it was from work.</p><br/><p>“Hello?”</p><br/><p>Thinking about it for a few seconds, I went out towards the door and answered the phone.</p><br/><p>I heard an unfamiliar woman’s voice.</p><br/><p>-Is this Manager Jung Sunwoo? I’m sorry for calling you on your break.</p><br/><p>You just needed to tell me trivial matters and hang up within a minute.</p><br/><p>“What is it? Did Neptun-“</p><br/><p>-No, it’s not about Neptune. This is Team 2, but it looks like we need to you cover for someone today. Our team leader said he would personally talk to Team 3 so you just need to go pick her up right now.</p><br/><p>As expected, I didn’t have a good feeling.</p><br/><p>I barely contained my urge to go, ‘Bzzz, bzz, sorry, I can’t hear you,’ and hang up. There were so many employees in the company, but why did they need to pass on a schedule to someone who was on his break for a change?</p><br/><p>First, I should call Kim Hyunjo and ask what-</p><br/><p>-Chief Jo will call you and explain in more detail.</p><br/><p>Wait, who? Chief Jo?</p><br/><p>With a feeling of having watched a horror movie, I asked,</p><br/><p>“… The schedule I’m covering for, who’s it for?”</p><br/><p>-Ms. Son Chaeyoung.</p><hr/><br/><p><sup>{1}</sup> This is referencing an idiom, ‘Even hedgehogs love their children’, meaning parents will always think their children are great.</p>\n</div>\n<div style=\"max-width: 870px;margin: 5px auto;background: repeating-linear-gradient( 45deg, #fff6cc, #fff6cc 5px, #f3ecc7 5px, #f3ecc7 10px );\">\n<!-- Composite Start -->\n<div id=\"M562762ScriptRootC864255\">\n</div>\n<script async=\"\" src=\"https://jsc.mgid.com/m/e/media.boxnovel.org.864255.js\"></script>\n<!-- Composite End -->\n</div>\n<hr class=\"chr-end\"/>\n<div class=\"chr-nav\" id=\"chr-nav-bottom\">\n<div class=\"btn-group\">\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/top-management-chapter-79\" id=\"prev_chap\" title=\"Chapter 79\">\n<span class=\"glyphicon glyphicon-chevron-left\"></span>\n<span class=\"hidden-xs\">Prev Chapter</span>\n</a>\n<button class=\"btn btn-success chr-jump\" type=\"button\">\n<span class=\"glyphicon glyphicon-list-alt\"></span>\n</button>\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/top-management-chapter-81\" id=\"next_chap\" title=\"Chapter 81\">\n<span class=\"hidden-xs\">Next Chapter</span>\n<span class=\"glyphicon glyphicon-chevron-right\"></span>\n</a>\n</div>\n</div>\n<div class=\"text-center\">\n<button class=\"btn btn-warning\" data-chr-id=\"201273\" id=\"chr-error\" type=\"button\"><span class=\"glyphicon glyphicon-exclamation-sign\"></span> Report chapter\r\n                        </button>\n</div>\n<div class=\"bg-info text-center visible-md visible-lg box-notice\">\r\n                        Tip: You can use left, right, A and D keyboard keys to browse between chapters.\r\n                    </div>\n</div>"}