{"title": "Chapter 96", "id": 96, "volume": 1, "url": "http://boxnovel.org/top-management-chapter-96", "volume_title": "Volume 1", "body": "<h1>Chapter 96</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><header class=\"entry-header\"></header></p><div class=\"entry-content content\"><br/><p>Chapter 96: From Now On, We’re (5)</p><br/><p>TL: emptycube / ED: Isleidir</p><hr/><br/><p>{TL/N: I’m sorry to say that there won’t be a TM chapter next week due to personal circumstances. Sorry q.q}</p><br/><p>The recording began again.</p><br/><p>As the mood was too heated, it wasn’t appropriate to continue the mission so we pushed through the crowd and returned to the van. Everyone flopped down like corpses and panted heavily. They looked like they had evacuated to an air-raid shelter to avoid bombs.</p><br/><p>I leaned against the back of the seat and closed my eyes when I heard rustling sounds from the passenger’s seat. Then Lee Songha came closer and said,</p><br/><p>“Oppa.”</p><br/><p>“Yeah, what?”</p><br/><p>“Look at my eyes.”</p><br/><p>“Your eyes? Is there a problem?”</p><br/><p>I immediately turned around to examine her. I saw her black pupils within her eyes, which were so delicate they looked like they were drawn. She looked like she had firmly resolved herself. Should I say she was giving off a ‘tragic beauty’ look?</p><br/><p>Rather than pulling out a marker, it seemed like she was unsheathing a sword… A marker?</p><br/><p>“Why did you take that out?”</p><br/><p>“Oppa’s already under my hypnosis.”</p><br/><p>“What?”</p><br/><p>Astonished, I looked at her, but Lee Songha stealthily avoided my gaze. Then she stretched her arm out and scribbled something on my forehead. When I looked at my forehead in the rear-view mirror, I saw ‘Lee Songha’ written prominently on it.</p><br/><p>“Hey, I told you to use it on someone else-“</p><br/><p>“It can’t be helped since I can’t allow you to do something dangerous elsewhere again.”</p><br/><p>“Your expression is too happy for something that ‘can’t be helped’.”</p><br/><p>“… No.”</p><br/><p>It was too late to try to change your expression now.</p><br/><p>The people in the back seats giggled as they watched us, even the young Song Yuri. Then Lee Taehee patted Lee Songha’s shoulder, saying that she did well and that ‘it’s probably best if you stick with oppa’.</p><br/><p>I lightly rubbed my forehead. Well, this did make me come to my senses.</p><br/><p>To be honest, I was worried that I wouldn’t be able to focus 100% on the recording because of the sudden incident. My head was complicated with thoughts about the news and how the incident was quickly spreading on the internet.</p><br/><p>However, after she scribbled her name on my forehead, the fog in front of me seemed to clear a little.</p><br/><p>I did resolve myself that I would give it my all since I was already appearing on the show. I cleared my head and decided to focus on the entertainment show recording right now.</p><br/><p>Producer Bae Junghwan opened the driver’s seat door.</p><br/><p>“Mr. Sunwoo, we’ll move after you foresee the second future.”</p><br/><p>Then he handed me the box containing dice. Everyone’s gaze was on me. When I gathered the dice with a serious expression, Hwang Jaehyun and Im Joowon jolted up from their seats.</p><br/><p>“No, don’t be like that, Mr. Sunwoo. Don’t make such a serious face, it’s scary now.”</p><br/><p>“Really. I thought it was a concept before but then there was a huge accident. I think I’ll believe it if you told me you really saw the future and acted like that.”</p><br/><p>“Foresee a peaceful future, a peaceful one.”</p><br/><p>I dearly wished for that as well. With crooked lips, I threw the dice.</p><br/><p>30 minutes later, we arrived at a park.</p><br/><p>Bright yellow, lush forsythia beds and a tunnel of plum blossoms that fluttered whenever the wind blew. It was an entirely peaceful sight.</p><br/><p>Not us, just the sight.</p><br/><p>The Superhuman team members read each other’s moods. The foresight was simple. The Superhuman team, after 30 minutes, in the Neulpureum Park, must sacrifice two comrades and capture two members of the Researcher team.</p><br/><p>Whoever it was, he was crap at throwing dice.</p><br/><p>Since what was foreseen had to occur in reality, this meant that two members had to be dragged over to the other team. After a short meeting, Hwang Jaehyun was responsible for Song Yuri and the others were to survive on their own.</p><br/><p>While we were looking around at trails we could escape and hide in, we saw familiar faces at the entrance of the park. Unaware of the foresight, they swarmed at us as though we were a banquet.</p><br/><p>Everyone rushed towards the escape route they had chosen. I also stuck next to Lee Songha and pushed through the maze-like trail.</p><br/><p>“That’s why you should have hypnotized a Researcher team member instead of me-“</p><br/><p>“I have no regrets.”</p><br/><p>“Yeah, okay.”</p><br/><p>Lee Songha said in a resolute face,</p><br/><p>“If someone chases us, quickly hide behind me.”</p><br/><p>“What are you going to do by hiding me?”</p><br/><p>“Since I’m the master right now, I have to protect you.”</p><br/><p>I grinned without realizing it. Ah, so moved that tears filled my eyes.</p><br/><p>“Like this, we might both be dragged off to the research lab.”</p><br/><p>“I don’t think that’s bad in its own wa-“</p><br/><p>“What do you mean it’s not bad!”</p><br/><p>It seemed they knew we were joking with each other even while running away as the cameramen smiled with their faces looking like Hahoe masks<sup>{1}</sup>.</p><br/><p>But for some reason, I heard another pair of smaller footsteps besides the cameramen.</p><br/><p>I turned around to see if it was Lee Taehee, but it was Song Yuri, who was chasing us with her short legs.</p><br/><p>“Uh, why didn’t you go with Mr. Hwang Jaehyun and come over here?”</p><br/><p>Since Hwang Jaehyun had the ability to stop time, the probability of surviving was probably higher with him. Also, Hwang Jaehyun had been taking care of Song Yuri, telling her to just trust and follow him.</p><br/><p>Panting already, Song Yuri said,</p><br/><p>“I think I’ll be a bother if I went with them.”</p><br/><p>“And if you come with us?”</p><br/><p>“Here, you’re going to…”</p><br/><p>Song Yuri dragged off after checking the cameramen. Well, she probably meant that, since the likelihood of Lee Songha and I surviving was low, she wouldn’t be a bother to us.</p><br/><p>Either way, we were fleeing with her when the cameraman assigned to me said,</p><br/><p>“Apparently, Ms. Lee Taehee has been caught?”</p><br/><p>“What?”</p><br/><p>When I asked due to being taken aback, the cameraman showed me his phone screen. Lee Taehee had a mask over her eyes and was detained by the Researcher team. No, she was detained, but she looked comfortable as if she was at home.</p><br/><p>“Her superpower is teleportation, yet how was she caught within a few minutes? Was she crawling?”</p><br/><p>I said, naturally dumbfounded.</p><br/><p>Now that Lee Taehee was caught, if Lee Songha or I was also caught in vain, then things would become troublesome. It would be fortunate if LJ and Im Seoyoung were doing well on the other team, but if not, then this part was ruined.</p><br/><p>Our airtime was a problem, and it would be difficult to face Producer Bae and the entertainment team.</p><br/><p>While I was pondering what I should do to make things entertaining, I heard a commotion behind me. From then on, we were chased constantly. Also, the ones chasing us were three members of the ‘Now We’ team so we were finished the moment we were caught.</p><br/><p>How long had this game of tag continued? Song Yuri was panting heavily as she stopped.</p><br/><p>“Just, just leave me here and run.”</p><br/><p>“What?”</p><br/><p>“I’m a kid anyways. Won’t they leave me alive?”</p><br/><p>Song Yuri, who had been saying this while waving her hand, became shocked and looked at the cameramen. Then, clasping her hands together, she repeatedly begged for what she said not to go on air. Were all child actors like her? She was the textbook example of a grownup child<sup>{2}</sup>.</p><br/><p>After asking for the cameramen’s understanding, Song Yuri continued to talk while covering her mic.</p><br/><p>“I came on the show to change my image. Some people said that I was creepy because I wasn’t child-like. Wouldn’t it seem more child-like if I was caught here? Kids are like that.”</p><br/><p>“No, you acting like this is more creepy.”</p><br/><p>Song Yuri’s expression became strange. I knew I made a mistake when I said that.</p><br/><p>“Sorry, I said that out of my habit of talking to the quadruplets.”</p><br/><p>“… Quadruplets? Are they young?”</p><br/><p>“They are probably two years older than you.”</p><br/><p>While I was speaking, Lee Songha, who had been going around looking like a warrior, saying that she would protect me, tapped my back.</p><br/><p>“Oppa, I think they are coming.”</p><br/><p>“Since it looks like it’ll be difficult to keep running away, let’s hide for now. I have a pretty decent idea.”</p><br/><p>I took Lee Songha and Song Yuri, who were tilting their heads, and hid in the nearby forest. The cameramen filmed us from the back while lowering their bodies. It seemed they had separated to look for us as their loud voices communicating with each other came closer.</p><br/><p>I slightly held Song Yuri’s shoulder and said,</p><br/><p>“Now, go out.”</p><br/><p>“Pardon?”</p><br/><p>“If you act as bait and lure someone, I’ll grab him.”</p><br/><p>Since the three of them wouldn’t rush together to capture a tiny child.</p><br/><p>“Lure? Isn’t that too shameless?”</p><br/><p>Song Yuri asked with a dumbfounded face. The hidden meaning should be ‘too shameless for a child to do’. Beside me, Lee Songha mumbled that she thought it was a good idea. I rolled up my sleeves as I said,</p><br/><p>“What is shameless? If we’re caught, we going to be dragged off to the research lab.”</p><br/><p>“When you play with the quadruplets, do you…”</p><br/><p>“Those kids are stronger than me. If they were faced with this situation, then they would have already offered me up as a sacrifice and ran away.”</p><br/><p>Ah, right. The cameras.</p><br/><p>I quickly looked towards the cameras behind me and added,</p><br/><p>“Of course, they are good kids. They are just too competitive from growing up in a jungle.”</p><br/><p>Song Yuri seemed like she was thinking whether this was how a child should act, but in the end, she followed my words and went out as bait. The Researcher team members easily took the bait. The big fish that were baited were caught be Lee Songha and me.</p><br/><p>As things proceeded smoothly, at some point, Lee Songha and Song Yuri rushed out more passionately than me. Lee Songha mumbled some strange words like how it felt like a crime family, and Song Yuri’s expression now looked like a child’s.</p><br/><p>By the time we heard that Im Joowon was dragged away by LJ, we were thinking about who, among the three Researcher team members we caught, we should let free.</p><br/><p>When I asked my cameraman how we were, he gave me a thumb’s up.</p><br/><p>In the center of the city, lights from neon signs rippled like waves.</p><br/><p>After filming in two more locations, we parked the van in a nearby parking lot, waiting for the final recording. We set the DMB<sup>{3}</sup> to PBS News.</p><br/><p>Everyone gulped their saliva as they alternated between their phones and the DMB screen. I was thinking that it might not happen in the end, but Producer Bae’s words put the final nail in the coffin.</p><br/><p>That the incident in Sinchon would go out on the news as a brief.</p><br/><p>“There are already quite a few internet articles. Social media is bustling with footage and stories of people who witnessed the incident. It has become a huge fuss on the internet while we were filming. No wonder our stylists were staring at their phones.</p><br/><p>At Hwang Jaehyun’s words, the two captured Researcher team members nodded.</p><br/><p>“Apparently, reporters contacted our company? Our CEO hyung freaked out when a local news reporter, not an entertainment reporter, contacted him, thinking that I caused an accident.”</p><br/><p>“Hey, our names appeared on the accident report. It’s not like we committed a crime, but it feels weird. I thought that the day my name appeared on an accident report, my life as a celebrity would be over.”</p><br/><p>“There is a lot of discussion about Mr. Sunwoo. Did you see them? Wow, Neptune’s quite something too.”</p><br/><p>“Their performance was great. I bet those who saw the fancams have Neptune’s name embedded in their minds? Don’t tell me once Neptune members become top stars, we won’t be able to cast them because of their schedules or something?”</p><br/><p>Hwang Jaehyun looked at Lee Songha and quietly said,</p><br/><p>“Just in case, write a contract saying that you’ll appear once more.”</p><br/><p>“Ah, hyung. Asking for a contract is going too far. Let’s first exchange phone numbers.”</p><br/><p>My ears perked up while I was blankly looking at my phone screen. When I turned around, Park Jongtae, who was the talkative type among the ‘Now We’ members, was about to hand her his phone when he took it back.</p><br/><p>“Hey, hey, did you see her manager’s expression just now? His expression read, ‘You want to get my girls’ numbers? You have to go through me first.’”</p><br/><p>“No, he was saying not to even try if you don’t have the courage to strike him down.”</p><br/><p>“Girl group managers are just that scary.”</p><br/><p>“I think I know why the drunken driver was instantly restrained. Just think about that expression glaring at you. That person probably felt that his life was in danger?”</p><br/><p>These people.</p><br/><p>“… My expression wasn’t that bad.”</p><br/><p>My expression just stiffened because I was a bit sensitive towards these things after dealing with Punchline’s crazy bastard. They joked, saying, ‘Anyone would say it is that bad,’ and ‘It really is that bad.’ Just as I was wondering how I would shut them up, Lee Songha grabbed my arm.</p><br/><p>“Oppa, I think the news is starting.”</p><br/><p>***</p><br/><p>In another parking lot, the Researcher team’s white van was parked temporarily as well.</p><br/><p>The scene inside was similar. They were all chatting while they waited for the news brief to start on the DMB. Under the dim lights, Im Seoyoung’s eyes shined in a meaningful light as though she was about to tell a strange story.</p><br/><p>“Sometimes, it’s really strange. Oppa got us Next K-Star and that did well. Oppa handed Lee Songha Cat Guardian Ghost, saying that he thought it would be a hit, and it did.”</p><br/><p>“It was a huuuge hit.”</p><br/><p>Im Joowon, who was handcuffed, mumbled with a depressed face.</p><br/><p>“Anything else? Nuna, is there anything else?”</p><br/><p>The mixed-race child actor, Alex, urged Im Seoyoung. He was so focused on her story that his tired eyes shined. Im Seoyoung trembled due to his cuteness and nodded her head.</p><br/><p>“And this time, Sunwoo oppa actively pushed Taehee unni’s song to be a title track and it did well. It reached the top ten.”</p><br/><p>“Oh my god. How desirable. That manager.”</p><br/><p>“At this rate, is his ancestor helping him? Or there is something about him?”</p><br/><p>The people inside the van reacted with glittering eyes.</p><br/><p>Not long after, a member of the ‘Now We’ team looked at a camera and yawned.</p><br/><p>“That’s good. Junghwan hyung should be able to do something with this.”</p><br/><p>“Since that manager picked ‘future prophet’, if he edits it with the Sinchon incident, then I bet it’ll look quite believable?”</p><br/><p>Im Joowon suddenly asked the Neptune members,</p><br/><p>“Is there anything else? Something that didn’t occur yet that he said?”</p><br/><p>“Something that didn’t occur yet…”</p><br/><p>As if she remembered something, LJ shrugged her shoulders.</p><br/><p>“I do remember one thing, but he said this in a joking manner a few months ago.”</p><br/><p>“What is it?”</p><br/><p>“That we’ll take first place on a music broadcast.”</p><br/><p>Eyes rolling in thought, Im Joowon abruptly asked,</p><br/><p>“Hyung, when will today’s recording air?”</p><br/><p>“Usually, it airs after two weeks. But I don’t know if they’ll air it a week early before the hot-topicness fades. But why are you asking?”</p><br/><p>Im Joowon grinned as he said,</p><br/><p>“Maybe Neptune will get first before our episode airs.”</p><br/><p>The same time, people crowded around the enormous TV in the W&amp;U lounge. A few people, including Kim Hyunjo and employees from the PR Team, were staring intently at the screen.</p><br/><p>Chief Jo, who got off the elevator and headed towards the vending machines, tilted his head when he discovered this scene.</p><br/><p>“What’s this? Why are you all gathered around the TV? Is something happening today?”</p><br/><p>“Mr. Sunwoo is appearing on the news. Maybe even Neptune.”</p><br/><p>At Team Leader Park’s words, Chief Jo swiftly took a spot.</p><br/><p>“Jung Sunwoo? Why is he appearing on the news and not the entertainment show? Did he cause an incident?”</p><br/><p>“He did.”</p><br/><p>Kim Hyunjo replied, as if at a loss for words. During this time, the news anchor’s remarks concerning a gruesome murder ended, and finally, the news briefing began.</p><br/><p>{This is the main news brief and incident for today.</p><br/><p>While drunk, Mr. A, who was in his forties, drove his water bottle truck into a crowd of civilians and was caught by the police with the help of a civilian.</p><br/><p>The water bottle truck charged out of an alley. Even though the civilians are shocked and fleeing, he doesn’t stop. Fortunately, girl group Neptune’s manager, 27-year-old Jung Sunwoo, was at the scene and settled the incident by dragging the driver out of the truck.</p><br/><p>It was later revealed that he had discovered the drunken driver and reported to 112 before searching for the truck.}</p><br/><p>Listening to the anchor’s recorded voice, Chief Jo blinked.</p><br/><p>The scene where a water bottle truck was causing a fuss like a wild buffalo in a vehicle restricted area and shocked civilians fleeing from it played on the screen.</p><br/><p>When the truck stopped momentarily after ramming into the traffic cones, someone jumped towards the truck and dragged the driver out.</p><br/><p>“Hey, there he is. It’s Mr. Sunwoo!”</p><br/><p>“What the heck, you can clearly see his face!”</p><br/><p>“I’ll contact PBS’s newsroom and request the full news brief video and a clean version!”</p><br/><p>Excited voices erupted in the lounge. They were so loud that other team employees came over to the TV to see what was going on. During this time, Chief Jo stared at the familiar face on the screen with a foolish expression.</p><br/><p>The anchor continued.</p><br/><p>{This incident has become more trendy after it was later revealed that ‘From Now On, We’re’ team members and their guests, including Neptune, who had arrived at Sinchon to film their program, purposely gathered civilians’ attention to bring them away from the scene of the incident…}</p><hr/><br/><p><sup>{1}</sup> Hahoe mask – traditional Korean masks</p><br/><p><sup>{2}</sup> Grownup child – A child that acts like an adult</p><br/><p><sup>{3}</sup> DMB – Digital Multimedia Broadcasting, TV and radio for mobile.</p>\n</div>\n<div style=\"max-width: 870px;margin: 5px auto;background: repeating-linear-gradient( 45deg, #fff6cc, #fff6cc 5px, #f3ecc7 5px, #f3ecc7 10px );\">\n<!-- Composite Start -->\n<div id=\"M562762ScriptRootC864255\">\n</div>\n<script async=\"\" src=\"https://jsc.mgid.com/m/e/media.boxnovel.org.864255.js\"></script>\n<!-- Composite End -->\n</div>\n<hr class=\"chr-end\"/>\n<div class=\"chr-nav\" id=\"chr-nav-bottom\">\n<div class=\"btn-group\">\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/top-management-chapter-95\" id=\"prev_chap\" title=\"Chapter 95\">\n<span class=\"glyphicon glyphicon-chevron-left\"></span>\n<span class=\"hidden-xs\">Prev Chapter</span>\n</a>\n<button class=\"btn btn-success chr-jump\" type=\"button\">\n<span class=\"glyphicon glyphicon-list-alt\"></span>\n</button>\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/top-management-chapter-97\" id=\"next_chap\" title=\"Chapter 97\">\n<span class=\"hidden-xs\">Next Chapter</span>\n<span class=\"glyphicon glyphicon-chevron-right\"></span>\n</a>\n</div>\n</div>\n<div class=\"text-center\">\n<button class=\"btn btn-warning\" data-chr-id=\"201305\" id=\"chr-error\" type=\"button\"><span class=\"glyphicon glyphicon-exclamation-sign\"></span> Report chapter\r\n                        </button>\n</div>\n<div class=\"bg-info text-center visible-md visible-lg box-notice\">\r\n                        Tip: You can use left, right, A and D keyboard keys to browse between chapters.\r\n                    </div>\n</div>"}