{"title": "Chapter 113", "id": 113, "volume": 2, "url": "http://boxnovel.org/top-management-chapter-113", "volume_title": "Volume 2", "body": "<h1>Chapter 113</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><header class=\"entry-header\"></header></p><div class=\"entry-content content\"><br/><p>Chapter 113: To Find a Path within a Fog (4)</p><br/><p>TL: emptycube / ED: Isleidir</p><hr/><br/><p>“Uh, Mr. Sunwoo! We have high hopes for Royal Family!”</p><br/><p>Don’t have high hopes.</p><br/><p>“Chief Jung! Midas’s Hand! I’m thinking about buying Well-Made Production stocks!”</p><br/><p>Don’t buy any.</p><br/><p>I heard stuff like this wherever I went. Whenever I heard that damn Royal Family, I felt like a hole was opening up in my stomach. However, the incident that took the cake was when I met Im Joowon and Chief Sung at work.</p><br/><p>“Chief Jung, Mr. Joowon signed his exclusive contract today. Also, his first project at our company might be Royal Family.”</p><br/><p>“What did you say?”</p><br/><p>“The sub-lead role. We gave up on the male lead because they are apparently going to cast some amazing worldwide star. Even though he’s the sub-lead, we thought that his screen time and story didn’t lose out to the lead.”</p><br/><p>The bigger Chief Sung’s smile became, the more my soul crumpled.</p><br/><p>Im Joowon shrugged his shoulders with a slightly excited expression.</p><br/><p>“I heard that this drama is pretty much a ticket to becoming a worldwide star. The problem with my previous company was that they always got me crappy projects, but it feels like things are going well as soon as I join W&amp;U. If I get cast for the role, please take care of me.”</p><br/><p>Oh my god.</p><br/><p>I had to do something about Royal Family.</p><br/><p>It had dropped from being a gold mine to a crap mine. I had personally picked this drama without knowing it would flop. I had to take measures to somehow change the future.</p><br/><p>I couldn’t find the answer because something would pop up when I was about to think about it.</p><br/><p>-Sunwoo, what do you call that… Daily? A newspaper called Daily something called us asking for an interview. What should we do?</p><br/><p>Something like this.</p><br/><p>-The reporter kept begging us. I didn’t want to say anything I shouldn’t so I told him I’d ask you and got his contact information. What should I do? Do I have to do an interview?</p><br/><p>“No, mom, it’s definitely nothing like that. Just give me his number, I’ll take care of it.”</p><br/><p>As soon as I hung up, I called the reporter’s personal phone. I didn’t know whether it was on purpose or not, but he didn’t answer my phone. I sent him a text telling him to contact me instead of my home if he had some business.</p><br/><p>I checked the time intermittently when Kim Hyunjo, who was eating kong-guksu<sup>{1}</sup>, said,</p><br/><p>“A reporter called your home?”</p><br/><p>“Yes, I don’t know who he is, but he seems to have nothing better to do.”</p><br/><p>“Hey, it looks like you’ve really gotten famous.”</p><br/><p>It seemed like netizens lacked something to talk about or perhaps W&amp;U and Well-Made’s marketing team’s co-op strategy worked. These past two days were the peak of my fame since I had hair on my head.</p><br/><p>As soon as I hung up, my phone rang again. Damn it.</p><br/><p>“Who is it this time? They won’t even let you eat.”</p><br/><p>“… This time, it’s Mr. Hwang Jaehyun.”</p><br/><p>“Who? Hwang Jaehyung from ‘Now, We’re’? Why is he calling?”</p><br/><p>I didn’t know either. I bitterly looked at my phone screen before answering the phone.</p><br/><p>“Hello?”</p><br/><p>-Mr. Sunwoo! (Mr. Sunwoo, it’s been a while!) We are currently recording the show!</p><br/><p>The other side seemed to be on speakerphone as I could hear the voices of other members mixed in besides Hwang Jaehyun’s.</p><br/><p>-We are picking our allowance!<sup>{2}</sup> Choose either one or two!</p><br/><p>“Pardon?”</p><br/><p>-One of them is nothing and the other is 100,000 won! Time is running out! We have five seconds, five! Save us! One? Or two?</p><br/><p>“One.”</p><br/><p>I picked whatever because they were in the middle of recording when I heard people scream from the other side.</p><br/><p>-Euaah, oh my gosh! It’s 100,000 won! (Mr. Sunwoo, amazing! He’s the real deal! As expected of Midas’s Hand!) See! I told you we should use ‘Jung Sunwoo’ chance!</p><br/><p>It should have contained nothing, why did I have guess right?</p><br/><p>When I hung up after taking my fill of the members’ thanks, Kim Hyunjo was laughing while holding his stomach.</p><br/><p>“’Jung Sunwoo’ chance. Hey, this is something of a dream to other celebrities, yet how did such a fortune land on you? Let me know if you ever want to become a celebrity. I’ll assign a road manager to you. Even now, people are constantly asking me to ask you about it.”</p><br/><p>“No need.”</p><br/><p>Kim Hyunjo grinned when I shook my head.</p><br/><p>“Nothing I can do then. Don’t worry. While it’s a bit of a shame, there won’t be anyone pushing you into it.”</p><br/><p>Now that I thought about it, it was weird that no one told me to go on entertainment shows. It wouldn’t be strange since, the more talked about I am, the more Royal Family and Neptune get promoted as well. I also suffered a bit back when Star Manager became a hit.</p><br/><p>As if he could see what I was thinking about, Kim Hyunjo said,</p><br/><p>“The CEO personally said so. To not push it onto you if you don’t want to.”</p><br/><p>“The CEO did?”</p><br/><p>“Yeah. That’s why there a rumor spreading that the CEO is taking great care of you.”</p><br/><p>I suddenly recalled something as soon as I recalled CEO Baek Hansung’s leisurely face. What would he do if he was in my situation? How would he handle this situation?</p><br/><p>Kim Hyunjo continued with a more serious face,</p><br/><p>“Why are you so serious? Do you feel pressure because you think things have gotten too big?”</p><br/><p>“I feel like I suddenly became Nostradamus.”</p><br/><p>“Even though it might be annoying and troublesome right now, just think of it as investing for the future and build up your image. Midas’s Hand. Whatever you choose will be a success. You can’t make an image as good as this with money. If…“</p><br/><p>Kim Hyunjo lowered his voice,</p><br/><p>“Think about how beneficial it’ll be to have this image if you ever become an executive and propel your work or go independent and set up your own company.”</p><br/><p>When I set up my own company, huh? I might be tempted if it was any other situation.</p><br/><p>Kim Hyunjo smiled as he continued,</p><br/><p>“Also, to be honest, what’s there to feel pressure about? The timing is perfect. Your next project is Royal Family.”</p><br/><p>That was the precisely the problem.</p><br/><p>“Royal Family will be a mild success at least. Though the results might not be as great with regards to the investments, there probably is no chance of it flopping?”</p><br/><p>I thought so too.</p><br/><p>Right now, if people searched my name on portal sites, Royal Family would appear as a related result. If I couldn’t change the future and Royal Family flops, then I might even be called the ‘Poop Hand’.</p><br/><p>“For someone who had an expression that read, ‘Of course, it’ll be a success, just how successful it’ll be is the question,’ during Cat Guardian Ghost or Neptune’s mini-album when everyone else was worried they might flop, you become so serious at weird times.”</p><br/><p>That was because it was certain they would do well, because I made it so that they would.</p><br/><p>Kim Hyunjo patted my shoulder as he said,</p><br/><p>“Just trust your choice this time as well.”</p><br/><p>*</p><br/><p>It was difficult to get out of Royal Family at this point.</p><br/><p>While there might be a way to convince Im Joowon, who was still discussing it, otherwise, Lee Songha had already signed the contract. If she tried to call it off now, even ignoring the penalty for the breach of contract, it would leave a stain on her image as an actress. A top star would be frowned upon, there was nothing more to say for a rookie like Lee Songha.</p><br/><p>If there was a method, it would be dropping out due to an injury.</p><br/><p>It would affect the filming schedule if she had to wear a cast on her arm or leg for a long period of time. She would be able to drop out from the drama without it being shameful.</p><br/><p>“Oppa, what are you doing in the middle of script reading?”</p><br/><p>Lee Songha asked while blinking her eyes slowly.</p><br/><p>I jolted to my senses. You crazy bastard, just what were you thinking?</p><br/><p>“… Sorry, I just thought of something crazy for a moment.”</p><br/><p>“Ah, I thought you were looking at my legs.”</p><br/><p>“No.”</p><br/><p>“So you weren’t.”</p><br/><p>I felt a chill run down my spine. Was I going insane after becoming absorbed in these thoughts these days? What cast?</p><br/><p>“Uh, no. It’s getting late, should we take a short break? Aren’t you tired?”</p><br/><p>“I’m fine, but it seems you’re tired. Let’s end it here for today.”</p><br/><p>I felt like my heart was being pricked when I saw her worried look. She was always chanting for script reading sessions, yet this script reading session that we squeezed in due to our busy schedule was wasted because I couldn’t focus.</p><br/><p>“No, let’s do some more. I just have a lot on my mind. I’ll focus this time so-“</p><br/><p>“No, I’ll read it on my own at home. You can relax.”</p><br/><p>Lee Songha said as she took the script.</p><br/><p>“I’ll work hard, no, I’ll do well. I’m confident this time.”</p><br/><p>*</p><br/><p>After sitting in front of my desk all night, I went up to the rooftop of my apartment to cool my mind. Spring was almost over so even though it was morning, the wind was lukewarm.</p><br/><p>It felt like I was looking for a path in a thick fog.</p><br/><p>If there was no way to change the future, then was it time to take measure to recover from the fall? Discussions about the schedule for the 34-billion-won movie were proceeding well. If her next project was a success, then she would be able to recover from a failed drama.</p><br/><p>However, it would be distressing if I just continued knowing that this path was doomed without taking any measures.</p><br/><p>On top of that, it would be a great waste of time. Also, my mind kept thinking about the dramas that we had to give up due to overlapping schedules when we chose Royal Family.</p><br/><p>It was even more frustrating considering this was a project we took from Son Chaeyoung.</p><br/><p>Under normal circumstances, Son Chaeyoung might have done this project. Even if it failed, it would have been Son Chaeyoung’s.</p><br/><p>My mind jolted when I thought about Son Chaeyoung. When I thought about how much that woman would like it if this drama flopped, it felt like fuel was surging in my tired body. Yeah, this wasn’t the time to be like this.</p><br/><p>I slapped my cheeks and was about to get off the rooftop when my phone vibrated. It was Reporter Park Woo Jeong.</p><br/><p>-Chief! Could you give me a slight hint on whose likely to be cast for Royal Family’s male lead? Of course, I’ll publish it once the confirmation is released! I just want to write it in advance! Euhaha.</p><br/><p>I heard that the male lead was almost confirmed.</p><br/><p>Yoon Taekyung.</p><br/><p>A top star worthy of his name, he was one of the top Korean stars with an amazing popularity in China as well. He was someone who received a guarantee of 100 million won for just appearing on a Chinese entertainment show.</p><br/><p>Going down the stairs, I wrote a simple reply. Just as I was writing about how they would sign once they finished up their negotiations, the text on my phone became blurry.</p><br/><p>Did my sight go blurry because I was awake all night?</p><br/><p>Just as I was thinking this, the world was dyed black.</p><br/><p>“I mean, who could have known? That the amaaaazing male lead they spent a ton of money on to be their poster boy would crap all over the project?”</p><br/><p>Static filled my vision. I had a glass of soju in my hand and could smell the oily scent of fried chicken.</p><br/><p>Also, the woman’s voice I heard in front of me, they all felt familiar.</p><br/><p>Was this a continuation of the future from before?</p><br/><p>While engraving her voice in my mind, I inwardly shouted in delight. I felt like I had chugged a 3L soda down my throat just from the chance that I could find a hint from peeking at the future.</p><br/><p>“If they knew about it before they signed, no, even if they knew before it aired, it wouldn’t have ended like this. I think that Star Search purposely published it at that time to screw them over. To make the drama flop and hit them with a ton of compensation pay.”</p><br/><p>The male lead… So an actor, most likely Yoon Taekyung, ruined the drama? If he was going to ruin something, then he should have just ruined his own life.</p><br/><p>But what kind of trouble did he cause to make the drama flop?</p><br/><p>If I knew that, I thought I could change the future.</p><br/><p>The woman, no, I now knew for certain that she was Reporter Park Woojeong. I perked my ears at her voice. Just a little more. It would be great if she could be a bit more detailed.</p><br/><p>My vision went dark just as I thought this.</p><br/><p>No, wait, just a little more.</p><br/><p>Just as I felt that I was holding the glass of soju with all my strength, a strange voice brushed my ears like a stretched-out tape recording.</p><br/><p>“He’s really crazy. A Korean star popular in China to do drugs of all things…”</p><br/><p>As soon as I came to my senses, I missed my step on the stairs.</p><br/><p>Slipping down, I barely managed to land at the bottom. Though my head almost split open, my mood felt so refreshed I felt like I could fly. What could I say? It felt like the frustration that piled in my mind for a thousand years had been completely swept away.</p><br/><p>I took deep breaths to calm my excitement and called Team Leader Park.</p><br/><p>I organized my thoughts as I waited. So… The male lead caused a drug-related problem, and the publication, Star Search, published that? Since the drama already airing, there was nothing they could do as it became a huge commotion?</p><br/><p>-Hello? What is it at this time?</p><br/><p>“Ah, I had something I wanted to ask you about. Team leader, when will Mr. Yoon Taekyung sign the contract?”</p><br/><p>If I gave them evidence that Yoon Taekyung was doing drugs, the contract would undoubtedly fall through. It was a big issue in Korea, but the Chinese entertainment world was especially sensitive to drug-related crimes.</p><br/><p>If this was found out after they started filming, then the schedule would go awry since they would have to go back to casting again. Even if the drama was produced before it aired, they would have to shoot it on a time constraint. It would also become more difficult to adjust the schedule for the movie shoot as well.</p><br/><p>It would be best if I could stop it before they cast him.</p><br/><p>-I was going to tell you when you came to work today, but it looks like the contract will take a bit longer.</p><br/><p>That was some welcome news.</p><br/><p>“Why?”</p><br/><p>-Well-Made sent the synopsis to Park Dojin before sending it to Yoon Taekyung. Apparently, it fell through because they couldn’t settle on his pay, but it seems Park Dojin is interested in lowering his pay to join.</p><br/><p>Wait, then the male lead…</p><br/><p>-They are currently deciding on Yoon Taekyung or Park Dojin.</p><br/><p>My mind was spinning. So there were two candidates, and one of them screwed the drama over with drugs. How would I pick the right one between them? I had to know for sure to find evidence.</p><br/><p>I hung up and ran down the stairs.</p><br/><p>I needed to probe Star Search first.</p><hr/><br/><p><sup>{1}</sup> Noodles in cold soybean soup</p><br/><p><sup>{2}</sup> Some entertainment shows hold games to give ‘allowances’ to cast members, which they may use for transportation, food, etc.</p><br/><p>TL/N: So I won’t be putting footnotes about KRW (Korean Won) to USD (U.S. Dollars) anymore. ~1000 won = $1 USD.</p>\n</div>\n<div style=\"max-width: 870px;margin: 5px auto;background: repeating-linear-gradient( 45deg, #fff6cc, #fff6cc 5px, #f3ecc7 5px, #f3ecc7 10px );\">\n<!-- Composite Start -->\n<div id=\"M562762ScriptRootC864255\">\n</div>\n<script async=\"\" src=\"https://jsc.mgid.com/m/e/media.boxnovel.org.864255.js\"></script>\n<!-- Composite End -->\n</div>\n<hr class=\"chr-end\"/>\n<div class=\"chr-nav\" id=\"chr-nav-bottom\">\n<div class=\"btn-group\">\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/top-management-chapter-112\" id=\"prev_chap\" title=\"Chapter 112\">\n<span class=\"glyphicon glyphicon-chevron-left\"></span>\n<span class=\"hidden-xs\">Prev Chapter</span>\n</a>\n<button class=\"btn btn-success chr-jump\" type=\"button\">\n<span class=\"glyphicon glyphicon-list-alt\"></span>\n</button>\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/top-management-chapter-114\" id=\"next_chap\" title=\"Chapter 114\">\n<span class=\"hidden-xs\">Next Chapter</span>\n<span class=\"glyphicon glyphicon-chevron-right\"></span>\n</a>\n</div>\n</div>\n<div class=\"text-center\">\n<button class=\"btn btn-warning\" data-chr-id=\"201339\" id=\"chr-error\" type=\"button\"><span class=\"glyphicon glyphicon-exclamation-sign\"></span> Report chapter\r\n                        </button>\n</div>\n<div class=\"bg-info text-center visible-md visible-lg box-notice\">\r\n                        Tip: You can use left, right, A and D keyboard keys to browse between chapters.\r\n                    </div>\n</div>"}