{"title": "Chapter 126", "id": 126, "volume": 2, "url": "http://boxnovel.org/top-management-chapter-126", "volume_title": "Volume 2", "body": "<h1>Chapter 126</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><header class=\"entry-header\"></header></p><div class=\"entry-content content\"><br/><p>Chapter 126: A Never-ending Cycle, Whether That’s Power Dynamics or Psychological Warfare (8)</p><br/><p>TL: emptycube / ED: Isleidir</p><hr/><br/><p>The lemon wedge slid down to my chin.</p><br/><p>I threw it off and brushed my hair back. It was wet everywhere I touched. When I licked my lips, I tasted alcohol.</p><br/><p>“Uh, what do I do? Oppa, does it hurt/”</p><br/><p>Lee Songha was rubbing my face with the sleeve of her bathrobe. Even though her movements were hasty, she was careful like she was touching a wet chick. Since there weren’t just one or two people looking at us, I pushed Lee Songha’s hand away and wiped my face with the back of my hand.</p><br/><p>“It doesn’t hurt, but Sonha.”</p><br/><p>“Yes, yes.”</p><br/><p>“I thought I told you to discuss with me if you wanted to throw something?”</p><br/><p>Even though she said her hands felt empty and even if it was out of reflex, I had thought that our promise would take priority.</p><br/><p>When I stared at her, Lee Songha nervously said,</p><br/><p>“I know, I’m sorry, oppa. But the director…”</p><br/><p>“The director?”</p><br/><p>When I looked at the production team, Director Woo was replaying the filmed scene while talking with the production staff and assistant director.</p><br/><p>Soon, Director Woo jolted up from his seat and came over.</p><br/><p>“Chief Jung, your reactions were amazing. We were able to clearly capture your surprised and flustered reactions. See, I told you that you only needed to react. If you knew you’d be splashed with alcohol, you wouldn’t have made such an expression.”</p><br/><p>Ah.</p><br/><p>So Director Woo ordered her.</p><br/><p>“Sorry for giving you this role after asking you to make a cameo appearance. Ms. Chaeyoung’s presence is too big that I thought we needed at least this much action for Mr. Songha to win their power struggle. Since everyone at home knows your relationship with Ms. Songha, the scene will also be comedic.”</p><br/><p>“It’s okay. As long as you got it.”</p><br/><p>And here I thought Lee Songha couldn’t control her instincts and threw it at me.</p><br/><p>I was going to tell Lee Songha that she did a good job before pausing.</p><br/><p>If the scene came out great, why was it NG?</p><br/><p>Before I could ask, Director Woo said,</p><br/><p>“Ms. Chaeyoung, your actions and ad-libbed lines were all great. There’s nothing more to say.”</p><br/><p>Son Chaeyoung’s lips curled up slightly.</p><br/><p>“The problem is Ms. Songha. I don’t think we can use any bust shots of you.”</p><br/><p>My eyes unconsciously widened.</p><br/><p>It was NG because of Lee Songha? They wouldn’t be able to use a single cut?</p><br/><p>Director Woo frowned as he said,</p><br/><p>“Your gaze was great for the previous scene, but this time, the tension in the air crumbled. It was clearly obvious you were hesitant when splashing the cocktail on him. Why are you like this suddenly? Is it your first time in a scene like this? Is it difficult to splash a cocktail on someone you’re close to?”</p><br/><p>“No, it was my mistake. I flinched without knowing… I’ll do it properly this time.”</p><br/><p>Lee Songha replied while biting on her lower lip.</p><br/><p>Director Woo nodded and place his hand on my shoulder.</p><br/><p>“Chief Jung’s reaction was perfect, but since there’s a three shot and an angle where a camera is filming over your shoulder, you are always in the frame. Would you mind doing it again…?”</p><br/><p>I nodded at the apologetic Director Woo.</p><br/><p>I had already been worried that Lee Songha didn’t feel as realistic as Son Chaeyoung, who was only making a cameo appearance. If the mood changes from this scene, if it makes the viewers look at Lee Songha more than Son Chaeyoung, then why not?</p><br/><p>“It’s refreshing and nice. It’s tasty too.”</p><br/><p>Other actors in dramas were hit with kimchi, flour, and stuff, so cocktails weren’t so bad. When I said this while licking my lower lip, Son Chaeyoung’s eyes narrowed. Then she revealed a crooked smile.</p><br/><p>“You like this? Then should I ask her to throw a cake at you next time? That feels much worse.”</p><br/><p>“I’m satisfied with just watching…”</p><br/><p>I trailed off mid-reply.</p><br/><p>A few steps away, Lee Songha was constantly conscious of us.</p><br/><p>She was burning to know what we were talking about. Although it was the director’s order, she felt sorry and guilty for splashing a cocktail on my face and for getting a NG. Which was why she felt she couldn’t join in our conversation.</p><br/><p>These were probably her thoughts right now.</p><br/><p>I decided now wasn’t the time to leave her in that state and talk to Son Chaeyoung so I immediately went over to her. Then I comforted Lee Songha, who was feeling down from the NG.</p><br/><p>“Songha, don’t worry about the NG. Just do it without worrying about me.”</p><br/><p>“Yes, yes, oppa. I’ll do it perfectly this time. There won’t be a third time.”</p><br/><p>Lee Songha said resolutely.</p><br/><p>“NG!”</p><br/><p>Again?</p><br/><p>Lee Songha was taken aback with a flustered face, but Director Woo immediately shouted,</p><br/><p>“Again! And, cue!”</p><br/><p>Son Chaeyoung tightly grasped my arm and dragged me over.</p><br/><p>This time, I observed Lee Songha’s expression without a care for the cocktail flying at my face.</p><br/><p>I understood why the scene was no good.</p><br/><p>While acting, Lee Songha seemed to embody her role to the point it was worrisome, but this wasn’t the case right now. The one who stood rigidly while holding an empty cocktail glass wasn’t the audacious top star Lee Sohee.</p><br/><p>It wasn’t the celebrity Lee Songha who people mistook for being cold and unapproachable.</p><br/><p>She was the Lee Songha that I knew.</p><br/><p>The Lee Songha who held my sleeve and slightly pulled on it and rustled in the passenger seat while handing me jellies or chips.</p><br/><p>That was why the scene was no good.</p><br/><p>Multiple takes all resulted in NGs while I was thinking about what to do.</p><br/><p>Cocktails splashed on my face that many times, and Lee Songha firmly embedded herself into a state of disorder. At first, she didn’t know why the scenes were no good, but after checking the scene on the monitor with the director, she looked even more surprised.</p><br/><p>If I excluded the time she was flustered and forgot all her lines, she never had such a hard time with acting. It seemed she herself was frustrated and nervous that she couldn’t act the way she wanted to as she was at a loss at what to do.</p><br/><p>“Why can’t I do this? Why?”</p><br/><p>While the next cocktail was being prepared, Lee Songha poured water into the used, empty cocktail glasses and threw their contents in a frenzy. She returned to her role quite a bit. The snap in her wrist was also relentless.</p><br/><p>The problem was that she relapsed when the shoot began.</p><br/><p>It seemed she couldn’t immerse herself in her role because of me, should I talk to Director Woo again? But that man’s expression didn’t look great. Don’t tell me the entire scene would be cut?</p><br/><p>I thought about it while drying my hair with a towel when I heard the staff members whispering behind me.</p><br/><p>“Why is she like that? Apparently, she almost never made any NGs when filming Cat Guardian Ghost? Was it because she never had to adlib and strictly followed the script?”</p><br/><p>“I told you not to listen to those ‘apparently’s. Ms. Son Chaeyoung and the manager are the ones suffering.”</p><br/><p>“Putting the manager aside, I bet she’s nervous about Ms. Son Chaeyoung’s mood. How many times did she mess up in the exact spot of the scene with her great sunbae? It’s great that she isn’t pissed. This is worse than the scene with Ms. Seo Eunkyo.”</p><br/><p>“I know, right? If this continues, will Ms. Lee Songha have a mental breakdown?”</p><br/><p>“Then this scene is cut. We are using an incredibly expensive film to make the footage pop since it’s our first scene and there’s a cameo appearance. We’re just burning money like we’re throwing out cocktails.”</p><br/><p>I glanced at Director Woo. He was scratching his sideburns as his eyes were glued to the screen while shaking his head intermittently. He looked like someone who expected something spectacular but suffered a total loss.</p><br/><p>On the other hand, Seo Eunkyo looked like she was enjoying this situation.</p><br/><p>Previously, she looked like she was about to dig her own grave and lie in it because of what happened with Son Chaeyoung and how she messed up the first shoot, but now, she was lying on a sunbed, drinking cocktails jubilantly.</p><br/><p>She was glancing at Lee Songha while whispering to her manager, but it was obvious what they were talking about. They were probably hoping that Lee Songha messed this shoot up so that her scenes would decrease and that she would leave a bad impression on the director and Son Chaeyoung.</p><br/><p>If that happened, they would be joyfully toasting with their cocktails.</p><br/><p>Just thinking about it made my insides twist.</p><br/><p>“Songha.”</p><br/><p>When I approached her, she flinched in surprise like a guilty person.</p><br/><p>I looked around before saying in a quiet voice,</p><br/><p>“Don’t feel so pressured. It’s normal for a rookie actress to mess up. You’re just making mistakes because there are a lot of spontaneous parts to this shoot. That’s why you should just relax and remember how you calmed read Lee Sohee’s lines during practice.”</p><br/><p>“Yes, I’m sorry, oppa. You’re soaked because of me.”</p><br/><p>“I’m fine. Getting splashed with cocktails isn’t bad once in your life.”</p><br/><p>“It’s already your fifth time.”</p><br/><p>“It’s fine, I feel like a lead in a drama.”</p><br/><p>“You got splashed five times because of me and got grabbed five times…”</p><br/><p>Lee Songha mumbled in a gloomy voice as she stared at Son Chaeyoung. She was oddly quiet. I thought that, like Seo Eunkyo, Son Chaeyoung would be beyond irritated and personally attack Lee Songha.</p><br/><p>She was simply looked at us with crossed arms.</p><br/><p>I took my eyes off Son Chaeyoung and lowered my voice,</p><br/><p>“If you still can’t get into the role, think that you’re splashing Son Chaeyoung instead of me. You said that your hands felt empty. You remember when you threw a cake and a snowman’s head at her, right? Recall the rage you felt back then.”</p><br/><p>“Rage…”</p><br/><p>Narrowing her eyes, Lee Songha snatched and downed the other cocktail on the pool bar in an instant. She brought the glass down with a thud. Then, with clenched fists, she said,</p><br/><p>“I think I can do it properly this time. I got a feeling.”</p><br/><p>Just then, Director Woo approached us with a frowning face and said,</p><br/><p>“This is our last take. If it’s no good this time as well, we’re moving onto the next scene.”</p><br/><p>This was our last chance.</p><br/><p>People who heard Director Woo’s words murmured. They seemed interested in whether this final take would be okay or end up as a NG again.</p><br/><p>Seo Eunkyo looked like she needed popcorn.</p><br/><p>Damn it. Let’s not look in her direction since it angers me.</p><br/><p>Anyways, everyone was watching us. If the take resulted in a NG again, then her image as a talented rookie actress she gained while filming Cat Guardian Ghost would be tossed away. Also, the events of today would follow her around throughout the shoot.</p><br/><p>I swallowed dryly and looked at Lee Songha.</p><br/><p>“Don’t misunderstand,”</p><br/><p>Son Chaeyoung suddenly said.</p><br/><p>“About what now?”</p><br/><p>“A cameo appearance is an appearance, but I’m doing this because my screen time might be cut out completely because of her.”</p><br/><p>Saying this, she steadfastly walked to Lee Songha. Then she whispered something in her ear.</p><br/><p>What was she whispering about?</p><br/><p>I couldn’t hear anything even though I perked my ears.</p><br/><p>The surrounding gazes began to lock on them. Although there were quite a few people who were trying to act like they were coming closer and perking their ears, since I, who was closer, couldn’t hear it, they obviously couldn’t.</p><br/><p>Their secret conversation ended quickly.</p><br/><p>Son Chaeyoung casually returned next to me, and Lee Songha stood rigidly with a tight grip on a newly made cocktail I couldn’t clearly see her expression because her head was slightly lowered.</p><br/><p>Just as I was about to ask Son Chaeyoung what she said,</p><br/><p>“This is our last take! And, cue!”</p><br/><p>The murmurs quieted down immediately, and Lee Songha swiftly raised her head.</p><br/><p>That’s it!</p><br/><p>I inwardly yelled in delight when I saw her expression.</p><br/><p>Her chilling face that seemed to have frosted over. However, her eyes were burning in fury.</p><br/><p>A ‘Lee Sohee-like’ gaze. She looked like she could kill.</p><br/><p>“Do you know what she said to me?”</p><br/><p>Son Chaeyoung pulled my arm while saying in an irritated voice.</p><br/><p>At the same time, Lee Songha swung the cocktail glass without hesitation.</p><br/><p>Her emotions looked good! The snap of her wrist was good too! So was her spirit!</p><br/><p>I confirmed as a lemon wedge slapped my cheek.</p><br/><p>This was, without a doubt, a good take.</p><br/><p>That moment, Lee Songha forcefully pushed me aside. Then she suddenly grabbed two cocktail glasses in each hand and swung them.</p><br/><p>Without me as a shield, Son Chaeyoung was completely soaked by her attack.</p><br/><p>“You!”</p><br/><p>Son Chaeyoung screamed.</p><br/><p>“You, are you crazy?!”</p><br/><p>Lee Songha didn’t seem to even hear her as she threw away the empty glasses. Then she reloaded with new ones. Madness lingered in her eyes. It was to the point where I was confused whether she was holding cocktail glasses or Molotov Cocktails.</p><br/><p>“That’s enough! Do you to fight right here and now? Is that it?!”</p><br/><p>I could hear Son Chaeyoung grind her teeth.</p><br/><p>Then, with a dazzling smile, Lee Songha replied,</p><br/><p>“Woof, woof.”</p><br/><p>“You!”</p><br/><p>Pushed aside, I blankly watched the scene in front of me.</p><br/><p>Son Chaeyoung grabbed Lee Songha’s hair first, and Lee Songha immediately grabbed Son Chaeyoung’s head with both hands. Son Chaeyoung’s yells and Lee Songha’s barks mixed together and rang throughout the swimming pool.</p><br/><p>Fighting in close quarters, the two splashed into the pool.</p><br/><p>People hastily retreated from this disaster.</p><br/><p>The quiet pool had, in mere moments, devolved into a mess.</p><br/><p>Seeing this, I suddenly recalled what Director Woo said before.</p><br/><p>He said he wanted to see a ‘I’m the craziest bitch in this industry’ attitude.</p><br/><p>There it was.</p><br/><p>***</p><br/><p>Director Woo’s butt heaved up and down.</p><br/><p>His beard that ran down his sideburns to his chin trembled. His eyes, which were as wide as brass bells, and his thick hands holding a rolled up filming script were shaking. He observed the screen with excitement.</p><br/><p>Most drama writers hoped for their characters to jump off the script.</p><br/><p>And directors hoped for acting that exceeded their own directions.</p><br/><p>In front of him right was a heated performance that exceeded his expectations.</p><br/><p>Director Woo wasn’t the only one who was surprised.</p><br/><p>The production, directing, camera, lights, and audio staff were all hypnotized by the fight in the pool.</p><br/><p>Seo Eunkyo, who had hoped for Lee Songha’s terrible performance, couldn’t close her agape mouth, and the spectators, who were in an uproar to take pictures while avoiding the security guards’ gazes, stood stiff, only moving their eyes.</p><br/><p>A Well-Made Production employee broke the silence and admired,</p><br/><p>“Wow! Goddamn! Their energy is amazin-!”</p><br/><p>Director Woo raised his hand and cut him off.</p><br/><p>Then he began quickly ordering the staff.</p><br/><p>“We keep rolling! Have the jib camera chase them and get a full shot! Boom mic! Audio director, we’re going to use all their adlibbed lines so try to preserve as many as possible. If we leave it for post recording, it’ll kill this amazing scene!”</p><br/><p>The audio director checked that the boom mic was above the pool and gave him a thumbs up.</p><br/><p>“I think we’ll be able to preserve almost all of it. The two actresses are no joke. They are saying some aggressive adlibbed lines without rest, yet their pronunciation is clear and steady so your ears pick them up easily!”</p><br/><p>“Good, good.”</p><br/><p>Director Woo licked his dry lips and said,</p><br/><p>“Get one camera on Chief Jung Sunwoo’s reaction. His reaction is great.”</p><br/><p>Immediately, a camera got a closeup of his face.</p><br/><p>With a face full of confusion and amazement, Jung Sunwoo was looking into the pool that was splashing about. His expression was clearly recorded by the camera.</p><br/><p>A staff member, who had been staring at the various closely arranged screens, pressed her chest and whispered,</p><br/><p>“Oh, my. Even as a spectator, I can’t help but hold my breath. Even if we consider Chief Jung Sunwoo’s reaction as real, Ms. Son Chaeyoung and Ms. Lee Songha are incredible. So realistic and lively! It feels more realistic than a real fight!”</p><br/><p>“Consider yourself lucky. Do you think it’s easy to see a something like this? An adlib scene like this is rare even in the movie business. They looked possessed.”</p><br/><p>“Their cooperation is amazingly good. You might even doubt this is all adlibbed and think they’ve rehearsed it a hundred times. I bet no one would believe that this was all adlibbed even if we showed them the tapes?”</p><br/><p>“I mean, even their pronunciation is precise. That means they are thinking about how they should deliver lines in this situation, just amazing. How could they improvise something like that?”</p><br/><p>“That’s why they are actresses, man. That’s why they are professionals.”</p><br/><p>The two actresses’ performance didn’t end even as the faces of everyone gathered in the swimming pool flushed with excitement and their mouths were dry from admiration.</p><br/><p>Just then, Director Woo’s signal rang out.</p><br/><p>“Okay! Cut!”</p>\n</div>\n<div style=\"max-width: 870px;margin: 5px auto;background: repeating-linear-gradient( 45deg, #fff6cc, #fff6cc 5px, #f3ecc7 5px, #f3ecc7 10px );\">\n<!-- Composite Start -->\n<div id=\"M562762ScriptRootC864255\">\n</div>\n<script async=\"\" src=\"https://jsc.mgid.com/m/e/media.boxnovel.org.864255.js\"></script>\n<!-- Composite End -->\n</div>\n<hr class=\"chr-end\"/>\n<div class=\"chr-nav\" id=\"chr-nav-bottom\">\n<div class=\"btn-group\">\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/top-management-chapter-125\" id=\"prev_chap\" title=\"Chapter 125\">\n<span class=\"glyphicon glyphicon-chevron-left\"></span>\n<span class=\"hidden-xs\">Prev Chapter</span>\n</a>\n<button class=\"btn btn-success chr-jump\" type=\"button\">\n<span class=\"glyphicon glyphicon-list-alt\"></span>\n</button>\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/top-management-chapter-127\" id=\"next_chap\" title=\"Chapter 127\">\n<span class=\"hidden-xs\">Next Chapter</span>\n<span class=\"glyphicon glyphicon-chevron-right\"></span>\n</a>\n</div>\n</div>\n<div class=\"text-center\">\n<button class=\"btn btn-warning\" data-chr-id=\"201365\" id=\"chr-error\" type=\"button\"><span class=\"glyphicon glyphicon-exclamation-sign\"></span> Report chapter\r\n                        </button>\n</div>\n<div class=\"bg-info text-center visible-md visible-lg box-notice\">\r\n                        Tip: You can use left, right, A and D keyboard keys to browse between chapters.\r\n                    </div>\n</div>"}