{"title": "Chapter 122", "id": 122, "volume": 2, "url": "http://boxnovel.org/top-management-chapter-122", "volume_title": "Volume 2", "body": "<h1>Chapter 122</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><header class=\"entry-header\"></header></p><div class=\"entry-content content\"><br/><p>Chapter 122: A Never-ending Cycle, Whether That’s Power Dynamics or Psychological Warfare (4)</p><br/><p>TL: emptycube / ED: Isleidir</p><hr/><br/><p>“Why is Son Chaeyoung here? What’s going on?”</p><br/><p>Opening and closing his mouth, Chief Sung looked at me.</p><br/><p>“Why are you asking me?”</p><br/><p>“Ah, I thought that you might know. Your relationship is quite…”</p><br/><p>“Our relationship isn’t good. I don’t know why she’s here.”</p><br/><p>While we were frozen like people witnessing a tornado, the airport was in a clamor thanks to the unexpected top star. Fans waved their hands as they asked her to look their way, and photographers were pressing their shutter buttons.</p><br/><p>Son Chaeyoung leisurely waved her hand at them.</p><br/><p>As she briskly walked towards us.</p><br/><p>“I think she’s coming over here?”</p><br/><p>“I know, right?”</p><br/><p>“No matter how I think about it, it seems like she’s here to see Chief Jung.”</p><br/><p>“How can you tell when she’s wearing sunglasses? She’s probably coming here because of the safety lines set up around us. Company people and security are gathered here as well.”</p><br/><p>I said but, for some reason, I felt like she was coming towards me as well.</p><br/><p>A tornado.</p><br/><p>“What’s going on? Why is she coming here? Is she going to start a fight again?”</p><br/><p>Im Seoyoung’s eyes ignited as she glared at her with her hands on her waist.</p><br/><p>“Try starting a fight! I dare her!”</p><br/><p>“And if she does, what? Do you think you’ll win a fight against Son Chaeyoung, you dummy?”</p><br/><p>“It’s fine. There’s four of us! She can’t do anything in front of greater numbers! We’ll win!”</p><br/><p>Im Seoyoung said confidently, puffing her chest.</p><br/><p>Even while chiding her, LJ stood next to her. Lee Taehee followed suit and stood next to her. No, Lee Taehee’s eyes were too calm to say that she just followed along.</p><br/><p>They did have a big grudge on Son Chaeyoung due to the matter with Lee Songha.</p><br/><p>Lee Songha and me behind them, they set up a crane-wing formation around us, and Lee Songha looked around.</p><br/><p>Silently igniting her fighting spirit.</p><br/><p>“Songha, what are you looking for?”</p><br/><p>“It’s nothing, oppa. I just felt like my hands felt empty.”</p><br/><p>“Just leave them empty.”</p><br/><p>“What if she does something to you? I’ll prepare.”</p><br/><p>“Don’t. Don’t prepare. There are reporters everywhere.”</p><br/><p>Lee Songha made an ‘Ah!’ expression.</p><br/><p>It seemed like she would actually hold something to throw if there weren’t any reporters. It wasn’t like Son Chaeyoung did anything yet, but it seemed like she reflexively grabbed something to throw when she saw her face.</p><br/><p>Like Pavlov’s dogs.</p><br/><p>Our surroundings became quiet. Those who knew the circumstances had uneasy expressions. They looked like they were worried something would happen and whether they should set up a human barricade so the reporters didn’t notice anything.</p><br/><p>Fortunately, I was able to stop Lee Songha, but there was someone else who was full of fighting spirit.</p><br/><p>Im Seoyoung barked like a courageous puppy protecting her home.</p><br/><p>“Come at us! If you want to fight-!”</p><br/><p>“Hello.”</p><br/><p>Son Chaeyoung greeted us with a smile.</p><br/><p>So… with a smile.</p><br/><p>The girls froze at the unexpected action of the tornado in front of them.</p><br/><p>The eyes of staff members, who were watching with bated breaths, widened.</p><br/><p>Son Chaeyoung casually took off her sunglasses. Her gaze brushed past mine.</p><br/><p>Just as I thought the glint in her eyes seemed oddly emotional, Son Chaeyoung smiled once more and greeted by saying,</p><br/><p>“Hello.”</p><br/><p>To Chief Sung.</p><br/><p>Then, as though she didn’t see me, she went to the side. She greeted the other staff members before sitting down on a bench slightly away from me, surrounded by security guards and her stylists.</p><br/><p>Rather than being angry, I was dumbfounded.</p><br/><p>She was so obviously ignoring me.</p><br/><p>“Why is she like that? Is it because of the reporters?”</p><br/><p>“Maybe. She’s thorough when it comes to her image.”</p><br/><p>In front of me, Im Seoyoung and LJ whispered to each other while glaring at her.</p><br/><p>Chief Sung blinked his eyes as he asked,</p><br/><p>“Chief Jung, did you fight with Son Chaeyoung recently?”</p><br/><p>“That’s nothing new. There’s never been a time we haven’t been fighting since we first met.”</p><br/><p>“No, but still, she so obviously only ignoring you? Why is she like that?”</p><br/><p>“I don’t know either.”</p><br/><p>“If the person in question doesn’t know, who does?”</p><br/><p>“No one knows what she’s thinking. She’s Son Chaeyoung.”</p><br/><p>As if he obtained a deep realization from my words, Chief Sung nodded his head.</p><br/><p>Im Joowon, who stood a bit away from me, came up and admired,</p><br/><p>“Wow, I only got to see Son Chaeyoung sunbae<sup>{1}</sup> at award ceremonies, but she’s even more amazing up close. I really hope I get to work on a project with her later.”</p><br/><p>“Don’t say stuff like that! You’re going to jinx it!”</p><br/><p>Chief Sung whispered in fright. Im Joowon shrugged.</p><br/><p>“Why? I heard she has quite the personality, but she’s still my ideal type. Her pure, lovely aura incites a man’s protective instincts.”</p><br/><p>That was the best nonsense I’ve heard all year.</p><br/><p>While Chief Sung worked on chipping away at Im Joowon’s adoration for Son Chaeyoung, Kim Hyunjo, who had returned after calling the staff in China, looked like he had a heart attack when he discovered Son Chaeyoung.</p><br/><p>“Ah, damn. I almost needed an ambulance instead of a plane!”</p><br/><p>Kim Hyunjo interrogated the chief from Team 2, who followed behind Son Chaeyoung,</p><br/><p>“What’s she doing here?”</p><br/><p>“So that’s… I don’t know. Goddamnit.”</p><br/><p>The chief from Team 2 mumbled with a gloomy complexion.</p><br/><p>“Seo Jijoon had to delay his flight due to personal matters which was why we were going to cancel the ticket, but Son Chaeyoung suddenly said that she would take his seat. I’m here to fill in under the team leader’s orders. I couldn’t even pack a single pair of underwear because I was in a rush.”</p><br/><p>“Why is she going to China? Does she have a schedule there?”</p><br/><p>“She has a photo shoot in Beijing. Next week.”</p><br/><p>“If it’s next week, why is she going now?”</p><br/><p>“I don’t know! She said she’ll go on this plane! While actors are a breed that acts on whims, Son Chaeyoung really takes the cake.”</p><br/><p>Kim Hyunjo frowned as he asked,</p><br/><p>“Don’t tell me she in the same hotel as us? She isn’t, right? If you don’t reserve ahead for GHB…”</p><br/><p>“The owner of that hotel was in a fuss, wanting to have a meal with Son Chaeyoung.”</p><br/><p>“Shit.”</p><br/><p>Kim Hyunjo brushed his face.</p><br/><p>So did Chief Sung and I. The majority of those who heard their conversation had the same expression. Only the naïve Im Joowon and a few staff members were happy, thinking how lucky they were, not knowing that their ‘good fortune’ could be a disaster.</p><br/><p>Im Joowon smiled as he said,</p><br/><p>“It’s really like what Ms. Im Seoyoung said before. This feels like an MT.”</p><br/><p>Like hell it does!</p><br/><p>Only one good thing came out of the arrival of the tornado Son Chaeyoung.</p><br/><p>Last to arrive, Seo Eunkyo’s expression crumbled.</p><br/><p>The actors from Cat Guardian Ghost and Royal Family would all depart at different dates, but it just happened that our schedule coincided with Seo Eunkyo’s. As soon as I heard this, I was worried that I needed to be alert on the plane, but I didn’t have to worry any longer.</p><br/><p>Seo Eunkyo was imposing in the beginning. She came towards us, Lee Songha to be exact, with an expression that read she wanted to discipline her since the director and writer weren’t here.</p><br/><p>However, she freaked out when she saw Son Chaeyoung behind her.</p><br/><p>“Ah, hello, sunbae.”</p><br/><p>“Hello.”</p><br/><p>Though Seo Eunkyo was older, Son Chaeyoung had many more years of experience and was on a completely different level than her.</p><br/><p>Maybe it was because she fell behind Son Chaeyoung, but Seo Eunkyo bitterly greeted Neptune and seemed very cautious in front of Son Chaeyoung.</p><br/><p>When Son Chaeyoung greeted her back with a slight smile, Seo Eunkyo, who had been reading her expression, rejoiced. Her eyes filled with the desire to use this opportunity to get friendly with Son Chaeyoung.</p><br/><p>Seeing her wag her tail at Son Chaeyoung she seemed like a chihuahua instead of a queen bee today.</p><br/><p>“I worked with sunbae in the past. Do you remember?”</p><br/><p>“Ah, you did? I usually remember most actors I work with, but I’m not sure.”</p><br/><p>“Ah, I was an extra at that time. That’s probably why you don’t remember. I played your classmate in a flashback. But I heard that we’ll be staying in the same hotel?”</p><br/><p>Son Chaeyoung put her sunglasses back on and nodded.</p><br/><p>“I want to get close to you, but there never was an opportunity until now. You don’t go to celebrity meetings and are only close with celebrities in your company. You’re so mysterious.”</p><br/><p>‘Mysterious’? She sounded like a chihuahua chewing grass.</p><br/><p>“I wanted to film Royal Family with you, but it’s a shame. Though it’s only for a few days, please take care of me.”</p><br/><p>Seo Eunkyo chattered on while sticking to Son Chaeyoung with the same face she hugged Writer Jang with not too long ago.</p><br/><p>Quietly looking at this, I thought, ‘What a crappy two-shot.”</p><br/><p>*</p><br/><p>“Sunwoo.”</p><br/><p>I was looking at the clouds outside the window when Kim Hyunjo, who was sitting beside me, called my name.</p><br/><p>“Yes, chief.”</p><br/><p>“It seems like Son Chaeyoung is staring at you.”</p><br/><p>“Me?”</p><br/><p>I turned around. Son Chaeyoung was casually looking at a magazine.</p><br/><p>“No, she’s not.”</p><br/><p>“She is. She’s been staring at you for a while. It seemed like she might have been glaring.”</p><br/><p>I exchanged a few words with Kim Hyunjo before abruptly looking behind me. My gaze directly met Son Chaeyoung’s. Son Chaeyoung’s right eyebrow raised slightly. Then her lips, which didn’t have any makeup on, moved silently,</p><br/><p>‘Why are you looking at me?’</p><br/><p>Was she an elementary schooler?</p><br/><p>I turned my gaze back since I didn’t want to have a childish fight when I saw a round head in my sight. Lee Songha, who was sitting in front of Son Chaeyoung, was stretching her head out as she looked at me as if telling me to look at her.</p><br/><p>When our eyes met, she smiled slightly.</p><br/><p>Maybe it was because of Son Chaeyoung’s sudden appearance, but Lee Songha was acting a little strange since a while ago. She was obviously very conscious of her, acting like a nervous animal whose territory was invaded.</p><br/><p>As expected, nothing good came out of sticking the two of them together.</p><br/><p>I had to prevent them from meeting as much as possible while we were at the same hotel.</p><br/><p>While pondering for peace, our short flight ended and we arrived at Beijing Capital International Airport. I counted the members of our group once we got off. Since there were seven celebrities, the number was incredible as we included the staff.</p><br/><p>We were about to move as a group after I finished counting when the staff who went to inquire about the situation at the airport and our transportation returned with flustered expressions. They were accompanied by people from the airport and security guards who were wearing black suits and had receivers in their ears.</p><br/><p>“Apparently, there are many more fans than expected at the airport so we can’t leave like this? They didn’t expect such a large crowd so they only dispatched a few security guards. There could be a safety incident at the slightest slip-up.”</p><br/><p>“Are there that many people?”</p><br/><p>“They told me a few hundred people gathered. Apparently, the outside of the airport is packed.”</p><br/><p>“What? Did they think Yoon Taekyung was coming?”</p><br/><p>Kim Hyunjo said while frowning.</p><br/><p>Worried about a situation like this, we decided to have Yoon Taekyung travel in secret. Since he was to appear on a few Chinese entertainment shows while he had a schedule in China, I heard they asked the broadcasting company here to send him a private jet.</p><br/><p>Yoon Taekyung was at a level where airport surroundings would freeze if he appeared. I read an article that stated almost a thousand people gathered last time. It was to the point where the Chinese airport had to personally escort him.</p><br/><p>“What? Then who did they come to see? Is it Seo Eunkyo?”</p><br/><p>“Or Seo Jijoon or Songha… They probably don’t have the popularity.”</p><br/><p>“News of Son Chaeyoung might have already spread.”</p><br/><p>The chiefs, including Kim Hyunjo, tilted their heads as they discussed.</p><br/><p>The staff member said,</p><br/><p>“They think we need to leave secretly though the VIP exit. They said they are dispatching a limousine and security guards to that entrance. There are people lurking there as well so they ask that we stay here while they finish preparing.”</p><br/><p>“Euah, amazing. I only saw foreign fans crowding airports in articles!”</p><br/><p>Excited, Im Seoyoung held my arm as she stomped her feet.</p><br/><p>“Oppa, oppa, but won’t there be at least one or two people here who came to see us? What do we do if they are waiting for us while holding signs? They might be disappointed if we leave secretly! What if we just leave through the exit…”</p><br/><p>“It definitely doesn’t seem like there will be any safety accidents if we leave.”</p><br/><p>LJ added while shrugging her shoulders. As if they heard us, the staff exchanged a few words in Chinese with the airport employees. Then they looked at Im Seoyoung and LJ and nodded.</p><br/><p>“Yes, they said you can leave. There shouldn’t be anything to worry about.”</p><br/><p>“That’s good, but it’s a little sad.”</p><br/><p>Im Seoyoung said with a complicated expression.</p><br/><p>“You must be happy that you can go early.”</p><br/><p>Seo Eunkyo suddenly said.</p><br/><p>Smiling, she glanced at us, especially Lee Songha, before asking the staff,</p><br/><p>“So how long do we have to wait here?”</p><br/><p>Though it looked like she was annoyed at a glance, her shoulders were raised.</p><br/><p>“Ah, if you’re in a hurry, you can just go too.”</p><br/><p>“Pardon?”</p><br/><p>Seo Eunkyo stopping in mid-hair-brushing posture.</p><br/><p>I could see her eyes rapidly moving back and forth.</p><br/><p>“Me? Me?”</p><br/><p>“Yes, Ms. Seo Eunkyo. If you are busy, you can go. It’s fine.”</p><br/><p>Those words gave her another blow.</p><br/><p>She stood blankly for a few seconds before hurriedly putting her sunglasses on. Even if she did that, we could see she was red up to her neck. A few staff members became red too. To endure their laughs.</p><br/><p>“Uh, they said Mr. Im Joowon can leave too.”</p><br/><p>“The sense of loss is amazing. I’m jealous of international stars.”</p><br/><p>Im Joowon licked his lips as he looked at Son Chaeyoung.</p><br/><p>To be honest, if this was all because of Son Chaeyoung, then it was amazing. No one knew she was going to China until just before our flight, yet hundreds of fans gathered at the airport during our short flight.</p><br/><p>I thought this was only possible for popular male actors like Toon Taekyung and boy groups like Blackout who had tons of diehard fans.</p><br/><p>“Ms. Son Chaeyoung, please use the VIP passage.”</p><br/><p>As expected, it was because of her.</p><br/><p>Everyone nodded at his words. Even though her face was so flushed it seemed she was plastered with blood, Seo Eunkyo seemed to have recovered as she, once again, stuck next to Son Chaeyoung and flattered her by saying how she was different and whatnot.</p><br/><p>Just then, the staff said,</p><br/><p>“And Ms. Lee Songha as well!”</p><br/><p>“Pardon?”</p><br/><p>“Uh, Songha? Why?”</p><br/><p>Everyone looked surprised. I was the same and so was Lee Songha. In fact, Im Seoyoung poked her cheek while asking if they were talking about her.</p><br/><p>The staff and the airport employees nodded simultaneously.</p><br/><p>“Yes, Ms. Lee Songha.”</p><hr/><br/><p><sup>{1}</sup> Sunbae – Senior work colleague.</p>\n</div>\n<div style=\"max-width: 870px;margin: 5px auto;background: repeating-linear-gradient( 45deg, #fff6cc, #fff6cc 5px, #f3ecc7 5px, #f3ecc7 10px );\">\n<!-- Composite Start -->\n<div id=\"M562762ScriptRootC864255\">\n</div>\n<script async=\"\" src=\"https://jsc.mgid.com/m/e/media.boxnovel.org.864255.js\"></script>\n<!-- Composite End -->\n</div>\n<hr class=\"chr-end\"/>\n<div class=\"chr-nav\" id=\"chr-nav-bottom\">\n<div class=\"btn-group\">\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/top-management-chapter-121\" id=\"prev_chap\" title=\"Chapter 121\">\n<span class=\"glyphicon glyphicon-chevron-left\"></span>\n<span class=\"hidden-xs\">Prev Chapter</span>\n</a>\n<button class=\"btn btn-success chr-jump\" type=\"button\">\n<span class=\"glyphicon glyphicon-list-alt\"></span>\n</button>\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/top-management-chapter-123\" id=\"next_chap\" title=\"Chapter 123\">\n<span class=\"hidden-xs\">Next Chapter</span>\n<span class=\"glyphicon glyphicon-chevron-right\"></span>\n</a>\n</div>\n</div>\n<div class=\"text-center\">\n<button class=\"btn btn-warning\" data-chr-id=\"201357\" id=\"chr-error\" type=\"button\"><span class=\"glyphicon glyphicon-exclamation-sign\"></span> Report chapter\r\n                        </button>\n</div>\n<div class=\"bg-info text-center visible-md visible-lg box-notice\">\r\n                        Tip: You can use left, right, A and D keyboard keys to browse between chapters.\r\n                    </div>\n</div>"}