{"title": "Chapter 121", "id": 121, "volume": 2, "url": "http://boxnovel.org/top-management-chapter-121", "volume_title": "Volume 2", "body": "<h1>Chapter 121</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><header class=\"entry-header\"></header></p><div class=\"entry-content content\"><br/><p>Chapter 121: A Never-ending Cycle, Whether That’s Power Dynamics or Psychological Warfare (3)</p><br/><p>TL: emptycube / ED: Isleidir</p><hr/><br/><p>A chill blew in the reading room.</p><br/><p>Her lips crooked, Writer Jang said,</p><br/><p>“If you’re like this in front of me, I bet you grab new writers by their hair and swing them around?”</p><br/><p>“Writer Jang, that’s not it.”</p><br/><p>“If you get bigger from this, I guess you’ll bring the script after marking it with a red pen the next time we work together.”</p><br/><p>“That’s not it. I just…”</p><br/><p>“Don’t think about having your way with writers and the script and move me with your scenes. If you do, then I’ll increase your screen time even if you don’t want it. Do you understand?”</p><br/><p>“… Yes.”</p><br/><p>Seo Eunkyo made an awkward smile as she looked around. Those who looked at us with expectant gazes were now giving her the same look.</p><br/><p>“What about you, Mr. Taekyung?”</p><br/><p>Writer Jang suddenly asked. Having observed Seo Eunkyo get beat down first, Yoon Taekyung quickly made a polite smile.</p><br/><p>“Me?”</p><br/><p>“I heard you wanted to talk about the script. Tell me your requests.”</p><br/><p>“I think there was some miscommunication. There aren’t any requests, rather I wanted to tell you that the script was really great. I will act according to the script without a word.”</p><br/><p>“There’s no need to be like that or I’ll be known as a tyrant in this industry.”</p><br/><p>“That’s…”</p><br/><p>“It’s a joke.”</p><br/><p>Smiling by only curling the edges of her lips upwards, Writer Jang turned her gaze.</p><br/><p>Wherever her gaze landed, managers and cast members floundered to greet her. Since the two highest stars here had lowered their tails when faced with power, those beneath them shrunk back on their own.</p><br/><p>“We need to stay alert.”</p><br/><p>Chief Sung said after coming next to me.</p><br/><p>“Since tensions between actors and writers become so taut during shoots, it seems Writer Jang is planning on taking control from the beginning.”</p><br/><p>“Don’t worry about me. Women in their thirties and forties like me.”</p><br/><p>Im Joowon made a boyish smile. His smile brought out women’s maternal instincts. He had a scowl on his face just before due to being conscious of Yoon Taekyung, but he seemed to be in a good mood after seeing how Writer Jang treated him.</p><br/><p>“Of course, I’m not worried about Mr. Joowon.”</p><br/><p>Chief Sung said with a flattering tongue as he looked in Lee Songha and my direction.</p><br/><p>“Ms. Songha, you should be careful. I don’t think you’re skilled in the art of getting along with people.”</p><br/><p>“I can do it. Don’t worry, oppa.”</p><br/><p>I was extremely worried.</p><br/><p>Rather than being skilled at it, Lee Songha was hopeless in this art.</p><br/><p>She was fine during Cat Guardian Ghost. The relationship between the staff and the cast was extremely good, and everyone sympathized with her since she was receiving millions of hate comments thanks to her acting controversy.</p><br/><p>I didn’t have many thoughts then, but I abruptly realized that that was a heavenly place rarely seen in the drama industry.</p><br/><p>This place was situated in reality. A place with strict power dynamics and psychological warfare.</p><br/><p>“She’s coming. Smile.”</p><br/><p>Chief Sung whispered. It seemed it was our turn as Writer Jang was walking towards us. People moved back to open up a path. It was like the miracle of Moses.</p><br/><p>Chief Sung licked his lips and poked my side.</p><br/><p>“If the mood is very bad, what if we try getting friendly with Director Woo. It looked like the director had a very favorable impression of you.”</p><br/><p>“If the mood is bad, then I guess we have to.”</p><br/><p>I said while glancing at Director Woo who other actors were greeting.</p><br/><p>I would be relieved if Writer Jang was at least half as friendly as Director Woo.</p><br/><p>Didn’t she smile slightly when she saw me before?</p><br/><p>“Just trust me, Chief Jung. I’ll make her warm up to us.”</p><br/><p>Im Joowon confidently whispered to me before taking a step forward.</p><br/><p>“Writer Jang! Thank you for casting me in such a great project. From now on-“</p><br/><p>“I wasn’t the one who cast you, Mr. Joowon. That was the director’s suggestion.”</p><br/><p>Im Joowon, who had told me to trust him, instantly crumbled.</p><br/><p>“Of course, I agreed because I thought the same.”</p><br/><p>She added as she looked at Lee Songha.</p><br/><p>Lee Songha made a 90-degree bow.</p><br/><p>“Hello, Writer Jang.”</p><br/><p>“It’s been a long time. But since the press causes such a fuss about you, it feels like I’m seeing you again after meeting you yesterday.”</p><br/><p>This woman seemed determined to drive a thorn in every greeting.</p><br/><p>Did I really have to try and cling to Director Woo?</p><br/><p>The other cast members who had suffered were looking in our direction, especially Seo Eunkyo, whose eyes shined. She looked expectant, hoping that Writer Jang would embarrass Lee Songha like she did her.</p><br/><p>However, it seemed Writer Jang wasn’t interested in Lee Songha.</p><br/><p>She immediately walked elsewhere.</p><br/><p>Towards me. She approached closer.</p><br/><p>Just as I considered stepping back, she grabbed me with outstretched arms.</p><br/><p>“Writer Jang?”</p><br/><p>“Wait. Just once.”</p><br/><p>“Pardon me?”</p><br/><p>“I wanted to wait until everyone left after the reading session, but I felt urgent.”</p><br/><p>“What…”</p><br/><p>…Kind of nonsense is that?</p><br/><p>Wait for what? She felt urgent?</p><br/><p>Everyone was looking at me from behind Writer Jang’s shoulders. Everyone. Even Lee Songha stood frozen as she looked at me. Her eyes were so wide open that it felt like her eyes could pop out at any moment.</p><br/><p>Im Joowon silently asked while opening and closing his mouth.</p><br/><p>What was happening?</p><br/><p>I was very curious about this myself.</p><br/><p>“I pushed Park Dojin as the male lead.”</p><br/><p>Writer Jang whispered.</p><br/><p>“I almost crapped all over my script.”</p><br/><p>“Ah, okay.”</p><br/><p>“Uneasy, I looked at my fortune, and apparently, I’m currently caught in three years of misfortune. That’s why I wanted to receive some luck from you. It could drive away bad luck.”</p><br/><p>It was not enough that the Neptune girls treated me like a talisman, now I could drive away bad luck?</p><br/><p>Just as I thought this, hairy arms stretched out behind me.</p><br/><p>“I’m also caught in three years of misfortune.”</p><br/><p>Damn it. Director Woo whispered as he hugged me from behind.</p><br/><p>“Director Woo, you already did it once, why are you doing it again?”</p><br/><p>“There are a lot of eyes watching. As a man, I’m fine, but isn’t it a bit weird if a man and woman are hugging each other like this?”</p><br/><p>“What do you mean ‘man and woman’? He’s my nephew’s age. Go away. I’ll receive your bad luck.”</p><br/><p>“I’m the one directing so let’s drive away bad luck together.”</p><br/><p>Yeah, okay. This was all fine and well.</p><br/><p>But could they not whisper next to my ear? I felt like I would die from chills.</p><br/><p>“Writer Jang, Director Woo, could you let go of me first…”</p><br/><p>I raised my arms to get out of being the patty wedged between two hamburger buns.</p><br/><p>Then I stopped after meeting Chief Sung’s gaze.</p><br/><p>He was smiling with narrowed eyes. His smile contained his hopes that the Royal Family shoots might become very comfortable.</p><br/><p>Beside me, Lee Kwanwoo was staring at me with his mouth agape. It was my first time receiving such a gaze full of respect since becoming his superior.</p><br/><p>Also, there were people muttering to each other with expressions that read, ‘What kind of relationship do they have to hug each other like that?’ ‘It looks like he’s not only close with the director but with the writer as well,’ and ‘Should I have introduced myself and gotten friendly with him earlier?’</p><br/><p>Seo Eunkyo had a furious expression.</p><br/><p>Seeing this, I brought my arms back down. Well, what was wrong with driving away bad luck or being a hamburger patty if it was beneficial to me.</p><br/><p>Without hesitation, I gave up my body for the future.</p><br/><p>***</p><br/><p>“This is Ms. Lee Songha who is playing the role of the top star Lee Sohee.”</p><br/><p>“Hello, please take care of me.”</p><br/><p>Lee Songha got up from her chair and greeted them when the director introduced her. People clapped with smiles on their faces. While they looked amiable at a glance, whispers here and there were quite far from being amiable.</p><br/><p>“Even Seo Eunkyo is clapping. Even though she tried to bring Lee Songha down a notch before.”</p><br/><p>“What can she do when the director and writer are looking at her?”</p><br/><p>“I heard Seo Eunkyo holds onto grudges. I bet she’ll pick on Lee Songha when the director and writer are gone.”</p><br/><p>“But it looked like Jung Sunwoo was really close with the director and writer? Wouldn’t that concern her enough to not act out?”</p><br/><p>“They probably won’t intervene unless it impacts the shoot. This is something settled between actors.”</p><br/><p>The actors whispered to each other. This was the same for the managers at the back.</p><br/><p>“What kind of relationship does Jung Sunwoo have with the director and writer? Did he know them before?”</p><br/><p>“His connections are gold. How great, damn it.”</p><br/><p>“The director and writer won’t pay special attention to W&amp;U actors because of their friendship, right? Like giving them all the good lines, shooting another take, or even providing them with another reflector?”</p><br/><p>“Would Yoon Taekyung and Seo Eunkyo’s companies stay quiet if their actors are discriminated against?”</p><br/><p>The managers looked in one direction.</p><br/><p>It looked like Yoon Taekyung and Seo Eunkyo’s managers were having the same concerns as they were discussing with each other while glancing at people from W&amp;U.</p><br/><p>The whispers continued even after the reading session began. The actors clapped when Yoon Taekyung and Im Joowon said their lines and admired with wide eyes when it was Seo Eunkyo’s turn.</p><br/><p>“Wow, amazing. She has the ability to boast. She really seems like a lady from a rich family.”</p><br/><p>“She’s just acting like she is in real life. Apparently, her family is very well off.”</p><br/><p>“But I bet Lee Songha is probably lacking in terms of acting compared to her?”</p><br/><p>Someone began to compare the two. The number of whispers increased.</p><br/><p>“Why? I saw her previous drama, and she seemed good.”</p><br/><p>“She’s only done one project. It could be that she was lucky. It might be the best acting or project of her life. It’s not like it’s uncommon to see actors fail after being successful in one project.”</p><br/><p>“On top of that, it looks like it’ll be difficult to adjust to her role this time.”</p><br/><p>Lee Songha’s role was a Korean star at the peak of her popularity. She was a top star famous in her industry for doing whatever she wanted, and her initials were brought up in editorial tabloids because she caused frequent incidents.</p><br/><p>It would be difficult to express such a character in a charming or appealing way.</p><br/><p>As soon as it became Lee Songha’s turn, their gazes openly landed on her.</p><br/><p>There were some who were purely interested in her acting abilities, but there were many who were jealous about how she became famous through one drama and now took a lead role. They seemed to hope that Lee Songha would mess up her lines with terrible acting.</p><br/><p>Amidst their attention, Lee Songha finally began to read her line.</p><br/><p>Everyone became silent.</p><br/><p>People who were curious, expectant people, and even Seo Eunkyo.</p><br/><p>“Ms. Eunkyo, she might not be good with romance. That’s difficult without experience.”</p><br/><p>An actress sitting next to Seo Eunkyo humored.</p><br/><p>A few added,</p><br/><p>“That’s right. As a young girl, she’s probably only had childish relationships. This is an argent one-sided love. She needs to play a top star who used to do whatever she wanted before crumbling in front of love, would she even know those emotions? No matter how much she analyzed her role, wouldn’t she be licking the surface?”</p><br/><p>“That’s right. On top of that, would she have even experienced a one-sided love with a face like that?”</p><br/><p>***</p><br/><p>A ritual was held in the basement studio immediately after the reading session.</p><br/><p>A pig head was placed on the ritual table. Actors and staff members took their turn to bow in front of the smiling pig head, praying to the gods of TV ratings and success.</p><br/><p>I was watching Lee Songha slide a money envelope in the pig’s mouth when Writer Jang approached me.</p><br/><p>“I definitely plan on repaying you, Mr. Jung Sunwoo. But this is separate from Lee Songha’s issue. You remember what I said to Ms. Seo Eunkyo, correct? That their scenes will increase depending on how well actors suit their roles.”</p><br/><p>“Yes, I do.”</p><br/><p>“I’m serious about that since that’s how the project will succeed. What I’m saying is, if Ms. Seo Eunkyo is better than Ms. Lee Songha, then I will give her more screen time without a doubt.”</p><br/><p>“… Do you perhaps not like Songha’s acting?”</p><br/><p>The reading session was a success though.</p><br/><p>Yoon Taekyung, Seo Eunkyo, and Im Joowon. Amidst these talented lead actors, Lee Songha shined the brightest in my eyes. Other people looked like there was nothing bad to say about her acting, and Director Woo liked her acting as well.</p><br/><p>Writer Jang looked like she liked it too.</p><br/><p>“No, her acting was good. It seemed she worked hard to analyze the script as well.”</p><br/><p>“Yes, she kept working on it ever since she received the script.”</p><br/><p>“She completely adjusted to the script. However.”</p><br/><p>Writer Jang trailed on before adding as though it was a shame,</p><br/><p>“I hope that actors would show me something beyond the script.”</p><br/><p>“Beyond the script? Like an ad lib?”</p><br/><p>“It doesn’t necessarily have to be that, just that they fly off the page.”</p><br/><p>Writer Jang rubbed her pearl necklace as she continued,</p><br/><p>“The character called Lee Sohee. I originally thought about Ms. Son Chaeyoung for that role. Everyone objected because she had such an innocent image, but in my eyes, I felt like she would suit the role very well. Pull it off really realistically.”</p><br/><p>She saw correctly.</p><br/><p>If Son Chaeyoung did it, she might have acted with everything she had.</p><br/><p>I turned my gaze to look at Lee Songha. She got a plate of food and was heading towards me before getting stopped by Director Woo. She was slightly frowning after drinking some of the sacrificial alcohol.</p><br/><p>Seeing this, I mulled over Writer Jang’s words.</p><br/><p>Maybe it was because she was being compared to Seo Eunkyo and Son Chaeyoung, but my insides felt hot.</p><br/><p>I thought about it over and over again.</p><br/><p>How could Lee Songha’s acting fly off the page?</p><br/><p>*</p><br/><p>“Your outfits, accessories, and carry-on bags are all sponsored so pay special attention to the cameras!”</p><br/><p>“Especially Lee Songha. Don’t forget to show your bracelet when you brush your hair back!”</p><br/><p>“Let’s spray you with face mist one more time so it doesn’t look like you have makeup on.”</p><br/><p>Even though it was morning, the airport was full of reporters and fans who had come out to take pictures.</p><br/><p>The Neptune girls were listening to their stylists while holding their own carry-on bags. Why was it so complicated when only a few pictures would be taken? Especially Lee Songha, almost everyone she wore was sponsored.</p><br/><p>“Oppa, oppa, this feels like we’re going on an MT<sup>{1}</sup>!”</p><br/><p>Im Seoyoung chattered on excitedly as looked around.</p><ol><li>Due to overlap with our schedule in China, there were a lot of people. All the members gathered for their first fan meeting in China, and we were accompanied by Im Joowon because Royal Family’s poster shoot and first drama shoot would be held in China.</li></ol><br/><p>Seo Jijoon was expected to arrive soon to promote Cat Guardian Ghost.</p><br/><p>Maybe that was why it felt like an MT like Im Seoyoung said.</p><br/><p>“Why isn’t Seo Jijoon here yet? Isn’t he taking the same plane as us?”</p><br/><p>“I’ll call him!”</p><br/><p>Someone brought out their phone when the fans, who were already loud, waving their hands at us, suddenly began screaming. Seo Jijoon’s popularity was incredible. Admiring this, I turned my gaze.</p><br/><p>“Huh? What’s this?”</p><br/><p>Chief Sung’s eyes widened. The other staff members were murmuring in surprise. The Neptune girls were causing even more of a fuss, especially Im Seoyoung, who excitedly said how it felt like we were going on an MT. Her face instantly soured.</p><br/><p>I also rubbed my eyes in case I was seeing things.</p><br/><p>The person walking towards us while wheeling her carry-on wasn’t Seo Jijoon.</p><br/><p>It was Son Chaeyoung.</p><hr/><br/><p><sup>{1}</sup> Membership Training (MT) – a socializing event held among Korean university students.</p>\n</div>\n<div style=\"max-width: 870px;margin: 5px auto;background: repeating-linear-gradient( 45deg, #fff6cc, #fff6cc 5px, #f3ecc7 5px, #f3ecc7 10px );\">\n<!-- Composite Start -->\n<div id=\"M562762ScriptRootC864255\">\n</div>\n<script async=\"\" src=\"https://jsc.mgid.com/m/e/media.boxnovel.org.864255.js\"></script>\n<!-- Composite End -->\n</div>\n<hr class=\"chr-end\"/>\n<div class=\"chr-nav\" id=\"chr-nav-bottom\">\n<div class=\"btn-group\">\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/top-management-chapter-120\" id=\"prev_chap\" title=\"Chapter 120\">\n<span class=\"glyphicon glyphicon-chevron-left\"></span>\n<span class=\"hidden-xs\">Prev Chapter</span>\n</a>\n<button class=\"btn btn-success chr-jump\" type=\"button\">\n<span class=\"glyphicon glyphicon-list-alt\"></span>\n</button>\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/top-management-chapter-122\" id=\"next_chap\" title=\"Chapter 122\">\n<span class=\"hidden-xs\">Next Chapter</span>\n<span class=\"glyphicon glyphicon-chevron-right\"></span>\n</a>\n</div>\n</div>\n<div class=\"text-center\">\n<button class=\"btn btn-warning\" data-chr-id=\"201355\" id=\"chr-error\" type=\"button\"><span class=\"glyphicon glyphicon-exclamation-sign\"></span> Report chapter\r\n                        </button>\n</div>\n<div class=\"bg-info text-center visible-md visible-lg box-notice\">\r\n                        Tip: You can use left, right, A and D keyboard keys to browse between chapters.\r\n                    </div>\n</div>"}