{"title": "Chapter 131", "id": 131, "volume": 2, "url": "http://boxnovel.org/top-management-chapter-131", "volume_title": "Volume 2", "body": "<h1>Chapter 131</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><header class=\"entry-header\"></header></p><div class=\"entry-content content\"><br/><p>Chapter 131: Long Grudges (1)</p><br/><p>TL: emptycube / ED: Isleidir</p><br/><p>“Crazy bastards! How dare they-!”</p><br/><p>Eyes blazing, Director Park puffed his cigarette. An unpleasant smoke dispersed in the air. He looked around for an ashtray, but all he saw was the broken furniture, the aftermath of the havoc. Surging in rage again, Director Park chucked his cigarette stub away.</p><br/><p>Just then, his phone, which had tumbled underneath the sofa, began to vibrate. Seeing the caller, Director Park’s expression distorted.</p><br/><p>“Yes, what is-“</p><br/><p>-I got a call from Mr. Sunwoo. I heard you decided to break Nam Joyoon’s contract!</p><br/><p>Pan Production’s CEO, Kim Pansuk, shouted.</p><br/><p>“Ah, damn it. After causing trouble here, he tattled to you?”</p><br/><p>-Director Park, you eventually-!</p><br/><p>“Damn it. I tried to keep Nam Joyoon since you said we could never cut him from the film, but they were the ones who kicked this film away and left! I’m the one who’s pissed!”</p><br/><p>-Mr. Sunwoo isn’t someone who would act like that. Just how badly did you treat Nam Joyoon for-! How can I see Mr. Sunwoo’s face in the future?!</p><br/><p>Director Park’s lips twisted.</p><br/><p>-I’ll try talking with Mr. Sunwoo again, so you-!</p><br/><p>“Ah, geez, you’re going to yell my ears off. Stop interfering.”</p><br/><p>-… What did you say?</p><br/><p>“Isn’t what happens on set the director’s jurisdiction? I endured it all this time because you let me produce my film just from looking at my scenario when I was down in the dumps, but you’re going too far. This is a ten billion won movie! A ten billion!”</p><br/><p>CEO Kim Pansuk’s voice cut off.</p><br/><p>A heavy sigh broke the silence. Kim Pansuk said in a persuading tone.</p><br/><p>-Director Park, you’re making a big mistake right now. You’re blinded by the ten billion won. If you keep going like this, the mood on set will be a mess and your scenario will in tatters in the distributor’s hands!</p><br/><p>“Are you wary of the Ace Distribution Company?”</p><br/><p>-What?</p><br/><p>“Since they introduced me to big investors and the budget increased a ton, are you worried that Pan Production won’t get as big of a cut?”</p><br/><p>CEO Kim Pansuk’s breaths became rough at Director Park’s mocking words.</p><br/><p>-… They say you can see the deep into the water but you can’t fathom a person’s heart. I’m taking my investment out and let go so go find another production company!</p><br/><p>“Do that then. The loss of a few billion won doesn’t even tickle me now.”</p><br/><p>Crazy bastard.</p><br/><p>Holding those two words back, CEO Kim Pansuk hung up.</p><br/><p>The trailer became quiet once more. Director Park slumped into the sofa and rubbed his cut lower lip. He held another cigarette in his mouth. After inhaling a couple times, Director Park called someone.</p><br/><p>“It’s me, team leader. About what we talked about before. About Nam Joyoon.”</p><br/><p>-Ah, that. How did it go?</p><br/><p>The voice on the other side nonchalantly asked.</p><br/><p>“That bastard decided to get out of the project completely. Once we reduced his role and showed him who’s boss on set, he couldn’t endure it and scrammed.”</p><br/><p>Director Park tapped his cigarette ash without care and perked his ears. He didn’t hear a reaction, but the slow breathing sound that sounded out had traces of satisfaction.</p><br/><p>-Really? I thought he was the type who wouldn’t give up since he was doing independent films for a long time.</p><br/><p>“Well, he’s good at acting so if he did well, he might have shined eventually, but his temper is trash. That bastard is never going to be successful. You not signing him was a great decision.”</p><br/><p>After shamelessly flattering him for a while, Director Park added,</p><br/><p>“Chief Jung Sunwoo came over and the two of them wrecked havoc before leaving, That man’s a crazy one too.”</p><br/><p>-… Really? That must have been quite a sight.</p><br/><p>A low laughter rang from the other side.</p><br/><p>Just as Director Park opened his mouth to say something-</p><br/><p>“Director! Someone came to see you!”</p><br/><p>The assistant director knocked on the trailer door.</p><br/><p>Director Park pulled his phone back and asked,</p><br/><p>“Who is it this time?”</p><br/><p>“Apparently, he’s a reporter? He wanted to see the film set and interview you!”</p><br/><p>Hearing it was a reporter, Director Park’s eyes bulged.</p><br/><p>“Tell him I’ll be there in a sec!”</p><br/><p>Shouting that, Director Park took out his phone away and went straight to the point.</p><br/><p>“So, umm, team leader, now that the troublesome problem has been settled, if this project is a hit, I am planning on a large-scale blockbuster for my next project. I already have a scenario. If I could cast a top star like Mr. Seo Jijoon or Ms. Son Chaeyoung…”</p><br/><p>-Let’s see the scenario then.</p><br/><p>“Thank you!”</p><br/><p>Director Park bowed to the air.</p><br/><p>After hanging up, he hummed as he stood in front of the mirror on the wall. His brightly smiling face was reflected on the shattered mirror. He straightened his back and tidied his tangled hair.</p><br/><p>The door to his trailer shook again.</p><br/><p>“Director! Director! Please hurry up and come out!”</p><br/><p>“As usual, you’re always lacking… I’m coming out!”</p><br/><p>Director Park swung open his trailer door.</p><br/><p>He saw three reporters carrying laptop bags and cameras behind the assistant director.</p><br/><p>“I’m from Entertainment Movie, are you the director?”</p><br/><p>“That’s correct. If you let us know ahead of time, we could have prepa-“</p><br/><p>“I’m sorry for coming suddenly, but would an interview be okay?”</p><br/><p>“Of course, of course. If it’s going to promote my project, of course, I have to.”</p><br/><p>Director Park replied with a smile when questions began pouring in.</p><br/><p>“What is your relationship with W&amp;U’s Mr. Jung Sunwoo?”</p><br/><p>“Pardon? Who?”</p><br/><p>“Did Mr. Jung Sunwoo contact you first after seeing your scenario?”</p><br/><p>“Pardon?”</p><br/><p>“Who is the actor in Mr. Jung Sunwoo’s care? I heard he’s an unknown rookie, could we hold a joint interview with him as well?”</p><br/><p>“Wait, what?”</p><br/><p>Dumfounded, Director Park stumbled backward. Beside him, the assistant director was blinking with the same expression. The film crew and extras began to gather one by one.</p><br/><p>The reporters stuck to Director Park.</p><br/><p>“Director, please give us your comment!”</p><br/><p>“People all around call Mr. Jung Sunwoo Midas’s Hand, and the projects he chooses garner significant interest because of him. Everyone working on the movie must be really grateful to Mr. Jung Sunwoo, how do you feel?”</p><br/><p>“Would a joint interview with Mr. Jung Sunwoo be difficult?”</p><br/><p>“Director!”</p><br/><p>Director Park flinched in surprise. The phone in his hand was vibrating.</p><br/><p>The caller was Ace Distribution Company.</p><br/><p>*</p><br/><p>A sleek, foreign car rolled into the parking lot.</p><br/><p>Director Park swallowed his saliva. Two men in suits got out of the car. They were the Film Business General Manager, who made his film a ten-billion won project, and the marketing team leader.</p><br/><p>The general manager approached him with a broad smile.</p><br/><p>“Director Park, why didn’t you let us in on such important news?”</p><br/><p>“That’s… General manager.”</p><br/><p>“If you had such a good asset like him, you should have immediately told the marketing team. Don’t you know how much Royal Family benefited from using Mr. Jung Sunwoo? Team Leader Lee, we can get as much as them, right?”</p><br/><p>“Of course, in fact, the timing is better for us.”</p><br/><p>The marketing team leader laughed while waving his tablet.</p><br/><p>“Since Cat Guardian Ghost and Lee Songha became huge hits in China, there’s a ton of attention on Chief Jung Sunwoo for bringing someone to international stardom. On top of that, our associates are all in China so reporters are in a frenzy. Whatever we say now will be trending.”</p><br/><p>“Really?”</p><br/><p>“I gave some comments to reporters, and their reactions were very heated.”</p><br/><p>“I bet the investors must be enticed as well?”</p><br/><p>“Of course. They are already nibbling the bait.”</p><br/><p>“Good, good. Director Park!”</p><br/><p>“Yes, general manager. But, umm…”</p><br/><p>“Although you are busy filming, please cooperate with us. If we are able to promote properly and save on marketing costs from the beginning, all of it will go to the production budget. Team Leader Lee, what did you say you needed?”</p><br/><p>“First, we need to hold an interview with Chief Jung Sunwoo and the director.”</p><br/><p>“You said Chief Jung Sunwoo did interviews for Royal Family, right? Ask him about it. He gets to promote his unknown rookie as well. Since it’s a win-win situation for all parties, why would he decline? Let’s work on this later. Director Park, there is no problem with doing an interview, right?”</p><br/><p>“There is a little…”</p><br/><p>The general manager stared at Director Park.</p><br/><p>Director Park smiled awkwardly as he said,</p><br/><p>“… Problem.”</p><br/><p>The untouched coffee had become cold.</p><br/><p>Having explained what had occurred a few hours prior, Director Park examined the faces of those in front of him. The general manager and team leader were whispering to each other with serious expressions for a while now. Comforting his parched throat, Director Park gulped down his cold coffee.</p><br/><p>“Bring him back.”</p><br/><p>Director Park spat his coffee at the sudden words.</p><br/><p>“Pa-pardon?”</p><br/><p>“Mr. Nam Joyoon, bring him back at all costs. Whether we double his contract or give him a bigger role, spare no cost in comforting Mr. Nam Joyoon and Mr. Jung Sunwoo and get them to do the movie again.”</p><br/><p>The team leader said. His voice and expression were incomparably serious.</p><br/><p>Taken aback, Director Park hesitated in his seat.</p><br/><p>“But, do we really hav-! Did Ace want to take Nam Joyoon out-!”</p><br/><p>“That was before this situation broke out. Do you know how many articles about this are being published? If you don’t bring Mr. Nam Joyoon back, things might take an extreme turn for the worse.”</p><br/><p>“Can’t we just explain to the press? That there was misinformation-!”</p><br/><p>“When they are publishing articles about Midas’s Hand’s choice and stuff, do you think we’ll be able to handle to aftermath if we tell them it’s not? Above all, it’s not like Mr. Nam Joyoon left on good terms.”</p><br/><p>The team leader frowned.</p><br/><p>“If Chief Jung Sunwoo does something crazy like saying he pulled out because he thought this movie would flop, the press will have a field day with that. Then do you think the investors will sit still?”</p><br/><p>“No, Midas’s Hand and all that, that’s all because he’s lucky. Who really believes that? We all know that the reporters are joking when they say that. Don’t tell me that investors will-“</p><br/><p>“Director Park.”</p><br/><p>The general manager cut in with a frown.</p><br/><p>“To people who invested tens of billions of won, this isn’t a joke.”</p><br/><p>“That’s-!”</p><br/><p>“Mr. Nam Joyoon and Mr. Jung Sunwoo. Bring them back no matter what. If you can’t do it, ask CEO Kim Pansuk of Pan Production. Since they worked on Cat Guardian Ghost together, they should be quite close.”</p><br/><p>Director Park’s complexion became gloomy.</p><br/><p>The general manager issued an ultimatum.</p><br/><p>“Move quickly. If things don’t work out and the investors pull out, we will have no choice but to take our hands off this project as well.”</p><br/><p>***</p><br/><p>“The weather’s good.”</p><br/><p>I said, looking at the blue sky out the window.</p><br/><p>Nam Joyoon stared at me. His jaw was locked for a while now.</p><br/><p>“I keep getting calls. The director, assistant director…”</p><br/><p>“Don’t answer them.”</p><br/><p>“I already received more than 40 texts…”</p><br/><p>“Don’t look at them.”</p><br/><p>“I think the incident has become too big of a deal. Same with the reporters.”</p><br/><p>“Of course, it should when I worked so hard to fan the flames.”</p><br/><p>I said while looking down at my vibrating phone.</p><br/><p>Nam Joyoon’s phone wasn’t the only one going crazy. My phone was too. In fact, I was even contacted by people in China, saying things like ‘You said you were going to quietly take care of business and come back, but how is this quiet?’ or ‘Why do you start up a storm wherever you go?’</p><br/><p>Though missed calls and texts were piling up like crazy, I let it be.</p><br/><p>I only made a couple important calls.</p><br/><p>I took out two cans I bought from the convenience store and handed one to Nam Joyoon.</p><br/><p>“Just relax and wait while drinking soda.”</p><br/><p>“Is it okay to just stay like this?”</p><br/><p>“The reporters are in a frenzy so doing nothing is actually better for now.”</p><br/><p>“… I don’t know what you’re thinking.”</p><br/><p>Nam Joyoon let out a sigh. Then he rested his head on the headrest and opened the can. I lightly clinked my can with his and said,</p><br/><p>“I’m thinking about how far I should go.”</p><br/><p>“Sorry?”</p><br/><p>A cloud slowly rolled in the blue sky.</p><br/><p>A mild early summer breeze blew in through the half-opened window.</p><br/><p>“Should I stop at a good place or go all the way?”</p><br/><p>I mumbled, closing my eyes.</p><br/><p>“But, you know.”</p><br/><p>“Yes?”</p><br/><p>“I came to know this once I entered this industry, but it seems I’m the type to hold grudges.”</p><br/><p>I lazily opened one eye and saw Nam Joyoon’s dumbfounded face.</p><br/><p>The corners of my lips unconsciously rose.</p><br/><p>“I keep wanting to go all the way.”</p><br/><p>***</p><br/><p>“Director, Nam Joyoon, this guy, isn’t answering his phone? Wh-what do we do?”</p><br/><p>“What do you mean what do we do? Keep calling him!”</p><br/><p>Director Park and the assistant director’s urgent voices rang out.</p><br/><p>Their expressions were more of a mess than the trailer.</p><br/><p>“Seeing as he isn’t answering even when I use a different phone, it looks like this bastard went dark! Chief Jung Sunwoo isn’t answering either!”</p><br/><p>“Did you send him a message? About talking in person? You brought up his contract money as well, right?”</p><br/><p>“Of course, I did all of that! He ignored all of it!”</p><br/><p>“Motherfucker, fuck! Damn it! The news had to break out at a time like this!”</p><br/><p>Director Park swore.</p><br/><p>Pressing his phone on his ear, the assistant director asked,</p><br/><p>“What do we do if Nam Joyoon doesn’t come back? Director, won’t our film get canceled?”</p><br/><p>“Don’t jinx it!”</p><br/><p>Director Park rubbed his anxious face. Then he said,</p><br/><p>“If we lower our heads first by saying him we’ll revert his role back and forget what happened in the trailer, they’ll follow suit and won’t take it too far.”</p><br/><p>“Wi-will they?”</p><br/><p>“Jung Sunwoo, that bastard. He has no choice if he thinks about Nam Joyoon’s acting career. It’s a significant role in a ten-billion won movie. If he doesn’t come back, where will Nam Joyoon go? Will there be a director that’ll give Nam Joyoon better conditions than me?!”</p><br/><p>***</p><br/><p>Hanging up, I got back in the minivan.</p><br/><p>“Should we go now?”</p><br/><p>Nam Joyoon, who was looking at the sunset with a complicated expression, turned his head.</p><br/><p>“Where…?”</p><br/><p>“It’s almost time.”</p><br/><p>“Time?”</p><br/><p>“I told you I came because of a meeting. I’ve been mediating a movie on top of Royal Family for Songha. A 34-billion-won blockbuster. They’ve been dragging it on for a while, but now that her popularity has surged as an international star, I think we’ll sign soon.”</p><br/><p>“Ah, then I’ll get off here.”</p><br/><p>I stopped Nam Joyoon just as he grabbed the handle.</p><br/><p>“Come with me.”</p><br/><p>“Sorry?”</p><br/><p>Starting the minivan, I said,</p><br/><p>“Instead of a 10-billion-won film, I’m going to try and get you a 34-billion-won one.”</p><br/><p>{TL/N: We’re seeing Jung Sunwoo take action! <img alt=\"😮\" class=\"emoji\" draggable=\"false\" src=\"https://s.w.org/images/core/emoji/12.0.0-1/svg/1f62e.svg\"/> }</p>\n</div>\n<div style=\"max-width: 870px;margin: 5px auto;background: repeating-linear-gradient( 45deg, #fff6cc, #fff6cc 5px, #f3ecc7 5px, #f3ecc7 10px );\">\n<!-- Composite Start -->\n<div id=\"M562762ScriptRootC864255\">\n</div>\n<script async=\"\" src=\"https://jsc.mgid.com/m/e/media.boxnovel.org.864255.js\"></script>\n<!-- Composite End -->\n</div>\n<hr class=\"chr-end\"/>\n<div class=\"chr-nav\" id=\"chr-nav-bottom\">\n<div class=\"btn-group\">\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/top-management-chapter-130\" id=\"prev_chap\" title=\"Chapter 130\">\n<span class=\"glyphicon glyphicon-chevron-left\"></span>\n<span class=\"hidden-xs\">Prev Chapter</span>\n</a>\n<button class=\"btn btn-success chr-jump\" type=\"button\">\n<span class=\"glyphicon glyphicon-list-alt\"></span>\n</button>\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/top-management-chapter-132\" id=\"next_chap\" title=\"Chapter 132\">\n<span class=\"hidden-xs\">Next Chapter</span>\n<span class=\"glyphicon glyphicon-chevron-right\"></span>\n</a>\n</div>\n</div>\n<div class=\"text-center\">\n<button class=\"btn btn-warning\" data-chr-id=\"201374\" id=\"chr-error\" type=\"button\"><span class=\"glyphicon glyphicon-exclamation-sign\"></span> Report chapter\r\n                        </button>\n</div>\n<div class=\"bg-info text-center visible-md visible-lg box-notice\">\r\n                        Tip: You can use left, right, A and D keyboard keys to browse between chapters.\r\n                    </div>\n</div>"}