{"title": "Chapter 137", "id": 137, "volume": 2, "url": "http://boxnovel.org/top-management-chapter-137", "volume_title": "Volume 2", "body": "<h1>Chapter 137</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><header class=\"entry-header\"></header></p><div class=\"entry-content content\"><br/><p>Chapter 137: Chief Jung, Your Actors are a bit (2)</p><br/><p>TL: emptycube / ED: Isleidir</p><br/><p>As soon as the cameras began rolling, a tense air hung in the film set.</p><br/><p>Stunt staff got in position on the ground and on the crane. The jib camera was rolling in the air, and a cart carrying a camera rushed down the rails. And Lee Songha, she stood on top of the a/c unit hanging outside the apartment.</p><br/><p>Her waist and thighs were supported by wires.</p><br/><p>“Is she about to climb up the building?”</p><br/><p>The reporter blankly mumbled.</p><br/><p>“Won’t a stunt person take her place after she just acts as if she will?”</p><br/><p>“Or will they just take closeup shots now and film the rest on another set?”</p><br/><p>While the Weekly Entertainment staff were discussing, Lee Songha bent her knees. Then she kicked off the a/c unit and jumped up. They gulped. At the same time, her small hands gripped the rusty banister on the second floor. She then began to steadily climb the building.</p><br/><p>To a higher banister, to a higher a/c unit.</p><br/><p>Extras, dressed up as zombies, flailed their hands through each window. Lee Songha narrowly avoided and slowly yet surely made her way up.</p><br/><p>“So that’s why they set it up so that she wanted to be a gymnast. To film scenes like this.”</p><br/><p>“It doesn’t even seem like she’s being pulled up by the wires either. She really is climbing her way up.”</p><br/><p>“What do you think she wore underneath her skirt?”</p><br/><p>The producer smacked the back of the production assistant’s head repeatedly.</p><br/><p>The reporter admired the scene as he said,</p><br/><p>“But doesn’t it seem like she really learned gymnastics? Like look at her actions.”</p><br/><p>“She did learn it.”</p><br/><p>A staff member who wore his baseball cap backwards suddenly joined in.</p><br/><p>He was the staff member Chief Jung Sunwoo asked to comment on Lee Songha. The Weekly Entertainment staff quickly picked up their camera and handed him a wireless mic. The staff coughed and continued,</p><br/><p>“She worked hard to learn it because she wanted to do her own stunts. She went to a gymnastics coach to learn too. And parkour and climbing? The one where you climb inside a building. Apparently, she learned those too.”</p><br/><p>“All of them?”</p><br/><p>“While alternating between filming her drama on top of that. I heard she went back and forth between China and Korea during weekends. I saw her schedule, and it was incredible. Chief Jung, who balanced that schedule, is hardcore, and Lee Songha, who actually handled it all, is even more incredib-“</p><br/><p>“Oh, oh, oh!”</p><br/><p>The production assistant leaped up and down.</p><br/><p>“Isn’t that dangerous?”</p><br/><p>The staff member hastily turned around. Lee Songha lost her grip on an a/c unit while trying to avoid a zombie’s hand. Her slender body crashed onto the banister below. Then she powerlessly fell into the veranda.</p><br/><p>“Th-that!”</p><br/><p>“It’s an act.”</p><br/><p>After saying this, the staff member laughed.</p><br/><p>“See how the camera is still following her movements? It’s all an act.”</p><br/><p>The Weekly Entertainment staff quickly looked around. The jib camera was hovering over the veranda Lee Songha fell in.</p><br/><p>“The action looks incredibly real, right? We were all surprised during the rehearsal. We thought she would be seriously injured.”</p><br/><p>The amazed staff gestured to them.</p><br/><p>“Come over here.”</p><br/><p>He led them to monitors Director Choi Sungwon and other cast members were gathered in front of. The Weekly Entertainment crew cautiously and quietly stood behind them. The staff member whispered,</p><br/><p>“You see the monitor showing the one-shot, right? Look at that.”</p><br/><p>Their gazes focused on it.</p><br/><p>The scene of Lee Songha getting back up and climbing again was clearly reflected on the screen. At first, it looked like she was barely making her way up, but her actions soon looked visibly lighter. There was no hesitation in her steps.</p><br/><p>Staring at the screen, the camera director blinked.</p><br/><p>“She’s trembling?”</p><br/><p>Lee Songha’s shoulders, arms, and even her fingers were trembling.</p><br/><p>“You’re right. Is that also her acting?”</p><br/><p>“I think it’s half-and-half. Even if there are wires and mats, how scary do you think it is?”</p><br/><p>“Her chin is trembling too. Is she crying?”</p><br/><p>They stopped speaking at some point.</p><br/><p>The camera, which tilted up from her trembling shoulders, captured her face. She wasn’t crying. Lee Songha was smiling. A face messily mixed with fear and euphoria.</p><br/><p>As though she couldn’t contain how happy she was climbing up a wall.</p><br/><p>“Good…”</p><br/><p>Director Choi Sungwon had a pleased smile as his gaze focused on the screen.</p><br/><p>Even the other actors behind him cried out.</p><br/><p>“My god. Look at her expression. How can she express the feeling of being suppressed finally breaking free so well? It’s incredible.”</p><br/><p>“Did she experience a lot even though she’s young? Unless she has family issues like Lee Yeonwoo, there’s no way she can express that feeling so clearly.”</p><br/><p>“Didn’t she do an interview with a smile just now? How can she get into her role so quickly? Does she have a switch?”</p><br/><p>“Should I tell you something more amazing? Before we started filming, she was mumbling something with a serious face. I thought she was memorizing her lines, but it turns out she was mumbling how she wants to eat ice cream.”</p><br/><p>“Oh, that girl makes this veteran anxious.”</p><br/><p>Even veteran actors commented.</p><br/><p>Director Choi Sungwon shouted, “Cut!” in satisfaction and said to the actors,</p><br/><p>“You were all great too.”</p><br/><p>“It’s no good if we are similar, director.”</p><br/><p>The actress Park Saeryung grumbled.</p><br/><p>“I’m being paid much more than her so I need to be much better than her.”</p><br/><p>“Director, my one-shot before, could we refilm it? I want to try saying my line a bit more quickly.”</p><br/><p>Lee Kihwan said while scratching his chin.</p><br/><p>Director Choi Sungwon’s eyes curved into crescent moons.</p><br/><p>“Of course you can. If an actor is dissatisfied with his scene and wants to redo it, of course, he can.”</p><br/><p>“Look at her. She’s so happy.”</p><br/><p>Park Saeryung mumbled with a dispirited look. Lee Songha was smiling happily as she dangled from the wires on the fourth floor while waving at Chief Jung Sunwoo, who was looking up from below.</p><br/><p>Seeing this, Park Saeryung suddenly said,</p><br/><p>“Director, the second villain appearing on scene 24. You said he was also Chief Jung Sunwoo’s actor, right?”</p><br/><p>The actors’ gazes gathered on Director Choi Sungwon.</p><br/><p>Even the Weekly Entertainment crew perked their ears at this new information.</p><br/><p>“That’s right.”</p><br/><p>“Is he also like her?”</p><br/><p>“I don’t know. I haven’t been able to confirm myself.”</p><br/><p>Director Choi Sungwon said as he looked at Jung Sunwoo in the distance.</p><br/><p>“I wish he was.”</p><br/><p>*</p><br/><p>“… A zombie disaster blockbuster? I can already smell its failure. Just don’t attempt to screen it in the States or it’ll be an embarrassment for the entire country. Watching American dramas would be much better than pay 10,000 won on this.”</p><br/><p>“Stop it.”</p><br/><p>His frowns deepening, SBE Film CEO waved his hand.</p><br/><p>The other employees attending the meeting looked gloomy as well. The PR Team employee shook her analysis as she said,</p><br/><p>“We expected this sort of reaction considering the genre.”</p><br/><p>“We did expect it, but it still hurts.”</p><br/><p>“There are other reactions. My analysis resulted in very polarizing opinions.”</p><br/><p>The PR Team employee began reading again.</p><br/><p>“With the trustworthy Director Choi Sungwon and a slew of trustworthy actors on board, it could be incredible. I heard that the budget was over 30 billion won, I can’t wait. Such a large-scale movie, I bet more than ten million people will go watch for sure.”</p><br/><p>“Stop, stop!”</p><br/><p>The CEO waved his hand even more intensely than before. The other employees looked so gloomy that clouds seem to form above their heads. The newest employee of the Planning Team, who was sitting at the end of the room, whispered to the employee sitting next to him.</p><br/><p>“What’s with this mood? Isn’t it good if there are good reactions? They said that they couldn’t wait.”</p><br/><p>“That’s what’s scarier.”</p><br/><p>The Planning Team employee replied with a frown.</p><br/><p>“If the audience is expecting a perfect movie, we’ve only broken even if we deliver a perfect movie. It ends up becoming an okay movie. If we want to satisfy an audience like that, we need to give them a movie beyond perfect, and that’s not easy. Also, if the movie quality is lower than perfect…”</p><br/><p>The employee trailed his words. The eyes of those who heard him became hollow.</p><br/><p>The CEO slapped the table and said,</p><br/><p>“Let’s not worry about it right now! We just need to make it a success! In… In the worst-case scenario, we will still break even. Marketing is going smoothly, and we have Director Choi Sungwon and a great cast, how could it flo…”</p><br/><p>His speech, which started confidently, slowly crumbled and finally crushed completely.</p><br/><p>“… What do we do if it flops?”</p><br/><p>“It’s a disaster. All the scenarios we are prepping will be put on a halt.”</p><br/><p>The CEO laughed dispiritedly at the project producer’s words.</p><br/><p>Just then, the project producer slowly raised his hand,</p><br/><p>“CEO, I’m sorry to tell you this at this time.”</p><br/><p>“If you’re sorry, don’t say it.”</p><br/><p>“The budget…”</p><br/><p>“Don’t bring up the budget! Don’t!”</p><br/><p>“The director said he needed a bit more. Just a little.”</p><br/><p>People groaned when they heard this.</p><br/><p>The CEO’s hands shook as he shouted,</p><br/><p>“Why isn’t the budget enough?! We’ve poured all the money in it, yet how could it not be enough?!”</p><br/><p>“It’s because of the computer graphics. Apparently, they need to hire more people for the visual effects team.”</p><br/><p>“We brought over our team working in China! Are they not enough?”</p><br/><p>“Almost half the scenes require CG. The current team has already been separated to fill positions, but we still don’t have enough. What should we do? Should I tell him that we don’t even have enough even if he kills us?”</p><br/><p>“Hey! You-!”</p><br/><p>The CEO barely managed to take deep breaths after his outburst.</p><br/><p>“… Tell him that we got it. And don’t let the fact that we talk about this slip on set! The director and cast must be feeling a ton of pressure, we can’t add to that and have it influence the project!”</p><br/><p>“Yes!”</p><br/><p>The project producer immediately replied. The glaring CEO said in a hoarse voice,</p><br/><p>“Tomorrow’s set visit with investors and foreign sales agents, the preparations are perfect, right? That’s our only avenue for more money.”</p><br/><p>“Tomorrow’s scene will be a full shot of the cast. Since it’s a large-scale, dynamic scene, it should be worth spectating. They brought on almost a hundred extras dressed up as zombies as well.”</p><br/><p>“The scale is obviously large considering how much money we’re pouring into it. They already know who’s starring in the movie as well. I wish there was something that could entrance those fellows.”</p><br/><p>The CEO rubbed his temples as he mumbled,</p><br/><p>“We don’t have that extra factor…”</p><br/><p>*</p><br/><p>“Joyoon! Nam Joyoon!”</p><br/><p>Nam Joyoon, who had just changed into his movie outfit, turned his head.</p><br/><p>Kim Hyunsup, the actor who pressed his baseball cap down on his head, gestured to him. The actors and staff who worked on the independent film were gathered around him looking at a phone. Nam Joyoon picked up his bag and went over there.</p><br/><p>“What?”</p><br/><p>“Weekly Entertainment is showing what they filmed on set.”</p><br/><p>Nam Joyoon looked at the screen. At the top was the subtitle {International Star, Lee Songha, and the set of the hot topic, ‘Alive’}. They just finished showing an exclusive interview with Lee Songha and they showed sketches of the set.</p><br/><p>The independent film cast and crew sighed at once.</p><br/><p>“The scale is amazing. The size of the blue screen is as big as a building.”</p><br/><p>“That means they are going to paste the entire background with CG. Oh damn, look at those zombies.”</p><br/><p>“That looks like fun. Even if it’s tough, working on a set like that must be worth it.”</p><br/><p>“When will I get to star in a film with those actors?”</p><br/><p>“Just think they live in a different world than us. It’s only painful for you if you’re jealous.”</p><br/><p>“What’s a different world?”</p><br/><p>The assistant director joined in.</p><br/><p>“There could be a day when we work on a set like that! No one knows the future. Even Mr. Nam Joyoon here is appearing on that film! Didn’t you say tomorrow would be your first scene? Right?”</p><br/><p>He said while placing his hand on Nam Joyoon’s shoulder. The staff and actors’ congratulatory, jealous, and even unpleasant gazes focused on him.</p><br/><p>Just then, an interview of a crew member began to play.</p><br/><p>-She worked hard to do her own stunts. She went to a gymnastics coach to learn, even parkour and climbing…</p><br/><p>“She really prepared a ton. But Mr. Joyoon, do you not have to prepare for anything?”</p><br/><p>Someone asked.</p><br/><p>The independent film director licked his lips and added,</p><br/><p>“It’s really great that you keep coming on time for shoots, but I’m a bit worried as well. This could be the opportunity that changes your life. It’s not enough to focus on that film completely, yet your time is being taken up by us-“</p><br/><p>“Maybe his role doesn’t need to prepare for anything.”</p><br/><p>A piercing voice shot out from amongst the actors.</p><br/><p>“Mr. Sunghyun. Why are you like this?”</p><br/><p>“What? If he doesn’t have a big role, then he doesn’t have much to prepare.”</p><br/><p>Lee Sunghyun shrugged before leaving. A few actors glanced at Nam Joyoon before following after Lee Sunghyun.</p><br/><p>The heated mood cooled. The remaining people examined Nam Joyoon’s expression, but there wasn’t any change. Nam Joyoon continued to watch the screen.</p><br/><p>The assistant director patted Nam Joyoon’s shoulder.</p><br/><p>“Don’t worry about him. And you said you’re playing a supporting role? Then it’s a success!”</p><br/><p>“That’s right. Just think of it as learning from the big boys. Be directed by the famous Director Choi Sungwon. There must be a ton of top stars there so have a look around. But, can you get me Park Saeryung’s autograph?”</p><br/><p>“Lee Kihwan for me! I’m a huge fan!”</p><br/><p>“If it’s okay, Lee Songha for me! My daughter sings their songs.”</p><br/><p>The set quickly became noisy again.</p><br/><p>After taking a sip from a water bottle, Nam Joyoon took out his phone. It vibrated, indicating he received a text. After checking its content, he sent his usual reply.</p><br/><p>Kim Hyunsup tilted his head behind him and asked,</p><br/><p>“What? Is it Chief Jung Sunwoo again? What is he saying this time?”</p><br/><p>“That he’ll come pick me up tomorrow before the shoot.”</p><br/><p>Nam Joyoon said, laughing silently.</p><br/><p>“That young man’s really genuine. At first, I thought he would stop after a couple of visits, but he’s been helping you out for the past few months. Seeing as he cares about you even though he has an international star like Lee Songha, he must…”</p><br/><p>Kim Hyunsup narrowed his eyes.</p><br/><p>“… Been your mom in your past life. This is parental love.”</p><br/><p>“Shut up.”</p><br/><p>“But, you know, I’m a bit worried since you’re acting like normal.”</p><br/><p>Kim Hyunsup said while scratching his neck,</p><br/><p>“Are you really preparing for your shoot properly?”</p><br/><p>*</p><br/><p>Although summer had fully arrived, the morning wind was still a bit chilly. A young man wearing varsity jacket ran into a gym.</p><br/><p>“I think a celebrity lives near here! I saw that person outside!”</p><br/><p>“Who?”</p><br/><p>“Why, that manager…!”</p><br/><p>“Jung Sunwoo?”</p><br/><p>“Uh, yeah! That person! How did you guess right away?”</p><br/><p>A few people inside the gym laughed simultaneously. A muscular employee swept a mop along the floor as he said,</p><br/><p>“His actor works out in our gym. He’s close with our manager.”</p><br/><p>“Really?”</p><br/><p>“He came by frequently for the past two months. You must have missed him because you’re new.”</p><br/><p>“Wow. An actor. I want to see him. When does he usually come?”</p><br/><p>“He comes at night when he has a shoot and comes whether it’s day or night on days he’s free so you should see him soon? Get me a towel from the cabinet behind you.”</p><br/><p>The university student approached a tall cabinet. When he opened the door, he was met with two chilling objects.</p><br/><p>They were someone’s eyes.</p><br/><p>“Euah! Fuck! What the hell?!”</p><br/><p>The university shouted as he backed away. He even tripped over his feet and fell on his butt. The people who had been flashing glances his way fell back laughing.</p><br/><p>The student pointed.</p><br/><p>“Wh-who is this person?! And what is he doing in there?!”</p><br/><p>“You said you wanted to see him.”</p><br/><p>The employee laughed so hard that he began coughing.</p><br/><p>The shocked student quickly looked back at the cabinet.</p><br/><p>The man who had been standing straight in the cabinet walked out. Although the student didn’t know how long he was in there for, his steps were wobbly. His eyes, which formed a frown as though they weren’t used to the light, still shined in a cold light.</p><br/><p>The student’s shoulders trembled without knowing as he slowly approached the employee.</p><br/><p>“Euah. That man, what was he doing inside?”</p><br/><p>“He doesn’t do anything. He just stands in there all the time.”</p><br/><p>“All the time?”</p><br/><p>“Apparently he needs to do it for his acting? There are times he’s in there overnight.”</p><br/><p>The student paled.</p><br/><p>“Is he crazy? It looks like he might be mentally ill. No, his eyes weren’t normal!”</p><br/><p>“Right?”</p><br/><p>The employee shrugged. Just then, the gym door opened, and Jung Sunwoo entered. He lightly greeted the people there and walked over to the man leaning against the cabinet.</p><br/><p>“Hyung, were you in there again?”</p><br/><p>“Just for a bit. A few minutes.”</p><br/><p>“I told you to stop doing this. There are other ways so there’s no need to keep doing something so dange-”</p><br/><p>“I won’t do it again.”</p><br/><p>The man smiled faintly at Jung Sunwoo, who clicked his tongue in worry, and said,</p><br/><p>“I think I can play my role properly now.”</p>\n</div>\n<div style=\"max-width: 870px;margin: 5px auto;background: repeating-linear-gradient( 45deg, #fff6cc, #fff6cc 5px, #f3ecc7 5px, #f3ecc7 10px );\">\n<!-- Composite Start -->\n<div id=\"M562762ScriptRootC864255\">\n</div>\n<script async=\"\" src=\"https://jsc.mgid.com/m/e/media.boxnovel.org.864255.js\"></script>\n<!-- Composite End -->\n</div>\n<hr class=\"chr-end\"/>\n<div class=\"chr-nav\" id=\"chr-nav-bottom\">\n<div class=\"btn-group\">\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/top-management-chapter-136\" id=\"prev_chap\" title=\"Chapter 136\">\n<span class=\"glyphicon glyphicon-chevron-left\"></span>\n<span class=\"hidden-xs\">Prev Chapter</span>\n</a>\n<button class=\"btn btn-success chr-jump\" type=\"button\">\n<span class=\"glyphicon glyphicon-list-alt\"></span>\n</button>\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/top-management-chapter-138\" id=\"next_chap\" title=\"Chapter 138\">\n<span class=\"hidden-xs\">Next Chapter</span>\n<span class=\"glyphicon glyphicon-chevron-right\"></span>\n</a>\n</div>\n</div>\n<div class=\"text-center\">\n<button class=\"btn btn-warning\" data-chr-id=\"201386\" id=\"chr-error\" type=\"button\"><span class=\"glyphicon glyphicon-exclamation-sign\"></span> Report chapter\r\n                        </button>\n</div>\n<div class=\"bg-info text-center visible-md visible-lg box-notice\">\r\n                        Tip: You can use left, right, A and D keyboard keys to browse between chapters.\r\n                    </div>\n</div>"}