{"title": "Chapter 145", "id": 145, "volume": 2, "url": "http://boxnovel.org/top-management-chapter-145", "volume_title": "Volume 2", "body": "<h1>Chapter 145</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><header class=\"entry-header\"></header></p><div class=\"entry-content content\"><br/><p>Chapter 145: Spring, the Season of Harvest (6)</p><br/><p>TL: emptycube / ED: Isleidir</p><br/><p>The change was instant.</p><br/><p>The commotion was quelled, and the fans acted quickly. It was the same whether they were about to grab each other’s collars or were spectating from a few steps away. They all gathered like sheep with awkward smiles on their faces.</p><br/><p>The writer had a flustered expression.</p><br/><p>“Just that the…”</p><br/><p>“I told you, the school bell has run.”</p><br/><p>Songha-Eating pointed to the van.</p><br/><p>The passenger seat was the first to open. A woman with long straight hair got out. Her sunglasses covered half her face, and her thick, black parka covered her from her chin to her ankles, resembling a penguin. Having discovered Lee Songha with a single glance, people began swarming towards her.</p><br/><p>Neptune’s fans hesitated before deciding against it.</p><br/><p>The security guards and staff made their way through the crowd and led Lee Songha to the waiting room.</p><br/><p>The Neptune fans remained nailed in place even as she disappeared.</p><br/><p>It was all because of Chief Jung Sunwoo who was coming over after getting out of the minivan.</p><br/><p>The writer tilted her head.</p><br/><p>“Other fandoms need the celebrity to personally come out and ask them to quiet down to be this calm, but you all are different? I guess Chief Jung Sunwoo is really scary?”</p><br/><p>“That’s not it. There’s a bit of a reason.”</p><br/><p>Songha-Eating answered in an almost profound way. The writer regretfully left after hearing her name being shouted through her headset. A young fan, seemingly only entered high school recently, came over and asked,</p><br/><p>“Unni, how is the chief? It hasn’t been long since I’ve started fangirling so I’m out of the loop.”</p><br/><p>“That’s… Chief Jung Sunwoo… is like a protected species.”</p><br/><p>“A protected species?”</p><br/><p>A Triton member who wore horn-rimmed glasses replied to the puzzled fan,</p><br/><p>“Think about the things Chief Jung Sunwoo accomplished after becoming Neptune’s manager. The entire fandom will flip out if he decides to leave. That’s why the fans, whether they are the entire group’s or a single member’s, all listen to him.”</p><br/><p>“They do bring him up in their debates on occasion though…”</p><br/><p>Before Songha-Eating could finish, one of the fans that caused the commotion said,</p><br/><p>“But, to be honest, doesn’t Chief Jung Sunwoo favor Lee Songha too much?”</p><br/><p>“If he’s Neptune’s manager, then he should take care of each one. It always looks like he’s her personal manager. The other members must feel discriminated against. Shouldn’t we call the W&amp;U PR Team and complai…”</p><br/><p>The fan, who poured oil to a dying fire, trailed her words. Unlike before, no one agreed with her. Instead, fierce glares zeroed in on her as though they were hunting down a common enemy.</p><br/><p>Songha-Eating said to the young fan,</p><br/><p>“People that do are treated like spies from other fandoms.”</p><br/><p>“The fans don’t touch Chief Jung. We’re even at our current balance because of him. Without him, the fandom might have split up and become a huge mess.”</p><br/><p>The fan wearing horn-rimmed glasses shook his head.</p><br/><p>Chief Jung Sunwoo arrived by that time. He looked exhausted, most likely due to his busy schedule. His already cold demeanor possessed a slight frown. He looked at the herd of fans and said,</p><br/><p>“The security guards told me that our fandom was quite noisy.”</p><br/><p>Flinching, their eyes moved quickly.</p><br/><p>Chief Jung Sunwoo smiled faintly and added,</p><br/><p>“If I keep hearing bad rumors about Neptune’s fandom, then a soft-hearted manager like me will be too worried to work.”</p><br/><p>His voice was gentle. However, the fans silently exchanged glances like they heard something more menacing than a threat.</p><br/><p>Someone quickly broke the silence.</p><br/><p>“No-no, we weren’t. There was simply a small conflict in opinion.”</p><br/><p>“No need to worry about it, chief!”</p><br/><p>Excuses erupted from the herd.</p><br/><p>“That’s good to hear.”</p><br/><p>The corners of Jung Sunwoo’s lips curved a little higher. He glanced at his wristwatch and said,</p><br/><p>“Wait a bit after the performance. Since you’ve come here to support us on this cold day, you should at least meet with the members.”</p><br/><p>The fans broke out in cheers. A few cautiously asked,</p><br/><p>“Could we also get some autographs?”</p><br/><p>“Can we take pictures?”</p><br/><p>“Chief! Will Neptune’s next album be a success?”</p><br/><p>A young voice abruptly cut in.</p><br/><p>The fans quieted down. Soon, Chief Jung Sunwoo replied,</p><br/><p>“We’ll do our best.”</p><br/><p>“Please tell us it will! No, please make it a success! Please!”</p><br/><p>“Ah, stop it!”</p><br/><p>Someone tried to stop him. However, he was outnumbered by the fans waiting in anticipation. Their gazes locked on Chief Jung Sunwoo. He had an indecipherable expression.</p><br/><p>“Stop putting pressure on him. People are going to think he’s really a fortune teller.”</p><br/><p>An athletic Triton member clicked his tongue.</p><br/><p>Someone added,</p><br/><p>“There are tons of fans who think whatever Chief Jung has a hand in will be a success.”</p><br/><p>“Apparently, someone even called W&amp;U and asked them to let Chief Jung decide the title track. It’s ridiculous.”</p><br/><p>“But, honestly… It’s not like I can’t understand how they feel.”</p><br/><p>The fan wearing horn-rimmed glasses said,</p><br/><p>“If Chief Jung is involved, we can’t help but trust him.”</p><br/><p>***</p><br/><p>Please make it a success.</p><br/><p>That was what I wanted to say.</p><br/><p>I had already been suffering with this very issue these days. Royal Family and Alive were proceeding smoothly and people congratulated me wherever I went, but the worry regarding Neptune and their next album had been growing in the corner of my mind.</p><br/><p>Will Lee Taehee’s songs be a hit? Which one would be the best out of the three? How should we proceed with our plans so that Neptune becomes more robust like dried earth after heavy rainfall?</p><br/><p>If I could just request to see the future, I would have already kowtowed.</p><br/><p>Months have gone by since I saw the future where Song Inho received an award. I almost suspected that I may have lost my ability. It could disappear as suddenly as it came.</p><br/><p>It felt like mold was spread inside me whenever I thought that.</p><br/><p>I shook my head in front of Neptune’s waiting room.</p><br/><p>I entered after knocking on the door.</p><br/><p>“… What are you doing?”</p><br/><p>My mind cleared instantly.</p><br/><p>Im Seoyoung, who was posing like a model, jumped in surprise.</p><br/><p>“W-what do you mean?”</p><br/><p>“Just now. What was that ‘I’m Im Seoyoung’ pose?”</p><br/><p>“Euaah!”</p><br/><p>Im Seoyoung fumbled to get up then used her hair, which was fashioned into what resembled bunny ears, to cover her face. Despite her efforts, I could still see her cheeks reddening.</p><br/><p>What was she doing?</p><br/><p>I looked around the waiting room, and the other members were acting normal. Lee Taehee was flopped on the sofa with earphones on like she always did before performances. Lee Songha was sleeping, using Lee Taehee’s lap as a pillow, while mumbling something.</p><br/><p>Lee Taehee greeted me when she saw me. Then she closed her eyes.</p><br/><p>Ever since I told her that I would think about it a bit longer that night she came over, she has been patiently waiting for my response.</p><br/><p>She didn’t urge me or anything.</p><br/><p>“She’s been inflicted with the ‘sunbae’ disease.”</p><br/><p>I came out of my thoughts at LJ’s words.</p><br/><p>Legs crossed, LJ was leisurely playing a game on her phone as she continued,</p><br/><p>“The girl group performing the openin…”</p><br/><p>She trailed off when she raised her head to look at me.</p><br/><p>“Has your spirit been sucked out of you for the past 2 days?”</p><br/><p>“What?”</p><br/><p>“You look haggard while her skin is glowing like she’s had some snake wine.”</p><br/><p>LJ’s gaze lingered on Lee Songha, who was sleeping without a care in the world.</p><br/><p>“Stop with your nonsense and continue what you were saying. What about the girl group?”</p><br/><p>“They are apparently coming over to greet us. They consider us as their role models or something. Hearing that, she’s been diagnosed with ‘sunbae’ disease and she’s become terminal in ten minutes.”</p><br/><p>Her tone was as rude as normal, but her reaction was different.</p><br/><p>Im Seoyoung went up next to her.</p><br/><p>“Hey, what are you going to say when they come to greet us?”</p><br/><p>“What do you mean?”</p><br/><p>“They said we’re their role models! We have to say something nice!”</p><br/><p>“Fighting.”</p><br/><p>“Hey! Don’t you remember how it was like when we were unknown?”</p><br/><p>Im Seoyoung raised her voice in the end.</p><br/><p>“Don’t you remember how sad it was to be ignored whenever we went to greet our sunbaes?! On top of that, we’re their role models!”</p><br/><p>“The role model they are referring to is 90% her.”</p><br/><p>LJ gestured to Lee Songha with her chin.</p><br/><p>“Still! You never know! The wise words we tell them might point them to a path!”</p><br/><p>“You should just find a path for your own life, you directionally-challenged dummy.”</p><br/><p>At a loss for words, Im Seoyoung simply opened and closed her mouth.</p><br/><p>I went over and patted her round shoulders.</p><br/><p>“You just need to be as friendly as usual. No need to worry about a pose or anything.”</p><br/><p>“Oppa, the thing is…”</p><br/><p>Im Seoyoung glanced behind her. Looking at each member, she lowered her head. Her ‘bunny ears’ seems to droop. In a voice so quiet I could barely hear her, she said,</p><br/><p>“Compared to them, I’m a bit…”</p><br/><p>“You are a bit?”</p><br/><p>“So, what I mean is, I’m a bit…”</p><br/><p>Just then, someone knocked on the door.</p><br/><p>Then Lee Kwanwoo came in.</p><br/><p>“Ah, chief! Pretty Girls came over because they wanted to greet Neptune before they go on standby.”</p><br/><p>Pretty Girls?</p><br/><p>The name sounded familiar.</p><br/><p>Young girls that seemed to suit school uniforms than their stage outfits entered the room. They stood in a line before bowing at a 90-degree angle.</p><br/><p>“Hello, sunbae! We are Pretty, Pretty, Pretty Girls!”</p><br/><p>Just as they seemed like they were going to continue and as their manager asked me for a handshake, my mind was snatched by something else.</p><br/><p>My vision began to fill with static.</p><br/><p>My vision flipped.</p><br/><p>I felt dizzy like I rolled on the ground a few times. I heard a staticky chant.</p><br/><p>“We are Pretty, Pretty, Pretty Girls!”</p><br/><p>It was childish yet clearly memorable.</p><br/><p>But why was I hearing this now?</p><br/><p>It has been months since I’ve seen the future, yet don’t tell me I was going to see not Neptune or Nam Joyoon’s future but the future of some girl group I had no relations with?</p><br/><p>I quickly perked my eyes and ears.</p><br/><p>I was at work. I was standing in front of the TV in the fourth-floor lounge. There was a girl group on TV.</p><br/><p>The air seemed quite warm.</p><br/><p>Because my eyes were stuck on the TV, I used my other senses to check out my clothes. Long pants and a dress shirt? It seemed quite thin. I couldn’t pinpoint what time of the year it was.</p><br/><p>“All it takes is one shot.”</p><br/><p>My eyes finally moved. Kim Hyunjo was standing next to me with his arms crossed.</p><br/><p>His face looked more sunken than normal. He was wearing jeans and a dress shirt with rolled-up sleeves.</p><br/><p>I said,</p><br/><p>“I know, right? I didn’t know they’d be this success when I first saw them earlier this year.”</p><br/><p>“They’ve taken first place for two weeks now.”</p><br/><p>First place?</p><br/><p>Was he talking about the music charts?</p><br/><p>“They’ll finally get to take off their training wheels and fly with this.”</p><br/><p>“I don’t think they’ll come down from the top ranks for a while.”</p><br/><p>“Their song is good. I bet that producer’s worth has gone up quite a bit? Pretty Girls just happened to have luck on their side. The song would have been a hit no matter who sung it.”</p><br/><p>Kim Hyunjo licked his lips in regret.</p><br/><p>“I bet it would have been even more success if Neptune sang it?”</p><br/><p>“Ummm… Chief.”</p><br/><p>I now clearly saw a man with his hand awkwardly out for a handshake.</p><br/><p>Now a little gloomier, the man slowly pulled his hand back. I quickly grabbed it.</p><br/><p>“Sorry, I was feeling a little faint just now.”</p><br/><p>“Ah, no problem. Are you okay? I heard you were busy these days. No, I read you were. From internet articles.”</p><br/><p>The man spoke incoherently as he brightened up.</p><br/><p>I glanced behind him. The Pretty Girls members were greeting Neptune.</p><br/><p>They were the same girls that were on TV in the future I saw.</p><br/><p>I turned my gaze back to the man.</p><br/><p>“Hello, I am Jung Sunwoo.”</p><br/><p>“Of course, I know who you are! You are as well-known as most celebrities. I am Chief Lee Taeshin, currently taking care of Pretty Girls. I had given you their CD two years ago. I don’t know if you remember since it’s been so long.”</p><br/><p>“Two years ago?”</p><br/><p>“Yes, in the waiting room for Knet’s music broadcast. I even remember how you wore a suit that day.”</p><br/><p>Chief Lee Taeshin said while scratching his neck. Now I remembered.</p><br/><p>It was my first day of work.</p><br/><p>“Were they wearing the aprons and school uniforms…”</p><br/><p>“That’s right! Even though their debut song was completely forgotten, people seemed to remember their outfits.”</p><br/><p>He looked at Pretty Girls and Neptune then made a hollow smile.</p><br/><p>“After their debut song was a bust, so was their mini-album and full album. There were eight members originally, but two left and now only six remain. If the digital single we’re preparing now is a flop…”</p><br/><p>“Digital single?”</p><br/><p>“Yes, we are planning it like it’s our last shot.”</p><br/><p>Opening my dry lips, I asked,</p><br/><p>“… Did you find a song?”</p>\n</div>\n<div style=\"max-width: 870px;margin: 5px auto;background: repeating-linear-gradient( 45deg, #fff6cc, #fff6cc 5px, #f3ecc7 5px, #f3ecc7 10px );\">\n<!-- Composite Start -->\n<div id=\"M562762ScriptRootC864255\">\n</div>\n<script async=\"\" src=\"https://jsc.mgid.com/m/e/media.boxnovel.org.864255.js\"></script>\n<!-- Composite End -->\n</div>\n<hr class=\"chr-end\"/>\n<div class=\"chr-nav\" id=\"chr-nav-bottom\">\n<div class=\"btn-group\">\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/top-management-chapter-144\" id=\"prev_chap\" title=\"Chapter 144\">\n<span class=\"glyphicon glyphicon-chevron-left\"></span>\n<span class=\"hidden-xs\">Prev Chapter</span>\n</a>\n<button class=\"btn btn-success chr-jump\" type=\"button\">\n<span class=\"glyphicon glyphicon-list-alt\"></span>\n</button>\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/top-management-chapter-146\" id=\"next_chap\" title=\"Chapter 146\">\n<span class=\"hidden-xs\">Next Chapter</span>\n<span class=\"glyphicon glyphicon-chevron-right\"></span>\n</a>\n</div>\n</div>\n<div class=\"text-center\">\n<button class=\"btn btn-warning\" data-chr-id=\"201402\" id=\"chr-error\" type=\"button\"><span class=\"glyphicon glyphicon-exclamation-sign\"></span> Report chapter\r\n                        </button>\n</div>\n<div class=\"bg-info text-center visible-md visible-lg box-notice\">\r\n                        Tip: You can use left, right, A and D keyboard keys to browse between chapters.\r\n                    </div>\n</div>"}