{"title": "Chapter 153", "id": 153, "volume": 2, "url": "http://boxnovel.org/top-management-chapter-153", "volume_title": "Volume 2", "body": "<h1>Chapter 153</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><header class=\"entry-header\"></header></p><div class=\"entry-content content\"><br/><p>Chapter 153: Competent or Incompetent (6)</p><br/><p>TL: emptycube / ED: Isleidir</p><br/><p>As the softly playing song came to an end, Kim Hyunjo said,</p><br/><p>“This is good too?”</p><br/><p>… That was it?</p><br/><p>“How do you like the song?”</p><br/><p>“It’s good. The melody is catchy. I bet it’ll do quite well on the charts?”</p><br/><p>This definitely wasn’t a bad reaction.</p><br/><p>But it felt lukewarm.</p><br/><p>Even if the song wasn’t good enough for him to jump and shout, “Eureka!” I had thought he would react a bit more strongly than this. Did I pick the wrong song? No, this was definitely the one Kim Hyunjo praised was a good song and said it would have been even a bigger hit if Neptune sang it…</p><br/><p>At the sudden thought, I stared at Kim Hyunjo.</p><br/><p>“Chief, you know the song that’s first on the charts right now…”</p><br/><p>“What? Rubynus’s<sup>{1}</sup> new song?”</p><br/><p>“What if Neptune sang that song?”</p><br/><p>“It would have been a bigger hit if Neptune sang it. The song’s good.”</p><br/><p>Oh my god.</p><br/><p>I rubbed my face with both hands before asking,</p><br/><p>“Then what about Pretty Girls’ new song you just heard? What if Neptune sang that?”</p><br/><p>“Obviously Neptune would do much better than Pretty Girls. The song would be more polished.”</p><br/><p>“I don’t know about that.”</p><br/><p>The Team 3 Leader, who had been lost in his thoughts, abruptly joined in.</p><br/><p>“It doesn’t fit with Neptune’s image, right? It’s too cute and girly?”</p><br/><p>“Is it?”</p><br/><p>Kim Hyunjo shrugged. Then he looked at me and asked,</p><br/><p>“But what’s with your expression? You look depressed?”</p><br/><p>Of course, I was.</p><br/><p>I was depressed that the several days I spent worrying and struggling with internal conflict and the nights I spent enduring temptation was all for naught. It was so ridiculous I laughed. Why did I believe Kim Hyunjo’s words at face value? It wasn’t like some revelation.</p><br/><p>Kim Hyunjo and the Team 3 Leader looked at me like I was crazy when I laughed while covering my face.</p><br/><p>Still, this incident wasn’t completely pointless as I would always be tempted as long as I saw the future. Since I was able to reevaluate myself through this incident, I wouldn’t waver next time. I tried to comfort myself by thinking this.</p><br/><p>Ah, I realized one thing.</p><br/><p>The future I saw were hints, not answers.</p><br/><p>*</p><br/><p>‘Create your own team.’</p><br/><p>CEO Baek Hansung’s order, which seemed like a test, echoed in my mind.</p><br/><p>First, I asked for the Team 3 Leader and Kim Hyunjo’s help to create a list of experts within W&amp;U and amongst its partners. Then I looked for team members amongst the staff who normally worked with Blackout.</p><br/><p>The most important of them was the A&amp;R Team’s producer as we needed a conductor to make an album.</p><br/><p>The person I came looking to see today was the person who created Blackout’s digital single, Producer Ferret. Of course, his real name was something else, but this man who called himself Producer Ferret was living in a dark office.</p><br/><p>“It’s not Neptune’s but some unknown group’s album, huh? Well, at least the song is decent.”</p><br/><p>Producer Ferret said while perching his chin. He was decorated in skull tattoos and rings.</p><br/><p>“I heard that you have some time now that Blackout’s done promoting their digital single.”</p><br/><p>“That’s true, but I was planning on producing some songs in New York and refresh myself…”</p><br/><p>His eyes moved quickly beyond his horn-rimmed glasses. His gaze was mixed with curiosity and light expectations. He looked like he was weighing the pros and cons of joining my project team.</p><br/><p>I also recalled all the information I gathered on him.</p><br/><p>He originally dreamed of being a singer-songwriter but made it big as a producer when that failed. He never rejects a chance to have an interview with the press and loves attention. Although he was skilled, he almost never took on unknown groups with little popularity back when he was a freelancer.</p><br/><p>He was asked to appear on multiple broadcasts because he was good-looking but was quickly fired for not being a good talker. His rumors spread amongst show writers that no one asks him to appear on their show anymore.</p><br/><p>I tied the bait to the hook.</p><br/><p>“We plan on broadcasting the album production process like a reality TV show.”</p><br/><p>“A show?”</p><br/><p>He immediately took the bait.</p><br/><p>I smiled brightly and continued,</p><br/><p>“I think you’ll look great on camera since you are the most good-looking amongst the A&amp;R Team. We want to film you producing-“</p><br/><p>“I’ll do it!”</p><br/><p>Got him.</p><br/><p>Although I got one, this was only the start. I couldn’t make an album with him alone.</p><br/><p>My list of full of experts I need to fish, but I couldn’t focus solely on this project either. I didn’t have time to rest as I tried to work through a packed day’s schedule and create my own team simultaneously.</p><br/><p>“Yes, Producer Ferret. Since you’ve worked with the vocal trainers and choreographers on that list, if you could just connect me to them, I’ll-“</p><br/><p>“Chief Jung Sunwoo!”</p><br/><p>A woman approached me with a bright smile on her face.</p><br/><p>She was a marketing employee of a makeup brand that chose Lee Songha as their spokesmodel.</p><br/><p>“The signing event is a huge success. Thank you for coming. We will reimburse your tra-“</p><br/><p>“Of course, we need to come. It’s part of the contract.”</p><br/><p>“Um, we would like to schedule a meeting regarding extending Ms. Songha’s contract.”</p><br/><p>“Let’s talk about that after the signing event.”</p><br/><p>I smiled like a true capitalist as I looked around the signing event. Lee Songha was signing autographs in front of one of their stores. Quite a bit of time had passed, yet the line only got longer until it filled the department store.</p><br/><p>There was a fuss in the store as well.</p><br/><p>“Could you give me one of Lee Songha’s lipstick? The one she wore in Royal Family episode 5?”</p><br/><p>“I’m sorry. That product is not in stock as it is sold out in all our stores. If you reserve it, you will be able to receive it next month.”</p><br/><p>“What? Next month?”</p><br/><p>“The production isn’t fast enough to keep up with the demand.”</p><br/><p>Even though they encountered an endless number of customers, the employees from the company’s headquarters were smiling broadly. The lipstick Lee Songha wore on Royal Family was sold out and played a huge part in spreading their brand.</p><br/><p>Thanks to that, Lee Songha was receiving a ton of spokesmodel proposals, so it was beneficial for us as well.</p><br/><p>Happy, I looked at Lee Songha before I jolted and raised my phone to be ear.</p><br/><p>“Ah, sorry. There was a problem here. Yes, so first the choreographer…”</p><br/><p>After finishing Lee Songha’s day schedule, I went to find Nam Joyoon before her early morning schedule.</p><br/><p>I handed him a thick envelope full of scenarios and scripts.</p><br/><p>Checking its content, Nam Joyoon licked his lips and said,</p><br/><p>“What is all…”</p><br/><p>“These are all projects sent for you. Although they are all supporting roles, some are pretty decent so let’s have a meeting once you’ve had a chance to read them all.”</p><br/><p>Nam Joyoon nodded slowly as all his attention was solely fixated on the envelope. The way he handled the scenario he took out was as careful and affectionate as how a devote believer would treat the Bible.</p><br/><p>Holding a can of beer, Kim Hyunsup, who seemed to have come over to hang out, glanced at the envelope in astonishment.</p><br/><p>“Wow, now that your name is known, scenarios just pile up in front of you. I bet you no longer have to go around to auditions. I didn’t really notice it because people didn’t recognize you on the street, but you’re living in a different world now.”</p><br/><p>“Hyung’s just started to be known in the movie industry. He needs to be more popular for the general public to call his name out in public.”</p><br/><p>Although getting his name in the real-time search rankings thanks to the articles did help, he still had a long way to go.</p><br/><p>Still, his process was great.</p><br/><p>Alive was breaking record after record as it swept through the entertainment industry, and Nam Joyoon’s popularity was steadily rising. There were quite a few people who recognized him on his last stage introduction even though it was before the screening.</p><br/><p>On top of that, there was no need to fixate on villain roles either as his image was good thanks to the story about us. It was to the point where we received proposals on filming human documentary about our story.</p><br/><p>Nam Joyoon stood in place as he read at the scenario. I placed my hand on his shoulder. He must have already been absorbed in it as his burning eyes slowly looked at me.</p><br/><p>“You’re going to have a photoshoot.”</p><br/><p>“A photoshoot?”</p><br/><p>“It’s a movie magazine. It’s an article about hotly anticipated rising stars, and we decided to have an interview and photoshoot. So you have to get skin treatment at the shop.”</p><br/><p>Nam Joyoon scratched his chin as though the word ‘photoshoot’ was unfamiliar to him.</p><br/><p>Then he suddenly frowned and gave me a worried look.</p><br/><p>“But I think you need to rest a little. You don’t look too good.”</p><br/><p>“I’ve just been so busy these days. Ah, about that, you’ll probably continue having these events from now on, and I probably won’t be able to go to all of them if there’s a scheduling conflict.”</p><br/><p>“It’s alright. Let me know the place and I’ll get there on my own.”</p><br/><p>Nam Joyoon said casually.</p><br/><p>“No way. It’s not like you have a management company for show. I’m currently looking for a good road manager who can drive and check your schedule so-“</p><br/><p>“Excuse me, Joyoon’s mother.”</p><br/><p>Kim Hyunsup called me with his hand raised.</p><br/><p>“Could I try being his road manager until you find someone? I think it’ll be fun.”</p><br/><p>“What about your shoots?”</p><br/><p>“I’m mostly doing translating work these days. I wasn’t the type to put myself life into acting from the start.”</p><br/><p>He answered with a shrug.</p><br/><p>That wasn’t a bad idea. He wanted to do it, and Nam Joyoon would feel more comfortable with a friend. I quickly made up my mind and nodded. Then I told Kim Hyunsup the location and artist of the shop Nam Joyoon would be going to.</p><br/><p>Ah, now that I thought about it, I need to discuss Pretty Girls’ concept now that the hair and makeup stylists were somewhat decided. Things proceeded smoothly as they were interested in being on the show.</p><br/><p>Going around in a frenzy was worthwhile.</p><br/><p>The project team was starting to take shape.</p><br/><p>Unlike the experts who I had to persuade, there were even some who asked to join my team.</p><br/><p>Lee Kwanwoo smiled innocently, making me think of a golden retriever.</p><br/><p>“To be honest, my dream is making an unknown celebrity shine. A drama-like story where we overcome all sorts of hardship to shine in the end.”</p><br/><p>“You’re persistent. To still dream and search for a drama-like story.”</p><br/><p>“It’s all thanks to you, chief. Working under you, it sometimes feels like a drama. Where can we find a story more dramatic than the one with you and Neptune or with you and Mr. Nam Joyoon?”</p><br/><p>That was true.</p><br/><p>“If this project succeeds, then you’ve just made another drama.”</p><br/><p>Lee Kwanwoo looked at me with eyes full of admiration.</p><br/><p>I scratched my goosebumps and answered,</p><br/><p>“Yeah, let’s work together. Be careful to not have the project affect Neptune’s schedule.”</p><br/><p>“Yes, thank you!”</p><br/><p>I should be the one thanking you. I was lacking manpower.</p><br/><p>As I patted his wide shoulder, Lee Kwanwoo walked in place with an excited face. Even though he didn’t have a tail, I could see it wagging behind him.</p><br/><p>Staying like this for a bit, Lee Kwanwoo suddenly seem to think of something as he asked,</p><br/><p>“But, chief, are you going to appear on Good Friends’ long-term project?”</p><br/><p>“Yeah, I’m going to meet them again and talk in detail.”</p><br/><p>It would be beneficial to Im Seoyoung and LJ. While I was thinking about what the production staff said about their plan of an entertainment show-web drama collaboration, Lee Kwanwoo sounded relieved.</p><br/><p>“That’s good.”</p><br/><p>“What is?”</p><br/><p>“I heard this from a stylist, but apparently, the production staff seemed a little troubled while they were waiting for your reply. That’s why Seoyoung was cautious on set.”</p><br/><p>“Seoyoung was?”</p><br/><p>I didn’t hear about this at all.</p><br/><p>“It seems she didn’t tell you because she knew you didn’t like appearing on shows.”</p><br/><p>*</p><br/><p>Lee Kwanwoo, Team Leader Park, and I were sitting in a meeting room.</p><br/><p>“What if we release an article first? Before the interest in you and Mr. Joyoon cools?”</p><br/><p>Team Leader Park suggested while twirling her fountain pen.</p><br/><p>“If you announce that you’ll be making an unknown girl group’s album and mention that it will be a reality TV show, I bet interested broadcasting and production companies will make proposals first? Cable networks will be fighting to get the show on their network since it’s such a good item.”</p><br/><p>“I think the public networks will be interested as well.”</p><br/><p>Lee Kwanwoo nodded.</p><br/><p>“The problem is that they can’t get us a good timeslot.”</p><br/><p>“No, they’ll be reorganizing their lineup for spring. There will be entertainment shows that will end, and new ones will launch. As long as they want it, they’ll be able to squeeze in a three or four-part series.”</p><br/><p>“Ah.”</p><br/><p>“If the reality TV show gets decent ratings, it’ll help boost the rating of the program that comes after it. It’ll be great if we can get on a public network, but the problem is…”</p><br/><p>Team Leader Park frowned.</p><br/><p>“Since their staff have their noses up in the air, they won’t want us meddling in their programming discussions. The producer and writer are key in a show like this, and I’m worried who they’ll assign to our project. We might end up with a different narrative than we expected.”</p><br/><p>“If that’s the case, I guess a cable network could be better.”</p><br/><p>“Still, their numbers are completely different from cable. First, let’s release the article and see who sends us proposals…”</p><br/><p>“What if we ask IBC before we release the article?”</p><br/><p>They both looked at me.</p><br/><p>“IBC?”</p><br/><p>“Seoyoung and LJ are regulars on a show there. If we show our sincerity first, then they’ll probably think about it more as well. About us or Seoyoung and LJ.”</p><br/><p>“That’s probably true.”</p><br/><p>Team Leader Park nodded.</p><br/><p>This conclusion was sent to CEO Baek Hansung through the director. In the past, he personally went and met with the entertainment head for Next K-Star in the past, but it didn’t seem like he would do anything this time. He simply replied with an ‘Okay’.</p><br/><p>It sounded like he would be watching what I do.</p><br/><p>*</p><br/><p>We were able to send our message to IBC’s entertainment head through Producer Choi of Good Friends.</p><br/><p>We quickly scheduled an appointment. I went to their office with the project proposal and information and saw Producer Choi and the chief producer, Director Hwang, waiting in a meeting room.</p><br/><p>I greeted them, but Producer Choi gave me an odd look.</p><br/><p>I quickly learned the reason. As he examined the proposal, Director Hwang suddenly asked,</p><br/><p>“I don’t think the proposal is bad. How much is W&amp;U able to sponsor?”</p><br/><p>Sponsor?</p><br/><p>“Why? Did you not think of that before you came? You should know that these idol reality TV shows are usually greenlit after the proposing company sponsors it, right?”</p><br/><p>Director Hwang clicked his tongue before slyly saying,</p><br/><p>“Or if you’re not going to sponsor anything, how about we air this at a good timeslot if W&amp;U helps with Good Friend’s long-term project? Neptune’s Im Seoyoung and LJ are also part of your company, but isn’t the company too hands off?”</p><br/><p>Good Friends’ Producer Choi coughed.</p><br/><p>When I kept my lips closed, Director Hwang continued,</p><br/><p>“Get actors like Seo Jijoon or Son Chaeyoung who don’t appear on entertainment shows often to make cameo appearances. Since you’re going to help, why not go all in? Huh? What do you think?”</p><br/><p>I was so dumbfounded that the corners of lips rose.</p><br/><p>Just what was this guy asking?</p><br/><p>Ah, what did I think?</p><br/><p><sup>{1}</sup> This seems to be a join of ‘Ruby’ and ‘Venus’? Koreans write the ‘by’ in ‘Ruby’ and ‘Ve’ in ‘Venus’ the same way.</p>\n</div>\n<div style=\"max-width: 870px;margin: 5px auto;background: repeating-linear-gradient( 45deg, #fff6cc, #fff6cc 5px, #f3ecc7 5px, #f3ecc7 10px );\">\n<!-- Composite Start -->\n<div id=\"M562762ScriptRootC864255\">\n</div>\n<script async=\"\" src=\"https://jsc.mgid.com/m/e/media.boxnovel.org.864255.js\"></script>\n<!-- Composite End -->\n</div>\n<hr class=\"chr-end\"/>\n<div class=\"chr-nav\" id=\"chr-nav-bottom\">\n<div class=\"btn-group\">\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/top-management-chapter-152\" id=\"prev_chap\" title=\"Chapter 152\">\n<span class=\"glyphicon glyphicon-chevron-left\"></span>\n<span class=\"hidden-xs\">Prev Chapter</span>\n</a>\n<button class=\"btn btn-success chr-jump\" type=\"button\">\n<span class=\"glyphicon glyphicon-list-alt\"></span>\n</button>\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/top-management-chapter-154\" id=\"next_chap\" title=\"Chapter 154\">\n<span class=\"hidden-xs\">Next Chapter</span>\n<span class=\"glyphicon glyphicon-chevron-right\"></span>\n</a>\n</div>\n</div>\n<div class=\"text-center\">\n<button class=\"btn btn-warning\" data-chr-id=\"201418\" id=\"chr-error\" type=\"button\"><span class=\"glyphicon glyphicon-exclamation-sign\"></span> Report chapter\r\n                        </button>\n</div>\n<div class=\"bg-info text-center visible-md visible-lg box-notice\">\r\n                        Tip: You can use left, right, A and D keyboard keys to browse between chapters.\r\n                    </div>\n</div>"}