{"title": "Chapter 157", "id": 157, "volume": 2, "url": "http://boxnovel.org/top-management-chapter-157", "volume_title": "Volume 2", "body": "<h1>Chapter 157</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><header class=\"entry-header\"></header></p><div class=\"entry-content content\"><br/><p>Chapter 157: Competent or Incompetent (10)</p><br/><p>TL: emptycube / ED: Isleidir</p><br/><p>“I-I was the one who brought this proposal over! You can’t just hand it over to someone else!”</p><br/><p>General Manager Hwang’s voice was filled with indignation.</p><br/><p>However, the director reacted coldly.</p><br/><p>“I can’t? Are you picking a fight with me?”</p><br/><p>“That’s not it. I already started preparing for it so if you suddenly tell me to take my hands off it!”</p><br/><p>“Is trying to tame a chief of an agency preparation?”</p><br/><p>Irritated, the director clicked his tongue.</p><br/><p>“Pardon? No, he was overextending his position, so I wanted to make him listen-“</p><br/><p>“People complain because this is the mindset of a so-called general manager. How many agencies did you screw over for the Drama Department to pleadingly ask us to take each other into consideration in our work?”</p><br/><p>General Manager Hwang paused before frowning.</p><br/><p>“The Drama Department?”</p><br/><p>“Why do you think I brought General Manager Jo instead of you? Even if it’s for show, we need to make a harmonious mood for now. Don’t make things worse and just stay out of it.”</p><br/><p>“Director!”</p><br/><p>“If I tell you to stay out of it, you stay out of it. Stop overextending YOUR position and do as I say!”</p><br/><p>He shouted. General Manager Hwang stood back even though he was agitated. Although he became quieter after becoming a director, he was renown as one of the most ill-tempered people in the Entertainment Department. The mood would only get worse if he kept up his indignation.</p><br/><p>The director turned his gaze when General Manager Hwang barely managed to swallow his rage.</p><br/><p>“General Manager Jo, go and start quickly. Other people are interested in that proposal.”</p><br/><p>“Ah, I’ll contact them right away. It’ll be a shame to lose this proposal.”</p><br/><p>He smiled gently while patting the proposal. General Manager Hwang’s red face looked like it would explode as he watched.</p><br/><p>Producer Choi was on the phone when General Manager Hwang kicked open and entered his office. He was leisurely leaning against the sofa, sipping on sweet instant coffee. His face glowed as though he could almost see the success of Good Friends’ long-term project.</p><br/><p>He sighed with a smile on his face.</p><br/><p>“I don’t think anything good will come out of the director’s office. If you lowered your head a little, it wouldn’t have come to this… Ah, the general manager has arrived. I’ll talk to him and call you back.”</p><br/><p>Hanging up, Producer Choi admired,</p><br/><p>“It’s just as you said. Chief Jung Sunwoo sounded like he was terrified when I told him you went to meet the director. I think he’s ready for the taking, what about you? How did the talk with the director go?”</p><br/><p>General Manager Hwang’s neck bulged with red veins.</p><br/><p>Producer Choi, who was still unaware of the situation, hummed,</p><br/><p>“Ah, also, we received a call from the PR Team. They said you need to do an interview once the project is confirmed? Should I tell them=”</p><br/><p>“The proposal was handed over.”</p><br/><p>General Manager Hwang said with gnashed teeth.</p><br/><p>“What was handed over?”</p><br/><p>“The proposal. It was handed over to that bastard, General Manager Jo!”</p><br/><p>“The proposal was hand…ed…”</p><br/><p>Blinking a couple times, Producer Choi almost choked.</p><br/><p>“To General Manager Jo? Wh-why? No, how could you hand it over to him?!”</p><br/><p>“What, you bastard? Should I have flipped a table over when the director told me to take my hands off it? Huh?”</p><br/><p>General Manager Hwang’s lips twitched. Although he couldn’t flip the table in the director’s office, he looked like he might flip the table here a hundred times over. However, Producer Choi, who would have normally lowered his head, wasn’t in his right mind.</p><br/><p>“A-and what about me? I trusted you…!”</p><br/><p>Producer Choi hastily picked his phone up and redialed the most recent number. The signal was busy.</p><br/><p>Producer Choi’s complexion became pale.</p><br/><p>*</p><br/><p>After hearing Producer Choi’s ultimatum, someone else immediately called his phone. Jung Sunwoo’s eyes shined when he checked the number. It wasn’t a cell phone number but a regular one. The middle numbers were familiar.</p><br/><p>“Team leader, this is IBC’s number, right?”</p><br/><p>“It is. Who is it? Is it General Manager Hwang?”</p><br/><p>Those words made the phone seem like a time bomb.</p><br/><p>Jung Sunwoo lightly took a few breaths before picking the time bomb up.</p><br/><p>“We’ll know once we pick up. Hello?”</p><br/><p>-Ah, I am General Manager Jo Junghyeon from IBC. Is this W&amp;U’s Chief Jung Sunwoo?</p><br/><p>General Manager Jo Junghyun?</p><br/><p>Chief Lee Taeshin tilted his head. The unexpected voice befuddled everyone in the meeting room. No, except for one person. Seemingly expecting something, Jung Sunwoo replied,</p><br/><p>“Yes, that’s me.”</p><br/><p>-I just received a reality TV show proposal from the director, and your phone number was written in the contact information, so I called. The proposal was very interesting. I would love to make it with you as long as you are okay with it. Would you mind discussing it with me before you pick someone else?</p><br/><p>The gentle, easygoing voice suggested.</p><br/><p>Then Producer Choi attempted to call him. Three times.</p><br/><p>Jung Sunwoo asked,</p><br/><p>“Then General Manager Hwang…”</p><br/><p>-That guy will no longer be working on this project on the director’s orders. There was an internal situation.</p><br/><p>A few hurriedly shut their mouths. They were about to scream or cheer. Instead, they quickly exchanged glances. Within this chaotic situation, Jung Sunwoo continued to talk with General Manager Jo.</p><br/><p>Soon, they decided on a meeting before hanging up. At the same time, the meeting room blew up in an uproar.</p><br/><p>“What the heck was that?!”</p><br/><p>Jung Sunwoo smiled slightly at the female PR Team employee’s screaming question.</p><br/><p>“It seems the insurance I took up was worth it. I guess I should have another drink.”</p><br/><p>“Euah, how expensive were the drinks for something like this to happen?”</p><br/><p>“If this is how it ends, then wasn’t General Manager Hwang just a chicken-chasing dog? He scared us by acting like something big would go down once he reported to the director, but now all he can do is stare at the roof!”<sup>{1}</sup></p><br/><p>“That’s right. I feel refreshed just thinking about it!”</p><br/><p>The PR Team employees chatted with glowing faces. Team Leader Park laughed. Road Manager Lee Kwanwoo looked at Jung Sunwoo with fervent eyes. His gaze seemed to be filled with reverence than admiration.</p><br/><p>“Why are you all so noisy? Did everything go well?”</p><br/><p>The Team 3 Leader stuck his head into the meeting room.</p><br/><p>Amongst the people who stood up in greeting, Team Leader Park asked,</p><br/><p>“Team 3 Leader, didn’t you go out for a get-together?”</p><br/><p>“Hyunjo, this guy, said that the mood here was pretty serious so we left in the middle of it. I wanted to appear like a comet and lend a hand to Lucky Charm, but it seems I came for no reason. I should have just had some whiskey.”</p><br/><p>“The mood here was definitely grim ten minutes ago. They barely ate.”</p><br/><p>Kim Hyunjo said as he entered after the Team 3 Leader.</p><br/><p>Team Leader Park grinned.</p><br/><p>“I don’t know what kind of deal was made under the bridge, but Mr. Sunwoo completely handled it.”</p><br/><p>“Ah, so the temporary team leader handled it. I worried about our temporary team leader for nothing. I guess I’ll eat all the food I brought to support you by myself…”</p><br/><p>Kim Hyunjo said jokingly before raising his hands. He was holding pizza and chicken boxes in each hand. The people in the meeting room, who had forgotten to eat due to pouring everything into the power struggle, swarmed at him like beasts.</p><br/><p>Jung Sunwoo tightly gripped Kim Hyunjo’s arm.</p><br/><p>“Thank you, chief.”</p><br/><p>“It’s nothing. But what happened?”</p><br/><p>“We were luckier than expected. I didn’t know that they would react this way immediately.”</p><br/><p>Jung Sunwoo said with a smile as though he was relieved.</p><br/><p>The female PR Team employee, who was biting into a chicken drumstick, joined in,</p><br/><p>“Luck? Luck? Do you know what sort of face he made when talking to General Manager Jo something? His face read, ‘Everything’s going according to plan’! He was even smiling wickedly!”</p><br/><p>“Lucky Charm does have a wicked side to him.”</p><br/><p>The Team 3 Leader chuckled. Boisterous laughter erupted around Jung Sunwoo. Listening to the whole story, the Team 3 Leader and Kim Hyunjo held their bellies in laughter when they got to the part about General Manager Hwang having to take his hands off the project.</p><br/><p>Chief Lee Taeshin stood apart, unable to adjust to this cheerful mood.</p><br/><p>He was laughing and cheering like the others moments ago, but after the Team 3 Leader and Kim Hyunjo arrived and after greeting them thanks to Jung Sunwoo introducing him, he took a step back from the situation.</p><br/><p>He was like a man who had woken up from a dream and was now staring at reality.</p><br/><p>“Chief Lee, have a slice.”</p><br/><p>Jung Sunwoo handed him a slice of pizza.</p><br/><p>Chief Lee Taeshin blankly stared at him before jolting to his senses and accepting the slice.</p><br/><p>“Ah, thank you.”</p><br/><p>“How is your schedule tomorrow? I think it’ll be good if you came with me to IBC?”</p><br/><p>“Me?”</p><br/><p>‘I don’t think I’ll be of much help.’ These words quietly crawled out of his mouth.</p><br/><p>Jung Sunwoo said,</p><br/><p>“They are so enthusiastic that we might start discussing the composition then and there. You are the one who knows Pretty Girls the best.”</p><br/><p>“Ah… Understood.”</p><br/><p>Chief Lee Taeshin nodded.</p><br/><p>He clenched his jaw.</p><br/><p>Leaving the meeting room by himself, Chief Lee Taeshin took out his phone. There was an unending list of missed calls because he had ignored them for the entire day. There were even more messages. It was to the point his thin phone felt as heavy as a brick.</p><br/><p>He scanned through the messages in front of a window at the end of the hallway.</p><br/><p>An attached picture caught his eye. It was a message sent by Oh Yeondu a while ago.</p><br/><p>{Chief, I’m Yeondu. I’m sorry for texting you when you’re so busy! I wanted to show you this in case you didn’t see it! I quickly screenshotted it because I didn’t know when it would drop!}</p><br/><p>He could sense her excitement and overwhelmed emotions through her words. The attached picture was a screenshot of the portal site’s real-time search rankings. Pretty Girls’ name was tenth. He checked the portal site now, and unlike Oh Yeondu’s thoughts, they were still on the rankings.</p><br/><p>They were first.</p><br/><p>He hastily screenshotted it. Other things caught his eye. The portal site’s main entertainment column. Pretty Girls’ name was in the headline. When he clicked on it, he was greeted with the members’ profiles. They were the material he sent W&amp;U’s PR Team.</p><br/><p>There was an article describing the unknown girl group’s reality. There was even a music critic’s analysis on why they weren’t popular for the two years since they debuted. Chief Lee Taeshin read the article with a complicated gaze before turning the internet off.</p><br/><p>Someone seemed to have made a joke as laughter escaped the closed meeting room door.</p><br/><p>He stared at the meeting room before lowering his head. His earlobes were red.</p><br/><p>To be honest, he thought about this.</p><br/><p>How would things have turned out if the situation was reversed? If he and Pretty Girls were from W&amp;U and Chief Jung Sunwoo and Neptune started off as a manager and idol group of a now non-existent company. If that was the case, would the current situation also be reversed?</p><br/><p>However, he realized something after seeing Jung Sunwoo today.</p><br/><p>Neptune was able to break out from their unknown streak because Jung Sunwoo was competent.</p><br/><p>And Pretty Girls were still an unknown girl group because he was incompetent.</p><br/><p>He had failed them.</p><br/><p>Chief Lee Taeshin glanced through his text messages again. There were dozens of texts from Park Hyojin and Yoon Bora. They even called him an equally large number of times. He could guess what sort of faces they were making right now.</p><br/><p>His hand hesitated, hovering above the screen. In the end, instead of checking the contents of their texts, he looked through the remaining texts. There were a lot of people who he had met briefly or had never met before.</p><br/><p>However, none were from Jung Jae.</p><br/><p>He tried calling her, but her phone was still turned off.</p><br/><p>Chief Lee Taeshin rubbed his thin face.</p><br/><p>***</p><br/><p>He resembled my brother.</p><br/><p>That was my first impression of General Manager Jo Junghyeon. They were similar no matter how I saw it. They both wore glasses and gave off an amiable impression. They both looked like they were the type of people who always carried books in their bags. In fact, they were also alike in how bright sweaters suited them.</p><br/><p>Maybe it was because of this, but the mood was comfortable after we greeted each other. It was completely different from my meeting with General Manager Hwang. It felt like we were talking on the sofa in my house instead of inside his office.</p><br/><p>“These are our conditions. What do you think?”</p><br/><p>“Ah, they are good, hyung…”<sup>{2}</sup></p><br/><p>“Hyung?”</p><br/><p>I inwardly clicked my tongue at my slip-up. General Manager Jo smiled lightly.</p><br/><p>“I’m old enough to be your father. Do I really look that young?”</p><br/><p>I covered the truth and nodded.</p><br/><p>His proposal was definitely good. They weren’t bad even when compared to the conditions offered by cable networks and other production companies. I thought that we could pretty much go through with it from what I heard so far. As long as they didn’t make absurd demands like General Manager Hwang, it was more beneficial for us to collaborate with a public network. Their influence couldn’t be beaten.</p><br/><p>However, the most important point remained.</p><br/><p>Who would General Manager Jo choose as the producer?</p><br/><p>No matter how good the ingredients were, it was no use if the chef’s skills were terrible. Even if we started the broadcast with the public’s full attention, it was up to the producer to maintain it. Viewers would change the channel if the show was no fun. However, if the producer went excessively provocative, some of the members could become disliked by the public.</p><br/><p>We needed a skilled producer who could maintain the hype and make the public have favorable impressions of the members. Would all these producers be busy with their own programs?</p><br/><p>I licked my lips when General Manager Jo said,</p><br/><p>“There’s a producer I thought of as soon as I read the proposal. Would you like to meet him?”</p><br/><p>Of course, I did.</p><br/><p>Chief Lee Taeshin and I exchanged glances before standing up. General Manager Jo led the way. We left his office and were walking down the Entertainment Department’s hallway. What kind of producer would it be? I hoped it wasn’t someone like Producer Choi Byungsoo.</p><br/><p>I followed along while thinking this when I saw a familiar face across from us.</p><br/><p>A man was approaching us with steadfast steps. It was General Manager Hwang.</p><br/><p>He frowned the moment he discovered us. Chief Lee Taeshin stopped in his tracks. It seemed he figured out who he was by his ID card. General Manager Jo was walking in front of us with a smile on his face as though nothing was wrong.</p><br/><p>I also smiled.</p><br/><p>“Hello, general manager.”</p><br/><p>When I greeted him first, General Manager Hwang looked like his insides were twisting. Chief Lee Taeshin greeted him after me, but General Manager Hwang didn’t spare him a glance and simply stared at me. So I smiled even brighter so that he would feel even crappier.</p><br/><p>“I guess the talk went well considering the smile on your face?”</p><br/><p>General Manager Hwang said in a mocking tone. An oddly irritating smirk hung on his lips.</p><br/><p>“General Manager Jo, did you decide on a producer?”</p><br/><p>“Not yet. We’re about to discuss it now.”</p><br/><p>“Really? It seems you’ll have a hard time finding a producer.”</p><br/><p>General Manager Hwang’s smirk deepened.</p><br/><p>“I looked around before handing over the proposal. Hyunkwon and Wookyung are the only ones with the experience and skill who aren’t tied up in a program right now. Just those two, but they are both busy preparing their own programs.”</p><br/><p>Yet he boasted about how he had already decided on the staff yesterday.</p><br/><p>Was there something going on with the producers he mentioned?</p><br/><p>I frowned at the sudden thought, but General Manager Jo nonchalantly said,</p><br/><p>“It doesn’t matter. I have someone else in mind.”</p><br/><p>“What? Who?”</p><br/><p>General Manager Hwang’s eyes widened.</p><br/><p>“Besides them, the only ones in the Entertainment Department who have time are production assistants?”</p><br/><p>“Ah, not from the Entertainment Department. He’s from the Documentary Department.”</p><br/><p>General Manager Hwang was taken aback by his unexpected reply.</p><br/><p>I was also taken aback.</p><br/><p>The Documentary Department?</p><br/><p><sup>{1}</sup> Chicken-chasing dog can only stare at the roof where the chicken escaped to.</p><br/><p><sup>{2}</sup>Hyung can also mean actual brother. Jung Sunwoo slips up by calling the generalmanager ‘brother’, while the general manager misunderstands. Hyung is usuallyused between two men when the age difference isn’t too large.</p>\n</div>\n<div style=\"max-width: 870px;margin: 5px auto;background: repeating-linear-gradient( 45deg, #fff6cc, #fff6cc 5px, #f3ecc7 5px, #f3ecc7 10px );\">\n<!-- Composite Start -->\n<div id=\"M562762ScriptRootC864255\">\n</div>\n<script async=\"\" src=\"https://jsc.mgid.com/m/e/media.boxnovel.org.864255.js\"></script>\n<!-- Composite End -->\n</div>\n<hr class=\"chr-end\"/>\n<div class=\"chr-nav\" id=\"chr-nav-bottom\">\n<div class=\"btn-group\">\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/top-management-chapter-156\" id=\"prev_chap\" title=\"Chapter 156\">\n<span class=\"glyphicon glyphicon-chevron-left\"></span>\n<span class=\"hidden-xs\">Prev Chapter</span>\n</a>\n<button class=\"btn btn-success chr-jump\" type=\"button\">\n<span class=\"glyphicon glyphicon-list-alt\"></span>\n</button>\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/top-management-chapter-158\" id=\"next_chap\" title=\"Chapter 158\">\n<span class=\"hidden-xs\">Next Chapter</span>\n<span class=\"glyphicon glyphicon-chevron-right\"></span>\n</a>\n</div>\n</div>\n<div class=\"text-center\">\n<button class=\"btn btn-warning\" data-chr-id=\"201426\" id=\"chr-error\" type=\"button\"><span class=\"glyphicon glyphicon-exclamation-sign\"></span> Report chapter\r\n                        </button>\n</div>\n<div class=\"bg-info text-center visible-md visible-lg box-notice\">\r\n                        Tip: You can use left, right, A and D keyboard keys to browse between chapters.\r\n                    </div>\n</div>"}