{"title": "Chapter 150", "id": 150, "volume": 2, "url": "http://boxnovel.org/top-management-chapter-150", "volume_title": "Volume 2", "body": "<h1>Chapter 150</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><header class=\"entry-header\"></header></p><div class=\"entry-content content\"><br/><p>Chapter 150: Competent or Incompetent (3)</p><br/><p>TL: emptycube / ED: Isleidir</p><br/><p>“Although I received a brief explanation, did the company really take their hands off?”</p><br/><p>Chief Lee Taeshin nodded a few times before replying,</p><br/><p>“Yes, yes. There will be no contract issues if the girls sign with any other company. You do not have to worry about that. A member who actually left before… already signed with another company and is preparing for a debut.”</p><br/><p>They didn’t have a company, and their group was about to disband.</p><br/><p>I said to Chief Lee Taeshin, who had a pitiful expression,</p><br/><p>“Our company has no plans on selecting new trainees at the moment.”</p><br/><p>“Ah…”</p><br/><p>He bit his lips. His busted lip grew redder.</p><br/><p>“If they want to join another company, they’ll have to be separated.”</p><br/><p>“Hoping that they end up in the same company is just wishful thinking on my part. If a decent company is willing to accept them, then even if they have to separate…!”</p><br/><p>One of the sniffling members cried out. Her cries quickly infected the others. They faltered like they were drunk from all that crying. Chief Lee Taeshin looked at them with a heartbroken expression.</p><br/><p>A member grabbed his arm.</p><br/><p>“What will happen to you if we go? You borrowed a lot of money for us.”</p><br/><p>“What if loan sharks come and take your ‘sinjang’ and ‘kongpat’<sup>{1}</sup>?”</p><br/><p>Chief Lee Taeshin rubbed his red eyes. Then he nonchalantly said,</p><br/><p>“You worry too much. I didn’t borrow from people like them. Also, ‘sinjang’ and ‘kongpat’ are the same thing. I’ll die if I sell them both. Study hard so you don’t embarrass yourself when you go on entertainment shows.”</p><br/><p>“Is that the problem right now? Is it?! Chief…!”</p><br/><p>“Just worry about yourselves. You can just call me back once you’re successful.”</p><br/><p>I watched from a distance as they held each other and wailed like a family separating. My cool head filled itself with calculations.</p><br/><p>My decision became even more resolute.</p><br/><p>I will bring them all.</p><br/><p>“How about releasing your single album? As planned?”</p><br/><p>“… Pardon?”</p><br/><p>Chief Lee Taeshin turned to look at me.</p><br/><p>Confusion spread on his despairing face.</p><br/><p>“An album?”</p><br/><p>“Yes, with me.”</p><br/><p>Their wails stopped instantly.</p><br/><p>We cleaned up the messy floor and sat in a circle.</p><br/><p>Chief Lee Taeshin and the girls seemed dazed. Since I brought up releasing an album together, they were busy trying to figure out what I meant and exchanging glances with each other.</p><br/><p>“First, could I listen to the song?”</p><br/><p>“Th-the song?”</p><br/><p>Chief Lee Taeshin blinked.</p><br/><p>“The one you received from the songwriter DOM. Do you have other songs?”</p><br/><p>“Ah, no. We only have that one.”</p><br/><p>“Don’t tell me that that song has been handed over to someone else?”</p><br/><p>“Of course not! Yeondu, the laptop…!”</p><br/><p>“Please wait!”</p><br/><p>A member hastily got up. Soon, a laptop was placed on the floor. Chief Lee Taeshin searched for the audio file. His hand seemed stiff as the cursor moved in strange directions. A song began to play soon.</p><br/><p>It was the ‘guide’ version. Someone was humming over the instrumentals.</p><br/><p>While listening to the song, Chief Lee Taeshin and the girls waited with bated breaths.</p><br/><p>The not-even-four-minute song quickly ended.</p><br/><p>“Uh… How is it?”</p><br/><p>Chief Lee Taeshin asked with an anxious expression.</p><br/><p>I looked at him and the three goldfish and replied,</p><br/><p>“I think it’s good? It’s catchy.”</p><br/><p>“Re-really?”</p><br/><p>That was a lie.</p><br/><p>I licked my lips and lied. To be honest, I had no idea. This song brought an unknown group to the top of the charts. It wasn’t short-lived since this lasted at least two weeks.</p><br/><p>Kim Hyunjo said the song would be a hit no matter who sang it so I thought I could tell as soon as I heard it.</p><br/><p>I understood that it was nice to listen to. However, that was it. At least for me.</p><br/><p>Well, this was comparable to when I first heard Lee Taehee’s song, Satellite, as well.</p><br/><p>I become confident with this. My ears were crap.</p><br/><p>Still, what was fortunate was that I felt the same way when I heard the songs Lee Taehee played for me not too long ago. Should I say it felt like the possibility that they were all good enough to shoot for first place was steadily increasing?</p><br/><p>As expected, I should play them for my other team members and the A&amp;R team and discuss with them. I’m curious which one Kim Hyunjo would like the most.</p><br/><p>“Excuse me, about releasing an album with us, were you serious…”</p><br/><p>The hesitant voice trailed off.</p><br/><p>The other members pulled the member who said that.</p><br/><p>“Hey, how could you disturb him?! He’s thinking!”</p><br/><p>“I-I was just so curious.”</p><br/><p>“Endure it!”</p><br/><p>The goldfish whispered to each other while examining my expression.</p><br/><p>“I’m serious.”</p><br/><p>Their eyes bulged even more when they heard me. Their mouths opened and closed.</p><br/><p>Chief Lee Taeshin looked at me. He looked all choked up.</p><br/><p>I stretched out my hand towards him and said,</p><br/><p>“Since an album isn’t done on one’s own, I’ll have to discuss with my company to know for sure, but I’m serious. I hope that we can work on Pretty Girls’ next single together. What do you think?”</p><br/><p>He held my hand without any hesitation.</p><br/><p>Chief Lee Taeshin shook his leg anxiously.</p><br/><p>He was attempting to contact the members who left the group.</p><br/><p>Jung Jae’s phone had been turned off since her call with me. When I told him what had happened, Chief Lee Taeshin pitifully said that there were some circumstances and that he would talk with her once he got a hold of her.</p><br/><p>However, Jung Jae wasn’t the only one who wasn’t responding.</p><br/><p>It was the same for the remaining two members. When calling, one rang while the other hung up mid-ring.</p><br/><p>They seemed to be avoiding answering their calls.</p><br/><p>“The girls are too hot-headed right now… You girls try and call them too.”</p><br/><p>“If they don’t answer your phone, they probably won’t answer ours.”</p><br/><p>The goldfish mumbled as they called. There was no answer.</p><br/><p>Instead, one of them received a text.</p><br/><p>Chief Lee Taeshin quickly asked,</p><br/><p>“Who is it? Is it one of the girls?”</p><br/><p>“It’s Hyojin unni.”</p><br/><p>“Hyojin? What did she say?”</p><br/><p>“… To stop calling her because it’s pissing her off. She also told me to tell you not to call her anymore.”</p><br/><p>She seemed upset by the text as her swollen cheeks trembled.</p><br/><p>I heard that they left on a bad note, but it seemed the situation was worse than I initially thought. Now that I thought about it, Chief Lee Taeshin did mention the ‘unnis’ psychological warfare’. Were they not close?</p><br/><p>“Would it be okay if I mentioned you in the text?”</p><br/><p>Chief Lee Taeshin asked desperately.</p><br/><p>“The girls will definitely change their minds if they learn that you’ll be helping out.”</p><br/><p>“That’s a bit tricky… It could be leaked to the press if someone else reads it. The reporters are waiting for any bit of news, so things will get complicated if this leaks to the press before things are certain. Also, the members…”</p><br/><p>I also had my doubts.</p><br/><p>Even if the girls returned after Chief Lee Taeshin mentions my name, would they be able to group together as Pretty Girls once again? When the glass has already shattered?</p><br/><p>They would have been successful together if it wasn’t for the butterfly effect I created. I would feel less guilty if I got them back on track, but so long as I decided to bring them together, I had to consider the possible risks as well.</p><br/><p>Well, it wasn’t like I personally talked with the members prior so my concerns were unfounded for now.</p><br/><p>I shook my head and got up.</p><br/><p>“First, I think I’ll need to head to work. Let’s meet up once we settle our problems.”</p><br/><p>The members saw me out. Chief Lee Taeshin told the girls to stay inside and followed me out to the parking lot alone. He hesitated before saying,</p><br/><p>“I couldn’t bring it up because of the girls, but would W&amp;U invest in a group like us? It’s not like it’s an insignificant investment. If you give me a day, I think I’ll be able to procure some more money. Then…”</p><br/><p>I got in my minivan and replied,</p><br/><p>“Please let me handle that.”</p><br/><p>***</p><br/><p>The Team 3 Leader looked around the office before calling Kim Hyunjo.</p><br/><p>He bought two coffees from the vending machine as he asked,</p><br/><p>“Is Lucky Charm not coming to work today?”</p><br/><p>“He said he’ll come after doing something first. Why?”</p><br/><p>Drinking the warm coffee, the Team 3 Leader got to the point.</p><br/><p>“It looked like he had a lot of worries yesterday, don’t you need to talk with him?”</p><br/><p>“I already did.”</p><br/><p>Kim Hyunjo shrugged.</p><br/><p>“You already did?”</p><br/><p>“I keep forgetting because I’m an incompetent sunbae who he’s already surpassed, but I’m his superior. We had a good talk last night that you aren’t aware of.”</p><br/><p>Kim Hyunjo said jokingly. The Team 3 Leader patted his shoulder.</p><br/><p>“And the talk ended well?”</p><br/><p>“I think so? Let’s see his expression when he comes into work…”</p><br/><p>Kim Hyunjo paused. Jung Sunwoo got off the elevator.</p><br/><p>Jung Sunwoo’s eyes widened when he discovered the two in front of the vending machine. The corners of his lips curled up. Seeing him approach them with steadfast steps, the Team 3 Leader poked Kim Hyunjo’s side.</p><br/><p>“Maybe you’re gifted in counseling others? His face is lively today.”</p><br/><p>“I know, right? Maybe I should change careers.”</p><br/><p>“Team leader, chief, I have something I want to discuss with you. Are you free right now?”</p><br/><p>Jung Sunwoo suddenly asked. The two nodded with dazed faces.</p><br/><p>In an instant, the three sat facing each other in a meeting room.</p><br/><p>“What’s the hurry? What do you want to talk about?”</p><br/><p>“Do you happen to know the girl group, Pretty Girls?”</p><br/><p>“Pretty Girls? I think I’ve heard of them before.”</p><br/><p>“Aren’t they the rookies with multiple flops? What about them?”</p><br/><p>The Team 3 Leader and Kim Hyunjo tilted their head as they had no idea what was going on.</p><br/><p>Jung Sunwoo said,</p><br/><p>“They are preparing for a digital single for their next album, but there was a problem and they no longer have a company. Their preparations are about to go belly up as well.”</p><br/><p>“That’s common. They’ll soon disband I guess.”</p><br/><p>The Team 3 Leader clicked his tongue.</p><br/><p>“So, what about these Pretty Girls?”</p><br/><p>As if he waited for this, Jung Sunwoo said in a clear voice,</p><br/><p>“I want to take care of them.”</p><br/><p>The clip of Pretty Girls’ performance ended.</p><br/><p>The Team 3 Leader and Kim Hyunjo stared at the black screen a while longer. Their complexions were similarly dark. Soon, the Team 3 Leader downed his cold coffee. The paper cup crumbled in his hand.</p><br/><p>“Only three high schoolers remain out of those six. The others already packed their bags and left.”</p><br/><p>“That’s the situation as of right now.”</p><br/><p>“And you want to produce their single album.”</p><br/><p>“Yes.”</p><br/><p>“That song is by some unknown songwriter by the name of Domi?”</p><br/><p>“It’s DOM.”</p><br/><p>“I don’t care if it’s a domi or gajami!”<sup>{2}</sup></p><br/><p>The Team 3 Leader shouted before grasping the back of his neck. He groaned.</p><br/><p>He then asked Kim Hyunjo, who was rubbing his face,</p><br/><p>“Hey, what kind of talk did you say you had last night?”</p><br/><p>“… That his life wasn’t over with a single failure. To enjoy work.”</p><br/><p>“Oh my god.”</p><br/><p>“I said that in order to help him deal with the pressure, but I think the dosage was too high.”</p><br/><p>“It’s not just high, he needs a doping test. He’s not in his right mind.”</p><br/><p>The Team 3 Leader shook his head.</p><br/><p>Kim Hyunjo sighed as he said,</p><br/><p>“Hey, why did you have to get caught up in something strange again? Mr. Nam Joyoon was at least by himself. These girls are a group. Also, it’s not something that can be handled on your own. To make an album, they’ll need a recording, mixing, and choreography team as well. They’ll also need to film the music video. On top of that, they’ll need stylists and makeup artists. That’s a huge investment. The risk is too high if it fails. Doesn’t seem absurd to you as well?”</p><br/><p>“Lucky Charm, I know you have a good eye. I do, but this is very excessive. There’s no need to even bring this up to the director or CEO. Just go ask any employee outside. I bet they’ll all think you’re crazy.”</p><br/><p>Quickly venting this, the Team 3 Leader said in a more consoling manner.</p><br/><p>“If their potential is a shame to lose, then we can feature them on one of Neptune’s songs. So, don’t think about producing some single album and focus on Neptune’s full album.”</p><br/><p>“It’ll benefit Neptune as well if the results are good.”</p><br/><p>“What?”</p><br/><p>“I am confident that the results will be good.”</p><br/><p>Jung Sunwoo looked at them and added,</p><br/><p>“And I have the plans too.”</p><br/><p>*</p><br/><p>CEO Baek Hansung entered his office. The director, who was already sitting inside, put down his teacup and stood up. His greeting was full of laughter. The director’s round cheeks wiggled like he was holding himself back from laughing out loud.</p><br/><p>“What’s so funny?”</p><br/><p>“Lucky Charm’s actions are getting funnier by the day. He’s my energizer these days. He brought over an actor who was unknown for ten years and raised him to success. Now he’s caught up with a girl group that’s about to disband. One where half the members have left.”</p><br/><p>The director chuckled for a good while.</p><br/><p>He sated his throat with black tea before finally managing to hold back his laughter. He then said,</p><br/><p>“But it really is strange. Maybe it’s because it’s Lucky Charm, but I’m anticipating how it’ll go. What will happen once the girl group is in their care? I almost want to let him do it just to see how it pans out.”</p><br/><p>The director said joyfully before suddenly frowning.</p><br/><p>“Oh my. I need to keep my tongue in check. The reporters will go crazy if they hear about this. They’ll be in a frenzy, I bet.”</p><br/><p>“Probably.”</p><br/><p>CEO Baek Hansung smiled faintly.</p><br/><p>“Then shall we hear it? What his thoughts are?”</p><br/><p>The director immediately pulled out his phone and called someone.</p><br/><p>“Yeah, the CEO just arrived. Tell Lucky Charm to come up.”</p><br/><p><sup>{1}</sup> ‘Sinjang’ and ‘kongpat’ both mean kidneys</p><br/><p><sup>{2}</sup> ‘Domi’ and ‘Gajami’ are types of fish</p>\n</div>\n<div style=\"max-width: 870px;margin: 5px auto;background: repeating-linear-gradient( 45deg, #fff6cc, #fff6cc 5px, #f3ecc7 5px, #f3ecc7 10px );\">\n<!-- Composite Start -->\n<div id=\"M562762ScriptRootC864255\">\n</div>\n<script async=\"\" src=\"https://jsc.mgid.com/m/e/media.boxnovel.org.864255.js\"></script>\n<!-- Composite End -->\n</div>\n<hr class=\"chr-end\"/>\n<div class=\"chr-nav\" id=\"chr-nav-bottom\">\n<div class=\"btn-group\">\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/top-management-chapter-149\" id=\"prev_chap\" title=\"Chapter 149\">\n<span class=\"glyphicon glyphicon-chevron-left\"></span>\n<span class=\"hidden-xs\">Prev Chapter</span>\n</a>\n<button class=\"btn btn-success chr-jump\" type=\"button\">\n<span class=\"glyphicon glyphicon-list-alt\"></span>\n</button>\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/top-management-chapter-151\" id=\"next_chap\" title=\"Chapter 151\">\n<span class=\"hidden-xs\">Next Chapter</span>\n<span class=\"glyphicon glyphicon-chevron-right\"></span>\n</a>\n</div>\n</div>\n<div class=\"text-center\">\n<button class=\"btn btn-warning\" data-chr-id=\"201412\" id=\"chr-error\" type=\"button\"><span class=\"glyphicon glyphicon-exclamation-sign\"></span> Report chapter\r\n                        </button>\n</div>\n<div class=\"bg-info text-center visible-md visible-lg box-notice\">\r\n                        Tip: You can use left, right, A and D keyboard keys to browse between chapters.\r\n                    </div>\n</div>"}