{"title": "Chapter 160", "id": 160, "volume": 2, "url": "http://boxnovel.org/top-management-chapter-160", "volume_title": "Volume 2", "body": "<h1>Chapter 160</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><header class=\"entry-header\"></header></p><div class=\"entry-content content\"><br/><p>Chapter 160: Celebrities Live Off their Image (3)</p><br/><p>TL: emptycube / ED: Isleidir</p><br/><p>Suicide?</p><br/><p>My mind wretched to a halt.</p><br/><p>The rain died down. The drumming rain and shouts of reporters that drowned my ears grew distant. I was sitting in the meeting room once again. This was the present. The present. Okay, so what I saw was the future. Just as I took a step back from this horrible word…</p><br/><p>“Chief Jung? What should we do about Ms. Jung Jae?”</p><br/><p>Producer Yoo Sooyoung asked.</p><br/><p>A chill ran down my spine. My blood seemed to gush out from me like a hunted animal that was hung upside down. I clenched my tingly hands a couple of times. The reporter’s voice rang in my ears.</p><br/><p>Suicide. To commit suicide. What in…!</p><br/><p>No, let’s calm down. This hasn’t happened yet. Yeah, not yet.</p><br/><p>Damn it. But it didn’t seem like it was very far off either.</p><br/><p>I rubbed my face beaded with cold sweat and said,</p><br/><p>“I think we need to be more proactively looking for her.”</p><br/><p>“More proactively?”</p><br/><p>Everyone stared at me at my unexpected statement. Even Chief Lee Taeshin.</p><br/><p>Team Leader Park tilted her head.</p><br/><p>“Is there really a need to? If this fails, then we’ll be tight for time…”</p><br/><p>“I felt things were a bit serious when I last talked to her. It also makes me uneasy that no one can get in contact her still. I’m worried she might be having some dark thoughts.”</p><br/><p>“By dark thoughts you mean…”</p><br/><p>Everyone held their breath.</p><br/><p>“Though I hope I’m just being excessively worried.”</p><br/><p>“You’re probably right. You scared me there.”</p><br/><p>“Still, we aren’t tight for time yet, so let’s keep looking for her.”</p><br/><p>I concluded and stood up. Chief Lee Taeshin’s gaze followed me.</p><br/><p>I hid my urgency and said,</p><br/><p>“Chief Lee, do you have a moment?”</p><br/><p>I led, almost dragged, Chief Lee Taeshin to the outdoor smoking area.</p><br/><p>A clear, cloudless sky was revealed when I opened the door. A lazy spring breeze shook the grass. This was definitely the present, yet it still felt surreal. My vision was still filled with afterimages of camera flashes.</p><br/><p>“Umm, Chief Jung.”</p><br/><p>Chief Lee Taeshin examined my complexion.</p><br/><p>“Thank you for giving us some breathing room. But, Jae won’t have such dark thoughts you’re worried about.”</p><br/><p>“How can you be so sure? When we can’t even get in contact with her?”</p><br/><p>“She’s worked almost ten years since elementary school to be a singer. She experienced a ton of hardships but overcame all of them. She’s an only child so she deeply cares about her parents as well. There’s no way she’d do anything like that.”</p><br/><p>Like hell there isn’t.</p><br/><p>Still, it seemed he found my words a bit concerning as he tried to call her again. It looked like she still wasn’t picking up. Seeing this, my chaotic mess of a mind slowly seemed to regain its calm.</p><br/><p>I held onto the rail and took deep breaths.</p><br/><p>Now wasn’t the time to space out. I needed to get it together and think through this.</p><br/><p>Park Hyojin and Yoon Bora, who left for NK Entertainment, would make a media play involving Pretty Girls. In that process, they would bring up how a member was called to drinking parties. Once it’s revealed that it was Jung Jae, dirty, stinging gazes would fixate on her.</p><br/><p>Then… suicide.</p><br/><p>Suspicions that a member of topical girl group might have been involved in sexual favors. Her image would be dragged through the mud, and even if she denied them at the top of her lungs, those rumors would follow her like a shadow.</p><br/><p>Even if she was a steadfast girl who wouldn’t crumble over easily as Chief Lee Taeshin said, she might have such an impulse in that sort of situation. She was only 22, and she spent half her life with the goal of becoming a celebrity.</p><br/><p>On top of that, there was a high chance she would be mentally unstable.</p><br/><p>Damn it. I felt sick thinking about suicide again.</p><br/><p>My gaze unconsciously looked below the banister. The ground was far away.</p><br/><p>I swept away the thoughts that spread like mold in my mind. Let’s take action first. Let’s find out where Jung Jae is and what she’s doing and stop Park Hyojin and Yoon Bora before they do anything crazy.</p><br/><p>I asked Chief Lee Taeshin, who was calling to no avail,</p><br/><p>“Do you have no idea where she might be? Someone among her family or friends who might be hiding her?”</p><br/><p>“At least not her parents.”</p><br/><p>He shook his head.</p><br/><p>“Checking the phone number she called her parents with, it was a public number in Seoul. Near Yeoungdeungpo. I think she’s still in Seoul, but none of the past trainees or members who left Pretty Girls had an idea where she might be. It’s no time to be like this. I’ll go and look for her.”</p><br/><p>“Before that.”</p><br/><p>I stopped him.</p><br/><p>“Park Hyojin and Yoon Bora.”</p><br/><p>“Yes?”</p><br/><p>“I thought about it, and those two know too much. They know that their previous president took a member to drinking parties, and it could become a problem if this gets out. I think we need to make sure they don’t leak anything.”</p><br/><p>Taken aback, Chief Lee Taeshin opened and closed his mouth.</p><br/><p>“I’ll talk to them…!”</p><br/><p>“No, I’ll do it.”</p><br/><p>Since we would have to take stronger measure if it wasn’t settled politely.</p><br/><p>I didn’t think he could ever do that.</p><br/><p>“Instead, tell me more about them.”</p><br/><p>“By that you mean…”</p><br/><p>“Information that I can use to lock their lips in the worst-case scenario.”</p><br/><p>They didn’t even know what to say and not to say and were capable of stabbing their previous members in the back for their own success. Once they knew that there was a knife aimed at them, they would be scared and be cautious.</p><br/><p>The sharper and clearer the knife, the more effective it would be.</p><br/><p>Chief Lee Taeshin paled when he saw my expression. He clung onto me as though he thought I was going to go over there, grab them by their collars, and threaten them.</p><br/><p>“Ch-Chief Jung, it’s understandable that you are worried since the mood wasn’t great when they left. But they were just too emotional at that time.”</p><br/><p>“I heard that they caused trouble for you once the articles were released.”</p><br/><p>“Th-that’s… How could they not act after seeing such articles? They narrowly missed the opportunity they had waited for the past two years for. Even if I were them, I would need someone to resent as well.”</p><br/><p>His desperate attempts at trying to change my mind were almost pitiful.</p><br/><p>“It was almost for a moment. They are fine now. They decided to wholeheartedly support us.”</p><br/><p>“Chief Lee.”</p><br/><p>“And about the dri-drinking parties.”</p><br/><p>Chief Lee Taeshin bit his lips before continuing,</p><br/><p>“They all know that they shouldn’t tell others about that. They are so bad to harass members who they spent years with. I’m sure of it.”</p><br/><p>The two you are protecting would flap their mouths in an interview soon.</p><br/><p>And the Jung Jae you trust would never have bad thoughts would die.</p><br/><p>A thought suddenly crossed my mind. In the future where Jung Jae dies and after knowing that those two were responsible for that situation, how would this person cope? Would he still be able to live like a normal person?</p><br/><p>My thoughts of threatening him into cooperation smoldered.</p><br/><p>I let out a short sigh before saying in a calm voice,</p><br/><p>“Do you really think I would just threaten them? I’m only preparing for the worst-case scenario. If I don’t tell them the seriousness of it, they might accidentally leak it to the press, and even if they didn’t want to, NK Entertainment might push them to it.”</p><br/><p>After a few more exchanges, Chief Lee Taeshin nodded while looking like someone who was about to squeal on his family.</p><br/><p>He spoke.</p><br/><p>I left Lee Kwanwoo to organize the schedule and left the company.</p><br/><p>I made a necessary stop and made a few calls before finally picking up my phone.</p><br/><p>***</p><br/><p>They were wearing a racy corset-style top that exposed their cleavage, a garter belt that went past their short skirt and down their thighs. NK Entertainment’s soon-to-debut girl group got in position in those outfits. The camera stubbornly focused on their cleavage and legs.</p><br/><p>“Park Hyojin, Yoon Bora! Why do you keep flinching? Are you not confident in your bodies?”</p><br/><p>The NK chief clicked his tongue as he observed the shoot.</p><br/><p>Yoon Bora fiddled with her hair as she said,</p><br/><p>“No, it’s just our first time doing a photoshoot wearing something like this.”</p><br/><p>“Why can’t they keep up when they’ve already debuted before?”</p><br/><p>Chuckles could be heard from the other members. Yoon Bora frowned.</p><br/><p>As soon as the shoot was over, Yoon Bora and Park Hyojin rushed to the dressing room. Yoon Bora threw off her outfit, which was no different from lingerie.</p><br/><p>“Don’t tell me our stage outfits will be like this? How can we go on TV while wearing something like this?”</p><br/><p>“The stage outfits must be different. They need to consider the broadcast.”</p><br/><p>It seemed the other members heard them when they entered the room as they said,</p><br/><p>“Have you never done a sexy concept when you were in Pretty Girls?”</p><br/><p>“Never. Half of the group were minors. They are the only ones left, right?”</p><br/><p>“Was it Making Film? I heard they started filming, have they approached you?”</p><br/><p>“Maybe you should ask the-“</p><br/><p>“Stop it. It’s not like this is your first time bringing this up. I’m tired of hearing about it.”</p><br/><p>Park Hyojin quietly shot them a glance. The other members, who had been laughing, stiffened. The mood in the dressing room tensed. Just before Yoon Bora and Park Hyojin were about to leave after taking their things, they heard whispers behind them.</p><br/><p>“If they can’t wear things like this, why did they join a group with a sexy concept?”</p><br/><p>“I know, right? They were so proud of their stage experience. Look at them now.”</p><br/><p>“Hey!”</p><br/><p>Park Hyojin held Yoon Bora back when she turned around, face red. Studio staff and NK Entertainment employees were busily cleaning up the shoot. Park Hyojin gestured at them as she said,</p><br/><p>“Can’t you see there are a lot of people? Don’t cause a fuss. We need to maintain our image.”</p><br/><p>“It’s still frustrating! They’re always whispering behind our backs when they will benefit once our popularity rises after talking to the press. I dare them to try to take advantage of us then.”</p><br/><p>Panting, Yoon Bora angrily picked up her phone. It was vibrating.</p><br/><p>“Who is it?!”</p><br/><p>-Ah, I’m sorry for calling you all of a sudden. I received this number from Chief Lee Taeshin.</p><br/><p>It was a deep, gentle voice. Yoon Bora tilted her head.</p><br/><p>-My name is Jung Sunwoo.</p><br/><p>“Who?”</p><br/><p>-Jung Sunwoo, chief or temporary team leader at W&amp;U. Whatever the position, I am Jung Sunwoo.</p><br/><p>Yoon Bora’s eyes bulged. She hastily tapped Park Hyojin’s shoulder. When Park Hyojin turned around, Yoon Bora silently mouthed, ‘Jung Sunwoo’. Soon, Park Hyojin’s eyes widened too.</p><br/><p>As soon as she hung up after talking in the corner, Park Hyojin urged,</p><br/><p>“What did he say? Why did he call?”</p><br/><p>“He wants to talk to us.”</p><br/><p>Yoon Bora glanced at their chief before replying,</p><br/><p>“What should we do? I told him we’d let him now soon?”</p><br/><p>“What do you mean what do we do? Of course, we need to meet him. Tell him we’ll be out right away.”</p><br/><p>“Wait, then let’s ask the makeup unni to fix our makeup.”</p><br/><p>“What?”</p><br/><p>“It’ll be good to look nice. You never know, right?”</p><br/><p>Yoon Bora took out a hand mirror from her bag and looked at her reflection.</p><br/><p>Soon, they went to their makeup artist.</p><br/><p>*</p><br/><p>“Here are the drinks you ordered.”</p><br/><p>The employee placed the teacup on the table and glanced at Jung Sunwoo. Her curious gaze also brushed back Park Hyojin and Yoon Bora who were sitting across from him. As soon as she left the private room, they could hear her conversation with her coworker.</p><br/><p>“Is he? Is he?”</p><br/><p>“Yeah, I think he’s Jung Sunwoo. His face looks exactly like his pictures.”</p><br/><p>“Then, are the girls who came with him celebrities? They were pretty.”</p><br/><p>“There was an article about him doing a show with a girl group. Maybe they are members?”</p><br/><p>“Hey, should we ask for a picture when they leave? I think they’ll be famous once the show airs.”</p><br/><p>Park Hyojin and Yoon Bora brightened when they called them pretty but immediately frowned. They heard this multiple times a day after Pretty Girls became a hot topic. ‘Aren’t they Pretty Girls?’ ‘No, they left the group.’ ‘Why did they do that? Fools.’</p><br/><p>They heard this repeatedly, but it still lit a fire in their stomachs whenever they heard it.</p><br/><p>Yoon Bora gulped down the tea with a chamomile flower floating on it. Then she flinched before placing her cup down. Jung Sunwoo was observing them. Staring at them.</p><br/><p>Yoon Bora picked up a tissue and calmly wipes the corners of her lips.</p><br/><p>Sitting beside her, Park Hyojin looked like the most refined, elegant person in the world.</p><br/><p>However, their touching shoulders were stiff with tension. They overworked their brains thinking on their way here. What was so important that he had to talk to them face-to-face.</p><br/><p>Maybe he would ask them to appear on Making Film?</p><br/><p>Or, maybe, just maybe…</p><br/><p>He was trying to gather all the members to make Pretty Girls whole again?</p><br/><p>Although Chief Lee Taeshin and the lawyer they secretly met shook their heads, maybe this person had a way. Maybe he could end their contract with NK Entertainment and bring them over to W&amp;U. Such expectations slowly budded.</p><br/><p>Soon, Jung Sunwoo lightly tapped the table with his thumb.</p><br/><p>“I called you both because I wanted to talk to you in person.”</p><br/><p>“Look at us, no, please speak.<sup>{1}</sup> You can also talk more casually.”</p><br/><p>“Is that okay?”</p><br/><p>Although he had a fierce gaze, that was because he simply looked that way. His voice was as gentle and soft as a kitten’s paws. Thinking that there was no doubt it would be something good, Yoon Bora sipped her tea with a smile.</p><br/><p>Jung Sunwoo smiled as well as he asked,</p><br/><p>“Have you ever been sued before?”</p><br/><p><sup>{1}</sup> This is a bit awkward, but a more literal translation of Jung Sunwoo’s line would have been “I called you to see you and talk.” Which makes her slip up more reasonable.</p>\n</div>\n<div style=\"max-width: 870px;margin: 5px auto;background: repeating-linear-gradient( 45deg, #fff6cc, #fff6cc 5px, #f3ecc7 5px, #f3ecc7 10px );\">\n<!-- Composite Start -->\n<div id=\"M562762ScriptRootC864255\">\n</div>\n<script async=\"\" src=\"https://jsc.mgid.com/m/e/media.boxnovel.org.864255.js\"></script>\n<!-- Composite End -->\n</div>\n<hr class=\"chr-end\"/>\n<div class=\"chr-nav\" id=\"chr-nav-bottom\">\n<div class=\"btn-group\">\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/top-management-chapter-159\" id=\"prev_chap\" title=\"Chapter 159\">\n<span class=\"glyphicon glyphicon-chevron-left\"></span>\n<span class=\"hidden-xs\">Prev Chapter</span>\n</a>\n<button class=\"btn btn-success chr-jump\" type=\"button\">\n<span class=\"glyphicon glyphicon-list-alt\"></span>\n</button>\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/top-management-chapter-161\" id=\"next_chap\" title=\"Chapter 161\">\n<span class=\"hidden-xs\">Next Chapter</span>\n<span class=\"glyphicon glyphicon-chevron-right\"></span>\n</a>\n</div>\n</div>\n<div class=\"text-center\">\n<button class=\"btn btn-warning\" data-chr-id=\"201432\" id=\"chr-error\" type=\"button\"><span class=\"glyphicon glyphicon-exclamation-sign\"></span> Report chapter\r\n                        </button>\n</div>\n<div class=\"bg-info text-center visible-md visible-lg box-notice\">\r\n                        Tip: You can use left, right, A and D keyboard keys to browse between chapters.\r\n                    </div>\n</div>"}