{"title": "Chapter 167", "id": 167, "volume": 2, "url": "http://boxnovel.org/top-management-chapter-167", "volume_title": "Volume 2", "body": "<h1>Chapter 167</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><header class=\"entry-header\"></header></p><div class=\"entry-content content\"><br/><p>Chapter 167: Making Film, The Sky was Raining with Bait (4)</p><br/><p>TL: emptycube / ED: Isleidir</p><br/><p>“One didn’t turn off? Why did I forget to turn that off?”</p><br/><p>Only one video was playing in the corner of the TV.</p><br/><p>Seeing this, Im Seoyoung’s reaction was a simple question. However, once the video began filling the screen, Im Seoyoung began to become flustered. Not knowing that a camera was rolling, Im Seoyoung freely moved around the living room.</p><br/><p>She looked back at me with wide eyes. They were trembling.</p><br/><p>“What is it, oppa? Why is that still playing? Did something go wrong in editing? Is it a broadcast accident?”</p><br/><p>“No way. Producer Yoo spent all night editing this part.”</p><br/><p>“Huh? Why would she when I’m the only one… What did I do that day?”</p><br/><p>She mumbled the date as though she was trying to recall what she did.</p><br/><p>During this time, the Im Seoyoung on TV pressed the remote. The same TV turned on in the screen. It was a rerun of Royal Family. It was a scene with Lee Songha’s character, Lee Sohee the sassy top star.</p><br/><p>The Im Seoyoung in reality jolted up from her spot. Then she shook me since I was holding the remote.</p><br/><p>“Le-let’s watch something else!”</p><br/><p>“We need to monitor this. It’s only begun.”</p><br/><p>“We don’t have to watch this part! It’s harmful! Oppa, save me!”</p><br/><p>“You’re alive.”</p><br/><p>“Snake! So coldhearted! You have no sympathy!”</p><br/><p>Giving up on convincing me, Im Seoyoung looked at the other members. She looked like she wanted to get them on her side, but the three of them were happily watching the TV. Im Seoyoung grabbed Lee Songha’s shoulders.</p><br/><p>“Let’s go, Songha! I’ll buy you braised pigs’ feet!”<sup>{1}</sup></p><br/><p>“Braised pigs’ feet?”</p><br/><p>Lee Songha’s eyes shined.</p><br/><p>“Yeah, pigs’ feet!”</p><br/><p>“I already ordered that. Why is it taking so long?”</p><br/><p>Im Seoyoung stomped her feet at my words.</p><br/><p>“Damn it! If you’re going to watch it, you’ll have to step over me!”</p><br/><p>Spreading her arms out like a stingray, she rushed towards the TV. Then she was dragged back in three seconds. LJ had grabbed her back. She instantly rolled her on the rug and sat on her. She was like a pro-wrestler.</p><br/><p>Im Seoyoung whined as she hit the rug.</p><br/><p>The TV speakers began playing Im Seoyoung’s voice.</p><br/><p>{How can you not recognize me because I’m wearing sunglasses? Are you blind? My chest, legs, and even my toes scream Lee Sohee! Do you think there’s such a work of art anywhere else? Look! Look at me!}</p><br/><p>It was Lee Sohee’s line.</p><br/><p>Royal Family’s scene with Lee Sohee showed up as a reference as the broadcast continued to show Im Seoyoung following her lines. She even lifted her smooth legs up with such vigor and began wiggling her toes.</p><br/><p>Her legs were elegant, and her terrible acting skills exceeded the realm of arts.</p><br/><p>She followed a few more of Lee Sohee’s lines before fanning herself. Maybe it was because she put her all into acting or because she was embarrassed by Lee Sohee’s lines, but her round face had become red.</p><br/><p>Im Seoyoung, currently sat on by LJ, hastily made an excuse.</p><br/><p>“I just tried it to see what it felt like!”</p><br/><p>At the same time, the same voice resounded out the speakers.</p><br/><p>{This is much harder than Cat Guardian Ghost. I wonder if she kept any of the Alive scripts?}</p><br/><p>“Don’t do this to me! Just let me die in peace!”</p><br/><p>Im Seoyoung wailed.</p><br/><p>Lee Songha shuffled on her knees and approached her.</p><br/><p>“Unni, I have a lot of Alive scripts…”</p><br/><p>“No! That’s not it… Ahhhh!”</p><br/><p>Im Seoyoung flailed her limbs crazily. The Im Seoyoung on TV brought out a stack of papers and a notebook from her room. The papers were sheet music.</p><br/><p>The Im Seoyoung in reality stretched her trembling hand towards Lee Taehee.</p><br/><p>“Uh, unni, why don’t we turn the TV off and have some beer?”</p><br/><p>“Seoyoung.”</p><br/><p>“I’ll be a great drinking friend today.”</p><br/><p>“I can’t hear the TV.”</p><br/><p>Lee Taehee, who sat up properly before anyone knew, said,</p><br/><p>“It’s cute.”</p><br/><p>“No! Unni, your words have no credibility!”</p><br/><p>“Why?”</p><br/><p>“You’re an old grandpa who’ll chuckle at whatever your grandchild does!”</p><br/><p>Im Seoyoung despaired as she buried her head in her hands.</p><br/><p>At this time, the Im Seoyoung on TV was drawing musical notes in her notebook. She was writing a song. She became so immersed in it that she even skillfully dancing to it, but it was putting pearls on a pig. Her song was more suited for a children’s dance routine.</p><br/><p>The show then showed Lee Taehee working in W&amp;U’s producer’s room.</p><br/><p>It then returned back to Im Seoyoung, She nodded her head in satisfaction after finishing her song.</p><br/><p>{It’s not bad. I think it’s quite good even.}</p><br/><p>Next, she put rings on her ten fingers, which she doesn’t do normally, as she ran around the room rapping. Producer Yoo Sooyoung heartlessly inserted a scene of LJ rapping as well.</p><br/><p>The real Im Seoyoung flopped on the floor.</p><br/><p>If they took out all the inserted scenes, Im Seoyoung’s one-man show didn’t last long, but it was more than enough to wear her out. Im Seoyoung was covering her face while LJ sat on her.</p><br/><p>LJ tickled her by lightly poking her sides.</p><br/><p>“Hey, you look like you have fun alone? So that’s why you don’t go out often.”</p><br/><p>“Don’t talk to a corpse, you hoodlum.”</p><br/><p>Im Seoyoung said gloomily as she pushed LJ away. LJ allowed herself to be pushed off. Im Seoyoung got up and glanced at the TV. The screen had changed to show the Pretty Girls members.</p><br/><p>Like she was seeing a retreating enemy, Im Seoyoung let out a sigh of relief.</p><br/><p>“How are the reactions, oppa?”</p><br/><p>“They’re good.”</p><br/><p>I immediately answered.</p><br/><p>The majority of the posts that viewers uploaded while watching the broadcast was positive. The broadcast maintained the image that they were a talented girl group by showing inserts of Lee Taehee, Lee Songha, and LJ while showing Im Seoyoung off in an entertaining way.</p><br/><p>There were quite a few posts asking who she was.</p><br/><p>Whenever they popped up, fans replied that she was ‘Im Seoyoung’.</p><br/><p>Im Seoyoung shrugged her round shoulders.</p><br/><p>“That’s good then.”</p><br/><p>“You looked like you were about to die just moments ago though?”</p><br/><p>LJ asked.</p><br/><p>“Would you have wanted to show your dark past in front of your members?!”</p><br/><p>Im Seoyoung shouted before quickly laughing.</p><br/><p>“Well, that’s that. Viewers’ reactions are the most important. It’s wonderful if the viewers enjoyed it and our popularity increases. I’m been in charge of Neptune’s entertainment appearances for four years now, you know? Do you think I’m the type to get shocked by a hidden camera? My job’s making people laugh.”</p><br/><p>She calmly said before glancing at me.</p><br/><p>“Still, you should have told me! So that I could prepare my heart before watching it!”</p><br/><p>“Sorry, I wanted to, but I had my reasons.”</p><br/><p>“Reasons?”</p><br/><p>Im Seoyoung asked in surprise.</p><br/><p>“Also, your job wasn’t to make people laugh.”</p><br/><p>“Huh?”</p><br/><p>“Your role. It wasn’t to make people laugh this time.”</p><br/><p>“Then what was it?”</p><br/><p>“Hmm, moving their hearts?”</p><br/><p>I said in a quiet voice. Then I turned my gaze. Im Seoyoung’s surprised gaze followed mine. The TV showed the living room once more. Im Seoyoung was hurriedly cleaning with her phone against her ear.</p><br/><p>{Pretty Girls are coming? But I’m the only one home right now.}</p><br/><p>Seeing this, Im Seoyoung’s face became pale.</p><br/><p>*</p><br/><p>I watched the screen.</p><br/><p>I roughly knew what was going to happen because Producer Yoo Sooyoung told me. However, that was it. I didn’t see the recording or checked the edited content.</p><br/><p>I still didn’t know what exactly happened that day.</p><br/><p>On screen, Im Seoyoung put her all in cleaning after hanging up her phone call with me. Soon, the doorbell rang. The visitors were obviously the Pretty Girls members. Although they had met a couple times before, their expressions were stiff as though it was a bit awkward for them to meet their sunbae.</p><br/><p>{These are side dishes my mom sent over. I heard that you also lived in a residence so she sent us our share and two more. Umm, if you plan on eating, you…}</p><br/><p>Oh Yeondu handed her an eco-friendly bag.</p><br/><p>Im Seoyoung readily accepted it.</p><br/><p>{That’s great! We have a food god here so these will be eaten really quickly! Sit down and have some drinks. We have a lot here. Although I don’t know where they are, there should definitely be some if we look around.}</p><br/><p>{Can we even though it’s not a filming day for us? There are cameras.}</p><br/><p>{I turned all the cameras off so it’s fine!}</p><br/><p>Im Seoyoung invited the girls in with a bright smile.</p><br/><p>The next scene was a tearful one. Maybe hearing that the cameras were off made them relax or Im Seoyoung’s warm, friendly attitude warmed their hearts, but they each held a roll of toilet paper as they cried and hiccuped.</p><br/><p>Then, frightened, Im Seoyoung comforted them.</p><br/><p>{What’s wrong? Huh? Don’t cry. You’re going to make me cry!}</p><br/><p>{I’m so-wwy. I keep thinking about it after hearing what you said…!}</p><br/><p>{We’ll be going now. Sorry.}</p><br/><p>{Hey, hey! How can you go like this? You need to stop crying first. Wh-what did you think about?}</p><br/><p>Im Seoyoung sat the girls, who were getting up while sobbing, back down.</p><br/><p>{Mean comments? Were there mean comments in articles?}</p><br/><p>{N-no. That’s not it. It’s because of the dregs.}</p><br/><p>{What? Dregs? What do you mean?}</p><br/><p>Yoon Sol replied, but it wasn’t a human language.</p><br/><p>Oh Yeondu and Lee Hwain looked at each other before barely managing to continue.</p><br/><p>{The president said that to us. That only the dregs remained.}</p><br/><p>{What could he do with them?}</p><br/><p>{We are trying hard to prove that we aren’t dregs, but we keep thinking about those words all of a sudden sometimes. Even though something incredible is happening, even though my mom and the chief have high hopes for us, I’m scared we’ll disappoint them.}</p><br/><p>{It looks like Jae unni isn’t returning because she doesn’t want to be in the same team as us.}</p><br/><p>{Don’t talk about Jae unni! It makes me want to see her…!}</p><br/><p>Although I called them goldfish as a joke, they were really about to turn the house into an aquarium.</p><br/><p>Oh Yeondu rubbed her tear-covered face with tissues.</p><br/><p>{Sorry. You tell us a lot of good things and help us, but we are making you troubled by crying. We’ll make sure this doesn’t happen again. We’ll work harder to be more like you… So you’re my role model…!}</p><br/><p>Listening to their gibberish, Im Seoyoung bit her lip.</p><br/><p>Her eyes, which seemed like they could cry at any moment after sympathizing with the girls, became clear.</p><br/><p>{You aren’t dregs. I’m very envious of you.}</p><br/><p>{Huh?}</p><br/><p>{Sunwoo oppa personally went to get you. That’s really something I envy. I’ve never had that happen to me. Our company sent Sunwoo oppa to us, and I was fortunate enough to be in that team.}</p><br/><p>The Pretty Girls members were taken aback, and their mouths were agape.</p><br/><p>Although it was slightly teary, she tried to keep her voice calm as she continued,</p><br/><p>{Sunwoo oppa persuaded Songha to try acting and read the script with her overnight. After hearing Taehee unni’s unfinished song, he worked all night and pushed for it to be the title track. I tried all sorts of things, but nothing never happened to me.}</p><br/><p>Im Seoyoung coughed awkwardly.</p><br/><p>Then she curled up and placed her chin on her knees.</p><br/><p>{I’m not confident all day like LJ, and I quietly read the mood.}</p><br/><p>{S-sunbae, you’re really great at dancing, singing, and do well on entertainment shows! When Neptune was unknown, you went to various entertainment shows…!}</p><br/><p>{That was in the past. But right now, I’m sort of stuck in the middle.}</p><br/><p>Im Seoyoung rubbed her neck.</p><br/><p>{Other members get personal schedules on their own, but Sunwoo oppa has to look around to schedule mine. If you are the dregs of Pretty Girls, then I’m the dregs of my team right now.}</p><br/><p>{N-no, you’re not! I think you are amazing!}</p><br/><p>Tears now gone from their eyes, the Pretty Girls members waved their hands in denial.</p><br/><p>Seeing them not know what to do, Im Seoyoung smiled slightly.</p><br/><p>{It’s good if you thought that way. It’s was worth working hard like a swan.<sup>{2}</sup>}</p><br/><p>{Sunbae…}</p><br/><p>{Anyways, if you think about being called dregs, then think about me. Although I’m like this inwardly, after working so hard, I got hoobaes like you who consider me as their role model. So don’t miss this chance and continue working hard.}</p><br/><p>Im Seoyoung smiled brightly again.</p><br/><p>Her voice was bright but also slightly sad.</p><br/><p>{Once some time passes, things will get better for you.}</p><br/><p>The gazes glued to the screen turned around.</p><br/><p>It wasn’t just me. We were all looking at Im Seoyoung.</p><br/><p>Amidst our gazes, Im Seoyoung lifted her pale face.</p><br/><p><sup>{1}</sup> Common staple in Korea, commonly eaten at night and/or with alcohol.</p><br/><p><sup>{2}</sup> Referring to how we only see the grace and poise of a swan swimming in a lake and not all the hard work their webbed feet put into swimming.</p>\n</div>\n<div style=\"max-width: 870px;margin: 5px auto;background: repeating-linear-gradient( 45deg, #fff6cc, #fff6cc 5px, #f3ecc7 5px, #f3ecc7 10px );\">\n<!-- Composite Start -->\n<div id=\"M562762ScriptRootC864255\">\n</div>\n<script async=\"\" src=\"https://jsc.mgid.com/m/e/media.boxnovel.org.864255.js\"></script>\n<!-- Composite End -->\n</div>\n<hr class=\"chr-end\"/>\n<div class=\"chr-nav\" id=\"chr-nav-bottom\">\n<div class=\"btn-group\">\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/top-management-chapter-166\" id=\"prev_chap\" title=\"Chapter 166\">\n<span class=\"glyphicon glyphicon-chevron-left\"></span>\n<span class=\"hidden-xs\">Prev Chapter</span>\n</a>\n<button class=\"btn btn-success chr-jump\" type=\"button\">\n<span class=\"glyphicon glyphicon-list-alt\"></span>\n</button>\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/top-management-chapter-168\" id=\"next_chap\" title=\"Chapter 168\">\n<span class=\"hidden-xs\">Next Chapter</span>\n<span class=\"glyphicon glyphicon-chevron-right\"></span>\n</a>\n</div>\n</div>\n<div class=\"text-center\">\n<button class=\"btn btn-warning\" data-chr-id=\"201447\" id=\"chr-error\" type=\"button\"><span class=\"glyphicon glyphicon-exclamation-sign\"></span> Report chapter\r\n                        </button>\n</div>\n<div class=\"bg-info text-center visible-md visible-lg box-notice\">\r\n                        Tip: You can use left, right, A and D keyboard keys to browse between chapters.\r\n                    </div>\n</div>"}