{"title": "Chapter 161", "id": 161, "volume": 2, "url": "http://boxnovel.org/top-management-chapter-161", "volume_title": "Volume 2", "body": "<h1>Chapter 161</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><header class=\"entry-header\"></header></p><div class=\"entry-content content\"><br/><p>Chapter 161: Celebrities Live Off their Image (4)</p><br/><p>TL: emptycube / ED: Isleidir</p><br/><p>“Euk!”</p><br/><p>Yoon Bora coughed after unintentionally swallowing the flower in her tea.</p><br/><p>Park Hyojin understood a bit faster. Her eyes moved quickly under her lashes.</p><br/><p>“Sue? Did you ask if we’ve ever been sued?”</p><br/><p>“Yeah, whether it’s for defamation or damages.”</p><br/><p>“Never. And we never did anything to warrant it.”</p><br/><p>“Okay.”</p><br/><p>Jung Sunwoo placed both his arms on the table. His hands slowly clasped together under his rolled-up dress shirt sleeves. Park Hyojin unconsciously leaned back. She somehow felt like her neck was held between his two hands.</p><br/><p>“But, looking at it, it seems like an accident like that could occur.”</p><br/><p>Jung Sunwoo said with an unpleasant expression.</p><br/><p>His still gentle voice no longer seemed so gentle.</p><br/><p>Having understood the situation, Yoon Bora made an innocent expression.</p><br/><p>“I don’t know what you’re talking about.”</p><br/><p>“Did your company talk about making a media play?”</p><br/><p>They coughed. This time, it really felt like they were suffocating.</p><br/><p>***</p><br/><p>So they did.</p><br/><p>I took a sip of my peppermint tea as I observed them. Although I didn’t say much, their eyes were trembling, and their breaths became rough. Especially Yoon Bora, it looked like she would need a respirator.</p><br/><p>If someone else saw this situation, they would think that I made them sign a slave contract and was selling them.</p><br/><p>“… They did.”</p><br/><p>Park Hyojin nodded.</p><br/><p>“The chief said that doing an interview would be a good chance at getting our names out there.”</p><br/><p>“He said it was only a media play to win over the public’s sympathy. C-can we still be sued?”</p><br/><p>Yoon Bora asked with a frightened expression.</p><br/><p>“There’s no problem if it’s a normal interview. Of course, there wouldn’t be. But if you try too hard and say something you shouldn’t, then that’ll be a problem. Like if you mentioned investors or drinking parties.”</p><br/><p>“We-we won’t say things like that. We aren’t planning on saying anything bad. Really.”</p><br/><p>Yoon Bora jumped up and down as she shook her head.</p><br/><p>Was this an act or not?</p><br/><p>What were they thinking when they mentioned it to a program writer?</p><br/><p>Was it part of a cunning, elaborate plan? Or something they said without thinking? If not, they might have let it slip, and the writer could have thought she hit jackpot and put it in the show.</p><br/><p>I didn’t think NK Entertainment would force them to talk about the drinking parties if they were really just trying to garner sympathy as they said. If they intentionally tried to pick a fight with W&amp;U, they would lose more than they would benefit.</p><br/><p>Were these two cunning or stupid?</p><br/><p>It didn’t matter.</p><br/><p>The incident happened because of that interview and being stupid didn’t clear you of your crimes.</p><br/><p>Although I told Chief Lee Taeshin that it was for the worst-case scenario, I had planned to lock their mouths up from the beginning. I still hadn’t fully recovered from my distrust in humanity caused by the traitor.</p><br/><p>This was a problem of whether a person lived or died. There was no need to leave any room for uncertainty.</p><br/><p>Well, there would be a difference in whether I used polite words or threatening ones.</p><br/><p>I gently smiled and said,</p><br/><p>“Then that’s a relief. I was worried because I had heard rumors that NK Entertainment was planning on doing something like that as noise marketing. It seems the rumor was exaggerated. You must have been shocked when I suddenly brought up suing you. I’m sorry.”</p><br/><p>“Th-that’s okay. I was a bit shocked.”</p><br/><p>“Who said something like that? The person must really hate us.”</p><br/><p>“There’s no need to worry. We will never do something like that.”</p><br/><p>“Yes, no need to worry.”</p><br/><p>Yoon Bora and Park Hyojin confirmed.</p><br/><p>Then the same voices rang in my ear.</p><br/><p>-Tell them to sue us.</p><br/><p>-Hyojin!</p><br/><p>-People are flooding us with sympathy so it’ll be great for us if you sue. People will take even more pity on us. They’ll say that a big company like W&amp;U is bullying powerless people like us.</p><br/><p>-We’ll just pay.</p><br/><p>What kind of crazy…</p><br/><p>Their conversation was so absurd that I belatedly realized that I was in the future. Although there was a bit of static, it wasn’t so bad that I couldn’t distinguish their voices. Yoon Bora, Park Hyojin, and Chief Lee Taeshin’s voice played from the earphone in my ear.</p><br/><p>The jack was plugged into my phone. Was this an audio recording?</p><br/><p>For a while, all I could hear was Chief Lee Taeshin’s distressed pants. He seemed to be having trouble breathing as it became more ragged.</p><br/><p>-How can… How can you still… How could you do this to Jae?!</p><br/><p>-It’s not like we said her name. It’s the netizens who looked into it.</p><br/><p>-We are powerless, so we have to find a way to be famous. Jae unni has a lot of people helping her. She even has you. W&amp;U is going to respond and cover the whole thing up since it’s not like she really did do any sexual favors.</p><br/><p>It felt like someone popped my head open and poured ice into it. My brain froze.</p><br/><p>My future self took the earphones out and turned his gaze. Lee Kwanwoo was sitting next to me. He had a very serious expression.</p><br/><p>“Kwanwoo, I’ll send this file to Team Leader Park, so you go stay with the PR Team.”</p><br/><p>“Understood. Where will you be going?”</p><br/><p>“Pretty Girls’ residence.”</p><br/><p>“There probably won’t be anything. There are a lot of people looking after Jung Jae right now.”</p><br/><p>So we did find her. Jung Jae.</p><br/><p>As I patted my chest in relief, my phone rang. It was Oh Yeondu of Pretty Girls.</p><br/><p>“Did something happen?”</p><br/><p>-Ch-chief, chief. Jae unni. Jae unni.</p><br/><p>Her voice creaked with fear. I also heard people crying and screaming.</p><br/><p>I had a bad feeling.</p><br/><p>Someone took the phone from Oh Yeondu.</p><br/><p>-I’m Lee Suji. Jae just sli-slit her wrist!</p><br/><p>I returned to the present.</p><br/><p>Damn it. I downed the peppermint tea in an instant. Thinking about the future I saw before and the one just now left a bad feeling. It felt like my entire body was frozen. I licked my dry lips when a glass of water slid towards me.</p><br/><p>“Please have some water if you’re thirsty.”</p><br/><p>“Should we ask for the menu again?”</p><br/><p>Park Hyojin and Yoon Bora asked in front of me.</p><br/><p>Their voices were pleasant, unlike the cold voices I heard just before.</p><br/><p>I laughed. I used human words all this time for nothing.</p><br/><p>When my foe were animals.</p><br/><p>“Some trash might try to talk or push you into doing it.”</p><br/><p>“Pardon?”</p><br/><p>“’Our previous company took a member to a drinking party with investors. We left because we didn’t want to do something like that.’ If you say something like that, it’ll definitely be a hot topic and the public will sympathize with you. Even if W&amp;U sues you, you could consider it as an opportunity.”</p><br/><p>Taken aback, they exchanged glances with each other. Yoon Bora gulped a couple time. Were her cunning desires fanning the flames right now?</p><br/><p>Park Hyojin was the first to return to her senses.</p><br/><p>“Chief, we said that something like that will not…”</p><br/><p>“I’m only saying this so that you remember my words if you are ever faced with a decision like this. If you make the wrong decision and this project fails, we’ll be taking very aggressive measures. Our PR Team will make you out to be complete bitches in the public’s eyes.”</p><br/><p>“Wh-what…!”</p><br/><p>I leaned forward.</p><br/><p>“Do you think you’ll be able to continue as a celebrity, no, even have a social life when it gets out that you pretended not to know that a member was being dragged to drinking parties since you thought you could become famous if she was able to nab a sponsor?”</p><br/><p>Their faces paled like they had been dunked in water a few times.</p><br/><p>After shifting her eyes back and forth, Yoon Bora asked,</p><br/><p>“W-who said that? Was it Chief Lee? D-does he have any proof?”</p><br/><p>“Hmm, I don’t know.”</p><br/><p>Yoon Bora flinched at my smile.</p><br/><p>Of course, we didn’t have any proof. But, thinking like that, there was also no proof that Jung Jae went to drinking parties either. In a dirty fight chipping away at each other’s image, the victor would be decided by whose PR Team was more skilled and well connected.</p><br/><p>Their faces gradually paled after every word I spoke.</p><br/><p>Park Hyojin, who seemed to be wracking her brain, looked up.</p><br/><p>“We really won’t do anything like that, so don’t scare us like that.”</p><br/><p>“That’s right. It seems like you’re threatening us.”</p><br/><p>Yoon Bora pouted, looking like she was about to cry.</p><br/><p>I carefully examined their expression. Then a smile hung on my lips again.</p><br/><p>In a voice that was as friendly as possible, I said,</p><br/><p>“I don’t want to scare you like this, but this could be a very serious problem. All sorts of things happen in this industry. Although I think that the rumors I heard were nonsense, I thought it would be good to confirm with you.”</p><br/><p>They smile awkwardly.</p><br/><p>Just as the tense mood seemed to relax a little, Yoon Bora, who had been carefully reading my expression, couldn’t hold her words back any longer.</p><br/><p>“Umm, chief. Is there really no way we can rejoin Pretty Girls?”</p><br/><p>There could be a way. Perhaps.</p><br/><p>If things went as expected, we would have asked them to appear on Making Film. If they had sincerely supported the other members like Chief Lee Taeshin said they would, then Producer Yoo Sooyoung would have packaged it into a warm, heartrending story.</p><br/><p>Then, the viewers might take pity on the dispersed Pretty Girls members, and their opinion that the Pretty Girls should be whole again could get large enough that NK Entertainment couldn’t ignore it.</p><br/><p>If things played out that way, then perhaps.</p><br/><p>A deal that benefited both NK Entertainment and me could have been made.</p><br/><p>Maybe, but that would never happen.</p><br/><p>“I don’t think so.”</p><br/><p>“Ah…”</p><br/><p>“Instead, I looked into NK Entertainment’s group a little. The one you’re in.”</p><br/><p>The two who were visibly disappointed quickly raised their heads.</p><br/><p>“I think it was alright. I think the group’s image matches you better than Pretty Girls.”</p><br/><p>The more I spoke, the more their faces swelled with anticipation.</p><br/><p>In a voice filled with certainty, I hammered in the final nail.</p><br/><p>“I think you’ll do well there.”</p><br/><p>“Re-really?”</p><br/><p>No.</p><br/><p>Just empty drivel.</p><br/><p>*</p><br/><p>After finishing things up, I went to find Chief Lee Taeshin. He was looking for Jung Jae in Yeouido with a cameraman. I picked them up, and as soon as they got in the minivan, Chief Lee Taeshin cautiously asked,</p><br/><p>“How did the meeting…”</p><br/><p>“Let’s talk about that later. Do you happen to know Lee Suji’s number?”</p><br/><p>“Pardon? Suji?”</p><br/><p>Chief Lee Taeshin asked back, confused.</p><br/><p>“The one who left Pretty Girls with Kang Suran. Ah, there isn’t someone else named Lee Suji that Jung Jae knows, right?”</p><br/><p>“Th-that’s probably right. But I already called her multiple times.”</p><br/><p>Chief Lee Taeshin opened his eyes.</p><br/><p>I entered her address and began to drive as he tried to call her.</p><br/><p>The future I saw back then kept floating around in my mind. The last person who talked about Jung Jae definitely called herself Lee Suji. I heard she completely left the entertainment world after leaving Pretty Girls. Did they say she was a university student now?</p><br/><p>It felt odd that she was at Pretty Girls’ residence for some reason.</p><br/><p>Although she could have come over because she was worried about Jung Jae with all the bad press, it was better to be safe. I also didn’t have any other hints to go off on.</p><br/><p>We soon arrived at Lee Suji’s home in Mapo. Having called ahead, Lee Suji was waiting for us on the street. Even from afar, I could see the concern on her pretty face.</p><br/><p>Chief Lee Taeshin almost rolled out the minivan and asked her about Jung Jae’s whereabouts. Lee Suji shook her head with a troubled look.</p><br/><p>“You really didn’t hear from her? I’m just really worried about her, Suji. If you know anything…”</p><br/><p>“Then, of course, I’ll contact you. Last time, last last time, and even before that, I told you that it’s been a while since I’ve heard from Jae. You said that she hasn’t gone missing and even called her parents. You don’t need to wo-“</p><br/><p>“Do you really not know?”</p><br/><p>I cut in.</p><br/><p>It seemed she recognized my face as Lee Suji looked shocked like she had seen a ghost.</p><br/><p>“Chief Lee Taeshin might be sued at this rate.”</p><br/><p>“Sorry?”</p><br/><p>“You know that we are preparing for Making Film, correct?”</p><br/><p>“Ye-yes.”</p><br/><p>“We need to start recording and practicing choreography, but Pretty Girls and Chief Lee Taeshin stubbornly said they were going to wait for Ms. Jung Jae and are wasting time. We are already way behind schedule. The broadcast might completely fall through.”</p><br/><p>Lee Suji was so shocked that she didn’t know what to do, but even Chief Lee Taeshin and the cameraman were at a loss for words. I waved my hand and continued,</p><br/><p>“We already started filming a few scenes, and if we are met with a lawsuit asking for compensation, Chief Lee Taeshin might be fully responsible. Chief Lee is already in debt, and at this rate, he could actually go to prison. I think Ms. Jung Jae should know about this situation.”</p><br/><p>I took a step closer and asked again,</p><br/><p>“Do you really not know where she is?”</p>\n</div>\n<div style=\"max-width: 870px;margin: 5px auto;background: repeating-linear-gradient( 45deg, #fff6cc, #fff6cc 5px, #f3ecc7 5px, #f3ecc7 10px );\">\n<!-- Composite Start -->\n<div id=\"M562762ScriptRootC864255\">\n</div>\n<script async=\"\" src=\"https://jsc.mgid.com/m/e/media.boxnovel.org.864255.js\"></script>\n<!-- Composite End -->\n</div>\n<hr class=\"chr-end\"/>\n<div class=\"chr-nav\" id=\"chr-nav-bottom\">\n<div class=\"btn-group\">\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/top-management-chapter-160\" id=\"prev_chap\" title=\"Chapter 160\">\n<span class=\"glyphicon glyphicon-chevron-left\"></span>\n<span class=\"hidden-xs\">Prev Chapter</span>\n</a>\n<button class=\"btn btn-success chr-jump\" type=\"button\">\n<span class=\"glyphicon glyphicon-list-alt\"></span>\n</button>\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/top-management-chapter-162\" id=\"next_chap\" title=\"Chapter 162\">\n<span class=\"hidden-xs\">Next Chapter</span>\n<span class=\"glyphicon glyphicon-chevron-right\"></span>\n</a>\n</div>\n</div>\n<div class=\"text-center\">\n<button class=\"btn btn-warning\" data-chr-id=\"201434\" id=\"chr-error\" type=\"button\"><span class=\"glyphicon glyphicon-exclamation-sign\"></span> Report chapter\r\n                        </button>\n</div>\n<div class=\"bg-info text-center visible-md visible-lg box-notice\">\r\n                        Tip: You can use left, right, A and D keyboard keys to browse between chapters.\r\n                    </div>\n</div>"}