{"title": "Chapter 182", "id": 182, "volume": 2, "url": "http://boxnovel.org/top-management-chapter-182", "volume_title": "Volume 2", "body": "<h1>Chapter 182</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><header class=\"entry-header\"></header></p><div class=\"entry-content content\"><br/><p>Chapter 182: Those who stab you in the back (1)</p><br/><p>TL: emptycube / ED: Isleidir</p><br/><p>My steps abruptly halted.</p><br/><p>A few steps away, Lee Songha was staring up at me and Jung Jae. Our eyes met. I unconsciously put more strength into my toes. I felt like I was walking down a long, dark tunnel alone.</p><br/><p>“Are you okay?”</p><br/><p>I quickly went down the stairs when Lee Songha raised her hand.</p><br/><p>“Don’t come over here.”</p><br/><p>“What?”</p><br/><p>“I broke a glass. Stay there because there are glass shards.”</p><br/><p>She said in her normal voice before scrubbing the marble step with her left high hell. The sound of shattering glass was unpleasant. Lee Songha brushed her hair to the side. Her nicely arranged hair became untidy.</p><br/><p>“I’ll clean it up before someone gets hurt.”</p><br/><p>“Wait. Jae, go tell Kwanwoo about this.”</p><br/><p>Taken aback, Jung Jae, who was on her way down, quickly ran up to the fifth floor.</p><br/><p>I looked back at Lee Songha and asked,</p><br/><p>“Are you hurt anywhere? If it broke, you should have avoided it. Why did you step on it?”</p><br/><p>“I was lost in my thoughts for a second. I’m fine.”</p><br/><p>Lee Songha bent her knees a few times as if to prove it. I examined her leg that extended out from her skirt. Fortunately, I didn’t see any blood… Or so I thought. Her stocking ripped and a strand sprung off. Lee Songha stealthily moved her leg back.</p><br/><p>“I’m not hurt.”</p><br/><p>“Not hurt? First…”</p><br/><p>I trailed off. I heard someone make a fuss downstairs and people began to gather. They were busy trying to get in an extra word to Lee Songha, asking her if she was fine or if she was hurt. Lee Songha pressed her cheeks.</p><br/><p>“I think I had too much champagne. I slipped.”</p><br/><p>“Oh my! It’s good that you didn’t fall!”</p><br/><p>“Ah, if I did, I would have rolled and gracefully gotten up.”</p><br/><p>“What? Roll?”</p><br/><p>“I learned gymnastics while filming Alive.”</p><br/><p>There was no need for me to intervene. She skillfully settled the crowd by explaining the situation and playing it off with a laugh. As expected, she felt unfamiliar. Even though CEO Baek Hansung wasn’t here, she seemed so unfamiliar to me.</p><br/><p>“Songha.”</p><br/><p>I acted before more people gathered.</p><br/><p>“Glass pieces might have gotten into your stockings. Go downstairs and have a closer look.”</p><br/><p>“Yes.”</p><br/><p>Leaving her in Neptune’s care, I cleaned up the broken glass and calmed down the worrying people. I then went down to the second-floor basement. I heard voices in the practice room in the basement, which was dark because people had left early for the party.</p><br/><p>Lee Songha was sitting on the floor, and Im Seoyoung was touching her leg.</p><br/><p>“Hey, you’re lucky you weren’t hurt! How can you throw a glass just because you had nothing else to throw?”</p><br/><p>“I told you. I didn’t throw it, it dropped.”</p><br/><p>Lee Taehee held Lee Songha’s face, who was in denial.</p><br/><p>“Let’s see. Are you drunk?”</p><br/><p>“I guess.”</p><br/><p>Lee Songha pressed her cheek against Lee Taehee’s hand. Im Seoyoung snorted,</p><br/><p>“As if! You, the same girl who drank wild ginseng wine with unni, drunk after a couple glasses of champagne?”</p><br/><p>“The alcohol today is different. You get drunk more easily on days like this.”</p><br/><p>“Don’t you try to sell snake oil! Did your trauma reappear after seeing Son Chaeyoung?”</p><br/><p>“Trauma?”</p><br/><p>Lee Songha slowly rolled the word in her mouth. Then she mumbled,</p><br/><p>“I don’t feel anything when I see Son Chaeyoung anymore. Rather…”</p><br/><p>“Rather? What?”</p><br/><p>Lee Songha shook her head and changed the subject.</p><br/><p>“Ah, I’m drunk. I want to see oppa.”</p><br/><p>“Look.”</p><br/><p>I said while entering the room. At least shoulders flinched.</p><br/><p>“Let me talk with Songha.”</p><br/><p>“Uhh, then should we stand on guard?”</p><br/><p>Im Seoyoung got up.</p><br/><p>“Why would I need you to stand guard?”</p><br/><p>“B-because something might occur that shouldn’t be discovered by others?”</p><br/><p>“Nothing like that’ll happen. We’re just going to talk. Just close the door. Also…”</p><br/><p>“We’ll have a drink from the vending machine.”</p><br/><p>LJ said instead. Her smiling eyes had an impertinent air.</p><br/><p>“There could be people whose imaginations will run wild if we appear by ourselves. Like her.”</p><br/><p>“What about me?!”</p><br/><p>Im Seoyoung and LJ left first, and Lee Taehee closed the door behind her. The practice room became quiet. I examined her leg, devoid of any scratches, and opened my mouth to speak.</p><br/><p>“To be honest, I’m a bit confused.”</p><br/><p>Lee Songha spoke first.</p><br/><p>“I might have thrown it. Since I wanted to.”</p><br/><p>“Because I asked Jae if she wanted acting lessons?”</p><br/><p>“Yes.”</p><br/><p>She frankly replied as her gaze fell to the floor.</p><br/><p>“It made me think of the past. When you asked me if I had any thoughts on acting. Right here, in this practice room. That memory was always vivid like it only happened yesterday, but it suddenly felt like it was such a long time ago. And I thought about Son Chaeyoung.”</p><br/><p>Son Chaeyoung?</p><br/><p>After taking a breath, Lee Songha continued,</p><br/><p>“Because of that… I can understand why Son Chaeyoung hated me.”</p><br/><p>“What?”</p><br/><p>“Do you think she’ll be better than me at acting?”</p><br/><p>She asked in a crumbling voice. Like someone enduring a chill, Lee Songha wrapped her arms around herself. Her fingers holding onto her forearms were white. Tears hung on the corners of her lowered eyelashes.</p><br/><p>My mouth tasted bitter. So much that it was difficult to swallow.</p><br/><p>It was simply a casual suggestion. Just because I happened to remember that people called Jung Jae ‘the Second Lee Songha’ in the future vision I saw in the past. Reporters might have exaggerated because she was the center of a rising girl group, but I was curious if she really had talent in acting.</p><br/><p>If she showed talent after a few lessons, I would foster it, but if not, I would have made her focus on her singing career. I only brought it up to figure that out. Did that sound like a death sentence to Lee Songha?</p><br/><p>“I know I’m weird.”</p><br/><p>Lee Songha whispered like she was making a confession.</p><br/><p>“I’m trying to become normal. Because I can’t become like Son Chaeyoung.”</p><br/><p>Another voice overlapped with hers in my mind.</p><br/><p>CEO Baek Hansung’s voice, which was embedded deep in my mind.</p><br/><p>‘… That’s why most of them depend on something. That could be drugs, alcohol, or the like… Or someone. Make her depend on you. So that she doesn’t turn her gaze to something else.’</p><br/><p>I knew how Lee Songha felt about me. I also knew that it was so complicated and tangled that it would be difficult to explore every aspect of that emotion. Because I played a part in it. Even though I knew she was excessively unconditional and had an obsessive side to her.</p><br/><p>To make her depend and lean on me above all else.</p><br/><p>I licked my dry lips and said,</p><br/><p>“You are different from Son Chaeyoung.”</p><br/><p>“… I wish that was true.”</p><br/><p>Lee Songha raised her head.</p><br/><p>“Oppa, I’ll handle my schedule with another chief from now.”</p><br/><p>The words I was about to say to her were all pushed aside.</p><br/><p>“I know that you are barely managing my schedule. I know, but I keep thinking, ‘only a bit more,’ and it has come this far. You’ll be much busier from now, so you don’t need to take care of my schedule. I’ll stand on my own.”</p><br/><p>Stand on your own?</p><br/><p>“Also, if, from another team… If there’s a chief from Team 2 who wants to work with me, that’s fine too. That’s something I’ll have to experience anyways.”</p><br/><p>She’s fine with me handing her over to another team’s chief?</p><br/><p>Anger suddenly surged. It was so severe that the unpleasantness I had felt until was almost cute. My emotions were so turbulent that I felt sick. I swallowed dryly and rubbed the corner of my lips.</p><br/><p>I was in no position to think Lee Songha’s situation was unique. If I had a champagne flute in my hand right now, it might have shattered into more pieces that Lee Songha’s.</p><br/><p>The suspicions and caution that had accumulated over the past few days finally burst.</p><br/><p>“Did the CEO tell you to do that?”</p><br/><p>“Huh?”</p><br/><p>“Son Chaeyoung’s matter. And now you. Did the CEO order you?”</p><br/><p>My mind was a mess, but the words coming out of my mouth flowed so smoothly that it was surprising.</p><br/><p>Lee Songha blinked her eyes, taken aback.</p><br/><p>“Order?”</p><br/><p>“Or threatened.”</p><br/><p>Threatened.</p><br/><p>Finally spitting out that word, which was dwelling in my mind all this time, my suspicions seemed to grow even larger.</p><br/><p>What kind of person was CEO Baek Hansung? Was he a good person or a bad one?</p><br/><p>My future self said that he became disenchanted with CEO Baek Hansung’s methods and left W&amp;U. He then corrected himself, saying that it would have been better to stay under CEO Baek Hansung. That, in a world full of black-hearted people, a man like him was still grey.</p><br/><p>CEO Baek Hansung, who I had observed until now, was talented and even reliable at times. Also, Son Chaeyoung described him to be someone who tied celebrities under his company by finding their weakness.</p><br/><p>If I became disenchanted with CEO Baek Hansung’s methods, then I…</p><br/><p>“Why do you think that?”</p><br/><p>Lee Songha asked with a strange expression.</p><br/><p>“What did you hear? What I told you last time was really all. What I said to you were purely my own thoughts. There weren’t any threats or anything. Why would the CEO do something so extreme?”</p><br/><p>Why?</p><br/><p>Because Lee Songha grew big enough that people referred to a walking one-person company. Because she grew big enough that CEO Baek Hansung called her W&amp;U’s poster star. There were only three years left on her seven-year exclusive contract, and the CEO and his executives were probably thinking and preparing for the future.</p><br/><p>Also, because CEO Baek Hansung might be someone who was more comfortable with threatening someone than persuading them.</p><br/><p>Like me.</p><br/><p>“You, that photo. The one that was taken with me.”</p><br/><p>“That… photo?”</p><br/><p>Lee Songha abruptly looked shocked like someone who had just been hit. Her torso staggered backwards.</p><br/><p>“If that photo is something that’s holding you down, I can-“</p><br/><p>“No! That photo is ju-just an embarrassing past. It’s not something that can hold me down. It’s something I can simply close my eyes and handle if it ever got released.”</p><br/><p>“Really?”</p><br/><p>“Yes, why are you suddenly worried about that?”</p><br/><p>I repeatedly confirmed it while nodding my head. She didn’t look like she was acting. Was Lee Songha someone who could fool someone, me, like it was nothing? Was I suffering from obsession? Were there really no secret threats I didn’t know?</p><br/><p>Even if that was true, would it continue to be the case?</p><br/><p>My head ached. I was a walking mental ward.</p><br/><p>I sighed and told her,</p><br/><p>“Songha, if something like that ever happens, you need to tell…”</p><br/><p>“Oppa.”</p><br/><p>Lee Songha came closer. In a worried voice, she said,</p><br/><p>“I’m not as good of a person as you think.”</p><br/><p>“What?”</p><br/><p>“Rather than being threatened, I think about threatening others, no, I’m worried that I will. Also, you don’t need to worry about the CEO anymore. I’m not really scared of him anymore.”</p><br/><p>Lee Songha smiled.</p><br/><p>“The only one I’m scared of is you.”</p><br/><p>The moment I heard that, the thread that had been pulled tight for a long while finally snapped.</p><br/><p>*</p><br/><p>It really did seem like we entered summer. It was early in the morning, yet the sun was already out. Lying down and staring at the curtain’s fluttering shadow, I grabbed my phone.</p><br/><p>Reporters, producers, and writers, who didn’t distinguish between night and day, had filled my call history with missed called. I would have checked each one normally, but I pushed them all aside today and called someone. Immediately, I heard a noisy background and a voice.</p><br/><p>-What with the busiest person in the world calling me this early in the morning? Are you getting off work now?</p><br/><p>“No, it’s my day off.”</p><br/><p>-You get days off? (Dad, what is it? Is it his day off? Hasn’t it been a million years since his last one? Let’s tell him to come over if it’s his day off!) You hear them, right? Even the kids are surprised.</p><br/><p>That wasn’t surprising to hear since I had worked hard without taking a breath for a while. I didn’t even know when the last time I rested an entire day without thinking about work was. My friends were talking about how I’ve completely disappeared after telling them to think I went back to mandatory military service.</p><br/><p>-I heard it’ll get easier if you went from a road manager to a chief, but why is it that you get busier by the day? It’s been a while since you’ve gone home too. Do you even have a life? Thirty is just around the corner, yet I haven’t heard that you’re seeing someone. (Dad! I-I also want to say something!)</p><br/><p>Soon, I heard a serious voice from the other side.</p><br/><p>-Uncle! On TV, it said that youth is from your teens to your twenties! You won’t be young next year!</p><br/><p>“Now that you’re all past your ‘cute’ age, you’re gross. Be respectful when talking to me.”</p><br/><p>-Uncle called us gross!</p><br/><p>I heard my brother laugh amidst the quadruplets’ shouts.</p><br/><p>-They are acting like that because they miss you.</p><br/><p>“I’m on my way now.”</p><br/><p>I said while grabbing onto my bed and pulling myself up.</p><br/><p>-You’re coming? You can?</p><br/><p>“Since the project is over, I can take a breather. I need to organize a few things too. About that.”</p><br/><p>-Huh?</p><br/><p>“I have something I want your advice on.”</p><br/><p>-With me? What kind of advice? About life?</p><br/><p>“No, about dating.”</p>\n</div>\n<div style=\"max-width: 870px;margin: 5px auto;background: repeating-linear-gradient( 45deg, #fff6cc, #fff6cc 5px, #f3ecc7 5px, #f3ecc7 10px );\">\n<!-- Composite Start -->\n<div id=\"M562762ScriptRootC864255\">\n</div>\n<script async=\"\" src=\"https://jsc.mgid.com/m/e/media.boxnovel.org.864255.js\"></script>\n<!-- Composite End -->\n</div>\n<hr class=\"chr-end\"/>\n<div class=\"chr-nav\" id=\"chr-nav-bottom\">\n<div class=\"btn-group\">\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/top-management-chapter-181\" id=\"prev_chap\" title=\"Chapter 181\">\n<span class=\"glyphicon glyphicon-chevron-left\"></span>\n<span class=\"hidden-xs\">Prev Chapter</span>\n</a>\n<button class=\"btn btn-success chr-jump\" type=\"button\">\n<span class=\"glyphicon glyphicon-list-alt\"></span>\n</button>\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/top-management-chapter-183\" id=\"next_chap\" title=\"Chapter 183\">\n<span class=\"hidden-xs\">Next Chapter</span>\n<span class=\"glyphicon glyphicon-chevron-right\"></span>\n</a>\n</div>\n</div>\n<div class=\"text-center\">\n<button class=\"btn btn-warning\" data-chr-id=\"201477\" id=\"chr-error\" type=\"button\"><span class=\"glyphicon glyphicon-exclamation-sign\"></span> Report chapter\r\n                        </button>\n</div>\n<div class=\"bg-info text-center visible-md visible-lg box-notice\">\r\n                        Tip: You can use left, right, A and D keyboard keys to browse between chapters.\r\n                    </div>\n</div>"}