{"title": "Chapter 192", "id": 192, "volume": 2, "url": "http://boxnovel.org/top-management-chapter-192", "volume_title": "Volume 2", "body": "<h1>Chapter 192</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><header class=\"entry-header\"></header></p><div class=\"entry-content content\"><br/><p>Chapter 192: A Way that Suited Me (4)</p><br/><p>TL: emptycube / ED: Isleidir</p><br/><p>“Let’s see the top keyword of Celebrity Weekly!”</p><br/><p>A video began to play at the anchor’s remark. It was a scene of a young, barefoot man chasing after a woman. Park Taepyeong, who sat in the host chair, twirled around.</p><br/><p>“Do we really need to see that? I saw that clip a million times online.”</p><br/><p>“Just watch it again. It’s okay to see good things a lot.”</p><br/><p>A female singer, who was a member of the panel, watched the clip with pity.</p><br/><p>The young man was crying silently. His tears rolled down his clenched jaw. He stood still when the woman walking in front of him begged him to leave then would follow after her when she turned her back to leave. This happened until the woman disappeared like smoke.</p><br/><p>“Yes, as you all expected, the hot keyword is the upstart star, Mr. Song Inho!”</p><br/><p>A pop culture critic looked at his cue cards as he briefed the audience,</p><br/><p>“He’s a rookie who recently made his debut in the newly released mellow movie ‘Love Again’. Love Again is about the female lead going to the past and meeting men who might have been her destined soulmate. Mr. Song Inho appeared as her college classmate. Also, his popularity soared immediately after the movie’s release.”</p><br/><p>“Isn’t his popularity really amazing right now?”</p><br/><p>The people in the panel were noisy.</p><br/><p>“I saw the movie yesterday at the theatres, and women screamed when he came on screen.”</p><br/><p>“They say they go to the movies to see him rather than the movie.”</p><br/><p>“His popularity is so big that…”</p><br/><p>An excited entertainment news reporter tapped her cue card with her pen,</p><br/><p>“At their press screening, industry insiders predicted the movie’s first-week score would be at most 900,000.”</p><br/><p>“That’s a huge hit too.”</p><br/><p>“However, after Song Inho became viral on the internet, the movie is gaining a ton of viewers. Its first-week score has already passed 1.6 million. It’s incredible. People are sending love calls to pick him up before his worth skyrockets any further.”</p><br/><p>People exclaimed in admiration. The anchor asked another question,</p><br/><p>“Reporter Moon, what do you think is the reason behind Mr. Song Inho’s popularity?”</p><br/><p>“He really fit his character, Mujin, in the movie. A good-looking man from a wealthy, affluent family, who also has a lot of circumstances. On top of that, the movie ended in a happy ending, but Mujin’s life was a tragedy. That tugged the audience’s hearts even more.”</p><br/><p>Park Taepyeong joined in,</p><br/><p>“I thought the movie and actor were decent, but do they warrant such a big reaction?”</p><br/><p>“There are a few cases where something becomes a hit beyond expectations. Mr. Heo Kakyung was unknown before instantly rising to stardom with a drama. Ms. Kwon Sori became a hit while making a parody for a 15-second commercial.”</p><br/><p>The entertainment news reporter mentioned a few more cases while counting down with her fingers. The critic added,</p><br/><p>“People commonly referred to these cases as fever, syndrome, etc.”</p><br/><p>“Then, professor, do you think Mr. Song Inho will reach the syndrome level?”</p><br/><p>The pop culture critic shrugged at the anchor’s question.</p><br/><p>“He’s already close.”</p><br/><p>“We should have gotten him on our show. As an upstart star special.”</p><br/><p>The female singer commented outside what was on the script. Park Taepyeong snorted,</p><br/><p>“They probably did try but were rejected. There are likely tons of places that want him on their show.”</p><br/><p>“Can’t you call Mr. Song Inho?”</p><br/><p>Park Taepyeong blinked at her words.</p><br/><p>“Me? I’ve never met him before!”</p><br/><p>“But aren’t you close with Mr. Jung Sunwoo of W&amp;U? You posted a picture of you both on social media. Mr. Song Inho’s also from W&amp;U, so can’t you somehow call him?”</p><br/><p>“Do you think I can? Is Jung Sunwoo W&amp;U’s CEO? To be able to connect me to any of their actors?”</p><br/><p>Park Taepyeong clicked his tongue. Understanding his gaze, the main producer raised his hand.</p><br/><p>“We’ll take a break here!”</p><br/><p>The staff went on set to prepare it for the next segment. Park Taepyeong took a few gulps of water before glancing at the female singer on the panel.</p><br/><p>“Hey, tell me beforehand if you’re going to ask me something not on the script! I was caught off guard!”</p><br/><p>“No, I just thought you could at least call him. Even if he became a sensation, he’s still a rookie.”</p><br/><p>“We thought we could definitely bring him on the show because he’s a rookie, but we were completely rejected.”</p><br/><p>The main producer said as he came over. The entertainment news reporter, who was fixing her makeup during the intermission, clicked her tongue.</p><br/><p>“He’s not just any rookie. He’s W&amp;U’s rookie. He’s a potential talent, so I hear Team Leader Lee Jangyeob is personally managing him?”</p><br/><p>“Really? So he’s been quiet recently because he was managing a rookie.”</p><br/><p>“Who’s Team Leader Lee Jangyeob? I only know the CEO and Jung Sunwoo from W&amp;U.”</p><br/><p>The anchor asked with a puzzled look. Soon, they began discussing the behind-the-scenes of the entertainment industry, which wasn’t on the script.</p><br/><p>“Mr. Jung Sunwoo became famous in the last few years, but Team Leader Lee Jangyeob was the one production companies would usually recall when thinking of W&amp;U. He was known for having a good eye and great acumen. If you wanted an actor from W&amp;U, you had to get through him first.”</p><br/><p>“But hasn’t Jung Sunwoo reached that level now? I heard he’s a team leader now.”</p><br/><p>“There are many rumors. That maybe you will have to go through Jung Sunwoo to cast a W&amp;U actor. That you needed to get close to him before it’s too late. However, those rumors have disappeared.”</p><br/><p>The entertainment news reporter nodded her head.</p><br/><p>“Yup, because Song Inho’s doing so well.”</p><br/><p>*</p><br/><p>Their hurried footsteps sounded out as they walked across a hallway that was as red as the red carpet.</p><br/><p>“Greet them respectful and match their reactions. It was hard getting this meeting, okay?”</p><br/><p>A man said while turning around. A woman, whose thighs were clearly revealed under her skirt, nodded. Her face, where even her lashes were dolled up, flashed with confidence.</p><br/><p>“Don’t worry, chief. I was just too nervous during the audition. I’m more comfortable with situations like this. Who do I have to get close with?”</p><br/><p>“The director, production company rep, and the male lead, Heo Kakyung, as well as people from his company are inside. If you get close with the production company, at most, you’ll get a brief role. You need to target the director and Heo Kakyung if you want a good role.”</p><br/><p>“Okay.”</p><br/><p>The woman undid another button on her thin, see-through shirt.</p><br/><p>“Chief Choi! Over here.”</p><br/><p>The chief hurried. In front of them, a man wearing a wrinkled dress shirt waved at them. He was the general manager of the movie production company. He said with a discourteous face,</p><br/><p>“I can only introduce you. You need to mingle on your own, okay?”</p><br/><p>“Oh, that’ll be enough. Our Hyojin will do the rest.”</p><br/><p>The chief quickly pushed the actress forward. After giving her a glance, the general manager opened the door. The serious faces gathered in the room were in the middle of discussing something. Their voices quickly halted at the entrance of the uninvited guest.</p><br/><p>The general manager said in a smiling face,</p><br/><p>“Director, Mr. Kakyung, this is Ms. Lee Hyojin from Ant Entertainment. She just happened to be in a meeting in another room. She came over because she’s a fan of you both. Come in, come in.”</p><br/><p>“Hello, director! Sunbaenim!”</p><br/><p>The actress greeted them while brushing her hair to the side.</p><br/><p>“I auditioned not too long ago, but I was so nervous I didn’t properly introduce myself. I prepared a lot but was unable to show my true skill. It was constantly on my mind, and I begged to meet you when I heard you were here. Could I introduce myself briefly before going?”</p><br/><p>“You just introduced yourself. Now you can go.”</p><br/><p>The director said. The actress stepped back at the chilly mood.</p><br/><p>“Pardon?”</p><br/><p>“I received your greeting so go. We are in the middle of an important discussion.”</p><br/><p>The man sitting in the middle smirked. His arrogance glimmered over his forthright, intellectual appearance. He was Heo Kakyung, who would be counted on anyone’s fingers as one of the most popular male actors in their thirties.</p><br/><p>The general manager hastily stopped the red-faced actress from greeting again. The producer from the production company, who was sitting on the sofa on the side, shook his stiff face. Belatedly noticing the serious atmosphere, the general manager chased the actress and chief out.</p><br/><p>Heo Kakyung said in an unhurried tone,</p><br/><p>“The general manager seems to have a lot of free time. To bring an actress no one has heard of before here when we haven’t cast our main female lead.”</p><br/><p>“Mr. Kakyung, that’s not it. We just happened to meet each other here.”</p><br/><p>The general manager smiled awkwardly. The director down the rest of his liquor and asked,</p><br/><p>“Mr. Kakyung, who do you want as the female lead?”</p><br/><p>“I said it from the beginning. I want Lee Songha.”</p><br/><p>The director let out a drunken sigh. The general manager said in a comforting manner,</p><br/><p>“Mr. Kakyung, it’s not like we ignored your opinion, but talks with Ms. Lee Songha didn’t go very well. I had three meetings with Chief Jung Sunwoo. Instead of Ms. Lee Songha, we could get better actress more suiting of your level…”</p><br/><p>“General manager.”</p><br/><p>Heo Kakyung cut him off.</p><br/><p>“If she doesn’t want to do it, you need to make it so she does. Isn’t that what a production company is supposed to do?”</p><br/><p>The general manager opened and closed his mouth a few times before sighing.</p><br/><p>“Okay, I’ll try to meet with Chief Jung Sunwoo once mor…”</p><br/><p>“That’s okay.”</p><br/><p>The director cut him off this time.</p><br/><p>Just as the general manager’s face was about to brighten, the director continued,</p><br/><p>“I’ll talk with CEO Baek Hansung.”</p><br/><p>*</p><br/><p>“Mr. Inho! Congratulations on your movie!”</p><br/><p>Song Inho, who was walking mechanically, creaked to a halt.</p><br/><p>“Ah… Thank you. But I think you already congratulated me yesterday.”</p><br/><p>“I just wanted to congratulate you for a long time. As long as possible.”</p><br/><p>The W&amp;U Team 2 employee patted Song Inho’s shoulder before disappearing. From then on, he received multiple congratulations. Team 2 had been in high spirits these days. It was thanks to people’s reaction to Song Inho, which was better than they expected. Since the team leader’s office was at peace, so was the rest of the team.</p><br/><p>Song Inho took a deep breath in front of the team leader’s office. The door burst open the moment he knocked.</p><br/><p>The Team 2 Leader gave Song Inho a bear hug.</p><br/><p>“Lucky Charm! That’s what you are!”</p><br/><p>His voice was full of energy, like someone who had tasted a rain shower after a drought. Song Inho was that rain shower for the Team 2 Leader. He was a monsoon. Song Inho brought newfound vigor into his mind, which had been exhausted from his resentment towards Jung Sunwoo.</p><br/><p>“What did I tell you? Didn’t I tell you that you would receive the rookie award in a brilliant fashion if you just did as I said? How do you feel now that you’re famous?”</p><br/><p>Song Inho opened and closed his mouth a few times before saying,</p><br/><p>“It’s still… feels surreal.”</p><br/><p>“It’ll definitely hit you when you go about your schedule. How did your parents’ react?”</p><br/><p>“… They are happy. They go to the movies every night. They said they’ll go watch it until the movie is no longer playing.”</p><br/><p>“Really? I should send them enough tickets then.”</p><br/><p>The Team 2 Leader led Song Inho to the elevator.</p><br/><p>“The CEO is upstairs, so let’s greet him first. He said he wanted to see you.”</p><br/><p>“The CEO did?”</p><br/><p>“He normally calls actors up and discusses projects with them. I bet he’s particularly interested in you. There were a lot of rumors going around mentioning you with Jung Sunwoo, Nam Joyoon, and them. But that’s all over now.”</p><br/><p>The Team 2 Leader revealed a satisfied smile. As soon as they arrived at the sixth floor, the secretary approached them.</p><br/><p>“The CEO’s inside, right?”</p><br/><p>“He is, but the meeting isn’t over yet.”</p><br/><p>“What meeting? Is the director inside?”</p><br/><p>“Yes, as well as Team Leader Jung Sunwoo.”</p><br/><p>The Team 2 Leader’s face changed the moment the words ‘Jung Sunwoo’ and ‘Team Leader’ came out of the secretary’s mouth. He made an unpleasant expression like he just saw a pile of trash.</p><br/><p>“Why is he here?”</p><br/><p>“I’m not sure…”</p><br/><p>Frowning, the Team 2 Leader suddenly looked back at Song Inho. Song Inho was staring at the CEO’s office. Maybe it was because he was nervous or excited, but his lips were tense. On the other hand, the Team 2 Leader’s face relaxed the moment he saw Song Inho.</p><br/><p>He immediately walked over to the CEO’s office. His steps were steadfast like a triumphant general bringing his spoils of war.</p><br/><p>“CEO, this is the Team 2 Leader. I came with Inho.”</p><br/><p>“… Mm. Come in.”</p><br/><p>A reply came after a slight delay. It was CEO Baek Hansung’s voice. The Team 2 Leader looked behind him and gestured with his hand. Song Inho, who had been standing with a complicated expression, began walking mechanically. The Team 2 Leader placed his hand on his shoulder. Then he opened the CEO’s office door.</p><br/><p>***</p><br/><p>CEO Baek Hansung turned over the contract. Then he nodded.</p><br/><p>“Let’s see.”</p><br/><p>As though he had been waiting for it, the director stretched his hand out to the contract. Then he checked the signature on the last page.</p><br/><p>“Son Chaeyoung really did sign it. Lucky Charm, what did you do to her?”</p><br/><p>“I persuaded her.”</p><br/><p>The director moved his seat over to me.</p><br/><p>“If she was someone who could calm down from persuasion, she would be sitting here with us. She doesn’t come to the company unless she has business with you. Spill it. How did you persuade her that the words ‘her people’ came out of her mouth?”</p><br/><p>I gave the director, who pestered me to spill my secret, a bitter smile.</p><br/><p>CEO Baek Hansung said,</p><br/><p>“It seems Chaeyoung really likes you.”</p><br/><p>That’s not it.</p><br/><p>I licked my dry lips. Then I went to the point.</p><br/><p>“Since she decided her next project, can we continue the ‘team’ discussion from before?”</p><br/><p>The director, who had been mumbling to himself, shut his mouth.</p><br/><p>Raising his cup of coffee, CEO Baek Hansung smiled faintly.</p><br/><p>“You said you had someone you wanted to bring over?”</p><br/><p>‘Yes.”</p><br/><p>“And you got the person’s agreement?”</p><br/><p>I was about to reply when someone knocked on the door. Then I heard the Team 2 Leader’s voice.</p><br/><p>“Mm. Come in.”</p><br/><p>The door burst open as soon as CEO Baek Hansung replied. Then the Team 2 Leader entered with his arm wrapped around Song Inho’s shoulder. In that short moment, both their gazes met mine.</p><br/><p>CEO Baek Hansung said,</p><br/><p>“Good timing.”</p><br/><p>“Yes, good timing.”</p><br/><p>I said.</p>\n</div>\n<div style=\"max-width: 870px;margin: 5px auto;background: repeating-linear-gradient( 45deg, #fff6cc, #fff6cc 5px, #f3ecc7 5px, #f3ecc7 10px );\">\n<!-- Composite Start -->\n<div id=\"M562762ScriptRootC864255\">\n</div>\n<script async=\"\" src=\"https://jsc.mgid.com/m/e/media.boxnovel.org.864255.js\"></script>\n<!-- Composite End -->\n</div>\n<hr class=\"chr-end\"/>\n<div class=\"chr-nav\" id=\"chr-nav-bottom\">\n<div class=\"btn-group\">\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/top-management-chapter-191\" id=\"prev_chap\" title=\"Chapter 191\">\n<span class=\"glyphicon glyphicon-chevron-left\"></span>\n<span class=\"hidden-xs\">Prev Chapter</span>\n</a>\n<button class=\"btn btn-success chr-jump\" type=\"button\">\n<span class=\"glyphicon glyphicon-list-alt\"></span>\n</button>\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/top-management-chapter-193\" id=\"next_chap\" title=\"Chapter 193\">\n<span class=\"hidden-xs\">Next Chapter</span>\n<span class=\"glyphicon glyphicon-chevron-right\"></span>\n</a>\n</div>\n</div>\n<div class=\"text-center\">\n<button class=\"btn btn-warning\" data-chr-id=\"201498\" id=\"chr-error\" type=\"button\"><span class=\"glyphicon glyphicon-exclamation-sign\"></span> Report chapter\r\n                        </button>\n</div>\n<div class=\"bg-info text-center visible-md visible-lg box-notice\">\r\n                        Tip: You can use left, right, A and D keyboard keys to browse between chapters.\r\n                    </div>\n</div>"}