{"title": "Chapter 206", "id": 206, "volume": 3, "url": "http://boxnovel.org/top-management-chapter-206", "volume_title": "Volume 3", "body": "<h1>Chapter 206</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><header class=\"entry-header\"></header></p><div class=\"entry-content content\"><br/><p>Chapter 206: Once You Start Being Swayed (4)</p><br/><p>TL: emptycube / ED: Isleidir</p><br/><p>“Well, let’s hear what the situation is.”</p><br/><p>Director Hwang of Ant Capital said in a leisurely manner.</p><br/><p>Seeing this, Director Joo Jaechan also suppressed his agitation. There was no need to get agitated. Even if Director Oh Hyunkyung came here clinging onto someone’s pant leg, she couldn’t push him, who had strong support from the investment company, out.</p><br/><p>Jung Sunwoo introduced everyone in this restless atmosphere.</p><br/><p>“Also, this is the project producer from SBE Film.”</p><br/><p>“Hello.”</p><br/><p>The business card the man handed out had his position, project producer, and name clearly printed. Director Joo Jaechan dazedly stared at the business card. SBE Film. The production company that produced the megahit film, Alive, with Director Choi Sungwon. It was also one of the places he brought his scenario to and was rejected.</p><br/><p>Director Hwang opened his mouth with an ‘Ah’.</p><br/><p>“No wonder you seemed familiar. How are you here together?”</p><br/><p>“City Jungle may be a joint collaboration with us.”</p><br/><p>“With SBE Film?”</p><br/><p>Director Hwang’s eyes widened. Then his gaze alternated between Jung Sunwoo, SBE Film’s project producer, and Forest’s CEO. Then, as if he understood the situation, he nodded.</p><br/><p>“It seems Team Leader Jung Sunwoo acted as the bridge. It’s great for investors if an experienced production company joins. You’ve also worked with Ms. Lee Songha before.”</p><br/><p>At this time, Director Joo Jaechan was doing his best to calm his excitement. This excitement was not of fury but high hopes. The higher the level of the production company, the higher his level and value, as the director, rose.</p><br/><p>While Director Joo Jaechan was hyped up, the project producer licked his lips and replied,</p><br/><p>“We are familiar. Also familiar with Mr. Nam Joyoon.”</p><br/><p>“Pardon?”</p><br/><p>“With Mr. Nam Joyoon and Ms. Lee Songha as the leads, there shouldn’t be any scuffles on set.”</p><br/><p>“Wait, I think there is a misunderstanding. We only wanted to cast…”</p><br/><p>Director Hwang glanced back at Director Joo Jaechan. His gaze clearly asked how he handled the casting matter. Flustered, Director Joo Jaechan shook his head and looked at Jung Sunwoo.</p><br/><p>“Team Leader Jung! I clearly only extended the offer to Ms. Lee Songha.”</p><br/><p>“Yes, I received two offers. One for the male lead and another for the female lead.”</p><br/><p>“No, but we explained the situation. There was an internal miscommunication regarding Mr. Nam Joyoon…!”</p><br/><p>“I hope that we can proceed with both.”</p><br/><p>Jung Sunwoo said with a smile. At the same time, Director Hwang’s expression stiffened.</p><br/><p>“If we don’t take Mr. Nam Joyoon, you won’t give us Ms. Lee Songha, is that it?”</p><br/><p>“That makes it sound like I’m selling you untalented actors. Especially when the casting offer first came to Joyoon hyung, Mr. Nam Joyoon. The male lead. I am certain he’ll be able to do it better than anyone else. If you don’t believe me, I’m fine if you hold an audition.”</p><br/><p>“Of course, you will be certain. He’s your actor. And I don’t think we need to hold an audition. Our views are clear.”</p><br/><p>Director Hwang said resolutely.</p><br/><p>“I oppose having Mr. Nam Joyoon as the lead. What are your thoughts, Director Joo?”</p><br/><p>“… To be honest, I wanted to ask for Mr. Seo Jijoon as the male lead. The reaction when he worked with Ms. Lee Songha was quite good too. It just happens that he hasn’t decided on his next project yet.”</p><br/><p>Director Joo Jaechan agreed, nodding his head subtly. He had been planning on bringing up Seo Jijoon once Lee Songha was decided. Any investors would drool with that lineup.</p><br/><p>“Team Leader Jung. Could you reconsider with Mr. Seo Jijoon…”</p><br/><p>“I think the role will better suit Mr. Nam Joyoon than Mr. Seo Jijoon.”</p><br/><p>His reply was as firm as Director Hwang.</p><br/><p>While Director Joo Jaechan was figuring out what to say, Director Hwang clicked his tongue.</p><br/><p>“Team Leader Jung, I think you believe that investors are going to rush to give you their money if you act, but that’s only if you push the right actors. We’re talking about the lead here, the lead. It’s too early to trust in Ms. Lee Songha since it’s her first time playing the female lead in a film. If the movie flops, at least the actors will have played lead roles. The investors are taking all the losses. If you are going to pull Ms. Lee Songha too, then do just that.”</p><br/><p>After saying those sharp words, Director Hwang looked at Forest’s CEO.</p><br/><p>“CEO, if this is how you’re going to proceed with casting, then we can’t invest in this film. How about we make you a list and you choose from there?”</p><br/><p>The mood in the room became even colder.</p><br/><p>Director Joo Jaechan’s eyes quickly darted back and forth. If the investment company took command of the casting, then his plan would go belly up. Director Joo Jaechan was about to persuade Jung Sunwoo once more when he shut his mouth. Jung Sunwoo’s reaction was strange.</p><br/><p>He wasn’t shaken up in the least in a situation like this. It was the same for Forest’s CEO and SBE Film’s project producer. They simply let out a short sigh or clicked their tongues. As though what was coming had finally arrived.</p><br/><p>“What do you think, Director Oh Hyunkyung?”</p><br/><p>Jung Sunwoo abruptly asked. Director Oh Hyunkyung replied in a serious manner,</p><br/><p>“I said this multiple times, but I think Mr. Nam Joyoon is perfect as the male lead.”</p><br/><p>“Now really, here I was wondering what was going on.”</p><br/><p>Director Hwang couldn’t help but laugh. Director Oh Hyunkyung continued,</p><br/><p>“I also received positive replies from other investors I have been working hard to persuade. Because they are partial investors, individually they don’t make up a large amount, but I’ll be able to persuade more partial investors once our leads are set.”</p><br/><p>“CEO!”</p><br/><p>Forest’s CEO flinched in surprise. Avoiding Director Hwang’s sharp glare, he supported Director Oh Hyunkyung with a gloomy face. Director Hwang, who had been drinking cold water with a dumbfounded face, eventually place his cup down in a tossing manner before getting up.</p><br/><p>“Then do what you want.”</p><br/><p>The sliding door loudly opened and closed. Director Joo Jaechan blankly looked at the door Director Hwang slammed. The situation was progressing weirdly. At this rate, there was no doubt he would end up no better than an abandoned duck egg.</p><br/><p>His eyes darted around. He looked at Forest’s CEO, Director Oh Hyunkyung, and SBE Film’s project producer.</p><br/><p>And finally, at Jung Sunwoo.</p><br/><p>He hastily spoke,</p><br/><p>“Team Leader Jung, please give me a moment of your time.”</p><br/><p>Jung Sunwoo readily got up.</p><br/><p>On their way out of the building, Director Joo Jaechan’s mind was churning. This was a chance that the heavens had given him. He couldn’t lose his scenario and his debuting work like this.</p><br/><p>Although the CEO with no backbone supported Director Oh Hyunkyung, this was only because Jung Sunwoo and Director Oh Hyunkyung were of the same opinion. It was Jung Sunwoo who brought in SBE Film. The one who was in control of the current situation was also Team Leader Jung Sunwoo.</p><br/><p>This meant that all he had to do was persuade him.</p><br/><p>“Thinking about what you said, I think Mr. Nam Joyoon will also be fine. No, good. I can also persuade the partial investors Director Oh Hyunkyung mentioned.”</p><br/><p>Director Joo Jaechan said with confidence. Of course, he was certain.</p><br/><p>Under the same conditions, he was certain that Jung Sunwoo would choose him.</p><br/><p>“Please let me take care of the actors as we discussed. You also prefer my directin…!”</p><br/><p>“I don’t know.”</p><br/><p>“Pardon?”</p><br/><p>“I saw Director Oh Hyunkyung’s previous works, and I really liked her directing. It was surprising.”</p><br/><p>Jung Sunwoo tilted his head. It was difficult to read what he was thinking. That expression made Director Joo Jaechan feel more uneasy. He almost clung to him, trying to persuade him, but Jung Sunwoo’s expression did not change. Director Joo Jaechan raised his voice.</p><br/><p>“Team Leader! No matter how good her directing was, weren’t they all failures in the end? Unless you’re crazy, how can you entrust your actors to a director like that…!”</p><br/><p>Director Joo Jaechan, who was expressing his frustrations, paused.</p><br/><p>Jung Sunwoo was grinning.</p><br/><p>“People asked me whether I was crazy on multiple occasions, but these actions weren’t crazy to me. But this choice really is crazy. Logically speaking, the decision is clear, but I am making the illogical choice.”</p><br/><p>Jung Sunwoo, who was mumbling incomprehensibly, said in a clear-cut manner,</p><br/><p>“Anyways, the person I want to entrust my actors to is Director Oh Hyunkyung.”</p><br/><p>Director Joo Jaechan swore under his breath. His chance was slipping from his fingers. Malice surged up from his belly. If they were bent on pushing him out, then he also had a way to make this a complete mess.</p><br/><p>Director Joo Jaechan revealed a crooked smile.</p><br/><p>“… I’ll sue.”</p><br/><p>“Sue?”</p><br/><p>“City Jungle is my work!”</p><br/><p>It was now Jung Sunwoo’s turn to laugh. Laughing like he was refreshed, he said,</p><br/><p>“We’ll put your name in the credits.”</p><br/><p>“…!”</p><br/><p>“So that it’s not even worth suing over.”</p><br/><p>***</p><br/><p>“You’re going to regret today once the film flops!”</p><br/><p>I let Director Joo Jaechan’s curse in one ear and out the other as I went back in the building. Director Cha Jaeho, who was directing Supernatural, also mocked me, saying that I would regret it. I didn’t know why they were all so impatient to pray for my future.</p><br/><p>I was returning to the room when I saw someone standing in front of the room.</p><br/><p>It was Director Oh Hyunkyung.</p><br/><p>“Team Leader Jung.”</p><br/><p>“What are you doing outside? It’s time we go in and discuss the film for real.”</p><br/><p>“I wanted to thank you. You undoubtedly had other options.”</p><br/><p>Options, huh?</p><br/><p>Director Joo Jaechan, or even other, more trustworthy, directors.</p><br/><p>I did consider it. Even while I was watching Director Oh Hyunkyung’s previous works and thinking she really didn’t lack skills but was really unlucky. Even while I reminded myself that the emotions I was feeling from the scenario were all from Director Oh Hyunkyung. Even while seeing her constantly on the move to change the situation.</p><br/><p>Still, the tips of the scales didn’t fully lean towards her.</p><br/><p>“They said they wanted to do it.”</p><br/><p>“… Pardon?”</p><br/><p>Looking at Director Oh Hyunkyung, who was confused, I remembered.</p><br/><p>“What project do you want to do?”</p><br/><p>As soon as I asked, Lee Songha, as if waiting, put out three stacks of paper. One was a drama script, the other two were drama proposals. Just as I gulped dryly, Lee Songha spoked,</p><br/><p>“I’m still undecided between the three of them. I haven’t picked out the drama, but for the film, this.”</p><br/><p>Lee Songha placed a scenario over the drama script and proposals. City Jungle. I relaxed as soon as I saw the title on the front page. Then my suspicions began to bud.</p><br/><p>“Did you hear anything at the company?”</p><br/><p>“About what?”</p><br/><p>“No, what do you like about this scenario.”</p><br/><p>Lee Songha replied nonchalantly to my question,</p><br/><p>“The scenario is fun. And, above all, the female lead is impressive. She also has a large role. There are a lot of dramas where the female lead has a large part, but it’s rare to find in movies. I think I’ll regret it if I miss out. Also…”</p><br/><p>Lee Songha smiled slightly before adding,</p><br/><p>“It made me think that the director who wrote the script became very attached to the character as she wrote it. I thought she would film me with that sense of attachment.”</p><br/><p>I asked Nam Joyoon the same question.</p><br/><p>“Hyung, which one do you want to do?”</p><br/><p>“This one.”</p><br/><p>Nam Joyoon took out a scenario from a tower of them.</p><br/><p>“City Jungle. The one you gave me last. It interests me the most.”</p><br/><p>“… Why?”</p><br/><p>When I asked with narrowed eyes, Nam Joyoon calmly replied,</p><br/><p>“Because it’s fun.”</p><br/><p>“You find all scenarios fun.”</p><br/><p>“It’s more fun. Also… This caught my eye.”</p><br/><p>He took out something that was carefully placed in a transparent file. A colorful paper. It was the casting offer that I first received from Director Oh Hyunkyung. The sincere, earnest, embarrassing offer.</p><br/><p>“It’s been ten years since I last received something like this.”</p><br/><p>Although I gave it to him in hopes he would be charmed by it, I didn’t think it would be this effective.</p><br/><p>Nam Joyoon scratched his neck as he said,</p><br/><p>“I don’t care if it’s a brief role, I want to do this movie.”</p><br/><p>“That’s what they said. Both of them.”</p><br/><p>I looked over after speaking. Director Oh Hyunkyung had a strange expression on her face. Her brows were contorted, and the corners of her lips were raised. Like someone who didn’t know whether she should laugh or cry. I let out a short breath before greeting Director Oh Hyunkyung once more,</p><br/><p>“So please take care of us from now on.”</p><br/><p>Leaving Director Oh Hyunkyung, who was standing rigidly, I opened the sliding door.</p><br/><p>The room was filled with dark clouds. SBE Film’s project producer was on the phone wearing a serious expression, while Forest’s CEO’s deathly pale face seemed to have already been soaked in the rain. He looked over at me and mumbled,</p><br/><p>“Our main investor is gone. Now, what do we do…”</p><br/><p>“We need to find other investors.”</p><br/><p>Immediately, from now on.</p>\n</div>\n<div style=\"max-width: 870px;margin: 5px auto;background: repeating-linear-gradient( 45deg, #fff6cc, #fff6cc 5px, #f3ecc7 5px, #f3ecc7 10px );\">\n<!-- Composite Start -->\n<div id=\"M562762ScriptRootC864255\">\n</div>\n<script async=\"\" src=\"https://jsc.mgid.com/m/e/media.boxnovel.org.864255.js\"></script>\n<!-- Composite End -->\n</div>\n<hr class=\"chr-end\"/>\n<div class=\"chr-nav\" id=\"chr-nav-bottom\">\n<div class=\"btn-group\">\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/top-management-chapter-205\" id=\"prev_chap\" title=\"Chapter 205\">\n<span class=\"glyphicon glyphicon-chevron-left\"></span>\n<span class=\"hidden-xs\">Prev Chapter</span>\n</a>\n<button class=\"btn btn-success chr-jump\" type=\"button\">\n<span class=\"glyphicon glyphicon-list-alt\"></span>\n</button>\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/top-management-chapter-207\" id=\"next_chap\" title=\"Chapter 207\">\n<span class=\"hidden-xs\">Next Chapter</span>\n<span class=\"glyphicon glyphicon-chevron-right\"></span>\n</a>\n</div>\n</div>\n<div class=\"text-center\">\n<button class=\"btn btn-warning\" data-chr-id=\"201516\" id=\"chr-error\" type=\"button\"><span class=\"glyphicon glyphicon-exclamation-sign\"></span> Report chapter\r\n                        </button>\n</div>\n<div class=\"bg-info text-center visible-md visible-lg box-notice\">\r\n                        Tip: You can use left, right, A and D keyboard keys to browse between chapters.\r\n                    </div>\n</div>"}