{"title": "Chapter 203", "id": 203, "volume": 3, "url": "http://boxnovel.org/top-management-chapter-203", "volume_title": "Volume 3", "body": "<h1>Chapter 203</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><header class=\"entry-header\"></header></p><div class=\"entry-content content\"><br/><p>Chapter 203: Once You Start Being Swayed (1)</p><br/><p>TL: emptycube / ED: Isleidir</p><br/><p>“CEO! What are you trying to do?!”</p><br/><p>“Director Oh, don’t act like this outside. Let’s go inside the meeting room-!”</p><br/><p>“Are you embarrassed that rumors will spread that this is a mess? If you know that, then why do it!”</p><br/><p>“No, that’s not it. Let’s sit and calm down-!”</p><br/><p>“Do you think I can calm down? How can you do this to me!”</p><br/><p>The one in frenzy was Director Oh Hyunkyung. She was almost yelling with hostility. The film production company CEO was stuck in the middle with a pale face soaked in cold sweat. It seemed he was trying to calm the fires as best he could, but Director Joo Jaechan poured oil to the fire.</p><br/><p>“Why can’t he? You signed the contract and handed over the production rights for that scenario to the film production company. Then it’s their right to decide who to give the megaphone to. Isn’t that right?”</p><br/><p>“We already decided that I would be the one directing!”</p><br/><p>“There was no clause about it in the contract though?”</p><br/><p>“CEO! You promised to leave it to me! City Jungle is my project!”</p><br/><p>“Of course, I would like to…!”</p><br/><p>“If you want to get to the nitty-gritty, then it’s my project! I’m the original writer who wrote the first draft! All you did was take it and embellish it a little!”</p><br/><p>“What did you say? You rat!”</p><br/><p>The argument quickly became a dog fight. They acted like they were the victims.</p><br/><p>I pushed the brim of my hat down. I acted like a spectator who was hesitating on whether to call 112 or not. The employees were so dumbstruck that they didn’t have the time to concern themselves with a spectator next to the door.</p><br/><p>“Director Oh Hyunkyung. This is a business matter.”</p><br/><p>Someone joined in with a sigh. It was a man wearing a suit and sitting on an empty table. He seemed to a man of influence as they immediately quieted down. Their gazes were all focused on him.</p><br/><p>“From an investor’s perspective, we have decided that, unless it’s a famous director, it would be better to go with a rookie director who won an award at a film festival than Director Oh. The picture will be good since he’s also the original writer. There have been cases where a director’s debuting film becomes a huge hit and people cause a fuss about how he’s a monster rookie.”</p><br/><p>“Director!”</p><br/><p>“What’s important is that the film is a success. How about we settle this matter peacefully with you handing the megaphone over to him and getting credited as an embellishment writer.”</p><br/><p>Director Oh Hyunkyung’s face turned red and pale at the man’s words. The film production company CEO went over and said something to him, but he was steadfast with his decision. Director Oh Hyunkyung tried her best to persuade him and finally said with a desperate face,</p><br/><p>“I have currently made an offer to W&amp;U’s Team Leader Jung Sunwoo to cast the male lead.”</p><br/><p>“Team Leader Jung Sunwoo? Is he interested in the scenario?”</p><br/><p>My name was suddenly brought up. Their reactions were immediate. Director Joo Jaechan’s eyes were wide open, and the CEO seemed to be in a sticky situation. Finally, the man in the suit, who seemed to be part of the investors, rushed in like a hyena that found a piece of meat.</p><br/><p>“How far have the talks progressed? Does it seem positive? Who are you discussing for the male lead? Seo Jijoon? Im Joowon? Or the one everyone’s up in arms about, Song Inho?”</p><br/><p>“Mr. Nam Joyoon.”</p><br/><p>“Who?”</p><br/><p>“He became famous with Alive. Don’t you know him? He received praise as a scene stealer.”</p><br/><p>The man tapped his phone like he was searching for Nam Joyoon’s profile before frowning.</p><br/><p>“What the hell? Are you planning on filming an independent film? Who’s going to invest billions of won in a project with an unknown director and a supporting-role-level, washed-up rookie? There needs to be something we can put our hopes on. And here I was thinking you had some casting skills.”</p><br/><p>The man harshly ridiculed.</p><br/><p>“Do you think the movie will be successful if you cast any actor as long as you have Jung Sunwoo promoting you?”</p><br/><p>“He’s not any actor. He’s someone I decided after careful deliberation. I saw all the independent films he’s appeared in and his image fits well with the male lead. He’s also good at acting..!”</p><br/><p>“You’re so frustrating. If that was enough, then everyone would pick up theater actors from Daehangno and use them. Why would they bother pouring tons of money to try to get a top star? That’s enough. CEO, if our director-change proposal doesn’t get settled, then we’re going to withdraw our investments and leave. You can look for other investors. Nam Joyoon… Now really.”</p><br/><p>Just then, Director Joo Jaechan joined in.</p><br/><p>“I met Team Leader Jung Sunwoo at the short film festival afterparty. He seemed particularly interested in my projects. I even received his business card. He said that he really enjoyed my short film and to contact him if I had a good project.”</p><br/><p>“Really?”</p><br/><p>Director Joo Jaechan glanced at Director Oh Hyunkyung before boasting,</p><br/><p>“I’ll try talking to him this time.”</p><br/><p>*</p><br/><p>The film production company, Forest’s CEO, peeked into his office as he wet his dry lips. He saw the back of a man sitting in a chair through the opaque window. Seeing his dark appearance, he looked like loan shark coming to collect money.</p><br/><p>The huddled employees pushed the CEO’s back.</p><br/><p>“Go in.”</p><br/><p>“Don’t hurry me. I haven’t organized my thoughts yet.”</p><br/><p>“I think the ice in the coffee completely melted while you were organizing your thoughts.”</p><br/><p>After realizing this, the CEO placed the two mugs down and handed it over.</p><br/><p>“They’re both melted. Go make them again.”</p><br/><p>“They look fine for now.”</p><br/><p>“It’s a flood, how is it fine? Quickly, no, slowly go make them again.”</p><br/><p>After sending the employee off, he pressed his chest and let out a sigh.</p><br/><p>“Just as I thought I could take a breather after sending the directors and investor off…”</p><br/><p>“He probably came because of City Jungle, right?”</p><br/><p>“Did he like the scenario? I heard he’s picky when choosing projects.”</p><br/><p>“It’s not like it’s for other top stars. It’s for Nam Joyoon. Since he received a male lead role after now finally becoming slightly known as a supporting actor, this opportunity probably appealed to him.”</p><br/><p>“What do we do if he wants to sign a contract right now?”</p><br/><p>The employees became silent at the producer’s words. Their gazes gathered on the CEO, but he was busy shaking his leg and wiping his sweat with a handkerchief. He looked like he was about to have a mental breakdown and collapse. The employees continued talking.</p><br/><p>“We need to decline. Is there anything else we can do?”</p><br/><p>“It’s not like this is a joke. What if our relationship with him sours because of this?”</p><br/><p>“What can we do when we might lose our investments? To be honest, the reactions of other investors will probably be the same. We all opposed the idea in the beginning. We were simply persuaded by Director Oh Hyunkyung because of how confident she was.”</p><br/><p>“What if we say that we are in talks with other actors?”</p><br/><p>“If we get caught, we will be cursed to hell. Why don’t we blame it all on the investors? That they were causing a fuss about how they didn’t like the actor. Wouldn’t it be better to whine about how much of a tough situation we’re in?”</p><br/><p>The CEO, who was slumped in one corner, nodded.</p><br/><p>“Yeah, let’s go with that. Producer Lee, you go and talk to him.”</p><br/><p>“I believe it’s only right for an influential man like you to talk to him, CEO.”</p><br/><p>In the end, the CEO held two newly made cups of iced coffee and entered his office. His guest, Jung Sunwoo, who seemed to be lost in thought, got up after sensing someone was in the room. The CEO felt his fluttering heart squeeze. His guest seemed to have more influence and dignity.</p><br/><p>“Hello, CEO.”</p><br/><p>“Ah! Yes, you must have waited a long time. We were trying to quickly find some ice. In case you were hot.”</p><br/><p>Jung Sunwoo made smiling eyes as he accepted the coffee. The CEO squeezed into his chair and glanced at the man in front of him. He looked younger than he thought. Since he was supposedly twenty-eight on his profile, he was young in reality as well.</p><br/><p>To be a team leader at a company like W&amp;U at his age. He probably didn’t have to brown-nose anyone with all those talented actors he had under him. After tasting a bitter taste in his mouth, the CEO got to the point.</p><br/><p>“But why did you contact…”</p><br/><p>“It’s because of the City Jungle scenario.”</p><br/><p>“Why didn’t you contact the director first…”</p><br/><p>“I didn’t know which director to call out of the two.”</p><br/><p>The CEO flinched in surprise.</p><br/><p>“Pardon?”</p><br/><p>“I heard that the production situation is chaotic right now. If that’s not the case, then we can immediately talk about cast…”</p><br/><p>“No, it is chaotic. We aren’t in a situation where we can begin casting yet.”</p><br/><p>The CEO did his best to beat around the bushes now that he saw his opportunity. Jung Sunwoo listened while reacting back. The CEO initially thought that there would be an arrogant side to Jung Sunwoo since he was on the path of success at such a young age, but he was unexpectantly very respectful. The CEO’s nervousness quickly dissipated.</p><br/><p>At some point, his mouth was rambling on.</p><br/><p>“So I’m in a pinch. When I think of loyalty, obviously we should work with Director Oh Hyunkyung. Director Oh worked so hard trying to create this.”</p><br/><p>“Really?”</p><br/><p>“I heard that she even took out a loan to pay a sizable amount for the rights to the scenario. However, the director who wrote the first draft seemed to have somehow talked to the investment company, as they suddenly called for a change in directors… It really was a bolt out of the blue.”</p><br/><p>“Director Joo Jaechan persuaded the investment company?”</p><br/><p>“That fellow went around to different production and investment companies after receiving an award at the film festival, but his synopsis was rejected. He was rejected by the investment company we are working with, and it seemed he saw the City Jungle scenario over there. He decided to force his way in after finding out that the rights were signed over to the film production company.”</p><br/><p>“Then which investment company is it?”</p><br/><p>Jung Sunwoo lightly asked.</p><br/><p>“The investment firm, Ant Capital. We are in discussion for a 5-billion-won investment, so if we can’t get them, then the production immediately falls through. But that doesn’t mean we can just readily switch out the director. Once we start to get swayed, we’ll probably be swayed by the investment company throughout production…”</p><br/><p>Sighing, the CEO suddenly came to his senses and added,</p><br/><p>“Until this is settled, there is going to be a stop on casting. Sorry…”</p><br/><p>“CEO.”</p><br/><p>Jung Sunwoo, who was lost in his thoughts, asked in a courteous voice,</p><br/><p>“Theirs is something I want to propose.”</p><br/><p>***</p><br/><p>“Team Leader Jung!”</p><br/><p>I was quickly flipping through the last half of the scenario when an employee quickly approached me.</p><br/><p>“A director has come looking for you. Again.”</p><br/><p>“Director?”</p><br/><p>“Yes, I asked if he had an appointment, and he said that he’ll wait until you had free time.”</p><br/><p>For a second, I thought that Director Oh Hyunkyung had come again. She had called me a few times, but I had manually replied that I was in the middle of a meeting. I was wondering if maybe she couldn’t wait any longer and had come to the company again, but the name that came out of the employee’s mouth was different.</p><br/><p>“He said he was Director Joo Jaechan.”</p><br/><p>“You told me to tell you whenever I had a good project.”</p><br/><p>Director Joo Jaechan said in the exact same place Director Oh Hyunkyung sat not too long ago. Their expressions had a similar side to them as well. Especially their passion-filled eyes.</p><br/><p>His mood seemed different every time I saw him. He looked well-mannered at the afterparty. And he seemed like a completely different person when he argued with Director Oh Hyunkyung. His gaze now was very similar to his future self.</p><br/><p>“I did say that.”</p><br/><p>“This scenario. I believe you’ve received it from other channels.”</p><br/><p>He took out a scenario from his backpack. Or it was besides the empty director field.</p><br/><p>It was a scenario I was familiar with.</p><br/><p>“Yes, I read it.”</p><br/><p>“This is a project I had held onto for a long time since I was a student. I had certain circumstances which led its rights to be handed over for a while. That was why I couldn’t bring it up when you asked if I had any other projects. Now the situation has changed.”</p><br/><p>His heated voice was filled with excitement.</p><br/><p>“I think I’ll be the one directing this film.”</p><br/><p>“Not Director Oh Hyunkyung?”</p><br/><p>“She will be taken off the project and will have her name under ‘Script Embellisher’ in the credits. I’ll be the one directing. I heard that you met with Director Oh once, but I had something I wanted to say about casting.”</p><br/><p>His eyes darted quickly as he examined my reaction before he added,</p><br/><p>“To be honest, back when I was an aspiring director, this scenario was pretty much snatched from me. I couldn’t get a good price for it either. That is why I couldn’t say that it was a scenario I wrote and completely regretted my decision, but it finally returned to its rightful owner. I will put my life on the line…”</p><br/><p>I flipped over a few pages as I listened. There was no need to look at it. There was not a single character missing.</p><br/><p>“The scenario is the edited version?”</p><br/><p>“Pardon?”</p><br/><p>“It’s not the first draft you wrote.”</p><br/><p>Director Joo Jaechan replied nonchalantly,</p><br/><p>“They are pretty much the same.”</p><br/><p>“I don’t think so. I asked the film production company and received a copy. The first draft with no title. I’m reading it right now.”</p><br/><p>I recalled the scenario I was halfway done reading as I said,</p><br/><p>“They are completely different projects.”</p><br/><p>“They are completely different projects.”</p>\n</div>\n<div style=\"max-width: 870px;margin: 5px auto;background: repeating-linear-gradient( 45deg, #fff6cc, #fff6cc 5px, #f3ecc7 5px, #f3ecc7 10px );\">\n<!-- Composite Start -->\n<div id=\"M562762ScriptRootC864255\">\n</div>\n<script async=\"\" src=\"https://jsc.mgid.com/m/e/media.boxnovel.org.864255.js\"></script>\n<!-- Composite End -->\n</div>\n<hr class=\"chr-end\"/>\n<div class=\"chr-nav\" id=\"chr-nav-bottom\">\n<div class=\"btn-group\">\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/top-management-chapter-202\" id=\"prev_chap\" title=\"Chapter 202\">\n<span class=\"glyphicon glyphicon-chevron-left\"></span>\n<span class=\"hidden-xs\">Prev Chapter</span>\n</a>\n<button class=\"btn btn-success chr-jump\" type=\"button\">\n<span class=\"glyphicon glyphicon-list-alt\"></span>\n</button>\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/top-management-chapter-204\" id=\"next_chap\" title=\"Chapter 204\">\n<span class=\"hidden-xs\">Next Chapter</span>\n<span class=\"glyphicon glyphicon-chevron-right\"></span>\n</a>\n</div>\n</div>\n<div class=\"text-center\">\n<button class=\"btn btn-warning\" data-chr-id=\"201513\" id=\"chr-error\" type=\"button\"><span class=\"glyphicon glyphicon-exclamation-sign\"></span> Report chapter\r\n                        </button>\n</div>\n<div class=\"bg-info text-center visible-md visible-lg box-notice\">\r\n                        Tip: You can use left, right, A and D keyboard keys to browse between chapters.\r\n                    </div>\n</div>"}