{"title": "Chapter 213", "id": 213, "volume": 3, "url": "http://boxnovel.org/top-management-chapter-213", "volume_title": "Volume 3", "body": "<h1>Chapter 213</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><header class=\"entry-header\"></header></p><div class=\"entry-content content\"><br/><p>Chapter 213: Management Business Division Team 4 Leader (2)</p><br/><p>TL: emptycube / ED: Isleidir</p><br/><p>“Team leader! Team-team leader!”</p><br/><p>The road manager who had been waiting for me outside ran over.</p><br/><p>“Tell me about the situation. How is she?”</p><br/><p>“I think she’s about to explode. The set has been an icy battlefield for hours now. The staff were causing a fuss since a while ago. I tried to calm her down with snacks, but she didn’t even give them a glance. I couldn’t handle it any longer…!”</p><br/><p>“If you couldn’t handle it, you should have contacted me.”</p><br/><p>He lowered his stiff hair.</p><br/><p>“Sorry! I was threatened, no, told not to contact you no matter what. I felt like the set would be flipped upside down at this rate, so I hid and contacted you in secret. She calms down in front of you…!”</p><br/><p>At first, he had looked like he was dreaming after being assigned to Lee Songha, but his face now looked like he was suffering from nightmares even though it hasn’t been a month.</p><br/><p>“Uh, you are talking about Lee Songha, right? Not Son Chaeyoung?”</p><br/><p>Chief Lee Bongjoon asked with dazed eyes as he followed us.</p><br/><p>I sighed as I waved my hand.</p><br/><p>“Let’s go.”</p><br/><p>“Yes!”</p><br/><p>I followed the road manager who quickly took the lead. As soon as I stepped onto the set, I felt like I heard ice crack. There were dozens of people here, yet it was oddly quiet. Only the sound of camera shutters interrupted the silence.</p><br/><p>Lee Songha was covered in flowers. She buried her cheek in a bouquet of yellow freesia flowers. She slightly bit one as she smiled brightly. As soon as I saw her, I was caught by a chilly emotion. It felt like an awl was lodged in the back of my neck.</p><br/><p>“Smile properly.”</p><br/><p>The photographer said. Lee Songha’s lips curved even more.</p><br/><p>“I have been smiling. For six hours.”</p><br/><p>“So smile properly. Properly. Prop. Per. Ly.”</p><br/><p>Lee Songha bit her lower lip at his shifty orders. Her face looked like she had endured enough and was about to explode. Clenching on the bouquet like she was about to crush it, Lee Songha lifted her gaze. The next moment, her gaze met mine.</p><br/><p>Her surprised face instantly distorted. Lee Songha glared at the road manager. The road manager made a sound like he was being strangled. At the same time, the photographer put his camera down.</p><br/><p>“Let’s take a break to cool our heads then come back.”</p><br/><p>Lee Songha immediately got up and came over with steadfast steps. It seemed like she might pull out a gun from the bouquet. Chief Lee Bongjoon backed away. Lee Songha simply passed us as she entered her waiting room.</p><br/><p>“… Did she just ignore you?”</p><br/><p>Chief Lee Bongjoon whispered with a flustered face.</p><br/><p>“Why is she like that? Did you two fight?”</p><br/><p>“No.”</p><br/><p>“Then I don’t understand? You said that this isn’t the first time she’s been causing trouble. Has the troublemaker title at our company been passed on from Son Chaeyoung to Lee Songha? While she wasn’t normal, she at least acted normally before. Why is she acting out now?”</p><br/><p>“Team Leader Jung Sunwoo? You’re Team Leader Jung Sunwoo, correct?!”</p><br/><p>I heard a woman’s voice. She was the editor I had met a couple times at photoshoots. She rushed over to us and clung to my arm like a lamb having found her savior.</p><br/><p>“Father in Heaven, thank you! Team leader, please save us!”</p><br/><p>“Sorry, Songha is not in a very good condition today.”</p><br/><p>“That’s true. I thought so. The photographer didn’t help either.”</p><br/><p>The editor glanced at the back of the photographer’s head before clinging onto me again.</p><br/><p>“Team leader! It’ll be big trouble if the photoshoot today fails. A huge problem! It took considerable effort to get the dress and jewels sponsored for today’s shoot from overseas, and we won’t be able to set this up again. Could you…!”</p><br/><p>“Please wait. I’ll go talk to her.”</p><br/><p>Leaving the other behind, I entered the waiting room alone.</p><br/><p>Lee Songha was sitting on a chair with her head down low. Her breathing was even ragged. It seemed like she tried to calm down the best she could as her exposed shoulders heaved up and down. When I approached her, I saw crushed, empty water bottles rolling on the floor.</p><br/><p>“I’ll get you some more water.”</p><br/><p>I turned around but almost fell. Lee Songha was holding the back of my knees with both hands.</p><br/><p>“Where are you going?”</p><br/><p>“To get you water.”</p><br/><p>“I don’t need it.”</p><br/><p>Her head was still way down. I fumbled with my pockets and took out a bunch of caramel that I had brought with me. She didn’t react even when I waved it in front of her eyes. On after I unwrapped one and put it in her mouth did she start to chew.</p><br/><p>“Oppa, say my name again.”</p><br/><p>“Lee Songha.”</p><br/><p>“…”</p><br/><p>“Do you want me to make an acrostic poem?”</p><br/><p>I joked, and she answered with a sigh-like laugh. She seemed to have calmed down as she raised her head. Then she quickly took her hands off my knees.</p><br/><p>“Sorry, I had blood on my hands.”</p><br/><p>“You don’t have blood on your hands, and are you not feeling well?”</p><br/><p>Lee Songha lowered her eyes.</p><br/><p>“It’s hazy. I almost swore at the photographer. That damn b-photographer was right. Today’s concept is the innocent freesia, yet I don’t know what an innocent expression is. I’m doomed. Flowers like these no longer suit me.”</p><br/><p>“Then what kind of flowers suit you?”</p><br/><p>“Marijuana.”</p><br/><p>Her symptoms were severe today.</p><br/><p>“Or a pitcher plant, or Venus flytrap.”</p><br/><p>“Those aren’t even flowers.”</p><br/><p>“That’s right. There are no flowers in my life. Since my life is a jungle.”</p><br/><p>“There are probably flowers in the jungle.”</p><br/><p>I locked the waiting room door and lightly patted Lee Songha’s head.</p><br/><p>“I thought you were getting better with those counseling sessions.”</p><br/><p>“I think I have dissociative identity disorder. Or intermittent explosive disorder.”</p><br/><p>“What’s that?”</p><br/><p>“It’s the proper term for multiple personality and anger management disorders. I saw it on the internet.”</p><br/><p>“Don’t joke and have another caramel.”</p><br/><p>It has already been a long time since filming was done, but Lee Songha still couldn’t get out of the female lead role from City Jungle. From what the counselor said, there were occasional cases where an actor became too absorbed in their role that it affected their daily lives.</p><br/><p>From the outside, it really looked like she was possessed.</p><br/><p>Although she was similarly absorbed in her role in previous works, she quickly turned back to normal afterward. Was her role in City Jungle particularly intense? There was a time where she flipped LJ over for touching her shoulder, and even a time when she couldn’t eat meat. Since her role was a vegetarian.</p><br/><p>I had only been worried about the end results for the film. I didn’t think I would be worried about something like this.</p><br/><p>“I told you to call me if there was a problem.”</p><br/><p>“I tried to handle it on my own. I can’t keep doing that. I was planning on carrying a miniature of you since I return to reality when I’m with you. But it was too difficult to make, so I gave up.”</p><br/><p>What a relief.</p><br/><p>“Instead, I found a place that’ll make it for you with a 3D printer.”</p><br/><p>“Just call me.”</p><br/><p>“I already ordered it. They said they already finished the head.”</p><br/><p>Lee Songha said while chewing her caramel defiantly.</p><br/><p>“Yeah, okay, whatever.”</p><br/><p>I guess I’ll just live with a bit of humiliation.</p><br/><p>Lee Songha’s head slowly leaned over until she rested her forehead on my belly. Then, like a woodpecker, she hit her head repeatedly, and sometimes made noises that were either violent or pitiful. During that time, I rubbed her head like I was stroking her hair.</p><br/><p>Then she raised her head up and smiled. It was a smile of innocence.</p><br/><p>*</p><br/><p>At the investment company managing City Jungle’s crowdfunding project.</p><br/><p>Vested parties gathered for the meeting at the company founded for funding projects.</p><br/><p>“How about we set the crowdfunding period to a week before release?”</p><br/><p>“Since this is for marketing purposes, why don’t we set the goal low? If we don’t reach our goal, it’ll only result in unpleasant rumors. It’ll also lessen the topicality and expectations. It’ll also be embarrassing.”</p><br/><p>“No, on the other hand, if we set the goal too low, it’ll look like we aren’t confident. It’ll look like we are trying to save ourselves. The press is watching this, so it’ll be worse than not doing it if we set the goal too low!”</p><br/><p>I sat near the window as I looked through the files.</p><br/><p>There were presentation slides introducing the film and investments, expectations on returns depending on viewership as well as previous crowdfunding scenarios among other things were clearly organized. They even mentioned me in the introduction of actors and staff.</p><br/><p>Posters of competing films released around the same time were on the last page.</p><br/><p>The list went from national blockbusters to famous Japanese animations. Our competition was no joke. Well-Made delayed the blockbuster they had originally planned and put City Jungle in its place, but there were reporters that were already saying this was a throwaway.</p><br/><p>Well, it wasn’t completely false.</p><br/><p>While looking through the posters, I stopped at one.</p><br/><p>Supernatural.</p><br/><p>Ace Distribution Company. Director Cha Jaeho. Leads Heo Kakyung and Han Seoyeon. Breakeven point at 4.2 million viewers.</p><br/><p>It was being released at almost the same time as City Jungle. On the same week, maybe even the same day.</p><br/><p>There were rumors that they were prepared to pour billions of won into publicity and advertisement to compete against Hollywood blockbusters.</p><br/><p>What did I say to Director Cha Jaeho last year? That I thought it would flop terribly? I definitely remembered how he cursed me. The back of my head felt itchy.</p><br/><p>Licking my lips, I flipped to City Jungle’s rate of return forecast in regards to investors.</p><br/><p>Our breakeven point was 1.6 million viewers.</p><br/><p>People could invest at least 100,000 won to at most 2,000,000 won. If we passed the breakeven point, we would get a positive rate of return, but if not, a negative one.</p><br/><p>All that was left was deciding what to set our crowdfunding goal to.</p><br/><p>“I’m telling you, lower is better. How about a hundred million to a hundred-fifty million?”</p><br/><p>“And I’m saying that’ll make it seem like we aren’t confident in our end product. We need it to be 300 million won at most.”</p><br/><p>The production company employees and producers were debating the pros and cons.</p><br/><p>I tapped my notebook with the tip of my pen before saying,</p><br/><p>“Can’t we just decide after we’ve had our internal screening for the final product?”</p><br/><p>The mood became strange. The expressions of the general manager from Well-Made Pictures, who argued for a smaller goal, SBE Film’s CEO, who argued for a larger goal, and Forest’s CEO, who was busy playing both sides, turned complicated.</p><br/><p>Well-Made’s general manager said,</p><br/><p>“I’m asking because you brought it up, but how did you like the draft version?</p><br/><p>“Drafts are just drafts. We need to decide after seeing the final product. Our director is working hard editing the film.”</p><br/><p>“While we call it a draft, it’s what we’re submitting to the Cannes Film Festival. You can consider it as the final version.”</p><br/><p>Everyone’s expression looked like they were just remembering that point.</p><br/><p>We were going to submit an edited version of City Jungle to Cannes Film Festival. While there were some who held hopes it would advance, another goal was to use that it was submitted to an international film festival as a way to promote it in the country.</p><br/><p>Either way, Director Oh Hyunkyung took a break in the real world before going back to increase the film’s polish. Staff who took a glance inside were astonished, saying that Director Oh Hyunkyung had been bitten by the editing bug.</p><br/><p>SBE Film’s CEO looked at me.</p><br/><p>“I think it’ll do well in the film festival, don’t you?”</p><br/><p>“I believe we might have a chance to go to France if we’re lucky.”</p><br/><p>SBE Film’s CEO stealthily rubbed his chest as though my words calmed his nerves. Although I changed the future and could no longer be certain of the results, I was sure that it was a film that would do well at film festivals.</p><br/><p>Well-Made’s general manager licked his lips.</p><br/><p>“Film festivals are good and all, but our box office performance is also important. The film is good. It is. But I thought this since reading the scenario and watching the draft, but it definitely lacks commercial value.”</p><br/><p>“We need to release it to know for sure. Last year, ’17 Days with You’ expected only a million viewers due to lack of commercial value after their internal screening, but in the end, they hit 2.5 million viewers.”</p><br/><p>“There are more cases where that isn’t the case. To be honest, we aren’t really interested in large profits and hope that we can at least hit the breakeven point. Aren’t we going to use all the money gathered through crowdfunding directly to marketing?”</p><br/><p>“Are you saying you want us to spend less money on marketing?”</p><br/><p>“That’s not it. If our crowdfunding goal is too large and our viewership numbers are lukewarm, the dividends…”</p><br/><p>“That’s why…!”</p><br/><p>And things became loud once more.</p><br/><p>Not long after the meeting, we held an internal screening with vested parties.</p><br/><p>That night, we decided to set the goal to 300 million won.</p><br/><p>*</p><br/><p>“Team Leader Jung, did you put on makeup because you’re going to be filmed?”</p><br/><p>“You did, you did. It looks like you also trimmed your brows?”</p><br/><p>Those people.</p><br/><p>When I turned around, the people stuck to my door acted like they were doing something else.</p><br/><p>“You’re going to interfere with the audio, so please leave. Also, I didn’t touch my brows.”</p><br/><p>“Now, let’s quiet down so that we don’t interfere with the audio!”</p><br/><p>They had no thoughts on leaving and simply shut their mouths. I looked at the Team 3 Leader, Kim Hyunjo, and Chief Lee Bongjoon at the front before simply shaking my head. The director fixing the white balance on the camera chuckled.</p><br/><p>“Shall we begin?”</p><br/><p>I coughed and cleared my throat at the director’s question.</p><br/><p>This was a promotional video for City Jungle’s crowdfunding event. Other actors, including Nam Joyoon and Lee Songha, had already filmed their part during filming, and I was the last. We planned on sending it out to the press and putting up on our crowdfunding webpage once it has been edited.</p><br/><p>We already began sending out press releases. We pour out all we could for a press conference and events to publicize and advertise the film. We had already started promoting it as well. The public’s reactions were growing heated as though they had been waiting for this.</p><br/><p>Of course, because most the attention is on crowdfunding, marketing employees were paying particular attention to this.</p><br/><p>While I was reciting the words I had prepared in front of the camera, the PR Team’s female employee squeezed in through the door.</p><br/><p>“Wait!</p><br/><p>She looked agitated.</p><br/><p>“Tema leader! Please stop filming for a moment! Su-Supernatural! Our competition!”</p><br/><p>“What about it?”</p><br/><p>“They decided to start crowdfunding too!”</p><br/><p>What?</p><br/><p>“Articles are being published as we speak! Their goal is 800 million won.”</p>\n</div>\n<div style=\"max-width: 870px;margin: 5px auto;background: repeating-linear-gradient( 45deg, #fff6cc, #fff6cc 5px, #f3ecc7 5px, #f3ecc7 10px );\">\n<!-- Composite Start -->\n<div id=\"M562762ScriptRootC864255\">\n</div>\n<script async=\"\" src=\"https://jsc.mgid.com/m/e/media.boxnovel.org.864255.js\"></script>\n<!-- Composite End -->\n</div>\n<hr class=\"chr-end\"/>\n<div class=\"chr-nav\" id=\"chr-nav-bottom\">\n<div class=\"btn-group\">\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/top-management-chapter-212\" id=\"prev_chap\" title=\"Chapter 212\">\n<span class=\"glyphicon glyphicon-chevron-left\"></span>\n<span class=\"hidden-xs\">Prev Chapter</span>\n</a>\n<button class=\"btn btn-success chr-jump\" type=\"button\">\n<span class=\"glyphicon glyphicon-list-alt\"></span>\n</button>\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/top-management-chapter-214\" id=\"next_chap\" title=\"Chapter 214\">\n<span class=\"hidden-xs\">Next Chapter</span>\n<span class=\"glyphicon glyphicon-chevron-right\"></span>\n</a>\n</div>\n</div>\n<div class=\"text-center\">\n<button class=\"btn btn-warning\" data-chr-id=\"201523\" id=\"chr-error\" type=\"button\"><span class=\"glyphicon glyphicon-exclamation-sign\"></span> Report chapter\r\n                        </button>\n</div>\n<div class=\"bg-info text-center visible-md visible-lg box-notice\">\r\n                        Tip: You can use left, right, A and D keyboard keys to browse between chapters.\r\n                    </div>\n</div>"}