{"title": "Chapter Fifty Six Determination", "id": 6, "volume": 1, "url": "http://boxnovel.org/world-of-cultivation-chapter-fifty-six-determination", "volume_title": "Volume 1", "body": "<h1>Chapter Fifty Six Determination</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Fifty Six Determination</p><br/><p>Great strength pill, no, golden crow pill, the change it caused to Zuo Mo’s circumstances was very evident, especially in resolving his financial situation. But no matter if it was Xu Yi Shixiong or Yan Le Shibo, they all seemed to think Zuo Mo didn’t have a chance. This could be seen from the talismans they gave. One gave a vambrace, the other ling armor. They was all defensive.Clearly, the two were only trying to make it a less ugly ordeal for Zuo Mo.</p><br/><p>Right now, the problem in front of Zuo Mo was very serious.</p><br/><p>One was earning jingshi, the other was practicing sword scripture.</p><br/><p>Presently, he was in debt. Earning jingshi was undoubtedly the most pressing. No matter what time, earning jingshi was the greatest problem he had to face. And cultivating sword scripture, in a very large way, it would decide his outcome when he faced Luo Li’s challenge in the sect assessment.</p><br/><p>This two matters all dragged in a question. Time. If he made dan, then the time he had to practice sword scripture would drastically shorten. Originally, he didn’t have much of a chance at winning. Calculating it that way, Zuo Mo felt his rate of winning was basically zero.</p><br/><p>In the end, did he want jingshi or to fight for his honor?</p><br/><p>Zuo Mo became trapped in a dilemma.</p><br/><p>“Ye, what have you been up to recently?” The pink paper crane flew in, the same graceful writing.</p><br/><p>“Practicing the sword!”</p><br/><p>“Oh, when did ye become so vigorous? I’m not very used to it.”</p><br/><p>“Going up against a cold and perverted man!”</p><br/><p>“Hee hee, what happened?”</p><br/><p>“His woman flirted with me, got slapped. He came to get back.” Zuo Mo gave it a bit of “improvement”. Oh, it could be considered flirtation, Zuo Mo thought.</p><br/><p>“Chop him!” A strong bandit aura came through the two graceful words. Zuo Mo, a man, blushed with shame.</p><br/><p>“But right now there’s a really good chance to earn lots of jingshi.” Zuo Mo, for some strange reason, wrote down his dilemma.</p><br/><p>“Gentlemen can be killed, but cannot be humiliated. Just measly jingshi. Do not let me look down on ye.”</p><br/><p>Just measly jingshi. As expected from those that didn’t know hunger and thirst. Zuo Mo was reflecting. Why did he ask such an unreliable person? He disdainfully replied: “Woman, what gentleman are you?” His gaze uncontrollably stopped for a while on the “gentlemen can be killed but cannot be humiliated.”</p><br/><p>“Hee hee, I only hope for ye to display his masculinity!”</p><br/><p>“Ye’s going to work. Don’t reply.” Zuo Mo returned the words and threw the brush to one side.</p><br/><p>Zuo Mo spent one day working hard in the dan room. He gave all the golden crow pills he made to Yan Le Shibo to free Li Ying Feng Shijie from her predicament.</p><br/><p>Before the sect assessment, Zuo Mo decided not to make anymore. He decided to put all his time on practicing the sword. Whenever he thought about Luo Li and Hao Min’s face, his entire body was filled with the urge to fight. Why did he earn jingshi? Wasn’t it to become strong, wasn’t it to become strong and be able to find the answer?</p><br/><p>After thinking it through, he didn’t hesitate any longer.</p><br/><p>Hesitance, indecisiveness, it was all brushed away. Zuo Mo felt the world suddenly became light, his mind clear, unspeakably comfortable.</p><br/><p>Returning to West Wind Valley, he took up Ice Crystal Sword and started to practice [Li Water Sword Scripture] over and over.</p><br/><p>He closed off the valley and he had hanged up a sign saying: “In seclusion, do not disturb.”</p><br/><p>This quickly became a joke in Wu Kong Sword Sect. Zuo Mo had come out of the outer sect disciples, the incident with Hao Min made others feel he was too arrogant. Adding on the hot sales of golden crow pill, there were many that were jealous. Many people were looking to see his joke.</p><br/><p>This was the difference. Luo Li’s attitude was cold and arrogant but people were only in awe and found it matter of fact. And Zuo Mo slapping Hao Min, even though it was first Hao Min’s fault, but people didn’t like seeing it.</p><br/><p>Just at this time, Qin Cheng Shixiong came back. Qin Cheng Shixiong was the student of the sect leader. His cultivation wasn’t the highest, nor was his attack power. But he was born authoritative, deeply trusted by others and had a high reputation.</p><br/><p>Luo Li and Qin Cheng sat facing each other. Qin Cheng had a square face and thick brows. His clothes were dusty, the exhaustion in his brows unable to be covered. But sitting there, he naturally gave off an aura of authority.</p><br/><p>Qin Cheng lectured: “You were too brash. Taking Hao Min Shijie for this long and not returning, no wonder Sect Leader was angry.”</p><br/><p>Facing Qin Cheng, the iciness on Luo Li’s face dissolved slightly. He was unconcerned: “As long as she’s happy.”</p><br/><p>Facing his Shidi, Qin Cheng was helpless. How his shimei Hao Min’s personality was, he knew very well. He could only change the topic: “Have you improved recently?”</p><br/><p>Luo Li said proudly: “Fifth level.”</p><br/><p>Qin Cheng gave a comforted expression. He took out a jade scroll: “This is [Shapeless Sword Scripture]. Take it and study it well.”</p><br/><p>When Luo Li heard the words [Shapeless Sword Scripture], the light in his eyes brightened.</p><br/><p>“Wei Sheng has entered the Sword Cave, the sect leader and others have high hopes for him and must be hoping that he could recover [Void Sword Scripture].” Qin Cheng glanced at Luo Li: “He once was your sword servant, you cannot lose to him.”</p><br/><p>Luo Li’s expression was abnormally ugly, his fists clenching, unfeeling of the nails biting into his flesh. This matter, it had been a thorn in his heart. That pathetic person that he had ordered around before, the attentions paid to him now in the sect far surpassed himself. Whenever he thought about it, it was like there were worms chewing on his heart.</p><br/><p>“In the past, [Void Sword] was split into [Shapeless Sword Scripture] and [Empty Sword Scripture]. If the sword scripture could be split, it can be merged again. Wei Sheng might have outstanding your talent, but I’ve always been confident in Shidi’s talents.” Qin Cheng said slowly: “I hope that this can recover the glory of the founder on Shidi’s hands.”</p><br/><p>Luo Li’s breathing became rushed. He stared at the jade scroll on his hand, his expression changing.</p><br/><p>[Void Sword Scripture], this name that he had dreamed countless times about. The highest skill that the founder of the sect had created! In the countless techniques of the world, it ranked sixth grade, immensely powerful!</p><br/><p>Recover the founder’s glory……</p><br/><p>Shixiong’s words were like thunder from the heavens, echoing by his ears. The blood in his body seemed to have been light up. He seemed to see himself standing in the clouds, looking down at the world!</p><br/><p>Barely suppressing the excitement in his heart, he put away the jade stick and bowed slightly, stating seriously: “Shidi will try the best!”</p><br/><p>Wu Kong Hall, Pei Yuan Ran and Xin Yan were drinking tea. After killing yao last time in the ling fields, when they had the free time, they would gather to drink tea and chat.</p><br/><p>“It’s a pity that Third Shidi isn’t here, otherwise we three would have gathered again.” Pei Yuan Ran smiled: “He’s probably going to be busy for a while.”</p><br/><p>Xin Yan drank his tea. He was different in the way he drank, completely lacking the grace and idleness that other people had. Whenever Pei Yuan Ran would pour it full for him, he would raise it and drink to the bottom. Clean and crisp. After that, he poured it for himself, drinking cup after cup.</p><br/><p>“Drinking like you, it really is wasting my ling tea.” Pei Yuan Ran was in pain.</p><br/><p>Xin Yan didn’t even look at him, not stopping. He asked: “What Tian Song Zi said, how about it?”</p><br/><p>Pei Yuan Ran’s face became serious: “It’s not unreasonable. Third Shidi had been complaining a while ago that the price of ling grains had risen astronomically. It is a little hint. How do you feel?”</p><br/><p>Xin Yan stopped for the first time. He nodded his head: “I feel it’s true.”</p><br/><p>“Why?”</p><br/><p>“Hunting yao is getting harder and harder.” Xin yan said: “On the market, the number of yao inner cores have become less and the price as multiplied.”</p><br/><p>“I forgot that you also forge.” Pei Yuan Ran nodded in agreement: “It’s true that there are less people willing to hunt yao. Even those big sects, they put their direction onto searching for new jie.”</p><br/><p>The words of the two were filled with worry. Three thousand years, the xiuzhe had defeated the yaomo. The remaining strong yaomo had used their own bodies and blood as the guide, seven medium jie as the axis, forty nine little jie as the screen to create Bloody Sky Metropolis Jie. Ling energy in Bloody Sky Metropolis Jie was extremely lacking, extremely disadvantageous for xiuzhe. Yaomo, on the other hand, were not affected. This meant that Bloody Sky Metropolis Jie became the yaomo’s most trusted defensive line.</p><br/><p>But in these three thousand years, the attacks of xiuzhe against Bloody Sky Metropolis Jie had never stopped. Bloody Sky Metropolis Jie had become a constant battlefield. Countless cultivators had become famous there.</p><br/><p>Many things on the body of yaomo were rare materials for xiuzhe. Forging, dan-making, food, it was all useful. The stronger the yaomo, the higher the value. Therefore, many people went for the yaomo and then this exercise had its own name: Yao Hunt.</p><br/><p>However, in the recent long period, there were less and less people going to Yao Hunt. The continuously appearing yaomo strong masters caused the casualty rate of the cultivators in Yao Hunt to be extremely high. The risk was too high ,the profits shrunk and caused the number of cultivators in Yao Hunt to decrease dramatically.</p><br/><p>And in the last few years, the active area of cultivators in Bloody Sky Metropolis Jie kept retreating. Incidents where yaomo actively attacked xiuzhe had occurred. Everything was hinting that the yaomo had recovered.</p><br/><p>All the cultivators who had at least some foresight were full of worry.</p><br/><p>If yaomo could push the xiuzhe out of Bloody Sky Metropolis Jie, that meant that they could start an attack on xiuzhe at any time!</p><br/><p>There wasn’t any room for diplomacy between xiuzhe and yaomo. Three thousand years ago, the xiuzhe almost exterminated all yaomo. Only now have they recovered, and the hatred between them were as deep as the sea.</p><br/><p>If another great war like the one that occurred three thousand years ago happened again, not one xiuzhe would be unaffected.</p><br/><p>“He wants to host a Dong Fu Sword Test Conference? Why would Tian Song Zi mention Zuo Mo’s name?” Xin Yan asked: “He is only a ling plant farmer.”</p><br/><p>In the letter Tian Song Zi gave Pei Yuan Ran, he said he would host a sword test conference. Inside, he had specifically mentioned Wei Sheng and Zuo Mo’s names.</p><br/><p>“Don’t know.” Pei Yuan Ran grimaced: “Probably that the incident with golden crow pill had been too big and attracted Tian Song Zi’s attention. Right, who do you feel about that youth, Yu Bai?”</p><br/><p>“Not bad, stronger than Luo Li.”</p><br/><p>“Wei Sheng?”</p><br/><p>“Hard to say.”</p><br/><p>“It seems that Tian Song Zi’s branch will have a successor.” Pei Yuan Ran drawled: “Zuo Mei Tian’s disciple supposedly isn’t bad. If there really is a Dong Fu Sword Test Conference, it would be a bit interesting.”</p><br/><p>Xin Yan didn’t speak and started to drink another cup of tea. After a while, he raised his head: “You agreed?”</p><br/><p>“No rush, have to wait for Wei Sheng to come out of the Sword cave. Even more, the sect assessment is starting.” Pei Yuan Ran smiled: “Have you heard about the matter between Luo Li and Zuo Mo?”</p><br/><p>“Winning dishonorably.” Xin Yan spat out.</p><br/><p>“Haha, that’s true.” Pei Yuan Ran laughed. A beat later, he said: “Luo Li’s talents isn’t bad, but his personality is a bit lacking. If he’s like Wei Sheng……”</p><br/><p>Xin Yan rolled his eyes: “Don’t be greedy.”</p><br/><p>“Haha……” Pei Yuan Ran laughed again.</p><br/>\n</div>"}