{"title": "Chapter Sixty Eight – A Rare Leisure", "id": 18, "volume": 1, "url": "http://boxnovel.org/world-of-cultivation-chapter-sixty-eight-%E2%80%93-a-rare-leisure", "volume_title": "Volume 1", "body": "<h1>Chapter Sixty Eight – A Rare Leisure</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>This chapter has been brought to you by me, warlord212, cactuar0, and WanderingGummiOfDoom.</p><br/><p>Chapter Sixty Eight – A Rare Leisure</p><br/><p>There was a pale blue third grade water grass lying in the jade box. Light flickered across the plant and it exuded a faint coldness.</p><br/><p>Icy Cloud Grass. It was a very rare water element ling grass. Its shadow could be found in many kinds of high level dan recipes. To say nothing else, Zuo Mo knew that even Master didn’t have ice cloud grass in her fields. Ice cloud grass grew in the coldest of climates, it wasn’t easily grown and was hard to find.</p><br/><p>It probably wasn’t possible to buy such a high quality ice cloud grass in Dong Fu, and showed just how valuable it was.</p><br/><p>“This is too valuable.” Zuo Mo strongly controlled the greed in his heart and pushed the jade box back in front of the Eldest Shijie.</p><br/><p>A flicker of admiration ran through Gong Sun Qing’s eyes. She once again pushed the jade box to Zuo Mo. “Don’t refuse, Shidi. This ice cloud grass, it leans towards the cold and the water element. The dan that can be made from this would certainly be lingdan of the ice and water elements. In this sect, other than Shidi, no one is appropriate for this.”</p><br/><p>Zuo Mo thought and then said: “Two hundred. The other one hundred would be a token of Shidi’s goodwill.”</p><br/><p>Gong Sun Qing didn’t refuse and smiled broadly: “Many thanks, Shidi.”</p><br/><p>Everyone talked for a bit longer, but their interests didn’t match. Zuo Mo felt especially negative towards Xu Yi Xia. The three stood up and left. Zuo Mo walked with them to the mouth of the valley. Before leaving, Xu Yi couldn’t resist reminding Zuo Mo of the golden crow pills he had already ordered. Zuo Mo nodded.</p><br/><p>Zuo Mo could finally take a breath. Returning to his little yard, he didn’t want to do anything. Today’s ups and downs, it was enough to tire him out.</p><br/><p>But he still moved the ice cloud grass into the ling spring of the rock room first. That ling spring was near the ling vein and the ling energy was extremely thick, and suited for the growth of the ice cloud grass. The reason he had been so happy seeing the ice cloud grass wasn’t completely due to its value, but because the jade scrolls of Elder Wei Nan recorded a kind of water method to make a lingdan. Its main ingredient was ice cloud grass. This lingdan was called ice cloud dan. It could dramatically increase a cultivator’s power over water.</p><br/><p>The jade scroll hadn’t recorded just how great the increase was. However, for Zuo Mo, it still would be very beneficial. He wasn’t a sword xiu and didn’t need to consider the problem of the chaos of the five elements. Any element in the five elements was extremely useful for him. If his water power grew, the power of his [Li Water Sword Scripture] would be even greater, and easier for him to manipulate.</p><br/><p>But temporarily, he didn’t have the time to make the ice cloud dan. He was in deep debt!</p><br/><p>Golden Crow pill……</p><br/><p>Whenever he thought about the enormous amount of golden crow pills, Zuo Mo had the impulse to faint.</p><br/><p>But today, it wouldn’t be today. He buried his head and slept.</p><br/><p>The next morning, Zuo Mo woke up and started his crazy dan-making days. Xu Qing seemed to know of the matter and had prepared large amounts of the ingredients for the fasting pill beforehand.</p><br/><p>Looking at the mountain of raw materials in front of him, Zuo Mo wanted to cry. He forced himself to start!</p><br/><p>A crowd of people appeared in a mountain valley not far from Dong Fu. Their clothing was different and so was their expression.</p><br/><p>“It’s nearby.” One of the people said. His face was serious: “But it’s hard to find the exact location.”</p><br/><p>“I think that it’s here.” Another yellow-clad cultivator snorted coldly and followed: “We’ve gone through the other twelve towns. Other than here, where else?”</p><br/><p>The other people looked at the silver-clad man that seemed to be the leader. The expression on this male’s face was extremely faint. The long robes on his body seemed to have been woven from silver thread, the light gleaming. In the crowd, he was extremely eyecatching.</p><br/><p>The silver-clad man mused for a beat before opening: “Settle down first and then search.”</p><br/><p>The crowd flew in the direction of Dong Fu.</p><br/><p>Four hours later, at the same location that the crowd of people had gathered, light flashed, and a crowd of black-clad people appeared. They were all wearing copper masks, the patterns on the masks extremely fierce and only revealing the eyes.</p><br/><p>“Just in this area. Still not clear about the exact location.” A black clad person said. Then he made a sound of surprise: “There were people just here, not an insignificant number.”</p><br/><p>The leader of the crowd didn’t say anything. He lightly waved his hand and the crowd of black-clad people disappeared into the air.</p><br/><p>A while later, a white-clad male appeared. If Zuo Mo could see it, he would be shocked to find that it was the person he had thought was a rich young master, Lin Qian. He only took a glance before disappearing.</p><br/><p>Zuo Mo’s display in the sect assessment really shocked everyone. The next few days, there were continuous visitors. With no other solution, Zuo Mo could only hang up a sign of seclusion at the mouth of the valley. These few days, he had made dan to the point he almost threw up. For Eldest Shijie, for Xu Yi Shixiong, to give to Li Ying Feng Shijie to sell. Only later did he remember that he didn’t have any fire seeds himself. Fourth grade fire source! If he didn’t have one himself, why would he keep on making it?</p><br/><p>According to the appraisal, there was a probability that it could form golden crow fire. He speculated it was related to the number. Steeling his heart, Zuo Mo decided to make five hundred for himself. In any case, it wasn’t as though eating too much would kill him. If he could really form golden crow fire, then he really would have struck gold. Fourth grade fire source. The grade of the lingdan that he made would increase a grade.</p><br/><p>Thinking of the possibility, he decided to just stay inside the dan room.</p><br/><p>Xu Qing was one of the busiest people around. She could almost be considered Zuo Mo’s spokesperson. Each day, she needed to give Zuo Mo the dan ingredients that had been prepared, and then had to help him distribute the golden crow pill. There wasn’t much variance in the amount of golden crow pill that would be made each day, but who would get them? That was a major question. Zuo Mo, finding it a giant headache, threw the question to Xu Qing. Previously, he owed her a favor. Zuo Mo was very willing to help her.</p><br/><p>The result of this action was that Xu Qing’s status in the sect instantly rose.</p><br/><p>She had been the first seat of the Fragrant Ginger Yard’s outer sect disciples for a significant amount of time and was extremely good at managing different personal relations and knew how to observe expressions. This kind of person, who would easily offend her? And now that she had the power to divide the golden crow pill, everyone wouldn’t dare to offend her at this time. The temptation of a fourth grade fire seed was too much. The only exception was Hao Min. Because of Zuo Mo, she found Xu Qing even more of an eyesore. But when she thought about the strength he had shown in the sect assessment, she didn’t dare to do anything.</p><br/><p>Zuo Mo had dared to slap her the previous time. If she provoked him, Zuo Mo definitely dared to slap her again.</p><br/><p>How could Xu Qing not know that Zuo Mo was helping her? She was grateful inside and tried her best to finish everything beautifully. She had been shocked at Zuo Mo Shixiong’s performance in the sect assessment but what she really respected was Shixiong’s craziness as he made dan.</p><br/><p>She was very clear how much ingredients she would send in.</p><br/><p>Maybe, for outer sect disciples, talent was something that couldn’t be found everywhere. But painstaking effort was something everyone could do and was more worthy of respect!</p><br/><p>Not just her, the entire Fragrant Ginger Yard had been frightened by Zuo Mo’s frenzy. Even Shi Feng Rong had, on multiple occasions, called Xu Qing in to ask about the situation. And Xu Qing, within the limits of her power, gave Shixiong all the help she could give. Like when people asking for golden crow pills would give something like ling grains or vegetables, Xu Qing would especially get a shimei skilled in making food to make ling food and send it to Zuo Mo.</p><br/><p>And then, she quickly found, that Zuo Mo would make a few more extra golden crow pills. She knew that helping her out.</p><br/><p>For the first time in almost twenty days, Zuo Mo walked out of the dan room. Pushing open the door, he narrowed his eyes instinctively against the sun.</p><br/><p>Xu Qing, rushing about in the yard preparing ingredients, saw the situation and ran over: “Shixiong.”</p><br/><p>“Its nothing. I’m coming out to take a breather.” Zuo Mo motioned for her to do what she needed.</p><br/><p>After furiously making dan for almost twenty days, he finally completed the majority of his debts and could take a breath. The sun splashing on his body was warm. Zuo Mo felt extremely comfortable. He ran over to ask Xu Qing: “Do you have a sound tablet?”</p><br/><p>Xu Qing was slightly puzzled but still ran to a room and took out a sound tablet to give to Zuo Mo.</p><br/><p>Taking the tablet, he disregarded the surprised expressions of the shimei and jumped onto the roof. Adding ling energy into the sound tablet, he set it by his side and then laid down, sunning himself and humming a tune.</p><br/><p>It had been so long since he was this free. Zuo Mo was extremely relaxed.</p><br/><p>Just as he relaxed, it suddenly darkened. Stopping his humming, Zuo Mo opened his eyes. In the sky overhead, a gigantic ship slowly flew past. The size of the large boat was about the same as the thousand wing ship that Zuo Mo had seen before. But the bow was even more sharp, the main body of the ship surrounded by a crowd of beautifully colored birds.</p><br/><p>Hm. Zuo Mo sat up. Face tilted upward to look at the large ship, he searched for what possible large personage that had come to Dong Fu.</p><br/><p>This large ship had alarmed many people. The female disciples in the yard stopped what they were doing and held a discussion.</p><br/><p>Coincidentally coming out, Shi Feng Rong noticed the large ship and a strange flicker flashed across her eyes. Her mouth scolded: “Stop being noisy!”</p><br/><p>Hearing Shi Feng Rong’s reproach, everyone instantly became silent and started their work again. Shi Feng Rong then scolded Zuo Mo who was on the roof: “Go make dan!” Finishing, she left in the direction of Wu Kong Hall. Zuo Mo didn’t care about being scolded. Inside, he was speculating, did the big ship have a relation with the sect?</p><br/><p>He felt that Master’s expression today wasn’t normal. There definitely was something!</p><br/><p>Of course, he could only speculate. Don’t think that Master was just a woman. With her cultivation of jindan, in Dong Fu, that was definitely in the first class people.</p><br/><p>Even if something had happened, he couldn’t do anything to help. It was good if he didn’t make trouble. Thinking about it, Zuo Mo strolled back to his own little yard.</p><br/><p>He first went to inspect the ice cloud grass. Seeing vigorous growth, he meditated for four hours in the rock room. Due to the ling vein in the rock room and the ling food Xu Qing had provided, the increase in Zuo Mo’s cultivation recently was extremely clear. It would just be a while before he would reach the second level of zhuji.</p><br/><p>Because he had been busy with making dan, he hadn’t read the jade scroll that Xin Yan Shibo had given him. The ling grasses and herbs in the ling fields had also been neglected recently. The jinzhi outside the valley needed to be set up again. He still needed to keep making golden crow pills. He yearned very much for the fourth level golden crow fire.</p><br/><p>Busy, busy!</p><br/><p>He liked this kind of busyness. His life was very full.</p><br/><p>He suddenly thought that it had been a long time since he went into his consciousness to see Pu Yao. He didn’t know what the other had been doing.</p><br/><p>Entering the sea of consciousness, it still looked normal. Zuo Mo couldn’t help but release a breath. What he was most afraid of was that there would be changes every time he came here. And no matter what changed, he wouldn’t understand.</p><br/><p>But when he saw Pu Yao’s state, he was alarmed.</p><br/><p>Translator Ramblings: Delayed gratification is good for the soul (not!) but you guys can make it through🙂. The wider world start to intrude on Zuo Mo’s life, even though all he want is to make jingshi. Dum dum dum.</p><br/>\n</div>"}