{"title": "Chapter Seventy Seven Plot", "id": 27, "volume": 1, "url": "http://boxnovel.org/world-of-cultivation-chapter-seventy-seven-plot", "volume_title": "Volume 1", "body": "<h1>Chapter Seventy Seven Plot</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>This chapter has been brought to you by me, WanderingGummiOfDoom, and warlord212.</p><br/><p>Clarification: the yin bead is not a dan. It’s a condensation of energy, similar to the water crystal in Zuo Mo’s sword (but much more powerful and valuable).</p><br/><p>Chapter Seventy Seven Plot</p><br/><p>Zuo Mo stared dazedly at the patches of signs in the free market.</p><br/><p>Pu Yao’s countenance was extremely smug and arrogant. The depression over the recent failure sweeping away as he said, “See, I said so. Yin beads are very valuable!”</p><br/><p>Zuo Mo gradually regained his focus. As he swept his gaze across the market, he saw the little girl that had brought yin beads from him the previously. The little girl seemed quite panicked. Did she need the yin beads desperately? Zuo Mo couldn’t help but speculate inside. The little girl had been very kind so Zuo Mo had a good impression of her.</p><br/><p>It appeared that the yin beads were useful. Last time, when the little girl had come, she had only brought one out of kindness. At that time, she probably didn’t recognize yin beads. Zuo Mo ruminated about selling them.</p><br/><p>Zuo Mo didn’t pay attention to Pu Yao. Walking in front of the little girl, he said, “You’re buying yin beads? How many?”</p><br/><p>Just at this time, Pu Yao suddenly said in a grave tone, “Run!”</p><br/><p>Zuo Mo paused.</p><br/><p>“Who would have thought that this little town of Dong Fu was concealing so much. Even something that has been lost for so long, like yin beads, also appeared,” A slightly piercing voice said reflectively. The person who spoke was the yellow robed Taoist.</p><br/><p>“Yes. I was also very surprised when I learned about it,” The silver clad man said, a flash of puzzlement running through his eyes, “The Devilings Sect has been dead for so many years, how can a successor have appeared?”</p><br/><p>“It’s not easy guessing about a sect’s succession,” The yellow robed Taoist’s eyes followed the silver-clad male closely, “Why do you not find someone else?”</p><br/><p>The silver-clad male’s expression was normal, “The others? They can’t do it,”</p><br/><p>The yellow robed Taoist smiled smugly, “Exactly. Except for you and I, the others are only average. They cannot do anything and will ruin things! Are you sure that the person who is selling the yin beads will definitely appear?”</p><br/><p>“I am not sure,” The silver-clad male shook his head.</p><br/><p>The yellow robbed Taoist’s expression changed, his pupils suddenly shrank, “You are making fun of me?”</p><br/><p>The silver-clad male was not affected, “I’ve shared the information with you. If you do not find it useful, you can leave. The method of making the yin beads, it is worthy of you waiting a while,”</p><br/><p>The yellow robed Taoist stared at the silver clad male for a long while before suddenly laughing, “You’re right! The Devilings Sect was so famous in the past, what they relied on wasn’t just the way to make yin beads. Ha ha, if I can find this person, all of the techniques of the Devilings Sect would land in our hands,”</p><br/><p>“Don’t be happy this early,” The silver clad male said, “There are probably many that have the same idea as us.”</p><br/><p>“Humph. They dare to steal from me, the are courting death!” The yellow robed Taoist icily said.</p><br/><p>“It’s best to be careful. Even those people from Bright Wave Jie were ambushed and one was killed,” The brow of the silver clad male furrowed. He felt extremely puzzled by that incident. Even though he had said clever words, but he was still extremely wary of the group from Bright Wave Jie. Additionally, he had needed Yuan Li to find the yaomo. He was very clear about Yuan Li’s abilities but no one could have thought that Yuan Li would die in an ambush!</p><br/><p>That had ruined his arrangements.</p><br/><p>Who was it that had killed Yuan Li?</p><br/><p>This ambush which had a clearly targeted Yuan Li, had instantly turned everything into a mess. Now that Yuan Li had been killed, his sect definitely would be angry. The branch of the Master of Bright Wave Jie would not tolerate this kind of action. If this situation dragged on, there would definitely be large numbers of high level xiuzhe that would arrive and complicate the situation.</p><br/><p>If that happened, then he would lose the chance to benefit from this incident.</p><br/><p>He had reacted extremely quickly and changed direction when he had seen a shift. The news that Yun Xia xianzi had relied on a yin thunder bead to escape the ambush had spread through Dong Fu. The attentions of many people had been aroused, including himself.</p><br/><p>Just at this time, he made a sound, and his eyes were looking at a male standing in front of a stall.</p><br/><p>“What?” The yellow robed Taoist became alert, “Did you find something?”</p><br/><p>“He seems to have arrived,” The silver clad male stared at the average-looking man.</p><br/><p>“Him?” Following the eyes of the silver clad male, the yellow robed Taoist also looked at Zuo Mo that was in front of Xiao Huan’s stall, “A little guy with a cultivation of zhuji, that’s not likely,”</p><br/><p>The gaze of the silver clad male didn’t move, as he informed, “That little girl is the maid of Yun Xia xianzi. Last time, it was her that bought the yin beads. There are so many stalls in the market but that person didn’t go to any one else but straight to her’s. It’s suspicious,”</p><br/><p>“It really is suspicious,” By this time, the yellow robed Taoist also understood and the glimmer of greed flashed in his eyes.</p><br/><p>It wasn’t just the two of them that had noticed this.</p><br/><p>Just as Zuo Mo went to leave, a young person appeared behind him, “Do you want to sell yin beads? Why don’t you sell to me and we can negotiate the price,”</p><br/><p>Zuo Mo, who had received Pu Yao’s warning, instantly noticed the many gazes that had gathered on his person. He became alarmed and knew that the situation was dangerous. It was a good thing that the yin beads could be sold for a good price, but if he had to pay with his life in the process, then he wasn’t willing.</p><br/><p>“I don’t have yin beads,” Seeing the situation, Zuo Mo quickly pretended to be ignorant, “I just noticed that you guys have been putting up stalls here for many days and was curious. What sort of treasure is this yin bead? How much is it worth? Do you have an example? Can you let me take a look? If I encounter it, I wouldn’t pass on a chance to get rich,”</p><br/><p>“Really?” The young person smiled coldly, “Then why didn’t you come ask me, but went straight to her?”</p><br/><p>Xiao Huan couldn’t resist anymore. Her brows raising, she said angrily, “The one named Xue, what do you mean? Why can’t he come to this lady’s stall?” This youth was Wen Tie sanren’s disciple. He was called Xue Yun. Xiao Huan always found him to be an eyesore.</p><br/><p>“This one doesn’t mean to suggest anything,” Xue Yun smirked icily, “This one is only working on behalf of my Master. Something as good as yin beads, they can’t all go to one person,”</p><br/><p>Zuo Mo gave a smile, “You must have misunderstood. I don’t have yin beads,” The young man had a cultivation of ningmai and wasn’t someone that a little zhuji cultivator could battle against. Zuo Mo wasn’t dumb. He understood that, if he really took out the yin beads right now then he really would die. He definitely wouldn’t get yin beads, and the other certainly would try to force out the spell to form yin beads. Otherwise, he wouldn’t be let go.</p><br/><p>“Don’t have yin beads?” Xue Yun snorted, “That will have to be determined after I search you,”</p><br/><p>Xiao Huan stood resolutely in front of Zuo Mo and said angrily, “You dare!” She wasn’t stupid. If Xue Yun hadn’t come, she might not have recognized Zuo Mo, but Xue Yun’s behaviour made her look closely. She found that, while this person’s appearance was different, but his figure was similar to the person from last time.</p><br/><p>Xue Yun looked disdainfully at Xiao Huan, “You’re just a maid. Do you think yourself important!”</p><br/><p>Finishing, he didn’t look at Xiao Huan and strode towards Zuo Mo.</p><br/><p>Zuo Mo saw that the situation could not be resolved, and thought that with his pitiful and weak speed even if he were to run he would most likely be unsuccessful. He really had bad luck today! Zuo Mo grimaced inside. As expected, it was risky trying to make jingshi like this and he needed to be cautious! Looking at Xue Yun who seemed extremely certain, Zuo Mo’s eyes darkened, murderous intent was rising inside. The other’s cultivation far surpassed his and he didn’t think he could win even with trickery. Noticing the confidence on the young man’s face, he decided to give the other a little surprise.</p><br/><p>His eyes staring fixedly at Xue Yun, the ling energy in his body moved furiously. He was waiting for Xue Yun to come near and what would welcome Xu Yue would be Zuo Mo’s strongest sword attack – [Li Water Burning Heavens]!</p><br/><p>Just at this time, suddenly someone interrupted, “Ha ha, no wonder Wen Tie sanren isn’t respected. It can be understood from seeing his disciple,”</p><br/><p>Xue Yun’s expression instantly changed. His eyes darkened, he stopped in his steps and shouted loudly, ‘Who is this? Your word are really frightening! Why do you hide? Do you not dare to come out?”</p><br/><p>“Just someone like you, are you enough for Ye to come out?”</p><br/><p>The voice was faint and one could not locate the source. Xue Yun’s expression finally changed, and there was shock in his eyes. He had focused on listening just now but still couldn’t find where the voice came from. This meant that the other’s cultivation was much higher than his.</p><br/><p>While Xue Yun was in shock, a figure suddenly leapt at Zuo Mo.</p><br/><p>“You dare!” Several shouts sounded out simultaneously.</p><br/><p>Swords flashed and several bright lights could be seen as flying swords flew at the figure!</p><br/><p>All of these people were all highly skilled. Although their target wasn’t him, the sharp sword essence inside the sword energy was enough to make Zuo Mo’s skin hurt. He was extremely shocked inside. Only now did he realize that the non-descript yin bead had such a shockingly high value!</p><br/><p>Pu Yao did have something valuable in his possession. At such a dangerous time, such a nonsensical thought had floated through Zuo Mo’s mind.</p><br/><p>There were thousands of sword energies that formed a net but they didn’t harm Zuo Mo one bit.</p><br/><p>The cultivation of the figure wasn’t normal either. A faint green flying sword flashed and formed a net of light in front of him, barely stopping the other flying swords. The figure suddenly disappeared from his spot. Being alone, he naturally wasn’t a match for a the group.</p><br/><p>Just as everyone was attacking this person, a dark red rope was silently nearing Zuo Mo.</p><br/><p>The silver clad male was the first to find it. He snorted icily, “Wanting to take advantage of the fight, it won’t be that easy!” He pointed with a hand and a silver light struck the dark red rope. The dark red rope wasn’t an average grade talisman. Like a wave, the dark red rope fluttered and then dissipated the silver light.</p><br/><p>The silver clad male didn’t waste words. His silver hooked sword turned into an extremely thin silver light, and like a snake climbing a tree, circled and constricted around the dark red rope.</p><br/><p>The yellow robed Taoist and the figure who had leapt at Zuo Mo were engaged in battle with each other. The figure seemed to be shrouded in a ball of smoke. No one could clearly see his appearance. The shape of his body changed rapidly. The yellow robed Taoist evidently was taking the fight seriously. The yellow gold flying sword was like a sun streaking in the sky, the light radiating from it was blinding. Each move was large and vast, extremely powerful!</p><br/><p>No one was able to approach near Zuo Mo and Xiao Huan. The pitiful Xue Yun had, instantly been sliced by these swords into minced meat.</p><br/><p>Xiao Huan’s face was pale and she was dazed as she looked at the sky. Those sword energies and talismans, she almost couldn’t stand under their presence.</p><br/><p>At this time, she suddenly thought that the person who was standing beside her had a lower cultivation than her. Even she was having a hard time, would he be able to bear it? Xiao Huan was certain that this was the person who had sold her the yin beads the last time. Thinking that she had pulled someone else into this terrible situation, she couldn’t help but feel guilty.</p><br/><p>As her pale face turned back she saw the person behind her standing with a bowed head with his hands covered by his sleeves.</p><br/><p>Seemingly having noticed her gaze, the other suddenly raised his head and smiled at her.</p><br/><p>A smile that was as cold as the edge of a blade appeared strangely. Xiao Huan felt a gust of cold air suddenly rise from the bottom of her feet.</p><br/><p>Just at this time, a hand appeared without warning on Zuo Mo’s shoulder.</p><br/><p>Translator Ramblings: I’m not very good at translating action scenes and WanderingGummiOfDoom was amazing at making this chapter exciting.</p><br/>\n</div>"}