{"title": "Chapter Seventy Four – Nightmare", "id": 24, "volume": 1, "url": "http://boxnovel.org/world-of-cultivation-chapter-seventy-four-%E2%80%93-nightmare", "volume_title": "Volume 1", "body": "<h1>Chapter Seventy Four – Nightmare</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Seventy Four – Nightmare</p><br/><p>Zuo Mo wasn’t get upset when he was restricted from dan-making for a month . To escape from imminent life threatening danger or to make dan for a month, it wasn’t a difficult choice to make; however, when informed that his ban would be endlessly extended by his Master until he satisfactorily completed Xin Yan Shibo’s exercise training, Zuo Mo became dumbstruck.</p><br/><p>To meet with the visiting jindan masters was a calamity, and to receive Xin Yan Shibo’s “torture” was another calamity. If Zuo Mo had a choice, he would unhesitatingly choose the first calamity. He didn’t know the strength of those jindan masters, but he had directly experienced Xin Yan Shibo’s strength.</p><br/><p>He now knew what being too smart for your own good was.</p><br/><p>Master, who had always pushed him to make dan, had suddenly reversed her position and sent down a strict order for him to go to Xin Yan Shibo for “special training.” Before she left, she had sternly warned him, if he dishonored her in front of Xin Yan Shibo, when she came back, it was “humph humph.”</p><br/><p>Master’s “Humph humph” was almost as scary as Second Shibo’s terrifying stare. Master had never explained what her “humph humph” really was, but the smile that accompanied each “humph humph” caused Zuo Mo to shiver and his hair raise up.</p><br/><p>Certain that he was marching into the jaws of death, Zuo Mo went to Xin Yan Shibo’s grass hut. On the way there, he warned Pu Yao countless times. Pu Yao definitely was one to hold grudges. Second Shibo had attacked him, with this guy’s ungenerous attitude, he was definitely thinking of getting revenge. Pu Yao was arrogant and wanted to reclaim his honor, saying that it was because he had been previously wounded that he had been defeated by Second Shibo. Zuo Mo was celebrating the fact that Pu Yao hadn’t recovered from his wounds yet, otherwise, he definitely would be making another mess.</p><br/><p>Didn’t he know that this was a different era?</p><br/><p>After the incident with the yin bead, Zuo Mo had no fear of Pu Yao anymore. What Sky Yao, it was clearly an old antique that was still living in the time three thousand years ago, and completely cut off from the present!</p><br/><p>So pitiful!</p><br/><p>Sometimes, Zuo Mo couldn’t help but pity Pu Yao. From what he saw, Pu Yao was clearly still living in the illusions of the past, and didn’t want to face the cruel reality. Anyone who had been imprisoned for three thousand years, they would probably behave the same way when they came out. Zuo Mo thought that the incident of the yin beads had dealt a great blow to Pu Yao. This renyao had been dispirited for quite a few days. Afterwards, Pu Yao had offered many other things that could be used to make money, but Zuo Mo had sympathetically yet resolutely rejected them.</p><br/><p>Regardless of sympathy, in order to avoid trouble, Zuo Mo sternly warned Pu Yao. Zuo Mo had initially used Second Shibo to threaten him, but seeing that there wasn’t an effect, he immediately changed to using the threat of jingshi. That was instantly effective. Pu Yao was a great consumer of jingshi. Zuo Mo didn’t know how Pu Yao could use up so much jingshi. But clearly, Pu Yao had at least one an additional source of consumption – going to the sword cave. Pu Yao was extremely desirous of yin energy, and in this area, only the sword cave had it.</p><br/><p>Zuo Mo found that he had the feeling that he was raising a pet.</p><br/><p>Coming to the Sunset Lookout Peak for the second time, the sword essences in the ground surrounding the grass hut seemed to recognize him and had completely disappeared.</p><br/><p>“Second Shibo.” He shouted.</p><br/><p>“Come in.” Second Shibo’s icy words came out from behind the wooden door.</p><br/><p>Zuo Mo seemed to see, behind the wooden door, Second Shibo sitting in the lotus position, his body as large as a mountain, casting a shadow over him. Feeling weak and fragile, he barely raised his head and was only being able to see a pair of indifferent and frigid eyes staring at him.</p><br/><p>Zuo Mo couldn’t help but shudder. He forced himself to throw away his delusions and calmed his mind. He pushed open the door and gathered his bravery to walk in.</p><br/><p>“Sit.” Second Shibo didn’t open his eyes. Just like last time, he was sitting on a meditation mat. The sunlight came in through a hole in the roof and landed on his body.</p><br/><p>Zuo Mo saw the meditation mat in front of Second Shibo and carefully sat down, lowering his head and listening hard.</p><br/><p>“Starting from today, I will teach you.” Xin Yan Shibo’s body was thin and withered, but sitting there with closed eyes, he seemed to weigh a thousand catties, suppressing Zuo Mo so much he almost couldn’t breathe. He didn’t speak in a loud voice but when it landed in Zuo Mo’s ears, it was like thunder.</p><br/><p>“Yes.” Zuo Mo weakly responded. Even now, he didn’t understand why Master and the sect leader suddenly thought of throwing him to Second Shibo.</p><br/><p>“Our sect cultivates the sword, and doesn’t put importance on the body. But your natural body is weak and lacking. So you must start from the physical body.” Xin Yan Shibo didn’t open his eyes yet a strong presence was carried with his light words. It announced the beginning of Zuo Mo’s tragic life.</p><br/><p>———</p><br/><p>The mountain slopes of Wu Kong Mountain wasn’t steep but because of the winding mountain path, it took almost six hours to climb up on foot.</p><br/><p>The outer sect disciples of Wu Kong Sword Sect had suddenly found that Zuo Mo Shixiong would walk on the mountain path, panting heavily, sweat running down his back, as he went up and down. A few days later, a backpack appeared on Zuo Mo Shixiong’s back. It was still up and down. Looking at Shixiong struggling up the mountain path, some outer sect disciples wanted to help but were sworn at by Zuo Mo Shixiong. All the outer sect disciples were puzzled. Was Shixiong masochistic?</p><br/><p>Each day, Zuo Mo wanted to cry. He didn’t have the patience to treat others politely.</p><br/><p>Far away standing at the highest point on the mountain, Xin Yan Shixiong was supervising him. Zuo Mo didn’t dare to slack off even the slightest bit.</p><br/><p>“Such a stupid method, your trash of a shibo is actually using such a dumb method.” Pu Yao laughed continuously at his misfortunes.</p><br/><p>Zuo Mo gritted his teeth and raised his legs. His entire body was covered in sweat. Every time his bare foot touched the stone stairs, it would leave behind a wet footprint. He didn’t pay attention to Pu Yao. He wasn’t afraid that Second Shibo would find out but because he didn’t have the energy to talk. Now that he was thinking of those body cultivators, he asked himself, why didn’t he think of cultivating the body? Each step he took, he could barely make it. If he stopped to rested at all it meant that this round was wasted, and that he would face a multiplied punishment.</p><br/><p>Second Shibo’s eyes were really terrifying, to be able to see so clearly from that far away. Every time he thought about it, he would wail inside. Second Shibo, do you really have the free time to guarding a little character like me every day, isn’t it unprofitable?</p><br/><p>Don’t you need to meditate… … cultivate the sword… … forge something……</p><br/><p>“Do you want me to teach you a body cultivation art?” Pu Yao snickered, “Speaking of body cultivation, mo are the true masters. Those in your xiuzhe that cultivate the body, you all learned it completely from the mo, but you really didn’t copy it well. Haha, as the true allies of the mo, I have a profound inheritance of body cultivation. Includes teaching and learning, would be beneficial for a lifetime, definitely without side effects……”</p><br/><p>Zuo Mo was too lazy to respond to him. He bared his teeth, used all the energy in his body to move upwards step by step.</p><br/><p>Pu Yao laughed even more merrily.</p><br/><p>At the top of the Eastern Peak, Xiao Guo watched Zuo Mo Shixiong struggle up the winding mountain path. Her heart was deeply moved. She tightened her pink fists, determination written on her apple face.</p><br/><p>Shixiong is so strong yet so hardworking, Xiao Guo needs to work harder!</p><br/><p>She turned and left, deciding to multiply her practice time today!</p><br/><p>If Zuo Mo knew of Xiao Guo’s thoughts, he would definitely wail to the heavens, “Ge is being forced!”</p><br/><p>In reality, his mind was entirely blank. After the energy was used up, a person’s reaction times and thoughts would become slower. The second half of the ascent, it was completely instinctive. Zuo Mo couldn’t even distinguish what Pu Yao was saying.</p><br/><p>When he finally reached the mountaintop, without a word, Second Shibo picked him up and flew to Fragrant Ginger Yard.</p><br/><p>In the yard, a large wooden tub had been set up over a large metal pot. The wooden tub was filled with a black liquid, the smell of herbs could be detected a long way off. Xu Qing was standing next to the wooden tub. Seeing Second Shibo holding Zuo Mo, she hurriedly lit the fire.</p><br/><p>Without a word, Xin Yan Shibo threw Zuo Mo carelessly into the wooden tub before floating away.</p><br/><p>Splash. Like a ball of mud, Zuo Mo accurately landed in the wooden tub. The hot medicine bath made his pupils shrink and he inhaled sharply. At the side, Xu Qing’s face reddened slightly and then she said sympathetically to Zuo Mo, “Shixiong, today’s medicine bath costs one piece of third grade jingshi. The master said that it will be put on the accounts and for you to pay back in time.”</p><br/><p>Zuo Mo’s expression was fierce and twisted as he nodded – it really was too hot!</p><br/><p>He needed to pay for the medicine bath each day. They were really too miserly. Wasn’t this forcing him to owe debts? But after the last few days, Zuo Mo knew it was useless to rebel and could only grit his teeth and accept it. Additionally, the effect of these medicine baths were extremely evident. If he didn’t have it, Zuo Mo certainly couldn’t finish the amount of training that Second Shibo assigned. Then he would have to face a even more terrifying punishment.</p><br/><p>Sometimes, Zuo Mo had the feeling that Second Shibo and Master were in cahoots……</p><br/><p>Xu Qing was even more sympathetic as she reminded Zuo Mo, ”Shixiong, I need to increase the fire!”</p><br/><p>A short while later, wails like pigs being slaughtered echoed through Fragrant Ginger Yard. The female disciples that were working at the front of the yard all sympathetically turned to look and exchanged glances before sighing, “Really pitiful!” Then they buried their heads to continue their own work.</p><br/><p>After the medicine bath, Zuo Mo seemed to sleep-walk back to the Little West Wind Yard. The nightmare of the day finally ended.</p><br/><p>He wanted to drop and sleep. The bones in his body seemed to want to collapse but he still forced himself to meditate in the rock room. [Embryonic Breathing Spiritual Cultivation] didn’t do anything special for the recovery of his body, but for nurturing the mind, it was very effective.</p><br/><p>Zuo Mo was suspicious, if he didn’t have [Embryonic Breathing Spiritual Cultivation], he might not die from exhaustion, but he would first go insane from exhaustion.</p><br/><p>He entered meditation extremely quickly. Time also flew quickly. When he opened his eyes, his body was still sore, but the feeling that his mind was blank had disappeared. It felt that he could control his body again. The medicine bath had been prepared by Master. Supposedly, the more exhausted he was, the more effectively the medicine would nurture the muscles.</p><br/><p>With a hint of reluctance and helplessness, he stood. What he needed to do now was get to Sunset Lookout peak before sunrise. If he was late, it would be very bad. At this time, the sky hadn’t lightened, and was a patch of black. The mountain paths were still cold.</p><br/><p>The night sky above his head, Zuo Mo flew towards Sunset Lookout Peak, the stars above him mischievously shining.</p><br/><p>Sprinting in the wind, Zuo Mo only had one thought, this nightmare, please end quickly! He wanted to go back to his previous life of farming and dan-making. Even practicing the sword in the river was much better than this. Right now, he was counting the days on his hand. And what made him despair the most was what Master had said before leaving, only when Second Shibo was satisfied……</p><br/><p>Second Shibo satisfied……</p><br/><p>He had countless reasons to believe, in the eyes of the terrifying Second Shibo, this was just the beginning.</p><br/><p>Just as Zuo Mo was living through a tragic life, a shocking incident happened in Dong Fu and Dong Fu shook!</p><br/><p>Translator ramblings: We need a training montage right here of a zombie on a mountain. Thanks for the comments!</p><br/>\n</div>"}