{"title": "Chapter Eighty Nine – Silly Yao", "id": 39, "volume": 1, "url": "http://boxnovel.org/world-of-cultivation-chapter-eighty-nine-%E2%80%93-silly-yao", "volume_title": "Volume 1", "body": "<h1>Chapter Eighty Nine – Silly Yao</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>This chapter has been brought to you by me, cactuar0, WanderingGummiOfDoom, and warlord212.</p><br/><p>Due to the way the cultivation system in the novel has been set up, I’ve decided to change a term (again!). We will now have ling energy and ling power. Ling energy is now the energy that is spread out in the world which people absorb. Ling power is the stuff that people use, which is basically “processed” ling energy. Think solar energy and solar power (in cactuar’s words).</p><br/><p>Chapter Eighty Nine – Silly Yao</p><br/><p>The mist faded and a hot spring had appeared. In the steam that rose up, a crowd of beautiful women who were bathing could be barely made out. Their eyes were alluring and extremely seductive. The smooth and silky skin seemed to have magnetism, securely holding Zuo Mo’s eyes.</p><br/><p>The beauties played and laughed, disregarding Zuo Mo as empty air.</p><br/><p>When had the pitiful Zuo Mo ever seen something like this? It was like he had been struck by lightning, dumbstruck. The laughter and breathing of the women burrowed into his ear. He felt his throat was dry, his entire body hot. Something inside his body seemed to be moving.</p><br/><p>What spell was this?</p><br/><p>Zuo Mo felt his heart beat faster and faster until it felt like his heart was going to jump out of his chest, uncontrollably beating.</p><br/><p>He used all the energy in his body to struggle to swallow. He detected that his entire body wasn’t normal, definitely not normal! He started to channel ling power. It didn’t have an effect. He couldn’t help but be shocked.</p><br/><p>— Such a strong spell! Such a strong maze formation!</p><br/><p>Calm! Calm!</p><br/><p>It was fake! Fake!</p><br/><p>Zuo Mo told himself. At this time, he should close his eyes, but for some reason, his eyelids today didn’t listen to him. It seemed that there was a mysterious world in that hot spring that uncontrollably attracted his eyes. If he didn’t restrain himself forcefully, his legs would unconsciously walk towards the hotspring.</p><br/><p>Tracelessly capturing a person’s mind and soul. Imperceptibly controlling a person’s body. Zuo Mo’s last bit of rationality concluded, this group of beauties were in reality a high grade maze formation!</p><br/><p>Fourth-grade or even fifth-grade?</p><br/><p>The person trapped would feel hot, the rhythm of breathing lost, the mind disturbed, ling power channeling would be obstructed… …</p><br/><p>He reflexively swallowed again. Suddenly, Zuo Mo’s pupils expanded.</p><br/><p>The hot steam suddenly disappeared. Those beautiful women, without an exception, their heart-startling faces, their amazing bodies, the porcelain skin and … …</p><br/><p>A blow like no other before attacked Zuo Mo like a stream of lightning. His breathing stopped, his heart stopped at this moment as well.</p><br/><p>Was this the final attack… …</p><br/><p>All the beauties suddenly stopped moving like they were under a paralyzing spell. After that, with speed visible to the naked eye, they started to age and wither. The healthy and alluring skin lost the glow, the tightness, became wrinkled like the bark of a tree. Their beautiful appearance quickly withered and lost vitality.</p><br/><p>The skin turned bad, rotted and revealed the white bones inside.</p><br/><p>In the flick of a finger, a crowd of beautiful women became a crowd of skeletons.</p><br/><p>His chest heaving, Zuo Mo felt like he had ate countless mosquitoes and wanted to throw up! This reversal of events, all the blood in his body seemed to reverse flow and he almost spat out blood.</p><br/><p>The viciousness of this final attack… …</p><br/><p>Zuo Mo was extremely shocked. The person who created this maze formation was really strong! He hadn’t felt even a bit of ling power. This was a traceless attack. At this time, a tearing sound occurred next to his ear. The scene in front of him suddenly twisted as though it was being sucked away by something.</p><br/><p>Beautiful women, skeleton, the black and white checkerboard, it completely disappeared.</p><br/><p>He saw Pu Yao opening his mouth and a wisp of smoke was sucked inside. His state seemed comfortable and satisfied. When did Pu Yao recover? Did he just ruin the maze formation right now?</p><br/><p>Pu Yao closed his mouth and turned to look at Zuo Mo, lightly throwing down, “You have a nosebleed.”</p><br/><p>Zuo Mo dazed and hurried to touch his nose. As expected, it was red!</p><br/><p>“Ha ha ha ha ha ha … …” Pu Yao laughed carefree, his face mischievous as he looked at Zuo Mo. Zuo Mo didn’t understand at all.</p><br/><p>Bleeding proved that the other’s maze formation was really too strong. He had actually been wounded and bled without him noticing. But why was Pu Yao laughing?</p><br/><p>He felt that Pu Yao’s laugh was slightly strange. Even now, his chest felt unspeakably uncomfortable. The last ultimate attack, the power was too amazing. The feeling of disgust lingered in his heart.</p><br/><p>Barely managing to calm down, Pu Yao glanced at Zuo Mo and started snickering again. He swept across the pink colored paper on Zuo Mo’s hands and snatched it over, shoving it into his mouth. He chew two times and swallowed it down. For the second time, he had a satisfied expression.</p><br/><p>“You… … you eat paper?” Zuo Mo pointed at Pu Yao, face full of disbelief as he asked.</p><br/><p>“Such pure yin energy, it would be a pity to waste it.” Pu Yao thrust out a blood red tongue and licked his lips, still hungering.</p><br/><p>“When did you wake up?” Zuo Mo asked dumbly.</p><br/><p>“When this maze formation started.” Pu Yao snickered. However, Zuo Mo felt that the other’s eyes as they looked at him were slightly weird.</p><br/><p>“You’ve recovered?” Zuo Mo still decided to have some concern for Pu Yao.</p><br/><p>“Not that easy.” Pu Yao stretched and said lazily, “The injury this time was too much. Recovering isn’t that easy.” From his expression, he didn’t seem to be that concerned with his injury.</p><br/><p>It seemed the situation was better than he had thought. Zuo Mo felt slightly safer. He thought about the beautiful women he had just seen. He hurriedly asked, “What maze formation was it just now? Too strong! I was injured without me noticing!”</p><br/><p>“Ha ha ha ha ha ha … …” Pu Yao couldn’t resist and started howling with laughter again, holding his stomach. Laughing to the point of not being able to stand up.</p><br/><p>Zuo Mo’s face was puzzled. He didn’t know why Pu Yao was responding like this.</p><br/><p>This maze formation really was powerful… …</p><br/><p>At a place far away from Sky Moon Jie.</p><br/><p>“Hm, why hasn’t there been a response? Is he really not tempted by beauty? Hee Hee, has he surrendered?”</p><br/><p>A girl propped up her chin and talked to herself.</p><br/><p>A while later. Still nothing. Her face was suspicious.</p><br/><p>“There’s no reason. As long as he isn’t a playboy, he shouldn’t be able to resist! Is he really experienced? He didn’t seem like it! Did I look wrong? This miss dislikes that kind of men the most!”</p><br/><p>She completely did not know her tempting maze formation had been altered by Pu Yao and its effect had moved from one extreme to another extreme.</p><br/><p>She wasn’t satisfied.</p><br/><p>In Little West Wind Yard.</p><br/><p>“Do you understand women?” Pu Yao asked.</p><br/><p>“Of course.” Zuo Mo looked strangely at Pu Yao. This question was so dumb and idiotic. Had Pu Yao’s mind been wounded? His mind was now unclear? He reminded in goodwill, “Li Ying Feng Shijie, Xiao Guo, Master. They are all women.”</p><br/><p>No. No. Pu Yao had previously been an old antique of three thousand years ago but, at least, he had been somewhat normal. But now, his mind had been wounded and become dumb. Zuo Mo looked slightly sympathetically at Pu Yao. So pitiful. A Sky Yao becoming a dumb yao.</p><br/><p>Meeting Zuo Mo’s gaze, Pu Yao snickered, “Have you been close with a woman?”</p><br/><p>Zuo Mo looked with even more sympathy at Pu Yao, “I’m close to all of them.”</p><br/><p>Pu Yao’s snickers suddenly stopped, like he had choked. He suddenly found that it was very difficult to explain this matter to Zuo Mo.</p><br/><p>“When you see them, do you have any strange thoughts in your head?” Pu Yao made a last effort.</p><br/><p>“Uh, strange thoughts?” Zuo Mo struggled, and then nodded, “I have.”</p><br/><p>“So you really do have some thoughts!” Pu Yao became excited. He continued in leading, “What thoughts?”</p><br/><p>“Selling medicine.” Zuo Mo bashfully and obediently answered.</p><br/><p>Pu Yao was dumbstruck.</p><br/><p>Zuo Mo counted on his fingers as he said, “But it’s a pity that Xiao Guo is still too poor right now. Master, she won’t buy the dan that I make. Usually, only Li Ying Feng Shijie would buy. However, Xu Qing Shijie also would buy. Oh, after some more time, I would advertise moisture dan to them. And there must also be Xu Yi Xia Shijie. Oh, Hao Min might be lacking, but I won’t say no to jingshi… … in the future, I will make lots and lots of dan. Elder Wei Nan’s jade scrolls said that women are the best people to sell to… …”</p><br/><p>Pu Yao sprayed out blood and collapsed. After a while, his limbs twitched and he struggled up. He said, refusing to give up, “Didn’t you just see those naked women? Didn’t you feel something?”</p><br/><p>If before, Zuo Mo had been using a look reserved for silly yao, then now Zuo Mo’s gaze as he looked at Pu Yao was like if he was looking at an idiot. Full of pity, he said, “Pu Yao, that’s the seal formation!”</p><br/><p>Gurgle gurgle. Pu Yao once again fell down, fresh blood furiously flowing out from his mouth like a spring.</p><br/><p>So pitiful!</p><br/><p>Zuo Mo looked sympathetically at Pu Yao who had been heavily affected.</p><br/><p>However, Zuo Mo quickly didn’t have the time to sympathize with Pu Yao. The sect leader and the others all returned to the mountain. When Zuo Mo saw the deep exhaustion in the expression of the elders, he perceptively didn’t say anything. The sect leader didn’t say any words, only waved his hands to signal for the disciples to leave.</p><br/><p>“This time, the incident really is too big.” Pei Yuan Ran sighed deeply, “Sky Moon Jie would not be peaceful.”</p><br/><p>The others were silent. Yan Le’s face was worried, “We have to take precautions. Wei Sheng’s talents are so outstanding, one in a hundred years. We need to think of ways for him to reach jindan early, otherwise… …”</p><br/><p>Everyone understood the rest. A genius, no matter the talent, before they matured, they were all very fragile. Killing an exceptional zhuji xiuzhe only required an average ningmai. They only needed a seal, a talisman… …</p><br/><p>“Oh, I wanted Wei Sheng to have a strong foundation. Looking at it now, time doesn’t wait for me.” Pei Yuan Ran gave a deep sigh. He thought for a moment and said resolutely, “In abnormal times, we have to act abnormally. Everyone, gather all your power to help Wei Sheng.”</p><br/><p>Xin Yan and Yan Le nodded at the same time. Shi Feng Rong hesitated for a second and said, “What about Zuo Mo?”</p><br/><p>Pei Yuan Ran said helplessly, “Zuo Mo’s talent might be outstanding. In another sect, they naturally would take care and nurture. But our assets, Shimei, you know it as well. If we need to put all our energy into nurturing, we could barely just nurture Wei Sheng.”</p><br/><p>“Yes! Shimei, I only have that much in my stores. I don’t even know if there is enough for just Wei Sheng.” Yan Le urged.</p><br/><p>Shi Feng Rong knew that what the shixiong said was the truth. Wu Kong Sword Sect wasn’t some large sect and didn’t have much wealth. How were young experts made? Made from countless jingshi and lingdan! Wei Sheng was the undisputed successor of the sect. Shi Feng Rong knew very well.</p><br/><p>However, Zuo Mo was her disciple. She gritted her teeth, “I do not have objections on nurturing Wei Sheng. But since Zuo Mo won’t have a share of the resources, then we should reimburse him in other areas. If I need to make dan for Wei Sheng, in the future, I won’t have time to teach him and will have to leave him to his own devices.” Speaking of it, she was slightly sorrowful and then raised her head, “I only have a request. Other than some special jade scrolls, all the jade scrolls in the sect should be open for him.”</p><br/><p>“This… …” Pei Yuan Ran was slightly hesitant. Shi Feng Rong’s request was against the sect’s rules. But when he saw the determination on Shi Feng Rong’s face, he still nodded, “Yes, I agree.” Nurturing Wei Sheng. The most important part was the supply of lingdan. On this point, Shi Feng Rong was extremely important.</p><br/><p>Pei Yuan Ran was a charismatic person. He thought and then stood, “Since the situation is this bad, the jade scrolls would be garbage if they are in the pavilion. From today onwards, all the jade scrolls in the sect will be open to all inner sect disciples.”</p><br/><p>And then the whole of Wu Kong Sword Sect shook!</p><br/><p>Translator Rambling: So slightly major business first. I changed the term.</p><br/><p>Second, I know and agree it totally sucks that the elders want to focus on Wei Sheng. Pei Yuan Ran is bribing Shi Feng Rong, who really is trying her best within her limits since the other is her sect leader/boss. I’m going to play devil’s advocate and say Pei Yuan Ran is investing in what looks to be the most profitable venture.</p><br/><p>On the other hand, the elders are terrible at making money!</p><br/>\n</div>"}