{"title": "Chapter Eighty Six – Wen Fei", "id": 36, "volume": 1, "url": "http://boxnovel.org/world-of-cultivation-chapter-eighty-six-%E2%80%93-wen-fei", "volume_title": "Volume 1", "body": "<h1>Chapter Eighty Six – Wen Fei</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Eighty Six – Wen Fei</p><br/><p>“Good day everyone,” Zuo Mo raised his hands in a greeting.</p><br/><p>Yan Ming Zi and Hu Shan’s expressions instantly became slightly uglier. Good? Good? After they returned to the sect, they had been greeted with scorn and mockery. Tao Zhu Er covered her mouth and giggled. Mirth appeared on the faces of the two Ling Ying Sect disciples, but the two managed to restrain themselves.</p><br/><p>Ling Ying Sect had the largest number of inner sect disciples in Dong Fu. At the same time, because they lacked a strong leader, the disciples fell into factions and the complexity of the inner sect was also the first in Dong Fu.</p><br/><p>Tao Zhu Er moved gracefully, her beautiful features instantly attracting everyone’s eyes.</p><br/><p>Wu Kong Sword Sect’s outer sect disciples quickly divided into two camps. The male disciples stared, some of them dazed, as they drooled. Jealousy rose up in the female disciple camp, shouts of “whores” and “fox demon” came out.</p><br/><p>Tao Zhu Er gave a beautiful smile, “This little sister admires Zuo Shixiong’s demeanor last time. However, as a disciple of Ling Ying Sect, I cannot watch as our sect’s reputation is injured and have come today to specially visit Zuo Shixiong.</p><br/><p>The other said it so nobly but Zuo Mo sneered inside. This female might have a good appearance but she was as poisonous as a scorpion. If one wasn’t careful, they would fall into her hands. Zuo Mo, having seen her laugh so heartlessly when her fellow disciples were defeated, didn’t have a good impression of her.</p><br/><p>“Oh,” Nothing changed on Zuo Mo’s face. Adding on that his face was tilted down, it was even harder for others to guess his thoughts.</p><br/><p>Tao Zhu Er instantly felt that her fist had hit cotton. Such an indifferent response, she didn’t know what to say.</p><br/><p>But she wasn’t a simple person. She took a step back and revealed the two other shixiong, stating, “Wen Fei Shixiong and Ming Dao Shixiong are truly skilled disciples of our Ling Ying Sect, and are people this little sister admire very much. Coming this time… …”</p><br/><p>Hearing this, Wen Shan and Ming Dao instantly couldn’t help themselves from raising their head proudly and pushing out their chests, evidently they were very smug.</p><br/><p>“If you want a fight, then let’s fight,” Zuo Mo suddenly opened, interrupting her, “However, our Wu Kong Mountain isn’t a place you can come and go whenever you want. Let’s say the ugly matters first. Who ever loses to me, I will take a talisman from them to prove our sect’s reputation.”</p><br/><p>The words were said righteously. The Wu Kong Sword Sect outer sect disciples all cheered.</p><br/><p>Hearing this, the two people’s expressions became discontent.</p><br/><p>Wen Fei was clothed in green and white. a green soft cloth tied on his head. This made him look extremely elegant, as though he would leave with the wind at any time, almost like an immortal. He wasn’t satisfied to be on the weak side and smirked, “Fine, fine. If you have the ability, this one naturally will recognize the loss.”</p><br/><p>Wearing blue ling armor, and hair tied with a gold coronet, Ming Dao also spoke, “If you lose, I will also take a talisman from you.”</p><br/><p>Tao Zhu Er stood in the back. Seeing the two sides about to fight, a smug smile appeared at the corner of her mouth. Yan Ming Zi and Hu Shan’s eyes were blood red as they stared at Zuo Mo. They looked as though they wanted to eat him alive.</p><br/><p>“Who is first?”</p><br/><p>Zuo Mo asked as he stepped out a step, his presence soaring.</p><br/><p>It might have been that he had just practiced the sword. He felt his entire body was hot, his blood on fire, as though he was being roasted. The desire for battle suddenly erupted, moving restlessly as though it wanted to burst out of his body.</p><br/><p>Like a keen sword unsheathed, the sharp edge flashed into view! One step, and it was as though Zuo Mo had changed into a whole other person. The dullness that was on the surface and the slyness inside his bones seemed to have completely flown away. Desire for battle flowed on his body it was tangible, so pure that others could not disregard it.</p><br/><p>Tao Zhu Er looked dazedly at Zuo Mo. The expression on her beautiful face was like she had seen a ghost.</p><br/><p>How was this possible?</p><br/><p>Was this still that vulgar and greedy zombie?</p><br/><p>In her mind, Zuo Mo had a greedy and cheap character. Otherwise, who else would target someone else’s flying sword in the middle of battle?</p><br/><p>Being defeated last time, especially by a little person like him, this was why Tao Zhu Er was so persistent. Getting tripped up by an opponent that she looked down on, how could she accept it?</p><br/><p>But, the Zuo Mo in front of her… …</p><br/><p>Seriousness made its way into Wen Shan’s eyes. The presence that the other exuded surprised him. However, he wasn’t the kind of wastrel that Hu Shan and Yan Ming Zi were. His family might be rich, but he was very hard-working and did have some true abilities.</p><br/><p>He was shocked but not afraid. Taking a step forward, he declared, “I’ll fight!”</p><br/><p>Wen Fei revealed his talisman. A light green jade fan. The skeleton was made out of jade, the cloth of the fan clearly wasn’t some common material. Green light could be seen moving on the surface. A painting of mountains and water was depicted on the surface of the fan. If someone looked closely, they would discover that the river stream between the mountains was actually slowly flowing.</p><br/><p>Sky River Fan, third grade.</p><br/><p>Water Drop sword, third grade.</p><br/><p>Zuo Mo couldn’t help but sigh again at the variety of scriptures that Ling Ying Sect had. They even used fans.</p><br/><p>When Yan Ming Zi saw his Water Drop sword, his expression became ugly. However, he liked to collect all kinds of talismans and his eyes were very experienced. He instantly noticed that the quality of the Water Drop sword was slightly better than when he had been in possession of it. He became slightly depressed. Did flying swords selectively pick people as well?</p><br/><p>“Please!” Wen Fei shouted elegantly.</p><br/><p>The Water Drop sword moved before the word ended,!</p><br/><p>[Flowing Water]!</p><br/><p>Zuo Mo’s favorite starting move. This move was like a sheep climbing a cliff, traceless.</p><br/><p>The move he released right now was very different from before. Before, it had been light and faint. Right now, it was still quiet, but there was a hint of fire. It was like a white flame, burning without a sound.</p><br/><p>Wen Fei smirked and gently waved Sky River Fan.</p><br/><p>Zuo Mo felt his eyes blur and an incredibly thick pillar of water came from the sky like a water dragon, heading towards him.</p><br/><p>[Water Dragon Roar]!</p><br/><p>Attack against attack!</p><br/><p>No one would have thought that Wen Fei, such a warm and elegant person, would fight so brutally. The two were competing to see whose attack would reach the other first.</p><br/><p>Zuo Mo snorted. His sword presence didn’t change. The ling energy in his legs moving, he suddenly flashed towards the left. It was as though there were springs under his feet. His speed was extremely fast and dodged the water dragon.</p><br/><p>Competing in attacks?</p><br/><p>Zuo Mo wasn’t afraid. Based on speed, nothing could compare to flying swords. He gathered his ling energy and the Water Drop sword gave a slight hum. The sword turned into a stream of light, it was as fast as lightning!</p><br/><p>A thin water curtain suddenly appeared in front of Wen Fei. The Water Drop sword crashed heavily against the water curtain. The water curtain shook fiercely. Wen Fei’s expression behind the water curtain changed slightly. However, the curtain shook, but still managed to stop the Water Drop sword!</p><br/><p>Zuo Mo was also surprised. This water curtain seemed to be a thin layer and he hadn’t thought it could stop the Water Drop sword. It was much stronger than he had predicted. However, he could also see this water curtain had just managed to stop it. If he put in a bit more effort, it would certainly break.</p><br/><p>He was going to channel his ling energy and hadn’t thought the thick water dragon would act as if it was alive, turning nimbly and reversing back in his direction.</p><br/><p>In the blink of an eye, the water dragon rushed in front of him. When this water dragon appeared in front of him, he finally realized just how enormous it was! It was like a large river, roaring as it headed for his head, the presence extremely shocking!</p><br/><p>Zuo Mo didn’t even think as the Water Drop sword turned into a dash of light and appeared between him and the water dragon.</p><br/><p>A cold light flashed in his eyes, and the Water Drop sword rose.</p><br/><p>[Water Fall]!</p><br/><p>Everyone felt the landscape suddenly flash and a waterfall seemed to have appeared in front of Zuo Mo. It was a waterfall composed of countless sword energies. As they flowed, they accurately hit the head of the water dragon!</p><br/><p>Boom!</p><br/><p>The head of the water dragon suddenly exploded, water splashing everywhere. The disciples that had been watching were instantly soaked but no one moved their eyes away. Such a spectacular fight, if they missed something, it would be such a pity.</p><br/><p>The water dragon continued to flow, as though it didn’t have an end. The waterfall that was floating in the sky also seemed endless.</p><br/><p>“Amazing!” Yan Ming Zi said, his mouth gaping. He was completely convinced now. The other was so powerful, winning last time, it wasn’t due to trickery.</p><br/><p>Hu Shan didn’t dare to blink and nodded in empathy, “I had heard before that Wen Fei Shixiong’s Sky River Fan can enter the top three of our generation of disciples. It really lives up to the rumors!”</p><br/><p>Yan Ming Zi said, sharing in the pride, “Right. But my Water Drop sword isn’t mediocre. To be able to keep up with Sky River Fan, it isn’t of average quality. I have really good eyes.”</p><br/><p>“That’s because Zuo Mo’s strong.” Hu Shan wasn’t polite, “In your hands, it would be great if you could even block five of Wen Shixiong’s moves.”</p><br/><p>Yan Ming Zi wasn’t angry, “I’m not good as others in fighting. However, in buying talismans, which one of you is my match?”</p><br/><p>Hu Shan choked, not knowing what to say.</p><br/><p>Waves also spread in Tao Zhu Er’s heart. She would have never thought that Zuo Mo could keep up with Wen Fei Shixiong because she knew just how strong Wen Fei Shixiong was.</p><br/><p>Wen Fei Shixiong wasn’t famous outside the sect, but in this generation of Ling Ying Sect disciples, he was a truly strong person. He was deeply loved by the elders. That Sky River Fan had been made specially for him by the sect elders and was the envy of countless people. Wen Fei Shixiong didn’t fail to live up to expectations. His talent was exceptional and he was hard-working. Adding on the nourishment from countless lingdan, his power was extremely deep. However, he rarely fought. Even the other disciples in the sect didn’t know just how strong he was. Tao Zhu Er had accidentally saw Wen Fei Shixiong cultivating and had been shocked. It had left a deep impression. That was why she had requested Wen Fei Shixiong. She wanted to beat down Zuo Mo’s bravado.</p><br/><p>Also, Tao Zhu Er knew that the elders were planning for Wen Fei Shixiong to make a display in the upcoming Dong Fu Sword Test Conference.</p><br/><p>This horrid zombie was actually able to fight to a standstill with Wen Fei Shixiong?</p><br/><p>How was this possible?</p><br/><p>Tao Zhu Er felt that her brains couldn’t process it.</p><br/><p>The outer sect disciples stared with wide eyes, completely silent. Zuo Mo didn’t notice, in the female disciples, an adorable and pink apple face was extremely nervous. Even her little fists couldn’t help but tighten.</p><br/><p>The two exchanged blows like lightning. The two moves passed in the blink of an eye. Right now, it had moved into a standstill period. Everyone was able to release a breath. Recalling what happened, they cheered.</p><br/><p>But the two that were facing off were not so relaxed.</p><br/><p>The disdain that Wen Fei had initially had disappeared completely. What took over was seriousness. He, who had been desiring to show himself at the Sword Sect Conference, hadn’t thought that he would meet such a strong opponent here!</p><br/><p>And Zuo Mo, two balls of fire furiously jumped in his eyes, his desire for battle in full swing!</p><br/><p>A standstill was disadvantageous for him. There was still another person. If he didn’t quickly end the fight, then he basically had no hope of victory for the next battle.</p><br/><p>His thoughts swirling, he gave a long howl and decided to attack with all his power!</p><br/><p>Translator Ramblings: More fighting. Zuo Mo has a taste of fighting now and he’s a little bit addicted. Isn’t the litte trio funny?</p><br/>\n</div>"}