{"title": "Chapter Eighty Three – Brute Force", "id": 33, "volume": 1, "url": "http://boxnovel.org/world-of-cultivation-chapter-eighty-three-%E2%80%93-brute-force", "volume_title": "Volume 1", "body": "<h1>Chapter Eighty Three – Brute Force</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Eighty Three – Brute Force</p><br/><p>Just as Hu Shan was furiously waving the blazing sabre, the cold water that had pierced the flames suddenly exploded, turning into seven streams and landing around Hu Shan. The seven streams were thin, filled with a white cold energy. They revolved rapidly, hissing as they moved.</p><br/><p>[Seven Whirlpools]!</p><br/><p>Seven bunches of cold energy and sword energy formed whirlpools. They were like the pillars of a cage, imprisoning Hu Shan.</p><br/><p>The whirlpools were moving shocking fast, like a miniature tornado. It had a strong suction power. Everywhere it went, the layers of flames were consumed so nothing was left.</p><br/><p>Shock appeared on Tao Zhu Er and Yan Ming Zi’s faces as they stared in disbelief at the battle. The other sect disciples who were behind Zuo Mo were extremely excited and were intoxicated by the fight.</p><br/><p>Terror made its way onto Hu Shan’s face!</p><br/><p>Surrounding him, seven groups of water and fire entwined to become long whirlpools. They were like seven thin pillars that securely trapped him. The bang and hiss of water and fire meeting signaled just how unstable it was and expressed the terrifying power that was in them!</p><br/><p>“No!”</p><br/><p>Hu Shan shouted in hopelessness, his left hand quickly going into the hundred treasures pouch at his waist!</p><br/><p>Boom!</p><br/><p>The seven fire and water whirlpools exploded at the same time. The pitiful Hu Shan, who just had taken out an armor seal, was swallowed by countless flames and tiny icicles!</p><br/><p>The explosion dissipated, leaving behind smoke which faded as people made out Hu Shan’s state. That grandiose red ling armor was now dim and dirty, a layer of ash over the top. There were many small marks on the surface of the ling armor. Hu Shan’s tied up hair had been blown into a bird’s nest, his face ashy and black. Some strands of lingering smoke rose up from his face and head. The flame had completely disappeared from the blazing sabre on his hand, nothing remaining of the presence it previously had. His right hand holding the bottom half of an armor seal that he didn’t have the time to use.</p><br/><p>His entire person was charred like burnt wood.</p><br/><p>The jade pendant actually hadn’t been damaged at all!</p><br/><p>Zuo Mo released a breath. He silently started [Vajra Profound Sutra] and cautiously walked in front of Hu Shan. Glancing at Hu Shan and seeing that the other didn’t seem to have responded, Zuo Mo wasn’t courteous is taking off the red jade pendant at Hu Shan’s face. After taking it, he looked with some regret at the blazing sabre on Hu Shan’s hand and the ling armor on his body. Those two were also good things! However, Zuo Mo knew that people couldn’t go over the line. Right now, he took the jade pendant. That was his prize for winning. It wasn’t outrageous. However, if he cleaned off the other person, then he could just wait for them to come back and kill him.</p><br/><p>Also, Zuo Mo didn’t let down his defenses. His left hand had always been inside his own hundred treasure pouch, touching the water drop sword that he had just obtained. He hurriedly left behind his own imprint. Even though, in this short amount of time, he couldn’t imprint the sword and could only leave behind the simplest impression, but the ice crystal sword had been destroyed and he had no weapon. The other was also not just one person.</p><br/><p>“Ha ha!” Yan Ming Zi saw that Zuo Mo had taken Hu Shan’s jade pendant and couldn’t stop himself from laughing smugly. He was very clear just how much Hu Shan treasured his jade pendant! Seeing Hu Shan had lost more than time, his damage even greater, Yan Ming Zi recovered his sense of equilibrium. He didn’t seem to find it so painful any more at losing the water drop sword.</p><br/><p>Looking at Hu Shan’s sorry state, Tao Zhu Er also couldn’t stop herself from giggling. But her eyes as she looked at Zuo Mo had some more shock and curiosity.</p><br/><p>Hu Shan slowly came back. Seeing Zuo Mo right in front of him, hatred rose, and with a hateful shout, the raised the sabre to cleave the other in half.</p><br/><p>Zuo Mo, who had already had his defenses up, attacked even more quickly. Light lightning, he reached out with his gold glowing right hand, and accurately grabbed Hu Shan’s neck. Then he gave a hard pull… …</p><br/><p>Crack!</p><br/><p>A muffled sound like a head hitting a rock.</p><br/><p>Hiss, the sound of inhales rose in the surroundings. Everyone looked dazedly at Zuo Mo. Their mouths were wide. They had completely lost the ability to speak.</p><br/><p>Still a little bit painful! Zuo Mo bared his teeth and then threw the unconscious Hu Shan on the ground. His right hand rubbed hard at his forehead. His forehead was perfectly unharmed, and on Hu Shan’s forehead, a bloody flower was blooming.</p><br/><p>How hard would he need to be before a flying sword couldn’t wound him? Zuo Mo thought as he rubbed his glittering forehead. But he was quite satisfied. He hadn’t wasted the pain and effort he put into training his body.</p><br/><p>“Still want to fight?” He asked Tao Zhu Er.</p><br/><p>In reality, when he asked this, he was not very confident. But his zombie face that could not show any emotion was like that of a skilled master. Additionally, Tao Zhu Er had completely been amazed by Zuo Mo’s abnormal attack. At this time, she didn’t know what to answer with.</p><br/><p>“If you don’t want to fight, take him away. Ge is very busy.” Zuo Mo took the opportunity to stop the other’s words. He waved his hand, turned and made to leave.</p><br/><p>“Wait!” Tao Zhu Er suddenly called him.</p><br/><p>Zuo Mo’s heart jumped. Did she still want to fight? Right now, his flying sword had been destroyed. If he wanted to control the water drop sword as he wished, it couldn’t be done in such a short amount of time as this. He had also used up the majority of ling energy in his body.</p><br/><p>“What else do you want?” He turned and pretended to ask discontentedly.</p><br/><p>“Wu Kong Sword Sect, as expected, is strong. But since you have put down a challenge of one on one, us Ling Ying Sect disciples will naturally battle to the end. In the future when we ask for guidance, please do not avoid.” Tao Zhu Er stared at Zuo Mo and stated.</p><br/><p>She had to admit they had been caught off guard today and lost to the other. But Zuo Mo’s expression, which looked as though he didn’t think anything of them, how could these arrogant and brash wastrels swallow it? However, if she had to go up, she didn’t dare to. This person in front of her, she couldn’t seem to see him clearly.</p><br/><p>Especially Zuo Mo’s last head attack… …</p><br/><p>Humph, humph, such a fun thing, how can it be just the three of them that played? Tao Zhu Er thought cunningly. She believed that many people in the sect would be interested.</p><br/><p>At this time, Zuo Mo couldn’t wait for those people to leave immediately. He didn’t even think, waved his hand to send them away: “Fine!”</p><br/><p>Finishing, he turned around. With the admiring gazes of the outer sect disciples behind him, he floated away. This time, he didn’t hear Tao Zhu Er speak again. Zuo Mo finally released a breath.</p><br/><p>Tao Zhu Er bit her lips. She had never been dismissed like this, had never been hurried away like this! Sometimes, the hatred of a woman would germinate from a very small detail.</p><br/><p>Just wait! She thought hatefully.</p><br/><p>Zuo Mo returned to the Little West Wind Yard and caressed the two talismans he took. They were really good things! The more he looked, the more he liked it. He really profited today! As to the consequences, they were completely thrown to the back of his head. In his mind, these two fine third grade talismans, they were worth anything!</p><br/><p>After recovering his ling energy in the stone room, Zuo Mo started to imprint the water drop sword.</p><br/><p>As he carried out the imprinting, he discovered that the water drop sword lived up to being the finest among the third grade flying swords! The body of the water drop sword was extremely soft and could curve in any direction. It also contained an extremely large amount of black water. In reality, it was a water sword! The ling energy could reach every part of the sword, and due to its softness, Zuo Mo was able to, through manipulating ling energy, change the shape of the flying sword.</p><br/><p>It was as though it had been custom made for [Li Water Sword Scripture].</p><br/><p>From the time he got it, other than imprinting it, Zuo Mo put it in the ling spring in the rock rome. The ling energy of the ling spring was lively and rich. To put it in there and slowly nurture it, it was especially helpful for increasing the nimbleness of the water drop sword.</p><br/><p>As for the jade pendant, Zuo Mo wore it every day. He finally understood the formations on the jade pendant. The jade pendant had three formations. Other than [Flowing Fire Core Management Formation], there was also [Clear Heart Incantation] and [Ling Gathering Formation]. Nothing needed to be said more about [Streaming Fire Core Management Formation]. [Clear Heart Incantation] nurtured the mind and [Ling Gathering Formation] could gather the ling energy in the surroundings and was very practical.</p><br/><p>If Zuo Mo didn’t have the ling vein in the rock room, [Ling Gathering Formation] would definitely be one of the formations he wanted to get the most. The [Ling Gathering Formation] on the jade pendant was just the most basic ling gathering formation but the effects were extremely evident.</p><br/><p>When Zuo Mo wore the jade pendant as he meditated in the rock room, the efficiency would increase by one tenth!</p><br/><p>Don’t underestimate the one tenth. Accumulating over time, the gap it caused was extremely large. Ling gathering formations were one of the most well studied formations. At the same time, it was also called the formation that was created through jingshi. It consumed large amounts of jingshi. So for the simpler [Ling Gathering Formation], it wasn’t as practical as taking ling energy from the jingshi. But if it had to be constructed on the jade pendant, other than needing the forger to be knowledgeable about the ling gathering formation, but the material it was constructed on had to be able to gather ling energy already. Materials that could gather ling energy as one of its attributes, all of them were extremely expensive.</p><br/><p>On this jade pendant, the most valuable was this non-descript [Ling Gathering Formation]. It was even more valuable than the [Streaming Fire Core Management Formation]. Just this [Ling Gathering Formation], it was enough to elevate this jade pendant into third grade.</p><br/><p>If was a pity that he couldn’t make dan right now. Otherwise, he really wanted to try out the effects of the [Streaming Fire Core Management Formation].</p><br/><p>Zuo Mo probably wouldn’t have thought the incident of him defeating the trouble-makers of Ling Ying sect would have more of an effect with the outer sect disciples than his battle with Luo Li in the sect assessment. For outer sect disciples, the person who was stronger would make them respect him, but the shixiong who was willing to protect them and their profits, he would be more loved by them.</p><br/><p>This battle, Zuo Mo had received great experience.</p><br/><p>Actually, based on cultivation, he didn’t have much of a difference than Hu Shan and Yan Ming Zi. He was even slightly weaker than them. The reason that he could win came from the fact that he had comprehended sword essence. Regardless of whether it was Xin Yan Shibo’s tidal sword essence or the Li water sword essence, his understanding of the sword scripture, of presence, far surpassed the others. Combined with the other’s underestimation of him, that was how he had so easily won.</p><br/><p>Otherwise, the person who would have lost would have probably been him, especially if Hu Shan had used the armor seal just a step earlier.</p><br/><p>Thinking about it, Zuo Mo couldn’t help but rage. Was this group of people fighting? They were just throwing jingshi!</p><br/><p>He pretty much was drooling at the grandiose talismans. They could carelessly use things like an armor seal. He felt pain on their behalf! Squanderer! They were truly squandering everything!</p><br/><p>What also caught Zuo Mo’s attention was [Vajra Profound Sutra]. No matter if it was against Yan Ming Zi or Hu Shan, [Vajra Profound Sutra] had been very effective and pivotal in battle. It seemed that he had to put more time into [Vajra Profound Sutra]. This thing wouldn’t just save his life. It seemed to have other effects as well.</p><br/><p>But when he thought about [Vajra Profound Sutra], he remembered the gravestone version of [Vajra Profound Sutra].</p><br/><p>The five bits that had been modified haunted his mind and would pop up occasionally. Especially when he was practicing [Vajra Profound Sutra], he couldn’t stop himself from thinking about the five different parts. It drastically impacted the efficiency of his practice.</p><br/><p>Why don’t I try it? Zuo Mo thought hesitantly.</p><br/><p>Translator Ramblings: I’ve started working on the cast list. There is a lot of people for the last 85 chapters.</p><br/><p>A list of the units of measurement used in this novel is up in the cultivation terms and glossary. There’s the metric and imperial equivalents for some of them since I used the measurements from the 20th century. Wikipedia was very helpful.</p><br/>\n</div>"}