{"title": "Chapter Ninety-Three Stalagmite Fire", "id": 43, "volume": 1, "url": "http://boxnovel.org/world-of-cultivation-chapter-ninety-three-stalagmite-fire", "volume_title": "Volume 1", "body": "<h1>Chapter Ninety-Three Stalagmite Fire</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Ninety-Three Stalagmite Fire</p><br/><p>The milky-white stalagmite fire was born in the stalagmites of yin caves, and was a kind of cold fire.</p><br/><p>Sucking it into his body, Zuo Mo felt a cold energy quickly spread through the channels in his body. Even though he had prepared before, his body couldn’t help but shake, the ling power almost slipping out of control. Pushing aside his surprise, he tried to control the movement of ling power to surround this Stalagmite fire. This ball of Stalagmite fire was provoked, the cold energy increasing. The milky-white flame gave off a strong coldness. The coldness was also extremely humid. What was even more shocking was that, in such a freezing energy, the moisture hadn’t been frozen into ice, but still existed as vapor.</p><br/><p>Quickly, Zuo Mo felt the effect of the icy moisture! The unparalleled icy moisture, following the spitting of the flame, spread out in waves. The cold energy they contained was even more dense. Wherever they touched the channels, the channels would be damaged. They were like an extremely corrosive mist, leaving behind patches of frozen white wherever it passed.</p><br/><p>The numbness of the channels was extremely uncomfortable. Zuo Mo gritted his teeth, continuing to control his ling power to suppress this Stalagmite fire.</p><br/><p>The Stalagmite fire was like a trapped beast, furiously fighting, the flame spitting.</p><br/><p>The freezing moisture was like the deadly energy that this white beast spat out, trying its best to damage Zuo Mo’s channels.</p><br/><p>Zuo Mo felt pain inside. He could only follow the method of taming fire seeds from the [Yin Fire Bead Chapter], furiously channeling ling power. The ling power in his body suddenly changed, quickly enveloping the Stalagmite fire tightly.</p><br/><p>The Stalagmite fire seemed to have detected the change as it was covered by ling power, becoming more agitated than ever, furiously fighting.</p><br/><p>Zuo Mo’s ling power flowed away quickly.</p><br/><p>The stronger the struggles of the Stalagmite fire became, the faster the ling power in his body would be used up.</p><br/><p>Zuo Mo became slightly panicked. If this speed continued, his ling power would quickly reach the bottom. Damn it! By now, this wasn’t a question of whether or not he could tame this fire, but whether or not he could keep his life. If the Stalagmite fire lost the suppression from ling power, it would start burning from inside his body until he was burnt into a pile of ice.</p><br/><p>Who would have thought assimilating a second-grade fire seed would be so difficult?</p><br/><p>This wasn’t going to work!</p><br/><p>At this time, Zuo Mo couldn’t attend to anything else. He was like a gambler that was on the precipice of death, eyes red from losing! The step behind them was the fall off a thousand foot high cliff, there was no place to retreat! Since he could not retreat, then he would bet everything he had!</p><br/><p>You’re just a second-grade Stalagmite fire, you dare to fight with ge!</p><br/><p>You don’t know what you’ve done!</p><br/><p>Strangely, the anger inside Zuo Mo suddenly erupted after he was pushed to death’s door. At this time, he didn’t use [Yin Fire Bead Chapter]. In his eyes, this Stalagmite fire was just a large pest that had burrowed into his body!</p><br/><p>All of his spiritual power were gathered, and he unhesitatingly cast [Art of Aged Gold]!</p><br/><p>Zuo Mo didn’t have any remaining thought of taming it. He only had one thought. Kill it!</p><br/><p>A handful of golden mist transformed into a little gold sword!</p><br/><p>It was instinct after practicing the sword for so long. Without any need to think, the sword essence erupted!</p><br/><p>The robust sword essence released itself through the little sword!</p><br/><p>A golden light flashed on the little sword and it quickly melted, the golden liquid flowing and twisting. In the flick of a finger, a miniature golden Water Drop sword appeared inside Zuo Mo’s body!</p><br/><p>As the golden sword took shape, the robust sword essence quickly became murderous and cold! The coldness of the Stalagmite fire was like the heart-piercing cold in the deep of the cold spring, and the icy sword essence exuded by the little Water Drop sword was like the endless cold wind of the tundra, carrying ice, sharp as a knife!</p><br/><p>Zuo Mo hadn’t thought that, just at this time, [Art of Aged Gold] suddenly broke through to the fourth level!</p><br/><p>Surrounded by ling power, the struggling Stalagmite fire suddenly stopped, motionless!</p><br/><p>Zuo Mo’s murderous intent, carried by the sword essence, was passed onto the stalagmite fire without any hindrance.</p><br/><p>If you keep moving, I’ll kill you!</p><br/><p>If this Stalagmite fire still didn’t listen, then the Water Drop sword would cut it into pieces. He was prepared to give up this Stalagmite fire. For a second-grade Stalagmite fire, to pay with his life, it wasn’t profitable.</p><br/><p>But the next scene struck Zuo Mo dumb.</p><br/><p>The milky-white Stalagmite fire shrunk into a small ball, like a little kid holding his legs in a ball, shaking. This action was so like what a person could do that Zuo Mo’s rage decreased slightly.</p><br/><p>So weird, these days, even fire seeds bullied the weak and were afraid of the strong! Muttering in his heart, he didn’t dare let down his guard. This time, the Stalagmite fire didn’t stop Zuo Mo’s consciousness from seeping in.</p><br/><p>What Zuo Mo didn’t know was that this Stalagmite fire, formed after countless years, had a basic intelligence.</p><br/><p>Two hours later, Zuo Mo opened his eyes, giving a long exhale. He pointed out his index finger and a milky-white flame suddenly rose from his finger, silently burning. Thinking about the danger that had just passed, Zuo Mo still had lingering fears. He had been yearning for a flame for a long time, but he was entirely ignorant about the process of assimilating a flame. Based on his cultivation, he would have had a difficult time taming this Stalagmite fire. If he just barely tamed it, he would only end up burning himself to death.</p><br/><p>Thankfully, he had been inspired to use [Art of Aged Gold] and sword essence together to brutally suppress the Stalagmite fire.</p><br/><p>However, Zuo Mo was completely ignorant of the fact that taming a fire seed was related to cultivation.</p><br/><p>It was really dangerous. Having made a trip to death’s doors and come back, Zuo Mo wiped the sweat off his forehead. Thinking about the simple description on [Yin Fire Bead Chapter], and his own dangerous encounter, he muttered, it seemed like he couldn’t completely believe [Yin Fire Bead Chapter]. If he just followed the instructions, his little life would be gone.</p><br/><p>In the end, it was still that the things that Pu Yao gave weren’t reliable!</p><br/><p>But upon further thought, he understood. Pu was a three thousand year old antique. The stuff he had naturally was the old things from three thousand years ago. Those things were so old their teeth would be falling out. How could there not be a problem?</p><br/><p>Would antiques understand going with the times?!</p><br/><p>Zuo Mo continued to rant, swearing at Pu Yao as though this was what he needed to comfort his wounded soul. Of course, he could only rant. He was still afraid. It was very lucky that he hadn’t made Golden Crow fire before. The second-grade Stalagmite fire almost took his little life. The fourth-grade Golden Crow fire, he wouldn’t even be able to stop it and would just burn to ash.</p><br/><p>However, in all, Zuo Mo was still very satisfied. This Stalagmite fire was a second-grade rare fire seed as ranked in [Yin Fire Bead Chapter], extremely uncommon.</p><br/><p>Zuo Mo’s mind suddenly shifted. Holding the Water Drop sword, he slowly cut away at the stone stalagmite. The inside of the stalagmite was hollow. When Zuo Mo saw a thin layer of milk-like liquid at the bottom of the stalagmite, he couldn’t help but be overjoyed. This milky-white liquid was called stone milk. It was an extremely rare material for dan-making. He hurriedly took out a small jade bottle from his bosom and carefully gathered all of the stone milk, not leaving behind one drop.</p><br/><p>When he saw the black gold worm that was turning on its spot restlessly, he first paused before laughing. He took out three drops of stone milk from the jade bottle and dropped it onto the body of the black gold wom,</p><br/><p>“Ha ha, ge eats meat, you drink soup!”</p><br/><p>As the white stone milk touched the shell of the black gold worm, it was like water touching sand, quickly being absorbed into the black gold worm. The sheen of the black gold worm’s shell became even finer and shiny. The black gold worm seemed to be full, becoming motionless on the ground.</p><br/><p>Zuo Mo knew that it was absorbing the stone milk. He took out the bamboo cylinder and put it back in.</p><br/><p>Having gained the Stalagmite fire and stone milk, Zuo Mo was impatient to return to Wu Kong Mountain.</p><br/><p>When the disciples of Wu Kong Sword Sect saw Zuo Mo’s sorry state, they were all shocked. Zuo Mo was focused on his goal, waving his hand at them, and like a burst of wind, headed straight for his own valley.</p><br/><p>Returning to the Little West Wind Yard, Zuo Mo instantly started to examine the Stalagmite fire.</p><br/><p>Stalagmite fire was a rare kind of second-grade fire seed, and naturally had its own unique attributes. It belonged to the ranks of cold fire. Just this, it was extremely rare in low grade fire seeds. Other than that, because it had been born in the humid, dark and cold of the cave stalagmites, it was both full of water and cold. Its flames would naturally give out cold moisture. In other words, it combined the two opposite qualities of water and fire in one entity. This attribute, it was even more rare in low grade fire seeds.</p><br/><p>In the five elements, water and fire opposed each other. However, in the natural world, there were many strange entities that could perfectly merge these two completely opposing attributes together.</p><br/><p>The [Li Water Sword Scripture] that Zuo Mo practiced was to manipulate water like fire. From a certain perspective, it also contained attributes of water and fire. This was also the best and trickiest bit of the sword scripture. However, while [Li Water Sword Scripture] had the qualities of water and fire, but it was far from the wonders of something natural like the Stalagmite fire.</p><br/><p>Manipulate water like fire. It was still water in the end. It just borrowed the shape of fire.</p><br/><p>Stalagmite fire was truly something that had both fire and water. However, fire was definitely its primary attribute so it was ranked into the ranks of fire seeds.</p><br/><p>There were many kinds of fire, but it was sorted according to the attributes. Generally, there were four major categories of hot fire, yang fire, yin fire and cold fire. Hot fire was the most commonly seen fire. Its most important quality was its high temperature. The Streaming fire from the Streaming fire seal formation was a classical hot fire. Yang fire were sorted based on being masculine and yang. The Golden Crow fire that Zuo Mo dreamed about was the epitome of yang fire. Yin fires, which were commonly also called ghost fire, were born from yin energy, such as Shura fire. Cold fire was also called Icy flame. Its unique quality was cold and icy. They usually were born in extremely dark and cold places.</p><br/><p>There were also some strange and weird flames that were hard to sort. Those flames, they were usually the finest of flames and were treasures that every xiuzhe dreamed about.</p><br/><p>But no matter the type of flame, they would have the basic quality of fire, melting. This was also one of the reasons why the fire method was the most mainstream methods for dan-making.</p><br/><p>In the next few days, Zuo Mo studied the stalagmite fire. The present Stalagmite fire was extremely tame. If he sent it east, it definitely wouldn’t go west. Controlling fire depended on the consciousness. Zuo Mo’s consciousness was his strong suit and he could control it with ease. He could even use some complex manipulations.</p><br/><p>After playing for a few days until he was familiar, Zuo Mo thought about making yin fire beads.</p><br/><p>Yin fire beads was only a general name. In reality, the yin fire beads that were made with different flames would all be different. Even the author of [Yin Fire Bead Chapter], who detailed so many fire seeds, he didn’t have all of the fire seeds.</p><br/><p>There were hundreds of fire seeds recorded in the [Yin Fire Bead Chapter]. Only sixty eight had a description of the related yin fire bead, There was nothing on what was the effect of the yin fire beads that would be created with the remaining fires. Stalagmite fire was one of the remainder.</p><br/><p>Zuo Mo himself was extremely curious. What kind of yin fire bead would be created using such a special fire as Stalagmite fire?</p><br/><p>He started to make his first yin fire bead.</p><br/><p>Translator Ramblings: Zuo Mo is very ignorant but it’s not his fault. He doesn’t know these things and Pu Yao takes them for granted.</p><br/>\n</div>"}