{"title": "Chapter Five Cold Mist Valley", "id": 55, "volume": 1, "url": "http://boxnovel.org/world-of-cultivation-chapter-five-cold-mist-valley", "volume_title": "Volume 1", "body": "<h1>Chapter Five Cold Mist Valley</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Five Cold Mist Valley</p><br/><p>Using the jade pendant in his hands, Zuo Mo safely reached the entrance to Cold Mist Valley.</p><br/><p>The entrance was shrouded in mist, a white piece of blankness.</p><br/><p>Zuo Mo hesitated for a while, not finding any other roads, and could only stride towards the white mist.</p><br/><p>When he entered the mist, the white mist seemed to have recognized him and automatically divided, revealing a small alley. His mind relaxed and let out a breath. He admired the techniques that the sect had. If one day he could do the same, it would be so refreshing.</p><br/><p>His thoughts couldn’t help but wander away.</p><br/><p>Following the alley in the mist, after walking half a mile, his perception suddenly widened.</p><br/><p>About five mu of the valley were filled with all kinds of ling medicine. Their colors varied and their shapes were strange. Looking out, it was as though a colourful carpet had been laid out on the valley flower. Several dozens of rainbow Sparrow-Tailed Butterflies flew around. Black-banded Yellow Honeybees formed troops and flew to and fro.</p><br/><p>At the very bottom of the valley, a silver waterfall flew down from the cliff, roaring like thunder. With great power, it loudly smashed into a deep pond, making countless water drops.</p><br/><p>The moisture and the fragrance of all kinds of ling herbs mixed together. Taking a deep breath, Zuo Mo felt unspeakably comfortable. He suddenly felt that taking care of the ling fields were wasn’t as bad as he thought.</p><br/><p>Remembering that Hao Min warned to make rain once every day, Zuo Mo hurriedly started to pinch and activate the spell.</p><br/><p>The moisture condensed from all around, visible to the naked eye, and gradually formed a ball of cloud, floating above the medicine fields. The spell on Zuo Mo’s hands rapidly changed and after a series of dazzling movements, the cloud started to rain and a fine drizzle flowed into the medicine fields.</p><br/><p>This little storm lasted for an hour before the cloud dissipated. Zuo Mo gave a breath of relief. It was very wet here and made it much easier to do [Little Art of Cloud and Rain]. He couldn’t help but start to calculate. The situation was better than he had hoped for. If he toiled hard enough, he could barely finish what had been set out in the contracts.</p><br/><p>What he had to pray for was that nothing would happen to the medicine fields and remain safe and compete until Hao Min shijie came back.</p><br/><p>Nothing could be solved by him.</p><br/><p>If he had any fantasies before, he understood the cruel reality now. He was very sensitive to the density of ling energy. The ling energy of Cold Mist Valley was very plentiful. To have ploughed medicine fields in such a good spot, the grade of the ling herbs that were planted definitely wouldn’t be low.</p><br/><p>If something really happened on his watch, he would … …</p><br/><p>He shuddered.</p><br/><p>Even though the path was layered in jinzhi, there weren’t any in the valley. Zuo Mo went around the entire valley. The pond was so deep the bottom couldn’t be seen. The cold of the water pierced straight into the bones. The sound of the waterfall was very loud, echoing around the entire valley.</p><br/><p>He crouched in the ling fields, inspecting the ling herbs one by one. He needed to remember the characteristics of each ling herb by heart. He had only grown ling grain before and had no knowledge of ling herbs, so he could only use this brute method. Right now, he didn’t hope for receiving any rewards, and only hoped that nothing would go wrong.</p><br/><p>Any ling herb here, if he sold himself, it wasn’t still enough to repay it.</p><br/><p>He could guarantee he had never focused so hard before.</p><br/><p>It was only when the sky was turning dark that he dragged his exhausted body back to the yard. When he saw the mess surrounding the yard, the jinzhi that had been ripped to shreds, he wanted to cry.</p><br/><p>At this time, he didn’t have the energy to construct the jinzhi again. He was so tired he wanted to die. He didn’t have the strength to even raise his eyelids.</p><br/><p>Returning to the seclusion room, he only managed to add a drop of ling energy into the sound tablet before dropping down on the mat and falling asleep.</p><br/><p>He woke up in the sound of the sound tablet’s broadcast.</p><br/><p>“The twenty third [Sword Test Conference] has finished its qualification rounds. Up until now, four thousand two hundred and fifty three sword xiu have receive qualifications for the competition. This year’s [Sword Test Conference] has plenty of rewards. The top one hundred will receive a fourth-grade flying sword. The top ten will receive a fifth-grade flying sword. The prize for the winner has been confirmed as [Arrowpoint], seventh-grade. According to those familiar, this is the highest grade of flying sword that has been seen in the history of the [Sword Test Conference]. This has caused the interest of many major sect disciples including those from Wu Shuang Sword Sect, Suo Luo Sword Sect… …”</p><br/><p>“Good thing, good thing. I want, I want. No chance, no change.”</p><br/><p>Zuo Mo carelessly climbed up from the mat, humming a strange tune.</p><br/><p>Walking out of the seclusion room, he started to construct the jinzhi. As to the walls, he could only wait for another time to build them.</p><br/><p>He could see broken bricks everywhere and had to clean the surroundings. Otherwise, he didn’t even have space to set up the jinzhi. With his seventh level lianqi sill, there were many restrictions for him to set up a jinzhi.</p><br/><p>Humming a small tune, he cleaned up the broken and ruined walls. This yard had been built long ago and the walled were already in ruins. Now it was completely destroyed by Luo Li shixiong. Thinking about the strong and imposing manner of Luo Li shixiong as he landed from the sky, Zuo Mo felt his heart palpitate even now.</p><br/><p>Ah, Zuo Mo suddenly stopped walking and bent down to pick up something.</p><br/><p>It was a little pink paper crane, much smaller than Zuo Mo’s yellow paper crane, and very well made. This was Little Thousand Crane, used for passing letters and speech. But this was a plaything. It’s speed wasn’t as fast as letters using flying swords, especially for long distances. Using it wasn’t very convenient so most of the users were xiuzhe that were lower than jindan.</p><br/><p>How did it run over to his place?</p><br/><p>Zuo Mo rudely unfolded the pink Little Thousand Crane and suddenly understood. It was a wishing Little Thousand Crane.</p><br/><p>Very long ago, when the xiuzhe started to break through the void and search for new jie, they frequently would encounter dangers and get trapped. After the trapped xiuzhe found that they couldn’t break free, they would write their wishes and plea for help on the Little Thousand Crane and let it fly free. Since there weren’t any imprints, no one knew where the Little Thousand Cranes would fly. But the life of a xiuzhe was long. If they were lucky, they could still make it for a long period of time.</p><br/><p>After the first time a rescue occurred due to a wishing Little Thousand Crane, the wishing Little Thousand Crane became fashionable in the xiuzhe world. As time progress, this became a game for female xiuzhe to expel their feelings. They would write their emotions on the wishing Little Paper Cranes and send them out. However, they would put an impression on it so the one who picked it up could sent the wishing Little Thousand Crane back to their hands based on the imprint</p><br/><p>What made a young girl’s heart beat faster than some fate that couldn’t be calculated and was too wonderful for words?</p><br/><p>Zuo Mo couldn’t understand it. In his heart, there were only jingshi, ling grains, cultivation. Romance, this kind of luxury, he didn’t have any of it.</p><br/><p>Unfolding the Little Thousand Crane, it reveals a few rows of beautiful writing.</p><br/><p>“Hoping so much</p><br/><p>To carry a bag</p><br/><p>Go out alone to roam</p><br/><p>At a place where there was no one else</p><br/><p>Sing</p><br/><p>Soak in the sun”</p><br/><p>Sentimental nonsense. Zuo Mo snorted coldly inside and gave the criticism he thought most accurate. It was such a pity. Wasting such good paper. He didn’t know what paper it was made out of but looking at the quality, it wouldn’t be lower than third-grade.</p><br/><p>To use third-grade paper to make a Little Thousand Crane. It was a waste that raised people’s hackles.</p><br/><p>Once the paper was used, it couldn’t be used again. Such a pity, Zuo Mo thought.</p><br/><p>He was preparing to crumple the pink paper into a ball when he suddenly stopped. Expressionlessly, he tilted his head. Thinking, he started to run into his room.</p><br/><p>Rushing into the room, he looked around and found what he wanted.</p><br/><p>Fresh and thick cinnabar and a weasel bristle brush.</p><br/><p>Taking up the brush, dipping deep into the cinnabar, his wrist flowing as he wrote out a word.</p><br/><p>– “Dumbass.”</p><br/><p>Looking at the bright red that took almost all of the pink paper, Zuo Mo roared with laughter, extremely smug.</p><br/><p>His life was nerve-wracking and full. It was extremely hard and he didn’t have any time to be depressed. He knew very well the difficulty in life. All around him, everyone was putting their lives on the line in order to survive, for their families, for their descendants. Like Old Black. Even if it was hard and exhausting but he didn’t dislike this kind of life. He felt the opposite. This was life.</p><br/><p>Sentimential nonsense. Only people who had idle lives and no ambitions would have that. Zuo Mo looked down on those people.</p><br/><p>In a cheerful mood he hummed a tune as he folded the paper again into a Little Thousand Crane.</p><br/><p>“Who’s a dumbass, who’s a dumbass. You’re a dumbass, you’re a dumbass……”</p><br/><p>The imprint of the owner was on the Little Thousand Crane. After Zuo Mo put ling energy into it, he threw it up in the air.</p><br/><p>The pink Little Thousand Crane flapped its tiny wings and disappeared into the sky.</p><br/><p>Zuo Mo’s mood became exceptionally well. He exuberantly cleaned the yard, his steps lighter than usual.</p><br/><p>When the jinzhi were finished, it was past noon. He grabbed something to eat before going back to the seclusion room to meditate.</p><br/><p>Normal outer sect disciples rarely would spend such a long time on meditation. Compared to learning the arts, meditation and increasing cultivation wasn’t profitable.</p><br/><p>However, Zuo Mo persisted in spending four hours each day on meditation. After he found the ling vein in the seclusion room, he spent even more time each day in mediation. The cultivation was the foundation. That was a rationale all xiuzhe understood. He had the benefit of the ling vein. Even though what he cultivated with was the most normal scripture, but the results were still outstanding.</p><br/><p>Just how rigid the ranks were in the cultivation world, he had a very deep impression. If he could achieve zhuji, even if he was an outer sect disciple, Hao Min and Luo Li wouldn’t dare to treat him so. Zhuji was a division line. It would directly decide the quality of your life.</p><br/><p>To receive a beautiful life. The only way was to continuously increase your own power.</p><br/><p>His mediation, once he sat down, was six hours. When he opened his eyes again, his eyes were filled with joy.</p><br/><p>Lianqi eight level!</p><br/><p>Persisting in cultivating and doing the scripture, the payback finally came. He made it to the eighth level!</p><br/><p>The cultivation of eighth level liangqi, in all of the outer sect disciple of the entire Wu Kong Sword Sect, it definitely could enter the top three.</p><br/><p>He spread out his fingers and started to apply a spell. A layer of aged gold energy appeared around his finger. Once his cultivation increased a level, it was much easier to do a spell. A super excited Zuo Mo started to do [Little Art of Cloud and Rain]</p><br/><p>Once he started, he instantly felt the difference. The speed at which the moisture condensed was much faster. The rain drops poured down like they wouldn’t stop. Some new experiences he took time to savor.</p><br/><p>Suddenly remembering the medicine fields, he woke up and climbed up, rushing out of his yard.</p><br/><p>Running to Cold Mist Valley in one go, not taking the time to recover, he started to release [Little Art of Cloud and Rain]. Only when everything had been rained on did the stone in his heart land on the ground.</p><br/>\n</div>"}