{"title": "Chapter Eleven The Money Grubbing Zombie", "id": 61, "volume": 1, "url": "http://boxnovel.org/world-of-cultivation-chapter-eleven-the-money-grubbing-zombie", "volume_title": "Volume 1", "body": "<h1>Chapter Eleven The Money Grubbing Zombie</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>The lack of social welfare programs in this world really screwed Zuo Mo over. Really, it isn’t his fault how he turned out (sort of……)</p><br/><p>Chapter Eleven The Money Grubbing Zombie</p><br/><p>Before the two dealt blows, if Li Ying Feng still had suspicions, then now her suspicions greatly lessened. No matter what, with a cultivation of lianqi eighth level, it was at the top of the outer sect disciples. And this shidi should be like the other shidi and chosen to grow ling grains.</p><br/><p>Zuo Mo nodded: “The vitality of this kind of weed is extremely high. If I’m not wrong, it isn’t good to cut it. The wounds would provoke it to grow more. That is to say, chopping makes it grow faster.”</p><br/><p>The female disciples started to chitter and chatter as they discussed.</p><br/><p>Li Ying Feng suddenly understood: “So that’s why! No wonder it grew more and more vigorously. If it was uprooted, would that solve it?”</p><br/><p>Zuo Mo mused: “If that was done at the beginning, there wouldn’t have been any problems. But right now, there probably are many seeds in the soil. It isn’t easy to uproot it.”</p><br/><p>“Does shidi have any good suggestions?”</p><br/><p>“I need to go back and think.” Zuo Mo said.</p><br/><p>Li Ying Feng took out a small pouch and handed it to Zuo Mo.</p><br/><p>Zuo Mo received it with puzzlement. When he opened it for a look, he was dumbstruck. There were five pieces of second-grade jingshi inside the bag.</p><br/><p>“Having offended shidi today, I really am regretful. These pieces of jingshi are to help for shidi’s shock. Shidi, don’t blame it for being just this much.” Li Ying Feng said as she stared at Zuo Mo.</p><br/><p>Zuo Mo was wildly happy inside but his mouth went: “Shijie is really too polite.” The motion of the hand shoving the bag into his bosom, however, was extremely natural.</p><br/><p>Xiao Guo jerked her mouth, staring in shock at Zuo Mo. The other female disciples had looks of disdain – this guy was too greedy!</p><br/><p>A rock landed in Li Ying Feng’s heart. She dind’t want to end up at odds with such a shidi of great potential due to today’s misunderstanding. Five pieces of second-grade jingshi wasn’t a small sum, but to her whose family was wealthy, it wasn’t too much. To use such a price to solve a misunderstanding, from her perspective, it was a great bargain.</p><br/><p>“Shijie, don’t worry too much. The matter of the weed can be put on shidi.” It might have been the reason of the five pieces of jingshi but the female disciples all felt that this horrid zombie male in front of them instantly had a fighting spirit.</p><br/><p>Li Ying Feng raised her hands together, smiling and accepting: “Then I’ll trouble shidi.”</p><br/><p>She didn’t have high hopes inside. If Zuo Mo really had a solution, he wouldn’t say something like going back to think.</p><br/><p>Zuo Mo had never expected that he would pay attention to a minor matter today and receive five pieces of second-grade jingshi for free. On one hand, he was moved at how good Li Ying Feng was at relationship. On the other, he was moved at the extravagance of her spending. Most of the jingshi on his hands had been spend. He didn’t have many left. Just as his funds were becoming tight, wealth came flying. The unexpected surprise had him floating on air.</p><br/><p>As to the disdainful stares of the female disciples, he disregarded it as air.</p><br/><p>Humming a small tune carrying a few stalks of weeds, he cheerfully left the Eastern Peak.</p><br/><p>“This guy’s skin is so thick. My eyes are sore from glaring but he didn’t even turn red!”</p><br/><p>“Look at his move when he took shijie’s pouch, the vulgarity!”</p><br/><p>“Really makes one disgusted… …”</p><br/><p>……</p><br/><p>Xiao Guo pouted and muttered: “Shixiong is a very good person……” As she spoke, she felt that it wasn’t reliable either and her voice became lower, instantly drowning in the ruckus of discussion.</p><br/><p>“Alright!” Li Ying Feng frowned and hollered. The surrounding voices instantly stopped.</p><br/><p>She looked at the thin figure that disappeared on the mountain path who she didn’t know what he was thinking. She didn’t reveal Zuo Mo’s real cultivation to these gossiping women. If the other purposefully concealed it, and she spilled it, she would make a strong enemy. That wasn’t very intelligent.</p><br/><p>Zuo Mo hurried back to the small yard. After a long time, the plant essence bead would lose effectiveness.</p><br/><p>Solemnly standing in the ling fields in the yard, a green bead floated in front of him, adorably rolling. The two hands held together in front, the ten fingers rapidly moving. The ling energy ripples once again spreading out in the air.</p><br/><p>The plant essence bead gradually dissolved, forming a pulled of green water. As Zuo Mo’s ten fingers flowed and moved quickly, and as the speed increased, the tips of his fingers started to glow. Each time he quickly stroked, a glowing stroke would add onto a profound and cryptic design. The green water became thousands of green strands that waved in the air.</p><br/><p>“Go!” Zuo Mo gently ordered.</p><br/><p>The green hairs dissolved into the ling fields like a nymph spreading flowers.</p><br/><p>Zuo Mo released a breath and let go of the ling energy at his fingertips.</p><br/><p>Based on the difficulty of the art, [Art of Flora] was the most difficult among the five kinds of arts. Not just that the finger motions were extremely complicated, the movements of the ling energy had to be much more accurate than the other four arts.</p><br/><p>To practice finger motions, he left out four hours each day. It was extremely dull to only practise finger motions. Other than not making a mistake, flow and rhythm were the most important.</p><br/><p>His skeleton-like fingers had practised to the point they would break, to the point that he wanted to throw up.</p><br/><p>However, he still persisted. The first level of [Art of Flora] wasn’t difficult for him. As to the second level, he had no hopes in the near future.</p><br/><p>Cultivating the scripture, practicing the finger motions, caring for the ling and medicine fields. His life was extremely full. And now he had to add on examining how to get rid of weeds.</p><br/><p>Li Ying Feng didn’t have any hopes but Zuo Mo didn’t just only say it. He decided to find the solution to the problem.</p><br/><p>It really was a troublesome problem. In the beginning, he had concerned himself with another’s business, it was because he was moved by Xiao Guo’s helpless “mama”. The change came with Li Ying Feng’s five pieces of second-grade jingshi.</p><br/><p>Zuo Mo had lots of faults but there was one good quality, that was, if he decided on something, he would put his all in. As to whether it was because of that “mama” or the five pieces of second-grade jingshi from Li Ying Feng, that wasn’t important, was what he thought.</p><br/><p>In reality, he only had just two years of experience in growing crops. His knowledge of ling grasses and grains were pitiful.</p><br/><p>He knew it wasn’t easy but he wasn’t afraid.</p><br/><p>At the Eastern Peak, Li Ying Feng was listening to a female disciple narrate.</p><br/><p>“We went to check at Dong Fu. The price of the ling grasses have been continually rose recently. Like green sword grass. A while ago, it was five pieces of first-grade jingshi a picul, now it’s risen to eight pieces. The prices of the other ling grasses grew even more. They are saying that the conflict at Bloody Sky Metropolis Jie has escalated so the prices are increasing everywhere.”</p><br/><p>When the female disciple was saying this, she was on the verge of tears. The other female disciples’ faces were also bleak.</p><br/><p>Li Ying Feng’s heart stuttered. On her face, she pretended to be calm. Eight first-grade jingshi for a picul. The amount of ling grass that the stables needed everyday was astonishing. Even if her family was wealthy, she couldn’t endure such squandering.</p><br/><p>These few days, she tried to uproot these weeds but the growth of the ling grasses didn’t seem to recover at all and were still withered. In the ling fields, the weeds appeared again with astounding speed. If the situation continued, they would quickly face a situation where they had no supply of ling grass.</p><br/><p>“Shijie, the money-grubber from last time came again!” A female disciple said, full of disdain.</p><br/><p>“He still has the face to come?”</p><br/><p>“You forgot, when did he have something like face?”</p><br/><p>“That’s so true!”</p><br/><p>……</p><br/><p>Xiao Guo pouted, her adorable apple face wrinkling into a ball as she stared in discontent at the shijie.</p><br/><p>Li Ying Feng’s eyes lit up instead and she almost rushed away. Her experience surpassed all the other shimei greatly. If Zuo Mo didn’t have any news, it was normal. But coming to the Eastern Peak, it made Li Ying Feng think about the words that Zuo Mo had said before he left.</p><br/><p>Was it……</p><br/><p>When Li Ying Feng saw Zuo Mo, she was shocked.</p><br/><p>Zuo Mo’s hair was a mess, his eyes filled with blood, his sockets deep in his face. A strange odor came from his body. He seemed like a beggar.</p><br/><p>Other than Li Ying Feng and Xiao Guo, the other female disciples had a face full of disdain as they stood far away.</p><br/><p>“I found a solution.” Zuo Mo’s simple words let Li Ying Feng and Xiao Guo enter into rapture.</p><br/><p>Disregarding the disdainful and suspicious gazes of the other female disciples, Zuo Mo headed straight into the ling fields.</p><br/><p>He didn’t waste any words. Reaching out with a pair of skeleton-like hands, he rapidly started a spell.</p><br/><p>Li Ying Feng stared with large eyes, afraid to miss anything. The familiarity of Zuo Mo’s finger movements and the ease with which he controlled the ling energy made her even more certain this shidi hid away deeply.</p><br/><p>The glowing fingertips drew an unnamed formation diagram.</p><br/><p>“Go!”</p><br/><p>A dry voice, harsh and dissonant.</p><br/><p>The glowing formation entered the ling field soundlessly.</p><br/><p>“That’s all? But nothing changed!” A female disciple shrieked.</p><br/><p>That was like a fuse. Instantly, the other female disciples that disliked Zuo Mo found a target.</p><br/><p>“Che, just drawing a few characters and want to fool us? Too naïve!”</p><br/><p>“Please, be more professional when conning people!”</p><br/><p>…….</p><br/><p>“All of you shut up!” Li Ying Feng roared angrily. All the voices choked off. They found that at some unknown time, shijie’s expression had become peerlessly ugly. Her face was icy. They instantly sank into cold terror.</p><br/><p>“This kind of weed is yang-type. I researched it. Most of the ling grasses you plant belong to yin. You could use [Art of Earth Energy] to concentrate the yin of the earth energy. It would nourish the ling grasses and can suppress the weeds. Half the work, twice the effect.”</p><br/><p>Finishing, Zuo Mo raised his hands towards Li Ying Feng and then left.</p><br/><p>Returning to the yard, Zuo Mo dropped into slumber.</p><br/><p>Thinking that he had finished what he had wanted to do, he was content. After not sleeping or resting for these days, he already ran out of energy.</p><br/><p>When he woke up, it was the next day. The morning sunlight made his mood light. He idly ate a few things and just like normal, he started his classes for the day.</p><br/><p>The training of his finger motions were one of his prioritized studies at present. Before this, he rarely had practiced finger movements. The finger movements of [Little Art of Cloud and Rain] had been very simple.</p><br/><p>But of it, he had suffered greatly at the [Art of Flora]’s complicated finger motions. Up until now even though he persisted in practicing everyday, he could only just manage to complete the spell. It was far from familiarity. He didn’t dare to relax on the practice of [Art of Aged Gold]. He had just gotten to the second level and needed time to consolidate and stabilize it.</p><br/><p>Roughly calculating, he had learned all five kinds of arts once and had his own conclusions.</p><br/><p>The five kinds of arts had their own emphasis. [Little Art of Cloud and Rain] emphasized the manipulation of ling energy, [Art of Flora] finger movements, [Art of Aged Gold] used consciousness, [Art of Earth Energy] emphasized communication and interaction, [Art of Crimson Flame]’s crux was the calmness of mind and endurance.</p><br/><p>At this time, Zuo Mo found an unique pattern. It looked as though the five kinds of arts were not related but in reality, they supported each other. His strongest was [Little Art of Cloud and Rain], which aided him greatly for learning the other four arts. And the complicated finger movement practice of [Art of Flora] greatly increased the skill of his finger movement so he was even more skilled at doing [Little Art of Cloud and Rain.]</p><br/><p>After patrolling the ling fields under his name, he then made rain for the medicine fields in Cold Mist Valley. He didn’t have any news of Hao Min shijie, and didn’t know where the two people had gone to be free. But he didn’t have any grudges towards this unpaid job now. The only thing he hated was that there was a distance between Cold Mist Valley and his residence and he had to spend a significant amount of time on the road every day.</p><br/><p>When he came back from Cold Mist Valley, he was shocked to find two people waiting outside the doorway to his little yard.</p><br/>\n</div>"}