{"title": "Chapter Ten Weeds", "id": 60, "volume": 1, "url": "http://boxnovel.org/world-of-cultivation-chapter-ten-weeds", "volume_title": "Volume 1", "body": "<h1>Chapter Ten Weeds</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Ten Weeds</p><br/><p>To this strange shixiong that had appeared out of nowhere, this little girl clearly was a bit afraid and narrated faithfully: “There’s a strange grass growing in the ling fields. Xiao Guo tried really really hard but it still grew and grew so fast. The green sword grass is so pitiful, it grew slower and slower … …”</p><br/><p>Seeing the lower and lower tone of the little girl and the increasingly askew mouth, Zuo Mo interrupted in the nick of time: “Stop!”</p><br/><p>The little girl was shocked again. She raised her head with her misty large eyes as she stared in puzzlement at Zuo Mo.</p><br/><p>Zuo Mo stood and patted the dirt off his behind: “Let’s go.”</p><br/><p>The little girl’s face was full of question marks. After a while, she timidly asked: “Where?”</p><br/><p>The timid expression on the other’s face always made Zuo Mo mad. The mood that had just calmed instantly became agitated again. He said extremely impatiently: “Shuddap! Go where I tell you!”</p><br/><p>Have to be collected, have to be collected. It was too meaningless to argue with a little girl. Zuo Mo told himself.</p><br/><p>He softened his voice, trying to make himself look calm: “Let’s go look at you ling fields.”</p><br/><p>Wu Kong Sword Sect might be a small sect but even a small sparrow had all of its organs. The zoo were at the Eastern Peak of Wu Kong Mountain. Most of the outer sect female disciples lived here.</p><br/><p>This was the first time Zuo Mo stepped onto the Eastern Peak. The scenery as he passed made him awed. Compared to the levelness of the Western Peak, the Eastern Peak was steeper, the view better. Adding on that most female disciples lived here, the mountain paths were filled with flowers and grasses. Walking in the middle, it relaxed his mind.</p><br/><p>The Western Peak and Eastern Peak were very distant from each other. It was extremely rare for male outer sect disciples to come.</p><br/><p>In the woods, a small white house came into view. The little girl’s composure settled and she timidly looked at Zuo Mo, pointing at the house, informing: “Shixiong, that’s Xiao Guo’s house.”</p><br/><p>Zuo Mo was too lazy to speak and headed straight for the small house.</p><br/><p>When he walked in he found that there was a patch of grass beside the little cottage. And there was a golden-horned ox whose body appeared to be made from metal lazily soaking in the sun.</p><br/><p>“A Bao A Bao!” When Xiao Guo saw the copper ox, she happily yelled and ran over without a care.</p><br/><p>A Bao… …</p><br/><p>Zuo Mo looked at the body of the copper ox that was filled with strength and though of the adorable name and became speechless.</p><br/><p>And then he saw the copper ox intimately use the head to gently bump at Xiao Guo and occasionally reach out to lick Xiao Guo’s hand with the tongue.</p><br/><p>That large tongue covered in saliva made Zuo Mo disgusted.</p><br/><p>“Where’s the ling field?” He had to interrupt. Otherwise he was suspicious that this person and ox would just keep playing.</p><br/><p>In the ling field, Zuo Mo carefully examined the plant in front of his eyes.</p><br/><p>This was a grass that he had never seen before. Just this one thing was enough for him to become serious. One had to know, he had grown ling grain for two years. All the grasses that showed up normally in the ling fields, he was very familiar with. But he was certain he had never seen this grass before.</p><br/><p>After he inspected the ling fields, his heart became even heavier.</p><br/><p>“When was it when you started to find them?”</p><br/><p>“About three months ago. Xiao Guo would weed everyday, but they grow more and more … …” Xiao Guo’s mouth twisted and the tears looked like they were going to brim over.</p><br/><p>Zuo Mo expressionlessly looked at her.</p><br/><p>Xiao Guo cowered back a step, her crying instantly disappearing. This shixiong was too scary!</p><br/><p>Zuo Mo took back his gaze. He was shocked inside. The reproductive ability of this weed was very strong.</p><br/><p>“What about the others?”</p><br/><p>“Many of the elder sister’s ling fields are like this. The sisters couldn’t find any solutions.” She suddenly muttered: “Shixiong, could you help the sisters?”</p><br/><p>Zuo Mo was too lazy to respond to her and start to ponder how to deal with this kind of weed. Farming meant confronting many questions. Getting rid of weeds was one of the most frequent questions. If a furiously growing weed appeared in the ling fields, the question would become extremely serious.</p><br/><p>Just simply weeding clearly couldn’t solve the problem. At this time in the ling fields, it was the weeds that were flourishing, and the green sword grass rare.</p><br/><p>Zuo Mo’s gaze suddenly landed on the part of the weed near the ground. At that part, there were a ring of tumor-like growth. His heart moved and he inspected some other stalks of weed. He found that they too had bumps in the same places.</p><br/><p>When he saw that, he had a general understanding. The little girl didn’t understand. Weeding was just cutting down the part of the plant above the ground but the specialty of this kind of weed was that once it was wounded, it would grow even faster. If at the very beginning, proper procedures were taken such as uprooting it completely, noting like the present situation would have happened.</p><br/><p>But the problem was very serious now. It was patches and patches of weed. They definitely would have left many seeds in the soil. That was the most troublesome part. If the seeds couldn’t be completely cleaned, then the trouble would continue.</p><br/><p>It really had strong vitality! Zuo Mo couldn’t help but praise it inside.</p><br/><p>Li Ying Feng’s elegant brows furrowed. Her eyes were sharp and there wasn’t any of the nimbleness usually present on her face which was full of worry. She didn’t wear the long dress and gauze clothing that normal female disciples like to wear but a set of tight short-sleeved men battle robes. There was no allure but an unnameable handsomeness!</p><br/><p>“Shijie, we can’t continue like this!” A yellow-clad female disciple beside her couldn’t help saying: “Based on this situation, after two months, we can’t replenish the green sword grass.”</p><br/><p>A crowd of female disciples circled around her and started to chatter and discuss.</p><br/><p>“Stop quarrelling!” Li Ying Feng’s brows rose and she lectured icily.</p><br/><p>She had the highest cultivation among the female outer sect disciples. Normally, she was widely accepted by everyone. After the shout, the sound instantly stopped.</p><br/><p>LI Ying Feng’s heart was also full of worry. The weeds were increasingly fast. The living space of the ling grasses was increasingly smaller. If the ling grasses couldn’t be supplied, these ling animals wouldn’t have anything to eat. And the sect’s punishment wouldn’t be lacking.</p><br/><p>Her cultivation was at the ninth level of lianqi, one step away from zhuji. Supposedly the elders of the sect had already started to pay attention to her. Once she succeeded at zhuji, she would be taken as an inner sect disciple. That was certain.</p><br/><p>For such a big slip-up to occur at such a crucial time, she didn’t have the appetite or desire for sleep these days.</p><br/><p>“Shijie, shijie.” A female disciple panted as she ran over: “Xiao Guo came to Eastern Peak with a male disciple. Xiao Guo seemed to have cried.”</p><br/><p>Instantly, they exploded.</p><br/><p>“He dared to bully Xiao Guo!”</p><br/><p>“Humph. I want to see who dares to do so. Sisters, we can’t let him off!”</p><br/><p>“Right!”</p><br/><p>“Definitely!”</p><br/><p>……</p><br/><p>Li Ying Feng was slightly angry. Xiao Guo deeply received their care and affection. Usually, everyone treated her as a little sister. Hearing a man had made Xiao Guo cry, she, of the style of bold and domineering, unhesitatingly started first for Xiao Guo’s residence.</p><br/><p>Seeing the situation, the others quickly followed.</p><br/><p>When Zuo Mo was searching for a way to solve the matter of the weeds with their tenacious vitality, Li Yin Feng, leading a crowd of female disciples, marched over.</p><br/><p>When Li Ying Feng, who had only half-believed it, saw the tear marks of Xiao Guo’s face, the anger inside rose up.</p><br/><p>A quick dash and she rushed in front of Zuo Mo.</p><br/><p>“Who are you?” Li Ying Feng asked frigidly.</p><br/><p>And then she saw the other expressionlessly answer: “Zuo Mo.”</p><br/><p>The ice on Li Ying Feng’s face became even heavier. Among the outer sect disciples, she was the eldest shijie. In front of her, everyone else was shidi and shimei. She had never seen someone so discourteous. Immediately, without another word, she pointed with her fingers at Zuo Mo.</p><br/><p>Xiao Guo’s face instantly became bloodless. Before she could speak, she heard a ripping sound.</p><br/><p>An extremely thin green sword energy shot at Zuo Mo,</p><br/><p>Zuo Mo’s pupils suddenly shrunk. Before he could think, he quickly raised his right hand and at the same time, he retreated abruptly.</p><br/><p>A gold sword energy flashed.</p><br/><p>Li Ying Feng saw the gold colored sword energy and her expression couldn’t help changing.</p><br/><p>The two sword energies met in the air.</p><br/><p>Ding!</p><br/><p>A blinding light made everyone unconsciously want to close their eyes, green and gold light scattering everyone.</p><br/><p>The two faced each other.</p><br/><p>Zuo Mo stared fixedly at the other with wide eyes, the anger unable to be controlled and rose up. Being attacked by someone out of the blue. And such a dangerous attack! If at that moment he hadn’t avoided it, there definitely would be a hole in his body.</p><br/><p>The shock that Li Ying Feng received was much stronger than Zuo Mo. She was the most accomplished outer sect disciple of Wu Kong Sword Sect. This [Wood Spirit Sword Art]. Other than her, no one could accept it. It was only when her gaze landed on the ring on Zuo Mo’s right hand that she understood.</p><br/><p>A term jumped into her head – talisman!</p><br/><p>This didn’t make her underestimate the other. Things like Ling Exciting Hoe, it could only be considered as a tool. Even the lowest grade talisman was a great cost for an outer sect disciple. But this only expressed that he had some wealth.</p><br/><p>What really shocked her was the other’s reaction. The speed of reaction was directly linked to the level of cultivation. Even the best talismans needed cultivation as the foundation. The speed of the other’s reaction was outside her expectations.</p><br/><p>This unfamiliar shidi’s cultivation definitely wasn’t lower than lianqi eighth level!</p><br/><p>A cultivation of lianqi eighth level, it could enter the top three of the outer sect disciples. According to what she knew, outer sect disciples that were above the eighth level of lianqi, other than her, there was only Wei Sheng who was the present sword servant of Luo Li shixiong. This unfamiliar male she didn’t have any memory of. That meant that he achieved lianqi eighth level not long ago.</p><br/><p>In Wu Kong Sword Sect, achieving eighth level of lianqi definitely wasn’t a minor event. But she hadn’t heard anything. Then there was only one possibility. That was, this expressionless male in front of her had concealed this event!</p><br/><p>As to why the other would conceal a matter that would elevate him dramatically, she couldn’t guess.</p><br/><p>This person was very shrewd!</p><br/><p>Looking at the expressionless Zuo Mo, she was slightly regretful of her previous action.</p><br/><p>“Shijie, shijie! Why did you act against shixiong?” Xiao Guo suddenly rushed between the two, her face pale and frantic.</p><br/><p>Li Ying Feng instantly realized something wasn’t right. She couldn’t help ask: “Xiao Guo, didn’t he bully you?”</p><br/><p>“Bully?” Xiao Guo paused and then shook her head: “He didn’t! Shixiong is helping Xiao Guo look at the ling fields. Shijie, shixiong might look scary but he’s a very good person……”</p><br/><p>When Zuo Mo heard this, he generally understood what had gone on and couldn’t gasp at his bad luck. Calming down, he admired the strength of the woman in front of him.</p><br/><p>Suddenly remembering the rumors he heard normally, he couldn’t help ask: “Is it Li Ying Feng shijie?”</p><br/><p>“I am Li Ying Feng!” Li Ying FEng answered, her expression apologetic as she bowed: “Just now, it was me that was rash and almost made a big mistake. I’m apologizing to shidi for it here!”</p><br/><p>The other’s generous and sincere attitude aroused good feelings in Zuo Mo who hurriedly responded: “Just a misunderstanding, shijie doesn’t have to take it seriously!”</p><br/><p>Li Ying Feng didn’t pretend and asked solemnly: “Has shidi found something?”</p><br/>\n</div>"}