{"title": "Chapter Sixteen Sword Essence", "id": 66, "volume": 1, "url": "http://boxnovel.org/world-of-cultivation-chapter-sixteen-sword-essence", "volume_title": "Volume 1", "body": "<h1>Chapter Sixteen Sword Essence</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>The footnotes are clickable so if you click on them again, you go back to its place in the text. I added new terms to the glossary. I tried to copy what the ISSTH glossary did so tell me if what’s up is what was being requested. I think the text itself describes what the terms do or are so I didn’t write very detailed descriptions.</p><br/><p>Thanks for all the comments and typo picking. Please keep going.</p><br/><p>I think I’m going with the sea of consciousness because the Chinese term is . I could do spiritual sea but for some reason, it feels awkward to me.</p><br/><p>Chapter Sixteen Sword Essence</p><br/><p>“Don’t forget!”</p><br/><p>……</p><br/><p>“Even if you die, you mustn’t forget!”</p><br/><p>……</p><br/><p>The strange yet familiar voice echoed like a nightmare.</p><br/><p>Just like usual, Zuo Mo was startled awake from his dream. He grimaced as he sat up. Rationally, if he had the same dream this many time, he should be numb against it. But each time he woke up, he would find his body soaked in sweat. Even he felt that it was unimaginable.</p><br/><p>The stars in the sky were brightly lit, the starlight falling down. Wu Kong Mountains was peaceful and quiet.</p><br/><p>That dangerous scene from last night flashed before his eyes. He suddenly remembered that black dandelion seed in his sea of consciousness. He quickly went to inspect. It was still floating in his consciousness. There wasn’t any movement. He released a breath. No matter what method he used, it didn’t have any effect on this black dandelion seed.</p><br/><p>He was somewhat worried. From a glance, it could be seen that this black dandelion seed wasn’t something good. Now that it suddenly ran into his sea of consciousness, it definitely wasn’t a good thing.</p><br/><p>Should he wait a while and then go take a look at the doctor?</p><br/><p>He mused inside. Waking up in the middle of the night, he didn’t have a hint of drowsiness. After thinking for a while, the matter of the black dandelion seed was thrown to one side. In this situation where he couldn’t think of any solutions, excessive worry was superfluous.</p><br/><p>Limited by his cultivation, his sea of consciousness wasn’t large. Other than that black dandelion seed, it was empty.</p><br/><p>As he kept on thinking, he thought about that sword essence that flew over the heavens. The shock that that sword essence gave him was too large, deeply ingraining itself in his head.</p><br/><p>He had never learned any sword scriptures but that didn’t mean he didn’t understand anything. In the outer sect disciples, there were many that practised sword scriptures. Because Wu Kong Sword Sect was a sword sect. Like Wei Sheng Shixiong, he mainly cultivated the sword, and had once been Luo Li Shixiong’s sword servant.</p><br/><p>The so-called sword servant, they were the servants of sword xiu. They were responsible for cleaning the battlefield and some supplementary duties.</p><br/><p>Wei Sheng Shixiong had the greatest battle strength in the outer sect disciples, and his battle experience was extremely rich. It was rumoured that he had even once killed sword xiu who were in the initial stages of zhuji. But he had seen how Wei Sheng Shixiong practising. The lights flew and it was very pretty, but compared to that sword essence, it was like a colourful paper bird, a poke and it would tear.</p><br/><p>But the vast sword essence last night that seemed to cleave the heavens, he had never imagined anything like it. Under that sword strike, everything bowed. He was as tiny as an ant.</p><br/><p>Just at this time, something unexpected occurred!</p><br/><p>In his sea of consciousness, an icy and pure white sword essence appeared without a warning!</p><br/><p>Zuo Mo’s body froze, his eyes bulging and his breathing stopped.</p><br/><p>A beat later, his cold body steadily warmed. His eyes slowly recovered the spirit. He heavily exhaled, shock filling his eyes.</p><br/><p>Why was it like this?</p><br/><p>That suddenly appearing sword essence, it was exactly the same as that terrifying sword strike last night!</p><br/><p>Having no guards against it, that sword strike almost cleaved his sea of consciousness in half. The pure and cold murderous intent contained in the sword strike directly made him stop breathing, all the organs in his body at that moment stop moving!</p><br/><p>He still felt trepidation and didn’t understand what had happened at all.</p><br/><p>It wasn’t possible!</p><br/><p>Having the black dandelion seed exist in his consciousness was enough to make him terrified, now there was the addition of a sword essence!</p><br/><p>No!</p><br/><p>When he inspected before, he didn’t find this sword essence!</p><br/><p>Leaving his sea of consciousness, he thought back in great detail on how the sword essence had appeared. Then he found, just when the sword essence had appeared, it was exactly when he was in the sea of consciousness facing the black dandelion seed when he remembered the sword essence.</p><br/><p>A bold idea suddenly appeared in his head.</p><br/><p>Was it that this sword essence had been released by that black dandelion seed?</p><br/><p>This freakish idea, once it came out, it couldn’t be pushed down.</p><br/><p>His sea of consciousness turned back into a void. The black dandelion seed floated around alone in the void. Zuo Mo hesitated. That sword essence was too strong. Just right now, the blow to his body and soul were extreme.</p><br/><p>But the desire to understand what happened quickly won. He gritted his teeth!</p><br/><p>Go for it!</p><br/><p>Facing the black dandelion seed, he thought back to that sword essence!</p><br/><p>Hiss!</p><br/><p>A silvery white sword essence flew out!</p><br/><p>Splat!</p><br/><p>Zuo Mo’s body froze and he threw up a mouthful of blood.</p><br/><p>A second later, “Hahahaha!” The sound of laughter rang out of the little yard. Zuo Mo’s mouth was smeared with blood, frightening to the eye, yet his face was joyous.</p><br/><p>It really was that black dandelion seed! The sword essence really was released by it!</p><br/><p>Having prepared this time, he saw it clearly. Not just that, he also found that this sword essence was completely different than what he had seen last time. Or, more correctly, it was even clearer! And because of it, its undoubted power was exposed. How could Zuo Mo’s fragile spirit endure the blow of such a strong sword essence? So he was wounded and spat blood.</p><br/><p>But even wounded, Zuo Mo couldn’t help roar with laughter.</p><br/><p>If he could comprehend this sword essence ……</p><br/><p>Before last night, he didn’t have a bit of interest in sword xiu. But that pure and icy sword energy planted a seed in his heart. A seed that was interested in strength.</p><br/><p>But Zuo Mo quickly came out from his joy. This sword strike was extremely strong, nothing he could bear.</p><br/><p>His head started to ache. After receiving two blows from the stroke strike, his spirit was already wounded. And, thinking about the pain as his body being completely frozen, his consciousness easily being split in half, his face slightly paled.</p><br/><p>Comprehending this sword essence, there were many benefits. But, at the same time, he had to pay a painful price. The spirit being wounded, it was much harder to heal than other wounds.</p><br/><p>The pain at his head made him hiss repeatedly. Grabbing the sound tablet beside him, he pushed in ling energy.</p><br/><p>“Fierce conflict has once again exploded at Bloody Sky Metropolis Jie……”</p><br/><p>The voice inside the sound tablet made Zuo Mo pause. The sound tablet was an essential part of his life. He would listen to the sound tablet each night to go to sleep. In this length of time, there was a clear increase in the news about the conflict at Bloody Sky Metropolis Jie.</p><br/><p>Was it the yaomo were discontent at being suppressed for so long and was starting to counterattack?</p><br/><p>He thought humorously, but he quickly threw the question to one side. No matter if it was Bloody Sky Metropolis Jie, or yaomo, it was one hundred thousand miles away from him, completely unrelated. He didn’t even think the yaomo would make a ripple. Three thousand years ago, the war between the xiuzhe and yaomo, it ended in a complete victory for the xiuzhe. If there wasn’t a Bloody Sky Metropolis Jie stopping the forward progress of the xiuzhe, it was very likely that the yaomo would have already been completely eradicated.</p><br/><p>Following that was some news on the Sword Test Conference. Zuo Mo wasn’t very interested.</p><br/><p>Suddenly, his head felt like it was cracking. Zuo Mo grunted as he hugged his head. His consciousness was wounded.</p><br/><p>The greatest pain in a life came when a beautiful woman dropped out of the sky, but at the same time, there also dropped a nasty dragon that guarded the beauty.</p><br/><p>Even more painful was just when they saw the peerless face of the beauty, they were kicked by the evil dragon at the weak spot.</p><br/><p>Zuo Mo wailed inside. Fixing his consciousness was his most important priority right now. However, to a low-level xiuzhe with only the cultivation of lianqi eighth level, fixing consciousness was a question that was far out of his power.</p><br/><p>Pain!</p><br/><p>It was like the deepest part of the brain was being lightly craved by someone using a small knife. Just a while and Zuo Mo was almost insane.</p><br/><p>Hugging his head as he sat on the roof, the painful groans continued.</p><br/><p>Zuo Mo wanted to cry. Holding his head, he almost crawled to move to the meditation mat in the seclusion room.</p><br/><p>His only hope right now was that mediation could decrease the pain. Very quickly, the cruel reality destroyed his last hope. No matter how he used the ling energy, the pain of his spirit didn’t lessen.</p><br/><p>His entire person seemed to have been chopped in two, but his body was well.</p><br/><p>He hugged his head, rolling and groaning on the floor. Gradually, the sound of wailing became lower.</p><br/><p>Those who are ignorant have no fear. He had only the most pitiful understanding of the spirit. If his cultivation was just a bit deeper, he would understand more and wouldn’t dare to be so impulsive. Fixing a consciousness, even those xiuzhe who had a cultivation of ningmai, didn’t have many solutions. Unless jindan cultivators lent a hand, fixing would be easier.</p><br/><p>But, if a jindan gave aid, that price definitely wasn’t a small one.</p><br/><p>Low-level xiuzhe didn’t dare to touch the spirit. Not even the Zen xiu who specialized in the consciousness, before the stage of jindan, they also wouldn’t dare.</p><br/><p>Zuo Mo was just a low-level xiuzhe who just achieve the eighth level of lianqi. His sea of consciousness suffered two continuous blows that far surpassed his ability to bear. The fact that he didn’t already die was a miracle.</p><br/><p>A wound to the consciousness, if there wasn’t an outside power to heal it, it wouldn’t disappear.</p><br/><p>The pitiful Zuo Mo curled completely into a ball. He didn’t have the strength to roll anymore. His breathing was shallow, his awareness fuzzy.</p><br/><p>Faintly, he seemed to hear someone was talking.</p><br/><p>“Thou wants to live?”</p><br/><p>A simple and desolate voice, upright and imposing.</p><br/><p>“Save me!” Zuo Mo heard his weak answer filled with joy and pleading.</p><br/><p>“To abide by my ceremony, to execute my desires, to give my oath, will thou?”</p><br/><p>“Too outrageous!” Zuo Mo, on his last breaths, couldn’t help but wail. He suddenly had the feeling he had been tricked.</p><br/><p>“Will thou?” the imposing voice was like thunder, filled with oppression.</p><br/><p>“Go to hell!” Zuo Mo unexpectedly raged: “Don’t assume that I don’t know it’s you that tricked……” He stilled wanted to curse, but the pain of his spirit was so extreme he couldn’t help but scream.</p><br/><p>“Will thou?”</p><br/><p>“Go to hell!” Zuo Mo swore as he screamed. At the same time, he raised his middle finger.</p><br/><p>……</p><br/><p>“Will thou?”</p><br/><p>“Go to hell!” Zuo Mo didn’t even have the energy to scream, much less raise the middle finger. He could only weakly whine.</p><br/><p>……</p><br/><p>“Will thou?”</p><br/><p>“Go to hell!” Zuo Mo’s answer was like the whine of a mosquito, the sound thin, like a hair strand.</p><br/><p>……</p><br/><p>“Will thou?”</p><br/><p>“Go to hell……”</p><br/><p>Zuo Mo’s awareness was a puddle of dizziness as he struggled.</p><br/><p>……</p><br/><p>That imposing and authoritative sound finally silenced. At this time, Zuo Mo’s awareness was completely muddled, everything in the surroundings indistinct.</p><br/><p>In his dizziness, he didn’t know if it was his delusion. That voice spoke again, no dignity left, only loneliness.</p><br/><p>“The ceremony lost, the desire dead, only the oath once taken……”</p><br/><p>The voice seemed further and further away from him. He became unconscious.</p><br/><p>In the sea of consciousness of Zuo Mo who was in a coma, that black dandelion seed that had been floating quietly landed.</p><br/><p>As it landed, it penetrated into the sea of consciousness, grew roots, germinated, bloomed, bore fruit. Countless black dandelion seeds continuously spilled, floating to every corner of Zuo Mo’s consciousness.</p><br/><p>In the blink of an eye, the sea of consciousness became a black sea. The black sea suddenly broke. Countless fragments floated up like black flowers, turning into countless wisps of black smoke.</p><br/><p>The black smoke transformed into a figure of a person.</p><br/>\n</div>"}