{"title": "Chapter Twenty Nine Sword Essence", "id": 79, "volume": 1, "url": "http://boxnovel.org/world-of-cultivation-chapter-twenty-nine-sword-essence", "volume_title": "Volume 1", "body": "<h1>Chapter Twenty Nine Sword Essence</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Twenty Nine Sword Essence</p><br/><p>“Has Shixiong heard of Wu Kong Sword Sect?”</p><br/><p>Two people were on the mountain, each riding on a green bull. The two green bulls were entirely dark green, their hair smooth, the horns on their foreheads pure black, their manner leisurely as they slowly travelled. It was extremely steady, the two people on their backs as though they were statues, not moving a sliver.</p><br/><p>“Haha, with such a ruckus made recently, it would be hard to not have heard.” The older man was called Shi Xiang, a disciple in Chi Sword Sect. The other was his shidi, Liang Luo. Chi Sword Sect was slightly famous in the region of Dong Fu. The two’s innate talents were exceptional. Even though they were limited by their age, but they had power and a reputation.</p><br/><p>“Ha, yeah, it’s all so unusual and mysterious, I don’t really believe it.” Liang Luo said as he shook his head.</p><br/><p>Shi Xiang glanced at his shidi, laughing inside. Everything about Shidi was good except that he was too proud. But he could understand. Shidi was ten complete years younger than him yet their cultivations were almost the same. If Shidi was in a big sect, he most likely would have limitless potential.</p><br/><p>“The sword energy that night, I saw as well. It really was an apparition.” He mused: “To be able to cause an apparition in the world, this person’s comprehension of the sword is astounding.”</p><br/><p>Liang Luo was unconvinced: “Pity we can’t encounter him and then have a good practice bout, wouldn’t that be a great thing? I have never heard of this Wu Kong Sword Sect before, I wonder what great luck they ran into.”</p><br/><p>Shi Xiang said with a mirthless smile: “Wu Kong Sword Sect was only low-key these past years. Four jindan masters at the back. In all of Dong Fu, it definitely is enough to enter the top ranks.”</p><br/><p>“Four jindan masters?” Liang Luo was dumbstruck and couldn’t believe it: “Shixiong, are you sure? Our sect only has three jindan masters? That Wu Kong Sword sect can have four?”</p><br/><p>“Yes.” The smile left Shi Xiang, his heart heavy. The division of power in Dong Fu’s surroundings had been at equilibrium a long time ago. Such a strong sect suddenly appearing, it would definitely affect this kind of equilibrium. Additionally, Wu Kong Sword Sect had been biding their time, people couldn’t help but think more.</p><br/><p>“In the four, the most powerful is Elder Xin Yan. If it wasn’t Elder Tian Song Ji that exposed his identity, who would have thought the honoured [Ice Dragon Sword] was in our Dong Fu. There’s now one more strong entity in Dong Fu.”</p><br/><p>Liang Luo couldn’t help ask: “This Ice Dragon Sword is well-known?”</p><br/><p>Shi Xiang smiled, replying: “I had never heard it before, but according to the elders, he has some notoriety. He became known in the yao hunt, his death kill is very high. In the past, there were countless yaomo that died under his sword.”</p><br/><p>Liang Luo inhaled sharply. To be able to survive yao hunt, then he was already not a simple character. And to gain a reputation in Yao Hunt, it definitely meant the other was a strong one. He knew this kind of common knowledge.</p><br/><p>Just at this time, the two suddenly raised their heads, looking forward.</p><br/><p>“Such strong sword essence!” Liang Luo’s expression changed and urged the green bull under him. The warm and slow green bull became a blur and then he disappeared.</p><br/><p>Shi Xiang was also slightly shocked. He hurriedly pushed the green bull and vanished.</p><br/><p>Zuo Mo felt the right hand that was wearing the golden sword ring was thirty thousand catties heavy. Raising one inch would use up all the energy in the body. All the ling energy inside was like a wild stallion off the ropes, uncontrollably and crazily flooding towards the golden sword ring on his right hand.</p><br/><p>His consciousness sunk into a strange kind of void and serenity. The dancing flames in his sea of consciousness froze, as though under a Body Paralysis Spell, frozen and quiet.</p><br/><p>In the sky of his consciousness, that star suddenly released a blinding light as it slowly revolved.</p><br/><p>Sitting on the gravestone, Pu raised his head. Looking at the shining star above his head, he laughed soundlessly.</p><br/><p>Zuo Mo had never felt his mind so clear. Everything seemed to be under his control. He just knew that he needed to quickly send out this sword energy, otherwise the sword energy was very likely that it would explode in his body and he would become a mess of blood and flesh. He also knew that on the other’s flying sword, with its uneven sword energy, he could find at least seven holes.</p><br/><p>Yes, he couldn’t find any other descriptor. “Holes”, this label, he felt it was just appropriate.</p><br/><p>It was much a wondrous feeling!</p><br/><p>He was drowning in enjoyment.</p><br/><p>Yet in the eyes of Xiao Guo and the others, at this time Shixiong seemed to be a sword exuding coldness! Every gaze that met his eyes felt their hearts shake. The usually warm and peaceful black pupils were entirely gray white, indifferent and empty, like a borderless tundra.</p><br/><p>Even Liang Luo and Shi Xiang who just managed to arrive were shocked. Liang Luo couldn’t control his exclamation: “Whoa!”</p><br/><p>Shi Xiang was a much steadier person and saw in more detail. But when he found the other just had a cultivation of lianqi eighth level, his expression couldn’t help change slightly.</p><br/><p>The flying sword, shrouded in a green light, turned into a stream of light and howled as it shot at Zuo Mo!</p><br/><p>Just at this time, Zuo Mo’s slow moving right hand finally pointed.</p><br/><p>Hiss!</p><br/><p>It was like a strange beast baring its teeth. The two noises made by the energies ripping through air were dissonant and entirely different.</p><br/><p>The temperature in the surroundings plummeted.</p><br/><p>A white frosted sword energy leapt from Zuo Mo’s fingertips!</p><br/><p>Ping!</p><br/><p>Two streams of light, one green, one white, furiously slammed together!</p><br/><p>There wasn’t the imagined explosion. The white sword energy that Zuo Mo released seemed like a patch of mist, hitting the other’s flying sword.</p><br/><p>The other’s flying sword froze, paralyzed in midair.</p><br/><p>That person’s expression changed drastically.</p><br/><p>Ding, the flying sword landed on the ground, unmoving like a dead fish.</p><br/><p>The weakness due to all the strength in the body being pulled out caused his consciousness to blank. That strange feeling was like the tide as it quickly retreated. But before that, he managed to make out his ice frost sword energy had accurately hit the flying sword in a spot near the back!</p><br/><p>That was the most serious “hole” that Zuo Mo had found before. He instinctively chose it as his target of attack.</p><br/><p>It was a pity that he hadn’t broken it!</p><br/><p>Zuo Mo was regretful but his mind swirled and he fainted on the ground.</p><br/><p>The female disciples behind him instantly screamed in fear.</p><br/><p>That disciple whose expression changed ran over to pick up his flying sword. When he saw the body was full of cracks, he instantly became angry and sad. When he looked at Zuo Mo on the ground, hatred rose up in his head. He couldn’t help roaring at his other fellow disciples: “You group of trash, what are you standing there for? Chop up this damned guy for me!”</p><br/><p>The other disciples murmured but didn’t dare to go up. Zuo Mo’s bravery just now had deeply shocked them. And they weren’t dumb. From the looks of it, this incident would get big. Jumping out at this time, wasn’t it seeking death? The sect elders were too lazy to care about the little incidents that occurred everyday, but if they really wounded someone else, and the other’s elders went to the mountain, then they wouldn’t be well.</p><br/><p>Seeing his friends not willing, the leader didn’t waste words. His face was twisted as he held up the flying sword and walked towards Zuo Mo!</p><br/><p>Xiao Guo sobbed as she leapt over Zuo Mo’s body. Her small apple face was full of fear but she still kept Shixiong behind her. The other female disciples saw the circumstances, exchanged a look and gritted their teeth as they stood up.</p><br/><p>“What do you want?”</p><br/><p>“In this daytime, you dare commit a crime?”</p><br/><p>“I’m telling you, I’ve endured you guys for a long time. Come on, chop me up! If we don’t find your elders this time to discuss everything, I’m telling you, I’m not a woman!”</p><br/><p>……</p><br/><p>It might have been they got into the swing of things but as one added a sentence here and another there, the vigor of the female disciples increased.</p><br/><p>Watching from far away, Liang Luo also found the clue. He said in shock: “He really just has lianqi eighth level in cultivation? How can he have such a pure sword essence?”</p><br/><p>“There are so many geniuses in this world.” Shi Xiang couldn’t resist sighing: “Just lianqi and having such pure sword essence, his potential is limitless! And it was originally a gold sword energy but it could transform into such an icy sword energy. Whose sect has such a disciple?”</p><br/><p>Liang Luo was still staring in disbelief at Zuo Mo lying on the ground.</p><br/><p>Even now, he still couldn’t believe a lianqi disciple could have such a pure sword essence!</p><br/><p>For a sword xiu, the most important and the hardest to practice was sword essence! In the beginning, what they learned was all kinds of sword scriptures. After enduring countless battles and training, they would gradually comprehend sword essence. Sword essence was unable to be described in language. It depended on each individual to comprehend. Sword xiu that comprehended a sword essence were the only kind of real sword cultivators. Even if they didn’t have a flying sword, they still were sharp and unstoppable.</p><br/><p>Sword scripture as a model, ling energy as the connection, but the true quintessence was sword essence!</p><br/><p>Both of them had a cultivation of ningmai, and had only just entered the doorway to sword essence. Suddenly seeing a lianqi disciple having such pure sword essence, how could they not be shocked?</p><br/><p>Holding the cracked flying sword, listening to the curses of Wu Kong Sword Sect’s female disciples, the person’s face turned black and then white, harshly yelling: “All of you, get out of my way!”</p><br/><p>“Ah!” The female disciples that had just been aggressive instantly screamed and scattered in fear.</p><br/><p>Only Xiao Guo remained as she cried and unwaveringly protected Zuo Mo.</p><br/><p>That person held the flying sword, a face full of viciousness as he shouted at Xiao Guo: “Get out of the way!”</p><br/><p>Xiao Guo whined as she protected Zuo M, furiously shaking her head.</p><br/><p>“You bitch!” The other was enraged. Lifting the sword, he made to slice, frightening Xiao Guo to close her eyes.</p><br/><p>Bang!</p><br/><p>Without a warning, the person suddenly seemed to have been hit by a large hammer. His entire body flew out five yards and didn’t move.</p><br/><p>“Committing a crime publically in broad daylight, which sect are you from?” A calm voice suddenly sounded from behind Xiao Guo.</p><br/><p>Two xiuzhe slowly came over, riding on green bulls. The one who spoke was Shi Xiang.</p><br/><p>With one move, Shi Xiang had intimidated everyone. Even the most idiotic person knew that the other’s power was several levels higher. Fear came onto everyone’s faces but no one spoke.</p><br/><p>“En?” Shi Xiang heavily humphed in dissatisfaction: “Didn’t you hear me speak?”</p><br/><p>At this time, a xiuzhe trembled as he came out. He gave a bow, responding: “We are the disciples from Dong Qi Sword Sect. Offending Elder, sorry, sorry!”</p><br/><p>Dong Qi Sword Sect. Shi Xiang and Liang Luo exchanged a look, and imperceptibly furrowed their brows.</p><br/><p>Shi Xiang sneered: “At what time Dong Qi Sword Sect was able to freely harass the female disciples of other sects? I should go ask Zuo Mei Tian, is this how he teaches the disciples?”</p><br/><p>The name Zuo Mei Tian instantly caused everyone’s expressions to change drastically, turning into terror.</p><br/><p>“Leave! If you do this again, don’t blame me for not being courteous!” Shi Xiang waved his sleeve and ordered for them to leave.</p><br/><p>The disciples of Dong Qi Sword Sect hurriedly took their shixiong and ran frantically as they left.</p><br/><p>Turning his face, Shi Xiang looked at the crowd of female disciples. In a warm voice, he said: “Don’t worry, this little brother is only suffering from exhaustion of ling energy, nothing major. Which sect are you from?”</p><br/>\n</div>"}