{"title": "Chapter Twenty Seven Looking Up in the Darkness", "id": 77, "volume": 1, "url": "http://boxnovel.org/world-of-cultivation-chapter-twenty-seven-looking-up-in-the-darkness", "volume_title": "Volume 1", "body": "<h1>Chapter Twenty Seven Looking Up in the Darkness</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>I got so enraged translating I wrote an essay examining my rage. But it’s full of spoilers so I can’t share why I’m angry about the story.</p><br/><p>Also, hello to everyone who followed me recently on this site.</p><br/><p>Chapter Twenty Seven Looking Up in the Darkness</p><br/><p>“Shixiong, is your body ill?” Xiao Guo had fought for a long time but couldn’t resist asking.</p><br/><p>“It’s nothing.” Zuo Mo’s voice was raspy as he replied and continued to walk forward.</p><br/><p>Xiao Guo looked worriedly at Zuo Mo, gathering her courage to state: “Shixiong, if you don’t feel well, we could change to another day.”</p><br/><p>“I said it’s fine so it’s fine!” Zuo Mo glared at Xiao Guo.</p><br/><p>Xiao Guo couldn’t help but shrink back. She muttered: “But, Shixjie said the body is the most important.”</p><br/><p>Zuo Mo decided to shut up himself and not argue with this little girl. He didn’t have the energy. Any one that would have been sliced over and over in half by the sword essence of a jindan definitely wouldn’t have the energy.</p><br/><p>Pu Yao was insane. Certifiably insane!</p><br/><p>Xin Yan Shishu’s sword essence far surpassed what he could endure. Each time that he faced the vast snow white sword essence, he felt that he was at death’s door. The terror that seemed to come from the deepest part of his heart made him tremble. The difference between the two of them was too large, so large it didn’t have meaning. Even this terror that seemed to happen right before death, Zuo Mo would only have a short instant to feel it before his consciousness would be easily cut in half. His only outcome was fainting.</p><br/><p>But he would quickly wake up because of pain! The enormous pain due to his wounded spirit would wake him up.</p><br/><p>The only thing he could do was grit his teeth and practise [Embryonic Breathing Spiritual Cultivation]. Only that thing could heal his spirit and lessen the pain.</p><br/><p>Before he could take a breath, another sword essence would drop down from heaven and he would faint again.</p><br/><p>Just like that. Slice, faint, wake up due to the pain……continuously repeating. In one day, he would faint a few dozen times. One could imagine, how could his state be good?</p><br/><p>If he had the time, he would be suspicious of himself of being able to endure to that day. However, Pu Yao wouldn’t even give that amount of time to him. Later on, the pain turned to numbness.</p><br/><p>Only when Xiao Guo came to find him did Pu Yao temporarily let him go.</p><br/><p>Xiao Guo came to find him to take a look at the ling grasses. After the weed incident, all the girls on the Eastern Peak were scared. Li Ying Feng became an inner sect disciple, entering Yan Le’s doors. Other than cultivating, she had to follow her Master to learn how to take care of the sect’s assets and had no time to come to the Eastern Peak. But they girls still remembered zombie Shixiong Zuo Mo, and before Li Ying Feng left, she had especially given notice with him in hopes he could help these female disciples.</p><br/><p>After a certain amount of time, they would always pull Zuo Mo over to inspect the ling grass.</p><br/><p>There weren’t any big problems with the ling grass, other than some problems that would occur due to improper care. For Zuo Mo, who planted ling grains, these were all simple problems. Most of the attention of the female disciples was on the ling beasts. Planting ling grass was only to provide food for the ling beast so they did not put much attention and care into the grass.</p><br/><p>Looking at the ling fields being wasted, Zuo Mo felt pain. If all of these ling fields were planted with ling grains, think how much jingshi there would be.</p><br/><p>“Shixiong, these little things aren’t worth much but are a token of our thanks. Please accept them.”</p><br/><p>A female disciple handed over the gifts that they had prepared beforehand.</p><br/><p>He understood the intentions of these female disciples. No matter where, female disciples were always more vulnerable, especially the kind of outer sect female disciples. Li Ying Feng had left, and had no time to spare to look after them. They needed someone with the power to protect them. It wasn’t surprising. Most of the female disciple’s cultivations were around level five or six of lianqi and no one was able to pick up the burden.</p><br/><p>Zuo Mo thought for a second but accepted the gifts. Even if this matter was slightly troublesome, but if they really encountered something serious, he believed that Li Ying Feng definitely would get involved.</p><br/><p>Seeing Zuo Mo take the gift, the crowd of female disciples gave relieved expressions.</p><br/><p>Everyone had a hard time surviving, Zuo Mo thought silently.</p><br/><p>Returning home, he opened the gift box. Inside were all kinds of ling worms and ling beasts. Similar to mud turning earthworms, they would even enter a grade. A large majority were first grade, and there were only one or two at the second grade. But it could be seen that they had taken some care with the ling worms and animals. Even if the grade wasn’t high, but they were all quite useful.</p><br/><p>Pu Yao suddenly erupted, crouching in front of the ling worms and beasts: “Talking of playing with worms, tsk tsk, us yaomo is the true masters in this area.”</p><br/><p>He randomly flipped through the ling worms, extremely disappointed: “All of these are low level, not worth much.”</p><br/><p>Zuo Mo was extremely speechless but couldn’t resist objecting: “They are outer sect disciples, where would they get high level ones?”</p><br/><p>Pu Yao nipped one up and examined it for a long while. Then he carelessly threw it in front of Zuo Mo: “Here, this one is barely acceptable. Throw out all the others.”</p><br/><p>The one Pu Yao picked was a black armored worm, slightly larger than a fingernail. He flipped through the jade stick that they had also given to find out that this black armored worm was called Black Gold Worm, fond of eating gold metal. Its wings could be sold for a pretty good price. Other than that, supposedly it could also be used to find sources of water.</p><br/><p>Zuo Mo was slightly disappointed. To him, the black gold worm didn’t have much use.</p><br/><p>Pu Yao’s interests clearly had been evoked by these worms. He excitedly said: “Playing with worms, there’s a lot to attend to. Especially the techniques, they vary by person. Before, I saw one highly skilled with worms, called Blood Mosquito daoren. This guy was very strong. Somehow, he managed to create countless souls, and bound them to a group of blood mosquitoes. And then he travelled through a hundred jie. Every time he reached a jie, he would leave behind a few blood mosquitoes. His enemies had a whole bunch of people and pursued him countless times but still couldn’t kill him.”</p><br/><p>“I played with black gold worms before too, but it isn’t this kind of cheap trash. There isn’t much use in the level ones, this thing’s true purpose is to use it to seek out ling veins……”</p><br/><p>“Ling veins?” Zuo Mo asked suspiciously: “Isn’t it used to seek out water?”</p><br/><p>“Water?” Pu Yao sneered, retorting: “If you don’t know, then don’t pretend. That’s for low level black gold worms. Black gold worms above fourth grade can seek out ling veins, seventh grade is able to find ling sources. Ha, but ninth grade is the truly good stuff. As to tenth grade, I’ve never seen one.”</p><br/><p>He continued to explain: “Picking ling worms, definitely have to pick those with good aptitudes. Like this black gold worm of yours, if you raise it correctly, it can enter fourth grade. These other ones, it doesn’t even have the chance to increase to third grade.”</p><br/><p>“Then, um, how can this black gold worm raise to grade four?” Zuo Mo consulted with a fawning tone.</p><br/><p>Fourth grade black gold worms could find ling veins……this was endlessly tempting to Zuo Mo.</p><br/><p>This time, Pu Yao didn’t make it difficult for him. He briskly said: “Very simple. Don’t you have a small section of ling vein in your seclusion room? Put this black gold worm and a piece of pure gold ore in a jade box and bury it in the area surrounding the ling vein. After a month, it should increase to the third level. To get it to the fourth level, it probably would take about three months.”</p><br/><p>“Alright, let us continue.” Pu Yao waved his hand and said impatiently.</p><br/><p>Before his words landed, a snow white sword essence once again cleaved Zuo Mo’s mind in half. Zuo Mo, who had been memorizing what Pu Yao just said instantly fainted.</p><br/><p>After an unknown amount of time, sharp pain once again woke Zuo Mo up. Zuo Mo’s first thought was, did he remember the method of raising the black gold worm to the fourth grade?</p><br/><p>Great, he remembered!</p><br/><p>So painful! He couldn’t help but start to wail, rolling on the ground.</p><br/><p>Why did it become painful?</p><br/><p>The tearing pain tortured his fragile nerves. He could only start [Embryonic Breathing Spiritual Cultivation]. A ball of air moved continuously through his body, giving out cold stands, seeming to inhale through all the openings in his body and then spreading through the body.</p><br/><p>The flames waved in his sea of consciousness. That dim star in the void seemed to have become much brighter, the enchanting sea of flames could not take away its light.</p><br/><p>Fainting, waking with pain, fainting again, waking up with pain again……</p><br/><p>The amount of time that Zuo Mo had to comprehend was extremely short. After repeating for a few hundred times, he still endured.</p><br/><p>“Pain is the tastiest thing in this world. You have to finely savor it, enjoy it, the flavour fresh and sweet as it permeates your marrow. Even your soul is trembling!” Pu Yao stuck out his bright red tongue, licking his lips and slowly said: “Death is like a firework. You can continuously experience the process of blossoming. How lucky you are!</p><br/><p>Damned renyao!</p><br/><p>Zuo Mo recited in his mouth. However, his eyes were opened to the widest, unwaveringly staring at that lightning fast snow white sword essence!</p><br/><p>He knew that the kind of pain that was coming. Just like Pu Yao had said, his soul was trembling. Regardless of how many times he had been cut, but whenever he practised facing that snow white sword essence, he was still terrified, incomparably terrified. When he was clear headed, he didn’t dare to even think about it. He was afraid that any memory would make his fragile psychological barrier instantly collapse.</p><br/><p>His trembling bones and flesh was like a blade of grass that was going to break any second in the storm. Maybe the next second, he would fall down.</p><br/><p>But his eyes still firmly stared at the front!</p><br/><p>The direction that the snowy white sword essence would appear from.</p><br/><p>But Xin Yan shishu’s sword essence, was it something he could see clearly?</p><br/><p>The difference between the two was like the sky and earth. Xin Yan Shishu was a tried and tested jindan, a sword xiu that even Tian Song Zi admired. And Zuo Mo was only an outer sect disciple with a cultivation of lianqi eighth level; the total amount of time that Xin Yan shishu had spent in the flying sword was over two hundred years, and Zuo Mo hadn’t even learned the most basic sword arts.</p><br/><p>On the surface, all of this looked futile.</p><br/><p>However, he still trembled as he stared fixedly at the front, his mouth unconsciously cursing “Damned renyao damned renyao.”</p><br/><p>Snow white, blindingly bright, flying down from the sky like the Milky Way!</p><br/><p>Zuo Mo tried his best to widen his eyes. At this moment, his body stopped trembling, the mutters from his mouth gone. The entire world was a patch of snow white. He needed to strenuously search in this sea of snow white, search for the quintessence of this sword essence.</p><br/><p>The time that was given to him was extremely short, not even the blink of an eye.</p><br/><p>He was like a crazy gambler, betting on that chance that wasn’t even one in ten thousand.</p><br/><p>However, he didn’t have a choice. He didn’t have another road.</p><br/><p>His pupils suddenly dilated and it didn’t have the time to recover.</p><br/><p>Whoosh, the snowy white sword essence sliced Zuo Mo in two.</p><br/><p>After an unknown period of time, it was still the sharp pain that woke Zuo Mo up. Opening his eyes, Zuo Mo wanted to roar with laughter, but when it came up, it became groans and wails.</p><br/><p>“Ah! So painful!” “Ah!”</p><br/><p>Fighting to climb up, he resisted the great pain and started [Embryonic Breathing Spiritual Cultivation].</p><br/><p>Strands of coolness entered his body. The pain instantly lessened greatly.</p><br/><p>When he opened his eyes again, they were full of ecstasy!</p><br/>\n</div>"}