{"title": "Chapter Thirty Seven – Two Blows!", "id": 87, "volume": 1, "url": "http://boxnovel.org/world-of-cultivation-chapter-thirty-seven-%E2%80%93-two-blows", "volume_title": "Volume 1", "body": "<h1>Chapter Thirty Seven – Two Blows!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Warlord212 is back and has edited this chapter. No cliffhanger this chapter since it was a really short fight. You can really see Zuo Mo’s mentality in action here.</p><br/><p>Chapter Thirty Seven – Two Blows!</p><br/><p>The two xiuzhe from Dong Qi Sword Sect clearly hadn’t thought that Zuo Mo dared to move first!</p><br/><p>Especially the one that had moved first. In his perspective, if two ningmai hadn’t suddenly appeared in that previous encounter, Zuo Mo would have been easily dealt with. This lianqi trash, he dared to actively provoke the two?</p><br/><p>The sword energy almost reached the Dong Qi disciple’s forehead, the faint cold energy made him abruptly wake up. He instinctively pushed out his flying sword but suddenly remembered that his flying sword had been ruined by this guy in front of him! He didn’t manage to dodge in time and got brushed by the faint mist surrounding the sword energy.</p><br/><p>Hiss!</p><br/><p>A bloody wound the width of a finger appeared on his forehead. The Dong Qi disciple managed to steady himself, his eyes full of hatred as he stared viciously at Zuo Mo, wanting to cut Zuo Mo to pieces.</p><br/><p>This damned guy in front of him. He was clearly only in the stage of lianqi but every time they met, he himself would become extremely sorry. Reaching up to touch the wound on his forehead, he saw the blood on his finger. His viciousness rose and he roared angrily: “You want death! If I don’t kill you today……”</p><br/><p>Taking advantage of the time he took to speak, Zuo Mo sent out another blow!</p><br/><p>The thin sword energy contained a faint mist as it headed for the other’s open mouth. This sword energy was even stronger than the one before, the white mist shrouding it even thicker. If one listened carefully, they could almost hear a stream of tinkling as the icicles crashed.</p><br/><p>The pupils of the Dong Qi disciple that had been spectating from the side suddenly shrunk.</p><br/><p>Zuo Mo had been clever in his timing to send out the sword energy, the speed even faster than before. The other’s flying sword had been ruined by Zuo Mo. He had actually come today with his shixiong to help him pick a new flying sword. He hadn’t thought he would meet his enemy. When he detected the sword energy, he suddenly realized that it wasn’t just his flying sword that had been ruined, but he didn’t have any other defensive talisman on his body.</p><br/><p>Usually, he amused himself by bullying others and neglected his cultivation. Seeing the sword energy coming near, in his panic, he completely didn’t know what to do.</p><br/><p>“Pah!”</p><br/><p>The misty sword energy accurately landed on the other’s mouth. The blood instantly flew, two teeth landing on the ground. This string of attacks completely stupefied him. He covered his mouth, looking in disbelief at the two teeth on the ground.</p><br/><p>Zuo Mo kept his guard up. Compared to the excitement of the battle last time, he was extremely calm this time.</p><br/><p>The only thing he could rely on was the gold sword ring. But the gold sword ring could only store three sword energies. Zuo Mo only had the last sword energy remaining. It was his last and only attack. If the other was only one person, he would unhesitatingly add it on. But he was very clear that the two people’s strength were above him yet he could not just stand by and see Fu Jin be humiliated because of him.</p><br/><p>The worst case would be getting beaten up viciously. He already prepared to endure it. He wouldn’t release this last sword energy easily. He wanted to make it a vicious one!</p><br/><p>They won’t end well!</p><br/><p>Zuo Mo thought viciously.</p><br/><p>“Ah!” The other gave a shocking howl, his features twisted and his eyes sprouting fire: “I……”</p><br/><p>The voice once again stopped abruptly.</p><br/><p>It seemed that an invisible hand was chocking his neck. His entire body slowly rose, leaving the ground. Compared to roaring a second ago, he was now like a fish out of the water, eyes bulging, speaking but unable to make any noise.</p><br/><p>Zuo Mo was astounded, his eyes couldn’t help looking towards the side.</p><br/><p>A young person dressed in white slowly moved in their direction. He didn’t even look at the Dong Qi disciple hanging in the air: “Dong Fu does not allow fighting, don’t you all know?”</p><br/><p>The other Dong Qi disciple furrowed his btows. He suddenly raised a hand. A sword energy shot out of his fingertip, stopped and twisted, like drawing a plum branch. The disciple that had been fighting with Zuo Mo landed with a plop, face deep purple and unconscious.</p><br/><p>“Sir, you are too biased. Both sides were fighting yet you only blame one person. It isn’t fair.”</p><br/><p>The white-clad youth stared at the other: “Dong Qi Zong Ming Yan?”</p><br/><p>“A little humble name. Didn’t think that Sir would have heard it. Honored, honoured.” Zong Ming Yan raised his hands in a greeting, his expression still cold.</p><br/><p>“Elder Zuo Mei Tian’s disciple, it naturally rings in my ears.” The white-clad youth said noncommittally.</p><br/><p>Zong Ming Yan raised an eyebrow: “Sir is?”</p><br/><p>“Yu Bai.” The white-clade young person gave two characters.</p><br/><p>“Oh.” Zong Ming Yan responded faintly but his voice then turned sharp: “So it is the honoured disciple of Elder Tian Song Zi. However, can Brother Yu tell me, why only punish my sect’s disciples? Does Brother Yu discriminate against my Dong Qi disciples?”</p><br/><p>Yu Bai smiled. He pointed with a finger at the jade medal at Zuo Mo’s waist.</p><br/><p>Only now did Zong Ming Yan notice the spring sprout jade stick at Zuo Mo’s waist. He blanked for a second before nodding his head,: “Ling plant farmer, I understand.”</p><br/><p>Giving a deep look to Zuo Mo, he turned to leave.</p><br/><p>Yu Bai imperceptibly furrowed his brow: “Is Sir not taking your shidi with you?”</p><br/><p>Zong Ming Yan didn’t even turn his head, heading forward, leaving behind a sentence.</p><br/><p>“A piece of trash that can’t even win over a lianqi ling plant farmer, what’s the use?”</p><br/><p>Yu Bai shook his head and didn’t speak. He casually sent out a stream of white light that entered the sky.</p><br/><p>Flying sword messages!</p><br/><p>Compared to little thousand cranes, flying sword messages were much faster! As expected, in a short while, two xiuzhe flew over and landed, bowing to Yu Bai.</p><br/><p>Yu Bai pointed to the unconscious Dong Qi disciple on the ground, stating: “This person broke the prohibitions of Dong Fu, and is now exiled from Dong Fu.”</p><br/><p>“Yes.” The two bowed to Yu Bai and lifted the person with them as they flew away.</p><br/><p>“If I didn’t see it wrong, you are the disciple of Wu Kong Sword Sect’s Elder Xin Yan.” Yu Bai turned his face and said warmly to Zuo Mo.</p><br/><p>Zuo Mo shook his head: “My master is Shi Feng Rong.”</p><br/><p>The time that the other two had fought had been very short but no matter if it was ling energy or the manipulation of spells, they were hundreds of times better than Zuo Mo. And both of them had vast and intimidating presences. Zong Ming Yan was cold and sharp, Yu Bai confident and carefree. They were all outstanding. However, Zuo Mo didn’t feel very comfortable. No matter if it was Zong Ming Yan or Yu Bai, their bodies would unconsciously give an aura of being high up. Zuo Mo disliked the aura very much. Unconsciously, he didn’t want to have deeper relations with Yu Bai.</p><br/><p>“Elder Shi Feng Rong?” Yu Bai was slightly surprised at this answer. When the two had started to fight, he had already noticed. He hadn’t detected anything in the first sword energy but had been shocked that a ling plant farmer could send out a sword energy. When he noticed the gold sword ring on Zuo Mo’s hand did he understand.</p><br/><p>At that time, he had prepared to wade in. Tian Yue Jie was a classical minor jie primarily composed of sword cultivators. Xiuzhe like ling plant famers were a very rare resource. Not just Dong Fu, but in almost all the primary towns of Tian Yue Jie, there were prohibitions that protected production cultivators like ling plant farmers.</p><br/><p>But just at that moment, Zuo Mo sent out the second sword energy.</p><br/><p>Yu Bai’s eyes were very skilled and saw it clearly.</p><br/><p>The first sword energy only had a little sword energy, not enough to be of significance. But the sword essence in the second sword energy was very similar to Wu Kong Sword Sect’s [Ice Dragon Sword] Xin Yan’s sword essence.</p><br/><p>Wu Kong Sword Sect’s sudden rise had attracted everyone’s eyes. And as the true ruler of Dong Fu, Tian Song Zi naturally would pay more attention. Yu Bai was the core disciple of Tian Song Zi and he knew much more about Wu Kong Sword Sect than normal people.</p><br/><p>The apparition when Wei Sheng entered zhuji had alerted Tian Song Zi. That night, Yu Bai had accompanied his master to investigate. He had personally seen with his own eyes that sword energy that rose into the heavens at Wei Sheng’s zhuji and had never been so shocked. And the scene when Xin Yan’s sword had turned into a dragon made his mouth wide and unable to forget.</p><br/><p>His talents were exceptional and the scope of his eyes far surpassed others in his generation. In the area around Dong Fu, the people who could rank with him could be counted on the fingers. But in one night, two successive blows, it created a great interest in him to the low key sect of Wu Kong Sword Sect.</p><br/><p>He couldn’t help closely examining Zuo Mo.</p><br/><p>From the beginning, the expression on Zuo Mo’s face had never changed. Yu Bai didn’t mind that. He had met countless unique individuals. Those that had strength always had some unique qualities. What made him shocked was Zuo Mo’s age and cultivation. It wasn’t high, but low.</p><br/><p>It was very hard to estimate the age of cultivators but a general decision could be made from the eyes, the manner of speech and conduct. The age of the Wu Kong Sword Sect disciple definitely wasn’t high. Such an age, it was common to see a cultivation of lianqi.</p><br/><p>So young, such low cultivation, yet he could comprehend sword essence. This made Yu Bai very surprised.</p><br/><p>The sword essence carried in the second sword energy had been in a fledgling stage. The white mist surrounding the sword energy easily confused others. That wasn’t mist that was caused by the coldness of the sword energy. In reality, it was composed of large numbers of even smaller sword essences. These scattered sword essences were far from complete like Xin Yan’s sword essence but this lianqi disciple was able to control them in a certain range.</p><br/><p>That wasn’t easy to do!</p><br/><p>Yu Bai almost couldn’t believe it. He always had been confident in his own talents, but seeing this zombie-like disciple, he felt that he didn’t know what to say. When he first comprehended sword essence, he had been in the middle stages of zhuji. He had sat quietly in his master’s sword stove for more than thirty days before he had some understandings.</p><br/><p>Even more, the jade medal of a ling plant farmer wasn’t easy to get!</p><br/><p>Yu Bai had grown up in Dong Fu and knew very well of the difficulty.</p><br/><p>Another strong entity had come out of Wu Kong Sword Sect! Even if his cultivation right now wasn’t high, but his future was limitless.</p><br/><p>Wu Kong Sword Sect, already mysterious in Yu Bai’s mind, became even more mysterious.</p><br/><p>“Give my greetings to Elder Shi Feng Rong.” Yu Bai warmly gave a bow. Noticing the alertness in Zuo Mo’s eyes, he was a proud person, and his desire to form a relationship instantly faded: “Dong Fu might protect ling plant farmers, but you have to be careful and not have bad relationships with others.”</p><br/><p>Finishing, he raised his hands and floated away.</p><br/><p>Zuo Mo’s heart instantly landed back. He had already prepared to be injured and hadn’t thought he would be safe. Even he found it wondrous.</p><br/><p>Fu Jin wasn’t seriously harmed and firmly refused the jingshi that Zuo Mo handed over. This crisis changed the relationship between the two. Zuo Mo didn’t like Yu Bai but was very happy to interact with Fu Jin.</p><br/><p>Everyone was little people!</p><br/><p>Fu Jin was the local snakehead here. He was clear to what each place was selling. In two hours, he managed to help Zuo Mo buy everything he needed.</p><br/><p>It was a giant bag of a variety of seeds of ling herbs and grasses. Thirty pieces of jingshi were completely spent by Zuo Mo.</p><br/><p>Taking the things he brought, he bid farewell to Fu Jin and sat on the grey beaked goose straight back to Wu Kong Mountain.</p><br/><p>He had decided that he definitely wouldn’t leave the mountain before he entered zhuji. He was still scared about what happened today. He and Dong Qi Sword Sect were now at odds. If he encounted Dong Qi disciples again, it wouldn’t end well for him. To have such good luck as today every time, that was a dream.</p><br/><p>Dong Fu wasn’t some safe place!</p><br/>\n</div>"}