{"title": "Chapter One Hundred and Fifty Six Brothers in Difficulty", "id": 106, "volume": 2, "url": "http://boxnovel.org/world-of-cultivation-chapter-one-hundred-and-fifty-six-brothers-in-difficulty", "volume_title": "Volume 2", "body": "<h1>Chapter One Hundred and Fifty Six Brothers in Difficulty</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter One Hundred and Fifty Six Brothers in Difficulty</p><br/><p>“Don’t forget .. …”</p><br/><p>“Even in death, you must not forget … …”</p><br/><p>… …</p><br/><p>Zuo Mo woke up and slowly opened his eyes. The first thing he noticed was the pain! It was like the bones in his body had been rattled. Just the slightest of movements had caused bone-aching pain. He instantly became docile and motionless.</p><br/><p>The familiar fragrance of medicine entered his nose. He instantly realized where this was.</p><br/><p>Oh, his life was really bad. It seemed every time he attended a fight, he would enter the Fragrant Ginger Yard. It looked like he was quite heavily wounded this time.</p><br/><p>“Cough, Shidi, you’re awake.”</p><br/><p>Suddenly, a familiar voice came from his right.</p><br/><p>Eldest Shixiong? Zuo Mo instinctively turned his neck to look right. Just as he moved, he couldn’t help but inhale sharply. So painful!</p><br/><p>He moved his head with great difficulty. When he saw Eldest Shixiong on a bed not far away at his right, he was instantly shocked.</p><br/><p>Lying on the bed where Eldest Shixiong voice came from was a person whose body was entirely bound in bandages with only his eyes left uncovered.</p><br/><p>“Eldest Shixiong, is it you?” Zuo Mo asked with uncertainty. This person who was wrapped up like a mummy, was he really the courageous and invincible Eldest Shixiong?</p><br/><p>“En.” The person under the bandages responded. It really was him. He said, “You’ve been unconscious the longest. We were all very worried about you.”</p><br/><p>“Eldest Shixiong, who wounded you like this?” Zuo Mo asked in disbelief.</p><br/><p>“Ha ha, I fought with Gu Rong Ping, he did this.” Wei Sheng’s tone was relaxed.</p><br/><p>Zuo Mo still didn’t quite believe it. “That little white face shouldn’t be this strong!”</p><br/><p>“He isn’t much better off.” Wei Sheng smiled. “In the end, I managed to slice him twelve times in succession.”</p><br/><p>Hearing this, Zuo Mo sweated. Sliced twelve times … … even if that little white face was a big carrot, he would have been sliced into a toothpick. However, he felt that this was expected. In the same generation, how could there be anyone who could overpower Eldest Shixiong to the point he could not retaliate?</p><br/><p>seeing Eldest Shixiong worse off than he was, his mood which had been down due to his injuries instantly became much better. He felt this way even though Wei Sheng was Zuo Mo’s respected and loved Eldest Shixiong.</p><br/><p>Brothers in difficulty … …</p><br/><p>Suddenly, Wei Sheng suddenly shouted in Zuo Mo’s direction, “Luo Shidi, are you better today?”</p><br/><p>Zuo Mo unconsciously turned his face to the left.</p><br/><p>There was a bed on his left. Luo Li was lying on top. Even though it wasn’t as severe as Eldest Shixiong, but his expression was withered, his complexion pale. It was easy to see he was seriously injured.</p><br/><p>So there wasn’t just one brother in difficulty … … Zuo Mo was struck.</p><br/><p>When Luo Li looked at Zuo Mo, his expression was slightly unnatural. Zuo Mo immediately remembered that the person who had wounded Luo Li had been himself. That wondrous state had disappeared, but Zuo Mo clearly remembered what had happened during that time.</p><br/><p>If Zuo Mo’s face could move, his expression right now would certainly be extremely unnatural.</p><br/><p>Due to the fact he had been in a strange state, he had performed beyond his abilities. Even if he was completely healed and set up the seventy-two child formation Skyring Moon Chime Formation again, he might not be able to successfully perform [Moon Chime Sound Storm] successfully one in ten times.</p><br/><p>“Is Shixiong better? Luo Li avoided Zuo Mo’s eyes and asked Wei Sheng. His mentality was much better than before. Even though Wei Sheng had once been his sword servant, but right now, he was Wu Kong Sword Sect’s Eldest Shixiong.</p><br/><p>Greater power meant a greater status, the rules of the sect had always been so.</p><br/><p>Now, no one in Wu Kong Sword Sect would doubt Wei Sheng Shixiong’s strength. Facing Zuo Mo, Luo Li still had some desire to compete, but facing Wei Sheng he had completely submitted.</p><br/><p>“Much better.” Wei Sheng’ tone was nothing like that of a seriously wounded patient, extremely optimistic. “After a bit of time, I’ll probably heal.”</p><br/><p>The three of them were all severely wounded, unable to move as they laid on the bed.</p><br/><p>At the beginning there was a slight barrier between Zuo Mo and Luo Li, but now that they were in the same predicament, their relations gradually improved. After a while, they conversed freely. Before, Zuo Mo hadn’t liked Luo Li. Upon further acquaintance, he found that Luo Li was not as bad as he had imagined. Quite the opposite, in fact. Even though he would unconsciously reveal the pride ingrained in his bones, his personality was straightforward and he was a forthright person.</p><br/><p>The two of them had fought two times. Both times, each of them had been seriously wounded. To a certain degree, their relationship was forged in fighting.</p><br/><p>The two of them were also full of admiration towards each other’s strength.</p><br/><p>Nothing needed to be said of Luo Li to Zuo Mo. Right now, Zuo Mo had become one of the hottest people in Dong Fu. At the end, he had fought one on five, and it had turned into a legend in Dong Fu. No one had saw the one-on-five fight, but everyone had clearly seen the terrifyingly gigantic hole in the Great Pine Pavilion.</p><br/><p>Zuo Mo knew how much his strength was really worth. Each time Eldest Shixiong and Luo Li mentioned this matter, his heart was extremely insecure. In his perspective, Luo Li’s strength was much stronger than his.</p><br/><p>Suddenly remembering this matter, Zuo Mo couldn’t help but ask in curiosity, “Shixiong, that day, I seemed to see a woman in front of you, who was that?”</p><br/><p>Luo Li was instantly slightly embarrassed. He muttered, “That’s my sword spirit.”</p><br/><p>“So Shidi is walking the road of spirit manifestation.” Wei Sheng instantly realized. Seeing Zuo Mo not understanding, and then remembering this guy did not study what he should be, he painstakingly explained. “There are many ways to cultivate the sword, many of them strange. Sword spirit is one of these. It means to nurture the sword essence to made it into a spirit. However…”</p><br/><p>He couldn’t help but glance at Luo Li several times. “I really didn’t see that Luo Shixiong’s emotions are pretty sensitive.” Seeing Zuo Mo still not understanding, he said with a smile, “People that cultivate a sword spirit mostly have sensitive feelings. This way of the sword uses emotion to enter this path of the sword. When the sword spirit is forming, it needs to use emotion as the guide for the sword spirit to take form.”</p><br/><p>Zuo Mo finally understood. Luo Li instantly blushed red.</p><br/><p>“Our sect is a sword sect. Shidi must not slack off on the sword scriptures.” Wei Sheng said to Zuo Mo.</p><br/><p>“Uh-huh, uh-huh.” Zuo Mo unconcernedly responded. He suddenly thought about the Kun Lun jade scroll, and couldn’t help but ask, “This Sword Test Conference, has the rankings come out? Who entered the top ten?”</p><br/><p>Wei Sheng shook his head. “Wounded like this, how can we know the situation outside?”</p><br/><p>Zuo Mo turned towards Luo Li. Luo Li also shook his head.</p><br/><p>Zuo Mo could only say, “I’ll ask when Xiao Guo and the others come next time.” These past few days, it had been Xiao Guo, Li Ying Feng and the others who had been looking after the three of them. The sect elders were not seen.</p><br/><p>The three of them didn’t know the ranking for the Sword Test Conference had become a great problem.</p><br/><p>Zuo Mo’s last move had disrupted the competition. Tian Song Zi saw that the Great Pine Pavilion had been damaged to a such a degree had instantly stopped the competition. No competitor had opposed the decision. Having seen the terrifying collision with their own eyes, they didn’t have any more interest in competing.</p><br/><p>Many of the xiuzhe that rushed to the explosion had been left shocked, dazed, and withered. What was even more unexpected was that the time those people spent with a low mood was much longer than others had imagined. Their elders started to become worried.</p><br/><p>From this, it could be seen just how much of a blow that world-shattering collision had given them!</p><br/><p>For Tian Song Zi who was hosting the Sword Test Conference, there were more things that caused a headache for him. He could slowly fix the damage in the Great Pine Pavilion but he must immediately solve the problem of the Sword Test Conference’s ranking.</p><br/><p>This was an extremely troublesome problem!</p><br/><p>Because the competition had been stopped in the middle, the number of people in the Great Pine Pavilion was far more than ten. These competitors were also all people of some strength. Wei Sheng and Gu Rong Ping had both been wounded and became unconscious. The other spectacular competitor, Zuo Mo, also was seriously wounded and unconscious.</p><br/><p>It was not easy to rank the first ten.</p><br/><p>The reason that the four of Pei Yuan Ran and the others were absent was due to this matter.</p><br/><p>Who could imagine a group of jindan experts in a room shouting furiously like a group of children. Some slammed the table, others sword, some bounced back and forth. It was very boisterous.</p><br/><p>After Pei Yuan Ran and the others left Dong Fu Hall, even if they were of astounding cultivation, there was tiredness on their faces.</p><br/><p>———</p><br/><p>Su was lying on the bed. Even now, there was a layer of black gauze over her face.</p><br/><p>“Do you feel better today?” Lin Qian asked attentively.</p><br/><p>Su nodded and didn’t speak.</p><br/><p>Lin Qian’s expression was full of self-blame. He took out a jade bottle and said gently, “I didn’t think you would be wounded this time. It is my fault. This Youth Dan will be very beneficial for you. Consume it quickly.”</p><br/><p>Su’s body gently shook.</p><br/><p>Her gaze stared at the jade bottle in Lin Qian’s hand.</p><br/><p>She had heard of the name Youth Dan. It was an extremely rare and expensive lingdan, especially suited for female xiu to consume. It had great benefits for cultivation. Using it to heal, she felt it was a great waste.</p><br/><p>“Who really are you?” Su’s gaze moved from the jade bottle to Lin Qian as she asked coldly.</p><br/><p>She had heard the name of the Youth Dan but she was also very clear about its rarity. Heart Lake Sword Sect might be the top tier sect in Sky Moon Jie, but such a high grade lingdan such as Youth Dan wasn’t something they could possess.</p><br/><p>She had always assumed that Lin Qian was a disciple of one of the elders, but when he took out the Youth Dan, she suddenly realized that Lin Qian definitely couldn’t be a disciple of her sect.</p><br/><p>Then the other question was, where did the sect token in Lin Qian’s hand come from?</p><br/><p>What goal did he have?</p><br/><p>Su’s gaze was like an arrow. Lin Qian laughed lightly, his expression normal. He gently put the Youth Dan in front of Su. “I am not Shimei’s enemy.”</p><br/><p>He then asked, “The matter I asked last time, does Shimei have the result?”</p><br/><p>Seeing the calmness on Lin Qian’s face, Su hesitated and shook her head, saying, “It’s not him.”</p><br/><p>Lin Qian did not seem surprised at this result. He nodded. “Many thanks, Shimei. Shimei, please relax and rest. As to forging your sword, you can give it to this one. I will not disappoint Shimei.”</p><br/><p>Finishing, he left.</p><br/><p>Su looked at the figure that disappeared outside the door and felt this person was even more mysterious.</p><br/><p>———</p><br/><p>In a distant mountain valley of Ling Ying Sect, there were two people speaking. It was Chang Heng and the yellow-faced man. The expressions of the two seemed untouched, but their complexion and alertness was much worse than before the competition.</p><br/><p>The two of them had not escaped unscathed. They had been wounded to various degrees.</p><br/><p>“This is what you need.” The yellow-faced man handed over a jade scroll.</p><br/><p>Chang Heng took over the jade scroll. Without looking, he put it away.</p><br/><p>The yellow-faced man saw Chang Heng didn’t move and said in satisfaction, “This is the first half. It’s the deposit. After the matter is concluded, I’ll give you the other half. I’ll notify you of the general time.”</p><br/><p>Chang Heng nodded and said expressionlessly, “Alright.”</p><br/><p>Finishing, he turned and left.</p><br/><p>Translator Ramblings: I was wrong, it’s more like multiple reaction chapters. The story is going to vent now like a balloon slowly deflating, but it won’t pop.</p><br/><p>Wei Sheng has become a mummy. Luo Li has the ghost. It’s a band of monsters, the zombie, the mummy and the ghost.</p><br/>\n</div>"}