{"title": "Chapter One Hundred and Fifty Four Moon Chime Sound Storm", "id": 104, "volume": 2, "url": "http://boxnovel.org/world-of-cultivation-chapter-one-hundred-and-fifty-four-moon-chime-sound-storm", "volume_title": "Volume 2", "body": "<h1>Chapter One Hundred and Fifty Four Moon Chime Sound Storm</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter One Hundred and Fifty Four Moon Chime Sound Storm</p><br/><p>Thousands of rings of light were chiming all at once. To the ears of everyone watching it was unspeakably clear and pleasurable, but the expressions of the five people inside the formation changed. Even Chang Heng, who was usually stoic, narrowed his eyes instinctively. He unhesitatingly reached towards the copper ring between his collarbones and took out the Bloody Spider sword.</p><br/><p>He glanced at the others in the formation. Everyone acted as though they were facing a great enemy. Even the yellow-faced man that had been steadily overpowering him previously, had a serious expression as he held the copper dagger-axe in front of his chest.</p><br/><p>When that clear chime from the rings of light had sounded out, the ling power in their bodies shook, their energies became unsteady!</p><br/><p>Just a chime from the rings of light was so strong. The five people instantly became nervous.</p><br/><p>Even the stupidest person understood now that the great formation in front of them had changed. The full moon shone in the sky. The moon-colored strands were like hair, soft and powerless, weaved in with the rings of light and ringing of wind chimes, the scene was a beautiful painting. Such a beautiful scene yet there was no admiration from the five people inside it. In their eyes, the formation was powerful and full of murderous intent!</p><br/><p>———</p><br/><p>Behind the black gauze, Su could not keep her composure, her face full of shock.</p><br/><p>Such a formation, such a display, was it really something a zhuji xiuzhe could complete?</p><br/><p>That image of a wretched, greedy, and soft-rice-eating zombie in her head was completely destroyed. Behind that expressionless face, there seemed to be a long shadow, deep and hard to predict! Had she been wrong in her impression of Zuo Mo from the beginning?</p><br/><p>There were thousands rings of light on the moon strings. They slowly swayed, elegant and soft.</p><br/><p>Tightly focusing on the moon strands and light rings in front of her, Su’s gaze seemed to be deeply attracted to them, and she was unable to move her eyes away. The rings of light gently trembled, and little slivers of killing intent slowly permeated, silently taking over every bit of space.</p><br/><p>Her mouth was slightly dry.</p><br/><p>She had always wondered why Zuo Mo hadn’t sent out the paper crane. She understood now. Zuo Mo didn’t need her help at all.</p><br/><p>But at this time, her body was tense, not daring to slack off the tiniest bit. Her gaze still didn’t move. The sword scripture that she practiced belonged to the area of magnetism. Magnetic power was extremely good for detection. These tiny bits of killing intent appeared as non-threatening, but in reality, they could gather together at any time and kill.</p><br/><p>Yet what truly made her on her guard, and more nervous than ever, was that she was their target!</p><br/><p>Why … …</p><br/><p>Why would she also be an enemy? Su couldn’t understand, but there was no time for her to think. She could only prepare for battle. She had a strong feeling that once the big formation was activated, it wouldn’t be so relaxing… …</p><br/><p>———</p><br/><p>Wu Ling Sanren and Wei Fei’s expressions were heavy.</p><br/><p>Wei Fei stared down and asked solemnly, “Sanren, do you recognize this formation?”</p><br/><p>Wu Ling Sanren shook his head. “No, but this formation should be fourth-grade. However, it must be that soul-tethered talismans that he just got which makes it so powerful.” He nervously stared at the formation below him, eyes unwavering.</p><br/><p>He had to admit he had made a wrong judgment. Before, he had only felt Zuo Mo had some talent, but his skill with formations was in the range of normality, but looking at it now, the formation that guy had set up was far beyond his cultivation stage.</p><br/><p>If it was only that, he would have just been slightly surprised. What really shocked him was that this guy had a soul-tethered talisman!</p><br/><p>Truly a fortunate guy!</p><br/><p>He couldn’t help but be envious. His cultivation was multiple times higher than Zuo Mo, but he didn’t have a soul-tethered talisman.</p><br/><p>He was not the only one that was green-eyed over Zuo Mo’s soul-tethered talisman. Wei Fei also sighed over the unfairness of the heavens. However, they knew that soul-tethered talismans could not be planned for. Both were also jindan experts, the strength of their mind extremely resolute, and did not move so easily for an outside object.</p><br/><p>The two of them quickly returned to normal.</p><br/><p>“What does he want to do?” Wei Fei’s brows furrowed as he snorted coldly. “Does he want to fight one against five? Has a soul-tethered talisman, so he doesn’t even know where his limits are?”</p><br/><p>Wu Ling Sanren didn’t speak. After continuously making mistaken judgments, he felt the less he said, the better. Also, based on the grave presence of the formation below, Zuo Mo may not be brash. What he really could not see clearly was Zuo Mo’s present situation.</p><br/><p>Inside the formation, Zuo Mo still maintained his weird posture, his eyes empty.</p><br/><p>The air around him seemed to be like glue, motionless. If one looked closely, they would find that the rings of light near him were affected by an invisible force that pushed them away.</p><br/><p>The abnormalities had started when Zuo Mo had entered this strange state.</p><br/><p>Wu Ling Sanren didn’t have any confidence.</p><br/><p>The Five Colored Pagoda floated in the sky above the pond. On the sword-sharp point, there was a dot of star light that flashed, communicating with the full moon in the sky.</p><br/><p>The moon dimmed and brightened.</p><br/><p>Clink clink clink clink!</p><br/><p>Suddenly, the light rings on the moon strings started to shake. The small chimes were like a tide, spreading out in waves.</p><br/><p>The five people inside the formation stiffened as the tension rose. At this time, they did not have the attention to spare to fight with other people because, to their shock, they discovered that Zuo Mo did not plan on letting even one of them escape from the formation escape.</p><br/><p>———</p><br/><p>“Tsk! Unlucky!” Luo Li felt helpless. Zuo Mo went crazy again! The flying sword floated beside him, waiting to attack.</p><br/><p>He said those words, but light came into his eyes, and slight anticipation rose. There was quite a period of time since the last time they had fought. He always had the thought of trying to fight Zuo Mo again but he had never found the chance.</p><br/><p>Now that the opportunity was right in front of him, the desire for battle burned in his heart.</p><br/><p>In Luo Li’s mind, Zuo Mo and Wei Sheng were all geniuses of the sect. Wei Sheng Shixiong was like a mountain peak unable to be scale. Facing Shixiong, one would only feel hopelessness. Zuo Mo was completely different. If one saw him usually, one would always accidentally underestimate and disdain him. But when one truly faced him, he might not win, but he definitely would surprise and shock others.</p><br/><p>———</p><br/><p>Gui Feng also detected the thick killing intent in the formation. He didn’t use the ghost movement to hide his figure like usual. The entire formation was under the control of the other. The effect of the ghost movement was limited. His expression was grave. Two blooms of bright green ghost fire burned on the white bone sword. The body of the sword hummed like the soft sobs of souls.</p><br/><p>———</p><br/><p>Zuo Mo still hadn’t left that wondrous state.</p><br/><p>This state made people intoxicated, a state where anything was possible, as though everything was understood.</p><br/><p>He silently stood there as though he was a spectator, watching everything that was happening in front of him. The Five Colored Pagoda whose thoughts were connected to his was stand guard in the center of the great formation, controlling the entire Skyring Moon Chime Formation!</p><br/><p>Every detail of the Skyring Moon Chime Formation flowed across his heart. He couldn’t see it, but he could clearly feel it.</p><br/><p>It was passed on from the Five Colored Pagoda.</p><br/><p>Before, his original intentions had been to activate and use the seventy-two child formation Skyring Moon Chime Formation in order to gain some experience, and to comprehend some of the intricacies of the Skyring Moon Chime Formation.</p><br/><p>Right now, every detail of the Skyring Moon Chime Formation was in front of him.</p><br/><p>Due to this, he decided he would try the power of the Skyring Moon Chime Formation!</p><br/><p>His thoughts moved, and the Five Colored Pagoda activated the great formation!</p><br/><p>———</p><br/><p>The fine chimes that had like a tide suddenly disappeared. The enormous formation suddenly sank into a dead silence, suffocating like a rock pressed to the chest.</p><br/><p>The five people tensed to their limits inside the formation. This suffocating and heavy silent was the prelude to the killing.</p><br/><p>The round moon suddenly lit up, emanating the brightest and strongest light it could without any regard. In the blink of an eye, the round moon which had been as clean as jade seemed to have started to burn, the strong light making it appear like a ball of fire!</p><br/><p>Clink!</p><br/><p>A ring of light that was the closest to the full moon gave a clear sound!</p><br/><p>This clear sound announced the beginning of the killing move. There seemed to be some force that was being passed down through the moon string. Like it was a relay, one by one, the rings of light sounded.</p><br/><p>Clink clink clink … …</p><br/><p>The sounds went from slow to fast, the frequent chimes like a suddenly rising tide!</p><br/><p>Looking from the sky, the rings of light hanging off the strands coming of the moon were like dominoes being set off, one shaking after the previous!</p><br/><p>The shaking of the first ring of light was the least, and the sound was the lightest.</p><br/><p>The send ring of light vibrated more, and the sound was slightly louder.</p><br/><p>The third ring of light vibrated even greater in magnitude, the sound even louder!</p><br/><p>… …</p><br/><p>This cascade of changes was extremely fast. In the blink of an eye, the power seemed to have passed to the end of the moon string, and to the last ring of light!</p><br/><p>The last ring of light on each moon strand lit up at the same time. After the power from the preceding rings of light finally reached the last ring of light, the chiming of the ring of light had reached a maximum!</p><br/><p>Clang!</p><br/><p>The five people inside the formation felt their vision blur. Everything they saw seemed to twist and change. The ground underneath their feet shook violently, almost knocking them off their feet.</p><br/><p>All of their expressions changed.</p><br/><p>———</p><br/><p>Su’s Black Daze sword was held across her chest, her right hand holding the hilt of the sword, her left hand straight like a sword, pressing gently on the body of the sword. She shouted clearly, “Protect!”</p><br/><p>With her as the center, a terrifying magnetic force exploded into the surroundings!</p><br/><p>———</p><br/><p>Luo Li didn’t go grab the flying sword floating in front of him, but spread out his right hand, the palm open. His voice was ethereal, lonely and empty, “Self Separate!”</p><br/><p>The ethereal sword essence was like a female ghost dancing by his side.</p><br/><p>———</p><br/><p>Chang Heng’s Blood Spider sword transformed into the Blood Spider, shielding him from the front. The blood light on the body of the blood spider was extremely bright, as though it had just been taken out of a blood pond! The blood spider gave a vicious howl, ready to leap!</p><br/><p>———</p><br/><p>At some time, a heavy copper armor appeared on the yellow-faced man. The thick armor covered his entire body, only revealing his eyes. His hand was holding the copper dagger-axe flatly, his back straight as he bellowed, “Break!”</p><br/><p>———</p><br/><p>A child appearing about six or seven years old appeared in front of Gui Feng. He was very chubby, his skin tender. He was wearing a red belly-cloth. However, his eyes were an eerie green! Gui Feng shouted, “Go!”</p><br/><p>Gui Feng’s killing move –––– Little Ghost King!</p><br/><p>The five people simultaneously used their killing moves. They could feel a strong threat!</p><br/><p>The activation of the Skyring Moon Chime Formation did not have any forewarning. Once it started, it activated its strongest attack!</p><br/><p>Inside the formation, the lion-headed copper cauldrons that Zuo Mo used to set up the [Li Fire Formation] collapsed into dust, the metal nails turned to dust, the jade cards turned to dust, the plants turned to dust, the ground turned to dust …. …</p><br/><p>The half-mu sized pond turned into a ball of fine mist!</p><br/><p>This was the initiation of the strongest killing move of the seventy-two child formation Skyring Moon Chime Formation – [Moon Chime Sound Storm]!</p><br/><p>Translator Ramblings: Poor Su, she’s labelled an enemy because Zuo Mo has no fine control.</p><br/>\n</div>"}