{"title": "Chapter One Hundred and Seventy Seven – Business", "id": 127, "volume": 2, "url": "http://boxnovel.org/world-of-cultivation-chapter-one-hundred-and-seventy-seven-%E2%80%93-business", "volume_title": "Volume 2", "body": "<h1>Chapter One Hundred and Seventy Seven – Business</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter One Hundred and Seventy Seven – Business</p><br/><p>As Pu Yao muttered under his breath; Zuo Mo, who once again had been thrown to the dirt again, detected the change in his own body!</p><br/><p>Struggling to climb up, he didn’t howl and charge like he did the previous few times.</p><br/><p>A bucket of cold water seemed to have been thrown on Zuo Mo’s hot head, causing him to wake up. His desire for battle that had been burning dissipated. He looked down at his hand. At some unknown time a mountain shaped tattoo appeared on his palms.</p><br/><p>What was this?</p><br/><p>———</p><br/><p>As Zuo Mo bent down to examine his palms, the hearts of the on-looking disciple’s stumbled a beat.</p><br/><p>Did Shixiong not have enough energy? The last twenty-something crashes had made their hearts shake and pulled their hearts into the air. They didn’t even dare to blink. They didn’t understand why Shixiong would use such a brutal method of fighting.</p><br/><p>If he lost, there was no chance of survival!</p><br/><p>The brutality of the Blue Spiked Crocodile was known by everyone present.</p><br/><p>This time Shixiong stood up and didn’t charge like he had before, everyone thought it worrisome.</p><br/><p>When the Green Spiked Crocodile charged at Shixiong again, Shixiong was still standing motionlessly. Their expressions all changed!</p><br/><p>Shixiong had no more energy!</p><br/><p>“Uh-oh!”</p><br/><p>Almost all the disciples used their strongest moves, hoping they could help block for Shixiong for a while. Countless lights flashed, ling hoes, herb cutters, skinning knives, flew into the air, each with their own unique colour.</p><br/><p>But they were all production xiuzhe. They usually never practised any attacks. Their panicked and fumbling offense didn’t even strike the shadow of the Blue Spiked Crocodile.</p><br/><p>Seeing the Blue Spiked Crocodile about to ram into Shixiong, many disciples didn’t bear to watch! It was possible to see from the aftershocks of Shixiong’s previous attacks just how strong the Blue Spiked Crocodile was!</p><br/><p>One charge was enough to break rock!</p><br/><p>If one didn’t defend, there was only one outcome — to be split into pieces!</p><br/><p>If Shixiong was not here, with their own strength, how could they survive on the Desolate Wood Reef? Without the protection of the big formation, they were like a herd of sheep left to the wolves.</p><br/><p>Everyone’s hearts sunk!</p><br/><p>They were finished!</p><br/><p>———</p><br/><p>At this time, Zuo Mo raised his head.</p><br/><p>The Blue Spiked Crocodile was ten steps away from him. Its speed was so fast, it appeared as a series of after images. The oncoming presence was so strong it was suffocating.</p><br/><p>A ball of gold light burst out of Zuo Mo’s eyes as he raised his head. He suddenly raised both of his hands, his left leg moving back into an arched position.</p><br/><p>When he finished this move, the sharp teeth of the Blue Spike Crocodile just perfectly touched the two palms he held up.</p><br/><p>The palms, which now appeared to be made from dark gold, and the pale and retched smelling crocodile teeth smashed together!</p><br/><p>Boom!</p><br/><p>Air swirled and shook. Ripples visible to the naked eye suddenly spread from the point the palm and teeth collided.</p><br/><p>The golden pair of hands did not move!</p><br/><p>From extreme movement to extreme stillness, the blow it dealt to the bystanders could not be rivalled. The talismans flying in the sky all stopped. Chun Yu Cheng, Gongsun Cha and the others looked in disbelief at this picture, this extremely strange scene. They forgot to control their talismans, not realizing that all their talismans had fallen to the ground.</p><br/><p>Zuo Mo’s eyes turned entirely dark gold, the light rippling inside, cold and unfeeling.</p><br/><p>He felt that his body was full of strength right now! Strength that he never possessed before! His legs that were standing on the ground seemed connected with the great earth, he seemed to be together with the earth, endless power streamed into his body.</p><br/><p>Confidence grew strongly in him. He believed that even if there was a mountain, he could rip it open!</p><br/><p>The powerful charge of the angered Spiked Crocodile did not cause his hands to shake the tiniest bit. His left hand flowed along to grab the two fangs protruding out of the Blue Spiked Crocodile, his right hand forming a blade and suddenly slicing against the head of the Blue Spiked Crocodile.</p><br/><p>Pia!</p><br/><p>The golden palm was like a sharp gold knife, but the sound of impact was as if a ten thousand catty hammer had struck the head of the Blue Spiked Crocodile. The skin of the Blue Spiked Crocodile, that even flying swords were unable to damage, didn’t break but the flesh under its skin vibrated like drums.</p><br/><p>The eyes of the Blue Spiked Crocodile suddenly expanded. Then, like a pile of wet mud, it stopped moving and dropped to the ground.</p><br/><p>Zuo Mo carelessly threw the Blue Spiked Crocodile to one side, not even looking at it. He closed his eyes, slowly recalling and savouring this strange and wonderful feeling.</p><br/><p>His body was like a mountain, connected to the earth. A heavy strength passed from the earth into his body, he felt every joint of his body was filled with strength … …</p><br/><p>He slowly experienced this state, but this feeling of connectedness with the earth quickly disappeared from his body.</p><br/><p>Only when he couldn’t feel it anymore did he open his eyes. His heart was full of longing. The feeling of strength was really wonderful. Opening his palms, the mountain tattoos were so faint they were almost invisible.</p><br/><p>Zuo Mo did not have too many regrets. He knew that had just been a moment of comprehension at a time of breakthrough. This kind of state could not last for a long time. But since he had passed this barrier, as long as he persisted and worked hard, there would be a day when he would reach that level.</p><br/><p>It might have been the shock of leveling up but his joy at killing the Blue Spiked crocodile was very faint.</p><br/><p>Before he left, he only said, “Gongsun Shidi, take care of it.”</p><br/><p>———</p><br/><p>After he left, everyone still had not come out of their shock. The last scene was truly too stunning, too fantastical. They felt their minds were a blank, not knowing what to say.</p><br/><p>After a while, Gongsun Cha who had recovered first ran to to the corpse of the Blue Spiked Crocodile and flipped it. After a while, he said, “Way too strong! Way too strong!”</p><br/><p>Hearing this, the other people also crowded over, surrounding the corpse of the Blue Spiked Crocodile. Even the wounded disciple did not care about his pain, running over in curiosity.</p><br/><p>“Dead! Completely dead!”</p><br/><p>“A Blue Spiked Crocodile is fourth-grade! Shixiong can even kill a fourth-grade Blue Spiked Crocodile, we don’t need to worry anymore!</p><br/><p>“Worry? Have I ever worried? Anyways, isn’t there also the big formation? He, right, why didn’t Shixiong use the big formation?”</p><br/><p>“Ha, does Shixiong need to use the formation?”</p><br/><p>… …</p><br/><p>Everyone chatted, unable to disguise the excitement on their faces.</p><br/><p>Chun Yu Cheng and Gongsun Cha had amiable relations. He saw that Gongsun Cha had a face full of awe and couldn’t resist asking, “What are you seeing?” Seeing Gongsun Cha’s expression, he knew that this guy definitely wasn’t just excited that Shixiong had killed the Blue Spiked Crocodile.</p><br/><p>“Way too brutal!” Gongsun Cha’s voice was excited, his gaze blazing, “Ha ha, everything inside this Blue Spiked Crocodile, all the bones, muscles, organs, they have all been shattered to pieces!”</p><br/><p>Chun Yu Cheng jumped, “No way!”</p><br/><p>Looking at the untouched outer layer of the Blue Spiked Crocodile, he could not imagine that the inside of this being was completely shattered.</p><br/><p>This was a fourth-grade Blue Spiked Crocodile … …</p><br/><p>Gongsun Cha shook his head and commented, “It is a waste of this Blue Spiked Crocodile. Only the teeth, skin, eyes, and the spikes can be used. The organs of a Blue Spiked Crocodile are very valuable … …”</p><br/><p>Chun Yu Cheng did not hear Gongsun Cha’s words. He had floated off in his thoughts.</p><br/><p>Chun Yu Cheng suddenly felt the usually low-key Shixiong was full of mystery and could not be understood. He did not know much about formations but he had heard of the [Skyring Moon Chime Formation] before. He didn’t find it surprising that Shixiong could kill Nan Ming Zi with it, since Shixiong was able to get third in the Sword Test Conference relying on it. But when Shixiong took out the beast pool, he completely lost all resistance. The temptation was just too much.</p><br/><p>The beast pool was due to the animal keeping remnant scroll, but where did this astounding power come from?</p><br/><p>The sect didn’t have this kind of scripture!</p><br/><p>Without knowing it, he felt awe.</p><br/><p>———</p><br/><p>When Zuo Mo went back to his residence and had just sat down, Pu Yao appeared.</p><br/><p>“What did I just do?” Zuo Mo asked.</p><br/><p>“Don’t know, I’m not familiar with body cultivation,” Pu Yao shook his head.</p><br/><p>Zuo Mo rolled his eyes. He didn’t believe it. However, if Pu Yao didn’t want to say it, there was no way around it.</p><br/><p>“Let’s do some business. Are you interested?”</p><br/><p>“Not interested!” Zuo Mo decisively shook his head. His previous experience with Pu Yao told him that he would only lose and never make a profit.</p><br/><p>“Don’t refuse so quickly.” Pu Yai said amuse fly. His two eyes narrowed into two bloody crescents. “Haven’t you been trying to make a sword formation? I’ll teach you a technique to use your consciousness. You can easily use the sword formation.”</p><br/><p>“Oh,” Zuo Mo was not persuaded.</p><br/><p>“This is a secret method. It is called the [Great Thousand Leaf Hands]. Even though your spiritual power isn’t low, your technique is terrible and fail to really express the power. The [Great Thousand Leaf Hands] can fill in a gap.”</p><br/><p>“Oh,” Zuo Mo was still not persuaded.</p><br/><p>“The spirit as a vine and the leaves as hands, it can easily make many transformations. Your one hand can do many things. When you have one thousand hands, how can anyone defend against you? Brute strength is useless. Even you sword xiu fight with swords, no one will let you in for close combat. That thing has no future! Your spirit is the right path! The path of Heaven is a wheel, you cannot control it but you can move it!”</p><br/><p>“You said it yourself. Yao, mo, xiuzhe, each have their own advantages.”</p><br/><p>Pu Yao paused. Then he acted as he hadn’t heard Zuo Mo’s words.</p><br/><p>“Oh, I could also teach you [Little Thousand Leaf Hands]. The [Great Thousand Leaf Hands] emphasize invisibility and cooperation with your formations. The [Little Thousand Leaf Hands] has thirty-six moves. There are three that you could learn to defend yourself. Even if you are just in zhuji, you don’t need to worry about a ningmai.”</p><br/><p>“Oh,” Zuo Mo was not moved, Pu Yao’s actions were way out of the norm!</p><br/><p>Demons only appear when something was amiss!</p><br/><p>This guy was the most demon-like of all demons.</p><br/><p>“Oh, If you agree, starting from today, other than the expenses for the Nether Pool, I won’t take one more jingshi.”</p><br/><p>Just like how well Zuo Mo knew Pu Yao, Pu Yao was clear about Zuo Mo’s weaknesses. He gently threw out a condition that Zuo Mo could not refuse!</p><br/><p>As expected, Zuo Mo instantly couldn’t keep sitting, “Really?”</p><br/><p>“Really.”</p><br/><p>“Then what do you need?”</p><br/><p>“Your blood,” Pu Yao’s smile was extremely malicious.</p><br/><p>Zuo Mo’s expression changed. He decisively shook his head. “No!”</p><br/><p>Was he joking, if he didn’t have jingshi, he could make more, if he lost his little life, he didn’t have a spare. He didn’t dare to joke around with his little life.</p><br/><p>Pu Yao saw Zuo Mo’s thoughts with a glance, “Don’t worry, it won’t affect your body. You do body cultivation, your vital blood is very abundant. It won’t be much to take some blood. I don’t need much, one drop a day. One drop a day is nothing to you!”</p><br/><p>“No!” Zuo Mo persisted in refusing.</p><br/><p>Translator Ramblings: Business only works when both sides want something. Pu Yao knows Zuo Mo all too well now.</p><br/>\n</div>"}