{"title": "Chapter One Hundred and Seventy Nan Ming Zi", "id": 120, "volume": 2, "url": "http://boxnovel.org/world-of-cultivation-chapter-one-hundred-and-seventy-nan-ming-zi", "volume_title": "Volume 2", "body": "<h1>Chapter One Hundred and Seventy Nan Ming Zi</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter One Hundred and Seventy Nan Ming Zi</p><br/><p>Zuo Mo did not panic. He only narrowed his eyes at the sword light heading towards them.</p><br/><p>There was only one reason. With Wu Kong Sword Sect’s present status in Sky Moon Jie, no one would so foolishly dare to antagonize them. Different than the other grand sects’ steady conduct, the offensive power that Wu Kong Sword Sect were able to display had shook all of Sky Moon Jie. No one was able to rival the fame of Xin Yan’s Ice Dragon Sword.</p><br/><p>He took out a little flag from his ring. Raising his hand, the little flag started to grow. The mast of the flag was more than three zhang high, about the thickness of a goose eye, completely black, and appeared to be made out of steel. On the black flag, the words “Wu Kong” seemed to radiate unlimited power. The brush strokes were like sword strokes, appearing to almost fly off of the flag.</p><br/><p>When the disciples saw the flag, all of them had a joyous expression. They sighed at the affection that the sect leader had towards Zuo Mo. Each sect had their own tokens to prove their identities. This flag was Wu Kong Sword Sect’s token. Other than being a token, it was also a talisman that had been forged by several jindan together, who imbued it with many powerful abilities.</p><br/><p>This Wu Kong flag had been something Shi Feng Rong had specially gone to Pei Yuan Ran to obtain for Zuo Mo.</p><br/><p>As the sword light reached them, a xiuzhe about forty years old, with a white clean-shaven face and wearing a green Taoist robe could be seen. He was standing on a flying sword. At first glance, he saw the flag. His expression changed slightly. The name of Wu Kong Sword Sect had really become too famous recently.</p><br/><p>Nan Ming Zi leapt down from the flying sword, and the flying sword flew into the sword sheath on his back.</p><br/><p>“Humble Taoist Nan Ming Zi greets the friends from Wu Kong Sword Sect!”</p><br/><p>“Greetings friend.” Zuo Mo folded his hands and bowed.</p><br/><p>The wariness in Zuo Mo’s heart did not lessen at all. Nan Ming Zi was in the intermediate stage of ningmai, higher than all of the disciples here. The Desolate Wood Reef was also on the border of the jie river. If Nan Ming Zihad any ill intentions,killed them for their treasure, and escaped through the jie river into Little Mountain Jie, the sect wouldn’t be able to easily find him.</p><br/><p>Nan Ming Zi looked at the Wu Kong flag, and a flash of greed shone in his eyes. A talisman that took several jindan to forge, naturally it was one of the finest! However, he quickly pushed down the greed in his heart. A sect token was a good talisman, but it was also a hot potato.</p><br/><p>When he detected everyone’s cultivation, his own heart instantly relaxed greatly.</p><br/><p>He noticed Zuo Mo. From beginning to now, it was this person that was speaking with him. He must be the leader of this group. He suddenly stared, “Friend looks very familiar, please tell me of your great name!”</p><br/><p>“This one is Zuo Mo,” Zuo Mo answered. He had caught sight of the glimmer of greed that had briefly flashed in the other’s eyes. He was way too familiar with this kind of gaze.</p><br/><p>“Zuo Mo?” Nan Ming Zi furrowed his brows to think. This face and the name, he was very familiar with both. He suddenly lifted his head, “Zuo Mo of the formation-seal-style?”</p><br/><p>“Just little tricks, they don’t deserve to be mentioned,” Zuo Mo smiled expressionlessly.</p><br/><p>Nan Ming Zi’s heart suddenly became cold. It had only been half a year since the Dong Fu Sword Test Conference. Zuo Mo’s name had still not been forgotten. He took back his original estimation. This expressionless guy in front of him had defeated ningmai before.</p><br/><p>And the terrifying formation-seal-style … …</p><br/><p>His gaze instinctively scanned the surroundings.</p><br/><p>Line after line of criss-crossing pathways, piles of rock that clearly had been dug up … …</p><br/><p>His heart suddenly beat faster. No way … … formation-seal-style … …</p><br/><p>Zuo Mo’s expressionless face suddenly transformed into something as deep as the ocean, his stare appeared cold like a hunter watching prey caught in a trap. He rejoiced that he hadn’t attacked just now. This zombie in front of him was one that killed without a trace!</p><br/><p>There were many rumours about why the Dong Fu Sword Test Conference had stopped in the middle, but no matter which version was told, they all used that enormous pit as the basis.</p><br/><p>Nan Ming Zi was old and he had cultivated for a long time. His cultivation was even higher than people like Gu Rong Ping. However, he was from a small sect. In terms of attack power and techniques, he had to admit he wasn’t a match for the youths of the Sword Test Conference.</p><br/><p>A drop of sweat flowed down his back.</p><br/><p>“Ha ha. This poor Taoist is planning on passing through the jie river from here. Can this Taoist borrow this land to rest for a few days?” Nan Ming Zi hurriedly said. “If this one disturbs, please forgive my intrusion!”</p><br/><p>His hands were passing over five pieces of third-grade jingshi.</p><br/><p>Zuo Mo hadn’t expected the other to be so proactive. He did not change his expression as he took the five pieces of jingshi. “You are too polite! We have just taken possession of the Desolate Wood Reef from Heart Lake Sword Sect. There hasn’t been time to construct a few buildings. It is a poor place with little to offer, please have tolerance.”</p><br/><p>Heart Lake Sword Sect … …</p><br/><p>The sweat on Nan Ming Zi’s forehead became even more pronounced. If Wu Kong Sword Sect could be called the rising nouveau-rich, than Heart Lake Sword Sect was old money with deep foundations!</p><br/><p>Since it was related to two big sects, Nan Ming Zi didn’t dare to act easily. He originated from a small sect and was very clear what power these big sects possessed. If it was only Wu Kong Sword Sect, he might dare to risk it; but since it also related to Heart Lake Sword Sect, he no longer had the courage.</p><br/><p>The other disciples looked at Zuo Mo with eyes full of admiration. The other was a ningmai!</p><br/><p>Nan Ming Zi was very tired after a long flight. He found a spot to meditate and recover his strength. The disciples of Wu Kong Sword Sect found that in the next few days, Shixiong would walk all over the place, occasionally putting all kinds of strange materials into the ground, or casting some spells that no one understood.</p><br/><p>But the formation that everyone imagined did not show any signs of completion.</p><br/><p>Some less courageous disciples became panicked. Nan Ming Zi appeared friendly up until now, but they still worried. The other was much stronger than them. After recovering, the difference between the two sides would be even greater.</p><br/><p>Zuo Shixiong’s big formation still appeared incomplete.</p><br/><p>The third day, just like normal, Zuo Mo continuously cast all kinds of spells on the ground. He didn’t seem very rushed, his composure idle.</p><br/><p>———</p><br/><p>In the middle of meditation, Nan Ming Zi’s eyes opened a sliver and looked thoughtfully at Zuo Mo. These last three days, he had been observing Zuo Mo constantly. He didn’t find any ripple of a formation inside the island. Inside those criss-crossing canals, there was water that flowed in and out into the Endless Ocean. From all the signs, Zuo Mo’s big formation did not seem to have been completed.</p><br/><p>Was he purposefully concealing it, or was the formation really not finished?</p><br/><p>Nan Ming Zi wasn’t sure. He decided to wait a bit longer. There wasn’t anyone else on the island, only this crowd of zhuji. For him, it was very easy to conquer. There usually wasn’t any wealth on zhuji xiuzhe. However, he coveted the flag in Zuo Mo’s hands. Zuo Mo had used so many materials on the formation over the past few days that even Nan Ming Zi felt pain on his behalf.</p><br/><p>These three days, that Wu Kong flag could not be driven from his thoughts. As his ling power recovered, Nan Ming Zi’s heart started to waver. Thinking that he was afraid of a zhuji xiuzhe, he felt his face burn with shame. Other than formations, Zuo Mo could not be of any danger to him.</p><br/><p>With his power, these zhujii cultivators completely had no power to resist. If the formation was not complete, he had complete confidence he could quickly kill Zuo Mo. If it really came to that point, he didn’t plan on letting of any of the other Wu Kong Sword Sect disciples escape either. Afterwards, he would flee to Little Mountain Jie, then to Sky Water Jie. No matter how powerful Wu Kong Sword Sect and Heart Lake Sword Sect were, how could they find him then?</p><br/><p>A dark light flashed across Nan Ming Zi’s eyes.</p><br/><p>———</p><br/><p>As Zuo Mo felt Nan Ming Zi’s vision, he started to sprint. Nan Ming Zi would never have thought that Zuo Mo’s consciousness was so strong that he could detect that Nan Ming Zi had been faking his meditation for the majority of the three days. Zuo Mo knew that Nan Ming Zi did not have good intentions, but to scare Nan Ming Zi, he had acted in a very calm manner the past few days.</p><br/><p>As expected, troubled times had come! The world was in disorder!</p><br/><p>Zuo Mo sighed inside, his feet moving faster. Now that society was in disorder, only having enough power would keep him alive.</p><br/><p>He travelled along familiar paths back to the underground lava lake. These last few days, the fire formation in the lava lake had been continuously processing the copper hoop.</p><br/><p>Zuo Mo waved his hand. The copper hoop rang and flew into his hand. The yellow-red copper hoop was now a bright fiery red, looking slightly strange compared to before. The fire element power had been very strong. After forging for three days and nights, the grade of the copper hoop had been raised by one level, reaching fourth-grade.</p><br/><p>He gave a satisfied expression.</p><br/><p>Coming out of the lava lake, Zuo Mo did not conceal his figure anymore, flying straight into the sky.</p><br/><p>———</p><br/><p>The other people instantly found Zuo Mo in the air.</p><br/><p>The disciples of Wu Kong Sword Sect all had excited expressions. The murderous intent on Nan Ming Zi’s face finally could no longer be concealed. He came to the conclusion that the formation on the island really had not been completed!</p><br/><p>Damn it! He had been tricked by this zombie! Nan Ming Zi’s eyes revealed his greedy and crazy emotions. Born out of a small sect, even if he had reached the stage of ningmai, he still did not have an appropriate talisman!</p><br/><p>He might not understand formations, but he was very experienced. Seeing Zuo Mo, it looked as though he was planning on activating the formation. Such a good opportunity, if he did not act now, when could he?</p><br/><p>Silently, his flying sword had come out of its sheath. It suddenly turned into a stream of light, leaping towards Zuo Mo in the air.</p><br/><p>Nan Ming Zi intended to kill with one blow. He did not hold anything back with this blow. The sword light was like a snake, opening its gaping maw and showing its fangs. Even from a distance, it was possible to feel the viciousness and maliciousness in the sword essence.</p><br/><p>The expressions of the other disciples changed. Everyone took out their flying swords to try to act against Nan Ming Zi.</p><br/><p>Nan Ming Zi smiled coldly. His figure flashed and appeared both on the ground and in the sky.</p><br/><p>Zuo Mo did not seem to detect the sword light heading towards him. He opened his hand and the copper hoop slowly floated into the sky.</p><br/><p>Ding!</p><br/><p>As the red copper hoop slowly rose, it rang, producing clear bell-like sounds.</p><br/><p>Ding ding ding ding!</p><br/><p>It was as though there were countless wind chimes humming together with the red copper hoop. The Desolate Wood Reef was filled with the sounds of chimes.</p><br/><p>The sword light that was halfway in the air seemed to have encountered great resistance. The body of the sword shook, and its speed suddenly decreased. Nan Ming Zi’s expression changed greatly. Gritting his teeth, all his ling power flowed into the sword. The light of the sword suddenly grew, its snake-like shape suddenly becoming even more realistic.</p><br/><p>Hiss hiss!</p><br/><p>The sword hissed as it cut through the air. The sword essence became even more brutal and savage.</p><br/><p>Facing such a strong sword presence, Zuo Mo didn’t even bat an eyelid. All of his attention was focused on the slowly rising copper hoop.</p><br/><p>At this time, the red copper hoop had floated past Zuo Mo’s head. It was like the sovereign that was facing the world. All the materials that Zuo Mo had cast into the ground seemed to have felt some invisible magnetism and started to float up into the sky with the fiery red copper hoop.</p><br/><p>In the sky above the Desolate Wood Reef, there was countless materials floating densely together, as if to blot out the sun!</p><br/><p>Translator Ramblings: Zuo Mo made a bluff. I’m not sure what the sect leader was thinking since Nan Ming Zi’s arrival should not be a surprise. There’s probably not a lot of alternatives but strategically, why didn’t one of the elders come earlier and set things up?! Jindan can travel much faster.</p><br/><p>Think of the hoop similar to Nezha’s Universe Ring so somewhat bigger than the hand .</p><br/>\n</div>"}