{"title": "Chapter One Hundred and Seventy One Micro Void Arrow", "id": 121, "volume": 2, "url": "http://boxnovel.org/world-of-cultivation-chapter-one-hundred-and-seventy-one-micro-void-arrow", "volume_title": "Volume 2", "body": "<h1>Chapter One Hundred and Seventy One Micro Void Arrow</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter One Hundred and Seventy One Micro Void Arrow</p><br/><p>The copper hoop was a Buddhist Sound Hoop, one of the finest of the third-grade talismans. When Zuo Mo had found it in the stores, he had been very happy. It was hard to find fine sound-type talismans. This Buddhist Sound Hoop had been made from Meteorite Copper and Crimson Red sand, and was able to produce a clear sound capable of breaking through illusions. Especially rare was the Buddhist Formation on the hoop was steady and grounded, not flashy, and had a uniquely dignified, serious presence.</p><br/><p>After having been forged in strong fire element power for multiple days, the fire power flowed through the hoop. The clear sound it produced had become a deep strum, and within it were traces of hidden strength. What was special was the strength was like the sun, warm yet not brutal. The hoop had risen from third-grade to fourth-grade, its power growing drastically.</p><br/><p>From the moment he saw the Buddhist Sound Hoop, Zuo Mo had decided to take it. It was as though it had been custom made for the [Skyring Moon Chime Formation]. The Buddhist Sound Hoop did not provide as much fine control as his Lil’ Pagoda, but because it was a sound-type talisman, it was much better suited to the [Skyring Moon Chime Formation]. Used as the center of the formation, the power would be much greater!</p><br/><p>When Zuo Mo stepped onto the Desolate Wood Reef, he had already planned it out.</p><br/><p>He had decided to set up a [Skyring Moon Chime Formation] of unprecedented size! There was enough manpower, and enough materials, there was also enough and time for him to set it up.</p><br/><p>A two hundred and sixteen child formation [Skyring Moon Chime Formation]!</p><br/><p>Three seventy-two child formation [Skyring Moon Chime Formation] were placed at the corners of a triangle on the island, forming a large, never-before-seen [Skyring Moon Chime Formation]. It really was too large, so much that it required a talisman to act as the center of the formation.</p><br/><p>Zuo Mo had never set up such a large [Skyring Moon Chime Formation] before. He also did not know just how powerful the Buddhist Sound Hoop would be after it was tempered; but after studying in the sword essence formation for half a year, Zuo Mo’s understanding of formations was far greater than in the past. Even though he didn’t have very much confidence, he still proceeded accordingly, not panicked at all.</p><br/><p>When he saw all the materials started to floated, his insecurities in his heart finally were alleviated!</p><br/><p>The Buddhist Sound Hoop and the formation had finished their resonance!</p><br/><p>Ping!</p><br/><p>In the sky, a red light flashed on the Buddhist Sound Hoop producing a sound that was powerful and awe-inspiring. It was as if the Vajrapani Buddha was looking down with his eye, authoritative yet not wrathful!</p><br/><p>———</p><br/><p>Nan Ming Zi’s eyes widened in disbelief. The sword essence that he had produced using all the strength in his body was now weak as a bubble. With a pop, it scattered and disappeared.</p><br/><p>An invisible Buddhist sound swept by. His body froze, the circulating ling power to resist the freezing of his body.</p><br/><p>Nan Ming Zi had a shocked expression. The power of the formation was far beyond what he had imagined.</p><br/><p>Not good! He’d been tricked!</p><br/><p>He suddenly bit the tip of his tongue. A sweet, metallic taste instantly came into his mouth. A strange red colour spread across his face, the ling power that had been reserved inside his body was no longer held back. He felt his ling power surge through his body, plentiful like it never had been before.</p><br/><p>But he had already lost his courage. There was only one though in his mind, flee!</p><br/><p>A shuttle shaped talisman in the shape of a date seed appeared in his hand. He hurriedly channeled ling power into it.</p><br/><p>Suddenly, a feeling of extremely danger appeared.</p><br/><p>Uh-oh!</p><br/><p>There was only time for that one thought before he felt a soft impact.</p><br/><p>His chest had suddenly exploded without warning. He looked down and saw a bloody hole the size of a fist in his chest. His vision darkened, and he did not feel anything else.</p><br/><p>[Skyring Moon Chime Formation]’s [Micro Void Arrow]!</p><br/><p>———</p><br/><p>Having seen the entire fight, watching Nan Ming Zi’s corpse plummet like a bag of sand, the Wu Kong Sword Sect disciples below all had expressions of shock and awe. They had heard all kinds of rumors about Zuo Mo Shixiong, but nothing was as shocking as personally seeing Zuo Mo Shixiong easily kill a ningmai xiuzhe.</p><br/><p>In the sky stood the figure of Zuo Mo, a thin body and with his eyes closed, instilled them with a sense of awe and mystery</p><br/><p>———</p><br/><p>A beat later, Zuo Mo opened his eye, joy flashing across his eyes.</p><br/><p>[Micro Void Arrow] was not a technique from the jade scroll of [Skyring Moon Chime Formation], but a technique he had come to understand on his own by studying the sword essence formation. In the sword essence formation, he had watched the process of many fine sword essences gathering into stronger and bigger sword essence many times. [Micro Void Arrow] was the result of the [Skyring Moon Chime Formation] producing large amounts of extremely small chimes. These small sounds would not attract any attention, but when they gathered together were very strong.</p><br/><p>When the enemy inside the formation detected the danger, the [Micro Void Arrow] would have already formed!</p><br/><p>Having detected that Nan Ming Zi wanted to flee, for some strange reason, Zuo Mo had used this technique that he wasn’t familiar with. He hadn’t expected it to be so effective. After finishing the fight, he savored everything he had learned in the moment.</p><br/><p>Looking at Nan Ming Zi’s corpse, Zuo Mo was not happy in the slightest.</p><br/><p>The social order was in chaos!</p><br/><p>When a nest was under attack, would any egg escape? He was just a cultivator in zhuji. The worry in his heart only increased.</p><br/><p>Zuo Mo slowly landed. The Buddhist Sound Hoop disappeared. All of the materials then entered the ground. If it wasn’t for the corpse on the ground, there was no sign that there had been a fight on the Desolate Wood Reef.</p><br/><p>“Everyone, go rest. Starting tomorrow, we can start looking for ling veins.” Zuo Mo said to the other disciples.</p><br/><p>“Yes!” The other disciples bent their heads and complied. The strength that Zuo Mo displayed created awe in their hearts and made them more willing to follow.</p><br/><p>———</p><br/><p>It was a pity that Lil’ Black was asleep. Otherwise, it would be extremely easy to find ling veins. However, these production xiuzhe had their own tricks. There was a ling plant farmer that knew how to look for ling veins, and a beast-speaker who had a blue-star mouse that could find ling veins. All of them were disciples of the same sect. And the Desolate Wood Reef was not large, so no one concealed anything, cooperating in their search.</p><br/><p>Since the [Skyring Moon Chime Formation] was mostly complete, Zuo Mo’s heart finally landed. With the big formation present, he was not afraid of any ningmai. As for jindan, no matter what talismans he had, they were not something he could face.</p><br/><p>However, jindan experts would not care for the little wealth that he had.</p><br/><p>Beside the lava lake, Zuo Mo took out what he had collected from Nan Ming Zi’s body. There was a large pile of knick-knacks in front of him, but what were most eye-catching was a date seed and a piece of withered vine.</p><br/><p>Carved onto the date seed was a little ship, with exquisite pavilions and columns, sails and masts. Zuo Mo remembered that Nan Ming Zi had taken out this date seed at the end when he clearly wanted to flee. He instantly felt great interest. Who didn’t like talismans used for escaping and could potentially be life-saving?</p><br/><p>He channeled ling power inside.</p><br/><p>A strong suction force suddenly came from the date seed. The ling power in his body instantly started to resemble a wild horse out of control, furiously flowing towards the date seed!</p><br/><p>In the blink of an eye, the ling power in his body had been depleted.</p><br/><p>Zuo Mo jumped in fright and forcefully stopped the flow of ling power. This date seed was somewhat abnormal! Still wary, he put the date seed in front of him to carefully look. After absorbing the ling power, there was no change.</p><br/><p>He seemed to understand why Nan Ming Zi had not used the date seed ship earlier. It required too much ling power to activate.</p><br/><p>Zuo Mo grimaced inside. Ling power was his greatest weakness, yet the date seed ship required large amounts of ling power. After all this trouble, what he received was a talisman that he could not currently use.</p><br/><p>He turned his eyes to the withered vine. His dejected mood instantly recovered, the joy in his eyes increasing. In the end, he couldn’t resist roaring with laughter.</p><br/><p>He had made a profit!</p><br/><p>The withered vine was not eye-catchingly pretty. Its muddy grey colour made it appear like any other withered vine which could be found everywhere. When he had taken it out of Nan Ming Zi’s ring, it had been piled together with a bunch of assorted items. Nan Ming Zi had not found its value.</p><br/><p>Zuo Mo recognized this vine. It had a very special name, “Teeth Vine.” It was a very scary organism. A mature teeth vine would release extremely beautiful flowers with seductive sweet fragrances. They were natural illusionists, able to transform into different shapes. From birth, they were skilled in illusory skills. Prey that neared them would be unable to escape as though they were trapped in illusory formations.</p><br/><p>Once the prey entered its hunting range, as it cast an illusion, it would stealthily approach its prey. It was not just a plant, but made from countless tiny worms which were called “teeth.”</p><br/><p>Teeth Vine was an extremely weird and dangerous ling vine. Not only was this unattractive withered vine was Teeth Vine, and it was a section of fourth-grade Teeth Vine.</p><br/><p>Fourth-grade teeth vine!</p><br/><p>He didn’t know who was so skilled that they could even cut fourth-grade Teeth Vine. The danger of a fourth-grade Teeth Vine definitely was not lower than that of any ningmai expert. It was extremely hard to hunt and required the skilled handiwork of a professional hunter. To be able to preserve the shape of the Teeth Vine, the hunter needed to use jade knives to cut it, otherwise, the Teeth Vine would collapse and turn to dust.</p><br/><p>If this little section of fourth-grade Teeth Vine was placed in the Hundred Treasure Flying Pavilion, it could reach an astronomical price.</p><br/><p>But Zuo Mo definitely would not sell it.</p><br/><p>It was useful for him! He was going to make a sword formation!</p><br/><p>It wouldn’t be a big sword formation like the sword essence formation, but a convenient, easy-to-transport formation that he could keep with him at all times. In other words, he decided to make a set of flying swords that could set up a sword formation at any time!</p><br/><p>Zuo Mo had come up to the idea while he had been imprisoned in the big sword essence. From the moment the idea appeared in mind he was unable to sweep it away!</p><br/><p>The fight with Nan Ming Zi reminded him that in chaotic times, the first priority was keeping himself alive. The Desolate Wood Reef had the [Skyring Moon Chime Formation], so he had no worries here. But he could not always stay on the Desolate Wood Reef. If he didn’t have any power to keep himself safe, he would just be a fat sheep that would be torn to pieces.</p><br/><p>He had gained some experience when he had forged sword billets for Su, and inside the big sword essence formation, the idea had been continuously perfected in his mind.</p><br/><p>He had comprehended many things by personally experiencing the five different sword essences in the last half year. Even if it was less pure than the shibo, but there was no problem of copying it.</p><br/><p>Five kinds of sword essence, Second Shibo’s Ice Dragon, Sect Leader’s mountain, Third Shibo’s snow fox, Master’s vine, and Wu Ling Sanren’s Bagua.</p><br/><p>He had even considered which sword essences to use in the sword formation. He decided to replace Wu Ling Sanren’s Bagua sword essence with his own Li Water sword essence . The quality of the Li Water sword essence was far lower in quality than the Bagua sword essence, but he had a more profound understanding of Li Water sword essence and this would make the formation easier for him to control.</p><br/><p>However, no matter how good the idea was, he lacked materials.</p><br/><p>If he reforged the Water Drop sword, it could be used for the Li Water sword essence. However, Zuo Mo ran into difficulty with the four other swords. The mountain sword essence required an earth-attributed flying sword; the ice dragon sword needed icy materials; the snow fox sword essences needed things like fox claws or teeth; and the vine sword essence naturally required ling vines.</p><br/><p>Zuo Mo had went through the entire sect stores and hadn’t found one item that he was satisfied with to be used for the four types of materials that he needed.</p><br/><p>Now, to his surprise, he actually found a fourth-grade teeth vine on Nan Ming Zi’s body. How could he not be joyful?</p><br/><p>Translator Ramblings: Some of what Zuo Mo has learned in the half year he spent in the sword formation. Rather than learning one thing, and one thing only, he became even more of a jack of all trades.</p><br/><p>The more child formations there are, the more difficult it becomes so it wasn’t just setting up three * (seventy two child formations. ) Zuo Mo is an odd production xiuzhe that knows a bit of fighting. The other disciples are what production xiuzhe should really be like.</p><br/>\n</div>"}