{"title": "Chapter One Hundred and Eighteen Between Happiness and Grief", "id": 168, "volume": 2, "url": "http://boxnovel.org/world-of-cultivation-chapter-one-hundred-and-eighteen-between-happiness-and-grief", "volume_title": "Volume 2", "body": "<h1>Chapter One Hundred and Eighteen Between Happiness and Grief</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter One Hundred and Eighteen Between Happiness and Grief</p><br/><p>The yin fire bead flew forward from Zuo Mo’s hand, turning into a milky white thread of fire, and hit a broad tree that would need seven or eight people to circle it.</p><br/><p>The milky white flame spread on the ancient tree at an astounding speed. In a few seconds, the milky white flame had covered the entire tree, not even leaving behind a leaf. The tree, which had been bursting with vitality just seconds ago, was now lifeless. As the milky white flame passed, the green leaves instantly turned a chilling white. Quickly, the entire tree was white, and not a bit of green to be seen. The white old tree spread a pressuring chill. Snowflakes started to stir up around the surroundings.</p><br/><p>The white leaves started to break off from the tip, like it was being weathered, falling down.</p><br/><p>A burst of wind blew, the snowflakes danced, and countless white fragments left the old tree, carried by the wind.</p><br/><p>The enormous ancient tree, in front of Zuo Mo, turned to a cloud of white dust and disappeared in the wind.</p><br/><p>Zuo Mo was deeply shocked by what happened in front of him.</p><br/><p>Returning to the little yard, his mind was still slightly dazed. The yin fire bead was astoundingly powerful, as expected. If it had hit a person, Zuo Mo guessed that even those ningmai xiuzhe wouldn’t be able to block it.</p><br/><p>For a last resort life-saving measure, the more powerful it was the better!</p><br/><p>After that, he put all his energy into creating yin fire beads. With the aid of the Three-Turn fire formation, the process of making yin fire beads was extremely smooth. The yin fire beads that were created this time were different from last time. The entire bead was pure white and flawless, without any trace remaining of the yin bead. However, after Zuo Mo processed one yin bead, he needed to meditate to recover.The ling power and mental power used to create it was astounding; no wonder it was a weapon of great destruction.</p><br/><p>Looking at the twenty yin fire beads in his hands, Zuo Mo felt very confident.</p><br/><p>He occasionally would dream, if he threw these twenty yin fire beads out at once, what would it look like?</p><br/><p>Having yin fire beads, Zuo Mo didn’t care about not mastering the yin splinter. Strangely, Pu Yao seemed to have forgotten that he still owed him many yin fiends and didn’t urge him to go to the sword cave.</p><br/><p>Zuo Mo was happy to be idle but before he could enjoy the pleasure from having made the yin fire beads, after he inspected his ling power, his mood instantly dived down a cliff.</p><br/><p>Damn it!</p><br/><p>His cultivation actually stopped growing!</p><br/><p>Why was it like this? The sudden blow was like lightning on a clear day, striking him dumb, his head ringing. After the mo matrix had been carved, the rate of his cultivation progress had dramatically slowed. He had been worried, but had maintained his calm because his cultivation still had been growing.</p><br/><p>But if his cultivation stopped growing… …</p><br/><p>He didn’t dare to imagine it!</p><br/><p>After Pu Yao’s advice from before, Zuo Mo was extremely miserly with each bit of ling power inside his body. This had caused him to be extremely sensitive to ling power changes inside his body. He could find the slightest change.</p><br/><p>He was only in zhuji stage, it was the stage that cultivation should increase the fastest. He had spend large amounts of time everyday on practicing [Embryonic Breathing Spiritual Cultivation] in hopes that he could make it up. It was good if he just increased a little bit of ling power. It had been like he imaged before. Due to the mo matrix, the increase in ling power had been slow but his cultivation had still been tenaciously growing. However, for five continuous days, there hadn’t been one iota of change in his ling energy. He had never encountered a situation like this!</p><br/><p>Zuo Mo was nervous like he had never been before!</p><br/><p>If his ling power stopped growing, his cultivation would forever stop in zhuji! Terror spread through his heart. He ran into the sea of consciousness. Pu Yao was sitting on the gravestone with his eyes closed. No matter how Zuo Mo called him, he didn’t move. He was like a statue. Pu Yao was meditating. It wasn’t like he could ask the sect leader and the elders about this. He wouldn’t optimistically hope that Second Shibo and the others, who had become famous in the Yao Hunt, wouldn’t recognize the mo matrix.</p><br/><p>His cultivation paused in the stage of zhuji… …</p><br/><p>What about the dream? What would he use to search for the person that changed his features and erased his mind?</p><br/><p>It was like Zuo Mo had been robbed of all his strength, and collapsed on the ground. Ever since he learned his features had been changed and mind erased, he had continuously told himself to search for the answer to his dream, to search for the answer to why his mind and features had been altered. But when the conviction that had pushed him forward had been broken from its foundation, he didn’t know what to do.</p><br/><p>The sky was dark. He was lying on the rooftop, the sound tablet broadcasting beside him. His head was pillowed on his arms as he looked dazedly at the sky.</p><br/><p>His thoughts had floated far away. How long had it been since he had laid like this? After he had decided to search for answer, the times that he had just laid on the roof to listen to the sound tablet had decreased. Each day was filled with countless scriptures and spells that had to be practiced. Each day, he needed to tell himself repeatedly, he needed to work harder… …</p><br/><p>In the dark night, the stars were like an ocean.</p><br/><p>Exhausted, Zuo Mo was like a child, coiled into a ball, falling deeply asleep with the sound tablet broadcasting.</p><br/><p>There were no dreams.</p><br/><p>———</p><br/><p>The next day, the warm sunshine shone on his body.</p><br/><p>Opening his eyes, Zuo Mo felt his body was unspeakably relaxed. The depression of yesterday had been swept away. Thinking of his tragic perspective yesterday, he felt it was humorous. It was fine if his cultivation was not growing. As long as he tried, he would find the root of the problem. Having slept, his body was now filled with energy, filled with motivation.</p><br/><p>Without ling power, he still had spiritual power, formations, ling farming, dan-making, and forging!</p><br/><p>He inspected the ling power inside his body. As expected, it hadn’t changed at all. However, he didn’t have a tragic outlook now, but was extremely calm. After coming out of meditation, he slowly pondered and felt that he needed to determine the direction that he would take.</p><br/><p>After spending a short amount of time, he decided what he would focus on primarily – formations!</p><br/><p>To him, whose cultivation had stopped growing, the importance of formations had rose to an incomparable height. To solve the problem of the pause in his cultivation, he could not avoid formations. Now that he knew how to make formation disks, he could also use those attacking formation disks. Formations were also great aids to dan-making and forging. No matter what road he chose, it would need jingshi. How to make jingshi, it was a problem that Zuo Mo could not avoid.</p><br/><p>His spiritual power was different than his ling power and its progress hadn’t been affected at all, still increasing at a pretty good pace. It was a pity that he had such a treasure but didn’t know how to use it. The only uses he knew involving the consciousness was the consciousness stab and yin splinter. The power of the consciousness stab was too small. The power of the yin splinter was good but Zuo Mo gave up on it. The yin splinter required pure and dense yin energy. The only way that Zuo Mo could think of was using the yin bead. However, the yin bead was too outstanding and would easily bring a disaster down on him. As a life-saving measure, the yin splinter wasn’t as powerful and convenient as the yin fire bead.</p><br/><p>Other than that, he could still expect more from [Vajra Profound Sutra]. Zuo Mo decided to find a few spells that body xiu used to see if he could use something. He might be able to put some brainpower on formations. Last time the “Golden Flesh Clothing” coordinated with “Thirty Thousand Catty” had managed to stop two yin splinters directly.</p><br/><p>Hue hue, he could also consider using the “medicine-seal-style”! He could make the lingdan himself, he could also forge the talismans. As to the paper seals, he wouldn’t object to learning seal writing.</p><br/><p>The more Zuo Mo thought and clarified his thoughts, the more excited he got.</p><br/><p>The heavens would not shut off all roads. Without ling power, he still had many other paths.</p><br/><p>Reality proved that when a person was pushed to the edge of the cliff, they could also explode with potential.</p><br/><p>In the morning, Li Ying Feng opened the store door. Seeing Zuo Mo outside the door, she stopped and asked instinctively, “Shidi, why are you here again?”</p><br/><p>Zuo Mo made a sound, not knowing what to say. It looked like Li Ying Feng Shijie had really been frightened by the Inky Black Lotus seed incident from last time.</p><br/><p>Li Ying Feng instantly realized how inappropriate her words were and added, “Aren’t you attending the Sword Test Conference? Shouldn’t you be preparing for battle right now?”</p><br/><p>Zuo Mo spread his hands. “Our sect will have to depend on Eldest Shixiong. My bit of power isn’t enough.”</p><br/><p>Hearing this, Li Ying Feng frowned and said seriously, “Shidi, don’t underestimate yourself. Shidi had comprehended sword essence in zhuji. This kind of talent, other than Eldest Shixiong, no one in the sect can compare. Shidi cannot let yourself go, and not think about improvement.”</p><br/><p>Zuo Mo sweated. He knew Shijie was looking out for him but didn’t know how to explain. He could only say, “This brother isn’t slacking off, but a bit tight on the funds right now.”</p><br/><p>Li Ying Feng’s face was shocked. “Where did you spend your jingshi? You earned so much jingshi just recently, you used it all? How did you use it up?”</p><br/><p>Zuo Mo didn’t know what to say. He couldn’t tell Shijie that there was a bottomless hole hiding away in his consciousness that “ate” jingshi. Rationally, several thousand pieces of third-grade jingshi was an enormous sum for a zhuji xiuzhe. If this was in the past, he wouldn’t have even thought of it. Even in Dong Fu, it was an shocking sum. Right now, Zuo Mo was telling her that he spent all the jingshi. How could Li Ying Feng not be shocked?</p><br/><p>“Jingshi is never enough to spend.” Zuo Mo deflected as he widened his eyes to stare at his shijie.</p><br/><p>Unable to resist Zuo Mo’s nagging, Li Ying Feng consented to Zuo Mo’s request to open up for business again. Due to the reputation he had accumulated in the past, once Zuo Mo opened, many xiuzhe heard and came.</p><br/><p>Zuo Mo didn’t know that he had a small reputation with the production xiuzhe of Dong Fu. Especially when he had successfully cut the fourth-grade cold manget, and then the bomb of successfully processing the fourth-grade Inky Black Lotus seed. Zuo Mo’s control of fire had been exaggerated to the extreme.</p><br/><p>This time, Zuo Mo was open to payment through jingshi, talismans, and jade scrolls. Everyone welcomed it, and his business was busy.</p><br/><p>After a day, Zuo Mo didn’t look as exhausted as he once would have. He handed a jade scroll to Li Ying Feng. “Shijie, could you help me see how much jingshi for all these materials?”</p><br/><p>Li Ying Feng took the jade scroll and scanned it quickly. “About fifty pieces of third-grade jingshi. Hm, Shidi, you are interested in formations now?” There wasn’t anything high-grade on the list Zuo Mo provided. It was all first-grade materials. Fifty pieces of third-grade jingshi, it was enough to fill half of the yard. Li Ying Feng became even more curious how Shidi had spent the thousands pieces of third-grade jingshi from last time.</p><br/><p>“En, yes, formations are very interesting. This is fifty pieces of third-grade jingshi. Shijie, please help prepare it for me.”</p><br/><p>“No problem.” Li Ying Feng crisply took the jingshi. She knew the shops in Dong Fu almost as well as her palm. It wouldn’t take much effort to buy and gather those materials. As to cultivating, Shidi was more talented than her and certainly had his own plans.</p><br/><p>Translator Ramblings: I now have a FAQ page. Please read it and comment if you have any more questions.</p><br/><p>The mo matrix isn’t all that Pu said it to be. Poor Zuo Mo, he needs to earn jingshi to comfort his soul. Pity he can’t go sue Pu for false advertising. Zuo Mo is a pretty good optimist. Also, he’s the guy you want to be with if you’re stuck out in the wilderness without any tools. He’s very multi-purpose.</p><br/>\n</div>"}