{"title": "Chapter One Hundred and Twenty Seven – Everyone Is Troubled", "id": 177, "volume": 2, "url": "http://boxnovel.org/world-of-cultivation-chapter-one-hundred-and-twenty-seven-%E2%80%93-everyone-is-troubled", "volume_title": "Volume 2", "body": "<h1>Chapter One Hundred and Twenty Seven – Everyone Is Troubled</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter One Hundred and Twenty Seven – Everyone Is Troubled</p><br/><p>Wu Kong Hall.</p><br/><p>“What do all of you think?” Pei Yuan Ran asked the other people.</p><br/><p>Shi Feng Rong was the first to speak, “Other than Second Shixiong, no one else knows [Ice Dragon Sword Scripture]. The jade scroll had not been released before. With Zuo Mo’s cultivation, even if he got it, he could not have read it,” She said. She was the first person to speak up for Zuo Mo, her protective intentions were evident.</p><br/><p>Pei Yuan Ran smiled and said, “Shimei, don’t be nervous. You can’t just steal and learn [Ice Dragon Sword Scripture] even if you wanted to. I just saw that the boy was not obedient and wanted to scare him.”</p><br/><p>Xin Yan suddenly said, “It’s a pity.”</p><br/><p>Yan Le hurriedly asked, “What’s a pity?” The other two elders also looked at Xin Yan.</p><br/><p>“He must have comprehended the sword essence on his own. It has the beginnings of the tide. If he had kept going like that, it would not be hard to reach the creation of the dragon. It is a pity that he merged the Li Water sword essence with it. It looks like there is more transformations, but in reality, it has caused the sword essence to become impure,” It was rare that Xin Yan spoke so much.</p><br/><p>The expressions of the three people changed dramatically.</p><br/><p>“Shidi means that Zuo Mo has ruined it?” Pei Yuan Ran, who never showed his emotions, had a terrible expression had the moment. In reality, he knew that he didn’t need to ask that question. They were all sword xiu and understood the result of an impure sword essence.</p><br/><p>Xin Yan didn’t speak, but the three people that were familiar with him understood. The three of them became silent.</p><br/><p>All four of them were in a terrible mood. It would have been alright if they didn’t know Zuo Mo’s potential, but Zuo Mo’s talent was so amazing, yet he would not be able to progress further on the Ice Dragon Sword Scripture. For the four people who placed heavy importance on the legacy of the sect, it was a heavy blow.</p><br/><p>Pei Yuan Ran said dejectedly, “This is my fault. I was remiss in paying attention to him.”</p><br/><p>The hearts of the other three were also unwell. Of the four, Shi Feng Rong felt the worst. She had just been happy about Zuo Mo’s talent, but in the turn of an eye, she was informed that Zuo Mo would not progress further on the [Ice Dragon Sword Scripture].</p><br/><p>“Shixiong, is there really no way?” She bit her lips and looked at Xin Yan.</p><br/><p>“Unless he could remake his sword essence to purify it. However, what he would receive would be a new sword essence, not Li Water sword essence, nor Ice Dragon. How to progress that, we cannot teach him,” Xin Yan said heavily.</p><br/><p>Wu Kong Hall descended into silence.</p><br/><p>Just as everyone was blaming themselves, Xin Yan suddenly opened, “Since he could comprehend Ice Dragon sword essence on his own, he is very talented. It is not out of the question that he could remake his sword essence.”</p><br/><p>Shi Feng Rong suddenly lifted her head, eyes lighting up as the disappointment left her face, “Does Shixiong have a way?”</p><br/><p>Pei Yuan Ran and Yan Le were also uplifted. They all knew that Xin Yan was not talkative usually, but if he spoke of his own initiative, he would definitely have a way. Their eyes looked towards Xin Yan, waiting for him to continue.</p><br/><p>“If he could understand more sword scriptures, with his talent, it should not be difficult for him to remake his sword essence. He just needs to be taught more sword scriptures,” Xin Yan said solemnly, “However… …”</p><br/><p>“What is it?” Yan Le couldn’t stop himself from asking.</p><br/><p>“He doesn’t seem to be interested in cultivating the sword,” Xin Yan said.</p><br/><p>The three people stared at each other. They had been concerned about the problem of Zuo Mo’s talent and had missed the most important question. Zuo Mo was exceptionally talented, but he was the epitome of the frivolous disciple. His only habit was making jingshi. As to cultivating the sword… …</p><br/><p>When had he ever taken the sword seriously?</p><br/><p>But this person with no ambitions about the sword had a talent others would admire!</p><br/><p>Xin Yan’s words struck the other three elders dumb. If Zuo Mo didn’t want to practice the sword, they were concerned for no reason. The four of them were all sword xiu and knew very well how hard it was to cultivate the sword. At higher levels, other than difficulty, there was also danger. If the person’s own resolve was not strong enough, they basically could not achieve anything. In other words, unless Zuo Mo wanted to learn the sword himself, they could not force him to.</p><br/><p>The three couldn’t help but thinking how Zuo Mo saying he wanted to be smashed to death by jingshi.</p><br/><p>Pei Yuan Ran suddenly felt a headache come up.</p><br/><p>What a troublesome youth… …</p><br/><p>———</p><br/><p>Of course, Zuo Mo didn’t know that the sect leader was having a headache over him. He was soaking in the medicinal tub, celebrating for having overcome a calamity. The mo matrix on his body had not attracted the attention of the elders. He felt surprised and extremely lucky. When he inspected the mo matrix on his body, he was shocked to find that, at some unknown time, the mo matrix had hidden away under his skin.</p><br/><p>It was alright, alright… …</p><br/><p>The mo matrix hidden underneath his skin greedily absorbed the medicinal power, quickly fixing Zuo Mo’s body. He found that a benefit of the mo matrix was that it could quickly absorb ling power and medicinal power, and continuously strengthen his body. The fact that his [Vajra Profound Sutra] progressed so quickly was directly connected to his mo matrix.</p><br/><p>After soaking for a few days in the medicine, Zuo Mo found that his benefits in the sect had risen greatly. He was familiar with dan-making now and could recognize the general components of the medicinal fluid. He found the medicinal liquid he was soaked in contained many precious ling medicines.</p><br/><p>Zuo Mo’s mind automatically converted it to jingshi and jumped in fright. Each basin was really expensive!</p><br/><p>This didn’t seem like the style of the sect!</p><br/><p>Zuo Mo muttered inside but he quickly threw the question to the back of his mind because he thought about jingshi. This time, he had earned a lot. For him, three hundred pieces of third-grade jingshi was not a small sum. He had dared to put down so much, not because he had enough confidence, but because he had decided to spend all the jingshi before Pu Yao woke up.</p><br/><p>If Pu Yao woke up, he wouldn’t get one piece of jingshi no matter how much he had.</p><br/><p>The odds of Zuo Mo winning had been one to three hundred. Zuo Mo had wagered three hundred pieces of third-grade jingshi. In other words, his earnings was ninety thousand pieces of third-grade jingshi.</p><br/><p>Holy f***!</p><br/><p>Zuo Mo felt countless jingshi were floating above his head. His soul was floating.</p><br/><p>Ninety thousand pieces of third-grade jingshi. One fourth-grade jingshi was worth five hundred pieces of third-grade jingshi, then it was one hundred and eighty pieces of fourth-grade jingshi!</p><br/><p>Heavens!</p><br/><p>This was a gigantic sum!</p><br/><p>Supposedly, when Li Ying Feng had gone to take out this enormous sum, she had asked Eldest Shixiong to protect her the whole way. Luckily, Zuo Mo had told her to spread the wagers out, so no one had been plotting after it. But the worker at the casino that Wei Sheng had gone to wager at had a special expression when he saw Wei Sheng.</p><br/><p>When Li Ying Feng handed the jingshi to Zuo Mo, her hands were shaking.</p><br/><p>What Kun Lun introductory jade scrolls? All of that was thrown to the back of Zuo Mo’s mind. One hundred and eighty pieces of fourth-grade jingshi. What couldn’t he buy? Holding such a great sum, Zuo Mo did not need to fight at all. Wasn’t it just the Kun Lun introductory jade scroll? He only needed to notice who had picked this jade scroll and buy it from him.</p><br/><p>One hundred and eighty pieces of fourth-grade jingshi. Not just the Kun Lun beginner jade scroll. Zuo Mo felt that even if it was a normal Kun Lun fourth-grade spell, he could buy it.</p><br/><p>He made a lot! A lot!</p><br/><p>He had never been so wealthy before. At this time, Zuo Mo had just become an upstart, wanting to run to Dong Fu immediately to start shopping. Possessing such a great sum, he could almost sweep clean all the talisman and material shops in Dong Fu. Along with him, the casinos had also earned a lot. They were wishing that a battle like that would occur a few times each day.</p><br/><p>———</p><br/><p>In Wu Kong Hall, a cloud had formed.</p><br/><p>“It’s over!” Yan Le’s face was full of helplessness, “Now the boy has made such a big amount of jingshi. Not just cultivating the sword, I’m suspicious that he would just start eating and waiting for death from now on.”</p><br/><p>“How about we take the jingshi from him?” Shi Feng Rong said hatefully. She hated Zuo Mo’s lack of ambition and grieved over her unluckiness!</p><br/><p>“That’s not proper!” Pei Yuan Ran shook his head, “He earned it properly. If we take it away, how would we be different from robbers? By that time, we might force him into another sect.”</p><br/><p>The three were frightened.</p><br/><p>Right, any sect would compete for a disciple that was as talented as Zuo Mo. If nothing else, if they crossed the line, it would be reasonable that they could force Zuo Mo away. Even a strong person like Tian Song Zi who was on good relations with Wu Kong Sword Sect wouldn’t give up on him.</p><br/><p>“What should we do now?” Shi Feng Rong’s face was full of worry. Before, they had been discussing the possibility of bribing Zuo Mo since he was so miserly. But Zuo Mo had received such a fortune. Even Pei Yuan Ran and the others were jealous of such a large amount of jingshi.</p><br/><p>Without a doubt, Zuo Mo had become the richest person in Wu Kong Sword Sect!</p><br/><p>To bribe him with Wu Kong Sword Sect’s thin assets, it was not possible.</p><br/><p>Pei Yuan Ran couldn’t help but start rubbing his throbbing brow again.</p><br/><p>In the next few days, Zuo Mo floated as he walked. It was like he was stepping in cotton. There was only one question in his mind.</p><br/><p>How to spend this much jingshi?</p><br/><p>However, he didn’t have time to consider that problem anymore because it was time for Wei Sheng Shixiong’s match. Wei Sheng Shixiong’s opponent was a sword xiu called Zuo Lin. He was a strong sword xiu, halfway up in the various rankings.</p><br/><p>Having had a taste of gambling, Zuo Mo wanted to pull Li Ying Feng along to make some bets. But a frightened Li Ying Feng shook her head. She felt that her heart couldn’t tolerate wagering like this. Without any other way, Zuo Mo could only take Xiao Guo along to go bet at the big casinos.</p><br/><p>Zuo Mo had become famous in Dong Fu. The employees at the casino instantly recognized him.</p><br/><p>After going to two casinos, Zuo Mo could only let Xiao Guo go make the bets.</p><br/><p>If Zuo Mo was asked who he was most confident in, then it definitely would be Wei Sheng Shixiong! So he did not hesitate in his wagering. To avoid being detected, he was very subdued. However, he pulled Xiao Guo along to bet at every casino in Dong Fu, all for Wei Sheng Shixiong winning.</p><br/><p>However, the payout rate at every casino for Wei Sheng to win was very low. Everyone felt that Wei Sheng would win. Since the casinos were opened by those local factions, they all knew that Wei Sheng had caused an apparition when he entered zhuji.</p><br/><p>As expected, Wei Sheng Shixiong crisply defeated Zuo Lin and won.</p><br/><p>In this match, people had noticed that Wei Sheng was clearly more powerful than his opponent. After this fight, Wei Sheng was rocketed up in the rankings, easily getting into the top ten and became a candidate for winning.</p><br/><p>Even though the payout was not high, Zuo Mo had invested a lot. In this match, he had made a little profit of ten pieces of fourth-grade jingshi.</p><br/><p>As expected, if one had jingshi, it was easier to make jingshi. Zuo Mo sighed.</p><br/><p>Wei Sheng Shixiong had won and he had no further interest in the following matches.</p><br/><p>Even though his wounds had not fully healed, he was still trying to think of ways to spend the jingshi!</p><br/><p>Translator Ramblings: Zuo Mo doesn’t care but his lack of knowledge did him a disservice with his sword essence. Of course, he really doesn’t have that much talent so his hopes of actually progressing with the Ice Dragon Sword Scripture is not very high unless he is very motivated.</p><br/><p>Also, 180 pieces of fourth-grade jingshi!</p><br/>\n</div>"}