{"title": "Chapter One Hundred and Twenty Two – Bet", "id": 172, "volume": 2, "url": "http://boxnovel.org/world-of-cultivation-chapter-one-hundred-and-twenty-two-%E2%80%93-bet", "volume_title": "Volume 2", "body": "<h1>Chapter One Hundred and Twenty Two – Bet</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter One Hundred and Twenty Two – Bet</p><br/><p>Tao Zu Er, Yan Ming Zi, and Hu Shan were walking on the streets of Dong Fu. They liked being in busy places, and right now, what place in Sky Moon Jie was more busy than Dong Fu?</p><br/><p>Hu Shan rubbed his hands, and said with an excited expression, “Excellent. I’ve waited for so long. The stupid preliminary Sword Test Conference finally finished! Only the true competition is worth seeing!”</p><br/><p>Tao Zhu Er’s eyes were dazed, “Yes. Gu Rong Ping is too handsome! I think, in Sky Moon Jie, there isn’t a man more outstanding than him! I really like him!”</p><br/><p>Hu Shan stared at Tao Zhu Er inside for being a fangirl. He suddenly noticed that Yan Ming Zi seemed unfocused.</p><br/><p>“Old Yan, what are you thinking about?”</p><br/><p>Yan Ming Zi raised his head and focused. He gave a grimace. “I’m thinking about making jingshi!”</p><br/><p>“Making jingshi? You’re lacking for jingshi right now? I’ve got some right now. Do you want some?” Hu Shan said forthrightly. The three, because they had the same battle experience, became close friends.</p><br/><p>Yan Ming Zi shook his head, “Just bought a new flying sword. I’ve nearly spent all my jingshi. No rush, I can slowly make more. I’ll find you if I really can’t find a way.”</p><br/><p>“Oh, you bought a new flying sword? Quick, let us see,” said Tao Zhu Er, as she was instantly interested in the new sword.</p><br/><p>Yan Ming Zi took out a dark blue flying sword, “The Sword’s name is [Deep Ocean], it’s third-grade.”</p><br/><p>Hu Shan looked and then shook his head. “It can’t compare to your previous Water Drop sword.”</p><br/><p>“You’re just wasting words!” Yan Ming Zi rolled his eyes in exasperation. Hu Shan’s words stirred up the three’s hurt.</p><br/><p>Seeing the situation, Tao Zhu Er quickly changed the topic, “So what way did you think of making jingshi?” Of the three, Yan Ming Zi was of average power but the best at business.</p><br/><p>As expected, this question was Yan Ming Zi’s true love. He came the focus of attention, “Of course, it is the Sword Test Conference!”</p><br/><p>“Sword Test Conference? How do you make jingshi from that?” Hu Shan asked strangely.</p><br/><p>Yan Ming Zi patiently explained, “We can’t meddle in other business, but if we have spare money, and make a small bet, it wouldn’t be bad.”</p><br/><p>Hu Shan instantly became disinterested, and said scornfully, “You mean gambling, that’s not interesting.”</p><br/><p>Tao Zhu Er was actually interested. “Old Yan, don’t pay attention to him. Tell me more.”</p><br/><p>Yan Ming Zi became even more excited. “Gambling naturally is not anything good. But the Sword Test Conference is different from other gambling.”</p><br/><p>“How so?”</p><br/><p>“There might be luck in this Sword Test Conference, but the true determinant is power. There are patterns that can be found in this. A person’s strength, in a short period of time, wouldn’t change very much. Considering the conflict between different spells, the quality of the talismans, even though it is impossible to accurately decide the result of the match, but one can determine the general direction.”</p><br/><p>Hu Shan laughed, “Then how will you know other people’s strength? And their talismans?”</p><br/><p>Yan Ming Zi nodded, “This is the crux of the problem. It is very hard to determine power, but the non-local competitors have already fought a few times, and general guesses can be made. As to talismans,” he said proudly, “in this area, I have some experience.”</p><br/><p>“That’s true. Old Yan, you’re always good at picking talismans,” said Hu Shan. He admired Yan Ming Zi very much on this skill.</p><br/><p>“Hue hue,” Yan Ming Zi said smugly, “there are many kinds of wagers. Like the first match that’s been spread around so much, Zuo Mo versus Chao An.”</p><br/><p>“What’s there to gamble there? Of course Chao An wins!” Hu Shan said unconcernedly, “The Scalping Zombie might be strong, but his cultivation is just that. He definitely cannot win over ningmai experts!”</p><br/><p>“Exactly!” Yan Ming Zi agreed, but his direction changed, “But right now, what’s spread the most is this wager. Everyone is betting how many moves that Zuo Mo can take from Chao An.”</p><br/><p>“This bet works?” Hu Shan gaped.</p><br/><p>“Ha, the odds for three moves and under are pretty normal. After three moves, the odds explode,” Yan Ming Zi said.</p><br/><p>“Did you bet?” Hu Shan asked.</p><br/><p>“Oh, I put down for seven moves,” Yan Ming Zi said smugly, “the odds are one to sixteen.”</p><br/><p>“You feel he can endure seven of Chao An’s moves?” Hu Shan’s face was full of shock, “Chao An isn’t some little character. He’s the strongest disciple of Fort Chao. You have too much confidence in the Scalping Zombie!”</p><br/><p>Yan Ming Zi said in a deep voice, “How do you think Chao An compares to Chang Heng Shixiong?”</p><br/><p>“Naturally he cannot compare!” Hu Shan didn’t need to think before saying unhesitatingly, “Chang Heng Shixiong is very strong! Before, when he was in zhuji, he had defeated people in ningmai.”</p><br/><p>“Ah!” Yan Ming Zi was slightly shocked at the last part, “How come I didn’t know this?”</p><br/><p>Hu Shan unconsciously lowered his voice, “Not many people know this. Shixiong’s Blood Spider sword was obtained by killing someone! That’s why he was punished by the sect leader.”</p><br/><p>The other two instantly felt fearful shock.</p><br/><p>“It seems my jingshi won’t be wasted,” Yan Ming spoke. The first thing Yan Ming Zi thought about was his jingshi. He smiled and said, “Originally, the betting shouldn’t be this popular. However, Chao An was confronted with a wager. The other wagered a bottle of Dying Flowing Moon for Zuo Mo to make it through ten moves. That was what stirred everything up.”</p><br/><p>“Dying Flowing Moon… …,” Hu Shan’s expression was dazed as he muttered, “That’s such a waste… …”</p><br/><p>Tao Zhu Er, who hadn’t spoke, suddenly asked, “What’s the odds for Zuo Mo to win?”</p><br/><p>Yan Ming Zi jerked. “About one to three hundred,” He looked in shock at Tao Zhu Er. “You want to bet he’ll win? That’s not possible!”</p><br/><p>“Why not?” Tao Zhu Er said unconcernedly, “In any case, I’ll just wager a few jingshi. It will be an amusement. If Chang Heng Shixiong was in zhuji and could be defeated… …”</p><br/><p>Her words suddenly stopped, her eyes were focused. The other two people saw she didn’t continue and found it strange. When they saw her frozen expression and dazed eyes, they couldn’t help but follow her gaze. Then the two also froze.</p><br/><p>A person was walking towards them.</p><br/><p>Li Ying Feng looked at her shidi who was in the yard and shook her head. It hadn’t been anything important when Shidi had been arranged to fight first. She had felt that the sect leader had wanted Zuo Mo to gain some experience. But the bet about how long Zuo Mo could stay in the fight had suddenly spread everywhere.</p><br/><p>A person of unknown origins had publicly threw out a bottle of Dying Flowing Moon, wagering that Shidi could make it through ten of Chao An’s moves. It instantly caused a furor. Originally, no one had been interested in the match. But now, this match had become the most talked out and attractive match.</p><br/><p>Wasn’t that putting Shidi onto a fire to roast?</p><br/><p>Shidi had shut himself in the yard the past few days, and was working on something she didn’t know. She was extremely worried. Shidi should be practicing the sword some more, honing himself before the fight, even if it wasn’t effective, at least it would look good!</p><br/><p>In the time that Shidi had stayed at the store, she had never seen him practice the sword.</p><br/><p>Did he think he could win with those useless low grade formations? She naturally was not opposed to Shidi studying formations, but formations were more likely used in dan-making and forging. They were not very effective in fighting.</p><br/><p>At this time, he shouldn’t be working on formations!</p><br/><p>Wei Sheng travelled on the Splitting Rainbow as he landed in Dong Fu. He had gone back to Wu Kong Mountain and reported to the sect leader about the white-clothed male before rushing towards Dong Fu. Zuo Mo was in the first match. If he came late, he would miss Shidi’s match.</p><br/><p>As he entered Dong Fu, the bustling crowds on the street was a small surprise to Wei Sheng.</p><br/><p>Differing from Zuo Mo, Wei Sheng was full of interest towards the Sword Test Conference. A chance to spar with different kinds of experts, it was really rare. Just thinking about it, he felt his blood boil, and his desire for battle rise.</p><br/><p>He suddenly thought of Zuo Mo and couldn’t help but smile. With Shidi’s lazy personality, he definitely wouldn’t be interested in the Sword Test Conference. When he thought about Shidi’s unwillingness to compete, and his helplessness against the sect leader’s order, he felt it was extremely humorous.</p><br/><p>Shidi was very talented. It was a pity he was not interested in the sword. If this time, it could force him, it wouldn’t be a bad thing.</p><br/><p>Wei Sheng was an exceptionally pure sword xiu. When Zuo Mo had been focusing on ling farming in the beginning, he hadn’t felt anything. But when Zuo Mo’s talent in cultivating the sword was revealed, but he was obsessed with other things, Wei Sheng felt it was a great pity.</p><br/><p>Suddenly, he heard words from the surroundings.</p><br/><p>“How many moves did you bet?”</p><br/><p>“Three moves. Zhuji against ningmai. If he could make it through three, it will be the max.”</p><br/><p>“Oh, I don’t know what Wu Kong Sword Sect was thinking, sending a little zhuji guy to embarrass themselves.”</p><br/><p>“Yeah. I heard his main focus is dan-making. He shouldn’t be coming here!”</p><br/><p>A person argued, “It’s not certain he’ll embarrass himself. Dying Flowing Moon, who has it? A person that has Dying Flowing Moon, would they not have good eyes? From what I see, this Zuo Mo definitely has real skill!”</p><br/><p>“Real skill? Ha! Even if he has skill, he’s only in zhuji!”</p><br/><p>… …</p><br/><p>Wei Sheng’s expression became very ugly. He barely suppressed the impulse to beat up those people.</p><br/><p>Along the way, he heard many similar discussions.</p><br/><p>He strode to the doorway of a casino.</p><br/><p>“Hey, Mister, do you want to try out your luck? Dong Fu’s hottest betting match, wagering how many moves, extremely interesting… …”</p><br/><p>Wei Sheng prepared to speak when a voice came from behind him.</p><br/><p>“Take out all the jingshi you have right now.”</p><br/><p>Robbery? Wei Sheng paused and couldn’t help but turn around.</p><br/><p>The person speaking was a round faced man. There were two males and one female standing in front of him. The three of them seemed extremely frightened of the round-faced man, seem to be very timid in front of him. When the round-face man spoke, the three hurriedly took out all the jingshi they had.</p><br/><p>“Wager Zuo Mo wins,” The round-faced man said briskly.</p><br/><p>Yan Ming Zi couldn’t resist, “Chang Shixiong, this Zuo Mo… …”</p><br/><p>“En?” The round-faced man glanced at Yan Ming Zi. Yan Ming Zi’s heart jumped and the words that reached his mouth shrunk back. Hu Shan and Tao Zhu er were docilely standing with their heads down at the side. The two of them were cursing Yan Ming Zi inside.</p><br/><p>Old Yan, you dumbass. You don’t want to live, but don’t pull us along… …</p><br/><p>Wei Sheng looked with slight surprise at the round-faced man. This was the first he had heard that someone was betting Shidi would win. He noticed the clothing of the three people behind the round-faced man had the symbol of Ling Ying Sect. Didn’t Ling Ying Sect have a grudge against Shidi?</p><br/><p>Chang Shixiong… … Wei Sheng seemed to understand.</p><br/><p>The worker that was guarding the door looked at the four like he was looking at idiots. Seeing the jingshi in Yan Ming Zi’s hands, he couldn’t help but drool. He cursed inside. This group was really wastrels. If they had that much jingshi, give it to him, don’t throw it in the water!</p><br/><p>Of course, none of it showed on his face. He praised, “Sire’s eyes are very unique!” But he still hesitated, “All on Zuo Mo winning?”</p><br/><p>“Bet,” The round-faced man said.</p><br/><p>Taking the receipt, the round-faced male turned and left. Yan Ming Zi and the others exchanged a look and could only dispiritedly follow behind.</p><br/><p>“Really wastrels!” Once the round-faced man left, the worker of the casino seemed to have opened a flood, continuously talking to Wei Sheng, “Just look. Aren’t those people mental? From the time the betting started, no one has bet on Zuo Mo winning! They just aren’t thinking of jingshi as jingshi. What do you say, a zhuji defeating a ningmai, is there anything as hilarious as this? Wastrels, really terrible wastrels… …”</p><br/><p>He shook his head, saliva flying.</p><br/><p>“Fifty pieces of third-grade jingshi.” Wei Sheng smiled and handed over the jingshi.</p><br/><p>“Great. How many moves are you betting? Look here, this is the odds for each move… …”</p><br/><p>“Bet on Zuo Mo winning.” Wei Sheng kept on smiling gently.</p><br/><p>The worker was dumbstruck.</p><br/><p>Translator Ramblings: Guess what’s the hottest new thing about town? Just how badly Zuo Mo would lose!</p><br/>\n</div>"}