{"title": "Chapter One Hundred and Twenty Four Multiple Shadows and Intense Fire", "id": 174, "volume": 2, "url": "http://boxnovel.org/world-of-cultivation-chapter-one-hundred-and-twenty-four-multiple-shadows-and-intense-fire", "volume_title": "Volume 2", "body": "<h1>Chapter One Hundred and Twenty Four Multiple Shadows and Intense Fire</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter One Hundred and Twenty Four Multiple Shadows and Intense Fire</p><br/><p>A second-grade Path Confusion formation posed no risk to Chao An who was in the stage of ningmai.</p><br/><p>Poof.</p><br/><p>Like a bubble bursting, the light sound didn’t cause a ripple. The light surrounding Chao An changed slightly. The Path Confusion Formation couldn’t even endure the presence of the fireball beside Chao An and was instantly torn to bits.</p><br/><p>However, in that period of time, in front of Chao An, Zuo Mo had turned from one to five.</p><br/><p>“Multiple Ghost Shadows Seal!”</p><br/><p>Watching from the side, Yan Ming Zi and the others gaped and turned to look at each other.</p><br/><p>“Isn’t this Wang Shixiong’s medicine-seal-style?”</p><br/><p>“Such a wretched opening move!”</p><br/><p>“The core of the medicine-seal-style!”</p><br/><p>Standing beside the three people was Wang Shixiong. At this time, he was gaping with wide eyes, not knowing what to say. Last time, Zuo Mo had defeated him. Adding in the fact the wagering had been extra hot in Dong Fu, he had great interest about the scalping Zombie’s match, and had especially came to watch. Not just him, nearly all the disciples of Ling Ying Sect had come out, wanting to personally see the sorry outcome of the Scalping Zombie.</p><br/><p>It had always been Ling Ying Sect running to other sects and bullying other people. To be harassed at their own doors, and losing, Zuo Mo was the first one.</p><br/><p>It was an embarrassment, embarrassment!</p><br/><p>The Ling Ying Sect disciple gritted their teeth, wanting to go up, skin and strip the damned zombie, especially when they saw Zuo Mo was using Wang Shixiong’s medicine-seal-style. Instantly, the new hate and the old grudges merged.</p><br/><p>The spectators all shook their heads. Multiple Ghost Shadows Seal was very useful in the battles between low level xiuzhe, but facing a person higher than the user like Chao An, this move was not effective.</p><br/><p>Four illusions, one real person. The illusions had to be controlled by the real person. This was why the Multiple Ghost Shadows Seal was not used in higher level battles. Controlling the illusions meant that one had to split their attention and the difficulty of manipulation would increase. Those illusions were only useful for confusion others but did not do anything else.</p><br/><p>On the field, five Zuo Mo spread out.</p><br/><p>“Whoa!” A light suddenly rose in the eyes of Wang Shixiong.</p><br/><p>He was the creator of medicine-seal-style, and the Multiple Ghost Shadows Seal was his trademark opening move. He was way too familiar with this move! But with his eyes, he actually could not detect which of the five Zuo Mo was the real one!</p><br/><p>The movements of the five Zuo Mos were extremely synchronized. They continuously took out formation disks from the hundred treasures pouch at the waist and then furiously threw them into the field.</p><br/><p>In a second, the formation disks flew like rain into the field.</p><br/><p>How… … was it possible… …</p><br/><p>In a second, his expression froze. His mouth slowly dropped further but he didn’t realize it.</p><br/><p>He couldn’t tell… … still couldn’t tell… …</p><br/><p>Each Zuo Mo moved just the same as the real one. There was no stiffness, no place that they seemed fake. The other disciples might not understand the difference, but Wang Shixiong, who was so familiar with the Multiple Ghost Shadows Seal, how could he not understand the difficulty involved?</p><br/><p>The illusions created by the Multiple Ghost Shadows Seal would not move on their own. If they had to move, it must be controlled by the mind. With his skill, he could just control one illusion, and he had to leave the other three alone. The one illusion that he could control would definitely not be as realistic and detailed as what was happening now.</p><br/><p>Controlling four illusions at the same time, and could fight with such ease, how terrifying must his consciousness be?</p><br/><p>Unknowingly, sweat started to flow down his back and silently dripped down. He suddenly had a strong feeling this fight wouldn’t peacefully and easily finish.</p><br/><p>In Sky Moon Jie that was dominated by sword xiu, aids like the Multiple Ghost Shadows Seal were things that people ridiculed. But Wang Shixiong who had a deep knowledge of the Multiple Ghost Shadows Seal was very clear, if the user could accurately control every illusion, the useless Multiple Ghost Shadows Seal would become full of danger.</p><br/><p>No, it was actually terrifyingly dangerous!</p><br/><p>When it was impossible to distinguish the illusions using the naked eye, one had to use their consciousness to detect it. However, would the consciousness of a person who could control four illusions be weak?</p><br/><p>If one could not tell the true from the illusions and their spirit was not strong enough, then there was only one way… …</p><br/><p>This fight had attracted countless pairs of eyes, experts gathering around. They may not be as familiar with the Multiple Ghost Shadows seal as Wang Shixoing but their understanding of battle helped them see some clues. The underestimation on many people’s faces were swept away. They started to think, if they were facing an opponent who had five bodies, real and illusory, how could they deal with it?</p><br/><p>On the Lucky Cloud, Tian Song Zi saw Zuo Mo’s move and couldn’t help but praise, “Your sect’s Zuo Mo is really a good one. I heard Yu Bai say that he had comprehended sword essence when he was in lianqi. I hadn’t quite believed it, but seeing him now, he really is exceptionally talented!”</p><br/><p>Comprehended sword essence in lianqi? Once the words were spoken, the sect leaders on the Lucky Cloud all had shocked expressions!</p><br/><p>The heavens really loved Wu Kong Sword Sect too much! Having a genius that had an apparition when he entered zhuji, and hiding a genius that comprehended sword essence when he was in lianqi! Other than sighing, they couldn’t help but feel admiration and envy. Each of them had their own thoughts. The face of the Ling Ying Sect leader was extremely poor.</p><br/><p>Comprehended sword essence in lianqi? Shi Feng Rong, Xin Yan and the others stared at each other, their eyes filled with shock and surprise. They found that they hadn’t had a clue at all.</p><br/><p>Great, see how I’ll sort you out when we get back! The light jumped in Shi Feng Rong’s eyes and she burned with anger.</p><br/><p>Chao An could not distinguish the real Zuo Mo from the fake illusions.</p><br/><p>In the scriptures that he had practiced in Fort Chao, the spirit was the area that was the least important.</p><br/><p>Looking at the five Zuo Mo thrown formation disks into the field, he felt joy instead of anger. The more Zuo Mo showed he was strong, after he won, the better he would look.</p><br/><p>In reality, the strength that Zuo Mo was displaying now could be considered the top of zhuji xiuzhe.</p><br/><p>But, what you are facing is a ningmai xiuzhe. The distance between you and I is much bigger than you have imagined!</p><br/><p>Chao An gave a dark smile.</p><br/><p>It was true. He could not find which Zuo Mo was the real one. But, did he need to know which one was real?</p><br/><p>All the anger and humiliation that had accumulated in his heart was like molten lava flowing inside his body, burning his body, pain covering his entire body! His body became a strange red color as though he was made from boiling red metal. The specialty of Fort Chao, [Fiery Scripture], had reached its maximum.</p><br/><p>He wanted to use a method that no one could have any doubts about to win this battle. He wanted everyone to shut their mouths!</p><br/><p>His legs spread out slightly. Lowering his head, the gigantic fireball that was burning as it floated beside him suddenly bounced towards the sky.</p><br/><p>The spectators couldn’t help but raise their heads, their eyes tightly fixed on the soaring fireball. They all knew what was coming was Chao Ao’s full frontal attack!</p><br/><p>Seriousness came onto Wei Sheng’s face. He could feel the astounding power contained in that fireball. At his side, Xiao Guo and Li Ying Feng paled. Before, they had thought about the gap in power between the two people, but the confidence that Zuo Mo had displayed had made them feel that the gap was not as big as they thought. But now, they found that the gap was even bigger than they had imagined.</p><br/><p>In the sky far away, two people silently floated in the air and watched the fight.</p><br/><p>“Shimei is that confident in Zuo Mo?” Gu Rong Ping looked at the match and said slowly, “Fort Chao’s Fiery Hammer, strong on the offensive and weak on the defence but the power isn’t bad. If he gets to complete it, even I would have some trouble.”</p><br/><p>Su was floating beside him and said faintly, “We’ll know when they finish.”</p><br/><p>Gu Rong Ping gave a light chuckle, “It seems that Shimei has a lot of confidence in him. Oh, then I can have high expectations.”</p><br/><p>Su didn’t respond.</p><br/><p>Yan Ming Zi and the others were very nervous right now. Hu Shan directly asked Wang Shixiong, “Shixiong, what’s the situation?”</p><br/><p>Before he finished, Chao An shouted. Boom. His fisted hands suddenly crashed together in front of his chest.</p><br/><p>As his fists hit each other, the fireball in the sky suddenly exploded, turning into countless fist-sized fireballs, howling as they started falling down!</p><br/><p>The “Fire Rain Hammer” of [Fiery Hammer]!</p><br/><p>Swoosh swoosh swoosh!</p><br/><p>From nothingness, from low to high, the howls swept the field like a flood. Even the ground was trembling slightly. The xiuzhe that had been looking at Chao An like they were looking like a jade suddenly changed expressions!</p><br/><p>The light in Wei Sheng’s eyes grew as he stared at the field, the tendons in his hand protruding uncontrollably.</p><br/><p>The sect leaders on the Lucky Cloud didn’t have the attention to talk now, their eyes locked on the field. Shi Feng Rong’s expression changed slightly. Zuo Mo should not meet this move head on! A hint of remorse flashed through Pei Yuan Ran’s eyes. His original intention had been for Zuo Mo to have some experience. He hadn’t thought that Zuo Mo would land in such a dangerous situation. They had only thought that Zuo Mo had comprehended sword essence when he had been in zhuji so they hadn’t opposed him when Zuo Mo went to practice things like ling farming and dan-making.</p><br/><p>If they had known that this guy had comprehended sword essence when he was in lianqi… …</p><br/><p>If such a good sprout like this one was ruined on his hands, how could he face the ancestral masters? Pei Yuan Ran’s expression couldn’t help but change slightly. The faces of the others were also abnormally ugly. A cold light flashed through Xin Yan’s eyes. His right hand hidden in his sleeve, at some unknown time, was gripping a little sword.</p><br/><p>Only the sect leader of Ling Ying Sect had a joyful expression.</p><br/><p>Just as everyone was intimidated by Chao An’s “Fire Rain Hammer”, and lost their ability to talk, Wang Shixiong suddenly raised his head, the light in his eyes shining, as he couldn’t stop himself from shouting, “That’s not right… …”</p><br/><p>Yan Ming Zi and the others were startled awake by Wang Shixiong’s shout but didn’t have the attention to spare to ask. Their eyes couldn’t bear to move aside.</p><br/><p>At some unknown time, a patch of faint golden mist had rose. Those lights that were like golden sand, under the explosive rain of fire that was like a volcanic explosion, was so weak and inconspicuous.</p><br/><p>Gold Surge Formation!</p><br/><p>The mist that was like golden sand was all pure golden energy. Gold Surge Formation was a commonly seen gold element formation. It could nurture the vigorous gold energy. These vigorous gold energies didn’t have much power. Most of the time, it was activated before casting a gold element spell. It could increase the power of a gold element spell.</p><br/><p>Did he want to use a gold element spell? The spectators couldn’t help but shake their heads. The attributes of gold were vigor, strength and breakage. Along with fire, it could deal the greatest damage out of the five elements. But of the gold element spells that a zhuji could use, they really couldn’t think of one that could stop Chao An’s “Fire Rain Hammer.”</p><br/><p>Some perceptive xiuzhe that were also knowledgeable in formations found an abnormality. Was this Gold Surge Formation second or third-grade? Such a big patch of golden mist, it didn’t seem like something a second-grade Gold Surge Formation could form. But if it was a third-grade Gold Surge Formation, it could not form in such a short amount of time.</p><br/><p>Seeing the fire hammer in the sky about to land, this patch of golden mist changed again.</p><br/><p>At this time, no one was concerned with the change in the gold mist. Everyone was closely watching the five Zuo Mo on the field. They wanted to see how Zuo Mo would respond!</p><br/><p>“That’s not correct… …” Wang Shixiong’s expression was frozen as he stared at the field, unconsciously muttering. Without noticing, his face was full of sweat and his eyes were full of deep disbelief!</p><br/><p>Translator Ramblings: The sect elders find out Zuo Mo concealed something! I don’t want to spoil anything so no commentary on anything else in this chapter until the fight is over.</p><br/><p>Thanks for all your comments!</p><br/>\n</div>"}