{"title": "Chapter One Hundred and Thirty Eight – Aggravation and Pleasure", "id": 188, "volume": 2, "url": "http://boxnovel.org/world-of-cultivation-chapter-one-hundred-and-thirty-eight-%E2%80%93-aggravation-and-pleasure", "volume_title": "Volume 2", "body": "<h1>Chapter One Hundred and Thirty Eight – Aggravation and Pleasure</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter One Hundred and Thirty Eight – Aggravation and Pleasure</p><br/><p>Yu Bai had not found Zong Ming Yan. That slightly disappointed him. He suddenly noticed, not far away, there stood a golden armored soldier. He recognized it as a seal soldier. The fact that Zuo Mo had challenged Ling Ying Sect was not known by the non-locals, but it had spread widely in Dong Fu locally. Naturally, one piece of important information had been Zuo Mo had taken a seal soldier, so Yu Bai knew of it.</p><br/><p>He hadn’t thought that Zuo Mo would be so close to him.</p><br/><p>Yu Bai shook his head. He didn’t have much interest in Zuo Mo. Even though the other had displayed outstanding talent, Yu Bai looked down on doing something such as bullying a zhuji xiuzhe. His Master and Wu Kong Sword Sect were on good relations. He was not willing to disrupt this kind of friendly relationship.</p><br/><p>He was even considering, that if there was the chance, he would help Zuo Mo out.</p><br/><p>But, very quickly, he did not have the attention to spare to think about this question because he saw a great enemy. A large man holding a gigantic sword the size of a door, stomping heavily as he neared. The other had already noticed him. Yu Bai could feel the other nearing, as his presence was quickly rising.</p><br/><p>Nan Men Yang, the brightest grassroots xiuzhe in this Sword Test Conference. This extremely large figured man was extremely talented. Practicing the second grade [Vajra Scripture] and using the second-grade [Mountain Breaker Sword] combined for astonishing power. Because he belong to no family or sect, he quickly became the piece of jade that all sects were vying for. The benefits each sect offered him quickly rose. According to those familiar, Gu Rong Ping had represented Heart Lake Sect to give an invitation. Other than that, almost all the large sects had made an offer.</p><br/><p>He was only twenty four years this year, his potential seemed limitless.</p><br/><p>Nan Men Yang was the largest xiuzhe in the Sword Test Conference. His height of one zhang made him look like a moving mountain. All the muscles on his body were hard and powerful, the hard curves carved as they gave off the special faint gold light from the [Vajra Scripture], a presence that pressured others and suffocated them.</p><br/><p>His strides were long, steady, and heavy, and one couldn’t help but feel the ground was shaking as he walked.</p><br/><p>———</p><br/><p>Zuo Mo felt the vibration of the ground and raised his head. However, due to the dense foliage of the trees, he couldn’t see the figure of Nan Men Yang.</p><br/><p>After muttering a few words, he continued his work.</p><br/><p>Three zhi long metal nails glowed with a cool blue light. Barely visible were the patterns of formations that covered the entire body of the nails.</p><br/><p>Zuo Mo spat into his palms and raised the large metal hammer, channeling [Vajra Profound Sutra] as he pounded the metal nail into the ground. In total, there were nine large metal nails that were hammered into the ground by Zuo Mo according to specific locations. They formed the beginnings of a formation. After the hammering, Zuo Mo didn’t wipe his sweat away as he stood at the center of the formation, his fingers flying as he spat out a string of rushed notes.</p><br/><p>The cool blue light started to spread from the nine metal nails into the surroundings. In the blink of an eye, with Zuo Mo as the center, a circle with radius of thirty zhang was completely dyed with blue light.</p><br/><p>Zuo Mo suddenly shouted, “Set!”</p><br/><p>The blue light that had been spreading instantly stopped. They brightened and then disappeared.</p><br/><p>Zuo Mo released the ling power on his hands, collapsing onto his behind on the ground as he panted. Oh dear, this [Nine Metal Earth Formation] might not be a high-grade formation but it really used up a lot of ling power. [Nine Metal Earth Formation] was a second-grade formation. It only had one ability, it turned all the earth within the area of the formation as hard as metal, preventing enemies from attacking from below the earth.</p><br/><p>After solving the problem of defending the earth, the next he had to solve was defending against the sky.</p><br/><p>This time, Zuo Mo chose to use the [Dragon Tying Formation]. If a ningmai xiuzhe was trapped by the [Dragon Tying Formation], they usually couldn’t get out quickly. What Zuo Mo needed was just that little amount of time. Out of caution, Zuo Mo set down six [Dragon Tying Formation], almost covering all angles.</p><br/><p>———</p><br/><p>Not everyone’s eyes were fixed on Wei Sheng and Gu Rong Ping. Some people were noticing every single one of Zuo Mo’s actions.</p><br/><p>“What does he want to do?” Yan Ming Zi dazedly asked Hu Shan.</p><br/><p>Hu Shan was also gaping. He woodenly shook his head. “Don’t know… …”</p><br/><p>“Is he trying to build a cave residence there?” Tao Zhu looked as though she had seen a ghost. “This this this… …”</p><br/><p>At the place that the disciples of Wu Kong Sword Sect were gathering, everyone’s expressions became extremely strange.</p><br/><p>“Zuo Shidi’s thinking… …” Li Ying Feng’s face was red, and she forced out, “extremely unique!”</p><br/><p>Xiao Guo’s eyes were full of stars, extremely admiring. “Shixiong is very strong! To be able to think of such a powerful method! Too powerful!”</p><br/><p>The expression of the disciples that heard this became even stranger.</p><br/><p>“So embarrassing!” Yan Le sighed, covering his head, not bearing to look. “We are sword xiu… …”</p><br/><p>Shi Feng Rong’s face was black. “When he comes back, we need to sort out this rascal! He really humiliated us Wu Kong Sword Sect to the ground!”</p><br/><p>The cold light in Xin Yan’s eyes were like the dance of countless blades. His voice seemed to come out of a deep glacier, so cold that people’s hearts shook. “I’ll teachhim what a sword xiu is!”</p><br/><p>Pei Yuan Ran, who had the greatest experience in keeping his composure, felt his face was extremely red. He seemed to hear the memorial tablets of the ancestral masters in Wu Kong Hall were all jumping, the ancestral masters beating their chests and stomping their feet.</p><br/><p>“Embarrassment, embarrassment… …”</p><br/><p>“So humiliating, so humiliating… …”</p><br/><p>“You unfilial disciples, I… … I need to climb out… …”</p><br/><p>… …</p><br/><p>Pei Yuan Ran felt as though his entire body was freezing. As he looked at the Zuo Mo in the mirage happily setting up his formations without a hint of stopping, his breath choked at his throat. His face was suffocating so much it was red, his fingers trembling.</p><br/><p>Just at this time, he heard Xiao Guo’s innocent voice.</p><br/><p>“Why says that Shixiong is an embarrassment? Shixiong’s formation looks very powerful!”</p><br/><p>Pei Yuan Ran felt his vision turn black. He almost fainted.</p><br/><p>At least, there is Wei Sheng. He comforted himself like this.</p><br/><p>———</p><br/><p>Wei Sheng and Gu Rong Ping’s battle quickly reached the climax.</p><br/><p>The tip of the main peak soared over the other mountains, clouds occasionally floating past the body of the mountain.</p><br/><p>No one would have thought that Wei Sheng could display such power. Based just on the level of cultivation, Wei Sheng definitely had no hope of winning. However, real battle did not mean that those of the higher cultivation stage would win. But even if Wei Sheng lost this fight, no one would ever doubt his strength again. Even if Gu Rong Ping won, the title of the Strongest among the younger generation of Sky Moon Jie would still be Wei Sheng.</p><br/><p>Gu Rong Ping was also clear about this, so his expression was very ugly, ugly like it had never been before.</p><br/><p>He had never thought that anyone in the younger generation would surpass him. Maybe there was, but certainly not in Sky Moon Jie.</p><br/><p>Who was Wei Sheng? Where was Wu Kong Sword Sect? A few months ago, who even knew?</p><br/><p>A person who had been unknown suddenly took away the halo around him, and had done it in front of this many people. Hate slid across Gu Rong Ping’s eyes. His sword presence became increasingly vicious.</p><br/><p>But the elders that were watching all shook their heads and sighed. Gu Rong Ping’s Heart Lake Sword was based on the heart as a lake, clear and without waves. But right now, Gu Rong Ping’s sword presence was full of viciousness. Compared to the emptiness previously, even though the power looked to have increased, but in reality, he was losing.</p><br/><p>Facing Gu Rong Ping’s sharp sword presence, Wei Sheng had no thoughts of retreat. His square face and thick brows were miles away from Gu Rong Ping’s handsomeness and elegance. Yet the steady square face, at this time, had a different kind of charisma.</p><br/><p>Only those jindan experts with their keen eyes could sensitively catch the doubt that occasionally flashed through his eyes. That was the chaos and unsteadiness of the stage of Heart Turn Sword Essence.</p><br/><p>Some of the elders and sect leaders took the chance to teach the disciples beside them what was Heart Turn Sword Essence.</p><br/><p>Originally, Wei Sheng, with his unsteady situation, was not expected to win against Gu Rong Ping. However, Gu Rong Ping had lost his equilibrium, and did not give Wei Sheng enough of a threat. What Wei Sheng was now relying on was [Void Sword Scripture]!</p><br/><p>The long-lost sword scripture [Void Sword Scripture] finally showed itself in his hands. Even Pei Yuan Ran and the others didn’t look away. The experts that were watching felt an unparalleled shock!</p><br/><p>Sixth-grade sword scripture, this was the best sword scripture in Sky Moon Jie without a doubt!</p><br/><p>Gu Rong Ping felt extremely uncomfortable.</p><br/><p>Wei Sheng’s sword moves seemed to be intangible and invisible. It was untraceable, and what made him want to spit blood the most was the other’s sword essence! It was clearly a tangible and sharp sword essence, but upon impact, it was like hitting empty space, as though that sword essence was a mirage rather than tangible. But if he did not pay attention to it, there would definitely be countless more holes on his body.</p><br/><p>Gu Rong Ping had never fought as uncomfortably as this.</p><br/><p>The other’s sword essence was really too strange. It really was out of the norm!</p><br/><p>What he cultivated was [Heart Lake Sword Scripture]. It was the secret of Heart Lake Sword Sect and was ranked high in fifth-grade. Did the other’s sword scripture have a higher grade than [Heart Lake Sword Scripture]?</p><br/><p>Impossible! A backwater little sect, how could it have a sword scripture over fifth-grade?</p><br/><p>Gu Rong Ping tightened his jaw, staring at Wei Sheng, the sword presence rising.</p><br/><p>Since he could not understand, then he wouldn’t understand!</p><br/><p>Gu Rong Ping resolved his heart.</p><br/><p>———</p><br/><p>“Our sect’s [Void Sword Scripture] is as wondrous as expected!” Rather than the aggravation as he looked at Zuo Mo, Yan Le’s face was light as he watched Wei Sheng’s fight.</p><br/><p>Xin Yan didn’t have the attention to talk. His eyes were opened wide as he stared at Wei Sheng unblinkingly.</p><br/><p>Pei Yuan Ran’s eyes were dazedly looking in the distance, muttering, “Master, this disciple has not failed… …”</p><br/><p>[Void Sword Scripture] had always been a sickness on his heart. Now that it could see the light of day again, he was naturally very excited. The four elders of Wu Kong Sword Sect were skilled and had found fame in Yao Hunt, but were willing to lurk in Dong Fu. It had all been for this, for the succession of the sect. Now that there was a disciple of limitless potential like Wei Sheng and [Void Sword Scripture] had been restored, his heart was beating rapidly.</p><br/><p>Such a situation, everyone understood that Wu Kong Sword Sect would definitely become one of the top sects in Sky Moon Jie!</p><br/><p>In possession of such a wondrous sword scripture, and having a disciple of unparalleled talent, Wu Kong Sword Sect could not be stopped.</p><br/><p>Some with nimble minds started thinking about reacquainting themselves with this sect that had appeared out of nowhere. And other people, like the sect leader of Ling Ying Sect, had a terrible expression. If Wu Kong Sword Sect had been a power unable to be dismissed before, then the present Wu Kong Sword Sect would squeeze into the top ranks of the Sky Moon Jie sects. Ling Ying Sect had already lost the qualification to compete with them.</p><br/><p>At this moment, Wei Sheng was like the sun that was burning in the sky, releasing rays of unparalleled bright rays. All the other competitors were like the stars beside the sun, completely diminished and dark.</p><br/><p>Zuo Mo did not know anything about these situations. All of his focus was on the formation in front of him.</p><br/><p>He wiped away the sweat on his face, and started to create the most important part of this formation group.</p><br/><p>–– [Skyring Moon Chime Formation]!</p><br/><p>Translator Ramblings: Semi-reaction chapter. Yu Bai is too nice of a person, and also underestimates other people. Pei Yuan Ran is … … I feel this little arc could also be called “How to piss off all your teachers.”</p><br/>\n</div>"}