{"title": "Chapter One Hundred and Forty One – Zong Ming Yan VS Zuo Mo", "id": 191, "volume": 2, "url": "http://boxnovel.org/world-of-cultivation-chapter-one-hundred-and-forty-one-%E2%80%93-zong-ming-yan-vs-zuo-mo", "volume_title": "Volume 2", "body": "<h1>Chapter One Hundred and Forty One – Zong Ming Yan VS Zuo Mo</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter One Hundred and Forty One – Zong Ming Yan VS Zuo Mo</p><br/><p>Zong Ming Yan’s face was dark. Seeing Wei Sheng and Gu Rong Ping’s battle with his own eyes, and the power the two showed that was clearly a notch above him. The proud him really did not feel very good seeing the fight.</p><br/><p>In a terrible mood, he threw away all concealment, the sword essence on his body vibrating as he waited for some idiot to land on his hands.</p><br/><p>Zong Ming Yan, as the first seat disciple of Dong Qi Sword Sect, the beloved disciple of Zuo Mei Tian, was not weak. Now that he was not disguising it, his presence revealed, most xiuzhe turned and left upon seeing him. Those that had some power were also not willing to use up their ling power this quickly. Everyone knew the earlier they used up their ling energy, the faster they would be eliminated. This round was not just testing strength, but patience.</p><br/><p>He heard sounds of fighting in the distance, snorted and headed over.</p><br/><p>Nan Men Yang’s body was glittering with gold light, hand holding an enormous sword, eyes bulging, as his mountain-like figure moved ferociously. Not far from him, Yu Bai was dressed in white. Even though his demeanor was not as extraordinary as Gu Rong Ping, he was also warm and elegant. His long bamboo-like sword danced around him, battling the other to a standstill.</p><br/><p>The two of them were very strong, especially Nan Men Yang’s [Mountain Breaker Sword]. It was extremely forceful and domineering. Each blow howled like thunder, as though it really had the power to break mountains!</p><br/><p>———</p><br/><p>The elders and sect leaders of each sect that watched their battle all sighed in admiration.</p><br/><p>“This Nan Meng Yan is extremely talented. Just a second-grade [Mountain Breaker Sword] is this powerful in his hands! If this boy works hard, he will definitely become an expert!”</p><br/><p>“Right! Who can take him into the sect, will have another expert!”</p><br/><p>… …</p><br/><p>In reverse, no one was surprised at Yu Bai’s strength.</p><br/><p>Wu Kong Sword Sect’s elders also noticed Nan Men Yang, the brightest non-sect xiuzhe of this Sword Test Conference.</p><br/><p>“Shixiong, this boy really isn’t bad! Should we also consider making an offer?” Yan Le didn’t bear to tear his eyes away, as though he had seen a treasure.</p><br/><p>Pei Yuan Ran pondered for a while and shook his head helplessly, “This boy is full of potential, but you know our assets as well as I do. Wei Sheng is just enough for us to deal with, and we have Zuo Mo who is even more of a headache. Luo Li had improved greatly, and his personality is much better than before. If we nurture him well, his future will also be bright.”</p><br/><p>When other people were having a headache over not having talented disciples in the sect, Pei Yuan Ran was being troubled by having too many talented disciples.</p><br/><p>“Our wealth isn’t that big of a problem. After this Sword Test Conference, I’m afraid we cannot stay low like we did previously. We should fight for what we need. These years, I’ve been very uncomfortable being suppressed,” When Yan Le said this, he was full of bravado.</p><br/><p>Pei Yuan Ran grinned, the light in his eyes flashing.</p><br/><p>Xin Yan suddenly inserted, “There’s no scripture suited for him.”</p><br/><p>Only now did they think about this crucial problem. Yan Men Yang was really talented, but that depended on the scripture he practiced. Even though [Vajra Scripture] and [Mountain Breaker Sword] was only second-grade, but because it was suited to him, it was extremely powerful. If the scripture was not suited, then it was hard to say how far he could cultivate.</p><br/><p>Those with experienced eyes could see with a glance that Nan Men Yang was a xiuzhe that needed special scriptures.</p><br/><p>Shi Feng Rong suddenly said, “Isn’t Zuo Mo practicing [Vajra Profound Sutra]? Why don’t we let him also practices [Vajra Profound Sutra].”</p><br/><p>Pei Yuan Ran grimaced,“[Vajra Profound Sutra] is just a normal third grade body cultivation scripture. Many sects have this scripture. We really cannot offer anything of substance. Alright, we shouldn’t pull him over and then waste his talent. That will be our crime.”</p><br/><p>The other people fell silent. None of Wu Kong Sword Sect’s sword scriptures were very suited for Nan Men Yang, so they gave up on the thought.</p><br/><p>“Hm,” Yan Le suddenly pointed at the mirage and said, “Isn’t that boy Zong Ming Yan. He’s very near that rascal.”</p><br/><p>The others might have many opinions of Zuo Mo, but he was still a disciple of their sect. Hearing this, they followed Yan Le’s finger.</p><br/><p>But when their eyes saw where Zuo Mo was, they were instantly angered.</p><br/><p>The sparkling five mu of formations had been eye-catching enough already. But in this short period of time, the formation belt that spread to twice that area, taking over ten mu!</p><br/><p>What was the guy trying to do? That was the first though that jumped into their head. The second thought was, that was it! They really lost face this time!</p><br/><p>The previous five mu of formations had just been a little pieces of land among the large green mountains. Right now, it was a glowing big patch. Zuo Mo was passing through the formations, not knowing exhaustion. If one looked closely, they could find the pride and excitement that could not be disguised by his face.</p><br/><p>If they knew how to lip-read, they could easily know what he was muttering.</p><br/><p>“Fighting with ge, kill you!”</p><br/><p>“Can’t beat you in cultivation, ge will use jingshi to smash you to death… …. Who who who said that jingshi can cause people to bow… … bow to ge!”</p><br/><p>“I’m very poor, but I’m very wretched… …”</p><br/><p>… …</p><br/><p>But lip-reading was not a profound skill. There were many people that knew how to do it. Occasionally, people would burst into laughter.</p><br/><p>The four elders felt that in this Sword Test Conference, their already fragile spirits were greatly tortured. Whenever someone beside them laughed, they would be paranoid in feeling that those people were laughing at them. They became four easily alarmed birds.</p><br/><p>The heavens take pity!</p><br/><p>The honored sect leader of Wu Kong Sword Sect! Ice Dragon Sword of a vicious reputation! Even Yan Le and Shi Feng Rong were jindan experts! They were actually tormented by a zhuji disciple to the point of wanting to die. They were almost driven into insanity!</p><br/><p>———</p><br/><p>Zong Ming Yan was truly heading for Zuo Mo. He had actually wanted to fight with Yu Bai, but since Yu Bai was locked in fierce combat with Nan Men Yang, he naturally could not interfere.</p><br/><p>For them, stooping to using low tactics to win was not a honorable thing. No matter if it was Yu Bai or Zong Ming Yan, they were extremely proud. They definitely could not tolerate themselves winning because they took advantage of someone else. So Zong Ming Yan could only change his target.</p><br/><p>The seal soldier’s head that was a length above the trees was like a lighthouse glowing in the dark, attracting Zong Ming Yan to come closer.</p><br/><p>———</p><br/><p>“Now that’s something interesting to see! Zong Ming Yan meeting the Scalping Zombie!”</p><br/><p>“It’s karma! I hate people who use jingshi to smash others the most!”</p><br/><p>“He’s losing the face of us Dong Fu sword xiu! Zong Ming Yan, ge supports you! Get him down quickly, he’s too much of an embarrassment! The shame of Dong Fu!”</p><br/><p>Hearing the consensual indignation of the Dong Fu sword xiu, Pei Yuan Ran and the others wanted to clap in agreement.</p><br/><p>“Huff!” Yan Le exhaled deeply, “This is great! He finally can’t keep going!”</p><br/><p>It was as though a heavy weight had been lifted off Pei Yuan Ran’s shoulders, “It’s not embarrassing to lose to Zong Ming Yan.”</p><br/><p>Xin Yan gave his rare agreement, “Die early to be reincarnated!”</p><br/><p>The three of them had the same opinion, hoping that Zong Ming Yan could quickly finish the fight. That way, Zuo Mo would have less time to embarrass everyone. Now, they felt that it was the stupidest decision of their lives to make Zuo Mo attend the last round of the Sword Test Conference. Wei Sheng had earned the sect lots of praise, but it was far from the amount that Zuo Mo embarrassed the sect by. They really lost.</p><br/><p>Only Shi Feng Rong didn’t feel that great, “Why is it Zong Ming Yan? I don’t like Zuo Mei Tian, he’s an old bandit!” She suddenly turned her face,“Wei Sheng should go and kick Zuo Mo out!”</p><br/><p>Pei Yuan Ran pondered it., “Fighting among the sect, that might not be good!”</p><br/><p>Yan Le gave an idea from the side, “Let Zong Ming Yan first kick Zuo Mo out, then let Wei Sheng kick Zong Ming Yan out!”</p><br/><p>Xin Yan, who had been silent, suddenly opened, “Splendid!”</p><br/><p>At the doorway to every casino, a wagering match of Zuo Mo facing Zong Ming Yan was quickly put up. The shopkeepers doing their best to holler.</p><br/><p>“Shaking all of Dong Fu, a wager of ten moves! The most unpopular choice of the last two rounds, can the zombie do it again? It will be revealed very soon! A world-shattering wager, if you do not personally participate, how could your life be perfect?”</p><br/><p>“Come look, come see! Strong sword versus strong shield! What? No shield? Heavens! Sire, look, is there a stronger, more turtle-like shield than this? This is certainly this year’s strongest turtle formation! Look at what Mister Zuo Mo had named his work! Complete Formation Territory Defense style! Just this extremely strong name, full of the feeling of security, it is worth you betting on it!”</p><br/><p>“The odds are one to five hundred! What? You still aren’t satisfied? This one can personally guarantee that there wouldn’t be a payment rate better than this! Think about it, last time, our wonderful Zuo Mo had been the main actor of a sky-shattering wagering match. Think about the people that had won so much! My neighbor Wang Xiao Er’s aunt’s son had just put down ten pieces of jingshi… …”</p><br/><p>Fu Jin’s eyes were red as he wagered all the jingshi on his body, muttering to himself, “It’s not that I favor you. This is a grudge between me and Dong Qi Sword Sect!” The worker at the casino who heard this felt his heart shudder. Dong Qi Sword Sect was a large sect in Dong Fu.</p><br/><p>Fu Jin recognized Zong Ming Yan! .It was during that incident, he had been injured by Zong Ming Yan and another Dong Qi Sword Sect disciples. It was also that time that Zuo Mo had stood up for him, and his relationship with Zuo Mo had deepened.</p><br/><p>His eyes were entirely red as he bit his lips tightly, afraid for Zuo Mo.</p><br/><p>He had naturally heard of Zong Ming Yan’s strength. Adding on that the two people had once had a conflict, Zong Ming Yan definitely wouldn’t have mercy.</p><br/><p>Zuo Mo’s consciousness was better than others and quickly found Zong Ming Yan. Zong Ming Yan’s steps were not fast. Step by step, he headed towards Zuo Mo. Truthfully, Zuo Mo wanted to run. He might have some hope of victory against the average xiuzhe, but against experts like Zong Ming Yan, there wasn’t a chance at all.</p><br/><p>The biggest flaw of the Formation-Defense-style he was proud of finally revealed itself. That was, once it started, other than guarding it to the death, there wasn’t any other way.</p><br/><p>The two did not have a happy previous encounter. Due to him, a Dong Qi disciple had been banned from Dong Fu.</p><br/><p>Fine, if he couldn’t escape, he wouldn’t! Zuo Mo boldened his heart. If he decided to fight, there was a bit of presence.</p><br/><p>Wasn’t it just Zong Ming Yan?</p><br/><p>He looked at the surroundings. The glittering materials were like the sparkling jingshi, glowing with an enchanting light that blinded him.</p><br/><p>Courage rose in his heart.</p><br/><p>Ge could use jingshi to smash down Pu Yao who called himself a Sky Yao. You’re just a ningmai beginner, ge doesn’t believe ge can’t drown you!</p><br/><p>Translator Ramblings: Zuo Mo’s not perfect, and his tactics still need work. Zuo Mei Tian is Zong Ming Yan’s master that was mentioned a long time ago. He never shows up, he’s just always mentioned.</p><br/>\n</div>"}