{"title": "Chapter One Hundred and Forty Three “Heavyweight News”", "id": 193, "volume": 2, "url": "http://boxnovel.org/world-of-cultivation-chapter-one-hundred-and-forty-three-heavyweight-news", "volume_title": "Volume 2", "body": "<h1>Chapter One Hundred and Forty Three “Heavyweight News”</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Um, I forgot to credit warlord212 for the last chapter but he is up there now.</p><br/><p>This chapter has been brought to you by me, and WanderingGummiOfDoom.</p><br/><p>Chapter One Hundred and Forty Three Heavyweight News</p><br/><p>Wei Sheng’s clothing was ripped, his entire body covered in countless little sword cuts, and he appeared to be out of energy. If the judges hadn’t seen that he was still stubbornly persisting, they would have stepped in a long time ago.</p><br/><p>Gu Rong Ping’s expression was peaceful, the darkness and viciousness on his face had disappeared long ago.</p><br/><p>He could be favored by so many to win, and had never lost until now, how could he be unable to see his own situation? When he realized he had made a mistake and started to adjust himself, Wei Sheng was instantly placed at a disadvantage.</p><br/><p>Heart Lake Sword, heart like a lake, undisturbed.</p><br/><p>Wei Sheng struggled to keep going. If it wasn’t that he had a more profound knowledge of sword essence, and could dodge or stop Gu Rong Ping at the last possible second, he would have lost already. Even so, he still could not stop Gu Rong Ping from attacking. Gu Rong Ping had changed from the previous impatience to a relaxed ease as his advantage was slowly increased.</p><br/><p>The sword scriptures were different, and the roads they walked would be drastically different. Some sword scriptures were forceful and explosive, what they needed was each attack to be like a thunderbolt, without keeping anything back. Some sword scriptures walked the path of entanglement. They did not pursue killing with one attack. They went for continuously accumulating an advantage like pulling silk off a cocoon, to exhaust the opponent and in the end leave them with no energy to attack.</p><br/><p>Gu Rong Ping was so.</p><br/><p>“Gu Rong Ping truly isn’t bad. is [Heart Lake Sword] is very advanced for such a young age! Bao Rong hadn’t reached this level when he was his age. “Tian Song Zi couldn’t help but praise. After a slight pause, he couldn’t help but keep praising, “This Wei Sheng is even better! Ningmai stage and he could cultivate to Heart Turn Sword Essence, even more rare is that his personality is resilient and strong. Even though he is clearly trapped, he still does not submit. This boy will be great in the future!”</p><br/><p>“Yes. I’m afraid that Dong Fu’s sects will have to eat behind Wu Kong Sword Sect in the future.” Ling Ying Sect’s leader Feng Qing glanced at Tian Song Zi.</p><br/><p>These words were what many of Dong Fu’s little sects were thinking. Many people did not have good expressions.</p><br/><p>Tian Song Zi knew it, but didn’t state it, only faintly saying, “The strongest rule, the power naturally determines the benefits. Or does Sect Leader Feng believe Wu Kong Sword Sect does not have the power?”</p><br/><p>Feng Qing choked but he defended himself, “I’m afraid that Wu Kong Sword Sect will have too big of an appetite!”</p><br/><p>Dislike rose in Tian Song Zi’s heart. He turned to look at the surrounding people, and said, “Wu Kong Sword Sect has been keeping a low profile all these years. If they were truly greedy people, with Ice Dragon Sword’s strength, there would not be many in Dong Fu that could stop him, much less Sect Leader Pei and the others who are also jindan.”</p><br/><p>These words instantly made many people relax greatly. They found it was true when they thought about it. If Wu Kong Sword Sect were really those kind of people, did they even have the power to resist?</p><br/><p>“Wu Kong Sword Sect is a part of Dong Fu. Wu Kong Sword Sect is strong, our Dong Fu is strong. Dong Fu is strong, everyone here will naturally benefit.” Tian Song Zi said meaningfully.</p><br/><p>“Right! I see that Sect Leader Pei and the others are not those that would steal from others. If our Dong Fu can take a step up among the thirteen primary towns, that’s beneficial for everyone!” Someone praised.</p><br/><p>The others all agreed. No one could rival Tian Song Zi’s influence in Dong Fu. Over all these years, he was mostly fair in his conduct, and everyone trusted him. The Ling Ying Sect leader was on the side, his expression changing.</p><br/><p>Tian Song Zi suddenly stood up. Everyone knew that he had something to say. The surrounding instantly feel silent.</p><br/><p>“There are many people that do not know my initial motivation for holding this Sword Test Conference.” Tian Song Zi started slowly. His voice was not loud, but there was an extra hint of solemnity. Everyone could help but perk their ears to listen. Those that were clever already realized that the matter was not simple.</p><br/><p>“Maybe some people know, but it’s possible some people do not know.” Tian Song Zi paused slightly, before continuing, “Bloody Sky Metropolis Jie is showing signs of instability.”</p><br/><p>First, it was silent, then it was a ruckus.</p><br/><p>“No way!”</p><br/><p>“How is it possible?”</p><br/><p>“Weren’t there many experts holding the fort in Bloody Sky Metropolis Jie?”</p><br/><p>… …</p><br/><p>The panicked voices flowed. These light words were like lightning on a clear day, instantly shaking up all the sect leaders. Even Ling Ying Sect’s leader was struck dumb. Gradually, fear started to show on his face.</p><br/><p>Bloody Sky Metropolis Jie was the buffer between xiuzhe and yaomo. That was the paradise where countless xiuzhe hunted yao. As long as you had the power, you could receive anything you wanted. Jingshi, talismans, rare materials… …</p><br/><p>Expert after expert became famous there. It was the backyard of the xiuzhe, the material store of the xiuzhe.</p><br/><p>So when Tian Song Zi said Bloody Sky Metropolis Jie was showing signs of instability, they hadn’t managed to react to the connection between the Sword Test Conference and Bloody Sky Metropolis Jie, had not reacted to the implications behind this news.</p><br/><p>Only when people remembered how Bloody Sky Metropolis Jie had formed did they suddenly wake.</p><br/><p>Even the most composed person had a changed expression.</p><br/><p>“Is the news confirmed?”</p><br/><p>“The market didn’t have any news at all!”</p><br/><p>Terror quickly spread across the people. They were only asking out of reflex. Everyone knew if Tian Song Zi could say this publicly, the news definitely would not be fake. Tian Song Zi had more avenues of information than they did.</p><br/><p>Tian Song Zi lightly sighed. “Everyone, please prepare. This time, the first one hundred local xiuzhe, I will open the secret realm for them.”</p><br/><p>This was another heavyweight news!</p><br/><p>Secret realm!</p><br/><p>A secret realm was like an extremely small jie. No one knew how a secret realm formed, but each jie would have secret worlds. But how many there were, it was unable to be predicted.</p><br/><p>Secret realms were all different, but there were similarities. In every secret realm, the ling energy inside would be plentiful, and it would be extremely beneficial to cultivate inside. Inside the secret realm, due to the high density of ling energy, and the lack of people, there would be large numbers of rare ling grasses and beasts. And in some secret realms, there would also be residences left behind by ancient xiuzhe.</p><br/><p>No one would have thought that Dong Fu Hall would have a secret realm!</p><br/><p>As expected of the true master of Dong Fu. The wealth he possessed was truly unimaginable.</p><br/><p>“This secret realm had been discovered by my ancestral founder. However, it is a pity that xiuzhe above jindan cannot enter, so this secret realm has been unopened until now. Since a great calamity is approaching, the disciples of all sects, as long as they enter the top one hundred, they can enter this secret realm. But as to what they can obtain, that will be up to their good fortune.” Tian Song Zi said.</p><br/><p>A small smile finally came onto the fearful faces of those large sect leaders.</p><br/><p>If they were talking about disciples from the top ten, then Dong Fu might not have many, but the top one hundred, the core disciples of most of the Dong Fu sects were basically all in there.</p><br/><p>“Elder’s efforts! We really are shamed!” A sect leader suddenly came out and bowed deeply to Tian Song Zi.</p><br/><p>The other sect leaders also came out and bowed in thanks to Tian Song Zi. To open one’s secret realm and allow disciples from other sects to enter, such a matter, it had never been heard of before. Tian Song Zi’s breath of mind received everyone’s admiration. Even Ling Ying Sect leader Feng Qing did not hesitate in bowing.</p><br/><p>There was no joy on Tian Song Zi’s face. He sighed, “The fire of succession. Only when there is fire can it be passed on!”</p><br/><p>Everyone’s hearts started to fall. From Tian Song Zi’s words, they finally realized that the situation was far worse than they had imagined.</p><br/><p>Zong Ming Yan saw those nimble rings of light but still unhesitatingly stepped into the formation.</p><br/><p>Once he stepped in, the scenery around him instantly changed.</p><br/><p>Limitless blue-green mist covered the empty wilderness. He was in the middle of the wilderness, his surroundings empty. In the sky above his head, light rings of various sizes swam like schools of fish.</p><br/><p>In the faint blue-green mist that was like what occurred during sunrise, the chimes from the collisions became even more ethereal. Those mischievous and nimble rings of light danced high above his head, and even higher up, a crescent moon hung, its faint shine falling on this patch of wilderness, giving even the mist a blurry shine.</p><br/><p>This was a formation that a zhuji could set up?</p><br/><p>Zong Ming Yan was slightly surprised and had to reconsider Zuo Mo.</p><br/><p>He may have little knowledge of formations, but he had received Zuo Mei Tian’s attentive teachings, and a half-assed outer sect disciple like Zuo Mo could not compare. Even though he was not clear what formation Zuo Mo had set up, but he could clearly understand the meaning contained in the formation in front of his eyes.</p><br/><p>He decided to put away the disdain in his heart. This Zuo Mo could be considered a genius in formations.</p><br/><p>Zong Ming Yan casually walked, strong confidence revealed in his expression. So what if the other was a formations genius? He did not have any fear in his heart. Quite the opposite. He, who had thought he had picked a bland opponent, started to feel anticipation.</p><br/><p>Zong Ming Yan’s desire for battle increased even more!</p><br/><p>Gently shaking his wrist, the plum branch in his hand sliced and made a circle.</p><br/><p>A plumb blossom gently trembled and fell of the plum branch, floating into the sky.</p><br/><p>[One Cut Plum]!</p><br/><p>This plum flower silently shattered in the air, turning into a pink ball of light. The light seemed to be pulled by two invisible hands in opposite directions, quickly pulled long and thin. A circle of faint sword essence, with the pink ball of light as the center, suddenly spread out towards the surroundings.</p><br/><p>The long and pink sword essence had no warmth or gentleness. Quite the opposite. When it truly became a sword energy, the harsh and sharp sword essence reached a peak!</p><br/><p>Zong Ming Yan narrowed his eyes, and his expression just like that pink sword energy became sharp and menacing!</p><br/><p>The energy being disrupted, the dancing rings of light in the air were like startled schools of fish.</p><br/><p>The chimes of collisions were like rain!</p><br/><p>“Go!” Zong Ming Yan shouted, the plum branch in his hand leading.</p><br/><p>The long and narrow pink sword energy suddenly brightened, drawing a bright pink light in the air as it headed into the rings of light.</p><br/><p>The sword energy was extremely sharp. The rings of light were like bubbles, popping upon a single touch.</p><br/><p>The fragments of light rained down like snowflakes.</p><br/><p>Under the bright moonlight, inside the blue-green mist, the dots of broken light flushed away the killing intent carried by the sword essence, and added a hint of poignancy.</p><br/><p>Hiss! Zuo Mo couldn’t help but inhale sharply.</p><br/><p>This Zong Ming Yan’s power wasn’t on the same level as that Chao An he had encountered before. The power in that one blow was enough to frighten his little heart to beat rapidly.</p><br/><p>If before, he had some thoughts about attacking first, Zong Ming Yan’s sword strike instantly made him understand how unrealistic his thoughts were.</p><br/><p>The only method he had now was defense!</p><br/><p>This was the only thing he could do. If Zong Ming Yan found his position, Zuo Mo was sure that, with his half-learned sword essence, he would lose within three blows.</p><br/><p>After making a decision, the last stray thought in Zuo Mo’s mind was erased. His hands became even faster.</p><br/><p>Fast!</p><br/><p>Faster!</p><br/><p>Translator Ramblings: A few scene changes … … multiple things are happening at once. The possibility of war makes people panic, especially if there were no major wars for three thousand years. Fighting and killing is a whole different matter compared to a war.</p><br/>\n</div>"}