{"title": "Chapter Two Hundred and Three Date Seed Ship", "id": 203, "volume": 3, "url": "http://boxnovel.org/world-of-cultivation-chapter-two-hundred-and-three-date-seed-ship", "volume_title": "Volume 3", "body": "<h1>Chapter Two Hundred and Three Date Seed Ship</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Two Hundred and Three Date Seed Ship</p><br/><p>“Miss, the position of this island is extremely good, it is perfect for guarding the jie river … …” The middle-aged man said respectfully.</p><br/><p>“Is that the formation of a xiuzhe?” The female did not reply. She was staring at the hoop of light that was like a sun above the island.</p><br/><p>“Yes, Miss.” He opened his mouth, but perceptively swallowed his words.</p><br/><p>“Oh.” The female said faintly, “Check first if there is any suspicious targets among them. If not, push them out.”</p><br/><p>“Yes!” The middle-aged man instantly complied.</p><br/><p>“You really are kind.” A male beside the female said in a sarcastic tone. He was like a crane among the chickens, his entire person like a burning flame, a flame red crystal on his forehead.</p><br/><p>Sweeping a glance at the rebellious male, the female was calm. “Yan Feng, shut your mouth.”</p><br/><p>Yan Feng smirked. “The xiuzhe on this island are just rabble. Give me five hundred troops, and I can sweep them clean! If you let them go, isn’t it letting them off easy?”</p><br/><p>The female was not moved. “Our job is to find someone.”</p><br/><p>Yan Feng suddenly became excited, “Mu Xi, you forget that they are xiuzhe! Our enemy! The more we kill, the less enemies we have … …”</p><br/><p>Mu Xi’s tone became cold, “Sir Yan Feng, please watch your tone. You are speaking to your direct commander. If you overstep again, you will be treated according to military law!”</p><br/><p>Yan Feng was so angry fire came out of his eyes. The last bit of intelligence allowed him to keep his control. He knew the woman in front of him would do as she said.</p><br/><p>The composition of yao was extremely complex. There were many species. Different than the reproduction of humans, yao were born from nature, formed from the ling energy of the world. Like Mu Xi, she came from the largest clan of yao, the Wood Clan. They were all formed from flora. Yan Feng, came out of Desolate Western Mountain Sky Fire branch. The reproduction of the Fire Clan was not as prosperous of the Wood Clan. They did not have many yao but they were natural fighters, their personality explosive and brave.</p><br/><p>The Wood, Fire, Gold, Water, and Earth Clans were the five largest clans of the yao, but there were other little clans as many as sand. Due to the abundance of yao, every decade, some small clans would be born. Due to this, yao society was very accepting and very transparent.</p><br/><p>This type of transparent and complete government was like an enormous squid that reached its tentacles into every corner. It was also this governance that had borne from countless great minds and strong elders that allowed the yao to quickly recover.</p><br/><p>For example, Mu Xi was the most accomplished of the youths of the Wood Clan. Even though her cultivation was not outstanding, but she had started her duties very early. Yan Feng rarely found an opponent that could match his offensive power and was even stronger than Mu Xi, but due to his infighting within the ranks, he was punished and placed under Mu Xi’s command.</p><br/><p>In reality, the two once had been classmates, but they had always been at odds.</p><br/><p>———</p><br/><p>Zuo Mo found he actually wasn’t nervous. He was slightly surprised. It seemed that fighting and killing really hardened people.</p><br/><p>However, Pu Yao’s words instantly made him nervous. “They have come to find you.”</p><br/><p>“Find me?” Zuo Mo gaped.</p><br/><p>“Stars in Daytime, you alerted them.” Pu Yao was very calm. This made the nervousness in Zuo Mo’s heart decrease.</p><br/><p>“Stars in Daytime, what does it do?” Zuo Mo asked a question that had been hidden in his heart for a long time.</p><br/><p>“Not much. Some strong yaomo would try to borrow the power of the stars to recover from serious wounds, and this forms the Stars in Daytime.” Pu Yao said.</p><br/><p>“It was you?”</p><br/><p>Pu Yao smiled coldly, “None of my business!” He then frowned. “But these things are slightly irritating.”</p><br/><p>“Aren’t you a yao? Should you be of the same kind as them?” Zuo Mo couldn’t really grasp Pu Yao’s attitude. However, if it wasn’t Pu Yao, who was it? Was it the gravestone?</p><br/><p>Pu Yao did not like xiuzhe, Zuo Mo could understand this, but he could not understand that Pu Yao didn’t even like the yao.</p><br/><p>“They don’t have any connection to me.” Pu Yao’s face was cold.</p><br/><p>Zuo Mo saw that Pu Yao didn’t seem to want to mention this matter, and perceptively changed the topic. “Do you have any good suggestions?”</p><br/><p>“Your luck seems pretty good. The arrivals are the Wood Clan.” Pu Yao glanced at the organized ranks of yao troops in the sky. “They don’t like fighting.”</p><br/><p>“Wood clan?” Zuo Mo was very curious. Zuo Mo might have openly spoke about the little yao before, but that was buying and selling at the same time. Zuo Mo was very unfamiliar with yaomo. Seeing that he could not avoid a conflict with the yaomo, it was beneficial for him to know a bit more.</p><br/><p>“A large clan, but it has many cadet branches. Formed from flora.” Pu Yao introduced shortly.</p><br/><p>“Oh … …” Zuo Mo nodded, not understanding. What was formed from flora? But he knew that Pu Yao definitely did not have the patience to explain.</p><br/><p>Suddenly, Zuo Mo detected a strong consciousness ripple.</p><br/><p>“Hm!” He couldn’t help but jump. Such a strong consciousness!</p><br/><p>The consciousness ripple came from the other side and swept the sky above the entire Desolate Wood Reef. Before this, Zuo Mo had been very confident in his consciousness. He had almost never encountered a xiuzhe who had a stronger consciousness than he did.</p><br/><p>But the strength of this consciousness was far above his.</p><br/><p>“They are searching for you. Such a pity, just Night Stock yao, they believe they have the skill!” Pu Yao smirked. He seemed to understand what Zuo Mo was thinking. “It’s very normal. They only cultivate the consciousness, it isn’t something a half-ass like you can compare to.”</p><br/><p>Pu Yao’s interest was unknowingly stirred. “Yao cultivate the consciousness so the division for spiritual power is much finer than the xiuzhe. Star fire, manifestation, spirit seed, yin spirit, yao mansion, six revolutions, and sky channels. You are just at manifestation. Among them, the most powerful have finished spirit seed. Even though their spirit is weak, but it can easy to kill you.”</p><br/><p>“Manifestation?”</p><br/><p>“When the starfire is full, it manifests, seed born in the heart to become planted in the spirit, the spirit births the yin spirit, the yin spirit opens the yao mansion … … spiritual manifestation, oh, your leaf hand is a manifestation.”</p><br/><p>“The consciousness can become tangible?” Zuo Mo asked.</p><br/><p>“Of course, it’s so simple, do you really need to think about it?” Pu Yao’s face was full of disdain. “However, you just entered manifestation, you’re very far off from spirit seed.”</p><br/><p>“What is called seed born in the heart?” Zuo Mo couldn’t help but ask, his head bloated.</p><br/><p>“You’ll know when it is time.” Pu Yao had used up his patience.</p><br/><p>“Then now?”</p><br/><p>“Solve it yourself.” Pu Yao said impatiently before disappearing.</p><br/><p>“They are going to attack.” Gongsun Cha pulled Zuo Mo back.</p><br/><p>The attacking posture of the other size was so obvious even an idiot could see. Zuo Mo couldn’t help but become nervous. Pulling Gongsun Cha and Chun Yu Cheng, he pushed his voice low, “Prepare to escape.”</p><br/><p>“Where?” Chun Yu Cheng’s face was puzzled.</p><br/><p>Gongsun Cha suddenly opened his mouth, “Towards the jie river!”</p><br/><p>“The jie river? Little Mountain Jie?” Zuo Mo was very surprised, “Isn’t that heading for the net?”</p><br/><p>“The Endless Ocean is vast and borderless. We need to fly multiple months to see land, there is no place to hide.” Gongsun Cha was very calm, a hint of heat in his eyes. “When it’s time, these people will all scatter. We’ll go the opposite way and break through. They definitely wouldn’t have thought of it.”</p><br/><p>“They just came from Little Mountain Jie, Little Mountain Jie definitely has fallen. If we go to Little Mountain Jie, we have no escape.” Chun Yu Cheng was frightened by Gongsun Cha’s suggestion, so frightened he woke up.</p><br/><p>“This is not certain.” Gongsun Cha shook his head. “If Little Mountain Jie has fallen, what would come definitely wouldn’t just be this little amount of yao.”</p><br/><p>“This is a little?” Chun Yu Cheng pointed at the organized and solemn yao army in the sky, and shouted.</p><br/><p>“To us, it seems like a lot. But if they want to attack Sky Moon Jie, it is far too few,” Gongsun Cha said quickly.</p><br/><p>Zuo Mo instantly reacted. “You mean they are a little troop that snuck in?”</p><br/><p>“Possible.” Gongsun Cha said.</p><br/><p>“What did they sneak in for?”</p><br/><p>“I don’t know, they probably have a target?”</p><br/><p>Zuo Mo suddenly thought of what Pu Yao had said. Did these people really come to find him? No, to find the yaomo of the Stars in Daytime?</p><br/><p>He continued to weigh the choices in his heart. Truthfully, Gongsun Cha’s suggestion was very dangerous, no, it was extremely dangerous. But Zuo Mo felt that the success of that suggestion was very likely. From this, it could be seen that he was in support of Gongsun Cha’s suggestion.</p><br/><p>Chose which one?</p><br/><p>He was just a little xiuzhe that had just broken through to ningmai and hadn’t seen much. Facing a choice that would determine life and death, he couldn’t help but hesitate.</p><br/><p>Yet the other didn’t give the time to hesitate.</p><br/><p>The sky above the other side’s troop was suddenly dark. Strong ling power ripples were like a harsh wind that swept past.</p><br/><p>Damn it!</p><br/><p>Zuo Mo jumped in fright. The other side was going to attack. The ling power ripples passing through the air were the same as [Yang Fiend Hard Lightning] but the terrifying presence it gave off was hundreds of times stronger. He didn’t doubt that their attack would flatten all of Desolate Wood Reef.</p><br/><p>If he didn’t run now, when could he run?</p><br/><p>He grabbed Gongsun Cha and Chun Yu Cheng, not caring for anything else, and suddenly jumped into the water.</p><br/><p>A gold light flashed, and the Buddha Sound Hoop landed in Zuo Mo’s bosom, the presence of the formation on the Desolate Wood Reef weakening.</p><br/><p>The Desolate Wood Reef instantly exploded!</p><br/><p>“He ran! Zuo Mo ran!”</p><br/><p>“Run!”</p><br/><p>“Everyone, run!”</p><br/><p>… …</p><br/><p>At this time, with a large sound, a bolt of lightning twisted and struck the Desolate Wood Reef.</p><br/><p>Dong!</p><br/><p>A muffled sound hit everyone’s heart. Those xiuzhe with weak cultivations bled from their mouths and nose.</p><br/><p>Everyone couldn’t help but turn their head.</p><br/><p>The Desolate Wood Reef with its layers of formations was like paper in front of the lightning, cleanly wiped out. More than ten of the xiuzhe that moved too slowly were swept by the after-ripples and torn to countless pieces, not even having the time shout before their souls were destroyed.</p><br/><p>In the ocean, Zuo Mo didn’t have it good either. The blood inside his body was roiling, his ling power almost spiraled out of control. Gongsun Cha and Chun Yu Cheng’s faces were pale, the power of the one attack was so powerful that it even passed into the ocean!</p><br/><p>At the border of life and death, Zuo Mo became calm. A date seed appeared on his hand, a talisman-ship was carved on it. This date seed ship had been taken from Nan Ming Zi’s body. However, it required too much ling power, so he hadn’t found out how to use it.</p><br/><p>In seclusion this time, after finishing forging the five essence sword set, Zuo Mo had spent a lot of effort on the talismans that he did not understand. He hadn’t expected that he found some methods, and including this date seed boat.</p><br/><p>At this time, he didn’t dare to hold anything back, the ling power in his body furiously flooding towards the date seed boat.</p><br/><p>A little date red wooden boat with an old aura appeared in front of everyone.</p><br/><p>Zuo Mo’s hand moved.</p><br/><p>They felt the scene in front of them blur and then they were inside the ship. The ship was dry and clean. The water outside the ship seemed to be stopped by an invisible power, unable to enter.</p><br/><p>Zuo Mo hurriedly directed the date seed ship to sink to the bottom .The thick water could stop the search from the other’s consciousness.</p><br/><p>If they could flee to a place that the other could not detect them, they would be temporarily safe.</p><br/><p>Translator Ramblings: Little more stuff on yao society and military. Don’t speculate too much since this is just the tip of the iceberg. Zuo Mo knows nothing. He’s just the mouthpieces for Pu Yao.</p><br/><p>I told Lemeres I’m going to reply to their comment from yesterday. So, yes, this is a yao military unit that has attacked what is essentially a civilian outpost. But the status of these two sides are not equal. It is hard to say that the xiuzhe all fail because of this one encoutner. This is the military, so there is training and organization on one side. What they are facing is country bumpkins that are civilians. The yao military win due to numbers and organization, but they can’t be the only side with armies. The story will be a whole less realistic. Mu Xi has clearly trained for her position through school, and she is an officer. The rest are trained soldiers sent on this special mission so they probably are not regular foot soldiers. Remember that the xiuzhe are fleeing Sky Moon Jie and the ones that are passing through Zuo Mo’s island aren’t the big sects but the lower classes. They have no organization that they belong to so not one of them would stay to fight. That is what causes this instant defeat in this chapter.</p><br/>\n</div>"}