{"title": "Chapter Two Hundred and Eight Blood Void Movement", "id": 208, "volume": 3, "url": "http://boxnovel.org/world-of-cultivation-chapter-two-hundred-and-eight-blood-void-movement", "volume_title": "Volume 3", "body": "<h1>Chapter Two Hundred and Eight Blood Void Movement</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Two Hundred and Eight Blood Void Movement</p><br/><p>Zuo Mo looked at the soft and shy Gongsun Shidi who was half-collapsed on the deck, face pale, and found it hard to think of him as the battle crazed guy just now.</p><br/><p>As he took out medicine for Gongsun Cha, he thought, “This guy is really an extreme militant!” Even now, he felt it was slightly unreal. The entire battle was clean and crisp, without any big tribulations, it was done.</p><br/><p>Zuo Mo didn’t even get to use his five essence sword set and the Moon Eye Blackwater Beast was killed!</p><br/><p>He had felt the effectiveness of the Golden Armor Guards would not be as great with him as they were on Gongsun Shidi’s hands.</p><br/><p>But the difference was a bit too big … …</p><br/><p>On land, one Golden Armor Guard was enough to deal with a Moon Eye Blackwater Beast, but in the water, for three Golden Armor Guards to kill a Moon Eye Blackwater Beast, that needed luck. He hadn’t thought that Gongsun Shidi was so strong!</p><br/><p>Pity about the pair of Moon beads!</p><br/><p>Zuo Mo’s heart hurt. The last ambush by the Golden Armor Guard had sliced the eyes of the Moon Eye Blackwater Beasts in half. What landed in his hands were four half-sphere moon beads. Their value had greatly decreased. He had taken a lot of Blackwater. The Blackwater was not as valuable as moon beads, but it was still a rarity.</p><br/><p>Even more, it was worth it just to discover Gongsun Shidi’s terrifying talent at battle!</p><br/><p>In troubled times, what was most important was strength. As Gongsun Shidi’s talents were continuously uncovered, their strength was increasing. Zuo Mo was already considering if it was possible for Pu Yao to make a few more Golden Armor Guards.</p><br/><p>However, Gongsun Shidi’s strength was a bit lacking. The shout from the Moon Eye Blackwater Beast had almost taken his little life. In Zuo Mo’s view, the direction that Gongsun Shidi should develop in was as a battle general, being skilled at commanding in battle, and not pursuing individual power.</p><br/><p>But his individual power was too weak, even weaker than Chun Yu Cheng. If he was the least bit careless, he could lose his life. Having seen the yao army, Zuo Mo naturally realized that people like Gongsun Shidi were actually very strong. These days, hiring a sword xiu of some strength wasn’t hard, that just needed jingshi. But hiring a xiuzhe who would command, that was not simple. Even more, Gongsun Shidi was the closest of all, they had gone through tribulations together and was very reliable.</p><br/><p>How could he get Gongsun Shidi to command in battle but not lose his little life?</p><br/><p>Talisman? Even the best talisman would be scrap metal in Gongsun Shidi’s hands. He basically could not use them to their full potential.</p><br/><p>Practice some life-saving spell? At this time, would it be too late? Gongsun Shidi might have talent at commanding, but his talent at cultivation seemed very average.</p><br/><p>Zuo Mo ran into trouble.</p><br/><p>Suddenly he hit his head. How could he forget Pu Yao? This thousand year old antique should know at least something.</p><br/><p>“You want to turn him into a battle general?” Pu Yao’s eyes as he looked at Zuo Mo were slightly shocked. Such a perceptive matter, was it something that this greedy zombie face could think of? Didn’t this guy only ever pursue money?</p><br/><p>“I feel he has great talent in the area.” Zuo Mo asked in response, “Don’t you think so?”</p><br/><p>“His talent is barely acceptable.” Pu Yao did not refute it. “But what do you want a battle general for? Do you want to start conquering land?”</p><br/><p>Zuo Mo looked at Pu Yao like he was looking at an idiot. Did he get his head knocked? Just these few people, they couldn’t even get protection money, let alone conquering land! However, thinking that he had something to ask of the other, Zuo Mo decided it was better not to say such hurtful words. He said, “One good man, three person sect. Gang fighting has more technique involved than fighting by oneself. Anyways, I feel that this road has a brighter future for him than a butcher.”</p><br/><p>For some unknown reason, Pu Yao released a breath. See, he said so. This brat couldn’t have such far-seeing eyes.</p><br/><p>———</p><br/><p>“This is so good, why does it have to be hidden?” Zuo Mo was not very happy.</p><br/><p>“You bumpkin!” Pu Yao scornfully twisted his mouth. Each time he scolded like this, he felt great. Also, he found that as long as Zuo Mo had something to request of him, Zuo Mo wouldn’t be angry if he swore at him.</p><br/><p>He saw the displeasure in Zuo Mo’s eyes become even heavier, but the other forcefully suppressed it. Pu Yao was very smug.</p><br/><p>Oh, this feeling isn’t bad.</p><br/><p>“Let me first teach you a lesson. With xiuzhe, those that are purely commanders are battle generals. Yaomo do not have pure things.” Pu yao’s voice was full of scorn. “For yaomo, they have to fight as soon as they are born. Commanding in battle is a technique any high level yaomo must learn. Of course, not every yaomo can become a strong commander, but the rate of their occurrence is much higher than your battle generals.”</p><br/><p>“Do you know what is most important for a commander? Pu Yao asked.</p><br/><p>“I don’t know,” Zuo Mo shook his head in confusion. He had never heard before what Pu Yao was saying now.</p><br/><p>“Giving commands!” Pu Yao gave a very normal answer.</p><br/><p>“Oh,” Zuo Mo seemed to have understood slightly.</p><br/><p>“On the battlefield, the situation would change constantly, and is very complex. How can the people in command let their orders reach their subordinates?” As he kept on going, Pu Yao became serious. “Xiuzhe use seals, they first forge seals beforehand to give them to the xiuzhe they command, and pass orders through the seals. Mo use the mo matrix. They can mutually feel each other through the mo matrix. As to yao, I shouldn’t have to say anything.”</p><br/><p>“Consciousness?”</p><br/><p>“Yes.” Pu Yao nodded. “What yao primarily cultivate is the consciousness, and are born naturally powerful in this area. You should first consider this problem.”</p><br/><p>“As to protecting his life,” Pu Yao tilted his head to think, “battle generals usually would have the protection of experts, and they would hide in the troops so they cannot easily be discovered.”</p><br/><p>Zuo Mo had an impulse to spit blood.</p><br/><p>After speaking for so long, it was basically equivalent to saying nothing. Having the protection of experts, where could he get experts to protect? There was only these few people, where would he hide?</p><br/><p>“We are on one ship now.” Zuo Mo’s eyes were not friendly as he smirked, “Hm, I wonder if Sky Yao are nutritious and suited to a ling beast’s appetite.</p><br/><p>Pu Yao naturally would not be scared by this degree of threat, and laughed loudly in response.</p><br/><p>Seeing that Zuo Mo showed signs of rage, Pu Yao finally stopped his carefree laugh.</p><br/><p>“If you are talking about saving his life, it’s not that there are not ways.” Pu Yao snickered, “Like the mo matrix. Look at how convenient it is. Carving it on once, benefits for a lifetime. He doesn’t need to cultivate at all. The mo matrix would automatically temper his body. In the future, he would be a juggernaut, a juggernaut that cannot be killed!”</p><br/><p>Zuo Mo smirked. “Boast! Continue boasting! Ge got tricked by you last time, got this mo matrix carved, how come ge didn’t become a juggernaut!”</p><br/><p>“It’s not possible to become a juggernaut in one day.” Pu Yao smiled. “Or a yao seed. Cultivating the consciousness, that’s the best pairing for a battle general.”</p><br/><p>“The consciousness isn’t bad, but it isn’t useful in protecting his life. Also, if he starts practicing, it would take a long time.” Zuo Mo shook his head. “Also, in the future, he might not be in command of a yao army. Didn’t you also say that xiuzhe used seals?”</p><br/><p>“You see, you refused the two areas I’m most skilled in.” Pu Yao waved his hand, his expression similar to saying “see, it’s not that I’m not helping you.”</p><br/><p>“Ye just knew that you weren’t reliable!” Zuo Mo hatefully said. “Humph, fine! He can’t become a battle general, no one can play War Chess with you!”</p><br/><p>Pu Yao froze.</p><br/><p>Zuo Mo was secretly overjoyed. As expected, he hadn’t guessed wrong! Seeing Pu Yao sadistically kill Gongsun Cha for twenty something rounds, Zuo Mo was very shocked. He had never seen Pu Yao be interested in a matter like he was in this. Pu Yao had taken out a huge variety of War Chess games. Zuo Mo had knew then that this guy had definitely been obsessed with this path. Especially when he saw Pu Yao’s smug expression after he had sadistically killed Gongsun Cha twenty something rounds. He knew that this guy had found a new amusement, so he tried this approach.</p><br/><p>Pu Yao was depressed. It wasn’t that he was unclear as to Zuo Mo’s little calculations, but just as Zuo Mo expected, it had been long and difficult before he had found someone who could play with him. If he lost a person to play with due to this, it was a loss.</p><br/><p>To a Sky Yao that had no goal or ambition, amusement was very important.</p><br/><p>He said slightly helplessly, “Oh, I remember, there is a very obscure life-saving method.”</p><br/><p>“What?” Zuo Mo hurriedly asked.</p><br/><p>“[Blood Void Movement]!”</p><br/><p>“What spell is that?”</p><br/><p>“It’s not a spell, it’s a talisman!”</p><br/><p>“Oh … …</p><br/><p>Multiple hours later, Zuo Mo looked at the three necklaces in front of him with a satisfied expression. There were two jade tablets on each necklace, each tablet carved with complex and old characters. Zuo Mo’s craftsmanship was much better now, and the characters he carved were more smooth and fine.</p><br/><p>Deviously laughing, he ran next to Gongsun Cha whose face was pale.</p><br/><p>“Shixiong, what is it?” Gongsun Cha became wary. Shixiong’s expression was troubling.</p><br/><p>“Nothing big.” Zuo Mo nickered. He pulled Gongsun Cha’s hand, rubbed it a few times. “Okay!”</p><br/><p>Gongsun Cha stilled. He suddenly saw that his little hand was dripping blood. Below his fingers, there was a jade bottle that was already half filled with blood.</p><br/><p>Gongsun Cha’s pale face suddenly became white as paper, his eyes rolling as he fainted.</p><br/><p>Chun Yu Cheng propped up his chin, looking in the distance, his gaze wandering as he muttered to himself. “This formation should belong to the wind element power. Does wind element power affect the reproduction rate of ling butterflies … …”</p><br/><p>He was completely ignorant that someone was beside him, and did not detect that the other hand which he had on his leg was dripping blood.</p><br/><p>After half a bottle, he still had not detected it.</p><br/><p>———</p><br/><p>An hour later.</p><br/><p>“Hm, when did my hand get wounded? Oh, where did I think up to … …”</p><br/><p>Zuo Mo took out three bottles of blood, one of them his own. He had split the blood of the two bottles in half, each portion put into one of the jade tablets.</p><br/><p>On the warm jade tablet, the bright red characters were exceptionally grand. No one would think of blood. It did not look any different than normal cinnabar.</p><br/><p>The three necklaces with the jade tablets were the weapon to save lives – Blood Void Movement!</p><br/><p>Three people, one person a piece.</p><br/><p>When any one of them experienced a life-saving threat, they would automatically move beside their fellow, as long as their fellow was also wearing the Blood Void Movement necklace as well.</p><br/><p>He had originally planned on finding a life-saving method for Gongsun Cha who had the lowest cultivation, but hadn’t thought that he would get such a big benefit out of it. Zuo Mo mixed the three people’s Blood Void Movement together. This way, no matter which one of the three of them encountered danger, they would move to one of the other two.</p><br/><p>Having put handled a large worry, Zuo Mo’s mood was great and he woke Gongsun Cha up.</p><br/><p>“Come, let’s play the War Chess!”</p><br/><p>The confused Gongsun Cha did not know that he had been sold by Shixiong to a Pu Yao who was sharpening his blades.</p><br/><p>Translator Ramblings: More knowledge about large-scale warfare. No one in the ship is normal. Lil’ Black might be the most normal entity on there.</p><br/><p>Zuo Mo finally found some of Pu Yao’s weaknesses. He is bored and lonely.</p><br/><p>I’ve used the display posts shortcode to get a listing of recent chapters for the table of contents. However, it has a maximum display of 100 posts. Is there a wordpress guru that knows if there is something I can do to make an easy table of contents, possibly with the archive shortcode?</p><br/>\n</div>"}