{"title": "Chapter Two Hundred and Six What Was That?", "id": 206, "volume": 3, "url": "http://boxnovel.org/world-of-cultivation-chapter-two-hundred-and-six-what-was-that", "volume_title": "Volume 3", "body": "<h1>Chapter Two Hundred and Six What Was That?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Two Hundred and Six What Was That?</p><br/><p>Zuo Mo was very depressed.</p><br/><p>In the first two matches, he had won. The third round was tied. They also tied for the fourth and fifth. After the fifth round, he never won again.</p><br/><p>In total, they had battled for ten matches. Five losses, three ties, and two wins, that wasn’t a good result. The more they played, the greater the gap between them became. He was very surprised. Gongsun Shidi who looked shy and weak was very aggressive. In the last few matches, not soon after the match had started, Zuo Mo was killed off.</p><br/><p>Zuo Mo lost so badly that even Pu Yao couldn’t keep looking.</p><br/><p>“I’ll go!”</p><br/><p>Pu Yao jumped out, took over control, and started to fight against Gongsun Cha.</p><br/><p>Gongsun Cha was instantly obliterated. The strong ability to command that Pu Yao displayed made Zuo Mo intoxicated. Pu Yao, who seemed quite feminine, was extremely aggressive when he was in command.</p><br/><p>You guys can slowly torture yourselves! Ge will play on ge’s own.</p><br/><p>Zuo Mo muttered inside. This person and this yao were natural born militants. In other words, they were born for the role! Especially when he saw the expressions of the person and the yao, he shuddered. The light flashed in Pu Yao’s bloody pupil, a cruel smirk on the corner of his mouth, his actions light lightning. Gongsun Shidi, after being depressively killed for twenty something matches, his expression wasn’t the least bit dejected. His face was like a plum blossom, slightly flushed, the light in his eyes continuously flickering, he was more excited the more he fought!</p><br/><p>These two perverts!</p><br/><p>Zuo Mo had long known of Pu Yao’s perverseness. He hadn’t thought Gongsun Shidi would also be so perverse when he played War Chess!</p><br/><p>Did everyone’s heart have a perverse chord?</p><br/><p>Shaking his head, Zuo Mo smacked his lips. All the War Chess games that Pu Yao gave were for commanders, and were all yaomo. Xiuzhe, if they were not the enemy, they were cannon fodder. That made him very unaccustomed to it.</p><br/><p>Okay, who made it so that they were War Chess games for yaomo.</p><br/><p>Zuo Mo completely threw the last thought behind his head. He decided to continue his own cultivation.</p><br/><p>Speaking of cultivation, he was studying formations.</p><br/><p>He had seen many kinds of formations already. The soul-tethered talisman that was so rare, jingshi talismans, he had all that. Adding on the aid of his consciousness, his comprehension of formations was much deeper than normal xiuzhe.</p><br/><p>He had many skills, he cultivated ling power, spiritual power, and also body cultivation on the side. He also knew many spells. Such variety was not a good quality. In reality, all of these were not his true cultivation path.</p><br/><p>His primary cultivation was formations. The direction of this originated in Pu Yao’s statement, “The core of all spells is formations.” From the uncertainty in the beginning, to the gradual understanding, to the rock-hard determination of present, Zuo Mo had never stopped studying.</p><br/><p>Even though he was far from the level Pu Yao had spoken of, he was full of confidence in himself.</p><br/><p>For example, the micro formations in dan-making were the products of his continuous investigations. He didn’t know if anyone else studied them, but the micro formations had brought enormous profit for him. Without the micro formations, there was no Golden Crow Fire.</p><br/><p>There were many paths to increasing one’s strength, but not every path was suited for him.</p><br/><p>Since people were skilled at commanding, then this matter will be given to those skilled in that. It was the wisest choice for him to do what he was most skilled in.</p><br/><p>He put his attention back on the date seed ship. In his view, there was a lot of room for modifications, especially to Zuo Mo who was skilled in micro formations.</p><br/><p>As it was related to his life, he had to think hard.</p><br/><p>In the cabin, three people all had different expressions. Chun Yu Cheng propped his head on his hand, his eyes lost. He had maintained this position for a long time, occasionally muttering. Gongsun Cha was extremely energetic, his eyes focused on War Chess, completely ignorant of the piece of black daze crystal that was floating in the air with no one else present.</p><br/><p>Zuo Mo climbed up and down, his body covered in wood shavings, all kinds of tools and talismans occasionally on his hands.</p><br/><p>Lil’ Pagoda skipped behind him, not letting go of one piece go to waste, all sucked into the tower.</p><br/><p>Not far away, Silly Bird looked in disdain at Lil’ Pagoda. Lil’ Black silently waved its antennae as it climbed around.</p><br/><p>A long time later, when the formation in front of him had finished, Zuo Mo finally released a breath and stretched.</p><br/><p>Without any requirements, without any limitations, as long as he could think of it and he had enough materials, he would try it. This kind of experimentation that he had never had before made him feel unspeakably comfortable. He had done everything he could think of to modify the date seed ship.</p><br/><p>Some were forging methods, some were dan-making methods, some were formation setting methods, including the formation disks that he hadn’t used for a time, they were all put to use on the date seed ship.</p><br/><p>The date seed ship was completely transformed.</p><br/><p>The shuttle-shaped date seed ship became even sharper, especially the bow where seven blue spikes were arranged in a row. These seven blue spikes had been obtained from the fourth-grade Blue Spiked Crocodile that Zuo Mo had killed on the Desolate Wood Reef. The blue jade like spike was covered in cinnabar seals all over.</p><br/><p>The body of the ship was thinner and longer than before, like a swordfish. It made the ship look more dangerous and intrusive. The direct result was that its speed in the water suddenly increased. In two hours, it could travel one hundred and fifty li, having increased by fifty percent.</p><br/><p>Zuo Mo added a control formation to the ling shield outside. It was almost attached to the body of the ship now, like a skin rather than the round bubble it had been before. The lightning net seemed to be engraved on the ling shield now rather than on its exterior.</p><br/><p>It was possible to see a thread of lightning occasionally swim by silently on the ling shield.</p><br/><p>Zuo Mo had cut off anything like the masts. Those things were more for decoration than practicality.</p><br/><p>But even so, Zuo Mo was still not satisfied. He studied the water movement formation that the date seed ship had now, and found that this water movement formation was the reason the date seed ship was so slow in the water. Compared to flying in the air, the speed of travel in the water made him feel it was as slow as a turtle.</p><br/><p>For example, the Thunder Flowing Light Wings that he had bought from Hong Yang could reach one thousand and five hundred li in two hours at full speed. Even the third-grade lucky cloud that did not pursue speed but was famed for its elegance could easily surpass a speed of three hundred li every two hours.</p><br/><p>Having never possessed a water movement talisman before, Zuo Mo naturally could not be satisfied with the speed of the date seed ship. A fourth-grade date seed ship that couldn’t even catch up to a third-grade lucky cloud, wasn’t that a joke?</p><br/><p>He completely forgot the resistance in the water was much stronger than flying in the air.</p><br/><p>When he realized this problem, it was when he had increased the speed of the date seed ship to two hundred li every two hours, because he discovered that, no matter how he altered the water movement formation, he could not increase the speed of the date seed ship.</p><br/><p>He sudden recalled a move that he had practiced before in the [Li Water Sword Scripture] – [Flowing Water]!</p><br/><p>Other than being traceless and hard to discover, [Flowing Water] also was fast! It wasn’t an extremely fast, but a comfortable, and smooth, natural flow! He had practiced [Li Water Sword Scripture] in the water before. In the water, [Flowing Water] was much faster! The crux of [Flowing Water] was to change with the water flow, like water flowing from high up down.</p><br/><p>If he could turn the date seed ship into the Water Drop sword, that would be good … …</p><br/><p>This daring idea suddenly flashed through his head. This idea made him excited. After thinking for a long time, he finally found a solution.</p><br/><p>He had just finished it now!</p><br/><p>He used several hundred little formations to successfully model a situation similar to [Flowing Water]. The speed of the date seed ship was increased to four hundred li every two hours!</p><br/><p>Zuo Mo did not know the market. If he knew the fourth-grade water movement talismans on the market were all around one hundred li every two hours, that even the upper fourth-grade talismans were about two hundred li every two hours, he certainly wouldn’t have been stubborn to increase the speed of the date seed ship.</p><br/><p>Such terrifying speed was not without its limits. Due to the high number of formations, it was extremely difficult to control. Zuo Mo found it very hard to control himself, and had to let Lil’ Pagoda take control of the formations. These formations mostly were related to water, and Lil’ Pagoda was the best hand at controlling the five elements.</p><br/><p>The other point was the consumption of jingshi had multiplied, especially when they were travelling at full speed. It would use ten jing of ling power every two hours, which was ten pieces of third-grade jingshi, ten times that of the Thunder Flowing Light Wings.</p><br/><p>But in Zuo Mo’s perspective, this was worth it. If he couldn’t keep his little life, then no matter how much jingshi he had it was useless.</p><br/><p>The present date seed ship finally reached the level of life-saving in his heart.</p><br/><p>But before he could rest, suddenly, a feeling of danger came into Zuo Mo’s mind.</p><br/><p>Zuo Mo’s heart beat heavily.</p><br/><p>He couldn’t help but look outside. In the black water, a dot of light suddenly lit up far away.</p><br/><p>This dot of light was extremely small like a hair, but in a blink, it was the size of a sesame seed.</p><br/><p>Such fast speed!</p><br/><p>Zuo Mo inhaled sharply.</p><br/><p>He suddenly remembered the Endless ocean that countless people talked about, which had no border was the playground of strong ling beasts!</p><br/><p>“Run!”</p><br/><p>Connected to his mind, Lil’ Pagoda instantly light up, the jingshi of the twenty eight stars in the ceiling of the cabin lit up, the cabin so bright it seemed like day.</p><br/><p>Vroom vroom vroom! The ship slightly trembled. Under its maximum speed, the pressure that the ship was under was very terrifying.</p><br/><p>The sudden change alarmed the other two.</p><br/><p>Chun Yu Cheng raised his head in confusion, the excited lush on Gongsun Cha’s face had not retreated. Gongsun Cha reacted first, the lightning speed of the date seed ship frightening him.</p><br/><p>“So fast! When did the ship become this fast?” He wasn’t nervous, his face curious as he walked next to Zuo Mo.</p><br/><p>“It isn’t the time to discuss this,” Zuo Mo said in a deep voice. “Something has locked onto us.”</p><br/><p>“What?” Gongsun Cha’s face was curious. However, when his gaze turned to the outside, his face suddenly changed.</p><br/><p>Not far away from the ship, a pair of vicious eyes about the size of a lantern stared at the date seed ship.</p><br/><p>When the two people looked at its body, the two couldn’t help but inhale.</p><br/><p>An enormous shadow appeared in their vision. Black water that flowed relentlessly was like a mountain that was clearly separate from the surrounding river. The pair of indifferent and vicious eyes were as bright as moons in the black water.</p><br/><p>The three felt as though they had fell into a glacier, their entire body cold!</p><br/><p>Translator Ramblings: Zuo Mo goes overboard and the sea monsters show up. Gongsun Cha is a little bit obsessed.</p><br/>\n</div>"}