{"title": "Chapter Two Hundred and Thirty Seven – Reconstructing The Body", "id": 237, "volume": 3, "url": "http://boxnovel.org/world-of-cultivation-chapter-two-hundred-and-thirty-seven-%E2%80%93-reconstructing-the-body", "volume_title": "Volume 3", "body": "<h1>Chapter Two Hundred and Thirty Seven – Reconstructing The Body</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Two Hundred and Thirty Seven – Reconstructing The Body</p><br/><p>On the water mirror was an unfamiliar face.</p><br/><p>“What the!” Zuo Mo jumped in fright, and then rubbed his face in curiosity before turning and inspecting in the mirror. After a long look, he made a final conclusion, “Alright, much better than before!”</p><br/><p>His heart felt slightly reassured. A rock in his heart landed. This face was not handsome, but at least, his nose was a nose, his mouth was a mouth.</p><br/><p>Truthfully, this face was slightly average, almost immature. Bald head, thick brows, and thick lips. His body was also thicker than before. He looked like a nice and obedient child.</p><br/><p>Was this what he had really looked like originally? He was puzzled, and then saw a puzzled expression on the face in the water mirror. He felt slightly unnatural. He had become accustomed in the past years to that zombie face that could never have an expression, and used to hiding his thoughts under that zombie face. Now, his expressions had become more varied. The emotions inside naturally could be expressed on his face. He felt it was extremely strange.</p><br/><p>With curiosity and novelty, he stared at the unfamiliar yet vivid face in the water mirror.</p><br/><p>He decided to ask Pu Yao if this was his original appearance. This question was extremely important to him.</p><br/><p>Gongsun Cha looked at Zuo Mo’s hand, and when he saw the several dimensional rings, he released a breath. It really was Shixiong! Seeing Shixiong’s appearance, he also knew that something had happened. At this time, Shixiong needed quiet. He made a silent gesture, and took everyone else to retreat out. Changing appearances was not a rare matter for xiuzhe.</p><br/><p>Once everyone left, Zuo Mo entered the sea of consciousness and found Pu Yao.</p><br/><p>“What happened? How come I look like this?”</p><br/><p>Pu Yao glanced at him, and sneered, “Don’t pretend in front of him. I had not expected the two of you to team up and scheme against me.”</p><br/><p>“Team up? Scheme?” Zuo Mo was confused.</p><br/><p>“I do admire you. You really have guts. Reconstructing the body, even those great mo may not dare to try. You really have the guts. I had underestimated you before.”</p><br/><p>“Reconstruct the body?” Zuo Mo’s confusion grew.</p><br/><p>“I had found it strange before why you would so easily agree to the drawing of earth energy so easily,” Pu Yao narrowed his bloody pupil, speaking to himself, “I should have thought of this earlier. How could you not know that my injuries needed earth energy? You were waiting for me here a long time ago. You are as cunning as you always were!”</p><br/><p>Zuo Mo was able to hear that Pu Yao’s last two sentences evidently were not directed at him.</p><br/><p>He was not dumb. Listening to Pu Yao’s words, he got a general understanding. Pu Yao’s “you” should be the gravestone. The more he listened, the colder his heart became. He suddenly recalled the “Do as he asks.” He had a feeling that Pu Yao’s speculation was not unbased.</p><br/><p>Neither the yao or the stele were good people!</p><br/><p>But when he thought deeper, he quickly realized it. If it was not for this yao and stele, he would not have reached the level he was at now. He probably would not having even successfully entered zhuji. It was like doing business. Each side had their own aims. Even the smallest of benefits would not drop down from the sky. As to risk, what business had no risk?</p><br/><p>“I get the general gist of reconstructing the body,” Zuo Mo directly asked, “Is this my original appearance?”</p><br/><p>His words not having the effect he intended, shock flashed across Pu Yao’s mind. Didn’t this guy hate being used the most? However, he did not linger on this question. It would cause the opposite effect if he said too much.</p><br/><p>“Of course not,” Pu Yao’s answer was very definite. “After reconstruction of the body, all of your appearance would change. The greatest cause of danger in this kind of mo skill is here. All the bone, blood and flesh of your body would be broken up, processed and then reformed, making up for your natural deficiencies, making a powerful body.”</p><br/><p>Zuo Mo pointed at his face and said, “In other words, this face now has no jingshi of a connection with my previous one?”</p><br/><p>“Exactly.” Pu Yao was slightly cheerful at the misfortune. “Not just not having a connection at all, your entire body has been broken, all the remaining traces have completely been destroyed. In other words, the clues from before are gone now.”</p><br/><p>Zuo Mo stilled.</p><br/><p>“You had three clues in your hands. Changing features and erasing the mind would leave behind two clues, one was on your face, the other is on your spirit. There is one more, the five element glass bead in your body. Oh, you only have two clues now.”</p><br/><p>Zuo Mo’s expression was very strange, completely different than what Pu Yao had expected. He couldn’t help but ask, “Are you not unhappy that you have one less clue?”</p><br/><p>“I’m alright,” Zuo Mo’s tone was slightly complicated. He shrugged his shoulders. “At least, I’m alive. This business is not unprofitable since I kept my little life.”</p><br/><p>Pu Yao was speechless.</p><br/><p>“What are the benefits of this body?” Zuo Mo quickly came out of his emotions and asked with anticipation. Having heard the scarce words of Pu Yao, it seemed the new body was very powerful.</p><br/><p>Pu Yao’s expression froze. He could not suppress it any longer, furiously shouting, “I didn’t do this, it’s none of my business!” before turning and leaving.</p><br/><p>Zuo Mo stilled, and then roared with laughed. He felt good about getting one over Pu Yao, the lingering depression in his heart sweeping away.</p><br/><p>———</p><br/><p>Leaving the sea of consciousness in a good mood, he suddenly thought of Zong Ru. He remembered that Zong Ru had fended off the last attack for him. If not for that shield, he would have been heavily injured.</p><br/><p>He hurriedly found Gongsun Shidi, and asked about Zong Ru’s injuries and then rushed over.</p><br/><p>Zong Ru sat with his legs crossed, his face white as paper, his presence extremely low. Lei Peng and Nian Lu were worriedly sitting beside him. Seeing Zuo Mo come, the two of them hurriedly stood up.</p><br/><p>“How are the injuries?” Zuo Mo abruptly asked.</p><br/><p>Nian Lu grimaced, “His channels were injured. It would take a period of time to recover.”</p><br/><p>“To heal channels, this is third-grade Spring Dew Dan, specifically for channel injuries. Oh, third-grade Primary Energy Dan, not bad for recovering energies. Third-grade Primary Replenishing Dan, restoring the body … …”</p><br/><p>Nian Lu and Lei Peng gaped at the pile of lingdan.</p><br/><p>After seeing Zong Ru, Zuo Mo remembered the Rainbow Mark butterfly that he had forgotten in the mountain valley. He called for the Rainbow Mark butterfly through the beast service card, but to his disappointment, the Rainbow Mark butterfly did not reply. If the energy of the Rainbow Mark butterfly was not still present, he would have assumed that the Rainbow Mark butterfly had died of poison.</p><br/><p>Since the Rainbow Mark butterfly was still alive, he felt slightly reassured. Without the use of Rainbow Pupil, the black poisonous mist inside the mountain valley was enough to take his little life. He instantly discarded the thought of going to inspect the mountain valley.</p><br/><p>He burrowed back into his room, and started to investigate his new body.</p><br/><p>———</p><br/><p>There was a question that puzzled Gongsun Cha, the fifth-grade ling beast was in the hands of the two ningmai. It had to be said that fifth-grade ling beasts were able to enter the ranks of high level ling beasts. They were not something that ningmai could command. How could it not be a puzzled how one appeared in the hands of two ningmai?</p><br/><p>He was extremely attentive, and called Nian Lu and Lei Peng over to ask for the details.</p><br/><p>“It’s the Kong Brothers.” Luckily, he had Xie Shan who was familiar with Venerable Chi’s base. He explained. “The Kong Brothers had managed to discover a secret technique from somewhere, if the three worked together, they can summon a fifth-grade Bloody Horned Serpent. They were the strongest helpers of Venerable Chi. Supposedly, the secret technique they found was not complete. The fifth-grade ling beast they summon is not truly fifth-grade, and can only be considered a quasi-fifth-grade beast. The reason that the Bloody Horned Serpent escaped control might be related to us having killed Big Kong.”</p><br/><p>Even Xie Shan would never have thought that his speculations perfectly matched what had actually happened.</p><br/><p>Gongsun Cha felt that it was plausible. To say of nothing else, the power of a fifth-grade ling beast definitely was higher than three ningmai xiuzhe. If this secret technique did not have any flaw, no one would have survived.</p><br/><p>Suddenly, someone hurriedly ran in. “Head, head!”</p><br/><p>The subordinates usually called Gongsun Cha Head, and Zuo Mo Boss.</p><br/><p>“What is it?” Gongsun Cha asked. He wondered inside, did something else happen?</p><br/><p>“A female xiu was floating in the river, the brothers pulled her out.”</p><br/><p>“Female xiu?” Gongsun Cha stilled. It took a long time for him to react. After leaving Wu Kong Mountain, he had not encountered female xiu again.</p><br/><p>In cultivation, there was no difference between female and male. Many sects even took only female disciples. The only type of cultivation that had a difference was probably the dhyana xiu which cultivated their bodies. Females loved beauty, liked their skin snowy white, and had no interest in bronzed skin and hard bones. Supposedly, Little Mountain Jie had female-only factions.</p><br/><p>“ Let’s go see,” Gongsun Cha did not hesitate in saying .</p><br/><p>When Gongsun Cha hurried to the camp, he quickly saw this female xiu. More accurately, it was a wounded female xiu.</p><br/><p>“I say, she is just a bit too ugly.” Gongsun Cha did not realize how malicious his words were as he said in shock.</p><br/><p>“Really.” Xie Shan agreed empathetically, nodding his head.</p><br/><p>The unconscious female xiu was seriously injured, the hair flowing free, her entire body giving off a nasty smell. Her face was full of crusted scabies. She was dressed in a torn and white robe, not much different from a beggar. Her feet were bare, her legs patched in bruises.</p><br/><p>Zuo Mo had hurried over when he heard the news. His expression was serious due to Pu Yao’s words.</p><br/><p>“She’s been infected with yao poison.”</p><br/><p>“Yao poison.” Zuo Mo’s expression became slightly ugly. “You mean that she was wounded by the yao?”</p><br/><p>“Exactly.” Pu Yao, who had felt that his status had become threatened lately did not hold anything back anymore, not forgetting to show off at anytime. “This is a very common yao poison, made from Green Thorn Vine. They used this thousands of years ago. I hadn’t thought they would still use it.” At the end, he did not forget to review like he usually did. “Did they live one thousand years more for nothing?”</p><br/><p>Zuo Mo did not pay attention to Pu Yao. He suddenly raised his head. “Where did she float from?”</p><br/><p>Xie Shan stilled and then ran to ask the xiuzhe who had discovered the female first. After a while, he pointed at a direction on the river. “Floated from there.”</p><br/><p>Gongsun Cha also reacted at this time. The two of them exchanged a look. Sky Moon Jie!</p><br/><p>That direction, it was the direction of Sky Moon Jie!</p><br/><p>This female xiu had escaped from Sky Moon Jie. The two of them were extremely shocked. Their present position was not far from the jie river. However, this female xiu was the first person that they had found who had escaped from Sky Moon Jie. Without a doubt, the yao army had locked down the jie river. It was not hard to accomplish. They only needed to send a troop to occupy Desolate Wood Reef, and then they could secure the jie river.</p><br/><p>This female xiu was very strong!</p><br/><p>Zuo Mo and Gongsun Cha exchanged another look with the same idea, getting the other on their side. To say of nothing else, this female xiu’s power was not of a normal ningmai to be able to break through the blockade. Even more, all of them came from Sky Moon Jie, this made the two people feel slightly closer to her.</p><br/><p>Having made a decision, Zuo Mo asked Pu Yao, “How do you neutralize the poison?”</p><br/><p>Translator Ramblings: If you are reading this, it means that I haven’t found internet access in the last 24 hours. This is a scheduled post so sorry for not responding to your comments for the last chapter. I’ll most likely be actually with internet before the next chapter.</p><br/><p>To disappoint some of you, Zuo Mo did not become a handsome person. Isn’t Pu Yao and Gongsun Cha “eyecandy” enough? In other news, Zuo Mo has been the piece of meat that Pu Yao and the gravestone have been fighting over. Pu Yao just lost a bit due to his desire for earth energy to recover which the gravestone took advantage of. One Stars in Daytime later, and Zuo Mo now has a new body. Zuo Mo obviously cannot do anything to control these two beings so being accepting is actually the best response. The two of them are definitely not done yet.</p><br/><p>Xie Shan shows his usefulness. As someone mentioned, if Zuo Mo can defeat a fifth-grade ling beast, and that is equal to a jindan, he should be able to beat a jindan, he can’t because that wasn’t a true fifth-grade. But now he shows some hope of being able to do so with help from others.</p><br/><p>We get a female character again, other than Silly Bird. Sex ratios are really skewed sometimes in fantasy novels. A common trend is that the males are opponents of the main character while the females are companions. Up to this point, Fang Xiang’s character gender ratio is not too bad. It is still not fifty-fifty despite what he said in this chapter about differences between the sexes, but there are some developed female characters. What is a mystery to me is where the female xiu in Little Mountain Jie all gone to. All the people we’ve encountered in Little Mountain Jie so far are male, except the one in this chapter. I’m not sure if they all died off, or they evacuated quickly and had the money to pay to cross the jie river.</p><br/>\n</div>"}