{"title": "Chapter Two Hundred and Thirty Two – Gongsun Cha’s Insane War Tactics", "id": 232, "volume": 3, "url": "http://boxnovel.org/world-of-cultivation-chapter-two-hundred-and-thirty-two-%E2%80%93-gongsun-cha%E2%80%99s-insane-war-tactics", "volume_title": "Volume 3", "body": "<h1>Chapter Two Hundred and Thirty Two – Gongsun Cha’s Insane War Tactics</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Two Hundred and Thirty Two – Gongsun Cha’s Insane War Tactics</p><br/><p>Pu Yao felt very good.</p><br/><p>He felt a certain kind of satisfaction each time he trampled Gongsun Cha, especially after he was defeated by Zuo Mo. That guy was getting more and more clever over time, and was not so easily tricked. The price he paid with each transaction was increasing. If the conditions were not what Zuo Mo wanted, it was basically impossible to persuade him. What made Pu Yao so irritated about Zuo Mo was that if he felt it was not good, he would just ignore the deal, and not be swayed no matter how Pu Yao provoked and willed.</p><br/><p>Many times, Pu Yao felt he was a mouse pulling Zuo Mo, the turtle, and had no other solution.</p><br/><p>Compared to the hardheadedness of Zuo Mo, Gongsun Cha was like a girl with her arms open, allowing him to do as he wished. Every time he was blocked off by Zuo Mo, Pu Yao would find pleasure from Gongsun Cha’s body.</p><br/><p>This time, the battle situation was not different from any previous time. He had built an advantage very early on. What came after was more of a game of cat and mouse.</p><br/><p>Pu Yao had more than enough skill to be proud, especially in the area of directing battle. In his eyes, Gongsun Cha was just a slightly talented youth. This kind of talent was not enough for him to be shocked. Through the Thousand Year war, he had seen too many young genius battle generals.</p><br/><p>This kind of talent, oh, maybe he could only be the head of a little squad.</p><br/><p>It was a pity Zuo Mo was not interested in becoming a battle general. Pu Yao smacked his lips with regret. If that was possible, it would be so satisfying to abuse him! Pu Yao yearned for the scene of Zuo Mo being totally defeated by him.</p><br/><p>He had no interest in teaching Zuo Mo to become a battle general, but Zuo Mo clearly had no interest in playing with him, so facing Gongsun Cha became his only choice.</p><br/><p>It was so boring recently, Pu Yao sighed inside. He propped up his chin, his bloody pupil filled with an empty loneliness. After spending thousands of years in the Yao Forging Tower, his soul had been seriously damaged. Cultivation was not very useful to him at present. Previously, the secret method that he had been placing his hopes on did not bring the benefits that he had imagined. Right now, he could only pin his hopes onto Zuo Mo.</p><br/><p>But that hope looked so infinitesimally small.</p><br/><p>Maybe, very soon, he would dissipate like smoke. He smiled. He thought of the gravestone, and the loneliness in his eye decreased.</p><br/><p>Hmm!</p><br/><p>When he swept across the battleground from the corner of his eye, he couldn’t help but still.</p><br/><p>An ambush?</p><br/><p>A middle-sized troop of Little Edge Mantis mo suddenly appeared at the side of his main army.</p><br/><p>Pu Yao knew a great deal about any kind of yaomo. Little Edge Mantis mo was not an exception. Little Edge Mantis mo was a low level mo, the same level as White Scaled Attendants. However, its offensive power was three times that of a White Scaled Attendant! In low level mo, the offensive power of Little Edge Mantis mo was able to rank third.</p><br/><p>Most mantis mo lived in the forests. They were natural blade wielders in the forest. After their intelligence was awakened, the pair of blade-like raptorial forelegs would detach, and become their best mo blades. At the same time, their instincts would also wake.</p><br/><p>Compared to those high level mantis mo, Little Edge Mantis mo was one of the lowest mantis mo, but even so, their strong offense was enough for them to be famed among low level mo.</p><br/><p>However, compared to their powerful offense and grand blade mo skills, their defensive power was pitifully low. The thin mo armor on their bodies was like paper, and almost could not stop any attack. This was also the weakness of almost all the mantis mo.</p><br/><p>Due to the characteristic of the Little Edge Mantis mo, they were frequently used to fill battle technique units, not main attack units.</p><br/><p>Gongsun Cha had actually used an ambush of a troop of Little Edge Mantis mo, and there was a lot of them.</p><br/><p>There was no time for him to think more. The black blade lights were like a tide crashing against the shore, layer building upon layer. The entire troop was like a burning hot blade easily slicing through butter.</p><br/><p>Little Edge Mantis mo’s attack power that was beyond its power level was completely shown at this time!</p><br/><p>Pu Yao’s army was cut apart at the waist.</p><br/><p>This group of Little Edge Mantis mo was also damaged, with not even half remaining.</p><br/><p>The troops that had been pushed to the corner of the battlefield attacked at the same time, like a spring that had been compressed to the limit and exploded with all its power! The troop formation changed from an orb formation to a column formation. The two troops attacking from the left and right towards the two sides of Pu Yao’s forces, a furious counterattack!</p><br/><p>Pu Yao saw the sudden change in the battle but was not panicked. The other’s counterattack was sharp and furious, but it was just the last vestiges of strength.</p><br/><p>He did not hesitate in pressing his forces forward. The perimeter did not attack, but stuck to the enemy, keeping a mid-range distance. He furiously calculated inside. He was waiting for the other to run out of power. Once the other was fully expended, it would be time for him to counterattack. The middle of his forces had already prepared. The following attack would be like lightning and quickly destroy the enemy.</p><br/><p>He believed that the other’s troops would soon collapse. This had already happened multiple times previously.</p><br/><p>He did not worry at all about the remainder of the troop of Little Edge Mantis mo. The fragile defense of the Little Edge Mantis mo meant that they only had one chance to attack in such a crowded battlefield. No matter how high their attack strength was, they would quickly be killed.</p><br/><p>The two troops that had broken through towards his flanks, which were guarded by his troops, so they had no chance of escape. Pu Yao smiled coldly inside. Gongsun Cha’s commander definitely would be in one of the troops.</p><br/><p>In the wargame, a loss would only be set when the highest ranking general was killed. Gongsun Cha’s highest commander definitely was hiding in one of the two troops that had tried to break away.</p><br/><p>Yet suddenly, something shocking happened.</p><br/><p>The Little Edge Mantis mo, of which half had been just killed, divided into two little groups that charged straight into the back of Pu Yao’s forces.</p><br/><p>What was he doing?</p><br/><p>Pu Yao was slightly puzzled. Two little groups, each group had less than twenty people. This kind of Little Edge Mantis mo troop basically had no use.</p><br/><p>Little Edge Mantis mo troops were frequently used to ambush, but their fragile defense determined their extremely short lifespans on the battlefield. If the other’s formation was dense, in order to complete the break through, there needed to be a certain number. The reason that the group of Little Edge Mantis mo had been able to so easily cut through his forces had been due to how thick the troop had been.</p><br/><p>It was like a blade made from ice. It might be sharp, but it would quickly melt.</p><br/><p>Such a small troop, other than causing some fatalities, they basically could not affect the battlefield at all.</p><br/><p>Suddenly, a blinding light suddenly lit up at the head of the Little Edge Mantis mo troop at the very front.</p><br/><p>That was not right! Those were not Little Edge Mantis mo!</p><br/><p>Pu Yao’s bloody pupil widened, his face full of disbelief!</p><br/><p>Boom boom boom!</p><br/><p>A string of powerful explosions. A gigantic gap appeared in Pu Yao’s forces in the back half that had been cut away.</p><br/><p>This light … … Pu Yao recognized it.</p><br/><p>Balloon Fish mo’s Suicide Detonation!</p><br/><p>Pu Yao instantly realized what had happened.</p><br/><p>Those two groups hadn’t been Little Edge Mantis mo at all, but were all Balloon Fish, that used illusions … … water mist illusions. That was correct. If it was him, he would also have chosen water mist illusions. The illusions that were made up of countless threads of water mist would tightly wrap around the person it was cast on.</p><br/><p>Most importantly, the water mists could provide rich moisture to the Balloon Fish mo … …</p><br/><p>Balloon Fish mo was something no one willingly provoked. They had hundreds of little sacks on their bodies. Those sacs contained the water element power that they absorbed from the Endless Ocean. If they encountered an enemy, these pure water element power would become their weapon to attack their enemies. No one dared to provoke them, not because they were strong, but due to their Suicide Detonation.</p><br/><p>This was the last move of the Balloon Fish mo to kill themselves and their enemies. The Suicide Detonation of the Balloon Fish mo was extremely terrifying. Even mo of higher levels would not be able to easily deal with it. Adding on that their intelligence was not very high, and they were not afraid of death, if they were provoked, what waited was serious damage to both sides.</p><br/><p>But Pu Yao’s reaction was a beat too slow. The second group of Balloon Fish mo burrowed into the hole that had just been carved out by the explosions!</p><br/><p>Another fierce string of explosions!</p><br/><p>Pu Yao’s expression was extremely bad. His rear forces had been very dense. The Suicide Detonation of the two groups of Balloon Fish mo instantly increased his losses greatly!</p><br/><p>However, he released a small breath inside. The battlefield this time only had some small sized ponds. There would not be high numbers of Balloon Fish mo. Gongsun Cha should not have any more Balloon Fish mo.</p><br/><p>Wait!</p><br/><p>Pu Yao’s face changed again!</p><br/><p>He suddenly realized that he had missed an important question.</p><br/><p>The Suicide Detonation of the Balloon Fish mo was powerful, but it was rarely used because there was a rule in war chess. In the regulations of the war chess, the Suicide Detonation of the Balloon Fish mo was only possible under one condition … …</p><br/><p>His eyes suddenly turned towards the two groups that were trying to break away.</p><br/><p>The two groups that should have been furiously trying to break through, in Pu Yao’s eyes, looked somewhat loose.</p><br/><p>That was right … …</p><br/><p>The bloody pupil suddenly shrunk, Pu Yao’s gaze was sharp and fierce!</p><br/><p>Gongsun Cha’s highest commander was not in these two groups, but in … … his gaze landed on the remaining Little Edge Mantis mo that was located at the rear of his forces!</p><br/><p>There!</p><br/><p>At this time, Pu Yao finally comprehended Gongsun Cha’s intentions. The forces that had been forced to retreat back into the corner was bait. The ambush forces were the true attack force. This had been a trap, an extremely convincing trap!</p><br/><p>Just as Pu Yao realized that it was the Suicide Detonation of the Balloon Fish mo, he could not react in time. No one had used this kind of tactic before. In war chess, the setup for the Balloon Fish mo had been they would only agree to detonate only under the direct orders of the highest commander! In the past, the Balloon Fish mo had always acted as the last barrier in front of the highest commander.</p><br/><p>Gongsun Cha’s intention had not been to break away, but to kill Pu Yao’s highest commander!</p><br/><p>For some unknown reason, Pu Yao felt a burst of coldness rise into his heart.</p><br/><p>The entire battlefield, all the forces, they were all sacrifices! No, they were all cannon fodder! The two troops needed to attract the attention of the front forces, so they had to get the other to move closer, and fight for time for their own middle forces. What waited for these two groups was only complete fatalities. As to the ambushers? There was only one outcome, death!</p><br/><p>Even if Gongsun Cha managed to kill his highest commander, he could not charge out of such a thick encirclement. To not attract Pu Yao’s attention, the personal guard was disguised as Little Edge Mantis mo. There could not be many people, and the outcome was naturally fated.</p><br/><p>In other words, Gongsun Cha had never thought of winning this battle. He only had one thought – to die together!</p><br/><p>“This madman!”</p><br/><p>Pu Yao muttered, his eyes unfocused.</p><br/><p>Translator Ramblings: Fang Xiang has left all of us hanging on Zuo Mo’s situation but we see what Gongsun Cha gets to do. To clarify, what Pu Yao and Gongsun Cha are playing isn’t one battle with a fixed army, they are going through a whole battle campaign each time. So starting from making the army, taking territory to setting up defensive lines.</p><br/><p>For the balloon fish mo, I don’t know what to say. They seem to be great bombs, but if you think of them as people, then they are the most expendable troop on the battlefield. If they go onto the battlefield, their only use is to explode so it must be terrible to fight if you are a balloon fish mo. The only benefit is that your commander is going to help out your clan, if what Pu Yao said holds.</p><br/><p>The tags are there for the benefit of you guys. So if you just want to read Zuo Mo’s part, or Wei Sheng’s, or Pu Yao (for the comedy), it is easy to do so.</p><br/>\n</div>"}