{"title": "Chapter Two Hundred and Forty – What Was Going On?", "id": 240, "volume": 3, "url": "http://boxnovel.org/world-of-cultivation-chapter-two-hundred-and-forty-%E2%80%93-what-was-going-on", "volume_title": "Volume 3", "body": "<h1>Chapter Two Hundred and Forty – What Was Going On?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Two Hundred and Forty – What Was Going On?</p><br/><p>Gongsun Cha found Zuo Mo and faithfully told him the news he had received.</p><br/><p>The further he listened, the uglier Zuo Mo’s expression became.</p><br/><p>“This Clear Sky Sect is truly too evil! They want to use all of Little Mountain Jie to feed only them!” Zuo Mo was extremely furious, but he quickly calmed down. “We need to move faster! The longer it takes, the harder the days will get. When this Outer Hall of theirs truly stabilizes, they would have many fighters. If we want to charge out, it would be much harder.”</p><br/><p>“En!” Gongsun Cha nodded his head heavily, a flash of anger in his eyes. Clear Sky Sect’s actions was equal to farming the xiuzhe of Little Mountain Jie as though they were ling beasts. When it was time, they would be no different than those xiu slaves.</p><br/><p>“I have a solution,” Zuo Mo said after some thought.</p><br/><p>“What solution?” Gongsun Cha asked hurriedly.</p><br/><p>“They sell ling grains, we’ll sell Black Processing Meditation mats!”</p><br/><p>Gongsun Cha was slightly puzzled and spoke, “Wouldn’t it be too much of a waste if we sell the Black Processing Meditation mats to them? At that time, the price of jingshi in Little Mountain Jie would inflate dramatically.”</p><br/><p>“Sell!” Zuo Mo said hatefully, “We won’t just sell, we’ll sell in large quantities! As long as the Black Processing Meditation mats are sold, the noose on everyone’s necks would not be so tight. If Clear Sky Sect cannot finish establishing the status quo, all of their past effort would be for nothing. When Clear Sky Sect discovers that it is us who ruined their business, they would definitely come to our doors. Hee hee, wait at leisure while the enemy labors, this way, we can set a trap for them! A strong dragon does not suppress the local snakehead. On our territory, it isn’t up to them how things are done.”</p><br/><p>Gongsun Cha’s eyes instantly lit up.</p><br/><p>The two of them discussed for a long time inside the room, dark snickers occasionally passing out of the room.</p><br/><p>———</p><br/><p>Lei Peng, Xie Shan, and the others found to their surprise that Head’s mood today was very good, the shadow on his face seemed to have been swept away. Usually, when Lil’ Miss’ mood was good, everyone had easier days.</p><br/><p>However, before they had time to be happy, they heard Lil’ Miss announce that, from today onward, training was multiplied!</p><br/><p>Wails rang out into the landscape!</p><br/><p>Fortunately, the xiuzhe who made it through the cruel battles were not resistant to harsh cultivation.</p><br/><p>Truthfully, what everyone wanted the most was access to that sword formation. Every xiuzhe that came out of the formation would go into seclusion. Up until now, several had comprehended sword essence after entering the sword formation. Something this good that went against the common knowledge was naturally very tempting to many. However, there were too many monks yet not enough porridge. The sword formation only allowed for one person to cultivate at a time. Gongsun Cha had a headache over the matter and could only use it as a part of the rewards for service.</p><br/><p>Seeing the busy camp, Gongsun Cha sighed. If there was more time, he would definitely have made a true elite force.</p><br/><p>It was a pity what they lacked the most was time.</p><br/><p>When they charged out of Little Mountain Jie, he would find Shixiong, and make a true troop.</p><br/><p>Having tasted what it was like to be a battle general, it would be really bland if he had to do something else.</p><br/><p>However, what was going to happen next really filled him with anticipation!</p><br/><p>———</p><br/><p>After giving many matters to Gongsun Shidi, the amount of matters Zuo Mo had to attend to made his scalp prickle. The crux of this plan was Black Processing Meditation mats, and large amounts of them.</p><br/><p>It was not difficult to make Black Processing Meditation mats, but the volume was too large. In the recent while, Zuo Mo had used up all the spare time he had outside out of cultivation to make Black Processing Meditation mats. The amount needed now was much higher, and he did not have an assistant. He needed to complete all of the work by himself.</p><br/><p>This clearly was not realistic!</p><br/><p>He decided to pick some xiuzhe who had the basics of forging from the camp to help him. What surprised him was that there were more than fifty people of the four hundred and fifty who knew the fundamentals of forging. Zuo Mo only understood after he asked. These xiuzhe mostly had no sect, and after they entered ningmai, they naturally had good days. However, before they entered ningmai, they were no different than any other low level xiuzhe.</p><br/><p>Basically, everyone had a skill. Ling farming, animal husbandry, forging, etc. Zuo Mo and Gongsun Cha gaped at the variety.</p><br/><p>However, even though most of them had learned the basics and had spent longer on forging than Zuo Mo had, but due to the lack of a systematic education, they had only done some very basic jobs. After ningmai, they had not done much.</p><br/><p>There were two who were exceptions. One of them was called Ji Wei, the other Sun Bao. The two had made a living from forging before the change in Little Mountain Jie. Their skill in forging was much higher than Zuo Mo. Zuo Mo treasured the two of them when he found them.</p><br/><p>He even managed to take out the Golden Crow Fire and allowed the two of them to absorb it.</p><br/><p>It was like the two of them had been hit with jingshi from the sky, they were so happy they almost fainted. Golden Crow Fire! This was Golden Crow Fire! The two had schemed and made countless efforts, but had never found a fire seed that could satisfy them.</p><br/><p>So when Zuo Mo threw each of them a mini box and told them that a thread of Golden Crow Fire was sealed inside, their hands shook so much they almost dropped the boxes.</p><br/><p>Other than happiness, the two deeply felt the importance Boss placed on them.</p><br/><p>It was not a joke!</p><br/><p>This was Golden Crow Fire!</p><br/><p>Fourth-grade fire seed!</p><br/><p>The fire seed that any person in forging or dan-making dreamed about!</p><br/><p>Yet before the two of them were able to feel smug, they saw Zuo Mo pick out ten more people with the highest skill in forging, and give each of them a mini box!</p><br/><p>Ji Wei and Sun Bao were dumbstruck, their expressions as though they had seen a ghost!</p><br/><p>It was not just them. When the ten people had been picked out, they had been looking with admiration at the two. Now, they were holding the mini box, a stunned expression on their faces, their minds completely blank.</p><br/><p>The remaining xiuzhe were also completely stunned. The temperature of the room rose dramatically.</p><br/><p>“Work hard!” Zuo Mo waved his hand like a show off. Taking in everyone’s gazes, it was like he had eaten ginseng fruit, his entire body unspeakably comfortable.</p><br/><p>There was no way around it, ge just has a lot of Golden Crow Fire!</p><br/><p>This group of xiuzhe that had been dissatisfied at having been transferred over to a new troop started to furiously work as though they had been shot with chicken blood. Their enthusiasm with work made Zuo Mo jump in fright. They wouldn’t die from working this hard, right … …</p><br/><p>Zuo Mo taught the formations of the Black Processing Meditation mat to Ji Wei and Sun Bao. When Zuo Mo finished teaching them, the two were motionless as though they were two pieces of rock.</p><br/><p>From then on, the two had truly been convinced.</p><br/><p>———</p><br/><p>Zuo Mo concentrated solely on his work. When he raised his head in rest, he noticed that a person was standing in the doorway. Hm, he gave a surprised expression, and stopped what he was doing.</p><br/><p>“You woke up?” asked Zuo Mo. The other person was just standing there. He didn’t know how long it had gone on.</p><br/><p>This female xiu stood there woodenly as though she had not heard him speak.</p><br/><p>Had she become stupid due to her injuries? Zuo Mo muttered inside.</p><br/><p>“What are you called?” he probed.</p><br/><p>The female xiu did not respond.</p><br/><p>“Did your injuries really turn you stupid?” Zuo Mo rubbed his chin as he thought. He decided to try one more time. “Are you hungry?”</p><br/><p>The female xiu still did not react.</p><br/><p>Seeing the female xiu’s face that was full of scabies, Zuo Mo was suddenly filled with empathy. He remembered his past zombie face.</p><br/><p>When she had been unconscious, Zuo Mo had checked. Her face did not have any disguise. The scabies on her face were caused by a certain kind of poison inside her body. Adding on the new and old inner wounds that could not be counted, Zuo Mo felt it was a miracle she was still alive.</p><br/><p>After the last try had failed, Zuo Mo had a bit of headache and could only give up. “Do whatever you want.”</p><br/><p>He didn’t feel the other understood, but right now, he had too many things to do. Even though the creation of the Black Processing Meditation mat had been basically given to other people, but he still had other work.</p><br/><p>Any complete plan was constructed of many conditions.</p><br/><p>He decided to do his own work. When he turned to leave, he heard footsteps behind him. This female xiu followed behind him without a word.</p><br/><p>Zuo Mo instantly felt his temple start to hurt.</p><br/><p>“Hey, there’s no jingshi you can earn by following me!”</p><br/><p>“I don’t have the time to play with you, go play by yourself.”</p><br/><p>“There really is no jingshi to be earned!”</p><br/><p>“I’m warning you, if you don’t stay far away, I won’t be polite to you!”</p><br/><p>Zuo Mo pretended to cast a spell. Out of the corner of his eye, he saw the female xiu’s movement, and his pupils sudden expanded. The other had also raised a hand. A light flashed at her fingertip, the air in the surroundings suddenly became sticky!</p><br/><p>Motherf*****!</p><br/><p>Zuo Mo’s soul almost ran out of his body. He hurriedly released the ling power in his hands, hurriedly saying, “Let’s just talk … … let’s just talk … …”</p><br/><p>The female xiu still did not say a word, but followed Zuo Mo, the light at her fingertip dissipating. As she lowered her arm, the air in the surroundings returned to normal!</p><br/><p>“Such a powerful little girl!” Pu Yao’s shocked sigh sounded in Zuo Mo’s mind, but when Zuo Mo heard it, it clearly had a hint of laughing at his misfortunes.</p><br/><p>Zuo Mo had no solution. He basically could not communicate with this female xiu. As to attacking? When he thought of that terrifying light, Zuo Mo’s heart shook. The last bit of hope was destroyed.</p><br/><p>“If you want to follow, then follow!” At the end of his rope, Zuo Mo muttered.</p><br/><p>“Hahahaha!” Pu Yao’s roaring laughter, and the silence from the female xiu made Zuo Mo suddenly feel that life was dark.</p><br/><p>The xiuzhe in the surrounding all looked with fear at the female xiu behind Zuo Mo. The strength that the female xiu had just displayed made everyone jump. Zuo Mo perceptively noticed that in these people’s eyes, other than terror and fear, there was a hint of disgust.</p><br/><p>Zuo Mo suddenly felt uncomfortable inside.</p><br/><p>But he also knew this was a normal response. When he had first seen the female xiu, he had also been frightened by the scabies on her face.</p><br/><p>He randomly picked out a black ore from the pile of material and summoned the Golden Crow Fire before throwing the ore inside. The burning Golden Crow Fire instantly melted the ore into a puddle of red metal liquid. Zuo Mo’s mind moved, and it appeared as there was an invisible force that pulled the metal liquid. The metal liquid slowly changed shape.</p><br/><p>The female xiu stared at the Golden Crow Fire and metal liquid.</p><br/><p>After a while, a mask appeared on Zuo Mo’s hands.</p><br/><p>The black mask was very plan. There were no patterns or decorations. What was most strange was the ratio was slightly off, the right and left sides of the mask were not symmetrical. Zuo Mo instantly felt slightly embarrassed. “Oh, first time making a mask, my hand was raw, raw! Oh, let’s redo it … …”</p><br/><p>He was just going to remake one when a great force pass into his hands from the mask and then the mask flew into the hands of the female xiu.</p><br/><p>The female xiu put on the mask.</p><br/><p>“Oh, let’s remake that one,” Zuo Mo rubbed his hands and said embarrassedly.</p><br/><p>The right and left sides really were not symmetrical … … Heavens! He had made such an elementary mistake! Looking at the strange looks from the subordinates in the surroundings, he wanted to find a hole in the ground and hide in it.</p><br/><p>This was a great embarrassment!</p><br/><p>The female xiu did not say a word, and seemed to not have any intentions of taking off the mask.</p><br/><p>Seeing the situation, Zuo Mo perceptively gave up on his plan of making another one. He tried to do his own work and found the female xiu did not disturb him. She only stood there like a person made out of wood.</p><br/><p>Zuo Mo gradually became used to her.</p><br/><p>However, there was a question that was swirling in his mind.</p><br/><p>This, what was going on?</p><br/><p>Translator Ramblings: Yes, they are selling black processing meditation mats like a lot of you predicted. There’s an interesting economy going on right now where the mainstream currency is food and not jingshi.</p><br/><p>Zuo Mo has learned a great skill in this chapter, delegation. He didn’t really need it before and he did delegate to Gongsun Cha but this is delegating an area that he is skilled in away so he can create a factory for black processing meditation mat.</p><br/><p>No symmetry … … I keep imagining one of those masks with one half smiling and the other half frowning.</p><br/>\n</div>"}