{"title": "Chapter Three Hundred and Four – Great Day Mo Physique", "id": 254, "volume": 3, "url": "http://boxnovel.org/world-of-cultivation-chapter-three-hundred-and-four-%E2%80%93-great-day-mo-physique", "volume_title": "Volume 3", "body": "<h1>Chapter Three Hundred and Four – Great Day Mo Physique</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Three Hundred and Four – Great Day Mo Physique</p><br/><p>The jie rivers were hard to cross. Every jie river was very lengthy.</p><br/><p>Inside the cabin, Zuo Mo was focused on cultivation.</p><br/><p>“Golden core! My golden core!” Once Pu Yao spoke of the jindan, he started to become irritable. “Fought a jindan and almost lost your little life, and you didn’t get me the golden core!”</p><br/><p>Zuo Mo was slightly embarrassed. Before, he had promised to give a jindan to Pu Yao but that was unfulfilled. Thinking about it now, jindan were not as terrifying as he imagined. As long as he had the right method, it was possible to defeat a jindan.</p><br/><p>After careful thought, the strongest quality of a jindan was their speed. This caused jindan to have the absolute advantage when facing ningmai xiuzhe. For a powerful jindan to kill with a strike was not uncommon, but it was not possible for one strike to kill ten ningmai.</p><br/><p>In comparison, a jindan’s defensive advantage was the least eye-catching .Even though the sword energies of a single ningmai could not seriously wound them, but if dozens of sword energies struck at the same time, even a jindan could not bear it.</p><br/><p>What was most scary was if the jindan decided to kill everyone at the expense of their life. If a jindan decided to go all out, the power they could release was multiple times what it was normally.</p><br/><p>Experience was the most valuable.</p><br/><p>With the experience from last time, if he had to fight with Clear Sky Old Forefather again, he even had the confidence to kill Clear Sky Old Forefather with just Vermillion Bird Camp.</p><br/><p>Facing Pu Yao’s mockery and scorn, he could only grimace inside. The reason the battle against Clear Sky Old Forefather had been so difficult was because he had been frightened by the connotations of a jindan xiuzhe. Now he knew that being on the defense would cause him to become even more reactive when facing a jindan xiuzhe.</p><br/><p>Pu Yao clearly knew this. At this point, his wailing was just to satisfy his mouth.</p><br/><p>Hearing Pu Yao natter at his ears, Zuo Mo really could not bear it any longer. He stopped his cultivation. “Alright, alright! I’ll make it up to you!” He then muttered, “An honored Sky Yao is actually … … hmph hmph … …”</p><br/><p>Pu Yao pretended not to hear. After a while, he could resist tempting Zuo Mo, “Actually, jindan are very easy to kill. You didn’t have the abilities before but it is different now. Look, you have so many people under your command, and you also made a breakthrough … …”</p><br/><p>“Breakthrough?” Zuo Mo’s mind jumped. “Let’s talk more about this.”</p><br/><p>“It’s strange now that you speak of it. Your talent in the consciousness and ling power doesn’t seem outstanding, but you are abnormally fast in cultivating the mo skills. It really is weird.” Pu Yao was slightly discontent, but still said, “You still remember your mo physique?”</p><br/><p>“Of course, Jade Metal Head. Ranked fifth in the captain stage,” Zuo Mo answered.</p><br/><p>“Exactly. At the beginning, I assumed you would go to Star and Moon Wheel. But with such coincidences, you transformed into another kind of mo physique.” Pu Yao seemed slightly helpless but also grave. “There are one hundred and seventy two types of colonel mo physiques. Ranked first is Mystical Earth, second is Great Day, third is Demonic Fiend Sea.”</p><br/><p>“Mystical Earth is not yin or yang, and is the only mo physique in colonel level mo physiques that doesn’t belong to either. The biggest reason that it is ranked first is that it can develop into any brigadier physique, including the top three brigadier physiques.”</p><br/><p>“Great Day is yang and unyielding, filled with brutal power. It is the best for developing any kind of yang and unyielding mo physique in the future. Demonic Fiend Sea is yin and deceptive, and the best for transformations.”</p><br/><p>“I have the Great Day mo physique?” Zuo Mo seemed to understand.</p><br/><p>“Right.” Pu Yao explained, “During the fight with Clear Sky Old Forefather, you coincidentally activated the big formation. The big formation processed your body, the essence of Golden Crow, hard lightning, and earth fire. All of those are yang and unyielding substances. Under these coincidental conditions, it allowed you to develop the Great Day mo physique.”</p><br/><p>When he spoke to there, Pu Yao rolled his eyes. “It’s just you. If this was another other mo that cultivated to Great Day mo physique, he would already have gone to find a jindan to feed on. Afraid of a jindan? Humph!”</p><br/><p>“Feed?”</p><br/><p>“What is strange about that? The inner core of yaomo are treasures to xiuzhe, the jindan of a xiuzhe is also great food for yaomo!” Pu Yao’s vividly red tongue unconsciously licked his lips. “You could try. That taste is delicious.”</p><br/><p>Zuo Mo shook, and then swore, “Pu Yao, you pervert!”</p><br/><p>Pu Yao was not affected. “It’s you who is too ignorant. It’s very normal for xiuzhe to use yaomo to forge and in dan-making. But you say we’re perverts for eating golden cores?”</p><br/><p>Zuo Mo was speechless.</p><br/><p>He decided to not linger on this question. “What benefits are there to this Great Day mo physique?”</p><br/><p>Pu Yao became excited. “There are many benefits. Otherwise, how can it match to a jindan xiuzhe? The first is in cultivating mo skills. You practiced [Sky Wave Fist Scripture] before, so you must know the crux to fully using the power of this fist scripture is how strong your body is. Mo skills are even more extreme on this point. In the future, you will discover than any mo skill in the end it is to cultivate the body. Great Day mo physique is innately strong and powerful. It is easier to cultivate those domineering mo skills.”</p><br/><p>“Mo skills again, you don’t have mo skills, what are you excited for?” Zuo Mo responded neutrally.</p><br/><p>Pu Yao almost choked. He decided to ignore Zuo Mo, and continued, “Mo physiques from colonel and up have many wondrous abilities. Yaomo are not skilled in forging, and really cannot stack up to xiuzhe on talismans. What do we do to compete then? One method is a soul-tethered talisman, but they are different from the soul-tethered talisman of xiuzhe. The yaomo’s soul-tethered talisman is a part of their body, like a claw, tooth, or the skin they shed, formed after being forged constantly. The other method is the transformation of the mo physique.”</p><br/><p>“Of the colonel mo physiques, each type of mo physique has its own transformations, but there are never more than six transformations. The reason that Mystical Earth, Great Day, and Demonic Fiend Sea can rank in the top three is because all of them possess six transformations.”</p><br/><p>Zuo Mo’s eyes lit up upon hearing this, “What are transformations?”</p><br/><p>“Similar to the abhinna of dhyana xiu. Didn’t you get Ling Eyes activated? The transformations of a mo physique are techniques that can use the abilities of the mo physique to the greatest degree.”</p><br/><p>“You understand the six transformations?” Zuo Mo looked at Pu Yao with suspicion.</p><br/><p>Pu Yao said calmly, “No.”</p><br/><p>“I just knew. What Sky Yao, you don’t understand anything … …” Zuo Mo muttered to himself.</p><br/><p>A vein throbbed in Pu Yao’s forehead but he suppressed himself. “I might not understand, but someone does.”</p><br/><p>“Who?” Zuo Mo was very curious now.</p><br/><p>“That guy,” Pu Yao said as he pointed at the gravestone.</p><br/><p>“The gravestone?” Zuo Mo stilled.</p><br/><p>“Right.” Smugness imperceptibly flashed across Pu Yao’s eyes. “You only need to agree to a little request from him, and he will teach you the six transformations of the Great Day mo physique, and also pass mo skills on to you.”</p><br/><p>“Little request?” Zuo Mo instinctively detected danger. He suddenly remembered the ancient voice that sounded when Pu Yao had entered his body.</p><br/><p>That damned “To abide by my ceremony, to execute my desires, to give my oath, will thou?” that had tormented him.</p><br/><p>The more he thought, the more his anger burned. In the past when ge had been tender, you felt ge was easy to bully, and shit and peed on ge’s head, ge couldn’t defeat you, so ge tolerated it! Now you want to trick ge! No one could tolerate this!</p><br/><p>He sprinted in front of the gravestone, and his foot heavily kicked the gravestone!</p><br/><p>“Idiot! You ran into ge’s sea of consciousness! Didn’t give one piece of jingshi in rent! Now you scheme against ge! Do you want to live?”</p><br/><p>Bang bang bang!</p><br/><p>Bang bang bang!</p><br/><p>As Zuo Mo swore loudly, his foot kicked the gravestone rapidly so much the gravestone wobbled.</p><br/><p>Seeing Zuo Mo turn berserk, his eyes bloodshot, Pu Yao was dumbstruck where he stood!</p><br/><p>He … … he dared to kick “him” … …</p><br/><p>Heavens … …</p><br/><p>After a long time, Pu Yao finally recovered. When he saw the gravestone that had almost been kicked over, his face instantly turned pale.</p><br/><p>“You … …”</p><br/><p>Just as he opened and said one word, he saw Zuo Mo stop and turned around. On the dark and vicious face was a pair of bloody and murderous eyes.</p><br/><p>Pu Yao swallowed. He felt he was being targeted by a wild beast. If he took a wrong step, Zuo Mo would instantly leap over. His throat felt tight. When his words reached his mouth, they became, “Let’s talk peacefully … … let’s talk peacefully… …”</p><br/><p>Zuo Mo turned around his pot-black face, and lifted his foot again.</p><br/><p>Bang bang bang!</p><br/><p>After kicking viciously for dozens of times, he finally stopped. Before he left, he did not forget to leave words behind. “Idiot, let ge tell you! You dare to scheme against ge, ge will kill you!”</p><br/><p>As he finished, he was finally content and left.</p><br/><p>Pu Yao looked dumbstruck at the gravestone. The black surface of the gravestone was covered in footprints.</p><br/><p>After a long moment, Pu Yao suddenly exploded in laughter so hard he fell down.</p><br/><p>“Hahahaha! This is the person you picked? He has such a personality! Really has a personality! Even more of a personality than you in the past! Haha! How do you feel? It must be great! Haha, I hadn’t thought there would be a day when you get kicked by other people? This is so interesting! Hahahaha! I like this guy!”</p><br/><p>In the sea of consciousness, Pu Yao’s roaring laughter echoed.</p><br/><p>———</p><br/><p>When Zuo Mo left the sea of consciousness, his anger had not been completely vented. What Great Day mo physique, ge doesn’t care!</p><br/><p>Don’t think that if you had stuff like mo skills that you can get good things out of ge!</p><br/><p>Ge doesn’t lack spells!</p><br/><p>Zuo Mo took out a large bunch of jade scrolls from the ring, and arranged them in a row.</p><br/><p>These jade scrolls had been collected over time while he was in Little Mountain Jie, and were all spells that were unique. The great majority were good fourth-grade spells. Among them, there were also two fifth-grade spells. For him, at present, this was enough to use.</p><br/><p>As to the golden core, it can go to hell!</p><br/><p>Zuo Mo suddenly had a deep understanding of a rule. Self-reliance was the true path! Back at Wu Kong Mountain, he was able to break through to the fourth level of the[Little Art of Cloud and Rain] by relying on the lowest grade jade scroll. Right now, he had this many jade scrolls and their grades were not low. There was no reason that he would deteriorate over time.</p><br/><p>Deeply stimulated by Pu Yao and the gravestone, Zuo Mo completely sank into a frenzy.</p><br/><p>Wasn’t it just spells? Wasn’t it just skills? You think if you hold onto the spells, you hold ge’s throat?</p><br/><p>If the tiger doesn’t roar, you mistake it for a sick cat?</p><br/><p>Ge will let you see why you Sky Yao and old antiques have declined to the point that you couldn’t pay the rent, and had to take out the yin beads but couldn’t sell them!</p><br/><p>While ge could hold a place in the outer sect of Wu Kong Sword Sect with just the [Little Art of Cloud and Rain], everyone calling out Little Mo ge, and the jingshi was rolling in!</p><br/><p>Translator Ramblings: World of Cultivation has fanart here by Ars. I love the crane feathers fan Gongsun Cha has, reminds me of Zhuge Liang.</p><br/><p>Pu Yao is like a child in this chapter. Gimme my candy, I want my candy, I WANT my CANDY! Zuo Mo’s upgrade is explained and he (finally!) discovers the difference between Pu Yao and the gravestone. Bit of a lighter chapter and more Pu Yao-Zuo Mo interactions so hopefully people are satisfied. Also, look, no lil’ cliffy!</p><br/><p>I researched and it turns out people pronounce “a” differently in English depending on geography and other influences. So the “a” in “A Gui” seems like “ah” to me because that’s how I usually say my “a.” Some of you might pronounce “a” like “ai” or “eh” so please keep that in mind.</p><br/><p>Should I stick the ramblings of the past chapters back into the edited chapters. I thought they were distracting between chapters so I left them out. Do they alleviate the off-putting horror that Pu Yao might seem to be?</p><br/>\n</div>"}