{"title": "Chapter Three Hundred and Three – Leaving Little Mountain Jie", "id": 253, "volume": 3, "url": "http://boxnovel.org/world-of-cultivation-chapter-three-hundred-and-three-%E2%80%93-leaving-little-mountain-jie", "volume_title": "Volume 3", "body": "<h1>Chapter Three Hundred and Three – Leaving Little Mountain Jie</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Three Hundred and Three – Leaving Little Mountain Jie</p><br/><p>“En, we need to leave this place quickly,” Zuo Mo said decisively. “Little Mountain Jie isn’t a safe place.”</p><br/><p>“When are we leaving?” Gongsun Cha then asked.</p><br/><p>“Get everyone to pack, then prepare for departure. Let them prepare well. When we pass through the Clear Sky Sect, there may be a hard battle.”</p><br/><p>“Alright.” Gongsun Cha instantly went out to prepare.</p><br/><p>———</p><br/><p>Everyone in Golden Crow City started to move. Zuo Mo released all of the Outer Hall captives. Clear Sky Old Forefather had been killed which was a fatal blow to the Outer Hall xiuzhe. At this point, no one would be willing to sell their life for Clear Sky Sect.</p><br/><p>The battle of Golden Crow City had shaken Little Mountain Jie.</p><br/><p>Right now, everyone knew that the sky had changed for Little Mountain Jie</p><br/><p>No one was willing to stay in this cage. In the span of a few days, almost all of the remaining xiuzhe from Little Mountain Jie had gathered outside Golden Crow City.</p><br/><p>They looked with awe at this little town of which only remained half standing. Everyone knew this place held the hope to leave Little Mountain Jie. No one made trouble, they only watched from a distance. When Vermillion Bird Camp’s patrols passed, many people bowed of their own initiative.</p><br/><p>From a distance, there was a spectacularly dense patch of xiuzhe outside Golden Crow City.</p><br/><p>“Will there be trouble?” Nian Lu asked worriedly.</p><br/><p>“Who’s afraid?” Lei Peng was unconcerned. “We can kill as many of these as they come.”</p><br/><p>“Ha, that’s true!” Pride flashed across Nian Lu’s face.”Before, who could have thought there would be a day like this? It’s worth it even if I die!”</p><br/><p>Lei Peng rumbled, “I don’t want to die. Boss still has so much good stuff. Maybe we can cultivate to jindan in the future.”</p><br/><p>“You really dare to think … …” Nian Lu looked into the distance.</p><br/><p>Suddenly the order to gather came from below. The two exchanged a look. They were going to depart!</p><br/><p>The Little Mountain Jie xiuzhe who had been keeping a constant eye on Golden Crow City shifted.</p><br/><p>After a short while, Vermillion Bird Camp was the first to ascend into the air. The Vermillion Bird Camp of more than seven hundred people was famed in Little Mountain Jie. When Vermillion Bird Camp collectively flew into the air, many of the people watching from afar sighed with admiration.</p><br/><p>“Look! That’s Vermillion Bird Camp! The strongest army of Little Mountain Jie!”</p><br/><p>“Whoa! That presence is really frightening!”</p><br/><p>“I wonder if they are still hiring? Death would be worth it if I could enter such a troop!”</p><br/><p>Chatter rose among the crowd. People were filled with admiration and awe as they looked at this powerful troop. No one dared to underestimate them, even if they there were only seven hundred people.</p><br/><p>Vermillion Bird Camp quickly spread out after getting up into the air. They were wary and cautious.</p><br/><p>Following them were the five gigantic slave transporting boats that slowly rose. There were one thousand black armor camp guards standing on the lead slave transport ship. That was Guard Camp who became famous in one battle. They were not skilled in flying. The enormous and steady slave transporting boats were perfect for them. The pressure of one thousand camp guards standing on the deck gave people was unparalleled.</p><br/><p>The appearance of Guard Camp caused a small crescendo of murmuring.</p><br/><p>The xiuzhe that had personally seen the heart-shaking battle described the terrifying strength of Guard Camp to the others.</p><br/><p>The ferocious killing energy and the ancient battle armor that they wore, which had long disappeared into the river of history, became the topics that interested the people the most.</p><br/><p>The other for slave transporting boats were used for the Eastern Camp, Western Camp and non-combat xiuzhe. And the last boat was filled with all kinds of materials.</p><br/><p>Slave transporting boats were enormous. In Little Mountain Jie, five slave transporting boats definitely counted as a gigantic fleet. Adding on Vermillion Bird Camp and Guard Camp, this definitely was the strongest fleet of Little Mountain Jie.</p><br/><p>———</p><br/><p>Zuo Mo looked at Golden Crow City below and was filled with emotion.</p><br/><p>It just had been a few short days, but Golden Crow City had completely transformed. It was broken and shattered. Possibly in the future, this place would become ruins of an ancient city.</p><br/><p>He raised his head and looked at the sky filled with xiuzhe in a dense cloud that did not end. He couldn’t help but sigh again. After this departure, Little Mountain Jie would become a dead jie without any people.</p><br/><p>Maybe this place would become the frontlines like Bloody Sky Metropolis Jie had previously been, a paradise of yaomo.</p><br/><p>Oh, he really had no standing to sigh. Thinking about Pu Yao in his sea of consciousness, Zuo Mo grimaced.</p><br/><p>However, they could finally leave this place … …</p><br/><p>He looked at A Gui beside him. A Gui was sitting silently. He turned his face and said to Gongsun Cha, “Depart!”</p><br/><p>———</p><br/><p>The five slave transporting boats slowly started to fly forward. Many people looked back at Golden Crow City, their eyes filled with reluctance. This little city had given them hope and sunlight. This little city would become a place they would reminiscence for their entire life.</p><br/><p>The vast troop flew towards the jie river towards Sky Water Jie.</p><br/><p>Along the way, there was a constant stream of xiuzhe merging with their convoy. The troop became even larger. Each person’s face was filled with excitement and exhilaration. They looked with awe at the figure standing on the deck of the lead slave transport ship.</p><br/><p>There was no light coming from the ling armor, the not-so-broad figure did not have a grand presence, this normal looking youth that was outrageously young gave them hope and led them to escape this cage.</p><br/><p>Not far from their troop, a troop of yao soldiers watched as they left.</p><br/><p>“Daren, are we not pursuing them?”</p><br/><p>“No, we are too exhausted.”</p><br/><p>“But … …”</p><br/><p>“The order from the Council of Elders is to take Little Mountain Jie at the fastest speed possible, not to do anything else.”</p><br/><p>———</p><br/><p>Rong Wei entered this convoy along the way.</p><br/><p>Personally seeing this scene, she sighed inside. After this hard battle, the master of Golden Crow City had become the true king of Little Mountain Jie. If he sent down an order right now, there definitely would be many people willing to sell their life for him. In the remaining xiuzhe of Little Mountain Jie, there was not another person that could be spoken of in the same terms as him.</p><br/><p>The xiuzhe from Little Mountain Jie had all chosen to leave. Her mission did not have much meaning then.</p><br/><p>She didn’t think that she could investigate and find something in Little Mountain Jie with just the handful of compound guards she had come with. The best choice right now was to leave with the master of Golden Crow City.</p><br/><p>She held a high opinion of the master of Golden Crow City. With the group of people under his command, the master of Golden Crow City would be invincible wherever he went. From the battle, she had seen how powerful the master of Golden Crow City was.</p><br/><p>It was a profitable matter to give someone friendship when they were in their most difficult straits.</p><br/><p>“Good day, City Master!” Rong Wei went over and bowed. With a smile, she said, “We will be travelling with you!”</p><br/><p>Zuo Mo smiled. “Miss Rong is too courteous.” As he finished, he had his people make room.</p><br/><p>Rong Wei was not courteous and stepped onto the slave transporting boat. The compound guards all held their head and chests high, and shared in the glory.</p><br/><p>“What does City Master plan to do for the future?”</p><br/><p>Rong Wei tilted her head and asked.</p><br/><p>“We’ll plan each step when we get there.” Zuo Mo was very wary of this female xiu that was investigating Stars in Daytime.</p><br/><p>“Sky Water Jie isn’t a bad place. City Master could consider it,” Rong Wei said.</p><br/><p>Zuo Mo shook his head. “Too dangerous, The yao army can enter Little Mountain Jie at any time. Sky Water Jie is this close to Little Mountain Jie, it is slightly dangerous.”</p><br/><p>Rong Wei stilled. Upon further thought, she instantly stopped speaking. The other’s words were very reasonable. She considered whether or not she should urge the Marquis to move the House of the Crow Marquis to a place further way when she returned.</p><br/><p>Pu Yao suddenly spoke up inside Zuo Mo’s mind, “Ask her if she has a jie map?”</p><br/><p>Hearing this, Zuo Mo’s mind moved. He asked Rong Wei, “Speaking of that, this one has something to request.”</p><br/><p>“Oh, please speak,” Rong Wei said cautiously.</p><br/><p>“This one’s jie map was lost, and wants to borrow and copy Miss Rong’s jie map,” Zuo Mo said without blushing or an increase in his heartbeat.</p><br/><p>Hearing this, Rong Wei’s heart settled. She said, “No problem, but the markings on this one’s jie river are limited, and hope that City Master will not be too disappointed.”</p><br/><p>Zuo Mo hurriedly gave his thanks, took out a blank jade scroll and copied.</p><br/><p>After he finished, he gave the jie map jade scroll back to the other and went back to his cabin after bidding farewell.</p><br/><p>Once he entered the boat cabin, he couldn’t wait and took out the jie map to examine.</p><br/><p>The jie map was filled with the names of all the jie and the jie rivers connecting them. Zuo Mo instantly felt his vision broaden. Only today did he discover the general location of Sky Moon Jie, and Little Mountain Jie.</p><br/><p>Sky Moon Jie and Little Mountain Jie were at the corner of the entire jie map.</p><br/><p>As expected, it was rural area … …</p><br/><p>He smacked his lips and rubbed his chin as he read intensely, unaware that Pu Yao had also crowded next to him and was examining the jie map.</p><br/><p>“Such a small jie map?” Pu Yao said with slightly disdain.</p><br/><p>“It’s already a lot. There’s more than three hundred jie labeled on here!”</p><br/><p>“Three hundred jie is a lot?” Pu Yao seemed to have heard a great joke. “Country bumpkin!”</p><br/><p>Zuo Mo ignored him. It was the first time he saw a jie map and he was very curious. The labels on the jie map were very detailed. It even included the specialty products of each jie. He read on with interest. Around the jie map were large areas of blank space. Those were probably areas that had never been mapped before.</p><br/><p>He quickly discovered that there was no information on Water Cloud Embryos on the jie map.</p><br/><p>“Pu, which jie produces Water Cloud Embryos?”</p><br/><p>“I don’t know,” Pu Yao said irritably, “I’m not familiar with your xiuzhe territories.”</p><br/><p>“Aren’t you a Sky yao? You don’t even know this.” Zuo Mo egged him on.</p><br/><p>Pu Yao tilted his head and smirked coldly. “I know of a place, but it is in a yao jie, you dare to go?”</p><br/><p>Zuo Mo instantly was speechless. It seemed he had to do a search when he got to Sky Water Jie.</p><br/><p>When the vast troop reached Clear Sky Sect’s base, they found it was completely empty. Zuo Mo, who had been expecting another hard battle, was very surprised.</p><br/><p>When they found out the Clear Sky Sect disciples had all run away, cheers rang out from the troop. Zuo Mo did not doubt that if any Clear Sky Sect disciple’s identity was revealed, and they encountered any xiuzhe that escaped from Little Mountain JIe, they would die a terrible death.</p><br/><p>Every single one of the surviving xiuzhe from Little Mountain Jie hated Clear Sky Sect to the bone.</p><br/><p>What Zuo Mo felt was a pity was everything good in Clear Sky Sect had been cleaned out. He didn’t stop there, followed the jie river, and flew towards Sky Water Jie.</p><br/><p>When they arrived at the airspace above the jie river, many of the xiuzhe’s tears uncontrollably flowed.</p><br/><p>They finally believed that they were going to leave this hell-like cage!</p><br/><p>They could finally return to the life they had been familiar with before. This made everyone excited.</p><br/><p>Cheers, sobs, venting roars … …</p><br/><p>The sky above the jie river was very busy.</p><br/><p>Zuo Mo wasn’t very excited. He looked at A Gui sitting silently beside him, his gaze determined.</p><br/><p>The other end of the jie river was just a new beginning.</p><br/><p>Translator Ramblings: Don’t worry, Pu Yao hasn’t forgotten the golden core yet. It will come up. Zuo Mo getting the jie map is like those players who just left behind the beginner level. Sky Moon Jie was the tutorial, Little Mountain Jie the beginner village, and now we are off to the real world.</p><br/><p>The yao army juuuuuuuuuuust allows Zuo Mo to slip through, again. It’s a string of coincidences. They are too tired after traveling at full speed and Zuo Mo’s convoy is too numerous. Last time, it was that they adhered to the mission and were merciful so they did not to go after “innocents.” I’m not sure what is plot armor if this isn’t.</p><br/><p>As for A Gui’s name, the guywhoshere had a good answer: Ah () is a prefix for endearment, like you would use Xiao () to say little *name*. Gui () is ghost, hence why he previously called her ghost.</p><br/>\n</div>"}