{"title": "Chapter Three Hundred and Eleven – At The Door", "id": 261, "volume": 3, "url": "http://boxnovel.org/world-of-cultivation-chapter-three-hundred-and-eleven-%E2%80%93-at-the-door", "volume_title": "Volume 3", "body": "<h1>Chapter Three Hundred and Eleven – At The Door</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Three Hundred and Eleven – At The Door</p><br/><p>Elders Wang, Mei, and Xiao quickly hurried over.</p><br/><p>“What matter has Sect Leader in such a fuss? This old woman is slightly curious!” Elder Mei’s voice was piercing. Before she arrived, her voice could first be heard. Elder Mei’s face was hideous and her temper was the most explosive. Of the three people, she had been the oldest person when she reached jindan, and her composure was the worst among them.</p><br/><p>Elder Wang was wearing a blue robe, her face friendly and had a cheerful smile. She looked very friendly and approachable. Elder Xiao’s eyes rippled with a seductive look. She was actually even younger than Su Yue, and she was a peerless beauty.</p><br/><p>“Yes. It’s rare that Sect Leader will call all three of us together. Has something major happened?” Elder Xiao’s voice was sweet, endearing and alluring.</p><br/><p>Elder Wang said warmly, “If Sect Leader has a problem, please tell us. We receive benefits from the sect daily, and won’t refuse if it is time for us to help.”</p><br/><p>“This disciple thanks the three elders!” Su Yue bowed gracefully to the three elders, her attitude respectful. The biggest reason that she was in charge of Hundred Flower Alliance was that she had the support of the three elders. The three elders calmly received the bow and did not refuse.</p><br/><p>After standing up, Su Yue narrated what had happened today.</p><br/><p>“Sky Number One. Based on our sect’s tradition, he shouldn’t be lower than sixth-grade.” Elder Xiao was slightly surprised.</p><br/><p>“Seventh-grade,” Su Yue said and then continued, “This xiu slave called A Wen is exceptional and of rare innate talent. He first caught our attention, when he showed himself in a group of fourth-grade xiu slaves. This disciple then put him among a group of fifth-grade xiu slaves. In an extremely short amount of time, he outcompeted them. Just a while ago, he won out of a group of sixth-grade xiu slaves. This disciple had been preparing to send him to Elders after some more time. No matter if it is as a slave soldier, or as a living cauldron, it would be very beneficial.”</p><br/><p>Elder Xiao’s eyes lit up as she laughed lightly. “Jiejie cannot steal from me. This meimei just needs a good cauldron, and I can break through the stage of first stratum.”</p><br/><p>“Hmph, this old one has no interest in xiu slaves,” Elder Mei said coldly.</p><br/><p>Elder Wang smiled and said, “Then I will wish for Meimei to break through first stratum soon. Maybe Meimei will be the first one among us to first break through to the level of first stratum.”</p><br/><p>“Meimei thanks Jiejie!” Elder Xiao’s expression was blissful.</p><br/><p>“But this Master of Golden Crow City could grasp Old man Xue, he is not to be dismissed,” Elder Wang said gravely.</p><br/><p>“What are you afraid of? Hmph! They really don’t want to live!” Elder Mei sneered coldly. “He should be a body cultivator, the probability of him being a dhyana xiu is the highest. At that time, get Xiao Xiao to go. Her [Sky Flower Fall] is perfect for dealing with those people.”</p><br/><p>“Good, good!” Elder Xiao laughed prettily as she clapped her hands with a light smile. She was receiving the most benefits this time, and naturally was willing to put in more effort.</p><br/><p>“Do they have any other jindan?” Elder Wang asked.</p><br/><p>“No. This disciples personally saw them, and did not find any other jindan,” Su Yue said confidently.</p><br/><p>“Don’t even have a jindan and they dare to be so arrogant, they are looking for death!” Elder Mei said hatefully.</p><br/><p>A disciple suddenly stumbled in. “Sect Leader! Someone … … someone has attacked us … …”</p><br/><p>Su Yu was suspicious that she had heard it wrong. Someone had attacked them?</p><br/><p>“They dare!” Elder Mei was infuriated. “This old one will use them to make dan!” As her words landed, she stomped her feet and disappeared. The other two elders had unfriendly expressions as they disappeared at the same time.</p><br/><p>———</p><br/><p>Zuo Mo looked at the mountain valley below. Hundreds of flowers were blooming, red and purple, to form a beautiful sea of flowers. Even in the air, it was possible to smell the fragrance. This place was the base of Hundred Flower Alliance, Hundred Flower Valley. Hundred Flower Valley produced all kinds of valuable ling flowers. The flower type talismans and lingdan that they forged were were deeply liked by female xiu and easy to sell in the market.</p><br/><p>Zuo Mo was just going to give the order to attack when three female xiu suddenly appeared in the air.</p><br/><p>Jindan!</p><br/><p>Three jindan!</p><br/><p>Zuo Mo was not surprised by the appearance of jindan. If an enormous sect did not have several jindan, that would be a joke. Compared to Little Mountain Jie when he had felt hopeless at the mention of a jindan, the halo around jindan had disappeared. Jindan were just xiuzhe that were slightly more powerful than ningmai. There was nothing major. After meeting more of them, he could even give a general judgment on how powerful a jindan was.</p><br/><p>Unfamiliar the first time, familiar the second. Fighting against jindan wasn’t an exception.</p><br/><p>Zuo Mo compared the three jindan in front of him with Clear Sky Old Forefather and felt they were very lacking. He couldn’t help but sigh inside at the power of Clear Sky Old Forefather. The jindan that he had successively met were all a far cry from Clear Sky Old Forefather. It seemed that while they were all jindan, the skill level difference was large.</p><br/><p>Thinking back to it, the strength of Wu Kong Sword Sect wasn’t just strong. Xin Yan Shishu wasn’t lacking in power compared to Clear Sky Old Forefather.</p><br/><p>———</p><br/><p>Su Yue quickly appeared behind the three elders. When she saw Zuo Mo, she instantly became furious. She shouted harshly, “Golden Crow City Master! You have gone too far! To say nothing of stealing this sect’s xiu slave, you actually attack our sect? You really think that my Hundred Flower Alliance has no one?”</p><br/><p>The three elders didn’t know who had come but when they heard the person in front of them was the Master of Golden Crow City, they were all angry.</p><br/><p>Elder Mei’s temper was the most explosive as she shouted, “You are seeking death! The Heaven has a road that you don’t walk, Hell has no door but you come! Little bastard, if I don’t destroy your soul today, this old one isn’t called Mei!”</p><br/><p>Zuo Mo rolled his eyes. The other was not polite so he naturally wouldn’t be polite. He spat and said scornfully, “Old Fart, your mommy is calling you to brush your teeth!”</p><br/><p>Elder Mei exploded and disappeared in the sky. “This old one will tear your mouth!”</p><br/><p>Woooooooooooooooooooosh!</p><br/><p>More than ten figures charged towards the empty space in front of Zuo Mo like sharp arrows!</p><br/><p>The fifteen members of Sky Peak Platoon drew out fifteen crisscrossing straight lines like an enormous net which covered the area thirty zhang in front of Zuo Mo! This enormous net seemed to suddenly explode. Countless sword essences were like multi-colored lines that howled with a soul-shaking sound as they filled the holes in the net.</p><br/><p>Fifteen different kinds of sword essence filled the multi-colored net with a dangerous presence.</p><br/><p>Elder Wang and Elder Xiao’s faces were heavy, and Su Yue’s expression changed slightly. Sword essence! Fifteen xiuzhe who had comprehended sword essence! In the entire Hundred Flower Alliance, other than the elders, there were just eight people among the disciples that had comprehended sword essence.</p><br/><p>The other side just sent out fifteen people that were all xiuzhe who comprehended sword essence.</p><br/><p>———</p><br/><p>Gongsun Cha’s expression was shy, and ignorant of the fact his eyes had turned bright red. He was very excited!</p><br/><p>Jindan!</p><br/><p>In the battle at Golden Crow City against Clear Sky Old Forefather, the Vermillion Bird Camp that he was in command off didn’t have any use at all. To Gongsun Cha who looked shy on the surface, but was proud inside, it was a great humiliation!</p><br/><p>Facing a jindan straight on this time, how could he not be excited?</p><br/><p>The moment the large net took form, his eyes suddenly narrowed and flashed with the light of the hunter closing the next. He quickly spat out two words.”</p><br/><p>“Second Division!”</p><br/><p>———</p><br/><p>Elder Mei charged headfirst into this enormous net. While these sword essence could not form tangible danger to her, they still put her in her a sorry state. She had been somewhat careless and did not activate her ling armor. When she found where she stood was filled with sword energies, she finally activated the ling shield.</p><br/><p>Pia pia pia!</p><br/><p>Three sword energies struck her ling shield. The shield only shook slightly, but her expression was very terrible. She felt she had lost face.</p><br/><p>Anger exploding, she screamed piercingly, and a plum branch appeared in her hand.</p><br/><p>This glistening plum was about three chi in length. It was old and flexible, the flowers on the branches were in full bloom. Elder Mei waved it slightly. The tender pedals left the plum tree and flew with the wind. In a moment, the plum flowers rained down and managed to cover all of Sky Peak Platoon.</p><br/><p>It was a dreamy realm of flowers but a sharp sound howled. Like the tide, the beautiful flower petals became shrap. Every petal contained sharp sword essence.</p><br/><p>The dream realm instantly became hell.</p><br/><p>It was Elder Mei’s killing move, [Plum Sacrifice]!</p><br/><p>Elder Xiao’s eyes flashed as she laughed prettily. “Mei Jiejie really is going overboard. What reason is there to use a killing move just as the fight is starting? We can’t even get a drink of soup.”</p><br/><p>Elder Wang praised, “Elder Mai’s sword essence has become purer. This [Plum Sacrifice] is multiple times stronger than last time.”</p><br/><p>Su Yue was entranced. As Elder Mei attacked, the other side instantly disappeared in this beautiful yet treacherous flower sea.</p><br/><p>The people of Sky Peak Platoon knew the danger. Their expressions changing, everyone retreated.</p><br/><p>“Flee? Not so simple!” Elder Mei felt unspeakably good as she said hatefully. The spell on her hands changed again.</p><br/><p>Her mind suddenly stuttered, a feeling of danger rising. She instantly was shocked. At this time, the air around her suddenly shook lightly, the sky full of flowers imperceptibly paused.</p><br/><p>At some unknown time, a troop had charged to within thirty zhang of her.</p><br/><p>Such fast speed!</p><br/><p>Her eyes shrank. The other came quickly like a shining blade that made her feel that she could not stand under its sharpness!</p><br/><p>Elder Mei was suddenly enraged .The other side was just a charge of more than one hundred people yet she actually had felt fear. It was too embarrassing! As she turned the plum tree in her palm, the sky full of falling flowers seemed to be carried by the wind to move towards the troop coming towards her.</p><br/><p>The sharp flower petals were like soul-snatchers, and the wind pillar that carried them was undoubtedly a meat grinder!</p><br/><p>“This fight is over!” Elder Wang said lightly. Even if she was the one facing Elder Mei’s move, she would not be able to escape without injury. Both Su Yue and Elder Xiao did not doubt her words.</p><br/><p>Yet what they never had thought was the other side did not retreat but charged straight at Elder Mei!</p><br/><p>———</p><br/><p>Wei Ran felt the battle intent in his body had reached a peak, and his speed had risen to a peak! In order to increase their speed to the maximum, Lil’ Miss had arranged a position near the back for them.</p><br/><p>Facing the meat-grinding pillar of wind, Wei Ran showed no fear.</p><br/><p>Every xiuzhe of Vermillion Bird Camp believed that when their speed was at maximum, when they completed their charge, no enemy could stop them!</p><br/><p>This wasn’t something that Lil’ Miss forced onto them, but a belief born from multiple battles!</p><br/><p>Wei Ran raised the flying sword in his hand. His fellows raised the flying sword in their hands at the same time!</p><br/><p>He suddenly glared angrily, and shouted, “Hundred Kill!”</p><br/><p>The flying sword in his hand sliced forward with all his power.</p><br/><p>Everyone in Second Division shouted at the same time, “Hundred Kill!”</p><br/><p>The flying sword in their hands sliced forward with all their power!</p><br/><p>The sword energies were like streams meeting at the sea, one hundred swords becoming one. A gigantic sword energy three zhang wide rang deeply as it flashed blindingly and collided with the pillar of wind!</p><br/><p>Translator Ramblings: I like how Zuo Mo feels confident in taking on three jindan and a whole sect at once just after killing one jindan after a long period of planning, and then capturing and subduing another jindan. I like how both Zuo Mo and Gongsun Cha reflected on and changed their tactics after learning how jindan work.</p><br/><p>The subject of slaves was first mentioned way back when Zuo Mo was listening to the sound tablet. Jingshi mines are obviously important and so in this world where the strongest devours the weak, Luo Li’s actions are sanctioned by the sect. Remember how callous the paper crane girl was with Zuo Mo’s life? Powerful people do not care about slaves, which are the lowest level of society. Zuo Mo was lucky to have been picked up by the sect leader and remained free.</p><br/><p>Zuo Mo is very pragmatic. He was scared by the bloodshed done by Luo Li but his opinion was that he could not do anything as he was such an insignificant person and he was already dealing with his own troubles.You may have to say that both of them fall on the selfish side as Luo Li acted to put down a rebellion that affected his responsibilities while Zuo Mo is trying to maximize the use of xiu slaves. He enslaved people in Little Mountain Jie in order to survive, and he only gave them freedom because he could not afford to feed them all. He’s heading towards Hundred Flower Alliance because this affects his own interests and he understands what Shu Long and the others are feeling.</p><br/><p>On the other hand, he doesn’t exactly fall in line with the other people. If you look at these jindan elders, they treat slaves like merchandise or objects. Zuo Mo doesn’t do that, and his kindness, in direct contrast to how people treat those below them like Luo Li once did to Wei Sheng and Hao Min to Zuo Mo, is enough for Shu Long and the others to feel grateful and swear loyalty.</p><br/>\n</div>"}