{"title": "Chapter Three Hundred and Twelve – Zuo Mo’s Fury", "id": 262, "volume": 3, "url": "http://boxnovel.org/world-of-cultivation-chapter-three-hundred-and-twelve-%E2%80%93-zuo-mo%E2%80%99s-fury", "volume_title": "Volume 3", "body": "<h1>Chapter Three Hundred and Twelve – Zuo Mo’s Fury</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Three Hundred and Twelve – Zuo Mo’s Fury</p><br/><p>Boom!</p><br/><p>Everyone’s vision flashed, the burning light stabbing people’s eyes to the point they couldn’t remain open.</p><br/><p>Elder Mei’s sleeves were torn, her hair loose, and a thin stream of blood was coming out the corner of her mouth. She looked in terror at the group of more than one hundred people in front of her. What … … what sword scripture was this … …</p><br/><p>She had seen sword scriptures that were combined in an attack together before, but she had never heard of sword scripture that combined attacks of more than one hundred people much less seen it with her eyes. Combined sword scripture attacks demanded high cooperation between the xiuzhe. The more people there were, the less likely it was that it would succeed. A combined sword scripture attack of more than one hundred people was something that could not be imagined.</p><br/><p>As a jindan, she could only retreat when facing such a terrifying blow.</p><br/><p>Looking at the troop that was slightly disorganized in front of her, it was like she had seen a ghost.</p><br/><p>———</p><br/><p>Wei Ran’s body was empty of power. Not just him, but every one of his fellows were panting heavily. But every person’s face was filled with battle intent and pride! Jindan, jindan, so what!</p><br/><p>Wei Ran was so excited he wanted to howl. To wound a jindan with one blow. This was something they would never even dare to think about in the past, but it happened right in front of their eyes now! But he forcibly suppressed the excitement and battle tremors inside. He had not forgotten his duty.</p><br/><p>“Scatter!”</p><br/><p>Like a tide, the xiuzhe of Second Division suddenly divided down the middle.</p><br/><p>———</p><br/><p>Elder Mei was shocked and uncertain, but when her gaze landed on the passageway made by the opening, her expression changed dramatically!</p><br/><p>A light and deep vibrating sound was like the deep bark of an ancient beast.</p><br/><p>Another hundred people!</p><br/><p>A charge just like the previous one!</p><br/><p>Elder Wang and Elder Xiao’s complexions changed. Elder Mei was in danger! The two did not dare to be careless. The mysterious Master of Golden Crow City had subordinates of such power! Just a short exchange but it was coordinated and flawless. From the beginning, Elder Mei had landed in the other’s formation.</p><br/><p>The enormous sword energy net made by the fifteen xiuzhe that comprehended sword essence had only one goal – slow down Elder Mei!</p><br/><p>A jindan that lost their speed instantly became fragile when facing a strong troop that could complete a combined sword scripture attack of over one hundred people. The two also found to their shock that the Master of Golden Crow City didn’t just have this one troop under his command. Also, the other didn’t give Elder Mei any chance to breath. Their attacks were like waves, one wave after another.</p><br/><p>If this continued, Elder Mei would become a fish on the other’s chopping block.</p><br/><p>The two understood the dangers of the situation. At this time, they couldn’t attend to anything else, but leapt over. They only needed to create a chance for Elder Mei to breath, and the scales of battle would become balanced again.</p><br/><p>“Kill!”</p><br/><p>A cold and slightly old voice suddenly rang beside Elder Wang’s ears.</p><br/><p>A feeling of danger floated onto her mind. She was very shocked, her figure disappearing from her spot.</p><br/><p>A black snake the thickness of a water barrel viciously swept across the position she had just been at.</p><br/><p>Elder Wang looked gravely at the troop that had ambushed her. A slave transporting boat’s deck was filled with standing black-armored xiuzhe! Heavy armor xiuzhe? Puzzlement floated into her mind. The clumsy heavy armor had long been eliminated by history. She felt it was incomprehensible that a heavy-armor troop had appeared in front of her.</p><br/><p>However, she was not careless. The thick black snakes coiling above their heads made her sense danger.</p><br/><p>Darkness, killing, sharpness … …</p><br/><p>Her gaze landed on the young black-armored xiuzhe at the very front. She could feel the battle intent in the other’s eyes, and killing intent that was so thick it could not be resolved!</p><br/><p>———</p><br/><p>Zuo Mo stopped Elder Xiao.</p><br/><p>“Hee hee, handsome guy, why have you stopped me?” Elder Xiao laughed prettily. The snowy and fine hand lightly covered the warm and red lips, and was unspeakably seductive.</p><br/><p>Zuo Mo became super alert. His attitude might have been relaxed when he had been swearing back at Elder Mei, but when he truly faced a jindan, he still felt slightly nervous. He didn’t say anything, but stared tightly at the other. Different to earlier, any speech was useless.</p><br/><p>“If you keep looking me, I will be embarrassed!” Elder Xiao’s eyes moved with allure.</p><br/><p>Zuo Mo did not react, but he didn’t understand. If it was something like swearing at each other, he could understand. But did the woman have some scheme to be talking like this? He became increasingly wary. He didn’t waste words, one hand pulling and the other drawing.</p><br/><p>Two yang fiendish hard lightning bolts left his hands.</p><br/><p>“You are so harsh to attack me. If I get wounded, could you bear it?”</p><br/><p>The sweet and seductive voice floated in the air. Elder Xiao’s exceptional body flickered in and out of view in the air. The snowy and smooth skin, the high twin peaks, the eyes, they all unconsciously attracted all attention.</p><br/><p>Zuo Mo was puzzled. Could bear it? Why couldn’t he bear it?</p><br/><p>The hard lightning on his hands continued to bomb towards the other like rain.</p><br/><p>With a pretty bell-like laugh left behind in the air, Elder Xiao’s figure was flickering in the air. The air seemed to have a new addition of a sweetly fragrant and tempting smell.</p><br/><p>Zuo Mo had a headache. The other’s movement method was very powerful. He couldn’t even touch the other’s clothing.</p><br/><p>The sweetness in the air entered Zuo Mo’s nose. He suddenly felt strangely heated and frantic. The speed of the hard lightning increased, but no matter how fast they were, no hard lightning could even brush the other.</p><br/><p>He did not notice that a blush had unknowingly came onto his cheeks.</p><br/><p>But Elder Xiao noticed it, and she rejoiced inside. Her expression became even more seductive, and her movements even more tempting. The air became even more heated. But at this time, she heard a second grunt from Elder Mei. Her heart shook. She knew if she could not finish the battle quickly, Elder Mei would die today.</p><br/><p>Also, to capture the bandits, first capture the leader. If she could capture the Master of Golden Crow City, this fight would be finished, and no one could fight against them for Sky Number One.</p><br/><p>Thinking about this, she could not stop herself. She giggled, “Little villain, come get close to Jiejie!” The snake-like waist lightly twisted, the clothing on her body flew like flower petals.</p><br/><p>But her expression held an unusual sincerity.</p><br/><p>[Sky Flower Fall]!</p><br/><p>———</p><br/><p>An unknown length of time later.</p><br/><p>It was like waking up from a long dream.</p><br/><p>Where was this? Zuo Mo opened his eyes and examined the surroundings</p><br/><p>Countless flower petals were falling down. Among the rain of flowers, beautiful bodies flickered out of view. Some were lazy, others innocent. They were all beautiful. Every moment and every look could stir the most basic desire of a person.</p><br/><p>The scene in front of him was so real that one could not take themselves away.</p><br/><p>“Boss!”</p><br/><p>They walked in front of Zuo Mo, and bowed to Zuo Mo. The curvaceous bodies revealed large patches of snowy white of the front chest, and made one have the impulse to reach into it.</p><br/><p>“Where is this?” Zuo Mo instinctively asked.</p><br/><p>The females all had puzzled expressions. One of the female stood out. “Boss, this is your home!”</p><br/><p>At this time, Zuo Mo finally noticed the flower under his feet was completed tiled in jingshi. Not just so, the yard, the benches, and the pond were all made from jingshi. Clitter-clatter ran from the pond, it was all jingshi inside.</p><br/><p>The entire yard was made from jingshi!</p><br/><p>So much jingshi!</p><br/><p>Zuo Mo’s heart had never been so satisfied. Was this really his home?</p><br/><p>“Boss, let this servant serve you!” A servant said with embarrassment. The tight long dress revealed all of her body. What made Zuo Mo want to spit blood was that the dress had a slit up to her waist and the inside was tantalizing.</p><br/><p>“Hee hee, let us serve you!”</p><br/><p>The females in the surroundings giggled and came up to help Zuo Mo change clothes.</p><br/><p>Zuo Mo jumped in fright. What were they doing? Why did they have to take off his clothes?</p><br/><p>Seeing the situation, the females giggled even more.</p><br/><p>“Boss is embarrassed!”</p><br/><p>“Yes! It’s so cute!”</p><br/><p>“Then we can undress first!”</p><br/><p>“En, en!”</p><br/><p>As Zuo Mo gaped, the females untied their dresses and revealed their perfect bodies, and looked with embarrassment or seductiveness at Zuo Mo.</p><br/><p>It was enough for one to spit blood!</p><br/><p>Zuo Mo felt his nose heat up, but he suddenly seemed to feel the scene in front of him was slightly familiar.</p><br/><p>He seemed to have seen it before … …</p><br/><p>Oh, where had he seen it before?</p><br/><p>As he thought, Zuo Mo’s body suddenly froze as though he was hit with a bolt of lightning. In an instant, his face was a mix of green and red. He was furious, swearing as he pointed at the females “Illusory formations! You group of illusory formations!”</p><br/><p>He finally remembered where he had seen this before!</p><br/><p>Wu Kong Mountain, the pink paper crane!</p><br/><p>That damned pink paper crane had once used a similar move against him, but he had seen through it then!</p><br/><p>An illusory formation that was almost the exact same!</p><br/><p>The anger inside erupted.</p><br/><p>In the past, the paper crane female had did that to ge, ge couldn’t defeat her, ge endured it! You dare to use this move to trick ge? Ge won’t tolerate it! The new grievance and the old hate mixed together, especially when Zuo Mo recalled his sorry state in the past, the anger in his heart burned even brighter.</p><br/><p>“Ge hates illusory formations the most!”</p><br/><p>Zuo Mo gritted his teeth and brimmed with killing intent.</p><br/><p>Pia pia pia!</p><br/><p>The naked beauties in front of him suddenly turned into balls of smoke. Before he could react, everything around him exploded into smoke.</p><br/><p>Inside the thick smoke was Zuo Mo’s tragic wail, “Jingshi! My jingshi!”</p><br/><p>The scenery around him changed and Zuo Mo seemed to wake from a dream. Air, he was still in the air, empty air!</p><br/><p>Zuo Mo’s eyes instantly turned red. He felt his heart was dripping blood. Jingshi, so much jingshi, all gone! He, who had felt so rich just, now felt great sorrow rise in his heart and stimulate him.</p><br/><p>If it was said that illusory formations made him remember his tragic previous days, and made him feel fury, then losing so much jingshi suddenly could not simply be described by fury.</p><br/><p>Grievance! Deep hatred! Hatred that one side could not survive!</p><br/><p>Blood seeped out of Elder Xiao’s mouth. [Sky Flower Fall] was invisible as it corroded the mind and was wondrous in its powerful, but if it was broken, her mind would be heavily wounded.</p><br/><p>Even more importantly, she still did not understand how the Master of Golden Crow City had recognized and broken [Sky Flower Fall].</p><br/><p>The [Sky Flower Fall] that had never failed before was defeated at the hands of a ningmai youth. She still could not believe it now.</p><br/><p>This wasn’t possible!</p><br/><p>Zuo Mo did not care for the shock and puzzlement the other felt. His eyes were filled with blood and his shout like thunder!</p><br/><p>“Give all the jingshi back to me!”</p><br/><p>The first transformation of the Great Day mo physique suddenly materialized!</p><br/><p>Translator Ramblings: Poor Zuo Mo, his education was skewed by a powerful female xiuzhe, one pervrse renyao and one shy Lil’ Miss. So all beautiful and naked women are illusory formations. The paper crane girl really gave Zuo Mo a lesson he will always remember.</p><br/><p>Elder Mei’s surname is literally plum so she is Plum and wields a plum tree.</p><br/>\n</div>"}