{"title": "Chapter Three Hundred and Twenty One – Ambush", "id": 271, "volume": 3, "url": "http://boxnovel.org/world-of-cultivation-chapter-three-hundred-and-twenty-one-%E2%80%93-ambush", "volume_title": "Volume 3", "body": "<h1>Chapter Three Hundred and Twenty One – Ambush</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Three Hundred and Twenty One – Ambush</p><br/><p>Silly Bird suddenly turned her head around, and her bird eyes stared at the thick cloud cover far in the sky.</p><br/><p>It was the first time Zuo Mo had seen Silly Bird have such a vicious gaze as though she had seen something she extremely disliked.</p><br/><p>Just as Zuo Mo was puzzled, Silly Bird suddenly gave a long call, her wings spreading, and then she disappeared. Zuo Mo only saw a shadow fly by. When he managed to react, he saw a shocking scene.</p><br/><p>Silly Bird was like a bolt of grey lightning that entered the thick black clouds.</p><br/><p>What was this bird … … doing … …</p><br/><p>Zuo Mo dazedly looked at the clouds, his mind unable to react. Just as he prepared to go and take a look, a shadow flew close and appeared in front of him. It was Silly Bird!</p><br/><p>There were traces of blood on Silly Bird’s long beak. Her gaze was vicious as she puffed her head and chest high, her body wrapped in killing intent. She called out a clear long note that rang into the distance.</p><br/><p>A shadow suddenly dropped out of the clouds. Zuo Mo saw it clearly. It was a Black Bat. The stomach of this Black Bat had been eviscerated, exposing the innards, and it clearly wouldn’t live. Black Bats were third-grade ling beasts. Their ears were extremely keen and they were mostly used for information gathering.</p><br/><p>However, it was not easy to raise a Black Bat. They were very expensive. Normal scouts couldn’t afford them.</p><br/><p>“Master of Golden Crow City! You dare to kill my Black Bat, tomorrow, I will make you die!”</p><br/><p>A male’s shout came far out in the distance inside the clouds.</p><br/><p>Zuo Mo ignored it. His eyes were tightly locked onto Silly Bird. The viciousness in Silly Bird’s eyes quickly retreated, and she quickly became as proud and aloof as she usually was. If it wasn’t for the traces of blood still on Silly Bird’s beak, Zuo Mo definitely would have thought what just happened was his delusion.</p><br/><p>He huddled in front of Silly Bird.</p><br/><p>“Oh, you look very normal.”</p><br/><p>Silly Bird rolled her eyes and ignored him. She raised her bird head up high, strutted her bird walk, and left.</p><br/><p>“When did this bird get so vicious?” Zuo Mo rubbed his chin as he said to himself. He wanted to chase, but when he looked at the surroundings and remembered that he still had the mission of keeping the other side’s spies occupied, he could only stand on the mountain to be blown by the wind.</p><br/><p>He shook his head, and decided to ignore the bird. After she had gone out to show off last time, she hadn’t been very normal.</p><br/><p>“A Gui, do you think we can win?”</p><br/><p>A Gui was sitting woodenly.</p><br/><p>Zuo Mo did not care and sat down next to A Gui. Looking out at the dark black sky, he became unfocused.</p><br/><p>He didn’t notice an extremely faint, almost imperceptible purple light flash suddenly through A Gui’s empty eyes.</p><br/><p>———</p><br/><p>Bright Water City was surrounded by a large river. This large river was Bright Water River, and it was the origin of Bright Water City’s name. In the dark, Bright Water River was so quiet it seemed to be sleeping. There weren’t any waves. Suddenly, the water’s surface started to ripple and a figure slowly rose out of the river water.</p><br/><p>This person looked around for a while, saw no one was around, and took out a little black umbrella.</p><br/><p>The little umbrella flew out of his hand and turned to an intangible black silk that floated onto the sky above the river.</p><br/><p>A moment later, figures rose up from the river water. In the span of a few breaths, the surface of the river was filled with people. These people silently floated into the sky above the river.</p><br/><p>“This Black Ling Hiding Umbrella really lives up to being a fourth-grade talisman.” Wei Ran lifted his head to look at the black silk that was floating in the sky. This ethereal black silk covered all of them. They couldn’t be seen from the outside. This Black Ling Hiding Umbrella was one of the fourth-grade talismans from Boss’ spoils. It could hide people, and more importantly, it could stop ling energy ripples from spreading into the surrounding area.</p><br/><p>Even as he praised, he took out jingshi and started to recover his ling power.</p><br/><p>No one spoke. Everyone silently recovered their ling power.</p><br/><p>Gongsun Cha didn’t need to recover ling power. He examined the nearby Bright Water City, and his lips curved. The powers of Bright Water City clearly didn’t think highly of them. Bright Water City almost had no defenses at all. The Black Ling Hiding Umbrella was a powerful talisman, but there were many formations and talismans that could detect it.</p><br/><p>But they hadn’t encountered even one of them.</p><br/><p>The loose defense was full of holes in Gongsun Cha’s eyes. He thought it was a pity that they were not here to attack the city.</p><br/><p>One hour later, everyone finished their recovery.</p><br/><p>The Black Ling Hiding Umbrella was put away. It could not be moved when it was activated. That was its only flaw.</p><br/><p>Vermillion Bird Camp flew twenty zhang into the sky. Gongsun Cha sat on the broad Green Cloud Sword. Gazing down at Bright Water City, the corners of his mouth moved up. A cold light flashed through his eyes as he said lightly, “Start!”</p><br/><p>Hiss!</p><br/><p>Vermillion Bird Camp suddenly moved.</p><br/><p>———</p><br/><p>The lanterns on the streets gave off a warm yet bright light. Tonight’s Bright Water City was excited yet frantic. Large amounts of xiuzhe had gathered in Bright Water City. They were waiting for dawn. The actions taken this time were the most significant ones in Bright Water City’s recent history. Everyone was full of excitement and anticipation.</p><br/><p>Wood Sword Camp and Flying Cloud Camp had already reached Bright Water City and made camp. The other sects were urgently gathering combat xiuzhe in order to attend this great banquet.</p><br/><p>The tea houses and bars were filled with people. People even filled the streets.</p><br/><p>The passer-by on the streets suddenly heard a strange sound. They stilled, and couldn’t resist raising their heads.</p><br/><p>Large numbers of figures flashed through the sky, and caused endless howls.</p><br/><p>Hiss, everyone without exception inhaled sharply.</p><br/><p>This troop’s presence was shocking and were definitely an elite force. Many people started to speculate which sect’s elite force had arrived. This grand banquet had attracted the gaze of countless sects.</p><br/><p>The xiuzhe flashed rapidly through the sky. Before they could react, the people had disappeared.</p><br/><p>“So strong, I don’t know which sect had sent them. This really is a great force!”</p><br/><p>“Hee hee, tomorrow is going to be a spectacle!”</p><br/><p>Everyone became more excited as they chatted.</p><br/><p>———</p><br/><p>Gao Xiu came from the sect leader’s place and returned to the Vast Sun Hall. The Wood Sword Camp xiuzhe he encountered along the way bowed to him. Everyone could not disguise the excitement on their faces. They had hurried to Bright Water City in the afternoon and camped in Vast Sun Hall.</p><br/><p>Gao Xiu’s vice-commander and a group of xiuzhe came over. “Daren, what did Sect Leader say?”</p><br/><p>“We’re up first tomorrow!” Gao Xiu said with a smile, excitement flashing through his eyes.</p><br/><p>“Great!”</p><br/><p>“Ha ha, we’ll let the people from Flying Cloud Camp to see how strong we are!”</p><br/><p>The xiuzhe of Wood Sword Camp cheered excitedly. They were the best disciples of Wood Sword Sect. Hadn’t they trained for decades just for this day?</p><br/><p>Gao Xiu suddenly furrowed his brows. He could hear trembling vibrations coming close to them.</p><br/><p>He knew what it was. That was the sound produced when a large troop flew by. The other xiuzhe were also alerted to the sound.</p><br/><p>“Which bastard dares to fly above our heads?” someone couldn’t help swearing.</p><br/><p>Camps like Wood Sword Camp were very wary of people flying over their heads, and all the sects would try to avoid flying over other camps. This was an unwritten rule.</p><br/><p>“Has Flying Wind Camp come to Bright Water City?” Gao Xiu suddenly asked.</p><br/><p>“They arrived four hours ago,” his subordinate answered.</p><br/><p>Gao Xiu’s expression suddenly changed as he shouted, “Enemy attack!”</p><br/><p>The black patch of xiuzhe appeared with astonishing speed in everyone’s vision!</p><br/><p>Boom!</p><br/><p>Countless sword energies rained down like a storm.</p><br/><p>The black night was suddenly lit up by countless grand sword energies. The entire Vast Sun Hall was completely covered by the other side’s sword energies.</p><br/><p>The xiuzhe around Gao Xiu all paled but they were well-trained and activated their ling shields to protect Gao Xiu. Some other Wood Sword Camp xiuzhe gritted their teeth and shouted, “Kill!”</p><br/><p>Hundreds of figures flew up against the rain of sword energies.</p><br/><p>Pew pew pew!</p><br/><p>The ling shield of a Wood Sword xiuzhe cracked. He wasn’t able to make any response before dozens of sword energies pierced his body. Dozens of blood blossoms formed. Under the rain of sword energies, the sprays of blood were like explosions on these Wood Sword camp xiuzhe.</p><br/><p>The grand Vast Sun Hall was instantly destroyed by the sword energy rain and was left riddled with holes.</p><br/><p>“You dare!”</p><br/><p>An angry shout suddenly sounded like lightning. Right after, a middle-aged xiuzhe holding an almond-yellow little flag waved out layers of yellow light. When the dense sword energy rain hit these yellow light curtains, they were only able to make ripples.</p><br/><p>The morale of the Wood Sword Camp xiuzhe increased.</p><br/><p>———</p><br/><p>“Ha, jindan,” Lil’ Miss lightly breathed.</p><br/><p>Just as the middle-aged xiuzhe appeared, Wei Ran had locked onto the other. What he hadn’t expected was the other had moved faster than he did. He snorted coldly, and took his division’s xiuzhe to fly out in an arc into the sky. Then then turned and started to dive.</p><br/><p>Their speed suddenly increased, a piercing sound roared in the air.</p><br/><p>Even among the sounds of battle, the howling that caused people’s scalp to prickle, Wei Ran raised the flying sword in his hand. The xiuzhe behind him all raised their flying swords.</p><br/><p>“Hundred Kill!”</p><br/><p>Wei Ran suddenly bellowed, the flying sword in his hand heavily striking down.</p><br/><p>“Hundred Kill!”</p><br/><p>The Second Division behind him all shouted, their flying sword striking down.</p><br/><p>A terrifying sword energy more than twenty zhang long destructively tore through the air as it descended from the sky and landed heavily against the yellow light curtain.</p><br/><p>Ping!</p><br/><p>The yellow light curtain suddenly splintered and only half of the enormous sword energy was left.</p><br/><p>A thread of blood came from the corner of the middle-aged person’s mouth. Viciousness flashed through his eyes. He raised his head and saw the half section of sword energy coming towards him. He said, “Good attack!” He pointed with the almond-yellow flag. A blinding yellow light collided directly with the remaining section of sword energy.</p><br/><p>Boom!</p><br/><p>Wei Ran only saw a patch of whiteness and was not able to see anything. He gritted his teeth, gathered his last bit of ling power, and threw what was in his hand down hard.</p><br/><p>Just as the item in his hand left, a large force passed over him. He couldn’t control his body, and was thrown into the air.</p><br/><p>Up in the sky, almost lacking all energy, he gave a smile, “Idiot!”</p><br/><p>Boom!</p><br/><p>Even more powerful explosions came from below.</p><br/><p>Sonic Lightning Walnuts!</p><br/><p>He had just thrown down a Sonic Lightning Walnut. The twelve division leaders had all been given a Sonic Lightning Walnut by Boss!</p><br/><p>Before the Hundred Kill attack, he had already prepared the Sonic Lightning Walnut.</p><br/><p>Relying on just Hundred Kill wasn’t enough to kill a jindan, but after a Hundred Kill, even a jindan couldn’t escape the Sonic Lightning Walnut.</p><br/><p>Booooooooooooooooom!</p><br/><p>A rapid series of sonic lightning explosions came from below. At this time, all of the division leaders had bombed down the Sonic Lightning Walnuts that they had held.</p><br/><p>Before they could clearly see what the explosions did, a voice came from beside their ear, “Retreat!”</p><br/><p>Translator Ramblings: People in Sky Water Jie are too used to peacetime. If there was no Pu Yao, there would not be Lil’ Miss as he is now, full of cunning and honed in strategies for fighting and for war. Lil’ Miss paid his tuition in pain and defeat so I’m not sure if Zuo Mo or Gongsun Cha got the better deal from Pu Yao.</p><br/>\n</div>"}