{"title": "Chapter Three Hundred and Thirty Three – Fiend Soul Tide", "id": 283, "volume": 3, "url": "http://boxnovel.org/world-of-cultivation-chapter-three-hundred-and-thirty-three-%E2%80%93-fiend-soul-tide", "volume_title": "Volume 3", "body": "<h1>Chapter Three Hundred and Thirty Three – Fiend Soul Tide</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Three Hundred and Thirty Three – Fiend Soul Tide</p><br/><p>With an explosive sound echoing through the air, Silly Bird darted off like a grey bolt of lightning and headed into the fiendish mist.</p><br/><p>A piercing wail came out of the fiendish mist as the red light that Tenth Grade wounded suddenly exploded into dots of red light. Among the red dots, Silly Bird stood with murderous eyes.</p><br/><p>Yet Lil’ Pagoda’s figure had disappeared.</p><br/><p>The killing intent in Silly Bird’s eyes grew. The grey feathers on her forehead stood on end.</p><br/><p>Tenth Grade flew next to Silly Bird, his face heavy. The black crescent blade danced around his body, killing energy spreading outwards in threads. Even if he was at odds with Silly Bird and the others, but they were all Master’s ling beasts. Even more, the change had occurred right in front of his eyes. How could he not be angry?</p><br/><p>Without any hesitation, Silly Bird’s large eyes narrowed, and like an arrow, she charged into the fiendish mist.</p><br/><p>Tenth Grade‘s face froze. He jumped up, turning into a black light, and entered the fiendish mist.</p><br/><p>Everyone else was alerted and prepared to enter the fiendish mist.</p><br/><p>“Do not go in!”</p><br/><p>Zuo Mo’s voice came from behind them. They saw Zuo Mo’s face full of suppressed pain, and he sat down cross-legged immediately after saying this.</p><br/><p>Everyone stared at each other. Many people had panicked expressions.</p><br/><p>Zuo Mo’s present situation was not very good. Lil’ Pagoda was his soul-tethered talisman, and was connected in mind with him. The moment that Lil’ Pagoda was attacked, Zuo Mo felt it. The injuries that Lil’ Pagoda had taken also affected Zuo Mo. Zuo Mo felt his mind was shaken and had almost shattered. Shocked, he instantly sank into his mind.</p><br/><p>A thread of his mind connected him with the distant Lil’ Pagoda.</p><br/><p>Zuo Mo’s consciousness was not weak, and his mind was strong. Even though he shook, he quickly steadied, and the connection with Lil’ Pagoda cleared up.</p><br/><p>But Zuo Mo was not happy at all and felt terrible. His connection to Lil’ Pagoda had not been cut off, but no matter how he called out mentally, Lil’ Pagoda did not respond. Gritting his teeth, Zuo Mo put a thread of his mind, he entered Lil’ Pagoda’s body.</p><br/><p>When his mind entered Lil’ Pagoda’s body, Zuo Mo finally understood how terrible the situation was.</p><br/><p>The balls of pure five element energies inside the pagoda had stopped moving and hung motionless inside the void of the pagoda. Usually, the pure five element energies would be in balance, creating and subduing each other, as they spun endlessly to form a simple yet wondrous little five element world.</p><br/><p>Zuo Mo was clear on the wondrous process of the five element being created and destroyed within the pagoda. How could he not be shocked finding that the pure five element energies inside Lil’ Pagoda’s body had stopped moving?</p><br/><p>The amount of pure five element energies inside Lil’ Pagoda was hundreds of times larger than when Zuo Mo had first bought it. This enormous amount had come from Lil’ Pagoda’s continuous deconstruction of talismans and materials. Zuo Mo could see the five element marrow that was being formed out of the five elemental energies. Eventually these five element marrow would reach a critical mass and it would form small amounts of five element base source.</p><br/><p>Every bit of five element base source was unusually valuable and powerful.</p><br/><p>Lil’ Pagoda’s body was filled with abundant pure five element energies, and even contained a small amount of five element marrow, but it had not created any five element base source yet.</p><br/><p>Zuo Mo took a deep breath. He had no way to push the gigantic balls of pure five element energies floating above his head. He was the owner, but it had always been Lil’ Pagoda itself that had always controlled the circulation of pure five element energies.</p><br/><p>The most effective method was for Lil’ Pagoda itself to recover.</p><br/><p>However, he still did not know what Lil’ Pagoda had been wounded by. He could feel the existence of Lil’ Pagoda, could enter Lil’ Pagoda’s body, but was unable to communicate with Lil’ Pagoda.</p><br/><p>Pu Yao suddenly appeared next to Zuo Mo.</p><br/><p>“It is a fiend soul.” Pu Yao stared at the five balls of five element pure energy in the void, and said faintly, “This five element pagoda is filled with intelligence, and is irresistible to fiend souls.”</p><br/><p>“Fiend souls?’ Zuo Mo didn’t have the time to ask how Pu Yao could come in and hurriedly asked, “What does this have to do with fiend souls?”</p><br/><p>“Fiend souls are born from the fiendish mist, and over time, they will form a slight intelligence. When they become more intelligent, they will start to process fiendish energy and become fiend soul beasts.” Pu Yao looked back and said gravely, “Fiend souls love materials and talismans that have intelligence the most. They can slowly corrupt it and make it their own so they can quickly progress to becoming fiend soul beasts.”</p><br/><p>Zuo Mo’s eyes turned cold.</p><br/><p>“They usually kill each other to capture the intelligence and to continuously become stronger. Not just fiend souls do this, fiend soul beasts also do this.” Pu Yao reminded him, “You have to be careful. I’ve never seen a fiend mist cloud of this size. The number of fiend souls contained in it should be astounding.”</p><br/><p>As Pu Yao’s voice landed, Zuo Mo’s expression suddenly changed.</p><br/><p>Because he saw three red lights.</p><br/><p>It was the first time Zuo Mo had seen a fiend soul. They were like balls of mist covered in a layer of blood red fiend mist. From afar, they looked like curving red worms of various sizes. The longest was one chi, and the smallest was not even half a cun in size.</p><br/><p>The vicious and destructive presence that each one had was like the dark wind from hell that filled every part of the void.</p><br/><p>Zuo Mo could feel the primitive and innate viciousness killing intent in the fiend souls.</p><br/><p>Suddenly, Zuo Mo thought of being at Wu Kong Mountain and using [Art of Aged Gold] to kill worms inside the ling grains. The presence of those pests could not compare to these fiend souls, of course, but he was far more powerful than he was in the past.</p><br/><p>After experiencing so many battles, would Zuo Mo become timid and panicked by such a little scene?</p><br/><p>Zuo Mo was preparing to activate [Light Void Wings] to smash these three fiend souls when he suddenly remembered that he was just a bit of soul at the moment. How could he activate [Light Void Wings]? However, he reacted quickly, and raised his hands for three bolts of Yang Fiendish Hard Lightning.</p><br/><p>Pia pia pia.</p><br/><p>The three bolts of Yang Fiendish Hard Lightning accurately hit the three fiend souls. The three fiend souls didn’t even have the time to wail before they were destroyed.</p><br/><p>Zuo Mo released a breath. So these fiend souls were paper tigers. They made a lot of noise, but there weren’t even worth a single blow.</p><br/><p>So when he saw six fiend souls burrow in, he did not hesitate to continue casting Yang Fiendish Hard Lightning.</p><br/><p>Fiend souls continuously crawled in so Zuo Mo continuously cast Yang Fiendish Hard Lightning. After a few dozen bolts, his expression became ugly.</p><br/><p>The fiend souls did not amount to much individually but their numbers continuously increased as they borrowed in. Zuo Mo was just being supported by a thread of consciousness at the moment. The Yang Fiendish Hard Lightning was strong, but it expended a lot of spiritual power. If it continued like this, he wouldn’t be able to continue for much longer.</p><br/><p>“Use the little yao arts,” Pu Yao reminded idly from the side.</p><br/><p>Zuo Mo’s hand shook, and he was instantly furious. “Pu Yao, what do you mean? Are you just standing aside and watching?”</p><br/><p>Pu Yao spread his hands and shrugged, his face full of helplessness. “It isn’t that I don’t want to help, but I can’t. This is your soul-tethered talisman. You who can use ling power here, but no other person can. It wasn’t easy for me to come in. If I acted, it won’t be the fiend souls, but these five big guys above will instantly attack me.”</p><br/><p>Pia pia pia!</p><br/><p>Large amounts of multi-colored light flew out of the five balls of five element pure energy. These five colored energies were like sword energies and were very sharp. When they hit a fiend soul, the fiend soul would instantly be destroyed. In the blink of an eye, a large patch had been cleared.</p><br/><p>Seeing the situation, Zuo Mo was overjoyed. The pressure on him would lessen if these five balls of five element pure energy could automatically defend themselves.</p><br/><p>Pu Yao naturally understood what Zuo Mo was thinking, and poured cold water. “Don’t be prematurely happy. The number of fiend souls in this fiendish mist is much higher than you can imagine.”</p><br/><p>As he said, the number of fiend souls that crawled in increased dramatically. Zuo Mo’s heart beat wildly. The fiend souls were like an endless tide. The defense of the pure five element energies were still just as sharp, but Zuo Mo could see that the pure five element energies were smaller than before.</p><br/><p>If it continued like this … ..</p><br/><p>Zuo Mo instantly felt panic. The fiend souls that burrowed in covered all the spaces as they furiously leapt at the pure five element energies. Some even leapt at Zuo Mo.</p><br/><p>Damn it!</p><br/><p>Just as Zuo Mo was stuck on what to do, Pu Yao’s reminder sounded at his ears, “Use little yao arts.”</p><br/><p>Pu Yao’s voice was not idle like before and was full of panic.</p><br/><p>———</p><br/><p>Inside the fiendish mist, an enormous blood-colored twister was forming. The fiend mist seemed to suddenly wake up and became restless. Countless fiend souls came from all directions and furiously charged at this twister. At the center of this blood red twister, Lil’ Pagoda rolled among countless fiend souls. This fiend souls furiously tried to burrow into the pagoda, but there were so many fiend souls that no more could enter.</p><br/><p>The countless fiend souls formed a terrifying tide that pulled the flashing Lil’ Pagoda deeper into the fiendish mist.</p><br/><p>Such a large noise disturbed even the stronger fiend soul beasts inside the fiend mist. Countless pairs of eyes opened and flashed viciously.</p><br/><p>Silly Bird charged recklessly in the fiendish mist. For some unknown reason, the fiendish mist that was like poison to others couldn’t come within three chi of Silly Bird. Everywhere she passed, the rolling red fiend souls seemed to have been frightened and rushed to dodge.</p><br/><p>Silly Bird’s vicious eyes showed signs of panic. She charged in all directions and looked around to search for Lil’ Pagoda’s figure.</p><br/><p>Tenth Grade‘s little body was like a fish in the water in the fiend mist. Inside the fiend mist, the black crescent blade that expanded to more than ten zhang large. With a long black energy, it was like a powerful axe. What was most strange was that this enormous black axe seemed to have a powerful magnetism that stopped fiend souls from struggling and sucked them in.</p><br/><p>Tenth Grade ‘s expression was serious. The blood red hair floated up like a ball of flame.</p><br/><p>———</p><br/><p>“Little yao arts? Which type?” Zuo Mo’s hands did not stop moving as he rapidly asked.</p><br/><p>“Number seventy six, and three hundred and thirteen, use Interlocking Gold Form,” Pu Yao hurriedly said.</p><br/><p>The damned Pu Yao!</p><br/><p>Making ge play with high difficulty moves at this time!</p><br/><p>Zuo Mo wanted to spit blood, but he didn’t have the time to swear at Pu Yao now. The situation was becoming more dangerous. Several fiend souls had almost charged into the pure five element energies.</p><br/><p>He gritted his teeth and his hand movements changed.</p><br/><p>Number seventy six … … number three hundred and thirteen … …</p><br/><p>Zuo Mo’s eyes widened greatly. Gritting his teeth, his left hand was like water flowing that created threads of light, his right hand seemed to weigh thirty thousand catties, moving slow and heavy without sound.</p><br/><p>Zuo Mo tried to maintain the yao arts on his two hands. The two little yao arts alone did not pose any difficulty, but he instantly felt burdened when he casted them at the same time.</p><br/><p>The left hand that moved so rapidly it was blurring with light, and the quiet, snail-slow right hand was abnormally fitting, and strangely reached the front of his chest at the same time.</p><br/><p>… … Interlocking Gold Form … …</p><br/><p>Zuo Mo boldened his heart and channelled all his consciousness.</p><br/><p>At the same time, his hands crossed, the left hand covered in thread of light like water flowing into the motionless right hand and tangled together.</p><br/><p>Pu Yao’s bloody pupil suddenly widened!</p><br/><p>Translator Ramblings: We get to witness Lil’ Pagoda’s gluttony … … I wonder how many jingshi is the equivalent of talismans and materials it has consumed.</p><br/>\n</div>"}