{"title": "Chapter Three Hundred and Thirty One – Disseminating", "id": 281, "volume": 3, "url": "http://boxnovel.org/world-of-cultivation-chapter-three-hundred-and-thirty-one-%E2%80%93-disseminating", "volume_title": "Volume 3", "body": "<h1>Chapter Three Hundred and Thirty One – Disseminating</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Three Hundred and Thirty One – Disseminating</p><br/><p>Zuo Mo sat cross-legged as he recalled everything he had learned.</p><br/><p>Formations, forging, fire manipulation, dan-making, he had dabbled in all of them, and formed his own knowledge over time, but he had never systematically examined his knowledge. Having a moment for self-assessment today, he unexpectedly found that what he learned was extremely heterogeneous and the great majority of things were not systematic.</p><br/><p>How could he work with this? He thought with a furrowed brow.</p><br/><p>———</p><br/><p>Wei Cheng Bin concentrated on reading the jade scroll in his hand. After leaving Little Mountain Jie, all of Golden Crow Camp had been very idle. There were no missions and everyone could study topics that they were interested in. Some people were very interested in conversing with others. The present environment of Golden Crow Camp was extremely positive. Everyone had went through hardship together, and had formed deep relationships. They had long thrown the ideals of sect and family away. The two masters, Ji Wei and Sun Bao, would occasionally hold lectures. Wei Cheng Bin would attend each one of them and would learn much.</p><br/><p>It was a pity that they couldn’t cultivate at present. Daren had allowed them to access great numbers of jade scrolls, and there were many fourth-grade core scriptures suitable for production xiuzhe. Everyone had originally been filled with motivation and planned on working hard on their cultivation in the hopes of reaching jindan as early as possible. Who could have thought they would end up in this place where they couldn’t even cultivate. Everyone could only put their attention on the jade scrolls, and content themselves with study.</p><br/><p>“Cheng Bin!” A male popped his head in.</p><br/><p>This male was called Wan Tian. His features were unusually ugly, but his fire manipulation skills were uncanny and ranked first in the entire camp. Even the two masters, Sun Bao, and Ji Wei, praised it endlessly.</p><br/><p>“What terrible idea do you have now?” Wei Cheng Bin helplessly put down the jade scroll in his hands.</p><br/><p>“Hee hee,” Wan Tian snickered, and whispered, “I want to get a bit of black fiendish energy to study.”</p><br/><p>“Black fiendish energy?” Wei Cheng Bin’s heart jumped as he said with a serious expression. “Old Wan, don’t mess around. Black fiendish energy is extremely dangerous. It isn’t anything that people of our cultivation can touch!”</p><br/><p>“I know that.” Wan Tian knew how dangerous it was. “I just want to get a thread, and see the mysteries of this black fiendish energy. This is a rare chance. We probably won’t ever encounter black fiendish energy again in the future.”</p><br/><p>Wei Cheng Bin was persuaded. It would be false to say he was not curious, but his personality was a cautious one. He thought, and then said, “This probably needs the approval of the two masters.”</p><br/><p>“Of course, of course. The masters usually rely on you. If you go to ask for it, there definitely wouldn’t be a problem,” Wan Tian was overjoyed as he hurriedly said.</p><br/><p>Just at this time, Master Sun Bao’s voice suddenly boomed out from from above, “Everyone, come to Golden Crow Hall immediately!”</p><br/><p>Wei Cheng Bin and Wan Tian exchanged a look and were both shocked. There was a hint of excitement in Master Sun Bao’s voice.</p><br/><p>Golden Crow Hall was the largest room in this slave transporting boat, and had been modified by the two masters to be the place they held their lessons. When the two arrived, Golden Crow Hall was filled with people. The two masters sat at the very front with barely disguised excitement.</p><br/><p>After everyone had gathered, Master Sun Bao slowly swept a look across the people and took a deep breath before saying solemnly, “Today, Daren has given us a jade scroll. Recorded within it is Daren’s knowledge and insights, including the Great Golden Crow Formation, how to make yin fire beads, the fire paper method, a chapter on the seal scripts of the formation battle watchtowers, the seal scripts for the body formations, and so on.”</p><br/><p>Boom, it was like an explosion occurred. Some were dumbstruck, some were unable to speak, some were breathing heavily. Every name that came from the mouth of the master was a blow that was like lightning streaking over their bodies.</p><br/><p>Wei Cheng Bin and Wan Tian gaped as they were dumbstruck where they stood.</p><br/><p>Wei Cheng Bin felt his head was ringing. He felt like he was dreaming. Was this real … … was this real … …</p><br/><p>Each name was a kind of lost knowledge, a bit of lost knowledge that should not be easily passed onto others! For example, the Great Golden Crow Formation that could gather sunlight to form Golden Crow Fire. If a sect knew someone had this formation, they would try to obtain it at any cost.</p><br/><p>Each person had uncontrollable joy on their faces, but gradually, the joy on their faces disappeared and became serious.</p><br/><p>The entire Golden Crow Hall was completely silent. The gravity of the situation showed on everyone’s faces because this jade scroll was like mountain that weighed on everyone’s hearts!</p><br/><p>The usually warm Master Ji Wei’s expression was cold and serious. When he spoke, his tone was stern. “Everyone knows the value of this jade scroll, there’s no need for me to say more. Daren led us out of Little Mountain Jie and did not abandon us. Now, he is imparting these rare and lost knowledge to us. Let me ask, which sect can do so?”</p><br/><p>No one said a word. That was right, which sect could do so? No sect would be able to do so. They had all been members of large sects before. Lost knowledge like this was unavailable to anyone except the core disciples, no matter how much an individual contributed.</p><br/><p>In just a few words, Master Ji Wei’s words made everyone’s hearts feel heavy.</p><br/><p>“So,” Master Ji Wei’s heavy tone paused, his eyes lighting up and flashing across the people present, “I and Master Sun Bao have discussed and agreed that anyone who will learn from this jade scroll must first make a killing heart oath. Our Golden Crow Camp will become its own sect loyal to Daren!”</p><br/><p>———</p><br/><p>Zuo Mo did not know what effect his actions created.</p><br/><p>After putting in large amounts of effort, and producing that jade scroll, he sunk into frenzied cultivation. But what made Pu Yao discontent was that Zuo Mo did not just cultivate the little yao arts but practiced them together with the six transformations of the Great Day mo physique.</p><br/><p>Was even this method useless?</p><br/><p>Pu Yao wondered, but then he understood when he changed his way of thinking. Zuo Mo had experienced the power of the Great Day mo physique and thought it was stronger, which was why he was working so hard on it. Pu Yao’s eyes looked towards the sky. Threads of black energy floated in the blood-tinged sky. His eyes lit up. He snickered, and instantly felt unhurried.</p><br/><p>Then his figure disappeared.</p><br/><p>The next moment, he appeared in the Ten Finger Prison. Pu Yao was like a ghost, those yao art jinzhi had no effect on him. His speed was wondrously fast as the scenery flashed by.</p><br/><p>———</p><br/><p>Chi suddenly stopped in his steps, his hair was red and his features were masculine like a lion, and looked with shock towards the sky.</p><br/><p>“Teacher? What is it?” the students beside him hurriedly asked.</p><br/><p>“Oh, nothing.” Chi turned his gaze back, and pretended to be calm. “Everyone, be careful. It is your first trip to Ten Finger Prison. Vast Water Clear Skies should not have any dangers for you, but still be careful, especially of provoking other yao.”</p><br/><p>The students beside him all agreed, their faces full of anticipation. They had all gotten to the soul-planting stage, and were starting to try out real battle.</p><br/><p>Chi did not speak. His gaze uncontrollably went back to the distance. Just now, he had barely detected that a peerlessly powerful yao had passed by. This feeling wasn’t clear, but it made him feel fear.</p><br/><p>Was it a Sky Yao?</p><br/><p>———</p><br/><p>“I can’t find it? That place is a bit strange!” Pu Yao murmured to himself, his brows tightly locked.</p><br/><p>———</p><br/><p>Zuo Mo’s legs were glittering with golden light as though they were made from gold. The pattern of each muscle was clear and distinct. Dong, Zuo Mo was unable to control it well, and like a knife carving into tofu, his right leg was deeply imbedded into the earth up to his hamstrings. At the side, Shu Long and Xie Shan’s jaws gaped. The earth here had been tempered by thousands of years of black fiendish energy, and was as hard as steel. But in front of Zuo Mo’s legs, they seemed to be made of tofu.</p><br/><p>If they were hit with that leg … …</p><br/><p>Shu Long and Xie Shan reflexively turned their eyes away.</p><br/><p>Zuo Mo’s forehead was covered with sweat. He pulled his right leg from the earth, but he lost control of his left leg. Pew, that also sank into the earth. His figure lost balance and fell on the ground. His body wasn’t as strong as his legs, and he bared his teeth in pain.</p><br/><p>The troop maintained a constant speed as it travelled, so Zuo Mo decided to cultivate using this method.</p><br/><p>[Light Void Wings] was meant for speed, and [Golden Crow Feet] was for power. Before this, Zuo Mo found it hard to understand how those mo that focused on strength could rival the xiuzhe that had powerful long-distance attacks. He only started to understand as he started to cultivate [Golden Crow Feet].</p><br/><p>Any kind of power was extremely terrifying when it reached a certain level.</p><br/><p>When pure strength reached a certain level, it would form a boundary in the surroundings to make a force boundary. Any other power that entered this area would be fiercely attacked. It was possible to imagine how a flying sword of a xiuzhe would have to break this force boundary before wounding its target.</p><br/><p>Entering the force boundary, what the flying sword would face was a collision of power without any finesse.</p><br/><p>Zuo Mo was still a long way off from forming a force boundary, but he wasn’t in a hurry. The beautiful feeling of pure power intoxicated him. He used the time on the road every day to practice the six transformations of the Great Day mo physique, and when he was resting, he would cultivate the little yao arts.</p><br/><p>As to the dangers in front, was of little concern to him but his cultivation took up all his time.</p><br/><p>Compared to the difficulty of Zuo Mo’s cultivation, the cultivation speed of Tenth Grade was astoundingly fast. He now had a black crescent flying blade beside him. This black flying knife was like a black butterfly that danced and circled around Tenth Grade without exhaustion.</p><br/><p>Even Shu Long was jealous. He had overcome great hardships to form his weapon, yet Tenth Grade had cultivated his weapon in a month.</p><br/><p>Lil’ Pagoda and Lil’ Fire curiously floated around Tenth Grade. The two little ones clearly were filled with curiosity about this little black person.</p><br/><p>Tenth Grade didn’t even bat an eye. He concentrated on cultivation. Of course, he also knew the connection between Lil’ Pagoda and Lil’ Fire to Master so he did not act.</p><br/><p>But Tenth Grade, his goal was to reach tenth-grade! With such a high and grand goal, how could he live a life of idleness with these people that only knew how to play everyday?</p><br/><p>Tenth Grade raised his eyelid a crack and imperceptibly glanced at the two little ones as he thought proudly.</p><br/><p>Who knew that Lil’ Pagoda and Lil’ Fire found the black crescent blade flying around Tenth Grade was very fun. They started to chase the black crescent and twirled around Tenth Grade .</p><br/><p>Tenth Grade that wanted to focus on cultivation felt very irritated. He could not resist any longer. Opening his eyes, his murderous intent brimmed. “Go play somewhere else! Stop bothering me!”</p><br/><p>Lil’ Pagoda and Lil’ Fire shook and flew far away in fear.</p><br/><p>Silly Bird who had been dozing suddenly opened her eyes. The bird eyes narrowed and flashed savagely. Her figure suddenly disappeared from her spot.</p><br/><p>Tenth Grade felt alarm, but he was unable to muster a response before a powerful force whipped his body.</p><br/><p>Bam!</p><br/><p>He was like a rock that had been kicked and landed head first in the ground.</p><br/><p>“Who … …”</p><br/><p>The dizzy Tenth Grade tried to struggle up, his heart brimming with killing intent as he wanted to attack.</p><br/><p>An enormously big bird claw came from the sky. The enormous shadow covered Tenth Grade .</p><br/><p>Pew!</p><br/><p>Limbs spread out, Tenth Grade was splayed out and pinned to the ground by Silly Bird’s claws. He was unable to move.</p><br/><p>In Tenth Grade‘s eyes, an enormous bird head with a pair of vicious eyes came down and stared at him.</p><br/><p>Tenth Grade‘s body froze as he was dumbstruck.</p><br/><p>Translator Ramblings: Zuo Mo is jade of all trades, master of none and worse off than being master of one. He needs time, lots of time, ling power needs time to accumulate, mo physique needs to be exercised and he needs to study and memorize yao arts. Golden Crow Camp takes control of their own development.</p><br/><p>Tenth Grade needs to learn the pecking order, which is Silly Bird at the top. Tenth Grade might be a fifth-grade ling beast but he’s just born and Silly Bird is stronger and more experienced. Who knows what Silly Bird has eaten has affected her. I also realized something about the black butterfly. Since Zuo Mo kept the butterfly in the card, it hasn’t had much interaction with the rest of the pets and so Zuo Mo doesn’t seem to care about it the way he cares about other pets, even weaker ones like Lil’ Black.</p><br/>\n</div>"}