{"title": "Chapter Three Hundred and Thirty Seven – Crimson Fiend Cauldron", "id": 287, "volume": 3, "url": "http://boxnovel.org/world-of-cultivation-chapter-three-hundred-and-thirty-seven-%E2%80%93-crimson-fiend-cauldron", "volume_title": "Volume 3", "body": "<h1>Chapter Three Hundred and Thirty Seven – Crimson Fiend Cauldron</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Three Hundred and Thirty Seven – Crimson Fiend Cauldron</p><br/><p>The center of the slave transporting boat had been completely transformed. The rooms on multiple floors had been completely torn down. Right now, what stood in their place was a double-handled red cauldron about five zhang tall. The crimson red cauldron appeared to have been just taken from a strong fire. The shape was simple, but the presence was heavy. If one went to closer, they would see that the body of the cauldron was covered in formation scripts written in the size of ants. The complexity would make one faint.</p><br/><p>If a xiuzhe skilled in forging saw this cauldron, they would be very shocked. Such small and complex formation scripts could not be completed even if a jindan forging xiuzhe worked for three to five years.</p><br/><p>This enormous Crimson Fiend Cauldron was the effort by all of the people in Golden Crow Camp.</p><br/><p>The body of the cauldron was made from a mixture of fire element materials like Crimson Fire Rock. The great majority were fourth-grade materials. The forging method to make the Crimson Fire Cauldron was different than normal methods. After the plan had been confirmed, the large cauldron had been divided into three hundred and twenty six pieces. There had been clear discussion regarding the size of each piece and the seal scripts carved into them. Due to the fact the sizes of the parts were relatively small after being dismembered, the forging difficulty was much lower. Each piece was repeatedly forged, and each line on the seal scriptshad been exquisitely planned.</p><br/><p>In other words, the large cauldron was a puzzle that was pieced together. The entire assembly process took seven whole days and nights, members of Golden Crow Camp forged without sleep and rest to finish. After that, the entire camp used Golden Crow Fire to forge it for fourteen days to melt it into one body.</p><br/><p>Today, the large cauldron took form!</p><br/><p>When every Golden Crow Camp member looked at this astounding large Crimson Fiend Cauldron, their eyes were filled with head and pride!</p><br/><p>Fifth-grade!</p><br/><p>The grade of this large cauldron was fifth-grade!</p><br/><p>When the masters announced this result, all of the camp cheered. Fifth-grade, that was enough for every person of Golden Crow Camp to feel proud. Golden Crow Camp did not have one jindan in its ranks, all of them were ningmai.</p><br/><p>Only jindan xiuzhe, of at least the second stratum, had the ability to forging fifth-grade talismans.</p><br/><p>But Golden Crow Camp that had no jindan at all did it!</p><br/><p>However, the cheers only continued for a short period of time. Everyone’s expression turned serious because an even more crucial step was arriving.</p><br/><p>Black red fiendish mist flowed towards the slave transporting boat like a tide.</p><br/><p>Inside the slave transporting boat, the mood was nervous, and the loud voices of the two masters could be heard.</p><br/><p>“Pay attention and control the flow rate of the fiendish mist!”</p><br/><p>“Maintain the Golden Crow Fire, keep it up!”</p><br/><p>The fiendish mist that was absorbed turned to a slender black-red flow and entered the large cauldron. The Golden Crow Fire within the cauldron seemed to have had a bucket of oil poured over it and grew.</p><br/><p>Everyone uncontrollably stopped breathing.</p><br/><p>The fine seal scripts on the Crimson Fiend Cauldron suddenly shot up with gold light. A vast ling power wave filled every corner of the slave transporting boat. The formations on the boat lit up at almost the same time.</p><br/><p>Only now did the hearts of Golden Crow Camp members land. Cheers suddenly exploded.</p><br/><p>Master Ji Wei’s face was covered in tears. Sun Bao was also very emotional, swallowing hard and unable to speak. He felt it would be worth it even if he died now!</p><br/><p>Before Wan Tian had been urging Wei Cheng Bin to get some black fiendish energy, he and Sun Bao had already started to study the black fiendish energy.</p><br/><p>The jade scroll that Zuo Mo had sent over had resolved many problems they could not overcome. Even though they had done this through the combined effort of the entire camp, but being able to forge such a cauldron when they were just ningmai was enough to make them famous throughout the entire world.</p><br/><p>It wasn’t just the two masters. The people of Golden Crow Camp came from small sects, and most were those that did not have great ambitions. Everyone was uncontrollably excited at being able to complete such an amazing work. Many people couldn’t stop themselves from crying.</p><br/><p>When Zuo Mo rushed over, this was what he saw.</p><br/><p>Then his gaze was securely attracted to this five zhang tall Crimson Fiend Cauldron, and was dumbstruck.</p><br/><p>“You forged this?” Zuo Mo pointed at the large cauldron and asked disbelievingly.</p><br/><p>Sun Bao said respectfully and with pride, “Yes, Daren!”</p><br/><p>Zuo Mo was shocked!</p><br/><p>That was right, he was completely shocked!</p><br/><p>He couldn’t be called skilled in formations, but his understanding of formations was far above everyone else. However, he was still amazed at the clever thinking behind the forging of the Crimson Fiend Cauldron. The forging of the Crimson Fiend Cauldron used Golden Crow Fire, and what Zuo Mo hadn’t expected was that they actually put the Great Golden Crow Formation onto this cauldron.</p><br/><p>This way, the Golden Crow Fire inside the cauldron would be maintained for a long time and could gather Golden Crow Fire from sunlight. In the future, there would be no need to worry about the supply of Golden Crow Fire. As the amount of Golden Crow Fire inside the cauldron increased, it was very likely that it could produce even higher grade flames.</p><br/><p>In other words, the Crimson Fire Cauldron still had room to improve.</p><br/><p>But this wasn’t what shocked Zuo Mo the most. What gave him the greatest shock was the Crimson Fiend Cauldron could process fiendish mist and turn it to ling power.</p><br/><p>Wasn’t … … wasn’t this the method of [Fiend Ling]?</p><br/><p>[Fiend Ling] could transform fiendish energy to ling power. Vermillion Bird Camp was furiously cultivating this spell, but who could have expected that Golden Crow Camp would walk ahead of them.</p><br/><p>“A pretty good talisman!” Pu Yao couldn’t help but praise.</p><br/><p>The rich and lively ling power inside the slave transporting boat made a person feel comfortable. In this place, black fiendish energy was in endless supply. With the Crimson Fiend Cauldron, they did not need to worry about the problem of ling power at all. Their jingshi supply could also provide ling power but there would be a day when it was all used up.</p><br/><p>The members of Golden Crow Camp all floated in this direction. Daren’s shocked expression made them feel very good.</p><br/><p>“Can you make a few more?” Zuo Mo asked Sun Bao.</p><br/><p>Sun Bao showed a difficult expression. “It isn’t hard to forge, but I’m afraid we cannot find suitable materials.”</p><br/><p>In order to forge the Crimson Fiend Cauldron, all the rare materials from Bao Yi’s stores had been swept clean. If it wasn’t that Sun Bao and Ji Wei had both personally gone to demand them from Bao Yi, Bao Yi definitely would not have given the materials up.</p><br/><p>Zuo Mo was slightly disappointed but he was not surprised. Low grade materials could not endure such powerful ling power and the domineering Golden Crow Fire.</p><br/><p>“I’m really greedy!” Zuo Mo said mockingly. He then said to Sun Bao and Ji Wei, “Good work! In the future if you need any materials, go to Bao Yi to get them. If that bamboo stick won’t give them to you, come find me directly.”</p><br/><p>Sun Bao and Ji Wei were overjoy, “Thanks, Daren!”</p><br/><p>To people that enjoyed forging, this promise made them happier than anything else.</p><br/><p>Golden Crow Camp gave Zuo Mo a big surprise. With the Crimson Fire Cauldron, the pressure placed on him instantly decreased. They could be at more ease while exploring this strange place.</p><br/><p>———</p><br/><p>Coming out of the slave transporting boat, Zuo Mo was in a very good mood. He looked around. The camp was very busy. Everyone had not sunk into a depression but worked harder on their cultivation. Seeing the situation, Zuo Mo started to cultivate himself. Becoming stronger was better than anything else.</p><br/><p>Pu Yao said that he had a nickname of the “Encyclopaedia of Yao Arts.” Zuo Mo felt that this nickname was a bit of an exaggeration. It wasn’t the first time this guy liked to boast, but this guy really displayed his aptitude when he started to explain yao arts.</p><br/><p>Five hundred types of little yao arts. After Pu Yao explained them to him again, Zuo Mo had a completely different perspective.</p><br/><p>However, Zuo Mo cared more about the Archaic Wasteland Sacrificial Art.</p><br/><p>“Pu, teach me another two moves of the Archaic Wasteland Sacrificial Art!” Zuo Mo raised his face and said fawningly.</p><br/><p>Pu Yao replied absentmindedly, “Oh, don’t try to always get free benefits. It’s a dream to think that you can combine two little yao arts to get something powerful.”</p><br/><p>“Then you can teach me some powerful yao arts?”</p><br/><p>“You understand all of the little yao arts?” Pu Yao glanced at him.</p><br/><p>“Pretty much.” Zuo Mo had some confidence about this.</p><br/><p>“Really?” Pu Yao had a slightly smile. “Then let’s test it.”</p><br/><p>“Test? What test?” Zuo Mo became alert.</p><br/><p>Before he finished asking, the scene in the surroundings seemed to retreat like a wave, and turn to a dark void.</p><br/><p>This was … … Ten Finger Prison!</p><br/><p>Damn it!</p><br/><p>Zuo Mo didn’t have the time to swear. His vision blurred and pushed the swear words at his mouth back.</p><br/><p>“Your consciousness has become much stronger, and you should be able to stay for twelve hours now,” Pu Yao did not waste words and said crisply. “Walk forward using the method I taught you last time. I don’t demand anything too highly of you. Twelve hours, walk thirty li forward. Ooh, this demand is just one-tenth of mine when I first came here.”</p><br/><p>Finishing, Pu Yao did not allow Zuo Mo to speak and disappeared.</p><br/><p>Vast Water Clear Skies, Zuo Mo had come last time and wasn’t unfamiliar with this place. According to Pu Yao, the entire Vast Water Clear Skies was constructed from thirteen thousand low-level yao arts.</p><br/><p>Hm, just thirty li, you think this will trouble ge?</p><br/><p>Provoked by Pu Yao’s disdainful tone, Zuo Mo did not procrastinate. He lowered his head and started to deconstruct the yao art under his feet.</p><br/><p>Every bit of soil, every piece of rock, every stalk of grass here was made from yao arts.</p><br/><p>His consciousness made a close inspection. The yao arts here were completely different in Zuo Mo’s eyes than the ones from last time. Last time, if it wasn’t for Pu Yao guiding him continuously, he couldn’t have even advanced a single step. But right now, even facing low level yao arts he had never seen before, he could think of solutions.</p><br/><p>It was a great help to him that his consciousness was stronger than in the past. No wonder they said that the consciousness was the basis of yao arts. Comparing the two visits, Zuo Mo gave a direct and deeply engraining experience. The yao arts borrowed all kinds of powers from within the world. The consciousness was like a level that leverage the power of the world.</p><br/><p>The first yao art did not take Zuo Mo long before he deconstructed it.</p><br/><p>Walking one step by one step, deconstructing one yao art by one yao art.</p><br/><p>This feeling … … was somewhat familiar … …</p><br/><p>Zuo Mo suddenly remembered why he found it familiar. In Wu Kong Mountain, he had also studied the questions of the [Preliminary Formations] jade scroll from Kun Lun. The feeling now was slightly similar.</p><br/><p>This was a little bit interesting!</p><br/><p>Zuo Mo did not find it dull, but found it interesting.</p><br/><p>He gradually found some patterns, and his speed became faster. These low level yao arts had many transformations and he did not recognize the great majority of them. However, he found that if he used the right method, they were all able to be deconstructed using little yao arts.</p><br/><p>Immersed in deconstructing yao arts, he did not notice the scenery behind him that he just deconstructed was changing.</p><br/><p>Even more so, he did not notice a pair of eyes staring at him from nearby.</p><br/><p>Translator Ramblings: Golden Crow Camp is a think tank coming up with new ideas. Zuo Mo’s very lucky that Sun Bao and Ji Wei are smart and dedicated to him. Otherwise, he will be having a much harder time.</p><br/><p>Pu Yao got tired of negotiating and not getting anything paid. So the brute force move is now used.</p><br/>\n</div>"}