{"title": "Chapter Three Hundred and Fifty – You Dare Attack Ge!", "id": 300, "volume": 3, "url": "http://boxnovel.org/world-of-cultivation-chapter-three-hundred-and-fifty-%E2%80%93-you-dare-attack-ge", "volume_title": "Volume 3", "body": "<h1>Chapter Three Hundred and Fifty – You Dare Attack Ge!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Three Hundred and Fifty – You Dare Attack Ge!</p><br/><p>The raging Zuo Mo seemed to be insane, growling from the deepest part of his throat like a furious animal roaring.</p><br/><p>“You dare attack ge … … dare attack ge … …”</p><br/><p>“… … you will definitely die … …”</p><br/><p>“… … destroy you f***ers … …”</p><br/><p>.. …</p><br/><p>Zuo Mo seemed to have been messed with. Angry, he searched for anything that he could attack. He changed his reactive and defensive posture, and attacked head on!</p><br/><p>Didn’t the water yao arts fly out from these river flows?</p><br/><p>Then he will flatten all of these river flows!</p><br/><p>With both of his hands in the river flow he attacked, his fury and rage did not make him lose his judgement, but heightened the sensitive intuition of a wild beast. In just that instant, the structure of the river flow constructed of yao arts seemed to flashed across his mind like flowing water.</p><br/><p>Without needing to think, he started to deconstruct it.</p><br/><p>In his eyes, the enormous river flow was not any different than those rocks and flora he previously deconstructed, just a little bit bigger in scale.</p><br/><p>Who had left the impression of the river flows? What was Clear Skies Thousand Flow? Prison-breaking battle?</p><br/><p>What was that?</p><br/><p>His eyes crimson red and only held the most primitive crazy desire for battle and stubbornness.</p><br/><p>Deconstruction, deconstruction, complete deconstruction!</p><br/><p>The river flow was more complex than any yao art he had deconstructed before, but Zuo Mo’s attacking capabilities were far stronger in this moment than normal. His mind was unprecedentedly focused, his reactions unusually sensitive and his intuition abnormally accurate!</p><br/><p>The hands that were in the river flow swayed gently like reeds. The water flow was lit up with a faint glowing like and had a blurry beauty.</p><br/><p>———</p><br/><p>The yao outside the battlefield were completely struck dumb by Zuo Mo’s actions.</p><br/><p>Gulp!</p><br/><p>Simultaneous sounds of swallowing. It was so clear and ear-piercing in the deathly silent Vast Water Clear Skies. No one cared. Their eyes couldn’t bear to stray from the figure in the battlefield for a moment.</p><br/><p>Of course they could see that Zuo Mo was like a provoked lion who had started to furiously retaliate. Anyone who wasn’t an idiot could see.</p><br/><p>But … …</p><br/><p>But didn’t this guy know this was the prison battlefield that Qian Liu Daren set down? That was Qian Liu Daren! The Qian Liu Daren who had the appellation of Clear Sky Thousand Flows, the King of water yao arts, the Qian Liu Daren known in the world and had the qualifications to enter the Council of Elders!</p><br/><p>Shouldn’t every yao be shaking and filled with admiration and respect in front of the marks such a legend left behind?</p><br/><p>But that furious figure in their field of vision was such an eyesore, so painful that they felt disbelief.</p><br/><p>Why was he angry? How could he be angry? That was Qian Liu Daren … …</p><br/><p>Arrogance!</p><br/><p>A term jumped out in the hearts of the yao. They could not believe that one of a younger generation dared to use this kind of posture to face the prison battlefield that Qian Liu Daren had set down! No, this was not facing off, this was a challenge!</p><br/><p>That was right, this was a challenge!</p><br/><p>Heavens! There was a yao who dared to challenge Qian Liu Daren!</p><br/><p>All the yao were shocked by their thoughts and looked dazedly at the battlefield.</p><br/><p>———</p><br/><p>Nan Yue did not notice Teacher Chi whose mouth was wide and had a dazed expression. Her black eyes were tightly locked onto the hands that Zuo Mo had immersed into the river flows. When those hands lit up with the familiar glow, her eyes instantly became very wide.</p><br/><p>Daren was using… … deconstruction!</p><br/><p>For a whole moment, her mind was blank, but she shook and reacted. She did not know just how shocked the expression on her face was. She pressed hard against her furiously beating heart, her lips white from being bitten by her teeth as she stared at Daren’s hands!</p><br/><p>As though that pair of hands had a kind of magnetism!</p><br/><p>If Daren was really deconstructing Qian Liu Daren’s … …</p><br/><p>She almost didn’t dare to keep thinking, but she knew that the scene in front of her was a once-in-a-thousand chance. To be able to see Daren deconstructing the water yao art of Qian Liu Daren, even if it was not successful, it was a chance that would only appear once in her lifetime!</p><br/><p>The taste of blood suddenly spread inside her mouth. She instantly reacted. She had been too nervous and bit through the skin of her lip. However, this little distraction caused her heart to relax slightly. Out of the corners of her eyes, she noticed that people were casting recording yao arts. She instantly thought, she was so stupid, she even forgot about the recording yao arts.</p><br/><p>There were recoding yao arts among all the yao arts, and had the same purpose as the xiuzhe’s mirage jade scrolls. However, the recording yao arts could be stored in the sea of consciousness of the yao, and were more convenient.</p><br/><p>She hurriedly cast a recording yao art to prepare for her to study slowly when she returned.</p><br/><p>This entire distraction caused her to calm down greatly. She could finally act calmly. Watching the lights on Daren’s hands, her mind quickly matched the corresponding yao arts. Very quickly, the face that had just calmed down showed shock again.</p><br/><p>Little yao arts!</p><br/><p>All of them were little yao arts!</p><br/><p>Nan Yue could clearly see. She was able to match the little yao arts to the dozen of lights that lit up. When she realized this, she was truly stunned.</p><br/><p>Did … … Daren plan on using little yao arts to deconstruct Qian Liu Daren’s water yao arts?</p><br/><p>She had been amazed when Daren had used a little yao art combination to defeat Qian Liu Daren’s fire yao art. Even though she felt shocked, but she could still accept it. Qian Liu Daren was famed for his water yao arts, and no one had heard of his fire yao arts. But Daren was now using little yao arts to deconstruct the water yao arts that Qian Liu Daren had become famous for. This caused Nan Yue’s mind to short-circuit.</p><br/><p>———</p><br/><p>No matter if it was the disbelief of the yao outside the battlefield or Nan Yue’s blank mind, they did not affect Zuo Mo inside the battlefield at all.</p><br/><p>He wasn’t deliberately using little yao arts, but it was because he only knew little yao arts. From when he had started to deconstruct yao arts, Pu Yao had only taught him one method, to use little yao arts. Pu Yao had also made little yao arts appear wonderful, and that any yao art could be deconstructed with little yao arts etc etc.</p><br/><p>This directly gave Zuo Mo the wrong impression, that all deconstruction should be done with little yao arts.</p><br/><p>Also, these river flows that were in front of him in his view were just some more complex yao arts. So he did not hesitate in following his usual habits as he started to deconstruct it.</p><br/><p>What he did not know was that Pu Yao in his sea of consciousness was gaping and wide eyed. The usually cold and evil face was dumb, and his eyes had almost dropped out.</p><br/><p>There was only one thought left in his mind, this guy was using little yao arts to deconstruct … ..</p><br/><p>This river flow was more complex than any object that Zuo Mo had encountered in Vast Water Clear Skies. He was even able to see the deep laws of water yao arts within them.</p><br/><p>However, there was no true difference in Zuo Mo’s eyes, it was just more complex.</p><br/><p>When the raging Zuo Mo encountered a complex problem, his response once again was unexpected to Pu Yao He didn’t become more restless, but he was like a lion that met a comparable rival. His desire to fight and compete expanded!</p><br/><p>He had attacked first, and unconsciously became the proactive one.</p><br/><p>The lights on his hands continuously changed, and the rate of change accelerated, so fast that it was hard to decipher. The speed that his hand cast little yao arts continuously grew faster. In a short time, it surpassed the fastest speed he could cast at.</p><br/><p>Zou Mo did not notice this.</p><br/><p>But he was clear that just this speed was not enough to deconstruct the river flow in front of him.</p><br/><p>Zuo Mo’s repeated attacks of little yao arts instantly caused the river flow to retaliate. The river flow in front of him suddenly lit up with faint light. In the void, it looked like a glowing belt of light that floated.</p><br/><p>Zuo Mo made a muffled grunt and his crimson red eyes became even more reddened.</p><br/><p>Just now, five water yao arts had silently sneaked near him from the river flow. He had almost been hit. The raging Zuo Mo became even more furious. Without another word, the rate of little yao art changes on his hands increased another step.</p><br/><p>The speed he was casting little yao arts now was two times his fastest speed!</p><br/><p>The effect was immediately seen!</p><br/><p>The peaceful river flow suddenly severely rippled. The river flow in front of Zuo Mo suddenly shook fiercely like the twisted body of a snake in pain struggling fiercely.</p><br/><p>In response the speed of the river flow also increased.</p><br/><p>Numerous translucent schools of fish appeared in the river flow. These schools of fish all had various shapes, their bodies transparent and made completely of water. If they were not seen from at a close distance, it was very difficult to detect them.</p><br/><p>There were so many schools of fish that they could not be counted. Once they were formed, they furiously leaped towards Zuo Mo’s hands in the river flow.</p><br/><p>His mind unprecedentedly focused, Zuo Mo instantly noticed the change of the river flow. But his feeling was completely different than those of the spectators. These furiously charging schools of fish, in his mind, were just new changes in the structure of the yao art making up the river flow.</p><br/><p>He didn’t have any fear, and felt very excited because this meant that his deconstruction method was right. The river flow had detected the danger which was the reason it retaliated so fiercely.</p><br/><p>Come on, baby!</p><br/><p>Zuo Mo’s blood rose to his head, his desire for battle rising to a peak. The little yao arts his hands were casting were even more insane and became faster!</p><br/><p>His two hands turned to one ball of intangible shadows. It was impossible to see his ten fingers clearly. His consciousness and finger movements were unusually in sync at this moment. With the smallest change of his finger, his consciousness would automatically make the corresponding change.</p><br/><p>Lights flew between his flying hands with astounding speed. Some of these various colored lights headed straight for the schools of fish, some grouped together , and there were even several dozen that welcomed the school of fish like a net.</p><br/><p>Zuo Mo felt unspeakably great. The little yao arts seemed to have become an instinctive part of him, and he had no problems casting them!</p><br/><p>But he did not immerse himself in the feeling of pleasure. He only had one target in his eyes. Deconstruction! Complete destruction!</p><br/><p>He was going to completely deconstruct this damned river flow!</p><br/><p>Dare attack ge!</p><br/><p>Die die!</p><br/><p>All die!</p><br/><p>Faster! Even faster! Just a bit more!</p><br/><p>The speed of the two hands seemed to suddenly decrease. If it was put in slow motion, one would find the practiced motions seemed to pause, but this stop was very short, so short that people would find it hard to detect.</p><br/><p>After this extremely short pause, the two hands that had been blurry into one ball slowly separated.</p><br/><p>Two balls of shadow, two balls of furiously changing light balls!</p><br/><p>The river flow that had been vibrating fiercely suddenly stopped. The body of the continuously struggling glittering snaking river seemed to freeze in this moment!</p><br/><p>The rushing river flows around, the spraying waves, they all stopped in the sky.</p><br/><p>Time seemed to suddenly stop. All the river flows in the entire prison battlefield froze, silent and motionless.</p><br/><p>Translator Ramblings: Still not over, Lil’ Cliffy is in full force. It’s not that Zuo Mo is trying to be cool, he only knows so many yao arts to start with.</p><br/>\n</div>"}