{"title": "Chapter Two Hundred and Fifty Nine – Meteor Void Fire", "id": 309, "volume": 4, "url": "http://boxnovel.org/world-of-cultivation-chapter-two-hundred-and-fifty-nine-%E2%80%93-meteor-void-fire", "volume_title": "Volume 4", "body": "<h1>Chapter Two Hundred and Fifty Nine – Meteor Void Fire</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Two Hundred and Fifty Nine – Meteor Void Fire</p><br/><p>A hard lightning bomb floated in front of Zuo Mo.</p><br/><p>Without any visible action from him, with only a streak of silver lingering in his vision, the hard lightning seemed to disappear into the air.</p><br/><p>There was no earth-shaking roar, no oppressive presence. It was fast, so fast that Yuan Jiang didn’t have the time to react. When he finally caught up, he hurriedly turned his head. The sky was empty. Nothing had been left. There was no explosion of blood and limbs, no smoke from being burned at high temperatures. The sky was light and clear as though nothing had happened.</p><br/><p>“We got it?” Yuan Jiang asked uncertainly.</p><br/><p>“Probably,” Zuo Mo answered back just as uncertainly. The speed that the formation battle watchtower had formed the hard lightning was faster than he expected. He had almost made a fool of himself. Just as he had locked onto the target, the hard lightning had flown out.</p><br/><p>The two people looked around for a while and made sure they couldn’t find that eagle before confirming that it really had been killed.</p><br/><p>“It seems that they will need to practice,” Zuo Mo muttered.</p><br/><p>Yuan Jiang wasn’t in a position to give a review. Even though Boss said it was hard lightning, but he had not felt the rumored strong presence of hard lightning. Maybe this was a weakened version of hard lightning? He felt it was possible. It was a pity that it was just an eagle. If it was a much stronger ling beast, it would be much easier to test its true power. At this moment though, Boss’ formation battle watchtowers had a great advantage: speed.</p><br/><p>In the blink of an eye, a round of attack had been sent.</p><br/><p>“Boss, how many people can use the hard lightning at the same time here?” He decided to point out problems from a technical point of view.</p><br/><p>“Ten, all of them above ningmai. On average, one hard lightning bolt will consume five jing of ling power,” Zuo Mo said. “I can only reach this level now. If I can do two jing of ling power per hard lightning bolt, that would be good.”</p><br/><p>“Five jing of ling power?” Yuan Jiang jumped in fright. This formation used up this much ling power?</p><br/><p>That was not how much jingshi it used, but the ling power of xiuzhe. It consumed a xiuzhe’s ling power to activate the formation and to control the lightning.</p><br/><p>From a professional point of view, the formation battle watchtowers that Boss had designed were placed in the ranks of failed products. Before, he had felt that the speed of the hard lightning formation battle watchtowers were at least an advantage. Looking at it now, it was a failure.</p><br/><p>The cultivation of a ningmai first stratum was between ten to thirty jing. Second stratum xiuzhe between thirty and ninety jing. One hard lightning bolt consumed five jing of ling power from a xiuzhe. That meant a xiuzhe at the peak of ningmai first stratum could only shoot six hard lightning bolts, and a second stratum peak xiuzhe could only shoot eighteen hard lightning bolts.</p><br/><p>The quick attack rate of the formation battle watchtowers actually became its greatest flaw. It would only take a blink for the six hard lightning bolts to fly out. After the ling power of the xiuzhe was used up, the formation battle watchtower was just a watchtower.</p><br/><p>“Boss, the expenditure is too scary,” Yuan Jiang decided to give a professional opinion. “We can completely use some formations with higher offensive power with such high ling power expenditure.”</p><br/><p>“This is the strongest offensive formation that I can find.” Zuo Mo spread his hands.</p><br/><p>“But our people cannot keep up. Their ling power would be used up in a very short amount of time. After that, we will lose the ability to fight.” Yuan Jiang struggled to persuade Zuo Mo. Geniuses were not all powerful, he thought inside.</p><br/><p>“Oh, that is a problem.” Zuo Mo mused. His eyes suddenly lit up, and he clapped his hands, saying, “Ha, that’s easy to solve. We have so many people, aren’t there about seven hundred and so over there? Everyone can take turns. We only need ten to a shift.”</p><br/><p>The more Zuo Mo thought, the more excited he was. He said to himself, “By that time, I’ll get them to train hard. Ten people to a team, they will take turns. We have the Black Processing Meditation mats, it’s fast to recover ling power. If we stagger the time, one round will follow another. That way, we can attack unlimited times. That’s right, our battle strategy is to win through numbers. If one person cannot kill him, a thousand people will do it together!”</p><br/><p>Zuo Mo gritted out the last words.</p><br/><p>Yuan Jiang gaped upon hearing this. So, so it could be like this!</p><br/><p>When he thought back, he felt that Boss’ plan was plausible. Even though it was not so honorable, but these days, weren’t people competing on their hooliganism? Other than shock, he became wary. He could not offend Boss no matter what he did!</p><br/><p>Yuan Jiang didn’t know if geniuses were gangsters, but when a genius became a gangster, then they would be a great gangster. This was his newest conclusion.</p><br/><p>———</p><br/><p>A slender and blinding silver light flashed across the sky. Jiang Hao, who was in ghost form, suddenly froze. He instinctively felt fear from the presence of the silver light.</p><br/><p>That was the smell of lightning … …</p><br/><p>Before he could react, he suddenly raised his head. In the sky, his fellow that had shifted into an eagle had disappeared.</p><br/><p>The ghost figure was shocked. He was greatly shocked! Damn it! How had the enemy found them? What terrified him even more was that the xiuzhe that had turned to the eagle seemed to have disappeared into thin air, and did not leave anything behind.</p><br/><p>That wasn’t possible!</p><br/><p>That was a ningmai second stratum xiuzhe! Even though he had shifted into an eagle which prevented him from using many spells, but his real body was still ningmai second stratum! What spell could just erase a ningmai second stratum xiuzhe without leaving a trace? None of the spells he knew of could do such a thing.</p><br/><p>At the same time, the other scouts that had also been moving forward also stopped.</p><br/><p>Had they been discovered?</p><br/><p>Everyone’s heart was beating furiously. For scouts, if the enemy had their defenses prepared and they got too close, the chance they would return alive was pitifully small. The enemy clearly also had an extremely powerful and wondrous talisman, or spell.</p><br/><p>Their gazes turned to Jiang Hao.</p><br/><p>The urge to retreat came up in Jiang Hao’s heart. He looked rough usually, but when he turned into the ghost figure, he was cunning and treacherous. If they keep on scouting now, he would most likely lose his life. That strange silver light definitely was his natural enemy!</p><br/><p>———</p><br/><p>Just as Jiang Hao didn’t know whether to advance or retreat, Jiang Wei, located not far away, was also alarmed by the hard lightning. Jiang Wei’s expression was uncertain. The power inside the little city didn’t seem to be as weak as he had imagined.</p><br/><p>The enemy had already found them. His thoughts were the same as Jiang Hao.</p><br/><p>He understood his plan had failed. There would be no meaning in sending out scouts now. He hurriedly summoned back his little brother. He just had this one little brother, and he cared very much for him.</p><br/><p>“Dao Zi, take one hundred people to see what they are made of.” After some thought, he decided to probe them first. If the situation wasn’t right, they could turn and run away. Unless it was the last moment, they wouldn’t use their full power. This was his secret to surviving until now.</p><br/><p>“Alright!” Dao Zi’s figure was large, his face in a snarl, his beady eyes flashing with a vicious light. He was a great subordinate of Jiang Wei’s. He was combative and fond of killing. When he went into a berserk rage, he never left anyone left alive. He was vicious to his enemies, and also to himself. He was vicious and did not fear death.</p><br/><p>Dao Zi quickly picked one hundred people, and headed towards the little city atop Sky Star Peak.</p><br/><p>Since they had been discovered, it was not necessary to keep hidden anymore.</p><br/><p>———</p><br/><p>Zuo Mo was pondering the problem of the formation battle watchtowers and did not realize that danger was nearing. He suddenly felt that a light was flashing, and raised his head. He saw a strange purple light in the eyes of the female xiu.</p><br/><p>Before he could respond.</p><br/><p>The female xiu sudden flew up into the sky.</p><br/><p>Zuo Mo hurriedly stood and also flew into the sky.</p><br/><p>When he saw the one hundred people coming with murderous intent, his head rang like someone hammered it.</p><br/><p>Enemy attack!</p><br/><p>Before he could respond, the female xiu had spread out her arms like a great bird and charged at the enemy!</p><br/><p>Zuo Mo’s expression changed dramatically!</p><br/><p>Danger!</p><br/><p>All of this happened extremely quickly, like a flash of lightning. When he managed to react, the female xiu was only five hundred zhang from the group!</p><br/><p>———</p><br/><p>Dao Zi looked at the female xiu coming closer and snickered, “It’s a girl! Motherf***ers, no one can take this one from me!”</p><br/><p>The other xiuzhe also snickered.</p><br/><p>———</p><br/><p>At such a dangerous time, Zuo Mo’s mind was blank. When he came back, he was already in mid-air.</p><br/><p>Everything in front of him slowed down. He could see the twisted smiles on the faces of these one hundred xiuzhe, could see the light of their flying swords increase, could see her worn sleeves flapping in the wind … …</p><br/><p>Everything in front of him seemed to blur.</p><br/><p>Those twisted and vicious faces became blurred like the mist, the killing intent behind each blurred face was like a blood-thirsty yao beast. The blue sky seemed to have been shadowed over. There was only that figure wrapped in torn clothing, her arms spread like a large bird filled with resolve and will, the snow-white bare feet that reminded Zuo Mo of the most perfect porcelain.</p><br/><p>He looked dazedly. What was in front of him was so slow that Zuo Mo could see so clearly.</p><br/><p>For some unknown reason, it was like a chord in his head had been plucked. Zuo Mo’s eyes suddenly turned red, the desire for battle was like a rampaging wave of lava, like the flood bursting the dam, and took over his body in an instant, burning his body with pain.</p><br/><p>“Kill!” The deep howl sounded out like that of an ancient savage beast.</p><br/><p>All the ling power in his body was channeled to the extreme, light suddenly exploding on his naked upper body. His skin became even more transparent like black jade, so much that it was possible to see threads of black energy that were continuously swimming under his skin.</p><br/><p>He suddenly leaped into the air. In the blink of an eye, he had flown up one hundred zhang. His figure abruptly flipped upside down, and his legs pushed against the empty air.</p><br/><p>Pia!</p><br/><p>It was clearly void of any objects, but it was as though his feet had pushed against some invisible object and he shot off, full of force!</p><br/><p>Zuo Mo’s figure changed directions and shot downwards, charging at the group of xiuzhe with all his might.</p><br/><p>The chaotic turbulence boomed in his ears. His speed suddenly broke past his usual limits. The explosion completely separated him from the outside world. Every part of his body was trembling in either fear or excitement.</p><br/><p>Hiss hiss hiss!</p><br/><p>In the chaotic air flowing around his body, a hint of red suddenly appeared. Fire! It was fire! Zuo Mo’s consciousness was like an invisible hand stimulating these tiny fire snakes. In the blink of an eye, the fire exploded. The chaotic air flows in the surroundings were like dry firewood. Countless fire snakes appeared and swam restlessly in the turbulent air flowing around Zuo Mo’s body.</p><br/><p>———</p><br/><p>In the air, the blinding fire light, and the deep sound of an explosion caused Dao Zi and the others to shift their attention to the fire ball dropping from the sky.</p><br/><p>Dao Zi’s expression suddenly changed, “Quick, spread out!”</p><br/><p>Immediately after, everyone’s expressions changed!</p><br/><p>The air around them seemed to solidify. Their bodies were tightly held by an invisible suction force.</p><br/><p>“Meteor Void Fire! Motherf***ing … …”</p><br/><p>With the booms from the explosions, dragging a long and blinding tail of fire, Zuo Mo was like a divine being smashing down with the force of thirty thousand catties!</p><br/><p>Translator Ramblings: Mistaken assumptions … … everything is a coincidence. Jiang Wei accidentally going along and seeing Gongsun Cha’s tactical might, then finding the city and scouting right at the time that Zuo Mo is trying out his new battle towers. So a battle is accidentally instigated.</p><br/><p>Also, Zuo Mo seems to have changed color due to Jade Metal Head and the … … uh … …”black energies” combining together. Black energies sounds so evil … …</p><br/>\n</div>"}