{"title": "Chapter Two Hundred and Sixty One – Ambush!", "id": 311, "volume": 4, "url": "http://boxnovel.org/world-of-cultivation-chapter-two-hundred-and-sixty-one-%E2%80%93-ambush", "volume_title": "Volume 4", "body": "<h1>Chapter Two Hundred and Sixty One – Ambush!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Two Hundred and Sixty One – Ambush!</p><br/><p>The cave was so dark that they couldn’t see their own fingers. There was only a burst of sound as they moved out. They were doing their final inspections and preparations. It was abnormally silent as no one spoke.</p><br/><p>After a while, the preparations were finished, and killing intent silently spreading through as the mountain cave fell back into silence.</p><br/><p>“Depart,” Ma Fan spat out the word shortly.</p><br/><p>The procession swam out.</p><br/><p>Exiting the cave, the fresh air rushed onto their faces. Everyone couldn’t help but show intoxicated expressions but they quickly recovered their calmness. No one spoke. Even Lei Peng who usually chatted on was abnormally silent at this time.</p><br/><p>Everyone simultaneously flew into the air. After fighting so many hard battles together, the cooperation between the troops had matured.</p><br/><p>More than three hundred people were floating in the air. The scattered troops exuded killing intent like a bow that was slowly being drawn.</p><br/><p>They didn’t find any scouts in the sky. Ma Fan and Xie Shan looked at each other and saw the joy in the other’s eyes. After resting for five days, everyone was full of energy and ling power. The desire for battle that they had suppressed for so long was like a tiger breaking out of its cage and was unable to be stopped.</p><br/><p>“Our target: Nan Sheng Village!” Ma Fan crisply gave the order and moved first.</p><br/><p>The entire troop simultaneously moved to action from silence.</p><br/><p>There was no hesitation, no disguise or trying to conserve energy. The flight speed of the troop was pushed to their limits as they headed straight towards Nan Sheng Village! The scouts they encountered along the way stared with shock at this unfamiliar troop that had appeared out of nowhere.</p><br/><p>Ma Fan’s procession did not tangle with the scouts at all, brimming with killing intent as they flashed by the scouts.</p><br/><p>The sound of wind howling in their ears, the wind blew on their faces like knifes, and the scenery that flashed quickly under their feet caused the killing intent of these people to increase! In their eyes, Nan Sheng Village was a weak beautiful woman that was half naked and could not resist at all.</p><br/><p>Their lives were content after having such an experience.</p><br/><p>As Nan Sheng Village appeared in their vision, everyone’s battle intent rose to the peak!</p><br/><p>Even a person as indifferent as Ma Fan felt as though his blood was ignited. Raising his flying sword high, he angrily shouted, “Kill!”</p><br/><p>“Kill!”</p><br/><p>Everyone raised their swords and sabers, booming in their reply that shook the landscape!</p><br/><p>The troop that appeared to be one being suddenly dismembered itself in the air and divided into fourteen groups. Like fourteen snakes, they revealed their sharp fangs and leapt down at Nan Sheng Village!</p><br/><p>Ma Fan and Xie Shan each led a platoon as they charged at the very front. The two did not make any adjustments or detours, their bodies weighing down as they charged side by side!</p><br/><p>Two ruler straight air ripples drew through the air. The two troops were like arrows that left the bow as they shot towards the newly rebuilt village gates. The brand new village gates were like fragile cardboard, instantly torn to countless pieces that scattered in all directions.</p><br/><p>The two troops were not hampered in their speed, quickly passing through the ruler-straight streets of Nan Sheng Village!</p><br/><p>The sword energies criss-crossed!</p><br/><p>The high speed dive greatly increased the power of the sword energies. The keen sword energies were even more unstoppable at this time. The buildings on the two sides of the main street were ground into dust. The xiuzhe that jumped out all paled as they panicked. Facing such ferocious and insane sword essences, many xiuzhe’s awareness were stolen, and they lost their urge to fight!</p><br/><p>Pew pew pew!</p><br/><p>They were a destructive force, everywhere they passed innumerable bursts of blood rose. Amidst the loud roaring, the wails were not able to be heard.</p><br/><p>Boom!</p><br/><p>Ma Fan encountered the first resistance!</p><br/><p>A xiuzhe gave a muffled grunt but took advantage of the sword energy’s power to bounce in another direction! Ma Fan was slightly startled. This was an expert!</p><br/><p>Even he wasn’t certain if he could escape under a charge like this own. This person should be a third stratum xiuzhe. However, he ignored the other. One or two xiuzhe would not dare to resist against a charge constructed like so.</p><br/><p>Even more, their morale and energy were at the best state right now!</p><br/><p>The fourteen platoons were like fourteen domineering and sharp sword energies flashing by in the blink of an eye. Nan Sheng Village collapsed into pieces!</p><br/><p>———</p><br/><p>“Elder! Run!” A pale guard pulled He Xiang and quickly burrowed into the ground. There was a transportation formation in the secret room underground. Just as they burrowed into the underground room, the building on the surface broke down.</p><br/><p>The light flashed on the transportation formations and no one was left in the room.</p><br/><p>———</p><br/><p>There was no need to communicate. Everyone was high on killing.</p><br/><p>Ma Fan’s procession was extremely smart. They did not have targets, they just charged. They did not pursue the xiuzhe that escaped the first charge, they focused on furiously damaging Nan Sheng Village.</p><br/><p>In a short amount of time, Nan Sheng Village turned into ruins.</p><br/><p>They themselves were not wounded at all. Those who were leading were all those that comprehended sword essence. All the xiuzhe, when they faced this many attacks all lost their courage and escaped as far as they could!</p><br/><p>After charging a few times, everyone had to stop.</p><br/><p>“There’s no one alive,” Xie Shan said with helplessness. He had been in a rhythm, and couldn’t help but complain inside that Nan Sheng Village really didn’t have enough to kill. However, he also knew that if Nan Sheng Village wasn’t so weak, he wouldn’t have come no matter what.</p><br/><p>Ma Fan made a sound of acknowledgement. “Everyone, rest. Let’s see if there is anything we can take.”</p><br/><p>“Ha, an likes doing this!” Lei Peng grinned as he said.</p><br/><p>However, everyone’s faces were ugly as they quickly gathered together again.</p><br/><p>“Which mother***er told an the Outer Hall was rich?” Lei Peng’s face was as black as the bottom of the pot as he angrily swore, “An has never seen a place as poor as this! It’s clean! It’s so mother***ing clean! Unprofitable, so unprofitable!”</p><br/><p>The faces of the other people were not much better. They had searched all of Nan Sheng Village. Other than some still usable talismans and other things they could find on the bodies of the xiuzhe they had killed, they actually hadn’t found anything else of value.</p><br/><p>This was Nan Sheng Village, the main camp of the Outer Hall, how could it be so poor?</p><br/><p>Just at this moment, a subordinate flew over. “Daren, Daren! There’s a camp nearby in the west!”</p><br/><p>Everyone that hadn’t found everything suddenly lit up. Was the storeroom over there?</p><br/><p>They did not hesitate to fly towards the camp. As they landed, they were full of anticipation. When they saw the entire camp filled with people who had fearful expressions on their faces, and had cultivations just in lianqi, their expressions became extremely ugly again.</p><br/><p>Even Ma Fan who had personally made the plan this time didn’t know whether to laugh or cry.</p><br/><p>Xiu slaves. This entire camp was all xiu slaves! Looking out, there probably were thousands of them. All of these xiu slaves had lianqi cultivation and were not of great use. The xiuzhe that had been guarding the camp had escaped a long time ago.</p><br/><p>Ma Fan and the others had thought incorrectly. Even though He Xiang and the factions had been discussing business, but they hadn’t transported any merchandise over. What they discussed were large orders, and transactions that would be completed in intervals. As a result, other than these xiu slaves, Nan Sheng Village really didn’t have anything else.</p><br/><p>Both Ma Fan and Xie Shan were very unfamiliar with doing business, so they couldn’t ever have predicted the proceedings. They had rationally assumed that the stores of Nan Sheng Village were bursting with mountains of resources.</p><br/><p>It had to be said that the merit rewards in the camp were also connected to their service and the spoils that they had contributed each time. They looked down on what they could hand over, that could be used to trade for good things from Boss. Boss had a lot of good things in his possession. They had been envious for a long time.</p><br/><p>Who could have thought that their plan would fail?</p><br/><p>Everyone’s mood suddenly dropped to the bottom after having just achieving a victory.</p><br/><p>“How about we take these xiu slaves?” someone weakly suggested.</p><br/><p>“What do we need xiu slaves for? Also, how can we transport so many people?” someone objected.</p><br/><p>“There’s slave transportation boats here. Their speed isn’t slow and it’s convenient for transporting people,” another person quickly suggested.</p><br/><p>“If we take a few boats of xiu slaves back, and also lianqi level xiu slaves, wouldn’t we be laughed at when we get back?”</p><br/><p>“But we can’t leave them to benefit the Outer Hall. Then should we kill all of them? I won’t do it. I can’t do something like massacring xiu slaves.”</p><br/><p>Many xiuzhe nodded their heads in agreement with those words. They were all xiuzhe who had experienced many battles. All of them had blood on their hands. They felt it was normal to fight to the death. However, everyone still felt it was objectionable to massacre xiu slaves that were not able to put up any resistance.</p><br/><p>Of course, that “can’t leave them to benefit the Outer Hall” struck their hearts even more. To say nothing of having gained nothing, no one was willing to let the Outer Hall have the slaves.</p><br/><p>After such an attack, the two sides definitely had no room to negotiate. The people of the Outer Hall would hate them to their bones.</p><br/><p>“Take them, all of them!” Ma Fan gritted his teeth, “Who cares if they are useful or not? Wait until we return first.”</p><br/><p>The xiu slaves in the camp were herded onto the xiu slave boats. Everyone also stepped onto the slave transporting boats.</p><br/><p>The slave transporting boats were jingshi talismans. They were extremely large, about fifty zhang long and shaped like a turtle with no sails. They could hold more than a thousand xiu slaves. Xiu slaves were not rare. They were mostly the natives of newly discovered jie. Some of the natives were very primitive, others had already stepped upon the path to cultivation. However, they were powerless against those great xiuzhe sects and had all became xiu slaves.</p><br/><p>Many sects were enthusiastic about discovering new jie. Jingshi and ores were things they needed desperately. If they could become the jie master, they would become the literal emperor of that place. If they did not like doing so, they could sell the new jie they possessed to other sects and receive large amounts of resources.</p><br/><p>Searching for jie was a high risk and high return profession.</p><br/><p>After the natives were captured, the sect would pass some basic scriptures to them. Xiu slaves that entered lianqi could be bought and sold in the market. This kind of xiu slaves could do heavy labor like mining. Those xiu slaves who had exceptional talents would be marked with high prices to be sold to other sects to be slave soldiers.</p><br/><p>Slave soldiers would be taught more profound scriptures but, without exception, have jinzhi put into them so that they absolutely would not dare to refuse the orders of the sect. Those sects who had long histories had even longer histories of bringing up slave soldiers. They would even have special slave soldier troops.</p><br/><p>Slave transporting boats were specialized slave transporting talismans. They were extremely large and could contain large amounts of xiu slaves. The body of the boats were also extremely hard because they needed to travel between jie and pass through the turbulence of the Void. Due to that, slave transporting boats were never below fifth-grade.</p><br/><p>In terms of spoils of victory this time, their biggest one was these five slave transporting boats. The Outer Hall had transported five boats of xiu slaves. They had already sold four boatloads of slaves so there was one boatload of xiu slaves left. Naturally, Ma Fan and the others wouldn’t leave the other four boats behind. Luckily, the boats could be shrunk when they were not in use. The miniaturized slave transporting boats were about three chi large, and was very exquisite.</p><br/><p>Ma Fan and the others found it extremely puzzling that the slaves hadn’t run away on the ships. What they didn’t know was that the camp was very close to Nan Sheng Village so the Outer Hall didn’t worry at all that the xiu slaves would dare to run. The camp was usually guarded very loosely. The people who were supposed to be guarding the slaves today had coincidentally gone to Nan Sheng Village to have fun, and had not escaped the calamity.</p><br/><p>It was the first time many of the people had stepped onto a slave transporting boat. All of them were very curious and looked around. Some of the people who had experience on the boats moved of their own initiative to steer the big boat.</p><br/><p>The slave transporting boat slowly floated into the sky. Many people sighed with amazement at the fifty zhang boat.</p><br/><p>Everyone snickered and steered the ship into the distance with spirit.</p><br/><p>Translator Ramblings: Ma Fan and the others pull off their plan successfully. More background on the bigger world.</p><br/><p>For a person who asked about the meaning of Zuo Mo’s name. It is written as . The “mo” is not the same one as the mo in yaomo. Zuo is Left, unorthodox or East. It is not that rare but Mo can actually be a surname as well. By itself, mo can mean “nothing,” “do not,” or “negative.” Also, it is a modern form of a character  which means vast (as in desert), cool and indifferent. So there are many meanings but the simplest one is nothing. Zuo Mo has a surname of East or Left, and his actual name is nothing. I actually prefer it as a form of the more complex character so it means vast instead. So if we twist and do not use the common definitions, we can make it an Eastern Vastness.</p><br/>\n</div>"}