{"title": "Chapter Two Hundred and Sixty Nine – Who The Mother F***ing Are You", "id": 319, "volume": 4, "url": "http://boxnovel.org/world-of-cultivation-chapter-two-hundred-and-sixty-nine-%E2%80%93-who-the-mother-fing-are-you", "volume_title": "Volume 4", "body": "<h1>Chapter Two Hundred and Sixty Nine – Who The Mother F***ing Are You</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Two Hundred and Sixty Nine – Who The Mother F***ing Are You</p><br/><p>Zuo Mo was like a wild beast without any avenue of escape.</p><br/><p>The earth mist surrounding him was thousands of catties heavy as it flowed. His body was uncontrollably swept up in the flow of the earth mist.</p><br/><p>The female xiu stopped, raised her face covered in blood and looked at Zuo Mo who had separated a bit more from her, before continuing to move forward. Those perfect and flawless bare feet stepped on the eerie purple fire, travelling slowly through the heavy and dense earth mist.</p><br/><p>Liu Dong Hua’s face was as pale as paper.</p><br/><p>He had not expected these two people were so hardy! It was the first time he had used the second turn of the Nine Turn Sky Soil Disk. He had underestimated the expenditure of ling power. Right now, he was also had no way to backdown. His ling power was almost depleted, yet the two people were still resisting.</p><br/><p>Motherf***er, where had these two terrifying people come from?</p><br/><p>He had assumed that the female xiu was immeasurably powerful, but the hardiness of the black male surpassed his imagination. There wasn’t one disciple in his sect that could hold up under the power of the Nine Turn Sky Soil Disk’s second turn for so long! Not even Huang Zhuo Guang could do it!</p><br/><p>What kind of weirdos were these two? His heart started to become terrified.</p><br/><p>He forced himself to calm down. He knew that there was no solution other than persisting. The black male didn’t look as though he still had any capability to fight, and that female xiu, while her face was covered in blood, shouldn’t have been wounded heavily. If he took away the Nine Turn Sky Soil Disk, the two shidi wouldn’t be able to stop this strange female xiu with their abilities!</p><br/><p>The purple fire was very scary, but Liu Dong Hua guessed that it came at great expense.</p><br/><p>The two sides had entered a standoff to see who could last longer.</p><br/><p>The depletion of ling power made Liu Dong Hua feel a weakness he never felt before. His face was as pale as paper, but he knew that it was time to go all in. Viciousness flashed through his eyes. A lingdan appeared on his hand. He did not hesitate to shove it into his mouth.</p><br/><p>Ling power suddenly exploded inside his body. A smear of red floated on his white face.</p><br/><p>The expressions of the two shidi changed. With this Ling Primary Dan going down, Shixiong’s cultivation would be damaged for at least three years. Shixiong was putting his life on the line!</p><br/><p>The two stopped breathing. They hadn’t thought that a situation they were in control of would become one where they were risking their lives. But they knew the result of this would decide if the two lived or died.</p><br/><p>”Shixiong, bring us over!”</p><br/><p>The shidi that had been planning on going to Sky Water Jie after this battle ended suddenly shouted. The other shidi looked with slight puzzlement at him.</p><br/><p>”Shidi, we’ll channel ling power to Shixiong!”</p><br/><p>This shidi gritted his teeth and nodded. “Right, we’re in this together!”</p><br/><p>Liu Dong Hua rejoiced inside and hurriedly cast the spell. The light flashed, and the two appeared beside him. He didn’t have the energy to speak now. Seeing the situation, the other two shidi didn’t waste words, each person reaching out to put a palm to his back.</p><br/><p>The three cultivated the same scripture, and the attribute of their ling power was the same.</p><br/><p>Ling power flowed continuously from the arms of the two shidi into Liu Dong Hua’s body. Liu Dong Hua felt that the ling power in his body had never been so plentiful. His confidence growing, the light of the Nine Turn Sky Soil Disk brightened!</p><br/><p>———</p><br/><p>Zuo Mo was like a wild beast at the precipice, howling angrily according to his instincts. Threads of black energy suddenly appeared on his body. The brown earth mist still was as heavy and murderous as before, but these hair-thin threads of black energy did not falter against the earth mist which could grind anything.</p><br/><p>As though nothing else existed, they climbed and squiggled on Zuo Mo’s body. Immediately, they burrowed into Zuo Mo’s body and disappeared.</p><br/><p>Just now, Zuo Mo’s body had been very chaotic.</p><br/><p>Right now, there were only two colors left, red and black!</p><br/><p>A dark red alluring flame was swaying like the waists of the belly dancers. The black mist was as dark as ink and motionless. The two were clearly divided like two greedy beasts that consumed all the energy they encountered along their path.</p><br/><p>In a short amount of time, all the other powers that were roaming through Zuo Mo’s body were swept away.</p><br/><p>In the sea of consciousness, Pu Yao sat with his legs crossed. The originally white and pale face had become even more pale. Beside him, the black clouds that always shrouded the gravestone had disappeared.</p><br/><p>The black clouds and the yao fire were like two vicious beasts resting in Zuo Mo’s body as they faced off.</p><br/><p>Zuo Mo’s body calmed down. His consciousness also was slowly pulled back. Even though his body was still locked in place, but he could not feel the terrifying pressure of the earth mist any longer. Just having escaped with his life, Zuo Mo didn’t have time to sigh in relief. He quickly found the red and black forces that were facing off in his body, and almost died.</p><br/><p>He knew the dangers.</p><br/><p>The dark red flame should be Pu Yao’s power. Before, the vast sea of flame in his sea of consciousness had seemed like another world. Afterwards, it may have been that Pu Yao was wounded or for some other reason, and the sea of flame had disappeared.</p><br/><p>He also recognized the black clouds. It was the black cloud that always was around the gravestone. Compared to Pu Yao who called himself a Sky Yao, the origins of the gravestone were even more mysterious. But Pu Yao seemed to be unwilling to speak of it.</p><br/><p>The connection between the yao and the gravestone was extremely strange. They seemed to be enemies, but they were also very familiar with each other. He could never understand it.</p><br/><p>The viciousness and brutality of the two kinds of power were not disguised any longer. Just having escaped one calamity, Zuo Mo once again sank into a heart-racing situation.</p><br/><p>What Zuo Mo rejoiced about was that the two sides had not attacked each other. Without warning, the yao fire transformed into an extremely slender thread of fire that burrowed between Zuo Mo’s brows. The black cloud seemed like water pouring into sand, quickly seeping downwards. Zuo Mo could clearly see it was sinking into his bones.</p><br/><p>What were these two guys doing? Zuo Mo was somewhat angry.</p><br/><p>But before he could express his anger, the pressure came pushing back from all directions!</p><br/><p>Damn it!</p><br/><p>Zuo Mo suddenly gave a light exclamation. The pressure was still unable to be resisted, but it was not as painful as before.</p><br/><p>It seemed to be almost tolerable … …</p><br/><p>Zuo Mo quickly discovered that it was not his imagination. Had something happened again to his body? This question flashed across his mind. Before he could inspect it, he suddenly saw a figure covered in purple fire out of the corner of his eye.</p><br/><p>All of Zuo Mo’s thoughts suddenly stopped at that moment!</p><br/><p>His gaze was stunned.</p><br/><p>The female xiu was close to him, the purple fire covering her entire body as she slowly inched over. What shocked Zuo Mo was her face, the face covered entirely in fresh blood. Blood was all over her face, so he could not see anything clearly except that pair of eyes that were slightly dim.</p><br/><p>Seeing the female xiu move extremely slowly towards him like a puppet, for a strange reason, Zuo Mo suddenly had the impulse to call for her to stop.</p><br/><p>Who are you?</p><br/><p>Why?</p><br/><p>Zuo Mo looked dazedly at the female xiu. For the first time in his eyes, the purple light didn’t hold any kind of fear and darkness. Even though he didn’t understand the reason, even though there were too many mysterious, but Zuo Mo suddenly understood she didn’t have malicious aims.</p><br/><p>No. Looking at that face covered in blood, the steps as slow as a snail, she definitely did not have malicious intentions!</p><br/><p>She definitely had a certain connection to him … … maybe they knew each other before?</p><br/><p>He didn’t know, he didn’t know anything, but at this moment, a certain chord in his heart was struck.</p><br/><p>His gaze landed on the blood covered face of the female xiu, watched as the blood dripped off her chin into the earth mist and be ground into bloody mist before spreading throughout the earth mist. As he watched, for some unknown reason, anger suddenly rose in his heart!</p><br/><p>It was just a talisman!</p><br/><p>An indescribable fury suddenly filled Zuo Mo’s chest. His eyes instantly turned entirely red, and two balls of fire could be seen to be bouncing.</p><br/><p>His body could not move, the pressure made him feel helpless!</p><br/><p>Zuo Mo started to channel his ling power. The ling power filled his arms and started to circulate with astounding speed.</p><br/><p>One revolution … … two revolutions … …</p><br/><p>Ten revolutions … … eleven revolutions … …</p><br/><p>Eighteen revolutions… … nineteen revolutions … …</p><br/><p>The furiously revolving ling power had no intentions of slowing down. The anger was like a flood. A desire to destroy suddenly rose in Zuo Mo’s heart!</p><br/><p>The slowly flowing, awe-inspiring earth mist was such an eyesore to his eyes, such an object of dislike, so much so that he wanted to destroy it! Since the moment he had first opened his eyes, this was the first time he had such a strong impulse and desire to destroy something!</p><br/><p>Twenty revolutions!</p><br/><p>Twenty one revolutions!</p><br/><p>The flame in Zuo Mo’s pupils shook fiercely and were filled with craziness</p><br/><p>… … twenty three revolutions … …</p><br/><p>The skin on his arms cracked open, marks of blood crisscrossing.</p><br/><p>Twenty four revolutions!</p><br/><p>Pia pia pia!</p><br/><p>Suddenly, blood exploded forth from the glasslike arms!</p><br/><p>The flame in Zuo Mo’s eyes danced crazily like a deep sea of flame.</p><br/><p>His features twisted, the tendons bulging. Each fibre of muscle was trembling, each bone was cracking!</p><br/><p>“Get up!”</p><br/><p>Zuo Mo gritted his teeth and shouted angrily. He used all the energy in his body to push at his arms!</p><br/><p>Crack crack crack!</p><br/><p>He heard his bones crack. His eyes were all red as though he was insane.</p><br/><p>“Get up!”</p><br/><p>Blood streamed out of his fiercely trembling arms as they slowly moved upwards.</p><br/><p>The sea of flames in the deepest part of Zuo Mo’s eyes grew and filled every corner of his eyes! He was like an enraged beast, bellowing angrily, “Motherf***ing get up! Aaaaaaaaaaaah!”</p><br/><p>His arms suddenly sped up in their movement as though the restraint of the earth mist had lost effect!</p><br/><p>The glass-like arms, that were covered in bloody crisscrossing marks, rose up and slightly cocked back.</p><br/><p>Zuo Mo inhaled deeply, his fire red eyes widening as he gathered the last threads of his strength. He was like a brutal prehistoric demonic god as his arms punched out.</p><br/><p>“Motherf***ing die!”</p><br/><p>Two fists that appeared to be carved from glass left his hands! A dignified and stern face could be seen on the surface of each fist energy.</p><br/><p>Liu Dong Hua’s expression changed!</p><br/><p>The two fist energies viciously entered the earth mist, flew straight for three zhang before suddenly exploding!</p><br/><p>“Heavens!”</p><br/><p>It was like someone had shouted in a low booming voice, the sound was like muffled thunder, like the beat of a drum, that made one’s heart shake!</p><br/><p>The earth mist that had been flowing slowly suddenly started to roil. Liu Dong Hua and the other two simultaneously gave a grunt, blood flowing out of their noses and mouths, their faces pale! It was as though the three people had been struck by lightning, remaining motionless like they were made out of wood.</p><br/><p>Twenty four revolution Sky Glass Wave!</p><br/><p>The earth mist suddenly disappeared, the terrifying pressure that could not be stopped also disappeared.</p><br/><p>Starlight once again fell onto Zuo Mo’s body. The three people nearby suddenly dropped down like stumps of wood.</p><br/><p>The female xiu that was no longer constrained took a step and appeared next to Zuo Mo.</p><br/><p>All of Zuo Mo’s energy had been used up. His eyes empty, his body softened. The female xiu picked him up with one hand.</p><br/><p>The face covered with blood was blurry. Zuo Mo’s vision grew increasingly dark. He tried to open his eyes, and his mouth, his voice like that of a mosquito.</p><br/><p>“Who the mother***ing are you … …”</p><br/><p>Translator Ramblings: Lots of blood … … this is a great example of a powerful earth talisman. Yes, swords can cut you into pieces, but this earth talisman can grind you into the ground and it can be used without understanding any “essence.” Also a great example of teamwork from the Clear Sky Sect disciples. It was in vain but they still stood behind their shixiong in an admirable show of loyalty.</p><br/>\n</div>"}