{"title": "Chapter Two Hundred and Sixty Four – The Rudimentary Form", "id": 314, "volume": 4, "url": "http://boxnovel.org/world-of-cultivation-chapter-two-hundred-and-sixty-four-%E2%80%93-the-rudimentary-form", "volume_title": "Volume 4", "body": "<h1>Chapter Two Hundred and Sixty Four – The Rudimentary Form</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Two Hundred and Sixty Four – The Rudimentary Form</p><br/><p>Taking advantage of the fact that the Old Forefather was in seclusion, He Xiang concealed the matter. The other people also knew this matter had created too much of a mess. If it was revealed to the top, everyone would die so they all kept their silence. Their greatest losses this time were the five slave transporting boats. The value of the one thousand xiu slaves was very limited.</p><br/><p>They were still able to afford the compensation for five slave transporting boats.</p><br/><p>Yet, the loss that made them want to spit blood was that many of the bosses that they had finished negotiating with had died in this ambush. The agreements that they had made had become a waste of effort. These factions would enter a period of chaos, reform, and choose a new leader. This meant that their work would drag on for a longer period of time.</p><br/><p>This damned group of hooligans!</p><br/><p>If he caught them, he would definitely tear their bodies to pieces!</p><br/><p>He Xiang gritted his teeth. Thinking of the factions that were in chaos, he felt his head ache. He suddenly found that from the time he had become the Chief Elder of the Outer Hall, an unfortunate sequence of bad luck had followed him. Nothing had gone smoothly.</p><br/><p>What he needed to consider now was whether he should intervene in the internal conflict of these factions. There was not much time left for him. If he could not complete this matter before the Old Forefather came out of seclusion, he would lose all of his chances.</p><br/><p>———</p><br/><p>All of the formation battle watchtowers lit up. The warm silver lights were very beautiful in the night.</p><br/><p>Seven Sonic Lightning Walnuts were floating at the top level of each formation battle watchtower They were bobbing like they were in water. They occasionally flew around the interior of the watchtowers. The ceiling and walls of the towers continued to release silver dots of light. These mist like silver dots of light would then be absorbed by the Sonic Lightning Walnuts.</p><br/><p>Zuo Mo carefully inspected every Sonic Lightning Walnut that was being nurtured in the top level of the watchtowers. The formation battle watchtowers were carved with the [Yin Fiend Hard Lightning] formation. These dots of silver mist that looked harmless contained minuscule amounts of hard lightning. After being nurtured like this, the power of the Sonic Lightning Walnut would be even greater.</p><br/><p>The construction of the city was only half completed. The remaining half was the most difficult part.</p><br/><p>In the watchtower at the very center of the Golden Crow City, Zuo Mo started to dig down into the soil. He incinerated the evacuated soil using Golden Crow Fire. His body had entered the second maturation. The noise of this maturation process was much less noisy than compared to the first time.</p><br/><p>The improvement of second maturation was not as evident as first maturation, but he could still clearly feel the improvement of his body.</p><br/><p>[Sky Glass Wave] had improved to nineteen revolutions from eighteen revolutions. The power had increased, but there was no qualitative change.</p><br/><p>But what interested Zuo Mo was the mo matrix on his body.</p><br/><p>Jade Metal Head was a mo physique. After the second maturation, a faint mo matrix started to appear. The mo matrix started first on his chest and it was very faint. If Zuo Mo didn’t carefully inspect his body, it was likely he would have missed such a subtle change.</p><br/><p>His skin had become black and glowing. The mo matrix patterns were also black, and very faint, so they were hard to detect.</p><br/><p>Zuo Mo carefully studied them for a while and found the mo matrix that had floated out was not complete. Many places were far too faint and hard to decipher. He concluded that they must only completely appear after third maturation.</p><br/><p>He noted it down before going back to building the city.</p><br/><p>In the span of a few short days, Golden Crow City was completely revamped.</p><br/><p>The streets were abnormally clean. New buildings neatly spread out like a forest on both sides of streets. The style of these buildings were varied. There were green brick yards, brightly colored sharp pointed towers. The xiuzhe of Golden Crow City came from many different places. The only buildings that could not been seen here were the residences frequently seen in other cities to be floating in the air out of consideration for safety.</p><br/><p>The fruit trees on both sides of the street were tenderly green and heavy with fruit that gave off a tantalizing fragrance. All of the empty spaces like under the trees, and the corners of buildings were planted with flowers and grasses to make them attractive to the eyes. For these trees and grasses, all of the xiuzhe that had knowledge of ling farming had joined in. Many kinds of birds had been enticed over. Vitality flowed in every corner.</p><br/><p>Nian Lu, who dragged a group of xiuzhe back through hurrying day and night gaped at the beautiful scene in front of him and lost the ability of speech.</p><br/><p>———</p><br/><p>Bao Yi bowed to Lil’ Pagoda that was floating in front of him, his expression slightly wary, “Pagoda ye, are you hungry again?”</p><br/><p>The chubby Lil’ Pagoda tried its best to produce a proud stance, but one could not bear to look at it. Behind it, Silly Bird raised her head and pushed out her chest, her stomach tightly stretched and fat. The half-lidded eyes didn’t show any intentions of properly looking at a person. On top of Silly Bird’s head, the antenna of Lil’ Black restlessly waved as it looked around.</p><br/><p>Bao Yi didn’t dare to laugh. He didn’t dare to offend the three little ancestors in front of him.</p><br/><p>He really didn’t understand. These days, could talismans, steeds, and worms become so intelligent? The three formed a troop and would come at intervals to sweep the stores. The weirdest one was Lil’ Pagoda. It would swallow anything. Talismans, materials, all of it would go to its stomach.</p><br/><p>But Boss was very lenient with them, and had told him to give the talismans that could not be used to Lil’ Pagoda.</p><br/><p>To a miser like Bao Yi, this was akin to carving the flesh out of his heart. Even though he knew that there wasn’t much value in those talismans, but the smallest grain of rice was still food. Watching as they all landed in Lil’ Pagoda’s stomach, and not having the smallest piece of jingshi come out, his heart bled blood.</p><br/><p>Wastrel! Such a wastrel!</p><br/><p>Unconsciously, Lil’ Pagoda had become Bao Yi’s greatest enemy!</p><br/><p>Of course, he didn’t dare to show the enmity that was in his heart. Lil’ Pagoda was deeply favored by Boss. If working under Zuo Mo previously had been a decision made out of helplessness, then his heart was truly loyal now. He had never heard of a person so strong they could build a city like this by themselves, much less seen one. Right now, he seemed to understand why an expert like Xie Shan would willingly serve Boss.</p><br/><p>Look at the strong offensive abilities under Boss’ command! Oh, the God of Wealth Up High, he, Bao Yi, had never thought he could personally see such a strong and vicious troop!</p><br/><p>He didn’t believe there was anyone that had the power to pose a risk to them in Little Mountain Jie unless Clear Sky Old Forefather personally came. He admired Boss very much for this point. Boss had opened up his provisions of jingshi for his subordinates. The troop of seven hundred people used three thousand and five hundred third-grade jingshi a day. If it was converted, it would be seven pieces of fourth-grade jingshi.</p><br/><p>Seven piece of fourth-grade jingshi daily! Whoa! He had almost fainted when he had first learned this. Even in Little Mountain Jie where jingshi was not worth much at present, it still was not a low number.</p><br/><p>He felt a compelling pressure. The talismans that they had gained were not able to be sold. Now that the city was constructed, he needed to think of ways for Boss to start doing business. Otherwise, if they just fed off of their savings then in the long term, they couldn’t sustain it in the future.</p><br/><p>Just as he was wandering in his thoughts, he saw Lil’ Pagoda waving in front of him. He hurriedly refocused and suddenly found that a line of puppets had formed behind the three.</p><br/><p>Puppets!</p><br/><p>As an experienced merchant, Bao Yi had worked with all kinds of talismans, and naturally seen puppets before. Truthfully, from his angle, the construction of these copper puppets were very rough.</p><br/><p>Copper puppets were just one step above paper puppets, but still were very common mainstream items. He twisted his mouth. This kind of copper puppets couldn’t sell for a good price, even if he was the one doing it.</p><br/><p>However, it was possible to see that the person who had designed these puppets had put in a great deal of thought. These puppets were designed for mining. The bottom half of their bodies were jointed in sections like a snake. That would allow them to adjust to all kinds of uneven terrain. The top half was shaped traditionally like a person, but there were four arms instead of two.</p><br/><p>The puppets lined up neatly, each puppet carrying on its back a cloth bag that was larger than their bodies.</p><br/><p>Bao Yi lost some of his disdain. These puppets may look ugly, but they were very strong and were pretty good puppets.</p><br/><p>He watched as these puppets came in, and put down the cloth bags on their backs. Bao Yi quickly found a little mountain pile up in front of him.</p><br/><p>“This … … Pagoda ye, what is all this?” Bao Yi carefully asked.</p><br/><p>Lil’ Pagoda bent its chubby body and acted as it was talking.</p><br/><p>Bao Yi swallowed and wiped the sweat on his forehead. He asked uncertainly, “Is it to let me see?” Every time he faced Lil’ Pagoda and the other two, it was as though he was facing an enemy. He regretted not learning how to play charades when he was young.</p><br/><p>Lil’ Pagoda nodded.</p><br/><p>Bao Yi released a breath. He hadn’t guessed incorrectly. He hurriedly ran over and opened the cloth bags.</p><br/><p>The blinding light of jingshi reflected on his dumbstruck face and filled the room with light.</p><br/><p>Lil’ Pagoda ran in front of Silly Bird to ask for praise. Silly Bird used her wings to brush Lil’ Pagoda. Lil’ Pagoda instantly became happy, and hurried flying to the front to led the way. This guy was very clever. They had become familiar after coming here a few times. With Lil’ Black on top, Silly Bird walked its proud stride and floated off as she brushed past the stunned Bao Yi.</p><br/><p>———</p><br/><p>Shu Long was the highest ranked supervisor of the Guard Camp. He was an old xiu slave. Differing from the many people who had just been captured, he had already passed through five owners. This caused him to hold great authority among this group of xiu slaves.</p><br/><p>He scanned the camp. Everyone was furiously cultivating. He couldn’t help but give a satisfied expression. He was full of gratitude towards his present owner. Only xiu slaves that had passed through many owners would deeply appreciate how much the present situation was like paradise.</p><br/><p>He had actually received favor from Master to command the Guard Camp. He was full of excitement and terror. He was happy that he could help Master, but terrified that he would ruin the matter.</p><br/><p>What he hadn’t expected was that Boss didn’t get them to go work, but had them cultivate. Cultivation was very good. Even though he didn’t know much, but he knew that cultivation was value. However, he couldn’t help but worry. Master’s action was benevolent, but in the eyes of other people, he was a wastrel. Who would let xiu slaves cultivate?</p><br/><p>He had never heard of something so absurd.</p><br/><p>But since Master had ordered it, he could only do his best to help Master. Sometimes, he couldn’t help but fantasize that some experts would be produced out of the Guard Camp and serve Master. It would be worth it even if he died.</p><br/><p>Master had kept them, and allowed them to cultivate. All of Guard Camp were holding their breath. What Shu Long was most afraid of were the new slaves. New xiu slaves only had hatred in their minds. In their eyes, all xiuzhe were enemies.</p><br/><p>He had also once walked that road.</p><br/><p>“Shu Long, get them to come one by one. I need to inspect their progress.” A thought came from the necklace on his neck. His mind became alert. Cultivating was so strange. This necklace of his should probably be a talisman.</p><br/><p>“Yes!” he hurriedly responded, and rang the large drum.</p><br/><p>———</p><br/><p>In the sea of consciousness, Pu Yao interestedly played with the necklace. The little toys that Zuo Mo forged had some usefulness.</p><br/><p>Making a troop that cultivated mo, how interesting would something like that be!</p><br/><p>Translation Ramblings: Xiu slaves are worth less than their transportation boats which isn’t so strange if you think back to how much a free lianqi xiuzhe‘s wages are and how expensive talismans are. Clear Sky Sect probably just had to pay the merchant/business for the boats, not the slaves.</p><br/><p>Lil’ Pagoda is growing fat … … Bao Yi treats Lil’ Pagoda like it is a calamity. On another note,if Zuo Mo had to have a patron god, it would probably also be the god of wealth a.k.a the god of jingshi. The puppets are pretty good in design though I’m curious if it would be better in therms of stability for them to have multiple legs like an insect or to be like a snake like their present form.</p><br/>\n</div>"}