{"title": "Chapter Two Hundred and Seventy Two Huang Zhuo Guang", "id": 322, "volume": 4, "url": "http://boxnovel.org/world-of-cultivation-chapter-two-hundred-and-seventy-two-huang-zhuo-guang", "volume_title": "Volume 4", "body": "<h1>Chapter Two Hundred and Seventy Two Huang Zhuo Guang</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Two Hundred and Seventy Two Huang Zhuo Guang</p><br/><p>Clear Sky Sect had many branches and many second generation disciples, but no one could shake Huang Zhuo Guang’s position. Besides the support of Clear Sky Old Forefather, Huang Zhuo Guang’s strong individual strength was the most crucial factor.</p><br/><p>Before the change in Little Mountain Jie, Huang Zhuo Guang had been labeled the most accomplished of the younger generation in Little Mountain Jie. The name of the Clear Sky Hero had spread from that time forward.</p><br/><p>He entered ningmai at sixteen. At this age, many people had just started zhuji. At seventeen, he comprehended sword essence and quickly became the brightest name among the Little Mountain Jie younger generation. What truly pushed his fame to the peak was what happened during the calamity.</p><br/><p>At that time, the situation had been chaotic. Many people had attacked Clear Sky Sect. At that crucial time, Huang Zhuo Guang stood out, killing twenty people with his sword. The row of bloody heads were hung at the gate of Clear Sky Sect. This action instantly shocked those xiuzhe that during the chaos and allowed the sect to hold out until Clear Sky Old Forefather returned.</p><br/><p>It had to be said that half of the reason that Clear Sky Sect held its current position in Little Mountain Jie could be attributed to Huang Zhuo Guang. That battle had let his brutal reputation spread throughout Little Mountain Jie, and firmly established his position as second in the sect under the Old Forefather.</p><br/><p>Huang Zhuo Guang was brutal and domineering, but he did not lack cleverness. The other disciples were filled with respect and fear towards him.</p><br/><p>Since so many people had raised their hands, a competition was naturally required. However, what was being tested wasn’t individual power, but who had the strongest skill in water element spells. The xiuzhe that raised their hands were asked to cast a water element spell.</p><br/><p>This wasn’t a problem to Zuo Mo at all. He casted the [Little Art of Cloud and Rain], and a miniature white cloud floated one chi above his palm as it started to rain. As the drops landed on Zuo Mo’s palm, they disappeared.</p><br/><p>This pure and skilled water element spell instantly defeated the great majority.</p><br/><p>Zuo Mo was slightly surprised by Zheng Zhong.</p><br/><p>Zheng Zhong did not speak, and lightly tapped a jade card hanging on his waist. A blue water dragon instantly came out. The water dragon was about one chi long, the blue scales on its body flashing with an enchanting light. It was extremely smart, a pair of dragon eyes curiously scanning the surroundings.</p><br/><p>Hm, a beast service card!</p><br/><p>Zuo Mo was slightly shocked. He didn’t know what kind of dragon this water dragon was. Maybe Cheng Shidi would recognize it. Without a doubt, the grade of this water dragon whatever its kind would not be low. As the blue water dragon flew out, Zuo Mo instantly felt that the water element power in the air thickened.</p><br/><p>The water dragon innately belonged to water. It was most skilled in water element spells.</p><br/><p>The disciple holding the white fang sword had a dilemma. Zuo Mo might have cast a little spell, but it could be seen with a glance that his skill was not low. Zheng Zhong’s water dragon was a natural expert at control of water.</p><br/><p>“Both of you come up.” Huang Zhuo Guang’s voice sounded at this time.</p><br/><p>Zuo Mo’s heart jumped. Huang Zhuo Guang’s voice was not loud, but it held an unique kind of pressure. He could be considered to be experienced now, but it was the first time he encountered an expert of Huang Zhuo Guang’s style. The only one Zuo Mo felt was slightly similar was Chang Heng. However, there was a difference between the two. Huang Zhuo Guang was dominating, and Chang Heng was vicious.</p><br/><p>If these two people fought, that would definitely be very spectacular, Zuo Mo muttered inside.</p><br/><p>He noticed a xiuzhe with a pale complexion in the corner. That was Lei Hao, the person Lu Hui said had been wounded by Silly Bird. Lei Hao was Zuo Mo’s target.</p><br/><p>The two followed behind the disciple with the white fang sword. Huang Zhuo Guang flew down from the mountain peak, and said to the shimei beside him, “Tell them to prepare to start.”</p><br/><p>The other people were herded away from this area.</p><br/><p>“Go, go, none of your business here. In five minutes, whoever remains within fifty li cannot blame my flying sword!” a Clear Sky Sect disciple said maliciously.</p><br/><p>A change suddenly occurred!</p><br/><p>A sword light like a smear of snowy light suddenly shot towards Huang Zhuo Guang!</p><br/><p>Many Clear Sky Sect disciples paled. That sword light had been too sudden. The snowy and bright sword energy blinded them! The sharp sword essence was like countless shards of sharp snowflakes dancing.</p><br/><p>The shimei beside Huang Zhuo Guang paled. This bit of snowy and bright sword light filled every corner of her vision! Everything was white! In the blink of an eye, the sharp sword essence stole away her urge to resist.</p><br/><p>An extremely domineering sword light suddenly lit up.</p><br/><p>“Ha ha! I just knew that there was a problem with you!” Huang Zhuo Guang laughed, and then his expression became cold. “But to scheme against me, you aren’t enough.”</p><br/><p>In his tone, a strong confidence was expressed.</p><br/><p>Zheng Zhong’s fellows moved at the same time, sword energies criss-crossing. These Clear Sky Sect disciples did not have Huang Zhuo Guang’s strength and the situation instantly became chaotic.</p><br/><p>The wails and panic of the Clear Sky Sect disciples didn’t cause Huang Zhuo Guang to move away his eyes. He locked tightly onto Zheng Zhong and smirked, “Oh, so it is a third stratum. No wonder you are so gutsy.”</p><br/><p>Zheng Zhong’s eyes were not lowered and half-lidded as previous. In his calm eyes, killing and battle intent flashed.</p><br/><p>Huang Zhuo Guang smiled, “Let’s go up.” Finishing, he flew into the air.</p><br/><p>Zheng Zhong did not hesitate in following him into the sky.</p><br/><p>Zuo Mo looked right and left. No one was paying attention to him. Instantly, he didn’t know whether to laugh or cry. However, this was actually suitable for him to carry out his own affairs. He noticed Lei Hao panicking and wanting to flee.</p><br/><p>The xiuzhe that had been captured were already filled with hate towards Clear Sky Sect, but due to Clear Sky Sect’s might, no one dared to speak up. At this time, as Zheng Zhong moved, and the situation was chaotic, Liu Gui fanned the flames, deliberately shouting, “Flying sword! That flying sword! Don’t let him escape!”</p><br/><p>Once those words came out, it stirred the hearts of many people. That flying sword had such pure killing intent. It definitely was a rare top of the fourth-grade sword.</p><br/><p>“Who dares? Wanting to steal something from Clear Sky Sect! You don’t want to live!” the disciple shouted with a stern expression.</p><br/><p>Liu Hui hid among the crowd and grumbled, “The daring die from overeating, the cowards die from starvation. Who knows who!”</p><br/><p>Everyone thought. Yes, such a chaotic situation, they wouldn’t know who stole it. Which xiuzhe that had survived in Little Mountain Jie up until now was a friendly person?</p><br/><p>In a moment, dozens of sword lights howled as they shot towards that Clear Sky Sect disciple.</p><br/><p>Zuo Mo who had flown away was also scared by the scene. He celebrated that he had left early enough. Otherwise, he would have also been affected.</p><br/><p>“You … …” That disciple was both frightened and angry. Before he could finish speaking, he was chopped by tens of sword energies into pieces of meat, and froze Zuo Mo’s heart.</p><br/><p>Everyone instantly went to grab the sword. After a period of chaos, a xiuzhe with good eyes and fast hands grabbed the flying sword before turning and running for his life. The xiuzhe that didn’t get the flying swords didn’t let go of the other things on this disciple’s body.</p><br/><p>The xiuzhe that didn’t get anything quickly moved their red eyes towards the other Clear Sky Sect disciples.</p><br/><p>They suddenly found that after losing the halo of Clear Sky Sect, these disciples were the best fat sheep!</p><br/><p>The situation became even more chaotic.</p><br/><p>After a few dashes, Zuo Mo flashed next to Lei Hao and grabbed him as he was fleeing.</p><br/><p>Lei Hao was frightened half to death, his entire body shaking, his words nonsense. “I I I… … give you everything … …”</p><br/><p>Zuo Mo furrowed his brow, and raised his hand to slap him a few times to restore him to clarity. “I’ll ask and you answer.”</p><br/><p>“You … … please ask!” Lei Hao was stunned from the blows, and recovered from his soulless state. Even though he was still frightened, but he could manage to speak.</p><br/><p>Zuo Mo’s hand suddenly flashed, his left hand casting a Yang Fiendish Hard Lightning!</p><br/><p>Hiss!</p><br/><p>It directly hit a flying sword!</p><br/><p>With a burst of blue smoke, and a clanging sound, the flying sword landed on the ground.</p><br/><p>A sword xiu nearby gave a grunt. His flying sword ruined, his consciousness was also wounded. He looked in terror at Zuo Mo, and stumbled as he turn to flee, not even daring to pick up his flying sword.</p><br/><p>Zuo Mo didn’t pursue him. This scene had been seen by many people. The xiuzhe that had been charging towards Zuo Mo all turned in fright and went towards other targets. Lei Hao, who was hanging from Zuo Mo’s hand, swallowed in terror. Heavens, how had he landed in the hands of such an expert?</p><br/><p>“What is with the wounds on your body?” Zuo Mo asked word by word as he stared at Lei Hao.</p><br/><p>Lei Hao felt his hairs raise at Zuo Mo’s gaze. The pale face became even more white. He stammered, “I I … … I encountered something grey. I thought it was a treasure and wanted to catch it. But that thing was very strange. When I touched it, I was wounded.”</p><br/><p>A burst of joy came into Zuo Mo’s heart. He had just inspected the wounds inside Lei Hao’s body. His body had truly been harmed by a power not inside the five elements.</p><br/><p>“Where did the grey shadow go after?” Zuo Mo asked.</p><br/><p>“It flew into the secret realm,” Lei Hao obediently responded.</p><br/><p>“Isn’t the entrance to the secret realm closed? How could it fly in?”</p><br/><p>“I … … I don’t know.”</p><br/><p>Zuo Mo suddenly thought of how the entrance to the secret realm required five of the five element spells to open and of Silly Bird’s present attribute of not being within the five elements. That was a possibility.</p><br/><p>“Where is the entrance to the secret realm?” Zuo Mo asked a last question.</p><br/><p>“Over there.” Lei Hao pointed to a mountain valley nearby.</p><br/><p>Zuo Mo snickered at him. “You answered well.’ As he finished, he raised his hand and threw Lei Hao back into the chaotic battlefield. Instantly, the people converged on him.</p><br/><p>Zuo Mo looked at the two people fighting in the air, and regretted that the time wasn’t right. If it wasn’t that he was in a hurry to find Silly Bird, he would definitely take the chance to kill Huang Zhuo Guang. Huang Zhuo Guang was the second ranked expert of Clear Sky Sect. If he could be killed, it would greatly weaken Clear Sky Sect.</p><br/><p>He suddenly found that he had underestimated the strength of Clear Sky Sect.</p><br/><p>Huang Zhuo Guang was very powerful! Zheng Zhong had ningmai third stratum cultivation but he was at the disadvantage. This shocked Zuo Mo.</p><br/><p>Seeing Huang Zhuo Guang’s sword essence, Zuo Mo suddenly understood a bit. The “sky” in Clear Sky Sect wasn’t all to do with the Sky Soil, but with the sky itself.</p><br/><p>It was the sword of the sky!</p><br/><p>The sword essence was vast and intangible. There was clearly nothing, but it made one feel that it could not be stopped!</p><br/><p>Huang Zhuo Guang’s sword became even brighter with a hint of with sunlight like warmth. No matter if it was the sword energy or his movement, when in the air Huang Zhuo Guang was like a fish in water.</p><br/><p>Zuo Mo’s consciousness was exceptional. He had a feeling that Huang Zhuo Guang’s flying sword had a kind of unspeakable connection to the sky.</p><br/><p>He was astounded!</p><br/><p>How was it possible?</p><br/><p>Did this person start cultivating when he was inside his mother?</p><br/><p>In this moment, Zuo Mo decided to kill the other. If he missed this chance, it would almost be impossible to get a chance to kill him in the future.</p><br/><p>An evil … … no, an ingenious idea came to mind.</p><br/><p>Translator Ramblings: Ningmai at sixteen … … in comparison, Zuo Mo and Wei Sheng are all in their twenties.</p><br/><p>The reveal with the sky and its connection to Clear Sky Sect is a bit more dramatic in Chinese because the word used for sky in Clear Sky Sect is not “tian” but a less common character of “xiao” . That character also means clouds and night so the name had multiple meanings.</p><br/>\n</div>"}