{"title": "Chapter Two Hundred and Eighty Two – Fire Sickle Rock", "id": 332, "volume": 4, "url": "http://boxnovel.org/world-of-cultivation-chapter-two-hundred-and-eighty-two-%E2%80%93-fire-sickle-rock", "volume_title": "Volume 4", "body": "<h1>Chapter Two Hundred and Eighty Two – Fire Sickle Rock</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Two Hundred and Eighty Two – Fire Sickle Rock</p><br/><p>It wasn’t the first time Rong Wei came to Little Mountain Jie, but when she saw how damaged Little Mountain Jie was, she was still shocked. The house guards that came with her were also shocked.</p><br/><p>“Clear Sky Sect isn’t really a good thing. Look at Little Mountain, what have they done to it?” someone muttered.</p><br/><p>“Yes, they will be punished by the heavens!”</p><br/><p>“Is the Marquis going to move against Clear Sky Sect?”</p><br/><p>“Don’t guess randomly .. …”</p><br/><p>Listening to the mutterings of her subordinates, Rong Wei did not speak. Her mind was slightly unfocused. After a moment, she refocused. She hadn’t seen Clear Sky Old Forefather. The Marquis’ token had been presented, and they were let into Little Mountain Jie.</p><br/><p>She could clearly feel the nervous mood of Clear Sky Sect. She heard that someone had encountered something.</p><br/><p>Had something happened again in Little Mountain Jie?</p><br/><p>The incident of Stars in Daytime in Sky Moon Jie had disturbed many people at the time. She knew that the Marquis had paid special attention to the matter. Even though she had been brought up by the Marquis from childhood, she rarely saw the Marquis so concerned over a matter.</p><br/><p>The origins of the Marquis were deep and mysterious. She had never seen him attend to the major matters that occurred in Sky Moon Jie, but for the first time, she had seen a grave expression on Marquis’ face concerning the Stars in Daytime.</p><br/><p>This was the second time, and was also due to the Stars in Daytime.</p><br/><p>There were many jade scrolls and old records in the Marquis’ compound. Growing up from childhood in the compound, Rong Wei’s knowledge was much wider than the great majority of xiuzhe. She knew a bit about what Stars in Daytime meant.</p><br/><p>She felt slightly puzzled. The impression that Marquis usually gave her was that of an idle person. She couldn’t help but feel nervous that he was so concerned about such a matter.</p><br/><p>She focused, and slowly said, “Let’s go.”</p><br/><p>The compound guards instantly closed their mouths. Miss Rong was not of Marquis’s legitimate line, but in terms of favor, she was first in the compound. Also, Miss Rong had not failed the Marquis’ teachings, and was outstanding in all areas since childhood. It was just that she rarely left the compound, so her reputation was not known. The compound guards, regardless of their experience, were all respectful when they saw her, and didn’t dare to do any posturing.</p><br/><p>Rong Wei’s head started to hurt. Where should she start investigating the Stars in Daytime?</p><br/><p>———</p><br/><p>Jiang Hao looked at the most wanted list and drooled, “Big Brother, we are going to get rich now!” The other people also showed undisguised greed.</p><br/><p>Jiang Wei was also swallowing hard, but he was calmer than his younger brother. Whenever he thought of that strange and terrifying female xiu, he would sink into deep terror.</p><br/><p>“Don’t forget about that female xiu.” His voice was hoarse.</p><br/><p>The surroundings became deathly silent. Terror was imprinted on everyone’s eyes. After seeing that silent massacre, three among them had their cultivation collapse due to long-term terror. The wails before their death still seemed to echo in their ears.</p><br/><p>The flames of greed in everyone’s eyes were doused by a bucket of cold water.</p><br/><p>Jiang Hao shook. He force a smile and said, “The one that will go find them is the Outer Hall. No matter how powerful the female xiu is, she is just one person … …” His voice became increasingly light, and his face increasingly pale.</p><br/><p>“No matter how many the benefits are, we will need to live to experience them.” Jiang Wei’s eyes were bloodshot, and he said gravely, “Since the Outer Hall is searching for them, they will be able to find them. The collision between the two sides is beneficial to us. Maybe we can even leave this damned place.”</p><br/><p>“Brother, you think too highly of them,” Jiang Hao said with a forced smile.</p><br/><p>“It’s not that I think highly of them, but I hope they can do it,” Jiang Wei sighed.</p><br/><p>The other people were silent.</p><br/><p>———</p><br/><p>In Zuo Mo’s vast tunnels, the surroundings were filled with formations. His heart was excited. Finished! He finally finished!</p><br/><p>To set up such a large formation just with his power, he had enough to be proud of!</p><br/><p>Thinking it over, working day and night, only he knew how difficult it had been. Starting from when he began building Golden Crow City, he had never truly thought he could finish it. The increasingly tense situation was like an invisible whip continuously urging him to be faster!</p><br/><p>When it truly was finished, Zuo Mo felt he was in a dream.</p><br/><p>“Is this real?” he suddenly turned and asked the female xiu.</p><br/><p>The female xiu didn’t seem to hear and didn’t respond.</p><br/><p>Zuo Mo snickered and was not concerned. He muttered to himself. “Please don’t let this be a dream!”</p><br/><p>In this period of time, his consciousness had improved greatly, his skill with fire deepening with every day so that the later portion of his work had been completed quickly. With his previous skill level, it wouldn’t have been possible to complete such a vast project without using the better half of a year.</p><br/><p>Pu Yao hadn’t lied to him this time. He had improved greatly through the entire process of building the city, so much that even he was shocked. The Jade Metal Head had entered third maturation. What excited him the most was that his consciousness had grown more than three times. Right now, he felt as though he was a basin of water, with so much water that it was almost overflowing. His consciousness probably wasn’t far from a breakthrough. He also had a feeling that if his breakthrough could succeed this time, the degree of improvement would be very large.</p><br/><p>Looking at the surroundings, Zuo Mo was suddenly filled with confidence!</p><br/><p>Even if what he was facing was a jindan!</p><br/><p>Right now, there was only one thing left to do.</p><br/><p>———</p><br/><p>Zuo Mo didn’t tell anyone the work had been completed, but the first person who felt the effects was Bao Yi. The supply of Black Processing Meditation mats couldn’t keep up with demand. Bao Yi felt proud, but also frantic.</p><br/><p>Yet suddenly the production of Black Processing Meditation mat increased dramatically. He perceptively realized what had happened.</p><br/><p>Only if Boss did not require any supplies on his side, then the people of the forging division would be able to put all their effort into making Black Processing Meditation mats. Of the two most famous products of Golden Crow city, one was Golden Crow Fire, the other was Black Processing Meditation mat. Other than the batch that Bao Yi deliberately held back, the remaining Golden Crow Fire had all been sold. Only Boss could make Golden Crow Fire. Now that no one could find Boss through the day, who had the time to hope he could produce Golden Crow Fire?</p><br/><p>Golden Crow City only sold one product now, Black Processing Meditation mats.</p><br/><p>The wondrous ability of the Black Processing Meditation mat spread throughout Little Mountain Jie like it had wings. Countless xiuzhe flooded from all areas towards Golden Crow City.</p><br/><p>———</p><br/><p>In a dusky mine shaft, Lil’ Pagoda floated in the air like a dutiful supervisor as it directed those puppets to continuously work. The abnormal change had frightened the timid Lil’ Pagoda half to death. Even though Zuo Mo had not scolded it, it still expressed an attitude of fulfilling its duties well.</p><br/><p>This caused the production of jingshi and ore recently to grow dramatically. The cheer on Bao Yi’s face had grown even more.</p><br/><p>Suddenly, a copper puppet stopped what it was going, looking dazedly at the strange item in front of it.</p><br/><p>Lil’ Pagoda instantly detected the abnormality, and hurriedly flew over.</p><br/><p>It was a bright red rock that exuded a strange presence. Lil’ Pagoda tilted its head and looked with puzzlement at this piece of red rock.</p><br/><p>Zuo Mo instantly received the information Lil’ Pagoda passed over and rushed over, since Lil’ Pagoda was connected to Zuo Mo.</p><br/><p>“Hm, this rock is strange.” Zuo Mo went over and tapped it.</p><br/><p>The red rock was the size of a table and appeared like a piece of red jade, spreading threads of warmth. However, what was most unique was that it contained strong vitality. If one came close, they could make out the sound of a heartbeat.</p><br/><p>Was this something alive? Zuo Mo felt it was so fantastical. After circling the rock and thinking hard, he couldn’t think of what this red rock really was.</p><br/><p>“Pu Yao, what is this?” Zuo Mo ran over to ask Pu Yao.</p><br/><p>Pu Yao sat in front of the gravestone and resting, acting as if he was ignoring Zuo Mo.</p><br/><p>Seeing Pu Yao’s state. Zuo Mo understood that this guy was in a mood. However, he had long forgotten what he had done.</p><br/><p>A real man could bow and scrape, ge will endure.</p><br/><p>Zuo Mo piled on the smiles, “Pu Yao, you are a honored Sky Yao, what are you doing holding a grudge against a little character like me? Ge … … oh no, if this little brother has done something wrong, please have tolerance.”</p><br/><p>Pu Yao’s eyes were still closed, and there was no movement, but Zuo Mo noticed that Pu Yao’s spine had straightened slightly.</p><br/><p>It worked!</p><br/><p>“Pu Yao, you are a millennia old Sky yao! The breadth of your mind, the composure, it is as wide as the sky, as deep as the ocean, your knowledge, your … …”</p><br/><p>“Okay okay! Stop with the flattery!” Pu Yao’s expression was impatient, but the smile at the corner of his mouth revealed his pleased mood.</p><br/><p>Zuo Mo mocked him inside. As expected of a thousand year antique. He bent under just this little bit of flattery. He piled on a fawning smile, “Some guidance?”</p><br/><p>“Hm.” Pu Yao gave a light cough before slowly drawling, “It’s not embarrassing that you haven’t seen this before. There aren’t many xiuzhe that have seen it. This is Fire Sickle Rock. After absorbing the essence of moon and sun for a long time, it has born an intelligence. If nothing had changed in Little Mountain Jie, this piece of Fire Sickle Rock would just be an earthly treasure about fifth-grade.”</p><br/><p>“Then now?” Zuo Mo perceptively asked.</p><br/><p>“Presently, the ling energy of Little Mountain Jie has withered, and the power of the chaos has risen. But since this piece of Fire Sickle Rock has an intelligence, it couldn’t absorb ling power so it absorbed the power of chaos instead.”</p><br/><p>Zuo Mo didn’t understand. “Power of chaos?”</p><br/><p>“Chaos is the originator of all power. No matter if it is xiuzhe, yao or mo, power comes from chaos. But because everyone walks a different path, the result is completely different. What yaomo do is to go with the flow, while xiuzhe chose to resist. The ling power of the xiuzhe is a natural enemy to the power of chaos. “</p><br/><p>“You mean he became a yaomo?” Zuo Mo pointed at the rock and asked with shock.</p><br/><p>“Become yao.” Pu Yao was clearly smug. “There is a fire yao being nurtured here, but before it comes out, I don’t know what kind of fire yao. The intelligent souls of flora will become yao, the intelligent souls of wild beasts will become mo. If you throw ling beasts into a place like Bloody Sky Metropolis Jie, and after corrosion by the power of chaos, it will become mo.”</p><br/><p>Zuo Mo was slightly disappointed. “So it’s just a yao, then shouldn’t I kill the yaomo?”</p><br/><p>Pu Yao’s face instantly became black, “Who are you killing?”</p><br/><p>Zuo Mo shook. He remembered the guy in front of him was a Sky Yao. He smiled, “Joke, joke!” He then said, “I’m just too disappointed. I thought I dug up a treasure, and didn’t expect it was something useless.”</p><br/><p>“Who says it is useless?” Pu Yao was clearly slightly excited. “You just don’t know it! Treasure, hmph, even if it was put in front of you, you won’t recognize it.”</p><br/><p>“Then what is the use?” Zuo Mo hurriedly asked.</p><br/><p>Pu Yao closed his mouth and made a proud posture.</p><br/><p>Zuo Mo wasn’t tricked. He took out a flying sword from the ring, and moved it to the Fire Sickle Rock. “If I can’t use it, I can’t let other people have it. So let’s kill it.”</p><br/><p>Seeing the situation, Pu Yao said, “Fire yao isn’t too different than your ling beasts. You can use some of its abilities.”</p><br/><p>“Oh, so that’s it, but I don’t know how.”</p><br/><p>“Just drip blood.” Once Pu Yao finished, he knew he was tricked.</p><br/><p>As expected, Zuo Mo cheerfully turned the flying sword and swiped across his finger. He squeezed out a drop of blood onto the Fire Sickle Rock.</p><br/><p>Translator Ramblings: Zuo Mo has learned. Threats and flattery used together. Pu Yao lost this round.</p><br/><p>WanderingGummmiOfDoom pointed out that what the yao did in corrupting the ling veins creates more yao. It’s not a bad strategy if you think about it. It’s essentially colonizing the place but I’m not sure that there are that many potential fifth-grade materials lying about.</p><br/><p>Poor Jiang Wei, he has to root for the person who defeated him. I think Fang Xiang is using him as the voice of the other xiuzhe. If Jiang Wei who fought Zuo Mo before is (reluctantly) rooting for Zuo Mo, there is definitely other people out there doing the same.</p><br/>\n</div>"}