{"title": "Chapter Two Hundred and Eighty Seven – Cloud Formation Silk", "id": 337, "volume": 4, "url": "http://boxnovel.org/world-of-cultivation-chapter-two-hundred-and-eighty-seven-%E2%80%93-cloud-formation-silk", "volume_title": "Volume 4", "body": "<h1>Chapter Two Hundred and Eighty Seven – Cloud Formation Silk</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Two Hundred and Eighty Seven – Cloud Formation Silk</p><br/><p>As the army came closer, the xiuzhe on the formation battle watchtowers shifted, but quickly calmed down.</p><br/><p>The sun disappeared into the thick clouds, the sky darkened, and the air filled with the scent of death.</p><br/><p>Zuo Mo shook his head. In the end, the Eastern and Western Camps were too inexperienced. Gongsun Shidi hadn’t put his focus on these two camps. The two camps lacked greatly compared to Vermillion Bird Camp.</p><br/><p>He raised his hand and threw out the Buddha Sound Hoop.</p><br/><p>As the golden Buddha Sound Hoop flew, it rose into the sky above Golden Crow City and turned into a shining sun with numerous golden threads that dangling down tied onto the thirty six formation battle watchtowers. Upon the golden thread were countless golden rings!</p><br/><p>The Buddha Sound Hoop had been tempered by Golden Crow Fire and hard lightning. At this time, its attributes matched with Golden Crow City and the formation battle watchtower. As it rose, the scene was far more extraordinary than when he used it at Desolate Wood Reef. Zuo Mo had put much effort into the placement of the thirty six formation battle watchtowers. Other than being able to form [Skyring Moon Chime Formation] with the Buddha Sound Hoop, they could form a formation on their own.</p><br/><p>Zuo Mo was full of confidence for this battle.</p><br/><p>This confidence was not in anything else but Golden Crow City. No one knew just how much effort and thought he had put into this city that he had built with his own hands.</p><br/><p>The dignified and stern Buddha Sound Formation seemed to be chanting into one’s ear, yet almost imperceptible at moments. The terror in the hearts of the xiuzhe in the city lessened.</p><br/><p>———</p><br/><p>“What is this formation?” Shock flashed across the eyes of the large male that was watching from far away. This formation’s presence was not normal.</p><br/><p>The middle-aged person narrowed his eyes. “From what this subordinate sees, this formation should originate from [Skyring Moon Chime Formation] but its attributes are exactly the opposite. Domineering, hard and fierce, primarily for killing! This person’s formations interlock together and are very strong!”</p><br/><p>“How so?” The large male asked for guidance.</p><br/><p>The middle-aged person explained, “Daren please look. That golden hoop should be a Buddha Sound Hoop.”</p><br/><p>“Buddha Sound Hoop?” The large male had not heard of it before. “Is it powerful?”</p><br/><p>“It’s just a normal third-grade sound type talisman, but this Buddha Sound Hoop clearly has been specially tempered. If this subordinate has not guess wrong, it should have been processed in fire and lightning. This hoop has risen to fourth-grade already.”</p><br/><p>“Oh, fourth-grade.” The large male didn’t seem to care. Fourth-grade talismans were rare, but were not much to him.</p><br/><p>“This city master’s thoughts are extremely clever. The power of the [Skyring Moon Chime Formation] might be large, but setting up the formation is complex. This person used the formation battle watchtowers as the base. This way, he only needs this Buddha Sound Hoop to set up the formation at any time. Since this hoop has been process by fire and lightning, it is hard and fierce. This city can also continuously provide fire and lightning. With this formation and the formation battle watchtowers, Golden Crow City has become one body, and the power has been multiplied many times.” The middle-aged person could not disguise the admiration.</p><br/><p>At this time, the large male finally understood, anticipation growing on his face.</p><br/><p>———</p><br/><p>Listening to the Buddha sounds, Zuo Mo looked at the army that had already entered twenty li of Golden Crow City with a cold smile at the corner of his mouth.</p><br/><p>Other than jindan, no one had ever heard of ningmai xiuzhe that could attack outside of twenty li. The sword energies of ningmai sword xiu was not effective outside of three li. In other words, if the other wanted to attack Golden Crow City, it must come within three li of the city.</p><br/><p>But the attacking range of formation battle watchtowers was ten li. The hard lightning formation battle watchtowers that Zuo Mo constructed had an astounding attack range of fifteen li.</p><br/><p>Why were formation battle watchtowers still essential constructs for a city even though they were so expensive and hard to build? Because of its great power. When Zuo Mo first constructed Golden Crow City, all of his setup was for battle.</p><br/><p>He had used almost any kind of attacking move he could think of on Golden Crow City.</p><br/><p>———</p><br/><p>When He Xiang and the rest of the Outer Hall elders saw Golden Crow City from a distance, their faces were filled with amazement!</p><br/><p>“I hadn’t really expected someone built a city!”</p><br/><p>“Really hadn’t expected it!”</p><br/><p>Greed was in every elder’s eyes. When a person first saw such an exquisite and beautiful Golden Crow City, their first idea was to take it for themselves.</p><br/><p>“Only us Outer Hall has the qualifications to live in such a good place!” He Xiang said firmly. He couldn’t wait for one second.</p><br/><p>If they could take down this city, and make it the headquarters for the Outer Hall, how grand would it be. Even Old Forefather wouldn’t be able to calmly face such a city! He also heard there were piles of valuable materials and talismans inside. This was a treasure city!</p><br/><p>The other elders all gave their agreement. Each person’s eyes were heated. The struggles they had previously encountered were thrown to the back of their minds. At this moment, there was only this city in their eyes, a city of the sun!</p><br/><p>“Who is going first?” He Xiang turned and asked.</p><br/><p>The elders all closed their mouths. They were not stupid. The presence of Golden Crow City was heavy. The light coming from the large formation made all of their hearts shake slightly. In their view, it was time to harvest. If they could take down Golden Crow City, they would definitely be on the achievements list. However, if they died at this last step, it wasn’t worth it.</p><br/><p>The Buddha sounds floated from across the distance. The golden sun above Golden Crow City also reminded them to be careful.</p><br/><p>He Xiang knew these people very well. He smiled coldly inside, and said, “The first person to get into the city is the first to pick the spoils, they can pick three pieces.”</p><br/><p>The eyes of the elders instantly turned red.</p><br/><p>With great rewards, there would always be brave ones!</p><br/><p>With Golden Crow City’s wealthy, it was possible to imagine the richness of the spoils. The first to pick, and to pick three items, it would at least be three fourth-grade talismans! No one could remain unmoved by such a rich reward.</p><br/><p>“Who first?” He Xiang asked again.</p><br/><p>“Me first!”</p><br/><p>“Me first!”</p><br/><p>The elders instantly leap, their enthusiasm for battle growing. Even Second Elder who was usually at odds with Chief Elder couldn’t resist speaking.</p><br/><p>“Then we shall first trouble Second Elder!” He Xiang said without showing his emotions.</p><br/><p>Seeing Second Elder take his troops and joyfully prepare to attack, imperceptible smugness flashed across He Xiang’s eyes. He was very devious. When he saw Golden Crow City, he knew this was a tough nut to crack. He was happy to see Second Elder willing to go die.</p><br/><p>He Xiang was filled with confidence at taking down Golden Crow City. With this many people, he could just drown the other side. By that time, he was certain he would have the spare energy to plan some other affairs.</p><br/><p>———</p><br/><p>Among the elders, Second Elder’s rank in power was below He Xiang. He naturally understood what He Xiang thought. He had his own confidence of success to dare to speak up.</p><br/><p>He picked out one thousand and five hundred people in one go. Going with him were three elders.</p><br/><p>When Second Elder took out a talisman, the faces of the other elders, including He Xiang, turned uglier. A faint cloud energy was released from his hand, and swam among the xiuzhe. In moments, a faint thread of earth energy was around every one of the one thousand and five hundred people.</p><br/><p>“Cloud Formation Silk!” The middle-aged person watching from afar exclaimed, “He actually possesses Cloud Formation Silk!”</p><br/><p>“What is Cloud Formation Silk?” the large male saw the middle-aged person lose his composure and couldn’t help but ask in curiosity.</p><br/><p>“Cloud Formation Silk is a very rare talisman.” The expression of the middle-aged person was grave. “It is not of high grade, just fourth-grade. It is made by the Sky Joy Workshop in Cloud Sea Jie who harvest cloud thread to forge into a talisman. It is rare for it to end up outside. Its purpose is very unique. It can create a cloud energy that can defend.”</p><br/><p>“Like a ling shield?” the large male asked.</p><br/><p>“Approximately. This cloud energy’s defense is not as strong, but it is extremely hard to disperse. Its strength lies in that it can be used on more than one person. Look at them, all of them have a thread of cloud energy on them. The more people there are for this Cloud Formation Silk, the stronger it is!”</p><br/><p>The eyes of the large male flashed. “It really is a waste for such a good treasure like this to end up in this person’s hands.”</p><br/><p>The tone of the middle-aged person was grave. “This isn’t good for Golden Crow City!” Seeing the large male was unconcerned, he said, “The cloud energy isn’t strong, but if every person’s defense was slightly strengthened, it is very terrifying when it accumulates.”</p><br/><p>The large male thought, and instantly shook. He felt the extraordinariness of the item even more. It really was a great weapon for a large battle. He couldn’t help but say, “Is it possible to buy this Cloud Formation Silk?”</p><br/><p>The middle-aged person shook his head. “Cloud Sea Jie is too far from us.”</p><br/><p>The large male was slightly regretful.</p><br/><p>The public might not know the origins of the Cloud Formation Silk, but the ability of this talisman was easily seen. One thousand and five hundred people with this Cloud Formation Silk, the strength of the troop instantly rose up a stage.</p><br/><p>The complexions of the elders were dark. Second Elder possessed such a powerful talisman, but they had never seen it in the many battles before this. Of course, what they cared about the most was that Second Elder could possibly take down Golden Crow City in one attack.</p><br/><p>———</p><br/><p>Zuo Mo was also shocked. The other’s talisman was so strong! In large-scale battles, what was most scary were talismans like Cloud Formation Silk. However, he didn’t have much he could think of to do at this point.</p><br/><p>Fortunately his heart was strong. Even though an unexpected event had occurred, he wasn’t in a panic.</p><br/><p>———</p><br/><p>Second Elder’s face was filled with smugness. He Xiang, He Xiang, you could never have thought that I would have Cloud Formation Silk! The other elders also were overjoyed. The morale of the one thousand and five hundred xiuzhe grew greatly and they activated their ling armor.</p><br/><p>The attributes of each person’s ling armor were all different, and so their colors were naturally different. Watching from a distance, the sky was filled with a dazzling variety of colors! The faint cloud energy was not eye-catching under the light of the ling armor.</p><br/><p>“Everyone, listen well!” Second Elder spoke slowly, his voice passing out. “This is our last battle. After this battle, we will live in this city! I will reward the first person that charges in with a fourth-grade talisman!”</p><br/><p>Everyone was instantly excited. It was extremely difficult for normal xiuzhe to obtain a fourth-grade talisman! These xiuzhe’s eyes instantly turned red as they breathed heavily. They felt their blood boil, their desire for battle roiling as they wanted to attack at this exact moment!</p><br/><p>Seeing that the morale had risen, Second Elder proudly ordered, “Attack!”</p><br/><p>One thousand and five hundred xiuzhe howled and exuded killing intent as they charged at Golden Crow City!</p><br/><p>Everyone pushed their ling shield to the largest possible. Those xiuzhe that had defensive talismans took all of them out as they howled and charged at Golden Crow City!</p><br/><p>In the sky, streak after streak of five-colored light lit up. One thousand and five hundred streaks of light filled the sky. They were eye-catching as they carried killing intent and leapt crazily towards Golden Crow City.</p><br/><p>———</p><br/><p>Zuo Mo sat at the formation battle watchtowers, and did not panic at all. At this time, all of his stray thoughts were thrown to the back of his mind.</p><br/><p>In his eyes, there were only the enemies that were flying closer!</p><br/><p>Staring at the enemy, he silently calculated the distance between them. Suddenly, light flashed out of his eyes. He raised his right hand and chopped down heavily. His voice was like the roar of thunder and heard over the entire city.</p><br/><p>“Kill!”</p><br/><p>Translator Ramblings: For the person on reddit that asked about using ningmai to search for the person that started Stars in Daytime:</p><br/><p>After the first Stars in Daytime, several jindan from Bright Wave Jie were sent to look for the person responsible. That was on the order of a Jie master, who probably has authority of some kind over all the sects in that jie so lots of jindan that might follow his orders or do a favor for him. Rong Wei’s group is searching for the same “entity” that caused the second Stars in Daytime but this is on the command of this Marquis who is the leader of a faction in the neighboring jie, not a Jie master so he probably doesn’t have as many jindan to order around or he might not have jindan he can order about at all.</p><br/><p>Second, the yao troops which are sent out are “equivalent” in cultivation to ningmai but that does not mean their battle capabilities are the same. If we still use one hundred ningmai to take down a jindan as Pu Yao said it, then the yao have sent the equivalent of quite a few jindan.</p><br/><p>Rong Wei might have only been sent with compound guards but I actually think that the Marquis is not expecting her to capture the “yaomo,” but to follow it. We know that yaomo of higher cultivation cannot pass through the chaos rift easily and without a price so the yaomo might not be able to go through and so the only way out of Little Mountain Jie is Sky Water Jie, which is Rong Wei’s home. The hypothetical yaomo who is probably seriously wounded since it caused two incidents of Stars in Daytime, would have to leave Little Mountain Jie for Sky Water jie if they can’t go through the chaos rift and if they are weak enough, Rong Wei might get luck in capturing it. Otherwise, Rong Wei can just keep an lookout and track the yaomo to notify others who can prepare for its capture. There is also one more reason but I’m not going to write it here because it is a spoiler of a kind and also implied rather than stated outright.</p><br/>\n</div>"}