{"title": "Chapter Two Hundred and Ninety Seven – Hardship Guard Armor", "id": 347, "volume": 4, "url": "http://boxnovel.org/world-of-cultivation-chapter-two-hundred-and-ninety-seven-%E2%80%93-hardship-guard-armor", "volume_title": "Volume 4", "body": "<h1>Chapter Two Hundred and Ninety Seven – Hardship Guard Armor</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Two Hundred and Ninety Seven – Hardship Guard Armor</p><br/><p>“Good! Good! Good!” Clear Sky Old Forefather said the word “good” repeatedly, unrestrained killing intent spilling out around him. In the sky above Clear Sky Sect, the clouds and wind suddenly changed. The black clouds were dark like lead. All over the sect, all the disciples shook in fear.</p><br/><p>“I had never thought that the line of succession of Clear Sky would end in my hands.” Clear Sky Old Forefather looked at his palms that were smooth like those of an infant, his voice as calm as water, but the killing intent in the surroundings was becoming increasingly heavy. He raised his head, his eyes cold. “I was just in seclusion for a few months, yet so much has changed. The heavens! Even if it is the will of the heavens, they cannot stop this Old Forefather!”</p><br/><p>He stood and his eyes scanned the disciples that were standing with their heads bowed below him. “If I have still not come back in ten days, you shall all run for your lives.”</p><br/><p>When he finished, he did not wait for anyone to react before disappearing from the hall.</p><br/><p>———</p><br/><p>The atmosphere inside Golden Crow City was nervous.</p><br/><p>In the sky above Guard Camp, a black energy covered the sky and did not dissipate for days. The xiuzhe from Vermillion Bird Camp guarded the gate. Their eyes all held hints of shock. The sharp killing essence was so thick that even they did not feel comfortable.</p><br/><p>They could not understand how those weak xiuzhe slaves could become so terrifying after just a few months.</p><br/><p>Zuo Mo nervously looked at the field and the rows of camp guards lined up in rows. After returning back to Golden Crow City that day, Shu Long and the others had maintained this position motionlessly for ten days.</p><br/><p>The thick killing essence on their bodies made them look like the gods of slaughter that came from hell.</p><br/><p>The black energy around each person was restlessly moving. Shu Long’s black energy was so thick that it was not possible to see his figure or features, they were completely covered by the black energy.</p><br/><p>“Are they alright?” Zuo Mo was very worried.</p><br/><p>“If they can make it through, then they’ll be fine. If they can’t, then all that is left for them is death.” Pu Yao’s voice was unconcerned, but Zuo Mo could still heard the thread of nervousness contained inside.</p><br/><p>“All of this killing essence needs to be completely absorbed into the body?”</p><br/><p>“En, no one knows everything about the profound mysteries of essence. Mo emphasize slaughter, and their killing essence is the strongest. Their killing essence can become tangible, which is quite a coincidence. However, for them, this opportunity to make a breakthrough is slightly early. I don’t know if they can make it through.”</p><br/><p>At this time, Shu Long’s body suddenly started to tremble, the black energy that shrouded his body fiercely moving restlessly.</p><br/><p>“It has started!” Pu Yao exclaimed. Zuo Mo’s heart rose.</p><br/><p>The black energy was like slender worms that continuously burrowed into Shu Long’s body. Shu Long’s shaking increased in magnitude.</p><br/><p>“Killing essence corroding the body is the most difficult barrier.” Pu Yao stared fixedly at Shu Long and said rapidly, “Their bodies are naturally weak. If they want to keep cultivating, they must get through this gate. If that guy was still alive, this would actually be the simplest matter … …”</p><br/><p>Zuo Mo didn’t dare to move away his eyes. People were not plants, it was impossible to be emotionless upon familiarity. No matter what thoughts these xiu slaves had, he could clearly feel the trust they had in him. Every single one of them were willing to put their lives on the line for him.</p><br/><p>The battle outside Golden Crow City had proven this.</p><br/><p>It would be false to say he was not moved. No matter what, he didn’t want anything to happen to Shu Long and the others. These last few days, any materials and talismans that were necessary, no matter how expensive, as long as he had it, he unhesitatingly gave it to them.</p><br/><p>He didn’t dare to have great hopes for their breakthrough. He hadn’t cultivated for a long time, but he still understood the importance of a solid foundation in cultivation. Shu Long and the others had very shallow foundations. The possibility of a breakthrough was not high. He only hoped that nothing bad would happen to them.</p><br/><p>No matter how great of a favor he did for Shu Long and the others, they had fought using their lives for him once. Zuo Mo felt that they had repaid him. Even more, he had never felt that he had done any great favors for Shu Long and the others.</p><br/><p>Shu Long’s body shook like dice. The black energy streamed through his nostrils and his skin. The black energy around his body became faint, and his features started to gradually become clear.</p><br/><p>Zuo Mo couldn’t help but make a sound of surprise.</p><br/><p>Shu Long’s features had changed greatly. The weariness on his face had disappeared, the wrinkles had disappeared. He appeared much younger. The skin was black and shiny like they had been polished with oil.</p><br/><p>Zuo Mo was filled with wonderment. When Shu Long was young, he had been very handsome.</p><br/><p>A high nose, a knife-sharp brow, a structured face, deep-set eyes, and tightly pressed lips. The flavor of weariness had disappeared to be replaced by a feeling of deep maturity.</p><br/><p>At his forehead, there was a black crystal.</p><br/><p>Zuo Mo noticed that sometime ago, Shu Long’s outside was covered by a suit of shiny black armor. The black armor was connected with his body, tightly pressed against his body, and almost enclosing his whole body. Pia, the black heavy armor was brutally pierced through sheer pressure.</p><br/><p>Compared to the Golden Armor Guards, Shu Long’s black suit of armor was tighter, and more exquisite. It gave the feeling of stability yet was filled with strength.</p><br/><p>“Guard armor!” Pu Yao’s voice was filled with surprised joy.</p><br/><p>“What is guard armor?”</p><br/><p>“When [Hardship Guard] is cultivated to a certain level, they will create guard armor. This suit of armor has many abilities. When their cultivation deepens, they will be much stronger!” Pu Yao said excitedly, “When they break through to the next level, they could gather killing essence to form weapons. By that time, hee hee … …”</p><br/><p>Zuo Mo’s heart was filled with joy. He felt happy for Shu Long.</p><br/><p>Shu Long’s breakthrough seemed like a signal. The other camp guards successively created their guard armor.</p><br/><p>This process continued for ten whole hours. In these ten hours, Zuo Mo didn’t dare to leave for an instant.</p><br/><p>When the last camp guard finished his breakthrough, Shu Long’s tightly-closed eyes opened.</p><br/><p>The gaze was as bright as a star and as deep as a star was distant.</p><br/><p>He lowered his body in a bow, a greeting that Zuo Mo had never seen before.</p><br/><p>“In the name of the Hardship Guard, to follow Daren, never leaving or abandoning!”</p><br/><p>Shu Long’s voice was completely different than before, deep and resonant, pleasing to the ear.</p><br/><p>“In the name of the Hardship Guard, we follow daren, never leaving or abandoning!”</p><br/><p>One thousand Hardship Guards bowed at the same time.</p><br/><p>Zuo Mo was stunned.</p><br/><p>———</p><br/><p>Rong Wei hadn’t retreated far away like the other xiuzhe. She was looking from a distance on a peak. On a peak nearby there was a large male and a middle-aged person. Other than that, there were some other scattered xiuzhe, the great majority of which were ningmai third stratum xiuzhe.</p><br/><p>It was a rare chance to personally see jindan fight.</p><br/><p>This wasn’t guidance, or sparring, but a battle to the death.</p><br/><p>Up until now, no one had seen the mysterious master of Golden Crow City fight. The only offensive move would probably be activating the Skyring Moon Chime Formation. However, other than seeing that his skill in formations was extremely deep, it was not possible to see anything about his power.</p><br/><p>It would be seen in this battle.</p><br/><p>Rong Wei had other thoughts. Truthfully, she didn’t favor the master of Golden Crow City. Clear Sky Old Forefather was a person that even the Marquis was slightly wary of. His power was not so simple.</p><br/><p>Only xiuzhe that knew jindan would know how strong a jindan was. To say of nothing else, but the movement speed would leave ningmai in the dust was enough for a jindan to be undefeatable. The difference in casting spells was a difference in the nature of power.</p><br/><p>Fighting using numbers was not something that could be used against jindan. This meant that Golden Crow City was fated to only defend. It also meant that Clear Sky Old Forefather would always have the initiative.</p><br/><p>It was a terrifying matter for a jindan that had the initiative and did not lack attacking moves.</p><br/><p>Rong Wei definitely would not enter into this battle. She didn’t have any qualifications. However, if Golden Crow City was defeated, based on the Marquis’s face, she may be able to save that Moon Silver battle general. It would be too much of a pity if such a young Moon Silver battle general died here.</p><br/><p>And if she took the chance to recruit him … …</p><br/><p>That was the idea she had.</p><br/><p>She reflexively looked at the large male and the middle-aged person nearby. She detected the origins of these two would not be small. Inside, she hoped that these people did not have the same idea that she did.</p><br/><p>Otherwise, another battle of slaughter could not be avoided. Even more importantly, if the Old Forefather discovered that young person was a Silver battle general, they didn’t have to think of the matter anymore. Old Forefather would either recruit him or kill him.</p><br/><p>There was no reason to let such a talent work under someone else.</p><br/><p>This plan would only succeed if Clear Sky Old Forefather was ignorant.</p><br/><p>Suddenly, a wave rippled across the sky in the distance. A vast presence that could not be stopped covered all of Sky Star Mountain range</p><br/><p>Everyone’s expression changed. They felt their body freeze, and were shocked.</p><br/><p>He had come!</p><br/><p>The golden light of Golden Crow City suddenly brightened, countless golden energies leaping up and swimming like fish. They moved to cover the sky above Golden Crow City. Each formation battle watchtower lit up with silver lights. In a blink of an eye, all thirty six formation battle watchtowers were alight. A golden hoop rose into the sky spreading a burning golden light. Countless golden threads dangled off, and a faint Buddhist chanting could be heard.</p><br/><p>Clear Sky Old Forefather seemed to appear out of nowhere in the sky above Golden Crow City.</p><br/><p>Hair loose, he looked to be in his forties, but his skin was like that of an infant. A snowy white robe was carelessly tied on his body.</p><br/><p>He faintly glanced at the people hiding at a distance to watch the fight.</p><br/><p>Everyone felt their hearts uncontrollably jump, and were even more shocked.</p><br/><p>The authority of a jindan was fierce!</p><br/><p>“Little Miss Rong, is the Marquis well?” the Clear Sky Old Forefather faintly opened as though he was speaking of daily activities.</p><br/><p>Rong Wei could only come out. “With the good fortune of Old Forefather, Marquis is well.”</p><br/><p>“Oh, then why is Marquis trying to fight for this little jie with me?” Clear Sky Old Forefather’s voice was still faint.</p><br/><p>Rong Wei felt her breathing stop and almost fell. Her scalp pricking, she could only say, “Old Forefather is joking. With Old Forefather here, Marquis won’t disturb you. Marquis only heard that Stars in Daytime has appeared in Little Mountain Jie, and sent this servant to investigate. Before coming Marquis had especially ordered this servant to first inform Old Forefather.”</p><br/><p>“Oh, so that’s how it is,” Old Forefather nodded, “after this matter, I will go visit the Marquis. If you wish to see this battle, go back fifty more li.”</p><br/><p>The tone that Clear Sky Old Forefather spoke to her was very warm, but for some unknown reason, Rong Wei’s heart froze. She didn’t dare to hesitate, and hurriedly retreated fifty li back.</p><br/><p>“Everyone else, retreat one hundred li,” Clear Sky Old Forefather said lightly, “in ten breaths. Otherwise, don’t blame this Old Forefather for being impolite.”</p><br/><p>The atmosphere in the air was instantly as heavy as mountains.</p><br/><p>The other people were even more shocked and retreated in panic. The large male and the middle-aged person’s expressions couldn’t help but change. They exchanged a look, and retreated at the same time.</p><br/><p>No one dared to disobey a jindan.</p><br/><p>At this time, Clear Sky Old Forefather’s gaze casually turned to Golden Crow City.</p><br/><p>Translator Ramblings: The point of view switch was very abrupt for this chapter but we finally get Clear Sky Old Forefather out of his seclusion!</p><br/><p>This time, it definitely is a Lil’ Cliffy.</p><br/><p>Cultivation makes you young again! The most extreme makeoever. No need for expensive treatments no more injections, no more painful surgeries! Regain your youth in five simple steps at almost no cost at all!</p><br/>\n</div>"}