{"title": "Chapter Two Hundred and Ninety One – Hong Jun Xuan", "id": 341, "volume": 4, "url": "http://boxnovel.org/world-of-cultivation-chapter-two-hundred-and-ninety-one-%E2%80%93-hong-jun-xuan", "volume_title": "Volume 4", "body": "<h1>Chapter Two Hundred and Ninety One – Hong Jun Xuan</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Two Hundred and Ninety One – Hong Jun Xuan</p><br/><p>Dozens of xiuzhe with flying swords under their feet and their bodies flashing with light, their faces cold, landed among the Outer Sect disciples. The first among them pointed and started to scold He Xiang just as he stopped.</p><br/><p>“He Xiang! You have guts! Eldest Shixiong was killed! You dare to conceal this and not report it!”</p><br/><p>He instantly ignored He Xiang’s explanation, his face cold as he swept the other elders. “This seat is Old Forefather’s Second Disciple Hong Jun Xuan. Starting from now, this seat will be managing the Outer Hall! Anyone that disobeys will be killed!”</p><br/><p>The expressions of the other elders all changed, but no one dared to speak up. Many of them had seen Hong Jun Xuang before.</p><br/><p>“This seat will give you a chance to make up for your crimes.” Hong Jun Xuan’s eyes were filled with killing intent. He pointed at the Guard Camp outside of Golden Crow City and said darkly, “This seat will permit you to take one thousand people. If you can defeat this group of country bumpkins, I will pardon your crimes. If any of you do not dare to fight, then don’t blame this seat for being unmerciful!”</p><br/><p>The faces of the elders were ashen.</p><br/><p>They didn’t know the battle capabilities of that troop, but the killing intent was so dense their hearts trembled. They couldn’t gather up any courage when they looked.</p><br/><p>“What?” Hong Jun Xuan’s face grew even colder. “You are not willing?”</p><br/><p>The other Clear Sky Sect disciples also looked with unfriendliness. If He Xiang and the others dared to make the slightest move to rebel, they would act.</p><br/><p>He Xiang’s face was like ash. He knew that he didn’t have the chance to change anything now. Clear Sky Sect’s patience with them had reached its limited. He said difficulty, “I’m willing.”</p><br/><p>There was only one route left to him, seeking life in death.</p><br/><p>Hong Jun Xuan and the others wouldn’t give them any other route. As to escape, he never thought about it. No matter how big Little Mountain Jie was, there wasn’t another place that would take him in.</p><br/><p>Seeing He Xiang speak, the gazes of the other elders were undecided, especially the few elders with ningmai third stratum cultivation who now had thoughts of fleeing. But the Clear Sky Sect disciples had encircled them. They also knew that escape would not be so simple.</p><br/><p>They silently stood next to He Xiang.</p><br/><p>Hate flashed across the eyes of the Clear Sky Sect disciples like Hong Jun Xuan. The death of Huang Zhuo Guang was like a lightning bolt on a clear day for Clear Sky Sect. These Clear Sky Sect disciples mostly idolized Eldest Shixiong. The death of Eldest Shixiong, especially in Little Mountain Jie where they had never felt there was any danger before, was unacceptable to them.</p><br/><p>He Xiang knew explaining would not be useful. He didn’t speak and picked one thousand people.</p><br/><p>The sudden arrival of the Clear Sky Sect disciples instantly caused the battlefield that had relaxed to become tense again. Everyone’s eyes gathered on Hong Jun Xuan’s body. This made Hong Jun Xuan feel excited like he had never been before. Eldest Shixiong wasn’t here so it was now his turn.</p><br/><p>He had waited for this day for a long time.</p><br/><p>If he could take down this city, control of Little Mountain Jie would land back in the hands of the sect, his status would rise with this accomplishment and would certainly take Eldest Shixiong’s place as the new leader of the younger generation of disciples. As to He Xiang and the others, they were useless in his eyes. If it wasn’t for them, the situation of Little Mountain Jie would never have gotten to such a terrible state.</p><br/><p>———</p><br/><p>“The Clear Sky Sect disciples are like this, they really cannot be cured.” The large male shook his head, his tone filled with unspeakable dislike.</p><br/><p>“He he, those whom the heavens wish to destroy, they first make mad. Daren should not argue with them.” The middle-aged person laughed lightly.</p><br/><p>“That’s true.” The large male nodded, and then had an expression of anticipation. “That’s a good thing. This way, I can see just where this black armored troop is special.”</p><br/><p>———</p><br/><p>It wasn’t just the spectators that saw the change in the Outer Hall. Shu Long had also noticed it.</p><br/><p>His expression instantly became solemn. Glancing at Boss on the top of Golden Crow City, he conversed in a low voice with the daren in the necklace. “Daren, they seem to want to attack.”</p><br/><p>“Attack?” The voice of the daren inside the necklace instantly became excited. “Good! Very good! Kill! Kill all of them!”</p><br/><p>Shu Long jumped in fright. This daren’s killing intent was really strong. However, he didn’t take the words seriously. He examined the situation and saw there was no time to gather the spoils of victory. He instantly became slightly depressed. Boss had sent them to scalp, but it seemed that they could not finish the mission now.</p><br/><p>Shu Long was very discontent that they could not complete the first mission that Boss gave the Guard Camp.</p><br/><p>But at this moment, he knew what was more important. The other had divided out one thousand people. It definitely wasn’t to invite them to a meal. He did not hesitate and ordered for the platoons to gather.</p><br/><p>The Guard Camp that had spread out on the ground instantly gathered with Shu Long as the center. Shu Long seemed to be a great magnet to attract them to him. The heavy black armor was not a hindrance. Even though they could not fly, but each person’s movements were nimble. With a few jumps, they returned to the camp formation.</p><br/><p>Zuo Mo nodded on the inside as he sat on the lucky cloud. Shu Long was quite dependable. He didn’t speak, but had the formation battle watchtowers prepare to give aid at any time. Any troop would be useless in the end if they did not undergo real battle. Before, he had assumed that the Guard Camp wouldn’t show any results after such a short period of time. Now, he found that the progress of Guard Camp far had surpassed his imagination, and instantly felt some confidence.</p><br/><p>That short encounter just now had almost consumed all of the battle capabilities of the Eastern and Western Camps. The aid that the formation battle watchtowers could give was limited. Zuo Mo could only direct them to hurry and recover ling power.</p><br/><p>He was also very curious what powerful moves Guard Camp had.</p><br/><p>With his understanding of Pu Yao, if this guy didn’t have a grasp of the situation, he definitely wouldn’t come out to embarrass himself.</p><br/><p>Pu Yao could only ever do one thing, show off!</p><br/><p>The Guard Camp merged back with their fastest possible speed. Shu Long did not order for them to return to the city, but to prepare to welcome the enemy outside the city walls.</p><br/><p>“They have their test, and you have yours.”</p><br/><p>The words of the daren in the necklace caused Shu Long to pale in fright.</p><br/><p>“I’ve taught so much. If you worked hard, you should be able to deal with this kind of minor situation.”</p><br/><p>Pu Yao’s voice didn’t hold any emotion.</p><br/><p>“If you can’t deal with it, you don’t need to live. Your Boss might be softhearted, but if you are useless, you would only be a burden.”</p><br/><p>Shu Long wasn’t angry. He was several decades old, and had been a xiu slave for more than twenty years. What pain hadn’t he encountered, what hadn’t he seen? Daren’s words were not pleasing to hear but they were not wrong. He tightened the black armor on his body, and raised his head, determination was the only thing remaining in his eyes.</p><br/><p>If they couldn’t deal with something as minor as this, how could they face Boss?</p><br/><p>He slowly scanned around him and said in a deep voice, “This is our first battle! I know everyone has waited for this day for a long time. We cultivated with our lives, for what? For this battle! Even if we die today, we need to build up the reputation of the Guard Camp!”</p><br/><p>His voice was not loud, but every person in Guard Camp was suddenly full of passion.</p><br/><p>Zuo Mo could not hear their words. He looked with shock at the roiling black energy above Guard Camp suddenly become somewhat stronger. It became as black as ink in his eyes. Even he couldn’t help but have a strong feeling of danger.</p><br/><p>Such a powerful battle formation!</p><br/><p>Zuo Mo was stunned. An eerie purple light suddenly lit up in the eyes of the female xiu as she stared at the Guard Camp.</p><br/><p>With his Ling Eyes, he saw threads of black energy sprout out of each camp guard. As the black energy came out, it would enter the formation, and swim inside the formation. In the blink of an eye, the formation was filled with countless small threads of black energy.</p><br/><p>———</p><br/><p>“Let’s go!” He Xiang said heavily.</p><br/><p>The other elders silently took out their flying swords and activated their ling armor. Behind them, one thousand xiuzhe took out their ling armor and activated it as well.</p><br/><p>The sky was once again covered in light of various colors.</p><br/><p>Everyone’s gazes once again gathered on these two troops that were going to collide.</p><br/><p>Based on strength, the Outer Hall definitely was at an advantage. Their ling armor was far better than the heavy armor of Guard Camp in the eyes of many xiuzhe. It was the first time they had seen people use such clumsy and rough heavy armor.</p><br/><p>Based on individual power, the Outer Hall was at an even greater advantage. There were several ningmai third stratum xiuzhe among the Outer Hall elders. As for the Guard Camp? Even though the scripture they cultivated was very obscure, their individual power was average, and there was no eye-catching expert.</p><br/><p>Many people unconsciously glanced at Zuo Mo and shook their heads</p><br/><p>Hong Jun Xuan smirked icily. “Heavy armor, they still think this is thousands of years ago. They even managed to come up with something like this antique. Who told me that they are very rich? So many from the Outer Hall have been killed by this group? Trash is trash. Even if they entered our Clear Sky Sect, they would not be acceptable!”</p><br/><p>“Hee hee, that’s true! They can’t compare to Shixiong. It’s easy now that Shixiong is in command!” a shidi flattered. “Not just Golden Crow City. Even if there was a few more, Shixiong can easily conquer them!”</p><br/><p>Hong Jun Xuan was content. “When we take down this city, everyone’s service will be repaid!”</p><br/><p>“Shixiong is wise!”</p><br/><p>“We can only benefit from association from following Shixiong!”</p><br/><p>The other shidi flattered Hong Jun Xian. Hong Jun Xian’s ego was satisfied like it never had been before. He waved a hand. “Let’s see just how useful this group of trash is.”</p><br/><p>The other people’s eyes all turned to He Xiang.</p><br/><p>“Let’s kill!” He Xiang didn’t waste words, and took his sword to charge at the very front. The other elders didn’t speak either and tightly followed. The one thousand xiuzhe didn’t dare to disobey.</p><br/><p>Piercing howls sounded in the air.</p><br/><p>The light was like rain as they leapt towards the Guard Camp outside Golden Crow City!</p><br/><p>Ten li!</p><br/><p>No move. The silver flood that everyone had predicted did not appear. This made everyone feel surprised.</p><br/><p>“Maybe the power of the formation battle watchtowers have been used up?” The middle-aged person was puzzled. “Or the master of Golden Crow City has full confidence in this troop?”</p><br/><p>The large male’s face was both shocked and doubtful. Both possibilities were extremely likely, but they represented completely different meanings.</p><br/><p>He Xiang and the elders had been planning to face the rain of hard lightning, and hadn’t expected that Golden Crow City did not shoot even one bolt after flying for a while.</p><br/><p>This caused them to be overjoyed. Morale exploded!</p><br/><p>The elders that had been planning to flee instantly felt assured. The Outer Hall xiuzhe behind them instantly became confident.</p><br/><p>What they were most afraid off was the hard lightning. Now that the biggest threat was gone, the other side was just some bumpkins dressed in heavy armor. What was there to be afraid of?</p><br/><p>Yes! What was there to be afraid of?</p><br/><p>Having seen the hope of survival, He Xian’s desire for battle suddenly boiled. He shouted, “Kill! Kill! Kill!”</p><br/><p>One thousand Outer Hall xiuzhe shouted together, “Killllllllllllllllllllllllllllllll!”</p><br/><p>Seven li!</p><br/><p>Five li!</p><br/><p>Three li!</p><br/><p>———</p><br/><p>The xiuzhe that were diving down began magnifying with astounding speed in Shu Long’s vision.</p><br/><p>The mo skill ramped up to the limits, Shu Long opened his eyes. In his blood red eyes, a dash of black energy flashed past like a black knife. He suddenly shouted!</p><br/><p>“Kill!”</p><br/><p>Translator Ramblings: Yes, heavy black armor is antique, just like Pu Yao and his yin fire beads. Stuff from three thousand years ago. Cultivation civilization development might be slower, and in some stories, non-existent, but that is us humans going from the Iron Age to modern times. Actually, I’m not sure how cultivation society can develop. They have artificial intelligence in the form of weapon spirits, terraforming in the ability to reshape environments easily, near instant communication, the ability to go into space and cross galaxies … … Actually, do cultivators breathe oxygen or do they just feed off the energy of the universe?</p><br/>\n</div>"}