{"title": "Chapter Three Hundred – Sacrifice", "id": 350, "volume": 4, "url": "http://boxnovel.org/world-of-cultivation-chapter-three-hundred-%E2%80%93-sacrifice", "volume_title": "Volume 4", "body": "<h1>Chapter Three Hundred – Sacrifice</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Three Hundred – Sacrifice</p><br/><p>Zuo Mo barely managed to steady himself. It was the female xiu that reached out a hand to catch him.</p><br/><p>Blood was streaming out of his ears and nose. His face was white, the ling armor and clothes all torn to pieces. The power from the explosions of more than ten Sonic Lightning Walnuts was far outside of his imagination.</p><br/><p>Nothing was left at Clear Sky Old Forefather’s position.</p><br/><p>Thinking about that terrifying power, and the strength that could topple mountains and flip the seas, Zuo Mo’s calves shook. In a flash, he thought about the first time he had used a yin fire bead.</p><br/><p>Ge had been careless!</p><br/><p>The yin beads he had made in the past were second-grade. The Stalagmite fire was also a second-grade fire but the power of the yin fire bead forged was already great. How could the power of something forged through Sonic Lightning Walnuts and Golden Crow Fire be weak? They were all fourth-grade!</p><br/><p>The Golden Thread Lightning Walnut forged from two types of fourth-grade materials using the yin fire bead forging method was unparalleled in its power!</p><br/><p>If he had been even the slightest bit closer, he would’ve … …</p><br/><p>He felt fear but since they finally killed Clear Sky Old Forefather, he hadn’t risked his life for nothing.</p><br/><p>Suddenly, a feeling of danger came into his heart. He reflexively raised his head.</p><br/><p>An enormous shadow carrying a threatening presence dived down at astounding speed from the sky above his head!</p><br/><p>Clear Sky Old Forefather hadn’t died! Zuo Mo’s expression changed dramatically.</p><br/><p>“Go die!”</p><br/><p>A shout filled with fury and murderous intent exploded above his head.</p><br/><p>Clear Sky Old Forefather’s clothing and ling armor and completely broken apart. His hair loose, there was blood flowing out of the corner of his mouth, and his left arm had disappeared. The power of the Sonic Lightning Walnuts had almost destroyed his soul. Under such an emergency, he had used a secret technique at a cost of three-tenths of his cultivation, and had barely managed to escape.</p><br/><p>But even so, his losses were painful. His left arm had been broken and his flying sword had been destroyed. His most painful loss was the loss of three-tenths of his cultivation. This meant that his cultivation could collapse at any moment and return back to the stage of ningmai. How could he not be furious?</p><br/><p>The loss of cultivation was every xiuzhe’s greatest fear!</p><br/><p>Today, he definitely had to cut these people into pieces!</p><br/><p>There was only this one thought in Clear Sky Old Forefather’s mind. [Clear Sky Sword Scripture] was pushed to its limits.</p><br/><p>The sky above Golden Crow City seemed to solidify. In an instant, the sky seemed to become a vast piece of transparent crystal. Clouds, dust, sunlight, everything was solidified in that moment, motionless and lifeless.</p><br/><p>Sunlight could not pass through the solidified sky. It created an enormous shadow that covered all of Golden Crow City.</p><br/><p>The silent killing essence caused everyone to feel terror.</p><br/><p>Ping!</p><br/><p>The clear sound of crystal breaking. The solidified crystal-like sky suddenly became covered in a web of cracks. The cracks grew at a rapid rate as though there was an invisible hammer continuously striking this piece of crystal sky.</p><br/><p>Shu Long was stunned. The road they walked was the one of killing essence, and they were most sensitive to killing essence. At this time, they could not attend to anything else. He shouted, “Kill!”</p><br/><p>The hearts of everyone in Guard Camp shook, and they shouted simultaneously, “Kill!”</p><br/><p>The black cloud rose and turned to a black python several dozen zhang long and several zhang thick. With a hiss, it viciously leapt towards Clear Sky Old Forefather who was above Zuo Mo’s head.</p><br/><p>Clear Sky Old Forefather was not alarmed at all. With a cold laugh, he pointed with a finger!</p><br/><p>Whoosh. The crystal sky covered in cracks above his head turned to large patches of transparent fragments that spun as they turned to a sword essence twister that dove at the black python.</p><br/><p>[Clear Sky Sword Scripture – Shattering Sky]!</p><br/><p>Boom!</p><br/><p>The two enormous entities collided without finesse and created an earth-shaking sound.</p><br/><p>The pitiful Zuo Mo was thrown up again by the wave of air.</p><br/><p>Damn it!</p><br/><p>Several Sky sword essence pieces left bloody marks on his body. He disregarded the pain, and looked towards the battlefield. He couldn’t help but inhale sharply.</p><br/><p>Countless crystal-like fragments of sword essence floated in front of Clear Sky Old Forefather. He was bleeding from his mouth and nose. In the collision against the black python, he hadn’t escaped unscathed, but his gaze became even more vicious.</p><br/><p>When Zuo Mo met Clear Sky Old Forefather’s gaze, his heart instantly shook. The other was going all out!</p><br/><p>Shu Long’s figure shook, and he gave a muffled grunt, his face pale. The other camp guards staggered and collapsed as though they were drunk.</p><br/><p>Pu Yao’s anger inside the necklace could not be restrained. “Trash! You group of trash! One jindan makes all of you this sorry-looking, how can you live in the future? I, the honored Sky Yao, cannot have such trash under my command … …”</p><br/><p>A grimace came onto Shu Long’s face. They had just made a breakthrough. They needed a period of time to acclimate themselves with their bodies. Their loss this time really hadn’t come at a good time!</p><br/><p>His eyes suddenly widened, and he had a joyous expression.</p><br/><p>At some unknown time, the female xiu appeared behind Clear Sky Old Forefather, and pointed!</p><br/><p>There was a chance!</p><br/><p>Everyone had ecstatic expressions. They had all seen with their own eyes before how powerful the female xiu was. The female xiu was definitely the strongest person in all of Golden Crow City.</p><br/><p>She finally acted!</p><br/><p>For some unknown reason, Zuo Mo’s heart suddenly sank. The purple light in the female xiu’s eyes were as bright as two balls of purple fire. It was the first time he had seen the purple light in her eyes be so bright.</p><br/><p>“Hahahaha! All of you, die!”</p><br/><p>Clear Sky Old Forefather laughed madly. The shattered crystal sky above his head suddenly collapsed. Countless transparent sword essence fragments flowed down like an avalanche.</p><br/><p>Countless fragments passed through Clear Sky Old Forefather’s body in burst of blood. Clear Sky Old Forefather did not feel the pain and continued to laugh!</p><br/><p>Zuo Mo’s head rang.</p><br/><p>A suicidal attack! He wanted them to perish together!</p><br/><p>The area of the sky multiple mu large above Golden Crow City had completely collapsed. Countless, vast, and ethereal sword essence fragments with an unstoppable presence fell from the sky.</p><br/><p>Countless sword essences penetrated Clear Sky Old Forefather’s body. They turned from glowing and transparent to becoming blood stained glass!</p><br/><p>The vast and ethereal sword essence suddenly had a presence that was determined and tragic!</p><br/><p>With the sky as the sword, using the body as the guide ––</p><br/><p>–– [Blood Sky]!</p><br/><p>———</p><br/><p>Everyone’s face became pale. It was a terrifying matter if a jindan xiuhe decided to take everyone to the gates of hell with him.</p><br/><p>Watching from afar, Rong Wei’s expression changed. There was only one thought in her mind, Golden Crow City was finished!</p><br/><p>The large male and the middle-aged person changed expressions at the same time. A thought simultaneously flashed through their minds, Golden Crow city was finished!</p><br/><p>There was no difficulty for a jindan xiuzhe to use a secret technique to release an attack with all their power without regard for the consequences. As a result, fights between jindan were more cautious. If one side was pushed to the precipice, their last attack before death was extremely terrifying. Even Rong Wei and the others had never seen a jindan expert go all out.</p><br/><p>Rong Wei was stunned. She was very knowledgeable but the power of Clear Sky Old Forefather was far beyond of her predictions. Even among Sky Water Jie’s jindan, Clear Sky Old Forefather’s power would definitely rank among the top three. At this time, she suddenly understood why the Marquis was so wary of Clear Sky Old Forefather.</p><br/><p>For some reason, she sighed inside.</p><br/><p>They admired Golden Crow City for pushing a jindan to the point they had to fight using their life.</p><br/><p>It was just a pity … …</p><br/><p>The entire sky above Golden Crow City was pulled in. All of the sword essence had completely lost control!</p><br/><p>As Clear Sky Old Forefather laughed crazily, his entire person exploded into a ball of bloody mist and was completely sucked into the uncontrolled sword essences.</p><br/><p>An area fifty li in radius around Golden Crow City was completely covered. What made people feel hopeless was that any movement method would be ineffective in leaving the area covered by the sword essence. They couldn’t even escape!</p><br/><p>Unless they also were jindan and had high grade movement methods could they escape this calamity.</p><br/><p>———</p><br/><p>The sky covered everything with the blood-colored sword essence and was unavoidable!</p><br/><p>Lava flowed among the seven mountain peaks. Golden Crow City seemed to become hell!</p><br/><p>Damn it!</p><br/><p>Hopelessness floated on Zuo Mo’s face.</p><br/><p>Suddenly, his sighed darkened, and a figure appeared in front of him.</p><br/><p>It was her!</p><br/><p>The female xiu was covered in bloody marks. Blood had soaked through many parts of her clothing. That pair of perfect bare feet was even more heart-moving in the patch of blood. Some time ago, the mask on her face had been destroyed and revealed her hideous face.</p><br/><p>“You … …” Zuo Mo first stilled. When he wanted to speak, the female xiu suddenly flew over his head.</p><br/><p>Her arms were open like a big bird, her face raised, and her entire body consumed in the purple flame. She was like a moth flying towards the fire, heading straight for the blood-colored sword tide that was crashing down.</p><br/><p>The purple fire was burning so high they could not make out her figure.</p><br/><p>For an unknown reason, Zuo Mo’s chest suddenly felt extreme pain. His tears uncontrollably flooded out, large teardrops falling down his face.</p><br/><p>What was going on … …</p><br/><p>Who are you … …</p><br/><p>The tears blurred his vision, his chest was in great pain as though something was going to erupt.</p><br/><p>His ears could only hear the howls of the sword essence covering the sky above his head that had formed a flood and had an appearance of an apocalyptic disaster.</p><br/><p>Pain!</p><br/><p>Time suddenly became extremely slow. The extreme pain at his chest was so clear at this moment like a thread of flame burning constantly.</p><br/><p>Under that sword essence wave, the figure covered in the purple flame was as minuscule as dust.</p><br/><p>So painful!</p><br/><p>The pain burned every one of his nerves. He couldn’t suppress it any longer, using all of his strength to shout, “Arrrrrrrrgh!”</p><br/><p>The enormous pain was like a tide, coming in brutally and sweeping his entire body.</p><br/><p>He didn’t seem to detect that the bright red lava flowing down the mountains seemed to be pulled up by an invisible hand. In the blink of an eye, the lava wrapped around his legs. The damaged great formation on the ground suddenly lit up with a red light. The damaged formation actually managed to still activate!</p><br/><p>The golden light of Golden Crow City exploded. The lightning from the formation battle watchtowers exploded. The xiuzhe inside discovered to their shock that the formation battle watchtowers were completely out of their control!</p><br/><p>Lava, golden light, and hard lightning headed furiously towards Zuo Mo!</p><br/><p>“Ahhhhhhhhhhhhhhhh!”</p><br/><p>Zuo Mo angrily yelled. His entire body was covered in the lava, hard lightning and golden light were flashing occasionally between the lava.</p><br/><p>The abnormal change disturbed everyone!</p><br/><p>Shu Long’s expression changed. Just as he thought to move, he heard the daren inside the necklace shout, “Don’t disturb him!”</p><br/><p>He stilled and then had a joyous expression.</p><br/><p>Within the lava, Zuo Mo felt his consciousness and fleshly body had been separated. He could clearly feel the enormous pain in his body, but at this time, he was like a spectator watching over it all.</p><br/><p>He could see the five element glass bead shaking violently inside his body … …</p><br/><p>He saw the figure above his head that was completely enveloped in the purple fire.</p><br/><p>She was looking at him.</p><br/><p>At this point, Zuo Mo could see through the purple fire and the lava without any effort. He could see very clearly.</p><br/><p>He saw a pair of clear eyes filled with joyful surprise and longing.</p><br/><p>Translator Ramblings: So many lil’ cliff(ies) running around recently.</p><br/><p>For the second time, Zuo Mo makes a bomb and then screws up with it. Last time, he just defused it, this time, he gets wounded in the explosion.</p><br/>\n</div>"}