{"title": "Chapter Three Hundred and Sixty Five – Let’s Have A Discussion", "id": 365, "volume": 4, "url": "http://boxnovel.org/world-of-cultivation-chapter-three-hundred-and-sixty-five-%E2%80%93-let%E2%80%99s-have-a-discussion", "volume_title": "Volume 4", "body": "<h1>Chapter Three Hundred and Sixty Five – Let’s Have A Discussion</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Three Hundred and Sixty Five – Let’s Have A Discussion</p><br/><p>The sixth problem had been solved.</p><br/><p>The news swept through almost all the yao art houses like a strong gust of wind and was as if someone had thrown a spark into a pot of oil.</p><br/><p>Originally, the prison-breaking six problems were unexpected and unconventional, but it was not enough to cause everyone to pursue a solution. Even though the conflict between the mysterious prison-breaking yao and the Genius Alliance had been aggrandized, those with some intelligence would not put too much importance on it. The matter clearly a manipulation by someone from the shadows. Everyone watched it with the intentions of witnessing the spectacle and for amusement. No one believed the mysterious prison-breaking yao could defeat the Genius Alliance. Any normal yao would clearly arrive at this conclusion.</p><br/><p>So when Huai Boy had succeeded in activating the prison breaking battle, everyone watched but felt it was expected. Everyone had been speculating on when the Genius Alliance would break the prison. One of the Genius Alliance’s supervisors had activated the prison-breaking battle. The Genius Alliance had so many supervisors. Breaking the prison was just a matter of time.</p><br/><p>The prison-breaking six problems were novel to everyone, and showed everyone a completely different way of thinking. To be able to create something unique in the little yao arts which had been studied so thoroughly, the strength of the mysterious prison-breaking yao could not be underestimated. Some powerful great yao and famed teachers from famed yao art houses gave their praises, and were in agreement that they favored the potential of the mysterious prison-breaking yao and thought his future was limitless.</p><br/><p>Even as the prison-breaking six problems increasingly attracted the attention of more and more yao, but in the eyes of the public, this wasn’t anything.</p><br/><p>Each year, a few brilliant stars would appear and be praised by these so-called famed teachers, but the great majority would gradually grow dim and lose their standing.</p><br/><p>But just as everyone was waiting for the Genius Alliance to make a new move, everyone noticed a strange occurrence.</p><br/><p>The solution to the sixth prison-breaking problem had not been announced.</p><br/><p>One day, two days, three days … …</p><br/><p>The topic of the mysterious prison-breaking yao vs the Genius Alliance had lost its fervor and interest waned, but there was still no news of the answer to the sixth problem. It wasn’t known who first mentioned this strange situation, but it instantly attracted everyone’s attention.</p><br/><p>Was the sixth problem this difficult?</p><br/><p>Everyone had been somewhat disinterested in this matter, but their appetites were whet again.</p><br/><p>The people inside the Genius Alliance did not place much importance on this matter. They were full of confidence. Huai Boy had not successfully completed the prison-breaking, but it definitely was a good beginning. Young geniuses? The alliance did not lack geniuses.. Many supervisors were wondrously in consensus over this matter. They did not disturb the higher ranks. They firmly believed that they could solve this matter based on their individual strengths.</p><br/><p>Yet when the outside world started to discuss when the answer to the sixth problem would come out, they suddenly found to their shock, that without their notice, they had all been stuck on this problem.</p><br/><p>Now everyone was in a hurry.</p><br/><p>The branches of the Genius Alliance at each jie changed their lax attitude and quickly formed teams to work together on the problem.</p><br/><p>At last, on the ninth day, the answer to the sixth problem came out.</p><br/><p>The appetite of the outside world was very high. When the sixth problem’s answer came out, it pushed the matter of mystery prison-breaking yao vs Genius Alliance to the top again. Everyone suddenly found that it wouldn’t be so easy for the Genius Alliance to win.</p><br/><p>A battle with great power disparity naturally would not be interesting to many eyes. But when the underdog they had thought would lose in one round had endured for ten, left in a better shape than they anticipated and with a glimmer of hope, , the interest of the spectators skyrocketed.</p><br/><p>There wasn’t just one or two groups that wanted to see the Genius Alliance be left looking like fools.</p><br/><p>———</p><br/><p>“We must retaliate!” the supervisor from the Lilium Jie said excitedly. His temper was explosive to start with, and he had been very stimulated by the words from the outside.</p><br/><p>“Yes! We have to retaliate!” the other supervisors agree with excited expressions.</p><br/><p>When had these proud individuals ever endured so much mockery and disdain? They firmly believed that the Genius Alliance gathered the most outstanding geniuses of the yao. They felt very proud of themselves for being among them.</p><br/><p>“Hmph, just took us a few extra days of effort, and all the scum have come out!”</p><br/><p>“We have to make them see the reality.” Another supervisor shrugged with a helpless expression. “Even if it is a bit cruel.”</p><br/><p>“What does everyone think? We can’t just get beat up like this. When has our Genius Alliance ever lost like this?” the supervisor from the Lilium Jie said.</p><br/><p>“Ha, very simple, increase the reward!”</p><br/><p>“Yes, brave ones will come for a great reward!”</p><br/><p>The yao supervisors had a common enemy and all gave their suggestions towards a plan.</p><br/><p>“Everyone contribute a few credits. Once we have a few hundred. I don’t believe that no one in the alliance won’t take it! I will contribute ten credit points.”</p><br/><p>“I will donate twenty!”</p><br/><p>The supervisors discussed and felt that this was a good plan. Not every member of the Genius Alliance had an outstanding family to support them. The alliance did not lack members that came from those poor families. The majority of these people that entered the Genius Alliance chose to do so due to the great benefits the Genius Alliance provided. These yao cared about material gain, and not reputation. They usually did not interact with these supervisors, and could be considered to be a clearly separated group.</p><br/><p>However, these yao had a fatal weakness, credit points. The credits of the Genius Alliance were really just contribution points. They were able to exchanged all kinds of yao arts and worldly treasures for credit points from the alliance.</p><br/><p>When they encountered a troublesome problem, the supervisors instantly remembered these people that they usually looked down upon.</p><br/><p>In the corner, Huai Boy did not make a sound. His complexion was fragile, but an indiscernible cold smile floated at the corner of his mouth. These past few days, the other supervisors had been ignoring and shunning him, and he deeply felt how cold people here were. He knew the reason. Many supervisors felt discontented that of all the supervisors it was he that activated the prison-breaking battle. If he had succeeded, he would be a hero and the discontent would have been suppressed. They would have fawned over him. But he was defeated so he became the target of disdain.</p><br/><p>He suddenly felt he was slightly laughable.</p><br/><p>Why was he together with such an ungenerous and obnoxious crowd that thought highly of themselves?</p><br/><p>He silently looked on and smirked coldly inside.</p><br/><p>———</p><br/><p>The troop would advance a distance every day.</p><br/><p>If they stopped, Zuo Mo would start drinking with Wei Sheng. The alcohol wasn’t anything good, but the two were very happy when they drank. They spoke of what happened to them in these few years, reminiscing on the interesting things that happened in their sect in the past.</p><br/><p>They sighed.</p><br/><p>“Speaking of it, if it wasn’t for these incidents, we wouldn’t be who we are today.” The alcohol was going to Zuo Mo’s head. He did not use ling power to suppress the effects of the alcohol. He said with a smile, “Without the troubles and worries in the past, how could Shixiong’s sword heart be so strong? Without the dangers along this road, I don’t know in which little corner I would be in trying to pass the days. I’d probably be just farming ling fields or something.”</p><br/><p>“Right!” Wei Sheng gulped down a large mouthful of alcohol, and allowed the excess liquid to freely flow down along his neck. He suddenly said, “Shidi, what is your goal?”</p><br/><p>“Goal?” Zuo Mo stilled. He tilted his head and thought for a while. Then he counted on his fingers as he said, “First, heal A Gui, and then investigate my origins. However, this second matter cannot be forced. I don’t have too much hope. Most importantly, make more jingshi and give everyone good days so I do not fail them for choosing to accompanying me through these dangers.”</p><br/><p>“Haha!” Wei Sheng gave a booming laugh. “Apart three days, I have a different view of you! Shidi in the past was the one most afraid of trouble. You now have great goals. Good, good!”</p><br/><p>Zuo Mo’s face blushed at Wei Sheng’s words. “What great ambitions? I’m unable to get off the horse! Shixiong, don’t laugh at me!”</p><br/><p>“This is good!” Wei Sheng put down the wine pouch in his hand and said seriously, “I always felt that Shidi did not lack talent, but your personality was somewhat carefree. Now that Shidi has resolve, you naturally will have accomplishments. Even our sect cannot compare at all to the followers that Shidi has now.”</p><br/><p>“What about Shixiong? What goals do you have?” Zuo Mo asked curiously.</p><br/><p>“Me?” Wei Sheng thought for a second and suddenly gulped wine. When he put down the pouch, his expression was grave. “In this life, I pursue the pinnacle of the sword!”</p><br/><p>Wei Sheng’s words were strong and steely without any hesitation or fright!</p><br/><p>“Good!” In Zuo Mo’s sea of consciousness, Pu Yao couldn’t resist praising.</p><br/><p>Threads of admiration came into Zuo Mo’s heart. He recalled the jade scroll that Eldest Shixiong had given him that recorded the hardships that Eldest Shixiong encountered in his search for the sword. They flowed past his eyes. Of all the people he ever encountered, in terms of determination, Eldest Shixiong was undoubtedly ranked first.</p><br/><p>Only people like Eldest Shixiong were able to walk to the peak of the sword path!</p><br/><p>Zuo Mo was shocked and admiring, but when the words reached his mouth, they became “Shixiong, let’s have a discussion?”</p><br/><p>“Discussion? What matter?” Zuo Mo’s change was so sudden that Wei Sheng did not have the time to react.</p><br/><p>“Shixiong pursues the sword path, how can it work without true combat? Combat is the best way to advance!” Zuo Mo lowered his face and did not disguise his true expression. He snickered and said fawningly, “How about we go together, I’ll provide food, shelter, and jingshi! Shixiong, don’t worry, we lack for everything, but we won’t lack for fighting! We will definitely satisfy Shixiong and make it extremely fulfilling! That sword path comprehension, experience, they will rise, and be unable to be stopped even if you want it too! If you are lucky, you might get an intimate friend of the fairer sex, a sword couple in paired cultivation, and to seek the path together! Didn’t they say something like the warm home is the hero something? Oh oh oh, Shixiong is a true and honest person, and naturally will not be affected by beauty … …”</p><br/><p>Wei Sheng gaped and did not realize the alcohol was spilling on to his body.</p><br/><p>Zuo Mo continued to talk for a while until his throat was dry. He finally stopped and took a gulp of alcohol to moisten his throat before he asked Wei Sheng with a strong face, “Shixiong, your opinion?”</p><br/><p>Wei Sheng pointed at Zuo Mo and laughed. “To hope that a lazy guy like you would be serious is like hoping a sow can climb up a tree.”</p><br/><p>It seemed that he hadn’t put in enough effort!</p><br/><p>Seeing this, Zuo Mo took a large gulp of alcohol, moistened his throat and prepared to start again.</p><br/><p>A crisp voice came into Zuo Mo’s years. Zuo Mo who had been preparing his emotions and preparing to start persuading again and didn’t react in time and almost spat out the alcohol.</p><br/><p>“What?”</p><br/><p>Choked by the wine, Zuo Mo had dead fish eyes as he turned to look at Wei Sheng.</p><br/><p>Wei raised the alcohol pouch and put it in front of Zuo Mo. He smiled freely. “Yes!”</p><br/><p>Zuo Mo was overjoyed when he reacted. Raising his alcohol pouch, the two pouches collided together.</p><br/><p>That night, Zuo Mo dreamed off Shixiong as a giant that killed in all directions at the front, and he was at the back and furiously counting jingshi with a dumb smile on his face. So much jingshi, he couldn’t count it all … …</p><br/><p>Translator Ramblings: Some comedy to lighten up the mood. The problem with building up the tension is that payoffs are hard, especially if it isn’t an epic battle. It’s like going up a rollercoaster, and then when you are expecting to have a fast rush down, you find that it is flat. What to keep in mind for this story is that there is a somewhat cohesive story arc so every little arc is a little step up the climbing part of the rollercoaster and you are not at the big fall yet.</p><br/>\n</div>"}