{"title": "Chapter Three Hundred and Seventy Five – [Yao Art Cage]", "id": 375, "volume": 4, "url": "http://boxnovel.org/world-of-cultivation-chapter-three-hundred-and-seventy-five-%E2%80%93-yao-art-cage", "volume_title": "Volume 4", "body": "<h1>Chapter Three Hundred and Seventy Five – [Yao Art Cage]</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Three Hundred and Seventy Five – [Yao Art Cage]</p><br/><p>Was it … … that he was able to control the Wasteland Beast Chessboard?</p><br/><p>Ming Jue Zi’s heart beat wildly. In his eyes, the process of Xiao Mo Ge folding his legs as he sat was occurring in slow motion. He looked with disbelief at Xiao Mo Ge.</p><br/><p>He had vast knowledge, and he knew that the battle now had reached another level. It seemed that those yao that had charged towards Xiao Mo Ge were being controlled but that was not true.</p><br/><p>Another battle had just started. Xiao Mo Ge’s focused expression caused Ming Jue Zi to believe his speculation even more.</p><br/><p>It was just … … he hadn’t really expected there were people able to control a prison … …</p><br/><p>Ming Jue Zi looked dazedly at Xiao Mo Ge and his thoughts wandered. He was suddenly full of curiosity about what Xiao Mo Ge’s last move in the prison-breaking battle was. Breaking the prison did not mean controlling a prison. For example, Qian Liu Daren had set down Vast Water Clear Skies, but he was not able to control Vast Water Clear Skies, it just provided a slight advantage for him.</p><br/><p>Throughout history, successful prison breakers were mostly like Qian Liu Daren but there were exceptions. Throughout history, there had been three prison-breaker yao that could control a prison.</p><br/><p>This kind of secret information was only usually known by family with long histories. Supposedly, to control a prison, the crux was in the last attack of the prison-breaking battle. In a prison-breaking battle, the further it proceeded, the more ferocious it was. The last attack was usually the strongest and most vicious attack. The formation of the new prison had a large connection to the last attack, and the ability to control a prison was connected to the last attack as well.</p><br/><p>Of course, these were all speculations, ones that circulated in a certain group.</p><br/><p>Because it could not be proven, no one knew what the last move of the three daren in the past had been. Up until their death, they had not revealed the secret. This speculation had been formed by some concerned people from all kinds of hints and clues. Everyone had found to their shock that, through different channels, that all three daren had mentioned the last move to a certain degree. However, many people also did not believe this because these hints could not prove anything.</p><br/><p>But Ming Jue Zi believed it.</p><br/><p>Because he coincidentally knew a bit more than other people.</p><br/><p>Ming Jue Zi was not interested in the matter of Xiao Mo Ge and the Genius Alliance to start with. This matter might have made a fuss but not many of Ming Jue Zi’s peers paid much attention to it. High level yao family had their own high level groups. They were only interested in matters of their circle. Ming Jue Zi was not too interested, but just curious what the Wasteland Beast Chessboard looked like so he came to see. He had not expected to see such an amazing scene.</p><br/><p>———</p><br/><p>The one hundred and fifty zhang radius around Zuo Mo was like a grey and white territory of death. Everyone seemed to be unmoving and silent.</p><br/><p>There was a circle of yao surrounding it but no one dared to step into the area. The scene in front of them surpassed their limits. Countless recording yao arts flashed.</p><br/><p>The scenery in front of Zuo Mo changed. An enormous chessboard appeared in front of him.</p><br/><p>On this chessboard, there was only him, and his opponents that had been pulled in. However, the number of opponents was very high. All seventy one yao that had been drawn in were his opponents. In other words, he needed to fight against seventy one opponents simultaneously.</p><br/><p>There was not one thread of fear in Zuo Mo’s heart. This was his territory.</p><br/><p>Hiss hiss hiss!</p><br/><p>Countless lights suddenly flew out of the black and white chessboard and grabbed onto the yao.</p><br/><p>Wasteland Beast Chessboard!</p><br/><p>Everyone felt their vision blur and they lost sight of Zuo Mo. When they could see the surroundings clearly again, they found to their shock they were inside cages of light. The arm-thick pillars of light flashed with complex and eerie lights.</p><br/><p>[Yao Art Cage]!</p><br/><p>The match had begun.</p><br/><p>Some yao that thought highly of themselves snorted coldly and cast yao arts towards the cage. Yet no matter how they released their yao arts, the could not move the light pillars at all. Smarter yao did not move rashly and carefully examined the surroundings.</p><br/><p>There were those with power among the seventy one yao. Jin Zhen was one of them. He was from a branch family of one of the five Great Clans, the Gold Clan. He was young and smart, his power unordinary.</p><br/><p>In this length of time, there were no yao arts that attacked him. He instantly understood that the way to exit was on this light cage. He calmed his mind and inspected the pillars of light. The lights that flashed on each arm-thick pillar were different. Through the light, he was able to see layers of interwoven little yao arts. Hm, he suddenly felt they were familiar to his eyes.</p><br/><p>He suddenly recalled what the yao art lights that glowed on the pillar of light seemed like—the prison-breaking six problems!</p><br/><p>Yes, it was the prison breaking six problems!</p><br/><p>The construction of yao arts on the light pillars were the same as the prison breaking six problems.</p><br/><p>Sweat poured off Jin Zhen. He opened his mouth but could not produce a sound. How could he not be familiar with the prison-breaking six problems that had been so popular in the recent past? He was even able to recite every problem, including their answer.</p><br/><p>But when he faced yao art problems that were similar to the prison-breaking six problems, there was only hopelessness in his heart. Based on his own power, he could only solve three of the prison-breaking six problems. Even when the answer to the sixth problem had come out, it had taken him six whole days to understand.</p><br/><p>Please … … please don’t be too difficult … …</p><br/><p>Jin Zhen grabbed the last thread of hope and prayed inside. He trembled and suppressed the wild beating of his heart as he looked closely.</p><br/><p>Upon closer inspection, he almost fainted away.</p><br/><p>Little yao arts were packed together and connected with abnormally complex ways. Looking over, it made one have a big head.</p><br/><p>He really had been possessed to come running into this matter. Jin Zhen was very dispirited. He probably could not avoid being wounded this time. This was great. He needed to pay a fee for healing. It was really unprofitable!</p><br/><p>His heart suddenly moved. He definitely had not hopes of solving, but he could record what he was seeing. He might even make a sum. The more he thought, the more excited he was. He hurriedly cast a recording yao art.</p><br/><p>When the light of the recording yao art rose, he couldn’t help but laugh. It was useable! A door closed, but a window had opened. He had some ideas, and knew what was the most important. He did not spare his spiritual power and carefully recorded the yao arts on every pillar of light completely.</p><br/><p>Ha ha, this was all money!</p><br/><p>Just as he finished recording, the pillars of light lit up to a blinding degree, and suddenly were like thorns piercing his body. An excruciating pain came. With a wail, his vision darkened.</p><br/><p>Woosh woosh woosh!</p><br/><p>The yao that maintained their strange position around Zuo Mo continuously turned to balls of light and disappeared.</p><br/><p>———</p><br/><p>Ming Jue Zi knew these people definitely were thrown out of the Wasteland Beast Chessboard. Amazement flashed through his eyes. From beginning to now, Xiao Mo Ge was sitting at his original spot and had not moved at all. What was that battle which was unable to be seen like? How did so many people get defeated?</p><br/><p>He was filled with curiosity and his gaze was bright.</p><br/><p>Zuo Mo slowly opened his eyes. A smear of exhaustion flashed through his eyes. Seventy one [Yao Art Cages]. Even with the advantage of being on his home territory, this was not an easy matter for him.</p><br/><p>The entire battle did not look to be very fierce, but at many places, it was as though he was walking on wire with dangers all around. This was the first time that he used the Wasteland Beast Chessboard. Fortunately, what he encountered were not experts. Otherwise, if they entered battle, he would probably be unable to attend to all of them and could not escape defeat.</p><br/><p>If he lost, the backlash would heavily injure his consciousness. The wasteland beast was behind him as it looked down. It was like a blade on his back.</p><br/><p>Suddenly, several figures charged out of the yao crowd lightning fast towards Zuo Mo.</p><br/><p>Zuo Mo’s eyes narrowed. His heart felt grave. These people that were charging over had timed it perfectly. They were not average! His consciousness had been greatly expended in the [Match] just now, and this was the time he was most exhausted. If they gave him two breaths of time, no, even one breath, he would be able to resolve these attacks.</p><br/><p>It seemed he still was inexperienced in fighting with yao. He silently made note of the mistakes he made this time.</p><br/><p>He did not care too much about being killed and thrown out of the Wasteland Beast Chessboard. In any case, it was just wounding of his consciousness. If he could learn something from it, it was a profitable transaction because this could save his little life.</p><br/><p>So Zuo Mo was not panicked. He was even slightly curious what it would feel like to be thrown out of the Ten Finger Prison.</p><br/><p>Zzt!</p><br/><p>A sound like a copper wire being plucked sounded from behind him. A purple arrow of light flashed past Zuo Mo’s face.</p><br/><p>The purple arrows of light were so fast that people were hard pressed to dodge them. It passed through a yao moving forward at fast speed. This yao didn’t even have the time to make a wail before turning into a ball of light and disappearing.</p><br/><p>Crash, the yao at the very front suddenly tripped without any signs. Two grey green chains of mist were wrapped on his feet.</p><br/><p>This yao was of considerable power. He reacted very quickly. In the instant he fell, the light blade on his hand sliced towards the green mist chains on his feet.</p><br/><p>Pew!</p><br/><p>The tip of grey green sword suddenly came out of his chest.</p><br/><p>The sword tip dissipated into mist. His eyes were full of disbelief as he turned to a ball of light and disappeared.</p><br/><p>Zzt zzt zzt!</p><br/><p>The sound of a copper wire being plucked continued. A vine bow had appeared in Nan Yue’s hands at some unknown time. Every time the bow was stretched, a purple light would flash and a vine arrow would be on the string.</p><br/><p>Cang Ze’s appearance had changed greatly at this time. His hair was grey green and waved like water grass at a strange rhythm. His eyes were covered in a layer of faint green mist. His body was shaking like dice. Every time he shook, ripples that were hard to discern would spread, and an icily murderous energy spread.</p><br/><p>The spectators all changed expression.</p><br/><p>“High level yao arts!” Ming Jue Zi was unable to control himself any longer and exclaimed.</p><br/><p>Nan Yue had coincidentally woken up from her meditation. Seeing Zuo Mo was being attacked, she did not hesitate in attacking. What she used was the [South Sky Arrow Art] that she had learned. Today was the first time she had cultivated it, but [South Sky Arrow Art] was truly the inherited yao art of the South Sky Wisteria Clan. Nan Yue learned it with ease. There was none of the difficulty she encountered with normal yao arts. At many places, it seemed like instinct.</p><br/><p>She was in a hurry to support Zuo Mo. There was no other thought in her heart, and she gradually entered the perfect state.</p><br/><p>Cang Ze had woken up a bit earlier than Nan Yue. He had not cultivated [Grey Scar Art] to the point he forgot his surroundings like Nan Yue did. It was the opposite. He had a sense of everything that was happening outside. Seeing Daren protecting them, he felt grateful. Even though he knew that this would offend people, he did not hesitate.</p><br/><p>[South Sky Arrow Art]! [Grey Scar Art]!</p><br/><p>Two sets of yao arts that had once dominated, and been lost through time. They were like a sword that had the dust brushed off, the sharp edges appeared in front of the world again.</p><br/><p>Just like the glory of three thousand years ago!</p><br/><p>Translator Ramblings: Someone asked why Zuo Mo’s Chessboard was activated so soon when Qian Liu’s prison took three hundred years. I think it might have been that a prison break had not been defeated in three hundred, not that no prison-breaking battle occurred where the challenger failed. Also, it seems that the Chessboard’s prison-breaking battle increases drastically in difficulty as it progresses. While the Wasteland Beast Sacrificial Art is essentially a sky-level art (since it came from a sky yao) and that is what Zuo Mo used to defeat the prison, he started out the challenge with little yao arts which are very basic. Therefore, the activation point is lower than in the previous prison. Another factor is that Huai Boy is very talented in his own right and Genius Alliance has gathered a lot of really smart and powerful people so it isn’t a leap for him to activate the prison.</p><br/><p>The chessboard refers to the black and white tiles that take their color from the millstones in Zuo Mo’s technique. It is a very shallow name.</p><br/>\n</div>"}