{"title": "Chapter Three Hundred and Eighty Two – Midday Blade Strike", "id": 382, "volume": 4, "url": "http://boxnovel.org/world-of-cultivation-chapter-three-hundred-and-eighty-two-%E2%80%93-midday-blade-strike", "volume_title": "Volume 4", "body": "<h1>Chapter Three Hundred and Eighty Two – Midday Blade Strike</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Three Hundred and Eighty Two – Midday Blade Strike</p><br/><p>The temperature of the prison battlefield suddenly rose. The blackness of the void became dark red. Invisible waves of heat came from all directions, and twisted everything in view. Qinghua Xue felt as though she was wading through molten lava and was going to burn at any moment.</p><br/><p>The blue flower held in her hands was like a candle flickering in the wind, likely to be extinguished at any moment.</p><br/><p>Xiao Mo Ge was covered in flame on the other side was like a twisting ball of flame she could not clearly see.</p><br/><p>What was most terrifying was that her consciousness was unable to find Xiao Mo Ge!</p><br/><p>Qinghua Xue was shocked and couldn’t help but panic.</p><br/><p>The sky full of blue flowers showed signs of becoming uncontrolled. The connection between her and them became increasingly weak. Pia pia pia! The sounds that were so weak they were almost indiscernible landed in her ears but were akin to lightning on a clear day. Seven blue flowers cut off their connection to her consciousness!</p><br/><p>Her complexion suddenly became white!</p><br/><p>From the day she first cultivated [Blue Flower], these beautiful blue flowers were like her closest friends, and were connected with her in her mind. She played with them, told them her innermost thoughts. She had never encountered any problems on the complex yao arts recorded on [Blue Flower] because her friends would help her.</p><br/><p>It was the first time that she had encountered the blue flowers cutting their connections to her.</p><br/><p>Why was it like this?</p><br/><p>Qinghua Xue had a bewildered expression. She did not know what to do about this sudden change.</p><br/><p>Amidst her bewildered eyes, that strange straight blade that was shrouded in the fiery flame sliced from top to bottom!</p><br/><p>This blow was unusually slow, so slow that Qinghua Xue could see it clearly.</p><br/><p>When the strange blade started to move downwards, the surrounding flame seemed to have been pushed by an invisible power and quickly left the blade. It broke into countless tiny flames that shot off towards the sides. Qinghua Xue seemed to have a feeling that this blade had sliced a ball of flame into a rain of fire.</p><br/><p>The entire space seemed to be ignited in this moment.</p><br/><p>The bright flame spread through the entire space like a snowstorm of the winter. It was so hot that waves of heat which could melt steel rose and lifted up a sky full of fiery rain. The sky suddenly became bright, wind and fire joining together. The power of the fiery rain expanded.</p><br/><p>The wind and fire twisted and engulfed the blue flowers. The strange and cryptic blue flowers disappeared in the air like bubbles popping.</p><br/><p>With the destruction of each blue flower, Qinghua Xue’s face became a fraction paler. She wavered.</p><br/><p>Poof.</p><br/><p>When the last blue flower was destroyed, Qinghua Xue’s face was as pale as paper. The light inside the amber eyes disappeared. Everything in her vision quickly became blurry.</p><br/><p>At this moment, a deep voice could be heard through the roaring of flame and wind.</p><br/><p>“Midday Blade Strike!”</p><br/><p>———</p><br/><p>The yao and the mo that were fighting fiercely suddenly separated and stopped. They raised their heads at the same time to look at the void above their head.</p><br/><p>Pu Yao’s expression was uncertain. The female warrior had a joyous expression.</p><br/><p>Pu Yao suddenly spoke, “Your entire life was ruined by that suit of armor, are you going to ruin him as well?”</p><br/><p>The joy on the female warrior’s face stilled, and gradually dissipated. She seemed to think of something. Pain floated on her face. She held the enormous claw and stood woodenly. The expression on her face continued to change, sometimes joyful, sometimes painful.</p><br/><p>Pu Yao did not speak, and only looked silently at her.</p><br/><p>———</p><br/><p>Hot! So hot!</p><br/><p>Zuo Mo felt as though his entire body was burning. His blood, flesh, and bones were like dry timber that were being furiously swallowed by a crimson flame. His eyes were completely red, the colour of red-hot steel!</p><br/><p>He did not know that a clear flame had appeared above his head. This clear flame was silent, but the outer flame had faint rainbow patterns.</p><br/><p>This flame quickly spread along Zuo Mo’s body.</p><br/><p>The moment the flame appeared out of Zuo Mo’s body, the wooden A Gui suddenly raised her head, and a deep purple light lit up in the deepest part of the dull and unfocused eyes. Lil’ Fire who had been sleeping in her arms seemed to smell something delicious and woke up from its dreams.</p><br/><p>———</p><br/><p>“I had originally thought Daren was dead,” Pu Yao stared at the female warrior and slowly spoke.</p><br/><p>“To swear my oath! To abide by my ceremony!” An extremely scornful expression came onto Pu Yao’s face. “Something so inflexible and trite, it is a miracle that it managed to pass down!”</p><br/><p>The female warrior stood silently.</p><br/><p>“It was this thing!” Pu Yao’s voice suddenly became high and filled with fury. “It ruined Daren’s entire life! Ruined the entire corps. Everyone was originally able to survive!”</p><br/><p>The female warrior bit her lips, her black eyes filled with pain.</p><br/><p>“Daren said right before death that she wanted me to guard it, so it will not land in the hands of xiuzhe.” Pu Yao’s tone was low. “I consented. I stood guard for three thousand years, it did not land in the hands of xiuzhe. I hated it, wanted to destroy it. I once thought the day that I managed to escape, I will throw this damned thing into the rivers of hell.”</p><br/><p>“The time in the Yao Subduing Tower was really arduous to get through.” Pu Yao had a reminiscing expression. “If I had not promised Daren, I would not have made it through. I could not destroy it, so I had to endure. Being punished by lightning daily was nothing, what is most terrifying is to have no one to talk to, so I started to talk to it. Later, I did not hate it anymore. It is a inflexible idiot. There is no meaning in hating an idiot.”</p><br/><p>“However, Daren,” Pu Yao suddenly lifted his head and stared directly at the female warrior, “are you going to ruin Zuo Mo as well.”</p><br/><p>The female warrior was silent.</p><br/><p>“He is my student,” Pu Yao said calmly. The black robe on his body seemed to flap in the wind, his black hair like countless snakes dancing. In the dark red bloody eye, the eerie red light slowly started to spin. His tone was as calm as usual. “To follow Daren in the past, I did not complete my Teacher’s final wish. Daren, instead I fulfilled my promise to you. I cannot finish Teacher’s last wish, but I cannot let Teacher’s line of succession break in my hands. Zuo Mo is my student. Daren, if you are going to put this ball and chain on my student’s body, please do so after stepping over my corpse.”</p><br/><p>The cold voice landed in the sea of consciousness. Black flames came out of the ground and turned to curving snakes of fire that gathered from all directions below Pu Yao’s feet.</p><br/><p>———</p><br/><p>Ming Jue Zi suddenly raised his head, his pupils shrinking. He stared at the prison battlefield. Beside him, Su Wei’s expression changed as well.</p><br/><p>Covered in the formation, the prison battlefield lit up with a dark red light. This patch of red light was massive and almost covered the entire prison battlefield. Ming Jue Zi and Su Wei exchanged a lot, and found shock in each other’s eyes.</p><br/><p>“Such powerful fire yao arts!” Su Wei was frazzled.</p><br/><p>Due to the formations outside the prison battlefield, the presence that leaked out was not strong. However, the pure fire contained in this thread of presence made every spectator change their expression.</p><br/><p>“Fire yao art … …” Ming Jue Zi murmured soullessly. His expression was very strange, his eyes shocked and puzzled. He paid far more attention to Xiao Mo Ge than Su Wei did, and knew much more information than Su Wei.</p><br/><p>The strange Wasteland Beast Chessboard, the strange yao art problems, the strange yao art cages, adding on fire yao arts now … …</p><br/><p>How many yao arts did Xiao Mo Ge really know?</p><br/><p>He was so young, how had he cultivated?</p><br/><p>Everything that Ming Jue Zi thought was common knowledge seemed to be completely upended by this mystery person.</p><br/><p>Who was he?</p><br/><p>———</p><br/><p>Yu Zi Zhou raised his head to look at the sky filled with red light in the prison battlefield. His expression became serious. He had regretted being late and to not have been the first to challenge Xiao Mo Ge. Before today, Xiao Mo Ge was just a dancing clown in his eyes. If it was not for Miss Ji Li Yu, he definitely would not waste time on such a minor character.</p><br/><p>But such powerful yao fire arts!</p><br/><p>He had just finished registering with Hong and was at the edge of the prison battlefield. The pure fire yao art presence spilling out of the prison battlefield shocked him.</p><br/><p>“Hong, send one in.”</p><br/><p>A deep voice came from inside the prison battlefield. The speaker seemed to be suppressing something.</p><br/><p>“Alright, Daren.” Hong seemed to wake up from a dream, turning to Yu Ji Zhou and saying, “Mister, you may enter.”</p><br/><p>Yu Zi focused his attention. He did not dare to slack off, his consciousness at full power as he stepped forward with a grave expression.</p><br/><p>The scenery in front of him changed.</p><br/><p>The surroundings were bright red as though he was submerged in molten metal. Invisible heat waves blew against him. His expression changed. Such strong fire yao art! He had to channel his powers to withstand these terrifying heat waves. His expression became even more grave.</p><br/><p>As one of the Jade Clan, he was not afraid of fire. However, he was forced to use his powers to just stay here up so he recognized how powerful it was.</p><br/><p>———</p><br/><p>Zuo Mo stared with blood red eyes at Yu Zi Zhou in front of him. His entire body was inside a golden flame. The pain of burning tore at his nerves.</p><br/><p>He could clearly feel the pure flame slowly permeating his consciousness. His consciousness seemed to shun these flames. Yet the golden flames were domineering and forcibly permeated his consciousness thread by thread.</p><br/><p>What was this thing?</p><br/><p>He gritted his teeth and bore the pain. The rich and tyrannical power occupied his entire body and the pain was like thousands of ants chewing on his body, especially his palms and back.</p><br/><p>Zuo Mo had to focus his attention on the enemy in front of him. This way, it seemed that the pain he felt would lessen.</p><br/><p>He gathered all the strength in his body, and the Midday Blade in his hand viciously struck at Yu Zi Zhou!</p><br/><p>Midday Blade Strike!</p><br/><p>The sky was full of wind and fire that howled as it shot at Yu Zi Zhou!</p><br/><p>Yu Zi Zhou’s expression changed slightly. With a cold snort, his left leg shifted back slightly, his hands made a shape as they were holding a large ball, and drew a perfect circle with ease in front of his chest.</p><br/><p>If Su Wei and the others saw this scene, they would have exclaimed, the ultimate defensive technique of Yu Zi Zhou—[Interconnected Jade Rings]!</p><br/><p>An ultimate move right at the start! Without time to think, Yu Zi Zhou instinctively used the strongest defensive yao art he could do!</p><br/><p>One created two, two created four … …</p><br/><p>In a flash, rings of light covered Yu Zi Zhou.</p><br/><p>Pew pew pew!</p><br/><p>The storm of fire hit the rings of light, and both were destroyed. Rains of fire continuously landed on the rings of light, and rings of light were continuously destroyed. But the number of light rings did not lessen. Instead they increased, and became more numerous!</p><br/><p>Zuo Mo felt there was an unstoppable flood inside his body that spread along his left hand and was going to burst from his left palm.</p><br/><p>He did not even think before slamming his palm towards the thick rings of light.</p><br/><p>Translator Ramblings: We finally get to learn what really happened to Pu Yao, but Zuo Mo still is ignorant as he goes on berserk rage. I’m not sure what is going on with Qinghua Xue’s flowers but she seems to have only done as much as what the flowers told her so she had nothing left after Zuo Mo destroyed the flowers. She had no cards in the back of her hand like Zuo Mo does with the Archaic Wasteland Sacrificial Art.</p><br/>\n</div>"}