{"title": "Chapter Three Hundred and Ninety Four – Speculation", "id": 394, "volume": 4, "url": "http://boxnovel.org/world-of-cultivation-chapter-three-hundred-and-ninety-four-%E2%80%93-speculation", "volume_title": "Volume 4", "body": "<h1>Chapter Three Hundred and Ninety Four – Speculation</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Three Hundred and Ninety Four – Speculation</p><br/><p>When the news of the defeat at the front line reached the rear, all were shocked. This was the first defeat the yao had suffered after the war began. The losses were so severe they surpassed imagination.</p><br/><p>In the previous battles, the yao military forces had advanced smoothly. The xiuzhe hadn’t just retreated out of Bloody Sky Metropolis Jie, they had also lost multiple jie. But looking at it with a calm eye now, the xiuzhe had not been truly wounded at all. What they had lost were just the lowest level of sects, and the true elite had not suffered losses at all.</p><br/><p>In this defeat, the yao casualties were all combat yao above the stage of spirit planting.</p><br/><p>Normal yao and combat yao were both were spirit planting stage, but there was an enormous difference in ability. This was not as evident when it was a small skirmish, but the difference would certainly show in mass combat. Even if it was the local militia, they needed to training for at least five years to form preliminary combat abilities.</p><br/><p>Even more, Fierce Fire Corps was a regular corps commanded directly by the Council of Elders.</p><br/><p>None one had expected the xiuzhe’s counterattack was so ferocious and decisive. When they attacked, it was like thunder.</p><br/><p>When the situation at the front lines were good, the mood at the rear was very relaxed, but with the news of the defeat the mood of the rear instantly became tense.</p><br/><p>The Fierce Fire Corps of Yan Shang Daren were famed for their ferocity. They were completely defeated. Then how strong was the power of the enemy?</p><br/><p>The yao finally remembered that the xiuzhe had possessed Bloody Sky Metropolis Jie for three thousand years. Three thousand years, even if Bloody Sky Metropolis Jie was not suited for xiuzhe to fight, they would still be as familiar with that place like it was their back yard.</p><br/><p>———</p><br/><p>The light on his hand flashed continuously, Zuo Mo was very careful.</p><br/><p>Pia, the light disappeared.</p><br/><p>Zuo Mo shook his head. It still didn’t work. He tried to recall the feeling he captured with the [Tactile Knowledge Grip] that day, and seemed to comprehend something but he could not describe it. He knew this was due to not having a deep enough understanding. That barely discernable understanding needed more accumulation.</p><br/><p>It seemed that he needed to go find Little Red soon.</p><br/><p>The pitiful Mo Ru Huo was a pretty famous character, but due to his completely red body, Zuo Mo intimately called him Little Red. If he heard this nickname, he would probably go insane immediately.</p><br/><p>He had been planning to use the prison battlefield to practice his yao arts. Now that he did not have any ideas, Zuo Mo did not decide to procrastinate any further.</p><br/><p>As long as he did not activate the prison breaking battle, passing through was still pretty easy for him.</p><br/><p>He quickly received the qualification to enter the third prison.</p><br/><p>He thought, he had spent enough time in the Ten Finger Prison today. His consciousness swept across the spiritual imprint. He found that Cang Ze and Nan Yue were both present and headed to the Wasteland Beast Chessboard.</p><br/><p>When Zuo Mo found Cang Ze and Nan Yue, he found the two were dejected and had worried expressions.</p><br/><p>“What is it?” Zuo Mo asked in puzzlement, “Has something happened?”</p><br/><p>Cang Ze narrated the news of the loss at the front lines in a low voice. At the side, Nan Yue showed worry. They lived in the yao world. If the yao army were defeated, their lives would become even worse. They had just seen hope. If the yao world became destabilized, would anyone remain unaffected?</p><br/><p>After Cang Ze finished, Zuo Mo was stunned where he stood, with only shock left inside.</p><br/><p>After a long time, he came back.</p><br/><p>His first response was, how was it possible?</p><br/><p>He had personally seen the great strength of the yao army. Sky Moon Jie, Little Mountain Jie, when hadn’t the xiuzhe retreated continually? Those large sects retreated when they heard of the advance of the yao army and ran back to Bright Wave Jie like homeless dogs. After that, Zuo Mo had lost complete confidence in Kun Lun. Even the present Vermillion Bird Camp and Guard Camp in Zuo Mo’s eyes could not compare to the elite forces of the yao army.</p><br/><p>Now he was hearing Cang Ze say that the yao army had been defeated by the xiuzhe.</p><br/><p>The yao military that was so powerful was actually defeated? And defeated right in front of their own doorstep?</p><br/><p>When he heard that the total death count reached twelve thousand, Zuo Mo didn’t know what to say.</p><br/><p>So the xiuzhe had powerful people too … …</p><br/><p>He still didn’t believe it but he knew that Cang Ze and Nan Yue definitely would not try to con him.</p><br/><p>Such a dazzling victory completely upended Zuo Mo’s impression of the fragility of those great sects. He suddenly realized the depths of those great sects were not as he had thought.</p><br/><p>But he couldn’t help but have a strange feeling.</p><br/><p>The past weak display of the xiuzhe was a stark contrast against this great victory.</p><br/><p>The two were so different they were like mud and clouds.</p><br/><p>Was it … … was it … …</p><br/><p>Zuo Mo’s eyes suddenly widened. His body froze and a wave of coldness rose from his spine.</p><br/><p>Pretend to be weak?</p><br/><p>The four words tore his mind like lightning.</p><br/><p>His expression changed.</p><br/><p>With multiple jie of territory, countless sects as the bait … … it was insane!</p><br/><p>His mind blanked as he mindlessly murmured.</p><br/><p>If it really was so, then the one who planned this was a madman! An undoubted madman!</p><br/><p>Zuo Mo soullessly returned to the camp.</p><br/><p>———</p><br/><p>The grey mist in the sky continuously retreated back towards the center. The figure of the giant continuously shrunk and became clearer.</p><br/><p>When it completely appeared, simultaneous inhales sounded in the camp again.</p><br/><p>An extremely weird giant floated in the sky. Twenty zhang high like a little mountain. It had three heads that faced three directions, each with a different expression. There was one glaring angrily, one smiling slightly, and one with eyes closed in deep thought. The six arms were either making seals, or the pair of hands were together.</p><br/><p>Endless dignity was like an invisible wave that struck everyone’s minds.</p><br/><p>Staring at the colossal being in the sky, Yi Zheng’s face was a pale as paper, his pupils scattered as he unconsciously murmured.</p><br/><p>“Dragon and Elephant Attainment … …”</p><br/><p>———</p><br/><p>When Zuo Mo returned to the camp, Zong Ru’s core formation was in its ending stages.</p><br/><p>He looked towards where Zong Ru was. He was first shocked and then he showed joy. However, this thread of joy was quickly shrouded by thick darkness. His face became extremely dark and he called everyone to his tent.</p><br/><p>The mood inside the camp was extremely low. Everyone had terrible expressions. The news that Zuo Mo had brought from the Ten Finger Prison was a shock and everyone was silent.</p><br/><p>“We are bait.”</p><br/><p>Gongsun Cha narrowed his eyes as his finger gently swiped across his face. His bashful and shy face was completely frosty at this time.</p><br/><p>“If this really is their plan, then they definitely have successive plans,” Gongsun Cha continued to speak. His voice was cold like the collision of ice cubs. His autumn like pupils were filled with murderousness. “A person who is able to make such a scheme definitely would not just aim for this kind of small victory.”</p><br/><p>“Damn it!” Xie Shan bellowed, his eyes sprouting fire and his features twisted.</p><br/><p>The other xiuzhe who came out of Little Mountain Jie had completely red eyes. Not even one out ten xiuzhe had managed to survive Little Mountain Jie. No one experienced more than they did. Every one of them had crawling out of piles of corpses.</p><br/><p>No one doubted Gongsun Cha’s speculation.</p><br/><p>Sword essence flowed in Wei Sheng’s black eyes and his expression was black. He had felt things were strange when he had accompanied Lin Qian and his group to the sword cave. Every one of Lin Qian’s bodyguards had exceptional power. With that kind of strength, why did they not defend Sky Moon Jie? It seemed more like they had given Sky Moon Jie to the yao army.</p><br/><p>With the comparison now, he understood. A strong fury and dislike instantly filled his chest. The sword essence in his body felt it and roiled as it wanted to burst out of his body.</p><br/><p>Kun Lun governed the entire Kun Lun Territory. Every sect needed to pay taxes to Kun Lun. A portion of their income had to flow towards Kun Lun, turned to jingshi, turned to materials for Kun Lun disciples to cultivate, for Kun Lun to use for daily expenditures.</p><br/><p>But … …</p><br/><p>Killing essence flowed through the tent and the mood was extremely low.</p><br/><p>Zuo Mo who had been silent all this time suddenly raised his face. As though nothing had happened, he gave a bright smile. “Everyone, cultivate! If they really did this, ha, there naturally will be chances to slowly settle our debts with them.”</p><br/><p>———</p><br/><p>“Faster, faster!”</p><br/><p>“Accelerate! We must reach the defensive line within forty eight hours!”</p><br/><p>Every yao soldier had tired expressions. They had received orders. In order to rush to Bloody Sky Metropolis Jie as fast as possible, they had almost used all their power.</p><br/><p>“General, we will reach Bloody Sky Metropolis Jie soon.”</p><br/><p>As the corps commander of Ice Frost Crops, Lan was in his prime. Twenty years ago, he had become a golden battle general. The twenty years of experience of commanding a troop had caused him to show hints of making a breakthrough. As one of the most influential people of the Water Clan, everyone speculated that he would have a good future.</p><br/><p>Lan had a cautious personality. His battle style was steady and he rarely made mistakes.</p><br/><p>The reason that the Elder Council sent him was in hopes that he could quickly stabilize the theatre of war and prevent the collapse of the defensive line.</p><br/><p>Looking at the bloody mist that was endless in front of him, Lan was silent. The troops streamed past him and entered the bloody mist. His vice commander silently stood next to him and did not disturb him.</p><br/><p>“Do you know the origins of the Bloody Sky Metropolis Jie?” Lan asked.</p><br/><p>The vice commander respectfully said, “Three thousand years ago, we were defeated. In order to halt the advance of the xiuzhe, the four major jie masters used their fleshly bodies in sacrifice, with seven intermediate jie as the axle, forty nine little jie as the screen, to create what is called Bloody Sky Metropolis Jie.”</p><br/><p>Lan said emotionally, “Yes, born of our elders’ blood and flesh. I hope they can protect us to safely return.”</p><br/><p>The vice commander said in shock, “Does Daren have such a low outlook on our mission this time?”</p><br/><p>“The other definitely has more plans.” Lan shook his head. “The complete defeat of the Fierce Fire Corps is not an accident. The destruction of a corps is at least an intermediate scale battle. If they did not put in enough power, they other could not have completely killed the Fierce Fire Corps.”</p><br/><p>The vice commander couldn’t help but have a worried expression. He had followed his commander for many years. Daren would never speculate.</p><br/><p>Noticing the vice commander’s expression, Lan said with a smile, “Don’t be nervous. We will use earth to deal with water, generals to deal with soldiers. We just have to be more careful.”</p><br/><p>“This subordinate thinks too much,” the vice commander hurriedly replied.</p><br/><p>“Being more cautious is good.” Lan was silent for a moment before he suddenly raised his head. A light flashed through his pupils. “Order! Collectively accelerate! We need to reach the defensive line in twenty four hours.”</p><br/><p>The vice commander apprehensively responded, “Yes!”</p><br/><p>Translator Ramblings: Zuo Mo wants his tax money back.</p><br/>\n</div>"}