{"title": "Chapter Three Hundred and Ninety Three – Buddhahood Abandonment Death Wish", "id": 393, "volume": 4, "url": "http://boxnovel.org/world-of-cultivation-chapter-three-hundred-and-ninety-three-%E2%80%93-buddhahood-abandonment-death-wish", "volume_title": "Volume 4", "body": "<h1>Chapter Three Hundred and Ninety Three – Buddhahood Abandonment Death Wish</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Three Hundred and Ninety Three – Buddhahood Abandonment Death Wish</p><br/><p>Core formation!</p><br/><p>Up until now, the camp had two jindan in total, Wei Sheng and Xie Shan.</p><br/><p>Zong Ru undergoing core formation was unexpected by everyone. Wei Sheng’s core formation was caused by the condensation of his sword heart after killing something, and Xie Shan’s core formation was an innate change due to power. Zong Ru’s talent could only be called normal. While his cultivation was not bad, but he had not accumulated power on the level that Xie Shan had.</p><br/><p>Zong Ru, who was not the most outstanding in any area, was the third to undergo core formation!</p><br/><p>Shocked, everyone naturally spread out and raised their guard to defend against the fiendish mist that would come and disturb Zong Ru.</p><br/><p>After seeing two core formations, everyone was familiar with the apparitions during core formation. In the sky above Zong Ru’s tent was an enormous shadow that was like a faint ball of mist. The mist flowed and twisted as though something was struggling inside.</p><br/><p>When everyone raised their heads to look at the enormous shadow in the air, they all expressed shock. As the mist appeared, a faint presence covered everyone’s minds like a little mountain. The only ones that could keep their composure were Wei Sheng and Xie Shan. But even these two had nervous expressions. If core formation failed, the lightest consequence was injury and the degradation of cultivation; the most serious was loss of life.</p><br/><p>Roar!</p><br/><p>A sound that was like a dragon and elephant thundered through the depths of the shadows like waves.</p><br/><p>Irregular ripples formed in the air like ripples in water. Everyone guarding the surroundings felt their ears ring as though something had exploded by their ears. Those with deep cultivation wavered, and those that were of lower cultivation paled and took multiple steps back.</p><br/><p>Only at this time did a hard wave of wind reach everyone.</p><br/><p>———</p><br/><p>“Wish power! A Buddhahood Abandonment Death Wish! How long has it been since I’ve seen such pure and extreme wish power?” In Wei’s deep pupils, there seemed to be something flashing.</p><br/><p>Pu Yao looked at the continuously changing mist in the sky, as a hint of trepidation flashed through his mind.</p><br/><p>Wish power!</p><br/><p>A taste that he had almost forgotten. But when it appeared again, that familiar trepidation once again appeared.</p><br/><p>In that great war three thousand years ago, he had fought against many dhyana xiu. Of course, there were dhyana xiu that possessed wish power. Dhyana xiu that possessed wish power were enemies that all yao did not want to encounter. It didn’t matter if it was yao arts or mo skills, there were many malicious and evil techniques he could think of; but if Pu Yao had to pick out the ten most malicious powers, wish power was definitely among them.</p><br/><p>Wish power did not have any connection with the cultivation level of the dhyana xiu. It was a power that could permeate all kinds of ling power. It was only connected with the wish inside the heart of the wisher. The more determined the wisher’s belief was, the stronger the wish power was.</p><br/><p>In the legends, if the dhyana xiu who made a wish could complete the oath they gave, they could become a buddha.</p><br/><p>The strongest belief of every dhyana xiu was to become a Buddha. A death wish was a wish that could not be completed. Buddhahood Abandonment Death Wish, was when the dhyana xiu made the cruelest and harshest oath and because of this, of all the kinds of wish power, Buddhahood Abandonment Death Wish was the most extreme wish power.</p><br/><p>No one wanted to be enemies that had made a Buddhahood Abandonment Death Wish. If one touched this terrifying wish power, it would directly damage their soul, and this damage was almost irreparable. It was a synonym for death.</p><br/><p>Luckily, not every dhyana xiu could make wishes. Otherwise, the great battle in the past would not have lasted for long. In reality, it was rare to find dhyana xiu that could receive wish power; and of those the dhyana xiu that could make a Buddhahood Abandonment Death Wish, even Pu Yao hadn’t seen more than five.</p><br/><p>But they actually encountered one here!</p><br/><p>Pu Yao and Wei were frightened.</p><br/><p>———</p><br/><p>Of the entire campsite, in terms of who was most shocked, it would undoubtedly be Yi Zheng.</p><br/><p>Coming from the Great Buddha Temple, Yi Zheng was from an orthodox and famed sect. But at this time, he was gaping as he looked at the sky, his entire mind a mess.</p><br/><p>Dropped into this ghastly place, what he had seen in these short months had completely upset everything he had learned on the mountain.</p><br/><p>When he had seen Wei Sheng the first time, he was awed by the other’s talent and felt that he, in comparison, had achieved nothing. However, he never would have thought that it was just the beginning. Everything that followed was so fantastical it was like a dream.</p><br/><p>A guy who was of similar age to him was the leader of thousands of people, and everyone was strangely loyal.</p><br/><p>In a place called Golden Crow Camp, everyone had a fourth-grade Golden Crow Fire seed. He had almost gone insane then. Could that fire seed be made wholesale?</p><br/><p>In a place called Vermillion Bird Camp, everyone there were battlemaniacs. Even their gaze when they walked by were like blades. Yi Zheng was a greenhorn. He did not know how strong these people were but the presence exuded by these people made his heart beat wildly.</p><br/><p>A place called Guard Camp had its doors locked all day. However, there would occasionally be the sounds of howling like wild beasts and battle coming from inside. Every time he passed by, he would uncontrollably shake.</p><br/><p>There was one that rested all day hugging the sword, one that held a black spear and killed all day without any weariness, little people that could fly, and mischievous pagoda … …</p><br/><p>All kinds of weird, strange, and impossible things were found here.</p><br/><p>We are from Great Buddha Temple, we are dhyana xiu, we won’t compete with you on strangeness, Yi Zheng repeatedly comforted himself in multiple nights.</p><br/><p>But today, he saw with his own eyes a dhyana xiu’s coreformation, saw a dhyana xiu give a wish, saw a dhyana xiu give a Buddhahood Abandonment Death Wish, and consequently, he completely broke down!</p><br/><p>Who is the dhyana xiu here!</p><br/><p>Great Buddha Temple, one of the ten dhyana xiu holy grounds. He knew of three that had wish power, the shishu from the Discipline Hall, the ancestral forefather, and Seventh Shigu.</p><br/><p>Buddhahood Abandonment Death Wish, oh, the stuff of legends, it’s good to hear about it.</p><br/><p>But why did it have to appear in front of him … …</p><br/><p>Yi Zheng suddenly felt that the glittering sigh of the Great Buddha Temple was still dazzling in front of this unorthodox dhyana xiu, but for some unknown reason, its presence had lessened greatly.</p><br/><p>All hail the Buddha!</p><br/><p>Yi Zheng grabbed his head with his hands and looked dazedly at the dark shadow gradually forming in the sky.</p><br/><p>———</p><br/><p>A blurry shadow gradually formed above the camp.</p><br/><p>The enormous slave transporting boats in the face of this figure’s foot was like a toe. The shadow was like an ancient giant looking down at the world. Everyone in the camp without exception inhaled sharply. An endless presence came at them like a tsunami.</p><br/><p>Wei Sheng showed a grave expression. He stepped forward, and gestured in a circle and swiped with his fingers.</p><br/><p>Everyone felt the presence oppressing their bodies instantly lesson and their terror-filled expressions eased slightly.</p><br/><p>Wei Sheng and Xie Shan exchanged a look. Both had grave expressions. The two of them had detected the unusualness of Zong Ru’s core formation.</p><br/><p>Moo!</p><br/><p>The blurry giant suddenly raised its head and bellowed. The sound travelled far in all directions!</p><br/><p>Waves of motion came from the depths of the fiendish mist.</p><br/><p>The giant’s blurry figure continued to change.</p><br/><p>———</p><br/><p>Zuo Mo who was going through the Dance of Falling Maple’s prison battlefield did not know of the enormous noise at the campground.</p><br/><p>This time, he did not activate the prison breaking battle and he sighed in relief. If he activated the prison breaking battle again, then he would want to smash his head of a wall. He thought of how much endless trouble breaking Vast Water Clear Skies had been.</p><br/><p>With money in his hand, Zuo Mo did not want trouble. These things might also be money, but there were not as likable as jingshi. In any case, ge couldn’t waste it.</p><br/><p>The prison battlefield of the Dance of Falling Maple was primarily based on killing illusions. Zuo Mo felt good after using [Bone-Crushing Obscuring Wind]. Powerful yao arts only worked if they were used frequently. Zuo Mo clearly detected that he could use [Bone-Crushing Obscuring Wind] now.</p><br/><p>Zuo Mo quickly was not satisfied with purely using [Bone-Crushing Obscuring Wind]. He started to try to change yao arts.</p><br/><p>Suddenly thinking of the feeling he caught at the last moment in the battle against Mo Ru Huo … …</p><br/><p>Zuo Mo’s eyes suddenly lit up.</p><br/><p>———</p><br/><p>The door created by blue and green vines twined together released a serene light. This was a yao door. The xiuzhe had their transportation formations, the yao had the their yao doors, the mo had their blood pools.</p><br/><p>They were going home.</p><br/><p>Looking at the yao door, Mu Xi’s thoughts flowed. She couldn’t say how she felt after being able to safely return home after fighting for several years. Before this campaign, she had never left home for so long. Thinking about how her mother had cried until she was made of tears when she had been preparing, her heart felt sore.</p><br/><p>Returning in victory, this was the only part she felt was worth it. From a young age, her talent was not very eye-catching among the youths of the clan. It was only when she began to study being a battle general that her talent was seen. It had been unexpected that the chance to represent the Wood Clan had landed on her head. The clan leader’s order had created many doubting voices. It had to be known that of all military commanders, she was the youngest.</p><br/><p>Fortunately, she had not failed. Even though there were no great achievements, there were not any failures.</p><br/><p>“Let’s go,” she said serenely.</p><br/><p>Just at this time, a yao that was wearing the military uniform hurried past. Mu Xi recognized this yao. The other was an intermediate-level battle general at the front line of the Bloody Sky Metropolis Jie. Mu Xi had once met him. The other’s expression was panicked and had slight terror. Mu Xi’s heart suddenly jumped.</p><br/><p>“Mang Zang Daren!” she called the other.</p><br/><p>Mang Zang’s steps paused. He finally saw Mu Xi like he had woken up from a dream. “It’s Mu Xi Daren!”</p><br/><p>To any battle general, the skill to remain calm was the most fundamental of all fundamentals. Seeing the other so uncomposed, the bad feeling inside grew. She asked in a light voice, “Has something happened?”</p><br/><p>Zang Mang’s expression changed. His eyes suddenly became slightly red, his voice hoarse. “The front lines were defeated.”</p><br/><p>“Ah!” Mu Xi and her vice commander’s expression changed dramatically.</p><br/><p>“Three days ago, small numbers of xiuzhe appeared on the outskirts of the defensive line. We sent out little teams to clean out the area. We quickly received news that the teams were surrounded and were asking for aid. Yan Shang Daren led the troops to give aid. But the other took the chance to attack the defense line. The attack was strong. Yan Shang Daren was ambushed on the way back to give aid. The Fierce Fire Corps were completely killed. Yan Daren has also given his life in sacrifice. The troops that went to give aid to Yan Shang Daren were also ambushed and lost great numbers!”</p><br/><p>Mang Zhan’s voice was sorrowful.</p><br/><p>Mu Xi’s face suddenly became as white as paper.</p><br/><p>Translator Ramblings: Poor Yi Zheng, it’s been one shock after another. Also, Mu Xi is going home. Her mission to find the daren who set off the Stars in Daytime has ended. From her perspective, it is possible to see the restrictions of being in a military organization. She is cautious and has to always consider her service and achievements as well as the effects on her fmaily. Also, she is under another person’s command so there is a lack of freedom. She is very restricted in her actions compared to Zuo Mo who is really only constrained by the environment, his money or lack of, and his own desire to survive.</p><br/>\n</div>"}