{"title": "Chapter Three Hundred and Ninety Five – Gold Battle General", "id": 395, "volume": 4, "url": "http://boxnovel.org/world-of-cultivation-chapter-three-hundred-and-ninety-five-%E2%80%93-gold-battle-general", "volume_title": "Volume 4", "body": "<h1>Chapter Three Hundred and Ninety Five – Gold Battle General</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Three Hundred and Ninety Five – Gold Battle General</p><br/><p>Zong Ru opened his eyes. The chaotic air turbulence around him instantly stopped and a glowing light flashed and disappeared in his eyes. The skin on his face became extremely smooth, the weathering due to hard days in his past had disappeared. His appearance was not handsome and not exceptional in the campsite but the dhyana serene aura on his body was unique to him.</p><br/><p>It had to be said that the people of the camp were very unique. Wei Sheng’s determination, Gongsun Cha’s insanity and viciousness hidden under bashfulness, Shu Long’s steadiness, Ma Fan’s laziness etc.</p><br/><p>On Zong Ru’s clean forehead was a blood red lotus. Two auras, one holy and one demonic, were merged together, and filled with a soul-shaking power.</p><br/><p>He stood and slowly walked out of the tent.</p><br/><p>“Old Ru!”</p><br/><p>Seeing Zong Ru, Lei Peng and Nian Lu first stopped and then were overjoyed. The three of them had once been in a team and had a good relationship. While Zong Ru had undergone his core formation, the two of them had stood guard outside the tent.</p><br/><p>“Lei Man! Little Nian Nian!” A sincere smile came onto Zong Ru’s face.</p><br/><p>Nian Lu’s smile froze on his face, and the tendons in his forehead pulsed. Lei Peng laughed instead, and rushed in front of Zong Ru, opening his eyes and giving a hard hug.</p><br/><p>“Old Ru, you did it! Secretly having your core formation! Isn’t this forcing the rest of us to work hard?”</p><br/><p>Lei Peng’s voice was like thunder and exploded next to Zong Ru’s ear. Zong Ru had a slight smile as he patted Lei Peng’s back.</p><br/><p>Nian Lu’s gaze swept across Zong Ru and landed on Zong Ru’s face. His eyes suddenly lit up. “So core formation can make one more handsome! Excellent! No, no, I have to enter jindan soon! I’m so handsome now, if I’m a jindan, how handsome would I be? It is such a hard question … …”</p><br/><p>Hearing Nian Lu’s narcissistic and nonsensical words, Zong Ru’s heart felt unspeakably warm.</p><br/><p>The news that Zong Ru had come out made the entire camp erupt.</p><br/><p>The mood of the camp had been extremely heavy these past days. Zong Ru’s re-appearance caused everyone to be filled with joy. Zong Ru was humble and low-key usually. In this time, the people that came to congratulate him was endless. Compared to everyone’s worry when Xie Shan had his core formation, everyone was extremely calm this time.</p><br/><p>When Zong Ru saw Zuo Mo and the others, he hurriedly walked forward. He made a deep bow and said respectfully, “Daren!”</p><br/><p>A smile came onto Zuo Mo’s face and he unhesitatingly went forward to give Zong Ru a hard hug. Just as Zong Ru was very moved, Daren muttered in a small voice next to his ear, “You have to work hard on the healing techniques of [Attainment Golden Body]. There is so many people in the camp, think how much jingshi we can save when the time comes … …”</p><br/><p>———</p><br/><p>“Daren, we cannot sustain this,” the vice commander’s expression was fragile and his voice bitter and burdened.</p><br/><p>Lan’s face was unaffected. “How many have we lost?”</p><br/><p>“Another two hundred were just killed, three hundred wounded!”</p><br/><p>The vice commander had a terrible expression when he reported the numbers. In the short eight hours since they stepped into the Bloody Sky Metropolis Jie, they had encountered six waves of attack! Up until now, fatalities reached more than one thousand people, more than one-tenth of the entire corps.</p><br/><p>The other’s attacks were extremely fierce and unpredictable. They seemed to be able to move without restriction in Bloody Sky Metropolis Jie. No one knew how they were able to do this. The Blood Sky Metropolis Jie was the battlefield suited for yaomo, yet they were suppressed in this place. But the xiuzhe who attacked them seemed to be unaffected at all and were at great ease.</p><br/><p>How was the other able to do this?</p><br/><p>Lan gazed into the distance and asked, “How long until we can reach the defensive line?”</p><br/><p>“The other’s attacks have slowed our advancement … …”</p><br/><p>Lan interrupted the vice commander and asked sternly, “How long?”</p><br/><p>The vice commander’s heart shook. He gritted his teeth and said, “At this speed, we will only reach the line after ninety six hours.”</p><br/><p>Lan was silent for a moment before he said in a deep voice, “Gather the other daren.”</p><br/><p>“Yes.” The vice commander heeded the order. Moments later, the nine officers hurried over. Their expressions were all bad.</p><br/><p>In eight short hours, one-tenth of their forces had been killed. This kind of attrition rate made their hearts beat rapidly. Based on this speed, their numbers would be expended before they reached the defensive line.</p><br/><p>Lan’s gaze swept across the nine officers. Their faces were terrible but not panicked. He had personally promoted all nine commanders who had outstanding skills.</p><br/><p>Military positions had very strict requirements. For a regular corps like the Ice Frost Corps, the corps commander must be a gold battle general, and the officers had to be silver battle generals.</p><br/><p>“I need one that is willing to go to his death.”</p><br/><p>Lan did not waste words and directly said it.</p><br/><p>The nine officers all changed expressions. From Daren’s words, they could surmise the state of the situation. Daren’s gaze made them feel there was a blade at their back.</p><br/><p>But … …</p><br/><p>They hesitated.</p><br/><p>At this time, a youth stood out.</p><br/><p>“Daren, this subordinate is willing.”</p><br/><p>Lan’s expressionless face imperceptibly twitched. He looked closely at the youth and his heart couldn’t help but hurt. This youth that had become a silver battle general at the age of twenty had a limitless potential and one of his favored commanders.</p><br/><p>Liang Wei belonged to one of the side branches of the Water Clan. His results in the yao art house had been average until he had turned to study as a battle general, where his results shot up. When he was twenty, he had successfully passed the exam of a silver battle general. Even though he was not eye-catching compared to the little monsters of the yao world, Lan still felt that his future was limitless.</p><br/><p>Liang Wei stood upright, full of bravery.</p><br/><p>Lan could not refuse at this time. He nodded. “I will give you three thousand combat yao. Take up the rear, sweep the flanks of the troop, and stop the attacks.”</p><br/><p>The other officers had complex expressions. From the harassment they had endured in the last eight hours, they could predict just how great the pressure Liang Wei would face.</p><br/><p>Liang Wei calmly accepted and made a bow towards Lan.</p><br/><p>“If I die in combat, Daren, please give some care to my clansmen.”</p><br/><p>“I will!” Lan gravely replied. He turned to the other officers and said in a deep voice, “Proceed at full speed! Military law for those that slow down!”</p><br/><p>“Yes!” The officers all shook.</p><br/><p>———</p><br/><p>Wei gazed at the development of the battle situation. He felt great shock at the combat capabilities that Gongsun Cha showed.</p><br/><p>The battle had been at a stand still for two whole days.</p><br/><p>Wei saw a rare seriousness on Pu Yao’s face. After interacting for several thousand years, no one could rival his understanding of Pu Yao. When his previous owner had been the corps commander, all of the strategic decisions had come from Pu Yao.</p><br/><p>Pu Yao was forced to such a state by such a young guy!</p><br/><p>If he didn’t see it with his own eyes, he definitely would not believe it.</p><br/><p>From the start of this war chess match, he had watched as the two fought without a moment of inattention. He had sighed in amazement many times throughout. The eye-dazzling fighting had caused him to exclaim. The time rate of war chess was much faster than regular time. The span of two days was equivalent to a whole month inside the match.</p><br/><p>He did not understand battle generals. At every dangerous moment, his heart couldn’t help but jump. He had thought hundreds of time inside, how could they be so devious?</p><br/><p>Even though the advantage of the match was in Pu Yao’s hands, but Wei put more of his attention of Gongsun Cha. Such a young person that was able to resist Pu Yao for so long, his skill definitely was not low!</p><br/><p>Gradually, the balance began to tilt and the Pu Yao’s advantage had grown.</p><br/><p>Pu Yao’s sweeping attacks in the final stages of battle were, in Wei’s view, this guy venting for having lost face.</p><br/><p>As expected, when Pu Yao came out of the war chess, his expression was not good.</p><br/><p>“A very powerful young person.” Wei’s words were slightly pouring salt onto the wound.</p><br/><p>Pu Yao’s expression became even uglier, but he seemed to think of something and his expression instantly recovered. He said proudly, “Don’t give young people too much praise. This is not good for his improvement.”</p><br/><p>Wei stilled. He reacted very quickly. “He is?”</p><br/><p>“My student.” Pu Yao showed a smug and sly smile. “How about it? Give a review!”</p><br/><p>Wei really was stunned this time. “He is also your student? What about Zuo Mo?”</p><br/><p>“Why can’t I have two students?” Pu Yao glanced at Wei, his tone filled with smugness and showiness. “I have good eyes for judging people!”</p><br/><p>“Strong!” Wei’s praise seemed sincere.</p><br/><p>“Of course!” Pu Yao was even more smug. “Nothing needs to be said of Zuo Mo, that guy is a weirdo that even I don’t understand. Gongsun Cha is born to be a battle general. Ha, a twenty year old gold battle general, he’ll frighten those old guys to death!”</p><br/><p>“Gold battle general?” Wei was frightened. He stammered out, “That little guy is a gold battle general?”</p><br/><p>Wei’s display made Pu Yao’s smugness reach a peak. His devious and cunning face seemed to glow at this moment. “Definitely a gold battle general! I jumped in fright this time when he attacked! If I wasn’t careful, I would have lost. Tsk tsk, a scripture he comprehended himself, twenty year old gold battle general. As expected of one that I taught from the beginning! Most importantly … …”</p><br/><p>Pu Yao suddenly closed his mouth and did not speak. Wei unconsciously asked, “What is it?”</p><br/><p>“Hahahaha! He didn’t not just inherit my skills as a battle general, but also my handsome appearance! On this point, Zuo Mo lacks a lot … …”</p><br/><p>Wei looked wordlessly at Pu Yao.</p><br/><p>———</p><br/><p>Gongsun Cha’s mood was terrible to the bone.</p><br/><p>He had originally thought that after just having a breakthrough, he could rival the mystery person. Who knew that he had lost again. Even though he knew he could not rival the other, but he disliked failure, extremely disliked it!</p><br/><p>After swallowing the fiend soul beast bead, he had just reached the border of a breakthrough. Just at this time, Zuo Mo had given him a Golden Soul and successfully allowed him to make a breakthrough!</p><br/><p>The strong confidence brought by the breakthrough caused him to unhesitatingly challenge Pu Yao.</p><br/><p>But it still ended in defeat. Thinking about how he had never beat the other once, his mood became even worse!</p><br/><p>The speculation about being bait made him even angrier. With his understanding of Shixiong, even though Shixiong had said it easily that day, he definitely would not give up inside. They would get even. As the battle general, he would undoubtedly play the most crucial part.</p><br/><p>He could not fail!</p><br/><p>Craziness flashed through Gongsun Cha’s eyes.</p><br/><p>A daring and insane idea quickly formed in his mind.</p><br/><p>Translator Ramblings: Lil’ Miss knows Xiao Mo Ge so well.</p><br/><p>Also, to be clear, Gongsun Cha is a gold battle general but it doesn’t mean that if he fights in “real life” the army he leads will win against another army. As mentioned before, training takes several years until a battalion actually takes form and the strength of Gongsun Cha’s soldiers also matter.</p><br/>\n</div>"}