{"title": "Chapter Four Hundred and Seventeen – Sea of Golden Crystal Sand", "id": 417, "volume": 5, "url": "http://boxnovel.org/world-of-cultivation-chapter-four-hundred-and-seventeen-%E2%80%93-sea-of-golden-crystal-sand", "volume_title": "Volume 5", "body": "<h1>Chapter Four Hundred and Seventeen – Sea of Golden Crystal Sand</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Four Hundred and Seventeen – Sea of Golden Crystal Sand</p><br/><p>The dunes in their sight were endless.</p><br/><p>The glittering gold sand was like a golden sea, and these rising dunes were like the waves of this golden sea.</p><br/><p>This scene was spectacular!</p><br/><p>The Golden Crow Camp at the back of their procession suddenly became restless.</p><br/><p>“It’s Golden Crystal sand! Heavens, all of this is Golden Crystal sand!”</p><br/><p>“Oh, Heavens! It really is Golden Crystal sand!”</p><br/><p>“Heavens! What place is this? How can there be this much Golden Crystal sand?”</p><br/><p>The restlessness from the rear rippled forward, and Zuo Mo couldn’t help but be stunned. He bent down and grabbed a handful of sand. When the gold sand entered his hand, his first thought was ‘heavy’! When he examined it, the golden sand was actually half transparent. Each speck was a cube. At the center of the cube was a hair thin golden thread. The reason that the sand was such a strong golden color was due to this extremely thin golden hair!</p><br/><p>It really was Golden Crystal sand!</p><br/><p>Fifth-grade Golden Crystal sand!</p><br/><p>Zuo Mo dazedly looked at the golden sea in front of him, his mind blank as he allowed the Golden Crystal sand to slip through his fingers.</p><br/><p>“This is the area where the totem of the Sun Tribe fell, so it is the Land of the Sunset. The Sun Tribe had the sun as its totem, and had many powerful tribal warriors. It was one of the strongest tribes in all of the jie.”</p><br/><p>The strange corpse’s voice was calm and emotionless, without any rise, as though he was describing a normal matter.</p><br/><p>Zuo Mo recovered from his daze. He furiously scooped Golden Crystal sand into his ring!</p><br/><p>Heavens, this was Golden Crystal sand! Fifth-grade Golden Crystal sand! On the outside, it was sold by the grain! If he let this opportunity go, he would be struck by lightning!</p><br/><p>Zuo Mo had never felt he was so rich before!</p><br/><p>It wasn’t just him. All the xiuzhe of the Golden Crow Camp were furiously packing in the Golden Crystal sand. Everyone’s eyes were red. Seeing this made their hearts beat faster and their blood flow more rapidly. In front of such a patch of Golden Crystal sand sea, everyone was crazy!</p><br/><p>The strange corpse tilted his head. “This and is useful to you?”</p><br/><p>“This is Golden Crystal sand!” Zuo Mo didn’t raise his head as he furiously packed Golden Crystal sand into his ring and said rapidly, “A fifth-grade material! I can’t even find a place to buy this on the outside! Do you know, this is worth a lot! Right! We’ve struck it rich this time!”</p><br/><p>“There is so much here, how are you going take it all?” The strange corpse pointed at the endless sea of sand.</p><br/><p>Zuo Mo’s movements paused. The endless sea of sand in front of him seemed to be reminding him that the Golden Crystal sand he was packing away was just a drop in the ocean. The bursting joy turned to grief. Zuo Mo’s tears flowed down his face.</p><br/><p>The Golden Crystal sand sea was in front of him, but he could not take all of it, the greatest pain in life was this!</p><br/><p>Looking at the vast sea of sand, Zuo Mo was still for a while. After a long while, he refocused and gritted out a few words, “Set up camp!”</p><br/><p>The troop quickly set up camp. Everyone was in a sort of frenzy and their movements unusually brisk.</p><br/><p>“Forge, forge all of this. Flying swords, ling armors, forge it all with Golden Crystal sand!”</p><br/><p>Zuo Mo’s bellows rang out over the entire camp. Everyone was upbeat. All of Golden Crow Camp members had eyes filled with blood. As production xiuzhe, they had no resistance towards high level materials. Vermillion Bird Camp was also excited. They learned from the Golden Crow Camp members that Golden Crystal sand was great material for forging flying swords. The flying swords forged from it were unable to be damaged, so sharp they could cut through everything. Even more importantly, it was at least fifth-grade!</p><br/><p>A fifth-grade flying sword, that was enough for a sword xiu to risk it all!</p><br/><p>This land of sunset was filled with the presence of the sun. The power of the Golden Crow Fire had greatly increased. The xiuzhe of Golden Crow Camp started on their difficulty task of forging with Golden Crystal sand. Yes, it was very difficult. They were mostly from grassroots. They had pitifully few encounters with fourth-grade materials, let alone fifth-grade materials.</p><br/><p>Golden Crow Fire was also a fourth-grade flame. Even though its power had greatly increased, but it was not easy to forge Golden Crystal sand. The great majority of people could only forge one grain at a time.</p><br/><p>The strange corpse looked with interest at this group of people.</p><br/><p>Calming down, Zuo Mo suddenly realized this was a rare and wonderful opportunity. So much Golden Crystal sand. Other than the value of the Golden Crystal sand itself, it could also provide everyone with a great chance to practice.</p><br/><p>Using Golden Crystal sand to practice, for a forging xiuzhe, was there anything more extravagant and sumptuous than this?</p><br/><p>Zuo Mo’s mood suddenly became light. Using fith-grade materials to practice. The experience he would get was much greater than with normal materials. Even Zuo Mo started to pick up the forging crafts he had decided to thrown away a long time ago, and started to process Golden Crystal sand.</p><br/><p>The strange corpse did not hurry them. He looked curiously as Zuo Mo forged. All of this was very unfamiliar to him.</p><br/><p>“Your flame is better than theirs.” The strange corpse might not understand forging but he still had his eyes.</p><br/><p>“Yes, I’m their head.” Zuo Mo was slightly smug, but his hands didn’t stop for an instant.</p><br/><p>“Head?” The strange corpse repeated and chewed this word. He raised his head and asked, “Does it mean leader?”</p><br/><p>“Elder’s comprehension is really good.” Zuo Mo flattered. He then asked curiously. “Elder, how did you forge talismans in your time?”</p><br/><p>“Talismans? What are talismans?” The strange corpse asked in puzzlement.</p><br/><p>“Oh, the flying swords they use are one type of talisman. Really, it is stuff that is made using all kinds of materials in order to increase our strength,” Zuo Mo explained.</p><br/><p>The strange corpse was slightly dazed. “Your sword, oh, flying sword, it is a clever trick. But the quality is lacking, and the power it adds is too little. It is also too fine, there are many places that it does not need to be so fine. As long as the materials have enough cognition, they will merge together, and have greater power.”</p><br/><p>Zuo Mo choked. He could only ask in response, “Elder, did you have many materials with cognition during your time?”</p><br/><p>“Everywhere.” The strange corpse had a matter-of-fact expression. He pointed at the ground. “Stuff like this, no one would want this.”</p><br/><p>Zuo Mo almost spat blood. So the Golden Crystal sand that was a treasure in their eyes was stuff that no one else wanted. However, Zuo Mo understood upon thinking about it. The number of cultivators in ancient times could not compare to now. After so many years of development and production, after generations of harvesting and division, there naturally won’t be much left of even the greatest amount of materials.</p><br/><p>Thinking about it that way, Zuo Mo found it fair. “Times are different. If this was taken out now, it would be considered good. Materials that have cognition are rare and too precious.”</p><br/><p>The strange corpse was a very intelligent person. He nodded in understanding and said, “No wonder you have developed such clever methods.”</p><br/><p>His next words caused Zuo Mo’s flame to shake. The Golden Crystal sand in the middle of the flame that was going to melt instantly turned back to normal.</p><br/><p>“There is something better inside this patch of sand.”</p><br/><p>“What good thing?” Zuo Mo asked urgently. Something better than Golden Crystal sand, wouldn’t that at least be sixth-grade?</p><br/><p>Sixth-grade material … …</p><br/><p>In this moment, Zuo Mo actually felt a thread of terror. Fifth-grade materials might be rare but he still had obtained a few items. But sixth-grade materials, he hadn’t ever dared to even think about it. Even the tiniest bit of sixth-grade material was enough to bring calamities.</p><br/><p>However, this thread of terror quickly disappeared. Since ancient times, the daring died from overeating, while the cowardly died from hunger! He also had so many fellows, and the future wasn’t something a person could entirely shape to their will.</p><br/><p>Zuo Mo’s gaze quickly became heated.</p><br/><p>The strange corpse tilted his head and swept a gaze across the sand. His gaze locked on a certain dune and then it pointed over.</p><br/><p>Bang!</p><br/><p>An enormous sound, and a faraway sand dune suddenly exploded!</p><br/><p>Zuo Mo gaped with wide eyes. This sand dune was at least one hundred zhang high. It looked like a small mountain. But the strange corpse just pointed and the resulting explosion turned it all to dust! A sand dune made up from Golden Crystal sand was at least millions of catties heavy, and under this gesture, had it became dust.</p><br/><p>Zuo Mo felt a hint of fear. It was lucky that he hadn’t tried to battle to death against this freak.</p><br/><p>The strange corpse calmly made a grabbing motion with his hand. A golden shadow penetrated the sand swirling in the sky and flew into his hand.</p><br/><p>An orange ball of fire!</p><br/><p>The burning heat rushed at him. Zuo Mo couldn’t help but take a few steps back.</p><br/><p>Enduring wave after wave of heat, he felt that his eyebrows were burning. He looked in shock at the fire ball in the strange corpse’s hand! Such high temperature! Such a powerful flame!</p><br/><p>The orange-red flame burned like a miniature sun. This flame’s temperature was so high it surpassed any flame that Zuo Mo knew of. Within the orange-red fireball, it was possible to discern a faint sphere.</p><br/><p>“This is called a Sun Crystal Seed, in the past it was the seed of the Sun Tribe’s totem. However, the Sun Tribe has probably died out by now, and it can no longer be used for the Sun Totem.” The strange corpse looked at Zuo Mo. “Do you want it?”</p><br/><p>Treasure! Definitely an ultimate treasure! Not ordinary!</p><br/><p>Zuo Mo was an experienced hand at studying reassures. He could see with a glance that the fireball’s value definitely surpassed everything on his body added together. Staring at the fireball, he felt a hint of trepidation but he gritted his teeth and said without hesitating. “Want!”</p><br/><p>Want! He’ll want it even if he died!</p><br/><p>“Its temperature is too high, you cannot tolerate it. I will help you seal it. When your strength reaches a certain level, you can unlock the seal.”</p><br/><p>When the strange corpse finished speaking, without seeing him move, the orange-red flames quickly became dim and revealed the true face of the sphere inside. It was a sphere that looked just the same as normal crystal spheres that did not have any light.</p><br/><p>Zuo Mo took over the crystal ball. His hand suddenly sank down, and his pupils dilated!</p><br/><p>It was so heavy!</p><br/><p>With the Great Day mo physique, Zuo Mo was so strong that no one was a match for him in the camp. But he was almost unable to hold this little crystal ball!</p><br/><p>Zuo Mo guessed that this crystal ball was tens of thousands of catties heavy.</p><br/><p>He struggled to put the crystal ball into his ring. He released a breath. The strange corpse had solved a great problem for him. After being sealed, the crystal ball was unattractive and unassuming. As long as no one reached to take it, no one would think that this non-descript crystal ball was at least a top sixth-grade material.</p><br/><p>After the strange corpse threw the crystal ball to Zuo Mo, he did not show any more intentions of acting. He did not hurry them and started to examine people who were forging.</p><br/><p>All of the members of the Golden Crow Camp were furiously processing. This chance to practice with fifth-grade materials would likely never appear in front of them again.</p><br/><p>Suddenly, the strange corpse appeared next to Zuo Mo and said, “A sandstorm is coming.”</p><br/><p>“Sandstorm?” Zuo Mo first paused and then his expression changed dramatically. Golden Crystal sand was a good material, yes! But if it was sandstorm that was formed from Golden Crystal sand, the power from it… …</p><br/><p>Translator Ramblings: Zuo Mo’s rich!</p><br/>\n</div>"}