{"title": "Chapter Four Hundred and Eleven – Juxtaposition", "id": 411, "volume": 5, "url": "http://boxnovel.org/world-of-cultivation-chapter-four-hundred-and-eleven-%E2%80%93-juxtaposition", "volume_title": "Volume 5", "body": "<h1>Chapter Four Hundred and Eleven – Juxtaposition</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Four Hundred and Eleven – Juxtaposition</p><br/><p>How had he found the position of Yu Heng’s main base?</p><br/><p>It wasn’t just Sang Nan that was surprised. Many battle generals quickly detected this. Every person who did notice, couldn’t help but show a startled look. Xiao Mo Ge’s soldiers were all Flame Boring yao, a soldier type that functioned poorly as a scout.</p><br/><p>But beyond this, Xiao Mo Ge hadn’t performed any scouting but had found the other’s location.</p><br/><p>“This guy,” a battle general said emotionally, “has great luck!”</p><br/><p>The other battle generals nodded. Randomly marching in a direction, and it was the correct direction. His luck was astoundingly good!</p><br/><p>Listening to the discussion around him, Sang Nan did not speak. He was uncertain inside. He could not tell if Xiao Mo Ge really was just lucky. To not need scouts and still be able to grasp the geography of the board, it only required that your consciousness was strong enough. But this kind of perception was not limitless. The bigger the battlefield, the larger the consciousness had to be to accomplish this. In large scale battles, the information obtained by a battle general’s consciousness was like a drop in the ocean. A large number of scouts were needed to get a sufficient amount of information.</p><br/><p>For any battle general, information on the battlefield was what they based their commands on.</p><br/><p>Sang Nan had never seen a battle general that did not need to send out any scouts, and the strangest thing was that the other actually determined the correct direction! At this moment, even he believed that this person had great luck.</p><br/><p>But why did he still have a foreboding sense of danger … …</p><br/><p>———</p><br/><p>Gongsun Cha’s consciousness was spread out like a net. Everything within fifty li was within his grasp. He quickly found the remaining traces of presence in the air. This was a presence he was unfamiliar with, and different than any combat yao he had encountered before. It should be a soldier type he had not seen before.</p><br/><p>He narrowed his eyes. Amongst the burning desire for battle, the light of calm flashed.</p><br/><p>His consciousness silently rippled. Without pausing, the snowflake avalanche made a smooth and sharp turn, advancing in a wave like spilled mercury, they silently and rapidly advanced.</p><br/><p>A seemingly simple maneuver caused a wave of exclamations. Even Pu Yao’s eyes flashed with a thread of shock.</p><br/><p>Directing troops to turn at high speed was a basic skill of a battle general. The more people there were, the harder it was. The faster the maneuver was, the harder it was. This was a move that every battle general could do, and one of the moves that strained and tested the fundamental skills of a battle general.</p><br/><p>Silver battle generals needed to easily control about one thousand combat yao to complete a turn at high speed.</p><br/><p>Five thousand was the requirement of a golden battle general!</p><br/><p>Was … … was this guy already at the skill level of a golden battle general?</p><br/><p>“Gongsun Shidi’s consciousness is really nimble!” Zuo Mo couldn’t help but praise. Even though he did not understand the intricacies of being a battle general, he could see the wonders of it with a glance.</p><br/><p>To give orders to five thousand people at once didn’t just require a strong consciousness, it required a sensitive one. There was no wonder why Zuo Mo was shocked. Fine manipulations like this were something he had been the most skilled at. No matter if it was ling power or consciousness, he could not be considered strong, but he was always abnormally sensitive.</p><br/><p>“Is it the fiend soul beast beads?” Pu Yao said to himself.</p><br/><p>The consciousness control that Gongsun Cha displayed far surpassed his skill in the last match. He had progressed this quickly in such a short amount of time? The first thing that Pu Yao thought of was the fiend soul beast beasts because he knew that Gongsun Cha had been furiously consuming fiend soul beast beads in this past while.</p><br/><p>Could fiend soul beast beads cause the consciousness to become more sensitive?</p><br/><p>Pu Yao’s guess was not incorrect. Gongsun Cha’s consciousness had changed due to these fiend soul beast beads. Gongsun Cha’s talent in cultivation was very average, and greatly limited his development as a battle general. He had spent great thought to create his own battle general core scripture, but being of average talent, the rate of improvement could not satisfy him.</p><br/><p>Lil’ Miss started his crazy cultivation plan when he had joyfully discovered that processing fiend soul beast beads were of benefit to his consciousness! He spent almost all of his time on processing the fiend soul beast beads, and around this time, the hunting missions had also begun. A continuous hunting made so he did not need to worry about the supply of fiend soul beast beads.</p><br/><p>When it came to a problem regarding being a battle general, the shy and bashful Lil’ Miss would accidentally display his insanity!</p><br/><p>This time was not an exception!</p><br/><p>Before he even understood the fiend soul beast beads, he had unhesitatingly gambled with himself. Because he knew that if he wanted to progress, he had to solve the problem of his weak consciousness. He desired victory! For victory, he was willing to take greater risks!</p><br/><p>He had gambled correctly. His consciousness had grown three times and was now much more sensitive than before.</p><br/><p>“Fiend soul beast beads?” Zuo Mo also showed a thoughtful expression. He suddenly thought about the golden souls he possessed. He had been busy this while. Other than the ones used by Gongsun Shidi, Pu Yao, and Wei, he had not used the other golden souls.</p><br/><p>He had really been too busy and forgotten such an important thing.</p><br/><p>Zuo Mo couldn’t help but mock himself.</p><br/><p>———</p><br/><p>On the board, Gongsun Cha’s speed was extremely fast. Following the minuscule remnants of presence, the enormous Flame Boring yao army was like a red flow of snow that snaked its way towards the opponent’s base.</p><br/><p>It wasn’t luck! Sang Nan’s heart beat wildly.</p><br/><p>The other battle generals also saw the strangeness. “Hm, that’s weird. This boy can’t be lucky with every decision. How can he be right every time?”</p><br/><p>“Yes! So strange!”</p><br/><p>“Does this guy have a dog’s nose?”</p><br/><p>“Even a dog can’t do this!”</p><br/><p>The sounds of discussions rose. He Mei’s face was puzzled. She wasn’t a battle general and she was confused listening to the discussion. She asked Sang Nan curiously, “What are they speaking about?”</p><br/><p>Sang Nan patiently explained, “They are speaking about how Xiao Mo Ge knew the position of Yu Heng’s main base without using scouts.”</p><br/><p>“Right!” He Mei realized. “No wonder I felt something was weird. I didn’t see Xiao Mo Ge’s scouts.” She then asked confusedly, “How can Xiao Mo Ge know the position of Yu Heng’s main camp without using scouts?”</p><br/><p>Sang Nan said in a quiet voice, “Flame Boring yao are not suited to being scouts. Their speed isn’t slow, but it isn’t fast. Even more important is that they cannot conceal themselves. Xiao Mo Ge probably has a secret technique that can find the presence that the other’s scouts have left behind.”</p><br/><p>The surrounding conversation stopped. Everyone listened keenly. Sang Nan was greatly talented, and had once received the title of “Best Young Battle General” three years in a row. The amount of trophies and titles he had won was incomparable to most of his peers. Of the young generation of battle generals, he would definitely rank in the top five. Many of the elders in the military thought highly of him.</p><br/><p>He had unexpectedly become Ming Yue Ye’s follower and had given up the chance to become a commander of a corps, which had caused his reputation to fall greatly. These past few years, he had rarely appeared in public, but stayed low-key by Ming Yue Ye’s side. But no one would doubt the title of the first battle general of the Genius Alliance.</p><br/><p>“Look closely. The advancing path of Xiao Mo Ge is the route one of Yu Heng’s scouts had just taken while retreating.”</p><br/><p>Everyone finally showed expressions of realization. No wonder he could make such accurate decisions; Xiao Mo Ge had such a powerful secret technique.</p><br/><p>At this time, this red snowflake flood encountered some of Yu Heng’s scouts. Yu Heng had found Xiao Mo Ge’s position long ago. In order to obtain more information, he had sent more scouts in this direction.</p><br/><p>When these scouts saw the troops, they couldn’t help but be shocked and then instantly started to retreat. Some scouts attempted to plant messenger trees and pass the news back to the camp. But Gongsun Cha would not give them the chance. With a wave of his hand, his troops instantly overwhelmed their scouts.</p><br/><p>These scouts did not have the time to send back their reports before they died.</p><br/><p>Seeing this, the other scouts ran even quicker.</p><br/><p>Gongsun Cha did not hesitate. He directed his troops to closely follow behind these scouts. He maintained an appropriate distance and did not give them the chance to plant messenger trees.</p><br/><p>In the yao world, information was sent mostly using messenger trees. Scouts would carry the seeds of messenger trees on them. They only needed to plant the seeds, and the messenger tree would sprout and grow in a very brief period of time to fruit and produce seed. The fruit of the messenger tree would shatter into a multi-colored mist that would turn the information into pictures and sound to transport it back.</p><br/><p>It was possible to exchange information using the seeds of one messenger tree. It was very convenient but there was a flaw, it required time. It took about fifteen minutes for the seed to grow and bear fruit. Normally, fifteen minutes wasn’t anything, but in times of urgency and danger, this fifteen minutes became a fatal flaw.</p><br/><p>The scouts right now lacked the required fifteen minutes.</p><br/><p>Gongsun Cha’s troop suddenly divided up. The troops that had been like a flood suddenly divided into six large snowflakes. Each large snowflake was made from about eight hundred Flame Boring yao. They were like six high-speed blades. The troops on the right and left wings began flanking the enemy forming an arc that tightly followed the scouts and forced them together.</p><br/><p>One group running and one group chasing, after one hour of this chase, Gongsun Cha’s troops reached the outskirts of Yu Heng’s main base.</p><br/><p>All the yao gaped at this scene.</p><br/><p>What … … what strategy was this?</p><br/><p>In war chess that was larger in scale, the struggle between the two sides would usually take forty to sixty hours, or even longer. The vast geography was enough space allowed for deeper strategies and to outflank each other. The two sides usually needed to experience multiple rounds of spying, probing, skirmishes, and to pressure and squeeze each other’s territory before the final battle.</p><br/><p>For this war chess match that was of a much grander scale, many battle generals had prepared to watch for three days and nights.</p><br/><p>But Xiao Mo Ge that never acted within the expected norms and this time was not an exception. He didn’t construct a base, didn’t plant yao trees, upon starting, he took all his troops and charged straight at the other’s main camp. What strategy was this?</p><br/><p>“Such, such a hooligan!”</p><br/><p>A battle general unconsciously murmured, but this caused all the battle generals that felt suffocated to suddenly breathe properly!</p><br/><p>Right! Hooligan! This was a hooligan!</p><br/><p>Only those hooligans that did not care about technique and fought on the street would be like this, taking all their people and charging straight at the front gates… …</p><br/><p>Sang Nan felt he had swallowed a fly, his entire body felt uncomfortable. Xiao Mo Ge’s snowflake shaped formation moved like it was a bolt of lightning that tore the clouds apart, and this stunned him. The secret technique he used was also unfathomable. All the signs lead him to be filled with anticipation about the following battle.</p><br/><p>But that kind of anticipation definitely was not for this unreasonable charge on the front gates!</p><br/><p>Right, it was unreasonable! He seemed to be watching a skilled sword warrior who, after a string of dazzling sword moves, suddenly threw away his treasured sword, and take up the pig-butchering cleaver and howling as he savagely charged.</p><br/><p>Where was the strategy? Tactics? Technique?</p><br/><p>The strong juxtaposition was so uncomfortable Sang Nan almost spat blood.</p><br/><p>At this time, Gongsun Cha did not pause and directly started his attack. In Sang Nan’s eyes, the beauty of the snowflakes and everything else disappeared! He seemed to see a snarling butcher smile as he hacked, with the pig-butchering cleaver, at the other’s head like he was killing a pig!</p><br/><p>Translator Ramblings: Such a letdown … … poor Sang Nan and the rest were expecting so much.</p><br/>\n</div>"}