{"title": "Chapter Four Hundred and Twenty Seven – Black Leech Defense Line", "id": 427, "volume": 5, "url": "http://boxnovel.org/world-of-cultivation-chapter-four-hundred-and-twenty-seven-%E2%80%93-black-leech-defense-line", "volume_title": "Volume 5", "body": "<h1>Chapter Four Hundred and Twenty Seven – Black Leech Defense Line</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Four Hundred and Twenty Seven – Black Leech Defense Line</p><br/><p>“Is this route really safe?” Nian Lu muttered. His hands were not affected by what he said, fingernail sized white lotuses were rising and falling. Nian Lu’s personality was lively and his cultivation method was also different than other people.</p><br/><p>Lei Peng lovingly caressed the Gold Crystal broadsword with an intoxicated look.</p><br/><p>Ma Fan chewed a stalk of green grass, his head pillowed on his arms as he looked at the sky. The sky inside the ship was just an illusory formation, but it was so life-like it caused people to feel their minds relax. The sky of the Seal Extinction battlefield seemed to be dyed with blood, so pressuring it robbed people of hope. No one wanted had to see that.</p><br/><p>“We’ll only know if we go through,” Ma Fan said lazily.</p><br/><p>“It’s better if it’s not safe!” Lei Peng rumbled. In the days after waking up, he had seemed to be a completely different person, silent and stoic. When he had gotten the Gold Crystal broadsword, he finally became normal again, and even more battle-thirsty than before. His eyes flashed with the desire to battle, his large hands continuously caressing the broadsword. Anyone that accidentally saw this scene felt coldness rise up.</p><br/><p>Ding ding ding!</p><br/><p>Sharp and shrill sounds of the alarm suddenly sounded.</p><br/><p>“You crow’s mouth![1]” Ma Fan sword. Before his words landed, he jumped up from the ground and turned to a dash of sword light. Lei Peng and Nian Lu did not dare to slack off. Their figures both turned to sword lights and disappeared.</p><br/><p>Inside the Black Turtle, sword lights flashed across the sky.</p><br/><p>———</p><br/><p>“These are … … mo?” Zuo Mo didn’t dare to be certain. The images from the mirage formations on the outside of the ship and passed back into the inside, but the strange people in the images were unfamiliar to everyone.</p><br/><p>“Yes!” Gongsun Cha’s expression was serious. Other than the mo which looked strange, what he cared about more was that black river that extended behind them. That river was about ten zhang wide, the water was inky black. It was like an enormous earthworm that seemed to curve its body slowly.</p><br/><p>Gongsun Cha recognized this black river. In war chess, he frequently had to meet it. That wasn’t a river, it was a defensive line. What was flowing slowly inside it was not some kind of black water, but something called Black Leeches.</p><br/><p>Black Leech defense line, one of the most commonly used defensive lines of the mo. He had tripped up over this many times.</p><br/><p>Zuo Mo and Lil’ Miss’ expressions were slightly bad. They had tried their best to avoid the three factions at war, and hadn’t expected to encounter the mo’s defense lines!</p><br/><p>Zuo Mo instantly realized where the problem had occurred. It was the jie map. They had chosen the route based on the jie map that Ming Jue zi had provided, but living in the yao world, Ming Jue Zi only knew the details of yao defense lines, and only knew the general shape of the mo defense lines.</p><br/><p>This was relatively distant from the mo rearing sea of the mo. The mo had pushed their defensive line so far in!</p><br/><p>Zuo Mo was shocked inside.</p><br/><p>He knew what this meant! This meant that the mo had not encountered any pressure which was why they were so unconstrained.</p><br/><p>However, he wasn’t in the mood to worry about others. The problem right in front of them was that the mo will think of them as enemies!</p><br/><p>The problem they had tried so hard to avoid still happened!</p><br/><p>“Charge through it!” All of the solutions furiously flipping through his mind once, he unhesitatingly ordered.</p><br/><p>Lil’ Miss understood. A Black Leech defense line was not enough to make him panic. The Black Leech defense line was just ten zhang wide. It was very thin. He had many methods to overcome it, but right now, they only needed the simplest method.</p><br/><p>That was right, charge through it!”</p><br/><p>The Black Turtle suddenly accelerated!</p><br/><p>———</p><br/><p>“They’re charging … … charging over!” Xi Ye gaped in shock at the black ship charging towards the defense line like a moth to a flame.</p><br/><p>Lan Qing also was stunned. Even though this was just a sentry post, and the black leech line wasn’t secure, but it wasn’t something that a little ship like this one could deal with.</p><br/><p>This tiny ship was probably a scout boat. Scout boats mostly were used to carry scouts. Their speeds were fast and they were very nimble, but their defensive abilities were weak. The scouts inside were harder to deal with. Those that were scouts were definitely the elite.</p><br/><p>It was impossible to charge through the ten zhang thick Black Leech defense line with a little boat like this.</p><br/><p>The little black boat was extremely quick. It was like a bolt of lightning which provided more evidence for what Lan Qing guessed.</p><br/><p>The moment the little black boat reached the defense line, the silent Black Leech defense line suddenly started to roar. Countless tiny black leeches rained down on the little black boat.</p><br/><p>The black leeches were a very ferocious insect swarm species. Their reproductive abilities were very strong. Mature leeches were about three cun in length, completely black, and shaped like a shuttle, with only one eye. Their territorial instincts were very strong. Any being that invaded their territory would encounter their ferocious attack.</p><br/><p>Just a charge from the black leeches could rival a full power blow from a mo captain!</p><br/><p>The attacks of a Black Leech defense line was endless, and counted in tens of thousands. Even true mo brigadiers did not easily dare to provoke these little beings.</p><br/><p>The non-descript little boat was instantly drowned in the flood of black leeches.</p><br/><p>Pia pia pia! A dense sting of pops sounded like rain. The entire defensive lines moved angrily. The sharp hissing unique to black leeches filled the eardrums.</p><br/><p>Hm, that wasn’t right … …</p><br/><p>A hint of puzzlement flashed through Lan Qing’s eyes. He felt that something wasn’t right.</p><br/><p>“How come there’s no explosion?” Xi Ye rubbed his head with dejectedness.</p><br/><p>Lan Qing’s body froze, and his expression froze on his face.</p><br/><p>He finally knew what wasn’t right! That little boat hadn’t exploded yet! Hit by tens of thousands of black leeches at once, the most rational result was to explode into pieces instantly!</p><br/><p>But … …</p><br/><p>Ever since the little black boat entered the defense line, the speed greatly decreased as though it went from being a bolt of lightning to a turtle. It was drowned by countless black leeches, causing it to look like a thick black leech ball. There wasn’t any part of the ship showing, but … …</p><br/><p>The black leech ball was slowly moving forward. The movement rate was very slow as though it was just squirming but it really was moving forward. As thought … … the black leeches were pushing it slowly forward!</p><br/><p>Crossing the ten zhang defense line did not take up much time.</p><br/><p>When the black leech ball reached the other side of the defense line, the layers of black leeches scattered like an avalanche and revealed the black ship inside!</p><br/><p>Lan Qing’s pupils suddenly constricted!</p><br/><p>The ship was still unblemished. There were no changes in shape, no marks, it looked just the same as before.</p><br/><p>He was not the only one surprised by this, the entire base was silent! All the mo soldiers had frozen expressions on their bodies.</p><br/><p>The Black Turtle that left the black leech defensive lines sped up!</p><br/><p>Lan Qing shook and reacted. He said urgently, “Alarm! Quick! Send the alarm!”</p><br/><p>Before he finished speaking, he saw Xi Ye charge out. He knew it wasn’t good. Gritting his teeth, he hurriedly followed.</p><br/><p>———</p><br/><p>Successfully charging through the Black Leech defense line, cheers sounded inside the Black Turtle. They had all been frightened by the fierce attacks from the Black Leech defense line. At this time, the cheers were unusually loud.</p><br/><p>“Holy, that frightened me to death. Lucky that our turtle shell is thick enough!”</p><br/><p>“We cannot underestimate the mo, without Lil’ Turtle, we may not have been able to go through!”</p><br/><p>“You guys are weak, ge was so calm! Can these little worms break our shell, the number one shell in the world? Are you joking? Our Lil’ Turtle has been tempered in the Golden Crystal sand storms!”</p><br/><p>“Please, I saw your expression change just then … …”</p><br/><p>Everyone excitedly discussed the recent danger.</p><br/><p>Compared to the high mood below, Zuo Mo and Lil’ Miss did not show any signs of relaxing. Their action just now was akin to poking the hornet’s nest. Since the other had set up sentries here, then a mo army was definitely not far away.</p><br/><p>The battle had just started.</p><br/><p>“I’m going to prepare.” Lil’ Miss turned and left with a calm expression.</p><br/><p>The Black Turtle was strong defensively, but on the battlefield, if one just purely defended, even the strongest shield would eventually break.</p><br/><p>Zuo Mo stared hard at the jie river, his mind furiously turning. It seemed impossible to avoid a hard battle, but for them, the most important was not to win, but to quickly leave the battlefield behind and charge out of Bloody Sky Metropolis Jie.</p><br/><p>What he was most worried about was being dragged down by the mo army. That was a road to death! His group seemed numerous, but compared to the most important defense line of the mo, they weren’t enough to fill the gaps of the mo’s teeth.</p><br/><p>He was pondering where else the mo had set up defenses.</p><br/><p>As for the battle, he did not need to worry at all. Lil’ Miss could complete everything perfectly.</p><br/><p>The cheers inside the ship gradually calmed. Everyone’s expressions became stern. Lil’ Miss’ orders reached every person: Prepare to battle!</p><br/><p>The Black Turtle raced on murderously!</p><br/><p>———</p><br/><p>Zuo Mo could not have imagined that the situation here was far more complex than he had thought. Just like how the mo had pushed the defense line to this place, in reality, its surroundings were filled with scouts from all factions.</p><br/><p>These elite individuals were carefully hidden in the bloody mist like ghosts.</p><br/><p>When the Black Turtle broke through the bloody mist, it attracted the attention of all the scouts.</p><br/><p>When the Black Turtle unexpectedly charged through the Black Leech defense line, it caused restlessness among the hidden scouts. News passed down at a frightening speed back to the battle generals of all the factions.</p><br/><p>Bloody Sky Metropolis Jie which had gradually calmed down and settled into a faceoff suddenly changed weather because of a little black ship!</p><br/><p>———</p><br/><p>Bing Lan narrowed her eyes. “It is a xiuzhe ship?”</p><br/><p>“Yes! Even though there are no insignias on it, but it is a talisman forged by xiuzhe,” the vice commander nodded and said.</p><br/><p>“Why have they suddenly attacked the mo defense line? A little ship, what can it do?” Bing Lan tapped the table and said to herself.</p><br/><p>“We speculate this ship has become lost,” the vice commander respectfully reminded. “This ship is not ordinary, and so the people on it are not ordinary.”</p><br/><p>Bing Lan thought for a moment and then said lightly, “Pass the news to Liang Wei. He knows what to do.”</p><br/><p>———</p><br/><p>“You are saying it is one of our ships?”</p><br/><p>The middle-aged person was authoritative. He showed a pondering expression on his face.</p><br/><p>“Yes, Daren!” The vice commander was also slightly puzzled. “But we did not receive any news from the brass.”</p><br/><p>“So it’s like that … …” The middle aged person was thoughtful.</p><br/><p>The vice commander did not speak. He stood with a slight bow waiting for orders.</p><br/><p>“Who is closest to there?” the middle aged person asked.</p><br/><p>The vice commander knew that Daren had made a decision and hurried to answer, “It is Ming Lie Daren!”</p><br/><p>“Tell him to keep a close watch. He can move according to the events, and decide for himself,” the middle aged person said.</p><br/><p>[1]Crow mouth: someone who brings bad things about by talking about them.</p><br/><p>Translator Ramblings: I’m a tiny black turtle, watch me squirm, watch me crawl and watch me get out alive!</p><br/><p>Also, it is the Hei Gui, not the Hei Wang Ba even though that doesn’t make it any better in terms of what you guys now thinks it alludes to.</p><br/>\n</div>"}