{"title": "Chapter Four Hundred and Twenty Eight – Conspiracy", "id": 428, "volume": 5, "url": "http://boxnovel.org/world-of-cultivation-chapter-four-hundred-and-twenty-eight-%E2%80%93-conspiracy", "volume_title": "Volume 5", "body": "<h1>Chapter Four Hundred and Twenty Eight – Conspiracy</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Four Hundred and Twenty Eight – Conspiracy</p><br/><p>“I wonder how Eldest Shixiong is doing right now,” Ming Lei gazed at the expanse of bloody mist and said emotionally.</p><br/><p>The deep fiery red cloak he was wearing floated up in the wind and flapped. Ming Lei’s posture was as straight as a sword, his two sharp brows tilted upwards into his hair, his eyes narrow and had a sharp presence.</p><br/><p>“Who knows? Likely better than us! I’m really sick of this ghastly place,” a round-faced youth beside Ming Lei muttered. On his back was a normal Pine Script Sword. He looked as though he hadn’t woken up from his sleep. He was Ming Lei’s shidi, Song Yuan.</p><br/><p>Ming Lei’s expression was slightly helpless as he said, “You, you, you have no ambition, so many people want to get in and earn more merit! You, from the first day, you’ve been muttering about going back!”</p><br/><p>Song Yuan snorted. “Merit? One needs their little life to experience that!”</p><br/><p>Ming Lei smiled. “The more afraid you are on the battlefield, the easier it is for you to die.”</p><br/><p>“I only have one life, I won’t get more if I die.” Song Yuan glanced at Ming Lei. “I’m different from battle maniacs like you. Ye likes peace!”</p><br/><p>Ming Lei knew Song Yuan’s temperament and wasn’t angry. He said in puzzlement, “I’m just wondering why Shidi is so nervous? In terms of the past, the yaomo were greatly wounded in the great war three thousand years ago, and our xiuzhe’s Four Realm Heaven is full of talents, and have reached the most prosperous moment of our recent ten thousand years! It is easy to see who is weak and strong with a glance. Recently, Eldest Shixiong used a scheme and the yao were greatly wounded. Even in this Bloody Sky Metropolis Jie, we are not losing. What is Song Yuan Shidi worried about?”</p><br/><p>Song Yuan smiled coldly. “I’m just worried you guys are underestimating the heroes of the world!”</p><br/><p>Ming Lei stilled and then said with a smile, “Kun Lun, Xi Xuan, Xuan Kong, and Tian Huan which realm isn’t full of heroes? To say nothing else, just our Kun Lun has as many battle generals as the clouds, experts like rain! Are so many disciples unable to satisfy Shidi’s worries? What about Eldest Shixiong?”</p><br/><p>Song Yuan was silent for a beat before he said, “Eldest Shixiong’s genius is undoubted.” He raised his head to look into the distance and said in a light voice, Actually, not just Eldest Shixiong, even you, Ming Lei Shixiong, are a top battle general. How can I not know what we are good at? But for some unknown reason, my heart beats wildly.”</p><br/><p>Ming Lei showed a thoughtful expression.</p><br/><p>“You know when people like me cultivate to such a level, our sword heart is strong and not affected by outside demons, but I still feel unsafe,” Song Yuan said with a sigh and spread his hands, “maybe I’m just worried needlessly.”</p><br/><p>Ming Lei was a detail-oriented person. He studied as a battle general, and Song Yuan cultivated the sword scripture of the sect, and had a more sensitive intuition of danger. “Does Shidi feel that something is not right?”</p><br/><p>Song Yuan shook his head. “I do not know, which is why I feel so uncertain.”</p><br/><p>Just at this time, a sword light flew from the horizon. Song Yuan beckoned with his hand and the sword light landed in his palm. He moved his hand and there was a little sword on it.</p><br/><p>Ming Lei picked up the little sword and light flashed through his eyes. “Let’s go, we have a mission.”</p><br/><p>———</p><br/><p>Liang Wei’s expression was cold as he stared at the little black boat. When he had received the order, he had been roaming around this area and coincidentally seen the Black Turtle break through the Black Leech defense line. But he hadn’t expected that the Black Turtle would so easily go through the Black Leech defense line.</p><br/><p>As a silver battle general, of course he knew how powerful this Black Leech defense line was!</p><br/><p>The grade of this nondescript little black ship was far greater than he had predicted, if it was able to easily go through the defense line. Even the stupidest person knew now that the identities of the xiuzhe inside the little ship were definitely not ordinary.</p><br/><p>Maybe the people inside were major … …</p><br/><p>Liang Wei unconsciously licked his lips, the fire of battle-thirst flickering in his eyes. The scar on his handsome face was abnormally sinister.</p><br/><p>He forcibly suppressed the battle intent burning inside. Yao and mo were allies but the other definitely would not let them enter the defense line easily. Receiving permission to enter the defense line was only possible under one situation, when they were unable to hold it.</p><br/><p>This little ship was definitely not simple, and its defensive capabilities would not be so weak.</p><br/><p>Liang Wei was like a lone wolf in the wilderness that was silently waiting for an opportunity.</p><br/><p>———</p><br/><p>The breakthrough of the Black Turtle past the Black Leech defense line was like pouring a bucket of cold water into a pot of boiling oil. The situation instantly exploded!</p><br/><p>Three groups of mo soldiers came from three different directions like three floods.</p><br/><p>With the strange corpse gone, the pressure Pu Yao felt greatly decreased. He became lively again, and resumed acting as though he was the leader. “Battle generals are different. Xiuzhe battle generals emphasize deduction, while yao battle generals emphasize consciousness; both emphasizing control of the troops. But Mo battle generals? They emphasize bravery!”</p><br/><p>“Emphasize bravery?” Zuo Mo was slightly shocked. It had to be said that individual bravery was not so important in large scale battle. If one jindan xiuzhe encountered one or two dozen ningmai, then it was a secure victory. If a jindan encountered a well-trained troop of fifty, then that was a very dangerous situation. If they encountered one hundred well-trained ningmai, then they had to run.</p><br/><p>Jindan were high level soldier types among the military, but they were cannon fodder used to wear down high level soldiers. This was an ancient tactic that was still very effective. So in the military, each jindan would also have the protection of an entire troop of ningmai.</p><br/><p>So the effects of personal bravery were not evident in large scale battles.</p><br/><p>“You’ll know when you see it.” At this important time, Pu Yao kept a secret again.</p><br/><p>Zuo Mo was so angry he almost swore but he still managed to resist. Inside, he recorded another mark against Pu Yao.</p><br/><p>But Pu Yao’s words still successfully stirred Zuo Mo’s interest. He started to pay close attention to these mo soldiers.</p><br/><p>———</p><br/><p>The three groups of mo soldiers raced from three directions. The Black Turtle that just broke through the Black Leech defense line ended up surrounded once again.</p><br/><p>Gongsun Cha was motionless, his eyes straight and his expression still.</p><br/><p>Some people from the Shield Guard Platoon discussed in low voices.</p><br/><p>“Is Daren daydreaming? Daren has seemed slightly weird since his seclusion last time!” The person who spoke was slightly worried. This kind of thing had happened multiple times before. Ever since the last seclusion period, Gongsun Cha frequently wandered off in his mind.</p><br/><p>“When was Daren ever normal … …” Another person rolled his eyes.</p><br/><p>“That’s so true!” Everyone nodded. These words really struck their hearts.</p><br/><p>“So, this is good, better than Daren smiling.”</p><br/><p>“Daren’s bashful smile … …”</p><br/><p>Everyone simultaneously shuddered. They seemed to recall something terrible and all of them felt cold.</p><br/><p>“Oh,” An ambiguous sound came from Gongsun Cha’s mouth. His dull eyes became focused again as he smiled shyly, “let us begin!”</p><br/><p>Receiving the order, Vermillion Bird Camp instantly charged out!</p><br/><p>In the air, many sword lights shot out of the Black Turtle at the same time. The dazzling and beautiful sword lights were like fireworks that exploded in the air!</p><br/><p>The suddenly appearance of the Vermillion Bird Camp frightened everyone!</p><br/><p>No matter if it was Xi Ye and Ming Qing, or the three groups that were forming a circle at the front, or Liang Wei hiding in the bloody mist, they all changed expressions!</p><br/><p>The multi-colored sword lights were sparkling in the air but the yaomo were not in a mood to admire this beauty. Sharp inhales rose.</p><br/><p>No one had expected this nondescript little ship was able to hold so many sword xiu!</p><br/><p>The average outer appearance, the strong defensive capabilities, the carrying capacity that could rival intermediate and large sized treasure ships!</p><br/><p>What kind of ship was this?</p><br/><p>No one knew, but every mo battle general that had any experience could smell the danger contained inside! This kind of ship was like the assassin in the dark that could strike a fatal blow at the crucial moment!</p><br/><p>Thinking about thousands of sword xiu being transported to the backlines without any signs and at the moment the fighting was the fiercest, thousands of sword xiu appearing behind them … …</p><br/><p>The yaomo’s hearts suddenly felt cold!</p><br/><p>———</p><br/><p>Xi Ye gave a sky-shaking bellow. His eyes turned green!</p><br/><p>From the day he joined the military, it was the first time that any enemy had broken into his territory so easily! He felt shame at his display just now, complete shame!</p><br/><p>He charged at the very front!</p><br/><p>All the mo soldiers at the front shouted angrily in unison. Without hesitating, they followed Xi Ye and leapt at the black ship!</p><br/><p>At this time, the thousands of multi-colored sword lights filled Xi Ye and Lan Qing’s visions. They were completely stunned!</p><br/><p>Bone-aching coldness caused their limbs to feel cold!</p><br/><p>Xi Ye suddenly howled angrily. His eyes were almost completely crisp green, and his body made to charge!</p><br/><p>Lan Qing’s eyes and hands were fast. He pulled Xi Ye back and shouted. “Send the news! Quick! Send the news to Daren!”</p><br/><p>Xi Ye shook and reacted. He looked gratefully at Lan Qing and hurriedly took out a black insect from his bosom. He closed his eyes. A moment later, a drop of blood welled up on his fingertip. Xi Ye swiped the bead of blood on the head of the armored insect and the blood bead burrowed into the head of the armored insect rapidly.</p><br/><p>The armored insect hissed and then suddenly disappeared from Xi Ye’s hand.</p><br/><p>———</p><br/><p>Looking dazedly at the sky full of sword lights, Liang Wei did not detect that his limbs were so cold they were freezing. There was only one thought in his mind.</p><br/><p>This was a conspiracy! A conspiracy of the xiuzhe!</p><br/><p>A devious ambush!</p><br/><p>Liang Wei’s expression was ferocious, his hands tightly balled, his eyes filled with hate as he stared at the sky full of sword lights. Gradually, he relaxed his fists, and his eyes became calm again.</p><br/><p>He did not start moving immediately to go help the allies even though he knew that the other would definitely accept their help. But if this was a planned ambush, then the moves of the xiuzhe would not end with just this!</p><br/><p>Calmed down, Liang Wei displayed astounding powers of judgment. With quick thought, he was able to judge—</p><br/><p>—the xiuzhe definitely would have reinforcements coming!</p><br/><p>He instantly sent out concealed scouts that stood guard in the surroundings.</p><br/><p>The scouts quickly passed back the information. A xiuzhe troops were approaching at a fast speed.</p><br/><p>A thread of coldness flashed through Liang wei’s yes. The scar on his face was also murderous.</p><br/><p>As expected, they had come!</p><br/><p>Translator ramblings: You guys remember Liang Wei, right?</p><br/>\n</div>"}