{"title": "Chapter Four Hundred and Twenty Nine – Mo Battle Methods", "id": 429, "volume": 5, "url": "http://boxnovel.org/world-of-cultivation-chapter-four-hundred-and-twenty-nine-%E2%80%93-mo-battle-methods", "volume_title": "Volume 5", "body": "<h1>Chapter Four Hundred and Twenty Nine – Mo Battle Methods</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Four Hundred and Twenty Nine – Mo Battle Methods</p><br/><p>Ming Lieand Song Yuan were really to be pitied, calamity flew straight at them as they were ambushed by Liang Wei. Even though the ambush did not cause too many fatalities as Ming Lie had maintained his guard, but it still caused them to become disarrayed.</p><br/><p>Liang Wei’s hatred of xiuzhe was carved deep into his bones after experiencing his last battle. Most of his troops were the lucky survivors of the Ice Frost Corps. Seeing Ming Lie and the others, his eyes instantly became bloodshot and murderous.</p><br/><p>One side had prepared for a long time, the other was responding hurriedly, even though Liang Wei’s division did not have any experts, but they still suppressed Ming Lie’s troop.</p><br/><p>Ming Lie’s expression was grave. The configuration of the troop in front of them was not highly skilled, but their technique was fierce and they were fearless!</p><br/><p>His gaze landed on the young and handsome battle general in the middle of the formation, and was filled with shock. Ming Lie knew the military ranking of yaomo very well. This troop that was pressuring him was not one of the core corps of the yao! And this young battle general was just a silver battle general!</p><br/><p>How was this possible?</p><br/><p>When did the normal yao corps have such skill? When did a silver battle general become his equal?</p><br/><p>His successive countermeasures were ineffective against the other. Five breaths! Five continuous breaths! Ming Lie had sent out six orders, but the state of the two sides had not changed at all!</p><br/><p>Song Yuan’s expression also became serious. He was not a battle general but he could feel it more clearly. He felt as though they had landed in an enormous web and could not muster the strength to escape no matter what!</p><br/><p>A sword xiu that was ten zhang away from him was hit by several yao arts at the same time. With a wail, the entire person shattered into ice powder!</p><br/><p>Wails rose and fell. The other side’s cooperation was very high. The level of the yao arts were not high, but as they cooperated, their power was very astounding. A hint of grief flashed through Song Yuan’s eyes. Dying on the battlefield, even their souls could not escape!</p><br/><p>The yao arts and sword lights illuminated the sky. Some entered the bloody mist and caused it to shift.</p><br/><p>The collision between the two was brief but fierce!</p><br/><p>———</p><br/><p>Liang Wei remained unaffected and coldly stared at the other. His consciousness was spread like a huge net, every detail of the battlefield happening within his grasp. The defensive light shields of a combat yao at the very front was shattered by several sword lights at the same time. He didn’t even manage to make a sound before he turned into a spray of blood.</p><br/><p>[Ice Heart Tundra] silently circulated, the heart like an icy tundra, unaffected by anything. Liang Wei had been very favored by the corps commander, who had secretly passed him the top yao art of the Ice Frost Corps, [Ice heart Tundra].</p><br/><p>Liang Wei might just be a silver battle general, but after experiencing that difficult battle of protecting the rear during the retreat, he had completely been reborn. Upon detecting this, the Council of Elders permitted him to lead a troop.</p><br/><p>Liang Wei knew the advantages and disadvantages of the two sides. He had no experts so he definitely could not enter a face off. The other’s experts were constantly being protected. If one wanted to use numbers to exchange for the experts deaths, the sacrifice was too high.</p><br/><p>Having made a successful attack, they did not linger and retreated!</p><br/><p>The bloody mist that covered Blood Sky Metropolis Jie was the best concealment for yaomo. Thousands of combat yao retreated in unison, their ranks organized. The combat yao that were at the end had lights flashing on their hands.</p><br/><p>———</p><br/><p>“Stop!” Ming Lie shouted. He called back his subordinates that were planning on chasing after the enemy. The other’s formation was organized and there were no weaknesses.</p><br/><p>Ming Lie’s expression was black. A counter-attack would only cause them to land in the other’s trap.</p><br/><p>The results of the battle quickly came out. Ming Lie had lost nearly eighty people, and the other had lost just six. Such a skewed loss ratio was like a loud slap that landed on his face.</p><br/><p>The cold and indifferent gaze of the other as he had left was like the sharpest scorn. A silver battle general dared to be so arrogant in front of him!</p><br/><p>Ming Lie took a deep breath to maintain his calm.</p><br/><p>Song Yuan perceptively did not speak. Truthfully, he had also been stunned by that ferocious wave of attacks. He had started to gather experience on the outside world from when he was very young, and encountered many dangerous situations. But only today did he know that the dangers he experienced before was just child’s play compared to war.</p><br/><p>In the blink of an eye, eighty people’s lives were erased. How cruel was this!</p><br/><p>But what caused him to feel cold was the cool eyes of that young yao battle general that had no emotion. One successful attack without any lingering behind, so clean and crisp it was scary. Looking at Ming Lie’s black face, Song Yuan knew that just how terrible his shixiong’s mood was right now.</p><br/><p>He did not understand battle generals but he did know that Ming Lie Shixiong’s skill in Kun Lun was among the top. Otherwise, their sect wouldn’t have given the first battle to him.</p><br/><p>If the news that Ming Lie Shixiong had been tripped up on the hands on an unknown yao battle general spread back to the sect, it would definitely cause a great ruckus.</p><br/><p>This place was really full of danger!</p><br/><p>Song Yuan’s heart felt even more insecure.</p><br/><p>———</p><br/><p>The fighting behind them did not attract Zuo Mo’s attention. His attention was completely on the three groups of mo that were rushing at them. He looked very closely. Pu Yao’s character was usually poor but he would not speak nonsense.</p><br/><p>Upon close study, he instantly made a new discovery. Mo battle generals were different than yao battle generals!</p><br/><p>Yao battle generals used their consciousness to control the troops. The troops were like limbs that advanced and retreated together. Mo battle generals did not care for troop formations at all. They were an unsightly mess and sprawl.</p><br/><p>But … …</p><br/><p>In Zuo Mo’s vision, the presences of those unorganized mo soldiers were tightly gathered together! The presences of hundreds of mo soldiers were gathered into a ball. Once it was one being, the pressure instantly was completely different!</p><br/><p>Zuo Mo seemed to see hundreds of muscles criss-crossing and joining together, tensing and turning into a fist!</p><br/><p>The three groups of mo soldiers were like three powerful fists!</p><br/><p>“The mo battle methods turn the complex into the simple, gather many into one, power overcoming technique, seemingly simple and extremely effective. The mo battle general is the only one of the three kinds of battle generals that requires a person to be individually brave.” Pu Yao’s tone then changed. “Your brain is stupid, you are more suited for the mo battle methods.”</p><br/><p>Zuo Mo was eager as he looked on. “How can I gather many into one?”</p><br/><p>“Oh, Wei knows,” Pu Yao said irresponsibly.</p><br/><p>Wei opened his eyes with slight helplessness, and looked in dissatisfaction at Pu. Ever since he encountered the strange corpse and saw an existence even more ancient than his, Wei’s desire to find a successor unconsciously faded greatly. Waking up from his obsession, he finally realized what he had guarded in the past had been lost in the river of time.</p><br/><p>The oath carved on the gravestone was only treasured by himself.</p><br/><p>Pu Yao could still encounter the descendants of his past fellows, and this maintained the connection between him and the world, he was not abandoned by time. Yet Wei was too ancient, so ancient that nothing could have been left.</p><br/><p>The strange corpse went to find his place of birth. Wei found with a grimace that he didn’t even have a target to search for.</p><br/><p>Wei’s desire to find a new successor drastically dropped. Wei, who had always wanted to show his existence, was disinterested when Pu Yao threw the problem at him.</p><br/><p>He said casually, “This is hard to learn.”</p><br/><p>“Harder than learning the mo physique?” Zuo Mo asked.</p><br/><p>Wei stopped breathing and finally remembered that this person was a freak that easily cultivated the Great Day mo physique that ranked second among colonel mo physiques!</p><br/><p>“It is not as difficult as mo physiques.” Wei decided to say the truth.</p><br/><p>“Then teach me!” Zuo Mo’s request burst out. He tried to widened his glistening eyes, and gave a desirous and fawning expression towards Wei.</p><br/><p>In terms of shamelessness, Wei was clearly not Zuo Mo’s opponent. He could only say, “Mo physique and battle general are two different things, I do not know much.”</p><br/><p>But when he saw Zuo Mo’s face turned towards him like a sunflower, he intelligently gave up on struggling. “Mo battle generals are truly different than other battle generals. The first thing they need to learn is to echo with the power of their comrades.”</p><br/><p>“Echo with the power of comrades?”</p><br/><p>Wei released a breath. The shameless expression on that face finally disappeared. He felt much more at ease and continued, “Yes, the power of mo is the power of the fleshly body, of the true self. Only by echoing with the power of one’s comrades can one communicate with one’s comrades. The directions of power is much faster and accurate than sound!”</p><br/><p>“So it’s like this … …” Zuo Mo was thoughtful.</p><br/><p>Wei suddenly smiled. He spread his hands. “Don’t ask me how to echo the power of comrades. I don’t know either, I’m just a gravestone armor.”</p><br/><p>He hadn’t lied. For some unknown reason, when he saw Zuo Mo’s brow tightly furrowed, Wei’s mood that had just been helpless became much lighter.</p><br/><p>“Echo the power of comrades … …” Zuo Mo pondered. He seemed to comprehend something, but when he thought deeper, he had nothing.</p><br/><p>Immersed in thought, Zuo Mo directly forgot the fight that was happening now.</p><br/><p>A moment later, he suddenly raised his head, excitement unable to be disguised from his face. Without another word, he jumped up from the ground and ran away!</p><br/><p>———</p><br/><p>Compared to Zuo Mo’s new discoveries, Gongsun Cha was entirely familiar with the mo battle methods. In war chess, he had faced all kinds of enemies. Even though the battle methods present were not the same as Pu Yao’s battle methods in war chess, they were of the same vein.</p><br/><p>To Gongsun Cha, there was no difference.</p><br/><p>Three section wave killing charge!</p><br/><p>The multi-colored sword energies that had bloomed in the air brightened up!</p><br/><p>Howling sounded and filled the eardrums. In a brief amount of time, the sword xiu of Vermillion Bird Camp pushed their speed to the max!</p><br/><p>The sword lights formed waves that charged at the three groups of mo soldiers!</p><br/><p>Compared to the past, the present Vermillion Bird Camp was undoubted more mature. When they performed their trademark three section wave killing charge, they were even more masterful. The waves made from sword energies were not as ferocious and sharp as before, but were more bouncy, as though there was an invisible thread that connected all the sword energies.</p><br/><p>The two sides collided!</p><br/><p>A strange scene occurred.</p><br/><p>Like waves, the sword energies gathered and scattered. They were like blades that danced about like butterflies, continuously slicing layers off the mo soldiers.</p><br/><p>The sword energies criss-crossed!</p><br/><p>In a blink, half of the mo soldiers were dead or wounded!</p><br/><p>This scene stunned the entire field.</p><br/><p>His chest full of fury and battle intent, Xi Ye’s body that just started to move seemed to be pulled to a complete stop by an invisible hand. He looked in disbelief at the waves of sword energies as though a basin of cold water was poured over his head, his limbs cold! Beside him, Lan Qing and the other mo soldiers were shocked!</p><br/><p>When the black-faced Ming Lie saw this scene, it was as though he was paralyzed.</p><br/><p>Inside the bloody mist, Liang Wei’s pupils suddenly shrank, his expression changed greatly, and his body entirely cold!</p><br/><p>Translator Ramblings: Wei’s so humble. Information dump.</p><br/>\n</div>"}