{"title": "Chapter Four Hundred and Twenty Six – Bloody Sky Metropolis Jie", "id": 426, "volume": 5, "url": "http://boxnovel.org/world-of-cultivation-chapter-four-hundred-and-twenty-six-%E2%80%93-bloody-sky-metropolis-jie", "volume_title": "Volume 5", "body": "<h1>Chapter Four Hundred and Twenty Six – Bloody Sky Metropolis Jie</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Four Hundred and Twenty Six – Bloody Sky Metropolis Jie</p><br/><p>“The news that the Ice Frost Corps was almost completely wiped out has been reported back. The Council of Elders have ordered our battalion to travel immediately to the front lines. Daren has sent down the order to clean the surroundings. We needed to sweep this entire area before the situation is stabilized.”</p><br/><p>Mu Xi listened carefully and her heart couldn’t help but shake. The female yao in front of her was very tall and was the vice commander of Bing Lan Daren. Her tone was cold and distant which caused it to be unpleasant to hear but Mu Xi did not feel any dissatisfaction. Her heart was actually full of respect. The other said it so plainly, but Mu Xi could imagine the cruelty in this.</p><br/><p>Bing Lan Daren’s move seemed idiotic, but it was truly transformative and had gotten rid of all hidden weaknesses.</p><br/><p>“I heard that your performance on the last mission wasn’t bad, so Daren decided to transfer you over. Please do not fail Daren’s hopes,” the female yao said faintly.</p><br/><p>“Yes!” Mu Xi solemnly responded. She finally understood. So it had been Bing Lan Daren that had requested her transfer. However, she found it even stranger. How did Daren know of her?</p><br/><p>She might have been an important person of the younger generation from the Palace Lake Wood Clan, but in all of the yao world, she really was an unknown person. Her performance in the last mission could only said to be competent but average. In terms of fame, she was not as famed as Liang Wei, the only leader that had survived the previous battle, much less that mysterious and uncanny genius, Xiao Mo Ge.</p><br/><p>When she received the order to go to the front lines to assist Bing Lan Daren, Mu Xi’s shock could be imagined.</p><br/><p>“Also, Liang Wei has also come.” The female yao paused. “But his situation is not the same as yours. He wishes for battle and has offered himself to fight. Bing Lan Daren has agreed to his battle plan. You only have to know this, you do not need to pay attention to him.”</p><br/><p>“Starting from today, you are responsible for the defenses of Area Number Three. Go see your subordinates. Farewell!” The female yao turned to leave after she finished.</p><br/><p>When the female yao walked away a long distance, Mu Xi inhaled deeply.</p><br/><p>Was this the battlefield?</p><br/><p>———</p><br/><p>“We’re finally out!”</p><br/><p>It was unknown who said this but it instantly ignited everyone’s emotions. Cheers and yells filled the Black Turtle! The nervousness and uncertainty that had accumulated on their minds were completely vented in this moment! These hardened men that had endured the test of countless battle were like children, some murmuring to themselves, others hugging each other, and some flying about frantically!</p><br/><p>Among the cheers of these people, the strange corpse’s troop seemed abnormally silent.</p><br/><p>The strange corpse’s grey eyes were empty and lifeless.</p><br/><p>Noticing the strange corpse’s unusual state, Zuo Mo suppressed the joy inside and ran over. “What is it? We finally got out of that ghastly place! Really got out! Aren’t you happy?”</p><br/><p>The strange corpse did not reply. He said calmly, “I need to leave.”</p><br/><p>“Leave?’ Zuo Mo froze. The strange corpse was very strange but after this period of contact, Zuo Mo felt the other was very good and their interactions had been very harmonious. He couldn’t help but ask, “Where do you plan to go?”</p><br/><p>“To find my homeland.”</p><br/><p>“Homeland?” Zuo Mo stilled. Place of birth, this phrase was very unfamiliar to him.</p><br/><p>“Yes. I hope that we can meet again in the future,” the strange corpse said calmly, “my name is Shi.”</p><br/><p>It really was a strange name. Zuo Mo shook his head inside and shook off the thread of melancholy that had formed. He hung a bright smile on his face. “Thank you, without you, I wouldn’t have had the ability to gather those things.”</p><br/><p>“No burden at all,” Shi said faintly. “I’m going.”</p><br/><p>As the sound landed, the strange corpse’s troupe disappeared.</p><br/><p>Having already noticed the disturbance on this side, Wei Sheng and the others hurriedly came over.</p><br/><p>“He’s gone,” Zuo Mo spread his hands, “to find his place of birth.”</p><br/><p>The others showed expressions of realization.</p><br/><p>Other than Zuo Mo feeling some melancholy, the others didn’t feel anything at the departure of the strange corpse. It was the opposite. Without the strange corpse present, everyone felt much lighter. Even though the strange corpse had appeared friendly along the way but his immeasurable strength still put pressure on everyone.</p><br/><p>Zuo Mo quickly throw away his emotions and called Wei Sheng, Lil’ miss and the others together.</p><br/><p>“We’ve come out of the damned ghastly place, but that does not mean that we are safe,” Zuo Mo spoke first.</p><br/><p>Gongsun Cha nodded. “Yes, if our previous speculations are correct, this should be the Bloody Sky Metropolis Jie, a battlefield! We must leave Bloody Sky Metropolis Jie at the fastest speed possible, otherwise … …”</p><br/><p>Lil’ Miss did not continue but everyone understood what he meant. Bloody Sky Metropolis Jie was the place where the fighting between xiuzhe and yaomo was the fiercest. If they were careless in the slightest way, and were pulled into a battle, there wouldn’t be anything left of them.</p><br/><p>They really belonged to the camp of xiuzhe, but none on the Black Turtle were willing to seek the help of xiuzhe. Undoubtedly, the xiuzhe battle generals here would be disciples of those large sects. The people here, if they weren’t from Sky Moon Jie, they were from Little Mountain Jie. They didn’t have any good feelings towards those large sects.</p><br/><p>And if they were chanced upon by yaomo, they didn’t need to even think about that result.</p><br/><p>“Go ask, who has the jie river for Bloody Sky Metropolis Jie?” Zuo Mo thought and said, “We don’t even know the directions here, we can only blindly blunder here.”</p><br/><p>Everyone instantly scattered.</p><br/><p>Zuo Mo rubbed his forehead. The trouble really came wave after wave. They had just left behind the ancient battlefield only to enter another dangerous place. The present Bloody Sky Metropolis Jie was not a peaceful place. The grounds of the former Yao Hunt were now the playground of yaomo.</p><br/><p>Yaomo … …</p><br/><p>Zuo Mo’s mind moved, and a thread of joy rose. How had he forgotten about the Ten Finger Prison! Zuo Mo hurriedly entered the Ten Finger Prison. Nan Yue and Cang Ze were not present, but Ming Jue Zi was fortunately present.</p><br/><p>“Daren wants the jie map for Bloody Sky Metropolis Jie?” Ming Jue Zi said after thinking, “That is not hard but it might take some time. Daren, is it urgent?”</p><br/><p>“En, very urgent!” Zuo Mo unhesitatingly nodded, and released a breath inside.</p><br/><p>“Understood!” Ming Jue Zi instantly left the Ten Finger Prison.</p><br/><p>The rock in Zuo Mo’s heart nodded. He could only wait for Ming Jue Zi’s news now. As expected, the other people came back in a short while. None of the xiuzhe in his camp had gone to Bloody Sky Metropolis Jie before. Zuo Mo did not go into the details but told everyone that there would be news in a few days. He ordered them to set up defenses, and to especially send out more sentries as this place was not safe.</p><br/><p>Truthfully, Zuo Mo did not worry too much about safety. The Black Turtle might have a boring name but it was true to its name. From when they left the Golden Crystal sand sea, and encountered a string of dangers, the powerful defense of the Black Turtle had safely overcome them all. Even the strange corpse had praised the Black Turtle.</p><br/><p>Many people disdained this name for not being flashy enough, but since Boss had named it, everyone had perceptively closed their mouth.</p><br/><p>Ming Jue Zi’s efficiency was very high. On the second day, he had obtained the jie map for Bloody Sky Metropolis jie. Like how the humans hunted yao, there were also yaomo that hunted xiuzhe. From very early on, there had been many yaomo that secretly entered the Bloody Sky Metropolis Jie. The jie map of the Bloody Sky Metropolis Jie had started to circulate from that time on.</p><br/><p>This jie map even labeled the yaomo defensive lines. This defense line wasn’t a secret.</p><br/><p>Zuo Mo had found a treasure.</p><br/><p>With this jie map, they were not blind anymore. Zuo Mo and Lil’ Miss started to study it. The only ones that had the ability to come up with ideas for this kind of action was just Zuo Mo and Lil’ Miss.</p><br/><p>The two found their general position on the jie map and started to search for routes.</p><br/><p>What reassured them was Bloody Sky Metropolis Jie was connected to many places. In other words, they could secretly enter a xiuzhe jie without alerting the xiuzhe guards.</p><br/><p>The two schemed for a long time and finally chose a route that seemed relatively safe.</p><br/><p>As to whether it was truly safe or not, that would only be known when they went through.</p><br/><p>The Black Turtle was like a black light that silently flew in the Bloody Sky Metropolis Jie’s sky.</p><br/><p>Bloody Sky Metropolis Jie was also shrouded in bloody mist, but it was far less dense than the fiendish energy of the Sealed Extinction battlefield. To other xiuzhe, they would feel constrained in such an environment, but for Zuo Mo and his group, this wasn’t a problem.</p><br/><p>Bloody Sky Metropolis was made from seven intermediate jie as the axis and forty nine little jie as the protective screen, its vastness could be imagined.</p><br/><p>———</p><br/><p>“I heard the losses on that side are very high.” The mo who was speaking had a black green horn at his forehead. It meant he was a green rhinoceros mo. His entire body was covered in thick black green armor, and his smile was filled with scorn.</p><br/><p>“It’s very normal. If Daren hadn’t had the foresight to turned this area into a Mo Breeding Sea, we couldn’t escape either.” The one who spoke was a handsome fox mo. Under the light blue hair was a pair of jewel eyes. The lips were thin and tense, and his tone was slightly lazy. This caused him to seem slightly seductive.</p><br/><p>“So boring! I thought we would have a good fight. Who knew we just stand guard all day. Moss is growing on my body!” As the rhinoceros mo complained, he glanced into the blood mist in the distance before giving up and lying back down.</p><br/><p>“When it’s time to fight, you won’t think this.” Lan Qing glanced at his good friend.</p><br/><p>The two were best friends from a young age. When they were recruiting, he originally hadn’t wanted to come. Who knew that Xi Ye had ran to register and had also registered him. Therefore, no matter how unwilling he was, he had to follow and come.</p><br/><p>But regarding the matter of A Ye registering him, he didn’t have any anger. The two had played together from infancy. If A Ye had signed up alone, he would have definitely followed anyway. If he wasn’t present, this guy would cause calamities!</p><br/><p>No one had expected that A Ye received favor from the Shen Yue Mo General due to his bravery and had been rapidly promoted. As the vice commander to this guy, Lan Qing was in charge of all military affairs so A Ye did not create a mess.</p><br/><p>Shen Yue Mo General had been sent to the front lines with an important mission.</p><br/><p>A Ye’s battalion was responsible for guarding this area. Their position was relatively forward and was a forward operating base.</p><br/><p>At this time, Lan Qing’s expression changed slightly. He suddenly jumped up from the ground. “Not good! Enemy!”</p><br/><p>“Enemy! Where, where?” A Ye also followed in jumping up with an excited expression.</p><br/><p>A small black ship came out of the bloody mist.</p><br/><p>Translator Ramblings: Some of you were so close. The ship is the Black Turtle.</p><br/><p>Also, Shi’s name is written as  which means corpse … … Zuo Mo has been calling him  (strange corpse) in the past chapters so I’m not sure if Shi decided that he’ll use that as his name or his name really was Shi in the past.</p><br/>\n</div>"}