{"title": "Chapter Four Hundred and Forty Six – A Shocking Statistic", "id": 446, "volume": 5, "url": "http://boxnovel.org/world-of-cultivation-chapter-four-hundred-and-forty-six-%E2%80%93-a-shocking-statistic", "volume_title": "Volume 5", "body": "<h1>Chapter Four Hundred and Forty Six – A Shocking Statistic</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Four Hundred and Forty Six – A Shocking Statistic</p><br/><p>“From today onwards, this cloud island’s name is changed to Turtle Island!” Zuo Mo announced in satisfaction.</p><br/><p>No one below responded, but they all looked at each other.</p><br/><p>A beat later, the most daring of them, Lei Peng, weakly responded, “Daren why call this Turtle Island?”</p><br/><p>“What? You feel this name isn’t good enough?” Zuo Mo angled a stare at him as he drawled.</p><br/><p>“No! No!” Lei Peng hurriedly waved his hand, his face red before he said weakly, “Just that, Just that, this name … … it isn’t … … flashy?”</p><br/><p>The other people were all distressed.</p><br/><p>Zuo Mo snorted and said with disdain, “A thousand year tortoise, a ten thousand year turtle, ever heard this before?”</p><br/><p>“Heard this!” People nodded their heads.</p><br/><p>“The longer one lives, the more profit one can make,” Zuo Mo warned everyone in a meaningful tone. “Look at those flashy guys, show-offs, all of them are short-lived, why? Because they are eye-catching! What was that phrase … …”</p><br/><p>Zuo Mo couldn’t recall it and thought with a furrowed brow.</p><br/><p>“Say what?” The people below stretched their necks and waited for his next words.</p><br/><p>“Oh, I remember.” Zuo Mo’s mind became alert. He spread his arms, looked at the sky and dragged his words in a tone that created goosebumps to recite with emotion. ”His outstanding figure was so dazzling among the crowd, like a sun, he was unable to be ignored!”</p><br/><p>Everyone shuddered, their hairs standing on end.</p><br/><p>Zuo Mo turned his head down and his gaze swept the crowd of confused people. His tone became normal as he picked out Lei Peng to ask, “If there was a person like this among the enemy, what would you do?”</p><br/><p>“Kill him as soon as possible!” Lei Peng glared murderously.</p><br/><p>“Why kill him first?” Zuo Mo lead him along.</p><br/><p>“A person like this is either an expert or a leader, they have higher … … strategic value!” Lei Peng stammered out. Under Lil’ Miss’ high pressure training, learning combat tactics became a necessary class for every member of Vermillion Bird Camp. Even a rough man like Lei Peng could casually speak a few phrases.</p><br/><p>“You are right!” Zuo Mo praised Lei Peng and said amusedly, “The spear strikes the bird that pops up first, that is the moral. The more low-key you are, the longer you can live. The longer you live, the more you can make. A name like Turtle Island that doesn’t catch the attention is suitable for us. Our method is to first be low-key, pretend to be weak, and then, hee hee, you know!”</p><br/><p>Everyone realized and nodded their heads hard, their eyes gleaming with light. They looked at each other and smiled evilly at each other. “Hee hee, we understand!”</p><br/><p>Coincidentally walking in at the same moment, Shang Wei Ming’s cold sweat flowed down.</p><br/><p>He really wanted to tell Daren what a large influence killing the three Ren Family elders would have on Xu Ling City’s inhabitants. Xu Ling City was most likely in an uproar at this moment. No matter how low-key or weak they pretended to be, no one would believe them … …</p><br/><p>Of course, these words only spun in his mind. He smartly closed his mouth. Boss definitely had Boss’ reasons for doing a thing. A little character like him definitely could not understand the profound meaning of Boss’ action.</p><br/><p>He already knew that Boss wasn’t just a boss. This was a classic combat troop. However, that had nothing to do with him. No matter what the other had him do, he would unhesitatingly do it, even at the risk of his own life.</p><br/><p>When the evil laughs in the room decreased, he reported the assets of Turtle Island to Zuo Mo. “Daren, we have finished our survey.”</p><br/><p>When Zuo Mo held the result, his eyes were wide.</p><br/><p>The area of Turtle Island was forty seven thousand mu. Zuo Mo had to sigh that Turtle Island was, as expected, one of the largest islands of the intermediate-sized islands. The next string of statistics caused Zuo Mo to start drooling.</p><br/><p>There were fifteen thousand mu of ling fields on the island, of which ten thousand were third-grade ling fields and another three thousand were fourth-grade ling fields.</p><br/><p>Seeing such enormous numbers, his thoughts almost diverged. The entire Wu Kong Sword Sect had never had so many ling fields in the past, much less third-grade ling fields! Such an large amount of third-grade ling fields was enough to support a sizable sect. Adding on that the three thousand mu of fourth-grade ling fields was an enormous sum of wealth!</p><br/><p>They had struck it rich!</p><br/><p>Deliriously happy, Zuo Mo’s gaze moved down and then he suddenly froze.</p><br/><p>Ten thousand mu third-grade ling fields but they only had thirty ling plant farmers!</p><br/><p>Thirty ling plant farmers!</p><br/><p>Compared to the enormous amount of ling fields, the number of ling plant farmers was not enough! Thirty ling plant farmers, not one of them had the Summer Flower Jade Medal, they were all Spring Sprout ling plant farmers!</p><br/><p>This meant that almost ten thousand mu of the third-grade ling fields were in fallow! A spring spout level ling plant farmer could only plant and care for fifty mu of third-grade ling fields at maximum for a total of one thousand and five hundred mu! On their hands, the fourth-grade ling fields were an even larger waste, and could not reach their full potential.</p><br/><p>Thinking about the ten thousand ling fields being in a state of waste, Zuo Mo instantly felt pain.</p><br/><p>“Is it hard to hire ling plant farmers?” Zuo Mo asked Shang Wei Ming.</p><br/><p>Shang Wei Ming shook his head. “Not easy. Even though many roaming xiu have come recently, but there still aren’t many ling plant farmers. Many families are recruiting ling plant farmers.”</p><br/><p>Zuo Mo bared his teeth with a painful expression. He secretly noted down this problem.</p><br/><p>Wastefulness was shameful!</p><br/><p>Zuo Mo quickly found that it wasn’t just the ling fields that were not being utilized to their full capacity.</p><br/><p>There were thirty six ling springs on the island, but only six were being used, and even then they only raised very normal kinds of animals.</p><br/><p>There were three ling lakes on the island but not even one of them was in use. Each ling lake was surrounded by weeds. Supposedly, the three Ren Family elders were not interested in the ling lakes at all, and hadn’t even cleared out the weeds.</p><br/><p>The one asset developed the most was a cave on the island, Snow Silkworm Cave. This cave was extremely deep and cold. There was a herd of Snow Cloud Silkworms living in the cave. The silk that the snow cloud silkworms produced were flowing cloud silk. This was an upper fourth-grade material and was easy to sell. The flowing cloud silk was the biggest source of annual income on the island.</p><br/><p>There were many other caves on the island but none of them had been explored and used.</p><br/><p>When Zuo Mo finished reading the report, his first feeling was, the Ren Family was really wasteful!</p><br/><p>His second feeling, they had really struck it rich!</p><br/><p>But the first decision Zuo Mo made was to order everyone to explore the entire Turtle Island. With this kind of slacker mentality from the three Ren Family elders, Zuo Mo felt that the possibility they had missed good things was very high.</p><br/><p>Forty seven thousand mu was not a small area. How to set up defenses was also a problem. This headache would be given to Gongsun Cha to deal with.</p><br/><p>Zuo Mo’s thoughts were completely focused on how to use the resources of Turtle Island.</p><br/><p>———</p><br/><p>“The Ren Family was killed?”</p><br/><p>“Really? How can the Ren Family be killed? They have three jindan!”</p><br/><p>“It’s true! I heard that only three people in the group fought and there was another that watched. Miss Ren also died, she was the cause of the conflict!”</p><br/><p>“Ha, I’ve said it before. With Miss Ren’s personality, she would cause the Ren Family to die!”</p><br/><p>“The Heavens really sent a blessing this time!”</p><br/><p>“But we need to be careful in the short-term. People that casually killed the Ren Family are not ones that us little people can provoke!”</p><br/><p>Just as Shang Wei Ming had predicted, Xu Ling City was in an uproar over the news that the Ren Family was destroyed. The cloud islands near Turtle Island acted as though they were facing a great enemy, fearing that this group of unknown origins had malicious intents towards them.</p><br/><p>———</p><br/><p>At the Tian Family, the elders that were in charge gathered together in a hall with serious expressions.</p><br/><p>“I hadn’t thought that the Ren Family would be destroyed like this.” Tian Yong Qing sighed. “The three Ren Family jindan gone like this. The world has changed too quickly.”</p><br/><p>“Don’t speak of useless things.” Tian Heng Bo had an unconcerned expression. “This group of unknown origins have taken over the Ren Cloud Island, that is land that we have planned to obtain! Fifteen thousand mu of ling fields with more than three thousand mu of fourth-grade ling fields, the rest are all third-grade ling fields! Not to speak of the flowing cloud silk produced on the island, the Ren Familly got rich based on just that!”</p><br/><p>“If we can have Ren Cloud Island, our power would immediately go up a level!” another elder said. “I hadn’t expected that a group of outsiders got ahead of us!”</p><br/><p>Everyone was silent. The Tian Family was most skilled ling farming and their desire of ling fields was much greater than other families. They had been planning for a long time and were preparing to take Ren Cloud Island soon. But Zuo Mo’s group had appeared out of nowhere and gotten there before them.</p><br/><p>“Do not move rashly,” Tian Yong Qing said after a moment of thought. “We do not know the origins of this group. If we move now, it is hard to predict the results. Should we send someone to ask if they sell this island? The price can be negotiated!”</p><br/><p>“Who would be so dumb to sell such a good place?” Tian Heng Bo did not believe it.</p><br/><p>“That might not be the case,” Tian Yong Qing said with a smile, “No matter how many ling fields they have, without ling plant farmers, they can only go to waste! The only thing the other might be reluctant to part with is the flowing cloud silk.”</p><br/><p>The elders smiled. About seven-tenths of the ling plant farmers on the Xu Ling City market worked for the Tian Family. The third grandpa of the Tian Family was skilled in ling farming and was a high level ling planter farmer with a autumn fruit jade medal. These ling plant farmers mostly wanted to improve so they entered the Tian Family.</p><br/><p>Possessing the highest number of ling plant farmers, the Tian Family’s desire for ling fields was also the highest but the cloud island with the most ling fields near Xu Ling City did not belong to the Tian Family, but was Ren Cloud Island.</p><br/><p>“If it is like that, it might not be impossible,” another elder spoke, “maybe we can use Star Cloud Island to trade. There is a fourth-grade star cloud metal mine on the island, and it isn’t lacking compared to the flowing cloud silk!”</p><br/><p>Hiss, many elders inhaled sharply. That star cloud metal mine produced good fourth-grade star cloud metal, and was one of the important sources of income for the Tian Family.</p><br/><p>“This price is too high!” Tian Heng Bo had a pained expression.</p><br/><p>Tian Yong Qing waved his hand. “Do not hurry. They have just arrived. If it wasn’t for that Ren Qing being stupid and provoked them, they wouldn’t be so arrogant and aggressive! Right now, we shall observe and slowly come into contact with them.”</p><br/><p>“If they use force?” an elder said in worry.</p><br/><p>Tian Yong Qing lightly laughed. “If they think that because they destroyed the Ren Family, they can provoke our Tian Family, that is their death day!”</p><br/><p>Looking at the puzzlement on everyone’s faces, Tian Yong Qing said faintly, “After one or two months, Eldest Grandfather is coming out of seclusion.”</p><br/><p>The elders paused and then showed ecstasy.</p><br/><p>Tian Yong Qing seemed to feel that one piece of good news wasn’t enough and continued, “The other good news is that our Tian Family Battalion, Tian Ye is coming back!”</p><br/><p>It was deathly silent. Many elders showed terror.</p><br/><p>Translator Ramblings: Turtle/tortoise is also another term for “bastard” “wang ba” in Chinese. Also, no rest when one is rich … … no one will make trouble for poor people, you’re only worth targeting if you are rich.</p><br/><p>I also bought an actual keyboard to type on rather than the one that came with my laptop which is very nice.</p><br/>\n</div>"}