{"title": "Chapter Four Hundred and Forty Five – Ren Cloud Island", "id": 445, "volume": 5, "url": "http://boxnovel.org/world-of-cultivation-chapter-four-hundred-and-forty-five-%E2%80%93-ren-cloud-island", "volume_title": "Volume 5", "body": "<h1>Chapter Four Hundred and Forty Five – Ren Cloud Island</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Four Hundred and Forty Five – Ren Cloud Island</p><br/><p>Bam!</p><br/><p>A glowing snake-like stream of water flowed at high speed suddenly exploded against the wall. The stream of water instantly turned into countless beads of water that scattered in all directions.</p><br/><p>The water that splashed on the ground squirmed as though they were alive moving along the floor. The water drops quickly gathered in one location. In a short time, they had once again merged into a figure made out of water.</p><br/><p>Second Ren was amazed. The power of this man was deep! When this man punched, there was no fist energy, no sound, it was calm and ordinary. But no matter how he dodged, he could not avoid it. When the fist struck his body, his body would be scattered!</p><br/><p>But if it was just that, he would not be afraid. Water was shapeless. No matter how strong the other’s punches were, even if it could scatter his body into tiny beads of water, he could gather himself back together without taking any damage. He had defeat many opponents by relying on this undying method.</p><br/><p>But the other’s fists were very strange. Each time his body was destroyed, there would be a strange power that entered into his body. This power was as thin as a hair, it was strange and unpredictable. He had never seen it before. This caused him to have a foreboding feeling.</p><br/><p>Even worse was that he could not get near the other at all. The other’s fists were terrifyingly accurate. None of his punches would miss. The shock that Second Ren felt could be imagined. He knew how agile he was, as any flying swords that were slightly slower than him could not hit him.</p><br/><p>This young dhyana xiu in front of him was not simple!</p><br/><p>Second Ren stared tightly at his opponent, killing intent spreading inside. He made a decision. Even at the cost of being wounded, he had to kill this person!</p><br/><p>There had never been a person that dared to step on the Ren Family’s pride so! There had never been a person who dared to harm one hair on a member of the Ren Family!</p><br/><p>Thinking about how Ren Qing had died, Ren Yu felt great sorrow! He and his two brothers only had this one granddaughter. Now even this granddaughter was killed!</p><br/><p>They should die!</p><br/><p>All of these people should die!</p><br/><p>The water essence on his body circulated unusually smoothly. The [Crooked Water Channeling Spell] that he had cultivated for many years, now showed signs of a breakthrough. But Second Ren did not feel any joy at all. There was only one thought in his mind, kill the other person!</p><br/><p>At this time, he suddenly heard an enormous explosion coming from Third Ren’s direction. There was a rolling red ball of fire. His chest suddenly felt great pain!</p><br/><p>Third Brother was dead!</p><br/><p>Second Ren looked away staring angrily at the explosion and fiercely roared like a wild animal!</p><br/><p>“Go die!”</p><br/><p>Suddenly, his body froze, his expression solidifying on his face. The water that shrouded his body stopped flowing. Slender threads resembling blood appeared on the surface of his water.</p><br/><p>His vision quickly became blurred, and the sound of battle became distant to him.</p><br/><p>His mind started to blur!</p><br/><p>The blood threads that had spread like a spider web across his body suddenly lit up.</p><br/><p>Pew!</p><br/><p>The ball of water turned to a ball of white mist and rose up. When the water mist dissipated, there was nothing left at that spot.</p><br/><p>The indifference and emptiness in Zong Ru’s eyes quickly faded. He panted lightly, and a indiscernible expression of exhaustion appeared at his brow. He sighed inside. He was really too weak still. He couldn’t even tolerate the preliminary stage of Attainment Golden Body. However, what really had been effective just now was wish power. If it wasn’t for his wish power, he most likely would not have defeated Second Ren.</p><br/><p>He flew next to Zuo Mo and without speaking, he closed his eyes and started to recover.</p><br/><p>———</p><br/><p>In a blink, two of the three Ren Family elders were killed. Xu Zheng Wei’s face paled in shock.</p><br/><p>What were those strange lines of blood?</p><br/><p>Xu Zheng Wei’s heart felt cold. He rejoiced that he had not helped the three Ren Family elders just now. Looking at the present situation, the Ren Family was going to be finished. Even though Eldest Ren was still in a stand-off with that young sword xiu, but there was still one person on the other side that had not acted yet. The conclusion was clear.</p><br/><p>He didn’t know where this group of outrageously powerful young people that was had sprouted out of. Each of them was deep in power. Greatly impacted, Xu Zheng Wei’s mind worked rapidly. He didn’t have any sympathy for the fall of the Ren Family. The Ren Family was usually arrogant and ostentatious.</p><br/><p>He wondered if these young people were going to settle down here for the long term or were they just passing by. If they were settling down for the long term, the power balance of Xu Ling City was going to change!</p><br/><p>Having lived for a long time in Xu Ling City, Xu Zheng Wei knew as long as it was not outrageous, Xu Ling Sect would not act.</p><br/><p>He decided if the other was going to settle down, then he definitely had to make a good connection with the other. He didn’t worry about the Cloud Pavilion. With his understanding of the young master of the Cloud Pavilion, the other would not be so stupid to become enemies with such a powerful group of lawless brutes of unknown origins.</p><br/><p>Just as Xu Zheng Wei was thinking, the situation changed again.</p><br/><p>Wei Sheng’s eyes showed a hint of disappointment. He shook his head gently. “Pity.”</p><br/><p>As he finished speaking, he raised his head. Without any sound, the void sword essence pushed against the furiously growing flora turning it into dust at an astounding rate and returning it to nothingness.</p><br/><p>The empty sword essence destroyed the last bit of green.</p><br/><p>The sword essence moved like a corrosive poison. It started to spread along the strong green vines. Everywhere it passed, the green vines crumbled into dust until nothing was left. Eldest Ren could not make a sound, and didn’t have the time to react. Like a statue, in front of everyone, he was swallowed by the sword essence and also turned to nothingness.</p><br/><p>Clink!</p><br/><p>A ring feel to the ground.</p><br/><p>Even though he was prepared to make a good relationship with the other, Xu Zheng Wei was still shocked by the scene in front of him.</p><br/><p>The Cloud Pavilion’s guards and shopkeepers were all pale as they shook in the corner. When they saw this group clean up the battlefield taking their spoils, as though no one else was present, their lips couldn’t help but tremble.</p><br/><p>Such a natural display, if they were not brutes that had went through rains of blood, they would definitely not have this demeanour!</p><br/><p>———</p><br/><p>When Shang Wei Ming woke up, he found he was unharmed. He showed a dazed expression. When he was informed that the three Ren Family elders were killed, his head rang and his mind blanked.</p><br/><p>Zuo Mo did not give him the time to digest it, asking straightforwardly, “Where is the Ren Family estate?”</p><br/><p>The spoils of victory from the three Ren Family elder’s bodies were pitifully few. Other than three jade scrolls, Zuo Mo did not find any of importance or significance. Fighting against such powerful enemies, how could they not gain anything?</p><br/><p>Mind blown, Shang Wei Ming instinctively answered, “At Ren Cloud Island.” When the words left his mouth, his mind suddenly cleared and his face changed!</p><br/><p>So malicious!</p><br/><p>Xu Zheng Wei’s heart also shook but he was not as shocked as Shang Wei Ming. In battles of life and death like this, the conclusion would frequently be like this.</p><br/><p>“Ren Cloud Island?” Zuo Mo’s eyes lit up. He hurriedly asked, “How big is it?”</p><br/><p>“Almost fifty thousand mu, it is the biggest intermediate-sized cloud island nearby!” Shang Wei Ming hurriedly answered. “Ren Cloud Island is in a good position and the flowing cloud silk that the island produces is famous in this region.”</p><br/><p>Zuo Mo’s drool almost spilled out!</p><br/><p>More than forty thousand mu, that was a value of more than forty thousand pieces of third-grade jingshi!</p><br/><p>Zuo Mo, who had needed a place to settle down, immediately became excited.</p><br/><p>“Go, go, go! Let’s go see now!”</p><br/><p>———</p><br/><p>The Ren Cloud Island was a flight of four hours from the main island. Zuo Mo took the Black Turtle along when he flew to the Ren Cloud Island.</p><br/><p>When they reached Ren Cloud Island, they found that this cloud island was slightly different than other cloud islands. There were many balls of clouds floating in the sky above the cloud island. These clouds almost completely shrouded the cloud island. It was not possible to see the condition of the island.</p><br/><p>Zuo Mo found it interesting and wanted to go near to study it.</p><br/><p>Once he came near, these slowly moving clouds seemed to be frightened and rippled intensely. In a blink, the snowy-white clouds became inky black!</p><br/><p>Hiss-crack!</p><br/><p>Inside the black clouds, electrical snakes slithered and blinding lights occasionally appeared. Deep thunder could be heard inside the thick black clouds and lightening shot over.</p><br/><p>Zuo Mo jumped in fright. He hurriedly activated Light Void Wings and fled.</p><br/><p>Boom!</p><br/><p>A bolt of lightning with the thickness of a wrist flashed past his previous position and reflected on Zuo Mo’s pale little face.</p><br/><p>If he was struck by such a thick bolt of lightning, then half of his little life would be gone.</p><br/><p>At this time, everyone’s face became serious. Even Gongsun Cha’s expression was slightly ugly. To forcibly take this cloud island, they would have to pay a high price.</p><br/><p>Shang Wei Ming hurried to remind, “Boss, use the island card!” Having escaped with his life from the hands of the Ren Family, he was very grateful to Zuo Mo. He was very clear that if he landed in the hands of Ren Qing, his fate would be worse than death. Due to his gratefulness, he tried to help all he could.</p><br/><p>“Island card?” Zuo Mo stilled. He recalled that there was a jade card among the things he had taken from the three old men’s bodies. He hurriedly took it out.</p><br/><p>There was a cloud engraved on the surface of the jade card. The back of the card was engraved with all kinds of formation scripts.</p><br/><p>Zuo Mo’s consciousness swept the island card. He instantly understood. This island card was used to control the formations on the cloud island. Zuo Mo channelled ling power and shouted, “Open!”</p><br/><p>The jade card in his hand shot out a beam of light that entered the thick cloud layer.</p><br/><p>The black cloud layer that had been rumbling with thunder instantly quieted. The black clouds became white clouds again. The cloud layer retreated to the sides and a broad path appeared in front of them.</p><br/><p>Zuo Mo was overjoyed. He flew down first. The other people seeing the situation followed behind.</p><br/><p>The arrival of Zuo Mo’s group caused a ruckus on the island. However, when Shang Wei Ming announced in a loud voice that the three Ren Family elders were dead, and the Ren Cloud Island had changed owners, these people calmed down. Most of them were hired workers, not servants. To them, they just changed employers. If this boss wasn’t good, they could leave.</p><br/><p>“Daren, are we going to stay here in the future?” Lei Peng asked in a rumbling voice.</p><br/><p>“What? Not satisfied?”</p><br/><p>“Satisfied! Very satisfied!” Lei Peng rubbed his hands, his face full of excitement. “Staying every day in the Black Turtle, an’s bored to death! This place is both big and good … …”</p><br/><p>Everyone was very excited. They had a new territory!</p><br/><p>This group of battlemaniacs had a desire for territory like the desire men had towards women. They had been reluctant to part with the Golden Crow City. Then they had roamed and killed after that. Now that they finally had territory that belonged to them, the excitement they felt could be imagined.</p><br/><p>Without waiting for Zuo Mo to speak, this group sprinted in all directions.</p><br/><p>Zuo Mo raised his head. The sky was clear for ten thousand li. He couldn’t help but tsk in wonder. Looking at the island from the outside, there were layers of clouds blocking their view and nothing of the island could be seen. But looking from the island out, nothing was covered.</p><br/><p>As expected, this was a good place!</p><br/><p>Zuo Mo was very content!</p><br/><p>Translator Ramblings: Coolness factor: Xie Shan &lt; Zong Ru &lt; Wei Sheng. Zuo Mo is at the very bottom since he didn’t even compete.</p><br/>\n</div>"}