{"title": "Chapter Four Hundred and Fifty Five – Immortal Crossing the Sea[i]", "id": 455, "volume": 5, "url": "http://boxnovel.org/world-of-cultivation-chapter-four-hundred-and-fifty-five-%E2%80%93-immortal-crossing-the-seai", "volume_title": "Volume 5", "body": "<h1>Chapter Four Hundred and Fifty Five – Immortal Crossing the Sea[i]</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Four Hundred and Fifty Five – Immortal Crossing the Sea[i]</p><br/><p>“Speak!” Zuo Mo said. He was calculating on how to best sell Golden Crow Fire. Even though he had saved Shang Wei Ming, he did not put great importance on him, he had only given Shang Wei Ming affairs to manage because he was familiar with the local area.</p><br/><p>Shang Wei Ming gathered his courage and spoke, “Daren, since we do not have enough ling plant farmers, why don’t we forge some ling plant talismans? Or even sell some ling plant talismans. This way, we can use all of our ling fields!”</p><br/><p>Zuo Mo slapped his head. Right, how had he forgotten this? It seemed that it had been too long since he had worked on ling fields, and his skills had deteriorated! With good ling farming talismans, these ling plant farmers would be able to cultivate a significantly larger amount. Sun Bao and Ji Wei’s eyes lit up. Forging talismans was what they were best at.</p><br/><p>Zuo Mo’s mind having been suddenly opened, his thoughts became nimble. Other than talismans, there were also ling beasts skilled in ling plant farming!</p><br/><p>By combining talismans and ling beasts they could work together and they could take care of more ling fields!</p><br/><p>Shang Wei Ming had not finished speaking. He counted on his fingers as he said, “Since we cannot recruit any ling plant farmers, we can nurture our own! We can start a ling farming class. Right now, the city had many kinds of cultivation classes and the business is booming. On one hand, we can make jingshi, and on the other, we can educate ling plant farmers for our own use, or the production xiuzhe that we need. This is beneficial for the future!”</p><br/><p>Zuo Mo dazedly looked at Shang Wei Ming with a heated gaze.</p><br/><p>Genius!</p><br/><p>He had almost missed such a powerful genius! To be able to think of such a clever idea, what was he except a genius?</p><br/><p>Shang Wei Ming’s suggestion instantly received everyone’s support. They might not have come up with this idea, but they could see its quality at a glance. Snag Wei Ming’s idea could accomplish multiple aims and was greatly beneficial to the long-term development of Turtle Island.</p><br/><p>Zuo Mo had been worried about not having a way to make jingshi, but he wasn’t worried at all now.</p><br/><p>He already started to calculate, what did he have the most of? People!</p><br/><p>It was perfect for creating cultivation classes!</p><br/><p>Wei Sheng’s Sword Lecturing Hall, that was a high-end sword xiu cultivation class. The cost would be one piece of fourth-grade jingshi every two hours. What? You think it is too pricy, we don’t do discounts!</p><br/><p>Xie Shan would also open a sword essence class. He would work with the sword essence formation and provide the service for comprehending sword essence. Oh, sword essence was such a good thing, the price cannot be cheap! What? No money? No money, what are you cultivating sword essence for?</p><br/><p>Yi Zheng and Zong Ru would open a dhyana xiu cultivation class. Yi Zheng was from Great Buddha Temple and had great knowledge. Zong Ru’s battle experience was high, had an abhinna and his cultivation was in jindan!</p><br/><p>A perfect, golden, and luxurious team!</p><br/><p>For forging cultivation class, the masters Sun Bao and Ji Wei could take turns with the other people of Golden Crow Camp as assistants. They could also display their Golden Crow Fire and advertise at the same time.</p><br/><p>Cheng Shidi would give animal husbandry classes. That guy would probably be unwilling, but since he took ge’s jingshi, if he doesn’t want to work, hmph, the rest of the money was still in ge’s hands!</p><br/><p>Of course, he would take the ling plant farmer classes. He was an intermediate level ling plant farmer that had received the summer flower jade medal! The prices could be set to undercut the other classes, and he could get more people.</p><br/><p>Bao Yi, he could open a shop and slowly sell the talismans they had accumulated!</p><br/><p>The more Zuo Mo thought, the more excited he was. There seemed to be two burning balls of fire in his eyes.</p><br/><p>Jingshi is boundless!</p><br/><p>———</p><br/><p>“What? Open a cultivation class?” Tian Yong Qing’s face was shocked.</p><br/><p>Tian Heng Bo’s face was also strange. “Yes, who knows what they are thinking! Oh, they also opened a ling plant cultivation class!”</p><br/><p>“Ling plant cultivation class?” Tian Yong Qing laughed. “They cannot recruit any ling plant farmers so they thought up this method?”</p><br/><p>“Haha!” Tian Heng Bo laughed smugly. “What can they do? We recruited all the nearby ling plant farmers. Unless they are willing to go to more distant places, but in that case, even if the person is willing to come, the price will be higher!”</p><br/><p>“This group of people is very interesting.” Tian Yong Qing said with a chuckle, “I remember our Tian Family also has a ling plant cultivation class.”</p><br/><p>Guessing what his brother meant, Tian Heng Bo smiled cunningly, “Yes, our Tian Family’s ling plant cultivation class, that is the top ranked one of Xu Ling City.”</p><br/><p>“Get them to give a good display to these outsiders. If they cannot see our Tian Family’s strength in ling plants, they would not give up!” Tian Yong Qing said.</p><br/><p>“Haha! I like to bully people the most!” Tian Heng Bo grinned.</p><br/><p>———</p><br/><p>“Is it good if we do this?” Nian Lu was struggling. Beside him, these experts of Sky Peak Platoon that did not flinch when facing mountains of blades and fire all showed insecure expressions.</p><br/><p>“What isn’t good?” Lei Peng did not care.</p><br/><p>“Those who doesn’t feel this is good only have to stop getting the allowance of jingshi for the Black Processing Meditation mat, and don’t need to go,” Ma Fan said lightly.</p><br/><p>The insecure expressions instantly disappeared. Each of them had twisted expressions and suicidal determination.</p><br/><p>“Do this!”</p><br/><p>“Killlllll!”</p><br/><p>———</p><br/><p>“What do we do?” Yi Zheng looked at Zong Ru with desperation. “There is only the two of us as dhyana xiu! We can’t compete!” He wanted to complete what Daren had requested of them well so he could trade for ling dan as soon as possible. Yet, there were only the two of them who were dhayana xiu in the camp, and with limited labour they could not promote their class as well as the others.</p><br/><p>Zong Ru thought and then his eyes suddenly lit up. “We’ll go to borrow people!”</p><br/><p>“Borrow people?” Yi Zheng’s face was confused.</p><br/><p>———</p><br/><p>When the xiuzhe of Xu Ling City woke up that day, they found that the cultivation classes, that already seemed to be everywhere, had increased in number overnight!</p><br/><p>Suddenly, many xiuzhe were running around on the roads of Xu Ling City. More than a dozen xiuzhe were all wearing Blue Soul Cold Light Armor, each of them with a bright red flag that had in big characters: “Xie’s Sword Essence Class”.</p><br/><p>The troop was extremely organized, the person at the very front like a tower made from metal. He did not wear any armor, his upper half bare, heat evaporating from the steely muscles that were radiating with power!</p><br/><p>Almost as though he noticed the number of people, the steely man at the front waved the red flag in his hands.</p><br/><p>They shouted together, “Practicing the sword but not the essence, that is akin to just farting!”</p><br/><p>The spectators were shocked.</p><br/><p>The large man waved his flag again and the shouts rang out in unison.</p><br/><p>“Xie’s Sword Essence Class, if you can’t get sword essence, we will refund it all!”</p><br/><p>The rumbling footsteps seemed to rampage across the hearts of the spectators and left behind dazed passersby.</p><br/><p>———</p><br/><p>Xu Zheng Wei rose up very early today. It was a rare that he woke up so early. Even though xiuzhe were not affected by age like normal people, time would still leave behind marks on their body no matter how great their cultivation was.</p><br/><p>Today, he decided to go visit his nephew.</p><br/><p>He was born to a normal family and the only one in his family that had any significant cultivation, a jindan. He had a younger brother that did ran a little business, and with Xu Zheng Wei’s protection his brother’s life did not lack for anything. His brother’s son had pretty good cultivation talent. Just thirteen years old and almost in zhuji, which could be considered outstanding.</p><br/><p>He focused a great amount of attention on this nephew and would visit every once in awhile to monitor his cultivation’s progress.</p><br/><p>Just outside the door, he saw the street out of the corner of his eye, his step suddenly paused and then his expression froze on his face.</p><br/><p>Ten xiuzhe in azure robes were sitting on ten nimbus clouds. The ten nimbus clouds were in a line that slowly floated along the street.</p><br/><p>At the very front was that very wealthy Big Boss Zuo who spent jingshi like dirt!</p><br/><p>They had managed to use something to write words onto the snowy-white nimbus clouds. Each nimbus cloud had a great big red character that could be seen from a long way off.</p><br/><p>Xu Zheng Wei reflexively read along the nimbus cloud and almost spat blood!</p><br/><p>“Ling plant cultivation class, includes work placement!”</p><br/><p>———</p><br/><p>A troop of fierce big men, yes, truly fierce and big men, each of them were more than one zhang tall!</p><br/><p>When such a troop walked on the street, the pressure they produced was suffocating.</p><br/><p>Each of their upper half was bare, the muscles were so terrifying they seemed unreal. All of them had proud expressions, their steps were heavy. When the ten people walked together, it rumbled as though a herd of elephants were trampling the ground.</p><br/><p>However … …</p><br/><p>“Zong Yi Dhayan Xiu Class, jindan dhyana xiu teaching, and lectures by a core disciples of the deep mountain’s Great Buddha Temple. The abhinna of dhyana xiu, all kinds of world-shaking techniques, are in this class, no regrets if you attend!”</p><br/><p>The shouts that rose caused people to be unable to feel any fear at all.</p><br/><p>———</p><br/><p>Chun Yu Cheng smugly sat on top of a wood horn rhinoceros. Around him were six hundred ling butterflies of different colors. Everywhere he passed, they caused little children to chase and play.</p><br/><p>These ling butterflies flew and formed words of different colors.</p><br/><p>“Animal Husbandry Cultivation Class!”</p><br/><p>———</p><br/><p>Wei Sheng looked at the structure in front of him and showed a wry smile.</p><br/><p>There was nothing to be said about the structure. This was a small sized yard, classic and elegant. On the door above the main gate was a large sign “Sword Teaching Hall.” The words were average, and at least better than chicken-scratch. What made him want to cry was the words written in the side of the door.</p><br/><p>“High-end Sword Cultivation Class, the choice for elite!”</p><br/><p>“Listen to the life experiences of a great master, comprehend the deep meanings of the sword!”</p><br/><p>“Teacher Wei’s High-End Sword Hall, you are worth it!”</p><br/><p>“The best gift for a child, the contribution of a true master, you are welcome to have a trial lesson!”</p><br/><p>The people behind Wei Sheng had strange expressions as they looked at each other.</p><br/><p>“Has someone registered?” Wei Sheng asked the xiuzhe responsible.</p><br/><p>The other shook his head. “No!”</p><br/><p>Wei Sheng smiled helplessly and murmured to himself, “It seems that I have to rely on myself!”</p><br/><p>He was too lazy to ask the others to erase these slogans. Rising his feet, he walked up the stairs and only stopped when he was far from the door.</p><br/><p>Turning, he faced the outside.</p><br/><p>Seeing Wei Sheng’s serious face, the Vermillion Bird Camp sword xiu that had come to assist seemed to realize something and closed their mouths.</p><br/><p>Boom!</p><br/><p>A vast sword essence burst and rose into the sky!</p><br/><p>The entire city was astounded!</p><br/><p>[i] The original saying is roughly translated as “Sea-crossing Immortal” which means that anyone that can cross the sea is an immortal, and similar to other sayings such as “any cat, whether white or black, who can catch a rat is a good cat.” Zuo Mo like mangling idioms and so the saying is changed to “immortal crossing the sea.”</p><br/><p>Translator Ramblings: Let’s make jingshi!</p><br/>\n</div>"}