{"title": "Chapter Four Hundred and Sixty Seven – Strong Offense", "id": 467, "volume": 5, "url": "http://boxnovel.org/world-of-cultivation-chapter-four-hundred-and-sixty-seven-%E2%80%93-strong-offense", "volume_title": "Volume 5", "body": "<h1>Chapter Four Hundred and Sixty Seven – Strong Offense</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Four Hundred and Sixty Seven – Strong Offense</p><br/><p>The sky was a fiery red as though storm of spells raining down had lit the air on fire.</p><br/><p>Tian Heng Bo’s expression was comparably ugly to the burning sky. Up until now, they hadn’t broken through the island’s protective formation!</p><br/><p>Thunder roiled within the Yinyang Thunder Cloud Formation! Lightning occasionally flashed and the silver snakes curved with a frightening presence. But what caused people to feel hopeless was the azure energy that would occasionally appear. They didn’t know what those azure energies were but any spell that encountered the azure energy, no matter how powerful, would disappear.</p><br/><p>The Tian Family started out as ling plant farmers but they had recruited a seal xiu that was skilled in formations. But that seal xiu’s head was covered in sweat and his expression was distraught at this time.</p><br/><p>“How much longer?” Tian Heng Bo felt impatient and his voice was murderous.</p><br/><p>He had never thought that Turtle Island was really a turtle, one that had retreated into its shell. A shell so hard it could break off people’s teeth! They had been stopped right outside the formation! If they could not break through the defense of the formation, it would be a serious blow to their present high morale.</p><br/><p>What caused him even more fury was that Tian Ye had sent a message from the rear with the undisguised disdain. Tian Ye’s personality was eccentric and had terrible relations with Tian Heng Bo. Tian Heng Bo found it hard to tolerate being laughed at by Tian Ye.</p><br/><p>“I … … I don’t know!” This female xiu knew Tian Heng Bo’s fiery temper. She swallowed hard and tried to explain, “This island has an expert in formations! The Yinyang Thunder Formation has been strengthened, and a lightning wood element has been added. There is also a very strange formation on the island that this subordinate has never seen before. This formation … …”</p><br/><p>“In other words, there’s no solution?” Tian Heng Bo stared at the seal xiu with a dark face.</p><br/><p>The heart of the seal xiu tightened. He stammered out, “This subordinate … … this subordinate needs two hours, no, four hours … …”</p><br/><p>Woosh!</p><br/><p>A energy flashed through the head of the seal xiu and blood streamed out.</p><br/><p>“What is the use in keeping you!” Tian Heng Bo’s voice was cold. He did not look at the corpse on the ground, turning and ordering, “All of you, launch an all out assault! Anyone that retreats will be killed without question!”</p><br/><p>The people around him shook inside and responded in the affirmative.</p><br/><p>Battle xiu flooded in behind them and encircled Turtle Island, preparing their spells together.</p><br/><p>Only one troop was stood out, staying motionless. That was Tian Ye Battalion!</p><br/><p>Tian Heng Bo felt great hatred towards them but did not show it on his face. He ordered the other two elite battalions to attack at the same time! He resolved that he would take down Turtle Island no matter what! Otherwise, he would not be able to raise his head in front of Tian Ye in the future!</p><br/><p>To break a formation, other than deconstructing it, there was another method, a strong attack! In theory, when the attack was strong enough, any formation can be defeated!</p><br/><p>In a flash, numerous spells fell down!</p><br/><p>———</p><br/><p>Ji Wei looked at the burning sky and praised, “This Meridional Azure Aether Formation is truly strong! Daren is uncanny in ability to be able comprehend such a formation! It is a sect-protecting formation! With this formation, Daren is able to create his own sect.</p><br/><p>Sun Bao said simply, “He’s a sect unto himself now.”</p><br/><p>Ji Wei thought. That was true, there wasn’t any difference between Daren and a sect right now.</p><br/><p>Zuo Mo did not conceal the [Meridional Azure Aether Formation] and everyone in Golden Crow Camp learned it and understood its wonders. But the more they understood, the more the felt how immeasurable Daren was.</p><br/><p>Because it was not easy for Zuo Mo to explain the origins of the jade scroll, he told them that he had comprehended it himself. Zuo Mo had just wanted to find an excuse, and hadn’t expected to cause everyone’s admiration.</p><br/><p>They did not know that the [Meridional Azure Aether Formation] had great origins! A formation that Pu Yao had held onto until now, could it be average?</p><br/><p>The spells rained down outside but the sky was clear and calm on the island. The formation that was already powerful grew in stronger under Lil’ Pagoda’s control. Regardless of the bombardment, it was like the rock in the middle of the sea that remained unmovable.</p><br/><p>The two of them were not nervous at all. It wasn’t just these two, all the xiuzhe of Golden Crow Camp had come to watch the spectacle and did not show any fear.</p><br/><p>Because near them ,the sword xiu of Vermillion Bird Camp were waiting to attack!</p><br/><p>———</p><br/><p>In the dark and cold mountain cave, Shu Long and the others stood around a black pond.</p><br/><p>“Should we go out and help?” A Wen couldn’t help asking.</p><br/><p>“No need, they can deal with it.” Shu Long’s stern gaze was locked on the mo weapons floating in the pond. Beside him, everyone was anxious, afraid to breathe too harshly.</p><br/><p>After a while, the black pond started to bubble as though it was going to boil.</p><br/><p>Shu Long’s expression became even more grave as he said in a deep voice, “Do you remember the method I just taught you?”</p><br/><p>Everyone nodded in unison.</p><br/><p>“The mo weapons recognizes their owners, and all have their own good fortune. It is alright if you do not get one this time, but no one shall feel hate or envy!” Shu Long’s gaze swept across everyone.</p><br/><p>“Ha, Brother Long is becoming more of a nag.”</p><br/><p>“What’s there to hate? We’re all brothers!”</p><br/><p>“The brothers that obtain mo weapons, you should go out and have a good run. Don’t let Vermillion Bird Camp take the attention!”</p><br/><p>“That’s right! I’ve been wanting that group of bird-people to know the might of us Guard Camp!”</p><br/><p>The competitive relationship between the two camps could be seen from the appellations. The xiuzhe of guard camp called Vermillion Bird Camp the ‘Birdy Camp’, and Vermillion Bird Camp xiuzhe referred to the Guard Camp as ‘Manual Labor Camp’.</p><br/><p>Once the words came out, they caused a chorus of agreement and excitement! They were always discontent that Vermillion Bird Camp frequently ranked first.</p><br/><p>Shu Long had an imperceptible smile on the corner of his mouth. He usually used this competitive relationship to motivate everyone to cultivate. It seems that the effects were good!</p><br/><p>The black pond suddenly quieted. All noise disappeared, and everyone looked at the black pond. The quieted black pond was like a glossy and smooth mirror without any ripples.</p><br/><p>At this time, a mo weapon silently floated onto the surface.</p><br/><p>A faint but intimidating and pure fiendish energy engulfed the cave without any warning. Every camp guard unconsciously stopped breathing, their eyes pulled towards the mo weapon.</p><br/><p>This was a curved blade. The completely black blade did not have the least bit of sheen. It had an abnormal curvature and seemed to have an unusual power that captivated and held people’s gazes.</p><br/><p>Mo weapons continuously floated onto the surface. The vicious fiendish energy in the cave increased in strength until it was almost tangible. Shu Long and the others felt this was unspeakably pleasurable. For xiuzhe, this was undoubtedly pure toxic poison, but for them this vicious fiendish energy was like being immersed in a hot spring and extremely comfortable.</p><br/><p>No one moved even though their faces were full of excitement. They were waiting for Shu Long’s command.</p><br/><p>Shu Long shouted, “Start!”</p><br/><p>They then eagerly channeled the Hardship Guard. Killing essence filled the cave. Everyone had serious expressions, releasing as much killing essence as they could and were shrouded in tangible killing essence.</p><br/><p>The black mist of killing essence seemed to give off an inviting scent. The mo weapons that were inside the black pool were attracted and started to shake. The peaceful black pool was instantly disrupted.</p><br/><p>Mo weapons chose their masters.</p><br/><p>For all the hardship guards including Shu Long, this was a very novel matter. They didn’t even have a general concept of mo weapons but they knew this could make them strong! Make them more powerful!</p><br/><p>That was enough!</p><br/><p>For these hardship guards that were once salve xiu, following Daren was their own goal in life. Yet they found their combat capabilities was inferior to Vermillion Bird Camp and the effect they could cause with their strength was limited. For this group of people, that lived to follow Zuo Mo, being unable to show their usefulness was even more depressing and uncomfortable than death!</p><br/><p>Each of them channeled their mo skill to the max. Their eyes held determination that had gone through hardship.</p><br/><p>———</p><br/><p>Ning Yi looked greedily at Wei Sheng. Such an extreme soul! He could smell the purity of this soul, it was so intoxicating!</p><br/><p>“A masterpiece of Heaven!” Ning Yi licked his lips, his long and narrow eyes showing undisguised excitement!</p><br/><p>Wei Sheng did not speak. He could feel the other’s great power, the terrifying presence and especially the vicious energy coming from the bloody umbrella in the other’s hand that made him feel as though he was in hell.</p><br/><p>But he did not waver. He never felt fear because of the strength of an enemy. Not in the past, not now, and would not in the future!</p><br/><p>He was Wei Sheng, the one that always went forward Wei Sheng!</p><br/><p>He looked without fear at the other. Battle intent in his eyes was like sword essence exploding. Only people that were familiar with him would notice a change, he had entered a battle state!</p><br/><p>The black sword in his hand raised and pointed straight at the other.</p><br/><p>“Why do you uselessly struggle?” Ning Yi shook his head and smiled slightly as though he was watching a pet play around.</p><br/><p>Boom!</p><br/><p>Vast sword essence was like the volcano breaking through the last layer of restraints, exploding into the sky!</p><br/><p>The space three zhang around Wei Sheng seemed to collapse inwards and showed unnatural curvature.</p><br/><p>The more Ning Yi watched, the more he liked it. “Not bad, not bad! A very good seed, good seed! So young and having cultivated sword essence to such a level, you did not waste your soul! An asura wielding the sword, I like this one!”</p><br/><p>Suddenly, Ning Yi laughed. “Why should I waste so many words on you?” The mirth at the corner of his lips rose, and his gaze suddenly became vicious. “Die!”</p><br/><p>Before the sound landed, the Blood Fiend Asura Umbrella in his hand suddenly snapped open and floated over Ning Yi’s head. The Blood Fiend Asura Umbrella slowly spun, releasing a red light and shielding Ning Yi in the middle.</p><br/><p>A beam of bloody red light that carried a nauseating tang of blood shot at Wei Sheng.</p><br/><p>Wei Sheng felt a feeling of extreme danger. Without hesitating, the black sword in his hand struck forth!</p><br/><p>The space in front of Wei Sheng was torn apart by this strike. There was a black void inside that was unknown!</p><br/><p>The blood light was stopped by this strike!</p><br/><p>“Not bad!” Ning Yi snorted coldly. “But this is not enough!”</p><br/><p>The Blood Fiend Asura Umbrella spun faster, the bloody light increasing in strength and the nauseating tang of iron growing. What was even more terrifying was that tear in the space was being slowly pressed closed by the bloody light!</p><br/><p>Translator Ramblings: The mo weapon is being rushed over here but it will come back.</p><br/>\n</div>"}