{"title": "Chapter Four Hundred and Sixty One – The World Upended", "id": 461, "volume": 5, "url": "http://boxnovel.org/world-of-cultivation-chapter-four-hundred-and-sixty-one-%E2%80%93-the-world-upended", "volume_title": "Volume 5", "body": "<h1>Chapter Four Hundred and Sixty One – The World Upended</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Four Hundred and Sixty One – The World Upended</p><br/><p>Scenes of laughter and chatting was seen everywhere on Turtle Island.</p><br/><p>When the people spoke about what they did this time, all of them were excited, and they were especially satisfied when they thought about the fearful and timid gazes of those business people.</p><br/><p>“Ha, you guys don’t know. When those people look at me, it was like they are looking at an ogre!” Lei Peng was proud as he motioned with both hands.</p><br/><p>“You look like a ogre.” Nian Lu added in a small voice.</p><br/><p>Everyone burst out in laughter, including Lei Peng himself.</p><br/><p>In the big hall, Zuo Mo and the others were gathered together with bright eyes.</p><br/><p>Waiting for Bao Yi to finish calculating, Zuo Mo couldn’t resist asking, “How much did we sell?”</p><br/><p>The smile on Bao Yi’s face was like a chrysanthemum flower blooming, but no one felt it wretched right now instead they looked at it with anticipation. Bao Yi’s voice trembled slightly, “Six … … six … …”</p><br/><p>“Sixty pieces of fifth-grade jingshi?” Zuo Mo’s grin almost reached his ears.</p><br/><p>Sixty pieces of fifth-grade jingshi, that really was a great sum of jingshi. That amount surpassed the total amount of jingshi Zuo Mo had at before! In just a few days, the amount in his pocket had doubled, this was definitely a great harvest!</p><br/><p>Everyone had joyful smiles. Sixty pieces of fifth-grade jingshi, that was enough to buy a fifth-grade talisman!</p><br/><p>Everyone might have a golden crystal sword each but they didn’t have much jingshi. Especially for a jindan like Xie Shan whose other talismans were lacking except for his fifth-grade golden crystal sword. The Blue Soul Cold Light Armor and the rest were slightly on the low end for a jindan, like Xie Shan.</p><br/><p>Bao Yi’s face was flushed red. He had to use all his strength to make his voice steady, “It … … is six hundred pieces of fifth-grade jingshi!”</p><br/><p>All of the laughter instantly disappeared.</p><br/><p>Zuo Mo’ s eyes were round. “Six hundred pieces of fifth-grade jingshi?”</p><br/><p>An entire set of Turtle Island jade scrolls was nine hundred and ninety eight third-grade jingshi or about two pieces of fourth-grade jingshi. Six hundred pieces of fifth-grade jingshi was six hundred thousand pieces of fourth-grade jingshi. In this short time period, they had sold three hundred thousand sets of Turtle Island jade scrolls!</p><br/><p>Everyone was shocked speechless by this enormous number!</p><br/><p>Bao Yi resumed his normal composure at this time. “In this rush, there have been stores from nearby cities that have come to use to purchase the jade scrolls. Our jade scrolls have sold like crazy in this area! Bright Light City, Sea Light City, Cloud Light City, their shops are not influenced by the people from Xu Ling City. They have bough huge numbers. We have spent great effort, all of Vermillion Bird Camp putting down their work to forge jade scrolls in order to fulfilled their demands.</p><br/><p>In the silence, Bao Yi’s voice was the only one.</p><br/><p>“However, our revenue is slowly decreasing. The little jinzhi we put on our jade scrolls have been deconstructed and knockoffs have appeared on the market. This has greatly affected our revenue.” Bao Yi was full of regret.</p><br/><p>But everyone was still immersed in the great shock of six hundred pieces of fifth-grade jingshi. No one spoke.</p><br/><p>Six hundred pieces of fifth-grade jingshi!</p><br/><p>Zuo Mo felt blank.</p><br/><p>Selling jade scrolls was just something he did to oppose the Tian Family and just to annoy them. Getting Vermillion Bird Camp to sell jade scrolls was because there were no shops that were willing to sell his jade scrolls. He had used this group of extremely bored people as free labor.</p><br/><p>What a world this was!</p><br/><p>One could make six hundred jingshi like this?</p><br/><p>When was jingshi so easy to make?</p><br/><p>This was a whole six hundred pieces of fifth-grade jingshi!</p><br/><p>Zuo Mo felt his world was upended!</p><br/><p>Yet what he had not expected was that it wasn’t just this matter that upended the world for him!</p><br/><p>———</p><br/><p>Zuo Mo looked curiously at the completely transformed ling fields. Beside him, the ling plant farmers of the island were also looking around curiously. The masters Ji Wei and Sun Bao were explaining the changes in detail.</p><br/><p>“These ling fields have been completely modified to become formation ling fields. According to the attributes of the ling plants, we have designed new formations. Each section of ling fields has a cloud rain formation, and the core of the formation is a piece of fourth-grade water soul crystal. It can release the Little Art of Cloud and Rain to the equivalent of the fifth level. If one wants to release [Little Art of Cloud and Rain] to a higher level, it requires a higher grade water soul crystal.”</p><br/><p>Following Master Sun Bao’s finger, Zuo Mo saw threads of white mist appear above the ling field. The white mist quickly formed a ball of clouds and silver threaded rain fell onto every corner of the ling field.</p><br/><p>Even from far away, Zuo Mo could sense the thick vitality in these rain drops. His eyes lit up. “This is good!”</p><br/><p>At his side, more than twenty ling plant farmers gaped with disbelief on their faces. This was the first time they saw a formation that could cast [Little Art of Cloud and Rain]. Their ling plant farming skill was not high but even they could feel the threads of rain were truly Little Art of Cloud and Rain!</p><br/><p>There were clear differences between ling plant farming water spells and normal water spells. Normal xiuzhe might be unable to detect it but ling plant farmers definitely could.</p><br/><p>Su Bao’s face held no pride. He continued to introduce, “The Cloud Rain Formation is the simplest formation and it was the first one we solved. We then resolved the earth formation. According to the [Earth Granary Spell] that summer flower ling plant farmers frequently use, we designed a Earth Granary Formation. At the center of the formation is a piece of fourth-grade brown spotted rock. It later proved to have a great effect and is very good at gathering earth energy. It can reach the skill of the fourth level of [Earth Granary Spell]. But we do not have a lot of brown spotted rock so Daren will need to buy a batch.”</p><br/><p>Zuo Mo’s joy grew. Water and earth spells were the ones most often used on normal ling field. Since these two spells were solved, that meant that ling grasses and grains had the support for basic growth. Wood spells could accelerate the growth of ling grasses and grains while gold spells was mostly used to exterminate insects and disease. Fire spells could gather the essence of the sun and also accelerated growth. But the core spells were the water and earth spells.</p><br/><p>In other words, it was possible to plant ling grains and grasses on this section of ling field. Removing the need to cast the water and earth spells, each ling plant farmer could now take care of five hundred mu of ling fields an increase one hundred mu!</p><br/><p>The amount of usable ling fields on the island could be multiplied by five!</p><br/><p>To Zuo Mo, this was definitely good news!</p><br/><p>However, the surprises that the two masters gave Zuo Mo didn’t end here. Master Ji Wei continued, “For the wood spell, we used the [Ling Essence Wood Attracting Spell]. This spell is relatively complex so not many ling plant farmers use it, but there is no problem if we use a formation. Also, while the Ling Essence Wood Attracting Formation is complex, it does not use a lot of jingshi. As for the fire spells, it was not difficult. Daren’s Golden Crow Fire Formation is appropriate but it is too strong. We weakened it by merging it with the Glimmer Formation to form a new kind of formation that we have called Golden Crow Glimmer Formation. It is not as powerful, but it is gentle and much more appropriate to use on ling plants.”</p><br/><p>At this moment, the cloud and rain dissipated, the mist above the ling field disappearing. Threads of golden energy came from the sky and scattered among the ling fields. In a blink, a faint layer of golden light covered the ling grains in the field and looked very ethereal.</p><br/><p>Zuo Mo and the others were stunned by the beautiful scenery and unconsciously stopped their breathing.</p><br/><p>The two masters Ji Wei and Sun Bao were unaffected by the beautiful scenery. They had seen this scene repetitively during development, and didn’t even bat an eyelid, continuing, “If we have to say which spell was the most difficult, it is the gold spell.”</p><br/><p>“Gold spell?” Zuo Mo reflexively asked. He quickly reacted and couldn’t help but frown. Yes, of the ling plant five elements, gold was for killing and it demanded the highest control of ling power and consciousness. Ling plant farmers mostly had gentle personalities and naturally had less of killing energies.</p><br/><p>This was also why the number of ling plant farmers skilled in gold spells was pitifully few.</p><br/><p>“We recalled something Daren once said,” Ji Wei said.</p><br/><p>“What did I say?” Zuo Mo was clueless.</p><br/><p>“Daren once said ling planting gold spells are like sword xiu, they are used for killing,” Ji Wei explained.</p><br/><p>Zuo Mo recalled and nodded. “I did say it.” He then asked curious, “And then, how did you solve it?”</p><br/><p>Truthfully, he was really frightened today. Sun Bao and Ji Wei’s designs were full of creativity and showed him a completely new path! Zuo Mo was not a short-sighted person and he was clear of the deep meaning contained in these formations. The two masters had been very clever in managing the previous four kinds of spells and this made Zuo Mo very curious as to how they had taken care of the difficult gold spell.</p><br/><p>“We thought that since they are very similar to sword xiu, why don’t we use sword xiu directly?” Ji Wei asked in response.</p><br/><p>Zuo Mo stilled. “Use sword xiu directly?”</p><br/><p>“Yes, use sword xiu directly. We have a lot of sword xiu and many who have comprehended sword essence. If we can use all of them, can’t we solve a great part of the problem of lacking ling plant farmers?” Ji Wei showed excitement. “Ling plant farmers can kill those pests, so why can’t sword xiu? We especially asked Teacher Wei. He told us that theoretically, there is no problem and he also demonstrated for us. Through Teacher Wei’s guidance, we designed a completely new formation. Its development was delayed by the matter with the jade scrolls, so we just finished it recently!”</p><br/><p>“A completely new formation?” Now even Zuo Mo found it hard to believe. This group of people were becoming increasingly stronger and coming up with strange and novel formations that even he could not think of. What did this have to do with formations?</p><br/><p>Master Ji Wei was extremely excited as he spoke rapidly, “We call this geat formation the Insect Exterminating Formation. Its core is made from golden crystal sand. There only needs to be a sword xiu who comprehended sword essence inside the formation and it can be used to kill all kinds of pest and diseases. We got some of the brothers from Vermillion Bird Camp to try. The effect is great and there are no blind spots!”</p><br/><p>Zuo Mo’s face was dazed. He was dumbstruck.</p><br/><p>Ji Wei did not notice the dazed expression on Zuo Mo’s face. He waved his arms and said excitedly, “And this Insect Exterminating Formation even has an added benefit, it can help the sword xiu brothers practice their sword essence and allow them to control their sword essence even better.”</p><br/><p>Zuo Mo was frightened as he looked dumbly at the two masters.</p><br/><p>The two masters finally noticed the strange expression on Zuo Mo’s face. The two exchanged a look. Master Sun Bao broke the silenceopened, “Daren, is everything alright?”</p><br/><p>“Alright! Very alright … …”</p><br/><p>Zuo Mo unconsciously murmured. He gazed at the ling fields in front of him and his dazed eyes were blank.</p><br/><p>This world was upended!</p><br/><p>Translator Ramblings: As some of you predicted … …</p><br/>\n</div>"}