{"title": "Chapter Four Hundred and Sixty Four – Attack First!", "id": 464, "volume": 5, "url": "http://boxnovel.org/world-of-cultivation-chapter-four-hundred-and-sixty-four-%E2%80%93-attack-first", "volume_title": "Volume 5", "body": "<h1>Chapter Four Hundred and Sixty Four – Attack First!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Four Hundred and Sixty Four – Attack First!</p><br/><p>“What is this?” Zuo Mo asked Wei as he stared at the black gold seal soldier. Looking at the face that was the exact same as his, he felt unspeakably uncomfortable.</p><br/><p>Wei said in a deep voice, “This seems a bit like a totem puppet.”</p><br/><p>“Totem puppet?” Zuo Mo was slightly shocked. He moved to look at Wei. “What is that? What is its purpose?”</p><br/><p>“The totem of each tribe is the symbol of each tribe. They are extremely powerful but many totems did not like to personally attend to each tribal matter. They would bestow puppets to each tribe that contained some of their power. In the ancient era, totem puppets were numerous. They would be bestowed a power of the totems, but these powers were not as great as the totems themselves! Some totem puppets could function as seeds that the totems left behind for themselves. If the totem is destroyed, these totem puppets can use certain secret methods to reawaken the memories of the totem and become the new totem!”</p><br/><p>Pu Yao listened carefully. Even he was not clear about these ancient matters t.</p><br/><p>Zuo Mo’s mind shifted. Seal soldiers were a method that united seals and puppets. Totem puppets made him think about the totem fragment he had used.</p><br/><p>“What is offering sacrifice?” Zuo Mo asked immediately.</p><br/><p>“Offering the sacrifice is the most important step of the sacrificial ceremony. It usually is the signal that the ceremony has started.” Wei explained, “When your black gold seal soldier opened its eyes, it made me recall those sacrificial ceremonies. The sacrificial ceremonies of the ancient era usually require offerings. The totem puppets are like wild beasts and are extremely hungry! You did this by accident. As to what your black gold seal soldier can do, you need to explore it yourself. Things related to the totem is too distant even to us!”</p><br/><p>The three were silent. He was right. The ancient era was way too archaic to them!</p><br/><p>Totem puppet … …</p><br/><p>He always managed to come up with weird stuff, Zuo Mo couldn’t help but grimace.</p><br/><p>He clearly had forged according to Gu Xiang Tian’s jade scroll so why did the black gold seal soldier he made turn out completely different than in the instructions?</p><br/><p>Whatever, he’ll know after trying it out.</p><br/><p>Zuo Mo held the paper seal and channeled the spell according to the method recorded in the jade scroll.</p><br/><p>There was no response.</p><br/><p>Zuo Mo paused. How could there be no response? He hurriedly took out the jade scroll and closely read it over. It was correct! Zuo Mo suddenly had a bad feeling, could it be … …</p><br/><p>He forced himself to calm and cast the spell again.</p><br/><p>Still no response!</p><br/><p>The corner of Zuo Mo’s eyes jerked. The bad feeling grew and he tried again.</p><br/><p>Still no response!</p><br/><p>Why wasn’t there a response? Had he ruined it? Zuo Mo looked at the paper seal in his hand with an ugly expression! Used so much effort, spent so many good materials, and even caused such a frightening offering of sacrifice, it all made ge feel anticipation, but it is really a failure?</p><br/><p>Stupid thing! Zuo Mo was angry due to his embarrassment. Without another word, he whipped the paper seal at the table!</p><br/><p>“Born to battle.”</p><br/><p>A lazy voice that seemed to have just woken up suddenly popped out.</p><br/><p>The masculine and intimidating words were soft and without any strength.</p><br/><p>Behind this phrase was a long yawn.</p><br/><p>Zuo Mo’s face was black as the bottom of a pot, his eyes staring viciously at the black gold seal soldier. The dark gold black gold seal soldier gave a yawn, drool coming out of the corner of his mouth, as he looked with sleepy eyes at Zuo Mo.</p><br/><p>“Big Bro, what you want?”</p><br/><p>Zuo Mo was frozen where he stood. Pu Yao and Wei were also dumbstruck.</p><br/><p>Other than being completely dark gold, this guy’s wretched appearance was just the same as Zuo Mo!</p><br/><p>Seeing no one reply, the black gold seal soldier gave another long yawn. “Nothing? If there’s nothing, I’m going to sleep. So sleepy!” Finishing, he waved a hand at Zuo Mo and disappeared with a pop.</p><br/><p>Unfreezing, Zuo Mo felt the impulse to sob and cry. Was this still a seal soldier? That fierce seal soldier that was not afraid of death, where did it go? Wasting so much energy and materials, yet he only got this lazy guy, Zuo Mo felt he was so stupid he could go hit his head against a wall!</p><br/><p>The more he thought, the more Zuo Mo missed the black gold seal soldier that was stoic, silent, and ignorant of pain or exhaustion!</p><br/><p>Such a good black gold seal soldier!</p><br/><p>His luck was terrible!</p><br/><p>Among Pu Yao and Wei’s sympathetic eyes, Zuo Mo wanted to cry, so regretful his intestines were green.</p><br/><p>———</p><br/><p>Zong Ru chanted in a low voice as he gently swung the prayer wheel in his hands. The sutra characters on the prayer wheel up and swirled.</p><br/><p>Threads of wish power were like a great grey poison that permeated the Crossed Prayer Wheel.</p><br/><p>His Crossed Prayer Wheel used the Nine Turn Sky Earth Disk as the body, the Vajra Gada as the spokes as it was inscribed by the [Attainment Golden Body] scripture that Zong Ru recited every day. The talisman was purified by wish power so the two talismans showed signs of merging together.</p><br/><p>Even though it was just a preliminary shape, it already had wonderful powers.</p><br/><p>What he needed right now was time to continue to merging it, so this Crossed Prayer Wheel could truly be created. But the present Crossed Prayer Wheel was still the second best talisman in the camp.</p><br/><p>The Nine Turn Sky Earth Disk was sixth-grade, and after being processed in all kinds of dhayana methods, it became even more gentle and enigmatic.</p><br/><p>Other than teaching, Zong Ru spent all his time on this Crossed Prayer Wheel.</p><br/><p>———</p><br/><p>An irritated Zuo Mo was found by a hurried Bao Yi.</p><br/><p>Bao Yi, expression panicked, reported the news he had found to Zuo Mo. Shang Wei Ming had also hurried over changed expression when heard the name Ning Yi.</p><br/><p>Zuo Mo was not concerned. “They only have this kind of move?”</p><br/><p>In his view, this Tian Family was lacking compared to Pu Yao. These kind of little techniques to Zuo Mo who had killed his way out of mountains of corpses really could not stir his interest.</p><br/><p>A classic little scuffle!</p><br/><p>Shang Wei Ming saw Zuo Mo was not very concerned and instantly became urgent. “Daren, that Ning Yi doesn’t bat an eyelid when killing! No one can stop him with his cultivation! He has an extremely powerful talisman called the Blood Fiend Asura Umbrella that is extremely domineering, and the blood light it releases is hard to defend against. Many people have fallen under this umbrella!”</p><br/><p>“This powerful?” Zuo Mo stilled. “Even more than the Thousand Gem Illusory Disk?”</p><br/><p>Shang Wei Ming hurriedly said, “How can the Thousand Gem Illusory Disk be compared to the Blood Fiend Asura Umbrella? The Thousand Gem Illusory Disk could be said to be a powerful talisman in Xu Ling City, but it is nothing in all of Cloud Sea Jie. The Blood Fiend Asura Umbrella is famed in all of Cloud Sea Jie. Using this umbrella, Ning Yi had killed more than seventy xiuzhe, even more than ten jindan experts ! The Blood Fiend Asura Umbrella is ranked tenth on the jie’s ranking of sixth-grade talismans, and is very powerful!</p><br/><p>“This powerful?” Zuo Mo jumped in fright.</p><br/><p>Zuo Mo did not have any concept of the talisman ranking but if it was more powerful than that Thousand Gem Illusory Disk, then he found it worthy of attention! When he had been caught in that Thousand Gem Illusory Disk, it had been because he was not on guard, but Zuo Mo had been astounded by the power of the talisman. The power displayed by the Thousand Gem Illusory Disk surpassed all talisman Zuo Mo had ever seen before and caused him to reevaluate the value of talismans. Otherwise, he would not have been willing to spent all of his wealth to outfit everyone.</p><br/><p>But he was also clear that the talismans that could be bought on the market and the true top talismans had an insurmountable gap.</p><br/><p>In his view, the Thousand Gem Illusory Disk was already a great talisman. If that Blood Fiend Asura Umbrella was even more powerful, then it was trouble.</p><br/><p>Zuo Mo’s first reaction was first send a group of people to kill Ning Yi on the road. No matter how strong Ning Yi or that Blood Fiend Asura Umbrella was, if there was enough people, he would still be killed!</p><br/><p>When this idea popped up, it uncontrollably spread in Zuo Mo’s mind. Sitting and waiting for others to come to the door was not Xiao Mo Ge’s style. He wanted himself to always be the first person to attack.</p><br/><p>As to whether the news that Bao Yi found was true or not, he didn’t even think about it.</p><br/><p>The pitiful Ning Yi was still immersed in the joy of having the Bagua Energy Mirror, and was ignorant that a certain someone had given him the label of “enemy.”</p><br/><p>Quickly setting his target, Zuo Mo started to think if he should fight, what advantages were there in fighting? What disadvantages were there if he did not fight?</p><br/><p>In a few moments, Zuo Mo decided to fight!</p><br/><p>Attacking first meant having the advantage. The other was in the open and they were in the shadows and could take the initiative. If they could successfully kill Ning Yi, the other two would definitely feel fear. Also, the other would not predict that Zuo Mo would attack first. This kind of sneak attack was very sudden and Zuo Mo’s most liked option! Their advantage of numbers could be used. Gang fighting was his best love!</p><br/><p>If he did not fight and waited for the others to come to his door, Zuo Mo and the others would be restrained in this Xu Ling City.</p><br/><p>With so many benefits, why shouldn’t they attack?</p><br/><p>The team selection was easy: himself, Wei Sheng, Xie Shang, and Zong Ru. Four jindan against Ning Yi. No matter how powerful that Blood Fiend Asura Umbrella was, they should have a possibility of victory. If that really didn’t work, then adding Shu Long which would increase the probability of success.</p><br/><p>Zuo Mo asked in detail. As expected, Ning Yi was the most powerful of the trio.</p><br/><p>He unhesitatingly chose Ning Yi as the target!</p><br/><p>The saying was to capture the bandits, first capture the leader!</p><br/><p>———</p><br/><p>Tenth Grade gazed at the deep cave with a grave expression. He had been forced back last time! The charging power of the insects inside was very powerful, and the number of insects far surpassed his imagination.</p><br/><p>Recalling the scene that day caused him to feel a thread of fear.</p><br/><p>It was this thread of fear that had caused him to feel shame! He was a ling beast that wanted to become tenth-grade, how can he feel fear? The vicious Tenth Grade felt that this had become a demon haunting him. If he could not destroy this monster, he would forever have a weakness!</p><br/><p>And Master once said that where one lost face, he had to regain it at that place!</p><br/><p>He could not swallow this!</p><br/><p>He had to take back his face!</p><br/><p>Insects, ye has come back!</p><br/><p>Viciousness flashed through Tenth Grade’s eyes as he unhesitatingly threw himself into the cave.</p><br/><p>Translator Ramblings: I feel like all of Zuo Mo’s companions/pets represent one aspect of him in some way. Lil’ Pagoda is his five elements … … or his desire to consume resources. Lil’ Black takes after his good eye for treasure. Tenth Grade has Zuo Mo’s stubbornness and Silly Bird has Zuo Mo’s protective instincts. The new black gold seal soldier has Zuo Mo’s laziness but I don’t know what Lil’ Fire is … …</p><br/>\n</div>"}