{"title": "Chapter Four Hundred and Seventy Four – A Visit from Liao Qi Chang", "id": 474, "volume": 5, "url": "http://boxnovel.org/world-of-cultivation-chapter-four-hundred-and-seventy-four-%E2%80%93-a-visit-from-liao-qi-chang", "volume_title": "Volume 5", "body": "<h1>Chapter Four Hundred and Seventy Four – A Visit from Liao Qi Chang</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Four Hundred and Seventy Four – A Visit from Liao Qi Chang</p><br/><p>After victory of the battle at Turtle Island, Lil’ Miss did not hesitate and instantly retaliated against the Tian Family. Their battalions killed, the remaining Tian Family forces were not a match for Vermillion Bird Camp and quickly collapsed. Even the Old Master Tian that was in seclusion in hopes of breaking through to yuanying had to come out to save them.</p><br/><p>Yet Zuo Mo and the others had returned by this time. With all of the experts in attendance, even though Old Master Tian had jindan third stratum cultivation, he could not stop Zuo Mo and the others from ganging up on him and was killed.</p><br/><p>The battle that occurred between Turtle Island and the Tian Family astounded all of Xu Ling City. The Tian Family’s instantaneous destruction was a great blow to many people, especially those businesses that had allied with the Tian Family to work against Turtle Island. They were terrified and many of them even fled Xu Ling City during the night.</p><br/><p>What was worthy of speculation was Xu Ling Sect’s attitude. Xu Ling Sect had not reacted to such a significant event, as though they did not notice it had occurred.</p><br/><p>Having taken over the Tian Family’s territory and ling fields, Turtle Island jumped to become the second power of Xu Ling City and its reputation shot up.</p><br/><p>The news that followed after pushed Turtle Island’s reputation to even greater heights.</p><br/><p>Someone found had Yuan Xin’s bones.</p><br/><p>Yuan Xin was found on a desolate island. His fleshly body had been destroyed only leaving behind pale white bones. If it was not his personal effects and artifacts that proved he was Yuan Xin, no one would connect this pile of white bones to the top ranked expert of Cloud Sea Jie.</p><br/><p>Yuan Xin was dead, Ning Yi and Gu Ming Gong had disappeared.</p><br/><p>The businesspeople of Xu Ling City entered a period of unprecedented terror. The businesses that could escape Xu Ling City all ran, while many the remaining businesses could not leave Xu Ling City, due to various reasons, could only await their fates. The news of the Tian Family, were nightmares that did not allow them to rest at night.</p><br/><p>Xu Ling City was full of terror.</p><br/><p>———</p><br/><p>At this time Turtle Island was full of joy and cheer.</p><br/><p>This battle had been a dangerous one but they had achieved victory in the end. Starting from yesterday, everyone was inventorying the spoils, and all of them couldn’t help but smile.</p><br/><p>The richness of the harvest this time surpassed everyone’s predictions. The Tian Family was very rich, as would be expected of a family with a long history. It dazzled Zuo Mo’s eyes and caused him to drool. He finally knew that he had underestimated these local families.</p><br/><p>In just jingshi, there were thirty six sixth-grade jinghsi, and the talismans of various types were innumerable. There were two sixth-grade talismans. Other than the Sky Ray Treasure Lens, the other was a rare sixth-grade ling plant talisman, Earth Spirit Matter Conveying Stone. He had taken the Earth Spirit Matter Conveying Stone from the body of the Old Master Tian. He didn’t know what this stone was forged from, it could continuously release ling power, and nurture all substances, it was a wondrous treasure!</p><br/><p>Even Zuo Mo had never seen such a wondrous talisman before.</p><br/><p>There were also many fourth and fifth-grade talismans but they no longer interested Zuo Mo. He gave them as rewards to the members with outstanding accomplishments in battle.</p><br/><p>What were the most numerous was the Tian Family’s ling fields and ling mines!</p><br/><p>The Tian Family had started out as ling plant farmers and even Xu Ling Sect could not compare to them in terms of ling fields. The Tian Family also had the largest number of ling plant farmers. Under the soft and hard tactics from the Tian Family, these ling plant farmers had signed death contracts. Now that the Tian Family was defeated, they also became Zuo Mo’s spoils of battle.</p><br/><p>However, Zuo Mo had decided not to reveal the formations on the ling fields of Turtle Island to these ling plant farmers. He wasn’t ignorant and understood this method that completely upended the traditional ling farming methods, and would create endless trouble for him if it was revealed. Before he was strong enough, there could only be one outcome.</p><br/><p>With so many ling plant farmers, he didn’t need to worry at all and only needed to send a few people to supervise the production.</p><br/><p>This was a hen that would continuously lay golden eggs.</p><br/><p>———</p><br/><p>“Island Master really is powerful!”</p><br/><p>Outside the island, Liao Qi Chang’s voice passed over the distance.</p><br/><p>Zuo Mo leapt into the air and welcomed him. He saw Liao Qi Chang and Xu Zheng Wei come together and raised his folded hands in a greeting, “Mister Liao, Elder Xu, long time no see!”</p><br/><p>Xu Zheng Wei hurriedly returned the greeting and his tone held a thread of awe. “Island Master, long time no see!”</p><br/><p>If it was said he had just been shocked at the power of Zuo Mo and the others, now he really felt awe. The enormous Tian Family had been turned to dust in the blink of an eye. The power of this Turtle Island wasn’t just awe inspiring, it was terrifying!</p><br/><p>Liao Qi Chang laughed brightly, “Island Master’s fight tactics are uncanny and will be a classic!”</p><br/><p>“This is just good luck! Luck!” Zuo Mo pretended to be humble as he spoke, but he still felt proud inside.</p><br/><p>Liao Qi Chang shook his head and said, “Luck? Island Master is incorrect! Who can destroy the Tian Family based on luck? Only people with great charisma and skill can do it! Even that battalion ranking can’t stay still. Thirty two, a rank that even the Xu Ling Battalion has never held. It seems the name of Turtle Island is going to spread through the entire Cloud Sea Jie!”</p><br/><p>Zuo Mo tried to act humble but he still couldn’t help but smile, these were clearly the mannerisms of a lowly person that had accomplished their dream.</p><br/><p>However, it had not gone to his head. He hurriedly said, “That doesn’t count, doesn’t count. What have you come for this time … …”</p><br/><p>He saw Liao Qi Chang say with a smile , “This one has come this time for three matters.”</p><br/><p>Zuo Mo replied, “What three matters?”</p><br/><p>“The first matter is to congratulate Island Master for your great victory!”</p><br/><p>Zuo Mo’s expression did not change. He asked, “Many thanks, Mister Liao, then the second matter?”</p><br/><p>“The second is about the azure aether. This one has remembered the azure aether matter that Island Master mentioned and has searched around. This one finally found it recently and is delivering it personally, as to not distract Island Master from your affairs.” When Liao Qi Chang finished speaking, he took out a transparent glass bottle. Inside the bottle was a ball of azure substance that was like cloud or mist but not that slowly flowed.</p><br/><p>As expected, this was azure aether!</p><br/><p>Zuo Mo couldn’t help but show joy. The Meridional Azure Aether Formation on the island only lacked the azure aether and it would then be perfect. In the battle this time, the power of the Meridional Azure Aether Formation had showed itself. If it wasn’t for the Meridional Azure Aether Formation, and there was only the Yinyang Thunder Cloud Formation, the enemy would have managed to breakthrough long before Vermillion Bird Camp had fully prepared.</p><br/><p>“What is the selling price of this azure aether” Zuo Mo’s eyes were burning.</p><br/><p>Liao Qi Chang smiled slightly and said, “This is hard to find but its price is not high. This bottle of azure aether is a present for Island Master, it is this one’s gift of congratulations for Island Master’s victory.”</p><br/><p>Finishing, he gently handed the glass bottle to Zuo Mo.</p><br/><p>Zuo Mo received it and it disappeared in a flash. There was no shame on his face. “Then many thanks, Brother Liao!”</p><br/><p>Liao Qi Chang smiled slightly, “The bottle is Crystal Clean Light bottle, it is a bottle that is good for capturing substances such as clouds, mist and flowing it. So this is for Island Master as well!”</p><br/><p>“Many thanks, Brother Liao!” Zuo Mo was slightly moved this time. To say of nothing else, just this mannerism of gifting was not something normal people could afford to do.</p><br/><p>“Then the third matter?” Zuo Mo asked proactively. He also knew the other wouldn’t give him talismans for no reason. He must have a request for the third matter. As long it was not a difficult matter, he would consent.</p><br/><p>“This third matter is this one wants to ask Island Master for mercy,” Liao Qi Chang said slowly.</p><br/><p>“Mercy? Mercy for what?” Zuo Mo did not understand.</p><br/><p>Liao Qi Chang sighed lightly, “When this one heard that some businesses had allied with the Tian Family to scheme against your island, this one knew it was not good. Yet my warnings did not carry weight, and they did not listen to this one’s urgings. With Island Master’s great victory, they are fearful and cannot rest at night. Originally, this one did not plan on interfering in this matter, one needs to pay their debts, but they have some connections to this one, and have plead to me for days. This one really cannot bear it, and has come with a thick face to ask for a favor from Island Master. Please, spare them!”</p><br/><p>Zuo Mo’s face turned dark. He hadn’t expected Liao Qi Chang to ask for mercy on behalf of those people.</p><br/><p>Those businesses had allied with the Tian Family to suppress him from the beginning. He opened cultivation classes, they tried to stop it by using their power. Then they had a share in hiring Ning Yi, Yuan Xin and Gu Ming Gong.</p><br/><p>Zuo Mo was never a generous person. It was the opposite. He was vengeful and would settle his debts, he would repay favors and take revenge! From the beginning, he had noted it down and waited to settle the debts later!</p><br/><p>Liao Qi Chang actually was asking for mercy for these people!</p><br/><p>Liao Qi Chang knew that this request was one that difficult. Even though the battle between Ning Yi’s group and Turtle Island was a mystery, but it was possible to see the life threatening danger involved from the death of Yuan Xin! No one would easily spare those that had almost killed them!</p><br/><p>“They are extremely regretful and know it is not possible to escape their crime. Every family is willing to give their leader to Island Master to determine their fate. Also, Island Master, please accept these ten pieces of sixth-grade jingshi. They only hope to preserve some part of their family, Island Master, please spare them!” Liao Qi Chang took out a yellow little bag and handed it to Zuo Mo.</p><br/><p>Zuo Mo’s expression eased slightly but he did not immediately take the jingshi. He looked at Liao Qi Chang and said, “Those that were responsible for starting this matter need to take responsibility.”</p><br/><p>Liao Qi Chang understood that Zuo Mo’s words were a death sentence for these people. Those clans would definitely deliver the heads of these people for the sake of their families and to calm Turtle Island’s anger.</p><br/><p>He nodded crisply and said, “Alright!”</p><br/><p>Zuo Mo now took the jingshi and said, “This time, I will spare them because of Brother Liao. If they have other thoughts in the future, then do not blame this one for being impolite!”</p><br/><p>“That is natural.” Liao Qi Chang smiled as he was relieved of a great burden. He hadn’t wanted to take this hot potato, but they had slowly ground down his resolve, so he had forced himself to come. However, the success of this negotiation was also beneficial for him. His reputation among the businesses would grow and no one would openly contend with this businesses.</p><br/><p>Zuo Mo was also very content. The ten pieces of sixth-grade jingshi was a great surprise and by executing those responsible, it would intimated the businesses of Xu Ling City.</p><br/><p>This was the best result.</p><br/><p>Turtle Island had just swallowed the Tian Family and did not have a stable foundation. Even though he did not know why Xu Ling Sect had not made a sound this time, the other definitely was paying attention in secret. It was not hard to make trouble for those little businesses. But for Zuo Mo and the others that had recently come to Xu Ling City, it was not a wise decision to make enemies everywhere.</p><br/><p>Rampaging and charging everywhere was something only a rash person would do. How could the cunning Zuo Mo do such unprofitable business?</p><br/><p>Since the other side had given Zuo Mo enough to show their respect, Zuo Mo was naturally willing to take a steps off the stage.</p><br/><p>Getting rich without a lifting a finger was the best plan!</p><br/><p>After all, the fat piece of meat, the Tian Family, could not be digested in a short period of time.</p><br/><p>Translator Ramblings: The “Establish in New Territory” arc has now ended. I’m sure it is a great letdown for most of you that there was no epic fight between the Tian yuanying and Zuo Mo’s group but let the wealth of the Tian Family comfort you. On another note, Zuo Mo doesn’t care so much for lower-grade talismans. Maybe this is a sign that he is progressing on his path to recovery from his obsession with jingshi.</p><br/>\n</div>"}