{"title": "Chapter Four Hundred and Seventy Five – Meridional Azure Aether Formation", "id": 475, "volume": 5, "url": "http://boxnovel.org/world-of-cultivation-chapter-four-hundred-and-seventy-five-%E2%80%93-meridional-azure-aether-formation", "volume_title": "Volume 5", "body": "<h1>Chapter Four Hundred and Seventy Five – Meridional Azure Aether Formation</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Four Hundred and Seventy Five – Meridional Azure Aether Formation</p><br/><p>Zuo Mo stopped in the air above Turtle Island. Looking down at the enormous island, he couldn’t help but feel emotional.</p><br/><p>Suddenly, he spread his arms, and gathered all the ling power in his body.</p><br/><p>Pia pia pia!</p><br/><p>One hundred and eight meridional azure aether spikes shot out of the earth and silently floated around him.</p><br/><p>Zuo Mo’s expression became serious. He took out the Crystal Clear Light Bottle from his ring, and lightly plucked out the stopper. A ball of azure aether continuously flooded out of the mouth. This azure aether was extraordinarily beautiful. It was cloud-like and mist-like but not either of them with an indigo azure color. When it wafted out, it did not dissipate but floated in the sky and slowly swirled.</p><br/><p>Zuo Mo’s ten figures flew furiously. Streaks of ling power lights rose and extinguished on his fingertips, the light blooming and profound!</p><br/><p>Zuo Mo’s eyes suddenly became bright as he shouted, “Ha!”</p><br/><p>A streak of light left his hand and entered the azure aether.</p><br/><p>The azure aether suddenly froze and then exploded. It turned to one hundred and eight threads of azure smoke and shot into the meridional azure aether spikes. Zuo Mo’s expression became even more stern. His right hand moved and a meridional azure aether spike flew in front of him.</p><br/><p>Zuo Mo didn’t seem to make a move but a thread of Great Day Banded Flame appeared soundlessly in front of him that swallowed that meridional azure aether spike. The azure aether within the spike was stimulated and shifted restlessly, causing even the Great Day Banded Flame to be tinged with azure.</p><br/><p>About an hour later, the azure tinge in the Great Day Banded Flame retreated and it became a golden flame once more with differently colored bands.</p><br/><p>The meridional azure aether spike once again returned to Zuo Mo’s hand. There was a long and narrow azure aether seal was on the body of the spike, which now glowed and exuded a faint power.</p><br/><p>Zuo Mo showed a satisfied expression on his face. His right hand moved and another spike flew. The refinement process started again.</p><br/><p>He forged the spikes one after the other. He would rest when he was tired, and then continue when his ling power was replenished. As he continuously forged, his skill became more practiced and he had a deeper understanding of the azure aether seal that caused his speed to increase.</p><br/><p>After three days, the reforging of the one hundred and eight meridional azure aether spikes was completed.</p><br/><p>The reforged meridional azure aether spikes floated around him like stars circling the moon. Zuo Mo could faintly feel the unique communication between them. There were six different azure aether seals, each of them with their own power and abilities that floated through Zuo Mo’s mind.</p><br/><p>He seemed to understand something.</p><br/><p>Almost unconsciously, he raised both of his hands.</p><br/><p>There seemed to be an invisible string that caused one hundred and eight meridional azure aether spikes to float upward as though they were being pulled.</p><br/><p>The azure aether seals on the spokes lit up one by one. When the azure aether seal on the last meridional azure aether spike lit up, an invisible force suddenly surrounded Zuo Mo. Zuo Mo’s body shook slightly!</p><br/><p>Like the water in the pond was full and about to overflow.</p><br/><p>Zuo Mo did not even think as his hands suddenly pressed down on the empty air and shouted, “In!”</p><br/><p>Like arrows leaving the bowstring, the one hundred and eight meridional azure aether spikes turned to one hundred and eight dashes of azure light that entered all corners of Turtle Island.</p><br/><p>An enormous azure light shell then covered the island like a bowl being placed upside down.</p><br/><p>Many xiuzhe were disturbed by the change and flew into the sky. Their attention were all attracted to this thin light shell.</p><br/><p>Zuo Mo released a breath as though he was relieved of a great burden. He raised his head to look at the azure light shield above his head. This layer of light was extremely thin and seemed as though it would shatter upon contact like eggshell. Zuo Mo knew that jindan xiuzhe definitely could not break through it and it would hold unless a yuanying xiuzhe attacked. Even then a yuanying xiuzhe would not have an easy time breaking through this thin shell of light.</p><br/><p>The defensive power of the Meridional Azure Aether Formation was extremely strong. If he could find better materials, better azure aether, the power of the formation would grow to the point that even yuanying could not break it.</p><br/><p>Zuo Mo quickly threw this unrealistic notion to the back of his mind. All the wealth he had, even added together, wouldn’t be enough to forge such a set of meridional azure aether spikes.</p><br/><p>The shield of light gradually dimmed until it could not be seen. The sky seemed to return to what it was before but Zuo Mo knew that the defensive power of the formation had more than doubled.</p><br/><p>Zuo Mo wanted to make his own nest a fort.</p><br/><p>Zuo Mo considered whether he should construct a few formation battle watchtowers but then he ended the thought. The power of the formation battle watchtowers were slightly useless to the present Turtle Island. In the past, everyone’s skill was not very high, and their enemies were not strong.</p><br/><p>But Zuo Mo didn’t even remember how many jindan they had encountered. If conflict occurred, the power of the formation battle watchtower would not be sufficient. Also, their present power was not something that their past could compare to. After experiencing the Sealed Extinction battlefield, with the help of the black processing meditation mat, the formations that originated in mo matrixes, the ling dan and ling foods, as long as Zuo Mo had it, he would not be miserly. Many of the xiuzhe of Vermillion Bird Camp had reached the third stratum of ningmai. Even Golden Crow Camp had many that reached the third stratum.</p><br/><p>Becoming jindan was the right path. One normal jindan xiuzhe was equivalent to hundreds of ningmai xiuzhe.</p><br/><p>But Zuo Mo didn’t have good solutions to aid core formation. Right now with his three powers as one, his ling power’s strange stagnant period of no growth had finally been broken.</p><br/><p>Of course, with benefit, there came loss. Now the strange cycle of his ling power growth was broken, his mo physique had instead stopped growing. Even if Zuo Mo cultivated his mo physique, what grew was his ling and spiritual power. Zuo Mo suspected that the growth of the mo physique was being limited by his ling and spiritual power, and would only grow once all three had reached the same level.</p><br/><p>Due to the pause in his ling power growth in the past, Zuo Mo’s present ling power was the lowest in the entire camp, other than when compared to the flower yao. This was a great source of dejection for him.</p><br/><p>Zuo Mo had asked Pu Yao and Wei Sheng if there was any ideas about core formation. However, the two did not know, they were not xiuzhe in the end.</p><br/><p>Zuo Mo planned on asking Xu Zheng Wei or Liao Qi Chang in the future. If he could hire a few jindan, the power of the camp would go up another level.</p><br/><p>Right now, Zuo Mo had other affairs to attend to.</p><br/><p>The Earth Spirit Matter Conveying Stone was put at the center of the entire island. This treasure was really wondrous, causing the ling energy of the entire island to increase instantly. The ling fields were affected the most, and the grades of all the ling fields were increased by a fraction.</p><br/><p>Ling fields of higher grades could raise ling plants of higher grades, and could produce ling plants of better quality.</p><br/><p>Zuo Mo also moved the high grade ling plants he had found from the Tian Family estate, planted near the Earth Spirit Matter Conveying Stone. One of them was a fifth-grade Fury Maple. Its leaves were as red as fire and the trunk was a dark red. When one walked near, they could clearly feel a wave of heat being exuded from the plant.</p><br/><p>It was a rare fire ling plant and each leaf it produced was worth a thousand jingshi. The fruit it produced was called Fire Eye Fruit, and was used to forge fire element talismans.</p><br/><p>The other plant was Thousand Finger Guanyin Orchid. This flower was fifth-grade and shaped like the fingers of the Guanyin. If it bloomed, it would have thousands of flowers and was named so. This flower was deeply coveted by dhyana xiu and was greatly beneficial for their Samadhi. It was also the raw material for many ling medicines. The Thousand Flinger Guanyin Orchid would bloom every decade and was extremely rare due to this.</p><br/><p>Zuo Mo had been shocked and joyous that the Tian Family had two such rare ling plants. Compared to these two ling plants, the Sonic Lightning Walnut wasn’t much.</p><br/><p>Old Master Tian had started off dealing in ling pants, and naturally had collected more than these two plants in his collection. There were also many rare fourth-grade plants but they were now all in Zuo Mo’s purse now. He had moved the entire ling plant garden to Turtle Island. He dug up all of the Tian Family treasures, even the treasure safes that were hidden deep in the ground had been dug out under the guidance of Lil’ Black.</p><br/><p>As for the Sky Ray Treasure Lens, Zuo Mo gifted it to Gongsun Shidi. This talisman was suited for battle generals and was akin to giving wings to Lil’ Miss.</p><br/><p>The richness of the gains this time surpassed his predictions but there were also losses.</p><br/><p>Wei Sheng Shixiong and Zong Ru were recuperating from their wounds. Zong Ru’s wounds were not too serious but Eldest Shixiong was still unconscious. Zuo Mo was very worried.</p><br/><p>Thinking about it now, Ning Yi’s power still shook his mind.</p><br/><p>Compared to Ning Yi, Old Master Tian wasn’t on the same level. Zuo Mo hadn’t put great value on talismans in the past, but this battle really called his attention to them. If it wasn’t for the surprise performance of the Black Gold Seal Soldier and the black sword in Eldest Shixiong’s hands, they would have died back then.</p><br/><p>The power that could be expressed by powerful talismans were terrifying!</p><br/><p>He finally understood now why so many xiuzhe would furiously pursue talismans!</p><br/><p>One didn’t feel it in daily life, but when one encountered a true expert, they finally knew what it was to struggle with each step and not have a solution! What caused all this, other than the other’s high cultivation, was the talisman on their hands!</p><br/><p>One talismans could decide life and death.</p><br/><p>They had forged many talismans but there was never a talismans that possessed the terrifying power of the Blood Fiend Asure Umbrella. Zuo Mo felt that they had not invested enough energy in this area.</p><br/><p>Truly top talismans were almost always forged by the xiuzhe who used it. People wouldn’t sell these kind of talismans, and what could be bought on the market were outstanding, like the Blue Soul Cold Light Armour, but these were not considered top-tier talismans.</p><br/><p>Zuo Mo decided to forge a powerful talisman.</p><br/><p>Otherwise the dangers of the last incident would occur again.</p><br/><p>He thought of a person.</p><br/><p>———</p><br/><p>Tied up with the immortal tying chains, Gu Ming Gong’s spirits were low. Not eating or drinking for a few days wasn’t a big problem for him, but how long was it since he has had to endure such a thing? His mind was blank. Ever since thirty years ago, when his forging and seal-making skills had matured, he had lived a luxurious life. No matter where he went, which person did not greet him with a smiling face?</p><br/><p>But right now, he was a prisoner.</p><br/><p>He was very clear that the other had not killed him because he probably had an interest in his forging and seal creation skills. If he was of no use, there would only be one outcome for him.</p><br/><p>He felt unparalleled terror.</p><br/><p>At this moment, with a creak, the door was pushed open.</p><br/><p>A young entered his vision, the one that had captured him.</p><br/><p>He knew the time to decide his fate had arrived.</p><br/><p>Translator Ramblings: So Gongsun Cha is definitely in ningmai and at a higher level than Zuo Mo is. The whole package matters but at this point … … poor Zuo Mo. First his ling power problems, and now his mo physique is stuck in a rut.</p><br/><p>The yao will be revisited in this story but not at this exact moment.</p><br/>\n</div>"}