{"title": "Chapter Four Hundred and Eighty Seven – Come!", "id": 487, "volume": 5, "url": "http://boxnovel.org/world-of-cultivation-chapter-four-hundred-and-eighty-seven-%E2%80%93-come", "volume_title": "Volume 5", "body": "<h1>Chapter Four Hundred and Eighty Seven – Come!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Four Hundred and Eighty Seven – Come!</p><br/><p>Having swallowed the yin granite fiend fire, Lil’ Fire was like an inflated balloon, its body was now black and red. It slowly flew down from the shell of light at an extremely slow rate, as though it was a fatty that had eaten too much and was moving slowly with a large body.</p><br/><p>Lil’ Pagoda came out of somewhere and circled Lil’ Fire, nudging Lil’ Fire and then sitting on Lil’ Fire.</p><br/><p>“Daren? Isn’t Lil’ Fire a fire yao beast?” Xie Shan’s expression was uncertain.</p><br/><p>“Yes.” Zuo Mo reflexively nodded.</p><br/><p>“Are all fire yao beasts this powerful?” Xie Shan showed admiration. Fire yao beasts were not commonly seen but were not rare. More importantly, it was not expensive. Maybe he could buy a fire yao beast.</p><br/><p>He did not know that the black fire was yin granite fiend fire but he had seen the power of the fire crows, and he knew the fire was not ordinary. Even the slowest person knew that Lil’ Fire wasn’t ordinary based on how Lil’ Fire was able to consume all the fire.</p><br/><p>Zuo Mo felt slightly stunned and his expression was strange. “I don’t know.”</p><br/><p>Xie Shan rubbed his hands and said yearningly, “Daren, how about getting Cheng Daren to breed a few more, and give each person one!” He turned his face and looked at the slowly flying Lil’ Fire, saying heatedly, “Looking at Lil’ Fire’s figure, it’s one that is good at breeding. Why don’t we breed a few more … …”</p><br/><p>Lil’ Fire’s ears were very keen. Hearing this, its round body suddenly froze.</p><br/><p>A vision suddenly floated up of it being held captive in the beast pool, a group of little Lil’ Fires jumping around it. It uncontrollably shook. The body which had just been tinged black instantly became pitch black.</p><br/><p>With a bang, it dropped onto the ground, creating a great bloom of dirt. It furiously wriggled its ball-like body and fled in panic.</p><br/><p>Looking at Lil’ Fire’s sorry state, Zuo Mo roared in laughter.</p><br/><p>His mind returned to the sky and the smile on his face gradually disappeared.</p><br/><p>The xiuzhe in the sky showed no intentions of leaving and there were several more groups that were further away.</p><br/><p>Do you think that Turtle Island is a fat piece of meat?</p><br/><p>Zuo Mo smirked coldly inside.</p><br/><p>The death of the Fire Crow Daoist only caused a small furor. Everyone quickly calmed down. Other than those geniuses that came from those large sects, normal jindan had to experience many battles and the were experienced with death.</p><br/><p>They were attacking a large island with an island formation, how could there not be any fatalities?</p><br/><p>But the problem was that layer of azure shell had not change at all.</p><br/><p>“Is there any signs of it weakening?” Wei Li Tian asked A Xin.</p><br/><p>“No.” A Xin’s answer was very decisive. There had been a few moments where the formation had shown slight rippling but he could not grasp what kind of effect this change indicated.</p><br/><p>He had never heard of the wonders of this formation.</p><br/><p>A Xin started to be suspicious of the origins of this group of people. This large formation was not something a normal sect could possess. Only those ancient sects with long histories could possess something like this.</p><br/><p>“Turtle Island’s origins are probably not simple, this formation is very powerful!” A Xin decided to state his opinion because the following actions would determine his own life and death.</p><br/><p>A Xin never told lies. Wei Li Tian showed a cautious expression. He asked Qiu Ling, “Can you divine their origins?”</p><br/><p>Qiu Ling gave a grimace. “This subordinate does not have the power.”</p><br/><p>Many people only knew that divination could predict the future and detect all kinds of thing but did not understand there were many restrictions. If one wasn’t careful, their souls would be destroyed. Also, it wasn’t possible to divine everything. The more specific the matter, the harder it was to divine and the greater the price that had to be paid.</p><br/><p>Wei Li Tian did not speak. He decided to wait and see.</p><br/><p>———</p><br/><p>There was a group of people not far from Wei Li Tian, Leng Wei’s group that Zong Ru had encountered in Xu Ling City.</p><br/><p>Leng Wei glanced at Wei Li Tian and said in a low voice, “Everyone, be careful. That is Wei Li Tian.”</p><br/><p>“Butcher Wei Li Tian!”</p><br/><p>Some people exclaimed. This name represented death to them.</p><br/><p>The red-clothed male showed a rebellious expression and snorted. “So what if it is Wei Li Tian? If he dares come, we can kill him! Boss, can we take down this Turtle Island? Dragging on like this, these groups are like girls!”</p><br/><p>Leng Wei shook his head. “Not so simple, this formation is very powerful!”</p><br/><p>“Then what? We stand and watch?” the red-robed male said urgently. “That Turtle Island is brimming with wealth. If we can get it, we’ll be rich!”</p><br/><p>Leng Wei’s brow creased. His nephew, Leng Sheng’s talents were exceptional and had become a jindan at a young age but he was worried about the other’s fiery temper.</p><br/><p>As they spoke, another few jindan went forward and started to attack the formation.</p><br/><p>———</p><br/><p>At this time, several figures suddenly flew out of the island and caused everyone to stop talking.</p><br/><p>“Ha ha! Turtle Island Turtle Island, a bunch of turtles hiding in their shells! What! Finally can’t stand it! Have you come to surrender?” a xiuzhe said smugly, “As long as you surrender and leave immediately, we’ll spare your lifes! Otherwise, with so many good heroes and men here, when we defeat your formation, hehe, won’t leave a chicken alive!”</p><br/><p>Zuo Mo looked coldly at the surroundings and ignored that person.</p><br/><p>At his side, Ma Fan’s expression suddenly changed. He snorted coldly, “Sneaking around!”</p><br/><p>Before his voice stopped, the flying sword in his hand twisted in the air. Pew, blood sprayed and a limb shot out of the air. A figure wailed and tripped.</p><br/><p>Ma Fan had been the best at concealment in the past. He was the first to detect someone was sneaking near Daren to try to assassinate him so he had been merciless in his attack.</p><br/><p>At a distance, Leng Wei and the others expressions changed. “It’s him!”</p><br/><p>Their gazes all landed on Zong Ru who was standing beside Zuo Mo. Their encounter at Xu Ling City that day had left a deep impression on them of Zong Ru so when they saw him standing next to Zuo Mo, they were very shocked.</p><br/><p>Wei Sheng was on Zuo Mo’s right, Shu Long on Zuo Mo’s left. Zong Ru was next to Wei Sheng and was the second to Zuo Mo’s right.</p><br/><p>No matter who it was, none of them had imagined the true master of Turtle Island was this outrageously young youth! Looking at that face that still held a thread of tenderness, everyone found it hard to believe.</p><br/><p>Zuo Mo did not speak and displayed great calmness. In that glance, he had judged the situation. There were five groups of people, and what he felt was the greatest threat was that group with forty to fifty people. Zuo Mo was very sensitive to the presence of battle and he saw with a glance that this large group were not friendly.</p><br/><p>The other groups were not as high of a threat to him.</p><br/><p>Especially this group that was closest to him, there were only five people!</p><br/><p>———</p><br/><p>“So it is a little baby whose hair hasn’t all grown out!” Leng Sheng gave a cold snort and had an unconcerned expression. “I had thought it would be a powerful person!”</p><br/><p>Leng Wei did not speak. When that sword had cut off the arm, this youth that was outrageously young didn’t even bat an eyelash.</p><br/><p>He was too calm! This was a calm that did not fit his age!</p><br/><p>———</p><br/><p>At this time, a bellow came from the group of people nearest Zuo Mo. “Such daring! At death’s door and you dare to harm one of ours! You want to die! Brothers, kill this group of children, don’t leave any alive!”</p><br/><p>Zuo Mo’s gaze landed on him.</p><br/><p>His eyes were cold as he spat one word out, “Kill!”</p><br/><p>Before his words finished, Xie Shan, Ma Fan, Lei Peng, Nian Lu and A Wen attacked!</p><br/><p>From the beginning, the other side had carefully maintained a distance from Zuo Mo’s group but they had never expected the distance which they thought was extremely safe was enough for Xie Shan and the others!</p><br/><p>Xie Shan and the others had long practiced the three section wave killing charge. Short-distance charges were seeped down into their bones and were like an instinct!</p><br/><p>Between two points, a straight line was the shortest!</p><br/><p>Sword up, power, accelerate, and a charge without any finesse!</p><br/><p>Four ruler-straight golden sword lights flashed in everyone’s field of view.</p><br/><p>The exception to Guard Camp, A Wen walked a path completely different than the others—he was a Mo Shadow Guard skilled in speed! With a light saw, the feathers around him shook lightly and his body disappeared in the air like a ghost.</p><br/><p>The five people paled, hurriedly activating their ling armor to block this attack!</p><br/><p>Pia!</p><br/><p>Four heads left necks and flew into the air!</p><br/><p>The power of the fifth-grade gold crystal sword was displayed in this kind of charge! The other’s ling armor was like paper-mache and did not stop them at all.</p><br/><p>There was a bowl-sized bloody hole at the throat of the last person. No one detected how it had formed!</p><br/><p>It was like the most practiced butcher treating the lamb on its board, hand up, blade down!</p><br/><p>A battle finished in the blink of an eye with one side completely losing.</p><br/><p>Many people showed a hint of terror. Such a sharp and decisive attack was out of everyone’s expectations!</p><br/><p>Shouldn’t they be afraid?</p><br/><p>Wei Li Tian and Leng Wei’s expressions started to become grave. They saw and understood more than average xiuzhe and the shock they received was much greater than normal xiuzhe.</p><br/><p>The four sword xiuzhe had made the same move … … clean and crisp, an attack without any finesse, it had the scent they were familiar with, the scent of a battalion!</p><br/><p>The sky above Turtle Island was completely silent!</p><br/><p>At this time, a cold smile floated at the corner of Zuo Mo’s mouth. He slowly said, “I hadn’t expected Turtle Island to receive so many heroes today.”</p><br/><p>Zuo Mo’s voice was not loud, his tone did not change. He seemed to be narrating a very normal matter but with slight disdain.</p><br/><p>Yet in this silence, his voice was so clear and echoed in the sky.</p><br/><p>At this moment, no one dared to underestimate this outrageously young Island Master any longer!</p><br/><p>“You can fight however you want over the ruins! But!”</p><br/><p>Zuo Mo’s voice paused, his eyes fierce as he looked at the surroundings. The murderousness on his face was exposed as he slowly breathed out.</p><br/><p>“If someone wants to target our Turtle Island, then you are welcome to see if my sword is sharp or not!”</p><br/><p>Zuo Mo seemed to be uncaring that there were multiple numbers of jindan around him.</p><br/><p>“Such a great tone!” A shout came from a short distance away.</p><br/><p>At Zuo Mo’s side, Wei Sheng’s brow creased. He stepped forward and his wrist turned. The black sword that was like a horse-chopping sabre seemed to be pulled out of a non-existent sword sheathe, one that was a void.</p><br/><p>The speed he was pulling out the sword was not fast but as the sword rubbed the air, it created a tail of blinding sparks!</p><br/><p>A sword hum shook the surroundings!</p><br/><p>Wei Sheng dealt a blow.</p><br/><p>Translator Ramblings: Let’s have a discussion about pets and working animals and my viewpoint on Zuo Mo as a pet owner.</p><br/><p>There is a slight distinction which might put Zuo Mo’s actions into perspective. Working animals are the ones that are domesticated and then perform tasks or have specific duties ie. Transportation, herding sheep, plowing fields, producing milk. Then we have pets which are mostly for companionship and amusement to the owner.</p><br/><p>In most Chinese fantasy stories, what we usually have are working animals, because they are expected to fight for the owner in exchange for food, shelter, or an increase in strength, regardless of whether they are called pets or not. In a way, Silly Bird and Lil’ Black started out like this for their transportation and ling seeking abilities but Zuo Mo hasn’t needed those talents recently. For example, he hasn’t upgraded LIl’ Black’s abilities after the two hundred or so chapters. The other pets Zuo Mo have come about due to accidents or good fortune, like Lil’ Pagoda and Lil’ Fire. Initially, Zuo Mo never expected them to work for him and doesn’t demand things of them. That’s why, right now, he doesn’t seem to be concerned about their cultivation and playing around. He isn’t expecting them at present to make him money or fight. There are pet shows in real life but most people do not expect their cats to work for them or make money. He’s the one providing them with food, resources and shelter because that is what most people do for their pets. As long as they are happy and fed, Zuo Mo doesn’t really need to do much else. He’s not neglecting the pets because he does play with them occasionally and they have each other for companionship.</p><br/>\n</div>"}