{"title": "Chapter Four Hundred and Eighty Two – Brutish Bird", "id": 482, "volume": 5, "url": "http://boxnovel.org/world-of-cultivation-chapter-four-hundred-and-eighty-two-%E2%80%93-brutish-bird", "volume_title": "Volume 5", "body": "<h1>Chapter Four Hundred and Eighty Two – Brutish Bird</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Four Hundred and Eighty Two – Brutish Bird</p><br/><p>When Zuo Mo reached the cave entrance, he heard a sharp shriek, and his expression changed.</p><br/><p>Silly Bird!</p><br/><p>He charged in without hesitation!</p><br/><p>Entering the cave, the lighting became dim, but for Zuo Mo it was as though it was lit up by daylight. There was a thick layer of insect corpses on the ground but he did not care to look at them and dashed lightning fast towards the deep reaches of the cave.</p><br/><p>A short while later, Zuo Mo saw Silly Bird and his heart relaxed slightly.</p><br/><p>Silly Bird was facing off against an enormous insect!</p><br/><p>In a corner nearby, Tenth Grade was holding its sword as it furiously panted. It was at the end of its strength.</p><br/><p>When Zuo Mo’s attention turned from Silly Bird and Tenth Grade to the enormous insect, he couldn’t help but inhale sharply. This large insect was shaped like a small hill and wrapped in black armor that looked extremely hard. It had large limbs that were like that of a spider, each was extremely thick and had rows of slightly curved spikes extended outward, making its legs look as though they were covered in teeth. Zuo Mo believed that if even one leg swept its target, it would tear off skin and flesh!</p><br/><p>At the end of its legs, hooked bone spikes tightly gripped the ground. In front of these feet, the hard rock was like mud that was easily penetrated.</p><br/><p>The two eerie red eyes of the enormous insect stared at Silly Bird. It had a destructive presence that held a thread of decay came from its body.</p><br/><p>Zuo Mo had never expected that such a dangerous yao beast was living on his island!</p><br/><p>At this time, Silly Bird moved!</p><br/><p>In the air, an afterimage flashed across Zuo Mo’s vision like lightning, so fast he could not capture it!</p><br/><p>Clink!</p><br/><p>The sound of metal colliding!</p><br/><p>In the darkness, a ball of sparks shot out!</p><br/><p>The enormous insect wasn’t an average yao beast and was extremely alert. Its two front legs shielded its face and did not show any openings.</p><br/><p>The armor on its body was abnormally strong. Silly Bird’s claws that could easily penetrate talismans could not do anything to its armor.</p><br/><p>Silly Bird was clearly angered by the opponent’s hardiness. With a long call, her wings suddenly spread, her eyes burning as a red flush came onto the beak like it was dripping with blood!</p><br/><p>With a flap of her wings, she was like lightning!</p><br/><p>Clink!</p><br/><p>An even stronger burst of sparks blossomed in the air!</p><br/><p>The enormous insect clearly could not stand against it and was forced half a zhang back, the rock under its feet shattering.</p><br/><p>In a killing mood, Silly Bird furiously attacked!</p><br/><p>Clink clink clink!</p><br/><p>The enormous insect repeatedly fell back, the rock under its feet continuously shattering and being powdered under the repeated blows! Ripples spread outwards with the enormous insect as the center!</p><br/><p>The body of the enormous worm continuously sank. Like it was a pillar of wood, it was being hammered into the ground!</p><br/><p>It finally showed hints of terror but it was not so easy to escape a berserk Silly Bird! Silly Bird’s attacks were like a storm and the enormous insect didn’t even have a chance to breathe, much less escape.</p><br/><p>If it wasn’t for its freakishly strong armor, it would have died long ago.</p><br/><p>At the side, Zuo Mo gaped with wide eyes.</p><br/><p>He had come with the panicked thought of rescue but at this time, there was only one thought in his mind, this insect was pitiful!</p><br/><p>Of course, he pitied it but definitely would not rescue it!</p><br/><p>He was also drooling as he looked at the freakishly strong armor of the insect. An armor that could stand up against such ferocious attacks was definitely a treasure! If he took this armor and made ling armor, he wouldn’t even need to dodge normal flying swords.</p><br/><p>Treasure, treasure!</p><br/><p>At this time, a sudden change happened!</p><br/><p>The insect that had been on the defense all this time suddenly opened its mouth and spat out a ball of black energy. Silly Bird was caught unprepared and was hit by the black energy.</p><br/><p>Silly Bird’s body suddenly froze, she lost control and dropped to the ground!</p><br/><p>Dreaming about the ling armor, Zuo Mo hadn’t expected the insect to do this. He acted to attack when he saw the situation!</p><br/><p>Yet he hadn’t expected to see Silly Bird sway like she was drunk as she leapt up from the ground.</p><br/><p>Zuo Mo was slightly reassured. It seemed that Silly Bird didn’t have a major problem. He looked attentively at the enormous worm. If it showed any signs of ill intent towards Silly Bird, he would attack viciously. But the enormous insect also showed tiredness. That ball of black smoke probably was not something it could release easily.</p><br/><p>The enormous insect stared at Zuo Mo and hissed from its mouth as its body retreated.</p><br/><p>It wanted to escape!</p><br/><p>Zuo Mo instantly judged the insect’s intentions. He decided to attack!</p><br/><p>How could he let such a treasure slip from his hands?</p><br/><p>Suddenly, a high and sharp shriek came from beside him and penetrated his ear. Zuo Mo’s expression changed and reflexively covered his ears! The rock on the cave ceiling started to fall and the fear the enormous insect held grew!</p><br/><p>Silly Bird attack again!</p><br/><p>Just like before, the enormous insect curled into a ball with its front limbs covering its face.</p><br/><p>Just as Silly Bird was going to touch the insect’s body, her diving attack suddenly turned into a snatching motion!</p><br/><p>Zuo Mo looked with shock as Silly Bird grabbed the enormous worm that was much larger than her, lifting it into the air like a condor grabbing a sheep!</p><br/><p>The enormous insect instantly panicked, its six limbs dancing as it hissed.</p><br/><p>Zuo Mo seemed to see Silly Bird smile viciously as she carried the enormous insect and then used her body as a pivot to swing the insect!</p><br/><p>The enormous insect was like a hammer that left the hand. With a howl, it hit the wall of the cavern!</p><br/><p>Dong!</p><br/><p>An enormous sound, the cave shuddered and rock rained down!</p><br/><p>Zuo Mo had a feeling that the cave was going to collapse!</p><br/><p>No matter how hard of armor it had, the enormous insect was left stunned by this smash. It laid down in a pit of shattered rock. This was a pit that had been caused by its collision!</p><br/><p>Before it could struggle up, its body suddenly felt light.</p><br/><p>It was grabbed into the air again!</p><br/><p>Another throw!</p><br/><p>Dong!</p><br/><p>Rocks hit Zuo Mo’s body but he didn’t notice them at all. He gaped at this crazy scene in front of him!</p><br/><p>In a berserk rage, Silly bird threw the enormous insect over and over and the insect was like a hammer that was swung again and again and then struck the ground, the ceiling, the walls and the stalagmites. If one wasn’t seeing it with their own eyes, no one could have thought that there was such terrifying strength in Silly Bird’s not-so-powerful looking body!</p><br/><p>Zuo Mo shook. At the same time, Tenth Grade that was gaping in the corner also shook.</p><br/><p>So scary … …</p><br/><p>… ….</p><br/><p>Five hundred and fifty one … … five hundred and fifty two … …</p><br/><p>… …</p><br/><p>One should offend a villain before offending Silly Bird!</p><br/><p>Silly Bird! What kind of silly bird was this? This was clearly a brute bird!</p><br/><p>Pia!</p><br/><p>The freakishly strong insect body was not freakish enough compared to Silly Bird and was split into five pieces!</p><br/><p>Silly Bird finally threw away the insect legs in her claws with satisfaction, raised her bird head and stalked her female bird walk as she left. In the entire process, she didn’t even glance at Zuo Mo.</p><br/><p>We are generous and won’t argue with a brutish bird … …</p><br/><p>It was impossible for non-freakish people to argue!</p><br/><p>Zuo Mo went to clean up the insect corpse with great self-awareness.</p><br/><p>Pitiful insect, didn’t it just spit out a mouthful of black smoke? It was smashed to death! So pitiful!</p><br/><p>———</p><br/><p>“Daren! Daren! This is great! This is a wonderful thing!” Gu Ming Gong rubbed his hands as he looked with bright eyes at the five pieces of the insect corpse in front of him excitedly. “This is the first time this subordinate has seen such a large deep granite leaf insect! Is this the insect queen? Right right right, this is the insect queen!”</p><br/><p>Zuo Mo knew that the insect was something good, but he did not recognize it so he brought it to Gu Ming Gong’s for appraised. He believed that with Gu Ming Gong’s knowledge, he would definitely recognize it.</p><br/><p>“Deep granite leaf insect?”</p><br/><p>“Deep granite leaf insects mostly live in dark and deep caverns. They are extremely reliant on earth energy. Normal deep granite leaf insects are a cun long and each group will have an insect queen. What is most useful about the deep granite leaf insect is its armor! This is the famous black gold leaf armor!”</p><br/><p>The excited Gu Ming Gong spoke quickly.</p><br/><p>“Each black gold leaf shell is just a bit larger than a willow leaf, it naturally has exceptional defensives. With three hundred pieces, it is possible to forge a black wave leaf armor, that is fifth-grade ling armor!”</p><br/><p>Zuo Mo thought of the dense layer of insect corpses in the cave and was instantly excited. So many corpses, there was hundreds of thousands!</p><br/><p>Fifth-grade ling armor</p><br/><p>Zuo Mo’s mind was blown by this good fortune that had dropped out of the sky!</p><br/><p>Gu Ming Gon did not notice Zuo Mo’s expression. He looked with a burning gaze at the five pieces of insect corpse in front of him, his voice filled with disbelieving excitement. “This insect corpse is even better! Using this, this subordinate has the confidence to forge a sixth-grade ling armor which can rank on the talisman rankings! Such a perfect insect queen is almost unbelievable!”</p><br/><p>Sixth-grade ling armor that could go rank in the talisman rankings!</p><br/><p>Zuo Mo almost fainted. He had never worn sixth-grade ling armor!</p><br/><p>A sixth-grade ling armor that could go onto the talisman ranking, would he become jindan just by putting it on … …</p><br/><p>“This expert really has uncanny skill! Even able to dismember the insect queen, really powerful! Look at this cut, clean and without any hesitation … …”</p><br/><p>Gu Ming Gon’s expression was intoxicated.</p><br/><p>Zuo Mo shook and returned to normality.</p><br/><p>He thought of a certain brute bird.</p><br/><p>———</p><br/><p>On the Yinyang Twin Butterfly, Tenth Grade was completely naked, black energy shrouding his entire body. His eyes were tightly closed and clearly was at an important time.</p><br/><p>Threads of black energy continuously came out of his body and entered the black butterfly wing under his feet. What was strange was that the border between black and white was not pushing towards the white wing, but into the black.</p><br/><p>Each thread of black energy seemed to be nutrients for the white wing, nurturing it.</p><br/><p>Gradually, a light layer of white light appeared on the white wing.</p><br/><p>Dots of white light shed off the white wing and floated upwards. When it reached the same height as Tenth Grade, these dots of white light gathered into a ball to become a rice-sized ball of white light.</p><br/><p>When the ball formed, the speed it absorbed white light suddenly increased.</p><br/><p>The white light on the white wing was quickly absorbed and its body became the same size as Tenth Grade.</p><br/><p>Tenth Grade opened its eyes. Looking at the white ball of light, it showed rare joy.</p><br/><p>He sat with legs crossed and waited silently.</p><br/><p>Translator Ramblings:</p><br/><p>Zuo Mo: I’m here, I’m here, watch the Scalping Zombie save you … … oh … … didn’t have to fight and there is so much treasure on the ground! Jingshi!</p><br/>\n</div>"}