{"title": "Chapter Four Hundred and Ninety Two – Greenwood Secret Realm", "id": 492, "volume": 5, "url": "http://boxnovel.org/world-of-cultivation-chapter-four-hundred-and-ninety-two-%E2%80%93-greenwood-secret-realm", "volume_title": "Volume 5", "body": "<h1>Chapter Four Hundred and Ninety Two – Greenwood Secret Realm</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Four Hundred and Ninety Two – Greenwood Secret Realm</p><br/><p>Zuo Mo was having a very strange dream.</p><br/><p>There were endless clouds and water over the remote swamp, the howls of unknown wild beasts sounding among the waist-high grasses, long multi-colored bird with their long tails flying around the high and green forests. The sky suddenly darkened, Zuo Mo raised his head and inhaled sharply. An large and strange looking unidentified bird slowly passed over his head, like a black cloud .</p><br/><p>Zuo Mo had never seen such a gigantic bird before. In front of it, the wasteland beast was like a little child. Its spread wings covered the sun and sky, creating darkness and everywhere it passed, it was as though night had come.</p><br/><p>He dumbly gaped with an upraised face.</p><br/><p>Before he could recover from his shock, a low voice suddenly came from behind him.</p><br/><p>“Who are you? Why have you invaded my Greenwood Secret Realm? Leave now, and your life will be spared!”</p><br/><p>Zuo Mo jumped in fright and hurriedly turned around. He found that a blurry figure had appeared near him at an unknown time. This person was clearly near him but no matter how he tried, Zuo Mo could not make out his figure. The other’s figure was a blur.</p><br/><p>“Greenwood Secret Realm? Where is this place? Who are you? Why am I here?” Zuo Mo asked dazedly.</p><br/><p>He still hadn’t managed to react and understand how he had appeared here. He tried to recall but his memories seemed to be blank.</p><br/><p>The other did not seem to expect Zuo Mo to ask such a question and was instantly stunned. He said to himself, “Who am I?”</p><br/><p>“You don’t even know who you are?” Zuo Mo asked curiously. He suddenly found the other was especially slow.</p><br/><p>“Who am I? Who am I … …” the dark figure recited over and over, his tone slightly panicked. He could not remember.</p><br/><p>Zuo Mo suddenly felt the other was pitiful and felt some empathy due to being afflicted with the same predicament himself. His features had been changed and his memories erased so all of his memories before Wu Kong Mountain had disappeared.</p><br/><p>“Don’t rush, don’t rush.” Zuo Mo hurriedly comforted the other, “It’s alright if you cannot remember. A man’s name is meaningless in this world.”</p><br/><p>The other stopped and seemed to ponder Zuo Mo’s words.</p><br/><p>Zuo Mo said in a familiar tone, “Brother, what is this Greenwood Secret Realm? Are you familiar with this place?”</p><br/><p>“Of course I am familiar,” the other unconsciously replied, “the Greenwood Secret Realm is the Greenwood Secret Realm, the place that I guard.”</p><br/><p>“So this is Brother’s territory!” Zuo Mo’s eyes instantly lit up and he flattered, “No wonder I feel that Big Brother is of such extraordinary bearing. From the presence, you do not seem like the average person! These days, anyone with territory is a great person! Big Brother, you are too strong! Since this is Big Brother’s territory, Big Brother has to cover Little Brother!”</p><br/><p>It may have been that he was shaken by Zuo Mo’s words or that he still hadn’t recovered from the conundrum of “who he was’ but he paused when facing Zuo Mo’s flattery and then asked dumbly, “What is cover?”</p><br/><p>“That is if there is wine, everyone drinks together, and if there is food, everyone eats together,” Zuo Mo said with a thick face. He was not speaking nonsense, he just felt that the other held no enmity towards him. It may have been that the other also had amnesia that Zuo Mo found a thread of intimacy with the other.</p><br/><p>This kind of feeling was very rare for Zuo Mo.</p><br/><p>The shadow made a sound of acknowledgement without real understanding. The blurry figure started to clear and Zuo Mo finally saw the other’s true features.</p><br/><p>A head full of bright green hair that extended to the shoulders, a handsome but thin face, the features were exquisite as though they were carved. The black and shining eyes were as deep as the dark night that stared at Zuo Mo with interest. The clothing he wore was made from countless black-green vines with the leaves as armor that were layered beautifully.</p><br/><p>“As expected of Big Brother! So handsome that women will have to use illusory formations!” Zuo Mo gave another piece of flattery. After saying this, he couldn’t help but feel a sense of tragedy. Every person around him was extraordinarily handsome and as their boss, there was too much pressure on him!</p><br/><p>No wonder it had been such a long time since he had encountered those beautiful women in illusory formations, the ones that increased a person’s heartbeat and the flow of blood, it was probably related to this … …</p><br/><p>“Women use illusory formations?” The other had a confused expression. He clearly did not know what Zuo Mo was speaking about.</p><br/><p>Zuo Mo did not explain and looked in all directions as he asked curiously, “Big Brother, how did I get here?”</p><br/><p>“This is the Greenwood Secret Realm of the Sun Shen Temple, are you here to explore the Sun Shen Temple?”</p><br/><p>The other suddenly lost his woodenness, his eyes as sharp as knives that seemed to piece Zuo Mo’s heart.</p><br/><p>Zuo Mo shook and his memories came back like a flood. He instantly remembered everything.</p><br/><p>“This is the Sun Shen Temple?” Zuo Mo said with bewilderment. “I was clearly studying shen power by touching the rock wall, have I comprehended shen power?”</p><br/><p>“Comprehend shen power?” The green-haired male’s brow creased, “Shen power is innate, how can there be comprehension?”</p><br/><p>“Shen power is innate?” Zuo Mo’s head shook like a rattle drum. “I never heard of anyone born with shen power. It might be that the ancient era is different than the cultivators now. Shen power was lost a long time ago. What we cultivate now is ling power, spiritual consciousness, and mo physique.”</p><br/><p>“Shen power is lost?” The green-haired male stilled.</p><br/><p>“Tens of thousands of years, it would be strange if it was not lost!” Zuo Mo muttered.</p><br/><p>In reality, he didn’t have good feelings regarding ancient things. Even the Archaic Wasteland Sacrificial Art that was from just a few thousand years ago had tortured him to the point he wanted death, much less an ancient power like the Soul Setting Divine Light.</p><br/><p>“Tens of thousands of years … … so it has been tens of thousands of years … …” the green-haired male murmured to himself, his expression lost.</p><br/><p>“Big Brother, are you alright?” Zuo Mo asked carefully.</p><br/><p>The green-haired male did not pay attention to him. A long while later, he gave a long sigh and said, “So the Sun Tribe is also gone.”</p><br/><p>Zuo Mo nodded. “Gone a long time ago. There are no tribes now, no totems. I’ve gone to the Sealed Extinction Battlefield, there is a patch of gold crystal sand sea there, it should be the place that a warrior of the Sun Tribe fell. Oh, I also saw the Sun Crystal Seed.”</p><br/><p>Zuo Mo recalled the Sun Crystal Seed that he had gotten from the Sealed Extinction Battlefield. After the strange corpse sealed the Sun Crystal Seed, it was like a normal crystal ball.</p><br/><p>He only knew this was something good but up until now, he did not know how to use it. The strange corpse only told him this was a good item, but Zuo Mo couldn’t even determine its grade, and didn’t know when he could use it.</p><br/><p>Wealth should not be shown. Zuo Mo did not know if the other would be greedy so he didn’t plan on taking it out.</p><br/><p>“Sun Crystal Seed … … as strong as the Sun Tribe is, it cannot escape the ravages of time.” The green-haired male sighed and then he suddenly raised his head to look at Zuo Mo with a wry smile. “Even if I take it, your Sun Crystal Seed is useless to me. Do not worry that I will take it.”</p><br/><p>Zuo Mo almost choked on air. He was shocked inside, and the next words the green-haired man almost caused his soul to depart.</p><br/><p>“A person that has the power to seal the Sun Crystal Seed is very strong!” the green-haired male said lightly.</p><br/><p>Even with Zuo Mo’s thick face, he felt unable to bear up with being exposed but what he was shocked even more at was the power of the green-haired male!</p><br/><p>The other was even able to examine what was inside his ring. How great was his power!</p><br/><p>“No wonder you were able to enter here,” the green-haired-male said to himself, “fate naturally occurs.”</p><br/><p>Zuo Mo was confused and couldn’t help but ask, “Big Brother, what are you talking about?”</p><br/><p>The green-haired male suddenly raised his head and smiled slightly. “Your luck is pretty good, come inside with me.”</p><br/><p>Zuo Mo felt his vision blur and then he was at a different place.</p><br/><p>When he looked around, his mouth instantly opened and could not close.</p><br/><p>Looking around, he saw endless dense forests. Tree crowns formed a vast ocean of trees. He was able to see ancient yao beasts suddenly appear and disappear among the ocean of trees.</p><br/><p>Zuo Mo was on the crown of an enormous tree.</p><br/><p>What was strangest was that there were seven suns on the sky above his head that were like seven enormous fireballs hanging on the firmament.</p><br/><p>“This is the Greenwood Secret Realm,” the green-haired male said faintly. There was a transparent bubble in his hand and inside it was a miniature tree ocean.</p><br/><p>“Greenwood Secret Realm?” Zuo Mo asked.</p><br/><p>“The Sun Tribe was one of the strongest tribes, and their temples were spread across the land. See the seven suns above your head? They symbolize the status of this shen temple, the highest ranked shen temple will have ten suns.”</p><br/><p>The green-haired male slowly said, “The shen temple is primarily fire-oriented and so it has gold, wood, water, and earth realms positioned to guard the four cardinal directions of the temple. Each secret realm has a defender, and I am the defender for Greenwood Secret Realm.”</p><br/><p>Zuo Mo gaped.</p><br/><p>“I’m not some big brother,” the green-haired male said with a bitter smile, “those that guard the secret realms are experts that the Sun Tribe have captured from other tribes. I remember who I am now. I am the sun of the Green Vine tribe, Qing Ling. The realm masters of the three other secret realms are also experts of other tribes.”</p><br/><p>Zuo Mo was even more stunned. He finally seemed to understand a bit of how powerful the Sun Tribe had been in the past.</p><br/><p>“The Sun tribe has fallen, we will also die.” Qing Ling had an expression of release.</p><br/><p>Zuo Mo jumped. “Why is it like this?”</p><br/><p>“All of us had jinzhi set into us. The Sun Tribe has fallen, so theoretically, we should have died long ago. But the shen temple was suddenly closed down in the past and was blocked off from the outside world. It also blocked off the power of the jinzhi. Now that the shen temple is going to open and see the light of day again, the power of the jinzhi will not be blocked any longer.</p><br/><p>The green-haired male’s tone was nonchalant. Seeing Zuo Mo’s panicked expression, he comforted, “This is a kind of release for us. The shen temple has been closed off for so many years, without the power of the totem, it is a fate worse than death when the jinzhi causes a backlash every decade.</p><br/><p>He did not want to speak more of the topic and said, “You have the Sun Crystal Seed so you should not have any problem inside the shen temple if you do not go to places too dangerous. The Sun Tribe had been dominant for a time and there are countless treasures inside the shen temple. Even though much has been destroyed but there should be some things remaining, this is an opportunity for you.”</p><br/><p>“However ,before that, you need shen power.”</p><br/><p>These words were like a basin of cold water that poured from head to toe. Zuo Mo’s heart was cold.</p><br/><p>Why did it still need shen power … …</p><br/><p>Seeing the expression on Zuo Mo’s face was as though he was going to cry without tears, the green-haired male said with a smile, “You have the Sun Crystal Seed. Helping you will not betray the jinzhi of the shen temple. I can help you think of a way with shen power.”</p><br/><p>Zuo Mo’s eyes instantly lit up and he hurriedly said, “What way?”</p><br/><p>Translator Ramblings: Zuo Mo … … making friends with random people … … Exhibit A, Pu Yao, Exhibit B, Shi. You ever get the feeling he’s a magnet for antiques?</p><br/>\n</div>"}