{"title": "Chapter Four Hundred and Ninety Four – Awaken", "id": 494, "volume": 5, "url": "http://boxnovel.org/world-of-cultivation-chapter-four-hundred-and-ninety-four-%E2%80%93-awaken", "volume_title": "Volume 5", "body": "<h1>Chapter Four Hundred and Ninety Four – Awaken</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Four Hundred and Ninety Four – Awaken</p><br/><p>The bright green light was tender and glistening as its threads burrowed into the Sun Crystal Seed.</p><br/><p>The dim Sun Crystal Seed started to violently shake as though there was an ancient beast howling within it.</p><br/><p>Qing Lin’s expression was grave, his black eyes extremely bright like the stars in the night sky. His green hair moved despite the lack of wind and floated freely.</p><br/><p>The Sun Crystal Seed suddenly released a blinding light. Countless sharp golden energies suddenly shot out like swords!</p><br/><p>The blinding red light flowed out of the Sun Crystal Seed following the green light and into Zuo Mo’s body.</p><br/><p>Zuo Mo suddenly felt his mind explode. Countless burning flows that were like lava charged into his mind. A heart-tearing pain came from the bottom of his soul. He didn’t even have time to wail before he lost consciousness.</p><br/><p>At the other end of the green light, Zuo Mo’s eyes were tightly closed, and clearly had fainted. His body floated uncontrollably in the air. The blinding red light shrouded Zuo Mo. It quickly found an opening and burrowed in through Zuo Mo’s mouth and nose.</p><br/><p>This burst of red light came extremely quickly. In a blink, it burrowed completely into Zuo Mo’s body.</p><br/><p>Zuo Mo’s hair suddenly started burning.</p><br/><p>Flames shot out of Zuo Mo’s skin and in a blink, he became a person of fire.</p><br/><p>At this time, a thread of water suddenly rose from Zuo Mo’s dantian to combat the flames. It was the Greenvine Mystical Water that Qing Lin had gifted Zuo Mo.</p><br/><p>The unordinary red light rampaged in Zuo Mo’s body and had suddenly encountered an enemy.</p><br/><p>But this drop of mystical water was not ordinary either. Qing Lin had harvested it from a ten thousand year old vine. After being nurtured for tens of thousands of years, it was extremely pure. The Sun Crystal Seed was domineering, but since its owner had died tens of thousands of years ago, it was not maintained and was lacking compared to in its past.</p><br/><p>With the improvement on one side and the degeneration on the other, the two were evenly matched at the moment.</p><br/><p>The Sun Crystal Seed was forged from the embryo of a sun, and was naturally domineering. Even if it had been tens of thousands of years, and it was greatly damaged, this dominance had not disappeared.</p><br/><p>Encountering a strong enemy, its dominance was stimulated and its fiery presence was released.</p><br/><p>The fire on Zuo Mo’s body rose and shot up. A high temperature shockwave of air swept outwards with Zuo Mo as the center.</p><br/><p>The enormous tree under their feet turned to dust. Everywhere the wave of air passed, the flora turned to dust and the ground started to melt.</p><br/><p>“As expected of the Sun Crystal Seed!” Qing Lin laughed lightly. Looking at Zuo Mo’s face, his thoughts suddenly floated away and those distant and blurry memories seemed to gradually become clear in front of him as though they were swept of dust.</p><br/><p>Brother … …</p><br/><p>A young and unfamiliar face became clear in his mind.</p><br/><p>The distant emotions instantly filled his heart. He turned his face and gazed at Zuo Mo’s unconscious face. That young and unfamiliar face in his heart seemed to gradually merge with Zuo Mo’s face.</p><br/><p>His heart that had not moved for thousands of years seemed to be plucked.</p><br/><p>He smiled.</p><br/><p>He stretched out his right arm and pointed at the sky.</p><br/><p>A shining dot of light suddenly appeared in the sky like a star lighting up!</p><br/><p>A slender and straight golden pillar shot down, from the distant horizon, through the endless void of the firmament above their heads, with the glory of tens of thousands of years!</p><br/><p>It shot rapidly towards the ground and the ray of light accurately struck the finger Qing Lin had raised up.</p><br/><p>Boom!</p><br/><p>A light sound that shook the surroundings!</p><br/><p>Qing Lin’s body shook as though he was struck by lightning. A vast and writhing power suddenly expanded with him as the center!</p><br/><p>Pia pia pia!</p><br/><p>The enormous trees that were dozens of zhang thick were easily cut down as though they were slender rods. The wave of air was destructive and everywhere it passed, the ground rippled and trees flew.</p><br/><p>All of Greenwood Secret Realm was violently shuddering!</p><br/><p>Under the pure golden ray of light, Qing Lin’s eyes flashed with an unspeakable light like a burning star. That free smile carried contentment and warmth.</p><br/><p>He did not tell Zuo Mo that he was the only defender of the four realms that had preserved his intelligence. The other three people’s minds had been lost through the thousands of years, and became monsters that only had instinct and murderous intent.</p><br/><p>In the entire shen temple, he was the only one that had clarity of mind.</p><br/><p>The loneliness of tens of thousands of years, how long it was!</p><br/><p>He did not tell Zuo Mo when the Sun Shen Temple finished opening, the guardians of the realm like him would burn like the suns at the end of their lives, burning as never before, burning away their life!</p><br/><p>He also did not tell Zuo Mo that in these tens of thousands of years, he had gone into every corner of the shen temple. The shen temple that only had him left meant that he could use a portion of the power of the shen temple.</p><br/><p>Maybe this was fate. He could not stop the shen temple from activating. But this was also fate that he encountered a brother.</p><br/><p>Tens of thousands of years … … it was long enough … …</p><br/><p>Under the gold light, he smiled slightly!</p><br/><p>The shen temple violently trembled, rocks rolling on the abandoned sacrificial altar. The shen scripts that were covered in dust and cobwebs lit up. The serene light started to pulse as well, quickly spreading to every corner of the shen temple. The entire shen temple started to tremble.</p><br/><p>After sleeping for tens of thousands of years, the power that once represented the greatest glory of an era was woken from its deep slumber.</p><br/><p>———</p><br/><p>Just preparing to rest, Li Shu suddenly felt the ground under his feet tremble and couldn’t help but pause.</p><br/><p>Earthquake?</p><br/><p>Abruptly, he detected a peerlessly dominant presence suddenly explode nearby! This presence was absolutely dominant, the light like the sun in the middle of the day such that people were unable to face it directly.</p><br/><p>Li Shu was astounded and hurried out of the room.</p><br/><p>When he charged out of the room, the shocking scene in front of him stunned him completely!</p><br/><p>———</p><br/><p>“Don’t know?” the middle-aged man said urgently, “this time, I have spent a great price to get this piece of information. If I cannot find that treasure, it would be a great loss!”</p><br/><p>The Masked Assassin sat woodenly without a word.</p><br/><p>The middle-aged male was impatient but he didn’t dare to direct his anger at the Masked Assassin. He had a pained expression. He had originally thought that with the Masked Assassin present, it would be an easy task but this group of people with unknown origins popped up out of nowhere. He could not let it go.</p><br/><p>At this time, the ground suddenly shuddered.</p><br/><p>“What sort of place is this? They have earthquakes!” In a bad mood, the middle-aged male swore.</p><br/><p>Suddenly, a peerlessly domineering presence exploded without warning. The pressure brought with the terrifying power was like an enormous stone on everyone’s chests, pushing them down uncomfortably.</p><br/><p>The middle-aged male was greatly shocked. He was just going to ask the Masked Assassin when he found that the Masked Assassin had already disappeared.</p><br/><p>He hurriedly charged out of the room. When he saw the figure of the Masked Assassin, he was slightly reassured.</p><br/><p>When he directed his gaze towards the direction the power had erupted from, he seemed to be struck by lightning and stunned where he stood!</p><br/><p>———</p><br/><p>The enormous light pillar that was one hundred and fifty li in radius was continuously shrinking.</p><br/><p>Everyone present had keen eyes, and instantly found it was continuously contracting, no, it was compressing! The golden light was becoming more condensed with every moment and even denser!</p><br/><p>The golden light which had been pure became dark gold after being compressed.</p><br/><p>The ground was trembling, violently trembling, and the pebbles continuously trembled and were thrown about as if they were jumping.</p><br/><p>A deep and muffled sound came from the deep inside earth as though there was a monster howling underneath! Crack, half of a mountain range suddenly crumbled. Some xiuzhe with low cultivation were unable to escape in time and buried alive.</p><br/><p>The xiuzhe all flew into the sky with terror on their faces. In the air, they could see more clearly. The hard ground was like mud at this time, as though there was an invisible hand that was easily molding it.</p><br/><p>Everyone’s already ugly expressions became even whiter!</p><br/><p>In front of such worldly power, their power was so minuscule and insignificant!</p><br/><p>Li Shu was disheveled as he flew next to Elder Shen, “Elder, this is … …”</p><br/><p>“Something definitely is happening in the shen hall!” Elder Shen said in a deep voice. He was also astounded inside, but he showed calmness on the outside. “Do not worry, the Sun Tribe had flourished for a time. It would be unusual if there wasn’t any disturbance when their shen temple opened.”</p><br/><p>Hearing this, Li Shu was slightly reassured. He couldn’t help but praise, “Elder is right! This presence is intimidating!”</p><br/><p>Elder Shen snorted coldly, “Intimidating? The Sun Tribe has died out long ago, and even our sect’s great formation might also have such presence! Do not be frightened by these outdated and rotten powers!”</p><br/><p>“This disciple understands!” Li Shu said hurriedly. It seemed that his words had caused Elder to be displeased. He hurriedly changed the topic. “Elder, do you think that someone has entered ahead of everyone?”</p><br/><p>“Impossible!” Elder Shen shook his head. “The Sun Tribe is extremely closed off to outsiders, and thought of the world to be conquered by them. How can their shen temple allow others to enter? Unless the other is also of the Sun Tribe. But this is basically impossible. After the Battle of Sealed Extinction, all the warriors of the Sun Tribe fell, and they were attacked by the other tribes, and all died out. All of their shen temples were destroyed. This shen temple was able to avoid that fate because, it is very remote and few people knew of it. The other was the head priest at the time saw the situation and closed the shen temple from the inside world and sank it into the ground. Who can live for thousands of years?”</p><br/><p>Li Shu was intoxicated on the words. With Elder’s few words, he depicted a vast ancient battle!</p><br/><p>Suddenly, Elder Shen stopped, his gaze focusing tightly on the pillar of light.</p><br/><p>The light pillar was compressed into ten li, fifteen times smaller than before!</p><br/><p>It wasn’t like a pillar of light now, but a dark crimson and gold pillar that seemed tangible.</p><br/><p>Suddenly, the lower end of the pillar started to disappear. No, it wasn’t disappearing, it was shrinking upwards.</p><br/><p>Those who had keen eyes instantly exclaimed, “It is shrinking inwards!”</p><br/><p>Those that were alerted looked closely. As said, the upper end of the pillar was also shrinking towards the middle at an astounding rate.</p><br/><p>The scene was extremely strange. It was like a golden rod that had two ends that were shrinking back towards the middle and quickly became short.</p><br/><p>Fantastical!</p><br/><p>Everyone knew that this gold pillar wasn’t something substantial but a pillar of light! How could a pillar of light shrink from both ends?</p><br/><p>What was going on?</p><br/><p>The following scene caused everyone to lose the ability of speech.</p><br/><p>Translator Ramblings: More history.</p><br/>\n</div>"}