{"title": "Chapter Four Hundred and Ninety Eight – Golden Crow Sacrifice", "id": 498, "volume": 5, "url": "http://boxnovel.org/world-of-cultivation-chapter-four-hundred-and-ninety-eight-%E2%80%93-golden-crow-sacrifice", "volume_title": "Volume 5", "body": "<h1>Chapter Four Hundred and Ninety Eight – Golden Crow Sacrifice</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Four Hundred and Ninety Eight – Golden Crow Sacrifice</p><br/><p>The red eyes of the golden crows were like two burning balls of fire. Their inky black wings had criss-crossing golden scripts that appeared blinding and grand. They stood high up on the rock pillars and looked down at the people, their fire-red eyes filled with the indifference and disdain like that of deities.</p><br/><p>They seemed to have just woken up from a deep sleep as they lazily flapped their wings as though no one was around.</p><br/><p>The spectators had started to rumble. Golden crows, wondrous beasts from the ancient times, were alive right in front of them!</p><br/><p>In the ancient era, the golden crow was a beast that represented the sun. The flames it produced were as fiery as the sun and could dissolve the hardest metals. They were so strong that people feared them!</p><br/><p>But like the other famed beasts of the ancient era, they disappeared in the long river of time and disappeared from people’s views.</p><br/><p>At this time, there were ten golden crows appearing in front of them. The blow and shock that they gave the spectators was peerless! Even the yuanying, Elder Shen, couldn’t help but gape with his eyes tightly locked onto the ten golden crows.</p><br/><p>“Golden crow … … there really are golden crows!” Elder Shen murmured.</p><br/><p>Li Shu was so shocked that he was unable to speak. No matter how much importance the sect placed on him, he was just a third-generation disciple. When had he ever seen such a spectacle?</p><br/><p>“That’s not right!” Elder Shen’s eyes suddenly narrowed and he recovered his calmness. “These are not the true bodies of the golden crows!”</p><br/><p>Hearing this, Li Shu instantly froze. “Not the true bodies? Then what is it?”</p><br/><p>“It should be the souls of the golden crows!” Elder Shen sighed emotionally. “To be able to seal the souls of golden crows to guard the shen temple, such skill is divine!”</p><br/><p>Li Shu realized it. He carefully inspected the ten golden crows. As he expected, he found that the borders of their bodies were slightly blurry but from this distance it was hard to detect if one did not look closely.</p><br/><p>“But do not underestimate the souls of golden crows. Their power is not any less than seventh-grade ling beasts. There is also ten of them. If based on brute force, we are not enough even if we have ten lives,” Elder Shen gazed at the golden crows and said to himself.</p><br/><p>“Elder, why are the beast soul guardians of the temple suddenly coming out?” Li Shu asked, puzzled. “Has someone moved? Provoked them? But they haven’t attacked … …”</p><br/><p>As he spoke, Li Shu felt something was increasingly wrong and his expression changed dramatically.</p><br/><p>Elder Shen’s face also changed.</p><br/><p>Lu Zhen was confused and did not understand. But looking at the faces of the two daren, he also knew that something had gone wrong.</p><br/><p>At this time, the golden crows that had been perched on the golden pillars suddenly looked at the red sun in the sky. Ten red lines of fire sprouted from the open mouths of the ten golden crows and wrapped around the red sun!</p><br/><p>The little sun exploded in brightness and burned fiercely. The air in the surroundings increased in temperature again.</p><br/><p>At the same time, the curtains of light between the ten stone pillars of the Sun Shen Temple became bright and the curtains of light covered the entire Sun Shen Temple.</p><br/><p>“Haha, I hadn’t thought that we would trip up in such an easy place, someone else has managed to trick us!” Elder Shen’s face was black as he gritted out, “I want to see who has the guts to dare play tricks under this old man’s eyes!”</p><br/><p>Li Shu’s expression was also terrible.</p><br/><p>The fact that the temple guardian souls had appeared but did not attack anyone meant that it wasn’t caused by someone intruding on the defenses of the shen temple. Then there was only one possibility left, someone was controlling the defenses of the shen temple and activated the temple guardian souls!</p><br/><p>“Didn’t the Sun Tribe die out?” Li Shu refocused and asked.</p><br/><p>Sect Leader’s divination would not be incorrect. Both he and Elder Shen believed deeply in this. The change in this matter definitely had occurred in these last two days!</p><br/><p>What Li Shu voiced was what he was most puzzled by. The Sun Tribe had died out long ago, the sect had been sure of this a long time ago. This was the result of having repeated divinations done. This was also why the sect had targeted the Sun Shen Temple.</p><br/><p>The clanspeople of the Sun Shen Tribe had died out and meant that the possibility of having something unexpected happen was not high. Normal people would not be accepted by temples like this.</p><br/><p>Yet what they had not expected was that an accident had occurred at the very place they felt the safest.</p><br/><p>Elder Shen was experienced and knowledgeable. He calmed down and said coldly, “Don’t pay attention to that. We must enter the shen temple immediately before the other completely grasps the shen temple. This is the only chance. These beast spirits will not attack us, they are making a sacrificial ceremony!</p><br/><p>Li Shu froze. Making a sacrifice was a very unfamiliar term for any xiuzhe of the present. His eyes quickly did not show any more shock. Someone was sacrificing using ten golden crow souls!</p><br/><p>He turned around his thinking, using ten golden crow souls as a sacrifice … … what did the other want to do?</p><br/><p>Elder Shen’s expression was dark and showed slight urgency. Before the two people could react, his sleeve twirled around them and the three people disappeared.</p><br/><p>At the same time, several lights flashed across the sky at the same time all flying towards the stone pillar. Evidently, Elder Shen was not the only one to think of this.</p><br/><p>The lights in the air flew at the curtain of light.</p><br/><p>Woosh!</p><br/><p>Several xiuzhe did not have the time to wail before they exploded into balls of fire. Several dots of light appeared on the light curtain and then disappeared in the blink of the eye.</p><br/><p>Only when one flew near the curtain of light could they truly feel how high the temperature was!</p><br/><p>Those that were slightly lacking in cultivation would be swallowed by flames if they just came into contact with the curtain of light. Some others saw the situation and started attacking the stone pillars in hopes that they could avoid the curtain of light. Yet what they had not expected was that the stone pillars were extremely hard and were undamaged no matter how they attacked.</p><br/><p>But there were also people that charged into the curtain of light.</p><br/><p>Elder Shen took the two people along and turned to a stream of fire that easily passed through the curtain of light.</p><br/><p>There was a xiuzhe who wrapped his entire body in a layer of water and easily passed through the light.</p><br/><p>Some xiuzhe had swords protecting their body as they passed.</p><br/><p>All kinds of moves were used but there was one common quality. All those that could pass through the curtain of light were experts. Some of them were of mysterious origins but the great majority were experts that had been famous for a long time in Cloud Sea Jie.</p><br/><p>There were people constantly turning to dust. The heated hearts of the spectators cooled greatly. The greed at one moment could daze their minds but no one would do something such as knowingly rush to their death.</p><br/><p>Those that charged at the curtain of light were all people that had absolute confidence in themselves.</p><br/><p>Among the crowd, exclamations occasionally occurred.</p><br/><p>“It’s Cao Bei, he also came!”</p><br/><p>“Look look! That is Hai Wu Ya!”</p><br/><p>Expert after expert appearing caused the mood to reach a small climax. Since they knew they could not enter the shen temple, many people gave up and decided to peacefully watch.</p><br/><p>This place became the center of Cloud Sea Jie. More than half of the experts had come to attend this magnificent spectacle.</p><br/><p>The golden crows continued to shoot flames at the little sun. The fire of the little sun grew, and the heated waves were hard to tolerate. The spectators continuously retreated.</p><br/><p>Such presence caused everyone to pale.</p><br/><p>Some of the people that felt they had the abilities to enter couldn’t help but hesitate. The presence of the Sun Shen Temple was great, just like the sun, blinding and unable to be looked at. It probably was not so easy to enter.</p><br/><p>Some that were more cautious even flew backwards far from the shen temple ruins.</p><br/><p>If they lost their lives because of watching this, it was not worth it!</p><br/><p>———</p><br/><p>Zuo Mo was also alarmed by the change in front of him.</p><br/><p>Truthfully, no matter if it was Qing Lin or the strange corpse, they were not too clear about the value of the Sun Crystal Seed to the Sun Tribe. The Sun Crystal Seed were forged by every totem warrior of the Sun Tribe and was the core inherited item of the Sun Tribe.</p><br/><p>Not just this seven-star shen temple, Zuo Mo who possessed the Sun Crystal Seed could easily receive the recognition of even higher-ranked Sun Shen temple.</p><br/><p>How could such an ignorant Zuo Mo truly understand the profoundness in this? He dazedly looked with a puzzled face at the shocking change of the sacrificial altar.</p><br/><p>At this moment, something suddenly happened.</p><br/><p>A golden pillar that seemed tangible came from the sky and covered Zuo Mo.</p><br/><p>Zuo Mo felt as though he was soaking in a hot spring. His entire body was warm and comfortable.</p><br/><p>Where did this golden light come from?</p><br/><p>Zuo Mo didn’t know. He did not have time to think. At this time, his mind was in a very special state. The Sun Crystal Seed in his body was unusually active. Threads of golden light and red energy swam from all directions towards the Sun Crystal Seed.</p><br/><p>They smelled something familiar.</p><br/><p>If Zuo Mo was clear-minded, he would find to his shock that this ray of light that was so solid it seemed tangible came from that little sun at the top of his head.</p><br/><p>The Sun Crystal Seed was like a key that opened this sealed storehouse.</p><br/><p>———</p><br/><p>Elder Shen raised his head to look at the sky. His expression became even worse and his mood darker.</p><br/><p>The little sun above his head had reached a peak in brightness, and was not lacking compared to the true sun in the sky. The figures of the ten golden crows were visibly fading.</p><br/><p>Elder Shen knew what was going on.</p><br/><p>Someone was manipulating the power of the Sun Shen Temple! No, more accurately, someone was absorbing the power of the Sun Shen Temple!</p><br/><p>If he was not seeing it with his own eyes, he definitely would not believe it.</p><br/><p>Only those who were descendants of the Sun Tribe could absorb the power of the Sun Shen Temples! No matter how certain he had been before that there were no survivors of the Sun Tribe, reality was in front of him. He had to accept that the sect leader had been wrong in his divination!</p><br/><p>Once this conclusion came out, he could not stop the murderousness he felt!</p><br/><p>The sect leader placed great importance on this ruin. He had found a clue by accident and after effort on multiple fronts, they had gradually locked onto the position of the ruins. During this time, the sect leader and the other major personages of the sect had expended great effort to divine to finally get this result.</p><br/><p>This person who was able to escape so many divinations either had a great treasure or his power was astounding.</p><br/><p>If he waited for the other to finish absorbing the power of the Sun Shen Temple, it would be too late!</p><br/><p>Elder Shen took a deep breath. His gaze was serious. No matter what, he had to get the Sun Shen Temple!</p><br/><p>“Stay carefully behind me,” Elder Shen said in a deep voice. Without another word, he strode forward.</p><br/><p>Li Shu’s heart shook and tightly followed behind Elder Shen. Lu Zhen also did not dare to speak and hurriedly followed.</p><br/><p>In front of them were endless sand dunes.</p><br/><p>Translator Ramblings: Zuo Mo is a wrench in the plans of everything.</p><br/>\n</div>"}