{"title": "Chapter Five Hundred and Four – Blood Script Bell", "id": 504, "volume": 6, "url": "http://boxnovel.org/world-of-cultivation-chapter-five-hundred-and-four-%E2%80%93-blood-script-bell", "volume_title": "Volume 6", "body": "<h1>Chapter Five Hundred and Four – Blood Script Bell</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Five Hundred and Four – Blood Script Bell</p><br/><p>The situation was chaotic.</p><br/><p>The Corpse Sea Bamboo in the Old Bamboos Staff Man’s hand was a great treasure. Every time it was waved black balls of energy were released, each held countless angry souls inside. The rumor was that Corpse Sea Bamboo would only grow in extremely evil places within sea of corpses. The abundant death energy would become its nutrients.</p><br/><p>Shen Wu Hai never thought that he would see such a powerful talismans in a little place as Cloud Sea Jie.</p><br/><p>His seal fire that could be called masterful wasn’t effective against this little Corpse Sea Bamboo. In comparison, Ge Hai’s cultivation, while higher than the Old Bamboo Staff Man, was less of a threat to Shen Wu Hai.</p><br/><p>Li Shu’s cultivation was pretty good. As an inner sect disciple, he might only have jindan cultivation but he had endless tricks. The little skyring changed endlessly.</p><br/><p>At the side, Lu Zhen was much more clumsy in comparison. His ling power was greater than Li Shu but no matter if it was the spells he cast or his talismans, they were far lacking compared to Li Shu.</p><br/><p>Even so, his power was still a great step above this group of Cloud Sea Jie jindan. He was definitely the third most powerful jindan!</p><br/><p>This was the difference between large and small sects.</p><br/><p>Any disciple of a large sect could usually rival the sect leaders of small sects. This was because the foundations of those large sects had been accumulated through thousands of years. They had abundant resources, profound spells, astoundingly powerful masters. This meant that their starting points were far higher than normal xiuzhe.</p><br/><p>As they really started to fight, Li Shu calmed down.</p><br/><p>The battle was not as difficult as he had imagined. Except the surprise of the Corpse Sea Bamboo, he did not feel any pressure due to the skill of the other xiuzhe. They couldn’t compare to the spars in the sect.</p><br/><p>He couldn’t help but feel a thread of pride.</p><br/><p>This caused him to feel even more relaxed and his skill was expressed to its limits. The skyring in his hand rapidly changed. All kinds of formation methods took their turn and flowed.</p><br/><p>Those xiuzhe that he was suppressing were filled with shock. Li Shu’s strength far surpassed their expectations.</p><br/><p>He alone managed to suppress seven jindan.</p><br/><p>The constantly changing formations were like the invisible threads that controlled a puppet, exhausting the other’s concentration to deal with it.</p><br/><p>Li Shu was idle and calm. No nervousness could be seen. His attention was on the entire situation. The Corpse Sea Bamboo was powerful but he was not worried. How could someone who was an elder in the sect just have only this level of strength?</p><br/><p>Also, in terms of talismans, how many sects could be spoken of in the same sentence as Tian Huan?</p><br/><p>His attention was mostly focused on those xiuzhe of unknown origins. In his view, these people were the unstable factor. They were most likely to bring about an unexpected change.</p><br/><p>What reassured him slightly was that this group all fought for themselves.</p><br/><p>It seemed he needed to add some power and sort out these people from Cloud Sea Jie as fast as possible. Murderousness flashed through Li Shu’s eyes. At some time, a bronze bell appeared in his hand. This bell looked very normal, the yellow bronze body was covered in complex red seal scripts that crossed like the network of blood vessels. It was terrifying to see.</p><br/><p>This Blood Script Bell was the talismans his master had bestowed onto him.</p><br/><p>The seemingly normal-looking pearwood handle came from a thousand year bitter pear tree. The body of the bell was forged from thirteen kinds of rare bronze gold. When it was forged, the sound of the bell had rang out for three days among the mountains before ending.</p><br/><p>Li Shu usually treasured it. Other than imprinting on it every day, he rarely used it in battle. The other disciples knew that he had a defensive talisman but there were only a rare few that had seen it.</p><br/><p>At this time, he wanted to finish the battle quickly which was why he showed this treasure!</p><br/><p>At this time, a feeling of danger suddenly rose. A dot of light suddenly exploded in Li Shu’s eyes!</p><br/><p>The extremely strong feeling of danger caused every hair on Li Shu’s body to stand on end.</p><br/><p>Expression changing dramatically, Li Shu retreated suddenly. A dash of light shot out of the skyring and shielded his body.</p><br/><p>Ping!</p><br/><p>Before the formation lit up, it cracked like glass.</p><br/><p>Among the flurry of shattered fragments, a serene light burrowed out and appeared in front of Li Shu.</p><br/><p>“Masked Assassin!”</p><br/><p>For the first time, fear was on Li Shu’s face. He suddenly felt a thread of regret. Damn it! How had he forgotten this dangerous guy?</p><br/><p>This serene light was like glue. The intimidating cold essence aimed at Li Shu’s brow.</p><br/><p>At this moment of life and death, Li Shu could not consider anything else. His ling power furiously flooded the Blood Script Bell in his hand.</p><br/><p>Ding!</p><br/><p>A blood red ripple of energy suddenly spread with the Blood Script Bell as the center!</p><br/><p>The dot of light that was rush at him from the front suddenly grew in brightness when it encountered this bloody light. It gave a ear-piercing howl!</p><br/><p>A blurry shadow silently appeared.</p><br/><p>This change came extremely suddenly. The xiuzhe in the surroundings were not able to react until this bloody ripple reached them. All of them changed expression.</p><br/><p>As the bloody ripple script passed across their bodies, the blood in their faces seemed to drain out.</p><br/><p>They were frozen where they stood as though they were wooden puppets. There wasn’t a wound on their bodies, but their exposed skin was ashen white and without any blood.</p><br/><p>The other xiuzhe paled and jumped out of the battle range far from Li Shu! The power of the Blood Script Bell caused all of them pale.</p><br/><p>The only one that did not retreat was the Masked Assassin. He advanced instead. His body was like a blurry ball that could not be caught.</p><br/><p>Every time that dot of light came into contact with the bloody light, it would suddenly light up as though there was friction with the air.</p><br/><p>What was even harder for people to accept was that the dot of light was extremely domineering. Even Li Shu was suppressed to the point he could not raise his head.</p><br/><p>Pia pia pia!</p><br/><p>Every time the dot of light came into contact with the blood light, Li Shu’s hand that held the Blood Script Bell would shake.</p><br/><p>The ghostly figure of the Masked Assassin continuously change position and roamed around in search of an opportunity to make the fatal strike.</p><br/><p>This added great pressure to Li Shu. Pulses of vibration came from the bell. He was almost unable to hold onto the bell!</p><br/><p>The presence of death was so close, almost breathing on his face.</p><br/><p>It was the first time Li Shu was placed in such a dangerous situation. He gritted his teeth and held the Blood Script Bell in a death grip to try to control the Blood Script Bell.</p><br/><p>The Masked Assassin was unusually cunning. He probably had guessed that Li Shu’s ling power would be expended extremely quickly to control such a high grade talisman like the Blood Script Bell. So he continuously attacked head on to increase the rate that Li Shu’s ling power was up.</p><br/><p>Under the storm of the Masked Assassin’s attacks, Li Shu wavered.</p><br/><p>“Shixiong!” Lu Zhen saw Li Shu was in danger. He did not attend to his own enemy, the blue ring on his hand expanding and shooting at the Masked Assassin.</p><br/><p>The ghostly Masked Assassin flashed. A dot of light appeared behind Lu Zhen. The light flashed and then disappeared like an arrow.</p><br/><p>Bam!</p><br/><p>The ling armor on Lu Zhen’s body suddenly exploded. His body shook and he froze where he stood.</p><br/><p>There was a bloody hole the size of a bowl in his chest.</p><br/><p>“Shidi!” Li Shu glared angrily, sorrowful inside.</p><br/><p>The difference in status between Lu Zhen and he was great, and their relationship was normal. However, the other had died to save him. This was a great and unparalleled blow to Li Shu.</p><br/><p>A flush of blood suddenly appeared on Li Shu’s handsome face.</p><br/><p>The skyring suddenly released many lights. Seal scripts flew out of the skyring like a stream of water. These bright seal scripts were so numerous that people felt it was endless.</p><br/><p>Li Shu stood solemnly as he shook the Blood Script Bell gently, shouting, “Skyring Blood Chime!”</p><br/><p>Those seal scripts floating in the air suddenly froze and formed rings of light in the air. Hundreds of light rings formed an enormous formation. Chimes echoed with ripples of bloody light in this formation!</p><br/><p>At this instant, all the rings chimed!</p><br/><p>Boom!</p><br/><p>Everything inside the formation was completely shattered!</p><br/><p>Some xiuzhe were unable to escape and crumbled before even having the time to wail. The xiuzhe that were frozen like wood puppets also disappeared!</p><br/><p>An indiscernible muffled grunt, and a dot of light suddenly erupted out of the formation. Right after, a figure suddenly charged out of the formation!</p><br/><p>He flashed like a ghost in front of everyone’s eyes and then disappeared.</p><br/><p>Pia!</p><br/><p>The formation of light rings completely crumbled like an avalanche of snow and disappeared into the ring.</p><br/><p>A flow of blood came from Li Shu’s mouth. His gaze landed on the ground. There was a little puddle of blood there. The corners of his mouth unconsciously jerked, and he was shocked inside.</p><br/><p>This Skyring Blood chime was his ultimate move. Even this move was unable to kill the Masked Assassin..</p><br/><p>The other was really unfathomable!</p><br/><p>Li Shu wiped away the blood at the corner of his mouth and smoothed out his ruffled clothing without even looking at the surrounding xiuzhe.</p><br/><p>No one dared to move forward.</p><br/><p>This move had frightened all these xiuzhe.</p><br/><p>Even the Masked Assassin had been wounded by this move. This youth was really powerful!</p><br/><p>As expected of a disciple of Tian Huan!</p><br/><p>———</p><br/><p>Li Shu’s move shocked all of the battlefield. But no one would ever expect that a strange feeling formed in Zuo Mo’s mind, a figure who had his head bent and was dismissed by everyone.</p><br/><p>He felt Li Shu’s move was very familiar. Wasn’t that a stronger version of the [Skyring Moon Chime Formation] that he became famous with? The power of the blood red bell was slightly scary, but those familiar rings of light when combined together in this move was the same as [Skyring Moon Chime Froamtion]!</p><br/><p>So the [Skyring Moon Chime Formation] originated from Tian Huan!</p><br/><p>Zuo Mo released a sigh and then he twisted his mouth.</p><br/><p>Tsk tsk, leftovers of what ge played … …</p><br/><p>But there was not much time left for him to ponder. He knew the Masked Assassin was here from before and was not surprised. At this time, he just desired to know what that indiscernible ripple that came from the sacrificial altar was.</p><br/><p>He wanted this fight to be as violent as possible. This way, he would have a chance.</p><br/><p>———</p><br/><p>Shen Wu Hai had gotten serious.</p><br/><p>He was not affected by Lu Zhen. The death of an outer sect disciple was not worthy of his attention. However, he was furious at the appearance of the Masked Assassin. He had been tangled up with the two old people and Li Shu had almost been killed.</p><br/><p>Li Shu was an inner sect disciple!</p><br/><p>If an inner sect disciple died in front of him, he didn’t even want to know how many criticisms he would hear. Li Shu’s channels were wounded. When he returned, the other old guys would complain greatly.</p><br/><p>Thinking about this, how could the proud Shen Wu Hai not be angry?</p><br/><p>“Just a Corpse Sea Bamboo and you want to stop this old one?” Shen Wu Hai shouted. His ling power expanded, “Taste this old man’s Dark Void Fire!”</p><br/><p>A clear and colorless flame appeared at the center of his palm.</p><br/><p>Boom!</p><br/><p>The moment this transparent flame appeared, everyone’s hearts trembled!</p><br/><p>At this point, Zuo Mo who felt it suddenly opened his eyes!</p><br/><p>Editor Ramblings: WanderingGummiOfDoom here. MUAHAHA I HAVE TAKEN OVER, FEAR MY POWER! wyhcwe has run into some computer trouble and until that is fixed I will be posting instead. It does sound like a serious problem, so cross your fingers and wish wyhcwe luck.</p><br/><p>Also, turns out based on the last 500 chapters you should be able to guess ZM’s origins. I did. Teehee.</p><br/><p>Happy New Years.</p><br/>\n</div>"}