{"title": "Chapter Five Hundred and Eight – Inventory", "id": 508, "volume": 6, "url": "http://boxnovel.org/world-of-cultivation-chapter-five-hundred-and-eight-%E2%80%93-inventory", "volume_title": "Volume 6", "body": "<h1>Chapter Five Hundred and Eight – Inventory</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Five Hundred and Eight – Inventory</p><br/><p>After erasing all his tracks, Zuo Mo finally released a breath.</p><br/><p>It had to be said that Pu Yao really had the moves. According to the methods he traded, Zuo Mo had forged a Nether Mist jade pendant. The Nether Mist jade pendant was the size of a jade scroll and appeared mundane but the cost of the materials was three whole pieces of sixth-grade jingshi.</p><br/><p>That was three pieces of sixth-grade jingshi.</p><br/><p>Bao Yi’s expression had become gloomy at the time and the felt heartache at the decreasing storages. In the next few days, Bao Yi’s mood was extremely terrible as the Chief Quartermaster. The people that came to get materials usually got cursed at.</p><br/><p>But the Nether Mist jade pendant was truly extraordinary in value. If Zuo Mo was skilled in divination, he would find that everything about him seemed to be shrouded in mist and could not be clearly seen.</p><br/><p>With the Nether Mist jade pendant, Zuo Mo’s heart relaxed. He finally had the free time and the mood to inventory the things he obtained from the Sun Shen Temple.</p><br/><p>As he made an inventory of his gains, Zuo Mo was excited!</p><br/><p>The products of this endeavor piled up like mountains. Every object was a rare treasure.</p><br/><p>The Sun Seeds made up a the largest portion of his gains. The number of Sun Seeds that accumulated over tens of thousands of years was astounding. Even though Pu Yao had scalped away one hundred, there were still a great many left.</p><br/><p>But among this pile of treasures, the three most eye catching were the golden leaf, the Sun Shen Tree, and the inky jade bones.</p><br/><p>He didn’t know what tree the golden leaf came from. It was entirely golden and made of a weighty material. Every pattern on it was extremely detailed. At the beginning, Zuo Mo thought that this was the leaf of the Sun Shen Tree. But later when he compared, he found the two were completely different. Tens of thousands of years had passed, but the golden leaf still held a faint vitality and it was a marvel.</p><br/><p>Zuo Mo held the golden leaf in his hand. Feeling the faint vitality exuded from the leaf, he couldn’t help but marvel.</p><br/><p>This golden leaf had been placed in a position of great consideration. From a glance, it could be seen that it wasn’t anything normal. Yet when he examined it over and over, he could not identify what was special about it.</p><br/><p>His mind shifted and Zuo Mo tried to channel a thread of shen power into the leaf.</p><br/><p>Boom!</p><br/><p>Numerous thoughts rushed into Zuo Mo’s mind like a furious flood.</p><br/><p>He seemed to have landed in an endless sky of stars. Countless stars spun around him and pulled at him. The thoughts that originated from the ancient era were like the vast and deep stars. At this moment, he lost himself!</p><br/><p>The stars changed, and at the empty part of the dark void, an imperceptible light rose.</p><br/><p>The light quickly became brighter. In a blink, the light was like the stars that lit up the deep and black sky. It was beautiful.</p><br/><p>But this beauty was only condensed for a brief moment. Then the burning light that tore apart the darkness swallowed Zuo Mo up!</p><br/><p>Zuo Mo didn’t have to time to close his eyes, yet the piercing pain he imagined did not appear.</p><br/><p>A cryptic and primitive song floated out of some unknown place but Zuo Mo felt unspeakably close to it. Even though he could not understand, his restless heart calmed when hearing the distant song. Zuo Mo fell into a trance.</p><br/><p>As he listened, Zuo Mo suddenly detected that pitifully weak thread of shen power in his body started to circulate in his body of its own accord.</p><br/><p>Was this … …</p><br/><p>A daring idea appeared in Zuo Mo’s mind.</p><br/><p>But when his attention slip, the shen power in his body instantly shrunk back like a frightened mouse.</p><br/><p>Zuo Mo hurriedly refocused and put his attention back on the song. The shen power inside his body quickly started to circulate again and slowly moved around Zuo Mo’s body.</p><br/><p>Zuo Mo silently noted down the pathways the shen power circulation took.</p><br/><p>This was strange. As expected, this was strange!</p><br/><p>The pathways the shen power took to circulate were extremely strange and completely different than the three powers. It did not follow the channels in his body like ling power, nor did it stay in his sea of consciousness like his spiritual consciousness, nor did it become purified between his blood and bone like the mo skills.</p><br/><p>The pathways it took included the channels, included the sea of consciousness, as well as his blood and bone, but had innate differences to the mainstream cultivation methods.</p><br/><p>Suddenly, a thread of exhaustion rose. The song became even more distant.</p><br/><p>Zuo Mo was shocked!</p><br/><p>Opening his eyes, the song suddenly stopped. He looked down. The golden leaf in his hand was gradually dimming. Zuo Mo hurriedly examined the golden leaf. He saw that the leaf had dimmed but the thread of vitality on the leaf had not disappeared before he released a breath.</p><br/><p>So this was not one-use only!</p><br/><p>Good, good!</p><br/><p>At this time, Zuo Mo seemed to have learned a bit of this golden leaf’s use. It should be a treasure that the Sun Tribe used in the past to record the cultivation methods. From this function, the golden leaf was similar to jade scrolls. However, Zuo Mo had a feeling. It shouldn’t just be a “golden leaf jade scroll,” it should have other uses.</p><br/><p>Compared to the golden leaf, the use of the Sun Shen Tree was much simpler. However, Zuo Mo was stuck with a problem. What grade was the Sun Shen Tree?</p><br/><p>It was at least a great treasure of the Sun Tribe and it was called a shen tree. Even the Sun Seeds it produced were extraordinary. It should be at least seventh-grade!</p><br/><p>Zuo Mo unconfidently thought.</p><br/><p>However, while he was unable to judge the grade of the Sun Shen Tree, this did not stop him from using its power. The Sun Tribe planted Sun Shen Trees to get more Sun Fruits and Sun Seeds. Zuo Mo naturally did not have the patience to guard the Sun Shen Tree for decades.</p><br/><p>The wood of the Sun Shen Tree was likely a great material but its exact uses were unknown.</p><br/><p>Zuo Mo also didn’t bear to use this ancient shen wood that had lived for tens of thousands of years to forge into talismans. It would be a waste.</p><br/><p>After some thought, Zuo Mo quickly had an idea.</p><br/><p>He flew into the sky and looked around the island. He suddenly headed towards the south end of the island. Not long in flight, he landed on a little mountain top and entered a cavern.</p><br/><p>Entering the cavern, the thick fire element power hit him in the face.</p><br/><p>There were five fire element caverns on the island. This was one of them. The air was filled with the smell of sulphur. Zuo Mo had a content expression. This fire cavern was connected with earth fire, and was the best place to plant the Sun Shen Tree.</p><br/><p>The Sun Shen Temple was connected to earth fire. If it wasn’t for the nurturing earth fire, this Sun Shen Tree would not have been able to live for so long!</p><br/><p>Zuo Mo carefully took out the Sun Shen Tree.</p><br/><p>When the Sun Shen Tree’s roots touched the lava rock, the roots suddenly twisted like slender snakes and burrowed into the rock. In front of these soft roots the hard granite was easily penetrated as though it was tofu.</p><br/><p>A crimson red light spread at a visible rate from the roots towards the body of the tree.</p><br/><p>When the red light reached the topmost part of the Sun Shen Tree, there was a light snap and golden flames erupted out of the tree.</p><br/><p>A shocking wave of heat spread outwards.</p><br/><p>Zuo Mo could not tolerate it and retreated a few steps. The granite under his feet showed signs of melting. He had a grave expression. His body contained both the Great Day Banded Flame and the Sun Crystal Seed. He had extremely high resistance towards all kinds of flames but he felt burdened in the face of this flame. The strength of this flame was shocking.</p><br/><p>At this time, Zuo Mo’s expression suddenly changed!</p><br/><p>Deep beneath his feet, earth fire was furiously heading towards this direction like a flood!</p><br/><p>Damn it!</p><br/><p>Without a word, he sprinted towards the outside!</p><br/><p>Just as Zuo Mo sorrily flew out of the cave and turned around, he inhaled sharply.</p><br/><p>The green flora on the mountain were producing green smoke as they popped and turned to ash. The entire little mountain was bright red. Every piece of rock seemed to have been taken out of the kiln just now and could melt at any moment.</p><br/><p>Vast fire element power almost erupted through the restraint of the earth surface.</p><br/><p>Zuo Mo’s expression changed again!</p><br/><p>Damn it!</p><br/><p>If he waited for this earth fire to erupt, he would not be able to conceal it.</p><br/><p>Even though the Sun Shen Temple had been burned away and the xiuzhe that came to Cloud Sea Jie from different places were gradually leaving, but there were still many xiuzhe who had stayed behind.</p><br/><p>If the earth fire suddenly burned the sky at Turtle Island, those with intentions could guess that the masked person in the Sun Shen Temple was him!</p><br/><p>Zuo Mo was decisive. No matter what, the eruption could not occur!</p><br/><p>But even through the eruption had not occurred yet, Zuo Mo could still clearly feel its power at such a distance.</p><br/><p>What could he do?</p><br/><p>His gaze at sweeping the surroundings, his eyes lit up.</p><br/><p>He had set up the island protecting formation with his own hands. There were two large formations. One was the Yinyang Thunder Cloud Formation, the other was the Meridional Azure Aether Formation.</p><br/><p>The Yinyang Thunder Cloud Formation had been set up when the Ren Family was here. Even though Zuo Mo had planted the Sonic Lightning Walnut at the core and had increased its strength, it still could not compare to the Meridional Azure Aether Formation.</p><br/><p>But at this time, using the Yinyang Thunder Cloud Formation was a better choice than the Meridional Azure Aether Formation.</p><br/><p>Light flowed on Zuo Mo’s hands and lights entered the ground in succession.</p><br/><p>Everyone on the island was disturbed by the earth fire and started to gather in its direction. However, when they saw Zuo Mo’s movements, they instantly understood what was going on and stopped their movements.</p><br/><p>Ten minutes later, everyone from Golden Crow Camp had come. Seeing the situation, their expressions became grave. Under the directions of Master Sun Bao and JI Wei, they quickly prepared to give aid when necessary.</p><br/><p>The surroundings were quiet. Everyone quieted their breathing and watched Zuo Mo’s actions.</p><br/><p>Zuo Mo’s hands were moving slowly as though he was pulling something thousands of catties heavy. His expression was extremely serious.</p><br/><p>The earth fire in the cavern became even more restless. The granite on the mountaintop started to dissolve. The earth fire could erupt at any moment. The earth fire slowly pulsed. Every time it pulsed, the raging power contained was exposed and caused people’s hearts to beat rapidly.</p><br/><p>Even Eldest Shixiong Wei Sheng that never lost his composure showed a rare worried expression on his face as his right hand was placed on his sword hilt.</p><br/><p>In the sky, Zuo Mo suddenly grabbed at the mountain.</p><br/><p>Pew!</p><br/><p>A streak of earth fire suddenly shot out of the little mountain like a raging dragon.</p><br/><p>Zuo Mo’s right hand guided the dragon of fire and it seemed to be forcibly pushed towards the ground. At the same time, Zuo Mo’s left hand swiped as he recited.</p><br/><p>At this tense moment, Zuo Mo unconsciously used the control method of shen power!</p><br/><p>His attention used in three ways!</p><br/><p>Pew!</p><br/><p>The earth fire was forced back into the ground. Flames flew out. A golden seal script landed from the sky onto the body of the dragon of fire.</p><br/><p>The dragon of fire suddenly formed a curving gold seal script line!</p><br/><p>Golden Crow Camp was shocked. Just now, they had sighed at the high difficulty of Zuo Mo’s move. Even though they tried their best to not make a sound, sharp inhales were clear to hear.</p><br/><p>At this time, the earth fire suddenly erupted and advanced following the golden seal line that was produced by the dragon of fire!</p><br/><p>Translator Ramblings:</p><br/><p>Zuo Mo: Oops, I didn’t mean to make a volcano that might destroy my island.</p><br/>\n</div>"}