{"title": "Chapter Five Hundred and One – Plough Up The Earth", "id": 501, "volume": 6, "url": "http://boxnovel.org/world-of-cultivation-chapter-five-hundred-and-one-%E2%80%93-plough-up-the-earth", "volume_title": "Volume 6", "body": "<h1>Chapter Five Hundred and One – Plough Up The Earth</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Five Hundred and One – Plough Up The Earth</p><br/><p>Avoiding the few dangerous places, Zuo Mo finally found the target he was searching for.</p><br/><p>The moment he saw it, he felt as though his heart stopped beating! He stopped breathing and unconsciously slowed his steps as though he was afraid of scaring it away. His eyes showed all kinds of shock and disbelief.</p><br/><p>This was a tree.</p><br/><p>It was the most beautiful and grandest tree Zuo Mo had ever seen!</p><br/><p>It was not very tall, only about the same height as Zuo Mo. The body of three was bright red, even brighter than the most beautiful coral. The body of the tree was smooth as though the most accomplished craftsmen had carefully sanded it down. There weren’t any protrusions on the entire tree trunk. Every part of the tree had extremely beautiful curves that were perfect and would cause people to sigh at the wonder of nature.</p><br/><p>Zuo Mo’s gaze was attracted by the balls of fire on the tree.</p><br/><p>Heavens, what was that?</p><br/><p>Zuo Mo gaped. He lost all abilities of speech. Once proud of his vast experience, he found that his imagination was so poor.</p><br/><p>That wasn’t balls of flame, those were clearly miniature little suns!</p><br/><p>Each was the size of a fist, round, each one had a layer of orange-red flames shrouding it, they were all small suns. There were ten small suns hanging like this from the tree.</p><br/><p>Zuo Mo froze for a moment and unconsciously walked towards the red tree.</p><br/><p>A warm presence blew across him. This presence was extremely unique. It seemed to be able to easily permeate the body. Zuo Mo felt that even his bones were warm.</p><br/><p>Sun Shen Tree!</p><br/><p>Was this the Sun Shen Tree?</p><br/><p>Zuo Mo suddenly recalled how Big Brother Qing Lin had especially mentioned this in the thought imprint he had left behind. Looking at the red tree, he felt this name was extremely appropriate.</p><br/><p>This was definitely the Sun Shen Tree that Big Brother Qing Lin had mentioned!</p><br/><p>Zuo Mo believed without a doubt.</p><br/><p>The Sun Shen Tree was the symbol of the Sun Tribe. Whenever they came to a new place, they would plant this tree. The Sun Shen Tree was able to produce Sun Fruits. These Sun Fruits were usually given to the warriors in the tribe with potential to nurture their shen power.</p><br/><p>The Sun Fruits would mature after ten years. If they were not picked at maturity, they would form Sun Seeds after forty years and naturally fall off the tree.</p><br/><p>Zuo Mo hurriedly bent his head. As expected, there was a thick layer of dark red and hard seeds on the ground. He picked one up and examined it. The body of the seed was dark red and filled with extremely fine golden scripts. It felt like heavy jade and gave off a clear warmth in his hand.</p><br/><p>Without a word, Zuo Mo started to furiously sweep Sun Seeds into the ring as though he was insane.</p><br/><p>Compared to the Sun Fruit, Sun Seeds were much better. The sun shen power inside was even purer and thicker after being condensed for forty years, and its quality a whole level above Sun Fruit. Other than consuming it to increase shen power, it was also one of the favored weapons of the Sun Tribe warriors.</p><br/><p>If it was processed slightly with the sun shen power, it would become the “Crow Thorn” which had intimidated all of the lands.</p><br/><p>Many great heroes had fallen under these non-descript Crow Thorns.</p><br/><p>Qing Lin had especially mentioned the Sun Shen Tree, and specifically the Sun Seeds. Qing Lin had walked all over the shen temple. He had been unable to enter the priest’s hall but he had detected the presence of the Sun Shen Tree.</p><br/><p>He had been wounded by a Crow Thorn, captured alive and brought to this place. He knew very well how powerful it was. Since he could feel the presence of the Sun Shen Tree, then it meant that the Sun Shen Tree inside the hall was alive. The tree would produce a batch of Sun Seeds every five decades. After tens of thousands of years, how many Sun Seeds had been produced?</p><br/><p>Zuo Mo buried his head to pick Sun Seeds, unwilling to miss even one.</p><br/><p>If he missed one of this kind of miraculous object, then he would be stuck by lightning!</p><br/><p>After he ploughed through the soil nearby and made sure that he did not miss anything, he finally stood up contentedly. He looked at the ten Sun Fruits hanging on the tree. He took out a jade box, and plucked the Sun Fruits to put them in the box.</p><br/><p>After picking the Sun Fruits, he looked at the bare Sun Shen Tree and his mind moved. He moved it, along with the surrounding soil, into his ring.</p><br/><p>How could he leave a shen tree to those people?</p><br/><p>Even though the Sun Fruit would only form every decade and the Sun Seeds required fifty years to mature, but this kind of shen tree was a rare treasure on its own. Zuo Mo did not know what grade the Sun Tree was, but it definitely was not low.</p><br/><p>At the least, it was a shen tree!</p><br/><p>Finished moving the Sun Shen tree, Zuo Mo looked around in hopes of finding something he missed. This was the garden of the shen temple and there should have been ling trees planted. He quickly was disappointed. None of the other ling trees in this garden survived other than this Sun Shen Tree. Thinking about it, he understood. The shen temple had been separated from the outside. It would have been difficult just to supply the Sun Shen Tree. They had no extra power to support other shen trees.</p><br/><p>However, with Little Mo Ge’s personality of plucking feathers from a chicken, his mind turned and he had a new idea.</p><br/><p>It was rational to think that such a large garden had not been planted with only the Sun Shen Tree. It was normal that the other ling trees could not survive. However, the ground that was full of Sun Seeds reminded him that even if the ling trees did not survive, would they leave behind any seeds?</p><br/><p>Tens of thousands of years! Something common tens of thousands of years ago might be a treasure now! If those seeds could survive, they definitely were treasures!</p><br/><p>This idea motivated him.</p><br/><p>Without another word, he started to dig through the dirt.</p><br/><p>In the past, ge had been a ling farmer! How could plowing the ground be difficult for ge?</p><br/><p>Zuo Mo was like a human-shaped dirt plough that raked three chi into the ground. Everywhere he passed, the dirt flew!</p><br/><p>He did actually get a few items.</p><br/><p>A black fruit that was like a rock that was extremely hard and heavy. It was the size of a thumb but several catties heavy. If there wasn’t a thread of vitality contained inside, Zuo Mo would be certain it was a piece of rock.</p><br/><p>Other than this, Zuo Mo also got a section of half-rotten wood. It was the size of his arm and covered in dirt. When he wiped away the dirt, an unique scent burrowed into Zuo Mo’s nose.</p><br/><p>Zuo Mo shuddered uncontrollably!</p><br/><p>Treasure!</p><br/><p>Zuo Mo instantly realized that this piece of wood that seemed rotten was definitely a treasure!</p><br/><p>Zuo Mo dug throughout the entire garden.</p><br/><p>It was a pity that there wasn’t enough time!</p><br/><p>Zuo Mo looked with regret at the garden. If there was more time, he would dig ten chi deep!</p><br/><p>But even now, Zuo Mo was content. He really had a good harvest!</p><br/><p>Zuo Mo paid attention to those people. The yuanying that used fire had defeated the Overflowing Earth Secret Realm and was hurrying in his direction. Zuo Mo shook. There were some minor traps along the way but the other was able to defeat the Overflowing Earth Secret Realm, these obstacles would definitely not be a problem for them.</p><br/><p>It was time to leave now. If he stayed longer, it would not be good.</p><br/><p>But there was still a place he hadn’t gone to. Should he go or not?</p><br/><p>Zuo Mo hesitated.</p><br/><p>———</p><br/><p>Elder Shen’s face was slightly pale. Looking as the sand dunes disappeared like dust, he released a long breath. He was shocked inside.</p><br/><p>Zhu Gui’s power was less than a tenth of what it had been after tens of thousands of years. The sect leader had divined correctly. With the ultimate treasure of the sect, with his cultivation of yuanying, he had thought he would be able to subdue Zhu Gui. Yet he had almost fallen against Zhu Gui’s last struggle before death.</p><br/><p>He really could not imagine just how great the power these ancient warriors possessed at their peak!</p><br/><p>The sand dunes beneath his feet completely disappeared.</p><br/><p>The Overflowing Secret Realm was truly defeated!</p><br/><p>There was no joy in Elder Shen’s eyes. He felt an extreme sense of urgency. One misstep, and he would get nothing.</p><br/><p>Also, the other had been in the shen temple for so long. They definitely would not have ignored the ultimate treasures!</p><br/><p>“Go!” He did not wait for his ling power to recover. He picked up Li Shu and Lu Zhen to disappear from his spot.</p><br/><p>They occasionally encountered obstacles along the path.</p><br/><p>But Elder Shen didn’t have any intentions of stopping against the cannon fodder. Without another word, the fire in his hand would flash and the other would turn into dust.</p><br/><p>Compared to how they were delayed in the Overflowing Earth Secret Realm, their progress now was unstoppable!</p><br/><p>After flying for a long time, the three reached the copper door. Looking at the open copper door, Elder Shen’s expression changed.</p><br/><p>When he saw the empty sacrificial room, his face paled even more.</p><br/><p>He stomped his feet and flew towards the garden with a dark face.</p><br/><p>Even though he had the help of the sect leader’s divination, it took him some time to find the garden. When he arrived at the garden and saw the garden that it seemed to have been plowed and was full of holes, blood rose in his throat.</p><br/><p>“Ahahahaha!”</p><br/><p>“This old man will not have mercy! You cannot escape!”</p><br/><p>A wrenching yell echoed in the entire shen temple!</p><br/><p>———</p><br/><p>Zuo Mo still decided to go take a look at the Burning Shen Realm. It was not far and there should be enough time.</p><br/><p>The Burning Shen Realm was the place that the shen temple used to hold its enemies. Ancient warriors had been very strong and even if they were captured, it was hard to kill them. Due to this, they were usually imprisoned in special cages. Burning Shen Realm was one of those cages.</p><br/><p>The Burning Shen Realm was a place that Big Brother Qing Lin had not gone into.</p><br/><p>The dark red earth under his feet exuded an astoundingly high temperature. The place was just multiple mu large but gave off a pressuring presence. The Sun Seed Crystal above Zuo Mo’s head gave off a faint golden light that covered Zuo Mo.</p><br/><p>Zuo Mo carefully explored. The power of the shen temple was weak and the eternal flames of the Burning Shen Realm had been extinguished. Even so, it was not something that Zuo Mo could bear. If it wasn’t for the Sun Crystal Seed, Zuo Mo would not be able to enter this place.</p><br/><p>The Burning Shen Realm was dark and without a sun. Zuo Mo’s vision was compressed and could only see the things two or three zhang ahead of him.</p><br/><p>It was completely bare. There was not anything. The high temperature under his feet gave Zuo Mo a feeling that he was walking on fire.</p><br/><p>The entire Burning Shen Realm, Zuo Mo to felt uncomfortable, the area gave off a strong feeling of pressure and hopelessness. However, he still persisted in walking forward. He had the plan that if he was fast in his actions, it would not take much time. He would have regrets if he did not come.</p><br/><p>He quickly reached the end.</p><br/><p>Hm!</p><br/><p>His pupils suddenly contracted.</p><br/><p>Translator Ramblings: I’m imagining Zuo Mo as a mole with huge claws and elongated forearms spinning in the dirt … … if that makes sense.</p><br/><p>I’m also very happy we have passed chapter 500. Thanks for all the comments.</p><br/>\n</div>"}