{"title": "Chapter Five Hundred and Ten – Sky-Splitting Calamity", "id": 510, "volume": 6, "url": "http://boxnovel.org/world-of-cultivation-chapter-five-hundred-and-ten-%E2%80%93-sky-splitting-calamity", "volume_title": "Volume 6", "body": "<h1>Chapter Five Hundred and Ten – Sky-Splitting Calamity</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Five Hundred and Ten – Sky-Splitting Calamity</p><br/><p>The worldly apparition caused terror in the xiuzhe of Cloud Sea Jie. They quickly received news that similar apparitions had appeared in the nearby jie.</p><br/><p>As this news spread, people became insecure.</p><br/><p>What did this apparition, that seemed to herald the end of the world, mean?</p><br/><p>The doorways of divination xiuzhe were packed with people that came to visit them. The customers were all people who came to inquire what this worldly apparition meant. Cloud Sea Jie did not have any powerful people skilled in divination but almost all the divination xiuzhe reported that this apparition was an inauspicious one. This news caused all people to feel insecure. The effect of this was that the prices of goods on the market skyrocketed.</p><br/><p>The rumors quickly dissipated and the truth was revealed.</p><br/><p>A small sect called Sky Record Sect was attacked by a strange troop and almost the entire sect had been killed. At the start, this news did not attract much attention but this strange troop quickly advanced and blood was spilled everywhere they passed.</p><br/><p>People suddenly discovered to their shock that this was a mo army!</p><br/><p>In the beginning, many people snorted at the news. Mo army? Ha! This was too funny! The Cloud Sea Jie was thousands of li from the front lines. What mo army could sneak into Cloud Sea Jie without being detected?</p><br/><p>But these people quickly stopped laughing.</p><br/><p>Because this mo army was unstoppable. No one was able to stop their advance. The large sects along their warpath all fell under the heels of this mo army. All the xiuzhe that managed to escape lost their courage and only knew to flee for their lives!</p><br/><p>They were too powerful!</p><br/><p>From when they were discovered, they were like a sharp drill in only three days they advanced six thousand li! The sects and the cities in their way were all uprooted and burned down.</p><br/><p>In these short three days, the atmosphere of Cloud Sea Jie changed.</p><br/><p>People fought to flee this place in hopes of avoiding this calamity. Yet the news that came from the outside caused them to feel hopeless. There were many jie within Four Realms where these chaos rifts had appeared. Large numbers of mo armies flooded out of these chaos rifts.</p><br/><p>No one knew why these chaos rifts appeared, but any xiuzhe with a thread of intelligence understood something.</p><br/><p>The sky had changed!</p><br/><p>It really changed!</p><br/><p>The battle at Blood Sky Metropolis Jie had never stopped but for xiuzhe far from the front lines, the war was just another topic of discussion. But now, the abrupt appearance of the chaos rifts pushed the fighting into their lives, it was a cruel and inescapable bog!</p><br/><p>This was a disaster, a Sky-Splitting Calamity!</p><br/><p>The fires of war appeared everywhere!</p><br/><p>When Zuo Mo learned of this news, he was stunned. Having fought his way out of Blood Sky Metropolis Jie, he knew much better than these normal xiuzhe what these chaos rifts represented.</p><br/><p>Lil’ Miss, Wei Sheng, Shu Long, Zong Ru … …</p><br/><p>When the people heard the news, they didn’t dare to believe their ears.</p><br/><p>The silent hall was oppressive to Shang Wei Ming. He timidly looked at the people gathered. “This is what I managed to find out from the outside, it’s crazy out there. Should … … should … …”</p><br/><p>Everyone looked at him. He couldn’t help but feel panic. “Should we prepare to leave early?”</p><br/><p>He gathered his courage and continued, “Everyone is packing up and preparing to leave Cloud Sea Jie right now. The mo army is too strong. No one can stop them. There aren’t any large sects around. It is very dangerous for us to stay here!”</p><br/><p>No one paid him attention. Everyone turned their eyes to Zuo Mo. At these times, the person who always set the direction was Zuo Mo.</p><br/><p>Zuo Mo thought for a long time before he slowly spoke, “If we leave Cloud Sea Jie, where would we go? The chaos rifts are everywhere, we do not even know how many chaos rifts are still undiscovered. If we move to an unfamiliar place, it is even more disadvantageous for us! We put great effort into Turtle Island and the defenses are very sturdy. Even if we encounter the mo army, we have the chance to fight. We weren’t afraid of them in Bloody Sky Metropolis Jie, are we going to be afraid of them here?”</p><br/><p>The suppressive atmosphere inside the hall instantly swept away. Everyone’s morale rose at Zuo Mo’s words. Yes, everyone had fought and killed their way out of Bloody Sky Metropolis Jie. They hadn’t been afraid of the mo military in Bloody Sky Metropolis Jie, what was there to be afraid of here?</p><br/><p>“We’re not afraid! They dare to rampage on top of our head, I say kill them!” Lei Peng’s loud voice made people’s eardrums hurt. He glared and held his golden crystal broadsword as though he wanted to start immediately.</p><br/><p>Nian Lu took over with a slightly soft voice, “Don’t be so brutish. Be more gentle, be more gentle. Allow them to feel our friendship and enthusiasm towards yaomo, let’s be friends.”</p><br/><p>“Idiots.” Looking at the display of his teammates, Ma Fan spat out.</p><br/><p>Zuo Mo looked at Gongsun Cha. There was a smile at the corners of Lil’ Miss’ mouth that was filled with innocence and bashfulness. However, his eyes were filled with an excited light. Those familiar with him all felt their hearts jump.</p><br/><p>Zuo Mo gazed at Shu Long. Shu Long’s presence had become even more solemn and heavy in recent days. Standing there, he seemed like a mountain. He noticed Zuo Mo’s gaze. Raising his head, he did not disguise the fighting spirit in his eyes. “Daren, Shu Long requests to battle!”</p><br/><p>Zuo Mo was slightly surprised. Shu Long was steady in personality and his specialty in battle was the defense rather than offense. It was the first time he had seen Shu Long desirous of battle.</p><br/><p>“What? Your hand is itching?” Zuo Mo said with a smile.</p><br/><p>“This subordinate wants to see what true mo military is like,” Shu Long said gravely.</p><br/><p>Zuo Mo finally understood. Guard Camp cultivated mo skills and the battle methods of Guard Camp were very close to the mo military. Shu Long probably wanted to see who was stronger, Guard Camp or the mo army. Zuo Mo felt a small headache. Why did this guy also have to get competitive? Was it Wei that had egged him on from the back?</p><br/><p>At the side, Shang Wei Ming’s mouth was open and could not close. What did they mean killed their way out of Blood Sky Metropolis Jie? Why weren’t they afraid? This was the infamous mo army … …</p><br/><p>He found to his shock that he understood pitifully little of Daren and the others.</p><br/><p>No one paid attention to him.</p><br/><p>After agreement of their thoughts, they quickly and methodically started to act. For this fight, Zuo Mo took out much of the materials he had gotten from the Sun Shen Temple and gave them to Golden Crow Camp to forge into talismans.</p><br/><p>Fortunately the stores on the island were filled and they were rich. They did not need to worry about running of supplies.</p><br/><p>Like an enormous machine, all of Turtle Island started to furiously turn!</p><br/><p>———</p><br/><p>“Which batch is this?”</p><br/><p>“The sixth!”</p><br/><p>“Is Turtle Island not planning to leave?” Liao Qi Chang was puzzled. At this time, every sect was racing against time to pack up and escape Cloud Sea Jie. Turtle Island’s actions became extremely eye-catching.</p><br/><p>Xiuzhe continuously flew out of Turtle Island on nimbus clouds and flew away with the wind. In the span of half a day, six groups of xiuzhe had left Turtle Island. Looking at the direction they flew in, it was in the direction of the mo army. All the signs suggested that Turtle Island did not plan on leaving.</p><br/><p>Did they plant to fight against the mo army?</p><br/><p>When this idea popped out, it frightened him. That was impossible! That was a mo army! And it was also a very powerful mo army!</p><br/><p>“No way, isn’t that seeking death?” The xiuzhe beside him was disbelieving. “Didn’t you hear? Even the Wind Element Sect was defeated! Who can stop them?”</p><br/><p>Liao Qi Chang’s mood dimmed when he heard this. Wind Element Sect was a large sect that was ranked sixth in Cloud Sea Jie. Even they had not been able to escape the knife of the mo army. The strength of this mo army could be imagined!</p><br/><p>Other than Wind Element Sect even Beautiful Water Sect, a sect ranking in the top ten, was defeated. This was another reason why no one had the courage to fight back and only knew to run away.</p><br/><p>There was no possibility of victory!</p><br/><p>Even the sects that ranked at the top like Wind Element Sect and Beautiful Water Sect had been defeated. These two sects had been very powerful. With the examples in front of them, who would be the egg that tried to smash the rock?</p><br/><p>Liao Qi Chang did not speak and only stared at Turtle Island. A while later, another few xiuzhe flew out.</p><br/><p>Liao Qi Chang’s eyes lit up. He recognized one of them and shouted loudly, “Is it Mister Ma Fan?”</p><br/><p>Ma Fan heard the shout and turned to look. Seeing it was Liao Qi Chang, he flew down. He said with a bow, “Boss Liao, you have not left yet?”</p><br/><p>“Where can we escape to?” Liao Qi Chang sighed.</p><br/><p>Ma Fan’s moved and he said, “Boss Liao can probably have a temporary stay on the island. The island is relatively safe.”</p><br/><p>“Safe? Such a great proclamation!” the xiuzhe next to Liao Qi Chang said with a snort.</p><br/><p>Ma Fan stared at the other and was too lazy to respond.</p><br/><p>Liao Qi Chang’s expression shifted. “You are not planning on leaving?”</p><br/><p>Ma Fan laughed lightly, “Just as Boss Liao has said, where can we escape to? Rather than that, we will make a stand here.”</p><br/><p>“I will give you people some words, don’t try to be heroes and overconfident. You feel that your heads are harder than rock,” the xiuzhe next to Liao Qi Chang said in a strange tone.</p><br/><p>Lei Peng could not resist. His cowbell-sized eyes suddenly widened as his hand lit up as he slapped!</p><br/><p>“Shut up!”</p><br/><p>The other person reacted quickly. His ling armor lit up.</p><br/><p>But Lei Peng’s blow was extremely heavy. Without any finesse, it landed on the illuminated ling armor. The person felt a great force pass over and his body uncontrollably fell back.</p><br/><p>Crash!</p><br/><p>Lei Peng slapped the person onto the ground.</p><br/><p>He jumped up of the ground, his face flushed with anger. “You dare to attack me, you don’t want to live!”</p><br/><p>Hiss.</p><br/><p>It was a quiet hiss.</p><br/><p>A line of coldness could be felt on his throat. The cold sword edge pressed tightly against his throat and caused his hairs to stand on end! He did not dare to move at all. Uncontrollable terror flooded him. His legs unconsciously rattled.</p><br/><p>“Idiot.”</p><br/><p>The flying sword returned to Ma Fan’s hand. Ma Fan didn’t look at the person that was frightened into a daze. He turned and said to Liao Qi Chang, “If Boss Liao goes to the island, Daren will definitely welcome you. We have a mission to complete and will not linger. Farewell!”</p><br/><p>Finishing, the three got on their nimbus clouds and disappeared into the sky.</p><br/><p>Translator Ramblings: Chaos rifts, the causes of chaos.</p><br/>\n</div>"}