{"title": "Chapter Five Hundred and Sixteen – To Cross Swords", "id": 516, "volume": 6, "url": "http://boxnovel.org/world-of-cultivation-chapter-five-hundred-and-sixteen-%E2%80%93-to-cross-swords", "volume_title": "Volume 6", "body": "<h1>Chapter Five Hundred and Sixteen – To Cross Swords</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Five Hundred and Sixteen – To Cross Swords</p><br/><p>Shi Dong looked coldly at the xiuzhe scouts that were roaming nearby.</p><br/><p>Starting from the first day of contact, the fighting between the two side’s scouts never stopped. The scouts were the elite of an army. The fighting was short yet fierce, ending in serious wounds if not death.</p><br/><p>Shi Dong did not feel surprised. He had spent many years in the military, and his heart was as hard as stone. The conflict between scouts were the prelude to a battle and he had confidence in his men.</p><br/><p>These scouts had followed him for many years. Each one of them had been promoted based on their merit and service.</p><br/><p>Yet the development of the situation still shocked him greatly.</p><br/><p>In three short days, twenty seven elite scouts had been wounded or killed. Even with a rock-solid heart, Shi Dong felt a hint of coldness. The number of wounded and dead spoke to the violence of battle. But pitting their scouts against the enemy scouts, the other had sustained an insignificant number of wounds and fatalities. Shi Dong’s gaze grew colder.</p><br/><p>Shi Dong understood. They had encountered a great enemy!</p><br/><p>However, this did not cause him to feel nervousness and uncertainty. It was the exact opposite. Under his icy expression, the battle intent in his mind was like the hidden turbulence under the thick layer of ice that was slowly rippling.</p><br/><p>The vice commander looked at the xiuzhe scouts roaming at the surroundings. Even now, he couldn’t quite believe it that his scouts were defeated.</p><br/><p>“Does Cloud Sea Jie really have such a powerful battalion?” he murmured to himself in a voice filled with disbelief. At the start when they entered Cloud Sea Jie, they hadn’t know anything but as they gathered together information, Cloud Sea Jie became clear in their eyes.</p><br/><p>Nothing had mentioned that Cloud Sea Jie had such a powerful battalion!</p><br/><p>The battalions they had defeated before had battalions that ranked in the top ten of Cloud Sea Jie but compared to this mysterious battalion, they weren’t even worth mentioning.</p><br/><p>Was this battalion the strongest battalion of Cloud Sea Jie, the Na Shan Battalion?</p><br/><p>Shi Dong did not speak. There was no meaning in trying to guess the origins of this battalion. In his eyes, there was only victory. He was not concerned at all with the other’s name or history.</p><br/><p>The enemy scouts had created a dense net. Their scouts could not leave.</p><br/><p>Subsequently the amount of information that reached Shi Dong decreased. This feeling was terrible. He seemed to be trapped in quicksand and any struggle was useless.</p><br/><p>The other did not seem to be in a hurry to attack. Other than these scouts that stuck to them like glue, the other’s primary force did not show themselves.</p><br/><p>Suddenly, Shi Dong’s mind shifted. He recalled Turtle Island. Was this battalion Turtle Island Battalion?</p><br/><p>The information on Turtle Island Battalion was almost nonexistent. There was only scattered mentions in the information they gathered and that was just about a small conflict. Thinking about Turtle Island’s recent reputation, and this mysterious battalion that suddenly appeared , Shi Dong instantly made the connection between the two.</p><br/><p>So this was how it was … …</p><br/><p>Gazing at the scouts, Shi Dong gripped the mantis blade at his waist tightly!</p><br/><p>The other was dragging it out for time!</p><br/><p>Yes! The other was trying to make time!</p><br/><p>But why were they trying to drag for time? Shi Dong’s thought became clearer. The other needed time, they were waiting for something! Were they waiting for Turtle Island’s defenses to be completed?</p><br/><p>It was not so simple … …</p><br/><p>This short contact could not be said to be a conflict but Shi Dong could smell the danger level of the other’s battle general.</p><br/><p>An expert!</p><br/><p>The other’s aims definitely were not so simple. Also, defending Turtle Island was not a very good idea … …</p><br/><p>Was it … …</p><br/><p>Shi Dong’s heart suddenly jumped. He turned around abruptly. “Inquire about Ye Ling’s situation! Immediately!”</p><br/><p>Frightened by his commanding officer’s moves, the vice commander stilled for a moment before reacting. “Yes.”</p><br/><p>He took out a black insect on his hand and cut his finger. With a flick, a drop of blood entered the forehead of the insect. The insect started to fade in his hand at a visible rate until it disappeared.</p><br/><p>Time slowly passed but the insect never came back.</p><br/><p>The vice commander’s expression changed.</p><br/><p>As expected … …</p><br/><p>Shi Dong whose expression did not change had his suspicions confirmed. He had just been speculating on the other’s intentions, now he was definitely sure.</p><br/><p>“Have we brought along any mo grass seed?” Shi Dong suddenly asked about something completely unconnected.</p><br/><p>“Yes!” the vice commander reflexively answered.</p><br/><p>Shi Dong gripped the mantis blade at his waist. He raised his head against the wind. The blue cap that represented the Sky Mantis flapped in the wind.</p><br/><p>The ocean-like eyes suddenly gave off a sharp light. It was as though he drew out the mantis blade that was sheathed at his waist. His body was filled with the determination to advance.</p><br/><p>“Our target is Turtle Island, advance at full speed!”</p><br/><p>———</p><br/><p>The other was not easy to fool.</p><br/><p>Gongsun Cha hadn’t expected this mo army to suddenly accelerate without warning. It formed a perfect assault battle formation and headed straight for Turtle Island like a sharp blade!</p><br/><p>Without a doubt, the enemy battle general had detected his aims. The counter-attack was expected, but it was unusually strong.</p><br/><p>The great majority of people in this situation would turn back to act as reinforcements if their retreat was cut off. Yet this mo army did the opposite and advanced at an accelerated rate!</p><br/><p>It was a decision filled with bravery!</p><br/><p>Even though the two were enemies, Gongsun Cha could not help himself from sighing in praise.</p><br/><p>The other was forcing him into a final battle.</p><br/><p>If the other reached Turtle Island, even if he could win, the number of fatalities would reach a terrifying number. Turtle Island’s defenses were very strong but Turtle Island itself could not hold that many xiuzhe. Xu Ling City had not finished rebuilding, and the defenses were next to nothing.</p><br/><p>If this was any other time, Gongsun Cha would not hesitate to use these people to trade for a victory.</p><br/><p>But given the situation right now … …</p><br/><p>A ruined Cloud Sea Jie was not of any benefit for them. Even Gongsun Cha, who was only interested in being a battle general, could understand a concept as shallow as this.</p><br/><p>Actually, when Zuo Mo had said the words at the time, Lil’ Miss had been very surprised. But if there had to be one person that he would support unconditionally, there was only Zuo Mo.</p><br/><p>As to whether Shixiong’s decision was correct, the obstacles they faced, and what consequences there were, it was not within the realm of his consideration.</p><br/><p>The only thing he would use his mind for, to scheme for, was victory!</p><br/><p>“You want a final battle?” Lil’ Miss’ eyes flashed with an insane light. The shadow formed by the bangs at the front of his face seemed to cover his entire face.</p><br/><p>“Then come!”</p><br/><p>His mouth unconsciously curved in a smile that was as bashful as usual.</p><br/><p>———</p><br/><p>“Can we win?” Bu Si Dong’s sweat was running in rivers down his face. The exhaustion caused his voice to gasp.</p><br/><p>They had just experienced an abnormally difficult session of training. Almost all the strength in their bodies had been squeezed out.</p><br/><p>This really was demonic cultivation!</p><br/><p>Before this, no one had ever heard of training like this. They didn’t even dare think of this. Even with the great benefits, they were full of groans and complaints. Some people had even planned on running away. But ever since those few that ran away were captured and thrown into the sword formation, the wails that occurred daily caused all of Black Martial Camp to feel their scalps prickle.</p><br/><p>Ma Fan had found experts from Golden Crow Camp to set up fifty sword formations that were placed right beside the campsite.</p><br/><p>Everyday when they trained, they could clearly hear the inhuman screams coming out of the sword formation.</p><br/><p>Everyone settled down.</p><br/><p>Bu Si Dong never thought of running away. He didn’t have any talent but he could endure hardship. In reality, the potential of a person was greater than they themselves realized. These people were starting to adjust to this terrifying level of training.</p><br/><p>The departure of Vermillion Bird Camp and Guard Camp could be concealed from other people but not from Black Turtle Camp that was adjacent to Vermillion Bird Camp. Everyone knew the counter-attack had started.</p><br/><p>When they had the time, they would discuss the situation.</p><br/><p>“They probably can.” The one who spoke was called Luo Wei. He was a sword xiu and had a natural advantage in the camp. He was also the primary attacker of their small team.</p><br/><p>However, Luo Wei’s tone did not hold much confidence.</p><br/><p>“I want us to be able to participate. Didn’t we come just to fight against the mo army? Just hiding here and training everyday, it is so irritating!” Da Ban couldn’t help but mutter from the side. He had a pair of conspicuous front teeth. He was unusually proud of them and wouldn’t think of using ling power to modify them. Consequently, everyone called him Da Ban.</p><br/><p>Luo Wei said without raising his head, “If Vermillion Bird Camp and Guard Camp cannot win, then we aren’t even enough for a mouthful. Before, I felt I was strong, now I know how laughable that idea was.”</p><br/><p>Everyone became silent.</p><br/><p>Luo Wei was right. At the beginning, there were many rebellious people but after training for a few days, they finally understood how great the difference was between themselves and Vermillion Bird Camp.</p><br/><p>“Who do you think is stronger, Guard Camp or Vermillion Bird Camp?” Bu Si Dong saw everyone was silent and hurriedly said.</p><br/><p>“Does it need to be said, of course it is Vermillion Bird Camp!” Da Ban said without thinking.</p><br/><p>Everyone’s interests were stirred by this topic and spoke up.</p><br/><p>“I also feel it is Vermillion Bird Camp.”</p><br/><p>“Vermillion Bird Camp! Ma Fan Daren is too strong!”</p><br/><p>“Those animal from Vermillion Bird Camp are not human!”</p><br/><p>All of them supported Vermillion Bird Camp. Compared to Guard Camp that had never showed its face, they had a direct experience with the strength of Vermillion Bird Camp. Some of them even felt that there wasn’t a stronger battalion than Vermillion Bird Camp in the world.</p><br/><p>Bu Si Dong noticed that Luo Wei did not speak. He couldn’t help but ask, “Luo Wei, what do you feel?”</p><br/><p>“I don’t know,” Luo Wei stopped what he was doing, “but I feel that since Guard Camp can rank together with Vermillion Bird Camp, it must have its strengths.”</p><br/><p>When he spoke, he suddenly recalled when he had seen a person from Guard Camp the other day.</p><br/><p>The other person just glanced at him, and he felt all the blood in his body freeze!</p><br/><p>This incident had given him a deep impression.</p><br/><p>He was preparing to tell everyone about the incident when Ma Fan Daren’s serene voice came like a ghost out of the ground.</p><br/><p>“You’ve rested long enough, prepare for the next part of training.”</p><br/><p>Everyone instantly jumped up as though something had bitten their behinds and sprinted towards the field.</p><br/><p>Ma Fan’s figure slowly floated out of the air as he looked into the distance.</p><br/><p>This really was so troublesome … ..</p><br/><p>And he was missing such a spectacular battle … …</p><br/><p>Translator Ramblings: Lots of scene jumps in this chapter … … Fang Xiang wants to do setup.</p><br/>\n</div>"}