{"title": "Chapter Five Hundred and Twenty Five – Cloud Crystal Mist Flow", "id": 525, "volume": 6, "url": "http://boxnovel.org/world-of-cultivation-chapter-five-hundred-and-twenty-five-%E2%80%93-cloud-crystal-mist-flow", "volume_title": "Volume 6", "body": "<h1>Chapter Five Hundred and Twenty Five – Cloud Crystal Mist Flow</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Five Hundred and Twenty Five – Cloud Crystal Mist Flow</p><br/><p>In the seven days and nights they advanced through the mist, the coldness inside the cloud mist increased. Everyone had to channel ling power to withstand the cold energy. Zuo Mo and the others finally understood why only those jindan and above dared to enter the deepest reaches of the Cloud Sea. This coldness alone was not something those below jindan could withstand.</p><br/><p>Zuo Mo had the Great Day Banded Flame and the precious treasure of the Sun Crystal Seed. The coldness did not affect him at all. What shocked him was that the Little Ones, each played happily and were extremely lively. Even Lil’ Fire whom he had thought would not be able to persist didn’t seem uncomfortable at all in the coldness.</p><br/><p>They occasionally encountered some cloud beasts along the way, but fortunately, they did not encounter cloud beasts that were two powerful.</p><br/><p>Kang De’s expression was full of worry. The abnormality of the Cloud Sea caused him to feel extremely unsafe.</p><br/><p>“Daren, the cloud river is up ahead,” Kang De’s expression lightened. “Past the cloud river, we can find water cloud embryos.”</p><br/><p>This sentence caused moral to rose and the group accelerated forward.</p><br/><p>Soon later, a large river appeared in their field of view, but when their eyes landed on the cloud river, they all stilled.</p><br/><p>Kang De suddenly became overjoyed and exclaimed, “Cloud Crystal Mist Flow! How can there be Cloud Crystal Mist Flow at this season?”</p><br/><p>There wasn’t any cloud mist on the surface of the river yet what was flowing inside the river was not river water, but densely pack ice crystals. These ice crystals were each the size of an egg and were rhomboid. It was clear and transparent, and there was a small ball of cloud mist which slowly flowed inside each rhombus.</p><br/><p>When the wide river surface that was tens of li in expanse were filled with this kind of ice crystal, countless rays of lights reflected and was dazzling.</p><br/><p>Zuo Mo raised his hand and an ice crystal flew into Zuo Mo’s hand. Strangely, once the ice crystal left the river, it quickly melted into a thread of cloud mist that disappeared into the air.</p><br/><p>Wei Sheng and Zong Ru had never seen this before and tried to grab the ice crystals as well.</p><br/><p>Wei Sheng made a light sound of surprise. “Such heavy coldness!”</p><br/><p>Kang De said with a smile, “The cloud mist would condense into a flow of water and gather in the cloud river. Every decade, a cold flow would come. When the coldness invaded the cloud river, it would form the Cloud Crystal Mist Flow. The little ball of cloud mist inside these ice crystals are the purest of cloud essence and is something great for forging! Every time the Cloud Crystal Mist Flow appears, there would be troops of xiuzhe that come here to harvest the cloud essence! We are very fortunate to encounter this!”</p><br/><p>Zuo Mo found that many xiuzhe had appeared on the shores of the river. Each person’s face was full of joy as they used all the talismans they had to gather cloud essence.</p><br/><p>Kang De took out a jade bottle and started to carefully gather cloud essence.</p><br/><p>Zuo Mo snickered and said, “We cannot enter a treasure mountain and leave empty-handed!”</p><br/><p>Finishing saying this, hundreds of jade bottles and boxes appeared in front of him.</p><br/><p>Wei Sheng and Zong Ru also started to harvest.</p><br/><p>If cloud essence was forged into flying swords, the flying sword would become more nimble and quick. Wei Sheng threw the black sword into the air. The black sword hummed lightly and then suddenly produced a strong suction. Like a whale, it sucked in ice crystals. When the ice crystals left the river, they quickly melted and then the thread of cloud essence was sucked into the black sword before it could dissipate.</p><br/><p>Zong Ru activated his Attainment Golden Body. When the enormous golden figure appeared, a faint and authoritative dhyana presence spread. A blurry bottle suddenly appeared in one of the hands of the mountainous golden body. The mouth of the bottle was pointed towards the river and countless ice crystals flowed into the bottle like birds returning to their nest.</p><br/><p>In comparison to the other two, Zuo Mo was lacking. Even though his efficiency was high and he filled up all of his jade boxes and bottles, he still was not satisfied.</p><br/><p>His eyes turned and then he suddenly thought of the [Yin Fire Bead Chapter]. Didn’t this cloud essence belong to the yin? He then tried to cast the spell of the yin bead and motioned at the cloud river.</p><br/><p>Bam!</p><br/><p>Hundreds of ice crystals in the river suddenly exploded. The threads of cloud essence were like a barrage of rain that shot into Zuo Mo’s hands and gathered into a thumb-sized bead. This bead was round and glowing as though it was carved out of crystal. What was most marvelous was that there was a faint cloudy mist floating around it that made it very beautiful.</p><br/><p>Zuo Mo saw that this method was workable and he laughed. He became even more motivated.</p><br/><p>Lil’ Pagoda laboriously flapped its eaves to absorb cloud essence. In Zuo Mo’s eyes, the xiuzhe that had forged Lil’ Pagoda’s was creative, but his method had been very primitive and crude. The reason that Lil’ Pagoda was able to reach this level was completely through relying on piles of talismans and rare materials.</p><br/><p>Gold, wood, water, fire, earth were the five levels of the pagoda. Zuo Mo had put the sixth-grade Jade Hook Tree on the wood level and Zuo Mo’s unique Great Day Banded Flame was on the fire level. The gold level was filled with vast amounts of gold crystal sand. Now they had coincidentally encountered the Cloud Crystal Mist Flow. It was definitely a one in a thousand opportunity.</p><br/><p>As the cloud essence continuously flowed into Lil’ Pagoda’s body, its dim water level slowly lit up and then exuded faint cloud mist.</p><br/><p>The xiuzhe on the river shores were disturbed by the noise going on over at Zuo Mo’s side and gave respectful and awed looks.</p><br/><p>———</p><br/><p>“Attainment Golden Body!” Ding Zhen’s eyes suddenly became bright. The figure behind Zong Ru’s back was blurry but it was the dignified golden body. His shock overtook his ability to speak and he was silent for a while.</p><br/><p>“Shishu, what is the Attainment Golden Body?” Ming Jing was astounded. What could cause Shishi to lose his composure?</p><br/><p>The other two people also stopped what they were doing.</p><br/><p>“I hadn’t expected that it was the Attainment Golden Body!” Ding Zhen forced a calm smile, “It is a wondrous dhyana scripture. Ever since the thousand year battle, it had disappeared. I had thought it was lost and it is unexpected that a branch has survived. No wonder this boy was able to attain wish power. The successor of [Attainment Golden Body] is as extraordinary as one would expect!”</p><br/><p>The three disciples showed expressions of understanding. So this was a lost dhyana scripture.</p><br/><p>Ming Zhu who had been silent suddenly spoke, “The other two are also very strong.”</p><br/><p>Hearing this, Ding Zhen stilled. Of the three disciples, Ming Zhu was the most stoic but he was usually correct in his words. Ding Zhen’s gaze finally moved away from the Attainment Golden Body. When it landed on Wei Sheng’s black sword, his pupils expanded.</p><br/><p>“Such heavy fiendish energy! Such heavy killing intent! There is actually such a vicious weapon in the world!”</p><br/><p>When he looked at Wei Sheng, he found that the other’s gaze was clear without any maliciousness and his actions were honest. It was possible to see that the killing intent of the sword had not influenced his mind. He couldn’t help but praise, “Such a determined and strong-minded man!”</p><br/><p>His gaze moved to Zuo Mo.</p><br/><p>He made a sound of surprise and his expression became bewildered. “Strange, there’s something strange!”</p><br/><p>He said to himself, “He clearly is not in the stage of jindan, so how was he able to reach this place? His hand technique is also very strange, I cannot understand it.”</p><br/><p>He kept on shaking his head.</p><br/><p>When his gaze turned to Lil’ Pagoda, his eyes lit up but then he said regretfully, “It is a pity.”</p><br/><p>The three disciples were confused by his words.</p><br/><p>Ding Zhen did not explain and just said, “These three are of extraordinary origins. We need to be extremely careful in our journey this time and not get in conflict with them.”</p><br/><p>Seeing the unconcerned faces of the three disciples, Ding Zhen’s brow furrowed. But when he thought about how they would have him, a yuanying, supporting them, he couldn’t help but laugh. He was too cautious.</p><br/><p>He did not continue to persuade them and said with a smile, “You may want to harvest some more. It would be difficult to encounter such pure cloud essence in the future. It is a very good gift to give to your shixiong and shidi when you return to your sect.”</p><br/><p>This time, even Ming Zhu took out a jade bottle and started harvesting.</p><br/><p>———</p><br/><p>Of the three, Zong Ru was the first to finish. The bottle became even more defined. It had grown longer and there was a blood red lotus on the surface of the bottle that flickered. The bottle was shrouded in cloud mist as it slowly faded into the golden body.</p><br/><p>Zong Ru’s palms came together as he stood up and bowed towards the cloud river.</p><br/><p>Zuo Mo had also formed hundreds of cloud beads. He had used up all of the ling power inside his body. He stopped, threw a few ling dan into his mouth and sat down cross-legged to recover his ling power.</p><br/><p>Lil’ Pagoda seemed to be over stuffed as he swayed back into A Gui’s arms and laid down with its tummy facing up.</p><br/><p>The black sword’s absorption of the cloud mist had not decreased.</p><br/><p>Wei Sheng stared attentively at the black sword and found to his surprise that the shape of the black sword was slowly changing.</p><br/><p>The body of the sword became even narrower, and caused the sword to look longer in comparison. Compared to its previous vicious appearance, it seemed nimbler and more spirited. Despite appearances its length was actually shortening. The long sword which had been the length of a person was now about the same length to Wei Sheng’s ribs. The ruler-straight sword was still simple and unadorned, it had a deep black luster that did not give off any light.</p><br/><p>The present black sword was still a size larger than normal flying swords but was much more delicate in appearance than in the past. It was as though an ancient wild beast had hidden away its thick claws and teeth to silently settle down.</p><br/><p>There wasn’t any aura of viciousness or fiendish energy, no killing intent, but for some unknown reason, Wei Sheng’s heart was full of a faint joy.</p><br/><p>It took two whole hours before the black sword stopped absorbing cloud essence.</p><br/><p>The black sword suddenly disappeared and then reappeared in Wei Sheng’s hand.</p><br/><p>Wei Sheng gripped the hilt of the sword which was the perfect thickness and length for his hand. A smile blossomed on his face.</p><br/><p>Kang De had finished before Zong Ru did. He had not expected to encounter the Cloud Crystal Mist Flow and had not prepared. However, he was not greedy and was very satisfied with the surprise.</p><br/><p>“Daren, after crossing this cloud river and walking for two more days, we will enter the grounds of harvesting water cloud embryos … …”</p><br/><p>Before Kang De finished speaking, his voice suddenly choked off. Almost at the same time, Zuo Mo and the others looked at the cloud river.</p><br/><p>A blue light suddenly flew out of the cloud river, covered in layers of ice crystals, and struck a xiuzhe. The xiuzhe hit was instantly frozen into a statue of ice. He didn’t even had the time to scream before he dropped into the cloud river and disappeared!</p><br/><p>“Ice Breath Beast!” Kang De’s face turned ashen and his voice trembled.</p><br/><p>The xiuzhe who were harvesting by the river shore instantly started to panic. Each of them had ashen faces as they turned and tried to escape.</p><br/><p>Dozens of blue energies flew out of the river. The xiuzhe that were struck instantly turned to ice sculptures. Even the expressions of their faces were preserved as though they were alive.</p><br/><p>This time, even Zuo Mo’s group changed expression!</p><br/><p>These dozens of xiuzhe were all jindan but were able to withstand one blow of this blue light!</p><br/><p>What was even harder to believe was that the ones that were hit were the xiuzhe who had turned in order to escape!</p><br/><p>Zuo Mo’s heart shook. Such high intelligence!</p><br/><p>Suddenly, someone exclaimed in shock, “Heavens! The cloud river is growing!”</p><br/><p>As he had said, the layers of ice crystals were growing upwards. They quickly reached the same level as the rivers of the shore and they were still rising!</p><br/><p>At this time, several bolts of blue light suddenly shot at Zuo Mo’s group!</p><br/><p>Face ashen, Kang De’s soul almost left his body!</p><br/><p>Translator Ramblings: The course to the water embryo is never a smooth one.</p><br/>\n</div>"}