{"title": "Chapter Five Hundred and Twenty Three – Xuan Kong Temple", "id": 523, "volume": 6, "url": "http://boxnovel.org/world-of-cultivation-chapter-five-hundred-and-twenty-three-%E2%80%93-xuan-kong-temple", "volume_title": "Volume 6", "body": "<h1>Chapter Five Hundred and Twenty Three – Xuan Kong Temple</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Five Hundred and Twenty Three – Xuan Kong Temple</p><br/><p>Zuo Mo and the others did not pay attention to the He Brothers. Even Kang De did not keep them in mind. Beside him was the true master of Cloud Sea Jie. People like the He Brothers were not worth a mention.</p><br/><p>As they descended into the Cloud Sea, the light gradually dimmed. The thick Cloud Sea blocked most of the sunlight but this was not as dark as Zuo Mo had imagined. There were many cloud grasses floating in the cloud layers and each released faint light that illuminated the world below the Cloud Sea.</p><br/><p>Kang De saw Zuo Mo and the others curiously examining the cloud grasses and hurriedly explained, “This place is a great producer of cloud grasses. The quality is very good, and occasionally, merchants from the outside will come and buy them. However, this is worthless locally.”</p><br/><p>“What is the use for this?” Zuo Mo asked curiously.</p><br/><p>It was the first time he saw cloud grasses. These cloud grasses were shaped like sea grasses, the blades had the thickness of a pinky, completely white, and would release faint light. The individual bushes were about the size of a basket, and it was possible to occasionally see enormous ones that were multiple zhang in area.</p><br/><p>“They can be used to forge water element ling dan, but only first grade,” Kang De said. “Those that aren’t strong wouldn’t dare to come down. Those that are strong do not care about these cloud grasses. These cloud grasses reproduce extremely quickly and can be found everywhere.”</p><br/><p>Zuo Mo understood.</p><br/><p>Everyone walked down. This mountain path was misty but the mist was tin.</p><br/><p>“Under the Cloud Sea, what is most common is all kinds of cloud beasts. There are many people that come to hunt cloud beasts. Cloud beasts are water-oriented, and many people like them. But to get high-grade ones, they need to go deep into the Cloud Sea.”</p><br/><p>Zuo Mo asked curiously, “What qualities of the cloud beasts are outstanding?”</p><br/><p>“Being of the water element, their most powerful ability is their illusory spells. Since their body is formed from cloud mist, unless one encounters fire spells, other spells cannot inflict major damage.” Kang De was clearly familiar with this area and his words flowed without needing to think.</p><br/><p>“How long has Old Kang been here?” Wei Sheng asked Kang De.</p><br/><p>Kang De couldn’t help but sigh. “More than a decade. Actually, there are several other entrances to the Cloud Sea other than this one, but this is the most famous one. Consequently, this place has the most xiuzhe making a living here.”</p><br/><p>Wei Sheng smiled. He had endured poverty before but his heart was dedicated to the sword. The hardships of life did not leave any mark behind and he naturally did not feel anything. Zuo Mo couldn’t help but think back to his time at Wu Kong Mountain when he fought everyday for each piece of jingshi. He instantly felt sympathy.</p><br/><p>Seeing Kang De’s expression was slightly heavy, Zuo Mo hurriedly changed the topic. He said with a smile, “Those who have not come down definitely could not imagine that the scenery down here is very good!”</p><br/><p>The faint cloud mist was like silk. The cloud grasses floating in the Cloud Sea slowly swayed with the Cloud Sea.</p><br/><p>“Haha, Daren has good taste. But the scenery later will be even better!” Kang De laughed openly.</p><br/><p>As Kang De said, the scenery below was even more beautiful.</p><br/><p>After walking for four whole hours, their field of view suddenly broadened. They had passed through the thick Cloud Sea!</p><br/><p>The thick Cloud Sea slowly rippled above their heads and countless cloud grasses drooped down from the Cloud Sea. These cloud grasses were extremely large, all of them multiple mu in area. The blades that dangled down were dozens of zhang in length. Looking from afar, the Cloud Sea was a curved ceiling, and the drooping cloud grasses were like densely packed waterfalls of light. The scenery was spectacular and endless!</p><br/><p>“It’s so beautiful!” Zuo Mo was astounded.</p><br/><p>Wei Sheng and Zong Ru were also shocked by the spectacular scene in front of them. Lil’ Pagoda and the others instantly became excited and flew around A Gui. Lil’ Fire was so excited it started to chirp.</p><br/><p>Kang De smiled slightly. He was used to the scene in front of him and had become habituated to it a long time ago.</p><br/><p>The xiuzhe that walked past them all smiled. Every greenhorn that entered the deep of the Cloud Sea for the first time would have this expression.</p><br/><p>There was a constant flow of xiuzhe passing by. Everyone hoped to get something early. The price of the first batch of cloud beasts and water cloud embryo was usually the highest of the year.</p><br/><p>At this time, Zong Ru whose eyes had been closed all this time suddenly made a sound and turned his head slightly.</p><br/><p>Several dhyana xiu attracted his attention. The leader was one wearing purple dhyana robes. He had white brows and hair, and had an extraordinary mannerism. Behind him were three dhyana xiu in blue robes who were all very young.</p><br/><p>These dhyana xiu also noticed Zong Ru. The purple-robed dhyana xiu’s eyes flashed. He did not speak but his palms came together as he bowed towards Zong Ru.</p><br/><p>Zong Ru’s eyes were still closed but a warm smile came onto his face. He also returned the greeting with his palms together.</p><br/><p>Noticing Zong Ru’s action, Wei Sheng looked over.</p><br/><p>The other also noticed Wei Sheng. A thread of shock flashed across the purple-robed dhyana xiu again but his expression did not change. With a harmonious air, he bowed towards Wei Sheng.</p><br/><p>Wei Sheng did not speak and bowed slightly in acknowledgment.</p><br/><p>From beginning to end, the two sides did not speak, but a strange exchange had occurred between the two sides.</p><br/><p>Only when the other had gone far away did Zong Ru and Wei Sheng take their eyes away.</p><br/><p>“These people are not simple,” Wei Sheng said in a deep voice. “The dhyana xiu in purple robes is very powerful, and possibly a yuanying. Even if he isn’t, he isn’t far from becoming one.”</p><br/><p>Zong Ru nodded and agreed, “They should be from one of the great temples. We can ask Yi Zheng. He should know.”</p><br/><p>Zuo Mo who had been wandering in his thoughts finally focused. Seeing the two acting as though they were facing a great enemy, he couldn’t help but inquire. The two narrated what just occurred. Zuo Mo thought and then decided to go ask Yi Zheng.</p><br/><p>Kang De hadn’t planned on talking but he still couldn’t help but say, “Daren the Cloud Sea is thick. Paper cranes and normal flying swords cannot be used here, and cannot deliver messages to the outside.”</p><br/><p>Zuo Mo waved his hand and said, “No worries, I have my ways.”</p><br/><p>Zong Ru casted a small illusory spell which projected the appearances of the dhyana xiu. Zuo Mo memorized it and then entered the sea of consciousness. Ha, other people could not use paper cranes but he could go through Pu Yao and pass the message out.</p><br/><p>But he hadn’t expected Pu Yao to snort when he saw the people and said, “There’s no need to ask other people, I know their origins.”</p><br/><p>Zuo Mo said suspiciously, “You know?”</p><br/><p>Pu Yao smirked coldly, “We fought so long in the past, it’s impossible for me not to recognize them. They are baldies from Xuan Kong Temple. Ha, you better be careful.”</p><br/><p>“Xuan Kong Temple?” Zuo Mo almost shouted.</p><br/><p>The biggest powers in the xiuzhe world were the four realms, Kun Lun, Tian Huan, Xi Xuan, and Xuan Kong.</p><br/><p>Xuan Kong Realm was the holy land of the dhyana xiu, and the gathering place of all the famed temples in the world. Xuan Kong Temple was also the leader of all the temples in the world! Yi Zheng’s Great Buddha Temple might also be one of the ten great temples, but compared to Xuan Kong Temple, there were not in the same class.</p><br/><p>“You better not encounter the baldies of Xuan Kong Temple. Otherwise, hee hee … …” The bloody sea of Pu Yao’s red eye roiled.</p><br/><p>Zuo Mo was frightened by Pu Yao’s vicious expression. He hadn’t seen Pu Yao act like this when it was Kun Lun. “Are they more powerful than Kun Lun?”</p><br/><p>“More powerful than Kun Lun? Not that powerful,” Pu Yao said coldly, “Kun Lun is the top in fighting power, but none are more powerful than the baldies in dragging people down. The baldies are mother***ing fanatics that do not fear death. There was one battle in the past when the baldies wanted to exterminate us ‘evil’ yaomo and sixty yuanying committed suicide by exploding! If it wasn’t laozi that noticed something was wrong, we would have fell for it, and been blasted to pieces.”</p><br/><p>“Exploded … … six … … sixty yuanying … …” Zuo Mo stammered. He was unable to talk smoothly. This secret piece of information was so shocking he lost the ability to think. Sixty yuanying, sixty yuanying collectively exploding themselves. How crazy would they have to be to do that?</p><br/><p>One yuanying from Tian Huan was enough to cause chaos in Cloud Sea Jie , sixty yuanying … …</p><br/><p>When Zuo Mo came out of the sea of consciousness, Zong Ru and Wei Sheng looked at him. They had noticed Zuo Mo’s terrible expression long ago.</p><br/><p>Zuo Mo opened his eyes and said in a dry voice, “They are from Xuan Kong Temple.”</p><br/><p>“Xuan Kong Temple?”</p><br/><p>Wei Sheng and Zong Ru inhaled sharply. Kang De’s expression instantly turned ashen.</p><br/><p>Xuan Kong Temple! The leader of all dhyana xiu, one of the four great sects in the world!</p><br/><p>“Why have they come here?” Wei Sheng’s sword heart was like stone and he quickly calmed down.</p><br/><p>Zong Ru’s Samadhi was also extremely high. His mind shook and then he recovered his calmness.</p><br/><p>Zuo Mo also recovered his calm. So what if it was Xuan Kong Temple? Hadn’t he managed to trick the elder from Tian Huan? He had been frightened by the simultaneous suicide explosion of sixty yuanying that Pu Yao had mentioned.</p><br/><p>He turned around his thinking. He was just a little character. They wouldn’t give him such a grand treatment.</p><br/><p>He suddenly thought of something. He had to tell Guard Camp, Grey Camp, Nan Yue and the others to not show themselves in the short term. If the group of fanatics really caught them, they would definitely try to exterminate and kill yaomo.</p><br/><p>Pu Yao was extremely dissatisfied with this action of retreating but he also knew there was no chance of victory if he had Zuo Mo face Xuan Kong Temple at this time.</p><br/><p>Wei held a slight smile as he watched Pu Yao and Zuo Mo fight. But from any angle, it seemed that he was laughing at Pu Yao.</p><br/><p>After sending out the orders, Zuo Mo saw the terror in Kang De’s eyes and his ashen complexion. He hurriedly comforted. “Let’s go, don’t bother with them. The Cloud Sea is so large, and everyone has their own aims. We won’t encounter them.”</p><br/><p>Kang De’s complexion finally improved. He felt that the words were right. He knew just how large the Cloud Sea was. How likely would it be that they encountered each other and competed over the same item?”</p><br/><p>However, after this incident, Zuo Mo lost all of his interest. The beautiful and vast scenery instantly became tasteless.</p><br/><p>“The Cloud Sea is endless and there are many paths. If it is someone who is unfamiliar, they would definitely get lost.” The cloud over Kang De’s mind gradually dissipated. Even though everyone was coming down from Beak Island but the possibility of encountering each other was pitifully small.</p><br/><p>Zuo Mo swept the surroundings and suddenly asked, “Why is no one flying?”</p><br/><p>Kang De hurriedly explained, “The Cloud Sea is different than other places. It is best not to fly in here. The ling power vibrations can easily attract the attention of many cloud beasts that hide in the cloud layer. At the beginning, many people thought they were powerful and just charged recklessly through but they never came out in the end. After such a long time, no one dared to fly in there.”</p><br/><p>“So that’s why!” Zuo Mo finally understood.</p><br/><p>Fortunately, everyone was of deep cultivation. Walking was not a problem.</p><br/><p>After walking down for several hours, the cloud layer above their heads that was filled with cloud grasses became further away. Some cloud mist appeared along the road. The cloud mist was extremely unique. It was gathered and did not dissipate. Even when the wind blew past, it did not move at all.</p><br/><p>Little paths flickered in and out of view between the cloud mists as though there were complex spider-webs spreading into the cloud mist.</p><br/><p>Translator Ramblings: Sometimes, I think that Wei Sheng also fits the stereotype of the monks. Devout, philosophical and uncaring of physical pleasures.</p><br/>\n</div>"}