{"title": "Chapter Five Hundred and Twenty Four – Omen", "id": 524, "volume": 6, "url": "http://boxnovel.org/world-of-cultivation-chapter-five-hundred-and-twenty-four-%E2%80%93-omen", "volume_title": "Volume 6", "body": "<h1>Chapter Five Hundred and Twenty Four – Omen</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Five Hundred and Twenty Four – Omen</p><br/><p>Looking at the little path that was leading into the Cloud Sea, Zuo Mo released a breath for some unknown reason. Truthfully, the suddenly appearance of the Xuan Kong Temple’s dhyana xiu gave him enormous pressure. Anything that could attract Xu Kong Temple’s dhyana xiu was not going to be anything normal. Zuo Mo wasn’t interested at all. He just didn’t want anything to happen as he tried to heal A Gui.</p><br/><p>“There are so many divergent paths, you know all of them?” Zuo Mo asked Kang De in curiosity. There were hundred of these little paths that criss-crossed and confused the eyes.</p><br/><p>“Daren don’t worry, this subordinate has been hunting here for over a decade and won’t walk wrong even with the my eyes closed,” Kang De said proudly. He then introduced, “These little paths might look complex, but if one goes through a few times, they can learn them. Starting from here, we will enter the true Cloud Sea. The cloud mist here is not thick, the deeper we go down, the thicker it becomes.”</p><br/><p>Kang De led the group at the front.</p><br/><p>They walked onto a curved little path and quickly disappeared in the Cloud Sea.</p><br/><p>———</p><br/><p>“Shishu, are those people suspicious?” Ming Jing asked probingly. Of the three young disciples, his mind was the nimblest and he noticed Shishu’s abnormalness.</p><br/><p>Pu Yao was correct, these people were dhyana xiu from Xuan Kong Temple. The white-browed purple robed dhyana xiu was called Ding Zhen, and the disciples in blue robes were third-generation disciples. Ding Zhen had come out with these disciples for them to gain experience. Along the way, they had received a message from the sect leader and turned to Cloud Sea Jie.</p><br/><p>Ding Zhen nodded, “That dhyana xiu is from an unknown sect, he actually possesses wish power, it really is rare.”</p><br/><p>“Wish power?”</p><br/><p>The three disciples stammered, their face filled with belief. The dhyana xiu that they had seen didn’t appear much older than them. He also did not look special.</p><br/><p>Wish power was one of the rarest powers of all the dhyana xiu powers. The three of them were among the top ranks of the young disciples of Xuan Kong Temple and naturally knew what wish power meant.</p><br/><p>The number of people Xuan Kong Temple, the greatest temple in the world, who possessed wish power could be counted on the fingers.</p><br/><p>“There are always better people, the world outside is filled with hidden dragons and crouching tigers.” Ding Zhen glanced at the trio. “Also, that sword xiu’s sword essence is so pure and condense that I have only seen such a thing before on a few Kun Lun disciples. If you encounter him, do not be careless.”</p><br/><p>The other disciple reacted the quickest. “Shishu, could they be disciples from Kun Lun?”</p><br/><p>“Not Kun Lun.” Ding Zhen shook his head, “The sword essence of Kun Lun does not feel like this.”</p><br/><p>The expressions of the three disciples relaxed. It was good that it was not Kun Lun. Kun Lun had dominated the top position of the Four Realm Heaven for thousands of years. Even disciples of Xuan Kong Temple were not willing to encounter Kun Lung disciples. The four great sects fought openly and in the shadows, but there were rarely any direct conflicts. All of them were colossal beings. If fighting really started, it could not easily end.</p><br/><p>As long as those were not disciples of the other three sects, they didn’t feel the need for any consideration. The enemies they were wary of and would treat equally were only disciples of the four great sects, people that were on the same level as themselves.</p><br/><p>Seeing the unconcerned expression on the faces of the three disciples, Ding Zhen shook his head inside. But when he recalled how he had been similarly proud when he was young, he smiled and let it pass.</p><br/><p>The disciples of Xuan Kong Temple had the right to be proud.</p><br/><p>———</p><br/><p>Along the way, Kang De chatted about all the strange tales and rumors of the Cloud Sea. His oratory skills were not good but he was very experienced and knew many details. Zuo Mo’s group listened attentively.</p><br/><p>This trip took a day and night before the cloud mist started to become thick enough to obscure their vision. The pure white mist that seemed like cotton almost filled all of their vision. Little paths flickered in and out of the view in this cloud mist. If they were not careful and wandered off into the cloud mist, they would lose their direction. Then it would really be dangerous.</p><br/><p>Zuo Mo curiously examined the cloud mist floating in the air. These cloud mist were in the air but they did not float everywhere. These little paths were very fine but there wasn’t any mist on the path.</p><br/><p>Zuo Mo asked Kang De about this.</p><br/><p>Kang De scratched his head. “Daren, this subordinate has never thought about this. This subordinate has been here for over a decade. Even though the cloud mists will change annually, but these little paths rarely change.”</p><br/><p>“Would there be any dangers here?” Zuo Mo asked.</p><br/><p>“There are rarely any dangers in this area. Xiuzhe frequently come through here so cloud beasts and other things have been cleaned out,” Kang De said.</p><br/><p>As Kang De finished speaking, Zong Ru who was walking in the rear of the group, with his eyes closed, suddenly made a sound and stopped walking.</p><br/><p>A cold light flashed through Zuo Mo and Wei Sheng’s eyes. They instantly stopped moving and held themselves warily.</p><br/><p>Kang De was extremely confused.</p><br/><p>“Something is nearing us,” Zong Ru said in a low voice.</p><br/><p>Zong Ru’s Samadhi deepened and his sixth sense was extremely sensitive. Unless Zuo Mo expanded his consciousness, he was not a match for Zong Ru. However, Zuo Mo and Wei Sheng were powerful people. At almost the same moment Zong Ru spoke, they had also detected danger!</p><br/><p>Wei Sheng held his black sword in his hand. Zuo Mo’s shen power turned into the three powers and was held in waiting.</p><br/><p>Woosh woosh woosh!</p><br/><p>Several white mist arrows suddenly shot out of the cloud mist with tearing sounds.</p><br/><p>Zuo Mo’s movement were extremely rapid. His consciousness shifted and several [Ice Mirrors] were cast. Ever since he listened to Kang De speak about the unique qualities of the cloud bests hears, Zuo Mo felt that yao arts were more suited to the Cloud Sea.</p><br/><p>[Ice Mirror] was a kind of little yao art. When Zuo Mo used it, it was so fast people could not catch it.</p><br/><p>Bam bam bam!</p><br/><p>The ice mirrors shattered and a cold energy spread in the air.</p><br/><p>Several white shadows that charged out of the cloud mist instantly froze as their bodies entered the cold energy.</p><br/><p>Inside the cold energy were three cloud beasts that were shaped like squirrels. Their body was frozen by the cold energy into ice, and they still maintained their charging position.</p><br/><p>They were transparent and glowed like ice statues. Their faint blue eyes were beautiful.</p><br/><p>Bam bam bam!</p><br/><p>They crashed onto the ground and instantly shattered into a pile of ice.</p><br/><p>The ice quickly melted into water, and then dissipated into cloud mist to disappear.</p><br/><p>“Cloud mice!” Kang De’s expression was shocked as he murmured to himself, “No! No! How can there be cloud mice here?”</p><br/><p>Hearing this, Zuo Mo’s brow furrowed. “You are saying these things should not appear here?”</p><br/><p>Kang De refocused and hurriedly said, “Yes Daren! Cloud mice are very sensitive to the movements of xiuzhe, and usually live deep in the Cloud Sea where there are no people. Also … …”</p><br/><p>He halted.</p><br/><p>“Also what?” Zuo Mo asked in a deep voice.</p><br/><p>“Cloud mice would rarely attack xiuzhe proactively.” Kang De’s expression was not well. “Cloud mice are very gentle and their temperament makes them suited to be pets. Female xiuzhe often like them. It is the first time that this subordinate has seen cloud mice attack xiuzhe unprovoked.”</p><br/><p>“State your point!” Zuo Mo saw Kang De’s hesitating and his face darkened.</p><br/><p>Kang De gritted his teeth and stated his speculation, “This subordinate thinks that something might have happened deep in the Cloud Sea so these cloud mice are acting … …”</p><br/><p>“I understand. We will be careful and take precautions for our safety.” Zuo Mo understood what Kang De meant but he was definitely unwilling to go back like this.</p><br/><p>Before departing, he had made the decision to find a water cloud embryo.</p><br/><p>This matter did not just concern A Gui, but also his birth and origins. He had a strong feeling that the relationship between he and A Gui was definitely not simple!</p><br/><p>Zuo Mo had prepared fully for this trip. He had asked Gu Ming Gong for several transportation seals and he was not afraid of encountering danger.</p><br/><p>Seeing Zuo Mo’s determined attitude, Kang De could not do a thing. The other person was his boss.</p><br/><p>———</p><br/><p>“Shishu, something’s not right.” Ming Jing’s expression was not well. They had encountered several waves of attack. He felt a thread of uncertainly. Ming Jing had come to the Cloud Sea to hunt cloud beasts before and was not unfamiliar with this place. The unusual situation was clearly a sign of something wrong.</p><br/><p>“What is not right?” Ding Zhen asked.</p><br/><p>“This disciple has come to the Cloud Sea before. These cloud mice are fearful of people and would never attack xiuzhe first. Right now, they are so restless, this disciples suspects that something under has changed,” Ming Jing carefully responded.</p><br/><p>“A change?” A light suddenly flashed through Ding Jing’s indifferent eyes. He seemed slightly excited as he looked towards the depths of the Cloud Sea.</p><br/><p>Ming Jing jumped in fright at Ding Jing Shishu’s burning gaze. It was the first time he saw such a gaze from the composed and indifferent Ding Zhen Shishu. Was there … …</p><br/><p>His mind suddenly shifted as he recalled Ding Zhen Shishu having received a message from the sect leader in the middle of their journey. Ding Zhen Shishu immediately had hurried to Cloud Sea Jie by travelling day and night.</p><br/><p>Was there something that the sect leaders cared about that was hiding in the depths of the Cloud Sea?</p><br/><p>Ding Zhen glanced at Ming Jing. Ming Jing’s heart jumped. Shishu’s gave was as sharp as a sword and seemed to piece to the bottom of his heart.</p><br/><p>“Let’s go.” Ding Zhen’s expression became aloof again as he started to walk deeper into the Cloud Sea.</p><br/><p>———</p><br/><p>Li Shu’s mood was terrible.</p><br/><p>The mission of the Sun Shen Temple had failed. Even though the sect leader did not punish him, but thinking about what he had lost, there seemed to be a fire burning inside of him.</p><br/><p>The invasion of the mo army and the news that Turtle Island had instantly taken over all of Cloud Sea Jie had also arrived in his ears.</p><br/><p>Turtle Island’s power shocked him again. To be able to win against a mo army, even a normal mo army, Turtle Island was more powerful than they appeared.</p><br/><p>They had disguised themselves so well that he had not discovered their true strength!</p><br/><p>It was a pity that the sect had no interest in Cloud Sea Jie after the Sun Shen Temple. Chaos rifts were continuously appearing in the jies governed by Tian Huan. Several small-scale yaomo battalions had been discovered in several jie, and the strength the sect had to spare for minor endeavors had instantly became limited.</p><br/><p>This was to the point that the number of battalions sent to the front lines had dramatically decreased. If their homeland was invaded by the yaomo, there would not be any value in guarding the front line.</p><br/><p>Jingshi, materials, ling grains, and etc. Every kind of resource supply was having problems. These were all major problems.</p><br/><p>Elder Shen was sent to the front lines and Li Shu received orders to go to a place called Tong Yu Jie to assist the local battalion because they had discovered a small yaomo battalion there.</p><br/><p>Tong Yu Jie was the producer of the ling jade which was important to Tian Huan. Ling jade was a very important raw material for forging seals. The importance of Tong Yu Jie to Tian Huan did not need to be said.</p><br/><p>In comparison, the remote Cloud Sea Jie that did not produce anything significant and wasn’t worth a mention.</p><br/><p>The Sky-Splitting Calamity had come without any warning and caused every sect to descend into chaos, and their responses disorganized.</p><br/><p>No matter how much Shen Wu Hai and Li Shu wanted to settle their debts, the order had come down and they could only obediently accept the missions.</p><br/><p>But, he really was not content … …</p><br/>\n</div>"}