{"title": "Chapter Five Hundred and Thirty Eight Arrangements", "id": 538, "volume": 6, "url": "http://boxnovel.org/world-of-cultivation-chapter-five-hundred-and-thirty-eight-arrangements", "volume_title": "Volume 6", "body": "<h1>Chapter Five Hundred and Thirty Eight Arrangements</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Five Hundred and Thirty Eight Arrangements</p><br/><p>Shattered Stone Town was not large and did not have a large population. The climate was extremely dry, because it was at the border of the Gobi Desert. It was also extremely poor and did not produce any specialty products. The survival here was extremely primitive and rural, the only thing in this place that held any value were the Iron Digging Ants. This was a very practical kind of ant that was well-liked by mo that liked playing with insects.</p><br/><p>Every year, there would be some mo that would come to search for Iron Digging Ants. Only during these times would Shattered Stone Town seem lively.</p><br/><p>However, for the residents of the little town, they did not feel this place was desolate.</p><br/><p>Uncle Lizard Mo looked very brawny but he had a very delicate name, An Ya, In reality, Zuo Mo did not feel this elegant name had any connection with the Uncle Lizard Mo.</p><br/><p>Uncle An Ya was very friendly. Even though his tone was slightly fierce, he took great care of Zuo Mo and A Gui, especially A Gui. The hints of sorrow that occasionally flashed through Uncle An Ya’s eyes as he looked at A Gui caused Zuo Mo to speculate that Uncle An Ya had once had a daughter that was like A Gui.</p><br/><p>It could be seen that Uncle An Ya held great authority in Shattered Stone Town. He was responsible for teaching mo skills to the young mo and the idol for many of the youths.</p><br/><p>“Notice your footwork. Before you learn to fly, footwork is the only thing you can use!”</p><br/><p>“Power! What did I teach you? Gather your power together, it will only be strong then. So soft, do you want A Gui to laugh at you?”</p><br/><p>The young mo that heard this blushed.</p><br/><p>“Work hard!” Zuo Mo who was lying on A Gui’s back shouted. These young mo blushed even more.</p><br/><p>A Gui was just the same as before and unreactive.</p><br/><p>The youth of the town quickly accepted Zuo Mo and A Gui. Before they were ground down by the world, youths were always friendly and full of sympathy. In their eyes, Zuo Mo and A Gui were sick and crippled. But their worldly experiences had caused the youth to be filled with yearning and curiosity.</p><br/><p>A Gui did not react but Zuo Mo who had become a chatterbox was the example of a friendly person. They were quickly accepted into the group.</p><br/><p>In the Gobi Desert, A Gui would put Zuo Mo down to rest after walking for one day and night but strangely, after they came to Shattered Stone Town, she never put Zuo Mo down once. Uncle An Ya had tried a few times to get Zuo Mo own but when he saw A Gui’s instinctive wariness, he did not try any longer.</p><br/><p>Zuo Mo could only sleep on A Gui’s back. However, what made him happy was that, other than being unwilling to put him down, A Gui seemed to be able to hear some of his words.</p><br/><p>Like right now, come out to sunbathe, watch the youth cultivate.</p><br/><p>The lessons Uncle An Ya was teaching was extremely basic content. Zuo Mo’s entire body was paralyzed but his eyes were still working. Uncle An Ya’s battle experience should be very high and all of the things he taught were practical. Even Zuo Mo felt he learned a lot just watching.</p><br/><p>He had cultivated mo skills before and had even managed to get a mo physique but these fundamental concepts were the part that he lacked. Especially now when he was paralyzed, Zuo Mo would frequently learn many things from listening to Uncle An Ya talk. What was even better was that one day, he found he could move a finger again.</p><br/><p>After that, if Uncle An Ya was teaching, he would definitely go to listen. Uncle An Ya did not have any objections as what he taught was not profound content and naturally did not need to keep it a secret.</p><br/><p>“Pretty good, Little Dong!” Uncle An Ya complemented, “After a while, you can awaken your mo matrix.”</p><br/><p>A boy showed excitement. Dong Zi was the most talented out of this group of youths. He had solid fundamentals and his skill was a notch above the other youths.</p><br/><p>However, awaken the mo matrix? Zuo Mo was slightly puzzled.</p><br/><p>Fortunately, there was Wei “who had noble status” and knew a bit about this. “Low level mo usually only have low level mo matrixes on their body, and they are not completely developed. They need to awaken the mo matrix through other methods before it can be used.”</p><br/><p>Zuo Mo was slightly shocked, “There’s things like this?”</p><br/><p>Pu Yao smirked coldly and said, “The mo care the most about bloodlines because of this. The more noble the bloodline of the mo, the more powerful the mo matrix they would have and naturally the stronger they would be. Hmph, this is a succession method that degrades the most easily.”</p><br/><p>Zuo Mo suddenly thought of a question, “Then can’t they just get mo matrixes engraved?”</p><br/><p>Wei and Pu Yao stilled.</p><br/><p>“Didn’t Vermillion Bird Camp have formations engraved before? Since formations are possible, why not mo matrixes? Those formations even originated from the mo matrixes!” Zuo Mo said excitedly.</p><br/><p>“You can try,” Pu Yao said casually. He was not interested in this question. In the past, he had felt great anticipation about this problem because of his hopes that one day, he could possess his own body. But that was meaningless to him now. He and Wei could not be separated.</p><br/><p>Since this was the case, why would he still want to work on the mo matrixes? Was there a place better than this sea of consciousness?</p><br/><p>Wei sank into deep thought. Zuo Mo’s words were a blow for him. The mo were born with their matrixes and in their view, this was the power that the heavens gave them. No one had ever tried to engrave mo matrixes before, at least, no one had done it in the eras he had experienced.</p><br/><p>Zuo Mo did not pay attention to these two unreliable people. He had many mo matrixes including the Golden Winged Roc which Pu Yao had given him in the past.</p><br/><p>He decided to first go see how they actived the mo matrix. He had never seen it before and was very curious.</p><br/><p>Also, he had a daring idea.</p><br/><p>———</p><br/><p>“Daren, tell us, when is Boss coming back?” Lei Peng smacked his lips and seemed to be thinking of something.</p><br/><p>“I don’t know,” Lil’ Miss said without raising his head.</p><br/><p>“I wonder what Daren is doing, is there danger?” Lei Peng murmured to himself with a creased brow.</p><br/><p>“You are very idle!” Lil’ Miss raised his head.</p><br/><p>“No, no!” When Lei Peng met Lil’ Miss’ gaze, his head shook like a rattledrum. “Daren, you don’t know, Black Turtle Camp has just started and those greenhorns are so terrible … …”</p><br/><p>“I think you are too idle!” Lil’ Miss interrupted Lei Peng. With just a glance, Lei Peng wilted. Lil’ Miss said lightly, “Return and tell Ma Fan that I will be inspecting your cultivation progress tomorrow.”</p><br/><p>“Boss, no way … …” Lei Peng was on the verge of tears. If he returned and Ma Fan and Nian Lu learned he had caused Lil’ Miss to come visit… … he shook just thinking about it.</p><br/><p>Lil’ Miss smiled bashfully.</p><br/><p>“An’s leaving, an’s leaving!” Lei Peng stumbled and crawled as he fled.</p><br/><p>After Lei Peng left, Lil’ Miss moved his gaze and a shadow flashed across. Wei Sheng had passed information back. The one they had fought had been a yuanying xiuzhe from Xuan Kong Temple and the other had died.</p><br/><p>Lil’ Miss knew that Xuan Kong Temple would not relent after one yuanying and three disciples had died. If they were willing to accept this loss, they would not be Xuan Kong Temple. Dhyana sects were more united than other sects and even more resistant to outsiders. When they encountered foreign enemies, the power they could gather was astounding.</p><br/><p>When Lil’ Miss received Zuo Mo’s message, he prepared to do battle. According to what he knew, there had been a battalion that had already appeared in Cloud Sea Jie but for some reason, the battalion had suddenly disappeared.</p><br/><p>The other had arrived through transportation formations and the cost to do that was already astounding. The expenditure for a inter-jie transport was amazing, and the other clearly wasn’t crossing just one jie.</p><br/><p>Even though they had not found out what power that battalion belonged to, Lil’ Miss was sure that it was a battalion from Xuan Kong Temple!</p><br/><p>But the other suddenly disappeared and Xuan Kong Temple had not made any more moves against them. Lil’ Miss guessed that something important had happened so that Xuan Kong Temple did not have the attention to spare for them right now.</p><br/><p>But they would eventually come in the end. Xuan Kong Temple would definitely send a battalion to attack Cloud Sea Jie when they had the resources.</p><br/><p>To stop the other from suddenly appearing in Cloud Sea Jie again, Cloud Sea Jie was forbidden from creating private transportation formations. The present transportation formations were under guard but Lil’ miss knew that this method was not flawless. If the other did not care about cost, it was not hard to sneak into Cloud Sea Jie and set up a transportation formation.</p><br/><p>Did Xuan Kong Temple seem like an entity that cared about cost?</p><br/><p>There would definitely be a fight. Lil ‘Miss was not worried. He had started as an outsider and fought his way up to his position. He did not fear battle at all. However, no matter how confident he was, when he faced a titan like Xuan Kong Temple, he could not be at ease.</p><br/><p>Fortunately, they would be fighting on home territory.</p><br/><p>This was something that Lil’ Miss rejoiced about. In this period of time, he had already started to set up. The present Turtle Island wasn’t a small faction that just anyone could knead. They had the resources of one jie and Turtle Island, who wasn’t weak to start with, quickly transformed. All of Turtle Island was preparing for battle, frantically training and preparing.</p><br/><p>So what if it was Xuan Kong Temple?</p><br/><p>If they came, he wouldn’t let them go without shedding a layer of skin!</p><br/><p>A cold light flashed through Lil’ Miss’ eyes.</p><br/><p>However, there were other problems to be solved right now. Even though Shixiong had not said anything specific in the message he sent, the careful Lil’ Miss detected the unusualness—Shixiong most likely was in trouble!</p><br/><p>There was nothing in the message that said what he was doing now or when he was going to return. The message only said that they were fine now. Shixiong definitely was someone who would realize that Xuan Kong Temple would retaliate. If he was not returning at this time, then something definitely happened. It was either a matter held him up or that he could not return!</p><br/><p>Shixiong had transportation seals and he could also set up transportation formations. He had taken all the materials required so even if he was in a mo jie, he should rationally have returned long ago.</p><br/><p>This had only been Lil’ Miss’ guess, but the message Shixiong sent today completely proved Lil’ Miss’ speculation.</p><br/><p>Shixiong wanted him to research where Shattered Stone Jie was.</p><br/><p>As he had expected … …</p><br/><p>“Daren, Ye Ling and Shi Dong Daren have come,” The shield platoon guard outside the door reported.</p><br/><p>Lil’ Miss focused. “Invite them in.”</p><br/><p>Lil’ Miss was the most protected person on Turtle Island, and even Zuo Mo’s protective detail could not compare. Zuo Mo’s personal strength was strong and usually did not need protection, unless he was fighting.</p><br/><p>“Daren!”</p><br/><p>Ye Ling and Shi Dong bowed.</p><br/><p>They were puzzled at suddenly being called over.</p><br/><p>Translator Ramblings: Zuo Mo gets to have a taste of mo life while Gongsun Cha gets real work done.</p><br/>\n</div>"}