{"title": "Chapter Six Hundred and Three – Granny Meng Ghost WIne", "id": 553, "volume": 6, "url": "http://boxnovel.org/world-of-cultivation-chapter-six-hundred-and-three-%E2%80%93-granny-meng-ghost-wine", "volume_title": "Volume 6", "body": "<h1>Chapter Six Hundred and Three – Granny Meng Ghost WIne</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Six Hundred and Three – Granny Meng Ghost WIne</p><br/><p>Obtaining this match had taken no effort.</p><br/><p>This was the first thought that Shen Yu had. On the road here, he had listened to Princess Xia and the others continuously praise Xiao Mo Ge and had long placed him on the list of people he had to stomp down.</p><br/><p>He had not expected this drunkard to be Xiao Mo Ge!</p><br/><p>Were the heavens looking favorably upon him?</p><br/><p>Shen Yu felt as though his blood was boiling. Due to being too excited, his body actually shook slightly. Under the eyes of the public, in front of Princess Xia, the exhilaration of crushing a genius that could cause the Shifting Star Stand.</p><br/><p>Shen Yu’s smile was like a predator that had found its prey. He licked his lips, the light deep in his eyes filled with murderousness, bloodthirst, savagery and anticipation!</p><br/><p>It made him excited just thinking about it!</p><br/><p>“So you are Xiao Mo Ge, do you dare to go up and spar?”</p><br/><p>He forcibly suppressed the excitement and urge to fight inside. Like an experienced hunter, he tossed out his lure that had been prepared long before.</p><br/><p>———</p><br/><p>Zuo Mo’s mind was a blur. The drunkenness roiled in his chest like a ball of fire!</p><br/><p>This ball of fire seemed to want to combust in his body. He felt as though each muscle was burning, like firewood soaked in oil!</p><br/><p>There seemed to be several fireballs on his chest and back!</p><br/><p>So hot! So thirsty!</p><br/><p>Shen Yu’s figure seemed to be both near and far, clear one moment and blurry the next. Zuo Mo’s eyes were drunken and his mind unfocused.</p><br/><p>This wine … … really was strong … …</p><br/><p>“Shen Yu, you really do not have face. You are bullying Xiao Mo Ge while he is drunk! What? You want to play? This one will accompany you!” Lan Rong said coldly.</p><br/><p>Today, Xiao Mo Ge had humiliated Shen Yu. If the two fought, Xiao Mo Ge definitely would not end up well. As for himself, while it would be slightly embarrassing, but unless the Shen Family wanted to start a open feud with the Lan Family, Shen Yu would not dare to take his life.</p><br/><p>So at this time, Lan Rong unhesitatingly stood up.</p><br/><p>A strange smile floated on Shen Yu’s face. “Lan Rong, don’t think too highly of yourself. This is Xiao Mo Ge’s matter, when was it your turn to decide?” He then shouted, “Xiao Mo Ge, do you dare?”</p><br/><p>Shen Yu’s eyes were dark and cold. People who were drunk were the most impulsive and easiest to provoke. He did not believe that Xiao Mo Ge would be unaffected at this time!</p><br/><p>In a daze, Zuo Mo suddenly heard a “Little Mo Ge, do you dare?”</p><br/><p>A thread of clarity suddenly returned among the burning fire. So thirsty! So hot! He suddenly raised the wine jar in his hand and gulped down, uncaring of the wine that spilled down his neck.</p><br/><p>The cool feeling of the wine sliding across his skin caused him to feel a thread of pleasure!</p><br/><p>In one go, he drank the remaining wine. Then he glared at Shen Yu and smashed the wine jar onto the ground.</p><br/><p>———</p><br/><p>When Shen Yu saw Zuo Mo drink furiously out of the wine jar, he was overjoyed inside.</p><br/><p>When he saw Zuo Mo finish all the remaining wine in one go and stare hatefully at him, he wanted to laugh. He had seen drunkards before. Those that drank would all look like this! They would be clumsy in tongue and move roughly. Such a group of idiots!</p><br/><p>He had succeeded!</p><br/><p>As expected, he heard Zuo Mo smash the wine jar onto the ground. A shout rang through the entire hall!</p><br/><p>“What are we betting?”</p><br/><p>Shen Yu’s expression froze on his face. This … … was not the same … … as he had imagined.</p><br/><p>He reflexively asked, “What do you mean betting?”</p><br/><p>The surroundings became silent again. Their thinking was just like Shen Yu. They had all thought that Zuo Mo would say “Dare? I dare!” Who knew that Zuo Mo had skipped that and moved on to the gamble.</p><br/><p>Those with slow responses did not manage to react.</p><br/><p>“Country bumpkin!” Zuo Mo’s eyes were filled with disdain. His speech was slurred and drunken. He really looked down at Shen Yu now. No wonder he didn’t even have fifty mo bei. He used the last thread of kindness he had and advised Shen Yu, “Without any benefit, it is very stupid to fight!”</p><br/><p>Country bumpkin … …</p><br/><p>Tendons bulged in Shen Yu’s forehead. He had never been scorned like this by someone right to his face. He saw Lan Rong forcing back a smile out of the corner of his eye. The other was almost unable to hold it, and his expression was twisted strangely.</p><br/><p>He could imagine the expressions of the people behind him that were watching … …</p><br/><p>Princess Xia … …</p><br/><p>I will tolerate! Xiao Mo Ge already entered his trap. If he added some more pressure, Xiao Mo Ge would not be able to escape death today!</p><br/><p>“What do you want?”</p><br/><p>Shen Yu suppressed the anger inside and asked, stopping after each word.</p><br/><p>Zuo Mo could still see Princess Xia’s face. He remembered that he needed to find this woman for a matter. But what matter was it? He couldn’t remember. He hit his head. Fine, it was fine if he did not remember, but he did have something to ask her about. He pointed at Princess Xia and said, “I want her!”</p><br/><p>When the three words came out, the entire hall was so silent that the sound of a needle dropping to the ground could be heard.</p><br/><p>Everyone was shocked by these three words. Their mouths gaped and their faces were full of disbelief. Who dared to say in front of Princess Xia that he wanted her!</p><br/><p>Heavens! This was too impolite! Too impolite!</p><br/><p>The young masters that were in love with Princess Xia shifted. Someone swore, “You dare! You dare to be so impolite to Princess Xia, are you tired of living?”</p><br/><p>“Don’t lose your senses after drinking a few mouthfuls of wine!”</p><br/><p>Hearing the enraged words behind his back, Shen Yu had an increasingly smug expression. He spread his hands and acted apologetic.</p><br/><p>Zuo Mo finally realized. “So she isn’t your woman. No wonder … … you do not even have fifty mo bei to put down as a starting bet … … don’t bully me for being drunk … … you think that I am as stupid as you … … so stupid … …”</p><br/><p>Shen Yu felt his head swell up. He had not expected the development of the matter to progress outside conventional pathways. Also, the anger inside could not be suppressed after Zuo Mo kept on saying he was “so stupid.”</p><br/><p>An amused look flashed through Princess Xia’s eyes. She suddenly spoke, “If you win, I will promise to accompany you for one day.”</p><br/><p>When the words came out, the people descended into noise.</p><br/><p>Shen Yu was overjoyed. It seemed that Princess Xia felt something for him. Otherwise, she would not be lending a helping hand twice in succession. He decided inside, he would not fail Princess Xia’s good intentions!</p><br/><p>Zuo Mo could not remember what matter he had to find Princess Xia about. He just felt that his body was intensely burning!</p><br/><p>His eyes were red and seemed to be glimmering with blood.</p><br/><p>Shen Yu wanted to crush Zuo Mo into powder immediately. He asked in a murderous voice, “Are you satisfied now?”</p><br/><p>Zuo Mo felt as though his entire body was filled with flames and a strong viciousness filled his body.</p><br/><p>“Come!”</p><br/><p>His voice seemed to come through the thick fire and carried an indescribable restlessness.</p><br/><p>Shen Yu did not waste words. “To the challenge area!”</p><br/><p>As this was the residence of the Great Peace City Master, there naturally was a stadium. Though it was not as large as the stadium outside the palace, the jinzhi placed on it were not lacking.</p><br/><p>One was the genius Shen Yu who had been famous for many years and was considered the Shen Family’s most outstanding genius in the last two hundred years.</p><br/><p>The other was Xiao Mo Ge who had come out of nowhere, caused the Shifting Star Sands, and placed on the Great Peace Mo Ranking.</p><br/><p>Adding on Princess Xia’s tempting prize, this fight attracted the attention of everyone at the party.</p><br/><p>“Should we stop them?” a servant asked.</p><br/><p>Shi Yue Yi smiled and waved his hand. “No need, just watch, it is rare to have such a heated atmosphere.”</p><br/><p>Because Shi Yue Yi never cultivated a mo spell, his face already seemed old. His hair was grey and white and it hung down naturally. The wrinkles on his face were faint but clear. He smiled from beginning to end as though everything was under his control. What was most attractive about him was his eyes that flashed with an intelligent and wise light. It would cause people to unconsciously submit.</p><br/><p>Suddenly, a black robed male, and a dark shadow appeared next to Shi Yue Yi. They sat down without any courtesy and then started to eat and drink. The one in the black robe was Yu Shuang and the dark shadow was Chang Yuan Hao.</p><br/><p>“Who does City Master favor?” the black robed male asked Shi Yue Yi.</p><br/><p>Shi Yue Yi asked softly, “What about you?”</p><br/><p>Yu Shuang thought and then responded, “Shen Yu, the Peacock King mo bloodline of the Shen Family has its unique aspects. Shen Yu has also been in general level for a long time and has the Peacock King mo physique. After so many years, he should have progressed.”</p><br/><p>Shi Yue Yi turned to look at Chang Yuan Hao in the shadow. Chang Yuan Hao said, “Xiao Mo Ge!”</p><br/><p>“Hm!” Yu Shuang was slightly shocked. “You actually favour Xiao Mo Ge? Why?”</p><br/><p>“Intuition.” Chang Yuan Hao did not stop. The food on the table disappeared at a visible rate into the dark shadow.</p><br/><p>“You are not a woman,” Yu Shuang said, unconvinced. However, he thought inside, this good friend of his did not speak much but he was usually right.</p><br/><p>Shi Yue Yi smiled slightly and said, “Let’s watch, I feel great anticipation about the power of the Granny Meng Ghost Wine.”</p><br/><p>Granny Meng Ghost Wine … …</p><br/><p>Yu Shuang and the dark shadow paused simultaneously.</p><br/><p>Yu Shuang asked in a stammer, “How much has he drank?”</p><br/><p>Shi Yue Yi had his usual smile. “Sixteen jars.”</p><br/><p>Yu Shuang gaped, his expression frozen on his face as though he had seen a ghost.</p><br/><p>In the corner, Lan Tian Long who had drunk three jars of Granny Meng Ghost Wine was completely drunk.</p><br/><p>Zuo Mo felt his entire body was burning and he was inside a ball of fire. Even the things he saw seemed to twist in the waves of heat.</p><br/><p>It really was strong … …</p><br/><p>That country bumpkin … …</p><br/><p>Zuo Mo looked with drunken eyes at Shen Yu. His body was filled with hot fire that was on the verge of overflowing.</p><br/><p>Within this terrifying fire, Zuo Mo felt a thread of mad exhilaration.</p><br/><p>There seemed to be something that was being dissolved by the flames and flowed out of the fire. This thing flowed into his head. However, his consciousness was almost completely clouded now. He wanted to examine and see what those things were but he could not seem to find the energy.</p><br/><p>The murderousness on Shen Yu’s face was undisguised now. When they were on the battlefield, the power of life and death would be on his hands.</p><br/><p>He didn’t just have to win, he had to win beautifully!</p><br/><p>Only so, would he leave a deeper impression on Princess Xia.</p><br/><p>He slowly walked towards Zuo Mo, step by step, unhurried, and composed. The five colored mo matrix on his body was like feathers that appeared and grew. When the crown of the peacock appeared on his forehead, his eyes were completely icy.</p><br/><p>Zuo Mo suddenly raised his head. His blood-filled eyes were like that of a wild beast that flashed with a bloodthirsty light.</p><br/><p>He raised his right hand.</p><br/><p>Translator Ramblings: So Zuo Mo’s not actually a lightweight … … bargaining skills. Fifty mobei and a promise.</p><br/>\n</div>"}