{"title": "Chapter Six Hundred and Seven – “Special”", "id": 557, "volume": 6, "url": "http://boxnovel.org/world-of-cultivation-chapter-six-hundred-and-seven-%E2%80%93-special", "volume_title": "Volume 6", "body": "<h1>Chapter Six Hundred and Seven – “Special”</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Six Hundred and Seven – “Special”</p><br/><p>“Congratulations, congratulations! Little Brother Xiao Mo Ge has stepped onto a new level with this battle, it really is an occasion to celebrate.”</p><br/><p>The one that spoke was an old man that Zuo Mo did not recognize. Zuo Mo started to act humble when he heard Lan Rong bow and say, “Lan Rong greets City Master!”</p><br/><p>City Master! Shi Yue Yi?</p><br/><p>The average-looking old man in Zuo Mo’s eyes instantly appeared to be more scholarly and deep. As expected, reputation made the person. Zuo Mo felt great admiration towards people that were knowledgeable. This time, he was sincerely humble. “City Master is too generous!”</p><br/><p>Shi Yue Yi smiled slightly, the faint wrinkles on his face clear to the eye. He looked at Lan Rong, and said warmly, “You are a child of the Lan Family, right? Not bad, you have some sense of honor.”</p><br/><p>He turned his face to look at Zuo Mo, introducing, “Let me introduce these two to Little Brother.”</p><br/><p>“Chang Yuan Hao.” A deep voice came from the shadows.</p><br/><p>“This one is Yu Shuang.” There was a slight smile on Yu Shuang’s face. He bowed slightly and was warm and elegant.</p><br/><p>Without needing Lan Rong’s introduction, he knew who these two were, first and second ranked on the Great Peace Mo Ranking! Even though Xiao Mo Ge was full of confidence in himself, he was still shocked that these two personages had come. He returned a bow. “I am Xiao Mo Ge! Please take care of me!”</p><br/><p>At the side, Lan Rong was so excited he wasn’t able to speak. He had attended the banquet of the City Master many times but it was the first time he met these three major personages. He felt as though he was dreaming to have been complimented by the City Master.</p><br/><p>Shi Yue Yi smiled slightly at Lan Rong. “I’m sorry, we have come to find Little Brother Xiao to discuss some matters, please accept my apologies!”</p><br/><p>Lan Rong seemed to wake up and immediately recovered. He said perceptively, “This junior needs to go search for my Brother! Goodbye, City Master, goodbye, Elders!”</p><br/><p>He bowed respectfully and then retreated.</p><br/><p>Matters to discuss? Zuo Mo was puzzled. It was the first time he met these three. What was there to discuss?</p><br/><p>Shi Yue Yi did not clarify and motioned with a hand. “Little Brother, let us go over there.”</p><br/><p>“Alright!”</p><br/><p>The four of them entered a quiet room. When they entered the room, the noise from the outside instantly disappeared. Zuo Mo noticed that there were jinzhi set up in the room that could prevent eavesdroppers.</p><br/><p>“I had not expected Little Brother to cultivate the Reversed Stellar Revolution.” The one who spoke first was Shi Yue Yi. With those initial words, he attracted Zuo Mo’s attention.</p><br/><p>“Reversed Stellar Revolution? This?” Zuo Mo raised his right wrist and the crimson bracelet that slowly spun around.</p><br/><p>“Yes.” Shi Yue Yi glanced at Zuo Mo. “It appears that Little Brother does not know much about it.”</p><br/><p>“Yes, I do not understand, City Master, please give me guidance,” Zuo Mo said obediently.</p><br/><p>Shi Yue Yi smiled slightly. “Reversed Stellar Revolution is a kind of killing move. However, killing moves of this kind are usually only obtained after those with star-type mo physiques comprehend Domain.”</p><br/><p>“Star type mo physiques?” Zuo Mo shook his head. “I cultivate the Ten Crow Celestial Apparatus.”</p><br/><p>Shi Yue Yi nodded and said, “This is where Little Brother is special. It is true that Little Brother cultivates the Ten Crow Celestial Apparatus that is ranked third among general rank physiques, and I also noticed that while the [Domain] that Little Brother has comprehended has not fully taken form, it is already crimson red. If I am right, Little Brother has already reached the doorway to the [Ten Crow Celestial Domain.]”</p><br/><p>“I’ve reached the doorway to Domain?” This time, it was Zuo Mo’s turn to be shocked. His mind shifted and the suns suddenly gave off a strange power. A crimson ring of light appeared under his feet.</p><br/><p>“As expected, it is the Ten Crow Celestial Domain!” Yu Shaung couldn’t help but speak. “As expected of the top ranked Domain among the general ranks. Even though it has not taken form, it is so strong and domineering.”</p><br/><p>His voice was filled with admiration.</p><br/><p>Zuo Mo felt increasingly puzzled. However, he knew that the other would explain the cause since the other had come to find him.</p><br/><p>As he expected, Shi Yue Yi continued. “It is the first time that I saw a situation like Little Brother’s. Little Brother, you clearly cultivate the Ten Crow Celestial Apparatus mo physique, and the Domain you comprehend is the Ten Crow Celestial Domain, how could you cultivate the Reversed Stellar Revolution?”</p><br/><p>“Star type mo physique? What is the mo physique you cultivated previously?” Yu Shuang couldn’t help but ask.</p><br/><p>“Great Day mo physique,” Zuo Mo said.</p><br/><p>“Second among colonel level mo physiques!” Yu Shuang couldn’t help himself. “A strong mo physique as well. And before that?”</p><br/><p>“Jade Metal Head.”</p><br/><p>This time, even Shi Yue Yi was slightly surprised. Yu Shuang looked at Zuo Mo as though he was looking at a freak. “Ranking fifth among captain level, are you from an ancient family?”</p><br/><p>“I don’t know.” Zuo Mo gave an embarrassed grimace. “I know nothing about my birth.”</p><br/><p>Shi Yue Yi and Yu Shuang both showed slight surprise but they quickly recovered.</p><br/><p>“There is also another possible cause.” Chang Yuan Hao suddenly spoke from within the shadows.</p><br/><p>The three turned their gazes onto him.</p><br/><p>“If one cultivates yao arts to a certain level, they can also cultivate the Reversed Stellar Revolution.” Chang Yuan Hao’s words were a surprise to hear.</p><br/><p>Yu Shuang stilled and then slapped his forehead with his palm. “How could I forget that? Stars and yao, star power is one of the powers that yao favor the most. There is probably more yao than mo that have the Reversed Stellar Revolution. Oh, I remember, you seem to know yao arts.”</p><br/><p>“A bit,” Zuo Mo said as he nodded his head. When he had fought against Miao Jun, he had used little yao arts so he openly admitted it.</p><br/><p>The gazes of the trio turned strange when they looked at him.</p><br/><p>“It seems that this is the cause.” Shi Yue Yi nodded and said, “There have been those in the past that cultivate mo and yao together, but I haven’t ever heard of anyone that cultivates Reversed Stellar Revolution and the Ten Crow Celestial Apparatus together. As expected of what my master said, people that can drink more than ten jars of Granny Meng Ghost Wine are all special people.”</p><br/><p>“What is your yao art Domain?” Yu Shuang asked curiously.</p><br/><p>“Yao art Domain? I do not have one.” Zuo Mo shook his head.</p><br/><p>“You did not cultivate a yao art Domain, but you comprehended the killing move. This … … this is too … …” Yu Shuang didn’t know what to say.</p><br/><p>Shi Yue Yi saw his deeply impacted state and comforted. “If your [Thousand Coil Threads] is complete, you can definitely break through to marshal level.”</p><br/><p>Yu Shuang rolled his eyes and said in a negative tone. “[Ten Crow Celestial Domain] is my bane.”</p><br/><p>“[Ten Crow Celestial Domain] is everyone’s bane.” Shi Yue Yi comforted skillfully. “Look at Yuan Hao, he is even worse off than you are. He is completely subdued by it in every way.”</p><br/><p>The shadow stilled when he heard this.</p><br/><p>Yu Shuang’s expression turned from depressed to sunny. He clapped and said with a smile, “Haha! Yes, in any case, anyone else that comes to fight will be worse off.”</p><br/><p>Zuo Mo listened to Shu Yue Yi and Yu Shuang’s conversation. His heart jumped wildly. He was worried the other would decide to kill the threat in its infancy. Then it would be over for him. The two old mo were not people that Shen Yu could compare to. Added that, even now, Zuo Mo did not understand how he had defeated Shen Yu.</p><br/><p>Shi Yue Yi saw Zuo Mo’s uneasiness and couldn’t help but laugh. “I can see that Little Brother doesn’t have such intentions. You should reinforce this perception after just having a breakthrough. Little Brother, at your leisure, let us gather in a few days.”</p><br/><p>Hearing this, Zuo Mo immediately fled as though he was being pardoned.</p><br/><p>After Zuo Mo’s figure left, the room became quiet again.</p><br/><p>“His birth is not simple.” The one that spoke first was actually Chang Yuan Hao.</p><br/><p>“He’s not bad.” Yu Shuang said with a smile, “Not a bad boy, I hope that Princess Xia won’t tempt him away.”</p><br/><p>Shi Yue Yi shook his head and said, “Little Xia will probably fail this time.”</p><br/><p>“Why? Such a young boy, it wouldn’t be simple for him to resist the power of Princess Xia.” Yu Shuang looked gossipy.</p><br/><p>“How long has it been since Ten Crow Celestial Apparatus appeared last?” Shi Yue Yi suddenly asked.</p><br/><p>“Very long ago.” Yu Shuang wasn’t sure. Thinking about what Zuo Mo had said just now, he couldn’t help but gape. “Jade Metal Head, Great Day, Ten Crow Celestial Apparatus, this is the best evolution path! If this was made public, how many would be jealous! Even I am jealous hearing that. It is infuriating to compare myself to him!”</p><br/><p>Shi Yue Yi automatically ignored Yu Shuang’s mutterings. He had a thoughtful expression.</p><br/><p>“Is something wrong?” Chang Yuan Hao suddenly spoke.</p><br/><p>Shi Yue Yi slowly said, “I am thinking about that specialness that my master talked about. I wonder if the specialness refers to this.”</p><br/><p>“Of course it refers to this!” Yu Shuang’s tone was certain. “If this isn’t what’s special, then there isn’t anything else that is special. This boy is definitely a freak among the freaks, the greatest freak of them all!”</p><br/><p>Shi Yue Yi said gravely, “I have always persisted in making the Granny Meng Ghost Wine because of the words that my master said. In my memories, my master rarely used the word ‘special’ to refer to anyone. Every word that my master said was carefully selected and had its own profound meaning. In these years, I have always pondered what the ‘specialness’ that my master spoke of referred to.”</p><br/><p>Shi Yue Yi caused Yu Shuang to quiet down. For everyone in Great Peace City, Shi Zi Ming was like an all-powerful god.</p><br/><p>“Since the time has not arrived, let us first observe,” Yu Shuang said.</p><br/><p>Shi Yue Yi nodded and the three sank into silence.</p><br/><p>———</p><br/><p>“Pu, is this really the Reversed Stellar Revolution?” On the road back to the compound, Zuo Mo couldn’t resist asking.</p><br/><p>“It really is the Reversed Stellar Revolution.” Pu Yao’s expression was slightly grave. “However, your Reversed Stellar Revolution is not the same as the normal Reversed Stellar Revolution, you have sun shen power inside it.”</p><br/><p>He then warned, “You should spend some time now on practicing your yao arts. Without a yao art Domain, you will not be able to express much of the power of the Reversed Stellar Revolution.”</p><br/><p>Wei slowly spoke, “A Zuo, you have just reached the doorway to the Ten Crow Celestial Domain, you cannot let it lie. This is the first ranked Domain of the general level, it is not something that Reversed Stellar Revolution can compare to.”</p><br/><p>Hearing this, Pu Yao smirked coldly and said, “You are ignorant! You really think that the Ten Crow Celestial Domain is invincible? The Reversed Stellar Revolution is full of variations and this one contains shen power. The Ten Crow Celestial Domain might not be a match.”</p><br/><p>Wei was not angry and said with a smile, “It cannot be called invincible, but it is not me that gave it the title of the top Domain in general level.”</p><br/><p>Zuo Mo looked at the duo that was arguing and said helplessly, “Don’t you two find it very strange? I practice the Ten Crow Celestial Apparatus, but what developed was the Reversed Stellar Revolution?”</p><br/><p>“Is it strange?” Pu Yao asked in response.</p><br/><p>“It’s alright.” Wei’s expression was matter of fact.</p><br/><p>Zuo Mo was speechless.</p><br/><p>Translator Ramblings: No no no, must keep façade of cool elder spirit up. Also, it was Wei that caused the Stars in Daytime. He set it off to “heal” himself.</p><br/>\n</div>"}