{"title": "Chapter Six Hundred and Eleven – Ambush", "id": 561, "volume": 6, "url": "http://boxnovel.org/world-of-cultivation-chapter-six-hundred-and-eleven-%E2%80%93-ambush", "volume_title": "Volume 6", "body": "<h1>Chapter Six Hundred and Eleven – Ambush</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Six Hundred and Eleven – Ambush</p><br/><p>Who was Nanmen Xue?</p><br/><p>Of course, Zuo Mo knew, the person ranked third on the Great Peace Mo Rankings. After the battle with Shen Yu, Zuo Mo’s ranking had shot up. And in a flash, he went from the bottom of the ranking to the seventh rank.</p><br/><p>But why would the other challenge him?</p><br/><p>This shouldn’t be happening!</p><br/><p>If the third ranked challenged the seventh ranked, the victory would not be fair and there were no benefits to winning.</p><br/><p>Zuo Mo found it bewildering. He walked into the yard and raised his head to see Nanmen Xue with his black robes flapping in the wind.</p><br/><p>“You are not going to accept the challenge?” Princess Xia suddenly crowded over. The beautiful face was mischievous.</p><br/><p>“This person’s mind is faulty.” Zuo Mo stared at Nanmen Xue in the air as he muttered, “I did not offend him … … so strange!” He thought and then shook his head, “I won’t accept.”</p><br/><p>“Why do you not accept?” A hint of confusion flashed through Princess Xia’s eyes. “If you do not accept, your reputation will drop. People in Great Peace City that do not accept challenges will be laughed at.”</p><br/><p>“I can’t win.” Zuo Mo threw up his hands with a helpless expression.</p><br/><p>Princess Xia was stunned. It was the first time she had met someone who would admit their weakness in front of her. The other men would try to show off their strength in front of her, show off their wealth, show off all kinds of qualities, each of them like peacocks with their tail feathers spread out.</p><br/><p>There was someone who actually admitted in front of her that he could not win … …</p><br/><p>“Then … …” After a long while, Princess Xia did not know what to say.</p><br/><p>“Let him cool himself up there, the wind is pretty strong.” Zuo Mo shook his head and moved his gaze away. He prepared to take Xiao Guo and Li Ying Feng to leave.</p><br/><p>Princess Xia couldn’t help but laugh at these words. The person in front of her didn’t have any of his previous seriousness and was like a little hoodlum. Princess Xia’s eyes moved as she said, “What if he were to pursue you outside the city?”</p><br/><p>Zuo Mo turned around and said with a serious expression, “Actually, I never told you before, but what I am most skilled at is fighting using many against few.”</p><br/><p>“Fighting with many against few… …” After repeating it once, Princess Xia finally reacted. Her body trembled as she laughed. Pointing at Zuo Mo’s nose, she said, “You are a rascal!”</p><br/><p>Zuo Mo’s eyes accidentally saw the motions at Princess Xia’s bosom. It was like he was struck with lightning and he froze immediately where he stood.</p><br/><p>Illusory spell … … it came again … … was this kind of illusory spell something that was automatically cast?</p><br/><p>Princess Xia was a perceptive person and immediately noticed Zuo Mo’s state. She was not bashful, and she blinked her eyes at Zuo Mo as she covered her mouth and laughed lightly.</p><br/><p>“Hem!” Zuo Mo awkwardly coughed and then said, “Is there a back door? One that I can sneak out of.”</p><br/><p>Seeing Zuo Mo act like this, Princess Xia felt like laughing. She summoned a servant and said a few words before she said to Zuo Mo, “You can follow her.”</p><br/><p>“Thank you!” Zuo Mo’s words were sincere. He bowed to Princess Xia. Princess Xia was completely different compared to what Pu Yao and Wei had spoken of. He didn’t not know how Princess Xia appeared in other people’s eyes, but in his eyes, she was a good person. Waving a hand at Princess Xia, he took Xiao Guo and Li Ying Feng as he moved away with the servant.</p><br/><p>Watching Zuo Mo’s figure disappear, a hint of dispiritedness flashed through Princess Xia’s eyes. But it faded in a blink. The smile on her face faded, and her gaze became sharp again. Confidence and ease came back onto her face.</p><br/><p>She suddenly glanced at Nanmen Xue in the air and said faintly, “Force him down, it is an eyesore to look at.”</p><br/><p>The middle aged female attendant was about to act when her expression changed. “Someone has come.”</p><br/><p>As she finished speaking, a strange demonic sound seemed to burrow out of the deep of the earth. A man dressed in snowy white robes appeared near Nanmen Xue. The crowd that was watching, shifted.</p><br/><p>Qi Diao Yu.</p><br/><p>Nanmen Xue’s gaze slowly became cold. “Qi Diao Yu!”</p><br/><p>“I have come to challenge you.” Qi Diao Yu’s indifferent voice immediately caused a furor.</p><br/><p>The sudden appearance of Qi Diao Yu at this time attracted speculations from many people—was he helping out Xiao Mo Ge?</p><br/><p>With an icy expression, Nanmen Xue suddenly smiled, “As I expected … …”</p><br/><p>Even though the other did not say what was expected, Qi Diao Yu’s expression suddenly changed. Not good, he had fallen for a trap! His body suddenly flashed.</p><br/><p>Almost at the same time, Nanmen Xue appeared in front and blocked his path.</p><br/><p>Nanmen Xue smiled, showing his teeth. “Since Brother Qi wants to challenge me, then let’s have a good fight.”</p><br/><p>The two top experts were at a standoff and the fight could be set off by anything!</p><br/><p>———</p><br/><p>Zuo Mo snuck out the back door after following the servant. In order to disguise himself, Zuo Mo put on a little illusory art on his face. He felt grateful to Qi Diao Yu who had appeared. This was a good person!</p><br/><p>Just after coming out of the door, he heard Xiao Guo who was under his arm say in a trembling voice, “Shixiong, is it you?”</p><br/><p>Zuo Mo stopped walking and lightly rubbed Xiao Guo’s head with his hand. “Xiao Guo is really smart.”</p><br/><p>Xiao Guo couldn’t hold it back any longer and started to cry as she hugged Zuo Mo. Like a child, she hugged Zuo Mo tightly, tears and snot flowing down.</p><br/><p>Zuo Mo sighed inside as he lightly patted Xiao Guo. Li Ying Feng also reacted at this time, and there was a disbelieving joy on her face. “Zuo Shixiong, are you really Zuo Shixiong?”</p><br/><p>Zuo Mo said with a smile, “Li Shijie, I’m still used to you calling me Zuo Shidi.”</p><br/><p>Li Ying Feng also could not hold it back and cried from joy.</p><br/><p>Zuo Mo did not know how to comfort them and could only pat the two of them lightly.</p><br/><p>There were not many people on the streets, as all of them were focused on the faceoff between Qi Diao Yu and Nanmen Xue in the air.</p><br/><p>Zuo Mo abruptly stopped walking and said lightly, “An enemy is present.” He warily scanned the surroundings as he slowly put Xiao Guo and Li Ying Feng down. Hearing this, the two immediately stopped crying.</p><br/><p>The scenery around him suddenly twisted. The trees on the road seemed to be kneaded into a ball by an invisible hand.</p><br/><p>In a flash, the surroundings around the three of them were completely transformed.</p><br/><p>Xiao Guo and Li Ying Feng had ashen faces. However, they did not make a sound in fear they would disturb Zuo Mo.</p><br/><p>Domain!</p><br/><p>Zuo Mo’s gaze suddenly became icy. This was an ambush that had been planned. By the time he had detected that something was wrong, he had already fallen for the enemy’s trap.</p><br/><p>They had actually sent an expert that comprehended Domain to ambush him!</p><br/><p>A golem of mud slowly rose from the ground. His body was covered in wet mud and only the general shape of a person could be seen.</p><br/><p>“Who are you?” Zuo Mo thought of Nanmen Xue who had just challenged him. He felt there was a connection between the two of them. He suddenly said, “So Nanmen Xue has given his allegiance to you people.”</p><br/><p>“You are actually smart.” The other reflexively responded, but he immediately realized that he had fallen for a trap. He smiled darkly. “Your realization has come too late. If you want someone to blame, blame Qi Diao Yu for being too dumb.”</p><br/><p>“Qi Diao Yu?” Shock flashed through Zuo Mo’s mind. How was this matter related to Qi Diao Yu? However, no matter how hard he thought, he could not think what connection he had to Qi Diao Yu.</p><br/><p>“Haha, it is useless no matter how much you think about it, submit peacefully.” The mud golem smiled darkly.</p><br/><p>Zuo Mo suddenly felt his feet become heavy and his body sank down slowly. At some unknown time, the hard ground under his feet became soft mud like that of a bog.</p><br/><p>There was a strong attraction force that came from within the bog that pulled the bodies of the three of them downwards.</p><br/><p>This was strange!</p><br/><p>The strange presence of corrosiveness were in wisps that burrowed into Zuo Mo’s body like insects. Xiao Guo and Li Ying Feng’s expressions were ashen. Their cultivation was too low and they were fragile in front of a Domain.</p><br/><p>Zuo Mo plucked the two of them from the bog and put them on his back. With his strength, the mass of the two women was negligible.</p><br/><p>But when he did this, his body suddenly sank further.</p><br/><p>The bog reached past his calves. The dark and cold presences were like a group of strange and mad insects that continuously burrowed into his body. But the Sun Crystal Seed in Zuo Mo’s body would not tolerate its territory being invaded. It immediately sent out a few streams of fire that swept out, clearing out the dark and cold energies.</p><br/><p>He had the Sun Crystal Seed and he cultivated the Ten Crow Celestial Apparatus. While he could not be invaded by anything evil no matter how Zuo Mo struggled, he could not break free of the force that was pulling him down. Watching as he continued to sink, Zuo Mo could not care for anything else and activated his still incomplete Ten Crow Celestial Domain.</p><br/><p>A dash of red light spread from Zuo Mo’s feet. Zuo Mo felt his feet lighten and his body rose up slightly.</p><br/><p>“Oh, I had assumed that you would use the Reversed Stellar Revolution first, not your incomplete Ten Crow Celestial Domain.” The mud golem smiled darkly. “The Ten Crow Celestial Domain is powerful, but that is only after you achieve it. It is naïve to think you can stop me with what it is now.”</p><br/><p>The bog suddenly spread from under Zuo Mo’s feet. In a blink, what Zuo Mo could see was just a bog as vast as the ocean.</p><br/><p>The strong force pulling his feet had multiplied. It was like there was a monster hiding under the bog that was pulling him down. The power was so strong that Zuo Mo almost couldn’t raise his arm. In a blink, the mud reached his knees.</p><br/><p>Damn it!</p><br/><p>Zuo Mo had not expected that he wouldn’t have any power to fight back!</p><br/><p>His gaze landed on the Reversed Stellar Revolution. His mind shifted and the handful of sparks shot at the mud golem.</p><br/><p>The mud golem laughed and suddenly entered the bog. His body disappeared and the sparks missed.</p><br/><p>“Slightly interesting.” The voice came from behind Zuo Mo. The mud golem appeared behind Zuo Mo like a ghost. His tone carried a hint of smugness. “I heard that it was your Reversed Stellar Revolution that defeated the Peacock King Plume? It seems that the Peacock King Plume isn’t anything special after all. So disappointing.”</p><br/><p>Zuo Mo was silent. The handful of sparks turned into a stream of light and shot behind him.</p><br/><p>Almost at the same time, a mud golem suddenly rose from the bog in front of him.</p><br/><p>“Is this the extent of your abilities?” The mud golem was slightly disappointed. “If this is all you can do, then your life will end here today.”</p><br/><p>As he finished speaking, one mud golem after another slowly rose up from the bog.</p><br/><p>In a flash, there were an endless amount of mud golems.</p><br/><p>Translator Ramblings: Fight, no, run.</p><br/>\n</div>"}