{"title": "Chapter Six Hundred and Thirty Nine – Divine Moon", "id": 589, "volume": 6, "url": "http://boxnovel.org/world-of-cultivation-chapter-six-hundred-and-thirty-nine-%E2%80%93-divine-moon", "volume_title": "Volume 6", "body": "<h1>Chapter Six Hundred and Thirty Nine – Divine Moon</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Six Hundred and Thirty Nine – Divine Moon</p><br/><p>Moonlight flashed through those bewitching eyes.</p><br/><p>Pia!</p><br/><p>The bubbles around the two exploded in unison.</p><br/><p>Gusts of sharp air rushed out and covered the two.</p><br/><p>Yet such powerful gusts were unable to harm the two at all. There seemed to be an invisible barrier two zhang around Mister Tong which stopped the gust. While Ceng Lian’er seemed to be intangible. The gusts easily passed through her. Her figure was like a reflection in the water. It wavered, became blurry and seemed almost unreal.</p><br/><p>Mister Tong’s gaze focused.</p><br/><p>His hand grabbed at Ceng Lian’er</p><br/><p>A black palmprint left his hand and turned into a black ball of mist that headed towards Ceng Lian’er. There seemed to be countless monsters howling from within the black mist. The roars filled the air and everyone who heard it felt their hairs stand up.</p><br/><p>Ceng Lian’ers gaze was bewitching. Her lips parted slightly and she breathed.</p><br/><p>“Moon!”</p><br/><p>Her long sleeve moved lightly like silk in water.</p><br/><p>The air around her suddenly became dark. A crescent moon floated behind her. This crescent moon was slightly taller than her, and gave off a cool light.</p><br/><p>Ceng Lian’er was extremely excited. The divine moon had finally appeared!</p><br/><p>The moon shen power succession technique she had inherited was relatively complete but some of the crucial parts had been lost. The heir of each generation had tried to do all they could to perfect the cultivation method but the restoration effects were minute. Even their own cultivation had progressed at a difficult rate.</p><br/><p>Divine Moon, the crux of the later stages of cultivation, had been lost long before.</p><br/><p>Now it was restored on Ceng Lian’ers hands.</p><br/><p>Ceng Lian’er’s talent was outstanding and she had worked hard on her cultivation from a young age. In this period of time, her frequent battles, especially the one with Lin Qian, had benefited her greatly.</p><br/><p>The powerful Mister Tong pressured her greatly and was also the cause of her epiphany of the Divine Moon.</p><br/><p>“Divine Moon!” A cool voice came from behind the silk curtains. Marshal Yu said, “So Ceng Lian’er cultivates shen power, it was this seat that made a wrong guess.”</p><br/><p>The commanders around the chariot shook with astonishment on their faces.</p><br/><p>Shen power!</p><br/><p>So this was shen power!</p><br/><p>The crescent moon in the sky seemed to have passed through time from the ancient era!</p><br/><p>“Lord!” some of the commanders called.</p><br/><p>“Do not let her escape,” Marshal Yu quietly commanded.</p><br/><p>The middle-aged attendant next to Princess Xia had an unfocused gaze as she murmured to herself, “Divine Moon! So this is what shen power truly is like!”</p><br/><p>She had been searching hard for decades and schemed to just reach the edge. Previously, she had detected that Ceng Lian’er cultivated shen power, but when she saw the crescent moon in the sky, her mouth felt bitter.</p><br/><p>The Divine Moon’s appearance meant that Ceng Lian’er’s shen power was finally on the right path!</p><br/><p>A look flashed through Princess Xia’s eyes and she reflexively looked towards Xiao Mo Ge.</p><br/><p>Her eyes flickered. She noticed that Zuo Mo’s body imperceptibly shook and his expression change slightly.</p><br/><p>Noticing Princess Xia’s gaze, Zuo Mo turned around. The two’s gazes met.</p><br/><p>Princess Xia found a flash of joy in Zuo Mo’s eyes.</p><br/><p>———</p><br/><p>Bie Han was not interested in the fight ongoing in the sky. For battle generals like him who focused on battle command, struggles through individual power were not interesting. His Sin Battalion was almost all equal in power, and there were no strong experts. Almost all his energy was spent on how to squeeze the most power out of Sin Battalion.</p><br/><p>Over a long period of time, this also became a habit, or rather, his combat style.</p><br/><p>Regardless of the intensity of the battle in the air, it could not attract his gaze. He constantly swept the Yu Frontier Guards warily like a cunning wolf looking for an opening to attack.</p><br/><p>He was not frightened by the Yu Frontier Guards.</p><br/><p>Even though his days in the past had been the same as being in prison, Xuan Kong Temple was one of the four great sects. Even the opponents the sect sent against him were on par with Jiang Zhe. Growing up in an environment like this, Bie Han could not fear a battalion he had not even heard of, even if the other’s leader was at marshal level.</p><br/><p>After decades of being icy and stoic, his heart was as hard as stone.</p><br/><p>The other people were intimidated by Marshal Yu’s reputation and didn’t dare to move. However, Bie Han constantly looked at this enormous battalion in search of a weakness he could use to break through.</p><br/><p>His spirit had not calmed down from his battle with the Ming Bandits. He was like a lion that had been caged for too long. He had charged out of the cage and was yearning to find any fight!</p><br/><p>Light flashed in his narrowed eyes.</p><br/><p>When he saw a small troop of the Yu Frontier Guards move towards the flank when people were not paying attention, his eyes turned cold.</p><br/><p>After a moment of thought, he understood what the other intended—the other was surrounding Ceng Lian’er and preventing her from running away.</p><br/><p>Even though this guess was slightly ridiculous because from every angle, it seemed impossible that Ceng Lian’er could escape, Bie Han did not hesitate. His harrowed eyes slowly swept across where the troop was situated and he believed even more in his own judgement.</p><br/><p>The movement of this little troupe did not attract anyone’s attention. Among the dense ranks, it was hard to detect a change in position. Even if the Yu Frontier Guard battle generals noticed this shift in position, they would soon look elsewhere. In such a large army, the change in position of a thousand people was not something of particular note.</p><br/><p>Bie Han’s eyes narrowed even more. The killing energy and light in his eyes was almost hidden by his eyelids.</p><br/><p>This seemed like a change in position of no value, but Bie Han paid attention.</p><br/><p>He quickly calculated the changes that would occur as a result of this little change in position.</p><br/><p>Xiuzhe battle generals were the most skilled at divination. As one of the best, Bie Han’s divination skill could be called terrifying. In his mind, the motionless Yu Frontier Guards were shifting around.</p><br/><p>The movement of the little troop would cause the middle of the army to thin by ten present.</p><br/><p>Noticing the experts near the chariot that were nervously staring at the two fighting in the air, Bie Han seemed to smell prey.</p><br/><p>He became slightly excited, but his gaze became even deeper and his attention even more focused.</p><br/><p>He had a strong feeling</p><br/><p>–the opportunity was slowly coming towards him!</p><br/><p>———</p><br/><p>The fight in the air reached a climax.</p><br/><p>Mister Tong’s black mist that seemed to be made of numerous monsters howling dissipated quickly under the light of Ceng Lian’er’s moon like the heat from boiling water after being poured onto ice.</p><br/><p>Mister Tong’s expression suddenly changed!</p><br/><p>A drop of blood suddenly came out between his brows and flew into his hand.</p><br/><p>Even though it was only one drop of blood, his palm looked as though it was covered in blood. This bloodied palm was raised up, and Mister Tong’s expression became grave.</p><br/><p>“Palm Eye Cliff!”</p><br/><p>The sky above Ceng Lian’er darkened. She raised her head to look and saw a cliff hundreds of zhang tall dropping down quickly!</p><br/><p>Hiss!</p><br/><p>The people below saw it clearly and inhaled.</p><br/><p>A mountain that was shaped like a hand had red channels on it like the patterns of a palmprint. What was most frightening was that on the palm there was an enormous bloody eye.</p><br/><p>Anyone that was swept by this eye froze and their blood almost solidified!</p><br/><p>Even the middle-aged attendant and the others showed some astonishment. They didn’t know the powers of this blood eye, but just the presence of the falling mountain was enough to make people feel that they could not win.</p><br/><p>“Such a powerful Palm Eye Domain!” Zhu Ke murmured, shocked inside.</p><br/><p>The Palm Eye Domain originated from the Palm Eye mo skill. This was a very rare and obscure mo skill. The person would only cultivate one palm and one eye. Even Zhu Ke who was very knowledgeable had only heard rumors. But this unknown Mister Tong had clearly cultivated this extremely obscure mo art to a very deep level. His understanding of [Domain] seemed almost unimaginable.</p><br/><p>Even from afar, Zhu Ke felt his heart speed up as he saw that Palm Eye Cliff and its cold presence.</p><br/><p>“In the history of the Palm Eye mo skill, there probably isn’t anyone who can surpass Mister Tong. This non-descript mo skill has blossomed in his hand, and one has to admire him!” A one-horned mo standing next to the chariot praised .</p><br/><p>This person was called Ding Dong. His large body was covered in thick armor. What was most curious was that the armor was growing out of his body.</p><br/><p>“Those without persistence cannot do this!” another person praised. This person’s eyes were long and narrow, his gaze cold. There was a transparent pair of wings on his back that were as clear as glass. This person was called Qian Qing and was one of the more famous experts in Marshal Yu’s command.</p><br/><p>“I hope that this woman can manage to survive a while longer,” Ding Dong said with a smile, “I really anticipate examining shen power!”</p><br/><p>Qian Qing snorted coldly and said, “Shen power is just a myth.”</p><br/><p>However, the two did not look away. It was rare for Mister Tong to fight, and he was very low-key under Marshal Yu’s command. He was had very good relations with everyone and there were not many chances to see him fight.</p><br/><p>There were many experts in Marshal Yu’s command. Even as strong as they were, there was still competition.</p><br/><p>The Palm Eye Cliff was Mister Tong’s ultimate move. They had only heard the name but never seen it before. Now, they focused their attention to see its power!</p><br/><p>Countless eyes gathered on her, but Ceng Lian’er did not panic.</p><br/><p>At some time, the crescent moon had moved in front of her.</p><br/><p>Mist blurred her eyes, her long sleeves danced and her serene and ethereal voice flashed across everyone’s minds.</p><br/><p>“Moon, moon, open!”</p><br/><p>The crescent moon spun in a circle around her and then struck at the Palm Eye Cliff that was crashing down.</p><br/><p>There was no sound or ripple.</p><br/><p>The terrifying Palm Eye Cliff was split open down the middle like tofu!</p><br/><p>Mister Tong’s expression changed drastically and his hand froze.</p><br/><p>“Moon, moon, shatter!”</p><br/><p>The crescent moon spun quickly and turned into a flash of light. Ceng Lian’er beautiful figure flickered under the light of the moon.</p><br/><p>Countless ruler-straight marks covered the Palm Eye Cliff in a flash.</p><br/><p>Mister Tong’s face turned from red to while. His pupils expanded in disbelief.</p><br/><p>Pew!</p><br/><p>Face ashen, Mister Tong sprayed out blood and fell face down from the sky.</p><br/><p>At the same time, the Palm Eye Cliff crumbled. The pieces rained down and each cut on every piece was as smooth as a mirror.</p><br/><p>The entire battlefield was left silent!</p><br/><p>Translator Ramblings: One down, so many more to go.</p><br/>\n</div>"}