{"title": "Chapter Six Hundred and Forty Seven – Transformation", "id": 597, "volume": 6, "url": "http://boxnovel.org/world-of-cultivation-chapter-six-hundred-and-forty-seven-%E2%80%93-transformation", "volume_title": "Volume 6", "body": "<h1>Chapter Six Hundred and Forty Seven – Transformation</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Six Hundred and Forty Seven – Transformation</p><br/><p>Nothing could rival the brutal presence of the Anti Dragon Claw, not even the wasteland beast that Zuo Mo could summon using the Archaic Wasteland Sacrificial Art. But this brutal presence was nothing compared to its power in the past. According to Pu Yao and Wei, the Anti Dragon Claw had been weakened for thousands of years by the Three Thousand Threads of Worry. This caused Zuo Mo to desire and admire what presence the Anti Dragon Claw had in the past.</p><br/><p>The brutal energies of the Anti Dragon Claw furiously flooded into Zuo Mo’s body.</p><br/><p>The Sun Crystal Seed was stimulated by this. A thick, almost tangible, flow of heat poured out from the crack as it slowly advanced.</p><br/><p>One was an unparalleled ancient and vicious object, the other was a great treasure of the world, one cold, one hot. When the two forces came into contact, it was like cold water poured into hot oil.</p><br/><p>In front of these two terrifying powers, Zuo Mo’s steel hard mo physique that was fragile as paper. In a flash, it was covered in holes. If it wasn’t for the Greenvine Mystical Water’s healing properties, he would have already turned to dust long ago.</p><br/><p>But as the battle heated up, the positions of the two sides steadied and they gathered near each of the ten sun matrices on Zuo Mo’s body.</p><br/><p>These ten sun matrices of the Ten Crow Celestial Apparatus mo physique were naturally attuned to the Sun Crystal Seed and acted as wells where shen power naturally gathered. The Sun Crystal Seed’s power flowed into the ten mo matrices as a result.</p><br/><p>Taking advantage of this the cold and brutal energies of the Anti Dragon Claw quickly took over all of Zuo Mo’s body and started to furiously attack these ten sun mo matrices.</p><br/><p>If someone was to touch Zuo Mo’s body now, they would find to their shock that his entire body was freezing but the ten sun mo matrices burned like hot metal.</p><br/><p>As the battle intensified, even the shen power in Zuo Mo’s sealed right hand was attracted and entered this great battle.</p><br/><p>Zuo Mo himself was left extremely weak.</p><br/><p>The powers inside his body rampaged out of control. His body was a mess and heavily injured.</p><br/><p>Yet at this moment, Zuo Mo found a chance.</p><br/><p>There was another power in Zuo Mo’s body that he had always forgot—the Soul Setting Divine Light!</p><br/><p>This divine light came from Wei’s succession. Other than placing jinzhi in Gu Ming Gong, Zuo Mo had never used it again. It was not that Zuo Mo had a low opinion of its power, but the succession of the Soul Setting Divine Light was too ancient and too difficult to understand. Even Wei could not speak of the specifics. The divine light itself was strange and Zuo Mo didn’t even know where to begin studying it.</p><br/><p>What he had not expected was that the Soul Setting Divine Light slowly emerged out of the Three Thousand Threads of Worry during this moment of great danger. These two terrifying powers, Three Thousand Threads of Worry and the Soul Setting Divine Light, had not destroyed each other. Zuo Mo was not surprised about the Three Thousand Threads of Worry. Something that could restrain the Anti Dragon Claw had to be a treasure on par with the Anti Dragon Claw. This divine light that originated from the dawn of the world also was unaffected. Zuo Mo immediately realized that the Soul Setting Divine Light was a treasure on the same level as the Anti Dragon Claw and the Sun Crystal Seed!</p><br/><p>When the Soul Setting Divine Light burrowed out of the Three Thousand Threads of Worry, it slowly swam like a rainbow fish in Zuo Mo’s torn up body.</p><br/><p>Forced to desperate straits, Zuo Mo’s heart jumped when he discovered the Soul Setting Divine Light.</p><br/><p>Opportunity!</p><br/><p>Right now, all other powers in his body were completely suppressed by the Sun Crystal Seed and the Anti Dragon Claw so he could not use them. The Three Thousand Threads of Worry were not suppressed but because of the uniqueness of its power, it was of no help in this battle.</p><br/><p>The sudden discovery of the Soul Setting Divine Light was akin to a life-saving herb to Zuo Mo!</p><br/><p>Zuo Mo immediately controlled his emotions and pushed down the joy and excitement he felt. He thought back to how he had previously activated the Soul Setting Divine Light.</p><br/><p>As expected, when his thoughts shifted, the Soul Setting Divine Light immediately stopped where it was.</p><br/><p>Zuo Mo was joyed. It seemed that he could control the Soul Setting Divine Light. Given his present helplessness, a power that he could control was what he needed the most! Even if this power was tiny, he would not give it up. A power that he could control meant that he did not have to wait for his fate to be determined by others.</p><br/><p>He carefully controlled the Soul Setting Divine Light. Because it had been too long since he had used it, and he wasn’t familiar to start with, his control was extremely crude at first. Zuo Mo was not demotivated. He usually seemed to be uncaring, but the more dangerous the moment, the clearer his mind was and the more patience he had.</p><br/><p>The conflict between the Sun Crystal Seed and the Anti Dragon Claw reached a white-hot level.</p><br/><p>The burning flow that poured out from the Sun Crystal Seed continued to flood into the ten sun mo matrices. The ten sun mo matrices were quickly filled up. They were filled with power like ten balls of flame. Because the power that was added was too strong, the mo matrices were completely awakened. The awakened mo matrix actually concealed its light. The burning heat turned to darkness.</p><br/><p>Light and dark, they were twins!</p><br/><p>Zuo Mo seemed to understand when he saw this scene!</p><br/><p>The power in every sun mo matrix far surpassed the limits of what the mo matrix could tolerate. If there was no outside force that reduced the power, the Sun mo matix would not be able to tolerate the overflow and would explode. It would only end up in one way for Zuo Mo, dying in an explosion of blood and gore.</p><br/><p>Fortunately, there was the Anti Dragon Claw!</p><br/><p>The cold and brutal energy of the Anti Dragon Claw surrounded the ten sun matrices from all directions. The stimulated Sun Crystal Seed realized that the sun matrices was a battlefield where it held the advantage. There, held the home ground advantage! If it caused these sun matrices to explode, then it would undoubtedly lose this advantage!</p><br/><p>Therefore, the sun matrices were simulated on a path that Zuo Mo never thought about.</p><br/><p>—Evolution!</p><br/><p>The power of the Sun Crystal Seed flooded every part of the Sun Matrix. The power that was several levels above the sun mo matrix repeatedly cleansed the mo matrix causing itto change.</p><br/><p>Like grass sprouting, the complex mo matrix silently grew.</p><br/><p>It was the first time Zuo Mo observed the growth of a mo matrix.</p><br/><p>The Anti Dragon Claw as also intelligent. It responded to the transformation of the Sun mo matrix.</p><br/><p>A layer of frost appeared on Zuo Mo in the areas around the sun matrix. This layer of frost was not white or blue, but a faint grey. A portion of the Anti Dragon Claw’s brutal energy started to heal Zuo Mo’s almost ground up flesh.</p><br/><p>Yet the Anti Dragon Claw’s icy power was too brutal. Even if it was trying to heal, it felt like thousands of little icy knives cutting repeatedly into Zuo Mo’s flesh.</p><br/><p>Zuo Mo endured the heart-boring pain as he carefully controlled the Soul Setting Divine Light. He hid it in a corner and waited patiently for a chance. He realized that this moment was not the best time to act. The Sun crystal Seed and the Anti Dragon Claw were all accumulating power. The following clash would most likely be even more intense than before.</p><br/><p>Zuo Mo’s mo physique was sturdy, but in front of something as vicious as the Anti Dragon Claw, it was not enough. Large amounts of blood and flesh disappeared like melting snow in front of the brutal energies. Leaving only the blood and flesh that could absorb the brutal energy.</p><br/><p>This lead to a process in which Zuo Mo’s blood and flesh was completely transformed. The strongest flesh quickly expanded and thrived, the weakest rapidly shrank and died. They continued to struggle in the ocean of brutal energy and gradually stabilized.</p><br/><p>No one noticed that a grey mo matrix had appeared inside Zuo Mo’s body and it was slowly growing, creeping across his body like ivy. The grey mo matrixes were completely different than the mo matrices he had before. Some dense scales appeared on the edges of the mo matrix. If one looked closely, they would find that these fine scales were extremely similar in color and shape to the scales of the Anti Dragon Claw, but much smaller.</p><br/><p>The heavy brutal energy filled the space one zhang around Zuo Mo and seemed to be one with the Anti Dragon Claw.</p><br/><p>But outside of this one zhang, the presence of the energy was completely absent. Not allowing anyone present to detect it.</p><br/><p>Everyone’s gaze was deeply attracted to the battle between Marshal Yu and Wo Li.</p><br/><p>———</p><br/><p>“[Chain Together]!</p><br/><p>Wo Li’s slender fingers pointed at Marshal Yu. Her cool gaze contained determination and fighting spirit. Under the sea of flowers, Luo Li was reflected. While his body was transparent, there was a smile at the corner of his mouth.</p><br/><p>Almost at the same time, the two of them spoke.</p><br/><p>Wo Li’s voice was cool and as hard as a sword, “Together!”</p><br/><p>Luo Li’s voice was a murmur and gentle as water, “Together!”</p><br/><p>Woosh, A thick chain suddenly flew out from under Wo Li’s feet like an ancient snake that shot at marshal Yu.</p><br/><p>The air was filled with the sound of the chain clanking. The whole of the flower sea was trembling.</p><br/><p>A strange presence that was hard to describe moved into the surroundings as the chain clanked.</p><br/><p>This was … …</p><br/><p>Zhu Ke’s expression was uncertain.</p><br/><p>“This is … …” the middle-aged attendant exclaimed but she suddenly stopped as her face became completely bloodless.</p><br/><p>Xia suddenly raised his head. His breathing was so heavy it could be heard clearly through the thick armor.</p><br/><p>———</p><br/><p>This was the presence of life and death!</p><br/><p>Marshal Yu’s eyes were filled with shock and gravity. This snake-like metal chain was made from two opposing powers, life and death!</p><br/><p>If he was not seeing it with his own eyes, he would not believe it!</p><br/><p>Life and death, two diametrically opposed powers yet they were merged together so beautifully. It really was fantastical.</p><br/><p>What method was this?</p><br/><p>Who was that woman?</p><br/><p>Countless thoughts flashed through his mind but in a moment, his mind became clear again.</p><br/><p>This chain that was woven from life and death was one of the highest powers that he had ever seen. It was so exquisite, so fantastical, it was hard to believe. As a marshal, even Marshal Yu sighed and praised it.</p><br/><p>But such an exquisite and creative power still had weaknesses.</p><br/><p>It was not condensed enough.</p><br/><p>The other should have just comprehended it a short time ago. Even though they had understood to the crux of the ability, they lacked practice and the power was too weak. It was akin to a very powerful seedling. Maybe it would be powerful when it matured, but the seedling that had just germinated was thin and delicate.</p><br/><p>Power came from methods, but also from an accumulation of experience.</p><br/><p>Compared to this method of life and death that was undoubtedly a top skill, Marshal Yu did not have anything like that. But in terms of accumulation, the other was far lacking.</p><br/><p>He had never thought that he would be forced to such a state by such a young woman.</p><br/><p>Marshal Yu smiled, full of self-scorn. However, someone that could comprehend such a wondrous method was qualified to be his opponent!</p><br/><p>The smile on his face gradually faded away. His expression became solemn and devout as he raised the Green Carp Tongue Sword.</p><br/><p>The countless hardship and obstacles on his path of cultivation flashed passed his mind’s eye. His mind suddenly broadened!</p><br/><p>A figure stood with a sword under a drizzle of rain.</p><br/><p>I will let you see the true power of this marshal level’s [Rain Domain of No Return]!</p><br/><p>Translator Ramblings: A little bit of this, a little bit of that, and ta da, one new body!</p><br/>\n</div>"}