{"title": "Chapter Five Hundred and Fifty Eight – Light", "id": 608, "volume": 7, "url": "http://boxnovel.org/world-of-cultivation-chapter-five-hundred-and-fifty-eight-%E2%80%93-light", "volume_title": "Volume 7", "body": "<h1>Chapter Five Hundred and Fifty Eight – Light</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Five Hundred and Fifty Eight – Light</p><br/><p>Zuo Mo was furious about the situation but Ceng Lian’er didn’t even bat an eyelid. She slowly lifted her teacup and elegantly drank. Under her long eyelashes, her bright black eyes were shrouded in the steam.</p><br/><p>A Gui sat disaffected by Zuo Mo’s body. She was like a puppet, wooden and lifeless.</p><br/><p>In front of A Gui, Zuo Mo looked warily at Ceng Lian’er, his brow locked in a frown. He didn’t know what to do with this woman that suddenly popped out.</p><br/><p>Having recovered his calm, Zuo Mo started to ponder this matter. But no matter which angle he thought about this from, this matter was not anything good for him.</p><br/><p>He wasn’t interested in something like paired cultivation at all. Yet he had entered what was going to be a long period of attempting high level power increases. He also found it hard to accept that he had to now live and die together with an unfamiliar woman.</p><br/><p>Also, if the other encountered danger, it meant that he would also encounter danger. In an instant, his risk of danger had doubled.</p><br/><p>The damned paired cultivation!</p><br/><p>Zuo Mo felt especially aggrieved when he saw the other’s calm state.</p><br/><p>Zuo Mo shook his head and decided to not waste any more time on this topic. He started his cultivation again, but out of consideration for safety, he shielded A Gui behind him. Even he didn’t notice that he had done this unconsciously.</p><br/><p>A faint gold light came out of Zuo Mo’s body and was eye-catching in the darkness.</p><br/><p>Almost the moment Zuo Mo started channeling shen power, Ceng Lian’er’s body shook and faint moon essence shrouded her body.</p><br/><p>Zuo Mo instantly detected the change in Ceng Lian’er.</p><br/><p>The shen power inside his body was unusually active. The shen power that usually delved into his blood and fixed to his flesh seemed to be drawn out instead. The rate that the power whirlpool in Zuo Mo’s right hand was spinning at slowed and the shen power from the whirlpool flowed out of his right hand, and merged with the shen power that floated out of his blood and flesh to circulate around Zuo Mo’s body.</p><br/><p>Observing the path that the shen power took in circulation, Zuo Mo unconsciously recalled the contents of the gold leaf and a kind of epiphany occurred.</p><br/><p>The golden leaf recorded the cultivation method for the sun shen power, but due to the gap in eras, it was hard to understand the contents. Zuo Mo was confused by many parts. Now that shen power was circulating through his body in this novel manner, he seemed to understand many of the cryptic phrases on the golden leaf.</p><br/><p>Immersed in the joy of understanding, Zuo Mo completely forgot the flow of time.</p><br/><p>The golden light that Zuo Mo released was restrained but Ceng Lian’er’s moon essence nearby was so thick it was almost tangible.</p><br/><p>The moon moved, the night gradually faded. Dawn silently arrived and the sky started to turn white.</p><br/><p>The moment the sun came up out of the horizon, Zuo Mo’s body suddenly shook. It gave off blinding golden light as though it was a sun, responding to the sun in the horizon!</p><br/><p>Boom!</p><br/><p>The Sun Crystal Seed inside Zuo Mo’s body suddenly gave off a great amount of flames. The golden flames criss-crossed and wrapped around the Sun Crystal Seed. Following that, a dash of golden liquid charged forward on the path that Zuo Mo’s shen power took.</p><br/><p>The golden liquid did not move quickly, but was extremely hot and felt as though it was burning. What shocked Zuo Mo the most was its domineering nature! It was the utmost domineering! As though nothing could stop it!</p><br/><p>As though it was howling, full of dissatisfaction!</p><br/><p>Like it had a dream that one day, it could be like the sun that was rising on the horizon, to hang in the sky!</p><br/><p>In this moment, strange scene played out in front of him. Inside an empty and black void, a thread of celestial fire formed, and it grew with time, forming a ball of fire. After millions of years, it grew even bigger, so big until it was almost the size of a true sun.</p><br/><p>Suddenly, a hand reached into the void, a hand that looked very normal. This hand only grasped lightly, it had a terrifying power that never had been experienced before. The hand squeezed from all directions.</p><br/><p>The sun’s enormous body was forcibly compressed to become the Sun Crystal Seed … …</p><br/><p>For some unknown reason Zuo Mo suddenly understood. He understood its dissatisfaction, the dissatisfaction of not being able to be in the sky!</p><br/><p>The burning golden liquid suddenly passed into Zuo Mo’s heart. Zuo Mo’s body suddenly shuddered and his chest felt as though it was burning. The complex sun mo matrix at his chest slowly lit up.</p><br/><p>Boom!</p><br/><p>Blinding golden light sprouted from Zuo Mo’s chest.</p><br/><p>A domineering and vast power filled Zuo Mo’s body. In this moment, Zuo Mo had a feeling he looking down on the world. Even those massive mountains and endless deserts were specks under his feet.</p><br/><p>This feeling came quickly and passed quickly.</p><br/><p>The sun mo matrix at Zuo Mo’s chest seemed to come alive and slowly spun. Zuo Mo could clearly feel that the golden liquid turned into a ball of fire when it reached his heart and was spinning endlessly.</p><br/><p>A feeling of unprecedented fullness spread through his entire body!</p><br/><p>The first sun of Ten Crow Celestial Apparatus had formed!</p><br/><p>The moon essence dissipated with the sun, Ceng Lian’er glanced at Zuo Mo. Her face was filled with shock and held none of the ease she had previously! It was as though she was looking at a strange monster!</p><br/><p>He had actually had a breakthrough!</p><br/><p>Even though she was unable to detect the exact changes inside Zuo Mo’s body, she could clearly feel that Zuo Mo’s power had reached a whole new level.</p><br/><p>The moon shen power inside her body also had grown considerably with the paired cultivation but compared to the other, it was an insignificant increase.</p><br/><p>Her face surprised, her black onyx eyes were filled with disbelief.</p><br/><p>What she cultivated was moon shen power. Unlike Zuo Mo, she had inherited a complete inheritance. In reality, she had guessed long ago that Zuo Mo’s shen power came from a fortuitous encounter. Zuo Mo’s shen power cultivation methods had many areas that were irrational and he didn’t even know about how they had entered paired cultivation.</p><br/><p>But a person like this had had another breakthrough in the span of one night!</p><br/><p>In reality, when she had come to Zuo Mo, she had been shocked when she first saw him again. It had just been a few days since she had first seen him, but Zuo Mo’s power had clearly increased.</p><br/><p>Breaking through the boundary between brigadier and general, her power was also in a period of accelerated growth. She had worked hard on her cultivation in these few days, and her power had leapt ahead. Even when Master had been alive, Master had always praised her outstanding talent and for being the most talented and accomplished disciple of the lineage for more than a thousand years. She had believed in that.</p><br/><p>But … …</p><br/><p>Looking at this freakish person, her confidence started to waver.</p><br/><p>She looked at Zuo Mo as though she was admiring a great masterpiece.</p><br/><p>———</p><br/><p>“How many more days?” Shu Long asked. Behind him, the hardship guards still moved uncompromisingly in their military formation.</p><br/><p>“If it all goes smoothly, then ten days!” Ye Ling tried to stay alert but his voice was filled with tiredness.</p><br/><p>In these days, they hadn’t rested at all. They had moved at the fastest speed that was safe. What was most irritating were the occasional battles along the way. Since the war between xiuzhe and yaomo had begun, security in these areas had declined and bandits could be found everywhere.</p><br/><p>When they encountered bandits, Shu Long wasn’t soft-hearted. If they encountered any bandits, they would kill all of them.</p><br/><p>Later on, Ye Ling thought of an idea. He put up a flag on the caravan with a the character “Guard” written on it. After winning the next few battles, the name of Butcher Guard Camp spread, especially when someone discovered that Shu Long’s group was the battalion that had killed three thousand bandits in Eminent Mountain Jie with only one hundred people. This bit of information instantly caused waves.</p><br/><p>This also caused bandits to disappear from where Guard Camp was passing by. Even the local factions ignored this terrifying hundred person strong battalion. They definitely did not dare to provoke the caravan.</p><br/><p>Luckily, Shu Long and the others moved quickly and did not linger. People paid attention to this and secretly speculated that Guard Camp was probably on a special mission.</p><br/><p>Consequently, Guard Camp’s travelling speed suddenly increased.</p><br/><p>Shu Long was full of praise for Ye Ling’s idea. He didn’t care at all about getting famous. His mind was completely filled with getting to meet Daren as soon as possible.</p><br/><p>“Ten days!”</p><br/><p>Everyone’s morale rose. This was the longest journey that Guard Camp had ever taken since it was established. They didn’t even know how many jie they had crossed.</p><br/><p>Fortunately, Ye Ling had brought along enough mo bei. This meant they could use the blood pools. The blood pools of the mo and the yao doors of the yao, were like the transportation formations of xiuzhe, and similarly there were tolls to be paid.</p><br/><p>Otherwise, it would take years to fly to their destination.</p><br/><p>Nan Yue, Cang Ze and the others were also exhausted. However, their wills and hearts were more steeled compared to the past. All of them cultivated powerful yao arts to start with, and the fighting had been of great aid to their training. They were completely different people now.</p><br/><p>In ten more days, they would be able to see Daren, everyone found themselves filled with energy!</p><br/><p>———</p><br/><p>Golden Crow Camp was filled with light but unusually silent.</p><br/><p>Xiuzhe were lying askew in the enormous room. The snores were like the beats of a drum. Master Sun Bao was also in a corner and drooling as he slept. Master Ji Wei also was robbed of all dignity, his legs spread on the stairs as he laid with his limbs spread out, his mouth wide as his snores roared.</p><br/><p>Each of them were sleeping sweetly. Many people had lingering excitement on their faces.</p><br/><p>Not one of them was awake.</p><br/><p>They were extremely tired. They hadn’t rested for one moment in so many days. When they were tired, they would throw back a ling dan for energy and continue to work! Just by relying on a pile of ling dan, they did not sleep nor rest as they studied the mo matrixes and what Daren had sent back, about engraving, and activating mo matrixes.</p><br/><p>Everyone worked as hard as they could. No one complained.</p><br/><p>Everyone furiously worked as though they were possessed without any regard!</p><br/><p>Everyone understood that this was a war!</p><br/><p>But today, they finally saw the light!</p><br/><p>Zong Ru entering seclusion did not attract too much attention. Right now, Turtle Island was unified, everyone was focused on getting stronger. Many people were using seclusion as a method.</p><br/><p>He lightly covered the stone slab entrance. The last thread of light that crept through the cracks from the outside disappeared as the cloth settled in front of him.</p><br/><p>It was completely dark inside the mountain cave but Zong Ru’s mind was unusually calm.</p><br/><p>He had told no one else that his seclusion this time was intended as a death seclusion. Death seclusion was an extremely dangerous type of seclusion, death or advancement. In this seclusion, the number of mental demons would be ten times what it usually was. If one was the least bit careless, they would go mad, their minds would collapse.</p><br/><p>But Zong Ru didn’t feel any terror. As if it was just like usual, he crossed his legs and sat down, chanting sutras like usual.</p><br/><p>In the past, he had sworn the Buddha Abandonment Death Wish that he was to use his vajra body to protect Daren.</p><br/><p>Right now, Daren had encountered trouble and his strength was such that he could not help Daren.</p><br/><p>In the darkness, Zong Ru’s expression was calm. There was no hesitation, no fear, only calm—because this was the path he chose, oath he gave.</p><br/><p>Translator Ramblings: They are progressing at all fronts. This breakthrough is more like a mental one, he’s gaining more comprehension of how to cultivate shen power.</p><br/><p>Also, it is my preference that comments remain generally spoiler free. As a result, some of your comments will not show up because I read them and saw spoilers. It’s great that you guys like this story so much you read ahead but I don’t want to ruin the experience for readers who haven’t.</p><br/>\n</div>"}