{"title": "Chapter Five Hundred and Fifty Seven – Screw Live and Die Together", "id": 607, "volume": 7, "url": "http://boxnovel.org/world-of-cultivation-chapter-five-hundred-and-fifty-seven-%E2%80%93-screw-live-and-die-together", "volume_title": "Volume 7", "body": "<h1>Chapter Five Hundred and Fifty Seven – Screw Live and Die Together</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Five Hundred and Fifty Seven – Screw Live and Die Together</p><br/><p>Zuo Mo did not know about what was happening on Turtle Island.</p><br/><p>He forgot himself in his cultivation. In the past, Zuo Mo had not chased after power. He did not have great ambitions, it was enough to have enough power to live well. But right now, he had an almost absurd desire for power. It was clear that both the matter of healing A Gui or investigating his birth, success would be based on one foundation, strength, great strength!</p><br/><p>Everyday, he was immersed in cultivation as though he did not know exhaustion. He was waiting for Shu Long and the others to arrive. If his investigation was right, Nether Spring Jie wasn’t a place that he could go to alone.</p><br/><p>Ten Crow Celestial Apparatus.</p><br/><p>The physique ranked third in the general level and as expected, it had its unique traits. Wei was familiar with all kinds of mo physiques and this allowed Zuo Mo’s cultivation to be extremely focused. In a few short days, Zuo Mo’s strength had shot forward and he finally had a comprehensive understanding of the Ten Crow Celestial Apparatus.</p><br/><p>The name Ten Crow Celestial Apparatus, alluded to the ten suns on different areas of his body. They looked more like carefully carved tattoos, and not mo matrixes.</p><br/><p>The most eye-catching was the sun matrix at the center of Zuo Mo’s forehead. The perfect circle was made of complex and beautiful patterns. There was a jagged zig-zagging pattern on the circumference of each deep dark gold sun, representing rays of light.</p><br/><p>Zuo Mo’s face was not handsome, but when the sun script symbol appeared there, it added a hint of mysteriousness and nobility.</p><br/><p>Ten Crow Celestial Apparatus, each sun represented a source of power. He needed to accumulate power and activate each sun. Each sun contained a transformation. Ten suns, meant ten transformations.</p><br/><p>According to Wei, mo that cultivated Ten Crow Celestial Apparatus were rare, and rarer were those that comprehended all ten transformations.</p><br/><p>Ten Crow Celestial Apparatus, each transformation was extremely powerful and domineering. What was even more frightening was that the power of Ten Crow Celestial Apparatus would be used with finesse and technique, and was not just the application of brute force.</p><br/><p>But what was most famous about the Ten Crow Celestial Apparatus was not the ten transformations, but that it had the title of best domain in general level, [Ten Crow Celestial Domain]!</p><br/><p>Hearing this, Zuo Mo hungered for it. It was a pity that Wei didn’t know how to comprehend [Ten Crow Celestial Domain].</p><br/><p>[Domain] was a type of power that was accessible to only those yuanying xiuzhe, general mo, and Rahula yao. Ding Zhen’s [Lantern Fire Buddhist Domain] was an example, and Wei Sheng had been able to grasp the beginnings of [Domain] while he was in jindan. Wei Sheng’s talents were astounding.</p><br/><p>Having seen Ding Zhen’s [Lantern Fire Buddhist Domain], Zuo Mo yearned for [Domain].</p><br/><p>However, Wei did not speak more about how to comprehend [Domain]. That was something far beyond where Zuo Mo was.</p><br/><p>Even though Zuo Mo had obtained Ten Crow Celestial Apparatus due to having a precious treasure in his body, he still lacked comprehension. With his body now in a balanced state, having had a breakthrough in his mo physique, ling power, and consciousness. It was the two powers to first have breakthroughs that were now holding him back. Zuo Mo worked on processing the shen power in his right hand, and then turned it into ling power and spiritual consciousness. He used this method to also strengthen his Ten Crow Celestial Apparatus.</p><br/><p>Zuo Mo had originally assumed that this stabilization would take a long time. Unexpectedly, he only needed ten days to raise his ling power to yuanying levels, and his consciousness to yao mansion.</p><br/><p>One factor was the abundance of shen power. The increase in the power whirlpool in Zuo Mo’s right hand was still accelerating, and the amount of shen power he draw everyday increased. While overjoyed, Zuo Mo was also slightly worried. Based on this speed, the shen power being produced every day would soon surpass the amount he could process.</p><br/><p>The other factor was that while his Ten Crow Celestial Apparatus was not very stable, it was at the general level, and higher than both jindan and yin spirit. But Zuo Mo had forcefully crossed the boundary between levels by relying on treasures and his understanding of the power was completely different than others at the level.</p><br/><p>All paths of power led to the same destination. Even though the mo physique was different compared to ling power and spirit consciousness, there were many places Zuo Mo could study and copy.</p><br/><p>Pu Yao and Wei were not shocked by Zuo Mo entering yuanying. In their eyes, this was natural. However, Pu Yao was slightly excited now that Zuo Mo’s consciousness formed the yao mansion.</p><br/><p>Yao that formed their yao mansion were called Rahula yao and could be counted in the ranks of experts in the yao world.</p><br/><p>Zuo Mo’s talent in yao arts was actually very good, but compared to the even more amazing mo physique, it was slightly lacking. Leaving Pu Yao to feel that although Zuo Mo was his student, Wei had taken the glory. Now that Zuo Mo had formed his yao mansion, it meant that he could pass more yao arts to Zuo Mo.</p><br/><p>Also, Archaic Wasteland Sacrificial Art was more suited to Rahula yao!</p><br/><p>However, Pu Yao did not say this. He was busy doing some other things.</p><br/><p>———</p><br/><p>Some strange messages appeared in the corners of Ten Finger Prison.</p><br/><p>The messages were worded strangely and the sentences incomprehensible. They were also posted in remote places that were not attention-catching. But if those with intentions searched, they would find to their shock that there were similar messages at every level of Ten Finger Prison.</p><br/><p>“Will this work?” Wei asked Pu Yao.</p><br/><p>“Don’t know.” Pu Yao’s bloody pupil was deep. “It has been too long. I don’t know if they still remember, let’s just try.”</p><br/><p>“I don’t know how many of Master’s supporters still remain,” Wei said calmly, “I have sent out the blood summons.”</p><br/><p>Pu Yao’s eyes flashed with a reckless light, a cold smirk at the corner of his mouth. “No matter how powerful time is, it will leave some remnants behind.”</p><br/><p>“You plan on having A Zuo inherit all of this?” Wei looked at Pu Yao.</p><br/><p>Pu Yao shook his head. “He may not be willing to inherit.”</p><br/><p>“Our thoughts are the same.” Wei nodded.</p><br/><p>“However, he needs power.” Pu Yao’s robes moved despite the lack of wind, his voice became deep. “He doesn’t understand himself, and we cannot truly understand him. His enemies most likely are far more powerful than even he imagines, he only has one path.”</p><br/><p>Wei suddenly gave a small smile. “Very similar to how we were.”</p><br/><p>Pu Yao’s memories were stirred by this, a reminiscing expression in his bloody pupil. He quickly calmed down. “Also, it will not be unprofitable for them to follow him. Families that stood guard for thousands of years and did not give up should return to glory!”</p><br/><p>Wei sighed. “I do not know how many still remain.”</p><br/><p>Pu Yao also became silent. He also did not know.</p><br/><p>———</p><br/><p>Zuo Mo suddenly stopped his cultivation. He detected someone was approaching. His body turned towards the people approaching and stood between them and A Gui, shielding A Gui behind him.</p><br/><p>Two figures appeared like ghosts nearby.</p><br/><p>“It’s you!” Zuo Mo’s gaze focused and he was shocked inside.</p><br/><p>In the night, Ceng Lian’er’s exquisite and beautiful features looked more mysterious. Her black opal like eyes held an indescribable light. There was also a woman standing next to her. Looking at her attire, it should be Ceng Lian’er’s maid.</p><br/><p>She stopped at a distance of five zhang from Zuo Mo.</p><br/><p>“You are going to Nether Spring Jie?” the serene voice drifted over with the wind.</p><br/><p>Zuo Mo who had not lowered his guard suddenly focused his gaze. He asked in a deep voice, “How do you know?”</p><br/><p>“This is Shattered Stone Jie.” Ceng Lian’er did not pay attention to Zuo Mo’s wariness.</p><br/><p>Zuo Mo understood. Most likely, his search for Reverse Shadow Spirit Silkgrass had caught Ceng Yi’s attention. This outrageously beautiful woman in front of him gave him a great sense of danger. Even though a part of his breakthrough was owed to this person, and the other’s silver shen power had been one of the main causes of his breakthrough.</p><br/><p>But he could not get the measure of this woman’s power or intentions.</p><br/><p>“I cultivate moon shen power.” Ceng Lian’er’s seductive face became slightly dazed. She raised her face, and the moon above her head brightened slightly. A ray of moonlight fell on her face, illuminating her delicate features.</p><br/><p>The long eyelashes, the warm lips, the flawless face, under the illumination of the moon, it seemed to shake the soul.</p><br/><p>“Moon shen power?” Zuo Mo finally understood why the other’s shen power would have power resonance with his shen power.</p><br/><p>“I will go with you to Nether Spring Jie,” Ceng Lian’er said serenely.</p><br/><p>“You’ll go with me to Nether Spring Jie?” Zuo Mo heard this and stopped for a long time before he reacted. He felt it was humorous. “Haha, what are you saying? You are going with me to Nether Spring JIe? Haha.”</p><br/><p>“Yes,” Ceng Lian’er looked at Zuo Mo with her calm eyes.</p><br/><p>Zuo Mo heard the determination in the other’s voice and his humor receded. He frowned. “This joke isn’t funny, I’m not familiar with you.”</p><br/><p>Ceng Lian’er’s voice was extremely pleasing to hear. “Because you cultivate sun shen power, and I cultivate moon shen power.”</p><br/><p>“Don’t understand.” Zuo Mo shook his head.</p><br/><p>“If we cultivate together, our shen power will grow even more quickly,” Ceng Lian’er explained.</p><br/><p>Zuo Mo finally understood. “You mean power resonance?”</p><br/><p>“It is also called paired cultivation,” Ceng Lian’er said lightly, “it is very beneficial to you.”</p><br/><p>Zuo Mo was not persuaded. “I do not need it.”</p><br/><p>“Because of your right hand?” A hint of mirth rose in Ceng Lian’er’s pupils.</p><br/><p>However, Zuo Mo did not find it funny. His heart shook. The other’s familiarity with his secrets surpassed his expectations… to even know about the whirlpool of shen power in his hand.</p><br/><p>This woman … …</p><br/><p>“I do not have any malicious intentions. The whirlpool in your right hand is growing, and you can only absorb a small amount. When it reaches a certain level, you will lose control of it.”</p><br/><p>She stared at Zuo Mo and said, “Paired cultivation can solve this problem.”</p><br/><p>Zuo Mo spread his hands. “Why should I believe you?”</p><br/><p>“Because when your shen power awakened me, it left an imprint on my body. If you die, I cannot live,” Ceng Lian’er said as though it was nothing. “If I die, your shen power will also crumble.”</p><br/><p>“Ha! You are a good liar!” Zuo Mo laughed coldly.</p><br/><p>“The paired cultivation… when it began it decided our fate. If I channel shen power, you will be able to feel it.” As she spoke, the moonlight around Ceng Lian’er brightened.</p><br/><p>Zuo Mo’s expression changed drastically. His shen power was moving against his will!</p><br/><p>“This is the power resonance you speak of. If you channel shen power, my shen power would also resonate.” Ceng Lian’ers words burrowed into Zuo Mo’s ear.</p><br/><p>Damn it!</p><br/><p>“I think that it is much safer to follow you, so that I do not die mysteriously one day without knowing the cause.”</p><br/><p>Ceng Lian’er didn’t look at Zuo Mo as she slowly walked to his side. She sat down, and her maid knelt down next to her. In a blink, a little wooden table appeared, an exquisite tea set, a small stove, and she started to boil tea.</p><br/><p>Sea of consciousness.</p><br/><p>Zuo Mo urgently asked Pu Yao and Wei, “This woman is truthful?”</p><br/><p>The one that explained was Wei. “It is true, the paired cultivators in the ancient era usually lived and died together!”</p><br/><p>“Screw live and die together!” Zuo Mo swore with a terrible expression.</p><br/><p>“Actually, this isn’t a bad thing … …” Before Wei finished, Zuo Mo angrily turned and left the sea of consciousness.</p><br/><p>“Moon shen power?” Pu Yao was thoughtful.</p><br/><p>Translator Ramblings: I really want a prequel with Pu Yao and Wei. They have such interesting lives. Is Pu Yao from one of the major clans, which I don’t think he is, or was he a “commoner” that was seriously talented and made his own way up to become a sky yao and essentially the battle general of the yaomo? What was Wei’s clan like? How many masters did he go through with the gravestone?</p><br/><p>Also, the chapter title is a nice pun. It can be interpreted two ways. One is ‘screw “live and die together” and the other would be “screw, live and die together.”</p><br/>\n</div>"}