{"title": "Chapter Five Hundred and Fifty Nine – Meeting Up", "id": 609, "volume": 7, "url": "http://boxnovel.org/world-of-cultivation-chapter-five-hundred-and-fifty-nine-%E2%80%93-meeting-up", "volume_title": "Volume 7", "body": "<h1>Chapter Five Hundred and Fifty Nine – Meeting Up</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Five Hundred and Fifty Nine – Meeting Up</p><br/><p>“Shui Yue, how have you been these days?” a friend called out loudly.</p><br/><p>“Hah! How has he been? Which one of you have ever seen him go out play?” another friend rolled his eyes and said exasperatedly.</p><br/><p>Shui Yue smiled slightly and did not respond.</p><br/><p>“Ah, I feel that my question is pretty stupid too.” The friend shrugged. “Alright, we’re going, we just got something on our hands, and it really would be a waste not to go out and have some fun.”</p><br/><p>“This guy really wastes his good skill!” The other friend’s words were filled with envy and jealousy.</p><br/><p>Shui Yue smiled and waved at his friends as they left. He was not tall and his figure was slim. His short hair was messy and soft, and his complexion was slightly pale and caused him to look prim and delicate. The smile on his face was especially endearing. Along the way, many females glanced at him, and some more daring mo females threw seductive looks in his direction.</p><br/><p>Suddenly, Shui Yue’s expression changed slightly and his steps stilled. His expression quickly recovered and he looked just like usual except that he walked at a slightly faster pace.</p><br/><p>When he returned to his home, Shui Yue quickly locked his doors. At this time, a thread of excitement flashed through his eyes.</p><br/><p>He spread open his palm. A bright blood coloured dragon had clearly appeared on his skin. The blood dragon’s head was raised proudly, that pair of eyes giving off a vicious air as though it could fly out of his hand at any moment.</p><br/><p>“It is true! It is actually true!” he said to himself. He was out of his mind in excitement, laughing and crying at the same time.</p><br/><p>He recalled both his father and grandfather who had passed away. Their last words had been so similar.</p><br/><p>Wait for the blood summons!</p><br/><p>He had doubted whether or not the blood summons existed numerous times. Grandfather had waited his entire life and never gotten it, Father had never gotten it either. He did not truly know what the blood summons were. To him, the faint dragon script on his palm was just a memento to remember his father and grandfather by. The blood summons existed only in a tiny part of his mind, a corner that he had long forgotten.</p><br/><p>The Water Moon Family, he smiled weakly. When Grandfather had grown old, he would always tell stories about the past glory of the Water Moon Family, but from youth, Shui Yue only listened to them as stories, because he had never feel the glory of the Water Moon Family. None of his friends had ever heard of the Water Moon Family.</p><br/><p>As for Water Moon mo skill, it was just slightly better than the average mo skills. Shui Yue who had been very mature from a young age was extremely hard-working and his talent among those of the same age was among the top half. Grandfather had sighed countless times while saying that if Water Moon mo skill was complete, Shui Yue would far surpass his present skill.</p><br/><p>When Shui Yue heard this, he would hurriedly try to comfort his grandfather each time, saying that he could still become very strong with the present mo skill.</p><br/><p>He never believed that there was a complete Water Moon mo skill, but he understood Father and Grandfather.</p><br/><p>Old people would always live in their memories of their past glory.</p><br/><p>Not long after Grandfather passed away, Father also passed as well. Shui Yue had started to learn how to make a living for himself. Fortunately, he had worked hard from a young age, and was much stronger than those of his age cohort. As he was composed and willing to work-hard, people gradually stopped underestimating him because of his age.</p><br/><p>He was young, but after hunting mo embryos, his battle experience was high.</p><br/><p>Starting from a long time ago, he assumed that he would live his life like this.</p><br/><p>Until today when the blood summons appeared!</p><br/><p>Shui Yue recovered from his daze, his eyes becoming clear again. He stood up and started to pack.</p><br/><p>There was no mental struggle, no resistance. He didn’t know why. Maybe it was that the stories and reminders from his father and grandfather had leached into his blood in his youth, even if he told himself countless times that the blood summons didn’t exist.</p><br/><p>For the blood call, his forefathers had struggled and lived.</p><br/><p>This youth’s pale face was now full of longing.</p><br/><p>———</p><br/><p>Ceng Lian’er found it strange. Today, Zuo Mo had not cultivated like he usually did. She smelt something was unusual. In the days since she had come, she had personally seen how crazy Zuo Mo was in his dedication to cultivating. He was crazy, squeezing out every second of time. She had been astounded inside.</p><br/><p>He repeated the dull and dry cultivation process over and over as though he did not know exhaustion.</p><br/><p>In her eyes, Zuo Mo’s manipulation of shen power was very crude and there were still many flaws. It was not as refined as hers, but if the two of them fought to the death, she felt that the one to survive would be Zuo Mo.</p><br/><p>He really was a crazy person!</p><br/><p>Every time she thought this, she would unconsciously look at A Gui. Those shattered yet heart-shaking visions would silently creep into her mind and cause her heart to tremble.</p><br/><p>She casually pondered and observed as though everything had nothing to do with her.</p><br/><p>But today, Zuo Mo was acting out of the ordinary!</p><br/><p>He wasn’t cultivating! This was the first time in the many days she had been here, that she saw him stop his cultivation.</p><br/><p>Even though Zuo Mo seemed very calm, Ceng Lian’er perceptively noticed the thread of excitement in his eyes.</p><br/><p>Was something about to happen?</p><br/><p>At this time, Zuo Mo suddenly stood up.</p><br/><p>Almost at the same time, a bunch of little dots appeared in the distant horizon.</p><br/><p>Those were … …</p><br/><p>Ceng Lian’er’s heart shook slightly as she stared at the little black dots. While her expression was calm, her surprise increased. And her maid, Yan’er’s expression showed terror.</p><br/><p>A battalion!</p><br/><p>Ceng Lian’er’s eyes were very sensitive. There was only a hundred people but she could judge, from the organized formation, that this was a battalion, and it was a battalion that was very strong in combat!</p><br/><p>A black flag was held at the front of the troop with a large word “Guard” written on it.</p><br/><p>This battalion did not move quickly, but the formation was strict and flawless. The shock it brought was enough for Ceng Lian’er to be stunned, the daughter of a jie master who had seen numerous battalions!</p><br/><p>The other also noticed the four of them and the troop suddenly turned in their direction.</p><br/><p>Like a shark that smelt blood, the entire battalion accelerated without warning. A wild howl started like hundreds of beasts howling as they charged!</p><br/><p>Ceng Lian’s fist unconsciously tightened within her sleeve. She felt as though an invisible rope was strangling her!</p><br/><p>“Miss!’ Yan’er’s face was ashen, her scream filled with terror. She pulled hard at Ceng Lian’er’s sleeve trying to pull her to escape.</p><br/><p>Even though her face was a pale white,Ceng Lian’er did not move at all because she noticed that Zuo Mo was motionless.</p><br/><p>Was it … …</p><br/><p>An absurd idea rose in her mind.</p><br/><p>Boom!</p><br/><p>The battalion had arrived. The dust that rose up from their landing was like a wall of earth that had appeared out of nowhere. It rose up and shrouded everyone’s view!</p><br/><p>Two zhang away, Zuo Mo fearlessly stood in front of the earth wall like a spear.</p><br/><p>The wall of dirt dissipated and the true appearance of this battalion was exposed to Ceng Lian’er. The first phrase in Ceng Lian’er’s mind was, veterans. This was a troop of just one hundred people, and each person’s individual strength wasn’t worth anything in her eyes. But when this dusty troop appeared in front of her, she was unable to dismiss their existence.</p><br/><p>They seemed to be part of one being, the combat formation was intimidating as though it was a killing machine that was prepared to massacre the enemy at any moment.</p><br/><p>“Daren!”</p><br/><p>Many people’s voices were hoarse but everyone had excitement on their faces. Morale was high as they stared at Zuo Mo, their eyes filled with undisguised admiration and respect.</p><br/><p>Looking at their dirt covered uniforms and the exhaustion that could not be hidden, Zuo Mo’s nose felt sore. He suppressed it, and a smile bloomed on his face. “Everyone, you must have worked hard!”</p><br/><p>“Have everyone rest.” Zuo Mo said to Shu Long in a soft voice.</p><br/><p>Shu Long was hesitant.</p><br/><p>Zuo Mo knew what he was worried about and said directly, “I have broken through to yuanying!”</p><br/><p>Ecstasy appeared on Shu Long’s voice and then he nodded, giving the order to rest. When the order was given, everyone immediately sat down where they were.</p><br/><p>Zuo Mo walked over and inspected every person to see if there were any hidden wounds. They had completed such an astoundingly long journey with many fights big and small along the way by gritting their teeth and holding their breath. Now that they released it, the exhaustion and suppressed wounds would come up like the tide.</p><br/><p>Yan’er’s little mouth was wide. Everything that was happening in front of her surpassed her imagination. This battalion … … was that guy’s!</p><br/><p>She didn’t understand why Miss had to follow this guy. Was it because he had healed and woken Miss up? It was the first time she had seen a man being carried in a princess carry by a woman. Such a weak man … …</p><br/><p>But since Miss had decided to do this, she did not speak. In any case, her duty was only to follow Miss.</p><br/><p>This scene stunned her and her mind turned blank.</p><br/><p>Ceng Lian’er’s gaze was deep. From beginning to end, she did not speak a word and only looked deeply at Zuo Mo.</p><br/><p>It was unknown what she was thinking.</p><br/><p>———</p><br/><p>“Jie Master! We have identified them, this battalion is Butcher Guard Camp!” Chao Yu reported in haste.</p><br/><p>“En?” Ceng Yi caught the thread of fear in Chao Yu’s voice and couldn’t help but feel slightly shocked. He knew his subordinate well who was usually black-hearted and very daring. It couldn’t be anything normal that had caused Chao Yu to lose his composure.</p><br/><p>“Butcher Guard Camp … …” Ceng Yi said amusedly, and then asked, “What is their background?”</p><br/><p>“Unknown, they are a battalion that suddenly appeared out of nowhere. They number just over one hundred people, but some time ago, when they were passing through Eminent Mountain Jie, they were surrounded and attacked by bandits. They massacred three thousand bandits and left unharmed.” When he spoke to here, Chao Yu couldn’t help but think of the blood scene in the mirage he had obtained, and his expression was slightly ugly.</p><br/><p>“Eminent Mountain Jie, the jie of bandits!” Ceng Yi’s expression suddenly became grave. “One hundred … … three thousand … … unharmed … …”</p><br/><p>He felt deep shock at this news. Eminent Mountain Jie was not far from where they were, and the fame of the jie of bandits was well-known. Even though he did not pay any attention to bandits, but three thousand bandits were not a small number. If the other side had just one hundred people, then it was a very terrifying matter.</p><br/><p>If it was his battalion, he couldn’t help but shake his head. Unless he personally lead the troop, and took along all of the brigadiers and colonels under his command, he wouldn’t obtain such a result.</p><br/><p>That youth’s face appeared in his mind. He was shocked. This person’s background definitely was not simple.</p><br/><p>Thinking of his daughter, he grimaced. There was no use in thinking so much. Other than getting onto good terms with the boy, what else could he do?</p><br/><p>After a moment of silence, he suddenly said, “Order the Celestial Planet Guard to follow Miss. No matter where Miss goes, they have to follow. Even if Miss tries to get them to leave, they have to follow.”</p><br/><p>“Celestial Planet Guard!” Chao Yu gaped and was stunned.</p><br/><p>Translator Ramblings: Finally arrived … …</p><br/>\n</div>"}