{"title": "Chapter Five Hundred and Sixty Eight – The Immortal Great Peace", "id": 618, "volume": 7, "url": "http://boxnovel.org/world-of-cultivation-chapter-five-hundred-and-sixty-eight-%E2%80%93-the-immortal-great-peace", "volume_title": "Volume 7", "body": "<h1>Chapter Five Hundred and Sixty Eight – The Immortal Great Peace</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Five Hundred and Sixty Eight – The Immortal Great Peace</p><br/><p>An imposing and vast city floated on top of an endless black sea. The city seemed to be floating on the surface of the sea and stretched out as a thick yellow line across the horizon.</p><br/><p>“Let’s head down.” Tang Fei jumped first off the Sandstorm Insect Carpet. “Flying is not allowed in this area.”</p><br/><p>Hearing this, everyone dismounted and put away their mo steeds.</p><br/><p>They couldn’t help but exclaim at the scenery in front of them. The vast and boundless sea in front of them caused them to feel minuscule.</p><br/><p>Walking forward a few steps, Zuo Mo went closer and then said in surprise, “This black sea is not naturally formed?”</p><br/><p>“En, it isn’t, this black sea is called the Unsullied Sea. At the time, Grandmaster Shi Zi Ming planned to build a city. The heroes of the world gathered, gifts deliver from seven mo marshals, and forty six mo generals that came from all corners of Hundred Savage Realm to personally participate in the construction. After three years of building, they formed this immortal city of great peace.” Tao Xing sighed and said, “At the time, there was only a pond by Great Peace City. There was an endless flow of people that came to visit. Every pilgrim that had travelled here would bring along a bottle of rootless water from their homeland to pour into the pond. The pond grew and after two hundred years, it formed a sea. One hundred years ago, two mo marshals took this sea and harvested Black Dark Heavy Water from the Nine Nether Ground of the Dark Realm, forged them with secret techniques to form this Unsullied Sea.”</p><br/><p>Zuo Mo’s mouth gaped after hearing this. What kind of person was this Grandmaster Shi Zi Ming that he had such terrifying power. Everyone behind him, including Tang Fei, had astounded expressions.</p><br/><p>Zuo Mo had been muddled about the strength levels of mo in the past, he knew them now. Every mo marshal was a powerful warlord. Any of them was someone strong enough to alter the power structure of the mo world. Even mo generals were lords of an region.</p><br/><p>Forty six mo generals that spent three years building a city for this person. If Tao Xing had not said it, Zuo Mo definitely would not believe it.</p><br/><p>Tao Xing’s expression was devout as he stared at Great Peace City with a thread of pride. “My ancestral master also participated in the construction of Great Peace City.”</p><br/><p>Zuo Mo finally could not suppress his confusion. He asked, “Who is this Grandmaster Shi Zi Ming? Why does he receive such reverence?”</p><br/><p>Tao Xing’s expression became reverent. “Us mo’s pursuit of power is like an instinct, we will do anything. But there are also some virtuous ones in our history who are not strong but have had unrivalled intelligence. They are able to see through everything and point straight to the mo heart. They are selfless and revered by tens of thousands of mo. Shi Zi Ming’s life can be considered a legend. He was found sentient at a very young age and learned better than most people. He himself did not have any martial ability, but his understanding of the core of power is something no one can rival. He roamed all over, and everywhere he went he would give talks to pass what he knew to others without asking anything in return. Those seven mo marshals and forty six mo generals had received his guidance. He resolved countless conflicts and spread his favour all over. He is revered by an innumerable number of people.”</p><br/><p>Zuo Mo had to admire this person. Able to teach mo marshals and generals, what level was he at?</p><br/><p>“Let’s walk and talk.” Tao Xing looked at everyone’s expressions and said with a smile. He walked first towards the Unsullied Sea. When he stepped on to the surface of the Unsullied sea, a black porpoise came out of the water and supported Tao Xing’s weight.</p><br/><p>Zuo Mo saw this and was very interested. He copied Tao Xing. As expected, another black porpoise supported him.</p><br/><p>“These are welcoming porpoises. Everyone, there is no need to be nervous,” Tao Xing hurriedly explained.</p><br/><p>Everyone stepped onto the surface of the sea and a crowd of porpoises instantly appeared to carry them towards Great Peace City. The black porpoises occasionally let out happy chirps.</p><br/><p>Tang Fei said seriously to Zuo Mo. “No matter how powerful Heng Battalion is, they will not dare to attack in Great Peace City. Up until now, no battalion has dared to fight in Great Peace City. However, you need to be careful. While Great Peace City does not permit battalions to fight, they do not stop individual fights. Because of the mo cultivation teachings that Shi Zi Ming passed down in the past, Great Peace City is a combative one. Those that refuse challenges from other people will be laughed at.”</p><br/><p>“So it is like that.” Zuo Mo nodded. Even though his battalion could not match others, he did not fear other people if it was one-on-one.</p><br/><p>Right now, he and Tao Xing were ants on the same string. Their glory and defeat were tied together. Zuo Mo suddenly asked, “Will there be mo marshals?”</p><br/><p>“No.” Tang Fei’s expression was strange.</p><br/><p>Did this guy think that the mo marshals were so idle they could lazy about everyday?</p><br/><p>She thought inside but she replied seriously, “There will be many general levels. Because the complete contents of what Shi Zi Ming had taught in the past is in the city, many mo generals that are stuck at a bottleneck would come here in search of a breakthrough.”</p><br/><p>“That’s good, that’s good.” Zuo Mo instantly felt much safer.</p><br/><p>Tang Fei did not say anything but she felt extremely awkward. She hadn’t expected Zuo Mo to be so confident that he did not care about the other mo generals.</p><br/><p>However, she did not have any intentions of urging Zuo Mo to be careful. She wanted Zuo Mo to trip up. Great Peace City was full of strong people. It had been decades since one faction had dominated.</p><br/><p>The black porpoises were very fast but even so, they had swam for four whole hours before they reached the gates of Great Peace City.</p><br/><p>Arriving at Great Peace City, the tall soaring walls cast a shadow that covered them like a black cloud. They caused people to feel their own significance. Zuo Mo raised his head. He was uncertain just how tall the walls were.</p><br/><p>The porpoise carried Zuo Mo to a group of stone stairs. The stairs moved up towards the gates.</p><br/><p>Zuo Mo piggy-backed A Gui and jumped up the stone stairs. The black porpoise chirped happily before diving back down into the Unsullied Sea. The group followed Zuo Mo closely and occasionally sighed, Tang Fei included. It was her first time at Great Peace City.</p><br/><p>Stepping up past the stone stairs, the area spread out flat in front of them. A space that was thousands of zhang in radius was flat as though it was cut from one piece of stone. It was extremely smooth and all kinds of complex and beautiful mo matrixes that were carved into the ground were like a grand carpet that spread into the distance. Such vast grandeur astounded everyone. Even Zuo Mo was speechless. Looking at such exquisitely carved mo matrixes, everyone almost didn’t bear to step on them.</p><br/><p>So grand! Extremely grand!</p><br/><p>Sighing as they walked past the city gates, it was as though they walked into a completely different world. A wave of loud noise came at them.</p><br/><p>Everyone’s heart relaxed. The vast acquisitiveness at the gates almost suffocated them and the familiar scenes in front of them jerked them back to their original world. Their minds relaxed.</p><br/><p>The streets were very wide, hundreds of zhang wide and could hold large-scale mo steeds. It was possible to see mo riding mo steeds of all kinds of strange appearances. The mo themselves were also had different appearances. Some had horns, others four legs, some had wings. It dazzled Zuo Mo’s eyes and stirred his curiosity.</p><br/><p>But Zuo Mo quickly felt scared. In this short amount of time, he had found at least six brigadier mo. Great Peace City was, as said, filled with experts!</p><br/><p>Brigadier ranks were the core power of a battalion. Their skill level was directly related to the strength of the battalion. In those more remote jie, brigadiers were even able to rule a small region. Naturally, brigadier level was not something that Zuo Mo would sigh in wonder about, but he had found six brigadiers on the street. Then how great and terrifying was the number of brigadier mo here in the city?</p><br/><p>Up until now, he had not noticed even one general rank. But this was enough to raise his wariness.</p><br/><p>Tao Xing seemed to noticed Zuo Mo’s shock and said in low voice, “Do not be rash. The structure of powers in Great Peace City is very complex. Any mo here could have a great faction behind it. If you offend too many factions, you might not even know how you died. Even though Great Peace City does not permit assassinations, how is it possible to stop something that occurs in the shadows? Do not be rash!”</p><br/><p>Tao Xing had lived in Great Peace City for a time when he was young and was familiar with everything. This time, he felt danger when he had been attacked by the green yaksha on the road. Now that he entered Great Peace City, he felt much safer. There were many experts in Great Peace City and also many factions that would be willing to give him face.</p><br/><p>The only thing he worried about was Zuo Mo. He had spent a long time in Great Peace City and seen countless youth that had been left bloodied by Great Peace City. These young geniuses were filled with pride and did not know how deep the waters in Great Peace City flowed.</p><br/><p>Right now, he was stuck together with Zuo Mo. If Zuo Mo provoked trouble, he would not be able to avoid it. He also owed Zuo Mo a lot of mo embryos.</p><br/><p>Thinking about these mo embryos, he wanted to go back to Endless City immediately and pay back his debts as early as possible.</p><br/><p>At this moment, a ruckus sounded.</p><br/><p>An enormous troop walked proudly at the center of the road. They were all blue dragon rhinoceros that were three zhang in height. Their bodies were covered in thick, shield-like scales. Their steps were extremely heavy and with every step, the ground trembled.</p><br/><p>The entire troop rumbled and caused the ground to shake.</p><br/><p>A bald large man sat on top of the blue dragon rhinoceros at the very front. He was extremely well-built and his skin was a strange faint blue that contained black patterns. His face was in a snarl, the small eyes flashing viciously. Sitting on top of the blue dragon rhinoceros, his body sway with the steps of the blue dragon rhinoceros.</p><br/><p>Noticing Zuo Mo’s gaze, Tao Xing glanced and quickly recognized the other. “It should be the Lan Family from Luo Jie. They are one of the branches of the dragon mo and natural born fighters. The most outstanding of the younger generation is Lan Tian Long and Liang Rong. This one should be Lan Tian Long … …”</p><br/><p>Zuo Mo’s eyes narrowed slightly. He was very familiar with Lan Tian Long’s presence. General level! This was the first general level he encountered in Great Peace City!</p><br/><p>This place was filled with experts. Zuo Mo’s heart shuddered. The other did not disguise his presence at all. A vicious and domineering presence spread out without any restraint.</p><br/><p>Just that presence was enough for Zuo Mo to judge the other’s power was not weaker than his.</p><br/><p>Zuo Mo’s gaze swept past Lan Tian Long and he looked further away. Suddenly, his pupils shrank and his body froze.</p><br/><p>He didn’t hear one word of what Tao Xing said next.</p><br/><p>Zuo Mo stared hard at the back of a blue dragon rhinoceros, his body as tense as steel!</p><br/><p>Translator Ramblings: Mo history in the time after Pu Yao and Wei is an interesting one. Also, Lil’ Cliffy is here.</p><br/>\n</div>"}