{"title": "Chapter Five Hundred and Seventy – Causes and Consequences", "id": 620, "volume": 7, "url": "http://boxnovel.org/world-of-cultivation-chapter-five-hundred-and-seventy-%E2%80%93-causes-and-consequences", "volume_title": "Volume 7", "body": "<h1>Chapter Five Hundred and Seventy – Causes and Consequences</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Five Hundred and Seventy – Causes and Consequences</p><br/><p>Luo Li’s voice was deep as he recollected the events, as though he was sleep-talking.</p><br/><p>“The chaos rift appeared and the mo battalions invaded. They came so suddenly we did not have the time to flee. Bright Wave Jie started to gather all the major sects. The ones in charge were some people from Kun Lun and they were very strong. The sect leader and the shishu were all called over and put on the front line!”</p><br/><p>Zuo Mo punched the floor and shattered stone flew. His fist became deeply embedded in the flooring. His features were twisted and vicious. Even though everyone had separated, but the shishu had all been good to him and, in their own way, taken care of him. Zuo Mo had command battalions and he knew that the front line was the most dangerous place. It was also where the fighting was most intense. Not many could survive.</p><br/><p>There were only two types of people that would be sent to the front lines, one was elite troops, the other was cannon fodder.</p><br/><p>“Ever since Eldest Shixiong disappeared from the sword cave, many groups of people from Kun Lun came to ask the sect leader about the sword cave. One time, the argument became intense and Xin Shishu almost drew his sword. After that, our sect’s position started to decline in Bright Wave Jie. Other sects started to antagonize us. The disciples started to leave.”</p><br/><p>Luo Li’s gaze was empty and unfocused.</p><br/><p>“The sect leader felt very depressed but the other shishu were alright. The disciples from before the expansion did not leave since days would be the same no matter where they spent it. Later on when the nearby sects came to antagonize us, Xin Shishu beat them away. No one cared too much. Was there a place that did not have conflict? It was at this time when the chaos rifts opened and the mo battalion came.”</p><br/><p>“Kun Lun came and wanted the shishu to go to the front lines. The sect leader did not agree and said that Fourth Shigu was not strong offensively and wanted her to remain behind. Kun Lun did not agree. They surrounded the sect. Fourth Shigu eventually agreed but requested for the disciples to be kept in the rear. Kun Lun agreed.”</p><br/><p>Luo Li’s expression suddenly became twisted.</p><br/><p>“But who knew when the sect leader and others left, Kun Lun’s people put jinzhi on us. They said it was to prevent us from betraying them. On the road, we were attacked by a troop of mo. The people from Kun Lun forced us to go to delay the mo, otherwise, they would activate the jinzhi killing us. We could only listen and go, and then the Kun Lun people turned and ran abandoning us. Some of us died and some were wounded, the rest were captured. As a slave, I passed through the hands of several people before this mo.”</p><br/><p>“Kun Lun!” Zuo Mo squeezed out the two words from his teeth, his eyes bloodshot. He had never thought that Kun Lun would do something this low.</p><br/><p>“After Eldest Shixiong disappeared, Sect Leader was very distraught impacted and his hair turned white overnight. From then on, the sect leader started to talk about many things with me. Second Shixiong, Lin Qian always suspected that you were yaomo and mentioned something about Stars in Daytime. The sect leader had heard some rumors and deliberately did not search and have you come back. Sect Leader said, he had picked you up and brought you back, if you really are … … then it is this was better than handing you over to Kun Lun … …”</p><br/><p>Hearing this, Zuo Mo’s tears could not be suppressed anymore and flowed down his check. The thread of resentment that had been inside disappeared. Indescribable sorrow and regret welled up.</p><br/><p>Luo Li was sobbing.</p><br/><p>A moment later, Zuo Mo stopped his sorrow. He raised his head and asked, “What about the other shidi and shimei?”</p><br/><p>“I only know that Xiao Guo and Li Shimei are still alive. They were also captured. Shidi, you have to rescue them!” Luo Li grabbed onto Zuo Mo, his grey eyes filled with begging.</p><br/><p>Zuo Mo’s heart hurt and he unhesitatingly nodded. He said resolutely, “I will definitely rescue them!”</p><br/><p>He then asked, “Second Shixiong, do you know who bought them?”</p><br/><p>Luo Li lowered his head and thought for a moment before saying, “It is a female mo, she seems to be called Princess Xia.”</p><br/><p>“Princess Xia … …” Zuo Mo repeated a few times fearing he would forget.</p><br/><p>It seemed he had to go investigate who this Princess Xia was.</p><br/><p>Zuo Mo secretly cased a resting spell on Luo Li, causing Luo Li to felt his eyelids become heavy and quickly slipped into sleep. Zuo Mo inspected the wounds inside Luo Li’s body and his expression became terrible.</p><br/><p>The channels inside Luo Li’s body were shattered. It would be extremely difficult to heal such severe wounds.</p><br/><p>“Kun Lun!”</p><br/><p>Zuo Mo had never hated a sect so much before, never!</p><br/><p>———</p><br/><p>Ximen Ning drank his wine and listened to the report from his subordinate.</p><br/><p>“Boss, you have great foresight, Guard Camp really entered the Great Peace City!” The subordinate was admiring in his tone.</p><br/><p>“Haa haa, there aren’t enough people in Guard Camp. If they had some more people, they might fight Bu Heng. This group is not friendly, and their origins definitely are not simple,” Ximen Ning said with a slight smile.</p><br/><p>“A strong dragon cannot suppress the local snake. Even if they are strong, they can only eat dust,” A Qing’s voice came.</p><br/><p>“Haha, A Qing is right. Their origins will quickly be found. So many mo embryos, we probably are not the only ones interested. That will be fun to see when the time comes,” Ximen Ning said with a smile.</p><br/><p>“Only when the water is cloudy can we take advantage to steal fish,” A Qing inserted at the perfect time.</p><br/><p>Ximen Ning laughed.</p><br/><p>“When Guard Camp entered the city, they had a standoff with Lan Tian Long.” The subordinate hurriedly narrated the information he had obtained.</p><br/><p>“Lan Tian Long!” Ximen Ning’s brow creased.</p><br/><p>Ximen Ning was very familiar with Lan Tian Long and naturally knew of the other’s fiery temper. Lan Tian Long had not fought? This didn’t seem like Lan Tian Long’s usual style.</p><br/><p>The leader of Guard Camp definitely had some special trait. Otherwise, it was not possible to explain Lan Tian Long’s course of action.</p><br/><p>Was it strength? Or background?</p><br/><p>Ximen Ning pondered. It would be exaggerated to say that there was individual’s strength that Lan Tian Long would be wary of. He had researched. The leader of Guard Camp was a youth not yet twenty. Could such a young youth be more powerful than Lan Tian Long?</p><br/><p>He didn’t believe it!</p><br/><p>So the only way would be background! Lan Tian Long recognized the background of this person so he purposefully retreated. Ximen Ning felt this was the most plausible. He had fought against Lan Tian Long before and knew while this person had a fiery temper, he wasn’t simple-minded as people assumed.</p><br/><p>This speculation was supported by many details. For example, the strong Guard Camp was likely be the personal guard the young man’s family had sent to protect him.</p><br/><p>Background … … what was his background?</p><br/><p>At this time, another subordinate came in to report.</p><br/><p>“Boss, Bu Heng has entered the city!”</p><br/><p>Ximen Ning came out of his thoughts and laughed. “It has been very long since Great Peace City been so busy!”</p><br/><p>———</p><br/><p>“Is there some way to heal him?” Zuo Mo looked at Pu Yao and Wei.</p><br/><p>Pu Yao was silent, Wei did not make a sound.</p><br/><p>Zuo Mo instantly felt disappointed. When he agreed to rescue Xiao Guo and Li Ying Feng Shijie, he had seen the desire to die in Luo Li Shixiong’s eyes. Zuo Mo was clear. Under these circumstances, many people would lose the will to life. Their hearts were dead.</p><br/><p>Zuo Mo didn’t know how to persuade Luo Li. He could only use the resting spell to temporarily force the other to rest.</p><br/><p>Suddenly, Pu Yao spoke. “Maybe there is a solution. However, it is almost the same as death.”</p><br/><p>“What solution?” Zuo Mo was like a person drowning that grabbed the life-saving reed and hurriedly asked.</p><br/><p>Pu Yao slowly spoke, “On the battlefield in the past, I had found an incomplete spell from a xiuzhe. Read it and you will know.”</p><br/><p>Finished speaking, he threw a ball of light at Zuo Mo.</p><br/><p>Zuo Mo took the ball. After he read it, he finally understood what Pu Yao meant that it was not much different than death.</p><br/><p>This was a spell called [Life-Death Lock] that was incomplete. It was very extreme. Saying it was a spell was not accurate. In Zuo Mo’s view, this was just a daring theory. The spell was not complex, and was actually very simple.</p><br/><p>Enter the path through death!</p><br/><p>In this speculative chapter, it assumed that a person’s death was a process, like passing through layers of biscuits, one layer after the next. Only when one broke through the last layer was one truly dead.</p><br/><p>The person who wrote this assumed that while the upper layers were also death, it was only a fake death. A state of fake death could easily stimulate the instincts of a person. If one was able to slow down the speed at which they passed through these upper layers of death, and stimulate their potential so that their potential counterbalanced death. This required that the rate their potential increased surpassed the speed they passed through the layers of death, doing so they could totter on the edge of life and death, and completely express a person’s complete potential.</p><br/><p>After reading this, Zuo Mo had to admire the person who wrote this.</p><br/><p>Such a strange idea. It looked so absurd, but the author was able to explain what it meant. This person had also spent great effort to ponder how to stimulate one’s potential in the state of death to twist life and death.</p><br/><p>It was just as Pu Yao had said. This was not any different than death. The entire chapter was speculative. In the end, even the author did not believe this spell would work and stopped writing.</p><br/><p>Consequently, this spell was incomplete.</p><br/><p>Zuo Mo also hesitated. From every angle, [Life-Death Lock] was so absurd, but the phrases in the chapter swirled in his mind. They seemed to hold a strange power. Many of the ideas gave him great inspiration.</p><br/><p>He had a faint feeling that this [Life-Death Lock] was a wondrous spell.</p><br/><p>At this time, Luo Li slowly woke up.</p><br/><p>He opened his eyes. When he saw Zuo Mo, he forced a smile. His eyes were grey and empty, lifeless.</p><br/><p>Xiuzhe were powerful, but if their heart was dead, their vitality would flow away faster than normal people. Because their heart was the base of all their power.</p><br/><p>When Zuo Mo saw Luo Li’s eyes, he knew it was not good.</p><br/><p>“Shixiong wants to die?” Zuo Mo suddenly said.</p><br/><p>Luo Li was surprised but he nodded and said honestly, “I am nothing now, my channels are all broken, my dantian destroyed. Even the best ling medicine cannot heal me. I’m satisfied now that I am able to see Shidi. I do not have any left to connect me to this world. With this broken body, I will drag down Shidi. I will also feel life is boring and painful. Rather than suffering through that, death is an easy matter.”</p><br/><p>Zuo Mo stared hard at Luo Li’s eyes. He saw Luo Li’s expression was the same from beginning to end and knew the other was resolved.</p><br/><p>“Shixiong, do you not want revenge against Kun Lun? Do you not want to rescue Xiao Guo and Li Ying Feng Shijie?” Zuo Mo asked.</p><br/><p>“Shidi, do not … …” Luo Li grimaced.</p><br/><p>“I have a spell here. It is dangerous, but it may be your only hope.” At this time, Zuo Mo could only hope for the best and took out a jade scroll, [Life-Death Lock].</p><br/><p>Luo Li assumed that Zuo Mo was trying to persuade him but did not bear to reject his goodwill so he took it.</p><br/><p>After sweeping a glance, he froze!</p><br/><p>Translator Ramblings: About 300 chapters and it finally gets resolved! Foreshadowing for this was there but extremely hard to detect in the chapters.</p><br/>\n</div>"}