{"title": "Chapter Five Hundred and Eighty Six – A Strong Presence", "id": 636, "volume": 7, "url": "http://boxnovel.org/world-of-cultivation-chapter-five-hundred-and-eighty-six-%E2%80%93-a-strong-presence", "volume_title": "Volume 7", "body": "<h1>Chapter Five Hundred and Eighty Six – A Strong Presence</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Five Hundred and Eighty Six – A Strong Presence</p><br/><p>After their discussion A Zha Ge worriedly returned to the clan did not even have the time to report about this matter with Gongsun Cha before he was stunned by the bad news—Gongye Xiao Rong had taken over Black Stone Jie, Bi Shan and De Lei both were killed in battle.</p><br/><p>He almost thought he was hearing it wrong! After asking three times and still getting the same answer, he froze where he stood.</p><br/><p>In a flash, only A Zha Ge was left of the three great Strellar Rahula battle generals.</p><br/><p>A grieving atmosphere covered all of Orchid Home Jie. Bi Shan and De Lei had been the elite of the Rahula Clan. Now that their entire army had been killed, the Stellar Rahula Clan was greatly impacted.</p><br/><p>A Zha Ge who had froze for a long time felt cold, his face was pale.</p><br/><p>If Crow Stone Jie was taken over, the other could point their attack at Orchid Home Jie at any time. Crow Stone Jie and Orchid Home Jie had many jie rivers connecting them. It was easy to attack but hard to defend. The other could easily enter Orchid Home Jie. This meant that the enemy could appear at any time.</p><br/><p>A grieving A Zha Ge knew that the situation was running out of time. If the battalions of Tian Huan reached Orchid Home Jie, they would not be able to escape in time!</p><br/><p>With only A Zha Ge’s one battalion left, the Rahula Clan was not the other’s match.</p><br/><p>“Abandon anything heavy! Retreat from Orchid Home Jie at the fastest speed! Go towards White Stone Jie… …” A Zha Ge’s hurried voice echoed.</p><br/><p>Before he could finish, the alarmed voice of a scout interrupted A Zha Ge.</p><br/><p>“Daren! Enemy scouts have appeared near the jie river!”</p><br/><p>A Zha Ge’s face instantly turned grey. So fast! Looking at the old, weak, ill and crippled, A Zha Ge’s heart felt cold. Was today the day that the Stellar Rahula Clan would die?</p><br/><p>There was no time!</p><br/><p>The speed of the weak clan members would not outrun the enemy battalion. What also was hopeless was that Orchid Home Jie was completely flat and had no defensive structures. The other had greater numbers and he could not even delay them for any significant amount of time!</p><br/><p>Would he only be able to watch his clanspeople be killed? The hopeless and terrified gazes of his clan people deeply pierced and pained A Zha Ge’s heart.</p><br/><p>Just as the last thread inside almost faded, he suddenly thought of a person!</p><br/><p>A daring idea appeared in his mind.</p><br/><p>The time did not allow him to think. At this time, he was like a man drowning that grabbed at a life-saving reed!</p><br/><p>He didn’t hesitate, turning and flying furiously towards the chaos rift!</p><br/><p>———</p><br/><p>Gongsun Cha saw A Zha Ge return not long after he had left. He felt slightly surprised. When he had interacted with A Zha Ge these few times, he had a general understanding of the other’s personality. The other was decisive and resolute, someone that would not easily waver.</p><br/><p>When A Zha Ge saw Lil’ Miss, a conflicted expression came onto his face. But he gritted his teeth and knelt down with a bang. “My Stellar Rahula Clan is willing to serve under our king!”</p><br/><p>A Zha Ge’s words were very measured. What he submitted to was not Gongsun Cha but the king’s service. This way, no one could say anything.</p><br/><p>Gongsun Cha was slightly stunned. A Zha Ge’s move was too sudden. He didn’t believe a domineering presence could shock the other and have them submit. He naturally noticed what meaning the words “submitting to the king’s” service meant. But he did not care. What he wanted was Orchid Home Jie and this chaos rift.</p><br/><p>“A Zha Ge is willing to gift Orchid Home Jie and asks for nothing else except for Daren to protect the lineage of my Rahula Clan!” A Zha Ge said sorrowfully.</p><br/><p>Gongsun Cha did not immediately respond and asked in curiosity, “What is going on?”</p><br/><p>A Zha Ge was pressed for time but he knew if he did not clearly explain, the other definitely would not believe him. He pushed down his urgency and rapidly narrated the situation.</p><br/><p>Lil’ Miss was a smart person. When he finished listening to the situation, he knew what was going on.</p><br/><p>Orchid Home Jie was the best starting place they had found up until now. For this opportunity, Lil’ Miss had even fought with A Zha Ge. While Tian Huan’s Gongye Xiao Rong was famous, at this time Lil’ Miss showed his shocking decisiveness.</p><br/><p>He did not hesitate. “Depart!”</p><br/><p>Vermillion Bird Camp passed through the chaos rift at full speed and left for Orchid Home Jie.</p><br/><p>Flying at full speed, the wind blew across the bangs on Lil’ Miss’ forehead. The bashful and harmless face was now like a sword that was unsheathed, full of edges and murderousness!</p><br/><p>He did not fear Xuan Kong Temple, he also did not fear Tian Huan!</p><br/><p>They wanted to take food from his mouth?</p><br/><p>No one could do it!</p><br/><p>When Vermillion Bird Camp flew into the city of Stellar Rahula, they instantly caused a furor. Gongsun Cha did not hesitate and said to A Zha Ge. “Have them retreat towards the chaos rift!”</p><br/><p>A Zha Ge had a moved expression. He knew that Gongsun Cha’s words would save many members of his clan. He hurriedly sent a subordinate to give the order while he led his battalion to follow Vermillion Bird Camp.</p><br/><p>Gongsun Cha sent a message to the battalion that was standing guard in Middle Granary Jie and for them to settle these Stellar Rahula Clan members.</p><br/><p>At this time, A Zha Ge’s scout reported back.</p><br/><p>“The Tian Huan battalion has already crossed the jie river!”</p><br/><p>A Zha Ge looked at Lil’ Miss. Since he had submitted, he would naturally follow Lil’ Miss’ orders. Looking at the members of his clan that were retreating towards the chaos rift, A Zha Ge was content. Even if he were to die in battle today, he would not have any regrets!</p><br/><p>Since Gongsun Cha could tolerate the mo in Vermillion Bird Camp, he could naturally tolerate the Stellar Rahula Clan! Even if Lil’ Miss had him launch a suicide attack on the Tian Huan battalion, he would not hesitate.</p><br/><p>He looked at Lil’ Miss and waited for his order.</p><br/><p>A flash of insanity passed through Gongsun Cha’s eyes but his expression was indifferent as he said, “Go welcome them!”</p><br/><p>Vermillion Bird Camp and A Zha Ge’s battalion were like two floods that flew towards the jie river.</p><br/><p>Six hours later, they met the Tian Huan battalion.</p><br/><p>———</p><br/><p>Gongye Xiao Rong’s appearance was extremely average, one that would be hard to find in a crowd of people. He was wearing a nondescript light blue cloth robe. There was no ephemeral presence, no sharp killing energy. He was someone that was extremely plain and not like a cultivator at all.</p><br/><p>However, a group of battle generals that flashed with treasure light swarmed around him, and so his plain cloth robe became an unusual contrast.</p><br/><p>Yet it was this person that looked average and normal that took over Black Stone Jie and also killed two elite armies of the Stellar Rahula Clan.</p><br/><p>In terms of beauty, Gongye Xiao Rong’s fighting style was even better than Jiang Zhe taking over Cold Mountain Jie!</p><br/><p>“Hm, there are xiuzhe battalions here?” Gongye Xiao Rong was slightly surprised.</p><br/><p>He was not the only one. All the battle generals around him had shocked expressions but more of their expressions darked. In their eyes, Orchid Home Jie was like a mature peach. They had waited for a long time but now someone else had suddenly taken over it. Their mood could be imagined.</p><br/><p>“Send someone to ask where they are from,” Gongye Xiao Rong said interestedly.</p><br/><p>He could see that the Rahula Clan seemed to have surrendered to this xiuzhe battalion. Another battalion had taken over another jie? This was very unexpected. Up until now, only the four great sects had achieved victories. Now a battalion of unknown origins had come out halfway. How could he not be interested?</p><br/><p>A combat xiu flew out of the Tian Huan battalion.</p><br/><p>This combat xiu’s body flashed with all kinds of light and it could be seen from the talismans he had that they were of extraordinary grade. Tian Huan was skilled in seals, formations, and forging. In the field of talismans, they were the top of the four Realms.</p><br/><p>Under the shine of the treasure light, the combat xiu seemed of great bearing. Facing the two battalions, he did not show any fear. He looked down and said coldly, “Someone who can make decisions, come out and respond!”</p><br/><p>The other’s careless tone cause the people around Lil’ Miss to become angry. The other was so proud and rude.</p><br/><p>Gongsun Cha’s bashful face like that of the neighbor’s body had a faint smile. That pair of eyes that were as warm as sunlight flashed with killing intent and craziness. “Xie Shan, take his head!”</p><br/><p>Xie Shan had been waiting for this. He instantly turned into a sword light and shot at the other!</p><br/><p>He was very fast. A golden sword light suddenly appeared in front of the other!</p><br/><p>This combat xiuzhe just felt a dot of golden light suddenly show up in front of him and blinded him. Instantly, a cold sword essence locked onto him and his face immediately changed. He shouted loudly, “You dare … …”</p><br/><p>Panicked, the ling armor of the Tian Huan combat xiu lit up. Countless transparent seal scripts protected him.</p><br/><p>The gold light heavily hit the seal scripts!</p><br/><p>Bam!</p><br/><p>A crisp sound, the Tian Huan combat xiu’s expression changed slightly. The ling armor on his body had shattered with one blow! However, what reassured him was that the other’s blow had still been stopped!</p><br/><p>Yet before he could celebrate, a little tiny golden light flew out of the exploding ball of golden light and flashed directly across his neck!</p><br/><p>Like a knife cutting tofu!</p><br/><p>The head shot up and blood sprayed out in a pillar!</p><br/><p>That tiny golden light flashed and disappeared. Along with the bigger golden light, they returned to Xie Shan’s hands.</p><br/><p>Everyone finally saw that the flying swords in Xie Shan’s hands were a pair of golden flying swords, one big and one small.</p><br/><p>Paired Mirage Sword!</p><br/><p>The Tian Huan combat xiu were first stunned and then infuriated. The battle formation shifted and many combat xiu wanted to charge immediately out of anger.</p><br/><p>The smile on Lil’ Miss’ face grew, and his tone was as sharp as a blade, “Formation!”</p><br/><p>Vermillion Bird Camp’s battle formation silently changed. The combat xiu on the two flanks slid back multiple steps and the entire combat formation changed. Sharp killing intent radiated. It was like a wild beast whose body was arced forward slightly, waiting to pounce in a lightning attack!</p><br/><p>The Tian Huan battalion that had been shifting instantly quieted. They were an elite battalion that had been through many battles and were very sensitive to killing intent. They instantly detected the other battalion had locked onto them!</p><br/><p>If they continued to be restless, the battle formation would show flaws which the other would immediately attack!</p><br/><p>The restless combat xiu instantly calmed down. All of them started to prepare for battle.</p><br/><p>Gongye Xiao Rong’s face became dark. He narrowed his eyes. Only now did the presence he gave off turn into something that could not be concealed by this plain cloth robe.</p><br/><p>A strong feeling of suppression caused Gongye Xiao Rong to feel pressure.</p><br/><p>Professionals could detect if others had talent. The other just changed his formation slightly and Gongye Xiao Rong knew he had encountered a strong enemy.</p><br/><p>However, he still felt surprised by the other’s strong attitude and viciousness!</p><br/><p>There was no buffer in the entire process. It was so clean and crisp he smelled the scent of danger.</p><br/><p>Who were they?</p><br/><p>Translator Ramblings: Both battle generals have compound names so they aren’t from the same family. It would be funny if it was “Hey, Cousin!” *smile* “Fight me.”</p><br/>\n</div>"}