{"title": "Chapter Five Hundred and Eighty – Arcing Rainbow Battle Formation", "id": 630, "volume": 7, "url": "http://boxnovel.org/world-of-cultivation-chapter-five-hundred-and-eighty-%E2%80%93-arcing-rainbow-battle-formation", "volume_title": "Volume 7", "body": "<h1>Chapter Five Hundred and Eighty – Arcing Rainbow Battle Formation</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Five Hundred and Eighty – Arcing Rainbow Battle Formation</p><br/><p>There was a ball of light in each member of Black Turtle Camp’s hand. The colors were different and from afar, it seemed that many lanterns of different colors had been lit.</p><br/><p>But if one looked closely, they would find to their shock that these lanterns of different colors were arranged in layers, one over the other. There were more than thirty six layers that had formed an irregular curve.</p><br/><p>When Ma Fan’s shout of “Kill” sounded!</p><br/><p>All the xiuzhe in the outermost layer of troops unhesitatingly threw out the balls of light in their hands in unison.</p><br/><p>Woo!</p><br/><p>An arc of light that was like a rainbow suddenly flew out of the circular formation and headed towards the bodhisattva’s fire lotus.</p><br/><p>Woo woo woo!</p><br/><p>The howls sounded, and the arcs of light fit together in layers. They were densely packed and in a tenth of a breath, thirty six arcs of light were released!</p><br/><p>The color of each light arc was different. Thirty six colored arcs of different colors folded over each other and formed an even more varied rainbow!</p><br/><p>Arcing Rainbow Battle Formation!</p><br/><p>This was the defensive formation that Ma Fan had created for Black Turtle Camp. For this formation, he had spent a great deal of time, spending extreme amounts of effort and made countless trips to Golden Crow Camp!</p><br/><p>The moment this blinding rainbow arc formed, unprecedented excitement spread into every fibre of Ma Fan’s muscles. His body uncontrollably trembled.</p><br/><p>Everyone could not attend to their rest. They unconsciously stopped breathing.</p><br/><p>No one would know how much they had suffered to train this battle formation to completion or how much punishment they had endured! Each person, from Ma Fan to the newest combat xiu of the camp had repeatedly practiced!</p><br/><p>That blinding beautiful rainbow was just as difficult to form as it was beautiful.</p><br/><p>Thirty six arcs of light. If one of them was incorrectly formed, it would mess up the other arcs of light and disperse the light in a burst of fireworks that had no effect.</p><br/><p>The bodhisattva seemed to feel danger. It gave a sky-shaking howl, his hands holding up the lotus and smashing it down!</p><br/><p>The rainbow was like a wind that swept across the sky and silently appeared in front of the bodhisattva.</p><br/><p>The fresh red flame!</p><br/><p>The blindingly beautiful rainbow!</p><br/><p>The two collided.</p><br/><p>The light that was produced pierced the world but none of the jindan xiuzhe blinked. They stared with wide eyes, afraid to miss a single detail!</p><br/><p>The first light arc shattered!</p><br/><p>The second light arc shattered!</p><br/><p>The tenth light arc cracked!</p><br/><p>The eleventh light arc cracked!</p><br/><p>The eighteen arc of light stopped the fire losuu!</p><br/><p>The Rage Lotus Bodhisattva shouted angrily, throwing himself into the fire lotus. The fire lotus exploded!</p><br/><p>Breaking the arc of light!</p><br/><p>The twenty third arc of light!</p><br/><p>The fire lotus seemed to now be planted on this arc of light, as if it was grown there as decoration. No matter now it moved, the arc of light did not budge.</p><br/><p>Boom!</p><br/><p>The fire lotus suddenly exploded. The blinding red light suddenly lit up in a patch of burning white light. Even the jindan had to close their eyes!</p><br/><p>The twenty fourth layer shattered! The twenty fifth layer shattered!</p><br/><p>The twenty seventh layer held and did not retreat a sliver. The rampaging waves of hot air flowed along the curved surface of the arcs and vented towards the two sides.</p><br/><p>The jindan under Feng Yue’s command had pale faces. The strong backlash from their failed attack had instantly wounded them. Some xiuzhe of lower cultivation spat out blood and fell forward. Their teammates hurriedly grabbed hold of them. However, the faces of these xiuzhe were red from overexertion. They clearly would not be able to survive.</p><br/><p>But no one cared about this. Everyone was staring at that arc of light that seemed gossamer thin with dazed expressions!</p><br/><p>It had been … … it had been stopped … …</p><br/><p>How, how was it possible … …</p><br/><p>How could the Bodhisattva’s Raging Lotus be stopped?</p><br/><p>Feng Yue looked dazedly at that beautiful rainbow air, her face filled with disbelief. No one knew better than she did the power of the Bodhisattva’s Raging Lotus. She believed that even the other three great sects could not so easily stop the Bodhisattva’s Raging Lotus!</p><br/><p>This had been stopped … …</p><br/><p>After staring dazedly for a few breaths, Feng Yue suddenly reacted and her face paled. The Bodhisattva’s Raging Lotus was powerful, but it had a weakness. It was too fierce. If it was stopped, it easily caused severe backlash.</p><br/><p>But because it was usually unstoppable, this flaw was not usually remembered.</p><br/><p>Until now!</p><br/><p>This weakness exposed. Feng Yue looked around and felt even worse. About half of the combat xiu were wounded. For the first time, she stared at the other side as though she just met them. She almost bit through her lips.</p><br/><p>An unknown battalion, from an unknown jie… …</p><br/><p>Even now, she did not know what the other battalion was called. But a battalion like this had stopped the Bodhisattva’s Raging Lotus Battle Formation that shook all of the Four Realms!</p><br/><p>She stared hard at the other as though she wanted to imprint them in her mind.</p><br/><p>———</p><br/><p>“Hahahaha! I just knew! I just knew! What’s there to be afraid of!” Lei Peng’s loud voice could be heard from a distance. His expression was tired but he was very excited.</p><br/><p>Nian Lu also had a big smile on his face. His handsome face looked now like that of a child.</p><br/><p>Excitement was on Ma Fan’s face but he could not manage to say a word. He was too excited, really too excited, unprecedentedly excited!</p><br/><p>The Arcing Rainbow Battle Formation was his masterpiece!</p><br/><p>He knew that he was not an outstanding battle general, but since Lil’ Miss Daren had given him control of Black Turtle Camp, he could never fail the other’s hopes. The xiuzhe of different types, the various spells, he had used shocking patience to slowly merge them into one.</p><br/><p>There were no complex tactics, but an astounding number of micro-tactics.</p><br/><p>He might have thought of the Arcing Rainbow Battle Formation but the one who perfected it was Golden Crow Camp.</p><br/><p>He knew his own limits.</p><br/><p>He knew that Black Turtle Camp, based on their composition, would not be able to fight offensively and dominate like Vermillion Bird Camp; what he had trained Black Turtle Camp for were battles of attrition and defense.</p><br/><p>He slowly pulled and pushed this Black Turtle Camp together by the skin of his teeth.</p><br/><p>There was nothing that could excite him, the creator, more than having Black Turtle Camp show its power.</p><br/><p>But at this time, he suppressed the excitement inside. He observed the other side. When he saw the other side’s low morale and wounded xiuzhe, he instantly sighed in relief.</p><br/><p>This was the debut battle of the Arcing Rainbow Battle Formation. Everyone, including him, did not hold anything back in reserve. Right now, they were pretty much at the end of their rope.</p><br/><p>Fortunately, both sides were close to exhaustion!</p><br/><p>———</p><br/><p>The two troops strangely held the standoff.</p><br/><p>Both sides had the same plan. They were waiting for the reinforcements from their fellows.</p><br/><p>In Ma Fan’s mind, Vermillion Bird Camp was invincible. If Vermillion Bird Camp came, they could kill this battalion even if it was double this size. In Feng Yue’s mind, Gao Xuan was leading five hundred members of the Jiangzi Battalion, the core battalion of Xuan Kong Temple! Even if the enemy battalion was multiple times this size, five hundred Jiangzi Battalion members could kill them all!</p><br/><p>Suddenly, Ma Fan and Feng Yue showed expressions of joy at the same time.</p><br/><p>Almost at the same time, two battalions appeared behind their respective fellows.</p><br/><p>Vermillion Bird Camp!</p><br/><p>Jiangzi Battalion!</p><br/><p>———</p><br/><p>Lil’ Miss’ gaze swept the battlefield and instantly gleaned a general idea of the situation. He gave Ma Fan a look of praise.</p><br/><p>But when his gaze landed on the other battalion, his gaze suddenly turned icy and his smile grew.</p><br/><p>When he found that there were only five hundred people in the reinforcements, Lil’ Miss’ pride came. “Wei Ran!”</p><br/><p>“This subordinate is here!” Wei Ran hurriedly said.</p><br/><p>“Pick five hundred and go meet them!” Lil’ Miss’ smile was like a flower, his voice filled with pride and iciness.</p><br/><p>“Yes!” Wei Ran’s expression was normal as he responded.</p><br/><p>A battalion of five hundred people quickly separated out of Vermillion Bird Camp.</p><br/><p>———</p><br/><p>When Gao Xuan looked at he unharmed Feng Yue, he instantly sighed in relief. But when he looked closely, he was shocked.</p><br/><p>It seemed that Feng Yue had suffered a significant loss!</p><br/><p>Their morale was low and almost half of the combat xiu were injured.</p><br/><p>Narrowing his eyes, coldness flashed through Gao Xuan’s eyes. When had Xuan Kong Temple ever lost so severely?</p><br/><p>He did not say anything. The entire troop flowed into position front of Feng Yue’s battalion like mercury. His expression was normal and steady as he stared at the other side. There was no change in expression.</p><br/><p>But when he noticed a battalion of approximately the same size approach their ranks, his gaze suddenly turned sharp!</p><br/><p>Even as composed as he was, he couldn’t help but feel slight anger.</p><br/><p>When had Jiangzi Battalion been disrespected so?</p><br/><p>The Jiangzi Battalion always fought with less against many. They could fly in and out among enemies multiple times their number and they were unstoppable!</p><br/><p>When had the enemy used the same number of people to fight Jiangzi Battalion?</p><br/><p>Those ignorant had no fear!</p><br/><p>Gao Xuan’s heart was cold and murderousness spread.</p><br/><p>———</p><br/><p>Wei Ran looked calmly at the other side.</p><br/><p>He was one of the commanders that had followed Lil’ Miss for the longest time. Unlike Ma Fan, he did not show great talent in the beginning, but following Lil’ Miss he had learned as he fought in battle, his talent as a battle general was like the jade encased in stone that was gradually exposed.</p><br/><p>Lil’ Miss’ judgment of him was that he had the style of a great general.</p><br/><p>Of course, with Lil’ Miss’ crazy personality, he couldn’t help but feel Wei Ran was slightly gentle, but this did not affect Wei Ran’s position in Vermillion Bird Camp.</p><br/><p>Wei Ran had participated from start to finish in establishing the new tactical plan.</p><br/><p>Even though he could not compare to Lil’ Miss that understood xiuzhe, yao, and mo, other than Lil’ Miss no one understood the new tactics better than he did.</p><br/><p>Also … …</p><br/><p>His gaze landed on Ma Fan and he couldn’t help but feel a thread of admiration.</p><br/><p>For any battle general, being able to create a battalion based on their own fighting style was an unparalleled temptation.</p><br/><p>Wei Ran moved his gaze away.</p><br/><p>He looked towards the enemy. He could see that the other’s troop was the elite of elite but without knowing it, the fighting spirit burning inside him and boiled his blood.</p><br/><p>The fighting spirit in his eyes was no disguised any longer!</p><br/><p>This battle, he had to</p><br/><p>–win!</p><br/><p>Translator Ramblings: Ma Fan has really worked hard. But he isn’t the only one that wants to get promoted.</p><br/>\n</div>"}