{"title": "Chapter Seven Hundred and Six – The Mysterious Old Man", "id": 656, "volume": 7, "url": "http://boxnovel.org/world-of-cultivation-chapter-seven-hundred-and-six-%E2%80%93-the-mysterious-old-man", "volume_title": "Volume 7", "body": "<h1>Chapter Seven Hundred and Six – The Mysterious Old Man</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Seven Hundred and Six – The Mysterious Old Man</p><br/><p>“Put this matter to the side,” Tang Chen said coolly after listening to the guard head’s report.</p><br/><p>“Patriarch … …” the guard leader could not stop himself from saying. Head’s expression was indifferent as though this matter had nothing todo with him.</p><br/><p>Tang Chen glanced at his subordinate and said casually, “After this is over, it is alright for you to kill everyone in the market, but before this, no one is allowed to offend Xiao Yun Hai. Remember, no one!”</p><br/><p>The guard leader’s heart shook. Patriarch was an authoritative person, but he never spoke gravely. However, his authority was unquestionable. It was the first time he had such a harsh expression! The guard leader was both shocked and scared. There was also a thread of relief. It was fortunate that he had been the one hit. Otherwise, his head … …</p><br/><p>“Leave,” Tang Chen said.</p><br/><p>“Yes!” The guard leader shrunk his head and retreated.</p><br/><p>When there were only two people left in the room, Tang Chen spoke with a frown, “How did the yao envoys get involved?”</p><br/><p>Head shook his head and said gravely, “It does not seem intentional.”</p><br/><p>“Unintentional?” Tang Chen thought for a moment before saying, “We cannot be careless. It is a pity that we were not able to discover the strength of Xiao Yun Hai’s mute servant.”</p><br/><p>“Unfathomable.” A look flashed through Head’s eyes. “He wasn’t able to fight back at all.”</p><br/><p>If the guard leader was here, he would be gaping in shock. When he had been thrown out by A Gui, Head hadn’t just been passing by in coincidence, but had seen the entire process.</p><br/><p>“Were you able to discover their origins?” Tang Chen asked, “Is she similar to one of the two women with Xiao Mo Ge?”</p><br/><p>“I could not see it.” Head said, “She is similar in style to the purple energy woman with Xiao Mo Ge, but she does not have purple energies. Also … …”</p><br/><p>He stopped.</p><br/><p>“Also what?” Tang Chen’s eyes flashed as he asked urgently.</p><br/><p>“The feeling she gives me is even more dangerous!” When Head said this, he unconsciously balled his fists, tendons bulging.</p><br/><p>Tang Chen’s expression changed.</p><br/><p>Head was his faithful and strongest expert. What Tang Chen trusted the most was his strength. Head cultivated the [Something from Nothing Spear], a top spear type mo skill. If it wasn’t for the chance encounter where Tang Chen had saved Head’s life, he definitely would not have been able to recruit such an expert.</p><br/><p>Head’s strength could rival those top experts that had just risen to marshal level.</p><br/><p>He was one of the trump cards in his hand.</p><br/><p>Tang Chen had deliberately arranged what had happened today. He was still full of suspicion about Xiao Yun Hai’s identity, but he hadn’t expected the conclusion they reached to be so surprising.</p><br/><p>Head looked like a rough man, but being capable of cultivating the [Something From Nothingness Spear] meant his intuition was unusually sharp. If he said it was more dangerous, there was only one cause. The mute servant of Xiao Yun Hai was even stronger than the Xiao Mo Ge’s purple energy female!</p><br/><p>That wasn’t possible!</p><br/><p>All of the mo territories knew that Xiao Mo Ge’s purple energy woman cultivated shen power.</p><br/><p>A daring idea suddenly rose in Tang Chen’s mind.</p><br/><p>–Did Xiao Yun Hai’s mute servant also cultivate shen power?</p><br/><p>He shook his head. Shen power was not so easy to obtain. He changed the subject. “Have you found the use of the White Ridge Snake Bones?”</p><br/><p>“The White Ridge Snake Bones can be used to forge mo weapons.”</p><br/><p>“That’s not right!” Tang Chen shook his head. “Xiao Yun Hai’s other female servant has been in seclusion ever since they obtained the White Ridge Snake Bones. The news we found from Rare Artifacts Hall was that Xiao Yun Hai only decided to buy the White Ridge Snake Bones because of this female servant in seclusion. The White Ridge Snake Bones definitely has an unknown use and is related to the seclusion of his female servant. Keep investigating!”</p><br/><p>———</p><br/><p>In the void, A Gui sat silently. The purple chains passed through her body. These purple chains were much thicker than the last time that had Zuo Mo saw them, and the light had become more understated.</p><br/><p>Exquisite black patterns had grown on the chains that were closest to her.</p><br/><p>Her eyes were closed, and there was a serene and content smile on her face.</p><br/><p>The Nether Reincarnation Lotus was extraordinary in effect. Her soul had not withered and grown even more condensed.</p><br/><p>In this last while, she had continued to use her soul to nurture the Undying Shen power. The Undying Shen power was even stronger than before, and had changed as a result. The most visible effect was that the energy was not bright, and was now contained inside.</p><br/><p>The stronger Undying Shen power restrained her even more completely.</p><br/><p>There was no light, no sound, no smell in this void of nothingness.</p><br/><p>This hopeless and insane void did not defeat this seemingly fragile young female.</p><br/><p>Since the time that her soul received nurturing, she knew that it was definitely Young Master that had helped her. Her serene heart had told her long ago that she was with Young Master. But the dots of light in the void made her suddenly realize–</p><br/><p>–She wasn’t just with Young Master. Young Master was working hard to save her.</p><br/><p>There was nothing that would motivate this young female more than this.</p><br/><p>Ever since then, there was always a warm sunny smile on her face.</p><br/><p>Maybe Young Master could see her.</p><br/><p>She wanted to use her smile to tell Young Master it wasn’t painful at all, wasn’t uncomfortable at all.</p><br/><p>Every bit of pain was the growth of shen power! Shen power growing stronger meant she was able to protect Young master!</p><br/><p>She was very happy.</p><br/><p>Under the bright smile, something was imperceptibly taking form inside her soul.</p><br/><p>———</p><br/><p>A Heng woke up from his meditation and his restless heart finally stilled.</p><br/><p>Just as he had expected, the Tang Family had a close relationship with Marshal Di. Every time he requested to meet with Tang Chen, the servants would politely tell him the patriarch was busy and not present.</p><br/><p>A Heng understood what this meant.</p><br/><p>Before this, while Tang Chen had been ambiguous about an alliance, he had been polite to the Ji Family. But his attitude was clear now.</p><br/><p>A Heng knew the alliance would not occur.</p><br/><p>The new orders from his family patriarch also came to him.</p><br/><p>There were two orders: Damage the alliance between the Tang Family and Marshal Di, assassinate Xiao Yun Hai but do not let the Tang Family suspect the Ji Family!</p><br/><p>Looking at the orders from the patriarch, A Heng grimaced. Any of the two was almost impossible to complete. The Tang Family and Marshal Di probably had allied together a long time ago, but people just didn’t know about it. It also wasn’t simple to kill Xiao Yun Hai. The fight that had occurred at the market during the day had reached his ears a long time ago.</p><br/><p>Xiao Yun Hai’s mute servant’s strength was unfathomable, and an extremely powerful young female yao had also came out along the way. She had been able to fight to a tie with the head guard of the Tang Family, her strength … …</p><br/><p>Where female sidekicks starting come into style in the world?</p><br/><p>Xiao Mo Ge was like that, Xiao Yun Hai was the same, but had even more, three of them!</p><br/><p>Suddenly, A Heng’s mind moved. His expression darkened. “Who!”</p><br/><p>Before he finished speaking, his figure slowly became faint.</p><br/><p>At the same time, A Heng appeared outside his room. There was a paper gripped in his hand. His face was dark. Even now, his afterimage in the room had not disappeared.</p><br/><p>So fast!</p><br/><p>A Heng was astounded. From discovery to attack, the other had disappeared without a trace. The understood that the only reason he had sensed the intruder was that deliberate on the other’s part.</p><br/><p>This thought caused his bones to shiver.</p><br/><p>This also meant that if the other tried to sneak an attack on him, he probably would not be able to avoid it.</p><br/><p>The person was incomprehensibly strong.</p><br/><p>Also, what did the other want? He looked in puzzlement at the paper and a joyful light quickly came into his eyes.</p><br/><p>Tian Huan!</p><br/><p>He hadn’t thought that there would be disciples from Tian Huan in Gongzi Xi’s group! He hadn’t thought that Marshal Di had a secret relationship with Tian Huan!</p><br/><p>A Heng almost wanted to roar with laughter.</p><br/><p>Ever since Xiao Mo Ge appeared, the general trend of events suggested that the yao, mo, and xiu were merging together. Xiao Mo Ge was a mo, and no one thought there was anything wrong for him to have xiuzhe under his command. They would feel proud that Xiao Mo Ge were able to conquer xiuzhe.</p><br/><p>Some of the wiser factions could see that the merging of the three would be unstoppable, but among the people, this was not common. The hatred between yaomo, and xiuzhe would not be resolved so easily.</p><br/><p>In A Heng’s view, the alliance of Marshal Di and Tian Huan was a great move.</p><br/><p>But things like this could not be made public. Everyone could only have unspoken agreements in secret. Otherwise when people discovered this, just the spit was enough to drown Marshal Di.</p><br/><p>A cruel smile floated onto A Heng’s lips.</p><br/><p>What he held in his hand was a fatal weapon!</p><br/><p>———</p><br/><p>Zuo Mo in disguise felt proud as he sneaked through the darkness.</p><br/><p>The Ji Family wasn’t a good one, but they had the power to make things difficult for Tian Huan. Even if they used just their toes, Zuo Mo knew that the Ji Family could destroy the alliance with what they had now.</p><br/><p>Let the dogs fight themselves!</p><br/><p>Zuo Mo lacked good feelings about these people.</p><br/><p>After doing this devious thing, Zuo Mo felt unspeakably comfortable. In such a good state, forging mo weapons would be easy!</p><br/><p>At this time, Zuo Mo suddenly stilled and his smugness disappeared. He was like a wild beast that felt danger and immediately entered his battle state.</p><br/><p>In the corner of the street, a figure slowly appeared.</p><br/><p>“Your wariness isn’t bad.”</p><br/><p>The incomer praised. His figure was revealed in front of Zuo Mo. An old man dressed in rags like a homeless man. His face was heavily wrinkled, his eyes muddy, and he had no presence.</p><br/><p>But Zuo Mo did not dare to underestimate the other.</p><br/><p>The old man stood there casually but he seemed to be one with the darkness around him.</p><br/><p>Zuo Mo had never seen such a synchrony from other people, even in those so called concealment experts.</p><br/><p>“Who are you?” Zuo Mo asked.</p><br/><p>The old man looked with interest in Zuo Mo. He grinned. “You can call me Old Man.” Then he said in a familiar tone, “Your disguise isn’t bad. Oh, your sun shen power isn’t bad. You really have good luck to have obtained the inheritance from the Sun Shen Tribe. Not bad at all.”</p><br/><p>“Who are you?” Zuo Mo was astounded. The other clearly knew that he was Xiao Mo Ge, and even discovered the shen power he cultivated with a glance!</p><br/><p>The old man grinned to show a mouth of yellowed and missing teeth. “Haha, young person, you have to be patient. Hm, where’s your maid?”</p><br/><p>The murderousness in Zuo Mo’s eyes were as sharp as swords!</p><br/><p>Translator Ramblings: And Zuo Mo’s streak ends at one.</p><br/>\n</div>"}