{"title": "Chapter Seven Hundred and Fifteen – The Monarch of Mo Weapons", "id": 665, "volume": 7, "url": "http://boxnovel.org/world-of-cultivation-chapter-seven-hundred-and-fifteen-%E2%80%93-the-monarch-of-mo-weapons", "volume_title": "Volume 7", "body": "<h1>Chapter Seven Hundred and Fifteen – The Monarch of Mo Weapons</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Seven Hundred and Fifteen – The Monarch of Mo Weapons</p><br/><p>Cui An looked warily around. He found there were four people close in strength to him in this group of people. Those flickering gazes were filled with faint danger and great wariness.</p><br/><p>It was crowded inside the sky shark. The sky shark that used to transport only a few hundred people now was forced to hold over two thousand and twenty people. The overcrowding could be imagined.</p><br/><p>However, no one dared to complain. This was a sky shark that had been temporarily added to the route. There were more than three hundred sky sharks like this. All of them had one destination, Bu Zhou City. Yet even with the addition of three hundred sky sharks and their massive carrying capacity was not able to satisfy the crazy flow of people.</p><br/><p>Each sky shark was filled to capacity with people. All the privileges of the private yards and first class residences were revoked. Each corner was filled with people. But even in such terrible conditions, people still paid twice the usual cost for a ticket.</p><br/><p>Cui An had good luck. He had bought a shark ticket using a connection from his friend to board this sky shark.</p><br/><p>Many more people had to travel day and night, on small mo steeds, over mountains and rivers to head to Bu Zhou City. They formed groups like herds of ants that moved towards Bu Zhou City tirelessly.</p><br/><p>The present mo territories was boiling because of a miracle.</p><br/><p>Four earth mo weapons and a super mo weapon of unclear grade had been created, Grandmaster Xiao Yun Hai had astounded the world!</p><br/><p>News of this incomprehensible miracle immediately spread to every corner of the mo territories. Before this, no mo weapon grandmaster had been able to forge two earth mo weapons at once, never!</p><br/><p>Four earth mo weapons!</p><br/><p>Yes, four earth mo weapons. All four of them had been examined by Rare Artifacts Hall and they were all earth mo weapons of great quality. After obtaining the agreement of the grandmaster, Rare Artifacts Hall immediately publicized the detailed descriptions of these four earth mo weapons. In a brief amount of time, the information spread to the rest of the world like lightning.</p><br/><p>The information on these four earth mo weapons were made public was like pouring hot water into a pot of boiling oil.</p><br/><p>[Iceblood Three Hound Seat] was comprised of three mo weapons: a sabre, a sword, and a shield. This was a very rare set. The sabre and the sword were both long and narrow. The sabre was dark red, and its channels flowed like rivers. The sword was icy blue, sharp, and transparent like a sword made from crystalline ice. The shield was an buckler shield. It was completely black and had five irregularly placed stars on it.</p><br/><p>[Blue Horsefly] was the only long range weapon among the four mo weapons. It was a blood spear, and had a tassel made from twelve ice blue crystals. What was even more wondrous was the body of the spear. The crimson red spear seemed to be soaked in fresh blood, yet when one gripped the spear, they would find that the body was made from countless minuscule flows of blood. These blood colored flows would shift slightly as though they were alive.</p><br/><p>[Dark Clear Li Chakrams] were a pair of larger and smaller chakrams. The large one was dark gold, and had a fiery pattern. When it was held in the hand, it was like holding a ball of fire. The smaller chakram was snowy white and covered in faint patterns of the moon, almost weightless in the hand. When the two chakrams were placed close together, they would attract each other and slowly spin.</p><br/><p>[Thirteen Pillars] was a pair of whips, each with thirteen links. The pair of whips were extremely heavy. With every flick of the whip, thunder and wind would sound. When the two whips danced together, it could cause thunder to manifest in the sky. If one was to nurture them in storm clouds, they would become even more powerful. This was an extremely rare earth mo weapon with great power.</p><br/><p>All four earth mo weapons were first class. When Rare Artifacts Hall publicized them, the other mo weapon masters started to judge them, but everyone of them placed them in the top fifty of earth mo weapons.</p><br/><p>Other than the Mo Weapon Master association which put all four earth mo weapons at the very bottom.</p><br/><p>However, no one paid attention to the Mo Weapon Master Association’s assessment. Everyone thought of the promise that Xiao Yun Hai had given before. One Reverse Shadow Soul Silkgrass could be used to trade for an earth mo weapon!</p><br/><p>Many people beat their chests and stomped their feet. Why didn’t they believe this before? Right now, on the black market, the price of a Reverse Shadow Soul Silkgrass had risen to a ridiculous level, and there was no supply.</p><br/><p>Cui An had Reverse Shadow Soul Silkgrass!</p><br/><p>He was just a half-step away from marshal level. Owning an earth mo weapon was something that he had dreamed about. Even if he became a marshal, obtaining one would take a very long time. But no matter which method he tried, he hadn’t managed to obtain an earth mo weapon. Every earth mo weapon was treasured by their master, and would not be easily given to others.</p><br/><p>So when he had heard Xiao Yun Hai’s promise, he didn’t believe it, but he had held some hope. He tried his best to get a Reverse Shadow Soul Silkgrass.</p><br/><p>When the four earth mo weapons came into the world, he became excited and immediately started to head for Bu Zhou City.</p><br/><p>On the road, he was extremely careful especially when he found there were others that were close in power to him. These people were mostly mo like Cui An that were on their own. They were not dragged down by their families nor did they rely on any faction.</p><br/><p>They had strong desires for earth mo weapons. Usually, earth mo weapons were bought out by the major factions, and they would not go onto the market. They never had any chances.</p><br/><p>For them, Bu Zhou City was a one in a thousand chance!</p><br/><p>Cui An couldn’t help but become nervous. Among those travelling with him, would the four that were close in power to him also have Reverse Shadow Soul Silkgrass?</p><br/><p>For experts of his level, other than earth mo weapons, they would be able to obtain other treasures if they tried, like the Reverse Shadow Soul SIlkgrass.</p><br/><p>Cui An laughed inwardly. He hadn’t thought that there would be a day that he would feel nervous. He had always felt that he would be able to calmly face whatever happened. He hadn’t thought that he would lose his calm today.</p><br/><p>But, in the end, he was a strong mo. His mind was strong and he quickly adjusted.</p><br/><p>Having quieted the restlessness in his heart, Cui An was immediately listened in on the exchange between the surrounding mo weapon masters.</p><br/><p>“Grandmaster Xiao Yun Hai is definitely the best grandmaster of this era! No, he is the best grandmaster of all time!” A mo weapon master dressed in blue robes said with an excited expression.</p><br/><p>Strangely, no one objected to his words.</p><br/><p>“It really … … is really too astounding!” another mo weapon master couldn’t help but say. When he said this, there was incredulity mixed on his face with shock and reverence. It was a complicated expression.</p><br/><p>Everyone had discussed this title many times in the recent while. They were not the only ones. Right now, all of the mo territories couldn’t wait to present the title of best mo weapon grandmaster to Xiao Yun Hai.</p><br/><p>Other than the strong objections from the Mo Weapon Master Association, no one else felt that this was sudden and inappropriate. Even many people inside the Mo Weapon Master Association agreed, but due to the stern attitudes of the grandmasters leading them, they didn’t dare to publicly state their opinions.</p><br/><p>But more and more factions supported this, thusly more and more commentary would use appellations of respect such as “the greatest mo weapon grandmaster” or “the grandmaster of grandmasters” when they discussed Xiao Yun Hai.</p><br/><p>They no longer said that he didn’t know his limits, they no longer said that he was arrogant, they no longer said that he was boasting.</p><br/><p>Countless people departed for Bu Zhou City to see this grandmaster that had come out of nowhere and was so strong he could defeat any grandmaster in history, the strongest grandmaster!</p><br/><p>He was like the undoubted monarch of mo weapon masters!</p><br/><p>All the mo weapon masters in each mo jie moved as the news spread. They came from all areas to see this mo weapon monarch that had never appeared in history before.</p><br/><p>“And that super mo weapon, why didn’t Rare Artifacts Hall publicize its information?” The blue-robed mo weapon master had a heated gaze of reverence. He said heatedly, “Surpassing earth mo weapons, then isn’t it a sky mo weapon?”</p><br/><p>“It’s not a sky mo weapon.” A grey-robed youth with a grave expression suddenly spoke. When he spoke, everyone else quieted. He said calmly, “I studied the mirage of the mo weapons coming out. That super mo weapon should be the complete set of body armor with wings that Grandmaster was wearing.”</p><br/><p>The grey-robed youth was the most knowledgeable and skilled mo weapon master among this group, the others deeply respected them.</p><br/><p>Even the enthusiastic blue-robed youth believed the grey-robed youth’s judgement. He said in puzzlement, “What is it if it is not a sky mo weapon?”</p><br/><p>“I don’t know either,” the grey-robed youth shook his head and said, “I am going to the Mo Weapon Holy Pool to look. I might be able to find some clues.”</p><br/><p>“Yes, yes! We have to see the Mo Weapon Holy Pool!” Everyone nodded.</p><br/><p>Cui An heard this and couldn’t resist saying, “Sorry to disturb everyone, what is this Mo Weapon Holy Pool?” He had never heard of a mo weapon holy pool.</p><br/><p>The blue-robed youth replied first, “The mo weapon pool where Grandmaster Xiao Yun Hai forged the mo weapons! You don’t know? This mo weapon pool has given birth to four earth mo weapons and that super mo weapon. For some unknown reason, the mo weapon pool has completely crystallized, and all of Grandmaster’s preparations have been perfectly preserved. A few days ago, Grandmaster had ordered to allow the public to view the holy pool.”</p><br/><p>Cui An finally understood.</p><br/><p>Another mo weapon master said emotionally, “I would even crawl to Bu Zhou City for the opportunity to see the holy pool!”</p><br/><p>Cui An immediately recognize a serious problem. “Doesn’t this mean that more and more people will come to Bu Zhou City?”</p><br/><p>The grey-robed youth glanced at Cui An and said coolly, “No mo weapon master will pass on this chance. Barring any accidents, the holy pool will become the holy ground for mo weapon masters!”</p><br/><p>The other people nodded with similar expressions.</p><br/><p>Cui An’s grimace became even more bitter.</p><br/><p>———</p><br/><p>In a tightly guarded secret room underground.</p><br/><p>“This is still unable to be assessed.” The middle-aged mo shook his head. He had a grimace. His tone was admiring and amazed. This was the sixth time he had gathered various appraisers to judge this unique mo armor. But none were able to determine or guess at its level. These appraisers were all experienced. Each of them had at least twenty years of working experience.</p><br/><p>But even with so many assessors, they were unable to determine the general level. For this, they had fought countless times, slapped the table, swore at each other, and even fought. However, they were still unable to give an assessment.</p><br/><p>But they were strangely in agreement on one point, it definitely wasn’t a sky mo weapon!</p><br/><p>Or rather, it was completely different than any other sky mo weapon in history.</p><br/><p>Every appraiser couldn’t bear to allow their gaze to leave this breathtakingly beautiful set of mo armor. It really was too beautiful! It had many wondrous and incomprehensible parts. These wondrous traits were different than any mo weapon that these appraisers had seen before.</p><br/><p>What really was this?</p><br/><p>All of their puzzled gazes focused on Zuo Mo.</p><br/><p>Translator Ramblins: What Frankenstein’s monster did you make, Zuo Mo?!</p><br/>\n</div>"}