{"title": "Chapter Seven Hundred and Forty Nine – Starting From the Beginning", "id": 699, "volume": 7, "url": "http://boxnovel.org/world-of-cultivation-chapter-seven-hundred-and-forty-nine-%E2%80%93-starting-from-the-beginning", "volume_title": "Volume 7", "body": "<h1>Chapter Seven Hundred and Forty Nine – Starting From the Beginning</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Seven Hundred and Forty Nine – Starting From the Beginning</p><br/><p>Zuo Mo had desired Hundred Energy Jie since discovering the shen crystals.</p><br/><p>In these past years, Zuo Mo had continued to send in spies to find the general location of the shen crystal mine. However, the shen crystal veins were hidden well and hard to quietly extract. Also, it was blocked off by a layer of fragmented star metal. This was also why the shen crystals hadn’t been found and harvested by others after many years.</p><br/><p>Hundred Energy Jie was under the rule of the Mo Marshal Alliance. If he wanted to extract these shen crystals, there was only one way, take Hundred Energy Jie.</p><br/><p>The Mo Marshal Alliance had developed rapidly in the recent years. The mo marshals, led by Marshal Di, were wealthy to start with. Each person that could reach marshal level was a strong individual. Ever since they watched the battle between Zuo Mo and the yao elders, they had a new understanding of shen power.</p><br/><p>Most of them chose to go into seclusion to cultivate and create a shen power that belonged to their clan.</p><br/><p>The mo were varied with subtypes and each clan possessed their unique bloodline. Unlike the shen power of the Mo Shen Temple, the Mo Marshal Alliance focused on upgrading their bloodline, using the mo physique as a base to obtain shen power.</p><br/><p>This shen power cultivation method quickly became the mainstream for the mo territories. Its greatest advantage was that it could express the power of the mo physique and one did not need to restart their cultivation from the beginning. The Heroes Alliance also chose to use this cultivation method.</p><br/><p>Because of the differences in mo physique, the shen methodologies they each used were different. Each family knew that shen methodologies were crucially important to their clan’s future, and gathered all of their strength to overcome this obstacle.</p><br/><p>This kind of shen power was called mo shen power.</p><br/><p>The Mo Shen Temple who was advanced in shen power actually became the exception. This, however, did not affect the status of the Mo Shen Temple. The three great mo gods were unstoppable in the recent years, their territory expanding rapidly to become the strongest faction in Hundred Savage Realm.</p><br/><p>The strong Mo Marshal Alliance did not cause them to feel fear. Once Zuo Mo determined the target, the battle generals, led by Gongsun Cha and Bie Han, started to move.</p><br/><p>A plan around the goal of taking over Hundred Energy Jie secretly took form.</p><br/><p>———</p><br/><p>Pu Pu’s Home For Battle Generals had some fame among the yao battle generals. The students performed outstandingly in war chess, even defeating several of the military battle generals in succession which had caused its fame to rise.</p><br/><p>However, not many people cared. Even the active battle generals that had been defeated did not think too much of the defeat. No matter how realistic war chess was, there were still great differences between war chess and true battle. It was not strange for a battle general strong in war chess to be terrible in real combat.</p><br/><p>There were also many loose organizations like this among the yao. The members that Pu Pu’s Home for Battle Generals took in were those battle generals who were not very strong. These people had average marks in the yao art houses, some of them just barely managing to pass.</p><br/><p>Students like this usually had a hard time entering a battalion. If one did not have a strong background, they would need great talent to enter a battalion.</p><br/><p>Pu Pu’s Home for Battle Generals were relaxed in their management of their members. It was easy to enter, and effortless to leave. Naturally, no one would pay attention to an organization like this.</p><br/><p>The most famous member of Pu Pu’s Home For Battle Generals was Liang Wei.</p><br/><p>But no battalion had thrown a olive branch out to this disgraced battle general. The one who had relieved him of command was Corp Command An Shi. Someone who had real power in the military and his experience among all of the yao was at the top. His background was strong, and no one was willing to risk offending Corp Commander An Shi to recruit Liang Wei into their command.</p><br/><p>Liang Wei also liked to fight and had a wild personality. He looked like a troublemaker, and there were rarely people who wanted a troublemaker under their command.</p><br/><p>Liang Wei had been idle at home for seven years, and no battalion had made any offer for him.</p><br/><p>The laughter and taunts against Liang Wei grew in more unrestrained. The reputation that Pu Pu’s Home For Battle Generals had among the battle general circle of being the “Failure Camp” grew and solidified.</p><br/><p>The battle generals that thought themselves strong disdained this place. Ever since some active battle generals were defeated, no one liked to come here. There was nothing worthy of praise if they won, but if they lost, their comrades would laugh at them for a long time.</p><br/><p>Affected, many irresolute students left. The students left were all those that were not affected by the rumors outside.</p><br/><p>Compared to the mockery outside, the students inside Pu Pu’s Home for Battle Generals were unusually quiet.</p><br/><p>These students, for the most part, had studied for more than three years at Pu Pu’s Home for Battle Generals.</p><br/><p>The great majority of them had their own jobs, and would only have the time to come at night. If they could not enter a battalion, then it was not easy for battle general students to find work.</p><br/><p>What interested them the most was the simulation match each week.</p><br/><p>Even now, they did not know the identity of Pu Pu’s Home for Battle Generals’ founder. However, they could clearly feel that the other was strong.</p><br/><p>This kind of feeling was especially strong during the simulation match. When this time came, Pu Pu would personally come.</p><br/><p>The simulation chess was even more realistic than war chess. Every student who attended the simulation chess match for the first time was astonished but they would be quickly sucked in.</p><br/><p>The strange and variable tactical style and the unfathomable power of the person called Pu Pu made them feel hopeless each time. Every week, the hottest topic of discussion was how long someone could survive against Pu Pu’s hand.</p><br/><p>The record holder had always been Liang Wei.</p><br/><p>Today was the same as usual. Liang Wei still struggled to endure under the other’s barrage of attacks. Even though he was already used to the strength of the opponent, but every match, that unstoppable pressure made him feel suffocated.</p><br/><p>The only thing comforting was that he had started to be able to tolerate this feeling of suffocation.</p><br/><p>Complete defeat!</p><br/><p>He panted furiously and was soaked in sweat. He looked at the time and was slightly happy. Compared to last time, he had survived a half hour longer than before.</p><br/><p>He was preparing to leave the simulation chess like usual when Pu Pu, standing on the opposite side, suddenly spoke.</p><br/><p>“The simulation chess is unable to help you improve any more.”</p><br/><p>Liang Wei stilled. He stopped walking. The thread of joy from his achievement immediately disappeared without a trace. He suddenly felt empty. In these years, coming to Pu Pu’s Home for Battle Generals every day had almost become a habit. His mind had only stopped being restless because he could feel he was continuously improving.</p><br/><p>If Pu Pu’s Home for Battle Generals could not make him improve any further and he did not have to come here, then where should he go?</p><br/><p>Other than fighting, he didn’t know anything else. If he hadn’t had accumulated savings in the early years, it would be a problem for him to even live.</p><br/><p>When Pu Pu said this place could not improve here, in that moment, he felt clueless and bewildered.</p><br/><p>But he was a battle general that had been tempered in blood and fire. His resolve was far stronger than normal people.</p><br/><p>He focused and asked, “Then what can make me improve?”</p><br/><p>“True battle.”</p><br/><p>Liang Wei dimmed. Gradually, his lips turned in a grimace. He knew that Pu Pu was right. While he had never seen Pu Pu’s true appearance, he was still filled with respect towards Pu Pu. He was unlike the other students, he had seen the world and had fought against many strong people. Pu Pu was the strongest battle general he had ever seen!</p><br/><p>He could not understand what such a great battle general was doing here within a small battle general school.</p><br/><p>He concluded that Pu Pu might be in a situation similar to himself. Either he was disliked by his superior officer or he was being isolated by his peers, or there were other reasons that he started this battle general school to waste away time.</p><br/><p>“Where is there true battle?” Liang Wei smiled in self-mockery.</p><br/><p>“If you are willing, I can think of a way. However, the conditions will be harsh, you need to be mentally prepared,” Pu Pu said.</p><br/><p>Liang Wei was really stunned this time. A moment later, he asked suspiciously. “You really have a way?”</p><br/><p>“You are very talented, but if you keep on being wasted, you will never have any hope of entering the ranks of the true top battle generals.” Pu Pu’s voice seemed to come from a far away but hit Liang Wei’s fragile heart.</p><br/><p>Liang Wei suddenly raised his head. “Who are you really?”</p><br/><p>“Do you really care who I am? You only care if you can enter the battlefield again! You only care if you can get revenge! As long as I am not Kun Lun, will you care about anything else?” Pu Yao asked in response.</p><br/><p>Liang Wei’s body shook slightly. “You investigated me?”</p><br/><p>“You? With your past is it even an investigation?” Pu Yao continued to ask in response.</p><br/><p>Liang Wei was silent. While not everyone knew of his history, but there were innumerable people among the battle general circles that knew.</p><br/><p>“What do you want me to do?” Liang Wei asked in a deep voice.</p><br/><p>“Do what you are most skilled at,” Pu Pu answered.</p><br/><p>“Which battalion?” Liang Wei felt as though something was burning inside his body. The flames burned at his heart, and the temperature of his blood continued to rise.</p><br/><p>“A group of rabble, they only have completed basic training.” Pu Pu didn’t change at all.</p><br/><p>Liang Wei was slightly disappointed.</p><br/><p>“Hrmph, did you really think that a trained battalion would be given to you? It seems that you do not have a deep enough understanding of your situation. If you want to return to the battlefield, you have to start over from the beginning.” Pu Pu was not polite.</p><br/><p>Liang Wei nodded. “You are right.”</p><br/><p>“Also, only a battalion that you built with your own hands will be a battalion that truly belongs to you. All of your ideas can be realized through them. You will be the leader of the battalion.”</p><br/><p>Liang Wei felt there was an indescribable temptation in Pu Pu’s words. In a few short sentences, his heart was moved, and he felt that burning once again.</p><br/><p>This guy was a true demon!</p><br/><p>“Alright!” Liang Wei nodded and then asked, “You are sure we will fight against Kun Lun?”</p><br/><p>“Do not worry about this, we are mortal enemies with Kun Lun.” Pu’s voice was also filled with pleasure.</p><br/><p>“Starting from the beginning, I need some helpers.” Liang Wei had already started to consider the practicalities.</p><br/><p>“You can pick anyone from Pu Pu’s Home for Battle Generals. You should now their strength. Give a list to me, and I will persuade them,” Pu Pu said.</p><br/><p>Liang Wei’s confidence increased. There were some outstanding students. More importantly, everyone was familiar with each other, they had built trust with each other and this would spare a lot of trouble in the future.</p><br/><p>A battalion built with these people as the framework, it really made one anticipate!</p><br/><p>“Alright, I need to go back and think. I will give the list to you tomorrow.” Liang Wei felt as though he couldn’t wait.</p><br/><p>“No problem.” Pu Pu’s response was brisk.</p><br/><p>When the other students found Liang Wei as he came out of the simulation chess, they were all shocked. The Liang Wei in front of them seemed to be a completely different person, giving off endless fighting spirit and sharp edges.</p><br/><p>Translator Ramblings: Pu Yao, luring people with training and then making them work for him.</p><br/>\n</div>"}