{"title": "Chapter Seven Hundred and Forty Three – Strategy", "id": 693, "volume": 7, "url": "http://boxnovel.org/world-of-cultivation-chapter-seven-hundred-and-forty-three-%E2%80%93-strategy", "volume_title": "Volume 7", "body": "<h1>Chapter Seven Hundred and Forty Three – Strategy</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Seven Hundred and Forty Three – Strategy</p><br/><p>Feng Xin Zi’s explosion was unexpected to all.</p><br/><p>His shen power that had shot up several levels immediately caused his presence to be filled with an intimidating danger. Terrifying shen pressure caused the suffocating black clouds to once again press on everyone’s minds.</p><br/><p>A hint of joy flashed across Ming Yue Ye’s eyes. She had seen Feng Xin Zi’s potential. In the Council of Elders that was full of experts, other than potential and youth, Feng Xin Zi did not have any advantages. Even so, she hadn’t expected Feng Xin Zi would give her a surprise.</p><br/><p>Zuo Mo also was slightly surprised. The shen power that Feng Xin Zi just displayed was not strong, but it was the most detailed of everyone he had seen.</p><br/><p>The records had mentioned this kind of situation before. It was rare, like an epiphany. However, the difference was one was when a person was in an excited state, and the other in a calm state.</p><br/><p>However … …</p><br/><p>He turned his gaze back to Elder Ye in front of him.</p><br/><p>The old man was more of a threat than Feng Xin Zi. As to Feng Xin Zi, there would be people to deal with him. As he expected, he saw Ceng Lian’er appear like a ghost near Feng Xin Zi.</p><br/><p>Listening to the hateful old man howling about killing him, Zuo Mo’s murderousness rose.</p><br/><p>You want to kill ge on ge’s territory?</p><br/><p>You’re tired of living!</p><br/><p>Little Mo Ge had disliked the overbearing Yao Council of Elders for a long time, they were endlessly arrogant. The small-minded Little Mo Ge could not tolerate someone more arrogant than he was in front of him.</p><br/><p>You think that if there isn’t the King’s Forbidden City, ge can’t do anything to you? Zuo Mo smirked darkly inside. He put away the dim Little Mo Treasure Cup, and then put out something black. It was the happily sleeping Black Gold Seal Soldier.</p><br/><p>“Glutton! Come out!”</p><br/><p>Bam bam bam bam bam!</p><br/><p>Zuo Mo kicked repeatedly, the sound of his foot hitting metal hard causing people’s hearts to feel cold. The Black Gold Seal Soldier opened his eyes in bewilderment and seemed to sleep-talk. “Big Bro, is it meal time?”</p><br/><p>“Meal time?” Zuo Mo smiled temptingly. “Yes, we are preparing to eat! But this old man has come to interrupt and won’t let us leave!”</p><br/><p>“He’s interrupting our meal time?” The Black Gold Seal Soldier’s eyes turned red, his expression murderous and snarling. He suddenly turned around and his howl echoed in people’s ears as though he had seen his archenemy. “He! Dares! To! Interrupt! Mealtime!”</p><br/><p>The Black Gold Seal Soldier murderously climbed up, his four limbs on the ground, his body slightly crouched like a panther as he shot out!</p><br/><p>Little Mo Ge showed a smile at his plan’s success. Pia, he snapped his fingers and shouted smugly at A Gui. “A Gui, let’s go!”</p><br/><p>A Gui’s figure suddenly disappeared.</p><br/><p>At the same time, Zuo Mo shot at the shocked Elder Ye!</p><br/><p>“Big Brother, he really is the peerlessly heroic Xiao Mo Ge that you spoke of?” Shuang Yu had to turn his face to not look and weakly asked Gu Liang Dao.</p><br/><p>Three against one, so shameless, so devious, so low … …</p><br/><p>This completely upended Shuang Yu’s innocent view of the world. Wasn’t this things that bad people would do?</p><br/><p>Even more shameless because Xiao Mo Ge was actually of the same strength as Elder Ye, yet he still ganged up … …</p><br/><p>Shuang Yu suddenly felt that yao elder was pitiful … … really pitiful … …</p><br/><p>Gu Liang Dao also couldn’t bear to look. He was a heroic person and never did something like bully the old and the young. He coughed to disguise the awkwardness on his face as he thought furiously. “Ah ah ah, this really is a kind of strategy, more fighting less, this is a law of battle. Right right right, it definitely is like that … … look, the yao have more people, in terms of total number, Xiao Mo Ge is the less fighting the more. He is attacking the crowd alone, such outstanding combat instincts … …”</p><br/><p>“But … … but … …” Shuang Yu felt that Big Brother was right but also felt that it wasn’t right somewhere.</p><br/><p>“No matter the time, do not miss the importance of strategy!” Gu Liang Dao sternly warned Shuang Yu.</p><br/><p>“Oh.” Shuang Yu said in semi-understanding.</p><br/><p>The other yao elders, upon finding that Elder Ye was about to be attack by multiple people, could not suppress themselves also acted in hopes of helping Elder Ye.</p><br/><p>Gu Liang Dao was relieved of a great burden. He said, “Look, fighting with few against many!”</p><br/><p>Shuang Yu’s eyes suddenly lit up. “Should we help him?”</p><br/><p>Gu Liang Dao coughed. “Do not underestimate Xiao Mo Ge. With my understanding of him, he definitely has other tricks.”</p><br/><p>Shuang Yu nodded, and looked with anticipation at the intense battle on the field, excitement on his face.</p><br/><p>Gu Liang Dao wiped away the sweat on his forehead with lingering trepidation.</p><br/><p>Of course Zuo Mo noticed the yao elders that wanted to attack. A cold smile appeared at the corner of his mouth. You underestimate gei’s King’s Forbidden City!</p><br/><p>The seal scripts and mo matrices’s effects were greatly influenced by the Black Blunting Smoke.</p><br/><p>But that was the [King’s Forbidden Firmament]. This green city possessed its power. While it was not complete, and its power was limited, it still could not be looked down upon.</p><br/><p>There at least wasn’t a problem in getting a chance for him to surround and attack!</p><br/><p>His hands moving, the shaking of the King’s Forbidden City suddenly stopped. All the yao elders suddenly felt the scenery change, their surroundings turning misty. All of the sounds and people disappeared.</p><br/><p>They seemed to be standing on an endless wilderness, light mist floating ethereally.</p><br/><p>Illusory formation?</p><br/><p>The two words jumped into everyone’s minds.</p><br/><p>Yes, it was an illusory formation!</p><br/><p>Many of the yao elders showed expressions of disdain. For people of their level, illusory formations were not an acceptable tactic.</p><br/><p>But unexpectedly, they used all they knew but the scene in front of them still didn’t change.</p><br/><p>Why was it like this?</p><br/><p>Was this not an illusory formation? The elders stared at each other.</p><br/><p>Zuo Mo naturally would not miss on such a good chance. The two people and the seal soldier shot at Elder Ye. The illusions of the city had many jinzhi methods that he had found from his memories, the ones his father had left behind. These illusory spells were not the same as other illusory spells. He believed there would be people here that could resolve them but they would require some time.</p><br/><p>This was a chance.</p><br/><p>Elder Ye was disheveled as he was attacked by three people. Xiao Mo Ge’s power had shocked him, and he hadn’t expected the female dressed in grey armor to be so terrifying and powerful. Adding on a seal soldier that was fearless and seemed mad, he immediately ended up in great danger.</p><br/><p>Elder Ye’s heart continued to sink.</p><br/><p>Damn it!</p><br/><p>Was he going to die today?</p><br/><p>The Black Gold Seal Soldier’s eyes were wide as he spread his arms and ran towards Elder Ye. This unconventional action caused Elder Ye’s heart to shake. His left hand struck towards the Black Gold Seal Soldier. But before he finished, the presence of a shen technique on Zuo Mo’s hand caused him unable to spare any attention for anything else. He put the fingers on his right hand together, his shen technique waiting to be released, shen technique against shen technique!</p><br/><p>Yet Xiao Mo Ge suddenly showed the smile of one whose plan had succeeded. Elder Ye’s expression changed and he thought that it was not good. Before he could react, there was a heavy blow to his neck. He immediately lost consciousness.</p><br/><p>“Idiot!” Zuo Mo smugly raised his hand that had been faking presence, the light of the shen technique fading.</p><br/><p>Boom boom boom!</p><br/><p>Among a string of packed explosion, the yao elders showed their disheveled figures yet the scene in front of them caused everyone to turn into the stone.</p><br/><p>Zuo Mo had a foot stepping on the unconscious Elder Ye. He smugly grinned and showed his white teeth.</p><br/><p>“I think we need to have a talk!”</p><br/><p>Bie Han came back.</p><br/><p>After coming back, Bie Han and Gongsun Cha exchanged a look but didn’t exchange a word.</p><br/><p>Many people speculated secretly about the return of Sin Battalion. But Little Miss and Bie Han did not mention a word about what Sin Battalion had gone to do.</p><br/><p>The two biggest heads were silent, and the other people naturally did not dare to pick this topic.</p><br/><p>But the return of Sin Battalion meant that their power grew. Everyone was excited. Up until now, all of the battle plans had proceeded smoothly. However, everyone also knew that this was just the beginning. What was next was the true test because what was next were the resources jies.</p><br/><p>Resource jies were referring to those jie with great amounts of resources. They were the best part of all of Xuan Kong Temple. Due to this, there were countless eyes staring at them.</p><br/><p>There were no tricks to taking down these resource jie. The only way was to steal from the mouth of the tiger. The upcoming battles would be hard and intense. The number of battalions they had encountered in the last few days had increased greatly.</p><br/><p>But no one was afraid. All of them were rubbing their hands and yearning to go.</p><br/><p>The present Mo Cloud Sea was not famous but had many commanders. Other than the two top battle generals Gongsun Cha and Bie Han, Miao Jun, Shu Long, Wei Ran, A Zha GE, Tang Fei and the others were all battle generals that could control one area.</p><br/><p>It was these people that had continued to advance that gave Gongsun Cha the confidence to plan this astounding campaign.</p><br/><p>Behind them, Gongsun Cha’s seal formation forts were being built day and night. They were mostly finished. This meant that they did not have to worry about the supply lines at the rear.</p><br/><p>The conference this time was the last collective conference.</p><br/><p>Gongsun Cha did not say much. Up until now, they had not encountered true trouble in the plans they had made before. In the following battle, most of the forces were about to be split up, and the battalions would advance on their own.</p><br/><p>The time to test these people have arrived. Gongsun Cha had an imperceptible smile.</p><br/><p>When he had designed this plan, he had thoughts of giving these people the chance to be independent. If they were always under his shadow, they would not be able to truly grow. For the mission this time, he had even called Ma Fan over.</p><br/><p>The best training ground for a battle general was the battlefield. While this campaign was crucial for Mo Cloud Sea, it did not mean that they couldn’t afford to lose even one battle. Gongsun Cha also knew that this campaign would become a crucial campaign that would affect the Four Realms and even the world.</p><br/><p>After dividing up Xuan Kong Temple, Kun Lu and Tian Huan would be unprecedentedly large. There would be a period of peace in the middle because Kun Lun and Tian Huan needed time to digest the fruits of victory. Once the two titans finished digesting, the days of the other factions would become hard.</p><br/><p>Due to this, their only chance of survival was to strengthen themselves before that. Also, having this batch of battle generals truly grow up was the crux to having Mo Cloud Sea grow strong. The present situation was not so dangerous. With him and Bie Han, they could afford to lose. When it finally came to that time when they faced the two titans, they could not afford to lose.</p><br/><p>He only hoped that Shixiong would return soon.</p><br/><p>Gongsun Cha gathered his thoughts and threw out coolly.</p><br/><p>“Everyone, fight!”</p><br/><p>The commanders roared a response.</p><br/><p>Translator Ramblings:WanderingGummiOfDoom is away for this chapter so I only did a quick edit for spelling.</p><br/>\n</div>"}