{"title": "Chapter Seven Hundred and Forty Seven – The Last Straw", "id": 697, "volume": 7, "url": "http://boxnovel.org/world-of-cultivation-chapter-seven-hundred-and-forty-seven-%E2%80%93-the-last-straw", "volume_title": "Volume 7", "body": "<h1>Chapter Seven Hundred and Forty Seven – The Last Straw</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Seven Hundred and Forty Seven – The Last Straw</p><br/><p>The stairs stretched deep down as though there was no end into the darkness. The walls on all sides were engraved with all kinds of seal scripts. Some had already started to crumble. It was clear that they were ancient.</p><br/><p>Flying down along the stone stairs, they had been moving for more than four hours but still could not see the end of the stairs.</p><br/><p>“Sect Leader … …” the elder at the front murmured anxiously. It was unusually clear in the deathly silence and caused everyone else to jump in fright. Some of the less courageous elders changed expressions minutely and showed slight terror.</p><br/><p>“What?” the sect leader did not stop. A hint of disdain floated at the corner of his lips. “You’re afraid?”</p><br/><p>The elders were silent. No one made a sound.</p><br/><p>“There’s no way around it even if you are afraid. Do you know what the outside says about us? Ha, us Xi Xuan are the second Xuan Kong Temple. The Xi Xuan Trio, tsk tsk, but none of them are in Xi Xuan. The outside says that I am useless, that is right. However, you all know the situation of the sect better than anyone. Who forced Gu Liang Dao into a corner? I said we needed to win over Shuang Yu. Hmph, the result? No one would bear to spit out some meat.”</p><br/><p>The sect leader’s cold and sharp words echoed in the passageway. The elders faces turned black and white, no one made a sound.</p><br/><p>“The battalions are in your hands. The battle generals are all your sons and nephews. Ha, that’s nothing. I understand letting those close to you get the benefits. But please, pick ones with some talent. Tsk tsk, in one month three battalions were defeated. No wonder other people say we are the second Xuan Kong Temple!”</p><br/><p>“We did not receive any information beforehand … …” an elder argued.</p><br/><p>“So people have to first notify you before attacking you?” The sect leader smiled coldly. “Look at what factions have defeated us, small factions without any fame. You are all masters at inner conflict. Tsk tsk, if you had half that skill when fighting against the outside, our sect should have conquered the four realms a long time ago.”</p><br/><p>Embarrassment and anger mixed on the elder’s faces.</p><br/><p>Inside the passageway, they flew for three days and three nights. Tiredness came onto the faces of the sect leader and the elders.</p><br/><p>At the end of the stone stairs was a copper door.</p><br/><p>“Stand guard outside,” the sect leader said coldly. All the other elders released a breath and nodded. Their expressions when they looked at the copper doors were filled with terror and respect.</p><br/><p>The sect leader inhaled, pushed open the door and disappeared inside.</p><br/><p>———</p><br/><p>“Uncle Zhong, for my father’s sake, please help this nephew this once.” The sect leader’s tone was low, his body bowed as he said sorrowfully, “We were defeated three times in a month, Xi Xuan’s weakness has been exposed. The surrounding factions are looking to make a move. I have investigated our battalions, they are rotten to the core. In this enormous Xi Xuan, there is no battalion that can fight!”</p><br/><p>The large man in front of him had an indifferent expression.</p><br/><p>The large man sat on the chair. His body was brawny like a tower of metal. Just sitting there, he gave people a strong suffocating pressure. His short hair stood up straight like wires, but was almost completely white. Scars criss-crossed horrifically on his face. His grey pupils did not hold any emotion. Any exposed part of his body was covered in a dense mat of scars that were startling to see.</p><br/><p>There were two males standing on either side of the large man. Both of these men were also covered in scars.</p><br/><p>“I have already repaid your father’s favor,” the large man said coolly, “I need to guard the Fiend Abyss Jail, find someone else.”</p><br/><p>Bam.</p><br/><p>The sect leader suddenly knelt on the ground and started to cry. “Uncle Zhong, Xi Xuan is in danger, please, save Xi Xuan! If you do not act, Xi Xuan will be destroyed! Uncle Zhong, if you are willing to come out, this nephew is willing to give up the position of sect leader.”</p><br/><p>The large male was indifferent and unaffected. “See the guests out.”</p><br/><p>The two men standing solemnly next to him suddenly released a sea of murderousness that hit the sect leader like a tsunami.</p><br/><p>The sect leader’s body shook. He resisted the bone-piercing murderousness, and suddenly stopped crying. He gritted his teeth and said, “If Uncle Zhong is willing to come out of the mountain, this nephew is willing to construct the Tomb of Yun Ji!”</p><br/><p>Boom!</p><br/><p>The sect leader felt as though he was hit with a great hammer, flying out into the air dozens of zhang.</p><br/><p>The large man’s grey eyes were bloodshot. For the first time, his face changed.</p><br/><p>The sect leader ignored the blood dripping from his mouth and struggled to climb up. “Yun Ji’s contribution to our Xi Xuan is great. When the Tomb of Yun Ji is finished, I will announce as the sect leader for the core disciples and all the elders to come and mourn!”</p><br/><p>“Your father told you this story before he died.” The large man became indifferent again.</p><br/><p>The sect leader’s face paled. He was shocked. He hadn’t thought that Uncle Zhong had been able to guess this.</p><br/><p>“So he knew before that Yun Ji was innocent,” the large man said to himself. His voice was desolate. “I asked to guard the Fiend Abyss Jail. Fifty years, I hadn’t thought that father and son have continued to scheme against me.”</p><br/><p>The sect leader’s expression was ashen.</p><br/><p>“Where are her bones?” the large man suddenly asked.</p><br/><p>The sect leader felt that Uncle Zhong’s gaze was like a pair of pincers that held him. He was almost unable to breathe and unconsciously said, “In … … a secret room. Father had made an altar to her.”</p><br/><p>The pressure on him eased. He collapsed on the ground and panted, looking in terror at Uncle Zhong. [1]</p><br/><p>A moment later, the large man suddenly said, “I will agree.”</p><br/><p>The sect leader stilled and was overjoyed. “Many thanks, Uncle Zhong, many thanks, Uncle Zhong!”</p><br/><p>“The Tomb of Yun Ji must be built within two years.”</p><br/><p>The large man suddenly looked sardonically at the sect leader. The scar-covered face became unspeakably strange and terrifying. “No matter how much your father schemed, he could not have expected that I only have three years left to live.”</p><br/><p>The sect leader was stunned.</p><br/><p>———</p><br/><p>Zuo Mo was extremely busy. He increasingly felt that he needed a skilled manager. Right now, the main steward of Mo Cloud Sea was A Ming, a local of Cloud Sea Jie that Bao Yi had recommended. Bao Yi had been a small time blackmarket dealer from Little Mountain Jie. He had felt the great pressure once Mo Cloud Sea expanded, his hair almost turning white. He coincidentally found that A Ming had good talent and promoted him. Later, A Ming had became the main steward.</p><br/><p>Bao Yi went back to guarding the resource stores, and his days were easy now.</p><br/><p>Cloud Sea Jie was organized under A Ming’s management yet the present Mo Cloud Sea was multiple times larger than back then. A Ming was struggling.</p><br/><p>The present Mo Cloud Sea was sixty nine jie in size, including the three jie under the rule of Rare Artifact Hall.,</p><br/><p>This included a great number of resource jie. The complex flow of materials, battalion supplies, and searches for talent were complex.</p><br/><p>After Zuo Mo had returned, A Ming immediately sighed in relief. There were some decisions he did not dare make on his own.</p><br/><p>For example, the problem of production. Golden Crow Camp possessed a great ability to produce and was the greatest source of income for Mo Cloud Sea. What to produce was undoubtedly the greatest question, especially in this era of turbulence and rapid change. Other than Zuo Mo, no one dared to make the decision.</p><br/><p>Problems like this were all left to Zuo Mo. Zuo Mo had a hard time.</p><br/><p>He desperately desired an outstanding manager. At this time, he realized that an outstanding manager’s value was no less than a top battle general. He was jealous of Gu Liang Dao. While Xiao had no offensive abilities, but he was talented at management. Gu Liang Dao did not have to worry about any of this and could focus on training his troops and fighting.</p><br/><p>A Ming was talented, but lacking greatly compared to Xiao.</p><br/><p>“Management talent?” Pu Yao also frowned. “This kind of skill is not easy to find and recruit.”</p><br/><p>“Think of a way! By any means necessary! At any price!” Zuo Mo bared his teeth.</p><br/><p>“En, I will pay attention.” Pu Yao nodded.</p><br/><p>Zuo Mo suddenly thought of something and asked curiously, “How about your Pu Pu’s Home for Battle Generals? How is that going?”</p><br/><p>Pu Yao’s expression was smug. “There are some good seeds.”</p><br/><p>Zuo Mo was even more interested. Those that Pu Yao said were good probably had great talent. He immediately had a drooling expression. “How about it? Can you pull them over? I can make a few battalions for them to play with!”</p><br/><p>With Mo Cloud Sea’s present wealth, Zuo Mo had enough assets to say something like this.</p><br/><p>“I have other arrangements.” Pu Yao unhesitatingly refused Zuo Mo’s suggestion.</p><br/><p>“You are not good like this … …” Zuo Mo pressed.</p><br/><p>Pu Yao glanced at him. “I heard that there a few good ones from the battle general school. One should not bite off more than they can swallow. Good battle generals do not come from being taught, but through fighting.”</p><br/><p>Zuo Mo smiled weakly. He knew that Pu Yao was right. His greed had just came up. Fortunately, his face was thick, and this was just a usual matter.</p><br/><p>“Lend Nan Yue and the others for me to use for a time,” Pu Yao said.</p><br/><p>Zuo Mo modded. “Alright.”</p><br/><p>If Pu Yao spoke so formally, then it meant it was a serious matter. If it was something devious, this guy wouldn’t make a sound.</p><br/><p>Looking at Wei who was in a meditative state, Zuo Mo asked Pu Yao, “When will Wei wake up?”</p><br/><p>“I don’t know.” Pu Yao shook his head. “He needs time to adjust to the changes in your shen power. You really are a freak, your shen power has advanced too quickly!”</p><br/><p>Pu Yao was shocked by Zuo Mo’s improvement rate. In seven years, Zuo Mo had always maintained an astounding rate of progress which had not shown any signs of slowing down.</p><br/><p>Zuo Mo nodded. “Have you seen those people from Kun Lun? If I’m any slower, I will just be able to eat the ashes when it is over.”</p><br/><p>Pu Yao was silent.</p><br/><p>While he had fought countless times against Kun Lun in the thousand year war, yet Kun Lun, after such a long time of peace, was still working to advance. Even an enemy like Pu Yao had to admire the present Kun Lun.</p><br/><p>In these seven years, the ones that were fighting on the front lines were all elders.</p><br/><p>In these seven years, the number of Kun Lun elders that died surpassed the last three hundred years added together. Of the Kun Lun elders, there were less than one third left.</p><br/><p>The sacrifices of their fathers, masters, and elders moved the genius youth of Kun Lun. They didn’t need supervision or additional motivation. They furiously and silently cultivated day and night, without rest and regard for their lives.</p><br/><p>The sacrifice of two thirds of the elders over seven years finally showed their astounding power.</p><br/><p>A large group of young yet powerful youths started to appear out of Kun Lun. These youths that grew up in the time that the elders traded their blood for were filled with a sense of responsibility. They were unprecedented in their unity. They possessed astounding self-control. They were like their elders, not afraid of sacrifice.</p><br/><p>This kind of Kun Lun made people feel terror, made the entire world feel terror.</p><br/><p>Even Zuo Mo felt the pressure from Kun Lun.</p><br/><p>Suddenly, a paper crane flew over.</p><br/><p>Zuo Mo’s expression turned serious. He opened the paper crane.</p><br/><p>“Xi Xuan’s famous general Zhong De has come back out. He led the Abyss Jail Battalion and blood washed the Central Plains. Thirteen Xi Xuan elders were executed, their bodies left exposed to the elements for ten days. He killed more than seven thousand people, the blood flowing in rivers!”</p><br/><p>Editor Note [1]: Refers to the buddhist practice of keeping a small family altar to make offerings to deceased family members. Sometimes referred to as a hall of ancestors in other novels. Here, even though it is suggested Yun Ji was betrayed and publicly humiliated by her uncle and cousin after her death, the sect leader and his father still have a secret altar to give Yun Ji offerings in the afterlife.</p><br/><p>Translator Ramblings: Running a humongous business needs people with special skills and is a full time job. Zuo Mo’s levelled up from his little business to a international one.</p><br/>\n</div>"}