{"title": "Chapter Six Hundred and Fifty Seven – Tang Battalion", "id": 707, "volume": 8, "url": "http://boxnovel.org/world-of-cultivation-chapter-six-hundred-and-fifty-seven-%E2%80%93-tang-battalion", "volume_title": "Volume 8", "body": "<h1>Chapter Six Hundred and Fifty Seven – Tang Battalion</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Six Hundred and Fifty Seven – Tang Battalion</p><br/><p>It had been a month since the incident by the time Zuo Mo learned that Gu Liang Dao had left Xi Xuan. Zuo Mo was filled with guilt. From beginning to end, Gu Liang Dao had not stepped forward to defend himself. There was much speculation about Zuo Mo’s identity but most of it focused on his identity as a yaomo. He believed this was the reason for Gu Liang Dao’s silence.</p><br/><p>The two had exchanged imprints. Zuo Mo thought for a moment and then wrote a letter to Gu Liang Dao thanking him for keeping the secret and asking what he could do to help.</p><br/><p>A paper crane quickly flew back into Zuo Mo’s hand.</p><br/><p>Gu Liang Dao’s letter was very short. He had just finished a battle when he wrote this letter. In the letter, Gu Liang Dao wrote that he had already sealed the chaos rift connecting to Xi Xian territory and they would no longer receive any supplies in the future. He had taken over fifteen mo jie and was planning to manage them so he could be self-sufficient. Right now, everything was good and there was no immediate worries.</p><br/><p>Zuo Mo was relieved after reading this.</p><br/><p>Fifteen jie, even if it was only fifteen small jie, was enough to support Gu Liang Dao’s battalion. However, these fifteen jie they occupied were mo territories and the mo had a deep hatred of xiuzhe. It would not be simple for Gu Liang Dao to govern these fifteen jie.</p><br/><p>However, Gu Liang Dao shouldn’t have any problems in the short term.</p><br/><p>Zuo Mo decided that after he went to Nether Springs Jie and returned to Cloud Sea Jie, he would set up a transportation formation to Gu Liang Dao’s territories. They could then travel freely and help each other.</p><br/><p>Zuo Mo threw away his worries about Gu Liang Dao and started to ponder his present situation.</p><br/><p>In this past month, they had been travelling at full speed. It had to be said that the name of Xiao Mo Ge was famous in all of the mo territories. Defeating the Yu Frontier Guards, killing Marshal Yu, having a good friendship with Gu Liang Dao, and so on. This made the name of Xiao Mo Ge an intimidating one.</p><br/><p>Zuo Mo had previously thought he should travel in a low-key manner. But there had been too many battles along the way. Seeing this, Zuo Mo decided to announce his presence, relying on the fame of the name Xiao Mo Ge to avoid trouble.</p><br/><p>As expected, this move was immediately effective.</p><br/><p>Those factions that previously did not know their background immediately shuddered when they learned that the incomers were Xiao Mo Ge’s battalion. They even consciously restrained their own battalions. There had been a mo general who hadn’t believed that Xiao Mo Ge was as strong as the rumors and wanted to test their skill. In the end, all of his commanders had opposed him, and he had been assassinated in his bedroom that night.</p><br/><p>Having raised his banner, Zuo Mo’s path could be said to be free of any blockades.</p><br/><p>However, Zuo Mo was not happy. While their speed had accelerated, they had exposed their movements to the public.</p><br/><p>Where had Xiao Mo Ge reached today?</p><br/><p>This was one of the hottest topics of the present mo world. Other problems came with this. At the beginning, they had been deeply afraid of Zuo Mo and the others. However, they quickly found that Xiao Mo Ge was not as brutal and vicious as the rumors said. As long as they did not provoke him, he would not attack. He did not have any interest in their territories.</p><br/><p>Many people wanted to establish relations with such a strong and reasonable battalion . Even if they could not form a relationship, it would be good to curry favor. Consequently, many messengers came every day with gifts and invitations for Zuo Mo’s group to be guests.</p><br/><p>Zuo Mo didn’t know whether to cry or laugh. He still accepted the gifts but he refused all invitations.</p><br/><p>Yet what he hadn’t expected was that there were large numbers of mo that came due to his reputation with hopes of entering his battalion!</p><br/><p>At the beginning, there hadn’t been many people, but when the first group of mo who had come had seen the powerful soldiers of Vermillion Bird Camp and Sin Battalion, they had been stunned, and their desire had grown even hotter. When these people spread the mirages, it caused a great wave.</p><br/><p>All the large families started to study these inaccurate mirages. The conclusion they reached was the same, a powerful battalion!</p><br/><p>Defeating the Ming Bandits and defeating the Yu Frontier Guards; these two battalions had now been ranked high among the many battalions in the Hundred Savage of the Dark. Looking at these mirages, the last bit of doubt disappeared. They suddenly realized. No wonder they could defeat the Ming Bandits and the Yu Frontier Guards!</p><br/><p>Mo always ranked themselves based on power. The strong were revered, and many mo that thought themselves more than ordinary furiously rushed over.</p><br/><p>Xiao Mo Ge being able to kill Marshal Yu meant that Xiao Mo Ge possessed an ability to fight at a high level. Adding on the two top battalions, he had formed his own group. For those mo which came from minor families but were talented, entering Xiao Mo Ge’s battalion was undoubtedly a very good path.</p><br/><p>As more and more mo came due to his name, and a long tail of people formed behind Zuo Mo’s group. They did not dare to go too close to the battalions but they were not willing to leave. They prepared their own food and followed the battalion.</p><br/><p>This was something novel to the mo and it stirred everyone’s interest. All kinds of reports spread. Every time Xiao Mo Ge did something, the world would immediately know. This was a very popular topic at meals and during tea with lots to discuss.</p><br/><p>All of Hundred Savage Realm was watching the spectacle and Zuo Mo felt frustrated.</p><br/><p>“This cannot continue!”</p><br/><p>Zuo Mo’s expression was one of helplessness. The people around him were giggling. These people were all from grassroots and minor families. While they did not say it, they still felt very good about being famous.</p><br/><p>They made faces at each other and smiled deviously.</p><br/><p>Other than Bie Han.</p><br/><p>Bie Han was of noble birth and had grown up in Xuan Kong Temple. He had become immune to the reverent gazes from others a long time ago. His icy face was eye-catching. However, everyone knew his personality and did not care about his icy face.</p><br/><p>“I’m being serious.” Zuo Mo said with a serious expression, “We don’t know how many spies are mixed with these people. Each of our movements is being monitored. This is very dangerous!”</p><br/><p>Everyone put away the mirth on their faces. They had all fought their way out of death on the battlefield and understood the danger more than the average person.</p><br/><p>“En, very dangerous.” Gongsun Cha smiled bashfully.</p><br/><p>Seeing Lil’ Miss Daren’s smiling face, everyone’s heart shook.</p><br/><p>“Everyone think of a solution, what would be good?” Zuo Mo had an expression of hardship.</p><br/><p>“Kill them all,” Bie Han said coolly.</p><br/><p>The entire tent was silent. Everyone was frightened by Bie Han’s crisp and brisk words.</p><br/><p>There were a few among them for whom it was the first time that they were attending a meeting: A Zha Ge, Bie Han, Miao Jun, and Tang Fei. Among them, A Zha Ge was the most cautious. He had decided to follow Gongsun Cha a while ago, but it was the first time he was seeing Zuo Mo. Miao Jun and Tang Fei also chose to remain silent. Only Bie Han had not done that.</p><br/><p>A Zha Ge jumped in fright. Mo were fond of killing, but he had never seen someone with such disregard for life. Miao Jun’s pupils shrank. Tang Fei’s expression became furious. She was a righteous person and disliked Bie Han who behaved like a serial killer.</p><br/><p>Before Tang Fei spoke in opposition, Zuo Mo shook his head. “It is not suitable.”</p><br/><p>Zuo Mo was not a madman like Bie Han. While he was not soft when fighting an enemy, but he would not be able to do something like killing all these mo that came due to his reputation without a cause.</p><br/><p>Gongsun Cha said, “Since they have come for you, then why don’t we recruit the outstanding ones. We just have to be careful and not let in spies.”</p><br/><p>Zuo Mo thought, yes, they were coming to him, why shouldn’t he take them? He did not need to worry about the spies mixed within. Pu Yao and Wei could see with a glance those with other intentions.</p><br/><p>His gaze swept across everyone’s faces. When his gaze landed on Miao Jun, he paused.</p><br/><p>There was no question regarding Miao Jun’s strength. A gold battle general was a talent no matter what faction he was in. It would be waste if Zuo Mo had him sitting idle all the time. But while Miao Jun had come along, his intentions were unclear. Miao Jun had never disguised this but he did not speak the reveal the reason he followed Zuo Mo. Because of this, Zuo Mo had some hesitations about him.</p><br/><p>When his gaze swept across Tang Fei who stood beside Miao Jun, his eyes lit up. This little girl had a strong sense of justice, was stubborn and focused. She would not accept any flaws. Since she had agreed to Tao Xing’s suggestion to follow him, she would not ever regret it. Even though she never had a good face for Zuo Mo, she would meticulously finish any orders Zuo Mo gave her. Zuo Mo trusted her.</p><br/><p>Before this, she had the skill of a silver battle general. After this period of being taught by Miao Jun, she had started to have some of a presence of a great battle general.</p><br/><p>Zuo Mo suddenly thought of a clever idea.</p><br/><p>“That’s right! If that’s so, then let’s create a new battalion. Oh, let’s call it the Tangzi Battalion. Tang Fei will be the main commander, with Miao Jun as second in command.”</p><br/><p>Everyone had surprised expressions and they turned to look at Tang Fei. This young girl with her hair in a ponytail was not eye-catching but at this time, she became the focus of the entire group. While not many had seen her skill and were curious about her, no one spoke up against Zuo Mo’s decision.</p><br/><p>Tang Fei also was surprised but she quickly calmed down. She looked at Zuo Mo and then at Miao Jun. Technically, Miao Jun was more suitable to being the main commander than she was as Miao Jun was much more skilled.</p><br/><p>Miao Jun smiled at her. He understood what Zuo Mo thought but this plan suited his own thoughts. While the two sides had not explicitly said this, but in truth, Tang Fei was his student and he liked his student very much.</p><br/><p>If this was somewhere else, Tang Fei’s strength would be enough to be a main commander but he hadn’t thought that Zuo Mo would have so many skilled battle generals!</p><br/><p>Nothing had to be said about Gongsun Cha and Bie Han. The two were of the same level as Gu Liang Dao. Miao Jun could only look up to these top battle generals. It really was rare to see two top battle generals in one faction.</p><br/><p>It was the first time Miao Jun had met A Zha Ge but he had heard of this name before. Gold battle general, one of the three great battle generals of the Stellar Rahula Clan. He hadn’t thought the other would also enter Xiao Mo Ge’s service.</p><br/><p>One could not forget that Xiao Mo Ge himself was a also gold battle general!</p><br/><p>Even those others such as Shu Long and the people under Gongsun Cha were not lacking compared to Tang Fei. It completely surpassed his imagination just how fierce the competition in this faction was.</p><br/><p>Tang Fei was very talented but if she did not gain experience, it was hard to say what she could accomplish in the future. Right now, a political structure had taken form under Xiao Mo Ge and it would not be so easy to become of the main commanders. He understood his student very well. With her personality, since she agreed to follow Zuo Mo, she would not regret it no matter how underutilized she was.</p><br/><p>The other who he also taught was Shu Long. He was one of Zuo Mo’s inner circle and he did not have to worry about the other’s future. Only Tang Fei had been in an awkward position.</p><br/><p>He hadn’t thought that Zuo Mo would throw out such a plan. He immediately recognized that this was a one in a thousand chance for Tang Fei.</p><br/><p>Before Tang Fei could speak, Miao Jun stood unhesitatingly. “Yes, we will not fail!”</p><br/><p>Translator Ramblings: The hottest reality show of the moment … … The Daily Adventures of Xiao Mo Ge!</p><br/>\n</div>"}