{"title": "Chapter Six Hundred and Fifty One – When He’s Sick, Take His Life!", "id": 701, "volume": 8, "url": "http://boxnovel.org/world-of-cultivation-chapter-six-hundred-and-fifty-one-%E2%80%93-when-he%E2%80%99s-sick-take-his-life", "volume_title": "Volume 8", "body": "<h1>Chapter Six Hundred and Fifty One – When He’s Sick, Take His Life!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Six Hundred and Fifty One – When He’s Sick, Take His Life!</p><br/><p>Several strands of the Three Thousand Strands of Worry suddenly burrowed into the Anti Dragon Claw.</p><br/><p>The Anti Dragon Claw shook but the furious struggle and resistance that Zuo Mo had expected from the Anti Dragon Claw did not come. Was it? Zuo Mo suddenly had a realization. The Anti Dragon Claw had exhausted itself in the conflict with the Sun Crystal Seed just now and was in a weakened state!</p><br/><p>The following scene seemed to prove Zuo Mo’s guess. Pew pew pew, the slender Three Thousand Threads of Worry punctured the Anti Dragon Claw like needles. The Anti Dragon Claw shook but did not resist.</p><br/><p>Great opportunity!</p><br/><p>For natural born opportunists like Little Mo Ge, if he missed an opportunity like this, then he would not be Little Mo Ge.</p><br/><p>With his strength, he didn’t know how long it would take him to subdue the Anti Dragon Claw. Previously, he had only managed to hold onto the Anti Dragon Claw by using the Three Thousand Threads of Worry. But holding it and subduing it was not the same. Even though the Anti Dragon Claw could not escape, he could not channel the power of the Anti Dragon Claw.</p><br/><p>Right now, this was when the Anti Dragon Claw was weakest and the best opportunity to subdue it.</p><br/><p>Take his life when he was sick, this principle was also able to be applied to sky mo weapons. In blink, Zuo Mo threw aside his respect of the Anti Dragon Claw and started to scheme against it. Only now did he find that the Three Thousand Threads of Worry was the most cunning and evil of the three. This guy had pretended to be neutral from the beginning but showed its hand when the Anti Dragon Claw showed weakness!</p><br/><p>Very vicious!</p><br/><p>But I like it!</p><br/><p>Zuo Mo did not wait around watching but reached out as well! Regardless of how the Three Thousand Threads of Worry subdued the Anti Dragon Claw, it could not help him tame this peerless mo weapon. He had to do it himself.</p><br/><p>Zuo Mo tried to reach towards the Anti Dragon Claw.</p><br/><p>In the moment that his hand touched the Anti Dragon Claw, an extremely brutal energy suddenly burrowed into Zuo Mo’s body.</p><br/><p>Extreme fury!</p><br/><p>He felt the anger of the Anti Dragon Claw. Thunderous roars echoed in his mind intimidatingly!</p><br/><p>Zuo Mo was startled but he quickly calmed down. Compared to the vast brutal energies before, this energy was sharp but weaker, leading Zuo Mo to be more certain that the Anti Dragon Claw was in a weakened state. He found to his joy that his newly tempered body did not feel any discomfort when enduring this brutal energy.</p><br/><p>This made Zuo Mo overjoyed.</p><br/><p>The Anti Dragon Claw also noticed this quickly. Another gust of brutal energy entered Zuo Mo’s body. Zuo Mo’s body suddenly froze. This energy seemed the same as the one before, but when it entered Zuo Mo’s body, he immediately detected the difference.</p><br/><p>Dark and cold!</p><br/><p>Extremely dark and cold to the point it almost froze Zuo Mo. At this dangerous moment, Zuo Mo hurriedly activated the Soul Setting Divine Light!</p><br/><p>The Soul Setting Divine Light was as wondrous as usual. This extremely cold energy was immediately set.</p><br/><p>Zuo Mo finally released a breath.</p><br/><p>But this energy was extremely cold and could not be absorbed like the previous brutal energies by Zuo Mo’s mo matrix. This cold energy was extremely pure. Zuo Mo knew his own abilities and that it would not be easy if he wanted to process it with his own power. But if he did not process it, it may lead to great trouble.</p><br/><p>An idea sparked. He thought of the remaining sun matrices.</p><br/><p>There were still many hot flows from the Sun Crystal Seed inside the sun matrices. Would the hot and cold pair together well? His thoughts moved and Zuo Mo threw the extremely cold energy into a sun matrix.</p><br/><p>When this energy was thrown into the sun matrix, it was like cold ice poured into boiling oil and caused a great disturbance.</p><br/><p>In moments, the extremely cold energy disappeared and half of the hot flow in the sun script was gone. More of the new power fragments appeared.</p><br/><p>Zuo Mo was overjoyed. These unfamiliar power fragments were of great benefit to him.</p><br/><p>After digesting these power fragments, Zuo Mo continued to focus his attention on the Anti Dragon Claw.</p><br/><p>At this time, his hand was tightly gripping the Anti Dragon Claw. This was the first time he touched the Anti Dragon Claw. The dragon claw was covered in icy and hard dragon scales, but the dragon scales where he held the mo weapon were much finer than the scales elsewhere.</p><br/><p>More strands of the Three Thousand Strands of Worry burrowed into the Anti Dragon Claw and it trembled even more violently.</p><br/><p>At his time, the Anti Dragon Claw grew dim like it had lost all of its light.</p><br/><p>Zuo Mo gritted his teeth and reached into the Anti Dragon Claw along the Three Thousand Threads of Worry.</p><br/><p>Boom!</p><br/><p>It was like Zuo Mo’s finger had been placed into a glacier. Great cold energies immediately exploded forth and spread into Zuo Mo’s body from his finger. Grey frost headed for Zuo Mo at lightning speed.</p><br/><p>Not good!</p><br/><p>Zuo Mo paled. He suddenly understood, he had been tricked!</p><br/><p>The Anti Dragon Claw purposefully pretended to appeared weak to lure him. Such a cunning mo weapon!</p><br/><p>Just as the frost was about to cover Zuo Mo immediately, Zuo Mo unhesitatingly threw out his ultimate card—Soul Setting Divine Light!</p><br/><p>The Soul Setting Divine Light seemed small but it was unexpectedly powerful,</p><br/><p>Gritting his teeth, Zuo Mo released the cold flows towards the three remaining sun matrices. In moments, the cold energy that invaded his body had disappeared but so had the hot flows.</p><br/><p>Zuo Mo felt some pity. He finally understood what these hot flows were. They were the base source of the Sun Crystal Seed’s power. If he could have processed them, it would have been greatly beneficial for his shen power and the Ten Crow Celestial Domain. It was a pity that the cold flow had been too powerful and he could not withstand it on his own.</p><br/><p>Fortunately, the two powers had destroyed each other and created those new power fragments.</p><br/><p>After this fright, Zuo Mo became even more cautious. The Anti Dragon Claw was valuable, but if he lost his life trying to tame it, then it would not be worth it!</p><br/><p>This cold energy seemed to be the last attack the Anti Dragon Claw had. The Anti Dragon Claw became almost lifeless in Zuo Mo’s hand like a withered branch. It was extremely dim and there was none of its awesome presence that it showed before.</p><br/><p>Zuo Mo did not encounter any more resistance. His hand reached into the Anti Dragon Claw and easily touched the icy bone at the core.</p><br/><p>This bone seemed to be carved from ice. Zuo Mo couldn’t help but shudder when he touched it. It was too cold! But Zuo Mo’s face showed joy. He knew he had found the crux!</p><br/><p>The Three Thousand Threads of Worry seemed to understand that Zuo Mo had tamed the Anti Dragon Claw and shrank back out from the body of the Anti Dragon Claw. This was the first time Zuo Mo saw the Three Thousand Threads of Worry release the Anti Dragon Claw completely.</p><br/><p>Suddenly, Zuo Mo’s hand was empty. The thick Anti Dragon Claw had disappeared and was replaced by a grey claw bracelet on his wrist.</p><br/><p>This bracelet was dim in color and nondescript.</p><br/><p>In this moment, Zuo Mo seemed to be dreaming.</p><br/><p>He had succeed?</p><br/><p>He had really succeed?</p><br/><p>A surreal feeling overwhelmed him. Had he subdued the sky mo weapon Anti Dragon Claw like this? Looking at the grey bracelet on his wrist, Zuo Mo’s expression was slightly dazed. The entire process had been surprising but the attempt was almost unimaginably easy. It had gone so smoothly that Zuo Mo felt that there had been a problem somewhere along the line.</p><br/><p>Zuo Mo quickly found that there really was a problem!</p><br/><p>No matter how he called out ot it, the grey bracelet did not respond at all. It did not react as though it was dead.</p><br/><p>Zuo Mo was stunned. Why was it like this?</p><br/><p>The great disparity made him almost throw up blood!</p><br/><p>Anti Dragon Claw! Where did my sky mo weapon, Anti Dragon Claw, go?</p><br/><p>The bracelet did not move at all and did not shine. No one would connect this dim article to the vicious and peerless Anti Dragon Claw.</p><br/><p>Depressed, Zuo Mo quickly sorted out his emotions. Right now, he had not completely escaped the present danger and he could not waste his time on this matter.</p><br/><p>He looked around and his gaze immediately landed on Marshal Yu.</p><br/><p>Marshal Yu did not look as at ease as he previously had. His face was white and he seemed to be wounded. Thinking about the earth-shaking conflict that had just occurred, Zuo Mo realized that Marshal Yu had probably been suffered a major injury.</p><br/><p>Zuo Mo’s guess was very accurate.</p><br/><p>Marshal Yu had been greatly affected. It could be said that the blow he had received was much greater than others. One reason was because he had been closest to Zuo Mo when the battle had happened so he naturally received more of the collateral damage. The other reason was because he was the strongest person present and had the deepest understanding of power. Higher level powers affected him more than other people.</p><br/><p>However, his gaze flickered. He was wounded, but he was not demoralized. He was filled with confidence. He had been affected the most, but he had gained the most!</p><br/><p>If he could successfully recover, and could digest all that he comprehended today, his power would definitely go up a level.</p><br/><p>Zuo Mo also understood this and his gaze became vicious.</p><br/><p>At this time, Marshal Yu had gone through a hard battle and he was wounded. This was when he was weakest. Zuo Mo’s own power had actually increased and he was at his strongest.</p><br/><p>If he waited for Marshal Yu to heal completely, the other was not someone that he could defeat under normal circumstances. He could not reach marshal level any time soon. Zuo Mo did not know what level Marshal Yu would reach after digesting his comprehensions today.</p><br/><p>Zuo Mo was disappointed that he could not use the power of the Anti Dragon Claw but it wasn’t as though he didn’t have other tricks in his sleeve. Other than Ceng Lian’er who was unable to fight, Wo Li, A Gui and the black gold seal soldier still had most of their power. With him added on, they might have a chance!</p><br/><p>This was the best chance to kill Marshal Yu!</p><br/><p>No matter what, he had to keep Marshal Yu from leaving! Otherwise, there would be trouble in the future.</p><br/><p>Zuo Mo suddenly showed his viciousness. He gritted his teeth. With a sudden flicker of his body, he dove at Marshal Yu.</p><br/><p>“Kill Marshal Yu!”</p><br/><p>Almost as his words sounded, A Gui, Wo Li and the others moved!</p><br/><p>———</p><br/><p>Bie Han had been far away and not been affected too greatly by the shockwaves. But he still felt nauseous. Fortunately, the nightmarish battle had finished and he recovered.</p><br/><p>The fight between the Ten Crow Celestial Domain and the grey dragon had been heart-stopping but even then, Bie Han’s gaze had not left the other’s ranks.</p><br/><p>He noticed that the ranks of the Yu Frontier Guards had been affected and become messy. Innumerable weaknesses appeared clearly in his eyes.</p><br/><p>When Zuo Mo shot at Marshal Yu, Bie Han admired Zuo Mo’s decisiveness.</p><br/><p>Almost at the same time, Sin Battalion silently moved towards the Yu Frontier Guards.</p><br/><p>Translator Ramblings: I wonder what level of intelligence the things are at. Like it is just instinct or is it because they don’t have mouths that they just can’t communicate verbally like Pu Yao and Wei?</p><br/>\n</div>"}