{"title": "Chapter Six Hundred and Fifty Six – Gu Liang Dao’s choice", "id": 706, "volume": 8, "url": "http://boxnovel.org/world-of-cultivation-chapter-six-hundred-and-fifty-six-%E2%80%93-gu-liang-dao%E2%80%99s-choice", "volume_title": "Volume 8", "body": "<h1>Chapter Six Hundred and Fifty Six – Gu Liang Dao’s choice</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Six Hundred and Fifty Six – Gu Liang Dao’s choice</p><br/><p>Zuo Mo was slightly surprised as he looked at that alluringly beautiful face.</p><br/><p>“Are you not afraid of me?” Zuo Mo was puzzled. The other people looked at him with wariness and fear in their eyes, yet Princess Xia approached him as usual.</p><br/><p>Princess Xia smiled alluringly, “Why should I be afraid of you? Will you eat me?”</p><br/><p>Zuo Mo was left speechless.</p><br/><p>Princess Xia’s eyes moved and seemed mischievous. “I hadn’t thought that you would know Gu Liang Dao! But it is fortunate for us that you know him. Otherwise, this place would even have ruins left. However, you have to be careful. It is not good for your reputation as a mo to be associated with xiuzhe. Which family are you really from? Ten Crow Celestial Apparatus is a very noble bloodline! Are you a descendant of the ancient families?”</p><br/><p>Her words were not spoken quietly and she blinked playfully at Zuo Mo.</p><br/><p>Listening to Princess Xia’s words, many people showed expressions of relief. Princess Xia was right. How could someone that cultivated the Ten Crow Celestial Apparatus mo physique be a xiuzhe?</p><br/><p>They had never heard of a xiuzhe that was able to cultivate the Ten Crow Celestial Apparatus mo physique, much less reach the completion stage of the Ten Crow Celestial Domain. Thinking about it this way, everyone found the thought that Xiao Mo Ge was a xiuzhe was absurd.</p><br/><p>All of the mo present exhaled in relief. Everything would be alright if Xiao Mo Ge was a mo. As to his relations with xiuzhe, while it was something that was frowned upon, no one cared too much.</p><br/><p>Look at those xiuzhe, among them was the famed Gu Liang Dao!</p><br/><p>They didn’t feel that anything was wrong. Xiao Mo Ge was extraordinary as expected, being familiar with other extraordinary people was expected. The common saying was birds of a feather, flock together. Someone that the Tiger General of Xi Xuan treated so respectfully, how could Xiao Mo Ge be a normal person?</p><br/><p>Unconsciously, the terror in their eyes weakened and transformed into respect.</p><br/><p>No matter where you were, people would respect the strong.</p><br/><p>Zuo Mo’s expression froze on his body. He now understood what it meant to make black into white. Princess Xia’s silver tongue could make dead people become alive. Her speech was meant to help remove the suspicion people had of him. Even though it could not make everyone believe it. People such as Zhu Ke and a few others still had suspicion in their eyes, it was enough to fool the normal people.</p><br/><p>To them the Ten Crow Celestial Apparatus was absolute proof!</p><br/><p>As to the xiuzhe under Xiao Mo Ge’s command, those were even easier to explain away. Xiao Mo Ge and Gu Liang Dao had a good relationship, it would therefore be normal to have some xiuzhe under his command. Looking at this battalion, the mo were the primary core!</p><br/><p>Looking at Princess Xia smiling as she spoke, Zuo Mo knew that this woman had guessed his identity. However, he was still surprised that she had stepped out to help him.</p><br/><p>Zuo Mo smiled but did not speak.</p><br/><p>In the eyes of everyone else, his silence and expression caused them to feel even more mystery from him. Xiao Mo Ge’s origins were probably extraordinary as Princess Xia had said!</p><br/><p>Zuo Mo set up jinzhi and blocked off all sound.</p><br/><p>“Thanks!” he said seriously.</p><br/><p>Princess Xia smiled beautifully. “How will you thank me?”</p><br/><p>Zuo Mo scratched his head. “Speak.”</p><br/><p>Princess Xia looked deeply at Zuo Mo as though she wanted to say something but when the words reached her mouth, it became, “Where are you preparing to go next?”</p><br/><p>“Nether Springs Jie.” Zuo Mo did not conceal it.</p><br/><p>“Nether Springs Jie?” Princess Xia had a shocked expression. “That place will not be easy to get to!”</p><br/><p>“Yes.” Zuo Mo nodded.</p><br/><p>Looking at the determination on Zuo Mo’s face, Princess Xia did not try to persuade him from his journey. She smiled and said, “Remember to visit me if you have the time, don’t forget that you still owe me a favor!”</p><br/><p>“Yes.” Zuo Mo responded with a serious expression.</p><br/><p>Detecting the seriousness in Zuo Mo’s tone, Princess Xia felt strangely happy. She suddenly asked, “Will you tell me your true name now?”</p><br/><p>As expected, she had seen through him … …</p><br/><p>But for some reason, Zuo Mo felt his mind relax. “Zuo Mo!”</p><br/><p>“Zuo Mo … … Zuo Mo … …” Princess Xia murmured and then she suddenly burst into laughter, “Xiao Mo Ge … … Xiao Mo Ge, you’re really a little hoodlum! Even your fake name is so stylish!”</p><br/><p>Looking at Princess Xia arching back as she laughed, Zuo Mo’s mouth curled up.</p><br/><p>The laughter faded. Calm and a distance separated them.</p><br/><p>The two of them knew that after their farewells, it was unknown if or when they would meet again.</p><br/><p>Looking at this face that could not be said to be handsome, in this moment, Princess Xia suddenly had an impulse to throw away everything and run away with him to Nether Springs Jie!</p><br/><p>This impulse caused her determination to waver but she quickly hid the thought deep inside. She thought of the wish she had made that night and her gaze became determined.</p><br/><p>She raised her face and smiled brightly like sunlight. “Hug me goodbye.”</p><br/><p>Zuo Mo stilled. He opened his arms and lightly embraced this woman that was so smart and he could not understand.</p><br/><p>“Have a peaceful journey.”</p><br/><p>The murmur was like a breeze. She released her arms and her smile was bright.</p><br/><p>———</p><br/><p>As one of the most popular topics in the xiuzhe world at present, Gu Liang Dao’s every move attracted attention. In a short few days, the news of Gu Liang Dao’s interaction with a mo called Xiao Mo Ge had spread.</p><br/><p>The information on this Xiao Mo Ge was quickly discovered.</p><br/><p>This Xiao Mo Ge was not an unknown mo!</p><br/><p>However, what puzzled people was that this Xiao Mo Ge had first become famous in the yao territories. The prison-breaking battle and defeating Corps Commander Yu Heng. All those events had happened in the Ten Finger Prison. Yet the Xiao Mo Ge in these rumors was mo, and this puzzled many people.</p><br/><p>Was this guy a yao or a mo?</p><br/><p>Some even suspected that there were two people with the same name but as Xiao Mo Ge’s almost unbelievable escapades came to light this suspicion weakened. It was very unlikely that two experts who were both called Xiao Mo Ge had appeared at the same time. And when the xiuzhe thought of the possibility there were two such talented yaomo, they were more willing to believe that it was one person.</p><br/><p>Of all the incidents, what was most eye-catching was Xiao Mo Ge had killed Marshal Yu! When many people read this, their first response was that their eyes had seen it wrong. Then, all kinds of information corroborated the accuracy of this news and it caused a great furor.</p><br/><p>But what was most controversial was that Gu Liang Dao had helped Xiao Mo Ge.</p><br/><p>The rumor that the Tiger General of Xi Xuan was in cahoots with the mo spread and once it did, it caused a wave of discussion. All kinds of insider information and speculation flew about.</p><br/><p>What was even more interesting was that Xi Xuan was silent and did not publicly clarify the situation.</p><br/><p>Xi Xuan’s attitude caused those speculations to seem to be the truth.</p><br/><p>Was Gu Liang Dao truly in cahoots with the mo?</p><br/><p>Furious discussion filled the world.</p><br/><p>In a matter of days, the great hero of fell off the pedestal and was spat upon by the world.</p><br/><p>———</p><br/><p>Gu Liang Dao’s face was dark. The development of the situation had surpassed his expectations. In the shadows, there seemed to be a hand moving everything. Actually, he didn’t need to guess to know who was doing this. The attitude of the sect told him everything. What he hadn’t expected was that the sect would be in such a hurry to act against him during a time of war.</p><br/><p>Suddenly, he thought of what Bie Han had said.</p><br/><p>He hadn’t thought that it would come so quickly.</p><br/><p>“Daren, should we make a public statement to clarify?” the subordinate couldn’t help but speak.</p><br/><p>“Clarify? How to would we clarify?” Gu Liang Dao said coolly.</p><br/><p>“Xiao Mo Ge is clearly a xiuzhe … …”</p><br/><p>Gu Liang Dao interrupted his subordinate. “This will make Brother Zuo’s situation even more dangerous. He currently needs his identity as a mo.” He had felt kinship with Zuo Mo and he was not willing to use this to clear his name. Also, he did not say it, but even if he told them, no one would believe him.</p><br/><p>Because the people acting against him were the people from the sect.</p><br/><p>This subordinate was panicked. “Daren, we cannot sit around and wait for them to act against us!”</p><br/><p>At this time, a guard suddenly ran in with a terrible expression. “Daren, Elder Jin Wu Ming has come!”</p><br/><p>The tent went completely silent. All of the commanders had terrible expressions.</p><br/><p>“Ask Elder Jin to come in.” Gu Liang Dao’s expression was normal.</p><br/><p>Moments later, a middle-aged person wearing golden clothing with a sharp presence walked in.</p><br/><p>Gu Liang Dao stood up and bowed. “Greetings to Elder Jin!”</p><br/><p>Elder Jin’s old voice was heavy but his tone was slow. “Gu Liang Dao, the sect leader orders you to return to the mountain. Your actions this time were too rash and has brought too much trouble to the sect. When you return to the sect, you will need to give a good explanation. The sect believes that you are innocent, but the damage to the sect’s reputation was too great. The sect needs you to cooperate.”</p><br/><p>Gu Liang Dao was silent while his commanders all had angry expressions.</p><br/><p>Elder Jin’s wizened tone became even slower. “Liang Dao, there won’t be any trouble if you just explain. If it wasn’t that the discussion was too fierce, I wouldn’t have come to get you. You need to understand the hardships of the sect. Cooperate with the sect and eliminate doubts we have.”</p><br/><p>Gu Liang Dao shook his head. “Elder, your pardon, the war is a busy time and this disciple does not have the spare time to return to the sect at the moment. Elder, please return to the sect and tell the sect leader that when this war is finished, this disciple will return to the sect and ask for forgiveness.”</p><br/><p>Elder Jin’s gaze suddenly became as sharp as a sword as he shouted angrily, “Gu Liang Dao, you dare to disobey the sect leader!”</p><br/><p>“The reality is so, there is nothing I can do,” Gu Liang Dao said deeply.</p><br/><p>“Good good good!” Elder Jin said three goods and then said coldly, “There is nothing I can do! If Gu Shidi knew his most beloved disciple was so disobedient, I only wonder what he thinks in the afterworld!”</p><br/><p>A deep grief flashed across Gu Liang Dao’s eyes. He slowly stood up and looked directly at Elder Jing. “If it was not to repay Master’s grace of raising me, would I stay at Xi Xuan? I have fought countless times for the sect, almost died multiple times, and have rendered great service to the sect. I don’t owe the sect! If Master knew what the Xi Xuan he had always defended has become like this now … …”</p><br/><p>Gu Liang Dao allowed the tears to fall down his face.</p><br/><p>Elder Jing’s face turned into a mix of colors as he shouted angrily. “Good good good! You have become proud due to your achievements! You dare to not listen to the orders of the sect leader. This is treason!” He turned looked around and said coldly to the commanders, “Are you all going to follow Gu Liang Dao and betray Xi Xuan?”</p><br/><p>“What’s the use in such a ruthless sect?”</p><br/><p>“We’ll betray you!”</p><br/><p>“I’ve long given up on this corrupt sect. This is very good, end it all!”</p><br/><p>The commanders stood up one after the next and looked with fury and disdain at Elder Jin.</p><br/><p>Elder Jin’s old face became ashen and his extremities felt cold.</p><br/><p>Over the next few days, Xi Xuan’s Tiger General Gu Liang Dao led his battalion in leaving Xi Xuan. The world was left astounded.</p><br/><p>Translator Ramblings: It’s finally over. People dead, moving on. A Gui needs to be healed.</p><br/><p>Gu Liang Dao is really a nice person.</p><br/>\n</div>"}