{"title": "Chapter Six Hundred and Sixty Four – Danger", "id": 714, "volume": 8, "url": "http://boxnovel.org/world-of-cultivation-chapter-six-hundred-and-sixty-four-%E2%80%93-danger", "volume_title": "Volume 8", "body": "<h1>Chapter Six Hundred and Sixty Four – Danger</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Six Hundred and Sixty Four – Danger</p><br/><p>“It seems that Xuan Kong Temple is determined to exterminate Xiao Mo Ge . However, they really think highly of Xiao Mo Ge!” Xue Dong said with a laugh.</p><br/><p>Xue Dong had thick brows and large eyes. His appearance was fine and he had a bloodthirsty presence from battling for long periods of time. He had come to find Lin Qian immediately after he returned from the front lines.</p><br/><p>While Lin Qian was the shixiong, Xue Dong was older. The two had a close relationship.</p><br/><p>Withdrawing his consciousness from the jade scroll, Lin Qian was slightly distracted. In order to guarantee their victory this time, Xuan Kong Temple had sent out two of their fanxu xiuzhe to kill Xiao Mo Ge. Xuan Kong Temple’s action was well concealed but Kun Lun’s spy was placed high enough in their ranks that they were able to pass this on.</p><br/><p>“What?” Xue Dong sensitively detected Lin Qian’s state.</p><br/><p>Lin Qian came back and said with a smile, “This Xiao Mo Ge is really a extraordinary person. It is a pity he will die.”</p><br/><p>“Oh.” Xue Dong was slightly shocked. “I’m curious to know more about this person that you think so highly of.”</p><br/><p>“I fought against him when I went to the mo territories this time. He seems slightly unfathomable.” Lin Qian lightly described.</p><br/><p>Xue Dong changed expression. He knew how strong Lin Qian was. When Lin Qian said something like this, it meant that their battle had ended in a stalemate.</p><br/><p>Lin Qian’s brow creased. “This person’s origins are very strange. He seems to have both yao and mo blood. Both his yao arts and mo skills are strong and he also cultivates shen power.”</p><br/><p>“Shen power?” Xue Dong’s eyes widened and his face was shocked.</p><br/><p>“Yes, I only comprehended shen power because I fought against him this time.” Lin Qian thought of something and frown again. “He most likely has a complete inheritance. It would not be good if that lands in the hands of Xuan Kong Temple!”</p><br/><p>Kun Lun wasn’t the only one that was studying shen power. Any sect that had history had ambitions about this. But in terms of who spent the most effort, it was undoubtedly the four great sects.</p><br/><p>Xue Dong’s eyes narrowed. “Yes! We cannot have the shen power inheritance land in Xuan Kong Temple’s hand. Why don’t we send a few people as well?”</p><br/><p>“That will not be appropriate!” Lin Qian shook his head and his expression was grave. “Xuan Kong Temple has a legitimate reason to fight. No one can nitpick about their excuse of executing Bie Han. If we send someone, then we will be publicly dissolving our relationship with Xuan Kong Temple.”</p><br/><p>Xue Dong also frowned. Lin Qian was right. They could not directly send people for this matter.</p><br/><p>“We can still notify Xiao Mo Ge and have him hide.” Lin Qian felt the matter was slightly troublesome. He had never thought that Xuan Kong Temple would send two fanxu xiuzhe for Xiao Mo Ge.</p><br/><p>Fanxu experts were strategic resources. If it was not a matter of life and death to the sect, the sect would not use them.</p><br/><p>It seemed that Xuan Kong Temple also understood the importance of this battle for them.</p><br/><p>———</p><br/><p>“It is really troublesome this time.” Zuo Mo’s expression was very ugly. “Xuan Kong Temple really has a high expression of ge. Tsk tsk, fanxu, and two of them!”</p><br/><p>The other commanders had terrible expressions.</p><br/><p>Zuo Mo received a letter today that said Xuan Kong Temple had sent out two fanxu experts to assassinate him. Xuan Kong Temple clearly was wary of Zuo Mo after he killed Marshal Yu so they were even willing to use such dishonorable tactics to completely eliminate this threat.</p><br/><p>While no one knew who the sender was but everyone understood that this letter was probably true.</p><br/><p>Two fanxu. This completely exposed the magnitude of Xuan Kong Temple’s great power. To kill a person by sending two fanxu, only the four greats would have the resources to do this.</p><br/><p>This was power.</p><br/><p>Even with someone notifying him, Zuo Mo and the others had no solutions.</p><br/><p>“How about we return to Cloud Sea Jie.” Gongsun Cha looked at Zuo Mo with worry in his eyes. Two fanxu would have the ability to cut through their battalion. If they were working with battalions, their power would be even greater.</p><br/><p>Zuo Mo grimaced. “Not enough time! I’m afraid that these two fanxu old thieving baldies are not far from us.”</p><br/><p>Bie Han was silent. He hadn’t thought that the sect would actually send two fanxu to kill Zuo Mo. He had been with the sect for many years and knew that experts on fanxu level were the ultimate power for the sect.</p><br/><p>Had Xuan Kong Temple felt that they were a threat to the existence of the temple?</p><br/><p>He felt slightly conflicted. He desired to fight against Xuan Kong Temple but he knew that the two fanxu were a big trouble.</p><br/><p>Zuo Mo’s gaze suddenly landed on Bie Han. “How many fanxu does Xuan Kong Temple have?”</p><br/><p>Bie Han stilled but quickly reacted. “Five, one left to travel thirty years ago and has not returned. One is still in death seclusion. One was on a mission by the sect leader ten years ago and has not return. There are only these two left.”</p><br/><p>Zuo Mo’s expression eased and he said, “In other words, they can only send these two fanxu.”</p><br/><p>Thinking, Zuo Mo asked, “If I flee, will these two fanxu meet up with Jiang Zhe?”</p><br/><p>Bie Han shook his head. “No.”</p><br/><p>Zuo Mo was very surprised at the certainty in Bie Han’s answer. “Why? If they meet up with Jiang Zhe, wouldn’t their chance of victory increase?”</p><br/><p>“Fanxu can also die,” Bie Han said coolly.</p><br/><p>Zuo Mo immediately understood. Yes, while a fanxu was powerful, they could still die. If a powerful battalion did not care about losses, they might be able to kill a fanxu xiuzhe. Xuan Kong Temple did not lack battalions, and would not risk their fanxu experts on the battlefield.</p><br/><p>So the mission this time was an assassination.</p><br/><p>Zuo Mo also understood why Xuan Kong Temple would send two fanxu. He had killed Marshal Yu. In the eyes of Xuan Kong Temple, he was someone that could threaten fanxu.</p><br/><p>Xuan Kong temple could not afford to lose any fanxu.</p><br/><p>Zuo Mo’s eyes lit up. He suddenly found that there might be a chance.</p><br/><p>Xuan Kong Temple would not know that someone would have warned him about their assassination mission.</p><br/><p>After thinking for a long time, Zuo Mo raised his head and confidence came back to his face. “I have an idea.”</p><br/><p>———</p><br/><p>Under the ground, Wei Sheng gripped the hilt of the black sword and stopped his breathing. He quickly became like a piece of rock and all signs of life faded from him.</p><br/><p>“Damn it, we lost him again!” one person swore.</p><br/><p>“Are we going to keep chasing?” another asked weakly with a thread of fear in his voice.</p><br/><p>“Of course, if we don’t, we will all die!”</p><br/><p>“But if we catch up to him, we will also die … …”</p><br/><p>The group became silent.</p><br/><p>“No, if this continues, we will all die!”</p><br/><p>“Then what do we do?”</p><br/><p>“Wait!”</p><br/><p>“Wait?”</p><br/><p>“Wait for Lord to send out a kill warrant!”</p><br/><p>Just as he finished speaking, one person said joyfully, “Kill warrant, the Lord sent out a kill warrant!”</p><br/><p>“This time, he’s done for!” The person speaking sighed in relief.</p><br/><p>“Yes, he’s over.” The other people also sighed.</p><br/><p>When the footsteps vanished, Wei Sheng emerged out of the soil and a hint of confusion flashed through his eyes.</p><br/><p>A kill warrant?</p><br/><p>He shook his head and didn’t think about it. He found a hidden cave, set up some alarm jinzhi and entered meditation.</p><br/><p>Ten continuous days of battle had exhausted his ling power and mind, both were on the verge of collapse. If it wasn’t that his mentality was as strong as steel, he would have fallen a long time ago.</p><br/><p>On the second day, he opened his eyes, and a hint of joy flashed across them.</p><br/><p>He had a breakthrough!</p><br/><p>After recuperating a few more days in the cave and his energies recovered to peak condition, he stood up. Taking out the jie map jade scroll, he found his bearing and then flew in a direction.</p><br/><p>He didn’t know what the kill warrant was. He didn’t know that that kill warrant was causing a storm in the Hundred Savage Realm.</p><br/><p>———</p><br/><p>“What? They suddenly sped up?” Marshal Hao was slightly surprised. “They didn’t change their destination?”</p><br/><p>“No,” the middle-aged man said. “It seems that they have already detected it.</p><br/><p>Marshal Hao did not speak. He was deep in thought. A moment later, he raised his head. “It seems that Xiao Mo Ge already knows who their enemy is. Oh, have our people stop the harassment.”</p><br/><p>“Stop the harassment?” The middle-aged person was surprised. “Isn’t that just…?”</p><br/><p>“It’s nothing.” Marshal Hao sneered. “We aren’t Xuan Kong Temple’s subordinates, we don’t need to give them too much face. Xuan Kong Temple probably won’t have an easy time in this fight.”</p><br/><p>The middle-aged man didn’t understand why Father would say such a thing.</p><br/><p>“Xiao Mo Ge is really daring!” A hint of admiration flashed through Marshal Hao’s eyes.</p><br/><p>———</p><br/><p>“Why this direction?” Zuo Mo asked in confusion to Pu Yao and Wei.</p><br/><p>He, Ceng Lian’er, and A Gui, were furiously flying forward. In order to avoid the scouts along the way, they did not ride mo steeds but flew on their own.</p><br/><p>Zuo Mo had designed and extremely daring plan.</p><br/><p>He decided to lure the two old fanxu thieving baldies away in a huge circle. Just like how Xuan Kong Temple were not willing to put their fanxu in danger, Zuo Mo was not willing to have these two thieving baldies enter the battlefield and affect their chances of victory.</p><br/><p>Zuo Mo was full of confidence in Bie Han and Gongsun Cha. As long as these two old thieving baldies did not attend the battle, Zuo Mo believed they would win.</p><br/><p>If Gongsun Cha and Bie Han defeated Jiang Zhe, it would be enough to cause Xuan Kong Temple to descend into chaos.</p><br/><p>If he could delay until that time, the two old thieving baldies would no longer have the time to chase him. They would have to go back to steady the sect and his predicament would be resolved.</p><br/><p>The crux of this strategy was a race of time.</p><br/><p>On his end, the longer that he could drag this out, the more beneficial it would be. The other side with Gongsun Cha and Bie Han, the faster they defeated Jiang Zhe, the safer he would be.</p><br/><p>If he had to face the two old fanxu thieving baldies head on, Zuo Mo definitely did not have a chance.</p><br/><p>But if he was playing hide-and-seek, Zuo Mo did not fear it. With Pu Yao and Wei present, these two cunning people, Zuo Mo thought that the two old thieving baldies wouldn’t stand a chance.</p><br/><p>In order to lure the two old thieving baldies to take the bait, Zuo Mo had deliberately left behind a trace of shen power. Last time, the four great sects with Lin Qian as the leader had made such a big ruckus for the Great Peace Mo Stele. Zuo Mo knew that these people had an obsession with shen power.</p><br/><p>He hadn’t thought that having just stepped out of the camp, Pu Yao and Wei had Zuo Mo flying in this direction.</p><br/><p>Zuo Mo muttered inside, there was a conspiracy!</p><br/><p>Translator Ramblings: Reunions are always so short. Xuan Kong Temple needs better allies.</p><br/>\n</div>"}