{"title": "Chapter Six Hundred and Eighty Five – Becoming Better", "id": 735, "volume": 8, "url": "http://boxnovel.org/world-of-cultivation-chapter-six-hundred-and-eighty-five-%E2%80%93-becoming-better", "volume_title": "Volume 8", "body": "<h1>Chapter Six Hundred and Eighty Five – Becoming Better</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Six Hundred and Eighty Five – Becoming Better</p><br/><p>Tian Huan.</p><br/><p>Countless lights suddenly appeared inside a deep cave behind the mountains. The lights contained great power. The moment that they formed, all of Tian Huan was disturbed.</p><br/><p>An old and slightly mad voice echoed out of the cave.</p><br/><p>“Haha! Shen glyph! This old man finally succeeded! This old man finally succeeded! Ancient shen glyph. Haha, no, in the future, it will be called the Tian Huan shen glyph!”</p><br/><p>The mad laughter of the person that was speaking to himself caused the Tian Huan elders that had flew over to be stunned where they stood.</p><br/><p>But in the next moment, ecstasy rose onto their faces.</p><br/><p>Shen glyph!</p><br/><p>Every disciple of Tian Huan, who had started by using seal formations, knew the meaning of these two words!</p><br/><p>———</p><br/><p>Shen power flowed through his entire body. Zuo Mo’s gaze was pure and clear.</p><br/><p>In his sea of consciousness, Pu Yao paid close attention to every change of shen power inside Zuo Mo’s body. All of these changes were recorded. Pu Yao’s rich experience and vast knowledge would help prevent Zuo Mo from making many mistakes, but what was most important was that Pu Yao was a sky yao. His terrifying ability to create simulations from the torturous sea of yao spells meant that he could help Zuo Mo perfect his shen power cultivation quickly.</p><br/><p>Shen power was much more complex than yao arts and the work to reconstruct the method was unprecedentedly vast and complex. Even Pu Yao did not have any spare time for other matters and was forced to leave all of those conspiracy matters to Wei.</p><br/><p>Pu Yao and Wei were not in disagreement about this division of labour. Their opinions were unusually in agreement.</p><br/><p>In their view, there had to be a pattern that connected the three powers to shen power, a pattern that could be used to evolve into shen power. That was because the development of the three powers had reached a peak a long time ago. No matter if one was yao, mo, or xiuzhe, their pursuit of power was not different; the final stages of each power were highly similar.</p><br/><p>From the general trend, the arrival of the era of shen power was inevitable.</p><br/><p>The shen power that would develop would be very different from the shen power of the ancient era. While the two had the same name, the shen power of the present would be reconstructed from the three powers.</p><br/><p>Therefore, in Pu Yao’s view, the one that managed to stay ahead of the others would have the greatest advantage in this era of shen power.</p><br/><p>Zuo Mo’s luck was unspeakably good. Even Pu Yao and Wei sighed about it.</p><br/><p>But they could not just rest on their laurels. The inheritance of the Sun Tribe was able to dominate the ancient world but there were great differences between the ancient world and the present world. This inheritance was just a crude beginning, and there was still a great distance until it developed into a perfected cultivation method.</p><br/><p>For Zuo Mo, the content that Pu Yao was considering was too far in the future.</p><br/><p>Resolving the Undying Shen power was his only goal.</p><br/><p>“Alright, finish the battle,” Pu Yao said to Zuo Mo. There were numerous bright lines spinning furiously in the ball of light in front of him. If a normal person looked for a bit too long at the ball of light, they would feel dizzy.</p><br/><p>Each moving light represented a recording of a certain trait of shen power.</p><br/><p>Hearing this, Zuo Mo did not hesitate and immediately took out the Little Mo Treasure Cup.</p><br/><p>Clink!</p><br/><p>The treasure coin immediately penetrated through the chest of the Xuan Kong Temple elder and created a spurt of blood.</p><br/><p>Zuo Mo’s shen power was completely used up but, having experienced this before, he did not panic. He threw a sun seed into his mouth. When the sun seed entered his mouth, it turned into a warm flow and shen power filled his body again.</p><br/><p>The Little Mo Treasure Cup was powerful, but it consumed a great amount of shen power. The Little Mo Treasure Cup surpassed the limits of normal talismans. It could only be activated by shen power. It probably could be said to be the first shen power talisman in the world.</p><br/><p>The monster that A Gui had summon was extremely powerful. But what surprised Zuo Mo was by was that the shen power from this human-ape hybrid that wasn’t weak at all!</p><br/><p>The monster’s body was as hard as steel and unable to be damaged by flying swords. The spells of dhyana xiu were not as effective as it should have been against monster. Theoretically, the spells of dhyana xiu were most effect against dark and evil monsters. Zuo Mo felt that shen power might be the reason that the spells were not effective.</p><br/><p>The monster was unusually valiant, charging at the front, and A Gui’s figure was unpredictable. The Undying shen power killed people silently. The enemy was dodging right and left. If A Gui quickly found a weakness and then she only needed one attack!</p><br/><p>Of the three, the one having the hardest time was Ceng Lian’er.</p><br/><p>She had the advantage. However, the other’s talismans were endless and their cultivation was higher. Her shen techniques were powerful but it took time to use them. She had destroyed a few of the enemy’s talismans but hadn’t wounded the other.</p><br/><p>But she was smart. When she saw she could not do anything, she stopped using shen power. She managed to keep the enemy suppressed and didn’t give them the chance to run away.</p><br/><p>When this elder saw Zuo Mo and A Gui leap at him, a shocked expression came onto his face.</p><br/><p>Pew.</p><br/><p>The one who had delivered the killing blow was A Gui.</p><br/><p>The Undying shen power had sealed A Gui’s soul but her fighting instinct was the most terrifying in the trio.</p><br/><p>The three did not linger. They cleaned the corpses of the valuables and turned to leave.</p><br/><p>A while later, when the elder corpse of Xuan Kong Temple arrived, they saw the three stripped corpses on the ground and their expressions were extremely ugly.</p><br/><p>———</p><br/><p>“Here, here, here, here … …”</p><br/><p>Pu Yao pointed out seven things in one go. In front of him, Zuo Mo’s expression was focused and serious. The places that Pu Yao had pointed out where the areas that needed to be redeveloped and practiced again.</p><br/><p>These seven places were the result of Pu Yao spending three days studying the battle and modeling shen power.</p><br/><p>Even in Pu Yao’s time, he was not the most powerful sky yao. However, with the name of [Encyclopedia of Yao Arts], no one could rival his ability to understand and analyse yao arts.</p><br/><p>After working for three days, he showed signs of tiredness. However, the light in his eyes showed that he was extremely excited at this time.</p><br/><p>Perfecting shen methodology was something extremely difficult that there were only a rare few in the world who could do it.</p><br/><p>A new era was about to sprout from his hand. Oh oh oh, what was more exciting than this?</p><br/><p>Such great work!</p><br/><p>Maybe he could leave behind a great mark on history!</p><br/><p>He thought about his teacher having told him go to the First Yao Art House to leave behind his name. Compared to what he was doing now, that wasn’t worth a mention.</p><br/><p>He started to dream what great nickname would appear in front of his name.</p><br/><p>Oh, the father of new shen methodology. This nickname wasn’t bad!</p><br/><p>However, when his gaze landed on Zuo Mo’s focused face, he immediately refocused. He coughed lightly and continued, “Try out the changes in these seven places. I based the changes off some methods from spells and yao arts. From the models, it should increase efficiency by about three percent and would decrease the activation delay by five percent.”</p><br/><p>Zuo Mo carefully noted down the seven places that had been improved. A few percent of improvement seemed to be a very small number but Zuo Mo knew that the accumulation of these tiny numbers over time would be astounding.</p><br/><p>“You are still in the preliminary stages of mortal level. Accumulating shen power is the most important thing. There is no source of belief now, the increase in shen power will need to come from advancing the three powers. The greater your cultivation in the three powers are, the more shen power you will get every day. What is most important here is balance. How much shen power you can produce is decided by your lowest cultivation.”</p><br/><p>Pu Yao snickered. His expression was smug. “There aren’t many freaks are like you? Who cultivates three powers? For ones like Kun Lun, even if they now understand what shen power is, they need to start from the beginning in cultivating the three powers. Also, your right hand is a great boon of fortune.”</p><br/><p>Then his expression turned stern. “However, do not slack off. A great sect like Kun Lun had all kinds of methods once they understand the design. The resources they can invest are great!”</p><br/><p>Zuo Mo shook his head. “I will not slack off even one day until I resolve the Undying Shen Punishment.”</p><br/><p>Pu Yao stilled. After a moment of silence, he looked at Zuo Mo and nodded. He said, “That is good. You are someone with a foundation now. You might want to have the people at Cloud Sea Jie start to cultivate the other powers and prepare for cultivating shen power in the future.”</p><br/><p>Zuo Mo said, “You are right.”</p><br/><p>He had been cultivating shen power for a while and increasingly felt that shen power was much more powerful than the three powers. While it was more difficult to practice, the difficulty was being resolved gradually.</p><br/><p>Now, Zuo Mo could clearly feel that shen power was something that other people could cultivate.</p><br/><p>“Give me all the spells, yao arts, and mo skills you two have collected. ‘Pu Wei Library’ Access will be divided according to their service.” Zuo Mo looked at Pu Yao and Wei.</p><br/><p>Pu Yao said carelessly. “Alright.”</p><br/><p>Right now, Pu Yao was only interested in shen power. He did place any importance on what he had collected over the years. Maybe by doing this he could collect a copy of the Moon shen power inheritance.</p><br/><p>Wei nodded and said, “Alright.”</p><br/><p>Zuo Mo gave a smile. With Pu Yao and Wei’s collection, Cloud Sea Jie’s power would skyrocket in the short time. Also, with that, Cloud Sea Jie’s foundation would become more secure. The reason that the large sects had survived for thousands of years and not fallen was because, other than possessing a great amount of resources they had numerous spell inheritances.</p><br/><p>Adding on shen power in the future, Cloud Sea Jie would grow stronger.</p><br/><p>Having reached an agreement with Pu Yao and Wei, the remaining matters could be handled by Pu Yao through the Ten Finger Prison. He did not have to worry as he cultivated.</p><br/><p>Coming out of the sea of consciousness, Zuo Mo did not immediately cultivate. He still had to face the Xuan Kong Temple elder corps behind him. In his eyes, the enormous elder corps was a group of sparring partners. With every one that he killed, his shen power would grow.</p><br/><p>———</p><br/><p>The situation for the elder corps was very bad.</p><br/><p>Xiao Mo Ge was clearly more cunning than they had imagined. The death of the three elders reminded them that while the other was unable to face their combined might, the enemy had the power to kill them individually.</p><br/><p>Possessing astounding speed, great individual power, cunning, and devious. From every angle, Xiao Mo Ge seemed to be the one in the role of the hunter.</p><br/><p>The elder corps was already starting to regret this mission.</p><br/><p>Translator Ramblings: There’s more than one way to achieve shen power. Think of it as radiation, there’s light, the gamma rays, the infrared and others. Zuo Mo’s shen power is all three powers together but it’s not the only way.</p><br/>\n</div>"}