{"title": "Chapter Six Hundred and Ninety One – Bu Zhou City", "id": 741, "volume": 8, "url": "http://boxnovel.org/world-of-cultivation-chapter-six-hundred-and-ninety-one-%E2%80%93-bu-zhou-city", "volume_title": "Volume 8", "body": "<h1>Chapter Six Hundred and Ninety One – Bu Zhou City</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Six Hundred and Ninety One – Bu Zhou City</p><br/><p>“The power to protect comes at a price,” Wei said meaningfully. His deep gaze flashed with a light that was stubborn and determined.</p><br/><p>Zuo Mo stilled, looking away, he thought of A Gui.</p><br/><p>In terms of protection, there was probably none that was more determined than A Gui’s protection. But at the same time, there was no protection that carried such a cruel price.</p><br/><p>Was this what it meant to protect someone?</p><br/><p>Zuo Mo’s thoughts swirled.</p><br/><p>Wei did not speak. Pu Yao also maintained his silence. There was only the crackling of the eerie flames in the sea of consciousness.</p><br/><p>Moments later, Zuo Mo looked up and grinned to show an unconcerned smile. “You want to frighten me? Ha! From every angle, this seems to be a profitable business, why wouldn’t I do it? Tell me, tell me, how do I do this?”</p><br/><p>Wei looked deeply at Zuo Mo. “You are sure.”</p><br/><p>“So chatty, it is best to be quick. Ge is in a hurry to cultivate. Can you afford to waste ge’s time?” Zuo Mo glared.</p><br/><p>Wei smiled. “It is very simple.”</p><br/><p>As he finished saying this, the gravestone in Zuo Mo’s sea of consciousness suddenly shattered into pieces. It turned to black energy that became snakes that burrowed into Zuo Mo’s body.</p><br/><p>Then the black energy formed into a little gravestone inside Zuo Mo’s body.</p><br/><p>There were many complex grey patterns on the surface of the new formed gravestone. If one did not not closely, it would be hard to detect them.</p><br/><p>In this moment, Zuo Mo seemed to understand something.</p><br/><p>“To abide by your ceremony, to execute your wishes, to swear your oath, will you?”</p><br/><p>An ancient voice echoed in Zuo Mo’s mind. This scene summoned many memories. But Zuo Mo immediately detected a difference. Hm, the lines were not right!</p><br/><p>He remembered the first time it had been “To abide by my ceremony, to execute my wishes, to swear my oath.” How come it changed?</p><br/><p>But Zuo Mo did not hesitate for long. When he made his decision, his mind was filled with Wei’s words, the power to protect comes at a price.</p><br/><p>Taking a deep breath, the uncaring smile on Zuo Mo’s face faded. His expression became solemn and he said, “I’m willing!”</p><br/><p>When the words escaped his lips, the complex patterns on the surface of the gravestone suddenly lit up like a web of light.</p><br/><p>Zuo Mo’s mind blanked.</p><br/><p>Moments later, when he recovered from his daze and his eyes refocused, his first action was to touch his chest.</p><br/><p>A strange feeling came.</p><br/><p>When the gravestone had entered his heart in the past, it had felt rootless and intangible. But now, while the gravestone was still the gravestone, it seemed to have grown many roots in his heart.</p><br/><p>“This is it?” Zuo Mo asked Wei in puzzlement.</p><br/><p>Wei’s expression was slightly tired. But he still smiled and said, “Yes, you did not require much so the price you paid was not large. From now on, the effect of practicing your spells will be three times what it was before, and the price you need to pay is … …”</p><br/><p>“En?” Zuo Mo looked at Wei.</p><br/><p>“It is … …” Wei trailed off.</p><br/><p>The tendons in Zuo Mo’s forehead started to throb.</p><br/><p>“It is … …” Wei was smiling.</p><br/><p>“It is your mom!” Zuo Mo erupted. His temples throbbed as he howled angrily at Wei’s face.</p><br/><p>Wei had a faint smile as he calmly waved a finger. His expression was dignified. “Not my mom.”</p><br/><p>Zuo Mo almost went crazy. “I will kill you! I will kill you!”</p><br/><p>The most crucial information being withheld left Zuo Mo’s anger burning. If the heavens bestowed a metal rod to him right now, he would skewer this horrid person and burn him over a fire! Also, he would put on enough hot chili!</p><br/><p>Wei looked at Zuo Mo with a smile. That smile, that expression, it was like there was “come beg me, come beg me” written on his face.</p><br/><p>Zuo Mo gritted his teeth. To deal with a lowly person like this, it seemed he had to use his ultimate move!</p><br/><p>The anger on Zuo Mo’s face faded as he said darkly, “Wei, we should calculate rent. You have lived here a long time, but you haven’t paid rent! Right, ge only accepts jingshi and no other currency. Also, don’t think of using spells, mo skills, or other things to make up your debt, ge only wants jingshi!”</p><br/><p>Wei’s smile froze on his face.</p><br/><p>Pu Yao who had been watching silently stepped back and hid in the flames. It would not be good to appear in front of Zuo Mo at this time.</p><br/><p>If the city gates were burning, it would still affect the fish in the moats.</p><br/><p>Rent was a great problem … …</p><br/><p>“Oh, that, actually, your gravestone oath is very simple. There will be a day in every month that you will lose all power until your shen power can resolve the Undying Shen Power. How about it, this price isn’t too great, I had to work hard to obtain this for you. Choosing gravestone oaths is a highly technical matter and demands great experience, it isn’t something normal people … …”</p><br/><p>Wei nattered on as though he had done great favor by completing a hard task.</p><br/><p>“Humph!” Zuo Mo snorted coldly. He turned and then swaggered out of the sea of consciousness.</p><br/><p>Behind him, Wei wiped away his cold sweat. As expected, it was easy to forget himself … …</p><br/><p>Pu Yao stepped out of the flames with an expression of scorn.</p><br/><p>Coming out of the sea of consciousness, Zuo Mo was thinking.</p><br/><p>Losing all of his abilities for one day of the month in exchange for three times the effect when practicing spells, this was a very profitable transaction. However, this was a hidden weakness. If he encountered danger on the day that he lost all of his powers, then it was over for him.</p><br/><p>It seemed that he needed to make preparations.</p><br/><p>While this created a hidden weaknesses, Zuo Mo was still very satisfied with the gravestone oath. Three times the effect meant that his training time could shrink by two thirds.</p><br/><p>In the yard, Zuo Mo started to practice spells.</p><br/><p>He was using the [Bowstring Finger Spell]. This was a very complex and profound finger spell that was primarily based on finger movements. It belonged to a sect from before the thousand year war, and it was the sect’s founding spell. There were pitifully few high level finger spells in the present. There were only some crude spells such as the [Little Art of Cloud and Rain] that used finger movements.</p><br/><p>Xiuzhe currently believed that when the control of ling power reacted a certain level, they could leave behind finger movements.</p><br/><p>Theoretically, this was completely correct.</p><br/><p>But this finger spell was completely different. Its intentions was to use finger movements to allow xiuzhe with low cultivation to use higher level spells.</p><br/><p>From the moment he started to practice the finger spell, Zuo Mo immediately detected differences.</p><br/><p>His ling power seemed to have become more sensitive. Some parts that he did not understand before were much clearer. After practicing a few times, Zuo Mo’s finger movements became smoother and unlike the clumsiness of the past.</p><br/><p>As expected, it was effective!</p><br/><p>Zuo Mo became alert. Cultivating ling power had always been a painful matter for him. Zuo Mo was enchanted with the ease when he cultivated mo skills and yao arts. But today, the pain had flown away. Zuo Mo finally found that familiar yet unfamiliar feeling of ease.</p><br/><p>After practicing furiously for twelve hours, Zuo Mo had not slowed down, still hungry for more.</p><br/><p>This feeling was great!</p><br/><p>Based on this speed, Zuo Mo had enough confidence that he could raise his spell level to first-class in a short amount of time.</p><br/><p>He suddenly felt the Sky Shark descending.</p><br/><p>Someone knocked on the door.</p><br/><p>Zuo Mo’s consciousness spread and he saw the person who came. It was the leader of the sky shark guards.</p><br/><p>He waved his hand and the door opened on its own.</p><br/><p>“Honored Daren, our shark has reached Bu Zhou City. According to the original schedule, we will stay here for three days. If Daren finds staying on board boring, you may want to go explore,” the leader said respectfully.</p><br/><p>There were ways to inform all guests but the shark guard leader still decided to make the trip personally to show respect.</p><br/><p>Someone as strong as this was qualified to receive this respect.</p><br/><p>Zuo Mo nodded. “I understand.”</p><br/><p>The guard leader saw this and did not talk any more. He bowed and then left.</p><br/><p>“I have heard that Bu Zhou City produces White Ridge Snake Bones. It is of use to me,” Ceng Lian’er suddenly spoke up.</p><br/><p>“White Ridge Snake Bones?” Zuo Mo’s reaction was quick. “Your mo physique?”</p><br/><p>“En.” Ceng Lian’er nodded and explained. “A secret of our White Fang Clan. I learned from my father. The White Ridge Snake Bones can improve our White Fang mo physique. However, the White Ridge Snake Bones are only produced in a few places, Bu Zhou City being one of them.”</p><br/><p>Hearing this, Zuo Mo nodded and said, “Let’s go and see. I hope that you have enough luck to find some this time.”</p><br/><p>Ceng Lian’er smiled. While she had changed her appearance to a normal one, this smile was still filled with beauty.</p><br/><p>“A Heng, you have to help me kill him!” The young master of the Ji family gritted out. He had never been humiliated so. Being beaten and stripped naked had actually happened to him. Whenever he thought of what had happened that day, he wanted to find a crack in the ground and bury himself.</p><br/><p>It was too embarrassing!</p><br/><p>A Heng was not tall. His body was thin, his skin dark, his hair short and bristly. He was dressed in short robes and looked like a manual laborer without any presence of an expert.</p><br/><p>But a person like this was an existence that people in the Ji Family feared.</p><br/><p>A Heng looked with slightly pity at the Young Master. This idiot didn’t know what fate was awaiting him when he returned. However, he did not show any disrespect on the surface. He laughed lightly. “Young Master, do not worry. It is not so easy for someone to get away with shaming our Ji Family.”</p><br/><p>The Ji Family young master had an excited expression. “Haha, right! I will want to be present that day. I want to personally see how this guy will die!”</p><br/><p>When he finished, his tone was bloodthirsty and hateful.</p><br/><p>A Heng smiled dismissively. In his eyes, this kind of cruelty was just an expression of being useless.</p><br/><p>“He’s exiting the sky shark now,” a subordinate reported.</p><br/><p>Suddenly, a light flashed across A Heng’s eyes. He stood and walked outside.</p><br/><p>The young master of the Ji Family seemed to become excited. His eyes were red as he hurried behind A Heng.</p><br/><p>A Heng did not pay attention the young master. His body moved like lightning towards the place his subordinate had reported. People along the way were alarmed and moved aside.</p><br/><p>Almost at the same time, Zuo Mo seemed to feel something. However, his gaze moved towards the other side of the street. His expression couldn’t help but show a thread of shock.</p><br/><p>Hm, that was … …</p><br/><p>Translator Ramblings: What Zuo Mo swore here is a lower-level version of what he was offered way back in the beginning of the story. So not his entire soul and life.</p><br/>\n</div>"}