{"title": "Chapter Eight Hundred and Eight – Descendant of Greenvine", "id": 758, "volume": 8, "url": "http://boxnovel.org/world-of-cultivation-chapter-eight-hundred-and-eight-%E2%80%93-descendant-of-greenvine", "volume_title": "Volume 8", "body": "<h1>Chapter Eight Hundred and Eight – Descendant of Greenvine</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Eight Hundred and Eight – Descendant of Greenvine</p><br/><p>Zong Ru caressed the three-flanged Skanda Staff and didn’t maintain the mannerisms of a Dhyana expert at all.</p><br/><p>Zuo Mo was satisfied with this three-flanged Skanda Staff as well. Among all of his works, this three-flanged Skanda Staff was near the top. Other than the high level materials used in its design, the forging method and the designs were both outstanding.</p><br/><p>The most unique part about it was that Zuo Mo had left it partially incomplete. This design could be gradually perfected by Zong Ru so that the item would be better suited to him. This also gave him a new way of thinking. In the past, talismans were completely forged by forgers, and then the user would gradually learn to use it.</p><br/><p>But for top experts, their understanding of battle far surpassed forgers.</p><br/><p>This new idea, finishing the framework and then let the user perfect it. The talismans that formed would be more fitting to the needs of the user. There was no big meaning in pursuing the power of a talisman above all else. Zuo Mo who was experienced in combat knew that talismans suited to the user were the best talismans, not the ones that were most powerful.</p><br/><p>Zuo Mo named this three-flanged Skanda Staff as the Three Manifestations Treasure Staff.</p><br/><p>Zuo Mo didn’t have any plans about the remaining materials and of the people here, only Luo Li didn’t have a good talisman. However, when he thought about Luo Li’s eerie [Life-Death Lock] cultivation method, Zuo Mo had a headache.</p><br/><p>That spell was truly too eerie and hard to predict. After some methods from the Undying Shen Power had been added, the [Life-Death Lock] became even harder to understand. Even Zuo Mo, who had seen numerous shen methodologies, could not understand.</p><br/><p>Much less forge a talisman for Luo Li.</p><br/><p>Fortunately, Luo Li did not care about this at all. He stayed close to Wo Li everyday and the world did not exist in his eyes.</p><br/><p>A Gui had the [Undying Ghost], Eldest Shixiong had the God-Killing Blood Sword, Luo Li did not need anything. Zong Ru now had the Three Manifestations Treasure Staff. Even Silly Bird now had the [Coral Fire Perch]. In the end, Zuo Mo was the one with nothing.</p><br/><p>However, after remember that he had the Green Pulse String and the Anti Dragon Claw, Zuo Mo threw the problem to the back of his mind.</p><br/><p>He would first have to think about how to get out of the Summer Palace before anything else.</p><br/><p>They had flown for more than a dozen days. According to their travel speed, they should have travelled over ten thousand miles. Yet there was still not an end to the forest. This was not a good sign. However, the Ghost Mist Child dismissed it. He said that it was fast for the people that entered the Four Palaces in the past to come out in two months.</p><br/><p>Only then did everyone feel slightly reassured.</p><br/><p>The most patient one was Zong Ru. He held the Three Manifestation Treasure Staff in his hand and used the staff to absorb wish power from the sunlight in the past few days. The two black octopus eyes turned blacker like two holes of empty space that floated in the air.</p><br/><p>On their way, they did not encounter any more treasures like the coral wood.</p><br/><p>The sun was still poisonous. However, with the help of the Three Manifestation Treasure Staff, the wish power in the sunlight was unable to harm them.</p><br/><p>After walking for three days, there was still no end to the forest.</p><br/><p>Zuo Mo suddenly felt that the scene in front of them seemed to be familiar. He frowned and throughout for a long time. He finally remembered where he had seen this before, the Sun Shen Temple!</p><br/><p>The Greenwood Secret Realm that Big Brother Qing Lin guarded, wasn’t that very similar to this scene here?</p><br/><p>Was it … …</p><br/><p>His mind moved, and during rest time, he carefully reread the jade scroll that Big Brother Qing Lin had left him. There were many things recorded in this jade scroll, including the secret [Greenvine Shen Methodology] of the Greenvine Tribe. Qing Lin had hoped that Zuo Mo could encounter the descendants of the Greenvine Tribe and let them inherit this scroll.</p><br/><p>Seeing the item reminded him of the person. Seeing of the warm and welcoming expression of Big Brother Qing Lin, Zuo Mo felt a wave of sadness. As he thought of Big Brother Qing Lin’s last request- searching for the remains of his tribe. But despite his efforts, Zuo Mo felt even more guilty having no success. He had sent many people to the place that Qing Lin had marked on the jie map in search of the Greenvine Tribe. However, that place was now a desert and void of people.</p><br/><p>Because he cultivated sun shen power, Zuo Mo did not learn the [Greenvine Shen Methodology]. He only read it occasionally. This time, he read it seriously and many parts he had not noticed before were found. For example, he actually found the Green Pulse String mentioned in the scroll. This strange thing was a treasure that the Greenvine Tribe dreamed about. If they could cultivate the [Greenvine Shen Methodology] to a high degree, they did not need to refine the Green Pulse String in order to use it effectively.</p><br/><p>Naturally, Zuo Mo could not cultivate the [Greenvine Shen Methodology] to such a great level.</p><br/><p>However, when he saw that one who cultivated the [Greenvine Shen Methodology] could easily move and navigate through forests, he was overjoyed.</p><br/><p>He did not hope for many benefits from cultivating the [Greenvine Shen Methodology]. He would thank the heavens if he could get out of this endless forest.</p><br/><p>If Qing Lin learned that Zuo Mo began cultivating the [Greenvine Shen Methodology] just for its use in finding his way through a forest, he would climb out of his grave.</p><br/><p>While the Greenvine Tribe had not dominated like the Sun Tribe, it had been a large first-class tribe. The [Greenvine Shen Methodology] was something many tribes were jealous of!</p><br/><p>It was not difficult for Zuo Mo to cultivate the [Greenvine Shen Methodology]. He had a droplet of Greenvine Mystical Water in his body. This precious mystical water had helped him countless times.</p><br/><p>When he had encountered Qing Lin, Zuo Mo’s understanding of shen methodology had been pitifully low. He had been ignorant of many basic details. The present Zuo Mo had progressed far beyond that and knew much more about shen power. There were no obstacles in learning the [Greenvine Shen Methodology].</p><br/><p>A green energy floated onto Zuo Mo’s eyes.</p><br/><p>Countless feelings came from all directions like the tide through the forest.</p><br/><p>Suddenly, a familiar feeling came from deep within the forest.</p><br/><p>Was that … …</p><br/><p>Zuo Mo’s heart shook. Unhesitatingly, he stood and flew in a direction.</p><br/><p>The other people saw this and knew that Zuo Mo definitely had made a discovery. They followed closely behind.</p><br/><p>The further he flew, the more the familiar feeling from the forest grew. Zuo Mo’s eyes became even brighter. The vibration from the forest seemed to feel Zuo Mo’s existence and was furiously flying in his direction.</p><br/><p>When a green shadow flashed through the forest, Zuo Mo’s heart suddenly became excited and he did not hesitate to give chase.</p><br/><p>A thin and weak figure was jumping through the forest nimbly. A head full of verdant green hair reached his waist and danced in the wind.</p><br/><p>It was a young boy of about fifteen.</p><br/><p>Suddenly, Zuo Mo seemed seem to see that familiar elegant and tall figure with flying green hair in the Sun Shen Temple.</p><br/><p>The little boy’s eyes were like black opals. He warily examined Zuo Mo, puzzlement flashing through his eyes. The stranger in front of him gave him a feeling of closeness.</p><br/><p>“Who are you?” The young boy was slightly wary but he was not afraid. He stared with his opal black eyes at Zuo Mo. His clothing was woven from the vines of the forest, and the skin exposed to the air was tanned.</p><br/><p>“I’m Zuo Mo .” Zuo Mo’s lips couldn’t help but curve. The familiar vibrations coming off the child made him overjoyed. “What are you called?”</p><br/><p>“I am Qing Xiao.” The boy seemed to feel Zuo Mo’s friendliness and his wariness eased greatly.</p><br/><p>Zuo Mo suppressed the excitement he felt. “You are from the Greenvine Tribe?”</p><br/><p>“Ah! You too?” Qing Xiao immediately had an excited expression and he looked with anticipation at Zuo Mo.</p><br/><p>Zuo Mo smiled and flicked his finger. A dot of green flew out of his finger and turned into a green vine.</p><br/><p>“I can do that!” Qing Xiao was very happy. He copied Zuo Mo in flicking a finger. A green vine of light uncoiled like a snake.</p><br/><p>[Greenvine Shen Methodology]!</p><br/><p>Zuo Mo was full of emotion. Was there really fate? In the end, he had not failed to fulfill what Big Brother Qing Lin had requested?</p><br/><p>“Take us to your home, alright?” Zuo Mo said in a soft tone.</p><br/><p>“Alright!” Qing Xiao said happily. He immediately turned into a green shadow that shot out.</p><br/><p>Zuo Mo and the others hurriedly followed.</p><br/><p>A short while later, a small treehouse appeared in front of everyone. The treehouse was built on top of a thousand year old tree. There were many old vines hanging down. Qing Xiao was like monkey that grabbed a vine and flipped into the little treehouse. He said happily, “We’re home!”</p><br/><p>Zuo Mo looked around and asked in bewilderment, “Where’s everyone else? Don’t you live with your clansmen?”</p><br/><p>Qing Xiao’s expression dimmed. “I’m the only one left. Everyone died.”</p><br/><p>“Died!” Zuo Mo was stunned.</p><br/><p>“The sun is poisonous.” Qing Xiao’s expression recovered as he showed a bright smile and white teeth. “However, I’m not afraid, I will definitely find a solution!”</p><br/><p>Zuo Mo felt sorrow but he was used to seeing life and death so he did not lose his composure. After a moment, he recovered.</p><br/><p>He rubbed Qing Xiao’s head. “No matter, I have a solution.”</p><br/><p>Zong Ru reached out with the Three Manifestation Treasure Staff and tapped lightly on Qing Xiao. Threads of wish power crept out of Qin Xiao’s body like mist and were sucked into the two black balls.</p><br/><p>Qing Xiao’s eyes were wide and filled with curiosity. His body felt warm and unspeakably comfortable.</p><br/><p>“Aiya, it really worked!” Qing Xiao suddenly sat, touching his head and then his body. His clever and energetic appearance made them want to smile.</p><br/><p>Zuo Mo felt even greater affection for the innocent Qing Xiao. He said, “Qing Xiao, how about coming along with Big Brother? The sun outside isn’t poisonous!”</p><br/><p>“Alright!” Qing Xiao nodded. “I’m very bored here alone! Big Brother is a good person!”</p><br/><p>Zuo Mo heard this and smiled. He was also very happy. “Since you say Big Brother is a good person, Big Brother will have to express this.”</p><br/><p>“What is express this?” Qing Xiao looked curiously at Zuo Mo.</p><br/><p>“Close your eyes and channel shen power,” Zuo Mo said. Qing Xiao acknowledged this, obediently closing his eyes and channeling his shen power.</p><br/><p>Zuo Mo reached out a finger. A drop of water fell from his fingertip to land on Qing Xiao’s forehead and then disappeared.</p><br/><p>“Ah!” Qing Xiao explained. His face soon turned green.</p><br/><p>Greenvine Mystical Water!</p><br/><p>Zuo Mo was now giving the Greenvine Mystical Water that Big Brother Qing Lin had given him to Qing Xiao. The Greenvine Mystical Water had many benefits but for the present Zuo Mo, there were no great uses. However, for Qing Xiao, it was of great benefit.</p><br/><p>Moments later, Qing Xiao opened his eyes joyfully. “Greenvine Mystical Water! I know this! This is Greenvine Mystical Water!”</p><br/><p>Zuo Mo was unspeakably happy. He asid with as mile, “Big Brother also has something else to give you.” As he spoke, he took off the Green Pulse String on his wrist and tied it on Qing Xiao’s wrist.</p><br/><p>The Ghost Mist Child’s eyes were wide in disbelief!</p><br/><p>Green Pulse String!</p><br/><p>That was Green Pulse String!</p><br/><p>Qing Xiao was both excited and curious as he swung the Green Pulse String. It had to be said that the Green Pulse String was a natural match for the Greenvine Tribe. In just a short while, the Green Pulse String seemed to come alive on Qing Xiao’s hand.</p><br/><p>The Green Pulse String was powerful, but in Zuo Mo’s hands, it could not be used to its greatest power. In Zuo Mo’s hands, the greatest value of the Green Pulse String was the [Green Pulse] shen glyph.</p><br/><p>Zuo Mo’s heart was unusually calm and he seemed to understand. The last wishes of Big Brother Qing Lin had been a burden on his mind. After this burden was resolved, he felt relaxed as though a great weight had been taken off.</p><br/><p>His mentality had went a level further and became even more understanding.</p><br/><p>Translator Ramblings: I am so irritated with myself. I should have learned to read documentation thoroughly. Three years and now I learn WordPress supports markdown. So much wasted effort.</p><br/>\n</div>"}