{"title": "Chapter Eight Hundred and Eleven – Tian Huan’s Attack From All Fronts", "id": 761, "volume": 8, "url": "http://boxnovel.org/world-of-cultivation-chapter-eight-hundred-and-eleven-%E2%80%93-tian-huan%E2%80%99s-attack-from-all-fronts", "volume_title": "Volume 8", "body": "<h1>Chapter Eight Hundred and Eleven – Tian Huan’s Attack From All Fronts</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Eight Hundred and Eleven – Tian Huan’s Attack From All Fronts</p><br/><p>Tian Huan!</p><br/><p>When the results of the investigations came out, both Hong Xiao and Cang Ling Xue recognized the severity of the matter and immediately reported it.</p><br/><p>Tian Huan was attacking Mo Cloud Sea on the market from all directions. Many of the materials suppliers that were close with Mo Cloud Sea were forced to stop their partnerships with Mo Cloud Sea under the pressure of Tian Huan.</p><br/><p>This caused a break in Mo Cloud Sea’s supply chain of materials.</p><br/><p>In terms of shen equipment, Tian Huan started to widely advertise the Tian Huan shen equipment and also lowered their prices. The factions that had placed orders from Mo Cloud Sea all turned to thrown themselves into Tian Huan’s arms due to Tian Huan’s pressure and temptation.</p><br/><p>The sale volume of Mo Cloud shen equipment decreased as a direct result, and the cost to make Mo Cloud shen equipment was drastically rising.</p><br/><p>One important reason that Mo Cloud Sea’s shen equipment had gotten a good reputation so quickly was Tian Huan’s inaction. For so many years, Tian Huan had become used to people coming begging to their door. In the xiuzhe world, no sect dared to compete with them in forging.</p><br/><p>The present Tian Huan, after Chief Elder’s warning, started to reflect on their actions.</p><br/><p>If Mo Cloud Sea could only be called nouveau riche, then Tian Huan was definitely the hegemon of the market. For thousands of years, Tian Huan had been at the top of this market. After thousands of years, their tentacles reached into every corner of the xiuzhe market. The reputation they had, their resources, manpower, connections, they were something that Mo Cloud Sea that had just risen up could compare to.</p><br/><p>Before this, Tian Huan had never looked properly at Mo Cloud Sea. In their eyes, Mo Cloud Sea was not on the same level as them.</p><br/><p>Tian Huan had paid a great price for their pride.</p><br/><p>But Tian Huan woke up. They climbed down off their pedestal, and started to be proactive in the market. This kind of Tian Huan was astounding in its strength.</p><br/><p>The entire market turned into a storm.</p><br/><p>Tian Huan showed their fangs. In this field they had worked in for thousands of years, even Kun Lun could not match them. They were too familiar with what to do. There was no secret in their eyes.</p><br/><p>Tian Huan’s attack was even fiercer than Mo Cloud Sea imagined.</p><br/><p>In just a fortnight, almost forty percent of material suppliers stopped their partnership with Mo Cloud Sea and sided with Tian Huan.</p><br/><p>This happened so quickly that Mo Cloud Sea didn’t even have time to react.</p><br/><p>The production of shen equipment was forced to stop.</p><br/><p>Mo Cloud Sea was facing unprecedented danger.</p><br/><p>———</p><br/><p>In the sea of consciousness, Pu Yao and Wei had grave expressions.</p><br/><p>The danger that Mo Cloud Sea faced had been passed to Pu Yao from the Ten Finger Prison. Pu Yao and Wei were intelligent people and they immediately realized the level of trouble this indicated.</p><br/><p>They hadn’t thought that Tian Huan would really lower themselves to fight for market share with Mo Cloud Sea. Also, they were both shocked at Tian Huan’s strength in the market.</p><br/><p>Mo Cloud Sea’s transportation formations had been previously affected and there were only a few that were in use. The supply of materials had been a problem. What Tian Huan did pushed Mo Cloud Sea onto a precipice.</p><br/><p>Many materials were not high level, but they were used in large amounts. If they could not be replenished, shen equipment was not the only thing that stopped. Xi Xuan could provide materials, but not all materials could be transported from Xi Xuan. Due to internal chaos, many places in Xi Xuan had stopped production.</p><br/><p>Tian Huan’s move was both fast and vicious!</p><br/><p>The stoppage of shen equipment also affected Xi Xuan because Mo Cloud Sea could not complete the order before the discussed time.</p><br/><p>Pu Yao and Wei were both clear-headed. They knew that Tian Huan’s attack would not just be so. If they were Tian Huan, they would definitely be sending people to Xi Xuan right now.</p><br/><p>Mo Cloud Sea had shen equipment, Tian Huan also had shen equipment. They had more production capacity than Mo Cloud Sea. Tian Huan was much stronger.</p><br/><p>Also, once Tian Huan threw out the lure of an alliance, Xi Xuan wouldn’t have any ability to resist.</p><br/><p>Tian Huan was stronger than Mo Cloud Sea. Once Tian Huan gave up on the thought of attacking Xi Xuan, for Xi Xuan, they would be better allies than Mo Cloud Sea.</p><br/><p>Tian Huan was more powerful!</p><br/><p>At that time, Mo Cloud Sea would be in danger!</p><br/><p>Surrounded by three strong factions!</p><br/><p>It was really being surrounded in all directions. Even the Nine Great Dhyana Sects with its internal conflict could not stop the alliance of three powers. They would face the danger of being divided up. Even if Mo Cloud Sea and the Nine Great Dhyana Sects allied together, they would not be able to stop the three from advancing.</p><br/><p>At that time, the Nine Great Dhyana Sect would have to switch sides in order to survive.</p><br/><p>When it came to that step, Mo Cloud Sea would only have the path of death.</p><br/><p>Tian Huan really thought highly of Mo Cloud Sea!</p><br/><p>Pu Yao and Wei stared at each other, bitterness in their mouths.</p><br/><p>Mo Cloud Sea was in danger!</p><br/><p>———</p><br/><p>Chao Xin took a sip of wine. His expression was relaxed. “Tian Huan’s move is beautiful, an open conspiracy, a truly public conspiracy. They hit Mo Cloud Sea right on their weakness, Mo Cloud Sea is in danger.”</p><br/><p>Lin Qian smiled and said, “It seems that we will get peace for a while. Cooperate with Tian Huan and have the battalions on Xi Xuan’s borders move back, let Xi Xuan relax.”</p><br/><p>The two were in good moods.</p><br/><p>Compared to the declining Xi Xuan, the lively Mo Cloud Sea was the eyesore in Kun Lun’s eyes. Mo Cloud Sea was unstoppable in the mo territories, and showed great offensive power which caused all of Kun Lun to be uneasy.</p><br/><p>If Tian Huan’s strategy was completed, then a situation where three strong forces attacking Mo Cloud Sea would form.</p><br/><p>Mo Cloud Sea would not be able to escape even if it had wings.</p><br/><p>No one had thought that the seemingly powerful Mo Cloud Sea had such a fatal weakness. Tian Huan’s successive attacks exposed Mo Cloud Sea’s weakness to the world.</p><br/><p>Mo Cloud Sea was too small!</p><br/><p>From the viewpoint of safety, this was more beneficial for defense. However, for a faction with forging at its core, this was undoubtedly fatal. Once the supply of materials was cut off, they would end up in a dangerous position.</p><br/><p>Battalions, battle generals, they were all useless at this point.</p><br/><p>This was another battlefield.</p><br/><p>Chao Xin’s mind shifted and another plan formed. “We can have the people from the Nine Great Dhyana Sects make a fuss, and urge the other five sects. Tian Huan would also do the same, they also have people inside.”</p><br/><p>“This idea is good.” Lin Qian’s eyes lit up. “Those people people will be forced to stay neutral at such a time to not offend either side.”</p><br/><p>“Neutrality is enough.” A cold light flashed through Chao Xin’s eyes. “Neutrality at this time is making things worse for Mo Cloud Sea!”</p><br/><p>“Mo Cloud Sea will not be able to escape this time!” Lin Qian said, and his expression became excited.</p><br/><p>Mo Cloud Sea was his great worry!</p><br/><p>———</p><br/><p>“Tian Huan’s envoy went to see the sect leader,” the subordinate reported in a low voice.</p><br/><p>Zhong De’s scar-covered face was like granite. “What did they say?”</p><br/><p>The first person that Tian Huan’s envoy came to see was Zhong De. However, Zhong De had refused the meeting. Zhong De was an experienced person. This person came to Xi Xuan yet the first he met with was not the sect leader but Zhong De. Their intentions were malicious, wanting to spark internal discord.</p><br/><p>If the sect leader didn’t know that he only had three years left to live, it would be hard for him not to become suspicious at this time.</p><br/><p>“They said that Mo Cloud Sea will not be able to finish the remaining shen equipment and they are willing to provide shen equipment.” The subordinate reported in detail, “They said that these shen equipment have been specially designed by them for Xi Xuan. Also, they are willing to sign an alliance agreement with us to not fight. Also, if Kun Lun invades Xi Xuan, Tian Huan will definitely announce war against Kun Lun. This agreement is for ten years.”</p><br/><p>Zhong De had people around the sect leader and naturally learned all this.</p><br/><p>“And then?” Zhong De is expressionless.</p><br/><p>“The sect leader did not respond and said to meet again in a few days,” the subordinate said.</p><br/><p>“Sect Leader has been persuaded,” Zhong De said coolly.</p><br/><p>As expected by Zhong De, on that night, the sect leader came to Zhong De’s camp.</p><br/><p>“What does Uncle Zhong think about Xi Xuan allying with Tian Huan?” the sect leader did not waste words and headed straight into the topic.</p><br/><p>The matter of buying shen equipment was a minor matter.</p><br/><p>“What does Sect Leader think?” Zhong De asked expressionlessly in response.</p><br/><p>The sect leader said, “I feel that this may work. We allied with Mo Cloud Sea to guard against Kun Lun and Tian Huan. If we ally with Tian Huan, it is undoubtedly more beneficial and we can gain ten years of peace.”</p><br/><p>Zhong De listened expressionlessly, but he was slightly surprised inside. He had originally thought the other would be bewitched by the envoy and hadn’t thought that the sect leader also foresaw that the alliance would only survive for ten years.</p><br/><p>“If we have ten years, our Xi Xuan will be able to recover. This way, we may be able to vie for the world!” A hint of excitement flashed through the sect leader’s eyes.</p><br/><p>Ten years!</p><br/><p>If he had ten years, the sect leader was confident that Xi Xuan could rise again based on their foundations. At that time, without Zhong De, he would be in power alone … …</p><br/><p>A hint of disdain flashed through Zhong De’s eyes. However, the excited sect leader did not notice it.</p><br/><p>“I do not agree,” Zhong De said slowly.</p><br/><p>It was as though a bucket of cold water had been poured on the sect leader’s head. He was stunned where he stood, looking dazedly at Zhong De. A moment later, he asked in disbelief, “Why does Uncle Zhong not agree?”</p><br/><p>He didn’t understand why Uncle Zhong would not agree. He said urgently, “Uncle Zhong, are you afraid that they will break the alliance? They said that they are willing to make a sect leader oath.”</p><br/><p>The oath of a sect leader was something that could not be broken for any sect. Because once the sect leader oath was broken, all of the sect would be affected. The xiuzhe of the entire sect would be weakened in power.</p><br/><p>In history, there had never been an example of a sect leader oath being broken.</p><br/><p>“I do not agree.” Zhong De said expressionlessly and then turned to leave.</p><br/><p>The sect leader of Xi Xuan was dumbstruck where he stood.</p><br/><p>———</p><br/><p>“Daren, why do you not agree?” Zhong De’s subordinate asked in puzzlement. He had helped Zhong De guard the Abyss Fiend Prison for many years, and was highly trusted by Zhong De.</p><br/><p>He felt it was strange. From every angle, allying with Tian Huan was beneficial for Xi Xuan.</p><br/><p>Zhong De seemed to not hear it. Like stone, he gazed at the distant darkness.</p><br/><p>Translator Ramblings: The resilience of Mo Cloud Sea is that even if Zuo Mo isn’t present, things still work because he has capable people working under him.</p><br/>\n</div>"}