{"title": "Chapter Eight Hundred and Thirteen – Allies", "id": 763, "volume": 8, "url": "http://boxnovel.org/world-of-cultivation-chapter-eight-hundred-and-thirteen-%E2%80%93-allies", "volume_title": "Volume 8", "body": "<h1>Chapter Eight Hundred and Thirteen – Allies</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Eight Hundred and Thirteen – Allies</p><br/><p>When Zuo Mo’s group escaped from the ruins, the ruins behind them had completely collapsed. Shattered fragments of stone flew and floated in air as though they were weightless.</p><br/><p>The stones stretched out for thousands of li and looked like a thick and low-hanging cloud.</p><br/><p>The Lotus Sutra Temple disciples that had been waiting near the ruins were stunned by the sudden collapse.</p><br/><p>Lotus Sutra Temple’s sect leader changed expression. The scene in front of her was too astounding. Had Zuo Mo encountered great danger? The more she thought, the uglier her expression became. At this time, if something happened to Zuo Mo, Mo Cloud Sea was over. Unlike other sects, Lotus Sutra Temple did not have many choices left to them. Lotus Sutra Temple had just burned their ties with Kun Lun and Tian Huan could only live if they sided with Mo Cloud Sea.</p><br/><p>She might have regrets, but she was not an ordinary person. She knew that saving the other was her only choice as Mo Cloud Sea was in great danger at thi moment. She was already tied with Mo Cloud Sea, prospering and declining together.</p><br/><p>Aftering learning that Mo Cloud Sea lacked materials, she had transported a batch of materials to Mo Cloud Sea.</p><br/><p>But Lotus Sutra Temple was too small, and did not have any outstanding abilities to produce materials. The other sects, afraid of Tian Huan, did not sell materials to her.</p><br/><p>The sect leader of Lotus Sutra Temple was burning in urgency but Zuo Mo and the other had not come out. She waited outside the entrance of the ruins in order to see Zuo Mo as soon as possible.</p><br/><p>When the sect leader saw the figures of Zuo Mo and the others, she finally sighed in relief.</p><br/><p>“Let’s go!” she said urgently.</p><br/><p>Zuo Mo saw the urgency of the sect leader and immediately realized that something must have happened. “What is it?”</p><br/><p>“We’ll speak on the way.” The sect leader of Lotus Sutra Temple flew out first.</p><br/><p>Seeing this, Zuo Mo did not linger and followed immediately. Everyone else knew that something had happened and the mood of the group became heavy.</p><br/><p>When Zuo Mo heard the sect leader of Lotus Sutra Temple explaining the situation, his heart continued to sink. He immediately ran into the sea of consciousness and asked when he found Pu Yao and Wei. “Why didn’t you tell me?” He knew that Pu Yao definitely knew long ago. With Pu Yao’s strength, he was able to connect to the Ten Finger Prison from within the ruins.</p><br/><p>“What’s the use in telling you?” Pu Yao snorted.</p><br/><p>Zuo Mo was speechless, unable to think of a response. He had been in the ruins surrounded by danger at the time. If he had been distracted even in the slightest, then he would have died in the ruins.</p><br/><p>Zuo Mo relaxed his tone, his brow creased, “What solutions do you have?”</p><br/><p>“These are the suggestions that Hong Xiao and Cang Ling Xue gave us.” Pu Yao threw over a ball of light.</p><br/><p>Zuo Mo received it and countless words flew through his mind.</p><br/><p>Hong Xiao and Cang Ling Xue’s suggestions were to the point. First was to push out stronger shen equipment to increase Mo Cloud Sea’s fame. Second was to see if they could advertise shen equipment to the mo and the yao. Mo Cloud shen equipment was most suitable for Mo Cloud system shen power, and was the primary shen equipment of Mo Cloud Sea. However, the mo shen power and the yao shen power were completely different. If they could make shen equipment of these two types, it would definitely be welcomed. Third was to attempt to purchase materials from the mo and yao realms. This way, they could avoid the sanctions of Tian Huan. Fourth was to increase ling farming on the forty four newly conquered jie to increase production of materials.</p><br/><p>Zuo Mo read through carefully and was slightly reassured. It had to be said that these suggestions were all good. If they could follow these suggestions, they could break Tian Huan’s monopoly of the xiuzhe world. Right now, Mo Cloud Sea had expanded to one hundred and thirteen jie. While this could not compare to Kun Lun and Tian Huan, it could be considered large.</p><br/><p>“Follow these suggestions, have Golden Crow Camp start work.” Zuo Mo thought of Golden Crow Camp and then suddenly thought of Xi Xuan’s astounding large shen equipment order. Based on the present situation, the order was in danger … …</p><br/><p>Wait!</p><br/><p>Xi Xuan!</p><br/><p>Zuo Mo’s expression changed slightly.</p><br/><p>He suddenly realized that the crux of the entire matter was not all the supplies, but Xi Xuan’s alliance! From the breakdowning in the supply chain, stealing their market share, all of this was like a chain tightening on their necks. While they would feel suffocated, it would not be immediately fatal.</p><br/><p>What was truly fatal was a change in Xi Xuan’s attitude!</p><br/><p>Xi Xuan was the most important point. If Xi Xuan sided with the enemy, they would immediately be surrounded on three sides! The first to fall would be the Nine Great Dhyana Sects. The five sects that were still resisting now would have to submit to Kun Lun and Tian Huan.</p><br/><p>Would Xi Xuan change sides!</p><br/><p>Zuo Mo’s head was a mess. He was one of the few that knew that Zhong De only had three years left to live! Would Xi Xuan change sides? If Kun Lun and Tian Huan agreed to an alliance, then definitely! If they allied with Kun Lun and Tian Huan, they could follow the two factions and divide the Nine Great Dhyana Sects and Mo Cloud Sea. The declining Xi Xuan might be able to turn the situation around. He could see this, and he didn’t believe that Xi Xuan couldn’t see it.</p><br/><p>Damn it!</p><br/><p>Zuo Mo’s expression became ugly.</p><br/><p>Finding a remote location, the sect leader of Lotus Sutra Temple said, “Yuan Hao said for you to immediately contact him after coming out.”</p><br/><p>Zuo Mo took a deep breath. He knew that the more urgent the situation, the more he had to remain calm.</p><br/><p>———</p><br/><p>“Tian Huan made a great move!” Gu Liang Dao shook his head and said, his expression worried, “This time, Brother Zuo is probably in trouble.”</p><br/><p>Shuang Yu’s expression was also serious. He said, “Is there no way of solving this?”</p><br/><p>Xiao was at the side with a terrible expression.</p><br/><p>“The crux is Xi Xuan.” Gu Liang Dao’s face imperceptibly twitched. These two words would always easily pierce his heart. The twitch was so minute that even Shuang Yu didn’t detect it. Gu Liang Dao’s expression was dark but his tone calmed. “Zhong De only has three years, more accurately, slightly more than two years. Without Zhong De’s support, the death of Xi Xuan is just a matter of time. The people from Xi Xuan can definitely see this. If they ally with Tian Huan, this is a rare chance for Xi Xuan.”</p><br/><p>Shuang Yu was slightly puzzled. Mo Cloud Sea who had seemed to be prospering just a few days ago seemed to be suddenly surrounded by enemies, and was also at the end of its tether!</p><br/><p>“Send materials to Mo Cloud Sea, as much as we have,” Gu Liang Dao said.</p><br/><p>Xiao did not waste words. “Yes!” He said rapidly. “We also have some extra money and can buy some materials.”</p><br/><p>“Send them all!” Gu Liang Dao waved his hand.</p><br/><p>Xiao nodded. He didn’t speak and turned to leave quickly.</p><br/><p>Shuang Yu raised his face to look at Gu Liang Dao.</p><br/><p>“While it is minuscule, we should do as much as we are able.” Gu Liang Dao had a determined expression. “No matter if it is for the common good or for ourselves, we cannot watch as Mo Cloud Sea falls.”</p><br/><p>A light flashed through Shuang Yu’s eyes. “What are we going to do?”</p><br/><p>He was unusually respectful of his brother. Seeing Gu Liang Dao’s spirited expression, he was similarly fearless. This was also why he followed Gu Liang Dao and did not stay at Xi Xuan.</p><br/><p>“Kill Tian Huan!” Gu Liang Dao’s gaze was sharp as he said.</p><br/><p>———</p><br/><p>In the mirage, Yang Yuan Hao had a tired expression. The pressure he had been under in this period of time was unimaginable. The five large sects that had been of one mind began to have differing opinions after seeing Tian Huan’s fierce attacks and Mo Cloud Sea’s dilemma.</p><br/><p>Compared to the fighting on the battlefield, internal fighting made his mind feel even more tired.</p><br/><p>“Brother Zuo, you have been well since we last met.” Even at this time, Yang Yuan Hao’s speech and conduct was flawless. His handsome face recovered its usual calm.</p><br/><p>“It is not well, it is great trouble.” Zuo Mo grimaced.</p><br/><p>Yang Yuan Hao grinned but his expression quickly became stern. “The situation is truly terrible. According to the information new got, Tian Huan’s envoys have already reached Xi Xuan. The conditions they set are very detrimental to us.”</p><br/><p>“What conditions?” Zuo Mo asked.</p><br/><p>“Sect leader oath for a defensive pact. Tian Huan will have a duty to help Xi Xuan fend off other attacks. In other words, if Xi Xuan is attacked, Tian Huan will have to announce war on the other. For ten years!” Yang Yuan Hao’s expression was terrible.</p><br/><p>Zuo Mo was not too surprised. Tian Huan had been so fierce in their opening moves, how could their killing move be soft? He laughed. “Tian Huan really thinks highly of Mo Cloud Sea, they are willing to pay the price of not touching Xi Xuan for ten years.”</p><br/><p>“Yes! Tian Huan has an expert directing them.” Yang Yuan Hao nodded and a hint of admiration flashed through his eyes. “But I have to admit that their move is beautiful, and we are very discomforted.”</p><br/><p>Zuo Mo asked, “How’s the situation on your side?”</p><br/><p>“Not very good!” Yang Yuan Hao shook his head. “They are fighting a lot. The majority are remaining neutral, these short-sighted people!”</p><br/><p>Having this proven, Zuo Mo was even more calm. This was within his prediction.</p><br/><p>“What do you plan on doing?” Yang Yuan Hao looked at Zuo Mo.</p><br/><p>He was filled with curiosity. Facing such a situation, what would Zuo Mo, who had produce miracles, do?</p><br/><p>From a long time ago, he had paid attention secretly to the master of Mo Cloud Sea who did not seem very outstanding. In his view, the rise of Mo Cloud Sea was a spectacular legend yet was reliant on chance. But there was a person that attracted his attention, the master of Mo Cloud Sea, Zuo Mo.</p><br/><p>Examining Zuo Mo’s history, he found to his shock that Zuo Mo had never truly lost. Zuo Mo was like an undying juggernaut. He would also successfully flip the situation when people thought that all hope was lost, and would take a bite of the richest spoils!</p><br/><p>One time was luck, but multiple times, that was not luck.</p><br/><p>So when Yang Yuan Hao found that Mo Cloud Sea was in an unprecedented situation, he was under pressure but he was also curious.</p><br/><p>In such a terrible situation, what would Zuo Mo do?</p><br/><p>“What would you choose?” Zuo Mo suddenly raised his head and asked.</p><br/><p>“Me?” Yang Yuan Hao had a surprised expression. He perceptively detected the importance of Zuo Mo’s sentence. Zuo Mo said “you” and not “your side.”</p><br/><p>“Yes, you!” Zuo Mo emphasized the word “you.” He looked directly at Yang Yuan Hao and said calmly, “Your situation is bad as well. After this matter, discord will have been sown. There will be a divide between the five great sects. Just relying on Thunder Sound Temple and Lotus Sutra Temple, you cannot do a thing. They can side with Tian Huan or Kun Lun, but what will you do?”</p><br/><p>“Siding with them is not a bad matter.” Yang Yuan Hao shrugged.</p><br/><p>“And then?” Zuo Mo stared at him, each word hitting his heart. “You will be marginalized, then alongside the rest of the Nine Great Dhyana Sects, become cannon fodder for Tian Huan and Kun Lun. Don’t say it won’t happen, you understand them as well. Their traditions are deeply rooted, they are strong internally. You will never be able to squeeze into their inner circle. To them are there any cannon fodder better than you?”</p><br/><p>The speech caused Yang Yuan Hao’s expression to shift, and the sect leader of Lotus Sutra Temple behind Zuo Mo seemed to make a decision.</p><br/><p>“At least, I will live longer.” Yang Yuan Hao raised his head and shot back, “Worry about yourself first and about how to stay alive!”</p><br/><p>Zuo Mo did not speak but just a cold and sharp smile.</p><br/><p>Translator Ramblings: Everyone has to pick sides in this. Being neutral means getting killed.</p><br/>\n</div>"}