{"title": "Chapter Eight Hundred and Ten – Awaken", "id": 760, "volume": 8, "url": "http://boxnovel.org/world-of-cultivation-chapter-eight-hundred-and-ten-%E2%80%93-awaken", "volume_title": "Volume 8", "body": "<h1>Chapter Eight Hundred and Ten – Awaken</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Eight Hundred and Ten – Awaken</p><br/><p>The forest treeline ended abruptly, it was a clear dividing line.</p><br/><p>On one side of the line was a dense forest, and on the other a great ocean. On one side was a bright sun and hot day, on the other a furious storm.</p><br/><p>The clouds were black, and the curtain of rain carried hail that smashed into the ocean. The seawater was pulled up dozens of li into the air by the furious wind. Lightning flashed and thunder roared in the space between the clouds and the water.</p><br/><p>Everyone’s expressions became serious. Everyone could feel the furious power contained within the storm.</p><br/><p>Yet, except for charging forward, they had no other choice.</p><br/><p>“Form the battle formation! Everyone, pay attention to the positions of those around you.” Zuo Mo ordered. Then he grabbed Qing Xiao and turned to say to Zong Ru. “See if the Three Manifestation Treasure Staff can draw away the lightning.”</p><br/><p>Zong Ru nodded to indicate he understood. Everyone was trained and quickly finished the battle formation. Wei Sheng, Ceng Lian’er and the other experts entered the core positions.</p><br/><p>In Mo Cloud Sea, no matter your skill level, you had battle formation training. Even Wei Sheng was not an exception. In Zuo Mo’s view, the top experts that could merge into a battle formation were the ones that would be able to express their greatest power in large scale battles.</p><br/><p>This was something he copied from the mo fighting methods. Among the mo, the battle general was the strongest. All the power would gather on the battle general who would then attack.</p><br/><p>At Wei Sheng’s level, he understood more about battle formations than the average battle generals he was more sensitive towards power and had stronger control.</p><br/><p>Seeing the magnificent composition of this battle formation, Zuo Mo had some confidence. He said with bravado, “Go!”</p><br/><p>The group headed into the storm.</p><br/><p>Even though they had a guess, when they truly charged into the storm, that feeling was completely different!</p><br/><p>Once they charged into the storm, they felt their vision darken. Their ears were filled with howling of the win and they could not hear anything else. The furious winds were like blades and caused sparks to fly when they hit the barrier of the battle formation. Rain and hail smashed down. The rain seemed to contain a certain corrosion ability. When the hail hit the light shield of the battle formation, it immediately spread outwards forming a patch of frost.</p><br/><p>The power of the storm was endless. The people in the formation were like leaves flying in the wind, unable to stabilize themselves.</p><br/><p>Light flashed in the clouds above them. Suddenly, a thick bolt of lightning came out of the cloud layer and hit the battle formation.</p><br/><p>Zong Ru who had been prepared raised his Three Manifestation Treasure Staff without any hesitation.</p><br/><p>Hiss-crack-crack!</p><br/><p>The thick lightning accurately hit the Three Manifestation Treasure Staff.</p><br/><p>Zong Ru felt his hand become heavy from numbness. The round clear ball of the Three Manifestation Treasure Staff suddenly lit up with light. The lightning burrowed into the Thunder Source Hammer and the Thunder Source Hammer lit up with silverlight.</p><br/><p>Zong Ru sighed in relief. The Three Manifestation Treasure Staff was strong!</p><br/><p>At this time, the sky suddenly flickered. Zong Ru’s expression changed slightly. Before he could react, hiss-crack-crack, three successive thick bolts of lightning hit his Three Manifestation Treasure Staff.</p><br/><p>Zong Ru felt as though his chest was hit with a heavy hammer and gave a muffled grunt.</p><br/><p>The Three Manifestation Treasure Staff was untouched. After swallowing four lightning bolts, the Thunder Source Hammer had an even brighter silver light. There was a layer of snapping electricity around it.</p><br/><p>Zuo Mo seemed to be facing a great enemy. There was a strange power inside the raindrops that were battering the light shield of the battle formation.</p><br/><p>The power of each rain droplet was small but it was a great storm outside. In every moment, there were uncountable droplets of rain that were hitting the light shield of the battle formation. Everyone’s energies were being expended.</p><br/><p>Adding on the hail!</p><br/><p>Damn it!</p><br/><p>Zuo Mo was anxious but not panicked.</p><br/><p>Zong Ru had the Three Manifestation Treasure Staff for the lightning. Then what about the rain and the hail? His eyes suddenly lit up. How had he forgotten this?</p><br/><p>With a flip of his hand, a tattered banner appeared on his hand. The Rain Commanding Banner!</p><br/><p>Zuo Mo threw it to the Ghost Mist Child. “Do you know how to use this?”</p><br/><p>The Ghost Mist Child had been thirsting after the Rain Commanding Banner. He had high affinity with the attributes of rain and this would be a suitable treasure for him. However, he knew that he was the newcomer and had not performed meritoriously. If he spoke up and asked for such a treasure, he would probably be beaten to death by Daren.</p><br/><p>Hearing Zuo Mo ask if he could use it, he was overjoyed. He nodded repeatedly, “Yes, yes!”</p><br/><p>Even in the past, the Rain Commanding Banner had been a top ranked treasure!</p><br/><p>Zuo Mo did not waste words and threw the Rain Commanding Banner to the Ghost Mist Child.</p><br/><p>The Ghost Mist Child had not lied. When he waved the Rain Commanding Banner, the rain droplets outside seemed to be obedient and opened a path. Everyone felt the pressure on them lessen. The corrosiveness of the rain droplets had been the greatest burden on their endurance. Now that it was gone, they all felt light.</p><br/><p>“Nice! You have some skill!” Zuo Mo praised with surprised on his face.</p><br/><p>The Ghost Mist Child puffed up his chest and stomach with a proud expression. However, with his child-like appearance, it looked ridiculous. But while he felt proud, he said humbly, “It is this Rain Commanding Banner that is easy to use.”</p><br/><p>Zuo Mo said generously, “Oh, not bad, the Rain Commanding Banner belongs to you now, do not waste a treasure like this!”</p><br/><p>The Ghost Mist Child was stunned by this free food that fell from the sky. With his daze, the rain droplets started to hit the battle formation’s light shield.</p><br/><p>“Work hard!” Zuo Mo swore, glaring. “If you cannot do good work, this will be taken back!”</p><br/><p>“Ah!” The Ghost Mist Child seemed to wake up and hugged the Rain Commanding Banner with an expression of panic. He hurriedly said, “I’ll work hard! I will definitely work hard!”</p><br/><p>The pressure lessened again.</p><br/><p>Zuo Mo sighed softly. He ignored this guy, he didn’t have a good head. The lightning and the storm had both been resolved. The only things left were the hail and the strong wind. Sparks flashed and disappeared on the light shield, circles of frost forming and disappearing.</p><br/><p>Resisting this was not a great expenditure for the battle formation.</p><br/><p>But who knew how large this ocean was?</p><br/><p>There were no problems in maintain the battle formation for five days. Ten days, it would be hard to manage. Fifteen days, it would be at the limits. Over fifteen days … …</p><br/><p>Zuo Mo asked Qing Xiao, “Have you come here before?”</p><br/><p>“No.” Qing Xiao obediently shook his head. There was no fear on his face as he looked with curiosity at the rain outside.</p><br/><p>Zuo Mo was slightly disappointed. He gritted his teeth. There were no solutions. They could only charge forward.</p><br/><p>After flying for ten days in the storm, there were no signs they were leaving the storm. They had tried to fly towards the clouds. If they were above the clouds, there would not be a storm. Yet when they went close to the cloud layer, countless lightning and thunder would smash towards them preventing them from ascending.</p><br/><p>That scene cared all of them. They did not hesitate to fly down. No one had seen such packed lightning and thunder. Even Zong Ru who held the Three Manifestation Treasures Staff would end up as dust under such terrifying lightning.</p><br/><p>Helpless, they could only move through the storm.。</p><br/><p>Seeing the undisguised exhaustion on everyone’s faces, Zuo Mo knew that they had to rest.</p><br/><p>“Everyone, stop for a while.”</p><br/><p>Zuo Mo called for everyone to stop and then took out a palm-sized city from his ring.</p><br/><p>[King’s Forbidden City]!</p><br/><p>The King’s Forbidden City grew rapidly in the sky and in a blink, covered everyone.</p><br/><p>In this moment, everyone felt the world had become quiet. The roaring had stopped. They seemed to be in a completely different world. The furious roars of the wind, the rain, and ice were outside while this place was peaceful. The mysterious and complex seal scripts that flashed in the sky above the city made everyone feel strangely safe.</p><br/><p>Their nerves had been tensed for ten days. Everyone was tired. Once they had the chance to breathe, they sat down and started to replenish their shen power.</p><br/><p>Zuo Mo’s power was quickly recovering. Inside the King’s Forbidden Firmament, his recovery was faster than any other person.</p><br/><p>This chance to breath was really too precious.</p><br/><p>Zuo Mo rejoiced that he had not forgotten about the King’s Forbidden Firmament.</p><br/><p>In these past years, Zuo Mo had spent time organizing his memories. He had uncovered some memory fragments hidden deep in his mind. The city of his childhood had been filled out in his mind, and he had reforged the King’s Forbidden Firmament.</p><br/><p>With his deeper understanding of seal formations and enough materials, the newly forged King’s Forbidden Firmament was more secure than before and stronger.</p><br/><p>He had reforged the King’s Forbidden Firmament as a memento of his blurry memories. Even though he had reforged the King’s Forbidden Firmament, a talisman like this could not be of direct help to him like a shen device.</p><br/><p>He hadn’t through this memento of his childhood memories could save his life.</p><br/><p>Zuo Mo grimaced and a complex emotion rose.</p><br/><p>He turned around to look. Most of the places in the city were the exact same as his memories. This was the first time he entered the King’s Forbidden Firmament since it had been reforged.</p><br/><p>This familiar yet unfamiliar feeling was unspeakably strange.</p><br/><p>He shook his head and laughed self-mockingly. He had actually the spare time to lament.</p><br/><p>At this time, he suddenly noticed the strangeness of A Gui next to him.</p><br/><p>A Gui suddenly stood up.</p><br/><p>“A Gui, what is it?” Zuo Mo was slightly nervous and quickly followed.</p><br/><p>A Gui did not seem to hear. She walked along a small path slowly. Her eyes were not empty any longer, but puzzled.</p><br/><p>A Gui’s steps were slow and a ripple finally appeared on her forever emotionless face.</p><br/><p>Zuo Mo became worried.</p><br/><p>A Gui seemed very familiar with this place. She walked silently, and her expression became wooden again.</p><br/><p>Zuo Mo seemed to understand. It must be that A Gui still had some memory fragments. The familiar environment of the King’s Forbidden Firmament had awakened a part of her memories.</p><br/><p>A Gui seemed to be very familiar with this place and after some twists and turns, she came to a small yard.</p><br/><p>Her hand was placed on the door, and she pushed it open.</p><br/><p>Zuo Mo stilled. This yard … … this little yard … …</p><br/><p>A slightly blurry scene appeared in front of him.</p><br/><p>———</p><br/><p>“Gui Gui, this name isn’t pleasing to hear,” the little boy muttered, his hands not slowing at all.</p><br/><p>The little girl tilted her head. “Gui Gui feels that it is very good!”</p><br/><p>“Why do you work so hard on something as boring as cultivation?’ The little boy had an expression of puzzlement as he carefully treated the wounds on the little girl’s feet.</p><br/><p>The little girl teared up due to the pain, and her voice carried a sob. However, she was unusually determined. “Because only by getting stronger can I protect Young Mater.”</p><br/><p>“This place is very safe. I don’t need to be protect. I don’t like to go out.” The little boy’s head shook like a rattledrum.</p><br/><p>“But what if there is a day?’ The little girl tilted her head.</p><br/><p>———</p><br/><p>“Young Master … …”</p><br/><p>A slightly wooden and hoarse voice sounded by his ear, just like when in their childhood, he he … … he was having delusions … …</p><br/><p>Zuo Mo felt uncomfortable and gave a short huff to expel the melancholy he felt.</p><br/><p>He raised his head and met a pair of purple eyes.</p><br/><p>Zuo Mo was dumbstruck where he stood.</p><br/><p>Translator Ramblings: Miniscule improvement!</p><br/>\n</div>"}