{"title": "Chapter Eight Hundred and Twenty Eight – Gap", "id": 778, "volume": 8, "url": "http://boxnovel.org/world-of-cultivation-chapter-eight-hundred-and-twenty-eight-%E2%80%93-gap", "volume_title": "Volume 8", "body": "<h1>Chapter Eight Hundred and Twenty Eight – Gap</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Eight Hundred and Twenty Eight – Gap</p><br/><p>Li Xian Er looked at Zuo Mo.</p><br/><p>Zuo Mo seemed to be possessed as he caressed the [Weaving Girl’s Shuttle] with his hands day and night. He completely forgot himself. Li Xian Er felt slightly ashamed. She had the [Weaving Girl’s Shuttle] for such a long time, but never treated or studied it so seriously.</p><br/><p>Everyone else had become used to Zuo Mo when he became like this.</p><br/><p>Sometimes, Zuo Mo would suddenly stop, a ball of fire would erupt from his hand, and then he would silently throw things into it. Li Xian Er could see that Zuo Mo definitely had some kind of understanding, and he was experimenting.</p><br/><p>Then, accidents would occur.</p><br/><p>Explosions, thick smoke, toxic mist … …</p><br/><p>Li Xian Er’s heart beat wildly as she watched, but when she looked around, everyone else was calm. They were meditating, practicing the sword, chanting sutras, they looked as though they were used to events like this.</p><br/><p>This group of people … …</p><br/><p>LI Xian Er suddenly had a strange feeling that this group of people were really a group of freaks. This was not the first time she observed Zuo Mo, but this was the first time she observed the rest of the group from Mo Cloud Sea at such a close distance.</p><br/><p>The feeling they gave her was unspeakably strange.</p><br/><p>Yet, after a period of exposure, Li Xian Er had a different feeling. This group was hard-working, exceptionally hard-working. They were always cultivating. They never wasted a moment of time. Other than seeing Ceng Lian’er occasionally sipping and savoring tea, everyone else was cultivating except when they were resting. There were even a few that she never saw resting.</p><br/><p>This kind of mad cultivation state produced a pressure hard to describe that almost suffocated her.</p><br/><p>Suddenly, a terrifying thought appeared in her mind.</p><br/><p>If all of Mo Cloud Sea was like this, then it … … would be terrifying!</p><br/><p>When a person talked about Mo Cloud Sea, they could not avoid discussing the string of miracles in its short history. This string of miracles created the now prosperous and strong Mo Cloud Sea. Many people though that Mo Cloud Sea’s success could not be copied. They were the blessed of the heavens. Their accomplishments could not be separated from their luck. Li Xian Er had been influenced by this way of thinking. Yes, when one looked back at Mo Cloud Sea’s rise, they had a powerful and wondrous luck.</p><br/><p>But when she was in close contact with them for multiple days, her way of thinking was completely upended.</p><br/><p>Yes! Mo Cloud Sea’s rise could not be copied but not because of luck, but that it would be impossible to get a group of people like this, each full of talented, and outrageously hard-working!</p><br/><p>Before this, Li Xian Er thought that she was hard-working. And in reality, in Tian Huan, she was very hard-working, but today, she learned that there was still a gap when compared to this group of freaks from Mo Cloud Sea.</p><br/><p>The luck of Mo Cloud Sea now seemed like an eruption of potential, unearthed by hard work, each time they had been forced to the precipice. The hard work of this group of people reached a harsh level.</p><br/><p>It was not strange if it was one person, but a whole crowd being so strict made people feel terror.</p><br/><p>This stirred Li Xian Er greatly. She realized for the first time just how terrifying the enemy they were facing was!</p><br/><p>Of everyone, the one she paid the most attention to was Zuo Mo.</p><br/><p>Zuo Mo was the master of Mo Cloud Sea. He decided the present and future of Mo Cloud Sea, and an important enemy of Tian Huan. Also, she had some special emotions towards Zuo Mo.</p><br/><p>She really was great. A random little thousand crane had managed to leave the famed master of Mo Cloud Sea so dishevelled.</p><br/><p>A smile floated at the corner of Li Xian Er’s mouth.</p><br/><p>However, very soon, she was unable to smile because she saw the crude work on Zuo Mo’s hand.</p><br/><p>It was a very rough and irregular object. And it was mostly made out of low quality materials like bronze and she had watched him add many other kinds of materials.</p><br/><p>For other sects, forging was a production method, but for Tian Huan, it was an important method of cultivation.</p><br/><p>Increasing understanding of forging and seal formation to increase one’s control of ling and shen power was a method unique to Tian Huan. This was also why Tian Huan had a near monopoly of the talisman business in the xiuzhe world. Every single member of the sect was skilled in forging. This was what was most scary.</p><br/><p>Li Xian Er was one of the best among them and naturally great in skill. She was ranked first or second among the young disciples.</p><br/><p>But seeing Zuo Mo forge was a great blow to her.</p><br/><p>At the start, the golden colored fire in Zuo Mo’s hand did not attract her attention until Li Xian Er realized that any material that was thrown into the flame would immediately turn to liquid. Then she started to pay attention.</p><br/><p>When she did, she found that this extraordinary nature of the golden flames.</p><br/><p>Shen flame!</p><br/><p>That was a shen flame!</p><br/><p>A flame had to surpass tenth grade and also needed shen power to produce it before it could be called a shen fire. In all of Tian Huan, only Chief Elder had a shen flame. Chief Elder’s shen glyph heaven fire was a shen flame!</p><br/><p>Other than this, no one else in the enormous Tian Huan had a shen fire. Even Li Xian Er only had a ninth-grade [Charming Beauty]. This pink beautiful flame was a great treasure that Tian Huan had spent great effort to find.</p><br/><p>Shen flame, Zuo Mo possessed a shen flame!</p><br/><p>She was stunned speechless, especially when she saw Zuo Mo’s movements were unorthodox and without any kind of elegance or beauty. A strange feeling of unease filled her heart when she saw this. Yet, Zuo Mo’s unique movements, unqualified and lacking in any beauty, did not affect his forging ability!</p><br/><p>Zuo Mo’s movements were unusually accurate, so accurate that even Li Xian Er, a Tian Huan disciple, felt embarrassed of herself.</p><br/><p>However, Li Xian Er did not have time to feel ashamed at this time. She stared at the rough object on Zuo Mo’s hand.</p><br/><p>It was crude, irregular and ugly.</p><br/><p>But Li Xian Er’s gaze was fixed on it, and unable to move away. Shock spread through her mind.</p><br/><p>[Weaving Girl’s Shuttle]!</p><br/><p>She actually felt an aura similar to that of [Weaving Girl’s Shuttle] on that ugly object!</p><br/><p>The strong blow caused her to lose her mind and she exclaimed, “This is not possible!”</p><br/><p>Almost at the same time, everyone opened their eyes and looked in shock at the rough object in Zuo Mo’s hands. They felt any extremely weak vibration of shen power from this crude object that seemed to be breathing.</p><br/><p>Zuo Mo once again had a smug expression. “Tian Huan’s shen glyph lives up to its reputation!”</p><br/><p>What he had gained in these recent days almost surpassed Zuo Mo’s imagination. The [Weaving Girl’s Shuttle] was Tian Huan’s masterwork, and contained large amounts of Tian Huan’s most secret seal formations and a shen glyph.</p><br/><p>Zuo Mo knew the value of these things. Once he absorbed these formations and shen glyphs, Mo Cloud Sea’s forging level would tangibly rise a level in a very short amount of time.</p><br/><p>Its value could not be measured.</p><br/><p>In Zuo Mo’s hand was only a rough work, but it showed Zuo Mo’s understanding of Tian Huan’s shen glyphs.</p><br/><p>“It has shen power vibrations,” Wei Sheng asked curiously.</p><br/><p>“Yes, copied from Tian Huan’s shen device, this thing can produce shen power, it is very interesting,” Zuo Mo explained.</p><br/><p>“It can produce shen power on its own?” Ceng Lian’er immediately became excited. Born a mo, Ceng Lian’er had an obsessive pursuit of power. Once she heard that this could produce shen power, she was like a shark that had found a prey. “Can people use it?”</p><br/><p>“Yes.” Zuo Mo nodded. “Tian Huan uses it like that. However, I need more time to completely understand it.”</p><br/><p>“Oh, Tian Huan.” Ceng LIan’er turned to look at Li Xian Er. That gaze was filled with meaning and caused Li Xian Er’s hairs to stand.</p><br/><p>Soon, everyone moved their attention away. They started to cultivate and meditate again.</p><br/><p>The crude object suddenly exploded into powder. The low-level materials could not withstand shen power. Even the tiniest bit of shen power would turn the materials into dust.</p><br/><p>Zuo Mo did not care. A jade scroll appeared in his hand and he furiously recorded down what he learned.</p><br/><p>After he finished recording, Zuo Mo closed his eyes and finally relaxed. After focusing to study day and night, he was tired. As he rested, he habitually thought back to his arrangements in his mind.</p><br/><p>Suddenly, his heart jumped. He opened his eyes. How could he have forgotten such an important thing!?</p><br/><p>“There is something important I missed.” Zuo Mo said gravely.</p><br/><p>Everyone opened their eyes and they looked at Zuo Mo.</p><br/><p>“Zhong De’s safety is related to our victory or defeat. If Tian Huan attacks Zhong De, we will be in a reactive state.” Zuo Mo’s expression was grave.</p><br/><p>The joy at capturing Li Xian Er and learning the shen glyph of the [Weaving Girl’s Shuttle] almost caused him to make a fatal mistake.</p><br/><p>With their present strength, the Tian Huan experts would not have any hope of capturing Li Xian Er from them. But if they targeted Zhong De, it would not be good!</p><br/><p>Zhong De had the protection of his army, but if the other was decisive and ruthless enough and would send enough experts to their deaths, they had the ability to sneak into the base and assassinate Zhong De. Zhong De still lacked the protection of a top expert. While this was not enough to be fatal blow at any other time, but at this crucial moment, this would put them back where they started.</p><br/><p>And if something happened to Zhong De, the good situation they had managed to negotiate would be ruined.</p><br/><p>Everyone’s expressions became grave. Wei Sheng stood and said, “I’ll go.”</p><br/><p>Zuo Mo sighed in relief. “Please, I’ll trouble Shixiong. Shixiong, no matter what, do not leave Zhong De’s side.”</p><br/><p>“Alright.” Wei Sheng did not waste words. He turned and left.</p><br/><p>Zuo Mo completely relaxed. Eldest Shixiong was a man of his word. If he made a promise, no matter what happened, he would definitely not leave Zhong De.</p><br/><p>With the protection of Eldest Shixiong, and the numerous battalions surrounding Zhong De, Tian Huan would not have a chance.</p><br/><p>Li Xian Er’s heart immediately sank.</p><br/><p>She had noticed Zuo Mo’s mistake as well. If Tian Huan could take down Zhong De, they could turn defeat into victory. While Zuo Mo had seemed smug, she hadn’t expected him to not forget himself.</p><br/><p>Of course she knew of Wei Sheng. The strongest of Mo Cloud Sea, and accepted by the public as a genius that could match Lin Qian. He started as a sword servant and struggled his way up step by step. Wei Sheng was a determined person, his resolve was made of steel. He was the idol of all sword xiu other than Kun Lun.</p><br/><p>With a person like this guarding Zhong De, and with the fearless Abyss Jail Battalion to support him, the possibility of taking down Zhong De was minuscule even in theory.</p><br/><p>Zuo Mo felt some lingering fear. His mistake had almost cost them everything.</p><br/><p>He became wary. For some reason, he kept on feeling a kind of danger.</p><br/><p>After a moment thought, he decided to make his move first.</p><br/><p>He communicated with Gongsun Cha.</p><br/><p>“Start the plan!”</p><br/><p>Translator Ramblings: One little slip of the mind … …</p><br/>\n</div>"}