{"title": "Chapter Eight Hundred and Forty Six – Glyph Sea", "id": 796, "volume": 8, "url": "http://boxnovel.org/world-of-cultivation-chapter-eight-hundred-and-forty-six-%E2%80%93-glyph-sea", "volume_title": "Volume 8", "body": "<h1>Chapter Eight Hundred and Forty Six – Glyph Sea</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Eight Hundred and Forty Six – Glyph Sea</p><br/><p>A shen glyph appeared beside the chief elder, then another one, a third, a fourth … …</p><br/><p>All kinds of glyphs grew in the air and spread outwards. In a few moments, there were countless glyphs floating in the end, packed in and endless.</p><br/><p>Some were shen glyphs, some were seal scripts, they were of different colors and flashed with different lights.</p><br/><p>Chief Elder’s expression was solemn, his spread arms seemed to be embracing the world.</p><br/><p>This was like a galaxy, all kinds of stars vast and endless. The shen glyphs were like those enormous and bright stars, the seal scripts like those small and dim stars.</p><br/><p>Each glyph spun slowly and released a force field that belonged to themselves.</p><br/><p>A sea of glyphs!</p><br/><p>A hint of shock flashed through Zuo Mo’s eyes but then he recovered. He had to admit that in the field of shen glyphs and seal scripts, Chief Elder was the best at present.</p><br/><p>Even around him, there were several glyphs that he did not recognize.</p><br/><p>This glyph sea contained billions of glyphs, was this god-level?</p><br/><p>A daze entered Zuo Mo’s eyes. Seal scripts and shen glyphs, this was also the field he was skilled in but he was lacking in comparison to Chief Elder.</p><br/><p>This was the world of shen glyphs!</p><br/><p>A shen glyph grandmaster!</p><br/><p>Yet there was no time for Zuo Mo to sigh in astonishment. He quickly found the danger of this world of shen glyphs.</p><br/><p>Nearby, a shen glyph suddenly lit up. Seven seal scripts were attracted ot it and released light at the same time.</p><br/><p>Suddenly, an arrow of ice shot out of a light blue seal script!</p><br/><p>Zuo Mo did not change expression. When the ice arrow reached him, it was turned to steam by the sun shen fire that surrounded Zuo Mo.</p><br/><p>Yet this ice arrow seemed to awaken the other seal scripts and shen glyphs.</p><br/><p>Woosh!</p><br/><p>Ice arrows, waves of wind, lightning, flowing fire … …</p><br/><p>They shot at Zuo Mo from all directions, hissing and cracking. Sparks flew around Zuo Mo. The domineering and powerful sun shen fire dealt easily with these normal attacks.</p><br/><p>But Zuo Mo did not have a happy expression.</p><br/><p>He actually felt the a foreboding sense of unease.</p><br/><p>The entire glyph sea started to spun. All of the shen glyphs and seal scripts seemed to be awakened.</p><br/><p>All of the seal scripts around Zuo Mo started to attack. Each seal script had a different attack. The lights came in a storm and were so rapid they almost obscured Zuo Mo’s vision.</p><br/><p>Zuo Mo immediately felt a slight pressure.</p><br/><p>The power of the seal scripts was limited and they could not break through Zuo Mo’s shen fire. However, there were too many of them and too many different kinds of powers. The pressure when tens of thousands of completely different powers attacked together could be imagined.</p><br/><p>Woosh!</p><br/><p>The flames around Zuo Mo exploded. The burning sun flows inside his body seemed to be angered by the rain of attacks. The sun shen fire became even more ferocious. At this time, Zuo Mo was a ball of fire. The lights released by the seal scripts were like moths flying towards a flame. Once they came close, they would turn into sparks and disappear.</p><br/><p>Zuo Mo did not dare to relax. Right now, the seal scripts were the ones attacking, and the shen glyphs had not moved.</p><br/><p>Shen glyphs were of a higher level than seal scripts and more powerful.</p><br/><p>As expected by Zuo Mo, a shen glyph suddenly lit up with blue light. A blue figure like that of a female slowly rose from the shen glyph.</p><br/><p>The blue female seemed like a ball of flowing water. She held a deep blue bottle in her hand.</p><br/><p>When it appeared, Zuo Mo had a strong feeling of danger.</p><br/><p>She held the blue bottle high up in her hand, the mouth of the bottle was turned to face Zuo Mo.</p><br/><p>Splash!</p><br/><p>A flow of water poured out of the bottle and landed by her feet, turning into a raging river that swept towards Zuo Mo.</p><br/><p>The roar of the river covered all other sounds.</p><br/><p>Zuo Mo stared closely at the river in front of him. A strong feeling of danger rose.</p><br/><p>Using water to subdue fire?</p><br/><p>Zuo Mo was not surprised. Water subduing fire was a basic law. The sun shen fire was domineering but it was not invincible. If there was shen fire, there would be shen water. With a shen fire like the sun shen fire that was the most domineering and masculine, there was naturally the darkest and gentlest shen water.</p><br/><p>Shen water!</p><br/><p>The river in front of him was made completely of shen water!</p><br/><p>Zuo Mo was shocked. He had been shocked when Chief Elder had managed to summon the Void Sky Li Fire, He hadn’t thought the other was able to summon shen water with a wave of his hand.</p><br/><p>His guess was right. Chief Elder had summoned a shen water. The Void Spring Shen Water which came from the endless void. There were many void springs in the endless void and the void spring shen water came from that.</p><br/><p>Chief Elder desperately wanted to end the battle. He used the power of the shen glyphs to find a void spring and summoned the void spring shen water.</p><br/><p>Was this god-level?</p><br/><p>The burning sun flows seemed to detect the danger the river posed. They became more active.</p><br/><p>The burning sun flow that speed up in its circulation set off golden arcs of flame.</p><br/><p>The golden arcs of flame appeared for only short moments, flashing and then disappearing. But the arcs formed and extinguished each other. With the destruction of each arc, there would be a gold spark that landed in Zuo Mo’s body.</p><br/><p>However, Zuo Mo had no time to study what these golden sparks were.</p><br/><p>As the burning flow became active again, Zuo Mo seemed to feel as though his mind fell back into a great sea of fire. His consciousness started to blur again!</p><br/><p>However, having gained some experience, Zuo Mo took a deep breath. He faced the charging shen water and threw a punch just like previously.</p><br/><p>Without needing his consciousness effort, a small burning flow started to burn.</p><br/><p>Boom!</p><br/><p>A terrifying pillar of fire erupted out of Zuo Mo’s burnt right hand!</p><br/><p>The pillar of fire and the flow of water collide heavily in the air. The moment that the shen water and shen fire came into contact, light appeared. Zuo Mo’s vision was blinded and he could not see a thing.</p><br/><p>Boom boom boom!</p><br/><p>The enormous sounds of the explosion deafened Zuo Mo’s ears.</p><br/><p>A faint rings of light quickly spread from where the two had collided.</p><br/><p>Everywhere the circle of light passed, the seal scripts immediately shattered!</p><br/><p>Zuo Mo was swept by the ring of light. It was like being hammered. The flames around him suddenly lit up. Taking advantage of the moment of clarity, Zuo Mo gritted his teeth and threw another punch!</p><br/><p>Boom!</p><br/><p>Another pillar of fire!</p><br/><p>The shen fire immediately gained the upper hand.</p><br/><p>The void spring shen water continued to retreat as the shen fire moved forward. The line of fire was pressing close to the feet of the woman holding the bottle.</p><br/><p>The void spring shen water was a level below the sun shen fire. The void spring had not been large and there wasn’t much shen water inside. Zuo Mo had a complete sun crystal seed that contained a great deal more shen fire.</p><br/><p>At this time, nearby, another shen glyph suddenly lit up.</p><br/><p>This was a white shen glyph. The light it gave off was also white. When the shen glyph lit up, it immediately attracted the surrounding seal scripts to it. In a blink, it became several times bigger.</p><br/><p>Roar!</p><br/><p>A white dragon of ice flew out of the shen glyph, stretched its body and leapt at the shen fire!</p><br/><p>When the ice dragon appeared, the temperature of the surrounding air dropped dramatically.</p><br/><p>It was the first time Zuo Mo saw such a condensed and detailed dragon. This snowy white dragon had an elegant body, its scales like crystal that reflected the light beautifully.</p><br/><p>Ice Shen Glyph!</p><br/><p>The cold air spun as the ice dragon coiled and silently spread to every corner.</p><br/><p>The presence of the sun shen fire suddenly stilled.</p><br/><p>The void spring shen water took the chance to push the shen fire back in Zuo Mo’s direction.</p><br/><p>The icy cold energy caused Zuo Mo’s mind to clear up greatly. Such powerful shen glyph! Zuo Mo had never seen such a strong cold energy. If he didn’t have the burning heat of the sun inside him, he definitely would not last long with just his own shen power.</p><br/><p>But in the next moment, Zuo Mo’s expression changed slightly.</p><br/><p>The cold energy did not cause the burning flow in his body to retreat, it actually enraged the burning flows. They became more active.</p><br/><p>Hiss hiss hiss!</p><br/><p>The golden arcs of flame became more frequent and more golden sparks fell in Zuo Mo’s body.</p><br/><p>Zuo Mo managed to detect the pattern. If the burning flow became active, his consciousness would be pulled into the sea of fire and start to blur. If this occurred, the best way was to channel the burning flow out.</p><br/><p>The amount of burning sun flow they had used was a drop in a sea.</p><br/><p>The amount of sun shen fire contained in one drop of the burning sun flow was astounding.</p><br/><p>Without a word, Zuo Mo gritted his teeth. Another punch!</p><br/><p>A blinding pillar of light headed for the ice dragon.</p><br/><p>The ice dragon was unusually alert. Its body shifted and it easily avoided Zuo Mo’s attack. It roamed around Zuo Mo. With every shift of its body, it would cause a ripple of cold energy. As the ripples of energy came, the temperature continued to fall.</p><br/><p>Bone-chilling coldness caused the sun shen fire to quickly wither.</p><br/><p>Each complete shen glyph had great abilities. Chief Elder’s skill in shen glyphs was peerless. After stepping into god-level, he managed to complete many of his originally incomplete shen glyphs.</p><br/><p>The content that he had found cryptic and hard to understand before were now restored with just a thought.</p><br/><p>This ice breath shen dragon glyph was one of those. He had just obtained a small part of it and used it to study. After entering god-level, the mysteries of this shen glyph was completely exposed to him. From that small part, he was able to reconstruct an entire shen glyph.</p><br/><p>If he could harvest god-level cold energy and merge it into this shen glyph to summon the true ice breath shen dragon, the power would be much greater than the dragon now.</p><br/><p>When the waves of cold energy touched the flames around Zuo Mo, they snapped and popped, creating sparks.</p><br/><p>It appeared as though fireworks were being set off around Zuo Mo, the sparks never ceasing.</p><br/><p>Seeing the pillar of fire was not effective against the ice dragon, Zuo Mo decided to attack the shen water first.</p><br/><p>Boom boom boom!</p><br/><p>After several pillars of fire hit the shen water, the shen water was unable to withstand it and retreated.</p><br/><p>The ice dragon seemed to understand. It suddenly appeared next to Zuo Mo, and opened its mouth to blow a cold breath on Zuo Mo.</p><br/><p>This cold breath was much stronger than the cold energy previously released!</p><br/><p>Covered in the flames, Zuo Mo shook from the cold. This cold energy seemed to be able to pass through the sun shen fire and hit his body.</p><br/><p>The shen fire immediately weakened.</p><br/><p>A dense layer of frost appeared on Zuo Mo’s body. The ice frost was eerie. It did not melt within the flames.</p><br/><p>So cold!</p><br/><p>Zuo Mo’s brain almost froze. A strange and peerless cold continued to spread through his body.</p><br/><p>The sun shen fire seemed to be ineffective against the coldness.</p><br/><p>Boom boom boom!</p><br/><p>The burning sun flow became enraged. They moved at an unprecedented speed, the arcs of flame almost turning Zuo Mo’s body into gold!</p><br/><p>Yet the cold energy was unusually hard. No matter how the sun shen fire burned, it did not change at all.</p><br/><p>Zuo Mo was trapped between ice and fire. The surface of his body was bone-chillingly cold, the inside of his body burning like lava.</p><br/><p>The ice dragon dragon took the chance to blow out more cold breath.</p><br/><p>With every blow, it would wither slightly and become smaller.</p><br/><p>After twelve breaths, the body of the ice dragon had halved. A thick layer of ice covered Zuo Mo and his figure could not be seen. There was only a large piece of ice. Zuo Mo was completely sealed by ice.</p><br/><p>The ice dragon showed a relieved expression. Its ice breath was peerless in its cold. Twelve of its breaths could seal anything. Even after ten thousand years, it would not melt!</p><br/><p>Sleep forever in this piece of sighing ice!</p><br/><p>The ice dragon was about to turn and leave…</p><br/><p>Crack!</p><br/><p>The ice layer shattered. A hand reached out of the thick ice layer without warning and grabbed the ice dragon!</p><br/><p>Translator Ramblings: Chief Elder is an Aquarius, Zuo Mo is a Leo, Luo Li Wo Li are Gemini.</p><br/>\n</div>"}