{"title": "Chapter Seven Hundred and Sixty One – The Changes of the Little Ones", "id": 811, "volume": 9, "url": "http://boxnovel.org/world-of-cultivation-chapter-seven-hundred-and-sixty-one-%E2%80%93-the-changes-of-the-little-ones", "volume_title": "Volume 9", "body": "<h1>Chapter Seven Hundred and Sixty One – The Changes of the Little Ones</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Seven Hundred and Sixty One – The Changes of the Little Ones</p><br/><p>There were all kinds of strange scents floating off Chun Yu Cheng’s cloud island. Zuo Mo was reminded about this each time he came, especially the small of fresh ling grasses mixed with all kinds of waste. It was torture.</p><br/><p>Chun Yu Cheng’s expression was intoxicated. “Such a fresh and healthy smell!”</p><br/><p>Zuo Mo smiled helplessly. Chun Shidi was more and more enchanted with animal husbandry and his temper had become strange. The other was alright with him, but was not friendly to others, especially disliking people coming onto his cloud island.</p><br/><p>There were many kinds of ling and mo grasses planted on the island to feed the cloud seeds. Zuo Mo had not seen many of these ling grasses before. They flashed with enchanting lights which meant that their grade was not low. In the present Mo Cloud Sea, Zuo Mo’s half-assed ling plant farmer skill was laughable.</p><br/><p>The ling plant farmers of Mo Cloud Sea were unlike the ling plant farmers anywhere else. They were skilled in using seal formations and their effectiveness was higher. This was an unique system that Mo Cloud Sea’s strong forging abilities provided the support for.</p><br/><p>Cloud Sea Jie did not have many ling fields and the ling plant farmers were mostly gathered in the jie with large tracts of ling fields. The ling grasses on Chun Shidi’s island were relatively high grade, and the skill of the ling plant farmers were relatively high as well.</p><br/><p>“How are they?” Zuo Mo asked in concern.</p><br/><p>“You should have sent them a long time ago.” Chun Yu Cheng’s expression was pained as he chatted, “If you sent them in a bit later, they would have been wasted! Oh, it wouldn’t have been useful if you sent them over earlier, I hadn’t found out how to raise cloud steeds then, en en, you picked a good opportunity … …”</p><br/><p>Zuo Mo felt tormented by Chun Shidi’s excessive chatter. He tried to endure. People like Chun Shidi had unusual enthusiasm and obsession with their own field and didn’t care about anything else. They did not understand how to interact with people, and rarely conversed with other people. Most of them had strange personalities. On the other hand, they had outstanding talent and they worked furiously, unaffected by anything else. They usually achieved more in their own field than other people.</p><br/><p>Zuo Mo could understand them.</p><br/><p>Chattering endlessly on the way, they finally came to the beast pool from last time.</p><br/><p>Chun Yu Cheng became alert and didn’t waste words. “Tenth Grade and Sunshine are good, especially Tenth Grade. His killing energy is thick and he is a rare vicious being. I used the [Hunt Blood Pool] to nurture his body. This will increasing his killing energy. He uses the sword and I asked Eldest Shixiong to find the most vicious sword scripture for him.”</p><br/><p>“Most vicious scripture … …” Zuo Mo felt a cold sweat. If it was the most vicious sword scripture that Chun shidi could find, he would just smile and dismiss it. But if it was Eldest Shixiong, then it definitely was the most vicious sword scripture.</p><br/><p>Chun Yu Cheng had a smug expression. “I don’t really understand sword scriptures, but since Eldest Shixiong said it was the most vicious, then it definitely is. [Hundred Sacrificed Souls Killing Sword]. How about it, just this name seems very powerful.”</p><br/><p>Zuo Mo’s body couldn’t help but shake. He knew this sword scripture. This had been from Pu’s collection. Pu had said back then that the [Hundred Sacrificed Souls Killing Sword] was not the strongest sword scripture, but could be said to be one of the most vicious.</p><br/><p>At this time, Zuo Mo had not been affected by Pu Yao’s emotional opinion. He didn’t have much interest in cultivating sword scriptures.</p><br/><p>Zuo Mo thought of another problem and couldn’t help but ask, “Can Tenth Grade cultivate?”</p><br/><p>Tenth Grade was not like Eldest Shixiong. He originated from a ling beast and was not like a xiuzhe. He had never heard of a ling beast cultivating a sword scripture.</p><br/><p>“I had worried about this before, but I found later on that Tenth Grade is very intelligent and matched well with this sword scripture. There isn’t a problem at all.” Chun Yu Cheng’s expression of pride grew as he seemed to ask for praise. “Shixiong, when the time comes, you will have a super sidekick! Tenth Grade’s name was really chosen with great foresight. Shixiong, did you predict a long time ago that he could reach tenth grade?”</p><br/><p>Zuo Mo’s expression was righteous. “Of course! Otherwise, how can I be your shixiong?”</p><br/><p>“That’s true!” Chun Yu Cheng nodded seriously. “As expected, those that are shixiong are all strong. Shixiong, you are strong, Gongsun Shixiong is also strong, but Eldest Shixiong is the strongest.”</p><br/><p>“Why?” Zuo Mo thought, had Chun Shidi grown powerful enough that he could see people’s power?</p><br/><p>“Because he’s Gongsun Shixiong’s shixiong’s shixiong.” Chun Yu Cheng’s expression was matter-of-fact. “Of course he is the strongest!”</p><br/><p>Zuo Mo was speechless. He quickly changed the topic. “Sunshine?”</p><br/><p>Chun Yu Cheng fell for it as expected. “Sunshine’s attributes are the opposite of Tenth Grade. His specialities are healing, protection, and assistance. If Tenth Grade is yin, then Sunshine is yang. Therefore, the beast pool that I picked is the [Water Flesh Wood Bone Pool]. For Sunshine I did not choose spells, but yao arts.”</p><br/><p>Looking at the excitement on Chun Yu Cheng’s face, Zuo Mo perceptively asked, “Oh, what great yao art is it?”</p><br/><p>“Haha! Shixiong, you understand me the best!” Chun Yu Cheng laughed proudly. Increasing his volume, he said joyfully, “It is the [Universal Life] that has been said to be the essential art for super-nannies. Oh, the yao like to call the people who cultivate this yao art nannies. I feel it is very accurate. Other than this, he also cultivates [Ward Breaking Art]. Shixiong, don’t worry. Under my great care, Sunshine can definitely move into the ranks of the top nannies! Such an adorable nanny!”</p><br/><p>Looking at the snowy white and handsome Sunshine, Zuo Mo seemed to see him wearing an apron and holding a bottle in his hand. He couldn’t help but shudder.</p><br/><p>He immediately felt sympathy for Sunshine, but when his words reached his mouth, it became, “Shidi’s results are masterworks!”</p><br/><p>Chun Yu Cheng became more excited upon receiving Zuo Mo’s praise. He pulled Zuo Mo over and said excitedly, “As expected, Shixiong understands me best. Those people do not understand the greatness and holiness of husbandry. This is a kind of creation, a novel creation! I am fated to be the man that will create the strongest ling beasts!”</p><br/><p>Zuo Mo wiped the cold sweat away from his face as he nodded. “Shidi is ambitious! I admire this!”</p><br/><p>Chun Yu Cheng smiled and pulled Zuo Mo to a tall dan cauldron.</p><br/><p>“I asked Golden Crow Camp to forge this dan cauldron. I also got Sun Bao and Ji Wei to operate it for a few days. It is a pity that I couldn’t find them later on. The other people said that they went out.” Chun Yu Cheng’s tone was full of regret. “If they are here, this fire will definitely be stronger.”</p><br/><p>Zuo Mo who knew about the entire matter sighed again. He was filled with sympathy towards Sun Bao and Ji Wei. Chun Yu Cheng usually did not show himself in public but he was Zuo Mo’s shidi. His status in Mo Cloud Sea was high. If his requests were not ridiculous, no one would dare refuse him. Due to this, when they received a request for help, Sun Bao and Ji Wei had hurried over despite their heavy workload.</p><br/><p>But Chun Yu Cheng had the two of them act as cauldron workers. Heavens, the two masters of Golden Crow Camp, the two top people in charge of all the seal xiu in Mo Cloud Sea acting as manual laborers, and for three days!</p><br/><p>When they reached three days, they did not relent to Chun Yu Cheng’s invitation, and fled with their ash-covered faces.</p><br/><p>“I couldn’t find them no matter what I tried. I could only hire some of the experienced people from Golden Crow Camp. However, they are lacking compared to Sun Bao and Ji Wei, but still acceptable.” Chun Yu Cheng was clearly slightly displeased.</p><br/><p>“It’s fine if it is about the same!” Zuo Mo hurriedly comforted.</p><br/><p>“That’s true.” Chun Yu Cheng thought and said with a tilted head, “This dan cauldron is good and the people later on worked hard. The results aren’t bad. Shixiong’s shen fire was also crucial and beneficial to Lil’ Fire’s growth. However, Lil’ Fire is slightly less intelligent compared to Tenth Grade and Sunshine. But it is an yao beast to begin with and has no trouble cultivating yao arts. I found a fire yao art in the Pu Wei Library called the [Fire Heart Bone Refining Art] for it.”</p><br/><p>Zuo Mo stilled and instinctively asked, “Lil’ Fire has bones?”</p><br/><p>Lil’ Fire had ended up in Zuo Mo’s demonic hands many times and he had squeezed the other countless times. In Zuo Mo’s memories, Lil’ Fire was like a rubber ball, and didn’t have any bones.</p><br/><p>“It does!” When it came to his profession, Chun Yu Cheng’s expression immediately became serious. “There are many small bones inside its body similar to sea sponges. These bones are very small and flexible. Their structure is very flexible and resilient so Lil’ Fire appears as though it is boneless.”</p><br/><p>“Oh, so this cultivation will thicken its bones and have it become more powerful?” Zuo Mo asked with anticipation.</p><br/><p>“Powerful?” Chun Yu Cheng shook his head with bewilderment. “I don’t know that. I only felt that these kind of bones were rare and wanted to try cultivating it.”</p><br/><p>Zuo Mo’s face was black as a pot. “Even you don’t know the result?”</p><br/><p>“No, this is normal. It is hard to predict the results of many husbandry trials.” Chun Yu Cheng said with a righteous tone.</p><br/><p>But when Chun Yu Cheng turned and saw Zuo Mo’s black face, he knew it was not good. He was so friendly this time because he had a goal. If he ruined the matter, it would be terrible.</p><br/><p>He hurriedly pulled Zuo Mo to another place.</p><br/><p>Unlike the other beast pools, there was a kind of vine growing here that Zuo Mo had never seen. It grew over multiple mu of fields and under the thick vines, there was a transparent bubble that hung below.</p><br/><p>Lil’ Black seemed to see Zuo Mo from within the bubble. It furiously moved its legs, but no matter how it moved, it only spun around in the water bubble.</p><br/><p>“Shixiong, look, this is the Water Bubble Vine,” Chun Yu Cheng hurriedly introduced. “It can grow this a special kind of water bubble, and is a natural beast pool. Also, Shixiong, take a look.”</p><br/><p>As he spoke, he pulled away the thick leaves covering the ground and showed a beast pool. Zuo Mo found that the roots of the water bubble vine grew into the beast pool.</p><br/><p>“The medicine in the beast pool is absorbed by the root system and then gathers in the water bubbles. This process is even more wondrous than the seal formations we engrave. All kinds of medicines can merge together in the water bubble and form a natural beast pool.”</p><br/><p>Zuo Mo was also attracted by such a wondrous beast pool.</p><br/><p>Chun Yu Cheng saw the interest on Zuo Mo’s face and continued, “The medicine absorbed will change slightly through the vine’s roots and leaves. This is also the source of its great ability. However, because the water bubbles are not very big, it can only be used on those relatively small beasts. I saw Lil’ Black and immediately thought of the water bubble vine.”</p><br/><p>“What is its use to Lil’ Black?” Zuo Mo went directly for the core of the matter.</p><br/><p>“Hee hee, Shixiong, don’t be shocked when you hear this!” Chun Yu Cheng was both smug and mysterious.</p><br/><p>Translator Ramblings: I just realized that the Rainbow Mark Butterfly was the only pet of Zuo Mo’s to die, and it was the only pet he didn’t give a name to. That should have made its fate obvious.</p><br/>\n</div>"}