{"title": "Chapter Seven Hundred and Seventy Eight – Bie Han! Madman!", "id": 828, "volume": 9, "url": "http://boxnovel.org/world-of-cultivation-chapter-seven-hundred-and-seventy-eight-%E2%80%93-bie-han-madman", "volume_title": "Volume 9", "body": "<h1>Chapter Seven Hundred and Seventy Eight – Bie Han! Madman!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Seven Hundred and Seventy Eight – Bie Han! Madman!</p><br/><p>“Ma Fan’s battle was beautiful!” Shi Dong said with admiration. Winning a difficult battle was a great aspiration for any battle general.</p><br/><p>Also, this victory raised Ma Fan’s fame and place him in the ranks of the first-class battle generals.</p><br/><p>There was competition among the battalions of Mo Cloud Sea as well. Shi Dong and Ye Ling’s Grey Camp was not the top ranked among the many battalions. Shi Dong was exceptional, but in Mo Cloud Sea, which was full of talented people, he was not the strongest.</p><br/><p>There was a handful of people with comparable strength.</p><br/><p>However, he did not feel any jealousy towards Ma Fan. Ma Fan deserved this. They had fought many times before, so many times it was innumerable. He knew Ma Fan’s strength well.</p><br/><p>If Ma Fan was given a defense line, his strength would double.</p><br/><p>This was Lil’ Miss Daren’s words, without any exaggeration. Ma Fan’s achievements in other areas could only be said to be average, but once he gained control of a formation defense line, his win rate would become terrifying.</p><br/><p>No one liked to fight a defensive battle against Ma Fan.</p><br/><p>However, Shi Dong was full of confidence in himself. Ma Fan had a field he was skilled in, and he had his own specialization.</p><br/><p>“Bie Han Daren’s order is really strange!” Ye Ling saw Bie Han’s orders and couldn’t resist commenting.</p><br/><p>Shi Dong looked into the distance and said softly, “I think I have guessed Bie Han Daren’s general goal.” He tried to make himself look calm as normal but the anxiousness in his eyes exposed his true thoughts.</p><br/><p>Bie Han Daren … … was too daring!</p><br/><p>Was this the confidence of a top battle general?</p><br/><p>What kind of confidence was this!</p><br/><p>“You have guessed Daren’s thoughts?” Ye Ling was slightly shocked. However, he was not surprised. He knew that his strategic vision was lacking compared to Shi Dong.</p><br/><p>Shi Dong shook his head. “Not just me, everyone else should understand by now.”</p><br/><p>“Why is that even this conversation like a riddle … …” Ye Ling said helplessly.</p><br/><p>“Look at our position, then Tang Fei and A Zha Ge.” Shi Dong’s hand moved above the jie map, and an invisible line caused Ye Ling’s eyes to light up. He was still slightly puzzled. “I cannot see anything … …”</p><br/><p>Shi Dong did not waste words and continued, “Us, Tangzi Battalion, A Zha Ge battalion, appear as though we have no connection to Bright Mountain Jie, but look here.”</p><br/><p>On the jie map, he found where Grey Camp was, and with it as the center, drew out a circle. Then he found the two other battalions and drew out circles around them.</p><br/><p>“Now look,” Shi Dong said calmly, “While we are not directly connected to Bright Mountain Jie, but the area that we are active in, and the position that we guard are like three signal flares. They will attract the battalions around us, and we have blockaded the path of the enemy attempting to reinforce Bright Mountain Jie.”</p><br/><p>“I seem to understand after you say this.” Ye Ling’s expression was puzzled. “However, what is the use to stopping the reinforcements? Bright Mountain Jie still has Hai Jin Yu and Shang Yu Sheng. Ma Fan defeated the two mo generals but he definitely took great losses and will not have forces to and help Bie Han Daren. You should also know of Hai Jin Yun and Shang Yu Sheng, they are rare talents that have risen recently. Bie Han Daren alone … … wait! You mean … …”</p><br/><p>Ye Ling’s eyes widened. He looked in disbelief at Shi Dong as though he saw a ghost.</p><br/><p>“Yes! We were wrong about Bie Han Daren’s intentions from the start.” Shi Dong tried to make his voice calm, but it was still filled with emotion. “From the start, he decided to fight one on two! We all were wrong!”</p><br/><p>Then he said self-mockingly, “This probably is the difference between us and top battle generals. We have to bow to his self confidence.”</p><br/><p>Ye Ling’s eyes were wide, and he was unable to speak for a moment.</p><br/><p>“This this this … …”</p><br/><p>He stammered for a while but could not continue.</p><br/><p>Shi Dong shook his head, the shock in his eyes gradually disappearing. He recovered his usual calmness and composure. “Since Bie Han Daren dares to plan this, he must have some assurances. We will first carry out our own mission well, we cannot drag down Bie Han Daren.”</p><br/><p>A moment later, Ye Ling finally inhaled out a long breath. “This is mad! Too mad!”</p><br/><p>It was rare for Shi Dong to see Ye Ling lose his composure. He couldn’t help but flash a grin before he resumed his usual coolness. “Don’t worry for Bie Han Daren, let’s first think of a way to finish our mission. Ma Fan gave a beautiful performance, if we do not finish our mission, we will be laughed at when we return.”</p><br/><p>Ye Ling heard this and nodded seriously. “All Hail the King! We will do all we can in service for our king! Eh, we cannot be laughed at. Lei Peng and Nian Lu have the worst mouths! How do you think we should fight?”</p><br/><p>“I have an idea.” Shi Dong’s eyes flashed with a cold light.</p><br/><p>———</p><br/><p>“Bie Han Daren’s idea is too dangerous!” Tang Fei frowned. When Bie Han’s new orders were delivered to her hands, Bie Han’s intentions finally became clear. She had to admit that Bie Han Daren’s goal was completely unexpected.</p><br/><p>Miao Jun also jumped in fright at Bie Han’s intention. “So mad! One against two … … I don’t know what to say! He doesn’t need to risk this at all. We are strong. While we are low in numbers, we are all elite battalions, there will not be much of a problem to take down Hundred Energy Jie, unless … …”</p><br/><p>“Unless Daren has bigger ambitions!” Tang Fei continued. She said in an uncertain tone, “What will be even bigger?”</p><br/><p>Miao Jun frowned and thought hard. He was thinking of what reason would cause Bie Han to use such a dangerous plan.</p><br/><p>Suddenly, the two of them raised their heads and looked at each other at the same time, seeing the disbelief in the other’s eyes.</p><br/><p>Bie Han … …</p><br/><p>———</p><br/><p>“Too dangerous!” A Zha Ge looked at the order on his hand and murmured to himself.</p><br/><p>Bie Han Daren’s intentions had completely been made apparent, there was nothing hard to guess. However, A Zha Ge found it hard to understand why Bie Han would plan such a risky battle plan.</p><br/><p>A Zha Ge did not know Bie Han’s strength well but he knew that Bie Han Daren was much stronger than him. He was also a gold battle general but he was nothing compared to a top battle general.</p><br/><p>Bie Han Daren’s idea … …</p><br/><p>Suddenly, his eyes lit up. A daring idea that was also impossible flashed through his mind!</p><br/><p>Was it … …</p><br/><p>———</p><br/><p>“His target is us,” Shang Yu Sheng said slowly. His speaking speed was slow, almost pausing between each word.</p><br/><p>Hai Jin Yun did not have any impatience. He smiled coldly, “He really is ambitious! Tsk tsk, as expected of a top battle general, look, his boldness is something that we cannot match.”</p><br/><p>“His goal is not Bright Mountain Jie, it was us, from the beginning,” Shang Yu Sheng said. “Xi cannot be mobilized, the only ones that the alliance can move to match him are the two of us.”</p><br/><p>“He’s too proud! If he used the time difference and attack us separately, he might have a chance! But we have met up. He wants to use his one battalion against us, ha! He’s too naïve!” Hai Jin Yun’s voice was full of scorn.</p><br/><p>The two of them were new talents of the alliance. Among the new generation, they were strong and major figures. The two of them were thought of genius youths that would possibly become top battle generals. No one doubted this. People believed that if they had a few more years, the duo would definitely become top battle generals.</p><br/><p>Right now, they were not top ranked battle generals, but the difference was minuscule.</p><br/><p>One of them alone might not be able to beat Bie Han, but the two of them together, they had the advantage of numbers and they worked well together, they could only be stronger than Bie Han.</p><br/><p>Hai Jin Yun’s scorn was not just due to arrogance.</p><br/><p>Shang Yu Sheng’s expression was still serious. He said in his uniquely slow manner, “If this is not the case, will we fight him?”</p><br/><p>Hai Jin Yun stilled. He thought and then he shook his head. “No, if I encounter him alone, I will definitely avoid him, wait to meet up with you, before searching him out for a fight.”</p><br/><p>“Maybe this is what he wants,” Shang Yu Sheng said.</p><br/><p>Hai Jin Yun was not stupid and reacted quickly. He said suspiciously, “You mean that he definitely has created a situation to make us feel as though we have the upper hand?”</p><br/><p>“Isn’t that the case?” Shang Yu Sheng asked in return.</p><br/><p>Hai Jin Yun was silent. Bie Han had been the one that had arranged the present situation. If Bie Han had deliberately done this, there was only one possibility. Bie Han had absolute confidence in himself!</p><br/><p>“This is not possible!” Hai Jin Yun couldn’t help but say, “I will admit that Bie Han is strong but I don’t believe that he can fight against the two of us in an open battle! Not even Xue Dong can! Do you feel that the two of us cannot win against him?”</p><br/><p>“I also do not believe it.” Shang Yu Sheng shook his head. “But I believe that Bie Han definitely has powerful moves that we do not know of.”</p><br/><p>Hai Jin Yun nodded. “You are right, we need to be careful of his schemes.” His expression became grave. “But I believe even more that strength is the most important in open battle! We need to keep an eye on the soldiers, maybe spies have made their way into the battalions?”</p><br/><p>“En, you are right, use inactivity to deal with all changes. Keep an eye on the ranks, we will not panic, and there will not be any problems.” Shang Yu Sheng also threw away his worries. The two of them were among the strongest battle generals of the Mo Marshal Alliance. Even though there were some areas of Bei Han’s plan that they did not understand, they would not become timid because of the other’s feints.</p><br/><p>What any famed battle general believed in was himself and the battalion behind him.</p><br/><p>Shang Yu Sheng laughed, fighting spirit in his expression and his tone excited as he said, “Yes, as long as we do not panic, he will not have a chance! Who’s afraid of who! A top battle general is nothing, that’s just because we have not shown our might. I want to see just how much water there is in this top battle general!”</p><br/><p>Suddenly, a wave of urgent alarms sounded. The two exchanged a look, their expressions serious.</p><br/><p>Bie Han had come!</p><br/><p>Translator Ramblings: POV switch back the war. I always thought the point of a weekend was that you didn’t work, but I actually work longer hours on the weekend instead. There goes most of my translation time.</p><br/>\n</div>"}