{"title": "Chapter Seven Hundred and Eighty Five – Bie Han", "id": 835, "volume": 9, "url": "http://boxnovel.org/world-of-cultivation-chapter-seven-hundred-and-eighty-five-%E2%80%93-bie-han", "volume_title": "Volume 9", "body": "<h1>Chapter Seven Hundred and Eighty Five – Bie Han</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Seven Hundred and Eighty Five – Bie Han</p><br/><p>Shang Yu Sheng felt a stirring suddenly rise. He raised his head in shock and saw a scene that he would never forget.</p><br/><p>Ball of flame flew out of the bodies of Sin Battalion to rise into the sky like blooming flowers. In this moment, thousands of balls of flame filled his vision.</p><br/><p>They seemed to slowly fly towards Bie Han dressed in red armor.</p><br/><p>The red armor on Bie Han suddenly lit up with profound and complex scripts. In a blink, the flames in the sky entered Bie Han’s red armor. An angry red mark appeared on Bie Han’s forehead. The red armor moved as though it was alive, feathers shaped like tongues of flame growing at a stunning rate on the red armor.</p><br/><p>Bie Han’s face, neck and other exposed body parts were filled with many icy blue scripts. Those were the jinzhi that had been placed back at Xuan Kong Temple.</p><br/><p>The icy blue and the furious red formed a breathtaking scene filled with stunning beauty.</p><br/><p>Some with keener eyes noticed the changes in Bie Han under the red armor. While Bie Han’s figure had not changed greatly, there were some tiny changes.</p><br/><p>Shang Yu Sheng also found these changes. Suddenly, he thought of Sin Battalion’s change just now and his expression changed drastically.</p><br/><p>———</p><br/><p>Xue Dong did not disguise the shock he felt. He stared hard at the flaming red armor that Bie Han wore, uncontrollable desire showing in his eyes. He murmured to himself, “Shen device raiment! A battle general shen device raiment!”</p><br/><p>Lin Qian was similarly shocked. “I hadn’t thought that Mo Cloud Sea would give their first shen device raiment to Bie Han! Great courage! Great vision!”</p><br/><p>He had to admit Zuo Mo’s strength. Mo Cloud Sea’s first shen device was given to Bie Han. A battle general shen device raiment, this was the first one! Zuo Mo’s choices were always unlike other people. When all the other powers chose to forge shen device raiments for the strongest member of their faction, he gave the shen device to outfit a battle general.</p><br/><p>A seemingly daring choice was of great and crucial effect at this moment.</p><br/><p>People could not understand Zuo Mo.</p><br/><p>Lin Qian had a strong feeling of danger. The Mo Cloud Sea led by Zuo Mo was definitely the biggest enemy to Kun Lun other than Tian Huan!</p><br/><p>Wait!</p><br/><p>Lin Qian suddenly thought of something and his expression changed slightly. “Bie Han is a mo!”</p><br/><p>Xua Dong stilled. When he reacted, his expression changed minutely as well.</p><br/><p>Bie Han was mo!</p><br/><p>No one would have thought that this information that everyone knew was now the deciding factor in this battle. Bie Han was a mo. He grew up in Xuan Kong Temple, and due to his outstanding talent, he was put in charge of Sin Battalion.</p><br/><p>Bie Han was a rare mo who used xiuzhe methods as a battle general.</p><br/><p>At this time, everyone understood this detail they had missed was so crucial!</p><br/><p>Sin Battalion could be modified to have mo physiques, what about Bie Han? From a famed family, Bie Han had an outstanding bloodline. Mo Cloud Sea’s inscription art had the power to express the power in his bloodline.</p><br/><p>Bie Han whose bloodline power had been uncovered would skyrocket in individual power. His individual strength could probably match those of normal gold mo battle generals.</p><br/><p>Yet this was not the most terrifying thing.</p><br/><p>More terrifying was that this meant Bie Han could learn mo fighting tactics!</p><br/><p>Bie Han would become a battle general that could use mo and xiuzhe methods!</p><br/><p>For a battle general of Bie Han’s level, any extra variation in tactics meant that he was that much more adaptable. His strength and the danger he posed would increase drastically.</p><br/><p>And a whole other method of fighting?</p><br/><p>No one knew!</p><br/><p>Because this had never happened before!</p><br/><p>There had never been a battle general of Bie Han’s level that had skill in two styles. Sin Battalion, this wondrous battalion, gave Bie Han great help because Sin Battalion was made out of mo.</p><br/><p>Bie Han and Sin Battalion were perfectly matched. This meant that Bie Han could command Sin Battalion to realize two completely different ways of fighting. It would be a headache even if it was a normal battle general that could do this.</p><br/><p>And if it was a top battle general like Bie Han, how great would the advantage be?</p><br/><p>Many people didn’t even dare to think.</p><br/><p>Lin Qian knew that with Zuo Mo’s personality, he definitely would not ignore Bie Han’s advantage. Bie Han’s shen device raiment would have been forged with this in mind … …</p><br/><p>This shen device raiment … …</p><br/><p>———</p><br/><p>The suddenly change caught Shang Yu Sheng off guard. However, after the initial panic, he quickly calmed down. His expression became calm again even though the presence that Bie Han gave off now immediately suppressed his!</p><br/><p>Yet Shang Yu Sheng’s mind was unusually calm.</p><br/><p>He was patient. He had cultivated his individual strength yet never showed it for many years. He practiced control-type tactics but he still did all he could to make up for his shortcoming.</p><br/><p>He never stopped perfecting himself.</p><br/><p>The hard practice and sweat of many days and months caused his mind to be as strong as stone.</p><br/><p>He knew that at this point, it was proven that Bie Han was more outstanding him. Both sides had played their cards and Bie Han’s hand was better. He had been mistaken.</p><br/><p>Yet he could not retreat now.</p><br/><p>Other than fighting with his back to the wall, he did not have any other choice. Their battalions were entangled together and if he retreated at this time, there would only be one result—they would all be killed.</p><br/><p>Shang Yu Sheng’s gaze burned with fighting spirit. The pride and bravery all mo battle generals had made him fearless.</p><br/><p>Since everyone’s trump card was played, then what was left was to fight!</p><br/><p>The possibility that he could win this fight was very small, but even if not for victory, he had enough reason to fight—for his pride! For his battalion!</p><br/><p>He was Shang Yu Sheng!</p><br/><p>Shang Yu Sheng’s expression was calm as he fearless burned the power inside. No one knew that his tongue had been bitten to pieces in his mouth. Vast shen power accompanied by the thick tang of blood flowed like lava through his body.</p><br/><p>Standing with his hands by his side, Shang Yu Sheng’s presence skyrocketed!</p><br/><p>The rising presence and his fearless intent to fight to the death filled every corner of the battlefield. Even the people watching from the mirages changed expression.</p><br/><p>The mo under Shang Yu Sheng’s command seemed to be struck by lightning. These men that seemed to be made from steel looked dazedly at the sky, at that proud and decisive Shang Yu Sheng shining.</p><br/><p>That was their commander that gave them glory and hope!</p><br/><p>Tears rolled down the upraised faces.</p><br/><p>“Daren!”</p><br/><p>Numerous angry shouts and grieving wails sounded from the battlefield. They knew that Daren intended to fight to the death.</p><br/><p>Suddenly, a mo marshal wiped away his tears and shouted. “Fight with Daren!”</p><br/><p>Suddenly, blood sprouted out of his body in a dozen places, the light surrounding him multiplying in intensity. Frantic power raged inside his body. He grunted, but did not waver. In order to create the image that he was a control-type, Shang Yu Sheng had a mo marshal in his battalion that had lead the attacks in his place.</p><br/><p>“Fight with Daren!”</p><br/><p>“Fight with Daren!”</p><br/><p>Blood spurted, shouts and blinding balls of light rising. Each ball of light was like a furious flame that burning with anything left behind, life burned to create shen power!</p><br/><p>Burning their lives for that commander in the sky that gave them glory and hope!</p><br/><p>Light rose from the burning mo soldiers and flew towards Shang Yu Sheng in the sky.</p><br/><p>The power inside Shang Yu Sheng increased at a stunning rate.</p><br/><p>He looked down at the quickly dimming balls of light under him. The figure of the mo soldiers that fell to their deaths after offering him all of their power. Tears blurred his vision.</p><br/><p>Suddenly, an angry shout rang over the battlefield.</p><br/><p>It was Hai Jin Yun!</p><br/><p>Countless furious flows of air spun rapidly around his body. He was like a blinding meteor that howled as he shot towards Bie Han like a moth to a flame!</p><br/><p>Shang Yu Sheng’s heart felt a stab of pain.</p><br/><p>———</p><br/><p>Bie Han opened his eyes again. Facing Hai Jin Yun charging at him, he was expressionless. Yet the armor he wore, [Arsonist], was like a burning flame!</p><br/><p>The two opposite presences of coolness and fire wondrously merged into one.</p><br/><p>He was like a piece of ice wrapped in furious flames.</p><br/><p>He coolly pointed and stabbed towards Hai Jin Yun flying towards him.</p><br/><p>Pop!</p><br/><p>A deep beat seemed to explode in people’s minds. The ground also shook.</p><br/><p>The space in front of Bie Han seemed to be an invisible wall that rippled.</p><br/><p>Hai Jin Yun seemed to be hit by an invisible hammer head on.</p><br/><p>Before he could make any adjustments, Hai Jin Yu exploded like a ball of fire. The light around him was shattered, turning into fragments that disappeared into the air.</p><br/><p>Hai Jin Yun fell from the sky without any signs of life.</p><br/><p>Everyone in watching the mirages was intimidated. Their expressions changed.</p><br/><p>The hard battle before had proved that Hai Jin Yun had the strength of a top battle general. Yet the death of a top battle general was so simple. How could people not be intimidated?</p><br/><p>Kun Lun and Tian Huan felt as though there was a dagger at their backs.</p><br/><p>Bie Han was so powerful!</p><br/><p>———</p><br/><p>Bie Han did not have any joy on his expression. Hai Jin Yun was at the end of his rope, his battalion completely gone, his energy spent. For mo battle generals, the battalion was the source of their strength. If the battalion was strong, the battle general would be stronger.</p><br/><p>There wasn’t even twenty percent of Hai Jin Yun’ Battalion left. All of them were tired and void of power. The power that they could gather on Hai Jin Yun was almost insignificant.</p><br/><p>In order to realize this goal, Sin Battalion had made a great sacrifice.</p><br/><p>Using up Hai Jin Yun’s power, producing the illusion of a hard fought battle, luring Shang Yu Sheng into the fight, all of that had come at the expense of Sin Battalion’s sacrifices.</p><br/><p>Bie Han had not expected that Shang Yu Sheng was also skilled in traditional mo fighting methods. He had originally planned to use his individual strength to make a surprise move and ambush him. If he could kill Shang Yu Sheng, he would win.</p><br/><p>He hadn’t expected Shang Yu Sheng to be so strong. More importantly, Shang Yu Sheng’s battalion was almost completely untouched.</p><br/><p>Yet Shang Yu Sheng was able to immediately understand the situation after detecting Bie Han’s threat, advancing instead of retreating for a fight to the death!</p><br/><p>Such a powerful opponent!</p><br/><p>Bie Han’s cold eyes filled with fighting spirit.</p><br/><p>Translator Ramblings: The fight is still not over.</p><br/>\n</div>"}