{"title": "Chapter Seven Hundred and Ninety Five – Yield", "id": 845, "volume": 9, "url": "http://boxnovel.org/world-of-cultivation-chapter-seven-hundred-and-ninety-five-%E2%80%93-yield", "volume_title": "Volume 9", "body": "<h1>Chapter Seven Hundred and Ninety Five – Yield</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Seven Hundred and Ninety Five – Yield</p><br/><p>Other than the Green Pulse String, Zuo Mo naturally asked about other things such as the setup of the Totem Coliseum and where the dangers were. Regretfully, the Ghost Mist Child was clearly a recluse, and a super recluse that stayed inside for more than ten thousand years. Except for the small area of the Mist Hall, he had never stepped into any other hall.</p><br/><p>Of course, to show off that he had some connections, the guy said that he was friends with the other Totem Coliseum guardians in spirit.</p><br/><p>Friends in spirit for a long time … …</p><br/><p>Zuo Mo almost cursed out loud. From the words, he knew there was no relationship.</p><br/><p>“Most of this guy’s knowledge has been wrung out, how should we deal with him?” Zuo Mo looked at Pu Yao and Wei, saying, “He’s a troublesome fellow to keep. He might secretly trip us. It is more convenient to kill him!”</p><br/><p>The Ghost Mist Child bellowed, his snowy white face turning even whiter. “Don’t kill me! If you kill me, you will not be able to leave!”</p><br/><p>“Hm, was the spell you just gave us a fake?” Zuo Mo’s face turned murderous immediately.</p><br/><p>The Ghost Mist Child frozen and his face was ashen. Had he given them the true spell just now? He thought about how Zuo Mo had threatened him repeatedly, and he didn’t remember at all what he had confessed in his daze.</p><br/><p>“It is better to kill him!” Pu Yao did not look at the Ghost Mist Child but the mist sea with admiration. “This Mist Eye Tablet is a good place.”</p><br/><p>His intentions of taking over the place was clear.</p><br/><p>Wei said with a smile, “Good!”</p><br/><p>The Ghost Mist Child was struck dumb in fear. “No! Don’t kill me!”</p><br/><p>Zuo Mo looked down at him and said, “Mo Cloud Sea never supports wastrels, if you don’t have any value, why should we keep you alive?”</p><br/><p>“Value?” The Ghost Mist child seemed to grab onto the last bit of hope. He shook and said, “Value! Value! I have value!”</p><br/><p>“Oh, then speak.” Zuo Mo saw the other entering his trap and rejoiced inside. However, he showed an uncaring expression on the surface.</p><br/><p>“I’m willing to give you the Mist Shen Methodology of the Ghost Mist Tribe,” The Ghost Mist child said hurriedly.</p><br/><p>“Mist Shen Methodology?” Zuo Mo made a sound and then asked, “How does it compare to the Sun Shen Methodology?”</p><br/><p>He thought inside, this could be given to Ye Ling, it would be useful.</p><br/><p>The Ghost Mist Child stilled. A moment later, he shook his head. “I don’t know.”</p><br/><p>“See, you want to use just the Ghost Mist Shen Methodology to persuade ye, you underestimate ye.” Zuo Mo had a disdainful expression.</p><br/><p>The Ghost Mist Child gritted his teeth. “This lowly one is willing to be in Daren’s command!”</p><br/><p>Zuo Mo’s eyes lit up.</p><br/><p>The ghost mist child continued, “While these two can take over the Mist Eye Tablet, this is an object that this lowly one forged. While the two can use some of its power, the methods are different, and they cannot use the Mist Eye Tablet’s true power.”</p><br/><p>Zuo Mo had been waiting for this. He deliberately pretended to be thoughtful and said, “You say this, and I do feel that the power of this Mist Eye Tablet is acceptable. However, if you flee into the mist sea, wouldn’t ye lose both wealth and manpower?”</p><br/><p>The Ghost Mist Child felt sweat roll at Little Mo Ge’s “lose both wealth and manpower.” He hurriedly said, “This lowly one is willing to have Daren’s imprint. If Daren uses this shen methodology to leave behind jinzhi, this small one will have no place to flee.”</p><br/><p>Zuo Mo took the shen methodology from the Ghost Mist Child and quickly scanned it. Then he looked amusedly at the Ghost Mist Child.</p><br/><p>The Ghost Mist Child’s heart beat rapidly as Zuo Mo stared at him.</p><br/><p>“One should treasure life. Since you are willing to yield, a good person like ye will naturally follow the will of heaven.” Zuo Mo smiled as he looked at the Ghost Mist Child. “However, this method of yours is too complex. Ye doesn’t need it, ye’s Soul Setting Divine Light is simpler.”</p><br/><p>When the Ghost Mist child heard the words Soul Setting Divine Light, he was stunned.</p><br/><p>“What? You are not willing?” Little Mo Ge said darkly.</p><br/><p>The Ghost Mist child wanted to cry but he knew that the situation did not allow for him to hesitate. This little man in front of him was definitely a vicious person whho wouldn’t blink at killing.</p><br/><p>“I am willing to yield to Daren’s command!” He bent his head and bowed.</p><br/><p>Once he said it, he felt better. In the past, hadn’t his previous master also been so eerie and hard to predict? Also, Master had many experts with him, cultivated the sun shen power, and had a treasure like the Green Pulse String.</p><br/><p>Such a person even ten thousand years ago was outstanding!</p><br/><p>If he was able to work under such a person, he might be able to recover his true body … …</p><br/><p>The Ghost Mist Child immediately felt his heart light up.</p><br/><p>———</p><br/><p>Thunder boomed overhead. Dazzling electric eels split the sky. They formed and dissipated constantly.</p><br/><p>Wei Sheng walked forward step by step. His gaze looked directly forward, his steps were determined. His eyes that were like bloody glass were filled with fighting spirit. Behind him, five guards followed closely. They looked at the straight figure in front of them, their eyes filled with respect and reverence.</p><br/><p>The five of them had been sent to the Thunder Hall together.</p><br/><p>The five carefully traveled. They hadn’t expected to encounter Wei Sheng and immediately sighed in relief.</p><br/><p>Zuo Mo’s plan was completely ruined. The guards without the advantage of numbers could not channel the power of the combat formation. The situation of the guards in the Totem Coliseum became very dangerous.</p><br/><p>Fortunately, they encountered Wei Sheng.</p><br/><p>Wei Sheng had a transcendent status in Mo Cloud Sea. It wasn’t just because he was Zuo Mo’s eldest Shixiong. Wei Sheng’s reputation had been built by using his sword.</p><br/><p>The present Wei Sheng was far from the unknown person of the past.</p><br/><p>He was thought of as one of the sword xiu in the world with the most potential. Even someone like Lin Qian praised him endlessly.</p><br/><p>Wu Kong Sword Sect had become a legend.</p><br/><p>It had created a lord that had the ability to vie for the world, a great battle general that could rank fourth among the ten great xiuzhe battle generals, a peerless sword xiu that could reach the peak of the sword path, adding on Chun Yu Cheng, and Luo Li … …</p><br/><p>No one would have thought that an unknown little backwater sect would be so strong.</p><br/><p>Wei Sheng used his sword to create his reputation.</p><br/><p>This status was one that even the holy ground of sword xiu, Kun Lun, had to admit.</p><br/><p>Wei Sheng suddenly stopped in his steps.</p><br/><p>A brawny figure appeared in front of him.</p><br/><p>“You are Wei Sheng?” the incomer said in a deep voice. He did not disguise his status as a mo at all. His body that seemed to be smelted from copper was filled with a wild power. His head was bare and his upper half was naked. There was a red mark on his forehead. Round copper hoops the thickness of fingers hung from his ears. He wore short leather pants, and stood with bare feet.</p><br/><p>“I am Wei Sheng.” Wei Sheng did not avoid the other’s gaze and asked politely, “You are?”</p><br/><p>Wei Sheng could see that when he admitted that he was Wei Sheng, the other’s eyes suddenly lit up.</p><br/><p>Wei Sheng was greatly familiar with that kind of gaze. That was a gaze filled with fighting spirit.</p><br/><p>The other grinned and showed two rows of white teeth.</p><br/><p>“The fifth mo god of the Mo Shen Temple, Wu Le.”</p><br/><p>———</p><br/><p>Zong Ru and Long Yan fought intensely.</p><br/><p>Ruan You Xian and Ceng Lian’er were not idle. The two were fighting. However, the more they fought, the more shocked Ruan You Xian was. He had thought highly of Ceng Lian’er but hadn’t expected that the other’s strength surpassed his predictions.</p><br/><p>Ceng Lian’ers shen power was not vast, but stable and enduring. From beginning to end, it did not show any signs of drying up. The other’s shen techniques became unpredictable.</p><br/><p>Who said that ancient shen methodologies did not have variations and won based on strength?</p><br/><p>Ruan You Xian became irritated as he fought. The shen technique of Tian Huan focused on variation yet he was suppressed in this field by Ceng Lian’er.</p><br/><p>That crescent moon of Ceng Lian’er’s was full of variation.</p><br/><p>What irritated Ruan You Xian even more was that the other didn’t just have endless variation, her attacks were unusually sharp, especially the Moon Essence Chop. No matter what shen technique he used, it would be bisected. The attack was wondrously sharp.</p><br/><p>What Ruan You Xian did not know that the moon shen power that Ceng Lian’er cultivated was not from some minor shen temple. The Moon Shen Temple had not been as strong as the Sun Shen Temple, but that was only because the Moon Shen Temple attacks were not as offensively powerful. The power of the Moon Shen Temple was great, and the Moon Shen Methodology it passed down was not an ordinary one.</p><br/><p>Ceng Lian’er had improved every day in the years she had stayed with Zuo Mo. However, there were no opportunities for her to fight, so no one knew her strength.</p><br/><p>The only one that knew her strength was Zuo Mo.</p><br/><p>Ruan You Xian naturally was exceptional fighter in order to be given such an important duty by Tian Huan.</p><br/><p>Tian Huan Shen Power was centered on the shen glyph. The magnitude of their strength depended on their comprehension of shen glyphs. In terms of ferocity, Ruan You Xian fell behind Long Yan, but in terms of shen glyph comprehension, he was the strongest of the trio.</p><br/><p>In other words, he was the strongest of the three!</p><br/><p>The shen glyph at his chest suddenly lit up. His presence abruptly changed. In a flash, he seemed to change into a completely different person. An indescribably pressuring presence covered Ceng Lian’er.</p><br/><p>Compared to Long Yan’s shen glyph, Ruan You Xian’s shen glyph was more complete.</p><br/><p>Unlike Mo Cloud Sea’s inscription technique, the shen glyphs of Tian Huan grew naturally as they comprehended the shen glyphs. The deeper the understanding of the shen glyph, the more complete the shen glyph was, the stronger the shen power produced by the shen glyph was, and the number of shen techniques that one could use was also greater.</p><br/><p>The shen glyph that Ruan You Xian had was the [Mountain] shen glyph of Tian Huan.</p><br/><p>This shen glyph had been used by the great ones of the ancient era to understand mountains. It contained some of the wonders of mountains and was peerlessly powerful.</p><br/><p>It was the first complete shen glyph that Tian Huan had discovered, and was the top choice for the disciples to cultivate.</p><br/><p>While the [Mountain] shen glyph was not hard to start learn, it was hard to master. There were countless Tian Huan disciples, but the number of them that could cultivate it to a deep level was only a handful.</p><br/><p>Ruan You Xian was the best among them.</p><br/><p>He had his own interpretation of [Mountain]. This caused his [Mountain] shen glyph to be different from other sect disciple’s [Mountain] shen glyph.</p><br/><p>Even the elders and powers in the sect praised his [Mountain] shen glyph.</p><br/><p>He was filled with confidence in his own power. Even if he could not win against Ceng Lian’er, there were no problems in protecting himself. He thought of the orders from his sect before he had left, and his fighting spirit grew even more!</p><br/><p>Translator Ramblings: Soul Setting Divine Light is finally used again.</p><br/>\n</div>"}