{"title": "Chapter Eight Hundred and Sixty Six – Sea of Ten Thousand Boiling Pools", "id": 866, "volume": 9, "url": "http://boxnovel.org/world-of-cultivation-chapter-eight-hundred-and-sixty-six-%E2%80%93-sea-of-ten-thousand-boiling-pools", "volume_title": "Volume 9", "body": "<h1>Chapter Eight Hundred and Sixty Six – Sea of Ten Thousand Boiling Pools</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Eight Hundred and Sixty Six – Sea of Ten Thousand Boiling Pools</p><br/><p>“Daren, this is the Sea of Ten Thousand Boiling Pools.”</p><br/><p>The guard said respectfully. He had been following Zuo Mo for these past days and observed all of Zuo Mo’s speech and conduct.</p><br/><p>Grandmaster treated the Ghost Lord as an equal without any wariness or restraint. Facing those mo of low status, Grandmaster still treated them equally.</p><br/><p>There was no pride, no disdain, he was willing to explain and help.</p><br/><p>Humbleness when one did not have power was self-protection. Humbleness after possessing power was due to having a noble character and strong self-control.</p><br/><p>Of all the people he had seen, only Grandmaster behaved like this.</p><br/><p>This was really a person worthy of respect!</p><br/><p>Zuo Mo did not know what the guard was thinking. His attention was completely attracted to the scene in front of him.</p><br/><p>Death energy pools of various sizes were spread out into the distance, there was no end. The grey death energy that sprouted out of the pools roiled and spread. From far away, it looked like a grey sea. The grey mists roiled as though they were boiling. This was the cause for the name of Sea of Ten Thousand Boiling Pools.</p><br/><p>“Spectacular!” Zuo Mo murmured.</p><br/><p>The thick and boiling death energy was endless, vast and unfathomable. Zuo Mo stood at the border of the Sea of Ten Thousand Boiling Pools and suddenly felt he was so small in front of such a vast existence. But Zuo Mo was god-level and his mind was strong. This feeling only lasted for a moment before disappearing.</p><br/><p>The feeling of confidence that everything was in his control came back to him.</p><br/><p>Zuo Mo was very curious what it was like under this spectacular Sea of Ten Thousand Boiling Pools. Where did such a great and vast amount of death energy come from, and why had it formed. Zuo Mo could not imagine it.</p><br/><p>Was the legendary Yellow Springs really under here?</p><br/><p>When this thought appeared, Zuo Mo shook his head and laughed. He was thinking too much.</p><br/><p>Things like the Yellow Springs did not exist. Those were myths invented by other people.</p><br/><p>People could be seen all over the Sea of Ten Thousand Boiling Pools. The shen methodology of the Yin Tomb Guards could absorb death energy and turn it to shen power. The Sea of Ten Thousand Boiling Pools with its vast amount of death energy was undoubtedly one of the best cultivation locations.</p><br/><p>“Let’s go in to look around,” Zuo Mo said.</p><br/><p>“Yes!” The guard followed bside Zuo Mo with a wary expression and looked around occasionally.</p><br/><p>“Is it not safe here?” Zuo Mo saw the guard acting like this and couldn’t resist asking.</p><br/><p>The guard’s wariness did not waver. As he maintained his cautiousness, he explained, “The death energy here is abundant, and it is of great help to cultivation. Everyone likes to cultivate here. With more people coming here, small conflicts cannot be avoided. Someone suggested that the Ghost Lord should take over all of the Sea of Ten Thousand Boiling Pools so people would have to pay fees. However, the Ghost Lord did not agree. There are no guards here, and it is slightly chaotic. However, Daren, do not worry, the great majority of people cultivating here are people of the Yin Tomb Guards, there will not be any problems.”</p><br/><p>The guard was right. Before the two had walked far, they encountered people along the way that bowed to the guard.</p><br/><p>“I really didn’t see it, you have good standing with these people,” Zuo Mo said with a smile.</p><br/><p>The guard was slightly embarrassed, “I have served the Ghost Lord for a long time, and my face is familiar.” His rank was not low. In a short amount of time, he had gathered many people. The wariness on his face eased.</p><br/><p>He said to Zuo Mo with a smile, “Grandmaster, if you find a place, pick it out and I will have people stand guard.”</p><br/><p>Zuo Mo smiled but did not speak as he moved through the death energy.</p><br/><p>This was the death energy that was sprouted out of the pools. Because there were too many death energy pools packed closely together, this scene was created. It was possible to see faint figures among many death energy pools. The dense death energy was of great help to the cultivation of these mo. Zuo Mo had to sigh at the unpredictability of the Yin Tomb Ghost Lord’s style. Any other power would definitely take control of such a valuable piece of land.</p><br/><p>But this Yin Tomb Ghost Lord did not do anything with it.</p><br/><p>He really couldn’t understand. Zuo Mo shook his head and suddenly through of a question he asked the guard, “Aren’t the guards here afraid of being disturbed while cultivating here?”</p><br/><p>“They will not be disturbed,” the guards said with a smile, “Grandmaster may not know that once you enter the state of cultivation, these death energy pools will gather large amounts of death energy around you, forming a shield. This death energy shield is very strong, and it will repel all other powers.”</p><br/><p>Zuo Mo was surprised when he heard this. These death energy pools did have some wonders.</p><br/><p>“Grandmaster? Is this the forging grandmaster?” someone next to the guard asked curiously.</p><br/><p>The guard’s expression turned cold and he shouted in displeasure, “Old Wang, do not overstep!”</p><br/><p>Old Wang shrank back. He feared the guard.</p><br/><p>Zuo Mo waved his hand. “That’s fine. Yes, I’m that forging grandmaster.”</p><br/><p>Most people would not call themselves a “forging grandmaster” but Zuo Mo said it so easily as though it was an ordinary matter. However, Zuo Mo’s cool expression made the surrounding people believe his claim immediately.</p><br/><p>These people were experienced and seeing Zuo Mo was easy to talk too, they pressed further. Old Wang said respectfully, “Grandmaster, will you forge shen equipment for me? No matter the conditions as long as I can accomplish them…”</p><br/><p>The guard glared harshly at Old Wang and was about to start scolding.</p><br/><p>Old Wang knew he was about to be scolded but a chance like this was too rare. If he passed it by, it would definitely not come back. He shrank back but he still looked with anticipation at Zuo Mo.</p><br/><p>Zuo Mo said with a smile, “Shen equipment, I have a lot of. Let me ask you something. If you can answer, I will give you one.”</p><br/><p>OId Wang’s eyes lit up and he asked impatiently, “What does Grandmaster wish to know? Ask!”</p><br/><p>“In the Sea of Ten Thousand Boiling Pools, which place has the highest concentration of death energy? I will give a piece of shen equipment.” Zuo Mo still had a smile.</p><br/><p>“I know.” Old Wang was clever and said rapidly, “The place with the highest concentration of death energy in the Sea of Ten Thousand Boiling Pools is of course the death eye.”</p><br/><p>Everyone else had expressions of vexation. They were a step late. They hadn’t expected the grandmaster to ask such a simple question.</p><br/><p>Zuo Mo saw the expressions of everyone else and knew what this person said was the truth. He said briskly, “I’m giving you a piece of shen equipment, wait for a moment.”</p><br/><p>His hand flipped and a piece of shen equipment appeared on his hand.</p><br/><p>He had kept this Mo Cloud shen equipment from the past but it was not suited for nether shen power. Zuo Mo beckoned, hiss, a large wave of death energy flowed suddenly towards the shen equipment in his hand.</p><br/><p>Grey spread quickly along the shen equipment.</p><br/><p>Where the grey color passed through, complex mo matrices took form at a visible rate. The shen equipment seemed to be alive as it twisted and changed shape. Many long spikes appeared.</p><br/><p>No one had seen such a fantastical method of forging. They gaped in speechlessness. Even the guard’s eyes were wide as he stared at the shen equipment in Zuo Mo’s hands.</p><br/><p>About fifteen minutes later, Zuo Mo finished modifying the shen equipment. The shen equipment that had been refined with death energy looked completely different than before. It had a cruder appearance, and many spikes. It looked slightly ugly.</p><br/><p>Zuo Mo threw the shen equipment to Old Wang. “For you.”</p><br/><p>Old Wang could not bear to keep his hands away. He quickly put it on. The ugly grey shen equipment seemed vicious and savage when it was worn. The dense spikes were fearsome.</p><br/><p>Old Wang was overjoyed. He channeled shen power and the spikes on the surface of the shen equipment seemed to come alive.</p><br/><p>The grey spikes formed into little grey snakes the size of fingers. These grey snakes were nimble and lifelike as they hissed.</p><br/><p>“[Nether Snake Shen Methodology]!”</p><br/><p>“Weren’t Old Wang’s nether snakes always unable to take form? The shen equipment is so powerful!”</p><br/><p>The crowd started to discuss. Their gazes when they stared at Zuo Mo became heated.</p><br/><p>Zuo Mo did not plan on wasting time here. He turned and asked the guard, “Do you know where the death eye is?”</p><br/><p>The guard had a hesitant expression. “Grandmaster, the death eye is where the death energy is greatest in the Sea of Ten Thousand Boiling Pools but there is so much death energy there that we cannot get in easily.”</p><br/><p>“Oh, take me for a look, just a look from a distance is fine.” Zuo Mo saw the hesitation of the guard and said.</p><br/><p>“Alright.” The guard did not hesitate and turned to everyone else. He shouted, “You can all leave, stop watching!” He then said to Old Wang. “Old Wang, you got a bargain this time, lead the way.”</p><br/><p>“Alright!” Old Wang said joyfully and lead the way at the front.</p><br/><p>The guard turned to explain to Zuo Mo. “Grandmaster, the death energy in the region leading up to the death eye is too dense. We cannot fly and have to travel on foot.”</p><br/><p>“Alright,” Zuo Mo nodded and said.</p><br/><p>The Nether Realm was composed of mo. While the Yin Nether Guards were slightly strange, the mo here still had strong bodies. They could not learn the shen glyphs of the xiuzhe but it was not difficult for them to use shen power to refine their bodies.</p><br/><p>Zuo Mo had found a long time before that the bodies of the Yin Tomb Ghost Lord and the others had strong bodies, ones even stronger than him. Zuo Mo was even sure that if a flying sword cut at the skeleton Gu Wu Shuang, not even a spark would fly.</p><br/><p>The shen methodology of the Yin Tomb Guards contained a great amount of death energy. The deeper they cultivated, the stranger their bodies would become, just like the Ghost Lord, Gu Wu Shuang, and the others.</p><br/><p>Fortunately, Zuo Mo had eliminated the rampaging burning flows in his body. His body was at its most unburdened state and he was not pressured trying to keep up.</p><br/><p>“Grandmaster is Grandmaster, I hadn’t expected your body to be so strong as well!” Old Wang couldn’t help but say.</p><br/><p>Everyone else was also surprised. From Zuo Mo’s skill at forging, almost everyone felt that Zuo Mo was a xiuzhe. The Nether Realm did not have anyone that could forge at such a level.</p><br/><p>Everyone felt that Grandmaster was mysterious. He was not affected by the death energy, his body did not appear strong yet was filled with strength like a mo, and nothing more had to be said of his forging skill.</p><br/><p>Zuo Mo smiled and did not explain. Suddenly, he felt something and his pupils suddenly contracted.</p><br/><p>He stopped walking and said coolly, “The friend up front, come out!”</p><br/><p>The guard and the others were experienced fighters. Hearing this, their expressions changed slightly and they quickly surrounded Zuo Mo in the middle and turned to face the enemy!</p><br/><p>Old Wang had been timidly shrinking back and earlier, now, stood at the front of the group bravely.</p><br/><p>A blurry figure appeared out of the grey death energy ahead.</p><br/><p>Translator Ramblings: Zuo Mo has such affinity with the mo. I wonder if it is because of the “mo” in his name.</p><br/>\n</div>"}