{"title": "Chapter Eight Hundred and Sixty Nine – Change", "id": 869, "volume": 9, "url": "http://boxnovel.org/world-of-cultivation-chapter-eight-hundred-and-sixty-nine-%E2%80%93-change", "volume_title": "Volume 9", "body": "<h1>Chapter Eight Hundred and Sixty Nine – Change</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Eight Hundred and Sixty Nine – Change</p><br/><p>An unprecedentedly large mist ball formed on the mist giant’s hand. This mist ball that was equal in size to the mist giant had a great visual effect.</p><br/><p>The mist giant lifted the mountainous mist ball and threw it at the enemy.</p><br/><p>A cold smile appeared on the other’s icy face. He had fought against this move many times. The mist balls didn’t have any other abilities than just power. In terms of power, he didn’t believe that anyone could compare to him.</p><br/><p>The mist ball that flew towards him looked astonishing, but in his eyes, the other was just panicking. The more condensed the mist ball, the greater the threat. Such a large mist ball was unlikely to be dense and was a bluff.</p><br/><p>He charged towards the incoming giant mist ball.</p><br/><p>One punch!</p><br/><p>He only needed one punch to completely smash this giant mist ball!</p><br/><p>This was the other’s last bit of confidence. If he could smash this, the other would completely collapse.</p><br/><p>Closer! Even closer!</p><br/><p>Now was the time!</p><br/><p>He took a deep breath. His shen power gathered rapidly at his right fist and he threw out a ferocious punch!</p><br/><p>Pew!</p><br/><p>Unlike the previous mist balls which shattered immediately on impact, this mist ball suddenly produced a strange suction force. His powerful punch seemed to hit empty air. It was so uncomfortable he almost spit out blood.</p><br/><p>Hm?</p><br/><p>It was strange!</p><br/><p>When these words jumped into his mind, the mist ball in front of him suddenly started to look familiar.</p><br/><p>An enormous mouth formed without any warning and swallowed him whole.</p><br/><p>The mist ball grew out four limbs, and a head. It was the mist giant! The other would never have thought that the mist ball that was thrown over was the disguised mist giant.</p><br/><p>He entered a place of darkness.</p><br/><p>A trap?</p><br/><p>The embarrassment on the mist giant’s face grew. It was really embarrassing!</p><br/><p>His thick legs were half bent, his body leaning forward, his brows furrowed into one line. He seemed to be pushing, his body quickly became smaller, and soon, his body reached half of his previous side and could not shrink anymore.</p><br/><p>The pain on the mist giant’s expression reached a peak. At this time, his behind suddenly perked up!</p><br/><p>Pop pop pop!</p><br/><p>Three clear crisp sounds.</p><br/><p>A little condensed ball of mist shot out of the mist giant’s behind like a cannonball. Where it passed, it created three mist rings.</p><br/><p>The enemy was left sprawled out, unconscious.</p><br/><p>“Ohhh!” The Black Gold Seal Soldier who was watching from afar covered his face with his hand. He could not bear to look as though he was feeling this move.</p><br/><p>Zuo Mo gaped. He suddenly turned around and said, “Who taught him this?”</p><br/><p>The Black Gold Seal Soldier immediately became smug. He patted his chest and said proudly, “Who else! Other than the great Black Gold, who could have thought of such a clever killing move! I said to that idiot a long time ago, no one can match this move … …”</p><br/><p>The Black Gold Seal Soldier laughed proudly.</p><br/><p>Zuo Mo looked at the guy and then pointed at the unconscious person on the ground. “The spoils on that guy belong to you.”</p><br/><p>The laughter choked off. The Black Gold Seal Soldier’s expression froze on his face.</p><br/><p>Tenth Grade and Sunshine pretended to not see it. They turned around to pick up the spoils from the female mo.</p><br/><p>What occurred at the Sea of Ten Thousand Boiling Pools caused Zuo Mo’s trip into the sea to come to an abrupt stop. Zuo Mo handed the unconscious person to the Yin Tomb Guards for them to interrogate him about his origins.</p><br/><p>Zuo Mo continued to repair his body. Without the constant damage done by the burning sun flows, the repairing effect of the Nether Ghost Yin Heavy Wood increased. Without realizing it, Zuo Mo’s body had been repaired to the eighteenth level.</p><br/><p>The Guard, Little Huo, came to visit. This was the first time that Little Huo had come since the attack in the Sea of Ten Thousand Boiling Pools.</p><br/><p>“Grandmaster!” Little Huo’s expression was ashamed, “Last time, this lowly one did not manage to protect you, it really was … …”</p><br/><p>Zuo Mo smiled. “If I didn’t have some treasures up my sleeve, I would have been the same in an ambush like this. Have you discovered the origins of these people?”</p><br/><p>The captive had been given to the Yin Tomb Ghost Lord and Zuo Mo did not pay any more attention to this matter. The Nether Realm was just a temporary residence for him. Once he repaired his body, he would leave. He had no interest in the factions and battles here.</p><br/><p>When the matter was mentioned, Little Huo’s expression immediately darked, “It is Jia Man’s people.”</p><br/><p>“Jia Man?”</p><br/><p>“Yes, one of the four Nether Lords.” Little Huo realized and said embarrassedly, “I almost forgot. The Ghost Lord invites Grandmaster for a visit.”</p><br/><p>Zuo Mo nodded. “Then let’s go.”</p><br/><p>Riding the bone carriage, they quickly reached the Yin Tomb Ghost Lord’s residence. When Zuo Mo saw the Yin Tomb Ghost Lord, he was shocked. “Ghost Lord is wounded?”</p><br/><p>The Yin Tomb Ghost Lord was expressionless but his tone was slightly surprised. “Grandmaster has keen eyes. I fought a few rounds with Jia Man. He did not leave well either. It is my shame for the inconsiderate care we took of you during the ambush in the Sea of Ten Thousand Boiling Pools.”</p><br/><p>As he spoke, he opened a jade box. There was a head with angry eyes.</p><br/><p>“This is one of Jia Man’s right hand. He is called Yuwen Hong. He planned the abmush and abduction. I have taken his head to apologize to Grandmaster,” the Yin Tomb Ghost Lord said gravely.</p><br/><p>When he heard that Zuo Mo had been ambushed, he had been extremely angry. He led the Yin Tomb’s Five Ghost Lords to sneak into Jia Man’s lands to take Yuwen Hong’s head. However, they also paid a heavy price. Including the Yin Tomb Ghost Lord, three of them were wounded.</p><br/><p>“There is no need to be so.” Zuo Mo increasingly felt that the Yin Tomb Ghost Lord was a good person. He was quick to repay favors and slights, had honor, and was decisive in his actions.</p><br/><p>The Yin Tomb Ghost Lord said in a grave voice, “Jia Man is a person of great cunning and endurance. He is an insurgent. King is not in a good state recently. Jia Man is restless. This conflict between Yin Tomb Guards and Eastern Nether Mansion could not be avoided. Fighting is about to start.”</p><br/><p>Zuo Mo listened silently.</p><br/><p>“The Eastern Nether Mansion has desired the Ten Thousand Tombs of the Netherworld for a long time. However, the King was worried and had me guard this place.”</p><br/><p>Zuo Mo asked curiously. “Why does he want the Ten Thousand Tombs of the Underworld?”</p><br/><p>“This is the homeland of the King!” the Yin Tomb Ghost Lord explained, “King is of mysterious origins and has always searched for his homeland. Then he found the Ten Thousand Tombs of the Underworld. The rumors say that the Ten Thousand Tombs of the Underworld hides the King’s cultivation inheritance.”</p><br/><p>Zuo Mo’s interest in this Nether King immediately grew. The Ten Thousand Tombs of the Underworld was very mysterious. No matter if it was the Billion Bone Peak, or the Sea of Ten Thousand Boiling Pools, they were all mysteries.</p><br/><p>“Jia Man is so daring?” Zuo Mo couldn’t resist asking. The Nether King was not in a good state recently, but the Ten Thousand Tombs of the Underworld was the homeland of the Nether King. It was still a taboo to attack the Nether King’s homeland.</p><br/><p>“Jia Man is very smart. He will not take it all for himself,” the Ghost Lord shook his head. “An Mo is loyal to King, but a problem occurred during cultivation. The West Jail Mansion cannot protect itself. You Zhe of South Abyss Mansion sways whatever direction the wind blows. Hai Xin Bing of Northern Plains Ice Mansion has always been at odds with the Yin Tomb Guards. Even if she wanted to clean up the situation, she will only act after we fight with Jia Man.”</p><br/><p>“Which of you is stronger?” Zuo Mo asked directly.</p><br/><p>“Jia Man is stronger,” the Ghost Lord said honestly. “Jia Man’s Eastern Nether Mansion is the strongest of the four Nether Lords. The Yin Tomb Guards are weaker than the four mansions, and we are much weaker than Eastern Nether Mansion. However, Jia Man did not think that I would take precautions against him more than a decade ago.”</p><br/><p>“Is there anything I can help with?” Zuo Mo did not want to interfere in the inner conflict of the Nether Realm. However, the Nether Ghost Yin Heavy Wood he needed was still reliant on the Yin Tomb Ghost Lord. He did not want the Yin Tomb Guards to be defeated.</p><br/><p>“Many thanks, Grandmaster! If possible, I want to ask Grandmaster to first forge a batch of suitable shen equipment. The matter of the shen device can be put to the side for now.” The Ghost Lord did not mask his intentions regarding this meeting and immediately made his request.</p><br/><p>“Alright!” Zuo Mo briskly agreed.</p><br/><p>Leaving the Ghost Lord’s residence, Zuo Mo said to Little Huo, “To the Fire Cemetery.”</p><br/><p>Ever since Zuo Mo taught the forgers to cultivate ghost fire, the activity in the Fire Cemetery cooled down. There were not many people to be seen and only those pillars of fire were left.</p><br/><p>Since Zuo Mo had promised the Yin Tomb Ghost Lord to forge a batch of shen equipment, he decided to complete it as soon as possible.</p><br/><p>All kinds of materials flowed towards the Fire Cemetery.</p><br/><p>The news that Grandmaster was about forge quickly spread in the Ten Thousand Tombs of the Underworld. Those forgers that were searching for ghost fire or refining ghost fire stopped what they were doing and hurried over.</p><br/><p>The surrounding mountains were filled with people. They looked curiously at the Fire Cemetery at the bottom of the valley. It was a rare opportunity to see a grandmaster forge.</p><br/><p>Bone carriage after bone carriage filled with materials transported all kinds of materials in a stream. It had not stopped for days.</p><br/><p>“Ming Hong, how many carriages?” someone asked.</p><br/><p>“One hundred and twelve.” Ming Hing immediately gave an accurate number.</p><br/><p>“What does Grandmaster want to do with so much materials? How could he use up so much materials?”</p><br/><p>“Shut up! Just keep watching!”</p><br/><p>The discussion and speculation did not stop in the crowd. No one understood. What did Grandmaster want to do? Ming Hong did not participate in the discussion. His gaze was locked onto the grandmaster.</p><br/><p>Grandmaster’s figure continued to pass through the pillars of fire.</p><br/><p>The materials were piled up like a mountain nearby.</p><br/><p>When Zuo Mo examined the cemetery, he couldn’t help but sigh. It really was a good place to forge. The earth fire here was a good grade and the earth fire was almost unimaginably abundant. There was an ocean of earth fire under the Fire Cemetery. The only detrimental aspect was that there were too many impurities in it.</p><br/><p>However, this was nothing for Zuo Mo.</p><br/><p>In his eyes, the Fire Cemetery was a great cauldron that the heavens had created. The abundant earth fire, the numerous fire openings, this could become a great forging place.</p><br/><p>However, before that, he needed to set up.</p><br/><p>Zuo Mo had a plan. He did not hesitate. With a wave of his hand, many materials floated out of the materials pile.</p><br/><p>The materials that flew out formed a line in the air and entered the flame in Zuo Mo’s hand like birds returning to the next.</p><br/><p>It almost didn’t take any effort for the sun shen fire to forge these materials. The forging was completed in a blink.</p><br/><p>The materials passed rapidly through the sun shen fire. When they did, their appearances changed completely. They were like phoenixes that went through their rebirth. They went from dull to glowing, and flashed with eye-catching light. They drew out bright and grand streaks of light in the air and landed in every corner of the Fire Cemetery.</p><br/><p>The flame in Zuo Mo’s hand seemed able to turn something rotten into a wonder.</p><br/><p>The rays rained out from his hand.</p><br/><p>Trees of fire with silvery flowers stole the gazes!</p><br/><p>The people on the mountains in the surrounded were speechless in shock.</p><br/><p>Translator Ramblings: This is the most wretched technique we’ve seen up until now.</p><br/>\n</div>"}