{"title": "Chapter Eight Hundred and Sixty – Transaction", "id": 860, "volume": 9, "url": "http://boxnovel.org/world-of-cultivation-chapter-eight-hundred-and-sixty-%E2%80%93-transaction", "volume_title": "Volume 9", "body": "<h1>Chapter Eight Hundred and Sixty – Transaction</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Eight Hundred and Sixty – Transaction</p><br/><p>“Yes.” Zuo Mo had an open expression as he said honestly.</p><br/><p>Zuo Mo was immediately filled with desire towards the Northern Plains Ice Mansion’s treasures after seeing the three pieces of Nether Ghost Yin Heavy Wood. He even questioned whether or not to rob them if negotiations failed.</p><br/><p>But if the request was forging shen equipment, it would be even better. While his shen power was almost non-existent, his god-level was still present, his control of fire was unrivaled. His access ot sun shen fire, Silly Bird’s phoenix flames, Lil’ Fire’s Void Sky Li Fire, meant he had three kinds of shen fire to work with. Such a great setup, with so many types of shen fire, if this was made public, it would frighten people to death.</p><br/><p>So Zuo Mo was very calm. With his present condition, he might not succeed in robbing them, but no one would be able to surpass him in forging.</p><br/><p>“Could Elder forge shen devices for us?” Lan Bing’s gaze was bright.</p><br/><p>As Zuo Mo had expected, the Northern Plains Ice Mansion had given the generous gift in an attempt to obtain shen devices.</p><br/><p>“It depends on what materials you have.” Zuo Mo didn’t even move from his sitting position as he glanced at Lan Bing. “Without good materials, no shen device can be forged.”</p><br/><p>Lan Bing laughed softly. “Elder, you do not have to worry about materials. The Northern Plains Ice Mansion is not the richest of the Nether Realm, but does have the materials to forge a shen device.”</p><br/><p>“Oh,” Zuo Mo suddenly said, “if I remember correctly, the Nether Realm doesn’t have a shen device.”</p><br/><p>“ Elder really is not from the Nether Realm.” Lan Bing said pointedly.</p><br/><p>Zuo Mo did not dodge Lan Bing’s gaze and said with a snicker, “I’m not, but what does that have to do with anything?”</p><br/><p>Lan Bing realized her rashness and hurriedly bowed in apology. “This lowly female was impolite!”</p><br/><p>The other was right. If he could forge shen devices, it didn’t matter if he was from the Nether Realm or not. No one would make trouble for him. Even if he couldn’t forge shen devices, just his skill at forging shen equipment meant that no one would make a fuss of his background.</p><br/><p>The Nether Realm was remote and even their communication with the jie of the Hundred Savage Realm was limited. Their communication with the yao and xiuzhe realms were even more rare. The mo were not skilled in forging, and the Nether Realm was the same.</p><br/><p>The shen equipment of the xiuzhe world could greatly increase offensive strength. They continued to flow to the yaomo. The two races quickly found that the shen equipment was effective for them as well.</p><br/><p>The yaomo started to study the forging methods of the xiuzhe but the xiuzhe had accumulated expertise over many millennia. How could it be so easy to learn? The yaomo had found large numbers of forgers with skill to teach them forging, but the shen equipment that they forged was lacking compared to the xiuzhe.</p><br/><p>Zuo Mo hadn’t put much thought into forging shen equipment he gave out as gifts. He had only forged casually based on his habits.</p><br/><p>The abilities of these shen equipment was a great deal better than the Nether Realm shen equipment on the market.</p><br/><p>Zuo Mo didn’t know that the shen equipment that he had given out rose in price every day.</p><br/><p>The Northern Plains Ice Mansion was the fastest to act!</p><br/><p>Zuo Mo waved his hand and said carelessly, “No matter. Just for these three pieces of Nether Ghost Yin Heavy Wood, I will give you some articles of shen equipment if you want. A few dozen is also alright. If you want a shen device, then you need to prepare the materials and pay the price first.”</p><br/><p>Lan Bing liked this kind of straightforward style and immediately asked, “How much payment does Elder want?”</p><br/><p>“Fifty pieces of Nether Ghost Yin Heavy Wood of this quality.” Zuo Mo had a honest expression.</p><br/><p>Lan Bing was slightly surprised. She had heard before that the white-haired elder had been searching for the Nether Ghost Yin Heavy Wood so she had picked three of good quality. She hadn’t thought that this elder would need so much Nether Ghost Yin Heavy Wood.</p><br/><p>The Nether Ghost Yin Heavy Wood was rare. Even the Northern Plains Ice Mansion didn’t have fifty pieces, much less fifty of such quality.</p><br/><p>But honestly, it was not expensive if they traded fifty pieces of Nether Ghost Yin Heavy Wood for the other to forge a shen device. It was only slightly troublesome.</p><br/><p>“May other materials be used as substitutes?” Lan Bing asked cautiously.</p><br/><p>Zuo Mo heard this. This was plausible. He was joyed but he did not change expression. “Tomb Ghost Bone Crystal, Rotten Life Wood, Yellow Spring Lotus, they all work, but have to also be of high quality.”</p><br/><p>Lan Bing calculated inside. With three more types of materials to choose from, it was much easier to gather fifty items.</p><br/><p>“Alright! But it will take time to gather these materials. Elder, please wait for a while.” Lan Bing unhesitatingly agreed.</p><br/><p>Zuo Mo knew as well that it would not be an easy matter to gather so many materials but Little Mo Ge was a clever person. He said, “That’s fine, bring as much as you can. The forging of a shen device is not so easy, it also requires time.”</p><br/><p>Lan Bing did not doubt him. She had never seen a shen device forged and naturally didn’t know the process. But shen devices were rare, and it definitely would be the product of more than a day’s work.</p><br/><p>With this assumption, Lan Bing nodded and said, “No problem.”</p><br/><p>Zuo Mo was overjoyed. If he could really get these materials, his recovery would be complete in no time.</p><br/><p>Lan Bing suddenly said, “It is embarrassing to speak of, but our mansion does not have a forging department. We have more than thirty thousand forgers, but their skill is about the same. The reason is that they always have lacked a master to learn from. If Elder is willing to be the head of the forging department, the payment can be negotiated.”</p><br/><p>Lan Bing looked as though she was willing to pay a great price.</p><br/><p>Zuo Mo was slightly surprised. Thirty thousand forgers. This was not a small number. Ten years ago, Mo Cloud Sea’s forgers would not have much more than this number.</p><br/><p>Zuo Mo knew that the expenses in training forger was high. If Mo Cloud Sea hadn’t just managed catch the market at that time, when Mo Cloud Sea Shen equipment did not lack demand, it would not have been so simple to train so many forgers.</p><br/><p>Northern Plains Ice Mansion was willing to train forgers and set up a special department. Hai Xin Bing had foresight.</p><br/><p>Zuo Mo suddenly realized that maybe Northern Plains Ice Mansion could possibly become Mo Cloud Sea’s enemy.</p><br/><p>His mind moved, and an expression of interest rose on his face. “Oh, a forging department, then let’s go see.”</p><br/><p>Seeing Zuo Mo interested, Lan Bing became joyous. Forging a shen device was far from being as profitable as recruiting a forging grandmaster.</p><br/><p>Lan Bing decided that no matter what, she had to keep this forging grandmaster at the Northern Plains Ice Mansion.</p><br/><p>“That’s great! If the lord knows that Elder is about to come to our mansion, she would be overjoyed,” Lan Bing said happily.</p><br/><p>Zuo Mo glanced at Old Man Wu at the side and suddenly asked, “Old Wu, how many people are in the Wu Family?”</p><br/><p>“Daren, two hundred and seventy,” Old Man hurriedly answered.</p><br/><p>“Then have them pack up and accompany me,” Zuo Mo said.</p><br/><p>“Yes!” Old Man Wu became alert. He had been worried that if the clan stayed in Wu Ge City, the Yin Tomb Guard would come find them for revenge.</p><br/><p>Zuo Mo then said to Lan Bing. “I will not dance around the matter of the black nether mine. I want to sell it to the Northern Plains Ice Mansion.”</p><br/><p>“No problem.” Lan Bing did not hesitate before accepting. “We are willing to purchase it at thirty percent above market price. Elder, what do you think?”</p><br/><p>“Alright.” Zuo Mo nodded.</p><br/><p>“Elder, do you want nether cash or materials?” Lan Bing then asked.</p><br/><p>“Materials,” Zuo Mo said.</p><br/><p>Lan Bing was not surprised by this answer. The obsession forgers had with materials was something hard for others to understand.</p><br/><p>“Daren, what about Tuoba Yu and the others?” Old Man Wu asked respectfully.</p><br/><p>Zuo Mo sank into thought. That group of people was a bother.</p><br/><p>Lan Bing saw this and said, “If Elder feels that it is not easy to take care of, how about handing them over to our forces?”</p><br/><p>Zuo Mo felt that this suggestion was good and agreed.</p><br/><p>After hearing that Zuo Mo was willing to travel to the Northern Plains Ice Mansion, the Northern Plains Ice Mansion immediately sent experts travelling day and night to come and escort Zuo Mo’s group. The number of guards accompanying them increased greatly. The troop was an enormous one with the Wu Clan and the captured Yin Tomb Guards.</p><br/><p>With the old and infirm of the Wu Clan, the troop did not move quickly. Zuo Mo was not in a hurry. He stayed in the chariot every day, and absorbed all kinds of powers along the way to repair his body.</p><br/><p>Zuo Mo had almost absorbed all the powers near Wu Ge City. If he continued to take from them, the shen formations would start to absorb the vitality of those living near Wu Ge City. At that time, Wu Ge City would become a city of death.</p><br/><p>On the way, as he continued to absorb power from the surroundings and the three pieces of Nether Ghost Yin Heavy Wood, Zuo Mo’s body recovered significantly.</p><br/><p>He had absorbed two of the three Nether Ghost Yin Heavy Wood. That could make up for two months of effort.</p><br/><p>Thirty six months, that was thirty six levels.</p><br/><p>Zuo Mo had repaired four levels and he had one pieces of Nether Ghost Yin Heavy Wood left. Adding on what he absorbed on the trip, when he arrived at the Northern Plains Ice Mansion, he would be able to reach level six.</p><br/><p>Zuo Mo was satisfied with this progress.</p><br/><p>In the remaining time on the road, he taught the Wu Clan youths how to cultivate and battle formations. The Wu Clan did not have any experts. If they wanted to protect themselves at this time, they could only rely on battle formations.</p><br/><p>However, what Zuo Mo taught them were not the battle formations that battalions used but what guards would frequently use.</p><br/><p>Other than this, he also forged shen equipment for them. Each Wu Clan youth had a shen equipment. They were completely attired and the Northern Plains Ice Manion guards accompanying them were extremely jealous.</p><br/><p>“Take a look.” Lan Bing said in a low voice to an armored female next to her and then handed over a piece of shen equipment.</p><br/><p>This female dressed in blue ice armor had a beautiful appearance but her expression was icy and unapproachable. She sat on the snowy-white Northern Plains Snow Horse, her body upright and unmoving. She held a large blade that was twice the height of a person in her hand. The blade curved in a crescent and the long handle was covered in blue swirling patterns.</p><br/><p>She was one of the six generals of Northern Plains Ice Palace, Zhu Nan Yue.</p><br/><p>She had just returned from the front lines and was immediately sent by Hai Xin Bing to protect Zuo Mo’s group. Her guards were all females, each of them with solemn expressions. They didn’t make any sounds as they marched.</p><br/><p>Zhu Nan Yue and Lan Bing had a close relationship. She carefully looked at the shen equipment in her hand and her expression became serious. She looked closely, turning it over and over. She looked for a long time before lifting her head.</p><br/><p>“How is it?” Lan Bing hurriedly asked.</p><br/><p>“If I had such shen equipment, my strength will increase by two-tenths.” Zhu Nan Yue’s tone was certain.</p><br/><p>Lan Bing knew that Zhu Nan Yue was a reliable and conservative person. She would not exaggerate. If she said it could increase her strength by two-tenths, it would not be less than two-tenths and was likely more effective.</p><br/><p>“Look at this.” Lan Bing handed over another piece of shen equipment. It was the shen equipment of the Wu Clan.</p><br/><p>She had used many methods in order to get this shen equipment.</p><br/><p>Translator Ramblings: Zuo Mo’s next meal ticket is here.</p><br/>\n</div>"}