{"title": "Chapter Eight Hundred and Seventy Five – Reunion", "id": 875, "volume": 9, "url": "http://boxnovel.org/world-of-cultivation-chapter-eight-hundred-and-seventy-five-%E2%80%93-reunion", "volume_title": "Volume 9", "body": "<h1>Chapter Eight Hundred and Seventy Five – Reunion</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Eight Hundred and Seventy Five – Reunion</p><br/><p>Dragging the shen wood coffins with the little ones protecting him, Zuo Mo’s little group travelled through the Sea of Ten Thousand Boiling Pools.</p><br/><p>With the start of the war there were far fewer people in the Sea of Ten Thousand Boiling Pools. The enormous sea was quiet and Zuo Mo did not encounter any people on their way.</p><br/><p>As they went deeper, the surrounding death energy became thicker.</p><br/><p>The five shen wood coffins that Zuo Mo dragged released faint light. The surrounding death energy was being sucked into the shen wood coffins, turned into base shen power, and channeled into the five people in the coffins.</p><br/><p>Zuo Mo was not shocked by the transformation of the shen wood coffins. What shocked Zuo Mo was the change in the King’s Horns.</p><br/><p>The King’s Horn was tied to Zuo Mo’s belt. It gave off an extremely low sound. Zuo Mo felt a wave of heat come out of his blood. His entire body seemed to turn warm, fighting off the energy in the air.</p><br/><p>This time, the dark golden ball did not move. It seemed as though it knew the vibrations released by the King’s Horn was not an attack.</p><br/><p>Zuo Mo marveled inside. The King’s Horn really could directly influence the power in mo blood. After his body warmed up, the illusions in front of him decreased greatly and the bone-chilling cold also lightened.</p><br/><p>The King’s Horn trembled slightly at his waist. Zuo Mo felt as though he was filled with power.</p><br/><p>As expected of the King’s Horn!</p><br/><p>Zuo Mo’s confidence increased. With the help of the King’s Horn, he might be able to reach the death eye this time. He dragged the five shen wood coffins as he continued to advance. Compared to him, the little ones clearly adjusted better. Silly Bird had the body of a phoenix that was immune to all evil and yin forces, Lil’ Black was sitting on Silly Bird’s head as usual as it looked off into the distance. Lil’ Fire had swallowed countless amounts of Void Sky Li Fire in the endless void. This kind of dark and evil energy was ineffective against it. Lil’ Pagoda was next to Lil’ Fire as its eyes blinked.</p><br/><p>The Ghost Mist Child had started to refine the death energy into his body. He was made out of mist to start with. If he could incorporate death energy, he would have another attack. If he cultivated too many types, then it would be too heterogeneous. But inspired by the Black Gold Seal Soldier, he thought of a wonderful idea. He turned his body into two parts. His body was pure ghost mist, and his stomach was another space. There were all kinds of mist and poisons floating inside it.</p><br/><p>If he encountered a strong enemy and swallowed the other into his stomach … …</p><br/><p>The power of “that move” would become stronger over time. The Ghost Mist Child was full of joy. As expected, a scheme was more useful than brute force. Ah, If he was as smart and lowly as Black Gold … …</p><br/><p>Black Gold could not understand Ghost Mist Child’s sorrow. He was a seal soldier, and the death energy did not influence on him. However, this death energy had a flavor he did not like and he could not eat it. This caused him to feel slightly hungry. He looked around and wanted a monster to jump out immediately so he could fill his stomach.</p><br/><p>Sunshine flew next to Tenth Grade, occasionally sprinkling all kinds of light towards Tenth Grade to ward away the death energy. Tenth Grade still had a cool expression as usual as he stared forward and flew forward murderously. He cultivated sword essence and he wasn’t interested in death energy.</p><br/><p>The sidekick troupe moved forward. However, they looked more like a gang that was wandering the streets and waiting to make trouble for someone and not like a well-trained elite military forces.</p><br/><p>“Big Brother, we’ve walked for so long, why isn’t there anything?” the Black Gold Seal Soldier couldn’t resist but mutter.</p><br/><p>Zuo Mo kept on walking as he said, “What do you want?”</p><br/><p>“Something to eat.” The Black Gold Seal Soldier appeared as though he was ravenous.</p><br/><p>No one paid attention to him.</p><br/><p>Zuo Mo quickly moved past where he had stopped last time. The thick death energy finally became a pressure on everyone</p><br/><p>Tenth Grade’s crescent blade came out of its sheath. The eyes in that cool little face flashed with coldness. Black Gold Seal Soldier cracked his fists. The sway of his head lessened greatly. His eyes narrowed lightly. The other little ones were on their guard.</p><br/><p>If a monster jumped out now, they would be cut to death immediately.</p><br/><p>Everyone had travelled the endless void for a long time and were very experienced. The death energy here was too thick. It would be abnormal if no monsters formed here.</p><br/><p>Lil’ Black’s two antennae waved madly.</p><br/><p>“Ha! Finally about to open for business! No one compete with me!” Black Gold Seal Soldier rubbed his fists together in excitement</p><br/><p>Tenth Grade didn’t even lift his eyelids as the crescent blade disappeared from his hand.</p><br/><p>A bloody sword energy entered the death energy in front of him.</p><br/><p>Hm?</p><br/><p>Tenth Grade’s eyes flashed as he suddenly pulled and twisted with his hands.</p><br/><p>A grey shadow suddenly smashed to the ground in front of them with the crescent blade piercing its body. Tenth Grade’s Hundred Sacrifice Soul Killing Sword had reached a masterful level. The transformation of this move was not complex but it was appropriate. The experience of the endless void caused the motivated Tenth Grade to reach an astounding level.</p><br/><p>“Hey hey hey! Tenth Grade! You are terrible! When I was … …” Black Gold Seal Soldier glared angrily at Tenth Grade.</p><br/><p>Tenth Grade did not seem to hear it. He beckoned and the crescent blade returned to his hand.</p><br/><p>Everyone else walked over and surrounded the grey shadow to examine it.</p><br/><p>Its appearance was unique. It did not have limbs and it appeared like a grey ball of flesh. Long dark grey tentacles covered it. The tentacles were thin and floated in the death energy like seagrass.</p><br/><p>“This is disgusting!” The Black Gold Seal Soldier had a disdainful expression. This thing could not rouse his appetite.</p><br/><p>“Would something born of the death energy not be disgusting?” Zuo Mo said as he flipped the being over to examine it</p><br/><p>The monster’s body disappeared at a visible rate. It could be seen that the great majority of its body was made from death energy. In the end, a dark bead was left. Zuo Mo picked it up.</p><br/><p>“This bead isn’t bad. It is higher quality than the death energy beads I made.” Zuo Mo was slightly surprised.</p><br/><p>His thoughts suddenly moved and Zuo Mo took out the ghost fire from his ring.</p><br/><p>The figure of the female appeared in the ghost fire. Her figure was much more solid compared to before. While her features were still unclear, but it was much better than looking as though she would dissipate at any moment.</p><br/><p>“Daren!” She bowed elegantly. She did not use the term grandmaster but daren to show that she had submitted.</p><br/><p>“Is this useful to you?” Zuo Mo reached out and revealed the black bead that he had just obtained.</p><br/><p>The female was slightly shocked. “This death energy bead is extremely high in quality. Is Daren bestowing this to this servant?”</p><br/><p>“For you.” Zuo Mo threw it over.</p><br/><p>“Thanks, Daren!” The female was overjoyed. The flames flashed, and a tongue of flame wrapped around the death energy bead.</p><br/><p>This death energy bead was astounding high in quality. After consuming the death energy bead, her figure became even clearer, and her facial features became clear. She had a beautiful appearance and a calm presence.</p><br/><p>Zuo Mo said to the others, “Let’s continue, be careful.”</p><br/><p>Without Zuo Mo’s warning, the little ones still knew that what was up ahead would not be peaceful.</p><br/><p>Along the way, they encountered a few more monsters like this. These monsters were most skilled in illusions and evil thoughts but they were ineffective against Zuo Mo’s group. Everyone’s resistance towards evil thoughts was high, and with Sunshine who specialized in breaking illusions, the other people could focus on battle. They progressed quickly.</p><br/><p>However, they only obtained three death energy beads. Not all monsters had death energy beads. Zuo Mo was not frugal and gave all three of the death energy beads to the ghost fire.</p><br/><p>The woman of the ghost fire hadn’t thought that Zuo Mo would be so generous and was grateful. She had hidden in the ghost fire for many years, and her soul was about to dissipate. If she did not encounter Zuo Mo, she would have dissipated after twenty to thirty years.</p><br/><p>If other people found her hiding among the fire, her outcome would be bad.</p><br/><p>Actually, she had felt slightly anxious. Zuo Mo was a forging grandmaster, how could he not know what her use was? If this was someone else, they would have forged her already. She only understood some when she saw Lil’ Pagoda, Lil’ Fire, and the others.</p><br/><p>Zuo Mo did know what her use was, but Zuo Mo had special feelings towards things that had souls. Pu Yao, Wei, the little ones, they were his best friends.</p><br/><p>And he was so rich that other people could not imagine it.</p><br/><p>He had an extremely large amount of materials, the shen device nucleus that had not been forged, the parts of the shen device that his father had left behind, the King’s Horn, the other materials he had obtained from the Yin Tomb Five Ghosts and rare and valuable materials he obtained from the endless void.</p><br/><p>The entire xiuzhe world was furiously searching for peak materials to forge shen devices and Zuo Mo had stocked up on a batch. Once his shen power recovered, he could forge true shen devices.</p><br/><p>If he was not forced to, he did not want to forge spirits and souls that were alive. It was not that he respected life, but he treasured his friends.</p><br/><p>Ge has enough materials and doesn’t care! Zuo Mo comforted himself like he was a rich tycoon.</p><br/><p>The density of death energy in the surroundings dramatically increased. The death beings that appeared became stronger and stronger. Fortunately, the moves of these beings born from death energy were simple. Zuo Mo’s sidekicks were well-rounded and could attack both near or far and against individuals or groups.</p><br/><p>They crushed their way through. The quality of the death energy beads became higher and higher. The ghost fire had reached a limit on the death energy beads she ate.</p><br/><p>Yet no one was happy. The more they moved forward, the greater the pressure was. The monsters that appeared became stronger and stronger. They encountered a kind of monster whose body was intangible. None of their attacks were effective. In the end it was Sunshine who used a rarely used illusion-breaking spell to kill it.</p><br/><p>Everyone stopped. Looking at the scene in front of them, none of them had good expressions.</p><br/><p>This place was like a dividing line. There seemed to be a transparent barrier in front of them. On this side of the line was thick grey death energy. On the other side of the line, the color of the death energy was extremely faint but Zuo Mo was not careless. It was not that there was no death energy ahead, but the death energy had become close to transparent.</p><br/><p>The almost transparent death energy gave Zuo Mo an even greater feeling of danger. What caused Zuo Mo to feel danger wasn’t just the transparent death energy.</p><br/><p>A large number of grey pointed shapes passed through the air like a school of fire. They did not seem to notice the arrival of Zuo Mo and the others.</p><br/><p>Countless twisted shadows and colors formed and extinguished in the air. Zuo Mo and the others could make out beautiful song, sobbing, and screams … …</p><br/><p>All kinds of sounds mixed together. Even Sunshine who was skilled in breaking illusions had a grave expression.</p><br/><p>“These illusions here are top-tier, and very strong!’ Sunshine’s expression was slightly nervous.</p><br/><p>Hearing Sunshine’s words, everyone’s faces were slightly stiff. Any kind of method was extremely terrifying when it was top-tier, it was the same with illusions.</p><br/><p>The line marked another world</p><br/><p>As they got here, even Zuo Mo couldn’t help but feel the urge to retreat. The monster they had encountered just now was as strong as the monsters they encountered in the endless void.</p><br/><p>As they went deeper, the monsters would definitely be even stronger.</p><br/><p>Top-tier illusory arts were terrifying. Zuo Mo and the others had encountered it once in the endless void and almost died. In top-tier illusions, time and space became blurry. You never knew if the fellows with you were true or false. Your demons and your emotions could become fatal enemies.</p><br/><p>It had mostly been luck that they had managed to escape that time. But even so, all of them had been wounded.</p><br/><p>So when they heard it was a top illusory art, everyone felt the urge to retreat.</p><br/><p>Just as Zuo Mo was hesitating, snap, light flashed and everything disappeared.</p><br/><p>A monster with six bone spikes on his back appeared in front of them.</p><br/><p>Zuo Mo felt that this monster was slightly familiar. He frowned and thought hard before his eyes widened. “It’s you!”</p><br/><p>Shi who they had encountered at the Sealed Extinction battlefield had six subordiantes. This monster was one of them.</p><br/><p>Shi was here?</p><br/><p>Zuo Mo was slightly stunned and then he was overjoyed. In Zuo Mo’s mind, the strongest person was not Chief Elder or Lin Qian, it was Shi. This old monster that had lived for more than ten thousand years and was of unfathomable power. Zuo Mo felt that no one else would be able to do something like sealing the sun crystal seed.</p><br/><p>The monster suddenly spoke, “Master knew that you have come and had me come welcome you.”</p><br/><p>It seemed as though the being rarely talked from how raw its voice was. However, its gaze was gentle and without any enmity.</p><br/><p>Thinking of Shi’s impossible moves and unfathomable power, Zuo Mo was immediately filled with hope. Shi would definitely have a way to wake Eldest Shixiong and the others. He would definitely have a way to fix Zuo Mo’s body.</p><br/><p>Zuo Mo felt as though his mood went through a rollercoaster and quickly became better.</p><br/><p>“You are living here?” Zuo Mo asked the bone spike monster curiously.</p><br/><p>“Yes.” The bone spike monster nodded.</p><br/><p>Zuo Mo tsked in wonder. “You are really strong to find such a strange place!’</p><br/><p>The bone spike monster chuckled.</p><br/><p>Following the bone spike monster, Zuo Mo’s group did not encounter any obstruction along the way. However, the group was experienced and their hearts trembled when they saw the defenses along the way. They knew that if they had tried to charge in using brute force, they would not be able to make it through.</p><br/><p>Zuo Mo finally understood why no one dared to come close to the death eye. But he changed his way of thinking. Such thick death energy was most suited to Shi.</p><br/><p>Ever since their parting at the Sealed Extinction Battlefield, he had never seen Shi again. He had not expected to reunite here.</p><br/><p>Surprises such as encountering someone familiar in an unfamiliar place was a joy.</p><br/><p>The area of the death eye was greater than they imagined. They walked for a long time. On the way, Zuo Mo saw many death energy pools. The death energy pools here were filled with water but Zuo Mo could see that they were not water, but made of extremely pure and dense death energy.</p><br/><p>A drop of the clear pool water here could be sold for a great price outside.</p><br/><p>This really was a stunning place!</p><br/><p>Zuo Mo and the others marveled inwardly.</p><br/><p>Yet when Zuo Mo saw Shi, he was shocked.</p><br/><p>Translator Ramblings: The ghost fire female thinks Zuo Mo is so soft-hearted and kind. She should ask all the people he scalped.</p><br/>\n</div>"}