{"title": "Chapter Eight Hundred and Eighty Two – Taking The Lead!", "id": 882, "volume": 9, "url": "http://boxnovel.org/world-of-cultivation-chapter-eight-hundred-and-eighty-two-%E2%80%93-taking-the-lead", "volume_title": "Volume 9", "body": "<h1>Chapter Eight Hundred and Eighty Two – Taking The Lead!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Eight Hundred and Eighty Two – Taking The Lead!</p><br/><p>An Mo spoke of his worries. The entire camp was silent. Liang Wei frowned. He did not fear strong enemies. In the battles of these past years, they had beat enemies that were better equipped or outnumbered them multiple times. However, the present situation was too terrible. It was not how powerful Hai Xin Bing was, but all of Nether Realm held serious doubts in the succession of the new king. In other words, Zuo Mo did not have enough of a reputation in the Nether Realm.</p><br/><p>“If Daren publicizes your identity, maybe … …” An Mo couldn’t help but say.</p><br/><p>Liang Wei shook his head. “Not suitable! That way, the enmity may become even stronger. In their eyes, the king is an outsider. More people will oppose an outsider taking the throne!”</p><br/><p>Many people couldn’t help but agree. If it was not for the Nether King’s personal appointment, even they were not willing to have an outsider be their king.</p><br/><p>Everyone had heavy hearts. When they found that all of the people in Nether Realm opposed them, they found how minuscule their power was.</p><br/><p>Hai Xin Bing was truly skilled!</p><br/><p>Everyone’s gazes gathered on Zuo Mo. They had no plans left.</p><br/><p>Yet what surprised them was that Zuo Mo did not show any panic, and actually had a bemused expression. However, something seemed to be burning in that pair of eyes.</p><br/><p>Everyone stilled, King was … …</p><br/><p>Before they could understand, they heard Zuo Mo speak, “From where we are, which is the shortest path to Nether King Palace?”</p><br/><p>An Mo pointed at a route that had been labelled in red on the jie map. “This one! This was our original plan, but now, the enemy most likely would have set up many obstacles on this path to stop us from reaching Nether King Palace. I suggest that we choose a more hidden … …”</p><br/><p>Zuo Mo interrupted An Mo’s words and said decisively, “We will go on this path!”</p><br/><p>An Mo panicked. “King! The enemy will have sent large numbers of battalions on this path, even if we can break through, the time spent … …we would miss the coronation”</p><br/><p>An Mo’s commanders spoke in agreement to try to stop Zuo Mo. They were more familiar with Nether Realm. They knew that this path would be one that the enemy would heavily defend! Everyone even knew that An Mo saying the path would take time was just to save King’s face. In their view, with the manpower they had now, they could not break through the other’s defense lines!</p><br/><p>Liang Wei did not speak, but his expression was also one of disagreement. The rebels would set up great obstacles on the shortest route to stop them from reaching Nether King Palace.</p><br/><p>However, Liang Wei had settled down after the hardships of the past years. While he was slightly puzzled, he also knew that Zuo Mo was not a rash person. Also, behind Zuo Mo was a powerful genius like Pu Pu. How could he make such a common mistake?</p><br/><p>Liang Wei did not find Pu Pu around Zuo Mo. He guessed that Pu Pu was a hidden advisor that helped Zuo Mo through the Ten Finger Prison.</p><br/><p>Had Mo Cloud Sea’s battalions already arrived?</p><br/><p>Liang Wei shook his head. It would appear that the arrival of Vermillion Bird Camp or Sin Battalion would greatly increase their manpower, but in Liang Wei’s view, this was not a good move.</p><br/><p>Mo Cloud Sea’s battalions were from the outside, but this battle was one internal to the Nether Realm. If Zuo Mo’s identity as the king of Mo Cloud Sea was exposed, Zuo Mo would be considered an outsider in the eyes of most people. Hai Xin Bing only needed to make some waves, and the great majority of the people would side with Hai Xin Bing.</p><br/><p>No one liked to be ruled by an outsider, even if Zuo Mo was appointed the successor by the old Nether King. All the factions of Nether Realm would rebel.</p><br/><p>While Zuo Mo at present was weak in the eyes of other people, no one doubted his legitimacy as the new nether king. They just had insufficient confidence in him.</p><br/><p>Zuo Mo looked around. His gaze flashed with strong confidence. They were no weighty presence but people could feel the great power.</p><br/><p>Under this kind of gaze, everyone quieted.</p><br/><p>Zuo Mo smiled slightly and suddenly asked a completely unrelated question, “How did Shi unite the Nether Realm?”</p><br/><p>An Mo stilled and then had a reminiscing expression. “In the past, King lead us across the Nether Realm and we conquered jie by jie. King was too powerful. No one was able to stop us. Everywhere we passed, all the factions submitted!”</p><br/><p>Many of the people present had participated in the war to unite the Nether Realm back then. In that war that was not very long, Shi had been unrivalled. When they thought back to it now, they couldn’t help but tremble from the bottom of their hearts!</p><br/><p>In their minds, that was a grand and glorious campaign.</p><br/><p>But soon, their thoughts came back. They felt slightly dispirited. Compared to the glory of the past, they were in decline now!</p><br/><p>Zuo Mo detected the changes in expression. He smiled but then he quickly put away his smile. The light in his eyes grew stronger as he said seriously, “If that’s the case, then just like Shi in the past, we will fight jie by jie on our path to Nether King Palace.”</p><br/><p>All of the noise disappeared. The entire camp was so quiet the drop of a pin could be heard.</p><br/><p>Everyone gaped as they looked dazedly at Zuo Mo. They couldn’t speak.</p><br/><p>Zuo Mo’s voice clearly passed into the ears of everyone in the camp. His voice was not fast, not excited, not deep, but seemed to carry a power that could reach into their hearts.</p><br/><p>“If only by conquering them will I be able to step onto the throne, if only by defeating them will they shut their mouths, if only battle can bring peace, if only power can make Nether Realm submit. So be it.”</p><br/><p>Zuo Mo sat straight, his eyes becoming burning bright, but his tone still calm and flat, filled with great confidence. For some reason, the blood in everyone’s bodies started to heat up, and their breathing started to become heavy.</p><br/><p>As Zuo Mo’s expression became authoritative, his tone slowly became cold.</p><br/><p>“The honor and glory of the King will not be challenged! Since only by washing the throne in their blood will they understand, then we will conquer them, crush them, destroy them! Use battle and death to command them, submit or die!”</p><br/><p>The eyes of all of the mo battle generals, including An Mo, turned red, their breathing deepened as their eyes widened!</p><br/><p>Among the mo, the king was unparalleled!</p><br/><p>Zuo Mo stood up. The lines of his face were so cold they seemed to be carved from the stone. He looked around expressionlessly.</p><br/><p>Woosh, everyone stood up. They threw out their chests. They hadn’t expected that King would be so strong and domineering, their fighting spirits were roaring!</p><br/><p>“I will lead you, fight jie by jie, to Nether King Palace!”</p><br/><p>“Yes!” All of the mo commanders responded. They were excited and wanted to move immediately.</p><br/><p>“Liang Wei! Fei Lei!” Zuo Mo said gravely.</p><br/><p>“Present!” Liang Wei and Fei Lei responded.</p><br/><p>Zuo Mo looked directly at Liang Wei and ordered, “You will lead the King’s Horn to protect the flanks.”</p><br/><p>“Yes!” The two unhesitatingly responded. Zuo Mo’s cold and icy gaze was filled with indescribable pressure. Their hearts uncontrollably tensed.</p><br/><p>Everyone knew, the king was angry!</p><br/><p>The astounding pressure that Zuo Mo released caused every person’s heart to instinctively tremble. For some reason, they also felt an unusual excitement and ecstasy.</p><br/><p>The previous Zuo Mo had a good temper and treated people well. Everyone liked him, but in their view, he was not qualified to be the nether king because he lacked the domineering presence of a king!</p><br/><p>The mo liked combat. They forever revered those strong. Logic was nothing, and not as enjoyable as fists!</p><br/><p>The entire battalion quickly gathered. An Mo’s battalion contained almost all the experts of Western Jail Mansion. While they were not many in number, they were powerful.</p><br/><p>When they heard that King was about to lead them personally to fight to Nether King Palace, the entire battalion boiled over! They had heard enough of the rumors in the past few days. They did not fear battle.</p><br/><p>It should be like this!</p><br/><p>Everyone had the same thoughts.</p><br/><p>When they saw Zuo Mo appear at the front of the ranks, the cheers shook the sky. The entire battalion was energized, and everyone was extremely exhilarated.</p><br/><p>From now, King would lead them to fight to Nether King Palace!</p><br/><p>There seemed to be a ball of fire burning in Zuo Mo’s chest. He was truly angry. Shi did not have much time. If they were constantly delayed like this, he would not be able to ascend to the throne of the Nether King before Shi’s death.</p><br/><p>Zuo Mo decided to use the simplest and crudest method to solve the problem.</p><br/><p>Since Shi had united the Nether Realm like this back then, then he would do it as well!</p><br/><p>At present, he had the ability.</p><br/><p>He rode a Copper-Boned Nether Bird King. This Copper-Boned Nether Bird King was about the height of three people added together, the wingspan seven zhang, and enormous in stature. The bird did not have any feathers, and the copper bones were neatly arranged in rows. Its skin was thick, and it was strong, extremely fast, but it had a terrible temper. Usually, it was only willing to let An Mo ride it.</p><br/><p>Yet when Zuo Mo rode the bird, it was unusually tame and obedient. The soldiers were extremely surprised.</p><br/><p>When An Mo handed over the reins, he was about Zuo Mo’s safety so he stood by Zuo Mo’s side.</p><br/><p>Zuo Mo picked out a gold crystal sword from his ring and waved it a few times. His movements looked unprofessional and made An Mo worry slightly.</p><br/><p>Directing a battalion was not the same as fighting as an individual. He did not know what King’s skill in this area was. King had never shown it before.</p><br/><p>“Are you prepared?” Zuo Mo asked without turning his head back.</p><br/><p>An Mo shook. “Prepared!”</p><br/><p>He glanced at Zuo Mo and asked carefully, “King, should we ask about the other’s origins?”</p><br/><p>Zuo Mo glanced at An Mo and then moved his gaze away. “No need.”</p><br/><p>Meeting King’s gaze, An Mo’s heart suddenly jumped. The coldness in King’s gaze was completely undisguised. Even he, a battle general that had been through hundreds of battles, felt completely cold all over.</p><br/><p>Zuo Mo stared forward and said coldly, “Anyone that is in front of us is our enemy! Anyone that is our enemy shall surrender or die!”</p><br/><p>An Mo suddenly felt a chill.</p><br/><p>Sitting on the back of Copper-Boned Nether Bird King, Zuo Mo raised the gold crystal sword in his hand. The golden sword flashing with blinding light under the sun like the king’s banner.</p><br/><p>Everyone raised the mo weapons in their hands with enthusiasm.</p><br/><p>The mo weapons were like a forest and the killing intent rose into the sky!</p><br/><p>Translator Ramblings: Zuo Mo doesn’t get the Nether Realm for free. It’s to be expected. No one wants to be ruled by someone unknown.</p><br/>\n</div>"}