{"title": "Chapter Eight Hundred and Eighty Five The Last Chance", "id": 885, "volume": 9, "url": "http://boxnovel.org/world-of-cultivation-chapter-eight-hundred-and-eighty-five-the-last-chance", "volume_title": "Volume 9", "body": "<h1>Chapter Eight Hundred and Eighty Five The Last Chance</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Eight Hundred and Eighty Five The Last Chance</p><br/><p>Fei Lei looked at the shen equipment of An Mo and the others with a heated gaze. The people around him had similar gazes. When the crude and simple grey shen equipment was completely put on, it gave off a strong feeling of murderousness.</p><br/><p>Like a battalion that had stepped out of hell!</p><br/><p>Everyone was knowledgeable and they could see the extraordinary nature of the shen equipment. Also, King had created them! Just that alone meant that they were the symbols of glory!</p><br/><p>After resting for a night, Liang Wei was much better. He glanced at Fei Lei and said with a smile, “Stop yearning, after we get earn some victories, King will also forge shen equipment for us.”</p><br/><p>Fei Lei reluctantly moved his gaze away. He balled his fist and said strongly, “Yes! We have to obtain a great victory! Outcompete these people!”</p><br/><p>They were envious but they did not feel it was unjust. They had seen the hardship of the main battle force in these past days, and their own fighting was much less.</p><br/><p>But Liang Wei was not discouraged. After resting, he finally digested the shock of the past few days. After adjusting his mentality, Liang Wei started to shine with his own light.</p><br/><p>“The big fight is still ahead.” Liang Wei’s eyes narrowed. “Haven’t you noticed that the enemies we encounter in the last few days have grown fewer?”</p><br/><p>“Yes! They’re frightened! Who would have expected King to be so strong!” Fei Lei said with humor. He had an expression of pride as though he shared in the glory.</p><br/><p>Liang Wei nodded. “Yes! King is strong, and ferocious in the charge, no one can rival him! If I was the enemy, I will not set up obstacles like this again, I will try to gather more battalions, and more power for a final battle with King as soon as possible.”</p><br/><p>Fei Lei shook his head. “No one can stop King!”</p><br/><p>His voice was filled with strong confidence. In these past days, he had seen how Zuo Mo had led the battalion to rush through the enemy battalions. He believed that no one would be able to withstand such a charge.</p><br/><p>“Yes, usually, they will not be able to stop it. However, what if it is one hundred thousand people? Two hundred thousand people?” Liang Wei asked.</p><br/><p>Fei Lei stopped breathing. He had never seen one hundred or two hundred thousand people before. He could not imagine it. A ten-thousand strong battalion already covered the sky. One hundred thousand, two hundred thousand, how terrifying would the scene be!</p><br/><p>Just thinking about it made his scalp prickle.</p><br/><p>“Is Northern Plains Ice Mansion so strong?” Fei Lei asked uncertainty.</p><br/><p>Liang Wei’s expression was serious. “That will be their last chance. If they do not do this, they will not even have a last chance. They have been forced to the precipice.”</p><br/><p>Liang Wei’s words were correct. Northern Plains Ice Mansion had been forced to the edge of the cliff. Before this, the reason the opposing faction had grown was because people doubted and distrusted the abilities of the new king. The new king was weak, he was not enough to become king. The rumors had been numerous. While people had been secretly fanning the flames from the shadows, it was still the truth that the new king did not have a strong reputation.</p><br/><p>However, the sudden advance of seven days and nights had surpassed people’s imagination and completely destroyed the rumors that the new king was weak.</p><br/><p>The new king was weak?</p><br/><p>No one would think that ever again.</p><br/><p>The charge had been furious and powerful, shaking all of Nether Realm! This charge which could be called a miracle could rival the old nether king’s battle to unite the Nether Realm.</p><br/><p>The opposing camp quickly collapsed. No matter what, the new king was the appointed successor by the old nether king. His legitimacy was undoubted. As long as the new king showed the power of a king, the great majority of factions would choose to support him.</p><br/><p>In this, Northern Plains Ice Mansion was at a absolute disadvantage.</p><br/><p>Zuo Mo used this method to prove his strength and defend his status as the Nether King. If Hai Xin Bing did not quickly change this, her situation would grow increasingly worse.</p><br/><p>Northern Plains Ice Mansion would become the rebels that tried to challenge the right of the king. This would cause their supporters to quickly abandon them.</p><br/><p>The old Nether King had ruled Nether Realm for ten whole years. His influence was enormous. If it wasn’t for the fact that the new king was unfamiliar and no one had heard of him, if the successor had been An Mo, the opposing voices would not have been so strong.</p><br/><p>Only by defeating the new king would Northern Plains Ice Mansion reverse the situation.</p><br/><p>“Should we notify the king?” Worry appeared on Fei Lei’s face.</p><br/><p>Liang Wei shook his head. “No need, this is most likely King’s true intentions.”</p><br/><p>Fei Lei was astounded. “Wouldn’t this be too much of a risk?”</p><br/><p>“King wants to end this in one battle,” Liang Wei said gravely.</p><br/><p>“It’s too risky!” Fei Lei continued to shake his head. “I feel that even if the enemy only has fifty thousand, and the battalions are not too low in quality, we will be in great trouble.”</p><br/><p>Liang Wei did not argue. Fei Lei’s speculation was accurate. The two had worked as partners for many years and knew each other well. Fei Lei’s talent as a battle general was not outstanding, but he was experienced. He would not have spectacular displays, but he would not make any low-level mistakes. He would not make a mistake in a judgement like this.</p><br/><p>Based on the power that King showed in these past days, if the enemy had fifty thousand, they would have a chance to delay them.</p><br/><p>If the enemy had a well-trained battalion of a hundred thousand, it was likely that they would sink into a bog. If the enemy battalion reached one hundred and fifty thousand, they would be at a disadvantage. If the enemy battalion was two hundred thousand, their chances of victory were close to zero.</p><br/><p>The question now was, could Hai Xin Bing gather so many?</p><br/><p>The battle for the throne of Nether Realm attracted everyone in Nether Realm. This was directly related to their benefits. Under the rule of the old Nether King, they had enjoyed ten years of peace and Nether realm had risen to become one of the strongest powers in the world.</p><br/><p>They treasured the lives they had now.</p><br/><p>Due to this, when the old Nether King appointed an unknown person as the successor, this was opposed by almost everyone.</p><br/><p>Yet a few short days passed, and without realizing it, the tide had turned.</p><br/><p>Seven days and nights, without a moment of rest, a lightning fast advance.</p><br/><p>Under the hoofs of the new king, countless battalions wailed, struggled and were stomped into the dust!</p><br/><p>The new king’s unparalleled individual power and courageous style immediately increased the number of his supported. Even the old nether king had not been so powerful in the past.</p><br/><p>A new legend was being formed right in front of them.!</p><br/><p>This lightning fast advance that would enter the history books had never occurred in the history of mo before.</p><br/><p>The new king was so powerful!</p><br/><p>The Nether Realm mo innately respected the strong. Countless people were in awe of the new king. The mo were so simple. If you were strong enough, they would fear you and submit to you!</p><br/><p>All of Nether Realm was discussing the legendary lightning advance.</p><br/><p>The opposing voices seemed to have disappeared in the span of a night. However, those that were more perceptively warily maintained neutrality.</p><br/><p>They knew that Hai Xin Bing had been forced to a precipice, a true precipice!</p><br/><p>Everyone shuddered at the terrifying power of the new king. Even inside Northern Plains Ice Mansion, many people were filled with terror. A hopelessness started to spread.</p><br/><p>Hai Xin Bing only had one last chance.</p><br/><p>If she could not stop the new king, after the new king ascended, the first thing he would target would be Northern Plains Ice Mansion. At that time, the authority of the new king would have stabilized, Nether Realm would have submitted, and Hai Xin Bing would die.</p><br/><p>She needed to prove she was stronger than the new king before the new king reached Nether King Palace!</p><br/><p>The atmosphere in Northern Plains Ice Mansion was extremely low and tense. In a blink, the situation had reversed. They had originally thought that victory was in their grasp, and suddenly, they were at the end of their road.</p><br/><p>No one had thought that the new king had resolved the situation in such a way!</p><br/><p>Simple! Brutal! Without any finesse!</p><br/><p>A few days ago, they had laughed at the new king for being stupid and not knowing his limits, that he was bashing his head against rocks. When the third day came, no one was able to laugh.</p><br/><p>They knew just how many battalions they had sent on this path.</p><br/><p>On the seventh day, each of them only felt terror, unparalleled terror!</p><br/><p>How could someone be so strong!</p><br/><p>How could they!</p><br/><p>The mirages of the battles at the front lines were passed back to Northern Plains Ice Mansion. In the images, that inhuman existence caused each person’s soul to tremble!</p><br/><p>No one was a match for one of his attacks!</p><br/><p>With the power of a single person, he killed an entire battalion!</p><br/><p>A battalion of tens of thousands was fragile like paper in front of him. He easily passed through them and defeated them in one blow!</p><br/><p>Even Hai Xin Bing was silent when she saw this scene. No one knew her hands that were hidden in her sleeves were imperceptibly trembling.</p><br/><p>The shock she felt was even stronger. An Mo who was on the same level as her appeared dim next to the new king. However, she still noticed that An Mo’s attacks were still so sharp and powerful, even more powerful than she had imagined!</p><br/><p>Only today did she know that An Mo had hidden his strength.</p><br/><p>But no one would look at An Mo. No one would feel An Mo was powerful. Everyone’s gaze would only be attracted by one figure.</p><br/><p>That new king who was like demon ascending to the mortal world!</p><br/><p>Hai Xin Bing had seen the strength of the old Nether King before. In her eyes, the old Nether King was unfathomable. You never knew if the power he showed was his limit.</p><br/><p>What the new king displayed was a completely different kind of presence.</p><br/><p>An unprecedented dominance!</p><br/><p>He moved like a colossus, flattening everything in his path. In front of him, you would unconsciously feel as small as an ant, and could not muster any fighting spirit.</p><br/><p>“We have mobilized all battalions,” Zhu Nan Yue said calmly.</p><br/><p>Hai Xin Bing recovered a thread of calmness. She looked with admiration at her trusted general. Of everyone, Zhu Nan Yue was the calmest.</p><br/><p>“How many people?” Her tone was calm.</p><br/><p>“Two hundred and fifty thousand!” Zhu Nan Yue’s eyes burned.</p><br/><p>She was also shocked at the new king’s power, but when she thought of fighting against such a powerful opponent, she didn’t feel any fear, and her blood heated at the idea!</p><br/><p>“Where will the location of the final battle be?” Hai Xin Bing’s terror was pushed away. She was not a normal person, and her tone became determined.</p><br/><p>“Nether King River!” Zhu Nan Yue said three words.</p><br/><p>Viciousness flashed through Hai Xin Bing’s eyes. She suddenly stood and said with steel, “Nether King River! Good! Then let this battle choose the true Nether King!”</p><br/><p>Everyone stood in unison, the hesitation and fear in their eyes completely disappearing. What replaced those emotions was the belief to die!</p><br/><p>Final battle!</p><br/><p>Translator Ramblings: I just imagine Zuo Mo as a moving pile of jingshi smashing everything along the way.</p><br/>\n</div>"}