{"title": "Chapter Eight Hundred and Ninety Two – Planning and Movement", "id": 892, "volume": 9, "url": "http://boxnovel.org/world-of-cultivation-chapter-eight-hundred-and-ninety-two-%E2%80%93-planning-and-movement", "volume_title": "Volume 9", "body": "<h1>Chapter Eight Hundred and Ninety Two – Planning and Movement</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Eight Hundred and Ninety Two – Planning and Movement</p><br/><p>Compared to the past, Kun Lun was more prosperous and populated.</p><br/><p>In these years, Kun Lun had grown much stronger and was the strongest in the world. The battle generals, led by Xue Dong they fought on all fronts, and expanded Kun Lun’s territories greatly.</p><br/><p>But Xue Dong was not in a good mood. The shidi were all discussing the battle of Nether King River.</p><br/><p>The entire world was astonished by the battle of Nether King River. It was the first time people saw how strong god-level was. Even a top battle general like Xue Dong couldn’t help but feel hopeless when he saw that kind of power. He thought of many methods, but right now, nothing could rival a god-level.</p><br/><p>God-level could destroy a jie and easily move away.</p><br/><p>Xue Dong could not solve this problem.</p><br/><p>He had calculated. If the development of shen power increased by the day, and the average level of battalion members increased by two power ranks, or they had more than five that were pseudo god-level experts, they might be able to match a god-level. [1]</p><br/><p>But these two were both implausible. His battalion already had the most accomplished disciples of Kun Lun. They presented the strongest of the disciples. Increasing their cultivation by two levels would take a decade. And five pseudo god-levels were even more implausible. Right now, Kun Lun, after a more than a decade of cultivation, only possessed two pseudo god-levels.</p><br/><p>When Lin Qian had fled from the Central Plains and returned to Kun Lun, he had spoken to Xue Dong about the strength of god-level. Xue Dong had not completely believed him back then. How could the power of one person reach such a terrifying level?</p><br/><p>Yet after he saw the entire battle of Nether King River, Xue Dong couldn’t rest for a few nights.</p><br/><p>He could not think of any method that would match the new Nether King.</p><br/><p>They had thought that Nether Realm would fall into chaos for a while, but after seeing the mirage, Xue Dong knew that Nether Realm would not descend into chaos.</p><br/><p>In these past years, he had always thought of Mo Cloud Sea as the enemy. Mo Cloud Sea had expanded rapidly in the past decade. While Xue Dong was wary, he was not scared. Kun Lun’s overall power was far greater than Mo Cloud Sea.</p><br/><p>The fact that Zuo Mo had disappeared for ten years was fatal for Mo Cloud Sea. From the intelligence the spies passed along, Mo Cloud Sea’s internal politics were becoming more unstable. The conflict between the old and the new factions was increasing by the day.</p><br/><p>Lil’ Miss Gongsun was a strong battle general, but he was not an outstanding ruler. As time moved along, Mo Cloud Sea would gradually split. That would be the time when Kun Lun would consume them.</p><br/><p>In Xue Dong’s view, Mo Cloud Sea was a fruit that was maturing by the day. When the time came, it would be easily plucked.</p><br/><p>Suddenly, a Nether King came out of nowhere and was so strong. Xue Dong felt strong danger. With the new Nether King’s power, he definitely would not be willing to just stay in Nether Realm.</p><br/><p>As his mind moved, Xue Dong’s expression immediately became ugly.</p><br/><p>Hundred Savage Realm!</p><br/><p>If the new Nether King moved, the first would definitely be Hundred Savage Realm! Xue Dong was a top battle general and knew the intelligence on all the factions. He almost immediately judged that the Hundred Savage Realm that was in chaos would not be able to stop the Nether King’s advance.</p><br/><p>The Nether King had a high chance of becoming the first king to unite the mo in ten thousand years.</p><br/><p>Xue Dong understood the mo well. If that event really occurred, all of the mo would become unprecedentedly powerful. The mo did not like internal conflict. If the old Nether King had not aged, Hai Xin Bing would never rebelled. The mo were the most disciplined of the three races. Their enthusiasm and reverence of the King came from the cultural traditions stretching back to the ancient era.</p><br/><p>Damn it!</p><br/><p>The Nether King that united the mo would become the greatest obstacle to Kun Lun uniting the world.</p><br/><p>At this time, an astounding sword essence suddenly erupted from the back mountain.</p><br/><p>Xue Dong stilled and his mind rang.</p><br/><p>Eldest Shixiong!</p><br/><p>He charged out of the room, and saw the figure releasing stunning sword essence in the sky.</p><br/><p>Two words jumped into Xue Dong’s mind</p><br/><p>–God-level!</p><br/><p>Lin Qian was out of seclusion!</p><br/><p>He has god-level!</p><br/><p>The information spread through the xiuzhe realm under Kun Lun’s deliberate machination. All of the factions were alarmed. Kun Lun was powerful to begin with. Everyone had just seen the power of god-level, and now Lin Qian came out of seclusion.</p><br/><p>Kun Lun’s news immediately overtook the Nether realm.</p><br/><p>Unlike Nether Realm, Kun Lun had been the strongest sect in the world in the last thousands of years. Right now, they did not show any signs of decline, but grew even stronger.</p><br/><p>Now that Lin Qian came out as a god-level expert, it pushed Kun Lun to an unprecedented level.</p><br/><p>Kun Lun once again became the faction most likely to unite the world in people’s eyes.</p><br/><p>What was most shocking was Mi Nan announcing that all of South Tian Huan was siding with Kun Lun. After Tian Huan had split into North and South Tian Huan, they had continued to decline. However, South Tian Huan that was ruled by Mi Nan still possessed almost half of the original Tian Huan’s territories.</p><br/><p>As Mi Nan joined Kun Lun’s side, Kun Lun’s power increased to a stunning level.</p><br/><p>Kun Lun held over two realms.</p><br/><p>And Mo Cloud Sea was shy of one realm. Li Xian’er’s North Tian Huan had half a realm. The other factions such as Gu Liang Dao, and the four Minor Dhyana Sects shared half of a realm.</p><br/><p>Even if the Nether King took over Hundred Savage Realm, they would just match Kun Lun.</p><br/><p>They had the strongest god-level, they had three top battle generals, Xue Dong, Mu Xuan, and Mi Nan, they had a territory of two realms</p><br/><p>Kun Lun’s top position had taken form.</p><br/><p>Yang Yuan Hao was not in a good mood.</p><br/><p>Lin Qian become god-level and Mi Nan siding with Kun Lun immediately caused the situation to become terrible. Kun Lun was truly too powerful, so powerful it was hopeless.</p><br/><p>Gu Liang Dao’s spirits could not compare to before his losses to Xue Dong. While he had worked hard, there was not much improvement. Li Xian Er and the others had fought constantly with Mi Nan these years. They most likely had used up most of their wealth.</p><br/><p>Mi Nan was most likely in the same situation so when he heard that Lin Qian had advanced to god-level, he did not hesitate in siding with Kun Lun.</p><br/><p>Even Yang Yuan Hao had to admit that Mi Nan was a clever character. He had good judgement, and more importantly, he could put his face aside.</p><br/><p>Yang Yuan Hao grimed inside. He couldn’t do it. The Nine Great Dhyana Sects had split, with five siding with Kun Lun. And the four Minor Dhyana Sects had not.</p><br/><p>Yang Yuan Hao knew that both he, Gu Liang Dao, and Li Xian Er didn’t have the ability to fight Kun Lun.</p><br/><p>The only one that could match Kun Lun for a while was Mo Cloud Sea.</p><br/><p>The pity was that there still wasn’t any news of Zuo Mo. Mo Cloud Sea had serious problems internally. Lin Qian had also reached god-level. Yang Yuan Hao also concluded in this era that a god-level expert was unstoppable.</p><br/><p>This really was a problem!</p><br/><p>Yang Yuan Hao rubbed his head with a headache. He could not put his face aside to side with Lin Qian. For some reason, he did not like Kun Lun’s conduct.</p><br/><p>If only Zuo Mo was still here. He sighed inside. He suddenly missed that rascally and greedy character.</p><br/><p>Suddenly, a paper crane appeared in his room.</p><br/><p>Yang Yuan Hao’s eyes landed on the paper crane and he stilled. This paper crane seemed familiar.</p><br/><p>Was this someone he knew? He thought as he reached out. The paper crane flew into his hand. He unfolded the paper crane. A ray of light flew out of the paper crane. Inside the light, a figure appeared.</p><br/><p>Yang Yuan Hao seemed to be struck by lightning. His eyes were wide as he looked in disbelief at the face in the ball of light.</p><br/><p>Zuo Mo!</p><br/><p>This person was still alive!</p><br/><p>While Zuo Mo’s hair had turned completely white, he still recognized at a glance that this person was Zuo Mo.</p><br/><p>“Brother Yuan Hao, long time no see!’</p><br/><p>Yang Yuan Hao was completely stunned.</p><br/><p>Gu Liang Dao was in a daze. There were streaks of white in his hair. He had been defeated soundly by Xue Dong in the fight for Xi Xuan.</p><br/><p>His hopes of taking over Xi Xuan also had failed.</p><br/><p>After the war, he had given up a larger portion of the territory than he planed. One was to thank Gongsun Cha for coming to his aid, the other was because he knew he did not have the strength to manage so many jie.</p><br/><p>That defeat at Xi Xuan was a far greater blow to him that one could imagine. He had almost completely given up due to that defeat.</p><br/><p>When he heard the news that Lin Qian had reached god-level and Mi Nan had sided with Kun Lun came, his mood quickly became terrible.</p><br/><p>The situation was worsening.</p><br/><p>Kun Lun was now so strong it seemed hopeless. In front of god-level experts, the so called forts and defense lines were a joke. And in terms of top level battle generals, Kun Lun had an astounding team.</p><br/><p>The other factions had more battle generals in terms of numbers, but they fought for themselves. They lacked a person who could unite them.</p><br/><p>It would be good if Brother Zuo Mo was still alive.</p><br/><p>Pity, the heavens envied those with talent.</p><br/><p>Gu Liang Dao took a deep breath. He knew that their situation would become worse and worse until even taking a step back would be difficult.</p><br/><p>In his view, the final battle for the world would most likely between Lin Qian and the Nether King. Now, it was to see if it was Lin Qian who first united the Four Realms, or the Nether King to first unite the yaomo. In Gu Liang Dao’s eyes, Kun Lun had the advantage.</p><br/><p>Without Brother Zuo Mo, Mo Cloud Sea would have a difficult time stopping Kun Lun in their tracks.</p><br/><p>Suddenly, he raised his head. A paper crane appeared nearby.</p><br/><p>Gu Liang Dao froze where he was as though he had been struck by lightning.</p><br/><p>This paper crane … … was from Brother Zuo Mo!</p><br/><p>Brother Zuo Mo was still alive!</p><br/><p>Gu Liang Dao was filled with joy. In this moment, all of the clouds over his mind were swept away. Even the fight against the colossal Kun Lun did not seem so hopeless.</p><br/><p>His hands trembled as he impatiently unfolded the paper crane.</p><br/><p>That familiar face appeared in front of him.</p><br/><p>“Shidi, don’t worry,” Wei Sheng’s expression was solemn. “With us present, we will not allow Kun Lun to take one step into Mo Cloud Sea.”</p><br/><p>Luo Li, Wo Li, Zong Ru, and Ceng Lian’er nodded. They would go back to Mo Cloud Sea as fast as they could. Only A Gui was staying with Zuo Mo.</p><br/><p>Lin Qian coming out of seclusion and Mi Nan taking sides immediately caused Mo Cloud Sea to be in a dangerous situation.</p><br/><p>Once Kun Lun finished organizing, they would gather their forces and head for Mo Cloud Sea.</p><br/><p>“I will act with speed on on my side,’ Zuo Mo said with seriousness.</p><br/><p>His preparations had finished, and an enormous net was created.</p><br/><p>Zuo Mo new that starting today, they were entering the true final battle.</p><br/><p>It was time to make their move.</p><br/><p>Translator Ramblings: For today, my ramblings come before WanderingGummiOfDoom as he has some speculations about the ending. I didn’t give him the next few chapters until yesterday so he had a lot of time to think …. …</p><br/><p>[1] Editor’s Note:</p><br/><p>You really have to wonder how all these 10 year old chess pieces are going to move.</p><br/><p>(1) Mo = 4 factions; the largest is the Nether Realm. We know Zuo Mo will conquer them… but how long will that take? Will it be fast enough for their allies to survive?</p><br/><p>(2) Yao = 2-3 factions; the largest is Ming Yi Yue’s faction, with a mole of Youqin Lin. How much control does Youqin Lin have and how much will it matter? Zuo Mo only has a grudge with Kun Lun as far as I can remember.</p><br/><p>(3) Xiuzhe = 6 factions, biggest being Kun Lun with 2 realms but Mo Cloud Sea has a secret alliance with Gu Liang Dao and Yang Yuan Hao, according to this chapter puts them at 1 realm. They have a mole in the 5 dyhana sects that sided with Kun Lun (Zong Ru’s disciple), even then converting 1 sect doesn’t really matter on this scale.</p><br/><p>(4) Now that South Tian Huan has sided with Kun Lun, North Tian Huan is guaranteed to be defeated without support. South Tian Huan with Kun Lun support is going to steam roll an exhausted North Tian Huan. The question is would North Tian Huan be willing to submit to Kun Lun or will their 10 year grudge mean that they would rather Mo Cloud Sea? Their crafting skills are valuable to Kun Lun. So joining Kun Lun is more likely, since they could guarantee their survival.</p><br/><p>This all assumes the only reason North Tian Huan would join the losing side is because Zuo is publically revealed as the Nether King… otherwise there would be no reason for anyone to have faith in Mo Cloud Sea’s prospects. Wei Sheng and co’s reappearance and survival would reveal Zuo Mo’s survival, but they still wouldn’t have revealed any way to fight against Lin Qian. Meaning siding with Mo Cloud Sea is prolonging the inevitable, they need a god level expert to deter/counter Lin Qian. Even then, I don’t think Zuo Mo can win, FX has hinted at this pretty heavily already.</p><br/><p>Conclusion/Guess: Hundred Savage Realm is weakened from a decade of war, but knows the Nether King is targeting them… Zuo Mo will act quickly and beat the Mo Marshal Alliance. Bei Han killed the Mo Marshal Alliances two top generals way back… so they won’t have anyone that can stand up to Liang Wei -who is a general comparable to Gongsun Cha as pointed out by a random tidbit. But this will give the Mo Gods and Heroes’ Alliance time to ally in resistance. Liang Wei will face off with the Mo God battle general which leads to a battle of attrition. One of the Mo Gods was randomly mentioned to be a top tier general a few chapters ago, so that will counter Liang Wei and if there is one in the Heroes’ Alliance then that will prevent any quick victory even with their overwhelming numbers. Meaning Zuo Mo will only manage to connect his territories before running out of time-which again was another random tidbit dropped in this chapter.</p><br/><p>Mo Cloud Sea alliance will be formed in response to Kun Lun’s new powers. Lin Qian will begin killing Mo Cloud Sea’s allies while Wei Sheng and co try and surprise and trap him, this leads to an uprising in Mo Cloud Sea. Up rising forces Zuo Mo to reveal his identity as the Nether King. This prompts North Tian Huan to join Mo Cloud Sea-because paper cranes are preferable to traitors. So Mo Cloud Sea + Mo Realms + allies holdings = 3 to 3.5ish realms after allies losses and Kun Lun with 2.5 to 3ish realms.</p><br/><p>Since Zuo Mo is revealed and is required to deter Lin Qian he returns to Mo Cloud Sea territory, he will need his battle generals to fight the Mo. The additional forces will beat the Mo Gods bringing Mo Cloud Sea up to 4 ish realms, and form a balance between 3 powers. Mo Cloud Sea is the strongest, but can’t all out attack Kun Lun because the Yao would step in and reap the benefits with the newly conquered and unconsolidated mo territories. Then Youqin Lin pulls some crazy plot armor betrayal and brings enough of the Yao to Mo Cloud Sea to start a yao civil war. Allowing Zuo Mo’s side to attack Kun Lun.</p><br/><p>Situation looks bleak for Kun Lun, the world is united against them. Bunch of shouts of Kun Lun for days as the enemy slowly marches on Kun Lun Sword Sect.</p><br/><p>Final push leads to Zuo Mo and Lin Qian facing off. Blah blah blah Wu Kong Sword Sect. Zuo Mo loses… our fav MC, Wei Sheng, pulls a SSJ and plot armors god level saving the day.</p><br/><p>Or I could be entirely wrong… with fun theories at 3am.</p><br/>\n</div>"}