{"title": "Chapter Eight Hundred and Ninety Nine – Horn! God-level!", "id": 899, "volume": 9, "url": "http://boxnovel.org/world-of-cultivation-chapter-eight-hundred-and-ninety-nine-%E2%80%93-horn-god-level", "volume_title": "Volume 9", "body": "<h1>Chapter Eight Hundred and Ninety Nine – Horn! God-level!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Eight Hundred and Ninety Nine – Horn! God-level!</p><br/><p>His fingers held the King’s Horn.</p><br/><p>Shen power was channeled in, the densely pack bloody shen glyphs on the King’s Horn lit up rapidly. A vast and authoritative presence spread outwards with Zuo Mo at the center.</p><br/><p>The ten gold battle generals at the front jumped. Their expressions almost froze on their faces, this was … …</p><br/><p>The King’s Horn moved towards his face, and sounded with an exhale.</p><br/><p>Woooo!</p><br/><p>The ancient horn sounded on the battlefield. The flashes of lights and the ear-deafening explosions could not suppress this long horn that rose out of the dust of time.</p><br/><p>Everyone on the battlefield stopped. They seemed to hear something in their body explode. A profound and cryptic glyph lit up in their blood. The power that was hiding in their bloodlines seemed to be awoken by the horn.</p><br/><p>Submit!</p><br/><p>Instinctive submission!</p><br/><p>The invisible presence covered everyone on the battlefield. All the mo on the battlefield instinctively submitted. Their bodies were out of their control. Their spirits were stunned.</p><br/><p>The same horn, but the effects on the two sides were different.</p><br/><p>This strange power that rose from their bloodline would intimidate the spirits and restrain them if they had the thought to resist. It was unspeakably uncomfortable.</p><br/><p>Yet those subordinates under Zuo Mo’s command felt as though a fire had been lit in their bodies. They were filled with endless power, they did not fear any battle!</p><br/><p>All Hail The King!</p><br/><p>It was the first time Zuo Mo blew the King’s Horn without restraint. Just now, he finally understood what was inside this legendary article of the King. Crafted inside the King’s Horn was the First Mo King’s comprehension about the mo’s bloodline power.</p><br/><p>The King’s Horn stimulated the deepest and most basic power of the mo bloodlines.</p><br/><p>It was a terrifying power!</p><br/><p>Zuo Mo felt a wave of respect. There mo bloodline power had no secrets in the eyes of that First Mo King!</p><br/><p>Zuo Mo quickly refocused. He noticed the flames that lit up in the eyes of his commanders!</p><br/><p>“Kill!”</p><br/><p>The icy order sounded in every corner of the battlefield.</p><br/><p>Zuo Mo appeared at the front of the battle formation.</p><br/><p>The defense line at Sky Wood Jie wavered under the strong attacks. The battalions of fifty thousand attacked furiously without regard for shen power. Almost all the seal formations and jinzhi collapse in a short amount of time.</p><br/><p>Gongzi Xi hadn’t thought that they would encounter such a fierce attack.</p><br/><p>The army of fifty thousand people seemed to cover the sky. These attacks filled with the energy of death were grey, black, white and green as they rained down.</p><br/><p>It was the first time that Gongzi Xi encountered such a ferocious attack that he even had a short moment of dazedness.</p><br/><p>When he recovered, he immediately noticed the subordinates surrounding him were unconsciously resisting. Gongzi Xi immediately recognized the problem. The pace of battle was being dictated by the enemy. His side was fighting back out of instinct and lacked organization. Reactively responding like this was meaningless.</p><br/><p>Gongzi Xi was about to shout to stop them when a low horn suddenly sounded over the battlefield.</p><br/><p>Gongzi Xi seemed to be struck by lightning. The energies in his bodies roiled and he was astounded. His expression changed dramatically, this was … …</p><br/><p>He was a top battle general. Having transformed from a noble young master into a top battle general, his heart was not as fragile as it had once been. He immediately turned to look at his subordinates, and his heart sank.</p><br/><p>Everywhere he saw, his commanders were dazed, all soulless.</p><br/><p>A legend suddenly appeared in his mind.</p><br/><p>King’s Horn!</p><br/><p>That was the King’s Horn!</p><br/><p>He suddenly turned and looked towards the enemy battalions.</p><br/><p>At this time, he saw the enemy battle formation split open from the middle. The battle formation that had been fighting against them parted to the sides and a battalion showed themselves through the split. At the very front of the battalion was a mo wearing a copper mask that looked coldy at him.</p><br/><p>“Kill!”</p><br/><p>Instantly, Gongzi Xi’s heart almost stopped beating.</p><br/><p>But after a short daze, he recovered. And then Gongzi Xi paled.</p><br/><p>So fast!</p><br/><p>The enemy had almost reached them.</p><br/><p>“Defend! Defend!” Gongzi Xi shouted. His handsome face did not have any of his nobility and dignity. He only hoped now that his shout would get his side to focus.</p><br/><p>What reassured Gongzi Xi slightly was that this battalion he had spent so much effort to build had not completely collapsed under the pressure. They gathered their remaining morale and started to muster a defense.</p><br/><p>The enemies in his field of view released light. The violent shen power vibrations caused Gongzi Xi to feel as though it was a shen power wave heading towards him.</p><br/><p>The ten gold battle generals flashed with light that was as thick as fire.</p><br/><p>But what was the most blinding was Zuo Mo at the front.</p><br/><p>Surging shen power that filled the space around him. The shen power that contained terrifying power slowly flowed around him. The space around him twisted. People could not see his figure clearly, only the surging shen power and a figure like that of a mo god!</p><br/><p>A dot of light flew out of that figure.</p><br/><p>Gongzi Xi’s pupils suddenly widened, not good!</p><br/><p>Yet that dot of white light immediately flew in front of him. At this time, the dot of light had turned into a patch of blinding white light.</p><br/><p>As though the sun was thrown at him!</p><br/><p>They did not have the time to struggle before they were swallowed by the blinding white light that had expanded rapidly.</p><br/><p>The most crucial three hundred li of the entire Sky Wood Jie defense line was consumed by the burning white light. The burning white light silently consumed everything.</p><br/><p>Only a breath after the expansion of light did a tsunami of sound swept outwards!</p><br/><p>The terrifying flows of energy made even the Nether Realm Battalions feel as though they were in a storm.</p><br/><p>Everyone was stunned dumb by this attack, even if this attack had been released from their side.</p><br/><p>Before this, no one could draw on the shen power of fifty thousand elite!</p><br/><p>So no one knew what it would be like when the shen power of fifty thousand were gathered together into one attack.</p><br/><p>Now, they knew.</p><br/><p>Ten breaths later, the light finally faded.</p><br/><p>What appeared in front of them was an enormous chasm that was three hundred li in wide, an enormous crack that stretched beyond the horizon.</p><br/><p>The deep chasm was thirty zhang wide and the surrounding walls were as smooth as glass. There was nothing in the deep hole. The crack was over ten li long and seemed bottomless. The shape cut into the ground in a perfectly rounded edge.</p><br/><p>If they could see into the ground, they would find that the structure of this jie had been completely changed.</p><br/><p>No one could muster up the bravery to stand against such an attack.</p><br/><p>The strongest battle general and the strongest battalion of the Mo Marshals Alliance had turned to dust. The remaining Mo Marshals Alliance forces lost the bravery to fight.</p><br/><p>Even Zuo Mo hadn’t expected that the shen power of fifty thousand was so terrifying when gathered together. When the amount of shen power reached a certain level, it would cause a tangible change. The shen power of fifty thousand gathered together was not the same as twenty thousand or thirty thousand.</p><br/><p>Even he had almost lost control.</p><br/><p>That attack had been risky. He wouldn’t dare to do it again.</p><br/><p>However, what comforted Zuo Mo was that this attack had laid the foundation for the victory over Hundred Savage Realm!</p><br/><p>No one will be able to stop the steps of their advance!</p><br/><p>Victory was unstoppable!</p><br/><p>Xue Dong’s battalions stealthily appeared at the borders of the four Minor Dhyana Sects.</p><br/><p>Soon, the traces of Xue Dong Battalion were found.</p><br/><p>Xue Dong did not fear this. He quickly defeated a few battalions of the four Minor Dhyana Sects. Yet he quickly realized something was not right. Yang Yuan Hao was not at the four Minor Dhyana Sects!</p><br/><p>Xue Dong was startled.</p><br/><p>Yang Yuan Hao was not at the four Minor Dhyana Sects, then where was he?</p><br/><p>Xue Dong had not lingered. He had travelled day and night to the four Minor Dhyana Sects. Xue Dong had wanted to ambush Yang Yuan Hao. One on one, Xue Dong had enough confidence to win.</p><br/><p>Mo Cloud Sea had the advantage in the number of generals, and this was not good for Kun Lun. Even though Kun Lun had developed some good young battle generals in the past few years, but there was still a big difference between these young people and the present top battle generals.</p><br/><p>Gongye Xiao Rong and Mu Shuang’s battalions would only recover after recuperating for a while. In other words, Mo Cloud Sea’s active troops, other than Gongsun Cha and Bie Han, were Yang Yuan Hao and Gu Liang Dao.</p><br/><p>The plan was first defeat Yang Yuan Hao and Gu Liang Dao to create good conditions for the final battle with Mo Cloud Sea.</p><br/><p>Xue Dong had headed for Yang Yuan Hao, while Lin Qian had gone alone to deal with Gu Liang Dao.</p><br/><p>If Wei Sheng and the others had not returned, Lin Qian’s target would have been Gongsun Chao. However, Wei Sheng and the others did return. Lin Qian was still extremely wary of Wei Sheng.</p><br/><p>Kun Lun had the advantage of strength and there was no need to take such a risk. Gu Liang Dao only had a Shuang Yu with him, and he was only pseudo god-level. Alone he was not a threat to Lin Qian.</p><br/><p>First grind away the claws and teeth, then fight. That was Kun Lun’s strategy.</p><br/><p>However, when Xue Dong found that Yang Yuan Hao was not at the four Minor Dhyana Sects, his expression changed. This meant that Yang Yuan Hao had left the four Minor Dhyana Sects early. Even the higher ups of the four Minor Dhyana Sects were not present. The signs all indicated that when Kun Lun had attacked North Tian Huan, Mo Cloud Sea had started their actions against Kun Lun.</p><br/><p>Xue Dong was not an ordinary person. Almost instantly, he guessed Yang Yuan Hao’s goal.</p><br/><p>Kun Lun!</p><br/><p>However, after guessing the other’s intentions, Xue Dong was not too nervous.</p><br/><p>If Yang Yuan Hao thought that Kun Lun’s rear was empty, that would be a great mistake.</p><br/><p>The higher ups of the four Minor Dhyana Sects were not here. There was no meaning in sweeping away the four Minor Dhyana Sects. At this time, time was most precious!</p><br/><p>Xue Dong did not hesitate and left the four Minor Dhyana Sects. Before leaving, he ordered the five Great Dhyana Sects that had sided with Kun Lun to attack the four Minor Dhyana Sects.</p><br/><p>Cannon fodder should be dealt with by cannon fodder. A place of this significance was not worthy of his battalion’s effortstime.</p><br/><p>At this time, he received a message from Mu Xuan.</p><br/><p>Mu Xuan Battalion encountered Bie Han’s Sin Battalion!</p><br/><p>Xue Dong’s eyes lit up. He was not far from Mu Xuan Battalion. As long as Mu Xuan Battalion delayed Bie Han for a few days, he would arrive. At that time, he could complete a pincer strategy with Mu Xuan Battalion against Bie Han. Even if Bie Han had wings, he would not be able to fly away.</p><br/><p>He hadn’t thought of this. Yang Yuan Hao had left, and Bie Han came.</p><br/><p>Xue Dong immediately realized that this was a perfect opportunity to eliminate Bie Han’s Sin Battalion!</p><br/><p>Translator Ramblings: There goes the nuclear bomb.</p><br/>\n</div>"}