{"title": "Chapter Eight Hundred and Ninety Seven – Liang Wei’s Plan", "id": 897, "volume": 9, "url": "http://boxnovel.org/world-of-cultivation-chapter-eight-hundred-and-ninety-seven-%E2%80%93-liang-wei%E2%80%99s-plan", "volume_title": "Volume 9", "body": "<h1>Chapter Eight Hundred and Ninety Seven – Liang Wei’s Plan</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Eight Hundred and Ninety Seven – Liang Wei’s Plan</p><br/><p>Everyone was stunned by Liang Wei’s proposed battle plan.</p><br/><p>Inside the large hall, Liang Wei’s voice echoed.</p><br/><p>“The enemy possesses a weakness that is not a weakness. They do not have a god-level expert. Additionally, the battalions that guard each jie do not belong to the same faction. When pressed, they will not work so well between themselves. The enemy’s carefully created defense line is strong. If we just charge, we will definitely be defeated, and the fatalities will be high.”</p><br/><p>“However, our strongest point is that King is god-level.”</p><br/><p>Liang Wei’s wolf-like gaze swept across the entire hall. At this time, his edges were completely displayed.</p><br/><p>No one opposed him. Liang Wei was right. In front of a god-level, this defense line could not reach perfection. But even so, each of them was shocked by Liang Wei’s daring plan.</p><br/><p>“We will send four hundred thousand to the first engagement and openly attack the five jie defense line. There is only one aim, to put pressure on the entire defense line, enough pressure. That way, they can only fight for themselves, and the cooperation between them will be cut off.”</p><br/><p>Liang Wei continued, his expression calm and confident. He did not show any timidity in front of the hall of strong experts.</p><br/><p>“When the enemy is completely suppressed, King will lead an elite of fifty thousand to attack Sky Wood Jie guarded by the Mo Marshals Alliance. Sky Wood Jie is the final target of our attack. There are two reasons, one is that the Mo Marshals Alliance is the weakest, and is the best opening. The second is that this defence line is the territory of the Mo Marshals Alliance. Once Gongzi Xi is defeated, Mo Shen Temple and the Heroes Alliance will be fighting on foreign land. They will have a much harder time rallying local help.”</p><br/><p>“If we can open a hole, the enemy holding the five jie defense line will be meaningless. They can only retreat. We will move in and successively invade Hundred Savage Realm!”</p><br/><p>Liang Wei slowly spoke his conclusion.</p><br/><p>The hall was completely silent. No one had recovered from the shock.</p><br/><p>In this plan that Liang Wei had designed, the amount of manpower invested into the first attack reached an astounding four hundred thousand. They would sortie eighty percent of their manpower for the first wave of attack. This was something rarely seen in wars, and risking in such a large amount was even rarer.</p><br/><p>It as the first time everyone was waging a campaign of such scale. They were extremely cautious.</p><br/><p>Someone objected, “Wouldn’t it be too dangerous to invest so many forces the first engagement?”</p><br/><p>Liang Wei explained, “The other has the benefit of the defense line, we cannot add to their morale. If we cannot defeat them in the first wave, their confidence will increase, emboldened they will be more likely to fight to the death and their defense will strengthen. Then the five jie defense line will become a meat grinder. We may be pulled in to die.”</p><br/><p>Someone else stood up to object, “The plan is good, but the fatalities will be too high!”</p><br/><p>Liang Wei did not avoid the topic and said honestly, “Yes, the fatalities in this plan will be high, however, our superior numbers is our advantage. We can accept fatalities of this degree. I think it is worthwhile to use a certain amount of fatalities in exchange for time, space, and morale. Also, breaking any defense line will always have high fatalities, let alone one like this.”</p><br/><p>The opposers were silent. No matter who the person was, the fatalities would be high in defeating a defense line.</p><br/><p>Liang Wei suddenly looked at Zuo Mo. He hesitated but still gritted out, “The crux of this plan is King. If King wins, we win!”</p><br/><p>He actually had something he didn’t say. If King lost, they lost. But he didn’t say it.</p><br/><p>Would King lose?</p><br/><p>No one dared to make a sound in the hall.</p><br/><p>An Mo stood out and shook his head. He said, “The fighting has just begun. There is no need for King to personally go to the front lines. We can first test them and then try to find a weakness in the defense line … …”</p><br/><p>Zuo Mo waved his hand and interrupted An Mo. He stood up and looked around. “We’ll use this plan. An Mo, Liang Wei, organize the battalions to attack each jie tonight. The battalions are to follow the plan and be in attack formation.”</p><br/><p>Zuo Mo’s words concluded the entire discussion.</p><br/><p>He had to admit that Liang Wei’s plan was outstanding. There was no aspect that appeared spectacular but it was honest. Even if the enemy knew their plan, they would not have a solution.</p><br/><p>This was the true style of a great general.</p><br/><p>No one knew how important time was to Zuo Mo.</p><br/><p>No wonder Pu Yao had endless praise for Liang Wei. A plan like this did not have many complex parts, but not everyone would have the resolve. Only when one clearly saw the benefits and shortcomings involved would they have such decisiveness and bravery.</p><br/><p>An Mo and Liang Wei responded. An Mo did not agree, but he would still carry out King’s decision seriously.</p><br/><p>Zuo Mo looked at the crowd and said coldly, “This King will be fighting at the front! Battalions, remember, this battle has me, we are invincible! We will advance, not retreat! Anyone that disobeys, kill! Anyone that is fearful and does not advance, kill!”</p><br/><p>The two “kills” caused the temperature in the room to suddenly decrease.</p><br/><p>It was the first time they saw King so cold and decisive. Their hearts shook, they stood and responded, “Yes!”</p><br/><p>Countless blinding light swept across the sky. The lights were like rain and illuminated the night sky as bright as day. The enormous explosions were like strong sound attacks that battered at people’s minds and their eardrums.</p><br/><p>Gongye Xiao Rong bit down on his lips and almost bit through them. The formation in front of him was almost completely covered by Kun Lun’s attacks. He could see the corpses blown into the air by the explosions and pillars of blood shooting into the sky.</p><br/><p>This battalion that he had spent countless efforts, blood, sweat, and tears to create was being killed. That simple and cruel defense line was one that he had rushed to build.</p><br/><p>He had expected that Kun Lun would put everything into the attack but he had still underestimated Kun Lun’s offensive strength. The one that attacked his battalion was Mu Xuan Battalion.</p><br/><p>This female battalion that was famed for her detailed attacks was so dominant when she attacked!</p><br/><p>The battalion at the front was being killed off. With every person’s sacrifice, his heart dripped blood. His hand uncontrollably trembled, but his gaze did not wave at all.</p><br/><p>He was waiting. Waiting for the time to retaliate.</p><br/><p>Mu Xuan Battalion attacking without any restraint would cause them to use a great amount of shen power. Gongye Xiao Rong used half of his battalion and jinzhi to delay the other for the chance to attack.</p><br/><p>He rejoiced that it was Mu Xuan Battalion that attacked him and not Xue Dong Battalion. Just as he expected, Mu Xuan Battalion was strong, but it was clear that they were not skilled in a strong offensive tactics. They did not have good control of how much shen power they used.</p><br/><p>This was his only chance, a chance that he used the lives of half his battalion to trade for.</p><br/><p>The resilient Gongye Xiao Rong did not forget his sensitive perception due to the pain he was enduring.</p><br/><p>The enemy’s attacks still rained down wildly, but Gongye Xiao Rong detected that hint of exhaustion in the storm, the easing of the relentless storm.</p><br/><p>It was now!</p><br/><p>Gongye Xiao Rong did not hesitate and shouted harshly, “Kill!”</p><br/><p>There were less than two thousand people next to him!</p><br/><p>These people had watched with glaring eyes as their brothers were killed, and were mad.</p><br/><p>Tian Huan’s unique attacking battle formation suddenly lit up with blinding light that no one had expected. At the same time, at the ground to the flank of Mu Xuan’s battalion, the same light lit up. Before Mu Xuan had arrived, Gongye Xiao Rong and set up small-distance transportation formations in the surroundings.</p><br/><p>These transportation formations had been concealed with thick layers of earth. Mu Xuan Battalion had not detected them at all.</p><br/><p>Woosh!</p><br/><p>The battalion disappeared in the air and appeared at the flank of Mu Xuan Battalion.</p><br/><p>The presence of the battle formation reached a peak and shot in the air. Hundreds of blinding circles of light flew into the enemy battle formation.</p><br/><p>The sudden attack caused Mu Xuan’s battalion to descend into chaos. Blood sprayed out. These blinding circles of light were filled with countless seal scripts. Once they flew into Mu Xuan Battalion, they spun at high speed as they grew in size. Everywhere they passed, blood flew.</p><br/><p>However, Mu Xuan Battalion was a famed elite battalion. After the initial panic, they quickly recovered and responded.</p><br/><p>A proportion of the xiuzhe quickly cast defensive shen techniques while another group prepared attacking shen techniques.</p><br/><p>Yet, quickly, their expressions changed!</p><br/><p>Their shen power was almost used up!</p><br/><p>Woosh woosh woosh!</p><br/><p>Another wave of hundreds of circles flew into Mu Xuan Battalion!</p><br/><p>Mu Xuan paled. She finally realized what Gongye Xiao Rong had planned. She was filled with regret. She had been careless!</p><br/><p>They had been unstoppable before. Under the attacks of her battalion and Mi Nan’s battalion, Gongye Xiao Rong and Mu Shuang had been repeatedly defeated and left nearly crippled. While North Tian Huan had joined Mo Cloud Sea, far water did not resolve thirst. She had dismissed both Gongye Xiao Rong and Mu Shuang. In her view, taking Tian Huan was just a matter of time.</p><br/><p>Because Lin Qian had asked them to conquer North Tian Huan as fast as possible, she had chosen a strong offensive strategy.</p><br/><p>Mu Xuan Battalion that had almost no shen power left had the advantage of numbers, but the lively thousand or so people held the upper hand.</p><br/><p>Gongye Xiao Rong led his battalion of less than two thousand to furiously attack Mu Xuan Battalion.</p><br/><p>She had misstepped!</p><br/><p>Mu Xian’s expression quickly recovered and she ordered without hesitation, “Fourth Team, engage them. Everyone else, retreat! Use ling beasts!”</p><br/><p>Soon a troop of two thousand flew out of Mu Xuan Battalion and engaged Gongye Xiao Rong.</p><br/><p>The other people called out their ling beasts and retreated.</p><br/><p>Gongye Xiao Rong saw this and did not chase. He continued to herd and kill the two thousand that were coming towards him. An hour later, none of the two thousand were alive. No one had managed to escape.</p><br/><p>Gongye Xiao Rong didn’t feel any joy and only endless bitterness.</p><br/><p>This counterattack could not be counted as a victory since he had traded half of his battalion’s lives. When Mu Xuan came back, they would have no chance at all.</p><br/><p>Fortunately, they had finally managed to push back this attack and won a few days of time.</p><br/><p>He was also going to retreat.</p><br/><p>Behind him, all of North Tian Huan was creating a retreat of astounding scale. The people continued to move in the direction of Mo Cloud Sea. Tian Huan’s defense line was completely destroyed. The difficulty of holding this region was high.</p><br/><p>In the plan that Gongsun Cha and the others had designed, Kun Lun could take North Tian Huan but they would only leave behind scorched earth. All of Tian Huan would be moved into Mo Cloud Sea.</p><br/><p>Mo Cloud Sea’s enormous business network displayed its astounding power at this time.</p><br/><p>Countless transportation ships of astounding volume appeared out of nowhere. Forming enormous fleets. Like ants moving, they transported the people of Tian Huan away.</p><br/><p>And long lines were forming at all the transportation formations. The pieces of jingshi were being used up like water flowing yet Mo Cloud Sea did not care. They continued to transport over batches of jingshi to the transportation formations. It was the first time that people saw jingshi piled up in literal mountains.</p><br/><p>The powerful and rich Mo Cloud Sea entered full war mode. No one could underestimate it.</p><br/><p>North Tian Huan and their people had been in a state of war already. The rule Gongsun Cha had set down was only transport people and not resources. As a result, the effectiveness was astounding.</p><br/><p>The few days that Gongye Xiao Rong won with his sacrifices was extremely valuable.</p><br/><p>At another transportation formation, a strange battalion stepped out. These people were completely expressionless, their pupils grey-white, covered in grand tattoo and showed no signs of life.</p><br/><p>When a male with a cold expression and was completely covered in mo matrices walked out of the transportation formation.</p><br/><p>“It is Bie Han Daren!</p><br/><p>Exclamations rang out among the crowd, The exclamations spread and the crowd started to shift.</p><br/><p>“He’s Bie Han Daren?”</p><br/><p>“Heavens! This is Sin Battalion!”</p><br/><p>After the exclamations passed, joy and smile floated on the faces of these people. Their hearts finally landed. They were safe with Bie Han Daren here!</p><br/><p>The people from Mo Cloud Sea straightened and lifted their heads up high with respectful and reverent expressions.</p><br/><p>He was Bie Han.</p><br/><p>Translator Ramblings: More plot advancement. Getting close now.</p><br/>\n</div>"}