{"title": "Chapter Nine Hundred and Two – The Final Battle of the Strongest and God-Level", "id": 902, "volume": 10, "url": "http://boxnovel.org/world-of-cultivation-chapter-nine-hundred-and-two-%E2%80%93-the-final-battle-of-the-strongest-and-god-level", "volume_title": "Volume 10", "body": "<h1>Chapter Nine Hundred and Two – The Final Battle of the Strongest and God-Level</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Nine Hundred and Two – The Final Battle of the Strongest and God-Level</p><br/><p>Xue Dong Battalion was ordered to a sudden stop.</p><br/><p>There was a battalion waiting silently ahead of them.</p><br/><p>Xue Dong’s pupils suddenly contracted.</p><br/><p>Vermillion Bird Camp!</p><br/><p>After hearing of Bei Han and Sin Battalion’s actions, Xue Dong was not too surprised. It was confirmed the four Minor Dhyana Sects and Mo Cloud Sea had been in cahoots for a long time. His position and been exposed. How could Lil’ Miss, with his abilities, not guess his target?</p><br/><p>A hint of smile suddenly appeared on the corner of Xue Dong’s lips. Fighting spirit burned in his eyes. He had been anticipating this battle for a long time!</p><br/><p>Gongsun Lil’ Miss! Vermillion Bird Camp!</p><br/><p>An undefeated battle general! An undefeated battalion!</p><br/><p>Only a person like this qualified to be his opponent. In Xue Dong’s eyes, Gongsun Cha was the only one that could be his opponent. He never thought of Bie Han or people like Yang Yuan Hao and Gu Liang Dao as his equals.</p><br/><p>There was only one person that could be discussed together with him, Gongsun Cha. The strongest battle general of Mo Cloud Sea, Lil’ Miss that smiled beautifully as he caused the world to feel terror!</p><br/><p>Xue Dong had studied Gongsun Cha before. The more he studied him, the more admiration he felt. Xue Dong thought that he had reached the epitome of what it was to be a battle general. While he had not reached the state that he would be undefeatable, there had never been a battalion that actually made him feel threatened. Even Gu Liang Dao, the Tiger of Xi Xuan, had been crippled by him. If Gongsun Cha had not come with help in time, Gu Liang Dao wouldn’t even had the chance to flee.</p><br/><p>Xue Dong’s opinion of Gongsun Cha was extremely high. Gongsun Cha was like him, they didn’t have clear weaknesses. Just like him, Gongsun Cha was skilled in grabbing people’s weaknesses. Just like him, Gongsun Cha could change his style as he willed.</p><br/><p>The only thing different was the style of fighting.</p><br/><p>Xue Dong’s style was domineering and brutal like a crushing hammer. Gongsun Cha’s style was sharp and flexible like a razor sharp blade that stripped flesh from bone with each strike.</p><br/><p>In terms of training new talents, Xue Dong thought that he was far behind Gongsun Cha. Gongsun Cha trained one batch after another of first class battle generals. These battle generals were the core of Mo Cloud Sea’s strength. Internally even Kun Lun thought that the skill level of Kun Lun’s battle generals were not as good as Mo Cloud Sea.</p><br/><p>In these last ten years, other than fighting, Xue Dong invested almost all of his extra time into training new people. Once he thought of Gongsun Cha as his rival, the competitive Xue Dong could not allow himself to fall behind Gongsun Cha in any field.</p><br/><p>The appearance of new talented generals in Kun Lun these past years were in part due to Xue Dong’s efforts.</p><br/><p>However, Xue Dong still felt they could not compare to Mo Cloud Sea’s Ma Fan and the others. This displeased him.</p><br/><p>He always anticipated having a true battle with Gongsun Cha.</p><br/><p>He hadn’t thought that the chance to arrange the battle would come so soon!</p><br/><p>Xue Dong stepped out. Almost as though they had a prearranged agreement, Gongsun Cha also came to the front of his troops.</p><br/><p>He saw the bashful Gongsun Cha. Even though Xue Dong had seen Gongsun Cha in the mirages before, he still stilled. This guy opposite him was like a neighbor’s boy filled with sunshine and warmth. There was no killing energy at all. Xue Dong couldn’t connect him with that undefeatable battle general whose enemies fled at the sound of his name.</p><br/><p>“This one is Xue Dong, greetings to Mister Gongsun!” Xue Dong bowed.</p><br/><p>“Mister Xue is too polite!” Gongsun Cha’s smile became even more bashful.</p><br/><p>Xue Dong would not be fooled by Gongsun Cha’s smile but he still felt a strange sense of conflict. He quickly focused and said loudly, “I had originally thought that the battle between us will occur after Mister Zuo returned. I hadn’t expected to meet so soon. It seems the battle between you and I is fated.”</p><br/><p>“It’s not fate.” Gongsun Cha still had the smile but his words were as sharp as knives. “It’s strategy.”</p><br/><p>Xue Dong’s heart shook but his expression did not change. He smiled amusedly, “Strategy, I like the term.”</p><br/><p>“As long as Mister Xue likes it.” Gongsun Cha gave a harmless smile. “If Mister Xue likes it, I am even more confident. Ah, your shixiong is a great genius, and Mister Xue is also an invincible battle general, it would be a pity if either of you fall.”</p><br/><p>“Haha!” Xue Dong roared with laughter. “Who in the world is Eldest Shixiong’s match? Who is my match?”</p><br/><p>The words were arrogant but the confidence in the tone caused people to believe the words.</p><br/><p>“Really?” Gongsun Cha’s smile was even more bashful. “Does Mister Xue think that god-level is invincible? Does Mister Xue think that there is only a Lin Qian in the world? Mister Xue really underestimates the heroes of the world!”</p><br/><p>Xue Dong’s heart jumped and his eyes narrowed. However, he did not feel any fear. He laughed and said, “A great battle is about to start, why play these little mind games. Let’s fight. I’ve been waiting for this fight for a long time.”</p><br/><p>“Mister Xue is right.” The corners of Gongsun Cha’s mouth curved up sharply like blades. The warm and bashful smile immediately filled with killing intent. “Pity, war, it is not the same as before.”</p><br/><p>Vermillion Bird Camp against Xue Dong Battalion!</p><br/><p>The two strongest battle generals of the world, the two strongest battalions, fight!</p><br/><p>Wei Sheng was extremely fast. He was urgently flying at full speed.</p><br/><p>His target was Lin Qian!</p><br/><p>Gongsun Cha was right. War had changed. The appearance of god-level experts changed the state of war. In the past, no matter how strong the strongest was, they could not change the balance of war by themselves.</p><br/><p>This situation was transformed as god-level appeared.</p><br/><p>It would not be difficult for a god-level to take the head of the enemy leader among the tens of thousands of soldiers. A god-level was strong enough they did not fear stepping deep into the enemy’s territory.</p><br/><p>Take the general’s head!</p><br/><p>This terrifying tactic could deeply change the state of war.</p><br/><p>Kun Lun had also found the power of this tactic.</p><br/><p>According to their intelligence, Lin Qian had split up from Xue Dong a long time ago and his whereabouts were unknown.</p><br/><p>Lin Qian’s goal was either Gu Liang Dao or Yang Yuan Hao!</p><br/><p>Neither Gu Liang Dao nor Yang Yuan Hao could stop Lin Qian. They didn’t have god-level fighters under their command. Also, the loss of either Gu Liang Dao or Yang Yuan Hao and their battalions would be a great loss to Mo Cloud Sea’s faction.</p><br/><p>Mo Cloud Sea had repeatedly discuss and studied. The conclusion they reached was that god-levels were unsolvable at this time. This imbalance would only be temporary, lasting about ten years at maximum.</p><br/><p>Ten years later, the skill level of the battalions would increase by two levels, and there would be more pseudo god-levels. Five pseudo god-levels would be enough to stop a god-level.</p><br/><p>But that time, war would enter a new equilibrium. God-level experts would not be undefeatable and the use of battle generals would once again be viable.</p><br/><p>Top battle generals like Gu Liang Dao and Yang Yuan Hao could not be trained during this time.</p><br/><p>In these ten years, whoever possessed god-level experts, who possessed the most god-level experts would have the advantage.</p><br/><p>On the way, Wei Sheng had been wondering who Lin Qian’s target was. Yang Yuan Hao or Gu Liang Dao?</p><br/><p>Thinking while travelling, Wei Sheng thought the probability of Gu Liang Dao was higher.</p><br/><p>Gu Liang Dao and Yang Yuan Hao were about the same in strength, but among their factions, Gu Liang Dao clearly had the higher status. Also, Gu Liang Dao’s relationship to Mo Cloud Sea was closer than Yang Yuan Hao.</p><br/><p>The benefits to killing Gu Liang Dao was greater than killing Yang Yuan Hao.</p><br/><p>Also, Gu Liang Dao had marched deeper into Kun Lun territory. Gu Liang Dao had been filled with the desire for revenge after being defeated by Xue Dong. This meant that he had invaded faster than Yang Yuan Hao had.</p><br/><p>This meant that it was easier for Lin Qian to find them.</p><br/><p>Lin Qian looked at Gu Liang Dao Battalion before him. In his eyes, those people were like ants.</p><br/><p>Shuang Yu was covered in wounds. His face was ashen. His right arm had been severed by Lin Qian yet he had no intentions of stemming the bleeding. He looked upwards at the figure in the sky.</p><br/><p>Lin Qian stood holding his sword, the white robes fluttering in the wind. He was outside the reach of the mortal realm.</p><br/><p>Gu Liang Dao’s battalion was furiously attacking. The light of countless spells flew into the sky yet Lin Qian did not budge. The light shield around him did not shutter at all. The rain of attacks didn’t even cause a ripple on the surface.</p><br/><p>“Surrender, Gu Liang Dao, I feed no meaning in needless killing.”</p><br/><p>Lin Qian’s cool voice came from the sky.</p><br/><p>Gu Liang Dao’s spirits were extinguished. He looked at the sky. Was this a god-level expert?</p><br/><p>It was the first time he felt completely powerless. Even when he had lost to Xue Dong last time, he had not been so discouraged. This kind of discouragement was not because of Lin Qian’s strength but because he suddenly found that the battalion was not the strongest power in the world any longer.</p><br/><p>What would rule the world would be the god-level.</p><br/><p>“Big Brother!” A hoarse voice suddenly called out.</p><br/><p>Gu Liang Dao turned around. It was Shuang Yu. His eyes suddenly showed a hint of warmth. As he looked at this brother that had followed him, he suddenly calmed down. “Shuang Yu, do you regret it?”</p><br/><p>“Regret?” Shuang Yu suddenly laughed. “Big Brother, why would you ask this? No one regrets this!”</p><br/><p>“God-level is really strong!” Gu Liang Dao looked into the sky and lamented.</p><br/><p>“Brother Zuo will avenge us.” Shuang Yu had an expression of certainty.</p><br/><p>“You are right!” Gu Liang Dao suddenly showed a smile and said with bravado, “Then let us find out today, just how strong a god-level expert is!”</p><br/><p>Gu Liang Dao motioned for the battalion to stop attacking.</p><br/><p>The sky full of lights disappeared. Everyone looked towards their commander.</p><br/><p>The cloud over Gu Liang Dao was swept away. He raised his arm, his expression full of murderousness, his spirit brimming. He shouted, “Fight to the death!”</p><br/><p>“To the death!” Everyone shouted.</p><br/><p>“To the death!” Gu Liang Dao roared like a tiger, his hair standing on end!</p><br/><p>“To the death!” What answered him were the even stronger shouts from the battalion.</p><br/><p>“To the death!” Gu Liang Dao shouted with all of his strength. Even his voice had become his hoarse, but each person could clearly feel his intent to die.</p><br/><p>“To the death! To the death! To the death!” The soul-shaking shouts caused their fighting spirit to consume them like fire. There was no terror, no retreat, only stepping towards their deaths!</p><br/><p>“Kill!” Gu Liang Dao pointed his long blade into the sky.</p><br/><p>“Kill!” The one-armed Shuang Yu’s shen power burned furiously. His usually gentle features were twisted. He was like a ball of fire that charged with the will to die towards that figure in the sky, the one that seemed to be above the world.</p><br/><p>“Kill!” The battalion charged like an uncontrolled sea of fire towards Lin Qian in the sky.</p><br/><p>Lin Qian changed expression but sighed softly.</p><br/><p>The Immemorial Shen Sword shook and a sharp light suddenly formed.</p><br/><p>At the very front, Shuang Yu was immediately pieced by the light.</p><br/><p>Then this tiny light then cleaved through the raging Gu Liang Dao Battalion!</p><br/><p>A hole the size of a fist appeared in Gu Liang Dao’s chest. Lin Qian’s blow penetrated through the entire battalion.</p><br/><p>Yet Gu Liang Dao still wore a smile.</p><br/><p>Lin Qian’s expression suddenly changed.</p><br/><p>Translator Ramblings: I feel that Gongsun Cha is the most passive-aggressive character in this story.</p><br/>\n</div>"}