{"title": "Chapter Nine Hundred and Eight – The Chief Mo God’s Madness", "id": 908, "volume": 10, "url": "http://boxnovel.org/world-of-cultivation-chapter-nine-hundred-and-eight-%E2%80%93-the-chief-mo-god%E2%80%99s-madness", "volume_title": "Volume 10", "body": "<h1>Chapter Nine Hundred and Eight – The Chief Mo God’s Madness</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Nine Hundred and Eight – The Chief Mo God’s Madness</p><br/><p>The atmosphere inside the Mo Shen Temple was extremely tense.</p><br/><p>The front lines had not experienced continuous defeats and they had won a few battles but there was no joy on the faces of the mo gods. An Mo’s army was moving steadily and pushing in to their territory. Liang Wei and Qi Xin had not made any risky moves. They only continued to add pressure and press on their holdings.</p><br/><p>Piece by piece, step by step. This phrase described it best.</p><br/><p>But the mo gods were not idiots. They new that their situation was becoming more and more dangerous. While the enemy’s advance was slow, it did not give them any chances to fight back. The enemy was wary as though they were the weaker side.</p><br/><p>This kind of fighting strategy caused all of the Mo Shen Temple great frustration.</p><br/><p>They could only watch as the enemy slowly marched on them yet they couldn’t do a thing. As the enemy army pushed, their defense line was gradually pushed flat.</p><br/><p>This was a dangerous sign.</p><br/><p>A flattened defense line meant that it was easier for the other to break through and by pass their forces.</p><br/><p>Any battle general knew how dangerous this was.</p><br/><p>But they had no solutions. They could only watch as they slid towards the cliffedge. Panic and hopelessness spread uncontrollably in their hearts.</p><br/><p>The difference in power between them was too great.</p><br/><p>“How about we assemble a counterattack?” Youxi Ya Ke glanced at the Chief Mo God and asked probingly.</p><br/><p>The Chief Mo God was silent and felt extremely bitter. Counterattack? What could they use to counterattack. The other’s battalions did not have any weaknesses. Reinforcing the defense line was prolonging the inevitable, a slow suicide, but if they charged out, they would not come back.</p><br/><p>The Chief Mo God’s eyes swept dazedly across the hall. Compared to the past, the present Mo Shen Temple was magnificent, but it was cold and unpopulated at this time.</p><br/><p>Was this the sign of their defeat?</p><br/><p>He thought of his hard work over the past years. Through the battles, the Mo Shen Temple had grown and became the strongest factions in the Hundred Savage Realm. This had filled the Chief Mo God with pride. He had once believed that the Mo Shen Temple could not be defeated! Yet when the Nether King’s armies came, he found at the seemingly strong Mo Shen Temple could not stop the other’s advance.</p><br/><p>The enemy was too strong!</p><br/><p>Compared to the Nether King, the Mo Shen Temple was too weak. The difference between the two was like that of an adult and a child. It was an uncrossable gap.</p><br/><p>The Mo Shen Temple had fought back hardily. Even the Chief Mo God could not ask for more from his subordinates. The rule of the Mo Shen Temple had been popular in their lands.</p><br/><p>“The Nether King has come?” The Chief Mo God suddenly spoke. His voice was hoarse.</p><br/><p>“Yes.” Youxi Ya Ke nodded. “He recruited Princess Xia and the Lan Brothers to manage the his territories in Hundred Savage Realm. This move is beautiful. These two families both have long histories and large networks in Hundred Savage Realm. With them in control, the people’s hearts are reassured.”</p><br/><p>He shrugged and spread his hands. He said with an expression of helplessness. “Of course, it is even more detrimental to us.”</p><br/><p>“Fourth, what do you think?” The Chief Mo God looked at the fourth mo god that had been silent for a long time.</p><br/><p>The Fourth Mo God was not tall, and looked weak in physical. He had slightly messy hair and a pale face. He looked delicate without any of the power of the mo.</p><br/><p>No one would underestimate him due to his appearance. He came from a famous family. The successor of the Silver Catalpa Cavern. This had been recorded in the ancient histories. He was even more mysterious in people’s eyes.</p><br/><p>His name was Shui Yue.</p><br/><p>Chief Elder had spent great effort to recruit Shui Yue to the Mo Shen Temple to become the fourth mo god. He wasn’t just strong, he was an outstanding battle general. This was also why the Chief Mo God thought so greatly of him. In many records, they said that the successors of the Water Moon Family also inherited the knowledge of the ancient battle generals.</p><br/><p>Shui Yue had not disappointed the Chief Mo God and he had been responsible in large part for the expansion of the Mo Shen Temple over the past few years.</p><br/><p>Shui Yue was quiet, and never made trouble. He also had the skills. No one would dislike a subordinate like him.</p><br/><p>“The final battle is here.” Shui Yue was as calm as usual. He said peacefully, “The enemy is about to start a full-out attack.”</p><br/><p>The hall was completely silent.</p><br/><p>A moment later, the Chief Mo God finally spoke with difficulty, “What is the possibility we can hold out?”</p><br/><p>“One tenth.” Shui Yue was still calm.</p><br/><p>Youxi Ya Ke sighed. While he did not care as much as the others, he still felt extremely discomforted by the feeling of helplessness due to the difference in power.</p><br/><p>“What if we use everyone in the Mo Shen Temple?” The Chief Mo God suddenly gritted out a question.</p><br/><p>“We have already mobilized everyone.” Youxi Ya Ke unconsciously answered but then he reacted. He was stunned at the realization. He looked at the Chief Mo God with shock on his face.</p><br/><p>A hint of blood rose in the Chief Mo God’s face. His eyes were like twin balls of fire. “No, we will conscript everyone! All the families in the Mo Shen Temple, every mo that cultivates shen power, no matter the gender, they will be on the battlefield! We can make an army that is ten, twenty times bigger than the Nether King’s army … …”</p><br/><p>Everyone was frightened by the Chief Mo God’s mad suggestion.</p><br/><p>“But … …”</p><br/><p>After the war finished, the Mo Shen Temple’s lands would be desolate. A war like that had never occurred before, not even in the wars between the yaomo and the xiu.</p><br/><p>This was using bodies to fill the hole!</p><br/><p>“Yes! Only that! We will turn the Mo Shen Temple into a hell! A hell that will pull the Nether King down!” The Chief Mo God howled at the top of his lungs. He waved his arms wildly as though his body had been flooded with fighting spirit again.</p><br/><p>Everyone became silent.</p><br/><p>If the fighting really reached a level, the fatalities would be astounding. All of the mo would be reduced.</p><br/><p>“This is only an internal conflict of the mo, we are all mo …. …” Youxi Ya Ke couldn’t help but say. While he came from the Mo Shen Temple and didn’t feel anything for the Nether King, but … … the damage this would do to the mo … …</p><br/><p>The Chief Mo God suddenly turned and glared as though his eyes would sprout fire. He shouted, “Shut up! Youxi Ya Ke, Starting today, Youxi Battalion will be led by Second!”</p><br/><p>Youxi Ya Ke’s face turned ashen but then uncontrolled fury flooded his face. He laughed coldly, “Ha! You have gone mad!”</p><br/><p>Chief Elder’s face filled with murderousness.</p><br/><p>“What? You want to kill me?” Youxi Ya Ke held his head proudly but his gaze was icy. “Come on!”</p><br/><p>Finishing, he didn’t even look at the Chief Mo God as he turned and left the hall.</p><br/><p>The Chief Mo God’s face was black and his temples trobbed. He forced himself to resist. He knew that if he attacked Youxi Ya Ke now, the Mo Shen Temple would split.</p><br/><p>“Who else has opinions?” Chief Mo God had a dark expression.</p><br/><p>The others were silent.</p><br/><p>Chief Mo God’s expression eased slightly. He felt better that the other people did not resist his decision. He relaxed his tone. “I know that the fatalities will be high but this is our only chance at victory. We will have to disregard the cost, we need to let the Nether King feel that the Mo Shen Temple has the determination to fight to the end … …”</p><br/><p>The mad voice of the Chief Mo God echoed in the hall.</p><br/><p>Shui Yue’s residence.</p><br/><p>Wu Le drank back a few swigs of strong liquor. He seemed to be extremely thirsty. He allowed the liquor to flow down his mouth and neck. He only put down the liquor jar when a flush appeared on his face. He murmured to himself, “Youxi Ya Ke is right, Boss has gone mad.”</p><br/><p>Shui Yu had a small bottle and cup in front of him. He poured a small amount and slowly sipped it with a leisurely air.</p><br/><p>The two were both mo gods who had been promoted after the first three and this made them closer.</p><br/><p>“I’m not one to lead troops.” Wu Le gulped another mouthful and shook his head. “But I know that doing this is like drinking poison to satisfy thirst. Right now, we still have the hearts of the people. But if we conscript that time, we will lose the hearts of the people.”</p><br/><p>“He has too much pressure on him,” Shui Yu said neutrally.</p><br/><p>“No matter what, he cannot do this!” Wu Le showed his disappointment. “Pity, I’m just a step away from god-level. If I was strong as Wei Sheng, our situation will be much better.”</p><br/><p>“You have done well,” Shui Yu comforted. Ever since the last battle between Wu Le and Wei Sheng, Wu Le had worked hard. He was the fifth mo god, but he was the strongest of the mo gods in terms of individual power.</p><br/><p>Chief Mo God had once urged Wu Le to study to be a battle general. With such strong individual power, even if he was slightly less skilled as a battle general, he would be much stronger than most battle generals.</p><br/><p>Yet Wu Le had no interest in becoming a battle general. His entire mind was focused on cultivation.</p><br/><p>Wu Le took another mouthful of liquor and lamented, “Ten years ago, I was defeated by Wei Sheng. Ten years later and not only have I not caught up, I am left even further behind. I can only feel admiration. This kind of man is the one we should model ourselves after. Ten years ago, everyone said Wei Sheng was dead, I laughed at that. How could a man like that die so easily?”</p><br/><p>Shui Yue listened silently. He knew that Wu Le only wanted to find someone to vent to.</p><br/><p>“Even Lin Qian was defeated by Wei Sheng. I don’t like Lin Qian, but he is a true genius. A Yue, what do you think, why is the world changing so quickly?” Wu Le’s eyes were blurry and filled with bewilderment. “A Nether King suddenly popped up. He made trouble in Nether Ream but that wasn’t enough, so he came over to unite the mo. Ha, how sorry has he made us all! Now Mo Cloud Sea and Kun Lun are fighting. Wei Sheng that wasn’t been seen for ten years is now god-level and managed to frighten Lin Qian to hiding. Kun Lun has lost great face. Lin Qian is really sad. They are both god-level, such a great humiliation … … this world … … what is going on … … don’t understand … …”</p><br/><p>As Wu Le spoke, his words became indistinct. He fell forward on his face and started to snore.</p><br/><p>He was extremely depressed and only came to Shui Yue’s place to get drunk.</p><br/><p>Shui Yue sat as he slowly sipped. The harsh liquor was like fire in his throat.</p><br/><p>Flame started to burn in that pair of eyes that seemed to always be calm. He thought of the blood summons from the past, thought of his confusion in the past ten years as he waited, thought of how he had asked himself every night, thought of many things.</p><br/><p>He seemed to speak to himself.</p><br/><p>“Because a planted seed will grow into a great tree.”</p><br/><p>Editor’s note: https://www.youtube.com/watch?v=Unj_wM1xngs</p><br/><p>Today’s was an easy one.</p><br/><p>Also: Just in the case you missed it. 100 chapters for the pay off. Or is it 350 chapters?</p><br/><p>4th Mo God – 4th Member of the Mo Gods, battle general. He first appears in chapter 805, but not much is revealed about him.</p><br/><p>Shui Yue – Mo from the Water Moon Family. First appearing in chapter 559, he receives a blood summons from Wei. He is an experienced hunter, but has lived an impoverished life.</p><br/><p>Translator Ramblings: This is even more terrible when you realize that the Mo Gods reached their present power levels because of worship from these people. So they aren’t just planning the whole-scale massacre of their citizens, but people who actively worship them.</p><br/><p>Reminder:</p><br/><p>Below is the link to the donation page for Dolly Parton’s Imagination Library. We thank you in advance if you decide to participate and donate. Feel free to write a comment under the post if you choose to donate.</p><br/><p>Link:</p><br/><p>https://imaginationlibrary.com/shop#!/DONATE/p/40065381/category=10557183</p><br/>\n</div>"}