{"title": "Chapter Nine Hundred and Five Wei Sheng’s Sword", "id": 905, "volume": 10, "url": "http://boxnovel.org/world-of-cultivation-chapter-nine-hundred-and-five-wei-sheng%E2%80%99s-sword", "volume_title": "Volume 10", "body": "<h1>Chapter Nine Hundred and Five Wei Sheng’s Sword</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Nine Hundred and Five Wei Sheng’s Sword</p><br/><p>The hand energy did not shatter!</p><br/><p>It seemed to disappear into the air propelled by the hand energy. In the next moment, it penetrated deep into the Round Hold Formation!</p><br/><p>Mu Xuan’s mind was overwhelmed with fear. That terrifying energy had brushed past her body. The sharpness caused her hairs to stand on end. The sword xiu to the side of her were not so fortunate. The surrounding emptiness caused her to feel as though she was exposed in the air and she had no sense of safety.</p><br/><p>There seemed to be an empty street next to her.</p><br/><p>When one looked down from the sky, there was a terrifying wound that cut a path through the entire battalion!</p><br/><p>Mu Xuan had experienced many battles of various sizes. She had experienced danger before but today was the most dangerous one.</p><br/><p>The danger had come so suddenly and without any warning.</p><br/><p>When the blade energy had brushed past her, she hadn’t been able to move at all.</p><br/><p>In the sky, Bie Han thought it was a pity, his aim was off. If he had killed Mu Xuan with that blow, then this battle would have been finished. However, he quickly threw the thought to the back of his mind and his thoughts returned to the battle occurring right now.</p><br/><p>Soon, Bie Han seemed to detect something in the enemy battalion.</p><br/><p>The attack just now seemed to have given a greater shock to the enemy than he had imagined. The enemy still appeared as though they had not recovered and their reactions were delayed.</p><br/><p>An opportunity!</p><br/><p>Bie Han perceptively realized this was a rare opportunity.</p><br/><p>Sin Battalion were like opportunistic wolves that roamed around Mu Xuan Battalion. When they found a chance, they would bite.</p><br/><p>Bie Han was extremely precise. He would cause a river of blood flow of blood with each attack. He closely circled the perimeter of Mu Xuan Battalion with Sin Battalion and charged a few times. In a few short rounds, Mu Xuan Battalion had suffered heavy fatalities.</p><br/><p>Mu Xuan finally recovered. Seeing the battle formation wavering, she felt extremely frustrated.</p><br/><p>She had been scared by Bie Han!</p><br/><p>That should not happen!</p><br/><p>Mu Xuan forced herself to be alert. She knew that if she wasn’t careful today, she might end up dead. She suddenly thought of Xue Dong’s orders. Delay Bie Han and find time for Mi Nan and Xue Dong to perform a pincer movement.</p><br/><p>Her eyes immediately lit up.</p><br/><p>She recognized that Bie Han’s skill in battle formations were higher than hers, but if she decided to stay on the defense, it would not be easy for Bie Han to win.</p><br/><p>Delay!</p><br/><p>Having made her decision, Mu Xuan immediately changed tactics.</p><br/><p>Bie Han quickly detected the transformation in his enemy. His mind moved and he guess Mu Xuan’s intentions.</p><br/><p>Delay?</p><br/><p>He was expressionless as he started to slow the pace of battle and slowly roamed around Mu Xuan Battalion.</p><br/><p>Given her training Mu Xuan could focus for a long time, but her battalion could not maintain focus as long. They would eventually get tired, get distracted, or relax. But Sin Battalion would not have this problem. As long as Bie Han was focused, Sin Battalion would be focused.</p><br/><p>Bie Han had enough patience.</p><br/><p>He was also not in a hurry.</p><br/><p>Even if the opponent was Xue Dong, he was confident in Gongsun Cha’s abilities.</p><br/><p>As to Mi Nan, Bie Han dismissed him. In Bie Han’s opinion, Mi Nan had lost the qualifications to be a top battle general.</p><br/><p>Mi Nan looked powerful but in reality the ability of his battalion had decayed a great deal. They had lost the focus in their mind. Mu Shuang had fewer people, but Mu Shuang who fought with the intent to die had the ability to drag Mi Nan into hell.</p><br/><p>At this time, with Bie Han holding this region, the pressure on the supply lines decreased greatly and large amounts of resources and people had started to gather towards Mu Shuang.</p><br/><p>Also, Bie Han just received news that Gongye Xiao Rong had not gone back to recover but moved towards Mu Shuang’s defense line.</p><br/><p>Bie Han knew that Gongye Xiao Rong was not going there to defeat Mi Nan but to prevent Mu Shuang from seeking his death.</p><br/><p>Bie Han looked coldly at Mu Xuan Battalion.</p><br/><p>Boom-boom-boom!</p><br/><p>The blue and red figures in the sky rapidly changed position in the air and collided constantly!</p><br/><p>With every collision, terrifying shen power would explode like a volcano. Shen power vibrations that could be seen with the naked eye swept at everything.</p><br/><p>Under their feet, the mountains collapsed, the ground cracked, and terrifying cracks and bottomless holes dotted the landscape.</p><br/><p>Even the sky started to show cracks.</p><br/><p>The red figure was shrouded in blood as though he had just been drenched in a bloody pool. The sword in his hand gave bloodthirsty whines. With every blow, it created mists of blood.</p><br/><p>The blue figure was untouched by dust, elegant and dignified. The sharp presence of the his sword reached into the sky. Each blow seemed to slice through the world, and could not be stopped.</p><br/><p>This jie started to show signs of collapsing under the blows of the two god-levels.</p><br/><p>Wei Sheng was cold like granite, and would put all of his power behind each blow!</p><br/><p>The pairing of the powerful dragon heart’s ability to make blood and the God-Killing Blood Sword was a match made in heaven. He was devoted to the sword to start with, and his heart towards the sword had never changed in the many years.</p><br/><p>Adding on that he did not have to pay attention to other matters, his sword essence was a fraction purer than Lin Qian.</p><br/><p>The savage God-Killing Blood Sword was securely under his control. The bloody mists caused the world to be filled with the tang of blood but it didn’t affect Wei Sheng at all.</p><br/><p>Lin Qian was amazed.</p><br/><p>He had not underestimated Wei Sheng but he hadn’t expected that Wei Sheng’s accomplishments in the sword were greater than he had imagined. Lin Qian had been the most outstanding genius in Kun Lun’s history. Excelling in every area, he had talent that people envied, including cultivation.</p><br/><p>He was the leader of Kun Lun and still no one in Kun Lun could rival the speed of his cultivation.</p><br/><p>His skill in the sword surpassed his master and no one in Kun Lun’s history could rival him.</p><br/><p>But he had not thought that there would be someone even stronger than him!</p><br/><p>The other’s God-Killing Blood Sword was astoundingly powerful. Lin Qian could feel with each crossing of the swords that the Immemorial Sword in his hand would be corroded slightly by the blood.</p><br/><p>If this was a normal time, Lin Qian would be able to eliminate the blood’s corrosive taint with a thought. However, the two were in the midst of their fight. They would cross swords hundreds of times in a breath.</p><br/><p>He had to focus all of his attention to block, parry, and counter the blows. He had not time to take care of the corrosion.</p><br/><p>Fortunately, the Immemorial Sword was not weaker than the God-Killing Blood Sword, and was even a fraction stronger. The other’s God-Killing Blood Sword would also receive wounds from the sharp presence of the Immemorial Shen Sword</p><br/><p>Both sides were gritting their teeth and holding on, not even giving up a step.</p><br/><p>Lin Qian’s light injury gradually caused him to end up disadvantaged.</p><br/><p>Wei Sheng’s expression did not change. He was fighting intensely but his mind had gone far away.</p><br/><p>Where was the limits of the sword?</p><br/><p>He still hadn’t found the answer.</p><br/><p>The limits of the sword were what he had pursued all this time. He suddenly thought of the experiences of his cultivation, of Wu Kong Mountain, the sect leader, the masters, he thought of being with Zuo Mo and the others at the Sealed Extinction Battlefield, the sword oath roared in his ears like thunder.</p><br/><p>Countless faces flashed through the blood ocean in front of him.</p><br/><p>What was the sword?</p><br/><p>He had reached god-level, but his sword still couldn’t bring the sect leader and the others back to life.</p><br/><p>A hint of bewilderment flashed through his eyes.</p><br/><p>He instinctively waved the God-Killing Blood Sword in his hand.</p><br/><p>A great power came and he suddenly refocused. A hint of understanding formed.</p><br/><p>What was the limit of the sword? He still didn’t have an answer, but at this time, he understood something else. The river of life was fickle, and people were living in the present. Even the strongest sword could bring back lost happiness. The meaning of the sword was to protect and guard the present happiness.</p><br/><p>His brothers, family! The resolve of his oath!</p><br/><p>The sword was his life, his heart. Only with the sword in hand could he protect those things he held dearest. He was willing to use his life to guard this happiness!</p><br/><p>This was his sword!</p><br/><p>Something seemed to silently shatter in Wei Sheng’s body. His mind was completely calm and at peace.</p><br/><p>As though it felt Wei Sheng’s thoughts, the God-Killing Blood Sword suddenly exploded with light. The savagery within the bloody light disappeared along with the tang of blood. The bloody light was pure and a soft red like that of a crystal. There was a honest presence that reached people’s hearts.</p><br/><p>Lin Qian immediately felt the difference. Originally, there had been a thread of savagery and hate in Wei Sheng’s sword essence. This thread was powerful, but Lin Qian was not affected.</p><br/><p>He didn’t feel any regret or feel guilt about what had happened in the past.</p><br/><p>He had carried out the plan for Kun Lun. His life and soul only belonged to Kun Lun!</p><br/><p>All other things were ants in his eyes.</p><br/><p>But right now, Wei Sheng’s sword essence was peaceful and neutral with an open aura. It caused him to feel even more pressure. The enemy’s sword essence seemed to have suddenly multiplied in weight. With each blow, the flow of his shen power was disrupted roiled.</p><br/><p>This was … …</p><br/><p>His gaze landed on Wei sheng’s face and his eyes narrowed. There was no hate on Wei Sheng’s face. His gaze was as clear as water. Yet Lin Qian could also see the determination in Wei Sheng’s eyes was stronger than before!</p><br/><p>Epiphany!</p><br/><p>He was having an epiphany at this time!</p><br/><p>Lin Qian’s heart sank.</p><br/><p>When it came to their level, techniques were not the most important. They fought based on sword essence, mind, shen power, and resolve. Each attack contained their understanding of sword essence and the laws of the world. The first person unable to withstand it would be affected in all areas by the other in mind, vision, and sound.</p><br/><p>Each of their attacks were fatal for those not in god-level!</p><br/><p>But the two could understand the mysteries of each others sword path. They both knew that trickery was useless against both themselves and the other.</p><br/><p>But they did not retreat.</p><br/><p>The rate of attack on both sides was astounding. The danger was something those not in god-level could understand.</p><br/><p>Their shen power was also used up at an astounding speed. They had absorbed all the shen power of this jie.</p><br/><p>The jie started to collapse.</p><br/><p>In Lin Qian’s eyes, Wei Sheng became larger and larger. He was like a god of war. Each blow was filled with the power to destroy the world!</p><br/><p>Lin Qian knew that this was because his mind was infiltrated by Wei Sheng’s sword essence and had started to waver.</p><br/><p>The shen power in his body was almost used up.</p><br/><p>Wei Sheng became even stronger as he fought. This did not mean that Wei Sheng’s shen power was stronger than Lin Qian. Wei Sheng had gained a stronger and more sturdy mind. After breaking through the mental barrier, Wei Sheng’s mind was indestructible.</p><br/><p>The light injury Lin Qian had received earlier had been a minuscule opening, but now the opening was being gradually enlarged.</p><br/><p>Lin Qian knew that he would lose in twenty breaths.</p><br/><p>He only had one option.</p><br/><p>Leave! Flee!</p><br/><p>Lin Qian sighed inwardly. This departure would leave a deep shadow on his mind. He didn’t know how much effort it would take to resolve it.</p><br/><p>For Kun Lun!</p><br/><p>Resolved flashed through Lin Qian’s mind.</p><br/><p>Editor’s note: https://youtu.be/9jK-NcRmVcw?t=13s</p><br/><p>Translator Ramblings: Oh no! The main character effect is occurring!</p><br/>\n</div>"}