{"title": "Chapter Nine Hundred and Six – The Death of Mi Nan", "id": 906, "volume": 10, "url": "http://boxnovel.org/world-of-cultivation-chapter-nine-hundred-and-six-%E2%80%93-the-death-of-mi-nan", "volume_title": "Volume 10", "body": "<h1>Chapter Nine Hundred and Six – The Death of Mi Nan</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Nine Hundred and Six – The Death of Mi Nan</p><br/><p>Princess Xia was nervous.</p><br/><p>She had taken leadership of the clan years ago. Under her command, the family had developed very well in these past years. While they needed to thread the razor thin crack between the major factions, she was skilled, soft in appearance but a spirit of steel. Her resolve was hardened and she was never discouraged. All of the family respected her.</p><br/><p>She was still as beautiful as those days in Great Peace City, but her features were more mature.</p><br/><p>The sudden summons still caused her anxiety. Mo Shen Temple was already so strong that she needed to look up at them. The Nether King was even stronger made her wary and feel uncertainty. She had paid attention to the war between the Nether King and the Mo Shen Temple in these recent days. The fighting intense, and Mo Shen Temple was on the losing side.</p><br/><p>Mo Shen Temple could not find any allies in Hundred Savage Realm. Everyone had determined it was a matter of time before the Nether King united the mo. This person who was very likely to become the ruler of all mo sudden had summoned her. Princess Xia didn’t know whether good fortune or misfortune was waiting for her.</p><br/><p>“Please enter, King has been waiting for you.” A high level mo battle general politely ushered Princess Xia in.</p><br/><p>An Mo was out on his campaign so he had picked a few from his guard to act as attendants.</p><br/><p>These people had followed An Mo during the seven day miracle. They were absolutely loyal. The battle general was dazzled by Princess Xia’s beauty for a moment. Did King like this type?</p><br/><p>Princess Xia focused and carefully walked into the large hall.</p><br/><p>A white-haired male seemed to be looking off into the distance. He heard Princess Xia’s voice and turned around.</p><br/><p>“Long time no see!”</p><br/><p>Princess Xia saw that familiar yet strange face and was stunned where she stood.</p><br/><p>Her tears streamed down uncontrollably.</p><br/><p>Gongye Xiao Rong was carefully hiding with his battalion.</p><br/><p>He only a thousand people remained of his battalion. All thousand had followed him here. Everyone knew now that Tian Huan was gone. But no one deserted because Daren told them that they would need to earn a place for their families with their sweat and blood.</p><br/><p>Also, Daren had lead them to fight Mi Nan.</p><br/><p>If they were asked who they hated the most in the world, there was only one answer, Mi Nan!</p><br/><p>This person had been of the highest status in Tian Huan and received countless benefits from the sect was the cause of Tian Huan’s destruction! No one would retreat from a chance to fight Mi Nan!</p><br/><p>They silently crept closer to the battlefield. Mi Nan Battalion did not notice them.</p><br/><p>The battle between the two sides was extremely harsh. At this point, any significant reinforcements would tip the scale. Mi Nan Battalion had called back most of their scouts to focus on the harsh battle.</p><br/><p>Mu Shuang’s battalions were being slowly whittled down but this was North Tian Huan’s territory. It was not difficult to have battalions reinforce them. Also, while Mi Nan’s battalion had more elite forces, they could not receive any reinforcements.</p><br/><p>Mu Shuang was a cold-blooded battle general that was sacrificing an endless stream of ordinary battalions to turn this battlefield into a meat grinder.</p><br/><p>These average battalions that usually played small roles were fearless because their enemy was Mi Nan, the person Tian Huan hated the most!</p><br/><p>Countless people among them had their homes destroyed because of this person. The ten year long war between North and South Tian Huan had caused their hatred to be etched into their bones.</p><br/><p>They continued to charge in.</p><br/><p>Here, lives were just a number. More than fifty thousand North Tian Huan soldiers had already fallen here.</p><br/><p>But when the news passed back to the rear, it did not cause a panic. Instead more and more battalions flooded over. Some battalions had been preparing to leave North Tian Huan, waiting to enter Mo Cloud Sea yet they turned back.</p><br/><p>In some battalions where their commanders were not willing to return, many soldiers left their battalions and formed small groups to come back.</p><br/><p>If even Mu Shuang Daren was willing to die with Mi Nan, then what did their lives mean in comparison?</p><br/><p>Mi Nan was trapped here by the “cannon fodder.” Many times, he thought he was about to break free, but the crazed and fearless attacks of the enemy caused the chances to be stolen away.</p><br/><p>Looking around and seeing the dispirited morale on the faces of his commanders, Mi Nan felt cold inside.</p><br/><p>Why was it like this?</p><br/><p>He was a top battle general! His battalion was a top battalion!</p><br/><p>Why had they reached such a state?</p><br/><p>There was less than half of his battalion left. Even scarier was that deserters had started to appear since yesterday night. Mi Nan had been lead the military for so many years and it was the first time desertion had occurred in his battalion!</p><br/><p>He knew that this battalion that was pride was not far from total collapse.</p><br/><p>But he did not have a solution. He couldn’t even retreat. If his timing in joining Kun Lun hadn’t been perfect, they would not have received the benefits they did. Kun Lun was full of talent, and they had no room for outsiders. If he did not complete this mission successfully, what would await him upon his return would only be a cold treatment.</p><br/><p>Kun Lun would not trust him any longer.</p><br/><p>His clansmen would lose everything. They would never see a bright future again.</p><br/><p>He could die, but he could not retreat!</p><br/><p>While he was willing to fight to the death, his battalion was not willing. A Tian Huan battalion fighting to the death for Kun Lun? What nonsense was that?</p><br/><p>Mi Nan was extremely discouraged.</p><br/><p>What he didn’t realize was that there were a thousand pairs of hate-filled eyes staring at him from the darkness.</p><br/><p>Gongye Xiao Rong’s sneak attack had been timed to perfection.</p><br/><p>Mi Nan Battalion had just began falling back to their next defensive position yet Gongye Xiao Rong attacked before they could organize. Mi Nan Battalion that had been already close to the edge of defeat instantly collapsed!</p><br/><p>“Kill Mi Nan!</p><br/><p>“Kill Mi Nan!”</p><br/><p>The shouts rang over the entire camp.</p><br/><p>Mi Nan Battalion was like a group of headless flies. Many people even turned in panic and headed into the darkness. Their performance was like that of the most amateur battalion. There were no traces of a elite top battalion left.</p><br/><p>Mi Nan seemed to age decades in a moment. He stood dazed in the wind and did not seem to hear the sounds of combat coming closer.</p><br/><p>A sharp light sliced towards his neck.</p><br/><p>He stood motionlessly like a man made out of wood.</p><br/><p>A head flew into the sky.</p><br/><p>The expression was still wooden.</p><br/><p>Bie Han’s Sin Battalion had circled around Mu Xuan Battalion for hours as though they didn’t know exhaustion.</p><br/><p>Mu Xuan did not dare to relax at all. She knew if they were the least bit careless, Bie Han would show his fangs. She continued to motivate her troops to be alert.</p><br/><p>As long as they could outlast Bie Han, they would win.</p><br/><p>Time slowly passed.</p><br/><p>As time passed, Mu Xuan’s heart felt even colder. She could not imagine someone maintaining a random pattern like this for over ten hours. Bie Han’s paths did not ever repeat, and she could not predict his next movement at all</p><br/><p>Such a terrifying person!</p><br/><p>Mu Xuan had a bad feeling. Even though she constantly reminded them, there were many of her subordinates that couldn’t help but get distracted.</p><br/><p>Bie Han’s attack happened suddenly without any warning.</p><br/><p>Bie Han was like an epee blade that instantly pierced into a corner of Mu Xuan Battalion. In that moment, blood sprayed and limbs flew!</p><br/><p>Many people hadn’t even managed to refocus when the god of death had snuffed their lives out.</p><br/><p>One attack and then a retreat!</p><br/><p>Before Mu Xuan could counterattack, Sin Battalion had fled like lightning and returned to their roaming state.</p><br/><p>This battalion was all made up of female sword xiu. While each of them were experienced in battle, they were still females. The sudden bloody scene caused their faces to change expression.</p><br/><p>They did not fear death or battle, but they were repulsed by such a bloody scene, especially when it happened next to them.</p><br/><p>This time, no one dared to relax. All of them were on their guard.</p><br/><p>Bie Han once again resumed his seemingly sleepy state. He led Sin Battalion to roam randomly around Mu Xuan Battalion.</p><br/><p>Night came.</p><br/><p>Mu Xuan’s heart was nervous again. She felt great panic, yet no matter how she tried, she could not get in contact with Mi Nan and Xue Dong.</p><br/><p>Had something happened to them?</p><br/><p>Mu Xuan suddenly had a bad feeling.</p><br/><p>She looked down on people like Mi Nan. If someone had betrayed Kun Lun, she would be the first to cut their head off. If the sect leader hadn’t asked for them to be polite, Mu Xuan would not have shown Mi Nan any politeness. Mu Xuan was not the only one. All of Kun Lun had a terrible opinion of Mi Nan.</p><br/><p>The unity of Kun Lun was something that people found it hard to imagine. Due to this they looked down and disdained a person like Mi Nan that had betrayed his sect after receiving countless privileges.</p><br/><p>But Xue Dong?</p><br/><p>Who could stop Xue Dong?</p><br/><p>She didn’t believe it.</p><br/><p>But up until now, she still couldn’t see any sign of Xue Dong Battalion. Even scarier was that she couldn’t get into contact with Xue Dong.</p><br/><p>Xue Dong Battalion was Kun Lun’s strongest battalion. Xue Dong’s status in Kun Lun was one unmatched by any other battle general. Due to this, Xue Dong Battalion had recruited almost all of the best of Kun Lun.</p><br/><p>The over half of the Children of Kun Lun were in Xue Dong Battalion.</p><br/><p>Every sword xiu in the battalion had passed through six rounds of exams and selection. Each one was powerful.</p><br/><p>Xue Dong had peerless skill. Adding on the battalion sword xiu that had been chosen though successive rounds of selection, the countless experts, the harsh training, Mu Xuan believed that there was no other battalion like Xue Dong Battalion. Even Gu Liang Dao who was famed in the world had been badly defeated when he encountered Xue Dong.</p><br/><p>Who would defeat such a battalion?</p><br/><p>Mu Xuan didn’t believe it.</p><br/><p>While Bie Han was strong and Sin Battalion was more powerful than expected, she believed if Xue Dong came thenBie Han would not have a chance at all.</p><br/><p>But … … what trouble had Xue Dong encountered?</p><br/><p>The bad feeling increased. The mission this time had been rocky everywhere.</p><br/><p>The conflict between Kun Lun and Mo Cloud Sea could not be avoided.</p><br/><p>It was time for the two to grapple.</p><br/><p>Yet unlike the unstoppable victories she had imagined, she felt as though they were encountering obstacles everywhere.</p><br/><p>Her defeat to Gongye Xiao Rong’s counterattack had been due to her own carelessness, but she had not held anything back in her battle against Sin Battalion and she was still being suppressed.</p><br/><p>Bie Han was stronger than she imagined, and she had a feeling that Bie Han was still not using all of his strength.</p><br/><p>Was this Mo Cloud Sea’s true power?</p><br/><p>Read this post or read below:</p><br/><p>Hello everybody,</p><br/><p>As you are aware, World of Cultivation will be coming to an end in little over a week. The entire time Wyhcwe and I, WanderingGummiOfDoom, have worked on this project we have never accepted “donations” for our work. However, we wish to commemorate the conclusion of the project by crowdfunding for a charity.</p><br/><p>What we want to ask of our readers today, is that you donate to Dolly Parton’s Imagination Library. They are a charity dedicated to fighting illiteracy by providing young children with books. We have selected this charity for the following reasons: the appropriateness of the charity given our work, and that the charity operates in the same countries the vast majority (75%+) of our readers are from: Australia, Canada, the UK, and USA.</p><br/><p>Below is the link to the donation page for Dolly Parton’s Imagination Library. We thank you in advance if you decide to participate and donate. Feel free to write a comment under the post if you choose to donate.</p><br/><p>Link:</p><br/><p>https://imaginationlibrary.com/shop#!/DONATE/p/40065381/category=10557183</p><br/><p>Cheers and thank you for all the support,</p><br/><p>Wyhcwe and WanderingGummiOfDoom</p><br/><p>P.S. We will not be releasing the chapters faster for donations. One a day, start to finish y’all.</p><br/><p>Translator Ramblings: A certain gummi has a countdown playlist … …</p><br/>\n</div>"}