{"title": "Chapter Nine Hundred and Ten – Lin Qian’s Sword", "id": 910, "volume": 10, "url": "http://boxnovel.org/world-of-cultivation-chapter-nine-hundred-and-ten-%E2%80%93-lin-qian%E2%80%99s-sword", "volume_title": "Volume 10", "body": "<h1>Chapter Nine Hundred and Ten – Lin Qian’s Sword</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter Nine Hundred and Ten – Lin Qian’s Sword</p><br/><p>Wei Sheng cutting the main peak of Kun Lun was so astounding at the news that Mo Shen Temple had surrendered to the Nether King paled in comparison.</p><br/><p>However, the mo were an exception.</p><br/><p>The eyes of all mo were on the army of the Nether King army in Hundred Savage Realm. The enmity the mo of Hundred Savage Realm felt towards the Nether King had been diminished greatly. The power of Wei Sheng’s campaign against Kun Lun caused the mo to reconsider the status of a god-level expert. Even an existence as strong as Kun Lun was forced to such desperate straits by Wei Sheng.</p><br/><p>God-level, that as the true peak of this world. A faction that did not a god-level would be fated to be in defeated. Among the mo, there was only one god-level, the Nether King.</p><br/><p>This caused the enmity from many of the mo to fade and instead they felt slightly reassured. The mo had their own god-level.</p><br/><p>Many people started to hope for the arrival of peace. The Nether King was undoubtedly the one most qualified to unite the mo.</p><br/><p>The Mo Shen Temple’s inner conflict and the subsequent coup was supposedly due to the Chief Mo God’s decision to conscript and sacrifice the populace. Not many were too surprised by this. In the eyes of many people, the Mo Shen Temple was already hard pressed to have held until now under such great pressure.</p><br/><p>After the initial shock, all of the mo entered celebration.</p><br/><p>The mo were united!</p><br/><p>After thousands of years, the mo finally been reunited. In the history of the mo, every time the mo were united, that was the beginning of a golden age of prosperity. They had enough reason to believe that the mo were going to welcome a completely new future.</p><br/><p>The king of mo!</p><br/><p>The Chief Mo God was killed, the rhinoceros mo god was not willing to continue in the new regime. He left the Mo Shen Temple and returned to his homeland to be the clan leader. The Mo Shen Temple still had the Youxi Battalion and Shui Yue Battalion. Wu Le became the a new bodyguard for the king. The other management positions were appointed by the new king.</p><br/><p>The top four battalions of the mo quickly took form.</p><br/><p>Liang Wei’s King’s Horn became the first of the mo battalions. The other three battalions were: Qi Wei’s Qi Battalion, Youxi Ya Ke’s Youxi Battalion, and Shui Yue’s Shui Yue Battalion.</p><br/><p>An Mo was deputized as the first mo commander in command. The only unexpected appointment was Zhu Nan Yue. She became the first advisor to An Mo’s strategic group.</p><br/><p>Due to Zuo Mo having already built up the framework with Princess Xia and the Lan brothers, everything progressed smoothly.</p><br/><p>“Mu Xi Daren, your residence has been arranged. Please follow me.” A male shadow guard dressed in black respectfully bowed and then led the way at the front.</p><br/><p>“Please.” Mu Xi nodded and followed behind with her guards.</p><br/><p>“You are too polite!” This shadow guard respectfully answered.</p><br/><p>The guards around Mu Xu had unnatural and cautious expressions. These veterans of the battlefield and in death felt uneasy in front of these shadow guards.</p><br/><p>The Shadow Guard was an extremely powerful organization and was Ming Yue Ye Daren’s the most trusted and sharpest blade . These two years were better. In the years before that, it was these people hidden in the shadows that had brought down and assassinated Ming Yue Ye Daren’s enemies.</p><br/><p>In this unprecedented purge of the yao ranks, the one that had been the most effective was the Shadow Guard.</p><br/><p>Mu Xi noticed the uneasiness of her guards. She didn’t like the Shadow Guard either but she didn’t want to offend them. The Shadow Guard wasn’t just the strongest intelligence network, they were also Ming Yue Ye Daren’s most trusted protectors.</p><br/><p>Their leader, Youqin Lie, was also very trusted by Ming Yue Ye Daren.</p><br/><p>Battle generals innately disliked these assassins hidden in the darkness. People had more than once expressed concerns about the Shadow Guard’s accumulated power. The only thing to rejoice about was that Youqin Lie never entered any power struggles, and maintained respect towards the other daren. However, people were still worried about Youqin Lie’s cruel actions.</p><br/><p>Mu Xi refocused and asked, “Has Bin Lan Daren arrived?”</p><br/><p>“Bin Lan Daren arrived yesterday night.”</p><br/><p>Mu Xi new why Daren had summoned them all back for. The changes in the world affairs had been too drastic in this recent while. Kun Lun and Mo Cloud Sea had started their war, Lin Qian had lost, the main peak of Kun Lun had been cut down, and Kun Lun had entered unprecedented danger.</p><br/><p>Mu Xi and the others were astounded.</p><br/><p>They knew just how powerful Kun Lun was.</p><br/><p>But before one wave settled, another started. The Mo Shen Temple suddenly had internal conflict and three remaining mo gods surrendered to the Nether King.</p><br/><p>The mo had united!</p><br/><p>This caused the yao to suddenly feel great danger.</p><br/><p>No one would doubt the strength of a united mo race. Each time the mo were united, it was when they were strongest, and also when their desire to expand was greatest.</p><br/><p>The two titans of the xiuzhe world were fighting intensely. That Nether King wasn’t stupid and he wouldn’t participate.</p><br/><p>The mo only had one direction to expand in.</p><br/><p>The yao lands!</p><br/><p>In the past thousands of years, the yaomo had maintained a good relationship. Usually, the yao did not need to worry about the fractionalized mo. However, now, the mo had a new king!</p><br/><p>This mo king was of mysterious and unknown origins. However, his intentions were revealed immediately after he ascended to the throne. He lead a powerful invasion of Hundred Savage Realm and rapidly united the mo.</p><br/><p>The strong expansionist stance that the new Mo King displayed worried the yao.</p><br/><p>Mu Xi was not stupid. The yao and the mo were on good relations because the yaomo had the same enemies. But right now that the xiuzhe were fighting among themselves, and the mo were strong while the yao weak. Would the mo overlook this opportunity to swallow the yao?</p><br/><p>Mu Xi was also filled with worries.</p><br/><p>The meeting was of the highest levels. Almost all the higher ups of the yao were gathered together. The yao were in a nervous atmosphere.</p><br/><p>This meeting would decide the fate of the yao.</p><br/><p>Bie Han looked at the thick smoke above the burning city and turned to lead Sin Battalion to leave without any hesitation.</p><br/><p>This was the ninth major hub city that he had razed.</p><br/><p>Other than the battalions on the borders of Kun Lun that didn’t dare to move, almost all the other battalions in Kun Lun had returned to reinforce the main peak of Kun Lun. Lin Qian was not present, Xue Dong was not here, all of Kun Lun was in chaos. They could only respond based on their instincts.</p><br/><p>But how could the weakly supported border hold against Gongsun Cha, Bie Han, and Yang Yuan Hao?</p><br/><p>The three battalions broke through with little effort. The vast and empty Kun Lun was spread in front of them.</p><br/><p>Gongsun Cha and the others did not choose to conquer the territory.</p><br/><p>Kun Lun’s rule in these lands was deeply entrenched over thousands of years. The factions of various sizes here were fighting back and once Mo Cloud Sea tried to conquer these places, Mo Cloud Sea’s battalions would be tangled up in intensifying rebellions.</p><br/><p>Therefore, the strategy Gongsun Cha and the others planned was simple and brutal.</p><br/><p>Damage, constant damage to Kun Lun’s production capabilities and infrastructure!</p><br/><p>Everywhere they passed, they didn’t conquer, they destroyed. This kind of destruction would not be immediately fatal for Kun Lun, but it was akin a thousand wounds on Kun Lun’s enormous body.</p><br/><p>The bleeding would continue and Kun Lun would only become weaker with time.</p><br/><p>Following behind the three top battalions were the first class battalions like Ma Fan and Tang Fei. Gongsun Cha knew that a chance like this would not occur again. He did not keep anything back. All of the first class battalions and elite battalions were mobilized.</p><br/><p>They followed the three top battalions to enter the vast core of Kun Lun.</p><br/><p>Time!</p><br/><p>What was most important was time!</p><br/><p>Gongsun Cha commanded that all battalions had to leave Kun Lun within ten days.</p><br/><p>The jinzhi forts were being built day and night on the borders of Mo Cloud Sea. Kun Lun who had suffered so much loss was very likely to retaliate.</p><br/><p>In these weeks, Kun Lun’s sky was covered in smoke.</p><br/><p>The sect leader had been defeated, the main peak cut down, countless cities burned to ashes… …</p><br/><p>Kun Lun seemed to reach the end of the road in the span of one night.</p><br/><p>By the time the people of Kun Lun reacted, Mo Cloud Sea’s battalions had disappeared.</p><br/><p>Seeing Kun Lun covered in wounds, everyone cried.</p><br/><p>Lin Qian wanted to die.</p><br/><p>Kun Lun was wailing after being trampled under the hooves of Mo Cloud Sea. Kun Lun had fallen under Wei Sheng’s sword. But at this time, he could not come out, he could not fight for his beloved Kun Lun, he could only stay in this hidden cavern and heal.</p><br/><p>Lin Qian held the Immemorial Sword tightly. His handsome face was unusually pale. In just a few dozen days, he had thinned by a size. His bloodless lips moved, tears flowed out of his empty eyes and fell down his face.</p><br/><p>“Master, sorry!”</p><br/><p>“Sorry … …”</p><br/><p>All of his pride had been completely destroyed. Kun Lun was his all, he lived for Kun Lun, he would forever live for Kun Lun!</p><br/><p>If he hadn’t been defeated, the state of affairs would not be so bad, the main peak would not have been destroyed, Kun Lun would not have lost so, and Kun Lun would not have been humiliated!</p><br/><p>“I am a criminal!”</p><br/><p>“The criminal of Kun Lun!”</p><br/><p>He said to himself as though he was proclaiming judgement on himself.</p><br/><p>He stood up. A light suddenly appeared in his empty eyes. The light grew brighter and filled his eyes.</p><br/><p>His wooden head slowly started to turn.</p><br/><p>He sat silently. The excitement and madness in his eyes slowly grew. An indescribable determination was in his eyes and flowed in his body.</p><br/><p>The Immemorial Shen Sword in his hand hummed and he felt an indescribable understanding.</p><br/><p>His sword was Kun Lun!</p><br/><p>Not for heaven or earth, not for the laws, not for the people, only for Kun Lun!</p><br/><p>This body belonged to Kun Lun, this sword belonged to Kun Lun!</p><br/><p>All the laws of the world were below Kun Lun, all the emotions of the world were below Kun Lun.</p><br/><p>This was his sword, Kun Lun above all!</p><br/><p>The energies in Lin Qian’s body suddenly flowed and circulated. Half of his injuries healed. His sword essence level had once again made another advancement!</p><br/><p>In the fight with Wei Sheng that day, Wei Sheng had found his sword path. Today, Lin Qian also found the sword path for him.</p><br/><p>Kun Lun had reached its most precarious moment.</p><br/><p>Lin Qian did not feel any joy. At this time, his level of sword essence was just matched to Wei Sheng. His wounds had not healed, and he was still at a disadvantage.</p><br/><p>But he did not continue to spend time recovering. Kun Lun had reached the edge of a precipice.</p><br/><p>He must lead!</p><br/><p>He was also below Kun Lun!</p><br/><p>Editor’s Note: FYI – explicit</p><br/><p>Below is the link to the donation page for Dolly Parton’s Imagination Library. We thank you in advance if you decide to participate and donate. Feel free to write a comment under the post if you choose to donate.</p><br/><p>Link:</p><br/><p>https://imaginationlibrary.com/shop#!/DONATE/p/40065381/category=10557183</p><br/><p>Translator Ramblings: Five more to go! Lin Qian’s epiphany really highlights the difference between him and Wei Sheng. This is a kind of zeal that I can almost admire. Both Lin Qian and Wei Sheng put their beliefs at the core of their life, but for Lin Qian, he can sacrifice anything and anyone for his beliefs. On the other hand, Wei Sheng put his friends and close people as first and his belief is a result of his conviction to protect.</p><br/>\n</div>"}