{"title": "Chapter 35 - Ill-Fated Relationship from a Past Life #6", "id": 35, "volume": 1, "url": "http://boxnovel.org/god-of-crime-chapter-35-ill-fated-relationship-from-a-past-life-6", "volume_title": "Volume 1", "body": "<h1>Chapter 35 - Ill-Fated Relationship from a Past Life #6</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span style=\"\">Chapter 35 - Ill-Fated Relationship from a Past Life #6</span></p><br/><p><span style=\"\"> Tae-hyuk looked down at the vitamin boxes, which had increased to a total of three boxes. </span>The money that he first brought into the casino was 30 million won, the total amount of money that he had saved up. The total had now increased by five times.</p><br/><p><span style=\"\"> The dealer and the players that he was playing with disappeared after someone called them away.</span></p><br/><p><span style=\"\"> ‘SY lost a lot of money, so it isn’t over yet.’</span></p><br/><p><span style=\"\"> Han Sang-won’s ability was being able to stretch out the profits. </span>For example, he had led Tae-hyuk to a table with four card cheats, who had been waiting for the appropriate target to appear. If there was a mixture of regular guests, then there wouldn’t be a large amount of profit. He was able to perfectly deceive them because they were card cheats.</p><br/><p><span style=\"\"> A bellboy pushing a drinks cart passed by Tae-hyuk.</span></p><br/><p><span style=\"\"> “Can I have a drink?” </span></p><br/><p><span style=\"\"> “Of course, Guest-nim.”</span></p><br/><p><span style=\"\"> As the lounge of a luxury hotel, it offered free drinks. </span>There was whiskey with ice in it, cocktails made with sweet fruity liqueur, and Vodka with kahlua.</p><br/><p><span style=\"\"> They were easy and quick drinks. </span>Drinking two glasses would make a person’s self-control go away.</p><br/><p><span style=\"\"> Tae-hyuk picked a cherry cocktail without any alcohol in it. </span>He sipped it while watching the other tables before someone walked up behind him.</p><br/><p><span style=\"\"> “Guest-nim, you are better than I thought.\"</span></p><br/><p><span style=\"\"> \"Ah, if it isn’t Han Sang-won. However, where did the people playing the game go? I wanted to play for longer.”</span></p><br/><p><span style=\"\"> Han Sang-won smiled but his fingers were trembling.</span></p><br/><p><span style=\"\"> \"Everybody is busy. Um, I want to introduce you to another table. I don’t think there are any more empty seats. If you don’t mind, I have made a special place for you. How about it?”</span></p><br/><p><span style=\"\"> \"I don’t care who they are today. It doesn’t matter.”</span></p><br/><p><span style=\"\"> Han Sang-won asked me again to confirm.</span></p><br/><p><span style=\"\"> \"Where is Detective Park?”</span></p><br/><p><span style=\"\"> \"Well, he became very drunk so I told him to go and rest.”</span></p><br/><p><span style=\"\"> \"Is that so? Then let's go.\"</span></p><br/><p><span style=\"\"> Tae-hyuk didn’t miss Han Sang-won’s mouth going up.</span></p><br/><p><span style=\"\"> ‘The protector is gone, so he can act as he like. But is that really the case?’</span></p><br/><p><span style=\"\"> Han Sang-won led Tae-hyuk to the manager’s room.</span></p><br/><p><span style=\"\"> There was a dealer with a bandage around his arm and a man with sharp eyes waiting for him.</span></p><br/><p><span style=\"\"> “Guest-nim. This is Kim Shin-hyeong. He is someone with some knowledge about how to play poker. I think it will be a good game.”</span></p><br/><p><span style=\"\"> \"Han Sang-won, is this your idea? A one-on-one game is no fun unless the stakes are higher.”</span></p><br/><p><span style=\"\"> “... Haha. Don’t worry. I will raise the basic bet to three million. Are you satisfied with that?”</span></p><br/><p><span style=\"\"> It meant that he had no intention of drawing this out for a long time. </span>In fact, Tae-hyuk was the same.</p><br/><p><span style=\"\"> “The more the merrier.”</span></p><br/><p><span style=\"\"> Han Sang-won gritted his teeth at Tae-hyuk’s appearance. </span>He was a man who started at the bottom, and rose through the ranks to the position of manager of the branch office.</p><br/><p><span style=\"\"> However, it was the first time he met a type like Seo Tae-hyuk. </span>At first, he thought it was due to Park Jung-bae. However, that attitude didn’t change, even after he had disappeared. What caused such self confidence?</p><br/><p><span style=\"\"> This was their territory. </span>The opponent hadn’t realized that he walked into the mouth of a lion. If he just used a little strength, then he could kill this wannabe brat.</p><br/><p><span style=\"\"> Han Sang-won trembled with a strange joy at the thought.</span></p><br/><p><span style=\"\"> \"Then let’s get started right away. It seems like the dealer isn’t feeling well, so I will deal the hands.”</span></p><br/><p><span style=\"\"> Tae-hyuk greeted Kim Shin-hyeong, who he would be playing a big game with from now on.</span></p><br/><p><span style=\"\"> “Please take care of me, Ajusshi.”</span></p><br/><p><span style=\"\"> \"Play well, child.”</span></p><br/><p><span style=\"\"> Kim Shin-hyeong’s eyes were different from the other card cheats that Tae-hyuk had met so far. </span>He seemed to relax after seeing Tae-hyuk’s appearance.</p><br/><p><span style=\"\"> ‘He has the eyes of a lion about to catch a rabbit.’</span></p><br/><p><span style=\"\"> Tae-hyuk licked his lips.</span></p><br/><p><span style=\"\"> Until now, it was just a simple massacre.</span></p><br/><p><span style=\"\"> The game right now could be called the beginning of the fight. </span></p><br/><p>The Seven Card Stud Poker game progressed quickly until the third hand. Tae-hyuk smoothly received the cards.</p><br/><p><span style=\"\"> He had three cards in his hand, a pair of 7s and one Ace. </span>In this situation, it was natural to open with the Ace and hide the pair. However he didn’t do just that. On the next turn, if he got an Ace and got two pairs, then it would be difficult to raise the pot. Tae-hyuk didn’t hesitate to reveal one of the 7s.</p><br/><p><span style=\"\"> His eyes drifted over to Kim Shin-hyeong’s hands. </span>The latter had revealed a 2 earlier than Tae-hyuk, so it was likely that he was in the same situation as Tae-hyuk. He was probably holding either an Ace, King, or Queen in his hand, and had only revealed one of the pair of 2s. Tae-hyuk guessed that he was probably aiming for a higher two pair.</p><br/><p><span style=\"\"> Even so, it was too early in the hand to confidently say so. It was almost at the same time that he received the cards. </span>No matter how skilled a card cheat Kim Shin-hyeong was, it wasn’t a judgement that could be made quickly.</p><br/><p><span style=\"\"> Did he have a triple 2? </span>Or, he might be making a bluff.</p><br/><p><span style=\"\"> Tae-hyuk frowned. </span>The opening hand alone could cause a psychological warfare. This was what the top-ranking professional gamblers were all about.</p><br/><p><span style=\"\"> 'Can I accept it as an acknowledgment of my abilities? Then, I am sorry, as I can see all of his cards.’</span></p><br/><p><span style=\"\"> Tae-hyuk manipulated the Demon Revealing Mirror and used the ‘Spying’ skill. </span>The cards that Kim Shin-hyeong currently had appeared on the mirror.</p><br/><p><span style=\"\"> ‘It is also a pair of 2s.’</span></p><br/><p><span style=\"\"> The hand wasn’t that special, so he was probably trying to make it seem like a triple. </span>Kim Shin-hyeong must have skills if Han Sang-won was so confident in bringing him to the table. Then Kim Shin-hyeong drew two successive 2s and took the victory.</p><br/><p><span style=\"\"> Tae-hyuk's first defeat.</span></p><br/><p><span style=\"\"> Color started to return to Han Sang-won’s face. </span>Tae-hyuk wasn’t as good as he thought. Just as he was thinking this,</p><br/><p><span style=\"\"> \"Let’s start the next hand.”</span></p><br/><p><span style=\"\"> After that, Tae-hyuk kept on forfeiting. That’s how overwhelming Kim Shin-hyeong’s hands were. </span>It was like his clothes were becoming wet with rain.</p><br/><p><span style=\"\"> In no time, 50 million won of Tae-hyuk’s money had disappeared. </span>The power of the default three million won bet was bigger than he thought.</p><br/><p><span style=\"\"> Han Sang-won’s expression kept getting brighter and brighter. </span>Now, the only thing left was to take away everything Tae-hyuk had left.</p><br/><p><span style=\"\"> He quietly issued new instructions to Kim Shin-hyeong.</span></p><br/><p><span style=\"\"> Tae-hyuk looked at the cards in his hand. </span>A triple Ace had come on the fourth turn.</p><br/><p><span style=\"\"> Compared to that, Kim Shin-hyeong just had random cards. It seemed like the best he could get was a pair.</span></p><br/><p><span style=\"\"> ‘It is a trick to make me think that I have good luck.’</span></p><br/><p><span style=\"\"> Tae-hyuk grasped Han Sang-won’s plan at a glance. </span>This could determine victory. Tae-hyuk couldn’t avoid the game.</p><br/><p><span style=\"\"> “I will go half.”</span></p><br/><p><span style=\"\"> \"Uh huh. This kid is good. Still, I’m pretty tough. I will take it on. Call.”</span></p><br/><p><span style=\"\"> The stakes on the table had become 30 million won.</span></p><br/><p><span style=\"\"> On the sixth card, Tae-hyuk received another Ace and completed the four of a kind. </span>Tae-hyuk had two Aces in front of him. It was a hand that he could bet all of his possessions on.</p><br/><p><span style=\"\"> Kim Shin-hyeong had a 3, 10 and 4 exposed. </span>Because the pattern of the 3 and 4 were the same, there was the possibility of a straight flush. However, for that to happen, all his hidden cards had to be a hit.</p><br/><p><span style=\"\"> The probably was like winning the lotto. </span>In a situation where only the last hidden card remained, Tae-hyuk confirmed his hand through Spying.</p><br/><p><span style=\"\"> ‘The 5 and 6 of spades... It is also a straight flush.’</span></p><br/><p><span style=\"\"> However, the hidden card had to be a 2 or 7 of spades.</span></p><br/><p><span style=\"\"> Kim Shin-hyeong said.</span></p><br/><p><span style=\"\"> \"In fact, I still haven’t completed my hand. Based on the showing cards though, you should have at least a triple. I will bet everything on the last hidden card and declare all-in.”</span></p><br/><p><span style=\"\"> He declared all-in before receiving the hidden card. </span>If Tae-hyuk accepted it, then the two people’s hands would be revealed and the hidden cards drawn.</p><br/><p><span style=\"\"> Tae-hyuk bet 150 million won. With the 150 million won that Han Sang-won had prepared, the pot added up to a total of 300 million won. </span>If he died here, then he would lose 30 million won. However, if he accepted then he would win 300 million won and would be a big winner.</p><br/><p><span style=\"\"> Obviously, Tae-hyuk was in a favourable situation. </span>Tae-hyuk already had four of a kind. On the other hand, Kim Shin-hyeong had to draw one of two cards to complete his hand.</p><br/><p><span style=\"\"> Tae-hyuk immediately answered like it was a no-brainer.</span></p><br/><p><span style=\"\"> “Call.”</span></p><br/><p><span style=\"\"> \"Hahahaha! Your face hasn’t changed despite possibly winning 300 million. It really is amazing. You have guts. I will pull out the last hidden card.”</span></p><br/><p><span style=\"\"> Tae-hyuk said.</span></p><br/><p><span style=\"\"> \"Wait a minute. I don’t know what type of trick you might use, so put the card on the table. I will check the card first.”</span></p><br/><p><span style=\"\"> Kim Shin-hyeong declared.</span></p><br/><p><span style=\"\"> \"It doesn’t matter.\"</span></p><br/><p><span style=\"\"> Han Sang-won chuckled from where he was watching.</span></p><br/><p><span style=\"\"> \"Hahaha! Guest-nim! Surely you don’t think there will be a trick at the end? I heard that Guest-nim also enjoys tricks. Won’t you win even if you don’t use it? Uhahahahaha! Let’s see what will happen!”</span></p><br/><p><span style=\"\"> In the end, their two hands were revealed. </span>Kim Shin-hyeong had an unfinished hand, and needed to pull out a 2 or 7 of spades. Meanwhile, Tae-hyuk already had the Ace card that completed his hand.</p><br/><p><span style=\"\"> Tae-hyuk pulled a card to stop any cheating and laid it out on the table. </span>Kim Shin-hyeong then pulled out the next one on top and turned it over.</p><br/><p><span style=\"\"> It was a 7 of spades! </span>Kim Shin-hyeong completed the straight flush.</p><br/><p><span style=\"\"> Han Sang-won started to laugh as he saw it.</span></p><br/><p><span style=\"\"> \"Bravo! As expected of Kim Shin-hyeong! Truly great to watch! Guest-nim, I’m truly sorry. This game seems to be our victory!”</span></p><br/><p><span style=\"\"> Han Sang-won tried to gather the 300 million won that was piled on the table.</span></p><br/><p><span style=\"\"> However, Tae-hyuk reached out and obstructed his actions.</span></p><br/><p><span style=\"\"> “What? It’s surely over. What is this? Do you want to do this? Try it, you fucker!”</span></p><br/><p><span style=\"\"> \"No. I haven’t drawn my hidden card yet. The game isn’t over.”</span></p><br/><p><span style=\"\"> \"Kuhahahaha! What is this? Guest-nim! Your hand is a four of a kind! Four, of, a, kind! It has already been completed! Are you trying to draw a card to make a royal straight flush or something?”</span></p><br/><p><span style=\"\"> \"That still remains to be seen, so I’ll pull a card anyway.”</span></p><br/><p><span style=\"\"> \"Just try it! Even you can’t win, unless you are a god!”</span></p><br/><p><span style=\"\"> Tae-hyuk said.</span></p><br/><p><span style=\"\"> “A god. The god of gambling. I have something similar. Then I will choose my hidden card.”</span></p><br/><p><span style=\"\"> Tae-hyuk pulled out a card and turned it over.</span></p><br/><p><span style=\"\"> Then, he said.</span></p><br/><p><span style=\"\"> \"That reminds me, poker only uses 52 out of the 54 cards right? The two remaining ones are pitiful, so I mixed them in.”</span></p><br/><p><span style=\"\"> He pulled out a card from his sleeve.</span></p><br/><p><span style=\"\"> “......”</span></p><br/><p><span style=\"\"> Tae-hyuk had chosen the joker card. </span>It was a card with the potential to be anything.</p><br/><p><span style=\"\"> \"I will turn the joker into an ace. My hand will now have five aces, becoming the strongest hand. I think it is my victory.”</span></p><br/><p><span style=\"\"> “T-This bastard! Playing a prank...!”</span></p><br/><p><span style=\"\"> Han Sang-won cried out with agitation.</span></p><br/><p><span style=\"\"> \"Don’t think you can play around like this! Everybody, come in and pull out this crazy brat!”</span></p><br/><p><span style=\"\"> Tae-hyuk shrugged.</span></p><br/><p><span style=\"\"> Then he said.</span></p><br/><p><span style=\"\"> \"In fact, I already knew. It wouldn’t even matter if I won 300 million, or even three billion. Han Sang-won wouldn’t ever give me that money.”</span></p><br/><p><span style=\"\"> \"Of course! You are crazy if you think I will give money to you! Fuck. Do you have eyes? Are you looking down on me? I will throw you into the ocean today. Shit! What are they doing? Come in and drag this kid out!”</span></p><br/><p><span style=\"\"> However, no one replied to his calls.</span></p><br/><p><span style=\"\"> \"There is one thing. I definitely came with Detective Park Jung-bae, but what is he doing right now?”</span></p><br/><p><span style=\"\"> “... He went to rest after becoming drunk... Wait a minute. Perhaps...!”</span></p><br/><p><span style=\"\"> Tae-hyuk laughed.</span></p><br/><p><span style=\"\"> \"You were so focused on the game that you didn’t even hear the fuss outside.”</span></p><br/><p><span style=\"\"> “......”</span></p><br/><p><span style=\"\"> “It seems that I should be the one say checkmate.”</span></p><br/>\n</div>"}