{"title": "Chapter 49: The Familys Condition #5", "id": 49, "volume": 1, "url": "http://boxnovel.org/god-of-crime-chapter-49-the-familys-condition-5", "volume_title": "Volume 1", "body": "<h1>Chapter 49: The Familys Condition #5</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span style=\"\">Chapter 49: The Family’s Condition #5</span></p><br/><p><span style=\"\">Tae-hyuk circled around the Death Circus and explained each of the attractions to An Eun-jeong one by one. </span><span style=\"\">The rules of the death game, spoken in a calm and cool voice, were imprinted into Eun-jeong’s head.</span></p><br/><p><span style=\"\">The next place that they arrived at was a pool filled with water up to the knees.</span></p><br/><p><span style=\"\">\"There is a cylindrical shaped cushion floating on the water. Perhaps this is an attraction where we have to make it to the other side.”</span></p><br/><p><span style=\"\">“......”</span></p><br/><p><span style=\"\">Tae-hyuk approached the sign and said.</span></p><br/><p><span style=\"\">\"If successful, we will be awarded 30 million won. By the way, the liquid underneath is hydrochloric acid. If a person slips, then their bones will melt. But the worst thing is that the hydrochloric acid isn’t very deep. It isn’t enough to cause instant death. You will have to endure a few minutes where your feet is melting. The name of the attraction is the Bridge of Pain... Doesn’t the name really match?”</span></p><br/><p><span style=\"\">It was a method that frequently appeared on TV entertainment programs. </span><span style=\"\">The red stain spreading in the hydrochloric acid looked like strawberry syrup. </span><span style=\"\">There was also a lump floating in one corner. </span><span style=\"\">Tae-hyuk spoke as he pointed to it.</span></p><br/><p><span style=\"\">\"It seems like one challenger has already failed. Still, I think that this attraction has a better return on time than others. We are wasting money by just looking around. Why don’t you try it?”</span></p><br/><p><span style=\"\">\"I-I-I can’t! How can I do that?”</span></p><br/><p><span style=\"\">Other attractions would only cause a loss of money if they failed. </span><span style=\"\">Even it it hurt, there wasn’t a 100% chance of dying. </span><span style=\"\">However, the Bridge of Pain would cause death if she didn’t recover instantly. </span><span style=\"\">Furthermore, the appearance of the red syrup and lump of flesh turned her off from the attraction.</span></p><br/><p><span style=\"\">30 million won could only be obtained from taking such risks. </span><span style=\"\">Tae-hyuk was reminded of entertainment programs again. </span><span style=\"\">An obstacle was placed on an ordinary pool and the contestant had to cross to the other side. </span><span style=\"\">If the contestant fell, then they would only get wet.</span></p><br/><p><span style=\"\">Even so, the success rate wasn’t that high. </span><span style=\"\">Among them, the most difficult thing to run on was a cylinder. </span><span style=\"\">In other forms, they could grab onto the cushion if they lost their balance and fell. </span><span style=\"\">However, the cylindrical cushion was different. They would literally turn over and hit the water.</span></p><br/><p><span style=\"\">Falling meant death. </span><span style=\"\">It was hard to take one step in this situation, even if the person was strong. </span><span style=\"\">Moreover, this wasn’t the end.</span></p><br/><p><span style=\"\">Tae-hyuk looked at the large fan that was installed in the middle of the pool. </span><span style=\"\">It was off now, but it was ready to operate at any time.</span></p><br/><p><span style=\"\">'In the first place, the Bridge of Pain is an attraction that can never be cleared.’</span></p><br/><p><span style=\"\">After seeing one failure, there wouldn’t be anyone who could easily challenge this.</span></p><br/><p><span style=\"\">Tae-hyuk knew how Kim Joon-young would take advantage of this. </span><span style=\"\">The Death Circus had a closing time. </span><span style=\"\">At that time, those who collected close to the amount of escape might rarely come out. </span><span style=\"\">If they collected 20~30 million won each time, then they would eventually get 200 million won.</span></p><br/><p><span style=\"\">However, there wasn’t enough time to play the games. </span><span style=\"\">Then this bridge would become the temptation for them to get enough money for freedom. </span><span style=\"\">Of course, it was just like a gun loaded with bullets. </span><span style=\"\">The participants inevitably put their feet on the bridge, and once they started crossing...</span></p><br/><p><span style=\"\">The result was that more strawberry syrup would be added to the pool.</span></p><br/><p><span style=\"\">“Then let’s go to the next attraction.”</span></p><br/><p><span style=\"\">An Eun-jeong grabbed Tae-hyuk’s collar as he walked forward. </span><span style=\"\">She couldn’t speak properly after such a great shock.</span></p><br/><p><span style=\"\">“I-I-I’m so...rry.  T-Take a break for a moment...”</span></p><br/><p><span style=\"\">\"There is still a lot to see. Time is also money. As you can see, most of the attractions engender conflict between people. It is better to move as much as possible.”</span></p><br/><p><span style=\"\">There was no time to waste. </span><span style=\"\">An Eun-jeong replied in a squeamish voice.</span></p><br/><p><span style=\"\">“…I can barely move. 10 minutes... no, just five minutes.”</span></p><br/><p><span style=\"\">\"Then we will take a break for five minutes and look around again.”</span></p><br/><p><span style=\"\">He saw a place where they could take a break. </span><span style=\"\">There were chairs and a table. </span><span style=\"\">Next to it was a vending machine.</span></p><br/><p><span style=\"\">\"I-I’ll get a drink...”</span></p><br/><p><span style=\"\">\"I would strongly recommend that you don’t drink anything here, despite being thirsty. Devices are prepared. There is a possibility that you might ingest something strange.”</span></p><br/><p><span style=\"\">Eun-jeong bit her lip. </span><span style=\"\">She remembered the tea and sweets she ate before coming here.</span></p><br/><p><span style=\"\">\"Then what I ate...”</span></p><br/><p><span style=\"\">\"Well. It is possible. But you were the one who made the choice. I guess this is the big price you have to pay.”</span></p><br/><p><span style=\"\">“......”</span></p><br/><p><span style=\"\">Eun-jeong couldn’t answer and looked down at the table. </span><span style=\"\">A small sob was heard. </span><span style=\"\">Tae-hyuk looked at the crying Eun-jeong with cold eyes.</span></p><br/><p><span style=\"\">She was the one who would drive Ha-ran to ruin. </span><span style=\"\">Of course, it was also due to the bad multilevel company Tiwai International and the Death Circus organized by Producer Kim Joon-young. </span><span style=\"\">However, this didn’t mean that An Eun-jeong’s sins had disappeared. </span><span style=\"\">She had already pulled several people into the multilevel company.</span></p><br/><p><span style=\"\">If he had to say some harsh words... </span><span style=\"\">Every person needed to be accountable for their choices. </span><span style=\"\">An Eun-jeong had signed up for the Death Circus, and now she was paying for it. </span><span style=\"\">But she still had something left. </span><span style=\"\">The sin of bringing in innocent people to the multilevel scheme. </span><span style=\"\">It was something that couldn’t be easily repaid.</span></p><br/><p><span style=\"\">\"Noona should know how many people suffered from her mistakes. How many people did you bring into this company? They will all meet ends like this.”</span></p><br/><p><span style=\"\">\"...I-I'm sorry. I am really sorry.”</span></p><br/><p><span style=\"\">An Eun-jeong couldn’t raise her head and started to apologize.</span></p><br/><p><span style=\"\">He lost his appetite. </span><span style=\"\">She was the enemy who drove Seo Ha-ran to ruin. </span><span style=\"\">He would rather hate her and act like she was a criminal, but that wasn’t the case.</span></p><br/><p><span style=\"\">She was also a victim of the system. </span><span style=\"\">He couldn’t forgive her but he decided not to blame her.</span></p><br/><p><span style=\"\">Tae-hyuk wanted to confirm one thing with Eun-jeong. </span><span style=\"\">It was the reason why she had joined Tiwai International.</span></p><br/><p><span style=\"\">\"By the way, why did you need so much money?”</span></p><br/><p><span style=\"\">An Eun-jeong was lost in thought for a moment and didn’t say anything. </span><span style=\"\">Then all of a sudden, she started talking.</span></p><br/><p><span style=\"\">\"I have a younger sister and there is a distinct gap between us. I prefer to play around without much interest in studying, while she is an example of a perfect student. She always got first place since elementary school.”</span></p><br/><p><span style=\"\">She had a younger sister who was a model student. </span><span style=\"\">An Eun-jeong had a huge inferiority complex towards her sister.</span></p><br/><p><span style=\"\">\"My dad told me to marry quickly since I can’t do anything else. He engaged me to a promising doctor... In the end, I couldn’t bear it, so I ran away. But... But... I found out that my mother had leukemia. I wanted to be recognized. I wanted her to be proud of her daughter at least once before she died. Not the stupid daughter who ran away...”</span></p><br/><p><span style=\"\">Eun-jeong’s voice trailed off and she slowly started to cry.</span></p><br/><p><span style=\"\">Tae-hyuk said.</span></p><br/><p><span style=\"\">“Eun-jeong wanted to be recognized as family?”</span></p><br/><p><span style=\"\">“Yes....”</span></p><br/><p><span style=\"\">\"Then I’m sorry. They seem to think a little differently.”</span></p><br/><p><span style=\"\">“......”</span></p><br/><p><span style=\"\">Eun-jeong lowered her face with a really pained expression. </span><span style=\"\">However, Tae-hyuk’s words didn’t end there.</span></p><br/><p><span style=\"\">\"In fact, I came here as a favor to someone.</span></p><br/><p><span style=\"\">\"F-Favour?”</span></p><br/><p><span style=\"\">“Yes. Someone asked me to rescue Eun-jeong from here.”</span></p><br/><p><span style=\"\">“W-Who...?”</span></p><br/><p><span style=\"\">\"To be exact, it was your younger sister.”</span></p><br/><p><span style=\"\">Eun-jeong’s eyes widened as she realized who sent Tae-hyuk to this place.</span></p><br/><p><span style=\"\">\"The conditions for being a family? Is there such a thing? It doesn’t matter how wrong you were, nor how bad you are now. You are still family. Stop being a fool and come back soon.\"</span></p><br/><p><span style=\"\">“Ah...!”</span></p><br/><p><span style=\"\">An Eun-jeong sighed. </span><span style=\"\">Then she muttered in a low voice.</span></p><br/><p><span style=\"\">\"Eun-young... I’m sorry...”</span></p><br/><p><span style=\"\">‘Is the shock therapy over?’</span></p><br/><p><span style=\"\">Tae-hyuk sighed and patted Eun-jeong’s hair. </span><span style=\"\">What would she look like if her sister was actually in front of her? </span><span style=\"\">He tried to imagine such a ridiculous thing, but it wasn’t over yet. </span><span style=\"\">No, rather, it was starting now.</span></p><br/><p><span style=\"\">\"The melodrama has now ended. Anyway, so far we’ve looked at roughly 70% of the attractions. You must have come to the conclusion that you can’t get out of here.”</span></p><br/><p><span style=\"\">“...Yes.”</span></p><br/><p><span style=\"\">\"This is just like human chess. If you lose, then you will lose a corresponding body part. If you are lucky and win consecutively, you’ll only lose an arm or an eye. You don’t want to leave here like that.”</span></p><br/><p><span style=\"\">\"Then what can I do?”</span></p><br/><p><span style=\"\">\"From now on, Eun-jeong will have to entrust me with your money and life. If you don’t like it, then you can move on your own.”</span></p><br/><p><span style=\"\">An Eun-jeong bit her lip. </span><span style=\"\">It was a proposal that wasn’t easy to accept.</span></p><br/><p><span style=\"\">\"But what is your relationship with my younger sister?”</span></p><br/><p><span style=\"\">\"Well. She was gracious enough to change my fate. That is all I will tell you.”</span></p><br/><p><span style=\"\">He had become a model student because of An Eun-young.</span></p><br/><p><span style=\"\">Eun-jeong fell deep into thought. </span><span style=\"\">She seemed to be debating on whether she should believe the stranger in front of her or not.</span></p><br/><p><span style=\"\">Tae-hyuk waited until she answered. </span><span style=\"\">If the proposal was accepted then she would become a chess piece that could be used at will.</span></p><br/><p><span style=\"\">“Yes. I accept. I’ll give you everything. So... Please take me to my sister.”</span></p><br/><p><span style=\"\">\"Then the contract is established.”</span></p><br/><p><span style=\"\">\"But is there a way to get out of here?”</span></p><br/><p><span style=\"\">Tae-hyuk laughed and started to slowly explain his plans. </span><span style=\"\">An Eun-jeong’s eyes opened wider as she listened to his words.</span></p><br/><p><span style=\"\">\"T-That isn’t possible!”</span></p><br/><p><span style=\"\">It was really ridiculous.</span></p><br/><p><span style=\"\">@</span></p><br/><p><span style=\"\">Cha Soo-hyun was looking around the Death Circus.</span></p><br/><p><span style=\"\">He understood the rules of this place better than any other participant.</span></p><br/><p><span style=\"\">A variety of attractions existed. </span><span style=\"\">However, there were two major types. </span><span style=\"\">Apart from completing some missions with given conditions, there was the PvP format where two people competed to take the opponent’s money. </span><span style=\"\">Of course, there was a high percentage of the latter. </span><span style=\"\">In particular, the missions were fatal if there was even a small error. Only fools would be deceived by such things.</span></p><br/><p><span style=\"\">Cha Soo-hyun was a survivor, despite the survival rate being close to zero. </span><span style=\"\">He received a platinum membership card, but he wasn’t satisfied with it. </span><span style=\"\">He had realized the pleasure of killing others.</span></p><br/><p><span style=\"\">It couldn’t be done outside. </span><span style=\"\">However, it was possible here. </span><span style=\"\">In addition, he could also get extra income. </span><span style=\"\">He could earn more than 200 million overnight.</span></p><br/><p><span style=\"\">This was already the third time that Cha Soo-hyun had participated in the Death Circus. </span><span style=\"\">Of course, he had to change his face by using a simple cosmetic surgery, because he couldn’t reveal his identity. </span><span style=\"\">Only a few in Tiwai were aware of this fact.</span></p><br/><p><span style=\"\">He would kill 10 people tonight. </span><span style=\"\">Their lives would be worth 500 million.</span></p><br/><p><span style=\"\">Cha Soo-hyun had already eaten two people. </span><span style=\"\">Now he had to find the next prey.</span></p><br/><p><span style=\"\">Then he found some cute rabbits hiding near the Bridge of Pain.</span></p><br/><p><span style=\"\">‘A man and a woman.’</span></p><br/><p><span style=\"\">The woman looked like she would be a tasty kill. </span><span style=\"\">In addition, they seemed scared to challenge the attractions.</span></p><br/><p><span style=\"\">'Well, the man...’</span></p><br/><p><span style=\"\">Was he in his early 20s? </span><span style=\"\">He had bushy hair and a leather jacket. He seemed like a neighbourhood bum.</span></p><br/><p><span style=\"\">Looking at the nameplate on their chests, he was surprised to see that both of them had stayed above 50 million won.</span></p><br/><p><span style=\"\">Cha Soo-hyun licked his lips. </span><span style=\"\">Then he approached them with a face that was as innocent as possible.</span></p><br/><p><span style=\"\">\"This is too much. It really is a crazy game... I don’t think I was in my right mind.”</span></p><br/><p><span style=\"\">\"Who are you?\"</span></p><br/><p><span style=\"\">The woman asked. The man just yawned with a blank face.</span></p><br/><p><span style=\"\">\"Oh, I am Cha Soo-hyun. Haven’t you tried any of the attractions yet?”</span></p><br/><p><span style=\"\">“Yes... So what?”</span></p><br/><p><span style=\"\">\"I was looking for someone like that. I know a strategy where three people can win more than 50 million won. How about it? Do you want to cooperate and survive this crazy game?”</span></p><br/><p><span style=\"\">The woman tilted her head with confusion. Her expression was unsure. </span><span style=\"\">Then the yawning man opened his mouth.</span></p><br/><p><span style=\"\">\"Sheesh. I guess so.”</span></p><br/><p><span style=\"\">It seemed like this man was the one who made the decisions.</span></p><br/><p><span style=\"\">“Really? It’s a surefire win. Really appetizing.”</span></p><br/><p><span style=\"\">Cha Soo-hyun laughed.</span></p><br/><p><span style=\"\">The opponent was already halfway there. </span><span style=\"\">Now all he had to do was eat.</span></p><br/>\n</div>"}