{"title": "Chapter 40 - Aid #4", "id": 40, "volume": 1, "url": "http://boxnovel.org/god-of-crime-chapter-40-aid-4", "volume_title": "Volume 1", "body": "<h1>Chapter 40 - Aid #4</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span style=\"\">Chapter 40 - Aid #4</span></p><br/><p><span style=\"\"> The serial killer called the Hippo.</span></p><br/><p><span style=\"\"> Tae-hyuk thought of Yoo Cheol-ho while he was eating.</span></p><br/><p><span style=\"\"> ‘I was very lucky.’</span></p><br/><p><span style=\"\"> It was only three months ago.</span></p><br/><p><span style=\"\"> The events from back then felt like a long time ago, causing Tae-hyuk to sigh. </span>He woke up with memories of the future, and received the crime skills.</p><br/><p><span style=\"\"> He pretended to be as calm as possible, but that was just a facade.</span></p><br/><p><span style=\"\"> ‘Hyung bought me some ice cream, but I only ate a little bit of it before throwing it away.’ </span></p><br/><p><span style=\"\"> At that time, his only crime skill was the ‘Robbery’ skill. At the time, he still had no idea about his abilities and titles. </span>If Tae-hyuk had come across the Hippo at that time, then he wouldn’t have even a single thought about catching him.</p><br/><p><span style=\"\"> However, Yoo Cheol-ho was so infamous that he appeared on the front page of the newspapers every single day. </span>Every single person knew his face. Tae-hyuk could catch him just by knowing his hiding place and reporting it to the police.</p><br/><p><span style=\"\"> ‘The Hippo is different.’</span></p><br/><p><span style=\"\"> Only two people in this world knew his identity. </span>The Hippo, who was the killer. The other person was Seo Tae-hyuk, who had memories of the future.</p><br/><p><span style=\"\"> The police saw the Hippo as a serial killer, and created a dedicated team to catch the criminal. </span>Tae-hyuk could see how Cho Kang-suk was desperately working every night.</p><br/><p><span style=\"\"> Surprisingly, the arrest rate of criminals in South Korea was quite high. By default, the country’s size was small, so there weren’t many places to hide. </span>The fact that every person’s fingerprints were stored as data was a tremendous advantage in investigations. The CCTV were well spread out and installed in buildings, so it was a difficult country to commit a crime in.</p><br/><p><span style=\"\"> South Korea also had a high awareness of the world of scientific investigation, so they used advanced investigation techniques during crime investigations.</span></p><br/><p><span style=\"\"> A blood smear expert could reconstruct a crime scene based on only the location and size of a blood drop. </span>A fingerprint expert used fingerprints, as well as palm prints. There were even profiling experts who approximated the criminal’s psychological state of mind.</p><br/><p><span style=\"\"> They used more advanced investigation methods than the past method of searching around the victim’s body.</span></p><br/><p><span style=\"\"> In the case of accidental murders, most perpetrators were quickly caught. </span>However, it was difficult to identify a serial killer who killed indiscriminately.</p><br/><p><span style=\"\"> Thus, the scientific investigation methods were a tremendous aid. </span>No matter how perfect a criminal was, there was no incident where they didn’t make a single mistake.</p><br/><p><span style=\"\"> One common mistake was drinking from a cup or paper cup, then throwing it away. </span>Others included: Leaving even one strand of hair behind at the crime scene, and unintentionally spitting and leaving saliva. Experts could even extract the DNA of the criminal from fingerprints or saliva left behind on the victim’s body.</p><br/><p><span style=\"\"> There was no killer that didn’t leave behind a trail of evidence. </span>However, unlike his ridiculous nickname, the Hippo was a perfect killer. He didn’t leave behind any evidence.</p><br/><p><span style=\"\"> It was why the investigation gradually became a labyrinth. </span>That was why there were rumours that a demon was killing people.</p><br/><p><span style=\"\"> ‘... The Hippo will kill 10 people over the next year. His modus operandi will also remain the same. Feeding the victim a great deal of salt water. Why on earth has he started his activities earlier than scheduled? I need to strengthen my crime skills and help Kang-suk hyung’s and Noona’s love affair.’</span></p><br/><p><span style=\"\"> Tae-hyuk was completely different from when he first caught Yoo Cheol-ho.</span></p><br/><p><span style=\"\">He now had the ‘Robbery’, ‘Voice Modulation’, ‘Spying’, ‘Forgery’, ‘Gambling’, and ‘Violence’ skills, making a total of six crime skills.</span></p><br/><p><span style=\"\"> Thanks to An Eun-young’s studying skill, his intelligence stat rose greatly. </span>He could also make a wide variety of props using the Forgery skill.</p><br/><p><span style=\"\"> It was different from when he was forced to call the police for Yoo Cheol-ho. </span>He could fight the Hippo.</p><br/><p><span style=\"\"> Tae-hyuk intuitively sensed it. </span>Until now, he had used a single crime skill at a time in order to catch the criminals. It was a condition for acquiring the skill.</p><br/><p><span style=\"\"> “But this time, I can’t afford to not use all of my skills.”</span></p><br/><p><span style=\"\"> This time, he would have to use all six crime skills in order to deal with the Hippo. </span>That was his hunch.</p><br/><p><span style=\"\"> Tae-hyuk looked in front at the things that he had prepared. </span>Paints, plaster boards, ropes and glass beads. There were many other things piled up.</p><br/><p><span style=\"\"> He put them in a big bag, and thanks to his stamina (61), Tae-hyuk was able to carry it. </span>He raised it up and over his shoulders.</p><br/><p><span style=\"\"> “Ugh. Heavy!”</span></p><br/><p><span style=\"\"> However, every one of the items inside were necessary things that couldn’t be removed. </span>From this moment on, he would go prepare the trap to catch the Hippo before he murdered someone tomorrow.</p><br/><p><span style=\"\"> Obviously the victim...</span></p><br/><p><span style=\"\"> \"......!\"</span></p><br/><p><span style=\"\"> Tae-hyuk moaned as a fact suddenly rose in his head.</span></p><br/><p><span style=\"\"> He suddenly recalled the name of the third victim killed by the Hippo. </span>Of course, that didn’t mean anything would change, since they were alive today. The victim wouldn’t believe it even if he said anything.</p><br/><p><span style=\"\"> Above all, he had to prepare the crime scene to catch the Hippo. </span>Therefore, he had to let the crime of kidnapping the victim be committed.</p><br/><p><span style=\"\"> But the person the Hippo hoped to kill tomorrow was someone who Tae-hyuk knew.</span></p><br/><p><span style=\"\"> “... Jung Yuri.”</span></p><br/><p><span style=\"\"> Tae-hyuk realized why Jung Yuri wasn’t in his memories. </span>He had gotten a job as a security guard at Sungjin Group five years later. At that time, Jung Yuri wasn’t alive.</p><br/><p><span style=\"\"> She was supposed to die tomorrow to the Hippo. </span>Savagely murdered.</p><br/><p><span style=\"\"> Tae-hyuk didn’t do anything for a while before opening the window and looking up at the night sky. </span>The moon was almost full, but it was covered by the dark clouds so nothing could be seen. There was just darkness.</p><br/><p>@</p><br/><p><span style=\"\">Jung Yuri’s legs didn’t work. </span><span style=\"\">She had been weak from birth. </span>The muscles of her lower half slowly stiffened.</p><br/><p><span style=\"\"> Nevertheless, she never once thought that her life was difficult or uncomfortable. </span>She had a sister who was born a year earlier. The two of them were always together.</p><br/><p><span style=\"\"> By the time she entered primary school, Jung Yuri’s legs were no longer moving. </span>She had to ride a wheelchair from then on.</p><br/><p><span style=\"\"> It was her sister who pushed it. </span>Her sister always helped her move forward.</p><br/><p><span style=\"\"> “Unni...”</span></p><br/><p><span style=\"\"> Her sister had died three years ago. </span>She was brutally murdered at the hands of the serial killer, Yoo Cheol-ho.</p><br/><p>When Yuri met him, he smiled and felt regret that he couldn’t kill her. Yuri spat on Yoo Cheol-ho’s face, and he said,</p><br/><p><span style=\"\"> “Kuhuhuhu... Just wait. I will be sure to escape and kill you.\"</span></p><br/><p><span style=\"\"> Yoo Cheol-ho really did escape. </span>She still had goosebumps when she thought of that time.</p><br/><p><span style=\"\"> However, she was different from her sister. </span>Jung Yuri’s father was now the vice president of a large company. She was also working under him, so she was able to set an enormous bounty on Yoo Cheol-ho.</p><br/><p><span style=\"\"> A few days later, he was caught. This time, he was trapped in a place where he could never escape.</span></p><br/><p><span style=\"\"> “Hu...”</span></p><br/><p><span style=\"\"> Her whole body was wet with sweat from pushing her wheelchair. </span>Jung Yuri pulled out a handkerchief from her handbag and wiped her forehead.</p><br/><p><span style=\"\"> She was on the way back from a meeting with a client. </span>The driver said he would give her a ride, but Jung Yuri said that she wanted to go on her own.</p><br/><p><span style=\"\"> No one had pushed her since her sister had died. </span>Now, she moved forward with her own strength.</p><br/><p><span style=\"\"> She desperately exercised and raised her physical strength, her complexion improving dramatically. </span>She became more beautiful every day. She even received suggestions to become an advertising model.</p><br/><p><span style=\"\"> “Ahum... This will be difficult.”</span></p><br/><p><span style=\"\"> Jung Yuri looked at the hill that appeared in front of her. It was a moderately steep slope.</span></p><br/><p><span style=\"\"> However, she vowed to live strong after her sister’s death. </span>Jung Yuri prepared to put her hands on the wheels of her wheelchair.</p><br/><p><span style=\"\"> It was at that moment that someone started to push the wheelchair from behind. </span>Jung Yuri was startled and looked back.</p><br/><p><span style=\"\"> “It will be hard on your own. If you don’t mind, then I would like to help.”</span></p><br/><p><span style=\"\"> A friendly looking man smiled at her.</span></p><br/><p><span style=\"\"> “Ahaha... Thank you. By the way, have I met you somewhere before? Your face is really familiar.”</span></p><br/><p><span style=\"\"> The man said.</span></p><br/><p><span style=\"\"> \"I was with the one who came for a bounty. Cho Kang-suk... Do you remember?”</span></p><br/><p><span style=\"\"> \"Ah, that person!”</span></p><br/><p><span style=\"\"> The man laughed.</span></p><br/><p><span style=\"\"> Then Jung Yuri was pricked in the neck.</span></p><br/><p>@</p><br/><p><span style=\"\">“Uhh...”</span></p><br/><p><span style=\"\"> In the darkness, the dazed Jung Yuri opened her eyes.</span></p><br/><p><span style=\"\"> She couldn’t see anything. </span>Her eyes were covered with leather. Her legs couldn’t move in the first place, and her arms were tied behind her back.</p><br/><p><span style=\"\"> She couldn’t do anything other than sweat.</span></p><br/><p><span style=\"\"> “Oof! Oof!”</span></p><br/><p><span style=\"\"> Her body was in a place like a glass box.</span></p><br/><p><span style=\"\"> She wriggled her toes and something cold.</span></p><br/><p><span style=\"\"> ‘Water...? I-It is filling up!’ </span></p><br/><p><span style=\"\"> She would die in this way.</span></p><br/><p><span style=\"\"> Jung Yuri recalled the man who kidnapped her. </span>It wasn’t Yoo Cheol-ho. However, he had the same eyes. It would be not just her sister, but Jung Yuri herself would also be killed by someone.</p><br/><p><span style=\"\"> Tears flowed down through the blindfold.</span></p><br/><p><span style=\"\"> 'I, am I going to die? U-Unni. S-Save me... Unni...!’</span></p><br/><p><span style=\"\"> The water had already risen to her head.</span></p><br/><p><span style=\"\"> Jung Yuri couldn’t breathe.</span></p><br/><p>@</p><br/><p><span style=\"\"> Joo Hyun-ho was drinking a cup of milk in his room.</span></p><br/><p><span style=\"\"> Classical music flowed from speakers that cost over 20 million won. </span>Chopin Etude Op.10-4, also known as ‘Chase’. It was his favorite piece.</p><br/><p><span style=\"\"> What was it? No matter how hard he thought, he felt like there was something in the corner of his mind that he was missing.</span></p><br/><p><span style=\"\"> He wondered what it was. What on earth had he missed?</span></p><br/><p><span style=\"\"> Joo Hyun-ho looked at the case file scattered across the floor. </span>Everything about the Hippo incident was written there.</p><br/><p><span style=\"\"> \"The first murder occurred on October 8th. The second happened on the 5th of November, and today is December 3rd...”</span></p><br/><p><span style=\"\"> And then suddenly...</span></p><br/><p><span style=\"\"> \"October 8th was Chuseok (Korean holiday). November 5th...”</span></p><br/><p><span style=\"\"> Chuseok always occurred on the full moon. </span>The second murder also happened on the day of the full moon.</p><br/><p><span style=\"\"> Then surely...</span></p><br/><p><span style=\"\"> Joo Hyun-ho was amazed as he had a thought. If his idea was correct, then the murderer was probably preparing for his next kill right now.</span></p><br/><p><span style=\"\"> “I-I need to call Kang-suk sunbae!”</span></p><br/><p><span style=\"\"> Joo Hyun-ho contacted Kang-suk. However, the phone call didn’t connect.</span></p><br/><p><span style=\"\"> \"Damn.”</span></p><br/><p><span style=\"\"> Joo Hyun-ho was forced to look for a place where the Hippo could commit the crime.</span></p><br/><p><span style=\"\"> He mobilized all of his connections.</span></p><br/><p><span style=\"\"> First, he sent a group text.</span></p><br/><p><span style=\"\"> -</span><i><span style=\"\">Confirm if there is a bathhouse, aquarium, or swimming pool that isn’t open and check them out!</span></i><span style=\"\"> <em>The hippo might be working right now!</em></span></p><br/><p>How far ahead was he?</p><br/><p><span style=\"\"> Joo Hyun-ho couldn’t stay in the house. </span>In the end, he put on a coat and left his house.</p><br/><p><i><span style=\"\">Ding!</span></i><i><span style=\"\">Ding!</span></i><i><span style=\"\">Ding!</span></i></p><br/><p><span style=\"\"> At that moment, the clock chimed, indicating that it was 12:00.</span></p><br/><p><span style=\"\"> December 4th. </span>It was the day that the Hippo would kill.</p><br/><p><span style=\"\"> He used the map application to look for a place with a lot of water near his house. </span>The Hippo took a long time to kill, so it should be a place that wasn’t open right now. There was only one place nearby that fit the conditions.</p><br/><p><span style=\"\"> H Aquarium.</span></p><br/><p><span style=\"\"> Joo Hyun-ho smirked. He was so thrilled that he couldn’t stand it. </span>He had always seen profiles of criminals from his desk, but this time, he might even be able to face them himself.</p><br/><p><span style=\"\"> “Sunbae... Sunbae... Pick up your phone. Let’s go hunt the Hippo.”</span></p><br/><p><span style=\"\"> As Kang-suk didn’t answer his calls, Joo Hyun-ho started the BMW.</span></p><br/><p>@</p><br/><p><span style=\"\"> Tae-hyuk looked at his work with a satisfied expression.</span></p><br/><p><span style=\"\"> He took advantage of his six crime skills to create an amazing trap.</span></p><br/><p><span style=\"\"> \"It is perfect for my guest.”</span></p><br/><p><span style=\"\"> Tae-hyuk was at the entrance of an aquarium. </span>It was a place that didn’t feel the need to employ more than one guard when it wasn’t daytime.</p><br/><p><span style=\"\"> Tae-hyuk also confirmed that the guard was sleeping in front of the TVs in the office.</span></p><br/><p><span style=\"\"> He checked the time.</span></p><br/><p><span style=\"\"> It was 12:09 a.m. on December 4th. </span></p><br/><p><span style=\"\"> The Hippo would be waiting inside the aquarium.</span></p><br/><p><i><span style=\"\">Creak.</span></i></p><br/><p><span style=\"\"> Tae-hyuk entered through the back door of H Aquarium.</span></p><br/><p><span style=\"\"> It was time to hunt the Hippo.</span></p><br/>\n</div>"}