{"title": "Chapter 45: The Familys Condition #1", "id": 45, "volume": 1, "url": "http://boxnovel.org/god-of-crime-chapter-45-the-familys-condition-1", "volume_title": "Volume 1", "body": "<h1>Chapter 45: The Familys Condition #1</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span style=\"\">Chapter 45: The Family’s Condition #1</span></p><br/><p><span style=\"\">Tae-hyuk took out the Demon Revealing Mirror in front of Big Mama’s pawn shop.</span></p><br/><p><span style=\"\">He felt tense whenever he had to meet her. </span><span style=\"\">Tae-hyuk checked his abilities every time he came here. </span><span style=\"\">He needed to know what he could do, and where it was possible. </span><span style=\"\">That way, he would have confidence while dealing with Big Mama.</span></p><br/><p><span style=\"\">After the Rosario incident, their relationship had become a type of partnership. </span><span style=\"\">However, he always had to be ready for any type of deception coming his way.</span></p><br/><p><span style=\"\">‘Then first, the crime skills...’</span></p><br/><p><span style=\"\">He tapped on the Demon Revealing Mirror and pulled up his current learned crime skills. </span><span style=\"\">Robbery, Spying, Voice Modulation, Forgery, Gambling, and Violence - all of these made up for a total of six skills. </span><span style=\"\">He also had 10 affinity points that could be used to strengthen those skills. </span><span style=\"\">Every one of them had a type of charm.</span></p><br/><p><span style=\"\">‘I’d like to raise them but I’ll save them, since I don’t know what I will need.’</span></p><br/><p><span style=\"\">Next, he confirmed his stats.</span></p><br/><p><span style=\"\">Stats: Stamina (59), Intelligence (47), Agility (24), Dexterity (39)</span></p><br/><p><span style=\"\">Tae-hyuk had used the Forgery skill quite a lot during the Hippo case. </span><span style=\"\">He also consumed an affinity point for a temporary special ability. </span><span style=\"\">His dexterity had gone up by five points. </span><span style=\"\">Three of his stats were close to the condition necessary for the upgrade. </span><span style=\"\">In the near future, he would be able to reach the second rank ‘Noble.’ </span><span style=\"\">As a Commoner, there were a lot of restraints on his abilities, so he wanted to reach the next rank sooner.</span></p><br/><p><span style=\"\">‘It is difficult with the abilities I currently possess’</span></p><br/><p><span style=\"\">Last night, Tae-hyuk had fought against the Hippo, and had to mobilize everything he had in order to win. </span><span style=\"\">The Hippo was a crazy guy, but just based on strength, he wasn’t the strongest on the blacklist.</span></p><br/><p><span style=\"\">Among the criminals he would meet in the future, there were those with superhuman abilities, or those who used bombs to kill hundreds of people. </span><span style=\"\">In addition, a pseudo-cult with thousands of followers.</span></p><br/><p><span style=\"\">Tae-hyuk would soon meet them. </span><span style=\"\">Prior to that, he should at least upgrade to the Noble rank.</span></p><br/><p><span style=\"\">‘I don’t know how much stronger a Noble is, but it should still be better than my current rank.’</span></p><br/><p><span style=\"\">Currently, he had met six people on the blacklist. </span><span style=\"\">Oddly, the counter raised, despite not causing Moonlight Flower and Big Mama to be arrested.</span></p><br/><p><span style=\"\">In the case of the Moonlight Flower, he caught Kim Sang-hyun. </span><span style=\"\">And after receiving Rosario from Big Mama, a notification had popped up on the Demon Revealing Mirror. </span><span style=\"\">It seemed like catching them wasn’t the only condition.</span></p><br/><p><span style=\"\">‘Anyway, there are 14 people left!’</span></p><br/><p><span style=\"\">To do that, he needed to maintain his close relationship with Big Mama. </span><span style=\"\">Anyway, the important thing was to find out about Park Jung-hwan’s death. </span><span style=\"\">Big Mama raised dozens of snakes in her belly. </span><span style=\"\">It was dangerous to believe everything she said.</span></p><br/><p><span style=\"\">“… Anyway, today I should clearly find out.”</span></p><br/><p><span style=\"\">Tae-hyuk firmly opened the door of the pawn shop.</span></p><br/><p><span style=\"\">“Omo. It is Tae-hyuk. Did you come for the part time job?”</span></p><br/><p><span style=\"\">Big Mama looked up and asked. </span><span style=\"\">Tae-hyuk's mouth twitched.</span></p><br/><p><span style=\"\">'Saying this after making such a bombshell announcement... Ohh. Indeed, a scary woman!’</span></p><br/><p><span style=\"\">\"Let’s continue the conversation from yesterday. I want you to give me the proper information about Park Jung-hwan.”</span></p><br/><p><span style=\"\">It was reasonable to ask after paying the information fee.</span></p><br/><p><span style=\"\">“Ohoho. Of course I’ve prepared it.”</span></p><br/><p><span style=\"\">Big Mama went into a room in her store and came out with a paper envelope.</span></p><br/><p><span style=\"\">\"Read it.”</span></p><br/><p><span style=\"\">Tae-hyuk accepted it and confirmed the contents. </span><span style=\"\">It contained everything about Park Jung-hwan: Where he was born, what school he went to, his school marks, the names of his close friends, and even the university clubs that he joined. </span><span style=\"\">It was miraculous how Big Mama managed to investigate so much.</span></p><br/><p><span style=\"\">\"It is a bit later than promised. I’m sorry so I arranged the important parts as a special service. Do you want to hear it?”</span></p><br/><p><span style=\"\">“Yes.”</span></p><br/><p><span style=\"\">\"Park Jung-hwan is a native of Gangwon-do. A so-called self made person. As you can see from the materials I prepared, he studied well and exercised hard. He was popular due to his bright personality. This style is called...”</span></p><br/><p><span style=\"\">\"Mother’s friend’s son?” (Wiki link explanation)</span></p><br/><p><span style=\"\">“Yes. He is literally the perfect image of that type. However, Park Jung-hwan had one unusual characteristic. Listen to this.”</span></p><br/><p><span style=\"\">Inside the envelope was a tape recorder. </span><span style=\"\">Tae-hyuk put the earphone into his ear and pressed the switch. </span><span style=\"\">Then he heard a conversation over a lot of noise. </span><span style=\"\">It was a conversation between a man with a deep voice and a middle-aged person.</span></p><br/><p><i><span style=\"\">-Can you tell me more about the habit of Park Jung-hwan that you mentioned before?</span></i></p><br/><p><span style=\"\">-...</span><i><span style=\"\">Yes.</span></i><i><span style=\"\">Jung-hwan has a habit.</span></i><i><span style=\"\">It can be called a type of tick?</span></i><i><span style=\"\">The sides of his mouth twitches when talking...</span></i><i><span style=\"\">Strangely, the habit doesn’t happen on test days or election days.</span></i><i><span style=\"\">Then the next day, it will occur several times in one minute...</span></i></p><br/><p><span style=\"\">Big Mama said.</span></p><br/><p><span style=\"\">“Listen to the next track.”</span></p><br/><p><span style=\"\">Tae-hyuk manipulated the tape recorder and fast forwarded through the conversation. </span><span style=\"\">This time, it was a conversation between the man with the deep voice and an elderly person.</span></p><br/><p><span style=\"\">-</span><i><span style=\"\">What do you mean, Park Jung-hwan often forgets things?</span></i></p><br/><p><span style=\"\">-</span><i><span style=\"\">So...</span></i><i><span style=\"\">He is very good at what he does.</span></i><i><span style=\"\">But after a few days, when I asked him about it again, he completely forgot what happened.</span></i><i><span style=\"\">He is already forgetful at such a young age.</span></i><i><span style=\"\">Ah, but his brain is truly great.</span></i><i><span style=\"\">He never missed being on top at school.</span></i></p><br/><p><span style=\"\">Tae-hyuk looked at Big Mama after listening.</span></p><br/><p><span style=\"\">\"Those are interviews about Park Jung-hwan.”</span></p><br/><p><span style=\"\">“Yes. All of them have known him since high school. I became aware of a shocking fact. That is... Do I need to say it?”</span></p><br/><p><span style=\"\">\"Two years ago, Park Jung-hwan died.”</span></p><br/><p><span style=\"\">“Yes. I learned of this fact by chance.”</span></p><br/><p><span style=\"\">“What exactly happened?”</span></p><br/><p><span style=\"\">Big Mama laughed and raised a finger.</span></p><br/><p><span style=\"\">“Tae-hyuk. Sorry, but the investigation is up to here. That was exactly 10 million won. If you want to know more, you have to pay extra.”</span></p><br/><p><span style=\"\">Tae-hyuk’s eyes twitched. </span><span style=\"\">He had to pay more money if he wanted to know? </span><span style=\"\">This wasn’t a three part porn ad, it was too much. </span><span style=\"\">Unfortunately, Tae-hyuk needed to know.</span></p><br/><p><span style=\"\">“... So how much more do I need to pay?”</span></p><br/><p><span style=\"\">\"This is enough.\"</span></p><br/><p><span style=\"\">Big Mama emphasized the one finger that she had raised.</span></p><br/><p><span style=\"\">\"Ten million won. Yes, I understand.”</span></p><br/><p><span style=\"\">Tae-hyuk sighed.</span></p><br/><p><span style=\"\">He was glad that he had enough money saved. </span><span style=\"\">Although it was a large amount of money, Big Mama’s investigative abilities were worth it. </span><span style=\"\">In addition, the future report would certainly be beyond imagination.</span></p><br/><p><span style=\"\">\"You set the limit too low. It is 100 million.”</span></p><br/><p><span style=\"\">“Huh? 100 million?”</span></p><br/><p><span style=\"\">\"Think of it as the information having that much value. Right?”</span></p><br/><p><span style=\"\">Tae-hyuk narrowed his eyes.</span></p><br/><p><span style=\"\">Big Mama had really great insight. </span><span style=\"\">The information about Park Jung-hwan had to be obtained, even if he needed to pay a lot of money.</span></p><br/><p><span style=\"\">\"I'm sorry, but I’ve spent the 100 million I received with Rosario.”</span></p><br/><p><span style=\"\">“Hoh. But you made some money from SY.”</span></p><br/><p><span style=\"\">Big Mama knew about it. </span><span style=\"\">However, he couldn’t do that. It was the money for Ha-ran. </span><span style=\"\">He couldn’t touch it.</span></p><br/><p><span style=\"\">\"You will have to wait a bit for the money.”</span></p><br/><p><span style=\"\">Big Mama said with a soft smile.</span></p><br/><p><span style=\"\">\"If I don’t receive the money, then there is no investigation. You should be aware of that.”</span></p><br/><p><span style=\"\">'That old lioness... !’</span></p><br/><p><span style=\"\">Tae-hyuk’s expression distorted.</span></p><br/><p><span style=\"\">No matter what, he needed the information about Park Jung-hwan. </span><span style=\"\">However, she might not give all the remaining information even after receiving 100 million. </span><span style=\"\">Unlike the Rosario incident, this time Tae-hyuk was caught on Big Mama’s rod.</span></p><br/><p><span style=\"\">Thus, Tae-hyuk decided to use a trump card.</span></p><br/><p><span style=\"\">“... By the way, let me ask you one thing. Is there any counterfeit artwork that you need?”</span></p><br/><p><span style=\"\">Big Mama nodded with a warm smile.</span></p><br/><p><span style=\"\">@</span></p><br/><p><span style=\"\">Kang-suk, who was sitting on the table, had a comfortable expression after a long time.</span><span style=\"\">Tae-hyuk asked from where he was sitting on the opposite side.</span></p><br/><p><span style=\"\">\"It has been a long time since you came to dinner. Have you missed Noona?”</span></p><br/><p><span style=\"\">Kang-suk was startled and quickly replied.</span></p><br/><p><span style=\"\">\"I came to see you!”</span></p><br/><p><span style=\"\">“Yes, yes.”</span></p><br/><p><span style=\"\">Tae-hyuk nodded with a convinced expression.</span></p><br/><p><span style=\"\">\"I was super busy with an awful case. Somehow it was solved. I have some time to rest.”</span></p><br/><p><span style=\"\">“I don’t know what happened. Well, I’m glad that you did well.”</span></p><br/><p><span style=\"\">\"Yes. In fact, I didn’t do anything. It is a little awkward since it somehow became my achievement. Tomorrow, I will formally report to the higher ups.”</span></p><br/><p><span style=\"\">Kang-suk's expression was serious.</span></p><br/><p><span style=\"\">At that moment, Tae-hyuk felt a knot in his chest. </span><span style=\"\">It was a serial murderer case with two bodies and one victim. </span><span style=\"\">Solving it would be a big achievement for a detective. </span><span style=\"\">However, Kang-suk was trying to kick it away with his own feet.</span></p><br/><p><span style=\"\">'Ah, that person! It is the dinner I worked hard to prepare for him. Why is he going to spit it out! He is so upright that he is damaging himself!’</span></p><br/><p><span style=\"\">Kang-suk was truly a very nice person. </span><span style=\"\">However, such a person would only receive loss in the world. </span><span style=\"\">It seemed like Tae-hyuk would have to do some work behind Kang-suk.</span></p><br/><p><span style=\"\">Tae-hyuk spoke cautiously so that he wouldn’t be heard by Ha-ran who was cooking in the kitchen.</span></p><br/><p><span style=\"\">\"At any rate, is now the time? When are you going to ask for a date?”</span></p><br/><p><span style=\"\">\"D-D-Date! C-Cough! We are just going to play...”</span></p><br/><p><span style=\"\">Tae-hyuk sighed. </span><span style=\"\">It seemed like he wouldn’t be able to ask for a date until he was an old man. </span><span style=\"\">In the end, Tae-hyuk acted.</span></p><br/><p><span style=\"\">“Noona! Kang-suk hyung wants you to hang out with him this weekend!”</span></p><br/><p><span style=\"\">“Ya, ya, hey!”</span></p><br/><p><span style=\"\">Kang-suk was embarrassed but Ha-ran looked at him with an expression of astonishment. </span><span style=\"\">Then she looked at Kang-suk like she was waiting for something. </span><span style=\"\">In the end, Kang-suk surrendered and asked Ha-ran to go out.</span></p><br/><p><span style=\"\">“Uh, ugh... That's correct. Ha-ran. Do you have time to go somewhere with me this weekend?”</span></p><br/><p><span style=\"\">Ha-ran clapped with pleasure.</span></p><br/><p><span style=\"\">“Wah...! Hang out together? Then I’ll prepare a lunch box!”</span></p><br/><p><span style=\"\">Tae-hyuk sighed as he glanced at Ha-ran and Kang-suk.</span></p><br/><p><span style=\"\">It was their first date since first meeting each other three months ago. </span><span style=\"\">How long would it take for them to become a couple?</span></p><br/><p><span style=\"\">Maybe he should help them a little bit.</span></p><br/><p><span style=\"\">@</span></p><br/><p><span style=\"\">The Hippo incident passed in a flash.</span></p><br/><p><span style=\"\">Tae-hyuk lay down on his desk in the classroom and groaned.</span></p><br/><p><span style=\"\">“... I need to make some money. I also need to support Kang-suk hyung. Ohh. Should I just skip school?”</span></p><br/><p><span style=\"\">An Eun-young heard Tae-hyuk’s complaints from her seat next to him.</span></p><br/><p><span style=\"\">“T-Tae-hyuk... You can’t skip school. Go home after school finishes.\"</span></p><br/><p><span style=\"\">“Ugh. Did you hear?”</span></p><br/><p><span style=\"\">An Eun-young said with a serious voice.</span></p><br/><p><span style=\"\">\"Next week is the final exams. Have you prepared well?”</span></p><br/><p><span style=\"\">“......”</span></p><br/><p><span style=\"\">Tae-hyuk stared dumbly.</span></p><br/><p><span style=\"\">Recently, he had been so busy that he didn’t care about studying. </span><span style=\"\">The proof was that his intelligence stat hadn’t risen.</span></p><br/><p><span style=\"\">\"I guess not. You did seem strangely busy... If you take the test properly, didn’t you say that you would be first in the school?”</span></p><br/><p><span style=\"\">“Hahaha...”</span></p><br/><p><span style=\"\">\"Well, I can give you special lessons again this time...”</span></p><br/><p><span style=\"\">An Eun-young was strangely hesitant.</span></p><br/><p><span style=\"\">It seemed like there was something she wanted to say.</span></p><br/><p><span style=\"\">\"Is there something?”</span></p><br/><p><span style=\"\">“Ah, no. Let's study together like last time. Will you come to my house this weekend?”</span></p><br/><p><span style=\"\">Tae-hyuk realized that An Eun-young was asking for help.</span></p><br/><p><span style=\"\">\"Eun-young. Is something going on? If you don’t mind then I am willing to listen to your story.”</span></p><br/><p><span style=\"\">An Eun-young looked at Tae-hyuk with deeply touched eyes. </span><span style=\"\">Then she slowly explained the situation.</span></p><br/><p><span style=\"\">“T-Tae-hyuk... That... You know...”</span></p><br/><p><span style=\"\">An Eun-young had an older sister.</span></p><br/><p><span style=\"\">However, she recently got involved in a multi-level scheme and ran away from home.</span></p><br/><p><span style=\"\">Tae-hyuk was troubled after hearing the story. </span><span style=\"\">His head was about to burst just from his own matters. </span><span style=\"\">But now he needed to help An Eun-young’s family matters as well? </span><span style=\"\">What benefits would there be?</span></p><br/><p><span style=\"\">“......”</span></p><br/><p><span style=\"\">Tae-hyuk bit his lip.</span></p><br/><p><span style=\"\">He realized that he always made calculations before moving. </span><span style=\"\">It was the same with Big Mama. </span><span style=\"\">When he used the crime skill, he had the mindset of a criminal.</span></p><br/><p><span style=\"\">He had received enormous help from An Eun-young. </span><span style=\"\">Thanks to her studying skill, he could tremendously increase his intelligence stat. </span><span style=\"\">He could finally become a model student.</span></p><br/><p><span style=\"\">An Eun-young was now asking for help. </span><span style=\"\">How could he refuse just because there were no benefits?</span></p><br/><p><span style=\"\">Tae-hyuk thought for a moment. </span><span style=\"\">He was currently ranked third. </span><span style=\"\">Until he went to university, he needed An Eun-young’s studying skill. </span><span style=\"\">If he helped her now then he could use her studying skills in the future. </span><span style=\"\">He was moving for An Eun-young’s studying skill.</span></p><br/><p><span style=\"\">Tae-hyuk came to this conclusion and said to An Eun-young.</span></p><br/><p><span style=\"\">\"If you don't mind then I will help you. Let’s talk about the details in your room.”</span></p><br/><p><span style=\"\">“Uh, yes... T-Thank you, Tae-hyuk.”</span></p><br/><p><span style=\"\">An Eun-young was sincerely thankful. </span><span style=\"\">At that moment, Tae-hyuk felt something like a needle stabbing into his chest.</span></p><br/><p><span style=\"\">‘Then there are three things that need to be solved. I’ll be quite busy in the future.’</span></p><br/><p><span style=\"\">Tae-hyuk quietly looked at An Eun-young’s face. </span><span style=\"\">He was really glad to see her smiling expression.</span></p><br/>\n</div>"}