{"title": "Chapter 47: The Familys Condition #3", "id": 47, "volume": 1, "url": "http://boxnovel.org/god-of-crime-chapter-47-the-familys-condition-3", "volume_title": "Volume 1", "body": "<h1>Chapter 47: The Familys Condition #3</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span style=\"\">Chapter 47: The Family’s Condition #3</span></p><br/><p><span style=\"\">Choi Sung-yeol’s words contained a strange eloquence. </span><span style=\"\">He blended one lie among 10 facts. </span><span style=\"\">That way, it sounded like he was just telling the truth.</span></p><br/><p><span style=\"\">The contents of Choi Sung-yeol’s words were simple. </span><span style=\"\">Large corporations regarded their employees like slaves. </span><span style=\"\">In addition, they bribed politicians to try to pass labour reform laws. </span><span style=\"\">No matter how hard someone worked, they could be thrown away like a used tissue. </span><span style=\"\">They would never be rewarded for their efforts.</span></p><br/><p><span style=\"\">However, Tiwai was different. </span><span style=\"\">By default, in order to join the company, a person had to purchase a certain amount of shares. </span><span style=\"\">It wasn’t a relationship between an employer and employee, but one where everyone was an owner. </span><span style=\"\">If there were tangible results, then their rating would go up. </span><span style=\"\">The higher the rating, the greater the distribution.</span></p><br/><p><span style=\"\">‘Well, it sounds like a plausible story.’</span></p><br/><p><span style=\"\">Tae-hyuk clicked his tongue.</span></p><br/><p><span style=\"\">It was no use if people were owners. </span><span style=\"\">In the end, the exploitation targets just changed to a higher grade.</span></p><br/><p><span style=\"\">However, Choi Sung-yeol was extremely good at cajoling the new members. </span><span style=\"\">There were men and women next to him, all decoys planted by Tiwai.</span></p><br/><p><span style=\"\">The old people praised him by using their years of experience. </span><span style=\"\">The young ones said they had a burning passion. </span><span style=\"\">There were those who didn’t have proper jobs, and were now living well. </span><span style=\"\">Every one of them spoke words of praise. </span><span style=\"\">The praise, that was as smooth as butter, poured out of their mouths and were caught in the people’s ears.</span></p><br/><p><span style=\"\">While the sense of confidence increased, the final blow was dealt. </span><span style=\"\">If they joined now, then they could go up to a higher grade. </span><span style=\"\">They could reach the status of other people, who had worked for a few years, in an instant.</span></p><br/><p><span style=\"\">In that way, the participants were persuaded. </span><span style=\"\">Interviews with members of Tiwai were broadcasted on the screen. </span><span style=\"\">The attendees looked at the screen with flushed faces.</span></p><br/><p><span style=\"\">“Look at this. Many people are making more than five million a month. Are you willing to do that? Do you lack experience? Or is there a lack of enthusiasm?”</span></p><br/><p><span style=\"\">A person who earned around 800,000 a month would become someone who earned more than 10 million won in the first three months. </span><span style=\"\">A man, who said he was in his first year of employment, took out the key for a foreign car from his pocket and shook it.</span></p><br/><p><span style=\"\">Now everything was gathered for the perfect situation.</span></p><br/><p><span style=\"\">Tae-hyuk laughed.</span></p><br/><p><span style=\"\">‘It is like taking off the label and replacing it with one from a deluxe brand. Furthermore, that isn’t a key no matter how I look at it.”</span></p><br/><p><span style=\"\">It was a fake made for use as a movie prop. </span><span style=\"\">It was made elaborately so that it couldn’t be distinguished from the real thing. </span><span style=\"\">However, Tae-hyuk had the ability to grasp the authenticity of an object, due to the Forgery skill improving his discerning eye.</span></p><br/><p><span style=\"\">Tae-hyuk wondered if he would receive a new crime skill and checked the Demon Revealing Mirror.</span></p><br/><p><span style=\"\">‘Um. There is no new skill.’</span></p><br/><p><span style=\"\">So far, Tae-hyuk had met seven blacklist members. </span><span style=\"\">However, except for Big Mama, he didn’t receive any of their crime skills. </span><span style=\"\">Was it necessary to upgrade to Noble?</span></p><br/><p><span style=\"\">'By the way, what is An Eun-jeong doing? She isn’t a decoy?’</span></p><br/><p><span style=\"\">She hadn’t appeared with Choi Sung-yeol’s party. </span><span style=\"\">Tae-hyuk looked around the meeting room and was able to find her. </span><span style=\"\">An Eun-jeong was sitting in a corner and writing down Choi Sung-yeol’s notes in a notebook. </span><span style=\"\">She looked just like An Eun-young.</span></p><br/><p><span style=\"\">‘... They are truly family.’</span></p><br/><p><span style=\"\">The other people were busy talking to each other. </span><span style=\"\">Tae-hyuk sat next to An Eun-jeong and asked.</span></p><br/><p><span style=\"\">\"You have been writing really hard. What is the content?”</span></p><br/><p><span style=\"\">An Eun-jeong laughed and held out her notes.</span></p><br/><p><span style=\"\">“This? I was writing about Choi Sung-yeol sunbae. He really is great,  and none of his words are ridiculous. The money he earns as well... I want to be like him someday.”</span></p><br/><p><span style=\"\">An Eun-jeong was looking at Choi Sung-yeol with sincerely respectful eyes.</span></p><br/><p><span style=\"\">Tae-hyuk inwardly sighed.</span></p><br/><p><span style=\"\">She was completely deceived without knowing it. </span><span style=\"\">The good news was that she hadn’t been completely corrupted yet.</span></p><br/><p><span style=\"\">'I need to discover how deep her feet are.’</span></p><br/><p><span style=\"\">\"An Eun-jeong is working really hard.”</span></p><br/><p><span style=\"\">\"Uh, how did you know my name...?”</span></p><br/><p><span style=\"\">An Eun-jeong asked with wide eyes. </span><span style=\"\">Tae-hyuk pointed to the employee ID hanging around her neck.</span></p><br/><p><span style=\"\">\"I saw the name hanging around your neck. Oh right, my name is Lee Cheol-su.”</span></p><br/><p><span style=\"\">Tae-hyuk gave the pseudonym he used during the voyeur incident.</span></p><br/><p><span style=\"\">An Eun-jeong nodded.</span></p><br/><p><span style=\"\">\"Oh, I see. Anyway, I am currently a silver member. If I can recruit 10 more people, then I can upgrade to gold... I need to work harder!”</span></p><br/><p><span style=\"\">An Eun-jeong took a fighting posture. </span><span style=\"\">She had a similar atmosphere to Ha-ran. </span><span style=\"\">It felt like he was watching a child.</span></p><br/><p><span style=\"\">Tae-hyuk lowered his voice as much as possible and said.</span></p><br/><p><span style=\"\">“That’s amazing. Already a silver member... You must have spent a large amount of money.”</span></p><br/><p><span style=\"\">An Eun-jeong hesitated before opening her mouth.</span></p><br/><p><span style=\"\">“... Yes. In fact, it was the money I had set aside to rent a room. I used it all but... I can make a lot more once I become a gold member!”</span></p><br/><p><span style=\"\">Tae-hyuk’s head started to hurt.</span></p><br/><p><span style=\"\">She must have devoted millions of won into this. </span><span style=\"\">After becoming a part of the multilevel marketing, a person could easily obtain a higher grade if they spent a certain amount of money.</span></p><br/><p><span style=\"\">However, the problem was after that happened. </span><span style=\"\">They had already invested money, and now they couldn’t pull their feet out. </span><span style=\"\">Once that happened, the appearance of the company would change by 180 degrees.</span></p><br/><p><span style=\"\">'Gather members. </span><span style=\"\">Bring in more money because your shares are low. </span><span style=\"\">Go out and sell new products.’</span></p><br/><p><span style=\"\">There was constant exploitation. </span><span style=\"\">At the end of the day, they wouldn’t be able to sell enough.</span></p><br/><p><span style=\"\">An Eun-jeong was laughing with an innocent face.</span></p><br/><p><span style=\"\">‘I thought she was moderately quick-witted...’</span></p><br/><p><span style=\"\">The woman in front of him never even imagined that she was being deceived.</span></p><br/><p><span style=\"\">\"I’ll ask you just one thing. How many people have you brought here?”</span></p><br/><p><span style=\"\">“Well... Two or three people.”</span></p><br/><p><span style=\"\">A fool pulled in other fools. </span><span style=\"\">The multilevel scheme was truly scary.</span></p><br/><p><span style=\"\">Tae-hyuk asked with a heavy expression.</span></p><br/><p><span style=\"\">\"So they all became part of Eun-jeong’s shares?”</span></p><br/><p><span style=\"\">At that moment, An Eun-jeong’s eyes shook.</span></p><br/><p><span style=\"\">\"... It isn’t like that. It will be given the next time I register a name.”</span></p><br/><p><span style=\"\">“I see. The people Eun-jeong brought in received consultation from another person and was registered under their name. Next time, do better. Is that the method?”</span></p><br/><p><span style=\"\">An Eun-jeong looked at Tae-hyuk with a startled expression. </span><span style=\"\">Based on her expression, it seemed like he had struck the nail on the head.</span></p><br/><p><span style=\"\">\"H-How did you know?\"</span></p><br/><p><span style=\"\">Tae-hyuk told An Eun-jeong the truth.</span></p><br/><p><span style=\"\">\"If you gather 10 more people, then you can reach the gold rank?”</span></p><br/><p><span style=\"\">“Yes...”</span></p><br/><p><span style=\"\">The confident voice from a few minutes ago had become smaller.</span></p><br/><p><span style=\"\">\"That number will never go to zero. Eun-jeong also knows this to a certain extent.”</span></p><br/><p><span style=\"\">“......”</span></p><br/><p><span style=\"\">An Eun-jeong looked at Tae-hyuk with a shocked face. </span><span style=\"\">Tae-hyuk had stabbed her with the sword of truth. </span><span style=\"\">However, he needed to use this degree of shock therapy on Eun-jeong.</span></p><br/><p><span style=\"\">At that moment, a strange thing happened.</span></p><br/><p><span style=\"\">'Uh, what?’</span></p><br/><p><span style=\"\">Tae-hyuk noticed a strange smell spreading in the seminar room. </span><span style=\"\">It was a smoke with a sweet, floral scent. </span><span style=\"\">He felt light-headed the moment he breathed it in.</span></p><br/><p><span style=\"\">An Eun-jeong’s eyes also became blank. </span><span style=\"\">Then suddenly, her eyes became animated again.</span></p><br/><p><span style=\"\">She spoke in a strong tone.</span></p><br/><p><span style=\"\">“T-That can’t be. I can surely upgrade my rank if I work hard! Ah, that's right. Cheol-su! Cheol-su shouldn’t think like that. Cheol-su is also in our company. We should work hard together to make a lot of money. Then my father...”</span></p><br/><p><span style=\"\">'Damn...'</span></p><br/><p><span style=\"\">He thought it was almost over. </span><span style=\"\">However, An Eun-jeong was completely possessed by this strange perfume.</span></p><br/><p><span style=\"\">Tae-hyuk bit his lip and pulled out the Demon Revealing Mirror to check his status.</span></p><br/><p><span style=\"\">\"O-Oh my god! All my stats are being reduced at a tremendous pace!’</span></p><br/><p><span style=\"\">His intelligence, that was close to 50, was now near 40 points. </span><span style=\"\">Tae-hyuk realized that his judgement was gradually falling.</span></p><br/><p><span style=\"\">‘Did they even use a hallucinogen?’</span></p><br/><p><span style=\"\">He grabbed his left little finger in order to regain his spirit.</span></p><br/><p><i><span style=\"\">Wooduk!</span></i></p><br/><p><span style=\"\">The twisting of the bones caused his stats to stop falling. </span><span style=\"\">Tae-hyuk inwardly screamed but persisted.</span></p><br/><p><span style=\"\">‘This isn’t a normal method for a multilevel company. Wait a minute. Didn’t Choi Sung-yeol have a partner?’</span></p><br/><p><span style=\"\">He wasn’t a criminal who worked alone. </span><span style=\"\">He committed his scams with an even worse colleague. </span><span style=\"\">The name of another blacklist member popped into Tae-hyuk’s mind.</span></p><br/><p><span style=\"\">‘... Producer Kim Joon-young!’</span></p><br/><p><span style=\"\">He was a famous criminal who produced bizarre shows, a producer. </span><span style=\"\">Then the fragrance with the hallucinatory effect... </span><span style=\"\">Perhaps there were three or more criminals gathered here.</span></p><br/><p><span style=\"\">'Damn. Now they are flocking.’</span></p><br/><p><span style=\"\">Scammer Choi Sung-yeol. </span><span style=\"\">Producer Kim Joon-young. </span><span style=\"\">An unknown perfume user.</span></p><br/><p><span style=\"\">Tiwai International was a lair full of criminals. </span><span style=\"\">Tae-hyuk was barely able to win against the hippo using all of his skills. </span><span style=\"\">Since then, he hadn’t got any new skills or upgrades. </span><span style=\"\">Yet this place had three criminals. </span><span style=\"\">In addition, there was the unidentified man who sent the note to An Eun-young. </span><span style=\"\">Who was he?</span></p><br/><p><span style=\"\">Tae-hyuk bit his lip as he thought about it.</span></p><br/><p><span style=\"\">@</span></p><br/><p><span style=\"\">‘But the fact that the Producer is here...’</span></p><br/><p><span style=\"\">Unfortunately, there wasn’t much written about him in the blacklist. However, he remembered about the Death Circus run by the Producer. </span><span style=\"\">It was a flashy show of human desire and betrayal.</span></p><br/><p><span style=\"\">Tae-hyuk thought about the structure of the building. </span><span style=\"\">The interior was much smaller compared to the size. </span><span style=\"\">It felt like there were secret rooms that couldn’t be entered through a normal route.</span></p><br/><p><span style=\"\">Maybe the Producer was planning the Death Circus.</span></p><br/><p><span style=\"\">Tae-hyuk realized that there was only one way for An Eun-jeong to escape from here.</span></p><br/><p><span style=\"\">“Eun-jeong. If there was a way to raise your rating all at once, what would you do?”</span></p><br/><p><span style=\"\">“Huh? A-All of a sudden?</span></p><br/><p><span style=\"\">\"It isn’t gold but the platinum rating.”</span></p><br/><p><span style=\"\">Eun-jeong covered her mouth with her hands at Tae-hyuk’s words. </span><span style=\"\">It was the same rating as Choi Sung-yeol. </span><span style=\"\">He led the thousands of silver and gold members and gained a huge amount of money from what they earned.</span></p><br/><p><span style=\"\">“R-Really?”</span></p><br/><p><span style=\"\">\"If you have any doubts, then you can ask Choi Sung-yeol.”</span></p><br/><p><span style=\"\">Tae-hyuk didn’t miss the fire blazing in An Eun-jeong’s eyes. </span><span style=\"\">She really was an easily convinced woman.</span></p><br/><p><span style=\"\">“… If there really is such a method then I will do anything. S-Surely...”</span></p><br/><p><span style=\"\">\"It probably isn’t what you are thinking. You could die.” </span></p><br/><p><span style=\"\">\"How do you know such a thing? Are you not an ordinary member?”</span></p><br/><p><span style=\"\">Tae-hyuk smirked. </span><span style=\"\">Now she had noticed.</span></p><br/><p><span style=\"\">\"I came for this. Do you understand?”</span></p><br/><p><span style=\"\">“Ah...”</span></p><br/><p><span style=\"\">\"But I can’t do it alone. How about it? Do you want to reach the platinum rating with me?”</span></p><br/><p><span style=\"\">An Eun-jeong gave a strange groan as she hesitated for a moment. </span><span style=\"\">And after a while. </span><span style=\"\">She came to a conclusion and nodded.</span></p><br/><p><span style=\"\">\"I accept. I should put my life on the line to make money.”</span></p><br/><p><span style=\"\">‘Ugh. This woman! Does she even know what she is saying?’</span></p><br/><p><span style=\"\">Tae-hyuk inwardly screamed. </span><span style=\"\">The words made him feel like puking. </span><span style=\"\">He needed to show An Eun-jeong reality.</span></p><br/><p><span style=\"\">‘... Yes. Let's try it. Death Circus. If I look at it directly then I’ll discover what I need to know.’</span></p><br/><p><span style=\"\">\"Can you wait a minute? I have something to say to Choi Sung-yeol.”</span></p><br/><p><span style=\"\">“Yes.”</span></p><br/><p><span style=\"\">Tae-hyuk walked towards the front of the room. </span><span style=\"\">Two people were talking without any worries to Choi Sung-yeol. </span><span style=\"\">Tae-hyuk smiled as he reached Choi Sung-yeol.</span></p><br/><p><span style=\"\">“What is going on? I saw you talking to An Eun-jeong. Is there an incident that you would like to document?”</span></p><br/><p><span style=\"\">\"Oh, I wanted to join. I came when I heard that Kim Joon-young was here.”</span></p><br/><p><span style=\"\">“Huh? You came to see Kim Joon-young...”</span></p><br/><p><span style=\"\">\"An Eun-jeong wants to play. Both of us would like to join the Death Circus.”</span></p><br/><p><span style=\"\">Choi Sung-yeol’s mouth twisted strangely.</span></p><br/><p><span style=\"\">“Ohuhu... There are applicants. How did you court An Eun-jeong? Anyway, it is nice to meet you. The show is scheduled for tonight.”</span></p><br/><p><span style=\"\">\"I’m glad that I don’t have to wait.”</span></p><br/><p><span style=\"\">“But is it really okay? You are still young. Your lives will be ours the moment you apply to participate in the Death Circus.”</span></p><br/><p><span style=\"\">“It doesn’t matter. I will win.”</span></p><br/><p><span style=\"\">Choi Sung-yeol smiled brightly.</span></p><br/><p><span style=\"\">At best, they were hoping to pluck tens of millions of won from pushovers. </span><span style=\"\">Yet he willingly participated in the Death Circus. </span><span style=\"\">Now they could get hundreds of million of won.</span></p><br/><p><span style=\"\">“That confident expression is good. Then I will introduce you to Director Kim Joon-young.”</span></p><br/><p><span style=\"\">That night, the Death Circus was going to begin.</span></p><br/>\n</div>"}