{"title": "Chapter 55: Black Sheep Exodus #2", "id": 55, "volume": 1, "url": "http://boxnovel.org/god-of-crime-chapter-55-black-sheep-exodus-2", "volume_title": "Volume 1", "body": "<h1>Chapter 55: Black Sheep Exodus #2</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span style=\"\">Chapter 55: Black Sheep Exodus #2  </span></p><br/><p><span style=\"\">He was a man who gave off a sharp impression. </span><span style=\"\">Jun-tae continued to point out the loopholes.</span></p><br/><p><span style=\"\">\"He might be leading you down a path but it might be heading towards a cliff.”</span></p><br/><p><span style=\"\">At that moment, someone who had been listening quietly sneered at Jun-tae.</span></p><br/><p><span style=\"\">\"Then are you saying you have a better idea?”</span></p><br/><p><span style=\"\">It was the only woman in Group A, Jeon Mina. </span><span style=\"\">Mina showed complete trust in Tae-hyuk.</span></p><br/><p><span style=\"\">“No, but... I want to see more tangible evidence.”</span></p><br/><p><span style=\"\">“Is that so? I know people like you. You can’t help but feel envious when you see someone doing well. In the end, you will ruin everyone because of your pride.”</span></p><br/><p><span style=\"\">Jun-tae’s face distorted at Mina’s acidic tone.</span></p><br/><p><span style=\"\">\"I saw all of you moving together! Perhaps this is a plan to screw everyone else?”</span></p><br/><p><span style=\"\">\"I-Isn’t he a wolf planted by Choi Sung-yeol?”</span></p><br/><p><span style=\"\">In no time, the crowd split into two groups and started fighting. </span><span style=\"\">It was clearly an urgent situation. </span><span style=\"\">There was an internal conflict in the group when they should be trying to escape.</span></p><br/><p><span style=\"\">Tae-hyuk sighed and intervened between those who were fighting.</span></p><br/><p><span style=\"\">“Mina. Jun-tae. Both of you calm down. First of all, listen to my plan before you make a decision.”</span></p><br/><p><span style=\"\">Jun-tae looked at him and shouted.</span></p><br/><p><span style=\"\">\"So that plan can kill all of us!”</span></p><br/><p><span style=\"\">\"Why are you so suspicious? You should trust someone for once. Cheol-su used his own money to save those of us who were in a life-threatening situation. Let's see... Omo. Do you have 70 million right now? That is why you are so relaxed. Ah, perhaps...”</span></p><br/><p><span style=\"\">Mina eyed Jun-tae suspiciously before walking over to Tae-hyuk and whispering something in his ears.</span></p><br/><p><span style=\"\">\"Isn’t it obvious that there would be a wolf planted by Tiwai here?”</span></p><br/><p><span style=\"\">Tae-hyuk nodded quietly.</span></p><br/><p><span style=\"\">“Then isn’t he the most suspicious? He has a lot of money and he’s also planting suspicion. No matter how I look at it, he has to be the wolf. It would be better to get rid of such people before going through with the Exodus.</span></p><br/><p><span style=\"\">\"Hrmm...\"</span></p><br/><p><span style=\"\">Tae-hyuk paused for a moment before answering.</span></p><br/><p><span style=\"\">\"I'm sorry, but I can’t do that. While there are definitely wolves among us, if we are suspicious of each other then it is what the wolf wants. First of all, I am thinking of taking everyone with me.”</span></p><br/><p><span style=\"\">\"Oh, then the wolf...”</span></p><br/><p><span style=\"\">\"I said I would take them all.”</span></p><br/><p><span style=\"\">Mina’s protests died down at Tae-hyuk’s strong will.</span></p><br/><p><span style=\"\">“Yes... I understand.”</span></p><br/><p><span style=\"\">Tae-hyuk activated the Voice Modulation skill.</span></p><br/><p><span style=\"\">[Voice Modulation has been used.]</span></p><br/><p><span style=\"\">-You can imitate the voice of Kim Bum-soo.</span></p><br/><p><span style=\"\">Kim Bum-soo was an actor who often appeared in historical dramas. </span><span style=\"\">He mainly played the role of the king. </span><span style=\"\">It was the charismatic voice that really made him seem like a king of the Joseon Dynasty.</span></p><br/><p><span style=\"\">There were two groups in front of Tae-hyuk’s eyes. </span><span style=\"\">In order to bring them together, he would use Kim Bum-soo’s voice.</span></p><br/><p><span style=\"\">\"Please pay attention. Right now, there are those who believe in me. There are also those who feel doubt. The two groups exist, and I can understand both. I was afraid after entering the Death Circus. All of you can’t be sure that the path you are walking on is correct. Therefore, I will walk in front. Right now, I am going to challenge the ‘Puzzle House.’ After that, you can decide whether to follow me and clear it, or to give up. I’m just suggesting a path.”</span></p><br/><p><span style=\"\">\"Y-You will challenge first? We won’t be used as sacrifices to identify the winning strategy?”</span></p><br/><p><span style=\"\">“Yes. You can also choose the order that you desire. Anyways, I am planning to escape with everyone. \"</span></p><br/><p><span style=\"\">“Ah...!”</span></p><br/><p><span style=\"\">The contents absolutely weren’t trivial</span></p><br/><p><span style=\"\">This was something that often occurred at military training grounds. </span><span style=\"\">A demonstration by a skilled assistant.</span></p><br/><p><span style=\"\">However, his voice was overflowing with charisma. </span><span style=\"\">The combination of the voice and the words gave them a strange sense of trust. </span><span style=\"\">This guy could help them leave with their lives. </span><span style=\"\">Such sentiments formed in the minds of the gathered people.</span></p><br/><p><span style=\"\">\"By the way, Boss! All of a sudden, your voice has changed, making it seem like a god!”</span></p><br/><p><span style=\"\">Someone suddenly called Tae-hyuk ‘Boss’. </span><span style=\"\">Tae-hyuk released the Voice Modulation skill.</span></p><br/><p><span style=\"\">“Haha. I took some classes on eloquence in the past, and I tried to use some of it just now.”</span></p><br/><p><span style=\"\">“I see. At any rate, I believe in Boss. Show us how to escape.”</span></p><br/><p><span style=\"\">Tae-hyuk slowly nodded. </span><span style=\"\">Jun-tae’s expression showed that he couldn’t understand it as he muttered.</span></p><br/><p><span style=\"\">\"It’s just one speech...”</span></p><br/><p><span style=\"\">As the wave of suspicion disappeared, Jun-tae was forced to follow quietly. </span><span style=\"\">Mina looked at him with suspicious eyes until the end. </span><span style=\"\">The root of the problem still hadn’t disappeared.</span></p><br/><p><span style=\"\">@</span></p><br/><p><span style=\"\">The Puzzle House, one of the most notorious Death Circus attractions.</span></p><br/><p><span style=\"\">In a sealed room, there was a structure that kept displaying puzzles on a monitor. </span><span style=\"\">The problem was the level of difficulty. </span><span style=\"\">One by one, the levels were manageable. </span><span style=\"\">However, a person had to challenge a few times in a row. </span><span style=\"\">There were also hundreds of patterns.</span></p><br/><p><span style=\"\">If any mistakes happened, then a guillotine would fall and one part of the body would be cut off.</span></p><br/><p><span style=\"\">First, the fingers. </span><span style=\"\">Then, the arms. </span><span style=\"\">In the end...</span></p><br/><p><span style=\"\">There was no dropping out in the middle.</span></p><br/><p><span style=\"\">The most terrible thing was to confirm the right answer with a body part in the guillotine. </span><span style=\"\">That body part would be cut off if the answer turned out to be incorrect. </span><span style=\"\">Body parts were cut off without any anesthesia. </span><span style=\"\">A pronounced shock that led to death would often occur.</span></p><br/><p><span style=\"\">The Puzzle House was a large glass box, so it was a structure that completely showed what was happening inside. </span><span style=\"\">The Puzzle House’s prize was 50 million won. </span><span style=\"\">All they needed to do was come out of it alive. </span><span style=\"\">The amount was overwhelmingly high compared to other attractions.</span></p><br/><p><span style=\"\">At first, there was a man who challenged the Puzzle House. </span><span style=\"\">He was a Mensa member with an IQ of higher than 140. </span><span style=\"\">He focused and made it to the middle part of the puzzles. </span><span style=\"\">However, he made a mistake with one puzzle.</span></p><br/><p><span style=\"\">The five fingers that he placed in the guillotine were cut off. </span><span style=\"\">The funny thing was that he would remain alive as long as the injuries were treated. </span><span style=\"\">Of course, this wasn’t because they cared for the participants. </span><span style=\"\">It was to make sure that the participant didn’t die easily so that the guests could enjoy it for a long time.</span></p><br/><p><span style=\"\">The treated man looked stunned. </span><span style=\"\">However, if he concentrated, then he could clear the rest of the problems without losing anything other than his fingers.</span></p><br/><p><span style=\"\">But that wasn't it. </span><span style=\"\">The man knew it. </span><span style=\"\">If he made a mistake, then he would die. </span><span style=\"\">This thought weighed down on him like heavy shackles on his body. </span><span style=\"\">He collapsed in an instant. </span><span style=\"\">He was worried that the right answer was too obvious and chose the wrong answer.</span></p><br/><p><span style=\"\">Arms... </span><span style=\"\">Legs... </span><span style=\"\">In the end, his neck...</span></p><br/><p><span style=\"\">He was one of the best participants in the Death Circus and he lost his head. </span><span style=\"\">After witnessing that, no participants challenged the Puzzle House.</span></p><br/><p><span style=\"\">After three hours passed, a second challenger appeared.</span></p><br/><p><span style=\"\">Seo Tae-hyuk. </span><span style=\"\">As Tae-hyuk entered the Puzzle House, he saw a bearded man sitting in a corner.</span></p><br/><p><span style=\"\">\"Are you going to challenge?”</span></p><br/><p><span style=\"\">\"There are many people waiting. Let’s start straight away.”</span></p><br/><p><span style=\"\">“Haha...”</span></p><br/><p><span style=\"\">Tae-hyuk sat on the chair in the middle of the Puzzle House and placed one arm in a small guillotine. </span><span style=\"\">It was a tool for cutting off the fingers. </span><span style=\"\">Guillotines made for cutting off the arms, legs and heads were also inside the room.</span></p><br/><p><span style=\"\">As he sat down on the chair, the first problem appeared on the wall-mounted monitor. </span><span style=\"\">The first problem had a simple level of difficulty.</span></p><br/><p><span style=\"\">Question 1) 2+2*2=</span></p><br/><p><span style=\"\">Tae-hyuk put his brain into full operation and came up with the answer. </span><span style=\"\">He manipulated the panel and chose the number 6.</span></p><br/><p><span style=\"\">The terrible Puzzle House began.</span></p><br/><p><span style=\"\">@</span></p><br/><p><span style=\"\">\"T-The right answer once again!”</span></p><br/><p><span style=\"\">“Oh my god!”</span></p><br/><p><span style=\"\">\"How many problems has it been so far?”</span></p><br/><p><span style=\"\">“27...28!”</span></p><br/><p><span style=\"\">The crowd outside cheered as they saw Tae-hyuk solving the problems. </span><span style=\"\">They were dubious at first but their voices gradually rose as Tae-hyuk solved the problems one by one. </span><span style=\"\">The great thing wasn’t that he was solving all the problems. </span><span style=\"\">He was doing everything at a tremendous speed.</span></p><br/><p><span style=\"\">\"Uh, how could he solve that problem in one second?”</span></p><br/><p><span style=\"\">“B-Boss is a genius! No, it isn’t a genius level. It’s like he knew all the problems already!”</span></p><br/><p><span style=\"\">“A-Amazing!”</span></p><br/><p><span style=\"\">They could live. </span><span style=\"\">If they followed the Boss then they could get out of here. </span><span style=\"\">Hope filled the faces of the participants.</span></p><br/><p><span style=\"\">\"A-All 30 questions are correct...! The Puzzle House is cleared... He did it without getting hurt at all!”</span></p><br/><p><span style=\"\">For the first time, cheers rang out in the Death Circus.</span></p><br/><p><span style=\"\">\"Waaaaaaaah!\"</span></p><br/><p><span style=\"\">Tae-hyuk got up and spoke to the bearded man.</span></p><br/><p><span style=\"\">\"Please prepare for the next guest.”</span></p><br/><p><span style=\"\">“Huh? Oh, yes!”</span></p><br/><p><span style=\"\">The bearded man replied with a stunned expression. </span><span style=\"\">He had been responsible for the Puzzle House for two years, yet this was the first time he saw a person clear this place. </span><span style=\"\">He was sure that it would never occur again in the future.</span></p><br/><p><span style=\"\">Tae-hyuk slowly walked out of the Puzzle House and said,</span></p><br/><p><span style=\"\">“How is it? Simple right?”</span></p><br/><p><span style=\"\">\"Wahhhhh!”</span></p><br/><p><span style=\"\">50 million won in 10 minutes.</span></p><br/><p><span style=\"\">There were some who shed tears at Tae-hyuk’s tremendous achievement. </span><span style=\"\">However, Jun-tae still had a sour expression on his face as he spoke.</span></p><br/><p><span style=\"\">\"This is even more suspicious. It seemed like you knew all the problems. You are in fact a spy planted here by the organizers... hup hup” </span></p><br/><p><span style=\"\">The person next to Jun-tae blocked his mouth.</span></p><br/><p><span style=\"\">“Boss! Never mind this brat. Then a second person will enter right?”</span></p><br/><p><span style=\"\">\"That’s right.”</span></p><br/><p><span style=\"\">“Then who...”</span></p><br/><p><span style=\"\">\"I would like someone to volunteer.”</span></p><br/><p><span style=\"\">“Cough! Who wants to enter the Puzzle House next?”</span></p><br/><p><span style=\"\">“......”</span></p><br/><p><span style=\"\">No matter how overwhelming Tae-hyuk’s victory was, no one was willing to go. </span><span style=\"\">Once another person entered the Puzzle House, Tae-hyuk planned to tell them the right answers. </span><span style=\"\">However, if Tae-hyuk was truly a spy, then he would likely reveal his true colours with the next participant. </span><span style=\"\">The third was less likely than the second...</span></p><br/><p><span style=\"\">While everyone was busy thinking...</span></p><br/><p><span style=\"\">Someone walked forward. </span><span style=\"\">It was An Eun-jeong who was hiding in the crowd.</span></p><br/><p><span style=\"\">“I will be the second person.”</span></p><br/><p><span style=\"\">“Ohh! This young lady? Fighting!”</span></p><br/><p><span style=\"\">Sighs of relief were heard.</span></p><br/><p><span style=\"\">An Eun-jeong had infinite trust in Tae-hyuk, just like Mina. </span><span style=\"\">She had been quiet, but now it was her turn. </span><span style=\"\">Eun-jeong swallowed her saliva as she looked at Tae-hyuk.</span></p><br/><p><span style=\"\">“Uh...?”</span></p><br/><p><span style=\"\">However, Tae-hyuk had a strange look on his face.</span></p><br/><p><span style=\"\">\"I want to say something before An Eun-jeong enters.”</span></p><br/><p><span style=\"\">“Huh? W-what...?”</span></p><br/><p><span style=\"\">Tae-hyuk looked at the other participants. </span><span style=\"\">There was obviously a wolf in sheepskin among them.</span></p><br/><p><span style=\"\">\"Tiwai has planted spies in here, famously known as wolves, and I know who the spy is.”</span></p><br/><p><span style=\"\">\"......!\"</span></p><br/><p><span style=\"\">Eun-jeong’s eyes widened.</span></p><br/><p><span style=\"\">She couldn’t understand why he was saying this. </span><span style=\"\">Yoon Jong-hyun then opened his mouth.</span></p><br/><p><span style=\"\">“Is there really a spy?”</span></p><br/><p><span style=\"\">“Yes. And if the wolf doesn’t confess right now... I won’t tell the correct answer to the wolf. Then we can handle it simply.”</span></p><br/><p><span style=\"\">“Ah. Then it doesn’t matter if we aren’t a wolf.”</span></p><br/><p><span style=\"\">\"Indeed. Of course, if you are one of them then please raise your hand quietly.”</span></p><br/><p><span style=\"\">Tae-hyuk looked at them with an expression like he knew everything. </span><span style=\"\">Of course, the wolf didn’t reveal their identity.</span></p><br/><p><span style=\"\">“What, no one came out? Then I will tell the wolf this. Surely you don’t think that I didn’t notice such suspicious behaviour?”</span></p><br/><p><span style=\"\">\"......!\"</span></p><br/><p><span style=\"\">\"Then I will proceed immediately. Ah, right. I have something to say to Eun-jeong noona. Take a look at this once you are sitting down.”</span></p><br/><p><span style=\"\">Tae-hyuk handed Eun-jeong a small folded note.</span></p><br/><p><span style=\"\">“Y-Yes...”</span></p><br/><p><span style=\"\">An Eun-jeong nodded quietly.</span></p><br/><p><span style=\"\">The second person entered the Puzzle House. </span><span style=\"\">The bearded man greeted her with an interested look. </span><span style=\"\">It was the first time a female participant had entered this place.</span></p><br/><p><span style=\"\">\"Are you going to participate?”</span></p><br/><p><span style=\"\">“Yes.”</span></p><br/><p><span style=\"\">An Eun-jeong looked at the note Tae-hyuk gave her with an uneasy expression. </span><span style=\"\">What did it say?</span></p><br/><p><span style=\"\">In a flash, five of her fingers were placed in the guillotine. </span><span style=\"\">Even if Tae-hyuk told her all of the correct answers, it was natural to feel nervous. </span><span style=\"\">Eun-jeong felt cold sweat drip down her back. </span><span style=\"\">Before solving the puzzle, she had to check the note Cheol-su gave her..</span></p><br/><p><span style=\"\">\"I will read this first.”</span></p><br/><p><span style=\"\">“Do as you like.”</span></p><br/><p><span style=\"\">“Yes.”</span></p><br/><p><span style=\"\">Right now, Eun-jeong couldn’t move. </span><span style=\"\">The only thing she could do was move her left hand to manipulate the panel. </span><span style=\"\">Eun-jeong unfolded the note from Tae-hyuk and started to slowly read it.</span></p><br/><p><span style=\"\">This was what was written:</span></p><br/><p><span style=\"\">-</span><i><span style=\"\">Noona betrayed those who trusted Noona.</span></i><i><span style=\"\">Noona should know the pain that they experienced.</span></i><i><span style=\"\">In fact, I’m not sure who the wolf is yet.</span></i><i><span style=\"\">However, I should give confidence to the others,</span></i><i><span style=\"\">so I am going to make Noona a wolf.</span></i><i><span style=\"\">Everyone can live by sacrificing one person.</span></i><i><span style=\"\">Then I wish you luck.</span></i></p><br/><p><span style=\"\">\"Ahhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhh!”</span></p><br/><p><span style=\"\">Eun-jeong was furious.</span></p><br/><p><span style=\"\">Betrayal. </span><span style=\"\">Tae-hyuk's betrayal.</span></p><br/><p><span style=\"\">Now she would die here. </span><span style=\"\">Her limbs would be cut off in a gruesome manner.</span></p><br/><p><span style=\"\">Eun-jeong shook her body to get out of the chair. </span><span style=\"\">However, she was already stuck. </span><span style=\"\">She couldn’t get away.</span></p><br/><p><span style=\"\">The first problem flashed on the screen.</span></p><br/>\n</div>"}