{"title": "Chapter 73 - Huge Reward #2", "id": 73, "volume": 1, "url": "http://boxnovel.org/god-of-crime-chapter-73-huge-reward-2", "volume_title": "Volume 1", "body": "<h1>Chapter 73 - Huge Reward #2</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span style=\"\">Chapter 73 - Huge Reward #2  </span></p><br/><p><span style=\"\">The man stared at the doll with adoring eyes. </span><span style=\"\">In the dark room, the doll’s’ eyes stared back from where they were sitting. </span><span style=\"\">Its flesh was milky white, and its glistening hair gently swayed in the air.</span></p><br/><p><span style=\"\">\"Don't worry, I'll fix all the broken parts.”</span></p><br/><p><span style=\"\">The man unknowingly brought his nose to the doll’s hair and deeply inhaled.</span></p><br/><p><span style=\"\">“Hah... Smells good...”</span></p><br/><p><span style=\"\">In particular, it was the doll’s large black eyes that caught the man’s heart. </span><span style=\"\">It was shimmering with a deep light that was charming enough to suck him in.</span></p><br/><p><span style=\"\">“Oof...! Oof...!”</span></p><br/><p><span style=\"\">The man touched the doll’s chin as it tried to speak.</span></p><br/><p><span style=\"\">\"It seems that I need more tools to fix you properly.”</span></p><br/><p><span style=\"\">The man exited his studio and started the car, a big van for a single man. </span><span style=\"\">He had purchased this a while ago for some hidden uses. </span><span style=\"\">No matter how crazy for dolls the man was, he had to be careful about other people’s eyes.</span></p><br/><p><span style=\"\">On the surface, the dolls looked exactly like humans, and strange misunderstandings could occur. </span><span style=\"\">The man went to the nearest store and bought sunglasses before roaming around to a store in order to find a suitable tool.</span></p><br/><p><span style=\"\">At that moment, a salesperson came up to him and asked,</span></p><br/><p><span style=\"\">“Customer-nim. Are you looking for something?”</span></p><br/><p><span style=\"\">\"I’m looking for a stainless steel saw. It should be a big one.”</span></p><br/><p><span style=\"\">\"It will be in the F-10 section.”</span></p><br/><p><span style=\"\">\"Ah, that's right. Thank you.”</span></p><br/><p><span style=\"\">With the help of the salesperson, he could easily buy what he wanted. </span><span style=\"\">Along with the stainless steel saw, he bought iron pipes. </span><span style=\"\">In addition, he bought a tarp large enough to cover a small room and a plastic container large enough for someone to enter. </span><span style=\"\">Finally, he also purchased a travel bag.</span></p><br/><p><span style=\"\">Then he went up to the counter to pay.</span></p><br/><p><span style=\"\">“How will you pay?”</span></p><br/><p><span style=\"\">“Cash.”</span></p><br/><p><span style=\"\">When combined, the cash was over 400,000 won.</span></p><br/><p><span style=\"\">“Do you have a points card?”</span></p><br/><p><span style=\"\">“No.”</span></p><br/><p><span style=\"\">\"Would you like a cash receipt?\"</span></p><br/><p><span style=\"\">“There is no need.”</span></p><br/><p><span style=\"\">The man replied bluntly,</span></p><br/><p><span style=\"\">\"Are you planning to travel somewhere? Do you want me to deliver it?”</span></p><br/><p><span style=\"\">The man spoke with an expression that seemed to warn the cashier to not interfere.</span></p><br/><p><span style=\"\">“I will move it. I brought a car.”</span></p><br/><p><span style=\"\">“Yes, I understand.”</span></p><br/><p><span style=\"\">The cashier at the checkout looked at the man with a strange glance. </span><span style=\"\">However, there was no need to worry. </span><span style=\"\">In order to buy this, he had deliberately headed to another city that was several hundred kilometres away. </span><span style=\"\">If there was a problem, then his whereabouts wouldn’t be easily found.</span></p><br/><p><span style=\"\">The man loaded the things onto his van with a satisfied expression. </span><span style=\"\">He drove the car thinking about how to fix the doll.</span></p><br/><p><span style=\"\">\"First of all, cut off the legs so that it can’t escape. In order to prevent the hands from doing anything bad...”</span></p><br/><p><span style=\"\">The man returned to his workplace with a smile on his face at the pleasant thought. </span><span style=\"\">The doll he wanted so much was waiting for him.</span></p><br/><p><span style=\"\">@</span></p><br/><p><span style=\"\">Kang-suk arrived at the scene where the mutilated bodies were found.</span></p><br/><p><span style=\"\">\"I'm sorry, but you can’t come in here.”</span></p><br/><p><span style=\"\">A man in a police uniform blocked the road. </span><span style=\"\">Kang-suk pulled out his police badge and showed it to the officer.</span></p><br/><p><span style=\"\">“I am Detective Cho Kang-suk from Kangdong Police Station.”</span></p><br/><p><span style=\"\">“Ah, thank you for your trouble.”</span></p><br/><p><span style=\"\">“Is Investigator Joo Hyun-ho inside?”</span></p><br/><p><span style=\"\">“Yes. Please come this way.”</span></p><br/><p><span style=\"\">After entering the restaurant with the police officer, he saw Joo Hyun-ho talking to a staff member.</span></p><br/><p><span style=\"\">\"Ah! Sunbae! This is a big hit, it is quite brilliant.”</span></p><br/><p><span style=\"\">Joo Hyun-ho greeted him with a cheerful face that was unsuitable for the crime scene.</span></p><br/><p><span style=\"\">\"Hey. It is wrong to say such a thing here.”</span></p><br/><p><span style=\"\">“Haha. What about you? Anyway, we aren’t the only ones here. Hurry and listen to the explanation. By the way, what is that doing there?”</span></p><br/><p><span style=\"\">“Eh?”</span></p><br/><p><span style=\"\">Joo Hyun-ho tapped his head with his fingers and Kang-suk realized what it meant as he reached for his head. </span><span style=\"\">He had failed to remove the Santa hat.</span></p><br/><p><span style=\"\">\"You seemed to be having a good time.”</span></p><br/><p><span style=\"\">\"At any rate, describe the case. What's going on?\"</span></p><br/><p><span style=\"\">\"By the way, why did Sunbae suddenly come? I asked Coroner Park for support because of a lack of manpower. Sunbae didn’t need to come.”</span></p><br/><p><span style=\"\">\"Aish. I am just a little anxious about something.”</span></p><br/><p><span style=\"\">Kang-suk caught Hyun-ho in a headlock.</span></p><br/><p><span style=\"\">\"Kek, kek! I-I surrender!”</span></p><br/><p><span style=\"\">At this point, Kang-suk thought that this guy might be enjoying it.</span></p><br/><p><span style=\"\">Joo Hyun-ho gave a simple overview of the case.</span></p><br/><p><span style=\"\">The body...</span></p><br/><p><span style=\"\">No, the first one who found it was a staff member at the restaurant where they were gathered. </span><span style=\"\">He went to work at dawn to clean up. </span><span style=\"\">He said he had been cleaning the overnight snow when he found a Christmas tree that was decorated with arms and legs.</span></p><br/><p><span style=\"\">Kang-suk’s expression changed as he listened to Joo Hyun-ho’s story.</span></p><br/><p><span style=\"\">“Crazy... How many were killed?”</span></p><br/><p><span style=\"\">\"There were five arms and seven legs... There are at least four people.”</span></p><br/><p><span style=\"\">Kang-suk’s mouth twitched.</span></p><br/><p><span style=\"\">\"What do you mean at least four people?”</span></p><br/><p><span style=\"\">“That... The explanation is a bit long. Is it okay?”</span></p><br/><p><span style=\"\">“Yes, tell me.”</span></p><br/><p><span style=\"\">\"There are seven legs, so there are at least four people. What does Sunbae think is the psychology of a person who commits a mutilation murder?”</span></p><br/><p><span style=\"\">“…They are making it smaller so the body is easier to handle?”</span></p><br/><p><span style=\"\">\"Something like that. First of all, people often go mad for a while when committing murder. However, when a body is mutilated, the mental state stays extremely rational.”</span></p><br/><p><span style=\"\">“Crazy. Then the person who did this is sane?”</span></p><br/><p><span style=\"\">“Yes. Even if someone kills a person accidentally, they can’t accidentally cut people up.”</span></p><br/><p><span style=\"\">Joo Hyun-ho said in a casual voice like he was exchanging small talk.</span></p><br/><p><span style=\"\">“Huu...”</span></p><br/><p><span style=\"\">Kang-suk couldn’t help sighing.</span></p><br/><p><span style=\"\">\"At any rate, the psychology of a person who kills and then mutilates is quite simple. They want to return to a normal life in some way.”</span></p><br/><p><span style=\"\">“Um... They killed a person.”</span></p><br/><p><span style=\"\">Kang-suk licked his lips. </span><span style=\"\">He suddenly felt like a gangster. </span><span style=\"\">He felt wrong today.</span></p><br/><p><span style=\"\">\"They want to get rid of the body in front of them, so they throw it into the sea or bury it on a mountain. In short, they want it to go unnoticed in society.”</span></p><br/><p><span style=\"\">A question popped into Kang-suk’s head.</span></p><br/><p><span style=\"\">\"So why cut it off? You can get rid of the body without doing that. Rather, it would take more time.”</span></p><br/><p><span style=\"\">Joo Hyun-ho used his fingers to make gestures of his arms and legs being cut off.</span></p><br/><p><span style=\"\">\"The reason for a mutilation murder is very simple. They think that cutting that the body into smaller pieces is easier to carry and less noticeable.”</span></p><br/><p><span style=\"\">“Kuoong...”</span></p><br/><p><span style=\"\">Kang-suk didn’t want to know this about the psychology of criminals.</span></p><br/><p><span style=\"\">\"But this case is unusual.\"</span></p><br/><p><span style=\"\">\"Because they were used to decorate a tree?”</span></p><br/><p><span style=\"\">“Yes. It isn’t typical for a normal mutilation killer. It’s like he is boasting of his crime... Did you hear about the person who cut off and kept the body parts of the people that they killed in the war?”</span></p><br/><p><span style=\"\">“What...? There are also such people.”</span></p><br/><p><span style=\"\">\"It seems like this killer is proud that he murdered so many people. Ah, that is why I said there were at least four victims. That...”</span></p><br/><p><span style=\"\">“That?”</span></p><br/><p><span style=\"\">\"He ran out of space to decorate the Christmas tree.”</span></p><br/><p><span style=\"\">“Fuck...</span></p><br/><p><span style=\"\">\"Either way, this isn’t an ordinary murderer. I'll try a simple profile. He is probably a fairly educated professional in his early to mid 30s. He cares a lot about his appearance, and in addition, he has a large desire to show off. Did I talk about the loot? He thinks what he does is a work of art. That is why he made a sculpture to show off to others. It is similar to an avant-garde performer using dolls... I don’t remember exactly but I saw it in a magazine. Haha!”</span></p><br/><p><span style=\"\">\"Dolls?\"</span></p><br/><p><span style=\"\">“Yes. Doing strange things like cutting off the arms and legs of the dolls and switching them around. There was a surprisingly good response to it. The exhibition wasn’t long ago.”</span></p><br/><p><span style=\"\">Kang-suk’s eyes sharpened.</span></p><br/><p><span style=\"\">\"Can you find out more about that?”</span></p><br/><p><span style=\"\">“Hrmm... I don’t think it would have anything to do with this incident.”</span></p><br/><p><span style=\"\">“Please.”</span></p><br/><p><span style=\"\">\"Well, if Sunbae says so then I’ll try.”</span></p><br/><p><span style=\"\">\"Have the identities of any of the victims been discovered yet?”</span></p><br/><p><span style=\"\">\"The coroner Park Min-soo is in charge of that. It looks like the results haven’t come out yet. You call him, as I am a little uncomfortable.”</span></p><br/><p><span style=\"\">\"You just don’t fit with him. Anyway, I will call...”</span></p><br/><p><span style=\"\">Kang-suk called Park Min-soo to see if he confirmed any of the identities.</span></p><br/><p><span style=\"\">“...Uh, yes. Thank you. Work hard.”</span></p><br/><p><span style=\"\">The conversation didn’t last long. </span><span style=\"\">Hyun-ho asked Kang-suk with an expression similar to a child receiving a gift.</span></p><br/><p><span style=\"\">\"Were the identities of the victims revealed?\"</span></p><br/><p><span style=\"\">\"Min-soo says that it will be difficult to accurately identify them.”</span></p><br/><p><span style=\"\">Kang-suk scratched his head with a rough hand.</span></p><br/><p><span style=\"\">\"Putting aside the legs, won’t the hands have fingerprints? I don’t think he erased the fingerprints with something like hydrochloric acid.”</span></p><br/><p><span style=\"\">Korean citizens had all 10 fingerprints registered as data which was used to determine the identity of the victim, as well as to arrest the criminal. </span><span style=\"\">It was often a tremendous help in the investigation.</span></p><br/><p><span style=\"\">“......”</span></p><br/><p><span style=\"\">However, Kang-suk didn’t say anything.</span></p><br/><p><span style=\"\">“Eh? Sunbae? Are you crying?”</span></p><br/><p><span style=\"\">“...What? Dust just entered my eyes.”</span></p><br/><p><span style=\"\">\"At any rate, please tell me. Otherwise I can’t do my job.”</span></p><br/><p><span style=\"\">Kang-suk looked at Joo Hyun-ho with red eyes. </span><span style=\"\">His expression was a mixture of many emotions.</span></p><br/><p><span style=\"\">\"Unfortunately, all the fingerprints weren’t registered.”</span></p><br/><p><span style=\"\">“Whoa! Then perhaps...”</span></p><br/><p><i><span style=\"\">Bam!</span></i></p><br/><p><span style=\"\">Kang-suk punched the wall with an angry expression.</span></p><br/><p><span style=\"\">“...Fuck. Yes. It means that all the victims were underage.”</span></p><br/><p><span style=\"\">At that moment, Hyun-ho could know what it was like to be able to kill someone with sheer force. </span><span style=\"\">If the criminal in the case appeared in front of Kang-suk right now, he would die instantly.</span></p><br/><p><span style=\"\">@</span></p><br/><p><span style=\"\">'First of all, let’s think about why I was notified of Doll Play just now.’</span></p><br/><p><span style=\"\">Tae-hyuk started to slowly analyze the situation. </span><span style=\"\">The first thing that happened was Kim Soo-bin’s disappearance, who lived at St. Mary’s Orphanage. </span><span style=\"\">After gathering to listen to the details of the story, Kang-suk suddenly received news that a murder had happened. </span><span style=\"\">After that, Tae-hyuk received the notification to resolve the Doll Play situation.</span></p><br/><p><span style=\"\">In other words, Kim Soo-bin’s disappearance had to do with the mutilation murder case. </span><span style=\"\">It was right to interpret the two things as being related.</span></p><br/><p><span style=\"\">Anyway, Kang-suk would soon find out more about the mutilation murders. </span><span style=\"\">Then he would focus on solving Kim Soo-bin’s disappearance. </span><span style=\"\">In short, it was a division of labor.</span></p><br/><p><span style=\"\">Tae-hyuk decided to get some clues from Hye-mi.</span></p><br/><p><span style=\"\">“Are you called Hye-mi? Hello. I am Tae-hyuk.”</span></p><br/><p><span style=\"\">“Bah!”</span></p><br/><p><span style=\"\">He was ignored, but that wasn’t enough to make Tae-hyuk give up.</span></p><br/><p><span style=\"\">\"Um. In fact, I also care about the missing Soo-bin. I want you to help me find her. Can you tell me anything?”</span></p><br/><p><span style=\"\">“......”</span></p><br/><p><span style=\"\">Tae-hyuk knew how to persuade this type of girl. </span><span style=\"\">To this end, he created a poor atmosphere. </span><span style=\"\">He whistled and shook,</span></p><br/><p><span style=\"\">\"Hwii~ if Hye-mi doesn’t help then I guess I have to look for myself. But if I find her myself, why don’t I ask for a kiss? Why are girls attracted to bad guys? Who knows what I will suggest.”</span></p><br/><p><span style=\"\">Hye-mi’s face turned white at my words.</span></p><br/><p><span style=\"\">“S-Stop. I understand. I’ll help you find Unni. Just please, no kiss...”</span></p><br/><p><span style=\"\">Tae-hyuk felt a lump in his chest at that moment. </span><span style=\"\">Was he such a bad person? </span><span style=\"\">So far, the only magic that he used...</span></p><br/><p><span style=\"\">Hye-mi fidgeted with her fingers and started talking.</span></p><br/><p><span style=\"\">\"I’ll tell you first. I live with Soo-bin unni at this orphanage, but we aren’t orphans. Don’t be mistaken.”</span></p><br/><p><span style=\"\">Tae-hyuk nodded.</span></p><br/><p><span style=\"\">“Understood.”</span></p><br/><p><span style=\"\">\"I met Unni for the first time at the Emergency Relief Centre.”</span></p><br/><p><span style=\"\">Hye-mi and Soo-bin, two victims of domestic violence. </span><span style=\"\">These victims had the nickname of DV.</span></p><br/>\n</div>"}