{"title": "Chapter 81 - Phantom Opens His Eyes #3", "id": 81, "volume": 1, "url": "http://boxnovel.org/god-of-crime-chapter-81-phantom-opens-his-eyes-3", "volume_title": "Volume 1", "body": "<h1>Chapter 81 - Phantom Opens His Eyes #3</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 81 - Phantom Opens His Eyes #3</p><br/><p><span style=\"\">The guards standing outside the smoking boiler room were afraid to move.</span></p><br/><p><span style=\"\">\"Someone go in and check it out!”</span></p><br/><p><span style=\"\">\"There’s too much smoke to go in!”</span></p><br/><p><span style=\"\">\"If the oil catches on fire then we’ll all die!”</span></p><br/><p><span style=\"\">The chief, who was responsible for managing the security guards, raised his voice. </span><span style=\"\">However, he couldn’t think of a plausible solution. </span><span style=\"\">One of the guards stammered out,</span></p><br/><p><span style=\"\">\"C-Chief. Wouldn’t it be better to report it to the Fire Department?”</span></p><br/><p><span style=\"\">The chief’s face distorted.</span></p><br/><p><span style=\"\">\"What did you just say? Do you know how complicated it would become if firefighters came here? They would go everywhere like cockroaches. We aren’t playing house right now!”</span></p><br/><p><span style=\"\">The security guard trembled. </span><span style=\"\">What would happen if it was known that they were trafficking body organs here?</span></p><br/><p><span style=\"\">Most of the directors and members belonged to the Chinese mafia. </span><span style=\"\">Even if they were caught, there were many avenues of escape. </span><span style=\"\">What would happen to the guards who did their dirty work? </span><span style=\"\">These days, scapegoats were always necessary. </span><span style=\"\">His death would be disguised as a suicide after confessing to all of the crimes.</span></p><br/><p><span style=\"\">The smoke coming from the boiler room was literally horrible. </span><span style=\"\">Just breathing in a little of it would cause water to leak out from their bodies.</span></p><br/><p><span style=\"\">\"Fuck, what type of fire would cause smoke like this?”</span></p><br/><p><span style=\"\">It was the special product of the army but the chief of the bodyguards were unaware of this fact.</span></p><br/><p><span style=\"\">\"This will stop any toxic gases.”</span></p><br/><p><span style=\"\">One smart security guard dipped water on a towel to create a gas mask. </span><span style=\"\">The chief’s expression brightened.</span></p><br/><p><span style=\"\">“Really? Then go inside and check where the fire is coming from. Others will go into the building and get the fire extinguishers. I think we can put out the fire between us.”</span></p><br/><p><span style=\"\">\"I-I am going inside?”</span></p><br/><p><span style=\"\">\"Then should I be going in?”</span></p><br/><p><span style=\"\">\"Ah, no.”</span></p><br/><p><span style=\"\">In the end, the security guard who made the gas mask was forced to enter. </span><span style=\"\">He didn’t have the guts to refuse the command. </span><span style=\"\">He blocked his mouth and nose with the towel and boldly ran into the smoke.</span></p><br/><p><span style=\"\">\"Cough... Cough!”</span></p><br/><p><span style=\"\">However, it wasn’t enough to stop all of the teargas. </span><span style=\"\">The chief clicked his tongue as he heard the guard coughing painfully.</span></p><br/><p><span style=\"\">\"If you are going to make it then you should do it properly.”</span></p><br/><p><span style=\"\">How much time passed? </span><span style=\"\">The black smoke was coming out of a large drum. </span><span style=\"\">The amazing thing was that no matter how much he looked, the smoke really was coming from the drum barrel.</span></p><br/><p><span style=\"\">\"Here it is. This is the source of the smoke... Cough! Cough!”</span></p><br/><p><span style=\"\">The chief looked at what the security guard brought out.</span></p><br/><p><span style=\"\">“Then it wasn’t a fire...?”</span></p><br/><p><span style=\"\">Several guards blocked their mouths and looked at the drum and the hidden trick was found.</span></p><br/><p><span style=\"\">\"I don’t think it’s poison gas. It feels like somebody mixed a smoke bomb with something else.</span></p><br/><p><span style=\"\">“Who the hell did th...”</span></p><br/><p><span style=\"\">At that moment, something popped into the chief’s head.</span></p><br/><p><span style=\"\">“...Wait a minute. Who’s left inside the building now?”</span></p><br/><p><span style=\"\">“It was an urgent situation so I think most of our forces are here.”</span></p><br/><p><span style=\"\">The face of the chief distorted after hearing the answer and pulled out the gun hanging from his waist.</span></p><br/><p><span style=\"\">“It seems like we fell into a trap. The hostages are in danger.”</span></p><br/><p><span style=\"\">The armed security guards entered the building.</span></p><br/><p><span style=\"\">The time spent was exactly 10 minutes, like Tae-hyuk predicted.</span></p><br/><p><span style=\"\">@</span></p><br/><p><span style=\"\">\"It should be time for the guards to come back.”</span></p><br/><p><span style=\"\">Soo-bin’s face paled as she heard Phantom’s words.</span></p><br/><p><span style=\"\">\"W-What should we do? Everybody can’t move properly...”</span></p><br/><p><span style=\"\">Soo-bin looked at the condition of the rescued children. </span><span style=\"\">All of them had lost a body part and couldn’t move properly. </span><span style=\"\">There were only four people who were saved.</span></p><br/><p><span style=\"\">The rest...</span></p><br/><p><span style=\"\">Phantom carried a boy missing a leg and said,</span></p><br/><p><span style=\"\">\"Do you know Second Generation Suffering?”</span></p><br/><p><span style=\"\">“Ah...”</span></p><br/><p><span style=\"\">Soo-bin understood Phantom’s words.</span></p><br/><p><span style=\"\">It was a famous novel. </span><span style=\"\">A man who fought in Japan lost his arm and returned home, only for his son to lose his leg to a hand grenade. </span><span style=\"\">The two people worried about each other and supported each other with what they were each lacking.</span></p><br/><p><span style=\"\">“I marked the escape route on the map. If you follow this then you will be able to get out of the building. Once outside, call the number already registered on this phone and a man will come to save you.”</span></p><br/><p><span style=\"\">Kim Soo-bin nodded. </span><span style=\"\">Suddenly, she realized that Phantom was missing from the escape plan.</span></p><br/><p><span style=\"\">“Phantom won’t be escaping?”</span></p><br/><p><span style=\"\">\"I still have work to do.”</span></p><br/><p><span style=\"\">Kim Soo-bin asked, </span></p><br/><p><span style=\"\">“Aren’t you here to save us?”</span></p><br/><p><span style=\"\">\"I told you. You are a bonus.”</span></p><br/><p><span style=\"\">Phantom seemed to know what Kim Soo-bin was worried about. </span><span style=\"\">She was afraid that they would be caught again when escaping.</span></p><br/><p><span style=\"\">Phantom spoke quietly to Soo-bin,</span></p><br/><p><span style=\"\">“Don’t worry. I will stop the security guards.”</span></p><br/><p><span style=\"\">“T-That’s not...”</span></p><br/><p><span style=\"\">Soo-bin tried to say something else but he swiftly turned away. </span><span style=\"\">Then she looked at Phantom who was leaving and asked,</span></p><br/><p><span style=\"\">\"Can I meet you again?”</span></p><br/><p><span style=\"\">\"That would be hard.”</span></p><br/><p><span style=\"\">\"That, I would like to reward you for rescuing...”</span></p><br/><p><span style=\"\">Phantom laughed,</span></p><br/><p><span style=\"\">\"I'm sorry but I am expensive. You don’t have enough money to satisfy me.”</span></p><br/><p><span style=\"\">\"I-I wasn’t planning to give you money. J-Just my sincerity.”</span></p><br/><p><span style=\"\">\"If there is anything like that then give it to Song Hye-mi. It was that child who moved me.”</span></p><br/><p><span style=\"\">“H-Hye-mi?”</span></p><br/><p><span style=\"\">Phantom spoke some final words as he headed down to 2B.</span></p><br/><p><span style=\"\">\"Remember that you are alive because there was someone who wanted to fight against fate. Every single second and every single minute that you are alive is a miracle. So live well, Kim Soo-bin.”</span></p><br/><p><span style=\"\">Kim Soo-bin realized that it was the best encouragement that Phantom could give. </span><span style=\"\">She was a orphan who no one cared about, and now she was even missing one arm.</span></p><br/><p><span style=\"\">But...</span></p><br/><p><span style=\"\">She survived. </span><span style=\"\">She was breathing. </span><span style=\"\">She could hug Hye-mi once again.</span></p><br/><p><span style=\"\">Phantom disappeared from in front of her. </span><span style=\"\">Tears streamed from Soo-bin’s eyes.</span></p><br/><p><span style=\"\">The five kidnapped children survived the hell called T Medical Center.</span></p><br/><p><span style=\"\">@</span></p><br/><p><span style=\"\"><span>[5]</span></span></p><br/><p><span style=\"\">[You can use the affinity points to enhance crime skills or activate hidden attributes.]</span></p><br/><p><span style=\"\">Tae-hyuk looked at the Demon Revealing Mirror. </span><span style=\"\">Fortunately, the five children seemed to have made it out unharmed.</span></p><br/><p><span style=\"\">‘I have goose bumps... Now that there is no one to hear, I can stop using Voice Modulation.’</span></p><br/><p><span style=\"\">He had used Kim Bum-soo’s voice in order to hide his identity. </span><span style=\"\">The side effect of speaking with such a dignified tone appeared. </span><span style=\"\">Tae-hyuk decided to strengthen his combat ability with the points he just gained.</span></p><br/><p><span style=\"\">'There is a bomb but I don’t know what will happen. Wouldn’t it be nice to have insurance?’</span></p><br/><p><span style=\"\">Violence. </span><span style=\"\">There were a few attributes that could be raised. </span></p><br/><p><span style=\"\">He could have the killing intent of a person who fought for their whole lives. </span><span style=\"\">There was also having a sixth sense about how the enemy will attack when they were near him. </span><span style=\"\">He could deal tremendous power with one strike. </span><span style=\"\">Finally, at the end of the fighting, he could see the optimal attack route.</span></p><br/><p><span style=\"\">Those were the attributes available with the Violence skill.</span></p><br/><p><span style=\"\">Tae-hyuk picked ‘Sixth Sense’ to detect the opponent’s attack.</span></p><br/><p><span style=\"\">'It happens to be exactly five points.’</span></p><br/><p><span style=\"\">[Crime Skill: Violence has gained a new attribute.]</span></p><br/><p><span style=\"\">[’Sixth Sense’, the ability to read your opponent’s attack has been acquired.]</span></p><br/><p><span style=\"\">[The range of the Spying skill has increased.]</span></p><br/><p><span style=\"\">Tae-hyuk sighed with relief as he safely gained the attribute. </span><span style=\"\">The detection range seemed to be around two to three meters.</span></p><br/><p><span style=\"\">'Does this mean I will have no rivals in close combat?’</span></p><br/><p><span style=\"\">How much stronger would he become if he was a Noble? </span><span style=\"\">Tae-hyuk got goosebumps.</span></p><br/><p><span style=\"\">‘Well. They are coming.’</span></p><br/><p><span style=\"\">A bunch of people running could be seen at the end of the corridor. </span><span style=\"\">There was no need to use a skill.</span></p><br/><p><span style=\"\">“...The children have disappeared!”</span></p><br/><p><span style=\"\">\"W-What the?”</span></p><br/><p><span style=\"\">Standing at the front of the crowd was Chief Park, a former mixed martials arts athlete.</span></p><br/><p><span style=\"\">\"Chief Park! I think he is the culprit!”</span></p><br/><p><span style=\"\">Someone shouted as they discovered Tae-hyuk.</span></p><br/><p><span style=\"\">'Four out of the 10 people have guns.’</span></p><br/><p><span style=\"\">They were abnormally armed due to receiving the support of the triad. </span><span style=\"\">He was able to see how much was invested into this place.</span></p><br/><p><span style=\"\">‘Sheesh. I don’t want to be killed by a bullet. I’ll have to use it here.’</span></p><br/><p><span style=\"\">He just wanted to test the power of the new attribute he just learned but the situation wasn’t good. </span><span style=\"\">Tae-hyuk cried out to the incoming guards,</span></p><br/><p><span style=\"\">“Stop.”</span></p><br/><p><span style=\"\">\"What are you saying? You should be the one worried. First, I will tear out your eyes and then slice you up while you are alive. Everyone...”</span></p><br/><p><span style=\"\">Tae-hyuk pointed his finger towards the people running.</span></p><br/><p><span style=\"\">\"Fire.”</span></p><br/><p><span style=\"\">Then he literally threw his body onto the floor.</span></p><br/><p><i><span style=\"\">Peeeeeong!</span></i></p><br/><p><span style=\"\">The bomb he installed in advance exploded and huge flames emerged.</span></p><br/><p><i><span style=\"\">Kukukung!</span></i></p><br/><p><span style=\"\">Half of B2 disappeared.</span></p><br/><p><span style=\"\">Tae-hyuk had lowered his body as much as possible to minimize the impact of the explosion and muttered.</span></p><br/><p><span style=\"\">\"What did I say? I told you to stop.”</span></p><br/><p><span style=\"\">Looking again, it truly contained enormous power. </span><span style=\"\">This was the weakest of the bombs that the Bomber made. </span><span style=\"\">Otherwise, the entire building would’ve collapsed.</span></p><br/><p><span style=\"\">\"Then there is one bomb left.”</span></p><br/><p><span style=\"\">Tae-hyuk muttered as he looked at the box in his bag.</span></p><br/><p><span style=\"\">@</span></p><br/><p><span style=\"\">“Keuk... T-This bastard...”</span></p><br/><p><span style=\"\">Most of the guards were alive despite being blown away by the explosion. </span><span style=\"\">Of course, that didn’t mean they were fine. </span><span style=\"\">At least one place on their bodies was broken.</span></p><br/><p><span style=\"\">Tae-hyuk, who was covered in dirt, walked over to the guards.</span></p><br/><p><span style=\"\">\"Did you enjoy the appetizer? Ah right, I’ll say it again but you better not approach me carelessly. There is a bomb that is 100 times stronger here.”</span></p><br/><p><span style=\"\">\"K-Kuheok!”</span></p><br/><p><span style=\"\">The guards groaned as Tae-hyuk tapped his bag.</span></p><br/><p><span style=\"\">\"It looks like you are the boss. I will take the chief with me. Come along.”</span></p><br/><p><span style=\"\">\"W-Where are you taking Chief-nim?”</span></p><br/><p><span style=\"\">“Yes. If you don’t like it then you can stay here. This guy will explode soon.”</span></p><br/><p><span style=\"\">The guards trembled. </span><span style=\"\">The power of the bomb that just exploded was huge, but 100 times that? </span><span style=\"\">The building itself would disappear.</span></p><br/><p><span style=\"\">Tae-hyuk walked to the chairman’s office on the second floor with a relaxed expression. </span><span style=\"\">He was followed by the wounded security guards. </span><span style=\"\">Their current number wasn’t even half of their original state. </span><span style=\"\">The crime prevention device that obstructed the path was resolved by a pass that Chief Park had.</span></p><br/><p><span style=\"\">The chairman of T Medical Center was sitting on a chair in the luxurious office and talking to someone. </span><span style=\"\">It was an executive from the triads, Yang Wei, who pulled out a gun and aimed at Tae-hyuk.</span></p><br/><p><span style=\"\">“I’ve never seen this face before. What do you want?”</span></p><br/><p><span style=\"\">Yang Wei saw the bloody guards behind Tae-hyuk. </span><span style=\"\">Tae-hyuk shrugged and replied,</span></p><br/><p><span style=\"\">\"If you have ears then you would’ve heard the explosion just before.</span></p><br/><p><span style=\"\">“What did you do?” (Spoken in Chinese)</span></p><br/><p><span style=\"\">Chinese flowed from the mouth of the confused Yang Wei.</span></p><br/><p><span style=\"\">Tae-hyuk laughed and said,</span></p><br/><p><span style=\"\">\"You must have heard on the news that a bombing occurred recently.”</span></p><br/><p><span style=\"\">“D-Don’t tell me...”</span></p><br/><p><span style=\"\">“Yes. For reference, the one that just exploded is the weakest of my bombs. Ah right. You can shoot me if you want. Then they will instantly explode.”</span></p><br/><p><span style=\"\">\"Bullshit!” (Chinese)</span></p><br/><p><span style=\"\">Yang Wei got up from his chair and yelled.</span></p><br/><p><span style=\"\">The whole building had shaken from the previous explosion. </span><span style=\"\">Yet there was a stronger bomb?</span></p><br/><p><span style=\"\">\"Speak Korean. I don’t understand.”</span></p><br/><p><span style=\"\">“...What do you want? Are you an assassin sent from Heavenly Supremacy?”</span></p><br/><p><span style=\"\">\"Ding! I am sent from the Mary Convent.”</span></p><br/><p><span style=\"\">It was the first time Yang Wei heard of that organization.</span></p><br/><p><span style=\"\">\"You shouldn’t think too hard. It is an orphanage.”</span></p><br/><p><span style=\"\">Yang Wei’s face distorted as he realized Tae-hyuk’s purpose. </span><span style=\"\">They had deliberately kidnapped orphans since no one cared about them. </span><span style=\"\">Yet there happened to be a bodyguard.</span></p><br/><p><span style=\"\">Yang Wei shouted with his expression still distorted.</span></p><br/><p><span style=\"\">\"W-Will you go quietly if I give them to you? I-I will also give you money.”</span></p><br/><p><span style=\"\">\"Don’t think that I am a bad person. I haven’t come to kill you. I’m just going to play a simple game.”</span></p><br/><p><span style=\"\">“Game?”</span></p><br/><p><span style=\"\">Tae-hyuk sat down on a chair in the corner of the office.</span></p><br/><p><span style=\"\">\"I’ll give you exactly 10 minutes. Gather all of the officials here. It is exactly 10 minutes. Not 9 minutes, nor 11 minutes. If they are even one minute late, then the bomb will explode and this building will fly away.</span></p><br/><p><span style=\"\">“Kuk!”</span></p><br/><p><span style=\"\">Tae-hyuk was the one holding the knife and Yang Wei was forced to quietly follow his order.</span></p><br/><p><span style=\"\">\"Then I will ask you one last thing. What is the game?”</span></p><br/><p><span style=\"\">Tae-hyuk smiled and replied,</span></p><br/><p><span style=\"\">“Doll Play.”</span></p><br/><p></p><div class=\"footnotes\"><ol><li><span id=\"footnote-5\">affinity points have been acquired.<i class=\"fa fa-hand-o-left\"></i></span></li></ol></div><br/>\n</div>"}