{"title": "Chapter 92 - Big Brothers Raid #3", "id": 92, "volume": 1, "url": "http://boxnovel.org/god-of-crime-chapter-92-big-brothers-raid-3", "volume_title": "Volume 1", "body": "<h1>Chapter 92 - Big Brothers Raid #3</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span style=\"\">Chapter 92 - Big Brother’s Raid #3</span></p><br/><p><span style=\"\">Shin Se-ho felt great.</span></p><br/><p><span style=\"\">“Hahaha! Drink, drink! I will pay for it today!”</span></p><br/><p><span style=\"\">\"Can Sunbae really do it?”</span></p><br/><p><span style=\"\">“Of course.”</span></p><br/><p><span style=\"\">ABS Station’s AD, Kwon Joon-hyuk, pulled the girl sitting next to him closer to him.</span></p><br/><p><span style=\"\">\"Aish, what is Oppa doing?”</span></p><br/><p><span style=\"\">“Shin Se-ho PD... No, this news department head will treat you! Let’s drink!”</span></p><br/><p><span style=\"\">Alcohol was consumed and the girl’s breaths smelled of alcohol. </span><span style=\"\">The waiter came over with bottles of alcohol and fruit snacks. T</span><span style=\"\">here was already beer on the table. </span><span style=\"\">Then the appetizing snacks were placed down.</span></p><br/><p><span style=\"\">“Beer service!”</span></p><br/><p><span style=\"\">A female extended some bomb shots to Shin Se-ho and Kwon Joon-hyuk. </span><span style=\"\">Shin Se-ho gulped it down with a red face and a breath that was stinking of alcohol.</span></p><br/><p><span style=\"\">\"Kwon Joon-hyuk! What did I say? Didn’t I say to trust in and follow Hyung?”</span></p><br/><p><span style=\"\">Shin Se-ho had been on the rise after revealing the secret hobbies of domestic conglomerates. </span><span style=\"\">Soon after, he revealed the truth about the hippo case that the police had been trying to conceal. </span><span style=\"\">That alone was tremendous.</span></p><br/><p><span style=\"\">Usually, PDs only reported exclusive scoops once or twice a year. </span><span style=\"\">However, Shin Se-ho had several jackpots successively.</span></p><br/><p><span style=\"\">\"There was an exclusive interview with Phantom. How did you get that?”</span></p><br/><p><span style=\"\">\"I’ll just say it here. I’m close to Phantom., so if I call him, then he will come running right away.”</span></p><br/><p><span style=\"\">“Wah...”</span></p><br/><p><span style=\"\">Shin Se-ho worked as a PD at ABS Station. </span><span style=\"\">As a PD, he had to follow most general events. </span><span style=\"\">It had been two years since he started stalking detectives in order to get a scoop. </span><span style=\"\">He finally got recognized due to meeting Phantom.</span></p><br/><p><span style=\"\">\"I was originally going to try other stations, but the chief held my leg and asked for me to remain at ABS Station.”</span></p><br/><p><span style=\"\">\"Kya! As expected from Shin Se-ho hyung-nim! Now the world recognizes Hyung-nim.”</span></p><br/><p><span style=\"\">Shin Se-ho laughed at the compliments and ate the fruit snacks. </span><span style=\"\">His title at the station was PD, but now he was promoted up two levels. </span><span style=\"\">Starting today, he was a Chief Producer, a CP, not a PD. </span><span style=\"\">The CP managed the PDs, and was in charge of the total production of the broadcasts. </span><span style=\"\">It could be said that his position would be equivalent to a general executive at other companies.</span></p><br/><p><span style=\"\">\"I can also use the corporate card that wasn’t available in my PD days.”</span></p><br/><p><span style=\"\">Shin Se-ho waved a luxurious gold-plated credit card that was held between his fingers.</span></p><br/><p><span style=\"\">Kwon Joon-hyuk hadn’t heard the contents of the deal between Shin Se-ho and Phantom. </span><span style=\"\">Why had Phantom given Shin Se-ho the right to interview him? </span><span style=\"\">He asked Shin Se-ho, who replied,</span></p><br/><p><span style=\"\">“Are you crazy? Do you think I will cut the belly of the duck laying the golden eggs?”</span></p><br/><p><span style=\"\">\"I-Is that so?”</span></p><br/><p><span style=\"\">At that moment, a female grabbed Shin Se-ho’s arm.</span></p><br/><p><span style=\"\">“Oppa. Let’s sing. I want to hear 18 Times.”</span></p><br/><p><span style=\"\">“Yes.”</span></p><br/><p><span style=\"\">The two people went on stage and started singing a slow blues song.</span></p><br/><p><span style=\"\">Kwon Joon-hyuk licked his lips. </span><span style=\"\">Such a person was now the chief producer. </span><span style=\"\">He started to worry about the future of ABS Station.</span></p><br/><p><span style=\"\">\"Ah, I don't know. Today is a day to play! Now, let’s go and sing.</span></p><br/><p><span style=\"\">“Yes!”</span></p><br/><p><span style=\"\">Kwon Joon-hyuk put an arm around a woman’s shoulders and walked towards the stage. </span><span style=\"\">Then the door opened and a man in a sharp suit entered. </span><span style=\"\">He had such a strong physique that he could be in an action movie right now.</span></p><br/><p><span style=\"\">Shin Se-ho, who was playing with the female, turned and looked at the man.</span></p><br/><p><span style=\"\">“What? I didn’t call for the waiter.”</span></p><br/><p><span style=\"\">The man, who was mistaken as a waiter, looked around the room.</span></p><br/><p><span style=\"\">“Are you Shin Se-ho?”</span></p><br/><p><span style=\"\">The unpleasant pronunciation showed that he wasn’t familiar with Korean.</span></p><br/><p><span style=\"\">\"Uh, that is me. Did rumors about me already circulate? I am a bit famous. Huhu...”</span></p><br/><p><span style=\"\">Shin Se-ho felt proud and took out a 50,000 won bill from his pocket.</span></p><br/><p><span style=\"\">\"Can you buy me a pack of cigarettes? Marlboro red. You can keep the remaining change as a tip.”</span></p><br/><p><span style=\"\">The man... no, Big Brother laughed. </span><span style=\"\">He pulled out the Tokarev TT-33 and aimed it at Shin Se-ho’s head.</span></p><br/><p><span style=\"\">“It seems like I’ve come to the right place. The tip is for your life.”</span></p><br/><p><span style=\"\">Big Brother quietly closed the door and entered. </span><span style=\"\">The people inside screamed until their throats were sore. </span><span style=\"\">However, it was a place with good soundproofing so the screams didn’t escape outside.</span></p><br/><p><span style=\"\">@</span></p><br/><p><span style=\"\">There were a few reasons why Big Brother chose the karaoke bar as the place to keep the hostages. (In Korea: a karaoke bar has girls working working there, sort of like an escort bar)</span></p><br/><p><span style=\"\">It sold alcohol, snacks and other illegal things. </span><span style=\"\">Thus, CCTV were installed everywhere to avoid a police crackdown. </span><span style=\"\">There were devices installed inside the room and the structure outside was unknown. </span><span style=\"\">Instead was like a maze with multiple random passages.</span></p><br/><p><span style=\"\">It was a fortress that didn’t allow enemy penetration.</span></p><br/><p><span style=\"\">There were 30 hostages in the room, including Shin Se-ho and Kwon Joon-hyuk. </span><span style=\"\">Most of them were employees and girls working at the karaoke bar. </span><span style=\"\">Unfortunately, some students who used the convenience store on the first floor were also trembling among the adults.</span></p><br/><p><span style=\"\">One young man whispered to another.</span></p><br/><p><span style=\"\">“Did you hear? If Phantom doesn’t show up, then he will kill the hostages one by one... Before that, we have to neutralize him somehow.</span></p><br/><p><span style=\"\">“That’s right. Even if he has guns, aren’t we more numerous? I think we can neutralize him if we strike at the same time but...”</span></p><br/><p><span style=\"\">\"I think there will be good enough odds if 10 people join together.”</span></p><br/><p><span style=\"\">\"I agree.\"</span></p><br/><p><span style=\"\">\"Me too.”</span></p><br/><p><span style=\"\">Big Brother hadn’t tied up the hostages. </span><span style=\"\">He was just blocking the entrance so that no one could leave the room. </span><span style=\"\">The hostages were talking so low that Big Brother couldn’t hear them. </span><span style=\"\">They would jump from four directions at the same time, suppressing the opponent and taking his guns. </span><span style=\"\">It was better to risk one’s life fighting than to die one by one.</span></p><br/><p><span style=\"\">On the right, the man who decided to strike Big Brother was anxious. </span><span style=\"\">Among the hostages here, there were many men working as waiters, their numbers reaching more than 10 people. </span><span style=\"\">How confident was that person in his ability that he didn’t even tie them up?</span></p><br/><p><span style=\"\">Still, they would just die at Big Brother’s hand if time kept passing. </span><span style=\"\">If so, he would rather risk his life to fight. </span><span style=\"\">The determined man bit his lip. </span><span style=\"\">He nodded towards the other hostages.</span></p><br/><p><span style=\"\">Someone counted down in a low voice.</span></p><br/><p><span style=\"\">“3... 2... 1... Pounce!”</span></p><br/><p><span style=\"\">A dozen people instantly jumped towards Big Brother. </span><span style=\"\">They lowered their bodies as much as possible and focused on making it difficult for the opponent to hit them with his gun. </span><span style=\"\">Big Brother held the gun in one hand and slowly opened his eyes. </span><span style=\"\">He didn’t seem confused at all by the hostages’ actions.</span></p><br/><p><span style=\"\">Then he muttered,</span></p><br/><p><span style=\"\">\"There are a lot of people so killing a few hostages should be okay.”</span></p><br/><p><span style=\"\">Big Brother rotated his body and kicked one of the hostages.</span></p><br/><p><span style=\"\">“Keok!”</span></p><br/><p><span style=\"\">He then turned and pulled the trigger at the men who were trying to do a back tackle.</span></p><br/><p><i><span style=\"\">Tang!</span></i><i><span style=\"\">Tatang!</span></i></p><br/><p><span style=\"\">“Kuheok!”</span></p><br/><p><span style=\"\">A man was shot in the leg and rolled across the floor. </span><span style=\"\">On his right, the man who tried to jump Big Brother was shot in the head.</span></p><br/><p><span style=\"\">Big Brother laughed,</span></p><br/><p><span style=\"\">\"Did you wonder why I didn’t tie you up? The reason is simple. Even 100 of you lowlives wouldn’t be able to beat me.”</span></p><br/><p><span style=\"\">“Aaaaack!\"</span></p><br/><p><span style=\"\">One waiter took a knife and attacked Big Brother from a blind spot. </span><span style=\"\">The knife struck Big Brother’s chest and the waiter shouted loudly,</span></p><br/><p><span style=\"\">\"Hahaha! I did it. My attack...”</span></p><br/><p><span style=\"\">Big Brother casually looked back and fired his gun. </span><span style=\"\">It pierced the waiter’s waist precisely.</span></p><br/><p><span style=\"\">The hostages started to feel despair.</span></p><br/><p><span style=\"\">\"I'm sorry but your attacks won’t work on me while I’m wearing this.”</span></p><br/><p><span style=\"\">Big Brother took off his suit and showed the trembling hostages. </span><span style=\"\">It was a reinforced suit. </span><span style=\"\">It was like he was wearing black armor.</span></p><br/><p><span style=\"\">\"B-Body armour...!”</span></p><br/><p><span style=\"\">He wore a reinforced suit made of Kevlar. </span><span style=\"\">Special products made of those fibers were used in various bulletproof shirts. </span><span style=\"\">He wore it around his whole body. </span><span style=\"\">Even if it was hard to move, the ability to protect the body was enormous.</span></p><br/><p><span style=\"\">Furthermore, the rubbery black fibres on the outside were Nomex. </span><span style=\"\">It was a special fiber used for firefighting clothing, as it had great heat resistance and electrical insulation. </span><span style=\"\">In the end, he couldn’t be hurt, even if he was attacked with a stun gun. </span><span style=\"\">The only downside was that it felt like an extra 20kg of weight was on the body. </span><span style=\"\">It was the same as wearing huge sandbags on the body.</span></p><br/><p><span style=\"\">\"Being able to move like that while wearing this...”</span></p><br/><p><span style=\"\">He had handled 10 hostages in an instant.</span></p><br/><p><span style=\"\">“Ahh... Ahhhhh!”</span></p><br/><p><span style=\"\">The remaining people could only scream. </span><span style=\"\">Big Brother knocked on his suit and muttered,</span></p><br/><p><span style=\"\">\"If you want to knock me down while wearing this, you should bring an anti-tank rocket.”</span></p><br/><p><span style=\"\">Kwon Joon-hyuk, who was hiding among the hostages, groaned. </span><span style=\"\">Then he spoke to the injured Shin Se-ho. </span><span style=\"\">Shin Se-ho had several bullets in his shoulders and thighs. </span><span style=\"\">Despite that, he didn’t give Phantom’s contact details.</span></p><br/><p><span style=\"\">Therefore, Big Brother took hostages and made an announcement to the police.</span></p><br/><p><span style=\"\">-</span><i><span style=\"\">If Phantom doesn’t come here within 30 minutes then I will kill the hostages one by one.</span></i></p><br/><p><span style=\"\">This was the condition that Big Brother gave to the police.</span></p><br/><p><span style=\"\">“D-Department Head... Do you really not know Phantom’s contact details?”</span></p><br/><p><span style=\"\">“Eu.... euhhh.... I said I don’t know...”</span></p><br/><p><span style=\"\">\"You said you were friends!”</span></p><br/><p><span style=\"\">“......”</span></p><br/><p><span style=\"\">Shin Se-ho had no words to say and could only bite his lips. </span><span style=\"\">Big Brother didn’t seem to believe him but what he said was real. </span><span style=\"\">The relationship with Phantom was only one way. </span><span style=\"\">Shin Se-ho couldn’t do anything unless he was contacted.</span></p><br/><p><span style=\"\">“Phantom...”</span></p><br/><p><span style=\"\">Shin Se-ho called out Phantom’s name in his pain-filled state. </span><span style=\"\">Would Phantom come here to save him and the hostages?</span></p><br/><p><span style=\"\">If he did, Phantom wasn’t just a criminal...</span></p><br/><p><span style=\"\">@</span></p><br/><p><span style=\"\">Tae-hyuk arrived at the scene to find the neighborhood completely sealed off by police and soldiers.</span></p><br/><p><span style=\"\">“No... I told him to release the hostages. Block it off completely to stop anyone from entering.”</span></p><br/><p><span style=\"\">The soldiers were the 35th Battalion of the Capital Defense Command. </span><span style=\"\">He had encountered them during the Bomber case. </span><span style=\"\">They were a special unit specialization in street warfare and counterterrorism, but now they were just blocking off the road.</span></p><br/><p><span style=\"\">\"First of all, I have to somehow enter.”</span></p><br/><p><span style=\"\">He could go up to the police.</span></p><br/><p><i><span style=\"\">-I am Phantom.</span></i><i><span style=\"\">From now on, I will plunge into enemy territory!</span></i></p><br/><p><span style=\"\">That wouldn’t happen. </span><span style=\"\">It was impossible for an average person to get past that surveillance and enter, but it was possible for Tae-hyuk who had the crime skills.</span></p><br/><p><span style=\"\">‘Then let’s use my newly acquired skill.’</span></p><br/><p><span style=\"\">First of all, he used Counterfeit to change his leather jacket into a soldier uniform. </span><span style=\"\">Then he use Disguise to get the face of Sergeant Kim Ha-sae who he met several times. </span><span style=\"\">The Demon Revealing Mirror showed that he had become a completely different person.</span></p><br/><p><span style=\"\">‘There is a bit of height difference. Was he originally taller due to his combat boots?’</span></p><br/><p><span style=\"\">Tae-hyuk approached a soldier who formed part of the blockade.</span></p><br/><p><span style=\"\">\"The road is fully sealed off, and not even a single ant will be able to enter.”</span></p><br/><p><span style=\"\">Park Jong-sa, who was maintaining the barrier, looked at Tae-hyuk and said,</span></p><br/><p><span style=\"\">\"Sergeant Kim. Didn’t I tell you to make a barrier on the roof? Why did you come down here?”</span></p><br/><p><span style=\"\">Tae-hyuk didn’t panic and said,</span></p><br/><p><span style=\"\">\"The captain asked me to check the blockade.”</span></p><br/><p><span style=\"\">“Really?”</span></p><br/><p><span style=\"\">In this situation, it was good to borrow the name of the boss. </span><span style=\"\">It was even better if they were a very high ranking person that couldn’t be questioned.</span></p><br/><p><span style=\"\">Sergeant Park pointed inside with his thumb. </span><span style=\"\">It was a quick signal telling him to go inside.</span></p><br/><p><span style=\"\">“Then keep up the good work. Charge!\"</span></p><br/><p><span style=\"\">Park Jong-sa clicked his tongue as he saw Tae-hyuk saluting.</span></p><br/><p><span style=\"\">“Aigoo, look at that salute. This is a real situation. He should go back to basic training.” </span></p><br/><p><span style=\"\">“......”</span></p><br/><p><span style=\"\">Tae-hyuk had a moment of silence for Kim Ha-sae before moving to the back of the karaoke bar.</span></p><br/><p><span style=\"\">‘The killer is sent by the Triads.’</span></p><br/><p><span style=\"\">It was obviously that the opponent would possess a great deal of firepower that he couldn’t deal with. </span><span style=\"\">Tae-hyuk wouldn’t be able to fight him with the Violence skill and iron pipe.</span></p><br/><p><span style=\"\">'But for weak people, there is a weak way of fighting.’</span></p><br/><p><span style=\"\">Five minutes later, Counterfeit was released and his leather jacket was restored. </span><span style=\"\">Tae-hyuk took the phantom mask from his pocket and placed it on his face.</span></p><br/><p><span style=\"\">Phantom and Big Brother.</span></p><br/><p><span style=\"\">The two criminals’ fight was about to start.</span></p><br/>\n</div>"}