{"title": "Chapter 107: Pieces of the Puzzle #4", "id": 107, "volume": 2, "url": "http://boxnovel.org/god-of-crime-chapter-107-pieces-of-the-puzzle-4", "volume_title": "Volume 2", "body": "<h1>Chapter 107: Pieces of the Puzzle #4</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span style=\"\">Chapter 107: Pieces of the Puzzle #4</span></p><br/><p><span style=\"\">He had the things needed to control Yoo Cheol-ho, and now he could really start exploring the prison. </span><span style=\"\">After taking out the goods in his stomach, Tae-hyuk sat on the bed and rested for a while.</span></p><br/><p><span style=\"\">Even if the wound disappeared with ‘Cancel’, the damage to the body remained.</span></p><br/><p><span style=\"\">“…But even the blood is gone? Isn’t this almost like turning back time?”</span></p><br/><p><span style=\"\">Tae-hyuk looked at the bed sheets that had been soaked in his blood. </span><span style=\"\">It was so dirty that it wouldn’t have been cleaned even if he washed it. </span><span style=\"\">But now it was like being dried in the sunshine after being washed in a steam machine.</span></p><br/><p><span style=\"\">“Then I need to hide these.”</span></p><br/><p><span style=\"\">The silicon pack contained multiple medications and cards. </span><span style=\"\">He took out everything from the pack, rolled it upside down, and took out a small waterproof sheet. </span><span style=\"\">Once he unfolded it, the same pattern as the wall of the cell was drawn. </span><span style=\"\">The silicon pack was stretched as thinly as possible, pressed to the wall, and the waterproof sheet was stuck on top. </span><span style=\"\">He used Forgery on the sides to make it naturally connect to the wall. </span><span style=\"\">It couldn’t be found unless the pattern of the wall was carefully touched.</span></p><br/><p><span style=\"\">“It is really perfect...!”</span></p><br/><p><span style=\"\">Tae-hyuk looked at his work with a satisfied expression. </span><span style=\"\">Since he became a Noble, the quality of Forgery has risen further. </span><span style=\"\">What about the ‘King’ status? </span><span style=\"\">Just imagining it gave him goosebumps.</span></p><br/><p><span style=\"\">\"But what I have to do to become a King?\"</span></p><br/><p><span style=\"\">He became a Noble by catching black list members and raising his stats. </span><span style=\"\">If he thought about it simply, couldn’t he become a King the same way? </span><span style=\"\">Since then, he had raised his stats a lot but there weren’t any messages on the Demon Revealing Mirror. </span><span style=\"\">Maybe he couldn’t get promoted in the same way.</span></p><br/><p><span style=\"\">“Well, won’t I know sooner or later? First, let’s just do what I need to do for now.”</span></p><br/><p><span style=\"\">He checked Yoo Cheol-ho’s status and saw no signs of waking up. </span><span style=\"\">Tae-hyuk scratched his head and put the spring back in the sketchpad.</span></p><br/><p><span style=\"\">\"I have paper and a pencil so I’ll draw a blueprint of this place.”</span></p><br/><p><span style=\"\">He never knew what would happen in prison, so he would just do what he could. </span><span style=\"\">Tae-hyuk sharpened the pencil, which had distorted into a weird shape, one more time so that he could draw something. </span><span style=\"\">Then he did the same thing as he did in Atlantis.</span></p><br/><p><span style=\"\">Less than 10 minutes later, he had a blueprint of this place. </span><span style=\"\">He put it in the place where he hid the medicine.</span></p><br/><p><span style=\"\">“Kuoong... I don’t feel good. I keep sleeping all day long.”</span></p><br/><p><span style=\"\">Yoo Cheol-ho, who was lying on the top bunk, woke up and stretched.</span></p><br/><p><span style=\"\">\"Eh? Why does my head hurt?”</span></p><br/><p><span style=\"\">He touched the back of his head as he felt a sharp pain.</span></p><br/><p><span style=\"\">Tae-hyuk said with a smile,</span></p><br/><p><span style=\"\">\"A guard came. You were so deeply asleep that he hit you.”</span></p><br/><p><span style=\"\">“Damn. When I get the chance, I’ll pay that bastard back.”</span></p><br/><p><span style=\"\">Yoo Cheol-ho gritted his teeth as he thought about the guards.</span></p><br/><p><span style=\"\">Some time passed.</span></p><br/><p><span style=\"\">“Hey Newbie.”</span></p><br/><p><span style=\"\">Yoo Cheol-ho laughed and looked down at Tae-hyuk.</span></p><br/><p><span style=\"\">“Don’t be so hard. I growled like that last time because I didn’t know who you were. Now I know you well so let’s be friendly with each other.”</span></p><br/><p><span style=\"\">Tae-hyuk was supposed to be sentenced for seven years due to special theft and assault. </span><span style=\"\">Yoo Cheol-ho learned about this and treated Tae-hyuk as a subordinate.</span></p><br/><p><span style=\"\">\"I’ll consider it.”</span></p><br/><p><span style=\"\">“Ohuhu... Newbie. Aren’t there rumors that you have something good?”</span></p><br/><p><span style=\"\">Yoo Cheol-ho made a smoking gesture.</span></p><br/><p><span style=\"\">‘Ah, he also smokes.’</span></p><br/><p><span style=\"\">Tae-hyuk didn’t see it often because Yoo Cheol-ho didn’t have money, but he remembered seeing several cigarettes.</span></p><br/><p><span style=\"\">\"Do you have a story to tell me?”</span></p><br/><p><span style=\"\">\"I don’t. Instead, how about this?”</span></p><br/><p><span style=\"\">In fact, Yoo Cheol-ho did have information that he could offer for the cigarettes. </span><span style=\"\">However, it would be dangerous if the information entered the guards’ ears. </span><span style=\"\">Of course, Yoo Cheol-ho never dreamt that Tae-hyuk already knew about it.</span></p><br/><p><span style=\"\">Tae-hyuk looked at Yoo Cheol-ho like he was interested.</span></p><br/><p><span style=\"\">\"Is there anyone you want to kill? Originally, I don’t accept any contracts. I’m only doing it this time because we are roommates. Ohuhu, if you tell me their name and where they live, then I will send them to the other world. How about it?”</span></p><br/><p><span style=\"\">Tae-hyuk smiled without saying anything. </span><span style=\"\">He was someone who returned to jail after successfully escaping twice.</span></p><br/><p><span style=\"\">Yoo Cheol-ho was in jail right now. </span><span style=\"\">Telling someone that he would kill a person was like saying that he was thinking of escape. </span><span style=\"\">In addition, Yoo Cheol-ho wasn’t a professional killer like the Chinese man Tae-hyuk recently met. </span><span style=\"\">Yoo Cheol-ho just killed a few people weaker than him.</span></p><br/><p><span style=\"\">\"I'm sorry, but the conditions are the same for everyone. Bring information that will please m, then I’ll give you cigarettes.”</span></p><br/><p><span style=\"\">Tae-hyuk pulled out a pack and shook it in Yoo Cheol-ho’s face, as if it was a taunt. </span><span style=\"\">Yoo Cheol-ho didn’t know if it was planned but he saw it that way. </span><span style=\"\">Yoo Cheol-ho reached out a trembling hand towards Tae-hyuk.</span></p><br/><p><span style=\"\">Then he coughed a few times before lying back down on the bed.</span></p><br/><p><span style=\"\">“Cough. That's okay. Be stingy.”</span></p><br/><p><span style=\"\">It seemed like it would be a few days before Yoo Cheol-ho gave in. </span><span style=\"\">There was nothing to do here except to eat and smoke. </span><span style=\"\">Therefore, that temptation was intense. </span><span style=\"\">Tae-hyuk and extended a cup full of sticky coffee to Yoo Cheol-ho.</span></p><br/><p><span style=\"\">\"I’ll give it for free.”</span></p><br/><p><span style=\"\">\"Wait a few days. I’ll come with a great story.”</span></p><br/><p><span style=\"\">Yoo Cheol-ho gulped down the coffee without knowing that there were strong sleeping pills inside. </span><span style=\"\">After less than five minutes, he was in a deep sleep.</span></p><br/><p><span style=\"\">Tae-hyuk decided to leave the cell tonight.</span></p><br/><p><span style=\"\">@</span></p><br/><p><span style=\"\">He slapped Yoo Cheol-ho’s cheeks hard enough to make a sound. </span><span style=\"\">However, there were no signs of him waking up. </span><span style=\"\">It felt like he was rewarded for the hard work of bringing the medicine in here.</span></p><br/><p><span style=\"\">He didn’t hear anything moving except for a few guards patrolling. </span><span style=\"\">However, there was the sound of sleepless prisoners gossiping.</span></p><br/><p><span style=\"\">Tae-hyuk quietly left the cell using Yoo Cheol-ho’s tunnel. </span><span style=\"\">It was only one meter long. </span><span style=\"\">However, that was enough for Tae-hyuk.</span></p><br/><p><span style=\"\">Tae-hyuk used Counterfeit to disguise his clothes as the guard uniform. </span><span style=\"\">The navy uniform of the guards was born. </span><span style=\"\">He could walk through the front door of the prison and no one would notice. </span><span style=\"\">He could escape without the tunnel.</span></p><br/><p><span style=\"\">\"First of all, let’s confirm where I can go.”</span></p><br/><p><span style=\"\">Tae-hyuk walked casually down the hallway lined with cells. </span><span style=\"\">He could hear them talking.</span></p><br/><p><span style=\"\">“…I have to kill him.”</span></p><br/><p><span style=\"\">There was somebody burning another person’s flesh.</span></p><br/><p><span style=\"\">\"Nowadays, the technology regarding gene collection has developed so much that your identity will be known if you leave a hair or skin cell behind.</span></p><br/><p><span style=\"\">\"Then what can I do?”</span></p><br/><p><span style=\"\">\"First of all, the best thing is to build a workshop with a tarp where you can handle the other person. Even if blood splashes, all the traces will disappear once the vinyl is peeled off. But if you can’t do that, you need to do some DNA removal.”</span></p><br/><p><span style=\"\">“Hoh...”</span></p><br/><p><span style=\"\">There was also someone giving away his secret know-how. </span><span style=\"\">The prison was basically a correctional facility. </span><span style=\"\">But in this manner, it became a crime school to transfer their skills to others.</span></p><br/><p><span style=\"\">Tae-hyuk clicked his tongue and muttered,</span></p><br/><p><span style=\"\">\"How is that not one of these guys change?”</span></p><br/><p><span style=\"\">It was cute that they liked bragging about the crimes they committed. </span><span style=\"\">As Tae-hyuk was exploring, he heard something strange.</span></p><br/><p><span style=\"\">“Then did you trade with the newbie who entered last week?”</span></p><br/><p><span style=\"\">“What about it? I can smoke a cigarette after a long time.”</span></p><br/><p><span style=\"\">\"No matter how I looked at it, something is strange. Maybe he is a spy planted by the cops.”</span></p><br/><p><span style=\"\">\"He doesn’t smell like a cop. Plus, have you seen his appearance? If he is a cop then I am the police commissioner.”</span></p><br/><p><span style=\"\">“Kuhaha. Anyways, it stinks.”</span></p><br/><p><span style=\"\">\"But I was wondering about what he was hearing. Apparently it isn’t crime related? He also didn’t ask anything about other criminals.”</span></p><br/><p><span style=\"\">“Kuoong... Really? Then what the hell is his purpose?”</span></p><br/><p><span style=\"\">“Shh! There is a guard.”</span></p><br/><p><span style=\"\">“......”</span></p><br/><p><span style=\"\">Tae-hyuk deliberately made his footsteps louder and confirmed who the prisoner was.</span></p><br/><p><span style=\"\">'Hrmm, I was expecting some people to be suspicious. It is this guy.’</span></p><br/><p><span style=\"\">He was someone who successfully broke out of Blue Dragon Prison with Yoo Cheol-ho.</span></p><br/><p><span style=\"\">'Anyway, I need a good reason for gathering the information.’</span></p><br/><p><span style=\"\">This place was very narrow. </span><span style=\"\">The doubts would soon spread like an epidemic. </span><span style=\"\">Before that, he needed to take some measures.</span></p><br/><p><span style=\"\">Tae-hyuk quietly left the area where the Korean inmates lived.</span></p><br/><p><span style=\"\">@</span></p><br/><p><span style=\"\">Once he moved to the area where the Chinese prisoners lived, he felt something strange. </span><span style=\"\">In the darkness, a few guards and Chinese inmates were leaving the cells and moving somewhere.</span></p><br/><p><span style=\"\">“...It isn’t an escape. What is it?”</span></p><br/><p><span style=\"\">Since he got the crime skills, Tae-hyuk’s eyesight had sharpened. </span><span style=\"\">He could see the shapes of people from far away in the moonlight.</span></p><br/><p><span style=\"\">The suspicious group was going to an off limits area. </span><span style=\"\">It was a place Tae-hyuk had never been, despite living here for nearly 10 years.</span></p><br/><p><span style=\"\">\"They aren’t sneaking in to secretly dig up the gold are they?”</span></p><br/><p><span style=\"\">Tae-hyuk followed behind the group. </span><span style=\"\">They arrived near a place where someone was standing guard.</span></p><br/><p><span style=\"\">'What, there are no cells in there, so what is he guarding? Isn’t this huge?’</span></p><br/><p><span style=\"\">Tae-hyuk recalled the face of one of the guards in charge of the Chinese. </span><span style=\"\">Fortunately, he knew someone.</span></p><br/><p><span style=\"\">'Then Disguise!’</span></p><br/><p><span style=\"\">Tae-hyuk changed his face and casually approached the guard.</span></p><br/><p><span style=\"\">\"Ah, you went through a lot of trouble.”</span></p><br/><p><span style=\"\">\"Uh, didn’t you just pass by?”</span></p><br/><p><span style=\"\">“What nonsense are you saying? Did you fall asleep while working?”</span></p><br/><p><span style=\"\">“Ah, no. Keep up the good work!”</span></p><br/><p><span style=\"\">He easily passed by the guard.</span></p><br/><p><span style=\"\">“Strange... I could’ve sworn that he just went by.”</span></p><br/><p><span style=\"\">Tae-hyuk smiled and followed the people ahead of him. </span><span style=\"\">The place where the Chinese people ended up was a huge vegetable garden. </span><span style=\"\">The Chinese prisoners and guards were harvesting something.</span></p><br/><p><span style=\"\">“Hurry! This is the warden’s command! The harvesting must be finished by tomorrow!”</span></p><br/><p><span style=\"\">Then Chinese curse words emerged. </span><span style=\"\">Tae-hyuk realized what the plant was.</span></p><br/><p><span style=\"\">‘...Cannabis?’</span></p><br/><p><span style=\"\">It was very difficult to grow cannabis since the awful smell made it difficult to grow it indoors. </span><span style=\"\">Nurturing it like this...</span></p><br/><p><span style=\"\">‘This is what the warden was hiding.’</span></p><br/><p><span style=\"\">He estimated that there was around 200~300 trees.</span></p><br/><p><span style=\"\">'Can’t 15g be extracted from a single tree?’</span></p><br/><p><span style=\"\">Let’s say there are 300 trees. </span><span style=\"\">An enormous amount of drugs, 4.5 kg at a time, was being grown in the prison. </span><span style=\"\">It was enough to make thousands of people addicts.</span></p><br/><p><span style=\"\">‘It is around 50,000 won for 1g... So around 300 million won for one harvest?’</span></p><br/><p><span style=\"\">It seemed like the Blue Dragon Prison wouldn’t have just one farm. </span><span style=\"\">After harvesting the cannabis, carrots and radishes could be planted to disguise it as an ordinary garden. </span><span style=\"\">Drug growing was possible because outsiders only entered here a few times a year.</span></p><br/><p><span style=\"\">Tae-hyuk’s mouth twitched.</span></p><br/><p><span style=\"\">He had no idea that he would find a drug field when he went looking for gold.</span></p><br/>\n</div>"}