{"title": "Chapter 109: Jail War #1", "id": 109, "volume": 2, "url": "http://boxnovel.org/god-of-crime-chapter-109-jail-war-1", "volume_title": "Volume 2", "body": "<h1>Chapter 109: Jail War #1</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span style=\"\">Chapter 109: Jail War #1</span></p><br/><p><span style=\"\">This newbie, what the hell did he want?</span></p><br/><p><span style=\"\">Shin Chang-ho’s eyes narrowed as he looked at the person before him. </span><span style=\"\">Until now, Shin Chang-ho just saw Kim Cheol-su as a weird newbie. </span><span style=\"\">However, he became a presence that couldn’t be ignored as soon as the name Shin Seo-yeon emerged from his mouth.</span></p><br/><p><span style=\"\">She was the only family that Shin Chang-ho, an orphan, had. </span><span style=\"\">Once Shin Chang-ho left the orphanage, he didn’t get a job and roamed the back alleyways to play. </span><span style=\"\">Then he was scouted by high-ranking members of Gallery who saw his unique strength and stamina, thus becoming a member. </span><span style=\"\">And 10 years later, the person from the back alleyways became a chief in the huge organization.</span></p><br/><p><span style=\"\">But things had turned out strangely. </span><span style=\"\">He wanted to live like a human, but then he ended up going to jail instead of the boss. </span><span style=\"\">Before entering the prison, Shin Chang-ho said to his sister,</span></p><br/><p><span style=\"\">“Just wait seven years.”</span></p><br/><p><span style=\"\">Then she replied with a smile,</span></p><br/><p><span style=\"\">\"I’ve already waited 10 years, seven more isn’t too long.”</span></p><br/><p><span style=\"\">\"Once I return, I will be a high-ranking official of the organization. Then let’s get married.”</span></p><br/><p><span style=\"\">“......”</span></p><br/><p><span style=\"\">Shin Chang-ho confessed his longing of 20 years. </span><span style=\"\">She waited for a moment before tearfully nodding. </span><span style=\"\">It was a little too late, but he had the confidence to make her happy. </span><span style=\"\">But the next day, she didn’t contact him after returning home.</span></p><br/><p><span style=\"\">At first, he thought she was just sorting out her mind. </span><span style=\"\">However, she didn’t contact him for a week. </span><span style=\"\">Shin Chang-ho felt irritated and desperately wanted to find her. </span><span style=\"\">However, the only thing he could do was order his men outside to look for her. </span><span style=\"\">Everything would be over if he broke out now.</span></p><br/><p><span style=\"\">Time constantly passed by. </span><span style=\"\">One month... </span><span style=\"\">Half a year... </span><span style=\"\">Then three years.</span></p><br/><p><span style=\"\">He couldn’t find her despite searching the whole country. </span><span style=\"\">She had been waiting for Shin Chang-ho all her life, but now Shin Chang-ho was the one in the position of waiting. </span><span style=\"\">There was a saying that a person didn’t realize how important something was until it was gone. </span><span style=\"\">Shin Chang-ho realized that it was true.</span></p><br/><p><span style=\"\">In a situation where he had halfway given up, her name emerged from the mouth of a newcomer. </span><span style=\"\">Shin Chang-ho’s fingertips started shaking, and he whispered in a small voice so that his bodyguards couldn’t hear.</span></p><br/><p><span style=\"\">“...If you find her then I can give you my life.”</span></p><br/><p><span style=\"\">Tae-hyuk laughed and said,</span></p><br/><p><span style=\"\">\"The Brown Bear of Gallery has a pure love story.”</span></p><br/><p><span style=\"\">\"If it is a lie then it will be hard for you to stay here.”</span></p><br/><p><span style=\"\">Tae-hyuk shrugged.</span></p><br/><p><span style=\"\">\"Don't worry. I definitely know her whereabouts.”</span></p><br/><p><span style=\"\">Shin Chang-ho made gestures for his bodyguards to withdraw. </span><span style=\"\">Of course, he didn’t 100% trust the other person. </span><span style=\"\">However, he was desperate enough to grab a rotten line.</span></p><br/><p><span style=\"\">\"Then let’s hear the story in detail.”</span></p><br/><p><span style=\"\">Tae-hyuk opened his mouth after a pause that was long enough for rice to cook.</span></p><br/><p><span style=\"\">“Sooner or later, a war will break out in here. I want to cooperate with you.”</span></p><br/><p><span style=\"\">“What do you mean? You will tell me where my sister is if we work together?\"</span></p><br/><p><span style=\"\">“That’s right. Of course, it doesn’t mean that you will be my subordinate. You will be treated as an equal partner.</span></p><br/><p><span style=\"\">Then Shin Chang-ho’s lips twitched.</span></p><br/><p><span style=\"\">“...So what benefit can you get from this?”</span></p><br/><p><span style=\"\">“I just want you to do some simple things for me. There is someone I have a personal grudge against. There is information I won’t be able to get by myself.”</span></p><br/><p><span style=\"\">\"Personal grudge? Who is it?”</span></p><br/><p><span style=\"\">“…Park Sung-yul.”</span></p><br/><p><span style=\"\">Shin Chang-ho licked his lips. The name of a man he knew emerged from the mouth of the newbie.</span></p><br/><p><span style=\"\">\"That gloomy guy. What do you want from him?”</span></p><br/><p><span style=\"\">“I will tell you once we become a little closer.”</span></p><br/><p><span style=\"\">“Hrmm...”</span></p><br/><p><span style=\"\">Shin Chang-ho groaned as he started to think, and his eyes narrowed in suspicion.</span></p><br/><p><span style=\"\">“...You are hiding something. However, it is difficult to reject your proposal. If you confirm one thing, I will accept it.”</span></p><br/><p><span style=\"\">Shin Chang-ho had an unbelievable authoritative aura after being stuck in prison for three years. </span><span style=\"\">He slowly approached the other person and whispered in his ear.</span></p><br/><p><span style=\"\">\"Prove that you aren’t a spy planted by a cop, and I will listen to your proposal.”</span></p><br/><p><span style=\"\">Tae-hyuk smiled, pulled out a notebook and handed it to Shin Chang-ho.</span></p><br/><p><span style=\"\">\"What?\"</span></p><br/><p><span style=\"\">\"Read it.”</span></p><br/><p><span style=\"\">Shin Chang-ho accepted Tae-hyuk’s notebook and started reading the contents without saying anything. </span><span style=\"\">There was no need to.</span></p><br/><p><span style=\"\">Shin Chang-ho stared at the other person like he was spellbound. </span><span style=\"\">Something huge was written in the notebook.</span></p><br/><p><span style=\"\">\"I know a lot that will help with the war.”</span></p><br/><p><span style=\"\">“...A-Are the words written here true?”</span></p><br/><p><span style=\"\">Shin Chang-ho couldn’t believe his eyes. His voice was shaking with excitement. </span><span style=\"\">It was natural that he reacted in such a way. </span><span style=\"\">The contents of the notebook were huge.</span></p><br/><p><span style=\"\">There was information on the businesses entering and leaving Blue Dragon Prison, the shift table with the working hours of the guards, and the route they took to get here. </span><span style=\"\">In addition, there were numerous secret documents about the Blue Dragon Prison filling the small notebook. </span><span style=\"\">If this was known to be in the hands of criminals, some of the heads of the people in charge would fly away.</span></p><br/><p><span style=\"\">“You know that I am gathering information here. Of course, I didn’t start just two weeks ago.”</span></p><br/><p><span style=\"\">The notebook contained information that was collected inside and outside the dungeon. </span><span style=\"\">But he was giving something this important to Shin Chang-ho? </span><span style=\"\">Just to help him stalk Park Sung-yul?</span></p><br/><p><span style=\"\">Shin Chang-ho gulped.</span></p><br/><p><span style=\"\">“...I understand. I don’t believe that you are a spy. But I want to ask what you are going to do with this? Are you planning an escape?”</span></p><br/><p><span style=\"\">\"I told you. It is still a secret.”</span></p><br/><p><span style=\"\">Shin Chang-ho slowly nodded.</span></p><br/><p><span style=\"\">The other person was bigger than he thought. </span><span style=\"\">Just before, Shin Chang-ho thought he was a spy planted by the police, but the chances of that being true was low, now that this information was given to him. </span><span style=\"\">Shin Chang-ho could do anything in Blue Dragon Prison is he had the information in the notebook. </span><span style=\"\">It would be a tremendous help in the war against the Japanese inmates.</span></p><br/><p><span style=\"\">\"This much information, why are you giving it to me?”</span></p><br/><p><span style=\"\">\"I gave you only 30%.”</span></p><br/><p><span style=\"\">\"At the very least, there should’ve been a relationship between us in the beginning.”</span></p><br/><p><span style=\"\">Tae-hyuk just smiled instead of answering. </span><span style=\"\">Based on his memories, he would imprisoned here four years later. </span><span style=\"\">The man in front of him should’ve been released four years later. </span><span style=\"\">Nevertheless, Tae-hyuk knew Shin Chang-ho because he caused an incident and a few years were added to his sentence.</span></p><br/><p><span style=\"\">\"Then for now, tell me how I can help you.”</span></p><br/><p><span style=\"\">Shin Chang-ho was Tae-hyuk’s mentor. </span><span style=\"\">Tae-hyuk wouldn’t have survived 10 years in this place if it wasn’t for him. </span><span style=\"\">Tae-hyuk looked at Shin Chang-ho like he was seeing a friend after a long time.</span></p><br/><p><span style=\"\">@</span></p><br/><p><span style=\"\">“H-How great. Did you think of this all by yourself?”</span></p><br/><p><span style=\"\">Shin Chang-ho exclaimed with wide eyes. </span><span style=\"\">Kim Cheol-su didn’t just have information, his ability to plot and intimidate the enemy was enormous as well.</span></p><br/><p><span style=\"\">Tae-hyuk smiled.</span></p><br/><p><span style=\"\">‘I learned everything from you. Brown Bear.’</span></p><br/><p><span style=\"\">\"I boast the best connections in the prison, so this should be enough.”</span></p><br/><p><span style=\"\">Shin Chang-ho said in a trembling voice. </span><span style=\"\">He was someone scouted by a high-ranking executive of Gallery.</span></p><br/><p><span style=\"\">\"But Newbie, if you get out then come work with me. If you join ‘Gallery’ then you won’t have a job anywhere.”</span></p><br/><p><span style=\"\">\"Thanks for the offer, but I can’t. I have already made an appointment with another place.”</span></p><br/><p><span style=\"\">Tae-hyuk had promised to go to university with An Eun-young.</span></p><br/><p><span style=\"\">\"Haha, I see.”</span></p><br/><p><span style=\"\">Shin Chang-ho said with a dissatisfied expression. </span><span style=\"\">If the newbie entered the gang, then Gallery would get someone huge. </span><span style=\"\">However, Shin Chang-ho wasn’t like the hero of Romance of the Three Kingdoms, Liu Bei, who visited someone’s home three times just to recruit them.</span></p><br/><p><span style=\"\">Anyway, there were many opportunities in the future.</span></p><br/><p><span style=\"\">\"Then I'll get started this evening.”</span></p><br/><p><span style=\"\">\"Please do so.”</span></p><br/><p><span style=\"\">After Tae-hyuk left, Shin Chang-ho convened his loyal men and gave them a few simple commands. </span><span style=\"\">One of Shin Chang-ho’s men was called a human copier. </span><span style=\"\">He used to make forged artwork out in society.</span></p><br/><p><span style=\"\">Shin Chang-ho gave some instructions to the human copier.</span></p><br/><p><span style=\"\">“I understand Hyung-nim. I just need to go to Park Sung-yul’s room and draw everything I see?”</span></p><br/><p><span style=\"\">“Yes. In the evening, some kids will keep an eye on Park Sung-yul. During that time, you will look around Park Sung-yul’s room.”</span></p><br/><p><span style=\"\">“I will handle it. Please leave it to me.”</span></p><br/><p><span style=\"\">The human copier nodded as he received Shin Chang-ho’s command.</span></p><br/><p><span style=\"\">@</span></p><br/><p><span style=\"\">At dinner time, the cell doors opened and the prisoners headed to the dining room to eat. </span><span style=\"\">Park Sung-yul could feel someone’s eyes on him.</span></p><br/><p><span style=\"\">“Why are people staring at me today?”</span></p><br/><p><span style=\"\">He was a person who didn’t have any close friendships and stayed by himself reading books or writing things in his notebook.</span></p><br/><p><span style=\"\">“...Is there something on my clothes?”</span></p><br/><p><span style=\"\">Park Sung-yul never imagined that he would be the Brown Bear’s target and started to eat at the place where he normally sat. </span><span style=\"\">Then a few oversized people came up to him with their plates.</span></p><br/><p><span style=\"\">\"Is it okay to sit here?”</span></p><br/><p><span style=\"\">The big people were gangsters.</span></p><br/><p><span style=\"\">Park Sung-yul looked at the people before him with a puzzled expression. </span><span style=\"\">Even though the dining room didn’t set them apart, there was a certain area for the gangsters. </span><span style=\"\">Naturally, the gangsters occupied the best place, but why were they sitting next to a serial killer like himself?</span></p><br/><p><span style=\"\">Something was strange. </span><span style=\"\">However, Park Sung-yul was alone and there were several people in front of him. </span><span style=\"\">He couldn’t politely refuse.</span></p><br/><p><span style=\"\">\"Sit down.\"</span></p><br/><p><span style=\"\">Then three or four oversized people sat around Park Sung-yul. </span><span style=\"\">It seemed as though they were threatening him not to escape. </span><span style=\"\">He calmly placed rice in his mouth. </span><span style=\"\">As Park Sung-yul enjoyed his meal, the human copier quietly entered his room as Shin Chang-ho ordered.</span></p><br/><p><span style=\"\">\"Now, I shall start working.”</span></p><br/><p><span style=\"\">The human copier searched Park Sung-yul’s room and found a few sketchbooks. </span><span style=\"\">There were many images and poems that couldn’t be identified. </span><span style=\"\">He didn’t have a lot of time, but he could make copies of more than half of the present items.</span></p><br/><p><span style=\"\">The human copier put all of Park Sung-yul’s things in their original position with a satisfied expression and headed to Shin Chang-ho’s room.</span></p><br/><p><span style=\"\">\"Heheh, Hyung-nim. Here it is.”</span></p><br/><p><span style=\"\">After confirming the goods, Shin Chang-ho slowly nodded.</span></p><br/><p><span style=\"\">\"You went through a lot of trouble.”</span></p><br/><p><span style=\"\">The human copier acted politely towards him. </span><span style=\"\">After a few years, Shin Chang-ho would be a high-ranking official of Gallery. </span><span style=\"\">Acting like this wasn’t a loss for him.</span></p><br/><p><span style=\"\">“It is nothing. Please call me again if you need anything.”</span></p><br/><p><span style=\"\">“Yes.”</span></p><br/><p><span style=\"\">After the human copier left, Shin Chang-ho started to look in more detail.</span></p><br/><p><span style=\"\">There were some paintings that looked like the scribbles of elementary school students, as well as some mumblings.</span></p><br/><p><span style=\"\">“...Why does the newcomer want these things?”</span></p><br/><p><span style=\"\">Shin Chang-ho never dreamt that they would be codes pointing to the places where Park Sung-yul had hidden the bodies of his victims. </span><span style=\"\">However, he had received the payment for this in advance. </span><span style=\"\">Park Sung-yul delivered the puzzles as promised to the newcomer.</span></p><br/><p><span style=\"\">“Thank you Brown Bear. There are people waiting for this.”</span></p><br/><p><span style=\"\">That evening, the newcomer wrote a letter to someone.</span></p><br/>\n</div>"}