{"title": "Chapter 102: Accomplice #3", "id": 102, "volume": 2, "url": "http://boxnovel.org/god-of-crime-chapter-102-accomplice-3", "volume_title": "Volume 2", "body": "<h1>Chapter 102: Accomplice #3</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span style=\"\">Chapter 102: Accomplice #3</span></p><br/><p><i><span style=\"\">-Hello</span></i><i><span style=\"\">Detective Cho Kang-suk.</span></i><i><span style=\"\">By the way, it seems like there are many uninvited guests.</span></i></p><br/><p><span style=\"\">The commandos leader wrapped a bandage around his hand and muttered,</span></p><br/><p><span style=\"\">\"That son of a bitch is playing with...!”</span></p><br/><p><span style=\"\">The room only contained the recorded video, which told them one thing: Information from inside the police agency was leaking out.</span></p><br/><p><span style=\"\">\"Kuook Who? What bastard?”</span></p><br/><p><span style=\"\">The commandos leader wasn’t an idiot and didn’t need an explanation to understand the situation.</span></p><br/><p><span style=\"\">-</span><i><span style=\"\">I’m more shy than I look.</span></i><i><span style=\"\">Negotiations shall proceed again from somewhere else.</span></i></p><br/><p><span style=\"\">\"Kuoooook!”</span></p><br/><p><span style=\"\">In the end, the police and counter-terrorism team members were dancing on top of Phantom’s palms. </span><span style=\"\">But this wasn’t the end of Phantom’s video.</span></p><br/><p><span style=\"\">-</span><i><span style=\"\">You’ve come a long way.</span></i><i><span style=\"\">I’ll be sorry if you return with empty hands, so</span></i><i><span style=\"\">I have prepared a small gift so I hope you like it.</span></i></p><br/><p><span style=\"\">“A gift?”</span></p><br/><p><span style=\"\">Kang-suk gulped as he looked at the tablet.</span></p><br/><p><span style=\"\">The message cut off there. </span><span style=\"\">Considering his previous experience with Phantom, the gift certainly wouldn’t be ordinary. </span><span style=\"\">The table contained a video file and photos.</span></p><br/><p><span style=\"\">\"We just saw the video...”</span></p><br/><p><span style=\"\">“D-Detective Cho! Try not to touch Phantom’s fingerprints!”</span></p><br/><p><span style=\"\">‘You were the one who almost smashed it.’</span></p><br/><p><span style=\"\">Kang-suk barely managed to stop the words from leaving his mouth. </span><span style=\"\">However, Kang-suk was an experienced detective and knew how to deal with this situation.</span></p><br/><p><span style=\"\">\"Yes, I will pay particular attention to what you have told me.”</span></p><br/><p><span style=\"\">Once Kang-suk pulled out leather gloves from his pocket, the leader looked dumbfounded.</span></p><br/><p><span style=\"\">“Hum hum... Yes. Do it well.”</span></p><br/><p><span style=\"\">‘Phantom leaving fingerprints behind? Impossible...’</span></p><br/><p><span style=\"\">Kang-suk smiled and checked the photo file. </span><span style=\"\">He was nervous about the gruesome scene of a murder, but it was actually very simple.</span></p><br/><p><span style=\"\">\"The problem is very close by?”</span></p><br/><p><span style=\"\">That was the only thing written on a sheet of paper. </span><span style=\"\">At that moment, something popped into Kang-suk’s head. </span><span style=\"\">Before the operation started, he had investigated what this place was. </span><span style=\"\">It had obviously been reported as a factory.</span></p><br/><p><span style=\"\">“It clearly doesn’t look like that.”</span></p><br/><p><span style=\"\">He had been in a rush when he came here, so he didn’t pay that much attention. </span><span style=\"\">But he realized something was strange the moment he saw the memo left behind by Phantom.</span></p><br/><p><span style=\"\">Kang-suk muttered in a small voice,</span></p><br/><p><span style=\"\">“…What is this place?”</span></p><br/><p>@</p><br/><p><span style=\"\">\"You will be arrested in accordance with Article 21 Clause 1 of the Medical Law!”</span></p><br/><p><span style=\"\">“W-What? Y-You! Who, who are you?!”</span></p><br/><p><span style=\"\">\"The doctors are curious about who we are?”</span></p><br/><p><span style=\"\">\"If you want to go after a chicken, then you have to catch a rat!”</span></p><br/><p><span style=\"\">\"Plunge in with all your strength!”</span></p><br/><p><span style=\"\">The commandos, who were standing by to catch Phantom, opened the door and entered,</span></p><br/><p><span style=\"\">“H-Hiiiiik!”</span></p><br/><p><span style=\"\">Then an unlicensed doctor wearing a doctor’s coat screamed,</span></p><br/><p><span style=\"\">\"G-Gun! What? What is going on?!”</span></p><br/><p><span style=\"\">Kang-suk shook his head and clicked his tongue.</span></p><br/><p><span style=\"\">\"It is like using a sword to cut off a nail. Mobilizing special forces to catch unlicensed doctors... Let's see... No license, illegal abortions...”</span></p><br/><p><span style=\"\">“......”</span></p><br/><p><span style=\"\">The unlicensed doctor, Jung Eui-do, still couldn’t understand the situation. </span><span style=\"\">He didn’t think the big guy in front of him was a homicide detective.</span></p><br/><p><span style=\"\">Jung Eui-do asked carefully,</span></p><br/><p><span style=\"\">\"I didn’t hear from the police chief of Gangseo-gu that a crackdown was coming...”</span></p><br/><p><span style=\"\">Gangseo Police Station was in charge of the area where the illegal medical center was located. </span><span style=\"\">There must be secret connections for it to be operating so unabashedly like this.</span></p><br/><p><span style=\"\">Kang-suk shrugged.</span></p><br/><p><span style=\"\">\"I'm sorry, but it isn’t a crackdown. Is there anything else?\"</span></p><br/><p><span style=\"\">Jung Eui-do desperately waved his hands.</span></p><br/><p><span style=\"\">\"Uh, no.\"</span></p><br/><p><span style=\"\">\"Is that so? Eh? By the way, what is going on here?”</span></p><br/><p><span style=\"\">Kang-suk picked up the paperwork that was rolling around on the ground and placed it on the desk. </span><span style=\"\">There was something here.</span></p><br/><p><span style=\"\">\"Can I take a look at it for a moment?”</span></p><br/><p><span style=\"\">“Yes, yes.”</span></p><br/><p><span style=\"\">If he were arrested for unlicensed medical treatment, he would be punished with imprisonment of up to five years or a fine not exceeding 20 million won. </span><span style=\"\">That was just the maximum sentencing, however. </span><span style=\"\">Most of them were released on probation if they showed their cooperation in the investigation and bribed people. </span><span style=\"\">It was how a hospital for illegal medical treatment could operate so unabashedly.</span></p><br/><p><span style=\"\">In addition, there were hidden things. </span><span style=\"\">If they investigated more than the abortions and illegal plastic surgeries...</span></p><br/><p><span style=\"\">“Hrmm. It looks like this place is where fetuses are killed and then trafficked.</span></p><br/><p><span style=\"\">\"T-T-There is no such thing.”</span></p><br/><p><span style=\"\">Jung Eui-do’s face turned white.</span></p><br/><p><span style=\"\">It was 10 years imprisonment if he was caught smuggling a processed fetus. </span><span style=\"\">Then what about smuggling raw materials? </span><span style=\"\">It could increase to double that.</span></p><br/><p><span style=\"\">Jung Eui-do said as calmly as possible,</span></p><br/><p><span style=\"\">\"If you feel doubt then you can search the hospital. I really didn’t do that.”</span></p><br/><p><span style=\"\">Fortunately, the remaining inventory in the hospital had been shipped several days before. </span><span style=\"\">He would never be caught...</span></p><br/><p><span style=\"\">\"Is that so? However, this seems to be a picture of fetus trading.”</span></p><br/><p><span style=\"\">Kang-suk pulled out some photos from an envelope and showed them to Jung Eui-do.</span></p><br/><p><span style=\"\">\"Heok...\"</span></p><br/><p><span style=\"\">Jung Eui-do looked stunned.</span></p><br/><p><span style=\"\">Jung Eui-do, along with the secret warehouse where they were all caught in, was captured on photo. </span><span style=\"\">He had made a deal with a Chinese who crossed the ocean. </span><span style=\"\">This couldn’t be explained.</span></p><br/><p><span style=\"\">\"S-Something seems wrong. Ah, manipulation. That is photo manipulation...”</span></p><br/><p><span style=\"\">\"Expert analysis will quickly reveal if this was altered or not. If you don’t have anything else to say then get up.”</span></p><br/><p><span style=\"\">\"D-D-Detective-nim!”</span></p><br/><p><span style=\"\">Kang-suk placed the new evidence and Phantom’s gift into an envelope and stood up.</span></p><br/><p><span style=\"\">Kang-suk had examined the table where the phantom mask was sitting and found an envelope containing  evidence that illegal medical activities were being conducted here, as well as the crime of selling fetuses.</span></p><br/><p><span style=\"\">\"I have to thank him for this...”</span></p><br/><p><span style=\"\">Cho Kang-suk scratched his head and sighed.</span></p><br/><p><span style=\"\">@</span></p><br/><p><span style=\"\">After teasing the commandos leader, Phantom was sitting on his bed and staring at the Demon Revealing Mirror.</span></p><br/><p><span style=\"\">[Crime Skill: Illegal Surgery has been acquired.]</span></p><br/><p><span style=\"\">-Various surgical operations can be done.</span></p><br/><p><span style=\"\">-However, treatment isn’t possible.</span></p><br/><p><span style=\"\">\"It is a little early, but let’s just say that I am discharged.”</span></p><br/><p><span style=\"\">He wondered about the newly acquired crime skills, but there was a more urgent matter first. </span><span style=\"\">Tae-hyuk contacted Cho Kang-suk using Phantom’s private line and used Voice Modulation to imitate Kim Bum-soo.</span></p><br/><p>\"Hello Detective Cho Kang-suk.”</p><br/><p><span style=\"\">-</span><i><span style=\"\">P-Phantom...</span></i></p><br/><p><span style=\"\">“Did you like my present? My proposal is still valid. Of course, if you bring uninvited guests again, then it will be the same as today.”</span></p><br/><p><span style=\"\">-</span><i><span style=\"\">...Sorry I couldn’t keep my promise.</span></i></p><br/><p><span style=\"\">The corners of Tae-hyuk’s mouth went up.</span></p><br/><p><span style=\"\">Cho Kang-suk, a detective with a sense of justice, was apologizing to the criminal Phantom. </span><span style=\"\">It was a pity that he couldn’t see what had happened.</span></p><br/><p><span style=\"\">\"You must have suffered acting as the middle-man. Then I will give you a clue. The newly appointed police commissioner seems to want to catch me a lot. Tell the police commissioner that if he acts again this time, I will release ‘it’.”</span></p><br/><p><span style=\"\">-</span><i><span style=\"\">What does that mean?</span></i></p><br/><p><span style=\"\">\"You don’t have to know. Just pass it on.”</span></p><br/><p><span style=\"\">- ......</span></p><br/><p><span style=\"\">\"The meeting point will be delivered in 12 hours. Then let’s finish this case well.”</span></p><br/><p><span style=\"\">Tae-hyuk hung up and leaned back on his pillow. </span><span style=\"\">The after-effects of his injuries still remained. </span><span style=\"\">However, he could restore his exhausted stamina with a good night of sleep. </span><span style=\"\">After upgrading to ‘Noble’, his body had become stronger than before.</span></p><br/><p><span style=\"\">\"But it seems like the new police commissioner has really done something wrong.”</span></p><br/><p><span style=\"\">Tae-hyuk laughed.</span></p><br/><p><span style=\"\">In fact, it was a bluff when he told Kang-suk that.</span></p><br/><p><span style=\"\">\"Maybe I really am a god?”</span></p><br/><p><span style=\"\">There had to be something behind him if he could sit in the position of police commissioner. </span><span style=\"\">Tae-hyuk was aiming at that.</span></p><br/><p><span style=\"\">\"Anyway, won’t my bluff be true if he really comes alone to the next meeting place?”</span></p><br/><p><span style=\"\">If not, he would just leave a video mocking the police like this time.</span></p><br/><p><span style=\"\">In fact, the way of figuring out if Kang-suk had a tail or not was very simple. </span><span style=\"\">Since he copied Kang-suk’s phone during the hippo case, he could listen to all of the calls. </span><span style=\"\">Phantom doing all contact with Kang-suk wasn’t just to build up his merits. </span><span style=\"\">By wiretapping Kang-suk, he could see the movements of the police regarding Phantom.</span></p><br/><p><span style=\"\">“Then shall I see how rotten this police commissioner is?”</span></p><br/><p><span style=\"\">@</span></p><br/><p><span style=\"\">The new police commissioner, Chae Bum-ho, stood up after hearing the report.</span></p><br/><p><span style=\"\">\"He will reveal ‘it’ that put me in the position of police commissioner? D-Don’t tell me... No. It is a top secret. A mere criminal...”</span></p><br/><p><span style=\"\">Chae Bum-ho muttered with a dark expression.</span></p><br/><p><span style=\"\">“…However, Phantom was clearly involved in the dismissal of the last police commissioner. No, anybody who knows I was involved with Taesung has already...”</span></p><br/><p><span style=\"\">Phantom definitely knew something. </span><span style=\"\">If the incident became known, then it wouldn’t end with just removing his clothes. </span><span style=\"\">It would be difficult to escape being branded as a criminal.</span></p><br/><p><span style=\"\">Chae Bum-ho’s face distorted.</span></p><br/><p><span style=\"\">He knew the position that he was sitting in. </span><span style=\"\">Most police commissioners met a disastrous end. </span><span style=\"\">Of the past police commissioners, nine were involved in a crime, and some were still in prison. </span><span style=\"\">He had been careful not to step on any toes, but the criminal wearing a mask would reveal ‘it’?</span></p><br/><p><span style=\"\">He couldn’t just wait and see.</span></p><br/><p><span style=\"\">Chae Bum-ho licked his lips and contacted the Gangdong police superintendent.</span></p><br/><p><span style=\"\">\"It is me. Tell Detective Cho Kang-suk to listen to what Phantom wants. But be sure to report it to me.”</span></p><br/><p><i><span style=\"\">-Yes, I understand.</span></i></p><br/><p><span style=\"\">Chae Bum-ho hung up and muttered.</span></p><br/><p><span style=\"\">“Don’t think you won, Phantom. I will surely rip your mask off.”</span></p><br/><p><span style=\"\">@</span></p><br/><p><span style=\"\">-</span><i><span style=\"\">Listen to what Phantom wants.</span></i></p><br/><p><span style=\"\">-</span><i><span style=\"\">Then I will be going to see him alone?</span></i></p><br/><p><span style=\"\">-</span><i><span style=\"\">Yes.</span></i><i><span style=\"\">Detective Cho.</span></i><i><span style=\"\">The pride of the police agency is on your shoulders.</span></i><i><span style=\"\">Please make a good deal with Phantom.</span></i></p><br/><p><span style=\"\">-</span><i><span style=\"\">I understand.</span></i></p><br/><p><span style=\"\">Tae-hyuk smiled widely as he listened to the conversation between Cho Kang-suk and the Gangdong police superintendent.</span></p><br/><p><span style=\"\">\"That was a really simple bluff. I don’t know his face but I would like to play poker with him. I wouldn’t even need to use the Gambling skill...”</span></p><br/><p><span style=\"\">He suddenly felt a pain in his palm while muttering. </span><span style=\"\">Tae-hyuk frowned and looked at the wound.</span></p><br/><p><span style=\"\">“…It really can’t be treated.”</span></p><br/><p><span style=\"\">There was a cut from a box cutter knife on his palm. </span><span style=\"\">It had clearly been perfectly stitched with the Illegal Surgery skill. </span><span style=\"\">Even so, nobody seemed to notice the wound.</span></p><br/><p><span style=\"\">\"Will this aggravate it? I guess I have to put a plaster on it.”</span></p><br/><p><span style=\"\">Illegal Surgery couldn’t even do first aid treatment so it felt like a useless skill. </span><span style=\"\">However, it had a special function.</span></p><br/><p><span style=\"\">“Operation Cancel!”</span></p><br/><p><span style=\"\">The small sign of the surgery that sutured the wound disappeared, and it returned to the original state before the procedure.</span></p><br/><p><span style=\"\">“...This could be very useful in prison.”</span></p><br/><p><span style=\"\">He rubbed some ointment on the wound, covered it in a plaster, and contacted Kang-suk. </span><span style=\"\">It was decided that they would meet at the meeting point right now.</span></p><br/><p><span style=\"\">‘They might have noticed that information was being leaked and planned a double trap. So we will meet here.’</span></p><br/><p><span style=\"\">Kang-suk seemed perplexed when he heard that the meeting place was L Amusement Park, but the answer came soon.</span></p><br/><p><span style=\"\">\"Then I’ll see you in 45 minutes.”</span></p><br/><p><span style=\"\">-</span><i><span style=\"\">I understand.</span></i></p><br/><p><span style=\"\">He suggested a time that took into consideration where Kang-suk currently was. </span><span style=\"\">It was only enough time for him to get here.</span></p><br/><p><span style=\"\">By the time Tae-hyuk called a taxi and got to the amusement park, there were five minutes left until the agreed meeting time. </span><span style=\"\">Tae-hyuk bought a ticket to the Ferris wheel and changed his face to Shin Se-ho, whom he had met several times.</span></p><br/><p><span style=\"\">\"It is a weekday evening, but why are there so many people?”</span></p><br/><p><span style=\"\">He couldn’t help laughing. </span><span style=\"\">Kang-suk was meeting Phantom in a place like this. </span><span style=\"\">If he thought Phantom was a simple terrorist, then Kang-suk would’ve turned it down somehow. </span><span style=\"\">It meant that he intended to cooperate since they had the same purpose.</span></p><br/><p><span style=\"\">Tae-hyuk called and asked,</span></p><br/><p><span style=\"\">“Detective Cho Kang-suk. Have you arrived at the meeting point?”</span></p><br/><p><i><span style=\"\">-Heok...</span></i><i><span style=\"\">I am almost there.</span></i></p><br/><p><span style=\"\">“Yes. Once you arrive, buy a Ferris wheel ticket and get on the next one that arrives. Then you will be able to meet me.”</span></p><br/><p><span style=\"\">-</span><i><span style=\"\">I understand.</span></i></p><br/><p><span style=\"\">Tae-hyuk went to a nearby restroom and changed clothes instead of using Counterfeit. </span><span style=\"\">Now he looked so much like Shin Se-ho that even family members wouldn’t be able to tell them apart.</span></p><br/><p><span style=\"\">‘Oh, there he is.’</span></p><br/><p><span style=\"\">When he got back to the Ferris wheel, he could see Kang-suk looking around. </span><span style=\"\">Tae-hyuk quietly walked over and said,</span></p><br/><p><span style=\"\">\"Eh? If it isn’t Detective Cho Kang-suk.”</span></p><br/><p><span style=\"\">“Ack...”</span></p><br/><p><span style=\"\">\"I don’t think you’ve come to play with your girlfriend. Was there an incident or something?”</span></p><br/><p><span style=\"\">\"Ah, no.”</span></p><br/><p><span style=\"\">Despite Kang-suk’s confusion, he pretended like nothing was going on. </span><span style=\"\">He had to meet with Phantom and have an important talk.</span></p><br/><p><span style=\"\">Tae-hyuk said with a smile,</span></p><br/><p><span style=\"\">\"Aye~ you must be hiding something. Don’t be like this. Let’s share something good together.”</span></p><br/><p><span style=\"\">“...I’m sorry but I am very busy. I have to meet someone right now.”</span></p><br/><p><span style=\"\">“Can I join you?”</span></p><br/><p><span style=\"\">“That is a little...”</span></p><br/><p><span style=\"\">Kang-suk noticed that the Ferris wheel car was coming and ran. </span><span style=\"\">There was no time to explain. </span><span style=\"\">Tae-hyuk didn’t miss it and followed along. </span><span style=\"\">In the end, Kang-suk cried out,</span></p><br/><p><span style=\"\">“H-How did you get in? Please leave immediately.”</span></p><br/><p><span style=\"\">\"Detective Cho Kang-suk. Who are you going to meet here?”</span></p><br/><p><span style=\"\">“I can’t tell you that. I’m sorry but I really can’t. You can make a formal protest to the police station.”</span></p><br/><p><span style=\"\">“Nope. You are right, Detective Cho Kang-suk. Weren’t you supposed to meet someone?”</span></p><br/><p><span style=\"\">Kang-suk’s body stiffened. </span><span style=\"\">Now he remembered that Shin Se-ho shouldn’t be here. </span><span style=\"\">He was captured by a killer and was currently stuck in the hospital...</span></p><br/><p><span style=\"\">Kang-suk gulped and looked at the man in front of him.</span></p><br/><p><span style=\"\">\"You, who are you?”</span></p><br/><p><span style=\"\">\"The man that Detective-nim has been waiting for. Then let’s start the deal.”</span></p><br/><p><span style=\"\">Kang-suk stared at the other person.</span></p><br/><p><span style=\"\">“P-Phantom? But no matter how I look, you are Shin Se-ho...”</span></p><br/><p><span style=\"\">“Is this enough to make you believe?”</span></p><br/><p><span style=\"\">Tae-hyuk took the phantom mask from his pocket and placed it on his face. </span><span style=\"\">After a while, he took it off to reveal Cho Kang-suk’s face.</span></p><br/><p><span style=\"\">\"H-Heok!”</span></p><br/><p><span style=\"\">\"It is a joke. Then let’s start the negotiations.”</span></p><br/><p><i><span style=\"\">Rattle rattle.</span></i></p><br/><p><span style=\"\">Once all the passengers boarded, the Ferris Wheel started operating. </span><span style=\"\">It would take five minutes to go around once.</span></p><br/><p><span style=\"\">Everything had to be finished during that time.</span></p><br/>\n</div>"}