{"title": "Chapter 120 - Prelude to the Mafia Game #3", "id": 120, "volume": 2, "url": "http://boxnovel.org/god-of-crime-chapter-120-prelude-to-the-mafia-game-3", "volume_title": "Volume 2", "body": "<h1>Chapter 120 - Prelude to the Mafia Game #3</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span style=\"\">Chapter 120 - Prelude to the Mafia Game #3</span></p><br/><p><span style=\"\">Choi Sung-yeol’s attitude changed and he started treating Tae-hyuk like a VIP.</span></p><br/><p><span style=\"\">It was because the technique Tae-hyuk previously showed was akin to a god’s ability. </span><span style=\"\">Someone with those skills would be treated like a king everywhere he went. </span><span style=\"\">It was like Liu Bei holding onto Zhuge Liang’s talent. </span><span style=\"\">Such a great person suggested to work together first.</span></p><br/><p><span style=\"\">Choi Sung-yeol started releasing information as if to show his greatness. </span><span style=\"\">Tae-hyuk clicked his tongue as he listened.</span></p><br/><p><span style=\"\">‘He is a scammer, so he is both lying and exaggerating some things.’</span></p><br/><p><span style=\"\">However, Tae-hyuk didn’t express his thoughts and acted moderately. </span><span style=\"\">Then some useful information popped out from Choi Sung-yeol’s mouth.</span></p><br/><p><span style=\"\">‘Once he becomes excited, he tends to talk more.’</span></p><br/><p><span style=\"\">\"Meeting a great person like you is enough to feel like it was worth entering Blue Dragon. It is a pity that we will be split apart tomorrow.”</span></p><br/><p><span style=\"\">He spoke like he was a businessman on a business trip, instead of a criminal stuck in prison.</span></p><br/><p><span style=\"\">“Then where are you going?”</span></p><br/><p><span style=\"\">The dissolution of Blue Dragon was decided and the inmates would be scattered all over the country. </span><span style=\"\">Most of them would go to Red Pheonix, Black Tortoise, and White Tiger.</span></p><br/><p><span style=\"\">Tae-hyuk replied with a smile,</span></p><br/><p><span style=\"\">\"Are you going to White Tiger? Unfortunately, I am going somewhere else.”</span></p><br/><p><span style=\"\">Choi Sung-yeol dropped his head in an exaggerated gesture.</span></p><br/><p><span style=\"\">“Kuheok. It is really too bad. Still, it is destiny that we met. I hope we have a good relationship in the future.”</span></p><br/><p><span style=\"\">\"I hope so as well.”</span></p><br/><p><span style=\"\">\"Please contact me as soon as you settle. I will send you the goods that you want.”</span></p><br/><p><span style=\"\">“Huhu... I will be expecting it.”</span></p><br/><p><span style=\"\">Choi Sung-yeol was grinning since he thought he brought a superior card shark to his side. </span><span style=\"\">However, he had provided free access to information that was difficult to obtain. </span><span style=\"\">He would make easy deals if he knew what the other person wanted. </span><span style=\"\">In particular, it was difficult to hide his desire to become stronger in a place like this. </span><span style=\"\">Tae-hyuk had memories of many criminals in Blue Dragon so he fully understood it.</span></p><br/><p><span style=\"\">'After all, it is the Yakuza behind Choi Sung-yeol.’</span></p><br/><p><span style=\"\">The Yakuza dominated Japanese politics and economics in the darkness. </span><span style=\"\">But they even had their hands in South Korea.</span></p><br/><p><span style=\"\">'Choi Sung-yeol and Kim Joon-young’s power alone couldn’t organize something like the Death Circus.’</span></p><br/><p><span style=\"\">Dozens of executives from many large corporations had become involved. </span><span style=\"\">No matter how large a multi-level company was, it would be difficult to establish connections with large corporations. </span><span style=\"\">Thus, he had felt uneasy when dealing with the Death Circus.</span></p><br/><p><span style=\"\">Afterwards, he found out that the Yakuza was behind Choi Sung-yeol.</span></p><br/><p><span style=\"\">‘It seems like the Yakuza had entered more deeply than I thought.’</span></p><br/><p><span style=\"\">Tae-hyuk recalled when he shattered Doll Play a few months ago. </span><span style=\"\">He had fought against the Chinese Triads. </span><span style=\"\">In the near future, the mafias of China, Russia, and Japan would wage war in South Korea. </span><span style=\"\">He had thought that it was due to the massive profits that the Triad received in South Korea.</span></p><br/><p><span style=\"\">‘...I thought the mafia war wouldn’t happen because I destroyed one of the Triads’ major businesses, but I think I took them a bit too lightly.’</span></p><br/><p><span style=\"\">The condition for becoming a King was to win the Mafia Game.</span></p><br/><p><span style=\"\">A mafia war and mafia game. </span><span style=\"\">Maybe they were the same thing?</span></p><br/><p><span style=\"\">Tae-hyuk’s head was complicated. </span><span style=\"\">He knew the future, but not everything. </span><span style=\"\">In order to complete the puzzle, he had to find the missing pieces.</span></p><br/><p><span style=\"\">\"I’m sorry for disturbing your thoughts.”</span></p><br/><p><span style=\"\">“It is nothing. Then I will contact you after moving.”</span></p><br/><p><span style=\"\">\"Please do so.”</span></p><br/><p><span style=\"\">Tae-hyuk nodded lightly and rose from his seat. </span><span style=\"\">There was still work to do before leaving Blue Dragon Prison.</span></p><br/><p><span style=\"\">@</span></p><br/><p><i><span style=\"\">Kwang!</span></i></p><br/><p><span style=\"\">The door to the investigation headquarters opened and a man in a trench coat entered.</span></p><br/><p><span style=\"\">“Sunbae! I heard that Park Sung-yul decided to confess!”</span></p><br/><p><span style=\"\">Kang-suk looked up from where he was writing a report and said,</span></p><br/><p><span style=\"\">“It finished well. He called me.”</span></p><br/><p><span style=\"\">Phantom’s work had revealed the identity of the victims killed by Park Sung-yul. </span><span style=\"\">It was a tremendous achievement. </span><span style=\"\">Currently, detectives and support from Busan were bustling around the investigation headquarters.</span></p><br/><p><span style=\"\">He didn’t know what magic Phantom used, but Park Sung-yul confessed to all the murders.</span></p><br/><p><span style=\"\">\"Hu... I ran like the wind as soon as I heard the news. I never thought that he would confess.”</span></p><br/><p><span style=\"\">Joo Hyun-ho was a huge fan of Detective Columbo. </span><span style=\"\">He resembled Columbo from his style of dressing to his investigation style. </span><span style=\"\">Therefore, he didn’t like the situation where he had to use an information source. </span><span style=\"\">He preferred to solve the mystery using his own head.</span></p><br/><p><span style=\"\">Yet not only didn’t he find any clues, he didn’t solve the case at all. </span><span style=\"\">Was there something happening? </span><span style=\"\">What forced the confession from Park Sung-yul’s mouth? </span><span style=\"\">He wouldn’t have confessed, even if Columbo popped out from the TV.</span></p><br/><p><span style=\"\">Kang-suk laughed as he saw Hyun-ho’s face.</span></p><br/><p><span style=\"\">\"I heard that one of the victims had a executive of a gang as a family member.”</span></p><br/><p><span style=\"\">\"W-What?\"</span></p><br/><p><span style=\"\">\"That person was also confined in the same prison.”</span></p><br/><p><span style=\"\">\"It is like two enemies bumping into each other on a bridge. By the way, the executive of the violent organization... Was he someone recently caught?”</span></p><br/><p><span style=\"\">“Yes. A member of Gallery called Brown Bear. Do you understand?”</span></p><br/><p><span style=\"\">Hyun-ho muttered with wide eyes,</span></p><br/><p><span style=\"\">\"He is a tremendous person! How many coincidences are there? This sounds like a prank from the God of Fate...”</span></p><br/><p><span style=\"\">\"I don’t know about the God of Fate but I’m sure the God of Crime has something to do with it. It is that person’s work.”</span></p><br/><p><span style=\"\">“But Park Sung-yul, he is still alive. I thought he would immediately murder the killer of his family member.”</span></p><br/><p><span style=\"\">Kang-suk printed the report and replied,</span></p><br/><p><span style=\"\">\"Even though he is alive, it feels like death. Park Sung-yul never imagined that the person he killed was related to someone so big. If they are living in the same prison, it won’t be weird to eventually find his body.”</span></p><br/><p><span style=\"\">\"In the end, he confessed so that he could live.”</span></p><br/><p><span style=\"\">“Yes. He would confess everything he did as long as he is sent to a prison without Brown Bear.”</span></p><br/><p><span style=\"\">Hyun-ho’s always smiling face distorted.</span></p><br/><p><span style=\"\">\"He really is a rat bastard. So what does Sunbae think?”</span></p><br/><p><span style=\"\">Kang-suk rubbed at his tired eyes.</span></p><br/><p><span style=\"\">\"First of all, he has decided to confess. Then the trials for the other murders he committed will begin. After that, the sentence he receives will likely be 100 times his current one and he will be sent back to prison.”</span></p><br/><p><span style=\"\">\"A prison without Brown Bear.”</span></p><br/><p><span style=\"\">\"Well, I did promise to do that. By the way, why am I the director of the investigation headquarters?”</span></p><br/><p><span style=\"\">Kang-suk looked at the reports stacked like a mountain in front of him and the documents that needed to be processed. </span><span style=\"\">The investigation was over, but it seemed like he would have to work overtime for a week to handle all of this.</span></p><br/><p><span style=\"\">\"Well, there are so many reports that maybe you might mistakenly misplace one or two?”</span></p><br/><p><span style=\"\">Kang-suk laughed at Hyun-ho’s words.</span></p><br/><p><span style=\"\">“Well. Maybe that will happen.”</span></p><br/><p><span style=\"\">And Hyun-ho decided to buy energy drinks at the convenience store for the tired director.</span></p><br/><p><span style=\"\">@</span></p><br/><p><span style=\"\">Tae-hyuk looked at the face of the man sitting in front of him, </span><span style=\"\">He wore thick glasses and gave off a gentle expression. </span><span style=\"\">Who would imagine that the identity of this person was the ‘Bomber?’ </span></p><br/><p><span style=\"\">The mafia was on a completely different scale from the criminals Tae-hyuk dealt with so far. </span><span style=\"\">Even if he had the crime skills, confronting them with the power of just one individual was limited. </span><span style=\"\">Therefore, Tae-hyuk needed the abilities of the ‘Bomber.’</span></p><br/><p><span style=\"\">For that to happen, Kim Tae-sung needed to escape from prison.</span></p><br/><p><span style=\"\">\"This seems interesting.”</span></p><br/><p><span style=\"\">Kim Tae-sung said with a smile,</span></p><br/><p><span style=\"\">“It seems so.”</span></p><br/><p><span style=\"\">\"I will go with Yoo Cheol-ho to Red Pheonix. Furthermore, you said that we will be in the same room?”</span></p><br/><p><span style=\"\">Kim Tae-sung sipped his coffee and nodded,</span></p><br/><p><span style=\"\">\"It might be easier than you think to break out.”</span></p><br/><p><span style=\"\">\"What do you mean?\"</span></p><br/><p><span style=\"\">\"Oh, I’m talking to myself.”</span></p><br/><p><span style=\"\">Yoo Cheol-ho completely lost his desire for a prison break a few days ago. </span><span style=\"\">However, his eyes became alive again once he heard he was going to Red Phoenix. </span><span style=\"\">It seemed like he knew a method of escaping. </span><span style=\"\">Obviously, he would start formulating a plan to escape once settled in his cell at Red Phoenix. </span><span style=\"\">Tae-hyuk would use that to break out the Bomber.</span></p><br/><p><span style=\"\">‘Then I will leave the tunnel to the mole.’</span></p><br/><p><span style=\"\">Kim Tae-sung smiled and said,</span></p><br/><p><span style=\"\">\"However, it appears as if Shin Chang-ho’s revenge is successful.”</span></p><br/><p><span style=\"\">\"I thought that you didn’t listen to rumors.”</span></p><br/><p><span style=\"\">\"I can hear a lot of things if I just sit and drink tea.”</span></p><br/><p><span style=\"\">“Don’t worry, I will ensure that you get your revenge as promised.”</span></p><br/><p><span style=\"\">“Yes. I look forward to it.”</span></p><br/><p><span style=\"\">Tae-hyuk decided what to tell the Bomber.</span></p><br/><p><span style=\"\">Then he came to the conclusion. </span><span style=\"\">He hid the fact that he was the Phantom. </span><span style=\"\">Instead, he would let Kim Tae-sung know who the enemy was.</span></p><br/><p><span style=\"\">“I’m sorry but I have to leave before you.’</span></p><br/><p><span style=\"\">“Is that so?”</span></p><br/><p><span style=\"\">\"And I will fight against the Yakuza in South Korea.”</span></p><br/><p><span style=\"\">Surprise appeared in Kim Tae-sung’s eyes.</span></p><br/><p><span style=\"\">\"The mafia people from Japan?”</span></p><br/><p><span style=\"\">“Yes. It is also relevant to you. The Yakuza is the one behind the Taesung Group.”</span></p><br/><p><span style=\"\">The face of Taesung Chemical’s chairman, Song Won-jin appeared in his head. </span><span style=\"\">He was the one who watched the show created by Kim Joon-young in a lion mask.</span></p><br/><p><span style=\"\">“...Kim Cheol-su. How do you know all of this?”</span></p><br/><p><span style=\"\">“Don’t think too hard. It is just a coincidence that I need to get rid of the ones you want revenge on. Isn’t that good enough?”</span></p><br/><p><span style=\"\">“...Indeed. I understand.”</span></p><br/><p><span style=\"\">Kim Tae-sung nodded with an expression like he realized something. </span><span style=\"\">Tae-hyuk pulled out a photo and handed it to Kim Tae-sung. </span><span style=\"\">Kim Tae-sung, his wife and his daughter were smiling brightly at the camera.</span></p><br/><p><span style=\"\">“T-This...”</span></p><br/><p><span style=\"\">\"I brought it back from your home. You don’t need to worry, since I didn’t touch anything else.”</span></p><br/><p><span style=\"\">Kim Tae-sung looked at the photo with shaking eyes. </span><span style=\"\">The image stamped there was a trace of the past that couldn’t be realized in reality anymore.</span></p><br/><p><span style=\"\">\"Don’t you look happy in this picture? Don’t forget that the people who took them all away from you are still alive.”</span></p><br/><p><span style=\"\">“......”</span></p><br/><p><span style=\"\">Tae-hyuk saw that Kim Tae-sung’s were now burning with hatred and anger. </span></p><br/><p><span style=\"\">Yes, explode. </span><span style=\"\">That was his role.</span></p><br/><p><span style=\"\">Tae-hyuk quietly rose from his seat and muttered.</span></p><br/><p><span style=\"\">\"Everything I need to do here is over.”</span></p><br/><p><span style=\"\">The moment that Phantom left Blue Dragon Prison, he would show himself to the world.</span></p><br/><p><span style=\"\">This was the prelude to the Mafia Game.</span></p><br/>\n</div>"}