{"title": "Chapter 131 - Traces of the Mask #1", "id": 131, "volume": 2, "url": "http://boxnovel.org/god-of-crime-chapter-131-traces-of-the-mask-1", "volume_title": "Volume 2", "body": "<h1>Chapter 131 - Traces of the Mask #1</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span style=\"\">Chapter 131 - Traces of the Mask #1</span></p><br/><p><span style=\"\">Park Jung-hwan looked quite different from Tae-hyuk’s memories.</span></p><br/><p><span style=\"\">As a politician of the opposition, he had the image of an upright person, no matter the angle that the photo was taken. </span><span style=\"\">He had neatly cropped hair 365 days a year and he always dressed conservatively.</span></p><br/><p><span style=\"\">'However, now it is a hoodie and cargo pants.’</span></p><br/><p><span style=\"\">He always wore branded products from department stores. </span><span style=\"\">But now, Park Jung-hwan, who insisted on luxury suits worth millions of won, wore such casual clothes...</span></p><br/><p><span style=\"\">It felt like seeing the real life of a celebrity.</span></p><br/><p><span style=\"\">‘Well, he isn’t a politician right now. This might be more natural. ‘</span></p><br/><p><span style=\"\">He had hair that wasn’t combed properly and the butt of a cigarette in his mouth. </span><span style=\"\">If he didn’t have the same face then Tae-hyuk really would’ve thought that he was someone else. </span><span style=\"\">Mister Park put the cigarette butt in the ashtray and asked.</span></p><br/><p><span style=\"\">“Did you need more Psychotropic Incense?”</span></p><br/><p><span style=\"\">Psychotropic Incense. </span><span style=\"\">It was the official name of the fragrance that deprived people of their reasoning. </span><span style=\"\">Tae-hyuk spoke with a red face, like he was embarrassed.</span></p><br/><p><span style=\"\">“These days, too many new followers are entering. I’m sorry but I used almost everything. Heheh, this time a bit more...”</span></p><br/><p><span style=\"\">He was like a subcontractor dealing with a large company’s sales department. </span><span style=\"\">It was true despite Cho Min-hyuk being the ruler of a cult with more than 1,000 followers. </span><span style=\"\">Mister Park sat down in front of Tae-hyuk and declared.</span></p><br/><p><span style=\"\">“Let’s finish this full play. Phantom.”</span></p><br/><p><span style=\"\">“Huh? What do you mean...?\"</span></p><br/><p><span style=\"\">\"This isn’t an interrogation. Surely you didn’t think that I wouldn’t notice?”</span></p><br/><p><span style=\"\">The grovelling expression disappeared from Cho Min-hyuk’s face. </span><span style=\"\">It instantly filled with derision. </span><span style=\"\">Tae-hyuk, who was disguised as Cho Min-hyuk, pulled out the opera mask.</span></p><br/><p><span style=\"\">“Of course, Mister Park.”</span></p><br/><p><span style=\"\">\"I wanted to meet you, but I didn’t think you would want to meet me first.</span></p><br/><p><span style=\"\">The Yakuza were embedded deep in South Korean society. </span><span style=\"\">Their eyes and ears were everywhere. </span><span style=\"\">It was impossible for them not to be aware that he smashed Sun. </span><span style=\"\">However, it wasn’t about the cult.</span></p><br/><p><span style=\"\">Tae-hyuk's purpose was to meet with Mister Park. </span><span style=\"\">He just used Cho Min-hyuk as the bait. </span><span style=\"\">Mister Park came here to meet Phantom, not Cho Min-hyuk.</span></p><br/><p><span style=\"\">Tae-hyuk confirmed that there was no one outside the window and said.</span></p><br/><p><span style=\"\">\"I guess you came by yourself.”</span></p><br/><p><span style=\"\">\"The price of South Korean oil is a little bit expensive. I always use public transportation. Anyway, are you planning to kill me?”</span></p><br/><p><span style=\"\">\"You must be very nervous about it. You are wearing a bulletproof vest under that hoodie.”</span></p><br/><p><span style=\"\">\"Hah. Did you notice? I am a little timid. Well, it is nice to meet you. I am Mister Park.”</span></p><br/><p><span style=\"\">Tae-hyuk shook Mister Park’s hands.</span></p><br/><p><span style=\"\">Tae-hyuk activated a crime skill while holding his hand.</span></p><br/><p><span style=\"\">‘Spying!’</span></p><br/><p><span style=\"\">[The Hawk Eyes attribute has been triggered.]</span></p><br/><p><span style=\"\">It was one of that attributes of Spying that he spent 10 affinity points to gain after upgrading to a Noble. </span><span style=\"\">He had the ability to view the detailed ‘status’ of the other person after touching hands. </span><span style=\"\">He could see the name, abilities and current psychological state.</span></p><br/><p><span style=\"\">Mister Park’s name appeared in front of Tae-hyuk’s eyes.</span></p><br/><p><span style=\"\">‘...What? Park Jung-hoon? He isn’t Park Jung-hwan?!’</span></p><br/><p><span style=\"\">His profession was acting as the spokesman of the Oyabun. </span><span style=\"\">His intelligence was 50 points and his leadership was 63 points.</span></p><br/><p><span style=\"\">'Doesn’t Hawk Eyes kick in when holding hands... Hurry up and let me see his psychological state.’</span></p><br/><p><span style=\"\">He ignored the things that weren’t important.</span></p><br/><p><span style=\"\">[Oyabun commanded that Phantom should be brought to our side...]</span></p><br/><p><span style=\"\">Tae-hyuk arranged his confused head and spoke calmly,</span></p><br/><p><span style=\"\">\"Would you like a cup of coffee? The boss seems to be a little busy, so I will make it.”</span></p><br/><p><span style=\"\">“Huhu, thank you.”</span></p><br/><p><span style=\"\">Tae-hyuk drank the coffee while thinking about Mister Park’s real name.</span></p><br/><p><span style=\"\">'Park Jung-hoon rather than Park Jung-hwan. And the same face. They must be twins.’</span></p><br/><p><span style=\"\">Park Jung-hwan, who died two years ago, eventually returned to politics. </span><span style=\"\">Then he was killed again after that. </span><span style=\"\">Park Jung-hoon, his twin brother, was the politician.</span></p><br/><p><span style=\"\">'The opponent is the Yakuza. In order words, the Yakuza will enter the political world.’</span></p><br/><p><span style=\"\">He found the last piece of the puzzle.</span></p><br/><p><span style=\"\">'Something went wrong and Park Jung-hwan was murdered. There is a high possibility that the person was associated with the Yakuza. Then they put the guilt on a guard who was near the murder scene.’</span></p><br/><p><span style=\"\">It was Seo Tae-hyuk who obtained a job as a guard after the army.</span></p><br/><p><span style=\"\">'This is the method... The true culprit is among the mafia.’</span></p><br/><p><span style=\"\">It seemed that winning the mafia game was a condition to update to King. </span><span style=\"\">Tae-hyuk narrowed his eyes and looked at Park Jung-hoon.</span></p><br/><p><span style=\"\">'First, they want Phantom. Isn’t it okay to check it out?’</span></p><br/><p><span style=\"\">\"I don’t know the type of beans so I mixed them roughly. If it doesn’t suit your taste then tell me.”</span></p><br/><p><span style=\"\">“Haha. The taste of the coffee made by Phantom... Thank you.\"</span></p><br/><p><span style=\"\">Park Jung-hoon drank the coffee that looked more like Chinese medicine. </span><span style=\"\">Then he looked at Tae-hyuk with sharp eyes.</span></p><br/><p><span style=\"\">\"I would like to speak plainly, Phantom. I would like you to join the organization.\"</span></p><br/><p><span style=\"\">\"Do you mean to become subordinate to someone else?”</span></p><br/><p><span style=\"\">“Haha. You can think of it as a scouting proposal. We are prepared to offer one million dollars as a down payment if you want.”</span></p><br/><p><span style=\"\">“That seems a little small.”</span></p><br/><p><span style=\"\">Park Jung-hoon’s tension increased at Tae-hyuk’s words.</span></p><br/><p><span style=\"\">“Naturally that isn’t all. The organization already has a lot of Korean branches. You can become the chief of those places.”</span></p><br/><p><span style=\"\">\"Doesn’t it sound like you want to use me as the face?”</span></p><br/><p><span style=\"\">\"Think of it as a symbol of hope.\"</span></p><br/><p><span style=\"\">Tae-hyuk contemplated it for a moment before muttering,</span></p><br/><p><span style=\"\">\"What will happen if I become the chief? What is my share of the profits?”</span></p><br/><p><span style=\"\">\"I'm sorry, but the organization has heard of your abilities. Firstly, you will need to go to Oyabun and demonstrate them to him. Then you’ll get around 10% of the profits earned.”</span></p><br/><p><span style=\"\">10% of the profits obtained from South Korea. </span><span style=\"\">It was a lot of money for one person, meaning that they valued Phantom quite highly.</span></p><br/><p><span style=\"\">“It is a decent deal.”</span></p><br/><p><span style=\"\">“Haha. Of course, you are free to think about it slowly. There is still some time left before the Yakuza will start earnestly working in South Korea.”</span></p><br/><p><span style=\"\">Park Jung-hoon pulled out a business card from his wallet. </span><span style=\"\">It was a piece of white paper with nothing written. </span><span style=\"\">It was actually a memory card that looked like a business card.</span></p><br/><p><span style=\"\">\"Once you connect it to a laptop, the program will automatically install. Think of it as a complex way to contact us.”</span></p><br/><p><span style=\"\">\"Hrmm.\"</span></p><br/><p><span style=\"\">\"So please get in touch. Ah right.”</span></p><br/><p><span style=\"\">Park Jung-hoon approached Tae-hyuk and whispered.</span></p><br/><p><span style=\"\">\"Even if you refuse the proposal, I suggest that you refrain from touching the Yakuza. No matter how outstanding your abilities, you are just an egg. Then I am busy so I’ll go first.”</span></p><br/><p><span style=\"\">Park Jung-hoon sent Phantom a menacing smile and left the cafe.</span></p><br/><p><span style=\"\">Tae-hyuk drank the cold coffee. </span><span style=\"\">It tasted as terrible as its color.</span></p><br/><p><span style=\"\">Then he quietly muttered,</span></p><br/><p><span style=\"\">\"I’m going to pull down that mask.”</span></p><br/><p><span style=\"\">@</span></p><br/><p><span style=\"\">Tae-hyuk couldn’t walk around in the opera mask, so he changed his face into a familiar criminal. </span><span style=\"\">Then he released the boss of the cafe that was tied up in the warehouse.</span></p><br/><p><span style=\"\">\"Don't worry. There were no customers. Ah right, I placed the money for the coffee I drank in the register.”</span></p><br/><p><span style=\"\">\"Kuoooook...”</span></p><br/><p><span style=\"\">He wanted to say something but the other person was Phantom. </span><span style=\"\">Tae-hyuk smiled and walked out of the cafe. </span><span style=\"\">He used the excuse that he was going to a language course so he still had some time left.</span></p><br/><p><span style=\"\">It was a remote place so he had to walk five minutes to get to the bus stop. </span><span style=\"\">He was walking down the dark road when there was a sharp scream.</span></p><br/><p><span style=\"\">“Kya, aaaack! S-S-Save me! Anyone!”</span></p><br/><p><span style=\"\">Tae-hyuk usually would’ve ignored it, but then he realized an interesting fact.</span></p><br/><p><span style=\"\">‘If they want to attack someone in such a remote place, wouldn’t they come by car or motorbike? There are no people around, so shall I test my Vehicle Theft skill?’</span></p><br/><p><span style=\"\">The crime was happening in a nearby place. </span><span style=\"\">After a while, Tae-hyuk would act and steal the vehicle.</span></p><br/><p><span style=\"\">‘Stealing from people committing a crime. They won’t bother to report it to the police.’</span></p><br/><p><span style=\"\">Tae-hyuk grinned wickedly as he walked towards the place where the screams were heard. </span><span style=\"\">Then he saw an unidentified attacker trying to hit a woman. </span><span style=\"\">There was a big weapon in his hand, like he wasn’t just trying to steal money.</span></p><br/><p><span style=\"\">As expected, there was a car nearby. </span><span style=\"\">The woman begged.</span></p><br/><p><span style=\"\">\"P-Please help me... If I don’t pay these people then they will shoot me with a gun...”</span></p><br/><p><span style=\"\">Tae-hyuk sighed and scratched his head,</span></p><br/><p><span style=\"\">“Huu... Are you a foreigner?”</span></p><br/><p><span style=\"\">The woman looked at Tae-hyuk with big eyes.</span></p><br/><p><span style=\"\">She seemed to be asking why he didn’t save her immediately. </span><span style=\"\">She had long silver hair that went to the waist and blue eyes. </span><span style=\"\">Her beauty was too much to be walking these streets alone.</span></p><br/><p><span style=\"\">The girl nodded with tearful eyes.</span></p><br/><p><span style=\"\">\"Yes, I am from Russia.\"</span></p><br/><p><span style=\"\">\"I'm sorry. Shouldn’t you make this play more plausible?”</span></p><br/><p><span style=\"\">“W-What...?”</span></p><br/><p><span style=\"\">Tae-hyuk sighed and looked at the gunman trying to attack the woman, as well as the car he came in. </span><span style=\"\">The gunman were holding the famous Soviet submachine gun, the PPSH-41. </span><span style=\"\">They weren’t the newest weapons, but were a favourite among the mafia.</span></p><br/><p><span style=\"\">And...</span></p><br/><p><span style=\"\">\"Who would attack someone while riding a Mercedes?”</span></p><br/><p><span style=\"\">\"......\"</span></p><br/><p><span style=\"\">It was also the S class that went for more than 200 million won.</span></p><br/><p><span style=\"\">\"Besides, don’t you know that submachine guns aren’t common in South Korea?”</span></p><br/><p><span style=\"\">“......”</span></p><br/><p><span style=\"\">All expression disappeared from the woman’s face at Tae-hyuk’s words. </span><span style=\"\">Then she abruptly grabbed the gunman standing beside her.</span></p><br/><p><span style=\"\">\"I told you that you should use knives, Semon.”</span></p><br/><p><span style=\"\">\"But, Young Lady. At least this much is needed...”</span></p><br/><p><span style=\"\">\"Have you forgotten? Our opponent is someone who fought against Big Brother. Don’t you think he can deal with these toys? Still, he didn’t do anything because he realized it.”</span></p><br/><p><span style=\"\">“Yes, I understand.”</span></p><br/><p><span style=\"\">The woman from Russia grabbed her skirt with one hand and elegantly bowed.</span></p><br/><p><span style=\"\">\"Zdrastvooyte (Hello in Russian). I am Caterina Ivankov. I came to meet you.”</span></p><br/><p><span style=\"\">Tae-hyuk asked,</span></p><br/><p><span style=\"\">\"Me? Why?\"</span></p><br/><p><span style=\"\">\"I know you are Phantom. We found out that you would be here at this time...”</span></p><br/><p><span style=\"\">“Young Lady. Stop it.”</span></p><br/><p><span style=\"\">\"At any rate, the reason I came is simple. I want to have Phantom as well.”</span></p><br/><p><span style=\"\">A proposal? </span><span style=\"\">No matter how he looked at it, the atmosphere wasn’t romantic enough for such a thing.</span></p><br/><p><span style=\"\">Either way, it was clear that she wasn’t an ordinary foreign woman. </span><span style=\"\">Perhaps...</span></p><br/><p><span style=\"\">“Young lady, no, Boss. Saying such words can be misleading. I will explain on her behalf. The person standing in front of you is the handpicked successor of the Ivankov family, and one of Red Mafia’s bosses. Kataros (Caterina) Ivankov and Ivankov desperately needs your help. Won’t you help us?”</span></p><br/><p><span style=\"\">This young lady was a boss of Red Mafia? </span><span style=\"\">And they needed his help?</span></p><br/><p><span style=\"\">Tae-hyuk narrowed his eyes and looked at the other person.</span></p><br/><p><span style=\"\">The Yakuza and the Red Mafia. </span><span style=\"\">Both of them started to reach out to grab Phantom’s mask.</span></p><br/><p><span style=\"\">[TL Note: Due to the gender neutral nature of the Korean language, it was hard to tell if Kataros was male or female. However, the author also seemed to deliberately conceal her gender, implying that she was male until now.]</span></p><br/>\n</div>"}