{"title": "Chapter 141 - Everybody Gather! #7", "id": 141, "volume": 2, "url": "http://boxnovel.org/god-of-crime-chapter-141-everybody-gather-7", "volume_title": "Volume 2", "body": "<h1>Chapter 141 - Everybody Gather! #7</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span style=\"\">Chapter 141 - Everybody Gather! #7</span></p><br/><p><span style=\"\">The Bomber’s jailbreak!</span></p><br/><p><span style=\"\">He was an atrocious criminal who made bombs with great power designed to commit terrible acts. </span><span style=\"\">It was a case that overturned the whole country. </span><span style=\"\">But the problem was what led to the breakout.</span></p><br/><p><span style=\"\">“Did you sense home?”</span></p><br/><p><span style=\"\">“......”</span></p><br/><p><span style=\"\">“Wah? Did you know? I’ll tell you the truth. You’re returning home in two hours, you really do have a homing instinct.”</span></p><br/><p><span style=\"\">Yoo Cheol-ho glared at the investigator in charge of questioning him.</span></p><br/><p><span style=\"\">\"Investigator-nim. Let’s be honest here since we know each other so well. Give me a pen and I will tell you who the leader that escaped with Kim Tae-sung is, and everything else you want to know.”</span></p><br/><p><span style=\"\">The investigator clicked his tongue and muttered,</span></p><br/><p><span style=\"\">\"Is it because you escaped from jail twice? Well, it is good that this will end quickly.”</span></p><br/><p><span style=\"\">“Instead, I have one condition.”</span></p><br/><p><span style=\"\">\"What is it?”</span></p><br/><p><span style=\"\">\"Once the investigation is finished, I want to be sent to another prison...”</span></p><br/><p><span style=\"\">\"If you cooperate with the investigation, then I’ll see what I can do.”</span></p><br/><p><span style=\"\">Thus, the whole truth behind the Red Phoenix escape was revealed by Yoo Cheol-ho. </span><span style=\"\">A groan emerged from the mouth of the investigator.</span></p><br/><p><span style=\"\">“Kuooooh... P-Phantom and the Bomber have joined hands. If the commissioner hears about this, then he will have a headache for a while.”</span></p><br/><p><span style=\"\">\"Yes, that’s right. This time, I didn’t break out because I wanted to. I was forced into it due to Phantom... Doesn’t Investigator-nim know about his tricks?”</span></p><br/><p><span style=\"\">Then the investigator laughed,</span></p><br/><p><span style=\"\">“Really? Then this is also fake?”</span></p><br/><p><span style=\"\">He pulled out the tape recorder that had Yoo Cheol-ho’s voice recorded on it. </span><span style=\"\">Yoo Cheol-ho’s eyes trembled as he saw it.</span></p><br/><p><span style=\"\">\"P-Phantom has the ability to change his face and voice into me...”</span></p><br/><p><span style=\"\">“Really? Then I should discuss it with the warden. Anyway, I won’t forget what you told me and will talk to the warden.”</span></p><br/><p><span style=\"\">What? Tell the warden?</span></p><br/><p><span style=\"\">Yoo Cheol-ho’s face turned white.</span></p><br/><p><span style=\"\">The tape recorder showed that he betrayed the warden. </span><span style=\"\">He would be dead if it entered the warden’s ears!</span></p><br/><p><span style=\"\">@</span></p><br/><p><span style=\"\">The newly appointed police commissioner, Chae Bum-ho, was eating in a high class Korean restaurant. </span><span style=\"\">There were delicacies such as abalone, sea bream sashimi, roasted eel, fresh roe, etc.  </span><span style=\"\">Even so, Chae Bum-ho’s reaction wasn’t impressed.</span></p><br/><p><span style=\"\">A man in his 30s with a scary atmosphere was sitting in front of Chae Bum-ho.</span></p><br/><p><span style=\"\">“Yes, Mister Park. Did you get the job done?”</span></p><br/><p><span style=\"\">Mister Park put wasabi on top of the sea bream sashimi and said,</span></p><br/><p><span style=\"\">“Don’t worry. The evidence that Hyung-nim is related to us has been disposed of.”</span></p><br/><p><span style=\"\">“Really? If that is so... You went through a lot of effort.”</span></p><br/><p><span style=\"\">Chae Bum-ho’s stiff face became much softer. </span><span style=\"\">He grabbed his spoon and started to eat the rice.</span></p><br/><p><span style=\"\">Mister Park finished the sashimi and reached out for the grilled beef. </span><span style=\"\">The charcoal gave it a mouth-watering scent.</span></p><br/><p><span style=\"\">\"The meat is very soft.</span></p><br/><p><span style=\"\">\"I see. Eat a lot.”</span></p><br/><p><span style=\"\">“Ah right, today Hyung-nim is a reborn person who has nothing to do with the Yakuza. Congratulations. Let’s have a drink.”</span></p><br/><p><span style=\"\">Mister Park passed a cup of sake to Chae Bum-ho.</span></p><br/><p><span style=\"\">Their words were dangerous, but there was no need to worry about anyone overhearing. </span><span style=\"\">This was a place where large business executives and high ranking bureaucrats gathered. </span><span style=\"\">Thus, it was very strictly managed. </span><span style=\"\">Secret conversations shared over meals wouldn’t be leaked.</span></p><br/><p><span style=\"\">Chae Bum-ho and Mister Park drank the sake and smiled at each other.</span></p><br/><p><span style=\"\">\"To the newly reborn Hyung-nim!”</span></p><br/><p><span style=\"\">Chae Bum-ho smiled in satisfaction.</span></p><br/><p><span style=\"\">With this, he could focus on catching Phantom without any worries. </span><span style=\"\">It hadn’t been exposed, but the Japanese Yakuza were already deeply embedded in South Korean society.</span></p><br/><p><span style=\"\">\"Then I would like your help with Phantom, as well as in covering up the Taesung Group case.”</span></p><br/><p><span style=\"\">“Kukukuk. Phantom doesn’t know how big of a group he has declared war against. Only the tip of the iceberg has been revealed.”</span></p><br/><p><span style=\"\">Chae Bum-ho was the local police commissioner. </span><span style=\"\">He was credited for finishing a mysterious illness case and was considered a genius at taking opportunities when they arose. </span><span style=\"\">Although the Bomber had run amok, he was now in prison. </span><span style=\"\">That case wouldn’t be mentioned again.</span></p><br/><p><span style=\"\">\"Please note that the research is proceeding safely. This is all thanks to Hyung-nim’s efforts.”</span></p><br/><p><span style=\"\">“Yes. This time, pay more attention to managing the staff.”</span></p><br/><p><span style=\"\">“Haha! Don’t worry. Sooner or later, I will use this face to enter the political arena. Then we can focus more on the research.”</span></p><br/><p><span style=\"\">Chae Bum-ho smiled at Mister Park’s words.</span></p><br/><p><span style=\"\">\"Then let’s talk about Phantom.”</span></p><br/><p><span style=\"\">Mister Park replied with a smile.</span></p><br/><p><span style=\"\">\"He is our enemy. What other explanation is needed? The organization will lend its full support.”</span></p><br/><p><span style=\"\">\"I heard from Kazuo hyung-nim. Sooner or later, a major Phantom extermination plan will be implemented. What? Working with criminals to catch criminals? I will let him know whose home he is playing in.”</span></p><br/><p><span style=\"\">The Yakuza and police had a common goal to catch Phantom.</span></p><br/><p><span style=\"\">At that moment, a vibration was heard.</span></p><br/><p><span style=\"\">“Hyung-nim. Is that a message?”</span></p><br/><p><span style=\"\">“...I told them not to contact me while I was eating.”</span></p><br/><p><span style=\"\">\"There must be an important reason. You can check it out.”</span></p><br/><p><span style=\"\">Chae Bum-ho looked at the screen of his phone and was at a loss for words.</span></p><br/><p><span style=\"\">\"Hyung-nim?\"</span></p><br/><p><span style=\"\">Mister Park got up and approached Chae Bum-ho, who had become like a stone statue. </span><span style=\"\">What the hell was going on?</span></p><br/><p><span style=\"\">He looked at Chae Bum-ho’s phone. </span><span style=\"\">It was written that Phantom was the ringleader who broke the Bomber out of Red Phoenix Prison.</span></p><br/><p><span style=\"\">“Hu, huhu, huhuhuhu...”</span></p><br/><p><span style=\"\">Chae Bum-ho chuckled in a low voice. </span><span style=\"\">Then he muttered in a small voice,</span></p><br/><p><span style=\"\">\"You dared touch this area?! Yes, let’s do it Phantom. I will take it as a declaration of war. Yes. This is war.”</span></p><br/><p><span style=\"\">The next day, the police changed their policy from cooperation with Phantom to catching him. </span><span style=\"\">Phantom absolutely had to be arrested. </span><span style=\"\">The police declared a war against the criminal Phantom.</span></p><br/><p><span style=\"\">@</span></p><br/><p><span style=\"\">In secluded rural village deep in the mountains of Gangwon Province was a place that tourists rarely ever visited.</span></p><br/><p><span style=\"\">It boasted only 20 households and even that number was gradually decreasing. </span><span style=\"\">However, there was a sudden boom a few years ago. </span><span style=\"\">A dozen or so robust men came to the area to do farming.</span></p><br/><p><span style=\"\">This was the first time.</span></p><br/><p><span style=\"\">In addition, the crops they brought were far more profitable than the ones previously grown. </span><span style=\"\">It was like gold was literally growing from the ground. </span><span style=\"\">It was delicious food for worms.</span></p><br/><p><span style=\"\">The village thoroughly restricted access of outsiders. </span><span style=\"\">The advantage was that people couldn’t enter the village unless they crossed a long bridge between two cliffs.</span></p><br/><p><span style=\"\">\"Hwang-ssi! I heard that last month’s harvest was 2,000?”</span></p><br/><p><span style=\"\">\"Huhu, it was 500 more than expected. It is because there was a lot of rain.”</span></p><br/><p><span style=\"\">\"But the crops are also very good this time. If this continues on, then we will be able to harvest more than usual.”</span></p><br/><p><span style=\"\">“Haha. I didn’t know that barley would sell for such an expensive price.”</span></p><br/><p><span style=\"\">The old man said this but he actually knew the truth. </span><span style=\"\">The crops being grown here were drugs. </span><span style=\"\">However, he learned that terrifying fact too late. </span><span style=\"\">The numbers written in the National Agricultural Cooperative Federation (NACF) account was growing and the village was becoming rich. </span><span style=\"\">He could ignore his conscience. </span><span style=\"\">He hadn’t been in touch with his family for several years. </span><span style=\"\">The village changing was exciting.</span></p><br/><p><span style=\"\">“Huhu, I am going out to work in the fields today...”</span></p><br/><p><span style=\"\">The old people followed behind the young people who came to town. </span><span style=\"\">However, the things they were carrying were strange. </span><span style=\"\">They were holding black rifles, not plows, or sickles. </span><span style=\"\">They were the escorts and watchdogs of the elderly.</span></p><br/><p><span style=\"\">As the elderly people arrived at the fields, they saw something red.</span></p><br/><p><span style=\"\">“W-What? T-That!”</span></p><br/><p><span style=\"\">\"The fields are burning!”</span></p><br/><p><span style=\"\">\"F-Fire!!!”</span></p><br/><p><span style=\"\">They dropped the farm equipment that they were carrying. </span><span style=\"\">The person holding the steering wheel of the tractor rushed out. </span><span style=\"\">The sight before their eyes was completely different.</span></p><br/><p><span style=\"\">The drug farm was burning like a bomb had gone off. </span><span style=\"\">In the middle was a white mask.</span></p><br/><p><span style=\"\">\"A-A person?\"</span></p><br/><p><span style=\"\">\"H-How can he stand there without burning?!”</span></p><br/><p><span style=\"\">As the elderly people stared, the masked person disappeared like the wind. </span><span style=\"\">Only the mask he was wearing remained on the completely burnt fields.</span></p><br/><p><span style=\"\">A man with a gun muttered,</span></p><br/><p><span style=\"\">“Phantom...?!” (Japanese)</span></p><br/><p><span style=\"\">“P-Phantom...”</span></p><br/><p><span style=\"\">The monster with the mask disappeared like the wind after blowing away one of the Yakuza’s drug farms. </span><span style=\"\">Then the police sirens were belatedly heard in the secluded village.</span></p><br/><p><span style=\"\">@</span></p><br/><p><i><span style=\"\">Tang!</span></i></p><br/><p><span style=\"\">A man in a white suit and black sunglasses struck the table.</span></p><br/><p><span style=\"\">\"W-What? 10 places have been hit in just a week?\"</span></p><br/><p><span style=\"\">He was Kazuo Takeshi, the Yakuza member in charge of all of South Korea.</span></p><br/><p><span style=\"\">\"I thought it was easy to manage the farms. What is Mister Park doing?”</span></p><br/><p><span style=\"\">He pressed the call button with an agitated face. </span><span style=\"\">Then a familiar voice was heard,</span></p><br/><p><i><span style=\"\">-I'm sorry Hyung-nim.</span></i><i><span style=\"\">We are doing our best, but we can’t even find a shadow...</span></i></p><br/><p><span style=\"\">“Does that make sense? What is Chae Bum-ho doing?”</span></p><br/><p><span style=\"\">-.......</span></p><br/><p><span style=\"\">“A week. If you don’t catch that bastard in a week then it won’t end with just one finger.”</span></p><br/><p><span style=\"\">-</span><i><span style=\"\">U-Understood.</span></i></p><br/><p><span style=\"\">Kazuo hung up and muttered,</span></p><br/><p><span style=\"\">\"How could one bastard do so much damage?! Damn.”</span></p><br/><p><span style=\"\">There was a nameplate reading ‘Park Il-bu, president of the Taesung Industries’ in front of his seat. (President is lower than chairman). </span><span style=\"\">It was a lower title than what his men called him. </span><span style=\"\">However, he needed to hide his identity as a Yakuza member in South Korea.</span></p><br/><p><span style=\"\">\"If the supplies are delayed then the research will be delayed, and our wish...”</span></p><br/><p><span style=\"\">It was at that moment. </span><span style=\"\">There was a flash, and the office where Kazuo was sitting in was hit with a huge explosion.</span></p><br/><p><i><span style=\"\">Kwa kwa.</span></i></p><br/><p><i><span style=\"\">Kwa kwa kwa kwang!</span></i></p><br/><p><span style=\"\">There was a huge thunder like sound in front of him. </span><span style=\"\">Kazuo died without feeling any pain.</span></p><br/><p><span style=\"\">Tae-hyuk watched the explosion from 500m away from the Taesung building and lamented.</span></p><br/><p><span style=\"\">\"Ah, the timing was a little wrong.”</span></p><br/><p><span style=\"\">He wanted to make a speech before pressing the detonation switch, but he had accidentally blown up the building before he could do so. I</span><span style=\"\">t couldn’t be helped.</span></p><br/><p><span style=\"\">\"Ah, I don't know.”</span></p><br/><p><span style=\"\">Tae-hyuk pointed at the burning building.</span></p><br/><p><span style=\"\">\"Fire!\"</span></p><br/><p><span style=\"\">It was a little late but he still felt good. </span><span style=\"\">He had destroyed the enemy’s base and their supplies. </span><span style=\"\">The only thing left was to deal with the remaining people.</span></p><br/><p><span style=\"\">\"Now, my turn still isn’t over yet.”</span></p><br/><p><span style=\"\">The Yakuza and police were looking for him at the same time.</span></p><br/><p><span style=\"\">Nevertheless, Phantom’s movements were unaffected. </span><span style=\"\">He was always one step ahead.</span></p><br/><p><span style=\"\">Tae-hyuk thoroughly destroyed the places run by the Yakuza.</span></p><br/>\n</div>"}