{"title": "Chapter 151 - Time to Clean Up #2", "id": 151, "volume": 2, "url": "http://boxnovel.org/god-of-crime-chapter-151-time-to-clean-up-2", "volume_title": "Volume 2", "body": "<h1>Chapter 151 - Time to Clean Up #2</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span style=\"\">Chapter 151 - Time to Clean Up #2</span></p><br/><p><span style=\"\">\"Bomber, you have worked hard in the meantime. Now I will do as I promised.”</span></p><br/><p><span style=\"\">The Bomber didn't say anything for a while. </span><span style=\"\">He wanted to take direct revenge on the Taesung Group, who drove his family to their deaths.</span></p><br/><p><span style=\"\">-....</span><i><span style=\"\">At first, I thought they would be judged if I revealed what they did. </span></i><i><span style=\"\">However, I was mistaken.</span></i></p><br/><p><span style=\"\">At first, there were a lot of people who blamed the Taesung Group for concealing the events that occurred at their laboratory. </span><span style=\"\">On the Internet, a boycott against products made by the Taesung Group were launched. </span><span style=\"\">The stock prices fell everyday, leading to losses of billions of won.</span></p><br/><p><span style=\"\">The person who was responsible was arrested and everything seemed to be going as the Bomber planned. </span><span style=\"\">However, the Bomber was unaware of how much the big corporations dominated the Korean system.</span></p><br/><p><span style=\"\">“Yes. One researcher committed suicide and claimed all responsibility. It fizzled out.”</span></p><br/><p><span style=\"\">The Bomber said,</span></p><br/><p><span style=\"\">-</span><i><span style=\"\">In less than 10 minutes, the headlines were filled with entertainment scandals.</span></i><i><span style=\"\">I didn’t think that such a large incident could be buried so easily.</span></i></p><br/><p><span style=\"\">\"That is possible in South Korea.”</span></p><br/><p><span style=\"\">-</span><i><span style=\"\">Huhu...is that so?</span></i><i><span style=\"\">That is why we have to do such things in South Korea.</span></i></p><br/><p><span style=\"\">He heard a clicking sound over the receiver. </span><span style=\"\">Was the Bomber touching his bombs?</span></p><br/><p><span style=\"\">The Bomber acted as if his emotions had been removed ever since he escaped from prison. </span><span style=\"\">It was only when he talked about the Taesung Group that he felt like a living human. </span><span style=\"\">He was literally a bomb that lived for destroying his target.</span></p><br/><p><span style=\"\">\"First of all, I wanted to make sure of something.”</span></p><br/><p><span style=\"\">-...</span><i><span style=\"\">What is it?</span></i></p><br/><p><span style=\"\">\"What is the revenge you want?”</span></p><br/><p><span style=\"\">It was a question that implied various things. </span><span style=\"\">It was simple if he just wanted revenge on the one who killed his family. </span><span style=\"\">Tae-hyuk just needed to find the person who injected them directly with the virus.</span></p><br/><p><span style=\"\">However, the Bomber wouldn’t be satisfied with just that. </span><span style=\"\">The target of the Bomber was the Taesung Group itself that ran the research institutes.</span></p><br/><p><span style=\"\">-</span><i><span style=\"\">First of all...I want to know who ordered the experiment on my wife and daughter.</span></i></p><br/><p><span style=\"\">“That isn’t hard.”</span></p><br/><p><span style=\"\">-</span><i><span style=\"\">I also want to smash the Taesung Group, the group that made it possible.</span></i></p><br/><p><span style=\"\">“That isn’t hard either.”</span></p><br/><p><span style=\"\">The Bomber’s voice started shaking,</span></p><br/><p><span style=\"\">-</span><i><span style=\"\">Is it possible?</span></i><i><span style=\"\">No matter how great you are, Phantom will need to fight a big corporation by yourself.</span></i></p><br/><p><span style=\"\">“Huhu, don’t worry about it. I will fulfill my promise.”</span></p><br/><p><span style=\"\">He wanted to try the abilities that he had gained after upgraded himself to a King. </span><span style=\"\">It was good for him as well.</span></p><br/><p><i><span style=\"\">-Yes, I understand.</span></i></p><br/><p><span style=\"\">Tae-hyuk instructed the Bomber to prepare for the fight against the research institutes.</span></p><br/><p><span style=\"\">@</span></p><br/><p><span style=\"\">If he watched any TV program then he would see advertisements from the Taesung Group. </span><span style=\"\">The influence of the Taesung Group on the mass media was amazing.</span></p><br/><p><span style=\"\">\"In the end, one or two people dying doesn’t matter.”</span></p><br/><p><span style=\"\">Tae-hyuk recalled the chairman of the Taesung Group, Song Won-jin.</span></p><br/><p><span style=\"\">Tae-hyuk first saw him in the Death Circus. </span><span style=\"\">He sat in the best seat with a lion mask on his face. </span><span style=\"\">After that, the Bomber incident happened and he went through questioning before returning to the Taesung Group.</span></p><br/><p><span style=\"\">Tae-hyuk had clicked his tongue at the news.</span></p><br/><p><span style=\"\">\"The Taesung research institute event is kind of understandable. But how did he get out of the Death Circus case? It is impossible unless he has connections with the prosecutors...”</span></p><br/><p><span style=\"\">He knew that the Yakuza’s support was behind the Taesung Group.</span></p><br/><p><span style=\"\">“...Wait a minute. This means...”</span></p><br/><p><span style=\"\">Tae-hyuk combined his future knowledge and the information he had obtained as Phantom. </span><span style=\"\">He was able to come up with a shocking fact.</span></p><br/><p><span style=\"\">\"The hands of the Yakuza might’ve reached the prosecutors as well. It is a high-ranking person.”</span></p><br/><p><span style=\"\">If he investigated then more details would emerge. </span><span style=\"\">If so, he knew what had to be done from now on.</span></p><br/><p><span style=\"\">First of all, gather information. </span><span style=\"\">The goal was the Taesung Institute of Physics and Chemistry. </span><span style=\"\">It was one of the few natural sciences institutes in South Korea. </span><span style=\"\">Physics, engineering, chemistry, computational science, biology and medical science were closely studied there. </span><span style=\"\">Originally, it was inside the Taesung Research Complex, but it was moved after the incident.</span></p><br/><p><span style=\"\">\"Yes, I should go into the lion’s den to catch the lion.”</span></p><br/><p><span style=\"\">Tae-hyuk licked his lips. </span><span style=\"\">It wasn’t a place he could easily enter. </span><span style=\"\">Just like fighting against the mafia, it was impossible to shatter all of the research institutes belonging to the Taesung Group. </span><span style=\"\">He had only been able to drive the mafia away from South Korea.</span></p><br/><p><span style=\"\">\"If I roam around the lair as a fox, then I can escape the lion.”</span></p><br/><p><span style=\"\">Eh? If it was a lion then he knew someone similar. </span><span style=\"\">Tae-hyuk suddenly came up with a very good plan before heading to Taesung Chemical’s headquarters.</span></p><br/><p><span style=\"\">Unlike the institute, it was easy to reach by taxi. </span><span style=\"\">He headed to a nearby restroom and pulled out the Demon Revealing Mirror.</span></p><br/><p><span style=\"\">‘Then shall I test the power of Transformation?’</span></p><br/><p><span style=\"\">It was the new skill he learnt after upgrading to a King.</span></p><br/><p><span style=\"\">‘The spy shouldn’t be a good-looking woman.’</span></p><br/><p><span style=\"\">He ended up becoming a new reporter who was in her early 20s. </span><span style=\"\">She had bright blonde hair that was cut short, and makeup that felt unfamiliar. </span><span style=\"\">The clothes she wore were the same, so the leather jacket was baggy.</span></p><br/><p><span style=\"\">\"Ah, I forgot to change clothes. Ahaha...”</span></p><br/><p><span style=\"\">His voice was perfectly changed into a woman’s, so there was no need to use Voice Modulation separately. </span><span style=\"\">He used Counterfeit to change his leather jacket and jeans into a neat ladies’ suit. </span><span style=\"\">The pass around his neck allowed him access to large companies.</span></p><br/><p><span style=\"\">Tae-hyuk looked in the mirror and tried to make an expression that was as innocent as possible. </span><span style=\"\">He didn’t know where to go but he decided to try it first.</span></p><br/><p><span style=\"\">@</span></p><br/><p><span style=\"\">Like all large companies, the entire high-rise building was the headquarters of Taesung Chemicals. </span><span style=\"\">Once he opened the door and approached the desk, the receptionist bowed politely and greeted him.</span></p><br/><p><span style=\"\">\"Hello? What can I help you with today?”</span></p><br/><p><span style=\"\">“Ah! I-Is it 2 o’clock right now?”</span></p><br/><p><span style=\"\">“Yes, that’s right.”</span></p><br/><p><span style=\"\">“I-I’m glad. Today I have an interview with an executive... However, I mistook the time so I left late and had to hurry...”</span></p><br/><p><span style=\"\">\"I-Is that so? You went through a lot of trouble.”</span></p><br/><p><span style=\"\">Tae-hyuk purposely made his hair disheveled and clothes messy. </span><span style=\"\">He perfectly looked like a person who was in a hurry because they were running late.</span></p><br/><p><span style=\"\">The receptionist said with a soft smile,</span></p><br/><p><span style=\"\">\"I'm sorry, but could you please show me your pass?”</span></p><br/><p><span style=\"\">Tae-hyuk raised the pass hanging around his neck. </span><span style=\"\">On it was the name of a person who frequently wrote articles on Taesung Chemicals. </span><span style=\"\">He was able to register her appearance on the Demon Revealing Mirror. </span><span style=\"\">It was literally a bounteous tree.</span></p><br/><p><span style=\"\">\"It is verified. Have you come here before? You have an ID registered.”</span></p><br/><p><span style=\"\">\"I-It looks like I did...”</span></p><br/><p><span style=\"\">\"Who did you come to see? Did you make an appointment in advance?”</span></p><br/><p><span style=\"\">Tae-hyuk made the most pathetic expression he could and said,</span></p><br/><p><span style=\"\">“T-That...S-Sunbae...”</span></p><br/><p><span style=\"\">\"Don't panic. Can you tell me who it was?”</span></p><br/><p><span style=\"\">The receptionist looked at the new reporter with sympathy. </span><span style=\"\">How was she supposed to interview someone like this? </span><span style=\"\">She was reminded of her new employee days.</span></p><br/><p><span style=\"\">Yes...!</span></p><br/><p><span style=\"\">Although they weren’t in the same field, she decided to be kind to the rookie.</span></p><br/><p><span style=\"\">\"A-An interview with C-Chairman Song Won-jin...”</span></p><br/><p><span style=\"\">“With the boss?! T-that is impossible.”</span></p><br/><p><span style=\"\">The receptionist’s eyes widened. </span><span style=\"\">That interview was too big to be done by a new reporter. </span><span style=\"\">Even she had never seen the boss before.</span></p><br/><p><span style=\"\">“Yes... That is right...”</span></p><br/><p><span style=\"\">\"T-Then I’ll call his secretary and check it.”</span></p><br/><p><span style=\"\">“T-Thank you.”</span></p><br/><p><span style=\"\">The receptionist was troubled for a moment.</span></p><br/><p><span style=\"\">Taesung Chemicals’ chairman, Song Won-jin, was lying low since being involved in a scandal. </span><span style=\"\">The only ones who dealt with him were a few direct subordinates. </span><span style=\"\">Naturally, most interview requests were rejected, yet a woman who was a new reporter was looking for the chairman.</span></p><br/><p><span style=\"\">The receptionist would’ve sent her away directly, but that seemed too harsh. </span><span style=\"\">It would be turned down, but wouldn’t it be nice to show that an attempt was made? </span><span style=\"\">The reception pressed the intercom to the secretary then spoke in a small voice.</span></p><br/><p><span style=\"\">\"Chief Soo-hee. Perhaps...an interview...”</span></p><br/><p><span style=\"\">Then a loud sound was heard over the receiver.</span></p><br/><p><i><span style=\"\">-What?</span></i><i><span style=\"\">I told you not to contact me regarding anything like that!</span></i><i><span style=\"\">And a new journalist?</span></i><i><span style=\"\">Send them back to the station</span></i><span style=\"\">!</span></p><br/><p><span style=\"\">“Yes... I-I'm sorry.\"</span></p><br/><p><span style=\"\">-</span><i><span style=\"\">I’m hanging up.</span></i><i><span style=\"\">In addition, I will contact HR about this so reflect on your actions.</span></i></p><br/><p><span style=\"\">“......”</span></p><br/><p><span style=\"\">This was the most that the receptionist could do.</span></p><br/><p><span style=\"\">\"I'm sorry. The chairman isn’t seeing anyone right now.”</span></p><br/><p><span style=\"\">\"D-Did you get into trouble because of me?”</span></p><br/><p><span style=\"\">“Did you hear? Ahaha! It is okay. It is originally like this.”</span></p><br/><p><span style=\"\">Tae-hyuk’s eyes flashed as he gazed at the receptionist. </span><span style=\"\">He had deliberately picked someone who was kind and gentle. </span><span style=\"\">She acted as he expected. </span><span style=\"\">Tae-hyuk left the place after completing his conversation with the friendly receptionist.</span></p><br/><p><span style=\"\">‘This is the best way to gain information.’</span></p><br/><p><span style=\"\">He pretended to be a new journalist so people were vigilant against him. </span><span style=\"\">He never expected to meet Chairman Song Won-jin in the first place. </span><span style=\"\">This was good enough.</span></p><br/><p><span style=\"\">‘I never thought it would be easy to see Chairman Song Won-jin.’</span></p><br/><p><span style=\"\">Tae-hyuk immediately triggered the Spying skill after he started talking to the receptionist. </span><span style=\"\">After upgrading to a King, he was able to get much more detailed information from Spying.</span></p><br/><p><span style=\"\">'For example, where the receiver is connected to.’</span></p><br/><p><span style=\"\">He could trace calls without using any equipment. </span><span style=\"\">When he was a Noble, skills could be raised by consuming affinity points or satisfying certain conditions. </span><span style=\"\">However, when he upgraded to a King, the level of all of his crime skills had risen.</span></p><br/><p><span style=\"\">In addition, Tae-hyuk’s psychological state became more like a psychopathic criminal. </span><span style=\"\">But a little thing like that didn’t matter right now.</span></p><br/><p><span style=\"\">'The place where the voice is coming from is the 7th floor of this building. I now know the whereabouts of Chairman Song Won-jin.’</span></p><br/><p><span style=\"\">He took the elevator while pretending to go to the bathroom. </span><span style=\"\">However, he pushed the button to the 6th floor.</span></p><br/><p><span style=\"\">\"That floor seems to be VIPs only.”</span></p><br/><p><span style=\"\">He used ‘Spying’ and ‘Forgery’. </span><span style=\"\">A blueprint of the whole building appeared before him. </span><span style=\"\">There was a red dot indicating the room where the secretary was. </span><span style=\"\">It felt like he was looking at the world map of a FPS game.</span></p><br/><p><span style=\"\">There was no more need to draw it on paper. </span><span style=\"\">But as he looked at the map, letters appeared.</span></p><br/><p><span style=\"\">[Threaten the guards to find out Song Won-jin’s whereabouts!]</span></p><br/><p><span style=\"\">Tae-hyuk smiled.</span></p><br/><p><span style=\"\">“It is the same as a game. Is this a new ability that was obtained after becoming a King?”</span></p><br/><p><span style=\"\">Even now, the Demon Revealing Mirror. was in one of Tae-hyuk’s pockets. </span><span style=\"\">In the first place, it was something that he couldn’t throw away. </span><span style=\"\">But now it was giving a command.</span></p><br/><p><span style=\"\">\"Well, isn’t this feature convenient?”</span></p><br/><p><span style=\"\">The map displayed the people wandering around.</span></p><br/><p><span style=\"\">He seemed like he could reach the security office without being noticed by anyone. </span><span style=\"\">Tae-hyuk confidently walked down the corridor. </span><span style=\"\">There was no need to act covertly and arouse suspicions.</span></p><br/><p><span style=\"\">“Huhuhu, I’ve arrived.”</span></p><br/><p><span style=\"\">He met a few people on the way but he walked naturally past them.</span></p><br/><p><span style=\"\">Tae-hyuk looked at his body. </span><span style=\"\">He still looked like the reporter.</span></p><br/><p><span style=\"\">\"This is good, but it is better to change from here onwards.”</span></p><br/><p><span style=\"\">First of all, he turned off Counterfeit and his clothes returned to normal. </span><span style=\"\">He moved his finger and easily turned into the Bomber, Kim Tae-sung. </span><span style=\"\">Inside the jacket was his favorite mask. </span><span style=\"\">It was the now familiar Phantom mask.</span></p><br/><p><span style=\"\">“Well. This isn’t the time for Phantom to go out so I shouldn’t use it.”</span></p><br/><p><span style=\"\">Shattering a large corporation. </span><span style=\"\">In this case, he needed to be someone other than Phantom.</span></p><br/><p><span style=\"\">Tae-hyuk used Counterfeit on the opera mask and turned it into a skull mask that covered his entire face.</span></p><br/><p><span style=\"\">“From now on, I am the Bomber.”</span></p><br/>\n</div>"}