{"title": "Chapter 159 - God of Crime #1", "id": 159, "volume": 2, "url": "http://boxnovel.org/god-of-crime-chapter-159-god-of-crime-1", "volume_title": "Volume 2", "body": "<h1>Chapter 159 - God of Crime #1</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span style=\"\"> Chapter 159 - God of Crime #1</span></p><br/><p><span style=\"\">Three days had passed by since Seo Ha-ran first went missing.</span></p><br/><p><span style=\"\">Cho Kang-suk, who wanted to find her more than anyone else, was nervously pacing around the room. </span><span style=\"\">His motto as a detective was that he should jump in directly to solve the case. </span><span style=\"\">However, he was forced to be a bystander in this case. </span><span style=\"\">The investigation was slow and frustrating.</span></p><br/><p><span style=\"\">\"Damn! It is too much to exclude me from the investigation!”</span></p><br/><p><span style=\"\">However, he didn’t have the authority to overturn the decision. </span><span style=\"\">He was glad that a large-scale investigation was being held in regards to the disappearance.</span></p><br/><p><span style=\"\">“Huu... Although many people go missing in this country...”</span></p><br/><p><span style=\"\">He never thought his family would fall victim to it. </span><span style=\"\">Fortunately, Kang-suk had a network of people whom he could trust with the investigation.</span></p><br/><p><span style=\"\">Kang-suk took out his smartphone and called someone. </span><span style=\"\">Then a voice was heard.</span></p><br/><p><span style=\"\">-</span><i><span style=\"\">Ah, Sunbae.</span></i></p><br/><p><span style=\"\">“...You worked hard. Did you find anything?”</span></p><br/><p><span style=\"\">-</span><i><span style=\"\">I’m sorry.</span></i><i><span style=\"\">We searched around the place where she was last seen but...</span></i></p><br/><p><span style=\"\">\"Wolsang University?”</span></p><br/><p><span style=\"\">It was the place where Ha-ran was last seen. </span><span style=\"\">She left the house saying she had to go to the university. </span><span style=\"\">Then she didn’t come back.</span></p><br/><p><span style=\"\">-</span><i><span style=\"\">That...</span></i><i><span style=\"\">We searched so thoroughly that not even an ant could hide.</span></i><i><span style=\"\">But there was nothing.</span></i></p><br/><p><span style=\"\">\"I see...”</span></p><br/><p><span style=\"\">Joo Hyun-how was a seemingly unreliable man. </span><span style=\"\">However, he was the most proficient investigator in this country. </span><span style=\"\">He was one of the few colleagues who Kang-suk could trust. </span><span style=\"\">But the missing person was his bride just a few days before their marriage. </span><span style=\"\">It was torture not being able to do anything.</span></p><br/><p><span style=\"\">Kang-suk sat down and sighed. </span><span style=\"\">Hyun-ho told Kang-suk in a concerned tone.</span></p><br/><p><span style=\"\">-</span><i><span style=\"\">I have mobilized all of my connections to look for her.</span></i><i><span style=\"\">So don’t worry too much...</span></i></p><br/><p><span style=\"\">\"Just focus on Phantom?”</span></p><br/><p><span style=\"\">-</span><i><span style=\"\">...Well, that’s right.</span></i></p><br/><p><span style=\"\">Phantom no longer contacted them. </span><span style=\"\">However, that made the higher-ups more jumpy. </span><span style=\"\">In the end, they didn’t want Kang-suk away for too long in case Phantom contacted him. </span><span style=\"\">For a while, he could only support the other teams.</span></p><br/><p><span style=\"\">“At any rate, let me know if there are any additional clues.”</span></p><br/><p><i><span style=\"\">-Understood.</span></i><i><span style=\"\">Don’t worry.</span></i><i><span style=\"\">The country’s top agents are looking for her so we will find her soon.</span></i></p><br/><p><span style=\"\">“I hope so. Really.\"</span></p><br/><p><span style=\"\">Kang-suk hung up and leaned back on his seat. </span><span style=\"\">He wanted to ask Phantom for help.</span></p><br/><p><span style=\"\">\"Phantom... wouldn’t you be able to easily solve this case?”</span></p><br/><p><span style=\"\">The number of cases solved by Phantom appeared in Kang-suk’s mind.</span></p><br/><p><span style=\"\">He hated to admit it, but everything was great. </span><span style=\"\">The mysterious masked man, Phantom. </span><span style=\"\">What if he was in a situation like this? </span><span style=\"\">He would probably solve everything with a strange idea.</span></p><br/><p><span style=\"\">Kang-suk fell deep into thought.</span></p><br/><p><span style=\"\">\"Yes, if it was Phantom...”</span></p><br/><p><span style=\"\">He had an order from his superiors to stay where he was.</span></p><br/><p><span style=\"\">“…I have to do this.”</span></p><br/><p><span style=\"\">Kang-suk stood up, opened the door and left. </span><span style=\"\">A detective writing a report outside asked with surprise,</span></p><br/><p><span style=\"\">“Eh! Detective Cho! Aren’t you supposed to wait here?”</span></p><br/><p><span style=\"\">\"Hey! I have to eat to survive! I’m going to talk a walk and eat a bowl of short rib soup. If I stay stuck in the corner any longer, then spider webs will cover my nose.”</span></p><br/><p><span style=\"\">\"Yes, I understand. I will tell Inspector-nim that you went to eat.”</span></p><br/><p><span style=\"\">Kang-suk left the police station and put on sunglasses. </span><span style=\"\">Of course, it wasn’t a lie. </span><span style=\"\">He was going out to eat something. </span><span style=\"\">It was just a coincidence that the direction he was heading in was the place where Seo Ha-ran was last seen.</span></p><br/><p><span style=\"\">Yes, a coincidence.</span></p><br/><p><span style=\"\">\"Well, if something goes wrong then I can write an apology.”</span></p><br/><p><span style=\"\">Kang-suk smiled playfully and started his car. </span><span style=\"\">Before he knew it, he had a similar atmosphere to Phantom.</span></p><br/><p><span style=\"\">@</span></p><br/><p><span style=\"\">“......”</span></p><br/><p><span style=\"\">Tae-hyuk glared at the Demon Revealing Mirror.</span></p><br/><p><span style=\"\">He had started investigating as soon as he realized that he was possessed by it. </span><span style=\"\">First of all, his stats, such as intelligence and stamina, remained the same. </span><span style=\"\">In other words, his physical abilities had actually been increased.</span></p><br/><p><span style=\"\">It was through his own efforts, rather than the Demon Revealing Mirror. </span><span style=\"\">Tae-hyuk confirmed the notification and rose from his spot.</span></p><br/><p><span style=\"\">\"I wished I didn’t have to use the crime skills... Hu, dammit. Right now, I should be refraining from trying to use it as much as possible...”</span></p><br/><p><span style=\"\">Kang-suk’s current location was on the screen of his smartphone. </span><span style=\"\">The fact that he was moving meant the police hadn’t found any clues to Seo Ha-ran’s disappearance.</span></p><br/><p><span style=\"\">\"I was hoping that the police would find her.”</span></p><br/><p><span style=\"\">Tae-hyuk pulled out the opera mask and put it on his face. </span><span style=\"\">He could figure out Kang-suk’s movements without the crime skills.</span></p><br/><p><span style=\"\">First of all, he activated Spying to check on his sister’s condition. </span><span style=\"\">It reduced a lot of his stamina, so he was exhausted. </span><span style=\"\">However, she was alive.</span></p><br/><p><span style=\"\">\"Ugh...”</span></p><br/><p><span style=\"\">A moan emerged from his Tae-hyuk’s mouth. </span><span style=\"\">He had only used the crime skill for one second, yet his desperate need to murder someone increased. </span><span style=\"\">If this continued, then he would become the psychopathic murderer once again.</span></p><br/><p><i><span style=\"\">Jjak!</span></i></p><br/><p><span style=\"\">After slapping his cheeks, he felt his sanity returning.</span></p><br/><p><span style=\"\">“...Yes, I should be able to endure this much.”</span></p><br/><p><span style=\"\">His theory was that the skills he learned in the early days, such as Spying and Robbery, were slow to pollute his mind.</span></p><br/><p><span style=\"\">\"The place where my sister was last seen...”</span></p><br/><p><span style=\"\">He turned on the map application and headed to the location he loaded in advance. </span><span style=\"\">There was a bus stop not far from the Wolsang Institute. </span><span style=\"\">It was late in the afternoon so no one was passing by.</span></p><br/><p><span style=\"\">Tae-hyuk sighed slowly.</span></p><br/><p><span style=\"\">He wanted to stop using his crime skills but he needed to find his sister as quickly as possible. </span><span style=\"\">He took out a small notebook and pen, then he triggered a crime skill.</span></p><br/><p><span style=\"\">“Forgery!”</span></p><br/><p><span style=\"\">[The Forgery skill has found an intense image.]</span></p><br/><p><span style=\"\">\"......!\"</span></p><br/><p><span style=\"\">Blurry images appeared in front of Tae-hyuk like a broken projector.</span></p><br/><p><span style=\"\">‘There are definitely traces of a crime here... There was something here.’</span></p><br/><p><span style=\"\">He gulped and looked at the video of the kidnapping. </span><span style=\"\">It was noon judging by the sun floating directly overhead. </span><span style=\"\">He couldn’t see the exact date because he was just watching a video. </span><span style=\"\">The bus arrived at the stop, a woman stepping down from the vehicle.</span></p><br/><p><span style=\"\">It was Ha-ran wearing a white dress. </span><span style=\"\">A man sitting at the bus stop got up. </span><span style=\"\">Did they make a promise in advance to meet?</span></p><br/><p><span style=\"\">Tae-hyuk moved his gaze to try and see the man’s face. </span><span style=\"\">However, the visibility was fixed, so Tae-hyuk could only see his back.</span></p><br/><p><span style=\"\">‘I can’t see his face because his cap is covering his face too deeply!’</span></p><br/><p><span style=\"\">Ha-ran bowed politely to the man. </span><span style=\"\">She seemed to know him quite well.</span></p><br/><p><span style=\"\">Shortly after this, Seo Ha-ran went missing. </span><span style=\"\">It was very likely that this man was the culprit.</span></p><br/><p><span style=\"\">'Now, just turn a little and show me your face. Yes? Just a little... Ah, why is it suddenly on the other side?’</span></p><br/><p><span style=\"\">He could only see the intense image engraved on this spot.  </span><span style=\"\">He couldn’t affect it. </span><span style=\"\">Even though he knew this, he couldn’t stop watching.</span></p><br/><p><span style=\"\">It was at that moment. </span><span style=\"\">The atmosphere of Seo Ha-ran and the man changed. </span><span style=\"\">The man suddenly took off his hat and Seo Ha-ran looked astonished. </span><span style=\"\">Then the man rushed towards Seo Ha-ran.</span></p><br/><p><span style=\"\">“T-T-That bastard!”</span></p><br/><p><span style=\"\">Tae-hyuk's face filled with anger. </span><span style=\"\">The man pulled something out from his pocket and slammed it over Seo Ha-ran’s mouth. </span><span style=\"\">Seo Ha-ran’s body twisted desperately as she tried to escape.</span></p><br/><p><span style=\"\">This was just a recorded video. </span><span style=\"\">He calmed his trembling hands and focused on seeing the opponent’s face.</span></p><br/><p><span style=\"\">\"He is the criminal. Yes, who are you? Look this way.”</span></p><br/><p><span style=\"\">Tae-hyuk bit his lip and waited for the man to move. </span><span style=\"\">The man put Ha-ran in a suitcase and turned around with light footsteps.</span></p><br/><p><span style=\"\">\"......!\"</span></p><br/><p><span style=\"\">Tae-hyuk couldn’t say anything.</span></p><br/><p><span style=\"\">The face was deformed, like a monster. </span><span style=\"\">It was painted over with white paint. </span><span style=\"\">Only the lips were a bright red that looked like blood..</span></p><br/><p><span style=\"\">Tae-hyuk knew who that person was.</span></p><br/><p><span style=\"\">\"Clown... Why is he coming out already...?”</span></p><br/><p><span style=\"\">The most dangerous criminal on the blacklist. </span><span style=\"\">The kidnapping of Ha-ran was due to the mad scientist, the Clown. </span><span style=\"\">According to Tae-hyuk’s memories of the future, the Clown didn’t appear for three more years.</span></p><br/><p><span style=\"\">Then why? </span><span style=\"\">Why?</span></p><br/><p><span style=\"\">Tae-hyuk’s body trembled.</span></p><br/><p><span style=\"\">It was simple. </span><span style=\"\">It was because he changed history, no, destiny, with his own hands.</span></p><br/><p><span style=\"\">@</span></p><br/><p><span style=\"\">“Heok...heook...heok!”</span></p><br/><p><span style=\"\">Go Ah-tae felt like his face was being baked on a hot plate. </span><span style=\"\">He was going to die if this continued! </span><span style=\"\">He forced himself to live.</span></p><br/><p><i><span style=\"\">Chiiiik!</span></i></p><br/><p><span style=\"\">His arms felt like they were frying.</span></p><br/><p><span style=\"\">\"Kkuck... Keuok...”</span></p><br/><p><span style=\"\">Every time he breathed, it felt like he was on fire. </span><span style=\"\">Go Ah-tae slowly looked around.</span></p><br/><p><span style=\"\">He was burning all over. </span><span style=\"\">He wondered why he was in such a place.</span></p><br/><p><span style=\"\">The Wolsang Institute, which he directed, was in a chronic deficit. </span><span style=\"\">He had no choice but to cooperate with another institute to complete the ‘Core Drive’ that he named himself. </span><span style=\"\">It was the Taesung Institute of Physics and Chemistry that had the greatest wealth in the country.</span></p><br/><p><span style=\"\">Director Jang Ik-sam welcomed Go Ah-tae and said he would help with his research. </span><span style=\"\">Both of them were rivals from the same university. </span><span style=\"\">One specialized in chemistry while the other specialized in physics. </span><span style=\"\">Their area of specialty was different, but their enthusiasm for research was unmatched by anyone else.</span></p><br/><p><span style=\"\">Thus, the two institutes joined together to proceed with the research project. </span><span style=\"\">Today, he came to support the project at the Taesung institute, but the atmosphere was strange. </span><span style=\"\">Jang Ik-sam took Go Ah-tae down to the basement where there was a strange scent. </span><span style=\"\">Once he recovered his spirit, he was here.</span></p><br/><p><span style=\"\">\"There is a computer...”</span></p><br/><p><span style=\"\">Go Ah-tae took the computer hard disk from the half burned Jang Ik-sam and left the institute. </span><span style=\"\">He was able to survive because he had fainted in a secret space in a corner of the room.</span></p><br/><p><span style=\"\">“K-Kiik! W-What? E-Everybody is dead. Kikikik...”</span></p><br/><p><span style=\"\">Why did laughter keep on bursting out? </span><span style=\"\">Was something broken due to the impact of the accident? </span><span style=\"\">Or maybe it was because Jang Ik-sam accidentally had him swallow the Psychotropic Incense.</span></p><br/><p><span style=\"\">Go Ah-tae was clearly broken. </span><span style=\"\">He walked back to his research laboratory.</span></p><br/><p><span style=\"\">“Hihihit! First of all, I need to check what is on the hard disk!”</span></p><br/><p><span style=\"\">There were a few locks but he could easily solve it. </span><span style=\"\">The hard disk contained information about the Psychotropic Incense and Mister Park’s plot to use it to turn humans into puppets. </span><span style=\"\">He couldn’t resist laughing.</span></p><br/><p><span style=\"\">“Kikikiki! These people were doing something very interesting! It would’ve been more fun if they told me sooner!”</span></p><br/><p><span style=\"\">Go Ah-tae realized that his body’s status was unusual and that he was close to dying. </span><span style=\"\">He entered the cell regenerator that was being studied in the next building. He didn’t know the side effects, but he needed to survive first.</span></p><br/><p><span style=\"\">“Hihit! Yihihihihi!”</span></p><br/><p><span style=\"\">If this failed, then he would die. </span><span style=\"\">However, the laughter didn’t stop.</span></p><br/><p><span style=\"\">\"Hehehehehehet!”</span></p><br/><p><span style=\"\">He entered the cell regenerator that looked like a big aquarium tank. </span><span style=\"\">Then he pressed the button.</span></p><br/><p><span style=\"\">One day passed by. </span><span style=\"\">His burnt and charred skin regenerated to some extent.</span></p><br/><p><span style=\"\">“Kikikiki! I fortunately lived.”</span></p><br/><p><span style=\"\">However, he couldn’t do anything about the burns that distorted his face. </span><span style=\"\">It was too ugly to leave like this. </span><span style=\"\">He recalled that he still had the tools used to dress as a clown for a Halloween party last year in the warehouse. </span><span style=\"\">He used makeup to cover his face to a certain extent.</span></p><br/><p><span style=\"\">\"Maybe somebody blew up the Taesung institute to get rid of the Psychotropic Incense, but I’m sorry.”</span></p><br/><p><span style=\"\">Go Ah-tae laughed with his distorted face.</span></p><br/><p><span style=\"\">\"I know how to make it. Yihihihihihit!”</span></p><br/><p><span style=\"\">When he went to the institute, he saw his people working hard.</span></p><br/><p><span style=\"\">\"Kyaaaaak!\"</span></p><br/><p><span style=\"\">“D-Director-nim?”</span></p><br/><p><span style=\"\">“This appearance...”</span></p><br/><p><span style=\"\">Go Ah-tae sprinkled a few bottles of the Psychotropic Incense that he took from the Taesung Institute in here.</span></p><br/><p><i><span style=\"\">Chiiiik!</span></i></p><br/><p><span style=\"\">This would make the researchers his faithful slaves who would cut their own necks if he asked.</span></p><br/><p><span style=\"\">\"D-Director G-Go Ah-tae... W-What are you...?”</span></p><br/><p><span style=\"\">What was with this person? The Psychotropic Incense didn’t work on him? </span><span style=\"\">Maybe he had an unusual constitution. </span><span style=\"\">There was one researcher who didn’t fall slave to the Psychotropic Incense.</span></p><br/><p><span style=\"\">\"I have to dispose of defective products. Yihihihit!”</span></p><br/><p><span style=\"\">Go Ah-tae walked over to the researcher with an axe he found from somewhere. </span><span style=\"\">Then he smiled brightly.</span></p><br/><p><span style=\"\">“Go Ah-tae. I am the Clown.”</span></p><br/><p><span style=\"\">\"C-Clown...?”</span></p><br/><p><span style=\"\">He slammed the axe down on the other person’s head.</span></p><br/><p><i><span style=\"\">Hwaaaaack!</span></i></p><br/><p><span style=\"\">Blood splattered the white coat that he was wearing.</span></p><br/><p><span style=\"\">“Yihihihit!”</span></p><br/><p><span style=\"\">Go Ah-tae... </span><span style=\"\">No, the Clown laughed.</span></p><br/><p><span style=\"\">Then he muttered in a low voice,</span></p><br/><p><span style=\"\">\"So what should I do now?”</span></p><br/>\n</div>"}