{"title": "Chapter 150 - Time to Clean Up #1", "id": 150, "volume": 2, "url": "http://boxnovel.org/god-of-crime-chapter-150-time-to-clean-up-1", "volume_title": "Volume 2", "body": "<h1>Chapter 150 - Time to Clean Up #1</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span style=\"\">Chapter 150 - Time to Clean Up #1</span></p><br/><p><span style=\"\">Tae-hyuk suddenly recalled his previous life, where he was wrongfully imprisoned for murder. </span><span style=\"\">He spent 10 years in prison until he lost his life. </span><span style=\"\">During that time, he met countless criminals.</span></p><br/><p><span style=\"\">Strangely, many of them said something like this.</span></p><br/><p><span style=\"\">-</span><i><span style=\"\">Why did I do that?</span></i><i><span style=\"\">I don’t know!</span></i><i><span style=\"\">My body spontaneously moved...</span></i><i><span style=\"\">I mean, do you understand?</span></i><i><span style=\"\">The bad thing is the crime, not me.</span></i><i><span style=\"\">I’m a victim as well.</span></i></p><br/><p><span style=\"\">Tae-hyuk had laughed as he listened to that. </span><span style=\"\">It sounded like the crime was in control instead.</span></p><br/><p><span style=\"\">However, what they were saying might have been real. </span><span style=\"\">Since a while ago, he started to think that.</span></p><br/><p><span style=\"\">@</span></p><br/><p><span style=\"\">\"...Tae-hyuk! Seo Tae-hyuk!”</span></p><br/><p><span style=\"\">\"Uh, um? Ha-ran noona?”</span></p><br/><p><span style=\"\">When he opened his eyes, Seo Ha-ran was dressed in a smart suit with her fist raised. </span><span style=\"\">If he didn’t get up right now then he would be hit.</span></p><br/><p><span style=\"\">\"Your teacher is waiting. We should go in.”</span></p><br/><p><span style=\"\">\"Eh? It is already time?”</span></p><br/><p><span style=\"\">\"This child. You have been dozing off since earlier.”</span></p><br/><p><span style=\"\">Tae-hyuk scratched his head.</span></p><br/><p><span style=\"\">He had been checking the Demon Revealing Mirror as he was waiting for his meeting with the teacher. </span><span style=\"\">His crime skills had renewed after he upgraded his status to ‘King’.</span></p><br/><p><span style=\"\">The first thing that caught his eyes was Disguise. </span><span style=\"\">Once he triggered it, he could change his face and voice to someone else’s. </span><span style=\"\">However, his body stayed the same.</span></p><br/><p><span style=\"\">‘Disguise’ had evolved into ‘Transformation.’</span></p><br/><p><span style=\"\">'Now I can change the body as well.’</span></p><br/><p><span style=\"\">To test it out, he took a shower and transformed into Moonlight Flower, almost giving himself a nosebleed. </span><span style=\"\">His face turned hot as he recalled that memory.</span></p><br/><p><span style=\"\">‘...A really terrific skill!’</span></p><br/><p><span style=\"\">In addition, Illegal Surgery changed to Body Modification. </span><span style=\"\">It seemed to be strengthened towards the direction that he used the skill. </span><span style=\"\">Now he could easily swap arms and legs, or plant bombs inside the body.</span></p><br/><p><span style=\"\">In addition, most of the skills gained additional attributes. </span><span style=\"\">However, Violence maintained its original shape.</span></p><br/><p><span style=\"\">'Of course, thanks to Sixth Sense and other attributes, I am able to use it a lot more than when I first got it.’</span></p><br/><p><span style=\"\">After becoming the winner of the mafia game, Tae-hyuk was promoted from a Noble to a King. </span><span style=\"\">Now he could do things that were impossible when he was just a Noble. </span><span style=\"\">He wanted to test his newly acquired abilities right now. </span><span style=\"\">However, there was no one in the area.</span></p><br/><p><span style=\"\">‘Let’s see... Are there any survivors from the Triads? Ah, maybe I should rob a bank?’</span></p><br/><p><span style=\"\">If he used ‘Transformation’, then he could do it without getting any blood on his hands. </span><span style=\"\">The mafia, who had been the biggest obstacle to his activities in South Korea, had now been dealt with. </span><span style=\"\">Now there was nothing left to block his way...</span></p><br/><p><span style=\"\">“What are you doing? Tae-hyuk, let’s go.”</span></p><br/><p><span style=\"\">“Umm.”</span></p><br/><p><span style=\"\">Ha-ran grabbed Tae-hyuk’s hand and led him to the consultation room. </span><span style=\"\">The parent and student before them were just leaving the room. </span><span style=\"\">The mother was dressed in various luxurious products, looking like a decorated peacock. </span><span style=\"\">The peacock rolled her eyes as she saw Ha-ran and muttered,</span></p><br/><p><span style=\"\">\"Why did a child come to a parent meeting? Don’t they have parents?”</span></p><br/><p><span style=\"\">She was talking to herself but her words easily reached Tae-hyuk’s ears. </span><span style=\"\">Ha-ran was smiling with a casual expression, but her eyes shook for a moment.</span></p><br/><p><span style=\"\">The peacock’s eyes widened as she saw Tae-hyuk following after Ha-ran.</span></p><br/><p><span style=\"\">“Omo! He completely looks like a gangster! Why is his expression so terrible? Chan-shik, you should absolutely never become friends with him.”</span></p><br/><p><span style=\"\">“M-Mother...”</span></p><br/><p><span style=\"\">It sounded like she intended to speak to her son but once again, her voice was too loud. </span><span style=\"\">Tae-hyuk’s eyes narrowed as he watched Ha-ran’s expression darken. </span><span style=\"\">What was she feeling now? </span><span style=\"\">Anger rose as he thought about it.</span></p><br/><p><span style=\"\">‘Well. Should I just kill her?</span></p><br/><p><span style=\"\">He had a gun... </span><span style=\"\">He touched the grip of the hidden pistol. </span><span style=\"\">Bullets were loaded so pulling the trigger would fire it. </span><span style=\"\">The opponents were just an ordinary high school student and his mother. </span><span style=\"\">Tae-hyuk didn’t need to use Bullet Time to put a hole in their heads. </span><span style=\"\">If he raised the gun, then the peacock would tremble with fear...</span></p><br/><p><span style=\"\">'No. I didn’t place a silencer on the pistol and too many people are watching. In that case, I can be a little bit playful.’</span></p><br/><p><span style=\"\">The peacock couldn’t imagine how close she came to dying. </span><span style=\"\">He glared at the peacock with a cold expression.</span></p><br/><p><span style=\"\">“Mother! He is Seo Tae-hyuk.”</span></p><br/><p><span style=\"\">“Seo Tae-hyuk? A fighter?”</span></p><br/><p><span style=\"\">\"It’s not like that... he was ranked 300th on the mock exams.”</span></p><br/><p><span style=\"\">The peacock laughed.</span></p><br/><p><span style=\"\">\"300th? That is almost at the bottom of the school. Indeed, as I said...”</span></p><br/><p><span style=\"\">“300th in the nation!”</span></p><br/><p><span style=\"\">“......”</span></p><br/><p><span style=\"\">It was a number that was only possible if a person could close to a perfect score in the mock exams. </span><span style=\"\">There were literally hundreds of thousands of examinees. </span><span style=\"\">The level was enough to get a full scholarship to S University.</span></p><br/><p><span style=\"\">Hearing those words, the expression on the peacock’s face changed. </span><span style=\"\">She covered her mouth with her hand and walked towards Tae-hyuk.</span></p><br/><p><span style=\"\">“Omo, you are Tae-hyuk. I’ve heard a lot about you. Would you like to have dinner together after your meeting? I have a reservation at a ribs restaurant. I get the sense that we will become friendly in the future...”</span></p><br/><p><span style=\"\">Tae-hyuk smiled and said,</span></p><br/><p><span style=\"\">“Ajumma. I’m sorry but aren’t your clothes going to burst?”</span></p><br/><p><span style=\"\">“W-What?”</span></p><br/><p><span style=\"\">\"All the suit buttons...”</span></p><br/><p><span style=\"\">“Aaack!”</span></p><br/><p><span style=\"\">The buttons on the clothes that the peacock was wearing were all gone. </span><span style=\"\">It was a situation where it wouldn’t be weird for her clothes to fall off at any second. </span><span style=\"\">The peacock grabbed her son’s hand and ran away from the consultation room.</span></p><br/><p><span style=\"\">‘You should be grateful that I only did this much.’</span></p><br/><p><span style=\"\">Tae-hyuk quickly put the buttons into his pocket.</span></p><br/><p><span style=\"\">Jung Nam-ho didn’t seem very upset at the aftermath of the peacock storming out. </span><span style=\"\">He had been teaching high school students for over 10 years already. </span><span style=\"\">He was familiar with the nerves parents had when their children were third years.</span></p><br/><p><span style=\"\">“Hey! Tae-hyuk! Come in and sit down!”</span></p><br/><p><span style=\"\">Tae-hyuk and Ha-ran sat down and the consultation began. </span><span style=\"\">Ha-ran bowed politely and greeted the teacher.</span></p><br/><p><span style=\"\">\"Hello. I am Tae-hyuk’s sister.”</span></p><br/><p><span style=\"\">“C-Cough! Ah, his sister? Seo Tae-hyuk... Seo Tae-hyuk is my most beloved disciple. Have you seen the report card with his results from the mock exams?”</span></p><br/><p><span style=\"\">“...Yes.”</span></p><br/><p><span style=\"\">\"Then let’s see...”</span></p><br/><p><span style=\"\">Jung Nam-ho pulled out a table universities’ cut-off lines and told Tae-hyuk which ones he could go to. </span><span style=\"\">His list included all of the top universities.</span></p><br/><p><span style=\"\">\"All of these universities will offer a full scholarship if Tae-hyuk chooses to go there. If he tells me which university he wants to go to, then I will give him my full support.”</span></p><br/><p><span style=\"\">Universities with a slightly lower cut-off line than S University were checked.</span></p><br/><p><span style=\"\">Most career counseling was based on the student’s grades. </span><span style=\"\">Therefore, it was often a one-sided conversation. </span><span style=\"\">However, Jung Nam-ho didn’t forcibly talk and instead listened to Ha-ran calmly.</span></p><br/><p><span style=\"\">\"First of all, I would like to send Tae-hyuk to the university he wants to go, regardless of scholarships.\"</span></p><br/><p><span style=\"\">“Ah, is that so?”</span></p><br/><p><span style=\"\">The two of them focused on Seo Tae-hyuk.</span></p><br/><p><span style=\"\">“Well. I don’t care if it is S University.”</span></p><br/><p><span style=\"\">\"S University...the medical school might be hard, but you will be able to easily enter the other courses.”</span></p><br/><p><span style=\"\">“R-Really? S-Sob...!”</span></p><br/><p><span style=\"\">Ha-ran’s eyes reddened and thick tears started to flow down her face.</span></p><br/><p><span style=\"\">“S-Sob, s... I-I’m sorry. I just didn’t know that Tae-hyuk would be doing so well... Our parents died in an accident and raising him alone...”</span></p><br/><p><span style=\"\">Of course, she had seen the report cards from school. </span><span style=\"\">However, hearing it directly from the mouth of a teacher was different. </span><span style=\"\">It felt like something from a dream.</span></p><br/><p><span style=\"\">\"Ah, the tears have broken out...”</span></p><br/><p><span style=\"\">Tae-hyuk grunted and quietly pulled out a handkerchief from his pocket.</span></p><br/><p><span style=\"\">@</span></p><br/><p><span style=\"\">“I’m sorry. Crying all of a sudden...”</span></p><br/><p><span style=\"\">“Well, it doesn’t matter.”</span></p><br/><p><span style=\"\">In the end, Tae-hyuk’s path was to study to enter S University. </span><span style=\"\">It was due to a promise to go to the same university as An Eun-young. </span><span style=\"\">He just meant to keep it.</span></p><br/><p><span style=\"\">‘In the future...’</span></p><br/><p><span style=\"\">It had been one year since he first received memories of the future. </span><span style=\"\">Could he get a scholarship to go to university? </span><span style=\"\">It was something he wouldn’t have imagined in his previous life.</span></p><br/><p><span style=\"\">\"Tae-hyuk, let’s go eat meat!”</span></p><br/><p><span style=\"\">Ha-ran suddenly smiled and tugged at Tae-hyuk’s arms.</span></p><br/><p><span style=\"\">\"I would rather go home and eat Noona’s cooking.”</span></p><br/><p><span style=\"\">\"It has been a long time since we went out together like this. Let’s eat something delicious! Besides, you can go to such a good university! Congratulations!”</span></p><br/><p><span style=\"\">“Aigoo... I haven’t been accepted yet. You are completely excited over a career consultation.”</span></p><br/><p><span style=\"\">“Hehe!”</span></p><br/><p><span style=\"\">Ha-ran laughed brightly in her clean suit. </span><span style=\"\">Her tired appearance from his previous life seemed to overlap with her current form.</span></p><br/><p><span style=\"\">Tae-hyuk didn’t want to see that again. </span><span style=\"\">He suddenly felt anxious and decided to ask her something,</span></p><br/><p><span style=\"\">\"By the way, what is Noona thinking of studying at university?”</span></p><br/><p><span style=\"\">Ha-ran spun around and spoke. </span><span style=\"\">She looked so refreshing and lively.</span></p><br/><p><span style=\"\">\"I’m thinking about it. I think I want to go to a university with an energy research institute.”</span></p><br/><p><span style=\"\">\"Energy research institute?”</span></p><br/><p><span style=\"\">\"Yes. A place to study eco-friendly energy... I happen to know the department manager there so I think I can enter with his recommendation.”</span></p><br/><p><span style=\"\">Ha-ran’s eyes shone as she talked about the research institute. </span><span style=\"\">Tae-hyuk decided to figure out what type of place it was at the next opportunity.</span></p><br/><p><span style=\"\">\"Do you remember when we lived in the basement room in the past? It was too cold in winter, so we would hug each other in order to sleep. If the research is a success, it can supply energy that is dozens of times cheaper than the current fuels we use. Then won’t everyone be able to stay warm in winter? And the children at the orphanage...”</span></p><br/><p><span style=\"\">He wondered how long she had been dreaming of this to be talking about it so excitedly. </span><span style=\"\">If there was such a new energy, then the person who discovered it would instantly receive the Nobel Prize.</span></p><br/><p><span style=\"\">However, Tae-hyuk didn’t want to break Ha-ran’s dream. </span><span style=\"\">Ha-ran had decided what she wanted to do, unless her previous life that was stained in despair. </span><span style=\"\">That was too much...</span></p><br/><p><span style=\"\">“I hope it turns out well.”</span></p><br/><p><span style=\"\">\"Is that so?”</span></p><br/><p><span style=\"\">@</span></p><br/><p><span style=\"\">After taking Ha-ran home, Tae-hyuk hid in a dark alley.</span></p><br/><p><span style=\"\">\"Now, let’s try this out.”</span></p><br/><p><span style=\"\">Once he exited, he was a completely different person. </span><span style=\"\">Tae-hyuk looked down at his body. </span><span style=\"\">The power of the ‘Transformation’ skill was enough to make his mouth drop open. </span><span style=\"\">Not just his face and voice, but his body was also perfectly transformed into another person. </span><span style=\"\">Now he could hide anywhere without the Phantom mask.</span></p><br/><p><span style=\"\">\"Well, the place where I’m going now isn’t easy.”</span></p><br/><p><span style=\"\">Tae-hyuk had allied with the Bomber for the mafia game. </span><span style=\"\">Now it was time to keep his promise.</span></p><br/><p><span style=\"\">\"In order to do that, I need to get rid of the remnants of the Yakuza still remaining in South Korea.”</span></p><br/><p><span style=\"\">Yamaguchi Takeshi had gone back to Japan, leaving Mister Park behind to repair his remaining forces. </span><span style=\"\">He had to wipe them out as well as destroy Taesung Group’s laboratories. </span><span style=\"\">Getting revenge on those who drove the Bomber’s family to ruin was Tae-hyuk’s promise.</span></p><br/><p><span style=\"\">\"There is no need to hurry. Still, it is something that needs to be done.”</span></p><br/><p><span style=\"\">Tae-hyuk laughed as he pressed the call button on his phone.</span></p><br/>\n</div>"}