{"title": "Chapter 155 - End of the Revenge #2", "id": 155, "volume": 2, "url": "http://boxnovel.org/god-of-crime-chapter-155-end-of-the-revenge-2", "volume_title": "Volume 2", "body": "<h1>Chapter 155 - End of the Revenge #2</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span style=\"\">Chapter 155 - End of the Revenge #2</span></p><br/><p><span style=\"\">Chairman Song Won-jin died. </span><span style=\"\">He had been killed while in hiding.</span></p><br/><p><span style=\"\">The Yakuza panicked. </span><span style=\"\">Only a few people in the Taesung Group knew where he was hiding. </span><span style=\"\">But how did the killer know where he was hiding? </span><span style=\"\">In addition, he always stuck with his carefully selected bodyguards.</span></p><br/><p><span style=\"\">Plus, a spy had been planted among Song Won-jin’s guards. </span><span style=\"\">If there was anything suspicious, then it would’ve been reported to the higher-ups immediately. </span><span style=\"\">If Song Won-jin ever attempted to leak anything confidential then the spy would make it seem like he committed suicide.</span></p><br/><p><span style=\"\">In the end, Song Won-jin was just a chess pawn for the Yakuza. </span><span style=\"\">However, Song Won-jin and his bodyguards were annihilated.</span></p><br/><p><span style=\"\">Who killed him? </span><span style=\"\">Eventually, an investigator was sent to find out what happened.</span></p><br/><p><span style=\"\">“O-Oh my god...”</span></p><br/><p><span style=\"\">The investigator doubted his eyes. </span><span style=\"\">Everything was turned to ashes like a bomb had blown up the room. </span><span style=\"\">And the black things scattered around were probably... </span><span style=\"\">The investigator gathered them and started analyzing what caused this.</span></p><br/><p><span style=\"\">However, he couldn’t figure out the exact cause of the explosion because it was so intense. </span><span style=\"\">If there was a firefight, then there would be things like bullets. </span><span style=\"\">The investigator didn’t find anything and concluded that Song Won-jin’s death was due to a bomb attack.</span></p><br/><p><span style=\"\">The most likely culprit was Kim Tae-sung, the bomber who had bad feelings towards the Taesung Group. </span><span style=\"\">In the end, the Yakuza prepared for a war against the Bomber.</span></p><br/><p><span style=\"\">Of course, they never dreamt that Tae-hyuk had used Robbery and Forgery to erase all signs from the room.</span></p><br/><p><span style=\"\">They were unaware that their enemy was Phantom.</span></p><br/><p><span style=\"\">@</span></p><br/><p><span style=\"\">There was no need to look with his eyes. </span><span style=\"\">He was able to see the positions of the enemies with the Demon Revealing Mirror.</span></p><br/><p><span style=\"\">Tae-hyuk licked his lips.</span></p><br/><p><span style=\"\">‘As expected, the remnants of the Yakuza are gathered here. This means...’</span></p><br/><p><span style=\"\">The bombs had a wide range of explosion. </span><span style=\"\">However, that was only if the bombs were installed.</span></p><br/><p><span style=\"\">Gathering a large number of guards here was simple. </span><span style=\"\">Mister Park put pressure on the prosecutors to catch the Bomber before turning this place into a fortress. </span><span style=\"\">In the end, if Tae-hyuk crushed this place, then he would be able to cut his fate with the Yakuza, which had continued since his previous life.</span></p><br/><p><span style=\"\">Yakuza members poured from the other side of the hallway and fired their guns at Tae-hyuk.</span></p><br/><p><i><span style=\"\">Tutututu!</span></i></p><br/><p><span style=\"\">Loud noises filled the air that were enough to burst his eardrums.</span></p><br/><p><span style=\"\">“M-Monster! D-Die!”</span></p><br/><p><span style=\"\">However, they couldn’t inflict any injuries on Tae-hyuk.</span></p><br/><p><i><span style=\"\">Kikikiki!</span></i></p><br/><p><span style=\"\">By moving Machina, he could easily block the bullets fired at his head. </span><span style=\"\">Tae-hyuk clicked his tongue and muttered.</span></p><br/><p><span style=\"\">\"Who is a monster? How many people have you killed in the meantime? Personally, it is a little unfair.”</span></p><br/><p><span style=\"\">He activated Bullet Time as they fired. </span><span style=\"\">Thanks to this, Tae-hyuk’s perception of time was reduced by dozens of times. </span><span style=\"\">It was like the world moved in slow motion.</span></p><br/><p><span style=\"\">Tae-hyuk moved quickly.</span></p><br/><p><span style=\"\">‘Two people behind the wall. And seven across the hallway.’</span></p><br/><p><span style=\"\">The map showed the people trying to ambush him. </span><span style=\"\">He moved forward and easily overpowered the seven opponents.</span></p><br/><p><span style=\"\">'But what I have to do now is not just get rid of the enemy. I need to turn their gaze away from the Bomber towards me.’</span></p><br/><p><span style=\"\">In order to do that, he had to act very loudly. </span><span style=\"\">By scanning the map, Tae-hyuk could tell that the Bomber wasn’t far from his location. </span><span style=\"\">It was one of the points where a bomb should be installed to blow up the laboratory.</span></p><br/><p><span style=\"\">‘The next two!’</span></p><br/><p><span style=\"\">1/3 of the Yakuza in the institute were already cold bodies on the floor. </span><span style=\"\">However, he was approaching his limit. </span><span style=\"\">No matter how overwhelming the abilities, even the crime skills weren’t invincible.</span></p><br/><p><span style=\"\">Bullet Time had a duration of one minute and Machina didn’t have endless durability. </span><span style=\"\">In the end, he couldn’t go to the centre of the institute where Mister Park was. </span><span style=\"\">The key to this operation was the Bomber.</span></p><br/><p><span style=\"\">Tae-hyuk concealed himself in the darkness and watched the Yakuza. </span><span style=\"\">The opponents were already overwhelmed with panic.</span></p><br/><p><span style=\"\">“W-What the hell is this?! Why won’t he die? Wasn’t he clearly shot?” </span></p><br/><p><span style=\"\">“T-The opponent is a g-ghost...”</span></p><br/><p><span style=\"\">“Ack! I ran out of bullets! You, do you have any spare mags left?”</span></p><br/><p><span style=\"\">\"The opponent is obviously the Bomber! This doesn’t make sense!”</span></p><br/><p><span style=\"\">“C-Call for reinforcements!”</span></p><br/><p><span style=\"\">In the end, the Yakuza members did something they should never do. </span><span style=\"\">They tried to confront the enemy away from the important defense points of the fortress. </span><span style=\"\">If someone had a good understanding of tactics and strategy then it was something they would’ve never done.</span></p><br/><p><span style=\"\">‘Come to think of it, maybe one of them are the descendants of the Japanese who invaded Korea during the Joseon Dynasty? If I think about that time, their decisions were pretty cute.’</span></p><br/><p><span style=\"\">Tae-hyuk laughed. </span><span style=\"\">Then he attacked the place where the Yakuza were busy servicing their equipment.</span></p><br/><p><span style=\"\">‘Truly easy opponents!’</span></p><br/><p><span style=\"\">There was a water pipe on the ceiling. </span><span style=\"\">He aimed the pistol at it and water started to pour down with a thunderous sound.</span></p><br/><p><i><span style=\"\">Hwaaaaack!</span></i></p><br/><p><span style=\"\">\"If you are in the basement then you should be careful of flooding!”</span></p><br/><p><span style=\"\">A masked gunman attacked from behind the water. </span><span style=\"\">It was a terrible predicament!</span></p><br/><p><span style=\"\">\"Aaaack!”</span></p><br/><p><span style=\"\">The Yakuza were soaked in water and randomly fired their guns.</span></p><br/><p><span style=\"\">“Aigoo. If you shoot me like this then you won’t have enough bullets left.”</span></p><br/><p><span style=\"\">However, this was more difficult than when they were aiming properly. </span><span style=\"\">It was hard to avoid all the random bullet lines. </span><span style=\"\">He had to defend himself against a few with Machina. </span><span style=\"\">Despite the diamond like strength, the Machina couldn’t withstand the hail of bullets and started breaking.</span></p><br/><p><span style=\"\">\"Ah, I'm sorry. I was trying to relax. This is the time limit. Now I’ll go faster.”</span></p><br/><p><span style=\"\">The Yakuza were shocked after hearing Tae-hyuk’s words. </span><span style=\"\">He had been relaxed until now?</span></p><br/><p><span style=\"\">“Then showtime.”</span></p><br/><p><span style=\"\">Tae-hyuk grabbed a pistol in both hands and pulled the trigger.</span></p><br/><p><i><span style=\"\">Tatang!</span></i></p><br/><p><span style=\"\">@</span></p><br/><p><span style=\"\">The Bomber, Kim Tae-sung, grabbed his shaking right arm..</span></p><br/><p><span style=\"\">All the preparations were finished. </span><span style=\"\">He succeeded in installing the bombs in all the places indicated on the map. </span><span style=\"\">Now he could blow up the institute at any time by just pressing the detonator.</span></p><br/><p><span style=\"\">“Pant... Pant... Pant!”</span></p><br/><p><span style=\"\">The Bomber leaned against the wall and breathed roughly. </span><span style=\"\">He had to run for almost two hours through the institute to install the bombs.</span></p><br/><p><span style=\"\">He heard fighting from a place not far away from him. </span><span style=\"\">It was like a war zone with gunshots and shouting. </span><span style=\"\">Then somebody died.</span></p><br/><p><span style=\"\">He knew who did it.</span></p><br/><p><span style=\"\">The masked man, ‘Phantom.’</span></p><br/><p><span style=\"\">Miracles were always created from his fingertips. </span><span style=\"\">Kim Tae-sung couldn’t do anything but make bombs. He had gotten this far thanks to Phantom.</span></p><br/><p><i><span style=\"\">Biiik!</span></i></p><br/><p><span style=\"\">Then the radio made a noise.</span></p><br/><p><span style=\"\">-</span><i><span style=\"\">I guess it is around the time that the installation is finished.</span></i></p><br/><p><span style=\"\">“Yes, Point G has been completed.”</span></p><br/><p><span style=\"\">-</span><i><span style=\"\">Then be careful.</span></i><i><span style=\"\">There might be a few people in the hallways.</span></i><i><span style=\"\">Don’t worry, it isn’t impossible for you to move.</span></i></p><br/><p><span style=\"\">The Bomber got goose bumps as he realized what Phantom was saying. </span><span style=\"\">There was something white across the hallway. </span><span style=\"\">It was a corridor deep underground but he didn’t care what was down there. </span><span style=\"\">But he took a deep breath once he realized what Phantom was suggestion.</span></p><br/><p><span style=\"\">\"Phantom...what are you...?”</span></p><br/><p><span style=\"\">-</span><i><span style=\"\">I can blow this up right now but it won’t be your revenge.</span></i><i><span style=\"\">I’ll give you 10 minutes.</span></i><i><span style=\"\">Finish everything and come to Point A.</span></i><i><span style=\"\">There will be a vehicle for you to escape.</span></i></p><br/><p><span style=\"\">“U-Understood.”</span></p><br/><p><span style=\"\">He closed off contact with Phantom. </span><span style=\"\">The Bomber gulped and looked at the darkness in front of him. </span><span style=\"\">It was like an abyss that led to hell.</span></p><br/><p><span style=\"\">...It seemed like not even moonlight could penetrate the darkness. </span><span style=\"\">The Bomber... No, very little remained in Kim Tae-sung’s heart. </span><span style=\"\">He had to finish everything before this warmth disappeared.</span></p><br/><p><span style=\"\">“Sang-ah...”</span></p><br/><p><span style=\"\">The enemies of his wife and daughter were there.</span></p><br/><p><span style=\"\">Kim Tae-sung bit his lip and headed to the underground laboratory. </span><span style=\"\">Not long after, Kim Tae-sung arrived in front of a firmly closed door. </span><span style=\"\">Once it opened...</span></p><br/><p><span style=\"\">@</span></p><br/><p><span style=\"\">When on Earth did things go wrong?</span></p><br/><p><span style=\"\">Mister Park was tense. </span><span style=\"\">It hadn’t been a week since Phantom defeated them in the mafia game. </span><span style=\"\">He had been concentrating on finishing the Psychotropic Incense, but now he received news that Taesung Chemical’s chairman Song Won-jin had died.</span></p><br/><p><span style=\"\">The culprit was a researcher who used to work for Taesung Chemical’s research institute.</span></p><br/><p><span style=\"\">“Director Jang Ik-sam. What was the name of the researcher?”</span></p><br/><p><span style=\"\">The elderly man walking nervously around the shelter answered,</span></p><br/><p><span style=\"\">“Ah, Kim Tae-sung.”</span></p><br/><p><span style=\"\">“Hrmm. It is obviously more famous under the nickname the Bomber.”</span></p><br/><p><span style=\"\">“Yes...that’s right. I’m sorry. I should’ve taken care of him properly...”</span></p><br/><p><span style=\"\">Then Mister Park shouted in a tense voice,</span></p><br/><p><span style=\"\">“Damn...! If you knew that then you should’ve reported it properly! Do I have to pay attention to everything?”</span></p><br/><p><span style=\"\">“......”</span></p><br/><p><span style=\"\">“No matter how great the Bomber is, he won’t be able to get in here. At best, he will be crushed by the building.”</span></p><br/><p><span style=\"\">Even if a bomb went off, they were safe inside this shelter. </span><span style=\"\">Mister Park and Jang Ik-sam were in the core of the research institute. </span><span style=\"\">It was a place where confidential secrets that absolutely couldn’t be leaked were kept. </span><span style=\"\">The downside was that radio waves couldn’t pass through, so communication had to be done through specially designed handsets. </span><span style=\"\">However, it had recently been jammed.</span></p><br/><p><span style=\"\">\"No way out...”</span></p><br/><p><span style=\"\">Then the door opened and someone entered. </span><span style=\"\">Jang Ik-sam knew that face.</span></p><br/><p><span style=\"\">“K-Kim Tae-sung! H-How did you get through security...?”</span></p><br/><p><span style=\"\">Kim Tae-sung aimed a gun at Jang Ik-sam with trembling hands.</span></p><br/><p><span style=\"\">“...Now, Jang Ik-sam! I will send you to hell!”</span></p><br/><p><span style=\"\">Jang Ik-sam started to laugh.</span></p><br/><p><span style=\"\">\"Hahaha! Do you want to kill me with a gun?”</span></p><br/><p><span style=\"\">Jang Ik-sam made a gesture and the bodyguards waiting with him pulled out their guns.</span></p><br/><p><span style=\"\">\"I praise the fact that you made it here. But you are surely dead. Can you kill me?”</span></p><br/><p><span style=\"\">\"That is a lot of talk, Jang Ik-sam!”</span></p><br/><p><i><span style=\"\">Tatang!</span></i></p><br/><p><span style=\"\">Kim Tae-sung fired his gun.</span></p><br/><p><span style=\"\">It flew towards Jang Ik-sam and literally stopped in front of him. </span><span style=\"\">The opponent didn’t die.</span></p><br/><p><span style=\"\">\"Pfft! Puhahaha! How funny, funny! Didn’t you know? This shelter is protected by bulletproof glass! Did you shoot a gun in the army? Aren’t you a moderately good shot? Puhuhuhu! Well, it was nice to see you after a long time, but this is the end. Goodbye Bomber.”</span></p><br/><p><span style=\"\">Jang Ik-sam motioned to his bodyguards. </span><span style=\"\">Apart from the bulletproof glass, he coldly closed the door of the shelter completely by pressing a switch. </span><span style=\"\">Then no matter how many bombs exploded outside, the dust wouldn’t be able to enter here. </span><span style=\"\">Plus...</span></p><br/><p><span style=\"\">\"Oh, I almost forgot. The special Psychotropic Incense made at the institute is installed in the air vents. If an intruder enters then it can be sprayed. Then what would happen?”</span></p><br/><p><span style=\"\">“......”</span></p><br/><p><span style=\"\">\"The person responsible for the incense will fall victim to it.”</span></p><br/><p><span style=\"\">Of course, the guards outside will be sacrificed but it doesn’t matter. </span><span style=\"\">Jang Ik-sam smirked and pressed the containment button of the shelter. </span><span style=\"\">Now the Psychotropic Incense would spread through the entire research institute except for here.</span></p><br/>\n</div>"}