{"title": "Chapter 154 - End of the Revenge #1", "id": 154, "volume": 2, "url": "http://boxnovel.org/god-of-crime-chapter-154-end-of-the-revenge-1", "volume_title": "Volume 2", "body": "<h1>Chapter 154 - End of the Revenge #1</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span style=\"\">Chapter 154 - End of the Revenge #1</span></p><br/><p><span style=\"\">Wolsang was a research institute specializing in particle physics.</span></p><br/><p><span style=\"\">The task that they were focusing on now was a new energy development project that could potentially be several times more efficient than fossil fuels. </span><span style=\"\">If it succeeded, all the researchers who participated would be able to win the Nobel Prize in physics.</span></p><br/><p><span style=\"\">‘The looks in their eyes are ridiculous. Besides, isn’t that a particle accelerator?’</span></p><br/><p><span style=\"\">It was a device that boasted a huge price, but there was a lot of dust piled up on it. </span><span style=\"\">It meant it hadn’t been used for research in a while.</span></p><br/><p><span style=\"\">A researcher was sitting on a desk and seemed to be writing a report with an annoyed expression.</span></p><br/><p><span style=\"\">‘It is typical of a research institute with no money.’</span></p><br/><p><span style=\"\">In any case, the situation of the Wolsang Institute didn’t seem that great.</span></p><br/><p><span style=\"\">‘Certainly, this seems more difficult than robotics or developing a new material.’</span></p><br/><p><span style=\"\">There seemed to be a lot of empty chairs, indicating that the management of this institute wasn’t so good. </span><span style=\"\">Great achievements required a lot of money, but if there weren’t any results, then they wouldn’t get any investments.</span></p><br/><p><span style=\"\">It was literally a Mobius strip.</span></p><br/><p><span style=\"\">“Ah! Director Go Ah-tae! Hello, it is Ha-ran.”</span></p><br/><p><span style=\"\">Ha-ran said with a smile and the man sitting in the corner lifted his head. </span><span style=\"\">The ramyun noodles cups piled up on his desk indicated how long he had been here.</span></p><br/><p><span style=\"\">He had a beard from not shaving for a few days. </span><span style=\"\">The skinny body also indicated the time spent here. </span><span style=\"\">Was he around 40 years old? </span><span style=\"\">He was fairly young for a director. </span><span style=\"\">He also didn’t have a separate office, working in the same space as the other researchers.</span></p><br/><p><span style=\"\">“Ha-ran? Ah, please wait a moment. I’ll bring some drinks.”</span></p><br/><p><span style=\"\">Go Ah-tae headed to the refreshments room with a friendly smile. </span><span style=\"\">He swayed strangely like he was ill.</span></p><br/><p><span style=\"\">“Haha! I ran out of coffee. Sorry but this...”</span></p><br/><p><span style=\"\">Go Ah-tae brought out cups containing cold water. </span><span style=\"\">There wasn’t a trap so he held all three cups in his hands with an anxious expression.</span></p><br/><p><span style=\"\">\"Help yourselves.”</span></p><br/><p><span style=\"\">\"Wah! I am thirsty. I’ll drink it well.”</span></p><br/><p><span style=\"\">Go Ah-tae had heard about Tae-hyuk through Ha-ran.</span></p><br/><p><span style=\"\">“Are you Seo Tae-hyuk? I've heard a lot about you from Ha-ran. Nice to meet you, I am Go Ah-tae, the director of this institute.”</span></p><br/><p><span style=\"\">“I am Seo Tae-hyuk.”</span></p><br/><p><span style=\"\">Tae-hyuk secretly used Spying to check his status window. </span><span style=\"\">Stamina was almost zero, but his intelligence was enormous. </span><span style=\"\">Furthermore, he had a profession other than the director of a research institute.</span></p><br/><p><span style=\"\">‘Isn’t this quite surprising? Fortunately, there aren’t any problems.’</span></p><br/><p><span style=\"\">Tae-hyuk analyzed the situation of the research institute. </span><span style=\"\">The facility had received a good amount of investments, so the equipment was good. </span><span style=\"\">It was comparable to places like the European particle physics institutes. </span><span style=\"\">But the companies that invested in these type of places were in a rush, so if no visible results were shown, then they would withdraw themselves from the project.</span></p><br/><p><span style=\"\">This situation was just like that. </span><span style=\"\">The researchers moved to other places and this was what remained. </span><span style=\"\">The director was somehow leading the project by himself, but it seemed like there was a limit. </span><span style=\"\">It was just before the sinking of the ship.</span></p><br/><p><span style=\"\">'He had a reason to invest in Noona. It is a situation where he even needs to borrow the hands of university students.’</span></p><br/><p><span style=\"\">Still, it seemed like there would be a lot to learn from working under such an enthusiastic director. </span><span style=\"\">It was enough if Ha-ran was satisfied. </span><span style=\"\">If it was money then he would soon be able to earn a big amount anyway.</span></p><br/><p><span style=\"\">'Yes, help the Bomber get revenge and then go find the gold. Most of the Yakuza in Korea are returning to Japan so this is a great opportunity. And the remaining ones are probably...’</span></p><br/><p><span style=\"\">As Tae-hyuk smiled, Go Ah-tae asked him.</span></p><br/><p><span style=\"\">\"I think that Tae-hyuk’s mind is very good. Do you want to make something like a black hole?’</span></p><br/><p><span style=\"\">“...I’m sorry but I have to go to university.”</span></p><br/><p><span style=\"\">“T-That’s right. If you change your mind then here is my contact number...”</span></p><br/><p><span style=\"\">After spending an hour talking, Go Ah-tae had another appointment. </span><span style=\"\">He had to go to another research institute for assistance. </span><span style=\"\">Even though he seemed quite busy, he still called them there to talk.</span></p><br/><p><span style=\"\">Director Go Ah-tae’s expectations for Ha-ran seemed quite big.</span></p><br/><p><span style=\"\">@</span></p><br/><p><span style=\"\">Tae-hyuk turned to the Bomber sitting in the back seat of a stolen Mercedes and asked.</span></p><br/><p><span style=\"\">\"Can you artificially create a black hole?”</span></p><br/><p><span style=\"\">\"It is impossible with the current technology. Won’t it be hard unless the Higgs Particle is discovered?”</span></p><br/><p><span style=\"\">\"Indeed.\"</span></p><br/><p><span style=\"\">\"But why are you asking about such a thing?”</span></p><br/><p><span style=\"\">\"Ah, it is nothing. Just a personal matter.”</span></p><br/><p><span style=\"\">The Bomber laughed and checked the bombs filling the back seat. </span><span style=\"\">They were enough to blow up the entire Taesung Chemicals research institute.</span></p><br/><p><span style=\"\">\"By the way, I didn’t know that the perpetrator of the disease was Direct Jang Ik-sam.\"</span></p><br/><p><span style=\"\">\"Do you know him?”</span></p><br/><p><span style=\"\">“Not really. I just thought that he was a good person. Yet my family... K-Kuheok!”</span></p><br/><p><span style=\"\">The Bomber bit his lip and suppressed his anger. </span><span style=\"\">He formed tight fists and said,</span></p><br/><p><span style=\"\">\"Please let me handle Director Jang Ik-sam with my own hands.”</span></p><br/><p><span style=\"\">\"I was already planning on that.”</span></p><br/><p><span style=\"\">Tae-hyuk parked 500m away from the Taesung Institute of Physics and Chemistry. </span><span style=\"\">Then he pulled out a large map. </span><span style=\"\">Last night, he had gone to the destination and used Spying. </span><span style=\"\">This was the result.</span></p><br/><p><span style=\"\">\"This is a blueprint of Taesung Institute. The bombs will be installed in the places shown here. If they explode at the same time, then we can blow up the entire institute.”</span></p><br/><p><span style=\"\">“Yes, I understand. Then this place with the O mark is...”</span></p><br/><p><span style=\"\">\"The director’s room is there. Do you understand what I mean?”</span></p><br/><p><span style=\"\">\"Thank you for keeping your promise, Phantom.”</span></p><br/><p><span style=\"\">The Bomber memorized the locations of the bombs.</span></p><br/><p><span style=\"\">\"Let me explain an outline of the operation. Currently, the Taesung Institute had a huge increase in the number of guards. I will go into the institute first and deal with them while you install the bombs in the specified points. After that is done, go to the room where Jang Ik-sam. Do you know what to do after that?”</span></p><br/><p><span style=\"\">“...Of course.”</span></p><br/><p><span style=\"\">\"What weapon do you want?”</span></p><br/><p><span style=\"\">The Bomber picked out a pistol from the weapons in the car.</span></p><br/><p><span style=\"\">\"Can you shoot it?”</span></p><br/><p><span style=\"\">“Haha. I also went to the army.”</span></p><br/><p><span style=\"\">“Well. This should be fine.”</span></p><br/><p><span style=\"\">The Bomber confirmed that there were six bullets in the magazine and placed it in his pocket. </span><span style=\"\">This would be enough to take care of Jang Ik-sam. </span><span style=\"\">Tae-hyuk nodded and started walking silently in the darkness.</span></p><br/><p><span style=\"\">The Bomber followed quietly with a heavy bag.</span></p><br/><p><span style=\"\">'This is truly the end of my previous life. The Psychotropic Incense is really important so Mister Park has kept it all in the institute and guarded by Yakuza members. I can change my fate if I take care of this.’</span></p><br/><p><span style=\"\">Mister Park was also in the laboratory. </span><span style=\"\">Tae-hyuk had been falsely framed thanks to Mister Park.</span></p><br/><p><span style=\"\">Jang Ik-sam had killed the Bomber’s family.</span></p><br/><p><span style=\"\">‘Whoops, I almost forgot. After this, should I go and buy a wedding gift for Noona?’</span></p><br/><p><span style=\"\">Seo Ha-ran and Cho Kang-suk’s wedding ceremony was taking place next week. </span><span style=\"\">Tae-hyuk moved through the darkness as he thought about what to buy his sister.</span></p><br/><p><span style=\"\">And after a while...</span></p><br/><p><span style=\"\">The operation to break his ties with Mister Park began.</span></p><br/><p><span style=\"\">@</span></p><br/><p><span style=\"\">The Taesung Institute of Physics and Chemistry was in the research complex until a year ago. </span><span style=\"\">After public opinion turned against them for the mass killing event, the location was moved to a secret place.</span></p><br/><p><span style=\"\">It was right here. </span><span style=\"\">Tae-hyuk looked at the research institute in front of him. </span><span style=\"\">It seemed like there was nothing inside. </span><span style=\"\">However, that was just a camouflage to conceal the identity. </span><span style=\"\">The Taesung Institute of Physics and Chemistry was hiding underground.</span></p><br/><p><span style=\"\">Tae-hyuk placed his hand on the wall and triggered ‘Spying’. </span><span style=\"\">Then he was able to see how many people were hiding in the building. </span><span style=\"\">As if it had been waiting, the Demon Revealing Mirror assigned him a mission.</span></p><br/><p><span style=\"\">[Kill Mister Park and the Yakuza members.</span></p><br/><p><span style=\"\">The remaining number of Yakuza members: 117]</span></p><br/><p><span style=\"\">This was the first time it said to kill the opponents. </span><span style=\"\">He wasn’t planning to keep them alive anyway so he decided to follow the Demon Revealing Mirror’s mission. </span><span style=\"\">After receiving the mission, he could see the targets on the map.</span></p><br/><p><span style=\"\">In front of Tae-hyuk’s eyes, the map of the research institute appeared like a hologram. </span><span style=\"\">The red dots were shining brightly. </span><span style=\"\">They were the Yakuza members guarding the institute.</span></p><br/><p><span style=\"\">“The Psychotropic Incense is really important. Aren’t most of the Yakuza members remaining in South Korea?\"</span></p><br/><p><span style=\"\">Of course, there were other remnants left. However, most of the people who could fight were gathered here.</span></p><br/><p><span style=\"\">\"It means that if I get rid of them, the ones who will interfere with my treasure hunt will also disappear. It is good luck.”</span></p><br/><p><span style=\"\">Tae-hyuk licked his lips. </span><span style=\"\">It tasted oddly of blood.</span></p><br/><p><span style=\"\">“Then let’s go.”</span></p><br/><p><span style=\"\">The Bomber tilted his head and asked,</span></p><br/><p><span style=\"\">\"But the surveillance cameras watching the walls...”</span></p><br/><p><span style=\"\">\"Who said we were going over the wall? I am going in this way.”</span></p><br/><p><i><span style=\"\">Kikikikik!</span></i></p><br/><p><span style=\"\">Tae-hyuk raised his robotic arms and cried out.</span></p><br/><p><span style=\"\">\"Machina, mode Smash!”</span></p><br/><p><span style=\"\">Both Machina arms were pulled back to their limit. </span><span style=\"\">Then they shot towards the wall in front of him.</span></p><br/><p><i><span style=\"\">Kuwaaaaaang!</span></i></p><br/><p><span style=\"\">Then the wall made of cement shattered with a huge roar. </span><span style=\"\">The Bomber was speechless.</span></p><br/><p><span style=\"\">“......”</span></p><br/><p><span style=\"\">An excavator was needed to break a wall of that thickness. </span><span style=\"\">However, a human had punched it with the force of a machine. </span><span style=\"\">He could imagine what would happen if that was used to attack humans. </span><span style=\"\">They would literally become chunks of flesh.</span></p><br/><p><span style=\"\">But this wasn’t the end. </span><span style=\"\">Tae-hyuk was dressed in a modified version of the body armour worn by Big Brother from the Triads. </span><span style=\"\">One or two bullets wouldn’t give him any fatal injuries, and most aggressive actions were possible.</span></p><br/><p><span style=\"\">'Furthermore, Machina can be used to protect my exposed head.’</span></p><br/><p><span style=\"\">He could see the trajectory of the bullets and had Bullet Time that accelerated his mind. </span><span style=\"\">He was confident that he alone could win against an army.</span></p><br/><p><span style=\"\">Tae-hyuk had two pistols hanging from his waist and a FA-MAS 62 rifle on his shoulder. </span><span style=\"\">There were 20 magazines containing 12 bullets. </span><span style=\"\">He had a bunch of pockets in his body armour, allowing him to hold them all. </span><span style=\"\">He was significantly armed but this wasn’t that much if he was to fight over 100 Yakuza.</span></p><br/><p><span style=\"\">If they all attacked at once, it would be difficult to avoid all the shots, even with Bullet Time. </span><span style=\"\">Therefore, he chose an appropriate route.</span></p><br/><p><span style=\"\">Tae-hyuk placed the skull mask on his face. </span><span style=\"\">The Bomber was wearing a mask of the same design.</span></p><br/><p><span style=\"\">\"Then it is a showdown between two bombers and 117 Yakuza members. It would be a plausible action movie if this was filmed. Unfortunately, that will have to wait for the next opportunity.”</span></p><br/><p><span style=\"\">Once Tae-hyuk gave the signal, the Bomber started running towards the place where the bombs would be installed.</span></p><br/><p><span style=\"\">The skull mask shone white in the darkness.</span></p><br/><p><span style=\"\">“Then it is time to kill.”</span></p><br/>\n</div>"}