{"title": "Chapter 9", "id": 9, "volume": 1, "url": "http://boxnovel.org/rebirth-of-a-supermodel-chapter-9", "volume_title": "Volume 1", "body": "<h1>Chapter 9</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 9</p><hr/><br/><p>Zhao Rui might’ve been lonely in recent years, but he still came to Character’s headquarters several times. He was familiar with the layout and lead Ming Yu to the 14th floor. Once the elevator opened, the first thing Ming Yu saw was the magnificent sign stating ‘Character’.</p><br/><p>In Huaxia, first-tier and second-tier magazines weren’t differentiated just from their sales. There were deep gaps in many aspects such as the models invited, the sponsored brands and the international standing.</p><br/><p>Character’s staff led the two people towards the meeting room. The two people hadn’t gone far when they head an editor sighing. “Yesterday, Chen made a phone call to invite Xi Ze, but he still declined. Now I don’t know who we should shoot for the cover of our 20th anniversary…”</p><br/><p>“I recently heard that Xi Ze is busy with the fashion year that will take place in the first quarter next year, so he has no time.”</p><br/><p>***</p><br/><p>After turning a corner, the conversing voices faded away. Ming Yu and Zhao Rui waited a few minutes in the meeting room. Then several elite looking middle-aged men appeared, followed by a stylish and elegant woman.</p><br/><p>Ming Yu’s gaze swept over the woman’s body. After a brief conversation between the two groups, Mr. Yang, the deputy editor of Character started speaking. “I have communicated this with Mr. Zhao before. We want to invite four popular new models for a themed photo shoot. In fact, we have managed to invite Wu Yuzhen and Liu Qian, who have been doing quite well in the past two years.”</p><br/><p>Deputy Editor Yang’s implication was that, objectively speaking, Ming Yu’s reputation was poor and couldn’t be compared to these two rising models.</p><br/><p>Zhao Rui had naturally prepared in advanced so he calmly said, “We understand your words, Deputy Editor Yang. I also admire Wu Yuzhen and Liu Qian’s success. It isn’t easy since they come from small companies. But I think you should understand that putting those external conditions aside, Ming Yu is no worse than both of them.”</p><br/><p>Zhao Rui’s words were modest. In his mind, he was thinking that his model was much more powerful than both of them!</p><br/><p>Zhao Rui paused before continuing. “Since four people are shooting a set of photos, you want to borrow the fame of these four individuals to raise momentum for the campaign. As far as I know, many people in today’s circles are optimistic about Wu Yuzhen and Liu Qian’s future. Many people want to cooperate with them. Since you have successfully invited them, this ‘momentum’ step is already successful.”</p><br/><p>Zhao Rui’s tone was calm without the slightest bit of cowardice as he completed his analysis, causing Deputy Editor Yant to feel slightly surprised.</p><br/><p>A middle-aged man sitting next to Deputy Editor Yang took over. “Mr. Zhao, you have to admit that in terms of popularity, Wu Yuzhen and Liu Qian are much higher. It isn’t that we don’t want to make you an offer. We just need to think again about this contract.”</p><br/><p>In fact, Ming Yu understood the other side’s meaning as soon as Deputy Editor Yang first spoke. Since ‘Character’ invited them to the magazine’s headquarters, it was clear that they wanted to cooperate with Ming Yu. So, what needed to be negotiated here?</p><br/><p>Of course, it was closely related to the contract that was about to be signed.</p><br/><p>Zhao Rui also understood Character’s intentions. He reluctantly suppressed his dissastifaction and said, “Ming Yu’s reputation is worst than that of Wu Yuzhen and Liu Qian, but they didn’t shoot the cover of ‘Meditation Road’ or appear in ‘Lanka’.”</p><br/><p>A few years ago, Ming Yu shot a cover for the second-tied Meditation Road and appeared in the pages of Lanka, a first-tier Huaxia magazine.</p><br/><p>After controlling his emotions, Zhao Rui sighed and continued. “Since we have been recommended by Mr. Luo Yu, I don’t think you can doubt Ming Yu’s strength. It is understandable if you only consider fame. But if you put all this together, Ming Yu’s pay should be the same as Wu Yuzhen and Liu Qian…”</p><br/><p>“50%.”</p><br/><p>The young man’s clear and melodious voice was heard in the quiet meeting room, drawing all attention towards him.</p><br/><p>Zhao Rui looked at his young model with surprised. Ming Yu’s lips curved at everyone’s surprised looks and he repeated calmly. “I think it is enough to only receive 50%. In terms of results, I am a lot worse than Wu Yuzhen and Liu Qian. I am honoured to have this chance and grateful to you for giving me this opportunity, so I don’t care about the pay.”</p><br/><p>Deputy Editor couldn’t help smiling proudly as he listened to Ming Yu’s words. Then Ming Yu’s expression suddenly took a shy turn as he said, “Sometimes, I think it is luckier to be part of a small company. There aren’t as many competitors, so I can receive more resources. What if they were from Muse? They probably… wouldn’t rise so quickly in the beginning?”</p><br/><p>Ming Yu gently laughed and looked very relaxed, as if he was really speaking his thoughts. However, the calm and powerful aura coming from him made people feel cold.</p><br/><p>In particular, Deputy Assistant Yang, who was being stared at by Ming Yu, felt some sweat falling down his forehead. After gulping, the more than 40 years old Deputy Editor Yang trembled as he thought, ‘An illusion?’ Such aura, he had only experienced it from a few people, and these people were in the rankings of the world’s top supermodels…</p><br/><p>If Deputy Editor Yang was engrossed in Ming Yu’s aura, the lady sitting outside was paying attention to the contents of his words. Chen Rongchen, the editor-in-chief of Character, look at Ming Yu and laughed quietly—</p><br/><p>Was this Muse putting pressure on them?</p><br/><p>Suppressing Yang and directly hitting the key point…</p><br/><p>Good!</p><br/><p>Chen Rongchen didn’t think about it any longer as she knocked her fingers against the table. “50% isn’t necessary. The contract will be the same as Wu Yuzhen’s.”</p><br/><p>This remark attracted the attention of others and an editor hurriedly said, “Editor Chen, you…”</p><br/><p>“I said, there will be no change in the contract. Do you understand?”</p><br/><p>As the editor-in-chief of a first-tier magazine, Chen Rongchen was renowned in the industry for many years. She glanced coldly at her own editors, who only wanted petty profits. She laughed sarcastically, causing them to bow their heads.</p><br/><p>After seeing that her mediocre editors had acknowledged their mistake, Chen Rongchen looked at Ming Yu. However, she was surprised to see that the model’s expression still looked the same.</p><br/><p>—He wasn’t surprised at all?</p><br/><p>He once again gained extra points in her heart. ‘Character’s Queen,’ Chen Rongchen smiled and said, “Ming Yu, I only value appearance and strength. I think that you deserve this contract and have high enough standards to make this contract reflect its value. Perhaps… your strength will give me a surprise.”</p><br/><p>Chen Rongchen spoke lightly, but her gaze was fixed on Ming Yu.</p><br/><p>People would normally feel twice the pressure when stared at by Character’s Queen, but Ming Yu just smiled. “I want to fulfill your expectations, so don’t blame me if I do.”</p><br/><p>***</p><br/><p>This, the contract signing was completed in this ‘harmonious and warm’ atmosphere.</p><br/><p>When Ming Yu and Zhao Rui were about to leave Character, Chen Rongchen handed Ming Yu a business card without speaking, then she turned and left.</p><br/><p>As the editor-in-chief of Huaxia’s first-tier magazine, she had her own strength of character. She appreciated Ming Yu, but she wouldn’t do much if the child didn’t make a difference. Every year, there were endless new people with aura in the fashion circles. However, only a few of them managed to stand at the top and enter the supermodel rankings.</p><br/><p>Zhao Rui drove away from Character’s headquarters and spoke emotionally, “I never expected Queen Chen to take the initiative to speak for you, Ming Yu. Before I came today, I expected that we would be discussing matters concerning the contract. In fact, my bottom line was 60%, but we actually ending up getting the same contract as Wu Yuzhen!”</p><br/><p>Ming Yu smiled, “Ms. Chen is very courageous.”</p><br/><p>“Isn’t she? She gave you the same contract as Wu Yuzhen, which shows that your positions are equal when taking photos. After this magazine edition is published, people would look at the photos and say that ‘Character has officially recognized that Ming Yu has the same status as Wu Yuzhen and Liu Qian.’ This is great!”</p><br/><p>“Pfft.” Ming Yu was amused by Zhao Rui’s tone and couldn’t help laughing.</p><br/><p>Zhao Rui cried out, “Don’t laugh! You don’t understand. The pay is one thing, but those editors wanted to make you lower than Wu Yuzhen! On the surface, we were talking about payment issues, but in fact, we were talking about your status in next week’s photo shoot.”</p><br/><p>“I understand.” Ming Yu nodded. “Yes, yes.”</p><br/><p>Zhao Rui exclaimed emotionally, “Queen Chen is really bold!”</p><br/><p>***</p><br/><p>The white business car leisurely drove through the city and into the warm and brilliant sunset.</p><br/><p>Six days later, Zhao Rui came to Character’s studio with Ming Yu. They had just walked out of the elevator when they suddenly saw a familiar figure.</p><br/><p>The two sides locked eyes. Zhao Rui was startled, while Ming Yu just smiled slightly and looked at the other person.</p><br/><p>And Zhu Wei stared in horror as he cried out in a disbelieving tone, “How is it you?”</p><br/>\n</div>"}