{"title": "Chapter 2", "id": 2, "volume": 1, "url": "http://boxnovel.org/rebirth-of-a-supermodel-chapter-2", "volume_title": "Volume 1", "body": "<h1>Chapter 2</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 2</p><hr/><br/><p>In the autumn, the weather of Beijing was a blue sky, sunny and bright.</p><br/><p>By the time Zhao Rui rushed to the First Beijing Hospital, Ming Yu had already completed all his examinations. He was sitting on a plastic stool in the corridor of the medical centre, laughing and talking with two cute nurses.</p><br/><p>Zhao Rui was stunned when he saw Ming Yu, but he soon recovered. Zhao Rui had rushed over but he never imagined he would see this ‘sitting down and enjoying several partners’ type of scene. He gritted his teeth angrily, before going up to Ming Yu and asking. “Why did you come to the hospital today?”</p><br/><p>After seeing Zhao Rui, the two warm nurses said goodbye to Ming Yu. Then Ming Yu turned to look at his agent. The other person had angry eyes and was staring like he wanted to use a rope to strangle Ming Yu’s neck.</p><br/><p>Ming Yu chuckled and blinked innocently, handing him a list. “I came to the hospital for an examination.”</p><br/><p>The answer was clearly beyond Zhao Rui’s expectations. He knew that Ming Yu was at the medical centre, but he couldn’t understand why this guy was doing a checkup. Zhao Rui looked at Ming Yu’s check list, confirmed that there were no problems and asked. “Why did you come for a physical examination? Didn’t the company organize a physical examination last month?”</p><br/><p> They walked outside the hospital as they spoke.</p><br/><p>“That was last month.” Ming Yu’s voice was very calm. “I want to check again to see if there are any recent problems. But it seems like I’m very healthy.”</p><br/><p>Zhao Rui smiled sarcastically, “As long as you don’t commit suicide over that Cheng Su, your body will be twice as good.”</p><br/><p>Once they exited through the hospital door, the bright sunshine shone on their body, warming the cold blood. Along the way, Zhao Rui couldn’t help looking at the young man with amazed eyes.</p><br/><p>When Zhao Rui rushed to the hospital today, he was shocked at his first glimpse of Ming Yu. The model before him was very good. However, his sense of aesthetics was extremely questionable, pulling down the standards of Huaxia. Despite the beautiful face, he wore clothing that would fit in with the Shamate.</p><br/><p>This was enough to break Zhao Rui’s heart. But he couldn’t say that Ming Yu’s aesthetic wasn’t good, or else this guy would become angry and even try to escape from the activities. After thinking for a moment, Zhao Rui couldn’t help asking, “Why are you wearing the clothing I bought for you today?”</p><br/><p>Ming Yu’s pace slowed for a moment as he heard the words, then he quickly laughed. “These clothes feel very good.” Ming Yu then added with a light smile. “Brother Zhao, there were many things that I didn’t pay attention to before. I was young and naive, so please forgive me.”</p><br/><p>These words made Zhao Rui hesitate. He looked the youth up and down and tentatively asked, “Your words… what do they mean?”</p><br/><p>The face of the young man standing in the golden sunshine seemed like it was plated with a layer of gold. He calmly stared at his shocked agent with soft eyes and a warm expression.</p><br/><p>“I mean–”</p><br/><p> “Brother Zhao, I want to start again.”</p><br/><p>***</p><br/><p>As they moved from the hospital to the company, Zhao Rui secretly looed at Ming Yu and found that this youth was really different from his memories. His mind was puzzled and he finally couldn’t help asking, “Ming Yu, what is wrong with you?”</p><br/><p>Ming Yu put down the magazine in his hand, thought for a while before finally deciding to throw something at the slag male. “Didn’t Cheng Su say in a magazine interview yesterday that he likes cute and playful girls? I was hit hard by those words, and have decided to live as a new person from now on.”</p><br/><p>Ming Yu tightened his brow as he spoke, pretending to look lost and sad. Zhao Rui sighed and nodded. “It is best if you think like this. Cheng Su has some problems with his character. If you hadn’t become involved with him, your current status wouldn’t be like this.”</p><br/><p>Ming Yu nodded quietly at these words and let Zhao Rui start to preach. Zhao Rui’s words, the original owner was dazzled by love and couldn’t see the truth. But Ming Yu knew it clearly.</p><br/><p>Was Cheng Su gay? The odds were nine out of ten that he wasn’t. There might be many homosexuals in the fashion circle, but based on his memories of Cheng Su’s behaviour, Ming Yu could confidently say, “Cheng Su really likes cute and playful girls.”</p><br/><p>But if Cheng Su wasn’t a homosexual, why did he seduce the original owner? And after succeeding in the seduction, why did he provoke the original owner to kill himself? The reason was nothing more than the opportunities.</p><br/><p>Cheng Su might be a popular model now, but two or three years ago, he was just a humble and small model. His appearance wasn’t bad, but after more than a year in the industry, he still wasn’t comparable to the original owner.</p><br/><p>That year was really the most glorious year for the original owner of this body. He just entered the modelling industry and attracted countless fans with his amazing appearance. His first cover was that of a second-tier domestic magazine and after three months, he even appeared in the pages of a first-tier magazine! This treatment prompted countless envy among his peers, and they secretly plotted together with Cheng Su.</p><br/><p>The original owner had his parents die early. He grew up alone and developed a gloomy and boring character. If he hadn’t been discovered by a scout, it was unknown which road the original owner would’ve gone down.</p><br/><p>At this point, he met Cheng Su who was attentive and courted him. It took six months before the young and ignorant youth was won over, and these feelings wouldn’t change even unto death. Even at the moment of death, the original owner was thinking about Cheng Su, showing how important this man was in his heart.</p><br/><p>However, it was this infatuation that made Ming Yu distressed and and pained for the original owner.</p><br/><p>The original owner of this body was only 17 years old. It was really the best time for a model, but it was wasted on such a flirtatious flower.</p><br/><p>The original owner was only 14 years old when he entered the fashion industry. He looked good and was tall, but he was still a child!</p><br/><p>But Cheng Su tried to obtain this child. The original owner wasn’t yet psychologically mature and was won over in one feel swoop. He carelessly surrendered his numerous opportunities, making Cheng Su a new star model.</p><br/><p>“…Okay, let’s go find a new style this afternoon. You are starting over, so don’t kill yourself over that guy called Cheng Su. Do you understand?”</p><br/><p>“Yes, I know Brother Zhao.”</p><br/><p>The car smoothly drove up to a skyscraper that was the company. The original owner’s memory of this place was rather vague, so Ming Yu just quietly followed behind Zhao Rui into the building.</p><br/><p>Muse Modelling Agency, it was one of Chine’s three largest supermodel companies and located in Beijing. The Muse Building was the highest building in Beijing, and was the company that represented supermodels across five continents.</p><br/><p>In this world, Huaxia’s economic development was very prosperous, meaning it also had a pivotal position in the fashion industry. Huaxia’s three supermodel companies were ranked at the forefront in the world, and the Muse Modelling Agency firmly dominated the first position. No one could shake it.</p><br/><p>They entered the company, revaling an open and clean space with not too many people. Ming Yu followed Zhao Rui into the elevator and arrived on the 39th floor. They just walked through the elevator doors when they came face to face with a tall female model wearing sunglasses.</p><br/><p> The female model looked at Ming Yu first, then she took off her sunglasses and turned towards Zhao Rui. She said with a smile, “Brother Zhao is good.” Then regardless of Zhao Rui’s reaction, she stepped into the elevator.</p><br/><p>The female model’s gaze stayed on Ming Yu’s body for a long time. Even if she was wearing sunglasses, Ming Yu could feel her gaze on his body.</p><br/><p>Models were all visual animals. Just as Ming Yu remembered the sexy and full red lips of the female model, he was afraid that the female model also remembered him. A beautiful person was easy to remember due to jealousy. But… did she remember where she was?</p><br/><p>Ming Yu didn’t think about it too much and kept moving forward. He didn’t know that the female in the model spoke angrily to her assistant. “How is that bow so attractive? I’m furious! Why is he so beautiful!! Tell me!”</p><br/><p>The innocent poor assistant, “…”</p><br/><p>How could he know why that person looked so good? You should ask his mother what type of panacea she ate while pregnant.</p><br/><p>***</p><br/><p>Zhao Rui and Ming Yu walked through a few corridors of the company. They encountered beautiful fashion models, but their attitude was the same as they first female model. They greeted Zhao Rui with a casual but dissatisfied attitude.</p><br/><p>Ming Yu’s eyes narrowed at the sight, but he didn’t say anything.</p><br/><p>In the past two years, the original owner was trapped in a big pit called ‘Cheng Su.’ How could he worry about the life of his agent? Therefore, the memories of the original owner didn’t contain anything about ‘What is Zhao Rui’s position in the company?’</p><br/><p>As if hearing Ming Yu’s confusion, Zhao Rui sighed while opning a door. “You don’t have to worry about their attitude. My position might be worst than before, but I can still fight for some good resources for you. Work hard until you reach Cheng Su’s position, no, until you are better than him. Then no one will look at us like that anymore.”</p><br/><p>Ming Yu had a sudden thought as he listened to these words. “You aren’t Cheng Su’s agent?”</p><br/><p>Zhao Rui’s mouth twitched as he made an angry expression. “You really don’t care about me!!! Cheng Su applied to change to a better agent six months ago.”</p><br/><p>Ming Yu, “…”</p><br/><p>It wasn’t him, but the original owner that didn’t care about Zhao Rui. As a result, Ming Yu could understand why those models had such an attitude. Zhao Rui had a hot star in is hands, but was kicked away.</p><br/><p>Then Zhao Rui’s position in the company… yes, he was probably a person in the red. The reason for the no respect… was Zhao Rui abandoned because he failed?</p><br/><p>The models didn’t know the inside matters regarding Cheng Su and Zhao Rui’s separation, so they only looked at the surface of the matter.</p><br/><p>One of the key points was cleared up. Ming Yu sighed and patted Zhao Rui, trying to comfort him. “It doesn’t matter, that is his loss. Let’s continue to work hard, yes?”</p><br/><p>Zhao Rui snorted and just opened his mouth to spear, while a voice was heard from behind Ming Yu. “So, before you go to work… shouldn’t you find a perfect style first?”</p><br/>\n</div>"}