{"title": "Chapter 1", "id": 1, "volume": 1, "url": "http://boxnovel.org/rebirth-of-a-supermodel-chapter-1", "volume_title": "Volume 1", "body": "<h1>Chapter 1</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1</p><hr/><br/><p>Ming Yu woke up with a severe headache.</p><br/><p>It felt like he had been crushed by a heavy truck, splitting his head into several pieces. The left side of his brain was stiff, while the right side of his brain was stinging. Both sides aggravated his nerves, causing him to suddenly wake up. His sweaty body shot straight up.</p><br/><p>His vision was blurred for a moment. Ming Yu blinked and things slowly came into focus. After looking at the things in front of him, Ming Yu’s smile froze. He carefully looked the huge poster up and down for a long time, before narrowing his eyes at the flamboyant signature on the bottom right corner of the poster.</p><br/><p>Ah, he didn’t know. He had never seen the person on the poster, or this name.</p><br/><p>Ming Yu scanned the room and found that apart from the excessively fancy poster, this room was really simple and clean. There was nothing else apart from a desk, a stool, a TV, a closet and a bed.</p><br/><p>Ming Yu endured the pain coming from his head and struggled to get up. He intended to look around this room to see what clues could be found. For example, he should at least find a mirror to see who he was now.</p><br/><p>Yes, by this time, Ming Yu had long discovered that this body wasn’t his own.</p><br/><p> For the past three months, he had been completely paralyzed in bed, unable to move anything below his shoulders. Now he sat up in an unfamiliar bed and started to move normally— Obviously this wasn’t his body.</p><br/><p>A model needed to be very familiar with their own body. Ming Yu clearly remembered his own physical characteristics, while discovering abnormalities at the same time. Ming Yu straightforwardly looked around the room. Then he opened the door, walked to the bathroom and found a mirror.</p><br/><p>“Appearance… it is very good.”</p><br/><p>The reflection in the mirror showed a delicate young boy, with eye-catching facial features. A person with good deportment and appearance. It wasn’t an exaggeration to use such beautiful words to describe his appearance. This face resembled Ming Yu by 70%, while the remaining 30% was even more outstanding.</p><br/><p>A good stature was needed to become a supermodel. And if a person wanted to become the best supermodel entering the world’s supermodel rankings, a superb appearance and clear temperament was needed. Enough so that the whole world would be amazed.</p><br/><p>The 70% resemblance to Ming Yu showed that this young man’s appearance was really excellent. Not to mention the other 30% that was even more outstanding. Even Ming Yu was lost for a moment as he stared at this face, before reluctantly whispering, “Too gorgeous and too arrogant.”</p><br/><p>Ming Yu gently sighed and looked at himself in the bathroom for a while, before opening the door to return to the bedroom. He had just entered the living room when Ming Yu saw a small medicine bottle and a piece of paper on the living room’s coffee table.</p><br/><p>Ming Yu picked up the piece of paper and stared at the words stupidly for a long time, before helplessly shaking his head.</p><br/><p>[When you see these words, I have probably left this world. Cheng Su, do you see this? This is my determination! I want you to remember for the rest of your life. I will never let you forget that in this life, there is a person called ‘Ming Yu’ willing to die for you!]</p><br/><p>Ming Yu put down the piece of paper and muttered with pity. “Wanting to make a person who doesn’t cherish you remember you forever. It is useless to sacrifice your life. If you want him to never forget you, you must let him know how dazzling you are, so that he will regret it.”</p><br/><p>Ming Yu understood that the owner of this body had probably been hurt by love. He took the sleeping pills in the medicine bottle, lay in bed and quietly died. This allowed Ming Yu’s soul to enter.</p><br/><p>Ming Yu felt the pain in his brain become stronger as he thought of this. He raised his fingers and gently pressed them against his temple, trying to relieve the pain. However, the pain gradually intensified, making Ming Yu let out an involuntary noise.</p><br/><p>The sensation became more and more intense, until Ming Yu eventually fainted. Once he woke up again, the pain had almost completely gone, leaving only a slight weakness and a temporary feeling of not being able to adapt.</p><br/><p>After receiving most of the previous owner’s memories, Ming Yu finally knew that this was another world, and it was a world completely opposite to his Earth!</p><br/><p>From the Ming Dynasty onwards, the history of this world silently changed. There was no isolation or ban on maritime trade. This allowed the Ming Dynasty to rule the vast land of China for more than 400 years. In the end, feudalism was replaced and the new country gradually became a world hegemony.</p><br/><p>Huaxia.</p><br/><p> Based on the memories of the youth, Huaxia enjoyed strong national strength and its cultural development was extremely prosperous. Whether it was economics, politics, science or entertainment, China stood at the highest peak in the world and looked at the United States and Europe.</p><br/><p>Ming Yu finally couldn’t restrain his lips, revealing a smile of joy as he realized that the fashion circles in this world was very prosperous.</p><br/><p>He had no father or mother in his previous life. After leaving the orphanage, he struggled alone for over 10 years after finally reaching a high status. After that, he received a serious illness. Before he died, he said farewell to his friends and no longer had another to worry about.</p><br/><p>This was like a gift of a lifetime. Ming Yu smiled eagerly at the thought of challenging a new and more prosperous fashion industry.</p><br/><p>Ming Yu suddenly recalled something and quickly entered his bedroom. He stood in front of the poster and stared at it for a long time. The man on the poster was tall, with a handsome face and dashing eyebrows. He had the bright and smart temperament.</p><br/><p>Ming Yu leaned down and looked at the flamboyant signature. He couldn’t tell the name of the signature, eventually laughing out loud and sighing helplessly. “The original words are ‘Cheng Su’… Ah, the characters are too thin and long, making them look harsh and sharp. This isn’t very consistent with your sunny image.”</p><br/><p>Ming Yu didn’t hesitate to tear down the poster, casually kneading it into a ball before throwing it into the trash.</p><br/><p>After circling the room, Ming Yu quickly found a simple and clean wallet. He opened it to find several thousand yuan inside. He opened his closet, intending to pick out clothes to go somewhere.</p><br/><p>Ming Yu really wanted to pick out clothing to go somewhere. However, once he saw the inside of the closet, he stiffened and stood stunned for a long time.</p><br/><p>The clothing he saw in this closet, from the hanging jackets to the folded trousers, they were all hideous! For example, on the left side was a red and white coat similar to his primary school uniform in his last life! Another example was the black pants folded on the far right. He had no problem with the soft cotton but… why was a red hemp rope used as a belt!!!</p><br/><p><em>Snap.</em></p><br/><p>Ming Yu didn’t hesitate to close the closet door. Looking at the pieces in the closet was simply polluting his eyes. These types of clothing seemed to have the concept of ‘Put me on and you can become a student… No! Even a student didn’t dress like this!</p><br/><p>Ming Yu finally understood why in the original memories, Cheng Su seemed to dislike him. Cheng Su was a man in a society that cared about appearances. The original owner of the body had an outstanding appearance, so Cheng Su should treat him differently. In fact, Cheng Su didn’t really like the original owner. He only became close to the original owner to grab all his opportunities, stepping on the shoulders of the original owner to climb up.</p><br/><p>Ming Yu sighed gently and sympathized with the original owner of the body.</p><br/><p>“You found someone who couldn’t discover your inner beauty but… you chose to die for such a person.”</p><br/><p>Ming Yu paused before opening the closet again. He smiled and said, “Don’t worry. I will fulfill your last wish. I will make it so that Cheng Su can’t forget the name of ‘Ming Yu.’ l will imprint these two words deeply into his heart, so he can’t forget it forever.”</p><br/><p>Ming Yu rummaged through the closet for a long time before finding some good clothing. He put on a light gray windbreaker, paired with white slim jeans. Fortunately, the original owner had good taste with shoes so Ming Yu selected a pair of black and white high-top sneakers and left the place.</p><br/><p>Before going out, he deliberately tousled his hair, revealing his white forehead.</p><br/><p> It was casual clothing, but after Ming Yu left his apartment, he received the stares of people passing by. Even as he walked across the intersection, there were two or three young female students with shoulder bags staring at him, causing them to miss the green light.</p><br/><p>‘You see, you can get the world’s attention just by wearing something more normal. And… from now on, I will let the whole world see your glory!’</p><br/><p>***</p><br/><p>Under the bright sunlight, the metal signboard of the First Beijing <sup>[1]</sup> Hospital reflected the sunshine. A handsome young man walked into the hospital’s medical centre, received a number and queued up for a physical examination.</p><br/><p>The enthusiastic nurse took him for an ECG. Ming Yu hadn’t yet reached the next physical examination venue when his phone buzzed loudly. Ming Yu narrowed his eyes as he took out his mobile phone and saw the name flashing on the screen. He thought for a while before picking up the call.</p><br/><p>Once he picked up the phone, an angry male voice was heard. “Ming Yu! Where have you been? Didn’t I say I would bring you to do some styling this afternoon? Why are you missing again?”</p><br/><p>After holding the phone 10cm away from his ears and determining that the other person wouldn’t roar again, Ming Yu placed the phone back to his ears and said with a smile. “Brother Zhao, I am at the hospital. If you don’t mind, can you come and pick me up at the First Beijing Hospital?”</p><br/><p>The voice on the other end of the phone was silent for a moment before shouting, “Hospital? What are you doing in the hospital? Don’t tell me you are still thinking of suicide because of Cheng Su? I told you, if you are going to do something so stupid then don’t come to see me again!!!”</p><br/><p>Ming Yu gave a low laugh before saying, “You think too much.”</p><br/><p>“Just wait, I will be there right away! I better not find out that you did something stupid!”</p><br/><p>After the person hung up, Ming Yu turned to see the nurse still standing there. He smiled with his delicate features and apologized. “I’m sorry, let’s continue to the next area. It was a stomach examination?”</p><br/><p>The nurse paused for a moment at the young man’s bright smile before nodding. “Yes, we will examine the stomach. From there…”</p><br/><p>…Why did he come to the hospital? To check if there was anything left from the sleeping pills! He hadn’t yet conquered this world’s fashion industry, so how could he die so casually?</p><br/><p>He wanted to look at the fashion industry in this world. In the end, how prosperous was it?</p><hr/><br/><p>[1] Looking up the Chinese characters actually gave me Imperial Capital. I chose to go with Beijing because I read that ‘The use of “imperial capital” to mean Beijing has increased as Internet users have come to rely more and more on code words, homonyms, and creatively indirect references to avoid and circumvent censorship</p><br/>\n</div>"}