{"title": "Chapter 36", "id": 36, "volume": 1, "url": "http://boxnovel.org/rebirth-of-a-supermodel-chapter-36", "volume_title": "Volume 1", "body": "<h1>Chapter 36</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 36</p><hr/><br/><p>Ming Yu arrived on set at the official time, where the entire crew was waiting for him to show up.</p><br/><p>Luo Ru obviously underestimated the impact of her small model on others. The moment this tall and handsome young man appeared in everyone’s vision, many people stared stupidly for a while, before waking up and continuing their tasks. However, they kept glancing over at Ming Yu.</p><br/><p>There wasn’t a clear boundary between the entertainment and fashion industries. Many stars began as models and gradually honed their acting ability, eventually taking part in movies or TV shows. But many celebrities didn’t have such the outstanding figure and calm temperament.</p><br/><p>Of course, there were also models who didn’t hone their acting skills. Ming Yu was one of them.</p><br/><p>The director saw Ming Yu and couldn’t help asking. “This person isn’t bad. Do you want to enter the entertainment industry?”</p><br/><p>Look!</p><br/><p>Ming Xiaoyu’s face and body (184cm was a very good height in the entertainment industry!) were suitable. His temperament and aura? He wouldn’t lose to any star on the red carpet. Ming Xiaoyu, he was a beauty that grabbed the eyes!</p><br/><p>But in front of the director, Ming Yu just laughed with self-awareness. “You are praising me too much, Director Wang.”</p><br/><p>Wang Yao waved his hands as he heard this and said, “I mean it, Ming Yu. Your condition is really good. Aren’t there are a lot of Muse models who enter the entertainment industry? You have the potential!”</p><br/><p>Ming Yu just laughed without saying anything.</p><br/><p>Then once the recording started, Director Wang stared at the teenager with a dumbfounded expression. His face was swollen.</p><br/><p>[No acting skills, just a pretty face.]</p><br/><p>This was the most appropriate evaluation of Ming Xiaoyu!</p><br/><p>Wang Yao had shot many ads and even participated in TV dramas and movies. He had seen a lot of stars who couldn’t act, but to be this stiff! The number… was only a few.</p><br/><p>Obviously, Ming Yu was calm and full of momentum when talking photos or on the catwalk. However, as long as the filming project had a plot, Ming Yu completely wilted. Even when laughing, his expression was so stiff that it made the people on the set petrified.</p><br/><p>Thus, a simple ‘take the lemonade, bend down to organize the goods, look up and smile’ turned out to be a NG?</p><br/><p>This acting was impossible in the entertainment industry!!</p><br/><p>Director Wang finally understood why Ming Yu looked so awkward when he asked “Do you want to enter the entertainment industry?” It wasn’t a matter of pressure! It was because he was a pretty face!!</p><br/><p>After the second NG, Wang Yao reluctantly wanted to reprimand the young man. But before he spoke, the beautiful youth came over with an ashamed expression and sincerely said, “Director Wang. I’m really sorry. I am using this period of time to figure out the feeling, and it is disturbing your progress.”</p><br/><p>Wang Yao, “…”</p><br/><p>Disturbing the progress wasn’t the problem!</p><br/><p>Other people had NG more than a dozen, even 20 times. However, this was a simple ‘smile like a child’ so when would it end? You tell me!!!</p><br/><p>Wang Yao was depressed, but all his anger vanished the moment he saw this sincere face. Such a beautiful child, he also had the good attitude to apologize.</p><br/><p>Ah forget it, Wang Yao really couldn’t be angry when seeing this face.</p><br/><p>To the side, Luo Ru was stunned. Ming Yu had given her a preventative shot by always stressing that his acting skills were really bad. However, Luo Ru just thought that Ming Yu was joking.</p><br/><p>You know, this youth was really too modest!</p><br/><p>He had a first-class typhoon level catwalk, and a huge momentum when taking photos!</p><br/><p>This youth was so good, how could his acting be bad?</p><br/><p>Now Luo Ru had a true view of Ming Yu’s skills. She hurriedly sent a text message to Zhao Rui: 【 Brother Zhao, when negotiating the MV, please be sure to minimize the drama scenes! Please!!! 】</p><br/><p>Zhao Rui who didn’t know anything, “….?”</p><br/><p>Of course, Ming Xiaoyu’s acting was a bit poor, but it wasn’t so bad as to keep getting NGs on ads with no lines. After a few takes, Ming Yu was in a good state (probably a warm-up state for an ordinary actor) and no longer got any NGs. He passed a few scenes.</p><br/><p>By the time it was lunchtime, Ming YU had filmed all the solo shots. At this moment, the crew members were ready to eat while also waiting for the actress, who didn’t appear from 8 a.m. to 1 p.m.</p><br/><p>It took a full two hours.</p><br/><p>At 15:04, the second-tier actress finally arrived at the studio carrying a small purse. Ming Yu no longer cared about his image, and was squatting in a corner to carefully study the script and figure out what type of expression he should take when playing opposite the actress.</p><br/><p>The moment the actress entered, her assistant gave a small cake to all the staff at the scene, with Luo Ru taking two.</p><br/><p>“Brother Wang, I’m really sorry! You know, it takes one day to go one block in the capital! I thought I was going to collapse coming from the Second Ring Road. Has everyone had afternoon tea? I’ll buy you tea as an apology!”</p><br/><p>Wang Yao nodded with a sneer. “Well, go to make-up first. We have been waiting for you for a long time. Now there are only the scenes with you and the actor.”</p><br/><p>While talking, Wang Yao turned to look at Ming Yu in the corner, causing Yang Lala to also follow his gaze. From Yang Lala’s point of view, she could only see a vague figure squatting (Ming Xiaoyu thought this posture inspired him) and shook her head with dislike, then headed to make-up.</p><br/><p>Once Yang Lala finished, she walked out and saw a beautiful man whose whole body looked like it was shining!! —These were Yang Lala’s exact words.</p><br/><p>Ming Yu was currently looking down and chatting to Luo Ru about something. Yang Lala looked at him with glowing eyes, before coming up to Wang Yao and asking with an embarrassed expression. “Wang… Brother Wang, did you change the actor? This man looks so good, much better than the one you pointed out before!”</p><br/><p>The confused Wang Yao, “…Ah? What did you say?”</p><br/><p>Yang Lala immediately shook her head with a shy expression. She held her red face and moved to the filming area, leaving a surprised man behind. Wang Yao touched his head and whispered, “Is Yang Lala crazy? What change in actors? She wants a change?”</p><br/><p>Yang Lala was a popular Shuyue Lemonade spokesperson. She debuted two years ago as female idol number two in a drama. Originally, even the producers didn’t have high expectations for the idol drama that had a low cost. However, it turned out to be a hit and the people involved became popular.</p><br/><p>Yang Lala’s acting was good and she was also pretty, so she became a big name. Her family had a little money and she was also a rising star in the entertainment industry. Thus, when she was late today, Wang Yao couldn’t say anything because this Shuyue Lemonade was Yang Lala’s own product!</p><br/><p>Yang Lala approached Ming Yu, who looked down at her.</p><br/><p>Yang Lala… she wasn’t tall. Her height of 160cm meant that Ming Yu really had to bow her head to see her. However, her appearance was good and she had a sweetness that was the trend lately, so she was popular with the public.</p><br/><p>Ming Yu smiled gently when he saw Yang Lala and spoke in a gentlemanly manner. “Hello Yang Lala, I am Ming Yu. I will be working with you today.”</p><br/><p>Yang Lala was shy? She nodded and said, “Then Brother Ming Yu, just call me Lala. We shouldn’t be unfamiliar with each other.</p><br/><p>The 17 year old Ming Yu, “…?”</p><br/><p>The 21 year old Yang Lala, “～（≧▽≦）/～”</p><br/><p>Before filming, Ming Yu and Yang Lala exchanged a few words to become more familiar with each other. Ming Yu had met many female fans in the past so Yang Lala was… well, a little bit less extreme than them.</p><br/><p>As the two exchanged words, Ming Yu clearly perceived that the other person’s eyes were fixed to him, never moving from his body. But as soon as he looked at her, Yang Lala laughed ‘<em>hehehe’ </em>as if nothing happened.</p><br/><p>Ming Yu thought carefully and recalled that in this advertisement, the most intimate action was touching hands.</p><br/><p>He couldn’t help sighing gently at this, secretly thinking that his chastity seemed to be saved.</p><br/><p>Once the two people started filming, Ming Yu’s squatting in the corner seemed to work. He wasn’t great, but it was enough to make Wang Yao reluctantly satisfied. Yang Lala’s acting was completely natural compared to Ming YU, so there were no NGs. The filming was smooth and evening soon arrived.</p><br/><p>Today’s shooting schedule was supposed to end at 6 p.m., so it should by over. However, an hour before it was supposed to end, Ming Yu found Director Yang and spoke with embarrassment, “Director Yang, today can we shoot more scenes at night?”</p><br/><p>Wang Yao was surprised and asked, “Why?”</p><br/><p>Ming Yu replied with an awkward expression. “That… I am worried that I will take a long time to find the feeling tomorrow, wasting everyone’s time.”</p><br/><p>Wang Yao, “…”</p><br/><p>Do you really think you have found the feeling now?</p><br/><p>He was worried about how the youth would perform if he didn’t have the feeling, so Wang Yao agreed to Ming Yu’s suggestion. Yang Lala wasn’t difficult and easily agreed. Being able to stay with this handsome person for a while, it was great!</p><br/><p>Thus, the crew filmed for another hour. Then they intended to eat before starting the filming again.</p><br/><p>Luo Ru handed a hot lunch box to Ming Yu, as well as a cup of medicinal drink. Ming Yu took the box of rice and medicinal drink with a dark expression. He had just opened it to drink when Yang Lala asked him, “Brother Ming Yu, what are you drinking?”</p><br/><p>The 17 year old Ming Yu, “…Something good.”</p><br/><p>The 21 year old Yang Lala, “Ah, it really looks like a good drink. By the way, Brother Ming Yu, I haven’t added you to my friends list! Do you have anything to do after this advertisement filming is over. I heard…”</p><br/><p>The two people talked for a while. Well, it was basically Yang Lala talking while Ming Yu didn’t know if he should laugh or cry at being called ‘Brother Ming Yu.’ Ming Yu had just lifted the cup of medicinal soup with a determined expression when he heard cries of surprise from the studio’s door.</p><br/><p>Ming Yu put down the cup and turned his head in the direction of the sound.</p><br/><p>Yang Lala also looked surprising, turning her head why muttering, “Why are they suddenly crying out? What’s going on?” How dare they disturb her time talking with Ming Yu!</p><br/><p>Luo Ru stood up and said, “I will see what is going on. Just wait.”</p><br/><p>But Luo Ru hadn’t even taken two steps when she suddenly saw Deputy Director Chen nervously coming from the direction of the voices. He saw Ming Yu and hastily pulled him to the location. Along the way, he said, “Someone from Muse came to see you work Ming Yu. He came to see you, so you should go and see him!”</p><br/><p>Ming Yu jerked with surprise and asked, “Someone from the company came to see me work? Do you know who it is, Mr. Chen?” He didn’t have any good friends in the company who would come to see him work, right?</p><br/><p>Deputy Director Chen was surprised by the words and replied seriously, “Yes! He came to see you work! Do you think anyone else would make the crew so excited?”</p><br/><p>“Of course, it is Xi Ze!”</p><br/>\n</div>"}