{"title": "Chapter 40", "id": 40, "volume": 1, "url": "http://boxnovel.org/rebirth-of-a-supermodel-chapter-40", "volume_title": "Volume 1", "body": "<h1>Chapter 40</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 40</p><hr/><br/><p>Ming Yu finished shooting the lemonade ads and got a seven day holiday.</p><br/><p>However, on the first day of his short break, Ming Yu had finished washing up in the morning when he suddenly received a message from Luo Ru telling him there was a fan surge on his official website and Weibo.</p><br/><p>Ming Yu was a little surprised when he heard about it. After he logged into his account to look at the information, he understood exactly what had happened.</p><br/><p>Fei Sixin’s fashion show finished four days ago. Like many big-name fashion shows, Fei Sixin arranged for four or five cameras to be placed at different positions to film this fashion show. The video clip was completed in four days and posted last night to her Weibo account.</p><br/><p>In fact, the day after the fashion show ended, a reporter asked Fei Sixin in a television interview if it was true that she ‘invited Ming Yu to be her chief model.’</p><br/><p>At that time, Fe Sixin bluntly replied, “Yes, they guessed right. Ming Yu is a model with a very high aura! His momentum is great. His qualifications might not be that deep, but he is one of the best models I have ever seen!”</p><br/><p>This superb evaluation ignited a heated discussion online. But at the time, Ming Yu was still filming and didn’t notice. After the video and photos of the fashion show were released, a much bigger discussion occurred.</p><br/><p>The emerging photographer Lu Yue was the first to forward Fei Seixin’s microblog message, while also commenting: 【 Old Fei’s photography has always been powerful. Whether is it control of the lens of grasping a shift in the light, it is worthy of learning! In particular, this Xiaoyu is simply too good! When I see him in the light blue coat, I can’t help thinking about his beauty! Combined with Old Fei’s superb photographer techniques, this beauty is simply not human!! 】</p><br/><p>Fei Sixin published a total of eight photos and a video.</p><br/><p>Ming Yu might be the chief model of the show, but Fei Sixin couldn’t only post photos of him. So only the first of eight phots was Ming Yu, the other six were of models and the last… it was a narcissistic selfie of Fei Sixin （*￣？￣*）～</p><br/><p>In Ming Yu’s photo, the background was a dark blue sky. A tall and handsome teenager with bare feet gazed blankly at the camera. His gaze was empty, as if he didn’t know what he was doing while walking with bare feet on white feathers.</p><br/><p>There were a few light feathers in the air. They formed a silhouette around the centre of the photo, making the youth look more ethereal, a beauty that couldn’t exist in this world.</p><br/><p>The background and clothes were the same blue colour, but the former had a depressing maturity, while the latter was a naive innocence.</p><br/><p>In this young man, an adult calm and childlike innocence gathered together, making people unable to look away.</p><br/><p>【 How did Ming Xiaoyu become more and more beautiful. Ahhhhh!!!! Praise, praise, praise, praise!! Master Fei’s photography is awesome! 】</p><br/><p>【 Ming XIaoyu’s eyes are hollow and this blue coat is elegant. It makes it feel different from the make coats I have seen before. I always thought that only female coats could show this pure innocence, while a man’s coat is basically mature and introverted. How is Ming Xiaoyu actually making me feel maternal ahhhhh! My Xiaoyu, come hug your mother, kiss kiss ～～】</p><br/><p>【 Don’t cry, don’t cry. Ming Xiaoyu, don’t cry. ～～～～ 】</p><br/><p>In addition to these comments, many people on Weibo commented on the live video of the fashion show. Many well-known industry designers, fashion critics, magazine editors and photographers expressed their opinions—</p><br/><p>【 Wang Zhenchen river: Fei Sixin’s fashion show has a total of 81 works. They are roughly divided into three categories: a cape cloak, casual clothing and jackets. After all, this is a personal fashion show and Fei Sixin hasn’t established an independent label yet. Therefore, there is no obvious seasonal aspect. But based on this fashion show, I don’t think she will lose to any second-tier brand. In particular, I was impressed by the chief model Ming Yu. I especially liked his green one-shoulder cloak. The designer took inspiration from Greek mythology and showed an elf-like aspect. But the most amazing thing is that Ming Yu showed the noble indifference of an elf… 】</p><br/><p>【Li Li luoluo: Today I won’t evaluate the designer’s work. I will simply evaluate this fashion show. I really appreciate the chief model Ming Yu. He shines in his three appearances and he has an unconventional aura. I am a loyal fan of a ‘model is side by side with the clothes.’ All I can say is that Ming Yu made me notice the diamond on the corner of the cape as well as the silver pattern on the edge of the light blue coat. It is probably vines? In one word, beautiful! 】……</p><br/><p>Ming Yu went on his weibo and found that his fans had broken through 165W. (TL: I think it is 1.65 million? But not sure and went with what the author provided) It had been more than a month since he mentioned Xi Ze on Liu Chao’s Super Show’ which triggered a soaring popularity. Being able to get tens of thousands of fans in a month was rare for a newcomer.</p><br/><p>Then after Luo Ru reminded him again, Ming Yu entered his Muse official website forum.</p><br/><p>Once he entered, Ming Yu was stunned!</p><br/><p>The header at the top of the forum, the design was a bridge-like picture. There were photos of him from his debut to the present day, large and small, arranged in an orderly curve towards the end, where there was a light. Ming Yu didn’t know what this light meant, but he couldn’t help shivering.</p><br/><p>Since his rebirth, Ming Yu had been thinking of how to better develop in this industry, how to seize opportunities and climb up. He always put himself in a busy schedule, not giving him much time to talk to his fans on the forum.</p><br/><p>This effort made him more dazzling so that more people knew him, but it also made him very busy and not able to communicate with fans.</p><br/><p>There definitely had to be a mixture of both. In fact, Ming Yu didn’t know about it, but there were some fans in the beginning who complained that Ming Yu, unlike other models, didn’t come to the forum to interact with fans.</p><br/><p>But the next second, there are countless fans replying. LX: 【 Ming Xiaoyu is working hard to move forward, we will support him from behind! Ming Xiaoyu is busy. We have to encourage him and cheer for him, not drag on his hind legs! 】</p><br/><p>Later, this LZ kept replying to fans, telling everyone to wish Ming Xiaoyu well and to really like him.</p><br/><p>However, Ming Yu didn’t know about this for a while.</p><br/><p>He gazed at the distinctive header for a long time before scrolling down the phone, looking at the forum.</p><br/><p>The forum managed by Luo Ru was very good. There was a red box at the top specifically for Ming Yu to post and leave a message for fans. But Ming Yu had only made a total of three posts.</p><br/><p>He looked down further and saw that fans were excitedly discussing Fei Sixin’s fashion show. There were 30 pages of replies. Ming Yu read for 5 minutes and turned to the next page, only for there to be another discussion page.</p><br/><p>Ming Yu couldn’t help looking.</p><br/><p>【 LZ：Hey hey hey, there is a new resource! Children, move!!! 】</p><br/><p>Ming Yu: …Children? Was this a city or Mount Huaguo?</p><br/><p>【1L: 233333 New resources are really great～ I have Ming Xiaoyu’s magazine photos, fashion show video as well as ‘Liu Chao’s Super Show. I can chew on Pei Feng’s fashion show over a 100 times～～～～ New rations will make me more violent!! 】</p><br/><p>【 2L：Ming Xiaoyu is the chief model! Really great! 】……</p><br/><p>【35L：I have a new resource to add to the Ming Xiaoyu album! 】 【 36L: I’m asking for it! 】</p><br/><p>【37L：360°: I will beg on my knees for it】……</p><br/><p>Ming Yu: …What was the Ming Xiaoyu album?</p><br/><p>Eh, this was wrong! It took him so long for him to notice. Who is Ming Xiaoyu!!!</p><br/><p>Don’t blame Ming Xiaoyu for being slow. He had been so busy that he rarely looked at his microblog and forum. He just quickly swept through the information, not seeing the words.</p><br/><p>Moreover, even if Ming Xiaoyu looked carefully, he wouldn’t discover that he was called ‘Ming Xiaoyu!’ Chinese had great charm. For example, studies showed that if the order of the Chinese characters wasn’t all read the same. For example, when reading this sentence out loud, the words could become messy （╯＿╰）. Anyway, Ming Yu moved through a dozen pages and finally found out what the ‘Ming Xiaoyu’ album was.</p><br/><p>It was a series of videos produced and released by fans that put together his short video clips and TV appearances into a wonderful video story.</p><br/><p>Ming Xiaoyu hurriedly had a look and found it interesting. Seeing several of his photos side by side, it unexpectedly had a feel of acting!</p><br/><p>Was he actually improving in his acting?</p><br/><p>…Wake up Ming Xiaoyu. This was just the great editing technology that people used.</p><br/><p>After watching the video, Ming Yu went to the top post and posted a message.</p><br/><p>【 New Year is coming. Ming Xiaoyu wishes you a Happy New Year～ Recently, the weather is cold so wear more clothes! ^＿^ 】</p><br/><p>Afterwards, Ming Yu found a coat to wear, put on a pair of lambskin boots and left, not causing about the sensation that his post caused. He went downstairs and entered Zhao Rui’s car, heading towards the Muse building.</p><br/><p>It was seven days without work, so Ming Yu decided to go to the company to properly train in his acting ability. It was unlikely that he would take on too many movies or TV shows in the future, but he had to hone his acting skills to shoot advertisements or the occasional cameo.</p><br/><p>Moreover, the present Ming Xiaoyu was really confident!</p><br/><p>Look at that video just now. He could also act!</p><br/>\n</div>"}