{"title": "Chapter 41", "id": 41, "volume": 1, "url": "http://boxnovel.org/rebirth-of-a-supermodel-chapter-41", "volume_title": "Volume 1", "body": "<h1>Chapter 41</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 41</p><hr/><br/><p>The brilliant morning sun shone through the thick windows, illuminating the youth’s black hair with a faint gold. Zhao Rui had one hand on the steering wheel, while the other one handed breakfast to Ming Yu in the backseat. The car temporarily waited for the congestion to ease, leaving Zhao Rui free to say a few words.</p><br/><p>“Xiaoyu, how do you know Xi Ze?”</p><br/><p>Zhao Rui had been busy going to CX Extertainment to talk about the MV cooperation, so he had no time to talk to Ming Yu about it. Over the past few days, Luo Ru had accompanied Ming Yu to shoot the ads. Now that the project was concluded, he had a chance to talk to Ming Yu face to face.</p><br/><p>At this time, Ming Yu was drinking Luo Ru’s medicinal drink. Ming Yu had to drink at least five cups a day. The night before, Luo Ru would give him some to bring home and heat up for the next morning.</p><br/><p>Once he heard Zhao Rui’s words, Ming Yu calmly put down the cup in his hand and replied. “Brother Zhao, after we finished filming the photos for Character and went to Ruoshang, I met him in the restroom.” Ming Yu spoke fluently and smoothly. The tone was very calm, as if he was speaking the truth. “He forgot to bring some paper and the toilet paper wasn’t enough. He was very embarrassed and borrowed some paper from me when I entered.”</p><br/><p>Zhao Rui, “…”</p><br/><p>Then Ming Yu added, as if he suddenly thought of something. “Oh yes, he was very grateful to me.”</p><br/><p>At this time, the top floor of Muse.</p><br/><p>Xi Ze, “Achoo…”</p><br/><p>Ding Bo, “Eh? Do you have a cold? Xi Ze.”</p><br/><p>……</p><br/><p>It didn’t sound like a big deal. Even God Xi had to eat and do his business right? Zhao admitted that Xi Ze, this handsome and cold person also had to resolve…that problem… what was wring with that?</p><br/><p>Not having toilet paper was normal…</p><br/><p>This wasn’t right! Why did he feel like it was too fanciful!!</p><br/><p>After hesitating for a moment, Zhao Rui couldn’t help asking, “Xiaoyu, why do I feel so strange listening to you…”</p><br/><p>Through the rear view mirror, the teenager smiled slightly and revealed his white teeth. “Brother Zhao, you can ask Xi Ze. It isn’t a big deal. I believe he will tell you the truth about that time.”</p><br/><p>Zhao Rui, “…（┙&gt;∧&lt;）┙へ┻┻”</p><br/><p>He wasn’t a fool!</p><br/><p>If he really asked Xi Ze, he would be melted by the other person’s frost!!!</p><br/><p>Ming Yu insisted that this was the reason why ‘Xi Ze chose to go to my work’, and Zhao Rui couldn’t force it. In fact, Zhao Rui had been carefully thinking over the past few days. If Xi Ze was plotting something, what could Zhao Rui do?</p><br/><p>In this half year, his small model was really fierce and rose in popularity, but he could barely be countered as a first-tier model in Muse. He was more like a second-tier.</p><br/><p>Who was Xi Ze? What could Xi Ze want with his small model?</p><br/><p>Zhao Rui didn’t think much about it. He quickly exchanged details with Ming Yu about the itinerary and arrangements. Once he learned that Ming Yu was really determined to spend all seven days in the company’s acting training department, Zhao Rui couldn’t help trying to persuade him, “Can you at least rest for one day? Ming Yu, you have been really busy for the past six months. You should let yourself relax.”</p><br/><p>Ming Yu held the cup of bitter pain and drank the last mouthfuls. Then he took a deep breath and shook his head. “No Brother Zhao, I’m not particularly nervous about this training. It can be considered a type of vacation.”</p><br/><p>Zhao Rui, “…”</p><br/><p>Class=vacation to you?</p><br/><p>There was another 10 minutes of driving and the car arrived at Muse’s parking lot. The two people stopped their car in front of the familiar 17 storey building and headed to the Muse acting department.</p><br/><p>Muse might be Huaxia’s most famous modelling agency, but many of their models were also famous actors. The entertainment circle was filled with singing and excellent performances. Excellent models could be trained as outstanding actors. For many people not suitable to become models, acting was the optimal path of development.</p><br/><p>Thus, Muse could be considered half an entertainment company.</p><br/><p>Ming Yu and Zhao Rui reached the door of the training department and saw Zhou Wei Zhuo standing there, as if she had been waiting for a long time. Zhou Wei Zhuo wore a leather jacket and had her long hair tied up. She seemed to be thinner, but she smiled when she saw Ming Yu and Zhao Rui and headed straight to Ming Yu.</p><br/><p>Zhou Wei Zhuo didn’t conceal the amazed look in her eyes as she gazed at Ming Yu for a long time. “It seems like your temperament has become better.” Zhou Wei Zhuo paused and asked, “How you recently been to the company for a physical test? You should be more than 181cm right?”</p><br/><p>Ming Yu didn’t have a chance to reply as Zhao Rui laughed, “What? That is information from a year ago. A’Wei, you don’t know but Ming Yu measured his height six months ago and was 183cm. I don’t know how tall he is now.” Then Zhao Rui had a thought. “It is still early. Shall we go upstairs and test it? We can also update your information on the official website, letting Little Luo change it.”</p><br/><p>At this moment, Ming Yu’s mouth was filled with all types of milk, red beans, black beans and other ingredients. Once he heard this remark, he immediately nodded and agreed. “Yes, Brother Zhao. We should take some time to measure it.”</p><br/><p>The party quickly went upstairs to conduct a simple test.</p><br/><p>After learning that Ming Yu had grown 3cm in six months, Zhao Rui cried out happily, “18cm is good! 186cm is really good! I remember that many of the world’s top male models are 186cm, right? Ming Yu, you finally reached the average height so you don’t have to be so desperate about growing!”</p><br/><p>The very dissatisfied Ming Xiaoyu, “（╯－＿－）╯╧╧!!!”</p><br/><p>Without being aware of the sadness of his small model, Zhao Rui explained to Zhou Wei Zhuo. “A’Wei, you don’t know this but in fact, Ming Yu was 184cm, which isn’t short in this country. Then a few months ago, he suddenly wanted to grow taller.”</p><br/><p>Zhou Wei Zhuo looked at MIng Yu with interest. “Oh?”</p><br/><p>Zhao Rui continued, “Yes and then Little Luo… she is the assistant Sheng Xiang arranged for us. She gave Ming Yu a good plan to increase his height. He has to exercise every day and consume a medicinal drink, it is all arranged properly. Now you grew to the average height and don’t have to feel so anxious, Ming Yu…right?”</p><br/><p>Under the bright lights, the beautiful youth smiled and stared at his agent. The smile was very gentle and brilliant, but Zhao Rui couldn’t help shuddering when he saw the young man’s eyes.</p><br/><p>After finally stopping a certain person’s words, the three people went downstairs together.</p><br/><p>At this point, Zhao Rui and Zhou Wei Zhuo’s conversation had switched from Ming Yu to recent things that happened in Muse. Zhao Rui’s face changed slightly when they talked about Xi Ze’s fashion show early next year, but it quickly returned to normal.</p><br/><p>Zhou Wei Zhuo said, “I heard from Ding Bo a few days ago. Xi Ze is very busy these days. It seems like there is a problem with the fashion show.”</p><br/><p>Ming Yu’s pace slightly slowed as he heard this. He reacted very quickly, turning to look at Zhou Wei Zhuo. He just listened as the latter continued, “It seems that after the patterns were finished, Xi Ze wasn’t satisfied with the clothing materials selection and decided to re-customize it. Fortunately, the fashion show is still two months away. With 20~30 senior tailors working together, it should be resolved within a month.”</p><br/><p>Zhao Rui lightly nodded. “This type of thing is very serious.”</p><br/><p>Zhou Wei Zhuo helplessly waved her hand. “Ding Bo, that guy has been talking for a few days about how irresponsible Xi Ze is, wanting to wash his hands clean of Xi Ze. He ran to my place to complain for a long time. If I recorded those words and played them for Xi Ze, Ding Bo would probably die 100 times.”</p><br/><p>The remark caused Zhao Rui to burst out laughing.</p><br/><p>After a moment, Ming Yu asked in a low voice. “Sister Wei, there are many things to do for the Ji and Ya fashion show. It must be very busy right?”</p><br/><p>Zhou Wei Zhuo didn’t think too much about it and replied in a straightforward manner. “Ah, I always listen to Ding Bo and according to him, it is extremely busy.”</p><br/><p>Ming Yu nodded in response.</p><br/><p>The three people chatted as they returned to Muse’s acting training department and entered through the door. The head of Muse’s acting training department was familiar with Zhou Wei Zhuo. After saying hello to Zhou Wei Zhuo and Zhao Rui, Ming Yu was easily arranged into a class.</p><br/><p>Once it was confirmed that Ming Yu was officially enrolled in an acting class, Zhao Rui and Zhou Wei Zhuo left first. Ming Yu’s eyes narrowed slightly as he gazed at the harmonious backs of the man and woman, seemingly perceiving something.</p><br/><p>“I heard you are Zhao Rui’s model?” A female employee asked while bringing Ming Yu to the training room.</p><br/><p>Ming Yu was slightly surprised and smiled. “Ah, I have been under Brother Zhao for almost four years.”</p><br/><p>The employee nodded at the words and then said, “Don’t you think that Zhao Rui and Sister Wei’s relationship is very good? Our department is responsible for actors and isn’t very familiar with the modelling side, but I heard that your agent Zhao Rui and Sister Wei are childhood friends. He also has a crush on Sister Wei!”</p><br/><p>Ming Yu completely stopped walking once he heard this, prompting the employee to turn to him with surprise.</p><br/><p>The bright sunshine shone through the floor to ceiling windows of the Muse building, brightening the youth’s delicate face. Ming Yu shook his head lightly and calmly replied. “In fact… I feel like it is the exact opposite of what you imagined.”</p><br/><p>The youth’s chuckle caused the female employee to stay in place, not reacting.</p><br/><p>Once Ming Yu took a step forward, the employee suddenly flushed, hurriedly lowered her head and moved forward. As she walked, she whispered in her heart: Who is this Ming Yu? When did the company have such a model transitioning into an actor and why didn’t the acting department know about him? He is too handsome!!!</p><br/>\n</div>"}