{"title": "Chapter 55", "id": 55, "volume": 1, "url": "http://boxnovel.org/rebirth-of-a-supermodel-chapter-55", "volume_title": "Volume 1", "body": "<h1>Chapter 55</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 55</p><hr/><br/><p>As we all know, advertisements in commercial breaks was a cultural tradition.</p><br/><p>Then a few years ago, a notice was received: You aren’t allowed to broadcast advertisements in the middle of a TV show. This notice made many viewers excited for a long time, until they discovered ads weren’t broadcast, but the advertising time afterwards was lengthened! Who wanted to listen to ‘Receive platinum for a holiday gift’ or ‘I want Wangwang, I want Wangwang!’</p><br/><p>Therefore, most people’s response to advertisements was to turn it off!</p><br/><p>Do you think you can escape ads by watching videos on video sites?</p><br/><p>Wrong!</p><br/><p>How many people died from the video site ads, crying out, “Return the past 30 seconds of my life!” “The world is so disorderly, the China-Japanese war is imminent, come to…”, “What 30 seconds, return the 90 seconds of my life! I’m going insane!”</p><br/><p>In this case, Ming Xiaoyu’s ‘Shu Yue lemonade’ ads also appeared on major TV.</p><br/><p>On this day, Tian Xiaonan was changing the channel, intending on finding a television show among all the ads. The previous channel was playing, “As long as it is 998, as long as it is 998, you can bring how pure gold.” The next channel was “Your benefits are truly your benefits.”</p><br/><p>…Your mother, how can 998 pure gold be good!</p><br/><p>With a stomach full of bitterness, Tian Xiaonan intended to give up on the TV and return to her phone. However! The moment she pressed the shutdown button! Tian Xiaonan’s eyes widened at what she saw and she scrambled to turn on the TV again.</p><br/><p>At this moment, against the fresh background on the TV screen, a man wearing a light blue apron was smiling at the camera, handing a bottle of lemonade to the camera. His smile was warm but not too full of flattery, it was vivid and natural. The sunlight behind him gave him a halo of light.</p><br/><p>He smiled gently and didn’t speak, but Tian Xiaonan could feel her heart beating faster!</p><br/><p>“Ahhhhh!!! This is too handsome!!!”</p><br/><p>At this point, there was a scene change and Yang Lala appeared.</p><br/><p>But how could Tian Xiaonan care about Yang Lala? She shook her body excitedly and quickly grabbed her phone, shouting in her friends group: 【 You said there was nothing good on TV! But I just saw a handsome man! He seems to be someone new in the entertainment industry. I have never seen him before. He is more handsome than the small god that you like!! 】</p><br/><p>Since then, the Shu Yue lemonade advertisement spread among the general public.</p><br/><p>First of all, someone posted on a forum: ：《 Big surprise! The lemonade brother is so handsome! 》</p><br/><p>【lz：Today, I was watching ‘Half Moon’ when I saw the handsome youth in the ad! He is very handsome. I feel like his atmosphere is higher when standing together with Yang Lala! Originally, I thought he was a newcomer. But after investigating, I found that he is actually a Muse model! Lemonade brother, let me lick you =3= There is residue on my phone. I will send a picture! 】</p><br/><p>After half a day, this post shot through the roof.</p><br/><p>【 Ming Xiaoyu’s ad came out? Why didn’t I know about this? 】</p><br/><p>【 So handsome! Is his name MIng Xiaoyu? The name is so strange…】</p><br/><p>【 Hahaha. Ming Xiaoyu is a nickname. He is called Ming Yu and he is a Muse model. He was on the cover of Meditation Road a few days ago and gained the Nidelan endorsement. His height and weight… Ah, I don’t know. Chest 36 and hips… please tell!! 】……</p><br/><p>The forum post quickly reached the top 10 within 24 hours. After one hour, Weibo and Tieba also started posting and sending photos. It was high definition photos of the ‘Lemonade Brother’, so this Shu Yue advertisement was a victory!</p><br/><p>Shu Yue saw the huge benefits caused by this ad and bought an advertising space in the Weibo’s hot searches. It didn’t directly use MIng Yu as a keyword, but it was still promoting the ad, bringing Ming Yu a lot of traffic.</p><br/><p>【 How is Ming Xiaoyu’s smile so gently? It is the first time I’ve seen Ming Xiaoyu smile so gently! On the catwalk, Ming Yu is completely cold and expressionless. In magazines, he is either the elegant type or the sexy temptation type. How is the boy next door Ming Yu so beautiful!!! 】</p><br/><p>【 Doesn’t this hot guy look familiar? Ah, isn’t this my boyfriend? 】</p><br/><p>【 My husband is on the hot topics again! I want my home to be on Ming Xiaoyu Square! 】</p><br/><p>【 Nine pictures without a watermark. I want to thank My Name is Lei Fei～～～】</p><br/><p>【 Ming Xiaoyu is really healing! His acting is awesome! If only there was such a handsome person giving me lemondade! I would be able to drink 10 boxes!! 】</p><br/><p>【 Count me in for 10 boxes! 】</p><br/><p>【 I can drink 100 boxes! 】</p><br/><p>……</p><br/><p>Ming Xiaoyu saw the heated up people on the Internet and decided to strike when the iron was hot, posting a photo of himself with Shu Yue lemonade. As he saw several messages praising his acting on Weibo, Ming Xiaoyu quietly liked the individuals.</p><br/><p>This made the fans even more excited. Ming Xiaoyu was unexpectedly looking at their microblogs!</p><br/><p>…Eh? They thought Ming Xiaoyu’s acting was good?</p><br/><p>Director Wang would have a bloody face if he saw this. It was just a smile, what special acting was required?</p><br/><p>After liking four or five Weibos, Ming Yi continued looking down at his book. 30 minutes passed and he turned to the last page. He put the thick notebook down, rubbed his eyes and relaxed.</p><br/><p>At this time, Luo Ru handed over a bottle of medicinal drink. Ming Yu drank it with a dark face. Ming Yu finished the bottle and asked, “Luo Ru, have you brought it?”</p><br/><p>Luo Ru gently nodded. “Yes, I bought some dessert cake and the Starbucks downstairs will send us the coffee.”</p><br/><p>Ming Yu nodded at the words and left his lounge with Luo Ru, heading towards Muse’s actor’s training department. They were going to visit Brother Yuan and the others with coffee and cake.</p><br/><p>Ming Yu used his break time to read the notes and DVDs that Brother Yuan gathered. He felt like he really learnt a lot… of theoretical knowledge. As for practice, Ming Yu was going to take part in a MV filming in two days.</p><br/><p>The two people were talking about the MV filming itinerary as they arrived at the actor’s training department. They hadn’t yet entered the door when they found a familiar figure passing quickly in front of them, disappearing down the corridor on the other side.</p><br/><p>Ming Yu was surprised and squinted after them. Then Luo Ru asked him directly, “Isn’t that person Lu Zhenxi? I checked his data. Ming Yu, his face didn’t look that good. Are you going to see him?</p><br/><p>Ming Yu shook his head. “I don’t have anything to do with him.”</p><br/><p>Luo Ru nodded with agreement. The two people continued, but just as they were about to step through the door, they suddenly heard Lu Zhenxi’s angry voice. “Brother Zeng, you can’t do this to me! The day before yesterday, you said you would help me… I am calm, but Brother, there was nothing last month. This time, why…”</p><br/><p>Ming Yu and Luo Ru looked at each other, a hint of surprise flashing across their faces.</p><br/><p>Nothing last month.</p><br/><p>Lu Zhenxi was supposed to appear in a magazine last month, but it was gone for some reason. Now it seemed like there was an announcement of a job, only to once again be pushed off it.</p><br/><p>This made Ming Yu feel quite surprised.</p><br/><p>He had only met Lu Zhenxi for a few days. During that time, he knew that although Lu Zhenxi’s qualifications weren’t good and his appearance wasn’t first-class, it should be enough to let him become a second-tier model. His development in the fashion industry might not be good, but it might be better in the entertainment industry.</p><br/><p>Zeng Shu wasn’t a harsh agent. He would do his best to win benefits for his people.</p><br/><p>So, was Lu Zhenxi just unlucky? Losing two consecutive jobs?</p><br/><p>Ming Yu was thinking hard when he heard his name from Lu Zhenxi’s mouth. “Brother Zeng, did Ming Yu find someone to exert pressure so that I wouldn’t receive jobs? …You say that it is the PR department? But Brother Zeng, I didn’t offend anyone there…”</p><br/><p>Luo Ru frowned and said, “This Lu Zhenxi is really too much. Life isn’t black and white. You don’t have the ability to do such things, and he was the one who wronged you. This attitude and heart won’t allow him to go far in the fashion industry. It might be better for him to be ruined now than later.”</p><br/><p>Both of them were no longer interested in Lu Zhenxi’s call. They entered Muse’s actor training department and found Brother Yuan’s training room.</p><br/><p>While walking, Ming Yu said helplessly, “I really don’t have the ability to do such things. But I deserve his suspicion. Sister Luo’s words are also correct. Perhaps it is better for him to fall now.”</p><br/><p>The two people smiled and entered Brother Yuan’s training room.</p><br/><p>Brother Yuan greeted Ming Yu and A’Xue, A’Zhao and the others were also very pleased.</p><br/><p>As Ming Yu was leaving, Lu Zhenxi came through the rear door of the training room. He was surprised and then jealous when he saw Ming Yu, but he quickly concealed it.</p><br/><p>However, Ming Yu and Luo Ru already saw through his performance. After leaving the training department, Luo Ru pressed the button in the elevator and laughed. “It looks like Lu Zhenxi is the outsider. The other students get along very well. In particular, that A’Zhao is very enthusiastic and cheerful.</p><br/><p>Ming Yu smiled and nodded. “Yes, A’Zhao is a good person.”</p><br/><p>Luo Ru continued. “In contrast, Lu Zhenxi is really too narrow-minded. If you have the ability to oppress him, it is normal for him to doubt you. But you don’t have the ability, even Brother Zhao doesn’t. Yet he dared to pour dirty water on your head? God probably couldn’t stand it anymore and made him unlucky.”</p><br/><p>Luo Ru spoke these words, but Ming Yu didn’t answer. His eyes widened, like he suddenly understood something.</p><br/><p>The elevator stopped and the door opened. Luo Ru went out but she found that the youth didn’t follow. Luo Ru asked with surprised, “Ming Yu, why aren’t you coming out?”</p><br/><p>Inside the elevator, the beautiful youth smiled at her. “Sister Luo, I suddenly remembered that I have one thing to do. I will be back in an hour.”</p><br/><p>Luo Ru could only watch with astonishment as Ming Yu closed the elevator door. For the next dozens of seconds, the floor number of the elevator kept going up and up, until—</p><br/><p>It suddenly stopped at the top floor!</p><br/>\n</div>"}