{"title": "Chapter 65", "id": 65, "volume": 1, "url": "http://boxnovel.org/rebirth-of-a-supermodel-chapter-65", "volume_title": "Volume 1", "body": "<h1>Chapter 65</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 65</p><hr/><br/><p>The March issue of Character, it initially wanted to pursue stability.</p><br/><p>March was the third month of the year. It didn’t have New Years, which occurred in the first month, or Chinese New Year in the second month. The big-name fashion shows had even ended by the time march arrived.</p><br/><p>March was a stable month. Apart from the world’s supermodel rankings would could bring excitement and surprise to the fashion industry, there wasn’t anything really special.</p><br/><p>Tao Qin’s proposal of the arrogant magazine cover was the most common in the fashion industry. The basic standard was the slightly raised jaw, the looking down position and the slowly lowered corners of the mouth.</p><br/><p>Pursuing stability?</p><br/><p>Okay, then use the most traditional style!</p><br/><p>Tao Qin’s position in the industry was very high, meaning that Character gave full power over the cover to her. She decided on the style of the set and the colours.</p><br/><p>Ming Yu didn’t complain while listening to her words. But after a moment, he asked, “Sister Qin, can I speak for a moment?” Tao Qin nodded in agreement and Ming Yu continued. “Sister Qin, your choice is very safe and secure. But according to my knowledge, Lanka has invited the Alan group to shoot this issue’s cover. Their style is very similar to yours.”</p><br/><p>Tao Qin was startled by Ming Yu’s words.</p><br/><p>The very smart Luo Ru quickly went on her Ipad and found the relevant Weibo before delivering it to Ming Yu. Tao Qin looked at the screen and saw the photo that was uploaded just an hour ago! Lanka had published the cover of their March issue, receiving a lot of praise.</p><br/><p>In this photo, the cover was Alan, the group that sold a million singles!</p><br/><p>It was common to invite actors and singles to act as cover models. The Alan group, two cool and handsome boys were dressed in hippie punk clothes and started grimly at the camera with an aristocratic atmosphere.</p><br/><p>Don’t blame Tao Qin for not knowing about the cover of Lanka. These photos had been released an hour ago and Ming Yu coincidentally saw the photo. At the time, he had changed his clothes and was finishing his makeup.</p><br/><p>Originally, Ming Yu felt like his clothes and makeup had some similarity to Lanka. But after listening to Tao Qin, he finally understood. This bold photographer had the same train of thought as Lanka!</p><br/><p>This was common in the industry and it wasn’t a big deal. However, Tao Qin was hesitant. She carefully searched through the wardrobe, thinking about what style she should shoot the cover. But it was a vicious cycle. She couldn’t forget the cover of Lank that she just saw.</p><br/><p>Ming Yu watch Tao Qin try and select clothes. The youth had elegant and clean makeup on his face, faint eyeliner around his eyes, giving him the atmosphere of an aristocrat.</p><br/><p>After watching Tao Qin for 10 minutes, Ming Yu finally sighed. The sudden crash of inspiration was a real headache for a young female designer.</p><br/><p>At this time, Tao Qin suddenly picked up a white broken fringed jacket and turned to Ming Yu with surprise. “Ming Yu, what do you think about this one? I just found out that your skin is very white. We can completely change the style! We will use the style of a snow castle, Pale, decadent, cold and barren. How about this?”</p><br/><p>Ming Yu originally intended to come forward and help Tao Qin with ideas. After hearing these words, he jerked with surprise and looked at the clothing in Tao Qin’s hands.</p><br/><p>Suddenly! A pure white image appeared in his mind. After a moment, Ming Yu smiled and nodded. “Sister Qin, your creativity is great!”</p><br/><p>Sometimes, inspiration was sparked by anxiety and tension.</p><br/><p>Tao Qin picked out several clothes for Ming Yu and waited for Ming Yu to put them on. Sister Zheng was waiting for Ming Yu in the dressing room, but suddenly became shocked.</p><br/><p>If she hadn’t seen it with her own eyes, she wouldn’t understand how this youth could be so suited for white!</p><br/><p>The sleeves intentionally had holes so the youth’s white wrists were revealed. The neckline was quite open. It was high at the clavicle to make it seem more fragile, then sunk down to give the clavicle a mysterious shadowed charm.</p><br/><p>Sister Zheng hesitated for a moment before helping Ming Yu dye his hair with a one-time colour.</p><br/><p>Ming Yu’s hair colour was quite light, so any colour was quickly presented on the hair. Once his hair turned silver, it made the white skin look even more transparent!</p><br/><p>What was the feeling of snow?</p><br/><p>It was cold and lonely.</p><br/><p>It was a world of only white, so white frost covered the youth’s long eyelashes and even his lip colour was pale. This makeup was very laborious, causing the skilled Sister Zheng to spend nearly 40 minutes adjusting all the details.</p><br/><p>The moment Tao Qin saw Ming Yu, it was like she saw him for the first time. She was ecstatic as blood surged excitedly through her body.</p><br/><p>This was the idea she wanted, but she never thought that the youth could make her idea so real! This was before the shooting, so Tao Qin could only guess how dazzling this youth would be in front of her lens!</p><br/><p>This afternoon, the ‘click click click’ shutter sound kept ringing out in the studio.</p><br/><p>In the middle of the lens, the youth was sometimes sitting on a cold throne or sometimes standing against a pale background. Sometimes he would pick up a token and sometimes he wore a crown on his head.</p><br/><p>But without exception, there was no happy expression on his face.</p><br/><p>There was only a frozen cold that filled the youth’s eyes. Even when his lips were slightly curved, no warmth could be felt. He was the snow king cast aside by the world. No one knew of his existence, but his world was full of desolate snow.</p><br/><p>“Yes! Look at me again, that is the look!”</p><br/><p>“Put your finger forward a little more, great!”</p><br/><p>“That’s it, that’s it!!”</p><br/><p>“Another one!!!”</p><br/><p>……</p><br/><p>While Tao Qin was shooting in a lively manner, Character’s chief editor, Chen Rongchen entered the studio. She didn’t allow the staff to disturb the shooting. She just stood watching and chatting with the assistant photographer.</p><br/><p>Chen Rongchen’s eyes were tricky. Before becoming an editor for Character, she was a first-class stylist. She smiled quietly, her gaze fixed on the youth in the middle of the studio for a long time.</p><br/><p>The once famous stylist, Chen Rongchen looked at the boy with deep and complex eyes. After a long while, her lips curved and she left the venue without speaking.</p><br/><p>But Chen Rongchen happened to leave during a gap in the shooting. The youth had just finished a posture and turned her eyes to look at her.</p><br/><p>There wasn’t a profound meaning. Ming Yu just looked at Chen Rongchen’s back before continuing the photo shoot.</p><br/><p>What would happen when a good model got together with a good photographer?</p><br/><p>Ming Yu had taken many photos, whether it was for magazines, advertising posters or even fashion shows. He thought that the best photographer he worked with was Fei Zhennan.</p><br/><p>But after that, Tao Qin could be ranked first.</p><br/><p>The female photographer was extreme sensitive to fragile beauty and was able to extract some stunning moments from the model’s subtle body movements. Even Ming Yu was amazed when he saw the photos.</p><br/><p>A photographer who could shoot this type of pale beauty, Tao Qin was the first one Ming Yu had seen.</p><br/><p>Tao Qin was very happy about being able to shoot such beautiful photos. She took the initiative to invited Ming Yu to dinner to celebrate the smooth shooting. Unfortunately, Ming Yu had to prepare for his reality show shooting in a few days and had to refuse.</p><br/><p>They exchanged contact information and added each other’s Weibo. Then Ming Yu left first, while Tao Qin stayed in the studio to carefully study and pick the photos.</p><br/><p>In the middle of the night, Tao Qin unexpectedly came up with more creative ideas. Thus, Ming Yu headed to Character’s studio again the next day to take some more photos.</p><br/><p>The two days of shooting made Tao Qin a loyal fan of Ming Yu.</p><br/><p>“Last night, I went to your Muse official website. Your fan forum management is very good, I suddenly obtained a lot of resources! Must become a fan! Ming Xiaoyu, can you give me a signature?”</p><br/><p>Ming Yu faced Tao Qin with a dumbfounded expression and signed his name. Then Tao Qin said, “These photos today are even better than the ones taken yesterday. Among the models I have seen, you are the one with the most aura. I took some posters for Luo Cheng last year and you are better than he is! Ming Xiaoyu, I will be cheering for you! Once you become more famous than Luo Cheng, your signature will be worth a lot of money.”</p><br/><p>A person’s shadow suddenly flashed through Ming Yu’s brain at these words. He couldn’t help asking, “Sister Qin, how much do you think Xi Ze’s signature would sell for?”</p><br/><p>Ming Yu just casually asked the question. Who would’ve expected the ‘Just became Ming Xiaoyu’s fan’ Tao Qin to suddenly stand up with excited eyes. “How much money? God Xi’s signature is priceless! I will need a lot of money!!!”</p><br/><p>Ming Yu, “…”</p><br/><p>You just said you were Ming Xiaoyu’s fan. Changing your man so quickly…</p><br/><p>Having said that, when Ming Yu met a certain man downstairs in the Muse apartments, he really felt like this beautiful and elegant man had a hateful appearance.</p><br/><p>Xi Ze perceived the youth’s depressed expression He gently raised an eyebrow as he looked at the youth’s silver hair and said, “Today I was going to help you practice your handwriting again. After running into you by chance, I think that today is a good day to call in that favour you owe me.”</p><br/><p>Ming Xiaoyu, “Σ（°△°|||）!!!”</p><br/><p>Excuse me!</p><br/><p>What was the favour he owed Xi Ze?</p><br/><p>The answer was braised lion’s head, boiled meat, crystal shrimp, sweet and sour pork, which equalled to—</p><br/><p>Ming Xiaoyu, dead.</p><br/>\n</div>"}