{"title": "Chapter 79", "id": 79, "volume": 1, "url": "http://boxnovel.org/rebirth-of-a-supermodel-chapter-79", "volume_title": "Volume 1", "body": "<h1>Chapter 79</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 79</p><hr/><br/><p>The Muse apartments were built specifically for the models. The security features were excellent and the design and construction of the building was also very good. The most important thing was that the rent of this apartment was very low in the capital. It was like big benefits falling from the sky.</p><br/><p>Of course, this was the benefit that Muse provided to their models.</p><br/><p>However, as long as these models made money, they would buy a house elsewhere and move out.</p><br/><p>Ming Xiaoyu didn’t know other people’s reasons, but he had two. First, places near the company were too expensive, Thus, this apartment was very far from the company and it wasn’t convenient when going to the company. Secondly, the location of this apartment was average and it wasn’t a bustling area.</p><br/><p>Zhao Rui listened to Ming Yu’s words and agreed to start looking for a house for him. Speaking of something really sad, Ming Xiaoyu had been working hard for more than half a year, yet he still couldn’t buy a house in a good location in the capital. He could only pay the down payment and slowly clear the debt…</p><br/><p>Ming Yu’s savings had always been managed by Luo Ru. After hearing from Luo Ru that his savings could only buy him an apartment in the third ring… Ming Xiaoyu’s brain first thought about a certain man’s calm and cold face, as well as the sentence—</p><br/><p>‘I have a villa in the third ring.’</p><br/><p>Wicked rich people!!</p><br/><p>Ming Yu decided not to worry about these things. He had Zhao Rui and Luo Ru look around, making sure to buy a place in a good location at the best price. On the other hand, the March issue of Character was officially released.</p><br/><p>It had been more than a month since Ming Yu took the photos. However, Character insisted on postponing the March issue until the end of their fashion show. Thus, it was only now that the issue was published for the public.</p><br/><p>In the large and small bookstores, the kiosks across the countries, the hands of many office workers and students, this thick magazine of Character could be seen everywhere. Yes, Ming Xiaoyu was on the main issue of Character, not a sub-publication.</p><br/><p>Originally, Character planned to have him be the cover for their jewellery issue. However, after the photos were taken, Editor Chen Rongchen pressed down on all the voices expressing doubts. Ming Xiaoyu would be the cover of this issue.</p><br/><p>“If this issue can’t sell 100,000 copies, I will bear all the responsibility!”</p><br/><p>Chen Rongcheng didn’t have Ming Yu’s amazing memory. She knew that in the past year, very few fashion magazines sold 100,000 copies. The last one was the big dark house, the second-tier magazine Meditation Road. Meditation Road used Ming Yu as their cover during this period, but the reason for selling so many copies was attributed to the first-class management methods of their marketing department.</p><br/><p>Four types of posters received randomly, how could this idea hurt them?</p><br/><p>Character didn’t match Meditation Road in marketing, but Chen Rongchen was confident that this issue could sell more than 100,000 copies. Later, there was a deputy editor who advised Chen Rongchen not to speak so rashly. However, Chen Rongchen just told him calmly, “I believe in the cover.”</p><br/><p>What was the first thing a person saw when looking at a fashion magazine?</p><br/><p>It was naturally the cover.</p><br/><p>Once this issue of Character was on the market, people across the country first noticed the handsome youth who was like a fairy.</p><br/><p>He lay without any strength on the clear and white snow, wearing a fringed white linen one piece. The cuffs and collar were worn and ragged and the boy was dressed in simple clothing. The clear and clean eyes stared at the world outside the magazine.</p><br/><p>The whole picture was a pure white.</p><br/><p>The youth’s silver hair seemed to be messy because of the wind, but it was a beautiful chaos. Snow clung to his long lashes and delicate eyebrows. The white, sparkling snow staining his clear eyes was the most touching sight in this scenery.</p><br/><p>When a person first saw the photo, they couldn’t completely describe in words the feelings contained in this photo.</p><br/><p>The young man was curled up in the snow but his eyes contained infinite hope.</p><br/><p>Philosophers who saw this photo first responded with ‘death and light.’ Those who knew photographer saw it and first through of ‘the use of light and shadow.’ A person who paid attention to fashion would think that ‘Character has changed a lot in this period.’ As for the Outward Appearance Association…</p><br/><p>“Ahhhh, Ming Xiaoyu became even more beautiful! I want to lick his collarbone, lick his collarbone!”</p><br/><p>“I’ll give the collarbone to you. I want to lick his fingers!!”</p><br/><p>“Ming Xiaoyu’s hair is really white! I can’t decide between the collarbone or the fingers!!!”</p><br/><p>……</p><br/><p>Character’s March issue sold 28,000 on the first day. This sales volume wasn’t bad for Character, but everyone knew that the sales on the first day were the most. It was at least ten or twenty times larger than the sales on the next few days. Thus, wanting to reach 100,000 sales on the basis of 28,000 was simply a fantasy.</p><br/><p>The other editors of Character felt it fell below their expectations. But on the second night, the sales feedback reported a number that they all couldn’t believe. “30,000!”</p><br/><p>Everyone, “∑（っ°Д°；）っ!!”</p><br/><p>30,000?</p><br/><p>30,000!!!</p><br/><p>Was this really right? It wasn’t 3,000 but 30,000?</p><br/><p>Compared with her panicked men, Chen Rongchen calmly sipped her coffee and said, “You must know that the core of a fashion magazine is the cover. If the cover can attract people and express a state of mind, the magazine is destined for success.”</p><br/><p>Yes, many readers of Character who bought the magazine on the first day might’ve been really attracted by the cover and appreciated the beauty of the photo. But once they took the magazine home and read through it, their feelings went through some wonderful changes.</p><br/><p>In addition to the cover photo, there was also a single interview with him in the middle of the magazine.</p><br/><p>The magazine asked him several questions and Ming Xiaoyu answered in a way that was quite humourous, causing the readers to laugh and attract attention from passersby. At the same time, in the interview section, there were several or eight photos of Ming Xiaoyu along the same theme.</p><br/><p>If the first photo on the cover caused the readers to be excited by the stunning beauty, the next few few photos made them completely forget they were photos. The readers were completely immersed in the youth’s clear but deep eyes.</p><br/><p>The white snow and the youth. This young man could make the white snow purer. He was like a silver-white elf, or a prince sealed by snow and ice. He waited for the day when spring would come and break the ice and snow.</p><br/><p>It was really beautiful. Both the model and the photographer’s techniques elevated this set of photos to the most beautiful level.</p><br/><p>Ming Yu once said that Tao Qin was one of the most outstanding photographers he had worked with, except for Old Fei.</p><br/><p>In particular, when it came to expressing a sad, fragile and noble body, Tao Qin’s quality completely surpassed Old Fei. She used her unique feminine vision to dig out the unique beauty of the youth, while amplifying this thin beauty. Finally, a beautiful and dazzling photo was formed.</p><br/><p>Even Ming Yu couldn’t help finding Tao Qin to ask for a full set of these photos to keep at home, let alone the readers.</p><br/><p>In particular, one reader who didn’t wish to be named had already draw two images of Ming Xiaoyu’s silver hair. Now that he saw the complete makeup and clothing of Ming Xiaoyu, this unknown reader was greatly surprised and made his agent buy 500 copies!</p><br/><p>That’s right!</p><br/><p>It was 500!</p><br/><p>He directly emptied out the stock of two bookstores.</p><br/><p>But the next day, the same reader who didn’t want to be named waved his hands and bought 500 more!!</p><br/><p>Ding Bo asked, “Why are you buying so much of the magazines. Do you intend to stick them on the wall or are you really going to take a bath with them? Ming Xiaoyu will keep shooting magazine photos. if you keep buying them, you won’t be able to fit them in the warehouse of your villa! （╬￣￣）”</p><br/><p>The reader who didn’t want to disclose his name pondered for a moment. Finally, he solemnly said, “Help me buy another house.”</p><br/><p>Ding Bo, “（⊙⊙）!!! ” What did he mean, what did he mean? He wanted to buy a house to exclusively store magazines of his muse? Ding Bo suddenly had a thought. “Wait! What type of person is Ming Yu to you? You already get along with him, Xi Ze!”</p><br/><p>The handsome and elegant man stared at his overwhelmed agent calmly. Then he raised an eyebrow and said, “He is my life, a person I must seize.”</p><br/><p>At the same time, Ming Xiaoyu visited Zhao Rui who had found a new place for him.</p><br/><p>Originally, Ming Yu thought that finding a house with a good location and was cost-effective was something that Luo Ru would do well. He didn’t expect that Zhao Rui’s efficiency was so high that it took him only two or three days to find a fairly good apartment.</p><br/><p>This apartment hadn’t been decorated yet. However, the owner had to go abroad and wanted to quickly sell it.</p><br/><p>Ming Yu checked all corners of the house and confirmed there was no problem. He signed the transfer contract and asked the lawyer to read it before transferring half of the house money to the owner. The rest of the balance would be paid within the next year.</p><br/><p>“It is really liberating…”</p><br/><p>Looking at this bright and spacious apartment, Ming Xiaoyu smiled like he was already seeing his future home.</p><br/><p>Well, in order to own a home, this temporary liberation was worth it.</p><br/><p>…Don’t let Ming Xiaoyu know that one of his readers, who didn’t want to disclose his name, directly bought a house just to store Ming Xiaoyu’s magazines. If Ming Xiaoyu knew this, he was afraid that he would throw his own magazines into his partner’s face while scolding angrily, “You are the one causing the prices in the capital to soar! You are provoking the house prices!! Man, you have stirred up the fire!!!”</p><br/><p>Alas, the wicked rich people.</p><br/>\n</div>"}