{"title": "Chapter 75", "id": 75, "volume": 1, "url": "http://boxnovel.org/rebirth-of-a-supermodel-chapter-75", "volume_title": "Volume 1", "body": "<h1>Chapter 75</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 75</p><hr/><br/><p>After returning to Huaxia, Ming Yu realized how much of a sensation the Nidelan promotion had caused.</p><br/><p>Ming Xiaoyu had just stepped off the plane and into the airport. When he looked up—</p><br/><p>Do you think that Ming Xiaoyu saw his own oversized airport poster?</p><br/><p>Wrong!</p><br/><p>It was the usual fog and haze of the capital.</p><br/><p><em>Cough. </em>Ming Xiaoyu passed through the smog in the airport corridor and officially entered the airport. Ming Yu and Luo Ru weren’t far from the luggage collection place when they saw a large poster hanging in the airport’s publicity centre. Ming Xiaoyu on the poster had white hair, looking really fresh.</p><br/><p>This was the first time since coming to this world that Ming Yu had contact with his fans.</p><br/><p>Luo Ru had released some of his latest itinerary on Ming Yu’s Muse fan forum. According to Luo Ru, Ming Yu was just starting to become popular. It was a legitimate popularity, but it wouldn’t be good if they didn’t handle this unexpected surge in popularity properly. It meant he needed to carefully maintain his relationship with his fans.</p><br/><p>The number of fans who came to pick him up today wasn’t small. Ming Yu thought it wasn’t a big deal and signed autographs for more than a dozen fans. Other fans wanted a signature, but they saw that Ming Yu had been flying for so long. Ming Yu’s eyes were red because of tiredness, he wore a mask and was constantly coughing. Thus, the fans gave up.</p><br/><p>“Ming Xiaoyu, you have to take care of yourself! The capital’s air isn’t as good as an island. The haze can be serious!”</p><br/><p>…Hey this girl, saying such things about the capital, the capital will start crying.</p><br/><p>“Have you eaten? Ming Xiaoyu, you need to eat more!”</p><br/><p>…Don’t you see that Ming Xiaoyu is recently lacking exercise and has gained weight?</p><br/><p>“Ming Xiaoyu, I really like youuuuuu! Son, you must be good!!”</p><br/><p>…Wait, boyfriend fans and husband fans were no problem. This girl was only in her 20s, why is she a mother fan!!</p><br/><p>Before Ming Yu prepared to leave, he smiled and greeted all the fans, and tried to take photos with them. Finally, he bowed to everyone and said sincerely, “Thank you for your support. My body is a bit uncomfortable today and I will go first. Please pay attention to road safety. If you need a signature, give your address to the staff. I will try to send a signature to everyone.”</p><br/><p>Once he spoke these words, the audience became heated up again.</p><br/><p>“Ahhhhh!!! Ming Xiaoyu, why are you so well-behaved? You must feed yourself!”</p><br/><p>On the way back to the Muse apartment, Ming Yu carefully observed the various advertisements on both sides of the road. The road that Lu Ruo took was one of the city’s main roads. There was often a variety of colourful advertisements on both sides. After carefully looking for a long time, Ming Yu came up with a piece of information—</p><br/><p>For every 10 advertisement boards, there was at least one of his own ‘Nidelan.’</p><br/><p>Luo Ru smiled while driving and said, “This time, the promotion was done very well. Listening to Brother Zhao, it seems that Nidelan has placed advertisements in many magazines and the outdoor advertising coverage in the country is quite high. I heard that the script for the film and television commercial has been almost completely written and they are discussing with the director. It is estimated that you can soon go and shoot the dynamic advertisements.”</p><br/><p>Ming Yu guessed that this Nidelan endorsement had achieved good results, but he was still secretly surprised when he listened to Luo Ru.</p><br/><p>Luo Ru wasn’t someone with shallow eyes. For her to say that the ‘coverage rate is quite high’, it showed that the publicity was really well done.</p><br/><p>The phenomenon that Ming Yu had just seen was proof that Nidelan’s promotions were a resounding victory, achieving an unexpected result.</p><br/><p>Ming Yu looked at the bright and dazzling anti-aircraft gun advertisement that disappeared behind the car and shivered, seemingly perceiving something. He licked his thin lips but didn’t speak.</p><br/><p>The car smoothly drove on the road, the fascinating night lights giving the capital its wonderful night scenery.</p><br/><p>“Xiaoyu, this time go home and rest. You still have a cough, so keep warm and don’t catch a cold.” Luo Ru told him while holding onto the steering wheel. “Tomorrow I will cook some soup and send it to your apartment. I will also give you cold medicine and other things. You must pay attention to your body.”</p><br/><p>Ming Yu couldn’t refrain from coughing twice when Luo Ru said this, causing her to frown.</p><br/><p>Ming Yu was escorted to the door of his home. Luo Ru was a girl and Ming Yu didn’t want her to help with his luggage. However, Luo Ru simply helped Ming Yu bring up two bags before saying, “In the future, you will be very busy. Take this time to rest, Xiaoyu.”</p><br/><p>Ming Yu saw the other person’s earnest appearance and couldn’t help laughing. “Yes Sister Luo, I’m really not a child. I can’t adapt now that you are suddenly treating me as a child.”</p><br/><p>But Luo Ru earnestly replied, “A sick person has a temperament like a child. By the way Xiaoyu, aren’t you only turning 18 in another month?”</p><br/><p>Young child Ming Yu, “…”</p><br/><p>Finally, Luo Ru was sent away and Ming Yu entered his home. He washed his small amount of luggage and hurriedly lay in bed to rest.</p><br/><p>It was probably a good rest. In the next few days, Ming Yu’s condition didn’t worsen. However, the itchiness in his throat didn’t leave and he couldn’t help coughing.</p><br/><p>Since he wasn’t completely sick, Luo Ru and Zhao Rui couldn’t stop Ming Yu from working.</p><br/><p>It was hard to have a one-month holiday and Ming Yu naturally had to finish the things he didn’t have time to do before. For example, he would read the letters from fans and if possible, he would post replies to some of the fans on the forums.</p><br/><p>Most of the letters from the fans expressed their love for Ming Yu. Some fans were literary and articulate. They used words that he could barely read and had to look up in the dictionary. Some fan letters made MIng Xiaoyu laugh, blush or so angry that he refused to reply.</p><br/><p>For example—</p><br/><p>【 Ming Xiaoyu, I ate mushroom dumplings today! They were delicious. Ah, I’ll draw a picture for you. It is like this→→→ [/picture] The small shiitake mushroom is delicious. Do you see the picture I drew for you? Isn’t it cute? 】 The picture attached to the letter was of Ming Xiaoyu dressed in a small shiitake mushroom doll, crouching in a corner. His mouth said, “In the spring, we plant small~ mushrooms, which can be harvested in autumn. A group of small~ mushrooms!”</p><br/><p>Ming Xiaoyu, “（┙&gt;∧&lt;）┙へ┻┻ I can’t understand what you are saying, humph!</p><br/><p>At the time of seeing this picture, Ming Yu’s throat was itchy and he was ready to cough. However, this cough didn’t emerge. He directly choked on his saliva when he saw the ‘mushroom corner image.’</p><br/><p>Why was it that seven out of 10 letters called him small mushroom!</p><br/><p>The way that he pondered the script, ordinary people couldn’t learn it even if they wanted to!</p><br/><p>February ended and on the first day of March, the first world supermodels list for 2017 was finally released.</p><br/><p>There were almost no changes from the past. The top 10 of both lists were still the same people, and even the top 20 didn’t have any day horses. Xi Ze was still 1st on the men’s list and Cecilia was still 1st on the women’s list.</p><br/><p>Apart from the 5th ranked female supermodel falling three places to become 8th, the top of the world’s supermodel rankings was stable.</p><br/><p>In the second half of the rankings, there were some minor changes. A Belarusian male supermodel suddenly emerged, rising from 91st place to 77th place, becoming the biggest black horse in the current rankings.</p><br/><p>Ming Yu had some understanding of this person. The other person was 19 years old and just endorsed a few big names. He also recently participated in a few high-end fashion shows. His personal conditions were good and he had good strength, making him popular.</p><br/><p>On the other hand, Ming Xiaoyu’s name might not be on the world’s supermodels list, but in the past few days, the number of fans on his official Muse website broke through the one million mark! Out of more than 200 models, he was the 29th most popular model!</p><br/><p>Ming Xiaoyu’s fan number rose really quickly during this six month period. Even a monkey wasn’t so fast!</p><br/><p>In particular, there was a surge in the number of fans every time Ming Xiaoyu’s work was published, whether it was a magazine photo shoot or TV commercial. In particular, in just two weeks after the Nidelan perfume posters came out, Ming Yu’s fans increased by hundreds of thousands!</p><br/><p>Zhao Rui stared at the data for a long time and said emotionally, “I remember when Xiaoyu’s official website reached 100,000 fans. I was really pleased. Why is it now that it reached one million, I feel like it is still too little?”</p><br/><p>Ming Yu was looking down at a four-frame cartoon sent by a fan and didn’t answer Zhao Rui’s question. He just listened as Luo Ru explained, “Brother Zhao, Xiaoyu’s popularity has just started to rise. The fan number won’t end here. For example, Cheng Su has an inexplicably large number of fans. According to his normal ranking in the company, he can even be ranked 10th!”</p><br/><p>Zhao Rui agreed as soon as the name was mentioned. “Yes! I don’t know where this kid could suck up so many fans. The number is more than many supermodels in other companies.” Zhao Rui turned to Ming Yu and said, “Xiaoyu, let’s not worry. Six months ago, your number of fans was one-fifth of Cheng Su. Now it is only one-eighth! We are better than him!”</p><br/><p>After a moment’s silence, Ming Yu raised an eyebrow. “So, one fifth of 100,000 is five million and one-eightth of one million is eight million? Brother Zhao, your maths is really cough…cough…”</p><br/><p>The youth gave up halfway as he started coughing.</p><br/><p>Luo Ru hurriedly rushed to pour him some hot water and Zhao Rui helped pat Ming Yu’s back.</p><br/><p>Looking at the youth coughing until tears came out, Luo Ru was distressed and exclaimed, “Xiaoyu, hurry home and rest! It has been a week and your cough hasn’t improved? Have you been taking the medicine?”</p><br/><p>Ming Yu drank some hot water and slowly gasped. He shook his head and said, “I took the medicine but my throat is still a bit itchy.”</p><br/><p>Zhao Rui made a decision and waved his arm. “Tomorrow, you won’t come to the company!”</p><br/><p>—Yes, Ming Xiaoyu really didn’t come to the company the next day, because…he was directly stuck in bed!!</p><hr/><br/><p>TL Note: Anti-aircraft gun advertisement refers to a type of outdoor billboard with a structure that is a thick steel column extending into the sky. Mainly refers to tall, eye-catching billboards on highways, highways, city roads, overpasses and other major road sections. It is shaped like an anti-aircraft gun, so the industry calls it anti-aircraft advertisements.</p><br/>\n</div>"}