{"title": "Chapter 110", "id": 110, "volume": 2, "url": "http://boxnovel.org/rebirth-of-a-supermodel-chapter-110", "volume_title": "Volume 2", "body": "<h1>Chapter 110</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 110</p><hr/><br/><p>Afterwards, Ming Yu and Zhao Rui stayed in S City for almost a week.</p><br/><p>This time, Feilu invited Ming Yu to act as their spokesperson at a film festival in S City. The film festival was purely a product of the entertainment industry and had nothing to do with Ming Yu. However, a movie produced with Feilu’s investment had been nominated in it. Thus, they sent a letter of invitation to Ming Yu. It would be the first time he was acknowledged as Feilu’s spokesperson.</p><br/><p>Before coming to S City, Ming Yu had packed his only set of high-end clothing. Originally, Feilu wanted to prepare a set for him. However, once they saw the exquisite clothing, they all agreed with Ming Yu’s decision to wear it.</p><br/><p>Ming Yu was just the spokesperson for Feilu’s Rong Zhi watch series, not their menswear. There was no problem wearing Feilu’s clothing on the red carpet, but there also wouldn’t be a problem if he didn’t wear it. All he needed to do was wear the Rong Zhi watch.</p><br/><p>The afternoon of the festival’s opening ceremony, Feilu arranged a makeup artist for Ming Yu as well as a special car to send him to the festival.</p><br/><p>Ming Yu wasn’t going for an award. It was to express one thing—</p><br/><p>Ming Yu was the latest spokesperson for Feilu.</p><br/><p>The traffic on the spacious roads was chaotic and crowded. The splendid night scenes of the city highlighted the magnificent and dazzling economic capital of Huaxia. It also showed the world its rich heritage.</p><br/><p>Located in the centre of S City, the Grand Theatre was crowded with people. The red carpet was laid out at the entrance of the theatre to meet the glamorous celebrities.</p><br/><p>There were reporters and editors waiting on both sides of the red carpet. They took photos with the SLRs in their hands and recorded the appearance of each participant. They never missed any possible headlines.</p><br/><p>Once a black Bentley arrived at the red carpet, the reporters focused as they waited for the door to open. Once the door opened, bright and shiny shoes stepped out of the car, followed by a tall and handsome young man.</p><br/><p>The reporters were stunned by Ming Yu’s appearance and didn’t have time to press the button.</p><br/><p>The first reason was that they never expected to see the new darling of the fashion circle at such an event. The second reason was that the dark brown clothing made the youth look more handsome and elegant. The movie actresses before him were inferior!</p><br/><p>Once Ming Yu walked down the red carpet, they became deeply aware of it. This was the difference between a model and a celebrity.</p><br/><p>It was true that Ming Yu’s acting was far worse than the majority of stars. It was even worse than some people with ordinary talents. However, once he walked on the red carpet, this young man was brilliant and fascinating, making the other stars appear bleak.</p><br/><p>Only a few movie stars and some big-name celebrities could contend with this youth and not be overshadowed. But the other first, second or third-tier starts were completely overcome by this youth, looking like ordinary passersby.</p><br/><p>The <em>click click </em>sound of the camera kept being heard on the red carpet.</p><br/><p>Ming Yu wasn’t at all timid as he walked on the red carpet. He was calm and steady. Sometimes he would pause for reporters to take a photo, but more often than not, he kept walking forward with a smile, leaving people staring at his elegant back.</p><br/><p>Once Ming Yu raised a hand to write his name on the signature wall, a reporter suddenly exclaimed, “Isn’t this from the latest series of Feilu watches? Rong Zhi?!”</p><br/><p>The voice was soon drowned out by the loud noises. But Ming Yu smiled calmly at the words and placed his right hand on his waist and his left hand behind him, revealing the exquisite and elegant silver watch.</p><br/><p>Once Ming Yu finished walking the red carpet and entered the venue, the camera moved away from him towards the next star.</p><br/><p>In front of the TV, many excited viewers shook their heads with regret and said emotionally, “I didn’t expect to see Ming Xiaoyu here. Why couldn’t they focus on him more…?”</p><br/><p>↑ Most normal fans thought like this.</p><br/><p>But for a small number of fans were different, such as a Mr. Xi who didn’t wish to be identified. He stayed in front of the TV before he left work, waiting to see Ming Xiaoyu on the red carpet!</p><br/><p>What was this? The camera only gave showed one shot of Ming Xiaoyu at the signature wall.</p><br/><p>It should track him all the way from when he entered until he took his seat. Ah, it should show him talking with others, laughing a few times, sitting down, the wonderful lines of his legs…</p><br/><p>Cough, this fan’s brain theatre was too dirty and needed to be temporarily shielded.</p><br/><p>The unknown Mr. Xi waited for over 30 minutes to see Ming Xiaoyu for less than 10 seconds! Mr. Xi was angry! He was so angry that he could only make a cold expression.</p><br/><p>At this time, Ding Bo looked up from the data he was reading and asked, “Eh, wasn’t that Ming Yu just now? His outfit is very good. I haven’t seen it before. Which studio did he borrow it from? The design is very good and the colours are great…”</p><br/><p>Ding Bo realized that cold eyes were glaring at him as he said this. Ding Bo suddenly remembered: oh my god, he was praising another person’s design in front of a designer! The most frightening thing was that the clothing was worn by this black-bellied man’s lover!</p><br/><p>Ding Bo thought this and immediately changed his words. “The clothes are really ugly, with mixed lines and vulgar colours. Fortunately, your Ming Yu wears the clothes nicely, or else the clothes would really harm his reputation!”</p><br/><p>Xi Ze indifferently raised his gaze. “These clothes are borrowed from Ji and Ya.”</p><br/><p>Ding Bo nodded. “Oh, it was originally Ji and Ya. No wonder why it is so ugly…eh? Ji and Ya? You didn’t say that these clothes are designed by you! Isn’t next month’s fashion show for women’s clothing. When did you have time to design men’s clothing?”</p><br/><p>Xi Ze raised an eyebrow. “It has mixed lines, vulgar colours and is very ugly. It isn’t a big deal.”</p><br/><p>Ding Bo, “…”</p><br/><p>After a moment of silence, Ding Bo cautiously asked, “That…Xi Ze, it is quite late. Should I go back first?”</p><br/><p>Xi Ze didn’t answer.</p><br/><p>Ding Bo waited a minute before creeping towards the door. He had just touched the doorknob when he heard a low and indifferent voice behind him. “Work overtime tonight and help me look at the next high-end clothing, so that I don’t accidentally design something with mixed lines and vulgar colours.”</p><br/><p>Ding Bo, “…==!!!”</p><br/><p>How long was he going to hold a grudge?</p><br/><p>Here, Ming Xiaoyu was completely unable to predict Ding Bo’s deep abyss of suffering.</p><br/><p>In his past life, Ming Yu had participated in a number of fashion and charity parties. He also received invitations to a number of festivals and awards ceremonies, making him accustomed to it.</p><br/><p>Therefore, Ming Xiaoyu didn’t act like a newcomer. He wasn’t confused at all as he calmly found his name among the hundreds of seats.</p><br/><p>There was no one on either side of Ming Yu’s seat when he sat down, but there were many stars in the area.</p><br/><p>In the past year, Ming Yu’s name had become a known presence in the fashion scene. But in the entertainment industry, he had only shot a MV and Trump Challenge. His name was known but it was only a little bit of fame.</p><br/><p>Many second and third-tier stars looked at him and whispered quietly. Ming Yu couldn’t hear their words but he understood that they were probably discussing things like ‘Why would he sit here?’ and ‘What movie did he shoot?’</p><br/><p>Ming Yu didn’t pay a single bit of attention to those curious eyes.</p><br/><p>During the ceremony, Ming Xiaoyu acted like an elegant gentleman. He clapped when he was supposed to and smiled when he was supposed to. The biggest incident was when a female star sitting beside him won the award for Best Supporting Actress. The camera swept over this area and gave him a long shot.</p><br/><p>Suddenly!</p><br/><p>The cheering of the audience became louder!</p><br/><p>From then on, whether it was intentional by the camera directors or not, Ming Yu was given a lot of audience shots. Sometimes the camera would seem to pass him casually or sometimes it would shoot the person next to him. But his image constantly appeared.</p><br/><p>There was no shortage of beauties in the entertainment industry but there weren’t many beautiful people with his temperament in the entertainment world.</p><br/><p>By the time the award ceremony officially ended, Ming Xiaoyu had a good talk with the two stars beside him. They followed each other on Weibo and exchanged contact information. The awards ceremony used a round table to form a party.</p><br/><p>Now the table full of stars, directors and staff all became friends with this seemingly gentle and pure small mushroom.</p><br/><p>As they were leaving the venue, many new friends asked to have dinner with Ming Xiaoyu. However, he had to return to the capital the next day and regretfully declined.</p><br/><p>The highly skilled stars didn’t notice anything strange with his response and expressed their regrets.</p><br/><p>Ming Xiaoyu’s night officially ended as he met Zhao Rui and they walked to the parking lot. At the same time, a small old man walked behind them with a smile. He also seemed to be going to the parking lot.</p><br/><p>They walked, walked and walked through several parking areas. The old man was still behind them.</p><br/><p>Feeling helpless, Ming Xiaoyu and Zhao Rui turned around to ask if the person was lost. However, both of them couldn’t speak. They were stunned when they saw the old man’s appearance.</p><br/>\n</div>"}