{"title": "Chapter 126", "id": 126, "volume": 2, "url": "http://boxnovel.org/rebirth-of-a-supermodel-chapter-126", "volume_title": "Volume 2", "body": "<h1>Chapter 126</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 126</p><hr/><br/><p>Xi Ze naturally knew that his own small mushroom wasn’t the type to risk his life to save someone else. This type of stupid thing…err, was there anyone in all of Huaxia who would do it?</p><br/><p>Once Jiang Kaiyang was in the air, there were only two possible endings. The first was that he would accidentally bump into something and his injuries would worsen, making the consequences more terrible. The second was that he was rescued. Nothing would go wrong but his leg would still be broken.</p><br/><p>However, if Ming Yu came out to save him, no matter which of the above outcomes occurred, there would inevitably be another result.</p><br/><p>Ming Xiaoyu would also become injured.</p><br/><p>This was inevitable. He was a small mushroom, not a bamboo wearing a parachute. Even if Ming Xiaoyu was a bamboo, he would be wearing a mushroom hat, not a parachute…cough, it was getting off-topic. Let’s return to the subject.</p><br/><p>Xi Ze clearly understood the process of things from Ding Bo while Ming Yu was unconscious. The only thing he couldn’t understand was why Ming Yu suddenly rushed forward and pulled Jiang Kaiyang to him, paying such a heavy price.</p><br/><p>“Only a few seconds had passed. I was closest to him and Jiang Kaiyang kept shaking. The other staff didn’t dare approach him. Only I was near him, so there was no problem.” Ming Yu paused at this before adding, “Despite how confident I am, I know I am a newcomer in this area. I wasn’t conceited enough to try and save Jiang Kaiyang. It might make both of us become seriously injured. But at this time, something happened to make me take action.”</p><br/><p>Ming Xiaoyu was a complete newbie when it came to wires. After Jiang Kaiyang’s accident, his first action was to quickly unleash his own wires and take the initiative to stay away from this dangerous area, letting the professionals work.</p><br/><p>The moment he tried to do this, he discovered that his wire was entangled with JIang Kaiyang’s!</p><br/><p>While Jiang Kaiyang was dangling, his wires kept tangling with Ming Yu’s wires. The winding action was too fast. Ming Yu had just released the first lock on the wire when he felt his body being pulled in Jiang Kaiyang’s direction!</p><br/><p>In ‘the time needed to release the wire’ and ‘time to be dragged by Jiang Kaiyang’, Ming Xiaoyu could only ponder for a second. He immediately made a decision. Jiang Kaiyang had to come down immediately!</p><br/><p>Otherwise, he would definitely collide with Jiang Kaiyang before he could unlock his wire.</p><br/><p>Therefore, Ming Xiaoyu immediately moved towards Jiang Kaiyang and embraced him, forcibly pulling Jiang Kaiyang towards him. At the same time, he loosened his right arm and placed it behind his head in order to prevent a fatal injury. Finally, he tapped his legs gently against the wall to act as a buffer.</p><br/><p>As a result, today’s scene was created.</p><br/><p>It could be said that in the entire An Li crew, only Ming Yu could be so decisive.</p><br/><p>He minimized the damage to the other party while maximizing his own safety. It could be said that Ming Xiaoyu was very smart and rational. If Luo Ru or Ding Bo had heard this explanation, they would feel sincerely thankful. However, Xi Ze immediately frowned when he heard these words.</p><br/><p>The cold and elegant face revealed a solemn expression as Xi Ze said without hesitation, “You should’ve pressed the emergency button.”</p><br/><p>Ming Xiaoyu was surprised by the words for a moment. Then he said, “If I pressed the emergency button, the wires would be even harder to control. I would be safe but Jiang Kaiyang…” The voice of the young man gradually subsided as he saw the man’s deep eyes.</p><br/><p>The two people looked at each other for a long time before Xi Ze’s lips thinned and he said indifferently, “He wouldn’t die. An air cushion was placed below. At the most, he would break the other leg.” Xi Ze bowed his head and said earnestly, “Even so, you won’t be hurt.”</p><br/><p>Ming Yu stared deeply at the man before him without opening his mouth.</p><br/><p>Then after a moment, he laughed and said, “Xi Ze, you are so unreasonable. If Jiang Kaiyang knew this, he would curse you. Jiang Kaiyang really would have to spend months in a wheelchair if he broke the other leg.”</p><br/><p>This might be the case but Ming Yu didn’t deny Xi Ze’s words.</p><br/><p>Indeed, Ming Xiaoyu wasn’t a person who would sacrifice himself. Looking back now, his decision was really a bit risky.</p><br/><p>Today’s outcome was the best result that he imagind. He only injured his hand and just needed to rest for a period of time. Jiang Kaiyang also only broke one leg.</p><br/><p>But what if things hadn’t turned out as well?</p><br/><p>The worst outcome was that Ming Yu didn’t have time to protect his head with his hand and it would forcefully hit the wall. This type of trauma could be very big or small. The slightest hit to the head would cause bleeding and if it was serious…</p><br/><p>“Don’t do it again.” Xi Ze suddenly hugged the youth’s body and spoke with some fear. “In my eyes, your life is more important than anyone else. Even your fingernails are more important than that Jiang’s legs.”</p><br/><p>Ming Yu laughed. “His name is Jiang Kaiyang.”</p><br/><p>Xi Ze murmured lightly, “What is a name in front of love?”</p><br/><p>The two people exchanged a few words and Xi Ze’s anger lessened. He personally cut an apply and handed it to Ming Xiaoyu.</p><br/><p>“Your scenes in H City has already finish. Wait for your legs to become better and then we will return to the capital. This place isn’t good to rest. I don’t have anything to do for a while so I will take care of you.”</p><br/><p>“Okay.” Ming Xiaoyu bit the apple in his left hand and asked, “Did Jiang Kaiyang really only break one leg?”</p><br/><p>Xi Ze licked his lips when he heard the name and didn’t feel good.</p><br/><p>“Yes, he is lucky. Breaking only one leg is a good result.”</p><br/><p>He really didn’t want to continue this topic. As a doctor changed the bottle of glucose, Xi Ze talked about the Ji and Ya high-end fashion show with Ming Yu. Once Ming Yu was a little tired, Xi Ze helped him with his waist pillow and gently picked up the right hand on the quily.</p><br/><p>The thin and beautiful hand was now wrapped in a thick bandage. The doctor had put a lot of ointment and powder on it to prevent inflammation. Fortunately, the wound was blocked by the bandage. Otherwise, Xi Ze was afraid he would be tempted to do something as soon as he saw the youth’s bruised hand.</p><br/><p>For example, he would get revenge on the person who made Ming Yu’s hand like this.</p><br/><p>As if perceiving his thoughts, Ming Yu’s lips gently curved and he said, “Don’t worry. It was very painful when it was hit but now I don’t feel anything. My relationship with Jiang Kaiyang isn’t good but he didn’t make things difficult for me. We have a normal relationship so don’t go finding the other person.”</p><br/><p>Xi Ze hummed lightly. He didn’t deny or agree to it.</p><br/><p>Ming Yu’s body was injured and easy to feel fatigue. He slowly fell alseep.</p><br/><p>Xi Ze silently watched the youth’s quiet and restful sleep. Then Ding Bo gently knocked on the door and indicated for him to come out. Xi Ze crept out of the room and silently closed the door.</p><br/><p>Once the door closed, Ding Bo asked directly, “What are you doing to do?”</p><br/><p>Xi Ze raised an eyebrow. After a long time, he replied, “I won’t do anything. The matter should be pressed down for the moment. It wasn’t a major event between the two parties so you should discuss it with Jiang’s manager. It would be good if this doesn’t become bigger than it is.”</p><br/><p>Ding Bo was slightly stunned. He looked at Xi Ze for a long time. “This method of handling it really isn’t your style Xi Ze. Are you thinking about Ming Yu’s reputation and his future development?”</p><br/><p>Xi Ze was noncommittal.</p><br/><p>However, Ding Bo suddenly sighed. “It is rare that you are so good-hearted. Unfortunately Xi Ze, we won’t be able to cover up the problem this time. Half an hour ago, Jiang Kaiyang posted a message on his Weibo and now the whole Internet is arguing.”</p><br/><p>Xi Ze’s phoenix eyes narrowed and he asked in a dangerous tone, “What is the problem?”</p><br/><p>A ridiculing smile appeared on Ding Bo’s face. “They are noisy. Jiang Kaiyang has so much filming experience and is good on the wires. How is there suddenly an accident when he played opposite Ming Yu? In addition, only Jiang Kaiyang got injured. What did Ming Yu do?”</p><br/><p>Ding Bo’s expression became more serious. “Well, I prettied up the argument but this is what most of Jiang Kaiyang’s fans are saying.”</p><br/><p>【 Ming Yu is the one who caused our Jiang’s leg to break! The culprit must be Ming Yu! 】 It stood to reason that fans would become anxious after hearing that their idol’s leg was broken. In any case, the accusations were strong. Since the truth of the matter wasn’t announced, all responsibility was pushed to Ming Yu.</p><br/><p>Why was there such a dramatic event happening?</p><br/><p>It was actually very simple. It was because Jiang Kaiyang’s assistant borrowed his Weibo account and sent this message:</p><br/><p>【 Jiang Kaiyang: In the afternoon, Jiang Kaiyang was filming An Li and experienced an accident with @Ming Yu, leaving Jiang Kaiyang dangling from the wire. Now Jiang Jiang’s right leg is confirmed to be fractured and he is being treated in hospital. He still isn’t awake! Jiang Jiang has been shooting this film for a long time and is very dedicated. I hope you will support Jiang Jiang! 】</p><br/>\n</div>"}