{"title": "Chapter 138", "id": 138, "volume": 2, "url": "http://boxnovel.org/rebirth-of-a-supermodel-chapter-138", "volume_title": "Volume 2", "body": "<h1>Chapter 138</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 138</p><hr/><br/><p>Zeng Shu had been really worried lately. The so called ‘bad times’ was appropriate to describe his last year.</p><br/><p>Zeng Shu was relatively satisfied in the beginning after seizing Cheng Su from Zhao Rui’s hands. Cheng Su had some strength. Apart from the matter of Zhao Rui, he could surely train Cheng Su into a good supermodel.</p><br/><p>But the situation changed dramatically a year ago.</p><br/><p>Cheng Su was tall and handsome. He truly had the seed to be a supermodel seedling. It was difficult if he wanted to move one step further onto the world’s supermodel list. But this wasn’t what made Zeng Shu concerned. It seemed that Cheng Su was a bit stubborn.</p><br/><p>Zeng Shu had already advised Cheng Su not to associate with Zhao Rui’s people. Yet Cheng Su always committed another crime. He even tried to press on Ming Yu during the reality show filming.</p><br/><p>This guy did something selfish in order to hurt another person, only for them to not be harmed. Cheng Su himself was the one who received big damage. It really made Zeng Shu lose some hair.</p><br/><p>After that, Zeng Shu sternly warned Cheng Su away from Ming Yu. Ming Yu’s potential was much higher than Cheng Su’s and he also had a background that no one could afford to go against. If Cheng Su saw him later, take a detour and don’t openly find any trouble.</p><br/><p>But…dammit! That Cheng Su bastard wasn’t obedient!</p><br/><p>Zeng Shu hadn’t known that Cheng Su and his assistant privately contacted a navy in order to engage in marketing activities. At the time, he was across the ocean with another supermodel under him, talking about a fashion show. It wasn’t until the assistant felt things couldn’t be concealed anymore that Zeng Shu learned about the stupid thing Cheng Su had done.</p><br/><p>Zeng Shu immediately called Cheng Su and scolded, “How many times have I told you? How many times have I told you? Cheng Su, were you listening? You shouldn’t mess with Ming Yu or get involved with him! He is untouchable! Do you hear me? Do you want me to write a note and shove it in your mouth so that you can remember?”</p><br/><p>Cheng Su was silent as he was scolded for a while. Finally, he couldn’t help saying, “But Brother Zhao, this really isn’t my doing. My fans couldn’t stand that I was being bullied by Ming Yu. You also said that the person behind him is untouchable, but he is just using his background to suppress me. I’m really not convinced…”</p><br/><p>In the middle of the night in the United Stats, Zeng Shu’s anger reached its peak as he finally askd in a funny manner, “Cheng Su, how many times do I have to say it? In this year, Ming Yu’s results are much better than yours. This year, he was 100 times better! It is right that he holds you down while he is being pressured by Andrew. It is Andrew who went in through the back door!”</p><br/><p>Cheng Su’s fingers clenched with indignation as he heard this. Zeng Shu continued to speak. “Since you have done this, Ming Yu and Zhao Rui would’ve already discovered it. Things are irreversible. Fortunately, you haven’t taken any improper measures this time so the company won’t do anything to you. You have to immediately stop everything and hand it over to me. After all, you are my model. I will try to help you but you must give me something in return. Before you do anything in the future, be sure to tell me first. Do you understand?”</p><br/><p>Cheng Su refused to answer.</p><br/><p>Zeng Shu sighed. “In this industry, there are too many models who are more powerful than you. You can’t waste energy on being jealous. Forget about Ming Yu. I know that there were a few incidents between you previously but you should be glad he hasn’t done anything to you. Why are you always in a rush to provoke him? Concentrate on your own business. Next month’s rankings might have your name on it. If you keep acting like this, I don’t have to say that the person behind Ming Yu won’t give you any good food to eat.”</p><br/><p>Before hanging up the phone, Cheng Su couldn’t help asking, “Brother Zeng, who is behind Ming Yu?”</p><br/><p>Zeng Shu was slightly started for a moment. Finally, he thought, ‘Perhaps I should tell him. This will make him completely forget about Ming Yu and he won’t fight with others.’</p><br/><p>Then Zeng Shu spoke solemnly, “Behind Ming Yu is Xi Ze.”</p><br/><p>Thus, after Luo Ru started to act, Cheng Su’s marketing method began to gradually change. Zeng Shu was afraid of Xi Ze but it was impossible to disregard the interest of his own model. Therefore, he arranged for a draft of the ‘Cheng Su will participate in the Jiayi fashion show’ to be published.</p><br/><p>The fans no longer had the strength to debate about whether Ming Yu should be before Cheng Su. Once this article was published, they instantly gained confidence and no longer focused on the small problem of rankings.</p><br/><p>【23333 Ah Cheng could actually become Jiayu’s finale model! This is strength! 】</p><br/><p>【 wasn’t Guo Yang the finale model for Jiayi’s autumn and winter show? Guo Yang is 56th on the list of male models. 】</p><br/><p>【 Ah Cheng is really amazing! He is really handsome! He will surely fly! Ah Cheng might be temporarily under pressure but don’t feel discouraged. Some people’s achievements aren’t as good as yours and I don’t understand why they are before you. I believe that when the next supermodel’s list comes out, you will use your strength to hit him in the face! 】……</p><br/><p>Zeng Shu naturally didn’t pay attention to fans comments. He used a small navy to hype up Cheng Su participating in the Jiayi fashion show rather than paying attention to the supermodels list.</p><br/><p>Zeng Shu originally planned to announce the Jiayi fashion show next week. Combined with other methods of publicity, Cheng Su’s popularity would surge. But this time, he used it hastily in order to divert the fans’ attention. It wasted a good gimmick.</p><br/><p>In Ming Xiaoyu’s lounge, Zhao Rui was very angry when he saw this. He said bluntly, “This style is Zeng Shu’s handwriting! I’m sure of it! It is definitely him, not Cheng Su! Xiaoyu, he wants to hit us in the face so he brought up the Jiayi finale model.”</p><br/><p>Ming Yu pondered for a long time before shaking his head. “Brother Zhao, you are wrong. No matter who sent out this notice, it isn’t to provoke us. It is actually asking us for mercy. He doesn’t want to get entangled with us on the issue of the supermodels list and actively avoided the topic. In fact, he is surrendering.”</p><br/><p>Zhao Rui was stuck on one word. “Surrendering? Zeng Shu wouldn’t do such a thing.”</p><br/><p>Ming Yu smiled., “There is nothing in the world that will never be done. It is just that the reason for doing it hasn’t been encountered yet.”</p><br/><p>Zhao Rui understood that this time, Zeng Shu was unexpectedly begging for mercy. He was in a good mood as he suggested, “Ming Yu, we should chase after the victory. Once they taste the bitter fruit, they won’t come provoke us again.”</p><br/><p>Ming Xiaoyu thought about it before shaking his head. “Brother, there is a word called ‘desperation.’ Everyone has their limits. If we push too tightly then I’m afraid Zeng Shu wouldn’t be able to endure it anymore. Thus, both of us should step down now.”</p><br/><p>Both Zhao Rui and Luo Ru were shocked by Ming Yu’s words.</p><br/><p>Was Ming Xiaoyu such a thoughtful and kind person?</p><br/><p>The next day, Ming Yu had Luo Ru published a notice:</p><br/><p>[Fei Sixin’s first fashion show has invited Ming Yu to be the finale model, leading the trends!] The supermodels list would eventually pass because it was just a list. There were 370 people on the list but only a few could claim to be the best in the fashion industry.</p><br/><p>Before September arrived, Ming Xiaoyu already picked Fei Sixin’s show. At the same time, Cheng Su didn’t lag behind and became the finale model for Jiayi.</p><br/><p>For a time, Huaxia’s two new supermodels were confrontational.</p><br/><p>As early as three days ago, Xi Ze was invited by a top luxury brand and flew to the United States to participate in the event. It was the next night when he learned about what happened.</p><br/><p>On the phone, a low and magnetic voice was heard, like a mellow cello. “This is your first show after becoming a supermodel. You should choose a top-tier one. Your last fashion show was for Nidelan and now you are participating in Fei Sixin’s show. It is a bit risky.”</p><br/><p>Xi Ze didn’t talk about Cheng Su, as if he really didn’t know anything. He just analyzed Ming Xiaoyu’s choice.</p><br/><p>Ming Yu had just been returning home when he heard this. He wore his slippers at the entrance and laughed. “Xi Ze, what type of fashion show do you think I should choose after becoming a supermodel?”</p><br/><p>The man over the telephone thought for a moment. Then Xi Ze sighed and said, “I am wrong. I will give you a special place in Ji and Ya’s fashion show next month.”</p><br/><p>The man’s tone was filled with such regret that Ming Xiaoyu sneered. He didn’t say anything, just listening as Xi Ze continued, “I have made such a big concession. Shouldn’t I be rewarded when I return?”</p><br/><p>Ming Xiaoyu gave a low hum. “You want a reward?” He acted like he was thinking. “Do you think I don’t know that the next Ji and Ya fashion show is for female clothing? But I am kind-hearted, I will forgive you., After you come back from the United States, we will play the three months delayed ‘fierce and nagging daughter’ and ‘overbearing male’ scene…”</p><br/><p>Xi Ze, “…”</p><br/><p>Ming Xiaoyu immediately clapped. “Good! It is happily decided! When you come back from the United States, it is my turn to sing!”</p><br/><p>Xi Ze, “…”</p><br/><p>One was the first show of a super newcomer designer’s debut brand.</p><br/><p>The other was a fashion show for a first-tier brand in Huaxia.</p><br/><p>Perhaps in the eyes of many people, the latter held more weight than the former. But was this really the case?</p><br/>\n</div>"}