{"title": "Chapter 137", "id": 137, "volume": 2, "url": "http://boxnovel.org/rebirth-of-a-supermodel-chapter-137", "volume_title": "Volume 2", "body": "<h1>Chapter 137</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 137</p><hr/><br/><p>Cheng Su spent five years in the industry. From the beginning where he was unknown, he had finally reached the world’s supermodel list. He had a lot more experience than many models.</p><br/><p>The more prosperous the industry, the harder it was to get ahead because there were too many excellent people. If you weren’t better than others, that time would only be used to survive.</p><br/><p>But once the supermodels list was released, all of Cheng Su’s fans discovered that he was third.</p><br/><p>There was nothing to say about the first place Andrew Wallen who entered through the back door. But many people were surprised and resentful about the second place Ming Yu. Don’t talk about Cheng Su, many of his fans thought: 【 Ah Cheng has been struggling for so many years. His achievements over the five years isn’t any lower than Ming Yu. Why is his name after Ming Yu? 】</p><br/><p>【 I don’t believe it! Ah Cheng’s efforts and achievements can clearly be seen. There must be something shady! 】</p><br/><p>【 Ohh, how can there be so many dark horses in the world. @World Supermodels Organization, tell us. Why is Ah Cheng behind Ming Yu? For what reason? 】……</p><br/><p>In the beginning, such remarks only spread among Cheng Su’s fans and didn’t cause too much trouble. It was unknown when it started but this trend gradually flourished. More and more people joined the ‘questioning army’ as they wondered: Why is Ming Yu’s name before Cheng Su?</p><br/><p>After all, Ming Yu and Cheng Su were both models of Muse. Once Cheng Su’s fans ran to the Muse official website, no one could stop them. These fans were also members of the Muse website and were eligible to post.</p><br/><p>But if it was just this, it could only be called the spontaneous behaviour of the fans. It only took a bit of PR to solve the problem. However, the behaviour started to change when Zhao Rui came to the PR department to discuss with Shen Xiang.</p><br/><p>A strange water army seemed to support these fans from behind. They started to form a direction under the leadership of others. They knew how to crusade against Ming Yu while stirring his fan forum.</p><br/><p>Fortunately, there was still the national lottery that suppressed this storm and attracted people’s attention. Otherwise, it would be more serious.</p><br/><p>But the group of water army was well controlled and didn’t allow this incident to become an emergency in the eyes of the Muse PR department. Yet if the other party was allowed to keep causing chaos, Ming Yu’s reputation would worsen with many bystanders who didn’t know the details.</p><br/><p>“All the benefits only point to Cheng Su. Xiaoyu, it is good that you surpassed him this time but he will certainly feel that it is unfair. Zeng Shu is a very talented person. He has done successful marketing for his supermodels before and got first-tier big endorsements. If we don’t do something to clear this up, I’m afraid it won’t be good for you.”</p><br/><p>Zhao Rui was very anxious. But he had been with Ming Yu for so long that he wasn’t reckless like he was a year ago. After a careful consultation with Shen Xiang, he returned to Ming Yu’s rest room and explained, “Shen Xiang’s side won’t do anything. Firstly, the incident isn’t that serious enough to trigger their security level. Secondly, the other person is also a Muse model. Even if the company values you more, they can’t help you for the sake of fairness.”</p><br/><p>Ming Xiaoyu naturally understood Shen Xiang’s meaning.</p><br/><p>Everyone was currently part of the company and Cheng Su wasn’t using an excessive means for his marketing. Muse naturally wouldn’t intervene. Otherwise, it would be too more favoritism. Setting aside Cheng Su, the other Muse models would also feel very cold.</p><br/><p>Therefore, Shen Xiang promised that the company would only interfere if Cheng Su used unfair means or directly harmed Cheng Su. They would provide a little information to Ming Yu but they would no longer do anything else.</p><br/><p>Of course, if Ming Xiaoyu found Xi Ze then it wouldn’t be a matter of favoritism. It would be directly pressing down on Cheng Su. But Ming Xiaoyu wouldn’t do this. If he did, he would be too dependent on the other person. This wasn’t his style.</p><br/><p>The two people liked to talk about a ‘golden backer’ when they flirted. However, both of them knew it was a fair and equal relationship.</p><br/><p>As for the gold backer, it was all fun～</p><br/><p>Don’t you see that this was role playing and Ming Yu might be able to exercise his acting skills ～～～╮（╯＿╰）╭ After thinking about this matter for a long time, Ming Yu asked Zhao Rui, “Brother Zhao, do you think this is Zeng Shu’s doing?</p><br/><p>Zhao Rui heard the question was asked, “Isn’t it?” He started to explain to Ming Yu. “Xiaoyu, don’t don’t understand Zeng Shu. He and I entered the company at the same time and he is most adept at controlling public opinion. He is very good at marketing and has become one of the company’s gold agents. He also has a lot of supermodels under him. He uses all his tools very skillfully and the pattern is similar. I think it is him.”</p><br/><p>After listening to this, Ming Xiaoyu shook his head and smiled. “Brother Zhao, I might not know Zeng Shu as well as you but I don’t think Zeng Shu’s means will be so low. The water army is too obvious and purposeful. Brother Zhao, this isn’t Zeng Shu’s actions. It is Cheng Su alone.”</p><br/><p>Zhao Rui was shocked at these words.</p><br/><p>However, Ming Xiaoyu didn’t give him the opportunity to think again. Instead, he laughed. “Zeng Shu’s means are really high. I don’t understand him. The three of us alone might not be able to deal with him. But Cheng Su isn’t the same. You know…well, his IQ isn’t as high. I believe that Sister Luo can easily handle him.”</p><br/><p>Ming Xiaoyu and Zhao Rui looked over at Luo Ru.</p><br/><p>Luo Ru smiled and nodded, raising a hand to push her glasses up her nose. “Then give it to me.”</p><br/><p>10 minutes later, Luo Ru released a post on Ming Yu’s fan forum that was stickied red because she was an administrator. She joined a few boards and asked the foreign fans to speak in this post.</p><br/><p>Luo Ru also contacted a navy and started counter-marketing on Weibo and other forums. What she did was very simple. She didn’t take the initiative to suppress the problem between Ming Yu and Cheng Su. Instead, she started to do two things.</p><br/><p>First, she boasted about Andrew Wallen. She kept propagating the hype of ‘this supermodel is ranked first among the five new supermodels’, ‘his method of debut is comparable to Xi Ze’, ‘he is likely to be the next Xi Ze’ etc.</p><br/><p>Secondly, she greatly promoted the spontaneous lottery made by Ming Xiaoyu’s fans. If it had been previously spread through word of mouth among the fans, now that Luo Ru officially took over, it began a targeted marketing campaign.</p><br/><p>The first of these two incidents led the passersby to shift their attention from Ming Yu and Cheng Su to Andrew Wallen. After seeing his photos and watching his fashion show, a few people thought disdainfully: 【This person wants to become the next God Ze? Wash up and get some sleep! 】 Let’s pause for a moment of silence for the poor Andrew. In any case, he wasn’t in Huaxia and this was a rare addition to his fame. Luo Ru also said, “I previously learned from Director Shen that Andrew is an extreme anti-Huaxia activist who once participated in an anti-Huaxia parade in the United States and who went to Chinatown to make trouble. I have always seen him as unpleasant and now it is a chance to hurt him. How can it not be a bit invigorating?”</p><br/><p>The second thing was that everyone focused on Ming Xiaoyu’s fan lottery.</p><br/><p>Fortunately, the lottery was a favourite of people in Huaxia.</p><br/><p>Everyone could chat happily and there was also a chance to win prizes.</p><br/><p>For a time, Luo Ru didn’t deliberately aim at Cheng Su’s army but her plans started working. Many of Cheng Su’s fans started to think, ‘Who is this Andrew who wants to be the next God Xi’ or ‘Hey, I really like this necklace. Forward, forward.’</p><br/><p>The final blow was Luo Ru arranging for Ming Xiaoyu to publish a lottery.</p><br/><p>【 Ming Yu: Thank you to all the fans for the support～[/Laughs] You are amazing! Among all the fans who forward this post, 100 will receive cookies made by hand by this mushroom! It might be a small gift but I hope you can enjoy it [/Heart]. 】 This news was also released on Ming Xiaoyu’s fan forum.</p><br/><p>It was so exciting that words couldn’t be spoken. They could only go：【 Ahhhhhhhh? This is so exciting that I can’t speak words. I can only go ‘ahhhhhhhh!!!!!’ Ming Xiaoyu’s homemade cookies! I want it!!! I absolutely won’t eat it! I will place it on the table and light incense for it three days a day! 】</p><br/><p>This gift wasn’t expensive abut it conveyed Ming Xiaoyu’s heart.</p><br/><p>It might be cheap but Ming Yu took the time to do it. This was more important to the fans than a mountain of silver!</p><br/><p>But as public opinion was being controlled by Luo Ru, a media outlet suddenly published an article that attracted attention.</p><br/><p>[ Jiayi’s spring and summer fashion show in September has invited the new supermodel Cheng Su as the finale model!]</p><br/>\n</div>"}