{"title": "Chapter 136", "id": 136, "volume": 2, "url": "http://boxnovel.org/rebirth-of-a-supermodel-chapter-136", "volume_title": "Volume 2", "body": "<h1>Chapter 136</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 136</p><hr/><br/><p>Generally speaking, the World Supermodels Organization would release the new supermodels list every two months during the first half of the month. However, this list was often delayed to the mid or end of the month. After all, sometimes members had objections to the list and sometimes there were arguments about the rankings of new supermodels.</p><br/><p>The world’s supermodel list wasn’t the ranking list. It just objectively stated ‘Who in the world today are qualified to be supermodels.’</p><br/><p>Not only did the list have more than 200 people, it counted all the supermodels in the world. The order also wasn’t arranged according to the world supermodel rankings, but arranged according to the order that they became a supermodel.</p><br/><p>For example, Xi Ze’s name was 131st on the list. This meant that Xi Ze was the 131st person to become a supermodel out of the more than 300 current supermodels in the world. Cecilia was 244th on the list and she was at this number for the same reason.</p><br/><p>Thus, supermodels already on the list didn’t care about it. As for supermodels who had been disqualified from the list, they didn’t need to be mentioned. Yes, there were occasionally individual supermodels who would decline and eventually fall from the list.</p><br/><p>It was only the new supermodels that needed to be put in order.</p><br/><p>The sequential order that their name appeared in was very interesting for people who became supermodels in the same period. For example, Xi Ze was 131st but of the three supermodels he entered the list with in the same period, his name was placed first.</p><br/><p>At 9 o’clock Italy time on August 23rd, 2017, the list was finally revealed.</p><br/><p>Once the list was announced, everyone understood why the World Supermodels Organization delayed it for a full half a month!</p><br/><p>【The list of the fourth world’s supermodels list for 2017 is as follows: Shu Tianyu, Edmund Cecil, Norris Eli, Qi Ziping, Xi Ze…He Chaoman…Cecilia Cote…】</p><br/><p>The list was very long and sorted itself in order of five lines each. On the list, the names of two supermodels were shown in bold. This might that they had performed poorly recently and were no longer qualified to be supermodels.</p><br/><p>But people were most concerned with the newcomers who became supermodels!</p><br/><p>Down, down, down…</p><br/><p>Down, down, down…</p><br/><p>They finally saw it!</p><br/><p>【 Andrew Wallen, Ming Yu, Cheng Su, Bailey Gary, Eve Weissen. 】</p><br/><p>Oh, there were five new models added…</p><br/><p>Wait a minute! Who did they just see! Ming…Ming Yu?</p><br/><p>Ming Yu, who had just been a first-tier model for a little over half a year, had boarded the world’s supermodel list at lightning speed? One year ago, he was still an obscure third-tier model. How did he live for the past year that he unexpectedly became a supermodel?</p><br/><p>Don’t think that leaping from a third-tier model to a supermodel in a year was an easy thing. It was true that Xi Ze had reached the top 10 supermodel rankings in a year but he had taken the ‘back door.’</p><br/><p>Which person would directly walk for a top luxury brand for their debut?</p><br/><p>Who would have the dual identity of a designer and model?</p><br/><p>This wasn’t the normal path!</p><br/><p>Today’s fashion industry was very prosperous and there were a lot of wolves. With so many resources, it was impossible to let everyone have a chance to fly.</p><br/><p>Moreover, everyone witnessed that Ming Yu had taken a step-by-step approach. He took photos for a second-tier magazine and endorsed a second-tier brand. His every step was very sound and no one had doubts about his strength.</p><br/><p>The foundation of this youth was too solid. The people who were surprised that Ming Yu became a supermodel so quickly? Once they thought about it in turn, they discovered that this youth had done too many things this year.</p><br/><p>The inner seal of Muse, the cover of Character…</p><br/><p>The Huaxia spokesperson for the Feilu watches and the Nidelan Smoke perfumes…</p><br/><p>The opening model of the Nidelan May fashion show and a supporting actor in the big movie An Li…</p><br/><p>He had done too many things but every step was taken for granted. It wasn’t a leap to the top but a slow accumulating of endless details, so that no one would be surprised. Once they looked back on it, they discovered that every one of these achievements wasn’t something an ordinary model or ordinary supermodel could do.</p><br/><p>Moreover, Ming Yu was ranked second among the five newly added supermodels. He even suppressed Cheng Su, a fellow Huaxia model!</p><br/><p>This wasn’t an easy task. Cheng Su had accumulated a lot of confidence after he debuted in Huaxia five years ago. He might have never entered the supermodels list before but he was well-known among the first-tier models.</p><br/><p>Yet the well-known Cheng Su was suppressed by Ming Yu?</p><br/><p>As for Andrew Wallen, he was completely a back door and they didn’t care about him. His mother was the designer of a world’s top luxury brand and he started in the top brands fashion shows. It was almost the same path as Xi Ze, but his performance in the fashion shows were lacking compared to Xi Ze.</p><br/><p>People weren’t optimistic about his ranking in the world’s supermodel rankings. Instead, Ming Yu was the example of a new talent with amazing strength and a solid foundation. It was even more desirable before there was a good example before him: Du Ruo.</p><br/><p>The two people were Huaxia supermodels. Du Ruo also steadily climbed onto the supermodels list. Once she did, she soared and rose from the 79th rank to currently become 2nd!</p><br/><p>Ming Yu…would he be better than her?</p><br/><p>While many fans in the industry were waiting, Ming Yu’s fans didn’t think too much. Instead, they directly expressed their joy on the Internet.</p><br/><p>【 Ahhhhh!!! I just saw that Ming Xiaoyu became a supermodel! Link here →[/Web link] 】</p><br/><p>【 Ming Xiaoyu became a supermodel! Laughing loudly! I represent the business fans when I express my satisfaction! Sister is happy today and will forward a lottery to send…well, I won’t send lipstick! I will send a mushroom snacks gift box! 23333 】</p><br/><p>【 ～（≧▽≦）/～ I knew that small mushroom would become a supermodel this time. Ming Xiaoyu is very lucky! Today, I am so happy that I will open a lottery to send a new mushroom crystal necklace! I always think of Ming Xiaoyu when I see it! It is very beautiful ～ 】</p><br/><p>【 I’m really happy as a small mushroom fan! I won’t do a lottery. Instead, I have spent nine hours making a video of small mushroom’s growth and will give it to small mushroom. 】……</p><br/><p>For a time, all types of blessings spread on Weibo, forums, etc. All of Ming Xiaoyu’s fans were in a state of fanatical delight by him becoming a supermodel. A fan even suggested:</p><br/><p>【 It is strongly recommended that August 23rd of every year be designated as ‘Ming Xiaoyu Mushroom Day!’ On this day, we must eat mushrooms XDDD 】</p><br/><p>On Ming Yu’s Muse fan forum, the celebration was even more formal.</p><br/><p>The afternoon that the list was released, Ming Xiaoyu posted a small video on his website and Weibo, thanking fans for his blessings. He hoped that fans would stop sending expensive gifts to the company. Instead, they should use that money to treat themselves well.</p><br/><p>At the end of the video, Ming Xiaoyu specifically showed his right hand. Now there was only a little bit of purple on the back of the hand. The strong lighting meant it was hard to see. This allowed fans to now worry about his injury and reassured them.</p><br/><p>But Ming Xiaoyu never thought that the fans would become more excited after his video!</p><br/><p>More ‘forward lotteries’ and ‘reply lotteries’ appeared in his fan group.</p><br/><p>Huaxia people always liked to draw prizes. Even people who didn’t know Ming Xiaoyu actively forwarded the Weibos of his fans, making this matter hotter.</p><br/><p>By the end of the day, the grand lottery had climbed onto the top 10 hot searches!</p><br/><p>This grand occasion happened only last year. At the time, an American actor was nominated for four consecutive international top movie awards but lost four. Then the actor unexpected won an award and his fans were so excited that they repeatedly forwarded the lottery to send lipstick, resulting in the largest ever draw for Huaxia.</p><br/><p>Speaking off topic, the biggest impact of that lottery was to let many people know that there were so many types of lipstick in the world…</p><br/><p>Cough, getting back to the topic. Mng Xiaoyu’s fan lottery wasn’t the slightest bit inferior to that time!</p><br/><p>More and more fans and netizens joined the event. The charm of the lottery was unparalleled! Zhao Rui and Luo Ru had no input on this. They didn’t buy a never or create an unusually successful marketing.</p><br/><p>Ming Xiaoyu felt moved and helpless as he watched his fans forward the lottery gifts.</p><br/><p>The lottery was a good thing but why were they sending a mushroom necklace! What was the mushroom gift bag? Who was a mushroom?! They might as well send lipsticks!</p><br/><p>Ming Yu watched this and also planned to make a forwarding lottery to thank his fans.</p><br/><p>However, he hadn’t prepared anything to send yet when he suddenly saw Zhao Rui hurry in with an anxious tone, “I just came from the PR department and they found something wrong on the Internet. This time, your ranking suppressed Cheng Su. Xiaoyu, Cheng Su has started to move!”</p><br/>\n</div>"}