{"title": "Chapter 142", "id": 142, "volume": 2, "url": "http://boxnovel.org/rebirth-of-a-supermodel-chapter-142", "volume_title": "Volume 2", "body": "<h1>Chapter 142</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 142</p><hr/><br/><p>[’Sixin’ is a strong hit, the first show is repeatedly praised.]</p><br/><p>[Fei Sixin’s unique ‘Sixin’, a menswear brand created by a bold and unique female designer!] [Ming Yu’s supermodel debut that can’t be described in any language!]…</p><br/><p>The next morning, a variety of newspapers published headlines about the Sixin fashion show in their fashion section. The media focused on only two aspects. One was the Sixin fashion show itself and the other was Ming Yu.</p><br/><p>Ming Xiaoyu had been a hot topic for the past few years.</p><br/><p>When he first appeared in public view a year ago, it was due to the turmoil with the second-tier magazine, Fashion Entertainment. The other side was forced to apologize and the youth attracted the attention of many fashion enthusiasts.</p><br/><p>A year later, don’t even mention Fashion Entertainment, many first-tier magazines such as Character, Lanka and Shangxi were keen to throw an olive branch to this super newcomer, inviting him to shoot the cover and do an interview.</p><br/><p>The magazines hoped that Ming Yu would appear on their cover after his first supermodel show.</p><br/><p>However, their hopes were destined to be doomed. The day after the fashion show, Ming Xiaoyu drove to a familiar building. It was because last week, he accepted the invitation to be on the cover of one of Huaxia’s top magazines, Suyi.</p><br/><p>That’s why Ming Xiaoyu and Zhao Rui went to the headquarters of Suyi magazine. On the other hand, Cheng Su’s fans exploded after hearing the media use ‘too excellent to be described in any language.’</p><br/><p>【 Yesterday Ah Cheng was ‘amazing’ and now this model is ‘so excellent it can’t be described in any language’? Is this deliberate? Who wrote this story? Who wrote this article? 】</p><br/><p>【 Oh, deliberately finding faults. Then how long can a model be famous? Are you giving no face to my husband? 】</p><br/><p>【 Who wrote this manuscript about a model that can’t be described in any language. Really sour. Don’t you know that Jiayu is a big name? First-tier! What about Sixin? Laugh, it is just a small brand! 】…</p><br/><p>Once Cheng Su saw the report, he was so angry that he subconsciously wanted to use PR means.</p><br/><p>But before Cheng Su started, he remembered Zeng Shu’s repeated warnings. After seething in resentment for a long time, Cheng Su endured his hatred and called Zeng Shu.</p><br/><p>At this moment, Zeng Shu was on a business trip in S City. He listened to a description of the matter and said, “This is an issue with the reporter. Zhao Rui isn’t the type of person who likes to deliberately find faults. I will arrange for the report to be removed from the newspaper’s official website. As for the newspapers sold today, rest assured that no one will remember it in a few days.”</p><br/><p>Cheng Su’s eyes slowly widened and and his face was full of incredulity.</p><br/><p>He only listened as Zeng Shu continued, “This time, you did a good job not being stimulated by a third party. This is correct. You should’ve get involved with Ming Yu again. He is the type of person that if you don’t provoke, he won’t provoke you.”</p><br/><p>Zeng Shu was wrong about this. If it was other people, Ming Xiaoyu really did follow that principle. But if the target was Cheng Su, Ming Xiaoyu was already figuring out how to make him not get on the supermodels world rankings list～╮（╯▽╰）╭ After listening to Zeng Shu’s words, Cheng Su’s face was clouded over. The assistant on the side couldn’t help trembling, before walking a few steps quicker and getting involved with his own business. In a place where Zeng Shu couldn’t see, Cheng Su’s eyes were ugly and filled with resentment.</p><br/><p>After Zeng Shu said a few more words, Cheng Su tried to keep his voice as calm as possible. “Then Brother Zeng, will I have to swallow it when I face him later?”</p><br/><p>Cheng Su’s voice was a bit wrong when he said this. It was as if every word was being squeezed out. But this was a phone call after all. Zeng Shu didn’t hear anything unusual and he was also busy with other things. Thus, he only said, “The rise of Ming Yu is already a certainty. There won’t be anything wrong with that man behind him. In addition, Ming Yu’s strength is obvious to all. You just have to work hard. I think it is possible to board the supermodel rankings in the third period. Don’t worry about Ming Yu.”</p><br/><p>Originally, Zeng Shu wanted to say that Xi Ze didn’t give much help to Ming Yu. But once he thought about it, he decided to conceal it. He would let Cheng Su think that Ming Yu’s success was due to the help of others, so that this kid would feel less embarrassed.</p><br/><p>Zeng Shu didn’t expect that on the other end of the phone, Cheng Su was pinching the phone tightly and his eyes were red with anger. But on the phone, he seemed fine. He just asked in a cold voice. “The third period? Okay, I understand. Thank you Brother Zeng. I will try.”</p><br/><p>The two people spoke for a while, with Zeng Shu informing Cheng Su of things he needed to pay attention to.</p><br/><p>Just as he was about to hang up the phone, Cheng Su pretended to ask casually, “Brother Zeng, when do you think Ming Yu can get on the leaderboards?”</p><br/><p>Zeng Shu was slightly stunned and a person he wanted to cooperate with happened to appear, so he only hurriedly said, “You should see his name on the list in a few days” before hanging up the phone.</p><br/><p>In the bright and spacious lounge, Cheng Su silently put down the phone.</p><br/><p>He looked up at the various posted on the wall of the lounge. The little assistant was about to ask him if he needed water when Cheng Su suddenly moved.</p><br/><p>He jerked forward and tore off one of his posters!</p><br/><p>After this, it was a second, third, fourth…</p><br/><p>All 12 posters were torn down! At the same time, the posters were torn into tiny pieces and scattered all over the floor of the lounge. The little assistant looked at the handsome man in front of him with horror.</p><br/><p>After venting, Cheng Su took a few deep breaths before looking at his assistant. “Xiao An, you have been with me for a few years. Brother Zeng doesn’t know what happened between Ming Yu and I in the past, but you should be clear about it.”</p><br/><p>The small assistant nodded. He got a wrong premonition in his heart and started calculating things but didn’t utter a reply.</p><br/><p>Cheng Su seemed to have discovered the small abacus in the assistant’s heart and directly clarified. “The things that you and I experienced in the past, we can say that it is tying up a grasshopper with rope. Brother Zeng always thought I didn’t like Ming Yu because I am envious and jealous of him. But out original matters, apart from you and I, only Ming Yu himself knows. I believe that as long as he is popular, it will be absolutely impossible for him to let me go. At that time, you will also have an accident.”</p><br/><p>The small assistant immediately paled when he heard this. “Brother Cheng, what do you…”</p><br/><p>“We have to act preemptively! In those days, he kept pestering me and I put a lot of pressure on him. I was close to him a few years ago and you know why. Brother Zeng doesn’t know about this so we can’t ask him for help. Now it is only you and me. Xiao An, listen to me. This is what we will do…”</p><br/><p>There was bright sunshine outside the window. September had arrived and the hot summer days were finally over. The people of the capital didn’t find it but a hint of cool autumn was slowly coming.</p><br/><p>Under the clear blue sky, Ming Yu finally arrived at the building for Suyi. The three people went upstairs under the guidance of an editor.</p><br/><p>On the far side of the ocean, a handsome and upright man wearing a simple black shirt was walking steadily through an open airport. He was very tall and the distance of every step was very large. The cuffs of his shirt were rolled up, revealing a thin and beautiful wrist.</p><br/><p>Once he reached a porthole, he chose to stop and look at the quiet night sky outside the window.</p><br/><p>He slowly took off the sunglasses on the bridge of his nose and seemed to notice something interesting. He picked up his phone, took a photo and then sent a text message.</p><br/><p>The long-legged man finally stopped and his breathless agent caught up with him.</p><br/><p>As soon as he arrived, Ding Bo cried out, “Xi Ze, why are you walking so quickly? Even if you go faster, the plane won’t take off when you come!”</p><br/><p>Xi Ze turned to the panting Ding Bo and asked in a strange voice, “I was walking quickly?”</p><br/><p>Ding Bo nodded. “Yes, I had to trot just to keep up!”</p><br/><p>There was a slight smile on the beautiful face that seemed to be in a good mood. Xi Ze sighed, “Well, I will pay attention later. After all, people with long legs must walk a lot faster than those with short legs.”</p><br/><p>Ding Bo, “……（/=＿=）/～┴┴”</p><br/><p>Damn it! Looking down on people with short legs…hey, who was looking down on a man who was 178cm?</p><br/><p>178cm was already much higher than the average height of Chinese men okay!</p><br/><p>You are the complete freak at 195cm!</p><br/><p>By the time he boarded the plane, Xi Ze still hadn’t received a reply from the youth. Xi Ze raised his brow slightly and looked at the recent Huaxia domestic news on his phone with an unpleasant expression. It was natural for a lot of media on the Internet to be comparing Ming Yu and Cheng Su.</p><br/><p>The more that he saw, the tighter Xi Ze’s brow became. In the end, he let out a disdainful sound, put down his phone and looked at his agent who was concentration on the flight attendant. “The staring at Cheng Su, how is it going?”</p><br/><p>After listening to this, Ding Bo and the flight attendant said a few more words before the other person left. Then Ding Bo turned his head and whispered, “Why do you have to say something like this so loudly? Of course I’ve been watching! I’ve been watching for over half a year. Before I went to the United States, I let Shen Xiang keep watching over him. You can rest assured.”</p><br/><p>Xi Ze let out a reluctant ‘hmm’ sound.</p><br/><p>After a moment, Ding Bo said curiously, “It is said that Cheng Su and your muse had a bit of a relationship but that is a thing of the past. Your character isn’t the type to keep grinding at a person. If you really want me to put him straight to death, I am very good at this type of thing. Haha.”</p><br/><p>Ding Bo didn’t intend to get an answer to his words. He turned on his phone and prepared to look at his emails.</p><br/><p>However, just as Ding Bo opened the phone, a low voice was heard beside him, “I don’t want to stare at him. Ming Yu asked me for him, so I must stare at him. Ming Yu said that the dog is anxious and will jump over the wall. With Cheng Su’s IQ, he will sooner or later do something boring.”</p><br/>\n</div>"}