{"title": "Chapter 153", "id": 153, "volume": 2, "url": "http://boxnovel.org/rebirth-of-a-supermodel-chapter-153", "volume_title": "Volume 2", "body": "<h1>Chapter 153</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 153</p><hr/><br/><p>Once she spoke these words, He Chaoman walked to the long table and continued to eat. But Ming Xiaoyu was thrown by her and could only helplessly face the once again jealous man.</p><br/><p>Ming Xiaoyu sincerely blinked. “I really don’t know her.”</p><br/><p>Xi Ze gave a low hum. “You don’t know her yet you walked down the red carpet with her.”</p><br/><p>Ming Xiaoyu was immediately filled with indignation. “She bullied me on the red carpet. You also saw it.”</p><br/><p>Xi Ze’s lips curved. “But she wanted to seduce you. I also saw it.”</p><br/><p>He didn’t wait for Ming Yu to reply. Xi Ze solemnly said, “She bullied you. I am very angry. I have decided to get compensation from you.”</p><br/><p>Ming Xiaoyu immediately blinked at the words. “What does this have to do with me?”</p><br/><p>“Our relationship, I have thought of a good script…”</p><br/><p>After all, there were many eyes watching. Xi Ze leaned over and whispered something into Ming Xiaoyu’s ears. They saw the white face of the youth slowly turn pink. In the end, he mercilessly pushed the man and smiled coldly, “In your dreams.”</p><br/><p>After that, Ming Xiaoyu raised his feet to walk away.</p><br/><p>Xi Ze chased him and whispered, “You really don’t like it?”</p><br/><p>It happened to be in a corner of the crowd. At this time, many people’s eyes left the two of them. Covered by a statue, Xi Ze gently squeezed the youth, making Ming Xiaoyu pause in his steps.</p><br/><p>Once the two people returned to the table, Ming Yu spoke into XI Ze’s ears in a very low voice, making the latter smile.</p><br/><p>In broad daylight!</p><br/><p>Under such circumstances, the guests at the RAmer Charity Gala didn’t know that had they been paying attention, they would’ve seen a secret agreement take place between the two people. There was a short script waiting to be acted out this evening!</p><br/><p>As for Ming Xiaoyu’s remark, did it seem like a rejection? Or was it shy consent?</p><br/><p>Wrong!</p><br/><p>The first half of the sentence was like this—</p><br/><p>[I am in a good mood today. Your script is okay. I will agree to it but I think there is room for modification…]</p><br/><p>As for the second half, it was ! Look! They were all directly swallowed by the ‘’ symbol!</p><br/><p>On the evening of September 15, 2017, the RAmer Charity Gala at the New York Museum of Art finished and media reporters from all over the world released news about the charity gala.</p><br/><p>The majority of participants were high level people. There were a lot of opportunities. They also knew a supermodel who had a good relationship with Xi Ze and a limitless future, Ming Yu.</p><br/><p>For a small number of people, such as Mudley, it was the hardest to swallow meal she ever had in her life. Almost everyone knew about what happened on the red carpet. They naturally knew that Mudley had offended Ming Yu and Xi Ze. This meant that apart from some people laughing at her, most people acted like she didn’t exist.</p><br/><p>Offending the godfather of the fashion industry, Mudley would have very difficult days in the future.</p><br/><p>Of course, among the guests, there were those like He Chaoman who left with satisfaction after eating their fill. There were many others like Luo Cheng who had been dragged away by a chief editor of a top magazine. Others, like Xi Ze and Ming Yu, drank together and no one interfered.</p><br/><p>The two of them said goodbye to many people before turning to their hotel.</p><br/><p>You ask why the two people were staying in the same hotel?</p><br/><p>It was a coincidence! Definitely a coincidence!</p><br/><p>You are asking why they are staying in two rooms next to each other?</p><br/><p>God, it was really wonderful that there was such a coincidence.</p><br/><p>However, you should ask why Mr. Xi didn’t return to his room that night. Instead, he approached the room next door…</p><br/><p>Well, Mr. Xi must surely be drunk.</p><br/><p>The whole evening, Ming Xiaoyu’s feelings for the RAmer Charity Gala weren’t that deep. After all, he had participated in many similar evenings in this life and even attended a dinner that was comparable to the RAmer Charity Gala.</p><br/><p>For Ming Xiaoyu, the most impressive thing was the soundproofing of this hotel…</p><br/><p>By the way, Mr. Xi was quite satisfied with the bed of the hotel. It was soft and big, at the same time, it didn’t make him toss from side to side. It was amazing～ The next day, Ming Yu accepted Raymond’s invitation to explore the headquarters of Rosalind. Then on the third day, he returned home with Xi Ze. Unexpectedly, he didn’t expect all of Huaxia to be boiling when he got off the plane. Various media articles and online news filled people’s eyes.</p><br/><p>[RAmer Charity Galan, the theme ‘Huaxia: Millennium Feng Shui, Bright Treasures’ that leads the world! Ming Yu won the best dressed male!] [The stars are shining as Xi Ze held hands with Ming Yu. The RAmer red carpet is completely taken over!]…</p><br/><p>Once he saw this last article, Ming Xiaoyu didn’t know if he should laugh or cry when he saw ‘Xi Ze held hands with Ming Yu.’ He showed the story to Luo Ru and Zhao Rui. Both of them felt that this title was too awful!</p><br/><p>What did they mean by ‘Xi Ze held hands with Ming Yu’?</p><br/><p>This was simple too ambiguous!!!</p><br/><p>Don’t think that these two people have an unusual relationship!</p><br/><p>Let’s not mention these media headlines. Many Ming Xiaoyu fans really felt refreshed after learning that their Small Mushroom also participated in the RAmer Charity Gala! In addition to a lot of career fans, the other fans were happy that Ming Xiaoyu could get an invitation to this party.</p><br/><p>You know, there was no more than 100 of the 370 supermodels around the world who could get an invitation!</p><br/><p>The RAmer Charity Gala might be the back garden fo the fashion industry but that didn’t mean a person could participate as long as they were a supermodel.</p><br/><p>According to media reports, apart from Ming Yu and Andrew, all the supermodels on the scene were within the two 80 of the two rankings lists. Only the current world’s fourth ranked female supermodel, Anna Cartman was unable to come since she was shooting a magazine cover in Africa. Otherwise, the top 10 supermodels of both rankings were at the scene.</p><br/><p>In such circumstances, Ming Xiaoyu unexpectedly became the focus of attention and won the ‘best dressed male’ title! What kind of reputation was this?</p><br/><p>It meant that in the entire fashion industry, he defeated Xi Ze, defeated Adenes, defeated Luo Cheng, etc. and won best dressed!</p><br/><p>【 In fact, I think the reason why Ming Xiaoyu could get first place is because his outfit is particularly suitable for the ‘Huaxia: Millennium Feng Shui, Bright Treasures’ theme. I just discovered that the gems at Ming Xiaoyu’s neckline are inlaid with dragon shaped gems, just like a real dragon of Huaxia. This is Millennium Feng Shui!】</p><br/><p>【 In any case, I like Ming Xiaoyu’s black diamond stud earrings! It is so beautiful. Lick lick lick… Hey, water has entered my ears QAQ! 】</p><br/><p>【 I have liked Ming Xiaoyu for more than a year. He is really serious and words hard. I have watched him progress to the current position. It is really great! Before, there were people who tried to blacken my Small Mushroom. My mushroom can attend RAmer, this is the strength of my mushroom! However, Small Mushroom must pay attention to his body. Giving you love =3= No regrets in loving Mushroom in this life! 】</p><br/><p>【 No regrets in loving Mushroom in this life+ 1! 】</p><br/><p>【 No regrets in loving Mushroom in this life+ 10,086! 】</p><br/><p>……</p><br/><p>Becoming the best dressed man at the RAmer Charity Gala, it was something that Ming Xiaoyu hadn’t expected.</p><br/><p>His clothes were completely made by the Ji and Ya studio and was a set with Xi Ze’s clothes. Moreover, Xi Ze had spent six months preparing his outfit. Ming Xiaoyu’s only took six days yet he defeated Xi Ze to win this honor?</p><br/><p>Xi Ze saw his confusion and explained. “The world doesn’t follow the theory of the longer it takes, the better it will be. A student might understand the theory of relatively but won’t be able to detect gravitational waves for 10,000 years. But if a group of outstanding elites studied together, they could get the true meaning of science. The person wearing it is you. That’s why I was able to get a good design inspiration to make such a dress. Only you can show off the beauty of this outfit. Ming Yu, you are my unique muse.”</p><br/><p>Starting with the explanation and then talking about love. In fact, Mr. Xi’s mushroom skills were really great ╮（╯＿╰）╭.</p><br/><p>The RAmer Charity Gala, which caused a whole three days of crazy discussions around the world, slowly faded out of sight. Ming Xiaoyu also forgot about the party and prepared for the next phase of his work.</p><br/><p>According to common sense, after the RAmer Charity Gala, the attention of fashion lovers should focus on various fashion weeks and fashion shows in the upcoming months. By the way, they should also ask the World Supermodels Organization about why this month’s world supermodels leaderboard was so late.</p><br/><p>However, the heat of the RAmer Charity Gala hadn’t completely subsided when the American newspaper, the Sun released a report that attracted global attention.</p><br/><p>[Hollywood’s popular new star’s desolate end, Mudley Joyce threatens: I will never attend the RAmer Charity Gala again!]</p><br/>\n</div>"}