{"title": "Chapter 155", "id": 155, "volume": 2, "url": "http://boxnovel.org/rebirth-of-a-supermodel-chapter-155", "volume_title": "Volume 2", "body": "<h1>Chapter 155</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 155</p><hr/><br/><p>The Sun’s report was quite simple. It was just like the title: Ming Yu is the best dressed male at the RAmer Charity Gala. Who is he wearing?</p><br/><p>There were more than a dozen high-end studios in the world. Whenever a new work was born, no matter who privately ordered it, the studio would inevitably display the outfit on their own website. It would introduce the outfit and the materials for those who were curious.</p><br/><p>It was probably because this thing was customary for hundreds of years. The high-end studios produced more than 100 or even 200 outfits per year. Therefore, outsiders didn’t understand this thing and insiders naturally wouldn’t inquire about these types of things. Only the fashion lovers would come to see an outfit at the high-end studios and inquire about them.</p><br/><p>Since Ming Yu won the best dressed male award at the RAmer Charity Gala, everyone assumed he was wearing clothing from a high-end brand.</p><br/><p>The first-class fabric, the super craftsmanship, the inlaid jewelry and the smooth cut of the fabric. If this wasn’t high-end then how could it have such a beautiful impact? After Ming Yu put on the outfit, he really crushed all the men in the audience. Even Xi Ze seemed inferior and the red carpet photos were proof!</p><br/><p>However, now the Sun raised a question. Whose outfit was Ming Yu wearing?</p><br/><p>No one could answer this question. Ming YU didn’t publish the relevant information of the outfit onto his official website and no studio indicated that it was their work. The Sun’s report showed that their reporter spent an afternoon searching the official websites of all high-end studios in the world and didn’t find the outfit!</p><br/><p>At this point, the world’s fashion enthusiasts were in an uproar!</p><br/><p>No high-end studio claimed this outfit?</p><br/><p>What was this situation? It wasn’t a high-end outfit?</p><br/><p>It was impossible. Such workmanship, tailoring and design aesthetic, this was definitely a high-end outfit. It got first out of all the men at the charity gala!</p><br/><p>As everyone was feeling depressed, the next day… The Sun published another article!</p><br/><p>According to the Sun, they interviewed a well-known design master (anonymous) and the design master said he seemed to have seen this design style before. The master searched again and found a piece of information—</p><br/><p>In the spring 2017 Ji and Ya show, there was an outfit with a strange sense of similarity!</p><br/><p>The shock of this wasn’t so simple! The world’s fashion industry was stunned!</p><br/><p>They hurried to look at the two photos the Sun posted. One was the high-end outfit of Ji and Ya and the other was the outfit that Ming Yu wore at the RAmer Charity Gala.</p><br/><p>This contrast!</p><br/><p>The two weren’t exactly the same. It could be said that more than 50% of the design was different. However, the fashion people found that the two outfits had a strange sense of similarity!</p><br/><p>In particular, the embroidery technique, the choice of gemstones and the method of inlaying was really similar to Ji and Ya’s. It was as if someone had designed another outfit in contrast to this one.</p><br/><p>Art was really amazing and artistic senses were elusive.</p><br/><p>The two outfits were completely different but when placed next to each other, there was a weird similarity. If the outfits were worn by two people, they were clearly completely different. Men and women, old and young, they would all think so. However, they would also feel that the temperament was the same!</p><br/><p>It was because the core things were exactly the same.</p><br/><p>This time, the global fashion industry was really boiling!</p><br/><p>There were still many such plagiarism incidents in the world. Some small stars and small models couldn’t afford high-end clothing and couldn’t borrow them from studios. They could only cooperate with small studios. Most of these incidents became jokes that people gossiped about and soon forgot. But this time was different.</p><br/><p>This was the RAmer Charity Gala!</p><br/><p>This was the Oscars of the fashion world!</p><br/><p>There were so many design masters and top supermodels gathered. Yet the chosen best dressed male was wearing a plagiarized outfit!</p><br/><p>【 Hahaha, I didn’t expect the Huaxia people to actually plagiarize. This small model isn’t qualified to wear high-end outfits. 】</p><br/><p>【 Wearing plagiarized clothes is really a shame of the fashion world! 】</p><br/><p>【 I am dying of laughter. This is supernova in Huaxia? Shouldn’t he be driven out of the world’s supermodel list? This model copying another outfit is completely ineligible to become a supermodel! 】……</p><br/><p>Originally, the Huaxia netizens had gained the upper hand. Now that the consecutive Sun reports came out, the Huaxia netizens were blindsided. But some people still questioned it.</p><br/><p>【 Ji and Ya’s chief designer Xi Ze and Ming Yu follow each other on Weibo and the Muse official website. They also walked towards at the charity party. Wouldn’t the chief designer of Ji and Ya see that this outfit is very similar to the one he designed It is ridiculous! 】</p><br/><p>【 LS＋1. I also think this matter if full of gaps. If other design masters can see that it is similar to Ji and Ya’s outfit, why can’t God Xi? This outfit was designed by God Xi. Since he didn’t propose the ‘Ming Yu plagiarism,’ it must be an inside job! 】</p><br/><p>The Huaxia netizens were temporarily sensible. While others were upset and watching the American netizens silently, Ming Xiaoyu’s fans actively stood up and put forward their own views.</p><br/><p>After all, there were really a lot of doubts about this incident. As the Sun said, Ming Yu had walked the second half of the red carpet with Xi Ze and the photos proved it.</p><br/><p>Let’s not talk about whether Ming Xiaoyu abandoned Mudley or not. How could Xi Ze and Ming Yu walk together but Xi Ze didn’t know that this outfit was similar to the one he designer?</p><br/><p>But in this regard, the Western netizens and some of Ming Xiaoyu’s Huaxia sunspots ridiculed it.</p><br/><p>【 Who knows how Ming Yu hooked Xi Ze? Maybe Xi Ze just saw that they were from the same company and reluctantly walked with him. He probably didn’t even look at Ming Yu or pay attention to what this small model was wearing. 】</p><br/><p>【 Hey, the brainless fans saw Ming Yu in this outfit and didn’t question it. Does this mean that Xi Ze agreed? Your face is really big! As big as the Pacific Ocean! Next you will say that this outfit is really designed by someone at Ji and Ya? I’m really laughing ato death, ahahahah! 】</p><br/><p>【 Hey, isn’t your skin too thick? Ji and Ya is at the top. How can they make clothes for a small model? Did you go to heaven? I will eat shit if this is an outfit from Ji and Ya! 】</p><br/><p>【 Hahaha, LS include me as well! I will throw myself in the ring! 】</p><br/><p>【 You are too bad, bullying the brainless fans! Add me. I want to swim in Yangtze River! 】…</p><br/><p>Once the black material was caught, there was no need for the fighting power of the Westerners. The Huaxia sunspots of Ming Xiaoyu directly controlled the field, typing all sorts of ridicule.</p><br/><p>At this time, the scene was chaotic. The fans from Huaxia went to the American social network. The Americans were outsiders and couldn’t even insert a word. They could only look at the two sides go to war.</p><br/><p>Of course, there were some Americans who wanted to interject. However, when the two Huaxia sides encountered a foreign enemy, they immediately turned against them. They made the foreigners spray blood before continuing to fight.</p><br/><p>These things, Ming Xiaoyu naturally knew about them. Luo Ru was always concerned about the fans. Once they found out, both of them were silent and didn’t know if they should laugh.</p><br/><p>“Xiaoyu, are these sunspots your sunspots or your fans?”</p><br/><p>Ming Xiaoyu carefully pondered the words before sighing. “Sister Luo, I seem to have heard a saying. In the depths of the fans, there is a natural darkness!”</p><br/><p>The two people sighed as they watched the sunspots made things bigger. At the end of the day, even the Sun didn’t say a word. At this time, Ming Xiaoyu calmly retaliated. He contacted Shen Xiang and published several articles in Huaxia’s global media.</p><br/><p>The first report was—</p><br/><p>[Huaxia’s annual blockbuster An Li! With an investment of 2 billion, it is a classic big production!] Once this report came out, the whole world was amazed!</p><br/><p>There weren’t many movies who made two billion at the box office. Now An Li had a 2 billion yuan investment. What a terrible gap!</p><br/><p>Immediately, some fans thought: 【 Ehhh? I remember that a Hollywood actress’ fan said that his actress played a supporting role in a 2 billion box office movie～ Hey my Small Mushroom is participating in a big movie with a 2 billion investment～233333 】</p><br/><p>The second report was—</p><br/><p>[The October issue of Suyi, the cover person is him!] The second heavy attack made the world’s fashion people pay attention!</p><br/><p>Suyi was Huaxia’s oldest top fashion magazine. It was founded 10 years earlier than the top US magazine, Edith. The sales of Suyi in the past few years might be the lowest of the world’s top four magazines but its influence in the global fashion industry was unquestionable.</p><br/><p>Moreover, Suyi focused on women’s fashion and rarely invited male models to be the cover person!</p><br/><p>Ming Yu could actually become the cover model of Suyi. How could a Hollywood newcomer compare? You know, half of the top 10 on the world’s supermodels list hadn’t been photographed on the cover of Suyi.</p><br/><p>As for the third report, Ming Xiaoyu contacted some people and had it published in newspapers, magazines and official websites—</p><br/><p>[The Ji and Ya studio has issued a statement. The outfit Ming Yu was wearing at the RAmer Charity Gala was specially made for him by Ji and Ya.]</p><br/>\n</div>"}