{"title": "Chapter 177", "id": 177, "volume": 2, "url": "http://boxnovel.org/rebirth-of-a-supermodel-chapter-177", "volume_title": "Volume 2", "body": "<h1>Chapter 177</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 177</p><hr/><br/><p>The low and magnetic male voice was heard behind everyone.</p><br/><p>Everyone was surprised and turned around. Even Ming Yu’s eyes widened because he didn’t think the other person would suddenly appear.</p><br/><p>If other people were unfamiliar with this voice, Ming Yu recognized it instantly. But despite knowing who this person was, Ming Xiaoyu didn’t understand how this man could suddenly appear here when he was supposed to be on the other side of the world.</p><br/><p>At this moment, Ming Yu and Andrew’s group were standing at the entrance of the parking lot. The underground parking lot was full of lights. But it was still underground so the lights were a bit dim.</p><br/><p>In the shadow of the darkness, they saw a tall man calmly walk out. His pace was steady and his shoes made a clear sound that rang in everyone’s heart.</p><br/><p>As the handsome face of the god appeared in the light, Mr. Will and Andrew’s agent sucked in a breath and subconsciously turned to look at Andrew.</p><br/><p>The previously arrogant Andrew now went through a big change. His hands holding the phone completely hung down towards the ground. Andrew stared blankly as Xi Ze approached. His lips moved but in the end, he couldn’t speak a word.</p><br/><p>Xi Ze looked indifferently at the pale-faced Andrew. Then he looked down at Ming Yu and asked, “Who is this person, do you know?”</p><br/><p>Originally, Ming Xiaoyu was reluctantly smiling. After hearing Xi Ze’s words, Ming Yy didn’t have a chance to reply when Mr. Will couldn’t help laughing. After seeing Xi Ze look at him, Mr. Will smiled and said seriously, “This is Andrew Wallen. His mother is the chief designer of Karma, Mrs. Wallen.”</p><br/><p>Xi Ze made a meaningful ‘oh’ sound and looked at the pale Andrew. “Andersu…”</p><br/><p>“Pfft, haha!”</p><br/><p>“Pfft…”</p><br/><p>Mr. Will couldn’t hold back his laugh and even the serious Luo Ru couldn’t help laughing. Luo Ru looked at Ming Xiaoyu, her eyes saying ‘Xiaoyu and Mr. Xi are really very good.’ In this regard, Ming Xiaoyu could only smile helplessly.</p><br/><p>“Andersu, I know your mother. However, you haven’t answered his previous question.” As if he wasn’t aware of Andrew’s expression, Xi Ze calmly asked, “You think you can surpass Luo Cheng, Du Ruo and He Chaoman. Then do you think you can surpass me?”</p><br/><p>The world’s first ranked supermodel stood in front of a newcomer and seriously asked this question.</p><br/><p>Xi Ze seemed normal, as if he was asking a question as Andrew’s elder. However, his question caused Andrew to stiffen and not know what to say.</p><br/><p>Andrew hesitated for a long time before eventually saying, “Mr. Xi, you might be at the top now but I am still young! I believe I can defeat you. I have self-confidence and my youth. This is my strength!”</p><br/><p>“Oh?” At this answer, Xi Ze’s lips thinned and his original indifferent eyes suddenly became cold. His gaze seemed to be able to completely freeze people. He lightly glanced at Andrew and sneered. “Didn’t you hear what I said? I said that you can never enter the world’s supermodel rankings in this life.”</p><br/><p>Andrew’s expression changed. “What do you mean, Xi Ze!”</p><br/><p>These words completely angered Andrew. He didn’t use honorifics and directly questioned Xi Ze.</p><br/><p>Andrew felt that Xi Ze was only eight years older than him. Why should he respect this man? Xi Ze might be the best in Huaxixa and the chief designer of Ji and Ya, but it was impossible for Xi Ze to spit in his mother’s face!</p><br/><p>Well, unless Xi Ze chose to become Karma’s enemy!</p><br/><p>At this time, Andrew didn’t know. In Xi Ze’s eyes, Karma was really nothing.</p><br/><p>In the past, this man dared to tear Rosalind’s invitation right in front of its chief designer. The present Xi Ze would dare to go directly to the Karma studio and throw garbage on Mrs. Wallen and Karma!</p><br/><p>Of course, this was just an example. Karma’s design style and level were still good. In Xi Ze’s eyes, they were a pretty good brand. But just because some people had talent didn’t mean she had the quality to match. When it came to raising her child, Mrs. Wallen was simply an irrational and stupid person.</p><br/><p>Now Andrew unexpectedly dared to scream at Xi Ze. If Raymond saw this, he would think that ‘a newborn calf isn’t afraid of a tiger.’ He would also blame Mrs. Wallen for spoiling her son. She probably didn’t think that one day Andrew would clash with Xi Ze. If she had expected this day, she would’ve definitely educated her son: If Xi Ze scolds you like a dog, you have to go along with it!</p><br/><p>Who do you know who previously received this lesson?</p><br/><p>Raymond, the chief designer of Rosalind, didn’t want to talk about it.</p><br/><p>It was rare to see a model in the industry dare to confront him to his face. Xi Ze felt it was quite novel. He raised his eyebrows and asked, “What did you say? I can’t seem to hear you clearly.”</p><br/><p>Andrew was already enraged by the other person saying he could never enter the world’s supermodel rankings. Xi Ze’s current indifferent appearance made him more furious and he taunted, “Mr. Xi, aren’t you taking things for granted? This isn’t Huaxia. It is the west! The United States isn’t yours. I am Andrew Wallen and I will enter the world’s supermodel rankings with my strength. Why are you saying that I won’t go up?”</p><br/><p>“Because I said it, you won’t be able to go up.”</p><br/><p>Andrew wasn’t angry and laughed. “Hahahaha! Who do you think you are? Can you really manipulate the World Supermodels Organization? Xi Ze, I will never go to Huaxia in my life so don’t think you can fully control the situation. Don’t even think about threatening me!”</p><br/><p>After these words finished, Xi Ze didn’t open his mouth. There was a long silence before Ming Yu suddenly asked, “When did your temper become so good?”</p><br/><p>Andrew saw the man’s lips curve upwards as he sighed softly. “I thought you wanted my temper to become better.”</p><br/><p>Xi Ze spoke in Chinese so the anti-Huaxia Andrew and his agent naturally didn’t understand. But Mr. Will made a startled expression and looked at Xi Ze and Ming Yu with horror.</p><br/><p>If Ming Yu and Xi Ze were in such a relationship, then Xi Ze was Ming Yu’s patron!</p><br/><p>Andrew dared to insult Xi Ze’s lover in front of him, this was a death sentence! Compared to Ji and Ya, Karma was really not enough! Compared to Xi Ze, Mrs. Wallen wouldn’t be able to defend her son!</p><br/><p>Ming Yu smiled and replied in Chinese, “I am a bit hungry. Use your favourite method.”</p><br/><p>Xi Ze raised an eyebrow. “I will listen to you.”</p><br/><p>Xi Ze turned to Andrew and spoke calmly in English. “Andrew, even your mother wouldn’t dare speak to me in such a tone if she was here now. I am currently in a good mood so get lost back to America. For a year, I don’t want to see you anywhere. If I see you, guess what will happen.”</p><br/><p>The voice was flat and contained no anger. It was as if he was saying, “What should we eat tonight?” But the contents caused Andrew to be shocked. He screamed with wide eyes, “Xi Ze, who do you think you are? I will have Uncle Leo come to talk to you and see if you are qualified to do this! This is London, not your Hua…xia…”</p><br/><p>Andrew’s voice abruptly stopped.</p><br/><p>He watched in horror at the two men walked slowly out of the darkness.</p><br/><p>The gentle-looking man with a smiling face and silver glasses looked at him with strange eyes. And walking in the rear was an old man. He looked at Andrew and sighed. “Andrew, I heard the whole thing. Listen to Xi Ze and go back to the United States.”</p><br/><p>Andrew couldn’t believe he was listening to this. After a long time, he cried out, “Uncle Leo! He is bullying me. You have watched me grow up. How can you let him bully me in London? Why is he doing this to me? I have to participate in the fashion show, I will participate in the fashion show tomorrow!”</p><br/><p>Leo Todd, the chief designer of Mary, stared at Andrew for a long time with complicated eyes. Then he said, “Andrew, you are 17 years old. This isn’t too young and you should pay attention when talking in the future. Your mother won’t always be able to protect you. Don’t take part in this fashion show and have a good rest.”</p><br/><p>“But what did I do wrong?”</p><br/><p>At this, everyone (except Ming Yu and Xi Ze) showed a strange expression. Even Andrew’s agent looked at Andrew like this.</p><br/><p>The agent was completely on Andrew’s side but at this moment, he realized that Andrew truly had no brains!</p><br/><p>Master Leo looked helplessly at Andrew. “I am doing it for your own good. Go back to the United States.” Then Master Leo looked at the agent and his eyes were suddenly cold. “Don’t think I don’t know that you spoil him every time, making him become more and more arrogant. You are also the culprit behind Andrew becoming like this. Once you return to the United States, tell Lisa that her son needs to be disciplined!”</p><br/><p>The agent nodded while sweating.</p><br/><p>Andrew still wasn’t convinced. “Uncle Leo! You are standing on their side as they bully me! Aren’t you afraid that my mother will come to you if she knows? I really call you Uncle! Yet you don’t help me but help them instead!”</p><br/><p>Master Leo was so angry that he could not speak clearly. “You …! You are simply unreasonable!” Master Leo decided to leave and said to Xi Ze. “Xi Ze, please forget this thing for me. In the next three months, Andrew won’t have any jobs and I won’t let him enter your sights for a year.”</p><br/><p>Andrew couldn’t believe this and stared with wide eyes.</p><br/><p>Xi Ze said not to enter his field of view for a year. Now Master Leo was going to deprive Andrew of all jobs for the next three months?</p><br/><p>Andrew was so furious that he swore, all types of rude and dirty words emerging. His fingers trembled as he scolded Master Leo, blaming this heartless and supercilious wolf.</p><br/><p>As Andrew was slobbering and Master Leo was so angry he swore he would never take care of this uneducated and stinky boy again, Xi Ze raised his eyes and asked in a surprised tone, “Did I say he could receive any jobs in the next year?”</p><br/><p>Everyone was stunned by these words while Ming Yu could only smile helplessly.</p><br/><p>Xi Ze’s cold gaze fell on Andrew’s body, followed by a mocking sneer. “I said not to let me see you anywhere in the next year. This includes magazines, fashion shows, the newspapers, the Internet…”</p><br/><p>“If you let me see you again Andrew Wallen, do you know what will happen?”</p><br/>\n</div>"}