{"title": "Chapter 171", "id": 171, "volume": 2, "url": "http://boxnovel.org/rebirth-of-a-supermodel-chapter-171", "volume_title": "Volume 2", "body": "<h1>Chapter 171</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 171</p><hr/><br/><p>Xi Ze was a person who enjoyed his comforts, which could be seen from his Muse studio.</p><br/><p>Ming Yu had already prepared himself but once he stepped into this man’s studio in Ji and Ya, he couldn’t help whispering, “The evils of the rich.”</p><br/><p>Xi Ze’s studio was set up on the 57th floor of the Ji and Ya building, which was above the Ji and Ya high-end studio. It was the second highest level in the building, just below the 58th floor set aside for the board of directors.</p><br/><p>The huge studio occupied the entire floor. The style was simple, a black and white modern style. The large area used a variety of glass materials to turn the whole room into a unique and transparent world. Once Ming Yu stepped on the transparent glass floor, he could see the clear water flowing underneath and it had a strange beauty.</p><br/><p>Ming Xiaoyu filled with hatred, “?＿?”</p><br/><p>Ming Xiaoyu would pay off his mortgage next month but he still lacked a car. He was wondering what type of car to buy because he had to decide which one was cost effective while maintaining face. Don’t think that Small Mushroom was a pure-hearted mushroom. He was a public figure now and had to pay attention to his image!</p><br/><p>In fact, MIng Yu’s current value based on his various endorsements and paychecks combined was enough for him to buy an extremely expensive luxury car. But as a model who often attended various shows and evening parties, Ming Xiaoyu had to save money in case he needed to buy high-end clothing.</p><br/><p>Many people liked to borrow high-end clothing to attend parties but Ming Yu didn’t like it.</p><br/><p>Once he really chose an outfit, he would buy it. It was because as long as he was willing to wear it to attend a party, it must be an outfit that he really liked. This was probably a collection addiction ← if he had a favourite outfit then he wanted to buy it.</p><br/><p>But this collection addiction was really too extravagant!</p><br/><p>The poor Small Mushroom hadn’t yet paid off his mortgage or bought a car ╮（╯＿╰）╭ Ming Xiaoyu was filled with resentment and he said angrily, “In view of your wasteful spending, I have decided to add a third house rule. In the future, the financial power of the family will be controlled be me. Every time you withdraw more than 100,000, you must declare it!”</p><br/><p><i>Cough.</i></p><br/><p>At these words, Xi Ze unexpectedly staggered and almost fell!</p><br/><p>This reaction almost made Ming Xiaoyu shocked. His words were half-joking. How could XI Ze be so ‘scared’ that he almost fell? Was this normal? Was there something in Ming Yu’s words that shouldn’t be said?</p><br/><p>Xi Ze looked at Ming Yu with a strange expression and asked hesitated, “Am I a wasteful spender?”</p><br/><p>Ming Xiaoyu answered without hesitation. “Of course!” Look at your studio. Isn’t the window electronically controlled? Doesn’t this glass floor also cost a lot of money? Real water is actually introduced! And the painting on the wall… oh my! Isn’t this painting a Van Gogh? Do you dare say that you aren’t a wasteful spender?”</p><br/><p>Ming Xiaoyu finally couldn’t bear it when he saw the painting by Van Gogh.</p><br/><p>This painting wasn’t as famous as Van Gogh’s The Starry Night or Sunflower. However, even the art ignorant Ming Yu recognized it. It must be a famous work of Van Gogh and would go for tens of millions at auction. Billions might be possible!</p><br/><p>After listening to Ming Yu’s explanation, Xi Ze sighed with relief. He grabbed the youth’s waist and said innocently, “You have really wronged me. This painting is from Teacher’s collection and has nothing to do with me.”</p><br/><p>Xi Ze had two teachers. When he was young, he was inspired by the Italian design master Hornby. Once this teacher died, Ms. Ji Heya took him as a student and asked him to serve as Ji and Ya’s assistant designer until she died.</p><br/><p>After listening to this explanation, Ming Xiaoyu asked suspiciously, “Is it really that simple?”</p><br/><p>The man put his other hand on the youth’s waist. With his taller height, he bent his head slightly to look at the youth in front of him with a gentle and tolerant gaze. His tone was solemn as he said, “Yes, it is really so simple. Home Master, your eyes are so good. You can see the most expensive thing in this room at a glance. The other things added up aren’t as expensive as this painting.”</p><br/><p>Although Ming Xiaoyu felt that things weren’t so simple, he looked at Xi Ze’s face and found that this person wasn’t lying. Since it was just a fraction of the painting’s price, it wasn’t particularly wasteful spending.</p><br/><p>Well, Ming Yu would let it go this time.</p><br/><p>A famous painting worth 98.6 million, a value of 8.6 million was really just a fraction of it.</p><br/><p>Xi Ze and Ming Xiaoyu spent the afternoon in the studio. In the beginning, Xi Ze chose Ming Yu as a model and designed an outfit for him. After that, the drawing task became more and more vivid.</p><br/><p>The painter said that if the jacket was taken off, the body’s lines would be better revealed and he could design the fitted curves. The painter said that if the T-shirt was also taken off, it would show the beautiful clavicle and design a personally fitted outfit.</p><br/><p>Ming Xiaoyu would be stupid if he really took his clothes off!</p><br/><p>Ming Yu sneered at this blatant act of bullying and directly put on his coat. He ignored the other person to go to the table, reprimanding the man. “There is nothing wrong with my eyes. Mr. Xi, your nasty mind can’t escape my…eyes…! What is this?!!”</p><br/><p>He saw that on the table, a half-naked upper body was vividly drawn on the paper!</p><br/><p>The smooth curves of the waist, the raised clavicle line, each pen sketch was just right! Every curve of the line was filled with an ambiguous colour! Don’t mention the other people who would see this drawing. Ming Xiaoyu was so shocked that his mouth fell open!</p><br/><p>What was this expression?</p><br/><p>What exactly was this facial expression?!!</p><br/><p>Ming Yu knew his own expression the most! He had clearly only been smiling normally. Why did he become so beautiful… cough, so uncomfortable under the man’s pen!</p><br/><p>Ming Yu’s expression changed as he said, “What the hell are you drawing?”</p><br/><p>“I am drawing you.”</p><br/><p>Ming Xiaoyu, “…”</p><br/><p>After a moment, he continued, “This isn’t me at all! I am wearing clothes! I didn’t look at you with this expression. I was obviously sitting opposite you. How can you draw it like this?”</p><br/><p>The handsome and graceful man sighed before saying meaningfully, “I am drawing you from last night.”</p><br/><p>Ming Xiaoyu, “…（┙&gt;∧&lt;）┙へ┻┻”</p><br/><p>Who was silly enough to love a designer?</p><br/><p>In the latter half of the afternoon, Mr. Xi’s wish for office play didn’t come true but he managed to achieve his lover’s kiss. By the time the two people packed up and left the studio, Ming Xiaoyu’s cheeks were slightly red and a few red dots on his chest were covered by his clothes.</p><br/><p>Ming Yu asked casually, “By the way, who called you today?”</p><br/><p>Xi Ze didn’t think too much of it as he replied, “Luo Cheng had a bit of trouble in the United States. Rosalind asked him to shoot a semi-nude poster that only used leaves to cover the key parts. The photographer was a woman and he was a bit shy. Therefore, he looked for Wenya, Wenya looked for Dingbo and Dingbo came to me.”</p><br/><p>Ming Xiaoyu heard this and nodded. “It turned out to involve Luo Cheng and Rosalind…”</p><br/><p>After a moment, the youth’s eyes suddenly widened and he looked at the man next to him. “Wait! No wonder I didn’t feel it was right before! Weren’t you meeting with Elder Chen before when you received the call today? It was clear that Alice was taking me around. How did Elder Chen suddenly appear?”</p><br/><p>Ming Xiaoyu asked a few questions before becoming enlightened. “Yes! How can there be such a coincidence? You told Elder Chen to tell me those things! Honestly confess. Didn’t you have Elder Chen tell me those things?”</p><br/><p>Xi Ze raised his eyebrows with surprise and asked in a puzzled tone, “Eh? Did Uncle Chen tell you something?”</p><br/><p>If this had been when Ming Xiaoyu first entered a relationship with this man, he might’ve been deceived by the acting. Now both of them were an old husband and wife for a long time. Ming Xiaoyu clearly knew how black this man was.</p><br/><p>He sneered and said, “If you honestly admit it, tonight I will allow you to…”</p><br/><p>“Yes, I let Elder Chen go to you.”</p><br/><p>Ming Xiaoyu, “…”</p><br/><p>Xi Ze spoke very seriously. “Come on, you have to catch a plane tomorrow morning. One half-hour of a night in spring is worth a thousand taels.” (TL: Basically, every minute is important)</p><br/><p>Xi Ze pulled his wrist towards the car and Ming Xiaoyu spoke indignantly. “You are simply too bad! When Elder Chen said those things, my heart was distressed. I was also thinking about how to comfort you today. How can you lie to me like this?”</p><br/><p>Ming Yu was so stunned that he forgot his seat belt. Therefore, before driving, Xi Ze leaned over to help him fasten the seat belt.</p><br/><p>A long strand of hair gently fell over his forehead. His eyes were serious, as if he was looking at the world’s most precious treasure. Every movement was careful and thoughtful.</p><br/><p>In front of such a devoted gaze, the anger in Ming Yu dissipated.</p><br/><p>Xi Ze slightly turned to press a light kiss against the young man’s lips. Then he smiled. “I didn’t lie to you. These things did happen and I chose to let you know about it. I wanted you to understand that I’m not an omnipotent person. You should know more about me, understanding my life and my whole self. Perhaps some selfless people might think that as long as their lover is happy, it is fine. But Ming Yu, I am a selfish person. I like your distressed expression when you feel bad for me and I also like when you cry. Of course, you are only allowed to cry in bed.”</p><br/>\n</div>"}