{"title": "Chapter 184", "id": 184, "volume": 2, "url": "http://boxnovel.org/rebirth-of-a-supermodel-chapter-184", "volume_title": "Volume 2", "body": "<h1>Chapter 184</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 184</p><hr/><br/><p>After Andrew’s incident, the people of the world scolded him for a full month before feeling relieved.</p><br/><p>In any cause, paying attention to this type of racist who had no qualities would only make themselves feel bad. Let him stay where he was. No one cared about how miserably this scum was living.</p><br/><p>However, after the Andrew racist incident, some people started to feel suspicious about who recorded it.</p><br/><p>In the audio, there were only three voices. There was Andrew’s voice that didn’t change, Ming Yu’s voice and a voice that seemed to belong to a Ruth Mary staff member. Andrew wasn’t stupid enough to record himself. Then…</p><br/><p>【 Ming Yu was responsible for this matter? He stirred it up himself?! 】 Many people supported this view. Ming Xiaoyu had received more and more fans since he became famous., However, his sunspots were growing at a rapid rate. Not to mention that other small models were secretly staring at him with envy.</p><br/><p>But this view was quickly overwhelmed by the masses.</p><br/><p>Even if Ming Yu did record it, so what? Was Andrew not an anti-Huaxia person? Was he not a racist? Did he not bully Ming Yu and try to drive him out of the Ruth Mary high-end show?</p><br/><p>Later, the gossip media called Richard published a video.</p><br/><p>It seemed to be the surveillance video of the parking lot. An official from Richard said they obtained this information from the monitoring on the parking lot. In order to protect the interests of the innocents involved, they only selected and released the video. Now that people were doubting the source of the recording, they would also expose the video.</p><br/><p>In the dimly lit surveillance window, the netizens could see an aggressive and domineering blond man looking disdainfully at a handsome young man. And the latter? He could only bit his lips. There seemed to be tears in his eyes but he still tried hard not to succumb to this evil force!</p><br/><p>【 Mushroom! QAQ It really is Mushroom QAQ Ahhh, how can you bully Mushroom so much. Mushroom is crying!!! 】</p><br/><p>【 This is the first time my family’s Ming Xiaoyu is being bullied like this! I am mad! I don’t know where Andrew went to die but he better hide. If I see him then I will hit him with rotten eggs!! 】</p><br/><p>【 Ming Yu is really pitiful. I just combined the audio and video today. He was really pushed by Andrew and tried to maintain his dignity. He wasn’t angry when Andrew tried to make him apologize but he couldn’t give up when Andrew insulted Huaxia. Good Ming Yu! Passersby turned to a fan!!! 】……</p><br/><p>As a result, more and more passersby became fans of this stubborn and strong young man.</p><br/><p>They started to search for various posters and MVs of this youth. When the watched the many fashion shows that the youth had walked in, they couldn’t help sighing sadly. 【 If I knew you were so handsome then I would’ve already been a fan ahhhhh!!! I love Mushroom for a lifetime!! 】 There was no need to mention how Richard got the recordings of the surveillance video (╯_╰) ╭ .</p><br/><p>After Richard released the video, more and more people liked Ming Xiaoyu.</p><br/><p>The sympathy card was a really good one!</p><br/><p>Even Zhao Rui didn’t think there would be such a powerful effect!</p><br/><p>In the early stages of the Andrew incident, attention on Ming Xiaoyu increased. Now it had been on month and Ming Yu’s search index had already surpassed second place by at least three times! And it was still soaring at a frightening rate!</p><br/><p>At the same time, Ming Yu’s Weibo fans broke through 80 million during this period! Even Xu Rongrong, who had more than 70 million fans, became the fourth ranked Muse supermodel when it came to Weibo fans.</p><br/><p>On the Muse website, the number of Ming Xiaoyu fans was also frightening. One month ago, he had been ranked 9th. Now there was a crazy increase of millions of fans. The total amount was 26 million and he soared to the 4th position. He once again defeated Xu Rongrong.</p><br/><p>There was a small episode in regards to this. When the number of Xu Rongrong’s Weibo fans was defeated by Ming Yu, she joked on Weibo that Ming Xiaoyu owed her dinner. She lost to Ming Xiaoyu and felt envy and hate.</p><br/><p>Ming Yu politely responded to her.</p><br/><p>Xu Rongrong was just joking. After all, she still had millions more fans on the Muse official website than Ming Yu. Weibo dans didn’t need to answer 100 tough questions or pay membership fee. When it came to gold content, Ming Yu’s official Muse website fans were much worse.</p><br/><p>However, just three days later…</p><br/><p>【 Xu Rongrong：（⊙⊙）The rear waves of the Yangtze River driving on those before it (the new is constantly replacing the old)! I was killed on the beach by @Ming Yu! Must treat me, treat, treat!!! 】</p><br/><p>Ming Xiaoyu couldn’t only laugh and cry at this. In the Muse company, he brought Xu Rongrong a cut of afternoon tea in compensation for not ‘giving a lady face.’</p><br/><p>This result made Zhao Rui feel great emotional. “Xiaoyu, at the beginning I didn’t understand why you told Shen Xiang not to find a domestic media, making him find Richard after great difficulty and letting Richard publish this recording. It seems you already know that if it was published in the domestic media, these sunspots wouldn’t be thinking about Andrew. They would think you are trying to hype yourself up and even pour dirty water on you!”</p><br/><p>The handsome youth smiled humbly, hiding his achievements.</p><br/><p>Now in the Muse Modelling Agency, he was ranked 42nd and temporarily behind eight supermodels such as Xi Ze, He Chaoman, Luo Cheng and Xu Rongrong. But when it came to Muse fans, he already surpassed Xu Rongrong and was only second to Xi Ze.</p><br/><p>The current Ming Yu had an extremely high popularity. It could even be said that his global popularity definitely wasn’t any worse than Luo Cheng. What he lacked now was better resources. He needed more jobs and achievements to prove himself and use his strength to convince more people.</p><br/><p>To this end, Muse officials allocated a large amount of resources to Ming Yu, letting him choose. These resources included the Muse magazine cover, a global endorsement of a certain line of Rosalind, an invitation to the Otilla high-end show, etc.</p><br/><p>These resources were absolutely perfect for a supermodel ranked 42nd in the world.</p><br/><p>But Shen Xiang felt that these resources couldn’t support the speed of Ming Yu’s progression. In such circumstances, the best plan Shen Xiang thought of was to find Xi Ze. As long as Ming Yu could appear in a Ji and Ya high-end show as the opening or finale model, he was absolutely guaranteed results!</p><br/><p>Shen Xiang found Xi Ze and hoped he could open a back door for Ming Yu. However, Xi Ze silently thought for a while before replying, “February’s high-end show has been set. It is a female high-end show so he can’t appear in it.”</p><br/><p>Shen Xiang was slightly stunned by these words but he also understood that the preparations for the high-end show had already begun. How could Xi Ze waste the efforts of so many staff members just because of his lover by suddenly changing the theme of the high-end show?</p><br/><p>After seeing Shen Xiang’s helpless appearance, the elegant man gently put down his pen and looked at the other person. He asked calmly, “This matter, did you take the initiative to ask or did Zhao Rui come to you?”</p><br/><p>Shen Xiang replied, “I came to ask myself. Zhao Rui, that boy is so irresponsible. Ming Yu is a model under his hand but he isn’t anxious about what follows next. Despite Ming Yu’s rising popularity, he is calmly completely common projects every day, such as taking the cover of Lanka and the Dusha endorsement.”</p><br/><p>Xi Ze’s lips thinned thoughtfully at the words. Then he asked, “What is the relationship between Ming Yu and I?”</p><br/><p>Shen Xiang couldn’t help saying, “Aren’t you a pair?”</p><br/><p>The man nodded and lightly tapped his fingers on the wooden table. “Since I am a pair with him, aren’t you worried about what would happen if he enters the Ji and Ya fashion show? Zhao Rui already knows that Ming Yu can’t be invited to a Ji and Ya fashion show for half a year. But he believes in one thing.”</p><br/><p>Shen Xiang asked without understanding, “What is it?”</p><br/><p>“He believes.” Xi Ze’s eyes flashed as he smiled. “He trusts Ming Yu’s strength.”</p><br/><p>This made Shen Xiang stunned. He hadn’t recovered when Xi Ze saidm “Zhao Rui isn’t good about handling many things. Sometimes you can’t endure it. But he is always very lucky or his intuition is very good. He believes that my lover has great strength and there is a saying that has been true since ancient times—”</p><br/><p>“Real gold isn’t afraid of fire, fragrant wine fears no dark alley.” (TL: Quality goods need no advertising)</p><br/><p>Two days later, the PR director of Huaxia’s top luxury brand Yizhi personally came to <span class=\"skimlinks-unlinked\">Muse.Under</span> the leadership of Linda, the deputy director of Muse’s PR department, he met with Ming Yu, Zhao Rui and Luo Ru, negotiating with these three people. In one afternoon, a contract was signed.</p><br/><p>One day later, in mid-November of 2017, the Yizhi high-end studio published information about the high-end show that would take place in a week and a long list of supermodel invitations.</p><br/>\n</div>"}