{"title": "Chapter 180", "id": 180, "volume": 2, "url": "http://boxnovel.org/rebirth-of-a-supermodel-chapter-180", "volume_title": "Volume 2", "body": "<h1>Chapter 180</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 180</p><hr/><br/><p>Andrew’s live talk show had a low global influence and could only be regarded as a second-tier program in the United States. Maybe it was because his words on this program were so arrogant that many fashion lovers around the world learned of this news.</p><br/><p>To be honest, there were many confident supermodels like Andrew. This was just a declaration and wasn’t a big deal. However, Andrew’s sentence had another meaning. He thought that only he could successfully break through among those who became supermodels in the same period.</p><br/><p>The ones who became supermodels at the same time was Andrew…</p><br/><p>Wasn’t Ming Yu among the four people?</p><br/><p>The news was first widely circulated in western networks and the media.</p><br/><p>【 Andrew is very handsome and has a good figure. He will definitely be the first supermodel to enter the ranking! 】</p><br/><p>【 Haha, how can these small models compare to Andrew? Andrew debuted in the Karma high-end fashion show! 】</p><br/><p>【 Looking at Andrew, he will definitely be able to advance into the top 80 of the supermodel rankings. 】……</p><br/><p>Many Western netizens were supportive of Andrew’s behaviour. In their eyes, Andrew was handsome, had a good pedigree and a high starting point. He was another Xi Ze. If he couldn’t get on the world supermodel rankings then who could?</p><br/><p>That little Huaxia model?</p><br/><p>Don’t think that he could participate in the high-end show of a top luxury brand!</p><br/><p>The Western media blocked their network so the Huaxia fans only knew about Andrew’s arrogant declaration after half a day. Originally, they just wondered why so many Wester media outlets were blackening Ming Xiaoyu. Then they gradually understood.</p><br/><p>【 Ohh, he is blackening my family’s small mushroom with his surname! This type of blackening has long been used in Huaxia for 50 years! Trying to serve up the same product is really fresh. 】</p><br/><p>【 The brainless fans should go take medicine! You must be drunk to think that stepping on someone else’s position is being superior. 】</p><br/><p>【 I went to take a look. Andrew debuted in the Karma show and also endorsed a Karma first-tier brand’s perfume. Can I ask our pitiful ‘Karma’ prince, do you dare to find a job that has nothing to do with Karma? Oh, I am wrong. No one probably wants to invite you, hahaha! 】……</p><br/><p>The fans naturally responded. At the same time, Ming Xiaoyu had just returned to Huaxia and was still jet lagged. Over here, the Muse PR department had already contacted many journalists and started to release a draft.</p><br/><p>[The world supermodel rankings haven’t been announced. Why?] [70 years ago, the January release was delayed. The last time was due to the competition for the 1st position. What is it this time?] [The World Supermodels Organization: This ranking is delayed due to a supermodel’s ranking.] In these reports, the Huaxia media alluded that the delay was because they couldn’t get a unified vote for the ranking of a supermodel. Therefore, the release was delayed. This allusion didn’t make much sense. The World Supermodels Organization had previously given an interview to the media, acknowledged that a ranking issue delayed the list.</p><br/><p>However, the Huaxia media emphasized one point. This list was delayed due to a supermodel’s ranking problem!</p><br/><p>These words caused a big uproar!</p><br/><p>A big wave was caused just because of a supermodel’s ranking problem?</p><br/><p>Which supermodel was this that their ranking would let the hundreds of members of the World Supermodels Organization unable to do anything?</p><br/><p>The last time the list was postponed due to a person’s ranking was 70 years ago. At that time, the top two female supermodels were equal. They walked step by step and their results were very similar. This really caused the World Supermodels Organization to suffer.</p><br/><p>From then on, the World Supermodels Organization had a strict grading standard that was accurate to almost one decimal. After that, there had never been a delay because of a model’s score.</p><br/><p>Was there going to be a big change in the rankings this time?</p><br/><p>When it came to big changes in the list, everyone’s first reaction was too look at the high ranking supermodels. The first one they thought of was Xi Ze. But as soon as they thought this, they all denied the possibility. Xi Ze really showed signs of retreat in this year but the second place Adenes was far below him. There was no comparison.</p><br/><p>The second one who came to mind was Cecilia, the world’s 1st ranked female supermodel.</p><br/><p>Could He Chaoman or Du Ruo surpass Cecilia?</p><br/><p>This definitely caused a big earthquake in the fashion world!</p><br/><p>If the 1st ranked female supermodel changed, wouldn’t the top two positions in the supermodel rankings become occupied by Huaxia people? Huaxia’s position in the fashion industry was already very strong. If this change happened, other countries wouldn’t be able to live!</p><br/><p>The more they thought about this possibility, the more they thought it was the truth!</p><br/><p>Thanks to the Huaxia media controlling public opinion, the ‘Andrew threatens that he is the only one to enter the world supermodel rankings’ and ‘Ming Yu entered Ruth Mary through a back door’ were completely forgotten. These were trivial matters! Let’s take a look at when the world supermodel rankings would be released!</p><br/><p>It was the middle of October and it still wasn’t released. Wasn’t this too unreasonable?</p><br/><p>It wasn’t just the Huaxia fashion lovers who were anxious. Numerous Western netizens flocked to the official website of the World Supermodels Organization and told them to release the leaderboards quickly!</p><br/><p>Among these people, the most excited were Cecilia, He Chaoman and Du Ruo’s fans.</p><br/><p>Now everyone thought that the reason for the list being delayed was probably due to a major change in the female rankings.</p><br/><p>On the other hand, there was also a slight stir among Adenes’ fans. They felt that the possibility was very low but what if Adenes really surpassed Xi Ze?</p><br/><p>He wouldn’t be a chicken but a phoenix!</p><br/><p>Adenes who had been below Xi Ze for five years!</p><br/><p>He was clearly a top supermodel favoured by fans all over the world., But under the oppression of this big demon, there was no room for surpassed Xi Ze. It would be really nice for Adenes to be at the top for once!</p><br/><p>The excited fans caused the official website of the World Supermodels Organization to close for a few minutes. The fans of the top models had a large number that was hard to compare to. But surprisingly, many Ming Xiaoyu fans were present.</p><br/><p>It was only when Ming Xiaoyu fans assembled to do one thing that they discovered this youth actually had so many supporters!</p><br/><p>As early as half a month ago, Ming Xiaoyu’s official Muse website fan number had surpassed Cheng Su and reached 12 million after the surge! It was 9th place among the Muse models!</p><br/><p>What was the saying about good preparation was the key to success? That’s right!</p><br/><p>Once these fans gathered to post messages on the forum of the World Supermodels Organization, everyone was shocked to find that six forces could truly have a sense of existence in the forum and make people pay attention!</p><br/><p>The most weighty ones were naturally Xi Ze’s fans. These fans rarely spoke but once someone dared speak about ‘Xi Ze regressing’ and ‘Xi Ze isn’t a good model’, they would immediately throw a pile of data in their face, telling the person about what their God Xi had achieved in the past year!</p><br/><p>It was followed by Cecilia’s fans. Her fans were fighting with He Chaoman and Du Ruo fans. More than half the fan groups of these female models were male fans.</p><br/><p>Don’t think that male fans were inferior to female fans. Cecilia’s fans were mainly Westerners while He Chaoman and Du Ruo’s fans were from Huaxia, Korea, Japan, etc.</p><br/><p>These were troubled times.</p><br/><p>Under these people were Adenes and Ming Xiaoyu’s fans.</p><br/><p>Before today, nobody would believe that a supermodel who hadn’t yet entered the world supermodel rankings would have fans no less than the fans of the top supermodels in the world.</p><br/><p>Ming Xiaoyu’s fans only insisted on one point: 【 Who said that Andrew will be the only one of the five new supermodels to enter the rankings? Can you repeat that? 】</p><br/><p>The Muse PR department really used the world supermodel rankings to divert the attention of the media, so that the Western media’s blackening of Ming Yu didn’t work. This method was very good and had an effect. Right now, no one in the Western media was paying attention to Andrew’s words.</p><br/><p>However, this didn’t mean that the blackening of Ming Yu didn’t happen!</p><br/><p>Ming Xiaoyu’s fans were really angry!</p><br/><p>Their family’s mushroom entered a high-end show through the back door?</p><br/><p>Their family’s mushroom couldn’t enter the rankings after becoming a supermodel?</p><br/><p>Who the hell are you? Are you the emperor? What are you talking about?</p><br/><p>【 I don’t know about the back door professional whose only jobs are related to Karma, but I will be shocked if he can definitely enter the rankings. I have a bag of dog food. If Andrew Wallen can enter the world supermodel rankings then I will eat this dog food! 】</p><br/><p>【 I believe that Ming Xiaoyu can enter the world supermodel rankings! 】</p><br/><p>【 I also believe that Mushroom can certainly enter it! He has used his strength to prove himself and his performance is no worse than many people on the rankings. He has accumulated strength for so long, he must be able to soar and get a very good position! 】</p><br/><p>Originally, Ming Xiaoyu’s fans were too strong and the fans of Western models couldn’t compare with them. But once a fan said ‘his performance is no worse than many people on the rankings’ and ‘soar and get a very good position!’, the Western fans finally got something to grab onto.</p><br/><p>【 Hahaha, who is better than many people? Do Huaxia people have a misunderstanding about the meaning of ‘many’? 】</p><br/><p>【 There was a Huaxia fan who said that my face is very big. I just went to check. I think it is your face that is very big! I will swear right here! If Ming Yu can enter the rankings, I will parade to the White House’s door! If Ming Yu soars, I will go to the White House and shout ‘the president is shit!’ 100 times. 】</p><br/><p>【 Village bumpkins truly aren’t aware of the sky and mountains! Is the world supermodel rankings so easy to climb up on? Soaring? Wanting to exceed many people? Ming Yu’s strength is good but can he surpass other excellent supermodels? I can guarantee that even if Ming Yu is on the list, he can only get in the 90s! 】……</p><br/><p>Ming Xiaoyu’s fan didn’t think her words would cause such a big response.</p><br/><p>The Western fans had no way to refute the other things so they could only grab onto her words. They kept laughing at the daydreams of Ming Xiaoyu’s fans.</p><br/><p>The fan cried out anxiously: 【 I’m sorry. I just wanted to say that Mushroom is very strong. I didn’t expect such a result. I will call the World Supermodels Organization and ask them to delete my post. I really didn’t know. I am sorry to everyone. I harmed you and caused you to be scolded. Ming Xiaoyu was also defamed. 】</p><br/><p>Originally, Ming Xiaoyu’s fans were pained by this. But once they saw this sister’s penitent appearance, they weren’t convinced.</p><br/><p>【 Why do you think that Mushroom won’t exceed many models on the list? 】</p><br/><p>【 As long as Ming Xiaoyu reaches the top 80, I will hold a lucky draw with two lipsticks as the prize! If he is in the top 70, I will send four. The top 60 I will send 8! And so on! If Mushroom enters the top 50, I will send lipstick and a makeup set! 】</p><br/><p>【 Okay! You can laugh about how Mushroom won’t be on the list. We believe in Mushroom’s strength! We have witnessed Mushroom’s results during this time! As long as Mushroom is on the list, I will send the latest Dusha mushroom crystal necklace! I will send one for 100th place, two for 99th, three for 98th place! And so on! 】</p><br/><p>【 Previously, we held the biggest lucky draw in Huaxia for Mushroom. Now I would like to make the world’s largest lucky draw for Mushroom! As long as you support ‘Ming Yu on the world supermodel rankings’ and he enters the rankings, I will send 10 people a set of the Nidelan Smoke fragrances. For Mushroom! 】……</p><br/><p>The fans with deep pockets suddenly blindsided the Western fans.</p><br/><p>They couldn’t understand how this small model could make such a big noise. This was the Nidelan Smoke fragrance and a complete set! They were going to give it away for free? This was too exaggerated!</p><br/><p>In fact, many people secretly thought in their hearts, ‘Huaxia people are rich…’</p><br/><p>The storm caused by Ming Xiaoyu’s fans overwhelmed even the war between Cecilia, Du Ruo and He Chaoman. It was impossible to compare to the global lucky draw.</p><br/><p>Right now!</p><br/><p>The World Supermodels Organization finally moved on the official website that had been frozen five times.</p><br/><p>【 Announcement: The rankings will be announced in one day! 】</p><br/>\n</div>"}