{"title": "Chapter 194", "id": 194, "volume": 2, "url": "http://boxnovel.org/rebirth-of-a-supermodel-chapter-194", "volume_title": "Volume 2", "body": "<h1>Chapter 194</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 194</p><hr/><br/><p>Three days after the official release of the world supermodel rankings in December, the top magazine Edith was released globally.</p><br/><p>In the streets and lanes of Huaxia, Edith’s promotional photos could be seen everywhere. Some of the more intelligence bookstore owners and newsstand bosses put this edition of Edith in the most eye-catching position, letting the people passing by see it.</p><br/><p>Edith was one of the top five fashion magazines in the world. Although its influence in Huaxia wasn’t as good as the local magazines Muse and Suyi, it always had good sales. And these bosses had long discovered that the cover of this issue of Edith was Ming Yu, who had recently been on fire!</p><br/><p>As long as there was a magazine of Ming Yu, sales would shoot up! Shouldn’t it quickly sell out?</p><br/><p>The bosses weren’t disappointed this time. At noon, this issue of Edit was sold out, making the savvy bosses hate themselves. Edith was an American magazine and the sales in Huaxia weren’t that great, making them order fewer copies.</p><br/><p>The Ming Xiaoyu fans who had been looking forward to this month’s Edith found a cold and indifferent youth on the cover. This was a style that Ming Yu rarely tried. He was very elegant in a gentleman’s tuxedo as he half leaned against the wall, looking at the world outside the photo.</p><br/><p>Perhaps because Edith was a Western magazine, this time Ming Yu’s outfit was a full European style.</p><br/><p>His soft hair was dyed a brilliant golden yellow. It wasn’t the vulgar gold of the country but was the same as the Western blonds, a soft and delicate platinum gold. The hair was deliberately cut short. Many long-haired Ming Yu fans thought it was a pity but this short and capable hair made the youth look more mature and restrained.</p><br/><p>The platinum gold hair was styled back, leaving only a few strands of hair over the forehead, making the smooth forehead look fuller.</p><br/><p>It might be a tuxedo but it wasn’t as strict as the traditional ones. The youth was leaning against the wall with one foot. The outfit was casually open and the shirt had a few buttons loosened, revealing the bulge of the collarbone.</p><br/><p>Bright light hit his right side from the left side of the photo, making the shadow of the young man stretch out on the ground.</p><br/><p>This scene was too fresh and beautiful. Such a youth was too gentle and elegant, capturing the group of excited mushroom fans. It also made many passersby fans feel “What type of style can Ming Yu not control?”</p><br/><p>In the afternoon, there were no big changes. Three bookstores and a newspaper stand in the capital sold thousands of copies of Edith to a regular person. This little assistant was very diligent. After gathering all the magazines, he contacted a truck that specifically transported the 10,000 magazines to a high-end villa area.</p><br/><p>The assistant didn’t notice that after they left the bookstore/newsstand, a few detective-like people walked out and started to call someone.</p><br/><p>After receiving these calls, Luo Ru immediately left Ming Yu’s lounge and headed downstairs to Muse’s actor training department. She found Ming Xiaoyu discussing a few things with Brother Yuan.</p><br/><p>At this moment, the truth was completely revealed.</p><br/><p>The afternoon of the same day, just one hour after the previous event occurred, the well-recognized gold medal agent Ding Bo rushed with fright into the Ji and Ya studio. He scurried to the private studio at the top and cried out, “I was wrong! It is a fake identity! I found out!”</p><br/><p>The moment Ding Bo opened the door, Xi Ze was pouring wine. As a designer, Xi Ze would often borrow the power of alcohol if he couldn’t find inspiration. It could be red wine, champagne or even white wine and yellow rice wine.</p><br/><p>When he heard Ding Bo’s voice, Xi Ze was very calm. He didn’t even raise his eyes as he stated, “You just slammed open my door and hit it against the plant next to it. With your dirty shoes, you stepped on my rug.”</p><br/><p>The urgent Ding Bo, “…?”</p><br/><p>After a moment, Ding Bo cried out angrily, “My god! You only think about your door, your plant, your rug! Anyway, it is your business and has nothing to do with me. If you don’t want to know then forget it!”</p><br/><p>Xi Ze’s heart tightened at the words and he asked, “What matter is related to me?”</p><br/><p>Xi Ze subconsciously thought about the true identity of I want to break my wife’s leg that Ding Bo had checked a few days ago. But this matter was already determined. Ding Bo found the membership registration information on Muse’s official website and the user was just an ordinary person in the capital. His life was quite innocent and there wasn’t anything important.</p><br/><p>But once he saw Ding Bo’s ‘You hurt me, I won’t tell you’ expression, Xi Ze’s eyelids once again twitched as a familiar, ominous feeling rushed into his heart.</p><br/><p>His grip on the glass tightened as Xi Ze asked calmly, “Is it related to that netizen?”</p><br/><p>Ding Bo sneered and didn’t answer.</p><br/><p>Xi Ze’s eyes narrowed. “This door was airlifted from France and the value is 200,000…”</p><br/><p>“He is Ming Yu!”</p><br/><p><i>Bang</i>—</p><br/><p>To Ding Bo’s fright, he saw Xi Ze’s eyes widen and the glass in his hand unexpectedly crashed to the ground! For this type of thing to happen to Xi Ze, it was a real eye-opener for Ding Bo. After three minutes of feeling stunned, he laughed and laughed.</p><br/><p>The light-coloured champagne instantly soaked the white wool rug. The expensive wool rug that was flown from Italy became dyed by the champagne, causing Ding Bo to laugh.</p><br/><p>But the laughing Ding Bo couldn’t laugh anymore.</p><br/><p>He saw Xi Ze narrow his eyes while placing the bottle in his other hand onto the table. Then he asked in a dignified tone, “Why is it Ming Yu? Didn’t you already investigate the identity of the other person?”</p><br/><p>At this reminder, Ding Bo realized that he had made a mistake in his work!</p><br/><p>Sweat suddenly flowed down and Ding Bo gulped before explaining, “When I checked that small netizen, I felt a bit strange. That person is more than 30 years old this year and is relatively simple. He doesn’t seem like a fashion lover. After this thing passed, I still felt that something was wrong. I used a few means to check the identity of the person and discovered… He is the grandson of Zhao Rui’s second eldest aunt’s cousin.”</p><br/><p>Xi Ze, “……（/=＿=）/～┴┴!!!”</p><br/><p>Ding Bo swallowed the saliva in his mouth again and carefully asked, “That… Xi Ze, can I leave first? I have something to do in Muse and you need to do work for Ji and Ya. I’ll go first…go…QAQ!!!”</p><br/><p>The man’s ruthless eyes stared at Ding Bo. Ding Bo didn’t doubt that if eyes could kill, Ding Bo would be dead countless times.</p><br/><p>Under such a powerful and terrible sight, Ding Bo found that his legs were really weak and he could only listen as Xi Ze asked, “Today is when Edith is released You…” Xi Ze paused and gritted his teeth. “Did you buy the magazines?”</p><br/><p>His tone seemed calm but Ding Bo had known him for many years. He was keenly away that there was a slight tremor in Xi Ze’s voice, as if he was suppressing something.</p><br/><p>Ding Bo was a bit timid. He might not understand why it mattered if ‘I want to break my wife’s leg’ was Ming Yu. What did this have to do with Xi Ze? At most, Ming Yu learnt about Xiao Biqing and opened a side account to enter his own fan circle…</p><br/><p>Eh?</p><br/><p>I want to break my wife’s leg?!!!</p><br/><p>Who was Ming Yu’s wife?!</p><br/><p>This question would cost him his life.</p><br/><p>But Ding Bo knew! Xi Ze’s wife was Ming Yu!</p><br/><p>Then if Ming Yu wanted to break his wife’s legs…</p><br/><p>He thought of the other words from this ‘break the legs’ comrade: I have a wife who is a wasteful spend… oh my god! This was self-evident!</p><br/><p>Ding Bo trembled as he quietly whispered, “…This morning, Xiao Zhang was very responsible. He bought 10,000 magazines and took it to the original place… the villa.”</p><br/><p><i>Boom!</i></p><br/><p>Mr. Xi’s entire face was dark.</p><br/><p>That evening, Mr. Xi who had always been committed to ‘going home early and holding his wife to sleep’ spent a long time in the Ji and Ya studio. Eventually, he received a text message from his mushroom asking why he wasn’t home and he very reluctantly drove home.</p><br/><p>The always clogged traffic in the capital, why wasn’t it clogged today for Mr. Xi? Unexpectedly, he arrived home in 20 minutes and stood at the doorstep, not daring to knock on the door.</p><br/><p>For 10 minutes, there was a battle in his heart between heaven and man!</p><br/><p>Mr. Xi gritted his teeth, his face calm as he entered the password lock and opened the door.</p><br/><p>Pushing open the door—Eh? The lights weren’t turned on?</p><br/><p>Go forward—</p><br/><p><i>Flip. </i>The entire living room lit up instantly!</p><br/><p>A handsome young man calmly sat on the soft lambskin sofa and looked up at the man standing at the entrance. As soon as he looked up, he said with a smile, “Mr. Zyu, do you like perfume or do you like watches? Or do you like 10,000 magazines?”</p><br/><p>Placed in front of the youth were:</p><ol><li>Nidelan’s Smoke fragrance.</li><li>Feilu’s Rongyao series of watches.</li><li>The new issue of Edith!</li></ol><br/>\n</div>"}