{"title": "Chapter 201", "id": 201, "volume": 3, "url": "http://boxnovel.org/rebirth-of-a-supermodel-chapter-201", "volume_title": "Volume 3", "body": "<h1>Chapter 201</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 201</p><hr/><br/><p>There was no need to explain how Xiaoyu’s fans reacted. Xi Ze’s fans who had been silent for a few hours weren’t happy!</p><br/><p>【 What does this mean? Are you saying that my god opened the back door and accepted the unspoken rules, encouraging a bad atmosphere in the industry? 】</p><br/><p>【 I am laughing. My god isn’t a person to help newcomers behind the scenes! Do you know the world’s second ranked female supermodel. He Chaoman? God Xi held her up! Do you know the world’s fourth ranked male supermodel, Luo Cheng? God Xi held him up! If God Xi really accepted the unspoken rules, why didn’t he directly make Ming Yu popular instead of quietly going through the back door? 】</p><br/><p>【 That’s right! Ming Yu took so long to reach the 16th rank. The speed of his progress after becoming a supermodel is much faster than Luo Cheng. However, Luo Cheng appeared on the world supermodels list four months after debuting! 】</p><br/><p>【 You want to pour dirty water at this level? If Xi Ze is accepting the unspoken rules with Ming Yu, why isn’t there a relationship between Ming Yu and Ji and Ya? This IQ is really low. 】……</p><br/><p>How angry were they?</p><br/><p>Their God Xi/ Small Mushroom stopped being single today, they lost love twice! Yet this person said that it wasn’t true love between Mushroom and God Xi, it was the unspoken rules?</p><br/><p>Damn, slam this person!</p><br/><p>This was really ‘opening the mouth to speak empty words’! This evidence could only deceive outsiders and passersby who didn’t know the truth. If Xi Ze really wanted to open the back door for Ming Yu, the first thing was to arrange for Ming Yu to walk in a Ji and Ya high-end fashion show?</p><br/><p>Cough, Ji and Ya hasn’t had a men’s fashion show for a long time?</p><br/><p>That wasn’t a problem!</p><br/><p>Didn’t He Chaoman walk in a Ji and Ya high-end men’s clothing fashion show once? What was wrong with letting Ming Xiaoyu wear female clothing?</p><br/><p>A few days ago, the world’s second ranked male… well, he wasn’t a male supermodel anymore. The top male supermodel Adenes underwent a sex-change surgery and officially became a female supermodel.</p><br/><p>Who said that men can’t walk in women’s high-end fashion shows?</p><br/><p>As long as Xi Ze was willing! No one would dare to stop Ming Yu from walking in a women’s high-end fashion show!</p><br/><p>But this incident was strange. Apart from Ming Yu and Xi Ze’s original sunspots who helped out the po master called ‘Rising Supermodel is Gay’, unexpectedly, no other passersby helped him out.</p><br/><p>Xi Ze and Ming Yu’s fans were already battle-hardened. This po master should be an authentic sunspot. After releasing the so-called black materials, he should immediately contact a major marketing company to buy a water army. He stirred up such muddy water, how could no one help him?</p><br/><p>Was this guy really not a sunspot?</p><br/><p>The fans were a bit confused. This guy didn’t have a water army. Therefore, once Ming Xiaoyu and Xi Ze’s fans poured out their scolding words, the field was instantly controlled!</p><br/><p>A person with black materials was actually controlled by fans?</p><br/><p>It seemed a bit strange…</p><br/><p>The fans naturally didn’t know that the po master had found a familiar marketing number in order to buy a water army. However, most of the marketing numbers became listless the moment they heard ‘Xi Ze’s unspoken rules with Ming Yu’. The head of the water armies also said they wouldn’t accept this job.</p><br/><p>However, there must be a brave money under all this money. One or two marketing numbers and water armies would be willing to do this. The po master was full of confidence as he released the black materials and waited a few hours. However, these marketing companies actually refused to move. They even refused to respond to his phone call.</p><br/><p>In a dimly lit apartment in the capital, Cheng Su and assistant Xiao An were sweating. They were flustered and didn’t know how to proceed next.</p><br/><p>They naturally didn’t know that at this moment, most of the lights in the Muse PR department was on despite it being night. All the personnel were on the job, madly calling and contacting various networks.</p><br/><p>In Cheng Su’s heart, he really didn’t believe that Xi Ze and Ming Yu were in a relationship.</p><br/><p>Cheng Su previously inadvertently heard from Zeng Shu and discovered that Xi Ze’s family had a high background. Once he learned about it, he really became shocked and understood why no one in the industry dared provoke Xi Ze. Even if it was an unintended provocation, there would be no good end for that person.</p><br/><p>Cheng Su became calmer after finishing out Xi Ze’s background.</p><br/><p>How could Xi Ze’s family allow him to be a homosexual? This definitely wasn’t possible! Homosexuality was disgusting and was completely contrary to Xi Ze’s family’s appearance. It was psychologically distorted and sick!</p><br/><p>Ming Yu must’ve secretly seduced Xi Ze and Xi Ze was bored enough to play with this small model.</p><br/><p>It was clear that Xi Ze didn’t care much for Ming Yu. Otherwise, as the fans said, Xi Ze could quickly raise Ming Yu instead of him taking one and a half years to reach the 16th rank.</p><br/><p>As long as he exposed this matter, Xi Ze would abandon the small model as soon as his image became damaged.</p><br/><p>Cheng Su’s only regret was that he only had these photos as evidence. He used to hire a private investigator to follow Ming Yu but the other person always gave him photos that were useless.</p><br/><p>Previous,y Cheng Su thought that Ming Yu was well guarded and no mistakes could be caught. But one time, his assistant Xiao An was walking down the street and unexpectedly saw Ming Yu and Xi Ze kissing in the car!</p><br/><p>What Cheng Su said was half true and half false.</p><br/><p>Assistant Xiao An’s eyesight was very good and he could see the two people in the car despite the dark lighting. At that time, Ming Yu was moved by some of Xi Ze’s past experiences and was kissing Xi Ze passionately in the car.</p><br/><p>Xiao An was smart and took some photos. Cheng Su also discovered that the private detective wasn’t doing any work at all! Therefore, he had his assistant pay attention to Ming Yu and Xi Ze’s movements. Sure enough! Xiao An caught the scene of the two men walking in the park.</p><br/><p>In the past, Cheng Su endured it and continued to find evidence of Ming Yu’s ‘unspoken rules’.</p><br/><p>But now he was forced to have no jobs for two consecutive months. Cheng Su knew that if this continued, his fame would get worse and he would be directly forgotten by fans!</p><br/><p>This was his last stand, a desperate bet!</p><br/><p>It obviously had a good beginning but the next development wasn’t under Cheng Su’s control.</p><br/><p>Muse’s PR department.</p><br/><p>Shen Xiang frowned as he looked down at the information downloaded from the Internet. He asked, “Linda, how is your side? Have you asked about the other person’s identity from the marketing companies?”</p><br/><p>Linda’s face was gloomy as she quickly replied. “Not yet. Some rules still need to be abided by. My men will take a bit longer to get the person’s information. But many of these things are only known inside Muse. There is a 80% possibility that the person who broke the news is from inside the company.”</p><br/><p>The beautiful deputy director sneered as she thought this. “In that long Weibo post, there are one or two things that only our PR department would know. It is highly likely that there is a mole in our department.”</p><br/><p>Shen Xiang thought for a moment before finally saying, “Suppress this first before we catch the mole.”</p><br/><p>……</p><br/><p>After such a thing happened, Ming Yu didn’t leave the company that day and was stuck with Zhao Rui.</p><br/><p>The unspoken rules part hadn’t been proven but this photos showed that Ming Yu and Xi Ze really had a relationship. Now a group of reporters were blocking the downstairs area of the company, waiting to be the first to get an interview.</p><br/><p>As a result, they were divided in two areas. Xi Ze was now trapped in the Ji and Ya building while Ming Yu was trapped in the Muse building.</p><br/><p>In this case, the two parties involved didn’t speak first. They waited to see the reaction of the fans before doing anything. There were a set of options assuming that the fans were supportive and other options assuming that the fans left in large quantities. Otherwise, one wrong step might lead to irreversible consequences and a terrible loss.</p><br/><p>At this time, Ming Xiaoyu was still silent but someone helped him speak.</p><br/><p>【 Xiao Biqing: In any case, I like @Ming Yu, I believe in @Ming Yu, I support @Ming Yu! 】</p><br/><p>Xiao Biqing was a deadly loyal Ming Yu fan. It was very normal for her to say such things. There were also many fans behind the movie queen. Therefore, many Xiao Biqing fans supported their goddess in supporting Ming Yu!</p><br/><p>Soon after Xiao Biqing, other people started to speak.</p><br/><p>【 Fang Liangxiu: @Xi Ze and @Ming Yu are my friends, they are very trustworthy people. I didn’t know anything before today but I believe that @Ming Yu isn’t a villain who would walk through the back door. 】</p><br/><p>【 Fei Sixin: Who is @Ming Yu? Wouldn’t I know? If he was willing to accept the unspoken rules, I would be the first to sign up! Cough, I’m just joking. My Ming Xiaoyu isn’t that type of person. Don’t push the dirty things about the industry onto my Ming Xiaoyu! 】</p><br/><p>【 Xu Yizong: You are actually a pair… I bless both of you @Ming Yu @Xi Ze. 】</p><br/><p>【 Alice of Ji and Ya: How can someone be so malicious to speculate about others? The relationship between Mr. Xi and Ming Yu is really good. I know that I should speak here but I won’t allow you to slander Mr. Xi and Ming Yu! 】</p><br/>\n</div>"}