{"title": "Chapter 202", "id": 202, "volume": 3, "url": "http://boxnovel.org/rebirth-of-a-supermodel-chapter-202", "volume_title": "Volume 3", "body": "<h1>Chapter 202</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 202</p><hr/><br/><p>After Xiao Biqing’s first statement, more and more people started to write comments on their public accounts. Kruka, the assistant designer of Garcia, posted on his Twitter: 【 I can’t believe there are people who would reverse black and white. Support @Xi Ze, support @Ming Yu! 】</p><br/><p>Wu Yuzhen, Liu Qian, Fei Sixin, Zhu Kejia, Li Desheng, Cheng Rongchen… Luo Cheng, Song Chuci and at the end, even the stay at home He Chaoman, who was too lazy to take care of others, appeared on her social media account and wrote:</p><br/><p>【 He Chaoman: @Ming Yu @Xi Ze are a very loving pair. 】 These words caused a big wave.</p><br/><p>He Chaoman’s identity was different from other people. She was a person linked with Xi Ze for many years. Now even He Chaoman was talking. It was like a rival talking to her enemy. The credibility was even greater!</p><br/><p>At this time, the attitude of the fans was almost the same. Apart from a few passersby and the fans who turned black because they couldn’t accept the relationship between Xi Ze and Ming Yu, there were more passersby who turned into fans and happily plunged into this big circle.</p><br/><p>Since there was no marketing, water army or media to support the unspoken rules point of view from ‘Rising Supermodel is Gay’, this wasn’t recognized by others.</p><br/><p>However, the official media started posting about this sudden public outing on their official website and Weibos.</p><br/><p>This was followed by many angry gay people wanting to find out who was the po who discriminated against homosexuality! This type of discriminatory behaviour angered them and they couldn’t let go of this straight male cancer!</p><br/><p>Yes, it wasn’t as straightforward as being a straight man. When the netizens scolded him, the Rising Star is Gay actually replied to one comment with: 【 A man is supposed to be with a woman. A husband and wife is part of nature. If there is no woman, who will give birth to children? Two men together is a violation of the rules of women. Do you expect another man to have children, wash clothes and cook? 】</p><br/><p>Marrying a person was just so that could give birth to a child, wash clothes and cook?</p><br/><p>Was a wife only for this purpose?</p><br/><p>This was simply a disgusting and arrogant straight male cancer!!</p><br/><p>The pro-gay crowd and feminists started an uprising, demanding to bring down the severe straight male cancer! At the same time, more and more fans joined the army blessing Ming Yu and Xi Ze.</p><br/><p>In Ming Yu’s original Muse fan forum, the screen was already filled with “If you are good, we are good.” Once these events happened, Xi Ze’s fans accepted it and mourned their love. Then they started to fill the screen of Xi Ze’s Muse fan forum.</p><br/><p>Of the more than 40 million fans, at least one million fans paid attention to this matter.</p><br/><p>In the past, Ming Xiaoyu’s Muse fans increased enough for many models to feel envy. Even Luo Cheng was very jealous when he was overtaken. Now a large number of Xi Ze fans were paying attention to him, raising his number of fans by more than five million in one night.</p><br/><p>The evening of the next day, Ming Yu had more than 29 million fans. He was less than one million away from He Chaoman, who was second in the Muse fan rankings.</p><br/><p>Many newspapers had ‘Xi Ze, Ming Yu, coming out’ on the front page headlines.</p><br/><p>This news was spread through the Internet media yesterday and was known to most informants. Now that there was a round of traditional media bombing today, many white-collar workers who didn’t access the Internet yesterday finally found out. In the world’s major office buildings, you could hear such whispers:</p><br/><p>“My mushroom, I raised him for more than a year, only for him to be taken away…”</p><br/><p>“God Xi QAQ, my god, I liked you for eight years…”</p><br/><p>“Wow wow!! So sad! My two male gods are actually together? I’ve lost love twice but I actually feel so happy. What is this? T^T!!!”</p><br/><p>……</p><br/><p>How could it be denied? The 10 photos were quite clear. There was even Alice who said on the Internet that the relationship between Xi Ze and Ming Yu was very good. There was no way for people to deny the relationship.</p><br/><p>Of course, there was the kiss… well, if they might’ve lost a truth or dare game and had to kiss ORZ. In any case, countless people paid attention to this matter over the two days. There were many sunspots who asserted the ‘unspoken rules’ matter, taunting Ming Yu about looking so clean on the surface only for his bones to be dirty.</p><br/><p>Xi Ze had numerous fans but there would naturally be sunspots in the places where there were fans. Many sunspots slandered him, saying that he seemed to have a good style for many years only for this to be revealed. Who knew how many people he accepted the unspoken rules from over the years?</p><br/><p>Once the fans saw these words, they naturally rolled up their sleeves and got to work.</p><br/><p>But even if the fans trusted their male gods, Ming Yu and Xi Ze must speak up in order for things to end. They must acknowledge the relationship and state that unspoken rules absolutely weren’t involved.</p><br/><p>As the fans felt eager anticipation, at 8 o’clock the night after the incident was revealed, a photo was posted on Xi Ze and Ming Yu’s social media accounts, their Muse fan forums, the fan support accounts, etc. The fans received the message first.</p><br/><p>This photo was taken at sunset.</p><br/><p>The brilliant warm light shone from the two people’s side, causing a golden layer to cover them. The sun was like a dancing spirit, wandering between the two people’s hairs, their facial features and the narrow eyebrows. Once these people were caught in an intimate kiss, everything became speechless.</p><br/><p>This was a light kiss. The handsome man was slightly bent over, his thin lips curved upwards. The youth was slightly looking up, his beautiful eyes in a crescent shape as his lips neared the man.</p><br/><p>This photo was so beautiful that many people were stunned as they looked at it.</p><br/><p>They were afraid that in this world, they could no longer find a presence that was comparable to the two people in the photo.</p><br/><p>Their temperament was elegant and their aura was strong. When the two of them fought against each other, it unexpectedly turned into a harmonious moment. A faint touch of love flowed through the air, causing it to be seen intuitively!</p><br/><p>The picture was released with only one sentence.</p><br/><p>『 In my life, it is good that I have you. 』</p><br/><p>This short phrase was the promise of a lifetime.</p><br/><p>These two people still had a very long life left and an unlimited time to enjoy the next half of their lives. At this moment, they promised the other person a deep affection and friendship in front of the concerns of people around the world. Such feelings moved everyone!</p><br/><p>【 Really good, really good looking QAQ. When I see this photo, I want to cry again. My mushroom… 】</p><br/><p>【 Ming Xiaoyu, Ming Xiaoyu, Ming Xiaoyu, I love you!! 】 【 Even if you are taken away by God Xi, we will always support you!! 】……</p><br/><p>When Xi Ze’s fans saw these photos, their feelings were even more profound.</p><br/><p>【 I have never seen someone standing by God Xi’s side who is such a perfect match In the past, He Chaoman was able to compete with God Xi’s aura a little bit but it wasn’t so harmonious. Is Ming Yu the only one who can stand with him? That’s great. Your path isn’t so lonely, my favourite person. 】</p><br/><p>【 As long as you are good, we are good. These are the words of Ming Yu’s fans but I want to say it now. God Xi, as long as you are good, we are good. 】</p><br/><p>【 After seeing that God Xi has his own lover, I am a bit sad but also very happy. In the past, I was worried. God Xi’s eyes are so high, who can he see in the future? Unexpectedly, he found his lover so soon. It is very good! Bless you! 】……</p><br/><p>The attitude of the pure fans were relatively calm, while the CP fans were simply crazy!</p><br/><p>【 233333 No regrets in this life! 】</p><br/><p>【 Silently pulling out luxury dog food from my pocket… 】</p><br/><p>【 Come on! Bring my the golden dog food!!! 】</p><br/><p>【 This is killing a person, killing a person! No, I have to grow crops! You are kissing, how can tehre not be a little bit of drama? Let me go see it! 24 o’clock tonight! We will see it!! 】……</p><br/><p>This was a beautiful scene filled with the promise of a lifetime of love. Forget the fans, many passersby said they supported these two people together. The two people were so wonderful together that it wasn’t wasting natural resources!</p><br/><p>There might be some sunspots and anti-gay people still mixed in the chaos, but they were scolded by other people and couldn’t get a foothold.</p><br/><p>Countless fans liked to open their mouths or work using the pen, making everything cheerful. The #Xi Ze Ming Yu# topic lingered at first in the hot searches for a full two days and was thousands ahead of the second place topic.</p><br/><p>Some people were very curious about the straight male cancer. However, it was a new account and there was nowhere to search for his identity.</p><br/><p>Just as everyone was keenly paying attention to see if there was any more dog food, an entertainment marketing account suddenly posted a message.</p><br/><p>【 Entertainment Industry Gossip Squad: In tomorrow’s headlines, a well-known fresh new model robbed the younger generation of their resources, suppressing the younger generation. In addition, abandoning their own agent. Do you know who it is? 】</p><br/><p>TL: Dog Food: used to refer to the self-pity of single people triggered by public displays of affection by couples online or offline.</p><br/>\n</div>"}