{"title": "Chapter 218", "id": 218, "volume": 3, "url": "http://boxnovel.org/rebirth-of-a-supermodel-chapter-218", "volume_title": "Volume 3", "body": "<h1>Chapter 218</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 218</p><hr/><br/><p>The next day, all the major media reported on this grand and brilliant Ji and Ya show!</p><br/><p>Even Huaxia Daily, which had always been orthodox and serious, wrote an introduction on its front page. It stated how Ji and Ya was a top luxury brand in Huaxia and held its first high-end menswear show in two years, as well as introducing the impact of this fashion show on the industry.</p><br/><p>It wasn’t enough to have a 100 word introduction on the first page. After that, Huaxia Daily used almost a whole page in its fashion entertainment section to introduce the relevant information in great detail.</p><br/><p>It was already very scary that a high-end show could rise to this level.</p><br/><p>In addition to Huaxia, countless top newspapers and magazines of foreign countries published articles on this matter. There were all types of praise from the British ‘Times’, the U.S. ‘Washington Post’, the French ‘Le Figaro’, the German ‘Bild’…</p><br/><p>These globally representative magazines wrote a rich introduction to Ji and Ya’s high-end show, let alone media magazines such as Time Entertainment Daily and Fashion Weekly.</p><br/><p>This high-end show was no longer just a matter of Ji and Ya. This fashion show contained some of the world’s top supermodels! Apart from Luo Cheng, 19 of the world’s top 20 were present! The lowest ranked male model was ranked at 48.</p><br/><p>Such a group of outstanding people combined with the fashion brand meant it was difficult for this fashion show to not attract attention.</p><br/><p>Among the praises of the media, many people praised the accumulation of Ji and Ya’s two years. This time great progress had been made in menswear. Other people praised Xi Ze, Ming Yu, Kelson, Harriman and other people’s excellent performance. In particular, they were amazed by Xi Ze and Ming Yu’s last ‘collar clip exchange.’</p><br/><p>The Time: Two outfits of very different styles, they seem to have a magical unity after exchanging the collar clip. The blue jewel clip fits the black orthodox British suit of Ming YU as well as the casual and unconstrained outfit of Xi Ze.</p><br/><p>The Washington Post: This time, Ji and Ya has taken the lead in fashion.</p><br/><p>Le Figaro: Yesterday, Mr. Rayleigh Roman, the chief designer of the famous French luxury brand Otilla, vigorously praised the Ji and Ya high-end menswear show. According to Master Roman’s words, this fashion show inherits the elegance and nobleness of Ji and Ya but also contains a unique gentleness. No matter the details in each outfit or the creative inspiration, it is enough to make it this year’s top menswear show.</p><br/><p>……</p><br/><p>Endless praise spread over the world like snowflakes. Westerners might not understand Huaxia’s latest movie or the hottest games, but Ji and Ya was deeply imprinted in their hearts as the top luxury brand in Huaxia and the world.</p><br/><p>The world’s top luxury brand was called Ji and Ya and it was from the east.</p><br/><p>Sometimes, people whose strength wasn’t enough would be jealous. When Ji and Ya was first established, it provoked several sunspots. People laughed at Mrs. Ji Heya for being from a small family. Sooner or later, the brand would be damaged.</p><br/><p>But decades later, Ji and Ya hadn’t faded and actually became more prosperous. Once Xi Ze became Ji and Ya’s chief designer, no one dared say that Ji and Ya was a brand without a rating.</p><br/><p>The charm of this brand was deeply rooted in people’s hearts, making it acknowledged.</p><br/><p>Today, Ji and Ya attracted the attention of countless Westerners. They knew that Xi Ze taking the stage again after two years was a very important event!</p><br/><p>The fashion lovers all over the world were looking forward to the video release announcement for this high-end show. For many domestic fans, they didn’t need to see photos or watch videos at all. Just the legendary ‘collar clip exchange’ was enough to make them burst.</p><br/><p>【 Ahhhhh!!! Exchange collar clips! Exchange collar clips! I knew that God Xi and Mushroom would be embarrassing! 】</p><br/><p>【 23333333 This was God Xi’s plan for a long time. He actually let Ming Yu go second last while he is last. I said from the beginning that God Xi’s arrangement is definitely purposeful. I am the prophecy king ～～～ 】</p><br/><p>【 I don’t have any photos or videos but I can already write 20Ws while having a nosebleed… 】</p><br/><p>【 LS You aren’t alone! This should be included! T-play or something… hey, my nose is a bit wet. Ah…red… ＿（：з」∠）＿ 】…</p><br/><p>The photos of the high-end show were generally kept secret unless they were officially announced. The fans were starving while waiting for the official release and ji and Ya officials weren’t as unreliable as the World Supermodels Organization. The third day after the high-end show, they released a series of photos.</p><br/><p>They were just photos, not the runway show.</p><br/><p>Before or after the high-end show, the various studios would have the models wear the outfits and take some hard photos of the makeup. These photos were hot by the world’s top photographers and the makeup designed by the world’s top makeup artists. In many cases, the brands would reveal the position of the high-end show through the background arrangement of these makeup photos.</p><br/><p>In the Ji and Ya photos, the most obvious element was the fresh and delicate rose petals.</p><br/><p>In the empty white background, rose petals gently landed on the ground or were sometimes scattered in the air. This harsh red and white contrast produced an illusion for anyone who saw this photos. It was like a drop of blood had branded the photo that couldn’t be washed away.</p><br/><p>『 The gentleness of elegance 』。</p><br/><p>This gentleness was present in the entire fashion show that had an elegant and soft style, but was it really gentle elegance?</p><br/><p>Water could wash away everything but it could also be contaminated.</p><br/><p>Just like the last collar clip exchange interpretation for the last two outfits, their gentleness was like a rose with thorns. The thorns would still sting them, no matter how elegant. Whether it was the gracefulness of a noble or a yuppie, every man had a unique gentleness.</p><br/><p>The beautiful photos were released on the official website.</p><br/><p>Ji and Ya did something bad here. They put each photo in the order of the model’s appearance. If they wanted to see the next one, they had to click on the photo and there was no option to skip a page.</p><br/><p>This type of behaviour without any scruple angered a large group of fans.</p><br/><p>However, Ji and Ya didn’t care about the fans’ anger ╮（╯▽╰）╭.</p><br/><p>They refused to change the setting of the page, forcing the fans to move through all the photos until they reached the final set of photos.</p><br/><p>The resentment turned to silent shock once they saw the photos of these two people.</p><br/><p>The pure white background seemed to have been cleaned and purified. There were red petals falling from the sky and in the centre of the photo, a beautiful youth raised his palm to gently catch the small thing.</p><br/><p>He wore a long coat but his thinness made him seem like he would float out of the photo. Behind him, a man stretched out his other hand, the hem of the jacket floating gently in the photo, making it look extraordinarily quiet.</p><br/><p>The first photo was enough to make people stunned and forget what they were doing.</p><br/><p>Then when they reacted and clicked on the next photo, incredibly…</p><br/><p>Yes, another couple photo!</p><br/><p>The third photo was a couple photo, the fourth one was a couple photo, the fifth one was a couple photo, the sixth one…</p><br/><p>There were a total of 19 photos. Kelson, who previously had the most photos, only had six photos. But these two people unexpectedly had 19 photos.</p><br/><p>Even if it was increased because there were two people, this was still three times more than Kelson!</p><br/><p>【 I feel that God Xi’s behaviour is really shameless but… ahhhh Ming Xiaoyu is really beautiful! God Xi is also really handsome! How can these two people fit together so well? 】</p><br/><p>【 QAQ It is a good match for me ahhhhhh!! 】</p><br/><p>【 Where is this place? When I saw the first photo, I was stunned and my soul went underground. The two of them are simply scattering sugar! I swear, I have never seen someone so passionate about sugar! This is going to kill a person! 】</p><br/><p>【 The scum writer said: I have been forced to die √ 】</p><br/><p>……</p><br/><p>More and more fans noticed the photos published on Ji and Ya’s official website and madly forwarded these photos. Soon, fashion lovers all over the world saw these exquisite photos and had a preliminary view of this Ji and Ya high-end show.</p><br/><p>However, at this time, there was a saying that was being endorsed by many people.</p><br/><p>【 To tell the truth, I was really surprised when Xi Ze announced he was walking in the show. I am very happy. I became a fan because I liked his aura and fierce nature in the fashion shows. But previously, God Xi didn’t give a lot of food. Now that he is giving so much food, I am really worried. What does God Xi want to do? He is 26 years old this year. He might be younger than Kelson and Harriman in the industry but there are many people who have retired when they are 26 years old QAQ… 】</p><br/>\n</div>"}