{"title": "Chapter 219", "id": 219, "volume": 3, "url": "http://boxnovel.org/rebirth-of-a-supermodel-chapter-219", "volume_title": "Volume 3", "body": "<h1>Chapter 219</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 219</p><hr/><br/><p>Eight years had passed since Xi Ze debuted.</p><br/><p>He might be only 26 years old but his semi-retirement attitude caused the fans to have a bad feeling in recent years. The fans would support Xi Ze no matter what he chose. If he chose to suddenly retire, they would wish Xi Ze the best for his future.</p><br/><p>This type of thing could be accepted in the mind, but once it became a reality, even the optimistic fans found it a bit sad and unacceptable.</p><br/><p>【 I started to like Xi Ze when I was in high school and now I am already a mother. I am one year younger than Xi Ze but he is my teenage dream. Now I am seeing him live better and better. I am really happy but I think he will retire from the industry in the future. I am really sad T^T 】</p><br/><p>【 @Xi Ze has never mentioned retiring but I can see that day isn’t far away. 】</p><br/><p>【 I liked @Xi Ze in the Ji and Ya high-end show but I will support him no matter when he leaves the catwalk! This performance is really amazing. The video of the high-end show hasn’t come out yet but when I saw the photos, I saw that God Xi is still my god! 】…</p><br/><p>For any supermodel, two years of inaction was absolutely fatal.</p><br/><p>Xi Ze held the Ji and Ya global spokesperson contract and was also the world’s fashion godfather. Otherwise, he would’ve been pulled down from the throne a long time ago and probably even removed from the supermodels list.</p><br/><p>It was really difficult to balance the identity of a designer and supermodel. It was also difficult to take into account the identity of chief designer for the world’s top luxury brand and first ranked male supermodel.</p><br/><p>In the first few years, Xi Ze and his team never said anything but the fans could see that their god was really tired.</p><br/><p>That’s why they didn’t say anything when Xi Ze didn’t take on any jobs for two years. They gradually turned into designer fans and some even chose a design major because they liked him.</p><br/><p>Suddenly taking so many resources after a two year empty window, any person would think in a certain direction.</p><br/><p>That’s why in one day, the #Xi Ze Retirement# topic reached the top three of Weibo and there were all types of discussions in Baidu.</p><br/><p>As for Xi Ze’s Muse fan forum, it now had more than 43 million fans. Fortunately, the moderators placed restrictions and asked people to wait for news, otherwise the fans would’ve already started to talk.</p><br/><p>Due to the relationship between Xi Ze and Ming Yu, many fans of Xi Ze also went to Ming Yu’s Weibo and fan forum to ask Ming Yu if Xi Ze was retiring. This mentality was understandable to individuals so the mushroom fans didn’t blame them. Instead, a post was opened where this matter could be discussed.</p><br/><p>The controversy continued until early morning of the next day, when Ming Yu posted a message on his Weibo and fan forum.</p><br/><p>【 Ming Yu: He dares to leave now? I won’t allow it! Didn’t you say you would wait for me @Xi Ze? 】 One hour after that, the man replied:</p><br/><p>【 Xi Ze: I will be waiting for you @Ming Yu 】</p><br/><p>After a few minutes, the fans were just feeling moved when the man unexpectedly posted something else.</p><br/><p>【 Xi Ze: Hey, it is late. Sleep @Ming Yu. 】</p><br/><p>Everyone, ‘…Oh my god, would he die if he didn’t show love?!! （┙&gt;∧&lt;）┙へ┻┻!!!</p><br/><p>Ming Yu’s message caused the fans to recall the event two years ago.</p><br/><p>Unconsciously, two years had passed. Two years ago, many of them didn’t know who Ming Yu was. Most people ridiculed Ming Yu for being too arrogant and daring to say he would go beyond Xi Ze.</p><br/><p>Now many of them had become Ming Xiaoyu’s fans and the man he threatened to surpass had become his lover.</p><br/><p>Perhaps the two originally unrelated people were currently doing @#＄@#＄@#＄#! In any case, it was a show of love!</p><br/><p>Time was fleeting.</p><br/><p>This evening, the two men dropped a big piece of news and ran away, making the fans unable to sleep. They ran very well. After Xi Ze said to ‘sleep’, the two of them really didn’t appear. The fans started to recall the past.</p><br/><p>【 When I saw someone who dared to speak about surpassing God Xi on a talk show, I thought this child was a newborn calf and not afraid of the tiger called God Xi. Two years ago, Xi Ze had just taken an advertisement for Ji and Ya. I didn’t expect that after that, Xi Ze didn’t set foot in the supermodel circle for two years. 】</p><br/><p>【 At that time, I said that Ming Xiaoyu wanting to go beyond Xi Ze was just a fool’s dream. Oh, I am already a mushroom fan so don’t hit me QAQ. I just ordered the latest Muse so I can lick Small Mushroom again… 】</p><br/><p>【 At that time, I was about to graduate and now I’m married. Two years have passed so quickly. Ming Xiaoyu really became the second ranked supermodel in the world rankings and he is married to God Xi… 】</p><br/><p>【 LS Fight me! It is Xi Ze who is married to Small Mushroom!! 】</p><br/><p>【 Why are you fighting? God Xi and Small Mushroom are both mine!!! 】…</p><br/><p>When you met someone you could hold hands with for decades, some people would have a wonderful feeling. This could be called love at first sight. Most people thought that nothing happened but they didn’t expect the love to be so vigorous and deep in the heart.</p><br/><p>It was like the first meeting between Xi Ze and Ming Yu. One man had soup spilt on him and washed his hands carefully for a full 10 minutes. During this process, the youth’s intrusion was just a trivial episode. However, their life trajectories started to overlap.</p><br/><p>In the past year, Xi Ze rarely made the suggestion about Ming Yu being his own model, even though the idea was still in his heart. Now that he had his muse as a lover, he could see Ming Yu all the time and there was no need to be a special model.</p><br/><p>The initial meeting of the two people was inseparable to who they were now.</p><br/><p>If Xi Ze hadn’t heard the name ‘Ming Yu’ from Master Fei’s mouth, he wouldn’t remember the name in his heart. If he didn’t see the youth and knew who he was, he wouldn’t have cared about this youth later.</p><br/><p>『 The person I most want to go beyond is Xi Ze. 』</p><br/><p>『 I liked Xi Ze before entering this industry. He is my motivation for entering the fashion industry and made me want to be a model. Every time I feel tired, I think about when I saw Xi Ze’s endorsement of the ‘Red Poppy’ perfume. He is my goal in this industry. I will continuously work hard and even if I can never go beyond him, I would like to look up at him. 』</p><br/><p>『 I’ll wait for you. 』</p><br/><p>……</p><br/><p>Once the fans thought about this, they discovered a big secret and couldn’t help feeling,: 【 My god, I also liked God Xi for so many years. Why couldn’t I marry God Xi? （&gt;＿&lt;）!!! 】 Of course, a long time ago, Xi Ze took to Weibo to ask Xiaoyu if his words on the talk show were a lie. Did Ming Yu really like Xi Ze and enter the industry because of him?</p><br/><p>The answer was self-evident.</p><br/><p>The youth laughed as he looked down at the man. “I entered the industry because of you? Your face is this -＿＿＿＿＿＿＿＿＿＿＿＿＿＿＿＿- big!”</p><br/><p>The man hummed casually at Ming Yu’s answer and said “I don’t know how big my face is. But you should be the clearest about how big ‘I’ am.” This was followed by the shy mushroom cooking process. The scent that could only be smelt and couldn’t be eaten really made other people jealous～</p><br/><p>But the fans killed by dog food naturally didn’t know these things. A group of skills masters started to write and draw stories about the story that started two years ago!</p><br/><p>At that time, there was a lovely little mushroom who wanted to become the tallest plant in the model forest. He wanted to go beyond the forest’s tallest metasequoia. He was laughed at by many small stones and shells. But this small mushroom didn’t give up and tried hard to move forward.</p><br/><p>Once the metasequoia see this silly and cute small mushroom, his heart was moved and the two slowly came into contact with each other. They came into contact and the metasequoia said, “Small Mushroom, your body is so soft. I like it.”</p><br/><p>The small mushroom said, “Metasequoia, you are very tall. I also like it.”</p><br/><p>The metasequoia immediately nodded. “If you like me then become my wife. I can show you the more distant scenery. Come on, sit on my shoulder. Only you can sit on my shoulder.”</p><br/><p>Cough, for the time being, let’s not mention about whether a certain man had a back door for his lover’s convenience. This story was too good～</p><br/><p>Soon there was a bunch of metasequoia x small mushroom stories.</p><br/><p>It was the middle of the night so only Luo Ru saw these things when managing the forum. Luo Ru immediately blushed with shame but the small mushroom was really soft and fat. Therefore, Luo Ru kept a few pieces while deleting others.</p><br/><p>Meanwhile, Xi Ze was sleeping with his mushroom and didn’t know how hard the fans were working.</p><br/><p>The next day, Ming Xiaoyu saw the works that filled the forums, Weibo and Baidu and kicked a man off the bed. “Your pot, your shoulder!”</p><br/><p>Xi Ze was scolded for a while but Ming Yu didn’t feel less angry.</p><br/><p>Then at Xi Ze’s signal, Ding Bo issued an announcement on Xi Ze’s fan forum that there was no clear plan for retirement, please don’t worry.</p><br/><p>At this time, after waiting a full week, the video of Ji and Ya’s July high-end show was finally released!</p><br/>\n</div>"}