{"title": "Chapter 221", "id": 221, "volume": 3, "url": "http://boxnovel.org/rebirth-of-a-supermodel-chapter-221", "volume_title": "Volume 3", "body": "<h1>Chapter 221</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 221</p><hr/><br/><p>The box office for the first day was 30 million.</p><br/><p>The box office for the second day was 28 million.</p><br/><p>The box office for the third day was 30 million.</p><br/><p>The box office for the fourth day was 91.01 million.</p><br/><p>……</p><br/><p>On the seventh day, the daily box office was directly over 100 million!</p><br/><p>There was no win-win situation in the world. A literary movie was easy to win awards but the things they wanted to express were usually more obscure. They often used artistic methods, montage techniques, empty lens and other ways to express the director’s profound meaning.</p><br/><p>Therefore, no matter how high the world of mouth of a literary movie, it still made less money than a commercial movie.</p><br/><p>However, everyone couldn’t believe what Midnight Singing achieved.</p><br/><p>After seven days, a total box office of 570 million! It was because the box office for the first two days wasn’t high, leading to this number. Since the seventh day at the box office, Midnight Singing received more than 100 million yuan a day. On the 10th day, it even got a terrifying 190 million!</p><br/><p>28 days after the end of the global release period, Midnight Singing perfectly ended with a total box office of 4.1 billion, the second highest grossing literary movie in the world. The first was a movie by a Best Male Actor winner in the last century. It told the story of a poor mountainous region and wasn’t as heroic as Ye Xiangchan.</p><br/><p>The people who saw Midnight Singing were full of praise.</p><br/><p>Xiao Biqing’s acting was unquestionable. Her interpretation of a singer who had no less noble sentiments than anyone else. In her final torture, her singing and expression touched countless people, making the audience burst into tears.</p><br/><p>Ming Yu’s part in the movie wasn’t much. After all, it was a female heroine drama and he was just the male protagonist in name. But once Douban published the audience score and movie review, many critics mentioned Ming Yu’s name with a lot of emotions and admiration.</p><br/><p>【 In fact, compared to Xiao Biqing, Ming Yu’s performance is really a lot worse but it reached an average level in this movie. I criticized Ming Yu’s acting two years ago. I thought he was a cancer of the entertainment industry. HIs acting was really empty and boring, containing no soul.</p><br/><p>Now I have to admit that Ming Yu made Ye Yang a living person. He is flesh and blood, with a strength that wasn’t defeated by the war. Ye Yang’s character had no name in history. The reason why Midnight Singing gave Ye Xiangchan a younger brother and also gave him the name ‘Yang’ was to hope that this person could spread sunshine… 】</p><br/><p>Yes, his acting wasn’t the best but there was definitely progress.</p><br/><p>This was the evaluation of Ming Yu by a film critic.</p><br/><p>A large number of critics protested when Ming Yu was nominated for Best Newcomer by the Golden Bear Awards. In their hearts, Ming Yu only had a few scenes that could be considered good. How could he be nominated for Best Newcomer?</p><br/><p>This dog poop was too strong!</p><br/><p>The global box office of An Li was too strong and no good newcomers appeared. How else could Ming Yu be nominated and the movie industry harmed?</p><br/><p>This time, their attitudes towards Ming Yu changed once Midnight Singing came out. To be able to improve his acting to this level, as least Ming Yu put a lot of thought into it. They didn’t know that Ming Yu only gained enlightenment during the process of filming An Li.</p><br/><p>Therefore, Ming Yu’s performance could only be regarded as barely passable in An Li. But some shots were so good that even Xu Yizong praised him.</p><br/><p>Today, Ming Yu had the global endorsement of a top global luxury brand, the endorsement of several top Huaxia brands, participated in countless high-end shows as the opening and finale models and filmed several ads. All of them were well received, while he appeared on the covers of the world’s top five magazines and Huaxia’s eight major first-tier magazines.</p><br/><p>In addition, there was An Li with a total box office of 18.6 billion and Midnight Singing with a total box office of 4.1 billion.</p><br/><p>This all-rounder development made Ming Yu’s name truly world-renowned. Many fans and fashion enthusiasts started to focus on the world supermodel rankings in December.</p><br/><p>In the world supermodel rankings released in September, Xi Ze was still ranked first as most people thought and Ming Yu was ranked second.</p><br/><p>There was no change in the top 10 of the men’s rankings. On the women’s list, Cecilia overtook Adenes, making Cecilia first, Adenes second, He Chaoman third and Du Ruo fourth.</p><br/><p>However, Adenes was quite happy about this result. In an interview, he said, “Don’t look at my ranking as going down. Don’t you see that I am closer to He Chaoman? Second and third! Isn’t this great?”</p><br/><p>The reporter, “…”</p><br/><p>Of course, the September rankings had long passed and the December list was coming soon.</p><br/><p>This time, in addition to accepting the invitations of top luxury brands such as Rosalind, Otilla, Yizhi and Garcia, he also appeared in the November Edith issue. A column was published to introduce Ming Yu’s situation and arranged an interview.</p><br/><p>Since the creation of Edith, only 13 people have received this treatment. The last person was Xi Ze. Even Adenes wasn’t eligible for the cover+column+interview treatment.</p><br/><p>These achievements combined with the box office of Midnight Singing, wasn’t this already a huge score? Midnight Singing was also nominated for Best Movie, Best Director and Best Actress at the golden awards.</p><br/><p>Could such fearful achievements defeat Xi Ze?</p><br/><p>On December 4th, the World Supermodels Organization announced the new rankings on their official website. It was released extremely easily as the list was calmly put up.</p><br/><p>『 The world’s male supermodel rankings:</p><br/><p>Xi Ze, Ming Yu, Kelson Eddie, Luo Cheng, Harriman Owen…</p><br/><p>Second place!</p><br/><p>It was the second place!</p><br/><p>So many achievements still couldn’t surpass Xi Ze!</p><br/><p>At this point, many fashion finally realized the powerlessness of Adenes these past years.</p><br/><p>The chief designer of Ji and Ya and the godfather of the fashion industry, countless models, designers, photographers and magazine editors wanted to grab his thigh and have a relationship with him. If they did, their future in the fashion world would be absolutely smooth!</p><br/><p>Why was this man able to raise He Chaoman and Luo Cheng?</p><br/><p>It was because his position was far higher than these people.</p><br/><p>Xi Ze’s strength was obvious to all. Even if he was away for two years, his performance in the fashion show was no worse than Ming Yu. Some fashion critics even thought that Xi Ze’s momentum and expressiveness was a bit stronger than Ming Yu.</p><br/><p>This was a designer’s advantage. The clothing was designed by Xi Ze and he naturally knew what he wanted to express.</p><br/><p>Wasn’t it really hard to overcome such a gap?</p><br/><p>How much difference was there between Xi Ze and Adenes? Had Ming Yu already surpassed the former Adenes or would he be like Adenes in the future, unable to go further unless Xi Ze retired?</p><br/><p>In the face of such strong achievements, there was no room for concessions, even if they were a couple.</p><br/><p>Previously, Xi Ze announced that he wasn’t retiring yet. In fact, on the surface, he was competing with his lover to be the first ranked supermodel in the world. However, this was a type of protection for Ming Yu.</p><br/><p>Ming Yu said on Weibo: ‘You agreed to wait for me.’ What did this sentence mean?</p><br/><p>It meant: Wait for me to surpass you!</p><br/><p>Let’s assume that Xi Ze retired from the supermodel world before Ming Yu surpassed him. Then even if Ming Yu became first, many people would privately say, “In fact, Ming Yu is worse than Xi Ze. Didn’t he only get first because Xi Ze retired?”</p><br/><p>Many people chose to retire at their peak.</p><br/><p>Whether it was a movie emperor or a godly singer, it was the same in the entertainment industry and the fashion industry. If Xi Ze retired now, many people who mentioned him would feel, “In the years when Xi Ze was in the industry, he really deserved first place.”</p><br/><p>Now he chose not to retire because he was clearly waiting for his lover to surpass him!</p><br/><p>Compared to giving away first place, this ‘waiting for you to surpass me, willingly paving the way for you’ showed a deep love.</p><br/><p>After the rankings were released, fans around the world sighed with regret. They probably guessed that their God Xi wouldn’t retire until Ming Yu surpassed him. This type of feeling was very complicated. On the other hand, they hoped that their god could leave this industry in the glorious first position, making them feel that the god they like is really great.</p><br/><p>All types of feelings condensed into one sentence.</p><br/><p>『 This bowl of dog food, I can’t eat it yet! 』</p><br/><p>Before the new year arrived, something happened that caused discussion in Huaxia. Huaxia’s same-sex marriage law had finally passed the review and would be legal from January 1st, 2019!</p><br/>\n</div>"}