{"title": "Chapter 8 : Dancing with the Skeletons (1).", "id": 8, "volume": 1, "url": "http://boxnovel.org/emperor-of-solo-play-chapter-8-dancing-with-the-skeletons-1", "volume_title": "Volume 1", "body": "<h1>Chapter 8 : Dancing with the Skeletons (1).</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 8 : Dancing with the Skeletons (1).</strong></p><div class=\"innerContent fr-view\" id=\"chapterContent\"><br/><p></p><p style=\"text-align: center\"><span style=\"\"> <strong>­ Dancing with the Skeletons (1)</strong></span></p><br/><p>Virtual reality was able to become the forefront of the modern era because anything was possible inside a VR world. In the VR space, anyone could become the Hulk, Iron Man, or even Marilyn Monroe. One could blaze through the streets on a race car faster than an airplane, or jump down a cliff without a parachute.</p><br/><p>Anything was possible.</p><br/><p>But that didn’t mean one could be good at anything.</p><br/><p>In fact, it was hard.</p><br/><p>Although one could do anything one wanted in the VR world, but it was hard to do it well. Jumping off a cliff? One wouldn’t feel any pain, but most people weren’t able to do it. If they could, there wouldn’t be people crying and shaking in fear as they get trained at boot camps.</p><br/><p>This was the biggest hurdle one had to overcome when playing virtual reality games, especially RPGs.</p><br/><p>Virtual reality games gave players the power to beat a bear to death with just their fists, but even so, it was only possible for two or three out of every ten. The other seven or eight failed.</p><br/><p>There were two reasons.</p><br/><p>First, they couldn’t utilize their powers. Given a car with an upper limit of 600 km per hour, most people wouldn’t be able to go over 200 km per hour. Not only were they scared, but they also lacked the driving talent and experience needed to freely move around curves without crashing.</p><br/><p>The second was their distaste for killing living creatures. To them, the virtual creatures looked no different than real, living creatures.</p><br/><p>The first problem was something the players had to solve for themselves, but it was up to the content creators to solve the second problem. VR games creators found the need to design their games so that players could more easily focus on the game.</p><br/><p>If blood exploded out whenever one swung his sword, or if one pierced a creature with a spear and could feel its dying heartbeats, or if the creature’s organs started spilling out through a cut on their belly, or if one crushed a monster’s head and its brain exploded everywhere, then the game creator would be wearing handcuffs.</p><br/><p>As a result, the beginning of VRMMORPG games was childish to say the least. Monsters were shaped like jellies or polygons to make the game seem less violent. Some games even had candies spill out of monsters’ bodies like piñatas.</p><br/><p>But Warlord was different.</p><br/><p>Warlord’s main content involved fighting monsters, and the game creators believed polishing this aspect to the utmost was the path to success.</p><br/><p>Thus, they made game battles as realistic as possible.</p><br/><p>By realistic, it meant cruel. Blood spurted, and that was it. No organs spilled out from cuts, no brains exploded out, but blood spurted out realistically. Players could always turn this option off, but the fact this option existed was game-changing.</p><br/><p>Furthermore, when monsters got injured, they wouldn’t just sit still but roar angrily. They moved to cover their injuries, and they charged at whoever gave them the injury.</p><br/><p>This was why Warlord became the game to watch. Warlord’s battle was the cruelest and most breathtaking of any other game.</p><br/><p>Conversely, to those playing VR games for the first time, it was a challenge. There were many who couldn’t adjust to the game even after paying the large sum of money to play it.</p><br/><p>Warlord’s solution to this problem was simple.</p><br/><p>They made a very thorough tutorial. The tutorial designer is said to have said the following.</p><br/><p>“If you don’t want to play, then don’t. It’s not me being sarcastic, but my sincere advice. There’s no reason to play this game if it’s stressing. There are other games to play besides Warlord. So don’t play if you don’t want to. Why spend money and force yourself to play a game?”</p><br/><p>There was a rumor that this employee gave a written apology… in any case, new players had to go through 280 minutes of tutorials in order to start playing Warlord.</p><br/><p>This tutorial contained many battle situations, from killing monsters to being completely destroyed by them.</p><br/><p>Most players who go through this tutorial come out with half of their souls drained.</p><br/><p>The same applied now.</p><br/><p>Figur’s Castle!</p><br/><p>The Beginner’s Inn, famous for its melon beer, is located in Figur’s Castle.</p><br/><p>As this was where new players started out, it was filled with newbies who just finished their tutorial. These newbies were currently sitting dispirited at the inn’s tables, staring at the melon beers they received for completing the tutorial.</p><br/><p>‘What the hell.’</p><br/><p>‘Is this a game or torture…?’</p><br/><p>‘Should I just sell my V-Gear? I don’t think I can play this game if it’s like that tutorial…’</p><br/><p>Though they managed to pass, they had received a huge shock. They had heard about the infamous Warlord tutorial, but they didn’t think it would be that bad. Of course, their opinions had changed now that they’ve experienced it.</p><br/><p>Most of the players were contemplating whether to continue playing Warlord or not.</p><br/><p>At that moment, a player with a completely different demeanor appeared.</p><br/><p>“Whoo!”</p><br/><p>A man walked down the stairs leading to the 1st floor, stretching his arms out as if he just got in a good exercise. He had a bright expression, as if he just got off a good sweat at the sauna.</p><br/><p>‘My body’s finally moving again.’</p><br/><p>The man was An Jaehyun, or rather, Hyrkan.</p><br/><p>‘It’s been a while since I’ve had a good fight. A man’s really got to see some blood every once in a while.’</p><br/><p>To him, the tutorial served to recover some of his battle sense. At the same time, Hyrkan was feeling elated.</p><br/><p>‘It feels like I’ve finally returned home.’</p><br/><p>Is this how salmons felt when they came back home?</p><br/><p>Hyrkan felt like he finally put on some clothes that fit him. As a result, he was feeling extremely delighted as he hummed and tapped his feet to the beat.</p><br/><p>The other players, who had been debating whether to continue the game or not, stared at Hyrkan as if it was the most absurd thing they had ever seen.</p><br/><p>‘Who the hell is he?’</p><br/><p>‘Is he crazy?’</p><br/><p>‘He’s humming? He’s clearly a newbie with those clothes, so how can he be humming?’</p><br/><p>They would not normally pay attention to others, but they had just come out of five hours of long torturous battles. To them, Hyrkan simply looked… mad.</p><br/><p>On the other hand, Hyrkan paid no mind to them. He didn’t even put them in his thought.</p><br/><p>He simply didn’t care.</p><br/><p>At that moment, the Beginner’s Inn’s NPC owner spoke to Hyrkan.</p><br/><p>“Good work. It’s nothing big, but here’s some beer for your troubles. Drink it.”</p><br/><p>[You completed the tutorial magnificently. You received a 1000cc Melon Beer as your reward.]</p><br/><p>As a woman’s pleasing voice flowed into his ear, the NPC gave Hyrkan a glass of beer. It was better described as a jug, which Hyrkan chose to chug down his throat.</p><br/><p>“Kya!”</p><br/><p>‘Haven’t had this in a while!’</p><br/><p>As the beer flowed down his throat, its melon scent and special sweetness cleared Hyrkan’s throat while making his mouth fresh.</p><br/><p>‘Come to think of it, the last time I drank a melon beer was… it was before I fought with those Stormhunter fuckers, so it’s been years, huh?’</p><br/><p>The melon beer was a delicacy one could only taste in the VR world. It was made in partnership with the number one VR gourmet content creator, Beautiful Taste. Warlord’s gourmet content was as popular as its battle content, since never before seen flavor could be created in VR worlds.</p><br/><p>“Kaa!”</p><br/><p>After chugging down the 1000cc beer, Hyrkan stepped out of the Beginner’s Inn without a hint of hesitation, and bright sunlight greeted him.</p><br/><p>‘I’m back!’</p><br/><p>The Hero Slaughterer Hyrkan, has come back to Warlord.</p><br/><p>★★★</p><br/><p>[Hyrkan]</p><br/><p>-Level 1</p><br/><p>-Class: Beginner</p><br/><p>-Title Count: 1</p><br/><p>-Stats: Strength (3) / Stamina (3) / Intelligence (3) / Magic (3)</p><br/><p>Hyrkan stared at the note-sized hologram above his watch.</p><br/><p>Staring at his status window, he felt conflicted.</p><br/><p>These four weren’t the only stats. If one researched deeper, one would find many more detailed stats. There were over ten different kinds of attribute resistances, physical and magical defenses, bonus movement speeds, and much more… It goes without saying that Warlord players, especially rankers, enjoyed having lots of numbers. If they got their numbers high enough, they felt happy just looking at them.</p><br/><p>Of course, Hyrkan was no different.</p><br/><p>But looking at the abysmal numbers in front of his eyes, his stomach felt empty.</p><br/><p>‘I have a lot of grinding to do…’</p><br/><p>His first task was to fill up his status window with numbers.</p><br/><p>However, he had something to do before then.</p><br/><p>‘Alright, time to go get my class.’</p><br/><p>It was obtaining his class.</p><br/><p>It wasn’t hard.</p><br/><p>Warlord was a hard game with a complicated battle system. If the battle preparation was hard as well, then no one would play the game.</p><br/><p>Because of this, battle preparation was exceedingly easy compared to the actual battle.</p><br/><p>Class selection was a prime example.</p><br/><p>Most games had a complicated class selection process. They required players to reach a certain level, run long pre-requisite quests, or make you travel far away.</p><br/><p>But in Warlord, there was a Class Tower about 10 minutes away from the Beginner’s Inn. Swordsman, priest, and magician were the three classes over 90% of Warlord players chose. They didn’t care too much as their play style varied significantly depending on how they developed their skill tree.</p><br/><p>The necromancer Hyrkan wanted was a magician.</p><br/><p>‘Become a magician and choose dark magic as my first magic.’</p><br/><p>When players chose the magician class, they were given a choice.</p><br/><p>Black magic or white magic.</p><br/><p>If one chose black magic, he became a black magician. If a black magician went down the necromancer skill tree, he would be called a necromancer.</p><br/><p>At the same time, level 1 players could learn a magic or a skill after selecting their class. In other words, one could use magic starting from level 1.</p><br/><p>The game didn’t irritate players by making them do annoying quests before going into battle. The game creators knew players would go crazy by themselves once they got into fights.</p><br/><p>‘What should I choose?’</p><br/><p>There were many options to choose from after choosing black magic.</p><br/><p>Most chose an attack type magic. Players chose the magician class for that purpose and level 1 attack type magic was still useful later in the game.</p><br/><p>The problem was that players had to raise low-level skill’s rank to prepare for high-level skills later on in the game. It was annoying to grind low-level skill ranks when one became higher level, as it was annoying and time-consuming. The best way to raise a skill’s rank was repeatedly using the skill against monsters near the player’s level.</p><br/><p>Advancing in both skill rank and player level.</p><br/><p>It was the best method of raising skill ranks.</p><br/><p>‘Summon Skeleton.’</p><br/><p>The most basic of the necromancer skill tree was the Summon Skeleton skill.</p><br/><p>If one’s Summon Skeleton skill rank was low, he wouldn’t be able to learn higher-tier skills.</p><br/><p>The answer was obvious.</p><br/><p>‘I wonder how well these skeletons can satisfy me.’</p><br/><p></p></div><br/>\n</div>"}