{"title": "Chapter 7 : Secret of the Expert (2).", "id": 7, "volume": 1, "url": "http://boxnovel.org/emperor-of-solo-play-chapter-7-secret-of-the-expert-2", "volume_title": "Volume 1", "body": "<h1>Chapter 7 : Secret of the Expert (2).</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 7 : Secret of the Expert (2).</strong></p><div class=\"innerContent fr-view\" id=\"chapterContent\"><br/><p></p><p style=\"text-align: center\"><span style=\"\"> <strong>­ Secret of the Export (2)</strong></span></p><br/><p>Every time An Jaehyun swiped his card, the old-style watch on his wrist vibrated.</p><br/><p>‘The money I bet my life on is gone after just two swipes…’</p><br/><p>To An Jaehyun, the vibration felt like the watch writhing in pain.</p><br/><p>‘Whatever. I’ll show the world what it means to earn and spend money like a king.’</p><br/><p>While An Jaehyun was forming a new resolution in his mind, the employee finished reading over the contract and began explaining the final procedure.</p><br/><p>“We’ll deliver the V-Gear to your home at your convenient time. What would you like to do for the detailed settings? Would you like to do it here, or at home?”</p><br/><p>Detailed setting.</p><br/><p>It was the process of adjusting the V-Gear’s numerous options to match the user.</p><br/><p>It was a rather important process, as important as tuning for instruments. The difference between having it done and not having it done was huge. Rankers, whose lives depended on the 1 or 2% difference, were especially careful about the settings. As a result, top ranking player often did their settings on their own. Of course, it was the case for An Jaehyun as well.</p><br/><p>“I’ll do it here.”</p><br/><p>Even so, there was no need to do the entire setting by himself. After roughly setting it up here, An Jaehyun planned on personalizing it as he used it.</p><br/><p>The employee nodded his head.</p><br/><p>“I’ll call the programmer, please wait.”</p><br/><p>★★★</p><br/><p>A programmer, who was furiously typing on his laptop, released his hand. Connected to the laptop was an emerald-colored V-Gear.</p><br/><p>“Shit, what’s wrong here?”</p><br/><p>“What now?”</p><br/><p>“There’s no error in the system no matter how many times I check. There’s nothing we can fix.”</p><br/><p>“So what?”</p><br/><p>“What do you mean ‘what’? It’s a tester problem, so we’ll have to call the tester.”</p><br/><p>The other programmer couldn’t help but smirk at his colleague’s response.</p><br/><p>“Yeah, as if the VVIP will come here. If we call her here, she’ll probably respond with ‘Who the fuck do you think I am?’ That’s if we can even reach her through the phone in the first place.”</p><br/><p>“Well, that’s why I said shit.”</p><br/><p>These two programmers weren’t the run-of-the-mill programmers that looked for defects in the system. They were members of Peach Corp’s Japan Branch, and also part of the research and development team under Peach Corp’s Asia Branch. They were top-level VR programmers who participated in the development of the Level 6 model, and their salaries were easily in the several hundred millions.</p><br/><p>The fact that they had come to Korea in a single day and became repair technicians could only mean that this VVIP held an incredibly important position, enough to easily turn top-level VR programmers into mere repair technicians.</p><br/><p>It went without saying that the two programmers were incredibly frustrated at the whole situation.</p><br/><p>They graduated from prestigious schools, found work in their field’s biggest business, and received the best treatment from others. It was probably their first time being treated as they were today.</p><br/><p>But what choice did they have? As long as they were getting paid, they had to listen to the higher up’s orders.</p><br/><p>“Let’s start from the beginning. What was her complaint?”</p><br/><p>“After the Climbing Test, she said her body felt sluggish and that her reaction time was a tempo off.”</p><br/><p>“The reaction time being off just means the VR physical ability has a slow reception time. As for her body feeling sluggish… I can only think it’s her being unable to adapt.”</p><br/><p>At that moment, An Jaehyun came up to them along with the programmer to do his settings. It was as An Jaehyun intended. To take a closer look at the 6S model, An Jaehyun led his programmer next to them.</p><br/><p>As a result, An Jaehyun was able to overhear their conversation.</p><br/><p>“This is the 6S model, right?”</p><br/><p>An Jaehyun immediately asked. The two programmers only just noticed that An Jaehyun had walked up to them, and they couldn’t hide their surprised faces.</p><br/><p>“Yes?”</p><br/><p>“How did you know?”</p><br/><p>They had no choice but to be surprised. The 6S model was still in testing, and most people didn’t know the Level 6 model even existed. It would be a different story for specialists of the field, but it was clear that An Jaehyun wasn’t one.</p><br/><p>“It is, right?”</p><br/><p>“Yes, it is.”</p><br/><p>“Then it should be a test model. What is a test model doing here? Is there a problem?”</p><br/><p>“It’s because the tester said her body felt sluggish…”</p><br/><p>At that instant, the other programmer glared at the programmer who had just answered An Jaehyun’s question.</p><br/><p>‘Hey! What are you telling him that for?!’ was what his eyes were saying. Noticing the man’s gaze, the programmer in question shut his mouth, realizing his mistake. On the other hand, An Jaehyun was completely unconcerned at the two programmers exchanging glances, as he placed his thought on what the man had just said.</p><br/><p>“If the body feels sluggish, it’s probably because of the Sensory System.”</p><br/><p>Extended Sensory System.</p><br/><p>It was a new system introduced in the Level 6 model.</p><br/><p>It expanded the sensory limits a human could feel in the virtual world, and Warlord players often called it the sixth sense. It was a good system, but it was also a double-edged sword. One’s sensory limits being expanded meant the user had to intake more information. If one received more information than they could handle, the process could only feel sluggish.</p><br/><p>The point was to adapt to it. If one couldn’t adapt, it meant that the person had no talent in using the Extended Sensory System, at which point it was better to not use it at all.</p><br/><p>“I assume the testing method is Climbing. Lower the Extended Sensory System by 50% and check the Climbing test result. Then, adjust the Extended Sensory System by raising it 5% each time. That should do it.”</p><br/><p>The Climbing Test was the most frequently used testing method when performing a VR device setting.</p><br/><p>The Climbing Test was rock climbing in the virtual world. It allowed for the checking of how well and to what extent the user was utilizing his or her VR physical abilities, and how good one’s sense of balance was.</p><br/><p>Meanwhile, the two programmers stared in amazement at An Jaehyun’s explanation.</p><br/><p>“How do you know this?”</p><br/><p>An Jaehyun didn’t seem to be a professional, but his response was full of confidence. He even knew about the Extended Sensory System. This was a state-of-the-art technology only a few specialists in the field knew about. It wasn’t something a clueless nobody could know.</p><br/><p>“Is there a problem with me knowing?”</p><br/><p>“No, but…”</p><br/><p>“Do you perhaps have experience as a tester?”</p><br/><p>Instead of giving an answer, An Jaehyun just shrugged his shoulders. It was a vague reply, but it was the best he could do at the moment. He did have experience, but not as of now.</p><br/><p>Then.</p><br/><p>“Could you please help us?”</p><br/><p>One of the programmers asked An Jaehyun.</p><br/><p>“Hey! What are you saying?”</p><br/><p>The other immediately opposed it. In reality, there was nothing wrong with what he asked. They were working with a device in testing anyways. Collecting data from multiple testers would be the logical thing to do. In fact, it was unusual and illogical for someone to use a testing device as a personal device.</p><br/><p>“Come on! We can test it ourselves all day, but it won’t help at all. Why not just get a little help?”</p><br/><p>“You’re right, but…”</p><br/><p>The two looked over at An Jaehyun, seemingly asking for help. To this, An Jaehyun answered without hesitation.</p><br/><p>“Sorry, I can’t.”</p><br/><p>‘If this is that bitch’s, no reason for me to help.’</p><br/><p>It wasn’t like he was going to be paid for it. Plus, if it really belonged to Choi Sulyeon like he thought, he would rather die before helping his sworn enemy.</p><br/><p>The two programmers made sullen faces, but An Jaehyun ignored them both. An Jaehyun had no reason to pity them. Since they were handling the 6S model, it was clear they were from the main branch, they were elites that An Jaehyun didn’t even have the qualifications to pity.</p><br/><p>An Jaehyun stared back to his programmer.</p><br/><p>“Let’s go do our setting.”</p><br/><p>The third programmer standing behind with a blank expression finally snapped out.</p><br/><p>“An, yes.”</p><br/><p>★★★</p><br/><p>A lady with a model-like stature and a glamourous figure took off an emerald-colored V-Gear, exposing her long, straight hair. She looked at the programmer who helped her take off the V-Gear and nodded her head.</p><br/><p>“I lowered the Extended Sensory System and incrementally increased it like you said, and it feels much better. It should be enough.”</p><br/><p>Along with these words, she signaled with her eyes toward a female bodyguard next to her.</p><br/><p>The female bodyguard began to dismantle the installed V-Gear 6S Level with extreme proficiency. It seemed like she wanted to take it with her straight away. The two programmers let out sigh of relief watching this take course.</p><br/><p>‘Geez, she really treats us like slaves.’</p><br/><p>‘Money sure talks…’</p><br/><p>Choi Sulyeon grabbed her jacket from nearby and took out her wallet, then took out two blank checks.</p><br/><p>“Good work.”</p><br/><p>The two were surprised by both her words and the checks.</p><br/><p>‘No way.’</p><br/><p>They had expected about a million won, but there was an extra zero on the check they received.</p><br/><p>Money talks? Hell yeah!</p><br/><p>The two immediately thought of this idiom. On the other hand, Choi Sulyeon was completely ignoring the two programmers as she handed them the checks. Her business with them had ended the moment she gave them the checks, and she had no reason to keep a close relationship with either of them.</p><br/><p>At that moment, as if she had just remembered something, she asked them a question.</p><br/><p>At the end of the test, I noticed my time ranked second. What was the first?”</p><br/><p>“Yes?”</p><br/><p>The two tightly held onto the checks in their hands as they tilted their heads in question.</p><br/><p>‘Second? What does she mean?’</p><br/><p>‘She ranked second? As if. That time was on the level of a world-record.’</p><br/><p>Here at the Peach Store, all V-Gears shared the same program installed to a single server, because it was impossible to install the program on individual machines due to licensing and storage space. It was the same for the Climbing Test. The rankings were of the users that tried the Climbing Test that day.</p><br/><p>And Choi Sulyeon had just scored a record of 2 minutes and 51 seconds on the A-level test.</p><br/><p>Most people can’t even finish the A-level test. No matter how long one takes, anyone who could complete it would be considered good at adapting to the VR world. Furthermore, only a handful of people could finish this test under 3 minutes. Those that could were geniuses, the so called monsters.</p><br/><p>Choi Sulyeon’s record of 2 minutes and 51 seconds was incredible without doubt. She was content at surpassing her past record of 2 minutes and 58 seconds, a whole 7 second difference. She felt it was worth the effort in obtaining a 6S model.</p><br/><p>But her record was only in second place.</p><br/><p>She couldn’t understand how. How could her monstrous record be second place?</p><br/><p>The two programmers could only tilt their heads.</p><br/><p>Choi Sulyeon frowned, watching the two.</p><br/><p>“Can I see the Climbing Test rankings?”</p><br/><p>At her order, one programmer immediately ran to his laptop. When he saw the record on the screen, his face stiffened.</p><br/><p>“2 minutes 33 seconds…”</p><br/><p>An absurd record was sitting on the first place. It was a time impossible for a human being to achieve.</p><br/><p>The two immediately replied.</p><br/><p>“Looks like it was a bot result.”</p><br/><p>“We had a bot running to test the product. Looks like we accidentally recorded one of its times.”</p><br/><p>It was an impossible record for a human. Then the answer was simple.</p><br/><p>Choi Sulyeon only gave them a tired look before she turned her head away.</p><br/><p>★★★</p><br/><p>After returning home, An Jaehyun stretched as if stared at the V-Gear installed in his small one-room apartment.</p><br/><p>Anyone could easily tell from his face that he was in a bad mood.</p><br/><p>“Damn it.”</p><br/><p>‘Was it because it’s a Level 1 model? I can’t believe my Climbing time fell to the 30s. It was well in the 20s when I was at my peak. Ugh, it must be because I haven’t played in a while.’</p><br/><p>The Climbing Test result put An Jaehyun in a sour mood, and kept bothering him.</p><br/><p>He realized he was not in his best condition.</p><br/><p>‘Necromancer or whatever, I need to first restore myself to my peak condition.’</p><br/><p>With a frown on his face, An Jaehyun finished stretching and grabbed a handful of glucose candy he just purchased. He threw them in his mouth, and he put on the V-Gear glove with a loud chewing noise. Jelly like substance billowed inside the glove, completely immersing his hands down to each fingerprint. An Jaehyun immediately swallowed down the tiny pieces of glucose candy in his mouth.</p><br/><p>Then he laid on the mattress and put on his V-Gear.</p><br/><p>[User An Jaehyun, iris scan complete. Thank you for using the V-Gear.]</p><br/><p>As soon as the iris scan finished, An Jaehyun clamped the mouthpiece inside the V-Gear helmet.</p><br/><p>Biting down strongly, An Jaehyun prepared his mind.</p><br/><p>‘Alright, let’s see who gets the last laugh!’</p><br/><p></p></div><br/>\n</div>"}