{"title": "Chapter 11 : Dancing with the Skeletons (4).", "id": 11, "volume": 1, "url": "http://boxnovel.org/emperor-of-solo-play-chapter-11-dancing-with-the-skeletons-4", "volume_title": "Volume 1", "body": "<h1>Chapter 11 : Dancing with the Skeletons (4).</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 11 : Dancing with the Skeletons (4).</strong></p><div class=\"innerContent fr-view\" id=\"chapterContent\"><br/><p></p><p style=\"text-align: center\"><span style=\"\"> <strong>­ <strong>Dancing with the Skeletons (4)</strong></strong></span></p><br/><p>Woong!</p><br/><p>When An Jaehyun returned to the real world, he was greeted by the V-Gear’s cooling sound.</p><br/><p>[Shutting down the system. Please hold.]</p><br/><p>The alert came after the cooling sound. An Jaehyun spat out the mouthpiece he was biting down on, and he heard the V-Gear unlock with a clunk. An Jaehyun then took off the heavy V-Gear and the thick gloves. He was covered in sweat as he lay on the bed with his running shirt and underwear. It wasn’t simply because of the VR game. His one-room itself was scorching. The indoor temperature was reaching 28.5 degrees Celsius (Editor note: about 83 degrees Fahrenheit), unbefitting of January 3rd.</p><br/><p>An Jaehyun swept back his sweat-covered hair with his hands.</p><br/><p>‘The heating bill’s going to kill me.’</p><br/><p>It wasn’t that his heater broke or that he made a mistake. He had raised the temperature intentionally. Playing Warlord for a long time, he found that he could perform best between 27 and 29 degrees. This was important. If his physical body’s condition fell, his in-game condition fell as well. If it remained severe, the Forced Exit System would activate. Normally it would be fine to adjust game play according to the physical body’s condition, but in critical situations and raids, winning or losing depended on how well one could play at their best condition.</p><br/><p>‘The heating bill’s going to cost several hundred thousand, and if I add the loan interest and monthly game-cost, I’m going to be sucked dry.’</p><br/><p>Warlord was a money-eating game.</p><br/><p>It wasn’t easy to make a living with such a game. An Jaehyun let out a sigh. He hadn’t planned on logging out of the game just yet, but he had a reason for doing so.</p><br/><p>‘This isn’t the necromancer I knew.’</p><br/><p>It was to confirm.</p><br/><p>He used his Skeleton Warrior in battle, and the more he did, the more he was disappointed. Eventually, the disappointment turned into a sense of danger. The problem wasn’t just that it didn’t know how to fight.</p><br/><p>An Jaehyun wasn’t stupid. He had watched necromancers’ battle videos. On January 1st, after he returned to the past, went to the private loaners, borrowed money, and bought the V-Gear at the Peach Store, he had taken some time to watch various necromancers training. He even researched their training method.</p><br/><p>However, he couldn’t find any information on why his Skeleton Warrior was so stupid.</p><br/><p>The Skeleton Warriors in the videos he saw all fought pretty well. They properly defended with the shields they were holding, and they counterattacked with their swords or spears after defending. 10 Skeleton Warriors lined up and advancing looked quite cool.</p><br/><p>‘Why is my skeleton so shit?’</p><br/><p>An Jaehyun was the type to face things head-on and learn rather than theorize.</p><br/><p>But now wasn’t the time to face anything head-on.</p><br/><p>If he really wasn’t feeling it, he had to start over from the beginning. He didn’t have much time. He had to show results within 3 months; otherwise, he would have to waste time paying off his debt at a workshop.</p><br/><p>‘There’s no other choice.’</p><br/><p>There was only one thing he could do, pay money to buy information and training method.</p><br/><p>‘I’ll have to pay for it.’</p><br/><p>Warlord made money. It only made sense that important money-making information was expensive.</p><br/><p>It wasn’t just expensive. Information that made money or hunting strategies went for millions of wons. It was the same for information on character training. Such a thing didn’t come up on the videos either. Some cream of the crop information was only passed through 1 on 1 lessons. Lessons ranged from as little as 100 thousand wons to several million.</p><br/><p>Information may not seem so important, but Warlord wasn’t just a mouse and keyboard game. Any information that allowed one to make money or fix their errors could go for a lifetime.</p><br/><p>Approaching this information was easy.</p><br/><p>There were high-level players that released videos for free. One just had to contact them through the email.</p><br/><p>However, since An Jaehyun didn’t have much money to spare, he hesitated. He never thought he needed to buy information for something as basic as Skeleton Underlings. He wanted to think about it after hitting level 10 in the Training Dungeon, but it seemed that he was too naïve.</p><br/><p>‘Well, if I’m going to do this…’</p><br/><p>An Jaehyun thought of his bank account. He didn’t have much left from everything he had to buy; furthermore, the amount left was what he had to work with for the next 3 months. It wasn’t an easy decision to spend a large sum now, but he knew he had no other choice.</p><br/><p>‘might as well do it well.’</p><br/><p>★★★</p><br/><p>It had been 11 months since the launch of Warlord. The highest level player was the level 85 player Sulwoo, titled First One. The current Top 100 Level Ranking ranged from level 79 to Sulwoo’s 85.</p><br/><p>However, it wouldn’t be wrong to introduce oneself as a Ranker if one’s level went above 70. If one’s level just went over 60, one could call oneself a top level player. The time they spent in the virtual world was no less than the time they spent in the real world.</p><br/><p>Helgen. He was a necromancer who had reached level 61 in such an environment. He was most likely the current highest leveled necromancer, and his YouTube channel had over 300,000 subscribers. From his free-video ads and paid-video revenues, he made over ten million won every month.</p><br/><p>His side job was coaching. There wasn’t much information about the necromancer class, making his know-hows extremely popular.</p><br/><p>His know-how lessons were split into stages, and the lowest of them was a million won. Earning so much for a lesson video may seem like a con, but the demand was high. People who played necromancer weren’t in the right mind in the first place. Plus, he didn’t just send a lesson video. He also gave feedback on any question one might have. He even met some buyers in-game and helped them out. This was big. Some people paid hundreds of thousands of won just to see female VJs act cutesy on stream.</p><br/><p>An Jaehyun paid for this reason.</p><br/><p>Because of the recent rise in won-to-dollar conversion rate, he paid close to 1.1 million won.</p><br/><p>He immediately received a video from Helgen. His video contained various, detailed tips vital for necromancers. An Jaehyun first watched the Skeleton Fragment skill part from the various summoning magic available.</p><br/><p>– This part is on the Skeleton Fragment skill.</p><br/><p>In the video was a man wearing a huge, snakeskin robe. Behind him stood twelve skeletons at attention.</p><br/><p>– Skeletons have excellent Combat AI. At the same time, they have excellent learning ability.</p><br/><p>“Excellent my ass.”</p><br/><p>An Jaehyun commented while watching the video with a stern, serious expression.</p><br/><p>– In the beginning, if you summon a Skeleton Warrior and order it to attack, my words may sound like a lie.</p><br/><p>Snap!</p><br/><p>Along with those words, Helgen snapped his finger once. Then, the Skeleton Warriors behind him held their shields up front and held themselves in a defensive stance. Because their boney bodies weren’t big, their bodies were perfectly hidden behind the shields.</p><br/><p>– The problem is that although they have high intelligence, they have little knowledge. Another problem is that battle itself is a very complicated thing. If someone were to tell you to watch an MMA match and write an essay on all of the moves, you would be hard pressed to do so. It’s the same with skeletons. If you tell them to do something so complicated when they’ve never experienced it, they would never understand how. That’s why there is a Defense Mode and an Attack Mode.</p><br/><p>At this part, An Jaehyun let out a realization.</p><br/><p>‘I see.’</p><br/><p>The explanation continued.</p><br/><p>– It is important to train them in their Defense Mode first. Defense Mode isn’t hard at all. The skeletons just have to use shields to block their opponents’ attacks. It lessens the damage done to the player.</p><br/><p>An Jaehyun understood.</p><br/><p>‘Defense is easy to learn, and if you can defend well, you can more easily read your opponents.’</p><br/><p>There was no way a master like An Jaehyun wouldn’t know the importance of defense.</p><br/><p>Even the brainless Skeleton Warrior should be able to learn how to defend.</p><br/><p>Plus, once you’re able to defend, you can read the enemy’s next move. Opponents react to how one defends. They might try to pierce directly through the defense, or they might try to bypass it. They might even choose not to attack and wait. Of these 3, the defender only had to deal with 2 of them. If the opponent tried to pierce through the defense, the defender had to endure it. If the opponent tried to bypass the defense, the defender had to stop him from doing so.</p><br/><p>If the opponent managed to pierce through, that’s that.</p><br/><p>But if the defender managed to hold out successfully, there was a chance for a counterattack. It may not be easy to succeed in counterattacking, but it wasn’t a hard thing to do. It was simple, yet difficult.</p><br/><p>As An Jaehyun was thinking this, Helgen began to command his Skeleton Warriors for a demonstration. He showed himself directing his Skeleton Warriors hunt a monster. After they had blocked the monster with their shields, they used the opening to pierce through the monster with their spears. Their form of raising their shields again showed absolute discipline.</p><br/><p>-Through trial and error in battles, the Skeleton Warriors grow quickly. By the time you get to level 20, they should be able to fight better than most players. Then, you’ll realize what excellent AI they possess.</p><br/><p>Defend first, attack after.</p><br/><p>That was Helgen’s know-how for handling Skeleton Warriors. It wasn’t anything hard once one knew it, but before one heard it, it was hard to understand.</p><br/><p>Helgen did his money’s worth. He went on to explain the best way to enhance Skeleton Warriors’ Combat AI. What monsters to fight with, what level difference was best, what monsters were best for creating Skeleton Warrior cores, etc. An Jaehyun truly felt his money was well spent.</p><br/><p>‘He’s good. It’s worth the money.’</p><br/><p>There was a reason Helgen was a good necromancer.</p><br/><p>Consumers didn’t spend money on content they would lose money on. Conversely, if it was worth the money, they didn’t hesitate to splurge.</p><br/><p>‘Why was someone like this unpopular?’</p><br/><p>An Jaehyun was also curious.</p><br/><p>At this point, even if not one of the top Rankers, a level 60 necromancer should be famous to a certain degree. But why was a player like this not in An Jaehyun’s memories? If he was at least decent, An Jaehyun should have remembered him.</p><br/><p>There were two possibilities.</p><br/><p>First was that he quit Warlord. The second was that he reached a limit.</p><br/><p>‘Warlord isn’t a game you can quit because you want to. Not unless you run into an unjust problem.’</p><br/><p>This was the main point.</p><br/><p>Helgen’s method wasn’t bad. It was both logical and effective. Defend first, attack after. With this method, he trained his skeletons to be soldiers.</p><br/><p>‘But this is only effective on small fries.’</p><br/><p>There was a huge flaw in this system. Defend first meant one had to give the opponent the first attack. It was fine versus weaker monsters. However, it was a different story for large-type monsters that were above one’s level and even had a fierce spec. There was a high chance the skeletons wouldn’t be able to endure that first hit.</p><br/><p>‘Rich Lich covered this problem with money.’</p><br/><p>By pouring money into the game, Rich Lich raised his Skeleton Warriors’ specs to an unprecedented level. It was something no one else could do.</p><br/><p>In other words!</p><br/><p>‘This is not the way to go.’</p><br/><p>With Helgen’s style, he would only remain an ordinary necromancer. It wasn’t the path for An Jaehyun.</p><br/><p>But An Jaehyun wasn’t disappointed. In fact, this matter gave him a certain confidence.</p><br/><p>‘They aren’t stupid.’</p><br/><p>What An Jaehyun was most worried about was that his Skeleton Warrior’s Combat AI was lower than his expectation. Thanks to Helgen, he learned that it wasn’t that Skeleton Warriors lacked intelligence, but that they lacked knowledge.</p><br/><p>They were like blank slates, ready to absorb any knowledge.</p><br/><p>‘Absorb…’</p><br/><p>An Jaehyun stood up. He grabbed a mouth full of glucose candy, then put on his V-Gear.</p><br/><p>‘Let’s do some dancing.’</p><br/><p>★★★</p><br/><p>Thwack!</p><br/><p>With a harsh, resounding sound, the Skeleton Warrior’s head flew off. It was flailing its arms around to regain balance when Hyrkan sent a low kick to its knee.</p><br/><p>Thud!</p><br/><p>With another resounding sound, the Skeleton Warrior fell on the ground as Hyrkan yelled towards the Skeleton Warrior.</p><br/><p>“Get up!”</p><br/><p>At his words, the Skeleton Warrior got up and picked his head up before plopping it back on his head.</p><br/><p>The skeleton’s eyes, made up of blue flames, were shaped into Xs, making it look rather cute.</p><br/><p>But Hyrkan did not laugh looking at its state. He didn’t sneer or scoff at it either. As soon as its eyes returned to normal, Hyrkan sent another punch to its head. This time, the Skeleton Warrior tilted its head to the side, avoiding the punch.</p><br/><p>Thwack!</p><br/><p>But when Hyrkan bent his elbow, it met with the Skeleton Warrior’s head. Its head was shaken up, and during the time the Skeleton Warrior stood dazed, Hyrkan swiped his leg at its ankle. The Skeleton Warrior’s body became parallel to the ground before it fell with a thud.</p><br/><p>Rattle rattle!</p><br/><p>The sound of bones hitting each other resounded out from its body.</p><br/><p>Hyrkan yelled at such Skeleton Warrior.</p><br/><p>“If you get hit, don’t just stand there! Move! Be wary and continue dodging!”</p><br/><p>The Skeleton Warrior gave no reply; instead, it just stared blankly at Hyrkan.</p><br/><p>In reality, this was to be expected. Skeleton Warriors couldn’t attack their master. In other words, Hyrkan’s Skeleton Warrior couldn’t counterattack to any of Hyrkan’s attacks.</p><br/><p>Hyrkan knew this as well. All he wanted was for it to dodge his attacks.</p><br/><p>‘The defend first, attack second method won’t work in the long-run, when you start fighting proper monsters.’</p><br/><p>Defend first, attack second did not work.</p><br/><p>Then?</p><br/><p>‘Dodge first, attack second is the answer.’</p><br/><p>The best way was to evade the first attack. Dodge instead of being hit. Dodging was also a way of defense, but it was totally different from blocking.</p><br/><p>If this failed?</p><br/><p>‘If this fails, I’ll quit the necromancer class and restart as a swordsman. It’s a waste of time and money, but it’s better than throwing away my second chance.’</p><br/><p>Give up when needed.</p><br/><p>What won’t work will never work.</p><br/><p>Hyrkan swung his fist at the Skeleton Warrior that had stood back up. It was the same attack route as the previous time, and the Skeleton Warrior dodged the punch by tilting its head to the side. Hyrkan then bent his elbow. The Skeleton Warrior bent down, increasing its evasion radius and successfully avoiding Hyrkan’s elbow.</p><br/><p>Whish!</p><br/><p>Hyrkan immediately swiped his leg at its ankle, but the Skeleton Warrior easily avoided it by lifting its foot.</p><br/><p>However, as soon as Hyrkan’s legs came back around, he swung his other leg around in a huge motion.</p><br/><p>Whish!</p><br/><p>The Skeleton Warrior bent its body back, avoiding the kick.</p><br/><p>Then.</p><br/><p>Thud!</p><br/><p>It fell to the ground. Because it bent back too far, it had lost its balance.</p><br/><p>Watching this, Hyrkan’s let out a slight smile.</p><br/><p>‘Not bad.’</p><br/><p>It was absorbing everything. The Skeleton Warrior had a surprising advantage as well. Because it was only bones, its joints had much better maneuverability. Even if its joints got dislocated, it could easily restore itself.</p><br/><p>It had all the right conditions for evading well. It just had to use its head and utilize its advantages.</p><br/><p>Hyrkan!</p><br/><p>It just needed to be around his level.</p><br/><p>If it could…</p><br/><p>‘If there’s ten like me, that’s a real dream-team.’</p><br/><p>Grin!</p><br/><p>Hyrkan’s slight smile had now turned into a full grin.</p><br/><p>Hyrkan touched his wristwatch and activated its music app. Immediately, music filled his surroundings.</p><br/><p>It was one of Michael Jackson’s masterpieces, Billie Jean.</p><br/><p>“Alright, it’s time to dance.”</p><br/><p></p></div><br/>\n</div>"}