{"title": "Chapter 29 : Lizard Swamp (1).", "id": 29, "volume": 1, "url": "http://boxnovel.org/emperor-of-solo-play-chapter-29-lizard-swamp-1", "volume_title": "Volume 1", "body": "<h1>Chapter 29 : Lizard Swamp (1).</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 29 : Lizard Swamp (1).</strong></p><div class=\"innerContent fr-view\" id=\"chapterContent\"><br/><p></p><p style=\"text-align: center\"><strong>Lizard Swamp (1)</strong></p><br/><p>No players hated easy-to-hunt, experience-rich, and item-rewarding monsters.</p><br/><p>However, players naturally flocked to hunting grounds where monsters like these spawned. For Warlord, which had difficulty incomparable to those of normal console or PC games, it was much worse. Furthermore, Warlord’s death penalty was greater than in normal games. It was only natural for players to choose safe and easy hunting grounds.</p><br/><p>But once one experienced being in a hunting ground where there were more players than monsters, and experienced getting into conflict with another party over a monster, a thought must have crossed his mind.</p><br/><p>That rather than just looking at other players, it’d be better to hunt in unpopular areas.</p><br/><p>Of course, when such thought was carried to action, most ended up seeing blood.</p><br/><p>“Fuck! I told you, we shouldn’t have come here!”</p><br/><p>“You’re the one who suggested it!”</p><br/><p>Two players currently crossing a swamp was exactly in such a situation. They weren’t originally two. No parties came to hunting grounds with only two. If there was such a case, one or two members must have died, and the two remaining must be on the run.</p><br/><p>Having lost their friends, no good words came out of the mouths of the two players running away.</p><br/><p>“What kind of a hunting ground is this? Fuck!”</p><br/><p>“Can you stop saying ‘fuck’? Do you need to say that in every sentence?”</p><br/><p>“What? Want to fight?”</p><br/><p>In a situation where foul language went back and forth, it was only natural for a fight to break out.</p><br/><p>In that sense, the Lizard Swamp served as a good hunting ground for party members to reaffirm their relationships.</p><br/><p>Lizard Swamp was a level 30 hunting ground where Green Lizardmen spawned. However, players ranked Lizard Swamp as a late level 30 to an early level 40 hunting ground. There were two reasons for its high difficulty rating.</p><br/><p>First, Lizardmen were hard monsters to hunt. As they walked on two legs and carried swords, they were a vastly different type of monster from the usual. That said, they didn’t fight like humans either. As such, no one had any experience with their fighting style. One could only experience fighting with monsters like Lizardmen in VR games like Warlord.</p><br/><p>The second reason was the nature of the swamp environment. In swamps, it’s much harder to fight or to run away. If a battle didn’t go as planned, the entire situation quickly became worse. For this reason, tank-type players were much more prone to dying in swamps.</p><br/><p>However, setting aside these two reasons, the attack, defense, and stamina of Lizardmen weren’t particularly higher than normal.</p><br/><p>In other words, if one had the experience and ability to deal with these problems, the Lizard Swamp would be a good hunting ground.</p><br/><p>‘Is this the next point?’</p><br/><p>Hyrkan checked the ground as he rolled his ankle. The ground only left a light footprint, proving its hardness.</p><br/><p>‘Alright, here’s point C.’</p><br/><p>Hard ground.</p><br/><p>That was the core idea behind hunting in swamp areas. Rather than thinking of how to fight in swamps, one needed to think about how to get rid of the disadvantageous effects of swamps. Further, it was better to have multiple areas that could do so. Once these areas were found, players would need to plan their activities around them.</p><br/><p>It was the basics of hunting. Just like how fishermen knew where to fish, players needed to know the best places to hunt. Jumping straight into hunting grounds without knowing where to fight was simply foolish.</p><br/><p>Players then needed to know how to lure their prey into their areas. In Warlord, it was extremely important to know how to lure monsters. Tanks with excellent luring ability often received special treatment from guilds and parties.</p><br/><p>With that said, luring was not Hyrkan’s specialty. Luckily, it was easy to aggro Lizardmen. Luring them wouldn’t take extra effort.</p><br/><p>‘What a shame.’</p><br/><p>Because of this, Hyrkan felt rather disappointed as he made his preparation in the Lizard Swamp.</p><br/><p>‘If I made a highlight video of me hunting here, I would easily hit 10,000 views.’</p><br/><p>Many signs hinted that his fights would be easy. There weren’t many Lizardmen, and there were many areas he could use. It was easy to tell that Lizard Swamp’s difficulty level was exaggerated.</p><br/><p>Enough conditions were met to make a good video.</p><br/><p>Even so, Hyrkan had to restrain himself.</p><br/><p>‘I can’t believe I have to suffer so much because of shitheads I don’t know about.’</p><br/><p>Hyrkan just did not have the ability to make enemies of famous or high-level players.</p><br/><p>‘Fine.’</p><br/><p>He could only hold it in.</p><br/><p>Of course…</p><br/><p>‘You’re all dead when I become a Ranker.’</p><br/><p>Hyrkan didn’t plan on holding himself back forever. He was progressing at an excellent pace. He had the foundations to grow faster than he could have ever imagined in the past.</p><br/><p>Once he had enough power and ability, everything would change.</p><br/><p>Thinking about the future, Hyrkan smirked.</p><br/><p>As he did, he took out and wore his hahoe mask.</p><br/><p>★★★</p><br/><p>A green-scaled Lizardman flickered its tongue as it glared at the enemy in front of it. In front of its eyes stood a Skeleton Warrior with a Lizardman skull.</p><br/><p>The two only glared at each other with their swords held out in front. They showed no signs of wanting to clash.</p><br/><p>What urged these two on…</p><br/><p>Snap snap!</p><br/><p>Was the sound of finger snaps.</p><br/><p>Once the sound rang out, the Skeleton Warrior made its move. It held its sword up as it lightly and quickly closed its distance with the Lizardman. Then, it slashed down.</p><br/><p>Clang!</p><br/><p>The Lizardman did not hesitate to fend off the Skeleton Warrior’s sword.</p><br/><p>Immediately after it hit its sword away, the Lizardman swung its sword towards the Skeleton Warrior’s chest. The Skeleton Warrior bent his body back to dodge the attack and began stepping backward to distance itself from the Lizardman.</p><br/><p>The Lizardman had no plans of letting it get away. It followed the backstepping Skeleton Warrior and swung its sword. In order to block the slash, the Skeleton Warrior swung its sword.</p><br/><p>Clang!</p><br/><p>A metallic sound rang out once again as the two swords exchanged blows.</p><br/><p>Within the metallic sound…</p><br/><p>“Helm On.”</p><br/><p>A chant was heard.</p><br/><p>“Bone Armor.”</p><br/><p>Watching the battle, Hyrkan chanted. Then, two horns spouted out of the Skeleton Warrior’s forehead. Its rib cage and spine began to expand, and the previously empty insides of the rib cage began filling in. The Skeleton Warrior transformed, looking as if it was wearing a white plate armor.</p><br/><p>At the same time, the Skeleton Warrior’s flame eyes turned from blue to red.</p><br/><p>Its aura changed as well.</p><br/><p>Unlike before, it stepped forward and began swinging its sword aggressively.</p><br/><p>Clang, clang!</p><br/><p>The Lizardman did not dodge this abrupt swarm of attacks. It also swung its sword and fought back.</p><br/><p>The continuous metallic ringing only stopped when their swords stopped in deadlock.</p><br/><p>Kiik!</p><br/><p>The screech of interlocked metal began to fill the surrounding air.</p><br/><p>In this noise, Hyrkan made his move.</p><br/><p>In an instant, Hyrkan approached the side of the Lizardman. With a quick motion…</p><br/><p>Stab!</p><br/><p>He stabbed his sword into the Lizardman’s scaly skin.</p><br/><p>Having moved stealthily, there wasn’t much strength in his attack. Even the sword had only penetrated about an inch of the Lizardman’s skin. Taking the Lizardman’s size and skin into account, it was hard to expect much damage from such an attack.</p><br/><p>However, that was enough.</p><br/><p>Hyrkan made a satisfactory smile under his hahoe mask.</p><br/><p>Lizardman reacted to Hyrkan’s attack. Still in a deadlock, it turned its head to glare at Hyrkan.</p><br/><p>That was it.</p><br/><p>Although the Lizardman flickered its tongue and glared angrily, that was all it could do. It wasn’t in any situation to attack Hyrkan.</p><br/><p>In fact, it was a mistake to even turn its head aside.</p><br/><p>Hyrkan’s sword had been imbued with Demon Curse, and its effect activated immediately.</p><br/><p>Lizardman’s stats decreased by 10 percent.</p><br/><p>With the 20 percent buff of Madness Helm, the Skeleton Warrior could fight evenly with the Lizardman. Now that it had lost 10 percent of its stats, the Lizardman was no longer on even footing.</p><br/><p>Kiiik!</p><br/><p>The Lizardman’s sword began to be pushed back, and it quickly turned its head back towards the Skeleton Warrior.</p><br/><p>Stab!</p><br/><p>Hyrkan once again stabbed his sword into the Lizardman’s side.</p><br/><p>Ching!</p><br/><p>At that moment, the Skeleton Warrior pushed aside the Lizardman’s sword.</p><br/><p>An opportunity arose.</p><br/><p>Swish!</p><br/><p>With that, the Skeleton Warrior freely slashed his sword. The sword cut the Lizardman’s shoulder joint, and a deep wound could be seen along with huge amount of blood.</p><br/><p>Even at this moment, Hyrkan was doing his work.</p><br/><p>Stab stab!</p><br/><p>Hyrkan stuck to the Lizardman’s side, continuously stabbing the same spot and digging up the wound.</p><br/><p>Chrrrr!</p><br/><p>The Lizardman flickered its tongue as it writhed. Hyrkan then distanced himself while the Skeleton Warrior once again threw its body towards the Lizardman. Now out of battle, Hyrkan summoned another Skeleton Warrior. Then, the fight continued.</p><br/><p>The Skeleton Warrior under the effect of Madness Helm continued its battle with the Lizardman, while Hyrkan and the newly summoned Skeleton Warrior repeatedly attacked from its flank.</p><br/><p>The sound of scales being torn, flesh being cut, and bones being scratched rang out in a mix. The sound of the Lizardman’s death began to slowly fill the silent battlefield.</p><br/><p>★★★</p><br/><p>‘1 minute 22 seconds.’</p><br/><p>In front of the melting corpse of the Lizardman, Hyrkan checked how long the battle took.</p><br/><p>“Wow.”</p><br/><p>‘I’m amazing, aren’t I?’</p><br/><p>The time it took the level 20 Hyrkan to kill the level 30 Lizardman did not exceed 90 seconds.</p><br/><p>The Lizardman wasn’t a boss monster. It didn’t have high stamina or defense, nor was it a large-type monster. It was a monster a well-coordinated 3-man party could kill in 3 minutes. In other words, Hyrkan’s current battle prowess was well over a well-coordinated 3-man party.</p><br/><p>Even Hyrkan was surprised. If he had chosen the swordsman class like he did before, he would have needed at least 5 Unique-rank item parts to have the battle power he currently had. Plus, his weapon would have had to be Unique-rank.</p><br/><p>Furthermore, Hyrkan was practically under no risk during this fight.</p><br/><p>‘I didn’t think Madness Helm and Bone Armor would go so well together.’</p><br/><p>It was thanks to his Skeleton Warrior playing a good tank role.</p><br/><p>Madness Helm turned the summons’ personalities aggressive. There was no such thing as retreat. Thanks to Hyrkan’s training, the Skeleton Warriors showed high close combat evasion, which directly influenced their fighting capabilities.</p><br/><p>Finally, the Skeleton Warriors acquired defense power through Bone Armor. Thanks to that, Skeleton Warriors took significantly less damage, and, consequently, the amount of mana they used decreased as well. Although Bone Armor’s mana cost wasn’t small, there was still a net mana gain. It would be especially helpful when fighting monsters stronger than Lizardmen.</p><br/><p>In any case, aiming for the weak points when a tank was holding up a monster was Hyrkan’s specialty.</p><br/><p>‘Best formation complete.’</p><br/><p>This was the type of battle Hyrkan wanted.</p><br/><p>The feeling of everything going as planned made anyone elated.</p><br/><p>It was the same for Hyrkan.</p><br/><p>‘No need to stop here.’</p><br/><p>Occasionally, days like these came. Days when hunting just went so well! It wasn’t a common occurrence. Thus, it was important to make the most out of days like this.</p><br/><p>‘Alright, let’s leave the egg searching for tomorrow. It’s not like I can do anything about it now anyway.’</p><br/><p>Hyrkan. He started his Lizard Swamp hunt in full scale.</p><br/><p>And it didn’t take long for his battles to attract the attention of others.</p><br/><p>★★★</p><br/><p>“I told you, we shouldn’t have come here.”</p><br/><p>“I’m so tired. Unni*, let’s just go back.”</p><br/><p>[TN: Unni is a younger girl calling an older girl; it’s like onee-san.]</p><br/><p>“Yeah, let’s just go back.”</p><br/><p>This 3-man party was rather unique. It was a party made of only female players. They didn’t look good. The splashes of mud all over them showed that they had their fair share of troubles in the swamp. Other than that, their looks were quite decent. Of course, although faces of Warlord characters deferred greatly from reality, they were still pretty enough to be hit on when they walked down streets. These three were beauties in their own right.</p><br/><p>“Think of what we went through to get here. We can’t just go back after five Lizardmen. That’s too huge of a loss!”</p><br/><p>At the complaints of two, the third member, who seemed like the leader, raised her voice.</p><br/><p>“For now, let’s move. Get up.”</p><br/><p>“I’m tired.”</p><br/><p>“We’re in a game. How are you tired? Get up!”</p><br/><p>Reluctantly, the two girls stood up, and the party continued walking. In the end, they were able to make a certain discovery.</p><br/><p>“Wow! Look at him!”</p><br/><p>“Who is he? Wow, he’s so skilled.”</p><br/><p>They stood astonished as they found at a player fighting a Lizardman in an unbelievable battle.</p><br/><p>Looking at his battle, the party leader’s mouth showed a meaningful smile.</p><br/><p>“Let’s stick with him. How about it?”</p><br/><p>Like an epidemic, the meaningful smile of the party leader quickly spread to the other two.</p><br/><p></p></div><br/>\n</div>"}