{"title": "Chapter 20 : Danger and Chance (1).", "id": 20, "volume": 1, "url": "http://boxnovel.org/emperor-of-solo-play-chapter-20-danger-and-chance-1", "volume_title": "Volume 1", "body": "<h1>Chapter 20 : Danger and Chance (1).</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 20 : Danger and Chance (1).</strong></p><div class=\"innerContent fr-view\" id=\"chapterContent\"><br/><p></p><p style=\"text-align: center\"><span style=\"\"> <strong>­ Danger and Chance (1)</strong></span></p><br/><p>[You leveled up.]</p><br/><p>Along with the sound of his level up alert, Hyrkan raised his hands in the air.</p><br/><p>“Yes!”</p><br/><p>He let out a cheerful scream, which lightly shook the silent forest.</p><br/><p>It wasn’t a particularly fine spectacle. A man wearing a hahoe mask and celebrating with his hands up. It wasn’t something a normal human being would do.</p><br/><p>But Hyrkan didn’t stop here. He began to hum and dance. As the only spectator to this scene, Hyrkan’s Skeleton Warrior watched silently. It had the same expression it always had, but it seemed as if it was watching something ridiculous. A normal person would stop here due to embarrassment, but Hyrkan didn’t have such a thing in his mind.</p><br/><p>“Hm, hmm~~ level 15~!”</p><br/><p>Although all players loved the level up alert, Hyrkan’s actions were truly overbearing. If Hyrkan wasn’t crazy, he must have a reason.</p><br/><p>‘At least for a little while, I’m free from magic power shortage!’</p><br/><p>The items he got from the Ralph Family. He finally met the requirements to equip them. He had already used the precious Black Goblin’s Eyeball to make an item.</p><br/><p>Furthermore, these items took care of the worries Hyrkan had. His happiness was justified.</p><br/><p>‘Alright, time to equip them!’</p><br/><p>Hyrkan placed the sword in his hand into the sword sheath on his waist. Then, he turned his watch dial and selected the 2nd slot.</p><br/><p>“Slot On.”</p><br/><p>With Hyrkan’s command, his pants, shoes, and sword sheath began to melt. Underneath, new pants, shoes, and sword sheath appeared.</p><br/><p>His black leather pants and black leather boots tightly squeezed his skin, while a long sword appeared in place of his old sword.</p><br/><p>This was Warlord’s Slot Change System. Warlord players could store up to 3 item sets in their 3 slots and change among them as they wished.</p><br/><p>Furthermore, the Slot Change System came with various styles. One could transform like the Marvel hero Ironman, or transform like magical girls in anime. Of course, players had to pay for these special styles. The most popular Ironman Style cost 100 dollars per month. Even so, not only did people buy this style, but there were also people who bought Ironman-like suit and slot changed all day.</p><br/><p>However, as Hyrkan was desperately short on money, he had just the standard style.</p><br/><p>“Mmm.”</p><br/><p>In any case, after changing his equipment for the first time, Hyrkan inspected his leather pants and boots. His previously happy expression quickly stiffened. Hyrkan lightly touched his butt. His Black Goblin Leather Pants shined lustrously and felt extremely smooth. Even oiled pants would not be so smooth.</p><br/><p>The tight leather pants openly displayed his undesirable lower half. Though it fit his leather boots, it was no way matching with his average, grey-colored top.</p><br/><p>A fashion terrorist.</p><br/><p>Hyrkan instinctively touched the hahoe mask on his face. Confirming that it was there, Hyrkan clicked his tongue.</p><br/><p>“Fuck.”</p><br/><p>‘Black Goblin Leather Pants. This definitely belonged to a woman.’</p><br/><p>Players could design their items during the crafting phase. Crafted items automatically changed to fit the body size of the wearer. Most people did not go too crazy with their designs. If they went too avant garde, the items values would get lowered.</p><br/><p>In this sense, tight fitting leather pants usually belonged to women. There were no gender limitations on items, and since items changed to fit the size of the wearer, it was completely fine for either gender to wear an item. Even so, few would recommend wearing the other gender’s clothes.</p><br/><p>“… god damn it.”</p><br/><p>Of course, Hyrkan didn’t have the slightest mind to wear items for women.</p><br/><p>But what choice did he have?</p><br/><p>“At least it’s easy to move around.”</p><br/><p>Hyrkan didn’t have the liberty to freely change his items.</p><br/><p>Plus, the leather pants was good enough to disregard its unsightly appearance.</p><br/><p>To calm himself down, Hyrkan opened his stat window.</p><br/><p>[Hyrkan]</p><br/><p>-Level: 15</p><br/><p>-Class: Magician</p><br/><p>-Number of Titles: 2</p><br/><p>-Stats: Strength (72) / Stamina (7) / Intelligence (43) / Magic Power (43)</p><br/><p>Looking at his rich stat window, Hyrkan calmed his uneasy mind.</p><br/><p>‘Black Goblin set isn’t bad at all.’</p><br/><p>First, it raised all stat points by 4. This was the set effect for wearing 2 Black Goblin-related items. Then, Black Goblin Leather Pants and Black Goblin Leather Boots each gave 10 points to intelligence and magic power. Finally, the Deadwood Essence Sword gave another 10 points to magic power.</p><br/><p>With that, his magic power more than doubled.</p><br/><p>‘Looks like skeleton summoning won’t give me any stress.’</p><br/><p>With the magic power he had, he could summon 2 skeleton without worry. It was perfect since he could summon another skeleton once he ranked up his Skeleton Fragment skill.</p><br/><p>‘There are people running around naked, so this isn’t too bad.’</p><br/><p>Hyrkan lightly stroked his thigh. He was truly unhappy with its smoothness.</p><br/><p>‘…it’s not too bad.’</p><br/><p>Hyrkan told himself once again. His complaining and grumbling ended here. What was most important was what to do now.</p><br/><p>Before, he task was simply to level up, but now he had to avoid leveling up at all costs. One had to be below level 15 to receive the Rising Star title. If he leveled up, he would forever lose the chance to gain the Rising Star title.</p><br/><p>Plus, he had to complete the [A Cave in Mt. Bima] quest as soon as possible. The longer it took, the more level-up time he would waste.</p><br/><p>‘I’ll finish it within 2 days.’</p><br/><p>Hyrkan returned to his Hero Slaughterer form.</p><br/><p>★★★</p><br/><p>Hyrkan stepped into a cave in front of him. Then, he immediately checked his quest through his watch.</p><br/><p>[You arrived at the Mt. Bima Cave.]</p><br/><p>He received a new quest alert.</p><br/><p>‘I finally found it.’</p><br/><p>Hyrkan stepped back out. Without entering the cave, he stared at its entrance.</p><br/><p>To find this cave, he searched through Mt. Bima all day. This was the seventh cave he found. It wasn’t difficult as he did not fight with any monsters to avoid leveling up. However, he became increasingly irritated as time went on.</p><br/><p>Climbing a mountain to find a cave. It sounded easy but it was enough to drive people crazy.</p><br/><p>Even now, Hyrkan was more annoyed than happy. He wanted to quickly clear the quest and move on.</p><br/><p>However.</p><br/><p>‘Relax.’</p><br/><p>Hyrkan didn’t force himself. Although it would be his personality to march right in, his long gaming experience wasn’t for show. He knew more than anyone else what he had to do.</p><br/><p>Hyrkan looked around. He found and stood at an appropriate spot.</p><br/><p>His Skeleton Warrior followed him, and Hyrkan changed it back to its fragment form. Hyrkan placed the Skeleton Warrior fragment in his pocket, and entered non-combat mode.</p><br/><p>His next choice…</p><br/><p>‘Log Out.’</p><br/><p>Was logging out.’</p><br/><p>★★★</p><br/><p>After brushing his teeth, An Jaehyun drank a cup of dietary supplements.</p><br/><p>“Burp.”</p><br/><p>The dietary supplement he bought to save money truly tasted horrible. It would not be wrong to compare its taste to a nightmare.</p><br/><p>‘I miss the days of beef proteins and French baguettes carbs…’</p><br/><p>An Jaehyun reminisced the old days. Though not too luxurious, he had enough to buy himself whatever he wanted to eat. He gamed with a full stomach.</p><br/><p>After finishing his reminiscing, An Jaehyun lied back down on his bed. Around his head was not the V-Gear helmet, but his pillows.</p><br/><p>An Jaehyun placed his head down on one pillow and placed the other between his legs.</p><br/><p>‘My top condition.’</p><br/><p>He had finally found the Mt. Bima Cave he was looking for. An average player would have marched right in to complete the quest. Such a player could only remain average his whole life.</p><br/><p>‘I have to be in my top condition.’</p><br/><p>Monsters inside mountain range caves were usually higher leveled than the monsters outside. In addition, unlike in open fields where it was easy to get behind a monster, it was hard to do so in caves. Players usually faced monsters directly.</p><br/><p>Furthermore, it was important to pace oneself in Warlord. It was impossible to play a VR game all day. The player’s health was the most important part. Players could always be forcefully logged out depending on their body’s condition.</p><br/><p>If the player were to be killed during a forced logged out state, that would truly be the worst. He would have to start again from the beginning. In Hyrkan’s case, he would revive in Figur’s Castle and have to go through the process of climbing Mt. Bima again. The time it would take would be in no way shorter than the time it takes to just sleep.</p><br/><p>‘Alright, time to sleep.’</p><br/><p>It was of utmost importance to be in one’s top condition before an important raid, expedition, or battle, and sleep was indeed the best tool to bring out a player’s top form.</p><br/><p>‘Zzz….’</p><br/><p>Some say that the secret to becoming a Ranker is being able to fall asleep whenever one wanted.</p><br/><p>“Snore…”</p><br/><p>In this sense, An Jaehyun truly had a God-given talent for Warlord.</p><br/><p>“Mmm… no, not the leather pants…”</p><br/><p>An Jaehyun had the ability to fall asleep the moment his head touched his pillow.</p><br/><p></p></div><br/>\n</div>"}