{"title": "Chapter 34 : Corrupted Stone (3).", "id": 34, "volume": 1, "url": "http://boxnovel.org/emperor-of-solo-play-chapter-34-corrupted-stone-3", "volume_title": "Volume 1", "body": "<h1>Chapter 34 : Corrupted Stone (3).</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 34 : Corrupted Stone (3).</strong></p><div class=\"innerContent fr-view\" id=\"chapterContent\"><br/><p></p><p style=\"text-align: center\"><strong>The Corrupted Stone (3)</strong></p><br/><p>Boss monsters have stats that are far beyond that of normal monsters at their level.</p><br/><p>Just like people form a party of three or more people to hunt normal monsters, a bigger party is formed to hunt boss monsters. That is what is known as a raid.</p><br/><p>Boss monsters appear in many ways. Those that regularly spawn in designated areas appear with what is known as a Field Reset. A period of time after the death of a boss, a field gets generated randomly for the boss monster to spawn.</p><br/><p>The last Dragon Lizard raid happened one week ago.</p><br/><p>In that case, it wasn’t weird for a Dragon Lizard to appear a week after along with a Field Reset. Although it was strange for Hyrkan and his 10 pursuers to arrive here, it was an impossible matter.</p><br/><p>Only, there was something Hyrkan couldn’t understand.</p><br/><p>‘A black swamp… was there such a setting?’</p><br/><p>It was the existence of a black swamp.</p><br/><p>As someone who aimed to hit level 30 in the Lizard Swamp, Hyrkan naturally had information on the Dragon Lizard. In fact, he periodically checked for updated information on the Dragon Lizard. Furthermore, there were often public announcements before a boss monster raids began, warning players not to hinder the raid. During the time he stayed in the Lizard Swamp, Hyrkan naturally avoided the areas where Dragon Lizard raids were happening. At the same time, he made sure to gather information on how Dragon Lizard spawn areas looked like.</p><br/><p>Characteristic such as a black swamp did not exist in Hyrkan’s memory.</p><br/><p>In other words, the black swamp in front of him was a special case.</p><br/><p>‘Could it be?’</p><br/><p>Ahimbree’s quest immediately flashed through Hyrkan’s mind. The nested egg Ahimbree mentioned was likely to be an egg inside a Dragon Lizard’s home.</p><br/><p>Once Hyrkan arrived at this conclusion, Hyrkan wanted to curse out loud.</p><br/><p>‘No way.’</p><br/><p>It was just too absurd.</p><br/><p>‘You expect me to kill a monster that needs a level 40 average 20-man raid, and get its egg?’</p><br/><p>The raid difficulty of Dragon Lizard was not high. For a boss monster, it was rather easy.</p><br/><p>Even so, it was impossible to do it alone. In the first place, boss monsters weren’t designed to be killed by a single player or a small group of players. Considering Ahimbree just casually gave out such a quest, Hyrkan was fully justified in wanting to curse.</p><br/><p>In any case, now was Hyrkan’s chance.</p><br/><p>Of course, it wasn’t easy for Hyrkan to kill the Dragon Lizard. However, it wasn’t impossible. Hyrkan always fought boss monsters higher than his own level, and he had plenty of experience in battles. He was better than any professional. As Dragon Lizard was one of the easier boss monsters, it was possible for Hyrkan to kill it if he had to.</p><br/><p>However, it was currently too risky. The chance of him being successful was less than 10%.</p><br/><p>In such a case, there was only one answer.</p><br/><p>‘As if I’d kill it.’</p><br/><p>It wasn’t worth it to risk his life.</p><br/><p>Instead, this was a chance.</p><br/><p>‘Hmm.’</p><br/><p>Hyrkan stared at the nine players standing in a daze. Although they were shocked from having one of their comrades taken by the Dragon Lizard, it didn’t take long before they snapped back to the matter at hand. Soon, they changed from their defenseless state to that of tension and alertness.</p><br/><p>‘Looks like they’ve got the basics down at least.’</p><br/><p>Although they were fools who were tricked by a bunch of girls and lost their time and items to Hyrkan, they were at least level 30. At that level, it was inevitable that they went through a fair number of battles.</p><br/><p>Even if they might not know the best course of action, they knew by instinct what had to be done first and foremost.</p><br/><p>“Damn it. Alright, get ready!”</p><br/><p>The first one to come to his senses organized his thoughts and gave an order.</p><br/><p>“It’s a Dragon Lizard! You want to fight it?”</p><br/><p>Someone voiced his doubts. In truth, it was a stupid question. If he was experienced in battle, he would have questioned the method.</p><br/><p>“Even if we are running, we have to get ready.”</p><br/><p>“Why don’t we try? Don’t you think we have a chance if all nine of us try our best?”</p><br/><p>One member voiced a somewhat crazy suggestion. Listening to their conversation from afar, Hyrkan smirked in response.</p><br/><p>‘Idiot. You can’t even catch me and you want to kill a Dragon Lizard?’</p><br/><p>In the meanwhile, the two swordsmen who were standing in the swamp began to turn and walk out. They knew that if they were attacked in the swamp, they would have little chance to even struggle. It was an obvious choice.</p><br/><p>‘You wish.’</p><br/><p>Watching this scene, Hyrkan could hardly sit still.</p><br/><p>Hyrkan snapped his fingers twice. The look in the dancing skeleton’s eyes changed. The Skeleton Warrior burned with intent to fight.</p><br/><p>To such Skeleton Warrior…</p><br/><p>“Madness Helm.”</p><br/><p>Hyrkan poured more fuel to light his fire.</p><br/><p>“Bone Armor.”</p><br/><p>He even supplied more wood to ensure the fire did not go out.</p><br/><p>With Hyrkan’s magic, two horns sprouted out from the Skeleton Warrior’s head along with a scarlet luster in its eyes. Its empty rib cage began filling, and what appeared in place was an armor-like upper body made of bones.</p><br/><p>In this state, the Skeleton Warrior quickly approached the two players who had turned their backs on him.</p><br/><p>With his aggressive nature amplified by Madness Helm, the Skeleton Warrior ran towards the two players without hesitation.</p><br/><p>“Careful!”</p><br/><p>When someone caught sight of this, he obviously warned the two swordsmen. The two swordsmen then turned their heads to look behind them.</p><br/><p>“Shit!”</p><br/><p>The Skeleton Warrior was only a few seconds away from reaching them. With no other choice, one swordsman raised his sword with a bitter voice.</p><br/><p>“I’ll take him!”</p><br/><p>“Thanks!”</p><br/><p>He thought to sacrifice himself, and the other voiced his gratitude as he continued on his way.</p><br/><p>The seven remaining players were watching attentively.</p><br/><p>“Let’s help.”</p><br/><p>“Magicians, prepare your magic. Priests, prepare to heal!”</p><br/><p>At this moment, they were entirely focused on saving their allies.</p><br/><p>Having seen such sight, Hyrkan chuckled.</p><br/><p>‘This must be their first boss raid. Come on guys, that should be the least of your concerns.’</p><br/><p>As if to respond to Hyrkan’s laugh, the Dragon Lizard appeared from the right flank of the seven players. When Hyrkan caught sight of this, he quickly threw himself into the swamp.</p><br/><p>★★★</p><br/><p>What was the most important thing in a boss raid?</p><br/><p>When asked this question, many would answer in different ways. Some might say it’s the existence of a powerful magician, a tank to attract aggro, a striker to fight on the front line, or a priest to keep others alive. However, those who experienced countless number of boss raids did not care about these trifling things. They answered in a simple manner.</p><br/><p>Eliminating the variable!</p><br/><p>The variable implied any hostile monsters or players that was not the boss monster.</p><br/><p>This was why luring ability was so important. Before starting the boss monster hunt, skilled guilds or raid parties first sought to lure non-boss monsters away from the boss.</p><br/><p>With this in mind, a fully-buffed Skeleton Warrior was the greatest, yet the worst, variable.</p><br/><p>Furthermore, this wasn’t just an ordinary Skeleton Warrior.</p><br/><p>It was a D-rank Skeleton Warrior under an E-rank Madness Helm effect. A Skeleton Warrior with such specs was something a level 40 necromancer would summon.</p><br/><p>To make it worse, this Skeleton Warrior was one that received daily, one on one, training from Hyrkan. Its evasion ability was far above an average Skeleton warrior, and something that an average or below-average swordsman couldn’t handle for long.</p><br/><p>‘This god damn skeleton!’</p><br/><p>Not only did it easily evade any attacks, it even counterattacked afterwards. Against such an opponent, the swordsman let out every single curse word in his arsenal.</p><br/><p>In the meanwhile, the Dragon Lizard was running towards the seven players grouped together like bowling pins. Taking notice of the Dragon Lizard, the seven players had no other choice but to separate. Otherwise, the clash would surely result in a strike.</p><br/><p>Unfortunately, it wasn’t that easy to separate. It was largely due to the fact that they were distracted by the Skeleton Warrior.</p><br/><p>In the end…</p><br/><p>Gulp!</p><br/><p>A priest had been swallowed by the Dragon Lizard.</p><br/><p>“Fuck!”</p><br/><p>As he disappeared into the Dragon Lizard’s mouth, the priest let out an uncouth scream. Of course, it wasn’t much of a spectacle. Boss raids were generally filled with all sorts of foul language.</p><br/><p>Meanwhile, the Skeleton Warrior drove its opponent into a corner.</p><br/><p>Having received an order from its master, it showed no signs of wanting to stop.</p><br/><p>After seeing the Skeleton Warrior pushing back the swordsman, the swordsman that had escaped thanks to his sacrifice stopped in place.</p><br/><p>‘Damn it!’</p><br/><p>On land, seven players were in fierce combat with the Dragon Lizard. In that case, it might be better to go save his comrade than to run. Thinking this, the swordsman turned and started his way back in the muddy swamp.</p><br/><p>Suddenly, a fireball struck the back of the player fighting against the Skeleton Warrior. The swordsman on his way to save him stopped, startled.</p><br/><p>“What are you doing?”</p><br/><p>“S-Sorry, it was a mistake!”</p><br/><p>The magician had tried to help, but ended up striking his ally.</p><br/><p>“You retard, watch where you’re throwing that thing!”</p><br/><p>The swordsman angrily cursed at his comrade. It was the typical scenario for failure.</p><br/><p>★★★</p><br/><p>Monsters had different characteristics depending on their type. Of these, the most representative were dragon-type monsters.</p><br/><p>Dragon-type monsters made nests.</p><br/><p>The so-called lairs.</p><br/><p>Inside these lairs were treasures. There were crafting materials as a start, and when these monsters killed players, they kept their fully crafted items inside their lairs.</p><br/><p>Because of this, it wasn’t rare for players to avoid fighting dragon-type monsters and just loot their lairs.</p><br/><p>This was the so-called sneak-thieving</p><br/><p>It was something that happened quite often in Warlord. Considering the high profit one would gain at low risk, it was only obvious. Although it was no different than burglary, one wouldn’t be punished for it. Furthermore, there were demands for sneak-thieving videos, albeit not as much as raids. After all, adventures to find hidden treasures have always been used as motives for movies, Indiana Jones being the most prominent.</p><br/><p>Hyrkan had much experience in this as well.</p><br/><p>As a result, Hyrkan remained on high alert as he jumped from tree to tree like a monkey, looking for the Dragon Lizard’s lair. As he moved, Hyrkan summoned a Skeleton Warrior and put him just standing in the swamp. It was a bait, and at the same time, a warning signal. If this Skeleton Warrior was attacked, Hyrkan’s magic power would deplete and notify him that the Dragon Lizard was on his way.</p><br/><p>About 15 minutes after Hyrkan’s search started…</p><br/><p>‘Okay.’</p><br/><p>Hyrkan caught sight of what looked like a large beaver dam. The large nest was about 3600 square feet, which was large enough for a country house to cover. Hyrkan immediately began to climb the nest as if he was rock climbing. Inside the nest were several objects, metals and gems.</p><br/><p>One of them…</p><br/><p>‘Is this an egg?’</p><br/><p>Resembled an egg.</p><br/><p>‘Isn’t this a rock?’</p><br/><p>However, it was more fittingly a rock than an egg. An egg-shaped rock, one might say.</p><br/><p>Even Hyrkan could not understand what it was. Of course, as he questioned it in his mind, he quickly changed crafting materials into coins and put them in his pocket. As he could not change the ‘egg’ into a coin, he simply wrapped it up and wore it behind him like a bag. Then, he quickly ran out from the lair.</p><br/><p>At that moment, Hyrkan’s magic power depleted in a breeze. It signaled the death of the Skeleton Warrior he had summoned to distract the nine players.</p><br/><p>Hyrkan tightly shut his mouth.</p><br/><p>He still had something left unfinished.</p><br/><p>★★★</p><br/><p>By the time Hyrkan returned to the battlefield, it was in complete chaos.</p><br/><p>Signs of the Dragon Lizard’s struggle was apparent in his surroundings. Fire still burned, most likely from the magic cast by the magicians. Among these flames, Hyrkan caught sight of shining watches.</p><br/><p>Hyrkan looked over all the chaos, and something that had escaped the Dragon Lizard’s eyes caught Hyrkan’s sight.</p><br/><p>“What’s up?”</p><br/><p>It was a survivor.</p><br/><p>He was the sole survivor, one who had hid himself amidst the death of his allies. Because the Dragon Lizard suddenly dashed off, he was able to survive. This, of course, was caused by Hyrkan entering the Dragon Lizard’s lair.</p><br/><p>In a way, Hyrkan was the one who saved his life.</p><br/><p>Of course, this was something the player had no way of knowing. Even if he did, he would not look at Hyrkan as one would look at his savior.</p><br/><p>In any case, the player found his current situation simply… absurd.</p><br/><p>Over ten players had gathered for revenge. It was something that rarely happened even in Warlord. That being the case, he was confident. No matter how strong Hyrkan might be, he thought it was impossible for him to take on all ten of them by himself.</p><br/><p>He had never expected the situation to turn to this.</p><br/><p>He couldn’t even be angry.</p><br/><p>He was simply shocked beyond belief.</p><br/><p>He stared at Hyrkan without a word. On the other hand, Hyrkan examined the arm and facial colors of the player in front of him.</p><br/><p>‘He’s poisoned.’</p><br/><p>Likely from the Dragon Lizard’s poison, the player’s right arm was turning black as charcoal, and black marks stained across his face. If a priest were present, he would be healed in an instant, but it was clear that would not be the case.</p><br/><p>If left alone, he would undoubtedly die.</p><br/><p>Of course, if he wanted to struggle to his bitter end, it was possible. A person at his last breadth was always the most dangerous.</p><br/><p>Despite this fact, Hyrkan shortened the distance between them.</p><br/><p>“Warlord is one hell of a game, isn’t it? It drives you crazy in the strangest of ways.”</p><br/><p>The dying player stared intently at Hyrkan as he approached him. He was currently contemplating quite a bit.</p><br/><p>On one hand, he wanted to harm Hyrkan even if it meant quickening his own death. On the other, everything felt to be in vain. He felt it would be useless no matter what he did.</p><br/><p>“You fucker…”</p><br/><p>In the end, he only moved his mouth.</p><br/><p>Watching the player in front of him, Hyrkan tapped his hahoe mask with his finger.</p><br/><p>“Let’s take this opportunity to get things straight. Remember this mask. If you ever see it again, you’re going to want to run. Because if I find you first… I’ll make you repeat what you just said.”</p><br/><p>At this, the player became enraged as he attempted to swing his fist towards Hyrkan.</p><br/><p>However…</p><br/><p>Stab!</p><br/><p>Hyrkan simply dodged his fist, and stabbed his sword in his eyes, which could be seen between the gap in his helmet. Not once, but several times. He was merciless as he continuously stabbed at him like a machine.</p><br/><p>Chwing!</p><br/><p>As Hyrkan pulled out the sword, it scratched the helmet, causing a metallic sound to ring out. This screech which could be heard only by Hyrkan was more terrifying than ever before.</p><br/><p>The player had been force logged out long ago.</p><br/><p>Although Hyrkan was well aware of this fact, he continued to stab him until only his watch remained.</p><br/><p>In the end, his corpse melted down, leaving behind only his watch, which Hyrkan was quick to pick up.</p><br/><p>‘If you keep coming even after this, then it’s war.’</p><br/><p>This was something Hyrkan picked up from his time fighting against the Stormhunter Guild and the Hahoe Mask Guild that betrayed him. It wasn’t enough to just kill them. He had to make them never want to play Warlord again.</p><br/><p>Of course, Hyrkan wasn’t done with things just yet. He knew the other party would be the same.</p><br/><p>‘Next time I see you, I’ll kill you again.’</p><br/><p>Hyrkan once again pledged revenge and punishment as he turned around and stared back at the black swamp.</p><br/><p>He didn’t stare at it for long.</p><br/><p>Soon after, he turned his back and began to run as far as possible from the black swamp.</p><br/><p>As he ran, he began to search for guilds or raid parties in the vicinity of Bangtz Castle. When he was done, he picked one and contacted them.</p><br/><p>“The Dragon Lizard has respawned in the Lizard Swamp. I’m selling the exact location for 100 dollars.”</p><br/><p>A few minutes afterwards, he got a response.</p><br/><p>– What’s your account number?</p><br/><p>It was his final bit of profit from the Lizard Swamp.</p><br/><p></p></div><br/>\n</div>"}