{"title": "Chapter 36 : Skeletons Hunting Skeletons (2).", "id": 36, "volume": 1, "url": "http://boxnovel.org/emperor-of-solo-play-chapter-36-skeletons-hunting-skeletons-2", "volume_title": "Volume 1", "body": "<h1>Chapter 36 : Skeletons Hunting Skeletons (2).</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 36 : Skeletons Hunting Skeletons (2).</strong></p><div class=\"innerContent fr-view\" id=\"chapterContent\"><br/><p></p><p style=\"text-align: left\"><span style=\"\"><strong>TN:</strong> The monster ‘Skeleton Warrior’ is actually Romanized in Korean, unlike Hyrkan’s Skeleton Warriors which are in their Korean equivalent words. Not that it’s confusing in the story… but just letting you guys know. </span></p><br/><p></p><p style=\"text-align: center\"><span style=\"\"><strong>­ Skeletons Hunting Skeletons (2)</strong></span></p><br/><p>Hyrkan had a fond memory of undead monsters.</p><br/><p>Before returning to the past, when Hyrkan and Kim Dongsoo wandered from hunting ground to hunting ground in order to hit level 40, although they edited and uploaded the hunting videos they made, they didn’t get all too great of a response. ‘It must be because our levels are too low…’ although they told themselves such things, they couldn’t help but wonder if they were overestimating themselves.</p><br/><p>What blew away their doubts was their video made while hunting undead monsters. The video of Hyrkan and Kim Dongsoo flying through the woods filled with undead monsters hit 100,000 views in a month, and served as one of the stepping stones for the foundation of the Hahoe Mask Guild.</p><br/><p>Hyrkan once again planned to use undead monsters as a stepping stone to a higher stage.</p><br/><p>First, Hyrkan made his order of priority.</p><br/><p>‘First and foremost, I need a weapon.’</p><br/><p>Now that he was level 30, he needed to find items appropriate for a level 30 character. Of these, the most important was the weapon.</p><br/><p>‘Blunt weapons are the best for crushing skeletons.’</p><br/><p>The fact that blunt weapons were more effective than sharp weapons in dealing with undead type monsters was something even beginners could understand.</p><br/><p>Of course, no magicians would use blunt weapons to kill undead type monsters.</p><br/><p>Because of this…</p><br/><p>“Hm?”</p><br/><p>While Hyrkan was browsing through the item auction site, he found an extremely cheap blunt weapon.</p><br/><p>[Magician’s Hammer]</p><br/><p>*Main properties</p><br/><p>– Rare-rank Item</p><br/><p>– Magic power +35</p><br/><p>– Required level: 30</p><br/><p>– Required Condition: Magician Class</p><br/><p>*Miscellaneous</p><br/><p>– This item was crafted for magicians and magicians only.</p><br/><p>Magician’s Hammer.</p><br/><p>‘What idiot’s work is this?’</p><br/><p>It was a ridiculous item. A blunt weapon that only magicians can equip?</p><br/><p>‘How out of your mind do you have to be to make something like this.?’</p><br/><p>Simply put, it was completely useless. It wasn’t something someone in the right mind would create.</p><br/><p>There was nothing to say about its price.</p><br/><p>‘Let’s see. It’s… 550 gold.’</p><br/><p>550 gold.</p><br/><p>It was about 550,000 won. It was a rather high price for what is only a level 30 weapon. However, in Warlord’s current market, 550,000 won for a Rare-rank level 30 weapon was a practically a giveaway. Nevertheless, the fact that it still has not been sold showed just how truly useless this item was. Furthermore, it raised magic power, not intelligence. When given the choice between magic power and intelligence, magicians almost always chose intelligence.</p><br/><p>‘Well, not that I mind.’</p><br/><p>In any case, it was a newly found advantage of being an all-strength necromancer. An item that no one would ever use was exactly what he needed.</p><br/><p>Hyrkan purchased the item immediately, his gun already reloaded for anything he might need.</p><br/><p>2000 gold!</p><br/><p>That was the bullet he prepared. If need be, he intended to buy more bullets.</p><br/><p>‘The market price is just too much. If I want to get a full set… I’m going to need at least 4000 gold.’</p><br/><p>The price of level 30 equipment with nice magic power and intelligence stats was enormous. At the same time, some Unique items went by tens of thousands of gold.</p><br/><p>In most games, the average level of players went up, and the price of low level items dropped. However, that was not the case for Warlord. In fact, because of the explosive influx of new players, the price was on the rise. This exponential growth would continue for at least 3, 4 years. After all, there were currently a million players playing Warlord, and the number would rise to ten million.</p><br/><p>As Hyrkan knew this fact better than anybody, he did not complain about the price.</p><br/><p>Only, he sought for ways to acquire items for a cheaper cost.</p><br/><p>Of course, Hyrkan already had some methods in mind.</p><br/><p>“… Jesus, who’s making these things?’</p><br/><p>★★★</p><br/><p>A striped snapback with a New York Yankees logo on top, a studded leather jacket seemingly from the end of the last century, tight floral shorts, rain boots that rose up to the knees, and a massive sledgehammer hanging by the waist for the finishing touch… it was truly something unbearable to watch.</p><br/><p>After checking out his getup, Hyrkan couldn’t help but want to explode in shame.</p><br/><p>‘This is just too much.’</p><br/><p>Although the Goblin Leather set he wore at level 20 looked ridiculous, it at least shared a common theme of being made of leather. It was something one could pass off with ‘he must have a strange taste!’</p><br/><p>But Hyrkan’s current fashion…</p><br/><p>It was something not even comedians would wear. If it was funny like before, he could at least pass it off as a concept. But this… this was on a complete different level. Anyone who saw it would simply freeze in shock.</p><br/><p>In truth, as Hyrkan spent all his effort to save even a single gold, he didn’t consider how they would go together.</p><br/><p>Rather, he didn’t think it would be this bad.</p><br/><p>‘Who the hell made this? These shorts…’</p><br/><p>In particular, his tight floral shorts were something no one in the right mind would make.</p><br/><p>‘It must have been made for a female player.’</p><br/><p>It was the type that required a beautiful girl to pull off. If a grown-up man were to wear it…</p><br/><p>‘Well, at least I won’t have to worry about how to disgust the enemy in PKs.’</p><br/><p>His entire self was asking for a fight.</p><br/><p>Hyrkan was certain. Before he reached level 40, there would be at least one player who came after him just because he didn’t like his fashion.</p><br/><p>‘Haaa, once I get my hands on some money, I’ll get myself a cool full set… kuk.’</p><br/><p>His grumbling ended there.</p><br/><p>Hyrkan changed his item slot into the default Subjugation Association clothes. The only difference was that he now had a hammer, not a sword, around his waist. He returned to his poor, pushover appearance.</p><br/><p>‘That’s it for the preparations.’</p><br/><p>Hyrkan had finished setting his items.</p><br/><p>At the same time, he had already learned his free skill from the Class Tower.</p><br/><p>[Skeleton Magician]</p><br/><p>– Proficiency: Rank F</p><br/><p>– Number of Summonable Skeleton Magicians: 1</p><br/><p>– You can summon a Skeleton Magician instead of a Skeleton Warrior.</p><br/><p>– You can summon 1 more skeleton with Skeleton Fragment.</p><br/><p>Skeleton Magician.</p><br/><p>Simply put, of the 4 skeletons Hyrkan could currently summon with the Skeleton Fragment skill, one would be a Skeleton Magician.</p><br/><p>When the Skeleton Magician skill-rank rose, Hyrkan would be able to summon more Skeleton Magicians. At the same time, the number of skeletons he could summon with Skeleton Fragment would go up.</p><br/><p>Most importantly, it was a necessary skill to learn Golem Summon at level 40.</p><br/><p>‘How long will my magic power last?’</p><br/><p>The amount of magic power required to summon Skeleton Magicians was 1.5 times that of Skeleton Warriors. In addition, Skeleton Magicians expended Hyrkan’s magic power whenever they used magic.</p><br/><p>Even if he could safely hold out now, Hyrkan wondered how he would hold up with the addition of Golems at level 40. As things stood now, he was certain his progress would be halted by his lack of magic power. In the end, he would need help from items. However, as Hyrkan’s level rose, the items he needed only got more expensive. Most of all, to cover for the areas he was lacking in, he would need items that were considered top-tier even in Warlord.</p><br/><p>If he couldn’t get his hands on these items, raid solo play would be but an empty dream.</p><br/><p>It just went to show how Hyrkan’s path was filled with hardships and difficulties.</p><br/><p>Of course, a path filled with hardships was still a path.</p><br/><p>With a sigh, Hyrkan reached out to his waist and held up the hammer. Thanks to investing all his stat points into strength, the hammer felt light as a feather.</p><br/><p>‘I’ve come this far. If there isn’t a path, I’ll just have to make one.’</p><br/><p>★★★</p><br/><p>There was a Skeleton Warrior with a bull’s head. Two horn strutting out from its long skull gave it quite a fearsome impression. Anyone with a bit of insight could tell that this Skeleton Warrior was made from the rare level 40 monster, the Hammering Cow.</p><br/><p>Perhaps due to being made from a Hammering Cow, the Skeleton Warrior handled the massive hammer in its hands with extreme proficiency. Using this hammer, the Skeleton Warrior swiftly dodged the attacks of a human-shaped skeleton in front of it, then counterattacked when it saw an opening.</p><br/><p>Crack!</p><br/><p>Watching the skeleton’s head fly off with a single attack, Hyrkan shouted.</p><br/><p>“Oh! Nice shot!”</p><br/><p>Along with his words, Hyrkan snapped his fingers twice. As if to pound rice into flour, other Skeleton Warriors began to smash the headless skeleton’s body. Soon, the skeleton’s body was completely destroyed, as it fell to the ground. Only, the skeleton’s body received even harsher treatment as it lied on the ground.</p><br/><p>Watching the process unfold, Hyrkan smiled.</p><br/><p>‘Fantastic.’</p><br/><p>For each Hammering Cow Skeleton Warrior Fragments, he had paid over 200,000 won. Hammering Cow bones were hard to come by and was a popular material at the same time. Even so, Hyrkan didn’t feel like he wasted any money.</p><br/><p>‘Yep, skulls should be crushed alright.’</p><br/><p>While Hyrkan was staring admiration, a skeleton was approaching him with a dagger in hand. In only an instance, it neared Hyrkan’s back.</p><br/><p>When it was close enough to reach Hyrkan, it unhesitatingly slashed down towards Hyrkan’s back.</p><br/><p>As if it was the simplest thing to do…</p><br/><p>Whish!</p><br/><p>Hyrkan turned his body and dodged the attack. As he did, with the hammer in his hand…</p><br/><p>Crack!</p><br/><p>He smashed the skeleton’s head. Its head bounced off a nearby tree trunk and rolled back near Hyrkan and its body. The headless skeleton did not panic, and once again swung its dagger at Hyrkan.</p><br/><p>This was the characteristic of undead monsters. Losing a part of their body did not mean a thing. Even without their heads, they didn’t have any trouble seeing in front of them.</p><br/><p>In fact, their bodies got lighter and…</p><br/><p>Whish, whish!</p><br/><p>Their attacks faster.</p><br/><p>But that was it. It wasn’t fast enough to make Hyrkan panic.</p><br/><p>Hyrkan easily dodged more swings of the headless skeleton by ducking low. As he did, he grabbed the skeleton’s head from the ground. Then, he held the hammer close to its head and began to quickly strike the skeleton’s head.</p><br/><p>Clack, clack, clack!</p><br/><p>He looked like a Buddhist monk hitting his wooden bell.</p><br/><p>‘Great sound.’</p><br/><p>It was the strategy for hunting skeleton-type monsters.</p><br/><p>To kill undead monsters, one had to deal as much damage as possible, to make their HP as close to 0 as possible. It was important to continuously deal damage to them. Otherwise, they would continue to move even if one broke their head or pelvis.</p><br/><p>The key was to use this point to one’s advantage.</p><br/><p>By continuously hitting its skull, Hyrkan could continuously deal damage to it.</p><br/><p>At the same time, this was something he could do even while running. It was fine as long as he wasn’t bitten. This was the most important part.</p><br/><p>Hyrkan looked around him.</p><br/><p>‘Geez, they’re like a wild pack of dogs.’</p><br/><p>Just now, he had fought against two skeletons. He couldn’t just sit there and wait.</p><br/><p>They mobbed.</p><br/><p>10 skeletons entered Hyrkan’s field of vision.</p><br/><p>This was why undead monsters were difficult to hunt. Although anybody could kill one, skeletons in the area gathered to help the skeleton being attacked. When they did, one would find themselves surrounded.</p><br/><p>Being surrounded by skeletons caused quite a bit of headache.</p><br/><p>As such, one shouldn’t expect the fight to end with the first encounter. Once one dealt sufficient damage, one needed to move to the next area immediately. Of course, if one moved completely randomly, that person would just end up gathering even more skeletons. As such, it was important to move within predesignated areas, so as to avoid being surrounded.</p><br/><p>To Hyrkan, this was as natural as breathing.</p><br/><p>Tap, tap!</p><br/><p>Hyrkan continued to smack the skeleton’s head as he moved to the next area. Skeleton Warriors, of course, followed suit.</p><br/><p>At that time, a skeleton with a large frame blocked the path of Hyrkan and his Skeleton Warriors. It was a monster on a completely different scale than the ones Hyrkan had faced so far.</p><br/><p>‘Oh, a Skeleton Warrior?’</p><br/><p>At a height of 3 meters, it was wearing a helmet and a breastplate large enough to cover its entire upper body. In addition, it was equipped with a large shield and a long sword to match its size.</p><br/><p>It was a Skeleton Warrior.</p><br/><p>It was a rare monster similar to a Lizard Warrior. At the same time, its strength was incomparable to ordinary skeletons.</p><br/><p>‘Did it just respawn?’</p><br/><p>It was Hyrkan’s first encounter with the Skeleton Warrior since he entered the Dead Woods.</p><br/><p>The Skeleton Warrior was blocking Hyrkan’s way.</p><br/><p>In an instant, Hyrkan analyzed the Skeleton Warrior in front of it.</p><br/><p>‘The head would be too hard.’</p><br/><p>Due to its height, it seemed impossible to smash off its head.</p><br/><p>As the thought flashed by Hyrkan’s mind, the distance between Hyrkan and the Skeleton Warrior had been shortened even further.</p><br/><p>The Skeleton Warrior was the first one to strike.</p><br/><p>Whoosh!</p><br/><p>It swung the sword in its hand horizontally, clearly aiming to behead Hyrkan with a single blow. The heavy sound caused Hyrkan to believe it wasn’t entirely impossible.</p><br/><p>In any case, Hyrkan dodged the attack by lowering his body.</p><br/><p>At the same time…</p><br/><p>Crack!</p><br/><p>As he passed by the Skeleton Warrior’s left side, he smashed his hammer down at the Skeleton Warrior’s kneecap.</p><br/><p>‘There goes one.’</p><br/><p>After passing by the Skeleton Warrior, Hyrkan quickly turned himself around and charged towards the Skeleton Warrior’s back.</p><br/><p>While the Skeleton Warrior was about to fall to its knee, Hyrkan once again smashed with his hammer.</p><br/><p>Crack!</p><br/><p>This time, at the back of its right knee. Then, having lost its balance, the Skeleton Warrior fell forward.</p><br/><p>Snap, snap!</p><br/><p>With two snaps, the nearby Skeleton Warriors raised their hammers into the air as if they had been waiting for this moment. Then, like lightning, they struck down on the Skeleton Warrior’s body with full force.</p><br/><p>Kwang!</p><br/><p>Of these, two Skeleton Warriors even leaped into the air to shorten the distance between them and the Skeleton Warrior. Their nimbleness was something most Skeleton Warriors lacked. Their attack didn’t end there. Four Skeleton Warriors struck down their hammers as if to play an instrument. The Skeleton Warrior’s body could not regenerate as the Skeleton Warriors’ attacks turned it into dust.</p><br/><p>Watching this scene, Hyrkan once again smiled with satisfaction.</p><br/><p>‘I don’t know who raised you all, but he did one hell of a job!’</p><br/><p>Of course, the Skeleton Warrior wouldn’t die with just this. Even now, it was quickly recovering its shattered body. Meanwhile, the group of skeletons chasing after Hyrkan finally arrived.</p><br/><p>Hyrkan turned around and checked their number.</p><br/><p>‘Seven? They’re missing three. In that case…’</p><br/><p>Hyrkan finished his battle calculations in an instant. He immediately reached into his pocket and threw out a small Skeleton Fragment.</p><br/><p>When he did, a small black-boned Skeleton Magician made its appearance.</p><br/><p>“Fire Boom!”</p><br/><p>Hyrkan shouted out the chant for the magic.</p><br/><p>The Skeleton Magician raised its hands up high.</p><br/><p>Crackle!</p><br/><p>A crimson ball of flame rose up between its skinny hands.</p><br/><p>As if to play catchball, Hyrkan gestured like he was throwing the ball into the air. The Skeleton Magician then copied his gesture.</p><br/><p>Whish!</p><br/><p>The ball of flame quickly flew towards the group of skeletons.</p><br/><p>Crash!</p><br/><p>When it touched a skeleton, it exploded.</p><br/><p>The explosion did not deal much damage to the skeletons. Although the body of the skeleton that was hit exploded, it seemed like it would recover in a moment. The rest of the skeletons suffered very little damage.</p><br/><p>However, the explosion caused disarray in the skeleton pack’s battle line.</p><br/><p>Hyrkan snapped his fingers twice.</p><br/><p>Then, Hyrkan’s four Skeleton Warriors stopped their barrage of attacks on the Skeleton Warrior, and turned their heads towards the pack of skeletons. Then, without a shred of hesitation, they charged towards them.</p><br/><p>Seven skeletons in complete disarray versus four skeleton Warriors running in a proper line.</p><br/><p>“I’ll give you a real headache!*”</p><br/><p>[T/N: It’s a pun in Korean. I tried my best here, but in Korean, this ’headache’ is more like a pain in the skull, hence the pun]</p><br/><p>Then, the four Skeleton Warriors charged ahead of Hyrkan!</p><br/><p>Victory was already decided at this point. Had this been a real war, the skeletons would have surrendered long ago.</p><br/><p>Unfortunately for the skeletons, monsters did not come with such a feature. The skeletons reacted in a fixed way at the charging Skeleton Warriors and Hyrkan. Without getting back in formation, the skeletons charged towards them.</p><br/><p>Two sides clashed.</p><br/><p>The result was Hyrkan’s one-sided victory.</p><br/><p></p></div><br/>\n</div>"}