{"title": "Chapter 31 : Lizard Swamp (3).", "id": 31, "volume": 1, "url": "http://boxnovel.org/emperor-of-solo-play-chapter-31-lizard-swamp-3", "volume_title": "Volume 1", "body": "<h1>Chapter 31 : Lizard Swamp (3).</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 31 : Lizard Swamp (3).</strong></p><div class=\"innerContent fr-view\" id=\"chapterContent\"><br/><p></p><p style=\"text-align: center\"><strong>Lizard Swamp (3)</strong></p><br/><p>Luring was a form of art.</p><br/><p>Bringing a target to a wanted location was harder than one might think. In addition, Warlord monsters had their own characteristics. Of these, there were some that sent signals to their comrades or went back if they strayed too far from their pack.</p><br/><p>Even with detailed knowledge on monster behavior, accidents happened. This fact was unchanged for even the Top 30 Guilds. In live broadcasts, it was common to see fights break out due to failed luring. That’s what made it so much fun. Accidents that went against prearranged plans kept viewers tense and on the edge of their seats.</p><br/><p>Not to mention, it was much more difficult to lure monsters in the Lizard Swamp. Lizardmen were easy to aggro. In other words, if one ran into another Lizardman on their way to a designated hunting point, one would end up attracting two Lizardman. In that case, the player would no longer be considered luring. He was simply being chased.</p><br/><p>The same applied to the current situation.</p><br/><p>Nine.</p><br/><p>Partied with three beauties, Hyrkan caught nine Lizardmen. So far, everything went without a hitch. Their party had lacked a tank, but Hyrkan and his Skeleton Warrior proved to be excellent supports.</p><br/><p>In reality, Hyrkan was doing all the hunting. The other three were only sucking up experience like a mosquito.</p><br/><p>But suddenly!</p><br/><p>“Help!”</p><br/><p>Ilya appeared with two Lizardman on her tail. Running towards Hyrkan, she asked him for help. Hyrkan snapped his finger twice, and the Skeleton Warriors that were on standby turned their heads towards the Lizardmen. The flames in their eyes blazed as they charged towards the two Lizardmen.</p><br/><p>Ilya ran past the Skeleton Warriors to safety.</p><br/><p>Behind her…</p><br/><p>Clang, clang!</p><br/><p>The sound of battle rang out. Hyrkan asked through the clashing sound of metals.</p><br/><p>“What happened?”</p><br/><p>“I, I ran into a problem.”</p><br/><p>Ilya continued with a confused and apologetic expression.</p><br/><p>“I ran into a group of Lizardmen. In the end, the three of us had to split up…”</p><br/><p>Hyrkan tried to ask her for a more detailed explanation.</p><br/><p>However…</p><br/><p>“Sorry, I’m so sorry.”</p><br/><p>Ilya kept apologizing before Hyrkan said anything, not giving him a chance to speak. She didn’t just ask for forgiveness. She did so with a teary face. Seeing her act that way, Hyrkan chose to not say anything.</p><br/><p>“Let’s deal with this situation first. I can’t handle both of them alone. I need your support.”</p><br/><p>“Of course!”</p><br/><p>Ilya finally smiled. Her smile together with her teary face made her look pitiful yet beautiful. It was like a flower carefully blooming in torrential rain.</p><br/><p>Hyrkan couldn’t say anything more to her face. Not just Hyrkan, but any male would find themselves hard pressed to do so. Hyrkan silently passed her with his sword in hand. He prepared to fight the Lizardmen. Watching Hyrkan’s back, Ilya’s smile became twisted.</p><br/><p>‘Heh, he’s totally into me.’</p><br/><p>It was a smile of satisfaction.</p><br/><p>‘I mean, it’s only expected with beauties of our level’s affectionate acting.’</p><br/><p>The type of smile that fishermen with a big fish on their hook would make.</p><br/><p>She had her worries. Hyrkan’s skills weren’t normal. Although they didn’t take him to be anything amazing, his three Skeleton Warriors were anything but normal. She felt it would be hard to honey-trap Hyrkan with monsters and their beauty.</p><br/><p>But her worries did not last long.</p><br/><p>For Ilya, it was much more fun to trick players than to hunt monsters. Using her looks and acting skills, she destroyed the inner walls that male players put up and lured monsters to kill them. To her, it was fun to prey on males without having to worry about any potential backlash. It was the type of fun only girls could enjoy, and at the same time, it was something that wasn’t possible in the real world.</p><br/><p>At first, it started out as a joke, a bet of some sort. ‘Who can win over that male player first?’ That type of bet. In a blink of an eye, the bet had continued to where she currently was. It had even become the sole reason she played Warlord.</p><br/><p>In front of Hyrkan who had put up a thick wall, the fun was multiplied. His cold and blunt response set fire to her sense of challenge. Ilya looked forward to watching him fall more so than the items he would drop.</p><br/><p>It wouldn’t be long. Soon, Hyrkan would fall.</p><br/><p>‘Two more will be here soon.’</p><br/><p>The remaining two were each luring one Lizardman. No matter how impressive Hyrkan may be, it was impossible for him to handle four Lizardmen by himself. If he could, there was no reason for him to be here.</p><br/><p>Even more, if a strong magic hit Hyrkan or one of his Skeleton Warriors on ‘accident’?</p><br/><p>Watching the Hyrkan’s back, Ilya licked her lips, like a true snake.</p><br/><p>‘Ah!’</p><br/><p>Imagining the scene, she would soon see; Ilya felt goose bumps on her skin. Although it wasn’t a feeling one could perceive in Warlord, she was sure she could feel it. The arms of her body in the real world would surely be covered in them.</p><br/><p>‘I love this feeling so much.’</p><br/><p>This feeling. It was this feeling that she paid such a large sum to play Warlord. Such a feeling of euphoria wasn’t one she could feel in the real world. Not to mention, it was an act that wouldn’t pose any legal troubles, a perfectly lawful crime!</p><br/><p>Of course, it wasn’t over yet. A fisherman’s work did not end until he cut the stomach of his game.</p><br/><p>Ilya stared at Hyrkan and his summoned Skeleton Warriors as they vigorously fought against the Lizardmen.</p><br/><p>Crack!</p><br/><p>Suddenly, the sound of a hard object breaking struck down like lightning.</p><br/><p>‘Eh?’</p><br/><p>The scene of Skeleton Warriors helpless against Lizardmen entered her eyes.</p><br/><p>‘What’s going on?’</p><br/><p>The Skeleton Warriors she had seen so far did not lose out to Lizardmen in a one on one fight. She wondered just how much money one had to spend to make such strong Skeleton Warriors. If she had the money, she even wanted to try out the necromancer class.</p><br/><p>But suddenly, those Skeleton Warriors were losing.</p><br/><p>They weren’t just losing. They were losing in a completely one-sided manner.</p><br/><p>Crack! Crack!</p><br/><p>The Lizardmen’s swords were easily breaking the Skeleton Warriors’ bone shields.</p><br/><p>Crack!</p><br/><p>Under the continuous barrage of attacks, the Skeleton Warriors broke to an irreparable state. In addition, the Skeleton Warriors weren’t able to counterattack in the slightest. They were no different than sandbags.</p><br/><p>Ilya became flustered.</p><br/><p>This wasn’t it.</p><br/><p>Although the Lizardmen were supposed to kill Hyrkan, such a scene wasn’t part of her scenario.</p><br/><p>Suddenly…</p><br/><p>“I’m out of magic power!”</p><br/><p>Hyrkan shouted at Ilya. As if that wasn’t enough, Hyrkan approached Ilya and spoke again.</p><br/><p>“I have no magic power left. Please buy some time for me to recover it.”</p><br/><p>“What do you…”</p><br/><p>“You just have to buy time. We’re in an urgent situation, so please take on the role of the tank for a while.”</p><br/><p>Ilya did not have any way to refuse Hyrkan’s demand. Everyone knew that a magician without magic power was useless in Warlord.</p><br/><p>In the end, Ilya reluctantly and carefully moved towards the Lizardmen.</p><br/><p>Watching Ilya approach the Lizardmen, Hyrkan silently smirked.</p><br/><p>‘Who do you think you’re trying to backstab?’</p><br/><p>Everything so far was within Hyrkan’s expectations. Although it was possible that they would leave after the ten Lizardmen, Hyrkan was confident enough to bet his life that they would try to backstab him.</p><br/><p>That’s what Warlord was. There was no such thing as turning over a new leaf. As the saying went, once a thief, always a thief. Those who enjoyed PKs did PKs their whole life and those who enjoyed conning others conned others their whole life. Nothing changed in Warlord. There was no reason to.</p><br/><p>When Hyrkan saw Ilya bring over two Lizardmen, he knew their plan began. There was no doubt that the other two were bringing more Lizardmen.</p><br/><p>He didn’t have to see it to know. They planned to throw a bomb called Lizardmen, and when Hyrkan was in a close fight, they planned to throw a magic attack on Hyrkan on ‘accident’. They might even ‘mistakenly’ cast Healing on his skeletons. No matter the case, they would burst out into laughter once Hyrkan died. The memory of today would serve as another treasure for them.</p><br/><p>There was no way Hyrkan would allow such a thing.</p><br/><p>So he…</p><br/><p>‘They’re coming.’</p><br/><p>Threw the bomb back at them.</p><br/><p>It was simple. He just didn’t have to take the bomb in the first place.</p><br/><p>Hyrkan snapped his fingers.</p><br/><p>Snap, snap!</p><br/><p>One, two.</p><br/><p>Snap!</p><br/><p>Then three!</p><br/><p>The snapped his fingers thrice.</p><br/><p>Then, in the middle of battle, his Skeleton Warriors began to dance.</p><br/><p>The zombie dance of Michael Jackson’s Thriller embroidered the battlefield.</p><br/><p>★★★</p><br/><p>♬♪’ Cause this is thrillerㅁ, thriller night ♪♬</p><br/><p>Michael Jackson’s Thriller. The beat of that masterpiece thumped Hyrkan’s chest and eardrums. Only Hyrkan could hear the song.</p><br/><p>As such, Ilya only saw the Skeleton Warriors that had been fighting by her side suddenly straighten their two arms and move side to side.</p><br/><p>Not to mention, she had never seen Michael Jackson’s Thriller before.</p><br/><p>‘What?’</p><br/><p>In such a ridiculous situation, she panicked. She couldn’t discern what was happening.</p><br/><p>Meanwhile, her two friends arrived.</p><br/><p>“Help!”</p><br/><p>As previously promised, the two of them each brought a Lizardman as they arrived pleading for help. When they saw the scene in front of them, they also fell into a panic.</p><br/><p>Meanwhile, the Lizardmen easily got rid of the dancing Skeleton Warriors. Their heads flew with a swing of a sword, and their bodies ended up in tatters after the Lizardmen struck them down with their swords. In the end, the Skeleton Warriors fell.</p><br/><p>The Lizardmen flickered their tongues. They weren’t finished. They wanted more sacrifice. Immediately, they changed their target to Ilya, who was already fighting off one Lizardman.</p><br/><p>Clang!</p><br/><p>Ilya blindly swung her sword only to fend off the Lizardman’s sword.</p><br/><p>Watching this scene, Ilya’s two friends could only stand flustered.</p><br/><p>‘What’s going on?’</p><br/><p>‘Why is unni fighting?’</p><br/><p>Their leader was floundering in danger.</p><br/><p>On the other hand, Hyrkan who was supposed to be the one in danger was lightly dancing in the back.</p><br/><p>With this, it wasn’t hard to determine what happened.</p><br/><p>‘… shit.’</p><br/><p>‘He found out?’</p><br/><p>Watching the scene in front of him, Hyrkan smiled brightly.</p><br/><p>‘God, I love necromancer.’</p><br/><p>He had changed his Skeleton Warriors to defense mode, ordering them to block with their shields instead of evading. This was what led them to become the Lizardmen’s sandbags.</p><br/><p>It was all a ploy.</p><br/><p>Then, in the most critical moment, he made them dance.</p><br/><p>‘I swear, I need to leave this in video.’</p><br/><p>Originally, he didn’t plan on making them dance. He planned just to turn them back into their fragment forms.</p><br/><p>However, his mood didn’t let him.</p><br/><p>Had the girls picked a fight with him straight up or stole his monster, he would have acted appropriately. Instead, they tried to backstab him. They tried to act like his ally to screw him over.</p><br/><p>They had evoked the king’s wrath.</p><br/><p>Here, Hyrkan stopped acting. At quite a distance away, he spoke to the beauties in the battlefield.</p><br/><p>“There is a lot of swamp areas around here, so I recommend you fight rather than run.”</p><br/><p>The girls didn’t answer. Dumbfounded at the fact their plan had gone awry, they stood speechless.</p><br/><p>Clang!</p><br/><p>Ilya couldn’t afford to listen to Hyrkan. Her attention was solely devoted to fighting the Lizardmen. She was almost at her limit as her feet sunk into the trap-like swamp. It wasn’t easy to move in swamps. It was even harder to run. It would be possible if she were separated by some distance, but running away in the middle of a battle was impossible. It was equivalent to giving the opponent her back.</p><br/><p>Moreover, she was barely dealing with one Lizardman, but now there were two. She felt herself about to go crazy.</p><br/><p>It was the same for the remaining magician and priestess. Now that they couldn’t just throw off the Lizardmen behind them, things became much complicated. Could they win against them 1 vs. 1? It might be possible for the magician, but it was impossible for the priestess. She needed help. However, there was only one that could help them…</p><br/><p>And that was Hyrkan.</p><br/><p>Of course, Hyrkan didn’t have an inkling of mind to help them.</p><br/><p>Instead, he offered them some advice.</p><br/><p>“There’s a movie called Hoodwinker that came out 30 years ago. It tells you what happens to liars so check it out.”</p><br/><p>It was a truly priceless advice.</p><br/><p>“W-Wait!”</p><br/><p>Though someone had called him, Hyrkan only waved his hand as he left the scene.</p><br/><p>Watching him go, all three of the shouted at the same time.</p><br/><p>“Damn!”</p><br/><p>That was their last word.</p><br/><p></p></div><br/>\n</div>"}