{"title": "Chapter 46 : Bad Move (2).", "id": 46, "volume": 1, "url": "http://boxnovel.org/emperor-of-solo-play-chapter-46-bad-move-2", "volume_title": "Volume 1", "body": "<h1>Chapter 46 : Bad Move (2).</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 46 : Bad Move (2).</strong></p><div class=\"innerContent fr-view\" id=\"chapterContent\"><br/><p></p><p style=\"text-align: center\"><span style=\"\"> <strong>­ Bad Move (2)</strong></span></p><br/><p>– The Corrupt Count raid is different from any of the raids so far.</p><br/><p>– Can you be a little more specific?</p><br/><p>– The Corrupt Count isn’t a strong monster, but a man of authority that exists in the Warlord world. It’s not just because he is human. So far, raids have been against middle or large sized monsters. This time, it’s against an NPC. This difference is what makes this raid different from all the other raids.</p><br/><p>– Is there a reason the date for the Corrupt Count raid is set to be a week before Warlord’s 1st anniversary? Many say that it would have been better to wait one week until the anniversary. Do you have any plans to delay the raid for a week?</p><br/><p>– Upon much consideration, we decided that now was the time. The most important thing is to increase the chances of success. Even 1% helps. Everything after that is secondary.</p><br/><p>– That was the last question. Do you have anything you’d like to say?</p><br/><p>– We will be the only ones who meet with the Corrupt Count.</p><br/><p>That was the opening of the Corrupt Count raid broadcast.</p><br/><p>An Jaehyun watched the video, holding his tablet PC in his left hand, while his right hand was dropping glucose candies into his coffee. After filling his coffee to the point it was about to overflow, An Jaehyun finally took a sip. The bitter taste of the coffee and the glucose candy’s cheap sugary taste made the drink taste like a medicine.</p><br/><p>Thinking about the live broadcast’s ticket he paid for, An Jaehyun couldn’t help but wonder.</p><br/><p>‘With a price like this, they couldn’t have sold more than 500,000 won.’</p><br/><p>Before An Jaehyun returned to the past, the Hydra Guild’s Corrupt Count live ticket cost was 15,000 won, and 1,960,000 tickets were sold. It was a new record at the time, and the Hydra Guild pulled in over 10,000,000,000 won.</p><br/><p>The reason they were able to do so well was that they took their time. The raid date was as one would expect, and the tickets were sold over three days as well. This time, on the other hand, the tickets were expensive and sold for only one day.</p><br/><p>As long as the Hydra Guild wasn’t stupid, there was no way they didn’t know they were losing out. With that in mind, since they were going this far, it could only mean that the situation was urgent.</p><br/><p>Taking a sip from his coffee again, An Jaehyun made a glum face.</p><br/><p>‘The chance of them failing… is greater than 90%. Yeah, there’s no way.’</p><br/><p>An Jaehyun reminisced.</p><br/><p>‘Well, they failed in the past, so they would have failed this time anyhow.’</p><br/><p>In the past, the Hydra Guild had failed their first Corrupt Count raid.</p><br/><p>They fought well and defeated the Corrupt Count. However, when the Corrupt Count’s HP dropped to 0, a new phase activated and the Corrupt Count ran away. It was similar to how the Golden Skeleton ran away. In the end, the Hydra Guild failed to catch the Corrupt Count they defeated, and it took them another month before they succeeded.</p><br/><p>‘The fact that he runs away is a pain.’</p><br/><p>When the Corrupt Count ran away, a new quest appeared to chase after the Corrupt Count. That was why it took so long to capture him again. If he didn’t run and stayed in a single place, it wouldn’t have taken longer than 10 days to catch him again. Even so, it was amazing that it could last 10 days with all of the Top 30 Guilds waiting in line 24/7 to go into the Corrupt Count raid.</p><br/><p>This was the reason An Jaehyun tipped all 29 guilds.</p><br/><p>‘If I sold the information, I would have been swimming in Wagyu steak all year.’</p><br/><p>Of course, he felt like it was a waste.</p><br/><p>If he sold the information on the Corrupt Count’s identity, he would have made an enormous profit.</p><br/><p>However, it wasn’t smart to do so. If An Jaehyun received the money on his bank account, people would be able to trace him no matter what he did. It wouldn’t be so bad if it just ended there. The problem was that people would grow suspicious of him. If someone who started Warlord 3 months ago knew the identity of the Corrupt Count, it would be Tobot Soft that would come looking for him, not the Top 30 Guilds.</p><br/><p>If An Jaehyun had an amazing plan in mind or the connections to back him up, he would have been able to sell it, but An Jaehyun didn’t have such an ability. This was something An Jaehyun knew better than anyone else.</p><br/><p>However, he didn’t want to let this end as a freebee.</p><br/><p>‘Whatever.’</p><br/><p>Because of his last tip, his future tips would hold credibility. If An Jaehyun became a Ranker class player, then there would be no problem selling information openly. After all, it was common for guilds not part of the Top 30 Guilds to sell them information regarding the main scenario quest.</p><br/><p>‘I’ll think of it as my business card.’</p><br/><p>Of course, An Jaehyun had no intention of selling any information.</p><br/><p>After all, everything would be his in the future.</p><br/><p>★★★</p><br/><p>Storm Queen Shir and Matador Chev.</p><br/><p>Two guild masters representing two of Warlord’s Top 30 Guilds met in the middle of a forest.</p><br/><p>It wasn’t just the two of them. Ten players they brought encircled the table they were sitting around. They were also Warlord’s Ranker class players.</p><br/><p>It was a scene that would send chills down the spine of any Warlord fan.</p><br/><p>It was in this stage that their conversation started.</p><br/><p>“It seems the Hydra Guild just went into the Corrupt Count’s castle.”</p><br/><p>The first to speak was Storm Queen Shir.</p><br/><p>“I’ve heard.”</p><br/><p>“What do you think is going to happen? What do you think is the chance of them succeeding on the First Kill.”</p><br/><p>“Half-half? They’ll either succeed or fail.”</p><br/><p>“What a lazy reply for someone who’s 9th in Rankings.”</p><br/><p>At Shir’s harsh tone, Chev went further into detail.</p><br/><p>“I’m sure they prepared to an extent, but they started much quicker than their D-Day. Even if they were ready material-wise, it can’t be said that they are mentally prepared. Moreover, the pressure on them to succeed on the First Kill is big. In terms of percentage…”</p><br/><p>Before Chev could even finish his thought, Shir spoke out.</p><br/><p>“I’ll bet 1,000,000 gold on them failing. You?”</p><br/><p>Chev didn’t flinch in the slightest at Shir’s words, and immediately replied.</p><br/><p>“I have no interest in betting.”</p><br/><p>“Weak.”</p><br/><p>“I have no interest in getting the short end of such an obvious bet.”</p><br/><p>At the phrase ‘obvious bet’, Shir chuckled. At such an open laugh, the Red Bulls players behind Chev bursted out in anger. In response, the Stormhunter Guild members also twisted their neck, as if they were warming up for battle.</p><br/><p>Of course, a fight did not break out. It wasn’t a meeting arranged for such a purpose.</p><br/><p>In fact, it was the opposite.</p><br/><p>“Let’s stop fooling around and cut to the chase. There’s no point in either of us trying to get the upper hand when we’re here to join hands.”</p><br/><p>It was arranged for them to join hands.</p><br/><p>The Stormhunters and Red Bulls. These two guilds obtained the qualifications to participate in the Corrupt Count raid after the Hydra Guild.</p><br/><p>For boss monster raids, challengers received the qualification in the order that they came. It was the unwritten rule of Warlord. Since the Hydra Guild was the first to claim the Corrupt Count’s castle, they were first. Then came the Red Bulls Guild and the Stormhunter Guild.</p><br/><p>In reality, this was a rare occasion. When guilds joined hands to participate in a raid, it was usually the case that the guild further down the raid order made offers to the guild higher on the raid order. It was never the case that guilds 2nd and 3rd in order joined hands, especially when they were usually fierce competitors.</p><br/><p>The fact that this meeting happened nonetheless spoke to how important this raid was.</p><br/><p>It was easy to tell how valuable the Corrupt Count raid was. It was more important than any of the other raids up to this point. Furthermore, this was their only chance. If they failed, the Corrupt Count raid would end before they would have the chance to try again. As such, they needed to make sure they succeeded on their first try.</p><br/><p>Plus…</p><br/><p>“So? How much did your tip say?”</p><br/><p>“Probably as much as yours.”</p><br/><p>“You didn’t succeed in contacting the sender, did you?”</p><br/><p>“We tried using the address he sent the tip from to contact him. We saw that he read our message, but he didn’t reply. How about you?”</p><br/><p>“No comment.”</p><br/><p>There was a story behind this Corrupt Count raid.</p><br/><p>All 29 guilds received an anonymous tip regarding the identity of the Corrupt Count.</p><br/><p>At first, they thought it was done by an insider from the Hydra Guild. However, the tip used as bait was just too valuable for that to be true. Plus, if the sender’s goal was to sell the information, he would have contacted a few guilds. Contacting all 29 lacked common sense.</p><br/><p>Another possibility they considered was that the sender had a personal grudge against the Hydra Guild and was doing this to get revenge. However, this possibility was quickly struck down. They knew that the Hydra Guild’s management wasn’t so poor.</p><br/><p>They couldn’t help but be curious about the identity and intention of the sender. The only thing they knew for sure was that the sender had a motive for doing so.</p><br/><p>In other words, if the Corrupt Count raid was dragged on, there was a huge chance that he would make a move again.</p><br/><p>In that case, it was to the two guild’s advantage to sort out the situation before the sender made his move.</p><br/><p>As such, there was a clear reason for the two guilds to join hands.</p><br/><p>Talking about various things now was nothing more than pointless small talk. That was the reason the two guild masters were acting so bluntly. They already had their answer, and what they talked about at this point would not change it.</p><br/><p>“I’m not really a fan of all this official business stuff.”</p><br/><p>“We have to at least look the role.”</p><br/><p>“I think we’ve done a good enough job.”</p><br/><p>With that, Shir put her hand out, and Chev took her hand in response.</p><br/><p>“Come to think of it, this is the first time we’re shaking hands.”</p><br/><p>“I haven’t shaken hands with any other guild masters, you know?”</p><br/><p>“What an interesting turn of events.”</p><br/><p>“Agreed.”</p><br/><p>The Stormhunters and Red Bulls officially joined hands.</p><br/><p>★★★</p><br/><p>4 hours into the Corrupt Count raid.</p><br/><p>-How is the current situation?</p><br/><p>– Not good. But we still have a chance.</p><br/><p>Boom!</p><br/><p>Watching the flashy effects and thunderous roars of various skills, An Jaehyun took off his glasses and turned off his tablet PC.</p><br/><p>An Jaehyun blinked to water his dry eyes as he knitted his brows.</p><br/><p>“Tsk, tsk.”</p><br/><p>An Jaehyun audibly clicked his tongue.</p><br/><p>‘That was a raid unfit for the Hydra Guild’s name.’</p><br/><p>The one on its receiving end was obviously the Hydra Guild.</p><br/><p>‘From 1 to 10, there was not a single good thing. A raid specialist guild that’s not part of the Top 30 Guilds would have done much better.’</p><br/><p>The Hydra Guild’s Corrupt Count raid was simply the worst.</p><br/><p>It was fine up to the point of meeting the Corrupt Count. The process of revealing all the facts and making the Corrupt Count reveal his identity on his own was perfect. It was enough to make An Jaehyun applaud at how their preparations and quest progressed.</p><br/><p>The problem arose after the Corrupt Count summoned his corrupted monsters. The Corrupt Count ran away and the battle broke out.</p><br/><p>There were seven monsters he summoned. Tankers aggroed the monsters and split the battlefield into seven fronts. It was perfect up to this point. However, the Hydra Guild lost in three of these seven battles.</p><br/><p>‘This isn’t the Hydra Guild I know. It’s not that they were lacking in ability. It’s just that they couldn’t bring it out to the fullest.’</p><br/><p>Just like that, the Hydra Guild was forced to fight the Corrupt Count when they didn’t have some of their forces. They didn’t have much of a choice. At that point, it was either do or die.</p><br/><p>Immediately afterwards, the Corrupt Count awakened his Power of Corruption.</p><br/><p>Then, the main battle broke out.</p><br/><p>Here, the Hydra Guild made yet another mistake.</p><br/><p>‘In a do or die situation, you have to go all in. Why is the second head sitting in the back?’</p><br/><p>The Hydra Guild’s second head, Sohank, was said to be the strongest in fighting.</p><br/><p>However, he joined the fight only after 5 minute had already passed.</p><br/><p>It was a huge mistake.</p><br/><p>Although it was fine when fighting large-sized monsters, when fighting human-form monsters, the ace card had to draw the aggro without holding back. Because of the unknown anonymous tip, the Hydra Guild took too much precaution and held their ace back.</p><br/><p>‘To think they forgot about such a basic concept. They must have had a mental breakdown.’</p><br/><p>In the first place, if the ace card didn’t work, the raid was bound to fail.</p><br/><p>Of course, it was okay to save the ace card until later. It’s not something to be used willy-nilly, but that was before fighting the boss monster. When fighting the boss monster, one had to go all or nothing.</p><br/><p>As a result of Sohank holding back, the Hydra Guild failed to hold the Corrupt Count’s aggro, and he changed his target to the magicians and the priests in the back. In an instant, three magicians and two priests were killed, and such a loss in a situation where they were already lacking in manpower was devastating.</p><br/><p>It was the death sentence.</p><br/><p>That’s when An Jaehyun stopped watching.</p><br/><p>‘No need to waste my time and watch them die. The live broadcast will probably end soon with an apology interview.’</p><br/><p>He knew the broadcast would end soon.</p><br/><p>In any case, what was important to An Jaehyun was that the Hydra Guild failed without having properly caught the Corrupt Count.</p><br/><p>‘The next one’s going to need to succeed.’</p><br/><p>It wasn’t a good news to An Jaehyun either. After all, An Jaehyun wanted the Corrupt Count to die as soon as possible. For that reason, An Jaehyun wanted the next challenger to succeed.</p><br/><p>If the Corrupt Count didn’t die within the next 25 days, there would have been no sense in him giving out such a valuable information.</p><br/><p>‘I’ve done so much for you all, so someone kill it please. I don’t care who… though it’d hurt my soul if the Stormhunters get it.’</p><br/><p>An Jaehyun made a wry smile.</p><br/><p>To be honest, he wasn’t in a good mood. There was no way he would be when he was on the losing end of the trade. It seemed things would stay that way for a while as well.</p><br/><p>‘I’m probably going to have to share the Immoral Prince too.’</p><br/><p>The second main scenario quest after the Corrupt Count, the Immoral Prince.</p><br/><p>It was unlikely for An Jaehyun to be the main character in the Immoral Prince scenario quest. To gain something, one had to pay the price. In the end, he would probably have to share it.</p><br/><p>It was painful for someone as greedy as An Jaehyun.</p><br/><p>But it would just be until then.</p><br/><p>‘But in the Ruined Kingdom…’</p><br/><p>In the third stage, he had no intention of sharing anything with anyone.</p><br/><p>‘I’ll take it all.’</p><br/><p>The Top 30 Guilds will have to fight over An Jaehyun’s leftovers. That was An Jaehyun’s goal. If he couldn’t achieve it, then there would be no meaning in him going through so much trouble to solo play.</p><br/><p>An Jaehyun got up from his seat.</p><br/><p>‘Alright, time to go play with my skellies again. I can’t forget to educate them.’</p><br/><p>It was time to start gaming again.</p><br/><p></p></div><br/>\n</div>"}