{"title": "Chapter 52 : Lucky Drop (3).", "id": 52, "volume": 1, "url": "http://boxnovel.org/emperor-of-solo-play-chapter-52-lucky-drop-3", "volume_title": "Volume 1", "body": "<h1>Chapter 52 : Lucky Drop (3).</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 52 : Lucky Drop (3).</strong></p><div class=\"innerContent fr-view\" id=\"chapterContent\"><br/><p></p><p style=\"text-align: center\"><span style=\"\"> <strong>­ Lucky Drop (3) </strong></span></p><br/><p>The best way to become famous was to defeat someone famous.</p><br/><p>This was a fact that applied almost everywhere in life.</p><br/><p>Almost everyone who played Warlord wanted to become famous in some way. They wanted their names to appear on YouTube or Google results, and they wanted any video they uploaded to appear on top of the trending feed. Although they tried many different things to achieve this goal, only a few succeeded. The ones who failed bet everything they had for a chance to overturn their status.</p><br/><p>They became a Fame Hunter.</p><br/><p>“My name is Quiyote! Hahoe Mask Hyrkan, I challenge you to a duel!”</p><br/><p>When one became famous, he had to prepare himself to fight off the pesky hyenas.</p><br/><p>Hyrkan had also resolved himself to such things. As such, he wasn’t too surprised by the sudden challenge.</p><br/><p>Hyrkan rubbed his index finger and thumb together.</p><br/><p>How much?</p><br/><p>Realizing the gesture Hyrkan was making, Quiyote answered with a stiff expression.</p><br/><p>“I’ll give you 1,000 gold!”</p><br/><p>Hyrkan stopped the gesture he was making and waved his hand as if to say he should just go hunt the Sword Monkeys nearby.</p><br/><p>“How much do you want?”</p><br/><p>Quiyote asked.</p><br/><p>This wasn’t an uncommon sight. The condition or price of a duel wasn’t determined by the challenger, but the champion. It was only right for the challenger to pay some sort of price to the one who was accepting his challenge. Of course, most opted to go for a PK rather than to pay this price.</p><br/><p>Hyrkan opened his hand and put out five fingers. Quiyote frowned. The ones who responded were his friends.</p><br/><p>“5,000 gold?”</p><br/><p>“Isn’t that too much? He’s hot and all recently, but 5,000 gold to fight a rookie is too much.”</p><br/><p>“He just doesn’t want to fight.”</p><br/><p>“Quiyote, are you really doing this? Why not use that money to go to a club or something?”</p><br/><p>However, his friends’ advice didn’t enter Quiyote’s ears. After contemplating for a bit, Quiyote gave his reply.</p><br/><p>“I’ll give you 5,000 gold!”</p><br/><p>His friends made a surprised expression.</p><br/><p>They knew Quiyote was rich. The White Mamba set he was wearing was proof of it. The level 70 full set sold for above 60,000 gold. In the past, the specially made White Mamba set was traded for 50,000 gold, but now, it was even more expensive.</p><br/><p>For someone like Quiyote who could wear such an item set right after becoming level 70, 5,000 gold wasn’t such a large amount. Even so, he couldn’t spend it as if it was nothing either.</p><br/><p>‘You’re really going to spend that much?’</p><br/><p>That was what his friends’ eyes were saying.</p><br/><p>At their gaze, Quiyote added a condition.</p><br/><p>“But only if you win!”</p><br/><p>Only then did his friends relax.</p><br/><p>‘That makes more sense.’</p><br/><p>‘Right. 5,000 is just too much.’</p><br/><p>At the same time, Hyrkan covered his mouth with his hand and lowered his head. Like Rodin’s The Thinker, Hyrkan seemed to be agonizing over something. Although it was weird his shoulders were jumping up and down, Quiyote and his friends didn’t put much meaning behind it.</p><br/><p>Eventually, Hyrkan let out a sigh and gestured at Quiyote to come over.</p><br/><p>Quiyote smiled.</p><br/><p>★★★</p><br/><p>‘The chance is finally here.’</p><br/><p>Seeing the Armor Monkey Skeleton Warrior through the gap in his helmet, Quiyote gripped the sword in his hand tightly.</p><br/><p>He was now level 71. Since he started Warlord, there wasn’t a single time he was troubled.</p><br/><p>It was because he had money. As such, he could always have the best items for his level. Because he didn’t work, he had plenty of time in his day to invest into Warlord.</p><br/><p>Moreover, he really enjoyed games. He didn’t hesitate to spend money. As a result, he was always among the best in online games.</p><br/><p>However, it was different in Warlord. Although he hadn’t run into any troubles, he wasn’t famous either.</p><br/><p>In other games, his name was known across the server or the entire game. Yet, in Warlord, he was just an average player without a nickname.</p><br/><p>Although he had uploaded videos to YouTube before, it wasn’t well accepted. Although he paid money to a firm to get his views up, that was it.</p><br/><p>To him, Hyrkan was the most enticing prey.</p><br/><p>‘If I win against you, I can spread my name.’</p><br/><p>Hyrkan was indeed a very enticing prey. He didn’t have any background. Since he wasn’t part of any guild, there wouldn’t be any trouble afterwards. Plus, he traveled alone. He could be pushed over with sheer number. Even so, he was quite famous. Although it wasn’t as much as Rankers, his speed or process of gaining fame was different than all the others.</p><br/><p>If Quiyote defeated him, he would be able to gain some attention to himself.</p><br/><p>Of course, the most important thing was whether Quiyote could defeat Hyrkan.</p><br/><p>However, Quiyote was confident in this aspect.</p><br/><p>‘First of all, I’m at least 10 levels higher.’</p><br/><p>Kiyote was level 71. Although Hyrkan’s level was never announced to the public, Quiyote could tell that Hyrkan was undoubtedly in level 50s from his videos.</p><br/><p>‘It looks like he got some decent items… but it can’t be better than mine.’</p><br/><p>Quiyote had the White Mamba set. It came with one of the top bonus options available amongst level 70 item sets.</p><br/><p>Finally, Quiyote was confident in his ability. He believed the only reason he hadn’t made a name for himself was because he was unlucky, not because he lacked the skill.</p><br/><p>‘There’s no way I’d lose to him.’</p><br/><p>But when the fight began, Quiyote couldn’t help but change his mind.</p><br/><p>The fight began without any warning, and a flashy battle broke out in an instant.</p><br/><p>Quiyote was the first to attack. To get a taste of his opponent, Quiyote first attacked a Skeleton Warrior with a basic attack. The Skeleton Warrior dodged Quiyote’s attack easily.</p><br/><p>‘They were this good?’</p><br/><p>He knew how well Hyrkan’s Skeleton Warriors fought from his videos.</p><br/><p>However, he was certain it was a result of expert editing and directing. With the right editing and directing, even an average player could look like experts.</p><br/><p>After clashing with one personally, Quiyote realized he was wrong. The Skeleton Warrior’s movements were much quicker and refined than he had expected.</p><br/><p>It was thanks to Hyrkan’s training.</p><br/><p>As Hyrkan put all points from leveling up into strength, his Skeleton Warriors had long grown accustomed to such attacks. There was no way they would be hit by Quiyote’s basic attacks.</p><br/><p>In fact, they even counterattacked from time to time.</p><br/><p>Clang!</p><br/><p>The sound of the Skeleton Warrior’s mace hitting Quiyote’s armor rang out to the surrounding.</p><br/><p>After being struck, Quiyote stepped backwards. Without chasing him, the Skeleton Warriors maintained their positions. Seeing the Skeleton Warriors actions, Quiyote lightly touched the left hip where he was just struck by the mace.</p><br/><p>There was no physical damage. If he was injured with just that much, there would have been no point in spending so much money to buy the White Mamba set.</p><br/><p>However, the mental damage was there.</p><br/><p>‘This skeleton.’</p><br/><p>Quiyote wanted to fight slowly and attacked to get a feel for his opponent. What answered him was humiliation.</p><br/><p>‘Fine.’</p><br/><p>Quiyote threw away his plan for a slow fight.</p><br/><p>‘I’ll end this quick!’</p><br/><p>It was in an instant.</p><br/><p>In a situation where both sides had kept their distance of about 3 meters…</p><br/><p>“Charge!”</p><br/><p>Quiyote used his skill, Charge. He kicked the ground as he launched himself forward like a missile.</p><br/><p>The distance between him and the Skeleton Warrior closed in an instant.</p><br/><p>“Booster!”</p><br/><p>Then, Quiyote followed up with a sword slash.</p><br/><p>Charge and Booster.</p><br/><p>It was the swordsman class players’ 18th combo. When this combo hit, its target would be defeated ten out of ten times.</p><br/><p>It was the same for the Skeleton Warrior. Although it tried to dodge its opponent’s sudden attack by swaying its body backwards…</p><br/><p>Crack!</p><br/><p>Quiyote’s sword reached the Skeleton Warrior first and cut his body. Although it avoided being split in half thanks to Bone Armor, it couldn’t prevent its body from being pushed back like a puppet that has its strings cut. The Skeleton Warrior disappeared.</p><br/><p>In other words, the obstacle between Hyrkan and Quiyote was now gone.</p><br/><p>‘This is it!’</p><br/><p>Quiyote didn’t stop. With his Charge skill ready, he ran towards Hyrkan with full force.</p><br/><p>Booster was off cooldown as well. If he could close the distance, it would be impossible for Hyrkan to dodge his sword. He could either get hit or block it. Regardless of which, the damage Hyrkan would take wouldn’t be small.</p><br/><p>Quiyote activated his skill, and Hyrkan responded to Quiyote’s confident charge in a strange manner.</p><br/><p>‘Huh?’</p><br/><p>He lied face down on the ground.</p><br/><p>‘What?’</p><br/><p>Quiyote couldn’t help but be taken aback seeing Hyrkan disappear from his line of sight.</p><br/><p>What made him even more flustered was…</p><br/><p>Smack!</p><br/><p>That he tripped on Hyrkan’s body and fell down.</p><br/><p>Watching this from afar, Quiyote’s friends couldn’t help but frown.</p><br/><p>‘No way.’</p><br/><p>‘He stopped the Charge like that?’</p><br/><p>The Charge skill made its user unable to control his body during the duration.</p><br/><p>Because of it, accidents sometimes happened while using the Charge skill. In forests, players sometimes ran into trees. In caves, players sometimes ran into the wall. If one typed Charge Fails on YouTube, there were many funny videos to see.</p><br/><p>However, dodging the Charge skill by lying face down on the ground was… for lack of a better word, absurd.</p><br/><p>But its effect was clear. After falling down, Quiyote rolled on the ground like a wheel. It would have been better to just fall and stop.</p><br/><p>‘Kuu!’</p><br/><p>As he rolled on the ground, so did the world around him. As a result, he felt slightly dizzy.</p><br/><p>When Quiyote stopped and staggered himself up.</p><br/><p>“Careful!”</p><br/><p>The shout of his friends entered his ears. Quiyote turned towards the direction of the sound.</p><br/><p>At that instant, Hyrkan stabbed his sword through the gap between Quiyote’s helmet and armor.</p><br/><p>Crack!</p><br/><p>Like threading a string through a needle-hole, Hyrkan’s sword dug through the smallest gap.</p><br/><p>Thanks to the chainmail covering his skin, Quiyote was able to stop the sword from penetrating his neck.</p><br/><p>However, the power of an all-strength necromancer wasn’t something an inner-armor like a chainmail could block perfectly.</p><br/><p>Hyrkan’s sword pierced through the chainmail and damaged Quiyote.</p><br/><p>It only went in about a finger deep. It wasn’t a fatal blow at all.</p><br/><p>However…</p><br/><p>[You have fallen under the Slow Curse.]</p><br/><p>[You have fallen under the Demon Curse.]</p><br/><p>Curses affected Quiyote.</p><br/><p>‘Shit!’</p><br/><p>Realizing what had happened, Quiyote immediately tried to use his skill.</p><br/><p>‘I need to use Shout…’</p><br/><p>Level 60 swordsman skill, Shout!</p><br/><p>It cleared the user’s debuffs depending on his level and the skill’s skill rank. Although the cooldown time was long, it was a useful skill to use in an emergency situations.</p><br/><p>It was easy to use as well.</p><br/><p>Haaat!</p><br/><p>He just had to shout clearly.</p><br/><p>“Uuu…”</p><br/><p>Quiyote wanted to shout…</p><br/><p>‘Hm?’</p><br/><p>But when he tried, the sky suddenly entered his eyes. His body was dropping backwards.</p><br/><p>Hyrkan. Immediately after he stabbed with his sword, he tackled Quiyote’s body and threw him backwards. It didn’t take longer than a second for him to make his next move. To Quiyote who was on the receiving end, it felt like he was fighting against two Hyrkans. One who stabbed him and the other who tackled him.</p><br/><p>Thud!</p><br/><p>“Huk!”</p><br/><p>What came out of his mouth wasn’t a shout, but a sound of surprise.</p><br/><p>The sword remained stabbed.</p><br/><p>Then, Hyrkan sprinkled dirt between the gaps in Quiyote’s helmet.</p><br/><p>‘What?’</p><br/><p>Those who had experienced PKs knew what it was like to have a sword trying to pierce one’s eyes. But what about dirt? Surprisingly, not many had such an experience. Monsters, especially, never did such things.</p><br/><p>Lack of experience led to panic, and it gave the opponent a chance.</p><br/><p>2 seconds.</p><br/><p>Hyrkan didn’t waste the 2 seconds his opponent gave him.</p><br/><p>Kwak!</p><br/><p>Hyrkan stepped on Quiyote’s chest to ensure he wouldn’t get up easily. Then he pulled out the sword stuck on his neck and stabbed down again.</p><br/><p>Stab, stab!</p><br/><p>Every time Hyrkan stabbed with his sword, it went in deeper. If it went on for longer, Hyrkan’s sword would go through Quiyote’s neck and touch the ground.</p><br/><p>‘T-This is dangerous!’</p><br/><p>With his life at risk, Quiyote struggled to live. He tossed and turned roughly. After throwing off Hyrkan’s foot from his chest, he rolled to the side with all the strength he could muster.</p><br/><p>After barely getting away from Hyrkan’s grasp, Quiyote got up as quickly as he could.</p><br/><p>“Hey! Behind you!”</p><br/><p>His friends once again warned him. However, just like before, it was a little bit too late.</p><br/><p>Clang!</p><br/><p>Before Quiyote could even turn around and look, a mace struck him on the back. Like a ringing of a bell, a metallic ringing sounded as a Skeleton Warrior missing its left arm and half of its body swung its mace.</p><br/><p>Quiyote staggered once again.</p><br/><p>‘Shit, what’s…’</p><br/><p>He was in a daze. He didn’t have the time to process what was happening. Even so, he narrowly opened his eyes to look for Hyrkan. That much showed that he was quite experienced in fighting.</p><br/><p>However, his opponent was just better.</p><br/><p>‘Where is he?’</p><br/><p>Hyrkan had disappeared from his sight. He had, since long, gone into Quiyote’s blind spot. To avoid his line of sight, Hyrkan had lowered his body as he approached Quiyote.</p><br/><p>Then, he tackled Quiyote again.</p><br/><p>Thud!</p><br/><p>Quiyote fell backwards. Then, Hyrkan once again…</p><br/><p>Pat!</p><br/><p>Threw dirt in his helmet. It was a much greater amount than before. Quiyote’s sight turned dark.</p><br/><p>‘FUCK!’</p><br/><p>Dejavu. No, it wasn’t a dejavu.</p><br/><p>Clang!</p><br/><p>This time, a Skeleton Warrior was there as well. The Skeleton Warrior happily smashed its mace down on Quiyote’s helmet.</p><br/><p>Clang!</p><br/><p>Every time the mace hit Quiyote’s helmet, the dirt inside the helmet swirled around it.</p><br/><p>If there was hell, this would surely be it.</p><br/><p>‘This is absurd!’</p><br/><p>In the end, Quiyote couldn’t help but shout out.</p><br/><p>“I, I surrender!”</p><br/><p>With Quiyote’s surrender, Hyrkan snapped his fingers once. The Skeleton Warrior stopped. The tension died down, and a sense of emptiness came down on Quiyote.</p><br/><p>In this sense of emptiness…</p><br/><p>“Leave the 5,000 gold and your watch.”</p><br/><p>Hyrkan threw out a few words.</p><br/><p>Quiyote. This was his first conversation with Hyrkan.</p><br/><p></p></div><br/>\n</div>"}