{"title": "Chapter 55 : Maoongs Test (2).", "id": 55, "volume": 1, "url": "http://boxnovel.org/emperor-of-solo-play-chapter-55-maoongs-test-2", "volume_title": "Volume 1", "body": "<h1>Chapter 55 : Maoongs Test (2).</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 55 : Maoong’s Test (2).</strong></p><div class=\"innerContent fr-view\" id=\"chapterContent\"><br/><p></p><p style=\"text-align: center\"><span style=\"\"> <strong>­ Maoong’s Test (2) </strong></span></p><br/><p>Warlord’s main scenario quests were like stepping stones. Once one stepped on one, there was bound to be a next one. It was just that it was hard to bridge the gap between the two stones.</p><br/><p>As such, the most important thing in main scenario quests was to step on the first stone. If this came too late, the whole quest progression would be slowed. It was obvious, since a slow start could only mean a late finish.</p><br/><p>“Hyrkan, I thank you for the peace and stability you have helped us obtain. It is because of this that I entrust you with this mission.”</p><br/><p>Thus, the first step Hyrkan just made was incomparable to anything else.</p><br/><p>“Since I started working as Bulkas Mountain Range’s Ranger, I’ve fought with monsters countless times to complete the mission given to me. Recently, there has been a rise in number of monsters that know how to use weapons.”</p><br/><p>Maoong.</p><br/><p>His well-groomed beard coupled with his large build made him look like Santa Claus to Hyrkan.</p><br/><p>With no way of knowing what Hyrkan was thinking, Maoong continued on with his serious speech.</p><br/><p>“Unless those monsters suddenly grew talent for making weapons, they must have gotten them from somewhere. While we were looking into the cause of it, we discovered a suspicious place. I would like you to investigate this place.”</p><br/><p>“I don’t understand. Won’t the Bulkas Rangers be better suited than me for such a task?”</p><br/><p>“There’s a reason behind it. Of course, I don’t want to force you to do anything. You are our, the Bulkas Rangers’ friend, not my subordinate. The choice is yours. How about it?”</p><br/><p>When Hyrkan heard what he wanted to hear from Maoong, he didn’t say no. </p><br/><p>“I’ve always seen the Bulkas Rangers in respect and I’ve always been thankful of them for their effort in keeping everyone safe. If you are entrusting me with a task, I would of course accept it,” </p><br/><p>[The quest, ‘Maoong’s Test’, begins.]</p><br/><p>‘It’s finally here.’</p><br/><p>Hyrkan yelled in delight. Just to himself of course. He didn’t have any intention of making the same mistake as he did with Ahimbree.</p><br/><p>Maoong took something out from his sleeve and handed it over to Hyrkan. Hyrkan carefully accepted it, as Maoong immediately told him what it was.</p><br/><p>“It’s a map.”</p><br/><p>What he received was a map of the Bulkas Mountain Range drawn on a piece of leather.</p><br/><p>‘Oh yeah!’</p><br/><p>To Hyrkan, it was no different than a treasure map.</p><br/><p>★★★</p><br/><p>[Maoong’s Test]</p><br/><p>– Quest Rank: Unique</p><br/><p>– Required level: None</p><br/><p>– Quest content: Bulkas Ranger’s captain, Maoong, has given you this mission. This mission is a test to prove your ability.</p><br/><p>– Quest reward: From Maoong’s collection.</p><br/><p>A Unique-rank quest.</p><br/><p>‘This is 100% the real thing.’</p><br/><p>It was a sure tell sign that it was a main scenario quest. As soon as he saw the rank, he nodded his head. To an extent, he was certain that Maoong’s Test was the starting point of the main scenario quest. When he saw the quest rank, his 99% confidence level turned into 100%.</p><br/><p>Then, Hyrkan’s eyes naturally fell to the word ‘collection.’</p><br/><p>‘Collection… what could it be?’</p><br/><p>He knew how the Immoral Prince quest would work out. Even so, there was no way for him to know every little detail of each quest. Even if he knew the big rewards, he didn’t have the brain power necessary to remember every single quest reward along the quest line.</p><br/><p>Of course, he knew it wouldn’t be anything small. For example, there was no way a Unique rank quest would just give 100 gold as reward.</p><br/><p>‘If it’s a Chronicle Unique, I’ll fly to Japan and get some Wagyu beef. Mark my words.’</p><br/><p>Chronicle Unique would be more than what he could ask for.</p><br/><p>No matter what it was, Hyrkan probably wouldn’t be disappointed.</p><br/><p>‘Even if it isn’t, there’s no problem. Just killing the Bear Warrior should give me about a thousand gold.’</p><br/><p>Bear Warrior.</p><br/><p>Although it wasn’t anywhere on the quest content Maoong gave him, Hyrkan knew it would be the monster he had to kill.</p><br/><p>Its level was 80.</p><br/><p>It was 4 meters tall, rather small compared to what one might imagine. It walked on its two hind legs instead of on fours. In fact, it was even equipped with armor and helmet, and held a sword and shield on each of its hands.</p><br/><p>It even had special battle abilities similar to a swordsman’s Charge and Shout.</p><br/><p>‘Let’s see. I’ll get at least two Bear Warrior set items from it…’</p><br/><p>As hard to kill as it was, the reward it gave was definite. Boss monsters dropped more items than normal. What was worth the most was the Bear Warrior set, a level 70 Rare rank item set. Its options were quite good. Moreover, killing a single Bear Warrior guaranteed enough crafting jewels to craft at least one Rare item. If one was lucky, he would get enough to make 3.</p><br/><p>‘I know this won’t happen, but if it doesn’t drop any crafting jewels like that piece of shit monkey, I’m going to sue Tobot Soft.’</p><br/><p>Plus, its bones, skins, and weapon fragments were used to make Normal rank level 70 items. This also gave quite a bit of money. At this point, a level 70 Normal rank item would go for at least 100 gold. Although the Bear Warrior didn’t drop as many coins since it was a mid-small sized monster, it still dropped enough to make 10 items.</p><br/><p>Of course, the real deal was the raid video.</p><br/><p>A Bear Warrior hunting guide had not yet been made. Bear Warrior wasn’t a boss monster that one could randomly run into in the field. It was a monster that required the Bulkas Ranger quest progression to meet. The first video of any boss raid practically had 1,000,000 views guaranteed, even for a no-name. For someone like Hyrkan who was already well-known, it could become his new most viewed video.</p><br/><p>All in all, Hyrkan would not have to worry about losing out by killing the Bear Warrior.</p><br/><p>As long as he could succeed in killing it, he wouldn’t have to worry about money.</p><br/><p>On the other hand, if he failed to kill it, it would have a big impact on Hyrkan.</p><br/><p>‘As long as I don’t make any mistakes, there’s no way I’ll fail.’</p><br/><p>Hyrkan made a bitter smile.</p><br/><p>‘Though, I’m not sure how well not making any mistakes would go.’</p><br/><p>★★★</p><br/><p>While Hyrkan was on his way after leaving the Bulkas Ranger Village, he noticed them.</p><br/><p>‘Just my luck.’</p><br/><p>There were hyenas on his trail. They weren’t there from the start. They had started following him sometime after he left the village. Once they caught sight of Hyrkan, they began to stealthily follow him.</p><br/><p>‘I’m not wearing my hahoe mask, yet they’re following me… they don’t look like they know who I am though.’</p><br/><p>There was no way they knew who he was. Currently, Hyrkan wasn’t wearing his Skeleton Snake set and hahoe mask, but a run-of-the-mill magician robe.</p><br/><p>It was a disguise.</p><br/><p>The fact that Hahoe Mask Hyrkan was currently active in the Bulkas Mountain Range was a fact anyone could learn by just googling ‘Hyrkan’ and ‘Bulkas.’ It was Hyrkan who uploaded the hunting guide on Bulkas Mountain Range’s Sword Monkeys after all.</p><br/><p>Hyrkan wasn’t an idiot, and there was no way he wouldn’t disguise himself unless the situation called for it. Although he had been treated as a pushover because of it on several occasions, it was better than being targeted after being known as the Hahoe Mask Hyrkan.</p><br/><p>In any case, the fact that they were chasing him meant they were after a player walking about alone in the Bulkas Mountain Range. It wasn’t the first time Hyrkan was in such a situation.</p><br/><p>‘What should I do?’</p><br/><p>If it was any time else, he would only make a move after the other side made their move first. However, he was currently on an extremely important quest.</p><br/><p>It was different from the usual circumstance.</p><br/><p>As such, it was time to do things a bit differently.</p><br/><p>‘I need to take care of them somehow.’</p><br/><p>No matter what, he had no intention of going to the Bear Warrior’s place with his tail still being bitten.</p><br/><p>Hyrkan first turned and headed off to another direction. He began to move so it was hard for his pursuers to follow him, and he purposely passed by monsters to make it difficult for them to stealthily chase after him. Because of it, they came out of hiding and began to openly chase after him. </p><br/><p>When they made their appearance, Hyrkan stopped, and his pursuers then stopped as well.</p><br/><p>“I don’t think we’ve met before. Do you need something?”</p><br/><p>Hyrkan was the first to talk. However, no one gave him a reply. All three people staring at him maintained their silence. Meanwhile, Hyrkan examined them carefully.</p><br/><p>‘Three swordsmen. Average items and classic style weapons. They don’t seem to be anything special.’</p><br/><p>After coming to his conclusion, he asked again.</p><br/><p>“If our destination is the same, you guys can go on ahead. No need to gain suspicion by being all sneaky.”</p><br/><p>At Hyrkan’s words, they still did not respond. They only talked quietly among themselves. </p><br/><p>‘What should we do?’</p><br/><p>‘What should we say?’</p><br/><p>Because of the silent surrounding, Hyrkan could faintly hear what they were talking about, and he couldn’t help but smile.</p><br/><p>‘They’re complete amateurs.’</p><br/><p>Here, Hyrkan made his move.</p><br/><p>“Warlord sure is full of trash. Don’t they have anything better to do with their money? Why don’t they use that money to donate to a political campaign or something? If they have so much to spare, just use it to wipe your dirty asses.”</p><br/><p>Although he was only talking to himself, each word was spoken loud and clear.</p><br/><p>It was a provocation.</p><br/><p>And their reaction…</p><br/><p>“What? What did you just say?”</p><br/><p>“We were just going to let wait and see, but you’re asking for it.”</p><br/><p>“Ha. Looks like you don’t know who we are. I’ll rip that mouth right out of you.”</p><br/><p>Was exactly what Hyrkan wanted.</p><br/><p>‘Heh, it’s been a while since I’ve gotten a reaction like this.’</p><br/><p>The moment Hyrkan saw their reaction, he could be 100% certain of one thing.</p><br/><p>They weren’t from a proper guild or party affiliation. Even the Top 30 Guilds didn’t hesitate to tail someone and take whatever information they had. In fact, they were quite good at it. Because they were, they knew how to deal with situations like these. They either ran, negotiated, or killed. In any case, they knew exactly what to do.</p><br/><p>One thing they didn’t do… was being provoked so easily and say something like ‘do you know who my father is?’ Those who did would quickly be abandoned by their guild.</p><br/><p>That could only mean they were from a mediocre guild.</p><br/><p>‘Since they’re here, they probably aren’t complete trash. They should at least have played for a long time.’ </p><br/><p>Hyrkan didn’t need to think for long. Since they were from a mediocre guild, there was nothing to worry about.</p><br/><p>Especially when he was facing idiots who were so quickly provoked.</p><br/><p>“I don’t want to know who you are, but considering that’s all you can say in a 3 on 1 situation, you must know you’re a bunch of losers. Ah, let me ask you one thing. You didn’t forget to wear your adult diapers before logging in, right?”</p><br/><p>“What?”</p><br/><p>“What do you mean, ‘what’? I’m saying you’re going to end up shitting yourselves in fear by the time I’m done with you. You better brace yourselves for when you log out.”</p><br/><p>He just had to provoke them a little more.</p><br/><p>‘Was it too childish?’</p><br/><p>With a pretty laughable provocation, Hyrkan began to fiddle with his watch. In an instant, he was prepared to change his items. </p><br/><p>‘… on second thought, the diaper thing was probably too much. They can’t be that stupid to fall for something so childish…’</p><br/><p>Of course, Hyrkan was pleasantly proven wrong.</p><br/><p>“Fuck it, let’s just kill him.” </p><br/><p>“You don’t know what he’s got up in his sleeve though.”</p><br/><p>“Who cares? It looks like he was avoiding us for a while anyways. Let’s just kill him.”</p><br/><p>After a bit of whispering among themselves, they introduced themselves. </p><br/><p>“You fucker, you’ll pay for messing with the Apollo Guild!”</p><br/><p>Apollo Guild!</p><br/><p>The moment Hyrkan heard those two words, he reflexively charged at them like a 100-meter dash runner.</p><br/><p>“Slot On!”</p><br/><p>It wasn’t until a bit later that Hyrkan began to reminisce about the Apollo Guild.</p><br/><p></p></div><br/>\n</div>"}