{"title": "Chapter 61 : Dungeon Map (3).", "id": 61, "volume": 1, "url": "http://boxnovel.org/emperor-of-solo-play-chapter-61-dungeon-map-3", "volume_title": "Volume 1", "body": "<h1>Chapter 61 : Dungeon Map (3).</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 61 : Dungeon Map (3).</strong></p><div class=\"innerContent fr-view\" id=\"chapterContent\"><br/><p></p><p style=\"text-align: center\"><span style=\"\"> <strong>­ Dungeon Map (3) </strong></span></p><br/><p>“A fully armed bear fighting on its hind legs like a warrior… something is definitely happening here in the Bulkas Mountain Range.”</p><br/><p>As Hyrkan told Maoong everything he could about the Bear Warrior, Maoong had a grim expression. When Maoong stopped talking, the air was filled with a serious and somber atmosphere. And as if to match such an atmosphere, Hyrkan also kept a stern expression.</p><br/><p>Of course, his thinking was completely different on the inside.</p><br/><p>‘Come on, let’s get this over with.’</p><br/><p>The fact that the Stormhunter Guild had arrived at the Bulkas Mountain Range made Hyrkan restless. He was no longer happy to keep up with Maoong taking his sweet time.</p><br/><p>Unfortunately for Hyrkan, Maoong had no way of knowing what Hyrkan was thinking. He was faithful to his role. </p><br/><p>“Thank you.”</p><br/><p>He started with an expression of gratitude. </p><br/><p>“If it weren’t for you, it would have been hard to avoid a casualty. We also learned a valuable piece of information thanks to you.”</p><br/><p>“Please. I’m just happy I could be of help.” </p><br/><p>Hyrkan replied immediately.</p><br/><p>“Thank you, really.”</p><br/><p>“No, no.”</p><br/><p>Hyrkan couldn’t help but make a sour face. </p><br/><p>‘Hurry…’</p><br/><p>Then, as if Hyrkan’s prayers had been heard, Maoong got up from his seat. After heading to one of the bookshelves that were lined up against the wall, he carefully took out a book. Although its cover didn’t look any different than the others, its inside was filled with folded papers.</p><br/><p>‘Eh?’</p><br/><p>The voice inside Hyrkan’s head urging him on disappeared like snow on heated asphalt.</p><br/><p>‘Don’t tell me…’</p><br/><p>Hyrkan’s expectation began to grow, as Maoong placed the folded papers on his desk for Hyrkan to see.</p><br/><p>“These are maps I’ve gathered during my time here at the Bulkas Mountain Range.”</p><br/><p>Maps!</p><br/><p>Upon hearing this word, Hyrkan let out a shout inwardly.</p><br/><p>‘Yes! Dungeon maps!’</p><br/><p>Dungeon map. </p><br/><p>As one might expect, it was a map showing the location of a dungeon. In Warlord, dungeon maps were no different than treasure maps.</p><br/><p>Another name for them was…</p><br/><p>‘Maoong, you’re collecting some good stuff here!’</p><br/><p>Certified checks.</p><br/><p>That was the worth of a dungeon map. A dungeon from a dungeon map guaranteed at least 1 title and a Rare rank item. Dungeons also gave much higher EXP than field hunting grounds, and videos of them were highly anticipated as well. If lucky, one could find hidden quests, and most importantly, the chance of leaving a dungeon with a valuable skill-book was immensely high. Most skill-books that were Rare rank and above came from dungeons.</p><br/><p>‘They say life is full of ups and downs. With what I just went through, this makes me feel so good!’ </p><br/><p>Hyrkan was back to being extremely happy.</p><br/><p>‘Looks like it’s really going to be beef tonight.’ </p><br/><p>Hyrkan began to immediately think about his dinner. Maoong then continued.</p><br/><p>“Considering their value, I’ve kept them with me, but since I cannot leave the Bulkas Mountain Range, it is a waste to just let them be.”</p><br/><p>“I agree.”</p><br/><p>“Although it might not be enough of a reward, take one you want.” </p><br/><p>“Thank you.”</p><br/><p>Hyrkan wasn’t disappointed by this in any way. </p><br/><p>‘It doesn’t matter which one I choose.’</p><br/><p>He didn’t brood over which one to choose. He simply picked the middle one, from the five maps in front of him. </p><br/><p>‘It’ll be 10,000 gold at the very least…’ </p><br/><p>With a 10,000,000 won check in hand, Hyrkan could feel his heart racing.</p><br/><p>“I’ll choose this one.”</p><br/><p>Hyrkan picked a map. Maoong then continued as if he had been waiting for Hyrkan to make his decision.</p><br/><p>“I have one more favor to ask of you.” </p><br/><p>Hyrkan observed Maoong’s actions carefully, and noticed that he had left the maps on the desk.</p><br/><p>‘Oh?’</p><br/><p>He immediately understood why Maoong had taken out several maps.</p><br/><p>‘He’s going to give me another one for a favor?’</p><br/><p>It looked like Maoong wanted to make a trade with Hyrkan.</p><br/><p>Hyrkan was more than happy to comply. For the sake of the main scenario quest, if he had to, he would have done Maoong’s favors for free. But since Maoong was giving out such good rewards, Maoong seemed like an angel to Hyrkan.</p><br/><p>“I will be more than happy to do you a favor, sir.”</p><br/><p>“Beyond the Bulkas Mountain Range, there is a place called the Parung Forest. Do you know of it?”</p><br/><p>Parung Forest.</p><br/><p>Hyrkan couldn’t help but frown for a moment.</p><br/><p>“No, I don’t.”</p><br/><p>“I have received reports of armed monsters, like the Bear Warrior you fought. I’d like to ask you to investigate that place, and if you find anything suspicious, I’d like you to do a closer examination. Although it might not be enough, I will reward you the best I can.” </p><br/><p>Maoong then tapped on his desk twice. At the place his fingers tapped were his dungeon maps. </p><br/><p>Hyrkan could only nod in response.</p><br/><p>“I will head to Parung Forest.”</p><br/><p>[The quest, ‘Maoong’s Request’, begins.]</p><br/><p>“I give you my sincere gratitude.”</p><br/><p>It was a quest he couldn’t refuse. </p><br/><p>But hearing the destination, Hyrkan could feel a slight headache coming over him.</p><br/><p>‘Parung Forest… of all the troublesome places…’</p><br/><p>Parung Forest was a place filled with monsters above level 90. It wasn’t somewhere Hyrkan could go at his current state. Not to mention, although he had fragmentary information on Parung Forest, he himself had never hunted there. Warlord was just too vast for Hyrkan to remember everything.</p><br/><p>‘Whew.’</p><br/><p>However, it wasn’t outside of his scope of expectation. In the first place, it was a miracle that a level 60 player like Hyrkan could have passed Maoong’s Test. It was a quest designed for players above level 80, and Hyrkan beat such a quest at level 60. By himself no less! It was only obvious that future quests would grow in difficulty. Hyrkan had already expected that he would need to stop to level up. </p><br/><p>It was just he felt more pressured with pursuers right behind him.</p><br/><p>‘Looks like I’ll need to focus on leveling up.’</p><br/><p>★★★</p><br/><p>After leaving the Bulkas Ranger Village, Hyrkan examined the dungeon map he had obtained. The content of the map would make one ask if it was done by a child. There was barely anything on it, and because only a small area could be seen, it was impossible for an unknowing person to figure out where it was.</p><br/><p>There was only one clue. The two characters ‘Su’ and ‘Ra’ written in the corner.</p><br/><p>‘Is it the Sura Canyon?’</p><br/><p>Sura Canyon.</p><br/><p>It was the home of the level 80 monsters, Devil Goats. The Sura Canyon was a long and winding ravine. Hidden within the grass and trees inside were a peculiar species of goats that liked jumped out the canyon’s cliffs as if they were grass plains. </p><br/><p>‘It’s not so bad.’</p><br/><p>For Hyrkan, it wasn’t an unfavorable place.</p><br/><p>In fact, the Sura Canyon was a fine hunting ground. Although the place was filled with Devil Goats, they themselves liked to move about alone. Their combat strength was lower than most level 80 monster, and they gave average amount of EXP. The hunting ground difficulty was below average, but the experience it gave was average. Paired together, it was a great hunting ground for Hyrkan to reach level 70. </p><br/><p>The problem was that what was good for Hyrkan was good for others as well.</p><br/><p>‘Didn’t the Red Bulls occupy that area recently?’</p><br/><p>A week ago, the Red Bulls Guild discovered the Sura Canyon and occupied the area. </p><br/><p>In Warlord, declaring a monopoly or occupancy held a political significance. Declaring a monopoly meant that no one was able to enter a designated area without permission. Declaring occupancy meant that those who entered a designated area had to abide by certain rules. Those that failed to comply were, of course, killed. </p><br/><p>In most cases, people acknowledged declaration of monopoly and occupancy for some time. </p><br/><p>In this case, since it was an occupancy declaration, there would be no problem as long as Hyrkan followed the Red Bulls’ rules.</p><br/><p>‘The guys from Red Bulls aren’t so bad… but I’m slightly bothered that they allied themselves with the Stormhunters.’</p><br/><p>Hyrkan was concerned by the fact that it was the Red Bulls who occupied the area.</p><br/><p>Of course, Hyrkan didn’t have too much of a choice. Rather than hunting elsewhere and going to Sura Canyon’s dungeon, it was much more efficient to hunt in Sura Canyon and go to the dungeon. </p><br/><p>At this point, even a single day was worth a lot.</p><br/><p>Without even stopping for a breath, Hyrkan ran in the direction of Sura Canyon.</p><br/><p>★★★</p><br/><p>“So this is the Bulkas Mountain Range.”</p><br/><p>“The clue to the main scenario quest is here, eh?”</p><br/><p>Ten days after the sighting of Ballista Hatch and Storm Princess Hahui in the Bulkas Ranger Village, the Bulkas Mountain Range had become the hottest place in Warlord. Players of all levels and guilds of all sizes came to look for the treasure that was sure to be in the Bulkas Mountain Range.</p><br/><p>Fans of Warlord also began to see the Bulkas Mountain Range with great interest.</p><br/><p>It was the same for Romany. Due to the nature of his occupation, he couldn’t help but have great interest in the Bulkas Mountain Range. Because of this, he couldn’t help but tremble at what he currently had in his hands.</p><br/><p>“Whew.”</p><br/><p>‘It took a full week.’</p><br/><p>He had spent a full week to work on a single video. It didn’t mean it had taken a long time. After all, one week couldn’t be considered long in movie production.</p><br/><p>‘To think I made this with just one week…’</p><br/><p>The reason he was trembling was he was amazed by what he accomplished in just a week.</p><br/><p>‘I see why kids like to make baking powder volcanoes for fun.’</p><br/><p>Thinking about the kind of impact his video would have, Romany trembled once again.</p><br/><p>To calm himself down, Romany took a sip of hot cocoa. </p><br/><p>However…</p><br/><p>‘This is a real bomb. If the videos so far had been grenades, this one is a bomb strong enough to knock down a few buildings. Not to mention, with the current timing….’ </p><br/><p>Romany’s hands couldn’t stop shaking. Seeing his continued trembling, Romany smiled.</p><br/><p>‘This is it.’</p><br/><p>The knowledge that a piece of art he made could shake the world. How many times would he be able to experience such a feeling in his lifetime? As a creator, Romany couldn’t help but be happy.</p><br/><p>‘This is what I wanted to make!’ </p><br/><p>Just like that, Romany sent the bomb in his hand to his client.</p><br/><p>★★★</p><br/><p>“Yes, the work-out has been canceled. Yes, it was sudden.”</p><br/><p>Choi Sulyeon’s secretary, Park Suji.</p><br/><p>The Choi Sulyeon she knew was someone that all women… no, all human being would be envious of. Not only was she born with everything, she furthermore had the ability to put them to use by 120 percent.</p><br/><p>‘This is the first time she’s acted this way.’</p><br/><p>One of her greatest strengths was her ability to create a solid schedule and follow it. Especially when it came to working out, eating, sleeping, or other standard activities, she kept to her schedule without failure. Unless there was a natural disaster happening, she kept to her eating schedule, work-out schedule, and sleep schedule at all times.</p><br/><p>But for the first time, she ignored her schedules. </p><br/><p>‘This is the first time she ate in her room. Not to mention, she canceled her work-out plans.’</p><br/><p>This was the first time Park Suji had seen her act this way since she started serving her. </p><br/><p>As such, Park Suji couldn’t help but wonder.</p><br/><p>‘What happened?’</p><br/><p>While Park Suji was contemplating the different possibilities, Choi Sulyeon was watching a video in her room.</p><br/><p>Not even a day had passed since the video came out, yet the views were in 6 digits. The first digit was a 6, even. By this time tomorrow, the numbers would undoubtedly be at 7 digits league. </p><br/><p>Watching the video, Choi Sulyeon’s expression was stiff. She didn’t even wipe the salad dressing on the corner of her mouth, as she watched the 11-minute video on a loop. A scene of someone soloing a never-before-seen boss monster. She engraved each and every one of his movements in her brain. </p><br/><p>It wasn’t until she had watched the video 6 full times that she finally pulled her eyes away. Over an hour had passed since she started watching, and Choi Sulyeon murmured softly.</p><br/><p>“… no matter what, I’m going to make him mine.”</p><br/><p></p></div><br/>\n</div>"}