{"title": "Chapter 78 Golem Upgrade (2).", "id": 78, "volume": 1, "url": "http://boxnovel.org/emperor-of-solo-play-chapter-78-golem-upgrade-2", "volume_title": "Volume 1", "body": "<h1>Chapter 78 Golem Upgrade (2).</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 78 Golem Upgrade (2).</strong></p><div class=\"innerContent fr-view\" id=\"chapterContent\"><br/><p>Chapter 78 - Golem Upgrade (2)</p><br/><p>3.</p><br/><p>“Shit!”</p><br/><p>One of the users tripped on a rock and fell.</p><br/><p>Kwahhhng!</p><br/><p>The large wolf that was chasing after the user ate almost half his body in one bite.</p><br/><p>‘He’s dead.’</p><br/><p>‘I'm sorry, Polio.’</p><br/><p>The users didn't stay to see the frightening sight of their buddy get eaten. They didn't even glance back. They didn't even think about helping him, since it gave them extra time. They ran away with all their might.</p><br/><p>They had used their party member as a sacrificial lamb, and it worked. They no longer heard the breathing or footstep of the wolf. When they reached a location where there was no trace of the wolf, the three party members finally stopped to look back. They were finally able to talk after checking nothing was behind them.</p><br/><p>“Shit.”</p><br/><p>The same word yelled out by the devoured party member came out of their mouths.</p><br/><p>“Even running away isn't easy.”</p><br/><p>“Everything is messed up now.”</p><br/><p>“Right. When the Hahoe Mask killed most of the priests, there was no point in hunting in parties.”</p><br/><p>It had been 88 hours since the Battlefield had been opened.</p><br/><p>Significant amount of time had passed in the Battlefield, and the appearance of the users wasn't something that wasn't befitting the name of the Battlefield. A continuous battle between the monsters and users never took place. There was no breathless battle. The result was a one sided fight. The normal result wasn't the monsters becoming the sacrificial lamb instead it was the users.</p><br/><p>The reason was of course Hyrkan.</p><br/><p>The Hahoe Mask left after dispatching Cho-oohroong, and seven monsters suddenly showed up in his wake. A significant number of users died once again in this battle against the monsters.</p><br/><p>The parties couldn't even communicate with each other amidst such a condition. They just scattered every which way. Of course, they didn't ally with each other anymore. If someone took it upon themselves to make it happen, an alliance could have been formed once again.</p><br/><p>However, everyone remembered the fate of Cho-oohroong who had stepped up to take the lead. They had seen the seen the process live. The image of what happened to him wouldn't fade away from their thoughts.</p><br/><p>So the parties started hunting by themselves. Each party put an acceptable amount of distance between each other. They each secured a region and started to hunt. Under the silent truce, the parties did what most parties did in the Battlefield.</p><br/><p>The problem was most of the parties weren't at their most optimum state. There were parties who had lost a priest, a tanker, or a striker... If one made an analogy, they were like mouths. Some had lost their front tooth, and some had lost their molar. They couldn’t chew the monsters properly with a mouth missing teeth.</p><br/><p>The Battlefield was so full of monsters that monsters came looking for users. The users tried to avoid the repeated monster battles, but in the end, all the parties chose to give up.</p><br/><p>“The castle gate will open soon. Let's go to the castle gate now. We can logout there, and we can log back in when it's time.”</p><br/><p>“Yes. We'll find users in the same situation if we go near the castle gate. Maybe, we'll come to an agreement there to work together.”</p><br/><p>“I never thought I would waste my time this way.”</p><br/><p>“We were fortunate that we didn't die this time.”</p><br/><p>If they overextended themselves in the monster hunt, they would be wiped out. It was better to go to the castle gates to wait while they still had a somewhat intact party. This was the course taken by users, who had some breathing room. They would log out near the castle gates for safety. Those who had lost a lot of their party members had a hard time even getting to the castle gate.</p><br/><p>Of course, this wasn't the case for everyone.</p><br/><p>Only one person!</p><br/><p>One person's fortune was completely different from the others.</p><br/><p>[You have leveled up.]</p><br/><p>“All right. My Stats are full! That damn wolf bastard! I'll catch it with myself!”</p><br/><p>This one person was overflowing with energy amongst the overflowing horde of monsters. It didn't matter if he was doing well or bad in his hunt, he was enjoying himself.</p><br/><p>This one person…… Of course, it was Hyrkan.</p><br/><p>Large Wolves, Large Bears, Large Snakes…… The beasts possessed blood colored patterns on their pelt, and they were crowding in front of Hyrkan. Hyrkan threw 3 Bone Explosives as if he was spraying sand.</p><br/><p>Kwah-gwah-gwahng!</p><br/><p>The expensive Bone Explosives were worth the price of ramens Hyrkan could eat for a month. It was a powerful sight to see the result of the explosions.</p><br/><p>While this thunderous roar was ongoing, two Skeleton Warriors wearing Bone Armor and the Madness Helm immediately ran forward. Each of them had weapons that was easily over 1000 gold, and the battle capability of these Skeleton Warriors were amazing. Their sword cut through the leather of lvl 80 monsters like paper.</p><br/><p>Pooh-oohk, suh-guhk, ssoo-oohk!</p><br/><p>The sound of stabbing, slicing, and chopping was heard. After the roar of the Bone Explosives, the sound of butchery was heard.</p><br/><p>Koo-huhng!</p><br/><p>The cry of the monsters that followed was closer to a sorrowful sound than a menacing sound. The sight that unfolded in that place was one-sided and overwhelming. It made one feel sorry for the monsters.</p><br/><p>Of course, the ones in the worst shape was those who were caught by Hyrkan.</p><br/><p>After leveling up, Hyrkan had recovered all his capabilities. Hyrkan charged towards a wolf who had scratched his body.</p><br/><p>‘I'll fuck you up.’</p><br/><p>When he closed the distance, Hyrkan stabbed the short sword into the bastard's eye. In a breath, he jumped on top of the red spotted wolf's body. As soon as he got on the body, he stabbed down with his Fang Sword.</p><br/><p>He used the embedded sword as a handle and started attacking the wolf's body with another short sword.</p><br/><p>Pook pook. Pook, pook!</p><br/><p>After he finished stabbing the body four times, a rectangle shaped piece of flesh fell off. When the piece of flesh was dug out, he immediately put something that was hotter than medicine into the wound.</p><br/><p>Bone Explosive!</p><br/><p>Hyrkan forcefully pushed the powerful item into the hole. Soon, he used all his energy to cause the Bone Explosive to detonate.</p><br/><p>Kwahng!</p><br/><p>The sound of the exploding Bone Explosive was the quietest one yet, but the result was quite gruesome.</p><br/><p>Hoo-doo-doo!</p><br/><p>The explosion scattered the blood and flesh into the surrounding. It left behind a grotesque mark.</p><br/><p>Koo-roo-roo…….</p><br/><p>The wolf was starting to falter. The wolf wasn’t able to resist after suffering under the White Mamba's poison and the accrued damage. He couldn't even struggle. Hyrkan didn't show any mercy to the wolf. Since this bastard's life was almost at an end, Hyrkan wanted to end it faster and in a more sure manner.</p><br/><p>Poohk poohk!</p><br/><p>After the terrifying sound rang out consecutive times, the wolf died. After extracting his sword, Hyrkan immediately searched for a new monster. He found one that the Skeleton Warriors were having a hard time taking down.</p><br/><p>There was a smile on Hyrkan's face as he moved his body.</p><br/><p>‘All the monsters here are mine!’</p><br/><p>The other parties either died before they could fight the monsters properly, or they had given up. Hyrkan didn't know this for sure but he had predicted events would happen this way.</p><br/><p>He had predicted this course of event when he hatched the trap to get rid of the priests with the help of the Mongmart Party.</p><br/><p>How could a party go on a normal hunt without their priests?</p><br/><p>This was why he had done what he had done. This was why he had left alone the users who had shown their teeth to him. It was the reason why he had accepted Cho-oohroong's request for a 1on1 battle. Even if Hyrkan didn't act, he knew they would have to retire once their priests had been eliminated.</p><br/><p>No competitors meant the most valuable monsters belonged to Hyrkan.</p><br/><p>‘The only one left is the Blue Giant’</p><br/><p>“Ooh-haha!”</p><br/><p>Hyrkan unconsciously let out a laugh as if he was too happy. His laugh rang out through the Battlefield.</p><br/><p>4.</p><br/><p>Kooh-oohng!</p><br/><p>It had blue skin. It's skin color was incongruous with the color of the forest. The giant had a single eye, and it was fallen to the floor like a stiff board of wood. When the giant fell, its body crushed 5 trees, transforming them into balled-up tissue paper.</p><br/><p>There were seven swords sticking out of the fallen Blue Giant's body. A Golem with half its body crushed was nearby, and one of its shoulder was slumping without any strength.</p><br/><p>“Hoo-ooh.”</p><br/><p>Blue Giant.</p><br/><p>He was finally able to take the bastard down. However, Hyrkan didn't let out a cheer in joy. He let out a long sigh.</p><br/><p>‘I was barely able to catch it. If I made a wrong move, I might have died.’</p><br/><p>It wasn't too hard to find the Blue Giant. It was taller than the trees of the forest, and its skin color was blue. It also had a sense of presence that made it easy to find. He just had to climb up a tree and look around to find it.</p><br/><p>The hard part was killing it.</p><br/><p>‘Its offensive and defensive ability was subpar, but its HP.... It was really comparable to a Level 100 Boss Monster.’</p><br/><p>It was worthy to be called an Event Monster. Its HP was abnormally high. Since it had so much HP, Hyrkan had to use a lot of time to catch it. He had used up 28 minutes. Hyrkan's damage dealing was incredible. He had the Skeleton Warriors, Skeleton Mages, and the Golem. If he mixed in some curse magic, he could deal damage that was comparable to a 5 man party. Once he started to liberally use the Bone Explosives, his damage dealing couldn't even be compared to a 5 man team.</p><br/><p>This was why Hyrkan was able to end this fight around the 30 minute mark.</p><br/><p>‘Is this what they call it a blessing in disguise?’</p><br/><p>He had been able to catch this monster, because of the current situation.</p><br/><p>If he had to catch it in an environment with a lot of competitors, he wouldn't have been able to take it down easily. Moreover, it would have been impossible to catch it in secret. He would have been constantly interfered with. He would have had to adopt a hit &amp; run strategy, and this might have opened up the possibility of someone else stealing the monster.</p><br/><p>In the end, if Cho-oohroong didn't aggressively chase after Hyrkan, this opportunity would have never come to Hyrkan.</p><br/><p>‘So why the hell is Cho-oohroong trying so hard to catch me? Did I somehow meddle with Big Smile?’</p><br/><p>That was the part where he still had his misgivings.</p><br/><p>He didn't think Cho-oohroong simply moved against him because he coveted Hyrkan's fame. Hyrkan didn't think Cho-oohroong would move for such a personal reason. The Big Smile wasn't an organization that was loose with their members.</p><br/><p>This meant someone in Big Smile had order Cho-oohroong to eliminate Hyrkan. This was hard to comprehend even for him. Hyrkan hadn't crossed Big Smile yet. Not at this point in time.</p><br/><p>‘No. Moreover, the Big Smile shouldn't have time for me right now.’</p><br/><p>The Big Smile wasn't in a position where they would be able to spare their attention to Hyrkan. Currently, they were in war with Triple Wing, and they were a troublesome group to deal with. If they bothered Hyrkan in such a situation, they were basically adding on to their troubles.</p><br/><p>‘Any ways, the 30 great guilds only have assholes.’</p><br/><p>It was clear from Hyrkan's perspective. They had attacked him out of the blue. Hyrkan had quickly evaded the attack and sent back a counterpunch. He was able to earn a watch, but it didn't mean he would forgive Big Smile. It was the opposite.</p><br/><p>‘Let's see what happens when you come into my crosshair, Big Smile. I'll shatter you guys into pieces.’</p><br/><p>Hyrkan put Big Smile right below the Stormhunters on his list. It was obvious, but it wasn’t a good place to be if you were ranked under the Stormhunters.</p><br/><p>Hyrkan was brooding over his revenge list when it happened.</p><br/><p>[The Battlefield's Even Monster 'Blue Giant' has fallen.]</p><br/><p>Everyone within the Battlefield was given the announcement. Hyrkan also heard the announcement.</p><br/><p>When he heard the announcement, he touched the app on his wrist watch.</p><br/><p>[138 : 33 : 22]</p><br/><p>Hyrkan smiled when he saw the time.</p><br/><p>‘If I come back after a nap, it'll be perfect.’</p><br/><p>It was almost time for him to leave the stage called the Battlefield.</p><br/><p>4.</p><br/><p>- I'm sorry.</p><br/><p>When he heard Cho-oohroong's answer, Heh-bibin didn't spit out his boiling anger. He spoke in a calm manner.</p><br/><p>“Today's events will be a bitter medicine for you. Don't forget about today's event, and go reflect on what you did wrong.”</p><br/><p>- I will take your words to heart.</p><br/><p>“You did well. Go rest for awhile..”</p><br/><p>- I'm sorry.</p><br/><p>When the phone call ended, Heh-bibin clenched both of his hands into fists. If he had his handphone in his hand, he would have thrown it against the wall. Fortunately, he was within the game so he couldn't do that.</p><br/><p>‘Fuck.’</p><br/><p>Heh-bibin answered calmly, because he valued Cho-oohroong. If it had been someone other than Cho-oohroong, he wouldn't have let it go so easily.</p><br/><p>Heh-bibin had taken a big hit from this job. The immediate monetary damage wasn't that high.</p><br/><p>‘Apollo. That bastard knows about this.’</p><br/><p>The problem was Apollo. He was very underhanded, and he wouldn't let go of this information easily.</p><br/><p>‘He'll try to use me through blackmail.’</p><br/><p>Heh-bibin was an officer of the Big Smile, and it was an opportunity where Apollo would be able to put him to the fire.</p><br/><p>Since he didn't want Hahoe Mask to realize Cho-oohroong was part of Big Smile, he would have to accept whatever deal Apollo presented. This was a headache inducing situation.</p><br/><p>The worst case scenario was the Hahoe Mask finding out the connection between Cho-oohroong and Big Smile. If he joined forces with their enemy, Triple Wing, then this wouldn't end at just hurt feelings.</p><br/><p>Big Smile might be kicked out of their spot in the 30 great guild.</p><br/><p>‘Shit.’</p><br/><p>Heh-bibin's heart burned into a black crisp when he thought about such a scenario.</p><br/><p>It seemed someone wanted to burn Heh-bibin's heart once again.</p><br/><p>“Shit.”</p><br/><p>A single call arrived. After checking the call was from Apollo, he gritted his teeth before he answered the phone. While he was gritting his teeth, he let the anger within his heart bleed out.</p><br/><p>‘Hahoe Mask. You will pay for this.’</p><br/><p></p></div><br/>\n</div>"}