{"title": "Chapter 72 Secret Society (2).", "id": 72, "volume": 1, "url": "http://boxnovel.org/emperor-of-solo-play-chapter-72-secret-society-2", "volume_title": "Volume 1", "body": "<h1>Chapter 72 Secret Society (2).</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 72 Secret Society (2).</strong></p><div class=\"innerContent fr-view\" id=\"chapterContent\"><br/><p>Chapter 72 - Secret Society (2)</p><br/><p>4.</p><br/><p>‘It's finally here.’</p><br/><p>When he arrived at the Bulkas Range's village, Hyrkan was thankful this was only a game.</p><br/><p>‘I ran for the whole day. Shit.’</p><br/><p>If this wasn't a game, Hyrkan would have been drenched in sweat. He would be on the floor trying to catch his breath.</p><br/><p>‘Why doesn't Warlord have something like a Warp gate? It would be quite convenient if they made something like that.’</p><br/><p>He complained for a brief moment, but afterwards, Hyrkan was thankful for the stylish leather armor he was wearing.</p><br/><p>‘Fortunately, I was lucky enough to have purchased the Shadow Dog set. If not, I would have ended the game in anger.’</p><br/><p>After he defeated the Helm Ogre in the Parung Forest, he gathered all the ingredients for coins. Then Hyrkan immediately moved towards the castle closest to the Parung Forest. Even at his top speed, the closest castle was about a half day away. It was very far away.</p><br/><p>However, he had no choice. He couldn't sell the miscellaneous ingredient coins he obtained from the Helm Ogre at a reduced price. It was impossible for him to carry these items around, and a storage where he could deposit the items were only available at a castle.</p><br/><p>After he visited the castle, he immediately ran towards the Bulkas Range's village.</p><br/><p>He wanted to finish his quest before his exploits spread.</p><br/><p>‘I've worked hard like a dog, so shouldn’t it be coming out soon? Is it going to give me another test?’</p><br/><p>He had to find the Maeung to complete the quest.</p><br/><p>Hyrkan's thoughts drifted towards the Maeung. His thoughts once again recalled the flow of the Main Scenario Quest.</p><br/><p>‘The Society should be coming out soon…….’</p><br/><p>One would become a member of the Secret Society through the Maeung. The most important part of this was to proceed on the story of the Immoral Prince.</p><br/><p>‘I really want to put on the Society Ring really soon....’</p><br/><p>Moreover, the benefits he would earn as a member of the Secret Society was enormous.</p><br/><p>‘Yes. The Society Ring is on the line, so I have to be patient. Patience. Patience is winning.”</p><br/><p>Hyrkan pulled himself together and he soon met the Maeung. He told the Maeung about the Helm Ogre, and the Maeung put on a very serious expression when he heard Hyrkan's story.</p><br/><p>“Unfortunately, it seems my prediction has come to pass.”</p><br/><p>The Maeung was sincere and he had a heavy atmosphere around him.</p><br/><p>Hyrkan didn't unnecessarily pour cold water on such an atmosphere. Instead, he played up that atmosphere.</p><br/><p>“What are you saying? Do you perhaps know the identity of these monsters?”</p><br/><p>“Mmmm.”</p><br/><p>The Maeung swallowed what he was about to say at Hyrkan's question.</p><br/><p>1 second, 2 second, 3 second…… As he was watched the Maeung hesitate, Hyrkan kept cursing inside.</p><br/><p>Finally, the Maeung opened his mouth.</p><br/><p>“If it's you…… I'll be able to trust you.”</p><br/><p>Maeung's Trust.</p><br/><p>This was what he earned the this Quest. It allowed the Maeung speak out from his heart.</p><br/><p>“From a certain point in time, the number of monsters in the world increased exponentially. The appearance of the Subjugation Association gave us some breathing room. However, a power appeared recently, and it can topple the balance we achieved.”</p><br/><p>“I know about it. I also... I've also chased after the power of Corruption before.”</p><br/><p>Hyrkan wanted to speed up the conversation, so he tried to lead the conversation.</p><br/><p>“Mmmm. Any ways, the power of Corruption allowed the monsters to become strong. On the other hand, I found out there was another ability that comes with the power.”</p><br/><p>Even though Hyrkan tried to lead the conversation, the Maeung ignored Hyrkan's words. Hyrkan couldn't help, but smirk inside at the Maeung. Moreover, Hyrkan was already well aware of the other ability that came with the power of Corruption.</p><br/><p>‘He's going to say it is the power to control the monsters.’</p><br/><p>“It is the power to control the monsters.”</p><br/><p>“Ah.”</p><br/><p>Hyrkan acted as if he was surprised. As if he was satisfied with Hyrkan's response, the Maeung continued to speak.</p><br/><p>“The monsters exposed to the power of Corruption doesn't act according to their instincts. They move with forethought as if they are carrying out orders. This means someone is controlling these monsters. In truth, the Corrupt Count also used the power of Corruption to control the monsters, and he used them as underlings.”</p><br/><p>“However, isn't the Corrupt Count dead?”</p><br/><p>“Yes. The Corrupt Count died at the hands of heroes.”</p><br/><p>Heroes!</p><br/><p>Hyrkan grumbled inside when he heard those words.</p><br/><p>'Heroes? Bullshit. Those bastards make unreasonable demands when things don't go their way.’</p><br/><p>Hyrkan swallowed his dissatisfaction that was about to burst forward.</p><br/><p>“However, is the Corrupt Count the only person able to use the Power of Corruption? Moreover, the Corrupt Count is dead, so why does the monsters with power Corruption continue to show up?”</p><br/><p>The Maeung's speech was finally reaching the end. The light within Hyrkan's eyes was slowly changing.</p><br/><p>‘Uh. The story is proceeding faster than I expected?’</p><br/><p>“That means there is someone else behind this.”</p><br/><p>Hyrkan had a different look in his eyes. He quickly said the right words to enthusiastically agree with the Maeung.</p><br/><p>“That person must be an extraordinary person. I won't even dare to tell you who it is. I have my suspicions but I cannot speak about it in this place right now. However, it is someone with authority. There is a high possibility that the person is a lord or a noble. Perhaps the Corrupt Count was just this person's lackey.”</p><br/><p>“It really is a frightening thought. A person akin to the Corrupt Count still exists on this world. Moreover, if it is someone, who could order around the Corrupt Count as an underling...”</p><br/><p>“It is rather a big problem. The death of the Corrupt Count would embed a sense of caution in that group. The next time they show themselves it would be after they finished getting ready to battle the world.”</p><br/><p>As the Maeung spoke, he opened a drawer.</p><br/><p>‘Is it coming? Is it really coming out right now? Really?’</p><br/><p>Hyrkan swallowed his saliva as he looked on.</p><br/><p>“I'm telling you all of this since you have the courage and ability to be able to share a common cause with me. Moreover, you have a noble mind. You would lay down your life for the world.”</p><br/><p>The Maeung praised Hyrkan. It was a very high praise. However, not a single word of the Maeung entered Hyrkan's ears.</p><br/><p>‘Ah!’</p><br/><p>The Maeung had taken out a ring from the drawer. Hyrkan's thoughts turned blank when he caught sight of the ring.</p><br/><p>‘Finally!’</p><br/><p>This was the item. He had always wanted this item, but he could never possess it. That item had shown up in front of his eyes.</p><br/><p>“Please help me save the world from the immoral people who are using the power of Corruption.”</p><br/><p>‘Finally, the Society Ring will be in my possession.’</p><br/><p>Hyrkan didn't worry about it. He was like a machine. He answered the Maeung without even thinking about it.</p><br/><p>“Yes! Give me any task!”</p><br/><p>At that moment, a notice popped up.</p><br/><p>[You've earned the 'Secret Society' title.]</p><br/><p>The title had appeared.</p><br/><p>‘All right! The Society Title!’</p><br/><p>This was what he had been waiting for.</p><br/><p>Also, this wasn't the end.</p><br/><p>“Thank you for accepting such an unreasonable request. However, I would like to introduce you to someone. After crossing the Parung Forest, you will reach the Great Urugal mountain range after you travel a little bit more. When you reach the entrance of the mountains, you will find a blacksmith by the name of Olf. Go find him. If you show him the ring, he won’t kill you at the very least.”</p><br/><p>[ Quest ‘Blacksmith Olf’ is starting.]</p><br/><p>A Quest had appeared.</p><br/><p>Hyrkan frowned a little bit when he heard the quest. He knew the names of Blacksmith Olf and the Great Urugal mountain range.</p><br/><p>The Great Urugal mountain range bisected the world. Moreover, no one had been able to cross it as of yet. The Ruined Kingdom existed across this mountain range.</p><br/><p>‘Aren't all the basic monsters that come out over there over level 100?’</p><br/><p>Currently, it was a land of death for any users in Warlord right now. It was a place where only the very top rankers could eliminate the monsters, and they would be able to survive only if they put survival as the highest priority.</p><br/><p>‘Uh-whew. It makes me want to barf just thinking about it.’</p><br/><p>It wouldn't be strange if one died, while traveling to that place.</p><br/><p>Blacksmith Olf was a very famous NPC in this game. He was only a select few NPC that was able to make Epic Items. He was an Ahimbree Rank NPC.</p><br/><p>In many ways, it wasn't a person a level 80 user could approached.</p><br/><p>‘If I die on the road, I would be dying a dog's death.’</p><br/><p>Hyrkan was worried.</p><br/><p>However, his worry melted away when he saw the very plain golden ring given to him by the Maeung.</p><br/><p>“This ring is a pledge. Anyone, who has this token, shares the same cause as us. We don't have a name. We just call ourselves the Secret Society.”</p><br/><p>Secret Society's Ring.</p><br/><p>It was now in Hyrkan's possession.</p><br/><p>5.</p><br/><p>Halfway up the Bulkas mountain.</p><br/><p>A user wearing a hood was using a tree stump as chair, and he was looking at something.</p><br/><p>[Secret Society]</p><br/><p>Title Effect : Every Stat is increased by 3%.</p><br/><p>The user's identity was Hyrkan.</p><br/><p>After receiving 3 presents from the Maeung, Hyrkan soon arrived at the Ranger Village. He did this, because he had pursuers following him. As he had expected, several users followed after him when he came out of the Maeung's house. He was moving to lose them and, in the end, he had arrived at this location.</p><br/><p>It was annoying, but it was the price of becoming famous. This was a problem he would have to overcome as he progressed in the future.</p><br/><p>On the other hand, there was a positive outcome that came out of this. As he was losing his tail, he was able to cool his red-hot head. He had suddenly been put in this situation, therefore he was able to organize his gains.</p><br/><p>‘Ok. This makes it 9%.’</p><br/><p>The Secret Society title he had earned this time was a percentage title. If he combined it with the Ahimbree's Disciple, and the Rising Star title he got before, then all of his Stats would increase by 9%.</p><br/><p>‘There isn't much content to the Quest.’</p><br/><p>On top of it all, the explanation regarding the Quest was quite simple. It told him to go to the entrance of the Urugal mountain range, and he was to meet Olf there. There was no reward to the quest. It simply said to go meet him.</p><br/><p>The important thing wasn't the quest. Instead, it was the gold ring equipped on Hyrkan's hand. Hyrkan manipulated the time, and he put up the option for the ring on a hologram window.</p><br/><p>[Proof of the Secret Society]</p><br/><p>*Main Properties</p><br/><p>- Unique Rank Item</p><br/><p>- All Stat +77</p><br/><p>- Required Level : Level 70 and up</p><br/><p>- Required Condition : Title ‘Secret Society’</p><br/><p>*Sub-Properties</p><br/><p>- Stamina and Magic Power recovers 20% faster.</p><br/><p>- When one has the title 'Pursuer of Corruption’, the stat related to profession +22</p><br/><p>- This item belongs to the wearer.</p><br/><p>*Miscellaneous</p><br/><p>- It is a token of the Secret Society, who chases after the power of Corruption. The great blacksmith devoted his heart and soul to make this ring. He used gold that was eaten and thrown up by a dragon as ingredient. It carries an enormous power.</p><br/><p>It felt as if his eyes would pop out just from looking at the options. The options to the ring were quite spectacular.</p><br/><p>‘It's in my possession now.’</p><br/><p>Hyrkan laughed.</p><br/><p>He couldn't help but laugh.</p><br/><p>The Proof of the Secret Society!</p><br/><p>If he recalled the memory before he came back to the past, the item's existence and option was revealed by the Hyrdra Guild. The first one to take down the Corrupt Count was the Hydra Guild. They even showed a remarkable pace during the Immoral Prince portion of the quest. They were the first one to acquire the Proof of the Secret Society.</p><br/><p>Moreover, when the option was first revealed, everyone had the same reaction.</p><br/><p>It was a cheat item!</p><br/><p>It was an item that broke the balance!</p><br/><p>Hyrkan also had a similar response.</p><br/><p>He couldn't help it.</p><br/><p>Basically, if one wanted to earn this Item, one needed to have the Pursuer of Corruption title. The Stat relating to the occupation was 99 points, and the rest of the Stats were 77 Points. If he included the Stats that would increase, the total sum was 352 Points. It was an incredible figure.</p><br/><p>However, the real reason why people called this a cheat item was the recovery speed increase option for the Stamina and Magic Power. Buffs that increased recovery speed was in existence, but there were very few items which had that option. If an item such as this was used by a Tanker with a lot of Stamina or a Priest with a lot of Magic Power, they would recover more than they expend.</p><br/><p>It wasn't only them. It was very popular for Strikers or Mages, who were always short on Stamina and Magic Power.</p><br/><p>Also, this was an item that could only be used by the select few. It was possible to earn it during the Immoral Prince's storyline. In the end, only 179 of them would be released. It seemed like a high figure, but if one considered the number of people playing Warlord, it was an extremely small number.</p><br/><p>Hyrkan had always wanted this item, and he thought he would be able to obtain it this time around.</p><br/><p>However, he never expected to get it so fast.</p><br/><p>Hyrkan kept looking at his hand with the ring from various angles. He was like a new bride, who had just received a 10 karat wedding ring.</p><br/><p>The smile wouldn't leave his lips.</p><br/><p>‘It makes me full just by looking at it.’</p><br/><p>It really felt as if his stomach was full just from looking at it. Of course, he wasn't really full in reality.</p><br/><p>Hyrkan checked the time.</p><br/><p>‘It's dinner time.’</p><br/><p>It was time to fill his stomach for real. He checked the surrounding before the log out. Hyrkan immediately started the procedure to log out.</p><br/><p>[The log out countdown will start. 10, 9, 8…….]</p><br/><p>Then the countdown started.</p><br/><p>‘Yes. This is the feeling. Let's eat until my stomach bursts today! The Society Ring came out, so I can celebrate by eating a steak.’</p><br/><p>Hyrkan smiled as he tried to decided whether he wanted to eat a sirloin steak, a beef tenderloin, or a t-bone steak. He started thinking about this happy dilemma.</p><br/><p>6.</p><br/><p>*Bubble, bubble.*</p><br/><p>Ahn-jaehyun had a corpse-like expression as he looked at the boiling ramen, which was emitting a spicy scent.</p><br/><p>“Shit.”</p><br/><p>When the ramen was close to boiling, a bitter sound came out of Ahn-jaehyun's mouth.</p><br/><p>Not too long ago, Ahn-jaehyun decided to splurge big time today. He was going to eat a steak today. He had made enough money to afford it. He earned the ingredient coins including the ones from the Helm Ogre. There was the renewed donations and the youtube ad money coming in. If he combined all his income, he had 2 month worth of living expense. After he paid the monthly Warlord subscription fee, he had just enough to pay for the installments on the newly purchased Level 4 V Gear.</p><br/><p>However, a single notification changed Ahn-jaehyun's dinner menu from a steak to a ramen.</p><br/><p>[A special promotion for those, who purchased the 3rd and 4th level V GEAR! This is a unique chance to upgrade to the 5S Model!]</p><br/><p>He would have to pay an additional thousand dollars every month for the next 2 years. When he received the notification for the order of the 5s Model V Gear, Ahn-jaehyun didn't even worry over his decision.</p><br/><p>‘I have to have this.’</p><br/><p>The level 6 Model was going to be released soon, so he knew this promotion was done to clear the inventory. However, the level 5S Model was much superior for Warlord than the 6S Model. No one knew this fact right now, but Ahn-jaehyun knew the truth. Of course, the 6S Model was the best, but it was a Model that couldn't be purchased by Ahn-jaehyun. In his current situation, the newest model he would be able to purchase was the 5S Model. He would have to increase his monthly payment by 1000 dollars to earn the newest equipment. Ahn-jaehyun would never say no to that.</p><br/><p>Of course, he pulled the trigger.</p><br/><p>The phrase ‘first come, first serve’ didn't allow Ahn-jaehyun to even think about the decision.</p><br/><p>This was obvious, but he now had additional monthly expense. Instead of getting the steak, he had to settle by getting a beef-flavored ramen.</p><br/><p>After he turned off the gas stove, Ahn-jaehyun shook his head from side to side.</p><br/><p>‘What's the point of earning money? Every cent I earn goes right back into the game.’</p><br/><p>He let out a grumble as he raised his chopsticks to swirl the ramen. He saw a small piece of beef inside the ramen. It was the size of a baby's nail. Ahn-jaehyun delicately picked up the little piece of meat.</p><br/><p>It had been a while since Ahn-jaehyun had tasted beef.</p><br/><p></p></div><br/>\n</div>"}