{"title": "Chapter 82 The Baheim Tribe (1) .", "id": 82, "volume": 1, "url": "http://boxnovel.org/emperor-of-solo-play-chapter-82-the-baheim-tribe-1", "volume_title": "Volume 1", "body": "<h1>Chapter 82 The Baheim Tribe (1) .</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 82 The Baheim Tribe (1) .</strong></p><div class=\"innerContent fr-view\" id=\"chapterContent\"><br/><p>Chapter 82 - The Baheim Tribe (1)</p><br/><p>1.</p><br/><p>The enormous Trapper Trees rose high into the sky, and the Tree Bark Snakes wrapped around the tree branches. They possessed an incredible camouflage ability and it was hard to discern them with the naked eye.</p><br/><p>It used its amazing camouflage skill to stay hidden as it stayed wound around a tree branch. It patiently waited for a prey to travel near it. When the prey appeared, it launched itself towards the ground. Its hunting method could be described as being struck by lightning during a clear day.</p><br/><p>Then it happened at this moment.</p><br/><p>Choo-roop!</p><br/><p>The Tree Bark Snake's knothole-like eyes landed on its preys. The tree branch-like tongue flicked out, and its actions was quite bold. When the preys got within range, the Tree Bark Snake loosened its hold on the branch and fell towards the floor.</p><br/><p>Kyahhh!</p><br/><p>Its mouth opened wide, the four poisonous fangs gleaming. The snake’s body was 9 meters long and the presence it gave off was beyond impressive. It was dreadful. Just thinking about it made one's body shudder.</p><br/><p>The two users watched as the dark shadow fell towards them yet they didn't tremble.</p><br/><p>Instead, they had calm expressions on their faces. As they watched the snake fall, they started making calculations. They considered where the snake would land, as well as where they would have to move if they wanted avoid the snake's attack. They also thought about how long these actions would take and what the best method was to counter attack.</p><br/><p>Of course, it was impossible to calculate all of this in one's head. However, through extensive battle experience, they were able to calculate all of this on instinct.</p><br/><p>Sssoook!</p><br/><p>The ferocious pitbull looking man raised his right hand with which he held his sword. He grabbed the sword with both hands.</p><br/><p>Sssoook!</p><br/><p>The one wearing the Hahoe Mask kept walking.</p><br/><p>As the man raised his two-handed sword high over his head, he looked at the falling Tree Bark Snake. There was still a good distance between the two of them. The poisonous fangs would have a hard time reaching the man, and one would need a prayer for the sword to reach the snake.</p><br/><p>At that moment...</p><br/><p>Shweeeee!</p><br/><p>The user swung his two handed sword with great power, and it descended as if it was trying to cut the world in half.</p><br/><p>Choo-oohng!</p><br/><p>The sound of the sword splitting the air could be heard as a blue crescent was sent forth.</p><br/><p>Shah shah shah!</p><br/><p>The crescent flew at high speeds, letting out a terrifying sound.</p><br/><p>This was a Rare Rank Skill that could be learned by fighters over level 120. It was called the Crescent Cut.</p><br/><p>It was basically a Sword Qi. This was a skill that was coveted by the users, who chose the Swordsman Class.</p><br/><p>It was a very powerful Attack Skill. The cutting force and the the attack power was much more powerful than the combined might of two or three Skills used in succession by a pre-advancement Swordsman Class user.</p><br/><p>Moreover, the one who used this skill had a level 120 Unique Weapon equipped, and he was level 131. On the other side, the Tree Bark Snake was only level 105. Also, it had the lowest defense amongst the monsters of similar levels, so its fate was already sealed.</p><br/><p>Pooh-hwaht!</p><br/><p>It looked as if the snake's head was bisected into two. The Crescent Sword Qi started slicing through the head, dissipating after it reached the 1/4 mark of the Snake's body.</p><br/><p>Koohng!</p><br/><p>The Tree Bark Snake with the bisected head fell to the floor as it let out a crude noise. The sliced body was letting out a slightly translucent liquid that looked like tree sap. It was the snake's blood, but there was no metallic smell. It smelled like wet grass.</p><br/><p>Pooh-hwaht, pooh-hwaht!</p><br/><p>The snake wasn't dead yet. It was still moving vigorously, spreading its grass-smelling blood everywhere. The single strike had caused critical damage, but the user didn't stop there. He approached the struggling Tree Bark Snake and slashed down with his sword again. He was cutting off its life instead of its body.</p><br/><p>‘As expected, level is gangster.’</p><br/><p>Hahoe Mask Hyrkan suppressed his bitter laugh as he witnessed the sight.</p><br/><p>It happened at that moment.</p><br/><p>[Your level has risen.]</p><br/><p>Hyrkan's ears heard the clear voice. Hyrkan had just received good news, but he suppressed his bitter laughter.</p><br/><p>‘I never thought in my life that there would come a day I would ride a bus like this.’</p><br/><p>In Hyrkan's head, he thought about his meeting 6 days ago with Whistling.</p><br/><p>2.</p><br/><p>“I've found a Quest Hint regarding the Elven Tribe within the Crapper Jungle. However, it is impossible to do it with my abilities. I'll give you all the information regarding the Quest if you clear the Quest with me. That's my proposal. ”</p><br/><p>Whistling had said his life's dream was to meet the Elves, and he gave Hyrkan the offer he had prepared.</p><br/><p>His proposal was very simple, yet it was one-sided.</p><br/><p>‘Did I hear him wrong?’</p><br/><p>The proposal was too tilted in favor of Hyrkan.</p><br/><p>This was why Hyrkan didn't smile from happiness. Instead, he looked back with suspicious eyes.</p><br/><p>‘Is Whistling trying to position himself so he can fuck me over?’</p><br/><p>If he found a 100 dollar bill on the floor, he would feel happy. However, if someone came up to with a thousand dollar check trying to give it to him, he would call the police to check this person out. Hyrkan was clearly the benefactor of this deal.</p><br/><p>Wasn't this deal basically giving Hyrkan the Quest Info to meet the Elves for free?</p><br/><p>Hyrkan didn't needlessly weigh the merits of the choice inside his head.</p><br/><p>“If you want to give me a Game Over, just PK me here. If you want to fuck me over in a different way or if you are trying to extract information from me, I want you to skip these needless machinations. Just ask me your questions right now so we can get this over with.”</p><br/><p>He couldn't trust Whistling's words!</p><br/><p>Hyrkan expressed what he was truly feeling inside. Whistling's face stiffened and he nodded his head.</p><br/><p>“Are you saying you can't trust me? Is that how it is?”</p><br/><p>“The only thing I can trust in Warlord is this.”</p><br/><p>As he spoke, Hyrkan raised his left hand to show the watch on his wrist. Whistling’s face hardened a little bit more.</p><br/><p>“I also don't trust you, Hahoe Mask. I only suggested this deal because I respect your skill. However, I don't plan on surrendering anything else to you.”</p><br/><p>Hyrkan let out a short breath when he saw this.</p><br/><p>‘Whistling Pit Bull. What kind of a man was he...’</p><br/><p>At that moment, Hyrkan worked his not too good head into overdrive. He tried to recall every memory and information regarding the Whistling Pit Bull. Small anecdotes started popping up in his head.</p><br/><p>Hyrkan knew Whistling had been part of the Fighters guild. He was famous yet there hadn’t been much gossips regarding him. Moreover, his reputation decreased as Warlord became more serviced. The reason being Whistling wasn't playing this game to earn big money. It was only a rumor, but it was said that Whistling didn't feel the need to make money, since he was from a well-off family. He had heard this rumor right before he had his one on one battle with Whistling.</p><br/><p>Hyrkan recalled Kim-dongsoo had told him that story. At the time, he had thought he couldn't lose to someone, who was born with a golden spoon in his mouth.</p><br/><p>‘Yes. Wasn't he a regular member?’</p><br/><p>The deciding factor was that fact that Whistling wasn't an officer of the Fighters guild. He was a regular member, and in the end, he continued to be a regular member. This wasn't because the Fighters guild hated Whistling. Whistling was the one who had kept an appropriate distance from the Fighters guild.</p><br/><p>If one became an officer, one had no choice but to become sensitive to the guild's profit and politics. There were a surprisingly high number of high level users who just wanted to be regular guild members. They just wanted to do the minimum amount of guild related work and they wanted only a limited amount of influence in the guild.</p><br/><p>‘At the very least, I know he isn't hear to catch me at the request of Big Smile or some other 30 great guild.’</p><br/><p>Hyrkan opened his mouth.</p><br/><p>“I'll receive the Quest Info and we can complete the Quest together. Do you want to just give me the Quest Info?”</p><br/><p>“If you need it, I'll help you.”</p><br/><p>“From my perspective, I have no reason to decline your help. Still, you have a reliable guild called the Fighters behind you. Why are you making this deal with me? You'll be able to finish this more easily if you call on the help of the Fighters guild. I'm really curious about that point.”</p><br/><p>Whistling thought about it for a brief moment and he thought Hyrkan's question was reasonable. So he gave his answer.</p><br/><p>“Then my nose will be hooked by the guild. They would ask me to do something of equal value to the Quest Clear.”</p><br/><p>Wasn't it Whistling life long dream to meet the Elves? Then why not play a dating simulation game where an Elf comes out? There were more questions he could have asked. However, Hyrkan didn't question him any further. Didn’t one have to respect other's taste? Whistling was basically taking a loss out of his own volition. There was no reason why Hyrkan should agitate someone who was willing to do that.</p><br/><p>“All right.”</p><br/><p>He put out his hand instead of blathering on. Whistling grabbed his hand.</p><br/><p>3.</p><br/><p>After Whistling shook hands with him, he gave Hyrkan the information about the Quest.</p><br/><p>“First, you have to finish this 5 particular Quests given by the Clapper Jungle branch of the Subjugation Association.”</p><br/><p>The Quest routes Whistling found was convoluted.</p><br/><p>“Then you'll be able to have the qualification to receive a quest from a NPC named Rongju.”</p><br/><p>First, one had to finish 5 particular Quests given by the Subjugation regarding the Clapper Jungle, then one would gain the qualification to receive a quest from an Adventurer NPC named Rongju. He appeared in two day interval within the Trapper Jungle.</p><br/><p>“You have to complete 3 Quests given by Rongju, then you'll be able to talk with a girl NPC who had been saved by Rongju. Her name is Selene.”</p><br/><p>Once one finished the Quests given by Rongju, one will earn the right to talk to Selene. Selene was famous for being the girl of silence.</p><br/><p>“Selene knows about the Elves.”</p><br/><p>Even if one knew the Quest Route, the content of the Quest Route was quite hard. Moreover, if one had to find out the Quest Route without knowing anything prior to it... Hyrkan was genuinely impressed by Whistling.</p><br/><p>‘I thought he was a casual gamer enjoying this game for fun, but he's a madman. If his life's dream is to meet the Elves, couldn't he have played some other game? Why do these insane deeds inside Warlord?’</p><br/><p>Of course, this wasn't something worth admiring.</p><br/><p>Anyways, Whistling helped Hyrkan with his Quest Progress afterwards. The deal was for Hyrkan to receive the same Quest as Whistling. In the process, Whistling obviously had to catch the monsters for Hyrkan.</p><br/><p>Whistling was an expert with level 130 skills, and he possessed a Unique Weapon. The Trapper Jungle was like a playground for him.</p><br/><p>Moreover, Whistling had practically lived inside the Trapper Jungle for the Quest Clear, so he was like a nightmare for these monsters.</p><br/><p>'His body knows all of the monster's pattern. At the very least, he's fought over 1000 monsters of each type here.'</p><br/><p>Whistling was so amazing that Hyrkan had no choice but to acknowledge him.</p><br/><p>‘Even if my Spec and Class was the same as him, Whistling would be better at hunting monsters inside the Trapper Jungle.’</p><br/><p>He was better than Hyrkan.</p><br/><p>No one would acknowledge it, but it basically meant Whistling was one of the best in Warlord.</p><br/><p>'He killed over 1000 useless monsters that was of no help to his level up just to see the Elves. Crazy bastard.'</p><br/><p>The more surprising fact was that Whistling was having a hard time raising a single level even after hunting 6 days within the Trapper Jungle. Even now, if he invested himself entirely to leveling up, his level was high enough where he could become one of highest levels. However, he had given up that goal just because he wanted to see the Elves. Hyrkan had started Warlord later than most people so he couldn’t truly comprehend Whistling's reasoning even if Hyrkan played Warlord his whole life.</p><br/><p>'In any case, there are a lot of strange bastards in this game. It seems the crazy to normal ratio increases as one reaches the higher level. There are too many crazy people.’</p><br/><p>Warlord didn't have any people of sane mind!</p><br/><p>Hyrkan once again felt the full brunt of that truth.</p><br/><p>4.</p><br/><p>“His skin was so clear that it felt as if it was transparent. If he stood below the Trapper Tree, he would look like a fresh foliage because of his skin color! He also had very pointy ears and a beautiful face. If it wasn't for him, I wouldn't be alive right now. I want to relay my thanks to him. Please give him this letter in my stead.”</p><br/><p>[Quest ‘Selene's Letter’ has started.]</p><br/><p>Selene's large eyes and freckled face made the young NPC girl a striking figure. After receiving the Quest, Hyrkan immediately checked the content.</p><br/><p>[Selene's Request]</p><br/><p>- Quest Rank : Rare</p><br/><p>- Quest Level Range : At least 90</p><br/><p>- Quest Content : Deliver Selene's Letter to the Tribe within the Forest. The hints can be heard through Selene.</p><br/><p>- Quest Reward : Biscuit made by Selene's hands.</p><br/><p>After checking the Quest Content, Hyrkan talked to Selene.</p><br/><p>“Could you tell me where I can find him?”</p><br/><p>Selene answered as if she had been waiting for his question.</p><br/><p>“I'm having a hard time remembering it. I was being chased by a Tree Bark Snake, chased into a dead end. I had nowhere to run. At that moment, a Rock Elemental appeared and protected me. Then he shot an arrow through the snake's head. After killing the Tree Bark Snake, he delivered me to Rongju ahjushi.”</p><br/><p>This was all the hint she gave Hyrkan.</p><br/><p>Hyrkan came out of Selene's living quarters. As if he had been waiting for Hyrkan, Whistling approached him.</p><br/><p>“There are only two hints. There's the dead end road and the Rock Elemental.”</p><br/><p>“I just heard it right now, so I'm well aware of it.”</p><br/><p>“When I heard the hint, I looked everywhere that could be described as a dead end road. I looked at every blocked path, cliffs, and even places with big boulders! I searched the Trapper Jungle thoroughly. However, the Event where the Elf shows up never triggered. The Rock Elemental also never appeared. I thought maybe fighting Tree Bark Snakes near a dead end road was the prerequisite to triggering the event. I lured the Tree Bark Snakes to every likely place, yet it didn't trigger the event.”</p><br/><p>Whistling finally told Hyrkan the problem he had been facing.</p><br/><p>Whistling was well aware of the fact. He knew that he would be taking the biggest loss in the deal he proposed to Hyrkan.</p><br/><p>Despite it all, he proposed such a deal because he was plain frustrated.</p><br/><p>“Did I have a choice?”</p><br/><p>Moreover, if the person wasn't the Hahoe Mask, he wouldn't have gone out of his way to suggest such a disadvantageous deal.</p><br/><p>Hyrkan was known for his incredible battle capability, and he had the ability to clear Quests very well. There was even rumors saying that Hyrkan was ahead of the 30 Great Guilds in the Main Scenario Quest. It wasn't an exaggeration to say Hyrkan's ability to clear Quests was peerless.</p><br/><p>From Whistling's perspective, he had lucked out.</p><br/><p>“Then there's a high probability that location is the Baekong Falls.”</p><br/><p>“What?”</p><br/><p>Hyrkan immediately gave an answer. This wasn't hard. Hyrkan already knew where the Baheim Elven Tribe appeared. He just didn't have the qualification to meet them before.</p><br/><p>\"A waterfall? The event is triggered at a dead-end road. Didn't you hear Selene's hint?\"</p><br/><p>Since Whistling didn't know what was going through his head, Hyrkan's answer from left field sounded like wishful thinking.</p><br/><p>Hyrkan lightly laughed as he looked at Whistling. Then he answered Whistling.</p><br/><p>\"This place isn't reality. It's a game. Users like us are supermen who could climb a 100 meter cliff with bare hands. A dead-end road for users of our caliber should be something like a waterfall. Don't you think so?\"</p><br/><p>In reality, a 2 meter wall was called a dead end. When a 20 meter wall shows up in Warlord, users didn't even think about jumping it. They would think about whether they should break through the wall using their fists or head. This was how users thought in Warlord.</p><br/><p>“That's…….”</p><br/><p>Of course, they were talking about a native of Warlord, so they couldn't use real world standards here.</p><br/><p>This was the reason why Whistling hadn't been able to find the answer.</p><br/><p>“After level 200, if someone mentions a dead-end road, one should be prepared to jump over lava.”</p><br/><p>“Is the Baekong Falls really the event location?\"</p><br/><p>Whistling repeated the question to Hyrkan. Hyrkan responded to Whistling with these words.</p><br/><p>“Then do you want to make a bet? I'll put 100 gold on the line that the Baekong Falls is the correct location.”</p><br/><p>“Mmm…… All right.”</p><br/><p>Hyrkan laughed happily at his answer.</p><br/><p></p></div><br/>\n</div>"}