{"title": "Chapter 83 The Baheim Tribe (2).", "id": 83, "volume": 1, "url": "http://boxnovel.org/emperor-of-solo-play-chapter-83-the-baheim-tribe-2", "volume_title": "Volume 1", "body": "<h1>Chapter 83 The Baheim Tribe (2).</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 83 The Baheim Tribe (2).</strong></p><div class=\"innerContent fr-view\" id=\"chapterContent\"><br/><p>Chapter 83 - The Baheim Tribe (2)</p><br/><p>5.</p><br/><p>It was a winding and endless road. When they followed upstream of a river ending at a lake, they arrived at a cliff. The river was falling off the cliff and the sound of the water falling was deafening. It was letting out a violent scream.</p><br/><p>The two users arrived at the location where the river was letting an endless scream. Hyrkan and Whistling faced each other.</p><br/><p>Hyrkan opened his mouth to speak. Whistling also opened his mouth to answer back. However, their voices had no chance against the sound of the waterfall.</p><br/><p>Hyrkan shook his head as he closed his mouth, then tapped lightly on his wrist watch. Whistling also closed his mouth when he saw this. He nodded his head.</p><br/><p>The two of them started touching their wrist watch.</p><br/><p>“The sound of the waterfall is immensely wonderful.”</p><br/><p>“Is this place the Baekong Falls?”</p><br/><p>The conversation between the two finally started.</p><br/><p>“We have to pray that we are at the right place or else we would have come here for nothing. Anyways, prepare to give me your 100 gold. You can't back out later on.”</p><br/><p>“If I could really meet an Elf in a place like this, I would give you 100 gold. No, I would even give you 1000 gold.”</p><br/><p>“Wait a moment. Let me record those words.”</p><br/><p>With the incredible sight behind as their background, the two of them held a conversation that didn't have much substance to it. Since it was a trivial conversation, the conversation quickly came to an end. The thick mist of water started to tickle their faces.</p><br/><p>‘It really is a dead end.’</p><br/><p>The Baekong Falls had a semi-circular shape. Moreover, the stage perfectly fit the description of a dead-end road.</p><br/><p>Hyrkan and Whistling stood in front of the dead-end, both of them looking speechlessly at the waterfall.</p><br/><p>“So do we wait for the Elf to come?”</p><br/><p>Whistling was the first one to break the silence.</p><br/><p>Instead of answering him, Hyrkan took out the 5 Bone Fragments from his pocket. He spread it across the floor. Whistling knew what Hyrkan's action meant. Whistling's expression changed as he quickly looked towards the back.</p><br/><p>One had to slightly tilt one's head back against the falling waters to see them. Whistling saw 4 enormous Hook Praying Mantises, as well as 5 Tree Bark Snakes that looked like moving logs.</p><br/><p>These bastards were so large that they would make a lot of sound if they started moving. However, the sound of the waterfall had drowned out the sound of the monsters. This was why Hyrkan and Whistling hadn't been able to sense them.</p><br/><p>It was as simple as that. They hadn't been aware of monsters’ presence.</p><br/><p>“Bone Armor.”</p><br/><p>Hyrkan's summoned Skeleton Warriors were equipped with armor. Gloves, chest armors, greaves and even shoulder armors were put on!</p><br/><p>The white armor made it look as if the Skeleton Warriors had swollen in size. At the same time, a horn appeared on the Skeleton Warrior's head.</p><br/><p>After putting on the Madness Helm, the Skeleton Warriors opened their mouth wide and aggressively expressed their violent nature. As if it was answering the call of the Madness of the Skeleton Warriors, the swords grasped by the Skeleton Warriors let out a blue light.</p><br/><p>Hyrkan gave the attack order.</p><br/><p>The Skeleton Warriors immediately split in five directions, and they charge without reserve towards the monsters.</p><br/><p>During all of this, Hyrkan had taken out a gem from his pouch. The gem in his hand was used to summon the Golem. The gem within Hyrkan's hand melted, and it dripped onto the floor.</p><br/><p>Koo koo koo!</p><br/><p>A muscular, one-eyed giant with a hammer appeared out of the uneven ground.</p><br/><p>Cyclops.</p><br/><p>Cyclops had a very ferocious nature, and the Golem had inherited its nature. It no longer had its dull appearance. The Golem immediately charged towards the monsters.</p><br/><p>Koong, koong, koong!</p><br/><p>The 6 meter tall giant made out of dirt caused the ground to ring out as it moved.</p><br/><p>Hoo-oohng, kwahng!</p><br/><p>The giant swung down with its hammer, and it created a crater. A part of the Tree Bark Snake's body was hit with the hammer, and it flattened like a sheet of paper.</p><br/><p>Kyahhhh!</p><br/><p>Of course, the monsters responded by counterattacking.</p><br/><p>Five Skeletons, one Golem, and nine monsters became tangled with each other, creating a mess.</p><br/><p>It was only then did Hyrkan and Whistling move. The bedlam was their playground.</p><br/><p>The Hook Praying Mantis swung tirelessly as it tried to catch the Skeleton Warriors. Hyrkan climbed the Mantis' body. Hyrkan stabbed at a location where the exoskeleton was thin.</p><br/><p>Whistling put an appropriate distance between him and the monsters. He performed his Crescent Cut to chop the monsters into pieces.</p><br/><p>The 9 monsters were down to below half of its numbers before 3 minutes were up.</p><br/><p>In a flash, there were only two left.</p><br/><p>‘Let's see which one I... Ah!’</p><br/><p>At that moment, Hyrkan let out a yell.</p><br/><p>“Leave one of them alone!”</p><br/><p>The moment Hyrkan's words ended Whistling swung his sword to take off the head of the Hook Praying Mantis.</p><br/><p>“What?”</p><br/><p>Hyrkan immediately answered Whistling's question.</p><br/><p>“We have to re-enact the situation.”</p><br/><p>Hyrkan flicked his finger as he spoke. The Skeleton Warriors, who had been moving in an agile manner, immediately lowered into their defensive stance. They shifted into defense mode. The last surviving Tree Bark Snake lashed out with its tail like a whip. The tail strike hit a Skeleton Warrior, and it was flung away as its body disintegrated.</p><br/><p>Hyrkan twisted one corner of his mouth as he watched his Magic decrease.</p><br/><p>‘Chet.’</p><br/><p>It put him in a foul mood, but he had no choice.</p><br/><p>NPC Selene said an Elf saved her when she was in trouble. Then they would have to recreate a similar scenario.</p><br/><p>“All right.”</p><br/><p>Whistling understood what Hyrkan was talking about, so he put away his sword into its sheathe.</p><br/><p>All of Hyrkan's summoned underlings went into being Fragments, or the Golem returned to the earth.</p><br/><p>The chaos lessened and Tree Bark Snake was alone by itself. It continued its wild movements.</p><br/><p>Hyrkan and Whistling took turns to avoid its attack.</p><br/><p>However, this continued on for a while.</p><br/><p>‘It's already been about 3 minutes.’</p><br/><p>A not too short amount of time had flowed by, but they didn't see any signs of change. Hyrkan looked at his surrounding, and he started feeling a bit anxious.</p><br/><p>‘It has to come out.’</p><br/><p>There was a reason why Hyrkan was feeling anxious.</p><br/><p>‘A thousand gold is on the line. The Elves have to come out!’</p><br/><p>It was a trivial reason.</p><br/><p>It was at that moment.</p><br/><p>Kyahh!</p><br/><p>The Tree Bark Snake let out a coarse sound, and its tail whipped against Whistling. When Hyrkan saw this, he involuntarily winced.</p><br/><p>‘Why?’</p><br/><p>Whistling was the Trapper Jungle's greatest gosu. It was a fact that Hyrkan had acknowledged. His battle ability was better than Hyrkan inside the Trapper Jungle. Yet he suffered an attack from a simple tail strike from a Tree Bark Snake? It seemed almost impossible.</p><br/><p>However, it happened. Whistling suffered an attack from the tail attack!</p><br/><p>‘Ah.’</p><br/><p>He baited the attack.</p><br/><p>He purposely got hit so it would look like he was in trouble. Hyrkan realized his own mistake.</p><br/><p>‘Crazy bastard.’</p><br/><p>Whistling was a Striker Type. This was why he was able to Advance as a Fighter. No matter how good a defensive gear one had on, it was still burdensome to take the full brunt of an attack from a monster.</p><br/><p>Of course, he wouldn't die.</p><br/><p>Still, unless he had a very particular fetish, no human or users liked being hit.</p><br/><p>Fortunately, Whistling's sacrifice paid off.</p><br/><p>Pooh-hooh!</p><br/><p>From beneath the lake located below the waterfall, a Golem made out of enormous boulders appeared.</p><br/><p>The Boulder Golem headed immediately towards the Tree Bark Snake, and an arrow appeared out of nowhere to pierce deeply into the body of the Tree Bark Snake. That arrow was the first of many arrows.</p><br/><p>Kyah, kyah!</p><br/><p>The Tree Bark Snake started to struggle. Hyrkan and Whistling smiled as they looked at the monster.</p><br/><p>‘If I came here alone, I would have never been able to meet the Elven Tribe.’</p><br/><p>Whistling and Hyrkan nodded to each other.</p><br/><p>Then the Elves, who they had been yearning for, appeared in front of them.</p><br/><p>6.</p><br/><p>Their skin could be described as pure instead of pale. There was a very slight green tinge to their skin, overflowing with a feeling of refreshment.</p><br/><p>Their features were delicate. It was as if they had been drawn with the end of a thin brush. However, they didn't look frail. They gave off an air of sophistication.</p><br/><p>Their large eyes held the color of emerald and their high noses gave off a sense of arrogance. Their face was small compared to their high nose, and the combined effect of the features gave off a sense of aloofness. Their pale lips had a delicateness that seemed to have been made for an art piece.</p><br/><p>When one saw them, one couldn't help but show appreciation regarding their unforgettable beauty. Moreover, the Elves had cosmetics applied to their faces. Instead of it giving off a dry feeling, their appearance was filled with a sense of refreshment.</p><br/><p>The delicate scent of evergreen was coming off their body.</p><br/><p>“Who are you guys?”</p><br/><p>A pure voice flowed out of the Elf's mouth. However, her voice was buried by the sound of the falling waterfall.</p><br/><p>This was why Hyrkan and Whistling looked at each other without saying anything. No matter what the Elf said, they didn't have the ability to hear what the Elf had said.</p><br/><p>Of course, Hyrkan was the first one to react as he picked up what was going on. Hyrkan looked over the Elf's face, and he put on a slightly sour face.</p><br/><p>‘Somehow I get a leery feeling when I see pretty people.’</p><br/><p>It wasn’t as if Hyrkan hated beauties. Of course, no one in the world hated beautiful people. It was weird, but the sense of distrust came up before the feeling of admiration. He wouldn't put the beauties before his work. In Hyrkan's experience, it was rare for him to have a normal encounter with beautiful women. Moreover, the worst insult in his life was given as present to Hyrkan by a beautiful woman.</p><br/><p>This was why the Elven Race's beauty made Hyrkan put up his guard.</p><br/><p>On the other hand, Whistling looked at the Elf in front of him with an absent-minded face. He kept staring at the Elf. Hyrkan nudged Whistling's side with his elbow.</p><br/><p>“Didn't you say this was your life's dream?”</p><br/><p>“Ah!”</p><br/><p>Whistling finally realized what was going on, so he started walking towards the Elf. He still had a dazed expression on his face, so the Elf took couple step backwards in surprise.</p><br/><p>Gwahhhhhk!</p><br/><p>As she took several steps backwards, she quickly pulled her bow back. There didn't seem to be an arrow loaded, but one could tell something transparent was notched.</p><br/><p>“Hey, stop!”</p><br/><p>Hyrkan spoke out, and those words made Whistling alert once again. The Elf warned Whistling once again.</p><br/><p>“Please reveal your identity to us.”</p><br/><p>They still couldn't hear her because of the sound of the waterfall. Whistling rolled his eyes around as he tried to guess what was going on. Then he opened his mouth.</p><br/><p>“I'm Adventurer Whistling. I'm an Adventurer... The child you saved sent this letter.”</p><br/><p>Whistling tried to take out Selene's Letter, which he had safely put away within his pocket. It was a funny sight to see a large human awkwardly try to take out the letter.</p><br/><p>The Elf once again pulled back on her bow. She thought Whistling was taking out a weapon. Whistling quickly took out his hand in fright to show that both his hands was empty of weapons. Then he unbuckled his sword from his waist, and he placed it on the floor. Afterwards, he was able to take out the letter. He placed the letter on the floor and he retreated backward with both his hands raised.</p><br/><p>Hyrkan snorted as he saw this sight live.</p><br/><p>‘Jeez. Are they trying to make a movie?’</p><br/><p>A character unarming themselves to show that he didn't hold any hostile intent towards the natives was a scene commonly seen inside movies. However, he never expect to see such a sight within the game. Hyrkan tried very hard to stop himself from ridiculing them.</p><br/><p>At that moment, the Elf started to aim the bow towards Hyrkan. It basically meant she wanted Hyrkan to backoff like Whistling. Hyrkan had an annoyed expression as he raised both his hands up high towards the sky. There was no need to make it more difficult here.</p><br/><p>When Hyrkan and Whistling backed off a sufficient distance, the Elf relaxed slightly and she picked up the letter. Before she read the letter, she brought the letter up to her nose and she sniffed it.</p><br/><p>“So you received a request from that child.”</p><br/><p>Before she read the letter, the Elf had already discerned the content of the letter. She let out a long whistle.</p><br/><p>The hidden Elves started to show themselves one or two at a time.</p><br/><p>“Since you've seen us, we can't just send you back like this. We'll guide you to our village.”</p><br/><p>Those words were still not registering with Hyrkan and Whistling.</p><br/><p>Instead...</p><br/><p>[You've completed the Quest 'Selene's Letter.]</p><br/><p>[You've earned the Title ‘A Person Who Encounter the Elves’.]</p><br/><p>The system announcement informed Hyrkan and Whistling of the situation.</p><br/><p>7.</p><br/><p>Five Elves surrounded Whistling and Hyrkan. They continued to wander around near the Baekong Falls.</p><br/><p>During this time, the two of them shared a conversation.</p><br/><p>“Wasn't I right? I told you they were at the Baekong Falls. Since your lifelong dream has been fulfilled, you can't go back on your words. At the end of this, you have to give me the gold.”</p><br/><p>As Hyrkan spoke, Whistling was still looking at the surrounding Elves with a dazed expression. It wasn't the simple case of being dazed by beauty. He looked as if he had been hypnotized by something.</p><br/><p>Hyrkan shook his head from side to side as he looked at Whistling’s expression.</p><br/><p>‘He isn't like the Pit Bull I knew from before. He fell into that category of people?’</p><br/><p>Whistling Pitbull.</p><br/><p>He was nicknamed the Pitbull because of his outer appearance. However, as befitting his nickname, he possessed the tenaciousness of a fighting dog.</p><br/><p>He was decisive.</p><br/><p>He saw the battle to the end without sparing his body. He was like a cool hunting dog that never gave up once he entered the battlefield. However, the current Whistling looked nothing like a pit bull. He didn't even give off a feeling of pet dog.</p><br/><p>“Do you really like the Elves that much?”</p><br/><p>Hyrkan finally asked the question. It was a question he had avoided asking until now. He had no reason to ask it. Hyrkan didn't care about other people's preferences.</p><br/><p>Hyrkan had already given up finding a teammate. He only had two categories. A person fell into either the profitable or non-profitable category. If the person could lead Hyrkan to a profit, he didn't care if the person preferred Dwarfs instead of Elves. He would be able to overlook their taste. He could even overlook a person liking the Orcs. He would have to think long and hard though if someone's preference ran towards the Trolls.</p><br/><p>At Hyrkan's question, Whistling slowly opened his mouth.</p><br/><p>“Of course. I really like them. It was one of the main reason why I started playing this game.”</p><br/><p>“I guess you like beautiful women.”</p><br/><p>“What man doesn't like beautiful women? However, it isn't as simple as that.”</p><br/><p>“You have another reason?”</p><br/><p>“I have a great admiration towards the Fantasy genre.”</p><br/><p>“What?”</p><br/><p>After he thought about it for a moment, Whistling told Hyrkan the reason he had told no one before.</p><br/><p>It was a gift, since Hyrkan had helped him out.</p><br/><p>“Warlord is a game. I won't deny that fact. However, amongst all the games out in the market, it had a setting that was closest to a Fantasy world. It was my lifelong dream to meet the Elves in such a world. To me, Elves are symbol that epitomizes the Fantasy genre.”</p><br/><p>“Is that so?”</p><br/><p>“Now that I've met the Elves, I think I will truly be able to enjoy this world. Moreover, it feels like I could give it my all in playing Warlord now.”</p><br/><p>Whistling grinned.</p><br/><p>“Isn't everyone playing this game for those reasons?”</p><br/><p>At those words, Hyrkan recalled someone.</p><br/><p>‘He's a guy that likes the challenge itself.’</p><br/><p>Don Quixote.</p><br/><p>He was a challenger, who lived for the chivalric romances.</p><br/><p>Whistling was cut from the same cloth. At that moment, Hyrkan knew it for sure.</p><br/><p>‘There's no way I'll become teammates with Whistling.’</p><br/><p>He couldn't become comrades with Pit Bull. Hyrkan was on the complete other side of the spectrum with those who were playing this game out of enjoyment and romanticism.</p><br/><p>“We've arrived.”</p><br/><p>At that moment, the barrier in front of Whistling and Hyrkan was taken down. Then the hidden Baheim tribe's village inside the Clapper Jungle appeared. There were countless bridges connecting the Clapper Trees, and houses hanging off of trees. The sight filled Hyrkan's vision.</p><br/><p>[You've received the title 'Baheim Tribe's First Customer’.]</p><br/><p>He immediately heard the announcement for the Title.</p><br/><p>When Hyrkan heard the announcement, he patted Whistling's shoulder.</p><br/><p>“All right. You should have fun playing this game.”</p><br/><p>He realized not too long ago that he couldn't become teammates with Pit Bull. If that's the case, they would have to part ways here.</p><br/><p>“What?”</p><br/><p>Whistling spat out a reply at Hyrkan's abrupts words. However, Hyrkan ignored Whistling's questio, and he spoke toward the Elf on the side.</p><br/><p>“I'm here on an errand for the blacksmith Olf. I would appreciate it if you could take me to someone in charge of this place.”</p><br/><p></p></div><br/>\n</div>"}