{"title": "Chapter 80 - Olfs Errand", "id": 80, "volume": 1, "url": "http://boxnovel.org/emperor-of-solo-play-chapter-80-olfs-errand", "volume_title": "Volume 1", "body": "<h1>Chapter 80 - Olfs Errand</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 80 Olf’s Errand.</strong></p><div class=\"innerContent fr-view\" id=\"chapterContent\"><br/><p>Chapter 80 - Olf’s Errand</p><br/><p>1.</p><br/><p>Great Urugal Mountain Range.</p><br/><p>Most users didn’t even realize such a landmark existed in Warlord. It was an obscure stage, yet it was crawling with powerful monsters that would suit even the famous Ranked users of Warlord.</p><br/><p>A single user was running through such a dangerous land by himself.</p><br/><p>Pah-aht, paht!</p><br/><p>There weren't any paths that could be called a road in sight. The user was incredibly fast as he ran across the rugged terrains at full speed. He wasn’t simply fast. Obstacles like rocks and tree roots continuously appeared, but he avoided them all. He even used some obstacle to push off of it to increase his speed. He looked like an animal.</p><br/><p>At the same time, one could see his desperate resolve.</p><br/><p>The reason for this user's will was the existence following right behind him.</p><br/><p>Kuhng kuhng kuhng!</p><br/><p>A black dog was letting out rugged barks. Its outer appearance looked akin to a greyhound. It had a sleek black body that made it look agile.</p><br/><p>However, no one would are to call this monster a dog. Its body was longer than 3 meters even when one discounted the length of the tail. It was massive, and its eyes were burning. It wasn't a metaphor. It had big burning flames for eyes.</p><br/><p>The most striking sight was the slobber that flew out as it ran. The dog slobber flew out of the panting muzzle, and it boasted a power to melt the vegetations and rocks in the surrounding. It was horrifying to think about what would happen when one was bitten with a mouth full of such saliva.</p><br/><p>This monster, which caused him to imagine such a horrible scenario, was named the Black Hound. It was over level 130 and it was nicknamed the Priest Killer. It was a nickname that sent shivers down the hunters who enjoyed party hunting.</p><br/><p>Some basic monsters reacted to magic attacks as they prioritized attacking mages first. The Black Hound was unique in that it reacted to healing and buff skills. It prioritized attacking the priests. When one becomes poisoned from its bite, it couldn’t be healed through a low rank Antidote Skill. It was an extremely potent poison. This was why it was nicknamed the Priest Killer.</p><br/><p>Currently, it was showcasing its incredibly fast speed. This monster was most suited for hunting and tracking than any other monster. When it was first revealed in Warlord, a 10 man party had come across it. The combined level of the party was over 1,100, yet they weren't able to put up much of a fight. The party was wiped out in 20 minutes.</p><br/><p>‘Shit!’</p><br/><p>Hyrkan had picked up a tracker of that caliber, and it felt as if he was about to die.</p><br/><p>‘If only I had a Wyvern Golem, I wouldn't have to go through all this hardship!’</p><br/><p>As he ran, Hyrkan recalled what had happened for the past couple days.</p><br/><p>Hyrkan had earned the Clay Play skill as reward from the Battlefield two days ago. He immediately started experimentation to find out more about the skill. He had used a lot of money to purchase various types of monster gems. He used the ingredient gems as sacrifice to change the Golem into various monsters.</p><br/><p>Hyrkan had really wanted to fly, but he had failed to obtain the requisite ingredients. However, he had found something about the Skill. The important part was the Skill Proficiency of the Skill. At Rank F, the Clay Play Skill gained only half the capability of the monster that was being copied. If one only had half the Specs, it would be impossible to fly.</p><br/><p>In other words, he needed to get as close to 100% of the monster's stat. Then he would be able use a Wyvern golem, Griffin Golem or even a Dragon Golem as a private plane. This could happen only if his Skill Rank was high enough.</p><br/><p>Anyways, he would have to delay the plan of using a monster as a private plane. Hyrkan used his two legs to approach the great Urugal mountain range. This was two days ago.</p><br/><p>‘I've been running away for two whole days…… Why the hell am I doing this while paying a lot of money to play this game? Sometimes it really make me wonder.’</p><br/><p>For the past two days, Hyrkan had traveled around the entrance of the great Urugal mountain range to search for the blacksmith olf. When monsters showed up, he didn't even battle them. He ran away. It was rare for him to experience a proper battle. Of course, he saw several monsters he had wanted to catch.</p><br/><p>However, all the monsters that appeared at the great Urugal mountain range were difficult to take down for Hyrkan. He needed to spend a considerable amount of time fighting any of the monsters here, and he would be making a lot of noise in the process. It would attract monsters like the Black Hound, and the act of running away was difficult in itself.</p><br/><p>It was apparent he would become a target of uncommon monsters.</p><br/><p>Moreover, when facing a monster like the Black Hound, one didn't get away for free.</p><br/><p>“Chet.”</p><br/><p>Hyrkan clicked his tongue. He didn't throw just one Skeleton Fragment. He had to throw three of them into the distance. After falling to the ground, the Skeleton Fragments immediately took form into becoming Skeleton Warriors. Each Skeleton Warrior were 2 meter tall, and they each held a well-used sword. Their appearance was imposing. They looked as if they were ready to cut down the drooling black dog with a single slash.</p><br/><p>However, the Skeleton Warriors didn’t stand a chance with the Black Hound. They weren't even able to attack it once.</p><br/><p>It happened in a flash.</p><br/><p>The Black Hound chasing Hyrkan moved like the wind, and it munched on the two Skeleton Warriors at the same time.</p><br/><p>It took a bite.</p><br/><p>Kwah-jeek!</p><br/><p>It chewed them in a single bite.</p><br/><p>In a flash, the skull of the two Skeleton Warriors were crushed like a hollow candies. Hyrkan's Magic immediately decreased.</p><br/><p>In a flash, the Black Hound bit into the skull of the last remaining Skeleton Warrior. The Black Hound's movement was surprisingly fast. The Skeleton Warriors trained by Hyrkan didn't even stand a chance.</p><br/><p>Hyrkan gritted his teeth when he saw the massive amount of his magic being consumed in second.</p><br/><p>‘It really is like a dog.’</p><br/><p>Hyrkan was barely able to run away after sacrificing his 3 Skeleton Warriors. He gritted his teeth and made a new resolve.</p><br/><p>‘When I hit level 100 and advance in my Class, I'll hunt down every one of these bastards. I'll melt their flesh and I'll cut their bones into bits and pieces. Then, I'll scatter it across the world.’</p><br/><p>It was a frightening thought, but if one thought carefully on it, it was the same kind of thoughts Hyrkan always brooded over. He met the blacksmith Olf on the 30th hour after he had left the Parung Forest.</p><br/><p>2.</p><br/><p>The meeting with the blacksmith Olf was intense.</p><br/><p>He was 130cm tall. Hyrkan would have to sit on a knee-high stool to be able to come face to face with the short dwarf. In the beginning, Hyrkan wasn't even aware the dwarf was there. The short dwarf quickly headed towards him. Hyrkan had a hard time identifying who this person was.</p><br/><p>When the distance between the two of them decreased, Olf swung the enormous hammer in his hand towards Hyrkan's stomach.</p><br/><p>“Kuhk!”</p><br/><p>His single attack blasted Hyrkan into the air like a tennis ball, and he was slammed into a tree. His HP had been 85% full, but in a flash, it dropped below 1%.</p><br/><p>‘I have to live!’</p><br/><p>Hyrkan was barely able to save his life. He instinctively took out the recovery items hidden in various parts of his armor, downing them into his mouth.</p><br/><p>This was the most intense greeting Hyrkan had ever received.</p><br/><p>While he was doing all of this, Olf stood in front of Hyrkan. Hyrkan was on the floor as he looked up at Olf.</p><br/><p>“Who are you?”</p><br/><p>Hyrkan once again let his instinct guide his action. He raised his right hand. It was the hand with the ring on. It was the Proof of the Secret Society. Hyrkan had his glove on, so the ring wasn't visible. Fortunately, Olf had the ability to immediately recognize his own handiwork.</p><br/><p>Olf was getting ready to bring down the hammer on Hyrkan's head, but he put the hammer that was as tall as him down on the floor.</p><br/><p>Koohng!</p><br/><p>The hammer's head dropped to the floor and the sound was unusually loud. Without realizing it, Hyrkan eyed the head of the hammer. At the same time, he fell into his thoughts. He even forgot the situation he was in right now.</p><br/><p>‘So that's the famous Olf's Hammer…… It is a monstrous weapon that takes off a percentage of a user's HP...’</p><br/><p>The item he had only seen through the vids was right in front of his eyes. However, Hyrkan wasn't given any time to admire it.</p><br/><p>“So you are the human sent by the Maeung. The Maeung contacted me a while back that he'll be sending someone. You are finally here. What the hell were you doing while you were coming here?”</p><br/><p>Olf's words were very curt.</p><br/><p>‘……It is as I've heard. This character was designed to piss off the users. I've just started to talk to him, yet he is already making me angry.’</p><br/><p>Hyrkan's feeling was about to go through an abrupt change when it happened.</p><br/><p>[You've received the Title 'Someone Who Has Met the Blacksmith Olf.']</p><br/><p>[You've received the Title 'The First One to Meet Olf.]</p><br/><p>The announcement for the titles popped up.</p><br/><p>‘Uh? It gives two titles?’</p><br/><p>It suddenly cooled Hyrkan's boiling anger inside. Hyrkan's expression changed.</p><br/><p>“I'm sorry for being late!”</p><br/><p>At that moment, Hyrkan meant what he said.</p><br/><p>‘It gave me not one but two?’</p><br/><p>He had expected to get a single title. It was very difficult to meet Olf. If a user forced himself to meet Olf, the Blacksmith would ruthlessly kill you. If one considered how difficult it was to meet Olf, the title was to be expected.</p><br/><p>The title was 'Someone who have met the Blacksmith Olf.' Its option was to increase the Class attribute by 25 points. It was a great title.</p><br/><p>However, this was the first time Hyrkan saw the title, 'The First One to Meet Olf.'</p><br/><p>‘Someone ate it in secret.’</p><br/><p>Who would have guessed such a title existed?</p><br/><p>On top of that, the title was in Hyrkan's possession now. From Hyrkan's perspective, he wanted to kiss Olf on the lips even if he had a dirty and unruly beard.</p><br/><p>Olf had no idea what Hyrkan was thinking, so he looked on with cold eyes.</p><br/><p>Hyrkan stared back into Olf's eyes</p><br/><p>Silence had descended.</p><br/><p>Within the silence, Hyrkan once again organized the information he had about Olf in his head.</p><br/><p>‘I never expected to meet him like this.’</p><br/><p>Blacksmith Olf was a NPC and he was one of the top 10 most famous figures in Warlord. He created a lot of uproar, since Olf had a hand in bringing out a good number of Epic Items in Warlord. These Epic Items had tremendous options.</p><br/><p>At the same time, Olf was the most inhospitable NPC towards the users. The treatment Hykan had received was the norm. Unless one has a special quest or qualification, the hostile Olf attacked the user on the spot. His attacks were incredible. Even Level 200 users wouldn't dare go up against him.</p><br/><p>This was why several users had teamed up together to take revenge on Olf, but no one had ever succeeded. Olf was one of the strongest NPC in Warlord.</p><br/><p>Moreover, Olf had the Olf's Hammer which allowed him to easily destroy the users. It was a famous item made by the game, and it was known for its cheat option.</p><br/><p>‘It's the hammer worth 1 hundred thousand dollar cash.’</p><br/><p>Some wealthy user had put a bounty out saying he'll give 1 hundred thousand dollars to the person who brought him the hammer.</p><br/><p>Of course, it was a nonsensical request. Olf's Hammer couldn't be gained even if one killed Olf. If Olf was killed... If Olf died, the Quests within the game couldn't progress, so the item was made to prevent such a scenario.</p><br/><p>‘Wasn't there a guild formed specifically to get that bounty?’</p><br/><p>However, there were always couple crazy bastards in the world, who wanted to try the impossible.</p><br/><p>Hyrkan thought about the memories of that time. He had on a bitter smile inside.</p><br/><p>‘……So how long do I have to stay here like this?’</p><br/><p>Hyrkan had organized the thoughts in his head, but Olf was still staring down at Hyrkan.</p><br/><p>His gaze wasn't that welcoming. It gave off the impression that he was looking at a trash. It was enough to twist one's mood from being viewed that way. Hyrkan had no idea why they would design a NPC like him. He really was curious as to why someone would create such a character.</p><br/><p>Eventually Hyrkan ran out of patience, so he opened his mouth.</p><br/><p>“Boss Maeung wanted me to help Olf-nim...”</p><br/><p>“How can I trust a bastard like you with my business?”</p><br/><p>Olf cut off his words like a knife.</p><br/><p>“Please test my abilities.”</p><br/><p>“A test?”</p><br/><p>Olf laughed hard in derision through his beard, and it cut away at Hyrkan's mood.</p><br/><p>“Yes. I will pass any test you give me to prove my competence.”</p><br/><p>“Poo-poohp!”</p><br/><p>The overly embellished laughter was spat out by Olf. Olf stamped the finishing touch on Hyrkan's foul mood.</p><br/><p>Hyrkan pressed down hard on the anger that was about to burst out of him.</p><br/><p>‘You son of a bitch. Once I hit level 300, you are dead. No, level 300 would be too low. Maybe, at level 350... I should be on the safe side.... Yes, you are dead once I hit level 400.’</p><br/><p>At that moment, a new goal was formed inside Hyrkan.</p><br/><p>Suddenly, Olf took off a pouch from his belt and threw it at Hyrkan.</p><br/><p>“Go find those pale bastards at the Baheim Forest and deliver this pouch to them..”</p><br/><p>[Quest 'Olf's Errand' has started.]</p><br/><p>His words were brief.</p><br/><p>After he spoke the single sentence, Olf grabbed his hammer and immediately turned his body.</p><br/><p>“W...wait a moment!”</p><br/><p>Olf didn't give Hyrkan the chance to hold him up. Olf disappeared in a flash from Hyrkan's side.</p><br/><p>‘Ah. It's the Shadow Boots!’</p><br/><p>Hyrkan finally realized Olf had the Shadow Boots. The item had the option to make one disappear from a user's sight in an instant.</p><br/><p>‘If I had the Olf's Hammer and the Shadow Boots, I could take care of the Stormhunters. It would be like a work out. Ah, I really want those items.’</p><br/><p>After Hyrkan shook his head from side to side, he stood up.</p><br/><p>After standing up, Hyrkan looked down at his stomach. His defensive gear was ruined. If he repaired it, it would be back to normal. However, for the time being, he would have to leave it in its damaged state.</p><br/><p>“Shit.”</p><br/><p>‘If you hit a person, you should at least leave behind the repair fee. I had to go through all kinds of hardship just to meet that fucking NPC.’</p><br/><p>After he let out a short burst of cuss words, he let out a really deep sigh.</p><br/><p>‘Anyways, I've taken care of the difficult part.’</p><br/><p>He had successfully carried out his mission of meeting Olf at the great Urugal mountain range without being killed. He really accomplished a big task. If Hyrkan had followed the balance of Warlord, he wouldn't have even been able to attempt this task at this level, yet he succeeded.</p><br/><p>At the same time, a new task had been given to him.</p><br/><p>“The Baheim Forest...”</p><br/><p>Baheim Forest.</p><br/><p>‘It has been awhile since I've met an Elf.’</p><br/><p>Its other name was the Forest of the Elves.</p><br/><p></p></div><br/>\n</div>"}