{"title": "Chapter 81 Olf's Errand (2).", "id": 81, "volume": 1, "url": "http://boxnovel.org/emperor-of-solo-play-chapter-81-olfs-errand-2", "volume_title": "Volume 1", "body": "<h1>Chapter 81 Olf's Errand (2).</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 81 Olf's Errand (2).</strong></p><div class=\"innerContent fr-view\" id=\"chapterContent\"><br/><p>Chapter 81 - Olf's Errand (2)</p><br/><p>3.</p><br/><p>[Hyrkan]</p><br/><p>- Level : 90</p><br/><p>- Class : Magician</p><br/><p>- Title : 47</p><br/><p>- Stat : Strength(895)/Stamina(357)/Intelligence(538)/Magic(664)</p><br/><p>After looking at his Stats, Hyrkan blinked as his eyes widened. Then he looked at his Stat Window once again.</p><br/><p>‘What's going on?’</p><br/><p>A user of Hyrkan's caliber was well acquainted with his Stats. It was preposterous to not be able to recognize his own Stats. He would forget his phone number or home address before he would forget his Stats. It was unthinkable. Although Hyrkan wasn't that great at math, he was proficient enough to calculate the Stat values within his head.</p><br/><p>‘It seems all my Stats got a 3 percent increase? Am I seeing this wrong?’</p><br/><p>Hyrkan quickly finished his calculation, then he checked the title.</p><br/><p>[The First One to Meet Olf]</p><br/><p>Title Effect : All Stat is increased by 3 percent.</p><br/><p>Hyrkan stopped breathing.</p><br/><p>‘Wow.’</p><br/><p>All Stats increased by 3 percent!</p><br/><p>‘I knew the blacksmith Olf gave out a lot of good stuff, but I never expected such a good title.’</p><br/><p>Olf didn’t make make Rare or Unique Item. Olf was associated with making Epic Items, so he was a NPC that gave out a lot of title with good effects. The Epic Items also had a lot of ties with the Main Quests.</p><br/><p>Hyrkan was well aware of this fact. However, Hyrkan had never been the main character to receive such Items or Titles until now.</p><br/><p>‘He really is an incredible bastard.’</p><br/><p>Hyrkan rubbed his stomach.</p><br/><p>‘Although, his personality is bad, and he is annoying.’</p><br/><p>He had received an unexpected present, and Hyrkan immediately checked the content of the Quest.</p><br/><p>[Olf's Errand]</p><br/><p>- Quest Rank : Unique</p><br/><p>- Quest Level Range : None</p><br/><p>- Quest Content : Deliver the item given to you by Olf to the Baheim Forest.</p><br/><p>- Quest Reward : None</p><br/><p>The Quest Content wasn't anything unique. It was a quest with no special rewards attached to it.</p><br/><p>‘He really is just using me as an errand boy.’</p><br/><p>Essentially, it was a trash quest.</p><br/><p>However, he had no choice but to carry this quest out, even if there was no reward.</p><br/><p>Still, that didn't mean it was an easy quest.</p><br/><p>‘The Baheim Forest…… Isn't it at the Clapper Jungle?’</p><br/><p>The Baheim Forest was actually a forest where one of the Elf tribe lived. It contained a village where the Baheim tribe lived.</p><br/><p>The users enjoyed meeting the Elves in Warlord. Amongst the races, they enjoyed the highest popularity.</p><br/><p>Weren't the Elves a race known for their beauty? Unless one was killed by being pierced by an Elf's arrow, there was no reason to hate the Elves.</p><br/><p>Actually, the fondness for the Elves were a little bit overboard in some cases. There were some users that showed excessive interest in the Elves. Some did party play with an Elf NPC. Some even showed affection towards them. Moreover, there were users, who wanted to become a couple with an Elf NPC within the game. There were extremely disgraceful users whose life mission was to make this come true.</p><br/><p>‘Maybe I should have shown some some interest in the Elves in the past??’</p><br/><p>Unfortunately, it was quite hard to meet the Elves in Warlord.</p><br/><p>Like the blacksmith Olf, one needed a related Quest to be able to talk to the Elves.</p><br/><p>Of course, the information regarding these Quests were released a little bit later on. However, at this point in the game, the information regarding the specific Quest Route for meeting the Elves were almost never traded.</p><br/><p>Hyrkan also didn't have much information on the Elves.</p><br/><p>He knew the Baheim Elf Tribe was at the Clapper Jungle. However, he didn't know that info, because he was interested in the Elves. He knew it since this had been part of the Main Scenario Quest content.</p><br/><p>Basically, he would have to find out the specifics of the content by bumping his body against it.</p><br/><p>‘Even if I worry about it, I won't find an answer.’</p><br/><p>Of course, it was meaningless to worry about it right now. Hyrkan turned his head. The Clapper Jungle was located north of the great Urugal mountain range. Hyrkan had his head turned northward.</p><br/><p>‘All right.’</p><br/><p>Hyrkan reaffirmed his resolve.</p><br/><p>It happened at that moment.</p><br/><p>Kuhng kuhng!</p><br/><p>A dog started barking with all its might from behind Hyrkan. He turned his head around in fright.</p><br/><p>He caught sight of a single black dog.</p><br/><p>“Shit!”</p><br/><p>Hyrkan started running, and the drooling Black Hound chased crazily after Hyrkan.</p><br/><p>‘When I advance in rank, I'll kill every one of those sons of bitches.’</p><br/><p>Hyrkan left the great Urugal mountain range and headed towards the Clapper Jungle.</p><br/><p>4.</p><br/><p>Clapper Jungle.</p><br/><p>The enormous trees shot into the sky as if it didn't know the boundary of the sky. The Clapper Jungle was filled with the Clapper trees, and it was one of the most famous and magnificent view in Warlord.</p><br/><p>Streams meandered to the middle of the Jungle, and it had formed a lake. It was majestic to see the Clapper trees from afar, but it was much more impressive within the jungle. The trees reached high into the sky, giving the illusion that there was a green colored sky above. The place held a profound and mysterious beauty. When the first user to find the Clapper Jungle recorded the video of the scenery, it drew 30 million views even though the footage was 3 hours long.</p><br/><p>The Clapper Jungle was the main hunting ground used by users between level 100 to 110.</p><br/><p>The most common monsters were the Tree Bark Snake, Hook Praying Mantis, and the Cursed Trapper Tree. It wasn't a place where one earned very good items or EXP, but it was a decent hunting ground.</p><br/><p>The users, who used the Clapper Jungle as their stage, gathered at Clapper Village, which was located at the entrance of the jungle. The Clapper Village was quite large, and it even had a branch of the Subjugation Association there.</p><br/><p>However, the most striking part of this place wasn't the village’s size or the superb view of the Clapper Jungle. It was the users who used this place as their stage.</p><br/><p>There was a clear difference between the users over level 100 and below 100. It was the difference between possessing a powerful power after finishing the Advancement and not having it.</p><br/><p>Once one finishes one’s Advancement, one's occupation that showed up on the Stat Window changed. One would then get a specialized Class instead of the Swordsman, Priest, Magician Class designation. There was the Fighter and Liner, Monk and Assister, Magic Swordsman and Mage, and etc.... Of course, the most distinguishable feature of these users was the experience and skill they had gained along the way.</p><br/><p>The moment Hyrkan entered the Clapper Jungle's Subjugation Association, he could feel the difference.</p><br/><p>Normally, if he entered a Subjugation Association in any castle he went to, most users would show surprise at Hyrkan with his Hahoe Mask on. Some put on an awed expression as if they had seen a celebrity.</p><br/><p>However, it was different here.</p><br/><p>“Is it really the Hahoe Mask?”</p><br/><p>“A famous person has shown up here. Did he finish his Advancement?”</p><br/><p>“We'll know once we see him in action. Anyways, the fact that the Hahoe Mask is here... There must be something interesting here?”</p><br/><p>Instead of being surprised at seeing Hyrkan, these users thought about the potential profit they would be able to get their hands on.</p><br/><p>Hyrkan received their gazes, and he was able to fully realize the situation he was in.</p><br/><p>‘Now I'll be playing with guys who really like playing this game.’</p><br/><p>An adequate amount of nervousness sharpened Hyrkan's concentration and sharpness. At the same time, Hyrkan quickly turned his head to look at his surrounding. He first looked at the users equipped with the symbolic emblems.</p><br/><p>At a glance, one could see several emblems present here. His eyes caught sight of several guild emblems. Hyrkan searched through his memories and discovered that many of them were from fairly famous guilds.</p><br/><p>However, no one was from the 30 great guilds were present.</p><br/><p>‘I'll have to go with Plan A.’</p><br/><p>In other words, no one from the 30 great guilds had yet to find out about the Baheim Elf Tribes within the Clapper Jungle. Even if the members of those guilds were present, Hyrkan had no plans to trade information with them.</p><br/><p>Hyrkan had no choice but to go with his original idea.</p><br/><p>‘I have no choice, but to do all the Quests related to the Clapper Jungle.’</p><br/><p>Hyrkan's hardships had just begun.</p><br/><p>5.</p><br/><p>“Thanks to you, the Clapper Jungle will be a bit quieter now.”</p><br/><p>Hyrkan put on a forced smile as he heard words spoken by the Clapper Village's NPC.</p><br/><p>‘This is the 20th Quest. Please just let me move on. Please...’</p><br/><p>This was the 10th day inside the Clapper Jungle.</p><br/><p>During the 10 day period, Hyrkan had done all the Quests that was available to him.</p><br/><p>Once he started doing all the Quest available in the Clapper Village, he formed a relationship with NPCs. This would lead to the higher rank Quests. In the end, he hoped he would get the Quest related to the Baheim Elves.</p><br/><p>This was the most typical way for a user to get close to a hidden truth in Warlord.</p><br/><p>Of course, people of the world preferred quality over quantity. It was the same for Hyrkan.</p><br/><p>“Do you perhap have anything else for me to do?”</p><br/><p>“Mmm. You can go see Chess at the Red Log Cabin. He is trying to acquire Tree Bark Snake's leather.”</p><br/><p>Hyrkan's face crumpled.</p><br/><p>“Is it perhaps a task that requires gathering of the leathers?”</p><br/><p>“The reward will be pretty good.”</p><br/><p>[Quest 'Chess' Request' has started.]</p><br/><p>When he received the Quest, Hyrkan let out a forced laugh.</p><br/><p>‘Shit! I don't want to do this shit!’</p><br/><p>Just by hearing the name of the Quest he could tell it was just a monster hunting Quest.</p><br/><p>‘I'm going to hit level 100 first if things keep going this way.’</p><br/><p>The end to his patience had shown up 3 days ago. When the week was up, Hyrkan finally had to throw out a bait.</p><br/><p>He put up a post to trade information. He put up a post saying he wanted information regarding the Elves within the Clapper Jungle.</p><br/><p>It was a double-edged sword. He was basically telling other users that Elves existed inside the Clapper Jungle. This was why he hadn't wanted to take this route.</p><br/><p>However, at this point, it was more important for him to get information regarding the Baheim Tribe. He couldn't worry about spreading information at this point. He had thrown out a big bait, yet no one was biting.</p><br/><p>His anxiety deepened.</p><br/><p>‘The Stormhunters have already caught the Helm Ogre.’</p><br/><p>It especially made him more restless knowing that the Stormhunters had already left the Parung Forest after catching the Helm Ogre.</p><br/><p>It was at that moment.</p><br/><p>[A Mail has arrived.]</p><br/><p>The mail arrival alarm was heard.</p><br/><p>Hyrkan immediately checked the address of the mail. It was a newly made mail address. Someone wanted trade information regarding the Baheim Elf Tribe.</p><br/><p>The content was very brief.</p><br/><p>[Would like to trade. The location will be in front of the Red Log Cabin.]</p><br/><p>Hyrkan's expression unknotted.</p><br/><p>‘Finally?’</p><br/><p>He had spread the bait 3 days ago, and he had finally gotten a bite. Of course, he had no idea if the person who bit on the bait was a hustler, trash or a big fish.</p><br/><p>First, Hyrkan immediately replied to the mail.</p><br/><p>[Tell me about your appearance or distinct features. I'll go directly to you.]</p><br/><p>Another mail came back immediately.</p><br/><p>[I will look for you.]</p><br/><p>Hyrkan was torn.</p><br/><p>‘Is this bastard trying to catch me instead?’</p><br/><p>However, his indecision was brief.</p><br/><p>‘No. If I reveal myself as the Hahoe Mask, it might give credibility to the bait I put out. I've already spilled the beans about the Elves, and the fact that I'm hunting at the Clapper Jungle isn’t a secret.’</p><br/><p>Hyrkan didn't want to feel anymore anxiety, so he didn't think too hard on this decision.</p><br/><p>Hyrkan decided to make a bold decision.</p><br/><p>[Hahoe Mask]</p><br/><p>Hyrkan sent another short mail. As he was sending it, he made a firm resolve.</p><br/><p>‘If this guy is trying to fish me, his wrist won't stay intact.’</p><br/><p>6.</p><br/><p>The Red Log Cabin.</p><br/><p>A merchant NPC named Chess used this place as his home. He was the NPC that gave out Quests that had gold rewards. He was popular amongst users who were aiming for the gold reward instead of the level up. There were about 3-4 users waiting for their turn in front of the Red Log Cabin.</p><br/><p>Hyrkan stood a bit away from the other users. Of course, everyone's gaze headed toward Hyrkan.</p><br/><p>On the other hand, Hyrkan didn't show any interest to the users. Hyrkan was on high alert, and he surveyed his surrounding.</p><br/><p>‘Why is he so late?’</p><br/><p>In a flash, he had to determine if the person who took the bait was a snake or a big fish. If he confused a snake with a fish, then Hyrkan would be the one being bitten.</p><br/><p>This was when the nervous Hyrkan caught sight of an extraordinary user.</p><br/><p>‘Uh?’</p><br/><p>It was a user with enough fame and reputation to make Hyrkan nervous in an instant. He was famous enough to grab the attention of users, who had been focusing on Hyrkan.</p><br/><p>“It's Whistling.”</p><br/><p>“Whistling Pitbull!”</p><br/><p>Hyrkan's eyes narrowed.</p><br/><p>‘Why is the Whistling Pit Bull here?’</p><br/><p>Whistling Pitbull.</p><br/><p>His appearance looked very similar to a pit bull. His face looked very fierce. Of course, he wasn't famous because of his ferocious look.</p><br/><p>First, he was one of the first to put his name up in the top 100 Ranking Board during the early days of Warlord. He had exceptional abilities, and he also showed a great passion for this game. Of course, his name had long been pushed out from the top 100 Ranking Board by those who devoted their lives to Warlord. Still, his level was still sufficiently high.</p><br/><p>‘Currently, Whistling Pit Bull should be in the latter half of level 120 or early 130s?’</p><br/><p>He was either at the latter stage of level 120 or he was in the early parts of 130.</p><br/><p>It was on par with the level of the highest level users.</p><br/><p>In other words, his level was too high to consider the Clapper Jungle as his hunting ground.</p><br/><p>He had no reason to be here.</p><br/><p>He might have another motive to be here instead of hunting.</p><br/><p>‘Perhaps?’</p><br/><p>Hyrkan was nervous.</p><br/><p>‘Is he here to catch me?’</p><br/><p>Didn't Hyrkan have a lot of enemies? It was natural for him to be suspicious. Moreover, he had fought with the Whistling Pitbull before he had returned to the past. Of course, Hyrkan had won. However, amongst the users he had fought before, the Whistling Pitbull's capabilities and battle sense had left the biggest impression on him.</p><br/><p>Moreover, he was part of a large guild that was close to entering the 30 great guilds. He was part of the Fighters Guild.</p><br/><p>Of course, Hyrkan would be nervous at his appearance.</p><br/><p>Moreover...</p><br/><p>‘He's coming towards me.’</p><br/><p>He was clearly walking towards Hyrkan. Hyrkan discreetly put his hand into his pocket and started touching the Skeleton Fragments. If needed, he thought about doing a pre-emptive attack. At this point in time, Hyrkan hadn't gone through his advancement. It wouldn't be easy to fight Pitbull, who had over 30 levels on him.</p><br/><p>The users in the surrounding tensed up.</p><br/><p>‘The Whistling Pitbull and the Hahoe Mask are together?’</p><br/><p>‘I think a good vid would come out of this?’</p><br/><p>Everyone was probably getting ready to record when the two of them started fighting.</p><br/><p>Every user in front of the natural looking Red Log Cabin was tense. In this anxious atmosphere, Pitbull stepped in front of Hyrkan. Hyrkan didn't even bother to greet him. The moment he spoke would be the brief window of opportunity Hyrkan needed. He just glared at Pitbull's face through the Hahoe Mask.</p><br/><p>However, Pitbull didn't avoid his gaze. As befitting his nickname of Pitbull, his entire face gave off an impression of a fighting dog. His demeanor was very ferocious. If one didn't know him, others might think he was trying to start a fight just from looking at the Pitbull's face.</p><br/><p>It was at that moment.</p><br/><p>“Maybe…….”</p><br/><p>The Pit Bull spoke in a really low voice.</p><br/><p>“Can you help me break open this Quest related to the Elves? It is my life's dream to meet the Elves...”</p><br/><p>Whistling Pitbull.</p><br/><p>He was a man with a romantic idea about the Elves.</p><br/><p></p></div><br/>\n</div>"}