{"title": "Chapter 99 - Cursed Domain (3)", "id": 99, "volume": 1, "url": "http://boxnovel.org/emperor-of-solo-play-chapter-99-cursed-domain-3", "volume_title": "Volume 1", "body": "<h1>Chapter 99 - Cursed Domain (3)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span style=\"\">Chapter 99 - Cursed Domain (3)</span></p><br/><p><span style=\"\">A Weapon Werewolf was in three pieces as the corpse was broken and mangled on the ground.</span></p><br/><p><span style=\"\">The User, who had been looking at the corpse, whipped his head around.  He spoke towards a Magician teammate.</span></p><br/><p><span style=\"\">“If you throw magic around like that next time, I'm going to declare a PK match against you.” </span></p><br/><p><span style=\"\">“I...I'm sorry.” </span></p><br/><p><span style=\"\">The conversation was too brusque and one-sided to call it a conversation between comrades.  It was beyond a warning. He had basically delivered a threat.  When Zeet received the warning, he immediately apologized instead of getting mad.</span></p><br/><p><span style=\"\">‘His temperament is entirely different from his appearance.’ </span></p><br/><p><span style=\"\">In truth, it was a reaction that didn't match Zeet's personality.  It wasn't as if Zeet's personality was dirty or ill-tempered. Still, he was more rowdy than he was quiet.</span></p><br/><p><span style=\"\">His personality had been the reason why he had gotten into a conflict with the Swing Guild.  If Zeet had kept quiet when he had minor or emotional disagreements, he wouldn't have heard words like 'You better watch out next time you go for a hunt, you son of a bitch!'</span></p><br/><p><span style=\"\">However, Zeet had killed his temper for now, and he was deferring to his new partner.  The reason was simple.</span></p><br/><p><span style=\"\">‘……his skills are killer.’ </span></p><br/><p><span style=\"\">His current partner was incredibly skilled.</span></p><br/><p><span style=\"\">Truthfully, Zeet was having a hard time believing his current situation.</span></p><br/><p><span style=\"\">If he was a normal User, he wouldn't have even offered up a 'I'm sorry'.  He would have just turned his head away, but he needed to show sincere concern for this particular partner.</span></p><br/><p><span style=\"\">In truth, Zeet had thought his partner was in the category of the unskilled Users.  The skilled Users weren’t usually interested in what he had to offer. This User seemed to operating on his own, so Zeet thought the User was like a roaming duckweed.  He thought this User was like him.</span></p><br/><p><span style=\"\">How could Zeet have guessed that this User was so skilled?</span></p><br/><p><span style=\"\">“There is one more coming.  I'll block it.  When it turns it back to you, you should immediately use your magic.” </span></p><br/><p><span style=\"\">“Understood.” </span></p><br/><p><span style=\"\">Zeet was able to move around much faster as he searched for the Blackened Remains.  It was thanks to his skilled partner.</span></p><br/><p><span style=\"\">“Be sure of yourself when you throw it. Your timing will be way off if you hesitate like that.” </span></p><br/><p><span style=\"\">“I know.  I'm sorry.  It was a mistake.” </span></p><br/><p><span style=\"\">Of course, a skilled partner would require others to be at their best, but it was something Zeet was willing to put up with.</span></p><br/><p><span style=\"\">“If the Quest is completed and the Block Field isn't dispelled, your life...” </span></p><br/><p><span style=\"\">“What? What did you just say?” </span></p><br/><p><span style=\"\">“Ah, this is just me talking to myself.  I'm just talking to myself.” </span></p><br/><p><span style=\"\">“Wasn't your words too clear for it to be you talking to yourself?” </span></p><br/><p><span style=\"\">“So are you saying you want to hold a grudge against me?” </span></p><br/><p><span style=\"\">“Ah, no.  Ah!  It's the werewolf!  I'll start my Casting!” </span></p><br/><p><span style=\"\">Sometimes his more skilled partner would joke around.  His words were frightening, but Zeet was sure they were jokes.  At the very least, Zeet decided to think of it like that.</span></p><br/><p><span style=\"\">‘He's probably joking. If he wasn't joking....’ </span></p><br/><p><span style=\"\">Zeet briefly shuddered as he saw his partner run at the Weapon Werewolf to block it.  This was how excellent his partner's skills was.  He was so skilled that Zeet had never seen his partner use his Skills even once.</span></p><br/><p><span style=\"\">He wasn't using his Skills, yet he was sufficiently skilled enough to fight off a Weapon Werewolf.  This mean his partner was an incredible expert. If one was over level 150 equipped with Unique Items, one could crush a Weapon Werewolf through one's Spec.</span></p><br/><p><span style=\"\">Anyways, Zeet had the experience of partnering up with other parties and guilds. He had partnered up with a variety of parties and Users.  He could immediately tell his current partner's skill was extraordinary.</span></p><br/><p><span style=\"\">‘This is really my last opportunity.’ </span></p><br/><p><span style=\"\">Moreover, the opportunity to work with such a skilled partner was hard to come by.  </span></p><br/><p><span style=\"\">This was why on the third day of Blackened Remains Exploration Quest, Zeet revealed the information he had been hiding.</span></p><br/><p><span style=\"\">“Shall I tell you about the Blackened Remain Quest?” </span></p><br/><p><span style=\"\">“You've been keeping your mouth shut until now.  So why are you telling me right now?” </span></p><br/><p><span style=\"\">“It just means the information I have is worth a lot.  It isn't something I would tell someone at a first meeting.” </span></p><br/><p><span style=\"\">“All right.  Tell me.” </span></p><br/><p><span style=\"\">This meant Zeet was ready to trust his partner this time, and he was showing his conviction in his desire to finish the Black Remains Quest.</span></p><br/><p><span style=\"\">“If you search for the Black Remains Quest, you'll hit on a lot of search results.  It is basically the terminus Quest one can receive at Misandra's Castle.  Still, why was no one able to solve it?  What was the reason?  The biggest reason was quite simple.  It took time to break this Quest.  Users wanted to level up and go do their Advancement.  It was more wise and profitable to focus on leveling up than the Quest.” </span></p><br/><p><span style=\"\">Zeet.</span></p><br/><p><span style=\"\">He had arrived at the Misandra's Castle when it was first released. He hadn't come here with some goal in mind. In the first place, he didn't have friends, partners, or a guild to play this game with.  He followed his feelings as he roamed  towards various locations like a floating duckweed.  He bounced around doing adventures, and he had arrived at Misandra's Castle by coincidence. </span></p><br/><p><span style=\"\">Moreover, he hadn't stayed at the Misandra's Castle with some specific goal in mind.  His level coincided with Misandra's Castle, and it was a decent place to work out of.  That was the sole reason why he stayed there.</span></p><br/><p><span style=\"\">The fun part for Zeet was the fact that he was able to acquire a variety of information as Users and groups passed through Misandra's Castle.  </span></p><br/><p><span style=\"\">This method was quite inefficient if one wanted to Level Up or Spec Up at this location.  However, it was a very effective way to acquire information.</span></p><br/><p><span style=\"\">This was why Zeet was able to gather as much information that could be used in Scenario Quests around Misandra's Castle. </span></p><br/><p><span style=\"\">\"Let's return to the topic at hand.  Beyond the Misandra's Castle, I think there might be an Event Location there.” </span></p><br/><p><span style=\"\">Zeet's partner appropriately showed interest in Zeet's words.</span></p><br/><p><span style=\"\">“What's the basis for this?” </span></p><br/><p><span style=\"\">“If you look at the NPCs at Misandra's castle, several of them have the Titles of Fugitive or Refugee.” </span></p><br/><p><span style=\"\">“So?” </span></p><br/><p><span style=\"\">“As I progressed through the Quests related to the Subjugation Association, I increased my Intimacy Level with the NPCs.  That was when I started hearing a particular expression being repeated. The most typical expression was 'Beyond there...'  Basically, they were trying to express something ominous was present beyond the mountain, where the Block Field was present.” </span></p><br/><p><span style=\"\">“Maybe, the monsters gave them the ominous feeling.” </span></p><br/><p><span style=\"\">“These are NPCs within the Subjugation Association, where the purpose of the Association was to subjugate the monsters.  If there were monsters, they would usually talk about how they would catch the monsters.  They typically don't worry about how to avoid the monsters, because of the ominous feeling they felt.” </span></p><br/><p><span style=\"\">“You are quite knowledgeable about this game.” </span></p><br/><p><span style=\"\">“Look here, man.  I spent 8 hours a day since Warlord was opened.” </span></p><br/><p><span style=\"\">“Yet you are only at that level?” </span></p><br/><p><span style=\"\">“This game is very unfair.  In truth, my situation is quite normal.  Warlord is overflowing with Scenario Quests even if we discounted the Main Scenario Quest.  Each NPC in a castle all has at least one Scenario Quest. I don't want to jump from one hunting ground to another.  Isn't it stranger to hop to another location like grasshoppers just because one wants a little bit more EXP?  What kind of game is that?  Even miners working in mines don't operate like that.” </span></p><br/><p><span style=\"\">“Continue with your story.” </span></p><br/><p><span style=\"\">“All right. I'll return to the main point. I've spoken to all the NPCs inside Misandra's Castle, and from their conversations, I've determined this might not be a Block Field.  There is a high probability that this is a barrier instead of a Block Field. There is something across it, and the barrier is to block this thing from coming to Misandra's Castle.” </span></p><br/><p><span style=\"\">“So what's the connection between the barrier and the Blackened Remains?” </span></p><br/><p><span style=\"\">“The Blackened Remains that is mentioned in the Blackened Remains Quest might be a symbolism.  Well, that part isn't that important. The important fact is that a lot of Users had tried to clear this. There was no downside in doing it. However, a lot of Users got frustrated trying to clear this quest, and no one was able to finish it.  Do you know why?” </span></p><br/><p><span style=\"\">“It was more profitable to go for the Advancement.” </span></p><br/><p><span style=\"\">Zeet had a mysterious smile on his face when he heard his partner's words.</span></p><br/><p><span style=\"\">“Think hard on it. Quite a lot of resolute users have tried this search.  Let me simplify it for you.  Weren’t the Users trying to hunting, and conduct the search at the same time?  This was what had happened.  Naturally, the searches near level 90 monsters happened more frequently than other location. In other words…….” </span></p><br/><p><span style=\"\">“Not many people searched the low level hunting grounds.” </span></p><br/><p><span style=\"\">“Yes.  That was their blind spot. There are hunting grounds around here where low level monsters appear.  However, no one would concentrate on those hunting grounds.  What crazy low level Users would come to a place that's considered to be the last stop on a Quest?” </span></p><br/><p><span style=\"\">Zeet's eyes shone as he spoke.</span></p><br/><p><span style=\"\">This was the background information on why Zeet had been obsessed with this Quest, and it was also the reason why he was so sure he could clear the Blackened Remains Quest. </span></p><br/><p><span style=\"\">At the same time, he had never told anyone about this truth.  In truth, if he told someone else about this, other would have cleared the Quest instead of him. Moreover, if someone posted this online, the person would probably get praised online.</span></p><br/><p><span style=\"\">However, that would be the end of that.</span></p><br/><p><span style=\"\">Zeet wanted to be the main character in this story.</span></p><br/><p><span style=\"\">Moreover, he hadn't met a partner, who actually wanted to help him.  This was why he never spoke what was inside his heart.</span></p><br/><p><span style=\"\">Truthfully, Zeet wanted to be a protagonist for this particular Quest.  As he had told his partner, he had played this game for a long time.  He wanted to leave an achievement that was all his own. He would feel a little bit of return for the amount of money and time he had invested in this game.</span></p><br/><p><span style=\"\">During all that time, there were only a handful of people, who even wanted to listen to his offer.  Amongst all of them, this was the first time he had a partner, who would follow his instructions for 3 days.  It didn't matter how much he complained.</span></p><br/><p><span style=\"\">“Therefore, if we move to the locations where there are low level monsters, we might find it.” </span></p><br/><p><span style=\"\">“Correct!” </span></p><br/><p><span style=\"\">This was why Zeet was thankful. It was good fortune that he had met a good partner.  Although, he didn't look to have a good personality.</span></p><br/><p><span style=\"\">“Be happy.  This is the first time I've revealed this information to anyone else.” </span></p><br/><p><span style=\"\">His partner smiled for the first time at Zeet's words.  It made him feel a sense of deja vu as if he had seen that smile from some video before.</span></p><br/><p><span style=\"\">This was a hunting ground where a monster slightly above level 60 appeared.  The Sick Werewolf appeared here.</span></p><br/><p><span style=\"\">This hunting ground was located a bit farther away from Misandra's Castle, so it wasn't that popular. The biggest problem was the fact that one would have to get past a hunting ground filled with level 80 monsters to reach this place.</span></p><br/><p><span style=\"\">Moreover, the adjacent hunting grounds all had monsters that exceeded level 80.  </span></p><br/><p><span style=\"\">It was basically a hunting ground with mines located everyone.  It wasn't a place where one could hunt comfortably. </span></p><br/><p><span style=\"\">If it wasn't for that reason, it was actually a nice hunting ground where there were no competitors.</span></p><br/><p><span style=\"\">The Swing Guild had members of diverse levels.  To help the low level guild members, it wasn't strange for them to come hunt at locations where the Sick Werewolves appeared.</span></p><br/><p><span style=\"\">“What are you doing here, Zeet?” </span></p><br/><p><span style=\"\">If Zeet hadn't shown up with a new partner, there wouldn't have been any problems.</span></p><br/><p><span style=\"\">“I'm just passing by.  I'm passing through here.” </span></p><br/><p><span style=\"\">Zeet saw six guild members.  It was a party with 2 women and four men.  Within the game, he felt a chill run up his spine when he saw the group.</span></p><br/><p><span style=\"\">His first thoughts was 'Why were these Users here in the first place?'  Moreover, he never expected it to be the Swing guild.</span></p><br/><p><span style=\"\">On the other side, the Swing guild considered this to be a pretty good opportunity.</span></p><br/><p><span style=\"\">Users, who had spent a decent amount of time at Misandra's Castle, all knew Zeet had put in a lot of effort in trying to progress in the Blackened Remains Quest.  </span></p><br/><p><span style=\"\">The Swing Guild members were all thinking along the same line. </span></p><br/><p><span style=\"\">‘Is the Blackened Remains here?’ </span></p><br/><p><span style=\"\">This was why Zeet was taken aback.  In truth, he had been afraid of this happening.  This was why he hadn't come here even if he suspected this was the location.</span></p><br/><p><span style=\"\">‘Shit. I had to run into the Swing Guild, of all the people.....’ </span></p><br/><p><span style=\"\">If the Swing Guild realized what was going on, they wouldn't let Zeet go easily.</span></p><br/><p><span style=\"\">“You are just passing through? Who gave you permission to be able to pass through here? This place is within our guild's jurisdiction.” </span></p><br/><p><span style=\"\">When he heard those words, Zeet immediately knew what the Swing guild members were thinking.</span></p><br/><p><span style=\"\">‘These bastards have a rough idea of what going on.  It was inevitable.  Those bastards were always interested in every one of my moves.’ </span></p><br/><p><span style=\"\">They wouldn’t easily believe his words.</span></p><br/><p><span style=\"\">“Why are you barking out nonsense? No guild can block someone from passing through a field.  Even the 30 great guilds don’t act that way!” </span></p><br/><p><span style=\"\">“I don't care if normal Users pass through here.  However, you have an account to settle with our guild.” </span></p><br/><p><span style=\"\">“What account?” </span></p><br/><p><span style=\"\">“One of our guild member suffered Game Over because of you.  Of course, you have to settle that account.” </span></p><br/><p><span style=\"\">There were two reasons why the Swing Guild had done nothing to Zeet.  They had watched him, while they grinded their teeth.</span></p><br/><p><span style=\"\">First, they weren't allowed to PK within the castle grounds. PK was possible, but they would be cussed out by everyone for carrying it out.</span></p><br/><p><span style=\"\">It was possible to do it outside in the fields, but Zeet always moved with a new party.  He wasn’t officially affiliated with any groups.  If they attacked Zeet, they would basically be attacking the party he was in.  This was why the Swing Guild held back from carrying out their revenge.</span></p><br/><p><span style=\"\">“Are  you trying to kill me?  Is that what you are trying to do?” </span></p><br/><p><span style=\"\">“No way.” </span></p><br/><p><span style=\"\">It was the truth.  They had no plans on killing Zeet.  It might make them feel better to just kill him, but not every answer to a problem was to kill the other User.</span></p><br/><p><span style=\"\">“We aren't a PK guild.” </span></p><br/><p><span style=\"\">The Swing guild wasn't a 'bad manners guild', and they were absolutely not a PK guild.</span></p><br/><p><span style=\"\">“We just want your sincere apology, and a promise of a compensation.  That is all we want.” </span></p><br/><p><span style=\"\">“I didn't even kill him that time!  He got killed by a monster!” </span></p><br/><p><span style=\"\">As the one suffering this indignity, Zeet thought their actions were ridiculous.  Of course, he hadn't behaved well at the time, but he never had any ill intent. It had been an accident.  That should be all there was to it.  They shouldn’t take revenge on him, because of an accident.  </span></p><br/><p><span style=\"\">When Zeet raised his voice, the Swing guild members immediately hardened their expressions.</span></p><br/><p><span style=\"\">“What's going on?” </span></p><br/><p><span style=\"\">“Who's that person?  Why are you guys fighting?\" </span></p><br/><p><span style=\"\">The two women in the party reacted in an odd way.  They reacted as if they didn't know what was going on.  Also, one could tell they were getting annoyed by the situation.</span></p><br/><p><span style=\"\">In truth, the four men had mobilized to help the two ladies level up.  This was a low level hunting ground for this two women!  It was a romantic gesture inside the game.  From the view of a third party, these Users were desperately trying to get a date even if it was within a virtual reality.  </span></p><br/><p><span style=\"\">Anyways, these four Users were trying to be looked favorably by these two women, so they couldn't avoid this confrontation.  Moreover, this was a four vs two fight.</span></p><br/><p><span style=\"\">‘Should we fight them?’ </span></p><br/><p><span style=\"\">‘Zeet is a scrub.  However, the remaining User...  At a glance, he doesn't look like much.’ </span></p><br/><p><span style=\"\">‘If we fight, we'll most definitely win. It isn't as if they have a priest.  Isn't it just a 2 man party?’ </span></p><br/><p><span style=\"\">The result of the fight was clear.  At the very least, it looked obvious to Zeet and the Swing Guild Members.</span></p><br/><p><span style=\"\">Zeet gritted his teeth.</span></p><br/><p><span style=\"\">“How much do you want?” </span></p><br/><p><span style=\"\">This was the worst case scenario for Zeet.  If he suffered a Game Over and the Swing guild used the clues gather from his movements, they might clear the Blackened Remains Quest.  His number one priority was to survive this encounter.</span></p><br/><p><span style=\"\">“One thousand gold should be enough.” </span></p><br/><p><span style=\"\">“Crazy bastards.” </span></p><br/><p><span style=\"\">An immediate answer was given at that moment.  It hadn't come out from Zeet's mouth.  It was Zeet's partner, who had spoken.</span></p><br/><p><span style=\"\">‘Huh?’ </span></p><br/><p><span style=\"\">Zeet tilted his head in confusion.</span></p><br/><p><span style=\"\">“Uh?” </span></p><br/><p><span style=\"\">“What?” </span></p><br/><p><span style=\"\">The Swing guild members also tilted their head in confusion.</span></p><br/><p><span style=\"\">Everyone looked at Zeet's partner. He didn't look like someone, who would spit out those words, 'Crazy bastards.' </span></p><br/><p><span style=\"\">It was quite the opposite.  He looked like a pushover, who would  tremble in fear if one yelled, 'Hey!', in a mean way.</span></p><br/><p><span style=\"\">Everyone was dazed as they stood still for a brief moment.</span></p><br/><p><span style=\"\">Zeet's partner raised his voice.</span></p><br/><p><span style=\"\">“It isn't as if you guys discovered Misandra's castle, yet you are claiming ownership of a hunting ground?  Crazy bastards. I was going to tolerate it, and let it pass, but this is bullshit. If you continue to insist on this bullshit, you guys are sick.” </span></p><br/><p><span style=\"\">“Who the hell are you?” </span></p><br/><p><span style=\"\">“Me? Will you know me if I inform you?  Do you want my character name, real name, home address, birthplace, and birthday?  Will you be able to know who I am?” </span></p><br/><p><span style=\"\">“……are you trying to pick a fight with me?” </span></p><br/><p><span style=\"\">“Pick a fight with you?  Shall we go repeat what was said a moment ago?  Shall we go poll, who people think started this quarrel?  Do you want to bet 10 thousand gold on it?” </span></p><br/><p><span style=\"\">The members of the Swing guild closed their mouth tight.</span></p><br/><p><span style=\"\">It wasn't as if what Zeet's partner had said was wrong. If one put aside their grudge, the Swing Guild was basically using their superior number to bully Users. This was the truth.</span></p><br/><p><span style=\"\">The only reason why they got away with it was the fact that strength was the law here.  If this happened in real life, people would have already reported them to the police.</span></p><br/><p><span style=\"\">In other words, Swing guild still held the power here.  There was no reason why they should close their mouth and tamp down their anger.</span></p><br/><p><span style=\"\">‘Son of a bitch.’ </span></p><br/><p><span style=\"\">‘Ellie and Yoz is watching us right now.  This is a bit embarrassing...’ </span></p><br/><p><span style=\"\">Viol, who possessed the highest level, moved.  He had already reached level 102.</span></p><br/><p><span style=\"\">“You are a third party, yet you are inserting yourself into a matter between Zeet and our guild.... How interesting.” </span></p><br/><p><span style=\"\">In truth, Viol was a User that shouldn't be present here.  He was here to celebrate his Advancement.  He was here to help the low level Users, while he impressed others with the Skills he had earned from his Advancement.  He had come here to show off.  If he was being a little bit more truthful, he had come here, since he had a strong interest in the female User named Ellie.</span></p><br/><p><span style=\"\">“If you are trying to pick a fight, you should be more clear about it. Put up your sword.  Let's do a 1on1 battle.” </span></p><br/><p><span style=\"\">“What are we betting on the match?” </span></p><br/><p><span style=\"\">“Let's put our wrist on the line.” </span></p><br/><p><span style=\"\">Zeet's expression harden at Viol's confident manner.</span></p><br/><p><span style=\"\">‘Don't do it.  That bastard already went through his Advancement!’ </span></p><br/><p><span style=\"\">On the other hand, Zeet's partner smiled.</span></p><br/><p><span style=\"\">“All right.  I'll accept the terms.  If I can't take you down within 3 minutes, I'll work like a dog under the Swing guild for the rest of my life.” </span></p><br/><p><span style=\"\">Viol kept his emotion in check when he heard the other User's provocation. This caused him to speak in a way he normally wouldn't.</span></p><br/><p><span style=\"\">“We aren't an inferior guild where a bastard like you can just join.” </span></p><br/><p><span style=\"\">Viol was markedly different from Zeet's partner, who had on a plain Item setting.  As befitting a User, who went through Advancement, he had a fairly robust Item setting.  Viol looked the part as he tried to act like a gentleman.  He also had his helm off. The fact that his face was exposed  meant that he was confident.</span></p><br/><p><span style=\"\">“If a certain crazy bitch heard your words, she would have killed you.” </span></p><br/><p><span style=\"\">“What?” </span></p><br/><p><span style=\"\">“Wait a moment.” </span></p><br/><p><span style=\"\">With those words, Zeet's partner bent as if he was picking up something from the floor.  When Zeet's partner stood back up, he immediately rushed toward Viol.</span></p><br/><p><span style=\"\">Kah-ahng! </span></p><br/><p><span style=\"\">The sound of two swords clashing rang out. Viol didn't even have the opportunity to let out an urgent shout.</span></p><br/><p><span style=\"\">Poo-hwaht! </span></p><br/><p><span style=\"\">At the same time, Zeet's partner threw the sand he was holding in his hand towards Viol's eyes.</span></p><br/><p><span style=\"\">Since he wasn't wearing his helm, the sand hit Viol's eyes.</span></p><br/><p><span style=\"\">“W...what the hell?” </span></p><br/><p><span style=\"\">Viol was taken aback.</span></p><br/><p><span style=\"\">Zeet's partner planted his sword between Viol's eyes.</span></p><br/><p><span style=\"\">“Kyahhhk!” </span></p><br/><p><span style=\"\">It was a more frightening scene for those watching more so than the actual User, who had suffered the attack.</span></p><br/><p><span style=\"\">This was how the battle with Viol ended.  Viol was in a Blind state as he struggled.  Zeet's partner tripped him, then he pushed his foot down hard on Viol's chest.  Viol wasn't fully sure what was going on, but he understood he had been overcome. When he had come to this realization, Viol stilled.</span></p><br/><p><span style=\"\">“This is the end to the 1on1 battle.  I won't confirm my kill, so you can leave after you give me your watch.  What about the rest of you?  Ah, you can walk past this place.  However, you will have to give a toll fee of 100 gold.  Unlike someone else here, I'm giving you guys a very conscientious price.” </span></p><br/><p><span style=\"\">Of course, the situation wasn't' resolved yet.</span></p><br/><p><span style=\"\">The remaining three members raised their weapons.  It seemed they weren't willing to pay the toll fee, and walk away from this.</span></p><br/><p><span style=\"\">Zeet's partner looked at his opponents, then he spoke to Zeet.</span></p><br/><p><span style=\"\">“Hey, Zeet.  If these guys try to get their revenge on you on a later date, it isn't my fault.  You agree, right?”</span></p><br/>\n</div>"}