{"title": "Chapter 110 - How Much? (2)", "id": 110, "volume": 2, "url": "http://boxnovel.org/emperor-of-solo-play-chapter-110-how-much-2", "volume_title": "Volume 2", "body": "<h1>Chapter 110 - How Much? (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span style=\"\">Chapter 110 - How Much? (2)</span></p><br/><p><span style=\"\">When a User achieves great success in Warlord, everyone starts to comment on the reasons behind the User's success.</span></p><br/><p><span style=\"\">One of the reasons behind the success was attributed to the excellent AI making up Warlord.</span></p><br/><p><span style=\"\">This was why the Users paid much more attention to the NPCs in Warlord compared to the NPCs of other games.  Of course, it wasn't as if all the NPCs were popular.  If an NPC wanted to be popular, one had two fulfill one of the two requirements.</span></p><br/><p><span style=\"\">The NPC had to be either a beautiful woman or a handsome man.  If not, the NPC had to  have a habit of giving out good Items.</span></p><br/><p><span style=\"\">From that perspective, Ahimbree's massive popularity was inevitable.  Ahimbree was an NPC that gave Items that was beyond good.  It was downright amazing.</span></p><br/><p><span style=\"\">Moreover, a User named Cocomo had obtained Ahimbree's Disciple title, and it seemed he had been short on money.  He sold information regarding Ahimbree, which had never been disseminated before. This drove Ahimbree's popularity into a pitched fever.  Numerous Users attempted to become Ahimbree's Disciple.</span></p><br/><p><span style=\"\">At that point, the much praised AI system of Warlord did something very wise.  There were too many Users visiting Ahimbree, so Ahimbree's residence was moved.</span></p><br/><p><span style=\"\">This was to Hyrkan's benefit as there weren't many obstacles when he tried to meet Ahimbree.</span></p><br/><p><span style=\"\">‘Shit.  If he was going to move, he should have moved up north.  Why the hell did he move to the south?’ </span></p><br/><p><span style=\"\">Of course, Hyrkan had been working in the North, so he had to spend a good amount of time traveling towards the south.  However, this was a very minor problem.</span></p><br/><p><span style=\"\">The usual office that had always greeted Hyrkan was gone.  </span></p><br/><p><span style=\"\">“Welcome.” </span></p><br/><p><span style=\"\">“……your room is very clean.” </span></p><br/><p><span style=\"\">The books that had been strewn about… </span></p><br/><p><span style=\"\">Unlike his previous office where the expensive Skill books had coated the floor, his current office was very clean.  It was hard to find any books or even a whiff of paper inside the room. </span></p><br/><p><span style=\"\">One would  never expect to feel a sense of unease when confronted with a clean room.</span></p><br/><p><span style=\"\">However, Hyrkan felt uneasy.</span></p><br/><p><span style=\"\">‘The mood is strangely cool.’ </span></p><br/><p><span style=\"\">He had come here expecting to receive a delicious treat.  Instead of a treat, he was worried he might have wasted his time coming here. </span></p><br/><p><span style=\"\">‘Eh-ee.  At the very least, he'll still probably give me a Skill.  It isn't as if he would only give a Skill book only if the Skill books were strewn across the floor.’ </span></p><br/><p><span style=\"\">He tried very hard to push down his anxiety, and Hyrkan greeted Ahimbree.</span></p><br/><p><span style=\"\">“How's your health and peace of mind, teacher?” </span></p><br/><p><span style=\"\">He used respectful words that he had utter to his parents before. Hyrkan looked very respectful. </span></p><br/><p><span style=\"\">However, Ahimbree didn't answer immediately.  The NPC kept staring at Hyrkan. It looked like Ahimbree was affected by a system freeze, but the manual explicitly stated that such a scenario wasn’t possible.  This meant it was really having a hard time answering Hyrkan's question. It meant Hyrkan's action had stumped the outstanding AI. The AI was at a loss for words at Hyrkan's absurd action.</span></p><br/><p><span style=\"\">Ahimbree opened his mouth after more time had passed.</span></p><br/><p><span style=\"\">“I've been well.  How have you been?” </span></p><br/><p><span style=\"\">“I've had a lot on my plate, so I've been busy.” </span></p><br/><p><span style=\"\">“I'm sure your hands were full.  Did you perhaps learn of any important information?” </span></p><br/><p><span style=\"\">Hyrkan was a bit worried at the question.</span></p><br/><p><span style=\"\">‘Is he fishing for something or is this just a straightforward question?  Is he testing the water with me?’ </span></p><br/><p><span style=\"\">Ahimbree knew Hyrkan was carrying out activities as a member of the Secret Society.  This question was probably  intended to ask about his activities related to the Secret Society.  Moreover, Hyrkan had gained an important information recently.  He had sufficient information where he could cast suspicion on Prince Dean.</span></p><br/><p><span style=\"\">If he continued this conversation with Ahimbree by telling him about the Trigon Emblem, it might be a key to opening a hidden quest.</span></p><br/><p><span style=\"\">On the other hand, he remembered the Maeung's warning.  Maeung told him to tell this information to no one.</span></p><br/><p><span style=\"\">After coming to a surprisingly difficult decision, he decided to keep his mouth shut.</span></p><br/><p><span style=\"\">“I'm still investigating.  Unfortunately, I'm lacking in ability, so it is unfortunate that I can't be of bigger help.” </span></p><br/><p><span style=\"\">“I heard about your accomplishments from Bagel. I also hear a lot of praise about you.  If we have 100 men like you, we could clear the lands across the Terube Castle walls.  We’ll be able to immediately occupy the lands.  He wants to introduce you to Prince Dean as soon as possible.” </span></p><br/><p><span style=\"\">Bagel. </span></p><br/><p><span style=\"\">As the administrator of the Terube Castle wall, it seemed the NPC had taken a liking to Hyrkan. As someone who serves under Prince Dean as his lord, this was the highest compliment that could be given to Hyrkan.</span></p><br/><p><span style=\"\">Of course, he knew Prince Dean's real identity, so Hyrkan could only put on an awkward smile.</span></p><br/><p><span style=\"\">“Thank you.” </span></p><br/><p><span style=\"\">Hyrkan calmly ended this particular thread of conversation with a single phrase.</span></p><br/><p><span style=\"\">“So why did you come looking for me?” </span></p><br/><p><span style=\"\">Ahimbree started the conversation in earnest.  Hyrkan didn't hide anything.  He spoke immediately.</span></p><br/><p><span style=\"\">“I'm unable to carry out the Secret Society's missions with my current level of ability. As you have done for me before, please provide me an opportunity and a stage.” </span></p><br/><p><span style=\"\">Ahimbree stared at Hyrkan when it heard his words. It was an NPC, but the light in its eyes was really strange.  It really felt as if an incredible sage was seeing into Hyrkan's heart.  It almost made him believe that it wasn't an NPC. </span></p><br/><p><span style=\"\">However, Hyrkan didn't turn away from the gaze. The saving of one's face and sense of shame...  Those words weren't in Hyrkan's dictionary.  </span></p><br/><p><span style=\"\">Its gaze gave him goosebumps.</span></p><br/><p><span style=\"\">Ahimbree stared into Hyrkan's eyes as it spoke.</span></p><br/><p><span style=\"\">“You are already plenty strong.  I cannot do anything for you. Moreover, don't you already know about the methods to become stronger?” </span></p><br/><p><span style=\"\">Its words were dressed up adequately, but in the end, it meant it couldn't provide a stage like the Battlefield from before.  It basically meant Hyrkan couldn't suck out any honey here from Ahimbree.</span></p><br/><p><span style=\"\">“I want to learn a new magic.” </span></p><br/><p><span style=\"\">Hyrkan immediately gave a straightforward comment. Even if Ahimbree had sent him to a stage like the Battlefield, Hyrkan wouldn't have gone.</span></p><br/><p><span style=\"\">“Magic isn't something that is easily earned.”  </span></p><br/><p><span style=\"\">“If I wanted to take the easy road, I wouldn't have come here. Please you can give me any trials and tribulations!” </span></p><br/><p><span style=\"\">Hyrkan spoke in a sincere tone.</span></p><br/><p><span style=\"\">Of course, his inner thoughts differed from his tone.</span></p><br/><p><span style=\"\">‘Please give me an easy one.  I want the really easy task.  Please.’ </span></p><br/><p><span style=\"\">Warlord's difficulty was almost limitless.  In Warlord, an NPC of Ahimbree's stature could give really difficult Quests.  Those were the ones that Users didn't even bother completing.</span></p><br/><p><span style=\"\">“You should search out the Magician's Tower. It would be better for you to ask them for help instead of me.” </span></p><br/><p><span style=\"\">Ahimbree once again expressed words that rejected Hyrkan.  Maybe this was to be expected. It would be absurd to expect a free Skill at this point in the game.</span></p><br/><p><span style=\"\">‘Yes, this is the right answer.’ </span></p><br/><p><span style=\"\">In the end, Hyrkan had to accept it.</span></p><br/><p><span style=\"\">‘Everything was going so well for so long that I lost myself for a moment. It was stupid of me to come here.’ </span></p><br/><p><span style=\"\">The problem lay with him.  He was the one who had come searching for the easiest and most obvious answer in Ahimbree.</span></p><br/><p><span style=\"\">At that moment, Ahimbree continued to speak.</span></p><br/><p><span style=\"\">“If you give a big contribution to the Magician's Tower, the Magician's Tower will surely give you a  recompense.” </span></p><br/><p><span style=\"\">‘Huh?’ </span></p><br/><p><span style=\"\">For a brief moment, Hyrkan combed through his memory. It felt as if he had heard about something similiar to this before.</span></p><br/><p><span style=\"\">However, Ahimbree gave a clearer explanation before Hyrkan could search through his memories.</span></p><br/><p><span style=\"\">“The Magician's Tower always needs a lot of help.  They need testing ingredients and other various needs.” </span></p><br/><p><span style=\"\">‘Will you look at this?’ </span></p><br/><p><span style=\"\">Hyrkan let out a yell of delight inside his heart.  Ahimbree couldn't directly give him a skill, but it seemed he'll be able to earn a Skill book from the Magician's Tower.  From Hyrkan's perspective, he didn't care where he got the Skill book.</span></p><br/><p><span style=\"\">“Of course, their biggest need is operational funds.” </span></p><br/><p><span style=\"\">“What?” </span></p><br/><p><span style=\"\">At that moment, Hyrkan's expression did a 180.</span></p><br/><p><span style=\"\">‘Funds? What fund? I...it can't be true.’ </span></p><br/><p><span style=\"\">“Donation. That is the sure fire thing they want.” </span></p><br/><p><span style=\"\">“Huhk.” </span></p><br/><p><span style=\"\">From Hyrkan's mouth, the sound of him gasping was automatically let out. Ahimbree didn't even register Hyrkan's change of countenance as he continued to speak. </span></p><br/><p><span style=\"\">“I think around 100 thousand gold should be enough.  You'll be able to learn a magic befitting your level.” </span></p><br/><p><span style=\"\">“Sship? Sship? Did you just say Sship?” </span><strong>1</strong></p><br/><p><span style=\"\">His words had come out reflexively yet Ahimbree decided to react to Hyrkan's words.</span></p><br/><p><span style=\"\">“Is that a problem?” </span></p><br/><p><span style=\"\">It seemed sship had sounded like a curse word to Ahimbree.  In truth, it was a form of curse word if one considered how he was feeling.</span></p><br/><p><span style=\"\">Hyrkan quickly changed his words.</span></p><br/><p><span style=\"\">“Sship…… So you were saying Sship-mahn gold would be enough?” </span></p><br/><p><span style=\"\">“That's right. A donation of that size would be plenty enough to get what you want.” </span></p><br/><p><span style=\"\">It happened at that moment.</span></p><br/><p><span style=\"\">[The Quest 'Meaningful Donation' has started.] </span></p><br/><p><span style=\"\">The critical blow was struck when the announcement rang in his ears.</span></p><br/><p><span style=\"\">Ahn-jaehyun had a cup of water in front of him, and he had his eyes closed. Ahn-jaehyun had an outdated Tablet PC in his hand. Someone else's SNS page was open on the LCD. If one looked at the number of subscribers, it seemed the owner of the SNS page was very popular.  The owner was a handsome white man with blonde hair and blue eyes.</span></p><br/><p><span style=\"\">‘Somehow,  things always find a way to go sideways.’ </span></p><br/><p><span style=\"\">Donation Quest.</span></p><br/><p><span style=\"\">He felt a chill run up his spine from just hearing that name.</span></p><br/><p><span style=\"\">At first, Ahn-jaehyun hadn't been too worried about the quest.</span></p><br/><p><span style=\"\">In truth, he didn't even need to think on it.  It would be crazy to spend 100 thousand gold for a level 140 Skill book.  Currently, the level 160 and 170 Skill Books had been released into the market.  These Skill books were popular yet it was traded for a similar price.  So why should he spend 100 thousand gold in buying one of the skills regarding the unpopular Black Magician Body Modification Skill Tree?</span></p><br/><p><span style=\"\">Still, he researched about the skill reward as a precaution. There might be someone, who might have finished this Quest.  He decided to research into it first.</span></p><br/><p><span style=\"\">In truth, he was sure he wouldn’t find a crazy bastard, who had gone through with this Quest.</span></p><br/><p><span style=\"\">Couple million people were spending quite a lot of money to play this game, and it seemed there was a User crazy enough to torch a large sum of money on such a Quest. </span></p><br/><p><span style=\"\">‘I think I regret searching for this in the first place.’ </span></p><br/><p><span style=\"\">Woody.</span></p><br/><p><span style=\"\">He was a world famous singer and actor named Neal Whittaker.  Woody was his name in Warlord.  Amongst the worldwide celebrities, he was known to be an incredible fan of Warlord.  He had played the game since the game service started, and he had poured an incredible amount of money into the game.  However, his level was a bit low considering how much time and money he had spent in this game.  He was level 141. However, if one ranked Users on the money spent on the game, he would easily be within the top 50.  His love for Warlord was that large.</span></p><br/><p><span style=\"\">At the same time, it was a twisted form of love. Woody had so much money that it pained him to not be able to surround himself with luxury items. He acted like a rich person showing off his sports car.  He was someone who loved to boast about his unbridled spending on the SNS.</span></p><br/><p><span style=\"\">That guy had done the 100 thousand gold Donation Quest.  As a reward, he had been able to choose a level 140 Unique Skill.</span></p><br/><p><span style=\"\">At that point, Ahn-jaehyun would have just ignored this all together. Instead of buying a Skill book with a price tag of 100 thousand, it would be more advisable and healthier for him to go a hotel buffet, and leave after eating salad.</span></p><br/><p><span style=\"\">The problem was that this Donation Quest's reward didn't have a fixed reward. One could choose the reward.</span></p><br/><p><span style=\"\">Once one chose a Skill Tree, one will have an unrestricted view of the Skill Tree from level 1 to level 190.  Then it'll allow one to choose a Skill below one's level.  Since this was a level 140 Quest, the best he could choose was a level 140 Skill.</span></p><br/><p><span style=\"\">‘If I donate 100 thousand gold, I could see the little known Body Modification Skill Tree.... ’ </span></p><br/><p><span style=\"\">The key point was the fact that he'll be able to see the entire array of his choices.</span></p><br/><p><span style=\"\">This wasn't just about gaining a skill.  He would be able to find out about the entire Skill tree of his choice, and this information was a very precious information one couldn't even buy with money.</span></p><br/><p><span style=\"\">The numerous Users of this game gather fragmentary information to puzzle out the Skill Trees.  It was a hard task.  He'll be able to see such a Skill Tree for the price of 100 thousand gold, and it was well worth the price.</span></p><br/><p><span style=\"\">‘Shit.’ </span></p><br/><p><span style=\"\">This was the reason why he was agonizing over the decision.</span></p><br/><p><span style=\"\">Of course, Ahn-jaehyun's best case scenario was for another person to confirm and reveal the Body Modification Skill Tree.</span></p><br/><p><span style=\"\">That was a pipe dream.</span></p><br/><p><span style=\"\">In the first place, Warlord's magician population was highly skewed towards white magicians. Recently, the ratio had shifted towards Black Magicians by a little bit, because of the Hahoe Mask's exploit.</span></p><br/><p><span style=\"\">He had been lucky with the Curse Skill Tree, since the Curse Monks were popular.  He was able to gain enough information regarding the Curse Skill Tree.  However, this wasn't the case for the Summon Skill Tree and the Body Modification Skill Tree.</span></p><br/><p><span style=\"\">In regard to the Summon Skill Tree, even the veteran Necromancers didn't recognized the Skills used by Hyrkan.</span></p><br/><p><span style=\"\">'Our Class has that kind of Skill?'</span></p><br/><p><span style=\"\">'What's that horn growing out of the Skeleton's head, Hahoe Mask-nim?'</span></p><br/><p><span style=\"\">The Body Modification Skill Tree was something one had to be over level 100 to obtain.  This was why there weren't any information regarding this particular Skill Tree out in the open.</span></p><br/><p><span style=\"\">It was possible that there were Users, who might be aiming for a Magic Swordsman type character.   In that particular situation, the Black Magician would have to advance the Body Modification Skill Tree. Hyrkan had just found a User, who had spent 100 thousand gold to progress an unknown Quest, so it wasn’t too far-fetched to think that a Magic Swordsman was out there.</span></p><br/><p><span style=\"\">Still, there was no way that a User, who had spent 100 thousand gold to learn the Body Modification Skill Tree, would reveal this information to the public. </span></p><br/><p><span style=\"\">‘However, there is a possibility that this bastard might be selling snake oil.  Isn't he an attention whore?  If I finish the Quest and....’ </span></p><br/><p><span style=\"\">Woody hadn't revealed the Skill Tree he gained in its entirety. He wrote he would reveal additional information as his number of subscribers grew.  Currently, he had revealed Skills that most Users had already figured out.  This was why there was a chance that this might be a stunt being pulled by Woody to gain more attention.</span></p><br/><p><span style=\"\">If Woody was lying, Hyrkan might just receive a single Skill Book for 100 thousand gold.</span></p><br/><p><span style=\"\">“Hoo-ooh.” </span></p><br/><p><span style=\"\">Ahn-jaehyun finally drank the cup of water in front of him.  He downed it in one shot.</span></p><br/><p><span style=\"\">‘If this is some plot to inflate the number of subscribers, I'll kill you 100 thousand times with my bare hands, Woody.’ </span></p><br/><p><span style=\"\">He had drunk the cold water, but it was having a hard time cooling his boiling insides.</span></p><br/><p><span style=\"\"> _______________</span></p><br/><p></p><ol><br/><p></p><li style=\"font-weight: 400\"><span style=\"\">Ship-mahn = 100 thousand  Sship-pahl = curse word.  They sound phonetically the same in the beginning.  NPC thought Hyrkan was trying to curse. </span></li><br/><p></p></ol><br/>\n</div>"}