{"title": "Chapter 121 - Bad Ending? (2)", "id": 121, "volume": 2, "url": "http://boxnovel.org/emperor-of-solo-play-chapter-121-bad-ending-2", "volume_title": "Volume 2", "body": "<h1>Chapter 121 - Bad Ending? (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span style=\"\">Chapter 121 - Bad Ending? (2)</span></p><br/><p>5.</p><br/><p><span style=\"\">- Another castle fell.  What number is that one?</span></p><br/><p><span style=\"\">- I don't care.  It is already in ruins.  No matter what we do there isn't an answer.  This great battle is a bug! </span></p><br/><p><span style=\"\">- I feel the same way. The great battle is a completely trash of a quest.  The difficulty is too high!</span></p><br/><p><span style=\"\">It was the 10 days after the great battle had started.</span></p><br/><p><span style=\"\">Everyone thought the great battle would be a festival, but it had been a complete disaster from the start. This situation was akin to a drunk host showing up at a much anticipated party.  Moreover, as the host was carrying out his duties, he threw up.  This was that level of a disaster.  </span></p><br/><p><span style=\"\">Every one of the battles fought by the Users had resulted in a defeat.  The results were so sorry that it was hard to call it a war between the Users and the Corrupted army.  The Users were losing in a very overwhelming fashion.</span></p><br/><p><span style=\"\">Of course, a stumble may prevent a fall.  In a war, victories and defeats were inevitable.  However, if one saw the the progress of the battles live, one wouldn't dare utter such a proverb.</span></p><br/><p><span style=\"\">- This isn't about the high difficulty.  The Users are just dumb.  Shouldn't the blame for the losses be more on the Users?</span></p><br/><p><span style=\"\">- I feel the same way.  I can overlook the fact that they aren't in sync.  However, they are fighting with allies when the enemies are right in front of them.  Their actions doesn't make any sense. This is quite a mess.</span></p><br/><p><span style=\"\">This was how underwhelming the sight of the Users fighting against the Corrupted army was.  It was well below expectation. No, this was beyond being below expectation.  It almost defied common sense.</span></p><br/><p><span style=\"\">- Mess? Maybe you should try fighting them yourself! Do you really think you'll do any better?</span></p><br/><p><span style=\"\">- You bastards don't even know how to play this game.  Why don't you guys come over and participate?</span></p><br/><p><span style=\"\">- It is a mess! The heavyweight like the Hahoe Mask is putting up a proper fight! </span></p><br/><p><span style=\"\">- Aren't the Fighters guild doing well too? Whistling Pitbull is doing especially well. He still had the skills he displayed in his earlier fame.  No, he looks to be much scarier than before.</span></p><br/><p><span style=\"\">- There is a team made by Users, and aren't they doing well?  Their name is Kiyo or whatever.  In truth, we are in this predicament, because of the regular Users.  Those who were good at this game are continuing to excel in this game.</span></p><br/><p><span style=\"\">Of course, not everyone was failing in the great battle.</span></p><br/><p><span style=\"\">Heroes always appeared in the times of turbulence.  After the initial confusion, the turbulence allowed Users to distinguish themselves. Some Users were shining brighter than ever.</span></p><br/><p><span style=\"\">- Anyways, Hahoe Mask is the best.</span></p><br/><p><span style=\"\">- I'll accept that. </span></p><br/><p><span style=\"\">Amongst the bright stars, the star called the Hahoe Mask shone the brightest.</span></p><br/><p><span style=\"\">- Even as the castle was falling, he was able to taken down several hundred monsters before he escaped.  At the very least, everyone should show that level of spirit.</span></p><br/><p><span style=\"\">- If there were 10 Hahoe Masks, there’s no way a castle would fall.</span></p><br/><p><span style=\"\">Hahoe Mask's performance was so bright that it was hard to put it into words.</span></p><br/><p><span style=\"\">Moreover, his actions were always a bit more dramatic.  He wasn't like the undisciplined mob fighting outside of the castle.  He started fighting the moment when the monsters entered the castle.</span></p><br/><p><span style=\"\">If one fought to the end, it makes one look noble.  There was an element of nobleness in the Hahoe Mask's battles.</span></p><br/><p><span style=\"\">- Why does the Hahoe Mask never fight outside?  Is he scheming something?</span></p><br/><p><span style=\"\">Of course, a portion of the viewers was suspicious as to why the Hahoe Mask hadn't fought a single battle outside of the castle.</span></p><br/><p><span style=\"\">- If it were you, do you really want to fight with such a retarded group of Users?</span></p><br/><p><span style=\"\">- If the Hahoe Mask fights outside of the castle, the Users would probably think his Skeletons are monsters.  They'll probably attack his Skeletons.</span></p><br/><p><span style=\"\">- Don't even mention the Hahoe Mask's name with those retarded group.</span></p><br/><p><span style=\"\">However, the suspicion failed to develop into a conspiracy.</span></p><br/><p><span style=\"\">In the process of all this, Hahoe Mask's worth was increasing steeply.  Hahoe Mask's youtube page had reached a plateau not too long ago.  However, the subscribers and the views on previously uploaded videos started to rise again.</span></p><br/><p><span style=\"\">The great battle was a bigger issue than most had thought it would be, and the media was in a frenzy.</span></p><br/><p><span style=\"\">“We have to get an interview with the Hahoe Mask no matter what! Get him even if we have to plaster the request all over the newspapers!” </span></p><br/><p><span style=\"\">“If you can't contact him, go into Warlord to get an interview! Hurry up!” </span></p><br/><p><span style=\"\">“We are the Warlord's top webzine. We've been chasing after an interview with the Hahoe Mask when the media wasn't even interested in him.  I won't let them steal the interview from me. I won't stand for it. Use all of your personal connections.  Get me that interview.  If you can't get an interview, you guys are going to get it from me.</span></p><br/><p><span style=\"\">It happened around that time.</span></p><br/><p><span style=\"\">Hahoe Mask's popularity was reaching an all-time high.  The media was getting ready to duke it out with each other to get ahold of the Hahoe Mask.</span></p><br/><p><span style=\"\">- Uh? What the hell is this? </span></p><br/><p><span style=\"\">“Uh? It seems the Hahoe Mask Interview isn't the important news right now.” </span></p><br/><p><span style=\"\">The interest in the Hahoe Mask disappeared as if it was a mirage.  There was another news that pushed the Hahoe Mask into the backburner.</span></p><br/><p>6.</p><br/><p><span style=\"\">[Hyrkan] </span></p><br/><p><span style=\"\">- Level : 165 </span></p><br/><p><span style=\"\">- Title : 132 </span></p><br/><p><span style=\"\">- Stats : Strength(1885)/Stamina(929)/Intelligence(1121)/Magic Power(1355) </span></p><br/><p><span style=\"\">‘The bonus EXP from the great battle is awesome.  I'm leveling up quickly.’ </span></p><br/><p><span style=\"\">As soon as he leveled up, he applied his points to his Stats.  Hyrkan quickly closed his Stat Window, and he turned his head. When he turned his head, Hyrkan's eyes took in the miserable sight of the fallen Misandra's castle</span></p><br/><p><span style=\"\">‘Tsk.’ </span></p><br/><p><span style=\"\">Hyrkan had a lot of memories regarding the Misandra's castle.  This sight made him feel saddened and frustrated.  This sight discomforted him more so than any sight he had seen recently.</span></p><br/><p><span style=\"\">‘I'm finally at this point…….’ </span></p><br/><p><span style=\"\">However, Hyrkan didn't have the luxury to sentimentalize over his memories.</span></p><br/><p><span style=\"\">‘This next part will be dangerous for the Users, who didn't participate in the great battle.’ </span></p><br/><p><span style=\"\">The advance of the Corrupted army was much faster than he had expected.</span></p><br/><p><span style=\"\">This was the reason why the User would make the rational choice. </span></p><br/><p><span style=\"\">The Users won’t be enticed by the chance to gain Items and a quick level up.  The Users will start to realize this great battle was unlike anything they encountered in terms of difficulty.  The Users would become hesitant in participating in the great war.</span></p><br/><p><span style=\"\">The Users, who wanted to fight in earnest, will try to find battlefields where their victories were assured.  This would lead the Users to flock towards the Underfoot guilds like the Fighters guild.  </span></p><br/><p><span style=\"\">On the other hand, those who didn’t want to fight would go to locations where defeat had already happened or they’ll avoid locations being organized by groups like the Underfoot guilds.</span></p><br/><p><span style=\"\">This would lead to the gap between the rich and the poor getting bigger in terms of fighting power.  The Corrupted army would attack the locations where the fighting power was poor.</span></p><br/><p><span style=\"\">‘If the castles where the low level Users get taken down... Shit.  I have no idea how everything will turn out.’ </span></p><br/><p><span style=\"\">The Corrupted army will start heading towards locations with Users under level 100.  These locations were now in the sight of the Corrupted army.  They had already attacked the Misandra’s Castle, which was a location meant for level 80 to level 100.  Misandra’s castle was the Maginot Line, and the Maginot Line had been broken. </span></p><br/><p><span style=\"\">‘This is getting dangerous.’ </span></p><br/><p><span style=\"\">Hyrkan had never thought such a situation would come to pass, and it was impossible to come up with a good plan on the spot.</span></p><br/><p><span style=\"\">‘What the hell are the 30 great guilds doing? They profited from everything they could get their hands on, yet they are acting like this!  They should spit back out everything they pocketed!’ </span></p><br/><p><span style=\"\">The only way to manage this situation was for the 30 great guilds to step in.  This was the only solution in Hyrkan's opinion.</span></p><br/><p><span style=\"\">The 30 great guilds had massive amount of forces, and they could use their live channels to mobilize the Users.  Their standing and brand amongst the Users allowed them to be able to unite the User base. This was the reason why the 30 great guilds were scary. They had a reserve of power they could tap.  The 30 great guilds were able to mobilize the Users.</span></p><br/><p><span style=\"\">Before he came to the past, Hyrkan had experienced it in his bones when those bastards tapped into the reserve.</span></p><br/><p><span style=\"\">‘They probably expressed their stance they’ll take in this situation.  Since the situation is devolving like this, they can't choose to be silent.  These bastards are all greedy, so there is no way they'll  bypass this bait.  I'm sure...’ </span></p><br/><p><span style=\"\">Hyrkan looked around his surrounding once again.  The Misandra's castle was a mess, but there weren't any monsters near him that would cause him trouble.  Hyrkan quickly searched the internet.</span></p><br/><p><span style=\"\">‘Huh? What the hell is this?’ </span></p><br/><p><span style=\"\">Fortunately, Hyrkan didn't have to search long to find what he wanted to know.</span></p><br/><p>7.</p><br/><p><span style=\"\">Che-sulyun was soaking inside her bathtub. The bathtub was filled with bubbles, yet her collarbone was visible. Her appearance was very bewitching. There was a saying that said one’s daily life was like picture in a magazine.  This saying was apt.</span></p><br/><p><span style=\"\">Her hand was poking out of the bubbles, and her hand was holding onto her slim and half-translucent smart phone.  The steam and bubble from bath didn’t allow the phone to show a clear picture, but it wasn’t that big of a deal.  Che-sulyun was able to check what she wanted to know.</span></p><br/><p><span style=\"\">She was reading an article.</span></p><br/><p><span style=\"\">[The V&amp;V guild, Rangers guild, and 8 other guilds put out a joint statement stating they won't participate in the great battle!] </span></p><br/><p><span style=\"\">[This is from the V&amp;V and Rangers guild’s statement. ‘The great battle was a stage provided for all Users to be able to participate.  If the 30 great guilds joined the festival, we’ll be ruining the festival for the Users.’] </span></p><br/><p><span style=\"\">[Will the great battle be a festival for the underdogs?] </span></p><br/><p><span style=\"\">Che-sulyun had an annoyed expression as she read the article.  She let go of the smart phone, and it dropped to the bottom of the tub. As if Che-sulyun’s body had slipped, she sank deeper into the tub.  Her collarbones had been visible before, but only her head was visible now.</span></p><br/><p><span style=\"\">‘Fucking hell.’ </span></p><br/><p><span style=\"\">Her figure was that of a goddess, yet her thoughts was very far from matching her appearance.  All kinds of cuss words were  floating around inside her head.</span></p><br/><p><span style=\"\">‘Are those bastards scheming to fuck us over?’ </span></p><br/><p><span style=\"\">A total of 9 guilds from the 30 great guilds announced that they won’t be participating in the great battle.  This included the V&amp;V guild.</span></p><br/><p><span style=\"\">The reception to the statement was very good.</span></p><br/><p><span style=\"\">- Wow! They came to a really big decision.</span></p><br/><p><span style=\"\">- Yes.  They are the 30 great guilds. They should act magnanimous like this.  The Main Scenario Quest can be carried out by everyone.  If the 30 great guilds monopolize it, wouldn’t that be too unreasonable.  I’m being honest here.</span></p><br/><p><span style=\"\">- However, look at what is happening.  Shouldn't the 30 great guilds step forward?  I don't think the Users can pull this off.</span></p><br/><p><span style=\"\">- If we fail, we fail.  It isn't as if they'll shut down the game. The important part is that the 30 great guilds won't decide our fate.  The result will created by the Users.. </span></p><br/><p><span style=\"\">There was a flow of opinions at the bottom of the article.  Even though public opinions shouldn’t be gauged by the comments below an article, positive responses were much more numerous than the negative responses.</span></p><br/><p><span style=\"\">‘Crazy bastards. I can't believe there are people who believe in their bullshit.’ </span></p><br/><p><span style=\"\">However, Che-sulyun knew the statement put out by the 9 guilds weren’t words that rose out from the bottom of their hearts.  If they really cared about the enjoyment the normal Users feel, they wouldn’t have put out a join statement.</span></p><br/><p><span style=\"\">They were people who were incapable of doing such acts. They were doing this for the benefit of the Users? The 30 great guilds were a gathering of people, who would do anything for their own profits.  As one of the Guild masters of the 30 great guilds, Che-sulyun knew her thoughts weren’t wrong.  She was sure of it.</span></p><br/><p><span style=\"\">This meant the 9 guilds had put out this joint statement, because they judged this course of action would lead to a profit for them. </span></p><br/><p><span style=\"\">‘I'm sure of it. If they are destined to become the maid of honor, they would rather spoil the whole thing.’ </span></p><br/><p><span style=\"\">Profit didn’t always have to involve gaining a material good.  If they could block someone else from gaining a profit, at times that could be a profit in itself.</span></p><br/><p><span style=\"\">This was the case right now.  The purpose behind the actions of 9 guilds were simple.  They hadn’t been able to receive the qualification to participate in the Immoral Prince Raid.  There were 3 guilds, who had gained this qualification, and they had maneuvered it so that the 3 guilds wouldn’t be able to also monopolize the great battle.</span></p><br/><p><span style=\"\">‘In the end, it happened as the Helper said it would.’ </span></p><br/><p><span style=\"\">Che-sulyun had known what the 9 guilds would do at a slightly earlier time..</span></p><br/><p><span style=\"\">Several guilds were getting ready to send out an announcement of non-participation.... </span></p><br/><p><span style=\"\">The Helpers were called when the 30 great guilds needed assistance.  These Helpers were from the Hands guild, and they were the one who had informed her of this news.</span></p><br/><p><span style=\"\">‘……Helper. Those bastards are dangerous.’ </span></p><br/><p><span style=\"\">She had found out about this news a little bit sooner than everyone.  Of course, this didn't mean she had a solution to her problem.</span></p><br/><p><span style=\"\">At that moment, Che-sulyun looked at the Hands guild in an unfavorable manner even though they had given her an important piece of news.</span></p><br/><p><span style=\"\">‘There is no way they gave me the information with good intent.  Are they planning on pitting us against each other?’ </span></p><br/><p><span style=\"\">Everything about this made her suspicious.  It got on her nerves, and she became annoyed.  The good will gesture by the Hands guild just raised Che-sulyun’s suspicion.   </span></p><br/><p><span style=\"\">In the end, Che-sulyun massaged her temples with her hands.  Everything about this business was going to cause her a headache.</span></p><br/><p><span style=\"\">It was inevitable.</span></p><br/><p><span style=\"\">‘I can’t let go of the great battle like this… However, we can’t move right now.’ </span></p><br/><p><span style=\"\">There was a crisis, yet the Stormhunters didn’t have the right to fix the problem.  Someone else would have to solve the problem for them.  A scenario that Che-sulyun detested the most was unfolding in front of her.</span></p><br/><p><span style=\"\">‘I need a justification.  I need a justification that'll allow for one of the 30 great guilds to be able to step forward.…….’ </span></p><br/><p><span style=\"\">Ahn-jaehyun was busily sorting through the articles on the internet.  He was busily gathering information, and the LCD display of the Tablet PC was smudged with his fingerprints.  Ahn-jaehyun raised the coffee cup that was placed next to him.  The coffee cup was lukewarm, but Ahn-jaehyun's hands was shaking.  It shook as if his hand was weak.</span></p><br/><p><span style=\"\">‘This is driving me nuts.’</span></p><br/><p>8.</p><br/><p><span style=\"\">Ahn-jaehyun was nervous.</span></p><br/><p><span style=\"\">Ahn-jaehyun was human.  Of course, he got nervous.  He had done many task in Warlord where he had felt nervous.  The nervousness he felt was indescribable when he fought against the Boss monsters.  When he logged off after finishing the raid,  there were times when he had goose bumps all over his body when he took off his V-Gear.</span></p><br/><p><span style=\"\">However, the nervousness he was feeling right now was a different type of nervousness.</span></p><br/><p><span style=\"\">‘If things head down this path…… I'm fucked.’ </span></p><br/><p><span style=\"\">Nine guilds announced that their guilds wouldn't participate in the great battle! </span></p><br/><p><span style=\"\">Ahn-jaehyun didn't recall this happening before.  Before Ahn-jaehyun returned to the past, the 30 great guild had all joined the great battle, and they fought alongside each other in a competitive manner.   </span></p><br/><p><span style=\"\">Of course, Ahn-jaehyun had created big commotion.  The future before he had returned to the past would be different from the future he was forging right now. A tornado on the other side of earth could be influenced by the flapping of the wings of a butterfly.  Ahn-jaehyun's activities wasn't akin to a butterfly flapping its wings.  His level of activity was like poking a beehive with a stick.</span></p><br/><p><span style=\"\">Change was inevitable.</span></p><br/><p><span style=\"\">However, the current change was very dangerous for Ahn-jaehyun.</span></p><br/><p><span style=\"\">‘If things head down this way, the Quest Routes will change.’ </span></p><br/><p><span style=\"\">Everything in Warlord was controlled by the AI.  This was the case for the Main Scenario Quests.</span></p><br/><p><span style=\"\">For example, when the Users progressed in the game, the AI used the User’s level to calculate the difficulty of the Main Scenario Quest.</span></p><br/><p><span style=\"\">Unlike his worries from before, he didn’t think the AI would allow the Corrupted Army to be able to conquer all the castles.  Or else it would result in the Immoral Prince rising to the throne.  He didn’t think the game would send out a message saying, ‘Thank you for using Warlord until now.’  </span></p><br/><p><span style=\"\">However, this might change the third Main Scenario Quest that starts after the Immoral Prince episode.  The Quest Contents and Quest Routes for the Ruined Kingdom Episode would be completely changed from what Ahn-jaehyun remembered. </span></p><br/><p><span style=\"\">‘I can’t let that happen.’ </span></p><br/><p><span style=\"\">If that happened, Ahn-jaheyun wouldn’t be able to have an active role in the Ruined Kingdom episode.</span></p><br/><p><span style=\"\">Whether he had an active role or not wasn’t the problem.  If the Immoral Prince episode was where Ahn-jaehyun caught up with the frontrunners, the Ruined Kingdom episode was the stage where he planned on leapfrogging the frontrunners.  If he had to give up that stage, it would basically mean he would be giving up on the reason why he was playing Warlord.</span></p><br/><p><span style=\"\">In the end, Ahn-jaehyun didn’t have a choice.</span></p><br/><p><span style=\"\">‘I have to use whatever means necessary to bring victory to the Users in the great battle.’ </span></p><br/><p><span style=\"\">Ultimately, the great battle couldn’t end with the Users losing.</span></p><br/><p><span style=\"\">‘If things play out this way, the game would be fine.  However, my life would meet a bad ending.’ </span></p><br/><p><span style=\"\">He had to use whatever means possible to drag the Users to victory.  However, it was absurd to expect victory in the great battle just by relying on the Users.  </span></p><br/><p><span style=\"\">In the end, there was only one method he could use.</span></p><br/><p><span style=\"\">‘……this reminds of the time when I had to hard carry the kids at the bottom in Warlord.’ </span></p><br/><p><span style=\"\">Hard Carry.</span></p><br/><p><span style=\"\">This was the only path that’ll allow him to maintain his livelihood.</span></p><br/>\n</div>"}