{"title": "Chapter 131 - On the Eve (2)", "id": 131, "volume": 2, "url": "http://boxnovel.org/emperor-of-solo-play-chapter-131-on-the-eve-2", "volume_title": "Volume 2", "body": "<h1>Chapter 131 - On the Eve (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 131 - On the Eve (2)</p><br/><p>4.</p><br/><p><span style=\"\">He filled the plain plastic bowl with the cloudy congee. Steam rose from the top. It really was apt to call it cloudy, since it was hard to find any bits of meat in it.  </span></p><br/><p><span style=\"\">Ahn-jaehyun used his spoon to stir his thick congee. Every time he stirred it steam escaped from the congee. The steam fogged up Ahn-jaehyun's glasses. Ahn-jaehyun had a sullen expression as he left the spoon in his congee, and he turned his head.</span></p><br/><p><span style=\"\">When he turned his head, Ahn-jaehyun could see the slim tablet PC across his fogged up glasses.  Ahn-jaehyun grabbed the tablet PC, and he tapped twice on the LCD screen as if he was knocking. The LCD screen glowed brightly.</span></p><br/><p><span style=\"\">[Great Battle. Eventually, it turned into their festival.] </span></p><br/><p><span style=\"\">[The new Users can't participate in the Main Scenario Quest.  Is this really ok?] </span></p><br/><p><span style=\"\">[Is an event being planned for the new Users or is it not possible to make it happen?] </span></p><br/><p><span style=\"\">The headline of the articles dropped down like a shower. It was opinion pieces from game experts regarding the great battle event.  One didn’t even need to check the content of the articles.  One could easily tell from the headlines that the opinions were very current.  Ahn-jaehyun swiped the screen.</span></p><br/><p><span style=\"\">[Red Bulls. They are opening the new era of live broadcasts.] </span></p><br/><p><span style=\"\">[Red Bulls. Thirty Thousand people purchased the Argardo Raid footage in just one day!] </span></p><br/><p><span style=\"\">[Red Bulls. Will they collaborate with the Hahoe Mask in the Immoral Prince Raid?!] </span></p><br/><p><span style=\"\">[Red bulls.  The commercial spots for the Immoral Prince Raid's live broadcast is sold out!] </span></p><br/><p><span style=\"\">When he changed the screen, the headlines once again appeared.</span></p><br/><p><span style=\"\">“Ooh ooh…….” </span></p><br/><p><span style=\"\">At that moment, a moan escaped Ahn-jaehyun's mouth. It was a sound heard when one hears about one's cousin had just bought land. Ahn-jaehyun had gained an enormous amount of profit in the great battle.</span></p><br/><p><span style=\"\">First, he gained the Crying Sword. It was a level 180 Chronicle Epic Rank Item. Currently, it was the best weapon one could find in Warlord. When talking about his gains, one couldn't forget about the Black Spot set that Argardo had worn.</span></p><br/><p><span style=\"\">He had gained two Titles that increases All Stats by 5%. Soon, he'll receive the main ingredients to the Great Battle Hero Weapon. Moreover, the Great Battle Hero Weapon became bound when manufactured, but the required main ingredients could traded. The Option of the Items weren't revealed yet, but the ingredients was already priced at hundred thousand gold. An incredible market price was set.</span></p><br/><p><span style=\"\">There were a lot of stuff he'll gain in the future. He’ll be able to get the Arbiter of Corruption Title and Arbiter of Corrupt accessories from just participating in the Immoral Prince Raid. If he was able to gain the Immoral Prince set, he would have earned everything he could in regards to the second Main Scenario Quest. </span></p><br/><p><span style=\"\">‘I did the work, yet the money was made by the cows.’ </span></p><br/><p><span style=\"\">However, Ahn-jaehyun’s profit couldn’t even be compared to the profit gained by the Red Bulls from the great battle.</span></p><br/><p><span style=\"\">At that moment, he thought about the conversation he had with Chev.  Chev had approached him with his severed left arm, and it wasn’t too hard to recall that conversation.  As Chev handed over the left arm to the Hahoe Mask, he spoke just two sentences.</span></p><br/><p><span style=\"\">“Thank  you.” </span></p><br/><p><span style=\"\">That was the first words he spoke.</span></p><br/><p><span style=\"\">“I work forward to working with you next time.” </span></p><br/><p><span style=\"\">Those words.... </span></p><br/><p><span style=\"\">Chev only said those two sentences.</span></p><br/><p><span style=\"\">At first, Hyrkan didn't understand why Chev had said those words to him. From the perspective of the Red Bulls guild, it would have been best if the Hahoe Mask barely failed the Argardo Raid at the end. Moreover, the Items that can be earned in the Argardo Raid wasn't just any Item. It was  arguably the best Item one could possess compared to all the Items that had released up until now.</span></p><br/><p><span style=\"\">When he finally found out about how many live tickets were sold by the Red Bulls, Ahn-jaehyun felt an indescribable pain inside.  </span></p><br/><p><span style=\"\">‘Ten percent…… No, I should have at asked for 5%.’ </span></p><br/><p><span style=\"\">The live ticket for the Red Bulls' Argardo Raid was priced at 5 dollars. They had sold close to 3 million tickets. There was a consensus in opinion that the Hahoe Mask was responsible for the sale of 1 million tickets. Moreover, the Red Bulls were bringing in remarkable numbers in terms of people purchasing the paid video of the Argardo Raid. </span></p><br/><p><span style=\"\">If he was able to received 10% of the profit generated by the live tickets and the paid video...  No, even if it was the 5% Ahn-jaehyun wanted, he would have....</span></p><br/><p><span style=\"\">“I must have lost my mind.” </span></p><br/><p><span style=\"\">Ahn-jaehyun blamed himself for not being able to estimate the money that would have been generated by the Argardo Raid.</span></p><br/><p><span style=\"\">Moreover, this wasn't the end of it.  Ahn-jaehyun had also handed over all the rights to his profit from the live broadcast of the Immoral Prince Raid to the Red Bulls.</span></p><br/><p><span style=\"\">This was the reason why he was eating this cloudy congee instead of a delicious meal. He wasn't eating congee, because he was out of money.  </span></p><br/><p><span style=\"\">His insides were hurting, so he decided to heat up the congee he bought a long time ago. His insides couldn't take anything other than the congee right now.</span></p><br/><p><span style=\"\">Of course, Red Bulls' profit wasn't the only problem that was making his insides hurt. The Argardo Raid's affected him much more.  He had spent an enormous amount of capital on the battle. Various stress started to pile on each other, and at the same time, he had pushed himself to the edge for the great battle. After it was done, he unconsciously let go of the tension he had been feeling.</span></p><br/><p><span style=\"\">He was quite fortunate that his internal pain could be lesseneed by eating the congee. Since he could eat the the congee, it meant there wasn’t a hole in is Gastrointestinal walls.</span></p><br/><p><span style=\"\">‘Shit.’ </span></p><br/><p><span style=\"\">Of course, this fact didn’t give too much solace to Ahn-jaehyun.</span></p><br/><p><span style=\"\">Ahn-jaehyun was finally able to eat the congee after it cooled to a sufficient temperature. There wasn't much flavor to the congee. There was no taste, and there was no texture to it.  He had bought it in the past when the mart sold it for cheap. He had bought it as an emergency provision, so it would be strange to expect any flavor from it.</span></p><br/><p><span style=\"\">Moreover, he didn’t have the luxury to enjoy the taste of the congee. The back of his mind was full.</span></p><br/><p><span style=\"\">‘It isn't as if I can renege on the contract.’ </span></p><br/><p><span style=\"\">When he made the contract with the Red Bulls, he hadn't made a verbal contract. He had to put an electronic signature on an actual contract. It was impossible for him to renege on the contract.  Even if he did renege on the contract, Ahn-jaehyun didn't have many choices.</span></p><br/><p><span style=\"\">Let's assume he did stop cooperating with the Red Bulls. The only other guilds Ahn-jaehyun could work with was the Hydra guild and the Stormhunters guild. In the end, he would have to make similar agreements to the one he made with the Red Bulls guild.  </span></p><br/><p><span style=\"\">Eventually, he would have to make a sorry decision again.</span></p><br/><p><span style=\"\">‘This damn pride of mine.’ </span></p><br/><p><span style=\"\">Ahn-jaehyun didn't reminiscence over his past.  He was already bitter inside, and there was no reason why he should add something more bitter on top of it.</span></p><br/><p><span style=\"\">Ahn-jaehyun forced himself to think about a different subject.</span></p><br/><p><span style=\"\">‘Since it turned out this way, I'll have to eat all the benefits that could be gained from the Immoral Prince.’ </span></p><br/><p><span style=\"\">Since he had arrived up to this point, he had to gain everything that could be gained through the Immoral Prince.</span></p><br/><p><span style=\"\">The key point in the Immoral Prince Raid was that the Immoral Prince set was given to the 10 most accomplished Users. If he could gain that Item, it would basically mean he earned all the important Items he could earn.</span></p><br/><p><span style=\"\">Moreover, if he looked at his current situation, there was a very high probability that Ahn-jaehyun would gain the Immoral Prince set.</span></p><br/><p><span style=\"\">Ahn-jaehyun had displayed his battle ability in the Argardo Raid. He wouldn’t be found lacking even if he was compare to the top Strikers representing Warlord.</span></p><br/><p><span style=\"\">Moreover, the Red Bulls will put Ahn-jaehyun in the forefront from now on. The Red Bulls hadn’t officially revealed the agreement reached with Ahn-jaehyun, but they had already spread the rumors.</span></p><br/><p><span style=\"\">This was evidenced by the commercial spots for the Red Bulls’ live broadcast of the Immoral Prince Raid was sold out.</span></p><br/><p><span style=\"\">In other words, Red Bulls had to give Ahn-jaehyun the opportunity to stand in the forefront. They had no choice, but to prepare stages where Ahn-jaehyun would be able to showcase his skills.</span></p><br/><p><span style=\"\">The problem was the Immoral Prince in itself.</span></p><br/><p><span style=\"\">‘The First Kill will be impossible.’ </span></p><br/><p><span style=\"\">Five times.</span></p><br/><p><span style=\"\">Before he returned to the past, the Immoral Prince Raid failed 5 times.</span></p><br/><p><span style=\"\">The reason behind the failure was complex. The first problem was the participants of the Immoral Raid.  Ninety percent of the Users possessing the Battle Tokens were part of the 30 great guilds.  Of course, the 30 great guilds didn't collaborate with each other.  Even if they did collaborate, it was a collaboration between two guilds at most.</span></p><br/><p><span style=\"\">Also, at the time, the 30 great guilds swept through the stage of the great battle with great impunity. They had been full of confidence, and at the time, luck was very much on their side when they finished the Argardo raid without much difficulty.</span></p><br/><p><span style=\"\">This was why the 30 great guilds didn't treat the Immoral Prince as the summit of an mountain.  They looked at it as if it was a cherry placed on top of an ice cream.</span></p><br/><p><span style=\"\">The 30 great guilds couldn’t help, but underestimate the Immoral Prince.  Moreover, the eyes of the guilds had turned red from coveting the cherry.  In the end, their confidence turned into conceit, and everything turned into a mess.</span></p><br/><p><span style=\"\">‘A failed Raid means annihilation.’ </span></p><br/><p><span style=\"\">On top of it all, when one failed at the Immoral Raid, the entire group that had participated was annihilated. The stage of the Immoral Prince was fought like an Instance Dungeon, so it didn't allow for any retreat.</span></p><br/><p><span style=\"\">So what would happen this time around? </span></p><br/><p><span style=\"\">‘The current situation is better, but…….’ </span></p><br/><p><span style=\"\">The situation before he returned to the past and the current events were very different. No one was underestimating the Immoral prince right now. However, this didn’t guarantee that the 3 guilds with the most Battle Tokens would cooperate with each other. Ahn-jaehyun didn’t know the inner workings of the 3 guilds.</span></p><br/><p><span style=\"\">In fact, even if everyone decided to cooperate, Ahn-jaehyun’s current battle ability was also important.</span></p><br/><p><span style=\"\">If Ahn-jaehyun hadn’t been successful at soloing Argardo, he would have fought as is. There wouldn’t have been any basis for his worries.</span></p><br/><p><span style=\"\">‘In the end, I have to look out for my own life.’ </span></p><br/><p><span style=\"\">However, he had succeeded in soloing Argardo, so his situation had changed a little bit. Ahn-jaehyun had acquired a new card.</span></p><br/><p><span style=\"\">‘My level is 173 right now.’ </span></p><br/><p><span style=\"\">Once he reached level 180, he would equip the Crying Sword and the Dark Spot set. Moreover, it wouldn’t be of much help in the Immoral Prince Raid, but he would gain the Fire Golem Skill when he reached level 180.</span></p><br/><p><span style=\"\">Basically, if he was able to raise 7 levels, his survivability and success rate in the Immoral Prince Raid would be much improved. It would drastically increase his chance of getting the Immoral Prince set. Of course, the rest of the members with the Battle Tokens wouldn’t wait for Ahn-jaehyun to better himself for his own profit.</span></p><br/><p><span style=\"\">‘Hmmm.’ </span></p><br/><p><span style=\"\">At that moment, Ahn-jaehyun's expression changed. The congee hadn't helped, but another thought allowed him to put a relaxed expression on his face. </span></p><br/><p><span style=\"\">‘If the Red Bulls pull out, the probability of the other two guilds cooperating will decrease. The Red Bulls guild is currently advertising their live broadcast through my fame. It is unlikely they’ll do the Raid until I step forward. Uh?’ </span></p><br/><p><span style=\"\">At that moment, he recalled something. Ahn-jaehyun quickly used his tablet PC to bring up his contract with the Red bulls. The content of the contract wasn't overly complicated. It only spelled out the important points.</span></p><br/><p><span style=\"\">‘Would you look at this?’ </span></p><br/><p><span style=\"\">This was why it didn't specify when he had to participate in the Immoral Prince Raid. There was no provision included in there.</span></p><br/><p><span style=\"\">At that moment, a smile formed on Ahn-jaehyun's lips.</span></p><br/><p><span style=\"\">‘Shall I get on an express bus?’ </span></p><br/><p><span style=\"\">At the same time, Ahn-jaehyun furrowed his brows.</span></p><br/><p><span style=\"\">‘Why is this congee so tasteless? It’s suppose to be beef congee, yet why don't I see the beef?’ </span></p><br/><p><span style=\"\">Ahn-jaehyun finally could taste the congee.</span></p><br/><p>5.</p><br/><p><span style=\"\">The pub was very popular in Warlord. First, one could enjoy the unique taste of very cheap food and alcohol. One could drink as many alcoholic beverage, yet one will never get a hangover.  Of course, one couldn't get drunk too.</span></p><br/><p><span style=\"\">This was the reason why two Users were having a conversation with Melon Beer in front of them.</span></p><br/><p><span style=\"\">“What do you think will happen from here on out?” </span></p><br/><p><span style=\"\">“What are you talking about?” </span></p><br/><p><span style=\"\">No one was paying any interest to the conversation between the two. They weren't anything special. Their faces weren't that of famous Users. Moreover, the scene they were creating wasn't that special of a sight.</span></p><br/><p><span style=\"\">Of course, if their levels were shown above their heads, they wouldn’t be able have a conversation in the pub, since an avalanche of gazes and interests would be focused on them. They wouldn’t have even been able to enter the pub.</span></p><br/><p><span style=\"\">Sinclair and Horus was part of the Hands guilds. If you combined their levels, they were easily above level 400.</span></p><br/><p><span style=\"\">Of course, this didn't mean high level Users didn't have any worries.</span></p><br/><p><span style=\"\">“I think we were wrong to buy more time. Our plans went sideways.” </span></p><br/><p><span style=\"\">Sinclair frowned. It wasn't a frivolous worry. He was speaking a genuine worry. </span></p><br/><p><span style=\"\">This was why Horus seriously listened to Sinclair's worries.</span></p><br/><p><span style=\"\">“I wouldn't say it went sideways. It just revealed our limit.” </span></p><br/><p><span style=\"\">“Limit?” </span></p><br/><p><span style=\"\">Horus avoided giving a prompt answer, so he took a deep pull from the Melon Beer. He downed the entire cup.</span></p><br/><p><span style=\"\">“It’s the limit to our method.” </span></p><br/><p><span style=\"\">“Isn’t it a bit of an overreaction to talk about our limit? In truth, if the Hahoe Mask hadn’t appeared...” </span></p><br/><p><span style=\"\">“Even if the Hahoe Mask hadn't appeared, the result wouldn't be too different from now. The Argardo Raid would have been resolved between the Red Bulls and the Storm Hunters.” </span></p><br/><p><span style=\"\">“Wasn't it because of the Hahoe Mask that the 30 great guilds participated in the great battle?” </span></p><br/><p><span style=\"\">“That is a separate issue from the Argardo Raid. Argardo Raid wasn't a defensive siege. It was a siege to take over a castle.” </span></p><br/><p><span style=\"\">Sinclair shut his mouth as he heard the other's words. It seemed Sinclair decided to keep his mouth shut regarding the issue, so he started downing his Melon Beer. </span></p><br/><p><span style=\"\">Horus didn't look at Sinclair. He looked around his surrounding. No one should know their identities, but there was no downside in being careful.</span></p><br/><p><span style=\"\">Koohng! </span></p><br/><p><span style=\"\">Eventually Sinclair lightly tapped his beer glass on the table. Horus took this as a signal, and he opened his mouth.</span></p><br/><p><span style=\"\">“In the end, we lost to the Hydra guild in terms of information gathering again. Our plan had already failed from that aspect. Moreover, aren't we pretty sure the Hydra guild won over the Red Bulls and Stormhunters to their side?” </span></p><br/><p><span style=\"\">“It isn't confirmed yet.” </span></p><br/><p><span style=\"\">“It doesn't matter if it's not confirmed. It just shows the limit to our activities. Lets just say for conversation sake that the Hydra, Red Bulls and Stormhunters are working together. Then will they have a need for the Hands?” </span></p><br/><p><span style=\"\">Sinclair shook his head from side to side.</span></p><br/><p><span style=\"\">“Then from now on…….” </span></p><br/><p><span style=\"\">“Hey, Sinclair.” </span></p><br/><p><span style=\"\">Horus cut off Sinclair's words in an instant.</span></p><br/><p><span style=\"\">“Don't you dare tell anyone that I said this. I consider you a friend first, and a fellow employee second.” </span></p><br/><p><span style=\"\">Sinclair immediately nodded his head. The two of them discreetly leaned closer to each other towards the center of the table. The distance between them decreased by a little bit. </span></p><br/><p><span style=\"\">“Soon, there will be a reorganization in our guild.” </span></p><br/><p><span style=\"\">“Reorganization?” </span></p><br/><p><span style=\"\">“Our method of operation isn't working any more. Is there a reason why we should continue as is?” </span></p><br/><p><span style=\"\">“How will it be reorganized?” </span></p><br/><p><span style=\"\">“We have to come out as a rival horse. We have to be a rival that could pull at the tail of the front-runners.” </span></p><br/><p><span style=\"\">“A rival horse?” </span></p><br/><p><span style=\"\">“I'm saying the time where we pulled the strings from background is coming to an end. I'm sure several of us are going to debut soon. No, I can already tell it will be so. If you look at our recent scope of activity, we are working more in the sunlight than the shade.” </span></p><br/><p><span style=\"\">Koong! </span></p><br/><p><span style=\"\">At that moment, Horus' fist lightly tapped the table. Sinclair slightly shrugged his shoulder.</span></p><br/><p><span style=\"\">Horus spoke in a lower voice towards the slightly surprised Sinclair.</span></p><br/><p><span style=\"\">“Our chance has finally come. In truth, the Users who are lower in level and skills are being treated like celebrities. It isn’t as if we can’t continue on like this until the game ends. Regardless of what happens, I'm heading out into the sun. That is why…… There are several of us, who share similar thoughts.” </span></p><br/><p><span style=\"\">At those words, Sinclair started to touch his lips.</span></p><br/><p><span style=\"\">“Could you tell me who they are?” </span></p><br/><p><span style=\"\">It was an attempt to keep the smile off his face.</span></p><br/>\n</div>"}