{"title": "Chapter 139 - If You Set It on Fire, Blessings Will Come Your Way (3)", "id": 139, "volume": 2, "url": "http://boxnovel.org/emperor-of-solo-play-chapter-139-if-you-set-it-on-fire-blessings-will-come-your-way-3", "volume_title": "Volume 2", "body": "<h1>Chapter 139 - If You Set It on Fire, Blessings Will Come Your Way (3)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span style=\"\">Chapter 139 - If You Set It on Fire, Blessings Will Come Your Way (3)</span></p><br/><p>8.</p><br/><p><span style=\"\">Black Cobalt Zombie Warrior.</span></p><br/><p><span style=\"\">It was a monster made from the corpse of a level 160 monster called the Black Cobalt Warrior.  It was level 170, and it was much stronger than the Black Cobalt Warrior.  The Black Cobalt Warriors liked to move in a small group of ten.  However, the Black Cobalt Zombie Warriors liked to form a group of 30 at the very least, or a group close to a 100 at the most.</span></p><br/><p><span style=\"\">This wasn’t ideal for a small party hunt.  One needed a large party or even a guild's hunt team.  One needed that level of firepower to hunt these preys.</span></p><br/><p><span style=\"\">Yet a single person had challenged such a group.</span></p><br/><p><span style=\"\">However, this single User didn't face off against the Black Cobalt Warrior Zombies by himself.</span></p><br/><p><span style=\"\">Ddul-goo-ruhk, ddul-goo-ruhk! </span></p><br/><p><span style=\"\">The fearsome Zombie army would make anyone hesitate to attack it, but the group of Skeleton Warriors were beings that had forgotten about fear.</span></p><br/><p><span style=\"\">They had formed up in three ranks.</span></p><br/><p><span style=\"\">There were 3 lines, and each line held 10 Skeleton Warriors.  Each line was differentiated by the equipments worn by the Skeleton Warriors.</span></p><br/><p><span style=\"\">The first and foremost line were lined up with Skeleton Warriors wearing pretty thick steel armors.  It was hard to even identify them as Skeleton Warriors.  They were wearing full plate armors.  They wore hefty armors, yet the weapons they were holding looked much heavier.  It was a weapon called a morning star, which had a heavy ball at the end. It also had thick spikes, which was especially impressive. </span></p><br/><p><span style=\"\">The second line wore red scaled armors, and it reminded one of Dragon Scales.  There was a round wooden shield in their left hand, and they held a very wild-looking scimitar in their right hand.</span></p><br/><p><span style=\"\">The third line of Skeleton Warriors wore leather armors.  It looked to be very well tanned.  The green colored leather was very slick.  It was quite mysterious in that the green colored leather kept blending into the surrounding vegetations.  It made their presence dim.  The Skeleton Warriors wearing the green colored leather armor didn't have any shields equipped.  Instead, both hands held various types of sword.  </span></p><br/><p><span style=\"\">As the finishing stroke to the group, two Skeleton Knights surrounded in Bone Armor stood in the front, and they looked like the eyes of a fire dragon.</span></p><br/><p><span style=\"\">There were two instead of one.</span></p><br/><p><span style=\"\">Each of the two Skeleton Knights raised swords that was overflowing with a sense of presence.  The two swords looked the same, but they differed in color.  One was pitch black, and the other was shining with light. This was the only difference between the two Skeleton Knights.  There was no difference that could be seen in what they intended to do.</span></p><br/><p><span style=\"\">The two Skeleton Knights opened their mouth, and they let out the world's most silent roar.</span></p><br/><p><span style=\"\">Ddul-goo-ruhk, ddul-goo-ruhk! </span></p><br/><p><span style=\"\">Accompanying the roar, the first, second and third line moved in order after the Skeleton Knights.</span></p><br/><p><span style=\"\">Ooh-uh-uh! Ooh-uh-uh!</span></p><br/><p><span style=\"\">However, the Zombies didn't retreat at the appearance of the Skeleton army.  When one became a Zombie, one lost all fear and rational thought.  They had no reasons to retreat. </span></p><br/><p><span style=\"\">Ddul-goo-ruhk, ddul-goo-ruhk!  </span></p><br/><p><span style=\"\">The Skeletons also didn't know fear.  The two groups were immune to fear, and they displayed their attack capabilities to their hearts content.</span></p><br/><p><span style=\"\">They didn't know what retreat was, and even if they knew what it was, it wouldn't be allowed.  The two groups clashed against each other.</span></p><br/><p><span style=\"\">The line made contact with the other line.  It was a clash between the two front lines.  There was no defense here.  The two lines rammed into each other as they attempted an all-out attack.</span></p><br/><p><span style=\"\">The weapons swung by the Black Cobalt Zombies, and the morning stars swung by the Skeleton Warriors was aimed at each other.</span></p><br/><p><span style=\"\">Their aim was the same, but the difference in result was stark.</span></p><br/><p><span style=\"\">Hoo-oohng! </span></p><br/><p><span style=\"\">The Black Cobalt Zombies swung their weapons in a wide arc, but their weapons only split empty air.  The Skeleton Warriors wearing thick plated armor was lightly dodging their attacks.</span></p><br/><p><span style=\"\">Bbi-uhk! </span></p><br/><p><span style=\"\">After they dodged the attacks, the Skeleton Warriors in the front line swung their morning stars towards the head of the Cobalt Zombies.</span></p><br/><p><span style=\"\">All ten Skeleton Warriors had been able to dodge the attacks aimed at them, and they struck out.  At the same time, they burrowed into the group of zombies. They were basically the shock troops.  They ruthlessly destroyed the nearby heads of the zombies with their morning stars.</span></p><br/><p><span style=\"\">Then the second line of Skeleton Warriors followed in behind them.  These Skeleton Warriors wore Dragon Scale armor, and they swung their scimitars.  The headless body of the Cobalt Zombies were causing a problem, so they hacked at the body of the Cobalt Zombies.  The Cobalt Zombies that were causing the disturbance was either swinging at empty air or they occasionally banged their sword against the shields. In front of the scimitar’s crescent-shaped line, the headless Cobalt Zombies lost their limbs.</span></p><br/><p><span style=\"\">When the Cobalt Zombies were mutilated, it was the third line's job to put them down for good.  They held weapons in both hands, and they were much faster than a Skeleton with only one weapon.  Before the Cobalt Zombies could regenerate, they were diced up.  The Cobalt Zombies had lost their heads and limbs, so they didn't have any methods to resist against the Skeleton Warriors equipped with two weapons.</span></p><br/><p><span style=\"\">It was a one sided battle! </span></p><br/><p><span style=\"\">In the battle, there was a mutated monster that was sending forth the Black Cobalt Zombies.</span></p><br/><p><span style=\"\">Ggoo-uh-uh! </span></p><br/><p><span style=\"\">It was twice as big as a normal Black Cobalt, and it appeared in front of the Cobalt Zombies.  It was over 3 meters tall.  It almost reached 4 meters in height, and the sword in the Cobalt Zombie's hand looked like a toy.  It was letting out a roar through its rotten vocal cords, but there was a gravitas and a powerful presence within its voice.  A horrifying dread was expressed through it.</span></p><br/><p><span style=\"\">It wasn't a being that the Skeleton Warriors could contend with.</span></p><br/><p><span style=\"\">Chul-kuhng, chul-huhng! </span></p><br/><p><span style=\"\">Of course, the Skeleton Knights stepped forward.  They were 2 meters tall, and their body was very large thanks to the armors.  Unlike the Skeleton Warriors, the Skeleton Knights appeared as they emitted a heavy sound.</span></p><br/><p><span style=\"\">Of course, size and sound wasn't the only difference between the Skeleton Knights and the Skeleton Warriors.  The way they fought battle was also different.  The Skeleton Knights didn't back down from opponents that were much bigger than them.</span></p><br/><p><span style=\"\">Hoo-oong! </span></p><br/><p><span style=\"\">They dodged attacks....</span></p><br/><p><span style=\"\">Ka-ahng!  </span></p><br/><p><span style=\"\">They blocked attacks, but they never stepped backwards.</span></p><br/><p><span style=\"\">Shweeek! </span></p><br/><p><span style=\"\">The path of their sword swings were true.  It wasn't just sharp enough to cause a superficial wound.  It went beyond cutting flesh.  The sword showed decisiveness that held the intent of obliterating the enemy's bones.</span></p><br/><p><span style=\"\">Kwah-jeek! </span></p><br/><p><span style=\"\">The number of swings were low, but the result of each swing was terrifying.  The enormous mutated Cobalt Zombie's body was being cut away by the Skeleton Knight's sword.  It was as if the Skeleton Knights were cutting a rotten daikon.</span></p><br/><p><span style=\"\">Ggoo-uh-uh! </span></p><br/><p><span style=\"\">In the end, the normal Cobalt Zombies lasted longer than the mutated Cobalt Zombie.</span></p><br/><p><span style=\"\">The anticipated card didn't perform as expected.  In terms of a battle, this battle was already lost.</span></p><br/><p><span style=\"\">However, there was no retreat for the Black Cobalt Zombies.  In fact, they charged towards their enemies.  The Cobalt Zombies were being ruthlessly cut down in the front line, and the Cobalt Zombies in the rear was now charging towards the front.</span></p><br/><p><span style=\"\">Naturally, the Black Cobalt Zombies started to get clumped up and tangled with each other.</span></p><br/><p><span style=\"\">In the midst of this clusterfuck, an enormous flame that was burning ruthlessly coalesced to form a giant.</span></p><br/><p><span style=\"\">It was the Fire Golem! </span></p><br/><p><span style=\"\">The burning giant didn't have to think about how to attack this group.  The Fire Golem belly flopped on top of the tangled Cobalt Zombie horde.  </span></p><br/><p><span style=\"\">Hwahl hwahl! </span></p><br/><p><span style=\"\">The Fire Golem's body started to burn the Cobalt Zombies.</span></p><br/><p><span style=\"\">Hwah-roo-roo! </span></p><br/><p><span style=\"\">Even as they were burning up, the Cobalt Zombies started using their swords against the Fire Golem.  Maybe this was the result of them being unable to feel pain.  Their bodies were burning, but the Fire Golem couldn't stop the sword strikes against it by the Cobalt Zombies.  The power behind the strikes remained the same as before.</span></p><br/><p><span style=\"\">Shweek, shweeek! </span></p><br/><p><span style=\"\">Parts of the Fire Golem's body was being cut away by the sword strikes.  The severed parts of the Fire Golem fell to the floor.</span></p><br/><p><span style=\"\">Kah-ahng! </span></p><br/><p><span style=\"\">The severed parts of the Fire Golem's body started to explode, and the fire became larger.</span></p><br/><p><span style=\"\">The Black Cobalt Zombies were trapped within the sea of flame, and the Skeleton Warriors continued with their slaughter.</span></p><br/><p><span style=\"\">After a brief moment, the scene of the battle started to dim.  When the whole world turned black, white letters was placed over this dark world.</span></p><br/><p><span style=\"\">[To be continued] </span></p><br/><p><span style=\"\">The footage ended there.</span></p><br/><p><span style=\"\">‘Nice.’ </span></p><br/><p><span style=\"\">The video was on full screen, so it filled the entire screen of the Tablet PC.  He exited the full screen.  Then he checked various things....  He looked at the information regarding the video, and he looked at the reaction given by the viewers.</span></p><br/><p><span style=\"\">- Two Skeleton Knights?  How?</span></p><br/><p><span style=\"\">- I thought it was only possible to summon one Skeleton Knight?</span></p><br/><p><span style=\"\">- Is it a bug?</span></p><br/><p><span style=\"\">Ahn-jaehyuhn grinned as he read their assessment.</span></p><br/><p><span style=\"\">‘It's a Skill instead of a bug.  It's a Skill.’ </span></p><br/><p><span style=\"\">Ahn-jaehyun released the new footage for free.</span></p><br/><p><span style=\"\">The video was titled Double Knights. It was the first video showing the activities of the two Skeleton Knights.</span></p><br/><p><span style=\"\">It was a mixture of the Hahoe Mask's fame, and the sensational description saying this was the first time this was being shown.  It resulted in the views skyrocketing.</span></p><br/><p><span style=\"\">In one day, he achieved 8 million views! </span></p><br/><p><span style=\"\">However, the thing that made Ahn-jaehyun happier than the view counts was the reason behind the video.  It was the [Chivalry] Skill that had allowed him to make this video.</span></p><br/><p><span style=\"\">‘As expected, this game gets fun at the latter stages.’ </span></p><br/><p><span style=\"\">When he summoned the Skeleton Knight, two special abilities were activated.</span></p><br/><p><span style=\"\">The Skeleton Knight's Stats increased proportionally to the number of Skeleton Warriors being summoned.  When the Skeleton Knights were summoned, the Leader ability increased the Stats of the Skeleton Warriors.  These were the two abilities.</span></p><br/><p><span style=\"\">However, these two abilities had a fixed value. Even as the Skeleton Knight's Skill Proficiency increased, these two skill Options didn't change.  If one wanted to change the fixed nature of these two abilities, one had two obtain two other Skills.</span></p><br/><p><span style=\"\">The [Chivalry] Skill gained by Anh-jaehyun was basically like an upgrade software.</span></p><br/><p><span style=\"\">The newly acquired [Chivalry] Skill had the following effects.</span></p><br/><p><span style=\"\">[Chivalry] </span></p><br/><p><span style=\"\">- Proficiency : Rank F</span></p><br/><p><span style=\"\">- You can summon one more Skeleton Knight.</span></p><br/><p><span style=\"\">- With the summon of the Skeleton Knight, you will be able to summon additional (3) Skeleton underlings.</span></p><br/><p><span style=\"\">- Each additional summoned Skeleton Warrior will increase the Skeleton Knight's Stats by (6) percent.  At most, it can be increased by 30%. </span></p><br/><p><span style=\"\">It increased the number of Skeleton Knights he could summon.  The Chivalry Skill increased the special abilities, and on top of it all, it allowed one to summon additional Skeleton underlings.</span></p><br/><p><span style=\"\">‘I also have to gain the [Leader] Skill, but at this current time, [Chivalry] is better than the [Leader]’ </span></p><br/><p><span style=\"\">The [Leader] Skill was similar to the [Chivalry] Skill.  It also increased the number of Skeleton Knights one could summon, and it also increased the number of Skeleton underlings too.</span></p><br/><p><span style=\"\">‘If I combine it with the [Chivalry] Skill...’ </span></p><br/><p><span style=\"\">If he could purchase the Death Knight Skill in the future, then he'll also have to gain the [Chivalric Order] Skill, which also had the effect of increasing the number of Skeleton Knights.</span></p><br/><p><span style=\"\">‘Rich Lich was able to summon four Skeleton Knights.’  </span></p><br/><p><span style=\"\">Rich Lich used this process to be able to summon four Skeleton Knights.  He bought numerous No Name Skill boost to gain the [Chivalry] and [Leader] Skills.  Then he obtained the Death Knight Skills.  He had been able to summon a total of four Death Knights.</span></p><br/><p><span style=\"\">However, it didn't end there.</span></p><br/><p><span style=\"\">‘If I can use the Ancient Power to reinforce my Skills....  How many Skeleton Knights will I be able to summon?</span></p><br/><p><span style=\"\">With the appearance of the Ruined kingdom, the new contents would be released.  One will be able to use the Ancient Power to reinforce an A Rank Skill.</span></p><br/><p><span style=\"\">Rich Lich hadn't reached this point.  He would truly be in uncharted territory.</span></p><br/><p><span style=\"\">“Hoo-ooh.” </span></p><br/><p><span style=\"\">At that part, Ahn-jaehyun let out a deep sigh.</span></p><br/><p><span style=\"\">The Hahoe Mask could still get stronger.  This was something that made him feel happy and excited.  It was something he was looking forward to.</span></p><br/><p><span style=\"\">‘Urugal mountain range…… I have to get over it, yet I have idea how I'll do it.’ </span></p><br/><p><span style=\"\">However, if he wanted that content, he had to cross the Urugal mountain range, and he had to discover the Ruined Kingdom.</span></p><br/><p><span style=\"\">The Ruined Kingdom had to appear for the third Main Scenario Quest to start.  Then the second Advancement contents will be released, and the Skill Reinforcement would included.  He had to reach level 300, not level 200 by that time.  If not, he won't be able to go through his 2nd Advancement, and it would be impossible for him to do the Skill Reinforcement.  Of course, he wouldn't be able to gain the Death Knight Skill either.</span></p><br/><p><span style=\"\">However, Anh-jaehyun wasn't confident that he would be able to cross the Urugal mountain range right now.</span></p><br/><p><span style=\"\">‘In the end, I'm not sure I'll be able to do it even if I reach level 200.’ </span></p><br/><p><span style=\"\">Even if he reached level 200, he wasn't confident he'll be able to cross the Urugal mountain range even with the Arbiter of Corruption Ring and the Deposed Prince's Sword equipped.</span></p><br/><p><span style=\"\">Still, this didn't mean he was kosher with working with others.  Ahn-jaehyun had already suckerpunched the Red Bulls guild, who had been amicable towards him.  Hydra guild also didn't look too fondly on the Hahoe Mask. If he had to pick one, who might show goodwill towards him, it was the Stormhunters.  However, they weren't even a viable choice for him.</span></p><br/><p><span style=\"\">This was the reason why he could only sigh.</span></p><br/><p><span style=\"\">At that moment...</span></p><br/><p><span style=\"\">‘Wait a sec.’ </span></p><br/><p><span style=\"\">Ahn-jaehyun's expression changed once again.  While he was sighing, he suddenly remembered something that changed his expression. </span></p><br/><p><span style=\"\">‘The Frozen Kingdom!’ </span></p><br/><p><span style=\"\">It was the event stage located across the Terube castle walls.  It was called the Frozen Kingdom.  It was an event stage made for level 200 Users.</span></p><br/><p><span style=\"\">‘Why the hell did I forget about the Frozen Kingdom?’ </span></p><br/><p><span style=\"\">To be precise, there were several event stages like the Frozen Kingdom that'll give clues as to the existence of the Ruined Kingdom.  One would be able to find out that the Ruined Kingdom was across the Urugual mountain range through these events.</span></p><br/><p><span style=\"\">From Ahn-jaehyun's perspective, he already had this information, so he had tried to skip couple steps in the process.  This was why he had forgotten about the Frozen Kingdom.</span></p><br/><p><span style=\"\">He remembered what kind of place it was, and before he returned to the past, he remembered this stage had been set up for a certain person....  He had forgotten about it for a brief time.</span></p><br/><p><span style=\"\">‘I forgot something that is very important.  Of course, I can't leave out the Frozen Kingdom.  I have to gain all the benefits from it.  I must!’ </span></p><br/><p><span style=\"\">Then he thought about it again.</span></p><br/><p><span style=\"\">Ahn-jaehyun immediately turned his gaze towards his Tablet PC.  As a precaution, he planned on searching the web for the Frozen Kingdom.  When Ahn-jaehyun swiped at his Tablet PC, the page returned to the previous page.  The ranking of the videos appeared.</span></p><br/><p><span style=\"\">At that moment, Ahn-jaehyun's expression turned sour.  It was the Weekly Warlord Video Ranking, and his video was 2nd in terms of views.  This was the cause of his dour mood.</span></p><br/><p><span style=\"\">‘V&amp;V guild…… They ain't playing around.’ </span></p><br/><p><span style=\"\">The V&amp;V guild's Blood Ogre Raid video had been uploaded around the same time as Ahn-jaehyun's video, and it had about twice as many views.  Moreover, the footage was worth the interest and praise it was getting.</span></p><br/><p><span style=\"\">‘It basically means the newly added Users aren't normal Users.’ </span></p><br/><p><span style=\"\">Even in Ahn-jaehyun's view, the Team Poker's strength was impressive.  This was especially true for the newly added members.  Their skills approached the skills of the Matador and the Storm Queen.  Basically, they were almost on a similar level as the Warlord's best Strikers. </span></p><br/><p><span style=\"\">Of course, this simple fact wouldn't have struck Anh-jaehyun's nerve.  The part that struck his nerve was the fact that the face of a User he already knew wasn't part of the new faces.</span></p><br/><p><span style=\"\">‘Why isn't the one that tried to kill me amongst them?  Wasn't he a guild member of the V&amp;V guild?  Didn't he have the V&amp;V guild mark on at that time?’ </span></p><br/><p><span style=\"\">This fact kept bothering Ahn-jaehyun.</span></p><br/><p>9.</p><br/><p><span style=\"\">The change that happened in the V&amp;V guild was extreme, and the result of this change was also extraordinary.  Until now, the V&amp;V guild had been considered to be the middle of the pack within the 30 great guilds.  However, the value of V&amp;V guild's name shot up in an instant from the release of a single Blood Ogre Raid video.  They were starting to be judged in the same breath as the Big 3.</span></p><br/><p><span style=\"\">This fact had a big impact on the other 30 great guilds.  They were already beyond the point where the 30 great guilds could choose to go through a change.  They were starting to be forced to change.</span></p><br/><p><span style=\"\">However, not many guilds tried to go for an aggressive transformation.  If one tried to force a changed like the V&amp;V guild, the guild would suffer bone grinding pain.</span></p><br/><p><span style=\"\">However, even if one looked into an organization going through such a pain, there was inevitably a different degree of pain being felt by the Users.  Moreover, no one wanted  to be the one to suffer the worst of the pain.</span></p><br/><p><span style=\"\">Big Smiles guild repeatedly held officer’s meetings, but in the process, they weren’t able to come up with a clear plan of action.  This was the big reason why they couldn’t come to a consensus.</span></p><br/><p><span style=\"\">“Shit!” </span></p><br/><p><span style=\"\">‘They are really looking at me as if I’m some pushover!’ </span></p><br/><p><span style=\"\">The one, who felt the most pressure, in such a situation, was Apollo.  He was a newly minted officer.  If one took away his background, he was useless. </span></p><br/><p><span style=\"\">It had been implied that Apollo would be forced to make sacrifices.</span></p><br/><p><span style=\"\">‘How dare they treat me like this?  Someday I'll take over the Big Smiles guild....’ </span></p><br/><p><span style=\"\">From Apollo’s perspective, he couldn’t help, but feel depressed at the recent developments.  At the very least, he hadn’t paid exorbitant amount of money to be treated like this as an officer of the Big Smiles.</span></p><br/><p><span style=\"\">At that moment, someone called Apollo.  When he checked who was calling, Apollo immediately answered the phone.</span></p><br/><p><span style=\"\">“Hyung-nim.” </span></p><br/><p><span style=\"\">Apollo was someone, who only thought highly of himself, yet he called someone 'hyung-nim'?  A very rare greeting came out of Apollo's mouth.</span></p><br/><p><span style=\"\">- Apollo.</span></p><br/><p><span style=\"\">“Yes.  Please speak.” </span></p><br/><p><span style=\"\">The identity of the man being called hyung-nim by Apollo was none other than Brooks.  He was an officer of the Big Smiles.  He had been the biggest help in allowing Apollo reach the status of officer in the Big Smiles guild.  Even after he was put in the officer role, Brooks continued to help out Apollo.</span></p><br/><p><span style=\"\">- You must be in a foul mood from the officer meeting, right?</span></p><br/><p><span style=\"\">“No way.” </span></p><br/><p><span style=\"\">Moreover, he was the only other officer that understood Apollo’s mood.</span></p><br/><p><span style=\"\">These were enough reasons for Apollo to call Brooks as his hyung-nim.</span></p><br/><p><span style=\"\">- As you can probably see, the inner structure of this guild is rotten.  None of them wants to load their guns.</span></p><br/><p><span style=\"\">Of course, Brooks didn't help out Apollo out of genuine kindness.</span></p><br/><p><span style=\"\">“Yes.” </span></p><br/><p><span style=\"\">- This is why I'm trying to use this opportunity to become the guild master.</span></p><br/><p><span style=\"\">“Yes?” </span></p><br/><p><span style=\"\">Brooks finally revealed his ambition.</span></p><br/><p><span style=\"\">- There is one characteristic that is common amongst the Big 3.  All three guild masters hold an incredible amount of power.   Look at the state of our guild.  We have over ten officers, and it has been a revolving door on who becomes the guild master amongst them.  This is why the position of guild master has become marginalized in our guild.  This is our guild’s problem.</span></p><br/><p><span style=\"\">This was also the reason why Brooks had brought Apollo to the Big Smiles guild as an officer.  When one wanted to become a guild master with a strong grip over the guild, one needed a support base.</span></p><br/><p><span style=\"\">Moreover, Apollo was well aware of this fact.  Apollo wasn’t stupid.  He already understood that Brooks wasn’t helping out through pure generosity.</span></p><br/><p><span style=\"\">Apollo actually felt better when he was given a deal.  He smiled.</span></p><br/><p><span style=\"\">“So what do you want me to do, hyung-nim?” </span></p><br/><p><span style=\"\">- We are going to induce a guild war.  We'll pick a fight with the Hydra guild.</span></p><br/><p><span style=\"\">“What?” </span></p><br/><p><span style=\"\">However, the smile he had from his good mood disappeared in an instant.</span></p><br/><p><span style=\"\">“The Hydra guild?” </span></p><br/><p><span style=\"\">- I'll tell you the detailed plan after I hear your decision.  However, I can guarantee you one thing.  If you help me become the guild master, I'll make you a guild master to one of the sub-guilds.  </span></p><br/><p><span style=\"\">A guild war with the Hydra guild?  Apollo felt a chill run up his spine when he heard those words.</span></p><br/><p><span style=\"\">On the other hand, he was being guaranteed a position as the sub-guild master.  It was an attractive offer.  It blinded Apollo.</span></p><br/><p><span style=\"\">‘Brooks hyung-nim isn't an idiot.  He wouldn’t recklessly start a guild war without any preparations.’ </span></p><br/><p><span style=\"\">“I'll follow hyung-nim.” </span></p><br/><p><span style=\"\">- All right.  Before we get to that, I want to introduce you to someone.  You probably know him, since you guys met before once.</span></p><br/>\n</div>"}