{"title": "Chapter 142 - The Frozen Land (1)", "id": 142, "volume": 2, "url": "http://boxnovel.org/emperor-of-solo-play-chapter-142-the-frozen-land-1", "volume_title": "Volume 2", "body": "<h1>Chapter 142 - The Frozen Land (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 142 - The Frozen Land (1)</p><br/><p>1.</p><br/><p><span style=\"\">The endless snow that was falling down was swept up by cold winds.  It was as if the whole world was shivering.</span></p><br/><p><span style=\"\">Hweeeeeng!  </span></p><br/><p><span style=\"\">The sound of the winds made one's ears numb.  The world had turned white, which blinded one’s vision.  The only thing one could smell was the coldness.</span></p><br/><p><span style=\"\">During all of this, a User dared to to step onto the snowfield. </span></p><br/><p><span style=\"\">Pooh-poohk.</span></p><br/><p><span style=\"\">The white snowfield became the white predator.  Accompanying a terrifying sound, the intruder was swallowed up to his knees.</span></p><br/><p><span style=\"\">“Fire!” </span></p><br/><p><span style=\"\">- I have no visuals at all! </span></p><br/><p><span style=\"\">In such a ridiculous stage, Sohank was blocking an Ice Bear with his single shield.  It was a 10 meters long bear made out of ice, and it wasn't easy to block it.</span></p><br/><p><span style=\"\">‘This is crazy.’ </span></p><br/><p><span style=\"\">Sohank repeated those words until he was sick of it.  He was about to repeat it again, when the Ice Bear let out a roar.</span></p><br/><p><span style=\"\">Koo-oh-oh.</span></p><br/><p><span style=\"\">‘It's coming.’ </span></p><br/><p><span style=\"\">Sohank was nervous, but he readied himself.</span></p><br/><p><span style=\"\">Unlike its prior attacks, the Ice Bear used all of its strength to use its Bodyslam.</span></p><br/><p><span style=\"\">Ggwah-ahng! </span></p><br/><p><span style=\"\">Sohank felt an incredible amount of force transferred from across his shield.  Sohank's body was pushed backwards.</span></p><br/><p><span style=\"\">He had barely avoided falling over.  He had maintained his stance as he endured the Bodyslam.  Sohank busily grinded his teeth inside. </span></p><br/><p><span style=\"\">‘It this was a grassy plains, this bear bastard would....’ </span></p><br/><p><span style=\"\">Ice Bear.</span></p><br/><p><span style=\"\">This was his first time facing this monster.  It was large, but it wasn't too difficult to face it in a vacuum.  Basically, it didn't have any special skills.  It also didn't possess incredible strength or incredible Battle AI compared to its size.  Moreover, it was fairly easy to maintain the aggro.</span></p><br/><p><span style=\"\">The problem was the environment.  The snow was up to his knees, and the ground was covered in ice.  It thoroughly vexed Sohank.</span></p><br/><p><span style=\"\">Sohank could always rely on the ground being steady, but he never expected his lack of footing would making him feel so weak.  He be skeptical of the ground he was standing on.  He never expected such a thing to happen, and it made a chill run up his spine.</span></p><br/><p><span style=\"\">“Fire!” </span></p><br/><p><span style=\"\">Sohank yelled out again.  He wasn't shouting out an order as the commander of the group.  His shout was almost close to a plea for help.  In his life as a gamer, Sohank would be hard to find an  experience that was as humiliating as the one right now.</span></p><br/><p><span style=\"\">- We really can't see anything! If we use our magic, you might be swept up in it! </span></p><br/><p><span style=\"\">However, it wasn't easy to help him either.  Magician's had to be judicious with their magic.  They had to avoid harming their allies.  However, the magicians could barely see the tip of their noses.  No matter how accurate these magicians were, it was an impossible situation where they couldn't fully use their abilities.</span></p><br/><p><span style=\"\">\"Fire!” </span></p><br/><p><span style=\"\">However, Sohank yelled out again.</span></p><br/><p><span style=\"\">- I'm sending it! </span></p><br/><p><span style=\"\">In the end, a magician gave an answer, and at the same time, he threw the ball of fire in his hand forward.</span></p><br/><p><span style=\"\">The ball of fire thrown by the magician started to roll forward.  As it rolled forward, it started to expand, and in moments, it took the form of an enormous bear.</span></p><br/><p><span style=\"\">Koo-wah-ahng! </span></p><br/><p><span style=\"\">Flame Bear.</span></p><br/><p><span style=\"\">This scary magical spell was charging forward as it melted the snow away.</span></p><br/><p><span style=\"\">However, Sohank was the one in the path of the charging Flame Bear.</span></p><br/><p><span style=\"\">‘Aigo.’ </span></p><br/><p><span style=\"\">He was the one that had ordered the use of the magic, but he never expected the Flame Bear to charge at him from his rear.</span></p><br/><p><span style=\"\">Sohank took short breaths.  The important part will start now.  If he did nothing, he would be sandwiched by the two bears. </span></p><br/><p><span style=\"\">It was the moment of truth.  Sohank moved when he saw an opportunity.  The Ice Bear had been continuously ramming into his shield.  Sohank lashed out at the Ice Bear with his shield.</span></p><br/><p><span style=\"\">Ggwah-ahng! </span></p><br/><p><span style=\"\">A loud sound exploded forth, and the Ice Bear's body was shifted slightly to the side.  </span></p><br/><p><span style=\"\">Koo-roo-roo....</span></p><br/><p><span style=\"\">The Ice Bear had been about to let out a roar, but now it was letting out a low growl.  It was a sound made when a beast has reached the peak of its anger.</span></p><br/><p><span style=\"\">However, when the Ice Bear reorientated its head to express its anger, Sohank had disappeared from its field of vision.  When he hit the Ice Bear on the head, Sohank had immediately escaped from his current location.</span></p><br/><p><span style=\"\">Sohank had leaped into the air, and he landed on the Ice Bear's nape.</span></p><br/><p><span style=\"\">As he landed, Sohank took out the dagger equipped on his leg, and he stabbed it into the neck of the Ice Bear.</span></p><br/><p><span style=\"\">Pah-kahk! </span></p><br/><p><span style=\"\">The dagger was planted inside the Ice Bear's neck.  It was in only up to the depth of the middle knuckle.  It couldn't be considered to be a deep wound.</span></p><br/><p><span style=\"\">Koo-ah-ah! </span></p><br/><p><span style=\"\">However, it was enough to drive the Ice Bear into a rage.</span></p><br/><p><span style=\"\">The Ice Bear suddenly stood up.  At the same time, it turned to look towards its back.  Sohank was hanging on by grabbing onto his dagger.  Instead of shaking Sohank off, it planned on biting him. </span></p><br/><p><span style=\"\">Koo-oh-oh! </span></p><br/><p><span style=\"\">It was great timing.  The Flame Bear threw itself at the Ice Bear, and it swung its paw. </span></p><br/><p><span style=\"\">Puh-uhng! </span></p><br/><p><span style=\"\">The Flame Bear's front paw let out a rough sound as it violently struck the Ice Bear's head.</span></p><br/><p><span style=\"\">Hweeek!</span></p><br/><p><span style=\"\">The Ice Bear's head snapped to the side, and a terrifying claw mark appeared on its face.</span></p><br/><p><span style=\"\">At that moment, the Ice Bear's anger wasn't directed at Sohank at all.  It was directed towards the Flame Bear.  The two bears immediately started to fight each other.  The two bears stood on their hind legs, and they used their front paws to strike at each other.  Neither bear backed down, but it wasn’t a good battle to watch.</span></p><br/><p><span style=\"\">The Ice Bear was much more stronger than the Flame Bear.  The Flame Bear could only leave scratches and wounds on the Ice Bear's body.  The Ice Bear's attacks took chunks off of the Flame Bear's body.</span></p><br/><p><span style=\"\">The two bears exchanged about 10 blows in total, and the Flame Bear became mangled.  It started to disappear into the snowstorm.</span></p><br/><p><span style=\"\">During all of this, Sohank created wounds on the Ice Bear's back and waist.  Again, the wound wasn't deep, but the location from where he struck was exquisite.  He was at a location where the Ice Bear's limbs and teeth couldn't reach him.  He was basically in its blind spot.</span></p><br/><p><span style=\"\">From such a location, Sohank yelled out again.</span></p><br/><p><span style=\"\">“Fire!” </span></p><br/><p><span style=\"\">Instead of answering back, the magicians used more magical spells.  Accompanying the incantation of the magicians, fireballs and thunder strikes headed towards the Ice Bear.  Moreover, it was also coming towards Sohank, who was sticking close to the Ice Bear's body.</span></p><br/><p><span style=\"\">Koo-oh-oh! </span></p><br/><p><span style=\"\">The Ice Bear let out a roar as it struggled.  As the Ice Bear flailed, Sohank started to accumulate a significant amount of damage.  Sohank continued to attack it to keep the aggro on him.</span></p><br/><p><span style=\"\">This really was a gambit where Sohank had put his life on the line.</span></p><br/><p><span style=\"\">In such a battle, the rest of the party could do nothing.  Natal, who was the leader of this party, didn't say anything.  At this moment, he couldn't even come up with a word of encouragement for Sohank.</span></p><br/><p><span style=\"\">‘Shit.’ </span></p><br/><p><span style=\"\">Natal couldn't do anything.  He could only regret over his decision.</span></p><br/><p><span style=\"\">His regret started 8 days ago.  It was when they first arrived at this frozen land.  As if by magic, the snowstorm had appeared, and Natal was conflicted as to how he should proceed.  He wondered if he should allow the group an adjustment time period before they earnestly started their search.  On the flip side, they could start searching first, then they could get used to everything.....</span></p><br/><p><span style=\"\">In truth, they planned on following the former plan.  They were going to start their search after they got acclimated to this place.</span></p><br/><p><span style=\"\">However, the problem was the urgent news he received.</span></p><br/><p><span style=\"\">‘If it wasn't for the Big Smiles....’ </span></p><br/><p><span style=\"\">The urgent news said a large contingent of Big Smiles guild members had crossed the Terube castle wall.</span></p><br/><p><span style=\"\">In truth, this was within the realm of possibilities they had postulated.   If one had a decent head on one’s shoulder, it was easy to connect the dot between the Northland and the third Main Scenario Quest.</span></p><br/><p><span style=\"\">‘No. If it wasn't for Sinclair...’ </span></p><br/><p><span style=\"\">Sinclair was within this group.</span></p><br/><p><span style=\"\">He wasn't known to the world, but he was a User that was on par or better than the officers of the 30 great guilds.  He was also a person that had received aggressive love calls from all the 30 great guilds, yet he was unwavering in switching his affiliation.</span></p><br/><p><span style=\"\">Yet he was wearing a Big Smiles guild symbol now.  Moreover, Natal received information that Sinclair was one of the figures leading the group.  Natal couldn't help, but be thrown into a state of confusion.</span></p><br/><p><span style=\"\">This put a lot of pressure on him.  If it was just the Big Smile, he could just treat them as a big dog that moved into the neighborhood.  However, this was the Big Smiles guild with Sinclair included in the party.  A feral beast had just moved into the neighborhood.</span></p><br/><p><span style=\"\">In the end, Natal decided to accelerate their timeline in finishing the Quest instead of facing off against the Big Smiles guild.</span></p><br/><p><span style=\"\">However, the frozen ground was starting to cause significant delays.</span></p><br/><p><span style=\"\">‘If things head along this way, they'll definitely catch up to us.’ </span></p><br/><p><span style=\"\">They were in a obstacle race, and they were having a hard time getting past the obstacles.  They were pretty much stuck.</span></p><br/><p><span style=\"\">Of course, they would be caught by the latecomers.</span></p><br/><p><span style=\"\">- We got it!  Stop! </span></p><br/><p><span style=\"\">At that moment, Sohank's voice was heard in Natal's ears.  At the same time, the Priests ran towards Sohank.  They used the Healing skills to quickly mend the wounds.  Then they started putting the Buff skills on him as a precaution for the unforeseen circumstances that might occur.</span></p><br/><p><span style=\"\">“Natal!” </span></p><br/><p><span style=\"\">As he was receiving the skills from the Priests, Sohank immediately called out to Natal.</span></p><br/><p><span style=\"\">Natal approached Sohank, and he gave orders to his subordinates through Voice Talk.</span></p><br/><p><span style=\"\">“Listen!  We don’t have much time, so we’ll be brief in taking footage for data.  Once you guys finish filming, we’ll immediately butcher the monster.  Clean up after yourselves.  Don't leave behind any Ingredient Coins.” </span></p><br/><p><span style=\"\">“Yes.” </span></p><br/><p><span style=\"\">“I'll say this again.  We can't leave behind any trace.  The Ingredient Coins won't disappear.</span></p><br/><p><span style=\"\">“Yes.” </span></p><br/><p><span style=\"\">His warnings were almost approaching the level of nagging.  Even though, he had given his warnings, Natal didn’t look to be in a good mood.  His expression was screwed up as he started a conversation with Sohank.</span></p><br/><p>2.</p><br/><p><span style=\"\">Poo-oohk! </span></p><br/><p><span style=\"\">A wide and nimble sword was embedded deep within the Hammerhead's single sharp eyes.  The Hammerhead's body started to shake.  It was such a deep wound that the Hammerhead couldn't even let out a scream.</span></p><br/><p><span style=\"\">Kooh-oohng! </span></p><br/><p><span style=\"\">In the end, the Hammerhead weakly fell to the ground as if it was a large piece of log. A User descended using the fallen Hammerhead's body as a staircase.  Sinclair immediately flipped over the Hammerhead's body.</span></p><br/><p><span style=\"\">Swhoook! </span></p><br/><p><span style=\"\">After flipping it over, he immediately extracted his sword from the Hammerhead's single eye.  Sinclair sheathed his sword.  It was the surest gesture that signified the end of a battle.</span></p><br/><p><span style=\"\">Everyone, who had been watching the battle, let out exclamations.</span></p><br/><p><span style=\"\">“Amazing.  You are really amazing.” </span></p><br/><p><span style=\"\">“Sinclair-nim! You are really incredible!” </span></p><br/><p><span style=\"\">Then there were those, who swallowed their exclamations. </span></p><br/><p><span style=\"\">‘How preposterous.  He just climbed atop the Hammerhead's head?  If it went awry, he would have been swept up in the Head-butt....  I'll never be able to do such a thing.\"</span></p><br/><p><span style=\"\">‘I know he has the Items, but it is also his incredible skills.  Why haven’t such a skilled User gained any notoriety yet?’ </span></p><br/><p><span style=\"\">‘Why did such a skilled User enter our guild?’ </span></p><br/><p><span style=\"\">Of course, not everyone was letting out or swallowing exclamations.</span></p><br/><p><span style=\"\">“You did well.” </span></p><br/><p><span style=\"\">Instead of an exclamation, Apollo spoke as if he was a noble giving praise to his subordinate.  He spoke in a disinterested tone.  Sinclair also responded in a disinterested manner.  He slightly nodded his head.</span></p><br/><p><span style=\"\">Apollo's expression crumpled a little bit.  His presence was being continuously marginalized, so it seemed Apollo didn't welcome the current situation.</span></p><br/><p><span style=\"\">Sinclair also didn't like the situation he was in.</span></p><br/><p><span style=\"\">‘I know this is a job, but I can't believe I have to lower my head to this guy.’ </span></p><br/><p><span style=\"\">He had operated without publicizing his face in the past, but Sinclair had been treated with utmost respect and care by everyone as a Helper from the Hands guild.  Apollo was nothing if he didn't have his father's influence.</span></p><br/><p><span style=\"\">Of course, he didn’t look kindly to Apollo holding a role of being his superior.</span></p><br/><p><span style=\"\">‘Be patient.  This will come to an end soon.’ </span></p><br/><p><span style=\"\">He knew the importance of this job, so Sinclair firmly preached patience to himself.</span></p><br/><p><span style=\"\">‘It won't be too long.’ </span></p><br/><p><span style=\"\">After they moved beyond the Terube castle wall, Sinclair led the Big Smiles guild member in a chase after the Hydra guild.  They had only one purpose.  They were going to start a guild battle against the Hyrdra guild.</span></p><br/><p><span style=\"\">Of course, they didn’t plan on fighting a full scale battle.  From the Hydra guild’s perspective, they weren’t keen on a full scale battle either.  They would work to avoid that outcome.  Reinforcements weren’t anywhere near them, and there were no castles or towns beyond the Terube wall.  If they performed a fullscale war, it would be basically be akin to a suicide bombing.</span></p><br/><p><span style=\"\">In the end, they’ll decide do a 1on1 battle.  A great match would ensue, and this was the result wanted by Sinclair.</span></p><br/><p><span style=\"\">‘If I kill Sohank, everything will change.’ </span></p><br/><p><span style=\"\">Sohank was the strongest User in the Hydra guild.  What was the worth of winning a 1on1 battle against him?</span></p><br/><p><span style=\"\">He had no idea.</span></p><br/><p><span style=\"\">It was incalculable, but just the thought of it was enough to make him smile.</span></p><br/><p><span style=\"\">A smile formed on Sinclair's lips.  One User saw his smile, so the User spoke up.</span></p><br/><p><span style=\"\">“It seems you are in a good mood.” </span></p><br/><p><span style=\"\">“Huh?” </span></p><br/><p><span style=\"\">“Nothing.  I just saw you smiling, so I....” </span></p><br/><p><span style=\"\">The one that asked the question was Cho-oohroong.  He was the one that had built an affinity with Bagel by playing on the Battlefield stage. He was also the one that was able to receive the Northland Exploration Quest.</span></p><br/><p><span style=\"\">Unlike Apollo, Sinclair had a high opinion of Cho-oohroong.  Cho-oohroong had helped out Sinclair in various ways, so Sinclair treated him well.</span></p><br/><p><span style=\"\">“I’ll be fighting a skilled User soon.  The anticipation I have for the fight must have revealed itself through my expression.” </span></p><br/><p><span style=\"\">This was why Sinclair revealed some of his true feelings in front of Cho-oohroong. </span></p><br/><p><span style=\"\">“As expected, you are incredible.” </span></p><br/><p><span style=\"\">Cho-oohroong had an expression filled with admiration as he looked at Sinclair.  Sinclair's smile deepened when he saw this particular expression.</span></p><br/><p><span style=\"\">This is what he wanted.  He didn't want everyone to look at him as just some nobody.  He wanted them to look at him with respect.  He didn't want to be the expert that only other experts knew about.  We wanted to become world famous.</span></p><br/><p><span style=\"\">“Sinclair-nim is probably the only one in this game that feels happy about the prospect of fighting Sohank.” </span></p><br/><p><span style=\"\">“I'm flattered.  However, if I don't win, this would have all been an act of reckless bravado.” </span></p><br/><p><span style=\"\">“No.  From what I just saw now, you will definitely win.  Of course, this is assuming the other side doesn't do anything foul.” </span></p><br/><p><span style=\"\">The dayy will come soon.  Even people, who didn't know Sinclair, would look up to him!</span></p><br/><p><span style=\"\">Sinclair's smile deepened further.  It was so deep that his smile couldn't get any more broader.</span></p><br/><p><span style=\"\">It happened at that moment....</span></p><br/><p><span style=\"\">“Uh? There is a Coin here!” </span></p><br/><p><span style=\"\">“What?” </span></p><br/><p><span style=\"\">The atmosphere suddenly changed.  Everyone gathered in a single location when they heard the word Coin.</span></p><br/><p><span style=\"\">“Did you just say Coins?” </span></p><br/><p><span style=\"\">“Yes.” </span></p><br/><p><span style=\"\">“Try picking it up.” </span></p><br/><p><span style=\"\">“Here it is.” </span></p><br/><p><span style=\"\">Sinclair immediately held the Coin, and he checked the Coin's information on the Holographic Window.</span></p><br/><p><span style=\"\">[Deadwood Monkey's Skin] </span></p><br/><p><span style=\"\">[Deadwood Monkey's Skin] </span></p><br/><p><span style=\"\">[Deadwood Monkey's Bone] </span></p><br/><p><span style=\"\">It was the Ingredient Coins from the Deadwood Monkeys.</span></p><br/><p><span style=\"\">“Isn't this the 20th one we found?” </span></p><br/><p><span style=\"\">“We are finding fallen Coins every time we are about to forget about it.” </span></p><br/><p><span style=\"\">“It seems there is a hole in the Coin Pouch carried by the Hydra guild.  It seems they are leaving behind a trail.” </span></p><br/><p><span style=\"\">Ingredient Coins was a trace that could only be left behind by Users. </span></p><br/><p><span style=\"\">“All of a sudden, we are like Hansel and Gretel following after the breadcrumbs.” </span></p><br/><p><span style=\"\">Obviously, this tracks was left behind by the Hydra guild.  In other words, the Big Smiles guild was on the right path in chasing down the Hydra guild.</span></p><br/><p><span style=\"\">However, Sinclair no longer had a smile on his face.  He spoke in an earnest tone.</span></p><br/><p><span style=\"\">“Let us move faster.”</span></p><br/>\n</div>"}