{"title": "Chapter 163 - Anugas Necklace (2)", "id": 163, "volume": 2, "url": "http://boxnovel.org/emperor-of-solo-play-chapter-163-anugas-necklace-2", "volume_title": "Volume 2", "body": "<h1>Chapter 163 - Anugas Necklace (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span style=\"\">Chapter 163 - Anugas’ Necklace (2)</span></p><br/><p>5.</p><br/><p><span style=\"\">It was a house that had a great night view.  The house had a wine cellar, so one could enjoy this night scene with wine.  The wine cellar looked quite expensive, and it was filled with expensive wines.  There wasn't much space to move within it.</span></p><br/><p><span style=\"\">- It is a really nice house.</span></p><br/><p><span style=\"\">- Yes.  I decided to indulge myself by moving into this place.  When I used to be a baseball player, I always wanted to live in a place like this.</span></p><br/><p><span style=\"\">The interview was being conducted with the fancy house as the background.</span></p><br/><p><span style=\"\">The interviewee was Jameis Jones.  He was more famously known as BigK in Warlord.</span></p><br/><p><span style=\"\">During the Warlord's second Main Scenario Quest, BigK entered the ranks of the 1st team Raid member after he distinguished himself in the great battle event.  Afterwards, he participated in Red Bull's core quests and Raids.  He showed off his surprising Skill, and now he was considered to be one of the top Magicians of the Red Bulls.</span></p><br/><p><span style=\"\">- When I failed to break into the Major League, I thought my dream was crushed.  I never expected to achieve my dream through this game.</span></p><br/><p><span style=\"\">His life had changed after the second Main Scenario Quest.</span></p><br/><p><span style=\"\">The most clear-cut evidence of the change was his residence.</span></p><br/><p><span style=\"\">He was now the owner of a house that anyone would envy.  Moreover, a regular person would never be given a chance to be featured in such an interview.</span></p><br/><p><span style=\"\">- This is the age we are living in.  Riches and fame can be had for people, who are good at playing games.</span></p><br/><p><span style=\"\">- This might be a bit of a rude question.  It hasn't been too long since BigK-nim's career has taken off.  However, you are already making a good deal of money.  Could you guess at how much the most famous Users of Warlord make?  I'm talking about the Users that even people unfamiliar with Warlord knows.  This is the most burning question amongst our viewers.</span></p><br/><p><span style=\"\">- I'm not them, so I can't be sure.  However, if I had to guess....  Currently, the two most famous Users in Warlord is the Storm Queen and the Hahoe Mask.  The Storm Queen is already famous for being an heiress, so we should exclude her.  The Hahoe Mask....  The house I live in right now is probably the size of his wine cellar.</span></p><br/><p><span style=\"\">- That is incredible.</span></p><br/><p><span style=\"\">- Of course, the Hahoe Mask's identity is still a mystery, but there is wide consensus that he is incredibly rich.</span></p><br/><p><span style=\"\">Ahn-jaehyun was too flabbergasted by the video he was watching.  The half-eaten Chocobar fell to the floor.</span></p><br/><p><span style=\"\">Chul-puhk! </span></p><br/><p><span style=\"\">The Chocobar was mushy, because it had melted.  The Chocobar was in rough shape when it fell to the floor.  Ahn-jaehyun picked up the Chocobar, and he checked if there was anything stuck to it.  When he didn't see anything, he put the Chocobar back into his mouth.</span></p><br/><p><span style=\"\">Moreover, he continued to look at the video with a flabbergasted expression.  Ahn-jaehyun had been wordlessly watching the video, but he spoke without meaning to.</span></p><br/><p><span style=\"\">“Have these bastards lost their collective minds?” </span></p><br/><p><span style=\"\">Gulp.</span></p><br/><p><span style=\"\">Ahn-jaehyun chewed and swallowed the Chocobar.  After tapping his Tablet PC several times, he switched the content on the screen.</span></p><br/><p><span style=\"\">‘So this is how they are going to trouble me?’ </span></p><br/><p><span style=\"\">He had started watching this video, since he had heard about the recent news regarding the Red Bulls guild.</span></p><br/><p><span style=\"\">The Red Bulls guild's 1st team members had been conspicuously absent from the spotlight in recent days.  Numerous guilds were trying very hard to get across the Urugal mountain range, yet he hadn't heard a single rumor regarding the Red Bulls guild being nearby.</span></p><br/><p><span style=\"\">This meant the Red Bulls guild was progressing on a secret big project in a different region.  This was why he had been collecting information on them, and he had come across BigK's recent interview. </span></p><br/><p><span style=\"\">Still, he never expected things to progress in this fashion.</span></p><br/><p><span style=\"\">Ahn-jaehyun looked at the screen of the Tablet PC with annoyed eyes, and he kept swiping at the screen.  His temperamental actions came to a pause when Ahn-jaehyun came upon the page where he had uploaded the most recent video regarding the Skull Collector.  </span></p><br/><p><span style=\"\">He had already seen this page over several dozen times, yet the sight in front of him never failed to transform his bitterness into sweetness.</span></p><br/><p><span style=\"\">‘The timing of the release was spot on.’ </span></p><br/><p><span style=\"\">He had caught the Skull Collector a while ago.  He had left the production of the Skull Collector Hunt video to the Romani films, and the final video was sent to him four days ago.</span></p><br/><p><span style=\"\">However, Ahn-jaehyun hadn't immediately uploaded the video.</span></p><br/><p><span style=\"\">This was the footage showing the Death Knight's first appearance.  This video was monumental for several reasons, but he held back uploading the video.  He waited for the right time.</span></p><br/><p><span style=\"\">Moreover, he came up with a plan when Anugas appeared.</span></p><br/><p><span style=\"\">He decided to put the video up on his Youtube page when he completed the Anugas Raid.</span></p><br/><p><span style=\"\">His aim was simple.  When the Anugas Raid starts, everyone's attention would be focused on the Black Continent.  When the Anugas Raid ended, everyone's attention would be shifted towards the Hahoe Mask.</span></p><br/><p><span style=\"\">What would happen if he uploaded the video at that moment?</span></p><br/><p><span style=\"\">‘I'll easily get 100 million views.’ </span></p><br/><p><span style=\"\">His aim was right on target.</span></p><br/><p><span style=\"\">In just a single day, he recorded 40 million views.  He wouldn't have problem getting 100 million views.  He could probably double that number.</span></p><br/><p><span style=\"\">The reaction was also quite good.  His 6 sponsors were full of praise regarding the video.</span></p><br/><p><span style=\"\">His bank account was beyond being in a good state as his sponsorship funds came in.  It was rather impressive.</span></p><br/><p><span style=\"\">This pretty much washed away all the unpleasant feelings he had earlier. </span></p><br/><p><span style=\"\">Ahn-jaehyun considered the interview to be unpleasant, but now he had the foundation needed to turn BigK's words into reality.</span></p><br/><p><span style=\"\">‘Anguas' Necklace, Token of the Secret Society, Deposed Prince's Sword.....  Basically, I've reached the endgame in regards to Items.’ </span></p><br/><p><span style=\"\">Basically, he had gathered all the arsenal he would need.</span></p><br/><p><span style=\"\">‘I really reached this point.’ </span></p><br/><p><span style=\"\">This feeling was sudden and unexpected.</span></p><br/><p><span style=\"\">He had continued forward in the face of all kinds of hardship and suffering.  He had finally reached this point, and he took an assessment of himself.</span></p><br/><p><span style=\"\">‘I'm really here.’ </span></p><br/><p><span style=\"\">He was proud of himself.</span></p><br/><p><span style=\"\">Everyone including Ahn-jaehyun himself thought this was impossible to do.  The task he set out to do was considered to be beyond impossible.  It was idiotic.  He was given an unprecedented second opportunity, and it had felt as if he was wasting this opportunity by pursuing the unachievable.  It was so stupid that Ahn-jaehyun had yelled at himself before.</span></p><br/><p><span style=\"\">However, he had finally achieved this idiotic task.</span></p><br/><p><span style=\"\">He was pleased.</span></p><br/><p><span style=\"\">A happy smile formed when he saw the figure within his bank account.</span></p><br/><p><span style=\"\">Hue hue hue!</span></p><br/><p><span style=\"\">He was so happy that a silly laugh automatically came out of his mouth.</span></p><br/><p><span style=\"\">He was surprised, proud, pleased and happy.</span></p><br/><p><span style=\"\">The fact that made him happy above all else was the reality that his enemies were frightened and scared of him.</span></p><br/><p><span style=\"\">‘The only thing left is to crush them.’ </span></p><br/><p><span style=\"\">Thirty great guilds.</span></p><br/><p><span style=\"\">The beings he hated the most couldn't rashly move against him.  Every time they harbored hatred for the Hahoe Mask, he would extract a fair cost.</span></p><br/><p><span style=\"\">Moreover, they would feel a much steeper penalty for messing with him than before.</span></p><br/><p><span style=\"\">Ahn-jaehyun started drawing within his head.  He drew out the future he wanted to see.</span></p><br/><p><span style=\"\">He first drew the scene where the Hahoe Mask put his foot down on the 30 great guilds.</span></p><br/><p><span style=\"\">‘Yes.  I'll grind them up into....’ </span></p><br/><p><span style=\"\">He would step on them, and he envisioned himself standing above them.</span></p><br/><p><span style=\"\">‘I'll become the best, and it'll all be mine....’ </span></p><br/><p><span style=\"\">They would be his stepping stone, and he imagined what would happen after he stood above all of them.</span></p><br/><p><span style=\"\">‘I'll become the best, and······.’ </span></p><br/><p><span style=\"\">He'll rise above them, and.....</span></p><br/><p><span style=\"\">“Hmm.”</span></p><br/><p>6.</p><br/><p><span style=\"\">As he was drawing the picture within his mind, he glanced at the capsule coffee machine.</span></p><br/><p><span style=\"\">When Hyrkan succeeded in the Anugas Raid, the Black Continent started to go through a significant amount of change.</span></p><br/><p><span style=\"\">[The Ruins of the Heard Fortress was released!] </span></p><br/><p><span style=\"\">[Black Continent's First Rest Area has Appeared!] </span></p><br/><p><span style=\"\">[Challenge the Black Continent!] </span></p><br/><p><span style=\"\">The biggest change was the appearance of the Heard Fortress.</span></p><br/><p><span style=\"\">When Anugas was deposed, the captured souls of the Ruined Kingdom's warriors were freed.  They started circulating around the ruins, and the Subjugation Association sent NPCs to research the phenomena.</span></p><br/><p><span style=\"\">This was how a town was created near the ruins of the Heard fortress, and at the same time, the NPCs started giving out various quests.</span></p><br/><p><span style=\"\">The Quests were like road signs.  Up until now, the Users were milling about without having any definite tasks to accomplish.  Therefore, the Quests were like finding sweet water that ended their thirst.</span></p><br/><p><span style=\"\">On top of all of that, a cube capable of Item Production was installed in the town, and a Item Storage facility also came into being.</span></p><br/><p><span style=\"\">“I use the Wyverns to haul my Items.  This is why my wares are expensive.” </span></p><br/><p><span style=\"\">A new NPC accompanied by five enormous Wyverns appeared, and the Users rejoiced at its appearance.  Then the Ingredient Coins and Gems obtained from the Black Continent finally hit the market.</span></p><br/><p><span style=\"\">The Items above level 200 were produced quickly, and these Items started filling up the market.</span></p><br/><p><span style=\"\">In many ways, the Users that had been most daring in this environment had been the Stormhunters guild, and they were also the first ones to push forward.</span></p><br/><p><span style=\"\">[The Stormhunters guild was the first to enter the Ravine!] </span></p><br/><p><span style=\"\">[Stormhunters guild has released the footage of battles conducted within the Ravine!] </span></p><br/><p><span style=\"\">[The Stormhunters guild has revealed their Quests.  'Our next destination is the Balos ruins, and the Olbrid forest.  It is our main goal to push past these locations.  We'll be the main protagonist instead of the Hahoe Mask.’] </span></p><br/><p><span style=\"\">When the Anugas Raid ended, the Stormhunters unexpectedly threw themselves towards the Ravine.</span></p><br/><p><span style=\"\">After the Anugas Raid came to an end, the Hahoe Mask had to take a break to relieve his exhaustion.  Then Hyrkan had to secretly go meet the Blacksmith Olf for the production of the Anugas' necklace.  He received the production Quest, and he had to move to various regions to gather all the Quest ingredients.  The Stormhunters guild once again took the lead position.</span></p><br/><p><span style=\"\">As if they abhorred the idea of falling behind the Stormhunters guild, the other members of the Big 3 started to release news about their gains and achievements.</span></p><br/><p><span style=\"\">[The Red Bulls Guild found the Lost Island in the south!] </span></p><br/><p><span style=\"\">[Hydra Guild has started exploration of the Hell Cave in the west!] </span></p><br/><p><span style=\"\">It was the Red Bulls and Hydra guild.</span></p><br/><p><span style=\"\">After the Immoral Prince episode ended, there was no events that could be pointed out as being a signature achievement for the two guilds.  However, while everyone's attention was focused on the Black Continent located on the other side of the Urugal mountain, they headed towards a location far from the interests of the other Users.  One headed south, and the other headed west.</span></p><br/><p><span style=\"\">The Stormhunters guild conquered the Urugal mountain range in the north.  The Hahoe Mask conquered the Frozen Kingdom in the East.  The two guild wanted to achieve something similar, so they headed south and west.  They wanted to conquer something unknown.  This was a gamble made by these two guilds, and now it was proving to be the winning move.</span></p><br/><p><span style=\"\">Of course, the world was surprised by their news.</span></p><br/><p><span style=\"\">Hyrkan was taken aback by the news. </span></p><br/><p><span style=\"\">“Lost Island?  Hell Cave?” </span></p><br/><p><span style=\"\">‘This is nuts.  Those regions are supposed to be released in the latter half of the Ruined Kingdom?  Why now?’ </span></p><br/><p><span style=\"\">Lost Island and the Hell Cave.</span></p><br/><p><span style=\"\">From Hyrkan's memories, the two locations appeared near the end of the Ruined Kingdom episode.  It was the stages that set up the 4th Main Scenario Quest called the Dragon's Army.</span></p><br/><p><span style=\"\">‘Will these places also give Mythos rank Ancient Power?  Will it?’ </span></p><br/><p><span style=\"\">At the same time, he dug through his memories.  He remembered that the Ancient Power of Darkness and Light could be earned at those locations. </span></p><br/><p><span style=\"\">‘No, it's a guarantee that it'll show up there.  It came out in the Frozen Kingdom and the Urugal mountain range, so it should....’ </span></p><br/><p><span style=\"\">The world was changing by the hour.</span></p><br/><p><span style=\"\">‘This game has gone nuts.  Why would it make sense to pour out all the Mythos Rank Ancient Power at once?’ </span></p><br/><p><span style=\"\">When the Item he wanted the most was completed, Hyrkan started running full tilt on a stage that was completely different from what he remembered.  </span></p><br/><p>7.</p><br/><p><span style=\"\">“The power of the gem is dangerous.  Please use it with discretion.  If you aren't careful, you might push the world towards its ruin.” </span></p><br/><p><span style=\"\">Hyrkan was now familiar with the face in front of him.  The Blacksmith Olf spoke as he passed over a necklace embedded with a thumbnail-sized diamond.  Hyrkan carefully took the necklace.</span></p><br/><p><span style=\"\">[You've gained the Anugas' Necklace.] </span></p><br/><p><span style=\"\">When Hyrkan fondled the necklace, the Item Option popped up on top as a holographic window.</span></p><br/><p><span style=\"\">[Anugas' Necklace] </span></p><br/><p><span style=\"\">*Main Properties</span></p><br/><p><span style=\"\">- Epic Rank Item</span></p><br/><p><span style=\"\">- All Stats +188 </span></p><br/><p><span style=\"\">- Class related Stats +222 </span></p><br/><p><span style=\"\">– Required Level : level 200</span></p><br/><p><span style=\"\">*Sub-properties</span></p><br/><p><span style=\"\">- When equipped, 10% increase in health </span></p><br/><p><span style=\"\">- When equipped, 10% increase in magic</span></p><br/><p><span style=\"\">- When equipped, 10% increase in movement speed</span></p><br/><p><span style=\"\">- When equipped, 10% increase in all damage </span></p><br/><p><span style=\"\">- When equipped, damage received is decreased by 10%</span></p><br/><p><span style=\"\">- When equipped, cool time is decreased by 10% </span></p><br/><p><span style=\"\">- The magic and stamina consumed when using a Skill is decreased by 35%</span></p><br/><p><span style=\"\">- This Item cannot be damaged.</span></p><br/><p><span style=\"\">*Miscellaneous</span></p><br/><p><span style=\"\">This necklace holds the power of the Ancient Weapon Anguas.  It holds the power of its eye. It'll allow the wearer's ability to be brought out to a fearsome level.</span></p><br/><p><span style=\"\">The necklace had a filthy amount of Options, and these were the most desired Options.  Hyrkan let out a sigh of satisfaction as he looked at the Anugas' Necklace.</span></p><br/><p><span style=\"\">“Hooo.” </span></p><br/><p><span style=\"\">After catching Anugas, it took him 5 days to complete the Anugas' Necklace production Quest.</span></p><br/><p><span style=\"\">The tasks he had accomplished flashed before his eyes.  Then he started to think about the memories from his distant past.</span></p><br/><p><span style=\"\">‘I can't believe I've obtained it.’ </span></p><br/><p><span style=\"\">Hyrkan thought about the first time he came up with the ridiculous idea of making an All Strength Necromancer.  He had to come up with with a way to make up the much needed magical energy.  He remembered going around in ridiculous getups.</span></p><br/><p><span style=\"\">Hyrkan had come up with the idea during that time.  If he had an Item similar to Anugas' Necklace, he wouldn't have worried about lacking magical energy.</span></p><br/><p><span style=\"\">However, at the time, he never even considered the fact that he would be able to obtain such an Item.  This was why he never made plans assuming that he'll have such an Item.</span></p><br/><p><span style=\"\">However, he now had the Anugas' necklace.  Hyrkan had considered it to be a unreachable star in the sky.  He had thought it was something he would never be able to catch, yet this star was shining brightly within Hyrkan's grasp.</span></p><br/><p><span style=\"\">‘How much will I be able to get if I sell this?’ </span></p><br/><p><span style=\"\">Afterwards, he thought about it in terms of materialistic value.</span></p><br/><p><span style=\"\">It was inevitable.  Anugas' Necklace wasn't a bound Item.  It could be traded, and the required level was only level 200.  If one considered the Options, it could be used even when one became level 300 or even 400.</span></p><br/><p><span style=\"\">Then there was the fact that Warlord contained rich Users willingly to pay ridiculous amounts of money for Items.  These people were so rich that they didn't know what to do with all their money.</span></p><br/><p><span style=\"\">Currently, there was the original owner of the name Rich Lich named Himala playing this game.  Then there was the original owner of Anugas' Necklace named Mateo Walker.  He wasn't as rich as Himala, but he would gladly pay any price for this Item.  They would easily spend several hundred thousand dollars for it.</span></p><br/><p><span style=\"\">It would be able to turn anyone's life around.  Basically, one could easily buy a building by selling this Item.</span></p><br/><p><span style=\"\">Of course, Hyrkan's thoughts didn't end there.</span></p><br/><p><span style=\"\">‘If I equip the Deposed Prince's Sword, Anugas' Necklace and the Secret Society Ring...’ </span></p><br/><p><span style=\"\">If he used the Deposed Prince's Sword, and the Anugas' necklace, he could reduce his magical energy consumption of his Skills by 60%.  What if he put on the Token of the Secret Society, which increased magical recovery by 20%?  This would be combined with the 10% increase in magic by the Anugas' Necklace.</span></p><br/><p><span style=\"\">‘In reality, the combined effect will reduce my magic consumption by 70%.’ </span></p><br/><p><span style=\"\">It was well over half! </span></p><br/><p><span style=\"\">With those Options as background, he could once again eat expensive consumable Items like he was chewing gum.</span></p><br/><p><span style=\"\">He would no longer feel the lack of magical energy he felt after he gained the Power of Frost.</span></p><br/><p><span style=\"\">Instead, he had magical energy to spare.</span></p><br/><p><span style=\"\">Now he just had to invest in Skills that he couldn't purchase, because he didn't have enough magical energy to spare.</span></p><br/><p><span style=\"\">‘I'll have to burn through Skill Books to obtain the [Conductor] skill.  Then the page of Ancient Power I have....  It'll be fine if I use it on the [Skeleton Knight] rather than the [Golem Summon].'</span></p><br/><p><span style=\"\">Hyrkan decided to invest in his Skeleton Knight.</span></p><br/>\n</div>"}