{"title": "Chapter 164 Anugas Necklace (3)", "id": 164, "volume": 2, "url": "http://boxnovel.org/emperor-of-solo-play-chapter-164-anugas-necklace-3", "volume_title": "Volume 2", "body": "<h1>Chapter 164 Anugas Necklace (3)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 164 – Anugas’ Necklace (3)</p><br/><p>8.</p><br/><p><span style=\"\">The maximum number of Skeleton Warriors able to be summoned through [Skeleton Fragment(A)] was six.  This number increased to 12 when the Necromancer became a Lich as one passed through the 1st and 2nd Advancement.  If one used the Transcendent rank Ancient power at this point, one would be able to summon 18 Skeleton Warriors.</span></p><br/><p><span style=\"\">Similarly, this number could be grown by learning Skills that would allow the increase the  number of Skeletons that could be summoned.  The [Skeleton Magician(A)] allowed one to summon four more Skeletons, the [Skeleton Knight (A)] allowed for an additional six, and the [Chivalry (C)] allowed for four more.</span></p><br/><p><span style=\"\">In the case of the [Skeleton Science(A)], it allowed six more Skeletons, and the maximum number of Skeletons grew to 12 when the Transcendent rank Ancient Power was applied.</span></p><br/><p><span style=\"\">That was a total of 44 Skeleton Warriors.</span></p><br/><p><span style=\"\">Then he could summon the Death Knight, and the Special Skill named [Leader] would allow a total of 12 Skeleton Warriors or Magician to be summoned, and this didn’t include the additional Skeleton Knight.  If he included the Death Knight and the two additional Skeleton Knights he could summon, his Skeleton army was up to 59.</span></p><br/><p><span style=\"\">It was the number of forces he used when Hyrkan fought Anugas.</span></p><br/><p><span style=\"\">However, he was overtaxing his abilities when he summoned all of them.  Moreover, if he had the Power of Frost activated as he used the Bone Explosives, Bone Spears, Bone Armor, Madness Helm and any other Curse related Skills, there was no chance for him to recover his magical energy.  He could drink expensive recovery Items continuously, yet he wouldn't be able to do it.</span></p><br/><p><span style=\"\">This was why Hyrkan had excluded his Golem from the fight with Anugas.  He didn't have the luxury to operate the Golem.</span></p><br/><p><span style=\"\">At the same time, this was also the reason why he had left one of the Scrolls unused.  Hyrkan had thought over it.  </span></p><br/><p><span style=\"\">At the time, he had thought about using the Skill Reinforcement on the Golem Summon or the Skeleton Knights, which would further drained his magical energy.  He hadn't had the Anugas' Necklace yet, so he had worried if he could endure the Spec Up.</span></p><br/><p><span style=\"\">Of course, Hyrkan didn't have to worry about those details anymore.</span></p><br/><p><span style=\"\">Hyrkan looked at the sight in front of him.  He forgot about his worries as he looked at the battlefield.  It wasn't just his recent worries.  The worries he had accumulated over time was all forgotten.</span></p><br/><p><span style=\"\">The sight in front of him was awesome.</span></p><br/><p><span style=\"\">‘As expected of the king of the endgame.’ </span></p><br/><p><span style=\"\">The Death Knight was the focus of the battlefield.  It rode a Skeleton Steed, which was as big as a tree.  It was an enormous beast, yet it could lightly jump over anything.  There was no one on the battlefield that could catch the Death Knight on its steed.</span></p><br/><p><span style=\"\">Basically, the Death Knight was the main star, since it could adapt to any stage.  </span></p><br/><p><span style=\"\">The Horned Wolves were the owners of the Olbrid Forest.  They were known for their powerful skills, and they had an annoying characteristic of traveling in packs.  However, the 5 meter long beasts couldn't do anything in front of the Death Knight's tainted sword.</span></p><br/><p><span style=\"\">Koo-oohng, koo-oohng! </span></p><br/><p><span style=\"\">The Skeleton Steed jumped over its enemies, and the Death Knight stabbed and cut at them.  The Horned Wolves had no way of fighting back.  They showed a bit of their intelligence as they surrounded the Death Knight, but a single leap could destroy their perimeter.</span></p><br/><p><span style=\"\">‘I've gathered five Skeleton Knights.  How frightening.’ </span></p><br/><p><span style=\"\">Then there was the sword swinging Skeleton Knights, who charged into the battle with the Death Knight.  The Skeleton Knights were like the Death Knight's backup dancers.  They didn't received the full spotlight, but they were able to take stage with the main star. </span></p><br/><p><span style=\"\">The Horned Wolves exposed their sides or tails as they chased after the Death Knight.  The Skeleton Knights ran towards the Horned Wolves, and they put all of their momentum at the tip of their swords to pierce the bodies of the Horned Wolves.</span></p><br/><p><span style=\"\">It wasn't as if the Skeleton Knights were lacking in their ability to engage frontal assaults from the Horned Wolves.  It was a given that the Skeleton Knights could block the frightening headbutt by the monsters with their shields.  They were able to use their swords to deflect the unique attack of the horns being used like knives. The Skeleton Knights were also quite skilled at evading blows.  </span></p><br/><p><span style=\"\">The Death Knight cut down its enemy with its overwhelming power.  On the other hand, the Skeleton Knights cut down their enemies with technical skill.</span></p><br/><p><span style=\"\">This was especially true as the last scroll of the Ancient Power was used to strengthen the Skeleton Knight Skill. He had gained the Leader Skill by burning through the 31 No Name Skill books, so he was able to summon 5 Skeleton Knights.  The battles fought by the Skeleton Knights were completely changed at this point.  In the past, the Skeleton Knights had to fight against numerically superior opponents.  However, in most cases, the Skeleton Knights held the numerical superiority now.</span></p><br/><p><span style=\"\">It was a nightmare for the monsters, who had to face them.</span></p><br/><p><span style=\"\">‘The Skeleton Warriors are having a lot of fun.’ </span></p><br/><p><span style=\"\">The Skeleton Warriors looked like excited fans cheering on the star and the backup dancers.  They didn't spare their bodies to help out the Death Knight and the Skeleton Knights.  They were very thorough in killing the remnants of the Horned Wolves.  </span></p><br/><p><span style=\"\">There was only a single wounded Horned Wolf left, and 15 Skeleton Warriors swarmed it like bees.  If the Horned Wolf tried to get close to the Death Knight or the Skeleton Knights, the Skeleton Warriors stopped it even if they had to sacrifice their lives.</span></p><br/><p><span style=\"\">As the battle continued, the surrounding started to be taken over by white frost.  It was as if the stage was being decorated by ice as the field started to freeze.  The vegetation started to struggle from the cold air.</span></p><br/><p><span style=\"\">The pack of 13 Horned Wolves had already taken down a large number of Users over level 200.  These were Users skilled enough to treat the Black Continent as their hunting ground.  However, it didn't take long for these monsters to become corpses by the Skeletons. </span></p><br/><p><span style=\"\">When all the Horned Wolves were killed, Hyrkan held back a smile.</span></p><br/><p><span style=\"\">‘My magical energy...  Ok.  I'll be able to maintain a force of this size now.’ </span></p><br/><p><span style=\"\">He looked at his magical energy status.  It had decreased significantly, but it hadn't bottomed out yet.  Hyrkan smiled after checking the status of his magical energy.</span></p><br/><p><span style=\"\">‘Perfect.’ </span></p><br/><p><span style=\"\">It wasn't as if he was overflowing with magical energy.</span></p><br/><p><span style=\"\">He couldn't maintain this enormous army.  </span></p><br/><p><span style=\"\">For this one battle, Hyrkan had to rack up an incredible amount of expense.  The cost of this battle was akin to the total Consumable Items used by level 150 Users in a Boss Monster Raid.</span></p><br/><p><span style=\"\">He had lost money.</span></p><br/><p><span style=\"\">However, the only thing Hyrkan needed right now was to Level Up through EXP gained through battle.</span></p><br/><p><span style=\"\">If it was a conventional battle, he would have gained financially, but it was impossible to gain money through this battle style.</span></p><br/><p><span style=\"\">If it was the past, Hyrkan would have shuddered at this fact.</span></p><br/><p><span style=\"\">‘This is too perfect.’ </span></p><br/><p><span style=\"\">However, Hyrkan felt satisfied now.</span></p><br/><p><span style=\"\">‘It is as Lich Rich had said.  It'll be possible for me to buy EXP with money.’ </span></p><br/><p><span style=\"\">He was beyond being satisfied.  Hyrkan was in a good mood.  He put the magic recovery candy, which he had bought at a higher than market price, into his mouth, and he chewed it into pieces.</span></p><br/><p><span style=\"\">Afterwards, Hyrkan took out a gem from his pocket, and he squeezed it.  The gem melted, and a flame started to pour out from his clenched fist.</span></p><br/><p><span style=\"\">When the flame spread out on the floor, the Fire Golem took the shape of the Black Hound.</span></p><br/><p><span style=\"\">Hyrkan gestured towards the Black Hound Fire Golem.  He pointed towards a dense patch of the forest.</span></p><br/><p><span style=\"\">Go! </span></p><br/><p><span style=\"\">This was the meaning behind the gesture.  At his gesture, the Black Hound Fire Golem displayed the nature of the Black Hound.  It showed its true nature as a tracker, and it moved faster than any being within the forest.</span></p><br/><p><span style=\"\">The Fire Golem ran through the Olbrid Forest.</span></p><br/><p><span style=\"\">Hwah-roo-roo-roo! </span></p><br/><p><span style=\"\">A trail of fire started to burn behind it, and the fire grew uncontrollably.</span></p><br/><p><span style=\"\">Ah-ooooooooh! </span></p><br/><p><span style=\"\">The fire agitated the Horned Wolves that were filling up the Olbrid Forest.   As they used Howling, the Horned Wolves started to pop out as if they were threatened by the flames.  Hyrkan smiled as he watched the sight.</span></p><br/><p><span style=\"\">‘If I had this much power to use in the Olbrid forest in the past....’ </span></p><br/><p><span style=\"\">His smile suddenly disappeared.  As his smile disappeared, he remembered a certain memory.</span></p><br/><p><span style=\"\">He had goosebumps when he thought about it.  He thought about the worst point in his life as annoyance swept over him.  No matter how much happiness he felt, the memory of that day made him brood over the despair he had felt.</span></p><br/><p><span style=\"\">However, as he thought about it, Hyrkan once again smiled.</span></p><br/><p>9.</p><br/><p><span style=\"\">These words were spoken by the original Rich Lich.</span></p><br/><p><span style=\"\">“I chose to be a Necromancer, because it was the only Class that allowed me to buy EXP with money.” </span></p><br/><p><span style=\"\">As one increased in level, the money needed to stay in the top echelon of Users in Warlord increased exponentially.  This was why the Users in the top one percent used money to buy EXP to stay on the top.</span></p><br/><p><span style=\"\">However, Rich Lich's words hadn't been pointing out this fact.</span></p><br/><p><span style=\"\">“This isn't about efficiency.  The Necromancer can level up the fastest if you pour money into it.” </span></p><br/><p><span style=\"\">This was one of the legendary advice left behind by Rich Lich.  </span></p><br/><p><span style=\"\">When he soloed the Queen Fire Ant, many Users followed behind Rich Lich's steps, and they became Necromancers.</span></p><br/><p><span style=\"\">Of course, they attempted to follow his footsteps,  but it wasn't possible without the vast money spent by Rich Lich.  The desire to mimic him died down.</span></p><br/><p><span style=\"\">However, Rich Lich hadn't lied.</span></p><br/><p><span style=\"\">It was as he had said.  f one compared a Necromancer to a Class of a similar level, it showed an overwhelmingly higher Level Up pace.  However, one needed to spend a stupid amount of money.</span></p><br/><p><span style=\"\">This was why Rich Lich had started a fad, yet there weren’t that many Users, who chose to be a Necromancer in the same vein as Rich Lich.</span></p><br/><p><span style=\"\">The Users that were currently following after the Hahoe Mask was probably feeling the same emotions as the Users that had followed Rich Lich.</span></p><br/><p><span style=\"\">- Didn't the Hahoe Mask just eat the Blue Sapphire candy?</span></p><br/><p><span style=\"\">- ㄴ No way.  The market price on that thing is 490 gold.</span></p><br/><p><span style=\"\">- ㄴ Isn't that something only one eats during a Raid?</span></p><br/><p><span style=\"\">- ㄴ Who the hell eats that even in a Raid?  Even the Users of the 30 great guilds and the Underfoot guilds only eat it during life and death situations.</span></p><br/><p><span style=\"\">- ㄴ FYI, that candy taste terrible.  I’ve eaten it before, and it has a strange taste.  There is a bitter taste.  It is like licking rubber.</span></p><br/><p><span style=\"\">- It is worth 490 gold, yet he is eating it like regular candy.  If he has that much money, wouldn’t it be better to buy steak in real life?</span></p><br/><p><span style=\"\">After the Skull Collector hunt video, the Hahoe Mask released his paid video.  When he released the Anugas Raid video, a million copies was sold on the first day of its release.  He had achieved consecutive hits after the Frozen Kingdom episode.</span></p><br/><p><span style=\"\">Now the brand called the Hahoe Mask had proven itself to be a trustworthy brand in terms of selling paid videos.</span></p><br/><p><span style=\"\">Afterwards, Hahoe Mask surprised everyone by suddenly uploading the battle at the Olbrid Forest as a free video.</span></p><br/><p><span style=\"\">Currently, many new hunting grounds were being unlocked, and the Olbrid Forest was the most difficult location.  However, the Hahoe Mask had been able to traverse the Olbrid Forest by himself, and he was able to sweep away the monsters with overwhelming power.  The Hahoe Mask's presence was beyond electrifying.  His mere presence gave everyone the goosebumps.</span></p><br/><p><span style=\"\">This was what Ahn-jaehyun was aiming for.</span></p><br/><p><span style=\"\">He had worked hard to upload these videos, and he read the reactions in the comment section.  Ahn-jaehyun smiled as he repositioned his glasses.</span></p><br/><p><span style=\"\">‘Yes.  I have to bring this matter to a head.’ </span></p><br/><p><span style=\"\">Ahn-jaehyun drew a picture.  If he followed the layout in his picture, he'll have enough power to step on the 30 great guilds.  However, if he stepped on the heads of the 30 great guilds, these guilds wouldn't just stay still.</span></p><br/><p><span style=\"\">He had to step a guild so hard that the other guilds would wish for him to step over them.  He had to create such a situation.</span></p><br/><p><span style=\"\">He had to show them the different.</span></p><br/><p><span style=\"\">He had to show them that he was in a different league as them! </span></p><br/><p><span style=\"\">He couldn’t express this truth with words.  He had to show it with his skill and results.  </span></p><br/><p><span style=\"\">He had to do it now.  </span></p><br/><p><span style=\"\">The Hahoe Mask couldn’t just show off his outstanding battle capability.  He had to show everyone that he could progress through this game at overwhelming speed.</span></p><br/><p><span style=\"\">This was a game.</span></p><br/><p><span style=\"\">He wasn’t going to conduct a lame war.  In the end, he couldn’t overcome the numerical advantage of the guilds.  However, it was possible for him to gain the highest level.  He could overtake all of them.</span></p><br/><p><span style=\"\">‘I have to learn the [Steel Golem] at level 220, [Ice Golem] at level 230 and the [Skeleton Exhibition[ at level 240.  I'll basically have an army of a hundred.  Wasn't Rich Lich's fighting power at that level when he caught the Queen Fire Ant?’ </span></p><br/><p><span style=\"\">When he reached that point, no one would be able to compete with the Hahoe Mask on the same stage.</span></p><br/><p><span style=\"\">‘Of course, I'm much stronger than Rich Lich when he caught the Queen Fire Ant.’ </span></p><br/><p><span style=\"\">Eventually they will self-destruct on their own.  When the Hahoe Mask appeared in a region, he didn’t want them to get mad.  They would avoid him as if they had stepped on shit.</span></p><br/><p><span style=\"\">If he wanted such result, he needed only one more thing.Ahn-jaehyun touched the Tablet PC.  He didn't have to touch it multiple times.  He just had to touch it once, and Ahn-jaehyun was immediately moved towards a bookmarked page.  He was moved to a Youtube page.</span></p><br/><p><span style=\"\">The title of the page was the FirstOne's Diary.</span></p><br/><p><span style=\"\">‘If I catch him, it'll be the end game.’ </span></p><br/><p><span style=\"\">He was the last prey Ahn-jaehyun had to catch.</span></p><br/><p>10.</p><br/><p><span style=\"\">\"Mmmm.” </span></p><br/><p><span style=\"\">He was called the leader of the Virtual Reality era.  He was the founder of Tobot Soft, Tobi Gwynn.</span></p><br/><p><span style=\"\">He usually displayed a boyish temperament in everything he did, yet he looked different from his normal self.</span></p><br/><p><span style=\"\">The lights, which was always turned to its highest setting, was dimmed.  Tobi Gwynn sat beneath the dimmed light, and  he looked far different from energetic self.  He had gathered his two hands in front of his mouth as if he was praying.  </span></p><br/><p><span style=\"\">One could see him breathing into his hands as if he was trying to warm them.</span></p><br/><p><span style=\"\">His acquaintances wouldn’t believe this was Tobi Gwynn even after seeing him like this.  </span></p><br/><p><span style=\"\">The only one, who was able to see him like this,  was Chen.  He had the unique title of being the leader of the Planning and General Affairs team.</span></p><br/><p><span style=\"\">Tobi Gwynn spoke to Chen.</span></p><br/><p><span style=\"\">“How many months did we lose?” </span></p><br/><p><span style=\"\">“It is impossible to quantify it right now.” </span></p><br/><p><span style=\"\">“We can't calculate it at all?” </span></p><br/><p><span style=\"\">“We can no longer use the expression that we are losing time.” </span></p><br/><p><span style=\"\">Instead of an answer, Tobi Gwynn moved his hands near his mouth.  He started to stroke his rough beard.</span></p><br/><p><span style=\"\">Buffering.</span></p><br/><p><span style=\"\">Chen knew Tobi Gwynn well, and he had named this habit as buffering.</span></p><br/><p><span style=\"\">This meant that Tobi Gwynn was stuck on a problem.</span></p><br/><p><span style=\"\">Chen spoke as he looked at him.</span></p><br/><p><span style=\"\">“It seems the new project backfired.  It was my mistake.  I should have conducted a more proper investigation...” </span></p><br/><p><span style=\"\">“I signed off on it.” </span></p><br/><p><span style=\"\">Tobi Gwynn stopped stroking his chin, and he waved his hand.</span></p><br/><p><span style=\"\">“I don't blame you for that.  In the end, the buck stops with me.  I'm the one, who made the decision.  The new project backfired, and the important thing to do right now is to recover what can be salvaged.  Do you have anything readied for me?” </span></p><br/><p><span style=\"\">“I've readied several projects.” </span></p><br/><p><span style=\"\">Instead of answering, Tobi Gwynn look at Chen’s expression.  The room was darker than usual, so Chen’s emotionless face looked more rigid today.  Tobi Gwynn furrowed his brows.</span></p><br/><p><span style=\"\">Chen interpreted it as a sign for him to speak, so he gave his answer.</span></p><br/><p><span style=\"\">“All the projects up until now hasn't worked at all.  I don't think any of the project I've prepared will work.” </span></p><br/><p><span style=\"\">“What is the FirstOne's level?” </span></p><br/><p><span style=\"\">It was a sudden question, yet Chen didn’t hesitate to answer the question.  It was obvious that he knew the answer.</span></p><br/><p><span style=\"\">“He is level 245.” </span></p><br/><p><span style=\"\">“The estimated time....  Yes...  The report said 155 days, 22 hours and, 11 minutes.” </span></p><br/><p><span style=\"\">Tobi Gwynn had asked the question, yet he answered it.  He found the answer inside his head.  Afterwards, he stopped stroking his beard.</span></p><br/><p><span style=\"\">The area around his mouth twitched, but that was it.  </span></p><br/><p><span style=\"\">He opened his mouth.</span></p><br/><p><span style=\"\">“The name of the Hydra guild's leader...  Eric Gomes.  Yes, his name was Eric Gomes.  He worked at Wall Street, and he mainly traded in regards to startups in the Silicon Valley.  I'm pretty sure I saw this number before....” </span></p><br/><p><span style=\"\">As he mumbled to himself, Tobi Gwynn started poking at his desk.  A hologram shaped as a phone appeared in front of Tobi Gwynn's eyes.</span></p><br/><p><span style=\"\">The holographic phone started to ring.</span></p><br/><p><span style=\"\">Tobi Gwynn spoke in a low voice as the ring continued.</span></p><br/><p><span style=\"\">“I hope I correctly remembered his number.” </span></p><br/><p><span style=\"\">- This is Eric Gomes.  Who is this?</span></p><br/><p><span style=\"\">The conversation was about to start, so Chen quietly exited the room. Tobi Gwynn opened his mouth.</span></p><br/><p><span style=\"\">“I'm Tobi Gwynn. ” </span></p><br/><p><span style=\"\">- Tobi Gwynn?  Tobi, Tobi, Tobi....  My god. </span></p><br/><p><span style=\"\">“We've met once before.  I remembered the number from that time.” </span></p><br/><p><span style=\"\">- I remember the meeting.  It was 6 years ago.  It was a party where 500 people gathered.</span></p><br/><p><span style=\"\">“I would like to speak to you.” </span></p><br/><p><span style=\"\">- Please wait a moment.  I'm in the midst of a hunt...  I'll need a little bit more time.</span></p><br/><p><span style=\"\">“I understand.  I understand that the game you are playing is a bit difficult and annoying.  I fully understand.” </span></p><br/><p><span style=\"\">Tobi Gwynn was joking, but his expression had hardened.</span></p><br/>\n</div>"}