{"title": "Chapter 176 Red Desert (3)", "id": 176, "volume": 2, "url": "http://boxnovel.org/emperor-of-solo-play-chapter-176-red-desert-3", "volume_title": "Volume 2", "body": "<h1>Chapter 176 Red Desert (3)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 176 – Red Desert (3)</p><br/><p>7.</p><br/><p><span style=\"\">The Wood Devil’s body was made out of rocks, trees and dirt.  It was starting to disintegrate.  At first, the heaviest stones fell to the floor, and from where the stones were dislodged, soil started to flow out like blood.  </span></p><br/><p><span style=\"\">On the surface of the Wood Devil’s body, armored Skeleton Warriors were stuck to it.</span></p><br/><p><span style=\"\">They held onto the thick wooden branches protruding from the Wood Devil’s body with their left hand, and they tirelessly stabbed with the blade in their right hand.  The Skeleton Warriors’ work made the Wood Devil’s body looked ragged, and it was being turned into a mess.  </span></p><br/><p><span style=\"\">The one to launch the strongest offensive attacks was the Death Knight, who faced the Wood Devil head on.</span></p><br/><p><span style=\"\">Koong, koong, koong! </span></p><br/><p><span style=\"\">Each headbutt of the Skeleton Steed made the Wood Devil lose its balance, and the Death Knight used this opportunity to stab its sharp blade into the body of the Wood Devil.</span></p><br/><p><span style=\"\">The Death Knight’s attack was very precise, and it attacked the whole body.  </span></p><br/><p><span style=\"\">The Death Knight used decisive swings to attack the neck, chest and waist of the Wood Devil.  The attacks varied, but the damage it caused was consistent.  It kept stabbing and slashing at the same locations.  The Death Knight looked like a skilled lumberjack using an axe to take down a large tree.</span></p><br/><p><span style=\"\">Koong! </span></p><br/><p><span style=\"\">In the end, the large body of the Wood Devil fell to the ground from the continuous assault. The fallen Wooden Devil didn’t even twitch.  Its devil-like visage was gone.  The Wood Devil’s corpse looked as if it had been impacted by a typhoon.  The stones, woods and soil was spread around everywhere as if it had faced the teeth of the wind.</span></p><br/><p><span style=\"\">Two Users were staring at the sight with a blank expression.  It looked as if their souls had been sucked out.  They yelled out at the same time.</span></p><br/><p><span style=\"\">“My level just increased!” </span></p><br/><p><span style=\"\">“My level went up.” </span></p><br/><p><span style=\"\">The battlefield had been filled with the sound of swords, roars, and the unique bone clacking of the Skeletons.  Now the battlefield started to be filled with the voices of people.</span></p><br/><p><span style=\"\">“This is incredible.” </span></p><br/><p><span style=\"\">“I heard the Wood Devil gave out a lot of EXP, but I never expected it to be this much….   It is only a mid-sized monster, but it has the EXP of a large monster.” </span></p><br/><p><span style=\"\">“It just took 2 days to increase one level.  If we maintain this speed, maybe we will be able to catch up to the First One?” </span></p><br/><p><span style=\"\">“I thought the Wood Devils aren’t supposed to be this easy to take down?” </span></p><br/><p><span style=\"\">“Don’t you have eyes?  Numerous Skeletons continuously attacked it, yet it lasted for over 10 minutes.  It was this short, because we are talking about the Hahoe Mask-nim.  I bet over a dozen ordinary Users would have to attack to defeat it!” </span></p><br/><p><span style=\"\">“It is what it is.  So why are you getting angry at me?” </span></p><br/><p><span style=\"\">“I didn’t get angry at you?” </span></p><br/><p><span style=\"\">“What the hell was that bullshit from before?  Was it some kind of a hysterical fit?” </span></p><br/><p><span style=\"\">“Hey!” </span></p><br/><p><span style=\"\">“What?” </span></p><br/><p><span style=\"\">The noise around him was quite loud.  It was funny, but when he heard the bickering, he understood how a certain woman felt.</span></p><br/><p><span style=\"\">‘Che-sulyun always has Hatch and Hahui in front of her.  I think I can understand a little bit as to what she has to go through.’ </span></p><br/><p><span style=\"\">Yojori and Joba was similar to the Hahui and Hatch, who represented the Stormhunters guild.</span></p><br/><p><span style=\"\">They continuously fought with words, but when the battle started, they showed teamwork that was better than what most Users could pull off.  It wasn’t just the fact that they were individually talented.  The two of them had experienced fighting alongside each other for a long time.</span></p><br/><p><span style=\"\">‘This game has a lot of interesting people.’ </span></p><br/><p><span style=\"\">The Crusader was a Striker type occupation under the Priest Class.  The Magic Swordsman type was under the Magician Class.  Their ability to cooperate with each other was the secret reason why they were able to reach level 200 with such difficult occupations.</span></p><br/><p><span style=\"\">Hyrkan also had someone, who had filled such a role.</span></p><br/><p><span style=\"\">‘There are a lot of shitty humans too’ </span></p><br/><p><span style=\"\">He had a comrade whom he had thought he could entrust his back to.</span></p><br/><p><span style=\"\">“You did well.” </span></p><br/><p><span style=\"\">Whistling stared at the two Users.  After Hyrkan started the battle, Whistling hadn’t had the opportunity to unsheath his sword for two days.  It was a very novel experience, and he gave a word of encouragement to Hyrkan.  Whistling had a peculiar expression his face.</span></p><br/><p><span style=\"\">He was apologetic and surprised.  Several complex emotions arose within him anew.</span></p><br/><p><span style=\"\">In the past, he had searched for the Elven Forest, and Hyrkan had leveled up quickly thanks to Whistling’s help.  Now Hyrkan was helping Whistling in the same way.  He just watched as his level went up, and it was great…  However, such a short sentence was inadequate to describe what he was feeling.</span></p><br/><p><span style=\"\">Hyrkan shrugged his shoulder.</span></p><br/><p><span style=\"\">“The Skeletons are doing the heavy lifting, not me.” </span></p><br/><p><span style=\"\">Accompanying those words, Hyrkan put a candy in his mouth.  It was as Hyrkan had said.  The fighting was all done by his Skeletons.  He didn’t even need to summon his Golems for the Wood Devils.   He had a Death Knight and two Skeleton Knights out.  Then there were the 20 Skeleton Warriors and three Skeleton Magicians.  Hyrkan maintained this exact number.</span></p><br/><p><span style=\"\">It was a figure he came up with through experimentation as he had hunted inside the Highwood Forest for 10 days.</span></p><br/><p><span style=\"\">Of course, nothing was free.  Hyrkan repeatedly ate expensive magic recovery Items as he continued his battles.</span></p><br/><p><span style=\"\">Hyrkan quickly crunched and grinded the Item into small pieces as he tried to recover his magical energy as soon as possible.  Hyrkan looked grim as he did so, and this was when he looked the most combative.</span></p><br/><p><span style=\"\">“You really eat an endless supply of those Items.” </span></p><br/><p><span style=\"\">“My brand of fighting always puts me at a loss in terms of profit.  If I don’t bring in so much profit through my videos, this would be too unprofitable to continue.  Of course, I’m leveling up, so after calculating all factors, I can say I come out ahead.   That damn levels.” </span></p><br/><p><span style=\"\">At Hyrkan’s words, Whistling’s mouth cracked open a little bit.  It seemed he was about to say something, but in the end, he shut his mouth.  He even swallowed most of what he had been about to say.</span></p><br/><p><span style=\"\">“...you are enduring hardships.” </span></p><br/><p><span style=\"\">“I’m not enduring any hardship.  As I said before, my Skeletons are doing all the heavy lifting.” </span></p><br/><p><span style=\"\">Hyrkan smiled as he looked at his Skeletons.  </span></p><br/><p><span style=\"\">Whistling lightly nodded his head when he saw this.</span></p><br/><p><span style=\"\">“Well, let’s dismantle the Wood Devils.” </span></p><br/><p><span style=\"\">At Hyrkan’s words, the argument between Yojori and Joba ended like magic.  At the same time, the two of them shouted towards Hyrkan.</span></p><br/><p><span style=\"\">“I’ll do it!” </span></p><br/><p><span style=\"\">“I want to do it!” </span></p><br/><p><span style=\"\">They were freakishly in sync in whatever they did.  However, this was also the cause of their arguments.</span></p><br/><p><span style=\"\">Anyways, they were working hard to repay the generosity shown by the him.</span></p><br/><p><span style=\"\">Hyrkan shrugged his shoulders, and Whistling opened his mouth.</span></p><br/><p><span style=\"\">“I’ll do it.” </span></p><br/><p><span style=\"\">Hyrkan turned around to look at Whistling, and Whistling shrugged his shoulder.</span></p><br/><p><span style=\"\">“I’m riding such a great bus for free.  I should at least pick up the trash rolling around in the bus.”</span></p><br/><p>8.</p><br/><p><span style=\"\">“The Hahoe Mask is back again?” </span></p><br/><p><span style=\"\">Currently, all the Users using the Highwood Forest as their main hunting ground were from the same guild.  </span></p><br/><p><span style=\"\">Big Smiles guild.</span></p><br/><p><span style=\"\">When the members of the Big Smiles guild heard that the Hahoe Mask had appeared once again, they tsked and hemmed. </span></p><br/><p><span style=\"\">“That son of a bitch is treating this place as if it is his front yard.” </span></p><br/><p><span style=\"\">“It would have been better if it was his front yard.  This is our house.  He is in our front yard, and the Hahoe Mask is a thief.” </span></p><br/><p><span style=\"\">“We are the retarded ones.  We spotted a thief, yet we are making it easier for the thief.” </span></p><br/><p><span style=\"\">Their average level was 228.  It wasn’t low at all.  Even if they searched the entirety of Warlord, not many people have yet to achieve this level.  Of course, these were the core members of Big Smiles.  They were the big guns of the guild.</span></p><br/><p><span style=\"\">The guild had wholeheartedly supported them, so they could level up.  They had personal Level Up support teams, and they fought against anything that would impede them from leveling up even in real life.  These Users ran on treadmills, and they worked out to train their bodies.</span></p><br/><p><span style=\"\">They weren’t playing this game for fun.  This was their occupation.</span></p><br/><p><span style=\"\">From their perspective, they had been running full tilt on track when a monster like King Kong or a dinosaur had appeared.  Of course, they wouldn’t look kindly towards such an impediment.</span></p><br/><p><span style=\"\">“Maybe sub-guildmaster Heh-bibin is right.  This is ridiculous.  Why do they think we won’t be able to kill the Hahoe Mask if we go out in force?  Why do we have to leave that bastard alone?” </span></p><br/><p><span style=\"\">Antipathy always brought out bitter words.</span></p><br/><p><span style=\"\">“Still, why should we unnecessarily bother the Hahoe Mask?  This is something decided by the Five Stars.  They decided to leave the Hahoe Mask alone.” </span></p><br/><p><span style=\"\">“It wasn’t the Five Star.  It was a decision made by the V&amp;V guild.  In the end, the Five Stars are servants of the V&amp;V guild.” </span></p><br/><p><span style=\"\">“You words are a bit······.” </span></p><br/><p><span style=\"\">Moreover, bitter words always took hold easily.</span></p><br/><p><span style=\"\">“You aren’t wrong.  In truth, we have to settle a quarrel with the Hahoe Mask.   I can’t even go around telling people I’m with the Big Smiles guild, because of that bastard.  If I tell people I’m from the Big Smiles guild, the first thing they do is to ridicule me.” </span></p><br/><p><span style=\"\">“Guild master Brooks is basically a puppet of Sinclair, and Sinclair sides with the V&amp;V guild.  In the first place, didn’t V&amp;V hire him as a mercenary?  Sub-guild master Heh-bibin is right.  If things remain the same, we’ll just be used.” </span></p><br/><p><span style=\"\">“Hey, what are you talking about?  If Sinclair-nim didn’t join us, we would be in a worse situation right now.” </span></p><br/><p><span style=\"\">“This is this and that is that” </span></p><br/><p><span style=\"\">“Let’s be honest.  Wouldn't it be worth it to kill the Hahoe Mask?  If we do manage to kill him, the sale of the footage would be astronomical.  Moreover, no one would disparage us for trying to kill the Hahoe Mask with a lot of Users.  It isn’t as if we did anything wrong this time around.  Hahoe Mask wronged us first.” </span></p><br/><p><span style=\"\">“We are clearly on the moral high ground here.” </span></p><br/><p><span style=\"\">As the conversation continued, someone spoke up.</span></p><br/><p><span style=\"\">“In a situation like this, isn’t the Killer supposed to fight the Hahoe Mask?  I know we’ve had success recently thanks to the Killer, but why do we have to admit defeat before the fight?” </span></p><br/><p><span style=\"\">“You guys are taking this way too seriously.” </span></p><br/><p><span style=\"\">“These are harsh words, but we aren’t wrong.” </span></p><br/><p><span style=\"\">“Of course, you guys are in the wrong!  What if Killer loses?  It’ll be the end of us!” </span></p><br/><p><span style=\"\">“Does losing to the Hahoe Mask actually hurt us?  If so, Sohank would have never recovered from his prior loss.” </span></p><br/><p><span style=\"\">“I would be more understanding if we had lost a PVP match to the Hahoe Mask.  However, this isn’t the case.  There is a difference between losing and cowardice.” </span></p><br/><p><span style=\"\">“No.  Our situation right now…..” </span></p><br/><p><span style=\"\">The debate wasn’t showing any signs of dying down.</span></p><br/><p><span style=\"\">Some Users stopped participating in the discussion, and they just observed what was said. </span></p><br/><p><span style=\"\">-  We are luring a Wood Devil.  Please get ready for battle.</span></p><br/><p><span style=\"\">When the Users received a message from the Level Up support team, they put a pause to their conversation for now.</span></p><br/><p>9.</p><br/><p><span style=\"\">They went past the Highwood Forest, and they arrived at the Red Desert.</span></p><br/><p><span style=\"\">Hyrkan no longer hunted any monsters.</span></p><br/><p><span style=\"\">He ran.</span></p><br/><p><span style=\"\">He ran full tilt.</span></p><br/><p><span style=\"\">The others also ran.</span></p><br/><p><span style=\"\">Shweeek!  Shweeek! </span></p><br/><p><span style=\"\">A Sand Snake was closing the distance at incredible speed as the four Users ran.</span></p><br/><p><span style=\"\">At that moment, Hyrkan threw two Skeleton Fragments.</span></p><br/><p><span style=\"\">They were running too fast, so the Skeleton Warriors formed after the Sand Snake had slithered past the Skeleton Fragments.  However, the Skeleton Warriors immediately caught up to the Sand Snake, and they attacked the hard body of the monster. </span></p><br/><p><span style=\"\">Kyahhh! </span></p><br/><p><span style=\"\">The Sand Snake stopped its pursuit.  It took one of the Skeleton Warrior in its mouth, and it burrowed into the ground.</span></p><br/><p><span style=\"\">The remaining Skeleton Warrior looked around as its comrade and enemy disappeared.</span></p><br/><p><span style=\"\">‘This is ridiculous..’ </span></p><br/><p><span style=\"\">Hyrkan had used the Skeleton Warriors as bait.  Hyrkan and the three others in his party was able to put a significant amount of distance from the Sand Snake using this method.</span></p><br/><p><span style=\"\">However, they didn’t stop running.  </span></p><br/><p><span style=\"\">They kept running as if nothing had happened, and they talked as they ran.</span></p><br/><p><span style=\"\">“It seems even Hahoe Mask-nim has a hard time driving the bus in the Red Desert.” </span></p><br/><p><span style=\"\">“Hey.  You should keep that kind of talk to yourself.  Why do you have to say that out loud?” </span></p><br/><p><span style=\"\">“Ah.  I’m sorry.  My mouth gets away from me sometimes…·.” </span></p><br/><p><span style=\"\">Hyrkan let out a bitter laugh at their words.</span></p><br/><p><span style=\"\">The current situation was unfolding as he had expected.  When they entered the Red Desert, he gave up on hunting the monsters.  He focused on heading towards the directions pointed out by the Gem Conch.</span></p><br/><p><span style=\"\">It wasn’t impossible for Hyrkan to take down all the Sand Snakes.  However, problems would arise if one of his three party members were taken below the sand.  At that point, Hyrkan couldn’t save them.  Also, it was true that Sand Snake was much harder to catch than the Wood Devils.</span></p><br/><p><span style=\"\">“Do you know this trivia?  Originally, the Sand Snake monster wasn’t a monster.” </span></p><br/><p><span style=\"\">Joba didn’t want Hyrkan’s mood to sour from his previous remark.  Joba changed the topic. </span></p><br/><p><span style=\"\">“Is there a story behind it?” </span></p><br/><p><span style=\"\">Hyrkan showed a little bit of interest.  Even if they were running full tilt, no one was out of breath.  In such a boring marathon, talking was a great way to pass the time.</span></p><br/><p><span style=\"\">Moreover, Yojori and Joba told entertaining stories, and there were a lot of substance behind their stories.  In regards to certain topics, they knew more than Hyrkan.</span></p><br/><p><span style=\"\">“The Sand Snake was a mode of transportation used by Elves and Dwarves, who lived in the Red Desert.  They used the Sand Snakes to travel through the underground tunnels.” </span></p><br/><p><span style=\"\">“What a weird transportation method.” </span></p><br/><p><span style=\"\">“Before the Barley Kingdom became eradicated by the Dragon’s Curse, a passage was handed down.  The exact words were...” </span></p><br/><p><span style=\"\">“To avoid the Dragon’s Curse, the ground snake was used to make an underground world.  The power will allow one to fight it.   One’s will to fight and the path to the future will be placed there.” </span></p><br/><p><span style=\"\">“Ah. That’s it.  It was that phrase.” </span></p><br/><p><span style=\"\">“You should memorize the information sometimes.” </span></p><br/><p><span style=\"\">“The interesting part was the specific terms used in the passage.  It said the power will allow one to fight it.  It means there is a high chance that there will be only a single opponent one would have to face later.” </span></p><br/><p><span style=\"\">“Just one?” </span></p><br/><p><span style=\"\">Hyrkan titled his head in puzzlement.</span></p><br/><p><span style=\"\">Joba immediately gave an explanation.</span></p><br/><p><span style=\"\">“Currently, four Dragons had appeared in regards to the Main Scenario Quest.  The north held the Frost Dragon’s Curse.  The east held the Fire Dragon’s Curse at the Urugal mountain range.  The south has the Light Dragon’s Curse.  The blinding light had kept an island hidden from plain sight.  The last one was located in the west at the Hell’s Cave.  It holds the Darkness Dragon’s Curse.” </span></p><br/><p><span style=\"\">“Then there was the story of an almighty being giving a divine punishments using thunder!  The writings regarding this subject was found.  If one puts all this information together, there are five of them.  If one looks at the account left behind in the Record Tree, it often refers to the Dragons in plural terms.” </span></p><br/><p><span style=\"\">Hyrkan couldn’t help, but laugh after hearing their story.</span></p><br/><p><span style=\"\">‘They really are more informed about the game compared to me.’ </span></p><br/><p><span style=\"\">They were talking about the five powers related to the Mythos Rank Ancient Power.  Of course, Hyrkan knew about it.</span></p><br/><p><span style=\"\">However, Hyrkan knew it, because he had come back to the past.  </span></p><br/><p><span style=\"\">How much effort did these people have to expend to acquire such knowledge?</span></p><br/><p><span style=\"\">There was no way their effort would have been poor.</span></p><br/><p><span style=\"\">“You are very well informed.  Incredible.” </span></p><br/><p><span style=\"\">Hyrkan knew the difficulties, so his compliments were genuine.  He was really impressed.</span></p><br/><p><span style=\"\">The fact that they were acknowledged by the Hahoe Mask put smiles on Yojori and Joba’s face.</span></p><br/><p><span style=\"\">In truth, they were part of the fringe element.  </span></p><br/><p><span style=\"\">Even if they put in a lot of effort into their type of work, not many people acknowledged their excellence.</span></p><br/><p><span style=\"\">The Hahoe Mask was the most mainstream User in Warlord.  The fact that they received a simple compliment from him was a treat</span></p><br/><p><span style=\"\">“This is a secret.  Aside from the Hydra guild, we sometimes exchange ideas and opinion with  other like minded friends.”</span></p><br/><p><span style=\"\">“Quest Man has especially been a big help to us.” </span></p><br/><p><span style=\"\">They had the opportunity to talk about a subject they had kept hidden from others.  This was why they were excited.</span></p><br/><p><span style=\"\">“Quest Man?” </span></p><br/><p><span style=\"\">“He is called Zeet.  He is pretty low leveled, but he is a User, who really digs into Quests in Warlord.” </span></p><br/><p><span style=\"\">Hyrkan tilted his head. </span></p><br/><p><span style=\"\">‘Zeet?  Isn’t he... No way.’ </span></p><br/><p><span style=\"\">A name he knew had come up, but Hyrkan dismissed the idea.  </span></p><br/><p><span style=\"\">At the very least, the Zeet he knew would not associate himself with these noisy pair.   He couldn’t imagine them finding enough common ground to keep in contact with each other. </span></p><br/><p><span style=\"\">“The Quest Man is really incredible.  Amongst the regular Users, he probably knows the most about the setting, and the outlook of Warlord.  Ah.  Please don’t tell the Hydra guild about this…  This is our secret….” </span></p><br/><p><span style=\"\">Even though they were affiliated with a large guild, these two had pursued their own goals.  They pursued the romanticism inside the game.</span></p><br/><p><span style=\"\">Both the current Hyrkan and the Hyrkan before he came to the past would never have thought about doing such activities.</span></p><br/><p><span style=\"\">This was why Hyrkan unconsciously spoke the truth.. </span></p><br/><p><span style=\"\">“You guys make the game fun.” </span></p><br/><p><span style=\"\">“What?” </span></p><br/><p><span style=\"\">The two of them looked stupefied at the words spoken by Hyrkan.</span></p><br/><p><span style=\"\">“Isn’t that why we play the game? If the game isn’t fun, why would we play this game?” </span></p><br/><p><span style=\"\">“Whatever.  Aren’t you here to drool at the Elves?” </span></p><br/><p><span style=\"\">“What about you?” </span></p><br/><p><span style=\"\">“At the very least, I don't drool just from seeing the Elves.” </span></p><br/><p><span style=\"\">“Aigo.  Of course.  You drool every time you see a handsome NPC.” </span></p><br/><p><span style=\"\">They started bickering again, and Hyrkan stayed out of it.  </span></p><br/><p><span style=\"\">In truth, they weren’t really fighting with words.  Hyrkan was well aware of this fact now.  They just liked bouncing ideas and words off of each other.  This was a routine they performed.  It was like the daily routines performed by a couple.</span></p><br/><p><span style=\"\">However, Whistling was the one to stop their conversation.</span></p><br/><p><span style=\"\">“East!  The direction changed to the east!” </span></p><br/><p><span style=\"\">Whistling had placed the Gem Conch to his ear, and the instruction had changed to point them towards the east.</span></p><br/><p><span style=\"\">Once again, they were running full tilt towards their destination.  Hyrkan returned to being himself as he shut away everything that bothered him.</span></p><br/>\n</div>"}