{"title": "Chapter 183 Golden Conch (2)", "id": 183, "volume": 2, "url": "http://boxnovel.org/emperor-of-solo-play-chapter-183-golden-conch-2", "volume_title": "Volume 2", "body": "<h1>Chapter 183 Golden Conch (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 183 – Golden Conch (2)</p><br/><p>4.</p><br/><p><span style=\"\">The Highwood Forest was quiet.  This place used to have battles occurring for twenty-four hours seven days a week.  However, it was different now.  The Wood Devils were standing still as if they were statues, because they couldn’t find any enemies.  They stood patiently like old trees as they waited for a battle.</span></p><br/><p><span style=\"\">A User wearing a hood was running through this tranquil stage.  The User moved at high speeds to avoid the monsters.  The User wearing the hood skillfully avoided moving within the Wood Devil’s awareness range and aggro range.  He was blazing through the Highwood Forest at high speeds.</span></p><br/><p><span style=\"\">In a flash, the User escaped the confines of the Highwood forest to arrive at a landscape filled with red sand.  When he stepped onto the Red Desert, he immediately modified the wristwatch.</span></p><br/><p><span style=\"\">“Slot on.” </span></p><br/><p><span style=\"\">After the short command word, imposing pieces of spotted metal started to encase the hooded User like snakes.  It started with the helm.  Then it moved to the chest and limbs.  In the end, the gleaming armor took form on the User, and he pushed up his face guard. His face was uncovered.  One could see the sight of the Hahoe Mask.</span></p><br/><p><span style=\"\">Hahoe Mask Hyrkan.</span></p><br/><p><span style=\"\">Currently, Warlord was gripped with shock, fear and fanaticism.  The one to put Warlord in such a state returned to the eye of the storm.  He appeared at the place where the earthquake originated.</span></p><br/><p><span style=\"\">“Uh-whew.” </span></p><br/><p><span style=\"\">After catching his breath for a short moment, Hyrkan turned his head to look at the Highwood Forest.  He had participated in an incredible battle here.  The war waged here so intense, and the implications were immense.  Even now he could bring up the memories of the battle at will.  The memories and the feelings he had felt in the war was clear inside his mind.</span></p><br/><p><span style=\"\">‘I did it.’ </span></p><br/><p><span style=\"\">Of course, at the end, he had mounted the Bone Wyvern, and he had yelled out his destination.  The Bone Wyvern split the winds and they had flown past the Highwood Forest.  The feeling he felt from the air was also clear inside his mind.  As he vividly recalled the sensation he felt, Hyrkan’s body felt an electric charge run up his body.</span></p><br/><p><span style=\"\">Whether it was before he had returned to the past or after he had returned to the past, he had always wanted to accomplish this task, and he had done it.</span></p><br/><p><span style=\"\">He ruthlessly stomped and crushed a 30 great guild.  Now he didn’t have to to run away.  He was able to hold his head up high with pride and aloofness.  He was able to look down on their heads, and he could dictate their response.</span></p><br/><p><span style=\"\">‘Yes.  This is me.  This is the person I am within Warlord.’ </span></p><br/><p><span style=\"\">He had wanted to show them all.  Hyrkan wasn’t someone they could step on.</span></p><br/><p><span style=\"\">Before he returned to the past, he had been crushed before he could even struggle.  It had been a one-sided affair, but this didn’t mean he was inferior to them.  Hyrkan had suffered not because he had been pitifully weak.</span></p><br/><p><span style=\"\">He wanted to improve himself to prove a point.</span></p><br/><p><span style=\"\">‘....if I hadn’t been betrayed, I would have seen this sight before I returned to the past.’ </span></p><br/><p><span style=\"\">This was a sight that could only be seen after stepping over people.</span></p><br/><p><span style=\"\">He had really wanted to see it, and he had been sure he would be able to see it.</span></p><br/><p><span style=\"\">He had thought he would be able to step above the 30 great guilds if he stayed together with the Hahoe Mask guild.  He had been able to see a sight that he always wanted to see with the Hahoe Mask guild.</span></p><br/><p><span style=\"\">Now he had elevated by stepping on the great guilds by himself, and he could admire the scenery. </span></p><br/><p><span style=\"\">He was still short in achieving his dream, but he was in the process of bringing it to bear.</span></p><br/><p><span style=\"\">Hyrkan turned his head to look at the endless Red Desert.</span></p><br/><p><span style=\"\">This was only the bottom of the scenery he wanted to see.</span></p><br/><p><span style=\"\">Hyrkan walked towards his vision.</span></p><br/><p>5.</p><br/><p><span style=\"\">[Your Level has increased.] </span></p><br/><p><span style=\"\">When he heard the Level Up announcement, Hyrkan slid down the Sand Snake’s body as if he was on a slide.</span></p><br/><p><span style=\"\">Then he turned his head to look at the status of the Sand Snake.</span></p><br/><p><span style=\"\">The Sand Snakes were called the assassins of the Red Desert.  However, it was in such a pitiful state that it felt shameful to attach such a notorious nickname to the Sand Snake.</span></p><br/><p><span style=\"\">A Sand Snake was tangled up with the body of another Sand Snake.   It was a sight akin to thick ropes tangled in a mess.</span></p><br/><p><span style=\"\">The Ingredient Gem of a Sand Snake had a very low drop rate, yet Hyrkan had used the Clay Play skill to create a Sand Snake Earth Golem.  This was the first time he had tried this strategy, and it was very effective.</span></p><br/><p><span style=\"\">‘An eye for an eye, and a tooth for a tooth.  Should that be the title of my next video?’ </span></p><br/><p><span style=\"\">Hyrkan looked at the wretched sight of the monster, and he had a satisfied expression on his face. His plan had panned out, so he felt satisfied.</span></p><br/><p><span style=\"\">Of course, this wasn’t a cheap plan either.</span></p><br/><p><span style=\"\">The Sand Snake’s Ingredient Gem was currently being traded for a very high price.  Moreover, this result couldn’t be achieved with a normal Golem.  A Golem had to be reinforced by the Transcendent Rank Ancient Power to replicate this sight.</span></p><br/><p><span style=\"\">Currently, the only one able to use this method in Warlord was Hyrkan.</span></p><br/><p><span style=\"\">‘This was clean.’ </span></p><br/><p><span style=\"\">It was a key point.</span></p><br/><p><span style=\"\">Hyrkan knew the Big Smiles guild wouldn’t continue to leave him alone. They’ll attack Hyrkan when the opportunity presents itself.  No, they’ll try to create the opportunity by using all kinds of tricks. </span></p><br/><p><span style=\"\">Moreover, this was no longer only about the Big Smiles guild.  Most of the 30 great guilds would consider the Hahoe Mask as an enemy.</span></p><br/><p><span style=\"\">It had been so in the past, and there was no reason that would lead him to believe that things would change this time around.</span></p><br/><p><span style=\"\">However, he didn’t plan on avoiding a fight.  He’ll fight.</span></p><br/><p><span style=\"\">As an exchange, it wouldn’t be on a stage where it gave them the advantage.  Hyrkan will fight them on a stage where he’ll have the advantage.</span></p><br/><p><span style=\"\">‘I have to go deeper.’ </span></p><br/><p><span style=\"\">He had to move deeper into locations where powerful monsters were populated.  He had to be at locations where there were a lot of obstacles and strife.</span></p><br/><p><span style=\"\">The 30 great guild’s era of prosperity would burst like a bubble.  Everything Hyrkan possessed would become effective weapons against them.</span></p><br/><p><span style=\"\">The war that had started would end there.  It’ll end when he reached the deepest location in this game.</span></p><br/><p><span style=\"\">Hyrkan raised his head, and he looked at the large forest that looked like a mirage.</span></p><br/><p><span style=\"\">‘Let’s see this through to the end.’ </span></p><br/><p><span style=\"\">He’ll go to the deepest point inside this game.  He’ll reach the end of this game, and it’ll be the final stage for his war.</span></p><br/><p>6.</p><br/><p><span style=\"\">The Elves with red skin was aiming their arrows towards Hyrkan.  The arrowheads were frighteningly sharp.</span></p><br/><p><span style=\"\">However, Hyrkan was relaxed as he faced the arrowheads, and he folded his arms as he took everything in.</span></p><br/><p><span style=\"\">There was a warrior of the Red Elf tribe in front of Hyrkan.  The NPC named Hing was looking over the lump of gold.  It had red skin and black eyes.  It was also wearing an armor made out of ingredients gathered from the Sand Snake.  The Red Elf was beautiful,  but the sense of alienness was larger than sense of mystery he felt.</span></p><br/><p><span style=\"\">‘It would have been great if Whistling’s Family saw this.’ </span></p><br/><p><span style=\"\">He could imagine what Whistling and his two comrades would say.  The man and the woman would talk endlessly.  Hyrkan had a faint smile as he shook his head a little bit.</span></p><br/><p><span style=\"\">It seemed he would have to set a date to meet. Them.  He would meet everyone over some beer.</span></p><br/><p><span style=\"\">If he didn’t, he realized he might regret not meeting them.</span></p><br/><p><span style=\"\">At Hyrkan’s movement, the arrowheads of the Red Elves moved too.</span></p><br/><p><span style=\"\">It was a warning signal telling him not to move.</span></p><br/><p><span style=\"\">Hyrkan stopped moving.</span></p><br/><p><span style=\"\">Then Hing also came to a stop.</span></p><br/><p><span style=\"\">Hwee hwee!</span></p><br/><p><span style=\"\">Hing whistled a sound that resembled a chirping bird.</span></p><br/><p><span style=\"\">Accompanying the whistle, the arrowheads pointing at Hyrkan was lowered towards the ground.</span></p><br/><p><span style=\"\">[You’ve gained the Title ‘Guest of the Red Elf Tribe’.] </span></p><br/><p><span style=\"\">[You’ve completed the Quest ‘Artifact of the Elves’.] </span></p><br/><p><span style=\"\">After he heard the Announcement for acquiring a title, Hyrkan unfurled his arms.</span></p><br/><p><span style=\"\">“Where did you get this, human?” </span></p><br/><p><span style=\"\">Hing approached Hyrkan, and it asked him the question.  Its black eyes glared at Hyrkan, and Hyrkan spoke as he always did.  He answered in a friendly manner.</span></p><br/><p><span style=\"\">“I acquired it from the Den of the Rebels located inside the Red Desert.” </span></p><br/><p><span style=\"\">A User should always be friendly in front of an NPC! </span></p><br/><p><span style=\"\">Even as many things changed, this was the golden rule that must be kept by Users of Warlord.</span></p><br/><p><span style=\"\">“How did you get in there?” </span></p><br/><p><span style=\"\">“An enormous snake created a path, and I followed it.” </span></p><br/><p><span style=\"\">“The Mirage Snake is still alive…..” </span></p><br/><p><span style=\"\">As Hing spoke, it looked over Hyrkan once again.  Hyrkan didn’t avoid its gaze.</span></p><br/><p><span style=\"\">Hyrkan also made observations about Hing.</span></p><br/><p><span style=\"\">‘From what I know, the Red Elves didn’t come out even when Warlord was pretty far down the road…..’ </span></p><br/><p><span style=\"\">He had never heard about the Red Elves before.</span></p><br/><p><span style=\"\">This was the same for the large snake named Mirage Snake.  He hadn’t known about the existence of such a large monster.  Moreover, he couldn’t have have even imagined such a storyline.</span></p><br/><p><span style=\"\">However, he could guess at what was going on by looking at these events.</span></p><br/><p><span style=\"\">‘Hmmm.’ </span></p><br/><p><span style=\"\">A piece of a puzzle became clear inside Hyrkan’s head.  The puzzle was close to being completed, so Hyrkan had a pleased expression on his face.</span></p><br/><p><span style=\"\">“I’ll take you to our chief now.  Please don’t think about doing anything foolish.” </span></p><br/><p><span style=\"\">Hyrkan’s expression turned neutral when he received Hing’s threatening words.</span></p><br/><p><span style=\"\">It happened at that moment.</span></p><br/><p><span style=\"\">“As expected, it’s you.” </span></p><br/><p><span style=\"\">A short dwarf slowly appeared from between the group of Elves. </span></p><br/><p><span style=\"\">When it made its appearance, the Elves parted to let it through.</span></p><br/><p><span style=\"\">“We meet again.” </span></p><br/><p><span style=\"\">Blacksmith Olf.</span></p><br/><p><span style=\"\">[You’ve completed the ‘Artifact of the Ancient King’ Quest.] </span></p><br/><p><span style=\"\">Hyrkan nodded his head when he saw the NPC he desperately wanted to encounter.  He gave a short answer.</span></p><br/><p><span style=\"\">“Yes.” </span></p><br/><p><span style=\"\">“Your path would have been difficult, and you did well in getting here.” </span></p><br/><p><span style=\"\">“I’m trying to save the world.  I can’t avoid a task, because it is difficult.” </span></p><br/><p><span style=\"\">Instead of answering Hyrkan, Olf looked towards Hing.  Olf sent some kind of signal with his eyes.  Hing once again let out a whistle.</span></p><br/><p><span style=\"\">Before the whistle could come to an end, the Elves started to retreat.  </span></p><br/><p><span style=\"\">Olf waved his hand towards Hyrkan.</span></p><br/><p><span style=\"\">“Before you meet the chief, I have to talk to you.”</span></p><br/><p><span style=\"\">“What would you like to say to me?” </span></p><br/><p><span style=\"\">“I’ll tell you about the beings we have been fighting up until now.  Moreover, I’ll tell you about the beings we’ll have to fight in the future.” </span></p><br/><p><span style=\"\">When he heard those words, the puzzle inside his head was completed.</span></p><br/><p>7.</p><br/><p><span style=\"\">“This occurred in the distant past….  There was a time when every living creature walked on the ground.  It was a brilliant era.  However, when this brilliance turned into arrogance, he appeared.” </span></p><br/><p><span style=\"\">“Who was it?” </span></p><br/><p><span style=\"\">“A Dragon.  You can think of him as them or him.  You can even think of him as multiple beings.” </span></p><br/><p><span style=\"\">“What did the Dragon do?” </span></p><br/><p><span style=\"\">“Judgement.  He showed, who was the owner of this land.  He gave judgement to the arrogant beings, who considered these lands to be theirs.” </span></p><br/><p><span style=\"\">“When you refer to it as a judgement….” </span></p><br/><p><span style=\"\">“In the beginning, he used the Power of Corruption.  It didn’t matter if one traversed this land by ground or air, he corrupted them all.  Then he started a war with the beings, who insisted on being the owners of this land.” </span></p><br/><p><span style=\"\">“Ah.  That’s the power used by the Immoral Prince….” </span></p><br/><p><span style=\"\">“Bayan Dean Un…..  No, I guess I should call him the Immoral Prince.  That’s right.   His power was the same as the power from before.  The Immoral Prince found the Power of Corruption, and he started researching ways to use this power.  That was….  It was the same for the owners of the Ruined Kingdoms.  They fought against the Power of Corruption.  They used the power within the Power of Corruption.  They used a power called the Ancient Power.  They knew it was inevitable.  They knew the judgement of the Dragon would arrive some day.  They knew it, because it happened before in the distant past.” </span></p><br/><p><span style=\"\">“So what happened next? ” </span></p><br/><p><span style=\"\">“The Dragon raged.  This was why he used his five Powers to curse the world.  The north was cursed with Frost.  The Urugal mountain range, which bisected the world, was cursed with Fire.  The south…...” </span></p><br/><p><span style=\"\">“It all fell.  I saw what happened.  I saw the result.” </span></p><br/><p><span style=\"\">“Yes, the prosperous regions fell to the Curses.  The Kingdoms of that time became ruins.  However, not every Kingdom fell.  While the Dragon was using its power to spread the Curses, an Ancient King, who was referred to as the War King, took up a shield and spear capable of defeating the Dragon.  He confronted the Dragon.  This king had used the world as bait, so the Dragon would turn his five Powers into Curses.  He waited for the only opportunity he would be able to defeat the Dragon.” </span></p><br/><p><span style=\"\">“Did he kill the Dragon?” </span></p><br/><p><span style=\"\">“As the battle came to a close, the Dragon ran away.  It had received a large wound, but it would be able to show itself once again in the future.  However, all the Kingdom had already fallen by the five Powers of the Dragon.  The world was already in ruins.  The Dragon’s Army and the Corrupt Army was still destroying the world.  The Barbarian King was carrying out the Dragon’s Judgement as proxy.  He is now in a stasis.  He could carry out his duty when needed.  In front of such opposition, no new kingdoms could be built.  This was why the rebels went underground as they prepared for the counterattack.  Then they started leaving hints all over the world about this fact. They planted flags that’ll be held up by the rebels in the future.” </span></p><br/><p><span style=\"\">“So it is possible to counterattack now?” </span></p><br/><p><span style=\"\">“The method had already been revealed before.  You need Powers that’ll counteract the Dragon’s five Powers.  You also need the War King’s shield and spear.” </span></p><br/><p><span style=\"\">“The five Powers?” </span></p><br/><p><span style=\"\">“The four Powers has already been acquired.  The only one left is the Power of Judgement. You have to acquire the Power of Storm from the Barbarian King.  The Barbarian King is sleeping right now.  He could wake up at any time.  A small stimulus could awaken him from his sleep.  This is why the Arch Mage’s barrier was placed over the sleeping place of the Barbarian King.  This was to make sure the Barbarian King couldn’t be awoken easily.” </span></p><br/><p><span style=\"\">“So we just have to kill the Barbarian King.” </span></p><br/><p><span style=\"\">“...it isn’t as easy as it sounds.  The Barbarian King carries out the Dragon’s Judgement.  He controls the Power of Storm.  He also keeps numerous number of monsters to act as his hands and feet.  If you rashly awaken this being, you might mistakenly turned the world into ruins again.” </span></p><br/><p><span style=\"\">“However, we can’t always avoid this.  We can’t wait for the Dragon to heal from its injury.  We have to kill it before that happens.  Isn’t that the right answer?” </span></p><br/><p><span style=\"\">“······can you actually defeat the Barbarian King?” </span></p><br/><p><span style=\"\">Hatch, who had been listening to the story, spoke in a confident manner.</span></p><br/><p><span style=\"\">“We are the Storm Hunters.  I don’t know about anything else, but we can control the Power of Storm.” </span></p><br/><p><span style=\"\">“Mmmm.” </span></p><br/><p><span style=\"\">Ahimbree thought over Hatch’s answer.  After a brief moment, it brought out a Golden Conch.</span></p><br/><p><span style=\"\">“This is the key that will show you where the artifact of the War King is hidden.  This will be enough to waken the Barbarian King from its sleep.  You don't even have to dispel the barrier.  You just have to move close to it, and the Barbarian King will break through the barrier.  My teacher Bokan had created this barrier.  It was meant to keep people out.  It wasn’t meant to cage the Barbarian King.  I’m afraid my teacher would be furious if he heard my words right now.” </span></p><br/><p><span style=\"\">“Please do not worry.  I guarantee we’ll defeat the Barbarian King.” </span></p><br/><p><span style=\"\">“It might not be possible with only your forces.  You should request help from the Hiban Kingdom.  Their elite knights are called the Order of the Steel Lion.  They’ll open up the path for you.  When they arrive here, you can go with them.” </span></p><br/><p><span style=\"\">“Understood, teacher.” </span></p><br/><p><span style=\"\">After his conversation, Hatch grasped the Golden Conch. He had an odd expression on his face.</span></p><br/><p><span style=\"\">‘The M.I made an awesome game.  Since it has made such an awesome game, it is the duty of the gamers to leave behind an awesome record for this amazing game.’</span></p><br/>\n</div>"}