{"title": "Chapter 191 Epilogue", "id": 191, "volume": 2, "url": "http://boxnovel.org/emperor-of-solo-play-chapter-191-epilogue", "volume_title": "Volume 2", "body": "<h1>Chapter 191 Epilogue</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 191 – Epilogue</p><br/><p>1.</p><br/><p><span style=\"\">[Hahoe Mask has reached 1st place in the Warlord’s Level Ranking!] </span></p><br/><p><span style=\"\">[Tobot Soft’s Official Announcement: ‘The Ruined King episode will be the last Main Scenario Quest.’] </span></p><br/><p><span style=\"\">[Tobot Soft’s stock is on the decline.  Is this a sign that Warlord’s bubble is about to pop?] </span></p><br/><p><span style=\"\">[Big Smiles guild has been disbanded.  They gave up on the rights to a live channel.  It is proof that the operating income for the live channels of the 30 great guilds have dried up.] </span></p><br/><p><span style=\"\">[Hahoe Mask’s Shocking Announcement: ‘I will retire after the war with the Dragon.’] </span></p><br/><p><span style=\"\">[Warlord has become a setting sun.] </span></p><br/><p><span style=\"\">[After Warlord, which VR game will succeed in becoming the special one?] </span></p><br/><p><span style=\"\">[Hydra guild has set up a Player Care System for games.  They have found the ‘Hydra company.’] </span></p><br/><p><span style=\"\">[In an interview with the founder of the Hydra Company, Eric Gomes states, ‘Our ability to support and progress in the game has been tested through Warlord.  Now regular Users can receive the same care and support from us.’] </span></p><br/><p><span style=\"\">[Che-sulyun’s interview:  ‘I’m establishing the Stormhunters team, who will play VR games professionally.  It won’t just be Warlord.  Everyone will be able to see the brilliant exploit of the Stormhunters guild in other VR games.’] </span></p><br/><p><span style=\"\">[This is the era of VR eSports.  Hahoe Mask is the eye of the storm.  Will anyone be able to acquire him and dominate this era?] </span></p><br/><p><span style=\"\">[It is the start of the final war between the Hahoe Mask and the Dragon.  It will be broadcasted live using the Stormhunters guild’s live channel!  The advance sale of the live ticket has reached 20 million!]</span></p><br/><p>2.</p><br/><p><span style=\"\">One couldn’t measure the length of the Dragon with one’s eyes.  The Dragon was unfathomably large, and it was flying through the darkened sky. </span></p><br/><p><span style=\"\">“Uh-whew....”  </span></p><br/><p><span style=\"\">A User wearing a Hahoe Mask was looking at the Dragon from the ground.  He let out a deep sigh.</span></p><br/><p><span style=\"\">‘This game is really fucked up.’ </span></p><br/><p><span style=\"\">After letting out a sigh, Hyrkan raised his head again to look at the Dragon.  It was one kilometer long.  It was capable enough to bring calamity to the world.  It was the final boss with an awesome presence.</span></p><br/><p><span style=\"\">Its official name was Dragon.</span></p><br/><p><span style=\"\">However, the Users added the ‘of Calamity’ to the short name.  The title stuck.</span></p><br/><p><span style=\"\">‘I’ll have to climb from the tail to reach its body.  Then I have to stab the War King’s Spear into the wound on its neck.’ </span></p><br/><p><span style=\"\">In short order, Hyrkan would have to start his monster hunt against the ridiculous Dragon of Calamity.</span></p><br/><p><span style=\"\">The hunting method was simple.</span></p><br/><p><span style=\"\">When the one kilometer long Dragon approaches the ground, the Dragon’s tail will touch the ground.  As the tail scrapes across the ground, one would have to stick to the tail.  This was the starting point.  As the Dragon ascends into the sky, he would have to travel from the tail to the neck.  He had to crawl up a distance of 1 kilometer, then he would have to find the wound on the neck.  Then he just had to plant the crude looking spear into the wound.</span></p><br/><p><span style=\"\">He had to be cautious of only one thing.</span></p><br/><p><span style=\"\">Falling! </span></p><br/><p><span style=\"\">The Dragon’s body moved so roughly that a rodeo couldn’t hold a candle to this.  The only thing one had to worry about was falling off the Dragon.</span></p><br/><p><span style=\"\">“I really want to see what the bastard, who made this shitty game, looks like.” </span></p><br/><p><span style=\"\">This was obvious, but everything about this was insane.  Moreover, Hyrkan had to solo this craziness.</span></p><br/><p><span style=\"\">Hyrkan already felt queasy.  </span></p><br/><p><span style=\"\">He didn’t have a fear of heights, but he would probably develop one that day.</span></p><br/><p><span style=\"\">- Get ready, Hahoe Mask.</span></p><br/><p><span style=\"\">At that moment, a clear and very beautiful voice rang out inside the Hahoe Mask’s ears.</span></p><br/><p><span style=\"\">- The tail will reach the ground soon.</span></p><br/><p><span style=\"\">Shir had a voice that was very easy on the ears.  However, instead of smiling, Hyrkan frowned a little bit.</span></p><br/><p><span style=\"\">“I know.” </span></p><br/><p><span style=\"\">He answered in a brusque voice.</span></p><br/><p><span style=\"\">- Bear this in mind.  When you climb the Dragon’s tail….. </span></p><br/><p><span style=\"\">“I’m more knowledgeable than about the process, so you don’t have to explain it to me.”</span></p><br/><p><span style=\"\">- Also, when this game ends….. </span></p><br/><p><span style=\"\">“Let’s talk about it when we get to that point.  Stop treating me like your underling.  I'm unaffiliated right now.  Stop telling me what to do.” </span></p><br/><p><span style=\"\">- I’m sorry.</span></p><br/><p><span style=\"\">At that moment, Shir apologized when she heard his brusque response.  Hyrkan suddenly became speechless.</span></p><br/><p><span style=\"\">‘...this is driving me nuts.’ </span></p><br/><p><span style=\"\">Shir responded in such a docile manner that Hyrkan had a hard time accepting the situation.</span></p><br/><p><span style=\"\">“You are going to do it even if I try to stop you.  Don’t worry about it.  There’s nothing I can‘t do now.” </span></p><br/><p><span style=\"\">In the end, Hyrkan caressed the situation instead of baring his teeth.</span></p><br/><p><span style=\"\">- Fighting. </span></p><br/><p><span style=\"\">Shir gave a cheer for Hyrkan.  He let out a deep sigh at her words.</span></p><br/><p><span style=\"\">This was how the call came to an end. </span></p><br/><p><span style=\"\">The Dragon, which had been circling the sky, was incrementally getting closer to the ground.</span></p><br/><p><span style=\"\">At the same time, the Dragon’s tail descended towards the ground.   The lowered tail would reach Hyrkan in couple of minutes.</span></p><br/><p><span style=\"\">Hyrkan clenched his two fists as he looked at the Dragon.</span></p><br/><p><span style=\"\">‘This is it.’ </span></p><br/><p><span style=\"\">This was the final battle.  It didn’t matter if he won or lost.  He would leave Warlord after this.  He already gave his announcement to the public.  If he won, he’ll retire.  Even if he lost, he’ll give up on Warlord, and he would retire.</span></p><br/><p><span style=\"\">‘I’ll probably be too embarrassed to come back.’ </span></p><br/><p><span style=\"\">He couldn’t go back on his words.  Hyrkan had already given his announcement.  He would feel too much shame if he went back on his words.</span></p><br/><p><span style=\"\">Of course, he had no regrets.</span></p><br/><p><span style=\"\">‘Yes.  I have put an end to this long relationship.  It isn’t as if I can always devote my life to Warlord.’ </span></p><br/><p><span style=\"\">Hyrkan actually felt relieved.</span></p><br/><p><span style=\"\">From the time before he came back to the past and afterwards, his life had been intertwined with Warlord.  Thanks to Warlord, he had lived through difficult times.  On the other hand, Warlord now allowed him to prosper in life.</span></p><br/><p><span style=\"\">He had shared the good times and the bad times with Warlord.  He had experienced all sorts of emotions.  Now it was time to let it go.  There was no game in this world that could be played forever.  Everything in this world had a start and an end.  An end was needed to start a new beginning.</span></p><br/><p><span style=\"\">Hyrkan stood up from his seat.  </span></p><br/><p><span style=\"\">The Skeletons’ gaze moved in sync with Hyrkan’s movement.</span></p><br/><p><span style=\"\">Until a moment ago, his Skeleton Warriors, Knights and Death Knight had fought against the warriors controlled by the Dragon.  The signs of battle was all over their bodies.</span></p><br/><p><span style=\"\">‘Ah.’ </span></p><br/><p><span style=\"\">Hyrkan hesitated for a brief moment as he looked at the wounds they received from the fight.</span></p><br/><p><span style=\"\">“Ah.” </span></p><br/><p><span style=\"\">He stopped for a brief moment to look at them.  </span></p><br/><p><span style=\"\">Hyrkan unconsciously raised his hand towards the nearest Skeleton Warrior.</span></p><br/><p><span style=\"\">Ssoo-oohk! </span></p><br/><p><span style=\"\">The Skeleton Warrior quickly dodged the hand.</span></p><br/><p><span style=\"\">Hyrkan let out a bitter laugh when he saw the Skeleton Warrior’s action.  Hyrkan once again extended his hand in a swift manner.  The Skeleton Warrior tried hard to dodge the hand, but at a certain point, Hyrkan had grabbed the head of the Skeleton Warrior.</span></p><br/><p><span style=\"\">After grabbing the head of the Skeleton Warrior, Hyrkan brought his head towards it.</span></p><br/><p><span style=\"\">“Thank you for everything.” </span></p><br/><p><span style=\"\">Toohk······ Toohk······. </span></p><br/><p><span style=\"\">“In many ways, you guys met a strange owner.  Still, I was able to reach this point, because of you all.” </span></p><br/><p><span style=\"\">Hyrkan lightly and gently knocked heads with the Skeleton Warrior’s skull.</span></p><br/><p><span style=\"\">“This is goodbye.” </span></p><br/><p><span style=\"\">After he spoke his words, Hyrkan took off his Hahoe Mask.  He had revealed his face to the world.</span></p><br/><p><span style=\"\">Soon, the world will know his face through the Stormhunter’s live channel.</span></p><br/><p><span style=\"\">‘Goodbye Skeletons and the Hahoe Mask.’ </span></p><br/><p><span style=\"\">The world would remember the Hahoe Mask Hyrkan.  However, now they would remember Ahn-jaehyun, who was the Hahoe Mask Hyrkan.</span></p><br/><p><span style=\"\">“Let’s end this.” </span></p><br/><p><span style=\"\">Hyrkan put an end to the very long relationship he had with the Hahoe Mask.</span></p><br/><p>3.</p><br/><p><span style=\"\">“I want 10 dollar worth of lottery ticket with random draw.” </span></p><br/><p><span style=\"\">The part time worker had been watching a video on his tablet.  He paused the video before he calculated the customer’s order.</span></p><br/><p><span style=\"\">As the customer ordered, he printed out a lottery ticket as he let the machine pick random numbers.  Then he scanned the barcode of the customer’s other item.</span></p><br/><p><span style=\"\">“Since this is a beef gimbap….  The total is 15 dollars.” </span></p><br/><p><span style=\"\">“Here.” </span></p><br/><p><span style=\"\">“Yes.  Thank y······.” </span></p><br/><p><span style=\"\">He saw a 50 dollar bill in front of his eyes, so the part time worker naturally raised his eyes to look at the customer.  The customer was rail thin, and he was wearing thick glasses. Overall, he looked like a pushover.  The customer looked like someone that will fall for any deceit.</span></p><br/><p><span style=\"\">‘Huh?’ </span></p><br/><p><span style=\"\">At that moment, the convenience store’s part timer felt as if he had seen this person before.</span></p><br/><p><span style=\"\">This was why he asked a question.</span></p><br/><p><span style=\"\">“Have I met you before from somewhere?” </span></p><br/><p><span style=\"\">Instead of answering, the customer’s brows furrowed a little bit.</span></p><br/><p><span style=\"\">The part timer thought he had overstepped his bounds, so he quickly gave the customer his change and the lottery ticket.</span></p><br/><p><span style=\"\">The customer exited the convenience store, and the part timer started up the video on his tablet again.</span></p><br/><p><span style=\"\">- Uh?  Hahoe Mask!  The Hahoe Mask took off his Hahoe Mask!</span></p><br/><p><span style=\"\">“Ah!” </span></p><br/><p><span style=\"\">At that moment, the part time worker stood up from his seat in shock.  Then he looked out the window.  He saw the customer get into a very sleek and new lamborghini.   The part time worker yelled as he looked at the customer.</span></p><br/><p><span style=\"\">“My god.  He’s the Hahoe Mask Hyrkan, Ahn-jaehyun!  This is crazy!  I have to get his signature.  A signature....” </span></p><br/><p><span style=\"\">The part timer tried to rush out, but the customer’s car was already pulling out towards the road.</span></p><br/><p><span style=\"\">“Ah-oh!” </span></p><br/><p><span style=\"\">In the end, the part time worker had to give up on getting the signature.</span></p><br/><p><span style=\"\">“This is nuts.  How could I not recognize the Hahoe Mask?” </span></p><br/><p><span style=\"\">He was an avid fan of the Hahoe Mask.  He kicked himself for not recognizing the Hahoe Mask.</span></p><br/><p><span style=\"\">After his despair came to an end, he had a question.</span></p><br/><p><span style=\"\">‘Why did the Hahoe Mask buy a lottery ticket?  He retired from Warlord, but didn’t he make a lot of money?  I thought he sold several million copies of his Frozen Kingdom episode.’</span></p><br/><p>4.</p><br/><p><span style=\"\">He had his hands on the sleek handle of the lamborghini.  He wore a Patek Philippe watch on his wrist, and he was oozing with presence.</span></p><br/><p><span style=\"\">What he wore and drove was much more expensive than a house.  </span></p><br/><p><span style=\"\">Ahn-jaehyun opened the beef kimbap he purchased earlier, and he started chewing on a piece.</span></p><br/><p><span style=\"\">As he ate, he thought about the lottery numbers he had purchased.</span></p><br/><p><span style=\"\">‘I should have memorized the winning lottery number.’ </span></p><br/><p><span style=\"\">“Fuck the IRS!” </span></p><br/><p><span style=\"\">At that moment, Ahn-jaehyun unconsciously let out a wail of despair.</span></p><br/><p><span style=\"\">Ahn-jaehyun replayed the conversation he had with the agents of the IRS.</span></p><br/><p><span style=\"\">“Mr. Ahn-jaehyun.  You have evaded paying a significant amount of tax.” </span></p><br/><p><span style=\"\">“It wasn’t tax evasion…..” </span></p><br/><p><span style=\"\">When he retired from Warlord, Ahn-jaehyun did everything he couldn’t do before, because he had been playing Warlord.  First, he bought and moved into the best penthouse apartment he could find.  Then he bought a lamborghini in one lump sum.  Afterwards, he slowly bought luxury items to fill up his newly purchased apartment.</span></p><br/><p><span style=\"\">Those were his happy days.  He was so happy that he sometimes forgot to eat!</span></p><br/><p><span style=\"\">However, a dark cloud appeared above Ahn-jaehyun’s happiness.</span></p><br/><p><span style=\"\">Ahn-jaehyun had made an enormous amount of money through Warlord.  Moreover, he participated in some shady practices to pay less tax, and he had been caught by the IRS.  Of course, Ahn-jaehyun hadn’t known he had participated in a shady practice.  The accountant he hired said everyone did it, and he would be an idiot if he didn’t take advantage of it.</span></p><br/><p><span style=\"\">“We don’t care about your situation, Mr. Ahn-jaehyun.  Our role is to take back the exact amount you owe us in taxes.” </span></p><br/><p><span style=\"\">Anyways, this problem exploded in his face.  He had never dealt with IRS agents before, so he was at a loss as to what to do.</span></p><br/><p><span style=\"\">“You have two choices.  We can do this by force.  Or you can cooperate with us, and we can come to an agreement.” </span></p><br/><p><span style=\"\">“I...I’ll cooperate.” </span></p><br/><p><span style=\"\">He decided to pay his taxes.</span></p><br/><p><span style=\"\">However, there was a problem.  Ahn-jaehyun didn’t have enough liquid assets to pay off the taxes in its entirety.  The tax bill wasn’t small.  </span></p><br/><p><span style=\"\">In the end, the IRS took his cut of the profit in selling footages of Warlord.  Moreover, they took his sponsorship money.</span></p><br/><p><span style=\"\">This was the reason behind his purchase of the lottery ticket.</span></p><br/><p><span style=\"\">“Shit.” </span></p><br/><p><span style=\"\">He purchased a lottery ticket every time Ahn-jaehyun ate beef kimbap and ramen.  He prayed for a winning lottery ticket.</span></p><br/><p><span style=\"\">‘Should I go to Che-sulyun, and ask her to buy me some meat?  Shit.  I acted so bold in front of Che-sulyun, so how would I look if I asked her to buy me some meat?  Ah, this is driving me nuts.  I should have just kept my money.  Why did I have to buy…..’ </span></p><br/><p><span style=\"\">He wallowed in his pain and suffering as he chew on the beef kimbap.</span></p><br/><p><span style=\"\">At that moment, a call arrived.</span></p><br/><p><span style=\"\">“Receive incoming call!” </span></p><br/><p><span style=\"\">When Ahn-jaehyun yelled out, a hologram picture of a phone appeared in front of his eyes.  The caller’s name also appeared.</span></p><br/><p><span style=\"\">The caller was Che-sulyun.</span></p><br/><p><span style=\"\">- Ahn-jaehyun.  Tobot Soft officially announced their next project.</span></p><br/><p><span style=\"\">- There will be two version to the next project.  One will be the light version where normal Users will be able to enjoy themselves.  The other version is the Pro version.  It is said that no one can beat it.</span></p><br/><p><span style=\"\">As soon as her words ended, he heard the voice of Tobi Gwynn.  His voice filled the interior of Ahn-jaehyun’s car.</span></p><br/><p><span style=\"\">- Was the Pro Version an attempt to dominate the rapidly growing VR eSports market?</span></p><br/><p><span style=\"\">- It was the same during the days of Warlord.  Tobot Soft always strives to make that one special game.  We make unique products.  Our next project is a challenge we are putting out to the VR pro-gamers.  I'll guarantee it.  This game will be more difficult than any other game in the market.</span></p><br/><p><span style=\"\">- How difficult is it? </span></p><br/><p><span style=\"\">- Do you remember the Hahoe Mask’s Skeletons?  </span></p><br/><p><span style=\"\">- Of course, They are still legendary. </span></p><br/><p><span style=\"\">- We took the battle AI possessed by the Hahoe Mask’s Skeletons, and we strengthened it using the Deep Learning system.  All the battle AI of monsters will be based on it.  I’ll guarantee it.  This game will be burdensome even for the Hahoe Mask.</span></p><br/><p><span style=\"\">Tobi Gwynn’s voice came to an end there.</span></p><br/><p><span style=\"\">- Ahn-jaehyun. </span></p><br/><p><span style=\"\">Che-sulyun’s voice could be heard again.</span></p><br/><p><span style=\"\">“What?” </span></p><br/><p><span style=\"\">- The Stormhunter’s next target is the sequel to Warlord.  We’ve picked out our members.  Of course, this will be the stage where you’ll debut as a member of the Stormhunters.</span></p><br/><p><span style=\"\">At her words, Ahn-jaehyun had a smile on his face.</span></p><br/><p><span style=\"\">“Is that all you have to say to me?” </span></p><br/><p><span style=\"\">- That’s all I have to say for now.  However, I am curious about something.</span></p><br/><p><span style=\"\">“Speak.” </span></p><br/><p><span style=\"\">- You’ll be meeting the Skeletons you grew and trained as an enemy.  How do you feel about it?  You’ve never fought against your Skeletons before.</span></p><br/><p><span style=\"\">At her question, the smile on his face was wiped away.</span></p><br/><p><span style=\"\">‘Wait a moment.’ </span></p><br/><p><span style=\"\">After receiving the question, Ahn-jaehyun seriously mulled over it.  As he thought more on it, Ahn-jaehyun’s expression crumpled.</span></p><br/><p><span style=\"\">“It’ll be a damn annoying game.  A really damn annoying game….  Shit.  Can’t I just play a different game?</span></p><br/><p><span style=\"\">- You are the one, who signed the contract.  Of course, you can pay the penalty to get out of the contract.  Do you have that kind of money?</span></p><br/><p><span style=\"\">At her words, Ahn-jaehyun let out a sigh as he spoke.</span></p><br/><p><span style=\"\">“Anyways, does our guild do any company dinners?  Shouldn’t we do a regular get-together in a barbeque restaurant?” </span></p><br/><p><span style=\"\">However, there was no answer to his questions.  She had already ended the call.</span></p><br/><p><span style=\"\">Ahn-jaehyun, who had his hands on the handle, glanced at his Patek Philippe watch.</span></p><br/>\n</div>"}