{"title": "Chapter 190 Emperor of Solo Play", "id": 190, "volume": 2, "url": "http://boxnovel.org/emperor-of-solo-play-chapter-190-emperor-of-solo-play", "volume_title": "Volume 2", "body": "<h1>Chapter 190 Emperor of Solo Play</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 190 – Emperor of Solo Play</p><br/><p><span style=\"\">1.</span></p><br/><p><span style=\"\">In historic events, there are times when an inexplicable gap in the story occurs.   There was a sense that something had gone on, but no one knows the details.   It is never recorded, and the people, who participated in these events, carry the information to their graves.  </span></p><br/><p><span style=\"\">The conversation that was about to start right now happened within this gap.</span></p><br/><p><span style=\"\">\"I’m sorry, but your conversation partner will suddenly shift from a beauty to a man. As you probably know, our Queen really likes you.  This is why she always took on deals that were harmful to us when dealing with you. This is why I feel obliged to step forward.\"</span></p><br/><p><span style=\"\">Hatch spoke as he looked at the User in front of him.</span></p><br/><p><span style=\"\">Hyrkan was wearing a Hahoe Mask, and he wore a yellow robe, which was reminiscent of a flash of thunder.</span></p><br/><p><span style=\"\">Hatch felt as if he was staring at a monster.</span></p><br/><p><span style=\"\">'I never expected him to get this far.'</span></p><br/><p><span style=\"\">No, he really was a monster.  He used his own power to put the Barbarian King to sleep.  He made the impossible into reality.  He succeeded in a task that one would have a hard time believing it happened even if one saw it.</span></p><br/><p><span style=\"\">'Either we can ally with him or we can crush him.  If not, the Hahoe Mask…  There are no other choice left for him.'</span></p><br/><p><span style=\"\">Hatch calmed his emotions in front of the monster.  He forced himself to smile as he spoke.</span></p><br/><p><span style=\"\">\"Since we serve the same teacher, let’s de-escalate this situation.  Aren’t you also a student of Ahimbree?  If we consider the order in which we became students, I am your senior.  Of course, I’m not asking you to treat me like a senior...\"</span></p><br/><p><span style=\"\">He was trying his best to de-escalate the tense atmosphere, yet it had no effect.</span></p><br/><p><span style=\"\">Hyrkan didn’t respond.</span></p><br/><p><span style=\"\">In truth, this wasn’t the place for idle chatter.  This meeting was put together to give an explanation.</span></p><br/><p><span style=\"\">\"……I’m sorry.  I’ll immediately give you an explanation.  I’ll tell you about the meaning behind the Queen’s proposal.\"</span></p><br/><p><span style=\"\">Hoo-ooh.</span></p><br/><p><span style=\"\">Hatch took in deep breaths as he organized his words inside his head.</span></p><br/><p><span style=\"\">\"Normally, the people making the game wants the people playing the game to like playing their game.  This might be a lengthy explanation…  Please be patient.  We still have a lot of time left.\"</span></p><br/><p><span style=\"\">The atmosphere settled after Hatch spoke his words.  It was akin to an exhale.</span></p><br/><p><span style=\"\">\"Anyways, the people, who make games for a living, have a hard time enjoying their own game.  You know how it is, right?  If you make something yourself, you only see the flaws.  You also know which part is fun, and you know how to clear everything…   Moreover, if you run into difficulty, you have cheats built-in for convenience.  This naturally led to the game developers to think about wanting to play a game full of mystery.  Even if the content obvious, they wanted to play a game where they didn’t know the content.\"</span></p><br/><p><span style=\"\">For a brief moment, he was lost in his old memories.  However, he quickly stopped his reminiscence.</span></p><br/><p><span style=\"\">\"This was how Warlord was born.  Of course, it was made using an AI in an attempt to decrease the personnel expenditure.  This was why investment after investment was sunk into it….  The creators of Warlord made it with such thoughts in mind.  This was also why Warlord was able to differentiate itself from other similar games.  It became the special one.\"</span></p><br/><p><span style=\"\">Hyrkan still didn’t respond.</span></p><br/><p><span style=\"\">\"Let me expand on my explanation.  In the distant past, the world’s best Go players played Go against an AI.   At the time, people, who didn’t even know how to play Go, were excited over the match.  This is an analogous situation.   The AI is an unknown variable.  It is also a match between AI and humanity.  A victorious outcome would prove the worthiness of humanity.  Warlord was made using the same premise.  From one to ten, the AI would create and be in charge of everything!  This would stoke the interest of the people, who usually didn’t play games. They unhesitatingly invested money into creating this criteria, which would drive the interest of the masses.  In other words, if this criteria was lost, Warlord loses its worth.  Moreover, we aren’t at a point in our AI technology  where an AI can manage Warlord indefinitely.\"</span></p><br/><p><span style=\"\">At this point, Hatch no longer cared how Hyrkan reacted. </span></p><br/><p><span style=\"\">\"The world made by Warlord is about to come to an end.  This is the last Main Scenario Quest.  The only thing left after killing the Barbarian King is to acquire the artifact of the War King to fight the Dragon.  After the battle with the Dragon, this game will become a normal game.\"</span></p><br/><p><span style=\"\">\"So what?\"</span></p><br/><p><span style=\"\">For the first time, Hyrkan reacted.  Hatch couldn’t help, but laugh at his reaction.</span></p><br/><p><span style=\"\">\"Once Warlord becomes a normal game, you won’t be able to accrue the same amount of fame and wealth.  You won’t be able to earn several hundred thousand dollars just from posting a single hunting video.  No company in this world would pay you exorbitant amount of money to sponsor you.  Of course, you'll be able to make money.  However, it wouldn’t be at the current level.  In other words, if you monkey around with the current situation, you’ll be able to earn more fame and money over a longer period of time.  If you can play this game for one more year, you’ll even be able to own a building worth several millions of dollars.  This is why I’m going to ask you these questions.  Will you be able to kill this game knowing this?  Are you willing to give up everything in the process?\"</span></p><br/><p><span style=\"\">At his words, Hyrkan thought over the words that had been spoken.</span></p><br/><p><span style=\"\">Shir spoke.</span></p><br/><p><span style=\"\">\"This is my last proposal.\"</span></p><br/><p><span style=\"\">It was her last proposal.</span></p><br/><p><span style=\"\">\"You can either finish this game with me, or you can go to war with me.\"</span></p><br/><p><span style=\"\">He could share the glory of ending Warlord with her or he could extend the life-cycle of Warlord by fighting against her.</span></p><br/><p><span style=\"\">He had to choose one of those options.</span></p><br/><p><span style=\"\">After she put forth her short proposal, Hatch stepped forward to block off Shir.  Shir’s proposal was abrupt, and Hatch had to interpret and explain her words.</span></p><br/><p><span style=\"\">Thanks to his efforts, Hyrkan was able to understand everything.</span></p><br/><p><span style=\"\">He now knew what was going on around him.</span></p><br/><p><span style=\"\">He now understood what was going on in this world called Warlord.</span></p><br/><p><span style=\"\">Moreover, he had an idea on what he should do from now on.</span></p><br/><p><span style=\"\">\"Were you perhaps a programmer?\"</span></p><br/><p><span style=\"\">At Hyrkan’s question, Hatch nodded his head.</span></p><br/><p><span style=\"\">\"Yes, it was my past occupation.\"</span></p><br/><p><span style=\"\">\"Did you participate in creating Warlord?\"</span></p><br/><p><span style=\"\">\"I wasn’t directly involved.  If Warlord was a person, I pretty much made the pinky toe.\" </span></p><br/><p><span style=\"\">\"Before I give you guys an answer, I’ll say couple things.\" </span></p><br/><p><span style=\"\">Hatch nodded his head in agreement.</span></p><br/><p><span style=\"\">\"First, I’ll complete this game.  I’ll do it even if you guys interfere with me.  Even if all of the 30 great guilds interfere with me, I’m going to end this game.\"</span></p><br/><p><span style=\"\">As if Hatch understood Hyrkan’s position, he nodded his head.</span></p><br/><p><span style=\"\">\"Moreover, I’m not afraid of starting a war with the Stormhunters.  I’m not saying this as a bluff.  I’m telling the truth.  I don’t care if I win or lose.  If the Stormhunters guild starts a war with me, I won’t avoid it.  In other words, even if I do pick one of the two options, I’m not making it out of fear of the Stormhunters.\"</span></p><br/><p><span style=\"\">\"Ha ha……”</span></p><br/><p><span style=\"\">Hatch let out a short laugh.  At his laugh, Hyrkan laughed. There were many emotions mixed in with that laugh.</span></p><br/><p><span style=\"\">\"Lastly, I will never wear that in this game.\"</span></p><br/><p><span style=\"\">\"What?\"</span></p><br/><p><span style=\"\">Hatch stopped his laughter in surprise.  Hyrkan was pointing at his chest.</span></p><br/><p><span style=\"\">It was the emblem of the Stormhunters.</span></p><br/><p><span style=\"\">At that moment, Hatch was curious to hear his answer, so he asked Hyrkan a question.</span></p><br/><p><span style=\"\">\"Why do you keep refusing to join our guild?   In truth, it isn’t as if we are treating you badly.  If how I was treated was used as a baseline, you were….\"</span></p><br/><p><span style=\"\">At Hatch’s objection, Hyrkan put his index finger over his lips to shush him.</span></p><br/><p><span style=\"\">Hatch closed his mouth.</span></p><br/><p><span style=\"\">When silence descended, Hyrkan opened his mouth.</span></p><br/><p><span style=\"\">\"I’ll turn down the proposal.  However, I’m willing to make a deal.\"</span></p><br/><p><span style=\"\">2.</span></p><br/><p><span style=\"\">The gap ended, and history once again moved along.</span></p><br/><p><span style=\"\">[Barbarian King Nesha was sealed.]</span></p><br/><p><span style=\"\">\"Uh?\"</span></p><br/><p><span style=\"\">\"Really?\"</span></p><br/><p><span style=\"\">The Users crowding the Bizma Plain, and all the Users connected to the game heard the Announcement. </span></p><br/><p><span style=\"\">The news was immediately spread outside.  It was the version of the story with a gap in it.</span></p><br/><p><span style=\"\">All the people ranging from having little to do with Warlord to the ones where the game took center in their lives became aware of the news.</span></p><br/><p><span style=\"\">-My god.</span></p><br/><p><span style=\"\">-Wow.</span></p><br/><p><span style=\"\">-The Hahoe Mask really….</span></p><br/><p><span style=\"\">He had done it.</span></p><br/><p><span style=\"\">Hahoe Mask.</span></p><br/><p><span style=\"\">He made the impossible possible, and he turned despair into hope.  He turned a nightmare into a dream of good omen.  Hyrkan turned himself into a legend.</span></p><br/><p><span style=\"\">3.</span></p><br/><p><span style=\"\">\"Hyrkan!\"</span></p><br/><p><span style=\"\">Whistling ran towards Hyrkan.  He looked as if he wanted to squeeze Hyrkan to death with a hug.</span></p><br/><p><span style=\"\">However, Hyrkan was firm with his words when he saw Whistling running towards him.</span></p><br/><p><span style=\"\">\"If you attempt to hug or kiss me, I’m going to kill you.\"</span></p><br/><p><span style=\"\">Duhp-suhk!</span></p><br/><p><span style=\"\">Whistling ignored Hyrkan’s words, and he hugged Hyrkan.  </span></p><br/><p><span style=\"\">Hyrkan let out a yell.</span></p><br/><p><span style=\"\">\"Hey!\"</span></p><br/><p><span style=\"\">\"Thank you.\"</span></p><br/><p><span style=\"\">After saying those words, Whistling hugged him harder.  If this was happening in real life instead of the game, Whistling’s tears would have made Hyrkan’s shoulder wet.</span></p><br/><p><span style=\"\">This was how much gratitude Whistling felt towards Hyrkan.</span></p><br/><p><span style=\"\">Hyrkan pried Whistling off of him.  Hyrkan’s Strength stat was much higher, so he was able to easily escape from Whistling’s hug.</span></p><br/><p><span style=\"\">\"All right.  Let’s get ready to end this.  Of course, since I caught it by myself, all the loot is mine.\"</span></p><br/><p><span style=\"\">Even at that moment, Hyrkan was making calculations.  Whistling couldn’t help, but laugh at this.  Whistling knew this was Hyrkan’s attempt at cheering him  up.  This had started out as a festival, and he wanted it to remain a festival.  This was why Whistling didn’t say any more unnecessary words.  He didn’t say thank you, sorry or great work to him.</span></p><br/><p><span style=\"\">\"All right.  You take everything.  You should eat it all!\"</span></p><br/><p><span style=\"\">He agreed enthusiastically with Hyrkan.</span></p><br/><p><span style=\"\">At that moment, he was being cordial, but many thoughts crowded Hyrkan’s head.</span></p><br/><p><span style=\"\">'I never expected First One to be a program….'</span></p><br/><p><span style=\"\">He had made a deal with the Stormhunters guild.</span></p><br/><p><span style=\"\">The Stormhunters guild carried out their part of the deal by telling Hyrkan how he could reach the end of this game.</span></p><br/><p><span style=\"\">One of the requirement was for Hyrkan to jump past the level of First One Sulwoo.</span></p><br/><p><span style=\"\">Hatch gave an explanation.</span></p><br/><p><span style=\"\">\"First One Sulwoo is a program.  In the first place, it is impossible for a person to play the game like the First One.   The First One’s role is to manage Warlord, and it is a M.I. that plans out the content.  It measure the level difference between Users and the First One.  It is a measuring stick of how far the game had progressed.   Depending on how much distance the front-runners close with the First One, it controls the speed of progress in the game.\"</span></p><br/><p><span style=\"\">Hyrkan was baffled when he heard the explanation.  However, it did explain why not much content was being made by First One Sulwoo compared to its fame and profile.  The K media company created the videos, and this was why most of its hunting video was in diary format.  This was also the reason why there was no footage of First One Sulwoo conducting a raid..</span></p><br/><p><span style=\"\">\"That really screws with the User in the number 2 Rank.  I would have sued Tobot Soft if I was second in the Level Ranking.\"</span></p><br/><p><span style=\"\">At the same time, he felt sorry for the Users, who sacrificed their lives, to catch First One’s level.</span></p><br/><p><span style=\"\">“What can we do about it?  In the first place, Warlord was a game made to test the AI.  They didn’t plan for all of this, and they deserve to be sued.  Anyways, let’s get back to the main topic. If you pass the First One, you’ll be taking away the pencil and eraser used by the M.I. It would no longer be able to solve problems in managing Warlord.  Of course, this forces the M.I. to wrap everything up.  It basically puts forth the final boss into this world.\"</span></p><br/><p><span style=\"\">He had to catch up to the First One.</span></p><br/><p><span style=\"\">This was how he reached the epilogue.  </span></p><br/><p><span style=\"\">Moreover, Hyrkan planned on doing just that.</span></p><br/><p><span style=\"\">If he wanted to do this, he had to kill the Barbarian King.  Moreover, he needed the Chronicle Unique Item dropped by the Barbarian King.</span></p><br/><p><span style=\"\">'I’ll catch up to it immediately.'</span></p><br/><p><span style=\"\">Hyrkan didn’t plan on wilting down the home stretch.</span></p><br/><p><span style=\"\">He would burn bright until the end.  He’ll be a torch and a symbol that will decorate the end.</span></p><br/><p><span style=\"\">On top of that, he planned on becoming the true emperor.</span></p><br/><p><span style=\"\">'Emperor of Solo Play.  That sounds awesome.'</span></p><br/><p><span style=\"\">“No matter how I look at, this we are taking a loss on this deal.\" </span></p><br/><p><span style=\"\">They had left the Bizma Plain, and they were heading towards the Heard Fortress Ruin.  After struggling with his thoughts, Hatch finally opened his mouth.</span></p><br/><p><span style=\"\">\"Queen.  This really is a preposterous deal.  Why did we purchase the Red Bulls?  Why did we ally with the Hydra guild?  Didn’t we do it, so we could put the name of the Stormhunters in the end credits?\"</span></p><br/><p><span style=\"\">At his words, Shir didn’t say anything.  Instead of an answer, one corner of her mouth kept twitching.</span></p><br/><p><span style=\"\">\"Yet you are going to allow the Hahoe Mask to catch the Dragon by himself?  Moreover, we are going to give him our full support?   Why are we acting in this retarded manner?  We did all the hard work, yet we are giving everything to the Hahoe Mask on a silver platter!  It isn’t as if the Hahoe Mask is fighting as a member of the Stormhunters guild!\"</span></p><br/><p><span style=\"\">Hatch shook his head from side to side.  He realized his words were having no effect on Shir, so he immediately changed the target of his anger.</span></p><br/><p><span style=\"\">\"How can the Hahoe Mask be so confident?  He doesn’t even know what the final boss is, yet he wants to face it alone?  Does he realize how kind of opponent a Dragon is?  That bastard is weird.  I’m pretty sure he has around half a dozen screws loose inside his head.\"</span></p><br/><p><span style=\"\">\"If the Hahoe Mask fails, it’ll be our turn.  I don’t see the downside.\"</span></p><br/><p><span style=\"\">Chev, who had been silently listening to Hatch’s rant, gave his opinion.</span></p><br/><p><span style=\"\">Hatch couldn’t help, but laugh at his words.</span></p><br/><p><span style=\"\">\"Ah, is that so?  Is that why you just gave Argardo to the Hahoe Mask?\"</span></p><br/><p><span style=\"\">\"That’s…\"</span></p><br/><p><span style=\"\">\"This is the Hahoe Mask’s strategy.  He tells others to catch it if he fails.  However, that guy never fails.  It was the same in the Anugas Raid.  If the Hahoe Mask failed in the Anugas Raid, we would have been next.  However, the Hahoe Mask killed Anugas.\"</span></p><br/><p><span style=\"\">Chev let out a bitter laugh.</span></p><br/><p><span style=\"\">At that moment, Shir’s twitching mouth opened.</span></p><br/><p><span style=\"\">\"If the Hahoe Mask fails, the Dragon is ours.\"</span></p><br/><p><span style=\"\">\"That’s.....\"</span></p><br/><p><span style=\"\">\"On the other hand, if the Hahoe Mask succeeds, he is mine.\"</span></p><br/><p><span style=\"\">Hatch was about to mutter something, but he gave up on it.  He knew better than anyone.</span></p><br/><p><span style=\"\">'Shit. The Queen is totally head over heels for the Hahoe Mask.'</span></p><br/><p><span style=\"\">Hahoe Mask had given a counter-proposal.</span></p><br/><p><span style=\"\">He would kill the Dragon on his own.</span></p><br/><p><span style=\"\">Moreover, if they helped him, he would put on the name of the Stormhunters in a different game.</span></p><br/><p><span style=\"\">'Uh-whew.  This guild has no one, who is of sound mind.  They are all crazy.  Now the craziest one of them all will be joining us.  Words don’t even work on him.'</span></p><br/><p><span style=\"\">Hatch thought about the Hahoe Mask, who would become his comrade at the conclusion of Warlord.  He let out a sigh.</span></p><br/>\n</div>"}