{"title": "Chapter 2", "id": 2, "volume": 1, "url": "http://boxnovel.org/stunning-edge-chapter-2", "volume_title": "Volume 1", "body": "<h1>Chapter 2</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 2: Nobility</p><br/><p>Claire…the girl on the bed quietly mumbled the name to herself. The person’s name sounded pretty, but nobody could stand that attitude. Her memories were full of being rejected by handsome men and looking foolish.</p><br/><p>The door was suddenly banged open and the deafening sound caused Claire to look towards the door. The girl at the door resembled the previous beautiful woman and seemed younger than Claire, however, her expression of disgust and condescending attitude did not match her young age.</p><br/><p>Claire squinted her eyes a little only, because in her memories, she was terribly afraid of the girl before her. It was her younger sister, Lashia, a talented magician. Although she was only twelve years old, she had already become an advanced magician. Because of her outstanding talent, she was selected by the principal of the Sunrise Institute when she was only five years old to become one of his few disciples. This made Gordan Hill incredibly happy. The talented young miss hated Claire because their mother spoiled her so much. This wasn’t strange because Lashia, being a child prodigy, had the love of her grandfather, father, and brother. Thus, her mother spent more time with Claire who was disliked.</p><br/><p>“Humph, you brought great shame to the Hill name, ending up in this state just because you fell off a horse to chase a man.” Lashia held her head high and looked disdainfully at the person on the bed. She walked up to the bed, a sliver of malice glinting in her eyes, and stuck her face right up to Claire’s. She whispered in a low, poisonous voice, “My dear elder sister, why didn’t you die falling off that horse?”</p><br/><p>Claire looked silently at the pretty face before her. Who would have thought that someone who looked this innocent would say something so malicious?</p><br/><p>Lashia looked at Claire’s placid face and was taken aback. Normally her stupid elder sister would be trembling by not, yet currently, she was so calm.</p><br/><p>Footsteps sounded outside and Lashia’s expression changed to a frown. She muttered indistinctly under her breath and instantly, a tiny bolt of lightning appeared in her palm. Before Claire could react, Lashia had already pointed her finger at Claire’s back. Claire felt a terrible pain surge through her body from her back.</p><br/><p>“You male-chasing idiot, next time you worry mother I won’t let you off as easily, ” Lashia whispered coldly into Claire’s ear. “You know what will happen if you dare tell Mother. ”</p><br/><p>In Claire’s combined memories, it seemed that many similar situations had happened before. Without anyone knowing, the little sister Lashia seemed to give the previous Claire much suffering. Claire dropped her gaze emotionlessly, not looking when Lashia turned around.</p><br/><p>This time, the door opened quietly. The beautiful lady from before peaked inside and smiled.</p><br/><p>“Mother~~” Lashia greeted happily.</p><br/><p>“Lashia, you’re home!” Katherine smiled as she entered.</p><br/><p>“Yes, Mother. Let’s go eat now.” Lashia grabbed Katherine’s arm cheerfully.</p><br/><p>“You go eat first, I’ll stay with your older sister.” Kathleen patted Lashia’s head and said softly, “Your sister is not feeling well today, I’ll stay here to keep her company.”</p><br/><p>“Oh.” Lashia said, eyes cast down with a bitterness unnoticed by Katherine. Watching Katherine walk towards the bed, Lashia quietly and coldly humphed without anyone hearing and left quickly.</p><br/><p>“Claire, the maids will serve dinner soon.” Katherine sat near the bed and enclosed Claire’s hands in her own. Claire gave a start. The warmth coming from her hand made her relax immediately. So soft, so warm. Just like how that person held her hand and told her to be happy.</p><br/><p>“Mother…” Claire said softly.</p><br/><p>“What is it dear?” Katherine smiled gently. Suddenly, her expression changed and she asked anxiously, “Do you feel hurt anywhere?”</p><br/><p>“No, mother.” Claire suddenly smiled. “Mother, you haven’t eaten either. Are you hungry?”</p><br/><p>Katherine gave a start, and suddenly, tears came uncontrollably and silently. It was the first time Claire had asked a question like this, the first time Claire was kind to her.</p><br/><p>Seeing Katherine’s tears of joy, Claire lowered her eyes. Her true feelings were hidden by her long lashes.</p><br/><p>Claire. Claire, this will be my name in the future. A strange light glinted in the young girl’s eyes. The previous Claire didn’t dare report Lashia’s bullying or have the power to strike back. But, in the future… Claire’s eyes became icy as she remembered the burning sensation on her back once more.</p><br/><p>At this moment, a bright new star rose in the night sky of the Ceylon continent, but as for why, no one knew.</p><br/><p>The next morning, all the servants in Duke Hill’s castle were gossiping among themselves and casting uncertain glances at the study. It was nothing big, just their Miss’s strange behavior! Usually, she would already be out searching for handsome men by now, at either the theatre or the City Center Library… because young noble gentlemen normally hung out there. But today, she actually went to Duke Hill’s study! When the Duke wasn’t working inside, he would usually let his children inside his study. Although Claire fell off the horse yesterday, the doctor said she would be fine. But based on Miss’s wild personality, she would never enter the study she despised!</p><br/><p>In a large study with shining windows, a few huge bookshelves lined against the walls. Neatly classified books of all genres lined the bookshelves. A pretty blonde girl leaned on a windowsill thumbing through a thick book, The History of Ceylon.</p><br/><p>Flipping through the book, the girl’s expression became complex. She had already reached the section on the history of the country, Amparkland. The most credited people for the establishment of the country was the Hill clan, a family whose coat of arms was a rose. The young girl lifted her head to gaze thoughtfully upon the rose regalia hanging above the desk. It seems the Hill family wasn’t simply wealthy.</p><br/><p>Outside, light footsteps sounded but stopped abruptly at the door. Even though it was extremely light, Claire noticed instantly.</p><br/><p>From the door came a low and cold voice,“Miss, the Duke has returned.”</p><br/><p>“Oh,” Claire answered unenthusiastically, closing the book. From her combined memory she already knew the person outside the door was her knight, Jean, who was supposed to protect her.</p><br/><p>Claire got up and just when she was about to set the book back on the bookshelf, she heard a series of footsteps sounded outside the door. Then, she heard the sound of Jean’s greeting.</p><br/><p>The door was pushed open and an austere, old man with luxurious clothes appeared. He looked to be more than fifty years old, but very energetic. His brows and Claire’s were similar, letting her know that he was her grandfather. Currently, the Duke held a great amount of power in Amparkland and was also the most powerful man in his family.</p><br/><p>“Grandfather,” Claire greeted indifferently, her previous cowardly attitude gone.</p><br/><p>Gordan Hill looked at the young girl in front of him and frowned, a strange emotion flickering in his eyes. He couldn’t believe at first that his headstrong granddaughter would be willingly reading in the study when he heard about it, but now his own eyes convinced him. And how differently she dressed! Usually she would wear elaborate dresses like a butterfly, but today she donned the plainest white dress, her curly golden hair in the simplest style. Did she hit her head too hard when she fell off the horse yesterday?</p><br/><p>“Claire, you fell off a horse yesterday?” Gordan walked in, asking casually. The people following him stopped outside and lightly closed the door to the study.</p><br/><p>“I’m fine now,” Claire replied lightly.</p><br/><p>“Then that’s good.” Seeing the book in Claire’s hand, Gordan,was a little surprised. She’s reading The History of Ceylon? He knew this granddaughter of his inside out: capricious, unruly, and abnormally attracted to the opposite sex… She, who hated studying and learning more than anything else, was actually reading the most dull and boring Ceylonese History?!</p><br/><p>“So, what do you think after reading The History of Ceylon?” Duke Gordan asked offhandedly, walking to his study desk.</p><br/><p>“Let the banner of roses fly forever,” Claire replied quietly with a hint of a smile.</p><br/><p>Duke Gordan’s eyes bulged as he stared, astounded at the smiling girl before him. What did he just hear?</p><br/><p>Let the banner of roses fly forever!!!</p><br/><p>Let the Hill clan exist forever!</p><br/><p>“Say that again!” Gordan commanded in a deep tone, squinting at the girl in front of him.</p><br/><p>“Let the banner of roses fly forever.” An imperceptible hint of a smile flashed within Claire’s eyes. This elderly man in front of her was the heart and center of this clan, the head and the leader. Through numerous previous experiences, she knew exactly how important it was in unfamiliar surroundings to pay close attention and take advantage of superior people to the greatest extent. If she wanted to survive in this unknown world, if she wanted to become powerful, then gaining the favor of this person in front of her would be her first threshold.</p><br/><p>If someone else had told him this, Gordan would dismiss it without a thought because it would only be a means of flattering. But its meaning was drastically different when this young girl said it! His only son and other two grandsons and granddaughter had never said anything like it, but it was said by someone who was considered a failure like Claire. Duke Gordan was completely stunned.</p><br/><p>“Grandfather, I have been acting out of line insensibly and it has been going on for too long. From now on, I will take my studies seriously and definitely not let down the Hill clan again.” Claire stare at the stunned old man. Every word, every sentence had been said clearly, and her green eyes held a serious gaze.</p><br/><p>Amazed, Gordan looked blankly at this sincere young girl, unable to speak for a long time. Claire kept quiet, too, silently staring at her grandfather.</p><br/><p>“Great!” Finally, Gordan came back to his senses and laughed in relief. He patted Claire on the shoulder and praised, “This is my girl, this is the child of the Hill Clan!”</p><br/><p>“I promise I won’t disappoint you,” Claire smiled. Her smile was shining with confidence.</p><br/><p>This day, the whole manor boiled.</p><br/><p>This idiotic girl that was infatuated with men and always disliked by the duke was actually led out of the study today, hand-in-hand with the normally serious duke, and they were both smiling!</p><br/><p>The foolish male-chasing Miss of the Hill Clan was now favored! The news spread like wildfire throughout the whole manor.</p><br/>\n</div>"}