{"title": "Chapter 10", "id": 10, "volume": 1, "url": "http://boxnovel.org/stunning-edge-chapter-10", "volume_title": "Volume 1", "body": "<h1>Chapter 10</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 10: The Valuable Space Teleportation Scroll</p><br/><p>The atmosphere in the study was so dense it felt suffocating.</p><br/><p>No one spoke. All that existed was the sound of breathing.</p><br/><p>“I hope you uphold your promise.” Claire said indifferent and coldly.</p><br/><p>Gordan and Nancy both let out a quiet sigh of relief, not bad, not bad. Claire forgave her guardian knight.</p><br/><p>“Grandfather, I’ll be going first back to my room to rest.” Claire curtseyed towards Gordan.</p><br/><p>“Yes, you should rest properly.” Gordan nodded affectionately. After curtseying to Nancy, she left. Nobody saw the profound look in her eyes after she exited.</p><br/><p>After the study’s door closed, Gordan let out a long sigh.</p><br/><p>“Duke Hill, I won’t avoid the consequences of today’s situation.” Nancy held a flat expression.</p><br/><p>“No, your Highness.” Gordan shook his head no, not wanting to discuss the situation any more. “There’s no more problems. You don’t need to worry.”</p><br/><p>Nancy nodded, a deep expression in his eyes. No one knew what he was thinking.</p><br/><p>“Jean, go find a healer to treat you.” Gordan quietly said as he turned to face the still kneeling Jean.</p><br/><p>“Yes, your Grace.” Jean stood up and walked out. The bloodstain stood out sharply on the floor.</p><br/><p>“Duke Hill, I’ll also take my leave,” Nancy nodded and said quietly.</p><br/><p>“Pardon my absence. I won’t see you out,” Gordan said rather exhausted. Although the matter had been resolved, of course he would still feel uncomfortable. Both girls were his darling granddaughters, both the future hope of the Hill clan. But such an intense conflict happened. If they couldn’t resolve this issue, then there would be bigger problems. He frowned severely. This matter weighed heavily on his heart. The situation hadn’t been told to their mother, Katherine, yet. If Katherine knew, then there would be another headache.</p><br/><p>Nancy said his farewells to Gordan, then left together with Jean.</p><br/><p>After going to the healer, the injuries on Jean’s thigh were mostly gone and would completely heal soon.</p><br/><p>In the middle of the night, Nancy’s carriage stopped again in the desolate alley.</p><br/><p>“Weren’t you a bit too hasty tonight?” Nancy said in a low voice.</p><br/><p>The carriage was silent.</p><br/><p>After a long while, a voice sounded quietly.</p><br/><p>“In that instant, I felt like she tore my heart out of my chest.” This was no other person than Jean!</p><br/><p>Nancy quieted down, his feelings extremely complicated. It wasn’t just Jean; he had also lost himself in that moment. This night, Claire seemed brighter than the sun.</p><br/><p>“She definitely isn’t the Claire from before.” Jean quietly said solemnly.</p><br/><p>“Absolutely not.” Nancy nodded, his face also serious.</p><br/><p>“Let’s see if she’s worthy of my vow.” Jean’s eye flashed an unknown light.</p><br/><p>Nancy was silent, then finally nodded.</p><br/><p>“You should go back and rest properly.” Nancy was obviously talking about Jean’s injury.</p><br/><p>“It’s not a big deal.” Jean said offhandedly.</p><br/><p>“Well, I’ll go back in order to avoid suspicion.”</p><br/><p>The night was silent.</p><br/><p>Claire lay on her bed, her face cold as ice. Gap, what a huge gap between her and Lashia. If it wasn’t for Lashia having no real battle experience, she would probably already be dead. But also because of this, she now had Jean’s loyalty. Humph! Claire coldly humphed. She didn’t press Jean so hard in front of Gordon just because of momentarily hot headedness. She was too weak right now and she needed a loyal person to protect her with all his might. And Jean was the best person for this job.</p><br/><p>Power can only come from oneself. Authority is based on power.</p><br/><p>Claire flipped on her bed, folded her legs, and then entered the Meditation state.</p><br/><p>At this moment, a light knock sounded on the window.</p><br/><p>Claire slowly opened her eyes. Who was it? They knocked on the window instead of coming in from the door. Claire got up from the bed and opened the window. At the window was a person in a cloak, face covered. But Claire smiled, because it was Emery.</p><br/><p>“Teacher, what is it? Why did you come at such a late time?” Claire said while moving aside to let Emery in. She knew if Emery came this late and not even from the front door, there must be something important.</p><br/><p>“Claire, I heard all about what happened tonight.” After he entered, Emery removed his cloak and revealed his face. His originally blank face was full of sincere worry.</p><br/><p>“I’m fine, teacher, can’t you see? I’m standing perfectly well in front of you.” Claire smiled and shrugged her shoulders to assure him.</p><br/><p>“But you almost lost your life.” Emery’s face turned ugly. It seemed like he already knew the details of the situation clearly.</p><br/><p>It was true that if Claire didn’t trick Lashia into thinking Duke Gordan had come, she might have already become a corpse. No matter how much they punished Lashia, it would have still been irreversible.</p><br/><p>“Teacher, I already said there’s no need to worry. I will always survive.” Claire confidently smiled.</p><br/><p>“Here. In a critical situation tear this, it’s set to a secret room in my house. It’s a very hidden and safe area.” Emery took out a scroll from his robe and gave it to Claire.</p><br/><p>Claire looked at the scroll uncertainly, because from what Emery had said, this seems to be a… Claire took the scroll over and was startled. It really was a Space Teleportation Scroll! She had seen this device in the Institute’s library’s “Magic Device Handbook” so she recognized it at once. This item was priceless! Because even if you had the money, you still couldn’t buy an item as valuable as this. Having this meant you have an extra life, so owners of these scroll wouldn’t give up one so easily. Emery didn’t yet have the magic power to make such a precious device, so he must have spent a lot of effort in obtaining this one. But he gave it to Claire so easily! Claire was touched.</p><br/><p>“No! Teacher, this is far too precious. You keep it for times of danger.” Claire shook her head and returned the scroll to Emery.</p><br/><p>“Claire, listen to me, you keep it. I have a feeling you will need it more than me. Just accept it as a token of appreciation from me.” Emery was persistent.</p><br/><p>“Teacher……” Claire was thoroughly moved. Emery gave her such a precious gift after he found out that she had been in danger. She will never forget this token of appreciation, Claire swore in her heart.</p><br/><p>“It’s getting late, and I must be going. Get some rest. When you have time, I’ll teach you more magic. Only knowing the Fire shield is not enough.” After finishing this sentence, Emery put on his cloak and disappeared out the window.</p><br/><p>Claire held the precious scroll tightly in her hand, warmth flooding her.</p><br/><p>The conflict between Claire and Lashia was only known by Duke Gordan, Nancy, Jean, and some retainers that Gordan trusted. No one else was told. So after Lashia didn’t show up at the Institute for several days in a row, some students finally couldn’t resist the urge to ask Claire about her. It was then that Claire finally realize that Lashia was not only the center of attention for those noble girls, but also the dream spouse of many noble young men. Although Lashia was only twelve years old, four years from her adult ceremony, she was already beautifully attractive. Not to mention her background and family, and that the principal of the Institute was very fond of her. With such a strong backing, how could she not attract attention?</p><br/><p>After class, Claire sat on the bench by the Institute’s lake alone, digesting the information taught by the teacher in class. Not far away several noble boys and girls kept throwing their glances her way.</p><br/><p>After a period of time, it seemed like they finally made their decision, and started walking towards Claire. The noble girls walked in the front, while the boys chickened out and carefully trailed behind them as if Claire would swallow them up, raw and whole!</p><br/>\n</div>"}