{"title": "Chapter 15", "id": 15, "volume": 1, "url": "http://boxnovel.org/stunning-edge-chapter-15", "volume_title": "Volume 1", "body": "<h1>Chapter 15</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 15: It’s Someone from the Temple of Light!</p><br/><p>As Claire wondered about what kind of situation could make Cliff so anxious, Cliff’s voice floated into her ear. “Little beauty, go quickly and return quickly. I’ll be waiting for you.” After saying this, Cliff turned around and started going back. He didn’t give the guardian knight, Jean, so much as a glance. He was the type of person who only responded to people who interested him. Magicians were always proud and haughty because of their powerful strength.</p><br/><p>“Claire, did Cliff really take you as his disciple?” Jean prompted his horse to go faster as he confirmed with Claire.</p><br/><p>“Yes.” Claire replied indifferently while inspecting the items Cliff gave her. Claire didn’t have a favorable impression of Jean, even though he swore his loyalty to her that day. After putting on the bracelet and storing away the cloak and nifty bow, Claire rode forward. Jean followed closely behind.</p><br/><p>They didn’t meet any difficulties the whole way. Because if a group of just two people, one magician and one warrior, was setting out for Gale Gorge, they were either novices or a group that was very strong. Obviously, most people believed the two were the latter. Their eyes didn’t have the curiosity or excitement of a novice. This made swindlers and bandits remain at a respectful distance. These kinds of people often had sharp senses. They didn’t want to try to gain an advantage only to end up worse off.</p><br/><p>In this way, they traveled for five days and finally arrived at a town near Gale Gorge. Jean restocked, and they prepared to enter the gorge the next day.</p><br/><p>At nightfall, Claire sat near the window and looked at the two full moons in the sky quietly. This new world was a very mysterious place. Every year in the first four months, there was one moon, the next four months, two moons, and the last four months, three moons. Right now it was the beginning of the seventh month and there were two blue moons. Claire even thought that maybe it’s because of these strange moons that this world was full of mysterious things like magic.</p><br/><p>Gale Gorge was a place of both danger and profit. The more danger you go through, the more profit you earn. Countless adventurers and mercenary groups arrive here each day to complete missions, hunt magical beasts, dig out the magical cores from the beasts, and sell everything for a lot of money. But rarely would someone enter the deep parts of Gale Gorge. Some say on the other end of the gorge was a desert, others say endless glaciers. No one knows for sure.</p><br/><p>Claire and Jean rode their horses into Gale Gorge, but they didn’t see any magical beasts the whole way, not even really low grade ones.</p><br/><p>“Either there’s a high grade beast nearby, or a powerful mercenary group just passed through.” Jean analyzed. Apparently a high grade beast would not live here, so the answer must be that a strong and mighty mercenary group went this way.</p><br/><p>“Let’s go.” Claire gaze swept over dark and wet spots because the heartbreak grass grows in damp places. But even after searching they didn’t find anything.</p><br/><p>The depth and width of Gale Gorge was beyond imagination. Further in, the path had become too narrow for horses to enter, so the two of them had to leave their steeds and travel on foot.</p><br/><p>After traveling for a long time, it was gradually getting dark, and they had only found three heartbreak grass.</p><br/><p>“Let’s set up camp right up front. There’s a clearing.” Evidently, Jean had come here before.</p><br/><p>Claire nodded but didn’t say anything.</p><br/><p>As the two made their way forward, they heard strange noises, as if someone was fighting. The smell of blood floated in the air, accompanied by men shouting and wolves howling.</p><br/><p>“It’s a Wind Wolf pack!” Jean frowned. Someone was obviously attacked by the Wind Wolves and struggling hard. Wind Wolves were only third grade beasts, but they were especially bothersome because they could spit out wind blades that were very damaging and they lived in packs. Ruthless and cold-blooded, and also possessing enough intelligence, Wind Wolves were annoying animals that lived on revenge.</p><br/><p>“Damn it, daddy me is gonna fight you to death!” A familiar bold voice sounded out in rage.</p><br/><p>Immediately another voice rebuked him worriedly, “Jackson, don’t do anything impulsive!”</p><br/><p>Oh, Claire realized. This is the voice she heard at the Mercenary Guild. Something called the Iron Blood mercenary group?</p><br/><p>“It seems like they have a problem on their hands.” Jean looked at the sky. It was getting darker by the minute. And darkness is the paradise for fear, evil, and death.</p><br/><p>Claire searched through a pocket slung around her waist and took out a little black bird. The bird was lifeless, because it was a magic puppet, one of Emery’s proudest magic creations.</p><br/><p>Claire infused some magic power into the puppet bird and it stood up, chirped twice, and flew off into the night sky. Claire then took out a small crystal ball. The crystal ball immediately showed what the magic bird puppet was seeing.</p><br/><p>Jean looked on, startled. That poker-faced Emery, old-fashioned and stingy, actually taught his special skill to Claire!!!</p><br/><p>The tiny crystal globe showed that the group of mercenaries seemed to be in a difficult predicament, with still more Wind Wolves waiting around. They seemed to be waiting for darkness and night. Wheel formation, both the simplest and most efficient. Even though they were in a tight position, no one had died, which showed their strength. Most were warriors and archers, with only one magician who seemed to have used up all his magic power. The rareness of magicians directly determined their value. The weak young magician was surrounded and heavily protected by his companions.</p><br/><p>“Miss, you want to help them?” This time, Jean didn’t use Claire’s name but Miss, because he was waiting for Claire’s command, not her opinion.</p><br/><p>A strange light flashed through Claire’s eyes and disappeared almost immediately. Grand Swordsman, only below Swordsman Sage and Swordmaster. This would be a good opportunity to test Jean’s actual level.</p><br/><p>“Yes, help them.” Claire said softly. The people were part of the second largest mercenary group in the whole country, so helping them would definitely be good for the future.</p><br/><p>“Yes.” Jean pulled out his sword. His sword trembled slightly, then glowed a teal color. That was the color of a Grand Warrior’s Dou Qi. But Claire knew that if Cliff was right, Jean’s Dou Qi should be violet! Jean didn’t rush forward blindly. He knew his first priority was Claire’s safety.</p><br/><p>Claire summoned back her bird puppet and put away the crystal globe. She took out a small and exquisite wand. Of course, this was also from Emery. It was the wand that Emery first used when he became a magician, so its significance was different.</p><br/><p>Claire slowly raised her wand and started chanting a complex spell. Suddenly, innumerous fist-sized fireballs crashed down on the Wind Wolves in front of them. This unexpected attack made the Wind Wolves howl in pain, the smell of singed fur everywhere. Jean slashed an open path in the front and he and Claire made their way successfully to the people surrounded by the wolves.</p><br/><p>“Magicians!”</p><br/><p>“It’s a magician!”</p><br/><p>The shouts were filled with hope and happiness.</p><br/><p>“It’s you! Beautiful lady.” The man with a few blood stains on his clothes was the same man who tried to strike up a conversation with Claire at the Mercenary Guild.</p><br/><p>Claire didn’t reply, and instead focused her attention in front of her to be fully aware of any danger. Night had already come, and the Wind Wolves suddenly quieted down. But they didn’t go away and just collectively lay down to hide themselves in the bushes, as if preparing for the next attack.</p><br/><p>“Light the bonfire first.” The burly man named Jackson seemed to be the squad leader, and right now he finally calmed down, starting to order around the injured but still able people to do some small tasks they could complete. The others continued to be on guard.</p><br/><p>Wind…</p><br/><p>At that moment, a strange wind blew.</p><br/><p>Suddenly, a pure streak of white light appeared in mid air faraway.</p><br/><p>The crowd all looked towards the origin of the light, stunned. The dazzling light came closer and closer, and a human form stood in the middle of it.</p><br/><p>“It’s someone from the Temple of Light!” The relief in Jackson’s voice was even stronger. Anyone able to fly in mid-air and have such pure white light must be from the Temple of Light and have unordinary strength! If Claire’s showing up made them feel the hope of salvation, then the appearance of someone from the Temple of Light absolutely reassured them!</p><br/><p>The pure white light came closer and closer, and the human figure in the light also became more and more clear.</p><br/><p>It was clearly a male.</p><br/>\n</div>"}