{"title": "Chapter 39", "id": 39, "volume": 1, "url": "http://boxnovel.org/stunning-edge-chapter-39", "volume_title": "Volume 1", "body": "<h1>Chapter 39</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 39: Black Hair, Black Irises</p><br/><p>“Is it that freakish youth who lost to you?” Naturally, Walter also sensed something was wrong.</p><br/><p>“Doesn’t seem like it.” Claire shook her head slightly.</p><br/><p>“It’s most likely assassins sent by that ambassador. His excessively cautious nature wouldn’t let you continue to grow. That day, your fight scared that fat pig.” Jean laughed quietly. It was unusual that words like these would come out of his mouth.</p><br/><p>Claire sighed lightly. That day’s victory was really a fluke. People like the pope probably understood why she won. That’s why the pope didn’t care at all. But that ambassador seemed to firmly believe that she really had that strength and power. Alas, just as expected… She felt a bit wronged.</p><br/><p>As Walter heard Claire’s quiet sigh, he naturally understood what Claire was thinking and wanted to laugh again. But just like before, he didn’t dare to.</p><br/><p>“But it seems like you don’t need to do anything.” Claire squinted, sensing the activity outside. It was two groups of people, the group in the back had already targeting the somewhat impatient group in front. Claire immediately understood that it was definitely people sent by Grandfather to protect her. Grandfather had already anticipated this kind of situation.</p><br/><p>“Yes, so we should continue to go.” Jean sensed the movements outside and smiled. Those people are waiting, waiting until they got to a secluded area to make to move. But, once they arrived at such a place, who knows who will attack who.</p><br/><p>And like so, the carriage proceeded uneventfully to the door of the Magic Guild. When the apprentice magician at the door saw who got off, he immediately came up and welcomed them. Claire Hill, this great name, resounded through the capital overnight.</p><br/><p>Claire and Jean were led by the apprentice magician to the huge magic elevator and went directly to Cliff’s lab on the top floor. The apprentice magician bowed and then took the elevator back down.</p><br/><p>Claire knocked on the door. “Master.”</p><br/><p>“Not here.” The clear voice of Cliff came from the inside with a little rage.</p><br/><p>Walter tried to hold in his laughter; this old man was really very childish. He was clearly inside, yet he still said he wasn’t. It was very obvious he was still angry about the matter of Claire learning Dou Qi and not telling him. This was normal, for regardless if it was warriors learning magic or magicians learning Dou Qi, their master would definitely feel humiliated and furious.</p><br/><p>“Master, I apologize. I will agree to any request you want.” Claire said this sentence slowly and clearly, smiling lightly.</p><br/><p>“Really?!” The next moment, the door was suddenly thrown open, and Cliff’s grinning face popped out.</p><br/><p>Walter twitched. This little devil, oh yeah, little devil… She actually dared to say this kind of resolute words, then… Walter looked at Cliff somewhat sympathetically. The poor guy, he will definitely, absolutely be tricked! Completely, absolutely! He swore！</p><br/><p>“Really!” Claire nodded and said assuredly, “Whatever makes Master not angry. I am learning Dou Qi only for self-defense. If I’m in an emergency situation and I don’t have enough time to chant any spells, I can still escape.”</p><br/><p>Cliff pursed his lips, pouting, and didn’t say anything.</p><br/><p>“I encountered an assassin on the way here. With my identity, I’m afraid I’ll often encounter such situations in the future, Master. Master’s teaching of magic is the real deal. I only use Dou Qi to escape. Master, do I still have the heart to use spells when someone already pierced my chest?” Claire took a breath, asking in a fake, pitiful way.</p><br/><p>Cliff grabbed his hair and bitterly rubbed. He said angrily, “Who wants to kill you? If they dare to touch you, I will go place a forbidden spell on his entire family and blow them up!”</p><br/><p>Jean and Walter both twitched their mouths. Blow up a whole family with a forbidden spell? They were afraid that he would not blow up just a clan, but an entire city.</p><br/><p>“Then you’re not angry anymore, Master?” Claire laughed.</p><br/><p>“If you do what you just promised, then I won’t get angry.” Cliff said after he moved out of the way to let them in.</p><br/><p>“Yes, but only one request.” There was an imperceivable flash of craftiness in Claire’s eyes.</p><br/><p>“Very well, one request, one request.” Cliff’s eyes fell on Claire’s beautiful lace skirt, looking all over.</p><br/><p>Walter and Jean immediately understood what the old perverted wolf wanted to do. He wanted to do something he had never succeeded at: lifting Claire’s skirt!!!</p><br/><p>“Then, then… I want to lift your skirt, and you are not allowed to kick my face.” Cliff said, embarrassed.</p><br/><p>“Okay.” To Jean and Walter’s astonishment, Claire actually agreed to the request.</p><br/><p>In the next moment, Walter confirmed again with certainty, absolute certainty, that little devil was a little devil! Never mess with her, and don’t try to take the slightest bit advantage of her.</p><br/><p>Cliff lifted Claire’s skirt with great excitement, then Cliff’s smile froze. Claire was wearing sturdy pants used for training!!! The pants were wrapped tightly around Claire’s legs, completely airtight.</p><br/><p>Claire calmly pulled her skirt down, saying softly to a dumbfounded Cliff, “Master, I met your request. Are you not angry now?”</p><br/><p>Cliff face was ashen as his mouth twitched, “Yes, yes…”</p><br/><p>Walter had already flipped from laughing. As expected, this perverted old man would be tricked. But Claire, this little devil, was so clever, actually guessing beforehand accurately that Cliff would bring up this kind of shameless request and even thought of a countermeasure. Jean also stifled a laugh from behind.</p><br/><p>“Master, I wanted you to look at this.” Claire took White Emperor out of her bosom. “What kind of magic beast is this?”</p><br/><p>“What is this?” Cliff looked at the small furball in Claire’s hands in amazement. “Since when did you like this kind of cute pet?”</p><br/><p>“Master doesn’t recognize it?” Claire was puzzled. If even the wizard sage Cliff didn’t know, then there was really no way of knowing the identity of this little thing.</p><br/><p>Cliff frowned and looked seriously at the little thing in Claire’s arms, peering at it over and over, and then shook his head. “I’ve never seen nor heard of it before.”</p><br/><p>Claire frowned slightly and looked down at White Emperor in her embrace. This little guy appeared in a strange manner, and his contract was contracted boldly and forcefully. No matter how she looked at it, she could only sense this little guy was just a cute small animal and didn’t seemed like a magic beast powerful enough to force a contract.</p><br/><p>“Claire! When my experiments are done, you must come with me to cultivate and follow me closely.” Cliff snorted, still feeling so wronged and cheated.</p><br/><p>“Yes, okay, but Master, you seem to have been doing these experiments for a long time?” Claire asked, puzzled, and put the matter of White Emperor aside for the time being.</p><br/><p>“Materials are rare and hard to find.” Cliff frowned and sighed, “Right, since you came today, I’ll teach you some spells while you are here. Remember it yourself.” After Cliff finished speaking, he stretched out his hand, and just like that, a soft light entered Claire’s mind and a few unfamiliar spells entered Claire’s consciousness.</p><br/><p>“All right. If there are no problems, you can leave now. Once I am finished on my end, I will go find you.” Cliff said as he waved.</p><br/><p>“Yes.” Claire nodded, backing out of the room with White Emperor in her arms.</p><br/><p>The moment Claire got on her carriage in front of the entrance of the Magician Council, she saw another carriage stop. The emblem on the carriage was very distinct; it was the emblem of the Temple of Light.</p><br/><p>What was the Temple of Light doing here？</p><br/><p>Claire looked out the window and came to realization when she saw Lawrence exiting the carriage energetically. So it was Master’s old friend. But usually, the Temple of Light and the Magician Council never interfered in each other’s affairs and the two of them only fought in private to avoid attention. Why would Lawson appear here today?</p><br/><p>“Miss, it’s a bit strange.” Jean also felt something was off.</p><br/><p>“If those hypocrites from the Temple of Light appear here boldly, does that mean it’s almost the time for the prophecy?” Walter’s voice sounded.</p><br/><p>“What prophecy?” Claire asked quietly.</p><br/><p>“Just some stupid nonsense, a prophecy from a thousand years ago. Something about a double-black woman appearing, overturning the Light.” Walter replied indifferently, “There has never been a woman with both black irises and black hair, so it’s just nonsense. Let’s go.”</p><br/><p>Claire nodded. “Let’s go the the capital’s library. I want to go see if there’s any illustrated handbooks for beasts that I haven’t read yet and what type of being this little creature really is.” Claire looked down at the White Emperor who was currently lying quietly in her arms.</p><br/><p>The library of the capital, with large, tall white jade doors and a grand statue of a book in the entrance, symbolized wisdom.</p><br/><p>Claire had come here often before, but not for reading, and instead, to look for handsome men.</p><br/><p>When Claire’s figure appeared in the library doorway, there was a small commotion. All the young girls and boys looked at her, gossiping quietly.</p><br/><p>The phrase Claire heard the most was “Miracle Claire”.</p><br/><p>“Since when did I have such a title?” Claire frowned slightly.</p><br/><p>“From when you displayed both magic and Dou Qi and defeated that youth, the whole capital has been calling Miss Miracle Claire.” Jean answered quietly. The sister of genius Lashia, Miracle Claire.</p><br/><p>Boring, Claire cursed in her heart and walked towards the miscellaneous section.</p><br/><p>A few unfriendly gazes followed Claire closely.</p><br/>\n</div>"}