{"title": "Chapter 37", "id": 37, "volume": 1, "url": "http://boxnovel.org/stunning-edge-chapter-37", "volume_title": "Volume 1", "body": "<h1>Chapter 37</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 37: Hidden Crisis</p><br/><p>“What did you just say?” Wenmo Shui asked anxiously, dropping the roasted chicken.</p><br/><p>“How enchanting, how valiant.” Yixuan Feng slowly got up, his eyes blurred as he looked forward in a daze. It was as if the enchanting Claire was right in front of his eyes.</p><br/><p>“Pft~” Wenmo Shui spit out the last piece of bone onto Yixuan Feng’s face.</p><br/><p>Yixuan Feng blankly wiped it off his face and giggled, “Wenmo, she’s so enchanting.”</p><br/><p>Wenmo Shui opened his mouth wide, dumbstruck. As he saw that person giggling foolishly, the unease in his heart grew bigger and bigger. This was the first time he saw Yixuan Feng in love like this!</p><br/><p>He’s done for! This guy was actually in love!</p><br/><p>This little bastard had always treated those women disdainfully as if they were beneath him. One time, he couldn’t stand to watch a super affectionate younger female cousin to the point that he spit out tea from his mouth, not giving any face, causing his T-rex Ma to think there was something wrong with his body and secretly check. The result showed that all of Yixuan Feng’s functions worked properly. It was just that he couldn’t fall for those women.</p><br/><p>Now, he had finally fallen for a girl.</p><br/><p>But!!!</p><br/><p>This girl won’t do!</p><br/><p>Because she was from Amparkland and the influential Duke Hill’s granddaughter!</p><br/><p>Currently, the relationship between Amparkland and Lagark seemed fine, but they all knew the relationship was in fact, quite strained. Turbulent waves swelled secretly. Lagark’s current emperor was not someone who was satisfied with what he had now.</p><br/><p>So this woman absolutely won’t do!</p><br/><p>Also, the ambassador seemed to have his way of thinking.</p><br/><p>Before Yixuan Feng could say anything, Wenmo Shui suddenly jumped up. He pulled the sheet and after a slight vibration, Wenmo Shui immediately tore it to shreds. Wenmo Shui wrapped up Yixuan Feng without a word, tightly and securely.</p><br/><p>“Crap! You barbarian! What are you doing?” Yixuan Feng angrily yelled as he finally came back to his senses and saw Wenmo Shui tie him up. It was already useless to struggle.</p><br/><p>“Don’t even think about it. Tonight we will go back. That woman won’t do, she is Amparkland’s Duke Gordan’s granddaughter.” Wenmo Shui carefully wrapped him up from head to toe and then tightened it, hard.</p><br/><p>“Are you looking to die?! Let me go! I want to find her right now.” Yixuan Feng wriggled like an earthworm, but how could he be a match for the warrior, Wenmo Shui?</p><br/><p>Wenmo Shui picked up Yixuan Feng with one swipe and lightly threw him onto the bed. Then, Yixuan Feng, who had been wrapped in circles, was wrapped up even more and continued on to wriggle.</p><br/><p>“You barbarian actually dare to tie me up. I will make you… eugh, eugh, umph…” The last words didn’t come out. Wenmo Shui had stuffed a wad of bed sheets into Yixuan Feng’s mouth.</p><br/><p>Wenmo Shui completely ignored Yixuan Feng, who was crazily wriggling on the bed, and instead, minded his own business as he started to pack up stuff. They needed to leave this place tonight. With the ambassador’s personality, he probably wouldn’t easily let the woman called Claire go. Double classed magic warrior! Even though right now her level wasn’t that high, nobody could predict if it would be like this in the future. The ambassador wouldn’t risk letting her grow.</p><br/><p>Also, naturally, he couldn’t let Yixuan Feng know this information. Wenmo Shui looked at the struggling person on the bed and made a decision. They’ll leave right now! They’ll bring this guy back home and let his mom deal with him. As long as they went home, he didn’t need to deal with it any more.</p><br/><p>The moment the students and instructors that attended the banquet came back, they saw Wenmo Shui carrying a mummy-like Yixuan Feng onto the carriage. Yixuan Feng wriggled with all his might as Wenmo Shui faced the stupefied instructors and said, “We’ll leave first. Teacher, this guy suffered too much. I was afraid he would be too depressed and try to commit suicide, so I took on a small measure.” As he said this Wenmo Shui didn’t look shameful at all, his expression and heart rate staying the same.</p><br/><p>The instructor stood, dumbfounded, not knowing what to do or say. The other students also stood spellbound, watching this strange, comical scene.</p><br/><p>The ambassador nodded and let them go. From the very start, the ambassador was afraid that Yixuan Feng had received too much of an impact and do something that would influence the somewhat peaceful relations of the two countries. Wenmo Shui bringing him away right now naturally was a good thing. The faster the better!</p><br/><p>No one noticed that when Wenmo Shui said those words that the person on his shoulder, Yixuan Feng, started to wriggle even more. As Yixuan Feng continued creating muffled sounds the whole time he was carried onto the carriage. Only Wenmo Shui could figure out Yixuan Feng’s muffled words. “Eugh, eugh, eugh, ah eugh eugh… eugh eugh… eugh… umph… umph, umph… (Wenmo Shui, you lowly person, I’ll become your mortal enemy… slaughter you… ) It was a pity these muffled sounds were smothered into the dark night.</p><br/><p>The carriage left, carrying Yixuan Feng who had been wrapped up tightly and the languid looking Wenmo Shui, disappearing into the night. After showing customs their documents, the carriage left that night without a hitch.</p><br/><p>And so, Yixuan Feng was unfairly brought away forcefully by Wenmo Shui, leaving far away from his heart’s valiant and enchanting Claire.</p><br/><p>After the banquet was over, Claire and Duke Gordan left together on a carriage.</p><br/><p>Duke Gordan had a red glow, his mood very good. In the moment he knew Claire was actually a double classed magic warrior, he became moved and then understood that clearly, Claire must have learned Dou Qi with Jean. This granddaughter was really too hard working. This time really made him incessantly surprised. It surprised him so much his heart almost jumped out of his throat.</p><br/><p>In the dead of night, Claire laid on the bed with eyes closed, but wasn’t deep asleep.</p><br/><p>Currently in the study, there was a solemn and tense atmosphere.</p><br/><p>“Sir, the youth who lost to the Miss, Yixuan Feng, and that valiant warrior, Wenmo Shui, already left the capital at night.” A man clothed in tight garments reported to Duke Gordan in a low tone.</p><br/><p>Duke Gordan frowned, then slowly nodded. In a low voice, he said, “Send more people to follow Claire. They must protect her. Although she displayed her strength when winning this competition, as a magic warrior, I’m afraid with that person’s personality…”</p><br/><p>Emery was silent, feeling worry in his heart incessantly. Today, Claire was truly extremely radiant. But just as a tall tree attracts the wind, famous people attract too much trouble. That careful and cruel ambassador who would kill a thousand innocents for one guilty was truly a threat to Claire. If the ambassador found out that Claire had become this strong only recently, he would do anything to eliminate her.</p><br/><p>“Yes, your subordinate swears to protect Miss with his life.” The tight clothed man thumped his chest while swearing to protect her.</p><br/><p>“We are on guard; they won’t succeed so easily. But we definitely can’t be careless. Also, right now, Claire is a double classed magic warrior. Cliff over there…” Duke Gordan frowned. He was a unparalleled magician, but his disciple didn’t learn only his magic. Then what would that person think? Gordan’s thoughts were endless.</p><br/><p>“Sir, you do not need to worry. I believe Miss will definitely handle this business well.” Emery consoled Duke Gordan in a low voice. He completely believed that Claire would definitely handle the situation well.</p><br/><p>“Yes, that’s true. If there’s no problem, you may take your leave.” Duke Gordan lightly waved, indicating for everyone to leave.</p><br/><p>“Claire, somebody has come.” Walter suddenly sounded quietly in Claire’s mind. The footsteps outside were different from usual. It definitely wasn’t a servant or that wooden faced knight. Also, Emery, that guy, usually came in through the window. Then who was it?</p><br/><p>Claire didn’t speak. Of course she had already sensed the sounds from outside the door. Jean didn’t do anything, so he recognized the person, and he wouldn’t do anything that could be detrimental to Claire now.</p><br/><p>The person at the door seemed to be pacing back and forth, their footsteps very, very light. It seemed like they were hesitating.</p><br/><p>The room was extremely quiet as the silver moonlight came in through the cracks of the window.</p><br/><p>The person outside the door suddenly stopped and stood there quietly.</p><br/><p>After a long time, words floated gently through the seams of the door. “Thank you. Thank you for saving me today.”</p><br/><p>The next moment, the footsteps hurriedly left, as if they were escaping.</p><br/><p>The voice was Lashia.</p><br/><p>“That little girl actually knows how to express thanks!” Walter’s voice was as loud as if he discovered the New Continent as it howled in Claire’s mind, “Remember, she walks with her nose pointed at the sky!”</p><br/><p>“Sleep.” Claire yawned and lied down on the bed to sleep, without any superfluous words.</p><br/><p>Walter silently blinked, thinking something unknown.</p><br/><p>In the middle of the Temple of Light.</p><br/><p>In a dark room.</p><br/><p>The green haired and strange eyed clairvoyant faced her crystal ball with a frown.</p><br/><p>She still couldn’t read the natal chart of the person the goddess wanted to find.</p><br/><p>If it continued on like this, if we don’t find that person faster, there will be trouble.</p><br/><p>If the person was outside of her range…</p><br/><p>Then the goddess will descend to purge!!!</p><br/>\n</div>"}