{"title": "Chapter 30", "id": 30, "volume": 1, "url": "http://boxnovel.org/stunning-edge-chapter-30", "volume_title": "Volume 1", "body": "<h1>Chapter 30</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 30: A Shocking Start</p><br/><p>Three days later, the ambassador and students from Lagark arrived at the capital and stayed in the capital’s courier hostel, waiting for the “Grand Student Exchange” two days later.</p><br/><p>On this sunny day, Claire leaned against the window sill, looking at the at birds outside in thought.</p><br/><p>“Claire, what are you thinking about?” Walter’s voice suddenly sounded out of thin air beside her. His transparent body hovered around in the room. After Walter told Claire what she wanted to know, as compensation, Emery found some dark attributed crystals that allowed Walter to regain his strength a little. He also used some strange magic, and now Walter could leave the Spiritual Stone a bit farther. He could also hide his aura so that unless he met someone as powerful as the Holy Divine Prince, it would be hard for anyone to discover him. Right now, Walter was much more useful to Claire than a magic puppet because he could find information more easily and accurately.</p><br/><p>Claire turned around and saw Walter beside her. Right now, Walter’s image was transparent, but clearly visible. Walter’s appearance became more defined now that Emery had replenished some of his strength. His appearance and his obscene behavior were complete opposites. Walter… was pretty and delicate, yes, that’s right. He was very pretty, with his soft, black hair, amber eyes, giving everyone the appearance of a scholarly, frail, beautiful boy. But that all changed once he opened his mouth. He constantly pried, wanting to know Claire’s thoughts. The biggest reason that he was so keen on wanting to know what Claire was thinking was because he couldn’t see through this little devil. The dark magician Walter had always prided himself on reading people’s inner thoughts, and then used their weaknesses to achieve his goals. However, these tricks were completely useless on Claire. He couldn’t see through Claire at all, let alone find her weaknesses.</p><br/><p>Walter saw Claire silently watch him and felt a bit scared. This little devil was the most terrifying when she was silent, because you couldn’t tell what she was thinking at all. He felt like he was being stared at by a viper.</p><br/><p>“This time’s Grand Student Exchange between the Institutes doesn’t seem to be so simple. I haven’t seen Master Emery for a whole day and Grandfather also seems really worried.” Claire said in a low tone, frowning slightly. She kept feeling that something was brewing, a bad feeling.</p><br/><p>Walter grew silent. He couldn’t help but acknowledge Claire’s intuition was scarily accurate. It was always spot on.</p><br/><p>“Yes, for this time’s competition, your grandfather said they definitely cannot lose.” After being quiet for a while, Walter finally told Claire what he had heard from concealing his aura and eavesdropping that day.</p><br/><p>Definitely cannot lose?</p><br/><p>“Also, your grandfather said that he won’t let you participate in this competition because he’s afraid you might get hurt.” Walter added.</p><br/><p>Claire froze for a second and then her eyes softened a bit, but so faintly that Walter didn’t even notice.</p><br/><p>The area designated for the competition was the outdoor sports field of the Sunrise Institute. On the uppermost of the audience stands, there were a few special seats, prepared for a few special people. With a red rug on the floor and a valuable wheatgrass cushion on the chair, it was obviously the most cool and comfortable seat during the summer. Soft velvet cushions were not appropriate at this time of the year. On the little table at the side, there was a silver platter full of different kinds of expensive fruits. A smooth, black silk covered the top of this stand, blocking and absorbing the sun’s rays. Behind the seat, two maids stood with fans in their hands, ready to serve the person who would be sitting in this chair.</p><br/><p>And although there were also seats that had coverings on the stands beside this one, there weren’t any servants waiting to serve them or cushions made out of wheatgrass. These were the seats for the ministers and nobility. The rest of the stands were for the students from both countries.</p><br/><p>The flag of Redbuds flew high in the sky, and a disciplined and well-dressed band stood behind the stands. The expression on their faces were serious, and even though the golden tassels on their shoulders fluttered in the wind, they stood perfectly still. The golden long horn was waiting for the emperor to make his appearance to announce the start of the competition. A solemn and serene atmosphere covered the whole field.</p><br/><p>Because of Claire’s background, she sat at the seat closest to the special stand. Jean and the other servants of the nobility stood at the very back of the stands. The two stands on the side were filled rapidly by nobility; some Claire knew, others she didn’t. This was the first time that Claire discovered there were so many nobility in the capital. There were even more here than at the princess’ banquet! Not all nobility could attend a banquet in the palace, but this competition was different; all nobility could come and watch.</p><br/><p>The representatives of the two Institutes walked out. Of course, Lashia was among the representatives of the Sunrise Institute. This shining girl won a round of applause as soon as she appeared; she was the reason they won the competition last time. The last competition had three rounds, with one win on each side when the first two rounds ended. She fought the last match, and she won, along with winning the adoration and pursuit of many people.</p><br/><p>The people cheered and flowers filled the sky, nearly drowning the stage.</p><br/><p>“How boring.” Walter’s impatient voice sounded in Claire’s head. “This time, the Sunrise Institute’s opponents are not easy at all.”</p><br/><p>Claire coldly looked at the students on the other side and her gaze became profound. In this kind of environment, with these kinds of loud cheers, the other side was not even the slightest bit affected. Their expressions were exactly the same as before, and it wasn’t just the contestants either; the other students present were also calm and collected. This time, it seemed like the other side had made preparations and wasn’t going to be so easy to deal with.</p><br/><p>Just as Claire was pondering, a deep and thick trombone blare sounded, the sound reaching the skies.</p><br/><p>The emperor has arrived!</p><br/><p>The emperor was clothed in elaborate but formal clothes. He appeared before the people and got shouts and screams only by waving his hand slightly. The queen was also dressed beautifully, following quietly, noble and elegant. Behind the emperor was an elderly man in a snow white robe. The elder looked serious and dignified. Finally, someone started shouting. It’s the pope! The exalted pope came in person to watch this! Why would this happen? It was only an exchange competition between students, how could it disturb the pope?!</p><br/><p>“Whoa, that old bastard, can’t believe he’s not dead yet.” Walter’s mocking and disgusted voice sounded in Claire’s head. Evidently, the pope whom all the people respected was like shit in Walter’s heart.</p><br/><p>But Claire’s eyes slitted, and she started to feel a bit uneasy. For the student competitions before, at the most a red-robed Cardinal might visit, but this time the pope had come in person. Why?</p><br/><p>From behind the pope came the ambassador of Lagark, a Duke. On the surface, his face looked like fat intestines, but those beady, little eyes that flashed for a moment told Claire that this person, though he looked like a pig, wasn’t as simple as he seemed!</p><br/><p>Sitting on the platform were only a few people: the emperor and empress, the pope, Duke Gordan, and sir Cliff.</p><br/><p>After they sat down, the deep sounding trombones stopped.</p><br/><p>Suddenly, before everybody came back to their senses, there was the sound of multiple wings flapping in the sky. Then the sky darkened, and an unusual wind blew.</p><br/><p>A group of orderly shadows suddenly appeared in the sky. Those black outfits, shiny boots, the golden tassels on their golden epaulets dancing in the wind, their overbearing aura, and the firm expression between their brows – all looked very striking. The mounts underneath them all had the body and claw of a lion, and the head and wings of an eagle.</p><br/><p>The Griffins!!!</p><br/><p>It’s the Griffin Squad of Amparkland! Subjected directly under the emperor, it was a strong and legendary power that only obeyed the command of the emperor. It was the biggest asset of the royal family, the last stable defense, and now they had shockingly appeared in front of everybody.</p><br/><p>The people below started shouting. The ambassador’s expression changed instantly, and he stole a glance at the pope beside him. After seeing the pope expressionless, he let out a breath. After recovering, he looked towards the students of his country who sat on the bleachers beneath. Most of the students’ expressions had changed and they lost their calm attitude from before. His heart, that had just calmed down, rose again. How could he not understand that the appearance of the Griffin Squad was the emperor’s display of power? This time, the results would be hard to predict.</p><br/><p>Claire watched the disciplined Griffin Squad that was in mid-air with great interest. The leader in the front looked somewhat similar to Claire. He was the second eldest brother of Claire, Eric Hill. The powerful Eric, like others, also favored and spoiled the talented and clever Lashia and hated the man-chaser Claire.</p><br/><p>The Griffin Squad disappeared amidst the shouts of the people. There was no reason to keep showing off this mysterious and strong power when the emperor already obtained the effect he wanted.</p><br/><p>“Claire~~~” Suddenly, a quiet, tiny voice pulled Claire back into reality.</p><br/><p>Claire turned her head and saw Princess Maurice, who had a big smile on her face.</p><br/><p>“Your Highness.” Claire smiled and lightly nodded.</p><br/><p>“I haven’t had time to talk to you, but I really like your gift, I love it. Thank you.” Princess Maurice was obviously very happy and thanked Claire multiple times in a low voice.</p><br/><p>Claire smiled. “As long as your Highness likes it.”</p><br/><p>Just when the two were quietly exchanging greetings, the emperor announced the prizes for the winner of this competition. The whole field boiled again.</p><br/><p>A grade nine beast core, a magic wand, and a sword. There was no need to explain the first prize. The magic wand was the precious heritage of a wizard sage, able to do three high level spells instantly and of different elements! The sword was called the Unrivaled Sword. Of course its quality was amazing, cutting through hair and fur alike, slicing through iron as if it was mud. But most importantly, this was a magic sword! With the added ability of Delay! If a person was wounded by this sword, it would make his actions slower. These prizes were really generous!</p><br/><p>But Claire sensed something unusual.</p><br/><p>“Claire, that magic wand isn’t bad, haha, and that grade nine beast core is nice too.” Walter chuckled obscenely in Claire’s head.</p><br/><p>The competition had officially started, needing two out of three rounds to win.</p><br/><p>Lashia was still the last contestant, going against the magician of the other side. The ironic thing was, the opponent of Lashia was the same youth that had lost to Lashia last time. The youth was lying lazily, without giving so much as a glance at Lashia. He had a head of dazzling red hair, impatience written all over his handsome features. He was rolling his eyes while listening to his mentor talking. Claire focused on the lips of the mentor and immediately felt awkward.</p><br/><p>“Yixuan Feng, are you listening?! We lost last time because you ate too much junk food and got diarrhea! You didn’t eat strange things this time, right? Right? Right? Right?” The mentor was looking at his unconcerned disciple, almost worried to death. He desperately wanted a confirmation from the youth.</p><br/><p>Yixuan Feng?! Claire frowned, this was another last name that didn’t seem to come from this continent. Why?</p><br/><p>“Walter!” Claire called silently.</p><br/><p>“What?” Walter answered immediately.</p><br/><p>“Do you remember the last name of the Holy Divine Prince? Lingyun Leng and now one of the students from the other side, Yixuan Feng, why are their last names so strange?” Claire asked.</p><br/>\n</div>"}