{"title": "Chapter 40", "id": 40, "volume": 1, "url": "http://boxnovel.org/stunning-edge-chapter-40", "volume_title": "Volume 1", "body": "<h1>Chapter 40</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 40: Duel</p><br/><p>Naturally, Claire also sensed those unfriendly gazes.</p><br/><p>“Those are students from the Sunrise Institute.” Jean whispered near Claire’s ear in a low voice. “It’s most likely people who didn’t pass the preliminary round for the competition and are not satisfied with Miss’s win.”</p><br/><p>Claire glanced over from the corners of her eyes. Two youths and a young girl were coldly watching her, but when their eyes met they hurriedly looked away.</p><br/><p>“So what if they aren’t satisfied, they didn’t even have the qualifications to be chosen, even worse than your peacock little sister.” Walter disdainfully said. Lashia always walked with her nose pointed at the sky, was that not a peacock?</p><br/><p>“Those three are all warriors.” Jean frowned looking at the three whom had grouped together and seemed like they were discussing something.</p><br/><p>Claire ignored them, put White Emperor on her shoulder, and started searching through the illustrated handbooks: The Complete Magic Beasts illustrated handbook, The Complete Shapeshifters illustrated handbook, and also the Complete Phantoms illustrated handbook.</p><br/><p>Carrying the thick, heavy books was really uncomfortable, so Claire handed all the reference books for Jean to carry and found the nearest table to sit down and started flipping through one.</p><br/><p>Standing behind Claire, Jean watched the three people who had been unfriendly the whole time walk over. The leading young girl had on her back an unusually shaped broadsword and walked towards Claire with a cold expression. The two youths behind also had unfriendly expressions. From time to time their gazes drifted towards the magic sword at Jean’s waist. That was the competition’s prize. After Claire received it, they didn’t expect that she had actually bestowed it to her guardian knight!</p><br/><p>“Claire Hill, I, Alice Roman, will now challenge you to duel!” The young girl’s words powerfully resonated and were exceptionally solemn as she coldly watched Claire.</p><br/><p>When Jean heard this family name he frowned slightly. Was it the daughter of the Roman family? The Roman clan was an aristocratic family in the capital and had many people with courtly positions.</p><br/><p>Duel?!</p><br/><p>There was an uproar among the people nearby and the quiet library was suddenly noisy. For a duel, if the other side was afraid and didn’t accept then it would be extremely humiliating. But, this young girl was obviously a high level warrior. Although Claire was a magic warrior, her cultivation wasn’t that high. Wasn’t this girl’s behavior a little over the top?</p><br/><p>The surrounding people started gossiping, but most people wanted to see Claire’s reaction.</p><br/><p>“No time.” Claire insipidly said, flipped the illustrated handbook on the table and didn’t even give so much of a glance at the young girl. Her indifferent attitude shocked everyone.</p><br/><p>The nearby people watched Claire in amazement and shock. Did she know such a refusal was the greatest insult to the other person? In situations like this, the other person might try to kill her, even at the risk of their life. And such a an uncaring and casual rejection. Was she treating a duel like an invitation for a meal?</p><br/><p>As expected, the young girl called Alice had already turned red in the face. She fiercely clenched her teeth, her heart already flooded with rage. This arrogant male-chaser, thinking of herself as unparalleled after just learning a bit of Dou Qi. If the person who faced Feng Yixuan was her, then that person would have had an even worse loss! Because that day Claire had shown that she was only at the advanced warrior level! If Claire was replaced by her, then that Feng Yixuan would have been beaten up even more unsightly!</p><br/><p>“Do all people from the Hill family have no backbone or real strength? Is that why you don’t accept my challenge?” Alice mocked, sneering as she tried her best to control her anger.</p><br/><p>“At least people from the Hill family are civilized and won’t be like a vixen, shouting and yelling in a quiet library.” Before Claire spoke, a cold voice floated over.</p><br/><p>Another uproar resulted, and looking behind, the crowd saw a cold-faced Lashia icily watching this side. The words just now were said by Lashia. So Lashia had always been in the library, and she saw everything from the moment Claire entered.</p><br/><p>Alice’ face greened and paled. Just now her behavior really was uncivilized. The capital’s library was always a place where capable people gathered. The people who could be borrow books here were not commoners and her actions just now really weren’t appropriate. Naturally, when she came back to her senses, she regretted them. But she still wouldn’t acknowledge her mistake.</p><br/><p>“Genius Lashia, didn’t you also lose very badly. Not only did you almost lose your life, but you almost dishonored our country.” This Alice had disliked Lashia for a long time. What genius magician, magician engaging in close combat with a warrior was the equivalent of certain death.</p><br/><p>Lashia’s expression changed as she was about to explode.</p><br/><p>Claire’s cold voice, although low and gentle, interrupted timely. “How can person who didn’t even pass the preliminary round bark in here? Are you feeling that it’s a pity that we didn’t humiliate our country in the end or are you upset that you weren’t the one onstage humiliating our country?” Claire’s tongue started becoming poisonous. Claire never had any good feelings towards these arrogant aristocrats.</p><br/><p>“You!!!” Alice was furious, abruptly pulling out the sword on her back and pointed it at Claire.</p><br/><p>The library’s mood instantly became tense.</p><br/><p>“Haha.” Claire slowly stood up, a peerlessly brilliant smile radiating from her face, in that instant captivating everyone. But the words Claire said was a different matter. “Little vixen, let’s go, I accept your dual, let’s go out. I don’t want to bother the people here who are reading.” That gentle tone of voice and seductive smile charmed everyone completely, making them lose their senses and overlook her malicious words.</p><br/><p>Truly malicious, Walter thought. Women, don’t mess with them. This was really a gentle knife. This feeling was too “amazing,” like he was going to be butchered but was still helping her clean the knife. So, Walter concluded insightfully, it’s most terrifying when that little devil smiles.</p><br/><p>Claire slowly got up and walked towards the entrance. When she passed by Lashia, a sliver of worry flashed in Lashia’s eyes as she said two words in a quiet and low voice. “Elder sister…”</p><br/><p>Claire looked back slightly, nodded at Lashia, and then walked out.</p><br/><p>Lashia stared blankly, then an imperceptible smile appeared on her face, gentle and faint.</p><br/><p>Claire walked in front with Jean following from behind.</p><br/><p>Alice sheathed the sword onto her back and followed with a face full of anger. The rage in her eyes reached the skies as she hatefully watched Claire, itching to dismember Claire’s body into a thousand pieces. This hateful male-chaser actually called her in that way.</p><br/><p>Lashia also followed from behind. The people at Lashia’s sides were her followers. At the very back was a large mass of people. They all originally came to the library to look up information, but when they heard Claire accepted a duel, they all eagerly ran out to see the excitement.</p><br/><p>Once they saw clearly the person Claire accepted a duel against, they all became shocked. It was Alice Roman. Alice was the Sunrise Institute’s third ranked warrior. At thirteen years of age she is already at the level of a grand warrior, truly making people shocked. Meanwhile, Claire was a magician who had only used advanced warrior level Dou Qi, and her level as a magician had never been tested before.</p><br/><p>Which family would win this contest?</p><br/><p>Quickly, the plaza in front of the library was surrounded by an impenetrable crowd and the number of people continued to grow.</p><br/><p>“I’m delighted you accepted my duel.” Alice sneered, fuming with rage. The pleased expression in her eyes deepened, as if in the next moment, victory was hers.</p><br/><p>“Let’s start.” Claire only insipidly said.</p><br/><p>“Wait.” Alice actually said profoundly, “Isn’t it too boring this way, let’s make a bet.”</p><br/><p>“Oh?” Claire raised her brow slightly.</p><br/><p>“If I win, I want the sword your knight has! If I lose, I’ll give this sword to you.” Alice pulled out the strange sword on her back and fiercely struck it into the ground. Immediately a thin crack appeared on the slate plaza’s ground.</p><br/><p>She wanted Jean’s magic sword?</p><br/>\n</div>"}