{"title": "Chapter 56", "id": 56, "volume": 1, "url": "http://boxnovel.org/stunning-edge-chapter-56", "volume_title": "Volume 1", "body": "<h1>Chapter 56</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 56:</p><br/><p>TL: Youwusali -Yowusali</p><br/><p>Feng Yixuan grasped Claire’s hand tightly, staring at Claire with wide eyes. The next moment, Feng Yixuan covered his eye and crouched down, groaning.</p><br/><p>“Next time you dare to do this, I’ll hit your other eye.” Claire said icily, retracting her fist.</p><br/><p>“Ouch, I was telling the truth.” Feng Yixuan stood up and dropped his hand with a mournful expression, revealing a panda eye. This was Claire’s masterpiece from just then. During the moment when everybody still hadn’t come back to their senses, Claire’s hand was even faster than her thoughts. Pulling her hand out of Feng Yixuan’s tight grasp, she punched Feng Yixuan’s eye socket.</p><br/><p>While Feng Yixuan grimaced with pain, Shui Wenmo watched gleefully at Feng Yixuan’s sorry figure, taking delight at his misfortune.</p><br/><p>“What are you laughing about!” Feng Yixuan vented his heart’s rage onto Shui Wenmo, an icicle flying over.</p><br/><p>But Shui Wenmo was already on guard for a while, pulling out his sword to block and then nimbly deflecting it. The two started fighting noisily again.</p><br/><p>Claire sat down, looked at the girl who was completely covered in blood, thought for a moment, turned around and pulled out a set of her own clean clothes and a set of Jean’s clothes from her travel bag, and threw them at the two people.</p><br/><p>“What are you guys planning on doing next?” Claire asked insipidly.</p><br/><p>“Live while hiding our identities and go to and settle in Yowusali. Find a desolate village and live there for the rest of our lives.” The fallen knight answered like so.</p><br/><p>Yowusali was the most backward country in the entire continent where the Temple of Light’s influence was the least deep.</p><br/><p>“The Temple of Light won’t let you guys go.” Claire said coldly.</p><br/><p>“Yes, I understand. I know the dark side of the Temple of Light that common people don’t know, naturally, they won’t let me go. But even though it’s like this, I’m still not going to wait for them to capture me. I will use all my power to protect her.” The fallen knight looked deeply at the girl sitting beside him. The girl looked deeply at the fallen knight. The two’s hearts were communicated without words.</p><br/><p>“They really are a bitter fated couple.” Walter shrugged and said to Claire.</p><br/><p>“Thank you, benefactors, for saving us today. Thank you.” The fallen knight struggled to get up and bow. “If it weren’t for you, I’m afraid we would have died mysteriously.”</p><br/><p>Claire stopped him. “No need to bow. First, take care of your wounds.”</p><br/><p>“I can’t trouble my benefactors any more. We will cross the border as soon as possible to Yowusali.” The fallen knight said seriously. He understood very deeply that if the holy knights who were chasing after them didn’t return to report, the Temple of Light would soon make new moves.</p><br/><p>“Little girl, come, come.” Cliff beckoned at the girl. “Come, I’ll change your hair and eye color. It should stay for ten years and save a lot of trouble. Take care of yourselves.”</p><br/><p>“Really?” The girl brightened, because her hair color and eye color had always hurt the people around her and she had been betrayed many times. Now that she heard her hair and eye color could be changed for so long, of course she was exceptionally happy.</p><br/><p>“I can. Of course the medicine I make can last for about ten years.” Cliff said haughtily.</p><br/><p>“Thank you, thank you, sir.” The girl happily thanked hurriedly.</p><br/><p>The fallen knight looked at Cliff. He believed everything said by the holy knights. This elder was definitely the wizard sage Cliff. That was why he could easily overpower the five holy knights. But this was already not important.</p><br/><p>Jean silently roasted the wild fare, not giving so much as a glance. Feng Yixuan and Shui Wenmo were still fighting fiercely. Cliff was dying the girl’s hair, the fallen knight watching them gratefully.</p><br/><p>Claire sat down underneath a tree. Looking at the tree trunk, she looked up at the night sky that was getting darker and darker. Lightly touching her right hand’s glove, Claire frowned slightly. There were still many annoying matters: white emperor who was still in deep sleep and the dark mark on the back of her hand.</p><br/><p>Feng Yixuan and Shui Wenmo went farther and farther away, fighting in the middle of the forest. When they were out of Claire and them’s sight, the two stopped. The two crouched down at the same time. Shui Wenmo said, “Was that my hallucination?”</p><br/><p>“At first, I also thought I was hallucinating, but it definitely wasn’t.” Feng Yixuan said certainly.</p><br/><p>“Right, Claire’s flame actually turned gold! What is going on?” Shui Wenmo stroked his chin suspiciously. “I’ve never seen a flame that color. Although it was only for a split second, it definitely changed color.”</p><br/><p>“How do I know. We’ll just inspect it carefully in the future.” After he finished speaking, Feng Yixuan rapidly hit Shui Wenmo’s head and ran.</p><br/><p>“Holy shit, you actually took advantage of the situation to hit me.” Shui Wenmo lept up and started attacking fiercely.</p><br/><p>Feng Yixuan counterattacked and the two started fighting fiercely again as they made their way back to the encampment.</p><br/><p>At night, after everyone finished eating, Feng Yixuan gave his tent to the fallen knight and girl and squeezed into Shui Wenmo’s tent. Claire was lying down calmly in her own tent, looking at the magic lamp hanging from above, thinking back to the Treasured Lotus Style’s mental cultivation method.</p><br/><p>After thinking back over and over, Claire became more and more awake, unable to sleep. So she simply sat in the lotus position and started cultivating the Treasured Lotus Style’s mental cultivation method.</p><br/><p>An indescribable fluidity encompassed Claire’s whole body. Heat flowed through her four limbs and bones, wandering slowly. The slow flow of the heat became faster and faster. The moment Qi infused with her dantian, suddenly, something seemed to emerge in Claire’s mind.</p><br/><p>Suddenly, Claire opened her eyes. She had already finished learning the first level of the Treasured Lotus Style! A light smile appeared on Claire’s lips. This metal cultivation book, even if people from this world could read it, they wouldn’t be able to learn it, because probably nobody from this world knew the acupuncture points written in the book.</p><br/><p>With a slight flick of her finger, a small, golden fireball appeared. It appeared instantly without any incantations.</p><br/><p>“Claire, you, you didn’t seem to have chanted anything. Don’t tell me you can already instacast low level magic? It can’t be.” Walter’s amazed voice sounded. At this age and the high level of it, how could Claire instacast? “Also, why is your flame golden? Today, when you were destroying the corpses, it seemed like your flame was a bit golden. At first, I thought I was hallucinating.” Walter’s voice was filled with confusion.</p><br/><p>“You’ll know in the future.” Claire said perfunctorily. It would be hard to explain. How could she tell Walter that her soul was actually from another world and the language wasn’t the same and the strange book she had gotten from the little thief was a really awesome, rare mental cultivation book?</p><br/><p>Walter whispered. “You can’t say right now? What is going on? Why is the flame you release golden? It seems a bit stronger than other flames. It could even melt those armor so quickly.”</p><br/><p>“Quiet!” Suddenly, Claire’s expression changed drastically because a pain that was as if she was on fire suddenly came from her back.</p><br/><p>“Ah?” Walter was frightened. Seeing Claire’s drastic change in expression, he thought he had annoyed Claire and immediately shut up, but quickly discovered something was off. Slowly, cold sweat appeared on Claire’s forehead. It seemed like she was experiencing something really painful.</p><br/><p>“Claire, what’s wrong with you? Is it something urgent? Was it that tonight when you ate Jean, that jerk’s, hare it wasn’t roasted properly so your stomach hurts?” Walter asked worriedly.</p><br/><p>“My back, there’s something growing!” Claire squeezed out with clenched teeth.</p><br/><p>“What?” Walter was super shocked. Something was growing?! Was she joking? What was going on? Was it that Claire didn’t learn properly and forming things randomly?</p><br/><p>“Look and tell me what’s going on!” Claire turned, rapidly lifting her clothes, exposing her back. The unbearably hot feeling from her back became more and more intense. Something was continuously spreading, spreading……</p><br/><p>Walter reflexively closed his eyes. He had the reflex developed as a habit now; whenever Claire undressed, he would immediately obediently close his eyes or fade away.</p><br/><p>“What is it?” Claire asked angrily.</p><br/><p>“I, I don’t know. I didn’t look.” Walter replied, trembling. “I don’t dare to look. You said before that if I dared to look at your body, you would slaughter me.”</p><br/><p>“I’m letting you look right now!” Claire rebuked angrily. “It’s just looking at my back! If you don’t look right now, I’ll slaughter you immediately.” She didn’t have a large mirror right now. If she did, then would she need to let Walter see what was going on?</p><br/><p>Slowly, Walter opened his eyes, looking at the bright skin of Claire’s back. When he saw it clearly, it was as if his whole body was struck by lightning, unable to think.</p><br/><p>On Claire’s back, a golden lotus bud was blooming. From Claire’s waist, it grew all the way to Claire’s shoulder, golden bright, emitting an indescribable beauty, directly stunning the soul. The golden, huge lotus grew in Claire’s pure white skin as if it was completely natural. In total, there were twelve petals, but out of the twelve, only one had blossomed and the other eleven were tightly folded.</p><br/><p>Walter watched dumbfoundedly, profoundly stunned by the devilishly beauty. He forgot the think, forgot to speak. There was actually something as beautiful as this in the world?!</p><br/><p>“Walter!” Claire shouted angrily, pulling Walter back to reality.</p><br/><p>“Ah, what? Claire, what?” Walter made a mouth-wiping movement. If he had saliva, it would have already dripped onto the ground.</p><br/><p>Currently, Claire already didn’t feel any more pain and put her clothes down, asking angrily, “What on earth did you see? What’s on my back?”</p><br/><p>“A, a golden lotus. There are twelve petals. One flower petal has blossomed, but the other eleven haven’t. So, so pretty. I’ve never seen anything so pretty before.” Walter was still deeply stunned. “But, Claire, how did a lotus grow on your back?”</p><br/><p>Claire was silent, but her mind was working very fast. Golden lotus? Just when she completed the first level of the Treasured Lotus Style, it had appeared on her back.</p><br/>\n</div>"}