{"title": "Chapter 67", "id": 67, "volume": 1, "url": "http://boxnovel.org/stunning-edge-chapter-67", "volume_title": "Volume 1", "body": "<h1>Chapter 67</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 67:</p><br/><p>Without succeeding in one strike, the assassin naturally withdrew immediately, because any moment their identity could be revealed was fatally dangerous.</p><br/><p>The ghost-like figure froze there for a bit. Evidently, they hadn’t thought that even without the commander of the Tempest Warrior Regiment, they would still fail. After standing there for a moment, they were about to leave immediately.</p><br/><p>Reminder: (I had forgotten too oops)</p><br/><p>Claire looked at the person covered in black and coldly humphed. “You want to leave?!” The next moment, numerous golden flameballs flew over. But the next moment, the black clothed person had already disappeared. The corridor had been riddled with holes from the flameball attack, the burnt odor filled the air. Such a large action naturally drew many imperial guards over. Princess Maurice and Katherine had also rushed over.</p><br/><p>“No need to rush, they’ve already run away. It was the assassin from last time.” The second prince was already standing. Looking at the nearby Claire, he said, “Claire, you saved me. Thank you.”</p><br/><p>Claire turned and looked at Nancy. “It was the assassin from last time?”</p><br/><p>“Yes. This assassin’s skills are very high.” Nancy frowned. “Last time, luckily, I had the commander of the Tempest Warrior Regiment by my side. Otherwise, I would have lost my life already. The commander injured the assassin heavily, but also suffered heavy losses. The assassin actually recovered already. If you weren’t here today, I’m afraid he would have succeeded already.”</p><br/><p>Claire fell silent because… she was familiar with the assassin’s figure! She definitely didn’t see wrong! It was him, definitely him.</p><br/><p>“Claire, how did you sense the assassin?” Nancy saw that Claire was in a indescribable mood.</p><br/><p>Claire turned and looked towards the worried Katherine and princess Maurice, ignoring Nancy. Instead, she grasped Katherine’s hand. “Mother, it’s alright now. No need to worry.”</p><br/><p>“How did an assassin secretly get in?” Katherine’s face was a bit pale. She gripped Claire’s hand tightly. “Are you alright? Claire, did you get hurt?”</p><br/><p>“No. Don’t worry, the assassin’s target was his highness, not me.” Claire consoled Katherine. These words were actually pretty disrespectful, but nobody dared to reprimand Claire’s rude words.</p><br/><p>Once again, they went through the formalities, until in the end, Nancy accompanied Claire out the palace.</p><br/><p>Standing at the entrance of the palace, Nancy watched Claire deeply, about to say something. But Claire turned and looked at Nancy and said coldly, “Your highness, I don’t care about royal power struggles, I only hope you don’t involve my mother. If my mother gets in danger, I won’t let it go. Please remember.”</p><br/><p>Nancy froze. His expression changed a little, but he didn’t say a word.</p><br/><p>Jean stood at the side, head lowered, also silent.</p><br/><p>Just as Claire was about to go on the carriage, Nancy quietly called, “Claire……”</p><br/><p>Claire turned and looked coldly at Nancy, her expression without warmth.</p><br/><p>“Thank you for saving me today. Also, I promise, even if I get into deep trouble, I won’t let your mother be involved.” Nancy said, exceptionally serious.</p><br/><p>Once she heard this, Claire stopped for a moment, her expression easing a bit. She said quietly, “I hope your highness remembers the words your highness has said today.”</p><br/><p>“I will remember forever.” Nancy stared at Claire.</p><br/><p>“Yes.” Claire nodded lightly, then turned around to the carriage.</p><br/><p>Jean followed from behind. On the carriage, he abruptly turned to glance at Nancy. Nancy’s gaze was still on Claire.</p><br/><p>The carriage slowly started moving. Claire leaned on the side of the back of the carriage, silent.</p><br/><p>“Miss……” Jean started saying, wanting to say something.</p><br/><p>“To my teacher, Camille’s house.” Claire closed her eyes and said coldly.</p><br/><p>“At such a late time, you want to find your teacher?” Jean asked in confusion.</p><br/><p>“Yes. I have some business with him.” Claire didn’t say any more and closed her eyes.</p><br/><p>There was a flash of confusion in Jean’s eyes, but he didn’t say anything. Instead, he instructed the coachman to go to Camille’s house.</p><br/><p>Camille’s house was at a quiet street. It was a white house surrounded by a white fence that was filled with green vines. Under the dim streetlight, it felt warm.</p><br/><p>The carriage stopped. Claire came out, entered the courtyard, and rang the doorbell.</p><br/><p>Soon, Camille appeared in casual clothes. Camille was still as gentle and refined as before. Such a gentle and considerate handsome man, no wonder many young ladies at the capital were interested.</p><br/><p>“Claire?” Camille seemed to be surprised to see Claire. “What are you doing here so late?”</p><br/><p>“It’s nothing. I just missed teacher, so I came to see you.” Claire showed a harmless smile.</p><br/><p>Walter reflexively shivered. He knew another person had landed in hot water.</p><br/><p>“Really? Then come in.” Camille moved out the way and let Claire in.</p><br/><p>“Jean, wait for me at the carriage. I have some things to talk about with teacher.” Claire turned and said to Jean.</p><br/><p>“Yes, Miss.” Jean turned and went to the carriage.</p><br/><p>An unnoticeable sliver of profoundness flashed through Camille’s eyes, then vanished immediately.</p><br/><p>As Claire and Walter entered, Claire sized up Camille’s house. It was simply, but extremely tasteful. Everywhere, it exuded comfort and harmony. Soft furniture, beige crystal chandeliers, showing how Camille was completely gentle and indoor man.</p><br/><p>“Claire, I never expected the plague at Niya city to be settled so quickly by you. Sit, I’ll make you tea.” Camille went to the coffee table and poured a cup of tea.</p><br/><p>Claire withdrew her gaze. After setting on the sofa for a few moment, and seeing Camille’s figure, her smile became a flower. She said quietly and gently, “I really wouldn’t have thought such a cultured and refined scholar would actually be an unordinarily skilled assassin, actually completely able to hide their aura.”</p><br/><p>Camille’s expression seemed to change a little, but he turned while smiling poured tea for Claire as before. “Claire, what are you talking about? I don’t understand. You should like this tea, it’s scented tea.”</p><br/><p>“Teacher, do you know why I was able to discover you? Your aura was surely completely hidden, but you were discovered by a magician like me.” Claire accepted the tea, gracefully sipped, and smiled faintly.</p><br/><p>Camille didn’t speak, smiling as he sat down. He looked at Claire kindly. “How is the tea?”</p><br/><p>“Very fragrant, I can tell that Teacher is a person who actually values life very much.” Claire set down the elaborate tea cup and leaned on the sofa. “I can also tell that teacher loves himself the most.”</p><br/><p>“What do those words mean?” Camille raised a brow, looking interested.</p><br/><p>“Teacher’s gaze carries nothing within it.” Claire tilted her head and also raised a brow. “Does Teacher really not want to know how I discovered you?”</p><br/><p>Camille cast his gaze low, laughed quietly, then looked up, his face completely cold. “Speak, what do you want to do?”</p><br/><p>“I never would have thought Teacher actually endorsed the crown prince’s faction. I also don’t really want to do anything about it, it’s just that I’ve grasped Teacher’s weakness by the tail. Perhaps when I need to, I might pull on this little tail a bit.” Claire was unmoved. Instead, she smiled brilliantly.</p><br/><p>“What tail!” Unexpectedly, the always elegant and refined Camille suddenly started talking with a foul mouth, glowering at Claire. “What bullshit endorsement, I’ve done this business for many years. The failure last time already made me very depressed, this time I was actually wrecked by you, little girl, my reputation’s gone! My legendary reputation!”</p><br/><p>Claire felt a bit awkward. It turns out Camille was actually a wolf in sheep’s clothing, and was actually a two-faced guy.</p><br/><p>“Teacher, you, you cussed.” Claire was a bit shocked, completely not daring to believe this elegant, refined, considerate, always smiling gently person would cuss.</p><br/><p>“So what if I, your father, cussed? I, your father, wants to choke you to death right now! What did you retardedly go to the palace? Why did you retardedly save the second prince? I, your father, haven’t thought of how you sense my, your father’s presence.” Fiery anger in his eyes, Camille itched it would burn Claire until nothing was left.</p><br/><p>Claire’s mouth twitched, looking at the person before her, who had completely blown their cover. Camille gracefully raised a tea cup and sipped, sitting on the sofa with good posture. His dignified manners would win people’s heart. But no matter how elegant this person’s actions were, the words he spit out would burn and scar people. But he still drank his tea gracefully. He set the teacup down.</p><br/><p>“Talk, you annoying child. How did you sense my, your father’s presence? You even said that my, your father’s, aura was completely hidden. Last time, it was all the commander of the Tempest Warrior Regiment was a lucky bastard, just happened to just have obtained some kind of magic thing that discovered I, your father. You older brother is still wet behind the ears. How did you discover me?” Camille said and then gracefully stood up to pick up the teapot and added more tea into Claire’s tea cup. Then, he set down the teapot and gracefully sat.</p><br/><p>Walter twitched, doubting. Did the guy in front of him have a split personality? Actually able to do one thing, then say the other. Who knew if those upper class ladies and girls who had become infatuated with Camille would be brokenhearted if they saw the true colors of the person they envisioned as a refined, kind scholar.</p><br/><p>“Before I answer, can you answer a question of mine?” Although Claire felt doubt, she still wanted to confirm it herself.</p><br/><p>“If you got any shit to say, say it!” When Camille said such words with a gentle tone, Claire shivered a bit. It felt too strange.</p><br/><p>“Who is your employer?” Claire frowned. “Is it the crown prince?”</p><br/><p>Camille squinted, his eyes becoming slits. His response stunned Claire.</p><br/>\n</div>"}