{"title": "Chapter 64", "id": 64, "volume": 1, "url": "http://boxnovel.org/stunning-edge-chapter-64", "volume_title": "Volume 1", "body": "<h1>Chapter 64</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 64: The Timely Appearance of the God of Darkness</p><br/><p>Claire smiled mockingly. Really, she would have never thought that at the very last moment, it was actually the god of Darkness who came to save her!</p><br/><p>The golden dragon started to shudder slightly. The fear in his heart was continuously expanding, expanding……</p><br/><p>This pressure was a deity.</p><br/><p>Why would a deity descend here?</p><br/><p>Also, it was the most evil, most cruel god, the god of Darkness!</p><br/><p>Naturally, he didn’t think that the god of Darkness descended to find a miniscule, insignificant dragon king like him for some small talk.</p><br/><p>The golden dragon started to go weak at the knees. He wanted to run, but it was as if roots had grown from the bottom of his feet; he was unable to move even the slightest bit.</p><br/><p>The strong pressure made everybody exceptionally uncomfortable.</p><br/><p>And the most weak, Summer, was blue in the face and had already fainted.</p><br/><p>“Withdraw your pressure, I feel uncomfortable!” Claire used all her strength to squeeze out these words.</p><br/><p>The golden dragon’s heart started to palpitate. What was this lowly human doing? So impolite to the god of darkness! Perhaps she wanted to fall into the endless Darkness and suffer for all eternity. Who didn’t know the god of Darkness ways of doing things, who were unaware? Angering him would make one wish they weren’t even born. Out of all the gods, the most terrifying was the god of Darkness.</p><br/><p>But, the next moment, the golden dragon’s mind basically exploded. In the next instant, pressure was gone, but not the pressure for him. The pressure towards the lowly humans were removed! The surrounding Darkness had become much more faint. But the golden dragon still beared with the terrifying pressure.</p><br/><p>Why? What was going on?</p><br/><p>Why would the god of Darkness listen to a trifling lowly human’s words?</p><br/><p>How was it possible?!</p><br/><p>“You four legged reptile, you actually had the delusion of destroying my offering.” Claire was familiar with the deep and evil voice that slowly sounded. The angry tone made one’s heart tremble.</p><br/><p>Offering? The golden dragon looked at Claire fearfully. This human was the god of Darkness’s offering??</p><br/><p>How could it be?</p><br/><p>Everybody besides Feng Yixuan and Cliff also had huge changes in expression. Offering? What did that mean? What offering? Just then, the person the golden dragon wanted to kill was Claire, perhaps Claire was the god of Darkness’s offering?! Such a thing was possible?</p><br/><p>After the god of Darkness undid the pressure on Claire and them, Shui Wenmo quickly went down to Summer’s side, who had already spit blood and passed out, and crouched down, worriedly carrying Summer, resting Summer against his chest.</p><br/><p>“It’s fine, she’ll wake up in a moment.” Cliff went up and inspected Summer.</p><br/><p>Claire exhaled, sat down, and cocked her head, waiting for a good show. In any case, she was safe for sure, very safe.</p><br/><p>“Venerable god of Darkness, I, I didn’t know she was venerable one’s offering. I, I definitely didn’t mean to destroy venerable one’s offering, I swear.” The golden dragon attempted to resist the pressure, stuttering as he spoke. He watched Claire’s relaxed movements incredulously, she actually dared to sit there.</p><br/><p>“Stupid four legged reptile, didn’t the Dragon God teach you any manners?” The sinister voice was incomparably unfeeling, making the golden dragon’s heart palpitate sporadically.</p><br/><p>“Venerable god of Darkness, I, I really didn’t know she was venerable one’s offering. If I knew, I definitely wouldn’t have done it. Please believe me, please forgive my stupid actions.” The golden dragon said cautiously, trembling. He understood the god of Darkness’s temperament very clearly. Perhaps he would give face to the Dragon God and let him live. But, if he angered the god of Darkness, he wouldn’t care for it. If the god of Darkness really killed him, the Dragon God wouldn’t fight to the death for a dragon king that had offended the god of Darkness. At most, the Dragon King would try to please the god of Darkness and then he would find another dragon to be king.</p><br/><p>“Get lost. Next time, if I see you doing anything to my offering, I will make you wish you were dead.” The god of Darkness spit out these words indifferently.</p><br/><p>When the golden dragon heard the god of Darkness’s words, he became ecstatic. The god of Darkness actually let him go! Great! The golden dragon immediately struggled to fly.</p><br/><p>Just as the golden dragon was struggling to fly, the sinister, low voice coldly sneered quietly. Next, the golden dragon felt an intense pain from his tail joint, so painful, he was about to faint. Then his body slanted. When the golden dragon looked back, he was extremely alarmed. His entire tail, including the root, had been cut off. Blood continuously splashed out of the cut wound.</p><br/><p>“Now get lost. This is my lesson to you. Next time, it won’t be resolved so easily.” The god of Darkness sneered disdainfully, voice completely bloodthirsty and arrogant.</p><br/><p>The golden dragon was completely terrified, not even daring to let so much as a fart, hurriedly flapping away as if his life depended on it, not even stanching the blood flow.</p><br/><p>And so the golden dragon ran off in such a miserable manner, not even daring to look back once. The unpleasant sight of blood spilling everywhere was a ghastly sight. He became the first dragon king in history to not have a tail.</p><br/><p>Surprisingly, the god of Darkness didn’t leave immediately. Instead, he let out a terrifying, cruel laugh, then asked mockingly, “You want to find the god of Sprites to undo my mark, right?”</p><br/><p>“Yes. Who would want to wait for death?” Claire said boldly, not hiding anything.</p><br/><p>Everybody’s became worried. Claire actually dared to be so impolite when speaking to the god of Darkness! Although Claire was his offering and he wouldn’t kill Claire currently, that didn’t mean he wouldn’t make Claire suffer. The golden dragon just now was a clear case.</p><br/><p>Contrary to everybody’s expectations, the god of Darkness didn’t do anything to Claire. Instead, he laughed madly, his laugh sounding completely satisfied. “Little thing, you don’t need to go any more. Yesterday, the god of Sprites gambled with me, lost, and promised me something. No matter what happens, he won’t undo my mark. Hahaha……” The sinister voice was completely satisfied. Evidently, the god of Darkness was in a pretty good mood today.</p><br/><p>What? The god of Darkness and the god of Sprites gambled???</p><br/><p>Did they mishear?</p><br/><p>Gods would gamble with each other? And the god of Darkness who represented evil and the god of Sprites who represented purity and disinterest gambled?</p><br/><p>Instantly, everybody thought they had misheard. But, something from the bottom of their hearts told them it was true. No need to struggle, it was true, really true, was true.</p><br/><p>“Grow quickly, my beautiful offering.” The god of Darkness laughed cruelly, then gradually disappeared.</p><br/><p>The surrounding darkness slowly disappeared without a trace.</p><br/><p>Claire’s face darkened as she fell silent.</p><br/><p>“Miss…… What’s going on?” Jean slowly walked over, asking a little hesitantly. Everybody else was also filled with confusion. Feng Yixuan was silent, his expression exceptionally unsightly.</p><br/><p>Claire let out a long breath, then stood up to stretch and said to Shui Wenmo and Jean, “I’ll tell you all in a moment. You two should soak your weapons in this dragon blood. Don’t waste anything. Anything else that can be gathered should be collected into bottles. In the future, good armor will be made and soaked in it.”</p><br/><p>Everybody was struck brilliantly by lightning. At this moment, the first thing that Claire wanted to do was actually this!</p><br/><p>Shui Wenmo and Jean obediently soaked their weapons in the blood. The other people helped collecting the dragon blood. Ben shifted his mouth, standing at the side, not speaking. He looked at the fainted little robber, Summer, from the corner of his eye.</p><br/><p>A moment later, everybody finished and sat down. Jean and Shui Wenmo looked at their weapons that were radiating an ineffable splendor, both happy. Weapons that had gained power from dragon blood would be many times stronger than before. But dragon blood was considered a treasure. Pah, how many people had the capabilities of getting dragon blood? At this moment, Summer started to awaken slowly.</p><br/><p>Claire looked at everyone’s gazes and lightly sighed, knowing what they wanted to ask.</p><br/><p>Claire took off the glove on her right hand and then raised it, showing the strange design of six black stars in a circle.</p><br/><p>Everybody’s expressions changed. They were all unordinary and naturally had heard of what this circle of six black stars represented. But they had the impression that this was only an outlandish legend.</p><br/><p>But they were currently seeing it on Claire’s hand. Also, before, the god of Darkness’s descent meant that it wasn’t a legend, but real.</p><br/><p>“Miss!” Jean looked at Claire with a complicated expression, but unable to say a word.</p><br/><p>Cliff and Feng Yixuan were both silent, their expressions as calm as water.</p><br/><p>“No wonder the god of Darkness would come and save you.” Ben said, suddenly understanding.</p><br/><p>“Doesn’t that mean whenever you face danger the god of Darkness will go and save you?” Summer asked, somewhat awed. If it was like this, wasn’t there nothing Claire could be afraid of?</p><br/><p>“Perhaps.” Claire replied insipidly.</p><br/><p>“Then aren’t you invincible?” Summer started to get excited.</p><br/><p>“No.” Claire smiled strangely.</p><br/><p>“Why?” Summer frowned.</p><br/><p>“Because sooner or later, the god of Darkness with take Claire’s life.” Shui Wenmo lowered his voice and said to Summer quietly, admonishing a little.</p><br/><p>Summer’s expression changed. Now she realized how impudent she was. It wasn’t the time to ask this, but to be worried for Claire’s situation.</p><br/><p>“It’s not because of that.” Claire looked up at the sky, her gaze profound.</p><br/><p>“Then why?” Summer immediately asked.</p><br/><p>Claire didn’t answer right away. Instead she looked up at the sky. Quietly, she said, “The god of Darkness has descended twice, but hasn’t shown his true appearance. But do you think the Temple of Light can’t sense this strong Dark power?”</p><br/><p>That’s right, the Temple of Light!</p><br/><p>Since Claire was the god of Darkness’s offering, then naturally, she was of help to the god of Darkness. Would the Temple of Light let such a person go?</p><br/><p>Of course not!</p><br/><p>Everybody fell silent. Everything that happened today was far greater than they could comprehend.</p><br/><p>“Let’s go. Now that we know finding the god of Sprites is useless, let’s go back.” Claire got up. She saw Little Leopard, who was still trembling behind the tents, and beckoned at it.</p><br/><p>Everybody didn’t speak, all silently following from behind.</p><br/><p>Just as Claire and them reached the border town, they bumped into somebody Claire knew well.</p><br/><p>The Temple of Light’s Holy Prince, Leng Lingyun.</p><br/>\n</div>"}