{"title": "Chapter 72", "id": 72, "volume": 1, "url": "http://boxnovel.org/stunning-edge-chapter-72", "volume_title": "Volume 1", "body": "<h1>Chapter 72</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 72:</p><br/><p>Claire rocked back and forth, not even raising her head, and asked indifferently,“Oh? What is it?” Summer, that little girl, had left with Ben in the early morning. They said they were going to stroll around and buy some tasty things and then come back. Now she had such an excited tone, perhaps she had bought something tasty?</p><br/><p>“Look at this, haha.” Summer quickly rushed up to Claire and pulled out a pearl about the size of an egg and waved it in front of Claire.</p><br/><p>Claire squinted, not caring. She said, “Isn’t this just a pearl? It’s just bigger than other pearls, that’s all.”</p><br/><p>“What’s mysterious isn’t this!” As a thief, Summer had naturally seen many treasures, but now she pulled Claire up excitedly and then ran to her room, leaving Ben and Jean behind.</p><br/><p>“What’s so mysterious?” Claire still held a teacup in her hand as she asked impatiently.</p><br/><p>“Come, just come and you’ll know.” Summer hurriedly dragged Claire into the room, drew the curtains, and closed the door tightly. Now she pulled out the pearl.</p><br/><p>Claire sipped some tea absentmindedly, looking at the pearl. The pearl slowly radiated light in the dim room.</p><br/><p>Bright Moon Pearl? Claire started to become a little shocked.</p><br/><p>Summer looked at the pearl in her hand and said happily, “Awesome, right? The darker it is, the brighter it becomes. At night, it can be used as a light.”</p><br/><p>“Where’d you get it?” Of course Claire didn’t believe that Summer would spend money to buy such an expensive thing.</p><br/><p>Summer put the pearl away and swung her hips, saying cockily, “I grabbed it in passing.”</p><br/><p>“Who was so unlucky?” Claire blurted out.</p><br/><p>“The boss of the Red Light auction house.” Summer said, proud of herself.</p><br/><p>“Pffft~~” Claire spit, spraying gorgeously.</p><br/><p>“That fat guy actually carried around such a good thing.” Summer was still cocky. Summer looked at Claire’s doubting expression and said, “What? What’s so strange about this thing? It is a bit weird though, this is the first time I’ve seen a pearl that can glow in the dark. In the beginning I thought it was just an average pearl.” Summer said to herself.</p><br/><p>Claire started to have a little cold sweat. “Summer, how can you steal like this? Do you know that two days later, the Red Light auction house is going to auction off three one of a kind treasures? One of them is a precious pearl that can radiate light in the night. It can be said that this time the auction is the focus of tens of thousands of people, the tickets hard to get even with a thousand gold.”</p><br/><p>“Haha, then what about the other two?” Summer became interested, questioning closely.</p><br/><p>“There’s still two others that…” Claire thought back.</p><br/><p>What Claire and Summer didn’t know at this point in time was that this precious pearl would give them much danger and fortuitous encounters.</p><br/><p>Claire and Summer discussed together for a very long time. Finally, Claire told Summer, “Remember, the pearl cannot be shown.”</p><br/><p>“Of course, haha. I will safeguard it well.” Summer put away the pearl, and then became excited again as she said, “Can we go see the auction? You definitely have a way. Claire, bring me to see it.”</p><br/><p>Claire looked at the eager looking Summer and started smiling. “Okay. I’ll find my Grandfather to get some tickets to go watch.”</p><br/><p>“Yes, finding your Grandfather is ok. If you said you would find your disgraceful Father, then forget it, I would rather not go.” Summer said, her lip curled.</p><br/><p>“I know.” Claire handed over the cup in her hand to Summer. “Master Emery said before to find him if I have any business. Grandfather made it clear he will satisfy my requests. Getting a few tickets should be easy to Grandfather.”</p><br/><p>“Haha, that’s good.” Summer happily said.</p><br/><p>“Think of a way to deal with the pearl, otherwise if other people recognize it, there’ll be trouble.” Claire thought deeply, stroking her chin.</p><br/><p>“First find sir Cliff to get some of that dye, it’s very well made. No one else can recognize you after, and then we’ll put on a layer of that cheap, shiny powder.” Summer giggled. “I use that kind of method a lot. Everyone else all think it’s a cheap item.</p><br/><p>“Good. In a moment, I’ll first let Jean go find my Grandfather and get some tickets, then find Master.” Speaking of this, Claire’s heart tightened. This was because ever since Cliff came back, he shut himself in the Magician Council and didn’t come out. Cliff wanted to advance into a Sorcerer as soon as possible. That was also for her…</p><br/><p>“In a while, go find Jean, tell him and Ben to help you work, I’ll first go back to my room. Don’t come and bother me. I’m going to be meditating; recently I’ve been slacking off a lot.” Claire thought of how hard Cliff was working. She definitely couldn’t continue ignoring it. Last time, she had already broken through from the second level of the Treasured Lotus Style, so now she should look at the third level.</p><br/><p>“Oh, alright. You should meditate without worry, haha, become a grand wizard quicker, and then wizard sage, then sorcerer, that way I can really walk sideways.” Summer smiled widely.</p><br/><p>Claire laughed helplessly. This girl’s ideal really was…</p><br/><p>Arriving back at her room, Claire put on a magic barrier and pulled out the Treasured Lotus Style. At this moment, Walter said, “Claire, why can you understand the words on the book?”</p><br/><p>Claire didn’t answer and shot back a question instead. “Walter, do you think I’m like an idiotic man-chaser?”</p><br/><p>“It’s not if you seem like it or not, but that you’re basically not one at all.” Walter replied certainly.</p><br/><p>“Then that’s fine. Go and stay over there quietly, don’t bother me.” Claire waved her hand impatiently, indicating for Walter to go away.</p><br/><p>Walter floated over to the side, his brows furrowed tightly, pondering about Claire’s words. Ever since he had been with Claire, he had always heard the surrounding people say she was some kind of man-chaser, idiot, and useless guy. But this little devil was wicked, two-faced, faked kindness, sinister, despicable, and shameless. She was a magic warrior, and currently already advanced into the wizard level, her flames also a strange golden color. Such a person could also be a man-chasing idiot? Was it that Claire had meticulously hid her strength before?</p><br/><p>From the side, Walter was thinking so much his head was about to explode, but still couldn’t think of a reason.</p><br/><p>Meanwhile, Claire was training the lotus flower power nearby and trying infusing it with the book. The words on the book were like ants as they slowly started flowing, the lines intertwining, changing the words. Gradually, the words on the book all turned into the contents of the second level.</p><br/><p>Claire didn’t think much of it and started reading it carefully, frowning while reading. When Claire had accomplished the second level of the Treasured Lotus Style, she had suffered tribulation lightning because she had produced a golden lotus core, which was also that big golden lotus that had suddenly appeared. If she didn’t produce the golden lotus core, then she wouldn’t have suffered tribulation lightning. On the book, it had been written that people who had given birth to a golden lotus heart were very few. The most important point was that the personality of the golden lotus heart would be greatly influenced by the cultivator’s personality. In other words, chickens give birth to chickens, ducks give birth to ducks, and the host’s personality would give birth to type of personality of the golden lotus core.</p><br/><p>Claire looked at this and felt a bit awkward. She asked herself, her personality wasn’t that bad, was it? That time, before the god of Darkness descended, that golden lotus seemed to have cussed some profanity, saying something like f*ck, there’s going to be someone who’ll save you, what do I need to come out for? Waste of time. It was like this, right? In other words, that golden lotus core was something that she had given birth to? Pah! Claire immediately spit. What kinds of words was that?</p><br/><p>“Ma, what are you going pah about? Of course you gave birth to me.” Suddenly during that moment, an abrupt voice sounded in Claire’s mind. Claire was shocked, the book in her hand dropping to the floor. Last time, the situation was too hurried, that’s why she hadn’t heard the voice clearly, but now, she heard it clearly. It was a young but arrogant voice.</p><br/><p>Ma??? Claire opened her mouth wide, and then reached out her hand, silently pointing at her own nose. Are you calling for me?</p><br/><p>“I am calling you.” That young voice snorted, “That vulgar guy called Walter always is stubbornly speaking nonsense with you, that why I wasn’t willing to come out.”</p><br/><p>“Then, can you give me an explanation for what on earth is going on?” Claire asked awkwardly. “Also, can you change how you address me? Even though your birth is perhaps related to me, but, this address doesn’t seem right.”</p><br/><p>“Okay, Ma. Listen to me. The second level of the Treasured Lotus Style is the most crucial point. If at that time I wasn’t born from you, then even if you completely cultivated this arcanum to the tenth level, you still wouldn’t advance to the level of a sorcerer and also wouldn’t be able to comprehend the higher levels of the mental cultivating method.” Golden Lotus’s young voice was exceptionally severe. “Do you remember the twelve flower petals on your back?”</p><br/><p>Claire nodded, and then said helplessly, “Can you not emphasize the matter of your birth?”</p><br/><p>Golden Lotus didn’t hear Claire’s protest, and continued to say, “The moment when you were in danger and comprehended the second level, you gave birth to me smoothly. That’s why the tribulation lightning came. But I don’t care about that little bit of lightning. Only after giving birth to me can you learn the levels past the tenth level, the eleventh and twelfth level. Once that happens, all the flower petals on your back will unfurl.”</p><br/><p>“What kind of existence are you?” Claire asked in confusion.</p><br/><p>“Ma, the question you asked is really stupid, you gave birth to me, so what do you think?” Golden Lotus said somewhat disdainfully.</p><br/><p>“Were you just born?” Claire asked in a bad mood. If this guy was a child, they would definitely be a disobedient child! Not cute at all.</p><br/><p>“That Walter or whatever, looking at him makes me uncomfortable. Ma, get him a body as fast as possible. If he’s here, I’ll only come out if you’re in danger.” Golden Lotus snorted, and then went silent.</p><br/><p>“Golden Lotus? Golden Lotus?” No matter how Claire called, Golden Lotus didn’t respond.</p><br/><p>“Claire, what’s wrong with you?” Walter asked as he floated over, not understanding. “There’s something off with your complexion.”</p><br/><p>Claire looked up and glanced at Walter. Seeing her stare, Walter’s hairs stood on end. He didn’t know how much at a loss Claire was mentally. How could she not be at a loss? Suddenly, another strange thing appeared in her mind, calling her Ma!</p><br/><p>Suddenly, Walter called out in surprise, “Ah, Claire, White Emperor woke up.” seeing White Emperor’s claw, who Claire had put next to the pillow, move slightly.</p><br/>\n</div>"}