{"title": "Chapter 85", "id": 85, "volume": 1, "url": "http://boxnovel.org/stunning-edge-chapter-85", "volume_title": "Volume 1", "body": "<h1>Chapter 85</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 85:</p><br/><p>For the next few days, the group started living extravagantly. If they wanted to eat anything, food would come, if they wanted any particular clothes to wear, they would just reach for it. Content, Summer and Walter were dizzy with delight. Only Qiao Chuxin was anxious. A hundred gold coins per year for working, but she still hadn’t done anything besides living luxuriously. It didn’t seem right.</p><br/><p>On this sunny day, Claire and Jean were currently sparring in the courtyard’s training ground. Seeing it, Ben felt the urge to fight too. Summer and Qiao Chuxin were lying on rocking chairs, bathing while watching Claire and Jean spar. Walter still stayed inside, doing doing his closed cultivation.</p><br/><p>“I want to do it too.” Ben was eager to give it a try.</p><br/><p>“Fight with you? I don’t want to lose an arm or a leg.” Claire refused with a cold snorted. Who didn’t know that dragons were beings with terrifying strength. With one swipe of their claw, they could flatten someone, completely unfair.</p><br/><p>“I’ll control my strength, I’ll be very careful. If you spar with me, you will definitely improve quickly. After all, we’re the best at strength and controlling it too. Come on, come on… I’ll be very careful.” Ben eagerly tried to persuade. He was itching to have a go at it.</p><br/><p>Claire thought about it, then said, “Then you can only use one hand, tie up the other hand.”</p><br/><p>“Fine, fine, fine.” Ben nodded hurriedly, rubbing his palms together expectantly, looking like he wanted to start now.</p><br/><p>Meanwhile, the divine princess and divine prince, Liuxue Qing and Leng Lingyun, arrived together at the same time to visit.</p><br/><p>“Divine prince, divine princess, we’re honored with your presence.” Duke Gordan wasn’t there, so naturally, the person who greeted them was Marquis Roger.</p><br/><p>“It is we who are bothering you.” Liuxue Qing smiled warmly. “We came to find miss Claire.”</p><br/><p>“Find Claire?” Marquis Roger froze. These two well renowned people came specially to find Claire? An ominous feeling arose. He asked immediately, “Is it that the matter with the Roman clan hasn’t been settled properly? Is it that Claire hid information? Is it….”</p><br/><p>“It’s not what you think, my lord. That matter has already been dealt with properly. Claire was the victim.” Leng Lingyun interrupted Marquis Roger indifferently. Leng Lingyun himself didn’t know why, but just seeing the man in front of him hold prejudice against Claire, he felt uncomfortable inwardly.</p><br/><p>Liuxiu Qing’s was the same as before, still smiling gently and elegantly. Nobody noticed the sudden flash of darkness in her eyes.</p><br/><p>“Then I’ll call Claire over to greet you.” Marquis Roger said promptly, calming down.</p><br/><p>Leng Lingyun declined. “No need. Can someone bring us to meet her?”</p><br/><p>“Oh, I’ll bring you there myself.” Marquis Roger got up, wanting to say something, but still brought the two to the training grounds in the courtyard.</p><br/><p>Just as they entered the courtyard, without any warning, they saw Claire’s body fly across the sky like a kite and collide into the training ground’s barrier. Claire spit out blood, then slowly slid off the barrier and passed out.</p><br/><p>The loud bang echoed within everyone’s mind.</p><br/><p>“Claire!”</p><br/><p>“Claire!”</p><br/><p>“Claire!”</p><br/><p>Multiple voices rang out at once.</p><br/><p>Liuxue Qing only felt something flash by before her eyes. It was Leng Lingyun’s figure, already rushing over.</p><br/><p>The barrier was instantly opened. Everybody rushed to Claire’s side at the same time. Jean was the closest and first to arrive. Once everybody rushed forwards, Jean was already holding Claire tightly.</p><br/><p>Ben just froze, standing from afar. He extended his hand and stared at it intensely. It was this hand that had subconsciously hit Claire flying. Claire’s attacks were too crafty and fierce, so much so that in response he hadn’t been able to control his strength.</p><br/><p>Screwed, he was finished!</p><br/><p>Ben twitched his mouth, then also rushed over.</p><br/><p>“Claire, are you alright?” Summer and Qiao Chuxin worried, deep frowns appeared. Claire didn’t respond no matter how they called, however.</p><br/><p>Jean raised Claire, about to go to head inside, but was stopped by Leng Lingyun. “Let me heal her.”</p><br/><p>Only then did everybody come back to their senses and see that the divine prince and princess had arrived at the courtyard without them knowing. Roger stood behind them, his expression complex.</p><br/><p>“Please do and hurry, your highness.” Jean carefully set the unconscious Claire down. The divine prince was an outstanding healer, everybody at the capital knew. Calmness flashed across Jean’s eyes. It was great that the divine prince was there.</p><br/><p>Without a word, Leng Lingyun waved his hand, desperately casting healing magic. White light instantly enveloped Claire’s body.</p><br/><p>Nobody noticed Liuxue Qing’s lips pressing together tighter and tighter, her eyes staring intensely at Claire.</p><br/><p>Gradually, the white light on Claire dissipated. When everybody saw Claire’s face, they all let out a sigh of relief. The originally pale face was currently becoming rosy red again.</p><br/><p>“Her internal organs are damaged. She still needs rest after I’ve healed her.” Leng Lingyun instructed after healing. “She can’t make any extreme movements and needs to rest well.”</p><br/><p>Jean was still frowning after Claire’s color returned. He stood up and bowed towards Leng Lingyun. “Thank you very much, your highness.”</p><br/><p>“It was nothing, really.” Leng Lingyun waved his hand softly, indicating the Jean didn’t need to be courteous.</p><br/><p>“Many thanks, your highness, for extending a helping hand.” Roger said at this moment.</p><br/><p>“It was nothing.” Leng Lingyun said without emotion. “Send Claire to her room to rest.”</p><br/><p>At this time, Claire slowly opened her eyes and saw the group of worried faces.</p><br/><p>Summer and Qiao Chuxin happily shouted when they saw Claire awake, “Claire, you’ve awakened! That’s great!</p><br/><p>“I…” Claire frowned slightly. Her body was still a bit out of sorts. She only remembered Ben’s beserk, powerful attack that had hit her flying.</p><br/><p>Crouching at her side, Leng Lingyun asked Claire, “Do you feel anything wrong anywhere?”</p><br/><p>“Your highness, it was you who healed me?” Claire softly stroked her spine. Good, it didn’t break. The collision just then was really intense.</p><br/><p>“Yes. You should go in and rest now.” Leng Lingyun extended a hand, wanting to support Claire up.</p><br/><p>But Jean quickly reached out and carried Claire. He looked at Leng Lingyun and said, “Many thanks for extending a helping hand, your highness. Protecting Miss is my responsibility, but I’ve failed.”</p><br/><p>Now Claire saw that standing behind Leng Lingyun was Liuxue Qing. “Your highnesses, did you come here to find me?” She asked weakly.</p><br/><p>Just as Liuxue Qing was about to say something, Leng Lingyun spoke first.</p><br/><p>Leng Lingyun nodded. “Yes. But, seeing the situation now, it’s best to wait for you to get better first.”</p><br/><p>“Many thanks for healing me, your highness.” Claire thanked again, a trace of a smile on her lips.</p><br/><p>“No need to be so courteous. You should go inside now.” Leng Lingyun looked up at the brilliant sun rays, indicating that it wasn’t sensible for the heavily injured Claire to stay there.</p><br/><p>The group escorted Jean and Claire back inside. Ben stood there, frozen, fearfully not daring to join. Roger had a complex expression the whole time and also stood there, rooted in place.</p><br/><p>Liuxue Qing watched Lingyun Leng from behind, all sorts of feelings welling up in her heart. Just as she was going to catch up to him, she saw the uncomfortable Ben from the corner of her eye,</p><br/><p>Black clothes, black hair, black eyes, looking otherworldly, so striking. Liuxue Qing frowned slightly, glancing at Ben again. Suddenly, Liuxue Qing felt something off. She was completely unable to see through this black clothed man’s strength! Also, the black clothed man seemed to have an inhuman aura?!</p><br/><p>Her woman’s sixth sense made Liuxue Qing start to become suspicious. Claire’s small pet was the animal that had appeared on the black dragon’s back that day, and now she couldn’t see through this man’s strength at all and he had an inhuman aura. Could it be? Could it be this man was that black dragon?!</p><br/><p>Liuxue Qing suppressed the excitement in her heart and didn’t follow everybody inside. Instead, she hurriedly bid Marquis Roger farewell and then went directly back to the temple. She needed to tell this matter to the pope. Only if the pope saw the black clothed man personally could they tell the man’s true identity. Only the pope had such power!</p><br/><p>As Liuxue Qing hurriedly left Hill mansion, nobody noticed anything unusual.</p><br/><p>Claire was surrounded by a group of people, all worriedly looking at the weak Claire on the bed.</p><br/><p>Ben stood outside the door, his head held low, not daring to enter. From time to time, he would receive some murderous gazes from the bedside.</p><br/><p>“Alright, I’m fine now. There’s no need to blame him.” Claire leaned on the bed post. Naturally, she had seen everybody glare at Ben every so often.</p><br/><p>“He…” Just as Summer was about to say something angrily, she suddenly saw Leng Lingyun there and immediately said angrily, “I already told you he’s so violent. Now look, there’s been an accident. He just can’t control his strength.”</p><br/><p>“Humph! You’re now wounded like this.” Qiao Chuxin angrily turned to look towards the doorway at Ben.</p><br/><p>Ben drooped his head, not saying a word, allowing their attacks.</p><br/><p>Now Leng Lingyun noticed the ashen faced person at the door. The moment he saw him, he was shocked. This man emitted a dangerous aura from his entire body, terrifyingly strong. He seemed to not be human?! That’s how Claire had been so wounded?</p><br/><p>“I’m already much better. Luckily, his highness appeared at the right time.” Claire said gently, smiling.</p><br/><p>“What if the divine prince didn’t appear in time?” Summer retorted angrily.</p><br/><p>“Then I would have just been unconscious for a little longer.” Claire knew it was only because she forced Ben out of control that Ben didn’t control his strength at that moment.</p><br/><p>“Humph.” Summer snorted, in a bad mood.</p><br/><p>“That’s right, your highness, what did you come to find me for?” Claire turned and looked at Leng Lingyun.</p><br/><p>“We should talk another day. You’re so weak today, we’ll talk once you’ve recovered.” Leng Lingyun said quietly.</p><br/><p>“It’s fine, you should know how powerful your healing magic is. I don’t have any big problems now.” Claire smiled.</p><br/><p>Leng Lingyun hesitated, but still told his purpose for coming. “I, I came to ask you about that morning.”</p><br/><p>Claire suddenly understood. She turned to everybody else and said, “You all should leave now, I’m going to speak with his highness privately for a moment.”</p><br/><p>Everybody had worried and unwilling expressions, but left under Claire’s resolute gaze. Once they walked out the door, they saw Marquis Roger was about to go in.</p><br/><p>“My lord, Miss has some matters to speak with the divine prince privately.” Jean stopped Marquis Roger from entering, neither servile nor overbearing.</p><br/><p>Marquis Roger looked at Claire who was leaning on the bedpost and Leng Lingyun sitting at the side. His lips moved, wanting to say something, but in the end, didn’t say a word, turned, and left.</p><br/>\n</div>"}