{"title": "Chapter 91", "id": 91, "volume": 1, "url": "http://boxnovel.org/stunning-edge-chapter-91", "volume_title": "Volume 1", "body": "<h1>Chapter 91</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 91:</p><br/><p>“I swear to live or die with the city!” The city lord said resolutely, also turning to look at the vast sea.</p><br/><p>“My lord!” His two personal bodyguards cried out in alarm, becoming more nervous. “My lord, you’ve already evacuated everybody, how could you stay here by yourself? If resistance is truly futile, then we should withdraw for now.”</p><br/><p>“No need to say anymore. I won’t change my decision!” The city lord stared ahead with unswerving determination at the terrifying sky and high waves, remaining unmoved.</p><br/><p>“Roar……” Suddenly, everybody heard a loud sound that reverberated into the horizon, attracting everybody’s attention.</p><br/><p>“Oh no, my lord, the sea beast is about to attack again. Please withdraw, my lord.” A pitiful, weak magician ran over hastily and advised.</p><br/><p>But the city lord remained unmoved. Instead, he stood on the edge of the city wall, staring straight at the sea beast that was getting closer and closer along with giant, sky reaching waves. “I’ve already made my decision. I will stay with you, there’s no need to try to convince me.”</p><br/><p>“Roar…..”</p><br/><p>“Howl…”</p><br/><p>“Wu…”</p><br/><p>Countless sea beasts were floundering about, gradually approaching as they rode the tide. Waves of sea water slapped onto the wall, arousing fear.</p><br/><p>The city lord frowned. Just as he turned, about to urge Claire’s group to leave, he was shocked to see Claire had already drawn the bowstring of her arrow. The bow didn’t have any arrows, but the girl had drawn back the bowstring fully.</p><br/><p>“Hum….” Everybody heard a long, drawn out, piercing sound. A dazzling bright flame arrow appeared, rapidly flying towards the approaching sea beasts, then exploded. The sea beasts that had been hit all howled painfully, writhing as they submerged into the water.</p><br/><p>Magic arrow!</p><br/><p>The magicians at the city wall were all stunned and the city lord had also frozen. They never would have thought that the ordinary looking girl would actually use magic arrows and had such might. The two personal bodyguards were also frozen with shock.</p><br/><p>But, with only this, there was no way to resist the sea beasts.</p><br/><p>Just when the city lord was frowning and was about to say a few words of thanks then ask them to leave, he was completely shocked by the scene right before his eyes and just stared blankly at the group before him, unable to say a word.</p><br/><p>Usually, Qiao Chuxin was delicate and gentle, but currently, she had no trace of her usual bashfulness, her face completely ice cold, calmly retrieving the bow from her back. A chilling light flashed through her eyes. Without a word, she aimed at the sea beasts. One after another, the sea beasts that had been accurately hit were howling in pain, then squirming as then disappeared into the water without a trace. Surprisingly, Qiao Chuxin’s bow was also an enchanted bow, the arrows shot out actually of lightning attribute! Water could conduct electricity, so it could be inferred how painful the magic beasts that were near the shot ones felt.</p><br/><p>Summer stared at Qiao Chuxin who had suddenly become like a different person, her mouth wide, unable to say a word.</p><br/><p>Ben squinted, then casually cast huge amounts of gorgeous, yet killing magic, often casting it beneath the waves. Every time he cast magic into the water, the water would boil. The sea beasts helplessly submerged into the water to evade, but the more Ben cast, the more interested he became, becoming amused.</p><br/><p>The worn out magicians watched the manner in which Ben cast magic and the frequency, all staring blankly. Instacast! Large range! Without any change in expression or tiredness!</p><br/><p>What kind of level in power was this?!</p><br/><p>Camille smiled seeing the situation before him, gracefully blocking seawater with a parasol from out of nowhere. Everybody had been more or less been splashed by water. Only Camille was as neat as ever.</p><br/><p>Sullenly, Walter didn’t dare to use Dark magic, only daring to cast commonly seen magic for face. With only this, the people at the city wall were already astonished incessantly. A small mercenary group actually had two magicians! And one of them had already surpassed everybody else at the wall! And there were two girls that could use magic bows! Then what class was the other person?</p><br/><p>“Crash…” A huge splash sounded, a tidal wave clashing against the city wall. Just when the giant wave filled with terrifying energy appeared to be about to submerge the girl using fire magic arrows, the nearby young man who looked like a warrior stepped forward. He coldly unsheathed his sword, and with a low grunt, bright violet Dou Qi exploded forth. The giant wave was split apart by the awe inspiring Dou Qi, then evaporated instantly. Not a single drop of water had landed on the girl. The young man, still with a calm expression, withdrew behind the ordinary looking girl.</p><br/><p>Violet Dou Qi?! The two personal bodyguards of the city lord stared at Jean, dumbstruck and frozen for a while. The small, ordinary looking mercenary group actually had such a warrior, a grand swordsman?! What, what was going on!</p><br/><p>The sounds of magic explosions and sea beasts’ long cries intermingled, traveling far and wide, making one who heard alarmed with fear.</p><br/><p>After a long time, Camille started to yawn as he was hoisting the parasol. Finally, there was a long, drawn out hiss from below the wall.</p><br/><p>The sea beasts were retreating!</p><br/><p>The city lord stared at the scene before him, not believing his eyes. The sea beasts retreated just like that? He had already prepared to die with the city, but now the sea beasts were simply retreating?</p><br/><p>The two personal bodyguards were also in disbelief. Now their viewpoint of Claire’s group was completely different. Their original disdain turned into admiration and amazement.</p><br/><p>The magicians were completely exhausted and sat down without care for face. They all looked towards Claire’s group gratefully. If Claire’s group hadn’t arrived in time today, then perhaps the sea would have been their final resting place, especially if not for that terrifyingly powerful black clothed man. He had cast so many powerful spells, yet was completely carefree.</p><br/><p>“We are most grateful for your valuable assistance. It was only thanks to your aid that we were able to repel the crazed magic beasts. As the city lord, I thank you on behalf of Placid Water City’s people.” Tired, yet grateful, the city lord asked exceptionally gratefully, “May we request for your distinguished names?”</p><br/><p>“I am the Yuan Bao Mercenary Corps’s commander, White Little Moon. This is the secondary commander, Camille…” Claire turned and introduced the members. Naturally, she first introduced the secondary commander. As everybody’s gaze landed on Camille, they froze. Camille was still holding the small parasol!</p><br/><p>Camille gracefully put the small parasol away, smiling like the spring wind towards the city lord as he said, “Your lordship, for the Yuan Bao Mercenary Corps to aid Placid Waters is a must. As citizens of this empire, it is our duty to lend a hand whenever we run across dangers in the empire.”</p><br/><p>“Haha, Secondary Commander is truly honorable…” The city lord smiled with a little difficulty. The secondary commander hadn’t even lifted a finger the whole time. Didn’t he only raise a parasol to avoid seawater? Hearing those words, it was really… The eyes of the two personal bodyguards held a sliver of disdain. While Claire introduced all the members of the mercenary group one by one along with the Li siblings, the city lord had been hastily thanking the whole time.</p><br/><p>Claire stood at the edge of the city wall, calmly surveying the seemingly peaceful sea surface. “The sea beasts have only retreated temporarily,” she said quietly.</p><br/><p>“I hope that when the next wave of attacks come, aid will have arrived.” The city lord said, looking serious and worried.</p><br/><p>But Claire just watched the vast sea without a word, like she was contemplating.</p><br/><p>Li Mingyu and Li Yuewen hadn’t made a move the whole time nor said anything. They only exchanged a glance at the end, seeing an indescribable feeling in each other’s eyes.</p><br/><p>“I hope that everybody will agree to this request, if I may be so bold to ask.” The city lord said quietly to Claire, a hint of embarrassment showing through his expression.</p><br/><p>“We will help you hold fast until aid arrives.” Claire said immediately. Of course she knew what the city lord wanted to say. Also, they still had to wait until it calmed down here to go out to sea. Naturally, they couldn’t leave.</p><br/><p>“Then that’s great! May I invite you all to accompany me and rest at my manor?” The city lord said, overjoyed at the turn of events.</p><br/><p>Claire nodded lightly and led everybody to follow the city lord down the wall. Before they descended, Claire looked pensively at the boundless sea. The sounds of sea beasts roaring still came sporadically from the distance. Claire frowned slightly. She didn’t know if she was hearing wrong, but she kept on feeling like the roars carried grief, anger, and also worry.</p><br/><p>Later, Claire and them were provided with warm hospitality by the city lord. Of course, this was limited because the city lord had already dismissed the majority of the people at the city mansion. Preparing the food was the butler who the city lord had not been able to dismiss no matter how hard he had tried.</p><br/><p>Late at night, the sea breeze blew and Placid Waters calmed down. A few residents who had originally unwillingly left their homes returned once they heard the sea beasts had withdrawn.</p><br/><p>Claire stood at end of the corridor, feeling the sea breeze that carried a hint of saltiness, surveying the distance.</p><br/><p>“It’s so late, why haven’t you slept yet? Careful not to catch a cold, Claire.” Camille whispered into Claire’s ear, his voice so gentle one would spew blood listening to how strange it was.</p><br/><p>“You haven’t slept either.” Claire said nonchalantly.</p><br/><p>“You discovered it?” Camille squinted, smiling as he got closer.</p><br/><p>“Yes.” Claire nodded, somewhat amazed at Camille’s sensitivity.</p><br/><p>He had actually discovered it too?</p><br/><p>Camille looked up towards the distance, smiling as gently as every, his voice also incomparably gentle. “Those sea beasts seem to be searching for something.”</p><br/><p>“Yes. I didn’t hear wrong, those sea beasts are very frantic.” Claire leaned on a pillar and said, “Those sea beasts are considered strong in this area. Without any provocations, they won’t attack rashly, not to mention leaving their waters to attack the land.”</p><br/><p>Camille brushed his bangs elegantly, asking gently,</p><br/><p>“But what exactly are those sea beasts looking for?”</p><br/><p>“If we could ask the sea beasts directly, we would know.” Claire said nonchalantly, but at the same time, she was pondering over the problem. What the sea beasts were looking for must be in the city, otherwise the sea beasts wouldn’t crazily attack the city on such a large scale.</p><br/>\n</div>"}