{"title": "Chapter 90", "id": 90, "volume": 1, "url": "http://boxnovel.org/stunning-edge-chapter-90", "volume_title": "Volume 1", "body": "<h1>Chapter 90</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 90:</p><br/><p>“Is it fine to train with us and abandon so many people?” Li Mingyu looked towards the city gates.</p><br/><p>“If I had stayed, then it would have been not fine!” Claire coldly humphed, annoyed. She had actually been ensnared by that old fox! And she had been ensnared before so many people and she couldn’t resist at all. She didn’t understand why the pope wanted to pull her towards the Temple of Light’s side, but one thing was for sure: it definitely could not be that the pope was just impulsive for a moment. Was it related to Leng Lingyun investigating the anomaly from that day? No matter what, leaving the feud behind was good. Being stuck between royal authority and divine right would definitely be uncomfortable.</p><br/><p>The line up of this mercenary group was rarely seen. Claire pretended to be an archer, Summer was a thief, Qiao Chuxin was an actual archer, Jean was a warrior, Walter was a Dark magician, Ben was going to be both a warrior and magician, and Camille was a narcissistic, mad killer. In any case, it was a line up with variety, having all types of classes. On the surface, Li Mingyu and Li Yuewen were their mercenary group’s employer.</p><br/><p>“Little leopard, come.” Claire leisurely reached out and called the wind leopard who was following them from behind. She mounted on him.</p><br/><p>“Ah, you traitor. Didn’t you say you were going to train?” Summer immediately protested. Everybody was walking while Claire, that guy, actually rode a mount.</p><br/><p>“Training not only the body, but also willpower. If you get upset by such a small thing, our secondary commander, Camille, is going to get mad.” Claire said faintly.</p><br/><p>Immediately, Summer felt a cold wind blow strangely from behind her. Turning around, she saw Camille’s warm and gentle smile. Summer shuddered and kept on feeling like this person was very danger, truly dangerous. Summer sensibly stopped talked and rushed over to Claire’s side.</p><br/><p>And so, the small mercenary group peacefully left the capital, heading to the next town. The Azure ripple was pointing towards the Belruk border.</p><br/><p>Claire looked up just as wind blew, lightly blowing her bangs. Everything became clear at once.</p><br/><p>Her new life had started just now.</p><br/><p>The party looked like they were just an ordinary mercenary group. The people that attracted the most attention instead were the Li siblings. Their outstanding appearance and unordinary air attracted many looks. Every time they went to a new place, people couldn’t help but look.</p><br/><p>But today was an exception. Everyone saw many people constantly fleeing frantically from the city gate ahead and were puzzled. The city before them was Amparkland’s third ranked port city, Placid Water, was always prosperous and peaceful, a major trading market. Usually, there was an endless stream of businessmen entering or leaving, but today, they acted like they were being chased by ghosts, like they were wishing they could grow wings and fly away.</p><br/><p>“Ah, wait…” Summer attempted to ask someone, but they turned a deaf ear, running off without a trace will holding a bag of something.</p><br/><p>Li Mingyu and Li Yuewen also wanted to ask the people running by, but they all ignore them, only running like their life depended on it. Carriages were also continuously rushing out, creating cracks on the ground. The entire city was very chaotic!</p><br/><p>“Ben!” Claire called. Ben understood, immediately grabbing a running passerby, directly lifting them up.</p><br/><p>“What are you doing? Let me go!” The person Ben was raising fearfully kicked his legs that were suspended in mid air, shouting angrily.</p><br/><p>“We’ll let you go after you answer a question.” Claire raised a brow.</p><br/><p>“It’s impossible to go out at sea, run for your life quickly. The harbor has already been submerged, there’s a sea beast going crazy and keeps on attacking the harbor! And it’s summoned many other sea beasts. It’s a catastrophe, a huge catastrophe! Run for your life.” The person said everything impatiently at once without Claire asking. “The city lord has called for help, but there hasn’t been any response the whole time. I’m afraid that by the time the people from the Temple of Light come, this place will be completely submerged. Please let me go.” The person felt like the sky was falling, eagerly wishing he could struggle free from Ben’s grasp.</p><br/><p>Claire nodded, Ben threw lightly, and the person was thrown far away. When the he landed, they immediately bounced back up. Not even taking the time to brush off dirt, they hurriedly ran forward. He looked like he was very pleased that Ben had thrown him so far away.</p><br/><p>“Why would the harbor be attacked by sea beasts for no reason?” Li Yuewen frowned, puzzled as she looked towards the chaotic city entrance.</p><br/><p>“We must set out to sea.” Li Mingyu said resolutely, looking towards the city entrance.</p><br/><p>“Then we need to first see what’s going on.” Claire dismounted the wind leopard with the small, exquisite magic bow Cliff had given her and walked towards the city gates, taking the lead.</p><br/><p>Everybody followed closely from behind.</p><br/><p>As they entered the gates, the entire city was in chaos. Shops were being closed hurriedly, many people on the streets ran with big bags and small bags of luggage, hurriedly rushing towards the city gates. Some soldiers were following orders, but unable to stop the frantic residents chaotic fleeing.</p><br/><p>“Where is your city lord?” Jean grabbed a soldier who was painstakingly attempting to mollify residents.</p><br/><p>“Who are you people?” The soldier frowned, annoyed as he saw the impolite person before him.</p><br/><p>“We’re asking you a question, answer it!” A cold light flashed through Li Yuewen’s eyes, instantly showing killing intent, making the solder shiver a little internally.</p><br/><p>The solder immediately answered obediently. “At, at the city wall. He brought magicians to fight against the sea beasts.”</p><br/><p>“Let’s go and see.” Claire said, looking up at the tall city wall far off in the distance.</p><br/><p>Once everybody arrived, the city wall was guarded strictly, soldiers all with solemn expressions. The terrifying sound of tidal waves came from beyond the city wall, the sound of a huge waves splashing on the city wall, making one alarmed with fear.</p><br/><p>“Stop, who are you people?” A person looking like a captain approached, blocking Claire’s group solemnly. “His lordship is currently resisting the crazed sea beast with magicians, normal people may not approach.”</p><br/><p>“We also have magicians and want to lend the city lord a helping hand.” Claire said insipidly. “The more people, the better. Our mercenary group’s magicians are very powerful.”</p><br/><p>The captain watched Claire doubtfully. This ordinary girl didn’t have any defining characteristics, someone you wouldn’t be able to find amidst a crowd. Then he sized up the people behind Claire. Not a single one looked out of the ordinary and didn’t look like they were anything outstanding. The captain hesitated and didn’t say anything.</p><br/><p>“Roar……” Suddenly, an earth shattering, terrifying roar sounded from beyond the city wall, followed by a loud bang. A giant tidal wave smacked the city wall. The city wall seemed to be on the verge of collapsing.</p><br/><p>“Captain, the magic beast became crazy again!” A nearby soldier called out in fear. It was a young soldier and he still looked somewhat childish, his eyes full of terror. Seeing this, the captain’s heart became somewhat complex.</p><br/><p>“Alright. May I ask what mercenary group you are? Just like the said, the more, the better. I hope you can be of aid to my lord and the magicians.” The captain finally moved to let them through.</p><br/><p>“Yuan Bao Mercenary Corps.” Claire said nonchalantly, then led everyone to climb the city wall.</p><br/><p>Yuan Bao Mercenary Corps? The captain blinked, looking skeptically at Claire’s group from behind. What kind of a strange name was this? Never had he heard of this mercenary group before. He hoped they wouldn’t throw away their life in vain. The captain looked up at the overcast sky, praying his in heart, hoping for the military aid to come soon. If it continued like this, the entire city was going to be submerged.</p><br/><p>Once Claire and them had climbed up the wall, they saw it was already only a vast body of water beyond the city. Only a few tall masts were able to be seen, showing that it had previously been a prosperous harbor. A row of people stood on the city wall, already completely soaked with seawater. There was a middle aged man who looked completely serious and frantic with tightly clenched fists as he saw the situation below. At his side stood two warriors grasping their swords tightly, protecting his safety. It was probably the city lord then and the people standing beside him the magicians who were currently battling fiercely. Their wide magic robes had been soaked, making them cut a sorry figure as it stuck to their body. They were all chanting spells quickly to attack, all exhausted and almost unable to bear it.</p><br/><p>Claire moved her gaze forward and saw a creamy white, huge sea beast writhing amidst the waves, roaring. The giant sea beast was no less than three meters high, ten limbs waving crazily in the air. Around it seemed to be many less noteworthy sea beasts also crazily roaring and squirming.</p><br/><p>Why did the sea beast seem like an octopus?</p><br/><p>Claire frowned seeing the situation before her, pondering. Sea beasts, relatively strong beings, basically never attacked the land without reason. Why had such an unusual situation appeared here?</p><br/><p>“Who are you people? It’s not safe here, leave immediately!” The next moment, a dignified yet concerned voice broke Claire’s train of thought.</p><br/><p>Claire turned to see the middle aged man’s solemn yet worried gaze.</p><br/><p>“Are you the city lord?” Claire didn’t withdraw and approached closer instead.</p><br/><p>“Who are you, you’re not allowed to be disrespectful to the city lord!” A warrior beside the middle aged man frowned and shouted. He became alert when he saw Claire get closer.</p><br/><p>“Shut your mouth.” The city lord shouted, frowning and displeased at the bodyguard. Then he turned to Claire and said. “Little girl, this place isn’t for you to come. Leave quickly. If we can’t hold back the sea beasts, then the aftermath will be unthinkable. You should quickly leave with your companions.” The city lord could see with one glance Claire was the group’s leader.</p><br/><p>“We are the Yuan Bao Mercenary Corps. What if you can’t hold back the magic beasts’ attacks?” Claire asked without hurry, squinting to see the not so far away crazily writhing sea beast and waves.</p><br/>\n</div>"}