{"title": "Chapter 95", "id": 95, "volume": 1, "url": "http://boxnovel.org/stunning-edge-chapter-95", "volume_title": "Volume 1", "body": "<h1>Chapter 95</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 95:</p><br/><p>But today, an urgent alarm bell ended the boat’s tranquility.</p><br/><p>It wasn’t a storm coming, but pirates!</p><br/><p>“Enemy attack!”</p><br/><p>“Prepare!”</p><br/><p>“Stand guard!”</p><br/><p>The alarm bell sounded urgently, and there were a string of loud footsteps on deck. Nevertheless, they were orderly.</p><br/><p>These experienced sailors weren’t just seamen, but soldiers of the empire!</p><br/><p>Before Claire and the rest did anything, there were already orderly rows of armed people on deck.</p><br/><p>Claire stood up and walked to the edge of the ship next to the captain and asked the captain solemnly, “Captain, how is the situation?”</p><br/><p>The captain set down the binoculars he was holding, saying seriously, “Commander White, it might be a little troublesome this time. It’s the Red Skull pirates.”</p><br/><p>“Oh?” Claire looked up and concentrated, seeing a few large ships currently approaching rapidly from afar. Each ship’s mast had a black insignia, a sinister red skull embroidered within the insignia.</p><br/><p>“Red Skull pirates, appear and disappear unpredictably, whenever they chance upon a caravan, they will definitely steal everything. All men are killed and all the women are sold as slaves. The empire has sent out many military campaigns, but they have all failed, because the pirates are the best at reading the weather at sea and hiding.” Camille also appeared, gracefully brushing his bangs, showing off how smart he was. “Last year, the empire sent twenty warships, but eight of them were sunk, seven were inflicted with heavy losses, while only one of the Red Skull ships were lightly hit.”</p><br/><p>The captain’s expression was becoming unsightly. The golden haired blue eyed man’s tone was gentle, but the words he said were menacing and to the point. The empire was truly unable to handle the pirates because their captain was an exceptionally powerful magician. Every time they fought, the empire lost.</p><br/><p>“Oh…” Claire seemed to be thinking as she saw that the people ahead were truly unordinary. Then, should they make their move earlier?</p><br/><p>“Duck and cover, prepare to shoot!” the captain ordered. All the sailors found a place for cover and aimed their bow and arrow ahead.</p><br/><p>“Commander White, please find a place for cover too. They are also formidable archers,” the captain explained seriously.</p><br/><p>Claire nodded and indicated for everyone to hide. She wanted to see how capable they were fighting against the empire’s soldiers.</p><br/><p>“Whoosh…” a long, drawn out sound flew through the sky, a sharp arrow piercing the deck.</p><br/><p>They had already started attacking.</p><br/><p>Claire was close behind the staircase as she slowly retrieved her bow, also shooting.</p><br/><p>The magic flame arrow Claire shot instantly exploded on the other boat. They lost their composure for a moment but then calmed down.</p><br/><p>Because they were completely unimpressed by Claire’s accuracy. The flame arrow’s eruption barely had an effect, weak in power and they had magicians defending, so it was not a threat at all.</p><br/><p>“Commander, you’re not skilled enough as an archer.” Camille was standing beside Claire, holding a teapot. He elegantly poured the tea until the teacup was full and handed it to Claire. “Here, Commander, taste the rugosa rose tea that I made specially for you.”</p><br/><p>Claire’s mouth twitched. Indeed, her accuracy was depression. Even shooting a couple of arrows didn’t seem to cause any harm to them at all.</p><br/><p>Claire tooked the cup from Camille gloomily, finishing it in one gulp. Just when she turned to return the cup to Camille, she saw Qiao Chuxin coldly drawing the bow. Currently, there was no warmth in her eyes as she took aim and released the arrow!</p><br/><p>Following the path of the arrow, Claire saw a person’s head struck by Qiao Chuxin’s arrow! The blood splattered everywhere, causing a commotion. Standing beside Qiao Chuxin, Summer gulped. Was this the shy and gentle girl she knew? Why did she seem like a homicidal murderer? And she killed them in such a terrifying manner, making their head explode! Did she not feel she was scary? What kind of a freak did Claire recruit?</p><br/><p>“Chu, Chuxin…” Summer called out weakly.</p><br/><p>“Ah?” Qiao Chuxin came back to her senses, looking at Summer vacantly. Now she was the gentle and bashful girl again.</p><br/><p>“You, you killed someone…… and, and….” Summer wasn’t able finish saying, and you hit them straight in the head!</p><br/><p>“When I shoot, I only focus on the target. I don’t differentiate between humans or beasts,” Qiao Chuxin said profoundly. Her expression was cold, her eyes clear. Summer shuddered, unable to say a word.</p><br/><p>“Very good, Chuxin. Continue.” Claire’s eyes became slits as she leaned leisurely, preparing to rest. Receiving praise, Qiao Chuxin turned and continued to shoot seriously. One arrow after another either landed heads or ran through people’s chests! The people hidden behind the casks were even more miserable, their hearts penetrated by Chuxin.</p><br/><p>“Commander, you still haven’t said how good my rugosa rose tea was yet?” Although Camille’s voice was gentle, his tone and gaze were a bit unpleasant.</p><br/><p>“Oh, very good. Another cup please…” Claire gave Camille a brilliant smile.</p><br/><p>Camille smiled slightly, lifting a teapot, just about to pour tea.</p><br/><p>But right at this moment, they heard a loud rumble, followed by the ship’s hull shaking violently. A huge wave was created!</p><br/><p>“Magic crystal cannon?!” Li Mingyu cried out in alarm, looking incredulously at a cylindrical object sticking out from the pirates’ biggest ship. The pirates actually had such a thing?!</p><br/><p>“The other side is very wealthy.” Li Yuewen’s bad joke wasn’t laughed at by anybody.</p><br/><p>It seems that they were intimidated by Qiao Chuxin’s magic arrows, miscalculating that there would actually be someone like that on board, so they decided to try to end it as fast as possible, using a magic crystal cannon to try and take down the huge, profitable looking ship.</p><br/><p>“Ugh….” Just at this moment, there was an untimely sound of vomiting.</p><br/><p>Everybody looked over at the same time and saw Ben struggling as he crawled out of his hidden away corner.</p><br/><p>“Oh, Ben, did you finish vomiting everything you ate from yesterday?” Claire said casually, brow raised.</p><br/><p>“What, what’s going on? Blargh… Why is the boat rocking more violently?” Ben thumped his chest, trying his best to suppress the sourness of his stomach.</p><br/><p>“We bumped into pirates and then they used a magic crystal cannon at us, so the rocking became more intense, so you vomited more.” Summer said, taking joy in Ben’s unfortunate situation. She had wanted to ridicule the uneducated black dragon for a while now, he had been vomiting the whole day, but Summer hadn’t dared. Now she finally had the chance to say a few sour words, of course she wouldn’t let the chance go!</p><br/><p>The captain looked over, deeply worried. The situation was clearly already very dire, but those people actually were still playing around. It was a magic crystal cannon after all! The pirates actually had a magic crystal cannon, such a powerful, killing weapon! At first, he had hope that the people who had been able to drive away the sea beasts could fight against the pirates, but he never expected them to have a magic crystal cannon! The captain looked at the blue seawater, starting to feel waves of despair. Was he going to die here today?</p><br/><p>“Co, Commander…… blargh…” Ben struggled to stand up straight, staring at Claire, his eyes full of expectation.</p><br/><p>Claire blinked. She looked towards the nearby Camille and said emotionlessly, “Then, venerable Secondary Commander, are all the Red Skull pirates heinous criminals?”</p><br/><p>“Of course, venerable Commander. Each and every one of those pirates’ heads are valued, all on wanted lists.” Camille said firmly.</p><br/><p>“Alright. Ben, I allow you to to dispose of them for the good of the empire, however…” Before Claire finished speaking, Ben roared at the sky, breaking of Claire’s words.</p><br/><p>The resounding roar brimming with power went directly towards the skies, making one’s heart tremble.</p><br/><p>“Roar…. Go die!” Ben flew straight up. With a wave of his hands, a giant, matchless flame ball rapidly attacked towards the pirates’ ships!</p><br/><p>The fire ball filled with power and heat struck the pirates’ ships loudly, the earth shattering explosion deafening. In the blink of an eye, almost half of the giant pirate ships were gone! Along with the loud rumbling sound, there were miserable shouts everywhere from the pirates. The fire spread crazily, making the fringe of the sky red.</p><br/><p>The captain and sailors stopped what they were doing, all dumbstruck seeing the situation before them, unable to say a word. Currently, their minds were completely blank!</p><br/><p>Summer’s eyes widened. She fearfully shifted over to Qiao Chuxin’s side, but looking up, she saw Qiao Chuxin cold face as she was still shooting and taking people’s lives. Summer shuddered, carefully moving towards Claire.</p><br/><p>“Go die! Go die! Actually daring to make my, your father’s, vomiting worse, all go die!” Ben blamed, still casting spells like they were nothing. The pitiful pirates had become the target of Ben’s venting. If the pirates knew that the reason was because they had made the boat rock too much, perhaps they would have all died of depression.</p><br/><p>“Ben, leave some alive. Also, don’t destroy everything……” Claire sighed helplessly. They were burned to this state, how could anyone recognize that they were originally the impressive and famous Red Skull pirates?</p><br/><p>The Red Skull pirates that made people terror stricken were were now a tragic legend.</p><br/><p>Of course, it wouldn’t just end like this.</p><br/><p>The boat fragments flew, the wailing voices ear piercing. If it wasn’t for Claire stopping him, perhaps Ben would have bombarded them until nothing was left. The precious magic crystal cannon was almost destroyed by Ben’s crazy magic.</p><br/><p>Once the Red Skull pirates’ captain was dragged in front of Claire, he couldn’t believe that he had actually been defeated by the ordinary looking, commonplace girl. The terrifyingly strong black clothed man had perhaps destroyed almost all his life’s work, and having experienced the man’s frightening strength, he couldn’t help but admit that they were not the young man’s match. Being defeated by him wasn’t something wrong because the black clothed man was the strongest person they had ever met. But the ordinary looking girl before him was actually the black clothed man’s boss?! The ferocious, strong, terrifying black clothed man actually obeyed orders from her? Obeyed the girl who was clearly weaker than him?</p><br/>\n</div>"}