{"title": "Chapter 189", "id": 189, "volume": 2, "url": "http://boxnovel.org/stunning-edge-chapter-189", "volume_title": "Volume 2", "body": "<h1>Chapter 189</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>As Ian exited the house, he inspected his surroundings. It was peaceful as always. Only then did he start to walk to his destination. Feng Yixuan and Qi Aoshuang waited until he was a distance away before following.</p><br/><p>Ian continued all the way to the village. The simple sandy beach had no spaces to hide, and every few minutes or so, Ian would stop and turn around. Feng Yixuan and Qi Aoshuang had no choice but to stop following him.</p><br/><p>“I will follow him. I have a cloak of invisibility.” Qi Aoshuang brought out a cape from her interspatial ring. Before Feng Yixuan could respond, she put it on and disappeared before his eyes. This was the invisibility cloak that Cliff had gifted her.</p><br/><p>“Don’t worry, the moment I find the location, I will hide, then lead you guys there with one of my magic puppets.” Qi Aoshuang handed Feng Yixuan a small mouse puppet.</p><br/><p>Feng Yixuan hesitated for a moment, but in the end, accepted it. “Then be careful. I will return with everyone else. The moment you discover the location, do not act alone under any circumstances. Wait until we come.” Feng Yixuan continued to strongly warn her. Finally, after Qi Aoshuang promised to not act alone, Feng Yixuan left with the magic puppet.</p><br/><p>Qi Aoshuang quietly followed with the cloak on.</p><br/><p>Ian was very vigilant. He would turn around very often to check that no one was following him before he continued forward.</p><br/><p>At the end of the long stretch of beach were craggy rocks. Ian increased his pace. Qi Aoshuang silently followed with the large rocks as her cover as she watched him.</p><br/><p>He arrived before a large stone and struck it three times with a certain rhythm. Gradually, the stone began to move, revealing a large passageway.</p><br/><p>A person peaked out. When he saw it was Ian, he relaxed.</p><br/><p>“Boss, you’ve arrived.” He withdrew his head.</p><br/><p>“Mm, how is it? Did anything happen today?” Ian walked in, not forgetting to look back one final time. Certain that no one had followed him, he seemed to pull some kind of lever. The large stone once again moved slowly back into place.</p><br/><p>Qi Aoshuang thought for a moment, then spiritually linked to the magic puppet she had given Feng Yixuan. Feng Yixuan had been grasping the puppet anxiously. At this time, the puppet freed itself and dropped to the ground. It started to crawl away.</p><br/><p>“Let’s go. Aoshuang has discovered the location.” Feng Yixuan motioned to everyone else, following the puppet closely.</p><br/><p>Following the puppet, they finally found Claire.</p><br/><p>“Aoshuang,” Feng Yixuan greeted in a low voice.</p><br/><p>“The entrance is behind that giant rock over there.” Qi Aoshuang pointed at it.</p><br/><p>“I’ll move away that rock.” Xi Shaoqi was about to cast magic.</p><br/><p>“No, we still don’t know the circumstances within. Don’t be too eager.” Qi Aoshuang walked up to the large rock and also struck it three times like Ian.</p><br/><p>The stone slowly moved away to reveal the face of the same person as before. His initially suspicious expression gave way to shock as he saw the unfamiliar people. He reached out towards something near him.</p><br/><p>However, Qi Aoshuang moved faster than him. Before he could touch it, a red bead of blood appeared on his neck. He slid silently to the ground.</p><br/><p>The party entered the deep passageway. It was lit with torches on each side. Wind blew from the other end, making the torch fires gently sway. It was strangely eerie.</p><br/><p>“Blood.” Leng Lingyun frowned. The gentle sea breeze entering the passageway carried the faint scent of blood!</p><br/><p>Feng Yixuan frowned. “Perhaps some merfolk are coming of age today.” Everyone’s expression darkened. They knew what his words meant. Coming of age meant cutting off their tails and forcibly growing a pair of legs for the mermaids!</p><br/><p>Qi Aoshuang did not say a word, leading the way. Unexpectedly, the passageway had quite a few traps, but Qi Aoshuang disabled them easily. Seeing this, Xi Shaoqi and Xi Shaosi were shocked. Qi Aoshuang was not only a magician warrior, but knew how to disable traps as well? As Qi Aoshuang disabled the traps, she suddenly thought of someone: Camille, the one who had taught her how to discern and disable traps. How was that person who always elegantly smiled doing these days?</p><br/><p>Perhaps because they were too confident in their own traps, there were only two guards at the end of the passageway. Without batting an eye, they took care of them easily. At the end of the passageway, the scent of blood was even more strong. They could hear cries of pain mixed with the sound of ocean spray.</p><br/><p>Before their eyes appeared to be a huge underground prison. In the middle was a giant pool surrounded by an iron netting so that no merfolk could get out. Inside were countless mermaids swimming! The cavern walls were lined with torches, lighting the prison brightly. The blue tails of the mermaids could be seen slapping the water surface, the sound intermingling with the continuous cries of pain. Hearing their fellow mermaids cry out, the trapped mermaids were angry, but also afraid.</p><br/><p>Each side of the pool was lined with numerous, narrow stone rooms. They were the source of the smell of blood. Because the entire cavern was bustling with activity, no one took note of the extra few people who had appeared at the end of the passageway.</p><br/><p>No one knew that at this time, two other people infiltrated through a passageway.</p><br/><p>Qi Aoshuang walked over the the closest stone room. Inside, a few people were currently surrounding a tabletop in the corner, which a helpless mermaid was strapped to. Her dainty body trembled, her beautiful face pale, her pretty eyes were completely filled with fear. Beside her, a few people forcefully tried to press down her struggling tail. The tabletop was filled with blood stains from the waist down. Meanwhile, a few other mermaids in the room had already fainted. Their long, beautiful hair sheltered their alluring bodies, their tails already gone, replaced with a pair of fair legs, which were stained with blood. Their complexions were incredibly pale.</p><br/><p>“Quick, we still have to do three others,” one of the men holding down the tail said angrily. The man held a sharp knife in one hand, a bottle of green potion in the other. They started to concentrate, not noticing the new people at the doorway.</p><br/><p>“I know already, so annoying. You have to press down more firmly. Just now, it almost swatted away the potion bottle. You guys know how expensive this potion is,” another man said with annoyance. His knife was already positioned at the mermaid’s waist, about to chop down.</p><br/><p>However, the pain the mermaid waited for did not come.</p><br/><p>“Bastard!” Xi Shaoqi and Xi Shaosi yelled angrily. Two giant black beams of light ran through the man holding he dagger at the same time. Blood spurted from his body, splashing onto all the people around him, including the mermaid bound to the tabletop.</p><br/><p>“Who dares?!” The people around the tabletop turned around in alarm to face the people at the doorway. Since when did they come here?</p><br/><p>“You two, take care of this place,” Feng Yixuan said concisely before running off to the other rooms. Leng Lingyun and Qi Aoshuang also split up to save other mermaids. Soon, the cavern was chaotic.</p><br/><p>Qi Aoshuang was angered with each cry of pain she heard from each room. When she arrived before another room and saw the cruel scene, her knuckles cracked from how hard she clenched her fists. A mermaid hung in midair, a cord tied around their neck. One leg was a fair leg, the other covered in scales. Clearly, this mermaid was considered a failure, so they were going to use her body for something else. Her scales would be scraped off to make mermaid wax.</p><br/><p>“Who are you? How…” A man turned around in shock, dagger in hand.</p><br/><p>His response was an an ice cold, sharp blade that pierced through his chest, and was then twisted. After pulverising his heart, the blade was angrily retracted.</p><br/><p>Qi Aoshuang looked up at the mermaid hanging in the air. She had already long stopped breathing, her eyes already empty cavities. Her body still continued to drip blood. Nearby, a transparent bottle contained a pair of green eyes. Qi Aoshuang closed her eyes and took a deep breath, her heart filled with nothing but anger and grief. Humanity…</p><br/><p>At that moment, screams began to erupt around the cavern, but it was not the mermaids this time. It was the deranged humans. Qi Aoshuang stared at the cruel ending of the mermaid, not moving for a long time, her emotions complex.</p><br/><p>At last, Qi Aoshuang left the room with a heavy heart. However, she saw something that shocked her.</p><br/><p>People were fleeing in all directions from the stone rooms, faces filled with terror. However, the next moment, lightning arrows accurately struck their feet, pinning them to the stone rooms. Screams echoed in the entire cavern. The smell of blood thickened.</p><br/><p>Arrows that could flash with lightning? Magic arrows?</p><br/><p>Qi Aoshuang immediately looked for the source of the magic arrows and was shocked to discover a familiar, young female archer.</p><br/><p>Qiao Chuxin!</p><br/>\n</div>"}