{"title": "Chapter 185", "id": 185, "volume": 2, "url": "http://boxnovel.org/stunning-edge-chapter-185", "volume_title": "Volume 2", "body": "<h1>Chapter 185</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Blood dripped onto the ground. In the distance, someone revealed themselves. They were draped in a black cloak. The dagger in their grasp glistened with a blue hue, clearly laced with deadly poison. Currently, he was gasping for breath. His left hand trembled slightly as blood dripped down and then dissolved into the ground.</p><br/><p>“How did you know I was approaching?” the person asked incredulously. The shock in his heart increased. The cloak he was wearing was a rare treasure, able to completely hide his body and aura. How was he able to be discovered? Could it be that this person was already at a profound level?</p><br/><p>“Idiot, you left footprints on the ground,” Feng Yixuan spat disdainfully.</p><br/><p>The person’s mouth gaped. He looked down at the faint yet visible footsteps and wanted to bang his head against one of the pillars.</p><br/><p>In truth, Feng Yixuan had already discovered this person approaching much earlier, he just said this in order to make him feel more miserable.</p><br/><p>The cloaked person disappeared after stepping behind a large stone pillar.</p><br/><p>The skeletons continued streaming out. Xi Shaoqi and Xi Shaosi frowned as they continuously cast magic to shatter the skeletons.</p><br/><p>“Is this all they’ve got? It can’t be,” Xi Shaoqi shattered another skeleton and muttered with annoyance.</p><br/><p>Of course not.</p><br/><p>“Claire Hill! You’re mine,” a boisterous voice came from the sky.</p><br/><p>Everyone looked up to see a few people standing on the tip of the tallest pillar. At the front was a blue haired man draped in black. Behind him was the chicken hair man and the female archer.</p><br/><p>“Who are you?” Xi Shaoqi spat with annoyance.</p><br/><p>“Ant, you are of little value.” The blue haired man smiled malevolently. He watched Qi Aoshuang excitedly. “You are just like they described. You actually killed your own mother. If not for this mission, I would have tried to make you one of my underlings.” He clicked his tongue. “Your mother must have been very unresigned right before her death, haha, killed by her own daughter. Was she crying out, don’t, don’t? Or was she stupid enough to willingly let you kill her?…”</p><br/><p>The blue haired man muttered excitedly to himself, because because he was a deranged freak who had killed his own family. He spoke excitedly, not noticing Qi Aoshuang lower her head and clench her fist until her knuckles were white. She bit her lip until it started to bleed.</p><br/><p>The blue haired man did not notice, instead continuing on to. “I heard your stupid mother was a sacrificial lamb in the fight for the throne between the two princes. You’re pretty damn hilarious. She was going to die anyways. You saved her, but then killed her right after. Are you stupid or something?”</p><br/><p>Feng Yixuan’s expression started to turn ugly. He brandished his broadsword, about to charge forward.</p><br/><p>However, the next moment, a terrifying figure flashed past. Qi Aoshuang was already jumping as fast as lightning, like a demon as she abruptly appeared right before the blue haired man.</p><br/><p>The blue haired man was shocked. He stared at the blacked haired girl’s refined, yet ruthless face. For some reason, he shivered.</p><br/><p>An incomparably sharp yet plain sword suddenly appeared in her hand. It glistened brightly under the sunlight. The blue haired man’s eyes flashed with greed. This sword was definitely unordinary.</p><br/><p>Before he could speak, the sharp tip already slashed him.</p><br/><p>Boom…</p><br/><p>The giant sound echoed into the horizon.</p><br/><p>This one attack split the tallest pillar into two. The people who had stood on top evaded it, running in all directions. Slowly, the giant pillar toppled over, creating a deafening boom. A cloud of dust appeared. In a flash, everything was hazy.</p><br/><p>They also had five people! But Qi Aoshuang only had one target, the blue haired man.</p><br/><p>The people below squinted up to see the blue haired man standing atop a far away pillar with a cold smile. Claire stood atop a different pillar, coldly eyeing the blue haired man.</p><br/><p>The next moment, a shocking scene occurred.</p><br/><p>“Claire Hill, I never expected your life to be worth so much.” It was the same voice. Everyone turned around, but found that the blue haired man was standing atop a pillar behind them, overlooking them with a cold smile.</p><br/><p>“What kind of sword is that? An artifact? Or a sub artifact?” The same voice came from the left on top of a pillar. It was the blue haired man again!</p><br/><p>Illusion?</p><br/><p>“Tch, where are you looking?” The same voice came from a pillar to the right.</p><br/><p>Four blue haired men?! Split bodies or an illusion?</p><br/><p>“Guess which one is the real me. Who ever gets it right gets a prize~” The blue haired man started to laugh. His laughter was particularly provoking.</p><br/><p>Bang…</p><br/><p>Leng Lingyun instantly erected a barrier to block a magic arrow. They were already on the move! Leng Lingyun frowned, his palm started to emit magic.</p><br/><p>Feng Yixuan lifted his sword and slashed at the assassin who had been intending on concealing himself. The assassin rolled out of the way to evade the fatal attack. He finally understood that the red haired youth was not so simple. This time, with the surging yellow sand, there was no way to see footprints. He had sensed him not from his footprints, but because he was truly powerful.</p><br/><p>Xi Shaoqi and Xi Shaosi coordinated well as they attacked the necromancer who was still summoning skeletons. Meanwhile, the bird haired man cautiously remained hidden.</p><br/><p>Qi Aoshuang stood atop a stone pillar. Harsh wind blew past. Her long, black locks fluttered.</p><br/><p>The blue haired man smiled evilly. He started to make strange hand seals, muttering at the same time. The other three blue haired men followed suit.</p><br/><p>“Aoshuang!” After forcing back the strange assassin with one blow, Feng Yixuan focused his attention to Qi Aoshuang’s situation. He frowned, wanting to rush over.</p><br/><p>What happened next left him standing frozen in place, speechless.</p><br/><p>Qi Aoshuang’s body slowly started to emit faint red light that enshrouded her entire body.</p><br/><p>The blue haired man paused slightly. Red Dou Qi? Did such a color of Dou Qi exist? As his gaze met with Qi Aoshuang’s cold eyes, his heart shuddered. Her originally black eyes were now faintly imbued with red light!</p><br/><p>Just as he paused for a moment, something flashed before his eyes. Qi Aoshuang’s cold face was right in front of him. He instinctively tried to step back, but found he couldn’t move! A incorporeal pressure stopped him from any movement.</p><br/><p>Under the sunlight, Qi Alshuang’s blade glinted coldly. She slashed down. It was as if the cold aura of death descended. The blue haired man’s eyes were finally filled with alarm! He could not even remember the countless people he had killed all these years, but he never had felt such a sensation, pressure so powerful, he could not even fight back.</p><br/><p>“No……” the blue haired man said faintly. A bloody sliver started to appear from his forehead. His expression still that of horror, he was split in half along with the pillar! His hands still remained in the same posture, his spell unfinished. Before he even had the chance to attack, he had been killed by Qi Aoshuang.</p><br/><p>“How did the Miss know that was the original body?” Xi Shaoqi asked after the ghastly scene.</p><br/><p>“How do I know?” Shi Shaosi replied humorlessly. Then, he noticed that his opponent had gone pale.</p><br/><p>With a light tap of her foot, Qi Aoshuang leapt from her pillar towards another one of the blue haired men.</p><br/><p>“It’s not an illusion!” Xi Shaosi blurted out with shock. If it were an illusion, after Qi Aoshuang killed the original body, the other illusions would have disappeared. But these other blue haired men were staring at Qi Aoshuang in shock.</p><br/><p>Like a lightning bolt, Qi Aoshuang arrived before another blue haired man. With one sideways slash of her sword, another blue haired man was split in half from the waist. Blood sprayed in mid air, creating an eerily beautiful, bloody arc. Then, the body’s upper half still with wide eyes, the body fell down from the pillar. He could still not believe he had died without being able to resist.</p><br/><p>Qi Aoshuang’s eyes did not have any emotion. She continued to attack towards another blue haired man.</p><br/><p>“Not an illusion! They’re all real!” Xi Shaoqi exclaimed. Quadruplets?</p><br/><p>The assassin that had originally wanted to kill Feng Yixuan was currently secretly withdrawing. The female archer that had been attacking Leng Lingyun was also jumping from pillar to pillar, preparing to escape. It was clear that the blue haired man was their linchpin.</p><br/><p>The bird haired man ran the quickest. His treasure was gone, his fighting power was down by eighty percent, and now their boss had been killed without even the chance to cast magic. When would they run if not now? The bird haired man finally understood why the Rainbow Inkstone had exchanged masters so easily.</p><br/><p>“You can’t escape!” Feng Yixuan leapt up. With one swift slash, his sword ran through not just a pillar, but the assassin behind it, piercing his chest. As Feng Yixuan pulled his sword out, the stone pillar rumbled as it collapsed, crushing the assassin underneath.</p><br/><p>Now that the situation had evolved like so, the end was only certain.</p><br/><p>“Die!” After killing another blue haired man, Qi Aoshuang chased after the running figure of the last blue haired man. With one slash, she cut off his legs. He yelped out in pain, then fell down the pillar. They four brothers were best at pretending to be illusions and using magic at the same time to attack, but now three were gone. He did not have the will to fight any more, only wanting to escape the fearsome girl as soon as possible.</p><br/><p>Qi Aoshuang was like a lithe arrow as she chased him down. She fiercely attacked, ruthlessly stabbing down at the blue haired man’s abdomen.</p><br/><p>His mournful cry echoed into the horizon. It was extremely alarming.</p><br/><p>Qi Aoshuang’s eyes flashed red. She stabbed down viciously again, pinning the blue haired man firmly to the ground. The blue haired man could not even cry out any more, only gasping heavily for breath. Blood bubbled out of the corner of his mouth, dying the yellow sand red.</p><br/><p>“Weren’t you very talkative? Continue speaking!” Qi Aoshuang laughed, pulled out the sword, and then stabbed his abdomen again.</p><br/><p>Nothing remained in his eyes except fear. Lunatic! Madman! Demon! This girl was inhumane! These were the blue haired man’s only thoughts. He wanted to die, but the girl wouldn’t give him a quick death, purposefully avoiding his vitals.</p><br/>\n</div>"}