{"title": "Chapter 187", "id": 187, "volume": 2, "url": "http://boxnovel.org/stunning-edge-chapter-187", "volume_title": "Volume 2", "body": "<h1>Chapter 187</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>“They will definitely send more people after you.” Feng Yixuan frowned.</p><br/><p>“I am their only target,” Qi Aoshuang said faintly.</p><br/><p>“Miss, what are you planning?” Xi Shaosi asked, frowning. “We won’t let you travel alone.”</p><br/><p>“I will go first. You guys just follow a distance behind.” Qi Aoshuang still spoke faintly.</p><br/><p>“Unacceptable!” They all protested at the same time.</p><br/><p>Qi Aoshuang had been waiting for these words.</p><br/><p>“Then you’ll have to drink this gender changing potion.” She pulled out a bottle from her interspatial ring. When everyone saw it, their faces paled. Only then did they realize what Qi Aoshuang’s plan was.</p><br/><p>Indeed, no one would recognize them if they changed their gender!</p><br/><p>“Either leave, or drink this. I won’t force anyone.” Qi Aoshuang had already uncorked the bottle and drank large swig.</p><br/><p>All four handsome men greened…</p><br/><p>They would become four ultra beauties…</p><br/><p>The party of five traveled under the scorching sun until they reached the city of Yower, the first major city they would pass through. Based on Qi Aoshuang’s calculations, it would take them seven to eight days to leave the desert and reach Yowusali’s border.</p><br/><p>The party all wore thick mantles as they slowly advanced towards the city. Feng Yixuan and Leng Lingyun had not exchanged words the entire journey there. Both felt extremely depressed after transforming into women. Meanwhile, White Emperor and Black Feather were hidden in Qi Aoshuang’s cloak. This pair of black and white furballs were too distinctive and would expose Qi Aoshuang’s identity, so they had hide.</p><br/><p>They arrived before an unfrequented inn. Qi Aoshuang asked for five rooms. Once Qi Aoshuang lifted off her hood to reveal her face, everyone gasped. What a stunning youth! From his features and temperament, they knew he was no ordinary person. Were the four behind him his attendants?</p><br/><p>“It’s hellishly hot,” Xi Shaoqi grumbled, also removing his hood.</p><br/><p>Once Xi Shaoqi removed his mantle, everyone froze. It was such a beauty! This beauty was the youth’s attendant? Perhaps a mistress, a few wily individuals surmised. This unknown young master sure knew how to enjoy himself, traveling with such a beauty.</p><br/><p>“Put your hood back on,” Xi Shaosi said coldly.</p><br/><p>“Why?” Xi Shaoqi frowned. “You don’t feel hot?” Xi Shaoqi reached out and pulled down Xi Shaosi’s hood as well.</p><br/><p>The entire hall gasped. Twins?! And such beautiful twins too.</p><br/><p>“You idiot!” Xi Shaosi humphed. Naturally, Xu Shaoqi had completely forgotten he had transformed into a beautiful woman.</p><br/><p>Everyone now eyed Qi Aoshuang with different gazes: admiration, envy, disdain. Such a young man could enjoy the company of two great beauties?</p><br/><p>As Qi Aoshuang noticed the gazes from the corner of her eye, she frowned. Perhaps they shouldn’t have entered the town at the same time to replenish supplies. How could she have forgotten that these people were now peerless beauties who absolutely would not allow any men to look at them with vulgar gazes?</p><br/><p>“Two beauties, why don’t we have a drink together!”</p><br/><p>“You two think that little boy can satisfy you? Why don’t you join us…”</p><br/><p>Xi Shaoqi glowered darkly, about to explode.</p><br/><p>“Stay cool, ignore them,” Leng Lingyun said faintly.</p><br/><p>“Be calm,” Feng Yixuan said a little deviously.</p><br/><p>Qi Aoshuang had an ominous premonition.</p><br/><p>Then, a young waitress came over and smiled at them. “Please do not take offense, customers. These people are simply rude. Please follow me upstairs.”</p><br/><p>Xi Shaoqi’s expression remained dark, but he nodded reluctantly in the end.</p><br/><p>But the next moment, the waitress pulled down Leng Lingyun and Feng Yixuan’s hoods, revealing two absolutely stunning faces.</p><br/><p>“Whoa…”</p><br/><p>The hall exclaimed with gasps.</p><br/><p>The waitress continued to smile. “It is best for guests to take off their mantles to breath better. It is better for your skin.” Behind her back, she signaled to someone in the corner of the room.</p><br/><p>Qi Aoshuang’s gaze darkened. It seemed this waitress had been bribed into doing this. However, she had not ill intentions and was also a woman, so Feng Yixuan and Leng Lingyun were not angered.</p><br/><p>Now, the inn was lively. Four stunning beauties had suddenly appeared, each with their own strengths. The inn owner stood dumbstruck, staring at the beauties.</p><br/><p>“Beautiful lady, have a drink with me?” A well dressed man walked up to Feng Yixuan. He spoke politely, but the perversion in his eyes could not be concealed.</p><br/><p>Xi Shaoqi choked back his laughter so forcefully, he was about to have an internal injury. The insufferably arrogant Feng Yixuan was being hit on for the first time, and by a man!</p><br/><p>“You have good taste.” Leng Lingyun smiled at the ignorant man.</p><br/><p>Feng Yixuan’s expression turned unsightly, whereas Leng Lingyun smiled brightly. He used Feng Yixuan’s words against him: “Be calm.” Xi Shaosi and Xi Shaoqi tried not to smile with great difficulty.</p><br/><p>Now, everyone was certain that these great beauties were not the black haired youth’s mistresses. Four outstanding beauties, and they were all older than the youth! It would not make sense otherwise. And when one of the beauties was hit on, the youth made no protest. Everyone became even more encouraged.</p><br/><p>“Beautiful noble lady, have you fallen into misfortune? I will buy you from your owner with much more money and will not force you to travel under the scorching sun.” The person sitting in the corner of the room walked over and said impatiently to Leng Lingyun. He feared that if he did not make his move sooner, it would be too late. Everyone now viewed Qi Aoshuang as a rich villain!</p><br/><p>Leng Lingyun’s expression darkened.</p><br/><p>“Stay cool,” Feng Yixuan smiled and said faintly. However, his faint smile made him appear even more charming. Everyone was drooling.</p><br/><p>“Beautiful lady, have you also fallen into misfortune? I will rescue you no matter what…” the well dressed man declared hastily.</p><br/><p>“Fuck no!” Feng Yixuan finally couldn’t hold back any more. He shot wind out his palm and instantly sent the well dressed man flying.</p><br/><p>Leng Lingyun was even more angry, magic bursting forth from his palm.</p><br/><p>Xi Shaoqi and Xi Shaosi were stupefied. “Didn’t you guys say to stay cool, be calm?”</p><br/><p>“Fuck being calm!”</p><br/><p>“Only corpses can stay cool*!”</p><br/><p>*cuz normal body temperature is warm</p><br/><p>Feng Yixuan and Leng Lingyun bellowed at the same time.</p><br/><p>Xi Shaoqi and Xi Shaosi’s lips twitched. They shared a glance, both wordless.</p><br/><p>Qi Aoshuang laughed, then said quietly, “I am going to go out and replenish our supplies. I will wait for you all west of the city.” She was certain now that they shouldn’t have entered the city. These femme fatale would cause trouble wherever they went. Even the most cool headed Leng Lingyun could not bear such obscene gazes.</p><br/><p>Qi Aoshuang left the inn alone, sighing in her heart. Her wish to bathe was unfulfilled again.</p><br/><p>Water, food, firewood, clothes. Qi Aoshuang left the pile of goods in the wooden baskets next to the camels. Exposing the existence of the interspatial ring would bring unwanted trouble. She brought them into a secluded alleyway, put everything into the interspatial ring when no one was looking, and then continued to buy things. This repeated many times until she finally finished replenishing all their supplies. Then, she led the camels outside the city gates.</p><br/><p>She continued on west. After walking for a while, she saw a few people were already waiting for her.</p><br/><p>Feng Yixuan and Leng Lingyun stood there as calm as water. Xi Shaoqi and Xi Shaosi looked like they were resisting the urge to smile with great difficulty.</p><br/><p>“Let’s go. In the future, you guys don’t need to go into the city. I’ll just buy things myself.” Qi Aoshuang was also smiling faintly. It must have been the first time they had been hit on by men before.</p><br/><p>The two humphed, but didn’t say anything. They had only berated the people in the inn, not resorting to killing. What they did not know was after this day, their exceptional beauty became renown in Yowusali, so renown that even the emperor of Yowusali knew. Of course, this was later in the future.</p><br/><p>As they continued to journey, they did not run into any more trouble as only Qi Aoshuang would replenish the supplies. They did not run into any members of Black Lightning either. At the border of Yowusali was a relatively flourishing port city. This town was Yowusali’s main source of income. They mainly traded with other countries by ship.</p><br/><p>However, when they arrived, Feng Yixuan stopped them from entering.</p><br/>\n</div>"}