{"title": "Chapter 193", "id": 193, "volume": 2, "url": "http://boxnovel.org/stunning-edge-chapter-193", "volume_title": "Volume 2", "body": "<h1>Chapter 193</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>The entire shrine trembled violently. The king started to pale. It wasn’t an illusion, the shrine was actually shaking. The queen gripped her armrest, face paling, watching the human incredulously. She never imagined that the youth would have such terrifying strength. She finally realized that even if the youth had not saved their brethren, the youth still had the power to forcibly take what he wanted anyways.</p><br/><p>“Benefactor, please stay your hand,” the mermaid king said hastily. He finally understood their true circumstances.</p><br/><p>Qi Aoshuang’s expression remained icy. The mermaid king still had not said he would hand over the God Feather.</p><br/><p>“Benefactor, please stop. It is not that we do not want to hand over the God Feather, but that it is currently not in our possession. A few years ago, it was stolen.” The mermaid king finally could do nothing but reveal the truth.</p><br/><p>What? Qi Aoshuang was shocked. She finally stopped the tremors, eyeing the king coldly as she said, “Who stole it?” Qi Aoshuang finally realized why the mermaid king had not been willing to hand it over. This was the mermaid race’s so called pride?</p><br/><p>“Who stole it?” Qi Aoshuang coldly regarded the unsightly king.</p><br/><p>The mermaid king hesitated, gritting his teeth. Well, he had already lost face anyways.</p><br/><p>“It was another human.” The king’s expression grew more unsightly. “Named Xue Longfei.” He would remember this name even after he died. It was this insolent who had stolen away the relic piece, but he hated this human for something else.</p><br/><p>“All of you, leave.” The queen motioned for the poor mermaid soldiers to withdraw.</p><br/><p>The mermaid soldiers all watched Qi Aoshuang with trepidation as they silently withdrew. In the blink of an eye, only the king, queen, and Qi Aoshuang were left in the shrine.</p><br/><p>“Speak. What happened?” Seeing the king’s clenched teeth, she knew the situation was not simply just that. The relic weapon was stolen by a human?</p><br/><p>“Actually, we are fully aware of the spiritual relic weapon. Unless they are combined, the parts are mere ornaments. We are also sure that the weapon would never be assembled, so we gave the golden tiara to our daughter.” The mermaid’s king now filled with anger. For a moment, he did not speak.</p><br/><p>The queen sighed. “I should tell it instead. One day, our daughter recklessly decided to swim in the open ocean with the tiara, then met a human. That human was Xue Longfei. He took away our daughter along with the golden tiara!”</p><br/><p>“The person stole away your daughter? Did he fall for her good looks?” Qi Aoshuang questioned.</p><br/><p>The king and queen suddenly flushed with embarrassment. After a long time, the two said weakly, “That unfilial daughter, she abandoned us, abandoned our entire race to follow that man! We won’t acknowledge such an unfilial daughter.”</p><br/><p>Qi Aoshuang immediately understood. The human man must have been too charming, that even the mermaid princess could not resist his charms, so she willingly left with the man. It was a cruel joke.</p><br/><p>“Who is Xue Longfei?” Qi Aoshuang raised a brow.</p><br/><p>“One of Swerther’s city lords. Vile, nasty, ugly man. He goes around collecting beautiful women. His city is at an island. The surrounding eighteen islands are all under his jurisdiction.” The queen fumed with anger.</p><br/><p>Qi Aoshuang knew that the queen’s words were not totally true. If Xue Longfei really fit the queen’s description, would the mermaid princess really fall for him and follow him?</p><br/><p>Now that she knew where the relic piece was, there was no need to stay here. Once they found the princess, they would find the relic piece.</p><br/><p>“What does your daughter look like?” Qi Aoshuang asked faintly. “And where is the city?”</p><br/><p>“Her portrait is inside here.” The queen took off a necklace from her neck and walked over to Qi Aoshuang from the throne to show her. “The city is called the City of Unruly. East of here is an archipelago. You will know once you ask.”</p><br/><p>Qi Aoshuang looked and saw a smiling, devastatingly beautiful woman. She wore a small, exquisite tiara. This must be the relic piece. Though the painting was underwater, it remained clear, evidently enchanted with magic.</p><br/><p>To phrase it differently, the mermaid princess had eloped, leaving with the relic piece, not actually stolen away. This was why the king and queen’s attitude was so strange.</p><br/><p>“Mm, got it.” Qi Aoshuang handed the pendent back to the queen, but the queen stopped her. “Benefactor, if you find this unfilial daughter, please give this pendant to her, tell her we have no more relations.”</p><br/><p>Qi Aoshuang looked down at the pendant, then looked at the queen. Her eyes were filled with deep grief. Suddenly, Qi Aoshuang was reminded of Katherine’s final moment, her gently, tenderly smile. She gripped the pendant, then said coldly, “If that is the case, why don’t I kill this unfilial daughter for you?”</p><br/><p>Qi Aoshuang turned, about to propel the aquafission beast forward.</p><br/><p>“Wait!” The queen said frantically.</p><br/><p>“What is it?” Qi Aoshuang stopped, but did not turn around. She continued to say coldly, “Does your highness want me to bring back her corpse? That’s too much of a hassle. You should send people over at the time, I will throw her into the sea for you.”</p><br/><p>“No…” the queen cried out.</p><br/><p>Qi Aoshuang sighed in her heart. Motherly love… Mothers were always worried.</p><br/><p>“No, don’t hurt her.” The queen raced over, face full of worry and grief.</p><br/><p>“Don’t worry, I will bring her back to you save and sound, and am delighted to do so.” Qi Aoshuang said faintly, then left on the aquafission beast. Xue Longfei, what kind of person was he? Even a stately mermaid princess fell in love with him at first sight, then abandoned her parents and clan to live with him on land.</p><br/><p>The queen watched Qi Aoshuang’s leaving figure blankly, vacant for a long time. For some reason, she believed Qi Aoshuang’s words. A thought surfaced: this human would definitely bring back her daughter!</p><br/><p>Qi Aoshuang left the mermaid kingdom unimpeded. Once everyone saw Qi Aoshuang appear at the entrance, they all let out a sigh of relief.</p><br/><p>“Aoshuang, what happened? Did you get the relic piece?” Qiao Chuxin asked quickly.</p><br/><p>Qi Aoshuang let out a sigh. She turned to Dong Fenghou. “Let’s talk after entering Moomoo cow.”</p><br/><p>Dong Fenghou instructed Moomoo cow to swallow them all again. After entering, everyone dismounted from their aquafission beast. Dong Fenghou sent back the aquafission beasts and trumpet beasts. Everyone watched Qi Aoshuang expectantly, waiting for her response.</p><br/><p>“They did not have the relic piece. The mermaid princess has it, but she eloped with a human.” Qi Aoshuang spoke calmly. She showed everyone the pendant. “This is the mermaid princess. We just need to find her to find the relic piece.”</p><br/><p>Eloped?!</p><br/><p>Everyone was shocked, then looked at each other in dismay.</p><br/><p>What kind of person would the mermaid princess elope with?</p><br/><p>“The person she eloped with is called Xue Longfei. The mermaid queen said he is one of Swerther’s city lords, his city located on an island. Let’s go, we need to find him,” Qi Aoshuang said faintly.</p><br/><p>“Xue Longfei?” Leng Lingyun frowned. Though the Temple of Light did not have much influence in Swerther, Leng Lingyun still knew one or two things about this country.</p><br/><p>“Do you know this person?” Feng Yixuan asked.</p><br/><p>“Mm. I’ve heard of him.” Leng Lingyun spoke in a low voice. “This person…” Leng Lingyun frowned. Looking at the pendant that Xi Shaoqi was currently holding, he frowned.</p><br/><p>“What is it?” Qi Aoshuang said.</p><br/><p>“This person is versed in both pen and sword. He is very popular in Swerther. His City of Unruly is thriving under his administration. It is said that…” Leng Lingyun paused hesitantly. “It is said that he is extremely handsome and powerful, but he is a typical playboy. He has a large number of concuncubines and there are still countless women after him.” This description was very different from the queen’s. It seemed the mermaid queen hated humans so much, she deliberately defamed him.</p><br/><p>“Ah, young master Leng, since when did you engage in gossip? Why do you know this so clearly?” Xi Shaoqi asked jokingly. It was very strange that Leng Lingyun knew this.</p><br/><p>“These were written in the Temple of Light records.” Leng Lingyun’s expression changed. That the Temple of Light had bothered to record so extensively on one person showed how much power and influence he must have in Swerther.</p><br/><p>Everyone’s expressions also changed at these words. They all assumed pensive looks.</p><br/><p>A playboy? Even a grand mermaid princess was swayed into leaving, so he was definitely not simple. Xi Shaoqi passed back the pendant to Qi Aoshuang. “This person is definitely no ordinary man. We want to keep the situation as minimal as possible. If our identities are revealed, the Black Lightning will be after us.</p><br/><p>Qi Aoshuang frowned. Exactly how powerful was the organization?</p><br/><p>“Just go to the East, Dong Fenghou,” Qi Aoshuang instructed.</p><br/><p>“Yes,” Dong Fenghou responded, then told Moomoo cow.</p><br/><p>Xue Longfei… Qi Aoshuang’s gaze darkened. What kind of person was he?</p><br/>\n</div>"}