{"title": "Chapter 196", "id": 196, "volume": 2, "url": "http://boxnovel.org/stunning-edge-chapter-196", "volume_title": "Volume 2", "body": "<h1>Chapter 196</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>“Did you finish off the men the Temple and Black Lightning sent?” Xue Longfei looked behind them. Without waiting for anyone’s response, Xue Longfei snapped his fingers. Instantly, fully armored guards appeared in the plaza.</p><br/><p>“Do you have any orders, sire?” Evidently, this guard was trained well, his aura reserved, his posture steady.</p><br/><p>“Go and see if any of the Temple of Light or Black Lightning organization survived,” Xue Longfei ordered indifferently. “If there are, finish them off. Take care of the bodies.”</p><br/><p>“Yes, sir.” The guards left the plaza, not even blinking at the command.</p><br/><p>Xue Longfei beckoned at the girl who had just been chasing Dong Fenghou. She walked over obediently.</p><br/><p>“Go. Tell Qian-er to give me her tiara. Send it to the boat docked at the Eastern pier.” Xue Longfei spoke softly, yet in a manner that could not be questioned.</p><br/><p>“Yes.” The girl nodded, turned, and left speedily. Dong Fenghou watched the girl leave with lingering fears. He was bewildered. Under the girl’s attack, he was unable to focus enough spiritual power to summon magic beasts. The moment he made a spiritual connection, it would be interrupted. Who exactly was she?</p><br/><p>“Go. This is not a good place to talk.” Xue Longfei stood up and led them away.</p><br/><p>Qi Aoshuang followed without hesitation. Everyone else followed suit. Feng Yixuan was quiet, not saying a word.</p><br/><p>He led them to eastern part of the city until they reached the pier. When the bustling people saw Xue Longfei, they all prepared to bow, but Xue Longfei only waved offhandedly. They immediately stopped and continued with what they were doing. Qi Aoshuang was shocked. The loyalty these commoners had towards Xue Longfei was abnormal. Who exactly was Xue Longfei?!</p><br/><p>Naturally, the most luxurious boat docked there was Xue Longfei’s. The moment they saw how elaborately designed it was, they new. Xue Longfei led them without any change in expression. After entering the boat, everyone sat down. Currently, no one was in the mood to admire the boat’s beauty.</p><br/><p>“Feng Yixuan, the son of the president of the Feng Trade Union,” Xue Longfei said after sitting down, pointing at Feng Yixuan. He paused, then looked at Leng Lingyun. “You, the Divine Prince tricked by the witch, Leng Lingyun.”</p><br/><p>Everyone frowned, but did not say anything, all waiting for Xue Longfei to finish speaking.</p><br/><p>“And you, the archer who follows Claire, Qiao Chuxin.” His gaze shifted to Qiao Chuxin. Then he looked at Dong Fenghou. “The summoner who follows Claire.”</p><br/><p>Qi Aoshuang’s expression darkened. Xue Longfei knew everything.</p><br/><p>“And you two are the twin Dark magicians.” Xue Longfei continued, looking at Xi Shaoqi and Xi Shaosi.</p><br/><p>“What are you trying to say?” Xi Shaoqi said unhappily.</p><br/><p>“What do you think? Your disguises can trick normal people, but do you think it can trick the Temple of Light or Black Lightning? Do you really believe you could disappear into a crowd?” Xue Longfei laughed profoundly. “Do you think you look so ordinary?”</p><br/><p>Everyone was silent, their expression unsightly.</p><br/><p>After a long time, Qi Aoshuang let out a sigh. She slowly closed her eyes. She then opened her eyes, her gaze serious.</p><br/><p>“Xi Shaoqi, Xi Shaosi. Return to Yowusali and help Long Sasi. Now.” Qi Aoshuang had an unopposable aura.</p><br/><p>Xi Shaoqi and Xi Shaosi shared a glance, their expressions also serious. They stood up, looking at Qi Aoshuang intensely. “Divine Princess, if it is your command, we will set out immediately.”</p><br/><p>“I command you. Be careful on your way back.” Qi Aoshuang gave a slight nod.</p><br/><p>“Ah, I’ll send men to send you out this ocean area and send back Qian-er at the same time,” Xue Longfei said, pleased with his idea. “The seas here are all under my jurisdiction. No one dares to challenge me here.”</p><br/><p>Qi Aoshuang gave him a nod. “Thank you.”</p><br/><p>“Want to thank me?” Xue Longfei sized up Qi Aoshuang pervertedly. “If you thank me wholeheartedly in five years time, I definitely won’t refuse.”</p><br/><p>Sensing their change in expression, he said hastily, “I was just joking, joking.” The cold gazes told him that his joke was not funny at all!</p><br/><p>“Yixuan…” Suddenly, Qi Aoshuang turned to Feng Yixuan who had been silent. It was the first time Qi Aoshuang called him by his first name.</p><br/><p>Feng Yixuan looked up and was met with Qi Aoshuang’s pitch black eyes.</p><br/><p>The two locked gazes, not saying a word, but understood each other.</p><br/><p>Just as Qi Aoshuang was about to speak, Feng Yixuan said, “Aoshuang, I understand.”</p><br/><p>“Mm. First return. Don’t let Aunt An be hurt.” Qi Aoshuang’s heart settled down.</p><br/><p>“You must return to Yowusali safely.” Feng Yixuan looked at Qi Aoshuang deeply.</p><br/><p>“I will.” Qi Aoshuang revealed a smile, nodding.</p><br/><p>Leng Lingyun’s eyes flashed with loneliness, but it quickly disappeared.</p><br/><p>“Chuxin, Dong Fenghou, we will separate here.” Qi Aoshuang faced them.</p><br/><p>“Why? No, we just met up a short moment ago. I don’t want to leave you!” Qiao Chuxin stood up emotionally.</p><br/><p>Dong Fenghou pulled on her sleeve. “Chuxin, it will be more dangerous if we stay together. The chances of being exposed will be higher. It is better if we split up to find what we’re looking for.” Because Xue Longfei was present, Dong Fenghou did not specify what they were looking for. This, however, piqued his interest. What exactly was Qi Aoshuang looking for?</p><br/><p>“Ah?” Only then did Qiao Chuxin understand. She bit her lip, then said with difficulty, “Then… then we’ll split up. Dong Fenghou and I will help you find the other stuff.”</p><br/><p>Qi Aoshuang froze. She had not planned on Qiao Chuxing and Dong Fenghou endangering themselves for her. Originally, she was going to tell them to continue traveling or return to Yowusali where the Temple of Darkness had influence.</p><br/><p>On deck, there came the sound of footsteps. Xue Longfei looked up at the noise. “You guys can continue talking. I’ll go out first. The tiara must have been sent.” Then he left, leaving them alone.</p><br/><p>“Chuxin and I will look for the beast clan. I understand their language and likes and dislikes. I will definitely get their artifact.” Dong Fenghou had an unusually staunch expression, his tone of voice also difficult to oppose.</p><br/><p>“Right, right. Aoshuang, Donghou and I will help you look for the artifact. If we separate, our identities won’t be exposed so easily. There are archers everywhere.” Qiao Chuxin nodded hurriedly.</p><br/><p>“I…” Seeing Dong Fenghou and Qiao Chuxin’s staunch expressions, she could not say, I am not worthy you endangering yourselves for me…</p><br/><p>“Ok, we’ll do what you said. After we find the beast clan, we’ll find the dwarves.” Qiao Chuxin nodded.</p><br/><p>“There are still artifacts in the hands of the goblins*, the fae, and the dragons,” Leng Lingyun said in a low voice.</p><br/><p>*earth spirits changed to goblins</p><br/><p>When he mentioned the dragons, everyone thought of Ben at the same time. That clumsy dragon, has he avenged himself yet?</p><br/><p>“I will visit the dragon clan with Leng Lingyun. If we find Ben, it will be much easier,” Qi Aoshuang decided. Ben’s strength was evident. Most importantly, he could fly. This would make it much easier for them to act.</p><br/><p>“Good. We’ll do what we planned.” Qiao Chuxin nodded seriously. She gripped Qi Aoshuang’s hand. “Aoshuang, you must be careful.”</p><br/><p>Qi Aoshuang’s eyes flashed with complex emotions. She stole the words right out of her mouth.</p><br/><p>“You must also be careful.” Qi Aoshuang gripped Qiao Chuxin’s hand in turn.</p><br/><p>“Don’t worry, no one will suspect our identity. I will take care of Qiao Chuxin.” Dong Fenghou smiled sheepishly. “Even if we can’t beat them, we can run away.”</p><br/><p>“Tch!” Qiao Chuxin rolled her eyes, dissatisfied with his cowardly words.</p><br/><p>“Run if you can’t beat them. Chuxin, I hope nothing bad happens to you,” Qi Aoshuang said seriously.</p><br/><p>Qiao Chuxin froze, then nodded obediently. “Don’t worry, I won’t be that dumb. I will return alive.”</p><br/><p>“Good.” Qi Aoshuang nodded.</p><br/><p>With everything decided, the atmosphere in the boat grew heavy. No one knew what to say.</p><br/><p>“Everyone, come in.” Xue Longfei’s voice came from outside. The next moment, he came in with a triumphant smile, an exquisite wooden box in hand.</p><br/><p>“Cl- I mean, Qi Aoshuang. This is what you wanted.” Xue Longfei handed over the box. “Don’t worry, I am delighted to send Qian-er back to the mermaids.”</p><br/><p>Qi Aoshuang opened the box. It was the tiara depicted in the pendant. This was a part of the God Feather? Besides looking ornate, she could not tell what was special about it. It did not even emit magic ripples. Perhaps just like the god of Darkness said, by itself, it had no power. Only together would they emit grand, terrifying power.</p><br/><p>“Thank you,” Qi Aoshuang thanked sincerely. No matter what motives he had when doing all this, he had still helped her.</p><br/><p>“If you want to thank me…” Xue Longfei laughed vulgarly. Everyone swiveled to give him an icy stare, stopping him in mid sentence.</p><br/><p>“Please give this to the mermaid princess. Tell her her mother misses her.” Qi Aoshuang handed over the pendant the queen had given her. She was not worried anymore whether or not the mermaid princess would return any more. She had handed over the precious tiara just because Xue Longfei told her too. Clearly, she would listen to anything Xue Longfei said.</p><br/><p>“Alright, no problem.” Xue Longfei put away the pendant.</p><br/><p>And so, everyone departed. Xue Longfei sent men to accompany them on ships. He himself accompanied Qi Aoshuang and Leng Lingyun personally. Before leaving, Feng Yixuan did not say a word, only gazing at Qi Aoshuang intensely. Silent, unspoken words were exchanged.</p><br/>\n</div>"}