{"title": "Chapter 206", "id": 206, "volume": 3, "url": "http://boxnovel.org/stunning-edge-chapter-206", "volume_title": "Volume 3", "body": "<h1>Chapter 206</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>“Let’s go.” Qi Aoshuang felt a little headache seeing Ben so impatient. “Don’t be like Chuxin, unable to differentiate between friend or foe when excited. Make sure you look at who you’re attacking before you attack.”</p><br/><p>“I know, I know. How could I make that kind of mistake?” Ben excitedly ran forward. Qi Aoshuang shook her head, materializing her wings and following. Leng Lingyun also started to fly. With a wave of his finger, a mighty wind enveloped Oscar and he too started to fly gracefully, following them.</p><br/><p>Ahead of them, Ben suddenly halted. Behind him, Qi Aoshuang and Leng Lingyun also stopped, not understanding what Ben was doing.</p><br/><p>“How can I just beat them up randomly, that doesn’t seem very fair,” Ben muttered.</p><br/><p>Ah? Qi Aoshuang and Leng Lingyun gawked at Ben. What was he saying?</p><br/><p>The next moment, they understood what Ben wanted to do.</p><br/><p>Shameless! So shameless it was hair raising!</p><br/><p>Ben asked Qi Aoshuang for a mantle, draping it on, covering his entire body. Then, he pulled the black cloth as high as possible, only exposing his pair of pitch black eyes and black hair, then crouched down, reducing his height. He ran forward sneakily. At a first glance, with this height and their body hidden with the mantle, they really could not tell his gender. Ben already was aware of how the Temple of Light “treasured” girls with black hair and black eyes. He also knew that Qi Aoshuang’s true appearance was with black hair and black eyes.</p><br/><p>However, Oscar did not know.</p><br/><p>So when Oscar witnessed this scene, he almost fell from the sky! That was the dragon king? Really the leader of the venerable dragon clan? Was he pretending to be a woman? Why? Exactly why? Why on earth? Oscar had a thousand questions, but none of them could be answered.</p><br/><p>Leng Lingyun watched Ben blankly, then shared a glance with Qi Aoshuang.</p><br/><p>Qi Aoshuang shrugged and said innocently, “I swear, I never taught him this.”</p><br/><p>Oscar could tell from QI AOshuang and Leng Lingyun’s interaction that they knew what Ben was going to do, but his pride would not allow him to ask. He simply followed at a distance silently.</p><br/><p>“Just wait a moment.” Ben shuffled forward quickly. His strange posture was extremely suspicious.</p><br/><p>Indeed, it was rude to strike without notice. However, if they attacked first and Ben “defended” himself, it would be different.</p><br/><p>Qi Aoshuang and the rest followed at a distance, watching Ben shuffle forward.</p><br/><p>As expected, a number of people were camped at the opening of the ravine. They didn’t not appear to only be members of the Temple of Light. Black Lightning?</p><br/><p>Of course, when they saw Ben so suspicious, they surrounded him immediately.</p><br/><p>Black hair, black eyes! And coming out of Dragon Valley! It was a match to Claire’s description.</p><br/><p>“Halt!” a voice said coldly.</p><br/><p>Ben acted as if he didn’t hear. He was hoping they would stop him!</p><br/><p>But, as a true and blue disciple of Qi Aoshuang, Ben naturally did not stop. Instead, he humphed and increased his speed. They were now even more suspicious of him now. Some even said confidently, “It’s Claire Hill!”</p><br/><p>“It’s not her,” an old man with white hairs inside one of the tents said. He regarded Ben coldly. The Temple of Light had gone out of their way to specially invite this man. He wore ordinary clothing of clergymen, but was clearly of unordinary strength. If Ben had not received the inheritance of Dragon King, the old man would have been able to immediately perceive he did not have a human aura and stopped any of the Temple’s men from acting. However, Ben was exceedingly powerful, concealing his aura perfectly. The Temple also would kill a thousand innocents to kill one guilty. Although the old man said Ben was not the person they were looking for, he would not stop the underlings from taking action. Thus, the current situation.</p><br/><p>Magic flames blossomed around Ben. He had never thought flame magic could be so beautiful until now. He grinned from ear to ear. Dragons could not attack humans, especially in human establishments, but right now, they were in his territory, and they attacked first!</p><br/><p>“Petty humans, you dare to attack me, a noble dragon!” Ben tore off his mask and mantle and howled at the sky. At the same time, he released dragon pressure, causing the Temple’s men to green. Their internal organs were getting damaged, their limbs about to be dismembered. Meanwhile, the white haired old man was wide eyed, in shock.</p><br/><p>A dragon! How could that be? Dragons never left Dragon Valley. How was this happening? Impossible!</p><br/><p>The other men were scared witless, their legs trembling under the weight of the dragon pressure. The one before them was not a human, but a dragon! And he was not female, but a male!</p><br/><p>“You must pay for your impetuous behavior!” The situation had developed just as he had planned. Without giving them time to explain themselves, Ben exploded forth with wind, fire, and water. Many were slain instantly.</p><br/><p>“Venerable dragon…” Although the white haired old man was powerful, more powerful than even the pope, how could he face a dragon? He spoke in an attempt to stop Ben, but how could Ben give him the chance to speak? A giant flame ball shot towards him. The old man immediately ascended into the air to avoid the fierce attack. He could feel the intense heat below him. The tent where he once stood in was not ashes with the faint smell of scorched earth.</p><br/><p>Watching from far away, Qi Aoshuang and Leng Lingyun’s expressions did not change.</p><br/><p>Although Oscar appeared to have a calm expression, awe surfaced from the bottom of his eyes. Even though he had grown up in the pure land of the elves, Oscar understood one thing. The dragon king had tricked these humans! Yes, the grandiose dragon king had done such a petty thing!</p><br/><p>The old man was one of the hidden cards of the Temple of Light, with strength that even the pope would admire. But today, he would die a dog’s death.</p><br/><p>“Too miserable.” Qi Aoshuang almost felt a little pity seeing the gruesome events.</p><br/><p>“Yes, quite cruel.” Leng Lingyun shook his head and sighed.</p><br/><p>Oscar froze. He looked at Qi Aoshuang and Leng Lingyun, but their expressions did not seem to match their words.</p><br/><p>Qi Aoshuang and Leng Lingyun did not move, knowing that Ben had been stifled for a long time now. He had not fought in a long time, but now he had a rare opportunity to attack without restraint. Naturally, he would treasure the moment, occasionally casting warning glances at Qi Aoshuang and Leng Lingyun to not get involved, then look back to chase the fleeing Temple of Light and Black Lightning members. Qi Aoshuang felt sympathy for the panicked escapees. Actually, these people were quite strong, especially the white haired old man. He had an intense aura, more powerful than that of the pope’s. If he had chanced upon an ordinary dragon, perhaps he would have an even fight. But unfortunately for him, he was facing Ben, the dragon who could strangely use three elements and had already received the Dragon King inheritance!</p><br/><p>Just when the old man was prepared to risk his life for escape, the sky suddenly started to become overcast. A giant shadow shrouded everyone. As everyone looked up to look, their expressions became more despairing.</p><br/><p>Another dragon!</p><br/><p>Qi Aoshuang froze. Her gaze was fixed on the person riding the dragon, a figure she could not be more familiar with.</p><br/><p>Jean!</p><br/><p>Jean stood on the dragon’s back loftily, surveying the circumstances below. His gaze landed on the fleeing people, then slowly shifted to the perpetrator of the event.</p><br/><p>Black hair, black eyes, black clothes! Chilling appearance, terrifying aura.</p><br/><p>Ben!</p><br/><p>Jean’s eyes widened.</p><br/><p>If he was here, where was she?</p><br/><p>Jean’s expression changed sharply. He scanned the ground rapidly, searching for the person he had been worried about all this time.</p><br/><p>“Roar!” Ben howled at the dragon in the sky. As overbearing dragon pressure descended, leaving many unable to move. The sound left them in a state of shock, their heads about to explode.</p><br/><p>Vermilion shuddered with dread and descended. She lay sprawled on the ground facing Ben. It was a dragon, one who was much stronger than her. Terrified at his strength, she did not dare to move.</p><br/><p>Jean was too preoccupied to pay attention to Vermillion. However, he was not focused on Ben, his gaze instead on the aloof person a distance away.</p><br/><p>The refined figure calmly floated in midair, quietly watching. Although she was far away, Jean was already far stronger than before. He could see everything in detail from this distance. Jean stood silently, watching the ordinary looking girl. Green hair, blue eyes, face spotted with freckles. However, her gaze was so familiar.</p><br/><p>It was her. The ordinary looking girl was her.</p><br/><p>Jean clenched his fist, staring at the person he had been searching for this whole time. His heart seemed to stop beating, nothing existing in the world except for him and the girl.</p><br/><p>His gaze did not move an inch away from Qi Aoshuang’s face. He did not pay attention to anything else, walking slowly towards Qi Aoshuang.</p><br/>\n</div>"}