{"title": "Chapter 202", "id": 202, "volume": 3, "url": "http://boxnovel.org/stunning-edge-chapter-202", "volume_title": "Volume 3", "body": "<h1>Chapter 202</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>After informing the Dragon Elders, Ben led Qi Aoshuang and Leng Lingyun out Dragon Valley. Only once they were a distance away did Ben turn to Qi Aoshuang, who was flying next to him, and say, “Haha, you can climb on my back now. It will be faster if I bring you to the Sprite Forest myself.”</p><br/><p>Qi Aoshuang and Leng Lingyun smiled, understanding Ben’s good intentions. In Dragon Valley, Ben absolutely could not allow them to ride on his back. He was the Dragon King, the leader of the prideful dragons. How could he let humans ride on his back before them?</p><br/><p>Now that they were far from Dragon Valley, Qi Aoshuang and Leng Lingyun sat comfortably on Ben’s back. With a deep breath, Ben took off with a sudden flap of his wings, flying rapidly. Below them, the scenery flitted by.</p><br/><p>In half a day’s time, they arrived at the fringe of the an endless forest that stretched as far as the eye could see.</p><br/><p>Ben descended. “We’ve arrived. This is the fringe of Sprite Forest. All of it is considered their territory.”</p><br/><p>Qi Aoshuang looked up at the dense forest. As she concentrated her gaze, she noticed there was a faint barrier.</p><br/><p>“This barrier was constructed by the god of Sprites to protect his people.” Ben took a few steps forward and placed his hand on the barrier. A hole wide enough for a person to enter appeared. “Let’s go. We’ll explain afterwards.”</p><br/><p>Qi Aoshuang entered first, then Leng Lingyun and Ben. Behind them, the barrier fused together back into its original appearance.</p><br/><p>“We are out the outer edges. Normally, no sprites roam here,” Ben explained. But then he scratched his head with vexation. “Unfortunately, the sprites hate humans the most. They’ll capture you the moment they see you, don’t even think about asking them for the artifact. As a matter of fact, they worship the artifact like a treasure.”</p><br/><p>Qi Aoshuang frowned. “We’ll see after we meet them. The dragons and sprites have never been hostile. You are the dragon king, after all. It might be best for you not to appear.”</p><br/><p>“It doesn’t matter. Worst case, I’ll mask my face when I help you steal it.” Ben chuckled. He was about to tear off a piece of cloth to cover his face.</p><br/><p>Just as Qi Aoshuang was about to laugh and say something, they heard slight movement.</p><br/><p>Someone was there!</p><br/><p>They all changed their expressions, their eyes narrowed as they watched ahead.</p><br/><p>The rustling noise came closer and closer.</p><br/><p>Qi Aoshuang was on high alert. The sound came not just from in front of them, but all around them.</p><br/><p>The next moment, there was a blur of shadowy figures. The sound of rustling went on continuously as the three felt their feet first constricted, then their wrists, then their waists.</p><br/><p>Qi Aoshuang look at her ankles and wrists with alarm. Tree vines! Green tree vines were attacking them from every direction, immediately entwining their arms and legs tightly.</p><br/><p>Ben took a breath, about to forcefully snap the green vines.</p><br/><p>“Wait! Don’t move.” Qi Aoshuang stopped Ben. Leng Lingyun did the same as Qi Aoshuang. None of them had moved an inch, letting the vines wrap around their entire body.</p><br/><p>Ben snorted. Then, he remembered. The sprites loved peace, a good and honest race. What they loved the most was nature, cherishing plants and animals. However, he had never heard of them being able to control plants.</p><br/><p>“Filthy humans, you do not belong here. Leave now,” a cold voice said. His voice was filled with faint arrogance, annoying Ben.</p><br/><p>“Is this how sprites treat their visitors?” Ben’s old habits resurfaced. In an instant, he released dragon might.</p><br/><p>There was a collective gasp in the forest.</p><br/><p>The cold voice spoke again, this time more politely. “Dragons? Honorable guest, please withdraw your dragon pressure.” The next moment, the vines slowly withdrew. The sprites and dragons did not have any formal agreements, but in order to enter Sprite Forest, one must first pass through Dragon Valley. It could be said that dragons were the sprites’ protectors. This was why the sprites were polite towards the dragons.</p><br/><p>Ben humphed, retracting his dragon pressure. The hidden sprites in the forest all released a breath. Afterall, Ben was the current king; his pressure would not be easy to bear.</p><br/><p>“Is one of you Claire Hill, if I may ask?” The cold voice spoke again. This time, the faint arrogance was back.</p><br/><p>“It is I,” Qi Aoshuang responded. Inwardly, she was surprised. Why would the sprites know her name? It was as if they knew she was going to come. Since they were only at the periphery of Sprite Forest, like Ben said, normally sprites were not here. However, there were quite a few hidden around them. The moment they entered, the sprites had appeared. Clearly, they had been waiting for them.</p><br/><p>“Your appearance does not seem to match.” The cold voice had no trace of warmth. They still did not show themself. “If you used something to change your appearance, is there any other way to prove your identity?”</p><br/><p>Before Qi Aoshuang could respond, White Emperor and Black Feather bounced out of her cloak, crouching on her shoulders. They started go, chirp chirp, peep peep.</p><br/><p>The forest quieted.</p><br/><p>The sprites emerged from their hiding places. There were at least twenty or thirty. Qi Aoshuang raised a brow. As rumored, the sprites had handsome appearances. The allure of so many appearing at once could be imagined. Some of them carried exquisitely designed bows, others with refined magic staffs, because they were mostly archers and magicians. The sprite standing at the front was especially remarkable. He had a slender body, with supple, light blue hair. His handsome face was incomparably cold. One eye was blue, while the other was golden! His pure white clothing only enhanced his allure. He did not have a bow nor magic staff in hand, so they could not tell if he was an archer or magician. However, the disdain he had when regarding Qi Aoshuang was clear. Evidently, like all the sprites, he hated humans.</p><br/><p>“Miss Claire Hill, our king is waiting for you. Follow me.” The leading sprite beckoned politely. However, his tone was still disdainful.</p><br/><p>“Have you been waiting for us?” Qi Aoshuang frowned.</p><br/><p>“Not bad,” the leading sprite responded. “Follow me. My king is waiting.”</p><br/><p>“Do you know what my intentions are?” Qi Aoshuang still had not budged. She looked straight at the arrogant, handsome sprite.</p><br/><p>“I know,” the sprite said faintly, then started walking away.</p><br/><p>Qi Aoshuang and Leng Lingyun shared a glance. They chose to follow the arrogant sprite quietly. Ben rolled his eyes and also followed. The remaining sprites also followed from behind.</p><br/><p>Countless thoughts flitted across Qi Aoshuang’s mind. How did the sprites know her? Why did they know that she would come, and what her motives were? Suddenly, Qi Aoshuang recalled her conversation with the god of Darkness. The god of Sprites had lost a bet against him. This meant that the two gods had a good relationship. Perhaps… Perhaps the god of Darkness asked the god of Sprites for a “back door”?</p><br/><p>The entire way there, it was silent. The prideful, leading sprite advanced without a word. Qi Aoshuang, Ben, and Leng Lingyun all noticed a strange phenomenon. Originally, there had been no road. This branches and grasses covered the entire forest. However, whenever the sprite before them took a step, the branches and weeds would give way to a path.</p><br/><p>Qi Aoshuang and Leng Lingyun shared a glance, both seeing shock in each others eyes. Inwardly, Ben was also surprised. The sprite had just been manipulating the plants. Who would have thought such a genius would appear among the sprites! He vaguely recalled his father telling him that a couple hundred or thousand of years ago, such a rare genius had appeared before. Who would have thought that he would meet one today!</p><br/><p>The prideful sprite walked quickly to the depths of the forest. It was always dime, as the tall trees blocked much of the light. As they continued, gradually, there was more light. The light came from the vegetation around them. The flower petals on tree flickered with dewdrops, which released gentle, faint rays. There were many different kinds, so many that it illuminated their surroundings.</p><br/><p>Ben curiously reached out to touch one of the dewdrops. The dewdrop slowly lost its light and became an ordinary dewdrop.</p><br/><p>“What is it?” Ben turned and asked a nearby sprite.</p><br/><p>“It is our Springwater of Life. Because these trees are close to our Springwater of Life, they have absorbed much of the water, which is the permeating dewdrops are like so.” Although the sprite regarded Qi Aoshuang and Leng Lingyun with loathing, he was very polite towards Ben.</p><br/><p>As it became brighter and brighter, the air became more and more moist and refreshing.</p><br/><p>“Honorable guest of the dragon race, look, there is our Springwater of Life.” The sprite next to Ben pointed.</p><br/>\n</div>"}