{"title": "Chapter 204", "id": 204, "volume": 3, "url": "http://boxnovel.org/stunning-edge-chapter-204", "volume_title": "Volume 3", "body": "<h1>Chapter 204</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>At night, Qi Aoshuang discussed with Leng Lingyun and Ben that they would leave tomorrow morning. After returning to the room the elves lent them, Qi Aoshuang was just about to lie down when she heard a knock at the door.</p><br/><p>She was slightly surprised, but got up to open the door. Standing at the doorway was a beautiful, mature female elf.</p><br/><p>“Do you have business with me? Or is her highness summoning me?” The elf was dressed differently from the maids, green designs on the bottom of her white dress. She appeared gentle, standing motionlessly at the door for some time.</p><br/><p>Qi Aoshuang frowned, about to question her, when the elf quietly said, “Can I come in?”</p><br/><p>Qi Aoshuang was somewhat puzzled, but she still allowed the elf in.</p><br/><p>After closing the door, the elf smiled and introduced herself. “Hello, Miss Claire. I am a Grand Elder of the elves, Mona.”</p><br/><p>“Hello.” Qi Aoshuang gave a nod politely. “Is the queen giving us an explanation?”</p><br/><p>“Oh, no, no it’s not that.” Mona waved her hands hastily, her expression becoming somewhat unnatural.</p><br/><p>“Then what is it?” Qi Aoshuang was now even more perplexed. Didn’t elves hate humans? What did this elf come this late for?</p><br/><p>“I… I…” Mona seemed a little apprehensive and embarrassed. Seeing Qi Aoshuang’s questioning gaze, she said, “I… I wanted to ask you about a human.”</p><br/><p>“Oh?” Qi Aoshuang’s curiosity was piqued even more now. She raised a brow. “Who?”</p><br/><p>“Cliff,” the elf said shyly.</p><br/><p>Mm? When she heard this, Qi Aoshuang raised her brow again.</p><br/><p>Gossip! The word appeared in Qi Aoshuang’s mind.</p><br/><p>Seeing the elf’s bashful expression, Qi Aoshuang immediately recalled that her master once told her he had saved an elf before and escorted her to the Forest of Elves before. Was it this elf?</p><br/><p>Seeing Qi Aoshuang’s strange expression, Mona shrinked back a little. “I.. I.. excuse my rudeness. There are so many humans, there’s no way you…”</p><br/><p>“No. Grand Elder, you found just the right person to ask. Cliff was my master. He told me that he once saved an elf and escorted her to the Forest of Elves.” Watching the beautiful elf, Qi Aoshuang sighed inwardly. Humans and elves were too different. Compared to the elven lifespan of hundreds of years, human lives that merely spanned over decades were fleeting. The elf before her still had such a beautiful, youthful appearance, but her master had aged into an old man, even if he was a cute old man. Qi Aoshuang frowned. Where was master now? Right before the incident, Master had disappeared from the city. Clearly, the Temple of Light had intervened. She missed the cute old man…</p><br/><p>“Ah? Really?” Mona stood up eagerly, her face flushing red.</p><br/><p>“Mm.” Qi Aoshuang nodded. Their relationship was definitely not so simple, seeing her reaction.</p><br/><p>“Is… is he well?” Mona lowered her head to hide her emotions and sat down.</p><br/><p>“He is very well.” Qi Aoshuang nodded, although she sighed in her heart. Master, where are you now? Such a huge thing had happened to her, her master should be aware by now. So what was Master doing now?</p><br/><p>“Good, good…” Mona muttered. She slowly raised her head, her beautiful face smiling bitterly. With difficulty, she said, “He… should be married now. Does he have a son now?”</p><br/><p>Seeing the elf’s anguished appearance, she shook her head lightly. “No. Master has never married his entire life. How could he have a child?”</p><br/><p>“What?” Mona’s expression changed again. “He… he really did not marry? He really still has not…”</p><br/><p>Qi Aoshuang now understood that Master and this elf must have made some kind of promise, which was why he had never married.</p><br/><p>“Yes. Master must have someone in his heart.” Seeing the elf’s immediate look of disappointment, Qi Aoshuang continued, “That person must be you, Grand Elder Mona.”</p><br/><p>Mon froze. After a long time, she finally uttered, “What a fool, a true fool. It’s already been years…”</p><br/><p>“Master believes it is worth it.” Now, the elf had a look of despair. Qi Aoshuang sighed lightly. “Why did you separate from Master?”</p><br/><p>The elf’s face darkened. After a long period of silence, she slowly began to speak. “Humans can only live for several decades, while I will live for several hundred years. I do not wish to see the day he leaves this world. How could a human and an elf ever be together?”</p><br/><p>Qi Aoshuang regarded Mona silently. “Every person has the power to make their own decisions. You know that he is fine, and has been thinking of you all this time. Is that enough?”</p><br/><p>“Yes, I am satisfied.” Mona smiled. She removed her necklace and handed it to Qi Aoshuang. “Please deliver this to him. Tell him, he shall forever remain in my heart.”</p><br/><p>As Qi Aoshuang accepted the necklace, she raised a brow. For a reserved elf to say such a bold statement, it seemed that Master had a special place in her heart.</p><br/><p>“I will.” Qi Aoshuang put the necklace away carefully. “I will deliver your words to Master.” Everyone makes decisions. Why Cliff and this elf made such decisions, Qi Aoshuang did not understand. However, she respected their decisions.</p><br/><p>“Thank you. I will be indebted to you for all of eternity.” Mona stood up to bow, but was stopped by Qi Aoshuang.</p><br/><p>Qi Aoshuang smiled impishly. “I do not deserve such courtesy. If master knew, he would skin me alive.”</p><br/><p>Mona’s face reddened.</p><br/><p>Qi Aoshuang pondered for a moment. “Oh right, these are for you.” She took out the three gifts her master had first given her.</p><br/><p>Mona looked down at the items curiously, then looked at Qi Aoshuang with a puzzled expression. Qi Aoshuang laughed. “Master made all of these. I don’t need these anymore, so you can have them as a keepsake.”</p><br/><p>“He made them himself?” Mona looked at them happily.</p><br/><p>“Mm.” Qi Aoshuang nodded. “Take care of them. In the future, if Master learns I gave them to you, he will definitely praise me. Perhaps he might teach me all the incantations and spells he knows.” Qi Aoshuang smiled.</p><br/><p>Mona looked at the items wistfully, stroking them gently. Watching this, Qi Aoshuang sighed again.</p><br/><p>In the end, Mona left with a smile on her face. Qi Aoshuang closed the door and lied down, but she couldn’t sleep. People’s face flashed in her mind. Where was Master now? What was Summer doing? What about Jean, that person who had vowed to stay by her side forever? After the incident, would he still be able to say those words resolutely? He was Duke Gordon subordinate, after all. Qi Aoshuang felt her heart freeze. Duke Gordon! She would never let him go! That person who would sacrifice everything for power!</p><br/><p>The capital of Amparkland.</p><br/><p>In the silent night, Lashia sat quietly meditating in the headmaster Mozart’s office.</p><br/><p>“Lashia…” Mozart quietly knocked on the door.</p><br/><p>“Enter.” Lashia’s voice was ice cold.</p><br/><p>Mozart slowly opened the door. Seeing Lashia sitting silently on the bed, his heart tightened. After the incident, Lashia left Hill manor, never stepping foot in it ever since, cultivating at his place ever since, cultivating unflinchingly, as if she did not know how to feel tired. She had changed from a lively, smiling little girl to always regarding everyone coldly. Tender pain flickered from the depth of Mozart’s eyes. He loved his talented, clever disciple from the bottom of his heart. Now that Lashia was like this, how could he not be pained? This child seemed as if she had closed off her heart.</p><br/><p>“Lashia, it is already very late. Sleep early, cultivate tomorrow,” Mozart said softly.</p><br/><p>“Yes, I know. Thank you, Master.” Lashia’s voice was without a trace of warmth. Despite her words, she did not move.</p><br/><p>Mozart sighed, then turned and left, closing the door behind him. He knew that no matter how many times he said this, it would be to no avail. He did not mention any of the words that Duke Gordon had repeatedly sent. Despite how many people Duke Gordon had sent to tell her to return, Lashia would always turn a blind eye, never talking to Duke Gordon or the people he sent. She would only leave one reply. Cultivation in seclusion. No one can see her.</p><br/><p>Lashia watched as the door closed, then slowly closed her eyes. “I know you will definitely come back, sister. I’ll wait for you.” Tears flowed from the corner of her eyes, glistening silently before they trickled down her face and disappeared.</p><br/>\n</div>"}