{"title": "Chapter 205", "id": 205, "volume": 3, "url": "http://boxnovel.org/stunning-edge-chapter-205", "volume_title": "Volume 3", "body": "<h1>Chapter 205</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Hill manor.</p><br/><p>In the study, Duke Gordon stood before the window, his brows furrowed. His hands were behind his back, though one was a strangely pearly white. It had been destroyed by Qi Aoshuang. The hand was made of a special type of ore, sent to him by the pope. The pope too had one made of the same material for his leg. This one, however, was created by the goddess of Light. Of course, Qi Aoshuang was to blame for all this.</p><br/><p>Duke Gordon currently had an unsightly expression, extremely dark. Roger, that trash, resented him for a mere woman’s death, living at the frontier far away from the capital. It was said that he would drink away his sorrows everyday. There was never a moment when he had a clear mind. Reports said that he was haggard, poor in health. This was fine. So what if a piece of trash died. Lashia on the other hand… Duke Gordon sighed. She was still in her rebellious phase. Hopefully, after time passed, she would understand.</p><br/><p>However, there was still no news of the black eyed, black haired Claire!</p><br/><p>This left him unsettled, extremely unsettled.</p><br/><p>Those pair of black eyes filled with hatred he saw right before he lost consciousness was etched deeply into his memory. She would definitely return for revenge! Duke Gordan was very certain, growing even more disturbed. He urged the pope to kill her many times. At first the pope was patient, but then he grew annoyed and started to ignore him.</p><br/><p>It could not continue like this! Duke Gordan paced back and forth in the study worriedly. He must do something! “Claire” was a terrifying danger that had to be exterminated as soon as possible! He could not allow her to return!</p><br/><p>In the Forest of Elves, the morning was peaceful with golden rays shining down. Qi Aoshuang and her party left after saying farewell to the king. This time, there was one more person: Oscar. He had an arrogant expression the entire time, not even giving Qi Aoshuang and Leng Lingyun so much as a glance. The only person he was willing to acknowledge was Ben, because he was a dragon.</p><br/><p>Qi Aoshuang did not care for him either. She thought to herself, as long as this arrogant fellow didn’t cause any trouble, just a bystander, it would be fine. After exiting the Forest of Elves, Ben assumed his original form and allowed everyone on his back. If it were not for the fact that Qi Aoshuang was in a hurry, Ben definitely would not allow Oscar to sit on his back.</p><br/><p>Oscar, on the other hand, was shocked. The prideful dragon was willing to return to his true form to allow humans to ride on his back?</p><br/><p>Ben extended his wings and started to fly. Wind whistled past their ears. Oscar was shocked at Qi Aoshuang’s calm expression, thinking to himself, what kind of relationship did this human have with this dragon for him to lower his pride to be her mount?</p><br/><p>However, he was even more amazed at what happened next. Just as they were about to arrive at Dragon Valley, Ben returned to his human form, and they passed through Dragon Valley on foot. Oscar was stunned to find that none of the dragons questioned them, all bowing respectfully instead, all saying your highness.</p><br/><p>They were definitely not talking to him. He was an elf; at most, they would call him princeling. Calling Qi Aoshuang or the human man your highness was even more out of the question. There was only one possibility. The dragon who had just allowed them on his back was the dragon king!</p><br/><p>Oscar looked at Ben, then Qi Aoshuang incredulously. He was definitely not dreaming. His gaze remained fixated on Qi Aoshuang. Who exactly was this human?</p><br/><p>After they exited Dragon Valley, Ben turned to Qi Aoshuang. “Aoshuang, where are we going?”</p><br/><p>“Chuxin and Dong Fenghou went to find the beast clan and dwarf clan. We’ll go visit the goblins,” Qi Aoshuang said in a low voice. She looked at Ben and continued, “You should be tired now. Let’s go to nearest village to rest for the night.”</p><br/><p>“Alright,” Ben agreed.</p><br/><p>Suddenly, Oscar murmured, “There are many humans stationed ahead.”</p><br/><p>“How did you know?” Ben asked immediately.</p><br/><p>“The wind told me.” Oscar raised his head, looking into the distance. “They have Light aura.”</p><br/><p>“Light aura?” Leng Lingyun frowned, regarding Oscar suspiciously. “The wind told you?”</p><br/><p>“Hmph, whether you believe me or not us up to you.” Evidently, Oscar was annoyed at Leng Lingyun’s suspicion. No one had ever doubted his capabilities before, but today, he was doubted by a mere human. Naturally, he had an ugly expression.</p><br/><p>Ben stroked his chin, regarding Oscar with a raised brow. It seemed this elf princeling was quite capable, able to hear the voice of the wind. Although he could use wind magic, he was definitely unable to hear the wind’s voice. Few elves were able to reach such a realm. This elf princeling was a genius.</p><br/><p>Qi Aoshuang raised a brow, smiling coldly. So the Temple of Light had caught up to them, but did not dare to continue because the Dragon Valley was ahead. Were they waiting for her? The fact that Xue Longfei had assisted her must have been exposed already, hopefully he was not in some kind of trouble. However, for her whereabouts to be exposed, who leaked the information? The Temple of Light knew of her relationship with Ben, but they didn’t know Ben’s identity. At the time, many people had been splashed with Ben’s saliva, including the dignified pope. Did that prince Banis expose them or was it… Kimira?</p><br/><p>“It was that woman.” Leng Lingyun said coldly. “Prince Banis did not see us enter, nor does he know of our relationship with Ben. But that woman saw everything. The first person the Temple of Light could think of to have such a close relationship with a dragon was you. They would rather kill a thousand innocents than let one guilty go.”</p><br/><p>It was clear what had happened. With the Temple of Light’s way of doing things, as long as there was a possibility, they would not rule it out.</p><br/><p>“Hmph!” Qi Aoshuang humphed coldly. “They’re just sending people to their deaths.”</p><br/><p>Oscar frowned. Wasn’t this woman a little too violent?</p><br/><p>“I’ll get rid of them.” Ben’s innate power was already surfacing. He excitedly clenched his fists.</p><br/><p>“Did you forget the agreement between the Dragon god and goddess of Light?” Qi Aoshuang burst his bubble.</p><br/><p>“Gah…” Ben cried with annoyance.</p><br/><p>“Just help us if we’re in trouble.” Qi Aoshuang was a little amused. It was as if she had stolen a toy from a child.</p><br/><p>Ben agreed reluctantly.</p><br/><p>“We still haven’t killed the goddess of Light yet, so the agreement between the Dragon god and goddess of Light still exists. You are the dragon king, you still need to think of the dragon race.” Leng Lingyun advised, seeing Ben’s disappointment.</p><br/><p>“Yes, yes…” Ben’s head drooped defeatedly.</p><br/><p>“Aoshuang,” Leng Lingyun suddenly said in a low voice. “Last time, the Temple of Light suffered greatly. They won’t come unprepared.”</p><br/><p>“So?”</p><br/><p>“The people who come this time will not be ordinary,” Leng Lingyun continued in a low voice. “Perhaps in the eyes of many people, the pope and archbishops are the strongest people in the Temple of Light.”</p><br/><p>“Is that not so?” Ben frowned.</p><br/><p>“Of course not.” Leng Lingyun shook his head. “In the Temple of Light, there are powerful individuals who do not seek fame or fortune. They enjoy simple, peaceful lives. However, whenever the Temple of in danger, they will come to the forefront.”</p><br/><p>“Tsk tsk, then I will definitely have to act.” Ben took out a piece of black cloth and used it to cover his face.</p><br/><p>“What are you doing?” Qi Aoshuang frowned at his crude action.</p><br/><p>“I will get rid of them with my face hidden.” Ben chuckled, pleased with himself/</p><br/><p>“You are a dragon. They will definitely be strong enough to tell.” Leng Lingyun said, feeling a headache.</p><br/><p>“What are you afraid of? It’s not like they can see my face.” Ben shrugged and said self righteously. “So what if they know I’m a dragon? Also, with my current strength, concealing my aura is no big deal.”</p><br/><p>“If they recognize you’re a dragon, they will report to the goddess of Light, and the Dragon God will be in an uncomfortable position,” Leng Lingyun said.</p><br/><p>“I just won’t admit it was me. With my face hidden, who can tell it was me?” Ben said shamelessly. “I’ll even complain that someone is trying to frame me to ruin the relationship between the Dragon god and goddess of Light!”</p><br/><p>Leng Lingyun was speechless. The pure and honest elf prince Oscar’s mouth was wide open. He stared at the shameless Ben, unable to return to his senses. This extraordinarily shameful man was really one of the incomparably prideful dragons? Really the venerable dragon race’s king? Qi Aoshuang’s mouth twitched. Watching the shameless Ben, she was a little saddened. Before, Ben was honest and impulsive. Now, he had become like this…</p><br/><p>“You…” Qi Aoshuang watched Ben with his mask, unable to finish her words. She knew that Ben had become this way all because of her. Even if it wasn’t totally because of her, it was in large part due to her.</p><br/><p>“Just be careful.” Leng Lingyun said seriously. “These people do not care for fame or profit, so although they may not have any position in the Temple of Light, their strength is not to be looked down upon.”</p><br/><p>“How many of them are there?” Ben said in a muffled voice with the mask on.</p><br/><p>“I don’t know. I just know they exist.” Leng Lingyun shook his head. Although he was previously the Divine Prince, this did not mean he knew all the Temple of Light’s secrets.</p><br/><p>“Whatever, I’ll just kill them all.” Ben clenched his fists, cracking his knuckles. His eyes were full of eagerness. It seemed he had not fought in a while.</p><br/><p>Violent, shameless dragon king! Completely unlike the grandiose dragon clan! This was Oscar’s conclusion.</p><br/><p>Leng Lingyun sighed. A normal kid was turned into this because of Qi Aoshuang. But he was not so bad this way either.</p><br/>\n</div>"}