{"title": "Chapter 203", "id": 203, "volume": 3, "url": "http://boxnovel.org/stunning-edge-chapter-203", "volume_title": "Volume 3", "body": "<h1>Chapter 203</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>The sound of water became louder and louder. As they approached, a silver lake emerged, sparkling intensely under the sun rays. In the middle of the lake was a giant tree. There was a strange formation in it where silver water flowed out continuously into the lake, a steady, endless stream. This must be their Tree of Life and Springwater of Life.</p><br/><p>“Very pretty,” Qi Aoshuang said genuinely.</p><br/><p>Humph! The cold elf leading them sneered, as if the praise was to be expected.</p><br/><p>“Over here, please.” The tone of the leading elf was still faintly haughty.</p><br/><p>Following his gesture, Qi Aoshuang saw numerous beautiful elves who were on guard. Behind them were their homes, all designed exquisitely. Straight ahead was a large temple, its huge, wooden door already open. Two soldier elves with bows stood and each side. All the elves regarded Qi Aoshuang and Leng Lingyun coldly.</p><br/><p>Qi Aoshuang and Leng Lingyun did not care for the cold gazes, following the haughty elf into the large doorway expressionlessly.</p><br/><p>Everything was made from nature. The walls, chairs, and even the candle holders were all made of tree vines. On top of the candle holder was a beautiful piece of gemstone. Sitting atop a throne in the temple was a beautiful female elf. She donned a plain green dress, a refined golden crown atop her head, facing them with dignity. This was the elf queen. Once she spotted Qi Aoshuang and the rest, her expression did not change.</p><br/><p>“Mother, Claire hill has arrived.” Only then did Qi Aoshuang and the rest realize his true identity. So he was the prince of the elves! This would explain his ostentatious manner and loathing towards humans.</p><br/><p>“I have been waiting for you, Claire Hill.” The dignified and beautiful queen spoke softly, yet everyone heard her words clearly.</p><br/><p>“Venerable highness, greetings.” Qi Aoshuang also spoke courteously. “May I ask why you have been waiting for me?”</p><br/><p>“I know you are here for the Heaven Slayer.” The elf queen smiled graciously, her eyes fixed on Qi Aoshuang, who remained calm. The queen’s eyes flickered with hidden admiration. What a powerful human. Perhaps the god of Elves had a basis for his instructions.</p><br/><p>Qi Aoshuang did not say a word, quietly waiting for the elf queen’s words.</p><br/><p>“Originally, I would not give you such a valuable treasure.” The queen smiled as gracefully as spring wind, pausing before continuing, “But now, as long as you agree to a condition, I will give you the Heaven Slayer.”</p><br/><p>“Please state your condition,” Qi Aoshuang said seriously.</p><br/><p>“Please allow my son Oscar to stay with you until you complete your task.” The elf queen smiled as she delivered the shocking condition to Qi Aoshuang.</p><br/><p>Oscar? The haughty elf prince’s name? What… what a joke! Bringing an elf with them? Oh please, she did not want to be gawked at by pedestrians or invite trouble. What was the elf queen thinking? Did she dislike them so much to force the elf prince onto them? If only the prince’s attitude were more bearable. The whole way there, he had his nose to the sky. Trying to get along with such a person would shorten her life!</p><br/><p>“Your highness, do… do you know what I intend to do?” Qi Aoshuang smiled. Before the queen could respond, she continued, “Does your highness know of my current status? I am now a fugitive, a wanted criminal for Amparkland and the Temple of Light. Do you really think it is a good idea to let your son accompany me?”</p><br/><p>Oscar’s expression also changed. He glanced at Qi Aoshuang’s ordinary face from the corner of his eye, his eyes filled with faint disdainful from their depths. The elves loved beauty, but Oscar was displeased with Qi Aoshuang’s almost ugly face. Now that he heard that she was a wanted criminal, he was even more displeased with her. If it weren’t for the fact that mother’s words were the god of Elves’s order, he would never leave with this filthy human!</p><br/><p>But the queen immediately resumed her dignified smile. “I doubt my son cannot protect himself. He will definitely be of great assistance. I do not care for your status.”</p><br/><p>“But I care very much about the prince’s status.” Now, Claire was not so courteous, her voice cold. “I attract attention wherever I go, which was why I intentionally disguised myself. The elf prince’s appearance and pointed ears are too conspicuous, so he will be too much of a burden.”</p><br/><p>“You!” Oscar immediately flared up. That someone would not value him! He, who had been superior his entire life was being disdained! He then looked at Qi Aoshuang’s face, secretly thinking, this person changed her appearance? What did she truly look like?</p><br/><p>“Everything I said is true.” Qi Aoshuang ignored the distraught elf prince, looking fixedly at the queen, waiting for her response.</p><br/><p>The elf queen continued smiling in her dignified manner. “I will find a way to conceal his ears. He can wear a hat to hid his face. I believe there are no more problems? And I imagine you have enough power to handle any trouble.</p><br/><p>Qi Aoshuang watched the smiling queen. Suddenly, she had a thought. This queen was not as gentle as she appeared. Do not judge a book by its cover…</p><br/><p>Now that the queen had compromised, what more could Qi Aoshuang say? She needed the Heaven Slayer at any cost.</p><br/><p>“I understand. I’ll do as you say.” Qi Aoshuang nodded, finally accepting. It would be a problem if the queen resolutely denied giving them the Heaven Slayer. It was fine to have a powerful elf at her side, even if his personality was very XX. She would think of a way to restrain him!</p><br/><p>The elf queen’s eyes glimmered, as if everything happened according to clan. Noticing this, Qi Aoshuang shuddered.</p><br/><p>“If that is the case, I shall hand the Heaven Slayer to you.” The elf queen smiled. She turned to an elf standing beside her. “Go, fetch the Heaven Slayer.”</p><br/><p>Qi Aoshuang vaguely frowned. The god of Darkness sure worked quickly; the god of Elves had arranged everything well beforehand, it seemed. Although the god of Darkness was craven and shameless, fleeing the moment he saw the goddess of Light, he was not terrible at everything. This also meant that the god of Sprites was no good person. Like attracts like. For him to be on such good terms with the god of Darkness, how virtuous could he be? However, Qi Aoshuang could not say this out loud before all these elves. She did not want to be pierced by all their arrows into a hedgehog.</p><br/><p>Two elves solemnly brought forth a silver pike. At the entrance of the temple, many elves watched on with interest, their eyes all on the silver pike. When the two brought the silver pike before the queen, they appeared even more dignified and divine.</p><br/><p>The elf queen slowly stood up, grasping the pike with both hands. The two elves withdrew. The queen then slowly walked over to Qi Aoshuang. “Once you finish, I hope you will return the Heaven Slayer to us intact.”</p><br/><p>“I will.” Qi Aoshuang also grasped the Heaven Slayer with both hands solemnly, her voice exceptionally earnest.</p><br/><p>The elf queen smiled. “I leave Oscar in your hands.”</p><br/><p>Qi Aoshuang put away the Heaven Slayer. She glanced at the clearly displeased elf prince from the corner of her eye, feeling annoyance herself. The elf queen sure was cunning, leave such a rude elf prince at her side to learn from experience. Why did she feel that this was the focal point? He would even learn for free, how shameless. Meanwhile, the elf queen continued to smile gently and composed. “Miss Claire, if you may please rest here for two days before setting off.”</p><br/><p>“Thank you, your highness, for your hospitality.” QI Aoshuang lowered her head courteously.</p><br/><p>The elf queen quietly clapped. Immediately, an elven maid appeared.</p><br/><p>“Molika, please lead our honored guests to their resting place,” the queen instructed.</p><br/><p>“Yes, your majesty.” The maid Molika bowed, then walked over to Qi Aoshuang gracefully, speaking quietly. “Please follow me.” Elves loved the quiet, and faced with humans, which they disliked, they naturally would not hold a banquet to welcome them.</p><br/><p>They followed. Inside the temple, Oscar had a face full of displeasure. He did not go.</p><br/><p>“Oscar, you don’t understand, do you?” The elf queen smiled at her haughty son. She could not help but admit this child was arrogant. However, he could not become the elf king with such an immature attitude, which was why she made the decision for him to follow Qi Aoshuang.</p><br/><p>“I don’t understand. Mother, why did you do that? We already gave them the Heaven Slayer like our god decreed. After she finishes, she is to return it. There was no need to send someone to accompany them. Mother, why are you making me go with them?” Oscar was completely unhappy.</p><br/><p>“Oscar, travel with the girl. In the future, you will understand my decision.” The elf queen understood her son very well. No matter what she said now, he would not be convinced. Only through experiencing it himself would he be convinced him.</p><br/><p>Oscar opened his mouth to speak, but the queen stopped him and said, “I’m now tired and will take my leave. The day they leave, you will follow them.” The queen raised her hand. A ray of silvery white light spilled forth onto Oscar’s ear. Soon, his pointed ears became rounded like humans. Now, Oscar simply looked like an exceptionally handsome human with fair skin.</p><br/><p>After casting this magic, she walked away gracefully, leaving Oscar standing alone in the temple, lost in thought.</p><br/>\n</div>"}