{"title": "Chapter 211", "id": 211, "volume": 3, "url": "http://boxnovel.org/stunning-edge-chapter-211", "volume_title": "Volume 3", "body": "<h1>Chapter 211</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>The intense pain almost made him stop breathing. Qi Aoshuang’s sword had pierced through his right chest.</p><br/><p>“Birdmen have red blood too?” Qi Aoshuang smiled coldly, then pulled out her sword viciously.</p><br/><p>The eight winged angel howled with pain. His blood spurted out like fountain water. He retreated as fast as he could, to get as far away from Qi Aoshuang as possible.</p><br/><p>When the four six winged angels saw the circumstances, they all stopped what they were doing and rushed over to the eight winged angel’s side. They all made the same symbol with their left hand. A barrier appeared before Qi Aoshuang, stopping her from advancing.</p><br/><p>The five angles then raised their right hands at the same time. Just as Qi Aoshuang was about to strike through the barrier, their made a simple hand gesture. Instantly, dazzling white light enveloped them. Then, they disappeared.</p><br/><p>“A portal.” Leng Lingyun said quietly, coughing as he approached.</p><br/><p>“Portal?” Jean sheathed his sword. He stared ahead at the empty cavity, frowning.</p><br/><p>“Only with five angels can they use it. They are teleported to the nearest source of Light power. It should be the closest temple,” Leng Lingyun explained. He waved his hand to cast healing magic. White light enveloped Qi Aoshuang, healing her wounds instantly. Jean fell silent, because Leng Lingyun’s wounds were visible more serious than Qi Aoshuang’s.</p><br/><p>“Master!” Vermillion flew over, tears in her eyes. She carefully inspected Jean to see if he was wounded at all, sobbing as she said, “Sorry master, I could not help you. I.. I was afraid the dragon god would take be away. But… but… master, I… if they were too… I would have intervened no matter what.”</p><br/><p>“I understand.” Jean patted Vermillion’s head kindly. “You were good. We’re perfectly fine. If you were taken away, we would have been much slower.”</p><br/><p>Vermillion continued to sob.</p><br/><p>Oscar nonchalantly stood to the side, arms crossed as he regarded Qi Aoshuang without a word.</p><br/><p>Qi Aoshuang was dark faced, also silent.</p><br/><p>“Chuxin and Dong Fenghou are in danger,” Qi Aoshuang managed to squeeze out.</p><br/><p>“What?” Everyone was alarmed. Only Oscar remained aloof.</p><br/><p>The goddess has finally started to make her move.” Qi Aoshuang’s expression was exceptionally unsightly. She needed an entire set of deity weapons to kill the goddess of light, but so long as the goddess stole away a single one, all of her efforts would be for nothing. Right now, what was most worrying was Qiao Chuxin and Dong Fenghou were completely not those angels’ match. They had only sent five angels after them, even one that was eight winged. What about Dong Fenghou and Qiao Chuxin? Even a six winged angel would be hard for them to fight!</p><br/><p>“We need to find them immediately.” Qi Aoshuang did not care for anything else. Even if the goblins were right ahead, the deity weapon almost in reach, Qi Aoshuang was currently complete fixated on Qiao Chuxin and Dong Fenghou’s safety.</p><br/><p>No one objected. They all knew what was most important.</p><br/><p>Vermillion immediately assumed her dragon form, carrying everyone up into the clouds in one huff.</p><br/><p>They soon reached the beastmen race. Dong Fenghou and Qiao Chuxin’s first stop was there. Based off of their calculations, they still had not arrived yet.</p><br/><p>At this time, Ben was all wrapped up on the rainbow cloud. Sitting next to him emanating red light was a mysterious old man. This was the dragon god.</p><br/><p>“Mmph, ah…” Ben was still writhing around pointlessly.</p><br/><p>The dragon god looked down upon Ben. Suddenly, he reached out and jabbed Ben. Ben opened his eyes wide, struggling even more now.</p><br/><p>“Shut the hell up.” Ben felt as if thunder struck. His voice was resonant and dignified, yet he said such words. He had been all wrapped up and struggling with all his might at the time the dragon king said “lil bastard”, so he hadn’t heard him.</p><br/><p>“Mmph!” Ben wriggled, even more loud.</p><br/><p>“How could you be so dumb? Always making trouble for me.” The dragon god stood up, anger rising. He raised his foot and started to step on Ben. Ben howled miserably.</p><br/><p>“You caused so much trouble, and even provoked the goddess of Light, that wench. Your identity was even found out! Are you a dragon or a pig?” The dragon god’s face had been fuming red, but now, even his ears and neck were starting to flow red. Whether it was anger or excitement was indiscernible.</p><br/><p>“Mm?” Ben realized something was strange. It seemed like he didn’t care about provoking the goddess of light?</p><br/><p>“You don’t know how to wipe up after your shit? You’re a dragon, not a pig! Use your brain!” The dragon god started stepping on Ben again. With each step, he was more stirred up. Ben was pummeled into a ******. He wanted to cry but couldn’t.</p><br/><p>Finally, the dragon god was finished. He withdrew his foot, then sat down, finally satisfied. With a flick of his finger, he loosened Ben’s bounds. Ben desperately held on for dear life, gasping for breath.</p><br/><p>“I originally wanted to see you bring down that treacherous, idiotic dragon king. Just when I was about to praise you, you got into this mess. How could you get into such bullshit? The goddess of Light, that wench, came knocking on the door!” The longer the dragon god spoke, the more angry he became. He was prepared to give Ben another beating. At this time, Ben “unlocked his hidden potential”, rolling away, avoiding the dragon god’s claws.</p><br/><p>Ben now understood one thing very clearly. The dragon god they revered had bad character! He was a shameless, two faced bastard!</p><br/><p>“Venerable dr-dragon god, I…” Just when Ben started to speak, he was met with ringing pain.</p><br/><p>“Don’t try to act all nice. I know you’re secretly cursing me.” The dragon god gave Ben a warning smile.</p><br/><p>“Yes! So what, you damn old man. Why did you take me away? Are we dragons afraid of the goddess of light?” Ben finally understood the dragon king’s personality, blurting out cheeky words.</p><br/><p>Ben stared at the dark faced old man. When the dragon king heard his words, he was so angry, he was going to give Ben another beating.</p><br/><p>“You favor the strong and bully the weak!” Ben ducked to avoid the attack.</p><br/><p>“You pighead, you know what that means? Hm? If you know what it means, why do you ask? Are you an idiot?” The dragon god was even more angry. He gave Ben a thorough beating.</p><br/><p>“What do you mean?” Ben hugged his head, crying out. “Is it because you hate people calling you that way, so you…”</p><br/><p>“Oh, you’ve made progress. You’ve changed from a bastard to a fool.” The dragon gold stopped his attacks. He said disdainfully, “You finally realized. Dragons are so much stronger than humans, so how could the goddess of Light, that wench, be someone I care about? But if others say I bully the weak, then it would be bad.” The old dragon god sat down crossed legged and said seriously.</p><br/><p>“Huh?” Ben was shocked. Who would have thought the dragon god would be so shameless, two faced, and care so much about face! “It’s like that?” Ben’s expression was still filled with shock.</p><br/><p>“Of course!” The dragon god assumed a grandiose appearance. “If not for that wench pretending to be so pitiful, asking me to sign a pact, pah! You think I’d care?” The dragon god’s mouth twitched. Suddenly, he seemed to say to himself, “That old wench is too shrewd, I don’t like her.”</p><br/><p>This time, Ben heard everything clearly. He felt like that dragon goddess had grabbed hold of his weakness of hating losing face, she she had tricked him into signing the agreement that dragons could not attack humans heedlessly.</p><br/><p>“If you don’t like that wench, then let me go help my friends. I’ll just hide conceal myself everywhere we go,” Ben frowned and said, breaking the dragon god’s train of thought.</p><br/><p>The dragon god flew into a fury. He pointed straight at Ben’s nose. “You idiot, they already know who you are. How the hell would you be able to help them? Don’t cause me more trouble!” He rolled his eyes, then looked into the sky, silent. Now one knew what he was thinking.</p><br/><p>Ben now was proficient at reading expressions. Thus, he crouched obediently, waiting for the dragon god’s next words.</p><br/><p>“Lil bastard, how come I never noticed you were so scheming? You’re so treacherous and deceitful, how come I never noticed before?” the dragon god suddenly asked.</p><br/><p>Ben’s mouth went wide. “Are you complimenting me or insulting me?”</p><br/><p>“You can think of it as a compliment.” The dragon god nodded earnestly.</p><br/><p>“It was my human friend who taught me. At her side, I learned many things. Only then was I able to think of an idea to kick that previous dragon king off the throne.” Ben sensed this is what the dragon god liked.</p><br/><p>“Mm… not bad, not bad.” The dragon god nodded, smiling. “That woman has piqued my interest.”</p><br/><p>“So can I go help her?” Ben smiled, trying to curry favor.</p><br/><p>“When did I say you could?” The dragon god’s face darkened, his voice low.</p><br/><p>Ben was about to ready himself for another beating, but before he could, the dragon god started to laugh, his eyes darting around. “If we can’t do this blatantly, then we’ll do it secretly. That wench had been rubbing tme the wrong way for some time now. Getting rid of her should be a good idea.”</p><br/><p>Ben: “……”</p><br/>\n</div>"}