{"title": "Chapter 213", "id": 213, "volume": 3, "url": "http://boxnovel.org/stunning-edge-chapter-213", "volume_title": "Volume 3", "body": "<h1>Chapter 213</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Stunning Edge – c213</p><br/><p>Qi Aoshuang’s group halted their flight and silently floated in the air, waiting for the group to approach.</p><br/><p>The sound grew louder and louder, and the rumbling sound was full of momentum：a troop of cavalry. The beasts for riding were a herd of elephants, with a pack of werewolves sitting on them. The one in the front was a werewolf in black clothes. On his shoulder was a prominent badge, and a golden tassel fluttered about. The werewolves were the vanguard of the Orc clan’s army and they robust and fast-speed werewolves were also responsible for the patrol of the Orc clan.</p><br/><p>All the Orc man stopped right in front of Qi Aoshuang’s group.</p><br/><p>“Human beings, we know what you’re coming for.” Without waiting for Qi Aoshuang to speak, the leader of the werewolves spoke in rugged voice.</p><br/><p>Qi Aoshuang was slightly surprised. The other party knew what we come for? Could it be? Qi Aoshuang’s expression changed and his eyes sank. Could Chu Xing and Dong Fenghou have encountered danger?</p><br/><p>“Our prophet told us to give this to you, and you will go away.” The leader of the werewolves took out something in his arms and threw it to Qi Aoshuang.</p><br/><p>Qi Aoshuang gazed at it, a crystal ball? After she held it, she looked at the exquisite crystal ball in her hand and was a little shocked. Is it the memory crystal?</p><br/><p>A prophet? Leng Lingyun was also shocked. The prophet was the most powerful of the Orc clan. Even the king of the Orc clan didn’t have a high status as a prophet. The prophet can always help the Orc clan with his wisdom and his knowledge. Now it seemed that the prophet had predicted that their group would come?</p><br/><p>“Please watch the record inside.” The leader of the werewolves urged Qi Aoshuang and all the werewolves did not leave.</p><br/><p>Without any hesitation, Qi Aoshuang immediately injected the magic power into the crystal ball to see the recorded scenes inside. Her heart sank as she saw the blinding white wings appeared in the image. What was recorded inside was that the eight-winged angel had come here and taken the artifact that in the hands of the Orc clan. Without even the slightest bit of effort, the orcs didn’t resist and handed the artifact to the eight-winged angel. After all, that thing didn’t really help them much. If they resist, they will be wounded! Leng Lingyun’s expression also turned dark. This meant that the Sky Slaughter Divine Feathers couldn’t gather together any more. What they had done was in vain!</p><br/><p>Qi Aoshuang’s face was as dark as water. She slowly raised her head to look at the leader of the wolves, “thank you for your advice, but I wonder if I have friends here?”</p><br/><p>“No, you are the human beings here for the first time in years,” he said. The Werewolf answered coldly. His eyes were clear without deception. He said loudly, “since you have seen it now, can you leave now?”</p><br/><p>Qi Aoshuang was both elated and disappointed. Knowing that Qiao Chuxin and Dong Fenghou were alright, her heart settled down. It was dejected that the Sky Slaughter Divine Feathers could no longer gather together. What these orcs did was normal. They didn’t want to interfere with the goddess of light, so they would naturally hand over the useless divine artifact.</p><br/><p>“Thanks. We will leave now. ” Qi Aoshuang nodded towards the leader of the werewolf. His face was completely calm and collected.</p><br/><p>The werewolves didn’t move at all. They watched as Qi Aoshuang’s group turned around and left. Only after they disappeared did they turn around and run away.</p><br/><p>Qi Aoshuang’s group returned to where were Judy and Jin Yan. When he saw them coming back so quickly, Jin Yan was shocked when he saw Qi Aoshuang’s face. He stood up and looked nervously at the crowd: “is that Qiao Chuxin and Dong Fenghou … ”</p><br/><p>“No, they have not been here yet.” Leng Lingyun lightly shook his head and smiled wryly, “But the Orcs’ divine artifact has been taken away by the angels.”</p><br/><p>Jin Yan suddenly turned to look at Qi Aoshuang. Although his eyes were filled with disbelief, when he saw Qi Aoshuang’s calm but somewhat dejected face, Jin Yan understood that what Leng Lingyun had said was true! So everything’s in vain?</p><br/><p>“Mi…miss …” Jin Yan struggled to speak.</p><br/><p>Qi Aoshuang exhaled a long breath and turned to look at Jin Yan. She revealed a brilliant smile and said, “Nothing. Even if the divine artifacts couldn’t gather together, there must be other ways. I want to increase my own strength and keep on increasing! ” Qi Aoshuang then sat down on his butt. “We will wait for Chuxin and the Dong Fenghou here. We will return to Uusari after they arrive. ”</p><br/><p>Jin Yan looked at Qi Aoshuang who was smiling brilliantly, a little bit stunned. He then came to himself. On his handsome face there was a smile as he lightly nodded, “Yes, miss.I will follow you all the time. ”</p><br/><p>Leng Lingyun’s originally worried heart relaxed a little at this moment. He looked at Qi Aoshuang’s expression and smiled faintly.</p><br/><p>Aosta raised his eyebrows slightly. He had thought that this girl would be despair and would always be depressed. He didn’t expect that she could adjust so quickly.</p><br/><p>“Aosta …” Suddenly, Qi Aoshuang’s voice sounded in Aosta’s ears. He turned around and looked at Qi Aoshuang with some surprise.</p><br/><p>“This is for you, the Sky Slaughter Divine Feathers can’t gather together.” The Sky Slaughter is back to you. ” Qi Aoshuang took out the Sky Slaughter Space Ring and handed it to Aosta.</p><br/><p>Aosta silently looked at the Sky Slaughter in Qi Aoshuang’s hands, but he did not reach out to take it. If he took it, it meant that he should be back in the Elvish Forest.</p><br/><p>“You take it first, I don’t have anywhere to put it. Even without the Sky Slaughter Divine Feather, you can still pull the goddess of light down? ” Aosta lied through his teeth. As prince of the elvish clan, how could he have no space to put the ring? He didn’t want to leave like that, not wanting to leave this mysterious girl. He felt that as long as he stayed by her side, there would be many unimaginable things.</p><br/><p>“Yes,” Qi Aoshuang’s gaze turned cold, but her gaze was extremely firm.</p><br/><p>“Then I’ll personally witness that day and I’ll go back then and return me the Sky Slaughter.” Without waiting for Qi Aoshuang to reply, Aosta left.</p><br/><p>Qi Ao Shuang was slightly taken aback, but still,she withdrew the Sky Slaughter.</p><br/><p>Judy had been unconscious, and after five days here, Judy had woken up, and Qiao Chuxin and Dong Fenghou also arrived in haste.</p><br/><p>“You idiot. Didn’t you say you knew the way? So many unnecessary long ways!! ” Qiao Chuxin’s angry voice came from ahead.</p><br/><p>The two figures got closer and closer. They rode together on a magical beast, while Qiao Chuxin, who was sitting in the back held the ear of Dong Fenghou, scolding .</p><br/><p>Qi Aoshuang looked at them as they got closer and smiled knowingly.</p><br/><p>Now you can go back to Uusari.</p><br/>\n</div>"}