{"title": "Chapter 212", "id": 212, "volume": 3, "url": "http://boxnovel.org/stunning-edge-chapter-212", "volume_title": "Volume 3", "body": "<h1>Chapter 212</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Stunning Edge – C212</p><br/><p>“Bullshit!” The dragon god put on an air of arrogance! “If that little bitch had not come up to me with a pitiful look, begging me to sign a deal, I! I’ll take care of this bird thing? ” The dragon god’s lips twitched, and then he seemed to be talking to himself: “that little bitch were too scheming, and I really disliked her. ”</p><br/><p>The black dragon had finally figured out everything from this. It was probably because the goddess of light had grasped the weakness of the face-saving dragon god, so she went to pretend pity and signed a contract with the powerful dragons that they couldn’t casually attack a human being and that could not invade their territory.</p><br/><p>“Since you don’t like that little bitch, let me go to help my friend. I’ll help them in the dark. ” The black dragon frowned and interrupted the dragon god’s thoughts.</p><br/><p>“You stupid pig, your identity has been recognized. Help, fuck help! Don’t teach me any more lessons! ” The dragon god was furious hearing this. He pointed at black dragon’s nose and began cursing. After cursing, he rolled his eyes, looking at the sky and didn’t say anything. What he was thinking about is unknown.</p><br/><p>The black dragon was already very observant, so it obediently sat on the cloud, waiting for the dragon god’s words.</p><br/><p>“Little bastard, why didn’t I find out that you were in the dragon clan? You are so cunning and deceitful, I should have discovered you long ago. Why haven’t I noticed it before? “Dragon god has suddenly changed the topic.</p><br/><p>The black dragon opened its mouth wide. “Are you praising me or insulting me?”</p><br/><p>“You could take it as praise.” The dragon god nodded seriously.</p><br/><p>“My human friend taught me, and I learned so much from her. Only then will I be able to kick the former dragon king off the stage. ” Seeing the dragon god’s attitude, the black dragon had understood the old man’s preference, so he calmly told it to him.</p><br/><p>“En good, good. “The dragon god nodded with a smile on his face.” I like her”.</p><br/><p>“Then you mean I can go help her?” The black dragon laughed in a sycophantic manner.</p><br/><p>‘When did I say okay? ‘ The dragon god’s face darkened as he said in a deep voice.</p><br/><p>The black dragon didn’t have the time to pull a long face than the dragon god rolled his eyes and chuckled, “we can’t directly help her but we can do in the dark. I’ve already seen the bitch disagreeable, and it’s better to drag it down sooner. ”</p><br/><p>Black Dragon said: “…”</p><br/><p>At the same time, Judy carried the crowd rushing toward to the Orc clan. Without Qi Aoshuang’s asking about directions, Judy said she knew it and continued to fly in that direction.</p><br/><p>Judy never stopped flying even in the night. She knew that if she slowed down a little bit, perhaps her master’s two friends would be dead!</p><br/><p>“Thank you, Judy.” Jin Yan sat in the front seat and gently patted Judy’s head with his hand, comforting her in light voice.</p><br/><p>Judy gritted her teeth and didn’t speak. She was afraid that she would let go of her strength if she spoke. She kept fluttering her wings and flied on.</p><br/><p>Qi Aoshuang felt anxious. She felt guilty towards Judy, who was exhausted, but she couldn’t stop now. If she stopped, everything would be too late.</p><br/><p>After flying for two days and nights, Judy finally arrived at the Orc clan. In front was the orc’s territory, and Judy could no longer hold herself back. She let out a wail and fell down. Her huge body straightly fell down.</p><br/><p>“Judy!” Jin Yan’s expression changed and he urgently called out.</p><br/><p>However, Judy had completely exhausted her stamina by this time. She was completely exhausted and lost consciousness as she could not control her massive body.</p><br/><p>Qi Aoshuang immediately spread her golden wings and flew up to cast layers of barrier of enchantment to catch Judy’s body.</p><br/><p>At this time, Aosta floated up to the sky. Without waiting for everyone to make a move, he began chanting a complex mantra. A strong wind blew under Judy’s body, slowing down her speed of descent. After that, a small green ball appeared from in Aosta’s hand, and in an instant, it became a huge, soft green bed, which held Judy’s already slow-down body steadily.</p><br/><p>Jin Yan sighed in relief. He then checked to see if Judy had been injured, and Leng Lingyun also helped him.</p><br/><p>Qi Aoshuang and Aosta were still in the air.</p><br/><p>Qi Aoshuang looked at Aosta and said softly, “Thanks.”</p><br/><p>“It wasn’t for you I saved her,” he said coldly and then flew down to join the crowd. Qi Aoshuang also flew down neglecting Aosta’s arrogance. She secretly sighed in her heart about the amazing power of Aosta.</p><br/><p>‘Judy, are you okay? ‘ Qi Aoshuang’s immediately asked anxiously when she landed.</p><br/><p>“She is okay, she is just tired.” Leng Lingyun whispered.</p><br/><p>Jin Yan stood by Judy’s neck and gently stroked her neck. Judy’s heavy breathing and throat were rising and falling, her eyes still closed.</p><br/><p>Qi Aoshuang gently flew over and looked at the distressed Jin Yan, “Jin Yan …”</p><br/><p>“Miss, it’s fine.” It was as if Jin Yan knew what Qi Aoshuang wanted to say and stopped her.</p><br/><p>Qi Aoshuang bit her lips and said, “You take care of Judy here, I’ll go in with them. If Chu Xin and Dong Fenghou weren’t here, it would be better if you were here. ”</p><br/><p>Jin Yan opened his mouth to say something but nothing come out of his mouth. He knew Qi Aoshuang’s thoughts. She want him to take care of Judy here. It was an excuse to stop Qiao Chuxin and Dong Fenghou … However,he could not find a reason to refute this excuse.</p><br/><p>Jin Yan finally nodded in agreement.</p><br/><p>Qi Aoshuang and Leng Lingyun flew up toward the territory of the Orc clan. Just as they were about to reach the edge of the Orc clan’s territory, a cloud of dust rose up ahead of them. A group of crowd were approaching.</p><br/>\n</div>"}