{"title": "Chapter 225", "id": 225, "volume": 3, "url": "http://boxnovel.org/stunning-edge-chapter-225", "volume_title": "Volume 3", "body": "<h1>Chapter 225</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Qi Aoshuang was speechless. She stared blankly at Camil, then looked at the Black Dragon, saying “Don’t tell me, you were the one who came up with this idea?!”</p><br/><p>“How is that possible?” Camille looked innocent and said, “This has nothing to do with me. Ben came to me on his own initiative.”</p><br/><p>Qi Aoshuang’s eyes shifted to the Black Dragon, who squinted his eyes, looking dizzy.</p><br/><p>“Who came up with the idea?” Xiao Aoshuang frowned and asked.</p><br/><p>“Me.” Ben shook its head and said with a smile.</p><br/><p>Qi Aoshuang walked closer to the Black Dragon and whispered in his ear: “Stop bullshitting, your IQ has not reached this level yet.”</p><br/><p>“Wa! You attacked me personally!” The Black Dragon was even more aggrieved than Camil.</p><br/><p>“So, who is it?” Looking at the originally erratic eyes of the Black Dragon, and thinking of how the Dragon God had taken him away, and how he was now able to appear here, a thought emerged in her mind. Could it be that the Dragon God had come up with this idea? No way! Why did he do this?</p><br/><p>“Hehe, looks like you’ve already guessed it. The old man said he liked you very much, and then, well, he didn’t like that woman. However, we will still abide by the agreement and will not act against humans, nor will we act against human buildings. We are here for sightseeing. “Half of the dragons stay here, while the others go to Ragka for sightseeing.” The Black Dragon laughed like a thief.</p><br/><p>How vicious! The Dragon God was a top-grade talent! Qi Aoshuang came to a conclusion. Just the momentum was enough to make people tremble. What need was there to move their hands? The Dragon God was too cunning. He could even name himself as a tourist. Letting the Dragon King lead a large dragon to guard Uzzari and Ragka was a disguised form of support! Such a terrifying deterrent had far exceeded the power of the Radiant Temple.</p><br/><p>“It’s much easier now, isn’t it?” Camil smiles warmly and said, “Aoshuang, you and Ben go sightseeing in Ragka.” Soon there would be a war, and Ragka and Amper Land would meet directly. Now, you can go and clear the forces of light in Ragka!”</p><br/><p>“I believe no one will have any objections.” Camil added with a smile.</p><br/><p>Cold sweat broke out on Rongzas’s forehead. In his eyes, Camil’s smile was the smile of a demon. His eyes slowly shifted to Qi Aoshuang, with his heart full of fear. Who exactly is this girl? Why were there so many people around her? Why was it that even such a powerful and terrifying power like the dragon race was standing behind her? He finally came to understand that the young lady before him had been persecuted by the Radiant Temple and Amper Land. Now, if they knew how things were going to turn out like this, would they feel regret?</p><br/><p>“Leng Lingyun, you and Aoshuang set off today. Are you clear what you are going to do?” Camil asked with a smile.</p><br/><p>“Alright.” Leng Lingyun said indifferently, “The secret records of the Radiant Temple, the records of the massacre of humans, I will write them out as soon as possible. You can take care of the rest when the time comes!”</p><br/><p>“I’ll have someone copy it and distribute it everywhere. You’d better write down the time, the address and the reason.” Camil nodded gently, with a smile as bright as a peach blossom. “I wonder how they will feel when they see this.”</p><br/><p>“Those fools wouldn’t believe it at all.” Waldo found a chance to fight Camil.</p><br/><p>“No need for them to believe. I only need them to suspect it. That’s enough. ” Camil looked at Waldo with a smile and said, “This kind of psychological warfare will never be understood by a superficial person like you.”</p><br/><p>Waldo was so angry that his teeth itched. He stared at Camil with his hands trembling, but he was unable to utter a single word.</p><br/><p>There were only a few people who understood Camil’s strategy. At this moment, Rongzas understood Camil’s plan, and he was extremely shocked. Indeed, the golden-haired, blue-eyed man in front of him was probably the person in this room who was most proficient in politics! Xiao Aoshuang was also very surprised. That is the human nature and the dark side, Camil was actually able to grasp it so clearly.</p><br/><p>“By the way, do you know who the founder of the Xilan Continent is?” Camil adjusted his smooth blond hair and asked.</p><br/><p>Qi Aoshuang’s eyes shifted to Jean’s sword. The Sword of Death! It belonged to the founder of the Xilan Continent. Back in the Devil Domain, the young master led her to an enormous underground palace. Was that the emperor’s palace? But why did Camil suddenly mention this? Jean subconsciously touched the sword he wore on his waist.</p><br/><p>“Of course I know. Emperor Leo’s a true hero. He lives in the hearts of men forever. It is he who fight for the survival of humanity. It is he who has unified the entire continent.”</p><br/><p>“Hehe, that’s right. He’s a true hero.” Camil continued, “However, do you know how he ended up?”</p><br/><p>“What do you mean?” Rongzas recognized Camille’s words.</p><br/><p>“This Emperor Leo, is the hero in everyone’s heart. However, if they were to know that their hero was being persecuted endlessly by the Radiant Temple, would they still stand firmly on their side? ” Camil said as he walked to the side of the table and gracefully poured two cups of scented tea. He handed a cup to Qi Aoshuang before picking up the other and gently drank it …</p><br/><p>Camil was in no hurry, but the people in that room were getting impatient.</p><br/><p>“The palace of Emperor Leo vanished overnight, and so did he and the eight knights who had followed him. Who did this? The Radiant Temple. They wanted to develop their own forces, and Leo was the biggest obstacle. It just happened. Everything disappeared completely in one night.” Camille sniffed his tea.</p><br/><p>As his words fell, everyone’s faces changed.</p><br/><p>“So, the legends are true. They disappeared overnight. ” The news was so shocking that he even forgot to ask Camil how he knew about it.</p><br/><p>Camil noded indifferently.</p><br/><p>“Could it be that the underground palace in the Devil Domain is really the palace of the Emperor Leo?” Qi Aoshuang murmured.</p><br/><p>“Oh, you have been there?” Camil asked. Qi Aoshuang nodded. She had been there looking for Cliff.</p><br/><p>“In the Devil Domain?!” Rongzas looked at Xiao Aoshuang in disbelief, hatred and resentment rising up in his heart. Emperor Leo was the one who ended the endless war and made the human race live a peaceful life. The later generations had speculated about many things about the mysterious disappearance of such a great hero, but no one could have guessed that the Radiant Temple was the black hand behind him.</p><br/><p>“You, how do you know all this?” Rongzas looked at Camil. How many more secrets did this man in front of him have? Rongzas did not doubt Camil’s words at all. In his eyes, there was nothing that Camil could not do.</p><br/><p>“You don’t have to know how I know. Just let it out. ” Camil smiled, “The same plan, no need for people to believe. Just make them doubt it.”</p><br/><p>Qi Aoshuang sank into deep thought. She had already confirmed the identity of those bones. That huge elegant palace, the sword in the palace, and those white bones. It sure was the palace of Emperor Leo. According to the style of the Radiant Temple, it was possible for them to do so. At that time, the royal power was like a mountain blocking the divine power.</p><br/><p>Finally, Camil had brought out all of these! Waldo patted his chest with some lingering fear. He’s a terrible man. Waldo swallowed. Luckily, this person was on their side. If he is not, the consequences would be unimaginable. Everyone in the room had the same question in their minds. “Camil, who was he? How many more secrets does he have?”</p><br/><p>“Xi Shaosi will be responsible for the work in Ragka. Distribute the information that Leng Lingyun wrote down.” Camil ordered.</p><br/><p>“Yes.” Xi Shaosi nodded solemnly, “I should make posters flying like snow, right?”</p><br/><p>“En, you are much smarter than your leader.” Camil complimented him.</p><br/><p>Waldo almost broke his teeth. He was the head of both Xi Shaosi and Xi Shaoqi. Who else could Camil be compared to? Bastard! Camil! Remember this! Of course, these words could only roar in his heart.</p><br/><p>“Alright, in order to prepare for this tense war, let’s relax and give a dinner to welcome Aoshuang. We’ll have a picnic today. ” Camil put down his cup and clapped his hands.</p><br/><p>“Where are we going for a picnic? It’s a chaos outside.” Waldo didn’t dare to say it out loud. He mumbled under his breath.</p><br/><p>“If you want to have a picnic outside, I won’t object.” A dangerous cold light shined from Camil’s beautiful pupils, making Waldo shrink his neck.</p><br/><p>“Everybody, just relax today! Sorry, I can’t accompany you. There are too many things that I need to take care of.” Rongzas said.</p><br/><p>Camil smiled and nodded.</p><br/><p>After Rongzas left, Camil magically took out a Space Transfer Scroll.</p><br/><p>“Where are we going?” Everyone was puzzled.</p><br/><p>“Come over here, this scroll can transfer as many as 25 people.” Camil beckoned to everyone. “I can’t leave her alone.” Qi Aoshuang walked over with the Treasure Cat in her arms.</p><br/><p>“Isn’t it a picnic? Aren’t you preparing something?” Waldo asked, frowning.</p><br/><p>“They’re ready.” “Camil opened the scroll. An intense white light flashed and everyone in the room disappeared.</p><br/><p>When Qi Aoshuang opened her eyes, she saw a face that was so familiar that it couldn’t be any more familiar.</p><br/><p>His handsome face was full of surprise, ecstasy, and excitement. It was Feng Yixuan! They were at the Wind Island now!</p><br/>\n</div>"}