{"title": "Chapter 221", "id": 221, "volume": 3, "url": "http://boxnovel.org/stunning-edge-chapter-221", "volume_title": "Volume 3", "body": "<h1>Chapter 221</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Stunning Edge – C221</p><br/><p>The sword came to a stop an inch from Qi Aoshuang’s throat. Qi Aoshuang continued looking at the astonished woman in red with an expressionless face.</p><br/><p>The woman in red took the sword back. After standing still, she asked curiously, “Why did you kill the three people in front of you without dodging my attack?”</p><br/><p>“The first two are my enemies. Even if it’s an illusion, I won’t be merciful.” Qi Aoshuang said passively.</p><br/><p>“What about the third person? It’s not your enemy anymore, is it?” The woman in red frowned as she asked this question. Her heart was filled with doubt.</p><br/><p>“I don’t like him. It’s that simple.” Qi Aoshuang said indifferently.</p><br/><p>Eh? The woman in red was stunned by Qi Aoshuang’s honest words. She then asked anxiously, “Then why didn’t you dodge my attack and instead of attacking me?”</p><br/><p>“Because I want your power, I cannot offend you!” Qi Aoshuang’s words were even more straightforward.</p><br/><p>The woman in red’s heart was already spurting blood. However, she forcefully held it in on the surface.</p><br/><p>“You, you really are an interesting person, very honest.” The woman in red smiled, “I’ll give you the core of fire this time.”</p><br/><p>After the woman in red finished speaking, she disappeared.</p><br/><p>As for Qi Aoshuang, she returned to reality once again. Before her eyes was a bright red crystal cliff face, and she was still floating in mid-air. She slowly lowered her head and saw a fiery red line quickly extending from her palm to her arm. The core of fire had disappeared. Her entire body felt totally comfortable.</p><br/><p>“Yo, little brat, your luck is pretty good. You actually absorbed all the power of the fire.” The man looked at QI Aoshuang who was floating in the air and spoke while narrowing his eyes. “The Core of the Fire has been formed for 500 years, and not everyone can completely absorb it. If the soul of the fire is not satisfied, the only thing that can be obtained is a crystal without any power, and a better one can absorb 70%.” This little brat was actually able to absorb all of it. “Could it be that the Core of the Fire is a man? Did she seduce him?”</p><br/><p>“Meow!” The Fortune Cat mewled unhappily.</p><br/><p>“I was joking. Ah Bao, look, she’s still just a little brat. Which blind man would fall for her?” The man laughed.</p><br/><p>“Achoo!” “Far away in Ragka, Feng Yixuan ferociously sneezed.</p><br/><p>“Young master, What’s wrong? Have you caught a cold?” The people beside him asked with concern.</p><br/><p>“Nope.” Feng Yixuan shook his head and then stared viciously at the sky. “I wonder which bastard is speaking ill of me.”</p><br/><p>“Achoo!”</p><br/><p>“Achoo!”</p><br/><p>Feng Yixuan wasn’t the only one who sneezed …</p><br/><p>White Emperor and Black Feather’s hearts were at ease when they heard the man’s words. It looked like this time, Qi Aoshuang could successfully absorb the power of the Core of Fire. She would be able to raise her strength to a higher level.</p><br/><p>As for Qi Aoshuang, she was still feeling the burning sensation surging through her body.</p><br/><p>Hot, very hot, very hot…</p><br/><p>Qi Aoshuang slowly frowned.</p><br/><p>Her body felt like it was on fire.</p><br/><p>“It can’t be?” The man looked at the still floating Qi Aoshuang and twitched his mouth. “Huo Hun actually likes her so much? Huo Hun is definitely a man!”</p><br/><p>White Emperor and Black Feather didn’t know what was going on. They anxiously looked at Qi Aoshuang floating in the air, while their ears pricked up to listen to the man’s next words. It was not bad to have a treasure cat. In order to make the kitten happy, the man explained Qi Aoshuang’s situation in detail.</p><br/><p>“Look, Ah Bao, is the color of the flames on the little brat changing?” The man placed the Fortune Cat on his shoulder. The cat widened its amber eyes as it watched the changes on Qi Aoshuang’s body.</p><br/><p>The flames changed from red to gold, then white, then navy, then blue. “Meow?” The Fortune Cat stared blankly at the flames on Qi Aoshuang’s body. It turned black in the end.</p><br/><p>“The King of Flame has come out!” The man slightly raised his eyebrows. Although he did not care about these things, they were all different for the little brat!</p><br/><p>The King of Flame!!!</p><br/><p>White Emperor and Black Feather looked at each other in horror.</p><br/><p>What many people didn’t know was that flames also had a king.</p><br/><p>The black flame was the king of flame. When the other colors of the flame met the black one, it was not an attack, but a worship. If two Flame Mages were to fight, the person who possessed the King of Flame would positively win because no one would challenge him.</p><br/><p>“Is the King of Flame very powerful?” Black Feather asked in a low voice.</p><br/><p>“No.” The man squinted his eyes and smiled, “It never do anyone any harm. ”</p><br/><p>“What?” Black Feather was confused, and White Emperor also frowned slightly. They had heard of the King of Flame before, but had never actually seen one before.</p><br/><p>“The King of Flame doesn’t have any attack power at all,” the man squinted his eyes and smiled, “But every other flame has to bow to him and dodge him.”</p><br/><p>Ah? White Emperor and Black Feather’s mouth slightly twitched.</p><br/><p>“A King doesn’t need to do anything.”</p><br/><p>Just as the man was excitedly explaining, a shocking change happened to Qi Aoshuang.</p><br/><p>A long sigh came out of Qi Aoshuang’s mouth, as if it came from the distant horizon, causing people’s hearts to be deeply shocked.</p><br/><p>Qi Aoshuang’s entire body was enveloped in a golden flame, and on her back was a pair of golden flaming wings. Her eyes were completely empty. Her black hair suddenly grew longer in an instant before reaching her ankles. After that, it began to wildly flutter about.</p><br/><p>“Oh? It’s interesting. “The man said.</p><br/><p>Woosh!</p><br/><p>Qi Aoshuang slowly turned around, looking at the few people below with an indifferent expression.</p><br/><p>Under everyone’s astonished gazes, the wings on Qi Aoshuang’s back grew bigger and the color changed.</p><br/><p>In the blink of an eye, the wings on her back turned black, and their length also tripled. The flames covering her body also turned from gold to black.</p><br/><p>Black hair, black eyes, black wings, black flames.</p><br/><p>It was an extremely beautiful, breathtaking beauty.</p><br/><p>White Emperor suddenly sensed the abnormality in his surroundings. The surroundings had been scorching hot magical essence, but now the red color of the canyon was fading, or more accurately speaking, it was all gathering towards the direction of Qi Aoshuang.</p><br/><p>The heat under their feet slowly disappeared, and the red ground under their feet gradually returned to its original color. The red color of the flowers, plants, and small animals slowly faded.</p><br/><p>Mad elemental undulations, immense power, and boundless energy flooded towards Qi Aoshuang like a flood breaking through a dam.</p><br/><p>She slowly descended and stretched out her arms. She raised her head and closed her eyes. A red pillar of light suddenly appeared in front of her, dyeing half the sky red immediately. The pillar of light gathered together and flew above Qi Aoshuang’s head before pouring down. As soon as it fell down on Qi Aoshuang’s body, it disappeared completely, fusing together with her.</p><br/><p>White Emperor and Black Feather stared at the scene in front of them in surprise. The Treasure Cat didn’t even blink.</p><br/><p>It became cool around, and all the redness faded away. Only the crystal cliff face at the end of the ravine was still red, but its color was much lighter.</p><br/><p>Qi Aoshuang gave a slight sigh of relief. At this moment, it felt like ten thousand horses were galloping forward and a raging storm was brewing inside her body.</p><br/><p>The black flame covering her body slowly retreated, and her wings slowly retracted.</p><br/><p>She suddenly opened her eyes, frowned and said in a low voice, “Advanced!”</p><br/><p>All she could do was to wait quietly.</p><br/><p>Suddenly, a puzzled voice came from the sky, “Eh, where is the Core of Fire?”</p><br/><p>Qi Aoshuang looked up and saw a woman dressed in fiery red clothes floating. The woman was beautiful, but her blood-red lips and exaggerated hair ornaments looked weird. The large jeweled bracelets and necklaces made her too flashy. Huo Hun was also dressed in red. But they are essentially different in temperament.</p><br/><p>The woman in red noticed Qi Aoshuang. She slowly flew in front of her, raising her chin and disdainfully asked, “Hey, do you know who took the Core of Fire?”</p><br/><p>Qi Aoshuang did not answer. She coldly stared at the red monkey fart in front of her. She had to admit that she was still no match for her opponent. There was an extremely berserk elemental wave coming from the woman in red. The fire elementals circled around her in an exaggerated manner. Why did someone with such strength still want to find the Core of Fire?</p><br/><p>“I’m asking you something, you don’t understand, do you?” the woman felt despised. She pointed a finger at Qi Aoshuang’s nose and shouted angrily.</p><br/><p>“Meow!” The Treasure Cat in Qi Aoshuang’s arms reached out its paws rapidly towards the woman in red.</p><br/><p>“Ahhh!” The woman in red screamed and quickly withdrew her hand. A few bloody wounds had already appeared on the back of her hand, and blood was oozing out.</p><br/><p>“Little bastard!” The woman in red roared and was about to attack, but she swallowed the words when she saw the Treasure Cat’s look in Qi Aoshuang’s arms. The woman quickly took a few steps back as if she had seen a ghost, and her words was no longer arrogant, “Why is she here? What’s going on?”</p><br/>\n</div>"}