{"title": "Chapter 222", "id": 222, "volume": 3, "url": "http://boxnovel.org/stunning-edge-chapter-222", "volume_title": "Volume 3", "body": "<h1>Chapter 222</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>C222</p><br/><p>Qi Aoshuang was stunned, looking curiously at the Fortune Cat who was rubbing its paws on her clothes, feeling that it was a little dirty to grab that woman in red’s hands, and was wiping its paws on Qi Aoshuang’s clothes. Qi Aoshuang looked at the flustered woman in red, then at the Fortune Cat in her arms. Was she afraid of Ah Bao or that man behind Ah Bao?</p><br/><p>“What does it have to do with you?” Qi Aoshuang rubbed the little head of the Fortune Cat and coldly spat out a sentence at the woman in red. She understood that she was no match for her. Moreover, White Emperor and Black Feather didn’t seem to have woken up yet. So, it wasn’t wise to fight against her. Naturally, the best way was to make the opponent confused.</p><br/><p>“He, he’s here too?” The woman in red looked around in panic, but all she saw was White Emperor and Black Feather. She did not dare to act rashly. Based on that person’s strength, as long as he didn’t want others to see him, others wouldn’t be able to detect it.</p><br/><p>Now Qi Aoshuang understood who the woman in red was referring to. It must be Heaven Breaker. Who would have thought that Heaven Breaker would have such influence? Just what kind of status did he have in this world?</p><br/><p>“What does he have to do with you?!” Qi Aoshuang gave a cold humph.</p><br/><p>The woman in red bit her lips and looked at the faint color of the crystal cliff face and the completely faded red valley. Her face was unsettled, as if she was thinking of something.</p><br/><p>Qi Aoshuang did not move, still maintaining her composure.</p><br/><p>“Hmph! You’re lucky!” The woman in red narrowed her eyes at Qi Aoshuang before flying into the air and leaving quickly.</p><br/><p>Finally, she left. Qi Aoshuang breathed a sigh of relief. The woman in red’s strength was extraordinary, yet she was so afraid of Heaven Breaker. This world was truly unfathomable.</p><br/><p>Qi Aoshuang patiently waited for White Emperor and Black Feather to release their seals. As soon as they were released, she would immediately chant the spell, letting Camil bring them out safely.</p><br/><p>After a long time, the fog surrounding White Emperor and Black Feather slowly disappeared. When the two of them opened their eyes, they were both sharp and threatening. Qi Aoshuang could sense that they had undergone a tremendous change.</p><br/><p>White Emperor and Black Feather both walked towards Qi Aoshuang. They spoke at the same time, “The seal has been lifted.”</p><br/><p>“Now can you tell me your true identities?” Qi Aoshuang tilted her head and looked at the two who had recovered their strength. She knew they had changed but she couldn’t tell what exactly it was.</p><br/><p>“Just like Heaven Breaker said, we came from the Demon Sector.” White Emperor said in a deep voice.</p><br/><p>“However, we are not a high-level demon clan. “Black Feather spat disdainfully.” “We are generals.”</p><br/><p>“What?” Qi Aoshuang was at a loss.</p><br/><p>“The Demon World is also divided into levels,” White Emperor explained, “The demon clan, high-level demon clan, demon general, demon lord, demon king, and great demon king.”</p><br/><p>“We are the left and right arms of the Great Demon King, the two generals by his side.” Black Feather snorted. “Forget it, what’s the use of saying such trivial things in the past?” Black Feather stopped here. It seemed like what happened afterwards wasn’t a good memory.</p><br/><p>However, Qi Aoshuang understood a lot from these words. It turned out that their identities were actually so noble. They were two generals just because they didn’t want to be the Great Demon King?!</p><br/><p>“Alright, let’s go back. This time, nothing is suspenseful.” White Emperor said in a deep voice.</p><br/><p>“No shit. The Radiant Temple has nothing left.” A bloodthirsty light flashed in Black Feather’s eyes.</p><br/><p>“Well, I’ll have Camille pick us up.” Qi Aoshuang nodded, and was about to chant an incantation. However, a sharp piercing sound came from the sky.</p><br/><p>Du, du, du!</p><br/><p>Three fiery arrows were nailed to the ground beside Qi Aoshuang’s feet. The nearest leg was a centimeter away from her feet.</p><br/><p>White Emperor and Black Feather’s faces darkened as they looked towards the sky.</p><br/><p>Qi Aoshuang frowned as she looked up, only to see the lady returning. She was holding a huge bow and arrow that was emitting flames, and it was actually a flame.</p><br/><p>“Leave the Treasure Cat here or I’ll kill you.” The woman in red sneered as she arrogantly shouted. It turned out she hadn’t gone too far away. She’d been observing to see if Heaven Breaker was nearby. He didn’t show up. This was too unusual. Heaven Breaker was extremely fond of his Treasure Cat, but he wasn’t here. There must be a reason. No matter what, she could snatch away the Treasure Cat first, then use it to find some treasures. She didn’t know these people’s relationship with Heaven Breaker, so she should try her best not to hurt them. If Heaven Breaker showed up, she could just give the cat back to him, explaining that she took the cat from those people out of kindness. He would spare her for her master’s sake. But the Treasure Car was truly in the girl’s arms, not theirs. Thinking over and over, the woman in red finally decided to give priority to threats.</p><br/><p>“Ah Bao hates you.” Qi Aoshuang laughed coldly and spat out these words.</p><br/><p>“Do you want to die?” The woman in red was infuriated, and her eyes couldn’t help but land on the back of her hands scratched by the Treasure Cat’s claws. The wound had already disappeared, but the burning pain was still vivid in her mind.</p><br/><p>She still didn’t make a move. The relationship between Heaven Breaker and the girl who could make the Treasure Cat stay so quiet in her arms should not be shallow. Killing people for treasures, this could only be done to those who had no power or influence. However, this black-haired girl in front of her was impossible to see through, so she didn’t dare to rashly attack.</p><br/><p>Xiao Aoshuang didn’t want to stay in this world any longer. She started chanting the spell that Camil told her.</p><br/><p>Very quickly, a faint light appeared in front of Qi Aoshuang.</p><br/><p>“The Space Gate!” The woman in red’s complexion changed. Now she was even more certain that these people weren’t from the Chaos World! They want to take away the Treasure Cat?! The woman in red couldn’t care about anything else. She only had one thought in her mind. A rare divine animal like the Treasure Cat absolutely couldn’t be taken away!</p><br/><p>“Let’s go.” “Qi Aoshuang took the lead and walked into the circle of light.</p><br/><p>“You’re not allowed to leave!” The woman in red shouted angrily, and the bow in her hands was already released with full force.</p><br/><p>With a flick of his finger, White Emperor appeared behind them, easily blocking the incoming fiery arrow. He disappeared into the circle of light.</p><br/><p>“Tch!” Black Feather laughed sinisterly. Although the people in this world were very powerful, it didn’t mean that everyone was stronger than them. The woman in red in front of him should be one of the lowest of the bunch. Black Feather’s eyes turned cold, and he turned to face the floating woman in red. He wasn’t as easy to deal with as White Emperor. A huge pitch-black sickle appeared in his hand. If Qi Aoshuang saw this, she would definitely be shocked. Why did Black Feather’s weapon look so much like the scythe of the legendary Grim Reaper! The massive sickle in Black Feather’s hand exuded a cold aura of death. As the woman in red stood there stunned, Black Feather raised his massive black sickle and lightly waved it. An invisible force cut through the air, directly attacking the woman in red. Black Feather let out a cold laugh and no longer looked at the woman in red. He lowered his head and disappeared into the light. The light also slowly disappeared.</p><br/><p>In midair, the woman in red hurriedly raised the bow in her hands to block this terrifying power.</p><br/><p>With a cracking sound, the arrow in the woman in red’s hand was split in half. In the next moment, she was cut into two halves. The fresh blood that filled the sky was drained away. The woman in red’s body fell down.</p><br/><p>That body didn’t fall to the ground, but was firmly held by a distant light.</p><br/><p>“Master …!” The woman in red did not immediately die. She weakly called out two words. However, her heart was at ease. It seemed that she had been saved. Her last thought before she lost consciousness was revenge! After deeply engraving the faces of Qi Aoshuang and the rest into her mind, she fainted.</p><br/><p>By this time, Qi Aoshuang and the rest had already left the Space Gate, and the moment they came out, they saw the smiling Camil.</p><br/><p>“Where is this?” Xiao Aoshuang looked around curiously. They were in an unusually luxurious big bedroom. The curtains were drawn tightly. The carved four-poster bed, the floor covered with a fine carpet, and the ceiling hung with expensive crystal lamps.</p><br/><p>“This is the palace of Uzzari.” Camil replied with a smile. He looked at White Emperor and Black Feather behind Qi Aoshuang without the slightest bit of surprise. With a gentle smile, he said, “White Emperor, Black Feather, congratulations on unlocking your seal.”</p><br/><p>“You can tell that we were sealed before? Who the hell are you?” White Emperor slightly frowned and asked in a serious tone.</p><br/><p>“Yes, I can tell. You don’t have to know who I am, and now is not the time to tell you. In short, you only need to know that I will not harm my Little Aoshuang. ” Camille reached out a hand, smiling, and rubbed the side of Aoshuang’s head. “Hair’s so long, it’s already dragging on the floor. It should be a side effect of fusing with the Core of Fire. Come, let me help you cultivate.”</p><br/>\n</div>"}