{"title": "Chapter 257", "id": 257, "volume": 3, "url": "http://boxnovel.org/stunning-edge-chapter-257", "volume_title": "Volume 3", "body": "<h1>Chapter 257</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Stunning Edge – C257</p><br/><p>The disciples of the participating sects were all gathered at the foot of the mountain. They had all set up tents here and were waiting to participate in the assessment. At that time, the examiners who were to be introduced would come out and announce the questions. As for the disciples of the various sects, they all had their tents encircled by different sized circles.</p><br/><p>“That man was chosen by the Great Elder. Hmph!” I don’t see what’s so special about it. “A pretty boy.” The 12 disciples of the Tian Dao Sect were gathered together in a pile, sitting around the bonfire for dinner. A sharp looking male disciple’s eyes flashed with a cold light. He glanced at Qi Ao Shuang who was sitting under a tree not far away and said in a strange manner. When the other disciples heard this, not only did they not show any intention of stopping him, but they also revealed a trace of excitement and eagerness. Everyone looked at Qi Ao Shuang unhappily. If he could take advantage of this opportunity to teach this red-haired kid a lesson, that would be for the best.</p><br/><p>This disciple’s voice was not loud, but it was just enough for Qi Ao Shuang to hear.</p><br/><p>“Alright!” “Jack Lin, the Grand Elder naturally has his reasons.” A beautiful lady with bright eyes and white teeth shouted in a low voice, stopping the provocation of this Jacklin. She was the disciple Tarina, the leader of this group. She was the first to enter the sect, and her power was also the strongest. All the disciples called her Senior Sister.</p><br/><p>She naturally understood the unhappiness in the hearts of her juniors. The new disciple hadn’t even said a word to them. Many disciples dreamed of coming to participate in this assessment, but the Great Elder forcefully put him in. Many people were dissatisfied and jealous, thinking that he relied on his skirmish to participate in this precious examination. And Jack Lin, this reckless junior brother, clearly wanted to provoke the new disciple and take this opportunity to teach him a lesson.</p><br/><p>However, to their surprise, the red-haired figure sitting quietly under the tree continued to sit there with a calm expression, as if she had not heard the conversation that had just occurred.</p><br/><p>Hearing Tanina’s reprimand, Jack saw that Qi Ao Shuang was not paying attention to him and curled her lips in dissatisfaction. However, she said in a low voice, “Great Elder, please accept a disciple of unknown origin. I hope you will not embarrass our Heavenly Dao Sect during the examination.” If we lose the face of the Tian Dao Sect, then the consequences … “Hmph!” The last sentence was a deep and cold snort, containing a message that everyone understood.</p><br/><p>“Enough!” Seeing that Jack still hadn’t stopped, she scolded him with a deep frown and some impatience. She said in a deep voice, “Could it be that you all forgot about Great Elder Artis’ true strength?” Did you forget why he became a Great Elder in our Tian Dao Sect? “Have you forgotten his true identity?”</p><br/><p>Hearing Tanina’s harsh rebuke, Jacklin’s expression changed in an instant. That’s right, how could he have forgotten that person’s true identity and strength? Jack could not help but gasp in his heart. He sat quietly by the side, not saying a word. The expressions of the others changed slightly as they recalled that person’s extraordinary status and strength. Even the head of the sect couldn’t afford to offend Great Elder Artis, let alone a little disciple like him!</p><br/><p>The expressions of everyone changed slightly. Then, they tacitly changed the topic and started to chat. However, he was still unhappy. The more the red-haired kid saw, the more annoyed he got. Jacklin’s eyes were gloomy. He thought to himself, “When I have the chance, I will teach that kid a lesson and make him suffer a little!”</p><br/><p>However, Tanina’s gaze fell on the youth sitting under the tree.</p><br/><p>His long, soft red hair was carelessly tied up, messily draped over his shoulders and back. A slight breeze blew by, and an indescribable sadness filled the air around him. His handsome face had a calm expression that did not match his age, and his deep black eyes were like vortexes that could suck people in. Her thin lips were tightly shut, and she didn’t speak to anyone. His dark clothes made him seem mysterious and sad. The strangest thing was that there were two purple crystal earrings on his right earlobe. Under the moonlight, there was a faint violet glow.</p><br/><p>He just sat there quietly, his entire body emitting a cold radiance, making it hard for people to look at him, but at the same time, it was also hard for them to look away. The feeling of contradiction was very strange.</p><br/><p>Why did she always feel that there was a faint sadness between his brows?</p><br/><p>What sort of story did he have?</p><br/><p>Talena didn’t realize that for the first time, she, who had no feelings for relationships between men and women, was interested in the opposite sex and wanted to know the story behind that youth.</p><br/><p>Qi Ao Shuang closed her eyes, allowing the breeze to caress her face and her hair. Everything in the outside world wasn’t that important. She only had one goal …</p><br/><p>When did the Star Academy’s assessment begin?</p><br/><p>Artis, the handsome, flirtatious man with the peach blossom eyes, had reminded them that there would be an Emissary who would guide them through the examination, and repeatedly reminded them that the Star Academy’s assessment exam was not so simple, it could even be brutal! Because there were indeed disciples who had lost their lives in this kind of test. The questions were different every year. But, after so long, why hasn’t the Emissary appeared yet?</p><br/><p>Xiao Ao Shuang was quietly leaning against the tree. Suddenly, a strange feeling came from the calm air.</p><br/><p>The smell of the wind had changed …</p><br/><p>Qi Ao Shuang opened her eyes.</p><br/><p>However, Qi Ao Shuang was not the only one who noticed the abnormality. After all, the people here were the elites of the sects. Some people immediately looked around vigilantly.</p><br/><p>Before he could warn them, the next moment, in the blink of an eye, the air became extremely foul. Dark clouds suddenly covered the sky, but this was only the place where they had set up their camp.</p><br/><p>The crashing sound was extremely ear-piercing in the quiet night.</p><br/><p>A gust of wind blew from above his head, mixed with the sound of water splashing. Incomparable swift and fierce!</p><br/><p>Is it raining?</p><br/><p>That’s not right!</p><br/><p>Qi Ao Shuang’s pupils dilated. Without any hesitation, she immediately flicked her finger and a transparent barrier appeared above her head.</p><br/><p>Following that, the sizzling sound continued and the barrier was immediately corroded!</p><br/><p>This “rain” had such a strong corrosive effect. Unexpectedly.</p><br/><p>At this moment, a miserable scream rang out. It was obvious that someone had been injured by the strange “rain”. The sounds of alert rang nonstop.</p><br/><p>Qi Ao Shuang narrowed her eyes. She gathered her strength and a transparent wind covered her entire body. The wind continued to whirl up and down, wrapping up Qi Ao Shuang as if it was alive. It pushed away all the falling “rain” and did not let a drop of “rain” in.</p><br/><p>Some of the people on Talina’s side were in a flurry. Tara calmly formed a barrier that enveloped everyone within, but to their astonishment, the barrier was immediately corroded and began to continuously form. As for the other disciples, they also continuously formed barriers to prevent the strange “rain.” “Rainwater” was unceasingly eroding the Spirit Formation they formed. They kept on creating more Spirit Formations, so naturally, the space they were in was getting smaller and smaller. The crowd was in a miserable state. In his heart, he was even more terrified of this incomparably strange ‘rain’ actually possessing such a terrifying corrosive power.</p><br/><p>Just as they were about to run out of space to dodge, the strange “rain” finally stopped.</p><br/><p>Qi Ao Shuang concentrated, and the wind around her gently dissipated. She looked up at the chaotic scene in front of her, deep in thought. The Star Academy was an existence that stood at the highest designated spot in this world. Would anyone sneak attack them at the entrance of the Academy? It was obviously not reasonable, unless …</p><br/><p>While Xiao Ao Shuang was deep in thought, Ta Lina’s gaze landed on her. After recovering her senses, her first reaction was to look in her direction. When she saw that Qi Ao Shuang’s face was calm and without any signs of injury, she heaved a sigh of relief. In his heart, he marveled at this youth’s extraordinary reaction and strength. She didn’t even realize why her first reaction was this, and why she didn’t care about her juniors around her.</p><br/><p>Talena looked around. The “rain” was strange and corrosive. Some people didn’t react immediately, and when they were hit by the “rain” and fell on their bodies, their skin and flesh were split open as they screamed. There were even some people who had been corroded to the point that they had seen the bones. Naturally, there was no need to mention the pain. As for their hurried reactions, they were only able to form Spirit Formations to block it. Thus, they were also in a sorry state. As for the youth, he stood there with a calm expression, unharmed.</p><br/><p>How could this calm and composed person be the pretty boy that Jack Lin spoke of?</p><br/><p>Ta Lina was currently looking at the calm youth. The youth seemed to sense her gaze and glanced over, then turned his head to ignore her.</p><br/><p>Startled, she immediately retracted her gaze. Seeing his juniors in such a sorry state, he asked about the situation of the crowd with deep concern. Fortunately, no one was injured.</p><br/><p>“What’s going on?!” Such a thing actually happened in front of the school gates. Who dares to sneak attack here!? ” Jack cursed as he vented the dissatisfaction in his heart. In his heart, he viciously thought that those who dared to launch a sneak attack here would definitely be torn to shreds by the Star Academy!</p><br/><p>“Jacklin, don’t talk nonsense.” Do you think anyone would dare to sneak up on us at this moment? ” Tanina’s thoughts were really exquisite, and she instantly guessed that possibility. He reprimanded Jacklin for his words. If she didn’t stop him now, she wouldn’t know how laughable his words would be.</p><br/><p>Just as the entire area was in a state of chaos, a white light suddenly appeared at the foot of the stairs, immediately forming a white door. He could vaguely see the figure from within.</p><br/><p>A spatial passageway?! The open space was in an uproar!</p><br/><p>Slowly, three people walked out of the door. The three of them were all wearing the same style of snow-white clothes. There was not a single speck of dust on their clothes. There were two males and one female. Those with sharp eyes had already seen the sign on the front of their clothes. All three of them had eight small golden stars embroidered on their chests! This was a symbol of the strength of someone who had reached the eighth level of the Heavenly Star Tower!</p><br/><p>Everyone was in an uproar!</p><br/><p>The experts of the Star Academy were truly terrifying.</p><br/><p>First through the spatial passageway, then by the appearance of a person with such terrifying power. Are they here as guides?</p><br/><p>Aren’t you being a little overboard?</p><br/><p>One had to know that no one had reached the ninth floor, and the most powerful was only at the eighth floor.</p><br/><p>In other words, the ones who had come to welcome them were the strongest students in the academy.</p><br/><p>The man in the lead had an extraordinary appearance. His handsome face had a perfect nose bridge and a pair of jade-like eyebrows. His pair of black and white eyes seemed to radiate a faint blue light. He just stood there silently, as if standing at the highest point, looking down on all living things. His calm face, however, gave off a sense of oppression. Even though he was standing not too far away, he gave off the feeling that he was very, very far away, so far away that he couldn’t touch him.</p><br/><p>On his left and right, there was a man and a woman. They were both extraordinarily good-looking and had an extraordinary temperament. The man on the left was slightly younger than him. He had black hair with amber eyes, a handsome face with soft lines. There was always a sunny smile on his face, and his eyes even contained a smile. It gave off a very close feeling. The girl on the right, however, had an icy expression. Golden hair, blue eyes. There was no expression on her beautiful face or any warmth in her eyes. It was precisely this ice-cold temperament that attracted the attention of many men. For ice-cold beauties, a man would always feel a sense of accomplishment if he were to succeed in conquering them. And this woman just so happened to be the type of woman who let men have this sort of lust.</p><br/><p>For a moment, the gazes of many men rested on the cold girl.</p><br/><p>“Everyone, the first round of the examination is over.” The white-clothed man in the lead slowly opened his mouth. His clear and cold voice was like a clear spring at night.</p><br/><p>The audience was in an uproar.</p><br/><p>The first round of examinations had ended? When did it start?</p><br/><p>Qi Ao Shuang’s eyes flashed with understanding.</p><br/><p>Indeed, the strange “rain” from before was the first round.</p><br/><p>With the Star Academy’s current strength and influence, as well as the fact that they were the cream of the crop in the sects, who would sneak attack them without knowing what was good for them?</p><br/><p>However, there were still some who remained calm. It was obvious that these people had the same thoughts as Qi Ao Shuang. The “rainwater” from before was the first round of tests.</p><br/><p>“Now, please leave this place immediately.” “You’ve already been eliminated.” The white-clothed man in the lead was still the same cold and emotionless voice.</p><br/><p>There were discussions below. Disappointment and unwillingness had already appeared on some people’s faces. However, no one dared to object.</p><br/><p>Because the Star Academy was an absolute authority.</p><br/><p>Jacklin patted his chest and looked at her with admiration. In his heart, he was glad that his senior sister had stopped his idiotic actions. Otherwise, he would really have lost a great deal of face!</p><br/><p>The crowd did not dare to object, but that did not mean that the unwilling disciples would not say anything unnecessary to alleviate the unwillingness and unhappiness in their hearts.</p><br/><p>“At least you want us to know who you are?” Such a voice came from the crowd. It was a tone of dissatisfaction and unwillingness, but also a hint of provocation. As for the target, it was naturally the white-clothed man with an extraordinary disposition.</p><br/><p>If he couldn’t make a move, wouldn’t he allow them to take advantage of him?</p><br/>\n</div>"}