{"title": "Chapter 255", "id": 255, "volume": 3, "url": "http://boxnovel.org/stunning-edge-chapter-255", "volume_title": "Volume 3", "body": "<h1>Chapter 255</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Stunning Edge – C255</strong></p><br/><p>“Wang!”</p><br/><p>“Wang!” “King!”</p><br/><p>“Wang!”</p><br/><p>A deafening cheer resounded through the sky as the demons screamed with all their might.</p><br/><p>In the square in front of the palace, a long staircase led to the highest terrace. There, the new Infernal King of the Infernal Realm would be crowned and become the real Infernal King.</p><br/><p>The plaza was surrounded by excited demons. The Demon Generals calmly stood at the forefront, awaiting the coronation ceremony. The new Infernal King had accepted the layers of tests and had defeated them all, making them submit wholeheartedly.</p><br/><p>The Demon Generals standing at the very front still had lingering fears. That person had been missing for such a long time, but his strength was still as terrifying as ever. No, it was even greater. They were mercilessly defeated one by one.</p><br/><p>He seemed different from before …</p><br/><p>What’s different?</p><br/><p>In the past, there was nothing in his eyes. Defeating them also seems to be an arbitrary process. But now, it was as if he had a purpose.</p><br/><p>Could it be that it was really like the rumors said, he was doing this for a human?</p><br/><p>For a mere human?</p><br/><p>Is that possible?</p><br/><p>The grand trumpet sounded, and the coronation was about to begin.</p><br/><p>The little devil Ladiya stood at the stairs expressionlessly, her cold eyes swept across the crowd. Everyone only felt a sense of oppression. Seeing how she faked her death and how the flower blossomed and withered the little devil, only he was able to stop her. Even the Infernal King was helpless against her; it was truly unbelievable.</p><br/><p>The horn stopped and the protagonist of the ceremony appeared.</p><br/><p>Feng Yixuan’s fiery red hair gently fell behind him, straight to his heels, just like the most gorgeous red clouds in the evening. She was dressed in a dark and elegant dress, and her clothes were inlaid with a dazzling and luxurious golden border. The dazzling golden buttons on her shoulders were connected to a black cloak that gently fluttered in the wind behind her. Her incomparably exquisite face was cold, and her eyes no longer had a trace of emotion.</p><br/><p>Under the gazes of tens of thousands of people, Feng Yixuan slowly walked towards the long staircase.</p><br/><p>“Brother…” Lydia called softly.</p><br/><p>Feng Yixuan paused slightly.</p><br/><p>“Brother, don’t you regret it?” Ladia’s mind was full of thoughts. She hated Qi Ao Shuang, hated that human girl to death, if it wasn’t for that girl. How did her most respected and favorite brother end up on this path? Why would he be willing to do the thing he didn’t like the most? Although she didn’t want her brother to be with that human, at this moment, Ladia felt even worse.</p><br/><p>Feng Yixuan only faintly smiled and said in a low voice, “Do you think I will regret this?”</p><br/><p>After Feng Yixuan finished speaking, he strode forward and slowly ascended the first step of the staircase.</p><br/><p>He knew that if he took this first step, it would be impossible for him to be with her again.</p><br/><p>That’s the best way, isn’t it?</p><br/><p>The end of the Holy War, he would never launch it again in his lifetime as the Infernal King.</p><br/><p>As for the curse on his body, it wouldn’t come true.</p><br/><p>Not to hurt her.</p><br/><p>“Brother…” “Stop!” Rodya called out from behind her, his eyes filled with bitterness.</p><br/><p>However, Feng Yixuan didn’t stop and continued walking towards the highest point.</p><br/><p>On the high platform, Demon King Ka Di Ao smiled. Ka Di Ao’s handsome face was full of a sinister smile. At this moment, he was dressed in fine clothes. His son, whom he was proud of, finally returned. He was walking towards him step by step.</p><br/><p>The valet next to Cadio was carrying an exquisite tray with a splendid crown on it.</p><br/><p>Feng Yixuan slowly walked in front of Ka Di Ao, who smiled.</p><br/><p>Feng Yixuan didn’t listen to any of the long and drawn-out oaths. In front of his eyes, his mind was only focused on the bright face.</p><br/><p>Remembering their first meeting, she stomped her feet on the ground.</p><br/><p>Remembering the first time she broke into her tent and saw the beautiful spring sunshine. Then, he viciously punched his own eyes.</p><br/><p>Thinking of how helpless she was, she lost her wits in his arms.</p><br/><p>….</p><br/><p>Was she alright now?</p><br/><p>“…” “For the sake of King Ren.” When the long, drawn-out vows were over, Ka Di’o held up the splendid crown, held it high in the air, and the crown shone brightly in the sunlight … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … …</p><br/><p>Wang…</p><br/><p>He was about to become the Infernal King …</p><br/><p>In this life, he would never have anything to do with her again ….</p><br/><p>Feng Yixuan slowly closed his eyes, waiting for the crown to be placed on his head.</p><br/><p>Slowly, Ka Di Ao smiled as he slowly placed the crown on Feng Yi Xuan’s head.</p><br/><p>However, just as the crown was about to be put on, a blinding white light suddenly burst from the high platform, causing everyone to involuntarily narrow their eyes.</p><br/><p>Ka Di Ao frowned. The crown in his hand froze for a moment, but he did not put it on.</p><br/><p>The white light disappeared, and the two figures standing on the stage were Qi Ao Shuang and Leng Lingyun.</p><br/><p>Feng Yixuan stood up in shock as he stared at the person before him. His heart almost stopped. He didn’t believe what he was seeing.</p><br/><p>Was it her?</p><br/><p>Could it be her?</p><br/><p>Was it really her?</p><br/><p>“There’s no need to doubt it. It’s Ao Shuang.” Leng Lingyun’s voice coldly sounded.</p><br/><p>“Ao Shuang!” “You, why did you come?” Feng Yixuan finally regained his senses and looked at the person standing in front of him. Surprise flooded him.</p><br/><p>“I, I came to find you.” All I know is, you can’t just disappear into my life. ” Qi Ao Shuang looked at Feng Yi Xuan and said in a low voice.</p><br/><p>“Ao Shuang, you …” Feng Yixuan’s heart was extremely complex, and he was also abnormally happy. However, in the next moment, he was interrupted by a wave of worry.</p><br/><p>“Human, you sure are bold.” “I’ll let you go, you actually dare to appear here.” Cadio’s cold voice rang out.</p><br/><p>“Father!” You promised you wouldn’t do anything to her. Now let her go. ” Feng Yixuan ignored everything else and turned to face Ka Di Ao.</p><br/><p>The instant Qi Ao Shuang saw Feng Yi Xuan, she was overjoyed. Now that he heard these words, he understood even more clearly in his heart. It was for his sake that Feng Yixuan had left everything behind and returned to the demon realm to become a demon king. And Feng Yixuan’s real identity was indeed the Young Lord’s brother. Was he the son of the Infernal King?</p><br/><p>“That was before!” “I promised before!” Ka Di Ao’s handsome face was dark. He growled malevolently. “A mere human, how could he not know what was good for him!” How dare you break the coronation of our devils? “This time, I definitely won’t let you off.”</p><br/><p>“Father!” You want to go back on your word?! Feng Yixuan’s face changed as he moved to stand in front of Qi Ao Shuang.</p><br/><p>His face was darker than carbon, and his lungs were bursting with rage. Under such circumstances, in the presence of all the demons, the next Infernal King was openly standing in front of a human! How dare he defend a human from his blatant actions! [What the heck is this supposed to be?!] … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … …</p><br/><p>“I’m not breaking my promise. I promised to let her go, but that’s because she won’t come to the Devil Realm to act impudently!” Now she dares to break into the Devil’s world, and she dares to destroy our coronation ceremony! “It’s not worth dying for!” His face grew uglier and uglier. The demon clan members clustered below the stage and whispered amongst themselves, discussing amongst themselves. This undoubtedly made Ka Di Ao even more furious.</p><br/><p>“Father!” Feng Yixuan frowned as he looked at Ka Di Ou in alarm, protecting Qi Ao Shuang behind him. Qi Ao Shuang was slightly startled, but her heart felt warm. “Meow ~” The Maneki-Neko laid on Qi Ao Shuang’s back, stuck its head out and stared at everything in front of it.</p><br/><p>“Today, I will completely cut off your thoughts!” Ka Di Ao shouted angrily and was about to make his move.</p><br/><p>“Father, don’t!” At this moment, Ladia rushed forward, extending her hands to stop Ka Di Ao.</p><br/><p>“Ladya, I’ve been too indulgent with you!” That’s why you don’t know what you’re doing right now! “Today, I will comply with the wishes of the Demon Generals and send you to the place where you should have gone earlier to temper yourself. You will temper yourself before coming back!” This time, Ka Di Ao was extremely angry. After saying this, he formed a seal with his hands, and a black ray of light struck onto Ladiya’s body.</p><br/><p>Under the astonished gazes of Ladia and the others, Ladia screamed and disappeared.</p><br/><p>Spatial magic!</p><br/><p>Those who knew about this spell were all stunned.</p><br/><p>Devil King Ka Di Ao seemed to be truly enraged today. He actually had the heart to send his beloved daughter to another world to train. He had actually abolished all of Ladia’s power in the end!</p><br/><p>“Father!” Feng Yixuan was shocked. He had never seen Ka Di Ao act like this before. It seemed like today he had crossed his bottom line, which was why he was so heartless.</p><br/><p>“Get out of my way!” Cadio bellowed, a terrifying black flame condensing in his hand.</p><br/><p>At this time, the demons below started to boil.</p><br/><p>“Wang!”</p><br/><p>“King!”</p><br/><p>“Kill that lowly human!”</p><br/><p>“Blast that human into pieces!”</p><br/><p>Feng Yixuan was both anxious and angry as he coldly glared downwards. He roared, “All of you, shut the f * ck up!”</p><br/><p>For a moment, the audience was silent. The demons looked at each other in dismay. Then, they raised their heads to look at the furious Feng Yixuan, and then turned their heads to look at Ka Di Ao, who was confronting Feng Yixuan.</p><br/><p>At the sight of this, Ka Di Ao’s face darkened even further. He clenched his fists tightly, and a cracking sound could be heard.</p><br/><p>Feng Yixuan and Ka Di Ao looked at each other. The blazing flames of anger in Ka Di Ao’s eyes were so intense that Feng Yixuan’s heart was sinking …</p><br/><p>He was well aware of how powerful Ka Di Ao was.</p><br/><p>In the Devil world, who could be his match?</p><br/><p>No one else was the same. Even Feng Yixuan himself had lost.</p><br/><p>Leng Lingyun’s expression darkened, and she stood in front of Qi Ao Shuang without any change in her expression. He did not expect things to turn out this way. They never imagined that the supreme experts of the Demon World would directly send them to the Demon King’s coronation ceremony, much less directly confront the Demon King.</p><br/><p>Even in his heyday he had no chance of winning against Cadio. At most, he could fight to the bitter end. Now that half of his power was not in his body, he had no chance of winning.</p><br/><p>Under the watchful eyes of so many people, facing the enraged Infernal King, he really didn’t have the confidence to retreat with Ao Shuang in one piece.</p><br/><p>“Why did you stop Yi Xuan from being with me?” Qi Ao Shuang’s cold, low voice rang out.</p><br/><p>Feng Yixuan and Leng Lingyun were stunned.</p><br/><p>Ka Di Ao sneered. “Because of the curse on his body, I won’t allow you to get involved with him!”</p><br/><p>Qi Ao Shuang was stunned. What do you mean? Curse? Yi Xuan had a curse on him? So you can’t have an affair with me? What does this curse have to do with me?</p><br/><p>Without giving Qi Ao Shuang time to think, Ka Di O had already made his move.</p><br/><p>Feng Yixuan and Leng Lingyun stepped forward with cold expressions.</p><br/><p>“Get out of my way!” With him at the center, a terrifying blast of air spread out in all directions. This wave of air was actually a tangible black. Like a massive wave, it spread outwards like a crazy wave. The demons below the platform trembled in fear. The Demon Generals were still alright, but the lower level demons that were further away were sent flying.</p><br/><p>Everyone’s expression changed. This was the first time they had seen such an explosive Ka Di O.</p><br/><p>“Generals, listen up!” There must be a heavy reward for killing this human girl. “If there are any obstructions, kill them!” Ka Di Ao’s face was ferocious, his cold voice was filled with cruelty and decisiveness.</p><br/><p>“Father!” Feng Yixuan looked at the malevolent Ka Di Ao in disbelief. Why must his father be so ruthless? Why?!</p><br/><p>“Go!” The black flame in his hand was already bearing down on him.</p><br/><p>The demons below the platform let out a strange cry, and swarmed forward, countless black demons flying in the air, their target aimed at Qi Ao Shuang.</p><br/><p>Feng Yixuan clenched his teeth, pain flashing through his eyes.</p><br/><p>He quickly formed a barrier with his hands. Although he knew that his barrier wouldn’t be able to fend off Ka Di Ao, who was stronger than him!</p><br/><p>Leng Lingyun stood behind Qi Ao Shuang with a cold face.</p><br/><p>Feng Yixuan and Leng Lingyun stood between Qi Aushuang.</p><br/><p>Seeing this, Ka Di Ao became even more angry. Before the first wave of fire reached him, he had already released a second wave.</p><br/><p>All the Demons let out strange cries as they flew up into the air. All their magic was directed towards Qi Ao Shuang and Leng Lingyun. For a time, the entire sky was filled with flowing colors, dazzling and dazzling the eyes of everyone. The air was wildly moving, and the violent aura was suffocating. If these magic spells were to be summoned at the same time, everyone could imagine the consequences!</p><br/><p>Feng Yixuan was extremely anxious, and Leng Lingyun’s expression sank even further.</p><br/><p>Qi Ao Shuang clenched her teeth as she muttered an incantation in her heart. The Infernal King had such an overreaction. What was the secret behind it?</p><br/><p>Just as all the attacks were about to arrive, something shocking happened. A colorful light suddenly burst out from Qi Ao Shuang’s body. It tightly surrounded Qi Ao Shuang. Following that, the rainbow light expanded, expanded, and continued to expand, tightly surrounding Feng Yixuan and Leng Lingyun. The three people of Qi Ao Shuang’s group could only feel that the rainbow light was unusually warm and gentle.</p><br/><p>Suddenly, the rainbow light expanded rapidly and exploded. The eyes of all the demons shone white, and for the time being, nothing could be seen.</p><br/><p>In the next instant, all the demons were dumbfounded. All the magic they cast was reflected back to them! A ferocious attack had already arrived in front of his eyes!</p><br/><p>For a moment, the entire sky was in chaos.</p><br/><p>The Infernal King’s magic was also repelled back, and the terrifying black flames whistled as they assaulted Ka Di Ao. Ka Di Ao’s face was cold. He stretched out his hand and with a wave of his hand, all the flames were easily repelled. The other demons weren’t so relaxed. The high level Demon Generals were still better off, but the low level ones were miserable. One after another, they cried out in alarm and dodged, colliding with the demons on the side, but the demons on the other side were also dodging and running into the other demons. The high-ranked demons that were originally able to dodge the counterattack were caught off guard by these other demons that were randomly dodging.</p><br/><p>At this moment, the sky was in chaos. The sounds of complaint and reprimand could be heard incessantly. Terrifying cries gradually rang out.</p><br/><p>These sounds were exceptionally ear-piercing to Ka Di O’s ears, and his face was so green that water could drip out of it.</p><br/><p>It was obvious that the human woman had some sort of magical artifact that could reflect magic. A mere human! To think that he had caused his Devil world to fall into such a mess! Hateful! Extremely hateful! I won’t rest until I get rid of her today!</p><br/><p>Feng Yixuan’s heart sank when he saw the furious, embarrassed look in Ka Di Ao’s eyes. He knew that today, he would be facing the most troublesome situation he had ever faced!</p><br/><p>Leng Lingyun stared at the furious Ka Di O, she did not dare to be careless.</p><br/><p>Looking at the chaotic situation before her eyes, Qi Ao Shuang suddenly took out her Glazed Ore. She was shocked to see that deep cracks had appeared on the beautiful Glazed Ore!</p><br/><p>To be able to reflect so many magic attacks in one go was clearly surpassing the limit of the Liu-Li Yan. That was why such a shocking crack appeared on Liu Li’s body.</p><br/><p>“Liu Li?” “Liu-Li?!” Qi Ao Shuang called out anxiously in her heart, but the glazed stone in her hand didn’t respond.</p><br/><p>“You ignorant little human being, go die!” Ka Di Ao flew up, his hands forming a strange handprint as he muttered a complicated spell.</p><br/><p>“Father!” Feng Yi Xuan clenched his teeth. Pain flashed through his eyes as he followed. He knew the spell best.</p><br/><p>“Ao Shuang, move back.” Leng Lingyun stood at the back, protecting Qi Aushuang, her countenance incomparably solemn.</p><br/><p>Qi Ao Shuang had a complicated feeling in her heart. For Feng Yi Xuan to go up against his own father for her sake, the torment he was going through could be imagined.</p><br/><p>What should I do? How could he resolve the current situation?</p><br/><p>Ka Di Ao clenched his fists until they were white, and in his hands was a terrifying power. The gurgling sound came out from his fist, getting louder and louder, like the rolling waves of a storm. Everyone knew that Ka Dio was trying his best to control his strength.</p><br/><p>“Get out of my way!” Ka Di Ao roared out, and a visible force of air ferociously attacked Feng Yi Xuan. Feng Yi Xuan spat out a mouthful of blood and was sent flying backwards. However, Ka Di O’s target was obviously Qi Ao Shuang.</p><br/><p>Feng Yixuan clearly didn’t intend on harming his father, so he naturally didn’t go all out. And it was precisely this that Ka Di Ao was so carefree about it.</p><br/><p>Leng Lingyun’s face turned serious, he did not understand. Why did the always calm Ka Di O see the arrival of Ao Shuang so abnormal? Why do you insist on the death of Ao Shuang?</p><br/><p>Seeing this, Leng Lingyun did not dare to hold back anymore.</p><br/><p>“Go!” Leng Lingyun gave a low shout, and a brilliant purple light shot out from her hand towards Ka Di Ou.</p><br/><p>Ka Di Ao’s pupils dilated slightly. With a loud bang, he released the force in his hand.</p><br/><p>BOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOO!</p><br/><p>A loud explosion resounded across the sky and pierced through everyone’s eardrums.</p><br/><p>A huge black light and a gorgeous purple light collided in mid-air, dazzling and dazzling in all directions!</p><br/><p>Many demons with lower cultivations spat out a mouthful of blood on the spot before fainting on the spot. Some of the Demon Generals with high cultivations also didn’t feel well, and their eyes were dizzy from the shock. At this moment, they once again experienced the Infernal King’s unscalable and terrifying power.</p><br/><p>Leng Lingyun was knocked back two steps before she could stabilize herself. Leng Lingyun narrowed her eyes, and her expression turned cold.</p><br/><p>Ka Di Ao’s body didn’t seem to be affected in the slightest. Suddenly, a strange smile appeared on his face before he burst out into laughter. “Haha, I didn’t think that you would appear in our Demon World.” Demon King! “Today, I will make sure you never return!” At this moment, Ka Di Ao recognized Leng Lingyun’s old identity, and could not conceal the excitement in his voice.</p><br/><p>“I am no longer a Great Demonic King. My name is Leng Lingyun.” Leng Lingyun replied in a deep voice.</p><br/><p>Hearing Leng Lingyun’s reply, Ka Di Ao’s face changed slightly. Looking at Leng Lingyun protecting Qi Aushuang behind him, he became even more enraged, but also started to laugh out loud: “Good, good, good!” A mere human was actually able to make the Great Monster King and our Infernal King protect him in such a manner. “Today, I want to see how long you can protect her!”</p><br/><p>At this moment, Ka Di Ao’s entire body was covered in black flames, and a thick aura of death seemed to permeate the surroundings. At the same time, his appearance had already changed. His hair that was as black as ink fluttered in the air and grew longer and longer. A pair of pitch-black horns slowly grew on his head, and his pupils were blood-red. On his back, whooshing sounds could be heard as his huge black wings unfurled continuously. There were a total of twenty pairs of huge black wings!</p><br/><p>“Infernal King, I do not wish to fight you. Why do you have to suffer so much?” Qi Ao Shuang finally spoke in a cold voice, her eyes meeting with Ka Di Ao, who was flying in the air.</p><br/><p>“I only want you to die!” Ka Di Ao sneered. “Destroy you. Your body and soul shouldn’t exist!”</p><br/><p>Qi Ao Shuang looked at the pale-faced Feng Yi Xuan with a complicated expression. She knew that the pain he was suffering from wasn’t just from Ka Di Ou’s attack just now, but also from his mental state.</p><br/><p>Fight? Not fight?</p><br/><p>If he didn’t fight, he would die!</p><br/><p>Even though he had already broken through to the twelfth level of the Lotus Flower Beautiful Mirror, he was still far from being a match for Ka Di Ao!</p><br/><p>Qi Ao Shuang looked up at the bright sun in the sky and frowned.</p><br/><p>“Mom, calm down. I feel the sun.” I’ll do my best for you. Glass! “I want to avenge Liu Li!” Suddenly, the long-silent golden lotus spoke at this time, its low and deep voice abruptly ringing in Qi Ao Shuang’s mind.</p><br/><p>“How’s Liu Li?” Qi Ao Shuang frowned and asked worriedly.</p><br/><p>“There is still a trace of her aura. After this battle, I will treat her wounds. It might not appear for a long time.” “So, Mom, please do it as soon as possible.” “One hit!”</p><br/><p>“Demon King, I didn’t mean to make you my enemy.” Qi Ao Shuang raised her head, coldly looked at the Infernal King and said in a low voice.</p><br/><p>“A mere human boasting so shamelessly? Today, I will turn you into ashes!” At this moment, Ka Di Ao’s voice rumbled like thunder, causing the people’s eardrums to buzz and making them tremble with fear.</p><br/><p>“No!” Feng Yixuan frowned in pain. His heart felt as though it had been pierced by ten thousand arrows.</p><br/><p>Leng Lingyun, who was standing in front of Qi Ao Shuang, suddenly felt her pupils dilate. It was because she suddenly felt an indescribably terrifying heat behind her.</p><br/><p>“Lingyun, move aside.” Qi Ao Shuang’s voice was low and quiet, but it also seemed endless.</p><br/><p>Leng Lingyun was startled, and she slowly turned her head to face Qi Ao Shuang’s bright face, letting out a faint golden glow. Leng Lingyun subconsciously retreated to the side. The Maneki-Neko leaped from Qi Ao Shuang’s back to Leng Lingyun’s shoulder.</p><br/><p>Qi Ao Shuang slowly raised her right hand, and the strange divine tool appeared in her hand, pointing straight at the bright sun in the sky. A faint layer of golden light slowly covered her face, making her look extremely sacred and inviolable. Gradually, her entire body was enveloped by a faint layer of golden light.</p><br/><p>“What kind of curse does Yi Xuan have on him?” “You didn’t want to crack it for him?” Qi Ao Shuang’s voice was cold and distant.</p><br/><p>“Ha ha-ha ha ~ ~” The Infernal King laughed maniacally while flying through the air, “It’s already too late. The moment you stepped onto this land, the curse has already begun …” And the way to stop the curse is to completely destroy you! The Infernal King would naturally not say the following words.</p><br/><p>Qi Ao Shuang narrowed her eyes, and a cold light shot out from her eyes. The Infernal King’s words …</p><br/><p>“Go to hell!” a lowly human being who has disturbed my son’s mind. ” The Infernal King grinned sinisterly as his right hand continued to gather strength. A dull rumbling sound rang out unceasingly, and the black pattern on his palm continued to expand and expand. The black auras from all directions quickly gathered together. His voice was like raging waves, causing people to be scared out of their wits. The entire sky seemed to have changed color, dark and without light.</p><br/><p>“Gather!” Qi Ao Shuang lowered her eyes and said in a low voice. In an instant, with her as the center, a visible golden wave of air exploded in all directions. Following which, a huge gold pillar of light shot down from the dark sky, enveloping Qi Aushuang within. Surprisingly, the beam of light shot down from the sun!</p><br/><p>The power of the sun?! This was the blazing halo of the sun?</p><br/><p>All the demons were stupefied, foolishly looking at the scene in front of them. Was this human even human? He could actually use the power of the sun?</p><br/><p>In a split-second, golden light shot in all directions, making people unable to open their eyes. The light continued to expand, and at this time, the originally dark sky gradually became clear. The golden light was continuously expelling the darkness.</p><br/><p>The expression on Ka Di Ao’s face changed. His hand didn’t stop moving. With an angry shout, he gathered the terrifying power in his hand and rushed down.</p><br/><p>Qi Ao Shuang had an arrogant look on her face as she brandished her sword to meet the incoming attack.</p><br/><p>Like raging waves, like raging waves ….</p><br/><p>A rumbling sound shook the world.</p><br/><p>The world changed color!</p><br/><p>The two figures met in midair.</p><br/><p>Blood unceasingly dripped down from the sky. As it flew, it splashed on the ground, causing beautiful and dazzling blood flowers to bloom. Gradually, it gathered into a shocking blood line!</p><br/><p>However, the two of them were unharmed.</p><br/><p>Someone stood between the two of them and took the full force of their attacks.</p><br/><p>This person was Feng Yixuan.</p><br/><p>“No!” The Infernal King let out a roar that came out of control, flying in the air as he let out a long and agonized roar towards the sky. He was well aware of the power of his full-powered strike! He knew that this human had something special about her, so he used all his strength to strike at her, intending to turn her into ashes, including her soul! And now, he had been directly struck by Feng Yi Xuan! “Curse, is it done?” No no! “How could this be?” Ka Di Ao floated in the air like a madman. His eyes were unfocused as he muttered to himself. However, there was an endless desolation and sadness in this indifferent tone.</p><br/><p>What he had done everything in his power to prevent had still happened!</p><br/><p>He thought that by using the human as a threat and keeping his son away, he would be able to avoid the vicious curse. However, he didn’t expect that the curse would still come true. Furthermore, he was the one who pushed it to come true faster.</p><br/><p>Could it be that he was wrong?</p><br/><p>Ka Di Ao stared blankly at Feng Yi Xuan’s pale face as he gradually descended. Suddenly, he let out a loud howl and an indescribable aura began to spread out from him …</p><br/><p>The sword in Qi Ao Shuang’s hand disappeared. She rushed forward and tightly hugged the pale-faced Feng Yi Xuan as she slowly descended.</p><br/><p>“Why?” Qi Ao Shuang’s body trembled slightly, her heart was filled with endless fear. Looking at Feng Yixuan’s pale and almost transparent face, Qi Ao Shuang’s heart sank to the bottom. The cold continued to invade and attack again. Qi Ao Shuang felt her entire body turn cold, and her heart was slowly cooling down.</p><br/><p>“I …” I won’t let you die, but. “I don’t want my father to be injured either …” A faint smile appeared on Feng Yixuan’s pale face, as if he was about to vanish in the next moment.</p><br/><p>Just like that, Qi Ao Shuang carried Feng Yi Xuan and slowly descended onto the platform.</p><br/><p>Leng Lingyun stared blankly at the scene before her eyes. The piercing pain, the pain in her heart, became more intense …</p><br/><p>“My soul.” It was about to disperse… “Ao Shuang, I will never keep my promise again …” Feng Yi Xuan smiled weakly. Before Qi Ao Shuang could say anything, he turned his head to look at Leng Lingyun, who was standing behind Qi Ao Shuang, and said in a low voice, “Leng Lingyun, quick …” “Take Ao Shuang away …”</p><br/><p>At this moment, Ka Di Ao was still shrieking in pain. If he came back to his senses, he might really be unable to leave! That was what Feng Yixuan was worried about, so he had Leng Lingyun leave with Qi Aushuang.</p><br/><p>“No!” Qi Ao Shuang’s voice was trembling.</p><br/><p>Feng Yixuan’s eyes flashed with worry, sadness, sadness, reluctance, and yearning. However, he still slowly stretched out his right hand, wanting to touch the face of Qi Ao Shuang that he had been yearning for.</p><br/><p>Qi Ao Shuang grabbed Feng Yi Xuan’s hand and said decisively, “I will not let you die!”</p><br/><p>Feng Yixuan simply smiled. It was too late. His body could no longer withstand the fatal blow from Ka Dio and the attack from Qi Ao Shuang.</p><br/><p>“Camil — —”</p><br/><p>However, Qi Ao Shuang held Feng Yi Xuan’s hand tightly and shouted towards the sky.</p><br/><p>Desolation. Long and long.</p><br/><p>Everyone who heard it was shocked.</p><br/><p>“Camille, I know you can do it. Come out!” Come out! “Help him!” Qi Ao Shuang called out to the sky. There was endless sadness and hope in his voice.</p><br/><p>Feng Yixuan was slightly stunned, as was Leng Lingyun.</p><br/><p>Ka Di Ao’s body stiffened in mid-air.</p><br/><p>Alas</p><br/><p>It was a long, faint sigh.</p><br/><p>This sigh seemed to echo in the horizon, but it also seemed to echo in everyone’s ears, making their hearts tremble!</p><br/><p>Who is it?</p><br/><p>Who possessed such terrifying strength?</p><br/><p>The next moment, the sky started to clear.</p><br/><p>The sky was blue and the clouds were white. The breeze was gentle.</p><br/><p>A man dressed in white appeared in the sky. He just floated there. That soft sigh was actually from him.</p><br/><p>This man in white was Camil who had suddenly disappeared.</p><br/><p>“Ao Shuang …” Camille’s soft voice drifted over.</p><br/><p>“Camil, save Yi Xuan.” “You can do it, I know!” Xiao Ao Shuang looked at Camil and begged anxiously.</p><br/><p>Leng Lingyun looked at Camil with a complicated expression. Camille, who is it? What kind of existence was this?</p><br/><p>“I can.” Camille smiled, flirtatious.</p><br/><p>“Save him!” Xiao Ao Shuang became even more anxious.</p><br/><p>“But, give me a reason to save him.” Camil continued to smile gently and elegantly. He spat out each word clearly, “I have no reason to save him.” If you were hurt, I would save you. “But, he can’t …”</p><br/><p>The smile on Camil’s handsome face was so familiar, yet also foreign. He was smiling, but his eyes were cold. There was no warmth or ripples in them.</p><br/><p>He was not joking around. Instead, he was extremely serious.</p><br/><p>“For …” “Why …” Qi Ao Shuang’s pupils suddenly contracted as she stared at the smiling Camil.</p><br/><p>“No reason.” Camille smiles as usual, her voice soft, faint, and soft. However, there was no trace of temperature at all!</p><br/><p>Qi Ao Shuang turned her head in a daze. She lowered her head to look at the increasingly pale face of Feng Yi Xuan. She was even more terrified as she felt Feng Yi Xuan’s life force being drained away …</p><br/><p>If this continued, then Feng Yixuan would truly leave her forever. Never come back!</p><br/><p>A huge wave of despair and sadness surrounded Qi Ao Shuang. Qi Ao Shuang could only tightly hold onto Feng Yi Xuan’s hand without letting go.</p><br/><p>Leng Lingyun looked at the expression on Qi Ao Shuang’s face, and her heart was filled with uneasiness. he asked himself. If he was the one who fell, would Ao Shuang also be unable to control herself like this? Would it? “Can it?”</p><br/><p>“Meow ~ ~ Meow ~ ~” Suddenly, the Lucky Cat perched on Leng Lingyun’s shoulder cried out nonstop. When Leng Lingyun heard the cat, she was stunned, because another voice appeared in her mind.</p><br/><p>Leng Lingyun stared blankly at the grief-stricken Qi Ao Shuang, at the almost transparent Feng Yi Xuan, and then at the faintly smiling Camil.</p><br/><p>Suddenly, Leng Lingyun smiled lightly. She raised her head and said to Camil in a deep voice, “Camil, is what you said true? If it was Ao Shuang who was injured, would you save her?”</p><br/><p>“Of course.” Camil gave a low chuckle, raised his eyebrows, and said these words. There were no ripples in the depths of his eyes.</p><br/><p>“Then, I am willing.” Leng Lingyun lowered her head and said to the air in such a low voice, as if she was talking to herself and someone else at the same time.</p><br/><p>After Leng Lingyun finished speaking, she slowly walked forward and squatted beside Qi Ao Shuang, smiling like a peach blossom as she softly spoke, “Ao Shuang, I believe in you.” “Feng Yixuan, do you believe in Ao Shuang?”</p><br/><p>Feng Yixuan was stunned, but he still nodded with difficulty. He saw a monstrous determination and confidence in Leng Lingyun’s eyes.</p><br/><p>“Then, Ao Shuang, we will wait for you.” “Feng Yi Xuan and I will wait for you.” After Leng Lingyun said this, she gently took off the purple crystal earring from Qi Aushuang’s earlobe.</p><br/><p>In the next moment, before Qi Ao Shuang could understand what Leng Lingyun was trying to say, her eyes were surrounded by a sphere of purple light. A dazzling purple light surrounded the three of them.</p><br/><p>“Meow!” The Lucky Cat waved its claws as it jumped around the purplish light.</p><br/><p>At this time, Ka Di Ao no longer acted as violent as before. Instead, he stared blankly at the purple ball of dazzling light. Why did he feel that Feng Yixuan’s life, which had been slipping away, had stopped?</p><br/><p>Camille’s eyes narrowed slightly, and the smile on his face froze. Ye Zichen looked at the ball of purple light thoughtfully.</p><br/><p>“Camille, remember what you said.” Leng Lingyun’s soft voice came from the purple light.</p><br/><p>“Interesting, haha. Then, I will help you guys.” “I’ll wait and see.” Camil’s handsome face once again revealed a faint smile. This time, the smile seemed to be different from before.</p><br/><p>The purple light became more and more intense …</p><br/><p>Ka Di Ao stared blankly at the violet light, unable to intervene. The pressure exuded by the man in white showed everything. He was absolutely not his match! What was he doing?</p><br/><p>Camille smiled and flicked his sleeve.</p><br/><p>In the next moment, the purple light disappeared …</p><br/><p>And there was nothing. Feng Yi Xuan was gone. Qi Ao Shuang was gone. Leng Lingyun was also gone …</p><br/><p>Only the snow-white Maneki-Neko was squatting on the ground. The Maneki-Neko looked up at the sky, and Camille’s figure disappeared.</p><br/><p>“Meow?” The Maneki-Neko narrowed its eyes and nodded, then a gratified smile appeared on its face. Yes, he was right. The cat actually had such an expression on its face!</p><br/><p>Before Ka Di Ao could react, the cat disappeared.</p><br/><p>Everything returned to silence, as if nothing had happened before. If it wasn’t for the mess, who could have guessed that a world-shaking fight had occurred here?</p><br/><p>Ka Di Ao stared blankly at the empty stage, completely stunned. Where is he? Why have they all disappeared? His own son, the son he loved and was proud of, had disappeared.</p><br/><p>One thing, however, Ka Dio knew very well. His son was not dead!</p><br/><p>But where?</p><br/><p>Where did that terrifying man in white take them?</p><br/><p>Could it be that this curse could be broken?</p><br/><p>And the key to breaking the curse was still the human girl? Could it really be like this? Ka Di Ao’s heart, which had been in a deathly silence, began to stir with life once more.</p><br/><p>Perhaps, it could really be reversed!</p><br/><p>Then, Ao Shuang, we will wait for you. Feng Yi Xuan and I will wait for you.</p><br/><p>We’ll wait for you.</p><br/><p>Interesting, hehe, then, I’ll help you.</p><br/><p>I’ll see.</p><br/><p>What do you mean? What do you mean by these words?</p><br/><p>My head, it hurts, it hurts.</p><br/><p>The echo of these words in her mind gave her a splitting headache.</p><br/><p>What was going on?</p><br/><p>Yi Xuan! Lingyun! Camille!</p><br/><p>Where are you?</p><br/><p>Qi Ao Shuang woke up abruptly, and when she opened her eyes, she saw that there was an incomparably gorgeous bed curtain above her head.</p><br/><p>He slowly turned his head and saw that he was in an ornate room.</p><br/><p>However, it was unfamiliar …</p><br/><p>Where was this?</p><br/><p>Where were Feng Yixuan and Leng Lingyun?</p><br/><p>What about Camille?</p><br/><p>Where’s Ah’Bao?</p><br/><p>Why weren’t they there?</p><br/>\n</div>"}