{"title": "Chapter 256", "id": 256, "volume": 3, "url": "http://boxnovel.org/stunning-edge-chapter-256", "volume_title": "Volume 3", "body": "<h1>Chapter 256</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Stunning Edge – C256</p><br/><p>Qi Ao Shuang slowly stood up, but her whole body was aching. He forced himself up and got off the bed barefooted. However, he realized that something was amiss.</p><br/><p>Something felt wrong with his body …</p><br/><p>Qi Ao Shuang stretched out her hand and looked down. Her hand seemed to have grown bigger. The moment he lowered his head, a strand of fiery red hair gently fell down. Qi Ao Shuang slowly picked up the strand of hair, her heart alarmed.</p><br/><p>This color was not the black he was familiar with!</p><br/><p>Qi Ao Shuang slowly walked towards the only mirror in the room.</p><br/><p>When Qi Aushuang looked at the person in the mirror, she was shocked, and she quickly reached out her hand. The person in the mirror also extended his hand out.</p><br/><p>Qi Ao Shuang froze and slowly retracted her hand. The person in the mirror also retracted her hand with a face of astonishment.</p><br/><p>The person in the mirror had a head full of fiery red hair, but his hair was so smooth that it flowed straight down to his heels, falling down to the ground. It was extremely beautiful. There were two purple crystal earrings on the right ear! The peerless appearance of the person in the mirror, the pale complexion and the eyes as black as the night, all felt so familiar to Xiao Ao Shuang, making her heart ache.</p><br/><p>Feng Yixuan …</p><br/><p>Why was the person in the mirror Feng Yixuan?!</p><br/><p>Qi Ao Shuang slowly lowered her head and stretched out her hand, looking at it. He then looked down slowly …</p><br/><p>Finally, Qi Ao Shuang’s face was filled with shock as she confirmed that her body was the appearance of Feng Yi Xuan!</p><br/><p>Why did his body belong to Feng Yixuan?</p><br/><p>How could this be? Qi Ao Shuang’s mind was in chaos.</p><br/><p>Xiao Ao Shuang froze, standing in front of the mirror in a daze, looking at the familiar face that did not belong to her. His mind was filled with countless thoughts, and he was even more puzzled. What was going on?</p><br/><p>At this time, there was a slight sound from the door and it was gently pushed open. He revealed a face that Xiao Ao Shuang had seen before.</p><br/><p>Heaven Breaker! This unfathomable person whom they had first met in the chaosworld was Ah’Bao’s master.</p><br/><p>“Meow!” A round, furry head poked out of Heaven Breaker’s head, waving its claws at Ao Shuang as if in greeting.</p><br/><p>“Ah’Bao …” Heaven Breaker …. As soon as Qi Ao Shuang opened her mouth, she was stunned. This was because this voice belonged to Feng Yi Xuan. Qi Ao Shuang reached out her hand and gently touched her throat with a strange expression on her face. No one could immediately accept and adapt to such a mutation.</p><br/><p>“You’re awake.” Heaven Breaker smiled and walked over. “How do you feel?”</p><br/><p>“Meow!” The Chasing Precious Cat let out a cry and leapt from Heaven Breaker’s head to Xiao Aoshuang’s shoulder, squatting down and then rubbing itself against Qi Aoshuang’s face.</p><br/><p>“It’s alright, but …” Xiao Aushuang frowned, still not used to it, “This, what is going on?” Why am I here? Where were Yi Xuan and Ling Yun? Camille? “How are they?”</p><br/><p>“Hehe, why aren’t you worried about yourself?” Heaven Breaker replied with a faint smile, sitting down on the sofa. Of course he knew what Xiao Ao Shuang was talking about. However, he didn’t immediately answer. Instead, he asked with a faint smile.</p><br/><p>“Me?” Qi Ao Shuang was stunned. Then he frowned at the red hair hanging down over his shoulders.</p><br/><p>“They should be fine by now.” “You can rest assured that they won’t be in any danger.” Heaven Breaker didn’t want to beat around the bush either, because the Maneki-Neko perched on Qi Ao Shuang’s shoulder waved its paws at him, threatening him. If he didn’t hurry up and explain to her, he would just wait on her.</p><br/><p>Without waiting for the stunned Qi Ao Shuang to speak, Heaven Breaker quickly brought everything together. “At that time, the original owner of your body was about to die. Ah’Bao activated the secret technique in her body to get me to help you.” But even I don’t have the power to get a dying person to respond. The man in white can save him, but he will only save you. So I reached a consensus with the silver-haired man, who volunteered to be the medium for the exchange of souls between you two. He forced the man in white to make a move. “It’s not a method, but it seems to be very useful in the end.”</p><br/><p>As soon as Heaven Breaker finished his words, Qi Ao Shuang’s face turned deathly pale.</p><br/><p>“Then, what about Lingyun?” Where’s Lingyun? Could it be that he … Qi Ao Shuang was extremely shocked, and her heart was flustered. According to Heaven Breaker’s deduction, Camil would definitely save him. But what about Leng Lingyun, who had volunteered to become the medium?!</p><br/><p>“Don’t be nervous, I said, they’re fine.” This naturally includes the Ling Yun that you spoke of. ” Heaven Breaker comforted her with a smile.</p><br/><p>“Nothing?” Qi Ao Shuang’s face relaxed a little, “Then, then what about them …”</p><br/><p>“That’s the question you’re facing now.” Heaven Breaker sighed softly. “If you want to find them, you’ll have to put in an unimaginable effort.” Your current body can no longer use the magic that you were most familiar with, right? Even his dou qi is gone, right? ” A strange light flashed across Heaven Breaker’s eyes. Most importantly, this body was that of a man. Qi Ao Shuang was a woman. The situation now looked strange. A woman’s soul was in a man’s body.</p><br/><p>Qi Ao Shuang was stunned. She flicked her finger, but a small fireball did not appear between her fingers like before. His body felt empty, and he could not feel the existence of the fire element at all. His dou qi seemed to have vanished as well!</p><br/><p>Qi Ao Shuang’s face slightly changed, she became silent.</p><br/><p>“You must first familiarize yourself with this body, and then familiarize yourself with the properties of this body. Within your body, the soul of that person has been taken away by that man in white. And the silver-haired man, by becoming the medium of your soul’s exchange, is in a space that has ceased to exist. “When you find your own body and ask for it back, the silver-haired man will awaken from that place.” Heaven Breaker solemnly explained.</p><br/><p>Qi Ao Shuang was silent. Her face was calm, and people couldn’t tell what she was thinking.</p><br/><p>“Where did my body go to?” After a while, Xiao Ao Shuang slowly asked. In her mind, Leng Lingyun’s last words echoed. Then, Ao Shuang, we will wait for you. Feng Yi Xuan and I will wait for you. Now he finally understood the meaning of this sentence.</p><br/><p>So it was like this?</p><br/><p>Qi Ao Shuang slowly clenched her fists.</p><br/><p>“Your body, the man in white said before he left that he would bring your body to shatter the void. I’ll be waiting for you at the very edge of there. ” Heaven Breaker’s expression changed when he heard the words “Space Break”.</p><br/><p>“Break through the void?” “What is that place?” Qi Ao Shuang had never heard of this name before, she frowned and asked.</p><br/><p>“This is a chaosworld.” And the Space Shattering was a plane above this plane. “Dangerous, I don’t think I’ll have to go into details.” There was a hint of worry in Heaven Breaker’s voice.</p><br/><p>“Thank you for saving me, thank you and Ah’Bao for doing this for me.”</p><br/><p>“Don’t thank me.” You are not in good shape today. There is only one way to shatter the void, and that is to pass the Star Tower’s Star Trial. Heaven Breaker sighed softly as he recounted everything that had happened to Qi Ao Shuang.</p><br/><p>There were many sects in the chaosworld as well, and many disciples. And the Heavenly Star Pagoda would open the Stellar Trial once every ten years. Those who passed this trial would be allowed to enter the Stellar Heavenly Pagoda to cultivate. The Sky Tower had a total of nine floors. One could not see the end with a single glance, and just passing the top floor would allow one to enter the Space Shattering Realm. However, the Star Heavenly Pagoda’s survival training was only open to the students of the Star Academy. The requirements for the Star Academy to accept students were even more stringent.</p><br/><p>In other words, in order to enter the Star Academy and participate in the Star Trial, one must first join a sect. Of course, joining a sect was far from enough. He had to become one of the best in the school, and only then would he be eligible to participate in the school’s survival training.</p><br/><p>After listening to all this, Xiao Ao Shuang went silent and slowly walked to the bed and sat down.</p><br/><p>“It’s easy to enter a sect. You don’t have to worry about that. I will let Altis recruit you into his sect, and he will also recommend you to participate in the school’s assessment. “But now, you …” Heaven Breaker’s face darkened. He didn’t say anything else.</p><br/><p>Xiao Aushuang suddenly understood what Heaven Breaker meant. Right now, she could no longer use Fire Magic, nor could she use the Lotus Mirror. How would he participate in the school’s assessment?</p><br/><p>“Don’t worry about that.” “Thank you for all you’ve done for me. Thank you so much.” Qi Ao Shuang thanked Heaven Breaker sincerely. Heaven Breaker didn’t have any relationship with her, yet he spared no effort in helping her.</p><br/><p>“No, hur hur. Speaking of which, the one who should be thanking is me.” Heaven Breaker actually said something like that that, which caused Qi Ao Shuang to be at a loss.</p><br/><p>“Meow, meow!” The Maneki-Neko hopped onto Qi Ao Shuang’s head and used its paws to scratch Qi Ao Shuang’s hair. After that, she tried hard to use her claws to gesture, mewing while saying words that Xiao Ao Shuang did not understand. However, the gratitude in her voice was clear to her.</p><br/><p>Xiao Aushuang was even more puzzled, why did Heaven Breaker and Ah’Bao have to thank her?</p><br/><p>“Because Ah’Bao is by your side, and as expected, he managed to resolve the evil Qi in her body.” Heaven Breaker stood up with a smile and walked over to pick up Po from Qi Ao Shuang’s head. “Alright, Ah’Bao, stop messing around with other people’s hair.”</p><br/><p>“Baleful aura?” Suddenly, she remembered the time when Ah’Bao suddenly transformed and how Camil explained it to her. He suddenly came to a realization. Could it be that during the time Ah’Bao stayed in her body, she unwittingly helped Ah’Bao to resolve the baleful aura?</p><br/><p>“Yes, Ah’Bao’s life was very pitiful, very miserable. Those things caused her to accumulate killing intent. It had always been an unstable factor, and could even cause death. Later on, when I met you and was with you, the infernal energy was indeed completely dispelled by you. “Ah’Bao won’t be in any danger.” Heaven Breaker stroked Po’s head, his eyes filled with doting affection. “Such a favor, I don’t know how to thank you for it.”</p><br/><p>“Meow, meow ~ ~” Ah’Bao squinted his eyes as he rubbed his hand against Heaven Breaker’s, appearing very satisfied.</p><br/><p>Qi Ao Shuang was stunned. She saw a familiar look in Heaven Breaker’s eyes. Feng Yixuan and Leng Lingyun only looked at her with those eyes.</p><br/><p>In that case, Heaven Breaker versus Ah’Bao …</p><br/><p>Ah’Bao was everything that broke the heavens. So that’s how it was …</p><br/><p>“Although you can’t use your previous magic right now, you can slowly familiarize yourself with this body. I can’t figure out the potential of this body. Wind magic should be relatively easy to master, and your spiritual force is extraordinary. This shouldn’t be a problem. “As for the power hidden in this body, I can’t say for sure.” Heaven Breaker lifted his head and spoke solemnly to Qi Ao Shuang. “The identity of this body should be that of a demon.”</p><br/><p>Naturally, Qi Ao Shuang understood what the hidden power of the Heaven Breaking Finger was. This was the power possessed by the demons of Feng Yixuan’s true identity. However, Blackplume had once said that there were all sorts of races in this chaosworld. Her current status as a demon was nothing surprising.</p><br/><p>Afterwards, Heaven Breaker gave her a general overview of the situation in this world and prepared a lot of necessities for her. He then urged her to hurry up and cultivate in seclusion. Qi Ao Shuang readily agreed, she had the same intention.</p><br/><p>“There’s only one month left before Star Academy’s assessment. You only have one month to adapt to this body and use magic to pass the Star Academy’s assessment. I’ll have Artis do everything for you. “You can go into closed door cultivation for this month.” Heaven Breaker brought Qi Ao Shuang to the secret chamber and spoke these words.</p><br/><p>“Thank you.” Qi Ao Shuang smiled, then with a calm expression, she stepped into the secret room.</p><br/><p>A month?</p><br/><p>Only a month.</p><br/><p>Although that body was not his, Elder Tiangang’s teachings from back then were still vivid in his mind.</p><br/><p>Star Trial…</p><br/><p>Broken Space …</p><br/><p>Yi Xuan, Ling Yun, wait for me.</p><br/><p>I will come!</p><br/><p>Qi Ao Shuang’s eyes flashed with determination.</p><br/><p>But he was confident!</p><br/><p>— — — — — — — — —</p><br/><p>A month passed with a flick of a finger. After a month of closed door cultivation, no one knew what the results would be. Heaven Breaker introduced himself to Artis for Qi Aoshuang, and without any hesitation, Artis agreed without any hesitation. The friendship between the two was admirable.</p><br/><p>And in the blink of an eye, it was already the entrance examination for Star Academy.</p><br/><p>All of the major sects of the chaosworld had selected their best disciples to participate.</p><br/><p>Artis’ Tian Dao Sect had a total of thirteen people elected. Originally, twelve people had been elected by Grand Elder Artis, so there was one more. To put it bluntly, he had forcefully arranged for a person to intervene. And this person was the disciple that he had just accepted.</p><br/><p>Following the other disciples of the Tian Dao Sect, Qi Ao Shuang was sent to the foot of the mountain of the Star Academy. This academy was not located in a bustling city, but rather in a quiet mountain range.</p><br/><p>The top of the mountain was always surrounded by a white mist, and it would not disperse even after a long time. At the top of the mountain, the Heavenly Star Tower could not even see its head at all.</p><br/><p>The Great Elder, Artis, was nowhere in sight all day long. He had no business to attend to, but he held quite a high position in the sect. This time, they forcefully accepted a disciple of unknown origin and immediately and vigorously chose to participate in the exam. Naturally, this caused some people to be dissatisfied. Including the other disciples who had come to participate. Although no one dared to have any objections, this was all in secret …</p><br/>\n</div>"}