{"title": "Chapter 261", "id": 261, "volume": 3, "url": "http://boxnovel.org/stunning-edge-chapter-261", "volume_title": "Volume 3", "body": "<h1>Chapter 261</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Stunning Edge – C261</strong></p><br/><p>After receiving the proof of identity, the freshmen were no longer led by Dittas, nor were they led by the Star Academy’s teachers. Instead, a group of people in gray robes appeared to lead them to their dorms.</p><br/><p>The differentiation of the dormitories was also very obvious. There were a total of ten buildings, and each building was divided into two parts. One part was occupied by male students, while the other part was occupied by female students. Different doors led in.</p><br/><p>The first building was occupied by new students and students who hadn’t even passed the first level of the Star Trial. Naturally, the people living here had the lowest status.</p><br/><p>The second building was the residences of students who had passed the first Star Trial. Therefore, no one had lived in the last building with the most elegant environment.</p><br/><p>That building was also the goal of many students. It was a symbol of strength and status.</p><br/><p>“I truly did not expect you to arrive so quickly.” Camil smiles gently and slowly steps forward to stand in front of Qi Ao Shuang.</p><br/><p>Looking at the seemingly lifeless person in the crystal wall, Qi Ao Shuang opened her lips slightly and trembled, but not a single sound came out.</p><br/><p>“Don’t worry, he didn’t die, and neither did Leng Lingyun.” They’re waiting for you. ” Camil smiled and said softly.</p><br/><p>“Ka…” “Mir…” Qi Ao Shuang retracted her gaze, looking at the familiar smile on the face of the person in front of her, and called out his name in a low voice.</p><br/><p>“Yes.” I knew you’d come. ” Camille squints and smiles. “Then I will keep my promise and save them.”</p><br/><p>Qi Ao Shuang looked at Camil, and did not say another word. Her eyes were misty, and there was something flickering in them.</p><br/><p>“Haha, Little Ao Shuang …” Camil reached out habitually and was about to gently rub Qi Ao Shuang’s head.</p><br/><p>“Pa!” With a crisp sound, Qi Ao Shuang lowered her head, reached out her hand and slapped Camil’s hand away.</p><br/><p>“Little Ao Shuang, you still want to cause trouble with me?” Did you blame me for not helping Feng Yixuan back then? ” Camil massaged the back of his hand, which was aching, and spoke with a pampered tone.</p><br/><p>However, Xiao Ao Shuang lowered her head and turned a deaf ear to him. Then, she slowly walked past Camil.</p><br/><p>“Little Ao Shuang, alright, stop being so noisy. I’ll change you guys over right now. I’ll get that brat Leng Lingyun as well. Let’s find a place to live together in the future …” Camil turned around and reached out his hand to hold onto Qi Aoshuang, but the moment his hand touched Qi Aoshuang’s arm, it became transparent, then slowly disappeared.</p><br/><p>Qi Ao Shuang didn’t even turn around, and resolutely walked forward, passing through the huge crystal wall behind Camil, passing through the bodies of the people inside.</p><br/><p>The instant Qi Ao Shuang passed through, Camil’s body turned into dust and dissipated. His face maintained that gentle and graceful smile, and the huge crystal wall and the people inside also disappeared.</p><br/><p>Qi Ao Shuang slowly raised her head again, her eyes clear and filled with determination. The scene before her eyes had changed; it was a seemingly endless stone staircase. This stone staircase led to the Star Academy.</p><br/><p>Yesterday, today, tomorrow, was it really true?</p><br/><p>Jonathan’s words echoed in Qi Ao Shuang’s ears.</p><br/><p>Jonathan, in fact, yesterday, today, tomorrow, are all true, what has happened, what is happening, what will happen in the future, which is false? There was no lie, it was all real …</p><br/><p>The illusion just now was also real. But that was the future. This was the scene that Xiao Ao Shuang wanted to see the most in her heart.</p><br/><p>So, what I saw just now was the third round of the examination?</p><br/><p>To test a person’s mental fortitude.</p><br/><p>By the time Qi Aushuang reached the entrance, the three of them were already waiting. As for Qi Ao Shuang, she was not the first to pass the examination, and the first to arrive was the lady dressed in red who was covered in killing intent. At this moment, she had already withdrawn her killing intent and was silently waiting by the side.</p><br/><p>“Oh, you’re here.” Jonathan greeted her. Qi Ao Shuang nodded her head gently in acknowledgement, before leaving him with a long sigh. … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … ….</p><br/><p>Xiao Ao Shuang cast a glance at the Star Academy. When he said the school gate, there was actually no door at all. Because of the stairs, there was a huge lake. In the middle of the lake, two huge granite slabs were slowly moving with each other. An interaction between the lake and the other side. It was like a moving water elevator. The strange thing was, there was nothing under the huge rock. It was just floating in the air, moving back and forth on the surface of the water.</p><br/><p>Soon, the disciples who had passed the assessment began to arrive one after another. Some looked relaxed, some were sweating profusely and in a sorry state. It was obvious that some people had tried very hard to recover from the ideal illusion. Although some of the other disciples of the Heavenly Dao Sect were in a very sorry state, they had all passed as well. It was a miracle.</p><br/><p>Even so, only half of the participants had just arrived for the third round of the trial. Only half of them passed. What would happen to those disciples who failed the examination were clearly not within their scope of concern.</p><br/><p>“Those who have passed, please come here to register and claim your identity token.” Jonathan led the group to the lake with a smile and stood on the stone slab. His eyes swept across to Qi Aushuang. Qi Ao Shuang followed, and the others also followed. The huge stone slab was somewhat empty after they all stood on it.</p><br/><p>After pausing for a while, everyone slowly moved to the opposite side. Qi Ao Shuang was surprised in her heart. This stone tablet was floating in the air, without anything supporting it, she could not feel any magic power. How did the Star Academy do that?</p><br/><p>Looking at the dark green lake that rippled from both sides of the stone slab, and the occasional fish jump out of the water, everyone gradually recovered from the heavy mood. Some people started chattering away.</p><br/><p>Qi Ao Shuang looked at the dark green lake and remained silent. An indistinct gaze was always cast towards her. Qi Ao Shuang knew who it was, a disciple of the Heavenly Dao Sect. The senior sister who seemed to be the leader was called Tanina. But she didn’t want to go into it. Now that her identity was that of a man, she wasn’t willing to have too many conflicts with other girls, allowing others to misunderstand her.</p><br/><p>Beyond this dark green lake, what entered his eyes was a huge plaza. In front of the plaza, there was a huge and majestic building that looked like a palace.</p><br/><p>After receiving the proof of identity, the freshmen were no longer led by Dittas, nor were they led by the Star Academy’s teachers. Instead, a group of people in gray robes appeared to lead them to their dorms. The differentiation of the dormitories was also very obvious. There were a total of ten buildings, and each building was divided into two parts. One part was occupied by male students, while the other part was occupied by female students. Different doors led in. The first building was occupied by new students and students who hadn’t even passed the first level of the Star Trial. Naturally, the people living here had the lowest status. The second building was the residences of students who had passed the first Star Trial. Therefore, no one had lived in the last building with the most elegant environment. That building was also the goal of many students. It was a symbol of strength and status.</p><br/><p>The two of them shared a room, and the one who shared the room with Qi Ao Shuang was a quiet, thin, and quiet young man. The two of them greeted each other indifferently. After knowing each other’s names, they no longer interacted with each other. This kind of person was the same as Ao Shuang. If a person with the same personality as Jonathan was given to her, it would give her a headache. Everyone had a comfortable bed, a desk, a bookcase, and a wardrobe. The wardrobe contained clothes from all seasons of the year. There were two sets of clothes for each season.</p><br/><p>There was no need for Qi Ao Shuang to worry about passing the examination. Artis had already arranged everything, and before he left, he threw a few huge crystal cards to Qi Ao Shuang like an upstart. The amount of money inside could be easily guessed from his tone.</p><br/><p>“Spend,” said Artis, fiercely, “I’ll settle the score with you if you spend the money badly.” “I don’t have much,” he said with a pained expression. “I hate money.” He looked just like a dandy.</p><br/><p>Actually, there was no need to worry about living and eating in Star Academy, because everything was already included in the expensive tuition fees. However, Heaven Breaker insisted that Qi Ao Shuang accept these crystal cards, saying that it was to prevent them from being useful in the future. Qi Ao Shuang remembered the help she had received from Heaven Breaker.</p><br/><p>According to the attribute test, Qi Ao Shuang was placed in the Wind division. And the thin youth in the room was also in the same class. On the wall of the dorm room, there was a huge map. On it, everything about Star Academy was clearly indicated. Some places were green, some places were red, and there were big forks on them. The green area was accessible, and the red area meant that one couldn’t enter or leave freely. They were all quite special places.</p><br/><p>Being familiar with the campus was also a matter for the freshmen themselves. Whether or not they would go to class was also a matter for the students themselves. However, every year, there would be an exam competition held among students of the same level of strength, and the last ten students would be demoted. For example, the last ten places in the 8-star student exam would be reduced to seven stars, and so on. As for the lowest level students who didn’t even have the strength of a 1-star, the top ten in the examination were eliminated by the school.</p><br/><p>This system made Qi Ao Shuang sigh in admiration. Without pressure, there was no motivation. The Star Academy did very well in this area. Students whose name has been removed will be eligible to enter the academy for the examination and continue the challenge. It became a loop, a loop that helped people progress.</p><br/><p>After resting for a while, the thin youngster turned around and went to the bathroom to change into a white school uniform before silently walking out. Qi Ao Shuang’s stomach let out an indecent cry, and she remembered that it was time to eat. Her roommate must have gone to dinner. Xiao Ao Shuang looked at the map on the wall, changed her clothes and pinned her identity token to her chest. She then walked out the door and headed towards the cafeteria.</p><br/><p>The school had only one cafeteria, but on the west side of the college, there was a bustling street. There were many shops there, as well as the most luxurious restaurant.</p><br/><p>It was already dinnertime, and there were many people entering and exiting the cafeteria. However, the huge cafeteria was not crowded at all. It was orderly and orderly.</p><br/><p>Xiao Ao Shuang picked up a standard meal from the restaurant window and sat down in an empty corner. In front of his eyes, there was a plate of thick soup along with the two dishes. Looking at the taste, Qi Ao Shuang picked up the knife and fork, slowly enjoying the taste.</p><br/><p>At this moment, at the entrance of the cafeteria, Tanina walked in with a young lady. With just one glance, Tanina saw Qi Ao Shuang in the corner of the cafeteria. The youngster with long red hair was extremely eye-catching. However, his face was calm as he sat there quietly and ate his lunch.</p><br/><p>“Tarina?” “What’s wrong?” The young girl beside her couldn’t help but ask curiously when she saw Tanina suddenly stop in her tracks, lost in her thoughts.</p><br/><p>“Oh, nothing.” Come on, let’s eat. “Yuna.” Tarina turned her head and smiled towards the young lady next to her. This young lady was someone she had met just now. They were in the same bedroom, and their personalities were open and generous. In just a short while, they had become friends.</p><br/><p>“Yes.” “I heard that the food in Star Academy is also very tasty. Let’s go try it.” Yuna asked excitedly like a child.</p><br/><p>With a smile and a nod, she and Una went to the window to get the plates. Just as he finished carrying the tray, he saw a few people walking towards the direction of Qi Ao Shuang. His expression seemed unfriendly.</p><br/><p>At this moment, a wave of whispers reached the ears of Tanina and Una.</p><br/><p>“Tsk tsk, that red-haired kid is a freshman, right?”</p><br/><p>“Isn’t that bullshit? Didn’t you see that brat only had ID tags on his chest?”</p><br/><p>“No wonder, he’s so unlucky.” Leeds, that son of a bitch, likes bullying the freshmen. ”</p><br/><p>“Shh, lower your voice.” You’re a five-star now, and Leeds is a six-star. “It’s none of our business. Speak less.”</p><br/><p>“That brat is really unlucky. That piercing hair must be causing trouble.”</p><br/><p>“And that pretty face.”</p><br/><p>The expression on Tanina’s face changed drastically. A 6-star student actually wanted to cause trouble for that person. He had only just entered the academy. Tarina bit her lip. As a disciple of the Tian Dao Sect, she definitely couldn’t stand idly by the side. But the situation was clear. Given how they had just entered the academy, it was impossible for them to be a match for a 6-star student. What should he do?</p><br/><p>“Tsk, Tanina, let’s go. Stop looking and be careful of the fire on your upper body.” Una naturally did not know about the relationship between the red-haired youth and Tanja, and she spoke up to stop him. As far as she was concerned, that youth was really going to suffer. It was a 6-star master teacher, and his strength was already displayed there.</p><br/><p>“No.” “He is my junior brother, a disciple of our Tian Dao Sect. I cannot stand idly by the side and watch.” She gritted her teeth, but firmly said these words.</p><br/><p>“Huh?” Yuna was slightly stunned. The red-haired youth was actually Tanina’s junior apprentice-brother? Then what should he do?</p><br/><p>At this moment, Xiao Aushuang naturally noticed the few people walking towards her. His white clothes and his chest were all adorned with six little golden stars. Oh, have all of them passed the sixth level of the Heavenly Star Tower? Judging from their expressions, they seemed to have come with ill intentions.</p><br/><p>“Kid!” You’re in our seat, get out of my way! ” The six-star student in the lead placed the plate in front of Qi Ao Shuang as he coldly shouted with disdain.</p><br/><p>Leeds was the leader, of course, and his sudden release sent the soup splattering everywhere. The table was full of soup, which naturally flew towards Qi Ao Shuang’s snow-white clothes and his handsome face. He thought that the soup would splash onto Qi Ao Shuang, but who knew that it would splash onto the table as if it had grown eyes.</p><br/><p>“Your position?” “Does it have your name on it?” Qi Ao Shuang smiled. She picked up her own spoon, leisurely scooped up a spoonful of soup and elegantly took a sip.</p><br/><p>This smile, this sip, was filled with grace and grace, peerless and magnificent in this generation.</p><br/><p>Leeds was stunned, and the people behind him were stunned.</p><br/><p>Why did this youth look even more beautiful than a woman at that moment?</p><br/><p>Illusions! Illusions!</p><br/><p>Stupid adonis! Leeds came back to himself, his eyes flashing with exasperation. She was so angry that she was actually distracted by a man’s smile just now.</p><br/><p>“I say, so be it! Scram!” “Otherwise, hmph…” Leeds snapped, then gave a final sneer that meant something, but he didn’t say the rest of it. However, the ruthlessness in his eyes had explained everything.</p><br/>\n</div>"}