{"title": "Chapter 260", "id": 260, "volume": 3, "url": "http://boxnovel.org/stunning-edge-chapter-260", "volume_title": "Volume 3", "body": "<h1>Chapter 260</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Stunning Edge – C260</strong></p><br/><p>“This is interesting?” The silent Dickens finally spoke slowly.</p><br/><p>Just a few simple words were like a thunderclap that rang in the ears of everyone present, causing their eardrums to buzz. It was as if it could pierce through one’s soul, making one feel extremely shocked.</p><br/><p>Lani, who wanted to attack again, immediately calmed down. Jonathan stopped smiling.</p><br/><p>“Don’t let others see you as a joke. “Your current identities are at least 8-star.” The tension between the two of them completely disappeared with a single sentence.</p><br/><p>“Hmph!” Jonathan grunted and sat down.</p><br/><p>Lenny glared at Jonathan and sat beside Dittos.</p><br/><p>With regards to Lenny’s attack on Jonathan, which had almost affected Qi Ao Shuang, Dittens did not mention anything about it. Qi Ao Shuang’s eyes flashed with a teasing look. This was because Dittas’ deep eyes were looking at her. There seemed to be an unfathomable light in his eyes as he stared straight at her. However, Xiao Ao Shuang did not retreat at all, and went up to him openly. However, the mockery in Qi Ao Shuang’s eyes became more and more obvious.</p><br/><p>Finally, he narrowed his eyes, looked away, and turned away. Qi Ao Shuang also retracted her gaze, closing her eyes to rest her mind.</p><br/><p>The day passed just like that. At night, someone finally walked out from the iron gate. The person who came was a young woman with a tyrannical glint in her eyes. When she walked out, there was the scent of blood in the air, as well as an unconcealable sense of slaughter.</p><br/><p>As Qi Ao Shuang smelled the scent, she furrowed her brows and slowly opened her eyes. However, she was surprised to see a woman she had seen before. It was the woman that Xiao Ao Shuang had met when he came to the primordial chaos to take the core of the fire, the woman who had attempted to snatch Ah’Bao away! The young woman was beautiful, and her fiery red clothes sparkled brilliantly. Her every movement was vicious, and her eyes were filled with irritation. The viciousness that was revealed between her eyebrows gave off a very uncomfortable feeling. There was no blood on her body, but the stench of blood was thick. And the aura on her body showed that she had come all the way here to kill. However, there wasn’t a single drop of blood on his body. This kind of strength …</p><br/><p>She was much stronger than before. Qi Ao Shuang looked at this woman indifferently, then closed her eyes once again.</p><br/><p>“Congratulations on passing the second round, please wait by the side.” “After four days, we will begin the third round of the examination.” Dittos’ voice was still neither cold nor indifferent, neither warm nor estranged. He was quite good at pinching her.</p><br/><p>“Thank you very much.” The woman in red expressed her gratitude, nodded to Dittens, and then sat to the side.</p><br/><p>Lani looked at the woman in red and frowned slightly. He did not say anything. However, his eyes flashed with a faint trace of enmity.</p><br/><p>Jonathan looked at Lenny’s expression and thought it was funny. The self-righteous woman was again treating other women as imaginary rivals.</p><br/><p>After listening to what the lady in red said, Xiao Aushuang felt that the tone was different from the time she met her. It seemed to contain more vicissitudes of life and enlightenment. He had seen her before as a willful and reckless girl, but now, she seemed to have matured? How could there be such a big change? What had she been through? Of course, Qi Ao Shuang did not know that the black feather had inflicted a fatal blow on this woman, cutting her into two halves. It was all thanks to her master that she was able to save her. Her state of mind had changed since then. And he even painstakingly cultivated with his current strength, participating in this examination.</p><br/><p>Jonathan continued to chat with Qi Ao Shuang for the rest of the day. To say that he and Qi Ao Shuang were chattering away was to say that he was the only one who was noisy and noisy. Many times, Qi Ao Shuang would just nod her head lightly or just say ‘oh’.</p><br/><p>Over the next few days, many disciples also walked out from the iron gate one after another. Fang Xingjian looked around and saw that there were many people who had passed the examination as well. On the morning of the fourth day, the disciples of the Tian Dao Sect had already come out. Even though two of them had sustained light injuries, they had still passed through. This was inextricably linked to Tarina’s decision and the unity of the crowd. Even though the Tian Dao Sect was only a mediocre sect, it had quite a reputation in this world. It must have something to do with them.</p><br/><p>When she saw the calm Qi Ao Shuang sitting far away from her, she couldn’t help but heave a sigh of relief.</p><br/><p>“Tsk, that kid actually arrived earlier than us.” Jack naturally saw Qi Ao Shuang who had arrived earlier. Seeing that Qi Ao Shuang was unharmed, he said in a sour tone.</p><br/><p>“It’s good that you’ve all passed. You can’t let your guard down in the next round.” Tanina instructed solemnly.</p><br/><p>“Yes, senior apprentice-sister.” Everyone nodded in agreement. Even Jacklin nodded his head solemnly. If the second stage wasn’t arranged by senior sister, then not only would they be able to pass it, it would also be a question of whether they would be able to survive.</p><br/><p>The five-day deadline had come to an end, and more than eighty percent of the people still arrived. Although some people were lightly injured, and some were seriously injured, they were still people who had come here. As long as he reached this point within the allotted time, he would pass.</p><br/><p>“Time’s up.” Congratulations to everyone for passing the second round of exams. “Next, immediately proceed to the third test.” Dittos stood high up, his voice flat and flat in everyone’s ears.</p><br/><p>As soon as he said that, a commotion broke out below. What? The third round of the examination is about to begin? Didn’t he see that many people had yet to recover? The second round was so dangerous. If they didn’t have time to recover, they would immediately start the third round of the examination! Those who had arrived earlier were all right, but some had only just arrived and were still wounded, light or heavy. This decision made all the disciples below explode.</p><br/><p>“Those who aren’t willing to participate can leave immediately.” The voice of Dittos was still indifferent, without the slightest hint of emotion. However, when these words entered the ears of the crowd, they felt a chill run down their spine from head to toe. These words were said with absolute sincerity, not a shred of emotion could be felt from his words.</p><br/><p>“Then, hurry up for the third exam.” Someone shouted. If he were to be humiliated by this man in white, it would be too shameful. After a voice sounded out, more and more voices rang out.</p><br/><p>“The third round of the examination is to follow these steps up. If you can reach the entrance of the academy in the end, you will pass the examination.” Dittos faintly said such an outrageous test.</p><br/><p>What? As long as he followed this flight of steps up, he would be qualified to reach the academy’s entrance? Everyone looked at each other in dismay. It probably wasn’t that simple. There must be something dangerous between them!</p><br/><p>“Don’t worry, there won’t be any more dangerous creatures attacking you in the second trial.” “Now, let’s begin.” Jonathan smiled affably.</p><br/><p>Lenny let out a cold snort of disdain and didn’t say anything.</p><br/><p>Everyone was suspicious and looked at each other without saying anything.</p><br/><p>At that moment, a hasty shout came from within the heavy metal door, “Wait, wait …”</p><br/><p>Everyone looked back and saw a battered disciple frantically running towards them. Behind him, a group of people followed.</p><br/><p>“The exam has ended.” Seeing those people frantically running and stumbling, Dotans’s face was as cold as ever. He only gently waved his hand and formed a large barrier behind the people who passed the exam, separating those who had already passed the exam from the iron gate.</p><br/><p>Those disciples who had arrived late finally rushed out of the iron gate and crashed into the barrier. Many people’s eyes were filled with anticipation as they furiously rapped on the spirit formation while begging for forgiveness, “Lord Escort, please make an exception for me. I was only five minutes late.”</p><br/><p>“Please make an exception. I was only three minutes late …”</p><br/><p>The sound of pleading mixed with the sound of someone knocking on a barrier. The faces of those disciples who had arrived late were full of pleading and expectation.</p><br/><p>“It’s too late.” Dittos coldly said nothing, not saying anything else. Then he turned away and walked straight ahead.</p><br/><p>“The assessment has already begun.” Jonathan reminded them with a smile.</p><br/><p>Everyone hesitated as they looked at each other. After a moment, someone suddenly let out a strange cry and flew up. There was a first, and of course there followed one after another. Qi Ao Shuang’s face was calm as she slowly walked forward.</p><br/><p>“Yesterday, today, and tomorrow, how is that true?” Just as Qi Ao Shuang was about to take a step forward, Jonathan’s voice sounded in her ears. Xiao Ao Shuang turned to look at Jonathan in shock. She saw him give her a big look, shrug his shoulders, and slowly walked forward as if nothing had happened.</p><br/><p>Qi Ao Shuang narrowed her eyes as if she was deep in thought. She turned around and followed the crowd.</p><br/><p>At the beginning, everyone was still cautious, but the journey was calm and without any obstructions. Some people were overjoyed, quickening their pace and dashing forward.</p><br/><p>Qi Ao Shuang walked slowly, thinking about Jonathan’s secret message to her. Why did Jonathan suddenly say such a stupid thing? It was impossible for her to say that there was no reason for her to do so. But what did it mean?</p><br/><p>Not far behind Qi Ao Shuang, a pair of eyes flashed across her body. It was the look in her eyes. Tarina slowly followed behind with her group of disciples. Nor did she think it would be so simple. Looking at the unhurried pace of Qi Ao Shuang, she was a little absent-minded. This youth had a faint sadness between his brows that caused one’s heart to ache and one’s heart to feel sorry for him. He didn’t want anything to happen to him during the exam. He didn’t want anything to happen at all.</p><br/><p>Talina quickened her pace, leading the crowd to chase after them. She wanted to keep the distance between them and Qi Ao Shuang.</p><br/><p>However, at this moment, Tanina’s pupils suddenly dilated. She saw an incredulous scene. The red-haired youth, Qi Ao Shuang’s figure, was actually slowly disappearing. Following that, she vanished into thin air.</p><br/><p>Startled, she quickly took a few steps forward and gave chase. Upon closer inspection, there really was no sign of that youth!</p><br/><p>“Jacklin.” She turned to ask if anyone had seen the strange scene.</p><br/><p>However, when she turned around, she was completely stunned.</p><br/><p>There was no one behind him. At this moment, the juniors and juniors, like the red-haired youth, mysteriously disappeared.</p><br/><p>Then, the most familiar scene appeared in front of her …</p><br/><p>At this moment, Qi Ao Shuang was stunned. She stood there blankly, watching the scene unfold in front of her, tears welling up in her eyes.</p><br/><p>“You, came.” The soft voice was the same.</p><br/><p>Just like that, Camil’s elegant face appeared in front of Qi Ao Shuang.</p><br/><p>Behind him was a transparent crystal wall. The person inside the crystal wall had a calm face, so familiar that it made her heart palpitate. Black hair, and a pair of tightly shut eyes under long eyelashes. Who else could it be other than Qi Ao Shuang’s body?</p><br/>\n</div>"}