{"title": "Chapter 267", "id": 267, "volume": 3, "url": "http://boxnovel.org/stunning-edge-chapter-267", "volume_title": "Volume 3", "body": "<h1>Chapter 267</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Stunning Edge – C267</p><br/><p>Wynes looked at Qi Ao Shuang with a nervous expression. Only then did he remember, how could he have the qualifications to agree to the transfer of dishes? He was here to invite Xiao Ao Shuang to treat him, but he had actually decided to do something like this.</p><br/><p>“I don’t agree. Please leave.” Xiao Ao Shuang coldly spat out a sentence.</p><br/><p>The youth at the door turned around and glared at Qi Ao Shuang, not speaking for a long time. There was a venomous glint in his eyes, as he stood there looking at Qi Ao Shuang, as if he was trying to carve the memory of her into his heart. After a while, he suddenly turned around and left.</p><br/><p>The room fell silent. Qi Ao Shuang flicked her finger and a gentle breeze blew, closing the door.</p><br/><p>Wynes’ face turned gloomy. He lowered his head and looked at the delicate dishes on the table. However, he no longer had any appetite.</p><br/><p>“Wynes, do you know why I changed my mind?” Xiao Ao Shuang said passively.</p><br/><p>Wynes shook his head.</p><br/><p>“You, you know that Bethany, right?” Suddenly, Xiao Ao Shuang said these words again.</p><br/><p>Wynes looked up. There was a trace of panic in his eyes.</p><br/><p>“The pastry you said you liked when you were young has something to do with that Bethany, right?” There must be a story between you. Otherwise you wouldn’t react so strangely to this dish. As you can hear, that Bethany must order it every time she comes. ” Xiao Aoshuang spoke slowly, neither white nor white. She connected Wynes’ words with those, and naturally, she thought of something else. The more he said it, the paler his face became.</p><br/><p>Qi Ao Shuang stopped talking and waited silently.</p><br/><p>After a while, Wynes let out a soft sigh. He was a little sad and said, “So what?” She was the treasured daughter of the city lord of Jadechild City. I just need to watch her from the corner, and she’ll be all right. ”</p><br/><p>“Then you won’t let other men try to curry favor with her, right?” Xiao Ao Shuang coldly spat out this sentence.</p><br/><p>“I …” For a moment Wynes was tongue-tied, not knowing what to say.</p><br/><p>“How can you not know without trying?” “She’s so obsessed with that dish that she can’t forget you, right?” Xiao Ao Shuang thought of that sexy and arrogant woman from before, and she was a little puzzled in her heart, could it be that she was faking it?</p><br/><p>“So what?” She didn’t recognize me at all now. “I, I just wanted to meet her, so I desperately tried to enter Star Academy.” Wynes smiled bitterly and said in a low voice.</p><br/><p>He only joined the Star Academy to see that girl? Xiao Ao Shuang could imagine how difficult it was. For a lowly illegitimate child to enter a sect and then be recommended to attend the Star Academy’s assessment examination, just how much effort would he have to put in? This fellow, he never thought that he would still be so infatuated.</p><br/><p>“Qi Ao Shuang …” Suddenly, Wynes spoke softly.</p><br/><p>“Huh?” Xiao Ao Shuang turned to look at Wynes, picked up the sweet wine and took a sip.</p><br/><p>“Do you have a woman you like?” Wynes looked at Xiao Ao Shuang and asked very seriously.</p><br/><p>Pop</p><br/><p>Xiao Ao Shuang spurted out the sweet wine in her mouth and splashed it all over Wynes’ face.</p><br/><p>“Uh, I’m sorry.” Xiao Ao Shuang quickly apologized and handed the white napkin to Wynes.</p><br/><p>Wynes took it and wiped his face with tears. He did not know how he could make Xiao Aushuang react with just a single question.</p><br/><p>“No.” Only then did Qi Ao Shuang answer Weiss’ question. However, the figures of Feng Yi Xuan and Leng Lingyun suddenly appeared in her mind. They, now, okay?</p><br/><p>Camille, where are you now? Was it still the same as before, silently looking at him in a place he didn’t know?</p><br/><p>Ember Yan, Waldo, Summer, Black Dragon Ben, Qiao Chuxin, the Lord of the East Wind, how are they doing now? Are you alright?</p><br/><p>“Qi Ao Shuang?” Wynes said in a low voice as he looked at the entranced Qi Ao Shuang.</p><br/><p>“Oh.” “It’s fine.” Qi Ao Shuang came back to her senses. She shook her head gently and smiled.</p><br/><p>After dinner, Xiao Ao Shuang and Wynes prepared to leave. After passing by the private room where Bethany was, Wynes glanced at the door and a trace of sadness flashed across his eyes. He then turned around and left with Qi Ao Shuang.</p><br/><p>When they returned to the bedroom, both of them were deep in their own thoughts and did not fall asleep for a long time.</p><br/><p>“Qi Ao Shuang, we are almost at the Star Heavenly Pagoda’s Star Trial. Are you participating?” Wynes suddenly asked.</p><br/><p>“Yes.” “Yes.” Qi Ao Shuang did not hesitate as she replied with certainty.</p><br/><p>“Maybe after this exam, we won’t be roommates anymore.” Wynes said gloomily. Qi Ao Shuang’s strength was far above his. He knew it from the day he was rescued by Qi Ao Shuang from Ashlin.</p><br/><p>“Even if we don’t live together, we’re still friends.” Qi Ao Shuang said softly. She understood in her heart that this thin and tenacious youth was actually extremely inferior to himself.</p><br/><p>“Alright.” Wynes acknowledged softly.</p><br/><p>“Do you want to be with Bethany?” Xiao Ao Shuang suddenly asked.</p><br/><p>“I said I don’t want to, but that’s fake, but …” Wynes’ voice was a little misty.</p><br/><p>“But you don’t think you deserve her, do you?” Xiao Ao Shuang helped Wynes speak the rest of his words.</p><br/><p>“Alright.” Wynes said.</p><br/><p>“Then, you will be able to match her and protect her.” Xiao Ao Shuang suddenly sat up, “I can make you stronger.”</p><br/><p>“What?” Wynes suddenly started to act, looking at Qi Ao Shuang with shining eyes.</p><br/><p>Heavenly Dipper Sovereigns were extremely fierce. Elder Feng, don’t you know that I can’t teach this to anyone else? Hehe, today I will accept another disciple in your place. Wynes was also of the wind system, and his character could be trusted. Teaching him was definitely not a bad thing.</p><br/><p>Wynes could never have imagined that he would not want to frame Qi Ao Shuang and win the friendship of Qi Ao Shuang. The reward he got was far more than he had paid.</p><br/><p>The Heavenly Star Tower’s trial was about to begin. All students of the Star Academy were allowed to participate in this year’s survival training. For a month, you can leave anytime you want. A month later, the top three would be decided through another round of sparring among the students who had passed the examination on each floor. The top three would all receive generous prizes.</p><br/><p>Today, the plaza in front of the Stellar Tower was filled with a sea of people. All of the students were gathered here. Some came to participate in the exam, while others just came to watch the show. The cruelty of the Heavenly Pagoda’s trial was far beyond the imagination of ordinary people. The higher the floors, the more terrifying. The students who entered were only allowed to enter after they had signed a life and death agreement. It was obvious how dangerous it was.</p><br/><p>Even though quite a few people would lose their lives every time this exam was opened, people still rushed there like a flock of ducks. This was because this trial was a major turnaround in many people’s lives.</p><br/><p>Those who belonged to the forces of the various cities had passed the high-level smelting trial here, so the nurturing of the forces behind them was not in vain.</p><br/><p>Some students who did not belong to any of the factions were looking forward to passing the upper echelon, hoping to obtain Venus, which symbolized their strength and identity. In that case, he would quickly be recruited by the city lords, and he would be able to rise to greatness, and he would be able to enjoy the limitless glory and wealth.</p><br/><p>Others wanted to prove themselves. Strength, the strong were respected.</p><br/><p>Looking at the excited students, Qi Ao Shuang felt a sense of loss. Broken Space. Was it that easy to reach that plane? In order to break through the highest realm of this world, one had to pass the ninth level of the Heavenly Pagoda’s trial.</p><br/><p>“Qi Ao Shuang, what are you thinking about?” Suddenly, Wynes, who was standing beside Xiao Ao Shuang, asked in a low voice.</p><br/><p>Qi Ao Shuang raised her head and looked at the tall Heavenly Star Pagoda. The towering pagoda was half covered in mist and the tall pagoda was wrapped by a few thick chains, looking very simple and ancient. Xiao Ao Shuang did not reply to Wynes’ words. Instead, she smiled and asked, “What level has the cultivation I’ve taught you reached?”</p><br/><p>“The ninth.” When Wynes said this, he somewhat excitedly dropped his hand. His face turned red. How could he not be excited? He was confident that he would definitely be able to reach the fifth level or above in this trial. In the future, he would really be able to make others view him in a new light.</p><br/><p>“That’s good.” “Good luck.” Qi Ao Shuang nodded lightly, “Be careful during the trial.”</p><br/><p>“You, you’re not coming with me?” When Wynes heard what Qi Aushuang said, he was stunned.</p><br/><p>“No need.” Qi Ao Shuang slowly shook her head, and glanced towards Ashlin’s group from the corner of her eyes. Those people had been glaring at him from the start, probably wanting to cause trouble for him after entering the Heavenly Tower. These people’s wishful thinking was really good. “” … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … To lose one’s life in the Heavenly Pagoda, it was hard to say whether this was due to failure or being ambushed by others.</p><br/><p>However, it was still unknown who would die at that time.</p><br/><p>Looking at the sinister look in Ashlin’s eyes, the corner of Qi Ao Shuang’s mouth curled up in a cold smile.</p><br/><p>“Heh, junior brothers pickpocket, are you guys here?” All of a sudden, a sweet voice rang out. The surrounding people all turned to look at Parina, their hearts filled with doubt. Who was the sweet little princess speaking to?</p><br/><p>He didn’t need to look to know who it was. Xiao Ao Shuang shuddered in her heart, and without turning her head, she said to Wynes: “I’ll be going first, you have to be careful when the time comes.” It would hurt if Bethany knew you were dead. ”</p><br/><p>Before Wynes could speak, Qi Ao Shuang moved forward. However, the crowd was unable to stop Qi Ao Shuang from quickly advancing. Xiao Ao Shuang stepped out of the strange arc and easily made her way through the crowd. She directly headed to the front to sign the contract with life and death. Wynes was stunned when he heard the last sentence of Qi Ao Shuang.</p><br/><p>“Tsk, why are you running!” Parina chased after him, but she could only watch as Xiao Ao Shuang’s figure disappeared from the crowd. Parina was also thinking about Qi Ao Shuang. She glanced at Wynes, who was still in a daze, and left with a cold snort.</p><br/><p>Only then did the crowd realize that the sweet little princess in their hearts was actually looking for the red-haired kid from earlier. Tsk, tsk, that brat actually ran away after not knowing what was good for him. How could he not know how to enjoy such beauty?</p><br/><p>On the other side, Tanina stared blankly at the place where Xiao Ao Shuang had just stood. That sweet and adorable young lady just now, did she know Qi Ao Shuang? For some reason, there was a faint, indescribable feeling of vexation in her heart.</p><br/><p>At this time, Xiao Ao Shuang had already signed the agreement and walked into the entrance of the Sky Tower. As for Ashlin and his men, they squeezed over with all their might. After quickly signing the contract, they chased after it. He looked like a pack of wolves chasing a lamb.</p><br/><p>But in fact, who is the wolf and who is the sheep?</p><br/>\n</div>"}