{"title": "Chapter 264", "id": 264, "volume": 3, "url": "http://boxnovel.org/stunning-edge-chapter-264", "volume_title": "Volume 3", "body": "<h1>Chapter 264</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Stunning Edge – C264</p><br/><p>At this time, of course, Qi Ao Shuang didn’t know about Parina’s vow. She was slowly pacing back to her room.</p><br/><p>In the bedroom, the thin boy, Wynes, had not yet returned. Qi Ao Shuang laid on the bed on her back, feeling a little tired. His thoughts were in a mess as he thought of some things before finally falling into a deep slumber.</p><br/><p>At night, Qi Ao Shuang was woken up by a soft sound. When he stood up, he saw Wynes sitting at the table, his face swollen and nose swollen, applying medicine for him. Seeing that Qi Ao Shuang had woken up, Wynes seemed a little embarrassed. “I’m sorry to wake you up,” she said softly. “I’m already very careful.” There was genuine apology in Wynes’s voice.</p><br/><p>“You, this is?” Xiao Ao Shuang asked in a testing manner. After all, not everyone could face being beaten up like this calmly. If the other party was unwilling to speak of it, Qi Ao Shuang would stop pursuing the matter.</p><br/><p>“No, nothing.” “Go to bed early. We still have to go to class tomorrow.” Sure enough, Wynes only managed a smile and replied perfunctorily. He didn’t say what exactly happened to his injuries.</p><br/><p>Seeing this, Xiao Ao Shuang did not ask any further. If Wynes had wanted to say it, he would have said it earlier. However, he did not want Qi Ao Shuang to know. Qi Ao Shuang nodded gently and said: “En, you should rest early.”</p><br/><p>Wynes said yes, and continued to apply the medicine, and then there was silence.</p><br/><p>After washing up, Xiao Ao Shuang went back to sleep.</p><br/><p>The next morning, when Qi Aushuang woke up, Wynes was no longer there. Xiao Ao Shuang looked at the clean house, deep in thought.</p><br/><p>When he arrived at the classroom, Qi Ao Shuang noticed that the Wind division class was sparsely filled with people. After all, there weren’t many freshmen this time. Wynes sat in a corner, lost in thought, as if thinking of something. He did not even notice that Qi Ao Shuang was sitting beside him.</p><br/><p>The bell for class had rung, but still no teacher came in. After more than ten minutes, a trembling figure finally appeared. An old man who couldn’t even walk stably felt like he was taking three steps back. The walk from the door to the podium seemed to take a long time. Everyone was worried that he would fall to the ground in the next moment.</p><br/><p>When he finally reached the podium, the old man put down the book and opened it with a slight tremble. Then, he began to lecture. The knowledge he gave was all relatively basic and not outstanding.</p><br/><p>The sound of the lecture became softer and softer, until it became a snoring sound.</p><br/><p>Everyone felt embarrassed.</p><br/><p>This teacher had actually fallen asleep.</p><br/><p>“Teacher, teacher?” The student sitting in front could not help but shout out.</p><br/><p>The old man suddenly woke up, wiped the saliva from the corner of his mouth, looked at the people in the classroom, then blinked his eyes blankly and said, “Oh, class is over.” Without waiting for any reaction from the students, he walked out of the classroom with the book in hand. Leaving behind a group of students looking at each other in dismay.</p><br/><p>Just like that, the class ended without any reason.</p><br/><p>Some of the students in the classroom were disdainful, while others were deep in thought. Could it be that the teachers of the Star Academy were truly like this?</p><br/><p>But what the truth was, there was no way to know. What he needed to do now was to find something to do.</p><br/><p>Wynes, who was sitting beside Qi Ao Shuang, stood up quietly and followed the group out. The current him still had some swelling on his face, but it was no longer as severe as yesterday.</p><br/><p>After thinking about it for a moment, Qi Ao Shuang decided to take a look at the library. She wanted to find out more about this world. Presumably, there must be something special about the library.</p><br/><p>As soon as Qi Ao Shuang walked out of the classroom, she saw a familiar figure moving around in the distance. Looking closely, it was the enchanting demi-human woman that he had met by the lake yesterday. She was unharmed and smiling like a flower. He no longer looked as pitiful as he did yesterday. Presumably, it was just as Xiao Ao Shuang guessed. Those 3-star students were no match for this young girl at all.</p><br/><p>Looking at the young girl who was looking left and right, he seemed to be looking for someone. Xiao Ao Shuang slightly frowned, his intuition told him that this young lady was a problem. Without any hesitation, Qi Ao Shuang turned around and walked away from the corner of the teaching building.</p><br/><p>Just make a turn and walk around this more remote area. Just as Xiao Ao Shuang was about to turn around, he heard a voice that seemed to have heard a few words of rage, and then there seemed to be the sound of fighting.</p><br/><p>“You idiot, you want to die by putting this thing in that red-haired kid’s closet?” His voice was filled with anger, but it was a strange sound. There seemed to be some leakage of wind. Qi Ao Shuang had heard this voice before. It belonged to the person with Leeds, and it was also the person he had sent flying. Hmph! The reason why this person spoke so coldly was naturally because he had made a heavy move that day, and most likely had knocked out his teeth. It was obvious that the red-haired kid he was talking about should be him.</p><br/><p>“Ungrateful! I didn’t even teach you a lesson yesterday, right?” “Do you believe that I won’t let you die today?” The leering voice cursed again.</p><br/><p>A lesson from yesterday? A red-haired kid? Put things in your closet?</p><br/><p>Qi Ao Shuang frowned and connected all these things together. Her mind suddenly became clear.</p><br/><p>Could it be that the person the man was threatening was Wynes, the one who lived in Green Fish’s bedroom?</p><br/><p>Qi Ao Shuang narrowed her eyes and hid her presence. She slowly moved her body and looked in that direction. At this moment, it was as if she was one with the air, making it impossible for anyone to feel her existence.</p><br/><p>A few of the youths surrounded Wynes, all of them aggressive. The one in the lead had a face full of malice as he berated him. Wynes shook his head and said nothing. The strange thing was that Liz wasn’t there.</p><br/><p>“You don’t know what’s good for you!” “Beat it up!” The leader of the youths viciously kicked Wynes, cursing, “You fool, I only asked you to put the things in the cabinet, not to die!” “F * ck, you don’t know what’s good for you!”</p><br/><p>Wynes was kicked and fell to the ground. Blood oozed out from the corner of his mouth. However, he still shook his head stubbornly. He did not utter a word as he endured the kicks.</p><br/><p>Qi Ao Shuang’s expression became more and more serious. So that’s what happened to Wynes! These people bullied him into framing himself, but he refused and suffered the humiliation. With Wynes’ cultivation level, Qi Ao Shuang had already known it when she first saw him. Right now, he was absolutely not a match for these people.</p><br/><p>“You lowly brat, do you know who I am?” My sister is the wife of the City Lord of Jufeng City! “How dare you disobey my orders!” The youngster who had leaked the news had a sinister expression. He raised his foot and was about to step on Wynes’ face.</p><br/><p>“That’s right, you brat, you don’t know what’s good for you. The reason that Ashlin asked you to do this is because of you. You actually dare to refuse!” A few of the youths beside him spoke up, their expressions extremely sinister.</p><br/><p>Just as his foot was about to land on Wynes’s face, he stopped. He just stood there in mid-air, his face full of fear. This was because he realized that his body could no longer move! What did this mean? Someone far stronger than him was nearby, secretly attacking him!</p><br/><p>The next moment, a cold breeze blew over.</p><br/><p>All of the youths around Ashlin suddenly turned around and looked in the direction of the strange wind. Very quickly, the expressions of the crowd turned ugly. Over there, the red-haired youth had a terrifyingly cold expression. His entire body exuded an unstoppable killing aura as he slowly walked towards them step by step. It was the terrifying oppressive feeling again. He felt like he was being stared at by the god of death. The crowd looked at the cold killing intent emitted from Qi Ao Shuang’s dark eyes, and a sense of fear arose in their hearts. He wanted to turn around and run away, but his feet seemed to be rooted to the ground. No matter what, he couldn’t move them. Ashlin’s body couldn’t move, but he tried his best to use the corner of his eye to look over there. Only a flash of red.</p><br/><p>His heart trembled. It was that person!</p><br/><p>It was the red-haired kid who looked like a snake and a death god.</p><br/><p>Could it be that he heard everything they said just now? See everything?</p><br/><p>At the thought of this, Ashlin’s teeth seemed to hurt even more, and his heart couldn’t help but tremble.</p><br/><p>Wynes was stunned. He raised his head and looked at Xiao Aushuang, but he couldn’t say a word.</p><br/><p>“Scram!” Qi Ao Shuang slowly approached, coldly spitting out a word.</p><br/><p>Everyone looked at Ashlin who couldn’t move, their eyes flashed with hesitation and fear. In the next instant, a frenzied wind blade came crashing towards them. That wind blade was clearly different from the one they had seen before. It actually had a faint black tint, and seemed to have a hint of red in it. It was eerie, eerie to the point that it struck terror in people’s hearts.</p><br/><p>“What are you afraid of?” “The other party is only a freshman!” At this time, Ashlin maintained his strange posture and yelled, “You guys have the strength of six stars!” “If you dare to leave me behind to escape, I will make the City Lord punish you severely!”</p><br/><p>The last sentence. These youngsters were usually subordinate to Leeds and Ashlin, and their status was far inferior to theirs. At this moment, hearing such a threat, he felt a tinge of fear in his heart.</p><br/><p>At this time, the group of people who had just left braced themselves. He formed a barrier to block Qi Ao Shuang’s wind blades, and prepared to use magic to counterattack.</p><br/><p>With a ‘pu pu pu’ sound, Qi Ao Shuang’s Wind Blade cut through all the barriers they had formed. Everyone screamed as they dodged, but they were unable to dodge in time. Their bodies were cut by these strange wind blades. His injuries were not serious. Firstly, Qi Ao Shuang did not try to kill him. Secondly, the wind blades had already weakened after being blocked by the barrier.</p><br/><p>“Idiot!” “Hurry up!” Seeing this, Ashlin became even more worried. His body was still unable to move at this time. He cursed in his heart. This red-haired kid had cast some kind of evil magic on him, causing him to be unable to move. When he could move, he would definitely take revenge and tear this damned brat into a thousand pieces!</p><br/><p>Just when everyone was about to counteract Qi Ao Shuang’s attack and counterattack.</p><br/><p>Suddenly, a melodious voice came from the air. It was so pleasant to the ears that it made one feel refreshed.</p><br/><p>“Eh, what are you doing?” “What are all of you seniors doing hiding here?” A small head poked out from the corner of the wall behind Xiao Ao Shuang, a pure and flawless lovely smile on her beautiful face.</p><br/>\n</div>"}