{"title": "Chapter 275", "id": 275, "volume": 3, "url": "http://boxnovel.org/stunning-edge-chapter-275", "volume_title": "Volume 3", "body": "<h1>Chapter 275</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Stunning Edge – C275</p><br/><p>A black line appeared on the back of Qi Ao Shuang’s head. Looking at Jonathan’s spitting words, the corner of her mouth twitched. She didn’t expect this guy to be so gossipy, not only venomous!</p><br/><p>“There is a beautiful older sister in Ditantan who is the wife of the City Lord of Nine Heavens City. Once, when her sister was assassinated and Lenny happened to be there, Lenny saved her life. That’s how much I owe him.” (Baidu Search) Actually, I know what it’s like. I know it and I know it and I know it and I know it and I know it and I know it and I know it and I know it and I know it and I know it and I know it and I know it. He didn’t need Lenny, and his sister wasn’t in any danger. “But Lenny, at that time, was spitting and spitting, and he threw himself forward to block a sword attack for Dittas’ sister.” Jonathan pursed his lips, disdainfully saying, “She plotted to meet the sister of forced Tanin. She wanted to curry favor with the sister. Now that there’s an opportunity, she definitely won’t let it go.”</p><br/><p>Qi Ao Shuang finally understood. So this was how the favor was owed.</p><br/><p>“Even if we don’t use Chicken Lenny at the time, Dittens’s sister will be fine. But the guy’s sex flail. Sigh, what a cause for worry. All these years he had allowed Lenny’s hen to follow him, and many times he had helped her. “He even brought her through the eighth level.” Jonathan’s eyes were full of contempt, and then he laughed. “But Dittas will not take the woman with him now,” he said. “It should be because he feels that the debt of gratitude has been repaid, hahahaha …”</p><br/><p>Jonathan laughed even more triumphantly. He raised his head and laughed maniacally. He was so proud of himself.</p><br/><p>Momo was lying on the shore, staring at Jonathan with her beady eyes.</p><br/><p>“That’s right, Qi Ao Shuang, are you not leaving?” “Let’s go, I’ll bring you over.” Jonathan was beaming.</p><br/><p>“No need.” Xiao Aushuang shook her head, “I can go by myself.”</p><br/><p>“That’s right, I was too happy.” I’m sure you can pass. ” Jonathan smiled brightly and nodded heavily.</p><br/><p>At this moment, there was another sound behind them. Other students had also arrived. Amongst them was the demon that Qi Ao Shuang saw on the seventh level at the Second Heavenly Layer of Ice and Fire.</p><br/><p>“Yo, you’re all here.” Jonathan stood up and looked at the men, his voice light and lazy.</p><br/><p>“Jonathan.” A deep and unfriendly voice sounded.</p><br/><p>“Haha, I was wondering who it was. So it’s the flies that run around Lenny all day.” Jonathan crossed his arms in front of his chest and looked in that direction quizzically.</p><br/><p>Qi Ao Shuang turned around and saw five men walking towards them. The one who was walking at the back was the demon that she saw on the seventh floor. The man at the front had a gloomy expression. His appearance could also be considered handsome, but the viciousness between his brows ruined his handsome appearance. Of course, he was worse off than Dittas.</p><br/><p>“Jonathan!” You can do it. “What else can you do with a quick tongue and bullying a woman?” The gloomy man said coldly.</p><br/><p>“Haha, Simi, not only will I succeed. Your tongue is too fast. I can still beat you until you’re a mess. If you don’t believe me, we can try. “As for you saying that I’m bullying women …” Jonathan pretended to be deep in thought and frowned. “I’m very friendly to women, and very graceful.”</p><br/><p>“Pah!” You are too embarrassed! “That man called Simi’s face was as red as a pig’s liver.” He did not dare to answer Jonathan’s earlier words. He knew that Jonathan could really beat him to a pulp. So all he had to do was say, “You’re nice to women?” Aren’t you afraid of losing your tongue! Do you need me to say what attitude you have towards Lenny? Everyone knows, you are everywhere? Just a moment ago, you humiliated her. Are you a man? “How dare you do that to Lenny!” Simi said angrily, a vicious light in her eyes, but she didn’t dare to move.</p><br/><p>“Huh?” Jonathan blinked innocently and said, “Lenny?” Was she a woman? Was she a woman? Why don’t I know? ”</p><br/><p>Seeing Jonathan’s reaction, Simi was so angry that she almost vomited blood. He pointed his finger at Ye Xiao and said, “You, you are unreasonable!”</p><br/><p>Jonathan shrugged his shoulders and said helplessly, “Your eyes really have a long butt. You like that kind of person too.” “Wise mind, vicious heart, self-righteous …” Jonathan continued.</p><br/><p>“Shut up!” “You’re not allowed to insult Lenny.” Simi’s expression changed greatly, and she was about to pounce on him with an angry shout.</p><br/><p>Jonathan’s face darkened, a trace of laughter and viciousness flashing in his eyes. He didn’t mind showing this stinking Simi a lot of colors, ha-ha!</p><br/><p>“Simi, don’t!” Suddenly, a delicate shout was heard, stopping Simi’s movements.</p><br/><p>Qi Ao Shuang recognized this voice. It was Lenny. So she still hadn’t left? Hiding in the back.</p><br/><p>Jonathan raised his eyebrows and looked at Simi, who was full of anger. He thought to himself. No wonder Simei was so excited today. He knew that he wasn’t his match yet, but he still wanted to show off in front of his sweetheart.</p><br/><p>“What?” “Lenny, if you don’t leave, who’s going to take you here?” Jonathan looked at Simi with disdain and sneered. “Do you expect Simi to take you there?” Take you with him? “All of you can die together.” Where was Jonathan’s smile now? The smile on the corner of his mouth was extremely charming.</p><br/><p>Simi clenched her fists tightly and stared at Jonathan. If eyes could kill, Jonathan would have been torn to pieces, dead and alive, alive and dead. But, unfortunately, eyes can’t kill. So Jonathan stood looking at Simi triumphantly. Shmi was so angry she wanted to vomit blood.</p><br/><p>Lenny bit his lips and stared at Jonathan, but he was powerless. She was no match for Jonathan, and neither was Sime.</p><br/><p>The others were all silent, watching this farce unfold in front of them. No one spoke a word. Qi Ao Shuang also sat there silently.</p><br/><p>Lenny’s eyes, however, were fixed on Qi Ao Shuang. Her eyes were filled with killing intent and resentment.</p><br/><p>Murderous intent? Qi Ao Shuang frowned. She did not make a mistake. The way Lani looked at her was filled with killing intent. Did she want to kill him? Why? Qi Ao Shuang frowned, but she couldn’t figure it out. He didn’t seem to have provoked her, right?</p><br/><p>How could Qi Ao Shuang know what Lenny was thinking? It was a great insult to Lenny to be told such cruel and heartless words in front of Qi Ao Shuang. Her true love was forced to be mercilessly trampled on by Tanth, who felt no love for her. It would be fine if it was just the two of them talking in private, but it was done in front of Xiao Ao Shuang. No matter how she tried, she couldn’t swallow her anger. That humiliating scene was seen by others. Absolutely not! Who is she? She was one of the four school beauties, Lenny! She was the pride of the stars and moon!</p><br/><p>Never let anyone else know what had happened to her with forced Tanth. Because such a thing was too humiliating. He would let those girls who hated her know and mock her ruthlessly? No! Her haughty pride would never allow such a thing to happen!</p><br/><p>Lenny was glad that Qi Ao Shuang had not told Jonathan what had happened between her and forced Tance. Otherwise, with Jonathan’s personality, he would have already been trumpeted and mocked wantonly. There was still time! Never let anyone know what had just happened, especially Jonathan!</p><br/><p>Lenny saw the look in Qi Ao Shuang’s eyes turn colder and colder. He made up his mind in his heart that he would kill him here! No one could say for certain what had happened to her when she died in the swamp. That was why Lenny did not leave the Tower immediately. Instead, he waited for her admirer to arrive and asked Simi to kill Xiao AoShuang stealthily as she passed through the swamp.</p><br/><p>“Hmph, I don’t want to waste my breath with you today.” Simi suppressed the anger in her heart and said in a deep voice.</p><br/><p>“Tsk, you think I want to waste my breath on you? I see some people who are losing their appetites!” Jonathan grunted disdainfully, ignoring Lenny’s extremely embarrassed expression. He turned around and sat beside Qi Ao Shuang, giggling. “Qi Ao Shuang, are you leaving?”</p><br/><p>“You go first.” “I’ll be late.” Qi Ao Shuang replied lightly. Right now, she didn’t want to use Momo to lead the way and leave. She wanted to see if she could figure it out just like what Dittas had said.</p><br/><p>“Oh, then I’ll be leaving first.” “Be careful.” After saying that, Jonathan stood up with a smile and looked at the marsh ahead, not moving for the time being.</p><br/><p>After a long time, Jonathan lowered his toes and leaped forward. Mao Mao grunted in displeasure. He watched Jonathan leave, but did not dare to chase after him. Obviously, Momo, who was afraid of being bullied, knew that Jonathan was not an easy target, so she didn’t go and provoke him. Instead, he turned his head and glared at the others on the shore with his beady eyes.</p><br/><p>“Let’s go.” The demon man let out a low grunt, before taking the lead to leap forward. At the same time, he also unceasingly released the magic in his hand. It was a gentle wind attack, hitting the rocks, determining which rocks were real and which were empty. Still, it is dangerous. Sometimes the next solid rock was too far away for him to jump over. The floating rock below his feet couldn’t withstand the force and quickly sank down. The corrosive sewage instantly rushed up. Several times, it almost landed on the man’s feet.</p><br/><p>Qi Ao Shuang looked at the spell the man cast, grasping the power of the spell very well. He could find out which rock was real and which was fake. However, after he lightly attacked the solid floating rock once, he could only bear to step on it again. He could not bear to step on it a second time. This way, the others wouldn’t be able to follow behind him and take advantage of him. This magic, this power, how could he control it so precisely? Qi Ao Shuang sighed with emotion. Those rocks and rocks were able to cause even the light attacks of wind magic to waver. If any other magic attacks were sent towards her, she would probably be sunk by them.</p><br/><p>The other three men began to move as well, each using his own method. Mao Mao was talking excitedly as he swam back and forth on the swamp, chasing after the demon man from before. Then the three men were on their way.</p><br/><p>Qi Ao Shuang sat there without moving, maintaining her vigilance. Because she could feel her eyes burning behind her back, she knew without thinking that it was Lenny.</p><br/><p>In the blink of an eye, those people vanished into the miasma in the swamp. The sound of gurgling water could be heard incessantly. It was obvious that the sound was coming from Momo’s mouth. What followed was a roaring sound, and Momo’s excited gurgling sound. Speak out. Say. Say. Say. Quickly. Say. No. Bounce. Flip. Flip. Flip. Flip. Flip. Flip. Flip. Flip. Flip. Flip. Fit. Flip. Flip. Flip. Fit.</p><br/><p>A miserable shriek came from the miasma in the distance.</p><br/><p>Lani’s expression slightly changed. In front of him, there were probably some people who were unable to withstand the attack of the beasts under such vile conditions and were injured. After all, those few people were experienced enough to walk out of this swamp alive.</p><br/><p>Simi’s eyes fell on Qi Ao Shuang, her heart filled with joy. When he saw Jonathan, that bastard, talking to this red-haired kid, he was afraid they would get together. If they went together, Jonathan would certainly help him, and he wouldn’t be able to do it. But now, this red-haired kid stayed behind.</p><br/><p>Qi Ao Shuang didn’t leave, and so did Simi and Lani. The three of them stayed on the shore silently, each with different thoughts.</p><br/><p>At this moment, Qi Ao Shuang was feeling rather frustrated. These two people here were like a ticking time bomb. He couldn’t release his mind to sense the surroundings.</p><br/><p>The three of them continued to remain in a deadlock. It was not good for Simi and Lenny to act here. If they were to die on the shore, leaving behind any clues would not make them feel better. To be able to reach the eighth floor meant that he shouldn’t be weak either. If she couldn’t kill him in one hit, Simi wouldn’t take the risk and attack Qi Aoshuang on the shore. After a long time, Lenny and Simi looked at each other with impatience in their eyes. If this continued, how long would it last? The two exchanged a look, not wanting to delay any longer. What the hell was this red-haired kid doing? If he didn’t go there and didn’t leave the Sky Tower, why was he sitting there silently?</p><br/><p>“Lenny, that monster went after them. How about I take you there? I’ll explore the rock first and find the correct rock. I’ll take one step and you will take one.” “This treasure is for you, it can withstand the sewage.” At this moment, Simi intentionally spoke up, taking out the treasure he had relied on last time and handing it over to Lenny. In fact, this method was simply unworkable. Many of those solid rocks were unable to bear the weight of the rock a second time, and only a few were able to withstand the power a second time. That’s why the students have to find their own way through here. There was also the fear of beasts and fur appearing and disappearing, and it was unknown when it would appear to attack people. It was extremely terrifying. However, what Simi was thinking was that this red-haired kid had just arrived and definitely didn’t know this. Tempt him to follow him. Now that the beast was gone, all he had to do was lure the kid up into the swamp and get rid of him before sending Lenny back. He knew that with his current strength, he could only rely on that treasure to barely pass. It was impossible to get past Lani without a treasure. However, the beasts were not present, and they were not far from the shore. There shouldn’t be any problems.</p><br/><p>“Huh?” “Lenny was a little stunned, then he understood what Simi meant. He nodded and purposely shouted,” Alright, Simi, thank you. The monster must have gone after them and wouldn’t be back for a while. “Let’s hurry up and leave.” Lani glanced at Qi Ao Shuang from the corner of his eye, observing her movements.</p><br/><p>With Lani, Simi carefully found a rock, then found a rock for Lani as well. Worried, he looked at the sewage under the miasma in the distance, afraid that the ferocious monster would suddenly appear.</p><br/><p>At this time, Qi Ao Shuang also slowly stood up.</p><br/><p>Simi and Lani were overjoyed. They exchanged a secret glance, unable to conceal the delight in their eyes.</p><br/><p>However, what they didn’t notice was that Qi Ao Shuang’s mouth had a hint of a cold arc on it.</p><br/>\n</div>"}