{"title": "Chapter 272", "id": 272, "volume": 3, "url": "http://boxnovel.org/stunning-edge-chapter-272", "volume_title": "Volume 3", "body": "<h1>Chapter 272</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Stunning Edge – C272</strong></p><br/><p>Qi Ao Shuang stared at the terrifying scene before her eyes, but she didn’t hesitate as she continued walking forward. He entered this place that was like an Asura hell.</p><br/><p>So hot, yet so cold. It was very strange, very contradictory, but there were two feelings that existed at the same time.</p><br/><p>This was the feeling Qi Ao Shuang had. It was extremely hot on the ground. Waves of terrifying heat crazily swept up from the bottom of his feet. In the sky, however, incomparably cold ice cones continued to fall, gusts of cold wind blowing. As expected, the shoes gave off a burnt smell. Even though Qi Ao Shuang did not touch the ground, she still ended up with the same result. Qi Ao Shuang did not touch the ground, but let the wind gently support her, allowing her to move forward a few centimeters. Even so, his shoes still smelled like scorch.</p><br/><p>The corners of Qi Ao Shuang’s mouth twitched as she took off her shoes and threw them into her interspatial ring, floating barefooted on the scorching hot ground. The ice cones continued to fall from the sky, and Qi Ao Shuang easily dodged them.</p><br/><p>As they walked forward, the ice cones in the sky became denser, and the flames on the ground became more frequent, making it impossible to guard against.</p><br/><p>A figure gradually appeared in front of them. It was obvious that this figure was the one who had entered the area earlier. It was a man. He walked in front at a moderate pace. A pair of black wings spread out from his back like a huge umbrella, easily blocking the dense ice cones falling from the sky. When the icicle landed on his wings, it actually did not leave a single wound. He was walking on the ground barefooted, and the flames did not harm him in the slightest. On the contrary, most of his clothes were burnt and he was nearly naked.</p><br/><p>The demons …</p><br/><p>As soon as Qi Ao Shuang saw that person’s figure, she immediately understood the other party’s identity. That pair of wings and the strength of his body had explained everything.</p><br/><p>That person only glanced at Qi Aushuang indifferently when he felt her approach. He did not say anything and continued to walk forward leisurely.</p><br/><p>However, when Qi Aushuang continued walking forwards, the look in his eyes gradually turned to one of astonishment.</p><br/><p>He could also tell that Qi Ao Shuang’s identity was that of a demon. However, the opponent did not spread out his wings to block the falling ice cones. Instead, he continued to dodge the falling ice cones in the sky. His body was so nimble and strange, and as he kept looking around, he could see a lot of shadows floating around. As for Qi Ao Shuang’s physical body, it was getting further and further away.</p><br/><p>As he watched Qi Ao Shuang disappear into the distance, the man seemed to have thought of something. Looks like there will be a dark horse this year. There was not a single gold star on the clothes of this youth. It seemed that he was only a freshman. Could such a movement technique successfully pass through the eighth level? At this moment, his heart was filled with anticipation.</p><br/><p>Qi Ao Shuang groaned in her heart, because this path seemed to have no end. … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … He had been walking for nearly five hours, but he had yet to reach the end. It wasn’t that Qi Ao Shuang didn’t have enough stamina to continue moving forward, but she encountered the same embarrassment as the man. Her clothes seemed to not be able to withstand the heat of the flames and were slowly burnt. Even though this body belonged to a man, that did not mean that Qi Ao Shuang did not mind. Furthermore, even at critical moments, that man could surround himself with those sturdy wings to prevent exposure, but Qi Ao Shuang still had no way to transform this body. She could only maintain this appearance and couldn’t display those huge black wings.</p><br/><p>Fortunately, after half an hour, they finally saw the end of the area.</p><br/><p>Xiao Ao Shuang hurriedly hopped to the edge of the room and looked around to make sure there was no one around. She then quickly took out clothes from her storage ring and changed into them before putting on her shoes.</p><br/><p>“Whew ~ ~” Qi Ao Shuang heaved a sigh of relief. Only now did he realize how tired he was. After spending quite a bit of time and effort walking through this bizarre place that was like the Asuras, it was time to take a rest.</p><br/><p>Qi Ao Shuang looked around and saw rocks with uneven sides. After giving it some thought, he found a secluded spot and sat down cross-legged, beginning to adjust his breathing. It had taken her a lot of effort to travel for the past few hours. Qi Ao Shuang slowly closed her eyes. She felt the power of the ‘Wind Origin’ in her body and gradually entered into a wondrous state of complete self-oblivion.</p><br/><p>After an unknown period of time, Qi Ao Shuang was woken up by two voices.</p><br/><p>“Phew, every time I pass by this place, it feels so uncomfortable.” This voice was very tired, but it was one that Qi Ao Shuang had heard before.</p><br/><p>“Yeah.” “Without these things, we really wouldn’t have been able to get here.” The other voice was also very tired, but there was a hint of pride in it. Qi Ao Shuang had heard this voice before. These two fellows were the protectors of the flower by Bethany’s side. It was obvious that Bethany didn’t go with them, because what she said next was a bit unpleasing to the ears.</p><br/><p>“That slut Bethfennie, to think that the two of us risked our lives to bring her to the sixth floor. He didn’t even say a word of thanks.” The first voice sounded unresigned.</p><br/><p>“Be patient, Beharu. One day the bitch will fall into our hands. We can do whatever we want. ” This voice was extremely vulgar and lecherous.</p><br/><p>“Haha, Daes, you’re right.” That coquettish woman’s body is really too comfortable. At that time, she will definitely make us want to die, haha. “The feel of his hands must be extremely good.” The man named Berharu chuckled, as if what he said had already happened.</p><br/><p>“At that time, we’ll torture this coquettish woman properly.” “Let her beg for mercy. We’ve done so much for her, but she doesn’t care. Don’t think that your father doesn’t know. She has always had someone in her heart.” Dazzling said hatefully.</p><br/><p>When Xiao Ao Shuang heard this, his heart skipped a beat. There had already been people in Bethfennie’s heart. Could it be …</p><br/><p>“Tch, you think only you can feel it?” Can’t I feel it? Every time she went to the hotel she ordered the same dish. When the dishes were served, he would always eat them. He would always stare blankly at the dish in front of him. “That look, isn’t it like he’s thinking about men?” “Let me know who that man is. I will first castrate him and then cut him into a thousand pieces and feed him to the dogs.”</p><br/><p>As she spoke up to here, it was already clear in her heart. As expected, Bethany couldn’t stop thinking about Wynes. Wynes, too, was haunted by the memory of Bethany. Just like that, Qi Ao Shuang had already made up her mind.</p><br/><p>“Hai, I’m just saying.” “You know, this slut’s background isn’t something you can rashly attack.” Dazzling sighed, “She is the daughter of the Jade City Lord.”</p><br/><p>“I know. Why else would we curry favor with her?” “Sigh, if I can’t rape her, can’t I even think about it?” Berharu said with a sigh, unwilling to accept this.</p><br/><p>“When we subdue her, we’ll have everything. “Let’s keep going.” Daes felt helpless. Although he spoke so viciously just now, he didn’t dare to rashly attack Bethany. The power behind that woman was not something they could afford to provoke.</p><br/><p>“En, at most, I’ll just cook her rice and put some medicine on her to make her take the initiative.” It’s not that we forced her, it’s that she forced us, and then she would have nothing more to say, and it would be us who would save her. “Hehe …”</p><br/><p>“Woah, then who’s going first?”</p><br/><p>The two of them were completely lost in their thoughts.</p><br/><p>“Which one of you will die first?” However, just as they were about to reach their climax, a cold voice suddenly reached their ears, interrupting their beautiful YY.</p><br/><p>“Who?!” Both of them exclaimed in surprise with cold sweat dripping down their backs. Someone was here! In other words, their words just now had been clearly heard by everyone. [What the hell?]</p><br/><p>Qi Ao Shuang slowly stood out from the hidden corner, looking at the two of them with an ice-cold expression.</p><br/><p>“It’s you!” The two of them were first shocked, then looked at Qi Ao Shuang with dark and vicious eyes. They already had a plan in their hearts. They had to kill Qi Ao Shuang here. Not only did Qi Ao Shuang reject them twice in a row, she had to get revenge for it. … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … Just based on what Qi Ao Shuang had said to the two of them earlier, she wanted to kill him here.</p><br/><p>“It’s me.” Qi Ao Shuang said passively, “What a coincidence.”</p><br/><p>“What a coincidence, what a coincidence! Hahaha …”</p><br/><p>“What a coincidence!”</p><br/><p>The two of them started to laugh maniacally, and looked at Qi Ao Shuang as if they were looking at a dead man. In their eyes, Qi Ao Shuang was already a dead man. However, they didn’t expect that Xiao Ao Shuang would arrive here before them, with a relaxed expression on her face. The two of them only thought of the fact that Qi Ao Shuang was a freshman, and now they had to kill him without thinking about anything else. He never expected that Qi Ao Shuang’s strength would be above theirs.</p><br/><p>Qi Ao Shuang smiled as she looked at the two people in front of her. The killing intent in their eyes was so obvious.</p><br/><p>“Kid, how do you want to die?” Dazzling grinned as he slowly approached Xiao Ao Shuang, “Is it cut into pieces by an ice pick or burnt to a crisp by a flame?”</p><br/><p>“My luck is good today.” Heaven has its ways, but you will not take them. Hell has no doors, yet you barge in. We were wondering when we’d talk to you. ” Berharu laughed out loud.</p><br/><p>Looking at the two who were filled with killing intent, Qi Ao Shuang helplessly and innocently sighed and said, “Are you going to kill me if I don’t kill you today?”</p><br/><p>The two of them were stunned for a moment before they started laughing out loud. It was as if they had heard the funniest joke in the world. This red-haired kid wanted to kill them? Kill them? Ha ha-ha ha! What kind of joke was this?</p><br/><p>However, Xiao Aushuang only smiled faintly, she had already moved.</p><br/><p>Dazzling and Berharu were stunned, because Qi Ao Shuang’s figure suddenly vanished from their sight. When the two of them finally reacted, Qi Ao Shuang was already in front of them.</p><br/><p>Bang!</p><br/><p>Dazzling’s entire body flew up into the air, before flying backwards like a kite with its string cut, before falling into that terrifying Asura region.</p><br/><p>“Swish, swish, swish ~ ~ ~”</p><br/><p>Ah — — —!</p><br/><p>Dazzling’s miserable scream rang out, and then suddenly, there was no sound.</p><br/><p>Dazzling ice cones stabbed into Dazzling’s body, ferociously stabbing him into the scorching ground. Flames instantly rose from the ground and roasted him into charcoal.</p><br/><p>All of this happened in a split-second. Beharu didn’t even see Qi Ao Shuang’s movements clearly. Dazzling was actually dead when countless ice cones stabbed into his body in midair. At that time, he had already been cut into several pieces by the ice cones. Blood flew everywhere before falling to the ground and being roasted into several pieces. This way of dying was what he had arranged for Qi Ao Shuang to die, and now it was all on him.</p><br/><p>Beharu looked at this scene in a daze. At this moment, he even forgot his fear, only looking at the scene in front of him with disbelief. The person who had been with him earlier was now dead without a complete corpse!</p><br/><p>“What about you?” “How do you want to die?” Qi Ao Shuang’s smile was like a flower. At this moment, her beautiful smile was as terrifying as a death god in Berharu’s eyes.</p><br/><p>Only then did he come back to his senses. He wanted to run, but his legs kept on shaking, as if they were rooted to the ground. He couldn’t move even half a step.</p><br/><p>“I, I …” “Don’t kill me, I can promise you anything.” Berharu’s voice trembled, but the fear in his eyes could not be hidden. Only then did he consider the question he had not thought of earlier. This red-haired youth had arrived here before them! Moreover, he looked so relaxed. He must have recovered after coming here for a long time. Why didn’t they think that this youth would be able to beat them here? His strength shouldn’t be weak!</p><br/><p>“Oh?” “Accept everything?” However, Xiao Ao Shuang smiled carelessly, looking lazily at Beharu, “Did you forget what you were talking about just now?”</p><br/><p>Beharu’s back was already soaked in cold sweat. The fear in his heart almost made him crumble. He couldn’t be blamed for being so scared. Davis’s death was too horrible, too bloody. Even if they had killed someone with their own hands, they had never seen such a terrifying technique. Quick, ruthless, accurate, it would be over without giving the other party even the slightest chance to catch his breath.</p><br/><p>“I-I was only farting a moment ago, please let me go in large numbers.” I promise you, I promise I won’t tell you what I saw today. ” Berharu was already somewhat at a loss for words, frantically begging for mercy. He then kneeled down in fear, crying and begging for mercy. He looked as pathetic as he could be. How could he still be as arrogant as he was before?</p><br/><p>“Say, if you exchange places with me, will you let me go?” Qi Ao Shuang was still smiling lazily, but she frowned innocently and said: “I gave you all a chance.” Do you forget what I said before I did it? ’</p><br/><p>Beharu was startled, but then he suddenly remembered what Qi Ao Shuang had said.</p><br/><p>Will you kill me today if I don’t kill you?</p><br/><p>Cold sweat was pouring out of Beharu’s forehead.</p><br/><p>At that time, how could they have thought that it was true? They only thought that it was Qi Ao Shuang going crazy, how could they have thought that Qi Ao Shuang actually had the power to kill them! At this time, even Beharu’s intestines turned green with regret. However, could time be reversed? Of course not!</p><br/><p>“I, I have eyes but I can’t see. Please let me go.” In his heart, Beharu was even more afraid. He continued to beg for mercy, his entire body trembling nonstop.</p><br/><p>“I said, will you let me go in exchange?” Xiao Ao Shuang laughed sarcastically.</p><br/><p>Berharu’s face suddenly sank, as if he had turned to ashes and no longer had the color of blood.</p><br/><p>Xiao Ao Shuang heaved a sigh of relief. People are always like this. He couldn’t do it himself, but he insisted on having others do it.</p><br/><p>“You demon, I’ll fight you to the death!” Beharu finally understood. No matter how he begged, he would not be able to escape this calamity. He decided to make up his mind, wanting to make the last stand.</p><br/><p>However, in the next instant, Qi Ao Shuang already appeared in front of Berharu. She stretched out her finger and gently flicked it at Berharu’s forehead. Under his astonished and terrified gaze, the last thing he saw was a sky full of ice cones.</p><br/><p>Qi Ao Shuang looked at the charred objects in the terrifying area with disdain. These two people could only reach this level with the help of their treasures, but their true strength was far inferior. The Star Academy’s survival training wouldn’t restrict such things. In the eyes of the academy’s elders, the treasures that the students brought along and those who knew how to make use of them could also be considered a type of strength. Even luck was a type of strength.</p><br/><p>The bodies of Beharu and Davis evaporated, leaving only two bright objects on the hot ground. That must be the treasure the two of them relied on, right?</p><br/><p>Qi Ao Shuang picked up the two items. One of them was a round and cool pearl, and the other was a shiny jade pendant. The clothes and undergarments of the two people had all been evaporated, leaving only these two treasures and two spatial rings. Xiao Ao Shuang kept the storage ring without any hesitation. Although the space wasn’t big, it could store items and see if there were anything valuable inside.</p><br/><p>After temporarily throwing all these items into her Spatial Ring, Qi Ao Shuang continued walking forward.</p><br/><p>What would the eighth level look like? Is it really a swamp, as Parina says?</p><br/><p>What Parina had said was right, there was a swamp on the eighth floor, but there was more to the eighth floor than just a swamp. And the swamp, as Parina had said, had to be treaded on the right rocks to get through. But not every time. In other words, this time, he had found the right path to pass through the swamp. However, the next time he would come, he would definitely not find the right path. Each rock will change after being stepped on. Don’t try to take advantage of the situation and get away with it once and for all. He had to put in a lot of effort every time he passed through here. There was also a hidden danger that Parina did not know about, so she did not say it out loud.</p><br/><p>The black sewage from the swamp bubbled and bubbled. The bubbly broke apart and the black sewage splattered everywhere. Xiao Ao Shuang stood at the edge, picking up a branch and stabbing it into the water. However, the moment she touched the branch, it immediately vanished into thin air.</p><br/><p>That can’t be true, right? So strange? Qi Ao Shuang thought for a moment and found a fresh piece of pig leg in her space ring. She poked it into the sewage, and sizzling sounds could be heard. The pork and the bones inside were instantly corroded. What was even more terrifying was that although the pig leg in his hand didn’t touch the water, it was still corroding at a speed that was visible to the naked eye.</p><br/><p>Xiao Ao Shuang was shocked, and immediately threw the pig leg towards the nearest rock. However, the rock instantly sank down and did not have the slightest buffer time. The terrified sizzling sound rang out again, and the piece of pig leg and rock sank, corroded. Only the small black bubbles were breaking apart.</p><br/><p>The corner of Qi Ao Shuang’s mouth twitched. There was no way out if he fell down.</p><br/><p>“Gu, gu, gu ~ ~”</p><br/><p>Suddenly, a strange sound came over. Qi Ao Shuang raised her head and looked over, extremely shocked. This was because she saw a creature in this enormous swamp!</p><br/><p>The marsh extended into the distance without end. Rocks and rocks were scattered all over the place, causing people to be unable to distinguish between what was real and what wasn’t. Floating in mid air was a light black miasma, with a glance one could tell it wouldn’t be easy to absorb. Under such harsh conditions, there was a living being in the corrosive marsh water, why wasn’t it called Xiao Ao Shuang’s surprise?</p><br/><p>The creature had a big head and soybean-sized eyes. It looked very strange. Its mouth was yawning, but it was ridiculously big.</p><br/><p>With a dong sound, the creature leaped out of the water like a fish out of water, splashing up countless amounts of black water. The water splashed onto the surrounding rocks, emitting a terrifying corrosive sound.</p><br/><p>In the instant that strange creature jumped out, Qi Ao Shuang was able to clearly see its appearance. His head was the size of two basketballs, but his body was so small that it was almost invisible. As he jumped, he let out a weird cooing sound.</p><br/><p>Qi Ao Shuang stared at the monster that was slowly approaching her. After thinking for a moment, she took out a large piece of pig leg and threw it at the monster.</p><br/><p>With a howl, the monster suddenly opened its mouth wide and swallowed the pig leg that was far larger than its entire body. At this moment, its mouth strangely widened several times! What was even stranger was that after swallowing such a big chunk of pig leg, its body was still pitifully small. I don’t even know where the pig’s leg was swallowed.</p><br/><p>The monster swallowed the pig leg and smacked its mouth as if it wanted to continue. She glared at Xiao Ao Shuang and did not move.</p><br/><p>What kind of creature was this? Qi Ao Shuang broke out in a cold sweat. To think that he could survive in such a harsh environment, and his mouth could instantly widen so much that he could just swallow a random person. It was even more difficult to fight with this creature. With a random leap, the black coloured sewage would splash everywhere, and it would definitely cause people to become flustered.</p><br/><p>Qi Ao Shuang did not guess wrong, and there were many experts who did not like this place. Did they find any fixed rocks that had fallen into the sewage and were corroded to death? Some were directly swallowed by this creature. Many people had suffered here before. Even the most powerful ones, who had treasures, would lose a layer of skin if they didn’t die after being splashed by this deadly sewage.</p><br/><p>There were so many rocks floating on the surface of the swamp, but they were all swaying unsteadily. One couldn’t tell what was real or what wasn’t.</p><br/><p>Qi Ao Shuang squatted to the side, looking at this terrifying place and thinking of a countermeasure.</p><br/><p>The strange creature floated to the side, staring at Qi Ao Shuang.</p><br/><p>Qi Ao Shuang and this strange creature stared at each other, not moving at all.</p><br/><p>How should he pass this level?</p><br/>\n</div>"}