{"title": "Chapter 280", "id": 280, "volume": 3, "url": "http://boxnovel.org/stunning-edge-chapter-280", "volume_title": "Volume 3", "body": "<h1>Chapter 280</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Stunning Edge – C280</p><br/><p>“Yes, Dittos, you finally understand my sincerity to you?” “I’ve been bitterly following by your side all this time, paying so much for you because I want you to look back at me, to have me in your eyes, and to have me in your heart.” Lani was excited, but also happy.</p><br/><p>Was it possible that he had finally figured it out and was finally going to face it? So happy, so happy.</p><br/><p>Lani’s breathing became hurried. The excitement and joy in his heart could no longer be described with words.</p><br/><p>Suddenly, Lenny remembered the condition of his body and started to worry again. If Dittos knew that his skin was beginning to turn black and that his beauty was gone, would he just ignore him?</p><br/><p>As soon as they entered the restaurant, a waiter came up and led them upstairs. The waiter was warm and respectful to Dittos. Clearly, he knew Dittas, and Dittas’s position was not low either.</p><br/><p>Many of the young ladies in the restaurant looked at the three outstanding youths, but none of them dared to approach them.</p><br/><p>“Tut, can you two put a softer expression on your faces?” “Who would dare talk to you beauties like this?” Jonathan bared his teeth and smiled brightly at the girls. Some of the girls immediately blushed, their hearts beating fast.</p><br/><p>“Don’t be so bored.”</p><br/><p>“Same here.” Qi Ao Shuang did not even bother to repeat herself, instead, she just spat out a single word.</p><br/><p>“Tsk, not interesting, two pieces of wood, two pieces of ice.” “Let’s see which woman will like you two in the future. Serves you right. You won’t have a wife in the future.” Jonathan’s mouth twitched in speechlessness. Suddenly, he understood the reason behind the subtle relationship between these two people. In some ways, the two men were remarkably alike.</p><br/><p>After eating together, the three of them went back to the Mayor’s mansion. Dittos arranged for two people to live in his own yard, next door.</p><br/><p>The sun and moon moved, and the night quietly approached.</p><br/><p>Jonathan yawned and knocked on Qi Ao Shuang’s door, “Qi Ao Shuang, Qi Ao Shuang …”</p><br/><p>The door opened, and Qi Ao Shuang looked at Jonathan, who was still yawning, and frowned. “Where is the Dittos?”</p><br/><p>“I have something to take care of first. I want us to go wait for him at the Gargle Cliff in the half of the forest.” Jonathan yawned impatiently. “I don’t know what he’s up to, mysterious.”</p><br/><p>Qi Ao Shuang remained silent, a serious look appearing in her eyes.</p><br/><p>“Then let’s go. I don’t know the way, so bring me there.” Qi Ao Shuang said.</p><br/><p>“En, let’s go. That guy told us to secretly leave. Come with me.” Jonathan seemed to be very familiar with the layout of Nine Heavens City’s mansions. He quietly left the city with Qi Ao Shuang and headed towards the city wall. He secretly passed through the city wall and left the city.</p><br/><p>After leaving the city, Jonathan brought Qi Ao Shuang to the south.</p><br/><p>“Half of the forest is relatively desolate. Because there are some dangerous magical beasts and plants, ordinary people wouldn’t go there. I don’t know what Dittos is up to. ” Although Jonathan complained, he still listened to Dittas’ instructions and quickly ran in the direction that Qi Ao Shuang pointed out.</p><br/><p>The two of them moved quickly, and before long, they had arrived at the place that Dittas had mentioned. As soon as he entered the forest, he was greeted by a wave of cold air. Occasionally, there would be strange bird cries. When he got to the edge of the cliff, Jonathan stood on the edge and looked down, shivering. Under the hazy moonlight, the bottom of the cliff could not be seen. Waves of cold wind blew over, making people feel very uncomfortable.</p><br/><p>“What’s Dickens thinking?” Tell us to come to such a gloomy place in the middle of the night. ” Jonathan turned around, found a big rock, sat behind the rock, and called to Qi Ao Shuang. “Come here, sit here.” Blocking the wind. Just wait for him here. ”</p><br/><p>Xiao Ao Shuang looked around but did not say anything. She sat beside Jonathan.</p><br/><p>“What do you think Dickens called us here for?” Jonathan blinked his eyes and looked at Qi Ao Shuang.</p><br/><p>Qi Ao Shuang shook her head lightly, but in her heart, there was a strange and indescribable feeling.</p><br/><p>After a while, a voice came from afar.</p><br/><p>“Someone’s coming.” Jonathan was about to get up and see if Dittos had arrived when he heard a voice that made him sick.</p><br/><p>“What did you call me here for, Dittos?” This voice was Lenny!</p><br/><p>Qi Ao Shuang and Jonathan looked at each other and saw the doubt in each other’s eyes.</p><br/><p>After a moment of silence, Dittens’s deep voice rang out, “You don’t want to be alone with me?”</p><br/><p>“No, how could I not?!” Lenny’s voice rang urgently.</p><br/><p>Jonathan rolled his eyes.</p><br/><p>However, Qi Ao Shuang had an ominous feeling in her heart. Though he had not been with Dittas very long, he had some knowledge of his character. Dittos would not have said such a thing, for he had never put Lenny in his eyes.</p><br/><p>But what did he mean by that now?</p><br/><p>“I know you’ve always liked me.” There was no ripple in Dittos’s voice, as if he were stating something that had nothing to do with him.</p><br/><p>“Dittas, you, you, you finally understand my heart?” Lenny’s voice was filled with excitement that could not be hidden.</p><br/><p>“Yes, I always did.” “If you like me, I’ll call it that. It doesn’t matter if you use some tricks on my sister, but you should never play any tricks on Keira.”</p><br/><p>“Di, Dittas, you, what did you say?” “I don’t understand.” Lenny’s voice was a little frantic.</p><br/><p>Jonathan narrowed his eyes, grinning silently. He did not even need to look to know that Lenny’s expression was wonderful. It would definitely be ugly to death, how wonderful.</p><br/><p>Qi Ao Shuang furrowed her brows, the strange feeling in her heart getting stronger and stronger.</p><br/><p>“Keira’s character really still has to be tempered. But if he continues to be misled by you, he will never grow up right. He wouldn’t be able to become a qualified mayor in the future. But it doesn’t matter to me what happens to him. ” Dittos’ voice was like an old, silent well, calm and cold.</p><br/><p>“Dittas, Dittas, what the hell are you talking about?” Lenny’s voice became more and more frantic, the black face under the veil faintly revealing traces of red. The fear and panic in her were growing stronger. Originally, he thought that Dotans had asked him to come here with him to spy on him, and thought that Dotans had already understood his intentions, so he thought that he would have a response tonight. But that does not seem to be the case now. Could it be that she had called him here to criticize him?</p><br/><p>“I don’t care what happens to him. I don’t care whether he lives or dies.” However, if anything happens to him, my sister will be very sad. So, I don’t want to see my sister upset. ” Dittos turned and looked at Lenny coldly.</p><br/><p>Lenny was somewhat flabbergasted. Did he care about Keira’s life or death? The boy was his nephew! Did Dittos only care about his sister? Why, because Dittas was raised by his sister? But why did it feel so strange and a little panicked? Why did Dittens speak of Keira as if he had nothing to do with it?</p><br/><p>“You even incite Keira to embarrass Qi Ao Shuang today, right?” It seemed like he was asking something, but he was already sure of it.</p><br/><p>Lenny was dumbstruck, wanting to argue for himself, he moved his lips, but he could not say anything. She knew Dittas’s character, and if he had decided something, it would be useless to argue.</p><br/><p>“You …” Dittos slowly approached Lenny, his face calm.</p><br/><p>Lenny stared at Dittas in a daze, but he was a little afraid. Unconsciously, he retreated backwards as Dittos closed in.</p><br/><p>“Don’t move.” A hint of a smile suddenly appeared on Dylan’s face. This smile was enough to shock a person’s soul. Lani was completely stunned, and he lost his mind at this moment.</p><br/><p>Lenny, as if possessed, stood obediently where he was and did not move again.</p><br/><p>“Lenny, do you really like me that much?” “Is it the most sincere to my heart?” A devilish smile appeared on Dittas’s calm face. There was a bitter coldness in his smile that Lenny could not feel.</p><br/><p>“Yes, Dittos, you finally understand my sincerity to you?” “I’ve been bitterly following by your side all this time, paying so much for you because I want you to look back at me, to have me in your eyes, and to have me in your heart.” Lani was excited, but also happy. Was it possible that he had finally figured it out and was finally going to face it? So happy, so happy. Lani’s breathing became hurried. The excitement and joy in his heart could no longer be described with words. Suddenly, Lenny remembered the condition of his body and started to worry again. If Dittos knew that his skin was beginning to turn black and that his beauty was gone, would he just ignore him?</p><br/><p>Dittos slowly approached Lenny and stood in front of her, smiling without saying a word.</p><br/><p>“Well, Dittos, I, I was really happy today. I feel really happy. ” Lani clutched at his chest, a blissful smile on his face. He made up his mind in his heart to find a name to cure his illness as soon as possible. If not, everything would have vanished into thin air when Dittas saw his true face.</p><br/><p>Jonathan clenched his fist behind the rock and thrust it into his mouth. His eyes widened in disbelief as he stared at Qi Ao Shuang. Was there a mistake?! Dittos called them over just to see them kiss me? To see him accept Lenny’s dead hen? Now the dead hen was dead, and the wish of many years had finally come true.</p><br/><p>How infuriating! How infuriating! Jonathan put down his fist, opened his mouth and repeated the word silently. Xiao Aushuang naturally knew what he was talking about from the way he mouthed it.</p><br/><p>Had Dittas really only asked them to come here so that they could see how he accepted Lenny’s intentions?</p><br/><p>The strange feeling that had been haunting Qi Ao Shuang was becoming more and more obvious.</p><br/><p>What do you want, Dittas? He was not here to make love to Lenny, as Jonathan had guessed. What did he want?</p><br/><p>“Let me see your sincerity.” The corner of his mouth curled up as he said those words with a smile. Lani was so happy that he was about to faint. After all these years of hard work, he finally had a reward. The Dittos who had been deeply in love finally accepted him! … … … … … … … … … … … … … … … … … … … … … … … … … … … … … Lenny was about to reach out and hug Ditto, but.</p><br/><p>In the next moment, Lani, who was immersed in happiness, was stunned, and her chest turned cold. He lowered his head to look at the item in his hand. It was red and seemed to be still pulsing …</p><br/><p>Then, what was it?</p><br/><p>Heart! That was his heart!</p><br/><p>Lenny’s eyes widened, and his pupils contracted in a split-second.</p><br/><p>“Actually, I’ve forgotten to tell you.” “Love, I don’t need such a boring thing.” He threw the heart in his hand to the back of his body. With a little bit of blood on his heart, he drew a devilish arc in the air and fell into the bottomless abyss, disappearing without a trace.</p><br/><p>Lenny’s face was full of terror, incredulous. His eyes were wide open as he stared at Dittas, as if he wanted to see this man clearly at the end of his life. The man he had always loved. He had actually killed her without any forewarning at all …</p><br/><p>With a “Bang!”, Lenny’s body fell heavily on the ground, stirring up waves of dust.</p><br/><p>Dittos looked at the corpse on the ground indifferently, without any expression on his face.</p><br/><p>“Holy shit!” Dittos, haha, you really did it. “You really killed this woman?” Jonathan jumped out from behind the rocks, excited. You don’t know, she’s done too much dirty work behind your back. She had always been acting haughty, but now she was secretly looking for those men to coerce and coerce her. “Vicious woman, you’re dead today. Retribution.” The more Jonathan spoke, the more disdainful he became. He looked at Lenny’s corpse on the floor and almost vomited water. It was no wonder that he had such an attitude. On the surface, the two of them had been at loggerheads the entire time. Lenny didn’t want Jonathan’s life for a day or two.</p><br/><p>Qi Ao Shuang also slowly stood up from behind the rock. She looked at Lenny, who was lying on the ground, and did not say anything. Although Lenny wanted to kill him, he didn’t plan on letting Lenny go either. However, Xiao Ao Shuang did not expect that the one who had ended Lenny’s life would be Dittas.</p><br/><p>“I didn’t kill her before because I didn’t repay my debt. It’s all over now. ” “So there’s no need to put up with her now.”</p><br/><p>Xiao Ao Shuang raised her head and looked at the calm Duttens, looking at his cold eyes. Qi Ao Shuang felt an indescribable chill in her heart.</p><br/><p>If Lenny had died in his own hands, or in Jonathan’s, it would not have felt that way. However, she had died at the hands of the man she had always loved.</p><br/><p>“Throw it down.” Dittos said coldly to Jonathan.</p><br/><p>“Oh, okay.” Jonathan knelt down and pulled Lenny’s corpse which had turned cold. Then, he threw Lenny’s corpse off the cliff. In mid-air, the wind blew past, revealing Lenny’s face, which had already turned slightly black.</p><br/><p>Xiao Ao Shuang stood at the side without saying a word.</p><br/><p>“Let’s go back.” Dittos spat out a sentence indifferently.</p><br/><p>“Oh, okay.” Jonathan squinted his eyes with a smile and jumped ahead first. “I’ll go back first. I’m so excited that I can’t fall asleep tonight.”</p><br/><p>Jonathan hopped away, Dittos and Qi Ao Shuang trailing behind.</p><br/><p>“Do you know why I called you here?” With a calm expression on his face, Dittos asked this question.</p><br/><p>Qi Ao Shuang remained silent and did not reply.</p><br/><p>“Call Jonathan because he has a grudge against Laney. “I called you here for another purpose, do you understand?” Dittos asked in a deep voice.</p><br/><p>Qi Ao Shuang did not say anything. Dittos did not say anything either, silently waiting for Qi Ao Shuang’s reply.</p><br/><p>“You want to tell me that the path to the strong cannot be tied down by love.” After a long while, Qi Ao Shuang finally said those words in a deep voice.</p><br/><p>“As expected, in this world, you are the only one who knows my heart.” Dittos turned to look at Qi Ao Shuang and smiled.</p><br/><p>Qi Ao Shuang looked at the smile on his face, and an indescribable coldness arose in her heart.</p><br/><p>Suddenly, he remembered what Vast Sky had said. This man was very dangerous.</p><br/><p>“I hope that you can step into the Void Shattering Realm with me.” Looking at Xiao Ao Shuang, Ditty said seriously, “You are the only one who can do that.”</p><br/><p>Xiao Ao Shuang looked at the handsome but indifferent face of Dittas and was speechless for a long time.</p><br/>\n</div>"}