{"title": "Chapter 290", "id": 290, "volume": 3, "url": "http://boxnovel.org/stunning-edge-chapter-290", "volume_title": "Volume 3", "body": "<h1>Chapter 290</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Stunning Edge – C290</p><br/><p>Qi Ao Shuang had already made up her mind. Now all we have to do is find Wynes and break the sky.</p><br/><p>When Qi Aushuang saw Wynes, Wynes’ face was ashen, his eyes bloodshot, and he looked extremely dispirited. Clearly, he had found out about Beelzefini’s engagement. This must be because he felt hopeless.</p><br/><p>“Wynes…” Qi Ao Shuang called out softly.</p><br/><p>Wynes didn’t seem to hear him. He just sat there, not moving at all.</p><br/><p>“Bethany’s here.” Qi Ao Shuang lightly shook her head and let out a sigh.</p><br/><p>As expected, Wynes jumped up as if his butt was a spring. Staring with widened eyes, he looked around in fear, but all he saw was the calm face of Qi Ao Shuang.</p><br/><p>“You’re awake?” Xiao Ao Shuang asked curiously.</p><br/><p>“I wish I’d never wake up.” Wynes said dispiritedly and sat down again.</p><br/><p>“Won’t fight for it?” Qi Ao Shuang sat at the side and explained.</p><br/><p>“Fight for it?” Of course I do! I wanted to fly to her and take her. But will she promise to leave with me? “Can I take her away?” Wynes smiled wryly, his face full of grief.</p><br/><p>“And if I say you can be with her without taking her?” Qi Ao Shuang looked at Wynes with a smile that was not a smile.</p><br/><p>Wynes was stunned. He turned to look at Qi Ao Shuang and asked uncertainly, “What do you mean?” “Qi Ao Shuang, what do you mean?”</p><br/><p>“What if you are the City Lord of Nine Heavens City?” What do you think your chances of marrying her are? ’ The corners of Qi Ao Shuang’s lips curled up as she asked mockingly.</p><br/><p>“That’s for sure.” What a pity …. Wynes revealed a mocking smile as he said calmly, “Unfortunately, I’m not the city governor, and I can’t become one.”</p><br/><p>“And if your brother dies?” “Then will your father’s hearts support you?” Qi Ao Shuang continued with a faint smile, “I have seen your so-called brother’s son before, but he did not grow up.” No one with eyes will support him. ”</p><br/><p>“What?!” When Wynes heard what Qi Ao Shuang said, his heart skipped a beat and his face changed, “You, what are you talking about?!”</p><br/><p>“Do you think that your brother will let you go when he finds out about your current strength?” Perhaps he already knows that action is being taken? ” Qi Ao Shuang smiled coldly. Such a judgment is not without merit, and I believe that Wynes knows better than anyone else.</p><br/><p>“But what can I do?” “After all, he is the legitimate one, and I …” Wynes’s face darkened, he lowered his eyes and murmured, “And I’m nothing.”</p><br/><p>“I just want to ask you, if he’s gone, will you be able to get your father’s people to support you?” Xiao Ao Shuang couldn’t be bothered to say anything more, directly asking this question.</p><br/><p>“Yes!” Wynes’ eyes flashed with determination as he resolutely replied.</p><br/><p>“That’s good.” I will help you with that man. When it’s over, act immediately. Let’s get in touch now. ” Xiao Ao Shuang stood up and patted Wynes on the shoulder. “Also, think of a way to get out of here.” “If she doesn’t know that you are the next City Lord, she probably won’t agree to marry you.”</p><br/><p>“Qi Ao Shuang!” Wynes stood up abruptly, looking at Xiao Ao Shuang with shining eyes, but he did not say anything. However, his eyes flashed with a strange light, and he held onto the hand that was on Xiao Ao Shuang’s shoulder.</p><br/><p>“Don’t say too much.” “Wynes, there’s nothing to say.” With a faint smile, Xiao Ao Shuang withdrew her hand and patted on Wynes’.</p><br/><p>Wynes’s lips were quivering. He looked at Xiao Aushuang and seemed to have thousands of words to say. However, in the end, he didn’t say anything.</p><br/><p>“Let’s do it now.” Xiao Aushuang kept her smile and spoke seriously to Wynes, “Bethany, I will help you with your appointment.” It’s easier for me to meet her as an emissary. Where are we supposed to go? ”</p><br/><p>“Uh, uh, uh …” At this point, Wynes, who was very serious a moment ago, suddenly turned red, unable to speak for a long time.</p><br/><p>Xiao Ao Shuang laughed and shook her head, “Then why don’t I ask you to come to the White Leafed Forest outside the city?” “When?”</p><br/><p>“Of course!” Wynes blurted it out without thinking. This was rather urgent.</p><br/><p>“En, I will help you with your appointment after settling this matter. Go and contact the person who supports you now.” Qi Ao Shuang did not waste any more words. She was going to urge Jonathan to deal with this matter as soon as possible.</p><br/><p>“Qi Ao Shuang …” Wynes looked at Qi Ao Shuang and shouted the three words.</p><br/><p>“That word goes without saying.” “When you were beaten like a pig and refused to frame me, you already had the qualification to not say those words.” Qi Ao Shuang smiled, nodded her head and turned around to leave.</p><br/><p>Wynes was left standing on the spot, watching Qi Ao Shuang’s back gradually disappear. A warm feeling filled his heart and gradually overflowed.</p><br/><p>A knife on the head. Indeed, it was Jonathan’s style. He had asked the woman whom he liked in the Nine Heavens City Lord to send him a secret letter, inviting him to meet her outside the city in the White Leaf Forest. Upon hearing the location, Xiao Ao Shuang felt embarrassed. It seems that the quiet place in the White Leaf Forest is really suitable for lovers to meet. More accurately speaking, it was a wild mandarin duck.</p><br/><p>“I’ll go after him and kill him in secret tonight.” Jonathan’s eyes lit up.</p><br/><p>“I’ll go too.” Xiao Ao Shuang said calmly.</p><br/><p>“Okay, sneak in. Just don’t let Ditto know.” “What if he really can’t stop us.” Jonathan lowered his voice.</p><br/><p>Qi Ao Shuang nodded.</p><br/><p>When night fell, Jonathan, Qi Ao Shuang and Jin Yan quietly left the city. Naturally, they didn’t inform Dittas.</p><br/><p>Moonlight poured down, filling the land with a hazy mist. The moonlight was mesmerizing.</p><br/><p>In the White Leaf Forest, a simple and unadorned carriage was quietly parked there. As for the horses pulling the carriage, their four hooves were all wrapped in a soft cloth as they kicked silently on the spot.</p><br/><p>“That’s the Witch’s carriage.” “Tsk, tsk, as expected of a professional hooker. Look at that horse carriage, look at those hoofs …” Jonathan found a secret place to squat and looked vulgarly at the carriage in front of him, sighing. “That silly bird is coming soon.” He would definitely not bring many people with him. At most, he would bring two trusted aides with him, and he would also not let his trusted aides approach him. “This is awesome. Watch me chop watermelons later.”</p><br/><p>“What kind of enmity does he have with you?” Qi Ao Shuang looked at Jonathan’s glowing eyes and asked in confusion.</p><br/><p>“He insulted me, he insulted my entire family!” Jonathan said through clenched teeth. He looked extremely angry and sorrowful. It seemed that there was indeed a deep hatred between them.</p><br/><p>“That’s not right, according to your personality, how could your people still be alive?” “You will only find someone to settle the score with now?” Xiao Aushuang asked in disdain.</p><br/><p>“Ehh, this, in fact, is the intelligence that he suspects my family has betrayed. That’s when I said what someone was wearing that day, and he said no. ” Jonathan rolled his eyes and said in an unnatural way.</p><br/><p>Qi Ao Shuang twitched the corner of her mouth and did not say anything.</p><br/><p>At this moment, there was a slight sound of movement in the distance.</p><br/><p>“It’s here!” Jonathan made a silent gesture and restrained his breath. Qi Ao Shuang and Jin Yan did the same and withdrew their auras.</p><br/><p>As the soft voice got closer, a man’s voice came in low, “Just wait here for me.” “Do not disturb me without my instructions.” His voice was filled with excitement and excitement.</p><br/><p>“Yes, Mayor.” The two voices responded in unison.</p><br/><p>Then a footstep came closer.</p><br/><p>Johansson looked at Qi Ao Shuang and gave her a complacent look. Look, sure enough, this pervert has a confidant, but he won’t let it get close. In order to meet with a woman, he had even given up his life.</p><br/><p>Qi Ao Shuang was speechless, this mayor …</p><br/><p>Under the moonlight, Qi Ao Shuang could see a man dressed in black walking towards the horse carriage at top speed. Even from such a distance, she could hear his breathing quicken. As expected of a lecherous animal … … … … … … … … … … … … … … … … … … … … … … … … … … … … … …</p><br/><p>“Hey, you, you go distract the dogs. “That’s okay, right?” Jonathan suddenly turned to Jin Yan.</p><br/><p>Jin Yan’s expression was calm as he nodded his head slowly. Without saying a word, he silently disappeared from his original spot.</p><br/><p>“Let’s go!” Jonathan narrowed his eyes and watched the man in black open the carriage door and spit out a word.</p><br/><p>In the next moment, Jonathan and Qi Ao Shuang appeared behind the man in black.</p><br/><p>Without any hesitation, Jonathan made his move. In the blink of an eye, the dagger in Jonathan’s hand had pierced into the man’s back. There was no sound of the sharp weapon stabbing into his chest. Instead, there was the crisp sound of metal clashing against metal.</p><br/><p>“Holy shit!” Jonathan cursed.</p><br/><p>It was obvious that the Nine Heavens City Lord had a life-saving magical equipment on him. Thinking about it, it made sense. It would be strange if the dignified city lord didn’t have a life-saving magical equipment. The common sense of the low-level mistake made Jonathan and Qi Ao Shuang did not immediately succeed. However, although Jonathan was cursing, there was no sign of panic. In any case, in his eyes, this man was already a watermelon. There was no difference between him cutting it now and cutting it later.</p><br/><p>“You!” You! “Who is it?” By now, the Nine Heavens City lord had regained his senses. His lust for love had dissipated, and he was using all his strength to roll his body to the side. He stared at Jonathan and Qi Ao Shuang with wide eyes. White and black, black and white.</p><br/><p>“It’s you guys!” The Nine Heavens City’s lord gritted his teeth in anger and fear. An envoy from the Star Academy! He was also a friend of Dittas, and he actually wanted to assassinate him!</p><br/><p>“Yes, it’s us.” Johansson grinned as he stared at the terrified Nine Heavens City Lord.</p><br/><p>Qi Ao Shuang stared silently at the person in front of her. Tonight, he had to die. It was that simple.</p><br/><p>“Someone come!” The Nine Heavens City’s lord began to shout. He knew very well that it would be impossible for him to escape from the hands of these two tonight. That was why it had naturally cried out. Now was not the time to wonder why they wanted to assassinate him!</p><br/><p>“Even if you scream your throat out, no one will answer you.” Jonathan grinned and approached the Nine Heavens City Lord.</p><br/><p>The next moment, the smile on Johansson’s face froze. Qi Ao Shuang was also stunned.</p><br/><p>There was no other reason but the fact that Dittas had appeared silently in front of them, standing in front of the Nine Heavens City Lord.</p><br/>\n</div>"}