{"title": "Chapter 328", "id": 328, "volume": 4, "url": "http://boxnovel.org/stunning-edge-chapter-328", "volume_title": "Volume 4", "body": "<h1>Chapter 328</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><div class=\"title__3i-dQ\">C328</div><blockquote><br/><p>C327 – Son of Sin</p><br/><p>“Camil…” Xiao Ao Shuang looked at this gentle smiling man in front of her. This man could not be considered a good person, but he was not a bad person either. From beginning to end, perhaps he had them in his hands, but he had never done anything against her. On the contrary, he had been guarding her in his own way. His mysteriousness and power made Qi Ao Shuang never suspect that such a man would be in trouble, but the facts in front of her showed everything. At this moment, Camil was extremely weak.</p><br/><p>“Ao Shuang, you’re finally here.” To be able to take one last look at you, to make sure you’re all right, that’s enough. ” Camil smiled weakly. Although his smile was as gentle and noble as ever, it made Qi Ao Shuang’s nose ache. To Xiao Ao Shuang, Camil was just like her family. Before she knew it, Qi Ao Shuang’s reliance on Camil had already become a natural habit, and this habit was already deeply rooted in her bones.</p><br/><p>“Camille, what’s going on?” “Is this really the place where the Fathers and the Mother live?” Qi Ao Shuang held back the pain in her nose and asked anxiously.</p><br/><p>“Yes.” Camil slowly appeared in front of Qi Ao Shuang, his eyes focused only on Qi Ao Shuang. He gently reached out his hand to touch Qi Ao Shuang’s face, but suddenly passed through it. Camille’s face darkened a little, then he smiled and said, “It’s enough for you to come.”</p><br/><p>“What the hell is going on?!” Qi Ao Shuang had a bad feeling about this.</p><br/><p>“Austen, remember my real name, Elias Camille.” Camil smiled and suddenly turned to look at Feng Yi Xuan. He said in a low voice, “Feng Yi Xuan, treat Ao Shuang well in the future.” Go back to the Ceylon Continent and live happily. ”</p><br/><p>Feng Yi Xuan was stunned. Seeing the seriousness in Camil’s eyes, he slightly frowned. “Camil, just who are you?” “What happened?”</p><br/><p>“Aushuang, this little fool, is somewhat slow-witted towards emotions. The person she likes deep in her heart is you. Even though you are sometimes very impetuous as an idiot, but you are very reliable. Every time Ao Shuang is in danger, you will be the first one to appear. I’ll trust her to you. ” Camille’s smile was as warm as jade.</p><br/><p>“Camille, what are you talking about?” It was as if he was giving orders to his successors. Pah pah! “Don’t talk like that, tell us what’s going on.” How could Feng Yixuan’s impatience bear with Camil’s ambiguous words?</p><br/><p>However, when Camil spoke of Ao Shuang’s true intentions, Ao Shuang was slightly stunned, but Leng Lingyun did not seem surprised. She just stood to the side with a calm expression, and no one could see the pain in her eyes.</p><br/><p>“I’ve set up a restriction around the place you two are standing at, so he won’t be able to detect it. Now that I’ve seen you guys, I feel at ease. Go back to where you belong. ” Camille smiled, looking at Qi Ao Shuang. “Ao Shuang, don’t forget me. My real name is Elias Camille …”</p><br/><p>As he finished speaking, Camil didn’t give any more reaction to Qi Ao Shuang or the others. His body gradually became blurry, and the air around where they stood also began to circulate rapidly.</p><br/><p>“Spatial transformation …” Dittos said these words in a low voice, his eyes filled with surprise. Who was this golden-haired, blue-eyed man in front of him? He actually possessed such a terrifying power, and he seemed to be in a very weak and unfavorable state.</p><br/><p>“No!” Camille! What’s wrong with you? What happened? “Don’t send us away, let’s go together!” Xiao Ao Shuang’s heart became more and more flustered, and she shouted out loudly. She reached out her hand to touch Camil, but she managed to pass through Camil’s body.</p><br/><p>“Ao Shuang, there’s no need to know.” All you have to do is live happily with your lover and friends. ” Camille smiled. “Nice to meet you.” After Camil finished speaking, his figure was about to disappear.</p><br/><p>“Azure Flower!” Leng Lingyun shouted in a low voice.</p><br/><p>“Hmph!” After a cold snort, Qing Hua directly extended her hand and a ray of light enveloped Camil’s body. Camil’s expression turned to one of shock. After a few seconds, he disappeared.</p><br/><p>“Camille!” Qi Ao Shuang was panicking, and she shouted out loud.</p><br/><p>“What are you shouting for!” If you want to save him, then be quiet. ” Just as Xiao Ao Shuang was panicking, the cold and impatient voice of the goddess appeared in her mind once again.</p><br/><p>“What?” Qi Ao Shuang’s pupils dilated.</p><br/><p>Qing Hua stood where she was and frowned before kneeling down respectfully towards Qi Ao Shuang, “Master, I welcome your return.” “This body, as well as the power that originally belonged to you, please take it back.”</p><br/><p>Qinghua’s action caused everyone to be stunned, and suddenly, Qi Ao Shuang felt something very important leave her body at that moment. This feeling was extremely painful, as if he was digging out his heart and lungs.</p><br/><p>“Ah …” Qi Ao Shuang lowered her head, trying her best to hold back the pain in her body. However, she was still unable to resist the pain, and she slowly squatted down.</p><br/><p>“Ao Shuang!” When Feng Yi Xuan saw Qi Ao Shuang’s abnormal state, he anxiously extended his hand to support Qi Ao Shuang.</p><br/><p>A hint of worry flashed across Leng Lingyun’s eyes, but she resisted the urge to move. She just stood there quietly.</p><br/><p>Qi Ao Shuang’s body gradually emitted a dazzling red and white glow. At some point, Golden Lotus and Liu Li had been ejected from Qi Ao Shuang’s body and were unconscious beside her.</p><br/><p>“Ao Shuang, are you alright?” “Ao Shuang!” Feng Yixuan was burning with anxiety. He raised his head to look at the blue and white flowers. A violent light flashed in his eyes, and he was about to attack them. As long as he killed this woman, everything would end.</p><br/><p>“Stop, this will harm Ao Shuang.” Leng Lingyun’s cold voice rang out, stopping Feng Yixuan’s actions. Facing the furious and anxious eyes of Yi Xuan, Leng Lingyun remained indifferent, “Doing this will only enrage her. She will devour Ao Shuang’s will right now.”</p><br/><p>Feng Yixuan’s face sank. He clenched his fists and turned his head to look at the increasingly painful Qi Ao Shuang. The pain in his heart was even more excruciating.</p><br/><p>Lily tightly held onto Jin Yan’s arm and worriedly asked in a small voice, “Elder brother Jin Yan, elder sister Ao Shuang will be fine, right?” “What should we do?”</p><br/><p>“It’ll be all right.” Jin Yan softly said these words, but his heart was already tense. Qi Ao Shuang’s face was turning paler and paler. Was this all right? Originally, he had thought that he would be able to successfully separate their consciousness after meeting Camil. However, he never expected that after coming here, this place was filled with pure energy, allowing the Auland woman in her to regain the power to separate herself after waking up. Would she take this opportunity to do anything to Ao Shuang? Jin Yan’s heart was also uneasy and anxious.</p><br/><p>His eyes grew colder and colder, and his hands tightened into fists. “Don’t be impulsive, didn’t you hear me?” “If we attack that woman now, Ao Shuang will also be in danger.” Jonathan’s low voice sounded calmly in Dittas’ ears, dispelling the same impulse as Feng Yixuan had.</p><br/><p>“It’ll be fine, it’ll definitely be fine. Be patient.” Jonathan’s deep voice seemed to have the power to soothe people, and Dittos’s clenched fist finally relaxed.</p><br/><p>Gradually, the light from Qi Ao Shuang’s body poured out, shining upon the body of Qing Hua. A painful expression slowly appeared on Qing Hua’s face, but she did not move an inch. She did not even make a sound.</p><br/><p>“Brother Jin Yan, then … what will happen to that person?” Lily tugged on Jin Yan’s arm as she asked in fear. This was only because the expression on Qinghua’s face was getting more and more painful, more and more twisted.</p><br/><p>“He’ll be consumed, and then completely gone ….” Jin Yan slowly said with a deep voice.</p><br/><p>“Ahhh!” Lily’s face changed, she looked at the blue and white flower that was suffering great pain. An indescribable feeling arose in his heart. Although that woman was very annoying, was she going to disappear just like that? For her master, she had contributed everything without any complaints, and then completely disappeared. Was this worth it?</p><br/><p>The expression on Qing Hua’s face gradually changed from pain to calmness before it slowly turned cold again.</p><br/><p>As for Qi Ao Shuang, she gradually regained her composure. The intense pain vanished, and what replaced it was a feeling of emptiness that was hard to describe with words.</p><br/><p>Qinghua slowly opened her eyes, her eyes exuding an ice-cold light, terrifying the heart and soul of anyone who looked at her.</p><br/><p>“Ao Shuang, are you alright?” Feng Yi Xuan helped Qi Ao Shuang up. His face was full of worry and his voice was trembling. He was afraid that Qi Ao Shuang would never reply to him again.</p><br/><p>“She’s fine.” Qing Hua stood up abruptly and said those words coldly. Looking at Feng Yixuan’s attitude towards Qi Ao Shuang, it was as if a thorn had pierced through her eyes.</p><br/><p>“I’m fine.” Qi Ao Shuang slowly raised her head, but her eyes were clear.</p><br/><p>She and Blue Flower were just staring at each other, their eyes cold. Qi Ao Shuang suppressed the discomfort in her body. Looking at the blue and white flowers, Qi Ao Shuang could clearly feel that the power in her body had not only recovered, but had increased to an unprecedented level.</p><br/><p>“I really didn’t expect…” He didn’t expect that… Qing Hua’s voice was incomparably cold, and a tyrannical light gradually appeared in her eyes.</p><br/><p>Xiao Ao Shuang smiled with difficulty and said slowly: “However, most of the power is still on your side.”</p><br/><p>“Hmph!” “These belong to me!” Blueflower let out a loud shout.</p><br/><p>The conversation between the two instantly became clear. Everyone now understood what they meant. Leng Lingyun was also stunned, because even he did not expect the power of that person to be separated. Or could it be that some of the forces had chosen to take on the role of the master? Thinking of this, Leng Lingyun’s heart sank. In her temper, the consequences of having her things taken were unthinkable. What would she do?</p><br/><p>“You, want to save that man?” The Son of Sin. The corners of Qing Hua’s lips curled up into a sneer.</p><br/><p>“Camille!” Qi Ao Shuang’s expression changed, and she immediately understood who the man Qinghua was talking about was. But why the Son of Sin?</p><br/><p>Indeed… Leng Lingyun’s heart sank to the bottom. She always struck the most deadly blow to someone’s soft spot. And now, he was going to do the same to Ao Shuang?</p></blockquote><br/>\n</div>"}