{"title": "Chapter 329", "id": 329, "volume": 4, "url": "http://boxnovel.org/stunning-edge-chapter-329", "volume_title": "Volume 4", "body": "<h1>Chapter 329</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><div class=\"title__3i-dQ\">C329</div><blockquote><br/><p>Stunning Edge – C329</p><br/><p>“Do you know why I call him the Son of Sin?” His existence is a shame and a sin. ” “Just now, the light I struck on his body acquired all of his memories.” “Tsk, tsk, how terrible.” The cyan flower’s smile was cold and full of ridicule and disdain.</p><br/><p>Qi Ao Shuang stared at Qing Hua, and in that instant, Qi Ao Shuang felt her thoughts and consciousness clear up. During that period of time, Qi Ao Shuang had already lost her sense of self, and many things had become passive and muddled. But it was different now. Right now, she was the one and only Qi Ao Shuang!</p><br/><p>“What’s wrong?” Xiao Ao Shuang asked with a cold look on her face. She didn’t like hearing people say that about Camille. No one.</p><br/><p>“Father, God, Mother, is not a husband and wife, but two siblings.” God raped the Mother to have the Camille you’re thinking about, the one who was born of rape, and his mother tried to kill him as soon as he was born. He didn’t get there. He ran. The Mother God cannot bear the perverted love of the Father God, so she must seal herself and disperse her power to die. ” Qing Hua’s voice was as cold as ice, bone-chilling cold. Everyone was shocked when they heard this.</p><br/><p>“He shouldn’t exist at all. No one welcomed him into the world. His existence is a disgrace. ” A cold sneer appeared on the corner of Qing Hua’s mouth, but before Xiao Ao Shuang could retort, her face instantly turned cold, “But such a person, you will not just watch him die.”</p><br/><p>“That’s right.” Qi Ao Shuang’s eyes also shone with a cold light as she stared at the blue and white flowers.</p><br/><p>“Now that he has been captured by the Father God, the Father God has drawn out all of his power to awaken the Mother. “Only I can save him.” Blueflower smiled, but it was filled with a chilling intent.</p><br/><p>“So?” “What price do I have to pay?” Qi Ao Shuang’s expression did not change as she asked in a deep voice, but her tone was full of determination.</p><br/><p>“No, Ao Shuang.” Leng Lingyun’s expression darkened, and she did not hesitate to stop him. He knew the Goddess’s personality too well. Every time, she would use the thing or person that others cared the most about to deal a fatal blow to the Goddess.</p><br/><p>“Shut up!” A cold light flashed in Qing Hua’s eyes, and with a flick of her sleeve, Leng Lingyun was immediately sent flying by a powerful force. She crashed into the big tree behind her before regaining her footing.</p><br/><p>With a poof, Leng Lingyun felt as if his internal organs were on fire and he coughed out a mouthful of blood.</p><br/><p>“Lingyun!” Qi Ao Shuang’s face sank. Looking at the injured Leng Lingyun crying out worriedly, she hurriedly ran forward to help Leng Lingyun.</p><br/><p>“Don’t come over!” “Don’t touch me!” However, Leng Lingyun gave a low shout, and stopped Qi Ao Shuang’s actions. He knew the goddess’ personality very well, and if Xiao Aushuang came over to support him, it would only add fuel to the fire for the goddess.</p><br/><p>Qi Ao Shuang stopped in her tracks and turned around to face the cold face of Qing Hua, glaring at this cold and powerful woman.</p><br/><p>“You woman!” How could Feng Yixuan, with his fiery personality, endure such a cold and arrogant action? He roared and was about to attack.</p><br/><p>“No!”</p><br/><p>“No!”</p><br/><p>Qi Ao Shuang and Leng Lingyun spoke out to stop him, but it was already too late.</p><br/><p>Qing Hua’s expression instantly became extremely ugly to behold. She knitted her eyebrows, clenched her teeth and let out a cold snort. Then, she waved her hand towards Feng Yi Xuan in a hateful manner. In the next moment, Feng Yi Xuan was like a cannonball as he directly smashed towards the huge green tree. With a loud bang, Feng Yi Xuan directly broke the tree’s middle. As for Feng Yi Xuan, he was still unconscious, vomiting blood.</p><br/><p>This time, Qi Ao Shuang did not try to run over to check on Feng Yi Xuan’s injuries. She understood that the more intimate her attitude became with Feng Yixuan and Leng Lingyun, the angrier the goddess became.</p><br/><p>“What do you want?” At this time, Xiao Ao Shuang was surprisingly calm as she asked each and every word clearly.</p><br/><p>While Lily clenched her teeth, Jin Yan patted her shoulder and shook his head, indicating that this matter wasn’t something that they could interfere in. Dittos’ eyes were cold, but he still stood to the side sensibly. It was obvious that he was beginning to understand the whole situation slowly, and Jonathan did not say a word either. He was also well aware that they were absolutely no match for that woman called Qinghua. If this woman wanted to, she could instantly kill everyone present.</p><br/><p>Blue Flower slightly raised her eyebrows, then she suddenly smiled. Her smile was peerlessly beautiful, and it was a bewitching and enchanting smile.</p><br/><p>“I helped you save that man. You took the initiative to disappear, completely disappearing.” A cold voice suddenly rang out in Qi Ao Shuang’s mind.</p><br/><p>Qi Ao Shuang’s pupils slightly constricted, but her face didn’t show anything strange. She just stood there quietly, looking at the blue and white flower with a faint smile on her face. Blue Flowers raised her eyebrows, the corners of her mouth curving upwards. She did not say anything, but Qi Ao Shuang understood what was going on. Blueflower asked, whether she would agree or not.</p><br/><p>Leng Lingyun looked at the two of them nervously, trying to figure out something from their expressions, but she couldn’t find anything out.</p><br/><p>Qi Ao Shuang sighed softly in her heart …</p><br/><p>His life was for himself. She was Qi Ao Shuang, not a goddess, she was her! Would she be able to watch Camille die? Is that possible? Impossible. Camille was more important to her than she could have imagined.</p><br/><p>“Alright.” Qi Ao Shuang opened her mouth and said one word in a low voice. The light word was firm and heavy.</p><br/><p>Qing Hua silently smiled, a charming smile gradually appearing on her face. Qi Ao Shuang turned around and walked towards Leng Lingyun and Feng Yi Xuan. She walked to the front and slowly squatted down to help the unconscious Feng Yi Xuan up. She turned to look at Leng Lingyun and asked in a low voice, “Lingyun, are you alright?”</p><br/><p>“What did you promise her?” Leng Lingyun’s expression was solemn and anxious. She did not answer Qi Ao Shuang’s question, but asked with a deep voice.</p><br/><p>“Nothing.” Just promise me one thing I can do. ” Qi Ao Shuang looked down at the unconscious Feng Yi Xuan, wiped the blood from the corner of Feng Yi Xuan’s mouth, then looked up at Leng Lingyun and said indifferently.</p><br/><p>“Something you can do?” “What is it?” Leng Lingyun knew that with that person’s personality, things would not be so simple. A strong sense of unease arose from the bottom of her heart, spreading further and further, almost filling Leng Lingyun’s heart.</p><br/><p>“Let’s go. If we’re late, that man is dead.” Qing Hua’s cold voice rang out.</p><br/><p>Qi Ao Shuang did not even glance at Qing Hua. She continued to look down at Feng Yi Xuan’s face. Feng Yi Xuan gradually regained his consciousness. He slowly opened his eyes and met Qi Ao Shuang’s clear eyes.</p><br/><p>“Yi Xuan …” Qi Ao Shuang looked deeply at Feng Yi Xuan and gave a faint smile.</p><br/><p>“Ao Shuang?” Feng Yi Xuan gradually came back to his senses and abruptly sat up. He grabbed Qi Ao Shuang’s shoulder and looked her up and down nervously. “You, are you alright?”</p><br/><p>Qi Ao Shuang gently shook her head and smiled as she looked at Feng Yi Xuan. “How about you? Are you alright?”</p><br/><p>“It’s fine.” Even though Feng Yixuan was twitching in pain, he still grinned and shook his head.</p><br/><p>“Hurry up, or you won’t even see the ashes of that man!” Seeing this scene unfold before her eyes, an indescribable fire burned in her heart.</p><br/><p>“Let’s go.” Qi Ao Shuang ignored the blue and white flowers and instead said these words to Feng Yi Xuan. He then turned around and looked at Dittos and Jonathan. With some hesitation, he asked, “Do you two still want to follow me all the way here?”</p><br/><p>Dittos did not say anything. He merely took a step forward and expressed his attitude. Jonathan shrugged his shoulders and said, “You saw it too. There’s nothing I can do about it. I’ll just follow this guy.” If he gets hurt or anything, there’s a man to carry him back. ” Dittos glanced at Jonathan coldly, but Jonathan rolled his eyes indifferently.</p><br/><p>Blueflower no longer said anything. Instead, she walked to the front by herself, heading towards the east. In that direction, she felt a powerful and pure force flowing. That place was undoubtedly the residence of the Goddess of the Father.</p><br/><p>Qi Ao Shuang and the rest followed behind. Qi Ao Shuang’s expression was very calm, so calm that it caused the uneasiness in Leng Lingyun’s heart to spread rapidly. Leng Lingyun slowly walked to Qi Ao Shuang’s side, lowering her voice and saying: “Ao Shuang, what did you promise her?”</p><br/><p>Qi Ao Shuang only turned her head slightly, looking at the worried Leng Lingyun, and smiled faintly: “If it were you, I would still agree.” After speaking, Xiao Ao Shuang no longer spoke to Leng Lingyun, and quickly followed behind her.</p><br/><p>Leng Lingyun stood on the spot, staring at the back of Qi Ao Shuang with a complicated feeling rising in her heart. Pain, emotion, pain, panic … He looked at Xiao Aushuang with eyes filled with pain and bewilderment, but gradually, his eyes became resolute. As if she made a difficult decision, Leng Lingyun bit her lip and frowned, but still resolutely took a step forward to follow.</p><br/><p>Feng Yixuan saw all of this. He was no fool. He understood that it was impossible for him to ask Qi Aushuang anything, so he decided to directly ask Leng Lingyun. As he approached Leng Lingyun, Feng Yixuan asked in a low voice, “Hey, Leng Lingyun, what exactly happened?” What do you mean by ‘I won’t agree to it’? What did Ao Shuang promise that witch? “It’s serious, isn’t it?” Feng Yixuan knew that something wasn’t right, but he still couldn’t understand the details.</p><br/><p>Leng Lingyun only glanced at Feng Yixuan for a moment before he spoke in a low voice, “Feng Yixuan, if you dare to harm Ao Shuang, I will be the first to kill you.” There was a fierce decisiveness and a trace of brutality in his tone, which stunned Feng Yixuan.</p><br/><p>After he finished speaking, Leng Lingyun followed without turning his head back, leaving Feng Yixuan stunned. He rubbed his head in confusion as he looked at the departing Leng Lingyun. He cursed in a low voice: “You lunatic, what did you say?” Even if I hurt myself, I wouldn’t hurt Auland. “What’s wrong with this kid?”</p><br/><p>“If you harm Ao Shuang, I will also kill you.” Suddenly, the sinister voice of Dotans rang in Feng Yixuan’s ears. Then, Dotans stepped past him and continued walking forward. … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … … …</p><br/><p>“What do you mean?!” Feng Yixuan was a bit angry. He had tolerated such inexplicable words from this person, but this seemed to be an outsider. What was he trying to do by saying something like this?</p><br/><p>“That’s the meaning of it. You’ll understand it very soon.” He continued to walk forward without paying attention to Feng Yixuan’s words. At the same time, Jonathan passed by Feng Yixuan and faintly said, “That’s the meaning.”</p><br/><p>Feng Yixuan was completely stunned. Just what were these people trying to express? Unfathomable! As he watched Qi Ao Shuang disappear into the distance, Feng Yi Xuan came back to his senses and hurriedly chased after her. This time, Feng Yixuan fell silent along the way. He lowered his head, thinking about something.</p><br/><p>As they walked on, a beautiful palace appeared before everyone’s eyes very quickly. This palace was grand and generous. It was all made of pure white ore, and it sparkled under the sunlight. All sorts of fresh flowers bloomed here at different times of the year. They fought for their splendor, but from far away, they could already smell the fragrance of the flowers.</p><br/><p>The cyan flowers approached the edges of the flowers, a disdainful sneer on their faces. They put their hands in the air, lowered their heads and closed their eyes, and white rays of light began to bloom on their hands.</p><br/><p>“There’s a barrier.” Lily stared at the scene in front of her, her heart filled with terror. There was a barrier, but she couldn’t feel it at all. Everyone else had different expressions. Some were shocked, some were shocked, and some looked completely calm. Leng Lingyun looked at this scene expressionlessly. In her eyes, this sort of Spirit Formation was nothing.</p><br/><p>‘Bang – ‘a loud sound was heard, as if countless glass pieces had been shattered into pieces. It was so loud that it hurt one’s eardrums.</p><br/><p>Under everyone’s astonished gazes, a barrier appeared around the palace. Then, it began to shatter at a speed visible to the naked eye. It was as if it were a gorgeous and enchanting crystal, shining with a demonic light under the sunlight.</p><br/><p>The blue and white flowers began to walk towards the palace gates. After saving the Sin Child, everything came to an end. Red Lotus, White Lotus, you are mine. From the past until now, you are all mine. No one can take them away. Even if it was his other consciousness.</p><br/><p>Qi Ao Shuang looked at the huge palace, and without any hesitation, she quickly chased after him. Leng Lingyun looked at the back of Qi Ao Shuang, she wanted to say something but stopped herself. She stood still for a long time, and finally, everyone walked in.</p></blockquote><br/>\n</div>"}