{"title": "Chapter 23: Great Diarrhea Art", "id": 23, "volume": 1, "url": "http://boxnovel.org/my-disciple-died-yet-again-chapter-23-great-diarrhea-art", "volume_title": "Volume 1", "body": "<h1>Chapter 23: Great Diarrhea Art</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 23: Great Diarrhea Art</p><br/><p>“Mas…ter!” The moment Zhu Yao could clearly see the person right in front of her, that unbearable pain once again attacked her, and she felt like fainting again.</p><br/><p>Yu Yan did his best to keep her awake, and set up a formation that could obstruct spiritual energy. However, the surrounding spiritual energy particles were simply too many. After losing their guiding beacon, they instantly began to behave wildly, and attack indiscriminately. “Converge your mind, focus on a single thought, hurry and stop the spiritual energy pull.” Currently, the violent turbulence could only be stopped if his disciple stop her absorption of spiritual energy, otherwise, the entire Ancient Hill Sect would be wrecked by the rampant lightning spiritual energy particles.</p><br/><p>Zhu Yao understood that the current situation was extremely grave as well. She crawled up and began to meditate, following her master’s instructions, she stopped her intake of spiritual energy.</p><br/><p>After about five minutes, the rampant spiritual energy particles slowly calmed down, and began to disperse.</p><br/><p>Yu Yan released the formation, carefully looked at his own disciple, and realized, she was already an Foundation Paragon. Even Sovereign Yu Yan, who had a vast amount of experience, was a little shocked by his own disciple. Just what kind of disciple did he take in?</p><br/><p>For five years, she could not even manage to take in a hint of spiritual energy, and once she learnt how to, she immediately rose by several levels?</p><br/><p>“Master?” Zhu Yao could feel that her body was different as well, however she could not understand what was that earlier situation about. Was it her late-coming cheat?</p><br/><p>“There’s no need to think too deeply into it.” Yu Yan cast a Dirt Removal Art on her, cleaning up the bloodstains that filled her entire body. Then, he carried his disciple who was completely fatigued into her cottage, and covered her nicely with the blanket. “Have some rest for now. Never bring this incident up to anyone else.” </p><br/><p>Zhu Yao nodded. After seeing her close her eyes, Yu Yan then turned and left the cottage. Raising his head up, he looked at the lightning spiritual energy particles that had yet to fully disperse in the sky. This certain master was a little distressed. Improving one’s cultivation depended on spiritual energy, and the amount needed varied for different types of Spirit Veins. As to how much spiritual energy one could absorb, it would have to depend on how much one could sense spiritual energy, and the person’s affinity to spiritual energy. Even when he was promoting into a Demigod, he had never seen such a terrifying turbulence of lightning spiritual energy.</p><br/><p>There were only two possibilities to the cause of such a terrifying scene. One, his disciple possessed a heaven-bending God Artifact, which had the ability to gather lightning spiritual energy. However, he had been alive for so many years, and had never heard of such a God Artifact in the world. Even during the legendary Ancient Savage Era, when it was known to be filled with countless of treasures, was not known to have such a God Artifact. And, when a God Artifact was born, there would definitely be signs about it appearing in the world, so it was impossible for its existence to be kept hidden. And, given his stupid disciple’s intellect, where her thoughts were basically written on her face, she would not possibly have the capability to hide it from everyone else, nor would she have the thought of doing so. Otherwise, it would not have been possible for her to not know how to take in spiritual energy for five whole years.</p><br/><p>In that case, there was only one possibility left. His disciple’s affinity to lightning spiritual energy, was at an unimaginable degree. Hence, the lightning spiritual energy particles would scramble and rush into her body.</p><br/><p>Haah, it seemed like he had taken in a very big trouble. But what could he do about it? She was his disciple, after all!</p><br/><p>Zhu Yao slept an entire day and night. After waking up, she simply felt her mind was extremely refreshed, and her body was filled endless vigor. It seemed as though, in a single night, her five senses improved. In the past, she had the thought that Jade Forest Mountain was desolated, and even with a good look, she would not be able to see much life around. However, now, as long as she paid slight attention, she would be able to hear birds chirping in the forest, the caterpillars crying on the leaves, the butterflies flapping their wings around the flowers, and she could even occasionally hear the laughter of the disciples that were passing by Jade Forest Mountain.</p><br/><p>This was an experience that she had never felt before, and when Zhu Yao opened the door, a feeling of being welcomed into a new world rose in her heart. As she thought, she did not cross into this world just for the sake of touring it, and the feeling of having a cheat was awe-awe-some. As though they had felt her thoughts, even the lightning spiritual energy particles in the air, were lively jumping about.</p><br/><p>Zhu Yao stopped her feet, looked at the blurry and dim spots of light in the air as they intimately circled around her. They then lined themselves up in a ‘S’ shape, and after that, they lined themselves in a ‘B’ shape.</p><br/><p>She calmly waved her hand and dispersed them. Hmph, little bastards. That night, you bastards almost killed me. This time, I will not allow you guys to enter that easily. Even if you guys try to act all cutesy, it’s no use.</p><br/><p>“Master!” The moment Yu Yan walked out of the door, he saw an unidentified object pouncing onto him. He habitually stepped to the side, and stared as she slammed her face onto the ground. Heaving a long sigh, he gave a ‘my disciple is being stupid again’ expression.</p><br/><p>Zhu Yao slapped away the dirt on her clothes as she got up. She was not angry, after all, he was the one who saved her life.</p><br/><p>“Thank you, master, for saving my life. This disciple has nothing to repay you, why don’t I give you my love?”</p><br/><p>Yu Yan looked at her weirdly. “You’re mine in the first place.”</p><br/><p>“Ehh?” What does that mean? Zhu Yao was a little stunned. What did he mean by she was his in the first place? She suddenly imagined herself as a commoner being favored by a rich and cold-looking CEO. No! I only said that as a casual remark!</p><br/><p>Yu Yan saw that she had begun to turn stupid again, and explained. “You’re my personal succeeding disciple.” She could only have him as her master in the first place, so naturally, she was his. Love or whatever, was basically non-existent.</p><br/><p>Zhu Yao’s face cramped. As she thought, her master was a martian who she could not communicate with. Ah whatever, I’m feeling good today, so I won’t talk back at him. “Master, what are we eating today?” Was it not time for breakfast?</p><br/><p>“You’re hungry?” Yu Yan looked at her strangely.</p><br/><p>Zhu Yao rubbed her tummy, and shook her head. Logically speaking, after sleeping for an entire day and night, she should have been extremely hungry by now. However, she did not feel the slightest of hunger right now.</p><br/><p>“Once you reach Foundation, you will no longer feel hunger. From this day onward, you have no need to eat.”</p><br/><p>“Ah, if we don’t eat, won’t we be missing out on one of the many pleasures in life?” As a gourmet, this was simply unacceptable. “Master, why don’t we occasionally eat, and experience life sometimes?”</p><br/><p>Yu Yan was unmoved. “There are too many impurities in the food of the mortal realm, and they do not benefit one’s cultivation. Since you no longer feel hunger, there’s no need for food any longer.”</p><br/><p>Zhu Yao was slightly distracted for a moment. She silently decided to eat sneakily in the future, and definitely not have master see her doing so.</p><br/><p>“Since you have already built your Foundation, start training in all the Mystic Arts you have memorized in the past.” The certain master began to shift into teaching mode. “Just by having a high cultivation level, without any mystic arts, will not do. First, start by training in the entry-level Body Purity Art.”</p><br/><p>“Yes, my liege! No problem, my liege!” Zhu Yao obediently raised her hands.</p><br/><p>Yu Yan ignored her nonsense, raised his hand and tapped on the center of her forehead. Zhu Yao felt a large amount of information pouring into her mind, and that was the Body Purity Art he spoke of. Actually, the so-called Body Purity Art, was to purify one’s meridians, remove the impurities in one’s body, which in turn, would allow spiritual energy to circulate more smoothly in one’s body. This way, casting Mystic Arts would be more fluent and rapid.</p><br/><p>Zhu Yao closed her eyes and sat down. Following the method stated in the mystic art, she purified her meridians over and over again. However, she underestimated the amount of impurities she accumulated in her body in the last thirty-three years. After purifying them a few times, she felt an unbearable pain in her stomach. Guruguruguru. Her stomach growled. Embarrassingly, she looked towards her master at the side, and realized he was currently looking at her, unmoving. He looked as though he had already known that this would happen.</p><br/><p>She gritted her teeth, leapt right up, and speedily rushed into the toilet. Liar! What Body Purity Art! It’s evidently the Great Diarrhea Art!</p><br/>\n</div>"}