{"title": "Chapter 46: The Promised Protagonist’s Cheat", "id": 46, "volume": 1, "url": "http://boxnovel.org/my-disciple-died-yet-again-chapter-46-the-promised-protagonist%E2%80%99s-cheat", "volume_title": "Volume 1", "body": "<h1>Chapter 46: The Promised Protagonist’s Cheat</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 46: The Promised Protagonist’s Cheat</p><br/><p>The deeper they went, the darker it became, and it looked as though there were completely no light in the place. And, it reached to the point where there were not even a bit of light from the surroundings, and only the purple lightning in Yu Yan’s hands was flashing with crackling noises. Zhu Yao could not help but grab onto the corner of the the person’s clothes in front of her, as she was afraid of stepping onto empty air, and make a huge slip. That would be too embarrassing.</p><br/><p>Yu Yan who was grabbed onto, startled for a moment. Thinking that the person behind him was his own stupid disciple, he did not stop her, and continued to bring her down.</p><br/><p>Not knowing how long they had walked, Zhu Yao felt a white light flashing right in front of her, and then, as though a black curtain had been suddenly pulled open, her surroundings began to light up.</p><br/><p>This was a spacious stone room. Only a “prayer mat” was placed right at the center, and there were no other furnitures in the surroundings. It seemed like a regular training cave residence, however, the surroundings were filled with lightning spiritual energy, letting her feel especially comfortable. </p><br/><p>Yu Yan walked to the center of the stone room, he raised his hand, and threw the purple lightning high in the air. Only then did Zhu Yao realize that, above her, was actually a huge floating pool of water. The entire sight of the lake could be seen from here clearly, and she could even faintly see the scenery at the banks of the lake. They were under the lake. This was challenging the principle of gravity, causing her to feel extremely astonished.</p><br/><p>“Master, master, why isn’t the water pouring down?” She was like a country bumpkin, pointing to the ceiling.</p><br/><p>Very naturally, she received her master’s rolling eyes. “Formation!” As expected of his stupid disciple. “This place is where your master usually train in. In these few years, you can use this place to form your Azoth Core.”</p><br/><p>So her master frequently used this place to train. It’s little wonder why he would go missing frequently.</p><br/><p>Yu Yan looked at that purple lightning which he had already fixated in the air above. “This is the Nine Heavenly Lightning, you can guide out the lightning spiritual energy you need from it.”</p><br/><p>Nine Heavenly Lightning, was it not the Ascension Tribulation Lightning? Master could even capture bolts of lightning as well?</p><br/><p>Zhu Yao sensed it for a moment, and indeed, the surrounding lightning spiritual energy had gotten denser. Obediently sitting at the center of the formation, she sat in the lotus position and began to meditate. Using the method to guide spiritual energy into her body she learnt before, she slowly allowed the lightning spiritual energy into her body. Because she had the prior experience, she no longer felt the pain she had when the spiritual energy went berserk the other time, and her entire body simply felt comfortable. </p><br/><p>Yu Yan observed at the side for a moment, and only felt at ease after realizing that nothing abnormal was occurring to his disciple. After pondering for a moment, he took out a few more bolts of lightning that were exactly the same as the previous one, fixated them high in the air, before leaving without any worry. The Nine Heavenly Lightning was indeed the Ascension Tribulation Lightning, so the amount of lightning spiritual energy contained in it was the largest as well. Usually, it could not be easily seen easily, and these bolts of lightning were something he captured by chance from the Abyssal Lands.</p><br/><p>His disciple only had to guide spiritual energy into her body to cause the spiritual energy to go berserk. These bolts of lightning, no longer required to take in any other lightning spiritual energy, so they were just right for aiding his disciple in her cultivation.</p><br/><p>With this one period of meditation, Zhu Yao had meditated for two years. When she woke up, her body had already accumulated a layer of dust. With just a casual pat, it brought about a small-scaled sandstorm, choking her, and she could not help but cough a few times.</p><br/><p>When she was about to raise her hand and cast the Dirt Removal Art, she glanced at the clear water above her, and decided to head out to wash herself. Although Dirt Removal Art was convenient, as someone who was used to bathing, she still felt she was not clean enough after using it, this might be probably a form of psychological disorder of cleanliness in another meaning as well.</p><br/><p>The moment she left the bottom of the lake, she saw a piece of lotus leaf being placed next to the lake. On the leaf, was a neatly arranged set of clothes, and looking at the style and size, it should be hers. She instantly realized who placed it here.</p><br/><p>As expected, master was her caring little jacket¹, his life skills were all maxed out, and she gave him a huge thumbs up.</p><br/><p>She picked up the clothes and realized, other than the clothes, there was a bottle of pellets as well. Master had always discouraged her from eating medicinal pellets to raise her cultivation, so why would he place a bottle of pellets here? She curiously poured some of the contents out, and realized they were actually candies.</p><br/><p>The hell! Only her body would change into a child’s, she’s not actually a child, alright? What point was he trying to get by placing candies here!?</p><br/><p>Zhu Yao poured out a bunch of them, and stuffed them into her mouth out of anger, making ‘kuchi kuchi’ sounds as she chewed. Mn, the taste is pretty good.</p><br/><p>Patting away the crumbs of candies in her hands, she stripped off entirely and dove into the lake. This was a cold lake, so the water was very cold in the first place, however, to practitioners, the temperature was just right. Zhu Yao cleaned the dust off her body, and could not help but start to inspect this cold lake.</p><br/><p>Actually, this cold lake was pretty big. It’s unknown how much larger it was compared to the modern pools either. The lake was deep as well, and it was basically impossible to see the bottom of the lake from the top. However, mystically, the stone room below could clearly see what was happening at the top. It was good that there was currently no one at the bottom lake.</p><br/><p>Wait a minute! She seemed to have frequently came over here to bathe in the past, and she was always stark naked, while below her was the stone room her master usually used to train… Then did that not mean she…</p><br/><p>The hell! Suddenly, her entire body felt extremely uncomfortable. Master, let us talk about life!</p><br/><p>However, when she recalled that when she was a child, she had already been bathed by him countless of times, and she was always stark naked then as well, suddenly, she no longer felt that uncomfortable. As expected, she no longer had any morals left to speak of! Those morals of hers had already been scrubbed off, and she was already used to it.</p><br/><p>Zhu Yao bathed for nearly an hour, before crawling out of the water. After changing into the clothes on the bank of the lake, stuffing another bunch of candies into her mouth, she was just about to return to training, only to suddenly sense a spiritual energy disturbance at the Sword Mountain. And this spiritual power was very familiar, it was Wang Xuzhi’s!</p><br/><p>Zhu Yao was a little worried, however, she realized bunch of dark clouds suddenly gathered in the sky above the Sword Mountain, and not a moment later, the sky over that had already darkened. Those were Tribulation Clouds, little wimp was about to form his Azoth Core!</p><br/><p>She was a little shocked, however, immediately after, she was relieved. So many years had passed, with his talent, he should have formed his Azoth Core long before. However, because of her own death, the knot in his heart was unresolved, thus, causing his cultivation to stagnate. Currently, it seemed like her words earlier, were still of use. He had thought it through.</p><br/><p>Wang Xuzhi’s Azoth Tribulation Clouds were not as exaggerated as Xiao Yi’s, the Tribulation Clouds did not cover the entire sky either. There were no land covered in complete darkness, no flying sands and rocks. It simply followed the regulations and covered only a small piece of the sky above the Sword Mountain, and the Heavenly Lightning that struck down was exactly eighty-one times, not more, not less, nor was there a cheeky Tribulation Lightning running towards her. Of course, there was no special phenomenon in the sky, once the Tribulation Clouds had finished striking, they quickly called it a day, and dispersed completely and cleanly.</p><br/><p>Zhu Yao waited for a moment, only after she once again sensed Wang Xuzhi’s spiritual power, did she finally feel at ease. It seemed like he broke through, and had successfully raised his cultivation. After all, he was a child that she had personally seen growing up, Zhu Yao felt a little satisfied in her heart. And then, her thoughts instantly made a turn, she was still a Foundation-stage practitioner, and did not even have a trace of forming his Azoth Core. She instantly felt extremely terrible.</p><br/><p>A good comparison to this was, when she was young, her teacher had assigned students into small help groups of two, one with good results, and the other with poor results. She had initially been one of those children with good results, and she wholeheartedly helped the child with poor results with his studies. In the end, when the result slip came in, his score was actually higher than hers. She felt extremely terrible, and could barely hold it in at all.</p><br/><p>The hell, what happened to the promised cheat for the protagonist who’s here to save the world!?</p><br/><p>¹Caring Little Jacket: Usually, it’s used to describe the parents’ daughter, as the daughter is both kind and knows how it feels like to be a parent.</p><br/>\n</div>"}