{"title": "Chapter 52: Treasure Protecting Demonic Beast", "id": 52, "volume": 1, "url": "http://boxnovel.org/my-disciple-died-yet-again-chapter-52-treasure-protecting-demonic-beast", "volume_title": "Volume 1", "body": "<h1>Chapter 52: Treasure Protecting Demonic Beast</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 52: Treasure Protecting Demonic Beast</p><br/><p>“You’re saying there’s a possibility for the Heavenpulse Lotus to be here.” Wang Xuzhi’s expression became a little tense as he swept his gaze through the big patch of See-Through Leaf Grass. The Heavenpulse Lotus which was capable of reconstructing meridians was only recorded in legends, and no one had actually seen it. However, since the air in this place was moist, and there were even so much See-Through Leaf Grass growing here, with every stalk looking spirited and lush, there might really be a pond with an exotic treasure growing right in front of them.</p><br/><p>However, a place with an exotic treasure, other than a bunch of spiritual herbs accompanying it, there would be demonic beasts accompanying it as well. In other words, there might be at least a sixth-ranked demonic beast here, or maybe even an entire horde of them.</p><br/><p>“Let us return first, and discuss with senior-martial brother Chen Yi whether we should investigate the place.” Wang Xuzhi gathered and place the spiritual grass inside the container, his face no long carried the initial excitement, rather, it was a little tense.</p><br/><p>Naturally, Zhu Yao would not object, the more people there were, the easier it was to get the job done. After all, sixth-ranked beasts were equal to late-stage Azoth human practitioners. The two of them, an early-stage Azoth practitioner and a mid-stage Azoth practitioner, when encountering a sixth-ranked demonic beast, even if they did not die, they would still suffer serious injuries. And, with their Spirit Veins, their meridians did not need to be reconstructed in the first place, so the Heavenpulse Lotus did not mean much to them.</p><br/><p>However, before they even returned to the gathering point, they bumped into someone coming from right in front of them, and she was even Lu Cha, the girl little fatty Zhao was interested in. She was walking pretty hastily, and looked as though she was about to break into a jog. When she saw the two of them, she was startled as well. As though she was trying to hide something, she looked around for a moment, before nodding her head, as a way to greet them.</p><br/><p>“Junior-martial sister Lu, what happened to you?” Wang Xuzhi casually asked.</p><br/><p>Her expression instantly paled, and her smile looked a little forced. “No… Nothing, we just encountered a demonic beast, that’s all. Senior-martial uncle Xiao has already dealt with it, and I’m currently planning to inform senior-martial brother Chen.”</p><br/><p>Zhu Yao became even more suspicious, and turned to look at the direction she came from. “You guys can’t have possibly entered that place filled with a big patch of See-Through Leaf Grass, right!?”</p><br/><p>Lu Cha’s face turned even more pale, and revealed an expression as though her thoughts had been guessed correctly, yet, from afar, suddenly, an extremely loud roar sounded. The roar rang through the clouds, the three of them could not help but feel shaky for a moment, and even the ground began to tremble with them.</p><br/><p>“It’s the sound of a demonic beast.” Wang Xuzhi stared towards Lu Cha with a reprimanding look, as every one of them had clearly realized what she was planning to do. Earlier, she was moving with Xiao Yi, the two of them had definitely seen that patch of See-Through Leaf Grass from the other side, and they had even entered it. However, they did not expect to startle the demonic beast accompaniment inside. Xiao Yi could not defeat it, hence, he had her come out to look for help.</p><br/><p>But, just from hearing that roar earlier, that demonic beast was definitely not ordinary. As expected, not even a moment later, loud running footsteps could be heard, even the bird beasts in the trees dispersed and fled, as something was chasing over towards them.</p><br/><p>“Senior-martial uncle Xiao?” Lu Cha anxiously looked at the direction of the sounds, as though she had just realized the severity of the situation.</p><br/><p>“Let’s inform the rest, hurry!” Zhu Yao summoned her flying sword, pulled along Wang Xuzhi beside her, and with her eyes, she signaled Lu Cha to catch up to them. Only after flying towards the sky, could they finally see, on the ground not far away from them, a gigantic beast that was even taller than a house was currently running towards them.</p><br/><p>The three of them speedily flew, and when they finally managed to reach the gathering point, Chen Yi and the other martial brothers and sisters were already standing there.</p><br/><p>“What happened?” Chen Yi realized the situation was strange as well, as he hurriedly ran over.</p><br/><p>Wang Xuzhi walked forward and explained the situation to the rest of them. Before he could even finish, suddenly, another roar was heard, and Zhu Yao simply felt a gigantic shadow looming over towards her.</p><br/><p>“Little Bun!” Wang Xuzhi anxiously shouted, with an ashened look, he looked towards… the direction behind her.</p><br/><p>Only then did Zhu Yao slowly turned her head a little stiffly. Behind her, was a gigantic monster. It looked like a bear, yet, it’s covered in scales, and there were even three horns that looked like metal blades on its head. It stopped for a moment, and suddenly opened its mouth towards her, revealing teeth that were even longer than her legs.</p><br/><p>And then, it stretched out its tongue,</p><br/><p>and licked her.</p><br/><p>Zhu Yao whose body was filled with saliva: “……”</p><br/><p>She was not ice-cream! Haah!</p><br/><p>All these happened in a blink of an eye. The rest of the female practitioners were all frightened from the sudden appearance of a demonic beast, shrill screams rang through the air, and it was unknown who did it, but a gigantic fireball was cast and thrown over.</p><br/><p>When Zhu Yao was about to get burnt, Wang Xuzhi instantly rushed over, caught her, and they tumbled away.</p><br/><p>The demonic beast seemed to have been angered by that fireball, as it roared and charged towards the group of people. Everyone had no choice but to summon their weapons one after another and engage it in battle. Various Mystic Arts were thrown towards the demonic beast.</p><br/><p>Wang Xuzhi pulled Zhu Yao up, and summoned his long sword as well, shielding in front of her. Zhu Yao looked at that crazed demonic beast at the center. She was unsure if it was just her imagination, but she felt that earlier demonic beast did not seem to want to kill her.</p><br/><p>As she thought of this, the demonic beast shot out a fireball, and it was flying exactly towards her direction. Zhu Yao flew to dodge it, and when she turned to look at the place she was standing at earlier, it had already turned into a crater of fire. Alright, she had confirmed it, it wanted to kill her now.</p><br/><p>“Risefire Beast!” Chen Yi looked strangely at that demonic beast in the center. Risefire Beast was a very mystical beast, it had the fire element, yet, it liked to stay near sources of water, hence, it was resistant towards both water and fire. A newborn was a fifth-ranked demonic beast, and when it matured, it would be sixth-ranked. It had to be said, Chen Yi did have some talent in leading, as, when he recognized the identity of the demonic beast, he immediately loudly reminded everyone. “Do not use fire and water Mystic Arts. Risefire Beasts are resistant to both water and fire.”</p><br/><p>When everyone heard this, they hurriedly stopped using fire and water Mystic Arts, and changed to other Mystic Arts. There were even some who had flown directly towards it, and used sword techniques. Out of everyone present, Wang Xuzhi’s sword techniques were the strongest. By himself, he rushed to the very front, the sword skills he threw out completely left no openings, preventing the demonic beast from advancing even another inch.</p><br/><p>“This is a fifth-ranked demonic beast.” Chen Yi became elated, as he realized that this was just a newborn beast. Although a matured Risefire Beast was comparable to an Azoth Paragon, at the very most, a fifth-ranked would just be comparable to mid-stage Azoth. Even if demonic beasts were innately stronger than human practitioners, with so many people present, taking down this newborn beast would still be a simple feat.</p><br/><p>Zhu Yao wanted to help as well, however, other than Wang Xuzhi, no one knew she was a disciple of the Jade Forest Mountain, and it was inconvenient for her to use her skills. Hence, she could only follow the rest of the female practitioners, and stand at a spot a little further away. Occasionally, she would cast out chaining and binding arts, to restrict the demonic beast’s movements.</p><br/><p>Chen Yi’s estimation was right, it was a newborn beast, and basically could not fight against the combined attacks. After a short while, the demonic beast had already fallen onto the ground from the slash of his sword. Fresh red beast blood flowed onto the ground.</p><br/><p>Everyone cheered, and heaved sighs of relief. Chen Yi counted the number of people, and realized, other than three disciples suffering from light injuries, the rest were fine.</p><br/><p>“Just what is going on?” Chen Yi asked Wang Xuzhi. Just when he heard the term ‘demonic beast’, this demonic beast appeared.</p><br/><p>Wang Xuzhi moved to the back, making way for Lu Cha.</p><br/><p>Lu Cha’s expression changed, before she said softly. “Senior-martial uncle Xiao, senior-martial brother Zhao and I, found a lot of See-Through Leaf Grass over there, however, for some unknown reasons, this demonic beast suddenly charged out. We did not dare to fight it, hence, I had no choice but to come back and inform everyone.”</p><br/><p>“Then, where’s senior-martial uncle Xiao and junior-martial brother Zhao?” Chen Yi continued asking.</p><br/><p>Lu Cha’s expression paled, as though she had only realized this problem. Logically speaking, the demonic beast had already been slain by them, so those two should have returned as well. Unless…</p><br/><p>Before everyone could even ponder about the problem, that ‘unless’, fell from the sky just like that.</p><br/><p>The first who fell on the ground was little fatty Zhao whose body was covered in blood. His waist seemed to have been pierced by something, and was currently gushing out blood. His white robe had already been stained blood-red.</p><br/><p>Before everyone could even investigate what happened, suddenly, a red wall of fire fell from the sky, blowing towards everyone. Two injured disciples, before they could even dodge, had already turned into ashes.</p><br/><p>With a loud bang, a gigantic demonic beast that looked exactly the same as the one earlier, yet, was at least three times larger, had already stood right in front of them. The extremely thick smell of fresh blood filled the noses of everyone present, and its mouth still contained small flames that had yet to be extinguished.</p><br/><p>Xiao Yi landed on the ground as well, looking entirely fatigued. Although he was not as severely injured as little fatty Zhao, he still had several small wounds on his body.</p><br/><p>When that huge Risefire Beast landed, it immediately saw the small Risefire Beast lying on the ground nearby. Throwing aside the bunch of people present, it anxiously sprinted over. Using the horns on its head, it gently touched the corpse. As though it had realized it had already died, it let out sad ‘wuuu’ moans. It seemed like it was a mother beast.</p><br/><p>Zhu Yao’s heart could not help but tighten, this could not be the mother of that small Risefire Beast, right!?</p><br/><p>As expected, after the huge Risefire Beast moaned for a while, it suddenly let out an ear-piercing roar. It turned its head and looked even more angrily at the human practitioners on the ground. It heavily dug into the ground with its claws, opened its huge mouth, and spit out a ball of flames that was even larger than the one earlier.</p><br/><p>“Not good, hurry and dodge!” Chen Yi who was still helping little fatty Zhao to close his wounds, shouted out loudly.</p><br/><p>As though they woken up from their dreams, everyone quickly flew up on their swords. The place the fireball landed at, had already turned completely charred. Clearly, it was a hundred times stronger than that small Risefire Beast earlier.</p><br/><p>Lu Cha waved her hand and summoned a gigantic icicle, and it flew towards the demonic beast. The moment the icicle made contact with the demonic beast, it instantly created a huge layer of ice, as though she was planning to freeze the demonic beast, and restrict its movements. However, the demonic beast was extremely quick, and a part of the place the icicle covered had already been shaken off by it. When another female practitioner saw this, she summoned countless of spiritual swords, attacking the demonic beast from all directions. Although they could not pierce through the demonic beast’s scales, it still increased the speed of the freezing process.</p><br/><p>Just when the demonic beast looked as though it was about to completely frozen over, the Risefire Beast suddenly roared loudly, and the scales on its body began to perk up one after another. With a ‘huu’ sound, huge flames were released from inside the scales, and as though its entire body had been caught in fire, the ice on its body instantly melted completely.</p><br/><p>“Mutated Risefire Beast!” Chen Yi exclaimed out.</p><br/><p>Before everyone could even react, that Risefire Beast whose entire body was emitting fire, suddenly disappeared, and then, nearby, a scream rang out. Earlier, the female practitioner that was using spiritual swords to attack it, was already being bitten in its mouth. It’s mouth closed, and the female practitioner’s screams came to an end, only the fresh stains of blood could be seen flowing out of the demonic beast’s mouth.</p><br/><p>Everyone was shocked from that frightening scene. In just a blink of an eye, three people were dead. And, the demonic beast was completely unharmed. Mutated demonic beasts had always been one ranked higher than ordinary demonic beasts. This was a seventh-ranked demonic beast, and its movements seemed to be especially quick as well. Earlier, they did not even see clearly how it managed to reach behind that female practitioner.</p><br/>\n</div>"}