{"title": "Chapter 56: When Heading Out, Bringing Along Your Master is a Must", "id": 56, "volume": 1, "url": "http://boxnovel.org/my-disciple-died-yet-again-chapter-56-when-heading-out-bringing-along-your-master-is-a-must", "volume_title": "Volume 1", "body": "<h1>Chapter 56: When Heading Out, Bringing Along Your Master is a Must</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 56: When Heading Out, Bringing Along Your Master is a Must</p><br/><p>“Strip your clothes.” Yu Yan reiterated.</p><br/><p>Out of reflex, Zhu Yao hugged her chest with her two hands, and looked at the person in front of her with widened eyes. What happened to being just girl friends?</p><br/><p>“Mas… Master, this is wrong, isn’t it?” This disciple sells her body, not her skills… Ah pui! I’m a pure and innocent lady.</p><br/><p>Yu Yan ignored her stupid actions, silently took out a bracelet and passed it to her. “Change into this.”</p><br/><p>She hesitantly took it, and only then did she realize it was a storage bracelet. The moment she wore it, it automatically shrank to the size fitting for her wrist. When she used her divine sense to inspect it, she realized the space inside was huge, and her own storage bag was completely unable to compare with it.</p><br/><p>Taking a good look at the things inside, other than some regular talismans, the rest were several clothes for women, and it seemed like they had been prepared for a long time.</p><br/><p>In the recent days, Zhu Yao only bothered about gaining experience by killing monsters with her life at stake, and basically did not have the time to take care of herself well. The white sect school uniform she was wearing, had already been torn with a couple of holes. Although she could use the Dirt Removal Art to wash it clean, the holes could not be patched up.</p><br/><p>So she wanted her to change her clothes. Say so earlier! It caused her to think her master had some impure and indecent thoughts about her.</p><br/><p>Zhu Yao hid her earlier actions by faking out a few coughs. Only after taking out the clothes did she realize how completely prepared he was. It came with a full set of inner and outer wear, and there were different types of colors and styles. As expected, he was a good master.</p><br/><p>“Thank you, master!” After saying her thanks cheerfully, Zhu Yao did not think twice and took off the outerwear that had already been torn with several holes, and began to change.</p><br/><p>Zhu Yao had never been an attentive person, and adding that she had never thought of master as an outsider, she took off one of her underwear as well. Although she still had another underwear on her, a woman’s underwear had always been rather thin, and would always vaguely reveal some things that should not be revealed.</p><br/><p>Yu Yan’s expression stiffened, and turned his head somewhere else out of reflex, his face strangely began to rise in temperature. He himself did not understand either? Supposedly, the one in front of him was his stupid disciple, so caring more about her should be his duty. However, why did he feel that, right now, it should be time for him to avoid her?</p><br/><p>“Done!” Zhu Yao patted on her new clothes, and severely smugged. As expected, it was great to wear different clothes. A uniform set of clothes or whatever, simply did not have any aesthetic feeling.</p><br/><p>“Mn.” Yu Yan responded. He silently picked up the school uniform that had been abandoned by her. He rubbed the wrinkles on the uniform, trying to look for the torn places.</p><br/><p>And then… He took out a set of needle and string…</p><br/><p>“……”</p><br/><p>Zhu Yao instantly felt that this image was simply too disillusioned.</p><br/><p>You actually brought along needles and strings with you when you left! Master, does your master know about how “wifely” you are?</p><br/><p>As expected, her master was a genius at life skills. Not even fifteen minutes had passed, and the holes on the clothes had already vanished. Zhu Yao took it, and inspected the places that were sewn. She completely could not see any traces of them. She could not help but silently think to herself. In these ten thousand years, did master spend them all on raising his life skills? Hence, he had not taken in any disciples till now.</p><br/><p>Keeping the school uniform, Zhu Yao suddenly realized, other than clothes, there were some irrelevant cloths in the storage bracelet, and they looked rather familiar. She then light took one of them out.</p><br/><p>“Master, what is this?” It was long and rectangular, and it was even emitting out a faint silver glow.</p><br/><p>Yu Yan raised his head and glanced at her. “It’s the remaining pieces of what you used back then. After that, because of the change in materials, I simply put them in.”</p><br/><p>Zhu Yao touched the smooth cloth, and suddenly had a bad feeling. “Remaining? Remaining pieces of what?”</p><br/><p>“Sanitary pads.” He said so seriously.</p><br/><p>“……” Why is my mouth so cheap? Why do I have to be so curious?</p><br/><p>After separating from everyone, Zhu Yao was a little worried that she was unable to catch up to Xiao Yi, and hence, unable to find the “Wood Spirit”. After pondering for a moment, that “Wood Spirit” was at the core of the Secret Realm, and currently, her master was by her side. Even if she were to encounter a formidable demonic beast, she would still be able to retreat with her body intact. And, she would be able to find that ancient ruin, where the “Wood Spirit” was placed, much faster.</p><br/><p>However, she never expected that Tasyoluk’s map would be as large as this. When she entered, she thought that the forest, which she could not see the ends of, would be all, yet, when she exited the forest, an ocean actually appeared in front of her. And, it was the type which looked endless.</p><br/><p>In an ocean like this, how was she going to find the ruins?</p><br/><p>Zhu Yao felt a little saddened, yet, she could faintly hear a singing voice coming from nearby. The voice was very beautiful, as though the singer was weeping and complaining, it sounded like a lover was whispering his grief beside her, and she could not help but feel her heart aching from hearing it.</p><br/><p>“It’s the singing voice of a sharkman.” White light emitted out from the jade pendant in front of Zhu Yao’s chest, and Yu Yan’s cold voice sounded. “A sharkman’s singing voice has the ability to manipulate one’s mind, do not be trapped within it.”</p><br/><p>The moment Zhu Yao heard that, she immediately regained her senses, and escaped from that singing voice. After looking at her surroundings, as expected, on a rock not far from her, she saw four to five figures. From afar, they looked like human figures, however, unexpectedly, they had fish tails, and their blue long hair flowed down onto the ground.</p><br/><p>The first thing she thought were the beautiful mermaids in fantasies, and was filled with curiosity. Carrying a slight excitement, she took a few steps forward.</p><br/><p>When she just thought of getting a sneak peek and vanishing right after, those Sharkmen seemed to have sensed something, and they turned their heads over one after another. Zhu Yao, who saw clearly the looks of those Sharkmen, her three views instantly shattered and fell onto the ground.</p><br/><p>The body parts below the Sharkmen’s head were still considered normal, however, those faces were simply too shocking. Two extremely dark eyes, as though two rocks had been embedded on each of their faces, their pupils were large, yet, there were no white parts of the eyes. Their noses were not upright, and they looked as though two holes were drilled into each of their faces. And their mouths took up an entire half of each of their faces, when the two corners of their mouths tear open, they instantly reach the back of their ears. With just a slight open of their mouths, their sharp metal nail-like teeth were revealed. They were extremely terrifying.</p><br/><p>Zhu Yao was rooted to the ground out of shock, as though she could hear the sound of her fantasies shattering. Return me my mermaids!</p><br/><p>Sensing an intruder, the Sharkmen on the rocks let out threatening roars one after another, and they revealed their mouthful of sharp teeth. As though they were about to pounce over in the very next moment, only then did Zhu Yao understood how idiotic it was to approach them. Sharkmen were eighth-rank demonic beasts, and any one of them was enough to beat her, let alone a group of them.</p><br/><p>As expected, if one did not seek trouble, trouble would not come!</p><br/><p>Just when she was about to skillfully retreat, the leading Sharkman suddenly startled for a moment. After carefully smelling her body, it suddenly retracted its killing intent. “Which tribe are you from?”</p><br/><p>“Ah?” Zhu Yao was startled. What was it talking about?</p><br/><p>When that Sharkman saw that she was unresponsive, it continued to ask. “Just which tribe of Sharkmen are you from?”</p><br/><p>“Uh…” Sharkman? Her? “I… passed by here.”</p><br/><p>“Passedbyhere? I never heard of this tribe before though?” That Sharkman was startled for a moment, and then immediately after, it said with a stern look. “You passed the boundary. Do you know that?”</p><br/><p>“Boundary?”</p><br/><p>“This place! Is our Harmonic Ocean Tribe’s territory, understand? This place!” He strongly pointed to a rock at the side which was fully covered with shells. “This place has already been marked by us. If you wish to hunt, head somewhere else.”</p><br/><p>After saying that, the group of Sharkmen behind it nodded one after another.</p><br/><p>Zhu Yao was a little weirded out. It seemed like these Sharkmen had taken her as one of them. But… Just where the hell did they see that from? Her image was clearly different from them, alright?</p><br/><p>“Kuh kuh, sorry, I got lost.” Zhu Yao probed. Since she was able to avoid a terrible battle, she would not mind acting as a Sharkman for a short while.</p><br/><p>“Lost?” That Sharkman’s face was immediately filled with contempt, as though it was looking at her as though she was an idiot. “Just who the hell sent you here? How could you even get lost like this?”</p><br/><p>“Uh… I was sent here by a monkey.”</p><br/><p>“Monkey? Is that the name of your tribe leader?” That Sharkman began to look down on her even more. “Are all of your tribe members as stupid as you?”</p><br/><p>“……” You’re stupid. Your entire family’s stupid.</p><br/><p>“Nevermind!” That guy sized her up for a bit, and suddenly, its eyes shone. Slapping its chest, it’s expression changed into a righteous one. “Seeing that we’re of the same race, I shall send you back. My name is Fishhere, the tribe leader of Harmonic Ocean Tribe.”</p><br/><p>“Hoho, wouldn’t that be too much of a trouble?” She could not wait to flee, so how could she bring along a fish?</p><br/><p>“Do not be modest.” That sharkman said with its arms crossed. “Since you’re so stupid, I’m afraid you might not return home even after three days.”</p><br/><p>“Really, there’s no need.”</p><br/><p>“Don’t worry, I’m very familiar with the vicinity.”</p><br/><p>“No need.”</p><br/><p>“I said I’m sending you!”</p><br/><p>“It’s really unnecessary.”</p><br/><p>“Are you going to have me send you, or not!?” It bared its teeth!</p><br/><p>“…… Alright, send me then!” You can’t force people like this. These hot-blooded ‘fish’-youth nowadays, are really hard to please.</p><br/><p>When the Sharkman saw her yielding, it was finally satisfied. Slapping its tail, it moved towards her. Stretching its hand, it wrapped around Zhu Yao’s shoulder, demonstrating a brotherly look. “Tell me then, where do you live?”</p><br/><p>“Uh……” Zhu Yao hesitated for a moment, and suddenly, she thought of a plan. Why not have him bring her to that ancient ruins? After all, no human was more familiar of the terrain of this Secret Realm than a demonic beast. “I don’t really know that place is called either? It’s just that there’s a very ancient palace over there. It’s really big inside, and the spiritual energy there is abundant as well. Oh right, there’s a very strong barrier set up outside, and normally, people are unable to approach it.”</p><br/><p>Hearing her finish her explanation, the the Sharkman’s expression became a little strange. Looking at her from top to bottom, it’s long and thin sharp teeth made ‘guchiguchi’ grinding sounds. “You’re sure that you people live over there?”</p><br/><p>Zhu Yao was exhilarated in her heart. As expected, he knew about it, however, she could not allow him to raise his suspicion. “We have always lived near it, however, tribe leader has never allowed us to casually head outside. This is my first time out here, hence, I got lost.”</p><br/><p>Fishhere stared at her for a while, before dispersing its suspicion. It lightly said. “Why would you people live in that sort of crazy place? I heard that, near those ruins are “Severed Lands”, if you were to get sucked into it, your soul would be scattered.”</p><br/><p>Zhu Yao could only smile and nod.</p><br/><p>“Alright then, seeing that I’m in a good mood, I will bring you home today. But, I shall put this out first, I will only send you to somewhere nearby. I won’t approach the ‘severed lands’.”</p><br/><p>“Thank you, big brother Fishhere.” Zhu Yao immediately nodded.</p><br/><p>Fishhere explained to the rest of the Sharkmen, before signaling to Zhu Yao that they could leave.</p><br/><p>“Wait a minute, where are you going?”</p><br/><p>Zhu Yao had only taken a single step, before she was pulled back by him. He pointed to the front, where the endless seas were. “This way.”</p><br/><p>After saying that, with a ‘plop’ sound, he leapt into the sea.</p><br/><p>They were using the water route!</p><br/><p>Zhu Yao: “……”</p><br/><p>Zhu Yao instantly let out cold sweat, and felt the sense of danger where she was about to be exposed. Because… She did not know how to swim!</p><br/>\n</div>"}