{"title": "Chapter 50: Outsiders Watching the Commotion", "id": 50, "volume": 1, "url": "http://boxnovel.org/my-disciple-died-yet-again-chapter-50-outsiders-watching-the-commotion", "volume_title": "Volume 1", "body": "<h1>Chapter 50: Outsiders Watching the Commotion</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 50: Outsiders Watching the Commotion</p><br/><p>As expected, Wang Xuzhi frowned. He could not chase him away directly, and he would not feel at ease by moving aside either. He could only block in front of Zhu Yao, and was stuck in a difficult position.</p><br/><p>Zhu Yao felt it was a little funny as she watched little wimp behaving like a protective mother hen, blocking in front of her. Her heart was filled with warmth, and had a feeling of ‘my son has finally grown up, and knows how to protect this elderly woman’.</p><br/><p>Seeing such a heart-warming little wimp, how could she not give him face?</p><br/><p>“Kuh kuh…” She pretended to cough, and did her best to act out a cute, naive and oblivious look. With widened eyes, she looked straight at Xiao Yi, and said. “Who are you?”</p><br/><p>Xiao Yi: “……”</p><br/><p>“Tasyoluk” was positioned at a barren land north of the cultivation world. Because of the scattered spiritual energy, and the countless cliffs everywhere, not mentioning mortals, even practitioners would not usually step into this piece of land. However, every five hundred years, the entrance to the Secret Realm would open. Inside, the place was filled with spiritual energy, and spiritual grass were widespread. Although usually, great opportunities would be accompanied by great dangers, every single time, the various clans and sects would still dispatch their elites to search for these opportunities.</p><br/><p>However, only practitioners whose cultivation were below the Nascent Soul stage could enter the Secret Realm. So, every single time, those dispatched were all Azoth-stage elites, and this was a very important matter to every sect.</p><br/><p>Zhu Yao had already felt that the number of people heading there from her sect was large enough, however, when she arrived at the designated location, she actually saw disciples from the various clans and sects had already gathered at the place, and there were even some wandering practitioners as well. The entire place was filled with practitioners, and she did not even see this much people in the previous Inter-Sect Tournament.</p><br/><p>She roughly estimated the number of people to be in the high thousands.</p><br/><p>The various sect disciples were all lead by their respective Nascent Soul stage practitioners. Their clothes were uniform, and they were even standing together, so they were very easily recognizable. The wandering practitioners were basically segregated, however, there were a few of them that were in small groups of four or five.</p><br/><p>This time, Ancient Hill Sect especially dispatched the two great Mountain Lords of Sword Mountain and Talisman Mountain to send them over. Beside the Weapon Mountain Lord Zi Yuan, he was accompanied by a very familiar person. It was actually little fatty Zhao. She did not expect that he had actually formed his Azoth Core as well.</p><br/><p>The current little fatty Zhao had properly kept his initial unique trait, and had turned into big fatty Zhao. It was unknown if it was due to his figure, the arrogant and tyrannical look he had when he was young had disappeared, rather, he seemed to be rather pleasant and charming. He seemed to have something on his mind, and completely did not have the look of excitement and eagerness like the rest of the people in the vicinity.</p><br/><p>Zhu Yao had been pulled along by Wang Xuzhi the entire time, as though he was afraid that she would get herself lost. Along the way, he had repeatedly instructed her to stay away from Xiao Yi, and not to easily trust him. His constant nagging made him look exactly like a mother.</p><br/><p>“It’s here.” A commotion suddenly started within the crowd, and instantly, the entire site became especially noisy.</p><br/><p>Most of the people had already raised their heads and looked towards the sky. They simply saw the sky which was initially still clear and quiet. Suddenly, like it was being torn apart by something, a gigantic crack appeared, as though it was splitting the entire sky into two halves. The crack grew bigger and bigger, and only when it grew the size whereby a dozen people could enter it at the same time, did it finally stop expanding.</p><br/><p>The people below could not wait any longer, as they took out their swords one after another and flew into the crack. However, the ones that moved were just the wandering practitioners. After all, the disciples from the various sects still had to attend to their courtesies, and they still stood unmoving in their original positions.</p><br/><p>A Nascent Soul-stage practitioner walked over, and smiled at the two people who came to lead the Ancient Hill Sect group. “Dear Reverends, as there are so many disciples from your Ancient Hill Sect, why don’t your group enter first?”</p><br/><p>Zi Yuan seemed to have been waiting for these words, and did not decline. He turned and said to the fifty or so Azoth disciples behind him. “This journey will be dangerous, everyone, please remember to not act recklessly at all times. The entrance will close in a month’s time, everyone must make haste to return before the entrance closes.”</p><br/><p>Everyone’s voices were in unison as they replied. “Yes!”</p><br/><p>Zi Yuan waved his hand, and the disciples summoned their flying swords one after another, flying towards the entrance.</p><br/><p>“Be careful, follow me closely!” Wang Xuzhi turned to the back as he spoke, and then, pulled Zhu Yao as they flew towards the entrance. When she entered the entrance, the jade pendant on Zhu Yao’s neck flashed for a moment, before instantly reverting to its initial look. However, no one noticed this.</p><br/><p>After entering, what came into view was a different scenery. In front was a humongous forest where its boundaries could not be seen with a single glance. The disciples that entered earlier had already scattered, and in their current position, there were only the dozen few Ancient Hill Sect disciples who had just entered.</p><br/><p>Zhu Yao, who was used to following a group, naturally flew over as well, however, she realized they were saying their goodbyes. It seemed like these people had already decided on their groups since the beginning, and had already scattered after entering inside. Zhu Yao who was left behind was a little speechless, as she tugged onto Wang Xuzhi beside her. “Who are we going to go with?”</p><br/><p>Wang Xuzhi pointed to Xiao Yi in front of him, and his expression was a little unhappy. “Master had instructed me to follow senior-martial uncle Xiao’s group.”</p><br/><p>Zhu Yao looked at Wang Xuzhi who was extremely unwilling, yet, in her heart, she was a little happy. She did not know the exact location of the “Wood Spirit”, and in her dream, she simply saw that Xiao Yi would find it in an ancient ruin. However, as for the location of that ruin, she still did not know of it. And she was still worried that she did not have an excuse to follow Xiao Yi just earlier.</p><br/><p>Little fatty Zhao was the last to enter the Secret Realm, and the moment he landed, he ran towards a green-clothed lady in the crowd. “Junior-martial sister Lu Cha!” His figure was big-sized in the first place, when he squeezed in, it instantly pushed the few disciples beside him a few steps away.</p><br/><p>The female practitioner whose name was called, slightly furrowed her brows for a moment, yet, she still responded him with a polite smile. “Senior-martial brother Zhao.”</p><br/><p>However, little fatty Zhao was oblivious, and began to chat even more enthusiastically. “Junior-martial sister, are you already in a group? If not…”</p><br/><p>“Senior-martial brother Zhao, I have already decided to be in the same group as Senior-martial uncle Xiao.” Before he could finish what he wanted to say, Lu Cha interrupted him. She then rightly took a step back to the side, and stood beside Xiao Yi.</p><br/><p>“Is that so…” Little fatty Zhao was depressed for a moment, then suddenly, as though he had thought of something, he continued. “It’s fine, incidentally, I have yet to find a group, why don’t I join your group as well?”</p><br/><p>“Junior-martial nephew Zhao!” Xiao Yi laughed coldly. The both of them had a feud with each other in the first place, and currently, his voice became even colder. “It’s still best that you follow the rest of the Weapon Mountain disciples. There are many people in our group, I’m afraid it would be too much of an inconvenience for you, and we might not be able to take care of you.” Not only did these words contain rejection, it even carried contempt as well.</p><br/><p>Little fatty Zhao’s face stiffened a little. Looking at Lu Cha in front of him, his eyes revealed a certain amount of obsession, and he held in the anger within him that was about to explode. “Senior-martial… uncle Xiao, it’s fine. I can take care of myself.”</p><br/><p>Since he had already put it this way, Xiao Yi could not reject him anymore either, and could only silently allowed him to follow them.</p><br/><p>Zhu Yao who was watching at the side, felt a little helpless. This was really a twist of fate. When the two of them were still little wimps, Xiao Yi had been bullied by little fatty Zhao a couple of times. Now, their roles were actually reversed. However, seeing the way little fatty Zhao was acting, he seemed to really like that girly called Lu Cha.</p><br/><p>It’s a pity…</p><br/><p>Zhu Yao looked at the girly who was following closely behind Xiao Yi, and she only had a single thought: while the dropping flowers pine for love, the heartless brook babbles on unrequited love.</p><br/><p>“What are you looking at?” Wang Xuzhi saw her shaking her head, and then sighing, over and over again.</p><br/><p>I’m looking at the commotion over there of course. Zhu Yao pointed to the front.</p><br/>\n</div>"}