{"title": "Chapter 63: Making a Fool out of a Beast Without Discussion", "id": 63, "volume": 1, "url": "http://boxnovel.org/my-disciple-died-yet-again-chapter-63-making-a-fool-out-of-a-beast-without-discussion", "volume_title": "Volume 1", "body": "<h1>Chapter 63: Making a Fool out of a Beast Without Discussion</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 63: Making a Fool out of a Beast Without Discussion</p><br/><p>“Yu Wang?”</p><br/><p>“Your sister’s Desire!”</p><br/><p>“Seems like I’m right.” Yu Yan heaved a sigh of relief.</p><br/><p>Zhu Yao expression darkened. Was there a need to use this type of method to identify her?</p><br/><p>“Let’s return.” Yu Yan sighed, picking up his own disciple, he rose in the air. In an instant, they returned to the peak of Jade Forest Mountain.</p><br/><p>Looking at his disciple’s new look from head to toe once again, he could not accept it no matter what. She actually turned into a man. An unclear knot surfaced deep in his heart for some odd reasons.</p><br/><p>“How did you become like this?”</p><br/><p>Zhu Yao shook her head. “I don’t know either. I fell into the Severed Lands, and after I woke up, I became like this?”</p><br/><p>Master, we’re no longer able to become good girl friends, I wonder if you’re looking for a gay friend?</p><br/><p>“Severed Lands?” Yu Yan frowned even deeper. Recalling everything that happened in the Secret Realm, his heart was filled with unrestrained fury, and the cold aura he emitted became even more evident.</p><br/><p>Zhu Yao could not help but feel a chill down her spine. Master looks so scary, is he about to burst out? She silently took a step back.</p><br/><p>And another step back.</p><br/><p>“Not complying to your master’s orders, and acting arbitrarily, you need to be punished!”</p><br/><p>Zhu Yao’s little heart trembled. “Umm… Is it alright if you don’t hit my face?”</p><br/><p>“Come over here!”</p><br/><p>“Master…”</p><br/><p>Yu Yan did not say another word, it’s just that the cold aura around his body was becoming even more rapid. It seemed like she was unable to escape from this. Zhu Yao could only slowly, and slowly, moved towards him, and heroically stretched out her left hand.</p><br/><p>Hit me then, as long as you don’t hit my face.</p><br/><p>Yu Yan was startled for a moment. Looking at the hand in front of him, his brows furrowed. With a wave of his hand, he moved a piece of rock over and sat down on it. Then, he strongly pulled his disciple’s hand, and had her entirely pressed on his thighs. Aiming at a certain part of her body, he began spanking.</p><br/><p>The hell, why is he hitting my buttocks? Zhu Yao felt like crying, as he was not being lenient in the slightest, and her lips curled from the pain.</p><br/><p>“Aiyo, stop… stop. Master, I admit my mistake.” If he were to continue spanking, her buttocks would bloom.</p><br/><p>Yu Yan paused for a moment, and was hesitating if he was putting enough strength into his punishment.</p><br/><p>Rooar~~ ┗|｀o′|┛</p><br/><p>At this decisive moment, that mystic suddenly popped out of nowhere, and, ignoring the difference in strength, charged at Yu Yan as it began to roar.</p><br/><p>With a wave of his hand, Yu Yan slapped towards it. The mystic beast was instantly slammed a few dozen meters away, and once again, struck towards a tree.</p><br/><p>It crawled up miserably. As expected of a master and his disciple, even the way they attacked was exactly the same.</p><br/><p>“This demonic beast…” Yu Yan recognized this demonic beast as well. Holding his disciple up and protecting her behind him, he looked as though he was about to attack.</p><br/><p>A certain mystic beast, which was hurt from the fall, cried out. “Waaaah, mistress, he bullied me!”</p><br/><p>“He bullied me as well.” Zhu Yao rubbed her own buttocks, and gave it a helpless look.</p><br/><p>Master: ……</p><br/><p>Master sure was ruthless, her buttocks were about to split into four.</p><br/><p>“You subdued this mystic beast?” Yu Yan turned and looked towards his disciple.</p><br/><p>Zhu Yao shook her head. “I did not. It wanted to follow me on its own accord.”</p><br/><p>Yu Yan’s expression instantly turned cold, and he raised his hand, as though he was about to summon a bolt of lightning. That mystic beast trembled, hugging its head with its two paws, it miserably shouted. “I’m her beast, I’m her beast…”</p><br/><p>Zhu Yao looked at it scornfully. At the very least, it was an eleventh-ranked demonic beast, did it have to act so pitiful?</p><br/><p>When the mystic beast saw that she did not have any reaction, it became even more saddened, and began to roll around the ground, crying. “Wuuuuu, you even know my true name, yet you still don’t admit me as your beast. Bad person, wuu… I don’t care. I want to be your beast, I want to be your beast.”</p><br/><p>“……” Zhu Yao was exasperated, and she almost responded it with this line. I don’t want to be on top!</p><br/><p>She could forget about becoming a man, but was there a need to go on the Boy’s Love route!?</p><br/><p>“When did I ever know of your true name?” She was straight.</p><br/><p>The mystic beast stopped, leapt up, and replied with a serious look. “When we were at the Secret Realm, didn’t you call me? You even had me open the door.”</p><br/><p>Open the door? Zhu Yao was startled for a moment, and suddenly recalled that joke password. The corner of her lips twitched.</p><br/><p>“You… can’t be called Sesame, right?”</p><br/><p>The mystic beast tilted its head. “That’s right!”</p><br/><p>The hell! Why were you named so casually? Does your parents know about this?</p><br/><p>“Although a demonic beast’s true name has a very strong binding characteristic, it’s only restricted to demonic beasts below the tenth-rank.” Yu Yan’s expression turned cold. “Just what is your goal for following my disciple?”</p><br/><p>The expression of the mystic beast, Sesame, instantly stiffened, however, it immediately returned to that utterly shameless look it had earlier, and it said even more miserably. “Obviously, it’s because mistress if very strong, by following her, I’m able to return to the Higher Realm much sooner.”</p><br/><p>Yu Yan waved his hand and summoned a bolt of lightning, striking it right next to the mystic beast. Instantly, a large crafter appeared, and his expression became even colder. “Tell the truth.”</p><br/><p>“What I said… was the truth.”</p><br/><p>Bang! Another bolt of lightning struck. This time, however, it directly struck onto its tail. That long tail, instantly turned into two sections.</p><br/><p>“My tail!” Sesame cried out in pain, and turned to hug its tail which had lost half of its form. However, its feet slipped, and it tumbled into the huge crater that was formed earlier, its entire body was now completely stained with dirt.</p><br/><p>When it had finally managed to stop rolling, it turned and looked at its half severed tail which was still oozing with blood. Baring its teeth, it roared out loud, and went to pounce on Yu Yan regardless of its current state. “I’m going to duke it out with you!”</p><br/><p>With a wave of her hand, Zhu Yao slapped right towards it, and once again, slapped it away. Hearing her master say as such, she had thought about it as well. The reason why it was following her was definitely not as simple as just ascension.</p><br/><p>Yu Yan used an Art, and had Sesame, who was still flopping about, fixed at its position. Zhu Yao walked over, and with her palm, she patted on its beast head. “Speak, what’s your goal? An eleventh-ranked demonic beast can activate the Ascension Tribulation Lightning on its own, there’s basically no need to rely on others to ascend.”</p><br/><p>Sesame paused for a moment, and then, refuted angrily. “When we demonic beasts face our tribulation, there’s only one out of ten chance to survive. Lightning naturally suppresses us demonic beasts, and it’s even more so if it’s the Tribulation Lightning of Ascension. I will be zapped to death.”</p><br/><p>Yu Yan slightly narrowed his eyes, and coldly spoke. “It might be the case for other demonic beasts, but if it’s you, that’s impossible.”</p><br/><p>“……” Sesame was startled, and instantly stopped its struggle.</p><br/><p>Zhu Yao suddenly recalled what that old man once said. Sesame was a mystic beast that came from the Higher Realm, which meant that it had once faced the Ascension Tribulation, and had reached the Higher Realm alive. Then, even if it had fell back into the Lower Realm, even if it were to face another round of Tribulation Lightning, it would absolutely not pose any danger to its life.</p><br/><p>Having realized this, Zhu Yao slowly rose and took a step back. Little animals are too smart, there’s a need for humans to make up for their IQ.</p><br/><p>Sesame looked at the two people back and forth. As though it felt that it could no longer hide it any longer, it instantly retrieved the cutesy and pitiful expression it had earlier, and its voice carried a hint of provocation. “Hmph, I didn’t expect to be seen through. As expected of a Demigod-stage old monster.”</p><br/><p>Old monster?</p><br/><p>Yu Yan frowned, and responded. “Takes one to know one.”</p><br/><p>If a Demigod-stage practitioner was considered old, then this demonic beast which had ascended long ago, was as old as the horizon. He turned to looked at his own disciple. Mn, he was not old in the slightest.</p><br/><p>Sesame’s expression stiffened, and once again clenched its teeth. It took a deep breath to hold it in, and leisurely said. “Indeed, I’m capable of ascending, however, I caused some trouble in the Higher Realm back then, and it’s inconvenient for me to be exposed. So, when this little lady… uh, this little kid ascends, I wish to use the name of a contracted beast to return to the Higher Realm, so as to prevent being discovered.”</p><br/><p>What’s the meaning of that pause earlier, hey!</p><br/><p>“Why me?” If it only had to find someone that could ascend to bring it along, then would it not be faster if it was her master?</p><br/><p>“Because you’re easily fooled!”</p><br/><p>Pa! Zhu Yao once again gave it a slap. The hell, why do I feel that people that who speaks the truth, are always asking for a beating!?</p><br/><p>“Stop hitting, stop hitting!” Sesame dodged her hand in a panic, and explained. “The words I told you earlier are not lies! The reason why I’m following you, is because you’re really strong. You have a great fate that an average person do not have.”</p><br/><p>Great fate? Why did she not know about it? Other than dying frequently, was there any other fates?</p><br/><p>“Even if my disciple can ascend.” Yu Yan took a step forward. “She does not need to risk doing this. She does not need to offend deities of the Higher Realm right after her ascension.”</p><br/><p>Only then did Zhu Yao realize this. The hell. This Sesame was clearly using her as a shield.</p><br/><p>“But before that, I will use all my abilities to help her become a deity.” Sesame looked at Yu Yan. “And in any case, even if I wish to stay here, you can’t do anything about it.”</p><br/><p>Yu Yan’s expression sank, and instantly, killing intent rose in all directions.</p><br/><p>However, Sesame completely did not mind at all, and continued to provoke him. “If I’m not mistaken, the reason why I’m like this, is because I do not have a single thread of spiritual power in my body. As long as I charge up my spiritual energy by taking in spiritual energy into my body, I will naturally restore myself to my previous form. I had just tried it earlier, and restored a bit of my spiritual power. You’re unable to kill me.”</p><br/><p>Taking in spiritual energy? Zhu Yao was startled for a moment. Did she not have to be struck by lightning? Back then, her master said that the lightning had incidentally charged up the spiritual energy inside her body, and hence, restored her cultivation. So, she only had to replenish her spiritual energy, and did not need to be struck by lightning.</p><br/><p>Uh…</p><br/><p>She wanted to cry for her own IQ’s sake.</p><br/><p>Yu Yan went silent, and tightened his fists. Although it was impossible for him to lose, currently, they were not in the Tasyoluk Secret Realm. If they were to fight, he was afraid that it would pull the entire Ancient Hill Sect into it. But to have such a threatening individual staying by his disciple’s side, he was unable to stay unworried.</p><br/><p>“Lay down the Life and Death Contract.”</p><br/><p>“Fine!” Seeing that he had compromised, Sesame was joyous, and agreed to it very happily.</p><br/><p>Closing its eyes, its four limbs were placed on the ground. It circulated the single strand of spiritual power in its body to summon its own core, and a blue pearl could be seen flying out of its mouth, floating right about its head. Sesame raised out its front paws to touch it, and the core instantly flashed a hint of blood red, and a drop of red liquid was taken from it.</p><br/><p>“This is my essence blood!” Sesame turned and looked towards Yu Yan, and then, returned its core into its own body.</p><br/><p>Yu Yan spread out his palm, and the drop of blood automatically flew towards him, floating right above its palm. He turned and looked towards his disciple beside him. “Take out your hand.”</p><br/><p>“Ah?” Zhu Yao was a little dazed from the scene, yet, she still obediently reached out her hand. What is this for?</p><br/><p>Yu Yan stretched out his hands and rolled up her sleeves, revealing her entire arm. He pressed the drop of blood into the back of her hand, and instantly, there was an additional red dot on her hand, blood red and dripping.</p><br/><p>Why did she feel like she was being tested for her virginity?</p><br/><p>Sesame was a little unhappy. Clearly, Life and Death Contracts had always been tapped on the forehead, why did he pressed it on her hand? Recalling that he was its mistress’ master, it held his comments back in.</p><br/><p>“Alright, from now on, I’m yours.” Sesame rolled around on the ground, and returned to its former shameless look. “You have to properly pamper me, alright?”</p><br/><p>She felt like beating someone.</p><br/><p>“Mistress, I’m going to recover my spiritual energy for now. You must think about me!” After saying that, it took the half of its tail that was severed earlier from the lightning strike, and with one leap and another, it had ran far away.</p><br/><p>Zhu Yao: “…..”</p><br/><p>Just what the hell happened? Can someone explain it to me?</p><br/><p>“This is a blood contract!” Yu Yan rolled down her sleeves, and explained. “As long as this contract exists, if you’re injured, the same injury will be applied on the body of the contracted. This is a contract for mutual death with demonic beasts.”</p><br/><p>“So, if I’m injured, it will be injured as well. Then if it’s injured, will I…”</p><br/><p>“No!”</p><br/><p>In other words, it’s an one-sided suppression?</p><br/><p>“Then if I were to die?” She recalled something.</p><br/><p>“Naturally, it will die as well.” Yu Yan calmly replied.</p><br/><p>The corner of Zhu Yao’s lips twitched, and bitterly raised out two fingers. “Master, I have already died twice, because of this, you can’t have…”</p><br/><p>Yu Yan’s expression became even calmer, as he reached out his hand to stroke her head. “Return to the cottage, let me help you inspect your injuries.”</p><br/><p>“……”</p><br/><p>Master, is it really alright for you to divert the topic like this? Clearly, you’re making a fool out of that mystic beast, right!? And, where did you see that I’m injured? There’s absolutely no need to inspect, right!?</p><br/>\n</div>"}