{"title": "Chapter 65: Nascent Soul Formation Period", "id": 65, "volume": 1, "url": "http://boxnovel.org/my-disciple-died-yet-again-chapter-65-nascent-soul-formation-period", "volume_title": "Volume 1", "body": "<h1>Chapter 65: Nascent Soul Formation Period</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 65: Nascent Soul Formation Period</p><br/><p>“Ahem!” Zhu Yao could not help but step out. “Umm… This little brother, that ‘Tasyoluk’ Secret Realm will only open once every five hundred years, if she did not come out in time, then she will have to wait for another five hundred years for the entrance to open. Not to mention practitioners who are above the cultivation level of Azoth are unable to enter the place. The way you put it, you’re making things a little difficult for him.”</p><br/><p>Wang Xuzhi tightened his fists, as though he was suppressing something with all his might, and completely did not look as though he bothered about her. After a moment, he hugged his fist and bowed to Yu Yan. “If that’s the case, this disciple is afraid to have offended you. The reason why this disciple has come here is to simply confirm if big sis Zhu Yao had returned. But now it seems… Since ancestral-grand master does not have a way to enter the Secret Realm, then I will find one myself. This disciple takes his leave!”</p><br/><p>As though he had decided on something, his expression was even more firm, as he turned and left without the slightest of hesitation.</p><br/><p>Seeing that expression, Zhu Yao’s heart shook. This little wimp could not be thinking of forcefully entering ‘Tasyoluk’, right? The barrier outside the Secret Realm could even block against Demigod-stage practitioner, if an Azoth practitioner like him were to forcefully enter the place, he would definitely be crushed into smithereens.</p><br/><p>As she suddenly had a bad premonition, the words to stop him blurted out just like that. “Little wimp, you’d better come back here, right now!”</p><br/><p>Just as he was about to step out, his feet stopped. He suddenly turned his head over, his pair of eyes stared widely at her, and his expression was filled with disbelief.</p><br/><p>“……” Uh, is it too late to regret?</p><br/><p>“Big sis… Zhu Yao!?”</p><br/><p>As expected, it’s too late.</p><br/><p>A certain master turned his head over as well, and threw a pair of scornful eyes at her, as he shook his head with a disappointed expression.</p><br/><p>Uh… Just why could she not change her habits of having a cheap mouth?</p><br/><p>“Big sis Zhu Yao, you… why are you…” Wang Xuzhi, sprinted back like the wind, and swept his gaze at her from top to bottom.</p><br/><p>“Don’t ask me. I want silence.” If you ask me who’s silence, I will beat you to death.</p><br/><p>Wang Xuzhi’s eyes fixated on her chest, and he raised his hands as he wished to pressed on it.</p><br/><p>With her palm, Zhu Yao slapped away his claws, and then, she raised her hand and gave him a huge bump on his head. “Stinky brat, what are you doing!?”</p><br/><p>“No… Nothing. I just… just… Big sis Zhu Yao, You… Why did you turn into…” Probably because of the blow from the truth was too large, Wang Xuzhi began to speak incoherently.</p><br/><p>Did she not just simply switch a character? Was that so hard to accept?</p><br/><p>However, Wang Xuzhi was even more confused, and even more anxious. “I… I couldn’t find you in the Secret Realm. And after coming out, I still wasn’t able to find you. You… You returned… You finally returned…”</p><br/><p>“Why are you crying?”</p><br/><p>“I’m not!” Wang Xuzhi hurriedly rubbed his eyes, and he said those words rather smoothly.</p><br/><p>“You’re still denying it!?” Seeing this big youth whose words were becoming messier, and had begun to shed tears, Zhu Yao felt her heart aching a little. “I’m fine. Your big sis is an unkillable machine, I simply changed my form, that’s all.” She stroked the back of head which she had knocked onto earlier. So this little wimp actually returned into the Secret Realm to find her. At least you’re considerate, I didn’t pamper you for so many years for nothing.</p><br/><p>“Form? Then, right now, big sis Zhu Yao is really…”</p><br/><p>“That’s right, I’m a man!”</p><br/><p>“……” Wang Xuzhi opened his eyes wide, and his hand trembled as he pointed at her.</p><br/><p>Zhu Yao patted on his shoulder, and in her heart, the thought of bullying someone had resurfaced once again.</p><br/><p>“Now that I have turned into a man, will you despise me?”</p><br/><p>“Of course not!” Wang Xuzhi loudly answered.</p><br/><p>“You’re still the best.” Zhu Yao acted like she was moved, and rubbed the corner of her eyes, as she threw a flirtatious look at him. “Little wimp, do you still remember what you said when you were little? That you will definitely marry me. I believe we have all grown up, and it’s about time to fulfill your promise. Take me as your bride then. If not, I’m fine with taking you as my bride too.”</p><br/><p>“Ah? Ah?”</p><br/><p>Wang Xuzhi suddenly took a step back, and looked at her with a conflicted expression. His face turned from red, to white, and then green, it was so fascinating, she could not shift her gaze away at all.</p><br/><p>“Enough.” As though he was unable to endure this irritating thousand-mile reunion, a certain master was in a bad mood, as he coldly stared at Wang Xuzhi. “You have trespassed into the Jade Forest Mountain. I will not fuss about this matter. Leave!” Someone else’s disciple, hurry and scram! Don’t teach my disciple bad things.</p><br/><p>Wang Xuzhi looked at Zhu Yao, and his expression was conflicted. As though he had encountered a huge problem, he could not bear to leave.</p><br/><p>“If we get the opportunity in the future, I will discuss with you about it again in detail…” Zhu Yao narrowed her eyes, approached the side of his ear and said with emphasis of each and every word. “The. Things. Regarding. Our. Marriage.”</p><br/><p>“……” His legs turned limped, and left Jade Forest Mountain like he was flying.</p><br/><p>Zhu Yao’s stomach began to ache from laughing. He really could not handle scares. Was her turning into a man something that he could not accept that much? Look at how calm her master was…</p><br/><p>Not only did he not despise her, he even stripped off her clothes directly the moment he saw her.</p><br/><p>==</p><br/><p>No, wait. That was not something that she should be happy about.</p><br/><p>The second day after her return, a certain master, so as to prevent other disciples from suddenly trespassing and teaching his disciple bad things, silently activated the formation of Jade Forest Mountain. Wang Xuzhi was completely unable to enter, and Zhu Yao’s only entertainment had disappeared as well.</p><br/><p>However, the heavens seemed to be purposefully not allowing her to stay idle, as she felt strange in the early morning. The sky above the entire Ancient Hill Sect was a little dark, which seemed to be a precursor for a huge storm. Even the heavenly cranes on the Jade Forest Mountain began to cry out crazily.</p><br/><p>As though something had brought about their uneasiness.</p><br/><p>The pressure of the air was very unbearable, and Zhu Yao felt strangely flustered, and kept feeling as though something was about to happen. Raising her head, she looked at the sky, only to see the tumbling dark clouds, and something seemed to be brewing inside the layers of clouds.</p><br/><p>Normally, the Ancient Hill Sect was a blessed land, and would always be bathed by spring sunshine, a large-scaled gloomy weather like this rarely happened. The more Zhu Yao stared at those clouds, the more muffled she felt her heart was. She kept feeling as though something was in the middle of the clothes, something that she felt very intimate to.</p><br/><p>“Someone’s forming his Nascent Soul.” Yu Yan frowned as he looked at the tumbling lightning clouds in the sky. “With such a huge heavenly might, it seems like the Lightning Tribulation will be falling soon.”</p><br/><p>“Lightning Tribulation?” Could it be Xiao Yi? However, he had only formed his Azoth Core not too long ago. Even if he had hidden his cultivation, it could not possibly allowed him to reach the level of an Azoth Paragon in just a single month. Unless….</p><br/><p>Zhu Yao suddenly recalled that berserk Metal Spirit. Although the Metal Spirit stopped its disturbance, it had taken in a huge amount of metal spiritual energy. If it had returned to Xiao Yi’s side in that state, it was not impossible for him to instantly form his Nascent Soul. So the one forming his Nascent Soul was really him?</p><br/><p>Zhu Yao instantly felt a little depressed. She seemed to have unconsciously helped him out.</p><br/><p>Raising her head, she looked at the mass of black clouds, and suddenly recalled back then when Xiao Yi was forming his Azoth Core. She thus made a joke. “Master, do you think the Heavenly Lightning this time, will come zapping at us again?”</p><br/><p>Yu Yan was startled, as though he had thought of something, he suddenly turned towards his own disciple, and his eyes instantly shone.</p><br/><p>“Master?” What happened to him now?</p><br/><p>“Follow me.” Yu Yan summoned his flying sword. Turning to look at his stupid disciple who had yet to understand, as though he seemed to despise her slow movements, he picked his disciple up by the collar, and rose into the air. His figure flashed, as they flew towards the eastern direction.</p><br/><p>“Master, we can always discuss things first.” Was there a need to pick her up this way?</p><br/><p>Yu Yan did not say a single word, he simply flew towards the very edge of the Tribulation Clouds, and stopped at a small island far from the Ancient Hill Sect.</p><br/><p>Placing Zhu Yao down, he did not explain, and simply, like a hard-working little bee, began to set up various formations on the island. Although Zhu Yao was not very familiar with formations, she could faintly see that, the formations he had placed down were all concealment-related formations.</p><br/><p>“Master?” Give me an explanation!</p><br/><p>After a few minutes, Yu Yan finally stopped, and threw a bombshell. “You shall form your Nascent Soul here.”</p><br/><p>“Eh?” What kind of situation was this? Forget about lightning spiritual energy, the amount of spiritual energy on this island was very sparse as well. What kind of national level joke was this?</p><br/><p>Stupid. Yu Yan shook his head, and pointed to the Tribulation Lightning up in the sky. “Can you sense the lightning spiritual energy within those lightning clouds?”</p><br/><p>Zhu Yao nodded. Not only was she able to sense it, she had a feeling that the thing inside the clouds were especially trying to come to her, yet, they seemed to be restrained by something.</p><br/><p>“When the bolts of Tribulation Lightning descend, you shall do your best to guide them to this island.”</p><br/><p>“What master means is…” Zhu Yao finally understood. His intention was to have her form her Nascent Soul by taking in the lightning spiritual energy from the Tribulation Lightning. What else could have more abundant lightning spiritual energy than Tribulation Lightning? Her master was very smart, and she gave him a thumbs up. “I understand.”</p><br/><p>“Your master will use the Lightning Guiding Art as well, to aid you in guiding the Tribulation Lightning over. You shall form your Nascent Soul with all your might.”</p><br/><p>“Mn!”</p><br/><p>Zhu Yao instantly sat in a lotus position, closed her eyes, and calmed her emotions. She attentively sensed the Tribulation Clouds over there, and could faintly see the sparks within the layers of tumbling clouds.</p><br/><p>The sky had completely turned dark, and suddenly, a thunder roared, and a bolt of white lightning flashed from within the layers of clouds. Hurry, over here. Hurry, over here. Hurry, over here. Zhu Yao silently thought.</p><br/><p>That bolt of lightning struck down, and just when it looked as though it was about to land on the person in Ancient Hill Sect who was facing the Tribulation, it suddenly did a curve, headed straight for the little island, and impartially struck onto Zhu Yao’s body.</p><br/><p>A large amount of lightning spiritual energy instantly poured into Zhu Yao’s body. An indescribable pain ached through her entire body, to the point where she could not even straighten her hips. Especially the place where her Dantian was, as it looked as though it was about to be shattered apart.</p><br/><p>Only then could Zhu Yao really feel what it felt like to shatter her Core. This pain was exactly the same as how she felt right before she died at Tasyoluk. After resurrecting, she did not have any spiritual energy, so naturally, she could not feel the pain of her shattered Core. Now, the pain, as though it had suddenly fragmented, came attacking once again, and she seemed to be unable to hold on, as the pain she was experiencing was as though her heart was crumbling down.</p><br/><p>“Pay attention, and guide the spiritual energy into your divine sense.”</p><br/><p>Yu Yan’s words sounded.</p><br/><p>Zhu Yao instantly regained quite a bit of consciousness, and instantly used all of her might within her body, to guide the lightning spiritual energy particles that was going rampant in her body, into her divine sense, however, this brought about an even more unbearable pain. If the pain of a shattered Core could be taken as a pain on a physical level, then this time, it was her soul which was in pain. However, she simply could not stop, and could only continue to guide the spiritual energy and refine her own divine sense. Zhu Yao even began to have thoughts of swearing.</p><br/><p>She was actually still clearly conscious right now, it was definitely a miracle. Just when she thought that she was able to hold on, even without her guidance, the second bolt of Heavenly Light actually came striking towards her, and the spiritual energy in her body increased explosively.</p><br/><p>The hell, was there a need to be this quick?</p><br/><p>Zhu Yao had no choice but to crazily guide the lightning spiritual energy into her divine sense, causing the sense of pain to intensify. Immediately after, the third bolt, the fourth bolt, every bolt was stronger than the previous one. Those bolts of Tribulation Lightning seemed to have grown eyes, as every bolt struck was smoother than the one before. In the end, they even saved the step of making a curve from Ancient Hill Sect, and directly zapped towards her.</p><br/>\n</div>"}