{"title": "Chapter 61: Zhu Yao Version 3.0", "id": 61, "volume": 1, "url": "http://boxnovel.org/my-disciple-died-yet-again-chapter-61-zhu-yao-version-30", "volume_title": "Volume 1", "body": "<h1>Chapter 61: Zhu Yao Version 3.0</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 61: Zhu Yao Version 3.0</p><br/><p>Zhu Yao went silent for a moment, clenching the fists next to her. “Then what about him? If the Secret Realm collapses, what will happen to my master?”</p><br/><p>“He’s just a thread of divine sense, as long as you have a chance to get out, there will always be a way to fix one’s divine sense.”</p><br/><p>“And what if it can’t be fixed?”</p><br/><p>“Uhh… Uhh… Then probably, during the Ascension Lightning Tribulation, he will have to suffer quite a bit.” If one’s divine sense was incomplete, forget about suffering, even if he was a Lightning Spirit Vein Holder, probably, he would still be zapped to the point where his ashes would not even remain.</p><br/><p>Zhu Yao instantly felt her heart aching. As expected, her master had already resolved himself to death, hence, he was so anxious to have her leave.</p><br/><p>Taking a deep breath, she held in the surging heart-plugging feeling. “Old man, what other ways are there to stop the berserk Metal Spirit?”</p><br/><p>“Unless there’s a spiritual power, equivalent to the strength of the Metal Spirit, suppressing it, we only have that Demigod-stage practitioner to stop that metal spiritual energy disturbance.”</p><br/><p>“Spiritual energy disturbance…” Zhu Yao muttered these few words, she seemed to have…</p><br/><p>Zhu Yao had already made her decision in her heart. Circulating her spiritual energy, she summoned vines and pulled over Lu Cha from not far away. This gay old man, as she thought, he did not care about the lives of women.</p><br/><p>Placing Lu Cha beside Xiao Yi, she ignored the old man’s look of despise, took down the jade pendant her master gave her from her neck, and placed it in Lu Cha’s pocket.</p><br/><p>“Tasyoluk” had a formation outside that prevented practitioners whose cultivation level were above Azoth from entering. Hence, her master could only reside in this jade pendant. As long as this jade pendant were to leave the Secret Realm, her master would naturally be sent back.</p><br/><p>Zhu Yao sat in a lotus position, and sensed the lightning spiritual energy she was most familiar with from the surroundings.</p><br/><p>Now…</p><br/><p>Let’s have this spiritual energy disturbance kick up a notch!</p><br/><p>That’s right, she was taking in the spiritual energy into her body.</p><br/><p>In her experience as a practitioner, she had only recklessly taken in lightning spiritual energy once, and that one time had brought about a lightning spiritual energy disturbance. After that, when she was forming her Azoth Core, her master had only allowed her to take in energy from those purple bolts of lightning.</p><br/><p>It’s just spiritual energy disturbance, right? Metal Spirit? So what!</p><br/><p>This lady here knows how to do it too!</p><br/><p>As Zhu Yao willed it, the surrounding lightning spiritual energy particles, carrying sparkling little tails, began to pour crazily into her body, endlessly. Her meridians once again gave out that familiar pain, and Zhu Yao could only clench her teeth and hold on. She recklessly circulated her Azoth Core, suppressing the spiritual energy.</p><br/><p>In an instant, the sky which was initially dim, became as dark as the night. Within the tumbling clouds, lightning flashed and thunder roared.</p><br/><p>In an instant, Yu Yan noticed his disciple’s abnormality. He turned and looked shockingly at his disciple who was on the ground. This stupid disciple, what is she thinking?</p><br/><p>“Stop now!” Yu Yan struck away that pestering mystic beast with his sword, and flew towards his disciple. However, he was blocked by the layers of lightning spiritual energy, his cold face carried anger that he never had before. “Yu Wang, you have only just formed your Azoth Core, and you’re unable to endure such amount of lightning spiritual energy.”</p><br/><p>Zhu Yao looked at him, and could not help but spit out a sentence. “Your sister’s Desire…”</p><br/><p>Remember your own disciple’s name well, hey!</p><br/><p>“Be obedient.”</p><br/><p>Zhu Yao still ignored him. Disciples had their rebellious phases as well, you know.</p><br/><p>Releasing her divine sense, the pouring of lightning spiritual energy became even more wild, and in an instant, a white gigantic flash of lightning, as though it was a gigantic dragon, charged towards the sky, as if it was trying to tear apart the entire sky.</p><br/><p>“Yu Wang!” Yu Yan’s frowned deeply. He had decided to circulate all of the spiritual energy inside him to break apart that ray of lightning, and forcefully pull his disciple out of it.</p><br/><p>In an instant, the entire Secret Realm twisted.</p><br/><p>“Now!” The old man’s expression carried delight, and instantly, he activated the formation. The formation brightly lit up, and the three figures began to disappear. In just a moment, they had already been sent outside.</p><br/><p>Yu Yan, who was just about to charge out and save her, in a flash, disappeared without a trace as well.</p><br/><p>At that moment, Zhu Yao finally heaved a sigh of relief. Great, I still made it in time.</p><br/><p>However, the Metal Spirit did not stop.</p><br/><p>She could feel her cultivation level rising explosively. However, with every increase, the pain in her body would increase. Her veins all over her body had already been torn apart, and the severe pain was almost causing her to lose sense of her four limbs. However, the pain seemed to have been coming from her divine sense, and it was basically unable to subside. She could already sense her Azoth Core shattering apart.</p><br/><p>Squeezing out her last bit of consciousness, she struggled to control the lightning spiritual energy, wrapping them around the Metal Spirit’s pillar of light.</p><br/><p>Rooooar~~ ┗|｀o′|┛</p><br/><p>A roar sounded, that mystic beast suddenly came out from nowhere, yet, when it was unable to find his earlier opponent, it became even more furious. Hence, it roared and growled at Zhu yao, the only living being on-site.</p><br/><p>Why would Zhu Yao even have the mood now to care about it? She instantly turned her head over and scolded.</p><br/><p>“Shut up!”</p><br/><p>When those words fell, a bolt of Heavenly Lightning zapped towards it, emitting out a heaven-trembling roar. However, it did not land on the mystic beast, but on the sea waters which were severed off at the side. In an instant, a large half of the sea waters dried up, revealing a big piece of empty land.</p><br/><p>“Meooww….” The mystic beast seemed to have been frightened that tyrannical strike, and even the sound it made had changed. Its stomach laid on the ground, its tail was shivering, and its two paws held onto its head, as it no longer dared to look at her.</p><br/><p>Zhu Yao no longer had the energy to care about this freak. Her consciousness had already begun to blur, and the spiritual energy in her body had already reached its peak. Her cultivation had already rushed towards that of an Azoth Paragon’s, and the spiritual energy was still rapidly increasing.</p><br/><p>Her Azoth Core could not endure such spiritual might, and had already shattered. She knew that the best way to keep herself alive now was to form her Nascent Soul.</p><br/><p>However…</p><br/><p>The hell, she did not know how. Her master had yet to teach her that! This was largely equivalent to someone who managed to skip grades and entered the high school that one had dreamed of, only to have the teacher tell her that what was taught here was the university curriculum!</p><br/><p>Haah, did her life have to be this unfortunate!?</p><br/><p>Hence, she could only have the lightning spiritual energy particles wrap about that berserk metal spiritual energy particles with all her might. She saw the two making contact with each other, and began to disperse. Only when the entire pillar of light was wrapped around by the white lightning, did that pillar of light, as though it had been blown away, along with that wild ray of lightning, disappear without a trace.</p><br/><p>The surroundings were instantly utterly silent.</p><br/><p>Zhu Yao fell onto the ground. She had completely turned into a bloody person, and no longer had the ability to take in spiritual energy into her body.</p><br/><p>She was actually still alive. As she thought, heavens cared about good people. Even though she was unable to move, Zhu Yao had the silent impulse to give heavens a thumbs up. Like a bloody pile of mess, her body spread on the ground. She looked at the Metal Spirit floating in mid-air, as it disappeared from the sky with a flash of light. It seemed like it had returned to Xaio Yi.</p><br/><p>Zhu Yao felt that she had to sleep for several days and nights before she could get up. Suddenly, she heard loud bangs. When she turned to look, at a place to her right, it had begun to cave in at a large scale. At the place where the ground was, a large piece of black region. She completely could not see anything clearly at all, yet, it looked as though it was a gigantic black mouth, currently swallowing this Secret Realm.</p><br/><p>Zhu Yao suddenly recalled the words of that Sharkman – Severed Lands!</p><br/><p>The hell! If she had known she would leave, why the hell did she arrogantly force her master back?</p><br/><p>Is it too late to regret my decision? Master… Come back!</p><br/><p>Unfortunately, facts had proven that, even a prized treasure could not be used to buy medicine for regrets.</p><br/><p>The caving in spread to where to she was lying at, and then, she felt into the deep abyss. She continued to fall, however, she did not feel any pain.</p><br/><p>Zhu Yao could not help but rejoice a little. She was fortunate that she was only falling, at the most, she would only lose some arms and legs. According to the no-death rule when one were to fall from a cliff and enter another world, she would still be alive.</p><br/><p>As she thought of this, suddenly, in front of her, with a sizzle, a familiar dialogue box appeared. And this was written neatly on it.</p><br/><p>Congratulations, you have thoroughly died once again. It’s time for you to resurrect. Please choose: Yes or Yes!</p><br/><p>Haah~ This is getting on my nerves!</p><br/><p>What happened to the promised no-death rule?</p><br/><p>This lady here has yet to die, this lady here is still living, and I’m still breathing.</p><br/><p>However, that dialogue box completely did not care about her objection, and began to crazily pop up one after another in front of her.</p><br/><p>Zhu Yao’s angry!</p><br/><p>So as to prevent the tragedy last time from happening again, Zhu Yao decided to close her eyes.</p><br/><p>However… why did they pop up in her mind as well!?</p><br/><p>Not choosing. This lady here isn’t going to choose at all.</p><br/><p>Even when the dialogue boxes had filled up her entire vision, Zhu Yao did not have the intention to choose.</p><br/><p>The dialogue boxes finally stopped their wild pop-ups, and then, another dialogue box appeared, carrying a red exclamation mark, and a warning.</p><br/><p>You have went past the time limit. Your choice will now be automatically selected! Countdown in 10 seconds…</p><br/><p>9、8、7……</p><br/><p>The hell! What happened to your humanity? Do you believe that I will ask for your bank account number?</p><br/><p>3……2……1</p><br/><p>In the next second, Zhu Yao once again saw that damn loading bar!</p><br/><p>The protagonist Zhu Yao is dead!</p><br/><p>The story has… Your sister’s story has ended! – flips table –</p><br/><p>Once again, when she saw light, the first thing Zhu Yao did was inspect her body. Great, long arms, long legs. Very normal, not an infant, and there’s nothing suspicious stuffed inside her mouth.</p><br/><p>She looked around for something that could reflect light. Incidentally, there’s a clean and smooth rock that was even shining light in front of her. Zhu Yao instantly sprinted over, and inspected herself in the reflection.</p><br/><p>Great, very complete. Inside the reflection was a very upright young girl, wearing a navy-colored gown. Her hair was not very long, yet, it was nicely bunned up on top of her head. Her eyes were filled with heroism, and the most important aspect was that her height was around hundred and seventy centimeters. Zhu Yao, who had been a person of short stature for several years, expressed her satisfaction.</p><br/><p>The only flaw was, she was still flat-chested. Touching in her chest, it was even flatter than the little bun back then. Zhu Yao silently retorted that it might be because all of her nourishment had went to her height, hence, the flatness.</p><br/><p>“Little brother, mind if I ask if ‘Ancient Hill Sect’ is written here?” Just as she was inspecting her new body, suddenly, a youth appeared next to her, and patted on her shoulder.</p><br/><p>“Of course not! The Ancient Hill Sect is…” Zhu Yao said as she shook her head, yet, she swallowed back her words after seeing the three big words stated on the stone.</p><br/><p>The hell, it really was the Ancient Hill Sect.</p><br/><p>“Little brother?” The youth saw that he was stunned, and could not help but pat on his shoulder again. “I’m sorry, I’m a wandering practitioner, so I don’t really recognize words. I’m just about to seek admittance in the Ancient Hill Sect. I heard from rumors that there’s a teleportation formation here, so I came here to take a look. Little brother, help me look at it, is this the place?”</p><br/><p>“Uh, it’s here alright.” Zhu Yao rubbed off the cold sweat off her head. She did not expect that she resurrected right at the doorstep of her own home.</p><br/><p>“Thank you, little brother.” The youth returned him a bow, and then, walked towards the right of the stone. The formation lit up, and his figure began to fade, yet, he did not forget to bid her goodbye. “Little brother, see you.”</p><br/><p>“See you.” Zhu Yao returned a reply, and momentarily felt a little strange. Why the hell did he call her little brother? She once again looked at the reflection in the stone. A navy gown with bunned up hair. So she was wearing a menswear, and adding that she was tall, it was no wonder he had mistaken her.</p><br/>\n</div>"}