{"title": "Chapter 79: The Sect Master’s Thoughts", "id": 79, "volume": 1, "url": "http://boxnovel.org/my-disciple-died-yet-again-chapter-79-the-sect-master%E2%80%99s-thoughts", "volume_title": "Volume 1", "body": "<h1>Chapter 79: The Sect Master’s Thoughts</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 79: The Sect Master’s Thoughts</p><br/><p>After his careful analysis, and diligent investigation on his ancestral-grand master’s actions, Zi Mo finally came up with a conclusion. Could it be that he felt that it was still not enough? Elder Soi Sauz’s current reputation had yet to reach the standard he was expecting? Of course, with ancestral-grand master’s title as the number one in the cultivation world, the achievements Elder Soi Sauz had currently made, were indeed not enough to grab his attention.</p><br/><p>The more Zi Mo thought about it, the more he felt it was plausible. He silently decided to grab every opportunity, and even if there was no opportunity available, he would create opportunities to raise Elder Soi Sauz’s influence in the future.</p><br/><p>Hence, when Zhu Yao, whose injuries were healed only recently and had been ruthlessly taught a lesson by her own master, returned to her own cave residence, her head began to spin in all directions by the bunch of documents regarding the sect’s affairs, which were brought there by Wang Xuzhi.</p><br/><p>The hell, what happened to the promised leisurely Elder life?</p><br/><p>The number of deaths of spiritual plants and the amount of medicinal ingredients used in the Medicine Mountain, the number of talisman papers wasted by the Talisman Mountain, and even the number of spiritual beasts birthed in the Beast-Taming Mountain? Why was there a need for her to manage situations like these? It’s not like she knew how to deliver a child!</p><br/><p>“Big Sis Zhu Yao?” Wang Xuzhi looked a little worriedly at Zhu Yao, who was already at the brink of collapse. “Are you alright?”</p><br/><p>“Hoho, do I look fine to you?” Zhu Yao replied him with a bitter smile. This could not do. She had to discuss this with Zi Mo, after all, she still had the heavy responsibility of saving the world.</p><br/><p>“I heard that you suffered injuries two days ago.” Wang Xuzhi looked at her a little hesitantly, and a little guiltily. “I’m sorry. I only knew that you went to such a dangerous place today.”</p><br/><p>Zhu Yao turned her head, and rolled her eyes at him. “Even if you find out about it earlier, what can you do about it?” The rescue operation was something decided by the Nascent Soul higher ups, he, an Azoth-stage practitioner, naturally would not know about it.</p><br/><p>“If I knew about it, naturally, I wouldn’t have allowed Zhu Yao to take the risk.” Wang Xuzhi was a little agitated. Yucang City was the city of heretic practitioners, so how would he be at ease and allow her to go?</p><br/><p>“Little wimp.” Zhu Yao pressed on his head, and began to rub it vigorously. “This is a matter between adults. You just have to do well in your cultivation, what’s there for you to worried about?”</p><br/><p>“Big Sis Zhu Yao!” Wang Xuzhi exploded, angrily pulling her hand down. He then said with a stern expression. “I’m no longer a child, stop treating me like one.”</p><br/><p>“Yes, yes, yes, you’re an adult now.” Zhu Yao casually replied. Staring at the various documents in front of her, she suddenly had an idea. Piling all of them up, she pushed them into his hands. “Here, I shall give you a chance to prove that you’re an adult.”</p><br/><p>“…” Wang Xuzhi was startled for a moment, and then, he sighed deeply. “Big Sis Zhu Yao. You can’t have planned on pushing all these to me since the beginning, right?”</p><br/><p>“How can you call it ‘pushing to you?’ This is to train you.” In any case, she was dead-set on not admitting to it. Patting on his chest, she said. “A big man must take on responsibilities. Go! The time to prove yourself has come! You can do it!”</p><br/><p>“You…” Wang Xuzhi’s face revealed a complicated expression. Only after a moment did he finally let out a sigh, submitted to his fate, took over the small mountain of documents, and kept them within his storage pouch. “As always, you will only acknowledge my abilities when you’re bullying me.”</p><br/><p>How could that be? No matter how many times she bullied him, she had never felt he had any sort of abilities. He’s still a child! – Rubs his head! –</p><br/><p>This time, however, Wang Xuzhi did not resist, and allowed her claws to ravage his own head. Glancing at that familiar, yet unfamiliar face of hers, he tightened the grip of his hands, as though he had decided on something. “Big Sis Zhu Yao. The words you told me on that day, I have considered it.”</p><br/><p>“Ah?” What did I say?</p><br/><p>He pulled down Zhu Yao’s trouble-making hand, yet he did not release it, instead, he tightly held it by the palm. The temperature of his palm was a little blazing hot, Zhu Yao awkwardly tried to struggle out, yet, she was unsuccessful.</p><br/><p>“An unfaithful person will never be welcomed. So, I decided to fulfill my promise.”</p><br/><p>“Ah?” Just what is he trying to say?</p><br/><p>“I have decided.” Wang Xuzhi’s hand suddenly tightened, to the point where Zhu Yao felt it began to hurt. “No matter what you turn into, I will still take you as my bride, and take care of you for this entire lifetime.”</p><br/><p>Zhu Yao suddenly lost balance, and had almost fell off her chair. “What?”</p><br/><p>The hell, back then, she was just joking with him. He couldn’t have treated it seriously, and pondered deeply about it, could he?</p><br/><p>“I know, with your current form, other people will definitely have many misunderstandings about us.” Wang Xuzhi still explained with a serious look. “However, no matter what others say, I will simply ignore them.”</p><br/><p>“…” Zhu Yao’s face darkened from hearing it. He even actually placed these secular opinions into his considerations. Just what the hell had this little wimp been thinking about during the few days she had not seen him?</p><br/><p>She could not help but stretch out her hand and placed it on his forehead. “It’s not burning up though?” Then why was he talking such nonsense?</p><br/><p>“Big Sis Zhu Yao, I’m serious!” Wang Xuzhi became anxious, as he stared deeply into her eyes. That expression was as serious as you wanted it to be.</p><br/><p>Zhu Yao felt her head aching. With a little wimp who always take things seriously by her side, it really was terrifying.</p><br/><p>With lightning speed, she raised a finger and strongly flicked it at his white and clean forehead. So as to achieve a better effect, she even added spiritual energy into it. Little wimp Wang instantly broke away, releasing her hand, his hands moved to hold his own forehead. It hurt so much, even tears were about to flow out.</p><br/><p>Zhu Yao glanced at him in contempt. “I was only joking with you back then. I was only kidding with you, why did you treat it so seriously? If you make fun of this old woman again, I’m going to spank your buttocks.”</p><br/><p>“Big Sis Zhu Yao!” Wang Xuzhi held onto his forehead, and looked at her with teary eyes. “Could it be you think that my words earlier, are simply a child’s banter?”</p><br/><p>“What else can it be?” Zhu Yao shrugged.</p><br/><p>Wang Xuzhi’s face instantly turned red. His widened eyes stared ruthlessly at her for a few moments, as though he was suppressing his anger with all his might. After a few moments, he suddenly stood straight up, snorted heavily at her, and then, walked away furiously without even saying his goodbyes.</p><br/><p>Yo, is he rebelling now?</p><br/><p>This time, after Wang Xuzhi had left, he had not came over to see her for about a week. This little wimp’s temper really big, huh. Zhu Yao pondered for a moment, and felt that he had already entered the rebellious phase. It was exactly the period when a child especially liked to go against his parents. After silently considering the factors, she wondered if she change her method of education?</p><br/><p>As she thought of this, the cry of a mythic bird sounded. Sovereign Feng Yi suddenly descended from the top of the mountain, riding on that mythic bird of hers, she stopped at her courtyard.</p><br/><p>Why was this mountain-top flower at her place? She could not be here to settle scores, right? Zhu Yao faintly felt a bad premonition.</p><br/><p>“Greetings, Sovereign Feng Yi.” Zhu Yao stepped forward and bowed.</p><br/><p>“No need for the courtesies.” Feng Yi nodded. After inspecting him from head to toe, she hesitantly spoke up. “Your injuries…”</p><br/><p>Zhu Yao laughed. “They’re completely healed.” Her master, who could take on multiple enemies at once, stepped in, after all.</p><br/><p>“That’s good.” Feng Yi seemed to heave a sigh of relief, and her expression soothed by a bit as well. As though she had never conversed with others like this before, she seemed a little constrained.</p><br/><p>“Sovereign, if you do not mind, why don’t you come into my courtyard and have a seat?” Zhu Yao suggested.</p><br/><p>Feng Yi nodded. Following him into the courtyard, she sat down on a stone chair, and only then did she hesitantly speak up. “Do you mind if I inspect your injuries?” After all, he was injured because of her. If she did not personally inspect it, she would be unable to be at ease.</p><br/><p>Zhu Yao unreservedly stretched out her paw. Look all you want then. After all, every single person that came to visit her all wanted to grab her hand. The Sect Master was like this, Zi Dan was like this, and even little wimp was like this as well. It caused her to feel like stretching out her paw whenever she were to see people. All’s that left was to reply with a ‘woof’.</p><br/><p>Feng Yi looked at it for a moment, and only then did her expression soothe a little. However, when she retracted her hand, she turned around and pulled out a large bunch of items, and then placed them in front of her.</p><br/><p>There were medicinal pellets, spiritual grass, and there were even a few unknown mystical tools. They filled up the entire table, and every single one of them faintly carried traces of spiritual energy. With just a glance, one could tell every single of them were valuable treasures.</p><br/><p>What was she trying to do? Show off her wealth?</p><br/><p>“The reason I’m here today is to especially thank you.” Feng Yi looked at him, as though this was the first time she had ever done such a thing, her expression was a little uncomfortable. “These gifts are my thanks to you.”</p><br/><p>Zhu Yao was startled for a moment. She had never expected that this Feng Yi could actually be this humane. Looking at the gold and sparkling treasures that filled the table, she really felt like keeping all of them into her waist pouch. However, she was unable to discern when she would die, so if these items were to be given to her, they would be completely wasted.</p><br/><p>“It’s fine, there’s no need.” Zhu Yao pressed on her twitching paws. “I didn’t save you because of these anyway. It’s best that you take them back.”</p><br/><p>Feng Yi was dumbfounded, and was a little anxious. “If these aren’t up to your standards, just tell me what you need. I will definitely find them for you.”</p><br/><p>“There’s really no need.” When she put it that way, Zhu Yao became a little embarrassed. “Didn’t you give me the Water Spirit? What else is more valuable than that?”</p><br/><p>Feng Yi pondered for a moment, and realized that was true! She no longer insisted, and kept everything back. She let out a sigh, however, the next moment, a smile rose. “You. You’re really strange.”</p><br/><p>“Aren’t you as strange as me?” Seeing that her expression had warmed up quite a bit, Zhu Yao’s guts suddenly fattened. “To tell you the truth, in the past, I hated you quite a bit.”</p><br/><p>Feng Yi looked at him with widened eyes, her expression looked somewhat depressed.</p><br/><p>Zhu Yao continued. “In the past, you would always show that prideful look, preventing anyone from coming close to you, as though everyone should exalt you. After I finally managed to crash into that secret hideout to save you, I didn’t expect to still be given the cold shoulder.” When she recalled what happened at the passage, she could not help but retort. Seeing her lowering her head in guilt, she then continued. “But after interacting with you for a long time, I found out that you’re actually not that bad. Deep in your heart, you’re still rather kind.” At the very least, she knew how to show her gratitude, otherwise, she would not have given her the Water Spirit, right?</p><br/><p>Only then did Feng Yi’s expression looked better than before. The hands she put on her thighs, began to tug on her skirt, as though she became a little nervous. After hesitating for a moment, she spoke up. “Then… What do you think… of the current me?”</p><br/><p>“Not bad.” Zhu Yao replied with a huge smile. “If you continue like this, we might even become…” Good girl friends.</p><br/><p>Before she could finish her words, a Sword Mountain disciple suddenly descended. Hugging his fist, he bowed before the two people, and said.</p><br/><p>“Grand-martial aunt, Elder Soi, the Sect Master had this disciple to inform the both of you of a meeting in the great hall.”</p><br/><p>“Meeting?” The corner of Zhu Yao’s lips twitched for a moment. That old man couldn’t be pushing a bunch of documents to her again, right? “What’s the issue?”</p><br/><p>The disciple replied. “Senior-martial uncle Xiao Yi has returned. Currently, he’s at the great hall.”</p><br/><p>Zhu Yao glanced at Feng Yi, and then nodded. Right after, they went towards the direction of the great hall in the Main Mountain together.</p><br/><p>It had been ten days since they returned to the Ancient Hill Sect. Back then, when Feng Yi tore through space, the exit was incidentally at the Lin Seas, which was very close to the sect. Hence, the three of them returned to the sect much earlier than Xiao Yi. However, although Yucang City was far from Ancient Hill Sect, if one rode his sword, at the very most, one could reach in seven days. He, however, spent a total of ten days to return.</p><br/>\n</div>"}