{"title": "Chapter 76: Crowd of Completely Unaware Onlookers", "id": 76, "volume": 1, "url": "http://boxnovel.org/my-disciple-died-yet-again-chapter-76-crowd-of-completely-unaware-onlookers", "volume_title": "Volume 1", "body": "<h1>Chapter 76: Crowd of Completely Unaware Onlookers</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 76: Crowd of Completely Unaware Onlookers</p><br/><p>Zhu Yao suddenly recalled the former Mystic Arts Rui Yu used, could it be that he had used the Practitioner-Pair Arts? Rui Yu was a Demigod, and was at an entire Realm higher than Xiao Yi, it was not impossible for the Practitioner-Pair Arts to cause Xiao Yi to rise in two levels consecutively.</p><br/><p>It was no wonder why he wanted to seize every opportunity to have *** with Rui Yu, to the point where he could even throw aside the mission to find his master. It seemed like he was not simply being controlled by his own bestial tendencies. Then, were his feelings for Rui Yu real, or fake?</p><br/><p>Zhu Yao could not derive an answer, and she momentarily felt a slight headache. She was really not good with things like reading one’s heart and motives, rather than thinking about these, she would rather solve magic squares.</p><br/><p>Just as she had Zi Dan change the final digit to a rune, a loud sound suddenly came from outside, a sixth-ranked demonic beast popped out of nowhere and pounced towards Xiao Yi and Rui Yu.</p><br/><p>A mere sixth-ranked beast was naturally unable to harm them, in a flash, the two of them had retreated three feet away. Rui Yu unleashed a wind blade, and that demonic beast was sliced into two.</p><br/><p>“Chen Zi, you’re finally willing to show yourself!” Rui Yu laughed coldly, as she looked towards the mass of black miasma up in the air.</p><br/><p>A skinny, bony-figured man appeared from the black miasma, on his dried-up facial skin, there were multiple faint black scars as well. He was actually Chen Zi.</p><br/><p>Zhu Yao recalled the moment at Ancient Hill Sect when he was conducting his abduction. Clearly, back then, he was not like this. In a span of just a few days, just how did he become like this?</p><br/><p>“What about Feng Yi? Where’s Feng Yi? Where did you people hide her?” Chen Zi’s pair of eyes popped out, his face was crazed, as he kept interrogating them.</p><br/><p>Rui Yu looked at his current state, a ruthless intent flashed in her eyes. “I had long told you before. That’s an incomplete set of Mystic Arts from the Ancient Devil Race, which corrodes the user’s body. How is a human practitioner able to practice it? Yet, so as to obtain that woman, you forced yourself to continue practicing it, and even acted against me! You deserve your current looks, which can neither be described to be that of a human’s or a devil’s.”</p><br/><p>“Shut up! Shut up!” Chen Zi became even more crazed, black miasma once again gathered in his hands, and instantly, another four demonic beasts were formed, as they attacked towards them.</p><br/><p>With Rui Yu and Xiao Yi taking two each, they once again dealt with the attacks easily.</p><br/><p>“Since you don’t like to hear these words, I shall continue saying them!” Rui Yu laughed coldly, ridiculing him without restraints. “Look at what you have currently become? Forget about Feng Yi, a mighty Sovereign of the cultivation world, even regular people will feel disgusted when they look at you.”</p><br/><p>“No, that won’t happen. Feng Yi will love me, she will!” Chen Zi had already turned completely insane. Grabbing onto his loose facial skin, suddenly, as though he had thought of something, he pulled out something from the side of his body, and muttered to himself. “I have this. It will definitely heal me, as long as I gather enough people, I will be able to create a body that will never ever corrode.”</p><br/><p>“Water Spirit!” Xiao Yi’s eyes brightened, he could not help but let out an exclamation, and a hint of ecstasy flashed past his face.</p><br/><p>Zhu Yao was able to discern it as well, because the moment he pulled out the Water Spirit, the Wood Spirit in her divine sense, woke up with a “Chick~”.</p><br/><p>“Hurry and tell me where she is. If neither of you tell me her location, I will kill both of you!” Chen Zi’s expression changed, circulating the black miasma around his body, it attacked towards them. Xiao Yi and Rui Yu dodged in the nick of time, when the ground made contact with the black miasma, in an instant, a large crater was corroded out, engulfing half of the underground city, black bubbles were even being emitted out from the crater.</p><br/><p>Zhu Yao was shocked as well. Earlier, she basically did not see him circulating any spiritual energy. Just what was that?</p><br/><p>Xiao Yi and Rui Yu had no choice but to fly up, and Chen Zi once again attacked them. Although he was merely a Nascent Soul Paragon, and his cultivation was far from being able to compare to that of Rui Yu’s, unknown if it was due to the overly strange Mystic Arts he was practicing in, Rui Yu was unable to hold a good advantage over him, especially that dense black miasma, which neither of them dared to approach.</p><br/><p>However, a Realm’s suppression was absolute. As time passed, Chen Zi revealed a state of fatigue, his breath had began to turn ragged as well. Waving his hand, he once again formed out dozens of demonic beasts to restrain the two’s advances. Retreating a short distance, he took out the Water Spirit, and circulated his spiritual energy, as he planned to recover the spiritual power he lost.</p><br/><p>Rui Yu saw through his intentions, with a cold expression, suddenly, she summoned countless of icicles, and sent them over. A large portion of them were blocked by the demonic beasts, yet, there was an extremely small ice blade which had bypassed them, which had coincidentally struck onto the Water Spirit in Chen Zi’s hands, and instantly, it froze the Water Spirit.</p><br/><p>A hint of a smile spilled from Rui Yu’s lips, retracting her hand, the Water Spirit instantly flew over towards her.</p><br/><p>“Return me my Water Spirit!” Chen Zi was in explosive rage, summoning his black miasma, he struck it directly towards the Water Spirit. The ice instantly melted, yet, the black miasma did not disperse from there, as it flew directly towards Rui Yu, and she had no choice but to retreat to dodge it.</p><br/><p>The Water Spirit fell from midair.</p><br/><p>Coincidentally, Zhu Yao had just solved the final magic square. The passage was too narrow, she was really worried that a mass of Chen Zi’s black miasma would have been thrown towards them, their group would have been exterminated. The most important thing is, little Water Spirit, here I come.</p><br/><p>Just when she was planning to head out, a figure suddenly flashed past from her side, and the Water Spirit which fell down, was caught by Feng Yi.</p><br/><p>Zhu Yao: “……”</p><br/><p>“Master!” Xiao Yi joyfully took a few steps closer.</p><br/><p>“Feng Yi… Feng Yi, you’re back.” Chen Zi was even more exhilarated, to the point where his drooping facial skin began to shake, as he infatuatedly looked at Feng Yi who was in the air.</p><br/><p>Feng Yi frowned tightly, she did not care about Xiao Yi, and simply looked coldly at the other person below who could no longer be reasoned with. In the next moment, the might of a Demigod was boundlessly released.</p><br/><p>Zhu Yao had just only left the passage, and then, she was pressed down the ground with a ‘pachi’ sound.</p><br/><p>The hell! Even if you’re exacting your revenge, don’t attack indiscriminately!</p><br/><p>Even Chen Zi was forced to kneel on the ground due to the mighty pressure, yet, as though he did not feel anything at all, he still looked at Feng Yi infatuatedly with his head raised. As he chanted out her name, he struggled to stand up, wanting to approach her.</p><br/><p>The killing intent on Feng Yi’s face became even stronger, as she said, with emphasis on every single word. “You. Deserve. To. Die!”</p><br/><p>“Feng Yi…” Yet, Chen Zi still looked at her, as though he had not heard her words, and he even revealed an extremely estranged smile.</p><br/><p>Feng Yi instantly summoned her willed sword, a crimson sword of light, with a swing of her hand, it ruthlessly flew straight towards Chen Zi.</p><br/><p>Chen Zi, however, did not retaliate, and he did not even dodge, simply allowing the sword to penetrate his chest. His estranged smile still hung on his face, and smile even began deeper. “This is fine as well. We can finally be together now, hahaha…”</p><br/><p>Flames strangely emitted out from his body, yet they were black flames, and his estranged laughter resounded everywhere in the air.</p><br/><p>At that instant, Zhu Yao had a bad premonition.</p><br/><p>The instant when Chen Zi was burnt to ashes from the black flames, the Water Spirit in Feng Yi’s hands, suddenly flashed with a black light. A gigantic black hole appeared behind her, and at the moment when everyone was unable to react to the sudden event, she was sucked into it.</p><br/><p>“Master!” Xiao Yi was greatly shocked, the hand he stretched out, however, caught empty air.</p><br/><p>The hell, my Water Spirit!</p><br/><p>“No!” Zhu Yao flew up, and with a pounce, she coincidentally grabbed onto Feng Yi’s hand… where the Water Spirit was.</p><br/><p>And then. They fell into it together!</p><br/><p>Feng Yi’s eyes were greatly widened, as she looked at him, unable to believe what she just saw.</p><br/><p>Just when she was about to say something, a big bulk of fats suddenly smashed her back, causing her to almost puke out blood.</p><br/><p>The hell, fatty, what are you doing?</p><br/><p>The moment they entered the black hole, a colossal might suddenly pressed towards them, and the three of them lost consciousness.</p><br/><p>In the recent few days, Yu Yan’s mood was a little bad. That stupid disciple of his, so as to find the Water Spirit, had decided to hide her identity to seek an opportunity. Although he could not relax, at the very least, she was still in his own Sect, so he was still able to look after her, hence, he allowed her to do what she wanted.</p><br/><p>However, in the starting few days, every day, his disciple had always found opportunities to report her situation to him, yet, suddenly, no reports had come in the recent days. For four consecutive days, he did not even see the shadow of his stupid disciple’s figure. This master was really angry, and the consequences were going to be very severe.</p><br/><p>After a careful consideration, he decided that to still have a celestial crane call for her. In the end, after the celestial crane quacked and circled around the Ancient Hill Sect, it flew back, and his disciple still did not appear.</p><br/><p>Yu Yan’s brows furrowed deeper, and finally could not help but release his divine sense. At that moment, Ancient Hill Sect’s entire scene entered his eyes, yet, he was still unable to discover his disciple’s presence.</p><br/><p>She was not in her house, not in Beast-Taming Mountain, nor was she in Ancient Hill Sect.</p><br/><p>Yu Yan felt his heart skip a beat. It seemed like… he had once again lost his disciple.</p><br/><p>As for Zhu Yao who had just woken up, she saw a complete grey view in front of her, and could not help but pound her chest and stamp her feet.</p><br/><p>She knew. She just knew that nothing good would ever happen when she followed that Xiao Yi. With his passive “All Partymates Will Die” buff, the life she was living was definitely that of a cannon fodder’s.</p><br/><p>So, was this time for Zhu Yao 4.0 to appear?</p><br/><p>“You’re awake?” A gentle female voice sounded from beside her, and her tone carried a hint of hesitation.</p><br/><p>Zhu Yao turned to look, and it was actually Feng Yi. It can’t be, party resurrection?</p><br/><p>No wait, Zhu Yao looked at her surroundings, and incidentally saw a big lump of meatball pressing strongly on her leg.</p><br/><p>Fatty!</p><br/><p>In that case, she did not die? In hindsight, Zhu Yao thought of this possibility. She was actually still alive, and both sorrow and joy intersected in that instant. She did not even know how she should react, it was too overly touching.</p><br/><p>“You… Why did you follow after me and jump into this place?” Feng Yi suddenly asked this question strangely as she looked straightly at Zhu Yao, as though the answer to this question of hers was very important to her.</p><br/><p>“Ah?” Zhu Yao turned her head back to face her.</p><br/><p>Feng Yi’s expression changed, as she continued to ask. “Both of us are not even related to each other, nor do we even have any form of friendship. Just why did you…”</p><br/><p>“If I don’t save you, could it be that I have to watch you die instead?” Zhu Yao rolled her eyes at her. Was there a need to ask a question like this? Obviously, her main goal was still the Water Spirit, saving her was just something she would do in passing.</p><br/><p>Feng Yi was speechless from his words. Her expression changed, and just when she was about to continue with her questions, Zi Dan suddenly woke up, the big-sized layers of fats momentarily shook a few times, and a head rose.</p><br/><p>“Little brother?” Zi Dan was startled. “Are you alright?”</p><br/><p>The corner of Zhu Yao’s lips twitched. “If you were to move away from my leg, I will be fine.”</p><br/><p>Her leg was about to be crushed, you know!</p><br/><p>Only then did Zi Dan realize that he had incidentally fell on her small leg. Smiling embarrassingly, he crawled up.</p><br/><p>“Little brother, do you know where we are?” Zi Dan was a little dumbfounded as he looked at the grey surroundings in front of him.</p><br/><p>Zhu Yao rubbed her numbed leg, shaking her head. “That Chen Zi must have done something to the Water Spirit, thus, we were transported here. No matter how much I think about it, this place isn’t anywhere good at all.”</p><br/><p>This place was completely barren, between the heaven and earth, it was completely grey. There was not even a single presence of life, that was why she misunderstood and thought that she had died another time, and had returned to the moment with the resurrection loading bar.</p><br/><p>“There’s no spiritual energy in this place.” Feng Yi spoke up.</p><br/><p>“What!?” Zi Dan was startled, his eyes were suddenly widened up. “How is that possible? How is it possible for a place without spiritual energy to exist in this world? There are only differences in the strength of spiritual energy, unless we have… Could it be!?”</p><br/><p>Zi Dan’s eyes were widened even more, his face showed utter disbelief.</p><br/><p>Feng Yi, however, nodded. His face instantly turned ashen.</p><br/><p>“Can you guys explain? Just what is this place?” There’s still a crowd of onlookers here who are completely unaware, hey.</p><br/>\n</div>"}