{"title": "Chapter 78: Hu Hansan has Returned", "id": 78, "volume": 1, "url": "http://boxnovel.org/my-disciple-died-yet-again-chapter-78-hu-hansan-has-returned", "volume_title": "Volume 1", "body": "<h1>Chapter 78: Hu Hansan has Returned</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 78: Hu Hansan has Returned</p><br/><p>The black hole this time, however, did not possess that irresistible pressure like last time. Seemingly, in a blink of an eye, they were standing on a beach, in front of them was a boundless ocean.</p><br/><p>The air was filled with spiritual energy, immediately, it allowed Zhu Yao to feel alive again.</p><br/><p>She, Hu Hansan¹, had returned.</p><br/><p>Feng Yi who had came out before them, was already meditating on the ground, recovering her spiritual energy.</p><br/><p>Zhu Yao, copying her, sat down to recover as well. Zi Dan was casting protection mystic arts at the side.</p><br/><p>Fifteen minutes later, the color on everyone’s face recovered a little.</p><br/><p>Feng Yi stood up, and looked at Zhu Yao. Clenching the fists at the side of her body, it seemed as though she was hesitating about something. Finally, she still walked over, retracting that prideful aura of hers. “Thank you very much… for saving me.”</p><br/><p>Seeing Feng Yi thanking her so seriously, Zhu Yao became a little embarrassed. “You’re welcome, I was on the orders by the Sect Master anyway.”</p><br/><p>“I still want to thank you.” Feng Yi looked at her straight in the eye. “If… If there’s something I can do for you, I will give it my all as well.”</p><br/><p>“Really?” Zhu Yao suddenly thought of something.</p><br/><p>Feng Yi nodded.</p><br/><p>“Then, give me the Water Spirit.” Although the Water Spirit was still in her divine sense, it was after all, still Feng Yi’s.</p><br/><p>Unexpectedly, Feng Yi did not even have the slightest of hesitation, rather, she replied with a slight smile. “If you want it, naturally, I won’t reject your request.”</p><br/><p>“Thank you!” Zhu Yao thanked her sincerely. She did not think that taking the Water Spirit this time would be so successful. She had even expected that she had to face a hard battle.</p><br/><p>After pondering deeply for a moment, she once again took the Water Spirit from the divine sense. Walking to the ocean in front, she placed the Water Spirit directly into the water.</p><br/><p>“Water Spirit, hurry and go. Return to the ocean.”</p><br/><p>The moment her words fell, the Water Spirit which was still obediently lying on her hand like a blue gem earlier, suddenly emitted out a blue light, turning into an actual water droplet, and instantly leapt up. Floating in the air, it seemed as though it was blinking its eyes, looking at her with a puzzled look.</p><br/><p>“Chick?” It let out a sound similar to the Wood Spirit.</p><br/><p>Zhu Yao laughed. She just knew that it was the same as the Wood Spirit, something that was capable of understanding a person’s words. It was just that this Water Spirit was quieter, and was not as lively as the Wood Spirit.</p><br/><p>“Return to the waters. No matter what, do not appear in front of people ever again.”</p><br/><p>Human greed could not be changed. Just like the Xiao Yi in her dreams, even though he was just a Metal and Wood Dual-Spirit Veins holder, normally speaking, he would only require two types. Yet, he actually wanted to have all five Spirits in his hands, and even when he ascended, he did not bear to let them go.</p><br/><p>Most probably, it would be the same for anyone else, it’s just that, the rest of the people did not have Xiao Yi’s fortunate encounter, hence, Xiao Yi was a BUG. Then, as long as the five Spirits exist, this world would have a BUG that could never be fixed. Only when people could never find the five Spirits, could the root of the problem be resolved.</p><br/><p>“Chick~” The Water Spirit was stunned for a moment. Suddenly, as though it had understood something, it bounced twice on the ground. It suddenly flew right towards her, “pachi”, kissed her,and then, sank into the ocean. Its figure could no longer be seen.</p><br/><p>“You… Why?” Feng Yi looked at her with a face of disbelief. She did not expect that the reason why he wanted the Water Spirit from her, was just to release it.</p><br/><p>“Little brother, why did you release the Water Spirit?” Zi Dan was dumbfounded as well.</p><br/><p>“Hoho, I’m not a Water Spirit Vein Holder, even if I have it, I have no need for it. I might as well release it.” Zhu Yao said without a mind.</p><br/><p>“Even if you’re not, that’s still a treasure that’s hard to come by. Not only did you release it, you even told it not to appear before people. You…”</p><br/><p>“To prevent others from using it for bad things.” Zhu Yao explained. “How do you think Chen Zi managed to practice such terrifyingly evil mystic arts? And how did he break the Ancient Hill Sect’s Great Mountain Barrier formation from the ocean? Most of all these were due to the Water Spirit.”</p><br/><p>“This… That’s true.”</p><br/><p>Feng Yi moved her lips, as though she wanted to say something. In the end, she still simply sighed. “You… you’re really an idiot.” After saying that, the smile formed from the corner of her lips deepened.</p><br/><p>Zhu Yao suddenly trembled uncomfortably. Shaking her head, she shook off that strange feeling.</p><br/><p>“Hahahaha, little brother, you’re really broad-minded!” Zi Dan gave a word of praise, slapping her back out of habit.</p><br/><p>She suddenly felt a stir in her chest, and with a splat, she spat out blood on his entire face.</p><br/><p>“What happened to you?” Feng Yi was the very first to react, hurriedly grabbing onto her, who was wobbling. Her face was no longer calm, and even the hand she was using to inspect Zhu Yao was trembling a little. “Why aren’t you restoring your spiritual energy?” After an inspection, his body still did not even possess a single strand of spiritual energy. Adding that they were chased by the crowd of demonic beasts earlier, and he had even mended her meridians, he had already suffered a very huge mystic power rebound.</p><br/><p>“Heheh, it seems like I’m unable to restore my spiritual energy.”</p><br/><p>Feng Yi and Zi Dan was stunned, and they did not know how to help her either. They had never heard of people being unable to restore their spiritual energy after suffering from a mystic power rebound.</p><br/><p>For a moment, the two of them were at a loss.</p><br/><p>Feng Yi was a little flustered, as she kept transferring her own wood spiritual energy over, yet, they dispersed the moment the spiritual energy entered her body. “What to do? We must hurry and restore your spiritual energy!”</p><br/><p>Zhu Yao’s hand was turning purple from being grabbed by her so tightly.</p><br/><p>She was a Lightning Spirit Vein Holder, wood spiritual energy was completely useless to her!</p><br/><p>It was not that she did not want to restore them, it was just that she did not dare to casually take in spiritual energy into her body. If she was careless, she might bring about another spiritual energy turbulence.</p><br/><p>Hence, she could only wait for her spiritual energy to restore by itself. Back then she was just at Foundation-stage, it was still alright, as the amount of spiritual energy in her body then was not huge, and could be recovered after good night sleep. After that, when she was at the Azoth-stage, she had to spend ten days. Now…</p><br/><p>It seemed like without a few months, it’s impossible to be restored.</p><br/><p>She really missed her master… who had the purple lightning bolts!</p><br/><p>As though he had heard her summons, after Zhu Yao spat out her third mouthful of blood, a familiar figure descended from the sky. He was dressed entirely in white, with a face that was as cold as ice, his two eyes stared right at that person who was currently puking out blood.</p><br/><p>“Senior-martial uncle Yu Yan.” Feng Yi was stunned, before she could even react, with a wave of his hand, the youth in her embrace had already flew into his hands. And then, without even saying a single word, he turned and flew off.</p><br/><p>Leaving the two people on the ground who was still completely unable to understand the situation.</p><br/><p>“Why did ancestral-grand master…” Zi Dan froze, and then, a glint appeared in his eyes, as he made a guess. “Could it be that he has a way to save little brother?”</p><br/><p>A hint of joy flashed past Feng Yi’s face as well. If it was that person, then there’s definitely a way.</p><br/><p>“Many thanks to ancestral-grand master for lending a hand!” Zi Dan happily charged towards the direction of where the person disappeared to, and shouted.</p><br/><p>And currently, a certain master was currently fuming with anger. Looking at his stupid disciple who was still puking out blood while in his embrace, he could not wait to immediately teach a ruthless lesson. The moment he let his eyes off of her, she actually wrecked her own body to such an unbearable state. Was there ever a disciple like this?</p><br/><p>“Masteeer…” Zhu Yao felt like she was about to cry. Earlier, no matter how hard or tiring it was, she did not really feel anything, but, the moment she saw him, she suddenly felt very troubled. Hugging his neck, she buried her head in his embrace. “Master… It hurts a lot.”</p><br/><p>A certain master turned his head, casting a glance at her, he coldly said. “Bear with it!”</p><br/><p>“……”</p><br/><p>Could she still happily fool around?</p><br/><p>Recently, Zi Mo was a little troubled. As someone who took up the job of the Ancient Hill Sect’s Sect Master, Zi Mo expressed that it was hard being a parent. He had to intervene in no matter how big or small the miscellaneous stuffs were, when nothing was happening, he had to even mediate between the various Sects, and there were also problems such as member allocation. Let’s just talk about the new elder who had just joined not long ago, if not for his sharp, glowing eyes, which discovered his abnormal relationship, a relationship which could not be known to the world, with his ancestral-grand master, he might have really taken him as just another random elder.</p><br/><p>However, this person was not just anyone. Since ancestral-grand master had left this person to him, it meant that ancestral-grand master believed in his abilities. He definitely could not fail his ancestral-grand master’s expectations. Hence, he arranged him to the Beast-Taming Mountain, which he was specialized in. So that he could gain a larger reputation, he even assigned him the glorious mission of saving the Sovereign.</p><br/><p>As expected, they successfully rescued the Sovereign, and the Sovereign had great praises for him as well. Although he suffered a few small injuries, all these could be overlooked. The most important thing was, from this incident, his reputation in the Sect rose greatly, and he had swiftly, and smoothly, integrated into this big group. Praises for him could be heard from everywhere he went. Zi Mo felt that his plan had worked, ancestral-grand master would definitely realize his diligence, and then, appreciate him much more than before. If he was fortunate, ancestral-grand master might even throw him one or two treasures, and just by the thought of this, he could not help but be a little excited!</p><br/><p>Zi Mo thought merrily, and just when he was planning to rest, a white figure, appeared soundlessly in front of his bed just like that. An ice-cold face was currently staring coldly at him. Zi Mo shivered, and he almost rolled down his bed.</p><br/><p>“An- An- An- An- An… Ancestral-grand master!” His expression was not of Zi Mo’s expectations.</p><br/><p>Yu Yan had a little bad temper recently as well, he carelessly took in a disciple who was a bundle of worry, worrying him to death. Not only did he have to take precautions to prevent her from courting death every day, he had to even take precautions to prevent others from sending her to court death.</p><br/><p>His disciple loved to head outside in the past, and he could forget about that, however, this time, he simply placed her in the Sect. It was right by his home, yet, she’s actually able to return in a half-dead state as well. He basically could not take any absolute precautions at all, and the culprit was actually Sect Master Zi Mo who had always been very prudent.</p><br/><p>Yu Yan felt that this was something he could not tolerate. Zi Mo had a bunch of disciples he could trouble, so why did he have to bring trouble to his one and only disciple? Hence, after treating his disciple’s injuries, Yu Yan immediately crashed into Zi Mo’s house to condemn him. However, after arriving at his destination, he recalled that this time, his disciple was hiding her identity. Zi Mo was basically not in the know at all, and he had simply treated her as a regular elder. For a moment, he had no reason to condemn him for, yet, his heart was filled with irritation.</p><br/><p>Hence, without speaking a single word, while releasing a huge amount of killing intent, he could only stare at him… stare at him… at him… him!</p><br/><p>Zi Mo who was having merry thoughts earlier, was drenched in cold sweat by the stare, yet, he still could not understand what he did wrong. As the one who managed an entire Sect, Zi Mo could be considered as someone who was used to a large crowd. However, after being stared at by someone who was pouring out killing intent for an entire hour, he would still be frightened to a certain extent, his legs even began to turn jelly.</p><br/><p>Just when he planned to risk his life to ask what his ancestral-grand master was up to, just like how he had appeared, Yu Yan once again disappeared in an instant.</p><br/><p>Zi Mo: “…”</p><br/><p>Although he did not understand why ancestral-grand master was here for, Zi Mo heaved a deep sigh of relief, and he had a feeling as though his life was saved. Unfortunately, he celebrated too early, because on the second day, Yu Yan once again appeared in his room.</p><br/><p>Like before, without saying a single word, he stared at Zi Mo for an hour, and then, left without making a sound.</p><br/><p>And so, again, came the third day. Zi Mo was about to go crazy.</p><br/><p>Ancestral-grand master, just what did I do wrong? Just say it. I can change, alright?</p><br/><p>¹’I, Hu Hansan, has returned.’ is a quote that came from a Chinese TV Drama.</p><br/>\n</div>"}