{"title": "Chapter 72: Three Heads, Four Heads, are Better than One", "id": 72, "volume": 1, "url": "http://boxnovel.org/my-disciple-died-yet-again-chapter-72-three-heads-four-heads-are-better-than-one", "volume_title": "Volume 1", "body": "<h1>Chapter 72: Three Heads, Four Heads, are Better than One</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 72: Three Heads, Four Heads, are Better than One</p><br/><p>Zhu Yao had never felt so grateful for Xiao Yi’s protagonist cheat. Thinking back to the queen’s earlier reaction, there should be completely no danger at all in regards to his life, and he might even be able to help his squad mates.</p><br/><p>To actually even mesmerize a Demigod-stage female practitioner, Xiao Yi, as expected, was using his entire life to flirt, huh.</p><br/><p>A specialized piggish teammate could actually be of use as well, the world was changing too quickly, and she wished to calm down while nibbling on a packet of spicy gluten, if her jaw was fine.</p><br/><p>In the next two days, Zhu Yao and Zi Dan spent their time especially calmly, and there were no longer any guards bringing them out to view a live version of an R18 movie. Although it hurt a lot, she still successfully connected back her jaw.</p><br/><p>Just when they thought that they were about to be forgotten by the queen, the queen loftily appeared. This time, she no longer wore those types of see-through light veils, rather, she was wearing regular clothes. Although she still looked flirtatious, at the very least, she was wearing shoes.</p><br/><p>The queen coldly looked at the two people in the prison cell, and lazily spoke. “Initially, I had wanted to kill you two to prevent getting eyesores, but he said that you two were his senior martial brothers. Although I hate the relationship of martial brothers and sisters the most, since I promised him to let you two go, then I will give you two a chance to live.”</p><br/><p>With a wave of Rui Yu’s hands, the restriction placed on the door disappeared. “Why aren’t you two hurrying out?”</p><br/><p>Seeing the two of them walking out, Rui Yu cast an art, and their sealed mystic powers instantly began to flow again. The first thing Zhu Yao did, was to cast a recovery mystic art on her jaw, soothing the pain she felt for two days because of the forced connection of her jaw.</p><br/><p>Rui Yu threw a pair of scornful eyes at Zhu Yao for her actions. A big man was actually afraid of such a little pain.</p><br/><p>Zhu Yao curled her lips without minding about it. She had experienced things that were even more painful, but she was unable to bear the pain for two days, after all.</p><br/><p>“Let’s go. He wishes to see you two.” Rui Yu once again stared at her, before turning and walking outside.</p><br/><p>Out of the three, only Zi Dan’s face was still at a loss. Zhu Yao, however, knew that the person she was going to meet was definitely Xiao Yi.</p><br/><p>They arrived at a flower garden, and Xiao Yi was standing by the pond, neatly dressed, while on the other hand, the two of them were covered in blood, and looked fatigued.</p><br/><p>“Senior martial brothers.” Xiao Yi walked over. Rui Yu, however, moved towards him, instantly held onto Xiao Yi’s hands, and provokingly looked at two people in front of her.</p><br/><p>“Little brother Xiao Yi, what is this you’re…” Zi Dan frowned, and looked at the two of them back and forth. His expression was full of disagreement. Could it be that Xiao Yi wanted to associate with a heretic practitioner?</p><br/><p>A hint of discomfort flashed passed Xiao Yi’s face. He explained to them the things that happened back then, and the contents were actually all about how Rui Yu’s life was so pitiful. She basically had no other choice but to turn into a heretic practitioner, and after his persuasion, she already had the heart to repent. He hoped that the two of them could put down their prejudice, and forgive her for what she had been forced to do.</p><br/><p>Zhu Yao was shocked, so back then, he was not acting. The words Xiao Yi had said back that in the room, were all his true feelings, and were not something he thought on a whim. In other words, he had really struck onto the pitiful heart of this heretic practitioner who specialized in absorbing the essence of men.</p><br/><p>Zi Dan was completely dumbfounded from what he heard as well, and after hearing the entire thing, his face had turned as black as the depth of a pot.</p><br/><p>Although Zi Dan was a happy-go-lucky fatty, who usually did not have any temperament issues and was someone anyone could strike a chord with, he was still a Lord of a Mountain, one of the backbones of Ancient Hill Sect. Living and growing under the red flag, his roots were in the Deity Sect, and was a genuine hard-line deity practitioner. The way Xiao Yi put it, he basically wanted Zi Dan to betray his Deity Sect.</p><br/><p>The color of Zi Dan’s face turned from black to purple, and on his fat and plump hands, even his veins were about to explode out. Just when he was about to rush up towards him and have a standoff, Zhu Yao hurriedly stopped him.</p><br/><p>“Senior martial brother, don’t forget the reason why we’re here.”</p><br/><p>Zi Dan looked at her in the eye, and only then was he able to suppress the storm in his eyes. He turned around and no longer looked at Xiao Yi.</p><br/><p>Seeing that the two people did not resist, Rui Yu snorted coldly. “Hmph, at least you two are tactful.”</p><br/><p>The veins on Zi Dan’s hands once again rose up.</p><br/><p>Zhu Yao, however, had already gotten used to it. When Xiao Yi was ten, she had already known of the problem with the kid’s three views. However, when he said such flowery words, Zhu Yao was indeed still a little shocked. No matter how pitiful Rui Yu’s life was, no matter how forced she was to make that decision, it was still the truth that she had cultivated using the essence of men. Now that she had raised herself to a Demigod, behind her, just how many bones had been accumulated? With just a single ‘she was forced to do so’, how could her past be cancelled out?</p><br/><p>Her life was pitiful, however, the number of people in the world that were as pitiful were like the number of strands of hair on a cow. If every one of them was like her, then what would the world have become? As the saying goes, life was given by the heavens, however, the path one takes is set by oneself. People that live in the heavens, can walk the life of a devil, while people that live hell, can live in the extravagance of the heavens as well. One’s decision has always been in one’s hands, the so-called ‘forced to do so’, is just an excuse to fall into despair.</p><br/><p>“We can discuss this matter another time.” Zhu Yao said. “Have you found a way to save your master?” She did not care about him flirting with girls, as long as he still remembered his own master, then that would be fine.</p><br/><p>Xiao Yi was startled, and only then did he realize that he had actually placed Rui Yu’s matter at the top of his mind, and had forgotten about his own master. His face surfaced several traces of guilt. Then, he replied. “The territory of Yucang City is too vast, this matter about locating her, I’m afraid there’s a need to look at it from a long-term perspective.”</p><br/><p>“There’s no need to look at it from a long-term perspective.” Zhu Yao waved her hand. “We don’t have that much time, though, I have a plan that we can try.”</p><br/><p>There were too many people in Yucang City, and if they were to investigate them one by one, their investigation would take forever. And since Chen Zi dared to come in, then he must have a way to prevent being discovered, otherwise, he would not have fearlessly killed people in the city.</p><br/><p>Zhu Yao’s method was very simple. Since there were too many people, then, would it not be fine if they were to just let them out? Of course, not all of them would exit the city, rather, all of the heretic practitioners who possess the Wood Spirit Vein. Feng Yi was a Wood Heavenly Spirit Vein holder, so her body would definitely be entirely filled with wood spiritual energy. Under the situation where there are no Wood Spirit Veins in the entire city, she would have the Wood Spirit sense which area where the wood spiritual energy was the most concentrated at, and Feng Yi would be there.</p><br/><p>Of course, the fact that she possessed the Wood Spirit was something she could not tell them, hence, the person who could sense such a thing, would be her, who similarly possessed the Wood Heavenly Spirit Vein as well.</p><br/><p>This was also the best plan she could think of in these two days.</p><br/><p>When Zhu Yao finished describing her plan, Xiao Yi and Zi Dan felt that this method could work as well.</p><br/><p>Although Rui Yu was a little unwilling, she still issued down the order as the city lord on Xiao Yi’s behalf, and had all of the people in the city with the Wood Spirit Veins to leave the city, preventing them from entering within the next three days.</p><br/><p>In just a single afternoon, there were not even a single heretic practitioner with the Wood Spirit Vein left in the city.</p><br/><p>Zhu Yao sat in the lotus position, and gave a look as though she was sensing the wood spiritual energy, but actually, she was entering her divine sense.</p><br/><p>“Wood Spirit, try sensing it again. How many places in the city are there that possess wood spiritual energy?”</p><br/><p>“Chick~” The Wood Spirit tilted its head, pondered for a moment, and then, obediently stretched a vine. “Chick!”</p><br/><p>This was the method of communication they decided upon earlier. A single vine meant one.</p><br/><p>“Very good. Now, tell me, which direction is it?”</p><br/><p>“Chick~” The vine speedily turned into an arrow, and pointed to the left, which was the western direction.</p><br/><p>“Good job!”</p><br/><p>Zhu Yao praised it, and only then did she open her eyes, and tell her squad mates in front of her who were waiting for the news.</p><br/><p>“It’s in the western direction.”</p><br/><p>Xiao Yi and Zi Dan looked at each other in the eye, and then, one summoning out a mystic tool, while the other summoned a spiritual beast, the two of them headed outside the door. Naturally, Zhu Yao followed after them as well, and they flew towards the western part of the city.</p><br/><p>As Zhu Yao communicated with the Wood Spirit, she leaded the way, and a moment later, they arrived at an especially worn-down house.</p><br/><p>This had to be the secluded area within the city. There was not even a single person in the vicinity, and inside the house with two rooms, they were actually as empty.</p><br/><p>“This is the place you sensed.” Unknown to when it happened, Rui Yu had followed after them, and she coldly smiled at Zhu Yao.</p><br/><p>Xiao Yi frowned. “Why did you follow us?”</p><br/><p>Rui Yu looked at him in the eye, and said with a flighty tone. “Obviously, I’m worried about you.”</p><br/><p>Xiao Yi did not reply. Looking at his expression, he seemed to enjoy it a little.</p><br/><p>Zhu Yao silently rolled her eyes, pulled onto Zi Dan at the side who was about to explode, took a step back, and had a small chat with him. After all, Xiao Yi did save them, and no matter how he disagreed with the entire thing, it was not their place to speak up.</p><br/><p>“I have indeed sensed a dense amount of wood spiritual energy in this direction.” Little Wood Spirit basically did not develop the ability to lie. The direction it pointed to naturally could not be wrong.</p><br/><p>Zi Dan rubbed his head, and said a little anxiously. “Little brother. We can see everything here with just a glance, let alone inside this house. Even in a radius of several kilometers from here, there’s no human presence at all either.”</p><br/><p>Zhu Yao once again entered the house to take a look, and then, right after, went to the next room to take a look.</p><br/><p>“Don’t you people feel that…” Zhu Yao pointed to this house. “There’s a little problem with the structures of the two rooms?”</p><br/><p>Two rooms, and the space each of them had was not even fifteen square meters, however, the entire house took up nearly forty square meters of land. An estimate of at least five square meters of spare had disappeared.</p><br/><p>“You’re saying…” Zi Dan’s eyes sparkled, and after making eye contact with Xiao Yi, they reacted at the same time.</p><br/><p>Flying to the top of the roof together, they removed a large pile of roof tiles at the center, and then, joy was expressed on their faces at the same time. “There’s another room in the middle!”</p><br/><p>Rui Yu retracted her ridiculing expression as well, and with a wave of her hand, she summoned a huge gust of wind, instantly removing the entire roof. With the two on the roof, they leapt into the room in the middle that did not have a door.</p><br/><p>Zhu Yao flew and followed after them as well.</p><br/><p>“Little brother, you’re really good. You actually managed to even discover something like this.” Zi Dan patted on her shoulder and praised.</p><br/><p>Zhu Yao jolted from the patting of his big fat talon, and immediately stood further away. Could she say that it’s experience from looking at modern-day houses?</p><br/><p>In the modern age, it was extremely difficult to buy a house, and there were even black-hearted pioneers who often cut down on the sizes of rooms. All of these were something she had trained from her experience.</p><br/><p>“So what if he discovered a hidden room?” Rui Yu continued to activate her ridicule skill. “In the end, it’s still as empty, with not a single thing lying around.”</p><br/><p>Zhu Yao inspected the surroundings, and indeed, it was still an empty room. Compared to those worn-down rooms outside, other than being filled with dust, there was not even a trace of wear in the room, as though no one had ever entered this place before.</p><br/><p>She walked along the corners of the room, and did not discover anything, however, she could faintly feel there was something knocking under her feet. Dusting away the floor, she found out the floor was actually a stone floor, and there was even something engraved on it.</p><br/><p>“There’s something on the ground.”</p><br/><p>When Rui Yu heard this, she immediately did hand-seals with her two hands, casting out a large-range wind mystic art. Instantly, a huge wind blew in the vicinity, and the walls were instantly blown away as well. When the wind stopped, the initial small house with three rooms, was only left with the floor.</p><br/><p>Did you have a grudge with the house or something? Have you ever considered the feelings of people who can never earn enough to buy a house in their lifetime?</p><br/><p>“What’s engraved here?” Xiao Yi asked.</p><br/><p>When the dusts were blown away, the thing engraved on the floor was revealed. There were nine engraved pieces, and they were neatly arranged. The pictures were different from each other, and they were not any form of symbols, nor was it a formation, and, they had never seen them before.</p><br/><p>Rui Yu, Zi Dan and Xiao Yi stared at them for a long while, yet, none of them was able to see what in the world was engraved on the ground.</p><br/>\n</div>"}