{"title": "Chapter 88: Where Did this Little Junior-Martial Sister Come From?", "id": 88, "volume": 1, "url": "http://boxnovel.org/my-disciple-died-yet-again-chapter-88-where-did-this-little-junior-martial-sister-come-from", "volume_title": "Volume 1", "body": "<h1>Chapter 88: Where Did this Little Junior-Martial Sister Come From?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 88: Where Did this Little Junior-Martial Sister Come From?</p><br/><p>“Lord, Zi Mo’s disciple is…”</p><br/><p>When Sesame was about to speak up, Yu Yan stared coldly at him, and it instantly swallowed back its words.</p><br/><p>Yu Yan reached out his hand to pat on her long figure, and sighed. “It’s fine… this way.”</p><br/><p>Zhu Yao was startled. What did he mean? Speak clearly, hey.</p><br/><p>Just when she was about to ask for a clarification, right after the cawing at the Main Mountain, the continuous cries of various demonic beasts sounded from the entire Ancient Hill Sect. Even some of the celestial cranes in Jade Forest Mountain were emitting that same sorrowful cry.</p><br/><p>She wondered if it was because she had turned to a beast as well, as the depths of her heart began to feel stifling. And, it was even worsening, it was hurting so much she could not even let out her voice. Yet, she completely could not think of the reason why she was feeling this way.</p><br/><p>Really? What’s wrong with her?</p><br/><p>This feeling lasted for an entire day, and she simply sat on the stone table in her master’s courtyard, hearing the cries of the various demonic beasts for an entire day. And she only managed to regain her senses when the sun set.</p><br/><p>When Zhu Yao regained her senses, she wondered if it was because she did not take her medicine, as she actually sat like this for an entire day. Her master seemed to have left quite some time ago, and even Sesame had disappeared.</p><br/><p>Zhu Yao silently retorted this master of hers, who had a secret crush on her, but was completely oblivious of it. He actually left her (it) there just like that, it was no wonder he was still single after ten thousand years. After pondering for a moment, she decided to return to the house and wait for her master. First, she had to restore her human form.</p><br/><p>Sesame said she was currently a Demigod, so she was equal to a tenth-ranked demonic beast. The race of dragons had already disappeared from the world for a very long time, so she was unclear if they had an innate transformation ability, but tenth-ranked demonic beasts were all capable of transforming.</p><br/><p>Just as she crawled up from the table, she saw a little head suddenly popping out from the bushes outside the courtyard. She was looking around, as though she was looking for something. Wearing a small white coat, from the looks of it, she seemed to be a four or five year old little brat.</p><br/><p>Zhu Yao felt it was a little strange. It was very rare for Jade Forest Mountain to have outsiders, and even if the Sect Master had some matters for Yu Yan, he would only dispatch inner chamber disciples to send the message. Just where did this little pudding come from? And looking at how she was being so sneaky, evidently, she did not have any experience in doing bad things. Otherwise, why would she be wearing white in the middle of the night? Wasn’t she clearly telling others that she was hiding there?</p><br/><p>At this moment, the little devil in Zhu Yao’s heart had raised its trident, and with a leap, she flew.</p><br/><p>That’s right, she had just remembered that dragons could fly.</p><br/><p>Flying back to the house, she lighted up the oil lamp, before flying towards that little pudding.</p><br/><p>“Brat!”</p><br/><p>The child who had just crawled out from the bushes, was startled by her. She instantly stuffed her little head back into the bushes, and her little figure began to tremble.</p><br/><p>“Bao Bao admits her mistake, Grandmaster, please do not punish me.”</p><br/><p>“…” She had yet to say anything, was it really alright for her to be frightened to this extent? Zhu Yao’s heart instantly softened a little, and she no longer held the intention to scare her.</p><br/><p>“Little friend, it’s already so late in the night. Why did you run to this Jade Forest Mountain for?”</p><br/><p>The little buttocks that were exposed outside moved, after twisting about a few times, she once again popped her head out. After looking around, she realized a long snake-like creature was currently floating and coiling around above the oil lamp in front of her. At that moment, she heaved a sigh of relief. “So it wasn’t him. You scared me. Little worm, are you a demonic beast?”</p><br/><p>You’re the little worm, your entire family is made up of little worms!</p><br/><p>“Little friend. Why are you here in Jade Forest Mountain? What are you here for?”</p><br/><p>“I will be living here sooner or later anyway.” The little girl tilted her head, and said while blinking her eyes.</p><br/><p>At that moment, Zhu Yao felt her heart going “badump”. “Where do you live? Here?”</p><br/><p>“I live there!” The little girl pointed to the straw cottage at the other side, but after pondering for a moment, she added. “But father and mother said that I’m still young, and forbid me from living there. When I’m older, I’ll be living there every day.”</p><br/><p>“Little friend, it’s bad to tell lies, you know.” That straw cottage was clearly her own residence, alright?</p><br/><p>“Bao Bao has never told lies.” The little girl instantly made a goldfish-face, as she protested angrily. “I’m really living over there.”</p><br/><p>Zhu Yao’s expression sank, as a guess surfaced in the depths of her heart. And she did not like this guess at all.</p><br/><p>“Little friend, you can’t be a disciple of Jade Forest Mountain, right?”</p><br/><p>“That’s right!” The little girl nodded her head strongly.</p><br/><p>Zhu Yao, however, felt extremely uncomfortable, as she felt her heart began to ache. So her master had taken in another disciple, and it was not her, but another person.</p><br/><p>Master, you can’t be a lolicon, right?</p><br/><p>After pondering for a moment, she became very sure of this thought. For someone as incredible as her master, how could he just take in a single disciple? Look at the rest of the Mountain Lords, just counting the inner chamber disciples alone, there were dozens of them. Even the three Demigod Sovereigns had taken in a couple of disciples when they were at the Nascent Soul stage. It’s just that they had simply fallen much earlier.</p><br/><p>It was completely understandable for her master to take in another disciple.</p><br/><p>However, even though this was understandable, why was she feeling so irritated by it? Understanding it was one thing, but accepting it was another matter.</p><br/><p>“When did your master take you in as a disciple?” Zhu Yao asked.</p><br/><p>The little girl was startled, and then, she lowered her head and began to count using her fingers. “One day… Two days… Three days… It’s been many days.”</p><br/><p>Zhu Yao sighed, and at that moment, she no longer have the mood to tease her. “Oh well, I will send you back then. In a few days, I will introduce your senior-martial sister to you.” She had to change back to her human form first.</p><br/><p>“Senior-martial sister?” The little girl was dumbfounded for a moment. Suddenly, her eyes reddened, and she looked at Zhu Yao with an accusing look. “You liar. My father said this before, that master only has a single disciple, and that’s me. I’m the only one. Bao Bao doesn’t have other senior-martial sisters. You’re a bad person!”</p><br/><p>Zhu Yao’s expression darkened. Little brat, don’t go overboard, I’m already giving you half of my master, why are you crying? I’m the one who wants to cry!</p><br/><p>“I’m not lying to you, you indeed have a senior-martial sister.” It was her.</p><br/><p>“Wuuuuu…” The little girl finally could not hold it in any longer, and water beads began to fall, as she stared ruthlessly at Zhu Yao. “I don’t care, master only needs me as a disciple! When master comes back, I will tell master, that I don’t want a senior-martial sister! I don’t want one!”</p><br/><p>After saying that, she kicked her feet off the ground, and ran. Sprinkling little beads of water along the way.</p><br/><p>Zhu Yao: “…”</p><br/><p>Momma’s egg, she really did not want a junior-martial sister now.</p><br/><p>Zhu Yao’s heart was boiling with rage, this sudden appearance of a little junior-martial sister made her feel like scratching her master’s ice-cold face. She hadn’t been here for just a few days, and her master had already brought back a little junior-martial sister. Didn’t he know that in every novel’s settings, little junior-martial sisters were always used to develop adultery plot lines?</p><br/><p>She didn’t want to be someone else’s senior-martial sister, she simply wished to become someone else’s master-aunt, dammit!</p><br/><p>Oh right, wasn’t there still this master-aunt setting?</p><br/><p>Zhu Yao instantly found a bit of consolation. Lowing her head, she once again looked at that long body of hers, and suddenly, all her anger dampened.</p><br/><p>On the morning of the second day, the moment Yu Yan returned to the house, he was pestered by his stupid disciple.</p><br/><p>“Master, I want to restore my human form, I want to restore my human form! Roar~~ ┗|｀o′|┛”</p><br/><p>Yu Yan lifted his hand, and made it convenient for his stupid disciple to crawl onto his shoulder.</p><br/><p>“Your current situation is unclear, it’s inappropriate for you to restore your spiritual energy too quickly.”</p><br/><p>“If I’m slow, it will be too late.” Zhu Yao glanced at him with an inconvenienced look. Who could be sure that he wouldn’t bring back a few more little junior-martial sisters, or little, little junior-martial sisters, or even little, little, little junior martial sisters.</p><br/><p>“Actually, it’s possible for Lord to restore your spiritual energy now.” Sesame suddenly popped out, shrank itself to about Zhu Yao’s size, and looked at the dragon-formed Zhu Yao with sparkling eyes. With a single leap, it jumped onto the stone table. Then, it bounced about, as though it was trying to crawl onto Yu Yan’s shoulder as well, in order to approach Zhu Yao. However, with a single stare by Yu Yan, it was stopped from doing so.</p><br/><p>“What do you mean?” Zhu Yao asked.</p><br/><p>“Lord is of the dragon-race.” Sesame said with an envious look. “The bodies of dragons are innately strong and sturdy, and even if a problem were to occur during the advancement process, their bodies can completely endure it.”</p><br/><p>So the dragon-race had such a benefit as well. Zhu Yao instantly looked at her master with sparkling eyes.</p><br/><p>Help me, help me, help me!</p><br/><p>Yu Yan sighed. After pondering for a moment, he agreed. Bringing his disciple back to the bottom of the cold training lake, he renewed the reinforcement of the formation under the lake, casually threw Sesame out, and then, took out a few purple lightning bolts.</p><br/><p>“You can first try absorbing a part of the lightning spiritual energy. If you experience any anomaly, do not force yourself.”</p><br/><p>Zhu Yao nodded, closed her eyes, and began sensing the lightning spiritual energy. The moment she willed it, she felt a warm streamflow passing through the depths of her heart. There was now an additional strand of familiar spiritual energy, however, the amount of spiritual energy was pitifully small. It had only stayed in the Dantian for a short while, before disappearing completely.</p><br/><p>While that purple lightning bolt which her master had taken out, had already disappeared.</p><br/><p>“Master, the spiritual energy, disappeared.” Zhu Yao a little stunned. Dumbfoundedly, she raised her head. This sort of situation had never happened before, in the past, when she absorbed spiritual energy, they would always stay inside her body. However, the moment she absorbed them this time, they actually disappeared in a flash.</p><br/><p>Yu Yan frowned. “Your Dantian is unable to store spiritual energy?”</p><br/><p>Zhu Yao nodded.</p><br/><p>Yu Yan’s expression instantly turned exceptionally ugly. If her Dantian could not store spiritual energy, it was clearly a sign where her Spiritual Vein was destroyed. However, she could clearly still absorb the lightning spiritual energy, and her cultivation was at the Demigod-stage as well. So, why?</p><br/><p>“Other than not being able to store spiritual energy, are there any anomalies with your body?”</p><br/><p>Zhu Yao focused and sensed for a moment. “No!” Other than being a little hungry, there was no other problem she was aware of.</p><br/><p>“Try again!” Yu Yan said.</p><br/><p>Zhu Yao obediently closed her eyes again. The bolt of lightning outside, was instantly absorbed by her. However, just like before, the moment that strand of spiritual energy entered her body, it instantly disappeared without a trace. Zhu Yao felt like crying. Could it be that she had to be a finger-sized dragon her entire life?</p><br/><p>“What to do?”</p><br/><p>Yu Yan was unable to come up with the reason as well. In the beginning, he was worried that, since she had just entered the Demigod-stage, if she was unable to stop taking in spiritual energy, it might bring about a spiritual energy outbreak. It was better this way, she wasn’t even able to store her spiritual energy, let alone cause a spiritual energy outbreak.</p><br/><p>“Let’s return first.” Yu Yan opened his palm, hinting her to crawl onto his own palm. “Your master will think of another way.”</p><br/><p>Zhu Yao glanced at his palm, she didn’t why, but she once again recalled that little junior-martial sister she saw last night, and the depth of her heart was flooded with sorrow. Currently, she did not have a human form, and there wasn’t hope for her to restore her cultivation either. As expected, it would save some worry for her master if he were to look for another disciple.</p><br/><p>She knew that she was partly the blame for it, but she just could not control herself. She needed to calm down for a while.</p><br/><p>Hence, she did not climb onto his palm, instead, she turned her head away and moved her claws to the side, as she began to crawl back the route they came from on her own.</p><br/><p>Yu Yan was startled for a moment. He did not say anything, and silently followed her at the back.</p><br/><p>The further Zhu Yao crawled, the sadder she became. Probably because her mood was terrible recently in the first place, at this moment, she was especially sad.</p><br/>\n</div>"}