{"title": "Chapter 82: Disciple, Come, Let’s do an Experiment", "id": 82, "volume": 1, "url": "http://boxnovel.org/my-disciple-died-yet-again-chapter-82-disciple-come-let%E2%80%99s-do-an-experiment", "volume_title": "Volume 1", "body": "<h1>Chapter 82: Disciple, Come, Let’s do an Experiment</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 82: Disciple, Come, Let’s do an Experiment</p><br/><p>“Good boy!” Zhu Yao happily took them off his hands. Little wimp’s really cute when he’s not throwing a tantrum.</p><br/><p>“Big sis Zhu Yao…” Wang Xuzhi’s words paused, but in the end, he decided to speak up. “I feel that, it’s best that you don’t get too close with Sovereign Feng Yi. She’s after all Xiao Yi’s master, and Xiao Yi is…”</p><br/><p>“Don’t worry!” Zhu Yao stroked his head. “Even if you were to tie me up and send me to her now, I won’t even dare to approach too close to her.”</p><br/><p>That master and disciple duo were really frightening, and she would prefer not to know them in her lifetime.</p><br/><p>However, the Metal Spirit was still in Xiao Yi’s hands, hence, she did not have any other choice.</p><br/><p>Oh right, speaking of the Metal Spirit, she just remembered, that she had to quickly release the Wood Spirit as well.</p><br/><p>When she released the Water Spirit, the BUG on Xiao Yi’s face lightened by so much, yet, when she obtained the Wood Spirit, that did not happen at all. This meant that her mission would not be completed just by robbing the Five Spirits off him. Rather, she had to make sure that the rest of the people would not be able to make use of the Five Spirits either.</p><br/><p>The Wood Spirit could be said to have followed her for quite a long time, and it was really obedient, she really could not bear to let it go. Adding that the Wood Spirit could not be compared to the Water Spirit, which had the entire ocean as its cover, since it was just a little sapling, the moment it took root, most probably, it would not be able to move. Hence, it’s best that she find a place that’s safe and far from human eyes.</p><br/><p>Was there any place that people would not be able to find, and was suitable for the Wood Spirit to stay in?</p><br/><p>Got it! An idea flashed in her mind. She instantly thought of a good place, and it was a place that people would definitely not go.</p><br/><p>“Little wimp, I have some emergency matters to take care of. I will be heading out, I can’t talk to you any longer!” Zhu Yao informed him, turned around, and began to walk out. After thinking for a moment, she turned her head around again and told him. “Oh right, the new little twerps who just joined the sect are at the front hall. I will leave them to you, so help me inform your master. I won’t be going there today.”</p><br/><p>“Big sis Zhu Yao…” Before Wang Xuzhi could even stop her, he could no longer see her figure. He had no choice but to accept his fate. Sighing, he turned and headed for the front hall in the Main Mountain.</p><br/><p>The place Zhu Yao wanted to go was Jade Forest Mountain. She was unable to head to the place where she could settle the Wood Spirit down by herself, so she had to seek her master for help.</p><br/><p>Passing through the teleportation formation, the moment she arrived at the peak of Jade Forest Mountain, she saw that familiar figure from afar, as he opened the door and walked out, as though he was preparing to leave as well.</p><br/><p>“Master!” Zhu Yao waved her hands. “I want to seek your hel-”</p><br/><p>Before she could finish, Yu Yan had already begun to walk over with a stern expression. Each step of his was exceptionally firm, and he stopped just one step away from her, as he stared unblinkingly at her face.</p><br/><p>Zhu Yao then swallowed her words back down. What was going on with her master?</p><br/><p>“Hoho, Master, why are you…”</p><br/><p>Before she could finish, Yu Yan suddenly grabbed onto her arm. Lowering his head to her lips, his lips pressed onto hers.</p><br/><p>“……”</p><br/><p>Zhu Yao suddenly felt as though she could hear an explosion, and random numbers crazily scrolled through her mind. Widening her eyes, she looked disbelievingly at the person in front of her.</p><br/><p>This person is definitely not my master!</p><br/><p>Yu Yan raised his head, his brows furrowed, as he muttered out. “Wrong!” Why wasn’t there that feeling he felt back then?</p><br/><p>Mn, again.</p><br/><p>Hence, he once again lowered his head, aligned to his disciple’s lips, and then, he kissed again.</p><br/><p>It’s still wrong!</p><br/><p>Again…</p><br/><p>And hence, kiss, kiss, and then another kiss.</p><br/><p>“Stop!” Zhu Yao who finally managed to recover her senses, pushed away the person in front of her. It was fine if it was just kissing, but why was each subsequent kiss heavier than the previous one? Her teeth were close to being knocked out, you know?</p><br/><p>“Master, what are you doing? This disciple sells her body, not her skill- ah pui! What’s wrong with you?”</p><br/><p>Zhu Yao held on her injured lips, and this was the first time her face reddened in her entire lifetime, as she stared at the man in front of her who kissed her endlessly.</p><br/><p>What’s wrong with her master? Was his body taken over? Was he kidnapped by aliens? Or was he infected with an illness that turned him into a kissing maniac? The hell, how could such an illness exist?</p><br/><p>Looking at his disciple who suddenly ran a few meters away, Yu Yan was a little unhappy, yet, he still answered with a serious expression. “I wanted to test it out?”</p><br/><p>“Test?” Zhu Yao’s mind turned blank for a moment. “Test what?” Test how durable her lips were?</p><br/><p>“There wasn’t that feeling.”</p><br/><p>“What feeling?”</p><br/><p>Yu Yan’s face still looked confused, yet, he seriously explained. “Yesterday, when you were in the house, that feeling when you pressed your lips against mine.”</p><br/><p>“Ah?” Yesterday? That time when they acted for Feng Yi?</p><br/><p>Zhu Yao suddenly felt her heart shake for a moment. Her master couldn’t be… having a crush on her, right?</p><br/><p>Heheheh… heheh… heh…</p><br/><p>Zhu Yao felt her face was strangely getting hotter, and it was even beginning to spread at extreme speed. Why was she feeling so embarrassed?</p><br/><p>This master who could do everything, actually had a crush on her. And he himself did not seem to know about it.</p><br/><p>What to do? She suddenly felt that they could develop these feelings?</p><br/><p>No, no, no. She had to remain calm. She still had to return home, return to her own world! She could not be in love so casually.</p><br/><p>However, even if she were to return to the modern era, she would only be an old-aged unmarried youth. Then why should she even return?</p><br/><p>But, after all…</p><br/><p>Zhu Yao’s heart was currently beginning to tackle the problem of whether she should return, and an intense debate was formed.</p><br/><p>Eh, wait a minute. Wasn’t she considering about the matter of her master having a crush on her?</p><br/><p>Seeing the disciple whose face was already red like an apple in front of him, a certain master’s heart stirred for a moment, as he walked towards her, step by step.</p><br/><p>Zhu Yao simply felt as though her heart had jumped all the way to her throat, as it kept beating incessantly.</p><br/><p>Badump. Badump.</p><br/><p>Yu Yan finally stopped before her, slowly lowering his head, he reached out his hand…</p><br/><p>And touched her forehead. His disciple wasn’t sick, right?</p><br/><p>“Mn, it’s a little hot, but it’s nothing serious.”</p><br/><p>“Pi~~~~~” The pink fumes that filled Zhu Yao’s heart, was cleanly put out.</p><br/><p>Hoho… She just knew that she was a moron for having expectations of this dense master of hers.</p><br/><p>“Is there something you need?” After confirming that the incident back then was just an occasional occurrence, a certain master had begun to turn back to normal.</p><br/><p>Zhu Yao silently rolled her eyes, before she could vent off the resentment that filled her heart, she recalled the important matter she had to attend to, and thus, had no choice but to hold it in for now.</p><br/><p>“Master, have you ever visited the Desolate Ground?”</p><br/><p>“Mn.” Yu Yan nodded. That was the place where he captured that few purple lightning bolts. That place was very mysterious, although the five types of spiritual powers were not present in the air, there was the presence of Purple Heavenly Lightning, which contained huge amount of powerful lightning spiritual energy.</p><br/><p>“I want to plant the Wood Spirit in the Desolate Ground.”</p><br/><p>Yu Yan looked at her a little strangely, as though he did not understand why she wanted to do something like that. Zhu Yao thus explained the change that occurred to Xiao Yi, and only then did he nod his head. “Your thinking is correct. The Desolate Ground is indeed the best place to hide the Wood Spirit. However…”</p><br/><p>Zhu Yao turned her head over. Could it be that there’s something she did not factor in?</p><br/><p>“Have you ever thought that, while the Desolate Ground is a dead land, what the Wood Spirit signifies is a lease of life.” Yu Yan said. “If my guess is correct, once you plant the Wood Spirit in the Desolate Ground, with just a span of ten thousand years, the Desolate Ground will no longer be desolate, rather, it will be an oasis.”</p><br/><p>“Then won’t that be great?” Zhu Yao smiled. Only after actually entering that place did Zhu Yao felt how terrifying the place was. Neither was there spiritual energy, nor was there life, only one piece of desolate land after the next.</p><br/><p>“But in that case, ten thousand years later, the Desolate Ground might become the next Tasyoluk. People will no longer be afraid of that world, and the Wood Spirit will still be discovered by people.”</p><br/><p>“Then have the next world savior save it!” Zhu Yao said with a smile. That’s all she could do to help. “When that time comes, the Wood Spirit can be said to have saved that world. I hope that those demonic beasts in those desolate pieces of land, will know how to show their gratitude, and protect the Wood Spirit from being taken away by outsiders.”</p><br/><p>Yu Yan glanced at her, his expression sank. She clearly knew that there was another way, and that was, to completely destroy the Wood Spirit. It itself was formed by spiritual energy in the first place, so, even if it were to die, it would simply return to being a mass of spiritual energy. Given time, it would still be able to form into a Spirit once again.</p><br/><p>However, his disciple had rather go through a big trouble, than be willing to use that method. She probably could not bear to do so.</p><br/><p>Yu Yan let out a huge sigh. As people who strived to cultivate to deities, those who live for a long time, would long be used to disregard life. Yet only this stupid disciple of his, still kept her former heart. She treated the Wood Spirit this way, and she treated likewise to other people as well.</p><br/><p>She said that the reason why she had arrived in this world was because Xiao Yi would disrupt the balance of the world. Yet, she clearly had thousands and hundreds of opportunities to kill Xiao Yi, and if she had done so, the danger would have naturally been removed. Just like right now, if she were to speak up and seek his help, he would, without even lifting an eyebrow, help her remove that person. However, she would not do it, and she had never thought of using this method.</p><br/><p>Life, was probably her bottom line.</p><br/><p>Zhu Yao released the Wood Spirit, though, it did not seem to be very willing to leave her, as it stretched its soft little vines to entangle her leg, and did not let go. It had lived in her divine sense for a long time, and it had faintly taken root there, so naturally, it was not too willing to move from there. Although Zhu Yao was a little unwilling as well, the longer she kept it, the more she would not be able to let it go. Solidifying her heart, after promising it that she would often come to visit, she left.</p><br/><p>The Desolate Ground could only be entered by Demigod-stage practitioners. Even if regular people were to enter it by mistake, the group of tenth-ranked demonic beasts was not something that one could easily mess with. However, in that case, she could only wait till she was a Demigod before she could see the little Wood Spirit.</p><br/><p>When she returned, it was already late in the night. She fled here, as currently, she was basically unable to look straight at her master’s face at all. Recalling what happened in the day, she suddenly felt as though she had been taken advantage of, yet, the one that did it was still as clueless as before. She could feel her body itching all over from the irritation.</p><br/><p>“Big sis Zhu Yao.” The moment she arrived at the door, Wang Xuzhi had walked over.</p><br/><p>“Little wimp!” Zhu Yao was shocked. “Why are you still here?”</p><br/><p>“You left before you could finish what you wanted to say, I was worried…” Wang Xuzhi frowned. “Did something happen?”</p><br/><p>Zhu Yao’s face reddened, as she firmly shook her head. Even if she were to be beaten to death, she would not tell anyone else that she was forcefully kissed. “I’m alright. Ahem. Go and take your rest for now.”</p><br/><p>“Ou.” Only then did Wang Xuzhi turned and headed for the door. However, he still turned his head around to look at Zhu Yao’s terrible expression. Was she really alright?</p><br/><p>Obviously, Zhu Yao was not alright. Her entire body felt uncomfortable, alright? Clearly, even though she was the one being crushed on, why was she so frustrated about it? Not good, she must find a chance to get back her pace.</p><br/><p>After silently making this decision, only then did Zhu Yao finally turn around, head inside her house and closed the door. However, no one realized that a figure was currently withdrawing the invisibility formation nearby. After standing around for a moment, that person then turned and flew away at high speed.</p><br/>\n</div>"}