{"title": "Chapter 90: Master is Leaving", "id": 90, "volume": 1, "url": "http://boxnovel.org/my-disciple-died-yet-again-chapter-90-master-is-leaving", "volume_title": "Volume 1", "body": "<h1>Chapter 90: Master is Leaving</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 90: Master is Leaving</p><br/><p>At that moment, Zhu Yao felt as though a fire was blazing, to the point where her restraints, morals, and three views were all burnt away and forgotten. ‘Shuaa!’ Pulling his clothes apart, she lowered her head and gave him a bite, as she anxiously announced.</p><br/><p>“No matter if you like me in the past or not, I shall officially tell you this now. This lady here has laid her sights on you, and you will be mine in the future. If you dare to have other girls touch you, I don’t care if you’re my master, this lady here will castrate you all the same!”</p><br/><p>Probably because she was speaking in a very serious tone, Yu Yan was slightly stunned. His blurry eyes instantly cleared up by quite a bit.</p><br/><p>Staring at his disciple who was still lying on his body unmoving, a moment later, he thought of a possibility.</p><br/><p>“You… want to form a practitioner-pair with me?”</p><br/><p>“What else do I want otherwise?” Zhu Yao once again smooched, leaving another mark on him. “Have a discussion about the importance of the development of human reproduction?”</p><br/><p>“…” Yu Yan did not reply, however, his face suddenly began to heat up out of nowhere. Unclear feelings began to surge up haphazardly from the depths of his heart. Happiness? Joy? Or was it excitement? He was unable to discern them, and he simply felt as though his face was glowing hot.</p><br/><p>However, to form a practitioner-pair with his disciple, did not seem… to be a very unacceptable idea.</p><br/><p>However, Zhu Yao was dumbfounded by his current look. Why was her master’s face red? And it was even turning redder, as though he was about to burn up! He couldn’t still be an innocent virgin, right?</p><br/><p>Master, say something. Don’t just make your face red.</p><br/><p>If your face stays as red as that, as you look at me with eyes filled with expectations, I basically won’t be able to resist thinking of you every minute and every second, you know!?</p><br/><p>Zhu Yao instantly felt her wolf’s blood boiling. Her hands moved, she could no longer contain her morals, as she began to take advantage of his stark naked chest. You forced me!</p><br/><p>Just when she about to begin eating, a certain master seemed to have suddenly reacted. With a light push, Zhu Yao was pushed down the bed.</p><br/><p>In an instant, Yu Yan had already tidied up his clothes, and stood up.</p><br/><p>However, he still did not cast his gaze at her, there were still some red blushes that had yet to fade from his face, and he strived to maintain a stern expression as he spoke. “Stop this nonsense. How can such things be decided so easily?”</p><br/><p>Zhu Yao rubbed her buttocks which was hurting from the fall, and when she crawled up, he had already disappeared.</p><br/><p>She shivered from the cold wind which blew in from the open door.</p><br/><p>She suddenly had the impulse to flip a table. Momma’s egg! This lady here has already taken off her pants, and you tell me this!?</p><br/><p>Ever since Zhu Yao acted that tyrant role, her Consort Yu¹ had never returned to Jade Forest Mountain. She flipped over the entire Jade Forest Mountain, yet, she was still unable to see his figure at all.</p><br/><p>Was he angry? Was he freaked out? Or could it be that he did not have any feelings for her at all, so he ran?</p><br/><p>The more Zhu Yao thought about it, the less she figured out. Clearly, the atmosphere they had between them on that day was pretty good. Although he ran away in the end, she could not believe that her master had no feelings for her at all. However, even though she searched the entire Jade Forest Mountain, she could not see his figure at all. And there were many newly placed formations in Jade Forest Mountain, as though they were placed to completely isolate the mountain itself. Even though her cultivation had already been completely restored, as someone who had never researched on formations at all, she was unable to leave this Jade Forest Mountain, and thus, could do nothing but wait.</p><br/><p>After waiting at the mountain peak for ten days, her master, who had ran away from home, finally returned. Zhu Yao’s eyes shone, and instantly leapt down from the roof of the house.</p><br/><p>Yu Yan however, slightly shifted his body, and pulled out a small little child from behind him, and this child was even damn familiar. She was exactly the little pudding she saw half a year ago, who claimed she was her own junior-martial sister.</p><br/><p>Zhu Yao’s legs froze, and at that moment, she felt something stifling had stuffed the depths of her heart.</p><br/><p>Yu Yan however, held onto that child, and walked towards her with big strides. Stopping two feet before her, with a gentle expression, he said. “Yu… Yao. Your master shall introduce someone to you.”</p><br/><p>He pulled the little girl forward, and the child looked at her sheepishly.</p><br/><p>This was the first time she had ever seen her master adopt such a gentle expression, and he had even remembered half of her name, which was rarely seen. Yet, it was because of this disciple beside him. Her heart cramped, and in an instant, she felt like crying.</p><br/><p>“There’s no need.” Zhu Yao glanced at that child. “Bao Bao, right?”</p><br/><p>“How did you know?” The little girl’s eyes shone, and she looked at Zhu Yao excitedly.</p><br/><p>Zhu Yao lightly raised her lips, and smiled. However, she then raised her head and looked straight at Yu Yan. Was this his way of rejecting her? Because he now had a new disciple? But… She still wanted a clarification. “Master, tell me honestly. Do you like me or not?”</p><br/><p>Yu Yan’s expression stiffened, and then, he hurriedly shifted his gaze. “Ahem… Stop with the nonsense. Finish hearing what I want to say. This child is…”</p><br/><p>“The new disciple you took in, right?” Zhu Yao once again interrupted his words. “I know.”</p><br/><p>Yu Yan looked at her a little strangely.</p><br/><p>Yet, Zhu Yao looked at him even more seriously, and continued with her questions. “So, do you like me or not?” Momma’s egg, give me a straight answer.</p><br/><p>“…” Yu Yan was once again speechless due to her straightforward words. After a moment of silence, he acted as though he was angry, and said. “Stop fooling around!”</p><br/><p>You’re fooling around, your entire family’s fooling around.</p><br/><p>Yu Yan coughed twice, and finally managed to gather back his calm. “Since you two already know each other, then, bring her around to have her familiarize herself with the area.”</p><br/><p>Zhu Yao suddenly felt a chill in her heart, and she seemed to now understand why her girl friend would always like to call her in the middle of the night after a break-up. Because she really wished to make a call now as well.</p><br/><p>“Go on, she’s the one!” Yu Yan nudged the child beside him.</p><br/><p>The little girl instantly gave a flowery smile, and charged towards Zhu Yao. Hugging onto her leg, she shouted out loud. “Master!”</p><br/><p>Zhu Yao was pushed two steps back by this little twerp’s charge, and she suddenly widened her eyes, as she looked at this little girl with a face of disbelief. “What did you call me?”</p><br/><p>“Master, master, master!” The little girl excitedly called her three times. As though she was still not satisfied, she even rubbed her face against Zhu Yao’s leg with all her might. “I have waited for a very long time. Master, you’re finally back. I finally get to see master.”</p><br/><p>“Wait a minute… Chotto matte!” I’m lacking in brain juice, let me first recharge them. “Who did you call master? Who is your master again?”</p><br/><p>The little girl was startled. Her face which was still like a little sun earlier, instantly turned cloudy with a small rain shower. “Master… Master, don’t you want me anymore? Bwaaaa….”</p><br/><p>“Don’t… Don’t cry!” As she had thought, children were definitely her life’s nemesis. Zhu Yao squatted down, and with clumsy hands, she began to console her. However, the little girl was like a bull, as she stuffed her head into Zhu Yao’s embrace, and began to cry harder.</p><br/><p>“Master…” Zhu Yao could only silently seek help from Yu Yan beside her. Just what the hell was happening? Wasn’t she her junior-martial sister? How did she become her disciple?</p><br/><p>Yu Yan gave a calm look, as though he had nothing to do with it. “I have already handed you the person herself. You shall handle the arrangements for her yourself, however, she’s still not allowed into the mountain for a month.”</p><br/><p>Just what was he going on about? Zhu Yao gave an inexplicable expression. “Just who is she? I don’t even know anything about this?”</p><br/><p>Yu Yan gave her a contemptful glare. Earlier, didn’t you say you knew?</p><br/><p>“…” Alright, I was courting death. Master, please tell me.</p><br/><p>Yu Yan glanced at that crying creature, who was said to be his grand-disciple, and was evidently getting a little impatient. He never had patience for anyone else, and that included his grand-disciple as well. “Back then, didn’t you suggest to take her as your disciple in front of Zi Mo? In the days… you weren’t here, your master have already helped you make the arrangements, and have her enter the Jade Forest Mountain when she’s five years old.”</p><br/><p>Zi Mo? Disciple? Zhu Yao desperately searched through the memories in her mind. She seemed to have told Zi Mo about this matter, but the person she wanted to take in back then was…</p><br/><p>Wait a minute!</p><br/><p>Zhu Yao pulled the little girl away, and only then did she seriously inspect that small little face of hers. After a closer look, she realized there really were the faint letters, “BUG”, on her face. “She’s Zi Mo’s daughter!”</p><br/><p>The hell, how did she grow so big in a blink of an eye? But why did the letters on her face become lighter instead?</p><br/><p>“Mn.” Yu Yan frowned. “In these recent years, she have been slipping into the Jade Forest Mountain several times to find you. So I got her to see you today, to save the trouble.”</p><br/><p>“…” So the master she spoke about that day, was her. Because she had never seen her own master, so she decided to climb up in the middle of the night to see her in secret?</p><br/><p>Stroking the soft little dumpling who was in her embrace, her heart instantly softened to the point of turning silly. So cute! Gently helping to wipe her eyes dry, she persuaded with a gentle voice. “Be a good girl, don’t cry.”</p><br/><p>“Master, will you not want me?” The little dumpling was fearful.</p><br/><p>“Of course not!” At that moment, Zhu Yao felt her earlier frustrated self was simply stupid, as she kissed her cheeks. “Bao Bao is so cute, master can’t wait to spoil you, you know.”</p><br/><p>After saying that, she coaxed her with a few more words, and then, kissed her a couple more times. Only then was she finally able to console her disciple’s little injured heart, and she no longer cried. Zhu Yao still wanted to continue coaxing her, however, standing at the side, Yu Yan’s expression turned dark, as rage began to surge out of nowhere.</p><br/><p>He coldly spoke up. “Since you have met her already, then head down the mountain! Remember my words, you’re not allowed to climb up the mountain on your own for a month.”</p><br/><p>The little disciple fearfully glanced at her own grandmaster, looked at her own master with reluctant eyes, before she finally turned around and walked down the mountain step by step. Before she left, she did not forget to turn her head and loudly shout things like ‘master, you must definitely remember me!’</p><br/><p>Zhu Yao’s heart softened from hearing these words. It really was great to have such a good and obedient disciple. She silently decided that, even if the little dumpling was a BUG, she would definitely save her completely.</p><br/><p>“The things… you spoke of the other day.” Only when he sensed that the little girl had already left Jade Forest Mountain, did Yu Yan finally hesitantly speak up.</p><br/><p>Zhu Yao was startled, as she turned her head over. The other day? The day when she was a tyrant?</p><br/><p>Seeing that serious expression of his, Zhu Yao could not help but feel a little anxious.</p><br/><p>Yu Yan however, had calmed down. Even the red blushes on his face that Zhu Yao forced out earlier with her daring words, had faded quite a bit. Taking a step forward, he said with a stern expression. “Right now, I’m unable to promise you.”</p><br/><p>“…” Momma’s egg, after such a long time, you still want to reject me? At that moment, Zhu Yao was a little upset.</p><br/><p>Yu Yan, however, raised his head and looked towards the sky. As though he had decided on something, he took a deep breath, and slowly spoke. “The initial reason why I wanted to take in a disciple, is to simply pass down the Arts of my Jade Forest Mountain. And when you were successful with forming your Azoth Core, and could fend for yourself, it was supposed to be my time to ascend. However, I never thought that…” He never thought that his disciple would be so worrisome, and that he would be unable to put her down.</p><br/><p>Yu Yan took two steps forward, looked straight into his disciple’s eyes, which were evidently showing a hint of sadness, and habitually reached out his hand to stroke her head. “There’s too many strange things surrounding your body, I’m afraid that I’m unable to find out the cause in just a short notice, and I feel powerless because of that. So… I have decided to ascend!”</p><br/><p>Nanii!!??</p><br/><p>¹https://en.m.wikipedia.org/wiki/Consort_Yu</p><br/>\n</div>"}