{"title": "Chapter 101: Which Sect has the Best Cultivation Techniques?", "id": 101, "volume": 2, "url": "http://boxnovel.org/my-disciple-died-yet-again-chapter-101-which-sect-has-the-best-cultivation-techniques", "volume_title": "Volume 2", "body": "<h1>Chapter 101: Which Sect has the Best Cultivation Techniques?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 101: Which Sect has the Best Cultivation Techniques?</p><br/><p>“Which Sect are all of you from? Why were all of you being hunted down by heretic practitioners?” Zhu Yao asked.</p><br/><p>The children inside, looked at each other. A moment later, the girl, who was the oldest, and possessed the highest level of cultivation among them, stood out. As though she had already confirmed that she was not working with those heretic practitioners earlier, she gave a junior greeting.</p><br/><p>“Thank you senior for saving us. We’re the disciples of Azure Melancholy Sect. I have entered the Sect for only ten years. Today, a large wave of heretic practitioners suddenly attacked out Deity Sect. It was Sect Master and and senior-martial uncles who brought everyone here to hide. As to why they attacked us, we have no idea either.”</p><br/><p>Zhu Yao frowned. It’s understandable that these children did not know the reasons.</p><br/><p>“The heretic practitioners outside are already gone, but…” Zhu Yao hesitated for a moment, but in the end, she still decided to tell them. “Other the lot of you, there’s no other survivors. I think your masters must already be deceased as well.”</p><br/><p>The moment her words fell, there were already faint cries coming from inside.</p><br/><p>“It’s the Sect Master Token.” Suddenly, a disciple pointed to the jade tablet in her hand, and said excitedly.</p><br/><p>The rest of the people realized it as well. The eyes of the little radishes that were saddened earlier, instantly glowed.</p><br/><p>Zhu Yao suddenly had a bad premonition.</p><br/><p>“The Sect Master Token is in her hands.”</p><br/><p>“Then she is…”</p><br/><p>“It’s definitely her. Otherwise, how was she able to open the formation outside?”</p><br/><p>“This disciple pays respect to Sect Master!” The eldest child suddenly knelt down in front of her. The moment she knelt down, it was as though she had started a domino chain, as the crowd of little radishes began to kneel down as well. They then shouted out in unison.</p><br/><p>“This disciple pays respect to Sect Master!”</p><br/><p>The hell, how could they decide on that so casually!?</p><br/><p>“All of you misunderstood.” Zhu Yao’s expression darkened. She was just a passerby, how did she become their Sect Master? “This tablet, was handed to me by someone in your sect when I was at the backyard earlier. It’s used to save all of you, and not used to pass down the Sect Master position or anything.”</p><br/><p>“The Sect Master Tablet is only passed down to the succeeding Sect Master.” That child looked at her excitedly. “Since the Sect Master has personally passed it to you, then you’re our new Sect Master.”</p><br/><p>The other little radishes nodded in response as well. With sparkling eyes, they looked at her with faces filled with expectations.</p><br/><p>Zhu Yao’s words of rejecting them were instantly blocked off. The hell, were these little radishes really not trying to drag her down as well?</p><br/><p>“Enough. We can speak of this matter in the future.” She had to think of some skilful rejections. The disciple she had at home was already worrisome enough, if she were to raise an entire Sect as well, wouldn’t she be courting death?</p><br/><p>There was a need to clear up the pile of corpses at the front. Zhu Yao pointed to a few of the bigger children to follow her, while leaving the rest at the same spot.</p><br/><p>Zhu Yao had Wu Song stayed there as well, so that he could take care of those little children whose ages were similar to his. After that, he brought the few disciples out.</p><br/><p>The moment those children came out, they were stunned by the various demonic beasts crawling and kneeling on the ground. Some of them were a little afraid and hid to the back. However, seeing that those demonic beasts did not attack people, and instead, were extremely respectful towards them, they became more courageous as well.</p><br/><p>However, when they walked towards that crater of blood, they were still paled from shock. Some of them had even cried and puked at the side.</p><br/><p>Zhu Yao knew this would happen as well, so she did not have the smaller children come.</p><br/><p>After waiting for these children to recover, she instructed them to bring a few demonic beasts each, had them gather all the corpses in the Sect, and move had them move the corpses into the crater.</p><br/><p>Those were demonic beasts without masters, so their beast instincts had yet to be removed. However, with her presence suppressing them, they did not dare to harm those children. Obediently, they followed after the children to look for corpses.</p><br/><p>Sesame was also kicked out by her to help out as well, and it could manage those demonic beasts while it was at it.</p><br/><p>By working separately, their movements were rather quick, in a few moments, all of the corpses had been moved over. Zhu Yao cast an Art, and instantly lit a huge fire in front of the crafter of blood. She then chanted the Rebirth Incantation, only to see beads of light, within the flames, floating towards the sky.</p><br/><p>The scene was shockingly dazzling, yet, there was only a sorrowful dead silence beneath the flames.</p><br/><p>Zhu Yao sighed, and stroked the head of the nearest child.</p><br/><p>What she lit up were Spiritual Flames, and it burnt extremely quickly. A moment later, the entire crater of blood was only left with a layer of black ash. Zhu Yao then cast another Earth-type Mystic Art, forming a gigantic tomb.</p><br/><p>“I don’t know the names of your martial seniors. I shall have all of you engrave these graves by yourselves.”</p><br/><p>The few fifteen to sixteen year old children turned to looked at her, and then, they nodded in unison.</p><br/><p>And, they replied in unison. “Yes, Sect Master.”</p><br/><p>Uh…</p><br/><p>I already said I’m not their Sect Master, this bunch of kids are really…</p><br/><p>Zhu Yao had initially thought of having these children climb down the mountain. After all, they had only came onto this mountain not too long ago, so they should still have relatives in the mortal realm. Returning home, was much better than staying in a Deity Sect which had lost its protection.</p><br/><p>However, only after she asked did she find out that, all these children were actually orphans!</p><br/><p>Momma’s egg, she was completely wrapped into this now.</p><br/><p>“Sect Master, Sect Master, the engraving of the graves of our seniors is done.”</p><br/><p>“Sect Master, Sect Master, the Hidden Records Pavilion has already been cleaned up.”</p><br/><p>“Sect Master, Sect Master, the Pellet Pavilion and Sword Pavilion have been cleared up as well.”</p><br/><p>“Sect Master, Sect Master…”</p><br/><p>Your sister’s the Sect Master. *flips table*</p><br/><p>Zhu Yao was spent by this bunch of sparkling and energetic little radishes for an entire day. How was she able to gain the position of Sect Master just by simply passing this mountain by? And the position was even bundled with a basket of little radishes.</p><br/><p>Zhu Yao deeply felt that, she was going to be defeated by little radishes for her entire lifetime. In the past, it was still alright when she only had Yu Luo, and she could still endure it when Wu Song came later on. However, why did a huge wave of them come at once this time?</p><br/><p>Was this Plants vs Zombies? A bunch of little radishes were coming to assault her.</p><br/><p>Zhu Yao deeply sighed, as she powerlessly waved her hands. “First, bring me over to the Pellet Pavilion to have a look.”</p><br/><p>“Yes, Sect Master!” Little Radish Number One replied, and then, she joyfully leaded the way.</p><br/><p>The so-called Pellet Pavilion, naturally, was where the pellets and medicine were stored. Zhu Yao needed to find out just how much of them was still stored in this Sect.</p><br/><p>However, when she arrived at that place, Zhu Yao’s expression darkened, and the corner of her lips twitched. Such a small room, which was only about ten square meters large, was the Pellet Pavilion? Stop joking already. As expected, a Sect like this, the earlier it closes, the better.</p><br/><p>When Zhu Yao entered, she became even more outraged. Although there were many pellets and medicine neatly placed in there, all of them were simply regular pellets and medicine used in the cultivation realm. They did not even possess the most simplest of Foundation Pellets in here. Only after she asked, did she find out that Foundation Pellets were actually very precious pellets in their Sect, and they were all kept by the Sect Master himself.</p><br/><p>She should celebrate the fact that what they had the most were Food-Abstaining Pellets. At the very least, these bunch of little radishes did not need to starve, right?</p><br/><p>Life looked completely bleak…</p><br/><p>Next, when she arrived at the Sword Pavilion, her desire to cry was bigger than before. This was a place where mystic weapons and mystic tools were stored. There were also quite many tools stored here as well, though, all of them were merely first-ranked and second-ranked mystic tools. It was already great if they could be used to fly, let alone be used for defending against enemies.</p><br/><p>She suddenly understood why this Sect could be annihilated so easily by the heretic practitioners. It was because they were simply too poor!</p><br/><p>Zhu Yao deeply sighed, and felt like crying.</p><br/><p>“Let’s go to the Hidden Records Pavilion then.” If it’s poor, then it’s poor, however, please don’t tell me there’s a problem with their cultivation techniques and Mystic Arts as well.</p><br/><p>“Sect Master, the records in the Hidden Records Pavilion, have already been moved out to sun-dry by eldest senior-martial brother and the rest. Right now, you can see them at the plaza outside the front hall.” Little radish said.</p><br/><p>“Eldest senior-martial brother?” Who’s that. Wasn’t that girl the biggest among the little radishes?</p><br/><p>“It’s Eldest senior-martial brother Wu Song.” Little Radish Number One replied naively.</p><br/><p>Wu Song? Wasn’t he the male partner little wimp she brought along? When did he become their senior-marital brother? Speak clearly, hey.</p><br/><p>Wait a minute, she said they were sun-drying them? Weren’t all records, that record techniques of cultivation, engraved on unique jade tablets using spiritual energy? Why did they need to move them out to sun-dry them?</p><br/><p>Only when she arrived at the front hall did she understand why. Because those records of cultivation techniques, were literally written records, those types which were written on white paper and with black ink. And naturally, she was able to guess why they did not use jade tablets. It’s because they were poor!</p><br/><p>Just how poor was this Sect, hey!?</p><br/><p>However, she realized that Wu Song had pretty good leading capabilities. he was steadily leading a dozen few little radishes to sun-dry the records on the plaza. The way he separated the workload was very precise, and in an unhurried manner as well. She really wonder how he managed to mingle with this crowd of little radishes so well with just a single day. Everyone could faintly feel that he had the potential to lead. Of course, she might have played a part in this as well.</p><br/><p>However, the smiles of children were unable to fool anyone. Those little radishes really trusted him from the bottom of their hearts.</p><br/><p>Zhu Yao suddenly had an idea. She had actually been worrying that he may go on the wrong path. Initially, she had thought of bringing him into Ancient Hill Sect, and had him grow in a Deity Sect from young. This way, he would more or less lean towards the righteous faction. However, back then, Xiao Yi had grown up in a Deity Sect as well. In the end, he still went on the wrong path. She was unable to guarantee that he would be like that Xiao Yi.</p><br/><p>The most effective method of stopping a person from going astray, was none other than nurturing his sense of responsibility. Especially someone like him, who had always been rejected by his little companions. In the depth of his heart, what he wished the most was to have someone rely on him, and have someone to accompany him. Then why not allow him to continue staying here?</p><br/><p>As the saying went. ‘Every Sect would have an eldest senior-martial brother who was morally upright, knowledgeable, strong, beautiful, and hardworking.’</p><br/><p>Wu Song. You shall stay here and develop yourself as an upright, knowledge, strong, beautiful and hardworking eldest senior-martial brother then.</p><br/><p>“Sect Master.” The busy little radishes suddenly stopped, and greeted her in unison.</p><br/><p>“Sovereign.” Wu Song joyfully called out as well.</p><br/><p>“Mn.” Zhu Yao nodded. At that moment, she gained the confidence to set up a Deity Sect. It would only be a little more work, right? She had the storage ring her master had left her, it was enough to raise a Sect properly.</p><br/><p>She called a few of the bigger radishes and Wu Song over, and prepared to discuss about future matters. Firstly, she had to change the name of the Sect. This bunch of radishes were too young. If they were to use their former name, there was a possibility that those heretic practitioners would come raiding them again. If that time were to come, and she wasn’t present, this bunch of radishes would simply lose their lives.</p><br/><p>On the other hand, if they were to change their name, even if they were discovered by other people, those people would simply think that it was simply a newly established Deity Sect. In any case, a celestial mountain like this, had never been empty for too long. It was a regular occurrence for practitioners to take hold of it and establish a Sect.</p><br/><p>She had thought that this point of hers would bring about the radishes’ rejection. After all, by changing the name, it would no longer be the Sect of the past. However, she had evidently underestimated the little radishes’ endurance. In regards to her words, the words of their new Sect Master, they completely obeyed her unconditionally.</p><br/><p>“Then, Sect Master. What should our Sect be called?” Little Radish Number n asked.</p><br/><p>“Mn…” Zhu Yao pondered for a moment. “We must give it a rather resounding name. Why don’t we call it… Eastmount Azureflight?”</p><br/><p>Which Sect had the best cultivation techniques? Head over to Eastmount Azureflight. Was there anything else that could be more domineering than this? Hahaha, she really was a genius.</p><br/><p>“But, Sect Master. Our celestial mountain is located in the south, so why is it called Eastmount?” Little Radish No. One brought out her question.</p><br/><p>Uh… That’s true. Adding a geographical name did sound a little instigating.</p><br/><p>“Then we will use the latter word, and call it Azureflight!” Zhu Yao gave the final world, and the little radishes cheered in unison.</p><br/><p>Hence, Azureflight was officially established. Currently, in the entire sect, including the Sect Master, there was a total of eighty-three people.</p><br/><p>Such a wonderful occasion. ╮(╯▽╰)╭</p><br/>\n</div>"}