{"title": "Chapter 104: Little Radish is Transforming", "id": 104, "volume": 2, "url": "http://boxnovel.org/my-disciple-died-yet-again-chapter-104-little-radish-is-transforming", "volume_title": "Volume 2", "body": "<h1>Chapter 104: Little Radish is Transforming</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 104: Little Radish is Transforming</p><br/><p>“Senior-martial aunt Yu Luo!” Incidentally, one of the finalists was a disciple of Ancient Hill Sect, and he recognized her. “Why are you..?”</p><br/><p>Yu Luo did not answer. She simply swept her eyes at the two of them, and coldly said. “Make your moves!”</p><br/><p>The two of them were startled, and were completely at a loss. Could it be that the structure of this final match had changed into a free-for-all between three people? Why didn’t they know about it?</p><br/><p>Zi Mo seemed to have been stunned the moment he saw Yu Luo flying towards the stage. With an anxious face, he stood up. “Yu Luo!” What was his precious daughter doing?</p><br/><p>Just when he was about to scold her and have her return, suddenly, he felt a pressure of someone’s might, which forced him back into his seat. Zi Mo turned back to look. “Little martial aunt!” Why was she stopping him?</p><br/><p>Zhu Yao did not even bother to gaze at him, nor did she give him an explanation. She simply looked sternly onto the ring, as though the person who cast the pressure on him was not her.</p><br/><p>What was little martial aunt trying to do? Although his own daughter was at the Foundation-stage as well, how could her trash Water Spirit Vein compete against the two disciples on the ring? And her opponents were even Foundation Paragons.</p><br/><p>At that moment, Zi Mo felt anxious and itchy all around his chest, yet, he simply couldn’t move at all.</p><br/><p>“Senior-martial aunt Yu Luo must have entered by mistake.” As a disciple of Ancient Hill Sect, he was still informed of this senior-martial aunt with a trash Spirit Vein, hence, he did not think that she had the strength to participate in the tournament. “It’s best that you head down the ring for now.”</p><br/><p>Yu Luo’s expression turned cold, and she did not bother to have some idle chatter with them either. She instantly did a hand seal, which immediately released a sky of ice and a field of snow.</p><br/><p>Ice began to form at an extremely quick pace, and ice pillars, like metal nail, popped out from the ground one after another. Separating into two batches, they grew straight towards the two people.</p><br/><p>The two people were stunned. That ice-casting speed was so quick, it did not give them sufficient time to cast a defensive barrier at all. Hence, they could only fly into the air with their swords.</p><br/><p>“Senior-martial aunt Yu Luo!” That disciple of Ancient Hill Sect especially, had an expression of complete disbelief. Was this really the Water Spirit Vein? It must be a joke, right? This casting speed had basically caught up to that of a mutated Ice Spirit Vein holder, alright?</p><br/><p>While he was still doubtful, Yu Luo suddenly leapt into the air, and with her sword wielded in her hand, she slashed towards him. He no longer had time to be shocked. Keeping the belittling thoughts he once had, he summoned out his spiritual sword and began to seriously fight against her.</p><br/><p>The other disciple, seeing that she had went to attack someone else, had a small amount of time to catch his breath, and descended downwards. Just when he was about to retaliate, he instantly felt something was off when he stepped on the ground. The caster was no longer there, theoretically speaking, the Mystic Art should had stopped as well. Yet, the ice on the ground was still spreading slowly. Furthermore, the moment he landed on the ground, one of his legs was already frozen.</p><br/><p>That person was startled, and he immediately swung his sword to slice the ice. Bringing his leg which was still encapsulated in ice, he once again flew up. When he took a closer look…</p><br/><p>That Freezing Ice Art, actually shaped itself into a gigantic formation, which had spread all over the entire ring, and it was continuously being active. As long as anyone were to land on the ground, that person would be frozen solid in an instant.</p><br/><p>In just a short span of ten seconds, she actually had the entire ground in the palm of her hand.</p><br/><p>Keeping the bewilderment in the depth of his heart, he instantly became serious. Earlier, he had thought that this female practitioner was a little arrogant. Looking at her now, since she dared to compete against the two of them alone, she must have the ability to do so.</p><br/><p>And that disciple of Ancient Hill Sect, was dumbfounded by Yu Luo’s pervasive sword techniques. Every single strike of hers, was as though she was making desperate attempts to attack him, and looked like random slashes and stabs with no rhyme or reason. Yet, he was completely powerless against every single one of them, and gradually, even parrying was becoming a little difficult for him.</p><br/><p>Such brutal sword techniques! She was definitely not the trash senior-martial aunt Yu Luo as stated in the rumors!</p><br/><p>Taking a deep breath, he circulated all of the spiritual energy in his body, and pushed Yu Luo away with all his might. Due to the suppression between a Foundation Paragon and the middle levels of Foundation, Yu Luo could not help but be forced back several tens of meters back. The disciple became joyful in his heart. Taking the opportunity of the open space after forcing her back, he summoned countless of spiritual swords, and shot them towards Yu Luo.</p><br/><p>Yu Luo had lost her initiative, and was no longer able to make any further approaches, hence, she could only be forced back. And, she was even forced right back towards the ground.</p><br/><p>A chance! The eyes of the other disciple shone. He instantly circulated his spiritual energy, and unleashed a Fire-type Mystic Art – Prairie of Flames. The huge fire blazed across the ice surface, and instantly turned the ring into a sea of flames. While the ice surface earlier, was heated by the huge flames as well, as it instantly turned into water vapor, revealing the initial ground surface.</p><br/><p>As for the disciple who was currently controlling the spiritual swords, he hurriedly adjusted the direction of the spiritual swords as well, and they flew straight towards Yu Luo’s direction.</p><br/><p>Yu Luo had no choice but to bring up her defensive barrier, to block against the surrounding sea of flames and the descending spiritual swords with all her might. The entire situation on the ring instantly flipped, Yu Luo completely did not have any spare strength left to retaliate, and it was just a matter of time before her defensive barrier would be broken through.</p><br/><p>The eyes of the two disciples both revealed a joyous color. Yet, they silently expressed their pity towards this girl who dared to fight the both of them alone. Her abilities were indeed pretty good, but regretfully, she had still overestimated herself a little. How could a level-skipping challenge be so easy? And she was even fighting the two of them at the same time.</p><br/><p>From the air, the two of them descended onto the ground, and looked towards Yu Luo’s direction. Yet, they did not break off the hand seals, instead, they increased the output of their spiritual energy, in order to break through her defensive barrier as soon as possible. Their victory was already without a doubt. They had already won.</p><br/><p>Yu Luo looked as though she was barely able to hold on, as one of knees had went down onto the ground. Glancing at the two complacent people, she suddenly revealed a smile.</p><br/><p>Just when the two had yet to realize anything, she had already slammed one of her palms onto the ground, and said. “Freeze, activate!”</p><br/><p>In an instant, a large amount of ice appeared at the places where the two of them were standing. The ice enveloped the bodies of the two people, and instantly froze the two of them into gigantic statues of ice. And, they were still maintaining their hand-sealing postures they were in before.</p><br/><p>She won!</p><br/><p>The entire audience was silent.</p><br/><p>The conclusion was initially a certain victory for the other side, how did the situation reverse in an instant?</p><br/><p>Forget about the two finalists who had yet to regain their senses, even those Nascent Soul practitioners present, did not even think such a conclusion would occur. Among these people, most of them were present during Yu Luo’s Spirit Vein test back then, so naturally, they knew of the little girl present on the ring. She was that Water Spirit Vein furnace back then.</p><br/><p>So, compared to anyone else, they were simply unwilling to believe what they just saw with their very own eyes. What happened to the fact that the trash Spirit Vein holders could only become furnaces? Back then was definitely a mis-test, right? This lady was actually an Ice Spirit Vein holder, right? Forget about the fact that it was a level-skipping match, she even won when she was up against two of them?</p><br/><p>“Great work!” Undoubtedly, Zi Mo was the happiest one, and he had even almost charged right out to give his precious daughter a smooch. He really wanted to see if anyone else would dare to belittle his own daughter, and if any little bastard would dare to court death by asking for her hand in marriage.</p><br/><p>Zi Mo barely managed to suppress his own excited feelings, and remembered to turn back and give Zhu Yao his thanks. He naturally knew that his own daughter was able to attain her achievements today, was definitely due to his martial aunt’s teachings. Back then, he had always felt that his martial aunt was nonsensical, and loved to talk back at him. But when he looked at it now, she must have planned all of these a long time ago. “Thank you, martial aunt. For guiding my daughter.”</p><br/><p>So touching. As expected, they were family that loved one another.</p><br/><p>Zhu Yao gave him a scornful look. Little sugarcoat, earlier, when I was stopped you, you must have been scolding me in your heart. Now you know I was doing it all for her. Hmph. I’m going to ignore you.</p><br/><p>Zhu Yao turned her head back, and continued to prideful and cold.</p><br/><p>Zi Mo was given the cold shoulder, however, he did not mind, and happily returned to his seat.</p><br/><p>However, those words of his, had reminded everyone present. They recalled that Water Spirit Vein holder was Sovereign Zhu Yao’s disciple, and was under the Jade Forest Mountain. No wonder she was such a monster. As expected, Jade Forest Mountain was a place specialized in producing monsters, and could not be judged by common sense.</p><br/><p>However, earlier, how did that Yu Luo instantly cast another formation, and freeze the two finalists?</p><br/><p>Only Zhu Yao knew the answer to this question.</p><br/><p>The hell, little radish basically did not place down a second formation, alright! That stupid disciple, believed that the formation would be broken by melting the ice. However, when water encountered fire, it would simply turn into water vapor, and if the temperature were to fall, it could naturally become ice again. That formation, had never disappeared in the first place, alright?</p><br/><p>What little radish did, was simply freezing up the water again.</p><br/><p>As expected, knowledge could change one’s fate. The reason those two finalists lost, was because they lacked a Physics teacher.</p><br/><p>While the audience was still figuring out what happened, Feng Yi, who had been sitting on her mythic bird the entire time, looked towards the leftovers of the formation. With some thoughts in mind, she then glanced at Zhu Yao who sitting in front, and then, she instantly returned to her mountain-top flower look.</p><br/><p>Ho, as expected, it was because her yearning was over-excessive!</p><br/><p>“Victory goes to Yu Luo of Jade Forest Mountain!” The referee at the side of the ring loudly announced.</p><br/><p>Yu Luo raised her head, looked towards her master at the grandstand above, and revealed the most brilliant smile she ever had in twenty years. Master, this disciple did it.</p><br/><p>In the next instant, however, she collapsed, while a hint of that smile still remained on her lips.</p><br/><p>Zhu Yao simply felt a trembling in her heart, and momentarily had a bad premonition.</p><br/><p>The referee simply thought that she had fainted over due to spiritual energy depletion, hence ,he did not bother about her, and first saved those two disciples who were still trapped in ice.</p><br/><p>Yet, he simply saw a flash of white light. Sovereign Zhu Yao who was still at the grandstand earlier, suddenly appeared on the ring, with Yu Luo in her hands. Just as the referee was about to exclaim out due to the deep bonds between master and disciple, he heard that Sovereign mutter out loudly.</p><br/><p>“The hell!”</p><br/><p>Looking at the ‘BUG’ letters that were becoming darker and darker on Yu Luo’s face, Zhu Yao even began to feel like cursing out. Momma’s egg, why the hell was it happening now? Wasn’t the night tomorrow the promised day?</p><br/><p>Why was it beginning now?</p><br/><p>No, she definitely could not allow that female antagonist to succeed in her body-takeover. She had raised up a ripe and red little radish, and she could not allow her to turn into a black radish.</p><br/><p>Zhu Yao carried Yu Luo who had already fainted, and flew up into the air. She casually picked up Zi Mo, who was still thinking how incredible his own daughter was, from the grandstand as well. And with her quickest speed, she returned to Jade Forest Mountain.</p><br/><p>“Little… Little martial aunt?” Zi Mo had no clue what was happening. Why did she suddenly capture him? Looking at how she was placing his daughter on the bed with an anxious expression, Zi Mo heaved a sigh of relief, and said. “Martial aunt, don’t worry. My daughter is only tired, she simply has to rest for a moment…”</p><br/><p>“Her body is being taken over.” Zhu Yao coldly said.</p><br/><p>“What?” Zi Mo’s expression paled, and instantly, his voice trembled slightly. “How is that possible? I don’t sense any other Nascent Soul presence anywhere.”</p><br/><p>If one wanted to take over someone’s body, one had to first cultivate to the Nascent Soul stage. Otherwise, it would be basically impossible for that person’s soul to freely leave one’s body.</p><br/><p>Zhu Yao coldly stared at him. Just how was he acting like a father?</p><br/><p>Zi Mo was a little flustered as well. Looking seriously at his own daughter’s state, it was indeed a little abnormal. It seemed like her aura was becoming weaker. Could it be a Nascent Soul practitioner was really devouring her soul?</p><br/><p>“What… What should we do?”</p><br/><p>If I knew, why would I bother bringing you here?</p><br/><p>Zhu Yao stared at him. An outsider was basically unable to do anything in situations like this. A body-takeover, or soul-devouring, ultimately, was a contest between two souls. Souls were enigmatic things, and outsiders were basically unable to do anything, other than watching who had the strongest will to live between them.</p><br/>\n</div>"}