{"title": "Chapter 108: The Twins within the Ice", "id": 108, "volume": 2, "url": "http://boxnovel.org/my-disciple-died-yet-again-chapter-108-the-twins-within-the-ice", "volume_title": "Volume 2", "body": "<h1>Chapter 108: The Twins within the Ice</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 108: The Twins within the Ice</p><br/><p>The hell, just what the hell was that? Ever since she became a Demigod, it had been a long time since she was injured. Yet, right now, because of just a single glance by that shadow, her divine sense was actually damaged.</p><br/><p>Zhu Yao took a deep breath to gather her calm, and she finally felt better after a few moments. This time, she no longer dared to peek. That shadow was evidently Mu Meiyan’s ultimate cheat. It was too heaven-bending, wasn’t it? Fortunately, earlier, she had intentionally her aura, otherwise, she would have been exposed.</p><br/><p>Zhu Yao took an entire night to completely heal herself. On the early morning of the second day, Qi Han came looking for her.</p><br/><p>When he came, Qi Han said it very clearly, that he had invited her to save his own disciple. Zhu Yao was also faintly making guesses as well. She wondered if that person was actually Yue Hanxin, who was also the Mu Meiyan’s main target of attack in the upcoming world war after her rebirth.</p><br/><p>Qi Han spoke with her courteously for a while, before bringing her to the rear mountain of Celestial Indus Sect. Compared to the all-year spring season in Ancient Hill Sect, the flaming heat at the front of Celestial Indus Sect was a little over the top, while the rear of the mountain was actually a piece of glacier. Zhu Yao, as someone who believed in Science, was basically unable to understand this scenery.</p><br/><p>Qi Han brought her to the topmost place above the glacier. There was actually a gigantic lake there, and what’s strange was that the lake was not frozen, but of course, it wasn’t a hot spring either.</p><br/><p>A giant iceberg was floating above the lake surface, and something could be faintly seen circulating inside. It looked colorful, and very beautiful.</p><br/><p>However, Qi Han simply stopped at the lakeside. Just as when Zhu Yao was feeling puzzled, he pointed to the iceberg in midair.</p><br/><p>“The one frozen inside, is my disciple.”</p><br/><p>Zhu Yao was a little startled. Using her divine sense to inspect it, she realized there really was a presence of a live human being inside. However, it was very small and weak, it would be impossible to sense if she had not looked carefully. The most important thing was, the person was completely formless inside.</p><br/><p>Zhu Yao silently cast a suspicious glance at him. This is considered human as well? Are you kidding me?</p><br/><p>Only then did Qi Han sigh deeply, and he answered without a rush. “Actually, my disciple has yet to be born.”</p><br/><p>Eh? Mind speaking the human language!?</p><br/><p>“My old friend fell into a crisis. When I rushed over, him and his wife had already been gravely injured.” Qi Han’s expression sank. “With my old friend’s last breath, he retrieved the infant that was still alive from his wife’s womb, and used a type of ancient Mystic Art to seal the infant inside this iceberg. He then had me place it in this place, so as to give the child form with the aid of formations. It had already been five years since then.”</p><br/><p>The hell, such a thing was possible? This was more advanced than modern technology, hey. They did not even need a surrogacy arrangement. Zhu Yao was dumbfounded at this entire world. She had only heard of plants that could grow without soil, but she never expected that humans could too.</p><br/><p>Zhu Yao silently felt as though there were traces of her three views collapsing.</p><br/><p>“However, at the moment when everything was supposed to bear fruit…” Qi Han frowned, and simply stared at that gigantic iceberg.” However, the infant has yet to be born, and the child’s presence is instead, becoming weaker. Right now, the infant’s presence could no longer be sensed at all, thus, I invited Sovereign to help investigate this matter.”</p><br/><p>Zhu Yao gave a face behind his back. In the end, she was pulled here to deliver a child. She was trained in technology, not gynecology, hey.</p><br/><p>Zhu Yao suppressed the impulse to shout out in the depth of her heart, and looked at that iceberg once again. Qi Han said he was completely unable to sense any presence, however, she was sure that there was indeed a living person in there. The presence was simply very weak and small.</p><br/><p>After flying up in the air and giving that iceberg a closer inspection, she found out that the formation was indeed very intricate. It was like an automatic supply unit, endlessly, and constantly inserting nourishment into the iceberg.</p><br/><p>Among them, there was a large amount of ice spiritual energy currently inserting into the iceberg.</p><br/><p>As Qi Han had said, there were no problems with this formation at all? Though it did kind of ruin her three views. However, theoretically speaking, there shouldn’t be any problems.</p><br/><p>But why was the infant’s presence becoming weaker?</p><br/><p>Did you add a defensive formation to this formation?” Zhu Yao asked. Could it be that the infant was being blocked and could not come out?</p><br/><p>Qi Han nodded. “However, this defensive formation, is only able to block attacks from the outside. If there’s any movements inside the iceberg itself, it can naturally break free from the formation.”</p><br/><p>Zhu Yao sank into silence, and for a moment, she could not understand what was wrong. Even if she used her divine sense to inspect the interior, she was only able to catch a few hints of uncertainties, and a strand of a weak presence. Forget about a formed infant, she was not even able to sense a physical body.</p><br/><p>Heaving a sigh, just when Zhu Yao was planning on giving up, she suddenly saw a red spot of light entering the ice, which instantly disappeared without a trace the next moment.</p><br/><p>That was fire spiritual energy! Could it be…</p><br/><p>“You said that this infant has been growing for five years?” Zhu Yao turned and asked.</p><br/><p>Qi Han nodded. “Yes, the infant should have taken form after ten months, yet, the child still have not been born, even though the child’s still alive. From beginning till now, it’s been five years.”</p><br/><p>“The hell!” Zhu Yao cursed. She found out the reason. “Follow me!”</p><br/><p>Zhu Yao pulled Qi Han over, and then, according to several direction positions on the lake, she had him set down a different type of formation on each of them, though, all of them were the same spiritual energy guiding formations. The only difference were the type of spiritual energy each formation was drawing in.</p><br/><p>When the spiritual energy guiding formations for Metal, Wood, Water, Fire and Earth, five different elements, were completed, Zhu Yao had Qi Han activate the formations with her. The surrounding five types of spiritual energy thus began to be drawn into the center of the lake.</p><br/><p>Zhu Yao then added a spiritual energy convergence formation at the top of the iceberg. She was unable to determine what kind of Spiritual Vein the child inside possessed, so she did not dare to use formations that were too powerful in strength. Hence, the convergence of spiritual energy were at a very slow pace as well.</p><br/><p>The first to be drawn in was fire spiritual energy. As expected, that red spot of light, entered the iceberg right after making contact. And, that presence that could only be barely sensed earlier, suddenly strengthened.</p><br/><p>Qi Han sensed it as well, and he stared with eyes wide open. “Sovereign, this… What is going on?”</p><br/><p>He never expected that, after thinking of countless ways, a few spiritual energy guiding formations could have actually solve the problem.</p><br/><p>Zhu Yao sighed, and simply gave a bland reply. “The child inside is not an Ice Spirit Vein holder.”</p><br/><p>Actually, the reason why the infant had yet to be born was very simple. This spiritual infant had always grown by being fed with spiritual energy, hence, during the child’s birth, the child would naturally require the nourishment from spiritual energy. However, the child’s Spirit Vein was different, while this iceberg was filled with only ice spiritual energy. Before it had taken form, it was still alright, however, after taking form, the infant’s Spirit Vein would have formed as well. If the infant did not possess the Ice Spirit Vein, naturally, the infant would be unable to take in ice spiritual energy. And as the rest of the spiritual energy particles were pitifully low in number and scarce, naturally, the infant’s presence would weaken.</p><br/><p>Earlier, she saw a spot of fire spiritual energy being absorbed into the iceberg, so the person inside, at the very least, possessed the Fire Spirit Vein. However, she was simply afraid that the infant did not just possess the Fire Spirit Vein, hence, she set down all five spiritual energy guiding formations.</p><br/><p>After hearing her explanation, Qi Han finally understood as well, and a smile had already begun to surface on his face. At the same time while he was controlling the formations, he stared tightly at the iceberg in the center, so that he could strip apart the corresponding formation at the very moment he realize that there was an incompatible spiritual energy.</p><br/><p>After the fire spiritual energy, metal spiritual energy had begun to gather as well. Like the fire spiritual energy particles, the metal spiritual energy particles went inside the moment they made contact with the iceberg.</p><br/><p>Metal and Fire Duo-Spirit Veins? Joy appeared on Qi Han’s face. This was an extremely great potential.</p><br/><p>However, the next moment, wood spiritual energy entered the iceberg as well.</p><br/><p>Could it be that the child possessed the Metal, Fire and Wood Tri-Spirit Veins? Mn, it was still acceptable.</p><br/><p>However, immediately after, earth and water spiritual energy completely, and without restraints, were absorbed into the iceberg as well. Qi Han’s expression became a little ugly.</p><br/><p>He was almost unable to regain his senses. Could it be that his disciple who had yet to be born, actually possessed the trash Penta-Spirit Veins? This blow was simply too big.</p><br/><p>After painstakingly waiting for five years, he was back at where he started.</p><br/><p>In her heart, Zhu Yao silently lit a candle for this master who had been taken advantage as well. Look at you, see what happened after you take a disciple in such a hurry? Tragic, right? However, after recalling that her own Azureflight Sect had a bunch of little radishes with Penta-Spirit Veins, her feelings instantly balanced out again.</p><br/><p>However, in her dream, she clearly remembered that Yue Hanxin, similar to Mu Meiyan, possessed the mutated Ice Spirit Vein as well. Could it be that the person inside was not the Mary Sue Yue Hanxin? Or could it be that because Mu Meiyan did not succeed in taking over little radish, it had brought about a butterfly effect?</p><br/><p>However, in her dream, the first time Yue Hanxin stepped into the stage, was as a ten-year-old girl, who had been brought up to the mountain by Qi Han himself. There wasn’t even this part where she was sealed in ice as a spiritual infant. If Qi Han himself had not called the person inside the iceberg his disciple, she would not have thought that the spiritual infant inside the iceberg was Yue Hanxin.</p><br/><p>Zhu Yao really couldn’t understand, and she could only sense the presence that was getting stronger in the core of the iceberg.</p><br/><p>After finding out that the infant could take in all five spiritual energy, Qi Han strengthened the spiritual energy guiding formation. The surrounding spiritual energy was endlessly pouring inside, and the presence inside became firmer as well.</p><br/><p>‘Kachak.’ Six hours later, finally, a breaking sound could be heard from the iceberg.</p><br/><p>Zhu Yao instantly stopped the spiritual energy guiding formations below, and, along with Qi Han, they stared at the iceberg above that was already beginning to break apart. Crack lines began to grow inch by inch on the gigantic iceberg, and not even a moment later, it was completely filled with cracks.</p><br/><p>A shattered piece of ice, that was about the size of a palm, fell from above. At that moment, as though they had received a signal or some sort, the rest of the pieces of ice began to fall one after another as well.</p><br/><p>While inside that iceberg, which she could only blurrily sense earlier, as though a door had been opened, she could already completely see the figures inside clearly.</p><br/><p>However… The hell, why were there two!?</p><br/><p>As the iceberg completely fell, the two little figures inside followed after as they fell straight down. That was a pair of twins, one male and one female. Their figures however, were not weak little infants, but children of about five years of age.</p><br/><p>Qi Han flew up, instantly grabbed onto the girl, and looked dumbfoundedly at her while she was in his embrace.</p><br/><p>The hell, there’s still another one?</p><br/><p>Zhu Yao simply felt like cursing out. At this moment, what the hell was he being in a daze for!?</p><br/><p>Without a choice, Zhu Yao could only fly over as well. At the moment the boy was about to fall right into the waters, she fished him up, and returned to the lakeside.</p><br/><p>It was unclear if it was because he had been sealed in the iceberg, but the child’s body was entirely wet, with his eyes closed. His figure, however, was extremely small and frail, and his skin could basically be seen to be merely wrapping his bones. If she had not known he had been sealed in ice for five years, just by his bony figure, she would have definitely believed he was not even three years old.</p><br/><p>Zhu Yao cast a Dirt Removal Art on him. After pondering for a moment, she once again took out a set of clothes from her ring, and covered him with it.</p><br/><p>When Qi Han returned, he incidentally saw it, and he looked as though he had only just recalled that he had to give his disciple clothes as well. Hence, he retrieved a pink-colored set of clothes. Most probably, he had long prepared it for her.</p><br/><p>“Sovereign.” Qi Han looked at the child in her embrace, and a hint of guilt surfaced on his face, as though he was a little regretful for not catching him earlier. “Back then, when my old friend sealed the infant, the child was already seven months in. I have investigated as well, and there was only a single female infant. However, I really never expected that there were actually two.”</p><br/>\n</div>"}