{"title": "Chapter 110: A Beast Responds with a Single Call", "id": 110, "volume": 2, "url": "http://boxnovel.org/my-disciple-died-yet-again-chapter-110-a-beast-responds-with-a-single-call", "volume_title": "Volume 2", "body": "<h1>Chapter 110: A Beast Responds with a Single Call</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 110: A Beast Responds with a Single Call</p><br/><p>After looking at the child again, Zhu Yao retreated from the room. Actually, the main reason why she was here, was because of Yue Hanxin. Theoretically, the birth of that bug was due to the conflict between her and Mu Meiyan. Both parties were responsible, hence, at first, she had thought that Yue Hanxin was a bug as well. Fortunately, Yue Hanxin’s face was very clean, and there wasn’t a single letter on it.</p><br/><p>In other words, she only had to focus on defending against Mu Meiyan. Initially, she had wanted to shamelessly stay for a few more days, as, it would have been best to deal with the root of the problem. However, after seeing that shadow behind her, she changed her mind.</p><br/><p>That strike on that night, she felt that she was unable to hold on at all.</p><br/><p>But, just what the hell was that shadow behind her?</p><br/><p>It would have been great if her master was still around, and she would be able to ask him about it. Currently, she had no choice but to beat around the bush and ask Zi Mo.</p><br/><p>Zhu Yao summoned her flying sword. After pondering for a moment, she still took out a talisman, and turned it into a voice-transmitting paper crane. It contained her instructions to have Qi Han take good care of the children, and that she would be leaving. Only then did she leave the place with her flying sword.</p><br/><p>The Celestial Indus Sect was at the corner of a forest, and this forest was even the territory of demonic beasts. The deeper she went, the more demonic beasts there were. And at the core of the forest, was the Demonic Realm. According to legends, it was a place where only demonic beasts lived.</p><br/><p>No humans had ever went there, because there was a Realm River at the center. The Realm River was a sort of magic seal, which prevented all deity practitioners from exerting even the tiniest bit of spiritual power. The same went for demonic beasts as well. However, humans simply could not compare to the demonic beasts’ huge size. In terms of advantages, they were stronger than humans, and were capable of squashing a few humans simply by sitting down. Hence, seemingly no practitioners would head over there to court death.</p><br/><p>Initially, Zhu Yao had wanted to return to Ancient Hill Sect, and she must definitely pass by this small forest along the way. However, just after flying over, she suddenly changed her mind.</p><br/><p>Because she recalled a scenario, which was related to that magic seal.</p><br/><p>Hence, she turned around and flew towards the depths of the forest. After Mu Meiyan was reborn, the reason she was able to go against Yue Hanxin, other than the Wu Song who had trained in the devillic ways, there was another huge force that helped her. It was that deity who had fell into a crisis. Even though he was unable to stand the Heavenly Laws, and had fallen, the celestial tools and celestial pellets were a huge help to her.</p><br/><p>Those were all items that belonged to the Higher Realm, and their destructive powers were beyond astonishing. The mystic tool called Mythfire, that destroyed Ancient Hill Sect back then, was able to release out black flames, which could not be extinguished with just Mystic Arts. Naturally, the flames spread with the help of the wind, and after blazing for a single day, not even a single disciple was left alive in Ancient Hill Sect. Even the surface of the ocean had sank by quite a bit.</p><br/><p>While Mu Meiyan, who had possessed little radish, believed that this action of hers was just, as she beautifully claimed that it was to exact revenge for the former owner of her body.</p><br/><p>Completely destroying her home, that’s not exacting revenge, but repaying kindness with hatred, right?</p><br/><p>This was also one of the reasons why Zhu Yao would even risk her life to prevent her from devouring little radish.</p><br/><p>This forest was very large. Even when she flew with all her might, she had to spend two hours to reach the borders of the core area. From afar, she could see a huge silver-colored river appear before her eyes. Before Zhu Yao could even sigh at how magnificent and imposing it looked…</p><br/><p>She instantly fell from the sky.</p><br/><p>The hell, she had forgotten that there was a magic seal here.</p><br/><p>Suppressing the dullness in her the depths of her heart, her body instantly became very heavy. It’s been many years since she felt this way. Zhu Yao thus could only accept her fate and take a fews steps back. Just by moving a little, the pressure on her body instantly relaxed, and her energy once again returned to her body.</p><br/><p>Such a mystical place.</p><br/><p>Zhu Yao glanced at the river bank in front, as huge piles of branches and leaves were pushed to the riverside. She could vaguely see that there were even bones of some demonic beasts. She remembered that when Mu Meiyan was at the Azoth-stage, she arrived at the side of this river. On that day, a piece of jade fell from the sky, and inside that jade contained the deceased soul of the deity who fell into crisis.</p><br/><p>Initially, she had thought of setting down Afterlife formations. When that jade fell, the formations would instantly send the deity into reincarnation. Naturally, he would no longer have the opportunity to gift the celestial tools and celestial pellets.</p><br/><p>But this river was so humongous, only a ghost would know where the piece of jade would land.</p><br/><p>Zhu Yao felt deeply saddened.</p><br/><p>Just when she did not know what to do, suddenly, a ‘rooooar~~’┗|｀o′|┛came from a demonic beast behind her.</p><br/><p>With a pair of bloodshot eyes, it stared intensely at her, while it continued to drool from his mouth, as though it was looking at something delicious.</p><br/><p>It was actually a ninth-ranked demonic beast.</p><br/><p>It’s strength was comparable to her, who was at the elementary levels of a Demigod.</p><br/><p>Of course, theoretically, that’s true.</p><br/><p>In actual fact, Zhu Yao simply had to release her aura.</p><br/><p>That demonic beast let out a meow, as though it had been frightened, it laid on the ground, trembling. And it seemed to have been choked by its own drool, as it looked as though it wanted to cough, yet, did not dare to. Its long tail desperately slapped onto its own chest.</p><br/><p>“……”</p><br/><p>Were all demonic beasts so stupid?</p><br/><p>Zhu Yao silently recalled a certain second-rate. Alright, they were all as stupid.</p><br/><p>Currently, she did not have the mood to care about this dumb demonic beast, and simply stared at the plain river bank in front, thinking of how she could destroy the cheat of the female antagonist forever. For a moment, she had forgotten to retract back her dragon’s aura.</p><br/><p>When she regained her senses, a bulk of demonic beasts, squeezed together and sat behind her. When Zhu Yao suddenly turned her head around, she was given a shock. She had even thought that something went wrong with the way she turned her head.</p><br/><p>Where did this group of demonic beasts pop out from?</p><br/><p>A elegant-looking white-clothed man walked out of the crowd of demonic beasts, and with a respectful attitude, he deeply bowed towards her. “Lord, what instructions do you have for calling us here?”</p><br/><p>“Who called you!?” Even Zhu Yao herself was shocked, alright?</p><br/><p>That man’s face suddenly reddened, as though he was looking at her a little embarrassingly, before he spoke up. “We have sensed Lord’s presence, so… I wonder what instructions the Lord have for us? Your subordinates will definitely do it without hesitation.”</p><br/><p>The man’s pair of eyes shone, revealing an excited expression that was completely similar to Sesame’s, as though it was high on drugs. Even the crowd of demonic beasts behind him were the same. Although they were crawling on the ground, submissively and respectfully, their eyes were all staring straight and intensely at her. With sparkles and colorful luster, you know?</p><br/><p>Lord, look at me, look at me!</p><br/><p>The corner of Zhu Yao’s lips twitched, and her face darkened. At that instant, the depths of her heart were filled with retorts, yet, she did not know where to speak up from. The hell with ‘without hesitation’!?</p><br/><p>“Lord…” Seeing that she wasn’t saying anything, the man suddenly knelt down, and his entire figure was even about to lean onto the ground. With an excited expression, he spoke. “This little one is named Chen Ning, and have no one to rely on since young. Lord, please take in this little one to serve you by your side.”</p><br/><p>When these words fell, all of the surrounding beastly eyes shifted with a ‘shuaa’ sound, and they all stared at him, all of them carried expressions as though they hated they could not strangle him to death right now. Such a shameless little one, he actually dared to say such disrespectful words. However, why didn’t they think of it?</p><br/><p>All of them grinded their teeth…</p><br/><p>Chen Ning turned around, looked at the crowd of demonic beasts with narrow eyes, and gave them a provocative smile. This one has already said it, if you have the guts, come and bite me. Lord, look at me once more.</p><br/><p>The corner of Zhu Yao’s lips twitched, as she looked at that person who was attached to the ground. Are you trying to fool ghosts? Find me a demonic beast which had someone to rely on!</p><br/><p>Heaving a sigh, only now did she guess that this person who called himself Chen Ning, was at least a tenth-ranked demonic beast who had transformed himself.</p><br/><p>Zhu Yao retracted her aura, and waved towards to the black mass of demonic beasts. “All of you, return to where you come from. I don’t have anything to request of all of you.”</p><br/><p>When these words fell, Zhu Yao instantly felt the depressed atmosphere around her, and their sadness and frustration. Only after a moment did the beasts unwillingly began to crawl up. Taking their time with their steps, it looked as though they were waiting for her to change her mind.</p><br/><p>Most probably because this place was close to the Demon Realm, the demonic beasts in this forest were mostly big and strong. Just by this crowd alone, there were about eight tenth-ranked demonic beasts, and the weakest was an eighth-ranked. Other than the human-transformed Chen Ning, all of them were beastly figures with great height, and when they moved, it felt as though mountains were moving.</p><br/><p>And she really couldn’t figure out how they managed to sneak up behind her.</p><br/><p>Zhu Yao sighed. Looking at the riverbank in front of her, she suddenly had an idea. Since the jade fell on this riverbank, then what if there wasn’t a riverbank?</p><br/><p>“Wait a minute!”</p><br/><p>The moment Zhu Yao called out, the demonic beasts which were in the process of scattering apart, instantly crawled back. Their eyes were instantly much brighter than before.</p><br/><p>“Lord, what instructions do you have?” Chen Ning had even leaned onto her, and looked as though he hated that he could not hug her thigh at that very instant. After being coldly glanced at by her, it then obediently took a few steps back, before kneeling onto the ground once again.</p><br/><p>“…” Uh… There’s no need to be this disciplined, right?</p><br/><p>“I do indeed have a matter to trouble all of you.”</p><br/><p>When her words fell, a series of responses immediately came from below.</p><br/><p>“Lord, please tell us.”</p><br/><p>“Lord, give us your instructions.”</p><br/><p>“Even if we have to die, we will do it without any hesitation.”</p><br/><p>“Rooar~~”</p><br/><p>Zhu Yao’s expression darkened as she looked at this crowd of overly enthusiastic demonic beasts. Although she knew that the reason why they saw her as their Lord was because of the suppressive ability of her dragon bloodline, she still could not relax in the depths of her heart. After all, she once had the experience of almost being bitten by a demonic beast to death.</p><br/><p>“It’s nothing much. I simply think that this river is too narrow…” Zhu Yao activated her ‘spouting lies with widened eyes’ mode. “Ahem… Such a beautiful river, yet, it has such an ugly river bank. I think that it’s actually affecting the beauty as a whole. Hence, I wish to dig the riverbank a little deeper, and expand the river a little.”</p><br/><p>The moment she said that, even Zhu Yao felt that this reason was absolutely bullshit. And that place was where the magic seal was, even she did not dare to enter it herself, let alone this crowd of demonic beasts. It would be strange for people to accept her request, right?</p><br/><p>“I see, Lord, what you said makes so much sense.”</p><br/><p>“I have long seen this riverbank as an eyesore.”</p><br/><p>“That’s right, it’s ugly as hell. It basically isn’t worthy of being called a riverbank.”</p><br/><p>“It’s so ugly, it worsens all of our mood! Dig it away!”</p><br/><p>“Right, dig it away!”</p><br/><p>Zhu Yao: “…”</p><br/><p>The hell, all of you actually believed it. What happened to the promised integrity? And the three views? Just because you people aren’t humans, it doesn’t mean you can simply abandon them, hey.</p><br/><p>Zhu Yao almost could not hold onto her drooping jaw. That crowd of demonic beast actually walked towards the riverbank on their own accords, and began to dig the sand. And, every single one of them looked as though they harbored intense hatred for the riverbank, as all of them were digging furiously with all of their might.</p><br/><p>Even that Chen Ning had leapt over. When it landed on the ground, it had turned into a giant demonic beast with four claws. Stretching its two front claws, it began to dig with all its might.</p><br/><p>In an instant, sand and dirt filled the air, and the riverbank which was completely quiet, with no presence of anyone earlier, was now filled with beastly figures.</p><br/><p>“Umm… Don’t dig it too deeply. It just has to be leveled with the river floor.” Zhu Yao could not help but remind them.</p><br/><p>Right after, were the series of roaring responses.</p><br/><p>Currently, Zhu Yao’s feelings were hard to describe.</p><br/>\n</div>"}