{"title": "Chapter 134: Your Sister’s a Devil", "id": 134, "volume": 2, "url": "http://boxnovel.org/my-disciple-died-yet-again-chapter-134-your-sister%E2%80%99s-a-devil", "volume_title": "Volume 2", "body": "<h1>Chapter 134: Your Sister’s a Devil</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 134: Your Sister’s a Devil</p><br/><p>The two people had never expected that the Five Elemental Heavenly Lightning they especially requested from the Lightning Divine Hall, was unable to completely stop the Devil from resurrecting. And, it was even at the moment when the World Purification Saint Talisman had yet to completely activate. The most important thing was, that strange green light had even dispersed the heavenly radiance of ascension.</p><br/><p>When the heavenly radiance disappeared, the two honorable Deities who came from the Higher Realm received a backlash from the Heavenly Dao, as they puked out blood one after another. And, their cultivation which was still unclear earlier, had begun to regress at an astonishing speed. From the cultivation of a Gold Deity, their cultivation fell into the Demigod-stage, and they were still regressing from there. The heavenly gate had instantly closed as well. This was the Heavenly Dao. Although it was unknown how they opened the heavenly gate and kept their cultivation when they descended into the Lower Realm, this world did not allow people from the Higher Realm in the first place. Hence, as long as the heavenly radiance of ascension disappeared, the Heavenly Dao would naturally revert them back to the cultivation that was suitable for this world.</p><br/><p>“Heheheheh…” A sinister laughter sounded. The white-clothed man who was still quietly sitting within the green light earlier, had stood up. The green light had already begun to slowly recede. A pair of crimson red eyes flashed with a cold light, and the prison of light which enclosed his vicinity, stopping him from absorbing the devil aura earlier, was currently shattering bit by bit. His long hair fluttered in the wind, and although his eyes were crimson red, the aura being emitted out from his body was astonishingly cold, as he carried a sinister smile on his face.</p><br/><p>Zhu Yao’s heart clenched. Without even thinking, she turned around and summoned her Sword Intent. Circulating all of the spiritual energy in her body, she attacked him with all her might.</p><br/><p>That man, however, simply slightly raised the corner of his lips, and his entire being became even darker than before. Stretching out a single hand, with a simple flick of his finger, that lightning phoenix Sword Intent which Zhu Yao had poured all her spiritual energy into, was dispersed.</p><br/><p>Zhu Yao could no longer bring out even the least bit of spiritual energy from her body. If Sesame had not caught her in time, she would have already fallen into the sea. She had never felt so powerless before, and in the depths of her heart, a word surfaced – Crap.</p><br/><p>That Devil called Phantom smiled even more sinisterly. In a flash, he appeared three steps away from her. Zhu Yao had already made the preparations to die. As expected, he shot out his feet, and pounced towards her. With his leg, he kicked Sesame away, and then…</p><br/><p>Hugged her thigh…</p><br/><p>Eh?</p><br/><p>“Lord~~~~~” A voice which carried a slight vibrato sounded. Phantom knelt on his knees in front of her, and began to crazily rub against her leg. “Lord, this little bunny really likes you.”</p><br/><p>Zhu Yao: “…”</p><br/><p>Sesame: “…”</p><br/><p>Everyone: “…”</p><br/><p>“Lord, lord… Do you like little bunny?” Rub, rub, rub.</p><br/><p>Your sister’s a bunny! Just what kind of godly development was this!? Who could explain this situation for me, hey?</p><br/><p>“You… You… You…” Zhu Yao could not find any words to say for a moment. “Aren’t you Phantom? Aren’t you one of the Devil Race?” Hey, stop playing already. At such a tense moment, what’s with the occurrence of such an unexpected drama?</p><br/><p>The man, who was currently hugging her thigh with all his might, blanked for a moment. Raising his head, with a pair of eyes that was sparkling with starlight, he looked at her with an excited expression. “Lord, you know this little bunny’s name? Little bunny is so happy!”</p><br/><p>Your sister’s happy! Just what the hell was this thing?</p><br/><p>“Sovereign?” The rest of the people were all carrying dumbfounded expressions. After glancing at Zhu Yao, they then glanced at that lunatic man who was rubbing her thigh. “You… He… Just what is…”</p><br/><p>“I don’t know either!” Zhu Yao suddenly had the urge to jump into the sea and commit suicide. Looking at the Devil beneath her who had evidently read the wrong script, she really wanted to blind her eyes on her own.</p><br/><p>Wait a minute. This scenario somehow felt a little familiar. In this world, those who would call her lord without even questioning anything, seemed to only be…</p><br/><p>“Your body’s a demonic beast?”</p><br/><p>Phantom nodded. Then, he once again called out. “Lord~~”</p><br/><p>“Then, what’s your main body?”</p><br/><p>Phantom blanked for a moment, before showing her a smile. His body lighted up, and in an instant, a gigantic rabbit in front of Zhu Yao. It was so big, it was just about to reach the top of the sky. In a blink of an eye, the rabbit once again disappeared, reverting back to the white-clothed man. He continued to hug her thigh, and as he rubbed against it, with a satisfied expression, he called out. “Meow~”</p><br/><p>Your sister meows. Be a proper rabbit, hey.</p><br/><p>Why did a good and healthy Devil suddenly turn into a rabbit? Why was a good and healthy divine body a demonic beast? What happened to the promised White Rabbt Divine Residence?</p><br/><p>Wait a minute. That Divine Residence seemed to have come from a distant era, so the Deity must have fallen many years ago. Hence, having some missing letters in the name plate could be understood as well. Then… White Rabbt… White Rabbt… The hell, it’s White Rabbit. A single letter had fallen off. This was a Rabbit Deity’s Divine Residence, so it’s understandable for the main body to be a rabbit. Hence, Devil = Rabbit Deity = Demonic Beast. And, she was a Dragon, thus – Bloodline suppression.</p><br/><p>Uhh…</p><br/><p>She had to say, this Rabbit Deity had perfectly made a fool out of this Devil.</p><br/><p>“Lord, let this little bunny become your contracted beast, alright?”</p><br/><p>“No!” As a big man, you’re calling yourself a little bunny. Don’t you find it embarrassing?</p><br/><p>“Lord~” Its vibrato continued.</p><br/><p>“Shut up!”</p><br/><p>She could sense the evil intentions of the entire world. Tell me, just how overpowered is the suppression of the Dragon Race’s bloodline?</p><br/><p>“You… Could it be you’re a Devil as well!?” One of the honourable Deities who was still extremely overbearing earlier, pointed at Zhu Yao with a fearful expression. That Devil actually called her lord. To have a Deity refer someone as his lord, that person could only be the Lord of Devils of the Devil Realm. Could it be that the Devil Race had all re-emerged? “She’s a Devil as well. Quick… Quick, kill her. Why are you people still not making a move!?”</p><br/><p>The honorable Deity who had regressed into a late-stage Nascent Soul practitioner, had long been suppressed by the remaining people. However, he still did not give up and tried to overturn the situation. Unfortunately, no one batted him an eye.</p><br/><p>Their actions of exterminating the world earlier had already angered everyone, and that purple gold talisman was not stopping either, so who would listen to him?</p><br/><p>Zhu Yao simply replied him with this: “Hoho.”</p><br/><p>Don’t open the hole in your brain too wide, young man!</p><br/><p>“Junior-martial Yu, what is this Devil…?” Feng Yi looked at her with a confused expression.</p><br/><p>“I don’t understand either.” Zhu Yao replied honestly. “But, I can ascertain that, he will no longer cause any harm to this world.”</p><br/><p>“…” Feng Yi still looked confused.</p><br/><p>Zhu Yao raised her head and looked towards the purple gold talisman in the sky, which was still constantly dispersing itself. Her brows knitted deeply. A talisman that could destroy the world…</p><br/><p>“Phantom!” Zhu Yao pulled up the “former” Devil who was still kneeling and hugging onto her thigh. Stretching her hand, she pointed at her core, and said with emphasis on every word. “As the name of your lord, I command you. From today onwards, your soul is not allowed to leave this body, nor are you allowed to harm the lives of anyone else, until the collapse of the Three Realms and re-descent of chaos.”</p><br/><p>A ray of golden light was shot into the center of his forehead. Phantom blanked, and only a moment later did he take a step back, and gave her a deep bow. “This subordinate obeys.”</p><br/><p>Using her blood essence as a guide, she placed down a blood contract, which all demonic beasts were unable to retaliate against. Since the Dragon’s bloodline could suppress the Devil’s natural personality, then, with this order, he wouldn’t be able to disobey it as long as he was still alive.</p><br/><p>Although the Devil had been settled with, if that talisman, which was exterminating the world, did not stop, the world would still end. However, how possibly could a talisman, which had already been activated, be stopped before its completion? Zhu Yao took a deep breath. She had no choice but to take a gamble.</p><br/><p>With her head raised, she looked towards the talisman. “Sesame.”</p><br/><p>Circulating her own aura, Zhu Yao instantly transformed into her dragon form, while Sesame had returned to her divine sense region at the same time as well.</p><br/><p>At that moment when her true form was revealed, everyone was dumbfounded. With expressions of disbelief, they looked towards the body of the dragon which was huge enough to connect the sky and earth. If earlier, there were still suspecting her identity, then at this moment, all doubts had been dispelled.</p><br/><p>“Dra… Dra…” The two suppressed honorable Deities were even more dumbfounded. They had never expected that, not only the woman who they were still suspecting earlier, wasn’t a Devil, she was actually his arch-nemesis as stated in the legends – a God!</p><br/><p>The entire world had completely turned purple. The world-exterminating talisman had been completely activated. A fierce gale blew, and debris flew into the air. A golden light shone at the center of the talisman, as some sort of a great and strong energy was being poured out from the inside. Just as it was about to explode in all four directions, Zhu Yao had already flown her tough dragon body above the talisman.</p><br/><p>“Omnom!” And she swallowed it up in an instant.</p><br/><p>Naturally, she was unable to digest it. However, at the very least, she was a dragon. Even if she did not receive an inheritance from any of the God Race, her body was still as tough as the original’s. But, in the end, it was a power capable of exterminating a world, no matter how tough her body was, it was impossible to completely resist it. Hence, she could only stare as the talisman exploded inside her body. She could only look on as her own blood and flesh scattered, the leaked energy waves spread throughout the four directions, and a volume of water in the sea instantly disappeared, spreading outwards in a circular shape. Everything only stopped when all of the water in the sea had been swept empty by the energy waves.</p><br/><p>And then, she once again saw that low-down chat window.</p><br/><p>“Congratulations. You have cleared four stages. Please choose the following options: [Resurrect] or [Resurrect] or [Resurrect].”</p><br/><p>Flips table.</p><br/><p>Is there any meaning in showing three identical options? Is there any meaning at all?</p><br/><p>Furious, she felt like bashing someone up. Zhu Yao took a deep breath. Glancing to the side, although the entire sea had completely dried up, at the very least, she had stopped the world-exterminating talisman from destroying the world. Hence, she casually tapped on [Resurrect].</p><br/><p>The view in front of her instantly darkened. She had once again returned to that completely dark world where only a single loading bar remained.</p><br/><p>Her heart suddenly twitched for a moment, as though something that had been covered up all this while, was lifted out. For a moment, she felt as though it was a little hard to breathe.</p><br/><p>Looking at that loading bar which was just about to reach its last stretch, Zhu Yao took a deep breath.</p><br/><p>“Realmspirit, I know you’re there. Come out for a moment, let us talk about life.”</p><br/><p>The loading bar paused, and stopped at the 99% position. As though the ‘pause’ key had been pressed on, her surroundings were unnaturally quiet.</p><br/><p>“Stop hiding already. I know it’s you, so you best come out now!”</p><br/><p>A moment later, that loading bar flashed, and instantly disappeared. Then, in the boundless black world, the sound of a bell suddenly rang, and a window popped out.</p><br/><p>A QQ Chat Window.</p><br/><p>…</p><br/><p>Realmspirit: Hey dear. Long time no see, dear. Did you miss me, dear?</p><br/><p>Zhu Yao suddenly had the urge to curse out.</p><br/><p>Realmspirit: Dear, is there anything you need from me? If there’s anything you want to know, just ask away, don’t hold back, dear.</p><br/><p>“Dear your sister! Who the hell are you?”</p><br/><p>Realmspirit: I’m your good friend Realmspirit. I have always been with you, dear.</p><br/><p>Always been with me? I have always been with the god of death you mean, right? Every single time, she would only be able to see these strange chat windows during her deaths. If she hadn’t roared out this time, had he planned on not showing himself? “Why did you bring me here? And have me fix these stupid bugs?”</p><br/><p>Realmspirit went silent for a moment. That QQ chat window that was flowing in the air then popped out a sentence after a series of beeps.</p><br/><p>Realmspirit: You promised me, right? To help me fix my bugs. Since we’re friends, we have to help each other out!</p><br/><p>“Your sister needs help! Is there anyone else who asks for help like this? Just how many times have this lady died, huh? Just what is your purpose?”</p><br/><p>Realmspirit: I simply want you to help me out, really. You have seen it for yourself as well, this world is really filled with many problems.</p><br/><p>“Bro, I’m just a game programmer. It’s possible to have me come up with some gaming scripts, but to have me save a world, and a cultivation world to boot, I really can’t handle it, hey.”</p><br/><p>Realmspirit: But, you’re doing really well though.</p><br/><p>“Well my ass. Just how many lives have I spent? If this continues, I will soon fall apart.”</p><br/><p>Realmspirit: Then… Do you want to return to your former world?</p><br/><p>Zhu Yao: “…”</p><br/>\n</div>"}