{"title": "Chapter 156: Being Chased Everywhere in Life", "id": 156, "volume": 2, "url": "http://boxnovel.org/my-disciple-died-yet-again-chapter-156-being-chased-everywhere-in-life", "volume_title": "Volume 2", "body": "<h1>Chapter 156: Being Chased Everywhere in Life</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 156: Being Chased Everywhere in Life</p><br/><p>“It can’t be considered as saving you, fellow deity. Your cultivation level wasn’t sub-par, so it seemed that I had acted unnecessarily.” Zhu Yao said truthfully.</p><br/><p>Mo Xianxian’s face stiffened, and for a moment, she was a little embarrassed. “Back then, I indeed have some urgent matters to attend to, so… I hope fellow deity will forgive me.” Though, these words of hers were extremely sincere, and even more so, she was determined to reconcile. It wasn’t good for Zhu Yao to continue being pretentious from here either. After all, back then, she sought trouble on her own, and Mo Xianxian did not force her to save her.</p><br/><p>“Forget it. I never thought about it too much in the first place.” At the very most, she was simply a little irritated for having her dimensional space bound.</p><br/><p>“Thank you, fellow deity.” Mo Xianxian heaved a sigh of relief, and hesitantly asked. “I wonder what kind of relationship you have with that arrow spirit?”</p><br/><p>Zhu Yao turned around, and looked at her with narrowed eyes. “You’re talking about Goudan?”</p><br/><p>“Yes, back then, he…” No matter how she thought about it, she couldn’t understand how these two people came together.</p><br/><p>“Don’t worry. Goudan never had the intention to capture you and make you his furnace, he truly likes you.” As a boss, there’s still a need for her to help build a sense of presence for her underling. “He has already repented, and will no longer do anything bad.”</p><br/><p>A hint of a strange expression flashed past Mo Xianxian’s face, as she still did not have any good impressions of Goudan. However, out of consideration, she did not bring this topic up again. “Since that’s the case, during the entry selection match tomorrow, I hope to seek your care, fellow deity. This one here will give all she has, and I will not bring fellow deity down.”</p><br/><p>“Entry selection match?” Zhu Yao blanked. “What entry selection match?”</p><br/><p>“Fellow deity, did you not take note of it in the great hall earlier?” Mo Xianxian patiently explained. “In the tournament tomorrow, two people will form a group, and it’s based on the numbers on our jade tablets. Hence, the two of us will be in the same group.”</p><br/><p>Zhu Yao recalled the ‘Alpha Two’ on the jade tablet. So it wasn’t used to just allocate their rooms, but also the groups for the tournament? No wonder she took the initiative to greet her, and did not fuss about the matters regarding Goudan as well. It was actually because of this. Indeed, being in the same group, if there was some sort of conflict between the two members, it would definitely be detrimental for the competition. Zhu Yao frowned. This sort of schemed apology which carried a certain goal made her feel very uncomfortable.</p><br/><p>In an instant, she no longer had the mood for idle chatter. After exchanging some formal words, they returned to their respective lodgings. In regards to the tournament tomorrow, she wasn’t that worried. That competition could be considered a school entrance examination. Back then, she had even swept her eyes through the hall, and the cultivation levels of those disciples were all at the Earth Deity level, while she was the only Profound Deity. Hence, no matter how one could see it, she held the guaranteed advantage. What she was really worried about was…</p><br/><p>“Master. Did you locate that person’s presence?”</p><br/><p>“No.”</p><br/><p>As she thought!</p><br/><p>Zhu Yao was a little disappointed. “Master, just when can you leave?”</p><br/><p>Yu Yan was silent for a moment. “Spatial formations are considerably more complicated. It will take some time.”</p><br/><p>“Can’t I have Goudan bring the two of you out?” Theoretically speaking, since Goudan was the owner of the dimensional space, he should be able to bring out the items within it.</p><br/><p>“Even though he’s the owner of this space, I’m not an object which belongs to this dimensional space.” Yu Yan explained. “If I have to leave this dimensional space with him, I will require to sign a contract with him.”</p><br/><p>“Then forget it.” It’s fine for master to be her own summoned beast. If he became someone else’s, then it would basically be unbearable.</p><br/><p>“There’s no need to rush.” Yu Yan said. “Even if that woman is not the person who infiltrated Lightning Divine Hall, she’s greatly connected with that person. It’s fine as long as we quietly watch for any changes. At most half a year, I will definitely complete the formation. Within this period of time, do not act rashly.”</p><br/><p>“Mn.”</p><br/><p>Her master told her to quietly watch for changes, however, Zhu Yao never expected that change would come so quickly. On the second day at the competition venue.</p><br/><p>Mo Xianxian and her opponents were two divine practitioners at the Earth Deity level. In the beginning, she was not really worried. However, the longer they fought, the stranger she felt. Although those two people did not use any incredible arts, the divine energy they possessed felt endless, and not a single moment of fatigue could be seen from them. Even if she attacked, they would easily dispel them.</p><br/><p>Mo Xianxian was quickly about to reach her limit, as gradually, she began to lose focus. While Zhu Yao fought the two people, she had to split part of her attention to take care of her teammate, so evidently, they were about to be thrown into a disadvantageous position. At this moment, one of her opponents actually summoned a fire dragon, which directly assaulted her. Zhu Yao wanted to turn around to dodge it, however, she was then attacked by the other person with his sword. She took the hit head-on with her own sword, but suddenly, an incredible pressure came assaulting towards her, and she was barely able to hold onto her own sword.</p><br/><p>This was the strength of an Earth Deity? You must be joking! How had she never known that one’s pressure could overwhelm practitioners of higher cultivation levels?</p><br/><p>However, this Earth Deity evidently did not have the intention to pester her. In a flash, his figure instantly appeared behind her. Zhu Yao looked back with a strange look, only to see the two of them attacking towards Mo Xianxian. One of them was casting out countless icicles, while the other was summoning a sword formation.</p><br/><p>Overwhelmingly, they struck towards Mo Xianxian from all directions, and she was basically unable to dodge. If this was merely a competition, wasn’t such tactics a little much? They were clearly thinking of killing her. Zhu Yao wanted to turn around to save her, but it was already too late. They had already released their attacks.</p><br/><p>The icicles and spiritual swords, carrying imposing sharpness, blasted towards Mo Xianxian who was on the ground. Dust clouds instantly filled the area, and a hint of complacency surfaced on the faces of the two Earth Deities. But, a moment later, their expressions turned stern once again.</p><br/><p>Lowering their heads, they looked towards Mo Xianxian’s position, only to see a faint formation light flashing around her body. Not the slightest of harm had been dealt to her body, and in her surroundings, faint specks of falling icicles and dispersing spiritual swords could be seen.</p><br/><p>“Are you alright?” Zhu Yao landed next to Mo Xianxian.</p><br/><p>“Mn.” Mo Xianxian nodded. “Thank you for your formation.”</p><br/><p>Zhu Yao heaved a sigh of relief. Luckily, she had secretly set down a formation next to the exhausted Mo Xianxian. Otherwise, under those attacks, she would have definitely died. Currently, the undispersed killing intent was still suffused in the air, the two of them were really trying to kill Mo Xianxian. However, the two of them were concealing it really well, to the point where other than Zhu Yao and Mo Xianxian, not a single one of the spectators were able to see through it.</p><br/><p>“Just who the hell have you offended?” Zhu Yao glanced at Mo Xianxian. Just why were there people trying to kill her everywhere she went?</p><br/><p>Mo Xianxian naturally sensed that killing intent as well, as she clenched her fists tightly. “I do not know these two people.”</p><br/><p>It’s even worse that she did not know them. This proved that behind these two people, there was still a large boss character. Their two Earth Deities were already so powerful, then the person behind them could only be much stronger as well.</p><br/><p>“They are not Earth Deities.” Yu Yan’s words suddenly sounded in her mind. “They’re Gold Deities.”</p><br/><p>The hell, then how was she going to beat them? So their cultivation levels were disguised as well. They actually went all the way to disguise themselves as Earth Deities to kill her. They’re actually spending quite a bit of effort, huh.</p><br/><p>“What are we going to do?” Mo Xianxian was a little flustered. She dodged one of their attacks, but that did not mean that she could luckily dodge the rest as well. And this arena just had to have an isolation formation set down. They basically could not leave unless an outcome was decided.</p><br/><p>The expressions of the two people turned even colder, as one of them lightly laughed. “Initially, we only planned on dealing with one person, but it looks like now…” He did not finish his words, instead, he looked towards Zhu Yao at the side with solemn eyes. Evidently, he now held killing intent towards her.</p><br/><p>In an instant, Zhu Yao wanted to curse out vulgarities. Just what did she do to deserve this? Mo Xianxian, you’re actually playing a main tank role, who’s able to pull all the aggro everywhere you go, right? The main point was, Zhu Yao’s actually playing as an off-tank now.</p><br/><p>“Just who in the world are you people?” Mo Xianxian loudly asked.</p><br/><p>The two of them looked at each other, and their eyes became even colder than before. A faint cold laughter could even be heard. “There’s no need for you to know. In any case, it’s guaranteed that you people will not be able to leave here normally today.” They were destined to die here.</p><br/><p>“Who says that we’re unable to leave?” Zhu Yao rolled her eyes at them. “Indeed, we’re not able to beat the two of you, but we’re still able to…” Zhu Yao kept the divine sword in her hands, raised her hands up high, and loudly roared. “I admit defeat!”</p><br/><p>The moment these words came out, not just her two opponents, even Mo Xianxian beside her was dumbfounded. No one would have thought that she would actually be so “shameless” to admit defeat. Though, the main point was that the isolation formation had been dispelled in response.</p><br/><p>“What, do you think I’m stupid? I clearly know that you two are targeting me, so why wouldn’t I admit defeat, and instead get beaten up by the two of you?”</p><br/><p>Her words were so logical, they were actually unable to refute at all.</p><br/><p>In an instant, the two of them hatefully gritted their teeth. It was initially a great opportunity for them, as they thought that they could openly eliminate Mo Xianxian. Who would have known that such an opportunity would be easily dispelled with a few words? And those two people who definitely should not have been able to walk out “normally”, were very “normally” walking off the stage in an open manner.</p><br/><p>The two people: …</p><br/><p>“Fellow deity Zhu.” Mo Xianxian hurriedly caught up to Zhu Yao’s pace, and said in a serious tone. “Thank you.” Her expression was filled with appreciation, and this time, it did not carry any schemes like before, but instead, was filled with true sincerity. This match was clearly directed against her. Even though due to her forfeit, the two of them had lost the match, it had actually saved her life.</p><br/><p>“I’m simply saving myself.” Zhu Yao waved her hands without a mind. Though, this lady sure was unlucky. No matter where she went, there would always be people present to kill her.</p><br/><p>Mo Xianxian smiled, yet, her face was slightly dyed with a gloomy mood. “But from today onwards, I’m afraid this Advent Cloud Hall…” Those two people definitely wouldn’t let her go like this. Advent Cloud Hall wasn’t a place she could stay for long either.</p><br/><p>“I don’t think that’s the case though.” Zhu Yao shook her head. “Now that they have won the match today, they will definitely become the elite disciples of Advent Cloud Hall, so their identities naturally wouldn’t be that of an average person’s. It wouldn’t be easy for them to openly make a move against you.” Though, the bigger reason was because her master had said that the two of them possessed cultivation at the Gold Deity level. Though there were quite a number of Gold Deities in the Divine Realm, not a single one of them had not joined the various factions. Because the people present in this competition venue had low cultivation levels, they were unable to see through their disguise. However, there would always be people that could.</p><br/><p>Once that time comes, naturally, the two people would definitely arouse the suspicion of the various conspirators and people at the higher management levels. Hence, the two of them basically wouldn’t stay in the Advent Cloud Hall for long.</p><br/><p>Though, Mo Xianxian was still a little worried, and she felt uneasy for several consecutive days.</p><br/><p>However, ever since that day, she had really not seen those two people again at Advent Cloud Hall, as though they had suddenly disappeared. Mo Xianxian was thus able to calm down, and began to feel even more grateful for Zhu Yao. Although Mo Xianxian had been staying in her own cave residence to cultivate, she was still very worried about her current plight where she was constantly being chased. Zhu Yao, however, had volunteered to help inquire about the origins of those two people. It seemed like this person was worth making friends with.</p><br/><p>But in actuality!</p><br/><p>Zhu Yao was simply trying to save her own master out from her divine sense region. Although those two people did not carry the aura of the person who infiltrated Lightning Divine Hall, they should be in cahoots with him. However, since they dared to come, they must have definitely done the necessary preparations to prevent their identities from being exposed. And, she was indeed unable to find out anything at all, as no one knew the two of them.</p><br/>\n</div>"}