{"title": "Chapter 157: Geez, if you’re Ugly, Don’t Seek Revenge", "id": 157, "volume": 2, "url": "http://boxnovel.org/my-disciple-died-yet-again-chapter-157-geez-if-you%E2%80%99re-ugly-don%E2%80%99t-seek-revenge", "volume_title": "Volume 2", "body": "<h1>Chapter 157: Geez, if you’re Ugly, Don’t Seek Revenge</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 157: Geez, if you’re Ugly, Don’t Seek Revenge</p><br/><p>However, even if they could conceal their identities, it was impossible to conceal their arts. Among the factions in the Divine Realm, the various sects or families would have their own unique set of arts. For example, Advent Cloud Hall specialized in sword techniques, and focused on paving their way to the Dao through their swords. Back then, those people were evidently more practiced with the five elemental arts, especially their fire-based arts, which were exceptionally incredible.</p><br/><p>Hence, she went to inquire around the sect in regards to places which specialized in fire-based arts. The answers she received were very uniform. “Fluorescent Wind Sect of the North.”</p><br/><p>Those two people came from the Fluorescent Wind Sect.</p><br/><p>Zhu Yao guessed it correctly. That tournament back then was to select the elite disciples among them. The top three disciples who won the tournament, were all brought away in an orderly fashion. Most likely, they were already being taken note by the higher brass, and were given preferential treatment. As for those who lost, they would basically be left to grow on their own.</p><br/><p>Mushmush and Goudan were also among the ones who were left to grow on their own, or to be exact, those spiritual monsters who attended the tournament that day were all left to fend for themselves. Most of them had yet to learn official divine arts, so it was very natural for them to be defeated by divine practitioners. Mushmush and Goudan were basically defeated the moment they stepped on the stage. They did not suffer any serious injuries, and when they got up, they were still behaved like good happy-go-lucky spiritual monsters.</p><br/><p>Every practitioner that was left on their own was given a few cultivation techniques for some divine arts. Every month, they could head over to the Consular Hall to receive medicinal pellets and divine stones, which could be considered as benefits for entering the sect. Though the amount evidently wasn’t much, it was still better compared to the other spiritual monsters.</p><br/><p>Zhu Yao only found out later that most of the spiritual monsters who did not pass that invisible bridge, had been dispatched to the various halls to deal with the miscellaneous chores for Advent Cloud Hall. Basically, these people had all given up on raising their cultivation. This was a little similar to the concept of the Outer Sect and Inner Sect system of the various sects. By passing the bridge, one would enter the Inner Sect, while those who did not pass the bridge could only be taken in by the Outer Sect.</p><br/><p>In these few days, Zhu Yao had been quietly staying put. With her current cultivation level, it was considered trash in Advent Cloud Hall. Her master’s formation was about to be completed. Once he completes it, she would then have more confidence in finding the mastermind behind all this.</p><br/><p>In the recent days, Goudan had been coming over to her place every single day. Obviously, it wasn’t to look for her, but to look for that little sister Xianxian of his. Unfortunately, no matter how he pestered her, the girl wouldn’t even bat him an eye. She was wholeheartedly thinking about her own husband. Haah. Out of all things he could do, why did Goudan like to be a third-party? They were of different races, so how could they be in love? No happiness could be grown out of a relationship between a human and a spiritual monster, you know.</p><br/><p>As expected, in less than a few minutes, Goudan was sent flying out of the courtyard by the girl Mo Xianxian, who could not bear it any longer. With a swoosh, he disappeared into the distance.</p><br/><p>“The thirty-sixth time.” The mushroom gloatingly muttered out. Zhu Yao silently lit up the thirty-sixth candle in her heart. Pulling the mushroom along, they left the crime scene.</p><br/><p>Initially, they had planned on strolling a few rounds. If they’re lucky, they would even be able to pick up Goudan. However, unexpectedly, they met a familiar person along the way.</p><br/><p>“So you two are over here, this can sure be called wearing out iron shoes in fruitless searching, huh.[1]” A green-clothed woman, bringing along two followers, walked over, and her smile was especially complacent.</p><br/><p>The mushroom blanked for a moment, before blurting out. “Little bi-“</p><br/><p>“Shut up.” The woman furiously interrupted the mushroom’s words. She then ruthlessly glared at the two of them. “As expected, you two did it on purpose that day!”</p><br/><p>It was actually the little bitch who posed as her. Zhu Yao was a little startled. After sizing her up for a moment, she saw a dark red diagram embroidered on her sleeves. “You’re an elite disciple?” Only the clothes worn by elite disciples would have such a diagram. Zhu Yao did not expect that she was actually one of the top three in the tournament that day.</p><br/><p>Tao Manfeng coldly laughed. Raising her head, she coldly glanced at the two of them. “That’s right. Following by the rules, you two should be calling me senior martial sister.”</p><br/><p>“Oh, senior martial sister.” The mushroom blanked for a moment, before he readily followed her advice and called out.</p><br/><p>This time, it was Tao Manfeng who was dumbfounded, as though she had not expected that he would actually be this casual about it. Anger began to boil even more in her heart. “A mere spiritual monster like you, actually dares to humiliate me in front of such a large crowd. If I don’t teach you a lesson, you wouldn’t know your place.”</p><br/><p>“Ah?” The mushroom gave a confused look, as he turned to look at Zhu Yao. “Rock spirit, what did I do?”</p><br/><p>The corner of Zhu Yao’s lips twitched. It’s because you didn’t do anything, that’s why she’s angry, alright?</p><br/><p>“Good, you two sure have guts. You actually dare to provoke me now?”</p><br/><p>“Did we?” The mushroom continued to look at Zhu Yao.</p><br/><p>“Nope!” Zhu Yao answered. She didn’t do anything at all.</p><br/><p>Tao Manfeng’s fury surged. “You two scolded me right in front of my face, and you’re saying that’s not a provocation?”</p><br/><p>“How did we scold you?” The mushroom expressed that he was very innocent.</p><br/><p>“You still want to deny it? Earlier, you were even about to call me… call me… bi…tch…”</p><br/><p>The mushroom became even more confused. “But you are little bitch.” Wasn’t that her name? Rock spirit said so.</p><br/><p>“Shut up!” Tao Manfeng was so furious, even her face had turned green. “You’re the little bitch, all of you are little bitches!”</p><br/><p>The mushroom argued back. “I’m clearly a little mushroom. You can call me Mushmush.”</p><br/><p>“You…”</p><br/><p>Zhu Yao silently looked away. Oh Mushmush, you sure have a mushy brain, huh. You can’t really have believed that her surname is little, and her name is bitch, right?</p><br/><p>“Geez. Even though it’s your own name, yet, you don’t allow people to call out to you.” The mushroom stabbed another blow.</p><br/><p>Only then did Tao Manfeng finally understand his words. Gritting her teeth, she said. “My surname is Tao, I’m called Tao Manfeng! You best remember it.”</p><br/><p>“Oh…” The mushroom revealed a face of sudden enlightenment. After sizing her up for a moment, he curled his lips and said. “So you changed your name, say that earlier.”</p><br/><p>Pfft…</p><br/><p>Zhu Yao could faintly here the sound of Tao Manfeng puking out blood.</p><br/><p>“You… You two…” Tao Manfeng wished that she could pounce over and tear that spiritual monster’s lips apart. She took a deep breath, and instructed the two followers behind her. “You two, help me keep a lookout.” She looked at the two of them with a hazy expression.</p><br/><p>For a moment, Zhu Yao imagined a scenario where she was blocked at the door by students from a higher grade after school. Wasn’t it just calling her names? In regards to settling debts, this lady was simply too petty. Zhu Yao herself had yet to settle her own debts with her, you know?</p><br/><p>Tao Manfeng coldly glared at them, and divine energy came surging from her body. In her palm, lightning sparks faintly flashed. “I vowed to myself, if there’s anyone who dares to humiliate me, I will never let even a single one of them off.”</p><br/><p>She was going to start a fight? Zhu Yao was caught off-guard a little. She couldn’t have become muddle-headed from anger, right? Although she was currently an elite disciple, Zhu Yao’s cultivation level was still higher than hers.</p><br/><p>However, Tao Manfeng did not have the intention to pull back now. Raising her left hand which was flashing with lightning sparks, narrow yet powerful strands of lightning began to glow at the center of her palm.</p><br/><p>“Imperial Lightning Art?” Yu Yan’s voice resounded in Zhu Yao’s mind, carrying a hint of suspicion. “Why does she know the techniques belonging to Lightning Divine Hall?”</p><br/><p>“Weren’t you the one who gave her?” Zhu Yao really wanted to spray out a mouthful of salt soda water into her divine sense region. She was now able to slightly understand why Tao Manfeng dared to make a move. The Imperial Lightning Art was a divine art which belonged to Lightning Divine Hall, and regular divine arts could not be compared to it. Even if she were to challenge someone of a higher cultivation level, it wasn’t guaranteed that she would lose.</p><br/><p>“Me?” Yu Yan blanked, and only a moment later did he respond. “Oh, it’s her.”</p><br/><p>So you basically didn’t recognize her back then! Just how much of a face-blind are you?</p><br/><p>“Master, what do we do?” Although she learnt lightning-based arts as well, she had yet to touch on the Imperial Lightning Art.</p><br/><p>“No matter.” Yu Yan, however, was especially calm. “It’s fine if you simply stand there without moving.”</p><br/><p>Ah? Don’t move? So she’s just going to wait till she’s struck by lightning?</p><br/><p>Tao Manfeng’s art had already begun to materialize, and the lightning sparks on her palm became even denser. Suddenly, a long bolt of lightning was formed, soaring into the skies. It then came striking in the direction where she and Mushmush were.</p><br/><p>“Now di-”</p><br/><p>Zhu Yao was just about to construct a defensive barrier, when suddenly a water dragon came descending from the sky. It pounced directly towards the bolt of lightning, and the lightning was instantly devoured after a slight sizzle. The stream of water however, continued to chase after the source of the lightning bolt, instantly drenching Tao Manfeng.</p><br/><p>Although the water dragon could block the lightning attack, it was unable to completely suppress it, hence the electrical current still existed. And all of this touched upon a certain physical phenomenon.</p><br/><p>Water – is a conductor of electricity.</p><br/><p>Hence, the water sprayed about, and the lightning sparks flashed, along with the drenched Tao Manfeng.</p><br/><p>The student Tao Manfeng, dressed in a green robe, who was acting as an extremely proud elite disciple earlier, after being electrocuted from head to toe, instantly turned into a convulsing disciple. In the air, her unfinished declaration earlier still continued to echo. “Now, die… ai… ai… ai…” When the electrical current flowed through, her entire body convulsed. With every convulsion, the tone of her ‘ai’ would change.</p><br/><p>Hence, the entire place was filled with her various ever-changing tones of: Ai… ai… ai… ai… ai…</p><br/><p>Zhu Yao: …</p><br/><p>Mushroom: …</p><br/><p>Followers: …</p><br/><p>Only when her entire body was charred black did her cry vanish, and she collapsed onto the pool of water head-first.</p><br/><p>Several wisps of light smoke gradually rose…</p><br/><p>Ah, she really could win just by standing there without moving. Student Tao Manfeng, I really don’t hate you in the slightest any longer.</p><br/><p>“Senior martial sister!” The two followers were both shocked, as they looked anxiously at Tao Manfeng who had already fainted from the electrocution. Yet, not a single one of them dared to head over to lift her up, as there were still sparks flying in the pool of water!</p><br/><p>Just as they were at a loss of what to do, a clear and extremely imposing, yet slightly familiar voice resounded from the sky. “Who was it here that was executing a lightning technique?”</p><br/><p>A white figure came flying over from afar. The person was a twenty-year-old looking youth with a heroic look. With tightly knitted brows, he looked at the water surface below which was flashing with lightning sparks.</p><br/><p>Suddenly, Zhu Yao simply felt like heading back with her face covered. That person was actually Miao Lin, how could she have actually forgotten about him? Crap, crap, crap. This time, she was definitely going to be recognized.</p><br/><p>“Greetings, senior martial brother.” The two followers instantly greeted Miao Lin.</p><br/><p>“Mn.” Miao Lin sternly nodded. He swept a glance at the few people on-site, including Zhu Yao who was desperately lowering her head. “What happened?”</p><br/><p>The two followers exchanged glances, and their eyes were filled with despair. “Senior martial brother, it’s… it’s the senior martial sister who just newly entered. She has some conflict with these two disciples, so out of impulse, she made her move against them.”</p><br/><p>“She knows a lightning technique?” Miao Lin strangely glanced at the person who was still lying in the water like a corpse.</p><br/><p>“Yes, senior martial sister is indeed someone who’s capable of lightning techniques among this new batch of disciples. And…” That disciple said with worshiping eyes. “Senior martial sister said that she even knows the Imperial Lightning Art as well.”</p><br/><p>“Imperial Lightning?” Miao Lin frowned, before he coldly snorted. “In this realm, other than the Lightning Divine Hall, who would dare to claim that they know the Imperial Lightning Art? Ludicrous.” Miao Lin once again glanced at Tao Manfeng, and in an instant, a hint of wistful expression appeared on his face. “I’m someone who has personally witnessed the arts of Lightning Divine Hall.”</p><br/><p>[1] ‘wearing out iron shoes in fruitless searching’: Putting in so much effort in a search, only to find them so easily.</p><br/>\n</div>"}