{"title": "Chapter 164: Please Let Me Appear on Stage", "id": 164, "volume": 2, "url": "http://boxnovel.org/my-disciple-died-yet-again-chapter-164-please-let-me-appear-on-stage", "volume_title": "Volume 2", "body": "<h1>Chapter 164: Please Let Me Appear on Stage</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 164: Please Let Me Appear on Stage</p><br/><p>“Do you feel uncomfortable anywhere? Any pain? Any headaches?” The woman endlessly said comforting words, as she inspected Zhu Yao from head to toe.</p><br/><p>“Wait a minute!” Zhu Yao pressed her hand down. She had a faint guess of what was going on, and she could not help but ask. “Who are you?”</p><br/><p>“I’m your mother.” Her tears were flowing even more happily, as she stroked her face, and cried till she ran out of breath. “You’re my daughter, my precious daughter. Your mother, I, has yearned for so many years, and you’re finally awake.”</p><br/><p>“Your name is?” Unwilling to give up, Zhu Yao asked.</p><br/><p>“You have taken up my surname since young. My name is Yin Shi, and you’re called Yin Xin.”</p><br/><p>And she’s exactly the cannon fodder villainess that did not even have the chance to appear on stage! Flips table. Why did the resurrection this time carry its own scenario as well!? For a moment, Zhu Yao felt her brain aching, she could not help but press on her own head.</p><br/><p>This action, however, had frightened Yin Shi, causing her to even forget her tears. “Xin’er, what’s wrong? Is your head hurting? Come, don’t move. Let your mother here take a look.” As she said that, she gathered a strand of divine sense, and was about to enter Zhu Yao’s to inspect it. Zhu Yao instantly felt a strange sensation, as she slid her body to the side and dodged it.</p><br/><p>“I’m fine.” Looking at her disappointed look, Zhu Yao instantly felt a little anxious. This situation where she was in the scenario itself was something she had never encountered before. And, looking at the upcoming events she saw in her precognitive dream, this Yin Shi was not a simple character, so her being able to see through Zhu Yao’s thoughts would definitely be a matter of time. So, why not speak for herself now? “Listen to me, I’m actually not your daughter.”</p><br/><p>Yin Shi blanked, and she looked at her dumbfoundedly.</p><br/><p>Zhu Yao decided that she might as well expose everything now. “I basically don’t recognize you? I found myself here the moment I woke up. In regards to matters before this, I do not have a single clue either.”</p><br/><p>Yin Shi did not reply, she simply looked straight at her for a moment. The tears which managed to stop earlier, began pouring out once again, as she muttered out. “Xin’er… My poor Xin’er.”</p><br/><p>“Don’t misunderstand.” Zhu Yao anxiously explained. “I didn’t do anything to your daughter, and I have never seen her before. I was here the moment I woke up.” So, please absolutely do not think that I took over her body.</p><br/><p>“I know…”</p><br/><p>“It’s good that you kn… Eh?” Zhu Yao was startled, her eyes greatly widened. “You know!?” This was illogical, wasn’t it?</p><br/><p>Though, with a heart-aching look, Yin Shi said. “Xin’er. I know that currently, you will not recognize me as your mother. But, it doesn’t matter. Mother will wait for you.”</p><br/><p>“…” Was there a mistake with how she expressed it? She wasn’t trying to recognize her as her mother! “I’m really not you daughter.”</p><br/><p>“Your mother understands. Your mother really understands.”</p><br/><p>What do you understand, hey? Don’t look as though you know everything, alright?</p><br/><p>Yin Shi once again stroked her head. “My daughter has such a hard life!”</p><br/><p>“I’m really not…” I’m surrendering myself over here, hey. Please be serious a little!</p><br/><p>“You have been in a coma ever since you’re young, and have only just woken up. Your mother understands that you’re unable to accept everything in such a short time.” Yin Shi then began to start the hidden event all on her own.</p><br/><p>“Coma?” Zhu Yao blanked, as she caught onto this key term.</p><br/><p>Yin Shi nodded. “When I was pregnant with you back then, coincidentally, it was my time of ascension. Back then, your mother didn’t know of your existence, and had only found out after ascending to the Higher Realm. However, due the influence from the lightning tribulation, I was unable to sense your presence in my womb, and I didn’t expect that you would still be safely given birth to. But, ever since you were born, you have stayed in a coma. Your mother has yearned for so many years…” As she said all of these, she could not help but begin to cry again.</p><br/><p>So that’s the case. It was no wonder she would accept the fact that Zhu Yao did not recognize her so easily. However, she was after all not Yin Xin. Even if she had been in a coma ever since, and had just woken up, it was impossible for her to actually act so natural, right? Zhu Yao felt that there was a need to explain this point.</p><br/><p>Who would have known that this newly appointed cheap mother, didn’t actually mind at all, and had even put up a prideful look as she said. “As expected of my daughter, who is the only deity-born in the Divine Realm, to be so intelligent the moment she wakes up.”</p><br/><p>That’s not the problem you should be mindful of, right!? Zhu Yao mentally collapsed. Hence, she spent an entire hour, used various types of worldviews and perspectives, explaining to her the truth about the impossibility of Zhu Yao being her daughter. However, no matter how she explained, Yin Shi simply looked at her with a teary smile from the start till the end. Her face was filled with the ‘as expected of my daughter, even after sleeping for so many years, she actually knows so many things’ look. Zhu Yao instantly felt a deep sense of powerlessness, and felt that she might as well self-destruct her character now.</p><br/><p>“I’m called Zhu Yao, not your daughter Yin Xin.”</p><br/><p>“Zhu Yao?” The cheap mother’s expression only then made a slight change. Her beautiful brows slightly furrowed, as she said with a worried look. “Xin’er, even if you don’t like your current name, your mother has no qualms about changing it. But, you can’t simply change the surname as well!”</p><br/><p>“…” Who’s here wanting to change her surname?</p><br/><p>“You must know, the Yin Family is a huge cultivation family in the Lower Realm, and in the Higher Realm, the Yin Family is even controlling a huge continent. Changing to another surname, would simply be a great disrespect to our ancestors.”</p><br/><p>“I’m not…”</p><br/><p>“Back then, your mother here had discussed this matter with your father for a very long time, before we decided to have you take on my surname.”</p><br/><p>“I say…”</p><br/><p>“Haah, if you really wish to have the surname ‘Zhu’, then your mother here will think of a way, to have mine changed along with yours as well.”</p><br/><p>“…” Is it really alright to spoil your daughter so much? Aren’t you afraid I might grow in a wrong direction?</p><br/><p>“But the name ‘Yao’, is simply too terrible. Why don’t I change it for you? What about Zhu Xin?”</p><br/><p>“…”</p><br/><p>“And, Xin’er…”</p><br/><p>Zhu Yao took a deep breath. Grabbing onto her hand, she completely gave up her resistance. “Mother, you’re my biological mother! I’m Yin Xin!” I shall admit it, alright?</p><br/><p>Yin Shi’s eyes shone, and instantly hugged Zhu Yao. Dear, your baby has woken up.</p><br/><p>Zhu Yao felt like crying. Dear dad and mom in the modern era, I’m so sorry.</p><br/><p>Zhu Yao didn’t know just how resilient the character setting Realmspirit had given her. Even if she wanted to expose herself, she was still taken as Yin Shi’s daughter. She suddenly recalled the time she first transported to this world, she had met a similar situation. She had clearly transported with her entire body intact, and before she came, there had never been such a person in the village before.</p><br/><p>However, after she transported, everyone possessed memories of her, memories that had already been well set. No matter how she explained, no one believed her, instead, people believed that there were problems with her brain. Zhu Yao was becoming even more curious about Realmspirit’s identity. Just how much power must one possess to be capable of changing the memories of so many people at once?</p><br/><p>Currently, this Yin Xin’s situation was similar. The only difference was, at the Zhu Village, she was someone who suddenly popped out, while Yin Xin was a character who existed in the first place.</p><br/><p>However, just where did the true Yin Xin head off to? According to the description in the precognitive dream, she shouldn’t have woken up till her death. However, even if that’s the case, Yin Xin was after all still an actual person. For her to occupy her body like this, gave a feeling of stealing someone else’s opportunity to live.</p><br/><p>Zhu Yao shook her head. She decided that she would find an opportunity to question Realmspirit about Yin Xin’s whereabouts.</p><br/><p>She carefully recalled the bug this time. Undoubtedly, it was a crime of murder brought about by a corpse (hers). Everything was caused by that dimensional space of hers. Mo Xianxian killed Tao Manfeng and obtained the dimensional space, then, she leveled up to take revenge against the Fluorescent Wind Sect.</p><br/><p>However, at the end, why did the ancient god-beasts, the phoenixes, want to turn the entire Divine Realm into a sea of flames? She was unable to comprehend it. Realmspirit said that the Gods and Devils would resurface in the Three Realms, so it was very natural for those phoenixes to appear. If there would be a link between Mo Xianxian and the Divine Realm being destroyed, then that could only be the matter of taking revenge against the Fluorescent Wind Sect.</p><br/><p>When Mo Xianxian destroyed the Fluorescent Wind Sect, she killed all disciples with the surname ‘Yin’. And, she had even destroyed a large half of the Fluorescent Wind Sect. Could it be that there was an item within the Fluorescent Wind Sect that was especially important to the phoenixes, and hence, she had angered them?</p><br/><p>Just what was it? To have the God race be so mindful of it?</p><br/><p>Zhu Yao could not understand. It seemed like she could only slowly find out from this day forth.</p><br/><p>Right now, the thing she needed to understand was, how far the scenario had progressed.</p><br/><p>“Mother.” Zhu Yao tugged onto Yin Shi, who was still perfectly expressing the deep importance of motherly and daughterly love, next to her. “Other than mother, do I have any other relatives in the Fluorescent Wind Sect? Like a martial brother?” Especially someone with the surname ‘Xu’.</p><br/><p>“Of course you do.” Seeing that she was interested, naturally, Yin Shi did not hide anything. “The various Atrium Lords in the Fluorescent Wind Sect are all people from the Yin Family. Oh, you have a senior martial brother named Xu Nuoyan as well. He’s your father’s personal succeeding disciple… Ah! Look at me, forgetting about this matter because of my excitement.” Yin Shi blanked for a moment, as she looked at her daughter with a little guilt in her eyes. “Your father has betrothed you to him, and today is exactly the day of your practitioner-pair ceremony. Nuoyan is still waiting at the front hall for the procession!”</p><br/><p>“What!?” Zhu Yao leapt out of the bed in an instant. The matter had already progressed to the start of the big war. Could it get even more worse that this?</p><br/><p>“Xin’er, back then, you have always been in a coma. So…”</p><br/><p>“I can’t marry him!” Zhu Yao pulled Yin Shi, and charged outside. “Let’s hurry there.” Hopefully, she could still make it in time to alter her fate as a cannon fodder villainess. She simply had to quietly watch as the male and female protagonists fight it out.</p><br/><p>Yin Shi summoned her divine sword, as she explained. “Xin’er, I know you have just woken up, so you’re definitely unwilling with such an arrangement. But, Nuoyan is a good child. You will know after interacting with him more.”</p><br/><p>Good child? Zhu Yao looked at her helplessly. This good child of yours, would come back in the future to destroy your entire sect.</p><br/><p>“Mother, you said it yourself, I’m already awake now. Since I’m awake, in regards to matters concerning myself, I will decide on them on my own.” She definitely could not marry Xu Nuoyan, no matter was she Yin Xin, or Zhu Yao.</p><br/><p>“Xin’er…” Yin Shi still wanted to persuade her.</p><br/><p>Zhu Yao, however, interrupted her. “You said that Xu Nuoyan is a good child, but your daughter has never seen him nor spoke to him before. When he has yet to understand anything about me, he can actually easily make the decision to marry me. To actually decide on an important matter of being practitioner-pair companions so casually, I don’t see how a person like that can have good intentions?”</p><br/><p>“…” Yin Shi was speechless. Indeed, the Divine Realm could not be compared to the mortal realm, where the parents’ orders and matchmaking words could determine their children’s lifetime. Deities possessed endless lifespans, and a practitioner-pair companion would truly become a partner of an endless lifetime. Which pair wouldn’t familiarize with each other, acknowledge each other, before deciding to hold the practitioner-pair ceremony? This was not merely because of prudence towards cultivation, but also respect for their respective partners. Something like having their own daughter marrying off to someone else without meeting her partner even once, was rarely seen in the Divine Realm.</p><br/><p>However, back then, her daughter had always been in a comatose state. After taking up the role of the Sect Master, she had been busy with the matters regarding the sect, and hence could not take care of her at every moment. Once, when she brought up this matter to Nuoyan, that child revealed an intention to help take care of her, hence, Yin Shi had the thought of having the two of them become practitioner-pair companions from then on.</p><br/><p>However, now, her daughter had already woken up, and no longer needed someone to take care of her. Having the two of them hold the practitioner-pair ceremony after this, was evidently inappropriate. Hence, she no longer hesitated, and brought her daughter to the great hall.</p><br/><p>The moment Zhu Yao arrived at the entrance of the great hall, she suddenly heard the sounds of battle, and an extremely furious declaration from a woman.</p><br/><p>“Since my husband is heartless, Xu Nuoyan, I, Mo Xianxian, will sever all connections with you from now on!”</p><br/><p>Zhu Yao anxiously leapt down from the divine sword, charged into the great hall, and shouted. “Wait a minute! Let me appear on stage first!”</p><br/>\n</div>"}