{"title": "Chapter 162: Late-coming Scenario Benefit", "id": 162, "volume": 2, "url": "http://boxnovel.org/my-disciple-died-yet-again-chapter-162-late-coming-scenario-benefit", "volume_title": "Volume 2", "body": "<h1>Chapter 162: Late-coming Scenario Benefit</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 162: Late-coming Scenario Benefit</p><br/><p>Realmspirit: Regarding the Revelation, you will know about it in the future. You must trust me!</p><br/><p>Trust my ass. When he said these words back then, he said he would give her a character that would be beloved by everyone. And what was the result?</p><br/><p>Realmspirit: Actually, a small accident occurred this time. Because the loophole fixed was too big, it caused a short space-time turbulence, which lead to the appearance of a disorder in time. Hence, a momentary fissure occurred between the Three Realms.</p><br/><p>“Fissure?” Zhu Yao suddenly recalled the scene in the city back then. In the beginning, she had thought that it was caused by the Devil, but it seemed like it wasn’t so. “You’re talking about the incident where spiritual energy entered the Divine Realm? Just what happened back there?”</p><br/><p>Realmspirit: Girl, it was caused by the self-destruction of your body, yo.</p><br/><p>“I only self-destructed after!” The incident in the city clearly happened before that.</p><br/><p>Realmspirit: Not this time, it’s the one before that.</p><br/><p>“The one before that?” Zhu Yao was startled, as she widely opened her eyes in disbelief. “You’re talking about the time when I turned into a dragon and swallowed the World Destruction Talisman? That was clearly ages ago.” Wait a minute, a disorder in time! “You’re saying that the explosion of the World Destruction Talisman, had even influenced space-time?”</p><br/><p>Realmspirit: Correct.</p><br/><p>Zhu Yao gave a face. In other words, her resurrection this time basically didn’t happen a few years after, but had actually sent her a few years back. When Sesame said that it could sense her aura within that white light, it was because that spiritual energy originally belonged to her in the first place. At that time, she was swallowing the World Destruction Talisman in the Lower Realm. She suddenly had a strange sensation.</p><br/><p>“At the very least, you should have greeted or notified me about it.” If she had known it would be so strenuous, then it would have been fine if she stopped others in the Higher Realm from taking away the World Destruction Talisman. After all, she remembered all too clearly, that talisman was a treasure belonging to her Lightning Divine Hall.</p><br/><p>Realmspirit: There are matters that even I can’t predict, girl.</p><br/><p>Zhu Yao turned silent. She had indeed been over-reliant on Realmspirit.</p><br/><p>“Then who was the bug this time?” This time, she had been in the Divine Realm for such a long time, however, she had yet to see anyone with even half of the word ‘bug’ on his or her face. Logically speaking, Realmspirit wouldn’t have resurrected her in the Divine Realm for no apparent reason. “Why haven’t I seen even a single one?” Or did she miss out on something?</p><br/><p>Realmspirit: The bug appeared a long time ago, yo.</p><br/><p>“It appeared?” She carefully recalled for a moment. That’s impossible.</p><br/><p>Realmspirit: A picture will tell the truth.</p><br/><p>After Realmspirit said this, a new window suddenly popped out on the screen, and it was actually a video interface. On the black interface, there was only a single ‘play’ button, and Zhu Yao habitually tapped on it. Two figures then appeared on the screen. One was her, while the other was that black-clothed man who was strangling her neck at that time.</p><br/><p>This was the scene right before she died?</p><br/><p>Her body was currently emitting out a white light. A moment later, it occupied the entire screen. She was self-destructing, but in the next moment, at the instant when the white light exploded forth, half of the light rays suddenly returned back into her body. That must have been the instantaneous delay when she realized it was Yue Ying. Hence, only half of her energy was ignited in the explosion.</p><br/><p>However, this half of her entire divine energy was sufficient in exploding that Devil into smithereens. After the white light subsided, what could be seen was a charred forest, and that gigantic crater on the ground. Just as Zhu Yao was wondering why Realmspirit showed this scene to her, suddenly, an object in the sky flashed with reflective light. Something fell straight towards the crater that was blasted open.</p><br/><p>When Zhu Yao took a closer look, she realized that it was a piece of jade which was broken in half. It was her original form. She had already died, yet, her original form was still existing? Was it because she did not completely ignite the dimensional space?</p><br/><p>Before she could understand the situation, that half piece of jade suddenly emitted out a red glow, and a figure flew out from the jade. Wearing a green-colored long robe, fear and shock had yet to recede from her face.</p><br/><p>Little bitch!</p><br/><p>She actually came out?</p><br/><p>Tao Manfeng looked around for a moment, and was frightened by the scene surrounding her. Lowering her head, she looked at the divine jade on the ground and hesitated for a moment. In the end, she still couldn’t help but pick it up, summoned her own weapon, and flew away.</p><br/><p>“What’s the meaning of this?” Zhu Yao did not understand why Realmspirit was showing her this.</p><br/><p>Realmspirit, Continue watching, dear.</p><br/><p>Zhu Yao turned back, and sternly stared at the screen. It was still showing Tao Manfeng who was flying away on her sword. Suddenly, the camera closed in, and was fixated on the divine jade in her hand.</p><br/><p>“Mn. That’s my corpse. So?” Was he especially allowing her to pay tributes to her own departure?</p><br/><p>Realmspirit: Look closely!</p><br/><p>Realmspirit spoke again, and suddenly, an additional mouse pointer appeared on the screen, which moved towards her “corpse”. Then, it cropped the entire piece of jade, magnified it by several times, and the screen was instantly occupied entirely by the jade. The white jade-body, and carved surface. This was her familiar appearance.</p><br/><p>Was there anything special to look at?</p><br/><p>Just when she was about to question him, that mouse pointer suddenly turned into a picture of a giant pencil. Following the carved shape of the jade, the pencil drew black lines on it. A moment later, the letters ‘b’ and ‘u’ appeared on the surface of the jade.</p><br/><p>“Bu… bug!” Zhu Yao fiercely widened her eyes, as she pointed at herself with utter disbelief. “I’m the bug? You’re saying I was the bug this time?” Then wouldn’t it have been fine if she simply resurrected? What was the point in running around so painstakingly? “You’re toying with me?”</p><br/><p>Realmspirit: To be precise, it wasn’t you, but that piece of jade. Your existence was to merely allow the jade to possess a spiritual consciousness.</p><br/><p>“You’re saying that dimensional space existed in the first place?”</p><br/><p>Realm: Nods, nods.</p><br/><p>“Then say so earlier! If I had known, I would have simply self-destructed right from the beginning. Was there even a need to do so many things?” Indeed, that dimensional space of hers was a heaven-bending existence with that dense amount of divine energy, and that spiritual spring which carried unknown effects. Even Tao Manfeng had instantly raised her cultivation to a Profound Deity by staying inside for merely a day. “And in the past, wouldn’t I always have those precognitive dreams? Why wasn’t there one this time?”</p><br/><p>Realmspirit: I already said it before, it’s because of the disorder in time and space. Ahem, your resurrection was a little early, so… It had yet to reach the condition for the scenario to happen.</p><br/><p>“So in other words, I worked for nothing? And, what’s with this condition for the scenario to happen? Are you treating this as a game? There’s actually hidden quests as well?”</p><br/><p>Realmspirit: Don’t mind such details, yo.</p><br/><p>“It would be stranger if I don’t mind, right!?” Roooar~~ “And, the dimensional space within the jade shouldn’t still exist, right?”</p><br/><p>Realmspirit: Heheheh…</p><br/><p>“After this, it can’t be that I have to find the corpse back, right?”</p><br/><p>Realmspirit: Hoho, the weather today is pretty good.</p><br/><p>“…” You’re changing the subject a little too obviously, isn’t it?</p><br/><p>“Whatever, where’s my master and Sesame? What happened to them?” Back then, she only thought about delaying that Devil’s clone. She was unsure if her master managed to escape after her self-destruction.</p><br/><p>This time, Realmspirit did not delay. That video interface once again popped out, and the screen showed that huge crater that was formed after her self-destruction again. Sesame was crawling at a place not far away from the crater, its entire body was in blood, and its chest was slightly fluctuating. It seemed like its injuries were very heavy. A moment later, a white figure descended from the sky.</p><br/><p>“Master!” Zhu Yao could not help but shout out, while she heavily heaved a sigh of relief in the depths of her heart. He was alright.</p><br/><p>His robe was in a slight mess. Evidently, he had just experienced a ferocious battle. His expression however, was frighteningly solemn, as he tightly clenched his fists. Zhu Yao had never seen her master looking like this, as though he could do something frightening in the next moment. He stared straight at that crater for a few moments, and the emotions in his eyes were in slight chaos. A long while later, he gently closed his eyes, and when he opened them later, he had recovered his usual calm. Turning around, he glanced at Sesame who had already fainted on the ground.</p><br/><p>With a wave of his hand, he kept it into the spiritual beast pouch. In a flash, his figure disappeared from the place.</p><br/><p>Zhu Yao could not describe the feelings she currently had. Logically speaking, seeing that her master and Sesame were fine, she should have been happy about it. However, the expression her master had when he looked at that crater continued to replay in her mind. She could faintly feel that there was a certain indescribable feeling surging from the depths of her heart. It was stifling, and she could barely breathe.</p><br/><p>Realmspirit: Girl, are you ready?</p><br/><p>Zhu Yao raised her head, and glanced at that shaking conversation window. Taking a deep breath, she shook away that strange emotion.</p><br/><p>“What am I going to turn into this time? It can’t be that I won’t even be able to obtain a human form, right?”</p><br/><p>Realmspirit: Don’t worry, girl. I promise that you will be very normal this time. Also, as a reward, I shall give you a benefit, yo.</p><br/><p>“What benefit? You won’t be making a fool out of me, right?”</p><br/><p>Realmspirit: After this, it’s time to see a mirac- Pui! It’s time to fix the bug. Go, courageous maiden!</p><br/><p>“Wait a minute, give me a clear explanation first, hey.” She was really afraid of being fooled now.</p><br/><p>However, Realmspirit’s conversation window had already disappeared with a ‘ting’ sound. That familiar loading bar appeared in front of her, but this time, it was as though the loading bar was connected to fiber optic cable, as it finished loading in an instant. She was instantly submerged in darkness.</p><br/><p>The hell!</p><br/><p>Uneasy, she was thinking of what in the world she would become next.</p><br/><p>Suddenly, within the darkness, a string of red-colored words appeared.</p><br/><p>Benefit is being issued…</p><br/><p>So quickly?</p><br/><p>Before Zhu Yao could even feel astonished, she fell into a familiar dreamscape. It was actually the extremely late precognitive dream.</p><br/><p>This time wasn’t an exception, as she once again saw the life of a person. And that person was even someone she was familiar with. She was called – Mo Xianxian.</p><br/><p>The story was very normal in the beginning. Basically, it’s the daily life of a senior martial brother and a junior martial sister.</p><br/><p>Mo Xianxian was a disciple with a mutated Wind Spirit Vein. Possessing extraordinary aptitude, she was fancied by her sect’s Demigod Sovereign, and was taken in as his personal succeeding disciple. While her senior martial brother Xu Nuoyan was the Sect Master’s eldest disciple, possessing the Metal and Fire Dual-Spirit Veins. Although he wasn’t a personal succeeding disciple, he was still someone who was highly regarded. Before Mo Xianxian entered the sect, he had already possessed the Azoth cultivation.</p><br/><p>When Mo Xianxian entered the sect, she wasn’t even five yet. Hence, this senior martial brother began the loli nurturing route. Mo Xianxian was seemingly brought up by his hands. As time went by, love began to blossom. Along the way, things like making life-long promises were unavoidable, however, Mo Xianxian’s master did not accept their marriage proposal. Instead, what he had his eyes on, was a genius from another sect, who similarly possessed a mutated Ice Spirit Vein.</p><br/><p>Hence, for the sake of love, this lady would rather die than obey, insisting that being with her senior martial brother was true love. In the middle, naturally, they had experienced necessary plot lines such as being runaways from home, and running off under moonlight. The lady’s master had no choice but to agree to them being together.</p><br/><p>Though the two people had experienced many difficult trials, they had indeed lived very blissful and happy lives. Xu Nuoyan’s appearance was very handsome, and his cultivation was also higher than the people around his age. And not long after becoming practitioner-pair companions with Mo Xianxian, he had already nourished his Nascent Soul, hence, he attracted many female practitioners who fell for him. However, he had always treated Mo Xianxian as his only one, never abandoning her, and had even more so, treated her as his treasure. Even after that, when Mo Xianxian’s cultivation encountered a bottleneck, and had been remaining at the early stages of Nascent Soul with no sights of progress, intentions of scorn for her had never grown even the slightest bit. With that deep and unwavering love of theirs, even Zhu Yao could not help but wish to give them the “Model Couple” honorable certificate. If not for the ascension scenario later on…</p><br/>\n</div>"}