{"title": "Chapter 184: The First Art of Disciple Trolling", "id": 184, "volume": 2, "url": "http://boxnovel.org/my-disciple-died-yet-again-chapter-184-the-first-art-of-disciple-trolling", "volume_title": "Volume 2", "body": "<h1>Chapter 184: The First Art of Disciple Trolling</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 184: The First Art of Disciple Trolling</p><br/><p>Yue Gu turned his head and looked at the hand that she patted on his shoulder with. Frowning, he pushed it down. “I naturally am your master.” It seemed like she had to properly teach his disciple some manners. A white light gathered within his finger, and he tapped it on the center of her forehead. “Shao Bai had mentioned to me before that you lack of a clear goal, so I… Mn?” The strand of divine sense he gathered, was rebounded. “You already possess another imprint?”</p><br/><p>“That’s right.” Wasn’t you the one who placed it? How could he forget even this as well?</p><br/><p>“No matter.” Yue Gu said without the slightest of mind. “This imprint is rather weak, I shall aid you in dispersing it.”</p><br/><p>“No way.” Zhu Yao flustered, as she took a step back.</p><br/><p>“Since you have already been taken under my tutelage, naturally, you can’t carry someone else’s imprint.”</p><br/><p>Zhu Yao reached out her hand to hold her forehead. “No matter what, this imprint cannot disappear. Otherwise… I will fight you to death, do you believe me?” She hadn’t made clear of the situation yet, this was after all, the only imprint which her master recognize.</p><br/><p>Yue Gu frowned. Seeing her unwilling look, he could only let it go. After sizing her up for a moment, he sighed. “Since that’s the case, then I will follow your will.”</p><br/><p>Only then did Zhu Yao finally heave a sigh of relief.</p><br/><p>“From what I heard from Shao Bai, not only were you egg-born, your original form is a lightning phoenix?”</p><br/><p>“Seems so.” Actually, she wasn’t certain if she was actually a phoenix either.</p><br/><p>Yue Gu’s frown grew even deeper, and his expression was heavily sunken. After a while, he said with a solemn voice. “In this world, every being has its own destiny, and beings of lightning are birthed to sweep the impurities of this world. Since you possess the lightning attribute, then you best resolve yourself well.”</p><br/><p>“Ah?” What did he mean?</p><br/><p>However, he did not seem to have the intention to continue explaining, instead, he reached out his hand to stroke her head. “You will know in the future, for now, you can rest. From tomorrow onwards, I will teach you the Lightning Devil Restriction Arts.”</p><br/><p>Zhu Yao nodded, though still a little puzzled. Just as she was about to turn and leave, she was halted by him again.</p><br/><p>“Wait a minute.” Yue Gu sized her up once more, his line of sight landed on her forehead, frowning. With a twist of his hand, a writing brush suddenly appeared. And then, he raised his brush, and drew something on her forehead. With a satisfied expression, he said. “Done, you can go now.”</p><br/><p>In the beginning, Zhu Yao did not know what he had done. After she walked away, and summoned a water mirror to take a look, did she find an additional ‘Ling’ word written on her forehead, and no matter what she did, she couldn’t rub it off. She thought that Yue Gu was merely using it as a substitute because she did not allow him to leave his divine imprint. So, she didn’t mind it at first.</p><br/><p>Until, when she saw that the foreheads, claws, ears, and even the buttocks of all the creatures on the mountain had the same imprint, she suddenly had the impulse to beat him into a pulp. Flips table. Was he treating her as a pet? Stamping his mark whenever he found a new one? Yue Gu, come over here. Let’s talk about life!</p><br/><p>Yue Gu wasn’t Yu Yan. This was the definite answer she found on the second day since she arrived in the extreme northern lands. Not only did he not have any impression of her, even when she told him about the matters surrounding the Jade Forest Peak and Lightning Divine Hall, he did not have any reaction at all. Yet, he did not seem to have lost his memories either.</p><br/><p>But, for some reason, he kept giving her a sense of familiarity. Every word and action of his was similar to her master’s. Other than his personality being a little warmer than her master’s, and not releasing a cold aura at every turn, she kept having a feeling that she was interacting with her own master.</p><br/><p>“Have you memorized it?” Yue Gu said with a stern expression.</p><br/><p>“Ah?” Zhu Yao blanked, earlier, she had been distracted the entire time. “What did you say?”</p><br/><p>Yue Gu frowned, and his voice sank. “The Circulation Art which I demonstrated earlier.”</p><br/><p>“Oh, I didn’t listen clearly.”</p><br/><p>Yue Gu sighed, he had no choice but to continue teaching once again. Zhu Yao attentively looked at his actions, yet, the more she looked, the more he looked like Yu Yan. Every single action of his was unexpectedly familiar.</p><br/><p>“This time, did you see clearly?” Yue Gu asked again.</p><br/><p>“Ah?” Sorry, she was distracted again. “Uh… No.”</p><br/><p>“Yue Nan!” Yue Gu’s brows sharpened, turning around, he walked straight towards her. “If you are this undisciplined, how will you be able to learn?”</p><br/><p>“Uh…”</p><br/><p>“I know you feathered races think fondly of your homes, but since you have already come under my tutelage, you must settle your heart down.”</p><br/><p>“Umm…”</p><br/><p>“Your talent isn’t bad, but unfortunately, you have too many miscellaneous thoughts.”</p><br/><p>“Actually…”</p><br/><p>“Do not deny. Do you know your mistake?”</p><br/><p>“Teacher…”</p><br/><p>“Mn?”</p><br/><p>“I know my wrongs, but can you stop lecturing that tree?” The corner of Zhu Yao’s lips twitched. Looking at Yue Gu who was facing that huge tree with a disciplinary look, she was a little speechless. Earlier, he was clearing walking towards her, why did he suddenly turn to another direction and head towards that huge tree?</p><br/><p>“…” Yue Gu was startled, and a hint of red flashed past his face for a moment, before immediately reverting back to normal. Turning around, he said with a much sterner look. “Since you know your wrongs, then gather your concentration, and work hard. In the future, your teacher will only demonstrate the arts once, is that clear?”</p><br/><p>“I understand.” Zhu Yao nodded, and continued with a darkened expression. “But teacher, you’re mistaking me for something else again. I’m on your right. The thing in front of you is a rock.” Why did he treat that rock and tree as her? Could it be…</p><br/><p>“Teacher, it can’t be that your eyesight isn’t good, right?”</p><br/><p>She swore that she definitely saw Yue Gu’s face stiffen for a moment. “Nonsensical, your teacher is merely taking responsibility for your cultivation. I shall demonstrate it once more, watch carefully.”</p><br/><p>“Ou…” Zhu Yao nodded, she wondered if it was just her imagination. After all, as an ancient God, if he actually had bad eyesight, then it would be too unbelievable. However, the following few hours, had completely verified her guess.</p><br/><p>Fifteen minutes later…</p><br/><p>“Yue Nan, the principles behind Devil Restriction Arts, do not lie in strength, but in binds.”</p><br/><p>“Teacher, can you face me while you’re talking? The one in front of you is a bunny.”</p><br/><p>“…”</p><br/><p>Half an hour later…</p><br/><p>“Yue Nan, you must know that the Devil race are undying, similar to your race.”</p><br/><p>“Teacher, I’m on your left. That’s a tree stump.”</p><br/><p>“…”</p><br/><p>An hour later…</p><br/><p>“Yue Nan, what you’re learning is an art of sealing, not an art of destruction.”</p><br/><p>“Teacher, I’m on your left, that’s a bunch of weed.”</p><br/><p>“…”</p><br/><p>Four hours later…</p><br/><p>“Yue Nan, the trick behind this art is…”</p><br/><p>“Teacher…” Zhu Yao deeply sighed. “I’m behind you.”</p><br/><p>“Ahem…” A certain teacher faked a cough, and maintained his stern expression. “Your teacher has never been good at recognizing people.”</p><br/><p>No, no, no. This wasn’t a problem about recognizing people. He’s evidently blind.</p><br/><p>Hence, six hours later…</p><br/><p>“You have to practice this set of sealing arts often, understand?”</p><br/><p>“Haah…” Zhu Yao grabbed onto the person in front of her, and forcefully pulled him to her direction. “Teacher, I’m here.”</p><br/><p>A certain teacher’s calm expression, instantly collapsed. “Disciple. I think it’s best if this teacher helps you change your imprint!”</p><br/><p>“Scram!” So the reason why you keep wanting to place your imprint on me, is just to make it easier to recognize me? You’re taking it too far now!</p><br/><p>This was the first time Zhu Yao knew that there was a type of face-blindness that could not discern between time, location, people, and even objects. For example, her teacher. And most of the time in her first lesson, was spent on the numerous times correcting Yue Gu’s mistake in recognizing his target.</p><br/><p>She had also begun to slowly understand just what sort of world this place was. Just as she had guessed, this world was not the Divine Realm, nor had she ever known of the existence of this world. In this place, the God races that had long disappeared in her world existed. Including the Devil race.</p><br/><p>However, the Devils had been sealed by the ancient Gods in the deep abyss of the extreme southern lands, and that place was named the Devil Sealing Abyss. And the responsibility of the four God races was to safeguard that seal, and also reseal the Devils that occasionally escape from the seal.</p><br/><p>Zhu Yao did not know why Realmspirit had brought her to this place. And back then when she was Yin Xin, Realmspirit had even especially made her appear in two characters simultaneously. Actually, with so many Gods that possessed overflowing martial powers, there basically wasn’t a need for her, right?</p><br/><p>Zhu Yao’s face was filled with doubts. Just as she was planning to close the door and have a rest, raising her head, she saw Yue Gu who was circling around her courtyard.</p><br/><p>“Teacher?” It was late in the night. Was he here to advance their teacher-student relationship?</p><br/><p>Yue Gu was startled for a moment, and then, he walked straight towards the stone table in the courtyard. Affectionately, he reached his hand to stroke the surface of the table. “Yue Nan, so you’re the one who lives here.”</p><br/><p>The corner of Zhu Yao’s lips twitched. She left the door and pulled him back. “Teacher, I’m over here.” Just how blind are you!</p><br/><p>Possibly because he had already been exposed numerous times, there wasn’t a hint of embarrassment left on his face. He lightly said. “And here I was wondering why a straw cottage would suddenly appear in this forest.”</p><br/><p>“I built it yesterday.” Zhu Yao casually said. “Teacher, do you want to come in and have a seat?”</p><br/><p>“Good idea!” Surely, Yue Gu walked in, and calmly looked at the furniture within the house, looking like a good master who cared about his disciple’s daily quality of life. After looking for a moment, he sat in front of the table. “The place you have here is pretty well made. How did you build this straw cottage?”</p><br/><p>“It’s very simple, just a few incantations and formations will settle the job.” This was what her master taught her in the past.</p><br/><p>Yue Gu nodded, and then asked her a few more questions, and if she had any troubles. He then tested her on everything that he had taught her in the day. Zhu Yao answered them one after another, and then, he once again supplemented his teachings with a few new information. Zhu Yao faintly felt that him being so talkative was a little strange, but when there was no longer anything to talk about, Yue Gu was still glued to his chair, with no intentions to leave.</p><br/><p>“Teacher… Are you not going back?” Zhu Yao had no choice, but to start chasing him away.</p><br/><p>Yue Gu lightly swept his eyes across… the chair next to him, and still with the same light tone, said. “The place you have here is pretty well made.”</p><br/><p>“…” The corner of Zhu Yao’s lips twitched, and probed him. “Teacher, you can’t be thinking of living here, right?”</p><br/><p>“Since that’s the case…” Yue Gu nodded. “Your teacher shall take up your offer.”</p><br/><p>“Ah!?” What’s going on?</p><br/><p>“I’m going to live here.”</p><br/><p>“Aaahhh!!??” Are you kidding me? Where’s your morals? If her teacher were to live in this place… “Teacher… I only have a single bed?”</p><br/><p>“There’s no worry, your teacher doesn’t despise it!”</p><br/><p>But I do! Zhu Yao hugged her chest. Even if he had the same face, she still had her principles, alright? She’s born as her master’s, and she would die as her master’s!</p><br/><p>“It’s getting late, it’s time to rest.”</p><br/><p>“What?” She was completely dumbfounded. She never expected that her new teacher would actually be this open-minded. In her mind, various censored and blackened images popped up. Don’t force my hand!</p><br/><p>With a calm look, Yue Gu walked towards her…</p><br/><p>And then, calmly picked her up…</p><br/><p>Calmly…</p><br/><p>He threw her out of the house.</p><br/><p>“I will teach you new arts tomorrow. Have an early rest.”</p><br/><p>And then, with a bang, he closed the door.</p><br/><p>Zhu Yao: “…”</p><br/><p>She simply felt like cussing her heart out right now. The hell, he actually did not mistake her for something else this time.</p><br/><p>No wait, so he was especially here to steal her house? Highgod, do the other Gods know of how shameless you are?</p><br/><p>Was there the need to do so? It’s just a straw cottage. He, a mighty ancient God, actually snatched it away from his disciple. It wasn’t as though he didn’t have a place to stay, after all, he clearly…</p><br/><p>Wait a minute!</p><br/><p>That durian spirit seemed to have said that Yue Gu lived on this mountain peak. And other than a plain field of grass on the peak, there wasn’t any other structures to be seen.</p><br/><p>Uh…</p><br/><p>Could it be that he simply did not know how to construct buildings, and hence, had been camping outdoors the entire time? She suddenly recalled that during the first time she met him, he seemed to be really… sleeping while standing on that field of grass.</p><br/><p>Alright. For a Highgod to live like this, teacher, you sure are an embarrassment.</p><br/>\n</div>"}