{"title": "Chapter 207: Sidequest Item", "id": 207, "volume": 3, "url": "http://boxnovel.org/my-disciple-died-yet-again-chapter-207-sidequest-item", "volume_title": "Volume 3", "body": "<h1>Chapter 207: Sidequest Item</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 207: Sidequest Item</p><br/><p>The corner of Zhu Yao’s lips twitched, as she turned around and headed in the direction she came from. Did he treat her as stupid? The high mortality rate of a place like that could be seen with a glance. She, as a Foundation practitioner who had depleted her spiritual energy, would not send herself to death. Not to mention Sesame had already been saved. With a tenth-ranked demonic beast like him, returning to the surface would be easy peasy.</p><br/><p>Ting!</p><br/><p>Just as she turned around, a conversation window suddenly leapt up in front of her.</p><br/><p>“Ren Woxing of the Three Realms” (Navigation) Treasure Locating System, is here to serve you.</p><br/><p>[Begin] or [Begin]</p><br/><p>What’s with this treasure locating system? This was simply the same navigation system as back then, right? If he wanted the name to be changed, then he shouldn’t have revealed the word ‘navigation’! Did he really believe that by adding brackets, she wouldn’t recognize it? Even if he was doing perfunctory work, this shouldn’t be how it was done! He must had typed wrongly, right?</p><br/><p>If you have the guts, I dare you to name it Invincible of the East!</p><br/><p>Ting!</p><br/><p>“Invincible of the East of the Three Realms” Treasure Locating System, is here to serve you.</p><br/><p>Zhu Yao: “…”</p><br/><p>Flips table! This old lady isn’t going to look for treasures, why don’t you come bite me then!?</p><br/><p>Ting!</p><br/><p>Sidequest 1: The target has appeared! Please click on the button to proceed!</p><br/><p>“…”</p><br/><p>Ah~ Her chest was hurting.</p><br/><p>Zhu Yao sighed deeply, as she silently tapped on the [Begin] button. Everything was for the breasts! ╮(╯▽╰)╭ She’s just that adaptable.</p><br/><p>All of the conversation windows instantly disappeared, and a green arrow appeared in her line of sight.</p><br/><p>The third passage from the left, forward!</p><br/><p>“Sesame, let’s go.” As she dragged the person who was still hugging onto her thighs, she walked towards the third passage. After pondering for a moment, she stopped, turned to look at the Risefire Beast following behind her, and said. “You stay here.”</p><br/><p>“Meow~~” The Risefire Beast was instantly drowning in tears.</p><br/><p>“Your figure is too big, and you don’t know how to take up a human form either, it will be very dangerous if you follow us. You can either wait here, or go play on your own. Understand?”</p><br/><p>“Meow.” The Risefire Beast nodded, as it looked at her with starry eyes.</p><br/><p>“Be obedient~” Zhu Yao reached out her hand to stroke its huge head.</p><br/><p>“Meow~” The Risefire Beast’s expression instantly turned soothened, and that tender voice once again sounded. “Ah~ She stroked my head, stroked my head. Beastie will never wash its head again.”</p><br/><p>“…” Get away from me!</p><br/><p>Zhu Yao’s expression darkened, as she hurriedly walked into the passage with Sesame.</p><br/><p>Along the way, Zhu Yao heightened her senses to a hundred twenty percent. She had Sesame as her trump card, and the cultivation level of the practitioners of this world was low as well, so there shouldn’t be any sort of danger. However, that Devil Restraining Seal earlier had worried her a little. That was a sealing technique which only the ancient gods knew, and she was even taught by the authentic Highgod Yue Gu herself. However, there was still such a seal in the Lower Realm, which made her suspect if it was actually related to the God race?</p><br/><p>She had thought that the mechanisms and formations would become even more complicated and incredible as she walked further in, but unexpectedly, their walk was smooth without a single interruption, everything was pretty smooth-sailing. Though, she had a faint feeling where she was heading further and further down into the depths, and their surroundings grew even dimmer as well.</p><br/><p>After she selected the path, that treasure locating system had only changed the direction twice, and it no longer moved as they walked straight forward.</p><br/><p>Two hours later.</p><br/><p>The final hint appeared on the treasure locating system.</p><br/><p>Walk three meters forward and you will reach your destination.</p><br/><p>Walk three meters forward…</p><br/><p>My ass!</p><br/><p>It was clearly a wall in front of their eyes, where did the system want her to walk forward to!? This was actually a dead end.</p><br/><p>This treasure locating system must be a pirated version, right?</p><br/><p>“Mistress, there’s no road from here on. Are we going to turn back?” Sesame asked.</p><br/><p>“Let me think!” Zhu Yao stood next to the wall, the arrow in front of her eyes however had still yet to disappear. Also, a large portion of it had even merged into the walk in front of her. Could it be that there was something behind this wall? “Sesame, shine a light!”</p><br/><p>Sesame twisted his palm, and in an instant, a ball of flames appeared in his hand. The place that was still dim earlier, instantly brightened up quite a bit.</p><br/><p>Zhu Yao continued to look at the wall in front of her, and realized it was built from square blocks of similar size. Zhu Yao placed her hand onto it, and faintly felt that the wall was uneven, as though something was engraved on it.</p><br/><p>“Sesame, use a wind-type art and try to blow away the dust.”</p><br/><p>Sesame nodded. A wild gust of wind blew, and the dusty wall earlier was instantly completely cleaned, revealing a wall that was filled with words written on it. A character was written on every single square block, and it was in a language which she completely did not recognize at all. They did not looked like runic characters, nor did they look like seal characters.</p><br/><p>Zhu Yao took a few steps back, and after staring at them for a long while, she still couldn’t figure out what was written. And, those characters were very spread out, they were like grids used for elementary school students to practice writing on, with a single character on every single grid box. Then, after an empty row, there were another set of similar characters.¹</p><br/><p>A strange wall like this was either a formation or a mechanism.</p><br/><p>She was proficient with formations, but as for mechanisms, she only knew…</p><br/><p>Wait a minute!</p><br/><p>Zhu Yao looked at the wall back and forth, a ridiculous thought suddenly sprouted out in her mind. This grid looked a little like…</p><br/><p>When this thought came about, she immediately shook her head.</p><br/><p>Heheh, how could that be possible? Words written in such a high-end language couldn’t possibly be used for such an idiotic game.</p><br/><p>However, she could not help but reach out her fingers to tap on two similar characters.</p><br/><p>Suddenly, with a creaking sound, the two characters flashed, and they instantly disappeared along with the blocks they were written on… Yes, they disappeared… they disappeared… disappeared…</p><br/><p>“…”</p><br/><p>The hell, this is really a game of ‘find the pair’, hey! What happened to the promised mechanism? What happened to the promised high-end language? The final obstacle is actually just a ‘find the pair’ game? Aren’t you embarrassed?</p><br/><p>Zhu Yao felt that her intelligence was being severely scoffed at.</p><br/><p>“Mistress. This is…”</p><br/><p>“Don’t bother me, I want some time alone!”</p><br/><p>Zhu Yao quietly calmed herself down for five minutes, before she finally resigned to her fate and stood up. She began to pair up the characters and eliminate those blocks.</p><br/><p>In just a short while, only two blocks remained out of the entire wall. In an instant, the positions, where the disappeared blocks were at before, released a white glow, instantly lighting up the entire space. Just as Zhu Yao was about to eliminate the last pair, she was stopped by Sesame.</p><br/><p>“Mistress…” Not knowing when it started, Sesame’s face was already filled with fear, and his entire body was even trembling as well.</p><br/><p>“What is it?”</p><br/><p>“Be… Behind the wall…” He pointed at the white light with his trembling fingers. “There seems to be… something scary… It’s frightening!”</p><br/><p>Frightening? Zhu Yao calmed her heart down and sensed for a moment. She wondered if it was because her cultivation level was low, but she couldn’t sense anything scary. Instead… she felt a sense of familiarity.</p><br/><p>“Mistress, don’t go!” Sesame pulled onto her hand.</p><br/><p>Zhu Yao frowned. She had known Sesame for such a long time, but this was still the first time she had seen him this frightened. Could it be that there was something incredible behind this wall?</p><br/><p>She was a little hesitant. The arrow of the treasure locating system was still pointing in the same direction, and its distance was still maintained at three meters.</p><br/><p>She took in a deep breath. She had already walked all the way here, no matter what, she had to test it out.</p><br/><p>“Sesame, wait for me here.” Zhu Yao instructed, before she reached out her hand to tap on the last two blocks.</p><br/><p>Suddenly, a strong ray of light swept over, which disappeared right after. A vast view appeared before her eyes. Behind the wall was a lush field with mountains and rivers decorated around, filled with the songs of birds and the fragrant scent of flowers.</p><br/><p>Zhu Yao was a little stunned. Never did she expect that a place like this was actually behind the wall, as though she had entered another land.</p><br/><p>This was actually small sized mustard seed dimensional space.</p><br/><p>The treasure locating system turned off at the same time.</p><br/><p>You have reached your destination. Navigation has ended.</p><br/><p>Zhu Yao walked into that land.</p><br/><p>Boom…</p><br/><p>Suddenly, thunder roared. A ray of lightning struck down, landing a few meters away from her. Zhu Yao was given a fright, as she raised her head to take a look.</p><br/><p>In an instant, all sorts of curses ran through her mind.</p><br/><p>The word ‘bug’ was actually suspended in the sky right above the center of the land!</p><br/><p>No wait, it was a sword with the word ‘bug’ written on it.</p><br/><p>That sword was as huge as a mountain, and it was floating in the sky. Countless lightning sparks enveloped the blade of the sword. Looking from afar, it looked like a sword which was formed by lightning itself. Even her forehead was faintly aching from its intense, cold sword aura.</p><br/><p>It seemed like this sword was the target of her sidequest this time.</p><br/><p>Zhu Yao gritted her teeth, and flew towards it.</p><br/><p>After approaching it, she realized that other the word ‘bug’ that was on the sword, there was a bracketed ‘God’s Artifact 1’ next to it.</p><br/><p>The hell, forget about it being a god’s artifact, what’s with that number ‘1’ next to it? So was it indicating that there were still two, three, or even dozen more of them? Just how many sidequests were there, hey?</p><br/><p>Zhu Yao really wished to ask Realmspirit for his family registry!</p><br/><p>She found the bug, but what could she do about such a large sword? It was a god’s artifact, so she couldn’t possibly destroy it, then did she have to eat it? Don’t give me such an impossible mission, hey!</p><br/><p>Zhu Yao felt like crying. After circling around the sword several times, she still couldn’t find where she should start biting from?</p><br/><p>Just as she was about to return, the sword suddenly shook. In an instant, the world trembled. As Zhu Yao failed to stabilize herself on her flying sword, her hands flew, and she pressed onto the blade of the sword.</p><br/><p>“…”</p><br/><p>She had a bad premonition.</p><br/><p>The trembling instantly stopped. Intense lightning spiritual energy suddenly began to pour wildly into her body.</p><br/><p>As Zhu Yao did not prepare herself, she puke out a mouthful of blood. However, the spiritual energy still continued to freely pour into her body.</p><br/><p>“Mistress!” Sesame flew into the place, and carried Zhu Yao back to the surface. “How are you?”</p><br/><p>The lightning spiritual energy in her body did not stop circulating, and they were even crashing and colliding wildly within her body. As though they had held a grudge with the wood spiritual energy in her body, they completely engulfed the remaining wood spiritual energy. Zhu Yao felt her meridians were beginning to tear apart inch by inch, and it pained her to the point where she could barely stand.</p><br/><p>A certain switch seemed to have turned on within the bug god’s artifact, as it began to rampage. Crackling bolts of lightning struck all around the place.</p><br/><p>Zhu Yao was already unable to suppress the lightning spiritual energy which suddenly appeared in her body, and her consciousness began to blur as well.</p><br/><p>Suddenly, a red formation light shone beneath her, and in the next instant, a figure donned in a snow-white robe appeared next to her. He had a face that she was extremely familiar with.</p><br/><p>“Master…” Zhu Yao was instantly a little more clear-headed. “How did you…?” How did he appear in this place?</p><br/><p>“The Spirit Rhinoceros Formation you placed!” Yu Yan casually explained. “When I woke up, I sensed that you were in danger, so I activated that formation.”</p><br/><p>I see!</p><br/><p>When she left, she was a little worried, so she placed down a unique Spirit Rhinoceros Formation. That was a formation Shao Bai taught her back then. With the formation setter’s blood as guidance, if the target of the formation encountered harm, or the target himself activated it, the formation would directly transfer the target next to the formation setter. The term ‘Spirit Rhinoceros’ implied that hearts of a common beat were linked.</p><br/><p>¹The grid-like thing that Chinese elementary school students practice their writing on is something like this: here</p><br/><p>Yeah, I remember practicing writing all the new characters I learn too on workbooks such as these.</p><br/>\n</div>"}