{"title": "Chapter 218: Don’t Force My Hand", "id": 218, "volume": 3, "url": "http://boxnovel.org/my-disciple-died-yet-again-chapter-218-don%E2%80%99t-force-my-hand", "volume_title": "Volume 3", "body": "<h1>Chapter 218: Don’t Force My Hand</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 218 Don’t Force My Hand</p><br/><p>“How do you know that?” Lin Qi was startled. “Clearly you’re just an Azoth practitioner, but you’re actually able to see through my true form?”</p><br/><p>The corner of Zhu Yao’s lips twitched. “You’re a Qilin?”</p><br/><p>Lin Qi was even more stunned, as he sized her up with a glance. “How do you know that?”</p><br/><p>“It’s hard not to figure out, alright?” Zhu Yao’s face darkened. “Please, when you’re trying to conceal your identity next time, first change your name, alright?” Lin Qi, Qilin? You’re thinking the entire world is illiterate, is that it?</p><br/><p>And earlier, he had just admitted to it himself!</p><br/><p>Lin Qi’s expression sank. With a slightly anxious look, he glanced at Yi Ling at the back. Seeing that she was still breaking through a bottleneck and had not awaken from her trance, he heaved a sigh of relief. With a wave of his hand, he added a layer of protection barrier on her, and then glared at Zhu Yao.</p><br/><p>“So what if you found out? As an offender of a God, I will not let you live in this world either.” His expression turned cold, and a red light shone in his eyes.</p><br/><p>“Mistress…” Sesame’s head was instantly covered with sweat. With a pained expression, its hands stiffly cast an art, and several icicles instantly appeared in the surroundings, aiming at her. However, they did not move even after a long while. Suddenly, it gritted its teeth, and a streak of red blood flowed out from the corner of its lips. “Mistress, hurry… hurry and leave.”</p><br/><p>“Sesame!” Seeing it like this, it clearly still had its reason and did not want to attack her either. Sesame was simply being controlled, and Zhu Yao instantly felt something was wrong.</p><br/><p>Lin Qi however loudly said. “Kill!”</p><br/><p>In an instant, like arrows which had left their bowstrings, the icicles flew straight towards her. It was basically a three hundred sixty degrees concentrated shot without any blind angle to take advantage of.</p><br/><p>Zhu Yao retreated in a flash and erected a defensive barrier. She desperately circulated the spiritual energy in her entire body, and was barely able to block against those icicles. Raising her head, she saw that even more icicles had risen around Sesame.</p><br/><p>Sesame’s actions were stiffening even more than before. It was clearly the one launching the attacks, but it seemed to be the one suffering the worst damage. Blood flowed profusely from the corner of its lips. “Hurry… Hurry and leave…”</p><br/><p>The hell, you’re already in this shape, how are you expecting me to possibly leave you here and leave on my own?</p><br/><p>It seems like this is the only way.</p><br/><p>“Sesame, endure for a moment.” Zhu Yao released her divine sense, and sensed all of the water spiritual energy in the air. Then, she gathered them together. At the instant the second wave of icicles came attacking, she activated the art. “Ice Seal of a Thousand Miles!”</p><br/><p>In an instant, thick layers of ice spread throughout the hall, and was headed straight for Sesame. In an instant, Sesame was sealed in a gigantic rectangular block of ice. Zhu Yao cast an art, and immediately drew a seal on the ice. This was one of the seals Yue Gu taught her back then – Absolute Seal. It was similar to a binding formation, but more powerful. Even Devils would be unable to escape from within.</p><br/><p>However, she had always used godly energy to establish this seal, and she presently had no choice but to use spiritual energy to activate it.</p><br/><p>Though it had succeeded, the moment it activated, she suffered a rebound from the seal. She could seemingly hear the crackles from her Azoth Core cracking, as she puked out a large mouthful of blood.</p><br/><p>“You sure have some capabilities, but…” Lin Qi coldly snorted, as lightning flashes once again appeared in his hands. “You’re destined to die here today.”</p><br/><p>After saying that, with a grasp of his hand, dozens of purple colored lightning streaks came flying towards her from all directions like earthworms.</p><br/><p>Zhu Yao wanted to flee from reflex, however, realizing that Sesame was behind her, she could only erect a barrier.</p><br/><p>But in the middle, the lightning streaks suddenly turned into purple ball of flames that flew straight towards her. That Demigod might once again came assaulting her from all directions, and Zhu Yao was rooted in her present spot, not able to move an inch.</p><br/><p>Zhu Yao gritted her teeth. It seemed like she had no choice but to resist it head on.</p><br/><p>Just as that fireball was about to envelop her, a black figure suddenly came cutting in from the side and hugged her in an instant, shielding her from the blow.</p><br/><p>Zhu Yao suddenly widened her eyes greatly. Watching as the youth who was smiling ever so gently being submerged in the flames, a voice so light, as though it came from the distant skies, sounded. “Big Sis Yao…” She felt as though she was looking at that scene back then when she opened the World Crossing Heavenly Door. The scene where that white-clothed youth was reaching out a hand towards her, speaking to her with a pleading tone. “Little sister, be obedient! Come out, alright?”</p><br/><p>“Yue Ying!” Zhu Yao grabbed onto the youth who was falling in her direction, and in an instant, she was so anxious she couldn’t feel her own heartbeat.</p><br/><p>However, he was still carrying that gentle smile, as though he was completely oblivious of his miserably burnt state. Green light flashed from his body, and a moment later, a charred black fruit landed in her hands.</p><br/><p>“Yue Ying… Yue Ying!” She could feel the presence of Yue Ying’s soul within the fruit, however she was still trembling from fear. If anything were to happen to Yue Ying… If anything were to happen to him…</p><br/><p>She was simply unable to picture that possibility.</p><br/><p>“Big Sis Yao, I want to nap a little.” After a while, a familiar voice sounded from the depths of her heart. Only then did Zhu Yao’s anxious heart calm down a little.</p><br/><p>“Hmph, there’s actually still someone who dares to activate the teleportation formation and sends himself here to die!” Lin Qi coldly snorted with a belittling look. “You practitioners sure are stupid.”</p><br/><p>“Are you done?” Keeping Yue Ying who had reverted back to his true form into her divine sense, she then slowly stood up. In an instant, she could only feel anger creeping up from the depths of her heart, and then, a pop sounded in her mind. Something had snapped. She had lived for so long, yet she had never been this furious in her entire life, as though every single cell in her body was clamoring, wanting to vent her frustration, to the point where boundless and endless energy suddenly surged from within her body. Coldly glaring at the man who was smiling complacently, she took a deep breath. “Then, are you prepared to kowtow and apologize?”</p><br/><p>“What did you say?” Lin Qi’s brows furrowed, as he stared at her with flaming eyes.</p><br/><p>“Initially, seeing that you were a God, I didn’t want to make this a huge fuss.” Zhu Yao raised her hand, and said with emphasis on every word. “But in this world, there’s always a few bastards who don’t know why flowers are so red without being taught a lesson!”</p><br/><p>Zhu Yao’s eyes sharpened. The fury and spiritual energy within her entire body were released in an instant. With a twist of her hand, that rainbow feather appeared on her palm, and a gigantic lightning phoenix had already appeared above her without her summons.</p><br/><p>That rainbow feather seemed to have suddenly been activated, and with a flash of red light, a crimson fireball instantly covered it entirely, causing its shape to undergo a change. A moment later, it turned into a flaming long sword.</p><br/><p>“That’s… the Ruling Plume!” Lin Qi was startled, as he looked at her with a face of disbelief. “This… How is this possible? You’re actually able to activate the Ruling Plume of the Phoenix clan. Could you be… a God as well?”</p><br/><p>“I’m your mother!” Zhu Yao’s body flashed, and with a swing of her hand, monstrous flames assaulted Lin Qi. That lightning phoenix let out a long cry as well, as it flew towards him at the same time.</p><br/><p>Lin Qi’s first reaction was to dodge, shifting to the side. Unfortunately, the crimson flames were like chains, instantly entangling his legs and pulling him back with an abrupt jerk. An irresistible pressure instantly came pressing down on him, preventing him from moving even a single inch.</p><br/><p>And at this moment, that lightning phoenix had already flown over. Transforming into countless streaks of lightning, it zapped his body charred and crisp.</p><br/><p>Lin Qi puked out a mouthful of blood, and simply felt as though his organs were being torn apart. “How… How is this possible?” He was a God, one of the God race! How could there be possibly anything in this world that could harm him?</p><br/><p>Forget about the Ruling Plume, since it was a God’s artifact after all, but were these lightning streaks capable of harming him?</p><br/><p>Lin Qi was thrown into disarray, as he immediately released a defensive barrier. Circulating the spiritual energy in his body, he summoned the purple flames that appeared before, and attempted to suppress the Ruling Plume’s godly flames. However, they were completely ineffective. With a single wave of Zhu Yao’s sword, the purple flames were instantly scattered.</p><br/><p>He could only attack while being pushed back. Gritting his teeth, he instantly resorted to using his own Life Origin Fire – the purest form of energy belonging to Qilins. As expected, when the flames appeared, half of the surrounding godly flames brought upon by the Ruling Plume was extinguished. He expression looked joyous for a moment.</p><br/><p>Suddenly, with a long sharp caw, the lightning phoenix once again charged straight down and directly swallowed those unique flames. Then…</p><br/><p>It burped!</p><br/><p>“…” This was illogical!</p><br/><p>That lightning phoenix paused for a moment. Instantly, other than the lightning sparks on its body, purple flames began to appear as well, as though it had completely assimilated with his Life Origin Fire. Furthermore, on Zhu Yao’s palm, a small bundle of purple flames appeared as well.</p><br/><p>Lin Qi was instantly dumbfounded. His… His Life Origin Fire…</p><br/><p>This definitely wasn’t real!</p><br/><p>Zhu Yao did not care about the warmth that suddenly appeared within her body. Currently, her entire mind was focused on wanting to beat this bastard in front of her eyes, to the point where his mother would not be able to recognize him. Seeing him stunned, she directly raised her leg, and kicked him away.</p><br/><p>Making a groaning sound, like a shower head which had been sent flying, Lin Qi flew several meters away while puking out blood.</p><br/><p>However, at the instant he was about to land, he was once again pulled back by the bundle of flames. Then, the lightning phoenix once again zapped him charred black. The situation repeated as such. For a moment, the place had turned into Zhu Yao’s one-sided slaughtering ground.</p><br/><p>Lin Qi expressed that he had already been completely abused and turned into a dog.</p><br/><p>After a long while later, Zhu Yao finally retracted her own sword intent, and walked towards Lin Qi a step at a time.</p><br/><p>Lin Qi was totally shaken, as he fearfully looked at the woman who had a completely darkened face, his entire body was trembling without end. Mommy, why hasn’t anyone told me that human practitioners are this terrifying?</p><br/><p>What demeanor? What pride? What respect for his own race? In an instant, he ate them all up.</p><br/><p>With a thud, he knelt down with all his joints touching the ground. “Great goddess, I was wrong!”</p><br/><p>Zhu Yao’s feet stopped three steps away from him.</p><br/><p>“Great goddess…” Lin Qi no longer had that mighty demeanor he had just moments ago, and his entire expression showed that he was filled with regrets. With snot coming out from his nose and blood flowing out of his mouth, he raised his head. “I was really wrong, great goddess please forgive me!”</p><br/><p>“Wrong?” Zhu Yao stabbed her long sword to the side, and raised the corners of her lips, giving an especially gentle and kind smile. With a gentle voice, she said. “If apologies have any use, what’s the need for police officers then!?” Her voice suddenly turned cold, and with her hand raised, she sent a punch to his face. Using strength from her entire body, she pummeled her fists onto that face of his, and every attack of hers sank deep into his skin.</p><br/><p>“How dare you bully my Sesame!? How dare you motherfu*king harm my Yue Ying!?”</p><br/><p>“Apologize? Do you think an apology can make up for their injuries?”</p><br/><p>“I’m telling you, no way! The way you injured them, I will have you return everything back!”</p><br/><p>“With the shoddy look you have, you dare call yourself a God!? If you dare call yourself a God again, I will beat you down to the point where you can’t live on your own!”</p><br/><p>“This is what you get for bullying people! This is what you get for acting all so tough!”</p><br/><p>Zhu Yao had seemingly abandoned the use of any mystic arts completely, and was simply sending him fists after fists, giving him a ruthless beating as though he was trying to vent off her steam. She vented all of the earlier worries, fear, sadness, and pain onto that face of his, punching it from all different angles.</p><br/>\n</div>"}