{"title": "Chapter 220: Long Live My Empress", "id": 220, "volume": 3, "url": "http://boxnovel.org/my-disciple-died-yet-again-chapter-220-long-live-my-empress", "volume_title": "Volume 3", "body": "<h1>Chapter 220: Long Live My Empress</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 220: Long Live My Empress</p><br/><p>“Senior-martial sister Zhu.” The pink figure raised her pair of star-filled eyes, and said with affection. “To be in the same sect as you, it must be a blessing cultivated from my previous three lives.”</p><br/><p>“Hohoho…” Imagination, this was definitely her imagination. Why was she seeing Yi Ling hugging her thigh?</p><br/><p>Zhu Yao raised her hand and desperately pressed on the ‘Off’ button for her World Favourable Impression ability. Hurry and revert back to normal, hey.</p><br/><p>Though the World Favourable Impression ability had turned off, Yi Ling did not undergo any change at all. She shyly raised her head and glanced at Zhu Yao. “In this vast sea of people, for us to be able to meet, Ling’er has no regrets in life!”</p><br/><p>“You made a mistake, right?” Don’t say such strange things, hey!</p><br/><p>“How is that possible? I can make mistakes recognizing everyone in this world, but only senior-martial sister Zhu…” Her face was ripe red like an apple. “Ling’er… will never forget her entire life.”</p><br/><p>Zhu Yao simply felt her skin crawling from the bottom of her feet all the way to the top of her head, and her entire body trembled. She grabbed onto Yi Ling’s shoulders, and instantly shook her back and forth.</p><br/><p>“Yi Ling, are you alright? Hurry and wake up! Don’t scare me!” What happened to the promised Mary Sue? This is not a yuri novel, hey.</p><br/><p>Her eyes were instantly filled with gratitude, and her smile was now overflowing with gentleness. “Senior-martial sister Zhu be at ease, Ling’er is now alright. All thanks to senior-martial sister protecting me at the side, Ling’er was finally able to successfully form her Azoth Core.” After saying that, she shyly looked at her. “You’re… actually so worried about me… I’m… so happy.”</p><br/><p>“…” Why the hell are you happy!? I’m not happy, alright? “I beg you, act normal! Behave like the Mary Sue you are!”</p><br/><p>This girly is definitely infected by the World Favourable Impression ability, it has to be, right!?</p><br/><p>Yi Ling was wildly shaken by her, and even her hair bun had collapsed as well, however, she still said without any regrets. “Since senior-martial sister doesn’t allow me to say it, then… The good things that you did for me, Ling’er will remember them by heart.”</p><br/><p>What do you want to remember? Don’t remember some strange things, hey!</p><br/><p>Zhu Yao even had the thought of stomping her feet now. Could anyone explain to her why the World Favourable Impression ability did not discriminate its targets!? At the very least, consider the other party’s gender!</p><br/><p>Sesame was also shocked by this incredible development, as it glanced at the two of them back and forth. “Mistress?”</p><br/><p>“Don’t ask me right now!” Zhu Yao placed her two hands on her head, then proceeded to squat down at the corner of a wall and draw circles. Her entire body emitted out an aura of fatigue. “I only want peace and quiet right now.”</p><br/><p>Yi Ling’s face instantly paled, and within her eyes, tears began to swell. “Who is Peacent Quiet?”</p><br/><p>Puaah…</p><br/><p>Please let me puke out blood in peace!</p><br/><p>“Ahh… Master! I don’t want to live anymore.” After throwing Yi Ling back to the crowd of practitioners, Zhu Yao flew back to the mustard seed dimensional space Yu Yan was in, and pounced into her master’s arms. The various grievances and frustration came tumbling out from her lips. “Master… I feel that my morals have received hundred percent damage, directly shattered into pieces, and can never be restored!”</p><br/><p>Yu Yan casually caught her, and habitually combed her messy hair with his fingers. WIth a stern look, he said. “Morals? What’s that?”</p><br/><p>“…” She was actually left speechless.</p><br/><p>“Aaah! I don’t care anymore, whatever the case, my heart has suffered a severe blow.” Zhu Yao sniffled, and buried herself in his chest, forcefully rubbing about. She then casually pulled over his wide sleeves to wipe her face. After a long while, she finally found some comfort.</p><br/><p>Yu Yan whose entire body was covered with tears and snot: “…”</p><br/><p>He helplessly sighed, as though he had already gotten used to his disciple’s strange antics that occur from time to time, and then cast a Dirt Removal Art on himself. He habitually pulled his stupid disciple’s hand, and checked her pulse. He then asked in passing. “How’s the situation of the beast wave?”</p><br/><p>Before Zhu Yao could reply, Yu Yan’s expression suddenly changed. “What’s the object within your divine sense?”</p><br/><p>Raising his finger, he tapped onto her forehead. Then with a wave of his hand, two rays of light instantly flew out, and a black fruit and a rainbow-colored feather floated in the air.</p><br/><p>She had almost forgotten about the exact matter at hand!</p><br/><p>Zhu Yao hurriedly recounted everything that happened.</p><br/><p>“Master, help me take a look, will Yue Ying be fine?” The reason why she was here was mainly for Yue Ying. Although she could feel his presence within the fruit, she was unable to feel at ease.</p><br/><p>Yu Yan frowned. Looking at his stupid disciple’s worried expression, he was feeling irritated for some reason. The cold aura from his body unconsciously began to suffuse into the air.</p><br/><p>So unhappy. Why did he have to attend to an irrelevant… fruit?</p><br/><p>“Master?” Zhu Yao tugged onto his sleeves. Why did she suddenly feel a little chilly?</p><br/><p>Yu Yan furrowed his brows, and only after a while did he coldly voice out. “He has simply depleted his spiritual energy, and has reverted back to his true form. He will naturally be fine after recovering his spiritual energy.”</p><br/><p>Zhu Yao heaved a sigh of relief. It seemed like she had to once again bury Yue Ying back into the hole. “It’s good that he’s alright.”</p><br/><p>“Yu… Yao.” Yu Yan glanced at Yue Ying who was in a fruit state, and his expression instantly turned cold. With a stern look, he said. “Divine sense is where the core of human life resides. In the future, remember not to simply store anything within your divine sense.” Especially if it’s an irrelevant man.</p><br/><p>“I was just anxious.” Back then, she simply wanted to find a safe place to settle Yue Ying down, so she unconsciously stored him within her divine sense.</p><br/><p>Yu Yan stroked her head, and said sternly. “There must not be a next time.”</p><br/><p>“I understand.” Zhu Yao nodded, and with a wave of her hand, that feather in the air flew towards her palm on its own. “Master, take a look at this too. Just what is this? Back then when I saw that Devil use it, it seemed to be a flute, but when I was using it, it turned into a sword.”</p><br/><p>Yu Yan lowered his head and inspected it for a moment. “This feather… Seems to be a feather of a certain species of birds. The spiritual energy stored within can’t be estimated, and it’s also another god’s artifact… If your master did not make a mistake, then this should be the tailed feather of a Phoenix, and Ruling Plume is its name.”</p><br/><p>“The tail feather of a Phoenix!” Zhu Yao was startled. She then carefully inspected this feather. With her master’s reminder, she began to find it even more familiar. Recalling the appearance of a Phoenix’s true form, there was indeed a tail feather like this. As someone who was a former false Phoenix with naked buttocks, she not being able to recognize it at first glance could certainly be said to be… acceptable! ORZ</p><br/><p>“This tail feather has left its original body, but it still contains spirituality. Most probably, this artifact is refined by gathering all of the energy within the body of the original Phoenix who possessed it back then. And your strength has increased because of this god’s artifact as well.”</p><br/><p>“Ah?” What did he mean?</p><br/><p>“Yu Yao, you’re already a Demigod.”</p><br/><p>“What!?” Zhu Yao was startled, and then she hurriedly looked within her. As expected, the Azoth Core in her body had disappeared, and her divine sense was as vast as a sea. Now she understood a little why that Chow Chow Lin Qi could be beaten into a pup by her. Recalling that prior event, her master seemed to have also restored his own cultivation because of obtaining that god’s artifact, then…</p><br/><p>“This tail feather has turned into my life artifact as well?”</p><br/><p>Yu Yan’s expression sank. “No, it did not!”</p><br/><p>+_+ What’s with this special treatment!?</p><br/><p>“The only owner that this tail feather recognizes, is the God that it got plucked out from!”</p><br/><p>“…”</p><br/><p>Mn, she really wanted to find the bird that shed this feather, and chat with him about life!</p><br/><p>Returning to Blue Parasol Sect, Zhu Yao once again buried Yue Ying in the hole at the back, removed the weed in passing, and sprinkled some water. Then, she reinforced the surrounding spiritual energy gathering formation. Confirming that Yue Ying was slowly recovering his spiritual energy, he heaved a sigh of relief. Though he had turned back into his original form, at the very least, his Foundation was not damaged. As long as recovery was done well, he would still be a good fruit in the upcoming year.</p><br/><p>Zhu Yao pondered for a moment, then she added another defensive formation at the side. Now it was perfect. Yue Ying, my obedient child, hurry and grow up into a healthy and handsome young man.</p><br/><p>Raising her head, she glanced at the surroundings. She wondered if it was her imagination, but she felt that the two trees at the side had turned a little greener. Furthermore, they didn’t seem to be bearing fruits earlier, so why were the trees filled with fruits now?</p><br/><p>“Ah, she’s looking at me, she’s looking at me now! I want to bear fruits for her!”</p><br/><p>“Me too!”</p><br/><p>Hualala…</p><br/><p>In an instant, red fruits came dropping down like raindrops, smashing onto Zhu Yao’s head.</p><br/><p>Zhu Yao: “…”</p><br/><p>Do you two have a grudge against me? The moment I return, you two smash my head with fruits.</p><br/><p>“Ahem, umm…” Zhu Yao used her legs to sweep the fruits on the ground, and walked over. Looking towards the tree on the left, she said. “You’re called Tree on the Left, right?”</p><br/><p>“Aaaahh… She’s talking to me, she’s actually talking to me.” The tree on the left wildly shook its leaves from excitement, while its branches were wobbling left and right like they were suffering from spasms, acting as though it was a fan who was looking at an idol of hers.</p><br/><p>The corner of Zhu Yao’s lips twitched, and had no choice but to look at the one on the right. “You’re called Tree on the Right?”</p><br/><p>“Aaah… She’s talking to me too. I like you, you know? I really, really like you.” The tree on the right waved its branches, but at the very least it was calmer than the one on the left, and it replied. “In the past, I was called Tree on the Right, but I have already changed my name. I’m now called Tree on the Right Side of the Hole.”</p><br/><p>“I’m called Tree on the Left Side of the Hole!” The other one excitedly replied.</p><br/><p>“Uh…” With you two combined together, are you two called Trees with Holes on Both Sides of the Brain? Zhu Yao’s face darkened. “Umm… I have presumptuous request, and I wonder if I can ask that of you two… trees.”</p><br/><p>When these words fell, the two trees were startled for a moment. Then, in the next moment, the trees were blooming with little red flowers.</p><br/><p>“Ah, she’s actually saying that we can help her. Aaaaah… I’m not dreaming, am I?”</p><br/><p>“We will help, we will help. We want to help you.”</p><br/><p>“Uh…” Did they have to be this excited about it? “You two saw it as well, I buried a fruit into the hole. He’s someone very important to me, so I hope you two can help look after him, and prevent anyone else from approaching. Is that alright?”</p><br/><p>“No problem!” Tree on the Right Side of the Hole instantly straightened itself.</p><br/><p>“We will definitely look after him well.” The Tree on the Left Side of the Hole silently stretched its roots out.</p><br/><p>“We will not allow anyone to dig it out!”</p><br/><p>“Don’t worry, it’s a piece of cake!”</p><br/><p>“Then that’s good, thank you!” Zhu Yao heaved a sigh of relief. With this two trees keeping watch at every moment, she felt more at ease.</p><br/><p>Just as she was planning to return back into the house, an extremely gentle voice sounded from outside.</p><br/><p>“As I thought, Senior-martial sister Zhu, you have returned?”</p><br/><p>Zhu Yao’s feet slipped, and had almost fell onto the ground. Looking at the happy figure running towards the door, her skin began to crawl again.</p><br/><p>“Don’t come over!” Zhu Yao erected a defensive barrier on reflex. “What do you want?”</p><br/><p>Yi Ling was startled, a hint of pain flashed past her eyes as she looked at Zhu Yao with a wronged look. “Senior-martial sister Zhu… Do you have to be this cautious around me?”</p><br/><p>“Of course!” Zhu Yao nodded sternly.</p><br/><p>Her expression worsened even more. “Back then… they were all Ling’er’s fault. I… I didn’t have a clear mind back then, that’s why… Senior-martial sister Zhu…”</p><br/><p>“Stop!” Please, stop saying anything that’s immoral again. Zhu Yao wanted to cry, but no tears were flowing. “Just why are you looking for me?”</p><br/><p>Yi Ling was startled, and only then did she recall her business here. With an excited look, she said. “It’s master and the Sovereigns. They had me request Zhu Yao… request Lord to the main hall and discuss some serious matters.”</p><br/><p>“Lord? Me?” When did she change her title?</p><br/><p>Yi Ling nodded, her expression was filled with adoration, and she looked at Zhu Yao with sparkling eyes. “Lord, please do not blame me! I know you’re trying to conceal your identity, and help our Blue Parasol Sect secretly, so you have always showed yourself with Foundation and Azoth cultivation levels. But the incident where you… saved me, I have already told my master. And when you sent me home back then, you didn’t conceal your cultivation level, so everyone witnessed it. You’re a Lord at the Demigod cultivation level.”</p><br/><p>“…” So they actually think that the reason I’m suddenly a Demigod, is because I have been concealing my cultivation level the entire time, and was just intentionally acting like an Azoth practitioner!? She had to hand it to them, the holes in their brains… had widened at just the perfect time!</p><br/><p>Then, calling her to the main hall this time was most definitely to rein her in. After all, till now, she had yet to see any sect or clan with a Demigod practitioner. She suddenly felt she could act a little proud now?</p><br/><p>“Ahem… Let’s go then!” Although she had already dealt with Lin Qi, for some reasons, the word ‘bug’ on Yi Ling’s face had still yet to disappear. In other words, Zhu Yao still had to stay in Blue Parasol Sect. Then, she could just treat it as though she was going to give face to the master of this land, and see what they were up to.</p><br/><p>“Lord, this way.” Yi Ling became serious and polite as well, as she respectfully brought her towards the teleportation formation to the main hall.</p><br/><p>WIth a flash of red light, the scenery in front of her eyes changed. In an instant, they had arrived at the square of the main hall.</p><br/><p>Zhu Yao was instantly frightened by the scene in front of her. The entire square was littered with black dots, filled with standing disciples. By her estimate, there were at least more than five thousand people, and they were moving the same way, wearing the same uniform. They stood straight in a disciplined and orderly manner.</p><br/><p>The entire square was completely silent. Xuan Xu and the other two Nascent Soul practitioners, along with Sect Master Lin Yu, were standing at the very front. Seeing Zhu Yao’s appearance, their eyes evidently shone. The four of them hurriedly stepped up, cupped their fists, bent their waist ninety degrees, and loudly shouted in unison. “We disciples greet the Lord.”</p><br/><p>When their words fell, in an instant, as though the loudspeakers were turned on, the several thousands of disciples in the square were like toppled onions, as all of them knelt onto the ground, and loudly shouted in unison. “We disciples greet the Lord!”</p><br/><p>The magnificence of this scene and their deafening voices simply could intensely stir the hearts of people from inside out.</p><br/><p>Thus, Zhu Yao unconsciously stretched out her hands and waved, and she replied with overflowing kindness. “My faithful subjects, raise your heads!”</p><br/><p>Lin Yu: “…”</p><br/><p>Xuan Xu: “…”</p><br/><p>Xuan Yin: “…”</p><br/><p>The other Nascent Soul practitioner with an unknown name: “…”</p><br/><p>The crowd of disciples: “…”</p><br/><p>Uh…</p><br/><p>The hell, it was on reflex! She even thought that she was stepping up to take the throne!</p><br/><p>“Umm… All of you please rise?” Zhu Yao wiped away the beads of sweat that were falling from her forehead due to awkwardness.</p><br/><p>“Yes!” The leading four people straightened their waists. Sect Master Lin Yu then waved his hand to the back, and the crowd of disciples finally stood up one after another.</p><br/><p>“Is there something you people are seeking me for?” Once again she wore that proud and cold mask of hers, as though that idiot earlier wasn’t her.</p><br/><p>“Lord.” Lin Yu respectfully bowed, and with his hand raised, he did a ‘please, this way’ posture. “This disciple indeed has things to consult about, and I hope Lord will enter the hall.”</p><br/><p>The large group of people in front of her suddenly created a path in the middle, which was directly leading her all the way to the entrance of the great hall.</p><br/><p>Zhu Yao raised her feet and walked over. After walking up the steps, she then turned around to look at the crowd of disciples who were still as excited and curious as before. Waving her hands, she said.</p><br/><p>“The audie- Uhh… The rest can leave now.” The hell, she almost told them that the audience with the empress had ended!</p><br/>\n</div>"}