{"title": "Chapter 242: River of Forgetfulness is Too Deep, Throw Some Sand", "id": 242, "volume": 3, "url": "http://boxnovel.org/my-disciple-died-yet-again-chapter-242-river-of-forgetfulness-is-too-deep-throw-some-sand", "volume_title": "Volume 3", "body": "<h1>Chapter 242: River of Forgetfulness is Too Deep, Throw Some Sand</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 242: River of Forgetfulness is Too Deep, Throw Some Sand</p><br/><p>Looking at the snow-white paw in front of her, the fury that initially filled Zhu Yao’s heart, instantly disappeared without a trace.</p><br/><p>She took a deep breath, and managed to suppress the irritable emotions in the depths of her heart.</p><br/><p>She understood that her emotions were in a disarray. She being furious at Bai Yuan, most of it was also because she was angry at herself. Her master was unconscious, the resentment in little wimp’s body had yet to be expelled, and she had even fallen into this ghastly place with her cultivation destroyed. In this sort of situation, forget about having a good temper, her irritation had gotten to the point where she even wanted to kill people, you know?</p><br/><p>So, even though she clearly knew that Bai Yuan did not harbour evil intentions, she still lost control and became furious. Furthermore, it was even the one which pushed her down here.</p><br/><p>“Sorry!” Zhu Yao sighed, as she reached out to pat on its beast head. “Bai Yuan, let’s talk about life.”</p><br/><p>“Ou?” It opened its large misty eyes. It glanced at her, and then looked at its own paw.</p><br/><p>“Paw?”</p><br/><p>“I’m not going to pull anymore.” It was already acting like this; how could she possibly still have the heart to pull its fur?</p><br/><p>Its misty eyes then brightened up a little. Putting down its paw, it carefully squatted next to her.</p><br/><p>Where should she start? Oh right. “Why have you been following me?”</p><br/><p>Bai Yuan seemed to be stomping its front paws in a helpless manner as it stammered. “Like… Like Yao Yao. Said before… Friends… Want be.” Its head sank even lower, and it became a little bashful. Zhu Yao was actually able to see a hint of shyness and timidness on that furry face. She must have gone blind!</p><br/><p>“Then why did you push me down here?” Are there anyone like you who make friends this way?</p><br/><p>This time, it replied really quickly. “Because there is a place you must see, and I have to bring you there.”</p><br/><p>“See?” Zhu Yao was startled. “See what?”</p><br/><p>Bai Yuan nudged a little before standing up. It ran a few steps to the direction on the left, and then happily ran back. “Go. Take a look, take a look…”</p><br/><p>“Wait a minute.” Zhu Yao followed after it. “What are you going to let me see?”</p><br/><p>“Yao Yao, faster… faster. It’s just up front.” It evidently had such intentions from the beginning, as it excitedly leapt and bounced while leading the way in front of her. “Look. Look…”</p><br/><p>“Just what am I supposed to see?” Wait a minute! A light bulb flashed in Zhu Yao’s mind. “You came here before?”</p><br/><p>“Ou~~~”It nodded its beast head.</p><br/><p>“Then do you know the way to leave?”</p><br/><p>“Bai Yuan knows!” It lifted its chest with a proud look.</p><br/><p>“…” Would it have killed you to say that earlier!? She even thought that she was going to die here. What she was using now was her original avatar, dying would feel really hurtful, you know? “Are you very familiar with this place?”</p><br/><p>“Bai Yuan knows everything about this place.” It bounced and leapt as it led the way in front of her.</p><br/><p>“Then is there any person or object that can exterminate resentment here?”</p><br/><p>“Person?” Bai Yuan paused for a moment, and looked at her while tilting its head. It then said a little embarrassingly. “There’s only one person here.”</p><br/><p>“Who is it?” There actually was one. It seemed like this was not a wasted trip.</p><br/><p>“I will bring you there.” Bai Yuan happily ran to the front.</p><br/><p>Zhu Yao did not waste time either, as she immediately followed after it. After walking for fifteen minutes, a streak of light suddenly appeared within this dark horizon, a silvery white thin line appeared at the front. It was a single long line with unlimited length, as though it had split this world into two.</p><br/><p>After taking a closer look, she realized that was actually a river, and its entirety was silvery white. The river was so broad, it was impossible to see the other side with a single glance. She had only seen such a mystical river once. “River of Forgetfulness?”</p><br/><p>Why did the River of Forgetfulness appear here? Had she returned to the Underworld? But the scenery was evidently wrong though?</p><br/><p>Bai Yuan turned, and ran up a few steps. “Move upwards, to the source… We’re reaching really soon.”</p><br/><p>Source! With how broad the river was, she really could not imagine just how far the source could be. It would still be fine in the past, but now, she did not have the slightest bit of cultivation. She was going to die walking, right? Zhu Yao despaired as she followed after it. For a moment, she felt that her steps had gotten a lot heavier than before.</p><br/><p>“We’re here!”</p><br/><p>Eh? So quick? She had only walked for about ten minutes or so, right?</p><br/><p>Zhu Yao raised her head to take a look. Above the river surface in front of her, a gigantic white palace appeared, and it occupied across the entire width of the River of Forgetfulness. That palace was extremely refined, with every single spot built by piles of stone materials of the purest white colour. From afar, it looked like a snow-white curtain draped on the sky, and it was a little eye-piercingly bright.</p><br/><p>It’s so white, I will definitely contract snow blindness, right? Zhu Yao silently retorted.</p><br/><p>“Bai Yuan, you’re saying that person lives here?”</p><br/><p>“Ou!”</p><br/><p>“Then how are we going to get there?” That palace was floating above the river, and she did not know how to swim.</p><br/><p>“Fly, ouu~~” Bai Yuan roared out and suddenly rose into the air, flying straight towards that palace.</p><br/><p>“Wait!” Bring me along, I can’t fly, hey.</p><br/><p>Bai Yuan had already turned into a streak of white light, instantly disappearing without a trace.</p><br/><p>“…” What happened to the promise of becoming friends?</p><br/><p>Looking at the grand and vast river surface, Zhu Yao felt like crying. Just as she was hesitating if she should swim over doggy-styled, a green round spot suddenly appeared in the river, and it was especially obvious on the snow-white river surface. That green spot grew larger, and after a closer look, it was actually a flower bud.</p><br/><p>Zhu Yao walked closer to it, and that flower bud suddenly bloomed. Its petals opened wide, and it finally turned into a lotus flower that was as large as a wash basin. A golden arrow that was pointing upwards was floating above the very center of the lotus.</p><br/><p>This… Was it hinting her to step on the lotus?</p><br/><p>She tried tapping on it with her foot, and after hesitating for a moment, she stepped on it. She did not expect that the lotus would actually be this stable. Forget about falling over, it was not shaking even in the slightest, and was stable like solid ground. Zhu Yao did not know what kind of breed it was either, and had the sudden impulse to bring it back to plant it.</p><br/><p>Just after she firmly stood on it, at a distance a step away from her, another lotus flower bloomed. Could these lotus flowers actually belong to a chain store?</p><br/><p>Zhu Yao stepped on it with a heart filled with doubts. Hence, with every step she took, in front of her, a similar lotus flower would bloom, as though the lotus flowers were paving the way for her, all the way to that palace above the river. She arrived at the front of the palace smoothly and without any obstructions.</p><br/><p>The moment she stepped on the stone steps, the row of lotus flowers behind her instantly wilted and sank beneath the river. This must be a wood type formation of some sort.</p><br/><p>Zhu Yao walked up the stone steps, and the entire white palace was now right in front of her. It stood towering tall, exuding a majestic atmosphere. Strangely, it was a little suspiciously quiet. Forget about any people in the surroundings, not even a single fly could be seen. She did not know where Bai Yuan who arrived before her had ran off too either?</p><br/><p>Arriving in someone else’s territory like this, she wondered if it would give the owner a bad impression too.</p><br/><p>Passing through the plaza in front of the hall, Zhu Yao hesitated for a moment. She decided that it was still best to give her greetings. “Umm… Is there anyone here?”</p><br/><p>“…” Complete silence.</p><br/><p>She could not help but raise her hand and knock on that huge door. Initially, she thought there wouldn’t be any response, but that huge white door suddenly rumbled, and slowly opened inwards.</p><br/><p>The insides of the palace were completely snow-white as well. Zhu Yao walked into it, and at the deepest area of the palace, there was a huge stage. The only seat on the huge stage was presently being seated by a man. He was dressed in a white robe, white outer garment, and white shoes. Even his hair was silvery white in colour.</p><br/><p>Seeing that she had entered, he smiled, revealing a complete set of white teeth…</p><br/><p>Zhu Yao subconsciously shifted her head away. Just how much does this person like the colour white? Even my eyes are about to go blind from the sparkles.</p><br/><p>“Hoho. Hi~” Zhu Yao habitually gave her greeting.</p><br/><p>“You’re here.” A voice as calm as water resounded. His voice was clearly not loud, yet it felt as though it had come from right next to her ears, as it distinctly passed into the depths of her heart. Zhu Yao had a faintly sensed that this voice was a little familiar, but she could not recall where she had heard it from.</p><br/><p>“You know me?”</p><br/><p>His smile grew deeper. “Zhu Yao. I have been waiting for you the entire time.”</p><br/><p>“Ah? Waited for me?” What was he going on about?</p><br/><p>He stood up and walked down the tall stage. Only then was Zhu Yao able to clearly see his appearance. With straight sword-like brows and starry eyes, though he was not stunning, he constantly exuded a feeling of warmth and gentleness.</p><br/><p>“Realmspirit mentioned that you’re the only person able to help me.”</p><br/><p>“You know Realmspirit!” Zhu Yao was stunned. She had fixed so many bugs, but this was the first time she heard of an NPC who knew Realmspirit’s name.</p><br/><p>He paused for a moment, and then slowly nodded his head. “You can consider it that way.”</p><br/><p>What did he mean by ‘consider’, hey!?</p><br/><p>“Do you know what kind of person is he? Where is he? Why does he want me to fix these bugs or whatever?”</p><br/><p>He smiled even gentler than before. “You will know in the future.”</p><br/><p>The hell. He might as well not have said anything.</p><br/><p>“What do you mean by I am able to help you?”</p><br/><p>His expression sank for a moment. Suddenly, he stretched out a hand, and she saw a mass of miasma formed by the words ‘bug’ appearing in the palm of his hand.</p><br/><p>“Resentment!” Zhu Yao was able to recognize it at first glance. “Why is there resentment here? Could it be… You were the person who exterminated the Ghost King that day? You’re able to exterminate resentment!”</p><br/><p>“No.” He shook his head. Clenching his hand, that mass of resentment instantly disappeared. “I’m only able to seal it temporarily.”</p><br/><p>“Seal?”</p><br/><p>“Resentment is shapeless and formless, undying and indestructible. Even if it’s me, I am only able to seal it temporarily.” He frowned. “However, there’s quite an amount of resentment in this world. In the beginning, everything was still fine. However, trillion years have passed. Even if it’s me, there will come a day where my power will become insufficient.”</p><br/><p>“Trillion years!” Zhu Yao grabbed onto this keyword. Did he mean that he had already existed for a trillion years? That was the time when the universe had only just begun, the time where even the Ancient Gods had not yet come into existence. He was alive ever since then? “Just who in the world are you?”</p><br/><p>He still carried that same warm smile, and softly said. “My name is, River of Forgetfulness.”</p><br/><p>“River of Forgetfulness!” Zhu Yao widened her eyes. “Hoho, it can’t be… that River of Forgetfulness, right?” Don’t joke with me!</p><br/><p>He waved his hand, and instantly, that large white palace disappeared just like that. Beneath their feet was that silvery white River of Forgetfulness that was flowing ever so calmly. They were presently floating in the sky above the river surface.</p><br/><p>The main softly said. “Just as you surmised, I’m this River of Forgetfulness.”</p><br/><p>“…” Zhu Yao felt that her brain had crashed. River of Forgetfulness, he was the River of Forgetfulness. This river was seeking help from her, what could she do? Throw sand into it?</p><br/><p>“Ever since the beginning of the universe, I have resided in the Underworld, removing the marks of all living beings in this world and reverting the souls back to their original forms.” River of Forgetfulness continued. “But among these marks, some can be removed, while some can’t.”</p><br/><p>“You can’t remove resentment?”</p><br/><p>He nodded. “Resentment influences souls, and souls which carry resentment into their reincarnations will recall their past lives. With resentment unscattered, it will cause several unforeseen events, bringing about the collapse of the worlds of the living. That is why I can’t allow resentment to stay in spiritual bodies. However, even if resentment has left the souls, it will still not dissipate. The only choice I have is to seal it.”</p><br/><p>He once again waved his hand. This time, the silver river suddenly split into two sides, revealing the bottom of the river. However, the bottom was covered in deep black, dense to the point where its depth could not be clearly seen. That deep blackness was constantly tumbling, and occasionally, a strand of it would leap out. Zhu Yao took a closer look, that mass of darkness, was actually densely packed with the words ‘bug’.</p><br/><p>The river bottom was actually filled with resentment. Just how many years did it take to accumulate such a terrifying amount!?</p><br/><p>Underneath such a clean and pure river, was actually the location used to seal resentment.</p><br/><p>River of Forgetfulness placed down his hand, and the two sides of river surfaces once again joined together, reverting back to the former silvery white colour. Turning his head around, he looked at her with a warm look, his eyes were filled with sparkles.</p><br/><p>“Uh…” Why are you looking at me with such hopeful eyes? “I really don’t know how to exterminate resentment. Otherwise, I wouldn’t be here looking for you.”</p><br/><p>“Since Realmspirit said that you’re able to, then naturally, you’re truly able to do it.” River of Forgetfulness had a confident look.</p><br/><p>“But I don’t even have the slightest of idea with regards to resentment.” Otherwise, little wimp would have been fine long ago.</p><br/><p>He shook his head. “You don’t know now, simply because the opportunity has not yet arrived.”</p><br/><p>“Then how would I know if the opportunity has arrived?”</p><br/><p>He smiled and did not give a reply. Instead, he looked at her with an even more focused gaze than before. “You can do it.”</p><br/><p>“…” Don’t put so much confidence into me, hey. What if I screw up?</p><br/><p>“Before that day comes, I will continue waiting.” He raised his hand, and Zhu Yao saw a formation instantly appearing beneath her feet. She felt her body turning light as the formation shone greatly.</p><br/><p>“Wait a minute.” She was still not done with her questions. “I still have something to ask!”</p><br/><p>In the next moment, she was enveloped by white light, and next to her ears, a phantasmal voice resounded.</p><br/><p>“Don’t worry, regarding the matter concerning the person you’re worried about, it’s unrelated to resentment.”</p><br/><p>“Big sis Zhu Yao!” Little wimp’s voice sounded in her ears. Her waist tightened, and in the moment, she had already risen into the sky.</p><br/><p>Wang Xuzhi flew several meters away while carrying her, and he said with a worried look. “Big sis Zhu Yao, are you alright?”</p><br/><p>“I’m fine.” Zhu Yao turned back her head to take a look. She had once again returned to the land at the end of the horizon, where the chasm was.</p><br/><p>“Why were you standing there? That was so dangerous. What if you fall into it?” Little wimp said with a worried look.</p><br/><p>“Fall into it?” Zhu Yao widened her eyes. Didn’t she already fall into it earlier?</p><br/><p>“This place is too dangerous. The winds are actually able to scatter spiritual energy. It’s inappropriate to stay for long.” He suggested with a stern expression.</p><br/><p>Zhu Yao felt that it was a little strange. She had clearly fallen into it for such a long time, why did little wimp look as though he was completely unaware of it? Could time have flowed differently between the land at the end of the horizon and Spiritual Realm? Suddenly, she felt that there was something in her hand? When she looked down, she realized it was a silvery white pearl, and its colour was extremely similar to that palace. What was this? Was it given by River of Forgetfulness? She clenched her hand, and then realized her own cultivation had actually recovered.</p><br/><p>“Big sis Zhu Yao, this place doesn’t seem to have a way to remove resentment. Why don’t we return?”</p><br/><p>She nodded, and followed Wang Xuzhi as they returned to Ancient Azure Sect.</p><br/><p>Regarding the matter of the bug this time, she finally had some sort of hint. Back then, she had thought that the bug was that Ghost King, or the resentment carried by the Ghost King. Only now did she find out that Realmspirit wanted her to deal with all the resentment. Beneath the River of Forgetfulness, if the inventory that had accumulated for trillion years were to break out, let alone the Underworld, even the Three Realms would be affected. This was simply an ultra-grade bug.</p><br/><p>However, she just did not have any hints on the way to basically deal with it. This was not comparable to making a game, where problems can be directly removed with the ‘DEL’ button. Most probably, even Realmspirit himself did not know how to deal with it, otherwise, he wouldn’t have let this go on for such a long time.</p><br/><p>She felt that she had encountered the biggest problem she had to face ever since she transmigrated.</p><br/><p>Her master was still not awake, and little wimp’s condition was worsening as well. The resentment in his body was beginning to go out of control, acting wantonly in his meridians, which prevented his spiritual energy from condensing. It had even endangered his Dantian, which made him fall into a coma once again.</p><br/><p>Time was growing tight. Zhu Yao gritted her teeth as she decided on something risky.</p><br/>\n</div>"}