{"title": "Chapter 248: First Mystic Artifact", "id": 248, "volume": 3, "url": "http://boxnovel.org/my-disciple-died-yet-again-chapter-248-first-mystic-artifact", "volume_title": "Volume 3", "body": "<h1>Chapter 248: First Mystic Artifact</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 248: First Mystic Artifact</p><br/><p>Zhu Yao immediately flew to Main Peak. Wen Yu was already walking in circles from anxiety, and the moment he saw her, he immediately welcomed her over. “Old Ancestor, this Sword Seeking Peak suddenly ran amok due to unclear reasons. If this continues, I’m afraid it might implicate our sect.”</p><br/><p>“Activate the Great Mountain Barrier Formation, I’m going to take a look.” Zhu Yao instructed, and then flew towards Sword Seeking Peak while riding on her sword. She had a faint guess that the rampage of these spiritual swords was most likely related to the Metal Spirit in her hands.”</p><br/><p>The closer she went, the more she could sense the sword energy emitted by the spiritual swords. She placed down a defensive barrier before stopping about five steps away from the spiritual swords. Then, she took out the Metal Spirit.</p><br/><p>As expected, the spiritual swords which were still making a commotion earlier, suddenly stopped. The chilling sword energy had also calmed down by a certain extent.</p><br/><p>“Metal Spirit, it seems you can’t accompany me anymore.”</p><br/><p>“Chick?” The rock tilted to the right, as though it looked a little doubtful.</p><br/><p>“These are swords with spirituality.” Zhu Yao pointed to the front. These swords had definitely gone a rampage earlier because they realized that the Metal Spirit had disappeared. “It’s you which allowed them to possess spirituality, and if you leave, they will revert back to normal mystic artifacts. Unless you have a way to settle them down, I can’t bring you out.”</p><br/><p>“Chick!” The Metal Spirit bounced for a moment, and then instantly grew agitated. It faced the swords that were flying in the sky, and let out a wild stream of chicks. “Chick chick chick chick chick… Chick chick chick… Chick…”</p><br/><p>Zhu Yao’s face darkened. No matter how many chicks you sound out, it’s no use right? These spiritual swords evidently did not want the Metal Spirit to leave.</p><br/><p>“Chick…” The Metal Spirit then let out another long sound.</p><br/><p>Suddenly, the swords that were floating around, looked as though they had lost their momentum, as they came flying down like a rain of spiritual swords. Not even a moment later, all of them had completely fallen onto the ground, and even the chilling sword energy earlier had disappeared without a trace.</p><br/><p>The hell.</p><br/><p>It was actually effective!</p><br/><p>So the conversational language in the realm of weapons was the language of chicks?</p><br/><p>The corner of Zhu Yao’s lips twitched. To tell the truth, she truly did not wish to bring the Metal Spirit along. This thing was evidently a cheat of the ultimate grade, and no matter who were to pick it up, that person would become a bug. Leaving it in the Sword Seeking Peek was still fine, after all, there were so many spiritual swords here. Unless the Metal Spirit itself was willing, even if someone were to discover it, no one could bring it out.</p><br/><p>However, it just had to stick to her. I’m not a metal spirit vein holder, hey.</p><br/><p>Zhu Yao let out a deep sigh, and she had no choice but to keep the Metal Spirit.</p><br/><p>Because she had easily dealt with the spiritual swords’ rampage, the eyes Wen Yu were looking at her with even sparkled. Zhu Yao grasped the opportunity to bring up the matter of her making a trip outside. Her reason? The world was so big, she wanted to do some sight-seeing.</p><br/><p>Wen Yu’s expression instantly sank, as he once again wailed with tears and snot all over his face. “Old Ancestor, don’t leave. If you leave and throw Forgotten God Palace aside, what are we orphaned disciples going to do?”</p><br/><p>The corner of Zhu Yao’s lips twitched. He sounded as though she was being ungrateful.</p><br/><p>“Enough, I will come back as soon as possible.”</p><br/><p>“Old Ancestor…”</p><br/><p>He still wanted to say something, but Zhu Yao’s figure had already flashed and deftly left. If she were to continue talking with him, she wouldn’t be able to leave any longer.</p><br/><p>Before Wen Yu could even pour out the grievances that filled his heart, his target had already disappeared. Instantly, a sense of danger surged in the depths of his heart.</p><br/><p>It seemed like this Sovereign Yu Yao did not carry a sense of belonging towards Forgotten God Palace, which was why she could leave so decisively. Not good, he had to come up with a plan in order to make her stay here forever.</p><br/><p>Mn, all for the sake of the sect!</p><br/><p>Zhu Yao flew several hundreds of kilometers in her mad sprint, and when she finally saw a large body of water, she slowed down her speed. Wen Yu had once inadvertently revealed that the girl Ying Luo had sacrificed herself to activate the ancient sealing arts. As the containers that carried the Devil, the five mystic artifacts were scattered to five different places by the spare energy of the sealing formation. One of those places was nearby these ocean waters.</p><br/><p>Zhu Yao pondered for a moment, before deciding to cast an art to change herself into her modern era appearance. Furthermore, she concealed her own level of cultivation and instead displayed Azoth Core cultivation, before heading towards an island at the center of the ocean.</p><br/><p>The island was very quiet, as though there were not many traces of humans here.</p><br/><p>But this was not right. Didn’t Wen Yu say that this island was a large-scaled market for deity practitioners? There should be many practitioners here, so why was it so quiet?</p><br/><p>She headed in the direction of the island center, before the surrounding people gradually increased. Though, every single one of them was hurrying in a certain direction, and their faces even looked strangely excited.</p><br/><p>“This fellow daoist.”Zhu yao stopped a Foundation practitioner, and asked courteously. “I wonder why you people are in such a hurry? Are you people heading somewhere?”</p><br/><p>That Foundation practitioner was a little furious due to someone stopping him, however, seeing that the target’s cultivation level was higher than his, he could only reply with a stifled tone. “The auction hosted by the Treasure Gathering Pavilion is about to begin, so I’m naturally rushing there to participate. If I’m any later, I won’t be able to see it.”</p><br/><p>Treasure Gathering Pavilion? Zhu Yao was stunned for a moment. Just as she was about to question further, that Foundation disciple however had already walked far away, as though he would not be able to make it if he was a single moment later. Was that auction really that great? Compared to whatever auction it was, she was more worried about finding that mystic artifact.</p><br/><p>Turning around, just as she was about to head somewhere else to take a look, a man dressed in an azure robe walked towards her, and said with a warm smile. “Fellow daoist, are you not going to take a look? This is an event that will only happen in the cultivation world once every hundred years. It is usually filled with exotic and mythical treasures.”</p><br/><p>Zhu Yao sized up the youth. He looked around twenty years old, and possessed early stage Foundation cultivation. Dressed in an azure robe, a copper coin emblem was embroidered on the cuffs. She then understood, and immediately said. “You’re a stripe?”</p><br/><p>“Strip1?” That person was confused.</p><br/><p>“What I’m meaning to say is, you’re someone from that whatever Treasure Gathering Pavilion, and you’re here to rein people in.”</p><br/><p>His expression stiffened for a moment, but then, he recovered in the next instant. “Hoho, fellow daoist, don’t misunderstand. This lowly one simply sees that you’re unfamiliar with the event, and wishes to give you a simple introduction about it.”</p><br/><p>“Thank you!” Zhu Yao turned around and left. “I’m not interested.”</p><br/><p>“Fellow daoist.” That youth instantly turned anxious, as he once again blocked her path. “This auction is only hosted once every hundred years, you know.”</p><br/><p>Zhu Yao shrugged. “I have no money!” She was poor to the point of only having coppers dangling on her, alright?</p><br/><p>“Fellow daoist, that sure is a funny joke.” His face was filled with the ‘you’re just joking’ look. “Our Treasure Gathering Pavilion always carries wide opportunities, and we are always well-informed. Not to mention, we have been on this island for several thousand years, so the treasures we have collected are countless. Fellow daoist, even if you don’t go to the auction, it will be an extremely good idea for you to take a look at other products.”</p><br/><p>Well-informed? Zhu Yao was startled for a moment. Then would she be able to inquire about the location of that mystic artifact? She instantly grew interested. “Let’s take a look then.”</p><br/><p>“Fellow daoist, please!”</p><br/><p>Zhu Yao followed behind that youth, and finally realized that there were indeed a large-scale city in the center of the island, but it was just hidden by a formation in the surroundings which could not be easily sensed from the sky. She stepped into the formation enveloping the city, and the view in front of her completely changed. The place was filled with practitioners walking about, and bustling streets appeared on her two sides. The sides of the streets were filled with stores that were selling various talismans, medicinal pellets and etcetera. However, every single one of these stores had a copper coin emblem on its entrance. It seemed like this Treasure Gathering Pavilion was even a chain store.</p><br/><p>That person brought her into a store selling mystic artifacts. There were not many customers in the store. Two people dressed in the same uniform as that youth welcomed them over, and then bowed towards that youth. However, he simply waved his hands, and personally brought her around.</p><br/><p>It seemed like this person was even a leader figure.</p><br/><p>“I wonder how I should address fellow daoist?”</p><br/><p>“My surname is Pass2, with a single character ‘By’ as my name.” Zhu Yao casually came up with something random.</p><br/><p>Pazz By? Why did it sound kind of strange?</p><br/><p>“So it’s Daoist Pazz.” He still courteously bowed towards her. “This lowly one is Zhen Yuan, and this is the store with the most complete collection in Treasure Gathering Pavilion. Daoist Pazz, feel free to take a look around.”</p><br/><p>Zhu Yao walked over while being led by him. She was uninterested with these mystic artifacts, after all, they were all below fifth rank. In her mind, she was wondering how she should inquire the situation about the sealing mystic artifact without leaving any traces of suspicion.</p><br/><p>“Daoist Pazz, feel free to roam around. It’s not that this lowly one is exaggerating, but when it comes to penultimate grade mystic artifacts, our Treasure Gathering Pavilion is the only one which is capable of finding them in this world. Furthermore, they come in various types, and we have everything that one wishes to have.”</p><br/><p>Zhu Yao swept her eyes over. This person sure knew how to advertise. They had everything one wished to have? Then let her see the one used to seal the Devil…</p><br/><p>The hell!</p><br/><p>That pitch-black fan. And what’s with the sealing runic symbols floating above it? She couldn’t be seeing things, right?</p><br/><p>“Fellow daoist, you have good eyes!” Zhen Yuan hurriedly squeezed over, and picked up that fan. “This is one of the artifacts used to seal the Devil back then.”</p><br/><p>“…” It really was, hey!? Wasn’t this too easy-going!? “This… It’s really that mystic artifact used to seal the Devil?”</p><br/><p>“Naturally, it’s real.” His face was filled with sincerity. “And it is even a fifth rank mystic artifact. Though because of the sealing arts, it is unable to unleash the power of a fifth rank mystic artifact, it’s the one and only… out of five Devil sealing mystic artifacts in the world. It really carries a commemorative significance. How is it, fellow daoist? Do you want to have one? It’s only costs one hundred intermediate grade spirit stones.You will make a loss if you don’t buy it with a hundred, and you will be a fool for not buying it with a hundred!”</p><br/><p>“…”</p><br/><p>Was it really alright for a mystic artifact used to seal the devil be so casually sold? Did they really have to be so casual about it, hey? Where are your principles, hey?</p><br/><p>Seeing that she did not reply for quite a while, Zhen Yuan gnashed his teeth and said. “Why don’t we do this, fellow daoist? If you really like it, I can give you a discount. Fifty intermediate grade spirit stones. How about it?”</p><br/><p>“…” Zhu Yao felt that there was a need to adjust her worldview.</p><br/><p>“Fellow daoist, this is already the lowest price. I can’t give you a lower price.”</p><br/><p>“…”</p><br/><p>“Why don’t you say it straight out, how much do you want for it?”</p><br/><p>“…”</p><br/><p>“Fellow daoist, we’re after all running a business, if it’s any lower, we won’t be able to make a living.”</p><br/><p>“…”</p><br/><p>Zhu Yao carefully inspected that fan. A godly might was faintly emitting out from the sealing runic symbols, and black devilish energy was also revolving within the base of the fan. This was indeed one of the five mystic artifacts.</p><br/><p>She never expected that she would be able to find her target so quickly. She really had the intentions to buy it, but the main problem was, she really had no money on her. Because she was rushing earlier, she had completely forgotten to get her wages from Wen Yu.</p><br/><p>After pondering for a moment, she immediately summoned out the flying sword Wen Yu gave her before. “How about this? Because I rushed out of my home, I did not bring any spirit stones. Though this flying sword of mine is only a fourth rank mystic artifact, it’s actually of a high grade. How about I use this to exchange for that fan?”</p><br/><p>Zhen Yuan was startled. A faint sparkling light flashed past his eyes, but it disappeared without a trace in the next moment. Smiling towards her, he said. “Fellow daoist, exchanging my fifth rank artifact for your fourth rank artifact, it’s not really that good of a deal, isn’t it?”</p><br/><p>“Then forget it.” Zhu Yao turned around and left. Was he really treating her as someone blind? This artifact had clearly been here for a very long time, and the reason why it had yet to be sold, was most probably because it could not be used due to the Devil’s seal, right? How could it possibly still be considered as a fifth rank mystic artifact?</p><br/><p>1. Stripe/Strip: The original word was (tuo) which means ‘on behalf’, while Zhen Yuan interpreted it as (tuo), which means ‘strip’, which has the same pronunciation and intonation. I was just trying to find a way to make it work in English, and conveniently, I googled stripe and there’s an internet business by that name, so… Yeah.</p><br/><p>2. Pass By/Pazz By: Just like how Zhu Yao randomly came up with the name Soi Sauz back then. (lu guo) means ‘passing by’, while Zhen Yuan interpreted it as (lu guo), thinking it is an actual name.</p><br/>\n</div>"}