{"title": "Chapter 258: How About Becoming My Master?", "id": 258, "volume": 3, "url": "http://boxnovel.org/my-disciple-died-yet-again-chapter-258-how-about-becoming-my-master", "volume_title": "Volume 3", "body": "<h1>Chapter 258: How About Becoming My Master?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 258: How About Becoming My Master?</p><br/><p>It seemed to be a place that was carefully cultivated. Its surroundings were planted with various fruit trees and the ground was a sea of flowers, and a man was floating at the very center of the sea of flowers. Dressed in snow-white clothes, he possessed an appearance with peerless charm, and the corners of his lips stretched into a smile, as though with a single glance of him, one would feel the warmth of spring. Presently however, his eyes were tightly shut, as if he had fallen into deep slumber.</p><br/><p>Zhu Yao walked into the place a step at a time. With every single step, her heart would sink a little, and a thin sensation of pain would spread throughout her entire body. Her mouths opened a few times, before she was able to find back her own voice. Before she voiced out anything however, she let out a sigh. “Shao Bai…”</p><br/><p>Strangely, gusts of wind suddenly blew. The soft winds blew through the entire realm, and petals fluttered throughout the entire sky. Under the falling petals, the man’s figure, as though it was being dispersed by the wind, slowly disappeared without a trace.</p><br/><p>How could she not have thought that the owner of this ruin would actually be Shao Bai? Back then when he crossed through the Heavenly World Crossing Door, he must had arrived in this world, and then he built a place like this.</p><br/><p>The things in those rooms must had been prepared for her. Unfortunately, she came a little too late. The things still remained, but he was no longer here. The injuries he received when crossing through the Heavenly World Crossing Door back then must had been really severe. In the beginning, she sent him inside in order to save his life, however, she never expected that things did not go as she wished.</p><br/><p>“My girl Yu Yao…” Ying Luo glanced at her a little carefully, and hesitantly said. “You… know that Ancient God from earlier?”</p><br/><p>Zhu Yao took in a deep breath before she was finally able to suppress the hurtful feelings in the depths of her heart. She then nodded heavily and said. “Mn, that was my elder brother.”</p><br/><p>“Ah?” The Ancient God is your elder brother? There must be something wrong with my listening method.</p><br/><p>“Enough, let’s leave.” Zhu Yao waved her hands. Shao Bai was now Yue Ying. He was gone for a long time now.</p><br/><p>They directly passed through the flower patches in front of their eyes. According to Shao Bai’s habits, “the teleportation formation should be over there somewhere.”</p><br/><p>As expected, not long after, they found a teleportation formation next to a large rock.</p><br/><p>Ying Luo was completely dumbstruck, as she sized Zhu Yao up. “Yu Yao, I kind of believe you’re a God now. In the ruin of an Ancient Highgod, putting aside how we did not encounter a single danger, you even know where the teleportation formations are.”</p><br/><p>“He’s not an Ancient God.” Zhu Yao corrected.</p><br/><p>“What?”</p><br/><p>“The owner of this ruin is a phoenix of the God Race.”</p><br/><p>“…”</p><br/><p>Zhu Yao took the first step forward in entering the formation, and said as she turned around. “We already have four mystic artifacts now. Once all five have been gathered and the Devil is dealt with, there’s no longer a need for you to go around hiding with me.”</p><br/><p>She giggled and followed after her. “Hope so.”</p><br/><p>I really hope tomorrow will really go as perfect as we wish.</p><br/><p>She had once heard that one must always have dreams, because if things couldn’t come true in real life, then one would just have to dream about it!</p><br/><p>Zhu Yao really did not expect that once someone started to become unlucky, that person’s teeth could even fall off just by drinking water.</p><br/><p>That teleportation formation was really great, and furthermore, the range of the formation was fast, far, and precise. It directly transferred them… into the encirclement of the various sects and clans.</p><br/><p>Dozens of Nascent Soul practitioners and countless Azoth Core practitioners surrounded them in several layers.</p><br/><p>…</p><br/><p>Leading them, was naturally the Ding Chunqiu who had gone on about paying back the gratitude he received.</p><br/><p>That’s why, everyone with that name definitely could not be a good person.</p><br/><p>“They came out from the ruin. As expected, only the Devils can…”</p><br/><p>“Clan Master Ding was right. Their hearts and wills have been bewitched by the Devil.”</p><br/><p>“Could the Devil have resurrected as well?”</p><br/><p>“Ying Luo can’t possibly be a spy for the Devil ever since the beginning, right?”</p><br/><p>“We can’t allow the Devil to bring chaos to the world.”</p><br/><p>“They have already turned into Devils!”</p><br/><p>The crowd was in a panic, but still, every single one of them drew their weapons, looking as though they were planning to risk their lives in a gamble.</p><br/><p>“We are not Devils!” Ying Luo loudly said. “And neither is the Devil’s seal broken. The reason why we’re gathering the five mystic artifacts is to eliminate the Devil once and for all.”</p><br/><p>“Since the Devil’s seal is not broken, isn’t finding the five mystic artifacts again superfluous?” Ding Chunqiu took a step forward, looked at the two of them, before speaking with a sullen voice. “Hall Mistress Ying Luo. You claim that you’re not a Devil, then I dare ask how did you come back to life? If the soul of a common person were to split into five, even if the pieces are able to gather once again, resurrection is still impossible. In this world, other than Devils, just who else possess such power to resurrect from the dead?”</p><br/><p>Ying Luo frowned, as she looked at Ding Chunqiu a little suspiciously. “Clan Master Ding, whether I’m a Devil or not, as the person who possesses that bell, you should be even more aware of the truth than I am.” That God’s Artifact was in a life-bound contract with her. If she had turned into a Devil, the bell, as a God’s Artifact, couldn’t possibly be activated.</p><br/><p>Ding Chunqiu’s expression changed, but it immediately recovered right after. Carrying a hint of anger, he said. “A bunch of nonsense. How would I be aware of your affairs?”</p><br/><p>“Clan Master Ding, haven’t you always been saying that Hall Mistress Ying Luo is your benefactor?” Zhu Yao said with a cold smile. “Is this how you repay her?”</p><br/><p>With the same righteous look, he said. “It’s exactly because she’s my benefactor, I’m unwilling to see her walk in the Devil’s path.”</p><br/><p>“Devil’s path?” Zhu Yao continued. “As the descendant of a God Race, she resurrected in the sacred pond, and it’s also exactly because the sacred pond is engraved with ancient formations, which converted her soul into a living soul, allowing her to reawaken. Could it be that Clan Master Ding thinks that what the Forgotten God Palace had been passing down for millions of years, was the Devil’s path?”</p><br/><p>When her voice fell, some of the crowd began to look at each other.</p><br/><p>A hint of fluster flashed past Ding Chunqiu’s face. Sending a crusade against Ying Luo was something he brought up, if the crowd was to be convinced now, then Point Formation Clan’s reputation would definitely plummet. Right now, there was no turning back. No matter what, these two had to die here and now.</p><br/><p>“Even if you two aren’t Devils, You two must have ill intentions for breaking into Point Formation Clan and gathering the five mystic artifacts. No matter what, for the countless lives under the heavens, we cannot forgive the two of you.”</p><br/><p>Ying Luo instantly turned furious. “Hmph, what countless lives under the heavens? In the end, you people simply can’t get used to seeing me alive.”</p><br/><p>“The resurrection Hall Mistress Ying Luo will naturally bring joy to our hearts.” The killing intent in Ding Chunqiu’s eyes flashed. “But that if it’s only the true Hall Mistress, the Hall Mistress whom everyone admires for sacrificing herself to save the world. Unfortunately, she can never return again. While you’re but a demoness who had been bewitched by the Devil.”</p><br/><p>Zhu Yao coldly laughed. From the intentions behind his words, he would only recognize the dead, but not the living.</p><br/><p>“My ass!” Ying Luo was trembling with anger. “If we’re talking about becoming Devils, Ding Chunqiu, you’re the true Devil here.”</p><br/><p>“Everyone, there’s no need to speak anymore with them.” Ding Chunqiu turned around to face the various sects, and said. “For the countless lives under the heavens, we must not let these two leave here today. Otherwise, once the Devil breaks out from the seal, then things will truly be irreparable.”</p><br/><p>After saying that, he had already grasped onto his sword and charged over.</p><br/><p>With someone taking the lead, the rest naturally summoned their own spiritual swords and attacked the two of them.</p><br/><p>Ying Luo carried Zhu Yao and hurriedly retreated a few steps back, while Zhu Yao placed down a defensive barrier. However, one of them was seriously injured with a shattered Dantian and unstable spiritual energy, while the other was half-crippled with half of her spiritual energy expended. As a sea of people came attacking, they could do nothing more than simply dodge and evade.</p><br/><p>“What do we do?” Ying Luo blocked the attack of a Nascent Soul practitioner, and transmitted her voice.</p><br/><p>Zhu Yao gnashed her teeth. “There’s no other way now. Ying Luo, do you have those four mystic artifacts?”</p><br/><p>“Yes!”</p><br/><p>“First release their seals, then escape as far as possible.”</p><br/><p>Ying Luo was stunned for a moment, and her eyes fiercely widened. “You’re saying…”</p><br/><p>“That’s right, with Ding Chunqiu’s personality, he definitely would not believe anyone else. The final mystic artifact is definitely somewhere on his body. “Zhu Yao said with a sunken voice. “I will restrict him in a moment. You take the opportunity to release the seals.”</p><br/><p>She sank into silence for a moment, before nodding her head.</p><br/><p>A Nascent Soul practitioner materialized countless of spiritual swords, and attacked the two of them. Zhu Yao pushed Ying Luo away, took a deep breath, and released her pressure as Demigod in a flash. In an instant, all the practitioners stopped their movements. Some had even fallen off the sky, puking out large amount of blood as they laid on the ground, unable to move.</p><br/><p>“Demi… Demigod practitioner.” The crowd revealed shocked expressions one after another.</p><br/><p>However, Zhu Yao was barely able to hold on. Even if it was just releasing her pressure, the pain brought by the chaos within her body was already making it hard for her to breathe. Her meridians felt as though they were being torn apart inch by inch, but she had no choice but to grit her teeth and hold on, as she said with a sunken voice. “Girl, now!”</p><br/><p>Ying Luo had already begun to cast an art. Golden sealing formations rose from her fingertips, and just as she was about to release them.</p><br/><p>Behind her, a black figure suddenly appeared, and he slashed his sword straight down. “I really have to thank you for the God’s Artifact you gave me.”</p><br/><p>The hell, that trash!</p><br/><p>“Ying Luo!” Zhu Yao exclaimed out. Pushing aside all thoughts, she immediately circulated the spiritual energy in her entire body and summoned her sword intent. With her fastest speed, she attacked in the direction where the girl was.</p><br/><p>By a hair’s breadth, she directly smashed away the trash who snuck up on Ying Luo, and he fell onto the ground puking out a mouthful of blood. From his body, a copper bell rang as it rolled out, shattering in the next moment. Evidently, he had used that copper bell earlier to evade her pressure.</p><br/><p>Puaah…</p><br/><p>Zhu Yao could no longer hold on, as blood flowed out profusely from the corner of her lips. The pressure of a Demigod disappeared at this moment as well. With both her spiritual and physical powers overused, her cultivation began to regress extremely quickly.</p><br/><p>“Yu Yao!” Ying Luo’s expression paled.</p><br/><p>A hint of loss flashed past her eyes. She looked at Zhu Yao who was at her dying breath, then turned to look at Ding Chunqiu who was on the ground, along with the crowd from various sects who had already begun to crawl up, with faces that looked as if they wanted to rip their corpses into thousand pieces.</p><br/><p>She twisted her fingers, increasing the speed of spiritual energy circulation. The seal was immediately released, and the four mystic artifacts in her storage pouch flew out at the same time. The mystic artifact next to Ding Chunqiu flew out as well, and the five mystic artifacts soared towards the sky. They circled above the sky twice, before crackling noises began to sound out.</p><br/><p>The five mystic artifacts shattered at the same time.</p><br/><p>Devilish aura blasted through the skies, spiraling in mid-air. The sky instantly darkened, and sinister winds began to blow, giving people bone-piercing chills. The trees in the surroundings instantly began to wilt as well, and terrifying ear-piercing cries filled the entire world.</p><br/><p>“Devil. The Devil has resurrected.”</p><br/><p>“Dear heavens, this world is doomed.”</p><br/><p>“What do we do? What do we do? We’re all going to die, we’re all going to die…”</p><br/><p>The crowd was instantly thrown into a state of panic, and none still remembered to capture the two of them. There were even a few of them who had already flown far away to escape.</p><br/><p>Zhu Yao took in a deep breath, and forced herself to stay conscious.</p><br/><p>She was already on the last step. Everything would be fine as long as she used the Devil Smiting Inscription. No matter what, she could not fail here.</p><br/><p>“Girl, leave this place, don’t turn back.”</p><br/><p>Ying Luo was stunned, as she turned to look at Zhu Yao.</p><br/><p>“Why are you still standing around? Hurry and go!”</p><br/><p>“Where to?” She suddenly asked.</p><br/><p>“Wherever is fine, live on properly. Leave the Devil to me.”</p><br/><p>She blanked for a moment, before asking her again. “Yu Yao, after eliminating the Devil, will I really be able to return to my former life?”</p><br/><p>“…”</p><br/><p>She smiled, as though she had already received her answer. “You see. Before the Devil had even appeared, already, they could not tolerate my existence. Even if we managed to deal with the Devil now, later on in the future, they might place the next, or even the next, next sin on my shoulders. Yu Yao, the true Devil isn’t here, but in the hearts the people.”</p><br/><p>“You… can leave. Hide far, far away. As long as you’re alive, there’s still hope.”</p><br/><p>“Live?” She still stood there unmoving, her eyes began to turn misty, and she suddenly spoke. “So what if I’m alive? Yu Yao, I really can’t understand, just what have I done wrong? I have never let this world down, not even the tiniest bit. But why must people of this world treat me this way?”</p><br/><p>She suddenly took a step forward, and a golden imprint suddenly shone between her hands.</p><br/><p>“Don’t do anything silly!” Zhu Yao grew anxious, puking out several mouthfuls of blood. Her vision had already begun to blur.</p><br/><p>However, she suddenly smiled. Her smile carried immense joy. She possessed peerless beauty in the first place, and with a single smile, it was as if the world had lost its colours. “Yu Yao, in this lifetime of mine, I never knew what hope is, because I never had it. But, you taught me that… Thank you. When even the entire world has betrayed me, you still stood unwaveringly by my side. But… I’m really tired, and I don’t wish for this to continue any longer. I have never done anything that goes against my conscience, and I don’t wish to continue living under a conspiracy either.”</p><br/><p>The speed of her hands were quick, and the light of the Devil Smiting Inscription faintly began to shine. Zhu Yao’s heart clenched. The girl was going to risk her life. Zhu Yao wanted to cast an art to stop her from activating it, but just as she was about to stand up, something rang in her ears.</p><br/><p>“Ting!”</p><br/><p>In an instant, she realized she could no longer move. Her entire body felt as if it had been petrified, as though it did not belong to her.</p><br/><p>The hell! Girl, stop now!</p><br/><p>She wanted to shout out loud, yet, it felt as if she had lost the rights to control her body, and was unable to open her mouth.</p><br/><p>The hell. Realmspirit, what the hell are you doing?</p><br/><p>Zhu Yao was burning with anxiety, yet, all she could do was watch the light in the girl’s hands growing brighter and brighter. As she smiled, she spoke her final words, sounding both grateful and regretful.</p><br/><p>“Yu Yao, thank you. If possible, I really wish I can call you my master.”</p><br/><p>In the next moment, an eye-piercing light scattered towards the surroundings. Like a shockwave, it spread throughout the entire world. The stagnant devilish energy immediately disappeared without a trace.</p><br/><p>The scene before her eyes began to shake, becoming unreal like a canvas, as though her soul was being twisted within her. Her vision suddenly distorted.</p><br/><p>The scene changed. She had returned back to sea of flowers within the scenario. That dishevelled, horrid-looking woman who was covered in resentment, once again appeared in front of her. Her body was filled with scars that looked as though she had been ripped apart.</p><br/><p>Filled with desolateness and despair, she was still asking the same question, over and over again. “Why… Why…”</p><br/><p>Zhu Yao simply felt her heart aching, the fear she had before had disappeared. She unconsciously took a step forward and pulled onto the woman’s hand. Tears could not help but fall.</p><br/><p>“Girl.”</p><br/><p>The girl who was still roaring out earlier, suddenly blanked. The resentment surrounding her body stopped spreading at this moment as well. As she slowly raised her head, within her cloudy eyes, clarity began to surface.</p><br/><p>“Yu Yao?”</p><br/><p>She nodded strongly.</p><br/><p>The resentment surrounding her body suddenly began to disappear, in but a few moments, it had already disappeared from sight, and even the scars on her body had disappeared without a trace. She once again reverted back to that woman with peerless beauty. Revealing a smile, the sea of flowers in their surroundings instantly bloomed, and she softly mumbled. “Master…”</p><br/><p>In the next moment, her figure grew faint, and finally, disappeared from sight. Even the sea of flowers was gone. The surroundings had turned into a familiar darkness.</p><br/>\n</div>"}