{"title": "Chapter 269: Plane Movement Permit", "id": 269, "volume": 3, "url": "http://boxnovel.org/my-disciple-died-yet-again-chapter-269-plane-movement-permit", "volume_title": "Volume 3", "body": "<h1>Chapter 269: Plane Movement Permit</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 269: Plane Movement Permit</p><br/><p>“What do you mean?” Earlier, he clearly said he was going to take Yu Yan back.</p><br/><p>“Young maiden, I have no choice as well.” Realmspirit sighed. “Your master would have to be deported back sooner or later, it was just a matter of time. It’s not something I can control.”</p><br/><p>“Deported?” What was he trying to say? Was he treating Yu Yan as an illegal immigrant?</p><br/><p>“Young maiden, your world is completely different from mine. This place is too stable.” Realmspirit sighed. “Every plane has their own set of laws, and laws are the basic guidelines for world formation. All the living creatures in the plane must be within this set of guidelines in order to maintain the stability of that plane itself. If a deviation were to appear, then it will cause a collapse in every aspect.”</p><br/><p>“You’re saying my master is that deviation?” Zhu Yao clenched her hands. “In order to fix this deviation, you sent my master back.”</p><br/><p>“I already told you I wasn’t the one who sent him back.” Realmspirit sounded like he was about to cry. “Theoretically speaking, anything that does not belong to this plane is considered as a deviation. If a deviation appears, it’s a grave matter that will influence the stability of a plane. But, your world is different.”</p><br/><p>“What’s different?” Can you finish everything that needs to be said in one go?</p><br/><p>“The plane here is very, very, very stable!” He said with heavy emphasis, and within his words, slight hints of envy and jealousy could be heard. “It’s stable to the point… where I can be issued with a permit!”</p><br/><p>“…” Haah?</p><br/><p>What permit? You’re really treating this as immigration, huh!?</p><br/><p>“Really, I could only come over because of a permit.” Realmspirit shook the conversation window. Suddenly, an image window suddenly popped out from the table. On the image, words written in a formal manner could be seen:</p><br/><p>Plane Movement Permit</p><br/><p>Checked Otherworld Immigrant Realmspirit</p><br/><p>Gender: </p><br/><p>Age: </p><br/><p>Records:</p><br/><p>Has been very compliant with laws and rules during the otherworld survival period, records are clean and excellent. No bad behaviour to speak of! Has cleared all requirements for plane movement, and thus this permit has been issued!</p><br/><p>Plane Transmigration Inspection Bureau</p><br/><p>16 January 2015</p><br/><p>Zhu Yao: …</p><br/><p>Flips table! What the hell was a Plane Transmigration Inspection Bureau? Why had she not heard of it!?</p><br/><p>Where did this strange department pop up from?</p><br/><p>“Saw that?” The image window flashed and then disappeared. Carrying a prideful tone, Realmspirt said. “My appearance complies with the plane management pact, and I have gone through all the proper procedures. I’m certified, you know?”</p><br/><p>“Then how is this related to my master’s disappearance?”</p><br/><p>“Of course it’s related.” His voice suddenly rose. “Your master was brought here along with you during your return, so he was not audited. Without a permit issued, he was categorized as someone who was smuggled in, and could only stay for three months. He was thus forcefully sent back since the time was up.”</p><br/><p>Her master was actually an illegal immigrant. “Where is that Plane Transmigration Inspection Bureau?” She shall head over to apply for a permit then.</p><br/><p>“Uh… Young maiden.” His voice carried some hesitation. “Without being at a sufficient level, it’s impossible to apply for a permit. If you want to apply for a permit, then you have to work hard in raising your level. For example, helping me with bug fixes or something. Slowly, you will gain the qualifications to apply for a permit.”</p><br/><p>“…” Why did she feel as if she was being trolled? She raised her head and glared at the conversation window. “You’re not lying to me, right? That inspection bureau or whatever basically doesn’t exist, right!?”</p><br/><p>“You must believe me, young maiden!” He said in a sincere tone. “Why do you think I can only appear in a computer? It’s because of the laws of the plane. In your world, I can’t appear with my physical body, which is why I have no choice but to stay inside your computer.”</p><br/><p>“Then why am I able to go to your world?” If laws truly existed in this world, why did she not encounter any obstructions at all when she transmigrated? No matter how it was, she would still be obstructed a little, right?</p><br/><p>“Ahem… That’s because…” Realmspirit’s voice instantly became hesitant. “Young maiden, you are aware of this. Movement between planes are comparable to taking trips to other countries. During trips, everyone would always like… to bring back a few native products and the like. These are never checked.”</p><br/><p>Native products?</p><br/><p>The hell, she was actually that native product he was speaking of!</p><br/><p>“Young maiden, knowledge that concerns planes is still too early for you, and right now, I can’t exactly give you a detailed explanation on it either. You will slowly come to understand it in the future.”</p><br/><p>“…” She felt that something was amiss.</p><br/><p>“Young maiden, how is it? Are you interested in coming over to raise your level? Applying for a permit is not a dream, hmm?” Realmspirit said in a relaxed manner.</p><br/><p>“Can I really obtain that whatever permit for my master if I help you fix bugs?” She felt that this was really unreliable.</p><br/><p>“Of course, I shall swear on my principles.”</p><br/><p>“Do you still have principles?”</p><br/><p>“Uh…” Realmspirit paused for a moment. “Why don’t I swear on my chrysanthemum then?”</p><br/><p>“…” Chrysanthemum my ass. What’s your chrysanthemum? Your battery charging port, or the usb port? They will all busted with a single plug, alright?</p><br/><p>Zhu Yao sighed deeply. She was completely defeated by this unprincipled and unscrupulous Realmspirit. After hesitating for a moment, she said. “Why didn’t you tell me all these when I returned back then?”</p><br/><p>“Aiya, you were still in your honeymoon phase back then. How can I possibly have the heart to bother you!?”</p><br/><p>The hell, this time you’re not just bothering, you have basically bashed apart a pair of mandarin ducks, alright? The moment she imagined that her master was sent back without knowing anything at all, she felt irritated to the point where she could kill people. Only a ghost would believe that that was his only motive! “Speak human!”</p><br/><p>“Uh…” After a moment of silence, he said. “Your soul was not stable back then, and it had to be nurtured back in your former world. Only the origin energy of this world can stabilize your soul. If I were to send you back to my world back then, your soul would not have been fixed. To put it simply… you would not have been able to acclimatize.”</p><br/><p>Acclimatization could be used to explain such a situation?</p><br/><p>“In other words, you think that my soul is already fixed now.”</p><br/><p>“Mn mn mn, your body is now perfect, and you won’t feel breathless while climbing five floors at one go!” He sniffled a few times. “Young maiden, you aren’t even aware that my permit was this close to being cancelled when I sent you back here back then! My credibility fell by exactly twenty percent. Fortunately, I supplemented it back with my great show of character. That manager of your world… In any case, he’s really frightening!”</p><br/><p>“…” Someone’s character can actually be used to supplement such things?</p><br/><p>“On the behalf of me paying such a terrible and miserable price, young maiden, please love me once more.”</p><br/><p>“…” Why did she feel like bashing him up?</p><br/><p>“Transmigrate, young maiden! As long as you say ‘I’m willing’, I will return you a wonderfully embroidered tomorrow!” Realmspirit instantly released fireworks within the computer screen. “If you sign up for the luxury package now, you can even be gifted with a free boyfriend, you know?”</p><br/><p>Do I need you to send me that? That’s mine in the first place, right!?</p><br/><p>“Haah, nevermind.” What else could she say? Her master was deported back already. Now that she did not have the hunk with her, how could she not head back to retrieve him?</p><br/><p>Zhu Yao called back home, and spoke a few words with her parents. In the end, she still managed to hold back and did not tell them the truth.</p><br/><p>“I can still return, right?”</p><br/><p>“Of course! Plane Movement Permits are issued by the authorities themselves! Moving across planes with a single permit is not a dream! Also, whenever you transmigrate, the time you return to will be the same as well! Our goal is to prevent any deviation!”</p><br/><p>“…” The corner of Zhu Yao’s lips twitched. “Enough, let’s go!”</p><br/><p>“Alright!”</p><br/><p>“Realmspirit!”</p><br/><p>Young maiden?”</p><br/><p>“Stop lying to me. Otherwise… I don’t know if I will still be able to believe you in the future.”</p><br/><p>“…”</p><br/><p>Suddenly, the entire room darkened.</p><br/><p>Who turned off the lights?</p><br/><p>A running loading bar suddenly appeared not far away from her. In an instant, the interface shot to 100%.</p><br/><p>In the next moment, she fell unconscious.</p><br/><p>A long while later…</p><br/><p>“Alright!”</p><br/><p>When she woke up again, Zhu Yao saw an illusory veil that looked like an aurora in the sky. Furthermore, it could constantly change its colour, making it look extremely beautiful. Zhu Yao stared at it for a full five minutes, only to then realize that she seemed to be a little silly.</p><br/><p>==!</p><br/><p>When she sat back up, she realized she was sitting on a bed made out of white jade. The light veil earlier was actually a thin curtain hanged above the bed. The surroundings were extremely luxurious. Every object was carefully selected to make this wonderful masterpiece.</p><br/><p>Even the floor beneath her was made of jade.</p><br/><p>Zhu Yao’s first thought was… So rich! It felt as if her entire being was walking on the path to the summit of life!</p><br/><p>Realmspirit finally gave her an owner role!</p><br/><p>When she raised her head to look at herself, she realized that she had changed into another avatar again. The thing she was wearing presently was not the pyjamas of the modern era, but a female long dress that was wrapping her firmly and conservatively.</p><br/><p>However, looking at the decorations, the surroundings, and this rich aura of a young maiden, no matter how everything looked, she had the perfect configuration of a great beauty. Zhu Yao’s heart stirred, with intentions of wanting to see her own looks, only to realize that there was not even the slightest strand of spiritual energy in her body, let alone being able to summon a water mirror. She looked around for a mirror, but after circling around, not even the slightest piece of something reflective could be found, let alone a mirror.</p><br/><p> Just as she was finding it strange that such an extravagant room was lacking an important object like a mirror, the door creaked open.</p><br/><p>Dressed in a pink dress, a girl that was as beautiful as a fairy walked in. She looked at Zhu Yao with large, widened eyes, and an expression of pleasant surprise surfaced. Excitedly, she said. “Grandma, you’re finally awake.”</p><br/><p>“…”</p><br/><p>The corner of Zhu Yao’s lips twitched. The hell’s a grandma? She sized up the girl for a moment. “You can’t be called Xiaoqian, right?”</p><br/><p>The girl had a joyous look, as she hurriedly nodded. “That’s right, that’s right. Grandma, I am Xiaoqian.”</p><br/><p>It can’t be? You’re actually really called Xiaoqian, hey? This is not a ghost horror film, refute it a little!</p><br/><p>“Grandma…” The girl’s eyes reddened, and she suddenly burst into tears. “You’re finally awake. Do you know while you were asleep, how harsh of a life the clan was living? Xiaoqian had been looking forward to your awakening day and night.”</p><br/><p>“Wait a minute!” Zhu Yao felt that was a need to supplement her principles for a moment. “What is this place? And what is this clan you speak of?” Don’t push scenarios onto her every single time, hey!</p><br/><p>“Grandma, what’s wrong? Could it be that your injuries have yet to heal?” Xiaoqian has a worried look. Her peerlessly beautiful face grew even more delicate and pitiful. “Don’t scare Xiaoqian?”</p><br/><p>“Young lady, you have mistaken me for someone else. I’m not your grandma!” No matter what kind of scenarios were pushed onto her, she could not possibly be the grandma of a young girl, right?</p><br/><p>The girl, however, grew even more anxious. “No, I have to get junior-martial sister over to see you. Only she is proficient in the medical arts within the clan.” After saying that, she turned around and ran out.</p><br/><p>“…” Why did she have a bad feeling about this?</p><br/><p>Xiaoqian() and Grandma() are characters of an old 1987 HK movie, called ‘A Chinese Ghost Story’. In the plot, Xiaoqian is a female ghost being controlled by ‘Grandma’, a tree demon, who uses Xianqian to lure in mortals for her to eat.</p><br/>\n</div>"}