{"title": "Chapter 261: The Problem Child Who Suddenly Freaked Out", "id": 261, "volume": 3, "url": "http://boxnovel.org/my-disciple-died-yet-again-chapter-261-the-problem-child-who-suddenly-freaked-out", "volume_title": "Volume 3", "body": "<h1>Chapter 261: The Problem Child Who Suddenly Freaked Out</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 261: The Problem Child Who Suddenly Freaked Out</p><br/><p>The next day.</p><br/><p>When Zhu Yao was waving to Wang Xuzhi who was flying over, he lost his footing for a moment, and had almost fallen off the sword.</p><br/><p>“Big sis Zhu Yao… You, your cultivation!?” His eyes must be blurry. Clearly, she was still at the Foundation stage a few days ago, how did she suddenly become a Demigod Paragon just like that?</p><br/><p>“Haah, little wimp, life is just that unpredictable!” She patted on his shoulders.</p><br/><p>Wang Xuzhi had a complicated look. A moment later, he sighed. “Then big sis Zhu Yao, when are you planning to ascend to the Higher Realm?”</p><br/><p>“Tomorrow. I’m afraid that unforeseen incidents may occur, so I’m telling you now.” Zhu Yao looked around. “Oh right, do you know where Bai Yuan is?” It had been quite some time since she last saw that beastie. In the past, it would even run to her window to give her some flowers. Yet, in these last few days, it had completely stopped its antics.</p><br/><p>“I don’t know. Highlord Bai Yuan’s whereabouts have always been indeterminable.” Wang Xuzhi sank into silence for a moment. “But, recently, he had been together with Sesame.”</p><br/><p>When had Sesame ever been so friendly with other beasties?</p><br/><p>Just as she was about to look for Sesame, Yue Ying appeared and walked over to her. “Big sis Yao, you came out of your closed-door training.”</p><br/><p>“Yue Ying, you’re just right on time.” Zhu Yao waved him over, and told him her plans to ascend the next day.</p><br/><p>Yue Ying’s face instantly darkened, as he stared straight in her eyes. He tightly clenched his fists, as though he was suppressing something. After a long while, he said. “Big sis Yao, are you going to throw Yue Ying aside again?”</p><br/><p>Zhu Yao was startled. She reached out her hand to stroke his head. “What nonsense are you talking about? I’m just going to ascend. Can’t you go to Divine Realm too?”</p><br/><p>“Divine Realm…” He suddenly raised his head and grinned, however, there were no hints of joy under his eyes. “Big sis Yao, if I were to say, I can’t go to Divine Realm?”</p><br/><p>“Ah?” What did he mean? Zhu Yao could not comprehend for a moment.</p><br/><p>Wang Xuzhi however frowned. He suddenly took a step forward and changed the topic. “Yue Ying, do you know where’s Sesame?”</p><br/><p>Yue Ying did not reply, and simply looked at Zhu Yao. Like a stubborn little child, he pulled onto the corner of her robe, wanting an answer from her no matter what.</p><br/><p>“Yue Ying?” Zhu Yao faintly sensed that something was amiss with him, but she couldn’t quite put it into words. Sighing, she explained. “Master can’t stay in the Lower Realm for too long. He had already fainted before back then, which is why I want to rush back to the Higher Realm. Be obedient, I will wait for you in the Higher Realm.”</p><br/><p>His brows furrowed, as he began to throw a tantrum like a child. “Big sis Yao promised not to throw me aside again. If he wants to return, then he can return by himself.”</p><br/><p>“Yue Ying, stop playing around!” Zhu Yao was a little furious. Pulling his hands away, he turned to look at little wimp. “Let us first look for Sesame!”</p><br/><p>“Mn!” Wang Xuzhi nodded as he stood on his sword and rose into the air with her. Turning around, he glanced at Yue Ying who was still standing on the same spot, and he realized that Yue Ying was staring straight at him. His heart suddenly felt chilly for a moment, and even his sword flight was becoming a little unstable.</p><br/><p>“Little wimp!” Zhu Yao smoothly grabbed onto him. “What are you doing?”</p><br/><p>“Nothing…” He smiled, and then hesitantly spoke. “Big sis Zhu Yao, before you arrived in Spiritual Realm, have I met Yue Ying somewhere before?”</p><br/><p>“Why are you asking something like that?” It doesn’t make sense for him to have such yearning look on his face. Suddenly, she thought of something. “Don’t tell me you really have… for my family’s Yue Ying…”</p><br/><p>“Big sis Zhu Yao!” He suddenly exploded.</p><br/><p>“I said nothing.”</p><br/><p>Wang Xuzhi sighed. After pondering for a few moments, he said. “I just feel an extremely familiar connection with him, as if… as if we have met in our past lifetimes.”</p><br/><p> “Little wimp!” Zhu Yao glanced at him, and said. “Thing like everything is predestined or whatever, are all lies. Don’t believe the things written on books. Finding a girl is the true path of a king.”</p><br/><p>“…”</p><br/><p>Zhu Yao searched for an entire day, yet she was still unable to locate the silhouettes of those two beasties. Gnashing her teeth, Zhu Yao directly used the contract to forcefully summon Sesame over to her. Initially, she had planned on asking it for Bai Yuan’s whereabouts, in the end, it became a buy-one-get-one-free deal, as the power of the contract had directly pulled both the two beasties over.</p><br/><p>Baam, the two of them smashed onto the ground right before her, with Bai Yuan on top, and Sesame below. The two beasts, with one facing upwards, and one facing downwards, fell down while sandwiched together.</p><br/><p>Their postures…</p><br/><p>Are a little shady!</p><br/><p>No, wait!</p><br/><p>Bai Yuan is a male beast. As two male beasts, what kind of shameful things are you two doing!?</p><br/><p>“Mistress…” The moment Sesame saw her, it crawled up after a making a groan, and then hid behind her at lightning speed. With a distressed look, it said. “Lord Bai Yuan is too much, no matter what, he wanted to leave that thing inside my body. This beastie was just about to become violent!”</p><br/><p>What did she just hear? Just what kind of things that cannot be described have you guys done!?</p><br/><p>“What!?” She instantly grabbed onto its tail, and shouted. “Then is your chrysanthemum still there?”</p><br/><p>Bai Yuan: …</p><br/><p>Wang Xuzhi: …</p><br/><p>Sesame: Did mistress say something immoral just now? Why did it feel its chrysanthemum tightening?</p><br/><p>Bai Yuan shyly glanced at Zhu Yao, and then walked towards her in small steps. The beast which was initially all white earlier, began to turn pink.</p><br/><p>These shy little eyes, this shady reaction, something must have happened! Zhu Yao felt as if her entire being had been blown into a mess by the wind. She instantly hugged onto Sesame’s beast head, and said with a heart filled with guilt. “I’m sorry, your mistress did not protect your chrysanthemum well.”</p><br/><p>Bai Yuan: …</p><br/><p>Wang Xuzhi: …</p><br/><p>Sesame: …</p><br/><p>“Ouu~~” Bai Yuan suddenly bared its teeth, roaring at Sesame. Seeing that Sesame had escaped from Zhu Yao’s embrace out of fear, it then made an “ahmu” sound, and spat a pearl out of its mouth.</p><br/><p>That pearl was at least the size of a fist. It was smooth and round, and had a pure-white colour. Furthermore, it was even emitting out a faint silvery light. As though it was glowing, a warm and refreshing aura faintly seeped out of it. It would have looked extremely beautiful, If not for its saliva that was still covering all around the pearl.</p><br/><p>“Inner core!” LIttle wimp stared at Bai Yuan with a stunned look. “Highlord, you…”</p><br/><p>“Meow…” It used its head to push the pearl and rolled it towards her, with a face that looked as if it was hoping she could pick the pearl up.</p><br/><p>“For me?”</p><br/><p>Bai Yuan strongly nodded.</p><br/><p>“You’re crazy!” Zhu Yao glared at it. “Is an inner core something you can simply give to others?” The inner core was the crystallization of its cultivation, it would die if it randomly spat it out, right?</p><br/><p>“Uuuuuuu…” Sesame took the opportunity to cry and complain. “Earlier, Lord Bai Yuan wanted me to bring his inner core to the Higher Realm with you no matter what. I wasn’t willing to, and he even bit me because of it…”</p><br/><p>Uh… So you two weren’t doing something kinky earlier?</p><br/><p>“Hurry and keep it!” Zhu Yao reached out to stroke its beast head. It seemed like it had long known she was about to ascend. “I don’t have any use for your inner core!”</p><br/><p>“Ou~~ Oouuu~~” It swung its head about.</p><br/><p>Sesame took the role of a real-time translator. “Lord says, if you carry his inner core, he will then be able to look for you and play games with you at any time.”</p><br/><p>“…” Who wants to play games with you? “If a demonic beast doesn’t have an inner core, it will die!”</p><br/><p>“Ouuu~~”</p><br/><p>“He says, he has a lot of these. You can play with it however you like.”</p><br/><p>“Ah!” He’s joking, right?</p><br/><p>In the next moment, Bai Yuan let out an “ahmu” sound, and then “hwaaah”, a row of white pearls that looked exactly the same was spat out. It then pushed them about.</p><br/><p>The corner of Zhu Yao’s lips twitched. She turned to glance at little wimp. “Are you certain… these are all its inner cores?” You’re kidding me? Who could actually spit out a large pile of inner cores in an instant? You think you’re Peashooter!?</p><br/><p>Wang Xuzhi: “…”</p><br/><p>In the beginning, when Bai Yuan wanted to give her its inner core, she rejected it. However, she could not win against it when it began to roll on the ground and let out such desolate cries. Not even a shred of its pride as a Guardian Beast remained. In the end, Sesame could not stand watching any longer, as it hugged onto her thigh.</p><br/><p>“Mistress, just promise him already! Otherwise, even I feel like I’m about to roll on the ground too! Don’t worry, Lord Bai Yuan is not a regular beastie, there won’t be any problems. I can guarantee with my chrysanthemum!”</p><br/><p>“…”</p><br/><p>“…”</p><br/><p>Has your chrysanthemum long been thrown away along with your morals?</p><br/><p>She casually picked up one, and returned to have her master appraise it. The pearls that were spat out earlier, were really inner cores alright. Zhu Yao felt that she needed to supplement her own common sense.</p><br/><p>After thinking for a moment, Bai Yuan was evidently a demonic beast raised by the River of Forgetfulness, and River of Forgetfulness even knew Realmspirit. In that case, it possessing an ability like that could be considered normal.</p><br/><p>Wait a minute!</p><br/><p>Bai Yuan, Whitesource…</p><br/><p>It couldn’t be the source of River of Forgetfulness, right?</p><br/><p>-_-|||</p><br/><p>Why were all the NPCs in this world named so casually!?</p><br/><p>Her master allowed her to place Bai Yuan’s inner core into her divine sense to nurture it. This way, it would not result in Bai Yuan losing its spiritual energy.</p><br/><p>The next day, she was already well prepared to ascend.</p><br/><p>Bai Yuan had arrived very early. With just a single “ahmu” sound, the entire sky looked as though it was being torn apart, as several layers of the sky faded away. When Zhu Yao and her master released the spiritual pressure of a Demigod Paragon, above the torn sky, tribulation lightning began to rumble.</p><br/><p>Eighty-one, multiplied by two, bolts of Nine Heavenly Lightning crackled as they came striking down.</p><br/><p>That’s right, all of them struck on her body!</p><br/><p>After eighty-one multiplied by two, an additional bolt was just about to strike down.</p><br/><p>Zhu Yao glared at the tribulation lightning bolt which had evidently gone high from all the zaps. “Hey, are you done!?” Can you even count!?</p><br/><p>Only then did that lightning bolt flash a white little tail, and extinguish itself with a poof!</p><br/><p>Then, a pillar of golden light broke through the clouds. The Light of Guidance instantly struck their two bodies. Zhu Yao felt her body had become light, and just as she was about to rise up, something tightened next to her.</p><br/><p>“Big sis Yao!” Yue Ying suddenly reached out his hand to grab on the corner of her clothes, and he looked at with hazy eyes. “You promised that you won’t throw Yue Ying aside.”</p><br/><p>Zhu Yao felt her heart turning sour, as she stroked his head. “Be obedient. Sesame will accompany you. Once you’re able to head up to the Higher Realm, it will naturally bring you to my side.”</p><br/><p>He stiffened for a moment, but his grip instead grew tighter. Suddenly, he smiled. It was not the warm and harmonious smile he always showed, instead, it carried hints of crazed infatuation. “Big sis Yao… You lied to me again. Why even you want to throw me aside as well…”</p><br/><p>Her heart clenched. Suddenly, she had a bad premonition, and wanted to reach out her hand to pull him. “Yue Ying…”</p><br/><p>“Big sis, I always wanted to ask you. Just what is Yue Ying to you? You said I was your little brother, your family. But, you can risk your life for Yu Yan, and you can even die for Wang Xuzhi’s sake, so why have you never turned back to look at me?”</p><br/><p>“Yue Ying, I…”</p><br/><p>“You said that you don’t like Yue Ying killing people, so Yue Ying stopped killing. You told Yue Ying to first learn how to be human, so Yue Ying desperately cultivated in the cultivation arts of human practitioners. But why, why do you still throw me aside…”</p><br/><p>“The previous time, it was for Wang Xuzhi. This time, it’s for Yu Yan. Who will it be next then? Was Yue Ying abandoned by you this entire time?”</p><br/><p>“No! Of course not!” Zhu Yao was a little flustered, as she stepped forward to pull his hand. This child had always been selfish and had an inflexible mind. She suddenly regretted a little for not spending more time to explain to him. She clearly knew just how sensitive of a child Yue Ying was. “Listen to me. I’m not abandoning you…”</p><br/><p>“I don’t believe you anymore!” Yue Ying smiled to her, with a smile that looked as if the world had lost its colours. “Big sis Yao had always said that you would return, but every single time, you threw Yue Ying aside. I will no longer believe you, I will only believe myself!”</p><br/><p>His voice sank, and suddenly, the devilish aura instantly exploded out of his body. The earth rumbled, and sand and pebbles flew in this lightless world. His face which had always been filled with warmth was now filled with hostility, as clear black marks were crawled up his face. The sinister and cold aura around his body was causing her to feel cold. He grabbed onto her hand and leaned closer to her. “Big sis Yao, do you know why I can’t go to the Higher Realm?”</p><br/><p>Zhu Yao’s heart sank. She had never seen a Yue Ying like this before.</p><br/><p>“Yu Yao!” Yu Yan flew over and instantly grabbed his disciple. With a turn of his body, they had already retreated a few meters away. With a vigilant look, he stared at Yue Ying who had already been enveloped by devilish energy.</p><br/><p>Little wimp and Zi Mo were shocked as well, as they looked at Yue Ying with dumbstruck expressions. “Big sis Zhu Yao, he’s… he’s a Devil?”</p><br/><p>“Yue Ying, calm down.” Zhu Yao’s mind was in total chaos. This selfish child actually went berserk like he said he would!</p><br/><p>Yue Ying smiled even more audaciously, as he coldly glanced at Yu Yan. Suddenly, he began to slowly walk towards them. With every step, the demonic aura around his body would become an inch thicker, and the surrounding flowers and trees would instantly wilt to nothingness.</p><br/><p>His smile instantly lightened, and in a flash, he had suddenly appeared behind Wang Xuzhi, clasping onto his neck with a single hand and raising him up. Little wimp instantly lost all strength to retaliate, as his body was enveloped by the devilish aura. “Big sis Yao, will you able to see me after I kill all these hindrances…”</p><br/><p>“Yue Ying, stop!” Zhu Yao’s heart was even about to pop out. She wanted to fly over, but was held onto by Yu Yan behind her. She had no choice but to shout out loud. “Don’t be reckless, hurry and release little wimp.”</p><br/><p>“Release him?” He was startled for a moment. Suddenly, it looked as if he had recalled something. “Big sis Yao, have you ever wondered, why I can’t go to Divine Realm?”</p><br/><p>Zhu Yao was dumbfounded, unable to understand why he would suddenly ask such a question.</p><br/><p>“Divine Realm is a place where mortals ascend to. I’m a Devil. Unless I open the World Crossing Door, I basically can’t head to Divine Realm. I studied for a long time, before I was finally able to find the method to open the World Crossing Door and look for big sis. However, I realized a problem. I can’t open the World Crossing Door again, because my soul is incomplete.” He spoke these words as though they were just idle chatter, but the devilish aura emitted from his body continued to grow thicker, and it even looked as though it was about to solidify. “In the past, I didn’t know why that was so? But now I know. Little sister…”</p><br/><p>Zhu Yao’s heart trembled, as she fiercely widened her eyes. “Shao Bai!”</p><br/><p>“Right now, I’m still not him. Once I kill this person, the missing part of my soul will return to my body, and I will become him.”</p><br/><p>“Big sis Yao, didn’t you wish for me to hurry up to the Higher Realm to reunite with you?” He suddenly said with a serious look. “My soul is just not gathered yet, and he is exactly the part of the soul that I’m missing. By killing him, I will be able to open the World Crossing Door and find big sis.”</p><br/><p>Xuzhi was Yue Ying’s missing soul? Zhu Yao was stunned. Suddenly, she recalled the scene Realmspirt showed her, where two masses of light were split from each other when Shao Bai left the Banished Land.</p><br/><p>“Yue Ying, can’t we have a nice talk? There’s nothing that can’t be settled with a little chat. Let go of little wimp for now. Big sis promises you not to head up to the Higher Realm yet.”</p><br/><p>Yue Ying blanked for a moment. Suddenly, he shook his head. “It’s too late!”</p><br/>\n</div>"}