{"title": "Chapter 268: Release My Master", "id": 268, "volume": 3, "url": "http://boxnovel.org/my-disciple-died-yet-again-chapter-268-release-my-master", "volume_title": "Volume 3", "body": "<h1>Chapter 268: Release My Master</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 268: Release My Master</p><br/><p>“Come back, I have something I want to show you.”</p><br/><p>Zhu Yao instantly pulled him to the mirror at the corner, and had him look clearly at his own reflection.</p><br/><p>“Eh?” As expected, he was startled. As he touched his face, he said with a stunned expression. “Could there actually be a formation that automatically slims you down when enter the Netherworld!?”</p><br/><p>“Slim down my ass. Look clearly, this isn’t you at all, hey!” With your fat figure, no matter how you slim down, you can’t possibly slim down into a lightning bolt so quickly, right?</p><br/><p>“Not me?” Only then did Zi Dan understand the situation. He looked carefully at the person in the mirror. “Little martial aunt, you’re saying that my soul has possessed this person?”</p><br/><p>Zhu Yao nodded.</p><br/><p>He frowned. “But why do I not sense any ripples of this person’s soul at all? Could it be that he has already died?”</p><br/><p>“That’s not it!” Zhu Yao patted his shoulders. “Believe me. Just a moment earlier, this person was still alive and well.”</p><br/><p>“Then, why?”</p><br/><p>“I can’t answer you right now.” Zhu Yao sighed. “Everything can only be explained tomorrow.” Who could be certain that he would not return a night later, just like Bai Yuan? “Just stay here for now. Once I have settled the things here, I will figure out a way to investigate your current situation.”</p><br/><p>Zi Dan nodded.</p><br/><p>Only then did Zhu Yao walk out. Before she left, she could not help but instruct him again. “Oh right, do not touch anything here unnecessarily. Some of them might be really dangerous mystic artifacts.”</p><br/><p>After saying that, she returned to the meeting room. After giving all of her instructions in a hurry, she then brought Zi Dan back home.</p><br/><p>Unfortunately, the high-end technological genius was unable to figure out just what was going on either. Though, the energy attached to Zi Dan’s body this time, was not the spiritual energy emitted by Bai Yuan, but ghostly energy.</p><br/><p>It seemed like Zi Dan’s lifespan had indeed depleted, but was unable to reach the Netherworld because of some mistake while entering the Netherworld, and had instead arrived in the modern era.</p><br/><p>In his former life, Zi Dan’s cultivation had already reached the Demigod stage, however, he failed his ascension. She then heard from him that Little Radish was already a Demigod as well, and her cultivation level seemed to be even higher than his. Zhu Yao was slightly able to feel at ease now.</p><br/><p>They chatted for an entire day.</p><br/><p>In the early morning of the second day, she heard a gasp the moment she woke up. “The hell, why am I here again?”</p><br/><p>As expected, Zi Dan had returned as well.</p><br/><p>“The door’s over there. See yourself out!” Zhu Yao pointed to the door.</p><br/><p>Yu Tian left through the door with a confused look. No matter how he racked his brains, he could not recall why he was here in his employee’s apartment again. Could it be that he had a sleepwalking habit?</p><br/><p>He returned to the company with a confused look, only to strangely discover that every single staff seemed to be looking at him with strange eyes. He felt that things were amiss. It couldn’t be that he had done something embarrassing while he was sleepwalking, right?</p><br/><p>He pondered for a few days, yet he could not recall anything concrete. He wondered if it was just his imagination, but their gazes seemed to be turning even weirder, and occasionally, there would be small chatters behind his back. This feeling of being the only one in the dark was simply too terrible. He was anxious to the point of grasping his heart and lungs. Finally, he could no longer endure it any longer, and called Zhu Yao to his office.</p><br/><p>Presently, it had been a week since he last woke up in Zhu Yao’s apartment.</p><br/><p>“Nothing much? You simply hugged onto my thigh and called me martial aunt a few times.” Zhu Yao nonchalantly explained. This was something the entire office saw, there was nothing she could do to cover it up.</p><br/><p>“Impossible!” Yu Tian refuted without a second thought. Was he someone who lacked principles to such an extent? How could he possibly do something like hugging someone’s thigh? Furthermore, he did not have the slightest of interest in flat-chested women, you know?</p><br/><p>“Hey! I have to trouble you not to verbalize your retorts.” What do you mean by flat-chested? Your entire family is flat-chested, alright?</p><br/><p>“Ahem…” It slipped out of his tongue at the spur of a moment. “There’s nothing else, you can leave now.” In any case, he would not believe her in the slightest.</p><br/><p>Zhu Yao curled her lips, turned around and left.</p><br/><p>Ever since then, Yu Tian would appear before her with different identities, once every week. Bai Yuan, Zi Dan, Little Radish, Sesame… Basically, anyone whom she knew of would appear. Every single time, they would appear for a day, and punctually disappear in the early morning of the second day. They were basically more punctual than aunties, and they came four times a month!</p><br/><p>With her boss being constantly possessed, Zhu Yao felt that his life would not go very well in the future.</p><br/><p>Even Yu Tian felt that something was amiss with him. Whenever he looked at her gaze, it would always be filled with various emotions.</p><br/><p>“Overseer Zhu…” Yu Tian felt that it was time to speak his heart out to his employee. “Do you think that something is wrong with me recently?”</p><br/><p>Zhu Yao’s heart clenched. “General manager, what are you referring to?”</p><br/><p>“Look, in these few months, I have been unknowingly waking up on your apartment’s sofa. Do you think…”</p><br/><p>“What?”</p><br/><p>“It’s because your apartment’s sofa is especially comfortable?”</p><br/><p>“…”</p><br/><p>“Oh right, what brand is it? Introduce it to me, can you? You can even directly sell it to me too.”</p><br/><p>==!!</p><br/><p>Was the sofa the main point?</p><br/><p>“Goodbye!”</p><br/><p>“Wait a minute, we can always discuss the price…”</p><br/><p>Zhu Yao immediately walked out and slammed the door shut. She, who was worried that he had realized the truth, had truly been thinking too much.</p><br/><p>However, if he was going to continue being possessed like this, even if Yu Tian were to continue to stay oblivious, others would still be able to notice that something was amiss. Just what should she do?</p><br/><p>“You can ask Realmspirit.” Yu Yan suggested.</p><br/><p>“Realmspirit?” Zhu Yao was stunned.</p><br/><p>“Since he was able to send you back here, then others are no exception.”</p><br/><p>“You’re saying, this is Realmspirit’s doing?”</p><br/><p>He nodded.</p><br/><p>Zhu Yao pondered for a moment. Indeed, Realmspirit was the only one who possessed this ability. Flames of anger instantly surged. The hell, he was actually plotting against her behind her back. She charged into her room, and carried out the laptop that was stashed at the very bottom of a box.</p><br/><p>The moment she turned it on, before she could even connect to the internet, Realmspirit’s QQ automatically popped out.</p><br/><p>Realmspirit: Dear friend, you have finally remembered me. Wuuu… If you were any later, I would have run out of battery!</p><br/><p>The corner of Zhu Yao’s lips twitched. “Even you will run out of battery?”</p><br/><p>Realmspirit: Of course, my dear friend! Hurry and plug me into an electrical outlet! Hurry! Save me!</p><br/><p>Three exclamation marks instantly appeared on the screen!</p><br/><p>Zhu Yao’s face darkened, as she turned around and plugged the laptop into the electrical outlet.</p><br/><p>“I’m saved…” A familiar voice sounded from the laptop. “Please take good care of your electrical appliances, hey.”</p><br/><p>You’re a virus which infiltrated a laptop, who are you to talk about taking care of electrical appliances?</p><br/><p>“Speak. Bai Yuan, Zi Dan and the rest, what’s going on with them? Why are they possessing my boss?”</p><br/><p>“Aiya, I simply figured that you might be lonely. That is why I’m pulling them over to chat with you.”</p><br/><p>“Chat with my sister! A normal, functioning human being is about to turn into a lunatic because of you, alright?”</p><br/><p>“Don’t worry!” Realmspirit said without a mind. “I chose him because he is someone with firm and strong willpower. He will not be defeated by such small matters.”</p><br/><p>Because he had a firm and strong willpower, he had to suffer being possessed? “Don’t fool around, hey.”</p><br/><p>“Could it be that young maiden doesn’t wish to see them?” Realmspirit asked in return.</p><br/><p>“…”</p><br/><p>“Young maiden, you must understand the pain I’m going through for you.”</p><br/><p>Zhu Yao was stunned. She had indeed been exhilarated from seeing people she knew. Everyone had his or her own selfish desires, and she was no exception.</p><br/><p>“Yu Yao!” Yu Yan pulled her into his embrace, and only then did Zhu Yao regain her senses.</p><br/><p>“Realmspirt, don’t sneakily twist my way of thinking.” She was this close to being drawn into his scheme. “My wish to see the people I’m familiar with, and your actions of constantly having others to possess Yu Tian’s body, are two separate matters. Don’t think I’m unaware of what you’re doing. Aren’t you simply trying to summon my unwillingness, and have me return?”</p><br/><p>Realmspirit turned silent. After a while, he said with a solemn voice. “Young maiden… You’re truly the only person who can help me.”</p><br/><p>Zhu Yao instantly grew a little furious. “Realmspirit, I don’t owe you anything. Helping you is not my responsibility, nor is it an obligation of mine. Putting aside the fact that I have yet to decide if I’m going to return, even if I do return, you can’t force me either.”</p><br/><p>“…”</p><br/><p>“I have already told you this once before. The bugs you made me fix, were all problems originating from the Heavenly Dao itself. The setting of ignoring and stepping on lives is the root of the problem that causes the birth of bugs. And right now, you’re sending one person after another to possess Yu Tian’s body. Did you ask for his own opinion on this? Is there any difference between what you’re doing now and those bugs?”</p><br/><p>“But… I’m doing this to…”</p><br/><p>“Don’t tell me you’re doing this to save the world. Does saving a world mean that you can ignore the lives of others in another world? What does Yu Tian have to do with your world?”</p><br/><p>“…” Realmspirt was silent for a moment, as if he was contemplating on her words. After a long while, he said with a low voice. “I’m sorry…”</p><br/><p>Zhu Yao had always believed that he was different, so even if she had been trolled by him over and over again, she had never blamed him. After all, he was the only one who was aware that a problem existed in that world. People who introspect themselves have never been bad people. This time however, he had indeed gone overboard. Even if she could be said to have an obligation towards Realmspirit due to being his friend, who did Yu Tian offend then? Why must he be pulled into this mess? “Realmspirit, you can think of saving your world, but you must first make sure that what you’re doing is clear and right!”</p><br/><p>“I understand…” Realmspirit’s voice turned soft, and he said with a heavy tone. “Thank you, Zhu Yao. You’re right. That place over there is my world, and we should be the ones who are responsible for it, not you. I shouldn’t use such methods on my friends.”</p><br/><p>Zhu Yao’s fury instantly sank by a little.</p><br/><p>“In the future, there won’t be any souls being sent here.”</p><br/><p>“That’s better.”</p><br/><p>“I will eliminate all the influences on this world.”</p><br/><p>“Mn.”</p><br/><p>“Regarding those people that were sent here, I will bring them all back as well.”</p><br/><p>“That’s right.”</p><br/><p>“Yu Yan too.”</p><br/><p>“Mn… What!?” Zhu Yao was stunned.</p><br/><p>A golden light suddenly flashed from the laptop, and her waist suddenly slackened. Her master who was still sitting next to her earlier, instantly disappeared without a trace.</p><br/><p>“The hell, Realmspirit, what did you do to my master?” She clasped onto the laptop and shook it about. “Return me my master!”</p><br/><p>“Wait… Wait a minute… Dizzy…” Realmspirit pleaded. “Young maiden, don’t be agitated. Listen to my explanation, the laws of the world…”</p><br/><p>Her master was kidnapped, what else could be said about that!?</p><br/><p>“Wait a minute… Young maiden, release that electrical cord. Don’t pull it, we can always discuss things out!” She actually wanted to stop his battery supply. That was too frightening.</p><br/><p>“Where’s my master?” Zhu Yao turned to glare at him. After all, her master did not possess anyone and had come to this world with his own body!</p><br/><p>“He’s here, he’s here!” The display on the laptop screen changed, and a video interface appeared. The foot of the mountain was showed. Flowers bloomed and the willows flourished, and two familiar straw cottages could be seen as well. Her master, who was still dressed in modern attire, was standing in front of the cottages. This place… was the foot of the mountain situated at Lightning Divine Palace?</p><br/><p>Zhu Yao’s heart felt empty. “You sent him back?”</p><br/><p>“No, no, no. I wasn’t responsible for this.” Realmspirit’s conversation window wildly shook.</p><br/>\n</div>"}