{"title": "Chapter 279: Please Study Well", "id": 279, "volume": 3, "url": "http://boxnovel.org/my-disciple-died-yet-again-chapter-279-please-study-well", "volume_title": "Volume 3", "body": "<h1>Chapter 279: Please Study Well</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 279: Please Study Well</p><br/><p>Wang Shang’s tone had even lost that poetic sense it had, as he said with in a rather friendly manner. “In any case, it was such a ridiculous matter. That person has already been exterminated by me, but I just can’t keep these thoughts bottled up at all. So, right before my ascension, I set this up all in order to have that bitch’s name rot for tens of thousands of years. Though I’m unable to see it for myself, just the thought of it makes me feel refreshed. In any case, the person who can understand that incantation of mine and open this door is definitely not any ordinary person. At the very least, you should be the same type of person as the one who taught me these unique words and phrases years ago. Let’s leave it at this then, you can do whatever you want with the palace.”</p><br/><p>After saying that, the image flashed, disappearing without a trace.</p><br/><p>However, Zhu Yao’s heart shivered at his final words. Since the beginning where she first saw the riddle on Trueheart Door, she had felt that something was amiss. She finally found out why. Those vulgarities, were too modern! How did someone who had ascended tens of thousands of years ago know about them? Also, from what he said, those phrases seemed to have been taught to him by someone else, and it was something no one else knew about.</p><br/><p>Then, who was the person who taught him? Could it be someone like her, who had transmigrated into this world?</p><br/><p>Zhu Yao exited the large hall and looked around. She realized the tycoon’s palace was huge beyond comparison, and would have believed it to be an entire sect itself. The various mystic arts and techniques kept within were very complete, and there were even specialized medicine storage facilities, artifact refining rooms and talisman refining rooms. The place was filled with various items that could stir the greed of practitioners.</p><br/><p>As someone who had once lived her life in the Divine Realm, Zhu Yao was not really interested in them. After all, she was someone who had seen better things, so these things could not enter her eyes at all.</p><br/><p>She casually picked up a bottle of seventh rank medicinal pellets and an eighth rank artifact, and realized that a unique formation was engraved on the medicine bottle and artifact. When she realized what the formation was, the corner of Zhu Yao’s lips twitched, and her face darkened.</p><br/><p>She suddenly understood what that Daoist Wang Shang meant by having Cheng Qingdiao’s name rot for tens of thousands of years in his final words.</p><br/><p>This Daoist Wang Shang… sure had a very good idea.</p><br/><p>I really want to give him thirty-two thumbs-up.</p><br/><p>Zhu Yao sighed and shook her head. She then turned around and headed outside. It was time to leave and report to the crickets.</p><br/><p>Just as she opened the huge door, the dozens of higher-ups that had been waiting outside for a long while bowed towards her in unison.</p><br/><p>“These disciples greet senior-martial aunt!”</p><br/><p>“…” What was this situation? Zhu Yao’s feet froze, shocked. Her eyes darted to the only person she was familiar with – Qu Qu. Explain, my dear friend!</p><br/><p>Qu Qu turned to look at the side. He seemed to look displeased.</p><br/><p>“Senior-martial aunt.” Principal Qu Jiang stepped forward and began to explain. “Ancestor Wang Shang left behind an order before his ascension. The person who is able to enter this palace shall be named as his successor, and the items in the palace will become part of his or her possessions. You are presently the disciple of Ancestor Wang Shang, so it’s a must for us to refer to you as senior-martial aunt.”</p><br/><p>Can I reject this? I already have a master of my own.</p><br/><p>“Sect Master, you are too polite.” Zhu Yao chuckled. She, who merely possessed Foundation cultivation level, was being referred to as senior-martial aunt by a bunch of Nascent Soul practitioners. If this wasn’t courting death, what was? This was not Ancient Hill Sect and her invincible master was not by her side either. “I am but a mere Foundation practitioner, how can I possibly take on such a high position?”</p><br/><p>“Senior-martial aunt Zhu, this is an order by our ancestor, and as descendants, we do not dare to forget.” He said with a determined look.</p><br/><p>At the rate this was going, it was like a duck was being chased onto the chopping board. “Sect Master, it is merely a coincidence for me to have entered the palace, and I do not dare to take the things within for my own personal greed, let alone being your senior-martial aunt. This palace belongs to Ness Cesary Sect in the first place, and I shall now hand it over to Sect Master.” After saying as such, she had even pushed onto him the artifact and medicinal pellets which she took earlier.</p><br/><p>Qu Jiang was stunned, as if he could not believe that she would so easily hand over such a humongous treasure chest. Furthermore, she really had the intentions of slipping away right after. His heart was filled with both worry and joy.</p><br/><p>“Senior-martial aunt, please wait!” Qu Jiang walked over and sighed. With a suppressed voice, he said. “Senior-martial aunt, to tell you the truth, no one other than you is able to enter this palace. The door will only recognize the first person who gives the password.”</p><br/><p>“…” So the reason why they were calling her senior-martial aunt, was all in order for her to become their porter. “Then give me a few storage pouches, I shall bring out all the items inside for you. Is that good enough?”</p><br/><p>Qu Jiang’s eyes shone for a moment, but they dimmed again immediately after. “That can’t do. If Ness Cesary Sect suddenly receives that many treasures, it will definitely become a target of greed. Keeping the treasures within the palace is the safest option.”</p><br/><p>So I have to help you look after the treasures as well, is that it?</p><br/><p>“I humbly request that senior-martial aunt take the long-term situation into account, and look after our Ness Cesary Sect.”</p><br/><p>“I am merely at the Foundation cultivation level.” This one here was but a newcomer, is it really alright to have her carry such a heavy responsibility? Furthermore, she still had to look for the bug, and had no time to look after the treasures here.</p><br/><p>“Senior-martial aunt, please be at ease. As long as you are willing to stay here, our Ness Cesary Sect will deploy all its manpower to ensure senior-martial aunt’s safety.”</p><br/><p>Zhu Yao pondered for a moment. The news of her solving the riddle and entering Skybond Peak today would definitely be spread through the entire cultivation world before long. Though there were indeed countless treasures in the palace, they were not enough to cover for her terribly weak cultivation level. She indeed needed some backing. Qu Jiang’s suggestion earlier was great, and she merely hesitated for a moment before finally nodding her head.</p><br/><p>Thus, after Ancient Hill Sect, she had once again become the senior-martial aunt of a Sect Master.</p><br/><p>The only difference here was, the past senior-martial aunt was extremely justified, while the present senior-martial aunt was but a mere watchdog, a watch-aunt!</p><br/><p>Qu Jiang joyfully bowed in front of her, and then took a look at the medicinal pellets she gave him earlier.</p><br/><p>“Senior-martial aunt, how do we dispel the formation on the bottle?”</p><br/><p>The corner of Zhu Yao’s lips twitched, as she pointed at the formation on the door to the palace. “Like the formation on that door, you simply have to shout the password I used earlier to dispel it.”</p><br/><p>Qu Jiang was a little startled. After carefully pondering for a moment, he raised the bottle with a stern look, and shouted with incomparably seriousness. “Cheng Qingdiao, bitch!”</p><br/><p>Cough cough cough…</p><br/><p>Zhu Yao could not help but choke on her own saliva.</p><br/><p>The formation on the bottle was dispelled on command, and when he took a look at the medicinal pellets inside, his eyes suddenly widened. “These… These are Nascent Soul Pellets!” And there were six of them. These were medicinal pellets used to raise one’s cultivation from Azoth Core to Nascent Soul. With these pellets, it meant that the sect would have six more Nascent Soul practitioners.</p><br/><p>Qu Jiang’s excited hands began to tremble, as he raised the artifact on his other hand. It was actually a seventh rank artifact, though it was still sealed by the formation. He once again looked at Zhu Yao.</p><br/><p>“Senior-martial aunt?”</p><br/><p>Zhu Yao’s face darkened. “The password to dispel it is the same as the one earlier.”</p><br/><p>Thus, Qu Jiang once again shouted out loud. “Cheng Qingdiao, bitch!”</p><br/><p>The formation on the artifact was dispelled!</p><br/><p>That’s right! The method that would have Cheng Qingdiao’s name rot for tens of thousand years that Wang Shang thought of, was to engrave the exactly same formation on every single item he left behind. If someone wanted to use one, he or she had to first throw vulgarities at Cheng Qingdiao.</p><br/><p>Bottles of medicinal pellets and talismans could be put aside, after all, they were one-time consumables, so the users merely had to throw vulgarities once. The people who use the artifacts and the mystical art scrolls however had the short end of the stick. Every single time they had to use the artifacts or take a look at the scrolls, they had to call out ‘bitch’. This was especially so for those who were going to choose these artifacts as their Life Artifacts. They would have to help Wang Shang curse at Cheng Qingdiao for their entire lifetimes!</p><br/><p>Daoist Wang Shang was definitely a very incredible person, without any explanations needed!</p><br/><p>After pondering about it for a while, she realized that before long, the entire cultivation world would most likely have a new trending phrase: Cheng Qingdiao, bitch!</p><br/><p>No matter if it was during a battle, no matter if it was when eating medicinal pellets to raise one’s cultivation level, or no matter if it was during a meditative state to improve one’s cultivation, every single person would curse at him for no reason. It was no wonder Wang Shang would point out how refreshed he felt just by imagining this scene. This feeling of having the entire world curse at his most hated individual was definitely incredibly refreshing!</p><br/><p>“Senior-martial aunt, I wonder what does this ‘bitch’ mean?” Qu Jiang looked as if he was pleading for knowledge. “This disciple has cultivated for so many years, but I have never of such a beach?”</p><br/><p>It was such a sophistical question, she had no idea how to answer.</p><br/><p>“Haah, Sect Master… Junior-martial nephew, the meaning within is too profound, and even I can’t fully grasp its entirety. However, it was this incantation that was revealed after solving the riddle on Trueheart Door. It seemed like if we wish to know the answer, we have no choice but to ask the ascended Daoist Wang Shang himself.”</p><br/><p>Qu Jiang nodded as he directed his gaze to the sky. “Ancestor’s comprehension of the Heavenly Dao is truly of unfathomable.”</p><br/><p>Zhu Yao: “…” It’s not even the slightest bit deep, alright?</p><br/><p>If I were to tell you that he did all these to throw vulgarities at someone, you will definitely fall apart, right?</p><br/><p>Just as Qu Jiang was about to sigh in awe again, he received a voice transmission from a disciple at the Main Peak, informing him that all the new disciples that had crossed Trueheart Door have woken up and was requesting him back to host the disciple acceptance ceremony. Only then did he recall about the new disciples who had all fallen flat on the ground.</p><br/><p>While he was returning, he pulled Zhu Yao along to join in the commotion, and her aptitude could also be tested while they were at it as well.</p><br/><p>Qu Jiang had absolute confidence in Zhu Yao. After all, she was someone who could solve the riddle of Trueheart Door, and had even received the recognition of Skybond Peak. Her aptitude could not be in any way bad. Even if she was considerably old, he firmly believed that it was because she had started late in her cultivation. With the power of his Ness Cesary Sect, there was a good chance that she could form her Azoth Core before her lifespan depletes. When that time comes, her body will be rebuilt, and her age would no longer be a concern.</p><br/><p>He was filled with confidence for his senior-martial aunt Zhu.</p><br/><p>However, the moment her spirit veins were tested, he was immediately dumbfounded. Trash penta spirit veins!</p><br/><p>No, this can’t be true. He wanted to climb towards the sky, and have a chat about life with that ancestor of his!</p><br/><p>Poor aptitude meant low cultivation level, which meant short lifespan, which meant that no one would be able to enter Skybond Peak, which meant that they would no longer be able to obtain the treasures within.</p><br/><p>After understanding this cruel truth, Qu Jiang felt depressed all over.</p><br/><p>“Sect Master, the newly admitted disciples have already been waiting for a long while.” A disciple entered and bowed, reminding him. “Should I first have the wandering practitioners proceed on first?”</p><br/><p>Qu Jiang glanced at Zhu Yao at the side, his heart felt like it was being clenched. He then said with a wave of his hand. “Have the mortal disciples proceed here first.” He presently did not feel like looking at wandering practitioners at all.</p><br/><p>Zhu Yao rubbed her nose. It was not her fault for having poor spirit veins, it was set up by Realmspirit.</p><br/><p>“Umm, if there’s nothing else, I will take my leave for now.” At this point in time, it was best for her to leave this place and stop traumatizing people.</p><br/><p>“Senior-martial aunt!” Qu Jiang grabbed onto Zhu Yao, and with an expression that looked as if he wanted to cry, he spoke. “From this day forth, may I please beg you to go into closed-door training?” For Ness Cesary Sect, please study well, and aim for the top!</p><br/><p>“…” Yes, Principal!</p><br/><p>“Junior-martial brother Qu, immediately bring senior-martial aunt to the Hidden Arts Pavillion. No matter which level of mystic arts they are, no matter what kind of restrictions they have, allow senior-martial aunt to freely learn them.”</p><br/><p>Qu Qu nodded, and stood up as well.</p><br/><p>Zhu Yao quickly headed out. If she were to stay any longer, she was really afraid that the Principal would stuff her with an intense high school curriculum or something.</p><br/>\n</div>"}