{"title": "Chapter 276: I Will Eat You~!", "id": 276, "volume": 3, "url": "http://boxnovel.org/my-disciple-died-yet-again-chapter-276-i-will-eat-you", "volume_title": "Volume 3", "body": "<h1>Chapter 276: I Will Eat You~!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 276: I Will Eat You~!</p><br/><p>Initially, Zhu Yao had thought that she and Profiteer would go their separate ways after arriving at the second test. After all, she was an old woman. Even though she had established her Foundation, generally speaking, her combat ability was not high. However, Profiteer actually suggested to head on together.</p><br/><p>The two of them headed up the mountain through a small path, and after a short while, they heard cries for help. “There’s people over there!”</p><br/><p>They passed through a curve on the path, only to see dozens of living vines suddenly appearing before them, and they were waving their vines in the air. At the center of the vines, there were two practitioners in azure robes presently being trapped, unable to escape from within.</p><br/><p>“They’re trapped!” Profiteer’s eyes shone with faint excitement, and he took a few steps forward.</p><br/><p>Zhu Yao thought that he was about to save them, only to see that he had actually stood at a place far enough where the vines could not reach him. Then, he spoke with a loud voice. “Fellow daoists, do you two need some explosive talismans?”</p><br/><p>“…”</p><br/><p>“Save… Save us!” The two of them had been tortured for long enough by the vines. When they spotted the two of them, they began to cry for help.</p><br/><p>Profiteer chuckled as he pulled out the talisman he received from Zhu Yao earlier, and said. “One mid-grade spirit stone per piece, and it even includes self-detonation properties!”</p><br/><p>“We want them, we want them!” They were not in the state of mind to bargain in the first place, as they hurriedly nodded. “Hurry and release them!”</p><br/><p>“Alright~” He circulated his spiritual energy and activated the talisman. In an instant, fiery light charged through the skies, instantly burning away those vines, not leaving a single trace of them.</p><br/><p>The two of them were saved, and they bestowed him with countless thanks. They even took the initiative to hand him a mid-grade spirit stone. Profiteer’s lips turned crooked from joy. After both parties gave their names, the two of them walked into a teleportation formation, and headed to the mountaintop for passing the test.</p><br/><p>Profiteer waited for the two’s figure to disappear, before silently pulling out a small red notebook and writing their names on it.</p><br/><p>“What are you doing?” Zhu Yao asked.</p><br/><p>“Recording them down.” He said with a stern look. “In the future, we will be part of the same sect. They might after all become repeat customers.”</p><br/><p>“…” The corner of Zhu Yao’s lips twitched. He was even aware of client marketing strategies. This person would definitely become rich one day.</p><br/><p>“Alright, let us hurry to the mountaintop as well.” Profiteer finished noting down the details and kept the notebook. Just as he was about to follow after the two and enter the teleportation formation, Zhu Yao pulled him back.</p><br/><p>“Wait a minute!” Zhu Yao pointed at the formation and said. “That’s a single-use teleportation formation. If you enter it now, not only will you not be able to reach the mountaintop, you will activate the vine formation from earlier as well.”</p><br/><p>“You know about formations!” Profiteer’s eyes suddenly widened, his face was filled with shock.</p><br/><p>“I know… a little.”</p><br/><p>He said with an excited look. “Then do you know how to dispel this type of formation?”</p><br/><p>Zhu Yao nodded. Vine formations were not really incredible formations in the first place, so dispelling one was really easy.</p><br/><p>“Daoist Yu!” Profiteer suddenly held onto her hands, his eyes looked as if he was looking at spirit stones. “Why don’t we become friends?”</p><br/><p>“…”</p><br/><p>“Look at it this way. There are many participants this time around, so there will definitely be a large number of people who would fall into danger and be unable to escape free. Don’t you think we can provide them with a little support?” He said with a sincere look.</p><br/><p>Zhu Yao’s face darkened. “For free?”</p><br/><p>His expression stiffened. “Hoho… Daoist Yu, you sure know how to crack jokes.”</p><br/><p>She knew it. He was treating her as a tool to strike riches.</p><br/><p>“How about this then? We shall split between thirty and seventy percent.” He gritted his teeth. “You take the thirty percent, while I take seventy. How about it?”</p><br/><p>“I take seventy, you take thirty.” She was one who would be doing all the work, why did she have to take the smaller portion!?</p><br/><p>He gnashed his teeth again. “Forty and sixty?”</p><br/><p>Zhu Yao turned around and took a step forward.</p><br/><p>“Fifty-fifty. Fifty-fifty should be enough now, right?” Profiteer shouted anxiously. “Let’s both take a step back. Not to mention my cultivation is a little higher than yours, so my senses are stronger than yours. I will be the one searching for customers, how about it?”</p><br/><p>Zhu Yao’s feet stopped. “Fine, let’s do it.”</p><br/><p>Thus, Profiteer began to search through the entire mountain for people who were experiencing difficulties. He took the opportunities when they were facing danger to reach out his friendly fee-collecting hands and save them from crises.</p><br/><p>He was in-charge of negotiating the prices, while Zhu Yao was in-charge of dispelling the formations.</p><br/><p>Never did they expect that business would be this lively. In but four hours, they had made a clean total of twenty mid-grade spirit stones. The names of the customers filled up two pages of Profiteer’s customer notebook.</p><br/><p>Profiteer painfully pulled out ten mid-grade spirit stones and handed them to her. “This is your payment. Out of our friendship, I shall give you a storage pouch as well, and it will be for free. In the future, once we enter the sect, remember to keep in touch regularly! If there’s ever such a good business opportunity again, I will call you.”</p><br/><p>Zhu Yao received her first wages. As a former tycoon, her feelings were a little complicated. “Are we not going to continue?”</p><br/><p>“It’s getting dark.” He pointed to the sky and said. “We were so busy helping others dispel their formations, we had yet to complete our own tests. Though making money is important, we still have to first enter the sect in order to have a much brighter future, right?”</p><br/><p>A brighter money-making future, you mean!</p><br/><p>Zhu Yao nodded. She was so happy making money that she had almost forgotten they were here to take an entrance examination.</p><br/><p>Only then did the two of them begin to head for the mountaintop. Probably because he was too confident with her formation dispelling abilities, Profiteer did not feel any sense of danger at all. Along the way, they discussed about various methods on how to strike riches after entering the sect. Suddenly, a low beastly growl could be head from the front.</p><br/><p>Profiteer’s body stiffened, and his expression instantly turned deathly pale. “Damn it, we are so unlucky.”</p><br/><p>“What is it?” Zhu Yao could see that he was growing tensed as well.</p><br/><p>“It’s a demonic beast. I have long heard that the second test of Ness Cesary Sect would sometimes involve high-ranked demonic beasts. Never did I expect that we would meet one.” Profiteer pulled open his storage pouch, took out the talismans and medicinal pellets he earned from her earlier, and passed her half of them. “Hold them! These can be used to save your life later.”</p><br/><p>“Uh… Most likely…” She wouldn’t have to use them.</p><br/><p>“Stop being stubborn. Once we encounter it, do not hesitate, and run! It’s just an entrance examination, there’s no need to risk our lives.’ He instructed with a stern expression, before running off wildly in the opposite direction. Suddenly, as if he had thought of something, he turned back and said. “Oh right, we will settle the price for those items later!”</p><br/><p>“…” So she still had to pay him for these, hey.</p><br/><p>The roars grew closer, and Profiteer’s expression grew even more tensed as well, as he stuck an earth-type defensive talisman on his body. Then, a gust of wind could be heard from behind them, and he hurriedly pushed Zhu Yao to the side. “Move! Split up!”</p><br/><p>With a bang, a gigantic demonic beast appeared before their eyes. Its body was shaped like a lion, and it was covered in white fur. Its four claws were similar to an eagle’s, and on its back was a pair of wings. The moment its wings flapped, a wild gust of wind would blow. Before it even landed on the ground, it roared wildly at Profiteer and slashed its claw at him.</p><br/><p>An earth wall instantly erected in front of Profiteer’s body, but neither it could block the demonic beast’s claw and was instantly shattered. It was actually a fifth rank Winged Windbeast, which was comparable to the Azoth Core cultivation level. How were they going to fight it? Profiteer was greatly shaken, as he took the opportunity to retreat several dozens of meters away. He summoned his flying sword and planned on fleeing for his life. Unexpectedly, he turned to glance at his former business partner, only to see her still standing dumbfoundedly at the same spot.</p><br/><p>Also, for some reason, he shouted out. “Hurry and run!”</p><br/><p>During this half a second worth of hesitation, the Winged Windbeast had already reacted and charged towards him who was already in the sky, roaring out loud. Profiteer simply felt his head spinning, as he fell straight down from mid-air. Just as he was about to be slashed to death by the demonic beast…</p><br/><p>A wall of fire instantly erected before him, blocking the Winged Windbeast. Profiteer raised his head to take a look, only to see Zhu Yao holding onto a defensive fire talisman. She saved him!</p><br/><p>A bundle of complicated feelings rose in his heart, as he reminded. “It’s a fifth rank demonic beast!”</p><br/><p>The Winged Windbeast noticed Zhu Yao on the side as well, as it turned its head back to look at her. Its eyes instantly widened into circles. Turning its body around, it then sprinted wildly towards Zhu Yao.</p><br/><p>She’s done for! Profiteer’s heart sank.</p><br/><p>Just as that demonic beast was about to pounce on her and open it wide mouth, he closed his eyes, not daring to watch the scene. However, a sound reverberated in his ears.</p><br/><p>“Meow~~~” It was so sweet and tender, it even carried some playfulness behind it.</p><br/><p>Eh!?</p><br/><p>Po Fude carefully opened his eyes, only to see the most shocking scene he had ever witnessed in his entire cultivation life. The imposing fifth rank Winged Windbeast which carried a menacing aura earlier, was presently laying in front of his former business partner. It playfully rolled about, flipping its white belly happily. As it rolled about, large number of trees at the side came crashing down.</p><br/><p>And that elderly called Yu Yao, was presently standing at the side with an indifferent look, watching that beast being playful.</p><br/><p>Mn, she was already used to it!</p><br/><p>A young and tender voice resounded next to her ears. “Stroke fur fur… Stroke fur fur… Stroke fur fur… Me wants my fur fur stroked!”</p><br/><p>As it spoke, it rolled even more joyfully than before, circling around her while doing Thomas Flares. It rolled back… and it rolled forth! The trees that it brought down were quickly shaping into crop circles. It shouted out its catchphrase resoundingly, as if it was following a beat.</p><br/><p>“Stroke fur fur, stroke fur fur… stroke fur fur, stroke fur fur…”</p><br/><p>The corner of Zhu Yao’s lips twitched. She wondered if every single one of her plant-type avatars carried an automatic translation function for the various races, as she was still capable of understanding the demonic beast’s words.</p><br/><p>The Winged Windbeast rolled about for a long while. Seeing that she was completely ignoring it, its glass heart shattered resoundingly into pieces.</p><br/><p>Its pair of eyes curled, and tears began to well up. Even its voice had begun to sink a little. “Wuu… You don’t like my fur fur… I’m so sad. I don’t want my fur fur anymore… I’m going to burn it away!” After saying that, it really got up, and seemed to be rushing towards the fire wall by the Profiteer’s side.</p><br/><p>“Come back here!” The corner of Zhu Yao’s lips twitched. She sighed as she reached out her hand to stroke the gigantic beast head.</p><br/><p>The Winged Windbeast was instantly satisfied, as it rubbed against her palm while closing its eyes, calling out in a pampered manner. “Meow~~”</p><br/><p>Po Fude instantly felt uncomfortable all around his body. He had never seen a demonic beast that had such a lack of dignity. Even if one was taken in as a spiritual beast, he had never seen one that was such obedient towards its master.</p><br/><p>He felt a little dumb for getting worked up. After casting an art to extinguish the wall of fire, he walked towards Zhu Yao. “Daoist Y… Senior Yu, you are knowledgeable about… the art of taming beasts?”</p><br/><p>The corner of Zhu Yao’s lips twitched. No, she had merely forgotten to turned off the World Favourable Impression from her past-past life.</p><br/><p>“A… A little!”</p><br/><p>Just by knowing a little, she was able to subdue a fifth rank demonic beast! Then, if she were to master it, then she would definitely be incredible. Po Fude secretly decided that he definitely had to keep a good relationship with her no matter what. “I have heard rumours that demonic beasts are very hard to train. If senior has free time in the future, do you mind training a spiritual beast for me? Naturally, I will pay for your services.”</p><br/><p>“Uh… We can talk about it in the future!” She really did not know about it.</p><br/><p>With an envious expression, Po Fude looked at the obedient Winged Windbeast in front of his eyes. The fear he had earlier was instantly swept away, and he could not help but want to stroke it.</p><br/><p>The Winged Windbeast however suddenly turned around and let out a loud roar towards him. While it was doing so, it did not forget to spit a mouth of saliva on his face.</p><br/><p>“If you dare to touch, I will eat you~!” It fiercely glared at him before turning back to face Zhu Yao. Its attitude instantly changed. “Meow~~ Stroke again, stroke my fur fur…”</p><br/><p>Po Fude: …</p><br/><p>Zhu Yao: …</p><br/>\n</div>"}