{"title": "Chapter 299: Little Tyrant, You Must Become a Good Person", "id": 299, "volume": 3, "url": "http://boxnovel.org/my-disciple-died-yet-again-chapter-299-little-tyrant-you-must-become-a-good-person", "volume_title": "Volume 3", "body": "<h1>Chapter 299: Little Tyrant, You Must Become a Good Person</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 299: Little Tyrant, You Must Become a Good Person</p><br/><p>“I really do not understand you human practitioners.” Little Eighth shook his bird head. “Is a long life really that important? You humans will do anything to achieve this goal. From the moment you people are born, you people will fight for resources, fight for opportunities, all of you will fight with your lives on the line wanting to ascend and attain the Dao.” He suddenly recalled Cheng Qingdiao, the person who dared to kill a God for longevity.</p><br/><p>“But, isn’t attaining the Dao and becoming a deity all practitioners wish for?” Little Bai sighed. “I was admitted into a deity sect ever since I was young. Other than cultivating, what else can I do?”</p><br/><p>“Anything.” Little Eighth’s mood instantly worsened. “In any case, if my seventh elder sister wants to help you, then I can only comply with her wishes. However if there comes a day where you dare to hurt her…” His tone turned cold, as he continued with emphasis on every word. “I will definitely destroy your soul.”</p><br/><p>He said with such affirmation, that even Little Bai could not help but tremble. It was as if he could really do it. He could not help but feel puzzled as he stroked his scratched hand. “Just what kind of beast are you?”</p><br/><p>“Your sister’s a beast!” Little Eighth immediately bestowed him with another scratch. “You stupid human, I’m a Phoenix, one of the God races, alright? Don’t label me as one of those low-grade beasts.”</p><br/><p>“Phoenix… A Phoenix looks like this?” Little Bai evidently did not believe him. Would a Phoenix be so round? Not to mention his entire body was covered in fluff. Clearly, he was a bird that had just broken out of his shell.</p><br/><p>Little Eighth however was not conscious of it in the slightest, as he intentionally shook his own wings. “How is it? Are you shocked by my elegance? How can a mortal beast be like…”</p><br/><p>Little Bai did not refute, instead, he immediately materialized a water mirror in front of Little Eighth, reflecting a fiery red ball.</p><br/><p>Little Eighth: “…” What is that stupid-looking bird?</p><br/><p>He turned to look at Little Bai, only to see his pupils reflecting the exact same fiery red ball.</p><br/><p>“Ah———!” His scream instantly pierced through the skies.</p><br/><p>Little Eighth: “…” Could it be that he had never seen himself in the mirror before?</p><br/><p>When Zhu Yao woke up in the morning, she felt things were strange. Little Eighth was completely gloomy, and occasionally he would glance at his wings, revealing a dreary expression. Little Bai was in a similar state as well, as his face was filled with the word ‘dispirited’.</p><br/><p>Zhu Yao glanced to the left, then to the right, and instantly began to piece up everything in her mind with the hundred and eight unspeakable things that the two of them could have done last night. Just what in the world happened to them last night? Don’t do anything stupid while I’m not here, hey!</p><br/><p>“Grandma…” Little tyrant took a step forward and said with a stern look. “My injuries have already healed. Do we now… leave?” He could not help but turn to look in the direction of Ness Cesary Sect, his eyes were mixed with complicated emotions. There were worry, pain, and traces of resentment and perplexity.</p><br/><p>Zhu Yao frowned, patting on his shoulders. “What’s wrong? Can’t bear to leave?”</p><br/><p>His eyes sank, and he only spoke up a moment later. “I grew up there since I was young… Now that I have such an aptitude, I most likely won’t be able to cultivate anymore…”</p><br/><p>His head lowered even more, his hands unconsciously clenched tight. Even his body was beginning to tremble.</p><br/><p>“…” Zhu Yao frowned.</p><br/><p>“Grandma…” He suddenly raised his head and anxiously asked. “Why… Why don’t anyone trust me? Even Sect Master Master… I truly did not intentionally conceal my spirit veins. If I had known about it… I would have…”</p><br/><p>“If you had known about you possessing penta spirit veins, what would you have done?”</p><br/><p>“I…” Little tyrant was startled, a trace of fluster flashed across his eyes. Yet, he could not give an answer.</p><br/><p>Zhu Yao sighed as he turned to glance at Ness Cesary Sect. “Little tyrant, are you angry?”</p><br/><p>“…” He did not speak, instead, he dug his nails into his palms.</p><br/><p>“You’re angry, right? You’re angry at them for their injustice towards you. You’re angry at the Sect Master who had watched you grow up for not understanding you either. You’re angry at them for ousting you out of Ness Cesary Sect and treat you as a nobody the moment they realized the truth regarding your spirit veins.” Zhu Yao looked straight into his eyes. “You’re even angry at them for making me hand over Skybond Peak because of that, and you hate yourself even more for possessing penta spirit veins, right?”</p><br/><p>“Could that be wrong?” Little Bai instantly grew agitated. “Grandma, I don’t know what I have done wrong. Is possessing penta spirit veins really such a heinous crime?”</p><br/><p>“Haah…” Zhu Yao stroked his head and looked sternly into his eyes. She suddenly felt a little glad that she had left with this child. Otherwise, with this experience of falling from such a high standing, and without anyone to guide him at the side, he would simply lean even more to the extreme. In the end, either he would become crippled, or he would become a new bug who would take revenge on society.</p><br/><p>“Little Bai, grandma can’t say for certain if it’s wrong for you to be angry at them. However, I just want to say that no one in this world has a definite obligation to treat you well. Though betrayal is indeed really shameless, it had still gone into foundation you had made the effort to build. You mentioned that it would have been fine if you had known about being a penta spirit veins holder. However, if you knew about it right from the beginning, would things really not end up like this?”</p><br/><p>Zhu Yao said in a sunken voice. “You know more about the rules of Ness Cesary Sect than I do. If you possess penta spirit veins right from the beginning, then you wouldn’t have entered the Inner Sect. You wouldn’t have your master, nor would you be taught by the Sect Master. Furthermore, you might possibly be suppressed by others, living a worse life than now. You obtained a lot more things than others in the beginning, and they probably don’t belong to you. Now that these things are taken away from you, are you going to blame them for not continuing to give those resources to you?”</p><br/><p>“…” Little Bai did not speak as he grew even more confused.</p><br/><p>“Little Bai… When looking at things from a human perspective, they are indeed too much for doing things in such a manner. However, based on logic, it’s completely understandable. Qu Jiang and you indeed have a relationship of master and disciple, but at the same time, he’s the Sect Master of Ness Cesary Sect. It’s not like he doesn’t believe you, rather, he has no choice but to do things this way. As for the others, they were all outsiders in the first place. When discussing about this matter, they chose the prestige of the sect and sacrificed you! No one can criticize them for what they did either.”</p><br/><p>“In the end, you are just on unstable footing. In the past, you were standing at high ground, now that you’re down here, you will naturally feel that there’s a gap. But what you should truly be thinking about how you should climb back up again, and not blame on the people who pulled you up and ended up letting you go.”</p><br/><p>“But… But what about grandma…” Tears began to well in his eyes, the streams guilt within seemed to have joined and formed an ocean. “Then what about grandma? Little Bai can be ousted from the sect and be left with nothing, but… grandma clearly did nothing… but still… What about grandma?”</p><br/><p>This child. He was actually most worried about her. Zhu Yao’s heart instantly softened, as she went up to hug the young man who had already begun to cry.</p><br/><p>“You think that grandma minds about that?”</p><br/><p>He raised his head, his reddened eyes were filled with questions.</p><br/><p>“Those things in Skybond Peak are not mine in the first place. I have simply returned them to their rightful owner.” Back then when she entered the hall, the old man Wang Shang had explicitly said that the things inside were left for Ness Cesary Sect. She had never seen them as hers. “They respected me as their senior-martial aunt, allowing me, a Foundation disciple, to carry the same status as a Demigod Sovereign. Since I enjoyed this status, I helped them guard Skybond Peak. Now, they no longer me to take care of it, so naturally I have to return the status as well. Silver in exchange for goods, it’s very fair! Why do I have to mind?”</p><br/><p>“But… But… Little Bai still felt that there was something amiss, however, he could not point out what it was.</p><br/><p>“You feel that they shouldn’t have treated me that way, but that’s because you simply care too much about the opinions of others.” Zhu Yao continued. “However, cultivation is after all, still a personal matter. In this world, if you’re flawed, it doesn’t mean you can’t progress. Without Skybond Peak, does that mean I can’t seek the Dao? You’re no longer in Ness Cesary Sect, does that mean you can’t cultivate? When did the Heavenly Dao have such a rule? Or could it be that everyone who wishes to become a deity, needs to have the same resources found in Skybond Peak, and join a huge sect like Ness Cesary Sect? Little Bai… This world is really huge, and Ness Cesary Sect isn’t the only sect out there. Head on out and look at other sceneries, don’t let your hatred hinder your footsteps on the path to the Heavenly Dao. Do not allow your sense of inferiority to become your excuse for not progressing onwards.”</p><br/><p>Little Bai’s eyes regained their clarity, as if he had understood something. He clenched his fists and said. “But I presently have the aptitude of penta spirit veins, how could I possibly have any hope left…”</p><br/><p>“Are penta spirit veins really bad?” Zhu Yao rebutted. “Or do you feel that its unfortunate that you have been born with them?”</p><br/><p>“Is that… not true?”</p><br/><p>“Little Bai…” Zhu Yao sighed. “How many people do you think there are in the world?”</p><br/><p>Little Bai did not understand why she asked this question, but he still honestly replied. “Ten million?” With the various sects, clans and wandering practitioners, that should be a good estimate.</p><br/><p>“Are you certain?”</p><br/><p>He was startled for a moment, and only then did he understand she was talking about humans as a whole, and not just practitioners. “If we add the mortals, it’s countless…”</p><br/><p>Zhu Yao smiled. “See… Among the countless humans, there are only ten million practitioners. No matter how weak of a practitioner you are, you are still ranked within this ten million. If you feel that you’re unfortunate, then wouldn’t those mortals be incredibly unfortunate at the time of their births?”</p><br/><p>“…”</p><br/><p>“Little Bai, you must see beyond what you can see with just your eyes, don’t restrict yourself to just what’s right in front of you.” Zhu Yao stroked his head. “Penta spirit veins do not mean much? Nor does it represent the Heavenly Dao.”</p><br/><p>After saying that, she immediately released her power as a Demigod. In an instant, he watched as the surrounding trees and plants receive some sort of immense pressure, as they collapse one after another. The earth shook immensely, and under this pressure, even insects and beasts had stopped their cries. Their surroundings were in complete, utter silence.</p><br/><p>This… This is…</p><br/><p>Bai Zhiyuan had a stunned look. The power to topple the mountains and split the seas, the might of a Demigod!</p><br/><p>“Grandma, you… y-y-you…”</p><br/><p>Zhu Yao nodded, as she slowly spoke. “Little Bai, don’t forget. I have penta spirit veins as well.”</p><br/><p>Little Bai was stunned, wave after wave of excitement surged in the depths of his heart. Something called hope began to slowly sprout. It was as if a door to a brand new world had opened in front of his eyes.</p><br/><p>Maybe… Maybe he could do it too, just as grandma had said!</p><br/><p>A long while later…</p><br/><p>“Grandma.”</p><br/><p>“Mn?”</p><br/><p>“You actually did it on purpose, right? You wanted to leave Skybond Peak in the first place.”</p><br/><p>“Uh… Hohoho, children shouldn’t say random things. Grandma here just wanted to give others a chance to perform.”</p><br/><p>That’s clearly the case, right!?</p><br/><p>“Grandma, I’m already fifteen, I’m no longer a child.”</p><br/><p>“So what if you’re fifteen? A fifteen-year-old is just a little wimp in secondary school, someone who has yet to complete his nine years of compulsory education. On what basis can you tell me you’re grown up, huh!?”</p><br/><p>“…” What’s nine years of compulsory education?</p><br/><p>Zhu Yao initially wanted to return to Tranquil Valley, but when she recalled that pitiful amount of spiritual energy in the valley, she instantly changed her mind again. Because the seal on his spirit veins had been removed, little tyrant’s cultivation had directly fallen from the third level to the first level of Essence. This meant that his cultivation had been completely reset.</p><br/><p>Since she had already decided to raise little tyrant into a new role model, naturally she had to greatly supervise his cultivation. And, finding a place filled with spiritual energy was the most basic of basics.</p><br/><p>Once his cultivation is raised, his name will be known throughout the world and shake the four lands. It’s simply so easy! Just the thought about it made her feel a little excited.</p><br/><p>“Grandma, Cold Imperial City is just right in front.” Little Bai pointed at the large floating city in front. “Cold Imperial City is the largest practitioner’s city in the western continent. Should we rest there for today?”</p><br/><p>“Mn.” Zhu Yao nodded.</p><br/><p>Finding a place filled with spiritual energy was not easy! Furthermore, most of the spiritual pulses had already been occupied by the various sects and clans. They had no choice but to do this slowly.</p><br/><p>The moment they entered the city, they were welcomed by an Essence disciple who looked like he was a waiting staff.</p><br/><p>“Fellow daoists, are you looking for a place to stay? The cave residences in our shop are spacious and comfortable, and safety is guaranteed. Not to mention a spiritual pulse is located at the back, with spiritual energy supplied the entire day!” He inspected the two people in front of him, and had his line of sight focused on Zhu Yao whose cultivation was the highest. “I see that this is the first time fellow daoists have visited Cold Imperial City. Peaceful Spiritual Forest is just five kilometers from this city, no matter if you’re searching for treasures or beasts, our shop has various talismans and spiritual pellets on sale. Fellow daoist, do you want one?”</p><br/><p>“No need, we just want to look for a place to rest.” Zhu Yao rejected.</p><br/><p>“Alright! Then this little one shall bring fellow daoists over to look at the cave residences?”</p><br/><p>Thus, the waiting staff led the two of them into the city. The inns in the cultivation world were different from the mortal realm, most of them were cave residences, and there were no so-called management by storekeepers. At the entrance of every cave residence, several formations were placed. If practitioners wanted to stay in one of these cave residences, they just had to insert spirit stones in the formation cores at the entrances to head in. A low-grade spirit stone for a single night, and after time was up, the formation would automatically transfer the residents out. They were all automatic equipment, convenient, efficient and pollution-free. Inside, all necessities were accounted for, and spiritual energy was being supplied twenty-four-seven. It was simply a sacred must-stay accomodation for tourists.</p><br/><p>Provided that, she must have the money.</p><br/><p>“Little tyrant.” Zhu Yao nudged Bai Zhiyuan. “Pay up!”</p><br/><p>“Grandma…” He said with a guilty look. “I… didn’t even bring out my storage pouch. So…”</p><br/><p>“It can’t be? Not even a single spirit stone? A low-grade will do too!”</p><br/><p>Little tyrant shook his head.</p><br/><p>“Hohohoho… Fellow daoist.” Zhu Yao chuckled at the waiting staff. “Why don’t you us a discount?”</p><br/><p>The waiting staff’s expression instantly darkened.</p><br/><p>“A lottery! One that gives rewards will do!”</p><br/><p>The waiting staff’s reply was… chasing out the two of them out of the city.</p><br/><p>Thus, they had no choice but to silently set up a straw cottage outside the city. They felt as if their lives could no longer improve. If she had known about this, she would have stripped off a few more floor tiles!</p><br/><p>She placed down a spiritual energy guiding formation for the five elements for little tyrant, gave him a few instructions, and then returned to her own cottage.</p><br/><p>She had no choice but to enter a meditative state, to seriously calculate the cost needed to raise an elite, a huge problem at the level of an imminent national economy crisis.</p><br/><p>Just as she have entered the meditative state, she suddenly sensed a few traces of yin energy in the surroundings. They were very weak, as though they could scatter with a small breeze of the wind. A voice sounded outside the cottage.</p><br/><p>“It’s night, let’s scare her!” A female voice resounded.</p><br/>\n</div>"}