{"title": "Chapter 294: Someone Else’s Love Triangle", "id": 294, "volume": 3, "url": "http://boxnovel.org/my-disciple-died-yet-again-chapter-294-someone-else%E2%80%99s-love-triangle", "volume_title": "Volume 3", "body": "<h1>Chapter 294: Someone Else’s Love Triangle</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 294: Someone Else’s Love Triangle</p><br/><p>Zhu Yao continued to act cool and mighty. In any case, she was merely a mascot for the sect. Even when there were people planning to make some courteous talk with her, they were pushed back by the great nanny Qu Jiang without fail. It was as if he was saying that his little martial aunt was a saint that could not be offended, and that she would not be bothered with mere mortals like them.</p><br/><p>Throughout the entire event, Zhu Yao merely maintained her cold expression, while watching everyone going back and forth with their mind games. In the depths of her heart, she quietly wondered just when this mascot revealing event was going to end. Suddenly, a resentful gaze swept straight over from the other end.</p><br/><p>Cricket!?</p><br/><p>Zhu Yao frowned. This old lady has yet to settle the scores with you regarding Ye Qingcang, what’s with that accusing look of yours?</p><br/><p>She immediately sent him a voice transmission.</p><br/><p>“What’s wrong with you?” You know you look very invasive right now?</p><br/><p>Qu Qu blanked for a moment, and after a while he sent back his own. “Little sister-in-law… How did you end up becoming like this?”</p><br/><p>“Become like what?”</p><br/><p>“Where’s your sexy hunchback and soul-hooking wrinkles? In the past, you were so fresh and refined, and had such a dreamy figure. How did you end up becoming like this after forming your Azoth Core?”</p><br/><p>Zhu Yao’s expression darkened. “Scram!” Weirdo, please distance yourself far away from my world.</p><br/><p>“Hah…” He looked as if the illusion in his heart had shattered. “I can’t even calmly call you little sister-in-law now.”</p><br/><p>Who’s your little sister-in-law!?</p><br/><p>Zhu Yao ruthlessly glared at him, and could no longer bothered about this person who was in dire need of a change in his perspective of beauty. Diverting away from the topic, she asked. “Tell me the truth. Why did you take in Ye Qingcang as your disciple?”</p><br/><p>“Cang’er?” His face looked puzzled, and asked back. “Wasn’t this your instruction?”</p><br/><p>“When did I tell you to take him in as your disciple?”</p><br/><p>“Five years ago!” He said confidently. “Didn’t you tell me to take care of him a little before you went into closed-door training?”</p><br/><p>“Uh…” She seemed to have mentioned it before, but what she intended back then was to simply prevent the boy from being bullied too much in the Outer Sect, so as to stop him from darkening. She never mentioned about cricket taking in him as his disciple. You sure have carried out that instruction to the fullest, huh?</p><br/><p>She might as well lift a rock and smash it onto her own feet right now!</p><br/><p>Raising her head, she looked behind him. Ye Qingcang was presently standing behind with his head turned, speaking to a girly wearing a pink dress. They seemed to be chatting about a happy topic, as the girly would smile every now and then. Ye Qingcang however had a stern look the entire time.</p><br/><p>As if he had sensed her line of sight, Ye Qingcang raised his head and looked towards her. He gave her a light smile and nodded as a greeting. Zhu Yao smiled back on reflex, but she instead received the scrutinizing eyes of the pink girly.</p><br/><p>This girly…</p><br/><p>Zhu Yao frowned, instantly recalling who she was. She immediately turned to look at little tyrant behind Qu Jiang. As expected, he was watching the girly with a tight frown, faintly carrying a melancholic mood.</p><br/><p>The hell. The girly was actually the female lead, Qu Yi.</p><br/><p>Why was a love triangle about to be revealed on-stage with a bang? Did little tyrant pick up the script for a supporting male role?</p><br/><p>Zhu Yao was in closed-door training for five years, so the topic of the appearance of the successor to Skybond Peak spread for exactly five years as well. The number of people among the various clans and sects who coveted the treasures within were countless, yet the so-called successor from Ness Cesary Sect had never shown her face even once. For a moment, rumours began to spread, and there were even people who suspected that a successor to Skybond Peak did not exist in the first place. Rumours of the treasures being pocketed solely by Ness Cesary Sect existed as well. Qu Jiang pulled Zhu Yao out this time to show off, was simply in order to stuff all their faces. In the past, he was afraid that her Azoth Core cultivation level was too low and unsafe. Now that she had unexpectedly received sudden enlightenment and broke through into the Azoth Core level, adding that previous bottle of Nascent Soul Pellets, he was completely confident in aiding his little martial aunt in nourishing her Nascent Soul. Naturally, he did not have any scruples regarding this either.</p><br/><p>Now let’s see who still dares to claim that Skybond Peak doesn’t belong to our Ness Cesary Sect. Qu Jiang’s face was filled with prideful and refreshing smiles, chuckling throughout the entire event. All that’s left was to write ‘show off’ on his face, as he passionately conversed with the various clans and sects. Our Ness Cesary Sect’s luck is that good, if you have the guts, come beat me then?</p><br/><p>The hearts of the various sects carried various forms of envy and hate, yet they still had to courteously give their congratulations.</p><br/><p>This one-sided face-slapping harmonious scene was however broken the moment a disciple of the Soul Guiding Hall broke into the hall hastily.</p><br/><p>“Sect… Sect Master…” A disciple came sprinting forward, his face was deathly pale, as he knelt down soon after his legs gave way.</p><br/><p>“What’s with the rush?” Qu Jiang who had already turned into a show-off monster, frowned with dissatisfaction. He had yet to finish, you know.</p><br/><p>“Soul… Soul lamp…” The disciple’s expression paled even further. “Reverend Qu Jing’s soul lap… has been extinguished!”</p><br/><p>Qu Jiang blanked, dumbfoundedness flashed across his face as he hurriedly turned to face Bai Zhiyuan behind him.</p><br/><p>Little tyrant’s expression instantly turned as pale as snow. “Master…” Turning about, he charged out with haste.</p><br/><p>The hall instantly quietened down.</p><br/><p>A soul lamp was a lamp which every disciple would use their essence blood to light up after entering the sect. As long as one’s life was still intact, the soul lamp would not extinguish. If one were to be extinguished, it would prove that the lifespan of the lamp owner had reached the end, and the owner had returned to the heavens. And Reverend Qu Jing… was little tyrant’s master who had gone into closed-door training for many years.</p><br/><p>“I never expected that senior-martial brother Qu Jing would still be unable to make a breakthrough into a Demigod.” Qu Jiang shook his head with a complicated look, melancholy rose in his heart. Though, the others in the hall began to gloat a little. With one fewer Nascent Soul practitioner, Ness Cesary Sect’s overall strength would naturally weaken. This was something that they were happy to see. Unfortunately, not long after their happiness sprouted, Qu Jiang’s tone changed. “It is indeed painfully unfortunate for our sect to lose a Nascent Soul practitioner, so I will need the various Reverends to humbly take their leave. In a couple of days, in the upcoming grand ceremony celebrating the success of five of our sect’s disciples nourishing their Nascent Souls, I hope that everyone will give me some face and come.”</p><br/><p>Five! Everyone present was stunned!</p><br/><p>Nourishing Nascent Souls was not an easy feat, so why was Qu Jiang so confident that five of his disciples would nourish their Nascent Souls at the same time? Could it be!? Nascent Soul Pellets!?</p><br/><p>Everyone exchanged glances. In an instant, they were able to guess the intentions behind Qu Jiang’s words from each other’s eyes. Their gloating expressions earlier instantly turned nasty.</p><br/><p>One Nascent Soul practitioner left, yet five more were about to appear. Were they being played like fools? The heavens were treating Ness Cesary Sect a little too favourably, huh?</p><br/><p>Zhu Yao paid no attention to the infighting between them, and was instead a little worried about little tyrant who had just charged out. Before he could settle the loss of his love over here, he lost his master right after. His luck was truly bad. Zhu Yao worried about what he was going to do in such a saddened state.</p><br/><p>The more she thought about it, the more worried she became. After the crowd had scattered, she greeted Qu Jiang, and then, instead of returning to Skybond Peak, she released her divine sense to scan Ness Cesary Sect. Then, she found little tyrant’s presence at the entrance of a cave residence in Talisman Spiritual Peak.</p><br/><p>Zhu Yao immediately charged over on her flying sword, only to see little tyrant blankly standing in front of the entrance, unmoving. As though he had become dumb, his eyes were hollow and hazy.</p><br/><p>“Little ty- Little Bai.” Zhu Yao changed her way of addressing him, and called out to him.</p><br/><p>However, he did not have any reaction.</p><br/><p>Zhu Yao sighed as she took a step forward. Grabbing on to him, she turned him around.</p><br/><p>“Grandma?” It seemed like it was only then did he realize she was here, as he muttered out. It was hard to discern if the expression on his face was actually filled with sadness or loss.</p><br/><p>She could not help but reach out her hand to stroke his head. “If you want to cry, then cry.”</p><br/><p>Little Bai stiffened for a moment. He pulled the corner of his lips, seemingly wanting to smile, but not a single trace of a smiling intent could be seen. As though he was trying to hide something, he said. “Grandma, what are you saying? I’m no longer a child, so why would I cry? It’s natural for master to leave after his lifespan is depleted, so there’s nothing to be sad about. Furthermore… Furthermore, although I’m his disciple, I have only seen him once. In this many years, he had been in closed-door training… and has never stepped out even once. How… How could I… possibly… cry? If that really happens, won’t I… become… a joke?”</p><br/><p>The longer he spoke, the lower his voice became. At the end, he couldn’t even finish what he wanted to say.</p><br/><p>Zhu Yao did not expose him either. With a wave of her hand, she placed down a concealment formation. “Don’t worry, no one can see you right now. If you’re sad, Grandma will temporarily lend you her shoulder.” After saying that, she turned around in order to not look at his face.</p><br/><p>After a while.</p><br/><p>She heard the sound of him approaching. A hairy head came leaning against her, and her shoulder was slowly being dyed with dampness.</p><br/><p>Haah!</p><br/><p>Zhu Yao let out a long sigh. It’s great that he’s crying it out. This silly child. He’s clearly really sad, and yet he’s saying he’s not. Though his master was in closed-door training for many years, he treated Little Bai really well. Otherwise, Qu Jiang wouldn’t have always had him by his side. Though he was filled with regrets, he still respected that master of his greatly even if he was unable to see him. If not, he wouldn’t have that colourful expression whenever he told her about his master.</p><br/><p>After a while…</p><br/><p>When Zhu Yao felt her shoulder was a little stiff, he finally sniffled and spoke with a nasal voice.</p><br/><p>“Grandma…”</p><br/><p>“Mn?”</p><br/><p>“Master… is the best master.”</p><br/><p>“I believe you.”</p><br/><p>“Grandma.”</p><br/><p>“Mn?”</p><br/><p>“You are the best grandma as well.”</p><br/><p>“… Ou.”</p><br/><p>“Can you accompany Little Bai for a while more?”</p><br/><p>“Alright.”</p><br/><p>Little Bai was depressed for an entire night. As a good “elderly”, Zhu Yao had no choice but to accompany him for the night. When the sky finally turned bright, Zhu Yao had long been drenched throughout her entire body.</p><br/><p>Haah, as expected, being popular is not a good thing, isn’t it? Fortunately, Little Bai’s emotions had stabilized, as he revealed the long-awaited smile.</p><br/><p>Zhu Yao still wanted to give some encouraging words, when a celestial crane came flying from the skies. Like a duck, it quacked and called out. “Meal… Quack quack… Go home. Quack… Go home.”</p><br/><p>“This celestial crane can actually speak?” Little Bai curiously stared at that bird. “I wonder who is it trying to call?”</p><br/><p>“Hohoho…” Zhu Yao’s face darkened. My dear master, can you change your communication tool?</p><br/><p>“I wonder? Umm… It’s getting pretty late.”</p><br/><p>“The day has only just begun.”</p><br/><p>“… Alright, it’s getting pretty early. There’s heavy dew in the morning, let’s head back for now.” She cast a Dirt Removal Art to clean off the dew on their bodies, and then patted on his shoulders. “Don’t think too much. Get a good sleep back home, and then you will feel better after waking up.”</p><br/><p>He obediently nodded. “Don’t worry. Grandma, I… am already fine now.”</p><br/><p>Zhu Yao inspected him closely. After realizing that he was truly fine, she felt at ease. Just as she was about to send him back to the principal and release the surrounding concealment formation, she saw two people, one in front and one behind him, running in their direction.</p><br/><p>“Junior-martial brother Ye, wait for me.” The girly behind anxiously called out. It was actually Qu Yi.</p><br/><p>Zhu Yao’s hand paused. Taking a closer look, the person walking anxiously at the front was actually Ye Qingcang.</p><br/><p>“Junior-martial brother Ye… Junior-martial brother Ye!” Qu Yi panted as she grabbed onto Ye Qingcang. With slight resentment in her tone, she said. “Why are walking so hastily?”</p><br/><p>“How can I not be hasty?” Ye Qingcang’s brows furrowed deeply, as he could not bear to yank off Qu Yi’s hand. “Senior-martial sister Qu, regarding the matter of Reverend Qu Jing being senior-martial brother Bai’s personal succeeding master, how can you only tell me about it now? Sect Master said that he hasn’t returned for the entire night, what if something happened to him?”</p><br/><p>“What could possibly happen to him?” Qu Yi pouted. “Senior-martial uncle Jing is indeed his master, but he was in closed-door training the entire time. Senior-martial brother Xiao Bai had only seen him once. Don’t worry, he wouldn’t mind. He wouldn’t think of doing anything stupid because of the matter concerning senior-martial uncle Jing.”</p><br/><p>Zhu Yao frowned. She turned back to glance at little tyrant. As expected, his expression looked a little ugly, and it faintly carried a trace of disappointment.</p><br/><p>“Senior-martial sister Qu Yi!” Ye Qingcang frowned as well, as he glanced at Qu Yi with slight fury. “How can you speak that way? You and senior-martial brother Bai grew up together, so you should be extremely clear of his personality. Reverend Qu Jing, in the end, was still senior-martial brother Bai’s personal succeeding master. To people who cultivate, do you understand the importance of the relationship of a personal succeeding disciple and master? How can senior-martial brother Bai not possibly be bothered by it?” Ever since he came out of the secret realm back then, he and senior-martial brother Bai could be said to have gone through life and death together. Even he was able to see that senior-martial brother Bai was someone who valued relationships, so how could senior-martial sister Qu speak in such a manner?</p><br/><p>Qu Yi’s eyes reddened, as she looked at Ye Qingcang a little pitifully. “Junior-martial brother Ye, I… I didn’t mean it that way. I was just worried seeing that you have been searching for him for a long while…”</p><br/><p>Ye Qingcang blanked, and only then did his expression turned gentle. With a slightly guilty tone, he said. “Senior-martial sister… I’m sorry, it’s my fault. I shouldn’t have been furious at you.”</p><br/><p>If he hadn’t consoled her, it would have been fine. However, now that he had done it, Qu Yi looked even more pitiful, as tears began to fall the next instant. She pounced into his embrace and began bawling out loud.</p><br/><p>The corner of Zhu Yao’s lips twitched, as she turned to look at Little Bai, before glancing at the two people in front of them again. Why did she feel that the atmosphere was a little strange? She felt as if she held the reins to breaking these adultery offenders apart. On one end, it did not seem fine to remove the concealment formation, and on the other, it did not seen fine not to remove it.</p><br/><p>“Senior… Senior-martial sister!” Ye Qingcang however politely pushed Qu Yi away. “It’s… not appropriate for us to be like this. Senior-martial brother Bai will misunderstand if he sees this.”</p><br/><p>Qu Yi’s expression stiffened for a moment, before turning into a frown. “What does this have to do with senior-martial brother Xiao Bai?”</p><br/><p>“You… You two aren’t?” Ye Qingcang was stunned.</p><br/><p>“We have simply grown up together since young.” Something flashed past Qu Yi’s face. In a blank of an eye, she approached him. Without further explanations, she looked at him with sparkling teary eyes. “Junior-martial brother Ye, do you hate me?”</p><br/><p>“Of course not!” Ye Qingcang shook his head on reflex, and for a moment, complicated feelings arose.</p><br/><p>Just as these two were about to continue, Xiao Bai who had been standing at the side suddenly tugged Zhu Yao. “Grandma, let us return.”</p><br/><p>His expression was unclear, yet his line of sight had never turned in that direction the entire time.</p><br/><p>Zhu Yao sighed, nodding. “Mn.”</p><br/><p>With a wave of her hand, she released the concealment formation, and appeared before the two’s confession scene.</p><br/><p>With the sudden appearance of two people, the two of them were given a fright.</p><br/><p>“You… You two!”</p><br/><p>“Granny, senior-martial brother Bai!”</p><br/><p>As though the were jolted by electricity, the two of them hurriedly separated, a trace of embarrassment flashed across both their faces.</p><br/><p>Xiao Bai took a step forward, and informed with a sullen voice. “I’m fine, there’s no need for you two to worry.” After saying that, he walked off without turning back.</p><br/>\n</div>"}