{"title": "Chapter 323: Forced Disconnection", "id": 323, "volume": 4, "url": "http://boxnovel.org/my-disciple-died-yet-again-chapter-323-forced-disconnection", "volume_title": "Volume 4", "body": "<h1>Chapter 323: Forced Disconnection</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 323: Forced Disconnection</p><br/><p>Zhu Yao felt her body loosening as she flew towards the depths of the light.</p><br/><p>This was the first time she was ascending into the Higher Realm through the standard passageway, and she could not help but feel a little anxious. She really wanted to give an acceptance speech of some sort. It continued to grow brighter in front of her eyes, and white was the only thing that she could see above her.</p><br/><p>Her master’s figure next to her was growing fainter. Suddenly, he turned around and pressed on her lips. Then, he said with a sunken voice. “Return to Lightning Divine Palace with haste. Your master shall be waiting for your return.”</p><br/><p>Zhu Yao nodded, and only then did his figure completely disappear. Most likely, he had returned to his main body.</p><br/><p>The light continued to grow brighter, and Zhu Yao’s little heart was beating rapidly. As long as she were to cross this white light, she would arrive in the Higher Realm, and she would then be able to reunite with her master. Finally, she could spend time loving for real. She suddenly felt the world had become even more beautiful than before!</p><br/><p>Zhu Yao’s entire being was enveloped by the white light, brighter… brighter… and even brighter…</p><br/><p>Crack.</p><br/><p>Everything went dark!</p><br/><p>What happened? Was the electricity cut off? Where’s the promised beautiful new world?</p><br/><p>Ting! A conversation window popped out right at this moment.</p><br/><p>You have disconnected. Please choose one of the following options:</p><br/><p>[Login with a new avatar] or [Give up on login] or [Retort]</p><br/><p>Zhu Yao: “…”</p><br/><p>-flips table- Realmspirit, wait right there with your neck cleaned!</p><br/><p>The conversation window flashed, and a new row of words instantly appeared. User has chosen [Retort], switching to conversation mode.</p><br/><p>The screen shook, and a familiar QQ chat window immediately popped up.</p><br/><p>Realmspirti: Welcome back! Young maiden, the bug was fixed perfectly! You shall receive a five-star rating, yo!</p><br/><p>Realmspirit: Eh? Young maiden, what’s wrong? Why is your face so dark?</p><br/><p>Realmspirit: Young maiden, why are you taking off your shoes… Ah! Don’t throw… Don’t throw it at my face!</p><br/><p>Realmspirit: Why are you still throwing… That’s Bai Yuan’s inner core! Hey… Young maiden…</p><br/><p>Realmspirit: Stop throwing already! If you can, then throw your chest pads at me too!</p><br/><p>Realmspirit: The hell! You’re actually throwing them!</p><br/><p>A moment later…</p><br/><p>Realmspirit: Young maiden, I was wrong!</p><br/><p>“Speak, what the hell’s wrong with you? Why did I end up in this stupid place when I was ascending so perfectly?”</p><br/><p>Realmspirit: I’m just worried that young maiden might be a little tired. You must watch out for your health and log off on time. It’s work-life balance, you know?</p><br/><p>Zhu Yao cracked her knuckles, emitting out resounding crackling noises. “Speak human!”</p><br/><p>Realmspirit: An urgent bug has appeared, that’s why I forcefully disconnected you.</p><br/><p>“The hell! So I was murdered by you this time!?”</p><br/><p>Realmspirit: Haah, young maiden, I don’t have a choice this time around. You know this, right? Spirits have three urgent needs!</p><br/><p>“Piss off!” There’s something wrong with me if I believe your words! What’s this urgent situation you had to disconnect me for? Do you know how exhausting maintaining this avatar was? Yet, you disconnected me like it’s nothing!” Back then, Cheng Qingdiao had broken her avatar to an incredibly sorry state, yet she was still able to live past that. One will grow attached to an avatar after using it for a long time, you know?</p><br/><p>Realmspirit: Young maiden, the bug this time is really special. That world is already at the verge of collapse.</p><br/><p>“Then what can I possibly do if I were to head…”</p><br/><p>Before she could even finish, a video player suddenly appeared on the screen. Within the screen, the place was in complete chaos. The earth was shaking and spiritual energy was running amok. It was like an apocalyptic film. Even the practitioners that were flying in the sky were unable to escape. The entire world was enveloped in fear of death.</p><br/><p>Zhu Yao suddenly recalled the moment when the world of the God races was at the verge of collapse. This was a very similar scene. However, back then she was able to open the World Crossing Door in time, while this world no longer had any presence of life.</p><br/><p>“This is the world where the next bug is in?”</p><br/><p>Realmspirit: That’s right! This is a scene from not too far away in the future. Young maiden, if it wasn’t because of an especially urgent matter like this, I wouldn’t have needed to forcefully disconnect you. Please work overtime!</p><br/><p>Zhu Yao rolled her eyes at him. “Among the scenarios you have given me, which world wouldn’t have ended up like that?”</p><br/><p>Realmspirit: Young maiden… It’s really different this time. This is extremely urgent. Please consider, kajima…</p><br/><p>“Do I even have a choice to make here?” Zhu Yao smiled coldly.</p><br/><p>Realmspirit: …</p><br/><p>The screen was silent for a moment. After a long while, the next row of words finally showed.</p><br/><p>Realmspirit: Yaoyao… I’m sorry!</p><br/><p>“You don’t have to apologize!” Zhu Yao smiled. “Because I won’t accept your apology.” This time, she was truly angry. In my past reincarnations, at the very least, she got disconnected because of her own fault most of the time. She had always told herself that in a certain sense, Realmspirit was actually saving her each time.</p><br/><p>But what about now? Was he dissatisfied that she was taking too long to die, and thus made the move himself? Then what was he treating her as? A puppet that could be disposed of at anytime? People shouldn’t behave this shamelessly!</p><br/><p>“Realmspirit! You have always told me that we are friends, but does real friends actually act like this?” Zhu Yao took a deep breath, the flames in her heart could not be quelled no matter what she did. “If things go on like this, I don’t know how far this so-called friendship can truly last.”</p><br/><p>The screen was quiet for a very long time. The next row of words did not appear even after a long while.</p><br/><p>After a long while, the screen flashed and suddenly disappeared. A human figure took its place, and this time it was actually the figure of a woman. The woman’s face was very familiar, because she looked exactly the same as Zhu Yao herself.</p><br/><p>“Yaoyao…” She called out.</p><br/><p>Zhu Yao did not have any reaction. She simply turned her head away, and no longer gave her another glance.</p><br/><p>Realmspirit lowered her head, and walked over with a guilty look. “I’m sorry…”</p><br/><p>“I already told you, I won’t accept your apology!”</p><br/><p>She was silent for a moment, and then gently said. “I know you have a lot of questions, and that you’re very angry as well… But there are some matters that I still can’t reveal to you yet, it’s still too soon for you. I was… too impulsive this time. I shouldn’t have done this to you, I apologize. I guarantee that this won’t happen again.”</p><br/><p>She looked sincere, and the anger within Zhu Yao finally quelled a little.</p><br/><p>Realmspirit smiled, and then, with her eyes looking straight at Zhu Yao’s, she said. “But, Zhu Yao… Please believe me. I have never thought of harming you. If there comes a day when you truly do not wish to continue, even if I have to use all of my power, I will send you back.”</p><br/><p>“…” Zhu Yao clenched her fists, and finally after taking in a deep breath, she could not help but push her face away. “Don’t say something so disgusting with my face, hey!”</p><br/><p>“Hoho… Young maiden, you’re clearly enjoying it!” Seeing that her anger was quelled, Realmspirit instantly returned to her rough attitude.</p><br/><p>“Scram!”</p><br/><p>“Don’t be like that~ Help me fix this bug of mine again~ Because of the increase in difficulty, I will be providing you with all-round technical support, along with great rewards~”</p><br/><p>“What kind of support specifically? And what are the rewards?” Everything you gave her had always been shocks, alright!?</p><br/><p>She suddenly snapped her fingers, and a screen once again appeared in the air. A certificate could be seen in it. “Do you still remember that Plane Movement Permit?”</p><br/><p>“Are you going to help my master make one?” After all, she returned to this place because of this exact reason.</p><br/><p>“Uhh…” Her face stiffened. “I can help you submit an application to the Plane Transmigration Inspection Bureau!”</p><br/><p>“Tch!” One glance and Zhu Yao knew she wasn’t that reliable.</p><br/><p>“Really, young maiden, you must trust me! I have a pretty great reputation, and there’s a very huge possibility that the application will be successful. The success rate is as high as 3.8%!”</p><br/><p>“Scram!” She actually dared to bring up a measly 3.8%.</p><br/><p>“Young maiden… Don’t be so heartless!”</p><br/><p>“Are we going to fix that bug or not?” This person sure had lots of nonsense to talk about.</p><br/><p>“Fix, fix, fix, of course! Immediately!” Realmspirit hurriedly nodded. That reincarnation loading bar instantly appeared before her eyes.</p><br/><p>Realmspirit had an unwilling look. Out of nowhere, she pulled out a small handkerchief, and waved it frantically at Zhu Yao. “Hurry and come back, dear!”</p><br/><p>“…” She suddenly had a bad feeling.</p><br/>\n</div>"}