{"title": "Chapter 336: All Roads Lead to the Female Lead", "id": 336, "volume": 4, "url": "http://boxnovel.org/my-disciple-died-yet-again-chapter-336-all-roads-lead-to-the-female-lead", "volume_title": "Volume 4", "body": "<h1>Chapter 336: All Roads Lead to the Female Lead</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 336: All Roads Lead to the Female Lead</p><br/><p>She actually spotted Fan Zhishan. Though she was the female lead, there’s too many scenes with her appearances, weren’t there? She was appearing everywhere they went. Couldn’t she give this side character some leeway? Among the three men next to her, one of them was very familiar. He was exactly the tenth rank demonic beast Bai Li that they met at Spirit Heaven Palace back then.</p><br/><p>The other two were Cao Qi and a unknown man.</p><br/><p>“That’s Cheng Yufeng.” Fa Yu coldly explained. “He possesses the cultivation of the Azoth Core Paragon and the mutated wind spirit vein. He’s been referred to as the number one genius of the cultivation world.”</p><br/><p>Zhu Yao curiously glanced at him. Even though they were praises, why did they sound so… irritating when it came from his mouth!?</p><br/><p>“What are you looking at?” Fa Yu glared at her. “Those trash sects had always liked to praise and sell themselves. What number one genius? It’s been two hundred years and he hasn’t been able to nourish his Nascent Soul yet. Even the trash next to him had nourished her Nascent Soul. He’s even worse than trash.”</p><br/><p>“Ou… Then what about you?” She casually asked. “When did you nourish your Nascent Soul?”</p><br/><p>Fa Yu choked, and his eyes flashed a little. Then, he turned away and said. “Let us discuss how we are going to go about finding the Rising Symbol Rock!”</p><br/><p>“…” This change of topic is too obvious, don’t you think!?</p><br/><p>“There are too many demonic beasts here. Earlier, I discovered that there’s only a single entrance and exit to the town.” Fa Yu pointed to the right. “As long as we make a detour to the left without flying on our sword and circulating our spiritual energy, we shouldn’t be discovered.”</p><br/><p>Zhu Yao nodded. They waited for the female lead and gang to walk a little further away, before proceeding to detour around the back and heading into the denser area of the forest. She could not help but turn to look at the four people. Though she did not know why the female lead was here, she obviously knew that she was up to no good. It was best that they did not bump into each other head-on.</p><br/><p>They made a huge detour around, and finally managed to avoid that town with large number of high rank demonic beasts. They spent over two hours and arrived at their destination. However, when Zhu Yao saw the situation of the actual place, she was completely dumbfounded.</p><br/><p>“What’s that?” Zhu Yao pointed to that enormous spatial passage. In the azure blue sky above, it was as if someone had dug a hole, and it was completely pitch-black within. There were some what seemed to be torn spatial voids, yet but they were not maintained by any spiritual energy in the surroundings. Instead, the place was shrouded in the aura of death.</p><br/><p>“That’s Regretless Crossing.” Fa Yu said. “The moment one steps into it, he or she will not make it out alive.”</p><br/><p>Zhu Yao looked at it a couple of times. Strangely, she felt a little uncomfortable.</p><br/><p>“Saintess…” Ling Tian who had not spoken for a long time, suddenly said. “That place… is really strange.”</p><br/><p>“I can see that.” Zhu Yao replied. “It’s fine as long as we stay away from it.”</p><br/><p>Right below the black hole was a stone mountain. Fa Yu said that the Rising Symbol Rocks could only be found nearby. Just when Zhu Yao had folded up her sleeves and was about to flip the entire mountain to search for them…</p><br/><p>“Found it!” Fa Yu suddenly bent his body and picked up something. Then, he threw it over.</p><br/><p>Zhu Yao caught it with her hand. A snow-white rock laid atop her palm, and it was the Rising Symbol Rock alright. The hell, how did he find it so quickly? What happened to the promise that it’s only born every several tens of thousands of years?</p><br/><p>“What are you looking at? We found the thing, so let’s go.” Fa Yu said impatiently. “I’m a metal spirit vein holder. Do you think I’m like the other trashes that need to run around the mountain to look for something they need? I just had to directly spread out my spiritual energy and the mountain would already been thoroughly explored.” He suddenly thought of something, and then turned his head around to size Zhu Yao up. “You can’t possibly have thought to look for it in the mountain, right?”</p><br/><p>“…” Trash Zhu Yao was struck head-on!</p><br/><p>Zhu Yao carefully kept the Rising Symbol Rock. Just as she was silently turning her body around and was planning to leave, she suddenly heard incoming footsteps from in front of them.</p><br/><p>“There’s someone!” Fa Yu reached out his hand in an attempt to pull her.</p><br/><p>Zhu Yao immediately leapt a step back, hiding behind a piece of rock with a swoop. If I let you slam my face into dirt again, then I’m your granddaughter!</p><br/><p>They placed down a few concealment formations, and a short while after they had hidden themselves well, four people appeared in their view.</p><br/><p>Zhu Yao wanted to cuss out. Enemies always cross each other’s paths! Just how much disastrous fate did she have with the female lead? They were actually bumping with each other everywhere.</p><br/><p>Big brother Bai Li, what do we do?” Fan Zhishan and the gang stopped not far away, her face was filled with panic. As though they had found out that Regretless Crossing was just in front of them as well, they stopped progressing.</p><br/><p>The tenth rank demonic beast Bai Li frowned. He looked at his surroundings, and then consoled her. “Don’t be afraid, I’m here after all. At the very most, we can just return the item.”</p><br/><p>“We can’t!” Fan Zhishan immediately refuted. Seeing the gazes of her three companions, her expression changed as she immediately explained. “I mean… Big brother Bai Li used so much effort to help me obtain this item. If we were to return it back like this, wouldn’t that be letting down your goodwill? Furthermore…” She turned to look at the two others, and tears began to well in her eyes. “Big brother Yufeng was injured because of this… How can I… I’m to blame! I harmed all of you.”</p><br/><p>“Zhishan!” That Azoth practitioner said with a gentle look. “My injuries weren’t your fault, I can only blame my lack of skills. How can you put the blame on yourself?”</p><br/><p>“That’s right!” Cao Qi persuaded. “You’re just too kind. This wasn’t your problem in the first place, and furthermore, we were the ones who were willing to accompany you on this dangerous adventure. How can this be your fault?”</p><br/><p>Bai Li nodded as well. He reached out to grab her waist and gently consoled her. “Zhishan, you don’t have to worry. This place is a dead land. Even a tenth rank demonic beast would not dare to approach it so easily. We just have to hide here for a day, and after searching for us to no avail, they will naturally give up.”</p><br/><p>“Really?” The female lead naively asked.</p><br/><p>Bai Li nodded heavily.</p><br/><p>“Now you can be ease, right?” Cao Qi tapped on her nose. “I already told you there isn’t a need to worry.”</p><br/><p>Fan Zhishan’s face instantly flushed, embarrassed. “Big brother Bai Li, big brother Cao, Big brother Yufeng…”</p><br/><p>“Silly little sister…”</p><br/><p>Zhu Yao’s face darkened from hearing their conversation as she pieced together the situation. This four people took something from someone, and fled here after being chased. Also, this item seemed to be extremely special and the female lead did not want to return it at all. To actually act so righteous for stealing something, Zhu Yao really had to hand it to her.</p><br/><p>Zhu Yao could not help but feel like wanting to pick up their three worldviews for them. She then turned her head, only to see Fa Yu’s constipated look next to her.</p><br/><p>“What’s wrong?” Zhu Yao transmitted her voice over, but he did not reply. Zhu Yao had no choice but to follow his line of sight.</p><br/><p>And then, she was stunned!</p><br/><p>The hell, these four people… how the hell did they end up broadcasting an age-restricted video after a conversation like that? It had only been a few minutes, and their clothes were already half-stripped, hey.</p><br/><p>“Immoral!” Fa Yu coldly snorted, as he turned around and meditated to calm himself.</p><br/><p>She’s a an R18 female lead after all, so R18 scenes were naturally in the main route. Such things could be understood. “Mn… Though her taste is a little heavy.”</p><br/><p>This was after all a foursome. Even among Japanese films, there were only a few that cater to tastes as heavy as this, and this is live-action even. Mn… Just from thinking about this, she was beginning to grow a little excited?</p><br/><p>“Aren’t you afraid of turning blind?” Fa Yu glared at her.</p><br/><p>“Once foreign, twice familiar after all.” I have even watched the original movie with your wife, you know? “In any case, these aren’t my eyes.” It’s Ling Tian girly’s~</p><br/><p>“…” His face was filled with crap.</p><br/><p>“It’s the live-action version, are you certain you’re not going to look?” Don’t all men have such tastes?</p><br/><p>“…” His face instantly darkened.</p><br/><p>“Why don’t I… swap with Ling Tian girly?” So that you two can watch it together.</p><br/><p>Fa Yu suddenly glared at her. If you dare to raise my Tiantian improperly, I’m going to exterminate you.</p><br/><p>“Uh…” She seemed to have already made her watch something improper once.</p><br/><p>Whatever, I will watch it myself.</p><br/><p>“Yo, they’re stark naked now.”</p><br/><p>“…” Fa Yu instantly closed his eyes.</p><br/><p>“Wow, to begin with two people on top. Such heavy tastes.”</p><br/><p>“…” Fa Yu cupped his ears.</p><br/><p>“Yaaaa, it’s a foursome now.”</p><br/><p>“…” He puked.</p><br/><p>“Ehhhh, why did he turn back to his beast form?”</p><br/><p>“…”</p><br/><p>“Ehh, there’s even bestiality. What the hell!”</p><br/><p>Sesame puked as well.</p><br/><p>At first, Zhu Yao was watching it with the attitude of a scenario reviewer, until the broadcast continued on for three hours and the sky was even beginning to set. The four people… no, while three people and one beast were still cultivating with great efforts, even Zhu Yao began to feel that it was becoming aesthetically difficult to watch.</p><br/><p>Yet the squealing noises of the female lead continued to sound out. If her voice were to be brought to the modern era, she would definitely be popular. If that time were to come, even Cang-sensei would have to give in, alright? Every male shut-in would have one copy of her film, and they would carefully treasure it…</p><br/><p>Eh, wait a minute!</p><br/><p>Zhu Yao glanced at the Rising Symbol Rock in her hand, and suddenly had an evil thought.</p><br/><p>“Hey, hey, hey. Tiantian’s childhood friend.” Zhu Yao nudged Fa Yu, and said with a mysterious look. “Let me borrow something from you.”</p><br/><p>——————————————</p><br/><p>The action film on that side broadcasted for an entire night, and Zhu Yao felt it was in a serious state of aesthetical depreciation. During the latter half, she had already lost all interest in viewing it. Bored, she took the opportunity when the few of them were still concentrated in their broadcast to place down a few spiritual energy concealment formations. Circulating the fire spiritual energy in her body, she began to refine the artifact.</p><br/><p>Rising Symbol Rock was a rare material, but its rank was not entirely great. Its only benefit was its flexibility. Mystic artifacts from the third rank to the eighth rank could be made from this material, but the grade of the artifact made by it was based on the artificer’s skills alone. The mystic artifact that Zhu Yao planned to make was not dependent on its rank. In the first place, it was not going to be used for battle. The reason why Rising Symbol Rock was needed, was simply because it had the best light reflective property out of all the materials she knew.</p><br/><p>Zhu Yao crafted the exact same composition, based on the positions of the stone plates in the plaza, into the melted Rising Symbol Rock. In the end, she made a cylindrical… telescope!</p><br/><p>…</p><br/><p>Even Zhu Yao herself did not think that the mystic artifact would turn out like this after refinement. Furthermore, it was the monocular collapsible type.</p><br/><p>Fine, classical wins. The only difference was that the average telescope only had two lens, while hers had dozens of them, where they were pieces of the Rising Symbol Rock placed in different angles.</p><br/><p>However, during the formation engraving, she hesitated. If she directly engraved the formation onto it, then anyone could use it to see luck. That, in essence, wouldn’t be any different from the female lead.</p><br/><p>After pondering for a moment, she decided not to directly engrave the formation she had calculated beforehand. Instead, she directly inserted a strand of spiritual energy into it. Through the Rising Symbol Rock pieces, she slowly corrected the circulation flow of the spiritual energy to outline the formation.</p><br/><p>Then, she looked at the four people that were entangled together through the telescope.</p><br/>\n</div>"}