{"title": "Chapter 350: I Have Just Hit Menopause, I Want Some Peace and Quiet", "id": 350, "volume": 4, "url": "http://boxnovel.org/my-disciple-died-yet-again-chapter-350-i-have-just-hit-menopause-i-want-some-peace-and-quiet", "volume_title": "Volume 4", "body": "<h1>Chapter 350: I Have Just Hit Menopause, I Want Some Peace and Quiet</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 350: I Have Just Hit Menopause, I Want Some Peace and Quiet</p><br/><p>Zhu Yao deeply felt that she must have destroyed the Milky Way in her past life, which resulted in her meeting such an unreliable person. Ever since she was picked up by him, there were neverending number of incidents occurring. Occasionally, people would appear to settle debts with him. Some of these people once had their divine treasures robbed, some had their cultivation cave residences taken away, while many of them were once heavily injured by him. Every single one of them hated him to the very core, as though they wanted to swallow him alive.</p><br/><p>In any case, not a single one practitioner that they passed by on the way wasn’t acquainted with him one way or another. This was the first time Zhu Yao had seen someone who had such a wide aggro range. Almost every short distance they covered, there would be people charging out to fight him. Some came alone, while some came in groups of three to five. She was rather shocked in the beginning, but she had already become completely calm at the end.</p><br/><p>In any case, every so often, there would be people leaping out and shouting:</p><br/><p>“Evil Deity, return me my treasures!”</p><br/><p>“Evil Deity, return me my cave residence!”</p><br/><p>“Evil Deity, return me my…”</p><br/><p>And other things along those lines, until a delicate Profound Deity that looked like a frail scholar pop out. “Evil Deity, return me my wife!”</p><br/><p>Zhu Yao silently glanced at Xue Yi. “Yo, I never expected your private life to be this fulfilling.”</p><br/><p>Xue Yi was stunned for a moment, as though he never expected that he would utter such a thing either. At that moment, he grew anxious. “Nonsense! Who stole your wife?”</p><br/><p>“What does this have to do with me?” Why are you giving me an explanation?</p><br/><p>“To tell you the truth, I’m…” His face reddened and he shyly turned his head away. He tapped his fingers together and said. “I’m… I’m… I’m still a virgin!”</p><br/><p>“……”</p><br/><p>“…”</p><br/><p>A moment later.</p><br/><p>“Ou…”</p><br/><p>How is this my business!? -flips table-</p><br/><p>“You still dare to lie.” That Profound Deity was immediately enraged. He pointed at Xue Li with a pained expression and accused. “If you hadn’t forcefully broken into my wife’s closed-door training location in Cloudspill Sea, would she have died from self-implosion!?”</p><br/><p>“Cloudspill Sea?” Xue Yi was dazed for a moment.</p><br/><p>“That’s right.” The man gritted his teeth and said. “It’s that cave residence at the bottom of the sea.</p><br/><p>Bottom of the sea? Wasn’t that the place where she was picked up by Xue Yi?</p><br/><p>“My wife and I spent a thousand years to build that cave residence. I never expected…” That man denounced him with a pained look. “You greedy beast! You took the opportunity while I wasn’t around, to my wife… You made her die from self-implosion! Today, I shall take your life and help her take revenge!”</p><br/><p>What did he do to your wife? Speak clearly, hey. How can you leave out the most important details?</p><br/><p>“I didn’t.” Xue Yi forcefully shook his head and said in a serious tone. “I robbed that place off a male Deity. I am a Deity with principles. How can I possibly attack a frail female type? You can wrong me, but you can’t insult my tastes.”</p><br/><p>Zhu Yao; “…” The hell does this have to do with your tastes!?</p><br/><p>The man snorted. With a wave of his sleeves, an illusory figure appeared in the air. That person had a burly figure, with tiger-like back and a bear’s waist. Even the black hair could not conceal those firm and thick muscles, which looked as though they could explode at any moment. That person looked like a professional bodybuilder. “Evil Deity, do you recognize this person?”</p><br/><p>“Eh!?” Xue Yi looked carefully, and blurted out. “Isn’t that the person who wouldn’t move out of his home in the seafloor even in death?”</p><br/><p>The man’s anger peaked, shouting out. “This is my wife!”</p><br/><p>Zhu Yao: “…” There’s actually such a delightful woman in this world.</p><br/><p>Xue Yi: “…” So a female type actually looks like that. It’s no wonder I can never find a partner.</p><br/><p>“My wife and I… our feelings are as deep as the ocean, and we had always relied on each other since the times we were in the Lower Realm. We never let each other go.” He said with a pained expression. “Now, i’m the only one left living in this world.” His eyes reddened. As though he had dove into some memories, his face was filled with despair and yearning. “It’s all because of you! From now on… there will never be anyone else who will keep the candle on for me late in the night, there will never be anyone else who will sleep on the same bed as me, there will never be anyone else who will hug me tight. No one will ever again smack my body with a whip, and no one will ever again use the candles to… Uh, in any case, I want you to pay with your blood!”</p><br/><p>The two people in front of him: “…”</p><br/><p>They seemed to have just found out something incredible.</p><br/><p>This person is a masochist right!? He must be, right!?</p><br/><p>“Give me your life!” That male Deity raised his sword and hacked it towards Xue Yi.</p><br/><p>Unexpectedly, Xue Yi did not directly attack him with simple brute strength like before. Instead, his figure flashed, dodging his attack.</p><br/><p>“You really killed her?” Zhu Yao could not help but ask.</p><br/><p>Xue Yi’s feet stopped, and then nodded a while later. “Mn, back then, I was in dire need of that cave residence.” He pondered for a moment, and then added. “I really didn’t know the person living there was a female type.”</p><br/><p>“…” Zhu Yao did not reply. She had a vague feeling in her heart, where she faintly felt that the key problem here wasn’t about differentiating between man and woman.</p><br/><p>That man after all was still just a Profound Deity, and he was basically unable to injure Xue Yi even the slightest bit. With a light wave of his sleeves, Xue Yi easily deflected his attack. Frowning, he shouted out loud. “Hey, seeing that you have lost your partner, I can give you ten moves. After these ten strikes, don’t blame me for being rough.”</p><br/><p>“Don’t act arrogant!” That man trembled from anger. Gritting his teeth, he unleashed all of the divine energy in his body and attacked Xue Yi without a regard for his life. He even threw out all of his talismans, treasures and divine artifacts. “In the past, because you altered the formation in the sea depth, I couldn’t do anything to you. Since you came out here today, don’t even think I will give you the opportunity to hide again.”</p><br/><p>Loud booms resounded. The place was filled with the sounds of divine talismans and divine treasures activating, their might shaking the sky.</p><br/><p>As he had declared, Xue Yi did not resist and simply dodged all of his attacks. While doing so, he carefully counted his opponent’s moves. “One, two, three, four…”</p><br/><p>With the absolute advantage from the difference in levels, the man was basically unable to harm Xue Yi at all. Just a short while later, he was already panting out heavily, while Xue Yi was not even scarred at all. The man’s expression turned severe. With a swing of his hand, he sliced his own arm and used his fresh blood to condense a formation.</p><br/><p>“Blood Condensing Formation.” Xue Yi was stunned. He took a few steps back and immediately erected a defensive barrier. At the same time, a bloody divine sword that enveloped the sky and earth came attacking him. Even the barrier that he had erected was beginning to show lines of cracks. Finally, the barrier shattered resoundingly. Earlier, the man failed to even touch him, but now, the bloody divine sword drew lines across Xue Yi’s body, and there were even times when Xue Yi’s vital points were almost struck. However, the Blood Condensing Formation was after all a unique formation that made use of one’s essence to activate. In other words, if it was used to harm a thousand, then eight hundred would be sacrificed.</p><br/><p>In just a few moments, the man could no longer hold it up. His figure shook and then he fell with one knee on the ground. His face instantly became as pale as paper. He had a frail scholar appearance in the first place, and yet now he looked as if he could be scattered apart with just a small breeze.</p><br/><p>Xue Yi then shouted out the final number at this moment. “Ten.”</p><br/><p>With a wave of his hand, he summoned a divine sword and walked towards that person a step at a time. He had a cold look on his face, instead of the silly expression he had just before. In that pair of sharp eyes, lingered true killing intent. Zhu Yao felt her heart tremble, and she unconsciously shouted out. “Xue Yi!”</p><br/><p>His feet stopped, as though he was asking her what’s wrong.</p><br/><p>She knew she had no basis for this, but she still could not help but call out. “Can you… not kill him?”</p><br/><p>Xue Yi frowned, and determinedly shook his head. “Impossible!” He said as he approached the man. “If I don’t kill him today, my death might come another day. I can’t leave behind any snake in the grass.”</p><br/><p>“……”</p><br/><p>“…”</p><br/><p>He stopped three steps away from the man, and with the sword in his hand raised, he was just about to strike, when that man suddenly raised his head. He had a smile on his face. Xue Yi’s heart shook, and a bright white light suddenly glowed in the surroundings at this moment. When he dodged to the side, he saw a ray of white light shot towards the sky, instantly breaking through the clouds.</p><br/><p>“Do you think that I will come here alone without being completely prepared?” That man suddenly laughed out loud. “I know that I’m not your match, but so what if your cultivation level is high? There will naturally be someone capable of defeating you.”</p><br/><p>Xue Yi looked towards that pillar of light. He had a bad premonition, and he unconsciously tightened his grip on Zhu Yao’s hilt. “What mystic artifact is this?”</p><br/><p>“You actually don’t recognize the Disciplinary Order!?” That man coldly laughed, his eyes looked as though he had been freed. With a long sigh, he said. “Well, whatever! Evil Deity, you have done many vile acts, and it’s now time for you to pay the price.”</p><br/><p>That white light grew brighter as the surrounding talismans shone. A figure slowly appeared from the center, and the person grew clearer. Boundless pressure assaulted Xue Yi and he was unable to maintain his stance, kneeling right down and puking out a mouthful of blood.</p><br/><p>The white light scattered. In the middle of the formation, a sloven-looking man appeared. He was dressed in a red robe and wore a jade crown. With a pair of sword-sharp eyes, he held onto a jade-mounted red fan in his hand. That person was first stunned for a moment, as he looked at Zhu Yao in front of Xue Yi’s chest.</p><br/><p>Zhu Yao was stunned, and she could not help but leak out. “Great great…” The person in front of her hurriedly raised his fan to cover his lips, hinting her to keep quiet. She had no choice but to alter her words. “… tonic water.”</p><br/><p>“What?” Xue Yi lowered his head in confusion.</p><br/><p>“Hohoho… I have just hit my menopause, and I need some peace and quiet.”</p><br/><p>“……”</p><br/><p>“…”</p><br/><p>————————————</p><br/><p>Zhu Yao was a little confused.</p><br/><p>When did the Floor Master become someone else’s summoned beast? Why did he appear here? What happened to the promise of helping her master to protect her body? Was it really alright for him to appear here?</p><br/><p>The sorrow in Yu Jin’s heart could already form a river. He didn’t want to be here either, but why was there still people who would look for a Disciplinary Order? And why did the Disciplinary Order have to be linked with the Floor Master’s divine imprint?</p><br/><p>A second earlier, he was still protecting his little little grand disciple’s body, and in a blink of an eye, he was here in this ghastly place. He even patted on his chest and guaranteed that he would look after his little little grand disciple well, before he was finally able to escape Little Yanyan’s demonic claws. Now that he had left his post, he was going to be zapped to death, right? It will definitely happen, right!?</p><br/><p>The problem here was that his little little grand disciple was being held captive there too. My heart aches, I feel so hurt, I really want to bully people!</p><br/><p>Yu Jin swept his cold eyes around, an indescribable tyrannical might could be felt. His usual leisurely and casual demeanour could no longer be found. “Who activated the Disciplinary Order?” Come out here and let me smack you for a bit.</p><br/><p>“High Deity of Lightning Divine Palace!” The Profound Deity stumbled about as he bowed towards Yu Jin. “This person is a Evil Deity who has been wrecking havoc in the Divine Realm…” Thus, he began to list down all of Xue Yi’s crimes. When he brought up his wife, his words were filled with even more indignation. Finally, he added. “This lowly one unhesitantly risked everything to find this Disciplinary Order. I hope High Deity can judge this vile Xue Yi for his crimes, for this lowly one and for the people of the Divine Realm!” As he said that, he knelt down.</p><br/><p>Yu Jin frowned. He turned towards Xue Li on the other side. Though Lightning Divine Palace was a place that governed the order of the Divine Realm, it had been a long time since he maintained justice or whatever! Putting aside how unfamiliar with the work he was, this Disciplinary Order was something he made for fun because he was bored to death a few tens of thousands of years ago. In addition, he put out the word that as long as the Disciplinary Order was found, the user would be able to have the Floor Master of Lightning Divine Palace to exact justice and punish evil.</p><br/><p>To put it simply, it was just something he did on a whim. He had been a Floor Master for so many years and had long thought of quitting. Yet, he was unable to find a successor to succeed him. That was why he intentionally linked the Floor Master’s divine imprint with this item. His goal was to secretly toy with the next Floor Master. In the end, he failed to make fun of others, and ended up toying with himself.</p><br/><p>To summarise: If you don’t court death, you won’t die!</p><br/><p>Haah! He clearly hid this Disciplinary Order at such a deep place. How did this person find it? Could he have some peace as a Floor Master for once?</p><br/><p>He had long cussed out in several hundred different ways in his heart, yet he had no choice but to keep up that proud and cold demeanour. With a stern look, he asked. “Is what he said all true?” Even if he had to cry, he had to bury this own hole that he created to the very end.</p><br/><p>“Yes, I did them.” Xue Yi admitted it really straightforwardly. “I don’t see myself as a good person, but this world is as such in the first place. I believe that whatever I’ve done, has been done by every single person in the Divine Realm. In order to expand a territory, stealing one needs to be done, and when in conflict with others, it’s natural to fight. When it comes to people that can’t be beaten, it’s either run, or face death. This is the laws of this world in the first place.”</p><br/><p>Expand territory? Conflict? Zhu Yao was stunned for a moment. Why was this tone familiar…</p><br/><p>“In that case, I will accept this Disciplinary Order today.” Yu Jin reached out his hand. The divine imprints that was still shining earlier on the ground began to rise and converge, before disappearing within his palm. The might of a High Deity was fully released, and the sky above was instantly filled with dark clouds and rumbling thunder.</p><br/><p>White a flash of white light, a bolt of heavenly lightning struck down.</p><br/><p>The hell, Floor Master, you’re doing it for real!</p><br/><p>Xue Yi gritted his teeth as he desperately used all of the divine energy in his body to push back the High Deity’s pressure. In a flash, he left his former spot. However, that lightning bolt creaked and split itself into halves, where one of it came chasing after him. He had no choice but to block it with his divine sword. A fifth rank divine sword turned into ashes under this incredible lightning might.</p><br/><p>He had no choice but to pull out a new one, as he fought and retreat. He fled for about dozens of kilometers, yet he was still unable to escape the lightning flashes that enveloped the sky and earth. Fortunately for him, he scavenged quite a bit of divine artifacts from that divine city earlier, allowing him to expend so many of them as consumables. However, his stock of divine artifacts was after all limited. In the beginning, he could still pull out fifth rank ones. Immediately after, he took out fourth rank ones, and finally, he had no choice but to pull out the third rank artifacts.</p><br/><p>A fifth rank divine artifact could not even block it, let alone a low grade artifact. He watched as another lightning bolt came striking at him, immediately destroying the third rank divine artifact in his hand, however, it had only resolved a fifth of the lightning bolt’s original lightning power. Just as the lightning bolt was about to strike his chest, it suddenly twisted and struck heavily onto his body.</p><br/><p>A hint of doubt flashed across Xue Yi’s face. However, in the next instant, he felt his blood tumbling, the meridians in his body breaking apart, and his Dantian felt as if it was about to shatter.</p><br/><p>“Divine sword maiden…” He suddenly pulled her out.</p><br/><p>“What is it?”</p><br/><p>“I don’t know why, but I realized… that person seems to be avoiding you intentionally. He must be afraid of you for some reason.”</p><br/><p>“Uh… You’re thinking of using me to face the enemy?”</p><br/><p>“No!” He shook his head. “I want to…”</p><br/><p>Before he could finish, Yu Jin’s figure appeared in front of him in a flash. He looked at the sword in Xue Yi’s hand and said. “Xue Yi, give me that weapon and admit defeat. This Sovereign can consider letting you live.”</p><br/>\n</div>"}