{"title": "Chapter 352: The Promised Blissful Life", "id": 352, "volume": 4, "url": "http://boxnovel.org/my-disciple-died-yet-again-chapter-352-the-promised-blissful-life", "volume_title": "Volume 4", "body": "<h1>Chapter 352: The Promised Blissful Life</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 352: The Promised Blissful Life</p><br/><p>She was finally legally retrieved by her master. Zhu Yao thought that her sad exile in the Divine Realm was about to end, the next step was to bind herself to her former body, and from then on, with her master, live a shameless and immoral… Ah pui! She meant living a blissful and lovely life with her master. However, when they returned to Lightning Divine Palace, she realized her thoughts were truly naive.</p><br/><p>Her soul returned, but… her avatar had disappeared!</p><br/><p>“Where’s my body?” Did she had to go through something so saddening?</p><br/><p>“There’s no traces of living people around.” Yu Yan released his divine sense and searched through the entire Lightning Divine Palace. However, he did not find his disciple’s body at all.</p><br/><p>They both turned their heads back and with eyes that were as sharp as blades, looked at a certain someone who left his guard duty.</p><br/><p>“Uh…” Yu Jin was dumbfounded as well, and then he weakly took a step back. “She was here just earlier.” It was not even an hour since he left, how did his little little grand disciple’s body disappear? “The formation outside has no traces of being activated. Logically speaking, others are unable to enter this place either. It’s impossible for it to disappear.”</p><br/><p>“So you’re saying I disappeared into thin air?” The corner of Zhu Yao’s lips twitched. I’m an ethanol! I must have vaporized!</p><br/><p>“Little little grand disciple, don’t be anxious.” Yu Jin smiled and said. “I placed a tracking formation on your body. As long as I activate it, we will naturally know where your body is.”</p><br/><p>He threw Xue Yi down and then cast an art that materialized a water mirror that had the height of an adult. He brushed his palm against the surface of the mirror, and after a flash of light, what appeared slowly within the mirror was… a mass of white fog.</p><br/><p>Zhu Yao: “…”</p><br/><p>Yu Yan: “…”</p><br/><p>What happened to the promised security footage? Your wireless technology clearly can’t make it, hey!</p><br/><p>“Uh…” Yu Yan’s face stiffened, and then chuckled in front of them. “Hoho… This is a miss… Umm, I suddenly recalled that I was still barbecuing the corn in the backyard! Let’s meet up again later.” After he said that, he ran off, leaving a trail of dust clouds.</p><br/><p>The corner of Zhu Yao’s lips twitched. Where’s the promised trust between people in the same sect?</p><br/><p>“Master…” What to do?</p><br/><p>Yu Yan frowned. He carefully placed his disciple on the table and glanced at the water mirror that was still as foggy, to the point that nothing could be clearly seen. With a sunken voice, he said. “The water mirror is unable to display the location, which means that the formation is in a place with extremely great security. This person who has the ability to infiltrate Lightning Divine Palace, bring your body away and leave unharmed, is not simple either. There’s a need to look at this from a long-term perspective.”</p><br/><p>“Then do I still have to stay as a sword?” Zhu Yao felt like crying.</p><br/><p>“That’s not the case.” Yu Yan lightly sliced his finger, squeezed out a drop of blood and had it drip onto the blade.</p><br/><p>“Master?” In an instant, the smell of blood once again filled her senses.</p><br/><p>“Don’t resist.”</p><br/><p>Just as Zhu Yao was about to puke it out, she stopped. She had no choice but to fight back the discomfort and swallow it. In an instant, the discomfort disappeared. Instead, familiar divine energy began to pour into her, and she felt that her blade had lightened quite a bit.</p><br/><p>Yu Yan cast an art, causing a formation to flash past. The row of symbols on her blade suddenly began to gather, slowing converging at the bottom of the hilt. When the light of the formation finally scattered away, a familiar lightning cloud mark appeared. It was the mark of Lightning Divine Palace.</p><br/><p>“What is this?” Just as Zhu Yao was about to ask, the blade suddenly emit out a white light. She felt that her entire being was floating up, and when she regained her senses, she was already standing next to the table, while the sword was still on the table. She subconsciously wanted to touch the sword on the table, but unexpectedly, the moment she touched the blade, her fingers passed through it. “What’s going on?” Did she return to the soul state?</p><br/><p>“Yu… Yao. This sword is not your main body.” Yu Yan spoke up solemnly.</p><br/><p>“Not my main body!” Zhu Yao was stunned. “Then, I was possessing this sword?” When did a second rank divine sword become so incredible? It actually had the capabilities to lure in souls.</p><br/><p>Yu Yan shook his head. “No, you’re a part of this sword.”</p><br/><p>“What?”</p><br/><p>“You’re just a sword spirit of this sword right now.” He glanced at the sword on the table. “The reason why you weren’t able to leave the sword earlier, was because you had insufficient divine energy, thus you weren’t able to maintain your appearance. Earlier, I inserted divine energy into your body, which aided you in manifesting your corporeal form.”</p><br/><p>Zhu Yao pondered deeply for a moment. This was actually quite plausible. Back then when she was picked up by Miao Bo, he couldn’t hear her talk at all. After that, she was thrown into the sea and suddenly others could hear her, and right before that, she had indeed taken in a lot of divine energy that leaked out of Miao Bo’s body in that mysterious Secret Realm. In the end, the reason why people couldn’t hear her was because she had insufficient battery.</p><br/><p>Eh? Wait a minute…</p><br/><p>Zhu Yao pointed at the mark belonging to Lightning Divine Palace on the blade. “Master, since I can make an appearance when divine energy is inserted, then what’s with this mark?” Was there a need for the sword to recognize a master first before inserting divine energy?</p><br/><p>Yu Yan stiffened for a moment. After blanking for two seconds, he suddenly stood up. “Your divine energy right now is still unstable, and you can’t manifest your corporeal form for a long period of time. Your master shall first bring you to the Lightning Abyss Pool to stabilize your divine energy.”</p><br/><p>“Ou…” Why did she feel something was off?</p><br/><p>Yu Yan immediately held his disciple and flew towards the mountain peak. Stamping his disciple in order to prevent her from being taken away, was a very common thing to do, wasn’t it?</p><br/><p>————————————</p><br/><p>This was already the second time Zhu Yao had entered the Lightning Abyss Pool. Compared to the first time she came here as a rock, it was clearly much better this time. Putting aside how she wasn’t feeling any pain, she had a family member keeping her company for the entire process.</p><br/><p>She bathed in it for exactly ten days before the divine energy in her slowly started to stabilize. She could finally maintain her corporeal form for twenty-four hours a day without a single interruption. However, she still couldn’t hold onto the sword, as a sword spirit was a part of the divine sword in the first place. Strictly speaking, the sword was the main body, while she was just an accessory. Thus, she naturally could not control the sword. Furthermore, she could only appear in half a kilometer radius with the sword at the center. Any further than that and she would return to the sword.</p><br/><p>There were still no news on her body. Her master had reinforced the formations surrounding Lightning Divine Palace. Those dense layers of formations were enough to make Zhu Yao a little dizzy. Even a fly would most likely fail flying in here, let alone a human being.</p><br/><p>As for the culprit great great grandmaster, fellow comrade Floor Master Yu Jin, on the very first day she entered the Lightning Abyss Pool, he reported that he would personally search for her body. After leaving behind his greetings, he hurriedly left Lightning Divine Palace. No matter how she saw it, it seemed like he was desperately trying to flee.</p><br/><p>However, with that somewhat unreliable personality of his, Zhu Yao did not harbour any hopes at all.</p><br/><p>Though she was used to having her avatars changed, the one that was misplaced was the original version! She had to find it and get it back no matter what.</p><br/><p>“Master, are there many places where great great grandmaster’s formation isn’t able to track?” Zhu Yao crawled out of the Lightning Abyss Pool as she asked.</p><br/><p>Yu Yan pondered for a moment. “Not more than three.” The Floor Master had the cultivation of a High Deity Paragon. The number of things that could escape his tracking art was extremely few.</p><br/><p>“Let us head to those places to take a look then?” Zhu Yao suggested.</p><br/><p>Yu Yan did not reject her idea. With a wave of his hand, he cast an art on his disciple and on that divine sword, removing the excess lightning energy in her body. He then held onto his disciple on one hand, and then grab the sword with the other, before flying into the air. Her master was a High Deity, so he didn’t need support from any mystic artifacts to aid him in flying in the air. In just a flash, the two had already left Lightning Divine Palace.</p><br/><p>When she turned back to look, lightning clouds shrouded over the place, as the dense layers of formations began to close.</p><br/><p>Eh? Why did she feel as though she had forgotten about something?</p><br/><p>She couldn’t recall anymore…</p><br/><p>Haah, whatever. Most likely, it’s not that important either.</p><br/><p>***</p><br/><p>Foot of the Mountain of Lightning Divine Palace</p><br/><p>A certain someone that was unconscious for ten days slowly awakened. He looked at the surroundings blankly, only to find out that the place was covered in dark, scorched earth.</p><br/><p>“Where is… this place?”</p><br/><p>————————————</p><br/><p>Zhu Yao thought that she could find her avatar very quickly. However, she never expected she had hit another miss. The three places that her master brought up did not have any traces of her avatar at all. Yu Yan had his divine sense filled more than half of the Deity cultivation continent, and he meticulously searched for about five days, yet he still did not find any leads.</p><br/><p>This was illogical! Could Realmspirit have retrieved her avatar? He couldn’t have not greeted her before doing so, right?</p><br/><p>Wait a minute! She suddenly recalled that before this, she could switch between the two avatars. However, in these few months, the phenomenon where she would switch her avatar in real-time had completely stopped. Could there be a unique set of rules for this switch to occur?</p><br/><p>She carefully recalled the experiences with the two avatar switching incident. During the first time, she seemed to have returned after being placed in the storage pouch. On the second time… she seemed to have suffocated quite badly. If there was any similarity between these two incidents, then… the switch occurred when she was completely devoid of divine energy!</p><br/><p>Zhu Yao simply felt a bell ringing and a candle lighting up in her mind. She hurriedly tugged her master. “Master, I know how I can return to my original body. Hurry and place me inside the storage pouch.” She meticulously explained to him whatever she had thought of.</p><br/><p>Yu Yan however frowned and was clearly rejecting her proposal. “Though the method you proposed makes sense… even if this method works, we don’t know where your body is right now? If you were to wake up, and if there was any sort of danger, you will be held in a disadvantage.”</p><br/><p>“Don’t worry, master. I will be careful.” Zhu Yao patted on her chest and guaranteed. “It won’t take long. Just place me inside your storage pouch for a while should be fine. At the very most, you can pull me out fifteen minutes later. After that, my soul will naturally return. Isn’t the problem solved now?”</p><br/><p>He hesitated for a moment. He was still completely rejecting such a risky endeavor. Zhu Yao uttered out all of her excuses and persuaded him for a long while, before she was finally given a bare pass.</p><br/><p>“Remember, do not move recklessly.” He instructed her repeatedly. “Only act after discussing with your master when your return. Just in case, I will just put you inside for three breaths of time.</p><br/><p>“Ah! That’s a little too short a timeframe, right?” Three breaths. In other words, it was only three seconds. How could she possibly see anything through with such a limited timeframe?</p><br/><p>“Mn?”</p><br/><p>“Alright then!” You’re the boss.</p><br/><p>In a flash, Zhu Yao’s figure returned to the sword. Yu Yan held onto the sword tightly as he still harboured a hesitant look. A short while later, he finally opened the storage ring on her palm, and Zhu Yao instantly turned into a ray of white light and entered the ring.</p><br/><p>One second…</p><br/><p>Two seconds…</p><br/><p>Time’s up. She could be retrieved now. With a wave of his hand, Yu Yan had the second rank divine sword once again appear on his hand. On the pure-white blade, the lightning cloud mark was especially eye-catching. She hurriedly called out in a solemn voice.</p><br/><p>“Yu… Yao.”</p><br/><p>“…” There was no reply.</p><br/><p>“Yu Yao!”</p><br/><p>“…” There was still no reply.</p><br/><p>“Reply your master.”</p><br/><p>“…”</p><br/><p>“Yu Wang!”</p><br/><p>“…” Complete silence.</p><br/><p>On Yu Yan’s former light and bland face, dark clouds began to surface. The dark clouds turned cold, and finally brought down a hail…</p><br/>\n</div>"}