{"title": "Chapter 359: Your Sister’s a Life Artifact", "id": 359, "volume": 4, "url": "http://boxnovel.org/my-disciple-died-yet-again-chapter-359-your-sister%E2%80%99s-a-life-artifact", "volume_title": "Volume 4", "body": "<h1>Chapter 359: Your Sister’s a Life Artifact</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 359: Your Sister’s a Life Artifact</p><br/><p>Xue Yi furiously turned his head around, glaring ruthlessly at the three of them. “You greedy beasts, just what did you all do to my divine sword maiden!?”</p><br/><p>Greedy Beast One Zhu Yao: “…” Who’s yours? Faints!</p><br/><p>Greedy Beast Two Yu Yan: “…” I’ve already done whatever I should’ve done.</p><br/><p>Greedy Beast Three Yu Jin: “…” An innocent bystander who got dragged in.</p><br/><p>“Divine sword maiden, I will avenge you!” Xue Yi kept that tattered divine sword, summoned his weapon, and glared at the three of them with an enraged look. “None of you shall even think about escaping today.”</p><br/><p>Like I said, where the hell did he get all that confidence from, hey? “Xue Yi, calm down. I’m actually…”</p><br/><p>“Shut up!” He coldly glared at her. “This daddy doesn’t want to hear any crap from you lot.”</p><br/><p>“…” The hell!</p><br/><p>Pointing his sword straight, killing intent instantly burst into the surroundings. “Which one of you is going to come at me first? Step forward!”</p><br/><p>The corner of Zhu Yao’s lips twitched. She made eye contact with her master, and then… both of them took a step back.</p><br/><p>Yu Jin who was now standing in front. “…”</p><br/><p>“Good luck, great great grandmaster.” Zhu Yao did a cheering pose.</p><br/><p>“Why me?” What happened to the promised love between sect members?</p><br/><p>“Haah! We can’t blame him for being alone, right? It’s not good for two of us to bully one of him, and coincidentally, the numbers match if you go up.” Zhu Yao chuckled.</p><br/><p>Flips table! Is a single puppy not human!?</p><br/><p>“Those who are skilled get more work, after all. As they say, friendship first, competition second, don’t be too hard on him now. Now go, Pikachu!”</p><br/><p>The hell is a Pikachu?</p><br/><p>Xue Yi had already flown forward and launched an attack with a swing his sword. In an instant, icicles shot out from the ground, yet Yu Jin did not even bother moving at all. With a wave of his hand, the icicles shattered inch by inch and turned into water.</p><br/><p>Xue Yi once again materialized countless spiritual swords and had them smashing down in an overwhelming manner. However, the moment they touched the ground, they suddenly changed their direction and shot towards Zhu Yao’s direction.</p><br/><p>He was actually planning a sneak attack, but it seemed like he picked the wrong target.</p><br/><p>Yu Yan frowned. With a release of his pressure, forget about the spiritual swords, even Xue Yi was slammed onto the ground. He was no longer capable of moving. Instant kill!</p><br/><p>Haah. He clearly said he wanted a solo battle, yet he went for a one against three instead. Why the trouble?</p><br/><p>Yu Yan took a few steps forward. Just as he was about to pull out the divine sword from Xue Yi’s robe, Xue Yi who was still lying on the ground suddenly broke into a smile. Zhu Yao instantly had a bad feeling.</p><br/><p>A gust of wind swept over from behind her. When she turned to look, Xue Yi suddenly appeared behind her out of nowhere. It was a clone!</p><br/><p>Everything happened too quickly. When she regained her senses, Xue Yi was already slashing his weapon at her. She could even see the cold light reflected by his blade, along with the burst of overwhelming and dark aura behind him.</p><br/><p>Zhu Yao’s heart shook and immediately shouted. “Yue Ying!” Stop!</p><br/><p>In the next moment, a lightning phoenix charged out from her body. With its claw, it struck Xue Yi onto the ground and the crackling lightning sparks blasted Xue Yi, as though he was thrown into a steaming hot pot. The dark aura that filled the sky earlier disappeared without a trace. She instantly heaved a sigh of relief. “Lucky!” It was lucky that Yue Ying had retracted his aura. Otherwise, Xue Yi’s soul would have already been scattered by now.</p><br/><p>“Lucky my ass!” Xue Yi could not even move from the pressure emitted by her sword intent, and so he had no choice but to let his mouth run. “What’s so incredible about bullying me with numbers? If you have the guts, let go of this daddy!”</p><br/><p>“If you have the guts, then come fight me one on one? So what if you’re the Lightning Divine Palace!”</p><br/><p>“This daddy isn’t afraid of you lot. This daddy will avenge divine sword maiden.”</p><br/><p>“You lot basically aren’t this daddy’s opponent at all.”</p><br/><p>“If you have the guts, then come at me one by one.”</p><br/><p>His true body and clone happily helped connected each other’s sentences, as though he was not the person responsible for giving up on the one-one-one, and turning it into a sneak attack only to fail and made it a group battle.</p><br/><p>Where’s his shame?</p><br/><p>The corner of Zhu Yao’s lips twitched. Willing her mind, the claw of the lightning phoenix gripped tighter and scattered the clone, turning into two wisps of smoke that returned to Xue Yi’s body. Though he was considerably smart. He knew that he could not defeat Yu Jin and her master, and so she was his target from the start. He had placed a cloning art here from the very beginning, and was simply waiting for her master to leave her side before initiating the attack.</p><br/><p>However, he most likely did not expect that she would react so quickly and summon her sword intent!</p><br/><p>Zhu Yao could not help but turn around and glance at the figure that was two to three steps away from her. Taking a deep breath, she turned her head back.</p><br/><p>Xue Yi could no longer move, and Zhu Yao thus immediately pulled out her “former avatar” from his hands. As expected, the percentage on the sword had already turned to 90%. Just earlier, she instantly leapt from the cultivation level of a Gold Deity to that of a Heavy Deity.</p><br/><p>“What are you doing?” Xue Yi grew anxious, yet he could not move at all. “Return me my divine sword maiden.”</p><br/><p>Zhu Yao rolled her eyes, and then he knocked his head with the sword. “Are you blind!? Can’t you let me talk for a moment? Look carefully. I’m this sword.”</p><br/><p>“Ah?” What did she mean? Xue Yi was confused. “You’re… divine sword maiden?”</p><br/><p>“Mn.” She nodded. “I’ve already turned back into a human.”</p><br/><p>“Don’t you think about lying to me.” Xue Yi instantly grew agitated as he looked at her scornfully. “Hmph, how could my divine sword maiden possibly look like you? She definitely has a graceful figure, peerless beauty, a set of healthy thighs and powerful arms, and also a sincere heart that’s filled with infatuation for me. She can also be wrapped around with me till the end of the world…”</p><br/><p>Hey, your morals are gone!</p><br/><p>“I don’t care if you believe it or not. In any case, I am this sword.” Zhu Yao could not be bothered with him any longer, as she turned around and walked away.</p><br/><p>“Hey, don’t go. Return me my sword!” He still persisted.</p><br/><p>Zhu Yao glanced at the 95% count on the sword. She tried to use divine energy as a guide, and as expected, a large amount of energy was pouring into her body. This speed was comparable to dropping off bluetooth and connecting to a LAN port directly for data to be directly retrieved. The number on the sword also increased from 95%, to 96%… to 97%… to 98%…</p><br/><p>Oh right, at the very end, this string of text flashed. MIssion Complete!</p><br/><p>Zhu Yao immediately rose into a High Deity.</p><br/><p>The sword was letting out crackling sounds as it began to shatter.</p><br/><p>“Divine sword maiden…” Xue Yi’s face was filled with sadness. It was unknown where his strength came from as he suddenly charged right out and snatched the sword in her hand. “Return her to me!”</p><br/><p>“Wait a minute.” Don’t move!</p><br/><p>Zhu Yao could not stop him in time, yet when Xue Yi touched the sword, he was fiercely deflected away with an incredible force. Xue Yi instantly fainted.</p><br/><p>At this moment, the blade that was initially about to shatter suddenly shone a bright red.</p><br/><p>Yu Yan realized something was amiss as well and his expression sank. Just when he wanted to step forward, he realized that he could not move at all, and this was the same for Yu Jin. The two of them were rooted to the ground. “Yu Yao!”</p><br/><p>Zhu Yao did not know what was going on either, but the sword in her hand began to peel itself layer by layer. The blade that was initially as wide as her palm was now as thin as her finger. The sword flashed with a bloody red glow while endlessly reverberating a sharp noise.</p><br/><p>All of a sudden, the depths of her heart began to resonate with it, as though her heart was following the beat of the reverberations. The sword intent that she had yet to retract earlier charged upwards, slicing through the skies with a long cry. After circling around the sky, it suddenly entered the sword in her hand.</p><br/><p>In the next instant, the sword left her hand as it turned into a red ray of light and entered her forehead. The irresistible suppressive force in the surroundings then disappeared without a trace.</p><br/><p>“Yu Yao…” Yu Yan pulled his disciple over and checked her body. The incident earlier was too strange. He was actually unable to resist that light himself, and he could not help but feel a little anxious. “How do you feel?”</p><br/><p>“Master, I’m fine…” Zhu Yao was confused herself as well. “But… in my divine sense… there seems to be sword in it now.”</p><br/><p>Yu Yan was stunned, frowning. “Life Artifact!”</p><br/><p>“Life Artifact?” Is it the same as master’s divine artifact? As she exerted her will, a red light suddenly flashed and an entirely red sword appeared in her hand. Different from the other weapons she had wielded before, it felt like it was in sync with her mind and was a part of her body,</p><br/><p>“Eh? Why can’t I sense the rank of this weapon?” Yu Jin walked over with curious eyes. He looked at his little little grand disciple’s red sword, and he grew even more puzzled. The sword was actually not emitting any aura, as though it did not exist. Yet, it faintly carried an indescribable pressure, that made it hard for people… to look straight at it!?</p><br/><p>Yu Yan said with a sunken voice. “This sword is neither spiritual, divine, nor a godly artifact…”</p><br/><p>“Then what is it?” Her former avatar twirled around and turned into her Life Artifact. Just this incident alone was already profound and mystical on its own. Why was there a need for things to be this complicated?</p><br/><p>Yu Yan exchanged glances with Yu Jin, and they both shook their heads. They did not know either.</p><br/><p>“Little little grand disciple, finding a Life Artifact is already impressively fortunate event.” Yu Jin smiled as he reached out his hand in an attempt to stroke her head, while giving her a few consoling words. However, he received a “cold glare” attack from the side. Left with no choice, he weakly retracted his hand. “Don’t worry, this sword is now in sync with your mind and heart. It can only be of aid to your cultivation.” Though she was already a High Deity now.</p><br/><p>“Really now?” Zhu Yao felt at ease. Actually, she long wanted a weapon of her own. Those days without a single transportation tool was incredibly tiring, you know? Furthermore, this was her Life Artifact, and it would be stored in her divine sense in the future. Even if she were to change avatars, it would be binded to her. The thought of not needing to hitchhike any longer made her a little excited. Though, the colour of the sword was a little strange, the blade itself was a little small, its properties were a little unclear, and even though the two words on the blade were a little ugly…</p><br/><p>Wait a minute!</p><br/><p>Words?</p><br/><p>Zhu Yao looked at it carefully. At the center of the blade, two bolded arial-font words were written on it – Installed Patch!</p><br/><p>…</p><br/><p>Her smile stiffened, and her expression instantly darkened. She pushed out her hand and threw the sword on the ground. As though she was venting her anger, she stomped her feet strongly on the ground. Then, she turned around and entered the house.</p><br/><p>Realmspirit, I will cuss at your granddaddy!</p><br/><p>———————————————</p><br/><p>Xue Yi woke up after being unconscious for three days. No matter what Zhu Yao said, he did not believe that she was that sword. Zhu Yao could not be bothered to explain anymore either. Initially, she wanted to release him out of Lightning Divine Palace as he wished, but great great grandmaster Yu Jin’s Disciplinary Order unexpected shone again.</p><br/><p>The one who sought for help was once again the Gold Deity that wanted to kill Xue Yi. Furthermore, he was not the only one this time. The entire Divine Realm was now looking for Xue Yi. Xue Yi’s initial plan was to take the divine sword and flee this place, but now, Lightning Divine Palace had unexpectedly become his safe haven.</p><br/><p>“Little little grand disciple, what do you think we should do?” Yu Jin smiled as he shook the glowing Disciplinary Order in his hand. Ever since he accidentally got teleported back then, he altered all of the Disciplinary Orders and implemented the manual teleportation mode.</p><br/><p>Zhu Yao sank into silence for a moment, before she solemnly said. “Let him out of Lightning Divine Palace.”</p><br/><p>Yu Jin was stunned and found it a little strange. “I thought… you would want to protect him.”</p><br/>\n</div>"}