{"title": "Chapter 351: Floor Master’s Dignity Recovery Plan", "id": 351, "volume": 4, "url": "http://boxnovel.org/my-disciple-died-yet-again-chapter-351-floor-master%E2%80%99s-dignity-recovery-plan", "volume_title": "Volume 4", "body": "<h1>Chapter 351: Floor Master’s Dignity Recovery Plan</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 351: Floor Master’s Dignity Recovery Plan</p><br/><p>Yu Jin sounded calm, but his heart felt as it had been scratched by a cat. He didn’t know how his little little grand disciple ended up in this person’s hands. He somehow managed to force him into a place like this where no one else was around. Hurry and return my little little grand disciple, so that I can at least negotiate terms with Little Yanyan!</p><br/><p>“What!?” Xue Yi was instantly enraged after hearing this. “You’re telling me to give divine sword maiden to you? In your dreams! I finally managed to find a female type, and she’s the partner that I’ve decided on! We love each other and will never be apart! You want us to separate? You will have to kill us!”</p><br/><p>“Partner!?” Yu Jin was stunned. He silently turned to look at the sword. Little little grand disciple, do you still remember Little Yanyan of Lake of Great Splendour?</p><br/><p>“The hell, who’s your partner!? Speak clearly.” Zhu Yao grew anxious. “Can you please cure your delusions?”</p><br/><p>“Divine sword maiden, don’t worry.” His automatic word shielding ability once again activated, and with affection and no regrets, he said. “At this moment, I finally recognized my true feelings. I won’t allow him to harm you even the slightest bit. We will be together forever.”</p><br/><p>“Together my ass. Who wants to be with you?” Zhu Yao wanted to zap him herself now. “Don’t mind me, please zap him to death. Immediately. Right now.”</p><br/><p>“Divine sword maiden…” Xue Yi was however moved, and he was this close to crying tears from joy. “You actually want to elope with me!”</p><br/><p>Zhu Yao: “…” Heartaches always occur so suddenly.</p><br/><p>Yu Jin: “…” (⊙▽⊙) Little little grand disciple actually has a change of heart.</p><br/><p>Xue Yi sniffled, and then his expression turned cold. In an instant, he resolutely stared at Yu Jin and said. “Come with all your might! We will never separate!”</p><br/><p>“Don’t say things that will cause others to misunderstand, hey!” I want to die so much. Oh my master who’s in the faraway Mars, please come and save this disciple’s morals.</p><br/><p>“As you wish.” The lightning clouds in the sky gathered once more.</p><br/><p>“Hey, wait a minute!” Are they really going to fight? “Please let me finish what I have to say!”</p><br/><p>Unfortunately, no one listened to her, as the two began to fight once more in the sky, as though they were addicted to fighting. It was evident that Xue Yi was on the disadvantageous side, while Yu Jin seemed to be toying with him. His only goal was to snatch Zhu Yao back from Xue Yi’s hands.</p><br/><p>Xue Yi saw that he was unable to beat him and suddenly cast an art. He sliced his palm and drew a blood formation. Zhu Yao’s entire blade suddenly began to shine with a white light. Large amount of divine energy entered her body as she slowly rose into the air.</p><br/><p>Zhu Yao’s heart clenched. “What are you trying to do?” She suddenly had a bad premonition.</p><br/><p>“Divine sword maiden, I will take you in as my Life Artifact. We will have the power to fight him that way.”</p><br/><p>“What? Life Artifact!” A portable summoned beast?</p><br/><p>After binding her to my life, maiden will then be able to appear in my divine sense. Our feelings will bloom after a long period of time, and we will then get married and give birth to monkeys. Just thinking about it makes me a little excited!</p><br/><p>“Excited, my ass!” Please don’t speak out your inner thoughts at a moment like this. “Wait, no! I don’t want to become your Life Artifact, stop!”</p><br/><p>Her rejection was instantly ignored by a certain someone.</p><br/><p>“Little little grand disciple!” Yu Jin was stunned as well. He saw through Xue Yi’s plans as well and his expression instantly changed. If he allowed Xue Yi to succeed, then it would spell trouble. If Little Yanyan’s wife gets binded to someone else? I will definitely be burnt to ashes, right!? At that moment, he regretted wasting so much time earlier.</p><br/><p>He immediately summoned tribulation lightning bolts in an attempt to stop him. However, it was already too late. The formation was about to be completed, Zhu Yao was about to turn into a ray of white light and enter Xue Yi’s forehead.</p><br/><p>A white bolt of light suddenly tore through the sky and blew across Xue Yi’s forehead, instantly interrupting the cast of the art. Xue Yi simply felt an immense might directly assaulting the center of his forehead and his divine sense was in intense pain. It was as though someone had sliced him apart alive. No longer able to maintain his stance, he knelt with one knee on the ground.</p><br/><p>He unconsciously searched for Zhu Yao and when he raised his head, he saw another person in the sky. With an upright posture in the air, he wore a white robe and had an ice-cold look on his face. In his hand was that second rank divine sword.</p><br/><p>“Masteerr…” Zhu Yao was about to cry. Oh my loved one, you’re finally here!</p><br/><p>Yu Yan glanced at the sword in his hand and ascertained that it was his stupid disciple. He then looked at the person who was half-kneeling on the ground and recalled that scene earlier. In an instant, a chilling aura filled the place. The air seemed to have fallen to extremely cold temperatures, as every word he spoke felt like it create ice out of thin air. “You actually want to take her into your divine sense!?”</p><br/><p>Yu Yan had never felt as furious like right now, as he felt like he could decimate the earth and destroy the sky at any moment. He had searched for so long, had ended up empty-handed so many times, and even right before this, he was just about to flip the entire ocean over. When he finally managed to find his stupid disciple, he discovered that she was just about to be taken into someone else’s divine sense and become his Life Artifact.</p><br/><p>A Life Artifact was linked to the divine sense, and the moment the bind was formed, it could never be removed. They would be linked forever. He hadn’t done it himself, yet this brat that came out of nowhere actually dared to touch his disciple! At that moment, the pressure in the air alone seemingly felt like it could suffocate people to death.</p><br/><p>Xue Yi was receiving a rebound from the failure of his art in the first place, and now, he was this close to lying flat on the ground. Though it was said that a difference in level could suppress one to death, he had never seen something this terrifying. Unable to sustain any longer, his vision darkened. He had gorgeously fainted.</p><br/><p>“Uh… Little Yanyan.” Yu Jin could not help but call out. If this were to go on any longer, that person would be pressed onto the ground to death. “Umm… Calm down.”</p><br/><p>Yu Yan turned to look at him, the ice shards in his eyes changing their target.</p><br/><p>“Uh…” Yu Jin silently took a step back, and then another step back. Little Yanyan looks so scary, even my little heart is shivering. “As you were. I didn’t say anything.” He immediately retracted his statement.</p><br/><p>He suddenly felt that the Little Yuyan that he competed with above the Lightning Divine Palace back then, when compared to right now, was as gentle as a light drizzle.</p><br/><p>“Master…” Zhu Yao called out in time. Though Xue Yi wanted to take her in as his Life Artifact, his initial goal was to save her. Otherwise, he wouldn’t have chosen a second rank divine sword as his Life Artifact. “Let us return.”</p><br/><p>Only then did Yu Yan turn to look at the sword in his hand. He retracted the chilling aura, and then, gave Yu Jin a ‘I will settle scores with you later’ look, before making his way back to Lightning Divine Palace with his disciple. After such a long search, he finally found her. He had to hurry and return his disciple’s soul back to her body, otherwise, there would always be bastards wanting to snatch his disciple away!</p><br/><p>Yu Jin was thus left behind. Lowering his head, he looked at the living corpse on the ground and helplessly sighed. He grabbed him up and then followed after them. Looking at the faraway figure, Yu Jin felt a little sour in his heart. Why did he feel that his status as a mighty Lightning Divine Palace Floor Master, was falling lower and lower with each passing day?</p><br/><p>He pondered for a moment. When did this situation begin? Mn. Back then when Little Yanyan just ascended, though he was still as cold, at the very least, he was a good child who respected his elders. However, ever since his disciple appeared, he grew even more terrifying. Every single day, he would pull out his sword at a moment’s notice! Especially after that, when he requested instructions from that disobedient grand disciple and decided to marry little little grand disciple, Yu Jin’s dignity as a Floor Master had completely turned into mush.</p><br/><p>So, the conclusion was because of some unspoken rules with his disciple?</p><br/><p>Mn… Maybe, I should consider taking in a female disciple or something? Then, I can logically escape being single, and maybe I can raise my social status a little too!</p><br/><p>The longer he thought about it, the more he felt that it all made sense. He felt that he had just found the key to the recovery of his dignity. Now… the only problem he had was to find out where he could find an obedient female disciple that he could take in.</p><br/>\n</div>"}