{"title": "Chapter 377: The Truth Behind the Final Floor", "id": 377, "volume": 4, "url": "http://boxnovel.org/my-disciple-died-yet-again-chapter-377-the-truth-behind-the-final-floor", "volume_title": "Volume 4", "body": "<h1>Chapter 377: The Truth Behind the Final Floor</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 377: The Truth Behind the Final Floor</p><br/><p>Zhu Yao felt a large wave of cold winds charging towards her, and it was both quick and hurried. She hurriedly swung her sword to deflect them, slashing apart the gathering shadows. However, she was not able to dodge all of them either. After slashing apart the ones at the front, the ones at the back came charging forward as well. The first few swings were still fine, but slowly, her strength began to dwindle. After scattering a few shadows, an ominous wind came charging towards her back. She instinctively shifted to the side, but she was still a step too late. An aching pain spread from her arm as something had pierced into it. It was as if something was trying to slice off a piece of her flesh.</p><br/><p>When she turned to look, she saw a shadow was biting deeply into her arm, and her hand was already drenched in fresh blood. That figure merely revealed half of its face, but his appearance could be vaguely seen, and Zhu Yao was stunned after seeing it.</p><br/><p>“Big sis!” Yue Ying was startled, hurriedly walking over.</p><br/><p>Zhu Yao gritted her teeth as she passed her sword to her other hand and scattered the shadow. However, the bite was so deep, her bones could already be seen. This bite could not be compared to any of the injuries she suffered in the past, but back then, she still had her cultivation no matter how severe her injuries were, so she would have still been able to hold on even if she was bitten. Presently, with how her divine energy was suppressed, this pain clearly hurt even more. She could barely feel her own hand now.</p><br/><p>“Big sis!” Yue Ying was a little flustered, as he hurriedly helped stop her blood from flowing out. Something seemed to be burning with his eyes.</p><br/><p>“Yu Yao.” Yu Yan’s face clearly looked a little anxious as well, but he was being surrounded by a large number of shadows and could not push his way through.</p><br/><p>“I’m fine.” Zhu Yao solemnly said. “Don’t lose focus.” This wasn’t the time to be worried about such things.</p><br/><p>Zhu Yao’s right arm was injured, and at this moment, she couldn’t even hold her sword properly. However, she had no choice but to stand up again. The hell, you’re bullying me because I’m not a leftie, right?</p><br/><p>But it really hurts! She was basically using her own flesh and body to block attacks.</p><br/><p>Most likely because of the stimulation from her blood, those shadows grew even wilder. Their terrifying screams grew sharper, causing one’s skin to crawl. They seemed to be waiting for something, as they circled around their surroundings. Then, they once again attacked her from her back.</p><br/><p>Zhu Yao had no choice but to shift to the side and hold up her sword again. With this action of hers, her blood began to pour out once more. Just as she was about to be submerged by an overwhelming amount of shadows, Yue Ying suddenly grabbed onto her hand, and his eyes instantly turned crimson red.</p><br/><p>“Scram!”</p><br/><p>In an instant, a dark aura that was even thicker that the shadows’ was emitted out from his body, instantly devouring those shadows. The shadows revealed flustered looks, and the situation instantly flipped around. The shadows that were still anxiously targeting them before were now fleeing in all directions.</p><br/><p>In just a few seconds, the area suddenly quietened down.</p><br/><p>There was no longer any shadows in the air, but they were replaced by a devillic aura that was even colder and more terrifying than those shadows. Yue Ying was enveloped within the devillic aura, and what remained was a pair of crimson-red eyes filled with anger. The light coming from his eyes were enough to send cold shivers down everyone’s spines.</p><br/><p>Zhu Yao instantly calmed down and grabbed him with her other hand, desperately ignoring the devillic aura that was making her tremble. With a solemn voice, she said. “Yue Ying, I’m fine now! Everyone is fine now.”</p><br/><p>Only then did the anger in his eyes slowly extinguish, reverting back to their former clarity. The surrounding devillic aura then slowly began to return into his body as well, till they completely disappear. He lowered his head and looked at her hand which was dripping with blood. “Big sis…”</p><br/><p>“I’m fine.” Zhu Yao smiled at him. “Thank you.” She never expected that even though these shadows were fierce, they could not match against devillic aura. It was no wonder Yue Ying was unmoving earlier. It wasn’t because he was in a daze, rather, the shadows must have realized the aura emitted from his body and did not dare to approach him.</p><br/><p>“Devillic aura!” Zhonggu Lu looked over with a stunned expression. “Could… Could you actually be…”</p><br/><p>Even Nangong Cheng’s face changed as well.</p><br/><p>Zhu Yao sighed. It seemed like they couldn’t hide it any longer. “That’s right, Yue Ying is of the Devil race. The shadows earlier were chased away by him as well. What are you two planning to do?”</p><br/><p>Zhonggu Lu and Nangong Cheng were stunned for a moment.</p><br/><p>“No wonder… No wonder he’s the only one who can still use mystic arts.” Zhonggu Lu muttered. They were unable to circulate divine energy, but devillic energy was not restricted.</p><br/><p>Nangong Cheng looked at Zhu Yao, and finally let out a sigh. “So that’s the case. Da… Daoist Yue, thank you very much. With that many shadows, I thought we were dead for sure!”</p><br/><p>“Isn’t your stupidity at fault here? Otherwise, why would we have encountered so much trouble?” Zhonggu Lu retorted.</p><br/><p>“The hell, can you blame me for that? It’s because that Mei Xue is too treacherous, alright?”</p><br/><p>Zhonggu Lu immediately rolled his eyes.</p><br/><p>It seemed like they were intentionally ignoring the fact that Yue Ying was a Devil. After all, everyone had come a long way together, and it would be best that a conflict wouldn’t occur.</p><br/><p>Zhu Yao heaved a sigh of relief, when a her right hand was suddenly held by someone. She could not help but let out a cold gasp. “Szz…”</p><br/><p>“Don’t move.” A certain master glared at her unhappily, as he began to roll a white cloth around her injured arm.</p><br/><p>“I’m fine, master. The blood has already stopped flowing. It will be fine in about an hour.” After all, she still had a divine physique, such injuries would heal really quickly.</p><br/><p>His eyes narrowed. “Mn?”</p><br/><p>“Uh… Wrap it, wrap it then!” Wuuuu, master is angry at me again.</p><br/><p>————————————————</p><br/><p>They did not stay around, instead, they took the opportunity when the shadows were scattered and hurriedly pressed forward towards their goal. Initially, they thought that they would at least encounter another two or three waves. Strangely however, they had rushed for two days straight, but not a single shadow came attacked them again.</p><br/><p>Even if there were occasional misty shadows floating past, they completely ignored Zhu Yao’s group and simply floated away after swaying about a few times. Zhu Yao thought that this was due to fear of Yue Ying’s devillic energy, or there was simply too little shadows in their present surroundings. However, Yue Ying had clearly retracted his devillic energy and was not leaking out even the littlest bit. Furthermore, the sharp and terrifying screams in the air did not lessen that much either.</p><br/><p>Zhu Yao’s heart began to sink, as the guess she had continued to grow clearer. On the third day, they finally walked out of the sinister and terrifying territory, and they instantly saw the light in front of them. It was as if they had suddenly walked out of the darkness and into the light, as the sinister air was completely swept away, and what replaced it was a lush green forest.</p><br/><p>“Great, we finally got out.” Nangong Cheng said with joy. “We no longer have to be harrassed by those shadows. We’re safe now.”</p><br/><p>“That might not be the case!” Zhu Yao clenched her fists, her worry grew heavier.</p><br/><p>Nangong Cheng was stunned as he turned to look at her. “Dongfang girly, just relax. Look at this place, it’s completely bright. Those shadows definitely won’t come here. As long as we cross this forest, we will be able to reach the light that guides us to the realm of Gods. We are no longer in any sort of danger.”</p><br/><p>Zhu Yao turned to look at the darkness behind her, and then once again glanced at the greenery before them, frowning. “Do you guys know… what those shadows are?”</p><br/><p>Nangong Cheng was startled. “What else can they be?”</p><br/><p>“Sinister and ominous, undestroyable, being able to resurrect indefinitely, and carrying such immense hatred. With such characteristics, I can only think of a single thing.”</p><br/><p>Yu Yan frowned and coldly said. “Resentment!”</p><br/><p>The group was stunned. Zhonggu Lu stepped forward. “How is that possible? Isn’t resentment something that only exists in the Netherworld? Why would it appear in the Lightning Divine Tower? And on the final floor on the road to ascending into Gods nonetheless!”</p><br/><p>“I’ve once visited the River of Forgetfulness in the Netherworld.” To be exact, she met the River of Forgetfulness himself. “The River of Forgetfulness is the only thing that bridges the Three Realms, and it flows throughout every corner of the Three Realms, guiding those depressed souls back to the Netherworld and sending them to their reincarnations. Since the River of Forgetfulness can be found in all of the Three Thousand Worlds, then it can naturally be found in the Divine Realm as well.”</p><br/><p>Nangong Cheng grew even more confused. “What does these shadows have to do with the River of Forgetfulness?”</p><br/><p>“All of the resentment of the Netherworld is being concealed in the depths of the River of Forgetfulness.” Yu Yan continued with a solemn voice.</p><br/><p>“You’re saying, the River of Forgetfulness brought resentment into the Lightning Divine Tower?” Zhonggu Lu frowned. “However, even if those shadows are resentment, since we’re already here, they wouldn’t chase after us, right? Furthermore, after those resentment were chased away by Daoist Yue, they no longer appeared again. What does this have to do with the danger that you speak of?”</p><br/><p>“Have neither of you felt anything strange about those shadows?”</p><br/><p>The group exchanged glances, and even Yu Yan was confused as well.</p><br/><p>“Master, I want to ask you something. In the Lower Realm, have you met someone that looks exactly the same as Sect Master Zi Mo?”</p><br/><p>Yu Yan was stunned for a moment. As someone who was face-blind, Zi Mo’s face was one of few that he remembered. After pondering deeply for a while, as though he had thought of something, he solemnly said. “There was a heretic practitioner who deeply specialized in the arts of transformation, and he was even capable of changing his aura. He once turned into Zi Mo’s appearance and infiltrated my Ancient Hill Sect. He was then exposed by me.”</p><br/><p>“After that?”</p><br/><p>“Naturally, he was killed.”</p><br/><p>“Did master personally do it?”</p><br/><p>“Mn.”</p><br/><p>“As expected!” Zhu Yao sighed, and instantly a sense of powerlessness overwhelmed her.</p><br/><p>“Dongfang girly, just what are you trying to get with those words of yours?” Nangong Cheng anxiously asked.</p><br/><p>Zhu Yao turned to look at the four of them. “Did you all notice the appearances of the shadows formed by resentment?”</p><br/><p>The group: “…”</p><br/><p>“I saw them…” Zhu Yao solemnly said. “I saw a shadow that looked exactly the same as Zi Mo. That shadow was attacking my master. I even saw…” She turned to look at Yue Ying. “Xu Nuoyan! And he was attacking Yue Ying.”</p><br/><p>Her master and Yue Ying instantly widened their eyes. As though they had realized something, their faces instantly turned complicated.</p><br/><p>“Just what do you mean?” Nangong Cheng was anxious. “And who is this Xu Nuoyan?”</p><br/><p>“It doesn’t matter who he is.” Zhu Yao shook her head. “The important thing is, who they were killed by!”</p><br/><p>Zhonggu Lu’s expression changed. “You… You’re saying, those resentment are formed by the people that we’ve once killed? And that is why they were desperately attacking us?”</p><br/><p>“I wasn’t certain in the beginning. However, have you all thought about why no other shadows attacked us again after those resentment were chased away by the devillic aura back then?” Zhu Yao analysed. “Because the other resentment aren’t looking for us! They would only look for their creditors.”</p><br/><p>This was also why at the very beginning, those resentment only attacked the four of them and completely avoided her. Because she had never taken a single human life, so naturally, there did not exist any so-called resentment seeking her for revenge. After that, she took the initiative to attack them, and only then were they lured over.</p><br/><p>“Why would the River of Forgetfulness simply send these resentment into the Lightning Divine Tower? Also, after being filled by resentment for so many years, why hasn’t there been any signs of the Lightning Divine Tower collapsing?” Zhu Yao’s expression grew heavier. “If my guess is correct, the final test of this Lightning Divine Tower is actually a tribulation, a tribulation of karma! From the many deeds that we’d planted back then, we will receive the corresponding karma. Most likely, from everything that a practitioner has done in the past, everything would be returned on this very floor.”</p><br/><p>“If that’s the case… Do you guys still feel that the place before us is really safe?”</p><br/><p>“…” Everyone’s faces instantly paled.</p><br/>\n</div>"}