{"title": "Afterword", "id": 395, "volume": 4, "url": "http://boxnovel.org/my-disciple-died-yet-again-afterword", "volume_title": "Volume 4", "body": "<h1>Afterword</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Afterword</p><br/><p>Hi everyone! It’s been a long time since I started the series. According to my old blog, the first chapter of My Disciple Died Yet Again was posted on October 19, 2015. So it’s been close to 3 years since I began. Though there has been many hiatuses here and there, I am glad that there are still many of you who managed to stick around for the entire journey. I really thank you all from the bottom of my heart! Strangely, I was most active while I was still in the army, and instead of an actual laptop or keyboard, I was typing away on this portable bluetooth microsoft keyboard while connected to Google Drive through my phone. This tells you how bored I was in there. Ohohoho.</p><br/><p>Disciple isn’t the first series that I started on, but it’s the first series that I completed. There are definitely several issues that I could have addressed if I paid more attention, such as term consistency. I don’t exactly have a full-blown glossary, because I’m lazy to make one. Huhu. Some of you have also sent me PMs wanting to edit for me in the past, but I declined, largely because I really wanted to try finishing something alone, and also I’m almost doing this for free, so I would feel bad if you edit for me and not get anything.</p><br/><p>But yes, completing this translation project wouldn’t have been possible without the help I received from my fellow friends over at the translators’ discord, and also my real-life friends who supported me! I would like to especially give thanks to Solistia for adopting me into her web hosting server! There hasn’t been a single downtime (I think?) ever since I moved over!</p><br/><p>I would like to also extend my thanks to all the donors who donated to me! They really helped out a lot in funding my coffee breaks! I will be updating the donor page soon with all your names, so please let me know if you want to stay anonymous or anything!</p><br/><p>Lastly, I would like to thank all of you readers out there that stayed with me throughout this journey! Really! Every single one of you has been really supportive and friendly, and it’s not an exaggeration to say that you guys are the reason why I continue to translate. I really appreciate all of you for pointing out the mistakes in the comments whenever you see them too! Though I try to make sure my grammar and everything is flawless, I would still make some mistakes every now and then. So really, thank you all!</p><br/><p>Well, with that, this concludes my afterword for the series. Hope to see you all in the next series I do(?)~</p><br/>\n</div>"}