{"title": "Chapter 13", "id": 13, "volume": 1, "url": "http://boxnovel.org/its-not-easy-being-your-love-rivals-big-brother-chapter-13", "volume_title": "Volume 1", "body": "<h1>Chapter 13</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Translator: Mosstree</p><br/><p><strong>Chapter 13: \"Special\" in Little Brother's Eyes</strong></p><br/><p>“Your guts has gotten larger and larger. Since you’ve come, don’t think about leaving.”</p><br/><p>The captured Wei Han suffered a huge loss, and to summed up the experience: he knew that he couldn’t resist at this time, that too much resistance would only lead to more suffering, and so had to follow Qi Zhifan’s intention.</p><br/><p>Wei Han’s lips wriggled a few times and squeezed out a smile: “Good little brother, you can not let me go, but are you sure we’re going to keep…uh, this position until dawn?”</p><br/><p>Qi Zhifan, who was pressing on Wei Han, not only didn’t move away his body, but pressed closer, his warm breath puffed on Wei Han’s face: “What if I say ‘yes’?”</p><br/><p>“……” Wei Han was silly. Sometimes, he really couldn’t guess Qi Zhifan’s thoughts.</p><br/><p>After twisting his neck and adjusting to a more comfortable posture, Wei Han simply let the broken jar fall and shatter: “Then, I don’t care anymore. Anyway, I have to go to school tomorrow. If I want to sleep, I’m the type that can fall asleep in three seconds.”</p><br/><p>Qi Zhifan was dubious and didn’t speak.</p><br/><p>At this moment, if it was someone else, they definitely couldn’t wait to be pressed down by Qi Zhifan, because that was the wet dream that they’d daydreamed about everyday! If not, then wouldn’t they still blush and be flustered, their small hearts jumping with a ‘<em>thump thump</em>‘?</p><br/><p>Unfortunately, the reaction that a normal person should have, Wei Han completely didn’t have.</p><br/><p>Closing his eyes, he’d already fallen asleep. He felt that Qi Zhifan was no different than a big stone. If one absolutely must find a point of difference, then he talks more than a stone, was more dislikable than a stone, but was also hotter than the average stone.</p><br/><p>Qi Zhifan’s body temperature was indeed hotter than usual, no kidding, he was now pressing down on Wei Han!</p><br/><p>What the hell was this guy doing? Kept making a fool of himself and courting disaster, was he trying to get his attention? But it doesn’t look too much like it.</p><br/><p>Qi Zhifan’s deep eyes were brewing with turbulent waves. Staring at Wei Han’s sleeping face for a long time, his hand unwittingly reached up and pinched the face. Sure plump enough, very soft.</p><br/><p>Then is his lips also soft? Also gently tapping on Wei Han’s lips with his fingertips, Qi Zhifan suddenly as though electrified, quickly withdrew his hand. But his face drew closer again. He wanted to try biting a mouthful.</p><br/><p>Suddenly, Wei Han’s snore blasted out!</p><br/><p>Qi Zhifan: “……”</p><br/><p>Can this person’s nerves be any bit thicker?</p><br/><p>In this kind of situation, he actually didn’t even have any sense of crisis! What if he did something to him?</p><br/><p>Did Wei Han really treat him as his own little brother, so trusted him so much? Or was he completely uninterested in him and regarded him as air?</p><br/><p>Qi Zhifan’s mood was very conflicted, now feeling happy, now choking on a bellyful of anger again.</p><br/><p>In the end, Qi Zhifan let go of Wei Han, covered him with a blanket, then rolled over and slept on the other side of the bed.</p><br/><p>The next morning, Qi Zhifan sported two big, dark circles and left the room. Not mentioning being disturbed by Wei Han’s snoring all night, but halfway through the night, he was also kicked out of the bed once. That was enough!</p><br/><p>So when eating breakfast, Wei Han felt that Qi Zhifan had been using eye-daggers to viciously slice him countless times.</p><br/><p>Wei Han also knew he’d been a bit unfair towards him, scratched his head, and prepared a seaweed roll to give to him for breakfast.</p><br/><p>Today, because Jiang Chengrui was going to go to his little brother’s primary school for a parent-teacher conference, Wei Han took the initiative to help him deliver takeout to Chengyu Film Academy.</p><br/><p>On hearing the name of the school, Wei Han thought of Lu Yan, don’t know, maybe he could run into him later?</p><br/><p>In the afternoon, Wei Han rode a bicycle on Chengyu school campus and finished delivering the takeouts one by one. Then, he really did see Lu Yan from afar, as well as Qi Zhifan beside him.</p><br/><p>Ah, this was a coincidence: Qi Zhifan also came here to find his little boyfriend.</p><br/><p>Seeing the two people walk into a certain art building, Wei Han, out of curiosity, also followed up and went to the music classroom before he stopped.</p><br/><p>Wei Han softly pushed the door ajar. Qi Zhifan was sitting in front of the piano, his long lashes sweeping a beautiful arc under his eyes, and a series of melodious notes also flowed from his fingertips.</p><br/><p>The sound of the piano was sometimes flowing and soothing, like the mountain streams flowing slowly; sometimes rushing like the water of the Yangtze River, powerful and magnificent. Each note jumped with its own dynamics: played to the sorrowful part, it left lingering emotions; played to the joyous part, it was warm and pleasing.</p><div><div></div></div><br/><p>The sound of the piano tapered off, and the song ended.</p><br/><p>For a moment, both Wei Han and Qi Zhifan looked intoxicated, a bit wishing it’d continue. After a good while, Lu Yan clapped his hands.</p><br/><p>Wei Han couldn’t help but sigh with emotion. If he had a few of such awesome talents, there would certainly also be a bunch of people who’d prostrate themselves under his jeans.</p><br/><p>But at this time, Qi Zhifan apparently found the dazed Wei Han in the doorway.</p><br/><p>Qi Zhifan stared at him quite uncomfortably, “you followed me again” clearly written on his face.</p><br/><p>Wei Han unknowingly read and understood, hurriedly shook his head and explained in a rush, “I didn’t follow you. This time was really a chance encounter! I happened to be helping a classmate to deliver takeout, so I came here.”</p><br/><p>Hearing the voice, Lu Yan looked back and also saw Wei Han.</p><br/><p>“Delivering takeout to a music classroom?” Qi Zhifan cross-examined.</p><br/><p>“I would also like to come in and play the piano, can’t I? Or only you’re allowed to play?” These words, Wei Han mind hadn’t filtered before his mouth first said it. Once said, he immediately wanted to thrash himself.</p><br/><p>The voice hadn’t fallen when Qi Zhifan eyes flashed, a little not daring to believing.</p><br/><p>Lu Yan’s eyes suddenly lighted up, pleasantly surprised, said, “Brother Wei, turns out you also play the piano. Can you play a song for me? Greensleeves?”</p><br/><p>“……” Wei Han’s expression indicated that he’d be able to play cotton, “Uh, I’m sorry, I can’t really play classical.”</p><br/><p>“It’s okay, popular also works. Like ‘Marriage D’Amour’, ‘Ballade pour Adeline’, or ‘Kiss The Rain’?”</p><br/><p>Help! Spare him, it really was ‘loose tongue causes trouble’.</p><br/><p>Wei Han’s scalp tingled, expression distorted: “…I, I can only play the very base.”</p><br/><p>Finished speaking, he completely threw caution to the wind and played a song on the spot…… ‘Twinkle, Twinkle, Little Star’.</p><br/><p>After playing two verses, not waiting for Qi Zhifan and Lu Yan to react, Wei Han ran out and disappeared in an instant.</p><br/><p>“Zhifan, your older brother can really joke, haha.” Lu Yan patted Qi Zhifan and forced out two laughs.</p><br/><p>Not knowing what demons and god were at work, Qi Zhifan touched the keys: “Very good, quite special.”</p><br/><p>“……” Lu Yan’s three views suffered a blow once again.</p><br/><p>Qi Zhifan also regretted it himself the next second. Was he praising Wei Han?</p><br/><p>His brain must have short-circuited.</p><hr/><br/><p>On the weekend, the very busy Jiang Chengrui had a rare moment when he was free. Wei Han invited him to watch a movie, but Jiang Chengrui was temporarily delayed. Wei Han waited for him for a while, and in the end, Jiang Chengrui came with his little brother.</p><br/><p>“I’m sorry, <b>Silly Han<sup> [1]</sup></b>, I’ve kept you waiting.” Jiang Chengrui wore casual clothes and a casual hat. He personally liked wearing hats.</p><br/><p>“It doesn’t matter,” Wei Han smiled.</p><br/><p>Since the last mobilization meeting ended and after they came out from the auditorium, Jiang Chengrui had begun calling him “Silly Han”, and also looked at him quite strangely.</p><br/><p>Later, Jiang Chengrui kept calling him that, and Wei Han got used to it.</p><br/><p>“It’s all because of this dead little demon pestering me, crying to come out with me,” Jiang Chengrui complained, grabbing the little brother behind him and flicking his forehead.</p><br/><p>Wei Han finally saw clearly Jiang Chengyi, the naughty little brother who Jiang Chengrui kept mentioning all day long. Different from his older brother’s naturally curly, yellow hair, Jiang Chengyi had black, orderly hair, bright and sparkling eyes, and looked very clever.</p><br/><p>Based on what Jiang Chengrui said, Jiang Chengyi was naughtier than any other children, always making trouble everyday. He climbed trees to scoop out bird nests, went to the fields to steal melons, pranked girls skirts in a mischievous manner, and partnered in group scuffles. Basically, he’d done everything, but fortunately, the consequences weren’t serious.</p><br/><p>In recent years, he’d been more docile and far less naughty than before.</p><br/><p>Jiang Chengyi didn’t accept it and coldly snorted, “Hmph, I’ve seen the calendar on your desk before. These two days, you made a note that it’s your days off, so don’t you think of abandoning me and going out to play alone. I won’t obediently stay at home to do homework, either. I’d immediately go look for Purple Sheep.”</p><br/><p>“You dare? Believe it or not, if you provoke me, then you go see him once, I’ll beat you once.” Saying this, Jiang Chengrui hit Jiang Chengyi’s little bottom.</p><br/><p>“<b>Wu-wu<sup> [2]</sup></b>, big brother, you’re too bad and violent. I’m going to tell big sister.”</p><div><div></div></div><br/><p>“You…you’d be the one to complain.”</p><br/><p>Wei Han: “……”</p><br/><p>This bear child, really, seeing was believing.</p><br/><p>And what the hell was a purple sheep? How come he’d never heard of it. It shouldn’t be a creature from a cartoon sheep village, and it probably was children joking with each other and giving each other nicknames and so on.</p><br/><p>“Little Jiang, children naturally want to have fun, you also don’t need to be so strict. Letting him play and make noise with other little partners is also not a big deal,” Wei Han laughed and persuaded.</p><br/><p>“Purple Sheep isn’t a child, he’s a dirty adult!” Jiang Chengrui quickly corrected.</p><br/><p>“……” Wei Han suddenly choked, staring blankly, “Little Jiang, in the end, what is that purple sheep?”</p><br/><p>Jiang Chengrui pinched his eyebrows, a helpless headache: “Ai, Pei Yuyang, that perverted gay.”</p><br/><p>Wei Han: “……”</p><br/><p>Wow, Pei Yuyang, for his family’s pig, was really giving his all, to be entangled for this long.</p><br/><p>“Big brother, you don’t know. Several times recently, <strong>Purple Sheep<sup> [3]</sup></strong> was waiting at the school gate when I was let out of school. He’s foolish and has lots of money, cheating him is fun.” Jiang Chengyi’s big eyes rolled around.</p><br/><p>Jiang Chengrui frowned. “He’s preparing to start from you? Damn it, then have you done what I told you? I told you to ignore him.”</p><br/><p>“Uh-huh, I was super cold.”</p><br/><p>“That’s good.” Jiang Chengrui rubbed Little Yi’s head with satisfaction. “In the future, you’re not allowed to see him, and also not allowed to mention him in front of me, understood?”</p><br/><p>“Oh oh,” Jiang Chengyi nodded his head while muttering softly, “Then I’ll just go behind your back. Anyway, big brother, you wouldn’t see it.”</p><br/><p>Later, Wei Han discussed with Jiang Chengrui, and the two decided to accompany Little Yi to watch an animated movie, and then go to the nearby playground to play.</p><br/><p>There were always more people who came out to play on the weekends. Wei Han lined up to buy the tickets and let Jiang Chengrui take his little brother to find a restaurant and order food first. Then he’d meet up with the two again, have lunch together, and be just in time to watch the movie.</p><br/><p>Wei Han was waiting in line when suddenly, Lu Yan’s voice came from an adjacent line: “Hey, Brother Wei, it’s you ah. How coincidental, we meet again today.”</p><br/><p>“Hehe…”</p><br/><p>Wei Han wryly smiled, yeah, he also wanted to know how it can be so coincidental? He hadn’t yet recovered from the shadow of the last disgrace!</p><br/><p>“Brother Wei, what are you going to see? Romance, comedy or horror?”</p><br/><p>“Pl…Pleasant Sheep and the Big Bad Wolf.” Wei Han felt a little like crying without tears.</p><br/><p>“……” Lu Yan was stupid for a moment and smiled reluctantly, “Uh, this is also quite good, proof that Brother Wei’s childish heart hasn’t vanished.”</p><br/><p>“Right, how come you’re alone? What about Qi Zhifan?” Wei Han quickly changed the topic.</p><br/><p>On hearing his sweetheart’s name, Lu Yan appeared a lot more bashful and lightly laughed, “He’s waiting for me elsewhere. I came to buy the tickets first. Aside from what he eats, Zhifan doesn’t have any special requirements for these things. I plan to watch a romance movie with him.”</p><br/><p>“Don’t watch a romance movie, go watch a horror movie.” Wei Han was hit with an inspiration.</p><br/><p>“Ah? Are you sure Zhifan likes it?” Lu Yan was doubtful in his heart.</p><br/><p>“I’m not sure. Sometimes I can’t guess what he likes, but I want him to like you.” Wei Han looked in Lu Yan’s eyes and said quite sincerely.</p><br/><p>Lu Yan face turned red. “Brother Wei, you’re really good.”</p><br/><p>Wei Han waved his hand. “Oh, it’s nothing. In fact, it’s also for myself. If you can both stay together for a long time, I’d also be alright.”</p><br/><p>For his Chu Chuanyao, Wei Han will certainly try to set them up.</p><br/><p><b>Notes</b></p><ul><li><b>1. Silly Han: </b>(, Èr hán): Literally ‘two’, but also mean stupid or idiot. Little Jiang isn’t being mean; it’s like calling your friend ‘you’re such an idiot’ or the Japanese ‘<i>baka</i>‘. Silly was the closest thing I could come up with.</li><li><b>2. Wu-wu:</b> sound of crying</li><li><strong>3. Purple Sheep: </strong>(, Zǐ yáng yáng): A play on the ‘yang’ in Pei Yuyang’s name.</li></ul><div><div></div></div><br/>\n</div>"}