{"title": "Chapter 20", "id": 20, "volume": 1, "url": "http://boxnovel.org/its-not-easy-being-your-love-rivals-big-brother-chapter-20", "volume_title": "Volume 1", "body": "<h1>Chapter 20</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Translator: Mosstree</p><br/><p><strong>Chapter 20: Meeting Chu Chuanyao Again</strong></p><br/><p>At this moment, the light from Wei Han’s pupils was fixed on Chu Chuanyao’s body, as if everything else around him couldn’t be seen and also couldn’t be heard.</p><br/><p>Chu Chuanyao had minor bruises on his arms and knees, and they had been cleaned and treated. His countenance showed cleverness, and the black and white of his eyes were clearly distinct and also had a natural purity. Wei Han was clear that this was nurtured from an easy and comfortable environment.</p><br/><p>“Little Yao…” Wei Han couldn’t help but call out.</p><br/><p>Chu Chuanyao was obviously taken aback and pointed to himself: “You…are you calling me? Do you know me?”</p><br/><p>“……” Wei Han was instantly startled still, had to restrain his emotions, and wryly smiled, “You were going to report to S Uni today? I’m from the Student Organization Department, and I’ve seen your name and photo in the new student profiles, so I had a little impression.”</p><br/><p>“Oh, so that’s how it is. I’m really sorry! At the time, I was dragging my suitcase and hurried across the street. I wasn’t looking at the cars. Fortunately, the brother inside appeared in time and saved me, but he himself…”</p><br/><p>Chu Chuanyao’s face was full of guilt and couldn’t help but clench his hands, quite apprehensive.</p><br/><p>Wei Han opened his mouth, just wanting to comfort him, but Dad Qi, who had been silent all along, opened his mouth at this time: “It’s okay, child, we don’t blame you.”</p><br/><p>When the voice just fell, the door to the operating room opened, and Qi Zhifan was pushed out by several nurses. The doctor took off his mask and smiled at them. “You can rest assured that he’s out of danger and should be able to wake up soon.”</p><br/><p>After hearing this, the crowd’s hanging hearts finally fell down.</p><br/><p>The first thing Qi Zhifan did when he woke up was actually to see Chu Chuanyao.</p><br/><p>On the bed, Qi Zhifan had several bandages wrapped around his head. He stretched his hand out from the quilt and clutched at Chu Chuanyao tightly, voice still hoarse: “You…what’s your name?”</p><br/><p>Chu Chuanyao was a bit scared, but still honestly replied, “Chu…Chu Chuanyao. Chu State’s ‘Chu’, Chuan Mountain’s ‘Chuan’, and Yao Shun Yu’s ‘Yao’.”</p><br/><p>Wei Han to the side stared blankly, recalling that the first time he saw Chu Chuanyao, he also introduced himself like this.</p><br/><p>After hearing this, Qi Zhifan silently released his hand. The strange light in his pupils that had flashed before also instantly disappeared. He closed his eyes and his expression suddenly showed a kind of unspeakable exhaustion.</p><br/><p>Wei Han’s heart was also exhausted. Sometimes, God really loved to tease people. Wei Han wanted to stop the two people from meeting each other. The result was Qi Zhifan took the first step and it was even “hero saves the beauty”. Ai, ‘man proposes but God disposes’.</p><br/><p>Afterwards, Qi Zhifan still needed to rest well alone. Because Dad Qi had to take care of some important things at the police department, so Mother Wei took the initiative to stay and care for him, while the others also left first.</p><br/><p>Wei Han originally also wanted Chu Chuanyao to stay in the hospital for two days, but Chu Chuanyao insisted that he only had minor injuries and didn’t want to stay in the hospital. He still wanted to go report to S Uni. Wei Han was helpless, and had to send him back to the school dormitory.</p><br/><p>“Senior Wei, you’re really good.”</p><br/><p>Seeing Wei Han always holding his luggage for him, but also kindly sending him to the dormitory, Chu Chuanyao bought a drink and handed it to him gratefully.</p><br/><p>“It’s nothing. We hit it off, and you’re still injured.”</p><br/><p>After picking up the drink specially bought by Chu Chuanyao, there’s no need to mention how happy Wei Han’s heart was, he also couldn’t hide the smile on his face.</p><br/><p>“And, if you really want to thank me, then I’ll call you “Little Yao” from now on, and you’ll call me “Big Brother Wei”, okay?”</p><br/><p>Chu Chuanyao nodded. “Mhm, of course. Big Brother Wei, you sent me over, and even more, Senior Qi saved my life. Your family are all good people! When I have the time, I’ll definitely go visit Senior Qi more.”</p><div><div></div></div><br/><p>Wei Han forced out two laughs. It seemed that Qi Zhifan, this savior, had more weight in his heart.</p><br/><p>In the evening, Wei Han went to the hospital again. He brought some change of clothes from home, but also carefully simmered some rib soup.</p><br/><p>Because Mother Wei had been keeping watch all afternoon, Wei Had had her go eat dinner and rest while he took care of Qi Zhifan.</p><br/><p>When Wei Han walked into the ward, Qi Zhifan was breathing very evenly, still asleep. His fine lashes, like two small brushes, covered the closed eyes. Below the handsome, straight nose were two thin lips full of temptation.</p><br/><p>Looking at the quietly sleeping face, Wei Han somehow thought of “Sleeping Beauty”. He also admitted that Qi Zhifan was a little less sharp and cold than usual when he was asleep, a little bit gentler and at ease, looking at him also wasn’t so dislikable.</p><br/><p>Stretching out his hand, he pulled Qi Zhifan’s cheek. Skin was good ah, Wei Han couldn’t help but sigh, ai, how could this person look so beautiful? It was really like he walked out from a manhua.</p><br/><p>A tiny bit envious, Wei Han pulled again. The elasticity was also very good.</p><br/><p>Suddenly, Qi Zhifan’s nose moved slightly and his eyelids slowly lifted. The pupils of the just-opened eyes frightened Wei Han to take several steps back.</p><br/><p>“What are you doing?”</p><br/><p>Qi Zhifan asked. Also, not knowing if it was an illusion or not, but he always felt a slight pain in his right cheek.</p><br/><p>“I…I didn’t do anything ah.” Wei Han felt a little guilty, and catching a glimpse of the rib soup he’d brought on the table, he hurriedly said in dead earnest, “What’s wrong with a big brother coming to see his little brother? I was kind enough to simmer some soup for you.”</p><br/><p>Next, Wei Han supported Qi Zhifan up and held a bowl of hot and steaming soup for him.</p><br/><p>It was quite tempting just from smelling the fragrance, but Qi Zhifan’s hand didn’t move and didn’t accept it. He only looked at Wei Han and raised his chin. The gaze clearly wanted Wei Han to personally feed him.</p><br/><p>“You are so old and not young anymore. Also, your hand wasn’t injured. You can hold and drink it yourself,” Wei Han said, unwilling.</p><br/><p>A few months ago when they were at the resort, Qi Zhifan fainted because of his low blood sugar. He was somewhat guilt-ridden, so he’d hand-fed him the sweet-stewed snow pear. But this time, the scandal crisis had gone on for so long, Qi Zhifan unexpected had an indifferent attitude, and also looked on as he was mocked at for so long. Furthermore, now that Chu Chuanyao has appeared again, Qi Zhifan would become his love rival and made Wei Han feel a sense of crisis.</p><br/><p>“……” Qi Zhifan knitted his brows. Some time ago, he’d read a lot of his and Wei Han’s fanfiction novels.</p><br/><p>According to the plots of those fanfictions, no matter in which novel, Wei Han should personally and very considerately feed his own soup to him. But in reality…</p><br/><p>Seeing Qi Zhifan lowered his brows still thinking about something, and delayed taking the hot soup in his hands, Wei Han’s hands grew sour, heart also gradually softening.</p><br/><p>“Okay, okay, seeing as you’re still a patient, I will reluctantly feed you.” Words finished, Wei Han held the spoon and blew on it with his mouth, in the end, still hand-feeding Qi Zhifan.</p><br/><p>Qi Zhifan’s tightly knitted brows suddenly smoothed out.</p><hr/><br/><p>In S Uni’s first year of school, Wei Han attended a number of general courses, but also learned the basic knowledge about the criminal investigation profession. This semester, faced with choosing their courses, Wei Han and Little Jiang both clearly favored criminal police type of courses: learning theoretical knowledge, while training in catch and grapple, live ammunition shooting class, and police body training.</p><br/><p>Wei Han’s goal was, between his studies and his love life, to not neglect either. Therefore, while Qi Zhifan was still recuperating his body in the hospital, he must use his proximity to obtain favor, and also strive once again to pursue Chu Chuanyao.</p><br/><p>Chu Chuanyao was an international business major student in the Economics and Management Faculty. So, Wei Han frequently ran over to the Economics and Management Faculty’s lecture building. Several times after Chu Chuanyao’s class, he could see Wei Han waiting for him with a smiling face. Of course, Wei Han’s wandering figure could also often be seen downstairs from his dormitory.</p><div><div></div></div><br/><p>In general, Wei Han would prepare a love lunchbox for him. Chu Chuanyao was embarrassed, and at first, he refused. Then, once he ate a mouthful, he deeply fell in an inextricable love, and also accepted Wei Han’s kindness. Of course, he would also remember to buy some small gifts for Wei Han.</p><br/><p>Once, Chu Chuanyao was supposed to send Wei Han a men’s wallet. The result was that he accidentally mixed it up with the gift for his cousin, and it became a pair of Spongebob Squarepants socks.</p><br/><p>Looking at the bright yellow in the bag, Chu Chuanyao’s lips trembled and stammered, “Uh, Big Brother Wei, these…these pair of socks…if you dislike that they’re childish, you could…refuse.”</p><br/><p>Wei Han took it and said, “Want! Why would I refuse, I think they’re super cute.”</p><br/><p>He didn’t care what was sent. As long as it was sent by Chu Chuanyao, he’d totally like it.</p><br/><p>“Right, where did you buy them? I’d buy a pair of Patrick Star another day,” Wei Han smiled again. Heh heh, wait until he buys it, then he’d give it to Little Yao. Spongebob Squarepants and Patrick Star were very close friends.</p><br/><p>Chu Chuanyao: “……”</p><br/><p>Did Big Brother Wei prefer pink things? The taste was really a bit…</p><hr/><br/><p>Today was just the day when Qi Zhifan was discharged. Wei Han changed into the new socks Chu Chuanyao had sent, and then followed Dad Qi and Mother Wei together to take Qi Zhifan back home. Along the way, Dad Qi and Mother Wei didn’t pay attention to the changes on Wei Han’s feet, but Qi Zhifan could see the two bright yellow smears on Wei Han’s feet with a glance.</p><br/><p>“This was what he gave you?” Back home, Qi Zhifan went straight to the point.</p><br/><p>During the time he was in the hospital, Wei Han also accompanied Chu Chuanyao to see Qi Zhifan several times. As long as there was Chu Chuanyao around, Wei Han was especially happy. Sometimes, he’d look at little things like his wristwatch, and happily look at it, lost in thought. Anyways, his face couldn’t suppress his smiling expression.</p><br/><p>When Mother Wei often saw this, she couldn’t help but tease him and asked if he was in love. Wei Han immediately lowered his head, or changed the subject, apparently shy.</p><br/><p>All of his performances, even a fool would know what was the matter, let alone the incomparably shrewd Qi Zhifan.</p><br/><p>Wei Han, caught off guard, shrunk back his feet, thinking to himself that Qi Zhifan really had discerning eyes. His lips twitched. “Yes…yes, it’s like that. It’s my personal matter, and none of your business.”</p><br/><p>Qi Zhifan crossed his arms and disapprovingly hooked his lips. “Maybe later, it’d be my business. I’m going to chase Chu Chuanyao.”</p><br/><p>“What?!” Wei Han’s complexion changed and shouted, “No…you can’t!”</p><br/><p>“Why not? He’s still single. You can chase him, so I certainly can. We can compete fairly.”</p><br/><p>Fair your sister ah! Just look at the face and you know it’s not fair ah. This was terrible. Wei Han’s heart sounded the level-ten alarm.</p><br/><p>Wei Han’s complexion was now white, now green, and he secretly squeezed his palm. “Qi Zhifan…”</p><br/><p>The light in Qi Zhifan’s pupils flashed. Wei Han’s taut face and rare solemn expression made him pay attention.</p><br/><p>“I’m serious about Chu Chuanyao. He’s the one I’ve been waiting for. Anyway, even if I die, I won’t let go. So, if you’re not sincere to him and just playing, then don’t tease him. Or I…I’ll never let you off!” Wei Han shouted the last words.</p><br/><p>“……” Qi Zhifan was stunned. Silent for a long while, he lightly said, “I’m not playing this time. If I look at his face, then it would also be fine to spend the rest of my life with him.”</p><br/><p>His tone was light, but no traces of joking could be heard.</p><br/><p>“……”</p><br/><p>Wei Han completely froze in place, and his spirit didn’t return for a long time.</p><br/><p><b>The author has something to say:</b></p><br/><p>Silly Han (bristling): <em>WTF</em>! What’s this situation? Why is Odd Trouble’s reaction towards Little Yao so strange?</p><br/><p>Odd Trouble (evil, charming smile) …</p><div><div></div></div><br/>\n</div>"}