{"title": "Chapter 24", "id": 24, "volume": 1, "url": "http://boxnovel.org/its-not-easy-being-your-love-rivals-big-brother-chapter-24", "volume_title": "Volume 1", "body": "<h1>Chapter 24</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Translator: Mosstree</p><br/><p><strong>Chapter 24: Little Female Cousin vs Wei Foxy Spirit</strong></p><br/><p>“Brother Zhifan, I miss you so much.”</p><br/><p>As soon as she came in, the around ten years old little girl fluttered into Qi Zhifan’s bosom. She had a sweet and sticky little voice, and with big, blinking eyes, was pink and delicate, pretty like a doll.</p><br/><p>Wei Han got a little confused at the situation, so he went to Mother Wei’s side and asked, “Mom, who’s this little loli ah?”</p><br/><p>“She’s Qi-qi, Fan-fan’s super cute little cousin, and now, also yours. Also, aren’t you on break these few days? It just happens that Qi-qi wants to play at our house. You have to take good care of her.”</p><br/><p>Wei Han: “……”</p><br/><p>Mom, doing laundry, cooking, and looking after children, you actually handed them all over to your son, is this really okay?</p><br/><p>After only one night, Wei Han discovered that this little cousin, Wu Yunqi’s whole heart and whole eyes were only filled with Qi Zhifan alone. Every time she opened her mouth to speak, it’s almost always to call for “Brother Zhifan”, and where Qi Zhifan went, she also stuck with him. Even more, she shouted out that she wanted to sleep together with Qi Zhifan.</p><br/><p>To Dad Qi and Mother Wei, the little girl would smile shyly, but she completely ignored this big living person! Wei Han, who’d been neglected since the beginning, felt that his sense of existence was so low that he would soon become an invisible man.</p><br/><p>No! Wei Han pondered what he had to do to get this little cousin to realize that there was another good, hard-working older brother ah.</p><br/><p>The next day, Wei Han got up early and ran to the market to buy a lot of meat and vegetables, and also bought noodles, dumpling skins and so on, preparing to rely on gourmet food to capture the little cousin’s heart.</p><br/><p>The breakfast was a lot more sumptuous than usual. It could be described as a “Chinese-Western combination”: both noodles and dumplings, but also milk bread, sandwiches and so on that really made people’s eyes shine. Smiling, Dad Qi praised Wei Han as “hardworking and capable”, and Mother Wei, even more, grinned from ear to ear, and kept saying “virtuous” this word, making Wei Han’s lips flatten.</p><br/><p>Qi Zhifan also slightly hooked up his lips, looked at Wei Han a few more times, and ate with relish, also eating more than usual.</p><br/><p>“Little Qi, how is it? Is it delicious?” Wei Han smiled and asked, full of anticipation. Inside, there was a little villain smugly twirling around.</p><br/><p>Wu Yunqi, who was immersed in eating dumplings, raised her eyes, her expression cold and indifferent, said: “So-so, I don’t care much about what I eat.”</p><br/><p>“……”</p><br/><p>Wei Han suddenly felt a burst of defeat, and the inner little villain also squatted in the corner, silently drawing circles.</p><br/><p>Wu Yunqi quietly pinched her palm and tried to maintain her indifferent expression. She had to admit that the dumpling in her mouth was simply too delicious ah. When she took the first bite, she was somewhat unable to control herself and felt that she could eat three bowls.</p><br/><p>But she must not be so easily tempted.</p><br/><p>Before coming here, she was somewhat curious: what kind of person would the new big cousin be? The result was, completely didn’t expect, it was actually a male foxy spirit, hmph! <b><sup> [1]</sup></b></p><br/><p>This Wei Han, dared to twist his waist and dance in front of Brother Zhifan. To flirt like this was already very shameful, but the mouth actually also yelled out “<i>ow</i>“, too lewd! So openly seducing Brother Zhifan, he simply can’t be tolerated!</p><br/><p>After breakfast, Dad Qi and Mother Wei went to work, and Qi Zhifan also went to school. Although Wu Yunqi was reluctant to part, but thinking that two days after, it’d be the weekend and Qi Zhifan would definitely have time to accompany her, she was also relieved.</p><br/><p>“Wei foxy spirit! This miss wants to paint. You go prepare it.”</p><br/><p>After everyone else had left, Wu Yunqi also revealed her nature: with a disgusted look, she bossed Wei Han around.</p><br/><p>“Ah? You just called me…”</p><br/><p>Wei Han’s brain couldn’t help but become stupid for a moment. The second before, the little cousin was still acting like a lady. How come she suddenly became an arrogant little princess?</p><div><div></div></div><br/><p>“Wei, foxy, spirit!” Wu Yunqi raised her chin with a haughty posture.</p><br/><p>“……” Wei Han foolishly blanked, “Where do I look like a fox ah?”</p><br/><p>“Everywhere.”</p><br/><p>Wei Han: “……”</p><br/><p>This little loli definitely needed to go see the ophthalmologist.</p><br/><p>Wu Yunqi was very good at painting. Although she was only ten years old, but she’d already won numerous awards, large and small. Because she was talented in this area since childhood, her parents also invited a lot of teachers to specially train her.</p><br/><p>Setting up the painting board, Wu Yunqi faced the several pots of succulent plants on the balcony and began today’s gouache exercises. Wei Han sat quietly to the side, not daring to step forward to disturb her without her permission.</p><br/><p>Wu Yunqi also brought a number of works over this time. Most likely, they were specially brought for Qi Zhifan to appreciate and evaluate. Wei Han saw several of her oil paintings, and they were all landscape paintings. But when he browsed through her sketchbook, he discovered that all those used to practice portraiture were, without exception, all Qi Zhifan.</p><br/><p>Wei Han carefully studied for a while, and couldn’t help but shake his head. Wu Yunqi portrayed Qi Zhifan’s features and outlined his face very well, but unfortunately, differed somewhat from his charm.</p><br/><p>Ai, his eyes were too tender, and the curvature of his mouth when he smiles was also obviously wrong.</p><br/><p>“Little Qi, your drawings of Qi Zhifan…” Wei Han said, hesitating.</p><br/><p>“What, you have a problem with them?” The brush dipped in the paint paused, and Wu Yunqi looked at him askance.</p><br/><p>“To tell the truth, it’s actually a bit unalike. Some places need to be changed.”</p><br/><p>Wei Yunqi was slightly stunned. In fact, she had already discovered this problem. Although those teachers praised her, and also all agreed that her cousin Qi Zhifan must be a gentle and good man, but she understood in her heart that it was not so.</p><br/><p>After all, there was a difference of eight years in age. Many times, she couldn’t understand Qi Zhifan’s expressions. The cousin that she drew on paper, most was her heart longing for that appearance.</p><br/><p>“Then can you change it?”</p><br/><p>Wu Yunqi asked, simply putting down the brush in her hand and walked to Wei Han’s side, handing him a pencil and eraser.</p><br/><p>Wei Han touched his chin and brought up Qi Zhifan’s appearance in his mind. He thought about it for a moment, then he changed the curvature of the eyebrows and the lips, and also darkened the eyes slightly.</p><br/><p>“Oh, this almost looks like it.”</p><br/><p>After Wei Han finished, Wu Yunqi took a closer look, and her pupils couldn’t help but shrink. It was a bit hard to believe: this Wei foxy spirit had only changed a few strokes, but it suddenly resembled him a lot more!</p><br/><p>“Heheh, I didn’t expect that I had a little talent in drawing,” Wei Han scratched his head and giggled twice.</p><br/><p>With this laugh, he immediately caused Wu Yunqi “Little Princess” to be unhappy. She knitted her eyebrows and instantly closed the sketchbook, coldly saying, “Hmph, who asked you to change my drawings, really impolite!”</p><br/><p>Words finished, she turned her back and ignored Wei Han.</p><br/><p>“……”</p><br/><p>Wei Han was speechless. This little cousin could really turn hostile with just a word and was so hard to please.</p><br/><p>At lunchtime, although there was only him and Wu Yunqi at home, but ‘the one who comes is a guest’, and Wei Han busied himself in the kitchen for a while, making seven or eight dishes. Who knew, Wu Yunqi took one bite and said she didn’t like it, ate another bite and kept shaking her head, and then reluctantly drank a bowl of wax gourd and kelp soup.</p><br/><p>Wei Han also said that he knew of a good restaurant and wanted to take her out to eat, but she didn’t want to.</p><br/><p>Seeing her with this kind of nasty attitude, even if Wei Han was silly, he could see that she had complaints toward him. Only, why? He still hadn’t grasped the reason. He clearly had a very pure and good face ah.</p><br/><p>The table full of food was finally all eaten up by the big stomach king Wei Han. On the one hand, he thought that it couldn’t be wasted. On the other hand, he wanted to deliberately annoy Wu Yunqi.</p><br/><p>At about 3 o’clock in the afternoon, a “<i>growl</i>” came out. In the end, Wu Yunqi’s belly very disappointingly called out. Her cute little face had become crumpled now, and the whole body was listless and paralyzed on the sofa.</p><div><div></div></div><br/><p>Seeing this, Wei Han sighed and took out a bag of peach pastries and gave it to her.</p><br/><p>This time, Wu Yunqi, who was so hungry that she had her chest sticking to her back, could no longer refuse and directly grabbed the bag over. Later, she simply held it in her arms, nibbling while watching cartoon.</p><br/><p>Wei Han felt that it wasn’t worth it to get angry at a little girl. He poured fruit juice for her and began to idly chat with her.</p><br/><p>“Little Qi, what do you want to be when you grow up? An artist?”</p><br/><p>Since she’d made a fuss at lunch, Wu Yunqi was too lazy to deliberately torment Wei Han anymore and lightly answered, “That’s a must, but I also have other dreams.”</p><br/><p>“What dreams?”</p><br/><p>“It’s to marry Brother Zhifan,” Wu Yunqi solemnly vowed.</p><br/><p>Wei Han: “……”</p><br/><p>It really was a dream ah, and could only think about it in her dreams.</p><br/><p>After Qi Zhifan came back in the evening, Wu Yunqi immediately became clever and sensible again.</p><br/><p>Wei Han looked gloomy on the side, and gave Qi Zhifan a look with profound meaning: Ai, how many men and women were deceived by Odd Trouble’s face? Even his little cousin couldn’t escape.</p><br/><p>Qi Zhifan, of course, felt Wei Han’s gaze and also looked back at him, thinking that Wei Han seemed to be watching him more. Was he finally attracted by his own charm?</p><br/><p>Qi Zhifan was a little happy.</p><br/><p>On Saturday, Qi Zhifan and Wu Yunqi were walking hand-in-hand. The cousins were dressed very fashionably, like an exceedingly rich young master and young lady. In contrast, Wei Han had on casual sportswear, followed behind their butts, and was also forced to carry big bags and small bags, just like a male nanny.</p><br/><p>Originally, this drudgery hadn’t fallen on Wei Han’s head. Originally, he was planning to meet up with Chu Chuanyao this morning, but Qi Zhifan insisted on going with him and Dad Qi and Mother Wei also agreed. Just, Chu Chuanyao said he wanted to find Professor Dong. Wei Han was broken-hearted but helpless, also had to accompany them.</p><br/><p>In the afternoon, Wei Han and Qi Zhifan brought Wu Yunqi to the amusement park.</p><br/><p>Although Wu Yunqi was a girl, but she’d always liked to seek thrills. She pointed to the long, winding track in the air and smiled. “Brother Zhifan, let’s ride the rollercoaster.”</p><br/><p>He could hear the burst of screams from time to time. Qi Zhifan looked down at Wu Yunqi, and smiled without smiling, “You’re not afraid?”</p><br/><p>Qi Zhifan remembered that his aunt had previously disapproved of letting Wu Yunqi ride this, so this should be her first time sitting on one.</p><br/><p>Wu Yunqi disagreed, “I’m not afraid. What’s more, with Brother Zhifan next to me, there’s nothing to fear.”</p><br/><p>Qi Zhifan nodded and looked at Wei Han. “Wei Han, you…”</p><br/><p>Wu Yunqi once again interrupted and confidently said, “Brother Zhifan, don’t mind him. Brother Wei Han looks very timid. Just let him wait for us at the bottom.”</p><br/><p>In front of Qi Zhifan, pretending to be an obedient girl, Wu Yunqi had changed to calling him “Brother Wei Han”, but was obviously unwilling.</p><br/><p>“……”</p><br/><p>Wei Han’s face was slightly strained, but he didn’t pay any mind to these words. He was not timid. Because his nerves were thick, so basically, there’s nothing that scared him, just sometimes, he gets a little frightened.</p><br/><p>“You guys have fun,” Wei Han lazily said. It just so happen that he was uninterested in accompanying them, and instead, was happy to be idle.</p><br/><p>However, when Qi Zhifan and Wu Yunqi were preparing to get into the car, Qi Zhifan’s cell phone rang unexpectedly.</p><br/><p>Qi Zhifan took a look and saw that it was a call from S Uni’s president. He reckoned there were some matters to discuss, so Qi Zhifan decisively let Wei Han replace him.</p><br/><p>Wei Han and Wu Yunqi eyed each other, suddenly feeling that the other was a little hateful.</p><br/><p><b>Notes</b></p><ul><li><b>1. Foxy spirit:  (Húlíjīng) </b>fox spirit, symbolizes a woman who seduces men</li></ul><div><div></div></div><br/>\n</div>"}