{"title": "Chapter 23", "id": 23, "volume": 1, "url": "http://boxnovel.org/its-not-easy-being-your-love-rivals-big-brother-chapter-23", "volume_title": "Volume 1", "body": "<h1>Chapter 23</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Translator: Mosstree</p><br/><p><strong>Chapter 23: Little Brother's \"First Love\"</strong></p><br/><p>In C City, Wei Han met Lu Yan.</p><br/><p>Lu Yan laughed “hehe” and politely greeted Wei Han with a few words. He let the tall, handsome guy beside him go first, and also wanted to invite Wei Han to eat. Then, he pulled Wei Han into a noodle shop.</p><br/><p>“This place is very delicious. You should try,” Lu Yan smiled and said very enthusiastically.</p><br/><p>Wei Han nodded, and then sucked in a few mouthfuls of noodles. The taste was really good, and then he also had a little interest in this noodle master, really an expert among people.</p><br/><p>“Brother Wei, didn’t you say that you need to train later? Will you be coming back here? At that time, don’t hesitate to come find me. I will always welcome you.”</p><br/><p>Wei Han embarrassingly smiled and thought that he really hadn’t misjudged this person. In fact, they hadn’t seen each other many times, but also because of Qi Zhifan, he was driven out of S City. But didn’t expect, Lu Yan wasn’t a bit bothered by it and was so kind.</p><br/><p>Ai, such a good man, was so let down by Qi Zhifan, that slag <i>gong</i>.</p><br/><p>“Lu Yan, the one who was just beside you was…”</p><br/><p>After Wei Han asked, Lu Yan immediately became shy. “Oh, he’s Brother Yuan Peng. He’s three years older than me and has been taking care of me since I first came to C City.”</p><br/><p>“Haha, it seems like you’re doing well.”</p><br/><p>Wei Han laughed in satisfaction. This was also good. Instead of choosing a man who didn’t have a heart like Qi Zhifan, it would be better to find an honest man who really cared for him.</p><br/><p>“Brother Wei, is Zhifan still well?” Lu Yan casually asked with an at-ease appearance.</p><br/><p>Wei Han was stunned and waved his hand. “He’s still the same: just likes to make money. This kind of slag <i>gong</i>, he’s not worth a bit of your concern.”</p><br/><p>“I’m really sorry about my cousin’s matter. And, I feel that Zhifan has always been hiding a person in his heart. I’m probably the same as his former boyfriends, and were just that person’s substitute.” Finished talking, Lu Yan’s eyes were downcast.</p><br/><p>“Ah? Then he’s really a slag.” Wei Han knitted his brows.</p><br/><p>Lu Yan shook his head. “In fact, he was very tolerant of me. In the beginning, I chased him, and finally, I was also the one who proposed that we break up. Listening to you that day, after watching that horror movie, I really felt tired and didn’t want to force this affection.”</p><br/><p>Wei Han was taken aback and the noodles slipped from this chopsticks. “So you dumped him? I always thought that it was him…”</p><br/><p>“Ai, my cousin also thought so. Brother Wei, you should try to learn more about Zhifan. You may find that there are many misunderstandings about him.”</p><hr/><br/><p>Tormented for a week, Wei Han with sore waist and aching back, finally returned to S City.</p><br/><p>At the station, Wei Han dragged his luggage. Since neither Dad Qi nor Mother Wei had time, he didn’t expect anybody to pick him up. Who knew that Qi Zhifan had been waiting for him long ago.</p><br/><p>Somehow, seeing him from far away, a certain soft spot in Wei Han’s heart was touched, and he couldn’t help but foolishly blank.</p><br/><p>Qi Zhifan came over and helped to take his big backpack. Looking Wei Han up and down, he indifferently summed up: “Darkened a lot, but didn’t thin.”</p><br/><p>“……”</p><br/><p>Wei Han clenched his teeth. This person, would he die if he said something a little nice? The mouth was always so poisonous.</p><br/><p>For the next three days, Wei Han and the criminal investigation majors were all on break.</p><br/><p>This day, Wei Han slept until noon. There was no one else at home, and after he finished his lunch, he felt that he had nothing to do, so he occupied himself with cleaning the house.</p><br/><p>When he’s free, he’d do some housework. Although that made him, this grownup man, be labelled as ‘virtuous’, but Wei Han had developed this habit from a young age, and couldn’t be changed in a short while.</p><br/><p>Sweeping, Wei Han found a small blue U drive in the living room. He didn’t recognize whose it was at the moment, and also wasn’t sure whether it could be used. He simply plugged it into his own laptop.</p><br/><p>Once inserted in, he knew that this was definitely Qi Zhifan’s.</p><br/><p>Supposedly, Wei Han should not casually look since this involved personal privacy issues. But thinking that its owner was Qi Zhifan, Wei Han couldn’t restrain his curiosity, the words Lu Yan said that day echoing in his ears. He repeatedly said to himself: this was for a big brother to better understand his little brother, and to promote the family’s harmonious development.</p><br/><p>After opening the U drive, there were all kinds of information, studies, and financial data that gave Wei Han a headache with just a look. There was also a <i>chy </i>file that caught his attention.</p><div><div></div></div><br/><p>Wei Han took a look, and your mom, inside was all the personal information about Chu Chuanyao. His face suddenly sank down: this bastard, he must have intentionally investigated Little Yao before! He must have planned long ago to approach Little Yao. What was his purpose in the end?</p><br/><p>The next second when he clicked open a picture, Wei Han was completely frozen in front of the computer screen.</p><br/><p>The two junior high school boys in the photo, one was Qi Zhifan, and the other looked delicate and pretty. How come he looked so much like Chu Chuanyao?!</p><br/><p>Could this person be the one in Qi Zhifan’s heart, his first love?</p><br/><p>In order to understand the entire development, Wei Han thought for a moment and had to call Pei Yuyang.</p><br/><p>Pei Yuyang was obviously frightened. “You…how did you know about this matter? Ah Fan couldn’t have told other people.”</p><br/><p>“You don’t need to care about how I know. Now I want to know what exactly happened with Qi Zhifan’s first love?”</p><br/><p>“<i>Sorry</i>, I can’t say this. The consequences of Ah Fan’s anger are very severe, unless…” Pei Yuyang changed the topic, and profoundly smiled.</p><br/><p>“Unless what?” Wei Han suddenly had a bad feeling.</p><br/><p>“You help me ask Curlie out.”</p><br/><p>“You can’t ask him yourself?” Wei Han cried. He’d guessed that this cliff was related to Little Jiang.</p><br/><p>“Curlie has always been very shy. Everything I think of is useless; he’d definitely be unwilling to come out on his own initiative. I went to his house, and his sister didn’t really welcome me. Went to the dessert shop, the Manager Song looked at me with a very unfriendly look. Ai, I’m so distressed.” Pei Yuyang lightly sighed.</p><br/><p>Wei Han thought for a moment, and still couldn’t sell out his teammate. “No, don’t always think about eating Little Jiang’s tofu! <b><sup> [1]</sup></b> If you’re really distressed, you can hug your family’s pig and eat two mouthfuls.”</p><br/><p>“……”</p><br/><p>Pei Yuyang gradually found out that Wei Han, living together with Qi Zhifan for a long time, also learned a bit of his poisonous tongue.</p><br/><p>“In a few days, it’ll be my birthday. You can come together, my dear little Han Han. You should take pity on the pitiful me. Regarding Ah Fan and that Ou Yizhe, I won’t hide anything and tell you all that I know.”</p><br/><p>Called “little Han Han”, he was so nauseated that goosebumps covered his body. Wei Han shouted, “Get along with your ‘little Han Han’! Speak with human words.”</p><br/><p>“Big Brother Wei Han, please, I’m begging you.”</p><br/><p>Wei Han’s eyes looked straight and he tried to figure it out in his heart for a while. On the one hand, he thought that recently, Little Jiang also didn’t resist this Foolish Man-Sheep too much. On the other hand, he also wanted to know Qi Zhifan’s first love situation, and so finally compromised.</p><br/><p>“Okay, it’s a deal.”</p><br/><p>Ou Yizhe, precisely speaking, this man couldn’t be regarded as Qi Zhifan’s “first love”, but the object of his first crush. They both met in primary school and also went to the same junior high and high school. But in the middle of high school, Ou Yizhe suddenly went abroad and Qi Zhifan continued to stay in the country.</p><br/><p>As for the reason, it could also be regarded as Qi Zhifan’s bitter history. When he intended to confess to Ou Yizhe, Ou Yizhe said he’d already had someone in his heart, and then he went abroad with another person, an older brother who was older than him by several years. Ou Yizhe walked away very decisively. Regardless of how Qi Zhifan urged him to stay, he still left without even turning his head back.</p><br/><p>Qi Zhifan became seriously ill and later, became cold-hearted and grim, placing money above all else.</p><br/><p>After learning that Qi Zhifan once had such a bitter time, not only did Wei Han not ridicule, but instead, it produced a feeling of “sympathizing with those who have the same misfortunes”. He stared blankly at the two people in the photo, remained silent for a long time, and secretly copied this photo to his computer.</p><br/><p>When Qi Zhifan returned home in the evening, Wei Han took the initiative to hand over the U drive to him, and obediently “surrendered”.</p><br/><p>“I know everything about Ou Yizhe.”</p><br/><p>Wei Han hung his head and frankly reported even this matter. Anyway, the shrewd Qi Zhifan would sooner or later suspect; it’d be better to say it now.</p><br/><p>Qi Zhifan’s expression was somewhat complicated, and lowly cursed, “Pei Yuyang, that blabbermouth.”</p><div><div></div></div><br/><p>“Don’t blame him. I forced him. I shouldn’t have done this, and I’ll take full responsibility. You can hit me or scold me, go ahead.”</p><br/><p>Wei Han braced himself and said. Because he couldn’t completely guess what the temperamental Qi Zhifan’s punishment would be, actually, he was still somewhat fearful in his heart.</p><br/><p>Whenever he saw Wei Han apprehensive and shrunk into a ball in front of him, Qi Zhifan’s mood became particularly happy. He sat on the sofa, tilted his legs and faintly said a sentence, “Think of a way to amuse me.”</p><br/><p>“Ah? So simple? Is it real or fake?”</p><br/><p>Sure enough, Wei Han would never guess Qi Zhifan’s mind.</p><br/><p>Qi Zhifan touched the corner of his eye and nodded.</p><br/><p>Not saying anything further, Wei Han rushed into the kitchen. As Qi Zhifan’s older brother for so long, other things he may not understand, but he’s very clear on his little brother’s picky taste, and also knew that he really liked to eat what he makes.</p><br/><p>After washing his hands, Wei Han sharpened the knife, but Qi Zhifan’s voice cut him short, “Wei Han, come out. Food doesn’t count.”</p><br/><p>Wei Han put down the knife. If it wasn’t cooking, then it’s a bit difficult ah. He looked at Qi Zhifan’s face a few times, and found that, no matter how he looked, Qi Zhifan’s face remained expressionless. He also suddenly thought that until now, he’d really never seen him happily laugh.</p><br/><p>“<i>Cough…cough</i>,” Wei Han cleared his throat and mulling it over, “Then, I’ll sing for you.”</p><br/><p>“Shut up.”</p><br/><p>The next second, it was mercilessly dismissed by Qi Zhifan.</p><br/><p>“Ai, you’re asking for a lot, I can’t do anything else.”</p><br/><p>“Dance,” Qi Zhifan lightly spat out.</p><br/><p>Wei Han was distressed. “How can I ah? What Latin dance, ballet, folk dance, ballroom dance, and what hip-hop, belly dance, pole dance, I can’t do at all. Even Yangge folk dance, I haven’t danced before. Good little brother, if you really want to see, we can go downstairs and watch the aunties do the fitness square dance.”</p><br/><p>The veins on Qi Zhifan’s forehead jumped and he coldly looked at Wei Han. “I just want to see you dance.”</p><br/><p>Just listening to this tone, he wasn’t allowed to refuse. Wei Han simply wanted to cry but had no tears. Odd Trouble, which muscles joined up wrong today? Why do you want to see this grownup man dance ah?</p><br/><p>If this was as usual, he definitely would have rebelled. But who told him to do something wrong. Ai, he was in the wrong. He also thought of Qi Zhifan, who also had a period of history where his feelings were hurt. So, he reluctantly twisted his waist.</p><br/><p>Qi Zhifan eyes suddenly brightened, his gloomy face obviously improved.</p><br/><p>Left three laps, right three laps, neck and butt twisting, Wei Han could only sway his body this stiffly and awkwardly. He felt really shameful, wishing he could find a hole to crawl into. But who knew, Qi Zhifan was staring intently, not even knitting his brows.</p><br/><p>Qi Zhifan never told anyone that, because of Wei Han’s appearance, he seemed to have gradually come out: come out from those years when Ou Yizhe had brought him such grief.</p><br/><p>“Can you ‘top hip’?” Qi Zhifan asked.<sup> [2]</sup></p><br/><p>Wei Han thought of those Korean stars on TV. He leaned back slightly and bent his knees. He move back and forth and tried to ‘top’. The clumsy actions suddenly made Qi Zhifan “pfft” laughed out loud, truly amusing.</p><br/><p>In an instant, Wei Han looked and became silly: wow, he didn’t expect that when Odd Trouble laughed, he’d be super handsome ah!</p><br/><p>To win the beauty’s laugh, Wei Han decided to redouble his efforts, twisting and twisting hard. As a result, accompanied by an “<i>ow</i>” scream, he miserably sprained his waist.</p><br/><p>“What happened?” Qi Zhifan immediately stepped forward and supported Wei Han.</p><br/><p>“My waist hurts.”</p><br/><p>“How did your waist get hurt again?”</p><br/><p>“It was injured during the training, and probably hasn’t healed yet.” After Wei Han finished talking, he hadn’t had time react before he saw Qi Zhifan bowed his head and used his hand to rub his waist.</p><br/><p>“Brother Zhifan! You…”</p><br/><p>At this time, Mother Wei and a little girl about ten years old stared blankly from the doorway.</p><br/><p><b>Notes</b></p><ul><li><b>1. Eating tofu: </b>taking advantage of someone, in a sexual way</li><li><b>2. ‘Top hip’</b>: () I couldn’t find an English equivalent, but from the Youtube videos, it’s something like a hip thrust dance move</li></ul><div><div></div></div><br/>\n</div>"}