{"title": "Chapter 29", "id": 29, "volume": 1, "url": "http://boxnovel.org/its-not-easy-being-your-love-rivals-big-brother-chapter-29", "volume_title": "Volume 1", "body": "<h1>Chapter 29</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Translator: Mosstree</p><br/><p><strong>Chapter 29: Three-Month Training</strong></p><br/><p>“It’s winter. When you go out, you don’t even wear a scarf. And it’s so late, you’re still on the rooftop feeling the wind. Do you have a pit in your head?”</p><br/><p>“……” Wei Han took the scarf in a daze, and didn’t open his mouth to refute anything. He knew that despite Qi Zhifan’s bad tone, this was also out of concern.</p><br/><p>Rarely seeing Wei Han so obedient, Qi Zhifan’s anger also suddenly left, and he went up to help wrap the scarf around his neck. “Okay, let’s go down.”</p><br/><p>Wei Han shook his head. “I still want to stay a while longer.”</p><br/><p>“Then I’ll accompany you.”</p><br/><p>“Ah?”</p><br/><p>“I said ‘I’ll accompany you’.” Qi Zhifan stressed again, then he sniffed, “Tsk, your whole body reeks with alcohol. Did you drink until you became silly? Can’t even understand human words. If you want to feel the wind, or look at the stars, I’ll accompany you.”</p><br/><p>Look at the stars? Reminded by Qi Zhifan, Wei Han looked up at the night sky. Sure enough, the sky was filled with stars, incomparably bright.</p><br/><p>Although the wind on the rooftop was a bit strong, but the horizon was wide, so the stars were very clear. This also let Wei Han’s mood, which had been depressed because of Chu Chuanyao’s matter, turn around a lot.</p><br/><p>From Qi Zhifan’s point of view, Wei Han’s eyes, reflecting the starlight, were shining and bright, more moving than all the surroundings.</p><br/><p>“Qi Zhifan, I’m sorry.” Suddenly, Wei Han said this sentence in dead earnest.</p><br/><p>“Why did you suddenly say ‘I’m sorry’?” Qi Zhifan couldn’t help but feel that Wei Han was being silly again.</p><br/><p>Wei Han scratched his head and awkwardly said, “Uh, because when I first came to this house, I did a bunch of unpleasant things to you.”</p><br/><p>“It’s not you fault alone,” Qi Zhifan lightly said, implicitly admitting that he was also in the wrong. His initial attitude toward Wei Han was pretty bad.</p><br/><p>“……” Wei Han was a little surprised again, and then laughed, “Haha, Odd Trouble, I feel more and more that having you, this little brother, is also very good. Later on, I will be a good older brother.”</p><br/><p>“Wei Han, I don’t need…”</p><br/><p>“Hey, Odd Trouble look, it’s a shooting star!” Qi Zhifan’s words were interrupted by Wei Han’s surprised voice. Wei Han excitedly pointed to the sky. “Quick…make a wish!”</p><br/><p>Words finished, he closed his eyes and quietly made several wishes in his heartー</p><br/><p>First, I hope I can become a police officer;</p><br/><p>Second, together with Qi Zhifan, the two brothers can create a happy and harmonious family together;</p><br/><p>Third, I can with Little Yao…</p><br/><p>But the shooting star flashed away and disappeared too quickly. Wei Han had no time to finish. “Ai, there was still the last one…”</p><br/><p>Qi Zhifan didn’t take any action, his eyes always remaining on Wei Han. He hadn’t made a wish. He’d never believed in this. As for Wei Han’s wishes, he could guess that among them included becoming a police officer, as well as Chu Chuanyao.</p><br/><p>“It’s late. We should go back now.”</p><br/><p>In the end, Qi Zhifan took Wei Han’s hand and pulled him away.</p><br/><p>Wei Han stared blankly, shooting a glance at the their two hands held tightly together. He found that Qi Zhifan’s gripping strength was a bit stronger, but he also didn’t say anything, and just let Qi Zhifan pull him.</p><br/><p>The next year came, and the new semester began again in the spring season. This semester, because of the special nature of their profession, Wei Han and Jiang Chengrui would go to C City for three months of training.</p><br/><p>This trip was three months long, so before leaving, Wei Han specially invited Chu Chuanyao out.</p><br/><p>“Little Yao, after three months, I will tell you something very important when I return.” Wei Han had an earnest expression. He decided to wait until the training was over before he came back and confessed to Chu Chuanyao.</p><br/><p>“What important thing? Can’t you say it now?” Chu Chuanyao was a bit puzzled.</p><div><div></div></div><br/><p>The timing wasn’t right. It was estimated that Chu Chuanyao was still not over the pain of Teacher Dong’s marriage, and Wei Han also needed to sort out his thoughts. Not knowing why, his attachment to Chu Chuanyao wasn’t as strong as before, and gradually, he thought it was another kind of feeling.</p><br/><p>He really needed time to think about it. After thinking about it, would he boldly confess to Chu Chuanyao? Or something else? Wei Han felt he must settle this.</p><br/><p>In the end, Wei Han didn’t explain too much and just patted Chu Chuanyao. “Little Yao, in short, you have to look after yourself well in the next few months, be at ease and wait for me to come back.”</p><br/><p>Chu Chuanyao nodded and smiled, “Big Brother Wei, rest assured, I only attend class at school, what can happen? But you, you’re going somewhere else for so long, it’d definitely be hard. You have to put in extra effort ah!”</p><br/><p>“Heh heh, I will definitely work hard!”</p><br/><p>Wei Han made a fist. Although he was a bit silly and a bit frightened, but he wasn’t afraid of enduring hardship. In order to achieve his police dream, he felt that even if he was tired again, he would still clench his teeth to get through it.</p><br/><p>C City, training base.</p><br/><p>Because Wei Han and others had already been randomly assigned to teams with the other students from the Public Security Police Academy to train for a week in the last semester, so this semester was still according to the last semester’s arrangements and they entered into the three months of closed training.</p><br/><p>In the same team, Wei Han and Jiang Chengrui could cheerfully get along with the other two people. But in the face of Shao Yi and the several college guys from C Uni’s Public Security that followed him, no matter how they looked, they weren’t pleasing to the eye.</p><br/><p>In addition, during the last semester, Jiang Chengrui and Shao Yi practiced live ammunition shooting and started a feud, so they both loathed each other. Shao Yi and them almost always deliberately provoked them and tried to pick fault.</p><br/><p>In this training camp, the school specially invited several senior instructors from the city’s Armed Police Squadron to teach the whole course. In addition to learning the laws, routines, and other police knowledge, the focus was on police strengthening body training, including formation training, arrest boxing, baton-shield operation and other basic skills, as well as training and assessment of professional skills such as escort, guard, court duty, and security inspections.</p><br/><p>Intense and regimented work and rest, training, and class began. In theory class, Jiang Chengrui was not as good as Shao Yi. In comparison, Wei Han still studied well. But once on the training ground, he was far behind Jiang Chengrui and Shao Yi, these two.</p><br/><p>Frog jumps, push ups, pull ups, and so on: these training were almost done daily. Wei Han often gritted his teeth to persevere and complete the tasks, always thinking of Qi Zhifan. These were once his “punishments” for him.</p><br/><p>Ai, looking back now, perhaps he was doing him good.</p><br/><p>“Shao Yi, step forward!”</p><br/><p>This afternoon, when training in arrest boxing, the instructor knew that every time Jiang Chengrui sparred with Wei Han, he’d always go lenient on him. This time, he simply replaced Jiang Chengrui with Shao Yi.</p><br/><p>Face to face with Wei Han, Shao Yi’s eyes were extremely unkind and his mouth was pulled into a cruel smile. Wei Han couldn’t help but feel his scalp go numb and tightly clenched his fists.</p><br/><p>In the end, several sets of actions came down. Shao Yi was not sparring at all, but was unilaterally “beating” Wei Han. Wei Han only felt that the bones in his body were quickly falling apart.</p><br/><p>The next day, he should have gotten up at five, but Wei Han, who was painfully uncomfortable, accidentally overslept. It wasn’t until 5:30 that he hurriedly climbed out of bed, not having the chance to properly fold his quilt yet.</p><br/><p>Who knew that this day happened to be the day that the very fierce Instructor Liu would inspect the dorms. He inspected strictly, frowned, and then called Wei Han over to mercilessly scolded him a round. Of course, he would inevitably be punished.</p><div><div></div></div><br/><p>Shao Yi, who was rejoicing in his misfortunes, came forward and proposed to punish Wei Han with heavy load running. In order to prevent Wei Han from being lazy, he also volunteered to keep his eyes on Wei Han.</p><br/><p>“……” Wei Han’s face turned white instantly.</p><br/><p>Wasn’t it just that he’d called him “Arrogant Shao” before, and reminded him to be less arrogant? This person was so fucking vindictive ah!</p><br/><p>Then, under the scorching sun, other people were training, but the bitterly-forced Wei Han had to carry a weight of 10kg and run a full five kilometers. Not mentioning the sweat soaking his clothes, but midway through, he even vomited once.</p><br/><p>At lunch break, Jiang Chengrui came to see Wei Han. His entire body had fallen on his bed, and he was too tired to even think about moving his fingers.</p><br/><p>“Hey, Silly Han, are you still alive?’</p><br/><p>“Don’t…don’t worry, I won’t die,” Wei Han weakly said, “That Arrogant Shao, is too…too damn cruel…”</p><br/><p>Jiang Chengrui patted him comfortingly and his eyes turned. “Silly Han, speaking of Shao Yi, have you found out a matter?”</p><br/><p>“What?”</p><br/><p>“Last semester, he was only focused on me alone, and always set himself against me. But now, he seems to have transferred to you. He seems very interested in you.”</p><br/><p>Wei Han: “……”</p><br/><p>Fuck, what was this called? A nickname triggered a murder? That surnamed Shao’s heart was too small.</p><br/><p>In arduous training everyday, although the days dragged past like a year for Wei Han, but he also persisted for two more months. Sometimes, when he dreamed at night, he would miss his family and friends. He’d thought that the person he’d miss the most would be Chu Chuanyao, but actually it was Qi Zhifan.</p><br/><p>Especially in the last few days, the times Wei Han dreamed of Qi Zhifan became more and more frequent.</p><br/><p>Qi Zhifan’s arrogance and rudeness to him in his past life. Also, when he first entered the family, Qi Zhifan’s cold-hearted and grim, frequent attacks of his poisonous tongue. To later, when it slowly became Qi Zhifan’s “filial piety”.</p><br/><p>Wei Han’s mind was almost all full of Qi Zhifan: his angry appearance, his gloomy and speechless expression, his amused smile, what he’d said to him before; his figure, body temperature, and also, that thing residing in his crotch…</p><br/><p>In the early hours of the morning, Wei Han absentmindedly woke up. Can it be that his dreams were completely held by Odd Trouble?</p><br/><p>During the training, the trainees not only exercised their bodies and gradually mastered the police’s knowledge and skills, but also greatly strengthened their organization discipline, team spirit, and compliance.</p><br/><p>In the most recent inspection and review, the instructor selected thirty outstanding trainees based on the combined score in theory and skills, and prepared to conduct a one-week field survival training for them.</p><br/><p>Wei Han and Jiang Chengrui, and also Shao Yi, were certainly among them.</p><br/><p>“<i>Breet…breet…</i>” the sky just dawned when a burst of urgent whistle sounds roused the fast asleep Wei Han and company. They tidied up their sleeping bags, packed their equipment, and set off with the team, taking a boat to a small island that was a distance away from the training base.</p><br/><p>Wei Han nibbled on the dry food he’d taken with him for his breakfast, but he didn’t dare to eat too much because the seven days of field survival training stipulated that they could only bring three days worth of food, but also had to carry guns, ammunition and survival supplies. En route, they also had to split up into teams and carry out advanced training in mountain and woodland searches, cliff climbing, beach chase, and other training.</p><br/><p>In the first three days, the instructors led the people in centralized training. The first evening when everyone was busy setting up tents, the lead instructor brought in two special students.</p><br/><p>When the whistle sounded, everyone hurried to gather again. Always feeling that the two guys wearing hats beside the instructor were familiar, Wei Han in the back ranks narrowed his eyes to carefully lookー</p><br/><p>Fuck! How did Odd Trouble and Foolish Man-Sheep come here?!</p><div><div></div></div><br/>\n</div>"}