{"title": "Chapter 28", "id": 28, "volume": 1, "url": "http://boxnovel.org/its-not-easy-being-your-love-rivals-big-brother-chapter-28", "volume_title": "Volume 1", "body": "<h1>Chapter 28</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Translator: Mosstree</p><br/><p><strong>T/N:</strong> About the last chapter, I’d checked several sites, and they still had the same content. His talk with Jiang Chengrui explained what happened the night before, but my best guess is that it happened off-screen.</p><br/><p><strong>Chapter 28</strong></p><br/><p>“……”</p><br/><p>Under the hips, the cold wind blew. Qi Zhifan bowed his head, a pair of gloomy and icy eyes staring unwaveringly at Wei Han below.</p><br/><p>Looking at the lump of white in his own hand, Wei Han hurriedly looked up and couldn’t avoid it. He saw a terrible, large-scale restricted image.</p><br/><p>Facing Qi Zhifan, that big plaything that exuded a strong male scent was long and bulging. Wei Han’s pair of big, innocent eyes blinked, blanking for a full five seconds…</p><br/><p>“Ah…ah, sor…sorry! I’m sorry!”</p><br/><p>After recovering, Wei Han hurriedly put the towel around Qi Zhifan’s waist again. But because he was too tense, Wei Han was clumsy. As a result, he didn’t tie it tightly enough and the towel slipped down again.</p><br/><p>“Uh…” Wei Han’s face couldn’t help reddening. He bent over and was about to pick it up again when his hand was held by Qi Zhifan.</p><br/><p>Wei Han stared blankly, still too overloaded to react, when suddenlyー</p><br/><p>“What are you doing!”</p><br/><p>Behind him, Jiang Chengrui’s voice suddenly came out. Startled, Wei Han quickly used both hands to block in front of Qi Zhifan. After all, his little brother was still naked. As an older brother, he couldn’t allow him to appear naked.</p><br/><p>“Hey, in broad daylight, don’t tell me you are…” soaked well in the bath, Pei Yuyang also came out from the opposite end at this time. One look at this situation, and he couldn’t help but be blindsided.</p><br/><p>“……” Qi Zhifan’s line of sight went to Wei Han’s hands again.</p><br/><p>Wei Han foolishly blanked, looked down and found that his hands, neither higher nor lower, was exactly stuck on the shameful, protruding part between Qi Zhifan’s legs…</p><br/><p>Holy fucking hell, his heart wanted to die in this moment ah!</p><hr/><br/><p>In the evening, everyone rested in the hotel between the mountains. Qi Zhifan and Pei Yuyang were in one room, while Wei Han, Jiang Chengrui, and Chu Chuanyao were in a three-person family guestroom.</p><br/><p>Taking advantage of the interval when Chu Chuanyao was bathing, Wei Han pulled Jiang Chengrui over and whispered, “Little Jiang, please, don’t tell Little Yao about what just happened in the hot springs.”</p><br/><p>Jiang Chengrui made an OK gesture. “You can rest assured. Anyway, that  thing that you just did, even if I wanted to say it, I also can’t say it out loud ah.”</p><br/><p>Wei Han: “……”</p><br/><p>“Right, you’d best also inform Pei Yuyang as well, in case he let it slip,” Jiang Chengrui also kindly reminded.</p><br/><p>Wei Han waved his hand, not the least bit worried. “He wouldn’t dare. Do you think that with Qi Zhifan there, he’d let him say even half a word?”</p><br/><p>“That’s true,” Jiang Chengrui nodded. Seeing Wei Han had a worried frown, he couldn’t help but say, “Hey, Silly Han, I found that once you get involved with Qi Zhifan’s matters, your IQ goes offline, you become silly till you forget yourself, and it can be said to be a super silly prodigy.”</p><br/><p>The corner of Wei Han’s mouth pulled out twice. “…I’m really that silly?”</p><br/><p>“Honestly, yes. Silly Han, do you have any shadow over you because of Qi Zhifan?”</p><br/><p>“Uh, maybe a little.”</p><br/><p>Wei Han thought for a moment, ai, perhaps this was the shadow of his past life. But after such a long time had passed, he and Odd Trouble had quarreled and fought, and even those misunderstandings that had flooded his brain had also passed. Now, they got along pretty well.</p><br/><p>At the same time, Qi Zhifan and Pei Yuyang were in the other room.</p><br/><p>Pei Yuyang rolled around laughing on the bed, “Hahaha, laughing to death. Your brother is really a silly but amusing person ah!”</p><br/><p>His laughter caused the veins on Qi Zhifan’s forehead to jump. “You now look like a fool too.”</p><br/><p>Pei Yuyang sat up and pointed at Qi Zhifan’s lower body. He smiled lewdly, “Ah Fan, what did Wei Han just do…haha, did he touch that?”</p><br/><p>“What do you think?” Qi Zhifan coldly pulled his lips.</p><br/><p>“I think brothers are very cute ah, why don’t you just accept him? Haha. I remember that didn’t you have a period of time when you were reading brothers text? That ‘Overbearing Younger Brother Fell in Love with Me’?”</p><div><div></div></div><br/><p>Pei Yuyang casually joked, originally thinking to tease Qi Zhifan. Who knew that the light in Qi Zhifan’s pupils would shine, and the corners of his lips instantly rose. “That was written about me and Wei Han.”</p><br/><p>Pei Yuyang: “Ah?!”</p><br/><p>“Ah Fan, is there something wrong with your eyes? Can’t you see that Wei Han likes that Chu Chuanyao and has been chasing him?”</p><br/><p>Qi Zhifan, unconcerned: “He chases his, and I chase mine.”</p><br/><p>“……” Pei Yuyang was startled again. The next second, he grabbed Qi Zhifan’s phone on the bedside and quickly scrolled through. When he saw the three characters “Stomach Cold” in the address book, he couldn’t help but smack his lips.</p><br/><p>“Tsk tsk, this matter is really serious ah.”</p><br/><p>In Pei Yuyang’s understanding, Qi Zhifan was serious to death in some aspects. He had been with him for more than three years, and Qi Zhifan wasn’t nicknaming him “Pervert”, but was using it as a suitable name for him. In his impression, Qi Zhifan almost never gave anyone a nickname. In the cell phone address book, one by one, regardless of gender, all the names were regular and proper names, all except this special “Stomach Cold”.</p><br/><p>“Ah Fan, do you really like him?”</p><br/><p>Putting away his thoughts of teasing, Pei Yuyang asked him seriously. It’s also no wonder that after Qi Zhifan investigated Chu Chuanyao last time, there had been no movement.</p><br/><p>“……” Qi Zhifan didn’t say anything, which could be considered as tacitly agreeing.</p><br/><p>Recalling Qi Zhifan’s words, deeds and attitude toward Wei Han, Pei Yuyang smiled. It seemed that Qi Zhifan was finally out of Ou Yizhe’s shadow. This time, he didn’t choose Chu Chuanyao who resembled Ou Yizhe, but wanted to pursue the seemingly dim-witted Wei Han.</p><br/><p>“Since it’s like this, ai, Ah Fan, were you being silly in the hot springs before? That was such a good chance; you should have made a decisive move and held Wei Han’s hand directly on top of that place ah, and let him properly feel you.”</p><br/><p>Qi Zhifan: “……”</p><hr/><br/><p>At dawn around 5 o’clock, Wei Han had already gotten up from bed. Today, he woke up surprisingly early, or it could be said that he hadn’t slept last night.</p><br/><p>Because as long as Wei Han closed his eyes, his mind was full of discordant images. That colossus under Qi Zhifan’s body and his fine face were completely different: it looked so fierce ah!</p><br/><p>Regardless of men or women, ordinary people seeing this would probably all smoke at the mouth, legs go soft, and want to kneel ah.</p><br/><p>Wei Han patted his head and tried hard to take these messy things out of his mind. He took a few deep breaths and looked at the bed next to him, where Chu Chuanyao was.</p><br/><p>Strange, clearly his Little Yao was sleeping next to him, and yet, Wei Han didn’t feel as excited or moved as he’d imagined.</p><br/><p>Not wanting to disturb Jiang Chengrui and Chu Chuanyao, Wei Han quietly got out of bed and squatted down by Chu Chuanyao’s bedside, quietly watching the only boy he’d loved in his previous life.</p><br/><p>Chu Chuanyao had no bad habits. He didn’t grind his teeth when he sleeps, didn’t snore, nor did he talk in his sleep, quite docile and lovable. Just looking let people’s hearts be at peace.</p><br/><p>Wei Han wanted to touch Chu Chuanyao’s cheek and reached out his hand halfway, but stopped. Different from the past life, they were now only friends. Chu Chuanyao only liked Teacher Dong and would mention her whenever there’s nothing else. Even the cell phone screen was that woman.</p><br/><p>Ai, he liked Little Yao and hoped Little Yao was happy. If some things really didn’t come, if Chu Chuanyao really ended up with the female teacher, he could only smile and bless it.</p><br/><p>Thinking to here, Wei Han shook his head. He couldn’t be so negative. Chasing Chu Chuanyao was good. Becoming a police officer was also good. The revolution had not yet succeeded; comrade still must strive hard.</p><br/><p>Finally, Wei Han covered Chu Chuanyao with a quilt, washed up a bit, and went out for a run alone.</p><br/><p>Morning in the mountains, the dew was still a little heavy. But Wei Han, exercising while thinking about life, didn’t feel it much. When Wei Han returned from his early morning run, it was already seven o’clock. He touched the slight sweat on his forehead and saw Qi Zhifan standing in front of hotel.</p><div><div></div></div><br/><p>Seeing him from the distance, it reminded Wei Han of the terrible thing under Qi Zhifan.</p><br/><p>“Hi, Qi Zhifan, morning ah,” Wei Han tried to squeeze out a natural smile to call out a greeting, but his eyes were always to the side, for fear of seeing the bulge in his crotch.</p><br/><p>Qi Zhifan took in the embarrassment in Wei Han’s little eyes, and laughed at the bottom of his heart. He moved closer to him. “Going out early in the morning to run, were you too excited from yesterday because you saw my…”</p><br/><p>“Nonsense! I…I didn’t see anything. You’re thinking too much,” Wei Han hurriedly interrupted his words, turning his head to quibble.</p><br/><p>Qi Zhifan smiled and did not speak. Suddenly, he took hold of Wei Han’s hand. “Wei Han, don’t like Chu Chuanyao.”</p><br/><p>Wei Han: “Ah?”</p><br/><p>Early in the morning, Odd Trouble was still not awake and talking nonsense?</p><br/><p>“Big Brother Wei, Senior Qi, quickly come over for breakfast,” at this time, Chu Chuanyao called both of them.</p><br/><p>“Big Brother Wei, I also specially bought you a big bowl of preserved egg and meat porridge.”</p><br/><p>Chu Chuanyao emphasized this sentence. Once Wei Han heard this, he immediately pulled out his hand and was all smiles as he ran over, completely not realizing that Qi Zhifan’s face had sunk down in an instant.</p><hr/><br/><p>The time flew quickly, and most of the winter vacation had passed. In the blink of an eye, it would be the end of the year. Generally at this time, there were more or less some marriages and weddings among the friends and family. The news that Teacher Dong was quitting and getting married also came out. Chu Chuanyao was naturally brokenhearted.</p><br/><p>This day, Wei Han stayed with Chu Chuanyao the whole day to comfort the crushed Chu Chuanyao.</p><br/><p>Seeing Chu Chuanyao continuously drinking to numb himself, Wei Han hastened to stop it. “Little Yao, don’t be too sad. There would always be more grass in the wide world. Although you and Teacher Dong were not destined to be, but perhaps you will meet better people in the future ah.”</p><br/><p>In fact, Wei Han wanted to say that he was the better and more suitable person for him.</p><br/><p>Chu Chuanyao was a bit drunk and shook his head. His voice was full of despair. “Big Brother Wei, don’t…don’t console me. I…I don’t believe in love anymore.”</p><br/><p>Wei Han: “……”</p><br/><p>God, ah, was this playing him to death? In the beginning, Little Yao was absolutely infatuated, and now he’s completely given up.</p><br/><p>“Calm…calm down ah. Little Yao, you mustn’t think so. You have to believe that there will be such a person. He will make you believe in love again.”</p><br/><p>“Big Brother Wei, you…” Chu Chuanyao stared blankly, looking carefully at Wei Han’s firm eyes with his own misty eyes, wanting to say something but then hesitating.</p><br/><p>Wei Han straightened his face and suddenly felt a bit nervous and agitated. Did Little Yao finally see him? Did he finally realize that he was that good man?</p><br/><p>“You…how did you become several people? One, two, three…” Chu Chuanyao foolishly counted and then passed out.</p><br/><p>Wei Han: “……”</p><br/><p>During the winter vacation, Chu Chuanyao didn’t return to his home, but instead, stayed at an aunt’s house on this side of S City. At 10 o’clock in the evening, Wei Han sent the drunk Chu Chuanyao safely back and received a message from Qi Zhifan.</p><br/><p>Odd Trouble【Hello, what time is it? Still not hurrying home】</p><br/><p>Stomach Cold【Yeah, yeah, I’ll return right away】</p><br/><p>11 o’clock, Wei Han’s cell phone vibrated again.</p><br/><p>Odd Trouble【How come you haven’t arrived yet? What are you dawdling around for】</p><br/><p>Stomach Cold【I’m back ah, on the roof】</p><br/><p>Because Wei Han also drank some alcohol, if he laid down and went to sleep directly, he’d certainly have a headache the next day. In order to make himself sober up a little, he didn’t hurry to enter the house. Instead, he went directly to the top of the building in the residential area with the cold breeze blowing on the rooftop.</p><br/><p>After Wei Han returned Qi Zhifan’s text, not a moment later, Qi Zhifan came up. As soon as he got there, he threw a scarf to Wei Han.</p><br/><p>“It’s winter. When you go out, you don’t even wear a scarf. And it’s so late, you’re still on the rooftop feeling the breeze. Do you have a pit in your head?”</p><div><div></div></div><br/>\n</div>"}