{"title": "Chapter 41", "id": 41, "volume": 1, "url": "http://boxnovel.org/its-not-easy-being-your-love-rivals-big-brother-chapter-41", "volume_title": "Volume 1", "body": "<h1>Chapter 41</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Translator: Mosstree</p><br/><p><strong>Chapter 41: Older Brother's Bright Red Ass</strong></p><br/><p>After the police investigated the incident of President Wang’s attack, it was discovered that a few years ago, President Wang had stolen the work of other small companies and gained huge benefits. He had also caused other people’s families to become destitute and homeless, and the assaulter surnamed Zhou was the youngest son of one of the surviving families.</p><br/><p>As soon as the scandal broke out, Qi’ao Enterprise suddenly ushered in a series of problems such as falling stock prices, stagnant sales and insufficient working capital. President Zong, who was still lying in the hospital, had picked up his life but suddenly owed a large amount of debt.</p><br/><p>Regarding this case, although the dust had basically settled, it was still necessary to do some subsequent processing. This day, Wei Han came to the Leng Group office building to request Leng Yan to cooperate with him and make some statements.</p><br/><p>“Six…oh, no, Mr. Leng, what’s your opinion on Qi’ao’s matters this time?” Wei Han asked.</p><br/><p>“Deserved it.”</p><br/><p>Not even lifting his eyes from reviewing the files, Leng Yan only coldly threw down these two words.</p><br/><p>“Uh…” Wei Han slightly blanked and couldn’t help but silently curse in his heart: Leng Yan? His outer appearance, cold words and cold speech really deserved his name. <sup> [1]</sup></p><br/><p>“President Leng, you’ve been reluctant to cooperate with Qi’ao Enterprise before. Was it because you’ve long seen that they had problems?”</p><br/><p>At this time, Little Wen beside the door asked in a respectful tone. Little Wen was the male secretary who was approximately thirty-something, wore glasses, looked elegant, and based on his tone, seemed to be quite worshipful of his boss.</p><br/><p>“Yeah.”</p><br/><p>“You really are wise and brilliant.” Little Wen smiled, but suddenly had something he was unable to figure out. “But why did you go the masquerade that night? It was so dangerous. What if you’d accidentally hurt yourself?”</p><br/><p>Leng Yan disagreed, “It was just going to watch the liveliness.”</p><br/><p>Little Wen: “……”</p><br/><p>Wei Han: “……”</p><br/><p>Afterwards, Leng Yan gave Wei Han a profound glance and temporarily cancelled the morning meeting, but also changed the appointment with the other bosses. Little Wen hadn’t had a chance to respond yet when he coldly commanded Little Wen to do some new tasks.</p><br/><p>During the process, Leng Yan’s face was expressionless and his words were astonishing, making Wei Han foolish when he saw this. This seemed like that mental case “Six Hot”. Could it be that Leng Yan had dual personality?</p><br/><p>“Wei Han,” Leng Yan called him.</p><br/><p>“Yes!”</p><br/><p>Deeply-awed, Wei Han’s spirit returned and he shouted out.</p><br/><p>“I’ll give you a gift.”</p><br/><p>“Ah?” Wei Han awkwardly smiled. “Giving someone a gift without rhyme or reason, it’s rather embarrassing to accept. Money is mere worldly possessions.”</p><br/><p>“Gifting books.”</p><br/><p>Wei Han: “……”</p><br/><p>Uh, this seemed to be acceptable. They could increase knowledge and cultivate one’s mind. And, he was also looking forward to what kind of books Leng Yan would gift him.</p><br/><p>However, he never thought that President Leng wouldn’t go to a normal bookstore, but drove all the way to a 2D store that sold all kinds of comics, games and anime.</p><br/><p>Wei Han: “……”</p><br/><p>Fuck, something must have gone wrong somewhere?</p><br/><p>Leng Yan took him over to the Danmei District, and then unselfconsciously browsed through the manhua. The first time coming to this kind of store, Wei Han was in a daze, mouth gaping open for a long time without closing.</p><br/><p>At this time not far away, a long-haired younger sister blew her top, “Ah ah ah, this book was clearly 90% sweet in front. Why did it finally turn around like this? Suddenly a big abuse ah!”</p><br/><p>Next to her, a short-haired younger sister covered her heart, “Ai, it’s another <strong>BE</strong>.<sup> [2]</sup> I’m not going to love anymore.”</p><br/><p>The long-haired younger sister kept nodding and said, “Yes ah, fancy that I still thought this book would be Great Hot’s ‘leaving his trade and marrying off’ work. And then it went on like this, I awfully want to turn from a devoted fan and blacken into an anti-fan.”</p><br/><p>“Love falling into the abyss is naturally black. Great Hot has never lacked anti-fans. Anyway, as soon as he releases a new book, there would be a flock of people stepping into the breach to replace the fallen comrades to read it.”</p><br/><p>Long-haired younger sister wiped the corner of her eyes. “Ying-ying baby, Great Hot abused me thousands of times, but I still love Great Hot as before.”</p><br/><p>“Well, people still want to have dreams. What if it’s realized? I believe that one day, Great Hot would produce a HE<sup> [2]</sup> book,” the short-haired younger sister comforted.</p><br/><p>“Mhm.”</p><br/><p>“I feel that those two sisters were very miserable. Ai, the author is really hard-hearted. Don’t know what book they’re talking about?”</p><br/><p>Wei Han muttered in a low voice, but unexpectedly, Leng Yan heard it. He took a book and handed it to Wei Han. “This book. I wrote it.”</p><br/><p>Wei Han’s hand that was holding the book couldn’t help but shake: “……”</p><br/><p>Fuck, what was this situation?</p><br/><p>Wei Han looked down and saw the literary and classy book name, “Raucous”, then the author’s name…a “Hot” word.</p><br/><p>In a flash, he thought of “Hot Hot Hot Hot Hot Hot”, this ID. It seemed that it was really a book written by “Six Hot”.</p><div><div></div></div><br/><p>“Give to you.”</p><br/><p>Wei Han: “……”</p><br/><p>Dang! It turned out that what Leng Yan wanted to gift him was unexpectedly this kind of book!</p><br/><p>In one day, Wei Han’s three views had been attacked countless times.</p><br/><p>How would he know that Leng Yan was this kind of weirdo? Not only the yellow-storm mental case in the same-sex dating forum, but also the reticent and grim president, but also a great god danmei writer.</p><br/><p>Wei Han went on the internet and searched for “Hot” works, and then clicked into a certain literature network. He found that his books were ranked among the best gold list, and there was a rather stupid “Emperor of Abuse” title, hehe.</p><br/><p>Browsing through the comments in the comment area under each book, regardless of whether the readers praised him, scolded him, or gave him a several thousands words lengthy criticism and tearful complaints, but at the end without exception, every single one of Leng Yan’s replies were all <i>“mwah mwah” </i><sup> [3]</sup></p><br/><p>Wei Han: “……”</p><br/><p>“Wei Han, what are you doing?”</p><br/><p>Suddenly, Qi Zhifan’s voice came from behind him, truly making Wei Han jump in fright.</p><br/><p><i>Bam</i>! Wei Han immediately closed the computer and pretended to be the same as a person with nothing the matter, “Not…not doing anything. Just checking information.”</p><br/><p>Qi Zhifan looked at him incredulously and looked down at the book Wei Han had placed on the table. On the cover were two embracing men. He was thinking of reaching out and taking it, but the next second, Wei Han suddenly took it and hid it behind his back.</p><br/><p>Qi Zhifan slightly frowned. “Tch, why are you trying to hide it? There’s nothing strange about reading this kind of books. I also read them.”</p><br/><p>“Ah? You actually also…” Wei Han was shocked.</p><br/><p>Qi Zhifan shrugged. “It’s fanfiction written about the two of us. What, do you want me to recommend you a few to read?”</p><br/><p>Their fanfiction? In Wei Han’s mind, those terrible titles emerged: “Overbearing Younger Brother Fell in Love with Me,” “Outrageous Younger Brother Don’t Provoke Me,” and “High Society Young Master’s Private Pet Brother,” “Loving Older Brother Excessively,” “Black-Bellied Younger Brother’s Pit the Brother Plan” …</p><br/><p>Fuck me ah, Wei Han almost spat out a mouthful of old blood!</p><br/><p>“Thanks, no need.”</p><br/><p>Two days later, Jiang Chengrui was discharged from the hospital and because Pei Yuyang was always there to take care of him, Wei Han didn’t feel like being a light bulb and hurriedly beat it.</p><br/><p>At night, he would be on duty while Qi Zhifan was still in school. After seeing that he had a little idle time for the rest of the afternoon, Wei Han invited Leng Yan out to eat.</p><br/><p>“Something?”</p><br/><p>Seeing Wei Han’s hesitant appearance obviously with something to say, Leng Yan didn’t beat around the bush and directly asked.</p><br/><p>“Yeah, that, Leng Yan, I wanted to tell you…”</p><br/><p>“Wait,” Leng Yan interrupted him. He quickly tapped a few times on the phone with his fingers and typed out a sentence【I’d still like you to call me “Six Hot”】</p><br/><p>Wei Han’s brain was stupid for a moment before he nodded. “Okay, Six Hot. Can you write a good ending in the next book?”</p><br/><p>Leng Yan’s books, Wei Han had stayed up late to read in recent days. Every time he read them, his eyes moistened and his heart tangled: too fucking abusive! But it happened to make people unable to stop oneself and was absolutely the rhythm of the revenge society.</p><br/><p>Leng Yan was slightly startled, and quickly put two lines of words on his phone【Stomach Hot, my inspirations are from life, my novels are based on reality】</p><br/><p>“So it was like this ah. Six Hot, it turns out that so many miserable things happened around you.” Wei Han suddenly was a little sympathetic towards Leng Yan. He really couldn’t tell that this kind of tall, rich and handsome guy’s love history would be so bumpy.</p><br/><p>Seeing Wei Han had obviously misunderstood, Leng Yan shook his head.【In reality, the protagonists are all together. Contrary to the novel’s endings, the cannon fodder is always me.】</p><br/><p>“……”</p><br/><p>Wei Han literally swallowed back the tears of sympathy. Six Hot really was Six Hot, the mental case that he knew ah.</p><br/><p>“Your novels really can’t be HE once?”</p><br/><p>Leng Yan【When I find true love】</p><br/><p>“Uh…” Wei Han suddenly was somewhat speechless. “Right, Six Hot, you…do you have the legendary speech impediment? This illness must be treated ah.”</p><br/><p>Leng Yan didn’t speak very much. Every time he wanted to express a complete idea, he could only use written words. So he could write novels, also play a large number of words in the forum, and from time to time, use emoticons to sell <i>meng</i>, but in life, he’s reticent with little words.</p><br/><p>Wei Han could be said to have understood now. This absolutely wasn’t a light illness.</p><br/><p>“Can’t be cured.” Leng Yan shook his head.</p><br/><p>“No, you are so rich, you can’t give up treatment,” Wei Han continued to persuade patiently.</p><br/><p>“Useless.” Leng Yan suddenly looked more frustrated, and he tapped out a few words on his mobile phone【Need to meet true love to be save】</p><br/><p>“……”</p><br/><p>Regarding Leng Yan’s weirdo logic, Wei Han couldn’t express his sincere understanding.</p><br/><p>At this time, Wei Han didn’t know that outside the glass wall of the shop, Qi Zhifan was staring at them from afar. His eyes were burning; his stare was as if he wanted to burn a hole into Leng Yan’s back.</p><div><div></div></div><br/><p>This afternoon, Qi Zhifan left school early and was preparing to go home to accompany Wei Han. Who knew that it would let him see Wei Han eating together with another man.</p><br/><p>From his angle, he couldn’t see Leng Yan’s face because Leng Yan’s back was to him. Qi Zhifan temporarily didn’t want to beat the grass and scare the snake. His intuition told him that Pei Yuyang should know a bit about this situation, so he immediately gave him a call.</p><br/><p>“Good Ah Fan, what’s wrong?”</p><br/><p>“Apart from Jiang Chengrui, which man was Wei Han in most contact with these days?”</p><br/><p>Qi Zhifan was able to sense that since Wei Han came back from the masquerade, his behavior was strange. In addition to the reason that Jiang Chengrui was injured, it should be related to the man he was eating with now.</p><br/><p>Pei Yuyang was a bit at a loss. “You, eh.”</p><br/><p>“Beside me.”</p><br/><p>“Then let me think…” Pei Yuyang thought for a moment. “Right, Leng Yan.”</p><br/><p>“Leng Yan?” Qi Zhifan ground these two words between his teeth.</p><br/><p>“Leng Group’s current president. I remember that when he first saw Wei Han, tsk tsk, he suddenly raised Wei Han up high above his head. Very…magnificent and powerful! Didn’t Wei Han mention it to you? Heー”</p><br/><p>His words hadn’t yet finished when Qi Zhifan had already hung up.</p><br/><p>“What’s wrong? I thought I heard Silly Han’s name. Who called?” Jiang Chengrui, lying in bed, looked up and asked.</p><br/><p>“It’s Ah Fan. Alas, I seemed to have said something I shouldn’t have. It’s estimated that Wei Han’s chrysanthemum is going to suffer tonight.”</p><br/><p>In the evening, Wei Han pushed the door to the villa’s rear court and saw Qi Zhifan sitting alone on the sofa, surrounded by a layer of low pressure. His face was covered with dense, black clouds that seemed like it could thunder and lightning at any time.</p><br/><p>“Odd…Odd Trouble?” Wei Han was a little stunned, still not knowing that a great catastrophe would soon befall on him.</p><br/><p>“Come here,” Qi Zhifan coldly spat out the two words.</p><br/><p>“Oh.”</p><br/><p>Wei Han nodded and obediently walked over. When Qi Zhifan was in a bad mood, going along with his intentions was the best way to avoid suffering more torment.</p><br/><p>“Take off your pants,” Qi Zhifan coldly gave another order.</p><br/><p>“Ah?!” Wei Han was scared, tightening his belt instead. “No, Odd Trouble, calm down. Be mindful of moral principles.”</p><br/><p>The forehead veins jumped. Qi Zhifan said impatiently, “I’ll give you three seconds. If you don’t take it off, I will help you take it off.”</p><br/><p>“I’ll take it off.”</p><br/><p>Then, Wei Han bit the bullet and undid his belt, and bit by bit, took off the outside pants and exposed the blue boxer shorts inside.</p><br/><p>Qi Zhifan’s Adam’s apple moved and he dragged him over and made him lie down on his lap. His big hand faced his butt and gave a heavy pinch.</p><br/><p>Wei Han immediately hurt till the corners of his mouth pulled, and he panicked, “Odd Trouble, you…what the hell is up with you? Why are you angry?”</p><br/><p>“Because you did wrong.”</p><br/><p>“Me? Ai, I didn’t. Don’t wrongly accuse me.” Wei Han immediately shook his head.</p><br/><p>Fooling around with another man behind his back, this fool actually didn’t realize it at all! Qi Zhifan was even angrier. He immediately pulled down the boxer shorts, and with a “<i>pa</i>“, slapped his naked butt.</p><br/><p>“Ah!” Wei Han immediately felt the pain and shouted out, expressing that he was really innocent ah.</p><br/><p>“Did you ever do anything wrong? I’ll ask you a few questions and it’ll become very clear.” Qi Zhifan slightly narrowed his eyes.</p><br/><p>“In recent days, beside me and Jiang Chengrui, who did you spend the most time with?”</p><br/><p>When this was said, Wei Han subconsciously thought of Leng Yan and stammered, “This…even if I said it, you…you wouldn’t know ah.”</p><br/><p>“Leng Yan?”</p><br/><p>Wei Han was startled. “Ahh? Odd Trouble, how did you…”</p><br/><p>“Is it?” Qi Zhifan pressed.</p><br/><p>“Yes,” Wei Han weakly said.</p><br/><p>“<i>pa</i>!” Qi Zhifan smacked down again.</p><br/><p>“Who do you chat with every night before going to bed?”</p><br/><p>“Uh, Leng…Leng Yan.”</p><br/><p>“<i>pa pa</i>!” Two more slaps followed.</p><br/><p>“The novels you read until you tear up, who wrote those?”</p><br/><p>“Leng Yan.”</p><br/><p>“<i>pa pa pa</i>!”</p><br/><p>Looking at Wei Han entire red, upturned butt that was completely covered in his palm prints, the look in Qi Zhifan’s pupils became quieter with something pulsing in his eyes.</p><br/><p>Odd Trouble, what kind of vinegar are you eating ah? Wei Han a little wanting to weep without tears explained, “Odd Trouble, listen to me. There’s really nothing between me and him. We’re just bosom buddies…<i>nn ah</i>!</p><br/><p>Who knew that, when he’d only said half his words, there would be a sense of discomfort from having a foreign object invade his body: Qi Zhifan had inserted a finger into his behind.</p><br/><p><strong>Notes</strong></p><ul><li>1. ‘Leng’ literally means ‘cold’.</li><li>2. <strong>BE </strong>stands for ‘bad ending’. <strong>HE </strong>stands for ‘happy ending’. This novel is HE ~</li><li>3. <em>mwah mwah:</em> kissing sound</li></ul><hr/><div><div></div></div><br/>\n</div>"}