{"title": "Chapter 44", "id": 44, "volume": 1, "url": "http://boxnovel.org/its-not-easy-being-your-love-rivals-big-brother-chapter-44", "volume_title": "Volume 1", "body": "<h1>Chapter 44</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Translator: Mosstree</p><br/><p><strong>Chapter 44: Fighting is Intimacy, Scolding is Love</strong></p><br/><p>Recently, Qi Zhifan’s lawyer work slowly got on the right track, and he also became busy.</p><br/><p>He had strong working capability and soon served as legal counsel for many companies. Last week, he had just finished writing a will for a boss’s transfer of property, and this week, he was preparing to defend the defendant in a criminal case.</p><br/><p>At six o’clock, looking at the mess of information on the table, Qi Zhifan pinched the area between his brows. He was trying to call Wei Han to tell him that he might have to work overtime tonight. Who knew that in the next second, Jiang Chengrui would call over.</p><br/><p>At seven o’clock in the evening, Qi Zhifan drove to the hospital. On hearing the news of Wei Han’s injury, Qi Zhifan immediately set aside his work and rushed over from the law firm.</p><br/><p>When Jiang Chengrui outside of the ward saw Qi Zhifan, he pointed inside. “You came at just the right time. Wei Han just woke up inside.”</p><br/><p>Qi Zhifan nodded at him, pushed the door and entered.</p><br/><p>When Qi Zhifan came in, Shao Yi, who’d originally been taking care of Wei Han, gave him a cold look, but still tactfully stood up and prepared to leave.</p><br/><p>“Wei Han, although nothing big happened to you, but you also should force yourself too much,” Shao Yi said before leaving.</p><br/><p>“Yeah, thank you. Shao Yi, you should go back first with Little Jiang.”</p><br/><p>“Okay.”</p><br/><p>Qi Zhifan, with a calm and collected face, slowly walked to Wei Han’s bedside. He reached out and lifted Wei Han’s bangs slightly to check the injury on his forehead. He also wanted to touch it, but he withdrew for fear of hurting Wei Han.</p><br/><p>Listening to what Jiang Chengrui had said, they had an emergency operation this afternoon, and Wei Han had fought with several gangsters. In addition to his skin and body injuries, his head was also struck by a few sticks. Finally subduing the gangsters, Wei Han directly fainted with a heavily bleeding forehead.</p><br/><p>Now, Wei Han’s forehead was sewn with several stitches and wrapped with a layer of gauze. Qi Zhifan was clear that if it was handled poorly, it’d be easy to leave behind a scar later.</p><br/><p>Seeing that Qi Zhifan was not saying a word and was staring at the wound on his head for a long time, Wei Han said weakly, “Odd Trouble, don’t worry. It’s a minor injury and I can be discharged tomorrow. Actually, you didn’t need to come over here.”</p><br/><p>“Do you think I want to come over? I hate hospitals, this kind of ghost place! Before, my dad also frequently had accidents. I don’t know how many times my mom had brought me! Wei Han, you’re already ugly enough, now do you want to be disfigured!” Qi Zhifan suddenly and extremely angrily scolded, scolding Wei Han until he was in a daze.</p><br/><p>The sentence Wei Han had said before was only because he hadn’t wanted to make Qi Zhifan worry too much. Who knew that it would aggravate him instead.</p><br/><p>Looking at Qi Zhifan’s strained face, Wei Han thought that no matter formidable he was, he was also only twenty-two years old. When he was in a bad mood, of course he’d say some angry words. So he stretched out his hand from the quilt and covered Qi Zhifan’s tightly clenched fist with his palm.</p><br/><p>Qi Zhifan was slightly startled, and also realized that he was too fierce just now. He was just about to open his mouth, “Wei Han, I…”</p><br/><p>“I’m sorry, I didn’t take care of myself.” Wei Han’s face was filled with sincerity. His wan lips still held a trace of a smile, a smile that made Qi Zhifan suddenly lose all of his anger.</p><br/><p>He grasped Wei Han’s hand and leaned over to gently kiss Wei Han’s lips with the utmost, silent tenderness…</p><br/><p>“Odd Trouble, it’s okay if I’m a bit uglier. A man with a few scars is cooler! After all, I’m not like you, relying on your face to eat.”</p><br/><p>Qi Zhifan’s brows creased. “Hmm?”</p><br/><p>“No no no, I didn’t mean anything. What I meant to say is: Odd Trouble, you’re this good-looking that you can completely rely on your face to eat. This is definitely praising you ah.”</p><br/><p>“…it’s better if you stop talking.”</p><br/><p>After Wei Han was discharged from the hospital, Qi Zhifan began to pay special attention to his body, especially the scar on his forehead. On one hand, he paid attention to cleansing Wei Han’s skin, and on the other, he watched his diet strictly and didn’t allow Wei Han to have even a bit of spicy, stimulating, or greasy food. Alcohol and tobacco were even more out of the question.</p><br/><p>At the same time, Qi Zhifan also applied the scar removal ointment for Wei Han to help lessen the scar. For this reason, he also studied how to improved the blood circulation by means of health massages to reduce the scars, so Qi Zhifan also tried to give Wei Han a press knead.</p><div><div></div></div><br/><p>Although temporarily being unable to eat a lot of delicious food, Wei Han suffered a little, but everyday with a “beauty” by his side who was specially dedicated to giving him massages, Wei Han, Lord Wei, enjoyed being served by Qi Zhifan and it could be said that his mood was still very comfortable, haha.</p><br/><p>Finally, with Qi Zhifan’s meticulous care, Wei Han’s forehead scar was actually a lot lighter. If he didn’t lift his bangs and look closely, it couldn’t be seen at all.</p><br/><p>However, it wasn’t long before Wei Han’s leg was injured. Fortunately, he hadn’t broken any bones, or else he’d have to lie in the hospitals for several months and couldn’t easily move around.</p><br/><p>Qi Zhifan saw that Wei Han’s injury clearly hadn’t been completely healed yet before he excitedly ran over to the bureau to work, and his brows tightly locked. Instead, he would rather that Wei Han had broken his bone this time. This way, he could take a good rest for a few months without going to torment his own body again.</p><br/><p>Recently, he’d admired his own mother and Mother Wei even more. What kind of mentality must they have to face their lover being hurt from time to time?</p><br/><p>“Do you really take good care of yourself?” Qi Zhifan asked angrily.</p><br/><p>Wei Han nodded and explained, “Every time, I protect the key parts: my head, neck, and heart. I try not to let myself suffer too serious an injury that it’d endanger my life. But small injuries…ai, Odd Trouble, injuries are the police’s potluck. Our belief in the police is that even if we break our hands or feet, we must continue to punish evil and promote good!”</p><br/><p>“If you fucking break your hands, break your feet, what do you want me to do?” Qi Zhifan mercilessly stared at Wei Han and then said, “The bureau should have other work. Later on, it’d be better if you take less outside missions.”</p><br/><p>“This…”</p><br/><p>Wei Han’s heart knew very well that his skills were far less than Little Jiang and Shao Yi. But they were also police officers of the same period and still young. Since they both can go out on missions, Wei Han also didn’t want to be too timid and always visit what neighborhood committee to deal with some trivial matters such as whose motorcycle got stolen, residents complaining that the noise was too loud, and couples in the district fighting late at night…</p><br/><p>“What’s wrong?” Seeing Wei Han a little dazed, Qi Zhifan asked.</p><br/><p>Wei Han actually wanted to shake his head, but he was afraid that Qi Zhifan would get angry and worried, so he nodded. “Oh, I will.”</p><br/><p>The next day, Wei Han had just arrived at the bureau, but his butt hadn’t warmed the seat yet when he was taken out by the ashen-faced Sergeant Lu. They got into the police car and drove all the way to the door of the Traffic Police Brigade.</p><br/><p>The two got out of the car and there was immediately someone who came out on this side. The male traffic police officer looked Wei Han up and down and asked, “He’s Wei Han?”</p><br/><p>“Yeah,” Leader Lu answered, heavily patting Wei Han and sneered, “Little Wei, you remember to direct traffic well.”</p><br/><p>Finished talking, Sergeant Lu turned around and wanted to leave.</p><br/><p>“W…wait! Leader Lu, what’s this about?” Wei Han was stupefied and quite unclear.</p><br/><p>“Heh, aren’t you asking a question when you already know? Aren’t you just relying on the fact that you have someone above?”</p><br/><p>Sergeant Lu laughed at him mockingly. To think that he’d already forgiven Wei Han for going AWOL last year, and his impression of Wei Han had improved a lot. He hadn’t expected that now, Wei Han had only suffered a few small injuries, couldn’t take the hardship, and used the power at the top again.</p><br/><p>Wei Han straightforwardly shook his head and expressed his innocence, “No…no, I really don’t understand.”</p><br/><p>“You’ve been transferred to the traffic police team for a day.”</p><br/><p>Words finished, Leader Lu no longer bothered to turn back and directly drove away, leaving Wei Han stunned in place.</p><br/><p>Putting on the traffic police clothes, Wei Han directed traffic for a day. Towards the evening, who knew, Shao Yi suddenly came over.</p><br/><p>“This is Qi Zhifan’s doing?” Shao Yi coldly taunted.</p><br/><p>Wei Han didn’t speak, face expressionless. This could also be considered as tacitly agreeing.</p><br/><p>Shao Yi crossed his arm and even more confidently said, “See, I’ve already said it: you’re not suitable. Like him, this kind of sky-proud son, he simply won’t be able to understand us. I see that in the future, you’d be sitting in the office everyday. That’s more comfortable and more enjoyable ah.”</p><br/><p>“Enough! Stop talking,” Wei Han shouted. His original bad mood became even more unbearable by Shao Yi’s reminder.</p><div><div></div></div><br/><p>“I’m sorry.” Shao Yi was stunned and somewhat regretful. Just now, he hadn’t really considered Wei Han’s state of mind.</p><br/><p>After Wei Han returned home at night, he casually cooked some dishes. He didn’t wait for Qi Zhifan to return, simply ate two bites, and then let Butler Sun keep the rest of the meal warm for Qi Zhifan to eat when he comes home. He went to wash up and sleep first.</p><br/><p>“Young Master Wei, what happened to you tonight?” Butler Sun obviously sensed an anomaly.</p><br/><p>Wei Han shook his head weakly. “It’s nothing, just a little tired.”</p><br/><p>After a while, Qi Zhifan came back from work. On seeing that Wei Han hadn’t waited for him as usual, and hearing Butler Sun say that Wei Han’s face wasn’t very good, an anxiety rose in his heart and, without saying anything further, he went upstairs.</p><br/><p>In Wei Han’s room, Wei Han had been lying down since earlier but hadn’t been able to fall asleep. Tossing and turning, he’d thought about too many things. The more he thought, the more his head hurts, becoming more and more irritable.</p><br/><p>Suddenly, someone opened the door and came in. Qi Zhifan didn’t turn on the lights nor did he say anything. Instead, he directly embraced Wei Han from behind and buried his head in Wei Han’s neck.</p><br/><p>A familiar atmosphere enveloping him, Wei Han couldn’t help twisting his body and trying to push him away. “You’re stinking with sweat. Hurry up and go take a shower.”</p><br/><p>“I knew you weren’t asleep,” Qi Zhifan hooked his lips and whispered in his ear, “I’m sorry. Don’t be angry.”</p><br/><p>Wei Han’s all kinds of abnormal performance tonight was definitely due to the fact that he was transferred to the traffic police force to direct traffic. Qi Zhifan had expected Wei Han to be a little angry and to be in a huff with him. The result was that when he’d returned, he’d discovered that Wei Han was seething with rage.</p><br/><p>He recalled that more than three years ago, Wei Han had followed Mother Wei and just arrived at the house, and had opposed him with a face always filled with arrogance. Every time they’d quarreled, Wei Han always had a mouthful of preposterous arguments. Moreover, Both of them had still gotten greatly out of hand and attacked each other. Unexpectedly after a few years, Wei Han actually became a lot more docile. Qi Zhifan also found it quite interesting.</p><br/><p>“I’m not angry.”</p><br/><p>Wei Han retorted. He knew that Qi Zhifan should be trying to keep him safe, but he was still a little bothered by him making decisions on his own.</p><br/><p>“Not angry? Then why did you eat so little tonight?” Qi Zhifan said, sucking on Wei Han’s ear while his big hand touched Wei Han’s butt.</p><br/><p>“Just had no appetite.” Wei Han shrank his neck, hurriedly evading the harassment of his “pervert little brother”.</p><br/><p>“Then that’s being angry.”</p><br/><p>Qi Zhifan wouldn’t let Wei Han dodge. Instead, he stuck closer and then kissed Wei Han, also biting his lip. He thought that Wei Han could sometimes keep such a stiff upper lip, but it was actually so soft when bitten.</p><br/><p><i>“…uhh…ohh”</i> Wei Han couldn’t take the embarrassment. Pushing Qi Zhifan aside, he suddenly thought of something. “Odd Trouble, about our matter, when are you prepared to tell to my mom and Uncle Qi?”</p><br/><p>Suddenly asked this question, Qi Zhifan stared blankly. “Are you mentally prepared?”</p><br/><p>“Not…not yet.” Wei Han honestly answered.</p><br/><p>“I knew it. Actually, I don’t care. I could tell them at any time.”</p><br/><p>“Hey, r…really?”Wei Han’s eyes flashed with surprise.</p><br/><p>“Mm, because the crux of the problem isn’t them, but my grandfather.” When he brought up Old Master Qi, Qi Zhifan suddenly became serious.</p><br/><p>The Qi family’s Old Master? He was the elder with the highest position in the Qi family, and it was said that he had always been very fond of Qi Zhifan, this grandson.</p><br/><p>“…then how are you preparing to explain it to your grandfather?”</p><br/><p>“He’s not at home now. He went abroad on vacation. Let’s talk about it again when he comes back.” Qi Zhifan was a bit tired and didn’t seem to want to directly answer this question.</p><br/><p>“Odd Trouble…”</p><br/><p>Wei Han also wanted to open his mouth and ask something, but Qi Zhifan cut him off short. He got up and tucked Wei Han in with the quilt. “Well, just go to sleep. Don’t think about it more.”</p><br/><p>“Okay.”</p><br/><p>Wei Han agreed on the surface, but in fact, there was still somewhat of a barrier in his heart.</p><hr/>Previous Chapter <br/><p></p><div><div></div></div><br/>\n</div>"}